{"based_on":"Becket  by Jean Anouilh","country":"United Kingdom United States","Awards and nominations":"The film won an Academy Award and received eleven other nominations:[6][7]","becket":"Original film poster by Sanford Kossin","distributed_by":"Paramount Pictures","Plot":"During the late 12th century, about 100 years after the Norman conquest (1066), the Normans have removed the native ruling class, replacing it with a new monarchy, aristocracy and clerical hierarchy.Thomas Becket is a Saxon protégé and facilitator to the carousing King Henry, who transforms into a man who continually invokes the \"honour of God\". Henry appoints Becket Lord Chancellor to have a close confidant in this position whom he can completely control. Instead, Becket becomes a major thorn in his side in a jurisdictional dispute. Henry finds his duties as king and his stale arranged marriage to be oppressive, and is described as the \"perennial adolescent\" by the Bishop of London. Henry is more interested in escaping his duties through drunken forays onto the hunting grounds and local brothels. He is increasingly dependent on Becket, a Saxon commoner, who arranges these debaucheries when he is not busy running Henry's court. This foments great resentment on the part of Henry's Norman noblemen, who distrust and envy this Saxon upstart, as well as the queen and Henry's mother, who see Becket as an unnatural and unseemly influence upon the royal personage.Henry finds himself in continuous conflict with the elderly Archbishop of Canterbury, who opposes the taxation of Church property to support Henry's military campaigns in France (\"Bishop, I must hire the Swiss Guards to fight for me – and no one has ever paid them off with principles!\"). During one of his campaigns in coastal France, he receives word that the old archbishop has \"gone to God's bosom\". In a burst of inspiration, Henry exercises his prerogative to pick the next Archbishop and informs an astonished Becket that he is the royal choice.Shortly thereafter, Becket sides with the Church, throwing Henry into a fury. One of the main bones of contention is Thomas' excommunication of Lord Gilbert, one of Henry's most loyal stalwarts, for seizing and ordering the killing of a priest who had been accused of sexual indiscretions with a young girl, before the priest can even be handed over for ecclesiastical trial. Gilbert then refused to acknowledge his transgressions and seek absolution.The King has a dramatic secret meeting with the Bishop of London in his cathedral (\"I have the Archbishop on my stomach, a big hard lump\"). He lays out his plan to remove the troublesome cleric through scandal and innuendo, which the position-conscious Bishop of London quickly agrees to (thus furthering Henry's already deep contempt for church higher-ups). These attempts fall flat when Becket, in full ecclesiastic garb, confronts his accusers outside the rectory and routs them, causing Henry to laugh and bitterly note the irony of it all; \"Becket is the only intelligent man in my entire kingdom ... and he is against me!\" Becket escapes to France where he encounters the conniving yet sympathetic King Louis (John Gielgud). King Louis sees in Becket a means by which he can further his favourite pastime, tormenting the arrogant English. Becket gets to Rome, where he begs the Pope to allow him to renounce his position and retire to a monastery as an ordinary priest. The Vatican is a hotbed of intrigue and political jockeying. The Pope reminds Becket that he has an obligation as a matter of principle to return to England and take a stand against civil interference in Church matters. Becket yields to this decision and asks Louis to arrange a meeting with Henry on the beaches at Normandy. Henry asks Becket whether or not he loved him and Becket replied that he loved Henry to the best of his ability. A shaky truce is declared and Becket is allowed to return to England.The remainder of the film shows Henry rapidly sinking into drunken fixation over Becket and his perceived betrayal. The barons worsen his mood by pointing out that Becket has become a folk hero among the vanquished Saxons, who are ever restive and resentful of their Norman conquerors. There are comical fights between Henry and his frumpy consort, Eleanor of Aquitaine, his dimwitted son/heir apparent, and his cold-blooded mother, who repeatedly reminds her son that his father would have quickly had someone like Becket done away with for the sake of the realm. During one of his drunken rages he asks \"Will no one rid me of this meddlesome priest?\" His faithful barons hear this and proceed quickly to Canterbury, where they put Thomas and his Saxon deputy, Brother John, to the sword. A badly shaken Henry then undergoes a penance by whipping at the hands of Saxon monks.Henry, fresh from his whipping, publicly proclaims that Thomas Becket is a saint and that the ones who killed him will be justly punished.","Production financing":"The film grossed $9,164,370 at the box office,[1] earning $3 million in rentals.[5]","language":"English","box_office":"$9.1 million[1]","Background and production":"The original French play on which the film is based was given its first performance in Paris in 1959.[citation needed] It opened on Broadway with Laurence Olivier as Becket and Anthony Quinn as King Henry II in a production directed by Peter Glenville, who later went on to direct the film version. The play opened in London in a production by Peter Hall with Eric Porter and Christopher Plummer. O'Toole was originally signed to play Henry II in the production, but broke the contract before rehearsals began to take the lead in David Lean's film of Lawrence of Arabia.[citation needed]The film was made at Shepperton Studios, England and on location at Alnwick Castle, Bamburgh Castle and Bamburgh Beach in Northumberland.[citation needed]Peter O'Toole went on to play King Henry II once more in The Lion in Winter (1968) with Katharine Hepburn as Queen Eleanor. Siân Phillips, who plays Gwendolen, was Peter O'Toole's wife at the time of filming.[citation needed]","cinematography":"Geoffrey Unsworth","production_company":"Hal Wallis Productions","directed_by":"Peter Glenville","Accuracy":"Most of the historical inaccuracies in the film are from the play, as Anouilh was writing drama rather than a history, and he took dramatic licence as would be expected.The major inaccuracy is the depiction of Becket as a Saxon who has risen to a perceived Norman social standing, when in fact the historical Thomas Becket was a Norman (while Henry was an Angevin). Anouilh did this because he had based the play on a 19th-century account that described Becket as a Saxon. He had been informed of this error before his play was produced, but decided against correcting it because it would undermine a key point of conflict, and because \"history might eventually rediscover that Becket was a Saxon, after all.\"Becket is depicted as Henry's loyal \"drinking pal\", who aids him in illicit romantic entanglements, but who becomes saintly and responsible after his appointment as Archbishop. Passing mention is made in the film of the Constitutions of Clarendon (simply as the \"Sixteen Articles\"); the struggle between Becket and Henry is boiled down to their conflict over Lord Gilbert's murder of the captive priest. In no way is Becket depicted as a man who desired special legal privileges (defrocking rather than prison) for his clergy, as some believe that he was.Henry's mother, Empress Matilda, died in 1167, three years before the treaty of Fréteval allowed Becket to return in England. Henry appears to not have any respect for his mother and treats her as something of an annoyance, a rather drastic departure from what is generally held as historical fact. Empress Matilda was Henry's sole parent for much of his childhood, and she was instrumental in shaping Henry into the fierce warrior and skilled administrator he was. Far from seeing his mother as a burden, Henry seems to have adored Matilda and relied heavily on her advice and guidance until her death.Henry's wife, Eleanor of Aquitaine, is shown publicly rebuking Henry in a scene near the end of the film, when in fact Eleanor, whatever private reservations she may have had, is not known to have ever behaved in such a manner in public. During the same scene, she says she will go to her father to complain of Henry's treatment of her; however, her father had died decades before, when Eleanor was just 15 years old. It was her father's death that made Eleanor the Duchess of Aquitaine and the most eligible bride of the 12th century, and Henry would not have married her had she not come with Aquitaine. When combined with Henry's own duchies in France, the marriage gave the royal couple control over more land in France than the actual King of France possessed at the time. Also, the film shows Henry and Eleanor as having four children, all boys. In truth Henry and Eleanor had eight children, five sons and three daughters. While the eldest son, William, had died before the events of the film, the three daughters are neglected.","release_dates":"11 March 1964 (1964-03-11)|||||","produced_by":"Hal B. Wallis","starring":"Richard Burton|Peter O'Toole|John Gielgud|Donald Wolfit|Martita Hunt|Pamela Brown|Siân Phillips|Paolo Stoppa|Gino Cervi|David Weston|","running_time":"148 minutes","music_by":"Laurence Rosenthal","edited_by":"Anne V. Coates","written_by":"Edward Anhalt","budget":"$3 million"}