{"mandarin":"Tiān Jiàng Xióng Shī","country":"China[6][7]|Hong Kong[8]|","distributed_by":"SFC Film (China)|Intercontinental Film Distributors (HK) Ltd. (Hong Kong)|Lionsgate Premiere (USA)|","literally":"\"Celestial General, Heroic Army\"","Plot":"In western China, 48 BC, a security company under China's current government called The Silk Road Protection Squad is committed towards stopping battles and promoting the idea of peace. Huo An (Chan), the captain, successfully averts a battle between the Indians and Huns. The group returns to their unnamed home city, where Huo An's wife serves as a schoolteacher for orphans. However, the government uncovers evidence that someone in the group is corrupt, causing the entire group to be sentenced to construction work at Wild Geese Gate, a ruined fortress. Once they arrive, the group pays respects at the shrine of a fallen Chinese general. They originally were child-slaves of Hun descent, but the general had later rescued them.Not long after, Wild Geese Gate is threatened by a Roman legion in need of water and supplies, among which is a boy named Publius (Waite). After a stale-mated duel between Huo An and Lucius (Cusack), the enemy general, the latter agrees not to assault the city in return for being let inside. The legion uses its superior engineering skills to speed up the construction work, an act which boosts the morale and happiness of the inhabitants, who are divided among several different races, such as Chinese, Uighur, and Turkic. Huo An returns the favor by sending men to assist Lucius's envoys in reaching the Parthian Empire. A celebration is later held and Huo An is made an honorary centurion.Lucius reveals that he and Publius are fleeing from Publius's brother Tiberius (Brody), a corrupt consul who murdered his father. As Tiberius approaches with 100,000 soldiers, Huo An insists on helping Lucius, pointing out that Tiberius is a threat to the Silk Road in its entirety. Shortly after Huo An leaves to find reinforcements, the corrupt group member from earlier sends Chinese soldiers to murder Huo An's wife and attack Wild Geese Gate. The legion is imprisoned in the non-Chinese trading city of Kroran, where Tiberius has chosen to camp. Tiberius proceeds to murder Publius.Huo An and the few loyal Chinese soldiers travel to Kroran, pretending to surrender, but once they are inside, they destroy the Roman legion's cages. However, they are unable to free Lucius, who is about to be burned to death in a special solitary cell. Huo An fires an arrow and kills Lucius before the fire gets him. As Huo An's and Lucius's soldiers are surrounded, the armies of several other races arrive and fight against Tiberius, including the Indians, Huns, Uighurs, and Turkics, all of whom are determined to preserve the Silk Road's safety. However, even their combined forces are unable to gain the upper hand. Finally, the envoys from earlier return with a massive host of Parthians, who had signed a special treaty with Tiberius's father and who intend to avenge his memory. Tiberius's soldiers lose their will to fight. Huo An challenges Tiberius to a duel and kills him.Upon hearing about the bravery of Lucius's legion, the Chinese emperor grants them the right to establish their own city, which they choose to name Regum. They accept Huo An as their commander, and Huo An, in turn, honors the deceased Chinese general by relocating the shrine to that city. As the centuries go on, the city fades from collective memory. However, in the modern day, a team of Asian American archaeologists stumble upon the site and uncover the dual Chinese and Latin inscriptions.","language":"Mandarin|English|Latin|Turkic|Kusan|White Indians|Huns|","cantonese":"Tin¹ Zeong³ Hung⁴ Si¹","box_office":"US$120 million (China)[9][10]","cinematography":"Tony Cheung","dragon_blade":"Film poster","directed_by":"Daniel Lee","traditional":"天將雄師","simplified":"天将雄师","production_companies":"Beijing Cultural Assets Chinese Film & Television Fund Home Media and Entertainment Huayi Brothers[1] Shanghai Film Group[2] Shenzhen Tencent Video Culture Communication[3] Sparkle Roll Cultural Media Visualizer Films Lionsgate Films","release_dates":"18 February 2015 (2015-02-18) (Taiwan)[4]|19 February 2015 (2015-02-19) (China)[2]|12 March 2015 (2015-03-12) (Hong Kong)|4 September 2015 (2015-09-04) (United States)||","Production":"For the role of the Roman general, Lucius, American actor Mel Gibson was initially rumored to be taking the role. During a press conference, neither Chan nor Lee confirmed Gibson's participation and Chan only said,Ultimately, the role went to John Cusack.Principal photography for Dragon Blade started on 15 April 2014 in Hengdian, China with some battle scenes. The cast and crew encountered difficult filming conditions due to the heat, their heavy costume and long filming hours. Two days later, a press conference for Dragon Blade was held at the Beijing International Film Festival where star Jackie Chan and director Daniel Lee attended and announced the film to be released in IMAX 3D on 19 February 2015, the first day of the Chinese Lunar New Year. Aside from Hengdian, production took place in Dunhuang and the Gobi Desert.[12]The film was shot with a budget of US$65 million.[1] The film was financed by Sparkle Roll Media Corporation, Huayi Brothers Media Corporation, Shanghai Film Group, Home Media & Entertainment Fund, Tencent Video and the Beijing Cultural Assets Chinese Film and Television Fund.[18] A signing ceremony for the launching of Beijing Cultural Assets Chinese Film and Television Fund also occurred there as Dragon Blade is the first film to receive an investment from the fund.[18] International distribution of the film outside of China was handled by Golden Network Asia.[3]","produced_by":"Jackie Chan|Susanna Tsang|","starring":"Jackie Chan|John Cusack|Adrien Brody|Lin Peng|Mika Wang|Choi Siwon|Xiao Yang|Wang Taili|Sammy Hung|Yoo Seung-jun|Lorie Pester|","running_time":"127 minutes 103 minutes[5] (U.S)","music_by":"Henry Lai","edited_by":"Yau Chi-wai","Release":"Dragon Blade was a commercial success in its native country, China.[19] It opened Thursday, February 19 in China and grossed US$18.7 million on the opening day.[20] Through Sunday, February 22, it had a 3-day opening weekend total of US$33 million, topping the Chinese box office[21] (US$54.8 million from Thursday - Sunday)[22] from 132,874 screenings and 8.14 million admissions.[23] Through its opening week it earned US$72 million.[24] The film fell to number three the following weekend, earning US$45.9 million (down 19%).[25] As of March 15, 2015, Dragon Blade has earned US$120 million in China alone.[10]Dragon Blade has received mixed reception, with much of the praise directed towards its large-scale battle sequences, production design, and mixing of styles from both Hollywood and East Asian cinema. On review aggregator website Rotten Tomatoes, the film has a 34% approval rating and rating average score of 4.3/10. The site's consensus reads, \"Dragon Blade is beautifully staged and choreographed, but between the battles, its talented cast is overwhelmed by a dull story and choppy editing.\"[26]Variety's Maggie Lee applauded the film for its overall technical details and concluded it to be \"a colossal entertainment with solid technique and terrific storytelling smarts\".[27] Clarence Tsui of The Hollywood Reporter complimented Dragon Blade for its filmmaking quality and screenplay for a primarily mainland Chinese production.[28]IGN awarded it a score of 6 out of 10, saying \"The story is rubbish, but Dragon Blade has some cool fight scenes thanks to Jackie Chan's action direction.\"[29] In a negative review, Gabriel Chong from MovieXclusive.com panned Dragon Blade as being \"utterly awful in every respect\", criticizing the performances of the starring cast and inconsistent changes in tone. He writes: \"Indeed, Dragon Blade is a hot mess and a spectacular misfire, not just by its star but also by its director, and if anything, further confirms that the once-promising careers of Hollywood stars John Cusack and Adrien Brody are going the way of Nicolas Cage\".[30] Claiming the movie to be \"a Chinese propagandist film\", The Hindu's Venky Vembu criticized the film's lack of subtle messages and disapproved of the characterizations, writing: \"I watched this film in 2D, but given the two-dimensional nature of the cardboard characters, I don't think the third D would have vastly enhanced my view experience.\"[31] Business Standard also labeled the film as \"Chinese torture\", but did commend the film for its action choreography and Jackie Chan's performance as the Chinese General Huo An: \"With ample footage in action and emotional scenes, [Huo An] is one of the best characters Chan has portrayed in recent years.\"[32]","written_by":"Daniel Lee","budget":"US$65 million[1]"}