{"country":"United States Germany","distributed_by":"New Line Cinema","screenplay_by":"Chris Morgan Uncredited: J. Mackye Gruber","story_by":"Larry Cohen","Plot":"Jessica Martin (Kim Basinger), a high school biology teacher, takes her son Ricky to the school bus. After she returns home, several men kidnap her and confine her in the attic of their safe house. Ethan Greer (Jason Statham), the group leader, smashes the attic's telephone. Jessica uses the wires of the broken phone and randomly dials a number. She reaches the cell phone of Ryan (Chris Evans), a carefree young man who has just been dumped by his girlfriend, Chloe (Jessica Biel).Jessica persuades Ryan to go to the police station, where he briefly reports to Mooney, but has to leave to avoid losing connection. Ethan asks Jessica about something, which she denies knowing, and leaves to get Ricky. Overhearing them, Ryan gets to Ricky's school, only to see the boy kidnapped. He hijacks a security officer's car and gives chase. When his phone battery runs out, he takes the gun in the car, cuts in line at a shop and buys a charger.Deciding to check on Ryan's kidnapping claim, Mooney goes to Jessica's house. At the house, he finds Dana Bayback (Valerie Cruz), the kidnappers' accomplice, posing as Jessica. Believing the claim is a false alarm, Mooney leaves. With Ricky in tow, Ethan returns and asks Jessica about a place her husband Craig mentioned, \"The Left Field\", and learns that it is a bar at the Los Angeles International Airport.A cross-connection between phone lines causes Ryan to rob a nearby lawyer's cell phone and car. At the airport, Ryan plants the gun on one of the kidnappers, which trips the alarm. When security intervenes, the kidnappers flash police badges and apprehend Craig. After viewing a news report of a man holding up a store for a charger, Mooney identifies Ryan and calls Jessica's home. He notices the voice on the answering machine is different from that of the woman he met.The kidnappers learns that Craig put a videotape in a bank safe deposit box. One guards Jessica and Ricky, while the rest go to the bank. Ryan finds the box first and leaves with the video camera, but loses the lawyer's cellphone. Watching the videotape, Ryan learns that Craig accidentally filmed LAPD Detective Ethan, Mad Dog, Dimitri, Bayback, Deason, and Jack Tanner (a friend of Mooney's) robbing and murdering drug dealers.Ryan steals the lawyer's car from the impound lot and retrieves his own cellphone. Mooney returns to the Martin residence, where Bayback injures him. He kills her and learns that she is also a cop. Back at the safe house, Mad Dog learns that Jessica has been trying to contact help and attacks her. Jessica cuts his brachial artery, and he bleeds to death. Before Jessica and Ricky can escape, Ethan's gang returns. Ryan contacts Ethan and makes a deal: the videotape in exchange for the Martin family at the Santa Monica Pier.Tanner convinces Mooney to go to the pier to identify Ryan. Ryan disguises himself, but is inadvertently exposed by Chloe and identified by Mooney. Tanner sends Mooney away for medical attention, arrests Ryan and brings him to Ethan. Ethan destroys the videotape, and Tanner radios the order to kill the Martins, however, Mooney overhears the radio transmission. Ryan escapes, following a distraction by his friend Chad. Mooney overpowers Dimitri and handcuffs him then returns to the pier. Tanner and Ethan confront Ryan in a boathouse. Ryan knocks out Tanner, but Ethan beats him up until Mooney intervenes. After a brief chase, Ryan notices Ethan has circled behind Mooney, and calls Ethan's cell phone. The phone's ring betrays Ethan's position, and Mooney promptly shoots him to death.On the van, Jessica strangles Deason with her handcuff chain, then frees her husband and son. However, Deason was merely stunned, and aims his gun at them. Ryan intervenes and knocks Deason unconscious. While Ryan and Mooney are being treated by medics, Tanner is also exposed, because Ryan had copied the video recording onto his cell phone, and the Martin family is set free. Jessica finally meets Ryan, the man who risked his life to save her family. When she tells him she doesn't know how to thank him, Ryan replies that he does and half-heartedly tells her to not call him again.","language":"English","Reception":"The film has had gross receipts of $32,003,620 in the U.S. and Canada and $24,419,067 in international markets for a total of $56,422,687 worldwide.Cellular received an approval rating of 55% on Rotten Tomatoes. Entertainment Weekly called the film \"pure chase-thriller excitement\",[6] and Claudia Puig of USA Today called it a \"well-paced action film in the vein of Speed\". Roger Ebert called it \"one of the year's best thrillers\". [7]Kim Basinger was nominated for a Saturn Award for Best Supporting Actress but lost to Daryl Hannah in Kill Bill Vol. 2.[citation needed]","box_office":"$56.4 million[1]","cinematography":"Gary Capo","production_company":"Electric Entertainment","directed_by":"David R. Ellis","Soundtrack":"The soundtrack for the movie was composed by John Ottman and released on October 5, 2004 via La-La Land Records label.[4][5]","Home media and remakes":"A novelization of the film was written by Pat Cadigan and released in October, 2004 by Black Flame. Cellular was released on DVD along with the VHS format on January 18, 2005. The film was released on Blu-ray on July 17, 2012.In 2008, Hong Kong action film, and a remake of the Cellular titled as Connected was co-written, produced and directed by Benny Chan. The film stars Louis Koo, Barbie Hsu, Nick Cheung and Liu Ye.","cellular":"Theatrical film poster","release_dates":"September 10, 2004 (2004-09-10)|||||","Production":"Cellular was filmed in Southern California, Santa Monica, Westwood, Los Angeles, Downtown Los Angeles, and West Los Angeles.[3]","produced_by":"Dean Devlin Lauren Lloyd","starring":"Kim Basinger Chris Evans Jason Statham William H. Macy","running_time":"94 minutes","music_by":"John Ottman","edited_by":"Eric Sears","budget":"$25 million[1]"}