{"country":"United States","distributed_by":"Universal Pictures (US) Columbia Pictures (International)","screenplay_by":"Robert Zemeckis Bob Gale","story_by":"Robert Zemeckis Bob Gale John Milius","Plot":"On Saturday, December 13, 1941 at 7:01 a.m., a woman goes swimming somewhere on the California coast, only to find a Japanese submarine surfacing beneath her. The submarine crew believes they have arrived in Hollywood, and the vessel submerges while the woman swims to safety.Later that morning, a 10th Armored Division M3 Lee tank crew, consisting of Sergeant Frank Tree, Corporal Chuck Sitarski, and Privates Foley, Reese, and Henshaw, are at a restaurant where dishwasher Wally Stephens works. Wally is planning to enter a dance contest with Betty Douglas, against the wishes of Ward, her father. Sitarski takes an instant dislike to Wally, particularly his civilian attire, and trips him. A fight ensues, leading to Wally losing his job. Wally later takes his friend Dennis shopping for a zoot suit and steals one.In Death Valley, cigar-chomping, unruly Army Air Forces Captain Wild Bill Kelso lands his Curtiss P-40 fighter near a grocery store and gas station; while refueling, Kelso accidentally blows up the station.In Los Angeles, Major General Joseph W. Stilwell attempts to keep the public calm. At a press conference at Daugherty Field in Long Beach, Captain Loomis Birkhead is attracted to the General's secretary, Donna Stratten. He lures her into a bomber to seduce her, aware that Donna is sexually aroused by airplanes. When his attempts at seduction fail, she punches him and accidentally knocks him out; as he falls, he lands on a bomb release control, sending a bomb rolling towards the podium just as the General promises, \"There will be no bombs dropped here.\" It explodes, though Stilwell escapes.At the Douglas family home in Santa Monica, Wally is told by Betty and her friend Maxine, both USO hostesses, that he cannot enter the USO dance because he is not a serviceman. Wally is forced to hide when Ward shows up. Sgt. Tree and his tank crew arrive to deliver an anti-aircraft battery; Sitarski is attracted to Betty and about to ask her to the dance when Wally falls on him from a loft. Ward and Sitarski dump him in a garbage truck.The Japanese sub becomes lost trying to find Los Angeles when the ship's compass is broken. A landing party looking for \"Hollywood\" instead captures Hollis \"Holly\" Wood, who reveals only his name, occupation, and social security number. They see he has a small Cracker Jack compass, but he swallows it. Hollis escapes, hoping to find the authorities.That night, Stilwell goes to a showing of Dumbo. Birkhead and Donna are at the 501st Bomb Disbursement Unit in Barstow, where Colonel \"Mad Man\" Maddox shows them the unit's aircraft. Maddox, convinced the Japanese are sending paratroops into the hills near Pomona, lets Birkhead and Donna borrow a plane, assuming they are going on a reconnaissance flight. Donna, stimulated by the entire experience, eagerly ravishes Birkhead during the flight.Outside the USO, Sitarski kicks aside Wally and drags Betty into the dance. Maxine tags along. Wally sneaks in by wearing a stolen Shore Patrol uniform, He steals away Betty and they win the dance contest whilst evading Sitarski, who is pursued by Maxine. As the contest ends, Sitarski finally punches Wally, setting off a brawl between soldiers and sailors.Sgt. Tree arrives with his team, just as L.A. goes to Red Alert with an unknown aircraft in the air. At the Douglas' home, Ward spots the sub. Birkhead and Donna fly over L.A., causing anti-aircraft batteries to open fire. Kelso shoots down Birkhead's plane, which lands in the La Brea Tar Pits (the crash only momentarily interrupting his tryst with Donna). Kelso then sees the submarine, only to be shot down by two spotters (who were positioned on the Ferris wheel) who mistake his plane for a Japanese fighter.Sitarski is about to make off with Betty when she is rescued by Wally, who knocks Sitarski cold. They find Kelso, who informs them about the sub. Wearing an army uniform, Wally commandeers Tree's tank and heads toward Pacific Ocean Amusement Park. Ward begins firing at the submarine, causing massive damage to his house in the process. The submarine returns fire, hitting the Ferris wheel, which rolls into the ocean. The tank sinks when the pier collapses. Kelso drives a motorbike into the ocean and swims to the submarine, where he is captured by the Japanese; undaunted, he declares, \"Turn this tub around! You're takin' me to Tokyo!\"On Sunday morning, December 14, Stilwell arrives at the remains of the Douglas home, where most of the other protagonists have gathered. Ward delivers an inspirational speech to those present, vowing that Christmas will not be ruined; to punctuate his point, he nails a wreath to his front door, jarring the unstable house so that it collapses and slides into the ocean. Stilwell mutters, \"It's gonna be a long war,\" and walks away as everyone begins arguing and fighting.","Accolades":"The film received three nominations at the 1980 Academy Awards.[23][24]Nominated:","language":"English","Reception":"Although often erroneously referred to by critics and reviewers as a box office flop, 1941 was actually a financial success. The film did not turn out to be the blockbuster the two studios were hoping for because its grosses were considered disappointing in comparison to Spielberg's previous projects, Jaws and Close Encounters of the Third Kind. Writer Bob Gale defended it in a DVD documentary:Spielberg joked at one point that he considered converting 1941 into a musical halfway into production and mused that \"in retrospect, that might have helped.\"[19] In a 1990 interview with British film pundit Barry Norman, Spielberg admitted that the mixed reception to 1941 was one of the biggest lessons of his career citing personal arrogance that had gotten in the way after the runaway success of Jaws and Close Encounters of the Third Kind. He also regretted not ceding control of 1941's action and miniature sequences (such as the Ferris wheel collapse in the film's finale) to second unit directors and model units, something which he would do in his next film - Raiders of the Lost Ark.[20] He also said \"Some people think that was an out-of-control production, but it wasn’t. What happened on the screen was pretty out of control, but the production was pretty much in control. I don’t dislike the movie at all. I’m not embarrassed by it — I just think that it wasn’t funny enough.\"Parodies of 1941 have cropped up in a number of unusual ways, including one by Spielberg himself. In an episode of Spielberg's Animaniacs, where Yakko, Wakko, and Dot inhabit a giant video store, a video copy of 1941 is used as a weapon, an exploding bomb.[21]According to Jack Nicholson, director Stanley Kubrick allegedly told Spielberg that 1941 was \"great, but not funny.\"[22]1941 currently holds a 32% rating on Rotten Tomatoes based on 22 reviews.","Musical score and soundtrack":"The musical score for 1941 was composed and conducted by John Williams. The titular march is used throughout the film and is perhaps the most memorable piece written for it. (Spielberg has said it is his favorite Williams march.) The score also includes a swing composition titled \"Swing, Swing, Swing\" composed by John Williams. In addition, the score includes a sound-alike version of Glenn Miller's \"In the Mood\", two recordings by The Andrews Sisters, \"Daddy\" and \"Down by the Ohio\", and the Irish tune \"The Rakes of Mallow\" is heard during the USO brawl. The following tracks were released on the initial Arista Records LP (and later issued on CD by Varèse Sarabande Records)The LaserDisc and DVD versions of the film have isolated music channels with additional cues not heard on the first soundtrack album.In 2011, La-La Land Records, in conjunction with Sony Music and NBCUniversal, issued an expanded 2-CD soundtrack of the complete John Williams score as recorded for the film, plus never-before-heard alternate cues, source music, and a remastered version of the original album. Disc One, containing the film score, presents the music as Williams originally conceived based on early cuts of the movie.[13][14][15]Note: * Previously unreleased; ** Contains previously unreleased material; * Traditional, Based on \"The Rakes Of Mallow,\" Arranged by John Williams; ** Including “By the Beautiful Sea” Words: Harold R.Atteridge, Music: Harry Carroll; Published by Shapiro, Bernstein & Col,Inc.; Track 16 co-written with A. H. Miles and D. Savino;Track 18, written by D. Swander and J. Hershey; and Track 22 written by W.L.Duckworth.","box_office":"$94.9 million[1]","cinematography":"William A. Fraker","production_company":"A-Team Productions Columbia Pictures Universal Pictures","directed_by":"Steven Spielberg","1941":"Theatrical release poster","Alternate versions":"The film was previewed at approximately two and a half hours, but Columbia Pictures and Universal Studios, which both had a major financial investment, felt it was too long to be a blockbuster. The initial theatrical release was edited down to just under two hours, against Spielberg's wishes.[16] After the success of his 1980 \"Special Edition\" of Close Encounters of the Third Kind, Spielberg was given permission to create his own \"extended cut\" of 1941 to represent his original director's cut. This was done for network television (it was only shown on ABC once, but it was seen years later on The Disney Channel). A similar extended version (with additional footage and a few subtle changes) was released on LaserDisc, VHS, and later on DVD.[17]On October 14, 2014, Universal Pictures Home Entertainment released 1941 on Blu-ray as part of their Steven Spielberg's Director's Collection box set. The disc features the theatrical and extended versions of the film, a documentary of the making of the film, production photographs (carried over from the LaserDisc collector's edition), and theatrical trailers, although the isolated score that was included on the Laserdisc and DVD releases is not present on the Blu-ray. The standalone Blu-ray version was released on May 5, 2015.Heavy Metal and Arrow Books produced a magazine sized comic tie in to the film, by Stephen R. Bissette & Rick Veitch, which rather than being a straight adaptation, varies wildly and humorously from the movie.[18]","release_dates":"December 14, 1979 (1979-12-14)|||||","Production":"According to Steven Spielberg's appearance in the documentary Stanley Kubrick: A Life in Pictures, Kubrick suggested that 1941 should have been marketed as a drama rather than a comedy. The chaos of the events following Pearl Harbor attack in 1941 is summarized by Dan Aykroyd's character, Sgt. Tree, who states \"he cannot stand Americans fighting Americans.\"[3]1941 is also notable as one of the few American films featuring Toshirō Mifune, a popular Japanese actor. It is also the only American film in which Mifune used his own voice in speaking Japanese and English. In his previous movies, Mifune's lines were dubbed by Paul Frees.[3]Both John Wayne and Charlton Heston were originally offered the role of Major General Stilwell with Wayne still considered for a cameo in the film. After reading the script, Wayne decided not to participate due to ill health, but also urged Spielberg to not pursue the project. Both Wayne and Heston felt the film was unpatriotic. Spielberg recalled, \"[Wayne] was really curious and so I sent him the script. He called me the next day and said he felt it was a very un-American movie, and I shouldn't waste my time making it. He said, 'You know, that was an important war, and you're making fun of a war that cost thousands of lives at Pearl Harbor. Don't joke about World War II'.\"[4]Despite John Wayne's opposition to the film, the use of the Irish folk tune The Rakes of Mallow as background music during the initial riot scene was something of an homage to his film The Quiet Man, in which the same tune was used during the protracted fistfight between Wayne's character and Victor McLaglen's.Susan Backlinie reprised her role as the first victim in Spielberg's Jaws by playing the young woman seen at the beginning of the film.[3] The gas station that Wild Bill Kelso accidentally blows up early in the film is the same one seen in Spielberg's 1971 TV film, Duel, with Lucille Benson appearing as the proprietor in both films. Inadvertent comedic effects ensued when John Belushi in character as Captain Wild Bill Kelso slipped off the wing of his airplane after being lifted by two soldiers. It was a real accident and Belushi had to be hospitalized, but the shot was left in the movie as it fit his eccentric character.[5]During the USO riot scene, when a military police officer is tossed into the window of a restaurant from the fire truck, Belushi plays the patron eating spaghetti. He is in makeup to resemble Marlon Brando in The Godfather, which he famously parodied on the sketch comedy TV series Saturday Night Live. Belushi told Spielberg he wanted to appear as a second character and the idea struck Spielberg as humorous.[3] At the beginning of the USO riot, one of the \"extras\" dressed as sailors is actor James Caan. Making his first screen appearance is Mickey Rourke as Private First Class Reese of Sgt. Tree's tank group.[6]The M3 tank Lulu Belle (named after a race horse) and fashioned from a mocked-up tractor, paid homage to its forebear in Humphrey Bogart's 1943 movie Sahara where an authentic M3 named Lulubelle was prominently featured.[7]Renowned modelmaker Greg Jein worked on the film, and would later use the hull number \"NCC-1941\" for the starship USS Bozeman in an episode of Star Trek: The Next Generation.[8]1941 is dedicated to the memory of Charlsie Bryant, a longtime script supervisor at Universal Studios. She had served in that capacity on both Jaws and Close Encounters, and would have reprised those duties with this film had she not unexpectedly died.[9]The Oscar-winning team of L.B. Abbott and A.D. Flowers were in charge of the special effects on 1941. The film is widely recognized for its Academy Award-nominated special-effects laden progressive action and camera sequences.[10][N 1]There was a scene shot for the end of the film, in which Slim Pickens's Hollis Wood character caught Christopher Lee's Nazi officer. A still from this scene appeared in the September 1990 issue of Starlog magazine.The advance teaser trailer for 1941, directed by the film's executive producer/co-story writer John Milius, featured a voice-over by Aykroyd as Belushi lands his plane and gives the audience a pep-talk to join the armed forces, else they will find one morning that \"the street signs will be written in Japanese!\"[12]","produced_by":"Buzz Feitshans","starring":"Dan Aykroyd Ned Beatty John Belushi Lorraine Gary Murray Hamilton Christopher Lee Toshirō Mifune Tim Matheson Nancy Allen Warren Oates Robert Stack Treat Williams Dianne Kay","running_time":"118 minutes","music_by":"John Williams","edited_by":"Michael Kahn","budget":"$35 million[1]"}