{"directed_by":"Tiffanie DeBartolo","Plot synopsis":"Frankie (Ione Skye) works at her uncle Leo's Cafe Blue Eyes in San Francisco (named in honor of family friend Frank Sinatra), and is hoping to meet her ideal lover, ideally one with blue eyes like Sinatra, while going to auditions with her friend Allison (Jennifer Aniston). Frankie suffers from insomnia, and has not slept through the night since childhood, when her parents were killed in a car accident. She spends most of her time at night reading. Writer David Shrader (Mackenzie Astin), takes a job at the cafe, and Frankie falls in love with him, while he attempts to cure her insomnia, she reads his writings, and the two take turns reciting philosophical quotes and guessing their source. The film is shot in black and white until Frankie sees David, when the film switches to color and David's eyes are revealed as blue. David breaks Frankie's heart when she finds out that he is engaged to a lawyer, Molly (Leslie Stevens), but he eventually chooses Frankie over his fiance, and visits her in Los Angeles, where she has joined Allison, who is exploring an acting career. The film ends with Frankie falling asleep in David's arms. A subplot has Rob (Michael Landes), the gay son of Leo (Seymour Cassel), trying to convince his father he is straight, with the help of Allison \"acting\" as his girlfriend. After Allison and Frankie leave, Rob comes out of the closet to his father, who in fact had known and accepted that Rob was gay for many years.[1]","screenplay_by":"Tiffanie DeBartolo","release_dates":"June 19, 1998 (U.S.)","produced_by":"Phyllis Housen John Hackett Christopher Lloyd Rita Rokisky","starring":"Ione Skye Jennifer Aniston","Reception":"The film earned only $26,000 domestically.[2] Rotten Tomatoes gave it a cumulative rating of 50%.[3] Jennifer Aniston's performance was praised by critics. Jeffrey M. Anderson said, \"Aniston is the breeze in this movie. I was amazed that she of all people was the only one who seemed natural. She seemed to be having a good time, and she seemed in the moment\".[4] Barbara Shulgasser found her \"terribly funny\".[5] Carlo Cavagna added that \"Jennifer Aniston, who plays Allison, Frankie's best friend, is the most watchable person in this movie. Although she doesn't deviate from the well-established Jennifer Aniston persona, she at least appears to be having fun—teasing Frankie and experimenting with funny accents.\"[6]","cinematography":"Guillermo Navarro"}