{"based_on":"30 Days of Night  by Steve Niles Ben Templesmith","country":"United States","30_days_of_night":"Teaser poster","distributed_by":"Columbia Pictures","screenplay_by":"Stuart Beattie|Brian Nelson|Steve Niles|","Novelization":"To coincide with the film's release, a novelization by Tim Lebbon was published by Pocket Star on September 25, 2007.[24] It is one of six novels based on the franchise.","Plot":"Barrow, Alaska, is preparing for its annual \"30 Days of Night\", a period during the winter when there is a month-long polar night. As the town gets ready, a stranger (Ben Foster) rows ashore from a large ship and sabotages the town's communications and transport to the outside world. Barrow's sheriff, Eben Oleson (Josh Hartnett) investigates and also learns that his estranged wife, Stella (Melissa George), missed the last plane and must stay the 30 days. That night, a coven of feral vampires, led by Marlow (Danny Huston), attack and slaughter most of the townspeople, forcing Eben, Stella, Eben's younger brother Jake (Mark Rendall), and several other survivors to take shelter in a boarded-up house with a hidden attic. Marlow finds the stranger locked up in the station. The stranger believed Marlow was going to turn him into a vampire. Marlow thanks him for doing what he asked, and then snaps his neck. Marlow comments to his fellow vampires \"What lies they will believe.\"Eighteen days later, when a blizzard hits, the group uses the whiteout to go to the general store for supplies, but are stranded after it ends. While the group heads for the station, Eben creates a diversion by having the vampires chase him to his grandmother's house, where he uses one of her ultraviolet lights to burn the face of Marlow's lover, Iris (Megan Franich), so badly that Marlow is forced to kill her. As he escapes, the town snow plow operator, Beau (Mark Boone Junior), creates another distraction with his tractor, killing many of the vampires, before trying to blow himself up; when he fails, Marlow crushes his head. Eben arrives at the station, where he is then forced to kill Carter (Nathaniel Lees), who has been bitten and is turning into a vampire.Two weeks later, Stella and Eben see the deputy, Billy (Manu Bennett), signaling them with a flashlight and bring him back to the station, after finding out he killed his family to save them from a more painful death. The trio find the others have made for the utilidor, a power and sewage treatment station that still has power, and head over there but are separated after Stella saves Gail Robbins (Rachel Maitland-Smith), a young girl who's family was slaughtered by a vampire named Zurial (John Rawls) who was stalking her. Eben and Billy make it to the utilidor but are attacked by Arvin (Andrew Stehlin), who bites Billy; Billy knocks Arvin into the heavy-duty shredder, before being killed by Eben because he is starting to turn.As the month comes to an end, with the sun due to rise, the vampires start to burn down the town to destroy evidence of their presence, and prevent any survivors from telling the world what happened. Realizing Stella is trapped and that he cannot beat the vampires in his current state, Eben turns himself into a vampire by injecting himself with Billy's infected blood. He confronts Marlow, and they get into a vicious fight, before Marlow is finally killed by having a hole punched through his head, causing the remaining vampires to flee. Knowing he will die soon, Eben and Stella go off to watch the sunrise together, sharing one last kiss. As the sun comes up, Eben's body burns to ash in Stella's arms, while she stares at the sky, coming to grips with what has happened.","language":"English","box_office":"$75.5 million[2]","cinematography":"Jo Willems","production_company":"Dark Horse Entertainment Ghost House Pictures","directed_by":"David Slade","release_dates":"October 19, 2007 (2007-10-19)|||||","Production":"30 Days of Night author Steve Niles conceived of the story in the form of a comic but after meeting a lack of interest in initial pitches tried to pitch it as a film. When this did not work out Niles shelved the idea until he showed it to IDW Publishing. IDW published the comic and Ben Templesmith provided the artwork.[3] When Niles and his agent, Jon Levin, shopped the comic around again as a potential film adaptation, Niles found that the idea \"went shockingly well,\" with Sam Raimi and Senator International picking up the property rights based on the original concept and Templesmith's unique mood and concepts for the vampires.[4]According to Raimi, the potential project was \"unlike the horror films of recent years\".[5]Following the publication of the 30 Days of Night comic book miniseries in 2002, studios, including DreamWorks, MGM and Senator International, bid in the $1 million range for rights to a potential vampire film based on the story. Raimi expressed interest in adapting the miniseries and was negotiating a production deal with his producing partner Robert Tapert to establish a label with Senator Entertainment, of which Senator International is the sales division.[6] In July 2002, Senator International acquired the rights for 30 Days of Night in a seven figure deal with Raimi and Tapert attached as producers.By October 2002, Niles was working on adapting 30 Days of Night for the big screen, keeping the film true to the miniseries, though fleshing out the characters more significantly in the adaptation process.[7] In February 2003, Columbia Pictures partnered with Senator International to work on 30 Days of Night, which was developing under Senator International's newly established production company, Ghost House Pictures. Mike Richardson, the Dark Horse Comics publisher who supported the adaptation project from the beginning, after having turned down an offer to initially publish the project, was attached as executive producer.[8] The following March, Richardson revealed that Steve Niles had turned in the initial draft for the 30 Days of Night screenplay.[9] In March 2004, however, Columbia Pictures requested that Niles's initial screenplay to be rewritten in preparation for production.[10] Sue Binder, the business manager of Ghost House Pictures, indicated that filming for 30 Days of Night was still at least a year away, as Ghost House planned to produce three films before the vampire thriller.[10] The following May, Stuart Beattie, one of the writers for Pirates of the Caribbean: The Curse of the Black Pearl, was rewriting Niles' 30 Days of Night draft for production.[11] Niles was pleased with Beattie's faithfully rewritten script, which was submitted to the studio in October 2004.[12]In September 2005, it was announced that director David Slade had signed on to 30 Days of Night, which would be distributed by Columbia Pictures mainly in North America and Mandate Pictures in international territories.[13] In March 2006, Slade revealed that screenwriter Brian Nelson, who wrote the screenplay for Slade's previous film Hard Candy, was writing a new draft of the 30 Days of Night script, replacing Beattie's draft.[14] The director said that filming would begin in summer 2006 in Alaska and New Zealand.[14]In June 2006, it was announced that Josh Hartnett was cast as the husband of the married couple that serves as the town's sheriff team.[15] Melissa George joined the 30 Days of Night cast as the wife of Hartnett's character.[16] Danny Huston joined the cast as the leader of the vampires.[17]Filming did not begin immediately, but in a September 2006 interview, executive producer Mike Richardson said that 30 Days of Night would be shot on 35 mm film, though there had been discussion to shoot the film on Genesis.[18] In an interview prior to filming, Slade explained that the illustrations of the graphic novel's illustrator, Ben Templesmith, would be reflected in production design. Slade also considered Nelson's draft to be the most faithful to the graphic novel. He also stated his intention to make a \"scary vampire film\", of which he didn't think there were many. \"The rest of them, they fall into all kinds of traps. We're going to try to do our best... and one of the ways we have to do it is be more naturalistic than the graphic novel, because it's very over-the-top,\" said Slade.[19] There was also concern expressed that while the vampires needed to communicate, talking might lessen the effect. To counter this, a fictional vampire language, with click consonants, was constructed with the help of a professor of linguistics and the nearby University of Auckland. Slade explained \"we designed this really simple language that didn't sound like any particular accent that you would be aware of, that was based around really simple actions, eating, hunting, yes, no, really basic, because that's what vampires do.\"[20]By February 2007, the production phase was completed, and a rough cut of the film was prepared.[21] In April, composer Brian Reitzell was hired to score the film.[22]Brian Reitzell composed the film's score. A soundtrack was released by Invada Records, with an artwork by Marc Bessant in summer 2015 on Vinyl.[23]","produced_by":"Ted Adams|Sam Raimi|Rob Tapert|","starring":"Josh Hartnett|Melissa George|Danny Huston|Mark Boone Junior|Ben Foster|","running_time":"113 minutes[1]","Sequel":"A straight-to-DVD sequel entitled Dark Days was released on October 5, 2010.[29] The script for the sequel was written by Steve Niles and Ben Ketai with Ketai also positioned as director. When filming began on October 20, 2009, Rhys Coiro and Mia Kirshner were named as leads, with Kirshner playing the lead vampire villain Lilith.[30] Other cast named included Harold Perrineau, Kiele Sanchez, Diora Baird, Rhys Coiro, and Monique Ganderton.[31] Three days after filming began, Niles revealed that Kiele Sanchez replaced Melissa George in the role of Stella Oleson.[32] The sequel was produced on a lower budget, but being straight-to-video allowed the writers to more closely follow the comic book.[33]","music_by":"Brian Reitzell","edited_by":"Art Jones","Release":"30 Days of Night was released in 2,855 cinemas in the United States and Canada on October 19, 2007. In its opening weekend, the film grossed $15,951,902,[2] placing first in the box office.[25] The film grossed $39,568,996 in the United States and Canada and $35,735,361 overseas. It has grossed $75,304,357 worldwide.[2]On the review aggregation site Rotten Tomatoes, the film has a 51% score based on 157 reviews, with an average rating of 5.6/10. The site's consensus states: \"While 30 Days of Night offers a few thrills, it ultimately succumbs to erratic execution.\"[26] Metacritic reports a score of 53 out of 100 from 29 reviews, considered to be mixed or average reviews.[27]30 Days of Night was released February 26, 2008 on DVD, Blu-ray, and UMD for PlayStation Portable in the United States. DVD sales brought in $26,949,780 in revenue, from 1,429,600 sold DVD units. This does not include Blu-ray sales.[28] The DVD is a single disc and includes eight featurettes, one of which is a full episode of the anime Blood+. The UK Region 2 release is a two disc special edition, released in April 2008. Despite being exactly the same as the theatrical release, the BBFC reclassified the film from a 15 to an 18. Even though it still only has the eight featurettes on the second disc, it includes a bonus 30 Days of Night graphic novel.","budget":"$30 million[2]"}