{"country":"Canada","distributed_by":"Alliance Films","defendor":"Promotional poster","Plot":"Dr. Park (Sandra Oh), a psychiatrist, is interviewing Arthur Poppington (Woody Harrelson), a vigilante known as \"Defendor\", who tells about assaulting a police officer who claims to be working undercover. Dooney (Elias Koteas) is a corrupt detective who Defendor believes is in the employ of his nemesis, \"Captain Industry\". Arthur's mother left him as a child, dying of drug abuse later; his grandfather said \"captains of industry\" killed her. Having not been properly educated, Arthur mistakenly believes it to be one person.Arthur is arrested for assaulting Dooney, but Fairbanks (Clark Johnson), the police captain in charge, connects with Arthur because their grandfathers both served in World War I. After Arthur is released, he takes his trench club and disappears. Arthur is living in the government construction depot where he works during the day. His life is very solitary, but after another confrontation with Dooney, he meets Angel (Kat Dennings), a prostitute who was smoking crack with Dooney. After he is brutally beaten by Dooney's friends, she helps him recover. She also informs him of Captain Industry's whereabouts and that his real name is Radovan Kristic (A. C. Peterson). He lets her move in with him, and enlists her help in apprehending Kristic. Angel reveals her real name is Katerina Debrofkowitz.Arthur's boss and close friend Paul (Michael Kelly) becomes concerned for Arthur after he finds that Arthur is living at the construction depot with Kat. Paul tries to help, offering Arthur the opportunity to come and live with him, which Arthur rejects. Paul gives Arthur a cell phone to use in case he is ever needed. That night, Arthur ventures out to spy on \"Captain Industry\" and Dooney, but he reveals himself. After a short chase, Arthur is beaten and shot. Paul gets Kat to take him to Arthur, and they call paramedics. While Arthur is in surgery, Paul tells Kat to leave Arthur alone. They are relieved when they find out that Arthur was shot with training bullets. Kat visits an unconscious Arthur and reveals that she ran away from home because her father was physically abusing her. After she leaves, Arthur opens his eyes, having heard everything. Angered at how Kat was treated, Arthur walks down to the mall and beats up Mr. Debrofkowitz.After Park absorbs all this, she admits his honesty is admirable. At the hearing, Arthur is defended by Paul; Paul explains that Arthur is mentally underdeveloped and its best not too harsh with him. The judge agrees on the condition Arthur doesn't don his Defendor gear again. A reporter approaches Paul and convinces him to let her run a story about Arthur as Defendor, and he agrees. People are inspired by Defendor's attempts to save lives and fight crime.Depressed about having to leave Arthur, Kat becomes desperate for a fix and tries reuniting with Dooney. However, knowing about her affiliation with Defendor, he takes her hostage and threatens Arthur against revealing anything he had learned to the police; he initially mistakes the warning as never speaking again. Arthur decides to save Kat and once again assumes his Defendor persona. Kat manages to escape from Dooney and the pair reunites. Kat is devastated when Arthur reveals he still plans to go after Kristic, and she tells him that she lied about the identity of Captain Industry.Defendor manages to subdue the henchmen, but is shot repeatedly by Kristic. Arthur accuses him of killing his mother, and Kristic recognizes her name, implying he truly was responsible for her death. As Arthur lies dying, Kat runs to help him. She promises to stop smoking crack and get a job. In an earlier conversation, Kat had revealed she had always had a talent in writing, which Arthur had described as being \"like Lois Lane\". She promises to be like her as Arthur dies in her arms.Dooney and Kristic are arrested. Dooney is sentenced to 26 years in prison and Kristic is extradited to his home country. A memorial service is held for Defendor under a spray paint mural that was drawn in his honor, which is attended by Park and her daughter. The film ends with Kat sitting at her typewriter, writing stories about Arthur for a newspaper.","language":"English","Reception":"Defendor received mixed reviews. On review aggregation website Rotten Tomatoes, the film has a 68% \"fresh\" rating based on 19 reviews, with an average score of 6.2/10 – many praising Woody Harrelson's performance as the driving force of the film. Linda Barnard of the Toronto Star wrote writer/director Stebbings \"fills Defendor with humorous bits, comic treats dropped in quickly and without fanfare\", while David Germain of the Associated Press faults the film for its \"inconsistent tone\".[19]","box_office":"$44,462 (USA)[1]","cinematography":"David Greene","production_company":"Darius Films Alliance Films","directed_by":"Peter Stebbings","release_dates":"September 12, 2009 (2009-09-12) (TIFF)|February 19, 2010 (2010-02-19) (Canada)||||","Production":"Defendor is actor Peter Stebbings' first produced screenplay and his debut as a director.[5] He wrote the first draft of his Defendor script in 2005 when the idea came to him \"in one whole piece\".[5] He failed to sell the script to numerous major Hollywood studios because it did not fit into a particular genre; he said that \"[The studios] didn't want to touch it, but all the actors and their agents wanted to.\"[8] Nicholas Tabarrok of independent production company Darius Films agreed to back the project after he \"was hooked from the very first read\", and agreed to fly Stebbings from Toronto to Los Angeles so that he could meet the actors.[9] Ellen Page was at one stage attached to star when production was slated to begin in 2007, but pulled out.[10] He collected financing from Canadian film fund Telefilm Canada—about one quarter of the film's C$4 million budget—and \"turn[ed] over stones to find the rest\". After he added all of his personal savings, the film was still $100,000 under its financial requirements.[5] Though principal photography was scheduled to take place from November 21 through December 17, 2008,[9] it was delayed until mid-January 2009 and continued through the end of January.[5][11] Filming took place in and around in Toronto and Hamilton, Ontario.[9] Specific filming locations included the Hamilton City Centre,[12] Humber River Regional Hospital and a Toronto warehouse.[9]The producers consulted with workers from Toronto's social services and prostitute and decriminalization of sex workers activist Wendy Babcock,[13] to help Kat Dennings develop her character; they wanted people with experience using crack cocaine and doing sex work so she could create a more realistic character.","produced_by":"Nicholas Tabarrok","starring":"Woody Harrelson Elias Koteas Michael Kelly Sandra Oh Kat Dennings","running_time":"101 minutes","music_by":"John Rowley","edited_by":"Geoff Ashenhurst","Release":"Defendor had its world premiere at the 2009 Toronto International Film Festival in September.[14] Sony Pictures Worldwide Acquisitions Group acquired the distribution rights to the film in the United States and most of Asia, Europe and South America. The Canadian rights were pre-sold to Alliance Films as part of the film's financing deals.[15]However, Sony Pictures Worldwide Acquisitions Group decided to not release the film in the United States theatrically, so Darius Films (which produced the film) self-released the film in the United States theatrically on February 26, 2010.[16][17][18] It has also been released to DVD on April 13, 2010.[2]","written_by":"Peter Stebbings","budget":"C$4 million"}