{"country":"United States","distributed_by":"Buena Vista Distribution","Plot":"Steve Walker (Dean Jones) arrives in a Maryland seacoast town, to take the position of track coach at Godolphin College. The night of his arrival coincides with a charity bazaar at the hotel where he will be boarding — Blackbeard's Inn, named after the notorious English pirate Captain Edward Teach and now run by the Daughters of the Buccaneers, elderly descendants of the pirate's crew. The owners are attempting to pay off their mortgage to keep the inn from being bought by the local crime boss, Silky Seymour (Joby Baker), who wants to build a casino on the land. Steve quickly discovers his track team's shortcomings and runs afoul of the dean of Godolphin College, its football coach, and Seymour. He also makes the acquaintance of attractive Godolphin professor Jo Anne Baker (Suzanne Pleshette), who is anxious to help the elderly ladies save Blackbeard's Inn.After a bidding war with the football coach at the charity auction, Steve wins an antique bed warmer once owned by Blackbeard's 10th wife, Aldetha Teach. Aldetha had a reputation of being a witch. Inside the hollow wooden handle of this bed warmer is hidden a book of magic spells that had once been the property of Aldetha. Steve recites, on a lark, a spell \"to bring to your eyes and ears one who is bound in Limbo\", unintentionally conjuring up the ghost of Blackbeard (Peter Ustinov), who appears as a socially-inappropriate drunkard. His wife cursed him to an existence in limbo unless he can perform a good deed.Steve and Blackbeard are bound to one another by the power of the spell, and only the very reluctant Steve can see or hear the ghost. As a result, Steve must deal with the antics of the wayward pirate while attempting to revive Godolphin's track team and form a relationship with Jo Anne. Steve is falsely arrested for drunk driving when Blackbeard attempts to drive Steve's automobile, steering it like a pirate ship. Because the arresting officer can't see Blackbeard (and because Blackbeard's erratic driving caused the cop's motorcycle to crash into a tree), Steve spends a night in jail. While in jail, Steve reminds Blackbeard that if he does a good deed, his curse will be broken. Steve asks Blackbeard for his treasure to help the Daughters of the Buccaneers save the inn, but Blackbeard admits that he spent all of the money. Steve decides not to trust Blackbeard.Steve is released from jail the next morning due to lack of evidence, however, Steve is put on probation with the college, having to win the big track meet, or he would be fired from his position. The problem was that Steve's team looked sorrowfully weak, and did not have a chance at winning. Blackbeard is firmly told by Steve, more than once, not to interfere with the boys on his team Blackbeard creates further complications by stealing one of the Inn's mortgage payments and betting it on Steve's track team. Blackbeard's intention is to use his ghostly powers to help Godolphin win the track meet, and then use the winnings to pay the mortgage in full. Steve is at first outraged by the pirate's interference, but he decides the greater good is to win the money for the sake of the Inn. He also accepts the pirate's help in shaking down Silky Seymour and his thugs after Seymour refuses to pay out the winnings from the bet.With the mortgage paid, Blackbeard has performed his good deed and is released from the curse. After Steve asks the ladies and Jo Anne to recite the spell (Kree kruh vergo gebba kalto kree), thereby rendering Blackbeard visible to them, Blackbeard bids them all a cordial goodbye and departs to join his former crew, leaving Steve and Jo Anne to pursue their future together.","language":"English","Reception":"Blackbeard's Ghost received positive reviews from critics and audiences, earning a Rotten Tomatoes approval rating of 80%.The film earned $5 million in theatrical rentals in North America.[2]","Differences from the Ben Stahl novel":"In the original novel, instead of a track coach, two teenage boys find the book that brings the ghost of Blackbeard back to Godolphin. In addition, Peter Ustinov portrays the pirate Blackbeard as a charming individual in contrast with Stahl's version of the character.","box_office":"$21,540,050[1]","cinematography":"Edward Colman","production_company":"Walt Disney Productions","directed_by":"Robert Stevenson","blackbeard's_ghost":"Blackbeard's Ghost theatrical poster","release_dates":"February 8, 1968 (1968-02-08)|||||","produced_by":"Bill Walsh","starring":"Peter Ustinov Dean Jones Suzanne Pleshette","running_time":"106 minutes","music_by":"Robert F. Brunner","edited_by":"Robert Stafford","written_by":"Ben Stahl (book) Don DaGradi Bill Walsh"}