{"country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Richard English Francis Swann","Plot":"Knowing how much telephone repairman Mal Granger (Edmond O'Brien) likes to bet on the horses, small-time bookmaker Chippie Evans (Sammy White) proposes a scheme in which Granger's technical expertise would provide gangster Vince Walters (Barry Kelley) with race results in advance.Granger accepts and also takes an interest in Walters' attractive assistant, Trudy (Dorothy Patrick), but she is arrested. Granger's new method of getting track information to the bookies makes him invaluable. He threatens to cut Walters off unless he is made a 20% partner. Walters gives in. When Walters tries to collect from a bookie who owes him, the bookie kills first Walters, then himself. Granger takes control of the wire service, making him a target for Lieutenant Wright (Howard St. John) of the Los Angeles Police.East Coast mobster Larry Mason (Don Porter) is sent by boss Karl Stevens (Otto Kruger) to persuade Granger to join the Syndicate. He travels west with his wife Gail (Joanne Dru). Granger decides to accept a 50/50 split with his new partners. Some of the independent bookies do not like the new arrangement (and the extra 20% \"protection\" fee) and refuse to go along. They are roughed up by Syndicate goons.Trudy returns to work for Granger; she finds out he is being shortchanged. When he complains, Granger is told that the shortfall is due to \"necessary expenses.\" He vows to get his money.Granger and Gail are strongly attracted to each other. Mason beats Gail, after which Granger hires a hitman named Gizzi (Robert Osterloh) to kill Mason with a rifle. Gizzi decides to blackmail Granger, who agrees to pay $25,000 at a rendezvous at the Malibu Pier, but there Gizzi announces he intends to become Granger's silent partner. Granger crushes him to death against the pier's railing with his car.Using his telephone know-how, Granger places a call to Wright that makes it appear he is in Palm Springs and has an alibi. Wright tapes the call and hears a streetcar whistle; there are no streetcars in Palm Springs. The police eventually match the paint from Granger's damaged car to Gizzi's murder.Granger decides to retire and escape to Guatemala, but first, he sets out to collect what is owed to him. With the help of Gail and Chippie, he taps into a phone line to a mob betting parlor in Las Vegas and pulls off a pass-post swindle. Intercepting and taping race results to be replayed after a two-minute delay, he gives Gail and Chippie time to place substantial bets. Chippie, however, is recognized by a man who bears a grudge against Granger. He tells Stevens, who has Chippie brought to him and learns where Granger can be found. Stevens passes the information along to Wright, content to let the police rid him of a troublesome colleague.With the police closing in, Granger and Gail flee to Boulder Dam, trying to cross state lines to get out of Wright's jurisdiction, but encounter a roadblock there. They join a tour group and descend into the dam. Gail collapses from fatigue while running, then Granger is killed before he can find his way to the Arizona side.","language":"English","Reception":"When the film was first released, The New York Times film critic Bosley Crowther panned the film, writing, \"Despite some considerable advertising of 711 Ocean Drive as a daring and courageous revelation of the big bookmaking and gambling syndicates, this modest Columbia melodrama, which came to the Paramount yesterday, is no more than an average crime picture with some colorful but vague details thrown in. Certainly no one who reads the papers with a fairly retentive eye can have any less comprehension of the gambling racket than is illustrated here...In short, this little picture, conventionally written but well photographed, does no more than any gangster picture in reminding us that gangsters are crooks.\"[3]However, the staff at Variety magazine wrote well of the film: \"Operations of the syndicates are given a realistic touch by the screenplay, and Joseph M. Newman's direction keeps action at a fast pace. O'Brien is excellent as the hot-tempered, ambitious young syndicate chief.\"[4]","cinematography":"Franz Planer","production_company":"Frank Seltzer Productions","directed_by":"Joseph M. Newman","release_dates":"July 1, 1950 (1950-07-01) (United States)|||||","produced_by":"Frank N. Seltzer","starring":"Edmond O'Brien Joanne Dru Otto Kruger","running_time":"102 minutes","711_ocean_drive":"Theatrical release poster","music_by":"Sol Kaplan","edited_by":"Bert Jordan"}