{"country":"United States","distributed_by":"New World Pictures","Plot":"Jack Watson (George Burns) is a millionaire playboy and businessman who is about to turn 81 years old just as his grandson David (Charlie Schlatter) is about to turn 18, but Jack laments his old age and wishes to get back to his teens once more. When an accident switches their souls, Jack gets to live his grandson's life and all that it entails: school, sports and romance. Unfortunately, David gets the \"short end of the deal,\" as not only is he trapped in his grandfather's 81-year-old body, but he is also in a coma. The only one who knows the truth is his longtime friend Charlie (Red Buttons), whom Jack was able to convince by recounting experiences only they knew.Jack gets to approach his family from a fresh point of view and doesn't always like what he sees: he's been a distant parent for his son Arnie (Tony Roberts) and has repeatedly disregarded his ideas for improving the family company. The college fraternity that he coerced David into joining (his old alma mater) is bullying him on a regular basis and forcing him to write their test finals for them. He also finds out that his trophy wife Madeline (Anita Morris) is unfaithful when she tries to seduce him, whom she thinks is her young step-grandson. Deciding to set things right, Jack in David's body decides to take charge by convincing his father (or rather, Jack's son) to implement his ideas on the family business and uses his poker playing skills to beat the frat boys while betting $1000 that he will beat the lead frat boy Russ in the upcoming track meet. Jack also impresses a girl named Robin, who is taken with David's old-fashioned style with bow ties and his vividly recounting the Second World War and meeting President Truman.However, Jack realizes too late that he has willed everything to Madeline, who convinces Arnie and his wife to disconnect Jack's 81-year-old body from life support. Knowing that this will kill David, Jack and Charlie rush to the hospital to prevent this,wheeling Jack's body away. When they crash in the hospital chapel, Jack and David's minds are returned to their rightful bodies, and Jack awakens. Jack still has unfinished business, as in David's body he challenged the fraternity president to a race, and now David must face him. Jack gives David a pep talk, and David beats the frat president. Jack then encourages David to pursue an interested Robin. In private, Jack tells Arnie that his greatest mistake was trying to get him and David to relive his own life, and encourages Arnie to nurture David's interest in art, which Jack will do as well by getting David involved in the graphic design aspect of the family business. Finally, Jack confronts Madeline by saying he knows that she made a pass at David, and that he has rewritten his will to include his family and his faithful butler Horton (Bernard Fox), whom he promptly orders to have Madeline thrown out. Robin and David start their relationship","language":"English","Reception":"Roger Ebert gives the film a score of 1 and a half out of 4. He compares it to Like Father Like Son and Vice Versa, calling Vice Versa the best of the three, by far.[2] Janet Maslin was critical of the film for leaving George Burns in a coma when he is who the audience came to see, and says that it \"isn't successfully aimed at anyone in particular\".[3]","box_office":"$2,567,099","cinematography":"Stephen M. Katz","directed_by":"Paul Flaherty","18_again!":"Theatrical release poster","release_dates":"April 8, 1988 (United States)","produced_by":"Walter Coblenz","starring":"George Burns|Charlie Schlatter|Tony Roberts|Anita Morris|Red Buttons|","running_time":"93 minutes","music_by":"Billy Goldenberg","edited_by":"Danford B. Greene","written_by":"Josh Goldstein Jonathan Prince"}