{"based_on":"All The King's Men  by Robert Penn Warren","country":"United States","distributed_by":"Columbia Pictures","Plot":"Louisiana newspaper reporter Jack Burden takes a personal interest in Willie Stark, an idealistic small-town lawyer. Circumstances develop that result in Stark's being urged to run for governor by a local political leader, Tiny Duffy. Jack has been raised around politics. He is the former lover of Anne Stanton, whose father was once governor. Jack was raised by his godfather Judge Irwin, an honorable man.In time, Jack and political strategist Sadie Burke reveal to Stark that he is a dupe in the governor's race, expected to split the vote, spout the party line and lose. Stark vows not to be fooled again. He defies Duffy publicly and begins to give speeches with straightforward talk that the public appreciates. He becomes governor in the next election, using any means necessary. Duffy now works for him as lieutenant governor. He also has a silent, menacing driver and bodyguard called Sugar Boy. Finally, he recruits Jack to work for him as an adviser.Judge Irwin disapproves, seeing Stark as an opportunist. Anne Stanton seems to agree and so does her brother, Dr. Adam Stanton. Willie Stark is a persuasive man and knows how to get his way. He intends to build a new public hospital and convinces Dr. Stanton, an idealist, to run it for him. He also begins an affair with Anne Stanton, provoking Sadie's jealousy and Jack's disappointment.Criticized publicly by Judge Irwin and embroiled in increasing political controversy, Stark demands that Jack dig up dirt on the judge to be used against him. Jack insists that no such dirt exists, but he uncovers evidence that, many years ago, Judge Irwin accepted a bribe to get his job. Following this revelation, the judge commits suicide, and Jack suffers great guilt.Stark embraces various corruption necessary to consolidate his power, using patronage and intimidation to get his way. Told that the hospital is a fraudulent front project to enable the governor to rob the state and frame him (although Anne and Jack both say this is not true), Dr. Stanton becomes incensed when he learns of Stark's relationship with his sister. He waits at the state capitol and assassinates Stark, and is shot and killed in turn by the governor's bodyguard.The truth is that the murder was influenced by Sadie and Duffy, the latter with the intention to become governor after Stark's death.","language":"English","Reception":"In spite of its high-profile cast, direction and production team, the film was a massive failure, both with critics and at the box office. Review aggregate Rotten Tomatoes gave it a \"Rotten\" rating of 11%, based on 153 reviews with a consensus stating \"With a scenery-chewing performance from Sean Penn, an absence of political insight, and an overall lack of narrative cohesiveness, these Men give Oscar bait a bad name.\"A. O. Scott (New York Times) expressed disappointment with the film: \"Nothing in the picture works. It is both overwrought and tedious, its complicated narrative bogging down in lyrical voiceover, long flashbacks and endless expository conversations between people speaking radically incompatible accents.\"[3] Michael Medved gave All the King's Men two stars (out of four) calling it \"depressing and disappointing\", a \"stodgy melodrama\" and a \"pointless, pretentious, plodding period-piece\".[4]There were, however, a few critics who endorsed it. Richard Schickel (Time Magazine) liked the movie, arguing that \"it's much more faithful to the tone of the novel\" than the original.[5] Kenneth Turan (Los Angeles Times) praised the film's \"undeniable moral seriousness\" and the actors' \"exceptional ensemble work.\" He argued that Zaillian's script and direction \"expertly extracted the core of this greatest of American political novels, a work that is both of its time and outside it.\"[6]","all_the_king's_men":"Promotional poster","box_office":"$9.5 million","cinematography":"Paweł Edelman","production_company":"Relativity Media Phoenix Pictures","directed_by":"Steven Zaillian","Soundtrack":"The film's score was composed by James Horner, who had previously worked with Zallian on Searching For Bobby Fischer.","release_dates":"September 22, 2006 (2006-09-22)|||||","Production":"Filming took place in New Orleans, Morgan City, Donaldsonville, at the Louisiana State Capitol in Baton Rouge and many other places in Louisiana.The film garnered strong Oscar \"buzz\" before its initial opening.[1] Entertainment Weekly in its August 18, 2006 issue included All the King's Men in its Oscar Preview, and said the film was most likely to win an Oscar.The world premiere was held at the Toronto Film Festival[2] on September 11, 2006, where the film was first screened to the press. A special screening was held at the Tulane University in New Orleans on September 16, 2006.","produced_by":"Ken Lemberger Mike Medavoy Arnold Messer Steven Zaillian","starring":"Sean Penn Jude Law Kate Winslet James Gandolfini Mark Ruffalo Patricia Clarkson Jackie Earle Haley Anthony Hopkins","running_time":"125 minutes","Aftermath":"Recently, the film was featured in Nathan Rabin's ongoing blog feature for The Onion's A.V. Club, \"My Year of Flops\". Of three categories (failure, fiasco, or secret success), he labeled All the King's Men as a failure and said of the film: \"Zaillian’s dud manages the formidable feat of being at once histrionic and agonizingly dull, hysterically over-the-top yet strangely lifeless.\"[7]Zaillian was stunned by the poor critical and box-office results of this film, which opened with only $3.8 million and barely made $7.2 million at the end of its run in US theaters. Another new wide release from the same weekend, Jackass Number Two, made $28.1 million. In an interview with the Los Angeles Times, Zaillian said that the film's poor performance was \"like getting hit by a truck. ... I don't know what to make of it.\"[8]","music_by":"James Horner","edited_by":"Wayne Wahrman","written_by":"Steven Zaillian","budget":"$55 million"}