{"country":"United Kingdom United States","distributed_by":"Universal Pictures (UK) Focus Features (US)","Plot":"The film opens with a crowded London market (borough market) being destroyed through an explosive terrorist attack. Farroukh Erdogan is detained as the primary suspect and mastermind of the attack while his two alleged co-conspirators are killed in attempts to apprehend them (unseen to the viewer).Barristers Martin Rose and Claudia Simmons-Howe are selected by the British Attorney General to represent Farroukh in court after the previous barrister fell off a roof. The two barristers secretly had an affair in the past, which became known to Martin's wife and has caused an alienation from her and their son. Due to the classified nature of the sources in the trial, the trial is split into two divisions. Claudia will represent Farroukh in closed hearings to attempt to determine which classified pieces of information are required for his defense. Martin will represent him in the open trial using information allowed by the closed hearings. The two barristers are not allowed to contact one another. Claudia is watched over by MI5 agent Nazrul Sharma with very strict rules of accessing the classified information. Martin is assisted by friend and lawyer Devlin.The case quickly turns mysterious for both barristers. Farroukh and his family refuse to talk and simply state he's guilty. Martin and Claudia notice signs that they're secretly being monitored. Investigation into peculiar aspects of Farroukh's past leads Martin to discover that Farroukh was a secret MI5 agent, who had been planted in a terrorist cell in London. It is never revealed whether Farroukh double-crossed MI5 or if the cell double-crossed him, but in either case, the terrorist attack was accidentally funded by MI5. MI5 is willing to kill to keep this secret, and Farroukh and his family are admitting guilt in order to avoid assassination. Meanwhile, a prominent American journalist, Joanna Reece attempts to get close to Martin in order to get information about the trial, but Martin is one step ahead. He eventually gets Joanna's help by sharing information she has on the case (though Reece is mysteriously murdered soon after).Martin secretly passes this information to Claudia. She brings the information forward in the first closed hearing while questioning high-ranking MI5 agent Melissa. The judge demands that Farroukh's son testify the following day as he was a major informant for MI5 in the case. When Claudia returns home, an assassin attempts to kill her, but she manages to escape. Farroukh's son realizes he is going to be killed and escapes surveillance. Martin, Claudia, and Farroukh's son spend the night evading Melissa and Nazrul, during which Devlin is revealed to be working with MI5. The trio manage to deliver Farroukh's son to the closed hearing where he testifies, but Nazrul kills Farroukh in prison and makes it appear as a suicide, rendering the case closed. The Attorney General threatens Martin in private, saying that he purposefully assigned Martin and Claudia to the case due to knowing their secret history, and if he does not remain quiet about what Martin found during the trial, he'll have the duo of barristers disbarred for their conduct during the trial.The closing audio of the film reveals the conspiracy is eventually revealed to the public.","closed_circuit":"Theatrical release poster","language":"English","Reception":"Closed Circuit has received mixed reviews from critics; it currently holds a 42% rating on Rotten Tomatoes based on 128 reviews.[6] On another film aggregator, Metacritic, the film has a score of 50 (out of 100), based on 39 critics.[7]","box_office":"$6.3 million[2][3]","cinematography":"Adriano Goldman","production_company":"Working Title Films","directed_by":"John Crowley","release_dates":"August 28, 2013 (2013-08-28) (US)|November 1, 2013 (2013-11-01) (UK)||||","produced_by":"Tim Bevan Eric Fellner Chris Clark","starring":"Eric Bana Rebecca Hall Riz Ahmed Ciarán Hinds Jim Broadbent","running_time":"96 minutes[1]","music_by":"Joby Talbot","edited_by":"Lucia Zucchetti","written_by":"Steven Knight"}