{"country":"United States","distributed_by":"Orion Pictures Corporation","screenplay_by":"Michael Schiffer","story_by":"Richard Di Lello Michael Schiffer","Plot":"Two white cops, Bob \"Uncle Bob\" Hodges (Robert Duvall) a respected, 19-year LAPD veteran and rookie officer Danny McGavin (Sean Penn) have just been teamed together in the C.R.A.S.H. unit that patrols East L.A. and South central.The older cop is appreciated on the local streets. He is diplomatic on the surface, preaching \"rapport\" to gang members to encourage them to offer help when it is truly needed and recognizes that every action cops take is scrutinized by the very people they are trying to help. Hodges explains his view on policing to his young partner with a joke about bulls and cows. Although the pair bond quickly, life lessons are seemingly lost on the aggressive, cavalier McGavin, whose stunted actions soon bring him quick notoriety with the local gang members and the people themselves, such as attacking a graffiti artist by spraying his eyes with the paint can. When McGavin wrecks their first unmarked car during a pursuit, its replacement, painted a vivid yellow, results in McGavin being nicknamed \"Pac-Man\" by officers and gang members alike.McGavin also has a short lived romance with a waitress named Louisa (María Conchita Alonso) who, like the offended Hodges, feels the weight of the Pac-Man persona. Amidst the strains of these relationships, the murder of a Bloods gang member leads to a series of escalations between two other street gangs. A series of seemingly random incidents culminates in a plot that finds the two partners in the middle of the Crips, Bloods and Hispanic Barrio war. The 21st Street Gang, led by a criminal named Frog, attempts to negotiate a peace similar to Hodges and steer clear of the melee. To protect his partner, Hodges unwittingly exposes Frog as his source on the Crips leader Rocket (Don Cheadle) with his scheme to kill McGavin. Each group attempts to right the wrongs against their respective crews as police work to prevent the hit and stand their authority over the fall out.In the end, the unit moves in on the would-be last crew standing - the 21st Street Gang. While arresting Frog, Hodges is fatally shot by a gunman trying to enact the hit on McGavin. With medics en route, McGavin comforts Hodges and breaks down with regret as the elder partner falls into delirium and dies.Sometime later, a more conservative McGavin has a rookie partner, a black cop who grew up in the neighborhood where they patrol and sports an attitude similar to the \"Pac-Man\". McGavin tells him the same joke about the bulls that Hodges taught him and he reciprocates the advice just the same as he did. The film ends with McGavin considering the cycle as the pair drive on and continue their patrol.","language":"English/Spanish","Reception":"The movie received both praise and criticism.[2][3][4][5] It holds an 82% \"Fresh\" rating on Rotten Tomatoes from 28 reviews.[6]The movie earned over 46 million dollars in its domestic release.[7]","box_office":"$46,616,067 (domestic)","colors":"Original film poster","cinematography":"Haskell Wexler","directed_by":"Dennis Hopper","Soundtrack":"A soundtrack containing mainly hip-hop music was released on April 15, 1988, by Warner Bros. Records. It peaked at 31 on the Billboard 200 and was certified gold on July 12, 1988.","release_dates":"April 15, 1988 (US)","Production":"The movie was filmed entirely in Los Angeles in 1987. The original script by Richard Di Lello took place in Chicago and was more about drug dealing than gang members. Dennis Hopper ordered changes, so Michael Schiffer was hired and the setting was changed to Los Angeles and the focus of the story became more about the world of gang members.The joke that Hodges tells McGavin regarding the two bulls was lifted from the Pat Conroy novel \"The Great Santini\" and explains how the character Lt. Col. \"Bull\" Meechum got his nickname.[1]Real gang members were hired as guardians as well as actors by producer Robert H. Solo. Two of them were shot during filming.On April 2, 1987, Sean Penn was arrested for punching an extra on the set of this film who was taking photos of Penn without permission. Penn was sentenced to 33 days in jail for this assault.","produced_by":"Robert H. Solo","starring":"Sean Penn|Robert Duvall|María Conchita Alonso|","running_time":"120 min. (original release) 127 min. (Director's Cut on Orion Home Video)","music_by":"Herbie Hancock","edited_by":"Robert Estrin","budget":"$10 million"}