{"country":"United States","chicken_every_sunday":"Original poster","distributed_by":"20th Century Fox","Plot":"In Tucson, Arizona in 1910, Emily Hefferen visits attorney Robert Hart to file for divorce from her husband Jim, citing his lack of support as grounds. When Hart expresses surprise, given the local hotel, laundry, and dairy bear the Heffernen name, suggesting the family is wealthy, Emily describes her family life for the past twenty years.On their wedding day, Emily, discovers Jim, vice-president of the bank, has either donated or lost all his money on bad investments. In order to make ends meet, she takes in another newlywed couple as boarders in their home on the edge of town. As time passes and each of Jim's new moneymaking schemes fails, his wife takes in new boarders in order to make the monthly mortgage payment.Over the years Jim's time increasingly is consumed by his attention to various business ventures, including a hospital, laundry, restaurant, dairy, opera house, and hotel. Every time he starts a new business, Emily adds another room to the house to accommodate more boarders, in addition to their growing family.At daughter Rosemary's high school graduation ceremony, Jim learns the bank is foreclosing the hotel, and Emily resigns herself to being the family's primary breadwinner. Jim decides to mine a nearby arroyo for copper, and when he learns new roomer Rita Kirby's abandoned husband George owns a New Jersey construction company, he invites the man to come to Tucson in the hope he'll invest in his latest project. George arrives with his inebriated mother-in-law, ex-vaudeville entertainer Minnie Moon, but he refuses to discuss any business propositions until he sorts through his personal problems, although he gives Emily a $250 check, which is enough money to pay off the mortgage on their home. When the owner of the arroyo threatens to close the mine unless Jim purchases the property immediately, he secretly takes out a new mortgage, hoping to buy it back after George invests in the venture. However, water instead of copper is found on the land, and all dealings with George end, and banker Sam Howell begins to repossess the Hefferen's furniture.Having concluded telling Hart her story, Emily returns home and finds the furniture being returned, thanks to the kindness of Jim's friends, who paid off the loan. Jim, ashamed he has not provided for his family, prepares to leave. Rosemary reminds her mother that without Jim the town never would have had a hospital, laundry, restaurant, dairy, opera house, and hotel. Emily realizes her marriage is filled with the love required for a couple to overcome their trials and tribulations and urges Jim to stay.","language":"English","Critical reception":"Bosley Crowther of the New York Times said the film \"is larded with rich and wholesome portions of nourishing Ma-Loves-Pa and it is seasoned with more than generous sprinklings of standard bucolic farce. But like any average menu which comes at you too many times, this one, with its obvious repetitions, tends to monotony . . . Mr. Dailey persistently offers himself as a slick and saucy gent who would be much more believable as a vaudevillian than he is as a small-town idea-man. In fact, his performance is so fashioned to the conventions of musical shows that one has a feeling of frustration when he doesn't grab occasional cues for songs. Miss Holm, too, is somewhat unsuited to the sentiments of a domestic role. Every so often, one trembles lest her Mama break out in travesty. And although her bantering humors with Mr. Dailey are generally smooth, they are not precisely the conduct of a middle-aged Mama with her spouse. It is just a bit disappointing that Mr. Seaton, who has heretofore got so much freshness in previous pictures — Miracle on 34th Street and Apartment for Peggy, notably — should have let this Chicken Every Sunday stew along in a much-warmed pot.\"[3]TV Guide rated the film 2½ out of four stars and called it \"light comedy . . . amusing, but poorly directed.\"[4]","cinematography":"Harry Jackson","directed_by":"George Seaton","release_dates":"January 18, 1949","Production":"Warner Bros. originally bought the film rights to Rosemary Taylor's novel in August 1944, and the Epstein brothers fashioned a script from the stage play they had adapted from Taylor's book. Mervyn LeRoy was signed to direct the film, but Warners then sold the property to 20th Century Fox. Mary C. McCall, Jr. wrote a treatment of the story, but final credit for the screenplay went to director George Seaton and Valentine Davies.[2]Among the actors rumored to be considered for or actually cast in major roles before filming began were John Payne, Maureen O'Hara, Henry Fonda, Jeanne Crain, and Florence Bates. The film was shot on location in the Tucson Mountains and in the Nevada towns of Gardnerville, Minden, Carson City, Virginia City, and Silver City.[2]In June 1956, The 20th Century Fox Hour, an hour-long anthology series broadcast by CBS, aired The Hefferen Family, based on the Taylor novel. Three years later, Julius J. Epstein, the estate of his late brother Philip, and Taylor filed a copyright infringement/breach of contract suit against the film studio, claiming Fox did not own the television rights to the story. The case was settled out of court for $100,000.[2]","produced_by":"William Perlberg","starring":"Dan Dailey Celeste Holm","running_time":"94 minutes","music_by":"Alfred Newman","edited_by":"Robert L. Simpson","written_by":"George Seaton Valentine Davies Based on the play by Julius J. Epstein and Philip G. Epstein"}