{"Cast":"There are cameos from Primus, Jim Martin of Faith No More, and future Linkin Park guitarist Brad Delson. Director Peter Hewitt makes a cameo as the scruffy-looking smoker in Builders' Emporium to whom Death mumbles, \"See you real soon.\" Writers Ed Solomon (with glasses) and Chris Matheson (in white shirt) appear as New Agers at Missy's seance. Ed is credited as 'Stupid' seance member, and Chris is credited as 'Ugly' seance member. They are given similar credits in Bill and Ted's Excellent Adventure. Also in the seance scene, the incantation Missy uses to send Bill and Ted to Hell is \"D'lrow eht elur lliw sirhc dna de,\" or \"Ed and Chris will rule the world\" backwards. The character \"De Nomolos\" is also a reference to writer Ed Solomon, as it is his first and last name spelled backwards.","country":"United States","distributed_by":"Orion Pictures","Plot":"The music of Bill and Ted's band, Wyld Stallyns, has created a utopian future society. Chuck De Nomolos, who detests this society, steals one of the time-traveling phone booths and sends two robots modeled after Bill and Ted back to the late 20th century to prevent Bill and Ted from winning the San Dimas Battle of the Bands. Rufus attempts to stop De Nomolos but seemingly becomes lost in the circuits of time.In the present, five years after Bill and Ted first traveled through time, Wyld Stallyns is preparing for the contest. Though Bill and Ted's current fiancées and former 15th-century princesses Elizabeth and Joanna have become skilled musicians, Bill and Ted are still inept. Despite this, the organizer Ms. Wardroe assures them a slot in the contest as the final act. Bill's stepmother, Missy, divorces his father in favor of Ted's, who threatens Ted with military school should they fail the Battle of the Bands. Evil Bill and Evil Ted arrive and the robots eventually replace Bill and Ted, killing them by throwing the two over the side of a cliff at Vasquez Rocks. The robots behave rudely to the princesses and work to ruin the duo's fame.Bill and Ted's souls are met by Death who challenges them in a game for their souls. Bill and Ted escape after giving Death a \"melvin\". They attempt to alert their families but their ethereal forms prove difficult, and at one point, are cast down into Hell at a séance held by Missy. In Hell, they are tormented by Satan, made to face their own fears, manifesting as Col Oates, the Easter Bunny, and Granny S Preston, and realize their only escape is to take Death's offer. Taken to Death's chambers, the spirit gives them the option of what game to play. Bill and Ted, to Death's dismay, select modern games like Battleship, Clue, and Twister, easily beating Death. Death admits defeat and unwillingly becomes their servant. Bill and Ted recognize they need to locate the smartest person in the universe to help build robots to counter De Nomolos' evil robots. Death escorts the two to Heaven, and with God's help, are directed to an alien named Station who has the ability to split into two identical twins, and readily offers to help Bill and Ted.Death brings them back to the mortal world, where it is the night of the Battle of the Bands. Bill and Ted take Station to a hardware store, and then race in their van back to the concert while Station constructs good robots. Just as the evil robots take the stage, Bill and Ted arrive, and Station's robots easily defeat the evil ones. De Nomolos appears in the time booth, ready to defeat Bill and Ted himself, and overrides the broadcasting equipment to send the video footage of this to everyone on the planet. The two recognize they can later go back in time to arrange events for De Nomolos to be trapped in the present, aided by Death and Station; though De Nomolos is apparently able to do the same, Bill and Ted gain the upper hand with the explanation that it is only the winners who get to go back, and De Nomolos is arrested by Ted's father. Ms. Wardroe reveals herself to be a disguised Rufus, having assured Bill and Ted's spot in the concert, and urges them to play.As Bill and Ted reunite with their fiancées, they realize they are still terrible musicians, and the four use the time booth; though they return immediately, \"an intense 16 months of guitar training plus a two week honeymoon\" have passed for them, they have married the princesses and each is raising a young infant \"Little Ted\" and \"Little Bill\". They begin to perform a stunning rock ballad, joined by Death, Station, and the good robots. The worldwide broadcast set by De Nomolos continues, and Wyld Stallyns' music is played across the globe, creating harmony. Over the credits, it's shown through newspaper articles that the band, along with Death, go through many perks of fame before eventually taking their act to Mars.","language":"English","Reception":"Critical reception to the movie was mixed. Rotten Tomatoes, a review aggregator, reports that 57% of 37 surveyed critics gave Bogus Journey a positive review; the average rating was 6/10.[5]Desson Howe of The Washington Post called it \"an entertaining, surreal journey\" that is \"funnier and livelier than the original.\"[6] Janet Maslin of The New York Times called it \"amusing but sloppy and overcomplicated\".[7] Roger Ebert gave the film 3 out of a possible 4 stars, writing, \"It's the kind of movie where you start out snickering in spite of yourself, and end up actually admiring the originality that went into creating this hallucinatory slapstick.\"[8] (Ebert did not see or review the first film.) Dave Kehr, then of the Chicago Tribune, also gave the film 3 stars. He stated that it is unusual for an Ingmar Bergman parody to show up in a teen comedy and referred to the film as a \"genuine pleasure.\"[9] Gene Siskel, also of the Tribune, gave the film only 2½ stars, but did believe the second film to be better than the first.[9] Leonard Maltin also gave Bogus Journey 2½ stars, a half-star more than he gave to Excellent Adventure.[10] Variety wrote that the film has \"a few triumphant moments, but not enough to sustain pic's running time.\"[11]","bill_&_ted's_bogus_journey":"Theatrical release poster","box_office":"$38 million (US)[2]","cinematography":"Oliver Wood","production_company":"Nelson Entertainment Interscope Communications","directed_by":"Pete Hewitt","Marvel Comics adaptation":"To coincide with the release of the movie, Marvel Comics released a one-shot comic book adaptation of the movie, hiring Evan Dorkin to adapt the screenplay and pencil the art. Like Archie Goodwin's adaptation of the first Star Wars film, Dorkin worked from the original script, which included many of the deleted scenes, and portrayed Death as the archetypal skeletal figure. Due to the popularity of the comic, Marvel commissioned a spin-off series, Bill & Ted's Excellent Comic Book, which kept the talents of Dorkin, DeStefano and Severin. The series ran for 12 issues, featuring original stories. The first arc features negative results from Death's decision to take a vacation.","Soundtrack":"The song Bill & Ted play for the Battle of the bands is Final Guitar Solo by Steve Vai, which he wrote to help blend into \"God Gave Rock 'N' Roll to You II\" by Kiss, although they appear similar in appearance to Dusty Hill & Billy Gibbons from ZZ Top.When Bill and Ted are asked \"What is the meaning of life?\" they reply with the lyrics from \"Every Rose Has Its Thorn\" by Poison.","release_dates":"July 19, 1991","produced_by":"Scott Kroopf","starring":"Keanu Reeves|Alex Winter|William Sadler|Joss Ackland|George Carlin|","running_time":"93 minutes","Sequel":"In 2010, Reeves indicated that Matheson and Solomon were working on a script for a third film,[12] confirming in April 2011 that a draft was complete.[13] Winter said in March 2012 that he and Reeves both like the finished script, which revisits the two characters after the changes of the past twenty years. Despite the script being finished and satisfied by both parties, no specific filming dates have been named.[14] In late 2015, Alex Winter appeared on The Nerdist podcast and said the \"three-quel\" is very close to happening. He named Dean Parisot, of Galaxy Quest fame, as the director of the project and says the script and funding are finalized. There is still no solid date for filming or release however.","music_by":"David Newman","edited_by":"David Finfer","written_by":"Chris Matheson Ed Solomon","budget":"$20 million[1]"}