{"based_on":"A Funny Thing Happened on the Way to the Forum  by Burt Shevelove and Larry Gelbart","Cast":"Cast notes","country":"United Kingdom United States","distributed_by":"United Artists","screenplay_by":"Melvin Frank Michael Pertwee","Plot":"In the city of Rome during the reign of Emperor Nero, Pseudolus (Zero Mostel) is \"the lyingest, cheatingest, sloppiest slave in all of Rome\", whose only wish is to buy his freedom from his master's parents, the henpecked Senex (Michael Hordern) and his dominating wife Domina (Patricia Jessel). When he finds out that his master, Senex's handsome but dim son Hero (Michael Crawford), has fallen in love with Philia (Annette Andre), a beautiful virgin courtesan from the house of Marcus Lycus (Phil Silvers), buyer and seller of beautiful women next door, Pseudolus makes a deal: he will get the girl for Hero in return for his freedom. Unfortunately, the virgin has been sold to the great Roman soldier, Captain Miles Gloriosus (Leon Greene), who even now is on his way from conquering Crete to claim her as his bride. Pseudolus blackmails his overseer, Hysterium (Jack Gilford) into masquerading as the corpse of Philia to fool the captain, but things go wrong at every turn.In the end, the boy gets the girl; Senex's next-door neighbor Erronius (Buster Keaton) finds that Philia and Miles Gloriosus are in fact his long-lost children; and Pseudolus gets his freedom, a beautiful concubine to be his wife, and a dowry of 10,000 minae, compliments of Marcus Lycus.","a_funny_thing_happened_on_the_way_to_the_forum":"theatrical release poster","language":"English","box_office":"$3,390,000 (US/ Canada)[1]","cinematography":"Nicolas Roeg","directed_by":"Richard Lester","Award and honors":"Music director Ken Thorne received an Academy Award for \"Oscar Best Music, Scoring of Music, Adaptation or Treatment\" in 1967. In addition, the film was nominated that year for a Golden Globe as \"Best Motion Picture - Musical/Comedy\".[8]","release_dates":"October 16, 1966 (1966-10-16) (US)|December 14, 1966 (1966-12-14) (UK)||||","Production":"Although the musical had originally been written with Phil Silvers in mind, Zero Mostel starred on Broadway as Pseudolus,[9] and Richard Lester was his choice to direct the film version. Other directors who were considered included Charlie Chaplin, Orson Welles and Mike Nichols.[6]It was filmed at the Samuel Bronston Studios in Madrid, Spain, and on location around that city,[10] on an estimated budget of $2 million. Filming took place from September to November 1965.[11]Jack Gilford was also re-creating his stage role, as Hysterium,[9] and there are other connections to the Broadway production. Tony Walton, who designed the production, including the costumes, was also the designer of the Broadway show. For Walton, who was married to Julie Andrews from 1959 to 1967, Forum came at the beginning of both his film and stage careers: it was his second Broadway production, and his third film - he had designed costumes for Mary Poppins in 1964, and did the overall production design of Fahrenheit 451 in 1966.[12][13]Bob Simmons, a renowned stunt coordinator, designed and performed many of the action scenes in the film.The animated end credits created by Richard Williams feature many houseflies, a reminder of the fly problem the production suffered through when the fruits and vegetables which festooned the set were left out to rot overnight after the end of the shooting day.[6]George Martin, who with Ethel Martin is credited with the choreography of the film,[14] was the assistant to choreographer Jack Cole on Broadway.[15] (Jerome Robbins also did some uncredited work on the stage show.[9]) Other members of the Forum team are notable as well. Cinematographer Nicholas Roeg moved up to the director's chair to make films such as Walkabout (1971), Don't Look Now (1973), and The Man Who Fell to Earth (1976) with David Bowie.Forum premiered in New York City on October 16, 1966[16] and in London on December 14 of that year.[17] It went into general release in January 1967. It received about $3 million in rentals in the U.S.[11]","produced_by":"Melvin Frank","starring":"Zero Mostel Jack Gilford Phil Silvers","running_time":"99 minutes","Songs":"Songs from the original Broadway score which were cut for the film: \"Love I Hear\" (Hero), \"Free\" (Pseudolus and Hero), \"Pretty Little Picture\" (Pseudolus, Hero, Philia), \"I'm Calm\" (Hysterium), \"Impossible\" (Senex and Hero), \"That Dirty Old Man\" (Domina) and \"That'll Show Him\" (Philia)[5]Sondheim's music was adapted for the film version of Forum by Ken Thorne, who previously worked with The Beatles on Help! (1965).[6][7] Thorne won the only award that Forum received, a 1967 Academy Award for \"Best Music, Scoring of Music, Adaptation or Treatment\".[8]","music_by":"Stephen Sondheim","edited_by":"John Victor-Smith","budget":"$2 million"}