{"country":"Malaysia","distributed_by":"Astro Shaw","Plot":"Set after 7 years of the event of Cicakman 2: Planet Hitam. Cicakman, the former superhero of Metrofulus had disappeared with people claiming Cicakman is dead or has retired. In his absence, the new superhero known as SuperBro has emerged and become the former defender of Metrofulus.It started with MakNyah terrorists (LGBT-biased) defeated by a superhero known as SuperBro (Yus Jambu). Man (Zizan Razak), on the verge of divorce with his with wife, Linda,(Lisa Surihani), who takes custody of the son, Boboy (Reyqal).Inspector Adam (Fizz Fairuz), brother of the Commissioner of Police, Commissioner Kahar and Linda's former friend, is into Linda as well.With Man felt troubled by his situation and ignoring the help of his friend, Jojo (Bell Ngasari), he discovers an emblem of Cicakman that belongs at the former statue. Man places the emblem back at the statue and discovered, a box belonging to the former Cicakman. Man went home and he gets into a conversation with a girl. She then gets harassed by a motorcycle gang while Man walks away to his house, un-boxing the box he found and discovered he has been chosen as the new Cicakman. So he wears the new suit, and with a sudden confidence, he goes down to halt the attack, hours later.The girl is being harassed constantly, and for a long period of time. The girl is close to being gang-raped and made this damsel in distress scenario close to a serious situation. Cicakman fights the gangsters, and lost. He have yet to discover his true potential and gets him beaten, because he did not check the whole content of the box entirely. In that box contains the serum that will transform him into Cicakman. Only at this time, he really starts finding his true potential. He gradually unlocks his ability with his tongue, his moves in combat, wall climbing and so. So Cicakman once again halts the gangsters for harassing the same girl again. But this time Cicakman defeats them and won the day.Within these chapters are the struggle of Man reconnecting with his family, the intrusion of Adam, and his attempt to save the day when a train gets hijacked by a group of gangsters, only to have SuperBro intervene and finish the job. The crowd disregard Cicakman who saved the day and favours SuperBro more. Later Cicakman gets beaten by SuperBro.There is at one point, Man intervenes Linda's new job as a singer at a local bar (provided by Adam), at this point he discovers how much Adam is into Linda and found a folder in blood containing a photo of Adam and this certain guy.So when Man returns, he discovered Jojo got sodomised by SuperBro. He found a robotic stick stuck up Jojo's butt, and Jojo was traumatised.The next day, Man is supposed to attend his son's sports day. He deliberately misses a bus to the venue and instead investigate a supposed suspicious truck he found at the bar where Linda sings. As Cicakman, a roof on a car chase ensues, but Cicakman gets incapacitated with a gun, shot at his chest. It was here that Cicakman found his full potential of self-generation. So he went to the sport's day venue extremely late and trying to explain to Linda why he missed his son's Sport's Day. He tells her the truth, which didn't work out well and gets told off by Linda. At the same time, Adam threatens the son to bury him alive for eavesdropping.At this point, Man is at his breaking point, he burns his suit out of despair. As he walks close to the wall, he sees a wanted poster of the same man in a photo with Adam. Realizing Adam is a criminal, Man retrieves back his burned outfit.Cicakman proves himself a capable hero by sending the pictures of Adam and the gangster leader to the police.So Adam brings Linda to the pre-jubilee event where she will sing. Adam proposes his love and marriage to Linda, but he reacted violently when he gets rejected.He shot an innocent sound mixer guy in the head.He tied the mother and son and challenges Cicakman for a battle.Cicakman comes to save the day, and fighting ensues. There are two points where the villain shoots an explosion of round ammunition. The occupants of the Ferris Wheel got into trouble and were hanging for their life, and Cicakman managed to save them. SuperBro aimed another explosive round on a baby's carriage.Cicakman tried to stop the explosion by Dthrowing the carriage out of the funfair crowd. Along the process, Cicakman got injured badly and was unable to stand up properly to fight. Due to his regenerative powers, he only needed to wait for his injuries to self heal and continue fighting until the villain's battery ran out. He managed to beat the villain once his battery ran out and kicked him into the sea. The villain rose up from the water, only for his battery to drain out and he got electrocuted and blown into fireworks.Later, Cicakman is awarded for his bravery, and he took off his mask to prove that he will not receive the award as Cicakman but as a responsible citizen of Metrofulus and a father. The Mayor of Metrofulus had also erected a statue of Cicakman to commemorate his service.","cicakman_3":"Cicak Man 3 film poster","language":"Malay","box_office":"MYR 2.53 million (US$577,000)[1]","directed_by":"Ghaz Abu Bakar Yusry Abdul Halim","Response":"Cicakman 3 had grossed MYR 1 million in its fourth day. After tenth day, Cicakman 3 had grossing MYR 2.5 million in Malaysia.","Soundtrack":"Zizan Razak & KRU - Adiwira","release_dates":"12 March 2015 (2015-03-12)","Production":"The Cicakman 3 shooting took place in Kuala Lumpur and Johor. The production cost were 4 million Ringgit. The cost of the costume for Cicakman and Super-Bro each amounted 100 thousand Ringgit each.","produced_by":"Johan Lucas","starring":"Zizan Razak Lisa Surihani Fizz Fairuz","running_time":"128 minutes","music_by":"Edry Abd Halim","budget":"MYR 3.5 million (US$800,000)"}