{"Development and production":"The screenplay is loosely based on the experience of screenwriter Will Reiser, friend of the film's co-lead, Seth Rogen.[4] Reiser is also close with Evan Goldberg of Da Ali G Show. The film was going to be called I'm with Cancer before it was announced that this was a working title. The film was later renamed Live with It and then 50/50.[5]James McAvoy was going to play the lead role before he left the film due to personal reasons, as he was afraid of missing the birth of his first child, and was replaced by Joseph Gordon-Levitt.[6]Principal photography was scheduled from February 22, 2010 to March 31, 2010.[7] The film was mostly filmed in Richmond and Vancouver, British Columbia as well as Seattle, Washington.[citation needed]The head-shaving scene in the film was featured on the movie posters and commercials. At the 50/50 premiere in New York, Gordon-Levitt said, \"We only had one take because you can't shave your head twice.\"[8] Rogen recalled, \"It was the first day of filming, and we improvised the whole thing, which is not wise when it's something you have one take for, but it turned out funny.\"[8]","country":"United States","distributed_by":"Summit Entertainment","Plot":"Adam Lerner is a 27-year-old public radio journalist in Seattle with an artist girlfriend Rachael, of whom his best friend and co-worker Kyle disapproves; where Kyle is brash and outspoken, Adam is more introverted and mild-mannered.After experiencing harsh pains in his back, Adam learns from his doctor that he has schwannoma neurofibrosarcoma (a malignant tumor) in his spine, and must undergo chemotherapy. He sees on the Internet that his chances of survival are fifty-fifty. After Adam reveals his diagnosis, his overbearing mother, Diane, who already cares for her husband Richard suffering from Alzheimer's, wants to move in and care for him. Adam rejects this offer, as Rachael has promised to be the one to take care of him. Rachael, however, is \"uncomfortable\" going into the hospital during Adam's chemo treatments and is often late to pick him up, as Adam doesn't drive; she also gets him a retired racing greyhound named Skeletor as a companion animal. Throughout Adam's struggle, Kyle attempts to keep Adam's spirits high, which include helping Adam shave his head prior to chemotherapy and openly using Adam's illness to pick up women. While on a date with one such woman, however, Kyle sees Rachael at an art gallery, kissing another man, and forces her to come clean to Adam; this proves to be the final straw in their already strained relationship, and Adam breaks up with her for good. Now single, he eventually starts to follow Kyle's lead, and the two use his illness to successfully pick up two women at a bar.Meanwhile, Adam skeptically begins going to a young and inexperienced therapist, Katherine McKay (Kendrick), a PhD candidate doing the clinical aspect of her thesis at the hospital. Although their relationship and sessions have a rocky start, he slowly begins to open up to her about his disease and how it is affecting him. After she gives him a lift home in her car after one of his chemo sessions, the two develop a rapport both in and outside of their sessions, which begins to blur the lines of both their doctor-patient relationship and connection as friends. She helps Adam understand his mother's situation as well, that even though he is the cancer patient, the loved ones feel just as much stress watching someone they care about fight the disease, which helps Adam make steps in repairing the rift between him and his mother. During chemo treatments, Adam also befriends Alan (Hall) and Mitch (Frewer), two older cancer patients who are also undergoing chemotherapy. The two offer Adam advice and smoke marijuana with him.After Mitch suddenly dies, Adam's fears of his own potential death and unknown future become more evident. Subsequently, he is informed that his treatment is not working and that he needs to undertake a risky surgery as a last resort. The night before his surgery, Adam has an argument with Kyle and demands to drive Kyle's car because Kyle is drunk—even though Adam does not have a driver's license. After nearly causing an accident, Adam breaks down and criticizes Kyle for seemingly not taking his illness seriously and using it for his own ends. Adam calls Katherine and tells her that he wishes he had a girlfriend like her, but also says he is tired and just wants it to be over. That night, Adam stays at Kyle's and while in the bathroom washing his hands, he finds a book entitled 'Facing Cancer Together' from their first trip to a bookstore where Kyle picked up the shop clerk—it is filled with notes, highlighted paragraphs and turned-down pages, proving to Adam that Kyle does sincerely care about Adam's struggle and has been helping him the best way he knows how, by simply not treating Adam any differently throughout the duration of his illness.The next day when Kyle drops Adam off at the hospital, Adam embraces Kyle for being a good friend and apologizes for what he said the previous night. After Adam says what could be his final farewells to his family, he undergoes his surgery. During the wait, Katherine goes to the waiting room where she inadvertently meets Adam's family and Kyle. After the surgery, Kyle, Diane, and Katherine are told by the doctor that although the bone degradation was worse than they had thought, the tumor was removed successfully, and that Adam would recover.Some time later, Adam is getting ready for a date with Katherine, while Kyle encourages him and cleans the incision on Adam's back from the surgery. The doorbell rings and Adam lets Katherine inside. After Kyle leaves, Katherine asks, \"Now what?,\" and Adam simply smiles - at last being free of cancer.","language":"English","Reception":"Review aggregator Rotten Tomatoes gave the film a rating of 94%, based on 185 reviews, with a rating average of 7.7/10. The site's critical consensus reads, \"A good-hearted film about a difficult topic, 50/50 maneuvers between jokes and drama with surprising finesse.\"[9] Metacritic, which assigns a weighted average score, gives the film a score of 72 out of 100, based on 42 critics, indicating \"generally favorable reviews\".[10]Sean Burns wrote in the Philadelphia Weekly that Levine \"knows how to stay out of the way long enough to let a very talented cast shine, and Rogen's fundamental, unexpected decency, which can often only be expressed through shoulder-punching obscenities, grows more quietly moving as the picture wears on.\"[11]David Schmader, writing in the Stranger, praises \"'50/50's stellar cast, from the omnipresent lead Joseph Gordon-Levitt (whose Rankin/Bass puppet face is put to beautifully nuanced use) to the all-star supporting cast: Anjelica Huston roars back to prominence with a twisty performance as Adam's barely contained mess of a mom, and Anna Kendrick's young doctoral student makes the film's rom-com aspirations not-ridiculous with her intelligent spontaneity and huge cute teeth. But the comedy star is Seth Rogen, cast in the same role he played in screenwriter Reiser's life.\"[12]The film was nominated for two awards at the 69th Golden Globe Awards. Gordon-Levitt received a nomination for Best Actor (Musical or Comedy) and the film itself was nominated for Best Picture (Musical or Comedy).[13]Some fans of the film were surprised at the film's lack of an Academy Award nomination. Seth Rogen addressed this in an interview with Entertainment Weekly, saying he predicted that it wouldn't be nominated, saying that he knows for a fact that \"some people are appalled by the movie.\" He said of this, \"I think it must be people who have very, very personal connections to the subject matter and just can't emotionally disconnect from their own experience. I respect that. But what we found for the most part is that people like to laugh at tragedy. It makes them feel better.\"[14]The film was included in the following top ten lists for the best films of 2011:","box_office":"$41.1 million[3]","50/50":"Theatrical release poster","cinematography":"Terry Stacey","production_company":"Mandate Pictures Point Grey Pictures IWC Productions","directed_by":"Jonathan Levine","Home media":"50/50 was released on DVD and Blu-ray Disc in North America on January 24, 2012.[25] Both releases include commentary, deleted scenes, and behind-the-scenes videos.[citation needed]","release_dates":"September 12, 2011 (2011-09-12) (TIFF)|September 30, 2011 (2011-09-30) (United States)||||","produced_by":"Evan Goldberg|Seth Rogen|Ben Karlin|","starring":"Joseph Gordon-Levitt|Seth Rogen|Anna Kendrick|Bryce Dallas Howard|Anjelica Huston|","running_time":"100 minutes[1]","Songs":"No official soundtrack was released, however several songs appear in the film, such as:","music_by":"Michael Giacchino","edited_by":"Zene Baker","written_by":"Will Reiser","budget":"$8 million[2][3]"}