{"based_on":"Starbuck  by Martin Petit & Ken Scott","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Ken Scott","delivery_man":"Theatrical release poster","Plot":"David Wozniak (Vince Vaughn) is a hapless deliveryman for his family's butcher shop, pursued by thugs to whom he owes $80,000. His girlfriend Emma, an NYPD officer (Cobie Smulders) is pregnant with his child. One day, David returns from work to find a lawyer representing a sperm bank (where he gave 693 donations and earned a sum of $24,255 during his student years) who tells him that the clinic gave his samples to women in the clinic and that he has fathered 533 children. Of those, 142 have joined a class action lawsuit to force the fertility clinic to reveal the identity of \"Starbuck\", the alias he had used.David's friend and lawyer Brett (Chris Pratt) represents him as he tries to keep the records sealed. He provides David with profiles of each party to the lawsuit: David searches for them, finding moments for random acts of kindness. David considers identifying himself; but, after the thugs assault his father, he agrees with his lawyer to counter-sue the sperm bank for punitive damages. He wins the lawsuit, receives $200,000, and keeps his identity a secret.David has regrets and thinks about revealing his identity. However, if he chooses to do so, he would lose the $200,000 that he won in the countersuit. He reveals to his father that he is Starbuck. His father decides to pay off David's debt. David finally reveals his identity on Facebook. He goes to Emma's house and finds that she is going into premature labor. At the hospital, his baby is born, he proposes to Emma, and many of the children show up to see him.","language":"English","Reception":"Delivery Man received mixed reviews from critics. Review aggregation website Rotten Tomatoes gave the film a score of 39% based on reviews from 134 critics with an average score of 5/10. The site's consensus says: \"It has an undeniably sweet charm, and Vince Vaughn is eminently likable in the lead role, but Delivery Man suffers in comparison to Starbuck, the hit Canadian comedy that inspired it.\"[12] At Metacritic the film received a score of 44/100 based on reviews from 33 critics.[13]Alonso Duralde of The Wrap gave the film a negative review, stating that \"Delivery Man offers comedy and sentimentality in equal doses and, unfortunately, equal efficacy—the jokes, the characters and the situations aren't very funny, and the would-be heart-tuggery is mostly embarrassing.\"[14] Peter Debruge of Variety wrote, \"Delivery Man is virtually nothing like a [typical] Vince Vaughn movie, but rather a heartfelt celebration of the act of parenthood presented under radically exaggerated circumstances... the director demonstrates the good sense not to mess with success, engineering what amounts to a scene-for-scene remake of that earlier feel-good outing—with the notable addition of Chris Pratt in his funniest supporting performance yet.\"[5] Michael Rechtshaffen of The Hollywood Reporter wrote that \"it's nice to see Vaughn moving out of his fast-talking comfort zone in a role that requires him to be more quietly reactive; while Parks and Recreation’s Pratt comically raises the second-banana bar as a put-upon dad itching to get back into the courtroom. While Smulders, unfortunately, isn't given the same opportunity to show off her comedic chops regularly on display on How I Met Your Mother, acclaimed Polish actor Andrzej Blumenfeld (in his American debut) makes a more empathetic impression as the warm Wozniak family patriarch.\"[15]","box_office":"$51.2 million[3]","cinematography":"Eric Edwards","production_company":"DreamWorks Pictures Reliance Entertainment","directed_by":"Ken Scott","release_dates":"November 22, 2013 (2013-11-22)|||||","Production":"The film is a remake of the 2011 French-Canadian film Starbuck which was also directed by Scott; Starbuck was also the working title for the English-language production.[7]Filming began in October 2012 in the Hudson Valley of New York. Filming then moved to New York City locales, in Brooklyn [8][9] and Manhattan.[10] Concerning the number of extras as the children, actor Dave Patten said, \"There were ten of us who were constants on the sets so we didn’t really bond with the others who were extras. But the ten of us became a huge pack of friends and it was really nice. There are usually a lot of egos on set when it comes to a big cast which causes people not to get along but we didn’t have that issue.\"[11]","produced_by":"André Rouleau","starring":"Vince Vaughn Chris Pratt Cobie Smulders","running_time":"105 minutes[1]","music_by":"Jon Brion","edited_by":"Priscilla Nedd-Friendly","Release":"The movie was released worldwide on November 2013 by Walt Disney Studios Motion Pictures through the Touchstone Pictures label, except for Europe, Africa and Middle East, where the rights are sold by Mister Smith Entertainment to other industries. DreamWorks' financial partner, Reliance Entertainment, had released the film in India. Entertainment One had released it in the United Kingdom.","budget":"$26 million[2]"}