{"country":"United States","distributed_by":"20th Century Fox","Plot":"A naive, rambunctious, overly enthusiastic and socially inept cowboy, Beauregard Decker, and his friend and father-figure Virgil Blessing take the bus from Timber Hill, Montana to Phoenix, Arizona, to participate in a rodeo. Virgil has encouraged the 21-year-old virgin, Beau, to take an interest in \"girls.\" Initially reluctant and frightened of the idea, Beau declares that he hopes to find an \"angel\" and will know her when he sees her. Making trouble everywhere they go, he continues his bad behavior in the Blue Dragon Café. There he imagines himself in love with the café's singer, Chérie, a talentless but ambitious performer from the Ozarks with aspirations of becoming a Hollywood star. Her rendition of \"That Old Black Magic\" entrances him and he forces her outside, despite the establishment's rules against it, kisses her and thinks that means they're engaged. Chérie is physically attracted to him but resists his plans to take her back to Montana. She has no intention of marrying him and tells him so, but he's too stubborn to listen.The next day, Beau intends to marry Chérie after the rodeo, but she escapes. He tracks her down, and forces her on the bus back to Montana. On the way, they stop at Grace's Diner, the same place the bus stopped on the way to Phoenix. Chérie tries to make another getaway while Beau is asleep on the bus, but the road ahead is blocked by snow and the bus won't be leaving at all. They're all stranded there. The bus driver, the waitress and the café owner by now all have learned that Beau is kidnapping and bullying the girl. Virgil and the bus driver fight him until he promises to apologize to Chérie and leave her alone. He, however, is unable to do so because he's humiliated about having been beaten.The next morning, the storm has cleared and everybody is free to go. Beau finally apologizes to Chérie for his abusive behavior and begs her forgiveness. He wishes her well and prepares to depart without her. Chérie approaches him and confesses that she's had many boyfriends and is not the kind of woman he thinks she is. Beau confesses his lack of experience to her. Beau asks to kiss her goodbye and they share their first real kiss. All Chérie wanted from a man was respect, which she'd previously told the waitress when they sat together on the bus. This new Beau attracts Chérie. He accepts her past and this gesture touches her heart. She tells him she'll go anywhere with him. Virgil decides to stay behind. When Beau tries to coerce him to go with them, Chérie reminds him that he can't force Virgil to do what he wants. Having finally apparently learned his lesson, Beau offers Chérie his jacket and gallantly helps her onto the bus.","language":"English","box_office":"$7.27 million[2]","cinematography":"Milton R. Krasner","directed_by":"Joshua Logan","References":"Notes","release_dates":"August 31, 1956 (1956-08-31) (US)|||||","produced_by":"Buddy Adler","starring":"Marilyn Monroe Don Murray Arthur O'Connell Betty Field Eileen Heckart","running_time":"96 minutes","bus_stop":"film poster by Tom Chantrell","music_by":"Ken Darby Cyril J. Mockridge Alfred Newman Lionel Newman","edited_by":"William H. Reynolds","written_by":"George Axelrod William Inge","budget":"$2.2 million[1]"}