{"country":"United States","distributed_by":"Universal Studios","Plot":"Mick O'Brien (Sean Penn) is a 16-year-old Irish-American hoodlum from Chicago. While most of Mick's crimes involve snatching purses, vandalism, and getting into brawls, he aspires for bigger and meaner things, which leads him to attempt ripping off a Puerto Rican[1] rival, Paco Moreno (Esai Morales). Everything goes wrong: Mick's partner and best friend Carl (Alan Ruck) is killed, and Mick, while trying to escape the police, accidentally runs over and kills an eight-year-old boy who happens to be Paco's brother. Mick is sent to the Rainford Juvenile Correctional Facility rather than a state prison for adults. Most of the wardens and counselors seem to have lowered themselves to the role of zookeepers. The only exception is Ramon Herrera (Reni Santoni), a former gang member who talks tough to the inmates, but holds out hope for some of them, especially Mick.Mick's cellmate is Barry Horowitz (Eric Gurry), a small, wiry, scientific-minded Jewish kid who firebombed a bowling alley after some boys there severely beat him (for hitting on their girlfriends). Their cell block is dominated by a pair of brawny sadists named \"Viking\" Lofgren (Clancy Brown) and Warren \"Tweety\" Jerome (Robert Lee Rush). As soon as their alpha male status is established, Mick takes his first step toward defining himself by standing up to them. Meanwhile, to avenge his brother's death, Paco rapes Mick's girlfriend J.C. (Ally Sheedy). After hearing of the rape, Mick is desperate to see her, so he and Horowitz escape the double perimeter fences during football practice via the use of a corrosive liquid placed on the fences, making them weak enough to kick open. Mick escapes, but Horowitz falls on barbed wire and is then caught where a counselor beats him up for calling him names and escaping. Ramon senses that Mick had gone to J.C.'s house, and soon picks him up. He then takes him on a trip to a maximum security prison to show what's in store for him, should he continue down the path of crime.After Paco's arrest upon the police finding out about the rape on J.C., he is sentenced to the same dormitory at Rainford that Mick is in. The staff are fully aware of this potential danger, but no other reform school has a vacancy. Meanwhile, in an attempt to injure Paco for Mick, Horowitz plants fertilizer into a radio that he has placed in Paco and Viking's cell. When the charge explodes prematurely and only injures Viking, Horowitz is condemned to permanent solitary confinement, a fate he fears more than any other.Eventually, Paco's transfer is arranged, so he plans his showdown with Mick for the night before. While Herrera was on night patrol, Paco fakes a ruptured appendix so Herrera comes to his aid. Herrera is assaulted, then caged in the office. The door into the cells is then barricaded, and the entire dormitory is aroused by the brawl. Eventually, Mick comes out on top, and the film ends with him very nearly killing Paco while being encouraged by the others to do it. However, resisting at the last second, he doesn´t do it. He then drags a beaten Paco in front of the caged Ramon and other detention officers and heads back to his cell, crying in remorse.","language":"English","Critical reception":"Bad Boys garnered generally positive reviews; review aggregate website Rotten Tomatoes currently holds an 89% \"Fresh\" rating based on 19 reviews.[4] David Denby of The New Yorker magazine argued, \"Bad Boys is never less than tense and exciting, but it's coarse and grisly, an essentially demagogic piece of work\".[5]In his original review, Roger Ebert praised the direction and cinematography in particular and wrote, \"The direction, by Richard Rosenthal, is sure-footed, confident and fluid; we are in the hands of a fine director\".[6] In her review for The New York Times, Janet Maslin wrote, \"Sean Penn's performance is the chief thing that separates Bad Boys from mere exploitation\".[7] Perry Seibert of All Media Guide said \"Bad Boys proves that great performances can overcome routine story lines.\"[8]","box_office":"$9.1 million","cinematography":"Bruce Surtees|Donald E. Thorin|","production_company":"EMI Films Solofilm Company","directed_by":"Rick Rosenthal","Soundtrack":"The soundtrack of the film comprised some late, eccentric funk tracks, as well as Billy Squier and Iron Maiden.","release_dates":"March 25, 1983 (1983-03-25)|||||","Distribution":"Universal Studios originally released Bad Boys in 1983, and Thorn/EMI released it on videocassette, but in 1999 Artisan Entertainment took the rights and released the DVD, then in 2001 Anchor Bay Entertainment took the DVD rights and released, and in 2007 Facets Multimedia Distribution took the rights and released.[2]Bad Boys was released on Blu-ray for the first time on February 1, 2011, presented \"complete and uncut.\" [3]","produced_by":"Robert H. Solo","starring":"Sean Penn|Reni Santoni|Jim Moody|Esai Morales|","running_time":"123 minutes|104 minutes (Edited cut)|","bad_boys":"Theatrical release poster","Cultural usage":"The name of the Croatian ultras group Bad Blue Boys (who support NK Dinamo Zagreb) is said to have been inspired by Bad Boys.","music_by":"Bill Conti","edited_by":"Antony Gibbs","written_by":"Richard Di Lello","budget":"$5 million"}