{"based_on":"Alice's Adventures in Wonderland and Through the Looking-Glass  by Lewis Carroll","Cast":"Marton Csokas makes a cameo appearance as Alice's deceased father in the film's opening scene and Alice's mother is played by Lindsay Duncan. Lord and Lady Ascot are played by Tim Pigott-Smith and Geraldine James respectively. Eleanor Tomlinson and Eleanor Gecks play the Cathaway sisters, who bear a strong resemblance to Tweedledum and Tweedledee. Jemma Powell appears briefly as Alice's sister, Margaret, while Margaret's unfaithful husband Lowell is played by John Hopkins.Frank Welker provided additional voices and vocal effects; including roars of the Jabberwocky and Bandersnatch, squawks for the Jubjub bird, and Bayard barking.[39] Rickman, Windsor, Fry, Gough, Lee, Staunton and Carter each took only a day to record their dialogue.[39]","country":"United States[1]","distributed_by":"Walt Disney Studios Motion Pictures","language":"English","box_office":"$1.025 billion[5]","cinematography":"Dariusz Wolski","production_company":"Walt Disney Pictures Roth Films The Zanuck Company Team Todd","alice_in_wonderland":"Theatrical release poster","directed_by":"Tim Burton","Possible stage adaptation":"Walt Disney Theatrical is in early talks with Burton and screenwriter Linda Woolverton to develop the property as a Broadway musical. Woolverton authored the screenplay for Disney's The Lion King and is also the Tony Award-nominated book writer of Beauty and the Beast, Aida and Lestat. Burton will also render the overall designs for the stage musical. Woolverton will adapt her screenplay for the stage production. Neither a composer nor songwriting team has been chosen yet. Direction and choreography will be done by Rob Ashford.[134][135][136] The musical is aiming to make its world-premiere in London.[137]","release_dates":"February 25, 2010 (2010-02-25) (London)|March 5, 2010 (2010-03-05) (United States)||||","Production":"Tim Burton signed with Walt Disney Pictures to direct two films in Disney Digital 3D, which included Alice in Wonderland[40] and his remake of Frankenweenie. Burton developed the story because he never felt an emotional tie to the original book.[41]He explained \"the goal is to try to make it an engaging movie where you get some of the psychology and kind of bring a freshness but also keep the classic nature of Alice.\" On prior versions, Burton said \"It was always a girl wandering around from one crazy character to another, and I never really felt any real emotional connection.\" His goal with the new movie is to give the story \"some framework of emotional grounding\" and \"to try and make Alice feel more like a story as opposed to a series of events.\"[14] Burton focused on the poem \"Jabberwocky\" as part of his structure,[42] and refers to the described creature by the name of the poem rather than by the name \"Jabberwock\" used in the poem. Burton also stated that he does not see his version as either a sequel to any existing Alice film nor as a \"re-imagining\".[41] However, the idea of the climax of the story being Alice's battle with the Queen's champion, the Jabberwocky, was first added in the video game American McGee's Alice, and the landscape, tower, weapons and appearance of Alice in those scenes of the movie are very reminiscent of the same scenes in the game.This film was originally set to be released in 2009 but was pushed back to March 5, 2010.[44] Principal photography was scheduled for May 2008, but did not begin until September and concluded in three months.[40][45] Scenes set in the Victorian era were shot at Torpoint and Plymouth from September 1 to October 14. Two hundred and fifty local extras were chosen in early August. Locations included Antony House in Torpoint, Charlestown, Cornwall and the Barbican,[46][47] however, no footage from the Barbican was used. Motion capture filming began in early October at Sony Pictures Studios in Culver City, California, though the footage was later discarded.[48][49][50] Filming also took place at Culver Studios.[51] Burton said that he used a combination of live action and animation, without motion capture.[52] He also noted that this was the first time he had filmed on a green screen.[52] Filming of the green screen portions, comprising 90% of the film, was completed after only 40 days.[53] Many of the cast and crew felt nauseated as a result of the long hours surrounded by green, with Burton having lavender lenses fitted into his glasses to counteract the effect.[53] Due to the constant need for digital effects to distort the actors' physical appearances, such as the size of the Red Queen's head or Alice's height, visual effects supervisor Ken Ralston cited the film as being exhausting, saying it was \"The biggest show I've ever done, [and] the most creatively involved I've ever been.\"[54]Sony Pictures Imageworks designed the visual effects sequences.[55] Burton felt 3D was appropriate to the story's environment.[13] Burton and Zanuck chose to film with conventional cameras, and convert the footage into 3D during post-production; Zanuck explained 3D cameras were too expensive and \"clumsy\" to use, and they felt that there was no difference between converted footage and those shot in the format.[56] James Cameron, who released his 3D film Avatar in December 2009, criticized the choice, stating, \"It doesn't make any sense to shoot in 2-D and convert to 3-D\".[57]","running_time":"108 minutes","Sequel":"On December 7, 2012, Variety announced the development of a sequel to Alice in Wonderland, with Linda Woolverton returning to write a screenplay.[138] On May 31, 2013, James Bobin began talks to direct the sequel under the working title Alice in Wonderland: Into the Looking Glass.[139] Johnny Depp will return as The Hatter, Mia Wasikowska will reprise the role of Alice, and Helena Bonham Carter will return as the Red Queen.[140][141][142] Several other cast-members from the 2010 film will also reprise their roles in the sequel.[143] On November 22, 2013, it was announced that the sequel will be released on May 27, 2016 and that Bobin would direct the film. Rhys Ifans and Sacha Baron Cohen will be featured in the film.[141][144][145] On January 21, 2014, the film was again retitled to Alice in Wonderland: Through the Looking Glass.[146] The title was later reworked once again to Alice Through the Looking Glass.","Release":"On February 12, 2010, major UK cinema chains, Odeon, Vue and Cineworld, had planned to boycott the film because of a reduction of the interval between cinema and DVD release from the usual 17 weeks to 12 (possibly to avoid the release of the DVD clashing with the 2010 FIFA World Cup, which was Disney's pretext for cutting short Alice's theatrical run but UK exhibitors protested that Alice would be less threatened by the World Cup than other titles).[63] A week after the announcement, Cineworld, who has a 24% share of UK box office, chose to play the film on more than 150 screens. Cineworld's chief executive Steve Wiener stated, \"As leaders in 3D, we did not want the public to miss out on such a visual spectacle. As the success of Avatar has shown, there is currently a huge appetite for the 3D experience\".[64] Shortly after, the Vue cinema chain also reached an agreement with Disney, but Odeon had still chosen to boycott in Britain, Ireland and Italy.[65] On February 25, 2010 Odeon had reached an agreement and decided to show the film on March 5, 2010.[66] The Royal premiere took place at the Odeon Leicester Square in London on February 25, 2010 for the fundraiser The Prince's Foundation for Children and The Arts where the Prince of Wales and the Duchess of Cornwall attended. It also did not affect their plans to show the film in Spain, Germany, Portugal and Austria.[65][67][68] The film was released in the U.S. and UK, in both Disney Digital 3D and IMAX 3D,[45] as well as regular theaters on March 5, 2010.[69]On June 22, 2009, the first pictures of the film were released, showing Depp as the Mad Hatter, Hathaway as the White Queen, Bonham Carter as the Red Queen and Lucas as Tweedledee and Tweedledum.[45] A new image of Alice was also released.[70] In July, new photos emerged of Alice holding a white rabbit, the Mad Hatter with a hare, the Red Queen holding a pig, and the White Queen with a mouse.[71]On July 22, 2009, a teaser trailer from the Mad Hatter's point of view was released on IGN but was shortly taken down because Disney claimed that the trailer was not supposed to be out yet. The teaser was also planned to premiere along with a trailer of Robert Zemeckis' film adaptation of A Christmas Carol on July 24, 2009 for G-Force. The following day, the teaser trailer premiered at Comic-Con but the trailer shown was different from the one that leaked. The ComicCon version didn't have the Mad Hatter's dialogue. Instead, it featured \"Time to Pretend\" by MGMT, and the clips shown were in different order than in the leaked version. The leaked version was originally to be shown to one of the three Facebook groups used to promote the film that had the most members. The groups used to promote the film are \"The Loyal Subjects of the Red Queen\", \"The Loyal Subjects of the White Queen\" and \"The Disloyal Subjects of the Mad Hatter\".[72]Also at ComicCon, props from the film were displayed in an \"Alice in Wonderland\" exhibit. Costumes featured in the exhibit included the Red Queen's dress, chair, wig, spectacles and scepter; the White Queen's dress, wig and a small model of her castle; the Mad Hatter's suit, hat, wig, chair and table; Alice's dress and battle armor (to slay the Jabberwocky). Other props included the \"DRINK ME\" bottles, the keys, an \"EAT ME\" pastry and stand-in models of the White Rabbit and March Hare.[73]A nighttime party area at the Disney's California Adventure theme park was created, called \"Mad T Party\".On July 23, 2009, Disney Interactive Studios announced that an Alice in Wonderland video game, developed by French game studio Étranges Libellules, would be released in the same week as the film for the Wii, Nintendo DS and Microsoft Windows, with the soundtrack being composed by veteran video games music composer Richard Jacques.[74] The Wii, DS and PC versions were released on March 2, 2010.Disney Interactive released in 2013 the game Alice in Wonderland: A New Champion for iOS.[75]Walt Disney Studios Home Entertainment released a 3-disc Blu-ray combo pack (which includes the Blu-ray, DVD and a digital copy), 1-disc Blu-ray and 1-disc DVD on June 1, 2010 in the US and July 1, 2010 in Australia.[76] All versions are presented in 1080p with a 16:9 aspect ratio and Dolby Digital 5.1 HD surround sound. The DVD release includes three short features about the making of the film, focusing on Burton's vision for Wonderland and the characters of Alice and the Mad Hatter. The Blu-ray version has nine additional featurettes centered on additional characters, special effects and other aspects of the film's production.[77] In some confusion, a small number of copies were put on shelves a week before schedule in smaller stores, but were quickly removed, although a handful of copies were confirmed purchased ahead of schedule.In its first week of release (June 1–6, 2010), it sold 2,095,878 DVD units (equivalent to $35,441,297) and topped the DVD sales chart for two continuous weeks. By May 22, 2011, it had sold 4,313,680 units ($76,413,043). It failed to crack the 2010 top ten DVDs list in terms of units sold, but reached 10th place on that chart in terms of sales revenue.[78][79]","budget":"$150[2][3]–$200[4] million","screenplay_by":"Linda Woolverton","Plot":"Troubled by a strange recurring dream and mourning the loss of her beloved father, nineteen-year-old Alice Kingsleigh attends a garden party at Lord Ascot's estate. There she is confronted by an unwanted marriage proposal to Hamish Ascot and the stifling expectations of the society in which she lives. Unsure of how to proceed, she pursues a rabbit wearing a blue waistcoat and accidentally falls into a large rabbit hole under a tree. She emerges in a forest where she is greeted by the White Rabbit, the Dormouse, the Dodo, the Talking Flowers, and Tweedledee and Tweedledum. They argue over her identity as \"the right Alice\" who must slay the Red Queen's Jabberwocky and restore the White Queen to power, as foretold by Absolem the Caterpillar and his prophetic scroll. The group is then ambushed by the Bandersnatch and a group of playing-card soldiers led by the Knave of Hearts. Alice, Tweedledum and Tweedledee escape into the woods. The Knave steals the Caterpillar's scroll. The Dormouse leaves the others behind with one of the Bandersnatch's eyes in her possession. Tweedledum and Tweedledee are then captured by the Red Queen's Jubjub bird.The Knave informs the Red Queen that Alice threatens her reign, and the soldiers and Bayard the Bloodhound are ordered to find Alice immediately. Meanwhile, the Cheshire Cat guides Alice to the March Hare and the Hatter. The Hatter helps Alice avoid capture by allowing himself to be seized instead. Later, Alice is found by Bayard the Bloodhound; but Alice insists upon helping the Hatter. At the Queen's citadel, the Red Queen is unaware of Alice's true identity and therefore welcomes her as a guest. Alice learns that the Vorpal Sword, the only weapon capable of killing the Jabberwocky, is locked inside the den of the Bandersnatch. The Knave crudely attempts to seduce Alice, but she rebuffs him, and a jealous Red Queen orders Alice beheaded. Alice obtains the sword and befriends the Bandersnatch by returning its eye. She then escapes on the back of the grateful Bandersnatch and delivers the sword to the White Queen. The Cheshire Cat saves the Hatter from the executioner, and the Hatter calls for rebellion against the Red Queen. The rebellion is quickly put down by the Jubjub bird, but the resistance flees to the White Queen's castle, and both armies prepare for battle. Former caterpillar Absolem advises Alice to fight the Jabberwocky just before completing his transformation into a pupa.On the appointed day, the White and Red Queens gather their armies on a chessboard-like battlefield and send Alice and the Jabberwocky to decide the battle in single combat. Encouraged by the advice of her late father, Alice fights the Jabberwocky among the ruins surrounding the battlefield and finally jumps from the remains of a spiral staircase onto the Jabberwocky's neck and beheads it. The White Queen sends the Red Queen and the Knave into exile. After the Hatter performs a celebration dance called Futterwacken, the White Queen gives Alice a vial of the Jabberwocky's purple blood whose power will bring her whatever she wishes. She decides to rejoin the everyday world. Back in England, Lord Ascot takes Alice as his apprentice with the idea of establishing oceanic trade routes to Hong Kong. As the story closes, Alice prepares to set off on a trading ship. A light-blue butterfly lands on her shoulder, and Alice recognizes him as Absolem.","Reception":"Alice in Wonderland earned $334,191,110 in North America, as of July 8, 2010, and $691,276,000 in other territories, as of July 10, 2011, for a worldwide total of $1,025,467,110.[5][80][81] Worldwide, it is currently the twenty-third highest-grossing film[82] and the second highest-grossing 2010 film.[83] It is the third highest-grossing film starring Johnny Depp,[84] the highest-grossing film directed by Tim Burton[85] and the second highest-grossing children's book adaptation (worldwide, as well as in North America and outside North America separately).[86]On its first weekend, the film made $220.1 million worldwide, marking the second-largest opening ever for a movie not released during the summer or the holiday period (behind The Hunger Games), the fourth largest for a Disney-distributed film and the fourth largest among 2010 films.[87] It dominated for three consecutive weekends at the worldwide box office.[88][89][90][91] On May 26, 2010, its 85th day of release, it became the sixth film ever to surpass the $1-billion-mark and the second film that had been released by Walt Disney Studios that did so.[92][93]Alice in Wonderland is the forty-fourth highest-grossing film but out of the top 100 when adjusted for inflation. It is also the second highest-grossing 2010 film, behind Toy Story 3,[94] the second highest-grossing film starring Johnny Depp[84] and the highest-grossing film directed by Tim Burton.[85] The film opened on March 5, 2010, on approximately 7,400 screens at 3,728 theaters with $40,804,962 during its first day, $3.9 million of which came from midnight showings,[95] ranking number one and setting a new March opening-day record.[96] Alice earned $116.1 million on its opening weekend, breaking the record for the largest opening weekend in March (previously held by 300),[97] the record for the largest opening weekend during springtime (previously held by Fast and Furious), the largest opening weekend for a non-sequel (previously held by Spider-Man)[98] and the highest one for the non-holiday, non-summer period. However, all of these records were broken by The Hunger Games ($152.5 million) in March 2012.[99][100] Alice made the seventeenth highest-grossing opening weekend ever[101] and the fifth largest among 3D films.[102] Opening-weekend grosses originating from 3D showings were $81.3 million (70% of total weekend gross). This broke the record for the largest opening-weekend 3D grosses[103][104] but it was topped by Marvel's The Avengers ($108 million).[105] It had the largest weekend per theater average of 2010 ($31,143 per theater) and the largest for a PG-rated film.[106] It broke the IMAX opening-weekend record[107] by earning $12.2 million on 188 IMAX screens, with an average of $64,197 per site. The record was first overtaken by Deathly Hallows – Part 2 ($15.2 million).[104] Alice remained in first place for three consecutive weekends at the North American box office.[108][109] Alice closed in theaters on July 8, 2010 with $334.2 million.Outside North America, Alice is the thirteenth highest-grossing film,[110] the highest-grossing 2010 film,[111] the fourth highest-grossing Disney film, the second highest-grossing film starring Johnny Depp[84] and the highest-grossing film directed by Tim Burton.[85] It began with an estimated $94 million, on top of the weekend box office, and remained at the summit for four consecutive weekends and five in total.[112][113] Japan was the film's highest-grossing country after North America, with $133.7 million, followed by the UK, Ireland and Malta ($64.4 million), and France and the Maghreb region ($45.9 million).[114]The film received mixed reviews. Review aggregate Rotten Tomatoes reports that 52% of critics have given the film a positive review based on 262 reviews, with an average score of 5.7/10 and the consensus \"Tim Burton's Alice sacrifices the book's minimal narrative coherence—and much of its heart—but it's an undeniable visual treat\".[115] Metacritic, which assigns a weighted average score out of 1–100 reviews from film critics, has a rating score of 53 based on 38 reviews.Todd McCarthy of Variety praised it for its \"moments of delight, humor and bedazzlement\", but went on to say, \"But it also becomes more ordinary as it goes along, building to a generic battle climax similar to any number of others in CGI-heavy movies of the past few years\".[116] Michael Rechtshaffen of The Hollywood Reporter said \"Burton has delivered a subversively witty, brilliantly cast, whimsically appointed dazzler that also manages to hit all the emotionally satisfying marks\", while as well praising its computer-generated imagery (CGI), saying \"Ultimately, it's the visual landscape that makes Alice's newest adventure so wondrous, as technology has finally been able to catch up with Burton's endlessly fertile imagination.\"[117] Owen Gleiberman of Entertainment Weekly said, \"But Burton's Disneyfied 3-D Alice in Wonderland, written by the girl-power specialist Linda Woolverton, is a strange brew indeed: murky, diffuse, and meandering, set not in a Wonderland that pops with demented life but in a world called Underland that's like a joyless, bombed-out version of Wonderland. It looks like a CGI head trip gone post apocalyptic. In the film's rather humdrum 3-D, the place doesn't dazzle—it droops.\"[118] Roger Ebert of the Chicago Sun-Times awarded the film three out of four stars and wrote in his review that, \"Alice plays better as an adult hallucination, which is how Burton rather brilliantly interprets it until a pointless third act flies off the rails.\"[119] The market research firm CinemaScore found that audiences gave the film an average rating of \"A-\".[120]Several reviews criticized the decision to turn Alice into a \"colonialist entrepreneur\" at the end of the film setting sail for China.[121][122][123] Given Britain's role in the First and Second Opium Wars during the Victorian era and the foreign domination of China through \"unequal treaties\", China expert Kevin Slaten writes, \"Not only is it troubling imagery, for a female role model in a Disney movie, but it's also a celebration of the exploitation that China suffered for a century.\"[124]Game developer American McGee, best known for creating Alice and Alice: Madness Returns, was asked in a 2011 interview about Tim Burton's interpretation of the title character since both versions share almost similar dark and twisted tone of Wonderland. McGee praised the film's visuals and audio but criticized the lack of screen time Alice had compared to the other characters. He felt Alice did not have any purpose in the story and that she was merely used as a \"tool.\"[125]","Music":"Longtime Burton collaborator Danny Elfman's score was released March 2, 2010.[58] It debuted at #89 on the Billboard Top 200 albums chart.[59]Almost Alice is a collection of various artists' music inspired by the film.[58][60][61] The lead single, \"Alice\" by Avril Lavigne, premiered on January 27, 2010 on Ryan Seacrest's radio program. Other singles include \"Follow Me Down\" by 3OH!3, \"Her Name Is Alice\" by Shinedown, and \"Tea Party\" by Kerli.[62] The album was released on March 2, 2010.[58]","produced_by":"Richard D. Zanuck|Joe Roth|Suzanne Todd|Jennifer Todd|","starring":"Johnny Depp|Anne Hathaway|Helena Bonham Carter|Crispin Glover|Matt Lucas|Mia Wasikowska|Alan Rickman|Stephen Fry|Michael Sheen|Timothy Spall|","music_by":"Danny Elfman","edited_by":"Chris Lebenzon"}