{"distributed_by":"20th Century Fox","Plot":"While serving in the Gulf War, Lieutenant Colonel Serling (Denzel Washington) accidentally destroys one of his own tanks during a confusing night-time battle, killing his friend Captain Boylar. The US Army covers up the details and transfers Serling to a desk job.Later, Serling is assigned to determine if Captain Karen Emma Walden (Meg Ryan) should be the first woman to receive a (posthumous) Medal of Honor. She was the commander of a Medevac Huey who was sent to rescue the crew of a shot-down Black Hawk. When she encountered a T-54, her crew destroyed it by dropping a fuel bladder onto the tank and igniting it with a flare gun. However, her own helicopter was shot down soon after. The two crews were unable to join forces, and on the next day when further rescue arrived, Walden was reported dead.Serling notices inconsistencies between the testimonies of Walden's crew. Specialist Andrew Ilario, the medic (Matt Damon), praises Walden heavily. Staff Sergeant John Monfriez (Lou Diamond Phillips) claims that Walden was a coward and that Monfriez himself led the crew in combat, and that the fuel bladder technique was originated by him. Sergeant Altameyer, who is dying in a hospital, complains about a fire. Warrant Officer One Rady, the co-pilot, was injured early on and rendered unconscious. Meanwhile, the crew of the Black Hawk claims that they heard firing from an M16, which Ilario and Monfriez deny.Under pressure from the White House and his commander, Brigadier General Hershberg (Michael Moriarty), to wrap things up quickly, Serling leaks the story to newspaper reporter Tony Gartner (Scott Glenn) to prevent another cover up. When Serling puts pressure on Monfriez during a car ride, Monfriez forces him to get out of the vehicle at gunpoint, then commits suicide by driving into an oncoming train.Serling tracks down Ilario using details about Ilario's preferred vacation spot. Ilario tells the true story, revealing that Monfriez wanted to flee while leaving Rady behind. As a result, Monfriez held Walden at gun-point. When Walden shot an approaching enemy, Monfriez reacted by shooting Walden in the stomach, then voluntarily backing off. The next morning, Walden covered her men's retreat using an M16, with the expectation that the rescue team would come back for her. However, Monfriez lied to the rescuers, saying that Walden was dead, which led to A10s dropping napalm on the entire area, leading to Walden's death. Altameyer tried to tell the truth but he was too injured to speak. Ilario was too scared and remained silent.Serling presents his final report to Hershberg. Walden's young daughter receives the Medal of Honor at a White House ceremony. Later, Serling tells the truth to the Boylars about the manner of their son's death and says he cannot ask for forgiveness. The Boylars respond saying Serling must put down the burden at some point. In the last moments of the film, it is shown that Walden was coincidentally the pilot who had evacuated Boylar's body after Serling's friendly fire incident.","language":"English","Reception":"The film opened #3 at the box office behind Independence Day and Phenomenon[3]The film received mostly positive reviews. As of January 14, 2013, the review aggregator website Rotten Tomatoes reported that 85% of critics gave the film a positive review based upon a sample of 53 reviews with an average rating of 7.3/10. The critical consensus states that the film is \"an emotional and intriguing tale of a military officer who must review the merits of a fallen officer while confronting his own war demons. Effectively depicts the terrors of war as well as its heartbreaking aftermath.\"[4] At the website Metacritic, which utilizes a normalized rating system, the film earned a generally favorable rating of 77/100 based on 19 mainstream critic reviews.[5]The movie was commended by several critics. James Berardinelli of the website ReelReviews wrote that the film was, “As profound and intelligent as it is moving, and that makes this memorable motion picture one of 1996's best.”[6] Roger Ebert of the Chicago Sun-Times spoke positively of the film saying that while the ending “…lays on the emotion a little heavily” the movie had been up until that point “…a fascinating emotional and logistical puzzle—almost a courtroom movie, with the desert as the courtroom.”[7]Denzel Washington’s acting was specifically lauded as Peter Travers of Rolling Stone wrote, “In Washington's haunted eyes, in the stunning cinematography of Roger Deakins (Fargo) that plunges into the mad flare of combat, in the plot that deftly turns a whodunit into a meditation on character and in Zwick's persistent questioning of authority, Courage Under Fire honors its subject and its audience.”[8] Additionally Peter Stack of the San Francisco Chronicle said that, “Denzel Washington is riveting.”[9]Denzel Washington was nominated for Best Actor at the 1996 Chicago Film Critics Association Awards, but lost to Billy Bob Thornton in Sling Blade.","box_office":"$100,860,818","Historical accuracy":"The Medal of Honor had been awarded to a woman, Mary Edwards Walker, an American Civil War physician, but not for valor in combat. A White House aide played by Bronson Pinchot makes the distinction.[clarification needed]","cinematography":"Roger Deakins","production_company":"Davis Entertainment","directed_by":"Edward Zwick","release_dates":"July 12, 1996","Production":"The U.S. Department of Defense withdrew its cooperation for the film so the tanks Serling commanded early in the film were British Centurions shipped from Australia with sheet metal added to make them resemble M1A1 Abrams. These visually modified tanks were used to simulate the Abrams in several other motion pictures afterwards as well.ROTC Cadets from Texas A&M University were extras in the background in some of the training camp scenes.The Iraqi battle scenes were filmed at the Indian Cliffs Ranch, located just outside El Paso, Texas. Many of the props were left there and became a tourist attraction. The White House rose garden set was destroyed twice: once by a tornado, and once by a sandstorm.In order to lose 40 pounds (18 kilograms) for the later scenes, Matt Damon went on a strict regimen of food deprivation and physical training. On Inside the Actors Studio, Damon said that the regimen consisted of six and a half miles of running in the morning and again at night, a diet of chicken breast, egg whites, and one plain baked potato per day, and a large amount of coffee and cigarettes. His health was affected to the extent that he had to have medical supervision for several months afterwards. His efforts, however, did not go unnoticed; director Francis Ford Coppola was so impressed by Damon's dedication to method acting that he offered him the leading role in The Rainmaker (1997). Steven Spielberg was also impressed by his performance, but thought he was too skinny and discounted him from casting considerations for Saving Private Ryan until he met Damon during the filming of Good Will Hunting when he was back at his normal weight.[10]","produced_by":"John Davis Joseph M. Singer David T. Friendly","starring":"Denzel Washington Meg Ryan Lou Diamond Phillips Matt Damon Scott Glenn Michael Moriarty Bronson Pinchot Seth Gilliam","running_time":"117 minutes","courage_under_fire":"Theatrical release poster","music_by":"James Horner","edited_by":"Steven Rosenblum","written_by":"Patrick Sheane Duncan","budget":"$46 million[1]"}