{"based_on":"Murder in Amityville  by Hans Holzer","country":"Mexico United States","distributed_by":"Orion Pictures","screenplay_by":"Tommy Lee Wallace Dardano Sacchetti (uncredited)","Inconsistencies":"While a prequel, Amityville II contradicts the opening of the 1979 film which shows the family massacre, and like the actual event they are all sleeping. The bodies are also removed from the house in the morning, but in the first film, it's in the middle of the night.Some of the family drama in the film did happen to the Defeos, but are exaggerated. The story introduces speculative and controversial themes, including an incestuous relationship between Sonny Montelli and his teenaged sister, who are based loosely on Ronald DeFeo, Jr. and his sister, Dawn and a rumored incestuous relationship.Though supposedly set one year before the first Amityville Horror film, Amityville II is full of elements that are clearly from the 1980s, such as a miniature \"Walkman\" radio/headphone set and the presence of 1982 cars, televisions, etc.","Plot":"The Montelli family; father Anthony (Young), mother Dolores (Alda), elder son Sonny (Magner), elder teenaged daughter Patricia (Franklin) and two younger kids, move into what they think would be the house of their dreams. Initially things begin well, but everything changes after it is discovered that there is a tunnel in the basement leading into the house - from where is unknown.An evil presence is shown to be lurking within, unknown to the family. After unusual and paranormal activities, like unknown forces banging on the door at night (when nobody is outside) and an ugly demonic message painted on the wall of the youngest Montelli kid's room, Dolores tries to have the local priest, Father Frank Adamsky (Olson) bless the house but an argument breaks out within the family shortly after Adamski arrives, and Anthony orders him to leave. Adamsky leaves, disgusted at Anthony's behaviour. He finds his car door open and the Bible on the passenger seat torn to pieces. It is shown all is not well with the Montelli family - Anthony is strict but abusive, and sacrilegious towards the Church, and Dolores is trying to keep it together for the youngest kids. Also, Sonny and Patricia are revealed to have started to have sexual feelings for each other, due to mutual attraction that neither can act on. Soon afterward, the family go to church with Anthony, so he can apologize for being rude to Adamsky; Sonny stays at home, claiming to feel unwell. He soon hears an alarming noise and goes downstairs to get his father's gun. He hears demonic laughter and follows it to the tunnel in the basement. The (unseen) presence pursues a frightened Sonny to his room and he then falls victim to demonic possession. The first thing a now possessed Sonny does is approach Patricia to \"play a game\" with her - where he is a famous photographer and she is his famous nude model. She agrees to pose naked, and the pair end up having incestuous sex. She later reveals to Sonny when the two are alone that she enjoyed having sex with her brother, and doesn't feel guilty about it.She goes to tell Father Adamsky this, but has a breakdown before she can confess; Sonny becomes more sinister and demon-like, as his face starts contorting demonically. Startled, he tries to keep his family away, but is unsuccessful due to the demon's influence. On Sonny's birthday, he isolates himself from his birthday party, and calls Patricia who comes up to check on him. She freely offers him sex once more. However, due to his demonic phases and his body's gradual demonic contortions, he sends her away, Using foul language ate her as Patricia runs away crying, and tries to tell Adamsky that she thinks Sonny is possessed, but he does not answer. Later that night, the evil spirit tells Sonny to \"kill them all\". Sonny goes and gets his father's rifle, shoots his father, his mother, his younger sister, his younger brother; and after a chase, finally kills Patricia.The next day the cops arrive and pick up the bodies; Sonny is arrested, but states he does not recall of ever killing his family. Adamsky then realizes that Sonny is possessed and asks the church if he can perform an exorcism on Sonny but they refuse, not believing him. He therefore takes it upon himself to act without the support of the church. After freeing him from police custody, he takes him to church where Sonny attacks Adamsky and escapes after seeing the crosses on the doors. Adamsky soon runs after Sonny and traces him to the house, where he performs the exorcism, releasing Sonny's soul. As the cops arrive, Adamsky asks Father Tom (Prine) to take Sonny away from him. Tom takes Sonny outside, where the police arrest him and take him back into custody. It is then revealed that the demon has transferred itself into Adamsky. What happens to Father Adamsky afterwards is unknown. Sometime later, the house is put back on sale, setting up the events of The Amityville Horror...","language":"English","Reception":"Amityville II: The Possession was panned by film critics. Rotten Tomatoes's site 7% positives reviews. Critics panned this film went overboard with the effects and the storyline was not as interesting as expected to be.[7] Roger Ebert of the Chicago Sun-Times, who gave the first film a negative review, claimed the film \"is actually slightly better than The Amityville Horror\" and mentioned some good technical credits and performances and gave the film 2 out of 4 stars.[8] He and Gene Siskel selected the film as one of the worst of the year in a 1982 episode of Sneak Previews.[9] Rutanya Alda was nominated as Worst Supporting Actress at the 1982 Golden Raspberry Awards, for the second time (the first was for Mommie Dearest). Leonard Maltin's annual publication \"TV Movies,\" gives the film a \"BOMB\" rating.","box_office":"$12.5 million[1]","cinematography":"Franco Di Giacomo","production_company":"Dino De Laurentiis Corporation","directed_by":"Damiano Damiani","amityville_ii:_the_possession":"Theatrical release poster","release_dates":"September 24, 1982 (1982-09-24)","Production":"Principal photography began March 8, 1982 at the same house in Toms River, New Jersey that the previous film used. After two weeks on location in New Jersey, unlike the first Amityville film, studio shooting was done in Mexico City for eight or nine weeks at Estudios Churubusco Azteca S.A.[3]The explosion scene at the end of the film was real during filming. A highly explosive chemical which produces flames that burn out instantly was used. During filming of the explosion scene at the end of the movie the effect reportedly backfired and burned the side of the house.George Lutz wanted the sequel to the 1979 film to be based on the book The Amityville Horror Part II by John G. Jones, but the producer Dino De Laurentiis secured a deal with American International Pictures for a sequel based on Murder in Amityville by Hans Holzer. Lutz sued De Laurentiis and ultimately lost, but succeeded in having posters placed in theaters stating \"This film has no affiliation with George and Kathy Lutz.\"[4]After director Damiano Damiani's original cut of the film was shown to test audience, several scenes had to be cut out for various reasons, one of them being the negative reaction of audience on the scene where Anthony anally rapes Dolores and scene where Sony and Patricia have incestuous sex. This scene was added into the script by Damiani who wanted to really upset the viewers. Original scene was lot more graphic and sexual, while in the movie it cuts to the next scene right after Sony starts kissing Patricia. Some other deleted scenes were shown on lobby cards and stills for the movie, like the scene where Anthony is sitting outside the house drinking and cleaning the gun and scene where Jan is pushing Mark's head under the water while he is in the bathtub. Theatrical trailer also shows shot of Jan and Mark looking at the window and holding hands. Only deleted scene which was ever released in some form is so called \"Lost Souls\" scene where souls that are within the house appear in front of Adamsky during the ending of the movie and he blesses them. No actual footage was released but UK special collector's edition DVD includes several stills from this deleted scene.[5][6]","produced_by":"Ira N. Smith Stephen R. Greenwald","starring":"James Olson|Burt Young|Rutanya Alda|Jack Magner|Diane Franklin|Moses Gunn|","running_time":"104 minutes","music_by":"Lalo Schifrin","edited_by":"Sam O'Steen"}