{"Cast":"Dan Haggerty, who famously portrayed the titular character in the popular television series The Life and Times of Grizzly Adams, appears as himself in a post-credits cameo.","country":"United States","distributed_by":"Pantelion Films","language":"Spanish English","Reception":"Casa de Mi Padre opened on March 16, 2012, and despite playing in only 382 locations, the film debuted in ninth place in its opening weekend and earned $2,200,000; an average of $5,759 per locale. According to exit polling the audience was 51% male and 68% Hispanic.[12] The film closed in theatres on May 17, 2012, grossing $5,909,483 in the United States and $8,041,667 worldwide.[13]Casa de Mi Padre has received mixed reviews from film critics. Metacritic assigned the film an average score of 52/100 based on reviews from 32 film critics.[14] Rotten Tomatoes gives it a 42% approval rating, with an average rating of 5.3/10, based on an aggregation of 103 reviews, and offers the consensus; \"Thinly written and not as funny as it needs to be, Casa de mi Padre would have worked better as a fake trailer or short film; stretched to feature length, it wears out its welcome far too quickly\".[15]Claudia Puig of USA Today declared, \"This very funny spoof of telenovelas and classic Mexican westerns is decidedly offbeat and absurdly daffy\".[16] Owen Gleiberman of Entertainment Weekly praised Will Ferrell's performance, writing \"Ferrell is a good straight actor for the same reason that he's an inspired comedian: He commits himself to every moment. Even in a movie whose highest ambition is to be true to its quaintly delectable tackiness\".[17] Manohla Dargis of The New York Times commented that \"Casa de Mi Padre demands that you not take it seriously, and for the most part that's easy to do\".[18]Todd McCarthy of The Hollywood Reporter stated, \"It makes sense that this Spanish-lingo farce plays very much like an SNL sketch. The only problem is that it packs about as many laughs into its 85 minutes as a good skit does in eight or 10\".[19] Justin Chang of Variety called it \"a likable enough lark that rarely achieves outright hilarity\".[20] Roger Ebert of the Chicago Sun-Times remarked, \"The movie is only 84 minutes long, including credit cookies, but that is quite long enough\".[21]","Premise":"Armando Álvarez (Will Ferrell) has lived and worked on his father's ranch in Mexico his entire life. As the ranch encounters financial difficulties, Armando's younger brother Raúl (Diego Luna), shows up with his new fiancée, Sonia (Génesis Rodríguez). It seems that Raúl's success as an international businessman means the ranch's troubles are over as he pledges to settle all debts his father has incurred. But when Armando falls for Sonia, and Raúl's business dealings turn out to be less than legitimate, all hell breaks loose as they find themselves in a war with Mexico's most feared drug lord, the mighty Onza (Gael García Bernal).[1]","box_office":"$8,041,667","cinematography":"Ramsey Nickell","production_company":"Gary Sanchez Productions NALA Films","directed_by":"Matt Piedmont","Soundtrack":"The original score for the film was composed by Andrew Feltenstein and John Nau. Singer Christina Aguilera provided the title track, \"Casa de Mi Padre\", and appears during the opening sequence.The film's soundtrack consists of 20 tracks, and includes the songs performed by Will Ferrell; \"Fight for Love\" with Genesis Rodriguez and \"Yo No Sé\" with Efren Ramirez and Adrian Martinez, which were featured in the film.[9] The soundtrack was engineered and mixed by Dana Nielsen.[10][11]","release_dates":"March 13, 2012 (2012-03-13) (South by Southwest Film Festival)|March 16, 2012 (2012-03-16) (United States)||||","Production":"In August 2010, Emilio Diez Barroso and Darlene Carmaño Loquet of NALA Films announced that they were teaming up with Will Ferrell, Adam McKay, Kevin Messick, and Jessica Elbaum of Gary Sanchez Productions to produce the Spanish-language comedy, Casa de Mi Padre, starring Will Ferrell. NALA Films was to finance the project; it was set to start filming in September 2010 in California. Producer Darlene Caamano Loquet stated, \"We are just thrilled he [Ferrell] is on board and are moving full steam ahead since we have one month to teach him Spanish\".[4]In October 2010, it was reported that Gael García Bernal and Diego Luna had joined the cast along with Génesis Rodríguez, Pedro Armendáriz, Jr., Hector Jimenez, and Adrian Martinez. Bernal will play a family friend, Luna will play Ferrell's brother and Rodriguez will play Ferrell's love interest. Matt Piedmont, a frequent collaborator with Will Ferrell, was named as the film's director. It was also reported that the plot will be told in an overly dramatic telenovela style and feature English subtitles.[2] In January 2011, a synopsis of the plot was released along with a report that the title changed to Untitled Spanish Comedy.[1] However, in April 2011, a teaser trailer for the film was released under the name Casa de Mi Padre.[5]The film was shot in 24 days on a budget of about $6 million.[6]","produced_by":"Will Ferrell|Adam McKay|Emilio Diez Barroso|Darlene Carmaño Loquet|Andrew Steele|","starring":"Will Ferrell|Gael García Bernal|Diego Luna|Génesis Rodríguez|Pedro Armendáriz, Jr.|Nick Offerman|Efren Ramirez|Adrian Martinez|","running_time":"85 minutes","music_by":"Andrew Feltenstein|John Nau|","edited_by":"David Trachtenberg","Release":"In November 2011, Pantelion Films, a joint venture between Lions Gate Entertainment and Televisa, acquired the rights to distribute the film in the United States and set a release date of March 16, 2012.[3] Upon release, the film played on 368 screens, a \"fraction of what Mr. Ferrell’s movies typically receive.\"[6] Televisa gave NALA Films approval over all aspects of the film's $8 million marketing campaign which was spent mostly on advertisements on TV networks such as Univision, a partly Televisa owned company.[7]The U.S. premiere was held on Wednesday, March 14, 2012, at Grauman's Chinese Theatre in Hollywood, California.[8]","written_by":"Andrew Steele","budget":"$6 million"}