{"country":"United States","distributed_by":"Universal Pictures","cry-baby":"Theatrical release poster","Plot":"In 1954 Baltimore, Wade \"Cry-Baby\" Walker is the leader of a gang of \"drapes\", which includes his sister Pepper, a teenage mother; Mona \"Hatchet Face\" Malnorowski, who is facially disfigured; Wanda Woodward, who is constantly embarrassed by her yuppie parents; and Milton Hackett, Hatchet Face's devoted boyfriend. Walker's ability to shed a single tear drives all the girls wild. One day after school, he is approached by Allison Vernon-Williams, a pretty girl tired of being a \"square\", and the two fall in love. That same day, Cry-Baby approaches the \"square\" part of town to a talent show at the recreation center where Allison's grandmother hosts events, and introduces himself to her, who is skeptical of his motives. Cry-Baby invites Allison to a party at Turkey Point, a local hangout spot for the drapes.Despite her grandmother's skepticism, Allison accompanies Cry-Baby to Turkey Point and sings with the drapes. As Cry-Baby and Allison tell each other about their orphan lives (Cry-Baby's father was sent to the electric chair after being the \"Alphabet Bomber\" - a killer who bombed places in alphabetical order. While his mother tried to stop him, but also got sent to the electric chair as a result; Allison's parents always took separate flights to avoid orphaning her if they crashed, but one day both their planes went down), Allison's jealous square boyfriend, Baldwin, starts a riot. Cry-Baby is blamed for the fight and sent to a penitentiary, outraging all his friends and even Allison's grandmother, who is impressed by Cry-Baby's posture, manners, and musical talent.As Lenora Frigid, a loose girl with a crush on Cry-Baby, but constantly rejected by him, claims to be pregnant with his child, Allison feels betrayed and returns to Baldwin and the squares, though her grandmother advises her against rushing into a decision. Meanwhile, in the penitentiary, Cry-Baby gets a teardrop tattoo. He tells the tattoo artist, fellow drape Dupree (Robert Tyree): \"I've been hurt all my life, but real tears wash away. This one's for Allison, and I want it to last forever!\".Eventually after performing with Baldwin and the Whiffles, Allison is persuaded by the newly established alliance between the Drapes and her grandmother to stand by Cry-Baby and join the campaign for his release. Cry-Baby is released, but immediately insulted by Baldwin, who after revealing that his grandfather is the one who electrocuted Cry-Baby's father, challenges him to a chicken race. Cry-Baby wins, as Baldwin chickens out, and is reunited with Allison.The film ends with all watching the chicken race crying a single tear, except for Allison and Cry-Baby, who has finally let go of the past, enabling him to cry from both eyes.","language":"English","box_office":"$8.3 million[3]","cinematography":"David Insley","production_company":"Imagine Entertainment","directed_by":"John Waters","Musical adaptation":"Cry-Baby is the second of Waters' films to be adapted for the stage as a musical comedy (following Hairspray).","release_dates":"April 6, 1990 (1990-04-06)|||||","produced_by":"Rachel Talalay","starring":"Johnny Depp|Amy Locane|Susan Tyrrell|Iggy Pop|Ricki Lake|Traci Lords|Polly Bergen|","running_time":"85 minutes[1]","music_by":"Patrick Williams","edited_by":"Janice Hampton","Release":"Cry-Baby was screened out of competition at the 1990 Cannes Film Festival.[4]The film received positive reviews from critics. On Rotten Tomatoes, it currently holds a 73% score, based on 55 reviews, with an average rating of 6.6/10. The site's consensus states: \"John Waters' musical ode to the teen rebel genre is infectious and gleefully camp, providing star Johnny Depp with the perfect vehicle in which to lampoon his pin-up image.\"[5] Roger Ebert of the Chicago Sun-Times awarded the film 3 out of 4 stars.[6]The film opened on April 6, 1990 in 1,229 North American cinemas — an unprecedented number for a John Waters film. In its opening weekend, it grossed a soft $3,004,905 ($2,445 per screen) and grossed $8,266,343 by the end of its theatrical run,[3] making it a box office flop from its $12 million budget.[2]","written_by":"John Waters","budget":"$12 million[2]"}