{"country":"United Kingdom","distributed_by":"Anglo-Amalgamated","Plot":"The journalist Ted York (Terence Longdon) is rushed to Haven Hospital with appendicitis. The ambulance gets there at top speed, but only because the driver wants to know the result of a horse race. Ted is given a bed and is instantly smitten with Nurse Denton (Shirley Eaton). The other nurses are incessantly having to respond to the calls of the Colonel (Wilfrid Hyde-White), who has a private room. He is an inveterate gambler and is having his bets placed by Mick (Harry Locke), the orderly.That evening, the boxer Bernie Bishop (Kenneth Connor) is admitted after hurting his hand at the end of a bout. The next day, the Sister (Joan Hickson) galvanises the nurses, orderly and patients for the inspection by Matron (Hattie Jacques). As usual, she is let down by Nurse Dawson (Joan Sims), a clumsy probationer. Matron checks on the progress of the patients, and speaks to Mr Hinton (Charles Hawtrey), who is forever listening to the radio with his headphones. Mick and the Colonel bet on how long the Matron will take on her rounds.Ted is visited by his editor and agrees to write a series of articles on his hospital experiences. He realises that Nurse Denton is in love with a doctor, but that her interest is not returned. Bernie is told that he will not be able to box for several months at least. Nurse Dawson is sent to ring the bell to signal the end of visiting hours, but she calls for the fire brigade by mistake.The bookish intellectual Oliver Reckitt (Kenneth Williams) is visited by Jill (Jill Ireland), the sister of his friend Harry. They clearly like each other, but are too shy to admit it. Bernie urges Oliver to admit how he really feels about her. Bernie's manager Ginger (Michael Medwin) comes to visit him and tells him that he must try to be more of a showman and not simply go for broke with every match. Nurse Dawson comes in early to sterilise some rubber catheters, but is interrupted by the demanding Colonel. The catheters are put in a kidney dish to boil on the stove. Oliver is furious when the ward has to be cleared and tidied up for Matron's rounds as it upsets his schedule for no obvious purpose. When she arrives everyone begins to smell the forgotten catheters, which by now are burning on the stove. When Matron stops to speak to Oliver, he complains about the disruptive effects that her visits have on the patients. Matron is furious and has the Sister make all the beds again.Jack Bell (Leslie Phillips) arrives to have a bunion removed and is placed on the ward. Jill comes to see Oliver and they admit that they care for each other. She gives him a bar of nougat as a gift, but later that evening it makes him sick. Mr Able complains that he can not sleep as he has been missing his wife. He is put on medication, but it makes him wildly excited and he runs amok in the hospital. Eventually Bernie subdues him with a left hook to the jaw.Bell's operation is delayed, which upsets him greatly as he is planning a romantic weekend. He offers the men in the ward the champagne he was going to drink with his girlfriend. They all get drunk and decide to remove the bunion themselves. The night nurse is tied up and Hinton pretends to be her while the others go to the operating theatre. Jack starts to panic as Oliver prepares to operate, but soon they are all giggling as the laughing gas has been left on. The nurse arrives before any real damage is done.The colonel plays a trick on Nurse Dawson and pins a piece of paper with a large red 'L' on her back. Ted learns that Nurse Denton is applying for a job in America and tries to dissuade her. Jack catches a cold and is told that his operation will have to be postponed yet again. Oliver is discharged and leaves with Jill. Bernie is met by his young son and they leave together. Ted is also discharged and makes a date with Nurse Denton. Nurse Dawson and Nurse Axwell decide to get even with the Colonel and replace a rectal thermometer with a daffodil. Luckily for them, upon her inspection, Matron manages to see the funny side.","language":"English","Reception":"The film was the most popular at the British box office in 1959,[6] as well as the most successful Carry On film with an estimated ten million admissions.[7]It made an estimated $1.5 million in the US.[1]","carry_on_nurse":"Original UK quad poster","box_office":"$1.5 million[1]","cinematography":"Reginald Dwyer","directed_by":"Gerald Thomas","release_dates":"March 1959","produced_by":"Peter Rogers","starring":"Shirley Eaton Kenneth Connor Charles Hawtrey Hattie Jacques Terence Longdon Bill Owen Leslie Phillips Joan Sims Susan Stephen Kenneth Williams Wilfrid Hyde-White","running_time":"86 min.","Filming and locations":"Interiors:","music_by":"Bruce Montgomery","edited_by":"John Shirley","written_by":"Norman Hudis","budget":"£71,000"}