{"country":"United States","distributed_by":"Warner Bros.","screenplay_by":"\"Sam O. Brown\" Joseph C. Stinson[1]","story_by":"\"Sam O. Brown\"","Plot":"In Kansas City, 1933, near the end of Prohibition,[1] a police lieutenant known by his last name, Speer (Eastwood), is acquainted with a former cop turned private eye named Mike Murphy (Reynolds). Speer and Murphy were once good friends, which changed after Murphy left the force.[1]On a rainy night, Speer comes to a diner for coffee. Two goons arrive, looking for Murphy. They pounce the minute Murphy arrives, starting a fistfight. Speer, no fan of Murphy's, ignores the fight until a goon causes him to spill his coffee. Both goons are thrown through the front door. Murphy sarcastically thanks Speer for saving his life.The two rivals have eyes for Murphy's secretary Addy (Jane Alexander). She loves both and proves it when, after tenderly kissing Murphy goodbye, goes on a date with Speer. Murphy does have a new romantic interest, a rich socialite named Caroline Howley (Madeline Kahn), but finds himself unable to commit.Speer and Addy go to a boxing match at which the mob boss Primo Pitt (Rip Torn) is present. Murphy's partner Dehl Swift (Richard Roundtree) is also there, and seems to be in cahoots with Pitt and his gang. Swift is in possession of a briefcase whose contents, secret accounting records of rival gang boss Leon Coll's operations, are the target of both Pitt's and Coll's gangs.Swift, tailed by Speer and Addy, is confronted by Pitt's thugs at his apartment with Ginny Lee (Irene Cara) taken hostage. Ginny Lee manages to escape but Swift is shot and killed during a struggle with Pitt.[1] A thug opens the briefcase but there's nothing inside. He picks up Swift's body and throws it out the window, where it lands on the roof of Speer's parked car (which is occupied by the horrified Addy, who waits after Speer goes to investigate in the apartment).Murphy vows revenge on Pitt for killing his partner. He asks Speer for assistance and they form a reluctant alliance. After meeting with Murphy at a movie, Ginny is confronted by Pitt's thugs outside the theatre. As she tries to escape, she is hit by a car and seriously injured.Murphy and Speer vow to avenge her and also to rescue Caroline, who has been kidnapped by Pitt's gang to force Murphy to hand over the missing records. A final showdown with Pitt and his gang occurs in a warehouse (where Speer continuously and humorously keeps pulling out weapons larger than Murphy's) and in a bordello (where Murphy shows up in costume to rescue Caroline).As what's left of Pitt's gang are hauled off by police, Coll shows up holding Addy at gunpoint and demanding his records. Murphy and Speer hand over the briefcase in exchange for Addy, but the case is booby-trapped. Coll's car is blown up with Coll in it. In the end, the rivals have become friends again, at least until a casual remark leads to another all-out fight in a nightclub and ends with Speer and Murphy stepping outside and bickering, face to face.","language":"English","Release and reception":"City Heat was released in United States theaters in December 1984. It grossed $38.3 million at the North American box office.[10] The film was nominated for a Razzie Awards including Worst Actor for Reynolds.[11]Reynolds later recalled:Ten days after shooting began, I knew I was going to take the fall. Clint was playing formula Clint that always worked for Clint. I was playing Jack Lemmon in this strange film where people were getting blown away. I never read a review of the film, because I knew I was going to get killed by the critics. The public wanted 'Boom Town' or to see us in a contemporary film. They didn't want 'Dirty Harry vs. the Wimp.' It's regrettable the material wasn't there, because Hollywood or maybe just Warner Bros. will never let Clint and I act together again.[12]The film received lackluster reviews and critics expressed their disappointment with the script and the pairing of the two star actors. No consensus exists at review aggregator Rotten Tomatoes, although 10 of the 13 reviewers cited at the site gave the film a \"rotten\" review.[13] On Roger Ebert's 0–4 scale, he gave it (half a star), asking \"How do travesties like this get made?\":[14] Janet Maslin was more positive, saying \"overdressed and overplotted as it is, City Heat benefits greatly from the sardonic teamwork of Clint Eastwood and Burt Reynolds. Without them the film would be eminently forgettable, but their bantering gives it an enjoyable edge.\" According to Maslin:[15][T]he film ... manages to be both cumbersome and slight. As he did in My Favorite Year and, to some extent, in Racing with the Moon, Richard Benjamin has settled on an evocative time period and a top-notch cast and more or less left things at that. City Heat devotes much more energy to props, sets and outfits than to the dramatic streamlining it so badly needed. The screenplay, which is part Sting, part Sam Spade and part kitchen sink, is either a hopelessly convoluted genre piece or a much too subtle take-off on the same.","box_office":"$38,300,000","city_heat":"Promotional film poster","cinematography":"Nick McLean","production_company":"The Malpaso Company","directed_by":"Richard Benjamin","Soundtrack":"Clint Eastwood, a jazz aficionado, is one of the pianists heard on the film's jazz-oriented soundtrack. [9]","release_dates":"December 7, 1984 (1984-12-07)|||||","Production":"Blake Edwards co-wrote the script, initially titled Kansas City Blues.[4] He originally wrote the script in the 1970s while living in Switzerland. \"I really wrote the story for myself,\" says Edwards. \"But when Julie read it, she thought it was the best thing I'd done and over the years friends urged me to film it. So to see it turned into something completely different was very painful for me.\"[5]Edwards was the original director of the film, but he was fired early on and replaced with Richard Benjamin. He retained co-writing credit under the pseudonym \"Sam O. Brown,\" the initials of which were \"S.O.B.,\" a reference to his earlier film.[4]\"The whole thing was such a horrendous experience it could have come right out of S.O.B.,\" said Edwards. \"In fact it inspired me to write S.O.B. 2.\"[5]Reynolds later recalled:If you could just release the announcement for City Heat and not have to look at the film, it'd be the most successful picture I'd ever been in.. Blake laid out his way for Clint to play his part. To me, it was clearly apparent that Blake's way was in no way how Clint saw the part. Clint didn't say anything except his Gary Cooper comments like 'Yup' and 'Nope.' Clint and I went home in his truck and he still didn't say anything until we were halfway there. Finally he said, 'I guess this won't be the film we do together.' I said, 'I didn't think so.' Warner Bros. really wanted to make the film. I think they thought like I did that it would be one of those pictures which would look great in the catalogue... Clint likes a director he gets along with, which makes a lot of sense to me... Blake's dismissal hurt him badly. I don't think he's ever gotten over it.[6]Eastwood was cast as the lead and received a $4 million salary.[7]Filming began in February 1984. On the first day Reynolds was accidentally hit in the face with a metal chair during a fight scene.[2] His jaw was broken and he was restricted to a liquid diet, causing him to lose over 30 pounds by the time filming wrapped. His condition made headlines in the tabloids, who speculated he had AIDS.[8] What Reynolds actually contracted was temporo-mandibular joint dysfunction, or TMJ disorder, the pain from which would later cause an addiction to the analgesics used for pain relief.","produced_by":"Tony Adams","starring":"Clint Eastwood|Burt Reynolds|Jane Alexander|Madeline Kahn|Rip Torn|Irene Cara|Richard Roundtree|Tony Lo Bianco|","running_time":"97 minutes","music_by":"Lennie Niehaus","edited_by":"Jacqueline Cambas","budget":"$25 million[2][3]"}