{"country":"Hong Kong China","Awards and nominations":"Boat People was nominated for 12 awards at the second Hong Kong Film Awards and won 5, including Best Film and Best Director.[7] In 2005, it was ranked 8th of 103 best Chinese-language films in the past 100 years in a ceremony commemorating 100 years since the birth of Chinese-language cinema. The list was selected by 101 filmmakers, critics, and scholars.","distributed_by":"Bluebird Film Company","Plot":"The film is shown through the point of view of a Japanese photojournalist named Shiomi Akutagawa (Lam). Three years after covering Danang during the communist takeover, Akutagawa is invited back to Vietnam to report on life after the war. He is guided by a government minder to a New Economic Zone near Danang and is shown a group of schoolchildren happily playing, singing songs praising Ho Chi Minh.The scene that he sees is actually staged to deceive the foreign press. In Danang, he witnesses a fire and is beaten by the police for taking photos without permission. He also sees the police beating up a \"reactionary\". Later he sees a family being forced to leave the city to a New Economic Zone and wonders why they would not want to go there, recalling the happy children that he saw.In the city, he meets Cam Nuong (Ma) and her family. Her mother secretly works as a prostitute to raise her children. She has two younger brothers, the older one, Nhac, is a street-smart boy who is conversant in American slang, while the younger boy, Lang, was fathered by a Korean that her mother serviced. From Cam Nuong, Akutagawa learns the grisly details of life under communism in Danang, including children searching for valuables in freshly executed corpses in the \"chicken farm\". One day, Nhac finds an unexploded ordnance while scavenging in the garbage and is killed.At the \"chicken farm\", Akutagawa meets To Minh (Lau), a young man who was just released from the New Economic Zone. After To Minh attempts to rob Akutagawa's camera, he is tried and re-sent to the New Economic Zone. Akutagawa uses his connections with an official to follow him there. At the New Economic Zone, he witnesses the inmates being mistreated. He returns to the location where the smiling children were singing for him earlier, and finds to his horror them sleeping unclothed in overcrowded barracks.Meanwhile, To Minh has a plan to escape the country with a friend named Thanh. However, while on duty dismantling landmines one day, Thanh is blown up. To Minh gets on the boat to flee the country alone, but he is set up. The Coast Guard is waiting for them and shoots indiscriminately into the boat, killing all on board then taking all the valuables.Cam Nuong's mother is arrested for prostitution and forced to confess publicly. She committs suicide by impaling herself with a hook. Akutagawa decides to sell his camera to help Cam Nuong and her brother leave the country. On the night of the ship's departure, Akutagawa helps them by carrying a container of diesel. However, they are discovered and he is shot at. The diesel container blows up, burning Akutagawa to death. The film ends with Cam Nuong and her brother safely on the boat, looking forward to a new life at a freer place.","language":"Cantonese Japanese Vietnamese","Reception":"Hui considers Boat People one of her favourite movies[8] and many critics consider it her masterpiece.[9] The film brought Hui to international attention[10] and cemented her reputation as a Hong Kong New Wave director.[11] The film was very successful during its run in theatres, grossing HK$15,475,087,[1] breaking records and playing to packed cinemas for months.[11] Many viewers see the film as an analogy for Hong Kong after being returned to China (which was being negotiated at the time), with the communist Vietnamese government standing in for the communist Chinese government and warning that life in Hong Kong after the handover will be similar to life in Vietnam after the communist takeover.[12] In Hong Kong, the film was nominated for 12 categories at the Hong Kong Film Award in 1983 and won 5, including Best Film.The film was also shown in many international film festivals, including the 1983 Cannes Film Festival.[2] Many international critics found the film powerful, including Serge Daney in Libération, Lawrence O'Toole in Motion Picture Review, and David Denby in New York Magazine.[11] At the New York Film Festival, it elicited unusual attention because of its perceived political content (unlike the usual kung-fu Hong Kong films that Western audiences were accustomed to) and high production value.[13] Richard Corliss of Time Magazine wrote \"[l]ike any movie...with a strong point of view, Boat People is propaganda\", and that \"[t]he passions Boat People elicits testify...to Hui's skills as a popular film maker.\"[3] Janet Maslin in The New York Times observed that Hui \"manipulates her material astutely, and rarely lets it become heavy-handed\" and that scenes in the film \"feel like shrewdly calculating fiction rather than reportage.\"[14]However, many critics at the New York Film Festival criticised the film's political content, such as J. Hoberman, Renee Shafransky, and Andrew Sarris, all writing in The Village Voice. They objected to what they saw as the one-sided portrayal of the Vietnamese government and the lack of historical perspective. Some others found it politically simplistic and sentimental.[11]","box_office":"HK$15,475,087[1]","cinematography":"Wong Chung-kei","directed_by":"Ann Hui","Controversies":"Because the film was produced with the full co-operation of the government of the People's Republic of China, a government that had recently fought a war with Vietnam, many see it as anti-Vietnam propaganda despite Hui's protestations.[11] The New York Times wrote that the film's harsh view of life in communist Vietnam was not unexpected, given the PRC government's enmity to the Vietnamese.[14] Hui emphasised her decision to depict the suffering of Vietnamese refugees based on extensive interviews she conducted in Hong Kong.[11] She insisted that the PRC government never requested that she change the film's content to propagandise against Vietnam, and that they only told her that \"the script had to be as factually accurate as possible.\"[15] She denied that the situation in Vietnam was grossly exaggerated in the film, such as the scene of the boat being attacked by the Coast Guard – she was inspired by news reports of a guard ship creating whirlpools to sink a boat carrying boat people.[15]At the Cannes Film Festival, some left-wing sympathizers protested against the film's inclusion, and it was dropped from the main competition.[11] This was reportedly done at the behest of the French government, seeking to solidify its relations with the Socialist Republic of Vietnam.[16]In the Republic of China (Taiwan), the film, along with all of Hui's other work, was banned because it was filmed on Hainan, an island in the People's Republic of China.[11]","release_dates":"22 October 1982[1]","Production":"In the late 1970s, a great number of Vietnamese refugees flooded Hong Kong. In 1979, Hui was making the documentary A Boy from Vietnam for the RTHK network. In the process of making the film, she collected many interviews conducted with Vietnamese refugees about life in Vietnam following the Fall of Saigon.[5] From these interviews, she directed The Story of Woo Viet (1981) starring Chow Yun-fat as Woo Viet, a Vietnamese boat person in Hong Kong, and Boat People.The People's Republic of China, just ending a war with Vietnam, gave Hui permission to film on Hainan Island.[6] Boat People was the first Hong Kong movie filmed in Communist China.[3] Hui saved a role for Chow Yun-Fat, but because at that time Hong Kong actors working in mainland China were banned in Taiwan, Chow Yun-Fat declined the role out of fear for being blacklisted.[6] Six months before filming was set to start, and after the film crew were already on location in Hainan, a cameraman suggested that Hui give the role to Andy Lau. At that time, Andy Lau was still a newcomer in the Hong Kong film industry.[6] Hui gave Lau the role and flew him to Hainan before a proper audition or even seeing what he looked like.[6]","produced_by":"Xia Meng","starring":"George Lam Andy Lau Cora Miao Season Ma","running_time":"106 minutes[1]","music_by":"Law Wing-fai","edited_by":"Kin Kin","written_by":"Dai An-Ping"}