{"country":"United States","distributed_by":"Tribeca Film E1 Entertainment Canada","Plot":"Donovan also stars in the film, portraying a once-successful playwright, Robert Longfellow, who is taken hostage by an [ex-con] neighbor while on a routine visit to his childhood home. Two-time Emmy-nominee David Morse plays Gus (the neighbor); a man Robert has avoided since he was a boy. The film also stars Olivia Williams; Katherine Helmond and Eileen Ryan play supporting roles. As the drama unfolds, social status, celebrity and the threat of violence converge, leaving the playwright simultaneously shattered and inspired.","language":"English","Reception":"As of October 2013, the film has a 75% rating on Rotten Tomatoes from 24 reviews.[4]The New York Times found it \"earnest\" and \"wooden\", like a one-act play \"in which any visceral tension is secondary to topical debates by a captor and his prisoner\".[5] The Los Angeles Times found it \"disappointing\" and \"somber\", failing to generate any tension from its thriller elements.[6]The Globe and Mail awarded it 2.5/5; Adam Litovitz criticised some stagy elements but praised the film as a study of character.[7] The New York Post praised the performances, saying \"both characters are riveting\".[8]","cinematography":"Julie Kirkwood","production_company":"DViant Films This Is That Productions","directed_by":"Martin Donovan","release_dates":"July 4, 2011 (2011-07-04) (Karlovy Vary Film Festival)|June 18, 2012 (2012-06-18) (United States)||||","Production":"DViant Films and This Is That Productions produced Collaborator. The film's score was composed by Manels Favre. The soundtrack also includes a Brahms cover performed by PJ Harvey. Filming took place in Los Angeles, California, as well as Sault Ste. Marie, Ontario, Canada.","produced_by":"Julien Favre, Luca Matrundola, Pascal Vaguelsy, Ted Hope","starring":"Martin Donovan David Morse Olivia Williams Katherine Helmond Eileen Ryan","running_time":"87 minutes","music_by":"Manels Favre","edited_by":"Karen Porter","written_by":"Martin Donovan"}