{"based_on":"Emma   by Jane Austen","Cast":"The film's central characters are:","Adaptations":"In 1996, the producers created a spinoff television series, which followed the continuing adventures of Cher and her friends. Several cast members from the film went on to star in the series, with the notable exceptions of Silverstone (who went on to sign a film deal with Columbia-TriStar worth $10 million) and Rudd (whose film career began to take off). Silverstone was replaced in the series with actress Rachel Blanchard.A collection of books was also published after the release of the film by Simon Spotlight Entertainment publishing company from 1995-1999. These books were published as paperbacks and aimed at adolescent readers.","country":"United States","distributed_by":"Paramount Pictures","Legacy":"After the death of Brittany Murphy, Silverstone stated that she \"always felt connected to [Murphy] as [they] shared a very special experience in [their] lives together.\"[21] Following Murphy's death, Silverstone reported in an interview: \"I loved working with Brittany. She was so talented, so warm, and so sweet.\"[21]Heckerling later described Silverstone as having \"that Marilyn Monroe thing\" as a \"pretty, sweet blonde who, in spite of being the American ideal, people still really like.\"[22]The surviving cast reunited in 2012 for an issue of Entertainment Weekly.[23]Heckerling later reunited with both Silverstone and Shawn for the vampire comedy Vamps.Clueless is the main inspiration for Australian rapper Iggy Azalea's music video to her U.S. number one hit single \"Fancy\" featuring Charli XCX, with many visuals as well as costumes inspired by the film.[24][25] The video is filled with remakes of classic Clueless scenes, and the outfits are reinvented to channel the famous stylings of the film with a slightly modern edge.[26] \"Fancy\" was also shot in the same Los Angeles high school where Clueless was filmed.[27]In 2015, to celebrate the film's twentieth anniversary, pop culture writer Jen Chaney published a book titled As If!: The Oral History of Clueless, based on exclusive interviews with writer/director Amy Heckerling, star Alicia Silverstone, and other cast and crew members. Excerpts from the book were published in Vanity Fair.[28][29]","Plot":"In this adaptation of Jane Austen's Emma. Alicia Silverstone plays this late 20th century version of Emma Woodhouse, who has been given the new name of Cherilyn \"Cher\" Horowitz. Cher is a good-natured but superficial girl who is attractive, popular, and extremely wealthy. A few months shy of her sixteenth birthday, she has risen to the top of the high school social scene. She lives in a Beverly Hills mansion with her father Mel, a ferocious $500-an-hour litigator; her mother died from a freak accident during a routine liposuction procedure when Cher was a baby. Cher's best friend is Dionne Davenport, who is also rich, pretty, and hip, and understands what it's like to be envied. Though Dionne has a long-term relationship with popular student Murray, Cher claims that it is a pointless endeavor.Among the few people to find much fault with Cher is Josh, her socially conscious ex-stepbrother, who visits during a break from college. Josh and Cher spar continually but without malice; she mocks his scruffy idealism, while he teases her for being selfish, vain, and superficial, and says that her only direction in life is \"toward the mall.\" Cher plays matchmaker for two lonely, nerdy, hard-grading teachers, Mr. Hall and Miss Geist. She achieves her ostensible purpose to make them relax their grading standards so she can renegotiate a bad report card but when she sees their newfound happiness, she realizes she enjoys doing good deeds. Cher decides to give back to the community by \"adopting\" a \"tragically unhip\" new girl at school, Tai Frasier. Cher and Dionne give Tai a makeover and initiate her into the mysteries of popularity. Cher also tries to extinguish the attraction between Tai and Travis Birkenstock, an amiable skateboarding slacker, and to steer her toward Elton, a popular rich snob.Her second matchmaking scheme backfires when Elton rejects Tai and attempts to seduce Cher. When a handsome new student named Christian arrives at their school, Cher takes a shine to him and attempts to secure him as her boyfriend. Eventually, Murray spells it out to her and Dionne that Christian is not interested in her because he is gay.Despite the failure of this endeavor, Cher remains on good terms with Christian, primarily due to her admiration of his taste in art and fashion. Matters get worse when Cher's \"project\" works too well, and Tai's popularity surpasses her own. The events afterward reach crisis stage after Cher fails her driver's test and can't \"renegotiate\" the result. When she returns home, crushed, Tai confides that she's taken a fancy to Josh and wants Cher to help her \"get\" him. Cher says she doesn't think Josh is right for Tai, and they quarrel. Feeling \"totally clueless,\" Cher reflects on her priorities and her repeated failures to understand or appreciate the people in her life.After much soul searching, Cher realizes she is romantically interested in Josh. She begins making awkward but sincere efforts to live a more purposeful life, including captaining the school's Pismo Beach disaster relief effort. Cher and Josh eventually admit their feelings for one another, culminating in a tender kiss.In the end, Mr. Hall and Miss Geist wed; Cher's friendships with Tai and Dionne are solidified; Tai and Travis are in love; and Cher wins a $200 bet for catching the bouquet at the wedding. She embraces Josh, and they kiss as the film closes.","language":"English","clueless":"Theatrical release poster","box_office":"$56.6 million[3]","cinematography":"Bill Pope","directed_by":"Amy Heckerling","Home media":"Clueless was released on VHS and Laserdisc on December 19, 1995 by Paramount Home Video.The film was first released to DVD on October 19, 1999; the special features only included 2 theatrical trailers.A special \"Whatever! Edition\" 10th anniversary DVD was released on August 30, 2005. It included featurettes and cast interviews, including:The film was released on Blu-ray Disc for the first time on May 1, 2012. Special features were carried over from the \"Whatever!\" edition of 2005, and included a new trivia track.","release_dates":"July 19, 1995 (1995-07-19)|||||","Production":"Principal photography for the film took place between November 21-December 31, 1994.[10]The film had a 40-day filming schedule. Producers sat in on classes at Beverly Hills High School to get a feel for the student culture. Herb Hall, the real drama teacher at Beverly Hills High School, played the principal in the film. Scenes depicting the high school campus, including the tennis courts, the outdoor cafeteria, the quad, and various classrooms were filmed at Occidental College in Los Angeles. The mall scenes were filmed at Westfield Fashion Square in Sherman Oaks, CA.","produced_by":"Barry M. Berg|Twink Caplan|Robert Lawrence|Scott Rudin|Adam Schroeder|","starring":"Alicia Silverstone|Stacey Dash|Brittany Murphy|Paul Rudd|Donald Faison|Breckin Meyer|Dan Hedaya|","running_time":"97 minutes[1]","music_by":"David Kitay","edited_by":"Debra Chiate","Release":"Clueless opened theatrically in 1,653 theaters on July 19, 1995.[3]The film became a surprise sleeper hit of 1995, grossing $10,612,443 on its opening weekend, ranking second behind Apollo 13. The film grossed $56,631,572 during its theatrical run, becoming the 32nd highest-grossing film of 1995 and bringing the then-largely-unknown Silverstone to international attention. It also developed a strong cult following after its release.[citation needed]The film was well-received by critics. Review aggregation website Rotten Tomatoes gives it a score of 81% based on reviews from 57 critics and judged it \"Certified Fresh\", with the site's consensus stating, \"A funny and clever reshaping of Emma, Clueless offers a soft satire that pokes as much fun at teen films as it does at the Beverly Hills glitterati.\"[11] On Metacritic, the film has a 68 out of 100 rating based on 18 reviews, indicating \"generally positive reviews\".[12]Roger Ebert of the Chicago Sun-Times gave the film three-and-a-half out of four stars.[13] Janet Maslin of The New York Times notes \"Even if Clueless runs out of gas before it's over, most of it is as eye-catching and cheery as its star.\"[14] Peter Travers of Rolling Stone gave the film four stars, contrasting it to the more adult-oriented film about teenagers released around the same time, Kids, stating \"The materialism in Clueless is almost as scary as the hopelessness in Kids.\"[15]In 2008, Entertainment Weekly selected Clueless as one of the \"New Classics,\" a list of 100 released between 1983 and 2008,[16] Clueless was ranked 42nd.[17]In 2008, Entertainment Weekly named it the 19th best comedy of the past 25 years.[18]American Film Institute recognition:","written_by":"Amy Heckerling","budget":"$12 million[2]"}