{"country":"United States","distributed_by":"New Line Cinema1","Plot":"Dr. Dan Potter is the replacement for Dr. Harry Merton, a psychiatrist at Dr. Leo Bain's psychiatric haven. Dr. Bain operates the haven through very lenient methods. The 3rd floor patients (paranoid former POW Frank Hawkes, pyromaniac preacher Byron Sutcliff, obese child molester Ronald Elster, and homicidal maniac Tom \"Bleeder\" Skaggs) initially treat Dr. Potter with mixed hostility. The men on the 3rd floor wake up and begin to carry out their plan. After Hawkes successfully creates a blackout, Sutcliffe and Elster kill Curtis and the four escape in a doctor's car. They drive to a store in the middle of a raid to pick up new clothes and weapons. Skaggs then slashes an innocent bystander and runs away, the others take the murdered man's van and drive off. Dan arrives at the hospital to learn from Bain about the four escaped patients and of the people they killed.Bunky arrives at Dan's house and invites her boyfriend Billy to have sex. After hearing a noise, Billy is dragged and killed underneath the bed by Preacher and Bunky is strangled by Ronald. Dan arrives home with Nell, Toni and Tom (who unbeknownst to the family and the viewer, is the fourth escapee) when they see cops all over the house. Lyla is fine as she told them about Ronald, but the police haven't found out about the murdered Bunky and Billy. During dinner, Barnett is killed by Hawkes' crossbow and he attacks the family. With the phone line out, the family then barricades the windows from the crossbow bolts. Meanwhile, Bain is told by the telephone operator that the phone line to the Potter residence is out of order, causing him to drive over to the house where he is slashed and axed by Preacher. Dan tries to scream to the men outside and tells them that he did not murder Dr. Merton, but he gets no reply. Suddenly, Barnett's dead body is thrown by Ronald through a window, and the group stacks furniture against it as Hawkes shoots his crossbow through the broken window. Preacher sets a fire in the basement, prompting Dan to the basement where he injures Preacher and extinguishes the fire. After doing this, Ronald attacks the group before getting killed by a meat cleaver.While Dan starts up Bain's car, Tom's nose bleeds (revealing his identity to the group) and strangles Toni. Dan runs back inside and grabs Tom away from his sister and Nell stabs Tom, killing him. Suddenly, Preacher comes out of the basement and Dan struggles with him, where he manages to stab Preacher and throws him back into the basement. As Dan, Nell, Lyla and Toni gather together for comfort, Hawkes appears standing in the kitchen doorway with his crossbow aimed right at them and cities \"It's not just us crazy ones who kill\". Suddenly, the electricity comes back on and Hawkes sees Dr. Merton interviewed in a news report on television. Evidently upset, Hawkes breaks the TV and leaves the house and escapes into the night. Hawkes then walks through the town and enters the club. While Hawkes watches the punk rock band perform, a drugged girl walks up to Hawkes where he pulls out his pistol and points it at her neck. She looks at it and laughs, and so does Hawkes.","language":"English","Reception":"For her performance, Elizabeth Ward was voted Best Actress at the 1983 Sitges Film Festival.[1] The film came and went quietly upon theatrical release. It was dismissed as merely another slasher flick following the trend created by Halloween and Friday the 13th. However, since then the film has gained notoriety as being one of the more intelligent slasher-themed films of the '80s.[2] Allmovie called the film \"one of the best (and most subversive) entries in the '80s slasher boom\".[3] The film currently holds a 75% \"Fresh\" score at Rotten Tomatoes, based on 8 reviews.[4]The film was released on DVD by Image Entertainment for the first time in 2005.In 2008 the indie rock band Lithium Walkers did a tribute song to the film entitled \"Alone in the Dark\". The groups drummer cites this as one of his favorite films. The song is part of an album called Midnite Matinee, a series of songs named after '80s horror films.During his interview for the documentary Behind the Curtain Part II (2012), writer/director Jack Sholder said that he considered Alone in the Dark to be one of his most under-appreciated films and one of his favorites.[citation needed]","box_office":"Unknown","cinematography":"Joseph Mangine","production_company":"Masada Productions","directed_by":"Jack Sholder","alone_in_the_dark":"Theatrical film poster","release_dates":"November 12, 1982 (1982-11-12)|||||","Production":"While writing the screenplay for Alone in the Dark, Jack Sholder was inspired by the writings of R. D. Laing, who theorized that 'psychotics' were actually people having difficulty adapting to an already psychotic world. The character of Dr. Leo Bain was supposed to be something of a parody of Laing.Jack Sholder's original idea for the film was to have the story be about mental patients escaping during a blackout in NYC and the mafia being used to stop them. Due to the low budget it was re-envisioned to take place on a smaller scale outside of New York.It was producer Robert Shaye that actually came up with the idea of the character of 'The Bleeder'. Shaye liked the idea of a crazed murderer who always hid his face and was revealed later in the film.The scene where Ronald Elster grabs Bunky by the throat and lifts her off the floor was done without any special effect. Erland Van Lidth (Elster) was an incredible weight lifter and actually seized Carol Levy by the neck and lifted her for the shot.Makeup effects artist Tom Savini was brought in specifically to create the horrific monster apparition that Toni has. Savini achieved the startling effect by covering an actor in a concoction of soap and Rice Krispies.In the script Jack Palance's character was supposed to kill the driver outside the Haven. However Palance refused to do the scene saying it was not necessary for him to be seen killing someone for the audience to know that he was a dangerous character. The scene was never shot.The film was one of the first horror films to be made with Dolby Stereo sound. The advanced sound level would often blow out the speaker systems in older theaters while the movie was being screened.In the original script the punk band that Toni drags Dan and Nell to see was named Nicky Nothing and the Hives. When The Sic F*cks, an actual punk group, landed the gig as the punk band for the film their real name was liked so much that they kept it for the film.The first scene at Stumps with The Sic F*cks performing was shot silently without the music. The band and audience had to mimic their performances during the filming and the song 'Chop Up Your Mother' had to be dubbed in later on.One of the members of The Sic F*cks ran into star Jack Palance years later in the streets of New York. He said to Palance that he was one of The Sic F*cks in the film and Palance replied, \"We were all sick fucks in that movie.\"","produced_by":"Robert Shaye Benni Korzen","starring":"Jack Palance Donald Pleasence Martin Landau Dwight Schultz Erland Van Lidth","running_time":"92 minutes","music_by":"Renato Serio","edited_by":"Arline Garson","written_by":"Jack Sholder Robert Shaye Michael Harrpster","budget":"Unknown"}