{"country":"United States","distributed_by":"Box Office Spectaculars","screenplay_by":"Allison Louise Downe","story_by":"David F. Friedman Herschell Gordon Lewis","Novelization":"Lewis wrote a novelization of Blood Feast to coincide with the release of the film.[11] The novel, which features significantly different versions of central characters Fuad Ramses, Pete Thornton and Suzette Fremont, has a much more humorous tone than the film and is set in Chicago rather than Miami. It was reprinted by FantaCo Enterprises in the 1980s.[citation needed]","Plot":"In the midst of a series of gruesome murders, a young woman is killed inside her suburban Miami house by a grey-haired, wild-eyed man. He stabs her in the eye and hacks her leg off with a machete, bagging the leg before he leaves. At the police station the next day, detective Pete Thornton investigates the killing, noting that it is the latest in a series of four murders by a homicidal maniac who has yet to leave any clues. The police chief advises him to continue to pursue the case.At Fuad Ramses Catering store, wealthy socialite Dorothy Freemont arrives, where she arranges for Fuad to cater a party for her daughter Suzette. Fuad agrees and tells Mrs. Freemont that the Egyptian feast that he is preparing has not been served for over 5,000 years. Mrs. Freemont wants the catering done in two weeks, and Fuad assures her that he will have enough time to procure the last of his needed ingredients. After Mrs. Freemont leaves, Fuad ventures to the back storage room where he has displayed a large gold statue of his \"Egyptian goddess\" Ishtar. Fuad is preparing a \"blood feast\" – a huge vat containing the dead women's body parts – that will ensure the goddess's resurrection. That evening, teenagers Tony and Marcy make out on a nearby beach. Fuad attacks them, subduing Tony and slicing off the top of Marcy's head. He removes her brain to serve as the latest ingredient. Thornton arrives on the scene with the police chief. After failing to obtain any useful information from the distraught Tony, they interrogate Marcy's mother, who can only tell Pete that her daughter belonged to a book club.Staking out a local motel, Fuad sees a drunken sailor drop his wife off at her room. Fuad knocks on the woman's door and attacks her when she opens it. Fuad rips the woman's tongue out through her throat as another ingredient to his \"blood feast\". Pete continues to investigate this latest killing, and discovers that the latest murder victim also belonged to a book club.Pete attends his weekly Egyptian Studies lecture at the local university with his girlfriend, who happens to be Suzette. The lecturer tells them about the cult of Ishtar, and describes how virginal women were sacrificed to the goddess on an altar as a blood offering to the Egyptian goddess. When the lecture is over, Pete takes Suzette out for an evening drive. She becomes worried about the recent attacks and fears that a serial killer is loose in the area. Their date is interrupted by the car radio announcing that another victim has been found near death. Pete drops Suzette home and races to the hospital. The police chief informs him that the maniac has struck again and hacked off the face of another woman named Janet Blake. Pete questions Janet in her hospital bed. Her face bandaged, Janet tells the detectives that the man who attacked her was old, with wild eyes, and that he said something which sounded like \"Etar\". Janet then dies and Pete can't shake the feeling that this word sounds familiar. Fuad receives a letter from Trudy requesting a copy of the book Ancient Weird Religious Rites, written by Fuad Ramses. Fuad calls Trudy's home phone number and learns that she's staying with Suzette. That afternoon, Fuad stakes out the Freemont residence, kidnaps Trudy from the grounds and takes her to his store. He whips her savagely and collects her blood, the final ingredient in his bloody potion.With Trudy missing, Mrs. Freemont insists that the party continue. Pete calls Suzette to inform her that he will be late. Meanwhile, Fuad arrives with the food that he has cooked at his store. Elsewhere, Pete calls upon the college lecturer and gets more information about the cult of Ishtar and Fuad's book. He deduces that Fuad is the killer, since all the victims were women who personally called upon him to send them copies of his book. Pete and the police race over to Fuad's store and find Trudy's chopped-up body in the back. Pete tries to call Suzette to warn her, but Fuad cuts the phone line to the Freemont house.At the Freemont party, Fuad's meal is ready, but he first asks Suzette to come into the kitchen to help him. He has Suzette lie on a counter, which he makes his altar, and says a prayer to Ishtar as he prepares to decapitate her with his machete as a final offering to his goddess. This takes forever because she can't take him seriously. Dorothy Freemont interrupts Fuad just as he's about to decapitate Suzette, and Fuad escapes as the police arrive. Pete and the rest of the police chase Fuad through a nearby garbage dump, where he attempts to escape by climbing into the back of a departing garbage truck. The truck's compact blades turn on and Fuad is crushed to death. The police stop the truck, noting that there's not much left of Fuad. As Pete puts it, \"He died a fitting end, just like the garbage he was.\"","language":"English","Critical reception":"Variety's May 6, 1964 review termed the film a \"totally inept shocker\", \"incredibly crude and unprofessional from start to finish\" and \"an insult even to the most puerile and salacious of audiences\". The review labeled the entire production a \"fiasco\", calling the screenplay (credited to Louise Downe) \"senseless\", and the acting \"amateurish\". Of Lewis' direction, camerawork, and musical composition, the review judged that he had \"failed dismally on all three counts\".[6]In response to Variety's criticism of the film, Friedman said, \"Herschell and I have often wondered who told the Variety scribe we were taking ourselves seriously.\"[7]In a later review of the film by Allmovie, the website wrote, \"The plot is threadbare, the acting is on a par with the clumsiest of high school plays and the direction is static and uninvolving. Nevertheless, this is one of the important releases in film history, ushering in a new acceptance of explicit violence that was obviously just waiting to be exploited\".[8] On review aggregator website Rotten Tomatoes the film currently has a 36% approval rating, based on 11 reviews, and is certified \"rotten\".[9]","box_office":"$4,000,000","cinematography":"Herschell Gordon Lewis","directed_by":"Herschell Gordon Lewis","References":"NotesBibliography","release_dates":"July 6, 1963 (1963-07-06)|||||","Production":"The concept for Blood Feast arose in the early 1960s, three years after the release of director Alfred Hitchcock’s famous horror film Psycho. Lewis, previously a teacher at Mississippi State College, had quit his job in order to enter the film business, and directed several “nudie cutie” films in the early 1960s, produced by David F. Friedman (who would later produce Blood Feast and several other splatter films that Lewis would direct). Lewis had seen Psycho and felt that the film had cheated by showing the results of the murders in the film but not the action, because Hitchcock could not risk getting turned down by theaters. The main idea behind Blood Feast was that bathtubs of blood would be spilled in an effort to portray an Egyptian meal cooked with the bodies of virgins and the tongue of a woman being ripped out of a woman’s mouth.[1]Filming took place in Miami, Florida over a period of four days, with a budget of $24,000.[1] Director Lewis wanted a realistic prop for the scene where a woman gets her tongue ripped out; in order to accommodate this, a sheep’s tongue was imported from Tampa Bay and used in the scene. All other limbs and organs used during production were imported locally. Lewis filmed Blood Feast in color in order to show the red blood used in the film.[1]","produced_by":"David F. Friedman","starring":"William Kerwin Mal Arnold Connie Mason Lyn Bolton Scott H. Hall","running_time":"67 minutes","Sequels":"Blood Feast was the first part of Lewis' \"Blood Trilogy\", with the others being Two Thousand Maniacs! and Color Me Blood Red''.Sequel Blood Feast 2: All U Can Eat was released in 2002. It takes place years after the first film, with Fuad's grandson following in his grandfather's footsteps. It marked the first time Lewis and Friedman had worked together on a film in 36 years.1987's Blood Diner was produced with the intention of making it a \"spiritual sequel\" to Blood Feast.[10]","music_by":"Herschell Gordon Lewis","Significance":"Blood Feast immediately became notorious for its explicit gore and violence. It is the oldest film to have appeared on the UK video nasty list. It is also often cited erroneously as one of the first films to show people dying with their eyes open (earlier examples include D. W. Griffith's 1909 film The Country Doctor, the 1931 film The Public Enemy and the 1960 film Psycho).[3]Fuad Ramses was described by author Christopher Wayne Curry, in his book, A Taste of Blood: The Films of Herschell Gordon Lewis, as \"the original machete-wielding madman\" and the forerunner to similar characters in Friday the 13th and Halloween. Lewis said of the film, \"I've often referred to Blood Feast as a Walt Whitman poem. It's no good, but it was the first of its type.\"[4]Blood Feast is the first part of what the director's fans called \"The Blood Trilogy\". Rounding out the trilogy are the films Two Thousand Maniacs! (1964) and Color Me Blood Red (1965). After the third film, producer Friedman said, \"I think that for now we're going to abandon making any more 'super blood and gore' movies, since so many of our contemporaries are launching similar productions, causing a risk that the market will quickly reach a saturation point.\"[5]","edited_by":"Robert Sinise Frank Romolo","Release":"The film was advertised as Egyptian Blood Feast at drive-ins in New York.[2]Producer Friedman came up with some publicity stunts for the film, such as giving theater-goers \"vomit bags\" and intentionally taking out an injunction against the film in Sarasota, Florida, in order to gain publicity. Both were very effective and generated more interest in the film.[2]It was first released on VHS home video by Continental Video in the 1980s. It also received VHS and DVD-ROM release by the Seattle-based company Something Weird Video in the late 1990s.","budget":"$24,500"}