{"educating_rita":"Samuel French acting edition cover","original_language":"English","Plot summary":"The plays follows the relationship between a 26-year-old Liverpudlian working class hairdresser and Frank, a middle-aged university lecturer, during the course of a year.[1] In the play Frank has no surname, but when the film was made he became Dr. Frank Bryant.Susan (who initially calls herself Rita), dissatisfied with the routine of her work and social life, seeks inner growth by signing up for and attending an Open University course in English Literature. The play opens as 'Rita' meets her tutor, Frank, for the first time. Frank is a middle-aged, alcoholic career academic who has taken on the tutorship to pay for his drink. The two have an immediate and profound effect on one another; Frank is impressed by Susan's verve and earnestness and is forced to re-examine his attitudes and position in life; Susan finds Frank's tutelage opens doors to a bohemian lifestyle and a new self-confidence. However, Frank's bitterness and cynicism return as he notices Susan beginning to adopt the pretensions of the university culture he despises. Susan becomes disillusioned by a friend's attempted suicide and realises that her new social niche is rife with the same dishonesty and superficiality she had previously sought to escape. The play ends as Frank, sent to Australia on a sabbatical, welcomes the possibilities of the change.","subject":"Pygmalion-style drama about a hairdresser's literary quest.","Revivals":"From 26 March-8 May 2010, as part of the Willy Russell season at the Menier Chocolate Factory, Laura Dos Santos reprised her radio performance on stage as Rita alongside Larry Lamb as Frank. This was the production's first London West End revival. This production transferred to the Trafalgar Studios in London's West End from 8 July-30 October 2010, produced by Sonia Friedman. Laura Dos Santos reprised her radio and Menier Chocolate Factory performance as Rita, and Frank was played by renowned actor Tim Pigott-Smith. Like the Willy Russell season at the Menier Chocolate Factory, the production ran in repertory alongside Shirley Valentine starring Meera Syal. A UK tour played in 2012, starring Claire Sweeney and Matthew Kelly as Rita and Frank respectively. A 35th anniversary production was staged at Liverpool Playhouse from 6th February to 7th March 2015, starring Leanne Best as Rita and Con O'Neill as Frank, directed by Gemma Bodinetz.","Themes":"The play deals with the concept of freedom, change, England's class system, the shortcomings of institutional education, and the nature of self-development and of personal relationships. The play borrows from the George Bernard Shaw play Pygmalion, itself based upon archetypes from Greek myth.","Radio adaptation":"The play was adapted by Russell for radio in 2009 – see Educating Rita (radio play). It starred Bill Nighy and Laura Dos Santos directed by Kirsty Williams, and was a 90 minute play broadcast on BBC Radio 4 on Boxing Day 2009.[2]","place_premiered":"Donmar Warehouse London","genre":"Comedy","Influence":"Geoffrey Sampson explains the title of his 1997 book, Educating Eve: The 'Language Instinct' Debate, as a deliberate allusion to Educating Rita.","date_premiered":"June 1980","Film adaptation":"The play was adapted by Russell for a 1983 film with Michael Caine and Julie Walters, directed by Lewis Gilbert.","written_by":"Willy Russell"}