{"country":"Israel, Palestine","distributed_by":"United States: International Film Circuit","Plot":"The film is set in the tense period in the Israel-Palestinian peace process shortly after the assassination of Yitzhak Rabin and the election of Benjamin Netanyahu, with the strained relations implied but not explicitly depicted.[7] It is divided into two major sections, all loosely tied together as the story of Suleiman's return to the West Bank and Israel.[8] The character of Suleiman in the film is described only as 'E.S.'[9] E.S. returns from a twelve-year exile in New York City and is now in unfamiliar territory.[7][8] Within the film, no real plot or character development emerges. A series of mostly unconnected scenes take place one after the other in documentary film like fashion. The gradual accumulation of images and dialogue start without conclusion presenting an unsettling kind of feeling, which was meant to convey the quality of life led by Palestinians given their statelessness.[2]The first, and lightest, section is the \"Nazareth Personal Diary\", featuring warm observations of his family and his relatives' lives. Some of the notable vignettes include the dull yet comedic routines of the proprietor of a souvenir shop called \"the Holyland\" in which he fills bottles of alleged holy water from his own tap and fails to keep a cheap camel statuette from falling over on his shelves.[3] E.S. and the shop owner spend time sitting in front of the stop waiting futilely for tourists to stop by. A boat full of Arab men fish, as one of the men bashes various Palestinian families that his friend does not belong to while praising the one that his friend does belong to. Suleiman also interviews a Russian Orthodox cleric who rails against the tourists polluting the Sea of Galilee.[8]A short middle segment shows E.S. getting up to speak at a conference on Palestinian film making; the microphone immediately begins feeding back and he leaves the podium. The last section, \"Jerusalem Political Diary, has a quicker narrative pace and a more overtly ideological message.[8] Absurd humor is evoked alongside feelings of anti-Israeli paranoia in the characters; for example, what first appears to be a terrorist's hand grenade held by a Palestinian turns out to be a cigarette lighter.[3]Suleiman discovers an Israeli policeman's walkie-talkie, and he then meets up with a single young Arab woman who is engaging in a search for an apartment that is just as fruitless as the two men's search for tourists.[3][10] The woman, who speaks fluent Hebrew, is told by Jewish landlords that they do not rent to Arabs, while an Arab landlord tells her to live at home in accordance to Islamic tradition. She uses the walkie-talkie to play various pranks on the Israeli police, at one point singing an overly malevolent version of Israel's national anthem over the air.[8] In the last part of the film, the woman stages a piece in which the police unwittingly participate as a member of a guerrilla theatre group.[10] The end comes after a long shot of Suliman's parents sleeping, with all the lights off and Israeli material playing on their television.[4]","language":"Arabic, Hebrew, French, English, and Russian","Reception":"The film has received international critical acclaim.[5] It was played at Sundance and the Museum of Modern Art's New Director/New Films series.[2] It was shown at the Venice Film Festival of 1996 and won the 'Best First Film Prize'.[6] In October 1999, a group of Israeli critics cited by The New York Times selected the film as the best Israeli film of the year.[12] It has notably been one of the few Palestinian films to receive national release in the United States, which occurred in fall 1997.[7]Reviews praising the film appeared in The Austin Chronicle and The Los Angeles Times.[2][3] Artforum extolled its use of artistic minimalism and called it a \"shrewdly soft-voiced argument for peace\".[7] Janet Maslin of The New York Times called it \"quite remote\" as well as \"schematic and abstract\". She also stated, \"[f]or every astute or revealing detail about a culture full of frustrations, there is liable to be a glimpse of someone falling asleep on a sofa or staring disconsolately into space.\"[13] Cinematic scholar Gönül Dönmez-Colin dedicated a chapter to the film in her 2007 book The Cinema of North Africa and the Middle East. She commented, \"Much of Palestinian film deals with the liminality of loss and disappearance- of country, of the people, and of the self. In other Palestinian film, however, are these processes of love disappearance more beautifully captured than in Chronicle of a Disappearance.\"[4]Richard Brody of The New Yorker labeled it \"witty\" and lauded its \"graceful artistry and rhetoric\". He also stated that Suleiman \"constructs his film disingenuously around the politics that he omits\".[10] All Movie Guide commented that \"[i]n his fragmented, personal, self-critical, and low-key way, Suleiman makes his point that the disappearance he's chronicling is that of the identity of his people.\"[5] Sam Adams of The Philadelphia City Paper stated that the film \"succeeds because of aesthetics, not politics' and avoids ideological commentary on the conflict.[9] Critic Dennis Schwartz of Ozus' World Movie Reviews panned the film. In particular, he cited its portrayal of both Nazareth and Jerusalem as part of 'Palestine' despite the sovereign Israeli history in those cites as inappropriate and provocative. He also criticized its disjointed, non-linear structure.[8]When asked about the international critical praise for the film by IndieWire, Suleiman commented:I am not exactly surprised, but you're never sure how people are going to respond. You're simply scared. I must say, though, that even though the film might pose as a difficult film, it is not, in fact, it's a very simple film. The only thing that is not in the film is the straightforward narrative. But then each tableau that comes has its humour and has its life, then people don't concern themselves with the narrative... and that proves you can do a film that can entertain people and that does not necessarily have to center itself on a beginning, middle and end. So, no, actually, funny, it's not even the festival people, it's also the general public... responded like the people in Nazareth. I think maybe because there is something for everyone in it.[11]","directed_by":"Elia Suleiman","release_dates":"September 1996 (1996-09)","Production":"Elia Suleiman was born in 1960 in Nazareth in extreme poverty; an interviewer later compared his background to the drawings by the late Palestinian cartoonist Naji al-Ali. He left school at sixteen both out of his opposition to the \"structured and confined\" nature of his education as well as his difficult socio-economic conditions, and he immigrated to New York to live there for several years. He became seriously interested in filmmaking almost by accident, being asked to translate some parts of a film by the Lebanese-Canadian filmmaker Jay Salloum. Suleiman went on to direct two short films before moving to Jerusalem in 1994, working for Bir Zeit University.[6]Suleiman has said that Chronicle of a Disappearance is \"a journey in search of what it means to be Palestinian.\"[3] Suleiman told his own personal story in the film.[11] In his production notes, Suleiman wrote that \"My life makes me laugh... I am far from being courageous. I hate venturing. I wish to settle down and lead a linear existence, but even when I purposely attempt to conform, something is bound to go wrong.\"[7] The Arabic, Hebrew, French, English, and Russian languages are all spoken in the film.[10]The cast includes Elia Suleiman himself as well as Fuad Suleiman, Nazira Suleiman, Ula Tabari, James Daher, Juliet Mazzawi, Fawaz Eilemi, Leonid Alexeenko, and Iaha Mouhamad.[5] Much of the cast are related to him.[9] The company Dhat Productions produced the film along with assistance from the European Union Media Project Production Company, the Centre national de la cinématographie, the Fund for the Promotion of Israeli Quality Film, and the Independent Television Service. Assaf Ami, of Norma Productions, served as the executive producer.[3]","chronicle_of_a_disappearance":"Chronicle of a Disappearance DVD cover","produced_by":"Elia Suleiman","starring":"Elia Suleiman","running_time":"88 minutes","written_by":"Elia Suleiman"}