{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Poitier plays a U.S. Marine sergeant commanding a small, isolated and decimated platoon in the Korean War. The film explores the racial integration of the American military, centering on the African-American sergeant's struggle to win the trust and respect of the men in his unit.[3]When the platoon commander is mortally wounded in an ambush, he passes the role of platoon leader to the next highest ranking man, Sergeant Towler (Sidney Poitier). Towler initially feels the role should be taken by the combat experienced former Sergeant now Private Kincaid (Alan Ladd) who has eleven years of service as a Marine. However, Kincaid lost his former rank through misconduct and doing things his own way. Kincaid's prowess as a hero is demonstrated in the opening battle scene where he picks up a M1919 Browning machine gun and fires it from the hip into charging North Korean soldiers.Before he dies, the Lieutenant reminds Towler that he is next in line for command, not Kincaid. One of the platoon, Pvt Bracken (Paul Richards), openly questions Towler's authority in favour of Kincaid.With their radio destroyed in the ambush, Sgt Towler leads the ten survivors of the platoon to a house strategically located at a pass that the men can hold until the rest of the battalion arrives.","language":"English","box_office":"$2,000,000 (US/ Canada)[2]","all_the_young_men":"1960 theatrical poster","cinematography":"Daniel L. Fapp","production_company":"Jaguar Productions","directed_by":"Hall Bartlett","release_dates":"August 26, 1960 (1960-08-26)|||||","Production":"Hall Bartlett designed a film as a vehicle for Sidney Poitier, based on the integration of the military in the Korean War. Bartlett came up with the original story with Gene Coon and wrote the script himself. He aimed to make the film independently, though the exact start date was going to be dependent on Poitier's success in A Raisin in the Sun.[4]Columbia Pictures agreed to finance on the proviso that Bartlett rewrite the script for a white co-star. Bartlett found the only major star willing to do the movie was Alan Ladd who co-produced the film.[5][6] Bartlett:I could have done it [the film] on a shoestring in some canyon in the Hollywood Hills, but I felt that now is the time for me to prove myself with a picture in the million-plus category. I realized that I could not stay in my ivory tower forever, making nice, small, critically praised films. You don't go very far here if you're not successful when the right time comes.[1]The film features an unusual cast who works well together. In addition to Alan Ladd and Sidney Poitier the cast includes Mort Sahl who does a comedy routine,[7] James Darren who sings the title song (he was meant to sing three songs in all[8]), Glenn Corbett and boxer Ingemar Johansson in his American film debut. Bartlett cast his Argentine wife Ana María Lynch/Ana St. Clair as a Korean,[9] Mario Alcalde as an American Indian, Hollywood born Paul Richards as a bigoted Southerner, and cast local Blackfoot Indians as North Koreans.[5]\"I just play myself,\" said Johansson.[10]All the Young Men was filmed in Glacier National Park (U.S.) and Mt. Hood Oregon.[11] Poitier's commitment to make the film meant he had to leave the run of A Raisin in the Sun early.[12]Columbia planned two separate advertising campaigns for the film to white and black audiences.[13] Columbia also used Quentin Reynolds to promote the film in advertising campaigns. A paperback novelisation of the film was written by Marvin Albert.[14]The Marine Corps provided Lieutenant Colonel Clement J. Stadler who had been awarded the Navy Cross[15] in World War II as a technical advisor; a function he also performed in Hell to Eternity, The Outsider, Ambush Bay and The Lieutenant television series. The United States Marine Corps had disbanded separate black Marine units and bases since 18 November 1949.[16]","produced_by":"Hall Bartlett Alan Ladd","starring":"Alan Ladd Sidney Poitier","running_time":"90 minutes","music_by":"George Duning","edited_by":"Al Clark","written_by":"Hall Bartlett","budget":"over $1 million[1]"}