{"based_on":"Characters  by David Kirschner","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Flint Dille","story_by":"Charles Swenson","Sequels and spinoffs":"The sequel followed An American Tail and was followed by the television series Fievel's American Tails and two direct-to-video sequels: An American Tail: The Treasure of Manhattan Island and An American Tail: The Mystery of the Night Monster.Fievel later served as the mascot for Steven Spielberg's Amblimation animation studio, appearing in its production logo. There is also a Fievel-themed playground at Universal Studios Florida, featuring a large water slide and many over-sized objects such as books, glasses, cowboy boots, and more. It is the only such playground at any of NBC Universal's theme parks.An LCD game based on the film was created by Tiger Electronics in 1991.A computer game based on the film was created in 1993.A Super Nintendo Entertainment System video game based on the film was released in 1994. See An American Tail: Fievel Goes West for more.A Game Boy Advance video game based on the film was released in 2002. See An American Tail: Fievel's Gold Rush for more.","Plot":"Several years after living in New York City, the impoverished Mousekewitz family discovers that conditions are not as ideal as they had hoped, as they find themselves still struggling against the attacks of mouse-hungry cats. Fievel spends his days thinking about the Wild West dog-sheriff Wylie Burp, while his older sister, Tanya, dreams of becoming a singer. Meanwhile, Tiger's girlfriend, Miss Kitty, leaves him to find a new life out west, remarking that perhaps she is looking for \"a cat that's more like a dog.\"Soon after, Cat R. Waul forces the mice into the sewers, including the Mousekewitzes, and entices them into moving yet again to a better life out west. Tiger chases the train, trying to catch up with his friends, but is thrown off course by a pack of angry dogs. While on the train, Fievel wanders into the livestock car, where he overhears the cats revealing their plot to turn them into \"mouse burgers.\" After being discovered, he is thrown from the train by Cat R.'s hench-spider, T.R. Chula, landing him in the middle of the desert. His family is devastated once again over his loss and arrive in Green River, Utah with heavy hearts.Upon arrival at Green River, Chula blocks up the water tower, drying up the river. Cat R. approaches the mice and proposes to build a new saloon together, although intending to trick the mice into doing the bulk of the work and then eat them afterwards. Meanwhile, Fievel is wandering aimlessly through the desert, as is Tiger, who has found his way out west as well, and they pass each other. However, they each figure that the other is a mirage and continue on their separate ways. Tiger is captured by mouse Indians and hailed as a god. Fievel is picked up by a hawk, dropped over the mouse Indian village and reunites with Tiger. Tiger chooses to stay in while Fievel catches a passing tumbleweed, which takes him to Green River. As soon as he makes his arrival, he quickly reunites with his family but is unable to convince them of Cat R.'s plans to kill them. However, Cat R. hears Tanya singing and is enchanted by her voice.He sends Tanya to Miss Kitty, who is now a saloon-girl cat, and she reveals that she came at Cat R.'s request. He tells Miss Kitty to put her on stage. With a little encouragement from Miss Kitty, she pulls off a performance for the cats. Meanwhile, Fievel is chased by Chula and briefly taken prisoner, but flees.While walking out of town, Fievel stops to talk with an elderly bloodhound sleeping outside the jail, discovering that he is actually Wylie Burp. Fievel convinces him to help and train Tiger as a lawman and as a dog. Tiger is reluctant at first, but relents at the suggestion that a new persona might win back Miss Kitty. They go back to Green River to fight the cats, who attempt to kill the mice at sunset during the opening of Cat R.'s saloon using a giant mouse trap. Tiger, Wylie and Fievel intervene and battle the cats. When Chula threatens to kill Miss Kitty, however, Tiger rescues her and uses a pitchfork and Chula's web as a lasso with him trapped on it to hurtle Cat R. and his men out of town by having them piled on part of the trap, which the heroes use as a catapult. The cats fly into the air and land into a mailbag. The train picks it up and leaves.Enchanted by his new personality, Miss Kitty and Tiger are reunited. Tanya becomes a famous singer and the water tower flows with 9000 gallons of water again, making Green River bloom with thousands of flowers. Fievel finds Wylie away from the party who hands him his sheriff badge. Fievel is unsure about taking it, but realizes that his journey is not over.","language":"English","Reception":"The film received mixed reviews from film critics. The staff of Halliwell's Film Guide gave it two stars out of four, with this comment: \"Enjoyable and high-spirited animated film that borrows plot and attitudes from classic Westerns.\"[6] Roger Ebert gave it two-and-a-half stars out of four and wrote, \"There is nothing really the matter with An American Tail: Fievel Goes West, except that it is not inspired with an extra spark of imagination in addition to its competent entertainment qualities.\" The New York Times wrote \"The film is really a bland, randomly connected series of adventures involving the Mouskewitz children, Tiger and Miss Kitty, a sultry barroom chanteuse. While the quality of the animation is above average, the film's visualization of the American West is surprisingly dull. The movie has little narrative drive or emotional resonance, and its final action sequences seem perfunctory and tacked on.\"[7] As of November 2013, 40% of critics gave it a positive reception on Rotten Tomatoes.[8]","box_office":"$40.8 million","production_company":"Amblimation","directed_by":"Phil Nibbelink|Simon Wells|","Soundtrack":"The soundtrack was composed by James Horner and includes \"Dreams to Dream\", which was nominated for a Golden Globe award. \"Dreams to Dream\" was based on a short instrumental piece from the original film.(*a close parody of Aaron Copland's \"Hoe-Down\" theme, adapting the film's leitmotifs)","release_dates":"November 22, 1991 (1991-11-22)|||||","Production":"The film was the first production for Spielberg's Amblimation animation studio, a collaboration of Universal Studios and Amblin Entertainment, whose offices were located in London.[1] There, over 250 crew members worked on the project, which began in May 1989.[1] At the time, Amblimation was also developing We're Back! A Dinosaur's Story, Balto, and a screen adaptation of Andrew Lloyd Webber's Cats which never saw completion.[1]Don Bluth, who had partnered with Steven Spielberg on both the original film and The Land Before Time, was set to direct and have Sullivan Bluth Studios provide the animation;[2] owing to creative differences, however, they parted ways.[1] With no Bluth in sight for the sequel, Spielberg instead relied on Phil Nibbelink, a former Disney animator, and Simon Wells, the great-grandson of science-fiction author H.G. Wells, to direct the project.[1] The result was that the film's animation style was distinctly different from that of its predecessor.The Frankie Laine song \"Rawhide\" is played at the tumbleweed scene, although the version used is from The Blues Brothers. This sequence was designed and laid-out by an uncredited Alan Friswell, a special effects expert and stop-motion animator who was employed by the studio at the time, and is better-known for his work on the Virgin Interactive Entertainment Mythos computer game, Magic and Mayhem (1998), his restoration work for the Ray and Diana Harryhausen Foundation as well as his many model creations and magazine articles for publications such as Fortean Times, among others.In addition to a new voice actress, the character of Tanya was heavily redesigned as well. Instead of her red babushka headdress and blue and yellow dress, she wore a different colored dress and was given bangs and a ponytail and she was a couple inches taller than Fievel. Tiger also underwent minor changes (such as removing the \"M\" from his shirt), as did baby Yasha and Fievel.James Horner returned to write the score to the film, reusing old themes and introducing new ones.Amy Irving, who voiced Miss Kitty in the film, was Spielberg's ex-wife. During production, he married Kate Capshaw who had worked with him on Indiana Jones and the Temple of Doom in 1984.John Lithgow and Martin Short were considered to play Cat R. Waul and T.R. Chula, but Jon Lovitz signed to play Chula and John Cleese turned down the role as Cogsworth in Disney's Beauty and the Beast to play Cat R. Waul.","an_american_tail:_fievel_goes_west":"Theatrical release poster","produced_by":"Steven Spielberg|Robert Watts|","starring":"Phillip Glasser|James Stewart|Erica Yohn|Cathy Cavadini|Nehemiah Persoff|Dom DeLuise|Amy Irving|John Cleese|Jon Lovitz|","running_time":"74 minutes","music_by":"James Horner","edited_by":"Nick Fletcher","Release":"The film was released in the United States on November 22, 1991, exactly five years and one day after the release of the original one, and the same day as Disney's Beauty and the Beast.Although it profited at the box office, the film grossed less than its predecessor; it opened in fourth place with $3,435,625 despite being shown on nearly 1,700 theaters[3] and eventually made just over $22 million domestically, and $18 million overseas, for a total of $40,766,041.[4] By contrast, the original film made $47.4 million in the U.S. in 1986, a record at the time for a non-Disney animated one.,[5] and a further $36 million overseas, for a total of $84 million."}