{"Cast":"Several Romero regulars appeared in cameos: Joe Pilato appears as Head Officer at Police Dock, Tom Savini as Blades, Assistant Head Biker/Mechanic Zombie shot through glass/Zombie hit by truck, and Taso Stavrakis as Sledge, Biker (with Sledgehammer)/Fountain Zombie/Sailor Zombie/Chestburst Zombie.","country":"United States","distributed_by":"United Film Distribution Company","Plot":"The United States is devastated by a mysterious phenomenon which reanimates recently deceased unburied human beings as flesh-eating zombies. Despite the best efforts by the U.S. government and local authorities to control the situation, society is beginning to collapse. Some rural communities and the military have been effective in fighting the zombies in open country, but cities are helpless and largely overrun. Confusion reigns at the WGON television studio in Philadelphia by the phenomenon's third week, where staff members Stephen Andrews and Francine Parker are planning to steal the station's traffic helicopter to escape the zombies. Meanwhile, police SWAT officer Roger DiMarco and his team raid a housing project where the residents are defying the martial law of delivering their dead to National Guardsmen. Some residents fight back with handguns and rifles, and are killed by the combined might of the overzealous SWAT team and their own reanimated dead. During the raid, Roger meets Peter Washington, part of another SWAT team, and they partner up together. Roger tells Peter that his friend Stephen intends to take his network's helicopter, and suggests that Peter come with them. The matter is decided when they are informed of a group of zombies sheltered in the basement, which they execute with grim determination.That night, Roger and Peter escape Philadelphia with Francine and Stephen in the helicopter. Following some close calls while stopping for fuel, the group comes across a shopping mall, which becomes their sanctuary. Francine reveals that she is pregnant. Peter offers to abort the child, but this is rejected. Stephen teaches Francine how to operate the helicopter in case of emergency. To make the mall safe for habitation, they block the entrances with trucks to keep the undead masses outside from building up enough cumulative force to break through; they also craft a wooden \"false wall\" to hide the access to their living space. During the blockade operation, Roger becomes reckless and is bitten and infected. After clearing the mall of zombies, the four enjoy a hedonistic lifestyle with all the goods in the shopping mall available to them. Roger eventually succumbs to his infection, soon reanimates and is shot in the head by Peter. All emergency broadcast transmissions eventually cease, suggesting that civilization as they know it has completely collapsed.A gang of nomadic motorcyclists, having seen the helicopter during one of Francine's flying lessons, break into and start looting the mall, destroying the barriers and allowing hundreds of zombies inside. While Peter suggests they let the bikers take what they want and move on, Stephen foolishly starts a gun battle with the bikers and is shot in the arm. He tries to escape through an elevator shaft, but is cornered by the undead and bitten several times. As some of the bikers, shot by Peter, are consumed by the zombies, the rest retreat with their stolen goods. A reanimated Stephen (apparently knowing enough to remember the false wall) breaks through it and leads the undead to Francine and Peter. As Stephen enters their hideout, Peter kills him while Francine escapes to the roof. Peter then locks himself in a room and contemplates suicide. When zombies burst into the room, he has a change of heart and fights his way up to the roof, where he joins Francine. The two then fly away in the partially fueled helicopter to an uncertain future.","language":"English","Reception":"Dawn of the Dead performed well thanks both to commercial advertising and word-of-mouth. Ad campaigns and posters declared the film \"the most intensely shocking motion picture experience for all times\".[34] The film earned $900,000 on its opening weekend in the United States (total estimate at 5 million), an international gross of 40 million, followed by a worldwide gross revenue of $55 million, making it the most profitable film in the Dead series.[1][35]Dawn of the Dead—unlike many other \"gory\" horror staples of its time—has received acclaim from film reviews since its initial release. The film was regarded by many as one of the best films of 1978,[36][37][38] and it holds a 92% approval rating on Rotten Tomatoes based on 39 reviews.[39] The 25th anniversary issue of Fangoria named it the best horror film of 1979 (although it was released a year earlier),[40] and Entertainment Weekly ranked it #27 on a list of \"The Top 50 Cult Films.\"[41] Roger Ebert of the Chicago Sun-Times gave it four out of four stars and proclaimed it \"one of the best horror films ever made.\" While conceding Dawn of the Dead to be \"gruesome, sickening, disgusting, violent, brutal and appalling,\" Ebert said that \"nobody ever said art had to be in good taste.\"[42] Steve Biodrowski of Cinefantastique praised the film, calling it a \"broader\" version of Night of the Living Dead,[34] and gave particular credit to the acting and themes explored: \"the acting performances are uniformly strong; and the script develops its themes more explicitly, with obvious satirical jabs at modern consumer society, as epitomized by the indoor shopping mall where a small band of human survivors take shelter from the zombie plague sweeping the country.\" He went on to say that Dawn of the Dead was a \"savage (if tongue-in-cheek) attack on the foibles of modern society\", showcasing explicit gore and horror and turning them into \"a form of art\".[34]Dawn of the Dead was not without its detractors. Similar to the preceding Night of the Living Dead, some critical reviewers did not like the gory special effects. Particularly displeased at the large amount of gore and graphic violence was The New York Times critic Janet Maslin, who claimed she walked out after the first 15 minutes due to \"a pet peeve about flesh-eating zombies who never stop snacking,\"[43] and Gene Shalit of NBC's Today show dismissed it as \"Yawn of the Living.\" Others, particularly Variety Magazine, attacked the film's writing, claiming that the violence and gore detracts from any development of the characters, making them \"uninteresting\", resulting in a loss of impact. Variety wrote: \"Dawn pummels the viewer with a series of ever-more-grisly events—decapitations, shootings, knifings, flesh tearings - that make Romero's special effects man, Tom Savini, the real \"star\" of the film—the actors are as woodenly uninteresting as the characters they play.\"[44] Pauline Kael wrote that, in contrast to the \"truly frightening\" Night of the Living Dead, \"you begin to laugh with relief that you're not being emotionally challenged or even affected; [Dawn of the Dead is] just a gross-out.\"[45] Leslie Halliwell of Halliwell's Film Guide stated the film was \"occasionally laughable, otherwise sickening or boring.\"The film was selected as one of The 500 Greatest Movies of All Time by Empire magazine in 2008.[6] It was also named as one of The Best 1000 Movies Ever Made, a list published by The New York Times.[46]","box_office":"$55 million[1]","Remake":"The remake was directed by Zack Snyder in 2004 in his directorial debut. It stars Sarah Polley, Ving Rhames, and Jake Weber with cameos from original cast members Ken Foree, Scott Reiniger, and Tom Savini.","cinematography":"Michael Gornick","production_company":"Laurel Group Inc.","directed_by":"George A. Romero","Home media":"In 2004, after numerous VHS, Laserdisc and DVD releases of several different versions of the film from various companies, Anchor Bay Entertainment released a definitive Ultimate Edition DVD box set of Dawn of the Dead, following a single-disc U.S. theatrical cut released earlier in the year. The set features all three widely available versions of the film, along with different commentary tracks for each version, documentaries and extras.[47] Also re-released with the DVD set was Roy Frumkes' Document of the Dead, which chronicled the making of Dawn of the Dead and Romero's career to that point. The Ultimate Edition earned a Saturn Award for Best Classic Film Release.[48]The U.S. theatrical cut of Dawn of the Dead was released in high definition on the Blu-ray Disc format on October 7, 2007, in the USA. It was released on Blu-ray in the United Kingdom by Arrow Video which includes the theatrical cut and 2 DVDs with the Cannes and Argento cut. Both The Arrow Films Blu-ray and Anchor Bay Blu-ray have become out of print. An Australian Blu-ray was released by Umbrella Entertainment in 2007.","Book":"George Romero and Susanna Sparrow's paperback book based on the film was released in 1978. It was reissued, with a new introduction by Simon Pegg, on May 26, 2015 by Gallery Books.[49]","release_dates":"September 1, 1978 (1978-09-01) (Italy)|April 20, 1979 (1979-04-20) (United States)||||","Production":"The history of Dawn of the Dead began in 1974, when George A. Romero was invited by friend Mark Mason of Oxford Development Company—whom Romero knew from an acquaintance at his alma mater, Carnegie Mellon—to visit the Monroeville Mall, which Mason's company managed. After showing Romero hidden parts of the mall, during which Romero noted the bliss of the consumers, Mason jokingly suggested that someone would be able to survive in the mall should an emergency ever occur.[8] With this inspiration, Romero began to write the screenplay for the film.Romero and his producer, Richard P. Rubinstein, were unable to procure any domestic investors for the new project. By chance, word of the sequel reached Italian horror director Dario Argento. A fan of Night of the Living Dead and an early critical proponent of the film, Argento was eager to help the horror classic receive a sequel. He met Romero and Rubinstein, helping to secure financing in exchange for international distribution rights. Argento invited Romero to Rome so he would have a change of scenery while writing the screenplay. The two could also then discuss plot developments.[9] Romero was able to secure the availability of Monroeville Mall as well as additional financing through his connections with the mall's owners at Oxford Development.[8] Once the casting was completed, principal shooting was scheduled to begin in Pennsylvania on November 13, 1977.Principal photography for Dawn of the Living Dead (its working title at the time) began on November 13, 1977 at Monroeville Mall in Monroeville, Pennsylvania. Use of an actual, open shopping mall during the Christmas shopping season caused numerous time constraints. Filming began nightly once the mall closed, starting at 11 PM and ending at 7 AM, when automated music came on. As December arrived, the production decided against having the crew remove and replace the Christmas decorations—a task that had proved to be too time consuming. Filming was shut down during the last three weeks of the year to avoid the possible continuity difficulties and lost shooting time. Production would resume on January 3, 1978. During the break in filming, Romero took the opportunity to begin editing his existing footage.[10]The airfield scenes were filmed at the Harold W. Brown Memorial Airfield in Monroeville,[11] an airport located about two miles from the mall that is still in use.[12] The scenes of the group's hideout at the top of the mall were filmed on a set built at Romero's then-production company, The Latent Image.[13] The elevator shaft was located there as well, as no such area of the mall actually existed. The gun store was also not located in the mall—for filming, the crew used Firearms Unlimited, a shop that existed in the East Liberty district of Pittsburgh at the time.Principal photography on Dawn of the Dead ended in February 1978, and Romero's process of editing would begin. By using numerous angles during the filming, Romero allowed himself an array of possibilities during editing—choosing from these many shots to reassemble into a sequence that could dictate any number of responses from the viewer simply by changing an angle or deleting or extending portions of scenes. This amount of superfluous footage is evidenced by the numerous international cuts, which in some cases affects the regional version's tone and flow.According to the original screenplay, Peter and Francine were to kill themselves, Peter by shooting himself and Fran by sticking her head into the path of the rotating main helicopter blades. The ending credits would run over a shot of the helicopter blades turning until the engine winds down, implying that the two would not have gotten far if they had chosen to escape.[14] During production it was decided to change the ending of the film.Much of the lead-in to the two suicides remains in the film, as Francine leans out of the helicopter upon seeing the zombies approach and Peter puts a gun to his head, ready to shoot himself. An additional scene, showing a zombie having the top of its head cut off by the helicopter blades (thus foreshadowing Francine's suicide) was included early in the film. Romero has stated that the original ending was scrapped before being shot, although behind the scenes photos show the original version was at least tested. The head appliance made for Fran's suicide was instead used in the opening SWAT raid, made-up to resemble an African-American male and blown apart by a shotgun blast.[15]Tom Savini, who had been offered the chance to provide special effects and make-up for Romero's first zombie film, Night of the Living Dead, before being drafted into the Vietnam War, made his debut as an effects artist on Dawn of the Dead.[16] Savini had been known for his make-up in horror for some time, prior to Dawn of the Dead, and in his book explaining special effects techniques, Bizarro, explains how his time in Vietnam influenced his craft.[17] He had a crew of eight to assist in applying gray makeup to two to three hundred extras each weekend during the shoot.[18] One of his assistants during production was Joseph Pilato, who played a police captain in the film and would go on to play the lead villain in the film's sequel, Day of the Dead.[18]The makeup for the multitudes of extras in the film was a basic blue or gray tinge to the face of each extra. Some featured zombies, who would be seen close-up or on-screen longer than others, had more time spent on their look. Many of the featured zombies became part of the fanfare, with nicknames based upon their look or activity—such as Machete Zombie,[19] Sweater Zombie,[19] and Nurse Zombie.[19] \"Sweater zombie\" Clayton Hill, was described by a crew member as \"one of the most convincing zombies of the bunch\" citing his skill at maintaining his stiff pose and rolling his eyes back into his head, including heading down the wrong way in an escalator while in character.[20]A cast of Ross' head that was to be used in the original ending of the film (involving a suicide rather than the escape scene finally used) ended up as an exploding head during the tenement building scene. The head, filled with food scraps, was shot with an actual shotgun to get the head to explode.[16] One of the unintentional standout effects was the bright, fluorescent color of the fake blood that was used in the film. Savini was an early opponent of the blood, produced by 3M, but Romero thought it added to the film, claiming it emphasised the comic book feel of the movie.[21]The film's music varies with Romero's and Argento's cuts. For Romero's theatrical version, musical cues and selections were chosen from the De Wolfe Music Library, a compilation of stock music scores and cues. In the montage scene featuring the hunters and National Guard, the song played in the background is \"'Cause I'm a Man\" by the Pretty Things; the song was first released on the group's LP Electric Banana.[22] The music heard playing in a sequence in the mall and over the film's end credits is an instrumental titled \"The Gonk\"—a polka style tune from the De Wolfe Music Library, with a chorus of zombie moans added by Romero.[23]For Argento's international cut, the Italian director used the band Goblin (incorrectly credited as \"The Goblins\") extensively. Goblin is a four-piece Italian band that mostly provides contract work for film soundtracks. Argento, who received a credit for original music alongside Goblin, collaborated with the group to get music for his cut of the film. Romero used three of their pieces in his theatrical release version. The Goblin score would later find its way onto a Dawn of the Dead-inspired film, Hell of the Living Dead. The version of Dawn released on video in the mid-nineties under the label \"Director's Cut\" does not use most of the Goblin tracks, as they had not been completed at the time of that edit.Dawn of the Dead has received a number of re-cuts and re-edits, due mostly to Argento's rights to edit the film for international foreign language release. Romero controlled the final cut of the film for English-language territories. In addition, the film was edited further by censors or distributors in certain countries. Romero, acting as the editor for his film, completed a hasty 139-minute version of the film (now known as the Extended, or Director's Cut) for premiere at the 1978 Cannes Film Festival. This was later pared down to 127 minutes for the U.S. theatrical release. The US theatrical cut of the film earned the taboo rating of X because of its graphic violence. Rejecting this rating, Romero and the producers chose to release the film unrated to help the film's commercial success.[24] United Film Distribution Company eventually agreed to release it domestically in the United States. The film was refused classification in Australia twice: in its theatrical release in 1978 and once again in 1979. The cuts presented to the Australian Classification Board were Argento's cut and Romero's cut, respectively. Dawn of the Dead was finally passed in the country with an R18+ rating in February 1980.[25] It was banned in Queensland until at least 1986.Internationally, Argento controlled the Euro cut for non-English speaking countries. The version he created clocked in at 119 minutes. It included changes such as more music from Goblin than the three cuts completed by Romero, removal of some expository scenes, and a faster cutting pace.[26] It actually debuted nearly nine months before the US theatrical cut.[27] In Italy it was released under the full title Zombi: L’alba dei Morti Viventi, followed in March 1979 in France as Zombie: Le Crépuscule des Morts Vivants, in Spain as Zombi: El Regreso de los Muertos Vivientes, in the Netherlands as Zombie: In De Greep van de Zombies, in Germany by Constantin Film as Zombie, and in Denmark as Zombie: Rædslernes Morgen.[28]Despite the various alternate versions of the film available, Dawn of the Dead was successful internationally. Its success in then-West Germany earned it the Golden Screen Award, given to films that have at least three million admissions within 18 months of release.[29] A majority of these versions were released on DVD in the 2004 Special Edition, and have previously been released on VHS. The freelance photographer Richard Burke, working for Pittsburgh Magazine, released in May 2010 the first exclusive Behind-the-Scenes photos from the set.[30][31]","produced_by":"Richard P. Rubinstein|Claudio Argento|Alfredo Cuomo|","starring":"David Emge|Ken Foree|Scott Reiniger|Gaylen Ross|","running_time":"116 minutes (Italy)|127 minutes (United States)|","dawn_of_the_dead":"Theatrical release poster","music_by":"Goblin|Dario Argento|De Wolfe Music Library|","edited_by":"Dario Argento|George A. Romero|","written_by":"George A. Romero","budget":"$1.5 million[1]"}