{"based_on":"A Kiss Before Dying (1953 novel)  by Ira Levin","Cast":"Cast notes:","country":"United States","distributed_by":"United Artists","screenplay_by":"Lawrence Roman","a_kiss_before_dying":"theatrical release poster","Plot":"Bud Corliss (Robert Wagner) is an ambitious student who is wooing Dorothy Kingship (Joanne Woodward) purely for her father's mining fortune. When he discovers that Dorothy is pregnant with his child, he realizes she is quite likely to be disinherited by her wealthy family. He assures Dorothy that he'll take care of her, yet he hesitates when Dorothy insists on marrying. Bud then murders Dorothy and stages it in a way that it appears to be a suicide. He then reaches out to her sister Ellen (Virginia Leith) with the hopes of marrying her in order to ingratiate himself with her father. After a couple of months Ellen finds evidence to question the suicide verdict, and then discovers that Bud knew Dorothy. Ellen struggles to avenge her sister and save her own life.","language":"English","Critical reception":"When the film opened, Variety wrote: \"This multiple-murder story is an offbeat sort of film, with Robert Wagner portraying a calculating youth who intends to allow nothing to stand in his way to money ... Gerd Oswald's restrained direction suits the mood ... Wagner registers in killer role. Woodward is particularly good as the pregnant girl, and Virginia Leith acceptable as her sister. Jeffrey Hunter is lost as a part-time university professor responsible for the final solution of the crimes. Mary Astor and George Macready are okay as Wagner's mother and the girls' father.\"[7]Time Out Film Guide liked the script and the direction of the film, and wrote, \"An early Ira Levin thriller, predating 'Rosemary's Baby'...superbly adapted as an icily acute nightmare...by the great Oswald, giving a criminally myopic Hollywood its first glimpse of a unique visual talent, idiosyncratically developed from that of his father, German silent director Richard Oswald.\"[8]Film critic James Crawford praised the film for direction and inventiveness. He makes the case that the film's long second shot functions as a foreshadowing, an organizing principle, a statement of purpose in the film. Crawford wrote, \"It’s not remarkable for what it reveals — it’s essentially exposition of narrative and character traits — but for its movement, length, and the way it approaches space, viewer identification, and power dynamics.\" As for the creativity of the film, he compares the three minutes, 26 seconds length of the shot and likened it to the \"granddaddy of all tracking shots,\" the one that kicks off Touch of Evil — the most apropos comparison, given that it was released in 1958, two years later.[9]According to film critic Alain Silver, a theme used in film noir is the disruptive force of the \"maniac\" in society. The threat to the family and social values are apparent in these types of films. Gaining dominance and disrupting the family is a central theme of A Kiss Before Dying. Robert Wagner's character pursues one path to his true target in Dorothy, then kills her and pursues her sister, all with the objective of reaching their father and his fortune.[10]","Remake":"A famously bad adaptation directed by James Dearden was remade in 1991 using the same title. Called \"insanely inept\" and \"bereft of suspense\" by Entertainment Weekly,[11] the film earned two Razzie awards.","cinematography":"Lucien Ballard","directed_by":"Gerd Oswald","release_dates":"June 12, 1956 (1956-06-12)|||||","Production":"Darryl F. Zanuck bought the rights to the book in August 1953, following the bidding of many studios. His public announcement revealed that Wagner would star in the lead.[4] The role of Dwight Powell, played in the film by Robert Quarry, was initially to be played by Martin Milner, but Milner had to drop out because of schedule changes.[5]In 1955 it was announced the film would be made by Crown Productions, and distributed by United Artists. It was the second film from Crown following The Killer is Loose; an executive for the company was Robert Jacks, Daryl Zanuck's son in law.[6]Three members of the cast – Wagner, Joanne Woodward and Jeffrey Hunter – were loaned to United Artists by Twentieth Century-Fox.[5] The film was the directorial debut of Gerd Oswald, and was filmed in Tucson, Arizona.[5]The film's use of the word \"pregnant\" caused controversy: it was cut out during its preview in Chicago, and United Artists was not allowed by the Hollywood censors to use the word in any advertising.[3]","produced_by":"Robert L. Jacks","starring":"Robert Wagner Jeffrey Hunter Virginia Leith Joanne Woodward Mary Astor","running_time":"94 minutes","music_by":"Lionel Newman","edited_by":"George A. Gittens"}