{"country":"United States","distributed_by":"Warner Bros.","Plot":"\"Bronco Billy's Wild West Show\" is a rundown traveling circus, the star of which is Bronco Billy McCoy (Clint Eastwood), the \"fastest gun in the West.\" For the show's finale, a blindfolded Bronco Billy shoots balloons around a female assistant on a revolving wooden disc, and for the last balloon, he throws a knife. However, the assistant moves her leg and is nicked, so she quits. The show is not making any money, and nobody has been paid for six months.The show moves on to a new town and Bronco Billy goes to city hall to get a permit. He bumps into Antoinette Lily (Sondra Locke) and John Arlington (Geoffrey Lewis), who are there to be married. Antoinette despises her future husband, but has to marry before she is thirty in order to inherit a large fortune. Their car breaks down at the motel opposite the Wild West Show. The next morning, Arlington steals all her money and their repaired car. She is left to fend for herself.Bronco Billy talks Antoinette into becoming his new assistant, \"Miss Lily,\" though she only agrees to do one show. Her first performance is unusually successful, although Miss Lily irritates Billy by not sticking to the script.Antoinette discovers that Arlington has been arrested for her murder (framed by Antoinette's stepmother and her scheming lawyer friend, who stand to gain her inheritance). Seizing the chance to get even with Arlington, Antoinette rejoins the Wild West Show.She discovers that none of the performers are real cowboys: they are mostly ex-convicts or alcoholics (or both). Bronco Billy was a shoe salesman who shot his wife for sleeping with his best friend. Nevertheless, Miss Lily begins to warm to the troupe.Two of the show's performers announce that they are going to have a baby. The crew goes to a bar to celebrate. One gets arrested by police who discover that he is a deserter from the Army. Bronco Billy uses the show's meager savings to bribe the sheriff into letting the man go, swallowing his pride and enduring the sheriff's verbal humiliations for his friend's sake.Then the circus tent burns down. Everyone blames Miss Lily for their bad luck, but Bronco Billy defends her and proposes that they rob a train. They try to do this in the standard Western way (riding alongside and jumping on), but a modern train proves to be resistant to such an approach and they give up.Next, the troupe travels to a mental institution at which they have previously performed pro bono. The head of the institution, who is obsessed with the Wild West, agrees to provide them with accommodation and to supply a new tent, and the inmates sew one out of American flags. Miss Lily and Bronco Billy spend the night together. By chance, one inmate turns out to be Arlington (he had been paid by the crooked lawyer to confess to being mentally disturbed when he \"murdered\" Antoinette). When he sees her, he raises a fuss and gets released. Bronco Billy and the show depart without Miss Lily.Antoinette returns to a luxurious lifestyle, but she is bored and misses Billy, who drowns his loneliness with alcohol. The two reunite when Miss Lily returns to the circus.","language":"English","Critical reception":"Eastwood has cited Bronco Billy as being one of the most affable shoots of his career, and biographer Richard Schickel has argued that the character of Bronco Billy is his most self-referential work.[7][8] The film was a commercial failure,[9] but was appreciated by critics. Janet Maslin of The New York Times believed the film was \"the best and funniest Clint Eastwood movie in quite a while,\" praising Eastwood's directing and the way he intricately juxtaposes the old West and the new.[10]","box_office":"$24,265,583 (domestic)[2]","cinematography":"David Worth","directed_by":"Clint Eastwood","Box office performance":"Although the film grossed 4-5 times its cost (some $25 million) during its United States theatrical release, Eastwood considered it insufficient.[11] In a French interview, Eastwood spoke about the film's financial reception, \"It was an old-fashioned theme, probably too old fashioned since the film didn't do as well as we hoped. But if, as a film director, I ever wanted to say something, you'll find it in Bronco Billy.[11]","release_dates":"June 11, 1980 (1980-06-11)","Production":"Eastwood received Dennis E. Hackin and Neal Dobrofsky's script and decided to join the film with Sondra Locke.[3] The film was shot in less than six weeks in the Boise, Idaho area in the fall of 1979.[4] Additional filming took place in eastern Oregon and New York.[3] Filmed on a low budget of $5 million, it finished two to four weeks ahead of schedule.[5][6]","produced_by":"Dennis Hackin Neil Dobrofsky Robert Daley","starring":"Clint Eastwood Sondra Locke Geoffrey Lewis Scatman Crothers Bill McKinney Dan Vadis Sam Bottoms Sierra Pecheur","running_time":"116 minutes","bronco_billy":"Theatrical release poster","music_by":"Snuff Garrett","edited_by":"Joel Cox Ferris Webster","written_by":"Dennis Hackin","budget":"$6.5 million[1]"}