{"based_on":"An Awfully Big Adventure  by Beryl Bainbridge","country":"United Kingdom","distributed_by":"Fine Line Features","screenplay_by":"Charles Wood","Plot":"In the film's prologue, a hotelier ushers a child into a bomb shelter during the Liverpool Blitz. We see a brief flashback to a woman leaving her baby in a basement surrounded by flickering candles. Before departing from the house, she quickly drops a string of pearls on the child's pillow, twined around a single rose.Years later, 16-year-old Stella Bradshaw (Georgina Cates) lives in a working class household with her Uncle Vernon (Alun Armstrong) and Aunt Lily (Rita Tushingham) in Liverpool. Lacking an adult in her life to whom she feels close, she frequently goes into phone booths to \"speak with her mother\", who never appears in the film. Her uncle, who sees a theatrical career as being her only alternative to working behind the counter at Woolworth’s, signs her up for speech lessons and pulls the strings to get her involved at a local repertory theatre. After an unsuccessful audition, Stella gets a job gofering for Meredith Potter (Hugh Grant), the troupe's sleazy, eccentric director, and Bunny (Peter Firth), his faithful stage manager.The impressionable Stella develops a crush on the worldly, self-absorbed Potter, whose homosexuality completely eludes her. Amused, he gives her the small role of Ptolemy the boy-king in Caesar and Cleopatra but ignores her otherwise. Potter reveals himself to be a cruel, apathetic man who treats Stella and everyone else around him with scorn and condescension. He reserves his greatest cruelty for Dawn Allenby (Carol Drinkwater), a desperate older actress whom he callously dismisses from the company; she later attempts suicide. Potter also has a long history of exploiting young men. Stella is quickly caught up in the backstage intrigue and also becomes an object of sexual advances for men around the theatre company, including P.L. O'Hara (Alan Rickman), a brilliant actor who has returned to the troupe in a stint playing Captain Hook for its Christmas production of Peter Pan. In keeping with theatrical tradition, O'Hara also doubles as Mr. Darling.O'Hara carries himself with grace and charisma, but privately is as troubled and disillusioned as the other members of the cast. Haunted by his wartime experiences and a lost love (who, he believes, bore him a son he never knew), O'Hara embarks on an affair with Stella, to whom he feels an inexplicably deep emotional connection. Stella, who is still determined to win over Potter, remains emotionally detached but takes advantage of O'Hara's affections, seeing it as an opportunity to gain sexual experience.The last straw for Stella is during a cast outing when Geoffrey, a fellow teenage stagehand whom Potter has been sexually toying with, bursts out and punches him in the nose. The cast rushes to comfort Geoffrey, but Stella exclaims that he ought to be sacked. O'Hara explains to her that Potter has spent his life harming people like Geoffrey and causing pain to people like Bunny who really love him: \"believe it or not, it doesn't much matter him or her, old or young to Meredith. What he wants is hearts.\" Concerned, O'Hara visits her aunt and uncle, who disclose Stella's history. He finds out that Stella's long-missing mother was his lost love, whom he then knew by the nickname Stella Maris, making Stella—whom he's been sleeping with—his child, a daughter rather than the son he had imagined.Keeping his discovery to himself, O'Hara gets on his motorcycle and drives back out to the seaport. He distractedly slips on the wet gangplank, hits his head, and is pitched into the water. Before he drowns, his last image is that of the woman from the earlier flashbacks, clutching the infant.Stella is later seen hastening to the phone booth to confide her woes over the phone to \"her mother\"—as has been her habit throughout the film. We are suddenly reminded that the absent Stella Maris had years ago won a nationwide contest to be the voice of the speaking clock. It is her recorded voice that provides the only response to her daughter's confidences.","language":"English","box_office":"$851,545","cinematography":"Dick Pope","directed_by":"Mike Newell","an_awfully_big_adventure":"Theatrical release poster","Soundtrack":"A soundtrack album was released on 20 June 1995 by Silva Screen Records. In addition to the original film score composed by Richard Hartley, the Irish folk song \"The Last Rose of Summer\" is used as O'Hara's theme music throughout the film.","release_dates":"7 April 1995 (1995-04-07)|||||","Production":"Georgina Cates, whose real name is Clare Woodgate, was initially declined when she first auditioned for the film. Upon rejection, she dyed her hair red, changed her name and reinvented herself as a teenage girl from Liverpool with no acting experience and applied again. The second time she got the role. Alan Rickman was reportedly miffed when he found out her true age. According to Mike Newell, he \"treated her very tactfully, presuming that she was sexually inexperienced and could get upset by the scene.\"[1]Principal photography was shot mostly in Dublin. The playhouse in the movie was actually the Olympia Theatre.","produced_by":"Hilary Heath Philip Hinchcliffe Victor Glynn","starring":"Alan Rickman Hugh Grant Georgina Cates Alun Armstrong Peter Firth Carol Drinkwater","running_time":"112 minutes","music_by":"Richard Hartley","edited_by":"Jon Gregory","Release":"The film did not perform well at the box office, earning only $593,350 domestically and $258,195 in the United States. However, Georgina Cates received a London Film Critics Circle Award nomination for Best Actress of the Year and Mike Newell was nominated for a Crystal Globe Award for Best Director at the Karlovy Vary International Film Festival.The film received mixed reviews. Though Rickman and Grant were unanimously praised, many audiences were indifferent to its bleak, subtle humor and episodic structure. Lisa Schwartzenbaum of Entertainment Weekly wrote that \"Rickman . . . is the most interesting thing going in this unwieldy muddle . . . There's a creepy allure to O'Hara, and it is his energy that moves the story along to its unsettling surprise ending.\"[2] Edward Guthmann of The San Francisco Chronicle wrote, \"This isn't a sentimental slice of British eccentricity, or a gentle glance at amateur theatricals and the oddballs who inhabit them . . . Instead, it's a sour, unpleasant experience that gives us every reason not to become involved. Newell, who directed Four Weddings with such a light touch and such fondness, leaves the impression here that he doesn't like his characters and doesn't mind if we don't, either.\"[3]Janet Maslin of The New York Times, however, felt that it captured \"Mr. Grant as the clever, versatile character actor he was then becoming, rather than the international dreamboat he is today . . . [the film] isn't overly concerned with making its stars look good. Mr. Grant wears a monocle, has nicotine-stained fingers and appears in one scene looking dissolute and vomit-stained . . . As it turns out, a public relations blackout is only the least of this admirable film's problems. Its Liverpool accents are thickly impenetrable. And Ms. Bainbridge's book is elliptical to begin with, which guarantees that some of its fine points will be lost in translation. Mr. Newell directs his actors beautifully, but the screenplay by Charles Wood echoes Ms. Bainbridge in letting important information fly by obliquely. So listen closely. This is a dark, eccentric film that both requires and rewards keen attention.\"[4]Similarly, Joel Pearce of DVD Verdict commented that \"An Awfully Big Adventure is disappointing, but not because it's a bad movie . . . In fact, it's a good movie that's been the victim of extremely bad marketing . . . Hugh Grant is at his sleazy, sardonic best . . . Some elements of the film are too subtle, so it takes a while to figure out what's really going on.\"[5]Alan Rickman said that he felt the film suffered comparisons to Four Weddings and a Funeral.[6]","budget":"$4 million"}