{"country":"United States","distributed_by":"Trimark Pictures","Plot":"In the year 2074, the cybernetics market is dominated by two rival companies: USA's Pinwheel Robotics and Japan's Kobayashi Electronics. Androids, called \"cyborgs\", are commonplace, used for anything from soldiers to prostitutes. Casella \"Cash\" Reese (Jolie) is a prototype cyborg developed for corporate espionage and assassination. She is filled with a liquid explosive called \"Glass Shadow\". Pinwheel plans to eliminate the entire Kobayashi board of directors using Casella as a suicide bomber to precipitate a hostile takeover of the company and obtain a monopoly over the cyborg market.She is programmed to mimic human senses and emotions such as fear, love, pain and hate. Guided by Mercy (Palance), a renegade prototype cyborg who can communicate through any electronic device, she and her combat trainer Colton Ricks (Koteas) escape the Pinwheel facility so she can avoid self-destruction, something that most corporate espionage cyborgs face. They're relentlessly pursued by Pinwheel's hired killer or \"wiretapper\", Daniel Bench (Drago).Bench must also deal with a rival bounty hunter named Chen, who plans on killing Colt and reprogram Cash by having her blow up Pinwheel as a means to get even with her boss, Dunn. However, Chen and Ricks get into a fight, which results in her getting electrocuted by a fuse box.Mercy is later revealed to be a human/cyborg hybrid who was created by Pinwheel as a means to create the next stage in human evolution, but Mercy escaped before they had a chance to erase his memory. Ricks and Bench get into a boxing match to find out who lives and who dies, namely going to the African coast, which results in Bench getting mutilated by a rotating fan, killing him. Cash and Ricks escape to a new life in Africa after winning the tournament, while Mercy confronts Dunn by blaming him for ruining his life.Dunn tells Mercy he was just doing his job for the benefit of mankind. He then activates his own self-destruct device, which kills Dunn and destroys Pinwheel headquarters. The final shot of the movie shows Cash remaining young and beautiful, while Ricks has begun to age. Cash, realizing he has died, decides to shut herself down, forever in a permanent dream state.","language":"English","Reception":"Alan Jones of the Radio Times rated the film 3 out of 5 stars and called it a \"Blade Runner-inspired violent fantasy\".[1] Entertainment Weekly selected Cyborg 2 as Jolie's worst film.[2]Jolie has said that after she saw the film, she \"went home and got sick\".[3]","directed_by":"Michael Schroeder","release_dates":"November 24, 1993 (1993-11-24)|||||","cyborg_2":"Video release poster","produced_by":"Raju Patel Alain Silver","starring":"Elias Koteas Angelina Jolie Jack Palance Billy Drago Karen Sheperd Allen Garfield Renee Griffin","running_time":"99 minutes","music_by":"Peter Allen","written_by":"Michael Schroeder Mark Geldman Ron Yanover"}