{"based_on":"90 Minutes in Heaven  by Don Piper","country":"United States","distributed_by":"Samuel Goldwyn Films[1]","language":"English","Reception":"90 Minutes in Heaven has received negative reviews from critics. On Rotten Tomatoes the film holds a rating of 24%, based on 21 reviews, with an average rating of 4.4/10.[23] Metacritic gives the film a score of 28 out of 100, based on reviews from 9 critics, indicating \"generally unfavorable reviews\".[24]","box_office":"$4.8 million[4]","Synopsis":"Don Piper (Hayden Christensen), was involved in a horrific car crash and was pronounced dead at the scene and covered by a tarp. 90 minutes later he had been brought to the emergency room and returns to life, and claims to have seen Heaven and visited with deceased relatives while there.","cinematography":"M. David Mullen","directed_by":"Michael Polish","production_companies":"Emmett/Furla Films Family Christian Entertainment Giving Films","release_dates":"September 11, 2015 (2015-09-11)|||||","Production":"The project was shot in Atlanta, Georgia,[13] and the shooting finished in March 2015.[9][14][15] Since its publication, Don Piper's book was twice on the New York Times Best Seller list, was listed as a USA Today best-seller,[16] and has sold 7 million copies in 46 languages.[17]The producers chose to stay as true to the book which inspired the film as possible:[18][sic]\"I think a lot of people read books, especially true stories, and then the movie is not even close to the real story and they make up things. I told Don that I thought the story stood for itself and my commitment to him was that it would be true to the book, and be true period.\" - Rick Jackson[18]Actress Kate Bosworth stated she \"was amazed how Piper's story affects so many people\" and that she felt blessed \"to be a part of the movie's cast.\"[18] Filming began in January 2015,[5][7][19] and by March 8, 2015, filming has wrapped and the project went into post-production.[20][21]","90_minutes_in_heaven":"Theatrical release poster","produced_by":"Randall Emmett|Dawn Parouse|George Furla|Rick Jackson|Harrison Powell|Timothy C. Sullivan|","starring":"Hayden Christensen|Kate Bosworth|Dwight Yoakam|Michael W. Smith|Michael Harding|","running_time":"121 minutes[2]","edited_by":"Cary Gries","Release":"90 Minutes in Heaven was released on DVD and Blu-ray on December 1, 2015.[22]","written_by":"Michael Polish","budget":"$5 million[3]"}