{"country":"Italy","distributed_by":"Columbia Pictures","language":"English","cinematography":"Luigi Kuveiller Technicolor, Techniscope","directed_by":"Vic Morrow Giorgio Gentili (uncredited)","release_dates":"9 June 1970[1]","produced_by":"Dino De Laurentiis","starring":"James Garner Dennis Weaver Claude Akins Wayde Preston","running_time":"93 minutes","music_by":"Phil Coulter (Song \"Other Men's Gold\") Gianni Ferrio Bill Martin (Song \"Other Men's Gold\")","Story":"Luther Sledge (James Garner), a wanted and very famous outlaw is in a saloon, and upstairs visiting his girlfriend, Ria, who is a hooker. His partner, one of his gang, is shot in the back by a sore loser from a poker game. Sledge comes downstairs, pretends to be drunk, kills the murderer and accomplice who was backing him up. After leaving, Sledge finds he is being followed by an old man who realizes he is a wanted outlaw. Sledge is about to tie up the old man and leave him in a meat packing plant when the old man relates a tale of a gold shipment that travels on a regular basis. This gold shipment is guarded by forty heavily armed riders, but they stop at night and leave the gold in a prison the old man was in for years.Sledge assembles his regular gang (including Joyce, Bice, Gutherie, Beetle, Kehoe, and Hooker) (Hooker is played by Claude Akins) and they check the story out, only to find it true. Equipping themselves for the endeavor, the old man and a prostitute that Sledge summoned go into town. The Sheriff in the town nearest the prison recognizes the old man and a shootout ensues in which a deputy is killed, but Sledge and his gang get away. Sledge begins formulating a plan, which includes observing the riders and even testing out their formation by riding near them.Seeing how difficult it is to approach, a new plan is formulated. The new plan is to get into the prison, turn the prisoners loose, and steal the gold in the ensuing havoc. Sledge is taken to the prison by one of the gang, Ward (Dennis Weaver) posing as a US Marshal who wants to lock up this most dangerous prisoner for the night. The incident in the town is well known, and the Sheriff arrives at the Warden's office. The Warden has been reluctant to incarcerate Sledge...on the grounds that he is not used to overnight prisoners and he thinks overnight incarceration is the Sheriff's business. The Sheriff attacks Sledge in the Warden's office, but is fended off by Ward swearing he will protect his prisoner. Eventually, the Warden allows Sledge and the \"Marshall\" to stay together in a cell for the night. Held in maximum security, they overpower the guards, gain the keys, and free all the prisoners in the prison. Guards put up a defence including Gatling guns, and this is heard in the town. The forty armed riders head to the prison. The gold is held in a safe in a cell. The prisoners kill the Warden in front of Sledge...so now there is no combination to the safe, and the riders are on the way. Sledge locks the old man up in his old cell next to the safe in an adjoining cell where he heard the safe being opened for years. He guides Bice through opening the safe. The forty armed riders arrive and encounter armed, rioting prisoners and Sledge's gang. Ward (Dennis Weaver) is killed in the battle. The Sheriff from the nearby town also arrives, and is killed in a rifle joust with Sledge horse to horse.The gang makes their escape and later stop to rest the horses at a small assemblege of adobe huts with thatched roofs. They split up the gold, with Sledge getting a double share. The old man first voices dissension over this, saying it isn't exactly a split. A musical interlude with a ballad about gold shows a myriad of poker hands in which it appears the old man winning a substantial amount of the other outlaws gold. Playing against Joyce, the old man finds that he has been cheated when Joyce substituted sand for gold dust. The old man shoots one of the gang who he says was cheating. This causes consternation with another gang member, Gutherie, who was best friends with the one who dies. Sledge defends the old mans actions were justified...but then tells the old man he will finish playing poker with him and clean him out. Sledge does this, and also wins most of the gold from the entire gang. He leaves despite their protestations, the old man saying it isn't right and they must go kidnap Ria. Doing this, they follow Slege to an old Spanish Mission in what appears to be a Mexican town. The townfolk are having some sort of religious festival and the town is completely deserted. Amazingly, the old man has become the defacto leader of the gang, and attempts negotiation with Sledge. This is a trick, for when he offers to leave with half the gold, one of the gang, Kehoe, tries to slip one on Sledge and kill him with a knife. Sledge kills Kehoe in hand-to-hand combat. In the attack though, Sledge is wounded in the arm. He takes a crucifix and makes a splint. Sledge still refuses to negotiate, but the old man tells Sledge Ria has been kidnapped and threatens to kill her. Sledge agrees to surrender the gold, but Ria is horribly hurt. It appears that Bice threw her off a roof. Hearing her screams, Sledge now believes they have Ria and surrenders the gold. He then goes to Ria who tells him it is all the old mans fault. Her dying words to Sledge are that her and him did not need the gold to be happy, and a warning that Bice is behind him. Bice had been left in the church bell tower with a rifle to get Sledge, but Sledge kills him instead. This leaves Hooker (Claude Akins) and the old man to hunt Sledge down. Sledge shoots Hooker, and then goes after the old man. It appears the old man hides in an altar in the church. Finding the old man, Sledge is warned that he has hidden the gold where it can never be found without him. Remembering Ria's words about not needing the gold, Sledge, forgetting his passion for the gold, shoots the old man in the stomach. The old man utters his dying words, and Sledge finishes him off with a carefully placed final bullet. Sledge rides off to the tune of a ballad.","edited_by":"Renzo Lucidi","written_by":"Vic Morrow Frank Kowalski"}