{"country":"France|Germany|Italy|Netherlands|United Kingdom|United States[1]|","distributed_by":"Warner Bros. Pictures Constantin Film (Germany) Pathé (France)","Plot":"The film is based on the life of Alexander the Great, King of Macedonia, who conquered Asia Minor, Egypt, Persia and eventually defeated in ancient India. Shown are some of the key moments of Alexander's youth, his invasion of the mighty Persian Empire and his death. It also outlines his early life, including his difficult relationship with his father Philip II of Macedonia, his strained feeling towards his mother Olympias, the unification of the Greek city-states and the two Kingdoms (Macedonia and Epirus) under the Hellenic League,[4] and the conquest of the Persian Empire in 331 BC. It also details his plans to reform his empire and the attempts he made to reach the end of the then known world.The story begins 40 years after 323 BC, around 283 BC, with Ptolemy I Soter, who narrates throughout the film. We see Alexander's daily life and the strained relationship between his parents. Alexander grows up with his mother Olympias and his tutor Aristotle, where he finds interest in love, honour, music, exploration, poetry and military combat. His relationship with his father is destroyed when Philip marries Attalus's niece, Eurydice.After Philip is assassinated, Alexander becomes King of Macedonia. Ptolemy mentions Alexander's punitive campaign in which he razes Thebes and burns Persepolis, then gives an overview of Alexander's west-Persian campaign, including his declaration as the son of Zeus by the Oracle of Amun at Siwa Oasis, his great battle against the Persian Emperor Darius III in the Battle of Gaugamela and his eight-year campaign across Asia.Also shown are Alexander's private relationships with his childhood friend Hephaestion and later his wife Roxana. Hephaestion compares Alexander to Achilles, to which Alexander replies that, if he is Achilles, Hephaestion must be his Patroclus (Achilles' best friend and lover). When Hephaestion mentions that Patroclus died first, Alexander pledges that, if Hephaestion should die first, he will follow him into the afterlife. Hephaestion shows extensive jealousy when he sees Alexander with Roxana and deep sadness when he marries her, going so far as to attempt to keep her away from him after Alexander murders Cleitus the Black in India.After initial objection from his soldiers, Alexander convinces them to join him into his final and bloodiest battle, The Battle of Hydaspes. He is severely injured with an arrow but survives and is celebrated. Later on, Hephaestion succumbs to an unknown illness either by chance or perhaps poison, speculated in the movie to be Typhus carried with him from India. Alexander, full of grief and anger, distances himself from his wife, despite her pregnancy, believing that she has killed Hephaestion. He dies less than three months after Hephaestion, in the same manner, keeping his promise that he would follow him. On his deathbed, Bagoas grieves as Alexander's generals begin to split up his kingdom and fight over the ownership of his body.The story then returns to 283 BC, where Ptolemy admits to his scribe that he, along with all the other officers, had indeed poisoned Alexander just to spare themselves from any future conquests or consequences. He, however has it that it just be recorded that Alexander died due to illness compounding to his overall weakened condition. He then goes on to end his memoirs with praise to Alexander.The story then ends with the note that Ptolemy's memoirs of Alexander eventually burned, lost forever with the Library of Alexandria.","language":"English","Reception":"A group of 25 Greek lawyers initially threatened to file a lawsuit against both Stone and the Warner Bros. Film studio for what they claimed was an inaccurate portrayal of history. \"We are not saying that we are against gays,\" said Yannis Varnakos, \"but we are saying that the production company should make it clear to the audience that this film is pure fiction and not a true depiction of the life of Alexander\". After an advance screening of the film, the lawyers announced that they would not pursue such a course of action.[8]At the British premiere of the film, Stone blamed \"raging fundamentalism in morality\" for the film's US box-office failure.[9] He argued that American critics and audiences had blown the issue of Alexander's sexuality out of proportion.[10] The criticism prompted him to make significant changes to the film for its DVD release, whose cover characterizes them as making it \"faster paced, more action-packed\".Alexander attracted critical scrutiny from historians with regards to historical accuracy. Most academic criticism was concerned with the insufficient adherence to historical details.[11]The movie is a reduction, rather than a chronicle, of Alexander's life events. It makes use of time compression and it condenses several key events into fewer ones; some actions are attributed to different individuals from those in real history; it generally adheres to milestone facts and phrases, but they are often misplaced in time and in location. The movie additionally skips the initial conquest of Asia Minor, Syria and Egypt in its entirety, and from Macedonia the storyline jumps straight to the battle of Gaugamela which took place 3–4 years after Alexander moved to conquer the Persian Empire. Alexander and his troops defeat the Persian army in a single battle in the film, but Persian historian Farrokh points out that the real Alexander had to fight several fierce battles before he was able to defeat Darius III. Alexander had to fight major battles at Granicus, Halicarnassus, Issus, Tyre, Gaza, and Gaugamela, not to count innumerable other battles and sieges along the route between Asia Minor and Egypt, but these battles only receive passing mentions in the film. Farrokh also observed that, in the movie, \"Greek forces are typically shown as very organised, disciplined, and so on, and what's very disturbing is, when the so-called Persians are shown confronting the Macedonians, their armies are totally disorganised.\"[12]Philotas, one of his generals, and the one tried for treason, is made to look little older than a boy, while he was well in his mid-40s when he was executed, having served with Philip long before. The same criticism applies to Darius III himself, who was 57 or 58 when he died and in the movie is played by an actor only about 38.Other major objections came from Iranian historians, who were upset by the film's renderings of Persians and Macedonians alike. The on-screen titles also incorrectly identify Babylon as in Persia, rather than the Persian empire. Objections were also raised by Indian historians. The final battle depicted in the film, heavily dramatised and altered from history, was the Battle of the Hydaspes on the River Jhelum in ancient India. Alexander was not (contrary to what the film depicts) severely injured by an arrow from Indian ruler Porus during this battle. That occurred only later, during a siege later that year against the Malli tribes in Punjab.Hydaspes was not fought in a forest on a sunny day but on a muddy plain on a night with torrential rains. The centre of the Macedonian line was never surrounded by any accounts, but the infantry suffered many casualties. The film has also been criticised for omitting a famous story about Alexander's conversation with King Porus. When Alexander won the battle, Porus was captured and presented to him. \"Tell me,\" said Alexander, \"what do you wish that I should do with you?\" Porus replied, \"Treat me, O Alexander, as a king ought.\"[13] However, a similar scene exists in the film regarding Princess Stateira, Darius III's daughter.Oliver Stone has, in his various commentaries in the film's DVD, defended many of the most glaring historical issues by claiming that he had no time or resources to portray accurately a multitude of battles at the expense of storytelling. He goes into great detail explaining how he merged all the major aspects of the Battle of the Granicus and the Battle of Issus into the Battle of Gaugamela, as well as heavily simplifying the Battle of Hydaspes into a straightforward clash, while merging the near-death of Alexander from the siege of Malli.The film performed well in Europe, but in North America received mostly negative reviews from film critics, with Rotten Tomatoes giving it a 16% rating based on 195 reviews. The consensus states: \"Even at nearly three hours long, this ponderous, talky and emotionally distant biopic fails to illuminate Alexander's life.\"[14]One of the principal complaints among US film critics was that Alexander resembled less an action-drama film than a history documentary. Roger Ebert of the Chicago Sun-Times wrote in his review, \"[W]e welcome the scenes of battle, pomp and circumstance because at least for a time we are free of the endless narration of Ptolemy the historian.\"[15]Faint praise came from Daily Variety Magazine, published on 21 November 2004, for which Todd McCarthy wrote, \"Oliver Stone's Alexander is at best an honorable failure, an intelligent and ambitious picture that crucially lacks dramatic flair and emotional involvement. Dry and academic where Troy (2004) was vulgar and willfully ahistorical\"[16] Manohla Dargis wrote in The New York Times that Alexander \"brought out the best of the worst in terms of inaccurate storytelling that lacks planning.\"On his 11 December 2004 episode of Saturday Night Live, Colin Farrell joked about the failure of Alexander during his monologue saying, \"I've been out of the country for 14 months filming Alexander which I think proved to be time well spent.\"The film was nominated in six categories at the Golden Raspberry Awards in 2005: Worst Picture, Worst Actor (Colin Farrell), Worst Actress (Angelina Jolie), Worst Director (Oliver Stone), Worst Supporting Actor (Val Kilmer) and Worst Screenplay, thereby becoming the second-most-nominated potential \"Razzie\" film of 2004; however, it won no awards.","box_office":"$167.3 million","cinematography":"Rodrigo Prieto","directed_by":"Oliver Stone","Versions":"This is the film as it was originally released in theaters, with a running time of 175 minutes. It was released on DVD and is also available on Blu-ray in some territories.Stone's director's cut was re-edited before the DVD release later in 2005. Stone removed seventeen minutes of footage and added nine back. This, then, shortened the running time from 175 minutes to 167. The differences between the director's cut and the theatrical version are as follows:Stone also made an extended version of Alexander. \"I'm doing a third version on DVD, not theatrical\", he said in an interview with Rope of Silicon. \"I'm going to do a Cecil B. DeMille three-hour-45-minute thing; I'm going to go all out, put everything I like in the movie. He [Alexander] was a complicated man, it was a complicated story, and it doesn't hurt to make it longer and let people who loved the film [...] see it more and understand it more.\"The extended version of the film was released under the title of Alexander Revisited: The Final Unrated Cut on 27 February 2007. The two-disc set featured a new introduction by Stone. \"Over the last two years,\" he said, \"I have been able to sort out some of the unanswered questions about this highly complicated and passionate monarch – questions I failed to answer dramatically enough. This film represents my complete and last version, as it will contain all the essential footage we shot. I don't know how many film-makers have managed to make three versions of the same film, but I have been fortunate to have the opportunity because of the success of video and DVD sales in the world, and I felt, if I didn't do it now, with the energy and memory I still have for the subject, it would never quite be the same again. For me, this is the complete Alexander, the clearest interpretation I can offer.\"[17]The film is restructured into two acts with an intermission. Alexander: Revisited takes a more in-depth look at Alexander's life and his relationships with Olympias, Philip, Hephaestion, Roxana and Ptolemy. The film has a running time of three hours and 34 minutes (214 minutes, about 40 minutes longer than the theatrical cut and almost 50 minutes longer than the first director's cut) and is presented in 2.40:1 anamorphic widescreen with English Dolby Digital 5.1 Surround audio. Beyond the new introduction with Stone, there are no other extras on the DVD except for a free coupon to the movie 300.[18] The Blu-ray and HD-DVD releases both feature a variety of special features however, including two audio commentaries and a new featurette.[19]For seven years it was the only version of the film available on Blu-ray, until the release of the Ultimate Cut, which also includes the Theatrical Cut.In November 2012, Oliver Stone revealed that he was working on a fourth cut of the film, at Warner Bros' request and that this time around he would remove material, as he felt he had added in too much in the \"Final Cut\".[20] The version, which is 206 minutes long, premiered on 3 July 2013 at the Karlovy Vary International Film Festival[21] and Stone swears that no more versions will follow.[22] In February 2014, Oliver Stone announced on Twitter that 'Alexander the Ultimate Cut (Tenth Anniversary Edition)' would be released in the United States on 3 June 2014. According to Amazon.com, some of its features include:","alexander":"Theatrical release poster","production_companies":"Intermedia Films Ixtlan Productions France 3 Cinéma Pacific Film Egmond Film & Television IMF Internationale Medien und Film GmbH & Co. 3 Produktions KG","release_dates":"16 November 2004 (2004-11-16) (Hollywood premiere)|24 November 2004 (2004-11-24) (United States)|23 December 2004 (2004-12-23) (Germany/Netherlands)|5 January 2005 (2005-01-05) (France)|14 January 2005 (2005-01-14) (Italy)|","produced_by":"Thomas Schühly Jon Kilik Iain Smith Moritz Borman","starring":"Colin Farrell Angelina Jolie Val Kilmer Jared Leto Rosario Dawson Anthony Hopkins","running_time":"175 minutes","music_by":"Vangelis","edited_by":"Thomas J. Nordberg Yann Hervé Alex Marquez","written_by":"Oliver Stone Christopher Kyle Laeta Kalogridis","budget":"$155 million"}