{"based_on":"Dick Tracy  by Chester Gould","Cast":"Hamilton Camp appears as a store owner and Bing Russell plays a Club Ritz patron. Robert Costanzo cameos as Lips Manlis' bodyguard. Allen Garfield, John Schuck, and Charles Fleischer make cameos as reporters. Walker Edmiston, John Moschitta, Jr., and Neil Ross provide the voices of each radio announcer. Mike Mazurki (who played Splitface in the original Dick Tracy film) appears in a small cameo. The 94-year-old veteran character actor Ian Wolfe plays his last film role as \"Munger\".","country":"United States","dick_tracy":"Theatrical release poster","distributed_by":"Buena Vista Pictures","Popular culture":"A Berts ytterligare betraktelser illustration shows a poster for the film, depicting Dick Tracy firing a machine gun, and the text \"Warren Beatty Dick Tracy\" appearing above, as Bert in mid-October accidentally drops Nadja into the floor at the cinema lobby room.[62]","language":"English","box_office":"$162.7 million","cinematography":"Vittorio Storaro","Marketing":"Disney modeled its marketing campaign after the 1989 success of Batman, which was based on high concept promotion. This included a McDonald's promotional tie-in and a Warren Beatty interview conducted by Barbara Walters on 20/20. \"I find the media's obsession with promotion and demographics upsetting,\" Beatty said. \"I find all this anti-cultural.\" In attempting to market Dick Tracy to young children, Disney added a new Roger Rabbit cartoon short (Roller Coaster Rabbit) and made two specific television advertisements centered on The Kid (Charlie Korsmo). In total, Disney commissioned 28 TV advertisements.[3] Playmates Toys manufactured a line of 14 Dick Tracy figures.[23]It was Madonna's idea to include the film as part of her Blond Ambition World Tour.[3] Prior to the June 1990 theatrical release, Disney had already featured Dick Tracy in musical theatre stage shows in both Disneyland and the Walt Disney World Resort, using Stephen Sondheim and Danny Elfman's music. The New York Times also wrote in June 1990 of Disney Stores \"selling nothing but Tracy-related merchandise.\"[24] Max Allan Collins lobbied to write the film's novelization long before Disney had even greenlighted Dick Tracy in 1988. \"I hated the idea that anyone else would write a Tracy novel,\" Collins explained. After much conflict with Disney,[6] leading to seven different printings of the novelization,[21] the book was released in May 1990, published by Bantam Books.[25] It sold almost one million copies prior to the film's release.[21] A graphic novel adaptation of the film was also released, written and illustrated by Kyle Baker.[22] Reruns of The Dick Tracy Show began airing to coincide with the release of the film, but stations in Los Angeles and New York pulled and edited the episodes when Asian and Hispanic groups protested that the characters Joe Jitsu and Go Go Gomez were offensive stereotypes.[26][27] A theme park ride for Disneyland, Disney-MGM Studios and Euro Disney Resort called Dick Tracy's Crime Stoppers was planned but ultimately never built.[28]","directed_by":"Warren Beatty","Home media release":"The film was released on VHS on December 19, 1990, and was first released on DVD in Europe in 2000, but domestic release in the US was delayed until April 2, 2002, and without any special features. Rumors circulated over the web shortly after the US DVD release that Warren Beatty had planned to release a director's cut under Disney's \"Vista Series\" label; including at least ten extra minutes of footage.[49]The Blu-ray was released in the US and Canada on December 11, 2012. This release also lacked special features, save for a digital copy.[50]","release_dates":"June 15, 1990 (1990-06-15)|||||","Production":"Although Al Pacino was Warren Beatty's first choice for the role of Alphonse \"Big Boy\" Caprice, Robert De Niro was under consideration.[11] Madonna pursued the part of Breathless Mahoney, offering to work for scale to avoid any appearance of nepotism. Her resulting paycheck for the film was just $35,000.[3] Sean Young claims she was forced out of the role of Tess Truehart (which eventually went to Glenne Headly) after rebuffing sexual advances from Beatty. In a 1989 statement, Beatty said, \"I made a mistake casting Sean Young in the part and I felt very badly about it.\"[12] Mike Mazurki, who had appeared in Dick Tracy (1945) had a cameo.Principal photography for Dick Tracy began on February 2, 1989.[13] The filmmakers considered shooting the film on-location in Chicago, Illinois, but production designer Richard Sylbert believed Dick Tracy would work better using sound stages and backlots[14] at Universal Studios in Universal City, California.[13] Other filming took place at Warner Bros. Studios in Burbank.[15] In total, 53 interior and 25 exterior sets were constructed. Beatty, being a perfectionist, often filmed dozens of takes of every scene.[13]As filming continued, Disney and Max Allan Collins conflicted over the novelization. The studio rejected his manuscript: \"I wound up doing an eleventh hour rewrite that was more faithful to the screenplay, even while I made it much more consistent with the strip,\" Collins continued, \"and fixed as many plot holes as I could.\"[13] Disney did not like this version either, but accepted based on Beatty's insistence to incorporate some of Collins' writing into the shooting script, which solved the plot hole concerns. Through post-production dubbing, some of Collins' dialogue was also incorporated into the film. Principal photography for Dick Tracy ended in May 1989.[13]Early in the development of Dick Tracy, Warren Beatty decided to make the film using a palette limited to just seven colors, primarily red, green, blue and yellow—to evoke the film's comic strip origins; furthermore each of the colors was to be exactly the same shade. Beatty's design team included production designer Richard Sylbert, set decorator Rick Simpson, cinematographer Vittorio Storaro (whom Beatty had worked with on his previous film as producer and lead actor, Ishtar), visual effects supervisors Michael Lloyd and Harrison Ellenshaw, prosthetic makeup designers John Caglione, Jr. and Doug Drexler, and costume designer Milena Canonero. Their main intention was to stay close to Chester Gould's original drawings from the 1930s. Other influences came from the Art Deco movement and German Expressionism.[16]For Storaro, the limited color palette was the most challenging aspect of production. \"These are not the kind of colors the audience is used to seeing,\" he noted. \"These are much more dramatic in strength, in saturation. Comic strip art is usually done with very simple and primitive ideas and emotions,\" Storaro theorized. \"One of the elements is that the story is usually told in vignette, so what we tried to do is never move the camera at all. Never. Try to make everything work into the frame.\"[6] For the matte paintings, Ellenshaw and Lloyd executed over 57 paintings on glass, which were then optically combined with the live action. For a brief sequence in which The Kid dashes in front of a speeding locomotive, only 150-foot (46 m) of real track was laid; the train itself was a 2-foot (0.61 m) scale model, and the surrounding train yard a matte painting.[14]Caglione and Drexler were recommended for the prosthetic makeup designs by Canonero, with whom they had worked on The Cotton Club (1984). The rogues gallery makeup designs were directly taken from Gould's drawings,[17] with the exception of Al Pacino (Big Boy Caprice), who improvised his own designs, ignoring the rather overweight character of the strip.[14] His makeup took 3.5 hours to apply.[18]\"Directors don't know anything about music really, and if they do, it's not necessarily a help. Warren Beatty is a pianist and knows much more about music than almost any director, but when he and I started on Dick Tracy, communicating on a musical level was getting us nowhere because it is all so interpretive. We started having much more success when we started talking on a strictly gut level.\"Warren Beatty hired Danny Elfman to compose/write the film score based on his previous success with Batman (1989). Elfman enlisted the help of Oingo Boingo lead guitarist Steve Bartek and Shirley Walker to arrange compositions for the orchestra. \"In a completely different way,\" Elfman commented, \"Dick Tracy has this unique quality that Batman had for me. It gives an incredible sense of non-reality.\"[20] In addition, Beatty hired acclaimed songwriter Stephen Sondheim to write five original songs: \"Sooner or Later (I Always Get My Man),\" \"More,\" \"Live Alone and Like It,\" \"Back in Business,\" and \"What Can You Lose?\". \"Sooner or Later\" and \"More\" were performed by Madonna, with \"What Can You Lose?\" being a duet with Mandy Patinkin. Mel Tormé sang \"Live Alone and Like It,\" and \"Back in Business\" was performed by Janis Siegel, Cheryl Bentyne, and Lorraine Feather. \"Back in Business\" and \"Live Alone and Like It\" were both used as background music during montage sequences.[21] \"Sooner or Later\" and \"Back in Business\" would be featured in the original 1992 production of the Sondheim revue Putting It Together in Oxford, England, and four of the five Sondheim songs from Dick Tracy (the exception being \"What Can You Lose?\") were used in the 1999 Broadway production of Putting It Together.Dick Tracy is also the first film to use digital audio.[22] In a December 1990 interview with The New York Times, Elfman criticized the growing tendency to use digital technology for sound design and dubbing purposes. \"I detest contemporary scoring and dubbing in cinema. Film music as an art took a deep plunge when Dolby stereo hit. Stereo has the capacity to make orchestral music sound big and beautiful and more expansive, but it also can make sound effects sound four times as big. That began the era of sound effects over music.\"[19]","Development":"Warren Beatty had a concept for a Dick Tracy film in 1975. At the time, the film rights were owned by Michael Laughlin, who gave up his option from Tribune Media Services after he was unsuccessful in pitching Dick Tracy to Hollywood studios. Floyd Mutrux and Art Linson purchased the film rights from the Tribune in 1977,[3] and, in 1980, United Artists became interested in financing/distributing Dick Tracy. Tom Mankiewicz was under negotiations to write the script, based on his previous success with Superman (1978) and Superman II (1980). The deal fell through when Chester Gould insisted on strict financial and artistic control.[4]That same year, Mutrux and Linson eventually took the property to Paramount Pictures, who began developing screenplays, offered Steven Spielberg the director's position, and brought in Universal Pictures to co-finance. Universal put John Landis forward as a candidate for director, courted Clint Eastwood for the title role, and commissioned Jim Cash and Jack Epps, Jr. to write the screenplay. \"Before we were brought on, there were several failed scripts at Universal,\" reflected Epps, \"then it went dormant, but John Landis was interested in Dick Tracy, and he brought us in to write it.\"[5] Cash and Epps' simple orders from Landis were to write the script in a 1930s pulp magazine atmosphere and center it with Alphonse \"Big Boy\" Caprice as the primary villain. For research, Epps read every Dick Tracy comic strip from 1930 to 1957. The writers wrote two drafts for Landis; Max Allan Collins, then writer of the Dick Tracy comic strip, remembers reading one of them. \"It was terrible. The only positive thing about it was a thirties setting and lots of great villains, but the story was paper-thin and it was uncomfortably campy.\"[5]In addition to Beatty and Eastwood, other actors who were considered for the lead role included Harrison Ford, Richard Gere, Tom Selleck, and Mel Gibson.[6] Landis left Dick Tracy following the controversial on-set accident on Twilight Zone: The Movie (1983), in which actor Vic Morrow was killed.[5] Walter Hill then came on board to direct with Joel Silver as producer. Cash and Epps wrote another draft, and Hill approached Warren Beatty for the title role. Pre-production had progressed as far as set building, but the film was stalled when artistic control issues arose with Beatty, a fan of the Dick Tracy comic strip.[7] Hill wanted to make the film violent and realistic, while Beatty envisioned a stylized homage to the 1930s comic strip.[3] The actor also reportedly wanted $5 million plus fifteen percent of the box office gross, a deal which Universal refused to accept.[7]Hill and Beatty left the film, which Paramount began developing as a lower-budget project with Richard Benjamin directing. Cash and Epps continued to rewrite the script, but Universal was unsatisfied. The film rights eventually reverted to Tribune Media Services in 1985. However, Beatty decided to option the Dick Tracy rights himself, along with the Cash/Epps script. When Jeffrey Katzenberg moved from Paramount to the Walt Disney Studios, Dick Tracy resurfaced with Beatty as director, producer and leading man.[7] He considered hiring Martin Scorsese to direct the film,[8] but changed his mind. \"It never occurred to me to direct the movie,\" Beatty admitted, \"but finally, like most of the movies that I direct, when the time comes to do it, I just do it because it's easier than going through what I'd have to go through to get somebody else to do it.\"[7]Beatty's reputation for directorial profligacy—notably with the critically acclaimed Reds (1981), did not sit well with Disney.[7] As a result, Beatty and Disney reached a contracted agreement whereby any budget overruns on Dick Tracy would be deducted from Beatty's fee as producer, director, and star.[9] Beatty and regular collaborator Bo Goldman significantly rewrote the dialogue but lost a Writers Guild arbitration and did not receive screen credit.[3]Disney greenlighted Dick Tracy in 1988 under the condition that Warren Beatty keep the production budget within $25 million,[3] which began to rise once filming started. It quickly jumped to $30 million[10] and then $47 million as its final production budget. Disney spent an additional $54 million on the marketing campaign, resulting in a total of $101 million spent overall. The financing for Dick Tracy came from Disney and Silver Screen Partners IV, as well as Beatty's own production company, Mulholland Productions. Disney was originally going to release the film under the traditional Walt Disney Pictures banner, but chose instead to release and market the film under the adult-oriented Touchstone Pictures label leading up to the film's theatrical debut, because the studio felt it had too many mature themes for a Disney-branded film.","running_time":"105 minutes","budget":"$46 million[1]","Plot":"At an illegal card game, a young street urchin witnesses the massacre of a group of mobsters at the hands of Flattop and Itchy, two of the hoods on the payroll of Alphonse \"Big Boy\" Caprice. Big Boy's crime syndicate is aggressively taking over small businesses in the city. Detective Dick Tracy catches the urchin (who calls himself \"Kid\") in an act of petty theft. After rescuing him from a ruthless host, Tracy temporarily adopts him with the help of his girlfriend, Tess Truehart (Glenne Headly).Meanwhile, Big Boy coerces club owner Lips Manlis into signing over the deed to Club Ritz. He then kills Lips with a cement overcoat (referred to onscreen as \"The Bath\") and steals his girlfriend, the seductive and sultry singer, Breathless Mahoney. After Lips is reported missing, Tracy interrogates his three hired guns Flattop, Itchy, and Mumbles, then goes to the club to arrest Big Boy for Lips' murder. Breathless is the only witness. Instead of providing testimony, she unsuccessfully attempts to seduce Tracy. Big Boy cannot be indicted and he is released from jail. Big Boy's next move is to try to bring other criminals, including Spud Spaldoni, Pruneface, Influence, Texie Garcia, Ribs Mocca, and Numbers, together under his leadership. Spaldoni refuses and is intentionally killed, leaving Dick Tracy, who discovered the meeting and was attempting to spy on it, wondering what is going on. The next day, Big Boy and his henchmen kidnap Tracy and attempt to bribe him; Tracy refuses, prompting the criminals to attempt to kill him. However, Tracy is saved by Kid, who gets prized by the police with a Honorary Detective Certificate, which will remain temporary until he decides a name for himself.Breathless shows up at Tracy's apartment, once again in an attempt to seduce him. Tracy shows he is only human by allowing her to kiss him. Tess witnesses this and eventually leaves town. Tracy leads a seemingly unsuccessful raid on Club Ritz, but it is actually a diversion so officer \"Bug\" Bailey can enter the building to operate a secretly installed listening device so the police can hear in on Big Boy's criminal activities. The resultant raids all but wipe out Big Boy's criminal empire. However, Big Boy discovers Bug and captures him for a trap planned by Influence and Pruneface to kill Tracy in the warehouse. In the resulting gun battle, a stranger with no face called \"The Blank\" steps out of the shadows to save Tracy after he is cornered and kills Pruneface. Influence escapes as Tracy rescues Bug from the same fate given to Lips Manlis, and Big Boy is enraged upon hearing that The Blank foiled the hit. Tracy tries again to get the testimony from Breathless he needs to put Big Boy away. She agrees to testify only if Tracy agrees to give in to her advances. Tess eventually has a change of heart, but before she can tell Tracy, she is kidnapped by The Blank, with the help of Big Boy's club piano player, 88 Keys. Tracy is drugged and rendered unconscious by The Blank, framed for murdering the corrupt District Attorney John Fletcher, and is detained. The Kid, meanwhile, adopts the name \"Dick Tracy, Jr.\"Big Boy's business thrives until the Blank frames him for Tess' kidnapping. Released by his colleagues on New Year's Eve, Tracy interrogates Mumbles and arrives at a shootout outside Big Boy's club where his men are killed by the police and Tracy. Abandoning his crew, Big Boy flees to a drawbridge and ties Tess to the gears before he is confronted by Tracy. Their fight is halted when the Blank appears and holds both men at gunpoint, offering to share the city with Tracy after Big Boy is dead. Big Boy takes advantage of a distraction and opens fire before Tracy sends him falling to his death in the bridge gears. Mortally wounded, the Blank is revealed to be Breathless Mahoney, who kisses Tracy before dying. All charges against Tracy are dropped.Later, Tracy proposes to Tess when he is interrupted by the report of a robbery in progress. He leaves her with a ring before heading away with Dick Tracy, Jr.","Reception":"Dick Tracy had its premiere at the Walt Disney World Resort in Orlando, Florida.[3] The film was released in the United States in 2,332 theaters on June 15, 1990, earning $22.54 million in its in opening weekend.[29] This was the third-highest opening weekend of 1990.[30] Dick Tracy eventually grossed $103.74 million in US totals and $59 million elsewhere, coming to a worldwide total of $162.74 million.[29] Dick Tracy was also the ninth-highest grossing film of America in 1990,[30] and number twelve in worldwide totals.[31]Although Disney was impressed by the opening weekend gross,[21] studio chairman Jeffrey Katzenberg expressed disappointment. He suggested that Dick Tracy had cost about $100 million in total to produce, market and promote. \"We made demands on our time, talent and treasury that, upon reflection, may not have been worth it,\" Katzenberg reported.[32] Disney, in particular, was expecting the film's earnings to match Batman (1989).[21] By 1997, Dick Tracy had made an additional $60.61 million in rental figures.[33]Dick Tracy has received mixed reviews from critics. Based on 45 reviews collected by Rotten Tomatoes, 64% of the critics enjoyed Dick Tracy. The consensus reads: \"Dick Tracy is stylish, unique, and an undeniable technical triumph, but it ultimately struggles to rise above its two-dimensional artificiality.\"[34] Roger Ebert gave the film four stars in his review, arguing that Warren Beatty succeeded in creating the perfect tone of nostalgia for the film. Ebert mostly praised the matte paintings, art direction and prosthetic makeup design. \"Dick Tracy is one of the most original and visionary fantasies I've seen on a screen,\" he wrote.[35]Vincent Canby of The New York Times reviewed: \"Dick Tracy has just about everything required of an extravaganza: a smashing cast, some great Stephen Sondheim songs, all of the technical wizardry that money can buy, and a screenplay that observes the fine line separating true comedy from lesser camp.\"[36] Owen Gleiberman from Entertainment Weekly gave a mixed review, but was impressed by Madonna's performance. \"Dick Tracy is an honest effort but finally a bit of a folly. It could have used a little less color and a little more flesh and blood,\" Gleiberman concluded.[37]In his heavily negative review for The Washington Post, Desson Thomson criticized Disney's hyped marketing campaign, and the film in general. \"Dick Tracy is Hollywood's annual celebration of everything that's wrong with Hollywood,\" he stated.[38] Peter Travers of Rolling Stone magazine cited that Warren Beatty, at 52 years old, was too old for the part. He also found similarities with Batman (1989), in which both films involve \"a loner hero, a grotesque villain, a blond bombshell, a marketable pop soundtrack and a no-mercy merchandising campaign,\" Travers continued. \"But Batman possesses something else: a psychological depth that gives the audience a stake in the characters. Tracy sticks to its eye-poppingly brilliant surface. Though the film is a visual knockout, it's emotionally impoverished.\"[39]Although Max Allan Collins (then a Dick Tracy comic-strip writer) had conflicts with Disney concerning the novelization, he gave a positive review for the finished film. He praised Beatty for hiring an elaborate design team and his decision to mimic the strip's limited color palette. Collins also enjoyed Beatty's performance, both the prosthetic makeup and characterization of the rogues gallery, as well as the Stephen Sondheim music. However, he believed the filmmakers still sacrificed the storyline in favor of the visual design.[22]At the 63rd Academy Awards, production designer Richard Sylbert and set decorator Rick Simpson won Best Art Direction, while John Caglione, Jr. and Doug Drexler won Best Makeup.[40] Stephen Sondheim was also awarded with Best Original Song for \"Sooner or Later (I Always Get My Man)\", which Madonna sang live at the awards ceremony. Dick Tracy, with three Oscars, is the comic book film with the most wins, followed by The Dark Knight (2008) with two. Nominations included Al Pacino for Best Supporting Actor, Vittorio Storaro (Cinematography), Milena Canonero (Costume Design), and the sound designers (Sound - Thomas Causey, Chris Jenkins, David E. Campbell and Doug Hemphill).[41] Storaro was also honored for his work by both the American Society of Cinematographers and British Society of Cinematographers.[42][43]The British Academy of Film and Television Arts gave awards to Sylbert, Caglione and Drexler at the 44th British Academy Film Awards. Pacino, Canonero, editor Richard Marks, and both the sound design and visual effects departments received nominations.[44] At the 48th Golden Globe Awards, Pacino and Sondheim (for both \"Sooner of Later (I Always Get My Man)\" and \"What Can You Lose\") were nominated for their work, while Dick Tracy lost the Best Motion Picture (Musical or Comedy) to Green Card (1990)[45] and the Saturn Award for Best Fantasy Film to Ghost (1990). Cagilione and Drexler ended up winning Best Make-up, while Warren Beatty (Best Actor), Madonna (Best Actress), Pacino (Supporting Actor), and Charlie Korsmo (Performance by a Younger Actor) received nominations. Canonero was also nominated once more for her costume design.[46] Film score composer Danny Elfman and Sondheim (\"More\") received individual nominations at the Grammy Awards.[47]American Film Institute recognition:","Sequel and legal issues":"Disney had hoped Dick Tracy would launch a successful franchise, like the Indiana Jones series, but a disappointing box office performance halted Disney's plans.[1] In addition, executive producers Art Linson and Floyd Mutrux sued Beatty shortly after the release of the film, alleging that they were owed profit participation from the film.[22]Beatty purchased the Dick Tracy film and television rights in 1985 from Tribune Media Services.[51] He then took the property to the Walt Disney Studios, who optioned the rights in 1988. According to Beatty, in 2002, Tribune attempted to reclaim the rights and notified Disney—but not through the process outlined in the 1985 agreement.[52] Beatty, who commented he had \"a very good idea\"[53] for a sequel, believed Tribune violated various notification procedures that \"clouded the title\"[53] to the rights and made it \"commercially impossible\" for him to produce a sequel.[53] He approached the Tribune in 2004 to settle the situation, but the company said they had met the conditions to get back the rights.[51]Disney, which had no intention of producing a sequel, rejected Tribune's claim and gave Beatty back most of the rights in May 2005.[54] That same month, Beatty filed a lawsuit in the Los Angeles, California Superior Court seeking $30 million in damages against the Tribune and a declaration over the rights. Bertram Fields, Beatty's lawyer, said the original 1985 agreement with the Tribune was negotiated specifically to allow Beatty a chance to make another Dick Tracy film. \"It was very carefully done and they just ignored it,\" he stated. \"The Tribune is a big, powerful company and they think they can just run roughshod over people. They picked the wrong guy.\"[53]The Tribune believed the situation would be settled quickly[55] and was confident enough to begin developing a Dick Tracy live action television series with Lorenzo di Bonaventura, Robert Newmyer and Outlaw Productions. The TV show was to have a contemporary setting, comparable to Smallville, and Di Bonaventura commented that if the TV show was successful, a feature film would likely follow.[51] However, an August 2005 ruling by federal judge Dean D. Pregerson cleared the way for Beatty to sue the Tribune.[54] The April 2006 hearing ended without a ruling,[56] but in July 2006, a Los Angeles judge ruled that the case can go to trial; Tribune's request to end the suit in their favor was rejected.[57] The legal battle between Beatty and the Tribune continued to ensue.[58]In 2008, Beatty convinced cinematographer Emmanuel Lubezki and film critic Leonard Maltin to make The Dick Tracy TV Special for Turner Classic Movies, which featured Beatty as Tracy having a retrospective interview with Maltin.[2][59] Maltin explicitly asks the fictional Tracy if Warren Beatty is planning on making a sequel to the 1990 film and he responds that he's heard about that but Maltin needs to ask Beatty himself. By March 2009, Tribune was in Chapter 11 bankruptcy and lawyers for the company began to declare their ownership of television and film rights to Dick Tracy. \"Mr. Beatty's conduct and wrongful claims have effectively locked away certain motion picture and television rights to the Dick Tracy property,\" lawyers for Tribune wrote in a filing.[58] Fields responded that it was \"a nuisance lawsuit by a bankrupt company and they should be ashamed of themselves.\"[58]On March 25, 2011, U.S. District Court Judge Dean D. Pregerson granted Beatty's request for a summary judgment and ruled in the actor's favor. Judge Pregerson wrote in his order that \"Beatty's commencement of principal photography of his television special on November 8, 2008 was sufficient for him to retain the Dick Tracy rights.\"In June 2011, Beatty confirmed his intention to make a sequel to Dick Tracy, but he refused to discuss details. He said: \"I'm gonna make another one [but] I think it's dumb talking about movies before you make them. I just don't do it. It gives you the perfect excuse to avoid making them.\" When asked when the sequel would get made, he replied: \"I take so long to get around to making a movie that I don’t know when it starts.\"[49]The lawsuit was resolved in Beatty's favor, with a US District judge ruling that Beatty did everything contractually required of him to keep the rights to the character.[60]While there have not been any sequels in either television or motion picture form, there have been sequels in novel form. Shortly after the release of the 1990 film, Max Allan Collins wrote Dick Tracy Goes To War. The story is set after the opening of World War II and involves Dick Tracy's enlistment into the U.S. Navy, working for their Military Intelligence Division (as he did in the comic strip). In the story, Nazi saboteurs Black Pearl and Mrs. Pruneface (Pruneface's widow) set up a sabotage/espionage operation out of Caprice's old headquarters in the Club Ritz. For their activities, they recruit B.B. Eyes, The Mole, and Shakey. Their reign of terror, culminating in an attempt to bomb a weapons plant, is averted by Tracy. A year after \"War\" was released, Collins wrote a third novel entitled Dick Tracy Meets His Match, in which Dick Tracy finally follows through in his marriage proposal to Tess Trueheart.In April 2016, Beatty again mentioned the possibility of doing a sequel when he attended CinemaCon.[61]","production_companies":"Touchstone Pictures Silver Screen Partners IV Mulholland Productions","produced_by":"Warren Beatty","starring":"Warren Beatty|","music_by":"Danny Elfman","edited_by":"Richard Marks","written_by":"Jim Cash|Jack Epps, Jr.|"}