{"Cast":"The film was a hit and became the 9th most popular movie at the US box office in 1941.[7] According to MGM records the film earned $2,009,000 in the US and Canada and $1,157,000 elsewhere resulting in a profit of $1,269,000.[1]","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Popular culture":"In the Northern Exposure television series 1991 episode \"The Big Kiss\", orphan Ed Chigliak watches Boys Town and is inspired to find out who his real parents are. He mentions the film reference to several other characters.Newt Gingrich, the Speaker of the House of Representatives in 1994, referenced the film to argue that philanthropists would be able to help those effected by government cuts.[8]","Plot":"The story opens when a convicted murderer asks to make his confession on the day of his execution. The condemned man is visited by an old friend, Father Flanagan (Spencer Tracy) who runs a home for indigent men in Omaha, Nebraska. When the prison officials suggest that the condemned man owes the state a debt, Father Flanagan witnesses the condemned man's diatribe to prison officials and a reporter that describes his awful plight as a homeless and friendless boy who was a ward in state institutions. After the convicted man asks the officials to leave, Father Flanagan provides some comfort and wisdom. On the train back to Omaha, Father Flanagan is transformed in his humanitarian mission by revelations (echoed in the words) imparted by the condemned man's litany of hardships experienced as a child without friends or family as a ward of the state.Father Flanagan believes there is no such thing as a bad boy and spends his life attempting to prove it. He battles indifference, the legal system, and often the boys themselves, to build a sanctuary which he calls Boys Town. The boys have their own government, make their own rules, and dish out their own punishment. One boy, Whitey Marsh (Mickey Rooney) is as much as anyone can handle. Whitey's older brother, in prison for murder, asks Father Flanagan to take Whitey (himself a poolroom shark and tough talking hoodlum) to Boys Town. Whitey's older brother escapes custody during transfer to federal prison. After thinking he has caused the death of a younger boy, Whitey leaves the un-fenced Boys Town and wanders the streets of town. Whitey is accused of bank robbery and murder on circumstantial evidence. Popular sentiment (stirred by sensationalized media reports headed by an unsympathetic newspaper owner) turns against Boys Town, and it seems likely the home will be permanently closed. Whitey joins his brother, but Father Flanagan rescues Whitey and helps capture the gang in the act of robbery. Whitey and Father Flanagan return to Boys Town.[2]","Home video releases":"Boys Town was released on VHS by MGM on March 29, 1993 and re-released on VHS on March 7, 2000. On November 8, 2005, it was released on DVD as a part of the \"Warner Brothers Classic Holiday Collection\", a 3-DVD set which also contains Christmas in Connecticut and the 1938 version of A Christmas Carol, and as an individual disc. The DVD release also includes the 1941 sequel Men of Boys Town as an extra feature.","language":"English","Reception":"The film was a massive hit and earned MGM over $2 million in profit.[4]","box_office":"$4,058,000[1]","cinematography":"Sidney Wagner","directed_by":"Norman Taurog","Awards":"In February 1939, when he accepted his Oscar for the role, Spencer Tracy responded graciously by spending all of his acceptance speech talking about Father Flanagan. \"If you have seen him through me, then I thank you.\" An overzealous MGM publicity representative announced that Tracy was donating his Oscar to Flanagan without confirming it with Tracy. Tracy's response was: \"I earned the...thing. I want it.\" The Academy hastily struck another inscription, Tracy kept his statuette, and Boys Town got one, too. It read: \"To Father Flanagan, whose great humanity, kindly simplicity, and inspiring courage were strong enough to shine through my humble effort. Spencer Tracy.\"[5]According to the IMDB trivia page, there's an alternative version of the Spencer Tracy Oscar story. \"The day after Spencer Tracy won the Best Actor Oscar for his performance in this film, an MGM publicist released a statement - without consulting Tracy first - that the actor would donate his Oscar to the real Boys Town in Nebraska. Tracy agreed to make the donation if the Academy would send him a replacement Oscar. When the replacement arrived, the engraving on the award read: \"Best Actor - Dick Tracy.\"\"[6]","Sequel: Men of Boys Town":"Released in April 1941, Men of Boys Town takes a darker tone to the plight of homeless and troubled youth. Tracy and Rooney reprise their characters as Father Flanagan and Whitey Marsh as they expose the conditions in a boys reform school. This movie was released on VHS on December 23, 1993, but is now available only as an extra feature on Boys Town's DVD.Mr. and Mrs. Maitland, a childless couple, invite Whitey to their home on a trial basis. Whitey tries to visit a friend in reform school and inmate Flip is hiding in a car as Whitey leaves. Flip steals money and both boys go to reform school. (This is where the movie takes a darker tone as it depicts, using indirect camera angles, the physical abuse the boys suffer in detention at the facility). Father Flanagan exposes the conditions in the school and the boys are released to him. The Maitlands work to pay off the debts threatening Boys Town.","release_dates":"September 9, 1938 (1938-09-09)|||||","Box office":"According to MGM records the film earned $2,828,000 in the US and Canada and $1,230,000 elsewhere resulting in a profit of $2,112,000.[1]","produced_by":"John W. Considine Jr.","starring":"Spencer Tracy Mickey Rooney Henry Hull","running_time":"96 minutes","music_by":"Edward Ward","edited_by":"Elmo Veron","boys_town":"Theatrical release poster","written_by":"Dore Schary Eleanore Griffin John Meehan","budget":"$772,000[1]"}