{"country":"United States","distributed_by":"20th Century Fox","anastasia":"Theatrical release poster","Plot":"Ten years of turmoil have passed since the teenage Anastasia and her family (parents, sisters and brother) were presumed to have been killed by Bolshevik revolutionaries. Does the refugee Anna who has turned up in Paris have the bearing, speech, and intimate knowledge of the imperial family that the real grand duchess would have? Or is she merely a recovering amnesiac with a striking resemblance who has been cleverly groomed by the émigré General Bounine (Brynner) to stake a claim to 10 million pounds left by the Tsar in an English bank? In a series of encounters with former familiars and members of the imperial court, Anna begins to display a confidence and style that astonish her skeptical interlocutors, yet retains our sympathy by seeming more interested in recovering her own identity than the imperial bank account. In a climactic meeting with the Empress in Copenhagen, Anna and the Empress take the measure of each other, alternately projecting imperial self-possession and the anguish of family longing. Meanwhile, Bounine has become increasingly jealous of the attentions the fortune-hunting Prince Paul pays to Anna. At a grand ball at which her engagement to Paul is to be announced, the Empress has a private word with Anna/Anastasia, who subsequently elopes with Bounine.","Locations":"The film was shot in Copenhagen, London and Paris. The Alexander Nevsky Russian Orthodox Cathedral is featured in one of the first scenes.[3]","language":"English French","box_office":"$5 million (est. US/ Canada rentals)[2]","cinematography":"Jack Hildyard","directed_by":"Anatole Litvak","Production notes":"The movie was adapted by Guy Bolton and Arthur Laurents from the play by Bolton and Marcelle Maurette. The structure of the play can still be detected in the static settings and theatrical \"scenes\" of the cinematic version, which has additional, essentially decorative ball scenes.While the film does not reveal whether Anna really is the Romanov princess, a series of subtle hints throughout appear to suggest that she is. The gradual realisation of her true identity is juxtaposed with the romantic interest that develops within Bounine, who in one of his speeches declares to Anna/Anastasia that he cares for who she is and not what her name is.Hayes summons all her stage experience to deliver the celebrated last line, summing up the film's poignant exploration of identity and role-playing. Asked how she will explain the vanishing of her supposed granddaughter to a ballroom full of expectant guests, she declares, \"I will tell them that the play is over, go home!\" The film closes with the regal figure of the Dowager Empress on the arm of Prince Paul, descending the grand staircase.The film marked Bergman's return to Hollywood after several years working in Italy with her then-husband, Roberto Rossellini. Anastasia won her an Academy Award for Best Actress, the second of three Oscars she would receive. The musical score from the film was also nominated for an Academy Award for Original Music Score and was popular after the film's release.The film was also a comeback for Helen Hayes, as she had suspended her career for several years due to the death of her daughter Mary, and her husband's failing health.","release_dates":"December 13, 1956 (1956-12-13)|||||","produced_by":"Buddy Adler","starring":"Ingrid Bergman Yul Brynner Helen Hayes","running_time":"105 minutes","music_by":"Alfred Newman","edited_by":"Bert Bates","written_by":"Guy Bolton Arthur Laurents Marcelle Maurette (play)","budget":"$3,520,000[1]"}