{"bulletproof":"Theatrical release poster","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Joe Gayton|Lewis Colick|","story_by":"Joe Gayton","Plot":"Archie Moses (Adam Sandler) is a small time crook and a thief who lives in Los Angeles, and he is working for a local drug lord Frank Colton (James Caan). He is unaware that his best friend Rock Keats (Damon Wayans) is actually an LAPD undercover cop, with a real name being Jack Carter, who is seeking evidence against Colton, and he befriended Moses only to infiltrate Colton's gang members.One night, Jack goes out with Moses and gets him drunk, and manages to get info from Moses, and he finds an address for one of Colton's fronts. During a raid on Colton's warehouse, but Archie realizes that Jack is an LAPD cop, and he tries to escape the warehouse during the police raid, during which an out of control crane hits Moses in the back and he accidentally shoots Jack in the head. Jack miraculously survives and makes a full recovery with the aid of his physical therapist Dr. Traci Flynn (Kristen Wilson). Moses then flees the state, and is subsequently found and arrested later on. Moses is brought into custody, and he agrees to testify against Colton, but the trial is at the other side of the country. After Jack's recovery, his superior officer Will Jensen (James Farentino) orders him to get Moses to transfer him personally to the courtroom.Having been bitter about the accident, Carter harbors resentment against Moses, and problems escalate since a simple transfer has gone awry when Colton learns through bribed federal agents and Los Angeles Police Department officers of Moses's attempt to testify against Colton. Carter and Moses slowly mend their friendship and are successful in returning to their local police department. However, Colton apparently holds Flynn hostage, and blackmails Carter into turning Moses over in order to save Flynn. However, Carter and Moses pretend to comply with Colton and shoot their way through Colton's guards. It is later revealed that Flynn was responsible for leaking Carter's and Moses' whereabouts to Colton and was actually on Colton's payroll. Carter manages to distract Colton after Moses gets shot in the shoulder by Colton and after apprehending Flynn and Moses manages to kill Colton. However, Moses gives the incriminating documents on Colton to Carter, and he heads to Mexico, where he becomes a bullfighter, with Carter and Moses' mother later accompanying him.","language":"English","Reception":"Rotten Tomatoes gave a score of 8% based on reviews from 39 critics. Adam Sandler earned a Razzie Award nomination for Worst Actor for the film (also for Happy Gilmore).Ernest Dickerson said, \"There's a movie I did a couple years ago called Bulletproof. I'd like to just erase that whole experience. You know, I'm proud of a lot of the films I've done, but there's some situations that happened that in retrospect maybe I could have handled them a little differently if I had been a little smarter about it. But that's all second-guessing. Bulletproof was a case where we shot an R-rated film and the studio made us cut it to PG-13. So Bulletproof is a big sore point with me because it's the only time I've ever kicked a hole in an editing room wall. Because of the frustration of dealing with the studios and dealing with a producer who when the studio said 'Jump!' he said 'How high?' You make a movie with an R-rating, and then they tell you to cut it to PG-13. So it meant butchering performances, storylines, and really simplifying the film. The story is scripted by Lewis Colick, who is much deeper. It was about the responsibilities of friendship. The relationship that Damon Wayans had with Kristen Wilson was much stronger and all that was taken out. The movie was castrated.\"","box_office":"$22.6 million","cinematography":"Steven Bernstein","directed_by":"Ernest Dickerson","Soundtrack":"A soundtrack containing mostly hip hop and R&B music was released on September 3, 1996 by MCA Records. It reached #85 on the Billboard 200 and #23 on the Top R&B/Hip-Hop Albums.In addition, Varese Sarabande released an album of Elmer Bernstein's score.","release_dates":"September 6, 1996 (1996-09-06)|||||","Box office":"Bulletproof grossed $6,014,400 its opening weekend placing it at #1 at the box office.[2] By the end of its theatrical run, it pulled in $21,576,954 in North America, and $1,035,000 internationally for a worldwide total of $22,611,954, on a $25 million budget.[3]","produced_by":"Robert Simonds","starring":"Damon Wayans|Adam Sandler|James Farentino|James Caan|","running_time":"84 minutes","music_by":"Elmer Bernstein","edited_by":"George Folsey, Jr."}