{"country":"United States","Awards and nominations":"Saturn AwardsSaturn Awards[29]","distributed_by":"New World Pictures","screenplay_by":"John Sayles","story_by":"John Sayles Anne Dyer","Plot":"The farmers of the peaceful planet Akir are threatened by the space tyrant Sador (John Saxon) and his army of mutants, the Malmori. Sador's huge ship carries a weapon called a \"Stellar Converter\", which turns planets into small stars. He threatens to use the Converter unless the planet submits to him when he returns in several days. Zed (Jeff Corey), the last Akira warrior, is old and nearly blind. He suggests they hire mercenaries to protect the planet. Lacking valuable resources, they can only offer food and shelter in payment. Unable to go himself, Zed offers his ship for the job if they can find a pilot. The ship is fast and well-armed, but despite its AI navigation and tactical computer, Nell, cannot defeat Sador alone. Shad (Richard Thomas), a young man who has piloted the ship and is well known to Nell, volunteers for the recruiting mission.Shad's first stop is the Hephaestus space station, which repairs androids. Expecting to find weapons, Shad instead finds only two humans among the androids: Doctor Hephaestus (Sam Jaffe), kept on life support, and his beautiful daughter Nanelia (Darlanne Fluegel). The doctor attempts to force Shad to mate with his daughter. Shad doesn't want to abandon his people, and escapes, with Nanelia following in her own ship. Although she has no weapons, her highly advanced computer systems might be useful. The two split up to look for more mercenaries.Shad comes across Space Cowboy (George Peppard), a spacegoing truck driver from Earth. Shad learns that Cowboy is late delivering a shipment of laser guns to a planet which, as they watch, Sador destroys with his weapon. Lacking the fuel to carry the weapons home, Cowboy offers to deliver them to Akir. Shad talks him into teaching the Akira to use the guns. Later, Shad meets a set of five alien clones who share a group consciousness named Nestor. They admit their life is incredibly dull, since their whole race shares one mind. In order to be entertained, they have sent five members to join Shad's cause. Nestor does not require payment, saying they are completely self-sufficient. Next, Shad recruits Gelt (Robert Vaughn), a wealthy assassin who is so well known he can't show his face on any civilized planet. Gelt offers his services in trade for the ability to live peacefully hiding among the Akira. Gelt's spaceship is highly maneuverable and well armed. On his way back to Akir, Shad is approached by Saint Exmin (Sybil Danning), of the Valkyrie warriors. She is a headstrong woman looking to prove herself in battle. She pilots a small, barely armed, but extremely fast spaceship. Shad finds her annoying and wishes she would go away, but she tags along.While waiting for Shad's return, Nanelia is captured by a reptilian slaver named Cayman (Morgan Woodward). Cayman possesses a powerful old ship with an eclectic crew of aliens. She quickly recruits Cayman to their cause when he learns that they are looking for mercenaries to fight Sador. The only payment Cayman wants is Sador's head, since Sador's forces had destroyed Cayman's homeworld.The fleet of seven ships return to Akir. Shad takes the mercenaries down to the surface, but they are greeted with caution by the natives, who are not used to violent species. Eventually, Sador returns, but his fleet of fighters is intercepted by Shad and his new friends. In the opening battle, Gelt skillfully destroys several of Sador's ships but is mortally wounded when his ship crashes. Meanwhile, Cowboy and the Akiran natives, armed with his laser guns, fight off Sador's invading ground forces.Sador survives an assassination attempt by one of the captured Nestors and launches all of his ships in retaliation against the planet. The Akira ground troops, led by Cowboy, defeat Sador's army, but Zed is killed in the fighting. There is another huge space battle and the mercenaries' ships are destroyed one by one. However, the mercenaries are successful in destroying all of Sador's star fighters and the Stellar Converter, leaving only Sador's flagship. Shad and Nanelia, piloting Nell, are captured by the flagship in a tractor beam. The pair escape in a lifepod after Shad orders Nell to activate the ship's self-destruct program. Sador's ship is destroyed in the explosion. As Shad and Nanelia return to Akir, Nanelia despairs over the deaths of their friends. Shad tells her that the Akira believe that no one is truly dead when they are remembered and beloved by the living. The Akira will remember the sacrifices made by the mercenaries and honor them forever.","language":"English","Reception":"Battle Beyond the Stars grossed $1.7 million in its opening weekend,[25] and reportedly earned $11 million fairly quickly.[26]It received mixed reviews. Review aggregation website Rotten Tomatoes retrospectively gave the film a score of 45% based on reviews collected from 11 critics.[27]","box_office":"$7.5 million[2]","Battle Amongst the Stars":"A prequel comic book, set 30 years before the BBTS film, was launched by Bluewater Productions in March 2010.[30] It is a four-part miniseries that tells the story of how Zed, the old man played by Jeff Corey in BBTS, began his adventures from the planet Akir with Nell. It also has the character of Dr. Hephaestus and Sador of the Malmori. Only three issues appeared, the fourth was never released.","cinematography":"Daniel Lacambre","directed_by":"Jimmy T. Murakami","release_dates":"September 8, 1980 (1980-09-08)|||||","Production":"Prior to production, a Hollywood trade paper[who?] announced that John Wayne would star in the film, under the direction of Ingmar Bergman. In all likelihood, this was a joke, either by the trade paper or the film's publicist.[citation needed]At one stage Australian Richard Franklin was announced as director.[7]The planet Akir and its inhabitants, the Akira, a peaceful alien race at the center of the battle, were named in honor of director Akira Kurosawa.[8]At the time of its release, it was the most expensive film produced by Roger Corman.[9] Much of the budget allegedly went toward paying the salaries of George Peppard and Robert Vaughn,[citation needed], since screenwriter John Sayles was known for low-budget productions,[10] and the film was produced in Corman's own studio, his \"renowned lumberyard facility\" in Venice, California.[11] Corman recouped his costs upon selling the foreign distribution to Orion Pictures for $2.5 million. He also resold cable rights to HBO for $750,000.[12]Roger Corman hired James Cameron as a model maker in his studio, and after the original art director for the film had been fired, Cameron became responsible for the special effects in Battle Beyond the Stars, or, as Cameron later put it, \"production design and art direction.\"[13] This was Cameron's first \"big break\" in the entertainment industry, and it helped propel his career.[14] He was recommended by Gale Anne Hurd who was then working for Corman.[15]While Cameron initially worked on camera rigging, he soon started working on special effects, and designed spaceship's corridors, for instance, out of spray-painted McDonald's containers.[16] Cameron paid great attention to detail, and hardly slept for weeks while working on the film; his hard work paid off, opening the door for his later success.[17]The production sound mixer, also responsible for special effects, such as Robert Vaughn's \"laser shot\" – based on Clint Eastwood's .44 Magnum from Dirty Harry[18] – was David Yewdall, a regular contract-worker for Corman films.[19] Yewdall later remarked on the \"film's frugal sound editorial budget\" in his Practical Art of Motion Picture Sound, and explained some of the movie's sounds: each of the seven spaceships had its own sound. The Nestor ship's sound was made from human voices generated by the community choir from his hometown college in Coalinga, California; Robert Vaughn's ship was based on the recording of a dragster.[20]The spaceship used in the film was reused for another science fiction film blasted by critics, the Roger Corman film Space Raiders,[21] and in the ultra-low budget Starquest II and Dead Space. Footage was also used in later films and games: a clip from the film (in 3-D) is shown during the movie theater fight scene at the end of Bachelor Party,[22] and footage was also used for the Laserdisc game Astron Belt.[23] The soundtrack was later recycled by Corman for Raptor and other films.[24]","produced_by":"Ed Carlin Roger Corman","starring":"Richard Thomas|Robert Vaughn|George Peppard|John Saxon|Sybil Danning|Darlanne Fluegel|","running_time":"105 minutes","battle_beyond_the_stars":"Theatrical poster by Gary Meyer","music_by":"James Horner","edited_by":"Allan Holzman Robert J. Kizer","budget":"$2,000,000 (estimated)[1]"}