{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Deuce Bigalow, an insecure fishtank cleaner (aquarist), is fired for cleaning the tank at a public aquarium in the nude. Deuce is unsuccessful in attracting women, so he attempts to keep himself busy at work. On a house call, he meets an Argentinean male prostitute Antoine Laconte. Antoine is going on a business trip, and so asks Deuce to care for his lionfish and protect his home while he is away. Deuce accidentally sets Antoine's kitchen on fire when trying to make a grilled cheese sandwich in the toaster, and breaks an expensive fish tank.Fearing Antoine will kill him, Deuce is forced to find a way to pay for the damage. Low-rent pimp T.J. Hicks offers to help Deuce make enough money to buy a new fish tank, and convinces Deuce to take over the absent Antoine's role as a gigolo. Deuce decides to make the clients feel better about themselves, since he only desires to have sex with beautiful women.Deuce meets unusual clients but he still manages to get along with them, despite there being no sex involved, by helping them with certain issues in their lives. These clients include:Deuce's list of clients gradually increases, with each client being satisfied by much more fulfilling measures (such as the aforementioned tall woman heard groaning with pleasure while Deuce is giving her a foot massage, exclaiming that no one had ever touched her feet before) due to Deuce's evasion of sex with them. However, Deuce falls in love with one of his clients, Kate (Arija Bareikis), who has a prosthetic leg. She later breaks up with Deuce when she finds out that he was a prostitute hired by her friends.Meanwhile, Deuce is being stalked by Detective Chuck Fowler, who demands Antoine's \"black book\" of clients and threatens to take Deuce to jail if he does not comply. Deuce eventually helps Fowler please his wife by stripping and erotically dancing for her, and the two make amends. Deuce is still taken into custody on prostitution charges, as Fowler needs someone to bring in and Deuce's own refusal to betray his newfound friend, T.J. (whom Fowler described as another person of interest aside Deuce due to his previous acquaintance with Antoine), by turning him in. At the hearing, it is revealed that Deuce never slept with any of the clients except for Kate. Since Deuce gave back the money to Kate and was not paid for sex with her, he is cleared of all charges.Using the money he made, Deuce restores Antoine's fish tank, although due to time constraints he is warned that the glass may not be installed properly. Unfortunately, one of Deuce's friends accidentally kills the prize fish in Antoine's aquarium. Deuce buys a replacement fish and returns to Antoine's house just in time. Antoine is suspicious, but cannot figure out why. He taps the new aquarium and the glass shatters. Deuce then reveals his prostituting adventures to the bemused and furious Antoine. Enraged, Antoine tries to kill Deuce, and at one point shoots an arrow at him. The aforementioned overweight client, Fluisa, shows up, comes between the two men, and saves Deuce's life (she is not killed because the arrow hits her breasts, between which she has hidden a roast chicken). Antoine is then arrested by Detective Fowler, and Deuce marries Kate. The end sequences continues to follow the epilogue, Deuce's father becomes a male prostitute, Fluisa underwent extensive liposuction and is now working as a model in Victoria's Secret known as Naomi, Ruth opens up an all girls school for Tourette's, Carol manages to fulfill her dream trip to France, T.J. starts his own reality show dedicated to his experiences as a male prostitute and an incarcerated Antoine marries Tina.","deuce_bigalow:_male_gigolo":"Theatrical release poster","language":"English","box_office":"$92.9 million[2]","cinematography":"Peter Lyons Collister","production_company":"Touchstone Pictures Happy Madison Out of the Blue... Entertainment","directed_by":"Mike Mitchell","release_dates":"December 10, 1999 (1999-12-10)|||||","Production":"Deuce Bigalow: Male Gigolo is the first film released by the Happy Madison Productions film production company. Adam Sandler served as the film's executive producer. Sandler also shouted the insults \"Freak!\" and other offscreen lines.","produced_by":"Barry Bernandi|Sid Ganis|","starring":"Rob Schneider|William Forsythe|Eddie Griffin|Arija Bareikis|","running_time":"88 minutes[1]","Sequel":"In 2005, a sequel, Deuce Bigalow: European Gigolo, was released by Columbia Pictures instead of Touchstone Pictures. The film received even worse reviews than its predecessor and was a box office bomb.","music_by":"Teddy Castellucci","edited_by":"George Bowers|Lawrence Jordan|","Release":"Deuce Bigalow: Male Gigolo opened theatrically on December 10, 1999 in 2,154 venues and earned $12,224,016 in its opening weekend, ranking third in the North American box office behind Toy Story 2's fourth weekend and fellow newcomer The Green Mile.[3] The film ended its run, having grossed $65,538,755 in the United States and Canada, and $27,400,000 overseas for a worldwide total of $92,938,755. Based on a $17 million budget, the film was a box office success.[2]The film received negative reviews from critics. On review aggregator website Rotten Tomatoes, it holds a 23% score based on 75 reviews, with an average rating of 4/10. The site's consensus states: \"According to critics, Deuce Bigalow is just too dumb and filled with old, tired gags.\"[4] Metacritic reports a 30 out of 100 rating based on 26 critics, indicating \"generally unfavorable reviews\".[5]Roger Ebert of the Chicago Sun-Times gave the film one-and-a-half out of four stars, stating \"It's the kind of picture those View n' Brew theaters were made for, as long as you don't View.\"[6] Kendall Morgan from The Dallas Morning News writes in her review, \"Deuce Bigalow: Male Gigolo makes There's Something About Mary look like Masterpiece Theatre.\"[4]","written_by":"Harris Goldberg|Rob Schneider|","budget":"$17 million[2]"}