{"based_on":"Bewitched  by Sol Saks","country":"United States","distributed_by":"Columbia Pictures","Plot":"Jack Wyatt is a narcissistic actor who is approached to play the role of Darrin in a remake of the 1960s sitcom Bewitched, but insists that an unknown play Samantha. Isabel Bigelow is an actual witch who decides she wants to be normal and moves to Los Angeles to start a new life and becomes friends with her neighbor Maria. She goes to a bookstore to learn how to get a job after seeing an advertisement of Ed McMahon on TV. Jack happens to be at the same bookstore after attending some failed Samantha auditions. Jack spots Isabel and persuades her to audition. At the same time, while she's trying to settle into her new life, Isabel's intrusive father Nigel keeps appearing to convince her to return home, despite several rejections from Isabel.After Isabel impresses the show's producers and writers, Jack finally convinces Isabel to join the show. Also joining the show is legendary actress Iris Smythson as Endora. After a successful taping of the pilot, Isabel happens to overhear a conversation Jack is having with his agent Ritchie. They are talking about how they tricked Isabel to appear without having any lines. Furious, Isabel storms off with Maria and new friend Nina close behind. She decides she only has three choices: quit, get mad, or live with it. Instead, Isabel's Aunt Clara visits and aids Isabel in casting a spell on Jack in order to make him fall in love with her. At the same time, Nigel is introduced to Iris and becomes infatuated with her.The hex works and Jack becomes love struck by Isabel, insisting on several script changes to give her some dialogue and jokes, ignoring statements from test groups preferring Isabel over him. Jack's affection for Isabel grows and he asks her out on a date, making Isabel forget about the hex. But when he brings her home, she remembers and reverses it back to when she and Aunt Clara cast it. The next day, rather than the events the hex presented, Jack is outraged by the scores he received and takes his anger out on Isabel, who lashes back at him. Ritchie fires her, and she storms off. Rather than be angry at her, Jack is fascinated with Isabel and chases after her, taking all her comments into thought. So, after another great taping (with Isabel getting dialogue), a romance blossoms between the two. But the next day, Jack's ex-wife Sheila arrives, determined to woo Jack back. Isabel sees this and casts a spell on her making her sign the divorce papers and have her decide to move to Iceland. Jack, thrilled, announces he will be throwing a party at his house celebrating the divorce.Nigel attends the party with Iris and when Nigel begins flirting with much younger guests, Iris reveals that she is also a witch and casts a spell on each girl. When Jack makes a toast stating truth will be revealed with everyone, Isabel decides to tell Jack she's a witch. At first thinking she's simply an amateur magician, Jack officially believes her when she levitates him with her broom. Jack becomes frightened and shoos her away with a stick. Offended, Isabel flies off.Jack takes this hard, being brought to the studios by the police and becoming disenchanted with the project. Isabel decides to return home as she no longer wishes to stay. Jack, imagining himself on the Conan O'Brien Show, is visited by Uncle Arthur. Arthur convinces Jack not to let Isabel leave, because Jack still loves her and wouldn't be able to return for 100 years (which is later proven to be a lie Arthur made up to inspire Jack). Arthur drives him to the studio where he finds Isabel at the set. Jack apologizes to her and tells her he wants to marry her. They do and move into their new neighborhood (which resembles the neighborhood in the series).","language":"English","Reception":"Bewitched received negative reviews from critics, and by many of the original show's fanbase. Budgeted at $85 million, the worldwide gross of $131,413,159 was considered disappointing. Rotten Tomatoes reported that 25% of critics gave the film a positive review, based upon 185 reviews, with the website's statement, \"Bewitched is haunted by scattered laughs and a lack of direction\".[3] The total US gross was $63,313,159, with international at $68,100,000.The film earned Nicole Kidman and Will Ferrell a Golden Raspberry Award for Worst Screen Couple. The film was also nominated for Worst Director, Worst Actor (Will Ferrell), Worst Screenplay, and Worst Remake or Sequel. The New York Times called the film \"an unmitigated disaster\".[4] Australian critics Margaret Pomeranz and David Stratton gave the film three and half stars out of five stars; both Margaret and David said that Kidman captured the character exactly right.[5]","box_office":"$131.4 million[2]","bewitched":"Theatrical release poster","cinematography":"John Lindley","production_company":"Red Wagon Entertainment","directed_by":"Nora Ephron","Home media":"The DVD was released on October 25, 2005 by Sony Pictures Home Entertainment. It included deleted scenes such as Jack and Isabel's wedding and an extended version of Isabel getting mad, several making-of featurettes, a trivia game, and an audio commentary by the director.","release_dates":"June 24, 2005 (2005-06-24)|||||","Production":"Principal photography took place in late 2004 and early 2005.","produced_by":"Nora Ephron|Douglas Wick|Penny Marshall|","starring":"Nicole Kidman|Will Ferrell|Shirley MacLaine|Michael Caine|Jason Schwartzman|Kristin Chenoweth|David Alan Grier|Heather Burns|Stephen Colbert|","running_time":"102 minutes[1]","music_by":"George Fenton","edited_by":"Tia Nolan","written_by":"Nora Ephron|Delia Ephron|Adam McKay|","budget":"$85 million[2]"}