{"country":"United States|Russia|","distributed_by":"Lionsgate|After Dark Films|Freestyle Releasing[1]|","screenplay_by":"Larry Cohen|Joseph Tura|","story_by":"Larry Cohen","Alternative ending":"In an alternative ending, present on the DVD, one year later, a man is captured and tortured, before being killed with a hammer (this is the event we see at the beginning of the movie). The man is revealed (through press clippings) to be a three-time murderer of women; his assailant is revealed to be Jennifer.","Plot":"A young man is being tortured. Two tubes are inserted into his nose, and truck battery acid is pumped in through one pipe, causing blood to pour out through the other. The man's captor then kills him with a large hammer.Jennifer Tree (Elisha Cuthbert), a young fashion model and cover girl, had captured the attention of photographers and for better or worse, the public at large. On an evening out alone, Jennifer is stalked and drugged. She wakes in a stupor to find herself captive and confined to a cell. A series of metal bins and numbered lockers abruptly swing open in front of her. They contain personal items taken from her apartment. She is forced to view videotapes containing images of the victims who were tortured previous to her captivity, as well as videotaped interviews she had given to the media in the past. Realizing there is no way out, Jennifer pleads and screams to anyone who might hear her.During her confinement, she is subjected to various forms of psychological torture. Jennifer eventually finds she is not alone. A young man, Gary (Daniel Gillies), is being held captive in an adjoining cell. The two make contact and try to find out why they are being held. After watching the horrific scene, they find their way out. They both make it to a garage where they find a car. As soon as they are about to start it, a gas erupts in the car making them both unconscious. They find themselves back in their cells where Jennifer sees a tape of Gary being taken and tied to a chair with a gun held under his chin. After a while of Jennifer worrying, she sees Gary being thrown into his cell. She rushes to him and helps him. After having consensual sex, Gary awakens to find Jennifer, who has been drugged once again. He takes out a key to an adjoining cell.After Gary awakens he discovers Jennifer had drunk a bottle of water that had a drug in it to put her to sleep. He then gets up to wipe the blood off his nose, while he's leaving he makes sure Jennifer is sound asleep before leaving the cell. Gary's key opens a door into a house, revealing that Gary and his older brother Ben are actually the captors. Gary joins Ben in the kitchen where they make sushi. Gary tells Ben that he is falling in love with Jennifer. Ben then puts something in the fridge. When he turns around, Gary stabs him. Gary then watches the same tape of the woman lying on the bed that was shown earlier. The boy stabbing his mother is revealed to have been Gary looking at a smirking Ben. After the tape, Gary is seen reviewing a series of pictures in an album, and then there is a knock at the door. At the sound of knocks, he rushes to put the albums in a cabinet.He slams the cabinet's door, but it does not fully close. The knockers at the door are two detectives looking for Ben. Gary tells them that his brother is not at home. The detectives enter the house, get comfortable, and ask to watch a big sports game on television. One of them flips the channel to the surveillance video of Jennifer sleeping. Seeing this, Gary shoots them both. He runs down to where Jennifer is being held and tells her that he has killed them and that it is time to go. He places Jennifer in a room and tells her not to go. One of the detectives, not dead after all, jumps out at her but she kills him with a bat, believing him to be one of her captors. Jennifer then discovers the partially open cabinet and begins viewing the albums. Gary is in all of them. While she looks through the albums, Ben, also not yet dead, jumps out at her. However, Jennifer finishes him off by stabbing the knife more deeply into him.After viewing the albums, Jennifer hears the detective's pager ring and she goes through his personal belongings. Gary records Jennifer, who claims she belongs to him and will help him clean up the mess. She tricks him and sprays ammonia in his eyes before running off. On her way, she cuts a series of wires and electrical cords, which prevents doors, code entries and lights from working. Jennifer picks up a flashlight and the gun used on the detectives. She points the flashlight at the opposite wall through a poster of her, distracting Gary. Jennifer then goes through the door and points the gun at Gary. Gary then tries to persuade her to put the gun down. When its clear she won't, he lunges toward her with a pocket knife and she shoots him. Gary falls back and tries to lunge again but she shoots him a second time and he falls back on the bed. Gary whispers to her while gasping for air. Jennifer shoots at her poster which covered a window leading outside. She drops the gun and walks outside then down the street.","language":"English Russian","captivity":"Theatrical release poster","box_office":"$10.9 million","cinematography":"Daniel C. Pearl","production_company":"Foresight Unlimited Russian American Movie Company","directed_by":"Roland Joffé","DVD":"The DVD was released on 30 October 2007 with a widescreen unrated version and the original R-rated version. It includes a making-of featurette and an on-the-set look of the film.[16] There was also a special two-disc edition, which had a metal keep case with fine sand on the front cover beneath a plastic layer depicting Cuthbert in relief print beneath it, just as in a scene from the film.","Dramatic editing":"After Dark Films founder and present head Courtney Solomon went back to edit the original concept of Captivity to add more gore and violence to please the American audience. In a statement, Solomon is believed to state that he felt the film was not gruesome enough for a mainstream \"torture porn\".[5] Although he felt the change would bring in more money for the film after noticing the success of Hostel, the film performed poorly at the box office. Solomon later released a statement saying, \"It's overkill, I think audiences have said, 'I've had enough.' It's as simple as that.\"[6] The original version of Captivity was only released in Spain, Argentina and the United Kingdom.","Advertising controversy":"Several controversial images depicting promotional scenes from the film were released by After Dark Films in Los Angeles and New York where they were shown on billboards and taxicabs. The advertisement consisted of pictures involving the kidnapping, torture, and presumable murder of a female character. Offended witnesses soon filed complaints to After Dark, who claimed error and explained that the concept was only one of several working ideas that were being considered for marketing to the general public. According to executive producer Courtney Solomon, who spoke on behalf of After Dark, it was not supposed to have been approved; he followed by saying \"To be honest with you, I don't know where the confusion happened and who's responsible.\"[2]\"This film was done in association with After Dark Films. The nature of the association allows After Dark autonomy over their marketing materials, and therefore we neither saw nor approved this billboard before it was posted,\" said Peter Wilkes, head of Lionsgate investor relations. \"Once aware of the materials and the reaction to them, we immediately asked After Dark to remove the billboards, to which they immediately and cooperatively responded.\"Joss Whedon has become the public face of a movement directed at the MPAA to remove the film's rating, in accordance with MPAA guidelines that state that any film that uses advertising that has not been approved by the MPAA (in this case, the advertising was specifically disapproved) will possibly forfeit their right to be rated. According to writer Jill Soloway, who runs the website Remove the Rating, Solomon himself was responsible for the ads in question, going over the design in extreme detail, and is thus being disingenuous in the above-cited quote.[3] The MPAA issued a ruling dated 28 March 2007, which said that, as punishment, it would not consider rating the film until at least 30 April, making the release date of 18 May less likely (releasing the film \"unrated\" would greatly impact its potential to sell tickets). The MPAA is also, in an unprecedented move, requiring that they approve the placement of all forthcoming advertisements for the film.[4]","release_dates":"13 July 2007 (2007-07-13)|||||","produced_by":"Mark Damon|Gary Mehlman|Sergei Konov|Leonid Minkovski|","starring":"Elisha Cuthbert|Daniel Gillies|Pruitt Taylor Vince|","running_time":"96 minutes","music_by":"Marco Beltrami","edited_by":"Richard Nord","Release":"Captivity opened on Friday, 13 July 2007. The film holds a 9% approval rating on Rotten Tomatoes based on 77 reviews. The site's consensus reads: \"Lacking scares or psychological insight, Captivity is a distasteful entry in the 'torture porn' subgenre.\"[7] Online critic James Berardinelli gave it a zero star rating, stating that there is \"nothing redeemable here. It's not tense or scary; it's just demented\".[8] Bloody-Disgusting.com named the film as the \"worst horror film of 2007\".[9] Joe Leydon of Variety wrote that it will likely be remembered more for the billboard controversy than its plot, but it still generates \"modest suspense after a predictable but effective plot twist\".[10]Mark Kermode described the film as a 'Grotty, nasty, sleazy, infantile piece of dung' [11]Elisha Cuthbert's performance was nominated for both a Teen Choice Award[12] and a Razzie Award for Worst Actress. It also earned Razzie nominations for Worst Director and Worst Excuse for a Horror Movie[13] but lost both to I Know Who Killed Me.The film grossed $1,429,100 in its opening weekend, placing it at No. 12 at the US box office.[14] By the end of its run, the film had grossed $10,921,200.[15]"}