{"country":"United Kingdom","distributed_by":"Sony","Critical response":"The film received mixed reviews. On Rotten Tomatoes it has a 48% rating from 23 reviews counted.[4] Mark Adams from The Sunday Mirror described this film as \"A nicely gory comedy-horror flick that is a diverting bit of lads' entertainment.\" Other reviewers disagreed. Jason Solomans OF The Observer called it \"A dim zombie movie.\" Catherine Shoard of The Guardian wrote \"... undeniable misogyny and a definite creative bankruptcy. So is it fun enough to compensate? Just about\" and gave it a rating of 2 stars out of five.[5][6][7]Michael Dwyer of The Irish Times gave it only 1 out of 5 stars.[8] Critics noted the film's release closely followed after Lesbian Vampire Killers, another 2009 British comedy horror film,[8] and complained that ideas were borrowed from Shaun of the Dead.","Plot":"Vince (Stephen Graham) is depressed over his recent divorce. Six of his friends—Neil (Danny Dyer), Mikey (Noel Clarke), Graham (Emil Marwa), Matt (Lee Ingleby), Patrick (Keith-Lee Castle) and Banksy (Neil Maskell), all of whom have their own women problems—decide to take him on a \"boy's weekend\". They hire a minibus driven by Candy (Christina Cole) to Moodley, a village where the women allegedly outnumber the men 4 to 1. Banksy misses the bus and travels to the town on his own.Arriving at the town, the boys find it quiet and surprisingly devoid of women. On the way back to the minibus, the men notice a hooded teenage girl (Alison Carroll) being attacked by a man in military uniform. They rush to her aid and in the confusion of the moment, the hooded teen takes the soldier's knife and stabs Neil. They run for the bus dragging the unconscious soldier with them but discover that Candy, their once-hot bus driver has already become infected. More infected women appear and begin to attack them as they retreat to a house owned by Mikey's grandmother. The soldier (Terry Stone) admits that the town has been infected by a biological agent that turns women into cannibals.The men make another attempt to get on the bus, using the wounded Neil to lure Candy away. However two other infected women had joined her and chase the men back into the streets. They scatter about the village, hiding in a toy store, a clothes shop, and the butcher shop. Patrick gets trapped on a billboard. Neil runs into a house but is taken hostage by a morbidly obese woman who cuts off his little finger and eats it. Neil eventually escapes and is joined by the others, after their own misadventures, in the local church. There they discover a military command center. Matt powers up the computers and they talk briefly to a local politician, Meg Nut (Mary Tamm). She had been involved in the distribution of the toxin disguised as biological washing powder. The soldier finds a control box and explains it is a sonar device designed to emit a high pitched sound that will stun the zombified women once they have evolved further into \"Phase 2\" monsters that are faster, more intelligent and weirder. The women so change but when the soldier uses the sonar device it is revealed to have stopped working. He is then killed by Mikey's grandmother, before Matt bludgeons the monster-nan to death with a golf club. Traumatized by what he has done, Matt walks off to 'cool it off' and is killed by a \"Phase 2\" monster which had appeared from the basement of the Church. After finding a nest with women feasting on the bodies of men in the basement, the men barricade themselves on the roof of the church as more blood crazed women break in.Banksy eventually arrives at Moodley. Although at first he believes his friends to be high on drugs, he soon recognizes the seriousness of the situation and fetches a ladder to get them off the roof. Graham is then attacked by the morbidly obese woman. Banksy leads the surviving group to his vehicle—a small Smart car, however it is not big enough for all of them. As they all argue Patrick is attacked and dies a bloody death. Everyone else heads to the minibus, where Banksy is killed as Vince fights off Candy. Vince blasts Neil and Mikey, who treat their women badly but get away with it, while nice men like him and their dead friends treat women with respect, only to be rejected or killed. He resolves to be more like them. Before they can drive away, the voice of the still-alive Graham crackles over the walkie-talkie. As he makes his way out from the church Graham powers up the stun-device using a high-voltage power supply. With it now working, the men are able to stop the women in their tracks; however, Vince inadvertently drops and breaks it. The infected are once again unleashed and, with the injured Graham in a shopping trolley, the four make a run for it, laughing.","language":"English","directed_by":"Jake West","release_dates":"12 June 2009 (2009-06-12)[1]|||||","Production":"The film was written by Dan Schaffer, directed by Jake West.[3]","produced_by":"Michael Loveday Terry Stone","starring":"Noel Clarke Stephen Graham Danny Dyer","running_time":"89 minutes","doghouse":"Doghouse Theatrical Poster","Release":"The film was released in the United Kingdom on 12 June 2009 and was released in the U.S. as a video on demand production.[9]","written_by":"Dan Schaffer"}