{"country":"United States","distributed_by":"Samuel Goldwyn Films Uncommon Productions","Plot":"Set in the midst of the 2000 presidential election, American Violet tells the story of a young mother named Dee Roberts (Nicole Beharie), a 24-year-old African-American single mother of four living in the town of Melody (based on Hearne, Texas, where the real incident took place). One day, while Dee is working a shift at the local diner, the powerful local district attorney (Michael O'Keefe) leads a group into the restaurant, sweeping Dee’s housing project. Police drag Dee from work in handcuffs and dump her in the women’s county prison. Indicted based on the uncorroborated word of a single and dubious police informant facing his own drug charges, Dee soon discovers she has been charged as a drug dealer.Even though Dee has no prior drug record and no drugs were found on her in the raid or any subsequent searches, she is offered a hellish choice: plead guilty and go home as a convicted felon or remain in prison and fight the charges, thus jeopardizing her custody and risking a long prison sentence. Despite the urgings of her mother (Alfre Woodard), and with her freedom and the custody of her children at stake, she chooses to fight the district attorney. Dee works with an ACLU attorney (Tim Blake Nelson) and a former local narcotics officer (Will Patton) to take on the Texas justice system.[3]","language":"English","Critical reception":"Clay Kane said that American Violet is \"the first must-see film for African-Americans in 2009.\"[8] Dr. Joy Browne of WOR Radio reviewed the film, calling it \"A gem of a movie. Timely, thought-provoking, passionate, exciting. Everything you look for in a movie experience and more.\"[9] Rex Reed of The New York Observer said that the film is \"a rich, vibrant narrative film guaranteed to move everyone who sees it.\"[10] Roger Ebert gave the film three stars and commented that \"Nicole Beharie delivers a stunning performance.\"[11]","cinematography":"Steve Yedlin","production_company":"Cinema Management Group","directed_by":"Tim Disney","Accuracy":"The film stays fairly close to the details of the actual case, although it changes all the characters' names and takes some liberties with the case's transcripts and other dialogue. The progress of the case in the film proceeds as the real case did, including the reduction of bail for the defendant, the dropping of charges, and the eventual resolution of the case, although the film makes no mention of the financial portion of the settlement.[7] Some of the lawyers objected to the way they were portrayed.[7] In the film, the public defender urges the character named Dee Roberts to accept a plea bargain. The actual public defender claims he never tells innocent clients to take a plea.[7] Also, the actual lawyer who represented the District Attorney said the film was \"more accurate than not,\" but objected to how his behavior was portrayed in the film during the deposition of the chief plaintiff. In the film, the character questions the plaintiff about her sexual history. The actual lawyer claims the questions were routine questions about her children and their fathers, and did not delve any further into the subject.[7] Also, the film shows the DA presiding over a hearing about custody of the defendant's children. Actually, the DA was present and spoke at the hearing, but did not determine custody.[7] The revelation during the film's climax, which led to the resolution of the case, was presented accurately, including the race of the deposing lawyer and the identity of the video witnesses, but the DA did not use the word \"uppity\" to describe the African-American lawyer who was deposing him. And the actual legal team for the plaintiffs was much larger, consisting of about 25 lawyers, from a private law firm, working pro bono.[7]","Historical basis":"The film is based on the civil rights lawsuit Regina Kelly v. John Paschall, filed on behalf of 15 African-American residents of Hearne, Texas who were indicted in November 2000 on drug charges after being rounded up in a series of drug sweeps the ACLU referred to as \"paramilitary.\"[4] The lawsuit accused Paschall and the South Central Texas Narcotics Task Force of conducting racially motivated drug sweeps for more than 15 years in Hearne. In 2005, the ACLU and Robertson County settled and the plaintiffs agreed to dismiss the individuals named in the suit, including Paschall.[5] The fictional Harmon County represents Robertson County, Texas, where John Paschall was defeated for reelection in 2012.[6] Regina Kelly continued to live in Hearne until 2009.[5]","american_violet":"Theatrical release poster","release_dates":"August 29, 2008 (2008-08-29) (Telluride Film Festival)|April 17, 2009 (2009-04-17) (United States)||||","produced_by":"Bill Haney","starring":"Nicole Beharie Will Patton Michael O'Keefe Tim Blake Nelson Xzibit Charles S. Dutton Alfre Woodard","running_time":"103 minutes","edited_by":"Nancy Richardson","written_by":"Bill Haney"}