{"based_on":"Breakfast at Tiffany's  by Truman Capote","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"George Axelrod","Plot":"Early one morning, a taxi pulls up at Tiffany & Co. on Fifth Avenue in New York City, from which elegantly dressed Holly Golightly (Audrey Hepburn) emerges. After looking into the shop's windows, she strolls home. Outside her apartment, she fends off Sid Arbuck (Claude Stroud), her date from the disastrous night before. Later, she is awakened by new neighbor Paul Varjak (George Peppard), ringing her doorbell to get into the building. The pair chat as she dresses to leave for her weekly visit to Sally Tomato (Alan Reed), a mobster incarcerated at Sing Sing prison. Tomato's lawyer O'Shaughnessy pays her $100 a week to deliver \"the weather report.\"As she is leaving for Sing Sing, Holly is introduced to Paul's \"decorator\", wealthy older woman Emily Eustace Failenson (Patricia Neal), whom Paul nicknames \"2E\". That night, Holly goes out onto the fire escape to elude an over-eager date (Mel Blanc). She peeks into Paul's apartment and sees 2E leaving money and kissing Paul goodbye. After 2E leaves, Holly enters Paul's apartment and learns that he is a writer who has not had anything published since a book of vignettes five years before. Holly, in turn, explains that she is trying to save money to support her brother Fred when he gets out of the Army. The pair fall asleep, but are awakened when Holly has a nightmare about Fred. She later buys Paul a typewriter ribbon to apologize and invites him to a party at her apartment. There, Paul meets her Hollywood agent, O. J. Berman (Martin Balsam), who describes Holly's transformation from country girl into Manhattan socialite. He is also introduced to José da Silva Pereira (José Luis de Vilallonga), a wealthy Brazilian politician, and Rusty Trawler (Stanley Adams), the \"ninth richest man in America under 50.\"In the days that follow, Paul and Holly become closer. One day, 2E enters Paul's apartment, worried that she is being followed. Paul tells her that he will investigate and eventually confronts Doc Golightly (Buddy Ebsen), Holly's estranged husband. Doc explains that Holly's real name is Lula Mae Barnes. They married when she was 13, and he wants to take her back to Texas, as Fred will be returning. After Paul reunites Holly and Doc, she tells Paul the marriage was annulled. At the bus station, she tells Doc she is not going with him. Doc leaves broken-hearted.After drinking at a club, Paul and Holly return to her apartment, where she drunkenly tells him that she plans to marry Trawler for his money. A few days later, Paul learns that one of his short stories will be published. On the way to tell Holly, he sees a newspaper headline stating that Trawler has married someone else. Holly and Paul agree to spend the day together, taking turns doing things that each has never done before. At Tiffany's, Paul has the ring from Doc Golightly's box of Cracker Jack engraved as a present for Holly. After spending the night together, he awakens to find her gone. When 2E arrives, Paul ends their relationship. She calmly accepts, having earlier concluded that he and Holly are in love.Holly schemes to marry José for his money, which angers Paul. After Holly receives a telegram notifying her of Fred's death, she trashes her apartment. Months later, Paul has moved out. He is invited to dinner by Holly, who is leaving the next morning for Brazil to continue her relationship with José. However, they are arrested in connection with Sally Tomato's drug ring, and Holly spends the night in jail.The next morning, Holly is released on bail and finds Paul waiting. He has her cat and a letter from José explaining he must end their relationship due to her arrest. Holly insists she will go to Brazil anyway and releases the cat into the rain. Paul confronts Holly about his love and her behavior, then leaves, tossing the ring he had engraved for her into her lap and telling her to examine her life. She quickly runs after him, who has gone looking for the cat. Together they find him, look into each other's eyes, and kiss.","language":"English Portuguese","Reception":"Time magazine noted \"for the first half hour or so, Hollywood's Holly (Audrey Hepburn) is not much different from Capote's. She has kicked the weed and lost the illegitimate child she was having, but she is still jolly Holly, the child bride from Tulip, Texas, who at 15 runs away to Hollywood to find some of the finer things of life—like shoes.\" It pointed out that \"after that out-of-Capote beginning, Director Blake Edwards (High Time) goes on to an out-of-character end.\"[10] Almost a half century later, Time commented on the pivotal impact of Hepburn's portrayal of Golightly:[11]Breakfast at Tiffany's set Hepburn on her 60s Hollywood course. Holly Golightly, small-town Southern girl turned Manhattan trickster, was the naughty American cousin of Eliza Doolittle, Cockney flower girl turned My Fair Lady. Holly was also the prototype for the Hepburn women in Charade, Paris When It Sizzles, and How to Steal a Million: kooks in capers. And she prepared audiences for the ground-level anxieties that Hepburn characters endured in The Children's Hour, Two for the Road and Wait Until Dark.The New York Times called the film a \"completely unbelievable but wholly captivating flight into fancy composed of unequal dollops of comedy, romance, poignancy, funny colloquialisms and Manhattan's swankiest East Side areas captured in the loveliest of colors\"; in reviewing the performances, the newspaper said Holly Golightly is \"as implausible as ever. But in the person of Miss Hepburn, she is a genuinely charming, elfin waif who will be believed and adored when seen. George Peppard is casual and, for the most part, a subdued citizen who seems to like observing better than participating in the proceedings. Martin Balsam makes a properly brash, snappy Hollywood agent. Mickey Rooney's bucktoothed, myopic Japanese is broadly exotic. Patricia Neal is simply cool and brisk in her few appearances as Mr. Peppard's sponsor and Vilallonga, is properly suave and Continental as Miss Hepburn's Brazilian, while Buddy Ebsen has a brief poignant moment as Miss Hepburn's husband.\"[12]Truman Capote hated Hepburn in the lead part. Capote biographer Gerald Clarke, deemed the film a \"valentine\" to free-spirited women rather than a cautionary tale about a little girl lost in the big city. \"The movie is a confection — a sugar and spice confection.\"[13]Rotten Tomatoes currently holds an 88% 'Fresh' rating with the consensus: \"It contains some ugly anachronisms, but Blake Edwards is at his funniest in this iconic classic, and Audrey Hepburn absolutely lights up the screen.\"[14]Hepburn as Holly, with her hair in a high chignon and carrying an oversized cigarette holder, is considered one of the most iconic images of 20th century American cinema.[15] Another iconic item throughout the movie is Holly's sunglasses. Often misidentified as Ray-Ban, they are Manhattan sunglasses manufactured by Oliver Goldsmith. In 2011 the model was re-released to mark the 50th anniversary of Breakfast at Tiffany's.[16] One of three dresses designed by Givenchy for Hepburn for possible use in the film sold at auction by Christie's[17] on December 5, 2006 for £467,200 (~US$947,000), about seven times the reserve price.[18] The \"Little Black Dress\" by Givenchy, worn by Hepburn in the beginning of the film, is cited as one of the most iconic items of clothing in the history of the twentieth century and is, perhaps, the most famous little black dress of all time.[19][20][21][22] A second \"little black dress\" in Breakfast at Tiffany's, along with its wide-brimmed hat, was worn by Hepburn as Holly when she goes to visit mobster Sally Tomato at Sing Sing Prison. This dress was paid homage as one of the dresses worn by Anne Hathaway's character Selina Kyle, Catwoman's alter ego, in Christopher Nolan's The Dark Knight Rises; the comic book Catwoman character was originally drawn based on Hepburn, according to Catwoman comic cover artist Adam Hughes, creating a double homage to Hepburn's Holly Golightly in Hathaway's Catwoman.[23]The film rejuvenated the career of 1930s movie song-and-dance man and Disney Davy Crockett sidekick Buddy Ebsen, who had a small but effective role in this film as Doc Golightly, Holly's ex-husband. His success here led directly to his best-known role as Jed Clampett on The Beverly Hillbillies.[24]For his portrayal of I. Y. Yunioshi, Mickey Rooney wore makeup and a prosthetic mouthpiece to change his features to a caricatured approximation of a Japanese person. Since the 1990s, it has been subject to increasing protest by Asian-Americans among others. For instance, in the 1993 film, Dragon: The Bruce Lee Story, the film is used as an illustration of Hollywood's racist depiction of Asians when Bruce Lee and his future wife, Linda, see the film and Linda suggests they leave when she notices that Bruce is upset at Rooney's caricatured performance.In his audio commentary for the DVD release, producer Richard Shepherd said that at the time of production as well as in retrospect, he wanted to recast the role \"not because he [Rooney] didn't play the part well\" but because Shepherd thought the part of Mr. Yunioshi should be performed by an actor of Japanese ethnicity; it was director Blake Edwards' decision to keep Rooney.[25] In a \"making-of\" for the 45th anniversary edition DVD release, Shepherd repeatedly apologizes, saying, \"If we could just change Mickey Rooney, I'd be thrilled with the movie.\"[26] Director Blake Edwards stated, \"Looking back, I wish I had never done it... and I would give anything to be able to recast it, but it's there, and onward and upward.\"[26]In a 2008 interview about the film, 87-year-old Rooney said he was heartbroken about the criticism: \"Blake Edwards... wanted me to do it because he was a comedy director. They hired me to do this overboard, and we had fun doing it.... Never in all the more than 40 years after we made it – not one complaint. Every place I've gone in the world people say, 'God, you were so funny.' Asians and Chinese come up to me and say, 'Mickey you were out of this world.'\"[27] Rooney also said that if he'd known people would be so offended, \"I wouldn't have done it. Those that didn't like it, I forgive them and God bless America, God bless the universe, God bless Japanese, Chinese, Indians, all of them and let's have peace.\"[27]","box_office":"$14 million","cinematography":"Franz F. Planer Philip H. Lathrop (Uncredited)","production_company":"Jurow-Shepherd","directed_by":"Blake Edwards","Home media":"Breakfast at Tiffany's was one of the first Hepburn films to be released to the home video market in the early 1980s,[citation needed] and is also widely available on DVD. On February 7, 2006, Paramount released a 45th anniversary special edition DVD set in North America with featurettes not included on the prior DVD release:On January 13, 2009, a remastered Centennial Collection version of the film was released. In addition to the special features on the 45th anniversary edition, this version includes:In 2011 a newly remastered HD version of the film was released on Blu-ray with many of the features from the aforementioned DVDs. The digital restoration of the film was done by Paramount Pictures. The digital pictures were frame by frame digitally restored at Prasad Corporation to remove dirt, tears, scratches and other artifacts. The film was restored to its original look for its 50th Anniversary.[35][36]","Soundtrack":"The soundtrack featured a score composed and conducted by Henry Mancini, with songs by Mancini and lyricist Johnny Mercer. Mancini and Mercer won the 1961 Oscar for Best Original Song for \"Moon River\". Mancini won for Best Original Score. There are also unreleased score pieces from Breakfast at Tiffany's in existence; \"Carousel Cue\" is from an unsurfaced scene, while \"Outtake 1\" is from a deleted scene in which Holly and Fred visit Tiffany's and is a variation of the main theme.In 2013 Intrada released the complete score in its original film performance (as with many soundtrack albums by Mancini and others at the time, the album released alongside the film was a re-recording).","References":"Notes","release_dates":"October 5, 1961 (1961-10-05) (US)|||||","Production":"The Oscar-nominated screenplay was written by George Axelrod, loosely based on the novella by Truman Capote. Changes were made to fit the medium of cinema and to correspond to the filmmakers' vision.Capote, who sold the film rights of his novella to Paramount Studios, wanted Marilyn Monroe to play Holly Golightly, whom he had described perfectly in the book. Barry Paris cites Capote's own comments on the choice of actress: \"Marilyn was always my first choice to play the girl, Holly Golightly.\" Screenwriter Axelrod was hired to \"tailor the screenplay for Monroe\". When Lee Strasberg advised Monroe that playing a prostitute would be bad for her image, she turned it down and performed in The Misfits instead. When Hepburn was cast instead of Monroe, Capote remarked: \"Paramount double-crossed me in every way and cast Audrey\".[5]Originally producers Martin Jurow and Richard Shepherd had picked John Frankenheimer as the director,[citation needed] but Hepburn said: \"I've never heard of him\" and he was replaced on her request.Most of the exteriors were filmed in New York City, except the fire escape scenes and the alley scene at the end in the rain where Holly puts Cat out of the cab and then Paul and Holly look for Cat. All of the interiors, except for portions of the scene inside Tiffany & Company, were filmed on the Paramount Studios lot in Hollywood.[citation needed]It was rumored[citation needed] that the film's on-location opening sequence, in which Holly gazes into a Tiffany's display window, was extremely difficult for director Blake Edwards to shoot. Although it was simple in concept, crowd control, Hepburn's dislike of pastries, and an accident that nearly resulted in the electrocution of a crew member are all said to have made capturing the scene a challenge.[citation needed]In an interview given for the 45th anniversary DVD, Edwards said that the sequence was captured rather quickly due to the good fortune of an unexpected traffic lull despite the location in the heart of Manhattan.Hepburn introduced[clarification needed] the film's signature song, \"Moon River\" by Henry Mancini and Johnny Mercer. The song was tailored to Hepburn's limited vocal range, based on songs she had performed in 1957's Funny Face.[7] On the Anniversary Edition DVD of Breakfast at Tiffany's co-producer Richard Shepherd says in his audio commentary that after a preview in San Francisco, Martin Rankin, Paramount's head of production, wanted \"Moon River\" replaced with music by somebody like Gordon Jenkins (whose album Manhattan Tower had been out fairly recently): \"Marty [Jurow, co-producer] and I both said 'over our dead bodies.'\"[8] According to Mancini and Edwards, a studio executive hated the song and demanded it be cut from the film; Hepburn, who was present, responded to the suggestion by standing up and saying, \"Over my dead body!\"[9]According to Time magazine, Mancini \"sets off his melodies with a walking bass, extends them with choral and string variations, varies them with the brisk sounds of combo jazz. 'Moon River' is sobbed by a plaintive harmonica, repeated by strings, hummed and then sung by the chorus, finally resolved with the harmonica again.\"[6]","produced_by":"Martin Jurow Richard Shepherd","starring":"Audrey Hepburn George Peppard Patricia Neal Buddy Ebsen","running_time":"115 minutes","Stage adaptations":"In 1966, David Merrick produced a Broadway musical of the same name starring Mary Tyler Moore as Holly Golightly and Richard Chamberlain as Paul. The troubled production closed after four previews.In 2004, a new musical adaptation of the film made its world debut at The Muny in St. Louis.[37]In May 2009, actress Anna Friel confirmed that she would star in a West End adaptation of the film. The show opened in September 2009 at the Haymarket Theatre.[38]The name of the film was also used as the title for the 1996 hit record by Deep Blue Something, although the lyrics were in fact inspired by Roman Holiday.[citation needed]A new stage adaption made its debut in March 2013 at the Cort Theater in New York City. The role of Holly Golightly would be played by Game of Thrones star Emilia Clarke.[39]","music_by":"Henry Mancini","edited_by":"Howard Smith","budget":"$2.5 million"}