{"based_on":"Bringing Down the House  by Ben Mezrich","country":"United States","distributed_by":"Columbia Pictures","Plot":"Senior math major Ben Campbell (Jim Sturgess) of Massachusetts Institute of Technology (MIT) is accepted into Harvard Medical School, but cannot afford the $300,000 fee. Despite a 44 MCAT score and top grades, Ben faces fierce competition for the prestigious Robinson Scholarship that would pay for medical school in its entirety. The director tells him that the scholarship would go to the student who \"dazzles\" him. Ben did not have anything to dazzle the director then, so he walks away, trying to write an essay with nothing in mind to compose it.At MIT, professor Micky Rosa (Kevin Spacey) challenges Ben with the Monty Hall problem in one of his non-linear equation classes, which he solves successfully. Rosa looks at Fisher with a look of amusement and is impressed by Ben's non fluctuating decisions who clings onto his theories of 'variable change'. After looking at Ben's score on his latest non-linear equations paper, on which he got 97%, Rosa invites Ben to join his blackjack team, which consists of fellow students Choi, Fisher, Jill, and Kianna. Despite being told by Rosa that he had already gotten into the Harvard Medical School, Ben refuses to join the team on the premise he had been promoted at his job. Next day, Jill visits Ben at his job and attempts to coax him into joining the team. The system involves card counting, and the team is split into two groups. \"Spotters\" play the minimum bet and keep track of the count. They send secret signals to the \"big players\", who place large bets whenever the count at the table is favorable. Ben reluctantly joins the team, telling Rosa he is only doing so until he can pay for medical school.Rosa takes the team to Las Vegas over many weekends; Ben comes to enjoy his luxurious lifestyle as a \"big player\" there. His performance impresses Jill—who develops a mutual attraction with him—and Rosa. However, Fisher becomes jealous of Ben's blackjack success. Rosa kicks a drunken Fisher off the team after he insults Ben and incites a melee, requiring the team to scramble to cash in their stock of chips before the casino swaps out (a common practice after a fight). Meanwhile, security chief Cole Williams (Laurence Fishburne) monitors the blackjack team, having his eyes on Ben.Ben, distracted by blackjack, does not complete his part of a project for an engineering competition, estranging him from his pre-blackjack friends. During the next trip to Vegas, an emotionally distracted Ben continues playing even after he is signaled to walk away, thereby losing $200,000 dollars. Angered and upset, Rosa leaves the team and demands that Ben repay him for the loss. Ben and his three remaining teammates agree to go into business for themselves; Williams, however, kidnaps Ben, beats him up, then lets him go after a dire warning.Ben learns that he has been given an incomplete in one of his classes and, therefore, will not graduate, and that his winnings have been stolen from his dormitory room. He suspects that Rosa is behind the events but has no evidence. Ben reconciles with his friends and Jill, and approaches Rosa with an offer: he and the team will hit Vegas for one more attempt before the casinos install biometric software that will quickly identify card counters, as long as Rosa, once a very successful \"big player\", also plays.Disguised, the team returns to Planet Hollywood and wins $640,000 before fleeing with their chips from Williams and his men. Ben and Rosa split up, with Rosa taking the bag of chips. Rosa escapes into a livery cab with the intention of stealing the winnings, but finds his bag is full of chocolate coins and that the casino manager is driving Rosa's cab.It is revealed that Williams had made a deal with Ben after beating him up: he would let Ben come to Vegas for one night to make a lot of money gambling in exchange for Rosa. Rosa had won a seven-figure sum at Williams's casino by counting cards, a feat that cost Williams a pit boss job. After capturing Rosa, Williams confronts Ben and demands at gunpoint the bag of chips for his retirement; after giving up the money, Ben rejoins his friends and pre-blackjack friends, who have, in fact, been counting all night themselves. The film closes with Ben recounting the entire tale to a \"dazzled\" Harvard director.","language":"English","Reception":"21 received mixed reviews from critics. Review aggregator Rotten Tomatoes reported that 36% of 165 critics gave the film a positive review, for an average rating of 5.2/10. The site's critical consensus reads that \"21 could have been a fascinating study had it not supplanted the true story on which it is based with mundane melodrama.\"[1] Metacritic reported the film had an average score of 48 out of 100, based on 29 reviews.[2]In its opening weekend, the film grossed $24,105,943 in 2,648 theaters in the United States and Canada, averaging $9,103 per venue and ranking first at the box office.[3] The film was also the number one film in its second weekend of release, losing 36% of its audience, grossing $15,337,418, expanding to 2,653 theaters, and averaging $5,781 per venue. The film dropped to third place in its third weekend, losing 32% of its audience, grossing $10,470,173, expanding to 2,736 theaters, and averaging $3,827 per venue. By the fourth weekend it fell to sixth place, losing 47% of its audience, grossing $5,520,362 expanding to 2,903 theaters, and averaging $1,902 per venue.By the end of its theatrical run, the film grossed a total of $157,802,470 worldwide — $81,159,365 in the United States and Canada and $76,643,105 in other territories, against a budget estimated at $35 million.[4]A race-based controversy arose over the decision to make the majority of the characters White Americans, even though the main players in the book Bringing Down the House, upon which the film 21 is based, were mainly Asian-Americans.[5] The role was given to London-born Jim Sturgess, who required a dialect coach to speak with an American accent.[6]Jeff Ma, who was the real-life inspiration for the character Ben Campbell and served as a consultant on the film, was attacked as being a \"race traitor\" on several blogs for not insisting that his character be Asian-American. In response, Ma said, \"I'm not sure they understand how little control I had in the movie-making process; I didn't get to cast it.\"[7] Ma said that the controversy was \"overblown\" and that the important aspect is that a talented actor would portray him.[8] Ma, who is Chinese American, told USA Today, \"I would have been a lot more insulted if they had chosen someone who was Japanese or Korean, just to have an Asian playing me.\"[9]Nick Rogers of The Enterprise wrote, \"The real-life students mostly were Asian-Americans, but 21 whitewashes its cast and disappointingly lumps its only Asian-American actors (Aaron Yoo and Liza Lapira) into one-note designations as the team's kleptomaniac and a slot-playing 'loser.'\"[10]The Media Action Network for Asian Americans (MANAA) reported on their web site: \"After the ‘white-washing’ issue was raised on Entertainment Weekly’s web site, [21] producer Dana Brunetti wrote: \"Believe me, I would have LOVED to cast Asians in the lead roles, but the truth is, we didn’t have access to any bankable Asian-American actors that we wanted.\"[11]In April 2008, Dave Stann, author of Hollywood Blackjack and a second-generation Mensa member who is, as NPR put it, \"someone with keen insight on the M.I.T. whiz kids — subject of the new movie 21\", excluded race from the equation, stating \"you actually need only a second-grade education to count cards.\"[12]","box_office":"$157,927,340","cinematography":"Russell Carpenter","production_company":"Relativity Media Trigger Street Productions","directed_by":"Robert Luketic","Home media":"21 was released on DVD and Blu-ray in Region 1 on July 22, 2008.[13]","Soundtrack":"The soundtrack was released at the same time as the film.[14]","release_dates":"March 28, 2008 (2008-03-28)|||||","Production":"The filming of 21 began in March 2007. Principal filming of the Las Vegas scenes took place at the Planet Hollywood Casino, the Red Rock Casino, and the Hard Rock Casino in Las Vegas. Filming also took place at Harvard Medical School, Chinatown, in Cambridge, and the Christian Science Center in Boston, Massachusetts. As MIT did not allow filming on campus, the MIT school and dorm interiors, the gymnasium, and the alumni reception were all shot at Boston University.","produced_by":"Kevin Spacey Brett Ratner Dana Brunetti Michael DeLuca","starring":"Jim Sturgess Kate Bosworth Laurence Fishburne Kevin Spacey Kieu Chinh","running_time":"123 minutes","Reaction from casinos":"In pre-production, the producers and the book's original writers predicted that the Vegas casinos would be unhelpful, as a film that told viewers the basics of card counting might hurt their bottom line. A featurette included with the DVD completely and accurately describes the \"Hi-Lo\" system used by the MIT Blackjack Club and by Rosa's team in the film.In fact, the writers were surprised when told by the producers that MGM Studios would finance the film, though all \"MGM\" casinos (including one used by the real MIT Blackjack Team) are owned by MGM Resorts International and are no longer related to MGM Studios. In reality, as another DVD featurette reveals, the casinos (including MGM Resorts) saw the film as an attention-getter; people who saw it would be encouraged to go to Vegas and play, attempting to count cards but failing to learn or memorize the entire strategy or making too many mistakes. The film withheld critical strategy details (such as the conversion from the \"running count\" to a \"true count\"), and most beginning card counters underestimate the number and value of the mistakes they make.","music_by":"David Sardy","edited_by":"Elliot Graham","21":"Promotional poster","written_by":"Peter Steinfeld Allan Loeb","budget":"$35 million"}