{"country":"Australia","distributed_by":"20th Century Fox (US)","Plot":"The film stars Wendy Hughes and Robyn Nevin as two sisters who are locked in a custody battle over their young nephew, PS, played by Nicholas Gledhill. PS has been raised by his aunt Lila (Nevin) and her husband George since his mother died soon after his birth. When Lila's richer sister Vanessa returns from overseas, she seeks custody of PS, citing the opportunities she can give him.","language":"English","box_office":"$2,431,126 (Australia)","production_company":"Syme International","directed_by":"Carl Schultz","Home media":"A Collector's Edition of Careful, He Might Hear You was released on DVD with a new print by Umbrella Entertainment in June 2008. The DVD is compatible with all regional codes and includes special features such as the film trailer, bonus trailers, a still photo gallery, an interview with Sumner Locke Elliot and interviews with stars Wendy Hughes, Nicholas Gledhill and Jill Robb.[3]A regular edition of the film with reduced special features was released on DVD by Umbrella Entertainment in October 2008.","release_dates":"1983 (1983)|||||","Production":"There had long been interest in making a film out of the novel. In the 1960s it was announced that Joshua Logan would direct a movie version starring Elizabeth Taylor but this did not eventuate. Film rights to the novel were bought by Jill Robb who hired Mike Jenkins to adapt the screenplay and Carl Schultz to direct. Funding was obtained from the New South Wales Film Corporation among others.[1]After an extensive search, Nicholas Gledhill, son of actor Arthur Dignam was cast as PS. The film was shot in and around Sydney, mostly in Neutral Bay, New South Wales and Elizabeth Bay, New South Wales.[1]","Box office":"Careful, He Might Hear You grossed $2,431,126 at the box office in Australia.[2] The movie also enjoyed a successful release in North America.[1]","produced_by":"Jill Robb","starring":"Wendy Hughes Robyn Nevin Nicholas Gledhill","running_time":"110 minutes","External links":"","written_by":"Sumner Locke Elliott (novel) Michael Jenkins","budget":"A$2.2 million[1]"}