{"country":"United Kingdom","distributed_by":"Columbia Pictures","Background":"The film is essentially an adaptation of a sex novel printed in paperback form. It was adapted for the screen in the 1970s, when the British film industry produced a large number of film adaptations of literary works. Sian Barber cites other examples of this trend: Jane Eyre (1970), Wuthering Heights, Black Beauty (1971), The Go-Between (1971), Kidnapped (1972), Treasure Island (1973), Gulliver's Travels (1977), The Thirty Nine Steps (1978), and The Riddle of the Sands (1979). [3] Sian Barber points that adaptations of highbrow material (for example, works by Henrik Ibsen, Anton Chekhov, Iris Murdoch) and Middlebrow material (for example, works by William Shakespeare, Charles Dickens, Rudyard Kipling, D. H. Lawrence) were hardly unusual by the 1970s, but points to Confessions as an early adaptation of low brow popular literature. [3] [4]The series of source novels about Timmy Lea had benefited from a literary forgery, the notion that Lea was not a fictional character but the actual author. The series was a sexual fantasy masquerading as confessional writing, a genre which tends to attract audiences. When novice film producer Greg Smith became interested in adapting the novels to screen, the hoax was maintained and Timmy Lea received credits as the author of the source material. The actual author and screenwriter, Christopher Wood, hardly resembled his creation. [4]Confessions was a low-budget film, with a budget of 100,000 pounds sterling, but not really an independent film. Producer Michael Klinger tried to secure funding from independent investors, but most of the funding actually came from Columbia Pictures. This was a fact telling for its period. The condition of the economy of the United Kingdoms in the early 1970s had left part of the British film industry dependent on American funds. [4] Being also released through Columbia, the film was the beneficiary of a marketing campaign. It was promoted through advertisements in television and tie-ins in bookstores.[5]The film benefited from changes in the Culture of the United Kingdom, with an increasingly permissive society and changes in aspects of the censorship standards. [4] Its aesthetics, themes, and characters derive in part from the then-popular genre of the British sitcom. The working class family, as depicted by the Leas, is not much different from its counterparts in On the Buses (1969–1973) and Bless This House (1971–1976). Timmy's father has the habit of collecting discarded items and bringing them home, making him reminiscent of Albert Steptoe from Steptoe and Son (1962–1974). His mother has the habit of buying consumer items on credit, making her reminiscent of Mrs Butler from On the Buses.[4]This film series also made a point of casting actors already familiar to television audiences. The idea was probably to attract said audience to the cinema. There was a trend at the time for successful sitcoms to be adapted in film, which produced hits such as Dad's Army (1971), On the Buses (1971), Up Pompeii (1971), Steptoe and Son (1972). The sitcom-like Confessions could probably appeal to the same audience. [4] Leon Hunt, when examining the success of these films, notes their positions in the Top Twenty of the British box office. In 1971, On the Buses was the 2nd greatest hit of the year, following The Aristocats (1970). Up Pompeii was 8th and Dad's Army was 10th. The only other British comedies which surpassed them were There's a Girl in My Soup (1970, 4th in its year) and Percy (5th). [5] Hunt argues that the Confessions films combined the style of the \"sitcom films\" with sexploitation. He suggests the terms \"sexcom\" as the result of this blending of genres. [5]The interior of the Lea house was depicted as brightly lit and filled with eccentric items of doubtful use, such as a moose head and a gorilla suit. The characters are confined to the \"cramped\" space of every depicted room, again reminiscent of the sets of a sitcom. The confinement itself suggests claustrophobia, and Sian Barber suggests a connection to another low-budget genre of the time with cramped locations and gaudy scenery: the British horror film. [4]","Plot":"Like many British sex comedies of the 1970s the narrative involves a male protagonist who gets into compromising situations with a succession of women.[6] The optimistic and inept Timothy Lea is freshly employed by his brother-in-law Sid as a window cleaner. With Sid an impending father to be, he looks to Timmy to fully 'satisfy' his customers, little realising that Timmy's accident prone ways often stretch to his sex life with his clients. Timmy bed hops from unsatisfied housewives to even a lesbian love tryst, all the while with his main eye on successful police woman, Elizabeth Radlett, who will have none of Timmy's sexual advances. He proposes as a result, much to his family's upset, unaware that Timmy's usual run of luck will affect the outcome!","language":"English","confessions_of_a_window_cleaner":"Theatrical release poster","cinematography":"Norman Warwick","directed_by":"Val Guest","Analysis":"In criticizing the original novels, sociologist Simon Frith had argued that the books derived their unflattering depiction of the British working class from stereotypes. In particular, the stereotypes which the middle class associates for \"the great unwashed\". Making the series an expression of class discrimination. [4] Sian Barber argues that the films inherited the same attitude towards the working class by embracing negative stereotypes of it. Sidney Noggett and his promiscuity, Rosie and her hair rollers, and the kleptomaniac tendencies of Mr. Lea all derive from these stereotypes. [4] Yet, the films actually tone the criminal tendencies of the Lea family. In the books, Timmy himself is a former prison convict, having been arrested for stealing the lead off a church roof. In the films Timmy has no such history, probably in an effort to make him more sympathetic to the audience. Production notes reveal that a sequel called Confessions from the Clink was considered by the production team, but the idea was abandoned by February, 1974.[4]Part of the humour of the film derives from a situation based on class stratification in the United Kingdom. The Leas are positioned at the bottom of the working class, barely above the criminal underclass, while the Radletts are upper middle class. The romance of Timmy and Elizabeth across the wide class divide serves to showcase both positions, and contrasts the two families. But the Leas are those depicted as ridiculous in the scenes relating to the aborted wedding, while the Radletts remain respectable. [4]While the premise of the film would be suitable for a pornographic film, the film focuses less on sexual intercourse and more on associated problems and anxieties. Timmy at first fails to perform, and the film deals with his embarrassment over his sexual inexperience and ineptitude. His sexual encounters are either awkward grappling attempts, or the result of Timmy being seduced and/or dominated by women. [4] This anxiety over the male performance in a sexual relationship is one aspect of the film's humour. Another is a reliance on more traditional elements of a comedy, such as slapstick and characters seen naked by accidental spectators. The sexual acts themselves are typically depicted as \"confusing, difficult, and troublesome\" throughout the film. [4] A running gag seems to be that Timmy, a cleaner by profession, gets dirtied in several scenes involving sexuality. The implication is that sex itself is a \"dirty\" activity.[4]Like the horror films of the 1970s, the film is set in the familiar urban landscape of Great Britain. Its contemporary horror films had largely abandoned the costume drama format of their predecessors and the \"careful class distinctions\" associated with earlier eras in favor of a contemporary setting. For example Virgin Witch (1971) and House of Whipcord (1974) are partly set in a modeling agency, Dracula A.D. 1972 (1972) and Frightmare (1974) in nightclubs, Dracula A.D. 1972 and House of Whipcord in house parties, Frightmare in a travelling funfair, and House of Mortal Sin (1975) in an antique shop. The reason for the update in setting was that it allowed for depictions of socially mobile characters, rootless or transient. Adding variety to the social interactions and locations. [4] A variety also embraced in Confessions. For similar reasons, other genres had started depicting people whose work required them to constantly travel, such as a salesman in O Lucky Man! (1973) and a truck driver in Alfie Darling (1975). Confessions manages this by placing Timmy in the fringes of the working world, and interacting with clients of varying backgrounds and eccentricities. [4]There is a contrast in the film between the character of Timmy and the women with which he interacts. His mannerisms indicate nervousness, hesitancy, clumsiness, and insecurity. While they tend to have a self-confidence which he lacks, they are forceful and proactive sexual partners. Yet these confident women tend to be accessible. The ease with which their clothes are removed underline their availability to Timmy. All but Elizabeth, the \"nice girl\" which he can not really touch. Her clothes are not less revealing, her short skirts showcase her legs and seem to invite his touch. She consequently functions much as a temptress. Yet she does not allow him to touch her beyond a certain point, setting the boundaries in their relationship. It is Timmy's desire for this unobtainable young woman which serves as an important story arc for the film. [4]Sue Harper and Justin Smith argue that the film can be seen as the initiation of a young man into a world of lustful women and adult sexual pleasure. The entire series of Confessions can be understood as a showcase for a simple notion, the notion that sexual freedom can be achieved by people of all classes and genders. [7]","release_dates":"8 November 1974","produced_by":"Greg Smith, Michael Klinger (executive producer)","starring":"Robin Askwith Antony Booth Linda Hayden Sheila White Dandy Nichols Bill Maynard","running_time":"90 minutes","Critical reception and impact":"It has been called, \"perhaps the best known and most successful British sex film\" of the era, and was the top-grossing British film of 1974.[6] As well as its sequels in the Confessions series it spawned another unrelated series of films which began with Adventures of a Taxi Driver (1975).[6] The film made Robin Askwith a star in the UK.[6] When the films were originally released they were regarded as very risqué and essentially soft core pornography, owing to the amount of nudity involved – generally female, with Robin Askwith being the only male shown naked. However the sex scenes themselves are more suggestive than explicit, being essentially played for laughs. Nonetheless, it was not until 1997 that Channel 5 became the first British terrestrial channel to show the entire series of Confessions films. At this time the Daily Mail newspaper was very critical of the sexual content of Channel 5's late night schedule, referring to Channel 5 as Channel Filth and the Confessions series as \"Films from the darkest days of British cinema\".The film was a popular hit for the British sexploitation genre, while film critics reportedly loathed it and decried it as a \"tawdry\" and vulgar spectacle. Sian Barber points at this contradiction between the popular taste and the critics' notions of quality, and concludes that it offers significant insights on actual \"audience preferences\". Preferences shaped by \"the tastes, values and frustrated desires of ordinary filmgoers\". [4] The film was a box office hit. In a cited example of a cinema in the West End of London, the film was screened for 9 weeks, with 29 performances per week, and earning over £30,000. In January 1975, the Eady Levy tax fund estimated that it had raised £200,000 from this film alone. By 1979, profits had exceeded £800,000. Yet, Robin Askwith recalled that film industry opinions were \"totally negative\" towards the film and dismissive of its success with the public. [4] In retrospect, Leon Hunt concluded that the film benefited from a combination of adult entertainment with \"good clean fun\", an appealing cast, and the popularity of the source novels. [4]Leon Hunt, examining the reviews of the film series, notes some highlights. Margaret Hinxman, film critic of the Daily Mail, wrote negative and increasingly exasperated reviews for every installment of the Confessions series. She called the original a \"puerile sex farce\" and compared the rest of them to latrinalia. Alexander Stuart, writing for the magazine Films and Filming. claimed that the films is a real confession, a confession that the British people can not properly create films, erotic images, comedy, or anything related to love. The films were unfavourably compared to the Carry On series (1958–1992), which the critics found harmless in comparison. David Robinson, writing for The Times claimed that the commercial success of the films was based on the sexual infantilism of the viewers. [8] A rare dissenting voice among critics was Virginia Dignam, writing for the Morning Star, who offered positive reviews of the film series. [8]","music_by":"Sam Sklair","edited_by":"Bill Lenny","written_by":"Val Guest Christopher Wood","budget":"£150,000 [1]"}