{"country":"United States","distributed_by":"20th Century Fox","Legacy":"A short-lived television series based on the film, also titled Breaking Away, aired in 1980–1981 and starred Shaun Cassidy. Barrie, Haley and Ashton reprised their roles in the prequel series.The 1992 Bollywood film Jo Jeeta Wohi Sikandar, starring Aamir Khan, is based on Breaking Away, though it is not a scene-to-scene copy and has a different storyline.The film inspired the song \"One For the Cutters\" by The Hold Steady, which appeared on their 2008 album Stay Positive.","Plot":"Dave, Mike, Cyril, and Moocher are working-class friends living in the college town of Bloomington, Indiana. Now turning 19, they all graduated from high school the year before and are not sure what to do with their lives. They spend much of their time together swimming in an old abandoned water-filled quarry, but also often clash with the more affluent Indiana University students in their hometown, who habitually refer to them as \"cutters\", a derogatory term for locals stemming from the local Indiana Limestone industry and the stonecutters who worked the quarries.Dave is obsessed with competitive bicycle racing, and Italian racers in particular, because he recently won a Masi bicycle. His down-to-earth father, a former stonecutter who now operates his own used car business (sometimes unethically), is puzzled and exasperated by his son's love of Italian music and culture, which Dave associates with cycling. However, his mother Evelyn is more understanding.Dave develops a crush on a university student named Katherine and masquerades as an Italian exchange student in order to romance her. One evening, he serenades \"Katerina\" outside her sorority house (Friedrich von Flotow's aria \"M' Apparì Tutt' Amor\"), with Cyril providing guitar accompaniment. When her boyfriend Rod finds out, he and some of his fraternity brothers beat Cyril up, mistaking him for Dave. Though Cyril wants no trouble, Mike insists on tracking down Rod and starting a brawl. The university president (real-life then President Dr. John W. Ryan) reprimands the students for their arrogance toward the \"cutters\" and, over their objections, invites the latter to participate in the annual Indiana University Little 500 race.When a professional Italian cycling team comes to town for a race, Dave is thrilled to be competing with them. However, the Italians become irked when Dave is able to keep up with them. One of them jams a tire pump in Dave's wheel, causing him to crash, which leaves him disillusioned and depressed. He subsequently confesses his deception to Katherine, who tearfully slaps him before storming off.Dave's friends persuade him to join them in forming a cycling team for the Little 500. Dave's parents provide T-shirts with the name \"Cutters\" on them. Mr. Stoller privately tells his son how, when he was a young stonecutter, he was proud to help provide the material to construct the university, yet he never felt comfortable on campus. Later, Dave runs into Katherine, who's going to be leaving for a job in Chicago; they patch things up, and she wishes him luck in the race.Dave is so much better than the other competitors in the Little 500 that while the college teams switch cyclists every few laps, he rides without a break and builds up a sizable lead. However, he is injured in a crash and has to stop. After some hesitation, Moocher, Cyril, and Mike take turns pedaling, but soon the Cutters' lead vanishes. Finally Dave has them tape his feet to the pedals and starts to make up lost ground; he overtakes Rod, the current rider for the favored fraternity team, on the last lap and wins for the jubilant Cutters. Mr. Stoller is proud of his son's accomplishment and takes to riding a bicycle himself. Dave later enrolls at the university himself, where he meets a pretty French student. Soon, he is extolling to her the virtues of the Tour de France and French cyclists.","language":"English","Reception":"The film received positive reviews upon its release. Roger Ebert called it \"a wonderfully sunny, funny, goofy, intelligent movie that makes you feel about as good as any movie in a long time. It is, in fact, a treasure ... Movies like this are hardly ever made at all; when they're made this well, they're precious cinematic miracles.\"[9] The New York Times's Janet Maslin wrote that, even though \"the cast is unknown, the director has a spotty history, and the basic premise falls into this year's most hackneyed category ... the finished product is wonderful. Here is a movie so fresh and funny it didn't even need a big budget or a pedigree.\"[8] The Variety magazine review concluded that \"though its plot wins no points for originality, Breaking Away is a thoroughly delightful light comedy, lifted by fine performances from Dennis Christopher and Paul Dooley.\"[10] Critic Dave Kehr, however, gave a later, somewhat dissenting opinion: \"Released at a time when any small-scale film earned critical favor simply by virtue of its unpretentiousness, Breaking Away probably looked better in context than it does now.\"[11] However, he conceded that \"Peter Yates lends the film a fine, unexpected limpidity, and the principals are mostly excellent.\"[11]The film grossed approximately $20 million in North America.[3]","breaking_away":"Original release poster","box_office":"$20 million[3]","cinematography":"Matthew F. Leonetti","directed_by":"Peter Yates","release_dates":"July 13, 1979 (1979-07-13)|||||","Production":"The Little 500 bicycle race that forms the centerpiece of the plot is a real race held annually at Indiana University. A re-enactment of the race was staged for the film in the \"old\" Memorial Stadium on the IU campus, which was demolished in 1982, four years after shooting Breaking Away in the summer of 1978.The team is based on the 1962 Phi Kappa Psi Little 500 champions, which featured legendary rider and Italian enthusiast Dave Blase, who provided screenwriter and fellow Phi Kappa Psi team member Steve Tesich the inspiration for the main character in the movie.[6] Blase, together with team manager Bob Stohler, provided the name of this character: Dave Stoller.[7] In the 1962 race, Blase rode 139 out of 200 laps[6] and was the victory rider crossing the finish line, much like the main character in the film. Blase himself appears in the movie as the race announcer.The scenes filmed in and around Bloomington, Indiana,[8] were filmed during the summer of 1978. Many of the scenes in the movie were filmed on the Indiana University campus; glimpses of the Indiana Memorial Union are in the background of Dave's ride through campus. Dave Stoller's house in the film is located at the corner of S. Lincoln St. and E. Dodds St. The pizza restaurant in the film (\"PAGLIAI'S\") is now Opie Taylors on the east side of North Walnut Street, across from the Monroe County Courthouse. Other scenes were filmed outside the Delta Delta Delta sorority house (818 E. 3rd St) and along Jordan Street.Dave's \"ecstasy ride\" on the wooded road after first meeting Kathy (where his bike tire blew) was filmed on the \"West Gate Road\" in Indiana's Brown County State Park, 14 miles (23 km) east of Bloomington on State Road 46.Two other scenes were filmed on W. 7th St.: one at Fairview Elementary, the other three blocks east near the intersection of W. 7th St. and N. Madison (the old railroad tracks have since been removed). A scene in which Dave runs a red light in front of his father was filmed at the southwest corner of the Monroe County Courthouse, at the intersection of College St. and W. Kirkwood Ave. (a few seconds before he runs it, the light is visible as he rides by the courthouse and sees Moocher and Nancy). The starting-line scene of the \"Cinzano 100\" bicycle race was at the intersection of Indiana State Roads 46 and 446 on the city's eastern edge.The old limestone quarry where Dave and his friends swim is on a private property in Perry Township south of Bloomington, at the end of East Empire Mill Road (off of old State Road 37), and is closed to visitors. It is now often called the \"Roof Top\" quarry, but was originally known as \"The Long Hole\" or \"Sanders\" quarry.The used car lot (\"Campus Cars\") that Dave's father owns was on S. Walnut St., and was a real used car lot for many years, but now has two small commercial buildings on the property; it is located at 1010 S. Walnut St. Next door is the local Honda motorcycle franchise seen in the background of the famous \"Refund? REFUND??\" scene; it remains there today.The film features music by Felix Mendelssohn, Gioachino Rossini and Friedrich von Flotow. The music was adapted by Patrick Williams.Tesich and Yates worked together again on Eyewitness (1981) and Eleni (1985). Tesich would go on to write another cycling-themed film, American Flyers (1985), starring Kevin Costner.","produced_by":"Peter Yates","starring":"Dennis Christopher Dennis Quaid Daniel Stern Jackie Earle Haley","running_time":"101 minutes[1]","edited_by":"Cynthia Scheider","written_by":"Steve Tesich","budget":"$2.3 million[2]"}