{"based_on":"Assault on Precinct 13 written by John Carpenter","country":"United States France","distributed_by":"Rogue Pictures","Plot":"Sergeant Jake Roenick (Ethan Hawke), veteran officer Jasper O'Shea (Brian Dennehy) and secretary Iris Ferry (Drea de Matteo) are the only people remaining in a soon to be shut down Detroit police precinct on New Year's Eve. Roenick is deskbound and abusing alcohol and prescription drugs. He is haunted by a botched undercover operation eight months prior that resulted in the deaths of two members of his team. Psychiatrist Alex Sabian (Maria Bello) is treating Roenick at the station.Meanwhile, crime lord Marion Bishop (Laurence Fishburne) is in custody and accused of killing a police officer. He is being transported to another location by bus with three other criminals: addict Beck (John Leguizamo), petty crook Anna (Aisha Hinds), and counterfeiter Smiley (Ja Rule), but a raging snowstorm forces the two guards to hunker down at Precinct 13 until the storm is over.Bishop and Police Captain Marcus Duvall (Gabriel Byrne) were formerly partners in crime. Duvall and his men must kill Bishop before he can testify about their involvement.Heavily outnumbered and outgunned by the corrupt street cops and SWAT officers, Roenick sets free and arms the prisoners to bolster the defense of the station. Roenick and Bishop forge an uneasy truce between cops and criminals and their combined efforts repel several more attacks by the corrupt police officers.Roenick and Bishop decide to take action instead of waiting for another attack.With so few defenders left alive, the precinct stands vulnerable to attack. O'Shea suddenly remembers a sewage tunnel running beneath the building and the survivors set fire to the station to cover their escape and flee down the passageway. When they emerge from the tunnel, the survivors find themselves surrounded by the corrupt policemen. The real traitor is revealed to be O'Shea and Duvall prepares to execute the rest. Roenick and Bishop work together to survive the final confrontation with Duvall and his men, eventually leading to Roenick killing Duvall and letting Bishop go, giving him a head start.","language":"English","Reception":"Assault on Precinct 13 has received mixed or average critic reviews, with a 60% positive rating on Rotten Tomatoes[2] and a metascore of 54 on Metacritic.[3] The film was a letdown at the box office. According to Box office Mojo, it made $35 million at worldwide box office on a budget of $30 million.[1]","assault_on_precinct_13":"Theatrical release poster","box_office":"$35.3 million[1]","directed_by":"Jean-Francois Richet","release_dates":"January 19, 2005 (2005-01-19) (United States) March 2, 2005 (2005-03-02) (France)","produced_by":"Pascal Caucheteux Jeffrey Silver Stephane Sperry","starring":"Ethan Hawke|Laurence Fishburne|John Leguizamo|Maria Bello|Ja Rule|Drea de Matteo|Brian Dennehy|Gabriel Byrne|","running_time":"109 minutes","music_by":"Graeme Revell","written_by":"James DeMonaco","budget":"$30 million"}