{"country":"Poland","distributed_by":"Film Polski","Background":"The film shows a very bleak Poland at the dying end of the Communist era. This is greatly enhanced by the strong use of colour filters. The print appears to have an effect similar to sepia tone or bleach bypass—although it is a colour picture, the photography combined with grey locations provides an effect similar to monochrome.Krótki film o zabijaniu was released in the same year that the death penalty was suspended in Poland. In 1988 the country carried out just a single execution, with 6 condemned prisoners being hanged in 1987. The portrayal of the execution method and procedure is mostly accurate, however in reality the date of executions were a surprise to the prisoner—the condemned man would simply be led into a room to discover it was the execution chamber. After the early years of Communist repression, executions were quite rare and invariably for murder; from 1969 a total of 183 men were hanged and no women.","Plot":"Waldemar Rekowski (Jan Tesarz) is a middle-aged taxicab driver in Warsaw who enjoys his profession and the freedom it affords. His concern for turning a profit leads him to ignore some potential fares in favor of others. An overweight and crude man, Waldemar also enjoys staring at young women. Jacek Łazar (Mirosław Baka) is a 21-year-old drifter who recently arrived in Warsaw from the countryside and is now aimlessly wandering the streets of the city. He seems to take pleasure in causing other people's misfortunes: he throws a stranger into the urinals of a public toilet after being approached sexually; he drops a large stone from a bridge onto a passing vehicle causing an accident; and he scares away pigeons to spite an old lady who was feeding them. Piotr Balicki (Krzysztof Globisz) is a young and idealistic lawyer who has just passed the bar exam. He takes his wife to a café where they discuss their future. At the same café, Jacek is sitting at a table handling a length of rope and a stick which he keeps in his bag. The rope and stick appear to be a weapon. He puts away the rope and stick when he spots two girls playing at the other side of the window and he engages in a game with them.Meanwhile, Waldemar has been driving his taxicab around the city looking for a fare. He stops near the café just as Jacek approaches and enters the cab. He asks to be driven to a remote part of the city near the countryside and insists the driver take a longer and more remote route. At their destination, Jacek tries to kill Waldemar with the rope, but stops and hides when people approach. The driver is still breathing and tries unsuccessfully to remove the rope from his neck. Jacek then completes his gruesome task by repeatedly smashing the barely conscious taxicab driver over the head with a large rock. Jacek then takes the taxicab to the river and dumps the body. When a children's song comes on the radio, he gets upset, rips out the radio, and discards it. He drives the car to a grocery store where he talks to a girl who jumps into the car. She notices a clown's head hanging from the mirror and asks Jacek where he got the car. He suggests that they could go away together, but she tells him she has a husband.Sometime later, Jacek is caught and imprisoned. He is interviewed by his criminal defense lawyer, Piotr, for whom this is his first case after finishing his legal studies. Piotr has little chance of winning the case against Jacek because of the strong evidence against his client. In spite of Piotr's efforts, Jacek is found guilty and sentenced to death by hanging. Piotr approaches a judge afterwards asking if he could've done more to save his client's life. The judge assures him that Piotr gave the best argument against the death penalty he's heard in years, but that the legal outcome is correct.On the appointed day, the executioner arrives at the jail and prepares for the hanging. Piotr is at the prison to attend the execution, and an official congratulates him on having just become a father. In the moments before his execution, Jacek reveals to Piotr that his baby sister was killed by a tractor driven by his drunken friend, and that he was drinking with him; he says he never fully recovered from the tragic episode. Jacek then requests that he be given the final space in his family's grave which was reserved for his mother—that he be buried next to his sister and his father. The warden repeatedly asks if they are finished talking; Piotr defiantly says he will never be finished. Jacek makes some petty last requests to his lawyer. They conclude things would've turned out differently if the girl had not tragically died.Jacek is then taken from his cell and marched to the execution chamber by several prison guards. The confirmation of his sentence is read to him as well as the decision to deny clemency. He is given last rites by a priest, and offered a final cigarette by the warden. When he requests to have one without filter instead, the executioner steps forward, lights one of his cigarettes and puts it into Jacek's mouth. Jacek takes a few puffs before it is stubbed out. Just before he is hanged, he breaks free from his guards and begins to yell uncontrollably before his hands are shackled and he is quickly hanged with ruthless efficiency. Afterwards, Piotr drives to an empty field where he sobs.","language":"Polish","Themes":"In her article about the film, Janina Falkowska describes the brutality of the effects class societies have on the lower-class, emphasizing on the \"hopelessness\" of the latter and false hope of the former.[5]Falkowska also talks about the law as a personified entity—capable of being both just and unjust, responsible for saving and ruining lives. Its integrity is thus significant to the fate of the protagonist.[5]Cine-literacy author Charles V. Eidsvik suggests there is a \"presence of senseless malice in the film\", a notion much reiterated in the forms of death and mutiny.[6]","Reception":"The Polish premiere coincided with a heated debate in Poland about capital punishment. Although the film's diegesis does not directly address political events, it is unanimously interpreted as a political statement. The Polish audience did not like the parallel alluded to between a murder committed by an individual and a murder committed by the state. Despite this controversy, the majority of critics praised Kieslowski's film and it was nominated for and won a multitude of awards.[11]Sight & Sound magazine conducts a poll of film directors every ten years to find out what they consider the ten greatest films of all time. In 2012, Cyrus Frisch voted for \"A Short Film About Killing\". Frisch commented: \"In Poland, this film was instrumental in the abolition of the death penalty.\"[12] The film is among 21 digitally restored classic Polish films chosen for Martin Scorsese Presents: Masterpieces of Polish Cinema.[13]","a_short_film_about_killing":"Theatrical release poster","cinematography":"Sławomir Idziak","production_company":"Zespoły Filmowe \"Tor\"","directed_by":"Krzysztof Kieślowski","Differences with Decalogue V":"According to the funding deal that Kieślowski had with TV Poland to make The Decalogue, two of the episodes would be expanded into films. Kieslowski himself selected Decalogue V, leaving the second for the Polish ministry of culture. The Ministry selected Decalogue VI and funded both productions.[9]The cinematic release of Decalogue V: A Short film about killing, premiered in Polish cinemas in March 1988.Although the main plot in both works is the same, Decalogue V has a different order in editing and makes more use of voice-over, whereas the film starts differently and gives a more prominent role to Piotr, the lawyer. Decalogue V suddenly jumps from the killing scene to jail and there is no connection or explanation on how Jacek got arrested. A few scenes and lines of dialogue do not feature in Decalogue V, to keep it within the time limitations for TV as intended.","release_dates":"11 March 1988 (1988-03-11) (Poland)|||||","Production":"The film was shot on location in Warsaw and Siedlce. Like the gloomy events portrayed in the film, the capital city of Warsaw is depicted as a repellent, depressing place: grey, brutal and peopled by alienated characters. Several areas of the city were used:[9]","produced_by":"Ryszard Chutkowski","starring":"Mirosław Baka|Krzysztof Globisz|Jan Tesarz|","running_time":"84 minutes","Style":"Dehumanizing filters were used to distort the images of Warsaw, creating a raw, unattractive image. Kieślowski credits his cinematographer, Slawomir Idziak, for this deliberate visual unattractiveness within the film, stating: “I sense that the world is becoming more and more ugly. . . . I wanted to dirty this world. . . . We used green filters that give this strange effect, allowing us to mask all that isn’t essential to the image”.[7] When Kieslowski first showed Idziak the screenplay, he commented, saying, “I can’t even read this! It disgusts me,” and then finally conceded, “I’ll shoot it only on the condition that you let me do it green and use all my filters, with which I’ll darken the image.” Kieslowski was not pleased, but he accepted the ultimatum, telling Idziak, “if you want to make green shit, it’s your affair.” The cinematographer concluded, “That’s how the graphic concept came about which Cahiers Du Cinema wrote that it was the most originally shot movie in the Cannes Film Festival.”[8] Idziak also used a hand held camera when filming; this gave an added raw feel to the film as it follows the daily routines of the film’s protagonist.","music_by":"Zbigniew Preisner","edited_by":"Ewa Smal","written_by":"Krzysztof Kieślowski|Krzysztof Piesiewicz|"}