{"based_on":"Dracula  by Bram Stoker","country":"United Kingdom","distributed_by":"Rank Organization (UK)|Universal International (US)|","Plot summary":"In May 1885, Jonathan Harker arrives at the castle of Count Dracula near Klausenburg (Cluj), to take up his post as librarian. Inside, he is startled by a young woman who claims she is a prisoner and begs for his help. Dracula then appears to greet Harker and guide him to his room, where he locks him in. Jonathan starts to write in his diary, and his true intentions are revealed: he is a vampire hunter and has come to kill Dracula.Freed sometime later, Harker again is confronted by the desperate woman. She begs him for help but then bites his neck. Just as she does, Dracula – fangs bared and lips bloody – arrives and pulls her away. When he awakens in daylight, Harker finds the bite mark. He hides his journal in a shrine to the Virgin Mary outside the castle and descends into the crypt, where he finds Dracula and the vampire woman resting in their coffins. Armed with a stake, he impales the woman, who, as he looks on, immediately ages from young to old. Whilst he does this, the sun sets, and when he turns to Dracula's coffin with the intention of killing the vampire, he finds it empty. Looking up, Harker is in time to see the Count shut the door and they are both plunged into darkness...A few days have passed Dr. Van Helsing then arrives in Klausenburg, looking for Harker. An inn keeper's daughter gives him Harker's journal. When he arrives at the castle, it is deserted; a hearse carriage speeds by with a coffin in it. In the crypt, Van Helsing is horrified to discover Harker lying in a coffin as a vampire. Staking Harker, he leaves to deliver the veiled news of Harker's death in person to a wary Arthur Holmwood and his wife Mina, brother and sister-in-law of Harker's fiancée Lucy Holmwood. Lucy is ill, so the news is kept from her and Lucy's little niece, Tania. But, when night falls, Lucy removes the crucifix from round her neck, opens the doors to her terrace and lays bare her neck – already, it bears the mark of a vampire bite. And soon Dracula arrives and bites her again.Mina seeks out Van Helsing's aid in treating Lucy's declining health, but Lucy begs Gerda the maid to remove his prescribed garlic bouquets, and she dies. Realizing that Lucy will arise as a vampire, Van Helsing turns over Harker's diary journal to the grief-stricken Arthur to reveal the truth about Jonathan's death. Three days after Lucy is interred, Tania is spirited away into the night and is returned by a policeman, claiming Lucy had beckoned her. Later that same night, Lucy, now undead and evil, lures away Tania once more to a graveyard with the intent to feed on and turn her into a vampire. But the child is saved when Arthur, after discovering Lucy's empty coffin, spots them and calls out to Lucy. Lucy turns her attention to him but Van Helsing manages to ward her off with a cross and forces her to flee back to her crypt. Arthur, now accepting the truth of Lucy's vampirism, asks Van Helsing why Dracula targeted her. Van Helsing explains that Lucy is both Dracula's revenge against Harker and a replacement for the bride killed by him. Van Helsing suggests using Lucy as a means to find Dracula. But Arthur refuses as it runs the risk of her biting someone else, and he does not want to see Lucy corrupted any further, so Van Helsing agrees to destroy her. After taking Tania home, they return to Lucy's coffin to stake her. Arthur is initially resistant to this method, describing it as \"horrible,\" but agrees after Van Helsing explains that this is simply Lucy's body that has been possessed by Dracula, and the only way to grant her eternal peace is to destroy her body. Van Helsing stakes her in her coffin and, when Arthur takes one final look at Lucy's body, he sees her body free of corruption and finally at peace.Van Helsing and Arthur travel to the customs house in Ingstadt to track down the destination of Dracula's coffin (which Van Helsing saw carried away when he arrived at Dracula's castle). Meanwhile, Mina is called away from home by a message telling her to meet Arthur at an address in Karlstadt – the same address Arthur and Van Helsing are told the coffin was bound for – and Dracula is indeed waiting for her.The next morning, Arthur and Van Helsing find Mina in a strange state. They leave for the address they were given, an undertaker's, but find the coffin missing. When they decide to set off again to inspect an old graveyard they suspect might be the coffin's new resting place, Arthur tries to give Mina a cross to wear, but it burns her, revealing that she is infected by vampirism and is slowly turning into a vampire herself.During the night, Van Helsing and Arthur guard Mina's windows outside against a return of Dracula, but Dracula nonetheless appears inside the house and bites her. She is saved when Arthur agrees to giver her an emergency blood transfusion administered by Van Helsing. When Arthur asks Gerda to fetch some wine from the cellar, she tells him that Mina had forbidden her to go to the cellar. Upon hearing this, Van Helsing realizes the coffin's location: the cellar of the Holmwoods' own house. He bolts downstairs to find it but Dracula is not in the coffin and instead escapes into the night with Mina, intent on making her a new bride. After planting a cross inside Dracula's coffin, he and Holmwood realize that Dracula now has only his castle to hide in.A chase then begins as Dracula rushes to return to his castle near Klausenberg before sunrise. He attempts to bury Mina alive outside the crypts but is caught by Van Helsing and Arthur. Inside the castle, Van Helsing and Dracula struggle. Van Helsing tears open the curtain to let in the sunlight and, forming a cross of candlesticks, he forces Dracula into it. Dracula crumbles into dust as Van Helsing looks on. Mina recovers, the cross-shaped scar fading from her hand, indicating that she has been saved. As she recovers, Dracula's ashes blow away, leaving only a ring behind.","screenplay_by":"Jimmy Sangster","dracula":"Original film poster","language":"English","Reception":"Dracula was a critical and commercial success upon its release and was well received by critics and fans of Stoker's works. The film currently scores 91% on review aggregator website Rotten Tomatoes based on 32 reviews, with an average rating of 7.8/10. The site's consensus states: \"Trading gore for grandeur, Horror of Dracula marks an impressive turn for inveterate Christopher Lee as the titular vampire, and a typical Hammer mood that makes aristocracy quite sexy.\"[4]The trade journal reviews from 1958 were very positive. Film Bulletin noted, \"As produced by Anthony Hinds in somber mid-Victorian backgrounds . . . and directed by Terence Fisher with an immense flair for the blood-curdling shot, this Technicolor nightmare should prove a real treat. The James Bernard score is monumentally sinister and the Jack Asher photography full of foreboding atmosphere.\"[5]Harrison's Reports was particularly enthusiastic, \"Of all the \"Dracula\" horror pictures thus far produced, this one, made in Britain and photographed in Technicolor, tops them all. Its shock impact is, in fact, so great that it may well be considered as one of the best horror films ever made. What makes this picture superior is the expert treatment that takes full advantage of the story's shock values.\"[6]Vincent Canby in Motion Picture Daily said, \"Hammer Films, the same British production unit which last year restored Mary Shelley's Frankenstein to its rightful place in the screen's chamber of horrors, has now even more successfully brought back the granddaddy of all vampires, Count Dracula. It's chillingly realistic in detail (and at times as gory as the law allows). The physical production is first rate, including the settings, costumes, Eastman Color photography and special effects.\".[7]","box_office":"1,008,834 admissions (France)[3]","cinematography":"Jack Asher","production_company":"Hammer Film Productions","directed_by":"Terence Fisher","release_dates":"8 May 1958 (1958-05-08)|||||","Production":"The filming of Dracula's destruction included a shot in which Dracula appears to peel away his decaying skin. This was accomplished by putting a layer of red makeup on Lee's face, and then covering his entire face with a thin coating of mortician's wax, which was then made up to conform to his normal skin tone. When he raked his fingers across the wax, it revealed the \"raw\" marks underneath. This startling sequence was cut out, but was restored for the 2012 Blu-ray release, using footage from a badly damaged Japanese print.At the end of the film, Dracula is destroyed on an inlaid Zodiac wheel on the floor, which has several quotes in Latin and Greek. The inner circle in Greek has a quote from Homer's Odyssey Book 18.136–7: \"τοῖος γὰρ νόος ἐστὶν ἐπιχθονίων ἀνθρώπων οἷον ἐπ᾽ ἦμαρ ἄγησι πατὴρ ἀνδρῶν τε θεῶν τε\" (\"The mind of men who live on the earth is such as the day the father of gods and men [Zeus] brings upon them.\") The outer wheel is written in Latin, and is a quote from Hesiod via Bartolomeo Anglico (De proprietatibus rerum, Book 8, Chapter 2): \"Tellus vero primum siquidem genuit parem sibi coelum stellis ornatum, ut ipsam totam obtegat, utque esset beatis Diis sedes tuta semper.\" (\"And Earth first bare starry Heaven, equal to herself, to cover her on every side, and to be an ever-sure abiding-place for the blessed gods.\") Dracula's ring is left on the glyph of the sign of Aquarius on the Zodiac wheel.","produced_by":"Anthony Hinds","starring":"Peter Cushing|Michael Gough|Melissa Stribling|Christopher Lee|","running_time":"82 minutes[1]","Sequels":"After the success of Dracula, Hammer went on to produce eight sequels, six of which feature Lee reprising the titular role, and four of which feature Cushing reprising the role of Van Helsing.","music_by":"James Bernard","edited_by":"Bill Lenny","Release":"The film made its first appearance on DVD in 2002 in the US stand-alone and was later re-released on 6 November 2007 in a film pack along with Dracula Has Risen from the Grave, Taste the Blood of Dracula, and Dracula A.D. 1972; which was part of Warner Bros. and New Line Cinema's \"4 Film Favorites\" line of DVDs.[8] On 7 September 2010, Turner Classic Movies released the film in a 4-Pack along with Dracula Has Risen from the Grave, The Curse of Frankenstein and Frankenstein Must Be Destroyed. The film was released on DVD in the UK in October 2002 alongside The Curse of Frankenstein and The Mummy in a box-set entitled Hammer Horror Originals.The film was digitally restored and re-released in the UK by the BFI in 2007. When the film was originally released in the UK, the BBFC gave it an X rating, being cut, while the 2007 uncut re-release was given a 12A.For many years historians have pointed to the fact that an even longer, more explicit, version of the film played in Japanese and European cinemas in 1958. Efforts to locate the legendary 'Japanese version' of Dracula had been fruitless.In September 2011, Hammer announced that part of the Japanese release had been found in the National Film Center at the National Museum of Modern Art, Tokyo. The first five reels of the film held by the center were destroyed in a fire in 1984, but the last four reels were recovered. The recovered reels include the last 36 minutes of the film and includes two extended scenes, one of which is the discovery of a complete version of the film's iconic disintegration scene. The announcement mentioned a HD telecine transfer of all four reels with a view for a future UK release.[9]On 29 December 2012, Hammer announced that the restored film would be released on a three-disc, double play Blu-ray Disc set in the UK on 18 March 2013. This release contains the 2007 BFI restoration along with the 2012 high-definition Hammer restoration which includes footage which was previously believed to be lost.[10] The set contains both Blu-ray Disc and DVD copies of the film as well as several bonus documentaries covering the film's production, censorship and restoration processes.","budget":"£81,000[2]"}