{"based_on":"9  by Shane Acker","country":"United States[2]","distributed_by":"Focus Features","story_by":"Shane Acker","language":"English","box_office":"$48.4 million[3]","cinematography":"Kevin R. Adams","Marketing":"On December 25, 2008, a trailer was released on Apple.com that features The Knife's \"The Captain\" and Coheed and Cambria's \"Welcome Home\".[10] The trailer featured several machines: the Cat Beast, a cat-like ambush predator that appeared in the original short film; the Winged Beast, a pterodactyl-like machine with movable blades in its mouth; the Seamstress, a hypnotic serpent; Steel Behemoths, large two-legged machines armed with a machine gun and poison gas missiles which can kill in a matter of seconds; the Fabrication Machine, a cyclopic, spider-like machine with many multi-jointed arms; and Seekers, aerial machines with searchlights.[10] Later trailers also reveal the existence of several small spider-like machines. Part of the film's marketing strategy was its release date of September 9, 2009 (\"9/9/09\").9 is the second animated feature film to be released by Focus Features, the first being Coraline, written and directed by Henry Selick and based on the book by Neil Gaiman. The trailer for 9 preceded Coraline when it was shown in theaters and released on DVD. A second trailer for 9 first appeared on G4's Attack of the Show and was later shown before Land of the Lost. It is an extensive trailer which includes a bit of the background story behind the existence of the creations. In April 2009, the film's \"Scientist\" began making journal entries on a Facebook page called \"9 Scientist\", including essays about each of his nine creations. The \"9 Scientist\" Facebook page seemingly references events leading up to the release of the film.[11] A viral campaign promotional website for 9 was launched. It shed some light upon the background of the 9 world.[12]Since the work of the Scientist is ultimately responsible for the destruction of mankind, it is of some note that the actor who plays this role, Alan Oppenheimer, is the cousin of scientist Robert Oppenheimer, the \"Father of the Atomic Bomb\".[citation needed] Although it was an animated film, 9 was rated PG-13 for \"violence and scary images\". NECA Toys released collectible action figures of 9 and 1.","directed_by":"Shane Acker","release_dates":"September 9, 2009 (2009-09-09)|||||","Production":"9 was directed by Shane Acker, who also wrote the story based on his previous short film by the same title. The screenplay was written by Pamela Pettler. Acker, a young director, was influenced by Tim Burton who worked with him on this animated feature. It was produced in part by Tim Burton, Timur Bekmambetov and Jim Lemley, and was released on September 9, 2009. Animation began in Luxembourg at Attitude Studio, but subsequently moved to Starz Animation in Toronto, Canada.[7] The film was released by Focus Features. Originally, TriStar Pictures was supposed to release the film with Focus Features, but was later dropped out to distribute Planet 51.[citation needed]","running_time":"79 minutes[1]","Sequel":"Currently, no plans for a sequel have been made, but possibilities have been mentioned via the film's DVD commentary. Director Acker has also mentioned the possibility of a sequel being made because of the lack of darker animated films, claiming that everything is G and PG rated with little to no dark elements. He has said that he will continue to make darker animated films, either doing so with a sequel to 9 or original ideas for future films.[21] Before the theatrical release of the film, Acker and producer Tim Burton stated they were open for a sequel, depending on how well the film was received.[22] Since the film's home release, there have been no further mentions of a sequel, with Acker focusing on his latest project Deep.[23]","budget":"$30 million[3]","screenplay_by":"Pamela Pettler","Plot":"Prior to the events of the film, a Scientist is ordered by his dictator to create a machine in the apparent name of progress. The Scientist uses his own intellect to create the B.R.A.I.N., a thinking robot. However, the dictator quickly seizes it and integrates it into the Fabrication Machine, an armature that can construct an army of war machines to destroy the dictator's enemies. Lacking a soul, the Fabrication Machine becomes corrupted and decides to exterminate all life on Earth. The Fabrication Machine reprograms the other war machines to turn against humans by using toxic gas and chemical weapons. On the verge of destruction, the Scientist uses alchemy to create nine homunculus-like rag dolls known as \"Stitchpunks\" using portions of his own soul via a talisman and dies upon finishing the last one.Sometime later, the last doll, 9, awakens in the Scientist's workshop. Taking the talisman with him, 9 ventures into the devastated city and meets 2, a frail inventor who gives him a voice box and is surprised when 9 reveals the talisman. The last surviving machine, the Cat-Beast, attacks the pair and takes 2 and the talisman. 9 collapses, but awakens in Sanctuary, a cathedral that is home to other Stitchpunks, including the dogmatic leader 1, his large bodyguard 8, the cycloptic engineer 5, and the mentally unstable oracle 6. 1 immediately labels 2 as dead, but 9, having seen the factory where the Cat-Beast has taken 2, decides to rescue him. 9 and 5 venture to the factory where they find 2. Meanwhile, 7, the only female of the Stitchpunks, arrives and slays the Cat-Beast. 9, drawn by curiosity, connects the talisman to the previously derelict Fabrication Machine, causing it to absorb 2's soul, reviving it and killing him in the process whilst 9, 5, and 7 manage to escape the factory.7 takes 9 and 5 to the library, where the silent scholar twins, 3 and 4, show 9 the Fabrication Machine's origins. 5 realizes the talisman's symbols match the clairvoyant drawings of 6. 9 and 5 return to Sanctuary to investigate, but 1 confronts and chastises them. The Fabrication Machine starts constructing new machines; one of them, the bird-like Winged Beast, attacks Sanctuary, leading to a battle between the Stitchpunks and the Winged Beast. 7 joins the fight, but is injured. 5, 6 and 8 then manage to kill the Winged Beast.As the group retreat to the library, 6, 3, and 4 cryptically explain the talisman's origins, but 1 once again chastises the group, then reveals he sent 2 out of the church on a scouting trip to die, calling him old and weak. Meanwhile, the Fabrication Machine finds 2's corpse and uses it as a hypnotic lure for another robot, the Seamstress. The Seamstress attacks the library and captures 7 and 8, but 2's body is safely recovered and given a funeral by the others. The others then run to the factory to destroy the machines. 9 goes inside alone, kills the Seamstress, and rescues 7, but not before witnessing 8's soul getting absorbed by the Fabrication Machine. 9 and 7 escape while the others destroy the factory.The Stitchpunks celebrate the destruction of the factory, but the Fabrication Machine, which survived, suddenly appears from behind and ends up absorbing 5's soul after surprising the other Stitchpunks. The Fabrication Machine soon attacks the group and eventually captures 6, who is absorbed but not before convincing 9 to go to the Scientist's workshop to find answers. 9 follows 6's instructions, finding a holographic recorded message from his creator, who explains that the Stitchpunks are all a part of himself, including 9, making them the only hope for humanity. He then explains that the talisman can be used against the Fabrication Machine to free the Stitchpunks' souls trapped in it.9 reunites with the other Stitchpunks and devises a plan to sacrifice himself to allow the others to retrieve the talisman from the Fabrication Machine. However, 1, having had a change of heart, redeems himself after saving 9 by pushing him out of the way, allowing himself to be absorbed and giving 9 the opportunity to remove the talisman. The Fabrication Machine desperately tries to grab it in anger, but 9 activates it and uses it to reabsorb the souls taken by the Fabrication Machine, causing a massive explosion that destroys the Fabrication Machine in the process. 9, 7, 3, and 4 free the souls of 5, 1, 6, 2, and 8 from the talisman and they fly up into the sky, causing it to rain. The final image shows that the raindrops contain small flecks of glowing bacteria, bringing life back to the world.","Reception":"9 has received generally mixed reviews; critics praised its animation, visuals and tone but criticized its average voice acting, character development, and pacing. Based on 181 reviews collected by Rotten Tomatoes, the film has an overall \"Rotten\" approval rating of 56% from critics. The site's consensus reads, \"Although its story is perhaps too familiar and less complex than some might wish, 9 is visually spectacular, and director Shane Acker's attention to detail succeeds in drawing viewers into the film's universe.\"[13] On Metacritic, it currently holds a score of 60 out of 100 indicating mixed or average reviews.[14] Roger Ebert gave the film 3 out of 4 stars, saying it is \"beautifully animated and intriguingly unwholesome...nevertheless worth seeing\".[15] The general sentiment by critics is that the film is \"long on imaginative design but less substantial in narrative.\"[16] Variety's Todd McCarthy says, \"In the end, the picture's impact derives mostly from its design and assured execution.\"[17]Its opening weekend landed it at #2 behind I Can Do Bad All By Myself with approximately $10,740,446 and $15,160,926 for its 5-day opening.[18] As of November 29, 2009, the film has grossed US$48,428,063 worldwide.[3]","Home release":"The film was released on DVD and Blu-ray on December 29, 2009, just three-and-a-half months after the film's theatrical release.[19] The DVD and Blu-ray contained special features such as the director Shane Acker's original 2005 short film of the same name, cast interviews, and commentary by the filmmakers.","Video game":"Shortly before the film's release, SkyZone released a mobile game adaptation entitled 9: The Mobile Game for the iPhone and iPod Touch. The plot is similar to the movie's plot, with minor differences. It received mixed reviews.","production_companies":"Bazelevs Animation Relativity Media Starz Animation Tim Burton Productions","Music":"While the surviving creations are celebrating, \"Over the Rainbow\", the song from The Wizard of Oz performed by Judy Garland, plays on a 78rpm gramophone record, which was not included in the original motion picture soundtrack to 9. \"Welcome Home\" by Coheed and Cambria plays in the trailer for the film, with minor censoring, which is included in the soundtrack. The trailer also features an excerpt from \"The Captain\" by The Knife, which was also not included in the soundtrack. It was only available on iTunes[9] and on Amazon before the film was released 8 days later. It includes the themes created by Danny Elfman, Deborah Lurie's film score and \"Welcome Home\".All music composed by Danny Elfman and Deborah Lurie with soundtrack, except \"Welcome Home\" (lyrics by Claudio Sanchez, music by Coheed and Cambria).","9":"Theatrical release poster","produced_by":"Timur Bekmambetov|Tim Burton|Dana Ginsburg|Jim Lemley|","starring":"Elijah Wood|John C. Reilly|Jennifer Connelly|Christopher Plummer|Crispin Glover|Martin Landau|Fred Tatasciore|","music_by":"Deborah Lurie","edited_by":"Nick Kenway"}