{"country":"United States","distributed_by":"Paramount Pictures (1966, original) Olive Films (under license from Paramount Pictures) (2012, DVD and Blu-Ray DVD)","Plot":"A World War II-era German submarine missing for 20 years is retrieved in the Bahamas by diver Mark Brittain, and hired by the wealthy Rosa Lucchesi and her partner Vic Rossiter, who have been searching for Spanish galleons.The recovery of the submarine results in a plot devised by Eric Lauffnauer, a U-boat officer during the war, to pull a daring million-dollar heist on the British ocean liner Queen Mary, which he and the others plan to rob on the high seas while the liner is making a transatlantic crossing.Brittain gets the submarine in working order with the assistance of his own partner, Linc, and a new man, Moreno, a war hero and expert with engines. Disguised as officers from a British vessel on a top-secret mission, Brittain, Rossiter and Lauffnauer board the Queen Mary, where they seize the bullion in the cargo hold. The captain complies after the pirates threaten to open fire on the ship and its civilian passengers.Rossiter's greed leads to his being killed by a member of the Queen's crew. Brittain must abandon the money when Lauffnauer prepares to dive the submarine without him. A U.S. Coast Guard cutter in the vicinity comes to the ocean liner's aid. Lauffnauer elects to fire the submarine's torpedoes at it. When the others protest, he draws a gun. Rosa tries to stop him and Lauffnauer accidentally shoots his friend, Moreno. The Coast Guard cutter destroys the torpedoes that Lauffnauer manages to fire from the U-boat. Brittain, Rosa and Linc dive off the submarine, just before it is rammed by the Americans. They survive, paddling a raft, but their mission has resulted in three deaths and netted them nothing.","box_office":"$2.7 million (est. US/ Canada rentals)[1]","cinematography":"William H. Daniels","production_company":"Seven Arts Productions Sinatra Enterprises","directed_by":"Jack Donohue","Production notes":"The U.S. Coast Guard cutter seen in the film was portrayed by the Miami, Florida-based USCGC Androscoggin (WHEC-68).The USCGC Minnetonka (WHEC-67) is also listed in the film's final credits, since some of the scenes also used Minnetonka. At the time of filming, Minnetonka was homeported in Long Beach, California, close to Paramount's studio facilities in Hollywood.","DVD":"Assault on a Queen was released to DVD and Blu-Day DVD by Olive Films on March 27, 2012 in Region 1 and in widescreen.","release_dates":"June 15, 1966 (1966-06-15)|||||","assault_on_a_queen":"Theatrical release poster","produced_by":"William Goetz","starring":"Frank Sinatra Virna Lisi Anthony Franciosa","running_time":"106 minutes","music_by":"Duke Ellington Nathan Van Cleave","written_by":"Rod Serling"}