{"country":"United States","distributed_by":"20th Century Fox","language":"English","a_walk_with_love_and_death":"Theatrical poster","cinematography":"Edward Scaife","directed_by":"John Huston","Plot and context":"The story is based on the 1961 novel by Hans Koningsberger, set at the time of the 1358 uprising of the peasants of northern France known as the Jacquerie. Heron of Fois, a student from Paris, crosses territory devastated by the upheaval and the ferocious reprisals of the nobility. He meets with Claudia, the aristocratic daughter of a royal official killed by the peasants, and they attempt to reach Calais. In the novel Heron's intended final destination is Oxford University while in the film \"the sea\" less specifically comes to represent an abstract freedom. While differing in their views of the Jacquerie—Heron sympathises with the exploited peasantry while Claudia sees their rising as mindless savagery—the young couple become lovers. In the end they fail to escape the chaotic violence around them but await death \"strangely happy - we had stopped running from them and we had our hour\".Some contemporary reviewers considered that the film held up the past as a mirror of the events of 1968, when it was made. Comparisons were variously made with the Vietnam War or the Paris rioting of May/June that year, which required filming to be relocated to Austria and Italy. However a recent and detailed analysis of both novel and film by the essayist Peter G. Christensen concludes that the story is literally a period one, intended to evoke the turbulence of its 14th century setting, rather than illustrating cultural or generational issues of the late 1960s.[2]The film marked the screen debut of Huston's daughter Anjelica Huston.[3] It also marked the screen debut of Israeli actor Assi Dayan, son of Moshe Dayan.[4] John Huston himself plays the role of a noble who defects to the rebels.The film was not a box-office success,[4] although John Huston noted in his autobiography, An Open Book (1980), that it was highly praised in France, where there was a greater understanding of the historical context.","Music":"The musical score was the work of the French composer Georges Delerue. It incorporated medieval folk music themes, making extensive use of lute, harpsichord and recorders.","release_dates":"1969 (1969)|||||","produced_by":"Carter DeHaven","starring":"Anjelica Huston Assi Dayan Anthony Higgins John Huston","running_time":"90 min.","music_by":"Georges Delerue","edited_by":"Russell Lloyd","written_by":"Hans Koningsberger (novel & screenplay)","budget":"$2,410,000[1]"}