{"country":"United States","distributed_by":"RKO Radio Pictures","Plot":"Mild-mannered Professor Hobart Frisbee (Danny Kaye) and his fellow academics, among them Professor Magenbruch (Benny Goodman), are writing a musical encyclopedia. In the process, they discover that there is some new popular music that is called jazz, swing, boogie woogie or rebop, introduced to them by two window washers Buck and Bubbles. The professors become entangled in the problems of nightclub singer Honey Swanson (Virginia Mayo). She needs a place to hide out from the police, who want to question her about her gangster boyfriend Tony Crow (Steve Cochran). She invites herself into their sheltered household, over Frisbee's objections. While there, she introduces them to the latest in jazz, with which they are unfamiliar, giving the film an excuse to feature many of the best musicians of the era. The songs they play include \"A Song Is Born\", \"Daddy-O\", \"I'm Getting Sentimental Over You\", \"Flying Home\", and \"Redskin Rumba\".Eventually, Tony comes by to collect Honey, but by that time, she and Hobart have fallen in love. And the finale, of course, is not decided by guns but by music, its resonance and reverberation.","a_song_is_born":"Theatrical release poster","language":"English","box_office":"$2.4 million (US rentals)[3]","cinematography":"Gregg Toland","production_company":"Samuel Goldwyn Productions","directed_by":"Howard Hawks","release_dates":"October 19, 1948 (1948-10-19) (Premiere-New York City)[1]|November 6, 1948 (1948-11-06) (U.S.)[1]||||","Production":"Kaye's personal writer/composer, Sylvia Fine, who also happened to be Kaye's wife, refused to take part in any more of his projects because Kaye had recently left her for actress Eve Arden. Kaye didn't want anyone else writing songs for him, so he simply did not perform any songs in the film.[5][6]Hawks had almost no interest in the film, and only came to work on it because of the $250,000 paycheck. When speaking of the film, he said \"Danny Kaye had separated from his wife, and he was a basket case, stopping work to see a psychiatrist [every] day. He was about as funny as a crutch. I never thought anything in that picture was funny. It was an altogether horrible experience.\" [5]","produced_by":"Samuel Goldwyn","starring":"Danny Kaye Virginia Mayo Steve Cochran Benny Goodman Louis Armstrong Tommy Dorsey Lionel Hampton Charlie Barnet Mel Powell","running_time":"113 minutes","music_by":"Hugo Friedhofer Emil Newman","edited_by":"Daniel Mandell","Release":"A Song Is Born was the number one film in the country from the time of its release until November 1948, while Hawks's other film (and in his opinion, best) Red River, was second.[5] However, A Song Is Born never broke even, only earning about $2.2 million, while Red River went on to gross $4.1 million.[6] It was shown on American Movie Classics, hosted by Nick Clooney, and has been released on home video in both VHS and DVD formats.[7]","written_by":"Billy Wilder (story) Thomas Monroe (story) Harry Tugend (uncredited)","budget":"$2.3 million[2]"}