{"country":"United States","distributed_by":"TriStar Pictures","Plot":"Young D.A. Louie Jeffries is hit by a car and dies in 1964, but manages to slip by the pearly gates and is instantly reborn. In 1987, 23 years later, his widow Corinne still misses him, ignoring the frustrated devotion of his best friend Phillip Train, who has pretty much raised his only daughter Miranda as his own. Miranda, while a student at Yale University meets Alex Finch, who works in the library but is about to graduate. After graduation, Alex heads to Washington, DC, where he makes his way to the offices of The Washington Post. His first attempts to meet with Ben Bradlee thwarted, Alex schemes his way into the office of newspaper editor Ben Bradlee by pretending to be a delivery man. Alex walks into Bradlee's office, with Phillip behind him. Bradlee, confounded by the young man, asks who Alex is. When Alex attempts to remind him of their meeting at Yale, Phillip vouches for him, which changes Bradlee's mind about giving him a meeting. Unfortunately, Bradlee feels Alex needs more time working on smaller papers before he can offer him a job. Alex, feeling defeated, leaves his office. Phillip finds Alex downstairs in the lobby. Alex offers Phillip a ride, during which Phillip invites Alex to meet the Jeffries family over dinner. Alex begins to have flashbacks that take place in the Jeffries home, a home to which he's never been. Freaked out, he begins to act crazed and confused. Putting the pieces together, Alex realizes he is Louie Jeffries, Corinne's dead husband, reincarnated.His memories of his life as Louie return just as Alex begins a romantic involvement with Louie's (i.e., his own) daughter Miranda. Instead, Louie then spurns his daughter's advances and begins romancing his widow Corinne, frustrating Phillip's attempts to court Corinne, and resulting in a number of comic mixups.Soon, however, Alex/Louie realizes Phillip and Corinne should be together and arranges things so they can realize their love and he can get out of their way.Alex/Louie bursts into the courtroom accusing the judge of accepting a bribe (Louie remembers taking a photograph of the then younger judge taking the bribe) and tells where the camera with the pictures of the judge are. Alex falls down the stairs, hits his head, and ends up in the hospital. While unconscious, Alex is administered a special injection he should have received at the pearly gates 23 years previous, to make him forget his past life as Louie. When he wakes, he tells Miranda that the last thing he remembers is them kissing in the corner of the refrigerator. He happily resumes romantic interest in Miranda, which she gladly accepts, having never been informed of his other identity by anyone. Newspaper headlines show the judge charged with accepting the bribe. Alex accepts a job offer as a reporter. His and Miranda's relationship continues with Phillip and Corinne's full knowledge and approval, although neither of them has forgotten \"Louie\" lives on in Alex.","Locations":"Many scenes were filmed in Georgetown, along the Mall, and other parts of Washington, DC.","language":"English","Reception":"Chances Are received generally positive reviews from critics.","box_office":"$16,278,590[1]","chances_are":"Theatrical release poster","cinematography":"William A. Fraker","directed_by":"Emile Ardolino","Soundtrack":"The soundtrack included the Billboard's Top 10 single hit song \"After All\" (composed by Tom Snow and lyrics by Dean Pitchford) performed by Cher and Peter Cetera. The song peaked at #6 on the Billboard Hot 100 in May 1989 and was nominated for Academy Awards Best Original Song. Another is the song of the same title sung by Johnny Mathis. Although the film contains other songs, a soundtrack album has never been released.","release_dates":"March 10, 1989 (1989-03-10)|||||","produced_by":"Mike Lobell","starring":"Cybill Shepherd|Robert Downey, Jr.|Ryan O'Neal|Mary Stuart Masterson|","running_time":"108 minutes","music_by":"Maurice Jarre","edited_by":"Harry Keramidas","written_by":"Perry Howze Randy Howze","budget":"$16 million"}