{"country":"United States","Plot":"The film opens, after the murder of a woman in dark alley by a mysterious caped figure, on a scene between Kingsford and his fiance Eveleyn Lang (Meredith). Kingsford is an expert on the supernatural and along with his dwarf assistant Nikola (Charles Boldender) he is called in by police to uncover the scheme of a Sumerian demon to return to earth and take over a human body. A series of murders of women (similar to those committed in 1888 London by Jack the Ripper has taken place in San Francisco; in the San Francisco killings, however, a series of statuettes carved of ivory and depicting a repulsive reptilian head is left beside each body. In each statue found at a victim’s feet, the demon in the little figurines emerges from the back of a man, budding out farther with each crime. It as though with each killing, the demon is freeing itself from its host a little bit more. There also seem to be connections between the various four victims.Kingsford initially consults an old Chinese curio dealer, Chi Zang (Peter Brocco) for advice. The dealer, (whose shop has a statue of a multi-armed Chinese god who may be Yu Lueh) shows Kingsford a mummified creature with a hideous fanged mouth which the priest claims is a Sumerian demon. The mummified demon is accompanied by a seven-spoked wheel. The priest says that the demon will commit seven killings, one for each spoke, until it accomplishes its purposes, according to mystic periods of time known only to itself. Kingsford picks up the small mummy but drops it when it becomes hot and leaves him with a scratched hand.Kinsford then goes to the import shop of his friend Robert Vandenburg where they earlier arranged to meet. A shadow trails him, and in the shop, Kingsford is attacked by the hump-backed, long-finger-nailed, black hat-wearing, caped and demonically-growling figure who murdered the woman at the start of the film. Kingsford fends off the attack and the figure disappears. The police arrive, as does Vandenburg.","Connection to the Cthulhu Mythos":"The dialogue includes some references to alien beings invented by horror writer H.P. Lovecraft, tying the film to Lovecraft's Cthulhu Mythos. In an early scene where Brett Kingsford meets with the police commissioner, opines that \"gods older than the human race...deities like Dagon and Azathoth still have worshippers.\" [1] Additionally, towards the end of the film where Malachi takes over the body of Vanderburgh, he invokes the names of several deities, some traditional such as the Goetic demons Asmodeus and the Astaroth but also Nyogtha, a god invented for the Cthulhu Mythos Henry Kuttner deities by Lovecraft's colleague Henry Kuttner.These references were no doubt introduced by producer Jack Laird who later introduced similar Lovecraftian references and episodes to the television series Rod Serling's Night Gallery, such as these episodes he scripted - \"Pickman's Model\" (based directly on the Lovecraft story of the same title) and \"Professor Peabody's Last Lecture\".","Further reading":"","dark_intruder":"Theatrical poster to Dark Intruder","cinematography":"John F. Warren","directed_by":"Harvey Hart","Home media release":"Dark Intruder was released on DVD by Universal/TCM as one of their \"Selects\" series on December 7, 2015 on a double bill with the 1964 psychological thriller The Night Walker.","release_dates":"1965 (1965)|||||","produced_by":"Jack Laird","starring":"Leslie Nielsen Gilbert Green Charles Bolender Mark Richman Judi Meredith","running_time":"59 minutes","music_by":"Lalo Schifrin","edited_by":"Edward W. Williams","written_by":"Barré Lyndon"}