{"Cast":"As appearing in screen credits (main roles identified):[2]","country":"United States","distributed_by":"Metro-Goldwyn-Mayer (MGM)","desperate_search":"1952 Theatrical poster","Plot":"After taking off from Vancouver, a Canadian Western Airways Douglas DC-3 airliner catches on fire and crashes in the Canadian north. On board were two young children, Don (Lee Aaker) and Janet Heldon (Linda Lowell), ultimately the only survivors. Their father, pilot Vince Heldon (Howard Keel) and his wife Julie (Jane Greer) join forces with the family friend, bush pilot \"Brandy\" (Keenan Wynn) and Nora Stead (Patricia Medina), the children's mother (from an earlier, but unsuccessful marriage) to mount a desperate aerial search before incoming bad weather arrives.Tensions mount as the children face the danger of exposure and a mountain lion that begins to track them while the searchers themselves are in conflict as the hotshot pilot Stead creates problems with her constant efforts to take over the search. A final effort sees a reconciliation and a successful rescue in the nick of time.","language":"English","Reception":"Variety called Desperate Search \"strictly a routine offering\" but praised Lewis's directing skill, which \"hammers home as much tension and suspense as possible.\" A later-day review similarly noted the taunt story and excellent portrayals by the leads but also described the child actors as being the key to film, with Lee Aaker's acting a stand-out while Linda Lowell \"gives a one-note performance which consists mostly of screaming at the top of her lungs.\" [3]According to MGM's records the film earned $465,000 in the US and Canada and $242,000 elsewhere, resulting in a loss of $88,000.[1]","box_office":"$707,000[1]","cinematography":"Harold Lipstein","directed_by":"Joseph H. Lewis","release_dates":"1952","Production":"As an example of MGM's effort to create a streamlined, low-budget drama, the action in Desperate Search was pared down to the essential dramatic elements of a search for downed children. Although authentic \"props\" were used, including the fictional Canadian Western Airways Douglas DC-3, most of the aerial scenes were stock footage. The use of an aircraft painted as \"CF-HGO\" allowed the studio to merge aerial footage of the prototype Noorduyn Norseman which first flew on November 14, 1935, and was subsequently hired by Warner Brothers in the summer of 1941 for the filming of Captains of the Clouds in the North Bay area of Ontario and carried the temporary registration, \"CF-HGO\" during the filming.Although the director, Joseph H. Lewis was offered the opportunity to do location shooting, almost all of the film takes place on MGM's back lot. Selected scenes of the earlier Captains of the Clouds film are used, matching the action shot on the studio stage.[Note 1]","produced_by":"Matthew Rapf","starring":"Howard Keel, Jane Greer, Patricia Medina, Keenan Wynn","running_time":"71 min","music_by":"Rudolph G. Kopp","edited_by":"Joseph Dervin","written_by":"Arthur Mayse (story) Walter Doniger (screenplay)","budget":"$520,000[1]"}