{"based_on":"A Dangerous Woman  by Mary McGarry Morris","country":"United States","distributed_by":"Gramercy Pictures (USA) Island World (International)","screenplay_by":"Naomi Foner","Plot":"Martha Horgan (Winger) struggles to have a normal life in spite of being mentally challenged. She is fired from a job at the local dry-cleaner after accusations of stealing from the cash register. She believes the theft was done by the boyfriend of her work colleague Birdie (Chloe Webb).Depressed, Horgan returns to the home of Aunt Frances (Hershey) and discovers that a handyman (Gabriel Byrne) has been hired to fix the porch of the main house. Aunt Frances plans to host a gala event for a local politician. Irate over her husband's affair with Frances, the politician's wife (Laurie Metcalf) had driven into the porch and damaged it.Mackey, the handyman, is kind to Martha. He defends her from Birdie's boyfriend Getso (David Strathairn), a bully who insults her, and smashes the windshield on Getso's van. Martha becomes increasingly fond of Mackey as time goes on. Mack recognizes Martha's feelings but does not take advantage of her.One night Mack returns drunk to Martha's home, lets himself in and proceeds to have sex with the eager Martha on her sofa. He later sleeps with Martha's aunt, who is also drunk, despondent following the gala. Her lover politician had reconciled with his wife and left with her at the end of the evening.Mack plans to leave as soon as he finishes the porch job, feeling guilty about being unfaithful to Martha, but Martha urges him stay and tries to seduce him. He resists at first, then succumbs, then finally rejects her and throws her out. Despondent, Martha seeks her only friend, Birdie, for comfort; she goes alone to Birdie's home. There she finds Getso, who taunts and threatens her. Feeling cornered, Martha stabs Getso repeatedly with a sandwich knife. Martha stays and tries to comfort Getso as he dies from his wounds.Frances and Mack seek Martha at the police station where they are informed that she is pregnant and will likely be charged with murder and spend the rest of her life in jail. They find Martha overwhelmed with guilt over what she is done and resigned to her fate. Frances, already suspicious of Getso, informs Martha that she is pregnant and that all she has to do is tell the police Getso raped her and she will be released. Martha refuses because it would be a lie but doesn't reveal that Mack is the father of her child. Later, Mack again urges her to lie to save her life, but Martha instead insists that Mack must take care of their child.A final scene set in the near future reveals that Martha was remanded to a care facility where she is allowed to have day visits. Frances, Mack, and her child are shown taking her away for just such a visit.","language":"English","Critical reception":"Janet Maslin of The New York Times praised the film, especially Winger's acting and Gyllenhaal's direction. But, she found the film overall more akin to melodrama than drama:","box_office":"$1,497,222","cinematography":"Robert Elswit","production_company":"Amblin Entertainment Rollercoaster Productions","directed_by":"Stephen Gyllenhaal","release_dates":"December 3, 1993 (1993-12-03)|||||","produced_by":"Naomi Foner Kathleen Kennedy","starring":"Debra Winger Barbara Hershey Gabriel Byrne","running_time":"102 minutes","a_dangerous_woman":"Theatrical poster","music_by":"Carter Burwell","edited_by":"Angelo Corrao Harvey Rosenstock"}