{"Cast":"The film was shot using a nonprofessional cast of actors from the Villaverde area just south of Madrid.[1] Two members of the principal cast were arrested for separate criminal incidents during the filming, causing a stir in their Spanish homeland.","country":"Spain","Plot":"Pablo and Meca, two young urban delinquents, live from day to day by a series of robberies, mostly car thefts. During one such robbery, the car’s owner catches the two in the act. They roll up the windows and lock the doors to prevent intrusion. Helplessly trapped inside the troublesome vehicle by a mob that has now closed in around them, the pair forces a clear path through the crowd by brandishing a gun, before making their escape into the street. However, the stolen car only proves to be the first step in a more elaborate scheme. Spotting an attractive waitress named Ángela at a local cafeteria, Pablo is immediately captivated by the receptive (and equally restless) young woman, who soon becomes his lover, promising to stay together always. Pablo teaches Ángela to shoot a gun and, subsequently, inducts her into their gang after an afternoon of makeshift target shooting.The gang now consists of four members: Pablo, Meca, Ángela, and Sebastian or \"Sebas\". Sebas has joined the group to help in a series of more ambitious thefts, but he is initially unhappy with the presence of a girl in the band. Pablo, with Meca’s support, assures him that Ángela can hold her own.In the first robbery, that of a factory office on the outskirts of Madrid, Ángela, disguised as a boy with a mustache, serves as a lookout. In the second holdup, she shoots one of the guards who has fired at the gang’s car. At the conclusion of each of these robberies, Meca brings the getaway car, usually a stolen one, to a deserted area and set it ablaze. He stands by the side of the fire and enjoys viewing the flames.Alternately spending their idle time at discothèques and video arcades, acting on their impulsive whims, and succumbing to the intoxication of drug use, the emboldened quartet begins to stage an ever-escalating series of hold-ups throughout the city.Their share of the money from the two successful robberies enables Ángela and Pablo to buy a new apartment on the outskirts of the city. It is from this location that the gang plans a third robbery, the assault on a branch bank in one of the more congested middle-class neighborhoods of Madrid. During this robbery, Sebas kills one of the guards and is, in turn, gunned down outside the bank by a squad of police who have surrounded the area. Pablo, Meca, and Ángela manage to make a getaway, but Pablo has been seriously wounded and is bleeding profusely.Ángela brings him back to the apartment to nurse him while Meca disposes of the getaway car in the usual manner. However, the black cloud of smoke attracts a police helicopter and Meca is killed as he resists arrest. Understanding the seriousness of Pablo’s wound, Ángela calls a doctor who, upon arriving at the apartment, confirms the gravity of Pablo’s condition. He has been shot in the liver and must be brought to a hospital if he is to survive. Refusing, she offers him a large bundle of cash if he will treat Pablo right there. Taking the money in his black satchel, the physician promises to return shortly with instruments for surgery. Hours pass, but the doctor does not come back. Pablo, who remains unconscious, lies immobile on the bed. He stops breathing while Ángela sits in the darkened room staring at him. When she realizes he is dead, she fills her own duffel bag with the remaining money from the robbery and walks of the apartment. She disappears into the shadows of the approaching night walking towards the city.","language":"Spanish","Reception":"Deprisa, Deprisa was a critical and financial success, winning the Golden Bear at the 31st Berlin International Film Festival in 1981.[5] The film opened to excellent reviews in Madrid and was producer Elías Querejeta’s largest grossing production of the fifteen years of his collaboration with director Carlos Saura.[6] The film was also ensnared in controversy. In France and West Germany there was talk of its being banned due to the view that the film glorified violence and drug culture. Eventually, however, it was released with restrictive classifications in both countries.[6]In Spain, the conservative newspaper ABC criticized the film’s social realism and accused Saura of paying his cast in hard drugs.[7] Saura denied the accusation, saying that his cast of real life delinquents, including Jesús Arias who was on day release from prison, had a much better idea than he of where to get drugs.[8]","cinematography":"Teo Escamilla","directed_by":"Carlos Saura","Analysis":"Deprisa, Deprisa is a raw and sobering portrait of a generation at an existential crossroads, struggling to find mooring and direction in an uncertain climate of transformative, social revolution, as Spain emerged from the repression of fascism towards the liberalization of democracy.[2] It is this dichotomy that is reflected in the recurring image of passing trains that bisect the horizon - a perennial view from the public housing suburb outside the city where Pablo and Ángela live - a visual bifurcation that illustrates, not only their socioeconomic marginality, but also exposes their irreparable moral fissure.[2]The film captures the rootlessness of a morally stunted, lost generation that has come of age at a time of profound political and cultural transformation. The reckless, thrill-seeking, young anti-heroes of Carlos Saura's Deprisa, Deprisa also indirectly bear the scars of a life lived in the periphery - paradoxically insulated from the tyranny of institutional rule, but also divorced from the inured resilience engendered by its imposed sense of order.[2]Carlos Saura described Deprisa, Deprisa as a \"romantic\" film, in the historical sense of the word, as it expresses the outlook of the nineteenth century rebel who stood outside society and who rejected social norms.[3] The film's four young protagonists, rebelling against the constraints of social organization, are in fact, products of the very system that they reject and that has rejected them.[4]","release_dates":"February 1981 (1981-02) (BIFF)|2 April 1981 (1981-04-02) (Spain)||||","produced_by":"Elías Querejeta Carlos Saura","starring":"Berta Socuéllamos José Antonio Valdelomar Jesús Arias José María Hervás Roldán","running_time":"107 minutes","edited_by":"Jean Hamon","written_by":"Blanca Astiasu Carlos Saura"}