{"country":"United States","distributed_by":"The Orchard","language":"English","Reception":"Cartel Land received very positive reviews from critics. Review aggregator website Rotten Tomatoes reports a 90% rating based on 69 reviews. The site's consensus states: \"Raw, brutal, and bitter, Cartel Land offers a ground-level look at vigilante efforts to thwart organized crime at the Mexican-American border.\"[15] On Metacritic, the film has a 76 out of 100 rating based on 25 critics, indicating \"generally favorable reviews\".[16] Cartel Land appeared on over twenty critics' lists for best documentary and best film of 2015. It was listed as the #1 documentary of 2015 by Indiewire's The Playlist and by Paste Magazine, which also named Heineman as the best new filmmaker of the year.[17][18][19] On December 1, the film was selected as one of 15 shortlisted for the Academy Award for Best Documentary Feature.[20]","box_office":"$792,194[2]","cinematography":"Matthew Heineman|Matt Porwoll|","directed_by":"Matthew Heineman","production_companies":"The Documentary Group Our Time Projects","cartel_land":"Theatrical release poster","release_dates":"July 3, 2015 (2015-07-03)|||||","Production":"Heineman got the idea for the film after reading about Arizona Border Recon in an article in Rolling Stone magazine, and then his father sent him a Wall Street Journal article about José Manuel Mireles and the Autodefensas.[11][12] \"The minute I read that article, I knew I wanted to create a parallel story of vigilantes on both sides of the border. I wanted to know what happens when government institutions fail and citizens feel like they have to take the law into their own hands.\"[12]The film was shot in Michoacán, southwest Mexico and in Arizona.[13]He was inspired by The Square in the making of the film.[14]","produced_by":"Matthew Heineman|Tom Yellin|Kathryn Bigelow|Molly Thompson|","running_time":"100 minutes[1]","music_by":"Jackson Greenberg|H. Scott Salinas|","edited_by":"Matthew Hamachek|Matthew Heineman|Bradley J. Ross|Pax Wassermann|"}