{"country":"Italy","Plot summary":"Marco Tullio Sperelli is a professor of Italian language for children from the region of Liguria in northern Italy. Due to a failure of the Ministry of Education, he is transferred not to another northern town, but instead a similar-sounding town near Naples, in southern Italy. There he finds a school where the students, teachers and parents deal with the poverty of the south in a resigned and practical manner that he feels are unworthy of the morality, ethics and education children should learn. (For example, most of the children avoid school because they must work for a living to help support their families).Initially contemptuous of the attitudes in the south, and linking them to the underlying poverty, Marco Tullio requests a transfer back to the north. In the mean time, things are brought to a head by Raffaele, a student registered to his class who only shows up to recruit other children into the gangster lifestyle. Marco Tulio slaps Raffaele for threatening him with physical violence, and is then appalled when - instead of being scandalized by the event - the principal, children and even the boy's mother are actually encouraged by it because it means he may do what needs to be done to set the children on the right path. Still, Marco Tulio rescinds his request for a transfer. Eventually, Raffaele grows respect for Marco Tulio after he helps save Raffaele's mother, who has become ill and needs transport to the hospital.In the end, Marco Tulio is indeed transferred (it is implied that the principal, who does not like him for his arrogance, pushed the transfer through). As his train pulls away, he reads Raffaele's homework essay - the first homework he has handed in - which discusses the end of the world, and how many people will go to Hell, but some may yet enter Heaven. He ends with, \"as for me, let's hope I make it\" (hence the Italian version of the film title), implying that his improved behavior will not end with Marco Tulio's departure.","language":"Italian","cinematography":"Gianni Tafani","directed_by":"Lina Wertmüller","release_dates":"1992","produced_by":"Mario Cecchi Gori & Vittorio Cecchi Gori, Ciro Ippolito","starring":"Paolo Villaggio, Paolo Bonacelli, Isa Danieli","running_time":"95 min","music_by":"Carlo D'Angiò","External links":"","edited_by":"Pier Luigi Donardi","written_by":"Alessandro Bencivenni Leonardo Benvenuti Piero De Bernardi Domenico Saverni Lina Wertmüller Andrej Longo"}