{"based_on":"Mark of a Murderer 1997 Esquire article  by Michael McAlary[1]","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Vincent LaMarca (Robert De Niro) is a veteran New York City Police Department detective, whose criminal father had been executed for murder, after a child whom he had kidnapped was killed. Vincent has had to live with this stigma hanging over his own reputation, and history begins to repeat itself when his own son, Joey LaMarca (James Franco), a junkie, becomes involved in a drug-related killing. Joey suddenly comes to the attention of Vincent's current girlfriend, Michelle (Frances McDormand), who was unaware that he even had a son, and she can not understand why Vincent is unwilling to help him.Joey's girlfriend Gina (Eliza Dushku), who is struggling to stay sober for their infant son Angelo, comes into Vincent's life, asking him to save Joey. She later abandons the child, leaving him with Vincent. Joey gets deeper into trouble when the local drug enforcer, Spyder (William Forsythe), kills Vincent's cop partner Reg (George Dzundza). Reg had been helping Vincent to clear Joey's name, but Joey is blamed for his murder. As his fellow police officers search for Joey as a suspected \"cop killer,\" Vincent decides to set aside his self-imposed isolation, and to help save his son's life.Although the story is mostly set in the New York City oceanfront suburb of Long Beach, New York, on Long Island, whose municipal slogan actually is Civitas Ad Mare - Latin for \"The City by the Sea\"—actual location filming was done in Asbury Park, New Jersey. There is a disclaimer in the credits at the end of the film, which includes scenes set on a shabby, dilapidated-looking boardwalk and in a ruined and abandoned casino/arcade building—explicitly stating that it was not actually filmed in Long Beach .","language":"English","Reception":"City by the Sea received mixed reviews from critics. Rotten Tomatoes gave the film a 48% rating based on reviews from 140 critics.[3]","box_office":"$29,413,966[2]","cinematography":"Karl Walter Lindenlaub","production_company":"Franchise Pictures","directed_by":"Michael Caton-Jones","release_dates":"September 6, 2002 (2002-09-06)","produced_by":"Don Carmody Andrew Stevens Roger Paradiso Dan Klores","starring":"Robert De Niro Frances McDormand James Franco Eliza Dushku William Forsythe George Dzundza","running_time":"108 minutes","music_by":"John Murphy","edited_by":"Jim Clark","city_by_the_sea":"Promotional poster","written_by":"Ken Hixon","budget":"$40 million"}