{"country":"United States","distributed_by":"A24 FilmBuff","Plot":"In the 1970s, successful graphic designer and ladies' man Charles Swan III (Sheen) is dumped by his girlfriend Ivana (Winnick), and it throws his life into a tailspin.[1] He does not know whether he loves her or hates her or wants her back or never wants to see her again.[2] Along with his best friend, Kirby (Schwartzman) and his manager, Saul (Murray), Charles starts to suffer from nightmares, fever dreams of past relationships and hits rock bottom as he tries to recover from the recent breakup and tries to turn his life around.[3]","language":"English","Reception":"A Glimpse Inside the Mind of Charles Swan III received an overwhelmingly negative response from critics. Nathan Rabin of The A.V. Club gave the movie an F, saying that \"it isn't a movie so much as a feature-length perfume commercial for a Charlie Sheen signature cologne with gorgeous packaging and absolutely nothing inside.\"[6] The Dallas Observer said that the film \"might generously be described as cut-and-paste – or more accurately as 'throw stuff to the wall and see what sticks'\" and it was \"a clunker\".[7] The New York Daily News gave Charles Swan III one star out of five, saying that \"you want to swat it away\" and that \"maybe with this out of his [Coppola's] system, he'll think up something better.\"[8] TIME said that the film \"does not lead to a deeper understanding of Charlie Sheen. It does, however, demonstrate his compulsion for poor judgment and bad choices. But weren't we already convinced of that?\"[9]Lisa Schwarzbaum, reviewer for Entertainment Weekly, gave the film a C and a milder response, writing, \"The idea of this home-movie-with-higher-production-values directed by Roman Coppola is no less sweet for being unoriginal... The execution, on the other hand, is perilously self-absorbed, a private party involving friends, family, too many fantasy sequences, and an abundance of costume and set design to create a notion of a stylized L.A. spritzed with eau de Playboy.\"[10]The film holds a 16% \"rotten\" rating on Rotten Tomatoes, based on 51 reviews.[11] Metacritic gave the film a 28/100 \"generally unfavorable\" approval rating based on 21 reviews.[12]The film opened at #64 with US$12,000 in its limited release at two theaters the week of 8 February.[13] The following weekend, the weekend of 15 February, Charles Swan III expanded to 18 theaters and gained an 81.6% increase.[13] As of 11 July 2013, the domestic total of A Glimpse Inside the Mind of Charles Swan III is US$45,350, and in Russia the film has grossed $134,473, with an additional $26,999 in Mexico.[13]","box_office":"$210,565","a_glimpse_inside_the_mind_of_charles_swan_iii":"Movie poster","cinematography":"Nick Beal","production_company":"American Zoetrope The Directors Bureau","directed_by":"Roman Coppola","release_dates":"November 15, 2012 (2012-11-15) (Rome Film Festival)|February 8, 2013 (2013-02-08) (United States)||||","Production":"Filmed on location in Santa Clarita and Los Angeles, California.“It was surreal,” says the Chicago composer and performer Liam Hayes, about appearing in the forthcoming Roman Coppola film A Glimpse Inside the Mind of Charles Swan III. “I haven’t played many gigs on a beach with a Hammond organ, you know?” Hayes, who has made music under the name Plush since the early ’90s, was contacted by Coppola after the director became a huge fan. “I just got so absorbed by his music,” Coppola recently told GQ (UK) about Hayes and Plush.The result of this appreciation was Hayes and Coppola making a soundtrack out of Hayes’ music. “It evolved,” says Hayes. “When we met to discuss the project we talked about possible songs. We talked some more, added a few more songs, and I ended up doing the score.” Hayes also appears in the film performing the tune “So Much Music.” It isn’t his first time onscreen: In 2000 he appeared in High Fidelity performing his song \"Soaring and Boring\". His imaginative, atmospheric, cinematic style is well suited to movie soundtracks, and his Charles Swan soundtrack is made up of songs from Fed, Bright Penny and the forthcoming Korp Sole Roller along with music written specifically for the film.\"If you’ve ever been through a bad break-up, all you want to do is think about it and process. That’s kind of what the project is. A character study of a guy in this state of mind with Charlie as a very dynamic and imaginative character, so there’s a lot of fantasy sequences and crazy shit.\" – Roman Coppola","produced_by":"Roman Coppola Youree Henley","starring":"Charlie Sheen Katheryn Winnick Bill Murray Jason Schwartzman Patricia Arquette Mary Elizabeth Winstead Fabianne Therese","running_time":"86 minutes","music_by":"Liam Hayes Roger Neill","edited_by":"Robert Schafer","Release":"On January 8, 2013, the film was released through video on demand and was released in a limited release in the United States on February 8, 2013. It was released onto Blu-ray on May 14, 2013.[5]","written_by":"Roman Coppola"}