{"Cast":"[5] [6]","country":"Hong Kong","distributed_by":"Golden Harvest|Media Asia|","language":"Cantonese","box_office":"HK $35,469,408","cinematography":"Peter Ngor|Robert Thompson|Arthur Wong|Cheung Yiu Cho|","production_company":"Golden Harvest Goldenway Films Ltd.","directed_by":"Jackie Chan|Eric Tsang|","release_dates":"1986 (1986) (Japan)|21 January 1987 (1987-01-21) (Hong Kong)||||","Production":"Armour of God was filmed on location in parts of what was then Yugoslavia: Zagreb (Dolac Central Market), Upper town, Trnje (near the then-unfinished building of Croatian Radio Television), Croatia, and Predjama Castle near Postojna, Slovenia. Filming was also undertaken in Graz, Austria, France, Spain and Morocco. During filming of the opening sequence, one scene called for Jackie Chan to jump from a wall to a tree branch. The first take went as planned, but Chan insisted on re-shooting the scene. On his second attempt, the branch broke and he fell 5 metres to the ground below. His head hit a rock, cracking his skull and forcing a piece of bone up into his brain. Chan was flown to the hospital and was in surgery eight hours later. As a result, he now has a permanent hole in his head filled with a plastic plug and slight hearing loss in one ear.[2][3] Chan replaced Eric Tsang as director following the accident.[7] Footage of the accident is shown during the film's ending credits.While shooting the hot air balloon jump, Chan skydived out of a plane and landed on top of the balloon instead of jumping off a cliff as is seen in the film. For the shot of him jumping off the cliff, the crew rigged him up to a wire as he had no experience of BASE jumping.[3]","running_time":"97 minutes","Release":"Armour of God was released in mid-1986 in Japan.[8] It was released in Hong Kong on 21 January 1987.[9] The film grossed a total of HK$ 35,469,408 in Hong Kong.[9]","mandarin":"Lóng Xiōng Hǔ Dì","Plot":"Jackie, a.k.a. \"Asian Hawk\", is a former musician who becomes an adventurer and treasure hunter. After successfully stealing a sword from an African tribe, he has the weapon auctioned before it is won by May Bannon, the beautiful daughter of Count Bannon. He is reunited with his former band mate Alan, who seeks his help as his girlfriend Lorelei has been kidnapped by an evil religious cult as a means of acquiring Jackie's services. The cult possesses two pieces of a legendary armour called the \"Armour of God\", and they intend to have Jackie bring them the three remaining armour pieces, including the sword. Jackie and Alan strike a deal with Count Bannon, who is in possession of the three armour pieces: they will borrow the armour pieces for their quest to rescue Lorelei with a promise to complete the armour for the Count, on the condition that May accompanies them.Jackie, Alan and May travel into Northern Yugoslavia to find the cult's monastery. They infiltrate the hideout and secretly rescue Lorelei, unaware that the cult leaders have anticipated their arrival and brainwashed her to do their bidding. At May's rest home, Lorelei drugs Alan and has him steal the three armour pieces. Jackie sneaks back to the monastery and rescues his friends. As Alan and Lorelei make their escape, Jackie fends off against the cult members before discovering the Armour of God in a cave. Before he gets a chance to take the armour, he encounters the Grand Wizard, who unleashes his four female assassins on the adventurer. Exploiting their high-heeled shoes as their weakness, Jackie defeats the assassins in a grueling fight. Jackie is then surrounded by the rest of the Grand Wizard's men, but he reveals a vest filled with sticks of dynamite under his jacket, threatening to blow himself up with the monastery. After a couple of bluffs, he carelessly lights up the fuse and throws away the sticks of dynamite, running for his life as the monastery quickly begins to cave in, burying the entire cult and the Armour of God. He runs out of a cave and spots a hot-air balloon with Alan, Lorelei, and May aboard. In a daring move, Jackie does a base jump off the cave and lands on top of the balloon.","armour_of_god":"Hong Kong film poster","Reception":"The film received positive reviews,[10][11] with an approval rating of 78% on Rotten Tomatoes based on nine reviews.[12]In 2014, Time Out polled several film critics, directors, actors and stunt actors to list their top action films.[13] Armour of God was listed at 81st place on this list.[14]","cantonese":"Lung4 Hing1 Fu2 Dai6","traditional":"龍兄虎弟","Versions":"In the United States, Armour of God did not receive a theatrical release.[15] The film's sequel, Armour of God II: Operation Condor (1991), was released under the simplified title Operation Condor. Armour of God was subsequently released direct-to-video by Miramax Films, but the title was changed to Operation Condor 2: The Armor of the Gods, despite being the first film. A new musical score was created for this release, and a new English dub (with the participation of Chan).Nine minutes of cuts were made to the Miramax version, including:These same cuts were evident in the Spanish Region 2 release, but DVD releases in Hong Kong, Australia and the rest of Europe are uncut.","simplified":"龙兄虎弟","produced_by":"Leonard Ho|Chua Lam|","starring":"Jackie Chan|Alan Tam|Lola Forner|Rosamund Kwan|","music_by":"Michael Lai|Tang Siu Lam|","edited_by":"Peter Cheung","written_by":"Jackie Chan|John Sheppard|Eric Tsang|"}