{"country":"United States","distributed_by":"Oscilloscope Laboratories","screenplay_by":"Evan Glodell","story_by":"Evan Glodell","Plot":"Woodrow and Aiden migrate to Los Angeles from Wisconsin, constructing weapons and testing them out in empty lots. At a bar that hosts live acts, Woodrow volunteers to enter a cricket eating contest and meets Milly, who beats him in the contest. They exchange phone numbers, while Aiden talks to Milly's friend, Courtney.Woodrow and Milly decide they'll drive to Texas to eat at the scariest place Woodrow can think of. Woodrow gets in a fight with a local who disrespects Milly and is made sick by the day-old meatloaf. Returning to California, they begin dating each other, despite Milly's ambiguously hostile roommate Mike.Woodrow finds Aiden has completed the flamethrower, and they successfully test it out. Aiden is impressed with the motorcycle, which is the second part of their three pronged plan to create a Medusa Gang which will reign over their imagined vision of an apocalyptic future, and now they only lack a flame blowing muscle car. Tensions between friends rise, when Woodrow and Milly spend more time together than they do with their best friends.Woodrow becomes more controlling and jealous of Milly, who is annoyed by his behavior. His returns home early to find Milly having sex with Mike. Woodrow and Mike scuffle, then Woodrow drives away on his motorcycle and is hit by a car, leaving him with serious injuries. When Aiden picks him up from the hospital, he's utterly despondent and blames Milly. Woodrow lies in bed for days and when Courtney drops in , they have sex despite that Aiden is interested in Courtney.Aiden purchases a muscle car and works on turning it into the fire blowing Medusa, while Woodrow continues to have sex with Courtney. Mike comes to Woodrow's to retrieve Milly's personal items, but Aiden intercepts him and tells him not to come around again or he'll kill him. Woodrow takes Milly's personal items, puts them in a box, walks them over to her apartment court with his flame thrower strapped to his back, and lights them on fire in front of her door. This inspires Mike to seek revenge, and he finds the Medusa muscle car in front of Woodrow's house and breaks a window with a baseball bat. Aiden stops him from creating further damage by wrestling the bat from him, and when Mike tries to get the bat back Aiden strikes him in the head. When Mike stops moving, Aiden runs. Milly finds out what's happened and ambushes Woodrow, knocking him unconscious, and she and an unknown man tattoo Woodrow's cheeks, chin and upper-lip.Courtney confronts Milly about what she did to Woodrow and they fight, with Milly pulling a knife on her former best friend and forcing her to leave.When Woodrow wakes up and sees himself in the mirror he flies into a rage, tracks Milly down and has a screaming confrontation with her. When he tells her that he's been thinking of doing some \"sick shit\" to her all morning, she replies that she doesn't care and submits to his anger. This results in sex that turns increasingly violent, ending with Milly screaming out in pain.As Woodrow leaves Milly's house his shirt and hands are covered in blood, and he encounters Courtney in the street. She has a pistol and shoots herself in the head when he won't talk to her.The film then back-tracks to when Woodrow has put Milly's things in a box, and gives an alternate series of events, much less apocalyptic, where Woodrow and Aiden light Milly's things on fire at the beach and then leave town. The film flashes forward again to Woodrow in the street, where Milly has caught up with him and they hold each other as credits roll.","Cinematography":"Reviewers noted the film's distinctive look,[7][8] giving credit to cinematographer Joel Hodge's shooting style and the one-of-a-kind camera designed and built by Evan Glodell, who combined vintage camera parts, bellows and Russian lenses[clarification needed], around a Silicon Imaging SI-2K Mini Digital Cinema camera.[9]Hodge was nominated for the 2012 Independent Spirit Award for Best Cinematography, losing to the significantly bigger budget The Artist. The award was announced the day before The Artist won the Academy Award for Best Picture.[5][10] Eric Kohn of IndieWire criticized the inclusion of The Artist into awards that should recognize lesser known films, itemizing \"innovative cinematographer\" Hodge as one of the people harmed by the decision.[11] Screen Junkies also included both cinematographers among three it named Best Cinematographers for 2012.[12]","language":"English","Effects":"Glodell and crew were also inventive in the effects they used in the filming. Glodell constructed the flame thrower central to the theme, and modified the Medusa car. To get a propane tank explosion, live bullets were fired into the tank, narrowly missing engineer/editor Jon Keevil's head. It has been called one of the most dangerous film shoots in history.[13]","box_office":"$172,935[2]","bellflower":"Teaser poster","cinematography":"Joel Hodge","production_company":"Coatwolf Productions","directed_by":"Evan Glodell","release_dates":"January 21, 2011 (2011-01-21) (Sundance)[1]|||||","Distribution":"On January 27, 2011, six days after the premiere at Sundance, Oscilloscope Laboratories announced it had acquired English-language territory rights to the film. Bellflower was released in theaters August 5, 2011.[14]In non-English-speaking territories, Visit Films is the international sales agent and distributor.[15]","produced_by":"Vincent Grashaw Evan Glodell","starring":"Evan Glodell Jessie Wiseman Tyler Dawson Rebekah Brandes","running_time":"106 minutes","edited_by":"Evan Glodell Joel Hodge Jonathan Keevil Vincent Grashaw"}