{"country":"United States","distributed_by":"20th Century Fox (North America) DreamWorks Pictures (International)","Plot":"In December 1995, Chuck Noland (Tom Hanks) is a time-obsessed systems engineer, who travels worldwide resolving productivity problems at FedEx depots. He is in a long-term relationship with Kelly Frears (Helen Hunt), with whom he lives in Memphis, Tennessee. Although the couple wants to get married, Chuck's busy schedule interferes with their relationship. A Christmas with relatives is interrupted when Chuck is summoned to resolve a problem in Malaysia. While flying through a violent storm, his plane crashes into the Pacific Ocean. Chuck escapes the sinking plane and is saved by an inflatable life-raft but loses the raft's emergency locator transmitter. He clings to the life-raft, loses consciousness, and floats all night before being washed up on an island. After he awakens, he explores the island and soon discovers that it is uninhabited.Several FedEx packages from the crashed plane wash up on the shore, as well as the corpse of one of the pilots, which he buries. He initially tries to signal for rescue and makes an escape attempt with the remnants of his life-raft but cannot pass the powerful surf and the coral reefs surrounding the island. He searches for food, water, shelter, and opens the packages, finding a number of potentially useful items. He leaves one package, with a pair of angel wings stenciled on it, unopened. During a first attempt to make fire, Chuck receives a deep wound to his hand. In anger and pain, he throws several objects, including a Wilson volleyball from one of the packages. A short time later he draws a face in the bloody hand print on the ball, names it Wilson, and begins talking to it. One night, Chuck calculates that in order for the rescue workers to find the site of the plane crash, they'll have to search an area twice the size of Texas, making him doubtful he will ever be found.Four years later, Chuck is dramatically thinner, bearded, with longer hair, and wearing a loincloth. He has become adept at spearing fish and making fires. He also has regular conversations and arguments with Wilson, his volleyball friend. A large section from a portable toilet washes up on the island; Chuck uses it as a sail in the construction of a raft. After spending some time building and stocking the raft and deciding when the weather conditions will be optimal (using an analemma he has created in his cave to monitor the time of year), he launches, using the sail to overcome the powerful surf. After some time on the ocean, a storm nearly tears his raft apart. The following day, Wilson falls from the raft and is cast away into the ocean, leaving Chuck overwhelmed by loneliness. Later, a passing cargo ship finds him, drifting.Upon returning to civilization, Chuck learns that he has long been given up for dead; his family and acquaintances have held a funeral, and Kelly has since married Chuck's one-time endodontist and has a daughter. After reuniting with Kelly, the pair profess their love for each other but, realizing they can't be together because of her commitment to her new family (and also remembering that Chuck wasn't there for her last time), they sadly part. Kelly gives Chuck the keys to the car they once shared.Sometime later, after buying a new volleyball, Chuck travels to Canadian, Texas to return the unopened FedEx package with the angel wings to its sender, a woman named Bettina Peterson. The house at the address is empty, so he leaves the package at the door with a note saying that the package saved his life. He departs and stops at a remote crossroads. A friendly woman (Lari White) passing by in a pickup truck stops to explain where each road leads. As she drives away, Chuck notices the angel wings on the back of her truck is identical to the one on the parcel. As Chuck is left standing at the crossroads he looks down each road and smiles looking down the road in the direction that the truck was heading, thinking of the choices that lie before him and what they may bring.","In popular culture":"A FedEx commercial during the 2003 Super Bowl parodied the final scene of the film, in which Chuck returns a package to its sender. In this version, the woman answers the door, and when Chuck asks what was in the box, the woman replies: \"Just a satellite phone, GPS locator, fishing rod, water purifier, and some seeds. Just silly stuff.\"[25]Media executive Lloyd Braun of ABC Studios first suggested the idea of a Cast Away-type television series at a dinner party in 2003.[26] Thom Sherman later pitched the idea for Cast Away – The Series, but never developed the idea.[26] The concept was later developed and pitched with the title Nowhere, which later turned into the ABC show Lost.[26]In the episode \"The Odyssey\" in the first season of Arrow, after missing their escape plane and being stranded on the island of Lian Yu, Oliver Queen says to Slade Wilson \"I'm stranded on an island, and my only friend is named Wilson\".In the episode \"Night on Haunted Mountain\" of Scooby-Doo! Mystery Incorporated, the soccer team's lucky soccer ball is decorated with a face very similar to Wilson's.In the film Madagascar following the accidental burning down of their signal pyre, Alex turns to a basketball looking similar to Wilson and says \"Shut up, Spalding!\"In the episode \"Kimmy Goes on a Date\" of Unbreakable Kimmy Schmidt, Kimmy tells a senile Grant Belding that \"It's not enough just to say things out loud. I need someone I can talk with,\" and that he \"may as well be that old volleyball I drew a face on.\" This sparks in Grant a moment of lucidity, as he responds with, \"Wilson, from Cast Away?\"","language":"English","Reception":"Cast Away received critical acclaim and has a rating of 90% on Rotten Tomatoes based on 154 reviews with an average rating of 7.4 out of 10 with the consensus \"Flawed but fascinating, Cast Away offers an intelligent script, some of Robert Zemeckis' most mature directing, and a showcase performance from Tom Hanks.\"[16] The film also has a score of 73 on Metacritic based on 32 reviews, indicating generally favorable reviews.[17]Cast Away opened in 2,774 theaters in North America and grossed $28,883,406 with an average of $10,412 per theater on its opening weekend.[18] For the four-day Christmas long holiday weekend, it took in a total of $39,852,075.[19] The film kept performing well and ended up earning $233,632,142 domestically and $196,000,000 internationally for a total of $429,632,142, well above its production budget of $90 million.[1]","box_office":"$429.6 million [1]","cinematography":"Don Burgess","production_company":"ImageMovers Playtone","directed_by":"Robert Zemeckis","release_dates":"December 22, 2000 (2000-12-22)|||||","Production":"The film's shooting was between the years 1998-2000, but was not shot consecutively. Hanks gained 50 pounds (23 kg) during pre-production to make him look like a pudgy, middle-aged man. After a majority of the film was shot, production was halted for a year so that he could lose the weight and grow his hair and beard to look like he had been living on the island for years. During the year-long hiatus, Zemeckis used the same film crew to make another film, What Lies Beneath.[2]Cast Away was filmed on Monuriki, one of the Mamanuca Islands in Fiji.[3] It is in a subgroup of the Mamanuca archipelago, which is sited off the coast of Viti Levu, Fiji's largest island. The island became a tourist attraction following the film's release. After Chuck's return, it is identified by Kelly as being \"about 600 miles south of the Cook Islands,\" but there is actually no land between the southernmost Cook Islands of Mangaia and Antarctica.The film essentially begins and ends in the same location, on the Arrington Ranch in the Texas Panhandle south of the city of Canadian, Texas.[4]The film's minimal score was composed by Alan Silvestri for which he won a Grammy Award in 2002. The film's soundtrack is most notable for its lack of score and creature sound effects (such as bird song or insect sounds) while Chuck is on the island, which is intended to reinforce the feeling of isolation.[5] Cast Away contains no original musical score until Chuck escapes the island. However, there is a Russian choral piece heard near the start of the film that was not composed or even recorded by Silvestri, so it does not appear on the film's soundtrack list. It is a traditional Russian song written by Lev Knipper called \"Oh, My Field\" (\"Polyushko, Polye\") and it is available on various collections of Red Army hymns. The tracks in Silvestri's score are as follows:The official soundtrack CD is an anthology of musical pieces from all films up to that point directed by Zemeckis and scored by Silvestri. The only track from Cast Away itself is the theme from the end credits.[6]FedEx paid no money for product placement in the film.[7] However, they provided access to their facilities (Memphis, Los Angeles and Moscow) as well as airplanes, trucks, uniforms, and logistical support. A team of FedEx marketers oversaw production through more than two years of filming.[8] FedEx CEO Fred Smith made an appearance as himself for the scene where Chuck is welcomed back, which was filmed on location at FedEx's home facilities in Memphis, Tennessee. The idea of a story based on a FedEx plane crashing gave the company \"a heart attack at first,\" but the overall story was seen as positive and the company saw an increase in brand awareness in Asia and Europe following the film's release.[9]In the film, Wilson the volleyball serves as Chuck Noland's personified friend and only companion during the four years that Noland spends alone on a deserted island.[10][11][12] The character was created by screenwriter William Broyles, Jr.. While researching for the film, he consulted with professional survival experts, and then chose to deliberately strand himself for one week on an isolated beach in the Gulf of California, to force himself to search for water and food, and obtain his own shelter. During this time, a volleyball washed up on shore. This was the inspiration for the film's inanimate companion. From a theatrical point of view, Wilson also serves to realistically allow dialogue in a one-person-only situation.[13][14]One of the original volleyball props was sold at auction after release of the film for $18,500 to the ex-CEO of FedEx Office, Ken May. At the time of the film's release, Wilson launched its own joint promotion centered on the fact that one of its products was \"co-starring\" with Tom Hanks. Wilson manufactured a volleyball with a reproduction of the bloodied handprint face on one side. It was sold for a limited time during the film's initial release and continues to be offered on the company's website.[15]","produced_by":"Tom Hanks Jack Rapke Steve Starkey Robert Zemeckis","starring":"Tom Hanks Wilson the Volleyball Helen Hunt Nick Searcy","running_time":"143 minutes","music_by":"Alan Silvestri","cast_away":"Theatrical release poster","edited_by":"Arthur Schmidt","written_by":"William Broyles, Jr.","budget":"$90 million [1]"}