{"country":"Netherlands Belgium","Plot":"In the Netherlands of the 1920s, Dreverhaven (Decleir), a dreaded bailiff, is found dead, with a knife sticking out of his stomach. The obvious suspect is Jacob Willem Katadreuffe (Van Huêt), an ambitious young lawyer who worked his way up from poverty, always managing to overcome Dreverhaven's personal attacks against him. Katadreuffe was seen leaving Dreverhaven's office on the afternoon of the murder. He is arrested and taken to police headquarters, where he reflects back on the story of his long relationship with Dreverhaven, who, police learn, is also Katadreuffe's father.The story begins when Katadreuffe's taciturn mother, Joba (played by Schuurman), worked as a housekeeper for Dreverhaven. During that time, they had sex only once (it is implied that the encounter was forced upon Joba). She becomes pregnant and leaves her employer to make a living for herself and her son. Time and again, she rejects Dreverhaven's offers by mail of money and marriage.Even as a child, Katadreuffe finds that his path crosses with Dreverhaven, often with dire consequences. When he is arrested for becoming involved in a boyish theft and tells the police that Dreverhaven is his father, Dreverhaven refuses to recognize him as his son. When, as a young man, he unwittingly takes a loan from a bank that Dreverhaven owns to purchase a failed cigar store, Dreverhaven sues him to win the money back and force him into bankruptcy. Still, Katadreuffe manages to pay back the debt, finding a clerical position in the law firm retained to pursue him for his cigar-store debt. He manages to secure this job, even though most of his education is derived from reading an incomplete English-language encyclopedia that he finds as a boy in his mother's apartment; studying this set, he manages to teach himself English, which turns out to be a valuable talent in the eyes of his employers.After paying back the cigar-store debt, Katadreuffe immediately seeks a second loan from Dreverhaven, so that he can finance his education and legal studies and, ultimately, take and pass the bar examination. Dreverhaven agrees, on the condition that he can call back the loan at any time. Despite the bailiff's efforts to hinder his son, Katadreuffe passes his bar examination and qualifies as a lawyer. On the afternoon when his firm holds a celebration of his becoming a lawyer (the day with which the film begins, the day of the murder), Katadreuffe storms into Dreverhaven's office to confront his lifelong tormentor, the bailiff. Katadreuffe reacts with rage to Dreverhaven's congratulations, and his offer of a handshake, and, though he at first turns to leave, he runs toward Dreverhaven and attempts to attack him. After a bloody and angry brawl, Katadreuffe is witnessed leaving the bailiff's office.However, the police discover that Katadreuffe left Dreverhaven at 5:00 p.m., though an examination of the bailiff's body reveals that Dreverhaven died at 11:00 p.m. The police finally reveal to Katadreuffe that Dreverhaven actually committed suicide. After Katadreuffe is cleared, a police official hands him a document, left by Dreverhaven's lawyer, that turns out to be the bailiff's will, which leaves all of his considerable wealth to Katadreuffe. The will is signed \"Vader\" (Father).","language":"Dutch","box_office":"$713,413","cinematography":"Rogier Stoffers","directed_by":"Mike van Diem","character":"German film poster of Character","release_dates":"17 April 1997 (1997-04-17)|||||","Production":"Most scenes of the film were shot in Wrocław, Poland.","produced_by":"Laurens Geels","starring":"Jan Decleir Fedja van Huêt Victor Löw","running_time":"122 minutes","music_by":"Paleis van Boem","edited_by":"Jessica de Koning","written_by":"Ferdinand Bordewijk (novel) Mike van Diem","budget":"$4.5 million"}