{"david_and_lisa":"Theatrical release poster","based_on":"Jordi, Lisa and David  by Theodore Isaac Rubin","Cast":"This was the film debut of both Janet Margolin and Karen Gorney (who, billed as Karen Lynn Gorney, later became well known for her leading role in Saturday Night Fever).","country":"United States","distributed_by":"Continental Distributing","screenplay_by":"Eleanor Perry","Plot":"The film starts as David Clemens (Keir Dullea) is brought to a residential treatment center by his apparently caring mother (Neva Patterson). He becomes very upset when one of the residents brushes his hand, as he believes touches can kill him. Cold and distant, he mainly concentrates on his studies, especially that of clocks, with which he appears to be obsessed. It is later revealed that he has a recurring dream in which he murders people by means of a giant clock.He meets Lisa Brandt (Janet Margolin), a girl who has two personalities: one of them, Lisa, can only speak in rhymes, while the other, Muriel, cannot speak, but only write. David befriends her by talking to her in rhymes. Over time he begins to open up to his psychiatrist, Dr. Alan Swinford (Howard Da Silva) and also becomes friendly with another resident, Simon (Mathew Anden), provoking Lisa's jealousy. Following an argument when his mother visits, David's parents decide he should leave the place. He returns to his parents' house, but after a short time, runs away to the treatment center, where he is allowed to stay.One day Lisa realizes that she is both Lisa and Muriel and that they are the same person. After this breakthrough, she seeks out David, but he is busy listening to Simon play a Bach piece on the piano. Lisa turns on the metronome, interrupting Simon's playing and provoking David's anger. Then, Lisa runs away from the center and takes the train into Center City, Philadelphia, unnoticed. David and the staff fruitlessly search for her until the next morning, when David realizes she might have returned to the Philadelphia Museum of Art, where she had once embraced a statue of a mother and child. David and Dr. Swinford rush to the museum, where David finds Lisa on the museum steps. Upon seeing David, Lisa appears to be cured and speaks to him in prose. David, overcoming his own fear of touch for the first time, allows her to hold his hand on their return trip.","language":"English","Reception":"David and Lisa received positive reviews from critics. Review aggregator website Rotten Tomatoes reports that 80% of 10 reviews were positive, with an average rating of 7.1/10.[3]","box_office":"$2.3 million (rentals)[2]","Remake":"In 1998, the film was remade into a made-for-TV film that premiered on ABC on November 1, 1998. Produced by Oprah Winfrey and directed by Lloyd Kramer, the film starred Lukas Haas as David, Brittany Murphy as Lisa, and Sidney Poitier as Dr. Swinford with a supporting cast featuring Debi Mazar, Allison Janney, Kim Murphy, Giuseppe Andrews, Vicellous Reon Shannon, Gene Wolande, Kimiko Gelman, and Ty Hodges. The scenes were shifted to the Los Angeles area, including the Museum of Natural History, at Exposition artk,, and Venice Beach.","cinematography":"Leonard Hirschfield","production_company":"Vision Associates Productions","directed_by":"Frank Perry","Play adaptation":"In 1967, the film was adapted into a stage play, but only ran for a short period.The play begins with David Clemens and his mother preparing to leave to bring David to \"school\". We later learn this is a school for children with mental and psychological issues. David's mother is overprotective and overbearing, and it shows. At the station, a porter touches David's arm, and we learn that David is afraid to be touched.We meet a variety of teachers and other students, particularly Dr. Alan Swinford, the head psychologist, and are introduced to the school. We learn that David has an obsession with clocks, and also with death. We are also introduced to the other title character, Lisa, who has a split personality: one who will only speak in rhymes and the other who will not speak, but will only write or draw her thoughts. Over time, David and Lisa befriend each other, until midway through the play, after an embittering visit, David's parents take him away from the school.David eventually runs away from his home and comes back to the school, where he is allowed to stay. One day, however, Lisa is annoying David as he listens to another child playing the piano. David becomes cross and shouts at her, and Lisa runs away from the school. David and the head psychologist, Dr. Alan Swinford, go out in search of her, and arrive just in time to save Lisa from the ravages of two boys in a city park. David and Lisa are both relieved that the other is there for them, and somehow Lisa is cured of her two personalities and becomes truly herself, speaking \"plain straight\" to David for the first time. David extends his hand and asks her to take it, conquering his fear of being touched, and they walk off together, hand in hand.","release_dates":"December 26, 1962 (1962-12-26)|||||","produced_by":"Paul M. Heller","starring":"Keir Dullea|Janet Margolin|Howard Da Silva|","running_time":"93 minutes[1]","music_by":"Mark Lawrence","edited_by":"Irving Oshman","budget":"$185,000"}