{"country":"United States","Awards and nominations":"American Film Institute lists","distributed_by":"Universal Pictures","Plot":"Mookie (Spike Lee) is a 25-year-old black man living in Bedford-Stuyvesant, Brooklyn with his sister, Jade (Joie Lee). He and his girlfriend Tina (Rosie Perez) have a son. He's a pizza delivery man at the local pizzeria, but lacks ambition. Sal (Danny Aiello), the pizzeria's Italian-American owner, has been in the neighborhood for twenty-five years. His older son Pino (John Turturro) intensely dislikes blacks, and does not get along with Mookie. Pino is at odds with his younger brother Vito (Richard Edson), who is friendly with Mookie.The neighborhood is full of distinct personalities, including Da Mayor (Ossie Davis), a friendly local drunk; Mother Sister (Ruby Dee), who watches the neighborhood from her brownstone; Radio Raheem (Bill Nunn), who blasts Public Enemy on his boombox wherever he goes; and Smiley (Roger Guenveur Smith), a mentally disabled man, who meanders around the neighborhood trying to sell hand-colored pictures of Malcolm X and Martin Luther King, Jr.While at Sal's, Mookie's trouble-making b-boyish friend, Buggin' Out (Giancarlo Esposito), questions Sal about his \"Wall of Fame\", a wall decorated with photos of famous Italian-Americans. Buggin' Out demands that Sal put up pictures of black celebrities since Sal's pizzeria is in a black neighborhood. Sal replies that he doesn't need to feature anyone but Italians as it is his restaurant. Buggin' Out attempts to start a protest over the Wall of Fame. Only Radio Raheem and Smiley support him.During the day, the heat and tensions begin to rise. The local teenagers open a fire hydrant and douse the street, before police officers intervene. Mookie and Pino begin arguing over race, which leads to a series of scenes in which the characters spew racial insults into the camera. Pino and Sal talk about the neighborhood, with Pino expressing his hatred, and Sal insisting that he is not leaving. Sal almost fires Mookie, but Jade intervenes, before Mookie confronts her for being too close to Sal.That night, Buggin' Out, Radio Raheem, and Smiley march into Sal's and demand that Sal change the Wall of Fame. Raheem's boombox is blaring and Sal demands that they turn the radio off, but they refuse. Buggin' Out says they're closing down the pizzeria for good until they change the Wall of Fame. Sal, in a fit of frustration, tells him he will \"tear his nigger ass,\" then destroys the boombox with a baseball bat. Raheem attacks Sal, leading to a huge violent fight that spills out into the street, attracting a crowd. While Radio Raheem is choking Sal, the police arrive. They break up the fight and apprehend Radio Raheem and Buggin' Out. One officer refuses to release his chokehold on Raheem, killing him. Realizing they have killed Raheem in front of onlookers, the officers place his body in the back of a squad car, and drive off, leaving Sal, Pino, and Vito unprotected.The onlookers, enraged about Radio Raheem's death, blame Sal and his sons. Mookie grabs a trash can and throws it through the window of Sal's pizzeria, sparking the crowd to rush into the restaurant and destroy it, with Smiley finally setting it on fire. Da Mayor pulls Sal, Pino, and Vito out of the mob's way. Firemen and riot patrols arrive to put out the fire and disperse the crowd. After police issue a warning, the firefighters turn their hoses on the rioters, leading to more fighting and arrests. Mookie and Jade sit on the curb, watching in disbelief. Smiley wanders back into the smoldering building and hangs one of his pictures on what is left of Sal's Wall of Fame.The next day, after having an argument with Tina, Mookie returns to Sal, who feels that Mookie betrayed him. Mookie demands his weekly pay, leading to an argument, before they cautiously reconcile, and Sal finally pays him. Mister Señor Love Daddy (Samuel L. Jackson), a local DJ, dedicates a song to Raheem.The film ends with two quotations expressing opposite views about violence, one from Martin Luther King and one from Malcolm X, before fading to a photograph of them shaking hands.","language":"English","do_the_right_thing":"Theatrical release poster","Critical reception":"Do the Right Thing was met with acclaim. On Rotten Tomatoes, the film has a rating of 93%, based on 67 reviews, with an average rating of 8.9/10. The site's critical consensus reads, \"Smart, vibrant and urgent without being didactic, Do the Right Thing is one of Spike Lee's most fully realized efforts -- and one of the most important films of the 1980s.\"[17] On Metacritic, the film has a score of 91 out of 100, based on 15 critics, indicating \"universal acclaim\", and placing it as the 68th highest film of all-time on the site.[18]Both Gene Siskel and Roger Ebert ranked the film as the best of 1989 and later ranked it as one of the top 10 films of the decade (#6 for Siskel and #4 for Ebert).[19] Ebert later added the film to his list of The Great Movies.[20] According to online film resource They Shoot Pictures, Don't They?, Do the Right Thing is the most acclaimed film of 1989.[21]","box_office":"$37.3 million[3]","cinematography":"Ernest Dickerson","production_company":"40 Acres and a Mule Filmworks","directed_by":"Spike Lee","Soundtrack":"The film's score (composed and partially performed by jazz musician Bill Lee, father of Spike Lee) and soundtrack were both released in July 1989 on Columbia Records and Motown Records, respectively. The soundtrack was successful, reaching the number eleven spot on the Top R&B/Hip-Hop Albums chart, and peaking at sixty-eight on the Billboard 200.[23] On the Hot R&B/Hip-Hop Singles & Tracks chart, the Perri track \"Feel So Good\" reached the fifty-first spot, while Public Enemy's \"Fight the Power\" reached number twenty, and Guy's \"My Fantasy\" went all the way to the top spot. \"My Fantasy\" also reached number six on the Hot Dance Music/Maxi-Singles Sales chart, and sixty-two on Billboard's Hot 100. \"Fight the Power\" also charted high on the Hot Dance Music chart, peaking at number three, and topped the Hot Rap Singles chart.[24][25]","Controversies":"The film was released to protests from many reviewers, and it was openly stated in several newspapers that the film could incite black audiences to riot.[12] Lee criticized white reviewers for implying that black audiences were incapable of restraining themselves while watching a fictional motion picture.[13]One of many questions at the end of the film is whether Mookie \"does the right thing\" when he throws the garbage can through the window, thus inciting the riot that destroys Sal's pizzeria. Critics have seen Mookie's action both as an action that saves Sal's life, by redirecting the crowd's anger away from Sal to his property, and as an \"irresponsible encouragement to enact violence\".[14] The question is directly raised by the contradictory quotations that end the film, one advocating nonviolence, the other advocating violent self-defense in response to oppression.[14]Spike Lee has remarked that he has only ever been asked by white viewers whether Mookie did the right thing; black viewers do not ask the question.[15] Lee believes the key point is that Mookie was angry at the death of Radio Raheem, and that viewers who question the riot's justification are implicitly failing to see the difference between property and the life of a black man.[13]In June 2006, Entertainment Weekly magazine placed Do the Right Thing at No. 22 on its list of The 25 Most Controversial Movies Ever.[16]","release_dates":"May 19, 1989 (1989-05-19) (Cannes)|July 21, 1989 (1989-07-21) (United States)||||","Production":"Spike Lee wrote the screenplay in two weeks.[9] The original script of Do the Right Thing ends with a stronger reconciliation between Mookie and Sal. Sal's comments to Mookie mirror Da Mayor's earlier comments in the film and hint at some common ground and perhaps Sal's understanding of why Mookie was motivated to destroy his restaurant. It is unclear why Lee changed the ending.[10]The film was shot entirely on Stuyvesant Avenue between Quincy Street and Lexington Avenue in the Bedford-Stuyvesant neighborhood of Brooklyn. The street's color scheme was heavily altered by the production designer, who used a great deal of red and orange paint in order to help convey the sense of a heatwave.Spike Lee campaigned for Robert De Niro as Sal the pizzeria owner, but De Niro had to decline due to prior commitments. The character of Smiley was not in the original script; he was created by Roger Guenveur Smith, who was pestering Spike Lee for a role in the film.[11] Four of the cast members were stand-up comedians: Martin Lawrence, Steve Park, Steve White, and Robin Harris.","produced_by":"Spike Lee","starring":"Danny Aiello|Ossie Davis|Ruby Dee|Richard Edson|Giancarlo Esposito|Spike Lee|Bill Nunn|John Turturro|John Savage|","running_time":"120 minutes[1]","music_by":"Bill Lee","External links":"","edited_by":"Barry Alexander Brown","written_by":"Spike Lee","budget":"$6 million[2]"}