{"country":"United States|United Kingdom|Japan|","distributed_by":"Shochiku Co., Ltd.","Plot":"Takeshi Kitano plays Yamamoto, a lone yakuza officer. Defeated in a war with a rival family, his boss killed, he heads to Los Angeles, California.As time passes, Yamamoto and his new gang emerge as a powerful force, gradually expanding their turf to an extent that they must confront the Mafia. The Mafia's attacks are ruthless, and soon Yamamoto and his gang are driven into a disastrous situation of no return as they are hunted down one by one.","language":"Japanese English","Reception":"At the time of its release, Brother was hyped as Kitano's vehicle for breaking into the United States film market. The film has a 47% rating on Rotten Tomatoes based on 73 reviews.[7] Roger Ebert, who has praised all of Kitano's films he has seen, complimented Kitano in his review but ultimately rated the film two out of four stars, writing that \"Brother is a typical Kitano film in many ways, but not one of his best ones.\"[8]On his side, Kitano stated in an interview that he was not fully satisfied with the final result of Brother and that he regretted his \"Hollywood\" adventure which was supposed to bring him a broader audience with a higher exposure. Kitano said he had no intention of shooting outside Japan again.[this quote needs a citation]","box_office":"$15.2 million[1]","directed_by":"Takeshi Kitano","release_dates":"July 20, 2001 (2001-07-20)|||||","Production":"Impressed with Europeans' interest in yakuza, Kitano wrote what he described as an old-fashioned yakuza film. To greater contrast the character against more familiar elements, he set it in a foreign country, choosing Los Angeles as a place-holder. When producer Jeremy Thomas asked Kitano if he was interested in foreign productions, Kitano told him about the script. Thomas promised him complete creative control, which Kitano said he got. Commenting on the differing styles of filmmaking, Kitano said that American productions are more focused on the business side and are less sentimental. Kitano cited their strong pride in their professionalism as positive aspect.[5]","produced_by":"Masayuki Mori|Jeremy Thomas|","starring":"Takeshi Kitano|Omar Epps|Claude Maki|Tetsuya Watari|","running_time":"114 minutes","music_by":"Joe Hisaishi","edited_by":"Takeshi Kitano","Release":"Several scenes were censored for the U.S. release.[6]","written_by":"Takeshi Kitano"}