{"country":"United States","distributed_by":"Paramount Pictures (United States) DreamWorks Pictures (International)","Plot":"On May 10, 1998, teenage amateur astronomer Leo Biederman[5] discovers an unusual object near the stars Mizar and Alcor at a star party in Richmond, Virginia with his school's astronomy club. His teacher alerts astronomer Dr. Marcus Wolf, who realizes that the object is a comet on a collision course with Earth. Wolf dies in a car accident before he can alert the world.One year later, MSNBC journalist Jenny Lerner investigates the sudden resignation of Secretary of the Treasury Alan Rittenhouse and his connection to \"Ellie\", supposedly a mistress. After interviewing Rittenhouse, she is intercepted by the FBI and brought before President Tom Beck. Lerner realizes that Ellie is not a mistress but an acronym: \"E.L.E.\", for \"Extinction-Level Event\". Due to Lerner's investigation, President Beck makes an announcement earlier than planned: the comet named Wolf-Biederman (named after Wolf and Biederman, mistakenly assuming Leo Biederman was killed along with Professor Wolf) is headed for Earth. It is 7 miles (11 km) long, large enough to cause a mass extinction, and possibly wipe out humanity, if it hits the Earth. He also reveals that the United States and Russia have been constructing an Orion spacecraft called Messiah in orbit in order to transport a team led by Oren Monash and including veteran astronaut Spurgeon Tanner to the comet, so that its path toward Earth may be diverted using nuclear weapons.After landing on the comet, the crew members plant nuclear bombs beneath the surface, but are delayed and caught in outgassing explosions when sunlight hits the comet surface. While fleeing to the space vehicle, Monash is blinded due to direct unfiltered sunlight and suffers severe facial burns, and Gus Partenza is lost, ejected from the surface by an outflow of gas. When the bombs detonate, the ship is damaged from the blast, and the team loses contact with Earth. President Beck announces the crew's failure; the nukes did not divert the comet, but split it into two smaller rocks nicknamed \"Biederman\" (1.5 miles (2.4 km) long) and \"Wolf\" (6 miles (9.7 km) long), both heading for Earth.After President Beck announces the Messiah crew's failure, he declares martial law and reveals that governments worldwide have been building underground shelters. The United States' shelter is in the limestone caves of Missouri. The US government conducts a lottery to select 800,000 Americans under age 50 to join 200,000 pre-selected individuals as well as a massive supply of food, genetically viable populations of significant animals, and the seeds of every species of plant. Lerner and the Biederman family are pre-selected, but Leo's girlfriend Sarah Hotchner and her family are not. Leo marries Sarah to save her family, but they are left off the evacuee list. Sarah refuses to leave without her parents.A last-ditch effort to use Earth's missile-borne nuclear weapons to deflect the comets fails. President Beck reports on this and reveals the final trajectories of the comets. The Biederman fragment will impact the Atlantic Ocean off Cape Hatteras, which will cause a tsunami up to 3,500 feet (1,100 m) high. The people who would be in its way are advised to evacuate. The Wolf fragment will impact western Canada, creating a cloud of dust that will block out the sun for two years, killing all life on Earth in a matter of weeks. Leo returns home looking for Sarah, but her family has left for the Appalachian Mountains and is caught in a traffic jam. Leo catches up to the family using a motorcycle from their garage. Sarah's parents urge Leo to take Sarah and her baby brother to high ground. Sarah complies and she and her parents part ways. Lerner gives up her seat in the last evacuation helicopter to her friend Beth and Beth's young daughter. She joins her estranged father Jason at their beach house, where they reconcile.The Biederman fragment impacts in the Atlantic Ocean, creating a megatsunami. Jenny, Jason, Sarah's parents and millions of others perish as the tsunami devastates the Atlantic coasts of North America, South America, Europe, and Africa. Too low on fuel and life support to be able to safely attempt a second landing, the crew of Messiah decides that their only chance to destroy Wolf and save the world is to undertake a suicide mission with the remaining nuclear warheads to obliterate the Wolf fragment. After they say goodbye to their loved ones by video conference, the ship reaches the Wolf fragment and enters a fissure to blow itself up, which breaks the fragment into pieces that burn up in Earth's atmosphere.After the waters recede, President Beck speaks to a large crowd, encouraging them to remember the heroes for their sacrifice that saved the world, and urging nations and the world to continue their recovery as he believes they've been blessed with a second chance to call Earth their home. The final shot of the film is the United States Capitol building being reconstructed.","language":"English","Reception":"Deep Impact debuted at the North American box office with $41,000,000 in ticket sales. The movie grossed $140,000,000 in North America and an additional $209,000,000 worldwide for a total gross of $349,000,000. Despite competition in the summer of 1998 from the similar Armageddon, Deep Impact was still a box office hit and was the higher opener of the two.[8] Domestically, it became the highest grossing film directed by a woman and held that record for a decade until Twilight claimed the record in 2008.The film had a mixed critical reception. Based on 52 reviews collected by Rotten Tomatoes, 48% of critics enjoyed the film, with an average rating of 5.8/10.[9] Metacritic gave a score of 40 based on 20 reviews. Elvis Mitchell of The New York Times said that the film \"has a more brooding, thoughtful tone than this genre usually calls for\",[10] while Rita Kempley and Michael O'Sullivan of the Washington Post criticized what they saw as unemotional performances and a lack of tension.[11][12]","box_office":"$349.5 million[2]","cinematography":"Dietrich Lohmann","production_company":"The Manhattan Project Zanuck/Brown Productions","directed_by":"Mimi Leder","Music":"The music for the film was composed and conducted by James Horner.","release_dates":"May 8, 1998 (1998-05-08)|||||","Production":"Jenny Lerner, the character played by Téa Leoni, was originally intended to work for CNN. CNN rejected this because it would be \"inappropriate\". MSNBC agreed to be featured in the movie instead, seeing it as a way to gain exposure for the then newly-created network.[6]Director Mimi Leder later explained that she would have liked to travel to other countries to incorporate additional perspectives, but due to a strict filming schedule and a low budget, the idea was scratched.[7] Visual effects supervisor Scott Farrar felt that coverage of worldwide events would have distracted and detracted from the main characters' stories.[7]","produced_by":"David Brown Richard D. Zanuck","starring":"Robert Duvall Téa Leoni Elijah Wood Vanessa Redgrave Maximilian Schell Leelee Sobieski Morgan Freeman","running_time":"121 minutes","deep_impact":"Theatrical release poster","music_by":"James Horner","edited_by":"Paul Cichocki David Rosenbloom","written_by":"Bruce Joel Rubin Michael Tolkin","budget":"$80 million[1]"}