{"country":"Mexico United States","distributed_by":"IFC Films","screenplay_by":"John Sayles","Plot":"The film tells the story of six white American women, all but one over thirty, impatiently waiting out their lengthy residency requirements in an unidentified South American country before picking up their adoptive babies.","language":"English Spanish","Reception":"The film was first presented at the Venice Film Festival on September 5, 2003.The film was screened at various film festivals, including the Toronto Film Festival, Canada; the Istanbul FilmOctober Film Week, Turkey; and others.It opened both in New York City and Los Angeles on September 19, 2003. The first week's gross was $36,456 (nine screens) and the total receipts for the run were $475,940. In its widest release the film was featured in 71 theaters. The motion picture was in circulation 10 weeks.[2]Critic Stephen Holden, writing for The New York Times, liked the film message and wrote, \"Casa de los Babys, adheres to the same essayistic format as many of its forerunners...Despite its emotionally loaded theme, the film is a scrupulously suds-free examination of motherhood as it is viewed in first- and third-world countries. The closest it gets to misty-eyed is in its panoramic shots of wide-eyed Latino infants who will soon be transported from a nation mired in poverty to a land of plenty ... the movie's even-handed portrayal of two cultures uneasily transacting the most personal business resonates with truth.\"[3]Critic Roger Ebert lauded the film and wrote, \"Sayles handles this material with gentle delicacy, as if aware that the issues are too fraught to be approached with simple messages. He shows both sides; the maid Asuncion gave up her baby and now imagines her happy life in El Norte, but we feel how much she misses her. The squeegee kids on the corner have been abandoned by their parents and might happily go home with one of these rich Americanas. Sayles sees like a documentarian, showing us the women, listening to their stories, inviting us to share their hopes and fears and speculate about their motives. There are no answers here, just the experiences of waiting for a few weeks in the Casa de los Babys.\"[4]Critics Frederic and Mary Ann Brussat also liked the films message and wrote, \"The overall tone of Casa de los Babys promotes the spiritual practice of openness, which is the ability to see clearly, without preference or prejudice, and with empathy. Sayles continues his special mission of exploring the nuances that go into the creation of cross-cultural tensions and misunderstandings.\"[5]","box_office":"$475,940","casa_de_los_babys":"Theatrical release poster","cinematography":"Mauricio Rubinstein","production_company":"IFC Films Springall Pictures","directed_by":"John Sayles","release_dates":"September 5, 2003 (2003-09-05) (Venice Film Festival)|September 19, 2003 (2003-09-19) (United States)||||","produced_by":"Alejandro Springall Lemore Syvan","starring":"Marcia Gay Harden Maggie Gyllenhaal Daryl Hannah Susan Lynch Mary Steenburgen Lili Taylor","running_time":"95 minutes","music_by":"Mason Daring","edited_by":"John Sayles","budget":"$800,000"}