{"Cast":"Jane March as FreyaWilliam Gregory Lee as SvenJustin Whalin as EricDavid Dukas as the Beast / AgnarGreg Melvill-Smith as ThorssonCandîce Hillebrand as Ingrid","Plot":"Thorsson (Melvill-Smith) the king is falling ill and wants to make a pilgrimage to an island cursed by Odin. The island is home to a horrible beast. His daughter Freya (March) is betrothed to Sven, one of Thorsson's greatest warriors.Freya tries to get an army together to go back and save her father [clarification needed] (whom she believes to be alive). However, no one will join her and Sven reminds her that he is now king and that she is betrothed to him.Freya and Ingrid go to the island alone to rescue her father.Eric[who?] steps forward and tells everyone they've all been acting like cowards. He also says he'll go and save the king's daughter himself if Sven does not dare. Sven, not wanting to look like a coward, angrily agrees to send an army back to fight the beast and rescue Freya.Freya and the Beast begin to develop a friendship.Sven returns to the island with an army and confronts the Beast. Freya tries to stop them, by telling them the beast is not a monster. Sven does not listen to her, thinking the Beast has fooled her mind. Sven and the Beast fight and ends with Sven's archers shooting him. The warriors set the island afire and return home with Freya.The Beast journeys to Freya's home where Thorsson has recovered from his illness and is once again king.As the Beast holds the dying Freya[clarification needed] in his arms, Freya's sacrifice breaks the curse and the Beast is Agnar[who?] once again.","language":"English","Reception":"Beauty and the Beast (Blood of Beasts) has received negative reviews. Review aggregator website Rotten Tomatoes currently holds it at 24% with an average rating of 2.4/5.[1]","cinematography":"Buster Reynolds","directed_by":"David Lister","release_dates":"October 18, 2005 (2005-10-18)|||||","Production":"The movie was filmed in both the UK and South Africa.","produced_by":"Janet Blandford Stephen Margolis","starring":"Jane March William Gregory Lee Justin Whalin David Dukas Greg Melvill-Smith Candicé Hillebrand Marcel Van Heerden Russel Savadier Steven van Niekerk Lee Ann Shepherd Ron Smerczak Aubrey Lovett Etienne Oelofse Etienne Changuion Antony Jardin","music_by":"Mark Thomas","edited_by":"Peter Davies","written_by":"Paul Anthony"}