{"country":"Japan","distributed_by":"Warner Bros.","Plot":"The film does not have a single narrative, but is rather episodic in nature, following the adventures of a \"surrogate Kurosawa\" (often recognizable by his wearing Kurosawa's trademark hat) through eight different segments, or \"dreams\", each one titled.There is an old legend in Japan that states that when the sun is shining through the rain, the kitsune (foxes) have their weddings (this is a common theme globally – see sunshower). In this first dream, a boy defies the wish of a woman, possibly his mother, to remain at home during a day with such weather. From behind a large tree in the nearby forest, he witnesses the slow wedding procession of the kitsune. Unfortunately, he is spotted by the foxes and runs. When he tries to return home, the same woman says that a fox had come by the house, leaving behind a tantō knife. The woman gives the knife to the boy, implying that he must commit suicide. The woman asks the boy to go and beg forgiveness from the foxes, although they are known to be unforgiving, refusing to let him in unless he does so. The boy sets off into the mountains, towards the place under the rainbow in search for the kitsune's home.Kurosawa built a near exact replica of his childhood home for this segment, and the nameplate on the gate even reads \"Kurosawa\". Kurosawa even showed the actress playing the mother a photo of his own, and gave her tips on how to act as her.[3]Hina Matsuri, the Doll Festival, traditionally takes place in spring when the peach blossoms are in full bloom. The dolls that go on display at this time, they say, are representative of the peach trees and their pink blossoms. One boy's family, however, has chopped down their peach orchard, so the boy feels a sense of loss during this year's festival. After being scolded by his older sister the boy spots a small girl running out the front door. He follows her to the now-treeless orchard, where the dolls from his sister's collection have come to life and are standing before him on the slopes of the orchard. The living dolls, revealing themselves to be the spirits of the peach trees, berate the boy about chopping down the precious trees. But after realizing how much he loved the blossoms, they agree to give him one last glance at the peach trees by way of a slow and beautiful dance to Etenraku. After they disappear the boy finds the small girl walking among the treeless orchard before seeing a single peach tree sprouting in her place.The mysterious girl may be a reference to an older sister of Kurosawa's who died of illness when he was in the fourth grade.[4]A group of four mountaineers, including an adolescent Kurosawa, struggle up a mountain path during a horrendous blizzard. It has been snowing for three days and the men are dispirited and ready to give up. One by one they stop walking, giving in to the snow and sure death. The leader endeavors to push on, but he too, stops in the snow. A strange woman (the Yuki-onna of Japanese myth) appears out of nowhere and attempts to lure the last conscious man to his death - give in to the snow and the storm, she urges him on, in to reverie, in to sleep, in to certain death. But finding some heart, deep within, he shakes off his stupor and her entreaties, to discover that the storm has abated, and that their camp is only a few feet away.The setting for this sequence was most likely inspired from Kurosawa's personal life, since he confessed to being \"a devotee of mountain climbing\".[5]A discharged Japanese company commander is walking down a deserted road at dusk, on his way back home from fighting in the Second World War. He comes to a large concrete pedestrian tunnel that seems to go on forever into the darkness. Suddenly, an angry, almost demonic-looking anti-tank dog (strapped with explosives) runs out of the tunnel, barking and snarling. The dog herds him into the tunnel. The commander walks hesitatingly into its darkness. He comes out the other side, only to witness the horrific yūrei (ghost) of one of his soldiers, Private Noguchi (Yoshitaka Zushi, who was also in Kurosawa's Dodes'ka-den), who had died severely wounded in the commander's arms. Noguchi's face is light blue with blackened eyes, signifying that he is dead.The soldier seems not to believe that he is gone. Noguchi has appeared because his parents' house is visible in a nearby mountainside, a light in the darkness left on for his return. He is heartbroken, knowing he cannot see them again, even while he remains respectful to the commander who led him to his death. Following the commander's wish that he accept his fate Noguchi returns to the tunnel.Just when the commander thinks he's seen the worst, his entire third platoon, led by a young lieutenant brandishing an officer's sword, marches out of the tunnel. They come to a halt and present arms, saluting the commander. Their faces too are colored blue, for they were all annihilated in a single action. The commander searches for words to tell them that they are dead, and says that he himself is to blame for sending them into a futile battle. They stand mute in reply. The commander orders them to turn about face, and salutes them in a farewell as they march back into the tunnel. Collapsing in grief, the commander is quickly brought back to his feet by the reappearance of the hellish dog.A brilliantly colored vignette featuring director Martin Scorsese as Vincent van Gogh. An art student finds himself inside the vibrant and sometimes chaotic world of Van Gogh's artwork, where he meets the artist in a field and converses with him. When asked why he's missing an ear, Van Gogh replies that the ear gave him problems during a self portrait, and so he did away with it. The student loses track of the artist, and travels through other works trying to find him, concluding with Van Gogh's Wheat Field with Crows.This Segment features Prelude No. 15 in D-flat major (\"Raindrop\") by Chopin. The visual effects for this particular segment were provided by George Lucas and his special effects group Industrial Light & Magic. It is also the only segment where the characters do not speak Japanese.A large nuclear power plant near Mount Fuji has begun to melt down; its six reactors explode one by one. The breaches fill the sky with hellish red fumes and send millions of Japanese citizens fleeing in terror towards the ocean. After an unspecified amount of time, two men, a woman, and her two small children are seen alone, left behind on land in broad daylight. Behind them is the sea. The older man (Hisashi Igawa, who appeared in a number of Kurosawa's later movies), who is dressed in a business suit, explains to the younger man that the rest have drowned themselves in the ocean. He then says that the several colours of the clouds billowing across the now rubbish-strewn, post-apocalyptic landscape signify different radioactive isotopes; according to him, red signifies plutonium-239, a tenth of a microgram of which is enough to cause cancer. He elaborates on how other released isotopes cause leukemia (strontium-90) and birth defects (cesium-137) before wondering at the foolish futility of colour-coding radioactive gases of such lethality.The woman, hearing these descriptions, recoils in horror before angrily cursing those responsible and the pre-disaster assurances of safety they had given. The suited man then displays contrition, suggesting that he is in part responsible for the disaster. The other man, dressed casually, watches the multicoloured radioactive clouds advance upon them. When he turns back towards the others at the shore, he sees the woman weeping: the suit-clad man has leaped to his death. A cloud of red dust reaches them, causing the mother to shrink back in terror. The remaining man attempts to shield the mother and her children by using his jacket to feebly fan away the now-incessant radioactive billows.A man finds himself wandering around a misty, bleak mountainous terrain. He meets a strange oni-like man, who is actually a mutated human with one horn. The \"demon\" explains that there had been a nuclear holocaust which resulted in the loss of nature and animals, enormous dandelions and humans sprouting horns, which cause them so much agony that you can hear them howling during the night, but, according to the demon, they can't die, which makes their agony even worse. Many of the \"demons\" were former millionaires and government officials, who are now (in Buddhist style) suffering through a hell befitting for their sins.The segment ends with the demon, suddenly enraged, chasing the man away from the scene.A young man finds himself entering a peaceful, stream-laden village. The traveler meets an old, wise man who is fixing a broken watermill wheel. The elder explains that the people of his village decided long ago to forsake the polluting influence of modern technology and return to a happier, cleaner era of society. They have chosen spiritual health over convenience, and the traveler is surprised but intrigued by this notion.At the end of the sequence (and the film), a funeral procession for an old woman takes place in the village, which instead of mourning, the people celebrate joyfully as the proper end to a good life. This segment was filmed at the Daio Wasabi farm in the Nagano Prefecture. The film ends with a haunting, melancholic excerpt from \"In the Village\", part of the Caucasian Sketches, Suite No. 1 by the Russian composer Mikhail Ippolitov-Ivanov.One aspect of the village in this sequence is a large stone which local children place flowers over; the old man reveals this to be the grave of a traveler who died long ago, and it has become a tradition to lay flowers over it as you pass. Kurosawa was most likely inspired by a similar stone from his father's home village:Near the main thoroughfare of the village stood a huge rock, and there were always cut flowers on top of it. All the children who passed by it picked wild flowers and laid them atop the stone. When I wondered why they did this and asked, the children said they didn't know. I found out later by asking one of the old men in the village. In the Battle of Boshin, a hundred years ago, someone died at that spot. Feeling sorry for him, the villagers buried him, put the stone over the grave and laid flowers on it. The flowers became a custom of the village, which the children maintained without ever knowing why.[6]Before the end credits, the young man himself pauses to lay a flower over the stone.","language":"Japanese French English","Reception":"The film received mixed reviews, earning a Rotten Tomatoes approval rating of 55%.[7]","cinematography":"Takao Saito Shôji Ueda","directed_by":"Akira Kurosawa Ishirō Honda","release_dates":"May 11, 1990 (1990-05-11)|||||","produced_by":"Allan H. Liebert Hisao Kurosawa Mike Y. Inoue Seikichi Iizumi Steven Spielberg","starring":"Akira Terao Martin Scorsese Mitsunori Isaki Chishū Ryū Mieko Harada","running_time":"119 minutes","music_by":"Shinichirô Ikebe","edited_by":"Tome Minami","written_by":"Akira Kurosawa","budget":"$12 million"}