{"country":"France","distributed_by":"Pan-Européenne Distribution","baise-moi":"French release poster","Plot":"Baise-moi tells the story of Nadine and Manu who go on a violent spree against a society in which they feel marginalized. Nadine is a part-time sex worker, and Manu a slacker who does anything—including occasional porn film acting—to get by in her small town in southern France.One day, Manu and her friend, a drug addict, are accosted in the park by three men, who take them to a garage and gang-rape them. While her friend struggles, screams, and fights against the rapists, Manu lies still with a detached look, which troubles the man raping her, who soon gives up. When her friend asks Manu how she could act so detached, she replies that she \"can't prevent anyone from penetrating her pussy\", so she didn't leave anything precious in there. Manu then returns to her brother's house, and does not tell him what has happened, but noticing bruises on her neck, he realizes. He gets out a gun and asks Manu who was responsible, but when she refuses to tell him, he calls her a \"slut\" and implies that she actually enjoyed being raped. In response, picking up the discarded pistol, Manu shoots him in the head.Meanwhile, Nadine returns home and has an argument with her roommate, whom she strangles and kills, before leaving with their rent money. Nadine suffers another emotional setback when she meets her best friend, a drug dealer, in another town, but he is shot and killed while out obtaining drugs with a prescription she forged for him.Later that night, having missed the last train, Nadine meets Manu at the railway station. Manu says she has a car, if Nadine will drive for her. They soon realize that they share common feelings of anger, and embark on a violent and sexually charged road trip together.In need of money, the girls hold up a shop and also kill a woman at a cash machine. In a stolen car, they are pulled over for a random check by police, whom they kill. Another woman, who was also being checked and saw the murders, flees with them. The women stay over at their new friend's house, whose brother provides the address and details of an architect with whom he has had trouble. The women trick their way into the architect's house and kill him. Finally, after this spree of murder and sexual activity, the two women enter a swingers' club. One of the patrons makes a racist comment to Manu. The women kill most of the patrons there, and use a gun to anally penetrate the racist man, finally shooting him. The pair discuss what they have done, and agree that it has all been pointless because nothing has changed in them.During their spree, the duo's crimes are reported by the press, and become a point of fascination for the entire country, with some people actually supporting them, and others afraid of them. When Manu enters a roadside tire shop to get some coffee, she is shot by the shop owner, who is then shot by Nadine outside. Nadine takes Manu's body to a forest and burns it, before driving to a beach. With tears in her eyes, Nadine puts the gun to her head, intending to commit suicide, but gets arrested by the police before she can do so.","language":"French","Reception":"Baise-moi received generally negative reviews, currently holding a 21% \"rotten\" rating – based on 56 critics – on review aggregator website Rotten Tomatoes; the consensus states: \"Heavy on the sex and violence, Baise Moi is not so much a daring as a sloppy piece of work.\"[12] The film also has a 35/100 rating on Metacritic, based on 22 critics, signifying \"generally unfavorable reviews\".[13]","box_office":"$940,944[1]","cinematography":"Benoît Chamaillard Julien Pamart","production_company":"Pan-Européenne Canal+ Take One Wild Bunch","directed_by":"Virginie Despentes Coralie Trinh Thi","release_dates":"28 June 2000 (2000-06-28)|||||","Production":"The film was filmed on location between October and December 1999 in Biarritz, Bordeaux, Lyon, and Marseille. It was shot on digital video without artificial lighting. This low budget method of filming divided critics—some said it gave the film an amateurish look. Lou Lumenick, reviewing the film in the New York Post, went further and said it \"looked like hell\". Others, such as James Travers writing for filmsdefrance.com,[4] said the filming method added something to the film. Travers wrote \"the film's 'rough and ready' feel helps to strengthen its artistic vision and draws out the messages which it is trying to get across, without distracting its audience with overly choreographed 'shock scenes'.\"","produced_by":"Philippe Godeau","starring":"Karen Lancaume Raffaëla Anderson","running_time":"77 minutes","music_by":"Varou Jan","edited_by":"Aïlo Auguste-Judith Francine Lemaitre Véronique Rosa","Release":"The film was co-directed by actress Coralie Trinh Thi whose previous work was in unambiguously pornographic films. The two lead roles were also played by porn actresses, while porn actor Ian Scott appeared in the film as one of the rapists. Perhaps in part due to this, some sections of the media criticized the film as thinly veiled pornography. Le Monde, for instance, called it a \"sick film\". Time magazine bucked the trend by saying: \"Virginie Despentes and Coralie Trinh Thi's festival sensation is stark, serious and original. And as one of the amoral avengers, Raffaela Anderson has true star quality – part seraph, all slut.\" The co-directors rejected the pornography charge: Trinh Thi said in an interview with the Sunday Times that \"This movie is not for masturbation, [thus it] is not porn.\" Despentes agreed, saying their film \"was not erotic\".In its home country, the film was initially released with a 16 rating, given by a ministerial commission. The rating caused outrage, particularly amongst members of the right-wing Promouvoir religious group, which is strongly associated with the Mouvement National Républicain. Some groups litigated against the classification decision, arguing that the film should be X-rated given its high content of realistic sex and extreme violence, both of which are grounds for X classification in France; the Conseil d'État ruled its classification illegal, removing it from the theater circuit. As the first film to be banned in France for 28 years, it became something of a cause célèbre—with one anti-censorship campaigner[who?] calling the ban \"totalitarian state censorship\". The Conseil later re-classified the film with an X certificate, a category usually reserved for mainstream pornographic movies. Minister for Culture Catherine Tasca ended the debate by re-introducing an 18 certificate, allowing the film to be re-released in mainstream theatres.In Australia, the film was initially passed for viewing at the highest possible R18 rating in a 6–5 vote by the country's Classification Board in October 2001. However the Attorney-General invoked his powers under the 1995 Classification Act to have the board's decision reviewed. The Classification Review Board (a separate entity to the Classification Board) ruled in May 2002 that the film contains \"explicit, offensive and graphic depictions of sexual violence, assault and violence with an impact that is very, very high\" and \"dangerous to the community,\" resulting in the film being banned with a \"Refused Classification\" rating. It was later revealed that 50,000 people had seen the film before the ban, but according to Des Clark, director of the Office of Film and Literature Classification, just \"one or two\" of those had complained about the film. Most complainants, he explained, had not seen the film. An appeal of the review board's verdict failed. Despite an edited screening of the film airing on the pay World Movies channel later the same month, the film was re-banned in August 2013.[2]In Canada, the film was banned in Ontario, initially because it was deemed too pornographic. The producers asked for a pornographic rating, only for it to be banned because there was too much violence for a pornographic film. A second review in 2001 passed the film with an R rating,[5] due in part to complaints[ambiguous] by such notable Canadian filmmakers as Atom Egoyan and Denys Arcand. In Quebec, the film was considered to be a moderate success for an independent release, taking in approximately $250,000 CAD in the first two months of its run. It did, however, provoke a violent reaction from one Montreal moviegoer, who broke into the projection booth and stole the print, ending the screening.[6]In the United Kingdom, the film was released with an 18 certificate for its 2001 cinema release after the cut of a ten-second scene showing a close-up of a penis entering a vagina during a rape, which the Board ruled eroticized sexual assault.[7] After a further cut of a two-second scene showing a gun being pressed into a man's anus before being fired, the film received an 18 certificate on video in 2002 .[8] Even with these cuts, the film represents a watershed in what content is allowed at the 18 rating—films with the R18 higher rating can only be sold in licensed sex shops. The film was one of the very first to show an erect penis, and the first to combine it with scenes of violence. London Underground banned the display of the film's advertising poster because of fears that its title would offend French-speakers using its network. In 2013, the film was passed uncut with the 18 certificate intact.[9]In the United States, the film was marketed under the names Kiss Me and Rape Me and released without a classification from the Motion Picture Association of America. It screened only at a small number of cinemas (almost all of them in arthouse cinemas in the major cities). The film took just $70,000 in receipts from its American release and there was a marked lack of controversy as compared to other countries.The film also performed quite poorly in Germany. Although it was released in its unedited version, it didn't cause much of a controversy in the media. It received an R18 rating in cinemas in New Zealand, and was banned from video release there, following an injunction filed by the Society for the Promotion of Community Standards.[10] The film was refused classification in Ireland, essentially preventing its screening in mainstream cinemas, although it was shown in arthouse club cinemas which screen unclassified films.Two minutes and 35 seconds of cuts were required before the film received a certificate in Hong Kong. In Finland, the film was rated K18 (Forbidden for under 18). An uncut version was shown in both cinemas and on TV.[11]Although the film's release in Bulgaria was otherwise uncontroversial, a program conducted an experiment in which two 14-year-olds were sent to buy tickets for it. The teenagers successfully made the purchase and even entered the cinema, but left after the opening credits. Rather than discussing the film itself, the program focused on the lack of control cinema owners and staff — as well as the authorities — exercised over minors visiting adult films in the country. The cinema in question later pulled the film off its schedule, following the report's first airing.In Mexico, the film was shown uncut in mainstream theaters, with a \"C\" (18+) rating, with a warning because of its sexual and violent content, but it did not attract much controversy in the media. It was also aired several times uncut on cable television.","written_by":"Virginie Despentes Coralie Trinh Thi"}