{"based_on":"Doctor Zhivago  by Boris Pasternak","country":"United Kingdom|United States|","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Robert Bolt","Plot":"The film takes place mostly against a backdrop of the pre-World War I years, World War I itself, the Russian Revolution of 1917, and the Russian Civil War. A narrative framing device, set in the late 1940s or early 1950s, involves KGB Lieutenant General Yevgraf Andreyevich Zhivago (Alec Guinness) searching for the daughter of his half brother, Doctor Yuri Andreyevich Zhivago (Omar Sharif), and Larissa (\"Lara\") Antipova (Julie Christie). Yevgraf believes a young woman, Tanya Komarova (Rita Tushingham), may be his niece and tells her the story of her father's life.When Yuri Zhivago is orphaned after his mother's death in rural Russia, he is taken in by his mother's friends, Alexander (Ralph Richardson) and Anna Gromeko (Siobhán McKenna), and grows up with their daughter Tonya (Geraldine Chaplin) in Moscow.In 1913, Zhivago, as a medical student in training, but a poet at heart, meets Tonya as she returns to Moscow after a long trip to Paris. Lara, only 17, is involved in an affair with the older and well-connected Victor Ipolitovich Komarovsky (Rod Steiger), a friend of her mother's (Adrienne Corri). That night, the idealistic reformer Pavel Pavlovich (\"Pasha\") Antipov (Tom Courtenay) drifts into left-wing extremism after being wounded by sabre-wielding Cossacks during a peaceful demonstration. Pasha runs to Lara, whom he wants to marry, to treat his wound. He asks her to hide a gun he picked up at the demonstration. Lara's mother discovers her affair with Komarovsky and attempts suicide. Komarovsky summons help from his physician (Geoffrey Keen), Zhivago's former professor, whom he accompanies back to Lara's home to treat her mother. When Komarovsky learns of Lara's intentions to marry Pasha, he tries to dissuade Lara, and then rapes her. In revenge, Lara takes the pistol she has been hiding for Pasha and shoots Komarovsky at a Christmas Eve party, wounding him. Komarovsky insists no action be taken against Lara, who is escorted out by Pasha. Zhivago tends Komarovsky's wound. Although enraged and devastated by Lara's affair with Komarovsky, Pasha marries Lara, and they have a daughter named Katya.During World War I, Yevgraf Zhivago is sent by the Bolsheviks to subvert the Imperial Russian Army. Pasha is reported missing in action following a daring charge attack on German forces. Lara enlists as a nurse to search for him. Yuri Zhivago is drafted and becomes a battlefield doctor.During the February Revolution in 1917, Zhivago enlists Lara's help to tend to the wounded. Together they run a field hospital for six months, during which time radical changes ensue throughout Russia as Vladimir Lenin arrives in Moscow. Before their departure, Yuri and Lara fall in love, but Yuri remains true to Tonya, who is now his wife.After the war, Yuri returns to his wife Tonya, son Sasha, and Alexander, whose house in Moscow has been divided into tenements by the new Soviet government. Yevgraf, now a member of the CHEKA, informs him his poems have been condemned by Soviet censors as antagonistic to Communism. Yevgraf arranges for passes and documents in order for Yuri and his family to escape from the new political capital of Moscow to the far-away Gromeko estate at Varykino, in the Ural Mountains. Zhivago, Tonya, Sasha, and Alexander board a heavily guarded cattle train, at which time they are informed that they will be travelling through contested territory, which is being secured by the infamous Bolshevik commander named Strelnikov.While the train is stopped, Zhivago wanders away. He stumbles across the armoured train of Strelnikov sitting on a hidden siding. Yuri is summoned before Strelnikov, whom he recognizes as the former Pasha Antipov. During a tense interview, Strelnikov informs Yuri that his estranged wife Lara is now living in the town of Yuriatin, then occupied by the anti-Communist White Army forces. He permits Zhivago to return to his family, although it is hinted by Strelnikov's right-hand man that most people interrogated by Strelnikov end up being shot.The family lives a peaceful life in a cottage at the Varykino estate until Zhivago finds Lara in nearby Yuriatin, at which point they surrender to their long-repressed feelings. When Tonya becomes pregnant, Yuri breaks off with Lara, only to be abducted and conscripted into service by Communist partisans.After two years, Zhivago at last deserts and trudges through the deep snow to Yuriatin where he finds Lara. Lara tells Yuri that Tonya had discovered her while searching for him, and that his family is now in Moscow. She reveals a sealed letter Tonya had mailed to Lara 6 months ago to give to Yuri: Tonya, her father, and their children are being deported and will live in Paris. Yuri and Lara renew their relationship.One night, Komarovsky arrives and informs them they are being watched by the CHEKA due to Lara's connection by marriage to Strelnikov and Yuri's \"counter-revolutionary\" poetry and desertion. Komarovsky offers Yuri and Lara his help in leaving Russia. They refuse. Instead, they return to the abandoned Varykino estate, taking up residence in the banned main house, where Yuri begins writing the \"Lara\" poems. These will later make him famous but also incur government displeasure. Komarovsky reappears and tells Yuri that Strelnikov was captured only five miles away while apparently returning to Lara, but then committed suicide en route to his own execution. Therefore, Lara is in immediate danger of execution herself, as the CHEKA had only left her free to lure Strelnikov out of hiding. Zhivago sends Lara and Katya away with Komarovsky, who has been appointed a government official in the nominally independent Far Eastern Republic of the early 1920s. Refusing to accompany a man he despises, Yuri remains behind to face his fate.Years later, Yevgraf finds a sick and destitute Yuri in Moscow during the Stalinist era and gives him a new suit and a job. While riding a tram, Yuri spots a woman he surely thinks is Lara walking on a nearby street. Unable to call her from the tram, Yuri struggles to get off at the next stop. Yuri runs after her but suffers a fatal heart attack before he can even signal to her, and the woman walks away oblivious to Yuri's presence. Yuri's funeral is well attended, a surprise to Yevgraf as Yuri's poetry was officially \"unattainable at the time\". Lara approaches Yevgraf at the funeral, reveals she had given birth to Yuri's daughter, but lost her in the collapse of the White-controlled government in Mongolia. After vainly looking over hundreds of orphans with Yevgraf's help, Lara disappears during Joseph Stalin's Great Purge of the late 1930s, and \"died or vanished somewhere...in one of the labour camps,\" according to Yevgraf.While Yevgraf strongly feels that Tanya Komarova is Yuri's and Lara's daughter, he is still not convinced. But as Tanya leaves, Yevgraf notices that she carries a balalaika, an instrument that Yuri's mother was renowned for playing. Questioning her further, he learns that Tanya is self-taught—in fact, her fiancé proclaims her an 'artist' with the balalaika. Yevgraf smiles, \"Ah. Then it's a gift,\" thereby implying she truly must be Yuri's and Lara's daughter after all.","Accolades":"The film won five Academy Awards and was nominated for five more:[21][22]The film was nominated for five Golden Globe Awards, and won in every category. It is tied with Love Story, The Godfather, One Flew Over the Cuckoo's Nest, and A Star Is Born for the most wins by a film","language":"English|Russian|","box_office":"$111.7 million[2]","cinematography":"Freddie Young|Nicolas Roeg (Uncredited)|","production_company":"Sostar S.A.","directed_by":"David Lean","Home media":"On 4 May 2002, Warner Bros. released the 35th Anniversary version of Doctor Zhivago on DVD (two-disc set), and another Anniversary Edition in 2010 on Blu-ray (a three-disc set that includes a book).[23] The two-disc set consists of a double-sided DVD for the main film (wherein the DVD has to be flipped for part 2 of the film), and a one-sided DVD for the extras. The digital restoration of the film was done by Warner Bros. motion picture imaging. The digital pictures were frame by frame restored at Prasad Corporation to remove dirt, tears, scratches and other artifacts, restoring the film's original look.","release_dates":"22 December 1965 (1965-12-22) (US)|26 April 1966 (1966-04-26) (UK)|10 December 1966 (1966-12-10) (Italy)|28 September 1999 (1999-09-28) (US re-release)||","Production":"Boris Pasternak's 1957 novel was published in the West amidst celebration and controversy. Parts of Pasternak's book had been known in Samizdat since some time after World War II. However, the novel was not completed until 1956. The book had to be smuggled out of the Soviet Union by an Italian called D'angelo to whom Pasternak had entrusted the book to be delivered to Giangiacomo Feltrinelli, a left-wing Italian publisher who published it shortly thereafter. Helped by a Soviet campaign against the novel, it became a sensation throughout the non-communist world. It spent 26 weeks atop the New York Times best-seller list.A great lyric poet, Pasternak was awarded the 1958 Nobel Prize for Literature. While the citation noted his poetry, it was understood that the prize was mainly for Doctor Zhivago, which the Soviet government saw as an anti-Soviet work, thus interpreting the award of the Nobel Prize as a gesture hostile to the Soviet Union. A target of the Soviet government's fervent campaign to label him a traitor, Pasternak felt compelled to refuse the Prize. The situation became an international cause célèbre and made Pasternak a Cold War symbol of resistance to Soviet communism.The film, though faithful to the novel's plot, is noticeably different in the depictions of several characters and events. Many critics believed that the film's focus on the love story between Zhivago and Lara trivialized the events of the Russian Revolution and the resulting civil war.[4]The sweeping multi-plotted story form used by Pasternak had a distinguished pedigree in Russian letters. The author of War and Peace, Leo Tolstoy, had used characters as symbols of classes and historical events in describing the events in the Russia of Napoleonic times. Pasternak's father, who was a painter, had produced illustrations for War and Peace. The name \"Zhivago\" is rooted in the Russian word \"zhiv\" (\"alive\") and \"zhivago\" is Church Slavonic for \"the living\".[5]In the true manner of the Russian epic novel, characters constantly meet due to coincidence, though this is less apparent in the film.The film treatment by David Lean was proposed for various reasons. Pasternak's novel had been an international success, and producer Carlo Ponti was interested in adapting it as a vehicle for his wife, Sophia Loren. Lean, coming off the huge success of Lawrence of Arabia (1962), wanted to make a more intimate, romantic film to balance the action- and adventure-oriented tone of his previous film. One of the first actors signed onboard was Omar Sharif, who had played Lawrence's right-hand man Sherif Ali in Lawrence of Arabia. Sharif loved the novel, and when he heard Lean was making a film adaptation, he requested to be cast in the role of Pasha (which ultimately went to Tom Courtenay). Sharif was quite surprised when Lean suggested that he play Zhivago himself. Peter O'Toole, star of Lawrence of Arabia, was Lean's original choice for Zhivago, but turned the part down; Max von Sydow and Paul Newman were also considered. Michael Caine tells in his autobiography that he also read for Zhivago and participated in the screen shots with Christie, but (after watching the results with David Lean) was the one who suggested Omar Sharif.[6][7] Rod Steiger was cast as Komarovsky after Marlon Brando and James Mason turned the part down. Audrey Hepburn was considered for Tonya, while Robert Bolt lobbied for Albert Finney to play Pasha.Lean was able to convince Ponti that Loren was not right for the role of Lara, saying she was \"too tall\" (and confiding in screenwriter Robert Bolt that he could not accept Loren as a virgin for the early parts of the film), and Yvette Mimieux, Sarah Miles and Jane Fonda were considered for the role. Ultimately, Julie Christie was cast based on her appearance in Billy Liar (1963), and the recommendation of John Ford, who directed her in Young Cassidy (1965). Sharif's son Tarek was cast as the young Zhivago in the film and Sharif directed his son as a way to get closer to his character.[8]Since the book was banned in the Soviet Union, the film was shot largely in Spain over ten months,[9] with the entire Moscow set being built from scratch outside of Madrid. Most of the scenes covering Zhivago's and Lara's service in World War I were filmed in Soria, as was the Varykino estate. The \"ice-palace\" at Varykino was filmed in Soria as well, a house filled with frozen beeswax. The charge of the partisans across the frozen lake was filmed in Spain, too; a cast iron sheet was placed over a dried river-bed, and fake snow (mostly marble dust) was added on top. Some of the winter scenes were filmed in summer with warm temperatures, sometimes of up to 25 °C (77 °F). Other locations include the Estación de Madrid-Delicias in Madrid and El Moncayo. The initial and final scenes were shot at the Aldeadávila Dam between Spain and Portugal. Although uncredited, most of those scenes were actually shot on the Portuguese side of the river, overlooking the Spanish side.Some of the winter sequences, mostly landscape scenes and Yuri's escape from the partisans, were filmed in Finland. Winter scenes of the family travelling to Yuriatin by rail were filmed in Canada. All the locomotives seen in the film are Spanish locomotives like the RENFE Class 240 (ex-1400 MZA), and Strelnikov's armoured train is towed by the RENFE Class 282 Mikado locomotive. One train scene became notorious for the supposed fate that befell Lili Muráti, a Hungarian actress, who slipped clambering onto a moving train. Although she fell under the wagon, she did not lose any limbs or die. Lean appears to have used part of her accident in the film's final cut.[10][11]Nicolas Roeg was the original Director of Photography and worked on some scenes, but after an argument with Lean, left and was replaced by Freddie Young.[12]","doctor_zhivago":"Theatrical release poster design by Tom Jung","produced_by":"Carlo Ponti","starring":"Omar Sharif|Julie Christie|Tom Courtenay|Alec Guinness|Geraldine Chaplin|Rod Steiger|","running_time":"197 minutes|193 minutes[1] (United Kingdom)|200 minutes (1992 re-release)|192 minutes (1999 re-release)|","music_by":"Maurice Jarre","edited_by":"Norman Savage","Release":"The film was entered into the 1966 Cannes Film Festival.[13]Despite being a box office success, Doctor Zhivago received mixed reviews at the time of its release, although it has had a generally positive critical reception over time, garnering an 85% 'Fresh rating' on the critical review aggregate website Rotten Tomatoes with the summary, \"It may not be the best of David Lean's epics, but Dr. Zhivago is still brilliantly photographed and sweepingly romantic.\"It was initially criticized for its length and over-romantic depiction of the affair between Zhivago and Lara. Film critic Roger Ebert, while liking the film, wrote \"the story, especially as it has been simplified by Lean and his screenwriter, Robert Bolt, seems political in the same sense Gone With the Wind is political, as spectacle and backdrop, without ideology.\"[14] Bosley Crowther of the New York Times said that Zhivago and Lara are \"possessed by a strange passivity\".[4] Sometimes the same critics who found the length of the film overbearing also found the depiction of historical events too facile.[14]The final scene, in which a rainbow appears over a dam as the final credits are rolled onscreen, was criticized as being \"pro-Soviet\" by more conservative critics, who felt it was signifying that the Soviet Union had a bright future. Bolt, who adapted the novel, was a one-time member of the British Communist Party (leaving the Party in 1947[15] ) and well-known leftist who was prominent in the nuclear disarmament campaign, itself seen as a surrogate of the Cold War struggle between the West and the Soviet Bloc.[16]Since the film takes the viewpoint of the dreamy poet Zhivago, the physician side of Zhivago is rarely in evidence. Zhivago writes poems for Lara near the end of their relationship, but the audience never hears the poems. Zhivago's poetry is included in a supplement at the end of the novel, and critics carped that the film, unlike the book, is shorn of the poetry, and that showing a writer at work is inherently boring.On the plus side, many critics acknowledge that the film addresses such grand themes as a dramatic period in world history, the ascendance of life over death, the struggle of the individual against the state, the triumph of the heart over the mind, and the way good intentions can go terribly wrong. One of the strongest points of Doctor Zhivago is the startling visuals, with Bosley Crowther calling the photography \"brilliant, tasteful, and exquisite as any ever put on the screen.[4] Director of Photography Freddie Young won an Academy Award for his color cinematography.[17]The film left an indelible mark on popular culture and fashion, and to this day remains an extremely popular film: Maurice Jarre's score—particularly \"Lara's Theme\"—became one of the most famous in cinematic history. Over the years, the film's critical reputation has gained in stature, and today Doctor Zhivago is considered to be one of Lean's finest works and is highly critically acclaimed, along with Lawrence of Arabia, Brief Encounter, The Bridge on the River Kwai, and A Passage to India.As with the novel itself, the film was banned in the Soviet Union. It was not shown in Russia until 1994.","budget":"$11 million"}