{"based_on":"Dot and the Kangaroo by Ethel C. Pedley","country":"Australia","distributed_by":"Hoyts","Plot":"When 5-year-old Dot finds herself lost in the Australian bush, a red kangaroo who has lost her joey (baby kangaroo), promises to help Dot find her way home. In the process, the kangaroo introduces Dot to a number of other animals, teaching her a greater appreciation for nature.","language":"English","Reception":"The film was a success, being screened around the world and returning its cost within three years.[3] It allowed Yoram Gross to enlarge his production company and market his family films in the United States. Additionally, the film's use of animation set against photographic backgrounds established the style for many of his later films.","production_company":"Yoram Gross Films","directed_by":"Yoram Gross","Soundtrack":"The movie featured an original soundtrack including several lyrical melodies composed by Bob Young, John Palmer, and Marion Von Alderstein, while Bob Young provided additional lyrics, and they were recorded by Maurie Wilmore.","dot_and_the_kangaroo":"DVD Cover","release_dates":"15 December 1977 (1977-12-15)","Production":"Yoram and Sandra Gross wanted to make an Australian animated feature for the world market. They read a series of books before deciding on Dot and the Kangaroo. Two thirds of the budget was provided by the Australian Film Commission.[1]The movie backdrop was filmed on location in and around Jenolan Caves and the Warragamba Dam Catchment Area of the Blue Mountains in New South Wales, Australia. Although the film uses many of the same elements as other animated children's musicals involving animals, such as many of the Disney classics from the United States, the film is essentially Australian in its use of icons and accents. It also references Indigenous Australian culture in some scenes which depict animation of cave paintings and aboriginal dancing.[2]","produced_by":"Yoram Gross","starring":"Lola Brooks Joan Bruce Barbara Frawley Peter Gwynne Ron Haddrick Ross Higgins Richard Meikle Spike Milligan June Salter","running_time":"86 mins","Sequels":"The Yoram Gross Studios followed up the first film with another eight movies between 1981 and 1994. The theme behind all of the films in the Dot series is the negative impact of humanity on animal life in nature. The sequels are as follows:","music_by":"Bob Young John Palmer Marion Von Alderstein","Release":"In the 1980s, the first seven films were released on VHS in the United States, the first three by CBS/Fox Video and the next four by Family Home Entertainment (possibly cartoons to be released on home video by the company). A DVD version of the film was released on 30 October 2001. In Australia there is a complete series DVD set of all the Dot films. They also released on DVD on Digiview EntertainmentThe various films were shown on the Disney Channel in the late 1980s through the 1990s in the United States, and on the Family Channel in Canada.","written_by":"Yoram Gross John Palmer","budget":"A$250,000"}