{"country":"United States","distributed_by":"Warner Bros.","Plot":"Bill Dancer and his young companion Curly Sue are the archetypal homeless folks with hearts of gold. Their scams are aimed not at turning a profit, but at getting enough to eat. After moving from Detroit to Chicago, the duo cons the rich divorce lawyer Grey Ellison into believing she backed her Mercedes into Bill, in hopes of a free meal. When Grey accidentally collides with Bill for real, she insists on putting the two up for the night, even over the objections of her snotty fiance Walker McCormick. After a confrontation with Bill exposing the truth of the con, Grey lets them stay for as long as they need when she understands the precarious position the homeless pair are in. One night, Bill tells Grey that he is not Sue's father, he met Sue's mother one night in Florida. After Sue's mother died, Bill raised her himself, growing to love her like his own, thus when they lost their home and money, Bill couldn't find it in his heart to give Sue up and put her into an orphanage, so he took Sue with him. Grey, thinking Bill has been neglecting and abusing Sue by using her in his cons and scams, suggests Sue stay with her when he leaves, but this only angers Bill, who says that after all the years he looked after her, if he gave up Sue now, people would make fun of her for being on welfare. He tells her that he is not neglecting or abusing Sue; he cares about Sue and his cons are to provide for Sue. However, when it becomes apparent that Sue is completely unable to read or write (despite spelling a difficult word earlier), Grey begins to push even harder for Bill to leave Sue with her. Eventually, Bill realizes that this is where she belongs - in a home, cared for by someone that can give her the advantages that his homeless, nomadic existence lacks. Then, Walker turns them in, and Sue gets put into welfare. Bill is arrested, because he never actually had custody of the child. Eventually, Grey gets Sue out, and Bill is freed. Sue and Grey return to their apartment and discover a tiny one, which Sue takes as a sign that Bill has chosen to leave her behind with Grey. (It is implied that Bill pawned a ring left to Sue by her mother, which he would return to her when it came time for the two to part forever) However, the ring is accompanied by a note that says that he is in another room. Sue happily turns to find Bill, realizing that the ring is not a sign that he will leave her but a sign that he is going to abandon his old lifestyle in order to give Sue the home she needs and in order to pursue a romance with Grey.","language":"English","Reception":"The film received mostly negative reviews from critics. Leonard Maltin gave it one and a half stars out of four in his Movie Guide, and called it \"A John Hughes formula movie where the formula doesn't work\".[5] The staff of Halliwell's Film Guide called it \"Gruesomely sentimental and manipulative\".[6] Nigel Andrews of the Financial Times declared, \"John Hughes here graduates from the most successful comedy in film history to scripting and directing a large piece of non-biodegradable tosh.\"[6] Curly Sue holds a 14% rating according to Rotten Tomatoes based on 14 reviews.","box_office":"$33.6 million","cinematography":"Jeffrey L. Kimball","production_company":"Hughes Entertainment","directed_by":"John Hughes","release_dates":"October 25, 1991 (1991-10-25)|||||","curly_sue":"Theatrical release poster","produced_by":"John Hughes","starring":"James Belushi|Kelly Lynch|Alisan Porter|","running_time":"102 minutes","music_by":"Georges Delerue","edited_by":"Peck Prior Harvey Rosenstock","Release":"The film debuted at No. 2 at the box office[3] and grossed $33,691,313 in the U.S.[4] Warner Home Video released it on DVD on June 1, 2004 with commentary and an introduction by Porter on special features.","written_by":"John Hughes","budget":"$25 million[1]"}