{"country":"United States","distributed_by":"20th Century Fox","screenplay_by":"John Hopkins Bruce Graham","story_by":"John Hopkins","Plot":"The story begins on Wednesday March 22, 1995. Lionel Spalding (Glenn Shadix) arrives at the 5-Star Majestic Hotel where he is accidentally drenched by an overflowing fountain due to a prank by Kyle (Eric Lloyd) and Brian (Graham Sack), much to the stress and frustration of the hotel manager and the boys' father Robert Grant (Jason Alexander). He is disappointed with the boys but they are guaranteed a vacation afterwards, only to be forced to delay the trip for a third time by the ruthless hotel owner, Elena Dubrow (Faye Dunaway), due to the upcoming Crystal Ball where one of the guests is revealed to be a critic from the Le Monde Traveller Organization who they hope will reward the Majestic with a sixth star.At that moment, \"Lord\" Rutledge (Rupert Everett) a jewel thief (who is thought to be the critic by Mrs. Dubrow), arrives with an orangutan named Dunston, intending to steal the guests' jewelry. Dunston and his deceased brother Samson were both trained in thievery their whole lives. Now Dunston has been wanting to escape from Rutledge's poor treatment and life of crime ever since[citation needed].Meanwhile, Dunston flees from Rutledge and is later found by Kyle, who befriends the poor orangutan and promises to keep him safe. After becoming aware of Dunston's presence, Robert calls for an animal control specialist named Buck LaFarge (Paul Reubens) to remove Dunston from the hotel. Rutledge searches the hotel for Dunston, and after locating him, ties Kyle up. Dunston and Kyle escape to the ballroom where the Crystal Ball is taking place, obtaining a picture of Rutledge, Dunston, and Samson from Rutledge's room. Kyle and Brian show the picture to their dad, and Robert is infuriated when Kyle says Rutledge tied him up. Brian and Kyle search for Dunston, avoiding LaFarge and Mrs. Dubrow, while Robert and Rutledge fight in the kitchen. Robert eventually manages to stand up to Mrs. Dubrow, but is fired in the process. However, it turns out that Lionel Spalding, who had been humiliated and injured by Dunston's antics, was actually the critic all along. As a result, he immediately reduces the Majestic to a 1-star hotel. Rutledge is arrested and LaFarge apologizes to Dunston, who then punches him.In the end, Robert, Kyle and Brian relocate to Bali, to manage a Majestic hotel there, and have even managed to keep Dunston as their own pet. They invite Mr. Spalding over with a complementary room and meals to make up for all the trouble he experienced and assure him that nothing will go wrong this time. However, in the last scene, Dunston causes further trouble by dropping a large coconut which falls on his head.","language":"English","Reception":"The film had received overwhelming negative reviews from critics, and holds a 6% rating on Rotten Tomatoes. Despite this, the film received positive reviews from several professional film reviewers, Desson Howe and Rita Kempley of The Washington Post referred to the film by saying \"It ain't half bad.\" and \"Plucky, prank-filled family farce\" respectively.[1] Kevin Thomas of the Los Angeles Times stated that 'Dunston Checks In' \"is a delightful and funny family film of exceptional high style.\", \"as light as a souffle and just as delicious.\", and \"plays like a tribute to the resourceful, unpretentious studio productions of the past.\" giving the film five out of five stars.[2] According to an article published in the Chicago Tribune, \"The cast is talented, the hide-and-seek action is silly, and the bond between a sweet little boy and the adorable ape is touching.\"[3] Faye Dunaway's performance in the film earned her a Razzie Award nomination for Worst Supporting Actress, but did not win the award.","box_office":"$9,871,065","cinematography":"Peter Lyons Collister","directed_by":"Ken Kwapis","release_dates":"January 12, 1996 (1996-01-12)|||||","produced_by":"Todd Black Joe Wizan","starring":"Eric Lloyd Graham Sack Jason Alexander Faye Dunaway Rupert Everett Glenn Shadix Paul Reubens","running_time":"88 minutes","music_by":"Miles Goodman","dunston_checks_in":"Promotional poster","edited_by":"Jon Poll","budget":"$16 million"}