{"based_on":"Desert of the Heart  by Jane Rule","country":"United States","distributed_by":"The Samuel Goldwyn Company","Plot summary":"Set in 1959, Vivian Bell (Shaver), a 35-year-old English professor at Columbia University in New York City, travels to the Reno, Nevada area to establish residency in Nevada (a process that takes six weeks), in order to obtain a quickie divorce (which Nevada was especially well known for from the 1950s to the 1970s). She stays at a guest house ranch for women who are waiting for their divorces to be finalized. The guest ranch is owned by Frances Parker (Lindley).Vivian meets Cay Rivvers (Charbonneau), a younger, free-spirited sculptor to whom Frances is a surrogate mother. Cay works at a casino as a change operator in Reno, and is ending a relationship with Darrell, her boss, because as she put it, she \"allowed (her)self to be attracted to his attraction\" for her. When Vivian arrives, Cay notices her immediately, and tightly controlled and elegant Vivian, in turn, is taken aback by (yet strangely attracted to) Cay's boldness and lack of concern of what others think of her (and also of her romantic/sexual preferences). Cay reveals that she has had relationships with women in the past. Frances jealously notices that Vivian is becoming a bigger and bigger part of Cay's life, and resents her for it, afraid that Cay will leave her and the ranch, and she will be left alone. Frances sees Cay as her only \"family,\" even though Cay is not her actual child, but rather the daughter of Frances' \"man\" Glenn who has been dead several years.When everyone attends an engagement party for Cay's best friend and co-worker, Silver, Cay drives a drunken Vivian to see Lake Tahoe afterwards and kisses her. Vivian returns the kiss passionately and is so surprised by her response to Cay's advance that she begs Cay to take her home. When they return to the ranch in the early morning, Frances has Vivian's bags and a taxi waiting for her, furious (and wrongfully assuming) that she has seduced Cay. Cay leaves the ranch immediately, and Vivian takes a room at a casino hotel for the rest of her stay.After some days apart, both Cay and Vivian are clearly confused and hurt. Cay goes to visit Vivian at her hotel and overcomes Vivian's resistance to making love to another woman, and they begin a smoldering hot affair. With the impending finalization of Vivian's divorce, the two must sort out the future of their relationship. Vivian is afraid of what people in her academic circle will think of her being in a relationship with another woman, and Cay is unsure of what she would ever do in New York City. At Silver's wedding, Vivian and Cay are in attendance, Frances and Cay are brought back together, and Cay admits to Frances that Vivian has \"reached in and put a string of lights around my heart.\" In the final scene, after Vivian's divorce has become finalized, she packs up and goes to the train station to return to New York. Cay accompanies her to the station, and as the train is pulling out, Vivian convinces Cay to come with her, at least as far as the next station.","screenplay_by":"Natalie Cooper","DVD release":"Desert Hearts was released on Region 1 DVD on January 23, 2001. A new 2-Disc Collector's Edition DVD, on Region 1, was released in North America on June 6, 2007.","language":"English","Critical reception":"Desert Hearts is notable for being the first film to depict a lesbian relationship where both characters enjoy a satisfactory ending, in contrast to previously released films such as Personal Best that focus less on the relationship of the main characters, and where one returns to a relationship with a man.[3]The New York Times wrote that the film is \"so earnest and sincere that it deserves an A for deportment,\" but criticized the lack of imagination in the writing and characters.[4] However, The Times praised the film wholeheartedly, including both actors in the leading roles, writing \"Fuelled by vibrant performances and an expert script that articulates feelings without ascending into wordy clouds, Desert Hearts rises far above such pigeon-hole categories as the nostalgic period drama or the lesbian love-story. Deitch's film is a passionate, beautifully controlled drama about making choices and exercising the heart: in a word, about living.\"[5] The Washington Post also praised the film highly, calling it \"polished\" and remarking, \"Donna Deitch's first feature, touches something about love that few movies even hint at - not the tremulousness, or the hiding and jousting (although there is that), but the way the attraction of two lovers warps the world around them, throws it out of whack,\" although criticizing some aspects of the cinematography.[6] Desert Hearts has an 83% rating at Rotten Tomatoes, and Roger Ebert gave Desert Hearts two and a half stars for the simplicity and directness of the film, but noting the surprising power of the romantic scenes.[7]In time, however, the film has been recognized for its quality and impact. In 1996, The Sydney Morning Herald declared, \"Donna Deitch's 1985 Desert Hearts is widely regarded as one of the best and most significant mainstream fiction films about lesbians.\"[8] The Globe and Mail referred to it as \"one of the first and most highly regarded works in which a lesbian relationship is depicted favourably.\"[9]Helen Shaver has said that Greta Garbo was so impressed with her performance in the film that they attempted to meet but due to Garbo's poor health instead discussed her performance over the phone. Patricia Charbonneau, in turn, learned that model Gia Carangi patterned herself after Cay's character.[10]Author and lesbian literary critic Camile Paglia praised the movie for its riveting performances, having seen it 11 times in theaters. She claims that Patricia Charbonneau's \"magic\" comes from hormonal glow, as she had found out she was pregnant before shooting began, and was sick on the set. In her landmark work Sexual Personae, Paglia said the lanky, spirited, mercurial Charbonneau would have made a perfect transvestite Rosalind in Shakespeare's As You Like It.[11]","box_office":"$2.5 million[2]","cinematography":"Robert Elswit","directed_by":"Donna Deitch","Production notes":"It took director Donna Deitch four years and eventually selling her home in order to raise the $1.5 million to make the film. (Deitch makes a cameo appearance as a heavily accented woman playing two slot machines at a time. Her line: \"If you don't play, you can't win.\") She also encountered difficulty finding actors who would portray lesbians so explicitly.[12]Deitch was surprised to learn 20 years after the film's release that both actors were told by their friends and agents that the film would ruin their careers. In a 1986 interview, Shaver told the story that she was up for a role in Joshua Then and Now, which would have promoted her career much farther than Desert Hearts. Donna Deitch assured her over the phone that she was right for her movie and told her she refused to hang up the phone until she got an answer. After five minutes, Shaver accepted the role.[13] Shaver explained her feelings about the film. \"I was scared, not about the lesbianism — the script said, 'The passion builds' in the love scene, so once I knew how the passion built and where the camera would be, that was fine — but because someone wanted me to do what I'd wanted to do all along, and here it was, and all I had to do was say yes. I had always wanted to carry a movie. Now, if I never make another one, I've done this. For the first time, I feel I've done a complete work on film.\"[13]Patricia Charbonneau discovered the day before filming began that she was pregnant, although it mostly didn't show since the filming took 35 days. In an interview in 1986, Charbonneau said, \"When I first read it, I thought, 'Well, everything that I've done so far people have taken a risk with me. I wanted to do something that at least people would talk about. Even if they hated it, they'd be talking about it.\"[14] Commenting on doing such an explicit love scene, Charbonneau said, \"Kissing Helen wasn't the hard part, really. The hard part was just walking out on the set naked and just standing there.\"[14]Deitch insisted that the lesbian sex scene, rated by many viewers as the best in cinema, not be edited or altered in any way. When producers of The L Word began production of that television show, they required the actors to view Desert Hearts to show them a well-made lesbian love scene.[15]Deitch mentioned in the director commentary of the 20th anniversary DVD release that approximately 20% of her budget went to obtaining the rights to the original music in the film. The soundtrack included songs by Patsy Cline, Elvis Presley, Buddy Holly, Ella Fitzgerald, Patti Page, Kitty Wells, Johnny Cash, Ferlin Husky, and Jim Reeves. Deitch asked the studio to extend the rights to the music to release a soundtrack on record or cassette, but the studio declined.Helen Shaver met her husband, key grip Steve Smith, on the set of this film. They have been married since 1988.","desert_hearts":"Theatrical release poster","release_dates":"August 28, 1985 (1985-08-28)","produced_by":"Donna Deitch Cami Taylor","starring":"Helen Shaver Patricia Charbonneau Audra Lindley Andra Akers Gwen Welles Dean Butler","running_time":"96 minutes","edited_by":"Robert Estrin","budget":"$1.5 million[1]"}