{"based_on":"The storybook  by David Lee Miller","country":"United States","distributed_by":"Buena Vista Distribution","Plot":"During an expedition into Central Africa, paleontologist Dr. Susan Matthews-Loomis (Sean Young) and her husband George Loomis (William Katt) attempt to track down evidence of a local monster legend. The monster, which the local natives refer to as Mokèlé-mbèmbé, shares many characteristics with the Sauropod order of dinosaurs. During the expedition, they discover a pair of living brontosaurs in the deep jungle and are further amazed when the animals show very little fear of them. The couple begins observing the creatures and become especially enamored with the curious young offspring of the pair, whom they nickname \"Baby\". Unfortunately, the discovery soon places the dinosaurs in jeopardy from both the local military as well as fellow scientist Dr. Eric Kiviat (Patrick McGoohan).Whereas Dr. Kiviat sees Baby and his parents as his ticket to fame & fortune, the African military led by Colonel Nsogbu (Olu Jacobs) sees the dinosaurs as a threat and makes several attempts to destroy them. During one such attempt, one of the adult Brontosaurs is killed and the other captured. The Loomises are able to escape with Baby, but quickly find themselves lost in the jungle while being pursued by Colonel Nsogbu's forces. After finally escaping their pursuers, the pair decide to circle back and rescue the captive parent, whom Dr. Kiviat has persuaded Nsogbu to transport back to civilization.With the aid of the local tribe - whom see Baby and his parents as legends - George and Susan are able to break into the military compound and release the adult Brontosaur. During the escape, both Kiviat and Nsogbu are killed. Afterwards, the Loomises take the pair to a secluded jungle lagoon and say a tearful goodbye to Baby as he follows his lone parent away into the deeper parts of the jungle.","baby:_secret_of_the_lost_legend":"Theatrical release poster","language":"English","Reception":"Baby: Secret of the Lost Legend received generally negative reviews; the film currently holds a 15% 'rotten' rating on review aggregate website Rotten Tomatoes based on 13 reviews.[3]","box_office":"$14,972,297[1]","cinematography":"John Alcott","production_company":"Touchstone Films Silver Screen Partners II","directed_by":"Bill L. Norton","Soundtrack":"The score to Baby: Secret of the Lost Legend, a hybrid of orchestral and synthetic elements, was composed and conducted by veteran composer Jerry Goldsmith. Goldsmith recalled the experience with such fondness that he insisted it be included in an industry tribute album featuring highlights from his scores in 1993. A limited extended soundtrack was released 8 April 2008 through Intrada Records and features sixteen tracks of score at a running time just over fifty-three minutes.[4]","release_dates":"March 22, 1985 (1985-03-22)|||||","Production":"The dinosaur effects are all animatronic, since the CGI technology of the time was not sophisticated enough to convincingly portray living creatures such as dinosaurs (it would be another 8 years before that hurdle was cleared in Jurassic Park).A recut version aired on television in 1989 under the title Dinosaur...Secret of the Lost Legend as part of the Wonderful World of Disney.[2]","produced_by":"Jonathan T. Taplin Roger Spottiswood","starring":"William Katt|Sean Young|Patrick McGoohan|","running_time":"95 minutes","music_by":"Jerry Goldsmith","edited_by":"David Bretherton Howard Smith","written_by":"Clifford Green Ellen Green"}