{"based_on":"Les Liaisons dangereuses  by Choderlos de Laclos","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Roger Kumble","Plot":"In an upscale New York City mansion, wealthy and popular Kathryn Merteuil (Gellar) is discussing her prep school with Mrs. Caldwell (Christine Baranski) and Mrs. Caldwell's daughter Cecile (Selma Blair). Kathryn promises Mrs. Caldwell that she will look out for the sheltered and naive Cecile. Sebastian (Phillippe) enters and Mrs. Caldwell reacts to him coldly and leaves with Cecile. Kathryn reveals that her real intention is to use Cecile to take revenge on Court Reynolds, her ex-lover, who had dumped her for Cecile. Kathryn asks her step-brother Sebastian to seduce Cecile; he refuses as he is planning to seduce virgin Annette Hargrove (Witherspoon), the daughter of their school's new headmaster. Annette is a 'paradigm of chastity and virtue' who recently wrote a published essay about saving herself for marriage and has been temporarily staying with Sebastian's aunt. The two make a wager: If Kathryn wins, she gets Sebastian's vintage Jaguar XK140; if Sebastian wins, Kathryn will have sex with him. It is mentioned that Sebastian keeps a journal detailing his conquests.Sebastian's seduction of Annette fails, as she had already been told of his reputation. He vents to his friend, Blaine Tuttle (Joshua Jackson), who suggests that the informant might be Annette's ex-boyfriend and closeted jock, Greg McConnell (Eric Mabius). Blaine reveals to Sebastian that Greg tried to make a pass at him and uses that to seduce him. Sebastian confronts Greg with photographic evidence of his homosexuality, he denies warning Annette. Greg agrees to find out who did, and Sebastian also orders him to laud Sebastian as misunderstood. Later, Greg gushes about Sebastian to Annette and discovers that the culprit is Mrs. Caldwell. Wanting revenge on the Caldwells, Sebastian tells Kathryn he will now seduce Cecile.Cecile's music teacher, Ronald Clifford (Sean Patrick Thomas) is in love with her. Cecile confesses this to Kathryn. Kathryn tells Mrs. Caldwell about Ronald and Cecile's romance and Mrs. Caldwell intervenes in their relationship. Sebastian, in turn, calls Cecile to his house, ostensibly to give her a letter from Ronald. There, he blackmails Cecile and performs oral sex on her. The next day, Cecile confides in Kathryn, who advises her to learn from Sebastian so that she can make Ronald happy in bed.Sebastian falls in love with Annette, who returns his feelings but still resists him. Sebastian calls her a hypocrite because she claims to be waiting for her one true love, but when her one true love chooses to love her back, she resists. She relents, but Sebastian refuses her, confused about his feelings colliding with his stolid sexuality. Annette flees to the estate of her friend's parents. Sebastian tracks her down, professes his love, and makes love to her. As he has won the bet, Kathryn offers herself to Sebastian the next day, but he refuses; he now only wants Annette. Kathryn taunts him and threatens to ruin Annette's reputation, so Sebastian pretends indifference to Annette and coldly breaks up with her.After Sebastian tells Kathryn that he has broken up with Annette and arranged for Cecile and Ronald to be together, Kathryn reveals that she has known all along that he was truly in love with Annette and manipulated him into giving her up. Sebastian angrily dismisses Kathryn, saying he no longer wants her, and she then rejects him. Sebastian leaves, and Kathryn calls Ronald to tell him that Sebastian slept with Cecile and (falsely) inform him that Sebastian hit her. Sebastian confronts Annette, but she refuses his apologies; he sends her his journal, in which he has detailed all of Kathryn's manipulative schemes as well as their bet, and written the true feelings he had for Annette all along. When Sebastian starts heading home, Ronald confronts him on the street, and a fight ensues. Annette runs out and tries to stop it, but is thrown into the way of traffic. Sebastian pushes her to safety, and is hit by a cab. Before he dies, Sebastian and Annette profess their love for each other. Watching this, Ronald realizes that Kathryn lied to him about Sebastian with intent on using him to hurt her step-brother.At Sebastian's funeral, Cecile distributes copies of Sebastian's journal, made into a book by Annette, titled \"Cruel Intentions\". Kathryn is humiliated and rejected by her former friends, and her reputation is ruined when the drugs hidden in her rosary are discovered. Annette drives away in Sebastian's car with his journal at her side as she remembers the moments they shared.[4]","language":"English French","Reception":"The film received mixed reviews from critics. Rotten Tomatoes gave the film a score of 49%, based on reviews from 78 critics, with an average score of 5.3/10; the site's consensus stating: \"Even in a slick package and an attractive cast, the movie succumbs to bad acting and a bad script.\"[5] Metacritic gave the film an average score of 56% based on reviews from 24 critics.[6] However, the film has gained somewhat of a cult following and is considered to be one of the first films to confront teenage sexuality and sexual manipulation[citation needed]. Charles Taylor of Salon.com described the film as \"The dirtiest-minded American movie in recent memory - and an honestly corrupt entertaining picture is never anything to sneeze at.\"[7] Stephen Holden The New York Times stated, \"You have the queasy sense that the whole thing is just an elaborate stunt, and in this case an exploitative one.\"[8] Despite this, Roger Ebert—a noted film critic for The Chicago Sun Times—praised Cruel Intentions and gave the film three out of four stars in his review. He stated that it was \"smart and merciless in the tradition of the original story\".[9]Cruel Intentions was a commercial success. The film grossed $13,020,565 in its opening weekend, ranking #2 behind Analyze This; released in 2,312 theaters, the movie raked in $75,902,208 worldwide.[1]","box_office":"$75.9 million[1]","cinematography":"Theo van de Sande","production_company":"Original Film Newmarket Capital Group","directed_by":"Roger Kumble","cruel_intentions":"Theatrical release poster","Awards":"The film received the following awards and nominations:","Soundtrack":"The Cruel Intentions soundtrack is a compilation soundtrack released on March 9, 1999 by Arista/Virgin Records. It reached number 60 on the Billboard chart.[citation needed]The lead track for the film was \"Bitter Sweet Symphony\" by rock band The Verve.","release_dates":"March 5, 1999 (1999-03-05)|||||","produced_by":"Neal H. Moritz","starring":"Sarah Michelle Gellar Ryan Phillippe Reese Witherspoon Selma Blair","running_time":"97 minutes","Sequels":"The film received two direct-to-video sequels, Cruel Intentions 2 in 2000 and Cruel Intentions 3 in 2004. Written and directed by Roger Kumble, the former was assembled from Manchester Prep, a scrapped prequel series by FOX, of which three episodes had been filmed. It features younger versions of the characters of Valmont and Merteuil, played by Robin Dunne and Amy Adams. The latter sequel was directed by Scott Ziehl and features a different cast of characters.NBC announced in October 2015 that they had picked up a pilot for a continuation of the film's storyline. The pilot was to be written by Kumble and the creators of Cruel Intentions: The Musical, Jordan Ross and Lindsey Rosin, with Sebastian Valmont and Annette Hargrove's son being the main character.[3][10]In February 2016, Deadline.com reported that producers are in talks with Gellar to reprise the role as Kathryn Merteuil in the television sequel.[3] On February 23, 2016, Taylor John Smith and Samantha Logan were both cast, with Smith playing the male lead role of Bash Casey, Sebastian Valmont and Annette Hargrove's son.[11] On February 24, 2016, Gellar reached a deal with producers to be the female lead, reprising her role as Kathryn Merteuil.[12] On March 1, 2016, the role of Annette Hargrove (the role portrayed by Reese Witherspoon in the movie) was recast with Kate Levering.[13]","music_by":"Edward Shearmur","edited_by":"Ryan Mikel","budget":"$10.5 million[1]"}