{"based_on":"original characters  by Julie Delpy","Cast":"Albert Delpy is Julie Delpy's real-life father.[4]","country":"Belgium|France|Germany|","distributed_by":"Magnolia Pictures","screenplay_by":"Julie Delpy|Alexia Landeau|","story_by":"Julie Delpy|Alexia Landeau|Alex Nahon|","Plot":"Parisian Marion is living in New York with her son, in order to be closer to Jack, the boy's father (Marion's ex-boyfriend from 2 Days in Paris).[2] She and her new boyfriend Mingus have a cozy relationship until the arrival of Marion's father, sister and sister's boyfriend, on vacation from France. The group's two days together are tested by \"unwitting racism and sexual frankness\", with no one left unscathed.[3]","language":"English|French|","Reception":"According to Steve Rose of The Guardian, \"Delpy's alter ego Marion\" is a \"lovable mess of neurotic babble, intellectual uncertainty and unmanageable lies\"; the film is a \"delightfully eccentric comedy,...big on laughs, low on pretense, exaggerated but emotionally sincere—not least in Delpy's dealing with the death of her mother (in real life as well as in the movie). We've rarely seen comedy this smart since Woody Allen and Seinfeld left New York.\"[8] Total Film's Neil Smith said the film is a \"haphazard meditation on Franco-American relations, which hurls screwball situations, oddball cameos and the odd one-liner liberally at the screen without much caring if any of them stick.\"[6] Smith concludes \"what it all adds up to is an anything goes take on modern relationships with a side order of broad stereotype. Expect to be amused and bemused in equal quantities and you’ll be amply entertained.\"","box_office":"$1,653,792[1]","Festival and theatrical releases":"2 Days in New York premiered at the Sundance Film Festival on January 23, 2012.[3] The film was shown April 26, 2012 at the Tribeca Film Festival[5] and May 21, 2012 at the Seattle International Film Festival.[2]2 Days in New York went into theatrical release in France on March 28, 2012,[citation needed] and in the United Kingdom on May 18, 2012.[6] It was scheduled for release in the United States on August 10, 2012.[5]Following the film's Sundance premiere, distribution rights in Scandinavian and Baltic countries were acquired by Stockholm-based NonStop Entertainment.[7]","cinematography":"Lubomir Bakchev","production_company":"Polaris Films","2_days_in_new_york":"Theatrical release poster","directed_by":"Julie Delpy","release_dates":"March 28, 2012 (2012-03-28) (France)|||||","produced_by":"Scott Franklin|Ulf Israel|Christophe Mazodier|Jean-Jacques Neira|Hubert Toint|","starring":"Chris Rock|Julie Delpy|Albert Delpy|Alexia Landeau|Alex Nahon|Dylan Baker|Kate Burton|","running_time":"96 minutes","music_by":"Arnaud Boivin|Jean-Michel Zanetti|","edited_by":"Julie Delpy"}