{"country":"UK","distributed_by":"Anglo-Amalgamated (UK) American International Pictures (US)","Plot":"In 1940s England, Dr. Rossiter (Anton Diffring) is a plastic surgeon wanted by the police after an operation goes hideously wrong. However, believing himself to have brilliant abilities as a surgeon, he and his assistants (Kenneth Griffith and Jane Hylton) evade capture and escape to the Continent. There Rossiter changes his name to Schüler, and befriends a circus owner (Donald Pleasence) on whose deformed daughter Nicole (played by Carla Challoner as a child, Yvonne Monlaur as an adult) he operates.Schüler manipulates his way into running the circus, taking it over when the owner dies in a \"freak accident\". A decade later, he is running an internationally successful circus, which he uses as a front for his surgical exploits. He befriends deformed women and transforms them for his \"Temple of Beauty\". However, when they threaten to leave, they meet with mysterious accidents which raise the suspicions of local police (Conrad Phillips among them), who are soon on his trail.","circus_of_horrors":"Theatrical poster to Circus of Horrors (1960)","cinematography":"Douglas Slocombe","production_company":"Lynx Films Limited","directed_by":"Sidney Hayers","release_dates":"1960","Production":"After the success of Horrors of the Black Museum, Anglo-Amalgamated and AIP tried to duplicate its success with this film.[1]The film was shot at Beaconsfield Film Studios, with location filming on Clapham Common in London and in Old Amersham, Buckinghamshire. Billy Smart's Circus provided the big top and some of its performers appeared as extras.[2][3]The score was provided between Franz Reizenstein and Muir Mathieson. Douglas Slocombe was the cinematographer.The song \"Look For A Star\", written by Tony Hatch under his pseudonym Mark Anthony, originated in this movie. In the United States, there were four versions issued at the same time that charted:In the UK the original Garry Mills version was released on the Top Rank label and reached #7 in the charts in July 1960 (the Garry Miles version was also released, but failed to chart at all).","produced_by":"Leslie Parkyn Julian Wintle executive Nat Cohen Stuart Levy","starring":"Anton Diffring Erika Remberg Yvonne Monlaur Donald Pleasence Jane Hylton Jack Gwillim","running_time":"87 min.","music_by":"Franz Reizenstein Muir Mathieson","edited_by":"Reginald Mills","written_by":"George Baxt"}