{"based_on":"Fair Game 1978 novel  by Paula Gosling","country":"United States","cobra":"Theatrical release poster","distributed_by":"Warner Bros.","screenplay_by":"Sylvester Stallone","Plot":"An armed gunman causes a hostage situation at a Los Angeles grocery store. When negotiations between him and the law fail, Marion Cobretti (codenamed \"Cobra\") (Sylvester Stallone), a member of an elite division of the Los Angeles Police Department known as the \"Zombie Squad\", is summoned to the scene. Cobretti infiltrates the store, locates, and negotiates with him. During the negotiation, the criminal speaks of the unknown \"New Order\", a group of social darwinist radicals that despise modern society and believe in killing the weak, leaving only the strongest and smartest to rule the world. Cobretti then kills the gunman by throwing a knife at his abdomen and firing shots at him.As the bodies are removed from the supermarket, Cobretti is admonished by Detective Monte (Andrew Robinson) for his seeming disregard for police procedures and protocols. Harassed by reporters, Cobretti admonishes them for failing to put the safety of potential victims first. Little does everyone realize at the time is that the supermarket hostage crisis is only one of a string of recent and seemingly unconnected acts of violence and murder that have broken loose in Los Angeles, perpetrated by the same supremacist group the supermarket gunman mentioned.After witnessing several individuals going on a spree killing, including the New Order leader, only identified as 'The Night Slasher' (Brian Thompson), model and businesswoman Ingrid Knudsen (Brigitte Nielsen) becomes the group's main target due to her being the only living witness to their crimes. After a failed attempt on her by the group, she is placed under the protective custody of Cobretti and his partner, Sergeant Tony Gonzales (Reni Santoni). Several more attempts are made on their lives by various people connected to the Order. Cobretti theorizes that there is an entire army of killers operating with the same modus operandi rather than a lone serial killer with some associates, but his suggestion is rebuffed by his superiors. However, the LAPD agrees with Cobretti that it will be safest if he and Knudsen relocate from the city.Cobretti becomes romantically involved with Ingrid shortly after venturing out into the countryside, but one of the Order's leaders, Nancy Stalk (Lee Garlington), a police officer escorting the Cobretti party, reveals the location of their whereabouts. Despite Cobretti's suspicions and mistrust of Nancy, he does nothing and stays the night in a motel. The Order moves in at dawn and besieges the small town. With barely enough time to react, the attackers storm Cobretti and Ingrid's motel, wounding Gonzales in the process. Killing several members but with more swarming into the town, Cobretti and Ingrid escape in a pickup truck. After the truck becomes severely damaged from the chase, the two travel on foot into a lemon grove and escape into a nearby derelict factory.Cobretti has defeated most of the Order by this point, with the few remaining members following them into the building. After eliminating every member except for the Night Slasher himself, he and Cobretti engage in a hand-to-hand fight inside the steel mill, ending with the Night Slasher being impaled in the back by a large roaming hook and burned alive by Cobretti.In the aftermath, Cobretti's department arrives and begins clean-up of the town, giving medical aid to Gonzales. Detective Monte (Andrew Robinson) appears apologetic but confronts Cobretti again about his lack of regard to police protocols, offering to discuss the issue over a long dinner. Cobretti punches Monte instead, and the ending credits begin as Cobretti and Ingrid climb onto one of the motorcycles left by the Order and ride away.","language":"English","Reception":"Cobra was a critical failure. Review aggregation website Rotten Tomatoes retrospectively gave the film a score of 13% based on reviews from 16 critics.[12] Much criticism was aimed at its plotting and dialogue, which were seen as merely rehashing common action film tropes. The level of violence (even after re-editing) was also considered gratuitous.The TV Guide stated that \"Stallone's character is an empty hulk...the few attempts to provide us with little insights into his character are downright laughable.\"[13] The New York Times opined that the film \"pretends to be against the wanton violence of a disintegrating society, but it's really the apotheosis of that violence....[it] shows such contempt for the most basic American values\".[14]Cobra was nominated for six Razzie Awards, including Worst Picture, Worst Actor (Sylvester Stallone), Worst Actress (Brigitte Nielsen), Worst Supporting Actor and Worst New Star (both for Brian Thompson) and Worst Screenplay.[15]Director Nicolas Winding Refn is a huge fan of Cobra. In Refn's cult movie Drive the main character has a toothpick in his mouth in some scenes; this is Refn's homage to the opening scene of Cobra where Stallone has a matchstick in his mouth. Main star of the movie Ryan Gosling also said in interview that he is a fan of Stallone and Cobra which is why he \"borrowed\" his character's toothpick habit from Cobra.[16]Cobra debuted at No.1 at the box office and was a huge financial success, with a Memorial Day weekend debut of $15.6 million.[4] It eventually went on to gross $160 million,[2] over six times its estimated $25 million budget.[1]","box_office":"$160 million (Worldwide)[2]","Music score":"An audio cassette and vinyl version were released on September 21, 1988, followed by a CD which was released in 1992 as the Original Motion Picture Soundtrack.[17]Stan Bush's song \"The Touch\", heard in Transformers: The Movie (1986) was originally written for Cobra.[18]","cinematography":"Ric Waite","production_company":"The Cannon Group","directed_by":"George P. Cosmatos","release_dates":"May 23, 1986 (1986-05-23)","Production":"When Sylvester Stallone was signed to play the lead in Beverly Hills Cop, he decided to rewrite the script almost completely, removing nearly all the comedic aspects and turning it into an action movie that he felt was better suited to him. The studio read his revised script, and they rejected it, citing action scenes that were far beyond what their projected budget would allow. Stallone eventually left Beverly Hills Cop, and he channeled his ideas for that movie into an original script.The novel Fair Game by Paula Gosling was cited as source material, enough so that she received a screen credit. When Cobra came out, Sylvester Stallone allegedly wanted the novel to be reissued with himself credited as co-author. Ms. Gosling declined the offer. The 1995 movie Fair Game was also based on the same novel by Ms. Gosling.Just like Cobra, Fair Game was also re-edited by Warner Bros. in post production. In Fair Game, the test audience disliked the original cut of the movie so much that heavy re-shoots and re-editing were done to try to improve the film, while Cobra needed much additional editing because the film was so graphically violent that, at first, it received an X rating from the MPAA. Warner Bros. also did not like the level of gore and violence of the first rough cut, which is why they would not release the movie until most of those scenes were deleted and the movie garnered an R rating, instead. Few other Sylvester Stallone films made for Warner Bros. had similar problems with re-edits and re-shoots which were forced by studio or Stallone himself, such as Tango & Cash, Demolition Man and The Specialist.Brian Thompson auditioned seven times before he was hired. On the fourth audition he met Stallone, who thought that Thompson was too nice to play Nightslasher. But after a screen test, he immediately got the job. Also in original script, Nightslasher was called Abaddon, possibly after the \"angel of the abyss\" from the bible.Thompson repeatedly sought Stallone's advice about how to play Nightslasher, including questions about his background and personal motivations, but Stallone showed no interest in the subject and told Thompson that the character was simply evil. In an unfortunate surprise for Thompson, after filming was completed, director Cosmatos unexpectedly told him: \"You could have been good if you had listened to me.\"Cobra reunited two actors from the movie Dirty Harry: Reni Santoni, and Andy Robinson.Brigitte Nielsen was cast as Ingrid Knudsen. At the time she was dating Stallone.Originally, the movie was to be filmed in Seattle, climaxing with a motorcycle chase scene on a ferry between the islands. Even though everything was prepared to start filming the final theatrical version of the scene at night, Stallone demanded for ending to be changed because of the mosquito problem at that time, which would have made night time filming very difficult to endure.The supporting cast and extras were forbidden from talking to Stallone on set.[7]At one point during filming, Stallone complained to cinematographer Ric Waite that they were falling behind and that he needed to push his crew to work harder. Waite responded by telling Stallone that the delays were due to his fooling around with Briigitte Nielsen and showing off for his bodyguards. Although Stallone was shocked that somebody would talk to him that way, he cleaned up his act and behaved more professionally, although he returned to his old egocentric behavior a few weeks later. Waite later said in interview that, despite his huge ego, Stallone had a great sense of humor. He also confirmed a rumor that Stallone was the true director of the film, calling George P. Cosmatos a good producer but a bad director.[8]For Nightslasher's monologue in the lead-up to the final fight, Brian Thompson did the scene with a script girl standing in for Stallone, who was busy watching a basketball game on TV.The custom 1950 Mercury driven by Cobretti was actually owned by Sylvester Stallone. The studio produced stunt doubles of the car for use in some of the action sequences, such as the jump from the second floor of the parking garage. The coupe was with a 350 cubic-inch Chevrolet engine, outfitted with a blower for added horsepower, a Hearst automatic shifter and a 400 hydro transmission with a shift kit. The car could go from zero to sixty miles per hour in four seconds and hit speeds of 140 miles per hour. A hood scoop was added to the front end, headlights and tail lights were rounded, and most of the decorative chrome was removed. The production built three Cobra cars for stunt work. Although they were identical on the outside, their moving parts were designed for specific sequences, involving high-speed swipes with other vehicles, 180-degree turns, jumps, and 360-degree spins.[9]The knife used by the Night Slasher was made for the film by knife designer Herman Schneider. Sylvester Stallone asked Schneider to create a knife that audiences would never forget.Cobretti uses a custom Colt Gold Cup National Match 1911 chambered in 9mm. The 9mm variant was made specifically for the film (normally it fires 45 acp). Later in the film he uses a Jati-Matic submachine gun.There was originally a scene in which Cobretti uses ASP 9 as a backup gun but it was cut during re-editing of the movie.[10]LAT article reported that the film’s body count amounted to twenty-five good guys dead, and forty-two bad guys dead.The first rough cut was over two hours long (the closest estimated original running time is 130 minutes). It was then shortened to a roughly two-hour director's cut which was intended to be released in theaters. However, after Top Gun became a smash hit, Stallone and Warner Bros. were worried that Cobra - which would premiere the following week - would be overshadowed, so in order to ensure at least one extra screening each day the movie was heavily re-edited. Stallone removed much of the plot and scenes involving characters other than his own. Warner Bros. also demanded that the more graphic scenes be cut down or removed entirely because they were \"too intense,\" and that some action scenes be cut for pacing.[11]When first submitted to the MPAA the film received an X rating, necessitating even more cuts. The full extent of the censorship is unknown, but based on director Cosmatos's commentary and several other sources, some of the cut scenes include:Besides these cuts, a few scenes in which the Night Slasher and his gang are killing people were slowed down (for continuity reasons since demanded cuts made the editing of the scenes look choppy), while some of the shootouts which were originally in slow-motion were instead played at normal speed (in order to cut prolonged death scenes of gang members, plus close ups of many bullet holes which were also cut).Eventually, the movie received an R rating and was released in theaters with a running time of 84 minutes, approximately 50 minutes shorter than the first assembly cut and 30 to 40 minutes shorter than the director's cut.Much of David Rasche's role was cut. In the behind-the-scenes making of documentary available on DVD/Blu-ray, an additional (deleted) scene with him and Brigitte Nielsen is shown being filmed.The car chase between Cobretti and the Night Slasher was originally longer and ended differently. In the theatrical version Nightslasher shoots at Cobretti's car and causes him to crash into the boat. In the original version Night Slasher and his driver are the first ones who crash into the boat; Cobretti fails to stop his car in time and crashes into them. Shots of Night Slasher's car turning around and him breathing in relief after Cobra crashes his car were taken from an earlier part of the chase and the shot of Cobretti seeing the boat before he crashes into it was actually taken from Nightslasher's car crash. In the theatrical version, Night Slasher's crashed car is still visible in scene where Cobretti crashes into the boat.The first cut of the movie featured a slightly different version of the climactic confrontation between Nightslasher and Cobretti. Where the final version features a longer exchange between the two, in the earlier version Cobretti appears right after Nightslasher screams \"We are the future!\" and reiterates his line from the opening scene: \"You're the disease, and I'm the cure.\" Nightstalker's monologue about the law and Cobretti's duty as a policeman is omitted; instead, they stare at each other before Stalk attacks Cobretti. There is a noticeable continuity mistake in the final version: when Stalk jumps on Cobra there is a fire behind him, which isn't visible during the preceding conversation. This is because Stallone's closeups were shot later in a different location.The official soundtrack release includes a track called \"Skyline\" which is not heard anywhere in the movie. This is because scenes in which this track was used were cut during the re-editing. Originally there was a scene in which Cobretti is sitting in his home, looking at the sunset (there is a similar scene in the beginning of theatrical version in which he is cleaning up his gun and then looks out the window) and soon, right after Nightslasher and his gang members have killed the second victim and cops show up at the scene, Cobretti gets a call to go and meet with them. \"Skyline\" was also originally used in some other scenes, including the ending, but it was removed and replaced with \"Voice Of America's Sons\" by John Cafferty.Although no uncut version or director's cut has ever seen an official release, a timecoded workprint sourced from poor quality VHS copies is available as a bootleg. It contains all of the X rated scenes and uncut action sequences, along with scenes explaining the motives of the New Order gang, focusing on characters such as Nightslasher and Stalk, alternate lines of dialogue and a temporary score which contains some of the songs and music from the theatrical version and pieces of scores from other movies.","produced_by":"Menahem Golan Yoram Globus","starring":"Sylvester Stallone|Brigitte Nielsen|Reni Santoni|","running_time":"87 minutes","music_by":"Sylvester Levay","edited_by":"James R. Symons Don Zimmerman","budget":"$25 million[1]"}