{"mandarin":"Qiàn Nǚ Yōu Hún","country":"Hong Kong","Awards and nominations":"Composer/Lyricist: James Wong Singer: Sally YehComposer/Lyricist: James Wong Singer: Leslie CheungComposer/Lyricist:/Singer: James WongComposer/Lyricist:/Singer: James Wong","Plot":"Ning Choi-san is a timid debt collector whose job requires him to travel to rural areas.[4] He arrives at a town but is forced to seek shelter in a deserted temple in the forest on the outskirts because he ran out of money due to his inability to collect the debts as initially planned. That night in the temple, Ning meets a beautiful and alluring young maiden called Nip Siu-sin and falls in love with her. However, when he later recalls that night's events the next day, he becomes increasingly fearful and superstitious because a Taoist mystic told him that the people he saw at the temple were ghosts. That night, he returns to the temple to spend the night there and confirms his theory that Nip is actually a spirit.Nip tells him her story of how she became eternally bound to the servitude of a sinister Tree Demoness. She explains that as long as her remains are buried at the foot of the tree, her spirit will be forever enslaved by Tree Demoness. Ning attempts to free her from her suffering. He seeks the help of a powerful Taoist priest and master swordsman called Yin Chik-ha, whom he met earlier. Yin battles the Tree Demoness and attempts to free Nip's soul but fails. Nip's soul is taken to the underworld for betraying her master.Ning is unwilling to give up on Nip and insists that Yin help him. Yin manages to open a temporary portal to the Underworld. Ning and Yin enter the Underworld and attempt to free Nip's soul from suffering. They are unable to find her in the midst of thousands of other spirits. Eventually, Ning and Nip are able to see each other briefly near dawn when they come back from the Underworld after the fight. Sunlight shines on the urn containing Nip's cremated remains, but Nip cannot be exposed to sunlight or her soul will disintegrate. Ning holds on to a curtain to shield the urn from sunlight as he has a final conversation with Nip. Nip tells Ning that the only way to save her soul is to place her remains to rest at another more auspicious burial site before she returns to the darkness. Ning follows her instructions and with Yin's advice, Ning buries Nip's remains near the crest of a hill. He burns a joss stick for her and prays for her soul while Yin watches solemnly behind him.","a_chinese_ghost_story":"Hong Kong film poster for A Chinese Ghost Story","Reception":"From contemporary reviews, Walter Goodman (The New York Times) noted poor subtitling on the print he viewed, opining that \"If there are any Eastern profundities emanating from the temple, this Westerner did not recognize them.\" and that \"The kick you get from all this will depend on how exciting you find explosive exhibitions of extraterrestrial exercises.\"[14] Kim Newman (Monthly Film Bulletin) described the film as \"an excellent example of the distinctive type of ghost/horror film that has been coming out of Hong Kong for many years\" and that the film \"affords an insight into a movie mythos at least as highly developed and ritualized as the Universal horror cycle of the 30s or the Hammer films of the 50s and 60s\"[3]From retrospective reviews, The Guardian described the film as \"one of the breakthrough films of modern Hong Kong cinema\" and that it was\"dubious knockabout comedy [...] spiced with frantic set piece stunts (mid-air fights, thousand-foot tongues); not for those who value comprehensibility over panache.\"[15] Empire gave the film four stars out of five, noting \"gorgeous imagery\" and that it was not \"quite as completely demented as Mr Vampire, but it is truly strange.\"[16] Donald C Willis wrote in his book Horror and Science Fiction Film IV that A Chinese Ghost Story was \"an entertaining fantasy extravaganza\" and that \"the movie is very inventive, occasionally even poetic, but not quite moving\".[17] John Charles gave the film an eight out of ten rating, noting that some horror elements in the film were in dept to the film The Evil Dead, but noted that the \"cinematography and art direction are superb, the action is invigorating, and the love story surprisingly touching, making this one of the most captivating and enjoyable fantasies of the post-New Wave period.\"[2]Modern reception of the film in Hong Kong and Taiwan is positive.[18][19] At the 24th Hong Kong Film Awards various Asian film critics, film makers, actors to vote for the top Chinese films from Hong Kong, Taiwan and China.[19] A Chinese Ghost Story was listed at 50th place on the list.[19] In 2011, the Tapei Golden Horse Film Festival had 122 industry professionals take part in the survey.[18] This voters included film scholars, festival programmers, film directors, actors and producers to vote for the 100 Greatest Chinese-Language Films.[18] A Chinese Ghost Story tied with Jia Zhangke's Xiao Wu (1997) and Zhang Yimou's The Story of Qiu Ju (1992) for 35th place on the list.[18]","cantonese":"Sin6 Neoi5 Jau1 Wan4","box_office":"HK$18.8 million","cinematography":"Poon Hang-sang|Sander Lee Kar-ko|Tom Lau Moon-tong|Wong Wing-hang[2]|","production_company":"Film Workshop[3]","directed_by":"Ching Siu-Tung","traditional":"倩女幽魂","simplified":"倩女幽魂","release_dates":"18 July 1987 (1987-07-18) (Hong Kong)|||||","Production":"Producer Tsui Hark was interested in creating A Chinese Ghost Story as early as 1978, where he suggested it as a television production at TVB.[5] The producer turned it down, feeling it would not be suitable for television.[5] A Chinese Ghost Story uses elements of several stories from Pu Songling's 17th century collection Strange Stories from a Chinese Studio.[6] Tsui Hark stated that they changed a lot of the stories for their adaptation as they found out the stories were against their initial interpretation.[7] On developing the film, Tsui Hark noted that director Ching Siu-Tung wanted to work with him.[7] Ching Siu-Tung had previously worked as a director and an action choreographer on various Film Workshop productions such as Peking Opera Blues and A Better Tomorrow II.[8] Hark suggested developing A Chinese Ghost Story, describing it as a love story which Siu-Tung was not as interested in developing as either a romance film or a non-horror based ghost story.[7] Hark noted that his higher up approached him to develop the film into being about a female cop, not being aware that it was based on a book or that it was a period film.[7] While working on the film, Hark and Siu-Tung did not really know what it was end up being like, as Siu-Tung was still apprehensive on creating a romance film and desired to add horror film elements.[7] Rumours persist around the production suggesting that it Tsui Hark effectively directed the film.[8] British critic Tony Rayns stated that effectively, most Film Workshop productions were \"redirected or hijacked by Tsui Hark\"[8] Joey Wong was a professional basketball player and model before starting her film career.[9] Prior to working on the film, she appeared in films such as the Taiwanese production It'll Be Very Cold at the Lakeside This Year.[9] She would show up in a few Shaw Brothers produced Hong Kong films and Tsui Hark's film Working Class.[9]Actors in the film include Leslie Cheung who was also a cantopop singer.[9] Cheung had previously worked with Tsui Hark productions such as A Better Tomorrow and A Better Tomorrow II.[9] Cheung also sung the films theme song.[9] Wu Ma had previously appeared in several Hong Kong horror film productions such as Spooky Encounters, The Dead and the Deadly and Mr. Vampire.[9] The film used the services of Cinefex Workshop, Hong Kong first proper special effects studio who had previously worked on Hark's film Zu Warriors from the Magic Mountain.[9] The film script which called for the giant slithering tongue and zombies were developed by Cinefex technician Man Xian Liang who taught himself stop motion animation to make the effects happen.[9] James Wong contributed to the score of the film.[7] Wong was primarily known for writing songs for pop stars and television programs and completed his first score for Hark's Shanghai Blues.[7]","produced_by":"Tsui Hark","starring":"Leslie Cheung|Joey Wong|Wu Ma|","music_by":"Romeo Diaz|James Wong[1]|","Release":"A Chinese Ghost Story opened on July 18, 1987.[1] The film received theatrical release throughout Asia and Europe.[10] A Chinese Ghost Story performed well in the Hong Kong box office earing HK$18,831,638 making it the fifteenth highest grossing film in Hong Kong for 1987.[5] The film also received international recognition when it won the special Jury Prize at the Avoriaz festival in France and the Best Film Award at the Opporto Festival in Portugal in 1987.[5]In memory of the late Leslie Cheung, director Ching Siu-tung and producer Ng See-yuen re-released the film in cinemas across mainland China on 30 April 2011.[11] China Radio International reported that the film was remastered with color timing that took about half a year.[12] In addition, premieres took place in both Beijing and Shanghai. Ching Siu-tung, Ng See-yuen and Lau Siu-ming were present. However, Wu Ma and Joey Wong, who were invited, did not attend the premiere. Ching Siu-tung had difficulty tracking down Joey Wong and had to contact her through her family in Taiwan. He received a telephone call at the last minute from Wong's father, stating that the actress was in poor health and not in good condition to attend the premiere. Wong's father also quoted her daughter saying that acting in the film were her best memories.[11] That same year, a remake of the film was released. It starred Louis Koo and Crystal Liu and was directed by Wilson Yip.[13]","written_by":"Yuen Kai Chi[1]"}