{"distributed_by":"Warner Bros.","bait":"Theatrical release poster","Plot":"When petty thief and hustler Alvin Sanders (Jamie Foxx) gets arrested for stealing shrimp, the worst of his problems would seem to be going to jail. Unfortunately, he ends up sharing a cell with John Delano Jaster (Robert Pastorelli) a guy who, while stealing $42 million in gold from the Federal Reserve, double-crossed his partner, Bristol (Doug Hutchison)—a partner with a knack for computers and a long memory. While being interrogated by hardball Treasury Agent Edgar Clenteen (David Morse), the double-crosser dies from heart failure. All the feds have are an incomprehensible message that was left with Alvin, so they decide to release him and use him as bait to catch the partner by secretly implanting a combination tracking device and electronic bug into Alvin's jaw. From that moment on, a surveillance team can follow Alvin's every move and hear his every word. Unfortunately, Alvin has a talent for getting into trouble—which means that the feds have to become his guardian angels so that he can serve his purpose.","language":"English","Reception":"Bait received mostly negative reviews from critics. It currently holds a 26% rating on Rotten Tomatoes based on 82 reviews.[1] One of the few good reviews came from Roger Ebert who gave it 3 out of 4 saying \"it's over the top, an exercise in action comedy that cuts loose from logic and enjoys itself.\"[2]The film opened at #2 at the North American box office making $5,485,591 USD in its opening weekend, behind The Watcher. Bait ultimately failed to bring back its $51 million budget, as it grossed only $15 million worldwide.","box_office":"$15,471,969","cinematography":"Tobias A. Schliessler","production_company":"Castle Rock Entertainment","directed_by":"Antoine Fuqua","Soundtrack":"A soundtrack was released on September 12, 2000 by Warner Bros. Records featuring rap and R&B music. The soundtrack reached No. 49 on the Top R&B/Hip-Hop Albums.","release_dates":"September 15, 2000","produced_by":"Sean Ryerson","starring":"Jamie Foxx David Morse","running_time":"119 minutes","music_by":"Mark Mancina","edited_by":"Alan Edward Bell","written_by":"Andrew Scheinman Adam Scheinman Tony Gilroy","budget":"$51 million"}