{"country":"India","distributed_by":"DAR Motion Pictures (India) Yash Raj Films (International)[1]","screenplay_by":"Nikhil Advani Ritesh Shah Suresh Nair","d-day":"Theatrical release poster","Plot":"Agent Wali Khan (Irrfan Khan), appointed by the Chief of Indian intelligence agency Research and Analysis Wing (RAW), Ashwini Rao (Nassar), has been on a mission for nine years to keep an eye out for the activities of India's most wanted D-Company leader, Goldman (Rishi Kapoor) while working as a local barber.One day he notices Goldman distributing his son's wedding cards to people in the mosque where he prays and comes to know that his son is getting married and Goldman is breaking his security protocol to attend that. Sensing a chance to nab Goldman alive he informs Ashwini about the same who assembles a team quickly - Ex-Indian Navy's Marine Commando(MARCOS Unit) and mercenary, Captain Rudra Pratap Singh (Arjun Rampal), RAW.'s explosives expert, Zoya Rehman (Huma Qureshi), and Aslam, a Mumbai thief and a murderer who was given a chance of freedom by participating in this mission. On the day of the wedding, Wali sees his wife and son off at the airport, where they are meant to fly to London. Wali goes home and stages his family's death in the hopes that the ISI will not put them in harm's way and he can join them after the mission is accomplished. However, all flights to Europe are cancelled, stranding Wali's wife and son at the airport. When Wali's wife calls up Wali his phone is switched off and she learns her house is on fire. Disturbed and upset about not being able to locate Wali she informs the airport security about the same. The airport security personnel runs a check to see and discovers that three bodies have been recovered. Suspicious at the coverup he summons the ISI.The ISI while questioning Zoya and her son Kabir notices kabir holding some pencils that belong to the same hotel where Goldman's son is about to get married. When asked Kabir informs that the pencils were given to him by Wali a couple of days back. Realizing that Wali is an operative out to get Goldman ISI alerts their counterparts who are at the wedding.As a result, Wali, Rudra, Zoya, and Aslam's plan to capture Goldman is placed in jeopardy. Goldman escapes unscathed and the four agents have to go into hiding. Embarrassed at the failure of their operation, the Indian government disavows the four agents; only Ashwini remains their ally, but he is forced to resign. Aslam is captured and tortured by Goldman's nephew when he tries to escape through the Karachi docks. He is rescued by Rudra, who was trying to take revenge on Goldman's nephew for murdering Rudra's lover, Suraiya (Shruti Hassan), a Pakistani prostitute. Upon hearing that Wali's wife has died and that his son is in ISI custody, the four agents decide to find a way to finish their mission, despite the government having abandoned them.The ISI decides that Goldman is too much of a liability to continue protecting, so they decide to kill him. Before they can, the four RAW agents take out the ISI and take Goldman hostage. Wali notifies Ashwini, who works to find them a safe route out of Pakistan. Goldman taunts Wali by telling him that his wife and son are actually still alive, and that he can arrange their reunion. Wali is torn between accepting Goldman's help and finishing his mission, to the point where he shoots Rudra to take control of the group. Ashwini tells them to be at Checkpost 35 before 6am. At the same time, Wali arranges a meeting with ISI, proposing an exchange of Goldman for his wife and child. After tying up Rudra and disarming Zoya, Wali leaves with Goldman. Zoya then frees Rudra and they also leave.Wali drives to Checkpost 40 but is shot and killed by Pakistani forces, who, unbeknownst to Wali, have poisoned and killed his wife and son. As Wali's car is examined, it is revealed that Wali did not actually bring Goldman with him; he had apparently anticipated the Pakistani betrayal, and had left Goldman in the car that Zoya and Rudra had taken. Through flashbacks, it is revealed that this was a plan hatched by Wali and Rudra in order to get Goldman to cooperate and give Rudra and Zoya time to get Goldman across the border to India. The Pakistani forces give Rudra and Zoya chase and only barely miss them before they bring Goldman over the border, where Ashwini is waiting. Once across, Goldman taunts them by saying how nothing has changed in India and he will be released soon and is able to continue his works. Rudra shoots Goldman in the head, indicating that he is the face of the \"New India.\"","Dubbing version":"The film was dubbed into Telugu as Gelupu Gurram in 2014 because of Shruti Haasan's popularity in Andhra Pradesh and Telangana.","language":"Hindi","Reception":"D-Day received generally positive reviews from the critics.[21] Taran Adarsh of Bollywood Hungama gave the movie 4 stars out of 5, concluding that \"D-DAY is what a well-made thriller ought to be -- taut, transfixing and spellbinding, with an astounding finale. Don't miss this high-octane thriller!\"[22] D-Day has all the right ingredients that make it a memorable film, writes Paloma Sharma of Rediff.com.[23] The Hindu stated that D-Day sends out a strong statement. The problem is that it is emotional. And modern India is not that naive.[24] Rajeev Masand of CNN-IBN gave it 3 out of 5 stars and stated that D-Day is far from perfect, but as pulpy Bollywood action films go, it’s very watchable and works its strengths. The film’s ending, controversial and melodramatic to say the least, nevertheless sits comfortably with the wish-fulfilment fantasy that Advani’s milking. Sneha May Francis of Emirates 24/7described the film as a \"sensational take on India’s most notorious gangster\".[25] Subhash K. Jha of IANS called the film \"an acutely accomplished work of art\".[26] Deccan Chronicle praised the film and stated that Rishi Kapoor makes the best Dawood Ibrahim. He has the demeanour and an ominous aura.[27] NDTV gave it 3 stars.[28]D-Day had occupancies of around 15–20% in the morning shows.[29] The movie collected ₹2.75 crore (US$410,000) net in its first day,[30] which was later changed to as ₹2.9 crore (US$430,000) net.[31] The movie saw a sharp rise in the collections in the second day, with an estimated amount of ₹5 crore (US$740,000) net,[32] which was later estimated at ₹4.5 crore (US$670,000) net.[31] The movie went on to collect ₹5.5 crore (US$820,000) net on Sunday, taking its first weekend collections to ₹12.9 crore (US$1.9 million) net.[31] The movie went on to collect ₹24 crore (US$3.6 million) net in its first week.[33] It collected ₹4 crore (US$590,000) net in its second week, taking its total collections to ₹28 crore (US$4.2 million) net.[33] It was declared as a flop by Box Office India, which estimated its two-week collections at ₹17.5 crore (US$2.6 million) net.[34]D-Day was dull in the overseas, collecting $425,000 in its first weekend.[35] The movie could not do strong business in the overseas front, collecting ₹3.5 crore (US$520,000) in two weeks and was declared a flop.[33]","cinematography":"Tushar Kanti Ray","directed_by":"Nikhil Advani","Soundtrack":"The soundtrack album was released on 28 June 2013 with music directed by the music trio Shankar-Ehsaan-Loy. The lyricist is Niranjan Iyengar.The album of D-Day received mixed to positive reviews. Vipin of Music Aloud gave the album a score of 8 out of 10 and called the album \"another outstanding soundtrack\", further praising the music directors, \"Shankar Ehsaan Loy’s brilliant form continues in D-Day!\". Giving the album 3.5/5 stars, Rafat of Glamsham commented, \"one complements S-E-L for another classy effort after BHAAG MILKHA BHAAG.\" He went on to write, \"They have delivered as per the expectations and songs like, 'Duma Dum', 'Mera Murshid Khele Holi' and 'Ek Ghadi Aur' are our picks, and one just hopes for the sake of lovers of classy music that D-DAY too is lapped up and the film garners critical and commercial acclaims when it releases on 19th July.\"[16] Sankhayan Ghosh of Indian Express gave the album a score of 3 out of 5 and concluded his review, \"D-Day is an uncharacteristically authentic album according to Bollywood standards that throws up interesting results.\"[17] Writing for Bollywood Hungama, Rajiv Vijayakar gave the album a mixed review, stating, \"The score is a mixed bag and could have been more uniform. The lyrics are a major issue in the album (except in Ek Ghadi Aur), and so the tried-and-tested Duma Dum, though not original, emerges as the mainstay of the score.\"[18]","release_dates":"19 July 2013 (2013-07-19)|||||","Production":"Nikhil Advani signed Shruti Hassan as the heroine opposite actor Arjun Rampal in December 2012.[9][10]Out of the three female protagonists in the movie, only Huma Qureshi was given the option of choosing the character she wanted to portray. The same choice was put forward to and exercised by Deepika Padukone in the 2012 flick Cocktail.[11]D-Day was filmed in well known bungalow scheme named Sentossa Greenland and other areas of Ahmedabad, Gujarat.The first trailer of D-Day was released on 22 May 2013. The film was promoted by the star cast in Delhi, Jaipur, Indore, Mumbai etc. Huma Qureshi and Arjun Rampal promoted the film on Dance India Dance DID Super Moms.[12][13] Irrfan Khan and Arjun Rampal promoted the film in the show Comedy Nights with Kapil. Rishi Kapoor and Arjun Rampal promoted the film in the dance show Jhalak Dikhhla Jaa.[14][15]","produced_by":"DAR motion pictures Emmay Entertainment","starring":"Arjun Rampal Huma Qureshi Irrfan Khan Shruti Haasan Rishi Kapoor","running_time":"151 minutes[1]","music_by":"Shankar-Ehsaan-Loy","edited_by":"Aarif Sheikh","Release":"D-Day was given a U/A certificate by the censor board on 7 July 2013.[19] The movie released on 19 July 2013, in 1200 screens worldwide.[20]","written_by":"Ritesh Shah Suresh Nair","budget":"₹30 crore (US$4.5 million)[2]"}