{"based_on":"stories by Guy de Maupassant including The Horla","country":"United States","distributed_by":"United Artists","Plot":"Following the funeral of Simon Cordier (Vincent Price), a French magistrate and amateur sculptor, his secret diary is read out by Simon's pastor friend to a group of people gathered around the table, Simon's servants, and a police captain. The diary transpires that Simon has come into contact with a malevolent entity. The invisible yet corporeal being, called a horla is capable of limited psychokinesis and complete mind control.Cordier first interacts with the horla when he meets a prisoner whom the horla drove to commit murder. The horla possesses the inmate and attempts to kill Cordier, who in self-defense accidentally kills the man. The magistrate inherits the prisoner's troubles as the horla turns its hauntings toward him.As the horla begins to destroy Cordier's life, Cordier fears he is going mad and seeks help from a psychologist, who suggests he take a hobby. Cordier chooses to pick up his old interest in art, meeting a model along the way. The horla insists the model is not the charming jewel that Cordier sees, but instead a conniving gold digger, and compels Cordier to treat her as such. This sets up a conflict in Cordier, that he might not be the astute judge of character that his title indicates.As his and others' lives are put in jeopardy, he becomes convinced of the horla's existence and decides drastic measures are needed to end the horla's evil. He lures the horla into his house at night. When his presence is felt, Simon hurls an oil lamp towards the curtains, setting the house ablaze. Simon succeeds in destroying the horla, but not without sacrificing himself as the house burns in flames.The film concludes with the people seated round the table after reading Simon's diary. Some believe Simon was mad and that the Horla doesn't exist, others are unsure and that the Horla might have existed. The priest's opinion is that wherever evil exists, the Horla exists.","language":"English","Reception":"Critical reception for Diary of a Madman has been mixed. New York Times gave the film a negative review, calling the film, \"somewhat less than eye-opening\".[1]","cinematography":"Ellis W. Carter","production_company":"Robert Kent Productions/Admiral Pictures","directed_by":"Reginald Le Borg","Home Media":"The film was released on DVD by Willette Acquisition Corp. on Jan 15, 2011.[5]","release_dates":"March 6, 1963 (1963-03-06) (U.S.)|July 12, 1963 (1963-07-12) (Finland)|August 26, 1963 (1963-08-26) (Sweden)|||","Production":"The movie was originally entitled The Horla.[2] Filming started 18 July 1962.[3] Director Reginald Le Borg said he wanted the voice of Horla to come out distorted but producer Edward Small wanted it to sound clear, which the director thought was a mistake.[4]","produced_by":"Robert E. Kent executive Edward Small (uncredited)","starring":"Vincent Price Nancy Kovack Lewis Martin","running_time":"96 minutes","music_by":"Richard LaSalle","diary_of_a_madman":"Promotional movie poster for the film","edited_by":"Grant Whytock","written_by":"Robert E. Kent"}