{"country":"United States","distributed_by":"Pure Flix Entertainment","Plot":"The film begins with an opening quote from James 2:17. A pastor (McGinley) is shaken by a street preacher regarding his faith, which causes a chain of events for twelve different people, moving towards one cataclysmic event. Some will survive while others will not, but many lives will be changed. An older couple (Shepherd and Majors) have lost their only child. The aforementioned pastor and his wife (Tracy Melchior) were unable to conceive a child. A mother (Sorvino) and young daughter (Makenzie Moss) find themselves homeless, a young nurse (Dominguez) and her husband (Matthews) are caught in a court case that may ruin their lives.[6] A young mother (Pettis) is about to give birth.[7] A war veteran (Soria) returns home with PTSD. A suicidal young woman (PenaVega) seeks to see her father and feel loved again. A street gang is caught up in the mix when one of the members (Shwayze) unexpectedly ends up in church while running and hiding from the police. The core message for all involved in the drama is a simple question – \"Do You Believe?\"","language":"English","Reception":"Do You Believe? received negative reviews from critics. The review aggregator website Rotten Tomatoes reported a 17% rating, based on 18 reviews, leaving a rating average of 4.2/10.[8] On Metacritic, which assigns a normalized rating, the film has a score of 22 out of 100, based on 6 critics, indicating \"generally unfavorable reviews\".[9]Film reviewer for The Dove Foundation, Edwin L. Carpenter starts his review with, \"...the best faith-based film I have ever seen!\"[10] Writing for the The Times-Picayune, Mike Scott describes the film as, \"It is not mainstream entertainment; it is mainstream Sunday school – which is fine if this is what you want to see at the movie theater.\"[11] Scott Foundas, Chief Film Critic at Variety magazine, pans the film with \"But when all its threads are finally pulled into place, Do You Believe? proves about as spiritually enlightening as a Kmart throw rug.\"[12] Huffington Post's Jackie Cooper gave the film 7/10.[6] Michael Foust, writing for The Christian Post nominates the film as the new best evangelistic film ever, he goes on to reason, \"The majority of movie critics will likely give it poor reviews, partially because it is more overtly evangelistic than any successful faith-based theatrical movie in recent history. But I'm guessing those who see the film will like it.\"[13] Writing for RogerEbert.com, Peter Sobczynski reports, \"Subtle as a sledgehammer to the toes and only slightly more entertaining, Do You Believe? will no doubt play well with viewers already predisposed towards liking it because it has been designed to reconfirm their already deeply-felt beliefs rather than doing anything that might cause them to think about or challenge those beliefs in any meaningful way.\"[14]","box_office":"$14.4 million[3]","cinematography":"Brian Shanley","directed_by":"Jonathan M. Gunn","production_companies":"10 West Studios Believe Entertainment Pure Flix Entertainment Toy Gun Films","release_dates":"March 20, 2015 (2015-03-20) (North America)|||||","produced_by":"Harold Cronk|Michael Scott|David A.R. White|Russell Wolfe|","starring":"Mira Sorvino|Sean Astin|Alexa PenaVega|Ted McGinley|Andrea Logan White|Cybill Shepherd|Lee Majors|Madison Pettis|Brian Bosworth|","running_time":"115 minutes[1]","music_by":"Will Musser","do_you_believe?":"Theatrical release poster","edited_by":"Vance Null","Release":"Do You Believe? opened theatrically in 1,320 venues on March 20, 2015 and earned $3,591,282 in its first weekend, ranking number six in the domestic box office, behind The Divergent Series: Insurgent, Cinderella, Run All Night, The Gunman, and Kingsman: The Secret Service.[3]","written_by":"Chuck Konzelman|Cary Solomon|","budget":"$2.3 million[2]"}