{"based_on":"Age of Consent (novel)  by Norman Lindsay","country":"Australia","distributed_by":"Columbia Pictures Umbrella Entertainment (Aust, NZ)","Plot":"Bradley Morahan (James Mason) is an Australian artist who feels he has become jaded by success and life in New York City. He decides that he needs to regain the edge he had as a young artist and returns to Australia.He sets up in a shack on the shore of a small, sparsely inhabited island on the Great Barrier Reef. There he meets young Cora Ryan (Helen Mirren), who has grown up wild, with her only relative, her difficult, gin-guzzling grandmother 'Ma' (Neva Carr Glyn). To earn money, Cora sells Bradley fish that she has caught in the sea. She later sells him a chicken which she has stolen from his spinster neighbour Isabel Marley (Andonia Katsaros). When Bradley is suspected of being the thief, he pays Isabel and gets Cora to promise not to steal any more. To help her save enough money to fulfill her dream of becoming a hairdresser in Brisbane, he pays her to be his model. She reinvigorates him, becoming his artistic muse.Bradley's work is disrupted when his sponging longtime \"friend\" Nat Kelly (Jack MacGowran) shows up. Nat is hiding from the police over alimony he owes. When Bradley refuses to give him a loan, Nat invites himself to stay with Bradley. After several days, Bradley's patience becomes exhausted. Luckily, the problem is solved for him. Nat romances Isabel, hoping to get some money from her. Instead, she unexpectedly ravishes him. The next day, he hastily departs the island, but not before stealing Bradley's money and some of his drawings.Then Ma catches Cora posing nude for Bradley and accuses him of carrying on with her underage granddaughter. Bradley protests that he has done nothing improper; finally, he gives her the little money he has left to get her to go away.When Cora discovers that Ma has found her hidden cache of money, she chases after her. In the ensuing struggle, Ma falls down a hill, breaks her neck, and dies. The local policeman sees no reason to investigate further, since the old woman was known to be frequently drunk.Later that night, Cora goes to Bradley's shack, but is disappointed when he seems to view her only as his model. When she runs out, Bradley follows her into the water. There, she finally gets him to see her as a desirable young woman.","age_of_consent":"1969–1970 cinema poster","language":"English","Censorship":"Although Age of Consent was released without cuts in Australia,[16] and also passed the British Board of Film Classification without any demands for cuts,[3] the distributor, Columbia Pictures, decided to cut the opening bedroom scene between James Mason and Clarissa Kaye, and also some of Mirren's nude scenes, thus shortening the film from 106 minutes to 98 minutes before it was released to the UK and US audiences. The Columbia executives also didn't like Peter Sculthorpe's original score, so it was replaced with one by Stanley Myers.[16] The original Sculthorpe score was restored when the film was restored in 2005.","Reception":"Age of Consent was a huge success in Australia, where it received generally favourable reviews,[16] and drew sizeable audiences; it ran continuously for seven months at Sydney's Rapallo.[16] The film took AUD 981,000 at the box office in Australia,[17] which was equivalent to AUD 9,711,900 in 2009. It was the 13th most popular film in Australia in 1969.[18]However, outside Australia critics were not very positive, with Penelope Mortimer in The Observer writing:I tremendously admire James Mason and believed, until I saw Age of Consent, that he could do no wrong...It is best forgiven and forgotten.[7]and the reviewer in Variety writing:The film has plenty of corn, is sometimes too slow, repetitious and badly edited...Yet [it] has immense charm, and the photography and superb scenery make it a good travelog ad for the Great Barrier Reef.[7]Michael Powell himself thought the film had turned out to be too comedic: \"A sensual comedy. Not a big success, but interesting anyway.\"[7]","box_office":"AUD 981,000 (Aust)[5]","cinematography":"Hannes Staudinger","production_company":"Nautilus Productions Michael Powell Productions","directed_by":"Michael Powell","Restored version":"At the 2005 Sydney Film Festival, a fully restored version of the film was shown, with both the original score and the cut scenes reinstated.[2][19] The restoration had been instigated by Martin Scorsese, a huge fan of Michael Powell, and was done by The Film Foundation, as part of their work to restore all of Powell's films, under the supervision of film editor Thelma Schoonmaker, who was Powell's wife from 19 May 1984 until his death in 1990.[20] The restored version was released in the US on DVD in January 2009 as part of a double set of Powell films, paired with A Matter of Life and Death.[20] The restored version is not yet available on DVD in Europe, but has been shown on TV. It premiered on Film Four in the UK in December 2012.[21]Umbrella Entertainment released a DVD of the restored version in Australia in July 2012 with special features including Martin Scorsese on Age of Consent, audio commentary with historian Kent Jones, the making of Age of Consent, Helen Mirren: A Conversation with Cora, and Down Under with Ron and Valerie Taylor.[22]","release_dates":"27 March 1969 (1969-03-27) (Australia[1])|15 November 1969 (1969-11-15) (UK)|8 March 1970 (1970-03-08) (US)|19 June 2005 (2005-06-19) (restored[2])||","Production":"Norman Lindsay's novel had been published in 1938 and was banned in Australia. A film version was announced in 1961 by producer Oscar Nichols who said he wanted Dan O'Herlihy and Glynis Johns. In 1962 Michael Pate had the rights and he eventually brought in Michael Powell.[9] They hired Peter Yeldham to write the adaptation.Several changes were made from Lindsay's novel including shifting the location from New South Wales to the Barrier Reef and making the artist a success instead of a failure. The bulk of the budget was provided by Columbia Pictures in London.[4]Before filming began on Age of Consent, director Michael Powell said about it:My next film is the story of a painter who believes that he will no longer paint and of a girl who persuades him to begin again...He will probably end up painting her; but to see a painter sit down and paint a girl, this could be exciting, but I had the hardest time explaining to my scriptwriter that this didn't excite me at all. What interested me was the problem of Creation and the fact that this creation in the case of the painter was very physical. He will have to struggle, to fight, even more strongly than he will move away from reality. It will be a slightly bitter comedy that I will produce with James Mason who will play the leading role.[7]Powell and Mason had wanted to work together in the past, on I Know Where I'm Going!, but had not been able to come to an agreement on billing and Mason was unwilling to go on location to Scotland. After Age of Consent, Powell tried to recruit Mason for his version of Shakespeare's The Tempest, a project which never came to fruition.[10]It was originally intended to cast an unknown 17-year-old Australian actress opposite Mason but in the end a young Helen Mirren was chosen.[11]Filming began in March 1968 in Albion Park racecourse and elsewhere in Brisbane, with location filming on Dunk Island[12] and Purtaboi Island on the Great Barrier Reef off the coast of Queensland, and interiors shot at Ajax Film Centre in the Eastern Suburbs of Sydney.[7][13][14][15]Underwater moving picture photography was undertaken by Ron & Valerie Taylor as their first work for a feature film. (In 1980, they performed the underwater movie photography for The Blue Lagoon.)","produced_by":"Michael Powell James Mason","starring":"James Mason Helen Mirren Jack MacGowran","running_time":"106 minutes (Australia)[3] 98 minutes (UK & US) 106 minutes (restored)","music_by":"Peter Sculthorpe (original) Stanley Myers (UK & US release) Peter Sculthorpe (restored)","edited_by":"Anthony Buckley","written_by":"Peter Yeldham","budget":"AUD 1.2 million[4]"}