{"42nd_street":"theatrical release poster","based_on":"42nd Street (1932 novel) by Bradford Ropes","Cast":"Cast notes","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"It is 1932, the depth of the Depression, and noted Broadway producers Jones (Robert McWade) and Barry (Ned Sparks) are putting on Pretty Lady, a musical starring Dorothy Brock (Bebe Daniels). She is involved with wealthy Abner Dillon (Guy Kibbee), the show's \"angel\" (financial backer), but while she is busy keeping him both hooked and at arm's length, she is secretly seeing her old vaudeville partner, out-of-work Pat Denning (George Brent).Julian Marsh (Warner Baxter) is hired to direct, even though his doctor warns that he risks his life if he continues in his high-pressure profession; despite a long string of successes he is broke, a result of the 1929 Stock Market Crash. He must make his last show a hit, in order to have enough money to retire on.Cast selection and rehearsals begin amidst fierce competition, with not a few \"casting couch\" innuendos flying around. Naïve newcomer Peggy Sawyer (Ruby Keeler), who arrives in New York from her home in Allentown, Pennsylvania, is duped and ignored until two experienced chorines, Lorraine Fleming (Una Merkel) and Ann \"Anytime Annie\" Lowell (Ginger Rogers), take her under their wing. Lorraine is assured a job because of her relationship with dance director Andy Lee (George E. Stone); she also sees to it that Ann and Peggy are chosen. The show's juvenile lead, Billy Lawler (Dick Powell), takes an immediate liking to Peggy, as does Pat.When Marsh learns about Dorothy's relationship with Pat, he sends some thugs led by his gangster friend Slim Murphy (Tom Kennedy) to rough him up. That plus her realization that their situation is unhealthy makes Pat agree to not to see each other for a while, and he gets a stock job in Philadelphia.Rehearsals continue for five weeks to Marsh's complete dissatisfaction until the night before the show's opening in Philadelphia, when Dorothy breaks her ankle. By the next morning Abner has quarreled with her and wants Julian to replace her with his new girlfriend, Annie. She, however, tells him that she can't carry the show, but the inexperienced Peggy can. With 200 jobs and his future riding on the outcome, a desperate Julian rehearses Peggy mercilessly (vowing \"I'll either have a live leading lady or a dead chorus girl\") until an hour before the premiere.Billy finally gets up the nerve to tell Peggy he loves her; she enthusiastically kisses him. Then Dorothy shows up and wishes her luck, telling her that she and Pat are getting married. The show goes on, and the last twenty minutes of the film are devoted to three Busby Berkeley production numbers: \"Shuffle Off to Buffalo\", \"(I'm) Young and Healthy\", and \"42nd Street\".The show is a hit. As the theater audience comes out Julian stands in the shadows, hearing the comments that Peggy is a star and he (Marsh) does not deserve the credit for it.Plot note In the original Bradford Ropes' novel Julian and Billy are lovers. Since same-sex relationships were unacceptable in films by the moral standards of the era, the film substituted a romance between Billy and Peggy.","language":"English","box_office":"$2,250,000[2][3]","cinematography":"Sol Polito","directed_by":"Lloyd Bacon Busby Berkeley (musical numbers)","Reception and legacy":"The film premiered in New York on 9 March 1933 at the Strand Theatre, and went into general release two days later, becoming one of the most profitable ones of the year, bringing in an estimated gross of $2,300,000. It received Academy Award nominations for Best Picture and Best Sound Recording, and was named one of the 10 Best Films of 1933 by Film Daily.[4][9][10]Mordaunt Hall of The New York Times called the film \"invariably entertaining\" and, \"The liveliest and one of the most tuneful screen musical comedies that has come out of Hollywood\".[11]The New York World-Telegram described it as \"A sprightly entertainment, combining, as it did, a plausible enough story of back-stage life, some excellent musical numbers and dance routines and a cast of players that are considerably above the average found in screen musicals.\"[12]\"Every element is professional and convincing\", wrote Variety. \"It'll socko the screen musical fans with the same degree that Metro's pioneering screen musicals did.\"[13]John Mosher of The New Yorker called it \"a bright movie\" with \"as pretty a little fantasy of Broadway as you may hope to see\", and praised Baxter's performance as \"one of the best he has given us\", though he described the plot as \"the most conventional one to be found in such doings.\"[14]Warner already had a follow-up of sorts – Gold Diggers of 1933 – in production before the film's release, and the success of both films permitted a higher budget and more elaborate production numbers in Warner's next follow-up, Footlight Parade.By the time Busby Berkeley's death in 1976, the film had become revered as the archetypal backstage musical, the one that \"gave life to the clichés that have kept parodists happy\", as critic Pauline Kael wrote.[15]","Awards and honors":"Academy Award nominations[16]American Film Institute recognition","release_dates":"March 11, 1933 (1933-03-11)|||||","Production":"The film was Ruby Keeler's first, and the first time that Berkeley, Warren and Dubin had worked for Warner Bros. Director Lloyd Bacon was not the first choice to direct – he replaced Mervyn LeRoy when LeRoy became ill. LeRoy was dating Ginger Rogers at the time, and had suggested to her that she take the role of \"Anytime Annie\".[4][5]Actors who were considered for lead roles when the film was being cast include Warren William and Richard Barthelmess for the role of Julian Marsh, eventually played by Warner Baxter; Kay Francis and Ruth Chatterton instead of Bebe Daniels for the role of Dorothy Brock; Loretta Young as Peggy Sawyer instead of Ruby Keeler; Joan Blondell instead of Ginger Rogers for Anytime Annie; Glenda Farrell for the role of Lorraine, played by Una Merkel, and Frank McHugh instead of the diminutive George E. Stone as Andy, the dance director.[5]The film began production on 5 October 1932. The shooting schedule ran for 28 days at the Warner Bros. studio in Burbank, California. The total cost of making it has been estimated to be $340,000–$439,000.[6][7]","produced_by":"Darryl F. Zanuck (uncredited)","starring":"Warner Baxter Ruby Keeler Dick Powell Ginger Rogers","running_time":"89 minutes","Musical numbers":"All songs have music by Harry Warren and lyrics by Al Dubin.[8]Also, a \"Love Theme\", written by Harry Warren, is played under scenes between Ruby Keeler and Dick Powell, and Bebe Daniels and George Brent. It has no title or lyrics, and is unpublished.","music_by":"Harry Warren (music) Al Dubin (lyrics)","edited_by":"Thomas Pratt Frank Ware","written_by":"Rian James James Seymour Whitney Bolton (uncredited)","budget":"$439,000[1]"}