{"country":"Canada","distributed_by":"Cinemien, Mongrel Media, E1 Entertainment","Plot":"Juliette is a Canadian magazine editor who arrives in Cairo for a vacation with husband Mark, a UN official working at refugee camps in the Gaza Strip. Their children have grown and Juliette is looking forward to spending more time with Mark. Delayed, Mark asks his friend—a handsome Egyptian named Tareq—to watch over Juliette. Mark is continually delayed in Gaza, during which time Juliette makes friends with Cairo locals, North American and European ex-pats like Kathryn, explores the city and the surrounding area, and finds herself falling in love with the city during her \"Cairo Time\".Tareq is a regular (but not constant) companion during Juliette's extended time waiting for Mark, leading to a very close relationship between the two. While their relationship remains platonic, it is steadily headed to a stronger connection. After travelling to Alexandria with him to attend the wedding of the daughter (Jameelah) of a girlfriend from his university days (Yasmeen), she admits that she will miss him when she returns to Canada.The two visit the Great Pyramids—something Mark had inisisted should be \"just for us\" on his sporadic calls to Juliette at her hotel room. Whatever change this may signify in Tareq and Juliette's growing relationship, they return to the hotel to find that Mark has finally arrived. Mark is happy to see Juliette, while she and Tareq adequately hide their sorrow over the end of their Cairo Time.","language":"English","Reception":"Rotten Tomatoes certified the movie \"fresh\" with 82 as of August 2010.[4] The film was received with great reviews. The Wall Street Journal said \"Clarkson makes taking 'Cairo Time' well worth it\",[5] while CTV News gave the movie a positive review stating that the movie as \"A masterful look at repressed romance\" giving it 3 stars out of 4[6][7] Picktainment.com said \"Ruba Nadda’s Cairo Time is a passive, delicate film with a mature respect for its surroundings and a profound understanding of neglect, especially in its subtle form.\"[8] Peter Travers of Rolling Stone called Cairo Time \"a fragile romance\" and said about Nadda, \"Just when you think you know what's coming, the canny writer-director Ruba Nadda (Sabah) makes sure you won't. Nadda lets the sensuous tempos of Cairo life seep into Juliette's system, and ours. It's a haunting and hypnotic film. And Clarkson's sublimely nuanced performance is in every way transporting.\"[9] At the end of 2010, Cairo Time was named \"Best-reviewed romance of the year (2010)\" by Rotten Tomatoes.[10]","box_office":"$1,995,012[1]","cinematography":"Luc Montpellier","production_company":"Foundry Films, MISR International Films","directed_by":"Ruba Nadda","cairo_time":"Theatrical release poster","release_dates":"October 9, 2009 (2009-10-09)|||||","Production":"When Ruba Nadda finished writing the script for Cairo Time she showed it to producer Daniel Iron of Foundry Films. Daniel, remembering Ruba's previous feature Sabah, loved the script and decided to work with her.Atom Egoyan gave the screenplay for Cairo Time to Christine Vachon and Charles Pugliese at Killer Films in New York in 2005. Vachon saw there was a lot of potential in the script and decided to meet Nadda with Pugliese. After meeting Nadda they wanted to get involved in the project and thereby became executive producers. Because Canada did not have co-production treaties with Egypt they needed to find a way to shoot in Egypt anyhow. Iron was introduced to David Collins of Samson Films in Ireland by Ruba Nadda. Collins met Nadda at a film festival in Mannheim and in Rotterdam and was familiar with her work. Samson decided to join the project, making it a Canada-Ireland co-production, which allowed them to shoot in Egypt.[3]","produced_by":"Shana Collier David Collins Daniel Iron Gabriel Khoury Charles Pugliese Christine Vachon Claire Welland","starring":"Patricia Clarkson Alexander Siddig Elena Anaya Tom McCamus Amina Annabi","running_time":"88 minutes","music_by":"Niall Byrne","edited_by":"Teresa Hannigan","Release":"The movie was released in Canadian theaters on 9 October 2009. Cairo Time won the \"Best Canadian Feature Film\" at the Toronto International Film Festival 2009. The movie was bought by IFC during Toronto International Film Festival 2009 and released in the U.S. in New York and Los Angeles on August 6, 2010 with a wide release on Labor Day weekend of 2010 by IFC.[11][12] Cairo Time grossed $66,245 in the opening weekend, ranking at #38. The film sold out all shows in the weekend in New York and Los Angeles, with a theater revenue of $12,450, the best per-theater-average of any film in release.[13]","written_by":"Ruba Nadda"}