{"dark_star":"Theatrical poster","country":"United States","distributed_by":"Bryanston Pictures","Plot":"In the mid 22nd century, mankind has reached a point in technological advancement that enables colonization of the far reaches of the universe. Armed with artificially intelligent \"Thermostellar Triggering Devices\", the scout ship \"Dark Star\" and its crew have been alone in space for twenty years on a mission to destroy \"unstable planets\" which might threaten future colonization of other planets.The ship's crew consists of Lt. Doolittle (helmsman, and initially, second-in-command), Sgt. Pinback (bombardier), Cpl. Boiler (navigator), and Talby (target specialist). \"Dark Star\" Commander Powell was killed during hyperdrive as a result of an electrical short behind his rear seat panel, but remains onboard ship in a state of cryogenic suspension. The crew performs their jobs with abject boredom, as the tedium of their tasks over 20 years has driven them \"around the bend.\" The \"Dark Star\" ship is in a constant state of deterioration and frequent system malfunctions (for example, a radiation leak which is not repairable, their cargo of intelligent talking bombs lowering from their bomb bay without a command to do so, an explosion destroying their sleeping quarters, the food processing computer repeatedly serving chicken-flavored liquid meals, and a storage bay \"self destructing\" and destroying the ship's entire supply of toilet paper), and only the soft-spoken female voice of the ship's computer for company. They have created distractions for themselves: Doolittle, formerly a surfer from Malibu, California, has constructed a musical bottle organ; Talby spends his time in the ship's observation dome, content to watch the universe go by; Boiler obsessively trims his moustache, enjoys smoking cigars, and shoots targets with the ship's emergency laser rifle in a corridor; while Pinback plays practical jokes on the crew members, maintains a video diary, and has adopted a ship's mascot in the form of a mischievous \"beachball\"-like alien who refuses to stay in a storage room, forcing Pinback to chase it around the ship. With regard to Pinback, he may not actually be \"Sgt. Pinback\" at all; in his video diary, he states he is liquid fuel specialist Bill Froug, who inadvertently took the \"real\" Sgt. Pinback's place on the mission. It is unclear, however, whether or not this is a paranoid illusory fiction Sgt Pinback has created, due to his prolonged time working in deep space.En route to their next target (the Veil Nebula[2]), the \"Dark Star\" is hit by a bolt of electromagnetic energy during a storm, resulting in yet another on-board malfunction, with \"Thermostellar Bomb #20\" receiving an order to deploy. With some difficulty, the ship's computer convinces Bomb #20 that the order was in error, and persuades the bomb to disarm itself and return to the bomb bay. Talby notes the malfunction, and decides to investigate the fault (to the complete disinterest of his crew mates), and discovers a damaged communications laser in the emergency airlock while the crew is engaging their next bombing run. While attempting to repair it the laser malfunctions, blinding Talby and knocking him unconscious, inadvertently triggering a more serious problem, causing extensive damage to the ship's main computer, and damaging the bomb release mechanism on Bomb #20.Due to the damaged ship's computer, the crew discovers that they cannot activate the release mechanism and attempt to abort the drop. To make matters worse, after two prior accidental deployments, and intent on exploding as it was programmed to do, Bomb #20 refuses to disarm or abort the countdown sequence. As Pinback and Boiler try to talk the bomb out of blowing up underneath the ship, Doolittle revives Commander Powell, who advises him to talk to the bomb, and to teach the bomb the rudiments of phenomenology. After donning a space suit and exiting the ship to approach the bomb directly, Doolittle engages in a philosophical conversation with Bomb #20 until it decides to abort its countdown and retreat to the bomb bay for further contemplation. Disaster appears to have been averted, but when attempting to re-enter the ship, Doolittle inadvertently jettisons Talby out of the airlock. As Doolittle tries to rescue the now-conscious Talby as he floats away from the \"Dark Star,\" Pinback addresses the bomb over the intercom in another attempt to disarm it.Unfortunately, Doolittle has mistakenly taught the bomb Cartesian doubt and, as a result, Bomb #20 determines that it can only trust itself and not external input. Convinced that only it exists, and that its sole purpose in life is to explode, Bomb #20 states \"Let there be light,\" and promptly detonates. Pinback and Boiler are killed instantly. Commander Powell is jettisoned into space encased in ice, and Talby and Doolittle are blown in opposite trajectories, drifting away from each other. Talby drifts into the Phoenix Asteroids (a cluster of glowing asteroids he has long had a fascination with), destined to circumnavigate the universe for eternity. As Doolittle loses contact with Talby, he sees that he is falling toward the unstable planet. Realizing he will burn in the atmosphere, he drifts into debris from the \"Dark Star,\" finds an appropriately surfboard-shaped hunk of debris, and \"surfs\" down into the atmosphere of the planet, dying as a falling star.","language":"English","Reception":"Dark Star can be considered a black comedy although it was marketed by Harris as a serious science fiction film. As a result, most of the cinema-going audience did not expect the humor and Dark Star's reception suffered from not reaching the intended audience. The home video cassette revolution of the early 1980s saw Dark Star become a cult film among sci-fi fans.Rotten Tomatoes gives the film a 79% fresh rating, with the following consensus: \"A loopy 2001 satire, Dark Star may not be the most consistent sci-fi comedy, but its portrayal of human eccentricity is a welcome addition to the genre.\"[6] Roger Ebert gave the film three stars out of four, writing: \"Dark Star is one of the damnedest science fiction movies I've ever seen, a berserk combination of space opera, intelligent bombs, and beach balls from other worlds.\"[7] Leonard Maltin awarded the film two and a half stars, describing it as \"enjoyable for sci-fi fans and surfers\"; he also compliments the effective use of the limited budget.[8]Carpenter has described Dark Star as \"Waiting for Godot in space.\"[9]Commentators have noted that the film's ending closely parallels the short story \"Kaleidoscope\" by Ray Bradbury, from his 1951 short story collection The Illustrated Man.[10]The \"Beachball with Claws\" segment of the film was reworked by Dan O'Bannon into the 1979 science fiction-horror film Alien. After witnessing audiences failing to laugh at parts of Dark Star which were intended as humorous, O'Bannon lamented \"If I can't make them laugh, then maybe I can make them scream.\"[11]The indie rock band Pinback frequently uses sound effects from the movie throughout their discography, and adopted their name from the character Sgt. Pinback.Doug Naylor has said in interviews that Dark Star was the inspiration for Dave Hollins: Space Cadet, the radio sketches that evolved into the television science fiction situation comedy Red Dwarf.[12]The character Pinback also inspired the character name Pinbacker, the antagonist in Danny Boyle's 2007 film Sunshine.[13]Dark Star has been cited as a large inspiration for Machinima series Red vs. Blue by the show's creator, Burnie Burns.[14]Metal Gear series creator Hideo Kojima revealed the iDroid's voice was inspired by the female computer voice from Dark Star.[15]","cinematography":"Douglas Knapp","production_company":"Jack H. Harris Enterprises University of Southern California","directed_by":"John Carpenter","Soundtrack":"The music for Dark Star is chiefly pure electronic style made by John Carpenter using synthesizers.The theme song played in the opening and closing credits is \"Benson, Arizona\". The music was written by John Carpenter, and the lyrics were by Bill Taylor, concerning a man who travels the galaxy at light speed and misses his beloved back on Earth.[16] The lead vocalist was John Yager, a college friend of Carpenter's. Yager was not a professional musician \"apart from being in a band in college.\"[17]","release_dates":"April 1974 (1974-04)|||||","Production":"Director John Carpenter and Dan O'Bannon wrote the screenplay while film students at the University of Southern California. Six years later, the basic \"Beachball with Claws\" subplot of the film was reworked from comedy to horror,[1] and became the basis (along with an unpublished story about gremlins aboard a B-17) for the O'Bannon-scripted science fiction horror classic, Alien.[1][3]Working on an estimated $60,000 budget, Carpenter and O'Bannon created the production design from scratch. In the \"elevator\" sequence, the bottom of the elevator is in fact rolling on the floor. The device used to roll the elevator base was a Moviola camera dolly normally used on the small sound stage in the old USC Cinema building (a former horse stable). The steering arm of the dolly can be seen in the \"elevator's\" underside. Talby's starsuit backpack is made from Styrofoam packing material and his spacesuit chestplate is a cake pan and muffin tray. The space helmets were part of Ideal Toys S.T.A.R. Team toy line for young children,[4] resulting in the snug fit on the adult actors' heads. The double rows of large buttons on the bridge consoles are ice cube trays illuminated from beneath. Sergeant Pinback's video diary is an 8-track tape and the machine he uses to read and record is a microfiche reader. O'Bannon also starred as Sgt. Pinback.Many special effects were done by Dan O'Bannon, ship design was by Ron Cobb, model work by O'Bannon and Greg Jein, and animation was done by Bob Greenberg.[citation needed]The bombs are made from an AMT 1/25 scale semi-trailer kit and parts of a 1/12th scale model car kit; \"Matra\", the name of the car brand can be seen in some shots.[5] The space suits are made to resemble the space suit of the Mattel action figure \"Major Matt Mason\"[citation needed], which was used in slightly modified form as a miniature in some effects shots.[citation needed] Cobb drew the original design for the \"Dark Star\" ship on a napkin while eating at the International House of Pancakes.[citation needed]The film featured the first hyperspace sequence to show the effect of stars rushing past the Dark Star vessel in a tunnel-effect (due to superluminal velocity) and the technique was used in Star Wars three years later.[citation needed]","produced_by":"John Carpenter","starring":"Dan O'Bannon Brian Narelle Cal Kuniholm Dre Pahich","running_time":"83 minutes","music_by":"John Carpenter","edited_by":"Dan O'Bannon","Release":"Although destined for eventual cinematic release in 1974, this was only possible as a consequence of a successful series of showings at a number of film festivals in 1973. Originally, the film was a 68-minute student short filmed on 16mm film. The movie was seen by producer Jack H. Harris, who obtained the theatrical distribution rights to the film, and arranged for a transfer to 35mm, and Harris paid for an additional 15 minutes of film footage, which brought the movie up to feature film length.[citation needed]For theatrical release, parts of the film were re-edited to make it feel like a 3-part story and extra footage was filmed to add substantial running time. This included the bottle-organ scene, the alien chase and elevator scenes, the sleeping quarters scene, and a reworked ending involving Boiler and Pinback fighting over a gun (originally the fight took place in the control room, and involved a search for a misplaced failsafe key).John Carpenter would later lament that as a result of the padding into a feature-length movie, their \"great looking student film\" became a \"terrible looking feature film\".John Carpenter and Dan O'Bannon re-edited the film into a \"director's cut\",[when?] removing much of the footage shot for the theatrical release and adding new effects.[citation needed]The film was released on DVD March 23, 1999 in a single disc edition. A special two-disc \"Hyperdrive Edition\" DVD was released in 2010 by VCI Entertainment including the Director's Cut and a longer Original Theatrical Release, as well as a long featurette explaining the origins of Dark Star and how it was produced. A fan commentary provides information about the film.","written_by":"John Carpenter Dan O'Bannon","budget":"$60,000"}