{"Cast":"There were two Corvettes made for the film, a main car and a \"backup\" model, both built for MGM by Dick Korkes of Korky's Kustom Studios. The main car was often displayed during the film's publicity tour, and both cars were later sold by MGM to private parties. The original car was sold to an Australian collector and \"restored\" to look different from how it appears in the film.[2] An original mold of the car was displayed at the Corvette Americana Hall of Fame in Cooperstown, New York, and is now part of the collection of the National Corvette Museum. The \"backup\" car remained in the U.S., was owned for a while by Mike Yager of Mid America Motorworks in Effingham, Illinois, and was on display there between periodic car shows. Yager sold the car to a private collector in late 2009.","country":"United States","distributed_by":"Metro-Goldwyn-Mayer United Artists","Plot summary":"Kenny Dantley (Mark Hamill) is a car-loving Southern California high school senior. For a project in his shop class, Kenny helps build a customized Chevrolet Corvette Stingray with right-hand-drive. Shortly after the new set of wheels is unveiled, the car is stolen from the streets of Van Nuys. After hearing that the car is in Las Vegas Kenny immediately sets out on the trail of the thieves. On the way, he meets the seemingly confident Vanessa (Annie Potts), who is a self-described \"prostitute-in-training.\"Kenny finds work in a Vegas car wash, and spots his car on more than one occasion. He follows it to a local garage, where he has a run-in with the garage owner, Wayne Lowry (Kim Milford), before being rescued by Vanessa. Kenny’s high school teacher, Ed McGrath (Eugene Roche)comes to Las Vegas, and Kenny is crushed to learn that the teacher he admired had arranged for the theft of the Corvette to help supplement his low earnings as a teacher. When McGrath suggests Kenny go to work for Lowry, Kenny agrees to it. He will make good money, but secretly plans to steal the Corvette back from Lowry.Eventually, Kenny completes his plans, steals the car back, saves Vanessa from an unusual scenario in a hotel, wins a wild car chase, and returns in triumph with the Corvette – and Vanessa – to his old high school.","Critical reception and box office":"Critic Frank Rich of Time magazine thought the movie was an appropriate summer \"popcorn flick\". He wrote \"As long as one doesn't demand too much of it, Corvette Summer delivers a very pleasant two hours of escape.\"[3] TV Guide agreed, calling the film \"all in all a very funny movie with enough solid, believable story to take it beyond the realm of teenage summer fare.\"[4]Janet Maslin of The New York Times, however, wasn't as taken with the film. She wrote, \"The movie takes a slender, boyish conceit—of the sort that is suddenly so popular among Hollywood's current batch of boy wonders—and invests it with silliness rather than whimsy.\"[5]Overall, the review aggregator Rotten Tomatoes reported that 57% of critics gave the film a positive review, based on seven reviews.[6]Corvette Summer generated a total domestic gross of $15,500,000.","Production history":"Working titles for the film were Stingray and The Hot One.[1] Scenes of Kenny's high school were filmed at Burbank High School (Burbank, California) in the San Fernando Valley, and Verdugo Hills High School outside of Los Angeles.The novelization of Corvette Summer was written by Wayland Drew. The book was published by the New American Library of Canada in 1978.The film's theme song, \"Give Me the Night\", was sung by Dusty Springfield.","Allusions in popular culture":"In Episode 513 (\"The Brain That Wouldn't Die\") of Mystery Science Theater 3000, Mike Nelson exclaims, \"Luke, join me or you'll star in Corvette Summer.\" This is an allusion to Mark Hamill's role in the Star Wars films. The Beck song \"Corvette Bummer\" is an allusion to the film.[citation needed]","language":"English","cinematography":"Frank Stanley","production_company":"Metro-Goldwyn-Mayer Plotto Productions","directed_by":"Matthew Robbins","corvette_summer":"DVD cover of \"Corvette Summer\"","release_dates":"June 2, 1978 (1978-06-02)|||||","produced_by":"Hal Barwood","starring":"Mark Hamill Annie Potts Eugene Roche Kim Milford Richard McKenzie William Bryant Philip Bruns Danny Bonaduce","running_time":"104 minutes","music_by":"Craig Safan","edited_by":"Amy Holden Jones","written_by":"Hal Barwood Matthew Robbins","budget":"$9,000,000"}