{"country":"United Kingdom[1]|United States[1]|","distributed_by":"DreamWorks Pictures (North America)|Pathé (Europe)|","screenplay_by":"Karey Kirkpatrick","story_by":"Peter Lord|Nick Park|","Plot":"Mr. and Mrs. Tweedy run a failing chicken farm in Yorkshire; the chickens are caged in the style of a prison camp with a high fence and barbed wire, and two dogs patrol the grounds. Chickens that fail to produce enough eggs are slaughtered for food. Frustrated at the \"minuscule profits\" generated by the farm, Mrs. Tweedy comes up with the idea of converting their farm into full scale automated production.One chicken, Ginger, has long had visions of escaping with the help of her hen friends Babs, Bunty, and Mac, and two black-marketer rats, Nick and Fetcher, who help to acquire \"contraband\" from the Tweedys to aid Ginger's plans. However, she is always caught and put into solitary confinement. While thinking of a new plan, Ginger witnesses a Rhode Island Red cockerel fly over the fence and crash into one of the coops, spraining his wing. Ginger and the other chickens help to hide him from the Tweedys and care for his wing, learning that his name is Rocky. Ginger is particularly interested in Rocky's ability to fly and begs him to help train her and the other chickens to do the same. Rocky is coy, but proceeds to try to help train the chickens, unable to fully demonstrate due to his broken wing. Meanwhile strange boxes arrived containing the Tweedy's new machinery and the chicken's food ration is doubled to fatten them.Amid the training, Rocky holds a large party to help relieve the stress, where it is revealed his wing is healed, and Ginger insists he show them how to fly the next day. The pie-making machine is finally working and Mr. Tweedy, who completes the assembly, immediately grabs Ginger for a test run. Rocky is able to save Ginger and helps to damage the machine, giving the chickens only a short time to plan to escape while Mr. Tweedy repairs it. When morning arrives, Ginger finds Rocky has fled, leaving behind a part of a poster that shows him to be a stunt cockerel, shot out of a cannon from a nearby circus and unable to fly by himself. Ginger and the other chickens are depressed. Fowler the cockerel tries to cheer the hens up by telling tales from his days as a Royal Air Force mascot, leading Ginger to the idea of creating a flying machine, called the Old Crate, to flee the Tweedys. All the chickens, with help from the rats, secretly assemble the required parts for the plane from their coops while racing against Mr. Tweedy's repairs. While travelling the countryside, Rocky sees a billboard for Mrs. Tweedy's Chicken Pies and is inspired to go back to help.With the machine now fixed, Mrs. Tweedy insists that Mr. Tweedy gather all the chickens, but the chickens are ready to escape. They knock Mr. Tweedy out and tie him up long enough to complete assembly of their plane. Just before they take off, Rocky returns and joins them. As they are taking off, Mrs. Tweedy chases them down and catches onto a Christmas light strand snagged in the wheels. Mrs. Tweedy climbs the strand, intent on chopping Ginger's head off, while Ginger races to sever the strand. Ginger manages to trick Mrs. Tweedy into cutting the strand with her axe and sends her straight into the vent of the pie machine, causing it to explode. The force of the escaping gravy demolishes the barn they had constructed it in.Later, the chickens have found a quiet island where they can enjoy their freedom and raise their chicks, while Ginger and Rocky have developed a romantic relationship. Nick and Fetcher decide to start their own chicken farm for eggs but disagree on whether to have the chicken or the egg first.","language":"English","Reception":"The review aggregator website Rotten Tomatoes reported a 97% approval rating with an average rating of 8.1/10 based on 170 reviews. The website's consensus reads, \"Chicken Run has all the charm of Nick Park's Wallace & Gromit, and something for everybody. The voice acting is fabulous, the slapstick is brilliant, and the action sequences are spectacular.\"[8] The film also holds a score of 88 based on 34 reviews on Metacritic, indicating \"universal acclaim.\"[9]On opening weekend, the film grossed $17,506,162 for a $7,027 average from 2,491 theatres. Overall, the film placed second behind Me, Myself and Irene.[10] In its second weekend, the film held well as it slipped only 25% to $13,192,897 for a $4,627 average from expanding to 2,851 theatres and finishing in fourth place.[11] The film's widest release was 2,953 theatres, after grossing $106,834,564 domestically with an additional $118,000,000 overseas for a worldwide total of $224,834,564. Produced on a $45 million budget, the film was a huge box office hit. To date, it is the highest grossing stop motion animated movie.Chicken Run was released on VHS and Disney DVD on November 21, 2000.[12]","box_office":"$225 million[2]","cinematography":"Dave Alex Riddett|Tristan Oliver|Frank Passingham|","production_company":"Aardman Animations","directed_by":"Peter Lord|Nick Park|","Video game":"Chicken Run is a stealth-based 3-D platformer based on the movie. The game is a loose parody of the film The Great Escape, which is set during World War II.","Soundtrack":"John Powell and Harry Gregson-Williams composed and produced the music for the film, which was released on 20 June 2000 under the RCA Victor label.[31][32][33]All music composed by John Powell and Harry Gregson-Williams, except as noted.","release_dates":"23 June 2000 (2000-06-23) (US)|30 June 2000 (2000-06-30) (UK)||||","Production":"Chicken Run was Aardman Animations's first feature-length production, which would be executive produced by Jake Eberts. Nick Park and Peter Lord, who runs Aardman, directed the film,[6] while Karey Kirkpatrick scripted the film with additional input from Mark Burton and John O'Farrell. Chicken Run was first conceived in 1995 by Aardman co-founder Peter Lord and Wallace and Gromit creator Nick Park. Pathe agreed to finance Chicken Run in 1996 putting their finances into Script Development and Model Design. DreamWorks officially came on board in 1997.[4][7] DreamWorks beat out studios like Disney, 20th Century Fox and Warner Bros. and largely won due to the perseverance of DreamWorks co-chairman Jeffrey Katzenberg; as a company they were eager to make their presence felt in the animation market in an attempt to compete with Disney's dominance of the field.[4] Katzenberg explained that he had \"been chasing these guys for five or six years, ever since I first saw Creature Comforts.\"[4] DreamWorks secured their first animated feature with the film, and they handled distribution in all territories except Europe, which Pathé handled.[4] The two studios co-financed the film.[4] DreamWorks also retains rights to worldwide merchandising.[4] During the production of the film, 30 sets were used with 80 animators working along with 180 people working overall. Despite this, one minute of film was completed with each week of filming.[7]","produced_by":"Peter Lord|Nick Park|David Sproxton|","starring":"Julia Sawalha|Mel Gibson|Timothy Spall|Phil Daniels|Tony Haygarth|Miranda Richardson|","running_time":"84 minutes","chicken_run":"UK theatrical release poster","music_by":"John Powell|Harry Gregson-Williams|","edited_by":"Mark Solomon","budget":"$45 million[2]"}