{"country":"India","distributed_by":"UTV Motion Pictures[3]","screenplay_by":"Yunus Sajawal Robin Bhatt","story_by":"K. Subash","Plot":"Rahul Mithaiwala (Shah Rukh Khan) is a forty-year-old bachelor living in Mumbai. His parents died in a car accident when he was eight years old, so his grandparents raised him. His grandfather (Lekh Tandon) owns a chain of confectionery shops. Before his grandfather's 100th birthday celebration, two of Rahul's friends invite him to accompany them on a vacation in Goa, which he accepts. Rahul's grandfather dies on the eve of the celebration, just when he witnesses Sachin Tendulkar on TV in a cricket match get dismissed on his 99th run. His grandmother tells Rahul that his grandfather wanted his ashes to be divided into two parts—one of each to be immersed in the Ganges and Rameswaram. She asks Rahul to take the ashes to Rameswaram and disperse them. Reluctantly, he accepts her request but is also eager to attend the Goa trip. Rahul and his friends plan to dump the ashes at Goa but his grandmother wants to see him off, forcing Rahul to travel by train. He books a single ticket on the Chennai Express, planning to meet his friends along the way. However, Rahul forgets to take the ashes, and he almost misses the train when he returns to collect them. As he tries to leave the train, he notices a young woman running to board it. He helps her and four other people board the moving train, but the train leaves the station before he can get off.Rahul tries to flirt with the woman, who starts communicating by singing parodies of Hindi film songs, and explains that the four men are trying to kidnap her. Rahul lends her his mobile phone so that she can contact her friends, but the men with her grab it and throw it from the train. Rahul is annoyed, but says nothing because the men are carrying weapons. Rahul tells the ticket inspector about them, but they push the inspector into a river below a bridge. Panicked, Rahul learns that the men are her cousins, and that her name is Meenalochni \"Meena\" Azhagusundaram (Deepika Padukone). She is fleeing from a forced marriage to Tangaballi (Nikitin Dheer). Her father, Durgeshwara Azhagusundaram (Sathyaraj) is a powerful headman of the local mafia in Tamil Nadu.Meena takes Rahul to her father and introduces him as her lover. Tangaballi challenges Rahul to a duel that Rahul unknowingly accepts, due to his lack of knowledge in Tamil. On the night of the duel, Rahul escapes with the help of a local policeman, Shamsher (Mukesh Tiwari), but he ends up on a ship with Sri Lankan terrorists and smugglers. A gun battle ensues between the police force and the terrorists. When police officers investigate an arrested Rahul, he tells his story and ends up back in Komban. Surrounded by Azhagusundaram's sickle-wielding henchmen, Rahul pretends to take Meena hostage and escapes with her in her father's car, battling Azhagasundaram's men. When the car has a breakdown, Rahul and Meena quarrel and part ways. Rahul, not knowing which way to go, returns to Meena, who takes him to the Vidhamba village. Meena tells the villagers that they are a married couple who needs protection and rest. The villagers decide to help the two.Meena then realises that she has fallen in love with Rahul. When Rahul plans to sneak away, she argues, not wanting to earn the villagers' distrust. Tangaballi catches Rahul as he tries to leave, but the villagers help them escape again. Meena persuades Rahul to disperse his grandfather's ashes and travels with him to Rameswaram, where they complete the rites. On their way back, Rahul realises that he has fallen in love with Meena, and does not tell her where they are going. He takes Meena back to her father and tries to make him understand and honour his daughter's wish. He also tells Meena that he loves her. Rahul tells Tangaballi and his goons that he is ready for the fight this time. In the fight that follows, Rahul is severely injured but emerges victorious. Meena's father and Tangaballi reform, accepting that the love of a common man like Rahul is bigger than their physical ability and political influence. Azhagusundaram allows Rahul to marry Meena. Rahul then leaves a message that love knows no regional or language barriers and that with a strong heart, there is no limit to what the common man can achieve.","language":"Hindi","Critical reception":"Chennai Express received mixed reviews from critics worldwide.[85]Taran Adarsh of Bollywood Hungama gave the movie 4 out of 5 stars and wrote, \"On the whole, 'Chennai Express' has the trademark Rohit Shetty stamp all over. You seek entertainment, entertainment and entertainment in a film like 'Chennai Express' and the movie lives up to the hype and hoopla surrounding it.\"[86] Rachit Gupta of Filmfare rated the movie 4 of 5 stars, stating, \"The film's peppered with humorous set pieces and colourful locales and songs. Rohit Shetty makes chettinad-style masala movies. And that's the perfect description of this film. If you don't plan to engage in a multi-lateral critique of dramatic elements and narrative, this film can be fun.\"[87] Sarita Tanwar Of DNA gave the movie 3.5 of 5 stars and said, \"This is a treat for all Hindi film lovers. It has all the ingredients you'd expect from a big commercial masala film—big star cast, drama, action, comedy, songs, the car chases and the big finish, all delivered in Rohit Shetty's unapologetic ishtyle ... Overall, this is a bubblegum blockbuster.\"[88] Meena Iyer of Times of India gave the movie 3.5 of 5 stars, saying, \"Chennai Express is a magnificently mounted film. In an ode to his own cinema—read Golmaal series or Bol Bachchan, Rohit Shetty, the director, who has grossers in Bollywood's 100-crore club, ups the scale for his Eid offering.\"[89]Saibal Chatterjee of NDTV gave the movie 3 of 5 stars and said that, \"The whole-hearted zeal that SRK and Deepika bring to the table and the steady flow of funny one-liners serve Shetty's purpose well, turning Chennai Express into a full-on masala film that is completely unapologetic about its intentions. And that is its USP [Unique Selling Point].\"[90] Zee News rated the movie 3 of 5 stars, stating that if one ignores the platitudes, the absence of \"punch\" in the script and predictability, then the person is \"onboard for a fun ride\" with Chennai Express.[91] India Today gave the film 3 stars: \"The good news first. 'Chennai Express' is a pleasant and likeable film in parts. The bad news is, it does nothing for Shah Rukh Khan's imdomitable star power except to tell us he can still play a 40-year [old] Rahul without faltering.\"[92] Abhishek Gupta of India TV gave it 2.5 stars and wrote, \"The comedy along with the action is rarely served with equal entertainment in today's cinema. We discern Rohit Shetty for his mass leisure which includes cars fluttering from the unknown corners and comedy which isn't slapstick but works.\"[93]Shubhra Gupta of The Indian Express gave the movie 2.5 out of 5 stars, and wrote that the film comes up with some genuinely funny moments. She commended Padukone's looks, although she criticized aspects of her stagecraft skills.[94] Sukanya Verma of Rediff.com gave the film 2.5 stars, saying, \"Chennai Express evokes a few laughs but otherwise it decides to shift tracks from droll comedy to dreadful drama.\"[95] Khalid Mohamed of Deccan Chronicle gave the film 2.5 stars and wrote, \"board Chennai Express at your own risk\".[96] Rajeev Masand of CNN-IBN gave the film 2/5 rating and said the film was a \"big, fat\" bore. He commented that Chennai Express was a \"bloated vanity project\", and felt that the lead actor could have performed better.[97] Mayank Shekhar of Dainik Bhaskar rated it 1 star out of 5, saying, \"You've paid for the ticket? Yes. Now just sit back and suffer.\"[98]Rachel Saltz of The New York Times wrote, \"'Chennai Express' feels like a sumptuous meal with carefully chosen wine and tasty appetizers but a botched main course. Money and visual care have been lavished on this Bollywood action-comedy-romance and glossy stars engaged (Shah Rukh Khan and Deepika Padukone). But the movie chugs along for most of its 2 hours and 20 minutes searching for comedy and characters in a frantically overplotted story.\"[99] Sneha May Francis of Emirates 24/7 wrote, \"Rohit Shetty's s(h)tyle of romance relies heavily on buffoonery and will be applauded mainly by Shah Rukh Khan loyalists\". She added, \"Rohit's carnival-like comedy coaxes some laughs, but can leave you exhausted.\" Sneha said that Padukone's performance \"outshines\" that of Khan.[100] Ronnie Scheib of Variety wrote, \"Shah Rukh Khan and Deepika Padukone are ill matched in this overworked comedy/romance/actioner ... Shetty's need to maintain his characters' romantic heroism constantly grates against his depictions of their ridiculousness.\"[101] Simon Foster of the Special Broadcasting Service gave the film 2 stars out of 5 and described it as \"a loud, lame-brained romantic comedy from the (very) broad directorial brush of Rohit Shetty, SRK's over-hyped vehicle sees the charismatic but ageing actor badly miscast and easily overshadowed by his leading lady, Deepika Padukone.\"[102]","box_office":"₹396 crore (US$59 million)[8]","cinematography":"Dudley","production_company":"Red Chillies Entertainment","directed_by":"Rohit Shetty","Soundtrack":"The score of Chennai Express was composed by Amar Mohile;[42] the songs were composed by the duo Vishal-Shekhar,[43] and the lyrics were written by Amitabh Bhattacharya and Yo Yo Honey Singh.[44] Recording of the songs began in late October 2012. The track \"Ready Steady Po\" was recorded in November 2012 by the music's composers. Several sources said that the director and actor were unsatisfied with the score. The director was reportedly asked to plan for a different musical composition.[45] However, the composers denied these rumours.[46] In mid-April 2013, singer S. P. Balasubrahmanyam recorded the title track for the film, marking his return to Bollywood for playback after an absence of fifteen years. He said the song celebrated the spirit of togetherness. Initially, Balasubrahmanyam was apprehensive, but chose to sing due to the content and leads of the film.[47] The song \"1 2 3 4 get on the dance floor\" was released as a promotional single on World Music Day. On 27 June 2013, the video promo of the song \"Titli\" was released,[48] and on 11 July 2013, the promo video of \"Kashmir Main Tu Kanyakumari\" was released.[49] On 19 July 2013, T-Series uploaded a song to its official channel on YouTube; sung by Honey Singh. The song was titled \"Lungi Dance – The 'Thalaivar(r)' Tribute\" in honour of the south Indian film actor Rajinikanth.[50] On 25 July 2013, a promotional video of the song \"Tera Rasta Main Chhodoon Na\" was released.[51] The music album was launched on 1 July 2013.[52]The soundtrack album of Chennai Express received positive reviews. Devesh Sharma of Filmfare gave the album 4/5, saying that it is \"a robust offering, which is full of new sounds and zany surprises\", and that Vishal-Shekhar put in a lot of effort to bring out their best for the film.[53] IBN Live gave the album 3.5/5 and stated that the album was another \"winner\" from Vishal-Shekhar. The composers were critically praised for blending different forms of music which \"pepped\" the otherwise usual Bollywood music.[54]Yashika Mathur of DNA gave the album 3.5/5 and said that Chennai Express is \"another winner from Vishal-Shekhar\" that \"boasts of a soothing bouquet of typical Bollywood numbers and some peppy tracks with exceptional mixing.\" She wrote that it \"is likely to appeal to music lovers of all age-groups and sentiments\" and called it \"[a]n entertaining all-rounder, the composers must be applauded for fusing different music and beats to pep up the otherwise usual Bollywood music.\"[55]Joginder Tuteja of Rediff.com gave the album 3/5 and wrote that the title song, \"Chennai Express\", is \"just about average\". He expressed his displeasure over Balasubramaniam's ill-suiting of voice for Shah Rukh Khan, and said that in all the song was not remarkable. He however complimented that the overall outcome was \"satisfactory\" with a few of the songs even standing out.[56] Anand Holla of Mumbai Mirror said, \"It's easy to imagine director Rohit Shetty's crystal clear brief to Vishal-Shekhar, involving words such as catchy, peppy, fun, and of course 'hit songs'. Given how happily formulaic the soundtrack has turned out, V–S have given us a fair idea of what awaits us this Eid.\"[57]","narrated_by":"Shahrukh Khan[2]","chennai_express":"Theatrical release poster","release_dates":"8 August 2013 (2013-08-08) (Overseas markets[4][5])|9 August 2013 (2013-08-09) (India[6])||||","Production":"Mayank and Rohit Shetty had originally planned to team up for a remake of the 1982 film, Angoor. After the 2011 blockbuster Singham, Shetty had begun writing the script of the film but left it half-finished. The script of Chennai Express was ready for Shah Rukh Khan as a back-up, because of the difficulty of obtaining the actor's filming dates.[15] Upon reading the script, Khan liked the idea and agreed to star in it before the Angoor remake, causing Angoor's remake to be postponed. Shetty said the film is \"a hard-core commercial film with a romantic angle. The story is about this man's travel from Mumbai to Rameshwaram and what happens during the journey.\"[16] About 68 minutes of footage were enhanced with CGI by Reliance MediaWorks.[17]Shah Rukh Khan was the first actor to be approached with the script and was the first lead actor to be signed for the film. Rohit Shetty stated that despite the title, Khan would not play a South Indian in the film. The casting of the lead heroine was the subject of much press speculation; Kareena Kapoor, Asin Thottumkal and Deepika Padukone were rumoured to be involved.[18] Shetty denied those rumours, stating that the cast would be finalised in April 2012, and that he was going to cast an established actress in the role.[19] In October 2012, it was confirmed that Deepika Padukone had been signed to play the female lead opposite Khan, and photographs showing Padukone and Khan shooting were released. This was Padukone's second film opposite Khan, with whom she made her Bollywood debut in the 2007 blockbuster Om Shanti Om.[20][21] Starting with this film, which was released on Women's Day, Khan wished to have the name of his female co-star appear above his own in the credits.[1]Sathyaraj was cast to play the role of Padukone's father—the film's main antagonist—making his debut in Bollywood.[22] Actress Priyamani was signed in January 2013 for an item number in the film.[23] Other personalities from Tamil cinema, including Delhi Ganesh and Mohan V. Raman, appear in minor roles.[24]Filming on the project began at Mehboob Studio in Mumbai on 5 October 2012.[25] additional filming was done at Chhatrapati Shivaji Terminus railway station with a minimal crew.[26] Stills of the lead actor were unofficially released in mid-October 2012.[27] In November 2012, the cast and crew went to Goa to begin filming the scenes set there.[28] The railway station at Vasco da Gama was used to portray Kalyan. A romantic scene on board a train passing next to Dudhsagar Falls was also shot.[29] In December 2012, the crew went to Jakarta to film certain scenes.[30]In January 2013, a shoot was supposed scheduled to take place in Ooty, but since Khan felt that Ooty was too far from Mumbai, several locations from Ooty were reconstructed on the outskirts of Panchgani in Wai by art director Narendra Ruharikar.[31] It took over 40 days and ₹ 15 million to build the required sets.[31][32] Filming in Wai took the entire month of March 2013.[33] A 10-day shooting schedule in Munnar, Kerala, began in mid-April 2013; scenes were filmed at Devikulam Lake, Meesapulimala, Wagavara and Kannimala.[34] Filming was stopped for several days because of heavy rainfall, resulting in the schedule being slightly extended until end of the same month.[35] A press conference was held in Munnar.[36] In May 2013, scenes were filmed in North Goa.[37][38] Padukone finished shooting on 25 May 2013.[39] Khan flew to Hyderabad in May 2013 to film his remaining scenes.[40] The film has several Tamil dialogues, but to retain context no subtitles were used.[41]","Box office":"At the time, Chennai Express became the highest grossing Bollywood film, both in India and around the world, collecting ₹3.96 billion (US$59 million) by the end of its run.[103] It currently stands as the fourth-highest grossing Bollywood film worldwide.[104] The film's gross broke the ₹3.92 billion (US$58 million) record set by 3 Idiots, according to Box Office India.[105][106]During paid previews, Chennai Express performed well, with the Hindi version collecting ₹ 67.5 million, surpassing the previous record held by 3 Idiots, according to Box Office India.[107] The film collected ₹ 292.5 million on its opening day, making it the second highest opening day collection behind Ek Tha Tiger.[108][109] The film broke the second and third day box office records, collecting ₹264.30 million (US$3.9 million),[110][111] and ₹292.10 million (US$4.3 million) respectively,[62] and collected ₹870.8 million (US$13 million) (₹938.3 million (US$14 million) including paid previews),[112] breaking the previous weekend record set by Yeh Jawaani Hai Deewani.[113][114] Chennai Express set another record for worldwide opening gross, earning ₹1.59 billion (US$24 million) in the three-day weekend.[115][116] The film performed well on Monday, collecting over ₹120 million (US$1.8 million). It grossed ₹115 million (US$1.7 million) on its first Tuesday, becoming Shah Rukh Khan's highest grossing film in India.[117][118] The film grossed ₹125.60 million (US$1.9 million) on Wednesday.[119][120]Box Office India reported that the film grossed ₹190 million (US$2.8 million) net on Thursday, taking its first week total (including paid previews) to ₹1.461.50 billion (US$22 million), beating the previous record of Ek Tha Tiger.[121][122][123][124] It had a worldwide gross of ₹2.5 billion (US$37 million) in the first seven days.[125] The film collected ₹237.50 million (US$3.5 million) on its second weekend, taking the total domestic net to ₹1.68 billion (US$25 million), and also became the second highest grossing Bollywood film in ten days with a worldwide gross of ₹3.14 billion (US$47 million).[126][127]The film earned ₹1.85 billion (US$27 million) in two weeks and had collected ₹1.94 billion (US$29 million) after its third weekend in the domestic market.[128] It grossed ₹160 million (US$2.4 million) in its third week, bringing up its total to ₹2.00.75 billion (US$30 million).[129] Chennai Express broke the domestic net record set by 3 Idiots in its fourth weekend[130][131] and added around ₹57.40 million (US$850,000) in week four to take the total to ₹2.06 billion (US$31 million).[132][133][134] The film collected ₹3.5 million (US$52,000) on its sixth week, for a final total of ₹2.08.25 billion (US$31 million).[135][136][a] The film's lifetime domestic distributor share stands at ₹1.15 billion (US$17 million), breaking Ek Tha Tiger's previous record of ₹1.07 billion (US$16 million).[138]Chennai Express also broke overseas records; during paid previews in the UK the film collected more than any first day of a Bollywood film in the UK.[139] The film broke opening weekend records in foreign territories, taking in ₹504.70 million (US$7.5 million), including record collections from key markets in the US ($2.22 million), the UAE (AED 7.73 million) and the UK (£934,118).[140][141][142] Chennai Express set a record for opening weekends overseas, grossing US$7.1 million.[143] It was also successful in Pakistan, where it collected ₨18.4 million (US$180,000) in its opening weekend.[144] By 18 August, the film had broken all box office records in Karachi by grossing over ₨40 million (US$390,000).[145][146]The film earned ₹720 million (US$11 million) in just nine days in overseas markets.[147][148][149] By the second weekend, it had grossed approximately US$14 million.[150] Chennai Express had grossed about US$16 million by its third weekend overseas and US$16.85 million by the fourth weekend.[151] By the fifth weekend, the film had grossed about US$17.25 million abroad. It was still collecting in its sixth weekend, taking its total to US$17.40 million.[152]","produced_by":"Gauri Khan Ronnie Screwvala Siddharth Roy Kapur","starring":"Deepika Padukone[1] Shahrukh Khan","running_time":"141 minutes[4]","music_by":"Songs: Vishal–Shekhar Background Score: Amar Mohile","edited_by":"Steven H. Bernard","Release":"The film had paid previews in India on 8 August 2013, with ten to twelve shows at multiplexes.[58] Chennai Express was scheduled to be released in non-traditional international markets. In Peru, it was the first Hindi film to be released on the same day as in India.[59] Chennai Express was also released in Morocco, Germany, Switzerland, Austria, France, and Israel.[60] The price of tickets for Chennai Express was increased 40 percent above the usual tariff during the weekday shows and up to 20 percent on weekends; although this increase was not uniformly applied in all multiplexes.[61]The film was released in 2,550 cinemas across 3,550 screens in India,[62] and across 700 screens internationally—including 196 screens in the United States, 175 in the United Kingdom,[63] 55 in the Middle East, and 30 in Australia—the widest Bollywood release up to that point.[64][65][66]A first look of Chennai Express was released on 1 January 2013.[67] A thirty-one second title track teaser, sung by S. P. Balasubrahmanyam, was released on 23 May 2013.[47] The official trailer of the film was released at an event in Mumbai on 13 June 2013; two days after its launch it exceeded four million views on YouTube.[68] A platform running game titled Chennai Express: Escape from Rameshwaram, based on the film and featuring Shahrukh Khan & Deepika Padukone, was developed by Disney UTV's digital wing, and launched on 24 July 2013 for Android systems. In the game, the player rides a virtual roller-coaster, fighting off goons and dodging obstacles while they attempt to collect over 10,000 coins in order to unlock Padukone's game avatar.[69] The outfits worn by Khan and Padukone in the film were auctioned; proceeds from the sale were donated to a charity.[70] The auction took place around the day of the film's release.[71] A Karaoke app developed by Singbox—a Swedish gaming studio—was launched on 2 August 2013 for Android and iOS based smartphones.[72]Khan promoted his film on the reality television shows Comedy Nights with Kapil, Madhubala Ek Ishq Ek Junoon, DID Super Moms, Jhalak Dikhhla Jaa 6 and Indian Idol Junior.[73] The Zeitgeist—Google's year-end compilation of the most frequent search queries—named Chennai Express the most trending topic of 2013 in India.[74] The film's satellite television rights were sold to Zee Network for ₹480 million (US$7.1 million).[75] The agreement was linked to the film's box office revenue—the first deal of its kind in Indian cinema. If Chennai Express collected over ₹1.3 billion (US$19 million) net, then for every ₹100 million earned after that, the producers would get an additional ₹20 million.[75] The film had its television premiere on 20 October 2013, and was seen by a record number of viewers, almost doubling that of the highest rated fiction show. It helped its broadcaster, Zee TV, to reach the top position among General Entertainment Channels that month.[76]Along with Once Upon ay Time in Mumbai Dobaara!, Chennai Express was initially abandoned by Pakistani distributors and exhibitors because four Pakistani films were released on the same day.[77][78] The release dates were postponed to 15 and 9 August, respectively.[79] During its Wai schedule of filming, the film's unit ran into trouble for using too much water from Dhom Dam, in the drought-stricken Satara district of Maharashtra. The state's relief and rehabilitation minister, Patangrao Kadam, addressed the problem.[80]The film's poster and trailer, released on Twitter and YouTube, were criticised by some Tamil media for their depiction of Tamil ethos. They said Padukone's heavily accented dialogue resembled a Malayalee accent rather than a Tamil one.[81][82] Padukone defended the film, saying that it did not parody South Indian culture and that most of the crew, including herself, are South Indians. She later said, \"Why would we spoof our own culture?\"[83]On 31 July 2013, the Nationalist political party Maharashtra Navnirman Sena's film wing threatened to disrupt the film's premiere; it reportedly attempted to dislodge ongoing popular Marathi movies from cinemas that show only one film at a time. The party was upset with reports that the distributors of Chennai Express had demanded prime slots in single screen cinemas, and at some multiplexes, where the superhit Marathi film Duniyadari had been popular since 19 July. On 1 August 2013, both the film directors, Rohit Shetty and Sanjay Jadhav were called on by Raj Thackeray to find a solution. After listening to both parties, Thackeray ruled that if Duniyadari was not removed from single screen cinemas across the state, then the MNS would not object to the release of Chennai Express in Maharashtra.[84]","budget":"₹115 crore (US$17 million)[7]"}