{"country":"United States","distributed_by":"Warner Bros.","Plot":"Brian MacLean (James Cagney), Johnny Dutton (Dennis Morgan), \"Tiny\" Murphy (Alan Hale, Sr.), \"Blimp\" Lebec (George Tobias), and British expatriate \"Scrounger\" Harris (Reginald Gardiner) are bush pilots competing for business in rugged Northern Ontario, Canada in 1939, as the Second World War is beginning. Dutton, whose ambition is to start his own airline, flies by the book but MacLean is a seat-of-the-pants kind of pilot, mirroring the differences in their personalities.Dutton saves MacLean's life after he is struck in the head by a still-moving propeller by transporting a doctor under dangerous flying conditions. MacLean is grateful and joins Dutton in a temporary partnership to help Dutton earn the seed fund for his airline. When Dutton rejects MacLean's warning about the gold digging character of Dutton's badly-behaved girlfriend Emily Foster (Brenda Marshall), MacLean marries her in order to save Dutton from a life of misery. Dutton, however, does not understand that MacLean's actions are an act of kindness, and so he abruptly ends their friendship. Depressed, Dutton impulsively gives his savings to charity and enlists in the Royal Canadian Air Force.Later, after hearing Winston Churchill's \"We shall fight on the beaches\" speech on the radio, MacLean and the other bush pilots attempt to enlist in the air force, only to discover that they are too old for combat. They reluctantly agree to train as flight instructors for the British Commonwealth Air Training Plan. Their superior officer is none other than Dutton. MacLean's brash and fiercely independent nature clashes with the military way of doing things, and he inevitably washes out. For revenge, he and \"Tiny\" buzz the airfield in their bush planes when renowned Canadian First World War ace Air Marshal William \"Billy\" Bishop (playing himself) is speaking during the group's graduation ceremony. During the buzzing,\"Tiny\" suffers a blackout (loss of vision due to g-forces), crashes the plane and dies.When two transport aircraft crash, killing all 44 ferry pilots aboard, there is a desperate call for pilots to ferry a group of unarmed Lockheed Hudson bombers from Gander, Newfoundland to Britain. MacLean pretends to be Murphy and volunteers. Dutton recognizes him but nonetheless permits him to fly after the two reconcile. Near the coast of the British Isles, the bombers are attacked ruthlessly by a single German fighter plane, a Messerschmitt Bf 109. \"Blimp\" Lebec's plane is shot down and it becomes clear that the Messerschmitt intends to pick off the bombers one by one. After MacLean's navigator \"Scrounger\" is killed, MacLean uses his flying skills to crash his unwieldy bomber into the nimble fighter, sacrificing himself to save the remainder of the group.","language":"English","Reception":"Released in an era of patriotic films with overt propaganda themes, Captains of the Clouds received an enthusiastic public acceptance. Although it was a \"Hollywood\" production, the film premiered simultaneously on February 21, 1942 in New York, London, Ottawa, Cairo, Melbourne, Toronto, Winnipeg, and Vancouver, with RCAF pilots transporting film copies to all these cities.[16][17] The public reaction can be partly attributed to the plot line that revolved around the unique Canadian wilderness and the bush pilot mystique. \"So Full of Spectacle and Glory it Had to be Made in Technicolor!\" was the ad copy that was used. The vivid aerial scenes filmed in Technicolor were another aspect of the expensive production that garnered critical attention.[N 4] Reviews were mixed; while some critics felt the film suffered from a stagey plot and a forced romantic story line, the aerial scenes were considered the film's redeeming feature.[18]","box_office":"$2.4 million (US rentals)[1]","cinematography":"Wilfred M. Cline, Sol Polito Winton C. Hoch Charles A. Marshall","directed_by":"Michael Curtiz","Awards":"Captains of the Clouds was nominated for Best Art Direction- Interior Decoration, (Color) (Ted Smith, Casey Roberts), and Best Color Cinematography[N 5] at the 1943 Academy Awards.[19]","Music":"The music score is by Max Steiner, and Harold Arlen wrote the title song (lyrics by Johnny Mercer) which is used as a march in the film. Later, \"Captains of the Clouds\" was adopted as an official song of the Royal Canadian Air Force, although its use today is largely ceremonial.[5] The tune is also known for its use in Carl Stalling's music scores for various Warner Bros. Cartoons shorts.Canada's unofficial national anthem, \"The Maple Leaf Forever\", by Alexander Muir, is also heard, as well as \"O Canada\", the de facto Canadian anthem since 1939, and official anthem since 1980.The title song was the B side of a 1942 recording (Decca 4174) by Dick Powell, with Over There as the A side.[6]","captains_of_the_clouds":"VHS cover","release_dates":"February 12, 1942 (1942-02-12) (New York City)|||||","Production":"During pre-production, Joseph W.G. Clark, the public relations director of the British Commonwealth Air Training Plan was heavily involved in promoting a film project that was initially identified as \"Bush Pilots\" based on a script submitted by Canadian screenwriters. With RCAF backing, Hal Wallis and Jack Warner were approached in Hollywood to undertake a \"patriotic film.\" Warner was enthusiastic, and began the task of casting a major star to front the project. After considering Raymond Massey, Errol Flynn, and Clark Gable, the decision was made to cast George Brent, but Warner Brothers was unsure whether he could carry the film.[7] Numerous attempts to rewrite the script into a more acceptable form resulted in a final screenplay now titled \"Captains of the Clouds\". The name was borrowed from a Victory Loans speech given by Billy Bishop. The only holdup was casting, which was resolved when Warner persuaded its resident \"cocky guy\" (as producer Jerry Wald had dubbed him), 42-year-old James Cagney, to take on the lead male role.[8]This film was Cagney's first in Technicolor. His participation in the production has been characterized as reluctant, and he only accepted after his brother was taken on as an associate producer. He quipped, \"I didn't like this story the last four times I did it and I don't like it now!\", fearing that he was immersed in one of his trademark Warner Brothers \"potboilers\", playing a role he had reprised numerous times. Yet in certain scenes, Cagney improvised, reverting to his typecast style. His loose interpretation is evident in a cabin scene when he is playing against his cronies. Cagney veers off the script pages, reverting to the cocky persona he had cultivated in countless earlier features.[9]Captains of the Clouds was produced with the full cooperation of the Royal Canadian Air Force to promote enlistment in the British Commonwealth Air Training Plan.[3] (It was also intended as a rousing \"war preparedness\" film for American audiences, but by the time it was released, the U.S. was already at war; nevertheless it did serve as a showcase of the Canadian war effort.) The Warner Brothers principal cast and production crew of over 80 technicians along with \"half a million dollars of colour cinematography equipment\" came from Hollywood, crossing into Canada on July 12, 1941.[8] Scenes filmed in Ottawa include several views of the historic Chateau Laurier hotel, Parliament, and the Cenotaph area.[3]Much of the early footage involved a number of bush planes at the Woodcliff Camp on Trout Lake in North Bay, Ontario, and nearby Camp Caribou on Jumping Caribou Lake in Marten River, Ontario.[4] The aerial sequences were under the direction of Paul Mantz, long-time Hollywood stunt pilot, who used a Stinson Model A trimotor camera ship. MacLean's aircraft, CF-HGO in the scenes, was a Noorduyn Norseman flown by veteran stunt pilot Frank Clarke (who doubled for James Cagney in flying scenes),[10] Johnny Dutton's silver CF-NBP was an actual Fairchild 71C bush plane, [N 1] while Laurentian Air Service's Waco EGC-7 and AGC-8 cabin aircraft provided the other float planes.[12]Principal photography did not go well; a number of incidents slowed production.[12] One of the huskies that was key to a scene bit Morgan, opening up a gash on his hand. Cagney, in an uncharacteristic move, decided to forgo a stunt double and play the scene himself in which his character is struck by a whirling propeller. At first things proceeded smoothly, but when it came time for him to fall into the lake, he overdid it and suffered a real concussion, putting the 10-day shoot at North Bay, Ontario farther behind schedule. Weather was a constant challenge, and with the need to ensure continuity, small scenes became unnecessarily complex; as a result, a typical shooting day lasted almost into the night.[12] One 30-second scene with all the principals running along the dock took an entire day to complete, with Cagney, Hale, and Tobias barely able to stand at the end of filming.[13] With a Hollywood production in their midst, North Bay residents became such a persistent nuisance that the crew reverted to sending messages out of the location site by homing pigeons.[14] [N 2]The military background sequences were shot at RCAF Air Stations at Uplands, Trenton, Dartmouth, Jarvis, and Mountain View. The \"Wings Parade\" (officially the \"Presentation of Wings Ceremony\") filmed at the No. 2 Service Training School at RCAF Uplands was an actual graduation service for 110 RCAF cadets. It proved to be the most complex scene of the film. Over 100 Harvard training aircraft flew overhead in a salute to the graduates.[4]The climactic ferry mission was staged out over the Atlantic from RCAF Station Dartmouth using the base's operational Lockheed Hudson bombers, along with a repainted Hawker Hurricane that posed as a German Bf 109 fighter.[N 3] Due to the prominent Luftwaffe markings on the RCAF fighter, special alerts had to be posted in order to prevent the \"trigger-happy\" home defence gunners from shooting down their own aircraft.[4]","produced_by":"Hal B. Wallis William Cagney","starring":"James Cagney Dennis Morgan Brenda Marshall Alan Hale, Sr. Billy Bishop","running_time":"114 minutes","music_by":"Max Steiner (score) Harold Arlen (title song)","edited_by":"George Amy","written_by":"Arthur T. Horman Roland Gillett Richard Macaulay Norman Reilly Raine"}