{"country":"United States[2]","distributed_by":"Warner Bros.","screenplay_by":"Brian Helgeland|Lilly Wachowski Lana Wachowski|","story_by":"Lana Wachowski|Lilly Wachowski|","Plot":"Robert Rath (Sylvester Stallone) is a paid assassin who wants nothing more than to get out of 'the business', haunted by the memory of murdering his own mentor Nicolai years ago. Rath is a quiet, morose professional who is on an assignment to kill someone when someone else gets to the 'mark' (the target) before he does. That person turns out to be Miguel Bain (Antonio Banderas), a fellow assassin and a competitive sociopath.Rath then has the trouble of trying to figure out who sent Bain, the contractor offers him one last job that could financially allow him to retire: killing the four Dutch buyers and the computer hacker named Electra (Julianne Moore) and retrieve a disk that contains sensitive information. Electra has set up cameras in all the rooms of the apartment block where she lives and watches them like watching television.Bain is assigned to kill Electra as well. Bain kills the four Dutch buyers who turn out to be Interpol agents and Rath comes to kill Electra but for the first time has a change of heart. His pay for the job is given to him in a briefcase in exchange for the disk. The briefcase actually contains a bomb placed by his own contractor in an attempt to kill him. Luckily Electra had swapped the disk, not sure if Rath was coming back or not.The contractor takes the chance and hires Bain to terminate him; now having become a target along with Electra he must try and extract enough money out of his contractor so he can disappear for good, while avoiding the bloodthirsty Bain. Rath's contractor turns out to be none other than Nicolai himself who also hired Bain to track down Electra and the disk.Nicolai revealed he had a vest on when Rath shot him years ago and faked his death ever since. Knowing that Nicolai would kill him too, Bain, along with Rath, shot him dead. Bain plans to kill Rath to be the number one assassin. But Electra puts on her sunglasses to allow Rath to see Bain. Rath shot Bain through his jacket killing him.","language":"English","Reception":"The film received mostly negative press,[7][8] and currently holds a 16% rating on Rotten Tomatoes based on 45 reviews, with an average rating of 3.7/10.[9] The script was heavily criticized for being confusing and dull. However, the actors' performances were praised. Stallone's performance in the film earned him a Golden Raspberry Award nomination for Worst Actor (also for Judge Dredd), but lost the trophy to Pauly Shore for Jury Duty.Assassins debuted at No. 2 at the box office.[10] The film grossed $30.3 million in the US and another $53.2 million worldwide, for a total of $83.5 million.[3]","box_office":"$30.3 million (US)[3]","cinematography":"Vilmos Zsigmond","production_company":"Silver Pictures Canal+","directed_by":"Richard Donner","release_dates":"October 6, 1995 (1995-10-06) (United States)|November 1, 1995 (1995-11-01) (France)||||","Production":"The original spec screenplay was written by Lana and Lilly Wachowski and sold for $1 million to producer Joel Silver around the same time he bought their script for The Matrix, also for $1 million. The script was similar to the final product, but with a more developed love story between Rath and Electra and a briefer ending without the character of Nicolai. Joel Silver offered Richard Donner $10 million to direct, but Donner insisted the script be rewritten to tone down the violence and make the central character more sympathetic and brought in Brian Helgeland, who did a page one rewrite and earned a co-screenwriter credit. The Wachowskis attempted to remove their name from the film but were refused by the Writers Guild of America.[6]","produced_by":"Joel Silver|Bruce A. Evans|Raynold Gideon|Andrew Lazar|Jim Van Wyck|Richard Donner|","starring":"Sylvester Stallone|Antonio Banderas|Julianne Moore|","running_time":"132 minutes [1]","assassins":"Theatrical release poster","music_by":"Mark Mancina","edited_by":"Lawrence Jordan|Richard Marks|","budget":"$50 million[3]"}