{"Cast":"[2] [3]","country":"Hong Kong","distributed_by":"Newport Entertainment (HK) HKFM (US)","story_by":"Louis Cha","language":"Cantonese","box_office":"HK$9,023,583 (HK) US$1,912,490 (Redux)[1]","cinematography":"Christopher Doyle","production_company":"Jet Tone Productions Beijing Film Studio Tsui Siu Ming Production Scholar Films Pony Canon Inc.","directed_by":"Wong Kar-wai","release_dates":"17 September 1994 (1994-09-17)|||||","running_time":"100 minutes 93 minutes (Redux)","budget":"HK$40,000,000 (estimated)","mandarin":"Dōng Xié Xī Dú","screenplay_by":"Wong Kar-wai","Plot":"In this film, set in ancient times in China, Leslie Cheung plays an agent, Ouyang Feng, hiring famous bounty hunters. His character is portrayed as a fallen swordsman driven by greed and heartless to both friend and foe. He was perpetually being spiteful of love as his own love history was not nearly so beautiful. His bounty-hunters came and went as was narrated by Ouyang Feng himself as based on the Tung Shu predictions.In essence, he was a loner with little love, but the bounty hunters that worked for Ouyang Feng, like Blind Swordsman and another of his best fighters, Hong Qigong, discovered the intangible secret of true love while Ouyang retained his attitude towards his fighters and the precious lessons that they have taught. However, the thread that runs through the entire narrative has clearly the spirit of refusal in the sense that one should reject another before he gets to be rejected in the future. To illustrate, nearly every character in this story has resorted to being selfish and malignant in order to prevent being rejected by others, be it in love or in comradeship as their individual hardships have moulded their attitude turning them into heartless and cold individuals in order to survive in the uncompromising desert where the story is set.It has many moral implications but is less evident since the main character is Ouyang himself and most of the narration would unquestionably be centred on him.","Reception":"When the film opened in Hong Kong it received mixed reviews. Critics found it so elliptical that it was almost impossible to make out any semblance of a plot, something very rare in a wuxia film.In The New York Times, Lawrence Van Gelder also gave Ashes of Time a mixed review:[5]For those who seek metaphors, Ashes of Time... presents the eye as well as the illusions of vision. One character is nearly blind. Another, a swordsman, goes blind in the middle of a horrendous battle. Two characters, Yin and Yang—one presented as a man, the other as his sister—are identical. And there is a brief appearance by a legendary sword fighter who hones his skills against his own reflection.For those who seek battle, Ashes of Time offers intermittent blurs of action, streaks of flying figures, flashing steel, and rare spatters and gouts of moist crimson, all washing across the screen like hurried brush paintings.Like the attainment of wisdom, Ashes of Time requires a long journey through testing terrain.Note that this review contains a number of errors as regards the plot of the movie.Ashes of Time grossed HK$9,023,583 during its Hong Kong run.","cantonese":"Dung1 Ce4 Sai1 Duk6","ashes_of_time":"Film poster","traditional":"東邪西毒","Soundtrack":"The music was composed by Frankie Chan and Roel A. García, and produced by Rock Records in Hong Kong and Taiwan. It was released in 1994. The redux version features additional cello solos by Yo-Yo Ma.[4]","simplified":"东邪西毒","produced_by":"Wong Kar-wai Jeffrey Lau Jacky Pang","starring":"Leslie Cheung Tony Leung Ka-fai Brigitte Lin Tony Leung Chiu-Wai Carina Lau Charlie Yeung Jacky Cheung Maggie Cheung","music_by":"Frankie Chan Roel A. Garcia","edited_by":"Hai Kit-wai Kwong Chi-leung William Chang Patrick Tam"}