{"based_on":"Ruidoso 1974 story in The New Yorker   by John McPhee","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Carol Sobieski","Plot":"Down on his luck Louisiana horse trainer Lloyd Bourdelle (Walter Matthau) dreams of winning the All American Futurity at Ruidoso Downs in New Mexico. Lloyd has three sons: Buddy, Randy, and Casey. Buddy (Andrew Rubin) helps his father train horses, while Randy (Steve Burns) is a jockey. Lloyd takes Casey (Michael Hershewe) and Randy to a small bush track, to try to make some money by racing Casey's pony, Gypsy. They find a match race with Mr. Marsh (Robert Webber) and his daughter Kelly (Susan Myers) but play a trick on Marsh by tying a live chicken to Gypsy's saddle. Gypsy wins the race, but Marsh doesn't pay up, complaining that Lloyd cheated him by not having a rider on Gypsy.Lloyd had sent Buddy to buy a racing Quarter Horse for Calvin LaBec (Harry Caesar) (the man Lloyd trains race horses for) in the hopes of racing the horse that year, but Buddy returns home with an old broodmare. Calvin is angry with Lloyd and threatens to take his horses out of Lloyd's barn, until it is revealed that the mare is in foal to a stallion called Sure Hit. Calvin is placated by this information.The mare gives birth to a colt and then dies, leaving the family wondering how to raise him. Casey suggests letting Gypsy nurse the colt. Gypsy had just weaned her own foal, so the family gives it a try and Gypsy accepts the colt. Casey feeds and raises the young colt, who grows into a strong two-year-old. Lloyd names the horse Casey's Shadow, after his son.A woman named Sarah Blue (Alexis Smith) goes to see the Bourdelle family, to offer Lloyd a large sum of money for the colt. They tell her they won't sell until after the All American, so Sarah agrees to pay $5,000 for an option contract, against a future negotiated purchase price, if she exercises the option. The option money gives them the money for entering the colt in the race. They take the horse to the local track to gallop him. While they are there, Casey runs into Mr. Marsh's daughter, who tells him he owes her five dollars. She goads Casey into having a match race for it, but during the race, Shadow spooks and runs onto hard asphalt, hurting his legs. The vet tells Lloyd and Buddy to rest the horse for six weeks. Calvin finds out the horse is injured but allows Lloyd to enter Shadow in the All American.Shadow runs in one of ten qualifying races for the All American, where he gets the fastest time in his race. Mr Marsh realizes that Shadow could beat his horse in the All American, sneaks into the barn where Shadow is stabled, and puts poison in the food bucket.But he has poisoned the wrong horse, and Gypsy slumps to the ground dead. The next day, Shadow wins the All American but is found afterwards to be severely lame. Sarah Blue is upset because she wanted to buy the colt sound and is no longer interested in the horse. Calvin LaBec at first agrees with the vet that the horse should be destroyed, but seeing how this would affect Casey, Lloyd says he'll give up his share of the winnings to treat the horse. Reluctantly, the vet agrees to try to mend Shadow's legs. The operation is a success, and Lloyd and his sons take Shadow home.","language":"English","Reception":"The movie was recived generally well overall. Getting a 75% on rotten tomatoes. It also got a 6/10 on IMDB.","cinematography":"John A. Alonzo","production_company":"Rastar","directed_by":"Martin Ritt","release_dates":"March 17, 1978 (1978-03-17)|||||","produced_by":"Ray Stark","starring":"Walter Matthau Alexis Smith Murray Hamilton","running_time":"117 minutes","music_by":"Patrick Williams","edited_by":"Sidney Levin"}