{"based_on":"Arch of Triumph  by Erich Maria Remarque","country":"United States","distributed_by":"United Artists","language":"English German","box_office":"$4,250,000[3] $1.7 million (US rentals)[4] $4,100,000 (total)[3]","Synopsis":"Pre-World War II Paris is crowded with illegal refugees, trying to evade deportation. One of them is Dr. Ravic (Charles Boyer), who under a false name practices medicine illegally, helping other refugees. He saves Joan Madou (Ingrid Bergman) from committing suicide after the sudden death of her lover. They become involved, but he is deported and she becomes the mistress of a wealthy man, Alex (Stephen Bekassy). All this time Ravic seeks revenge against the Nazi officer Haake (Charles Laughton), with war eventually declared between France and Germany.","Background and production":"The film's name is a reference to the Arc de Triomphe in Paris, where the film is set. The rough cut of the film was four hours long, and in reducing it to two hours several actors were cut. Irwin Shaw spent five months writing the screenplay, but quit when Lewis Milestone wanted him to add a love story. Milestone then rewrote the script himself together with Harry Brown. Ingrid Bergman's salary for the part was $175,000 + 25% of net profits.William Conrad, in just his fourth film, has a small important (uncredited) role, as a policeman.The MPAA's head of the Production Code Administration at the time, Joseph Breen, made the film's studio tone down the violence in the script. The scene where Ravic kills Haake also included him stuffing Haake in the car's trunk, stripping him naked, burying him and burning his clothes — this was cut from the film. Breen also objected to the murder going unpunished, but relented.The film was remade as a made-for-television film, Arch of Triumph, in 1985 with Anthony Hopkins as Dr. Ravic.","cinematography":"Russell Metty","production_company":"Enterprise Productions","directed_by":"Lewis Milestone","release_dates":"March 1948","produced_by":"David Lewis","starring":"Ingrid Bergman Charles Boyer Charles Laughton","running_time":"120 minutes 133 minutes (restored version)","arch_of_triumph":"Film poster","music_by":"Louis Gruenberg","edited_by":"Duncan Mansfield","written_by":"Lewis Milestone Harry Brown","budget":"USD 5,000,000[1][2]"}