{"Cast":"Tony Caunter, George A. Cooper and Peter Bennett, three prominent English actors, were cut out of the film following production. Timothy Dalton, 24 years old at the time, was offered the role by casting director Maude Spector, known for her work in Lawrence of Arabia.The final version of Cromwell at one stage was 180 minutes long, but it was cut down to 141 minutes, deleting a number of featured roles in the process including Felix Aylmer (in his final film) as an archbishop, and Bryan Pringle.","country":"United States United Kingdom","distributed_by":"Columbia Pictures","cromwell":"Theatrical poster by Howard Terpning","Plot":"Oliver Cromwell is a devout Puritan, a country squire, magistrate and former member of Parliament. King Charles I's policies, including the enclosing of common land for the use of wealthy landowners and the introduction of \"Popish\" and \"Romish\" rituals into the Church of England have become increasingly grating to many, including Cromwell. In fact Charles regards himself as a devout Anglican, permitting his French Queen to practise Roman Catholicism in private but forbidding her to bring up the young Prince of Wales in that faith. Cromwell plans to take his family to the New World, but, on the eve of their departure, he is persuaded by his friends to stay and resume a role in politics.Charles has unenthusiastically summoned Parliament for the first time in eleven years, as he needs money to fight wars against both the Scots and the Irish. Although to appease the Commons he reluctantly agrees to execute his hated adviser the Earl of Strafford, the Parliament of England will still not grant him his requests unless he agrees to reforms that could lead to a constitutional monarchy. Committed to the divine right of kings, and under pressure from his queen to stand firm, Charles refuses. When he attempts to arrest five members of Parliament (in reality Cromwell was not one of them), war breaks out in England itself, Parliament against the king, both sides convinced that God is on their side.When the Parliamentary forces in which Cromwell is a cavalry officer proved ineffective, he, along with Sir Thomas Fairfax, sets up the New Model Army and soon turns the tide against the king. The army's discipline, training and numbers secure victory and Cromwell's cavalry proves to be the deciding factor. With his army defeated, Charles goes so far as to call on help from Catholic nations, which disgusts his Protestant supporters. He is finally defeated but, a brave man in his own way, he still refuses to give in to the demands of Cromwell and his associates for a system of government in which Parliament will have as much say in the running of the country as the king.Cromwell—who has had to maintain discipline in the highly politicized New Model Army by hanging a ringleader of an incipient mutiny—later hears from Sir Edward Hyde, the king's once-loyal adviser, that Charles has secretly been raising a Catholic army to resume the war against Parliament. He and his supporters thus have Charles put on trial for treason. Charles, found guilty and sentenced to death, faces execution bravely and even his most ardent critics are moved by his dignity and the fact that he has forgiven his captors. There is little celebration or satisfaction over his death, even on Cromwell's part.However, Parliament soon proves itself just as useless in governing the country and, like the late king, Cromwell is forced to undertake a coup d'etat. But where Charles failed, Cromwell succeeds: his troops remove the MPs from the House of Commons, leaving Cromwell sitting symbolically alone in the Chamber as virtual dictator.The film ends with a voice-over stating that Cromwell served very successfully for five years as Lord Protector before Charles I's son, Charles II, returned as king of an England \"never to be the same again\".","language":"English","Reception":"The film received generally favourable reception, with praise for the performances of its two leads, production values and score.[citation needed]","cinematography":"Geoffrey Unsworth","production_company":"Columbia Pictures Irving Allen Productions","directed_by":"Ken Hughes","Historical points":"Although publicity for the film boasted that it had been made \"after ten years of research\", the film has been criticized[who?] for its historical inaccuracies. In its defense, George MacDonald Fraser has written, \"Inevitably there are historical queries all the way through, as there are bound to be in a picture which takes its subject seriously and tries to cover so much in less than two and a half hours. The main thrust of Cromwell is true, it gets a great deal of history, and the sense of history, right.\"[3] Costumes, locations (e.g., the layout of the then-House of Commons) and the appearance of actors were generally accurate but, as in many historical films - as much as for practical film making purposes as anything else - liberties were taken with the exact course of events.Towards the end of the film, the elder Oliver is seen at his son's gravestone which clearly shows the year of death as 1644.The incident is strongly reminiscent of Pride's Purge. In 1648, troops under Colonel Thomas Pride refused entry to those MPs who were deemed unsuitable. Lieutenant-General Cromwell was away at the time and it is unclear how much he knew of the purge in advance. The MPs left after Pride's Purge were known as the Rump Parliament.","release_dates":"16 July 1970 (1970-07-16)|||||","produced_by":"Irving Allen","starring":"Richard Harris Alec Guinness Robert Morley Nigel Stock Geoffrey Keen Michael Jayston","running_time":"139 minutes","music_by":"Frank Cordell","edited_by":"Bill Lenny","written_by":"Ken Hughes","budget":"$8 million[1]"}