{"mandarin":"Wàngjiǎo Kǎmén","Cast":"[4]","country":"Hong Kong","distributed_by":"Kino International","Plot":"The film centers around Wah (Lau), a mob enforcer who primarily deals with debt collection. His brother Fly (Jacky Cheung) also works for the mob, but is less successful and not as well respected as Wah, frequently causing trouble and borrowing money he can't pay back. Out of the blue, Wah receives a call from his aunt, informing him that his younger cousin Ngor (Maggie Cheung), whom he has never met before, will be coming to stay with him in Hong Kong for the next few days. Ngor works at her family's restaurant on Lantau Island, but due to a malfunctioning lung, must come to Hong Kong for a medical procedure.Soon after Ngor arrives at his apartment, Wah unexpectedly leaves to help Fly collect a debt. After the job, Wah goes to see his girlfriend, Mabel, who dumps him because he had been so distant and unresponsive to her calls. Due to this, she aborted his baby, though he was unaware she was pregnant in the first place. Wah stumbles home angry and drunk, but when Ngor tries to console him later that night, he becomes very aggressive and threatens to throw her out. The next morning, Wah apologizes to Ngor and offers to take her to out to a movie to make up for his behavior.Meanwhile, in order to make money to pay off a loan to fellow gang member Tony (Man), Fly makes an unreasonably high bet in a game of snooker. When he realizes there is no chance he can win or pay his debt, he makes a run for it with his friend Site (Wong). After a chase through the streets, Fly and Site are caught and severely beat by members of Tony's gang. As Wah and Ngor are about to leave the apartment, Fly arrives bruised and bloody, carrying an unconscious Site. Wah and Ngor treat their wounds, which causes Ngor to question Wah's line of work. The next day, she returns to Lantau, leaving Wah a note asking him to come visit her sometime.Wah meets with Tony to settle his debt with Fly. Tony says that if Fly wasn't his brother, he would already be dead. Unable to pay the debt interest, Wah steals the money from a friend of Tony instead. Insulted by Wah's behavior, Tony takes his grievance to Uncle Kwan, the mob boss. Kwan solves the argument by forcing Tony and Wah to accept a monthly payment compromise. Afterwards, Kwan tells Wah to get Fly under control before he gets himself killed. Accepting that Fly is not cut out for mob work, Wah gets him a legitimate job selling fish from a food cart. Fly hates his new job, but continues to work to please his brother. One day, Tony approaches Fly and insults him and his lowly profession. In retaliation, Fly wrecks Tony's car with a hammer and a propane bottle, but Tony's gang promptly catches him and beats him near to death.Meanwhile, Wah decides to visit Ngor. After arriving at her family's restaurant on Lantau, he learns that she was in Hong Kong for the day and will return that evening. Wah meets Ngor at the ferry terminal, but learns that she has begun seeing her doctor. They part ways and Wah, disheartened, boards the ferry back to Hong Kong. Realizing she made a mistake pushing him away, Ngor calls him asking to meet her back at the ferry terminal. Wah promptly returns to Lantau and they share a passionate kiss in a phone booth. Over the next couple of days, Wah helps out at the restaurant and the two continue to learn more about each other. Wah has to cut his visit short after receiving a call from Tony, who demands money in exchange for Fly's life.After arriving at Tony's place, Wah surprises Tony by pulling a gun and forcing the barrel down his pants, threatening to blow apart Tony's penis and testicles. Tony gives into Wah's demands and lets Fly go. The two brothers convene in a bar and make plans to leave town, but as they leave, they are cornered by Tony and his gang. Both Tony and Wah are severely beat by the gang, but Tony lets them live, exclaiming that they should leave the big city and return to the country. Fly leaves Wah, telling Wah to forget him because he has been a terrible brother. Too weak to pursue Fly, Wah manages to return to Lantau, where Ngor and her doctor treat his wounds. He recovers, and the two rekindle their love for each other.Back in Hong Kong, Uncle Kwan gives Tony a job to assassinate an informant while he is being transported to court by the police. Tony is too afraid to do it, since it is essentially a suicide mission. Fly offers to take the job, in order to earn the respect of the gang. Having received word that his brother has taken the job, Wah returns to confront his brother. His attempts to persuade his brother otherwise are in vain, and Fly manages to elude Wah while he is not looking. Wah arrives at the police station just as his brother is about to carry out the assassination. Fly pulls a gun and shoots the informant, but fails to kill him. Instead, he is shot and killed by the police. In response, Wah grabs his brother's gun and kills the informant, finishing the job. As Wah is gunned down, he thinks of his first kiss with Ngor.","language":"Cantonese","cantonese":"Wong6gok3 Kaa1mun4","box_office":"HK$11,532,283 (Hong Kong) $9,436 (United States)[1]","cinematography":"Andrew Lau","production_company":"In-Gear Films","directed_by":"Wong Kar-wai","traditional":"旺角卡門","simplified":"旺角卡门","release_dates":"9 June 1988 (1988-06-09)|||||","Box office":"During its initial Hong Kong theatrical run, As Tears Go By grossed HK$11,532,283. It remained as Wong Kar-wai's highest-grossing film in Hong Kong, and his only film to gross over HK$10 million, until the record was broken with the release of The Grandmaster in January 2013.","produced_by":"Alan Tang","starring":"Andy Lau Maggie Cheung Jacky Cheung","running_time":"102 minutes","music_by":"Danny Chung Teddy Robin","edited_by":"Cheung Pei-tak William Chang (uncredited)","written_by":"Jeffrey Lau Wong Kar-wai"}