{"country":"United States","distributed_by":"United Artists","city_of_ghosts":"A lobby card for the 2004 Thailand theatrical release.","Plot":"Jimmy (played by Matt Dillon) is a conman who's been working for a fake insurance company in New York City that is being investigated by the FBI after it cannot pay claims that have poured in after a hurricane. Discovering that his mentor and the mastermind of the scheme, Marvin (James Caan), has skipped the country and gone to Thailand, Jimmy boards a plane with the intention of trying to collect his money.Once in Bangkok, Jimmy meets Joseph Kaspar (Skarsgård), a partner in the scheme who's living with his Thai katoey companion Rocky (Kyoza). Joseph informs Jimmy that Marvin has moved on to Cambodia, where he's planning an even greater scam. So Jimmy sneaks across the border and makes his way to Phnom Penh.He checks into a seedy hotel run by a Frenchman named Emile (Gérard Depardieu) and has his passport stolen by another traveller. Later Jimmy has his sunglasses stolen by a macaque monkey.Needing to travel around, he hires a cyclo driver named Sok (Kem Sereyvuth), who becomes the only person Jimmy can trust. He also meets an NGO worker named Sophie (Natascha McElhone) and dabbles in romance with her while attending a rave party at an ancient temple.Eventually, Marvin turns up, but the scam he's trying to get together – involving corrupt Cambodian government officials, high-ranking military and the Russian mafia – turns out to be more risky and dangerous than anyone ever imagined, taking Jimmy on a surrealistic odyssey.","language":"English French Khmer Russian","cinematography":"Jim Denault","directed_by":"Matt Dillon","Soundtrack":"The soundtrack for City of Ghosts features an eclectic mix of music that includes 1970s Khmer rock and roll, French pop and American pre-WWII blues and jazz. The album contains the following tracks:In the film, James Caan performs the Khmer-language song \"Bong Sorlang\", but it is not on the soundtrack CD.","release_dates":"April 25, 2003 (2003-04-25)","produced_by":"Willi Baer Michael Cerenzie Deepak Nayar","starring":"Matt Dillon James Caan Stellan Skarsgård Natascha McElhone Gérard Depardieu","running_time":"116 minutes","music_by":"Tyler Bates","edited_by":"Howard E. Smith","written_by":"Matt Dillon Barry Gifford Mike Jones"}