{"country":"France","distributed_by":"Asmik Ace Entertainment Pathé Samuel Goldwyn Films","Plot":"A young woman on a train eyes a nervous man. In a flash, he is chased down the train and the young woman slices him in half. She is Saya (小夜; Jun Ji-hyun), a four-hundred-year-old skilled half human-half vampire samurai who hunts vampires. Raised by a man named Kato (Yasuaki Kurata), she works loosely with an organisation known as \"The Council\", a secret society that has been hunting vampires for centuries. Saya's motivation goes beyond duty; she wants revenge; Onigen (Koyuki), the oldest of the vampires, murdered her father. For her next mission, she goes undercover as a student at Kanto High School on an American air base near Tokyo, Japan.When she is introduced in her class, Saya's appearance quickly attracts the negative attention of a female classmate, Sharon (Masiela Lusha). The daughter of the base's general, Alice McKee (Allison Miller), is also bothered with the attention. At her school, she finds herself being mocked. Alice is asked by her Kendo instructor Powell (Colin Salmon) to stay for the Kendo practice due to her poor performance. As soon as the teacher leaves, she finds herself at the mercy of Sharon and her sidekick friend who wield sharp bladed katanas to taunt and torment her. An elaborate fight sequence ensues. Saya shows up just in time to stop Sharon from slashing Alice's throat. Despite Saya's effort to disguise her activity, Alice sees Sharon and her friend being butchered. However it is soon revealed that Sharon and her friend are vampires in disguise.Because \"The Council\" cleans up the bodies of the demons, Alice's father does not believe her story. Determined to make her own investigation, Alice goes to the bar where her Kendo instructor usually hangs out. To her horror her instructor, as well as the rest of the people in the bar, turn out to be vampires. Once again Saya comes to her rescue and has to fight off hordes of vampires surrounding them.General McKee (Larry Lamb) investigates \"The Council\", who disguise themselves as CIA. Alice arrives just in time to witness her father's death. Her dying father gives her Saya's address. With nowhere else to go, Alice decides to seek Saya's help. Fortunately Saya has never sworn loyalty to \"The Council\" and protects Alice instead. The two of them flee the area and go off to the mountains to find and slay Onigen.In their pursuit, Alice and Saya are run off the side of the road by an attacking demon and they fall into a ravine. When Alice and Saya awaken they are in Ancient Japan where Saya was raised. Onigen appears, reveals her true identity as Saya's mother, and fights Saya. Saya slays Onigen. Alice, who is injured during the fighting, wakes up to find herself at the wreckage of the truck and being carried into an ambulance. Later she is interviewed about the events surrounding her father's death, but her interviewer does not believe her story about the vampires or the Council. When asked about where Saya is, Alice answers that she is \"searching for a way back from the other side of the looking glass\".","language":"English","Reception":"The film grossed US$473,992 in Japan, and had a worldwide gross of US$5,731,143 worldwide.[12][13] On the opening weekend of its limited release to twenty theatres in the United States, the film grossed $103,000.[14]Cathy Rose A. Garcia of The Korea Times regarded Jun as being \"probably the only bright spot in this film\", criticising the \"convoluted plot... cheesy special effects and overacting from the supporting cast\". She dismissed much of the film's violence as \"gratuitous\" and noted that although the stunts were \"impressive\" they also lacked originality, while the climactic showdown showed an absence of \"any real excitement\".[15]The film received negative reviews from American critics.[16][17] Variety's Peter Debruge was critical of editor Marco Cave for \"reducing all but one of the fight scenes into a flurry of cuts\", and described the CG effects as \"herky-jerky\". Commenting on the direction, he said, \"Nahon privileges surface appeal and kinetic energy over narrative logic, and finesses the footage with an unpleasant yellow tinge that gives everything a vintage chopsocky feel\".[18] Felix Vasquez, Jr. of Cinema Crazed praised the film as \"blockbuster material\", finding the film's special effects to be \"top notch\" and Nahon's direction as \"often times beautiful as he convinces us successfully that we're watching a vampire period piece\". Conversely, he felt the film lacked a real story, focusing mostly on sword-fights, and that the character of Alice was \"dead weight\" and a token character added to avoid the film being completely Asian.[19]The Hollywood Reporter's Maggie Lee praised Jun's performance as Saya, feeling that she \"displays ample aptitude for being an action heroine, doing most of her own tendon-twisting martial arts stunts and looking utterly fetching in a sailor suit that could turn any guy into a uniform-fetishist\". However, she felt the direction and screenplay lacked \"freshness\" and \"nuance\", the special effects and choreography \"cool\" but unimpressive, and the ending predictable.[2] Roger Ebert rated the film three out of four stars, stating that it was \"surprisingly entertaining\" and a \"CGI fantasy\". He found the plot to be \"inconsequential\" to the action sequences. While he felt that Gianna was \"never really convincing as a martial artist\", he praised her for her \"sympathetic performance\" which he felt held the film together. As a whole, he found the movie to be \"sincere as an entertainment\" that \"looks good\" and is \"atmospheric\", and notes that he will be watching for Gianna in future films.[20] The film holds a 20% on Rotten Tomatoes.","box_office":"$5,874,530","cinematography":"Hang-Sang Poon","production_company":"Edko Pathé","directed_by":"Chris Nahon","release_dates":"29 May 2009 (2009-05-29)|||||","Production":"In May 2006, Bill Kong announced that he was producing a live-action film adaptation of Blood: The Last Vampire, directed by Ronny Yu. Like the source anime, it would be primarily filmed in English rather than Japanese.[1][2] Kong and Yu originally planned to finance the project themselves, but in November 2006, Production I.G officially consented to the film and began offering financial support.[3][4] Rather than being paid a straight license, Production I.G will receive a percentage of all revenues generated by the film.[4] Through ties to Manga Entertainment, the French company Pathé became the film's co-production company, joining the Hong Kong-based Edko.[2][4] Yu was retained as its producer, but Chris Nahon took over as the film's director.[5][6]South Korean actress Jun Ji-hyun, who adopted the English screen name Gianna Jun for the release, plays the role of Saya.[7]In early announcements, it was stated that the film would be set in 1948 at a United States Army camp in Tokyo, shortly after the conclusion of World War II during the American occupation of Japan.[3] During production, the film was shifted to be set in the 1970s instead (the original setting for the anime).Originally slated to be released worldwide in spring 2008,[4] the film premiered in Japan on 29 May 2009,[8] and was released in the United Kingdom on 26 June 2009.[9] Sony Pictures Worldwide Acquisitions Group licensed the film for release in North America, where it was released to theatres by Samuel Goldwyn Films on 10 July 2009.[10][11]","produced_by":"Ronny Yu","starring":"Jun Ji-hyun Allison Miller Masiela Lusha JJ Feild Koyuki Liam Cunningham","running_time":"91 minutes","blood:_the_last_vampire":"English-language theatrical poster","music_by":"Clint Mansell","edited_by":"Marco Cavé","written_by":"Chris Chow"}