{"based_on":"Coco & Igor by Chris Greenhalgh","country":"France","distributed_by":"Sony Pictures Classics USA","Plot":"An introductory scene takes place in Paris in 1913, where Coco Chanel attends the first, scandalous performance of Igor Stravinsky’s The Rite of Spring. The rhythmic dissonance of the score and the surprising choreography of the piece result in heckling and outrage among much of the audience. But Chanel is impressed by Stravinsky and his music.Seven years later, Chanel and Stravinsky meet again. Although her business has flourished, Chanel is mourning the death of her lover, Arthur \"Boy\" Capel. Stravinsky has chosen to flee to France following the Russian Revolution. An immediate sympathy and attraction occurs between the couturière and the composer.Chanel invites Stravinsky to live in her villa outside Paris, along with his ailing wife and their children. The summer months that follow see Chanel and Stravinsky begin an affair, one which Stravinsky's wife cannot avoid becoming aware of. Tensions between Stravinsky and his wife, and between Stravinsky's wife and Chanel, are unavoidable.The film implies that the affair, and the later termination of the affair by Chanel, has a major influence on the lives of both Chanel and Stravinsky. It is during this time that Chanel creates Chanel No. 5 with her perfumer, Ernest Beaux, and that Stravinsky begins to compose in a new, more liberated style. During his time at the villa, he works hard on a revision of The Rite of Spring. One of the last scenes of the movie shows the revival of the ballet, with new choreography, and this time, shows that it was an artistic triumph and recognized as a masterpiece.","language":"English French Russian","Reception":"Reviews were mixed. Stephen Holden of the New York Times said the film was “cool, elegant and sexy…. But the film … never regains that initial blast of energy and the final scenes wobble toward a wishy-washy ending.”[6] Writing for DVD Talk, Casey Burchby praises the \"extraordinarily bold\" opening sequence that recreates the Paris premiere of Stravinsky's The Rite of Spring.[7]","box_office":"$6.2 million[1]","cinematography":"David Ungaro","directed_by":"Jan Kounen","release_dates":"24 May 2009 (2009-05-24) (Cannes)|30 December 2009 (2009-12-30) (France)||||","produced_by":"Chris Bolzli Claudie OssardVeronika Zonabend","starring":"Anna Mouglalis Mads Mikkelsen","running_time":"118 minutes","music_by":"Gabriel Yared","edited_by":"Anne Danché","Historical context":"The riotous premiere of The Rite of Spring at the Théâtre des Champs-Élysées on 29 May 1913 is legendary (see: The Rite of Spring#Premiere).In the spring of 1920, Chanel was introduced to Stravinsky by Sergei Diaghilev, impresario of the Ballets Russes. During the summer, Chanel discovered that the Stravinsky family was seeking a place to live. She invited them to her new home, \"Bel Respiro,\" in the Paris suburb of Garches until they could find a more suitable residence. They arrived at \"Bel Respiro\" during the second week of September and remained until May 1921. Chanel also guaranteed the 1920 Ballets Russes production of The Rite of Spring against financial loss with an anonymous gift to Diaghilev, said to be 300,000 francs.[8]The personal relationships depicted in the film are largely fictionalized. Stravinsky was reputed to have been a philanderer who had several affairs, including one with Chanel. Whereas Stravinsky never publicly referred to this alleged affair, Chanel spoke about it at length to her biographer Paul Morand in 1946 (the conversation was published thirty years later as l'Allure de Chanel).[9] The accuracy of Chanel's claims has been disputed both by Stravinsky's second wife, Vera, and by his close musical collaborator, Robert Craft.[10] The Chanel fashion house avers there is no evidence that any affair between Chanel and Stravinsky ever occurred.[11]","written_by":"Carlo de Boutiny Jan Kounen","budget":"$12 million"}