{"country":"Australia United States","distributed_by":"Lionsgate","Plot":"In 2009, a plague caused by an infected vampire bat has transformed most of the world's population into vampires and due to this event, control of the world no longer belongs to humans. The vampires are incapable of aging or dying from natural causes, but are unprotected against sunlight or any ultraviolet light. The entire vampire world is active at night, and various technological and architecture advances are made to adjust the populated areas to vampires' night cycle (such as UV protective cars, underground railways and paths across the cities, and UV warnings).However, human numbers quickly dwindle, and the need for blood becomes desperate. When deprived of blood for extended periods, vampires degenerate into \"subsiders,\" psychotic bat-like creatures who lose their memories and independent thought and are left with the basic need for blood. Humans are captured and harvested in laboratory farms while scientists research a synthetic blood substitute to satisfy vampires' blood hunger across the world, while animal blood is also widely used.In 2019, Edward Dalton (Ethan Hawke) is the head hematologist for the pharmaceutical company Bromley Marks, the largest supplier of human blood in the United States. Along with fellow hematologist Christopher Caruso (Vince Colosimo), Dalton is in the process of developing a substitute to bolster dwindling blood supplies and to create a substance that can replace blood and be generated as required. The need is underscored after Dalton's boss, company owner Charles Bromley (Sam Neill), reveals that the estimated human population is down to 5%, and national blood supplies will not last more than a month. Faced with this knowledge, Edward and Chris carry out a hasty clinical trial of the latest revision on a volunteering soldier, which is a spectacularly gruesome failure when the soldier explodes from a painful side-effect.On the drive home, Dalton becomes momentarily distracted when he both lights a cigarette and notices that his ears have become pointed (first sign of becoming a subsider) and accidentally runs another vehicle off the road. When he checks on the occupants of the other vehicle, he is shot in the arm by a crossbow shot, and quickly discovers they are humans. With police approaching, Dalton convinces the humans to hide in his vehicle and tells the police that the occupants of the other vehicle fled. The humans then leave, but not before their leader, Audrey (Claudia Karvan), learns Edward's name and occupation from the ID badge on his jacket.At home, Edward is surprised by his estranged brother Frankie (Michael Dorman), a soldier in the human-hunting Vampire Army who has returned for Edward's 35th birthday (which he celebrates for the tenth time). Frankie's gift of a bottle of pure human blood re-ignites a long-standing argument over Edward's sympathies towards humans, his refusal to drink human blood (he drinks animal blood instead), and his resentment towards Frankie for turning him into a vampire. The argument is cut short when a subsider invades Edward's house, forcing the brothers to team up and kill it. During the subsequent police investigation of the subside attack at Edward's home, it's determined that the subsider was Edward's former local gardener whom Edward had seen only two weeks earlier.The following morning, Audrey arrives at Edward's home, giving him a note with instructions for a meet before departing. Dalton goes to the meeting location during the day in his UV-protected Chrysler 300C and hides in the shade of a tree to meet with the humans.He is introduced to Lionel \"Elvis\" Cormac (Willem Dafoe), another human, but an Army SUV arrives with Frankie, who followed Edward and intends to capture both Cormac and Audrey. Audrey knocks Frankie unconscious and the three flee from approaching soldiers in Edward's car (since Cormac's orange 1965 Ford Mustang is destroyed with bullets). Once they escape, Cormac drives to the edge of a river, where he reveals that he was once a vampire and a professional mechanic, and one of the pioneers in creating UV protection covers for windows and cameras. He was cured when a car crash ejected him from his sun-proof vehicle into the river during daylight hours: Elvis burst into flame in the sunlight, but his life was saved when he landed in the river, having been exposed to the sun for the precise length of time required to turn him human again. Dalton agrees to help Elvis find a way to recreate the cure safely.That night, Ed arrives with Elvis and Audrey at an old vineyard. Ed meets with the other human survivors, as well as Senator Turner (Jay Laga'aia), a vampire who is secretly helping the colony to find a cure. While a convoy of humans is heading to Audrey's group, they are ambushed by vampire soldiers, and captured. One soldier finds a radio and the soldiers track the position of the vineyard, forcing Turner and the humans there to flee. Audrey, Elvis, and Ed stay behind, so Ed can be turned back. After some experimentation, Edward is able to reverse the vampire effect, curing himself, and feels sunlight for the first time in a decade. They depart in Cormac's 1978 Pontiac Trans Am and attempt to regroup with Turner and the other humans, only to discover that they've all been killed.One of the captured convoy inhabitants is Alison (Isabel Lucas), who wakes up in Charles's office. She is revealed to be his daughter, who fled after the outbreak of the plague, not accepting her father as a vampire. Charles, wanting to have his daughter back, has Frankie forcibly turn her. She refuses to drink human blood, feeding on her own instead — and thus turns into a subsider. She is rounded up with a group of other subsiders in a chain gang and dragged into sunlight to burn to death. Witnessing Alison's death upsets and inspires Frankie, causing him to seek out his brother. Meanwhile, Bromley Marks has exhausted their reserves of blood, and the army arrives in the cities, destroying subsiders and vampires in poverty to control the population.Edward, Elvis, and Audrey break into Chris's home and ask him to help spread the cure. However, Chris has finally discovered a viable blood substitute and does not want there to be a cure, since the substitute will make him rich and powerful. He admits that he always hated Edward and being in his shadow and now wants to take his place. He calls in vampire soldiers, who capture Audrey while Elvis and Edward escape. They are found by Frankie, who agrees to help but is gradually becoming a subsider. He attacks Elvis, but drinking his blood turns Frankie into a human again, and they discover that feeding on a former vampire is another method for vampires to turn back to humans.Edward, trying to save Audrey, turns himself in. Charles reveals that he is not interested in the cure. When he was human, he suffered from incurable cancer, and after he became a vampire, he turned Bromley Marks into a powerful company. He admits that he likes being immortal and that he will use the substitute world-wide to create a monopoly over the market, and that remaining human blood will become very expensive, since \"there are always those who are willing to pay a little extra for the real thing\". Edward berates Charles for making Frankie turn Alison instead of doing it himself. An angered Charles bites Edward, but he shifts back into a human.Edward leaves the now human Charles at the mercy of his former soldiers (nearly all of whom are on the verge of becoming subsiders), which results in Charles being torn apart. Edward and Audrey, cornered by more soldiers, are rescued when Frankie sacrifices himself. This sparks a feeding frenzy that leaves all of the soldiers dead or cured. They are confronted by Chris, who kills the few remaining cured soldiers to hide the evidence of the cure. Just as Chris points his gun at Edward and Audrey, Elvis arrives and kills Chris with a crossbow. Edward looks sadly to his dead brother, and Audrey, Edward and Elvis turn back and watch the sun rise on the city.The three survivors then drive away in Elvis's Pontiac in the horizon, with a voice-over by Edward stating that they have a cure and can change others back. However, a subsider flies across the horizon, indicating it may in fact be too late after all.","language":"English","box_office":"$51.4 million[2]","cinematography":"Ben Nott","production_company":"Lionsgate Screen Australia Pictures in Paradise Film Finance Corporation Australia Pacific Film & Television Commission Furst Films","directed_by":"Michael Spierig Peter Spierig","release_dates":"11 September 2009 (2009-09-11) (TIFF)|8 January 2010 (2010-01-08) (United States)|4 February 2010 (2010-02-04) (Australia)|||","Production":"In November 2004, Lionsgate acquired the script to Daybreakers, written by Peter and Michael Spierig. The brothers, who directed Undead (2003), were attached to direct Daybreakers.[3] In September 2006, the brothers received financing from Film Finance Corporation Australia, with production set to take place in Queensland.[4] In May 2007, actor Ethan Hawke was cast into the lead role.[5] Later in the month, actor Sam Neill joined the cast as the main antagonist. Daybreakers began filming on the Gold Coast at Warner Bros. Movie World studios and in Brisbane on 16 July 2007.[6] The production budget was $US21 million, with the State Government contributing $US1 million to the filmmakers.[7] Principal photography was completed on schedule in September 2007, with reshoots following to extend key sequences.[8]Weta Workshop created the creature effects for Daybreakers.[5] The Spierig brothers wanted the vampires in the film to have a classical aesthetic to them while feeling like a more contemporary interpretation. After experimenting with complex makeup designs, they decided that a more minimalistic approach to makeup had a more powerful effect.[9]Hawke was initially hesitant to join the production as he was \"not a big fan\" of genre films. He ultimately accepted the role as Edward after deciding the story felt \"different\" to that of a typical B movie.[9] Hawke described the film as an allegory of man's pacing with natural resources, \"We're eating our own resources so people are trying to come up with blood substitutes, trying to get us off of foreign humans.\"[10] The actor also said that despite the serious allegory, the film was \"low art\" and \"completely unpretentious and silly\".[10]","produced_by":"Chris Brown Sean Furst Bryan Furst","starring":"Ethan Hawke Willem Dafoe Claudia Karvan Michael Dorman Sam Neill Vince Colosimo Isabel Lucas","running_time":"98 minutes","daybreakers":"Theatrical release poster","music_by":"Christopher Gordon","edited_by":"Matt Villa","Release":"Daybreakers premiered on 11 September 2009 at the 34th Annual Toronto International Film Festival. The film was released on 6 January 2010 in the UK and Ireland, 8 January 2010 in North America, and 4 February 2010 in Australia.The film currently holds a 67% \"fresh\" rating on Rotten Tomatoes based on 141 reviews, with the site's consensus reading: \"Though it arrives during an unfortunate glut of vampire movies, Daybreakers offers enough dark sci-fi thrills -- and enough of a unique twist on the genre -- to satisfy filmgoers.\" [11] As well as a weighted average score of 57 out of 100 on Metacritic (indicating \"mixed or average reviews\") based on 31 reviews.[12]Variety gave the film a mixed to positive review stating the film had a \"cold, steely blue, black and gray 'Matrix'-y look\" going on to say Daybreakers \"emerges as a competent but routine chase thriller that lacks attention-getting dialogue, unique characters or memorable setpieces that might make it a genre keeper rather than a polished time-filler.\"[13] Rolling Stone gave the film two and a half out of four stars and called the film a B movie and a \"nifty genre piece\".[14] Roger Ebert also gave the film two and a half stars stating the \"intriguing premise ... ends as so many movies do these days, with fierce fights and bloodshed.\"[15] Richard Roeper gave the film a B+ and called it \"a bloody good time.\"[16]As of October 2010, the box gross was US$51,416,464.[1] In its opening weekend in the United States, Daybreakers opened at #4 behind Avatar, Sherlock Holmes and Alvin and the Chipmunks: The Squeakquel with $15,146,692 in 2,523 theaters, averaging $6,003 per theater.[17]Daybreakers was released on DVD and Blu-ray in the United States on 11 May 2010 and in the United Kingdom on 31 May 2010.[18] The UK DVD copy was rated as an 18 instead of the original 15 rating that was used for cinema release. A 3D Blu-ray version of the film was released in November 2011.[dated info][19]","written_by":"Peter Spierig Michael Spierig","budget":"$20 million[1]"}