{"based_on":"Characters  by Wes Craven Bruce Wagner","country":"United States","Music videos":"With the popularity of the Nightmare on Elm Street series, many songs on the soundtrack had music videos:","distributed_by":"New Line Cinema","screenplay_by":"Brian Helgeland|Scott Pierce|","story_by":"William Kotzwinkle|Brian Helgeland|","Plot":"Some time has passed since the events of the previous film, Kristen, Kincaid and Joey have been released from Westin Hills and are living lives as normal teenagers. When Kristen, believing Freddy is coming back, summons Joey and Kincaid into her dreams, she angers them and they warn her that dreaming of Freddy might actually cause his return. The next day, Kristen picks up her boyfriend, martial arts enthusiast Rick Johnson, and his sister and Kristen's best friend, Alice. Going to school she meets with her other friends: Sheila, a genius and asthmatic; and Debbie, a tough girl who doesn't like bugs. Alice daydreams that her crush Dan Jordan recognizes her, but she snaps out of it when Rick teasingly offers to introduce them.That night, Kristen stays awake to keep from dreaming, but Kincaid falls asleep and awakens in a junkyard where his dog Jason innocently resurrects Freddy from his grave. Trapped, Kincaid tries to fight off Freddy with his strength, but Freddy rebounds and kills him. He tricks Joey into thinking a model is swimming in his waterbed, but Freddy attacks him, drowning out his dream power and stabbing him for his mother to find the next morning. At school, Kristen panics when she notices Joey and Kincaid are missing and is knocked out. She is nearly attacked by Freddy when the school nurse wakes her up. Kristen tells Rick, Alice, and Dan about Freddy's legacy before her mother Elaine shoos the three of them away from the run down Krueger house. At dinner, Kristen notices her mother had slipped her sleeping pills, and she falls asleep before calling Alice. Taking her advice on dreaming, Kristen tries to dream of someplace fun, but Freddy invades and forces Kristen back to his home. Being the last of the Elm Street children, Freddy goads Kristen into calling on one of her friends, so that his fun can begin anew. She calls Alice into her dream, and Freddy kills Kristen by throwing her into his boiler. Waking up and sensing something wrong, Alice takes Rick to Kristen's house, only to see her burning to death in her bedroom.Later, Alice falls asleep during class and inadvertently brings Sheila into her dream. Freddy sucks the air from Sheila's lungs, making it look like an asthma attack. Rick starts to believe her, but the following day he has a martial arts inspired dream and is killed when Freddy cheats in one-on-one combat. With each death, Alice begins to change, gaining the abilities and personalities of her lost friends. She plans with Debbie and Dan to fight and kill Freddy together, but when her father, Dennis, keeps her in, Alice falls asleep and lives her worst fear that she will work as a waitress into her old age. Freddy forces Alice to give her another soul, and he goes after Debbie. Keeping Alice and Dan in a time loop, he stalks Debbie, transforms her into a cockroach, and crushes her in a roach motel. With Debbie's temper, Alice tries to ram Freddy but collides with a tree in reality. As Dan is rushed into surgery, Alice returns home and readies herself to join him and face Freddy.Alice rescues Dan, and the two are sent flying into an old church in their dream. Dan's injuries in the dream prompt his surgeons to wake him up, leaving Alice alone to face Freddy. He has the upperhand due to his experience, but she proves resilient, using her friends' dream powers against him. When he is about to be victorious, she remembers a nursery rhyme called \"The Dream Master\" and forces Freddy to face his own reflection, causing the souls within him to revolt. The strain tears Freddy apart, releasing all of Alice's friends' spirits and leaving him a hollow husk. Months later, Dan and Alice have begun dating, and as they approach a fountain, Dan tosses a coin in. For a moment, Alice sees Freddy's reflection in the water, but she ignores it. Dan asks her what she wished for, but Alice does not tell him.","language":"English","Reception":"Released on August 19, 1988, on 1,765 theatres in North America, on the first weekend, the film ranked No.1 grossing $12,883,403;[2] this was the highest opening of the franchise until the release of Freddy vs. Jason.[3] On the second weekend, the film still ranked No.1, grossing $6,989,358. It also sat the first place on the third weekend, then sets No.2, No.4 and No.6 in the next three weeks, until it finally dropped out from the Top 10 list as No.11 on the seventh weekend. The film eventually grossed $49,369,899 at the US box office, making it the 19th highest grossing film of 1988,[2] and the highest grossing Nightmare on Elm Street film until Freddy vs. Jason's release in 2003. It is currently the third highest grossing Nightmare on Elm Street film.[3]The film's distribution rights were transferred to Warner Bros. in 2008.The review aggregator website Rotten Tomatoes reports a 56% approval rating and an average rating of 5.2/10 based on 27 reviews.[4] Robert Englund received a Saturn Award nomination for Best Supporting Actor.[citation needed]In an interview posted on Nightmare on Elm Street Companion, Lisa Wilcox gave the film a positive review: \"...It had a great story, funny Freddy lines, not too gruesome and a cast that worked really well together.\" Wes Craven, the creator of the franchise and the director of the first film, also give the film a positive comment in the documentary Never Sleep Again: The Elm Street Legacy; he says, \"...I think Renny Harlin is a gifted director, he did so much that the other directors cannot do...\"","box_office":"$49.3 million[1]","cinematography":"Steven Fierberg","production_company":"Heron Communications Smart Egg Pictures","directed_by":"Renny Harlin","a_nightmare_on_elm_street_4:_the_dream_master":"Theatrical release poster","Music":"The music score was composed by Craig Safan.Soundtrack:Additional tracks (credited and played during movie but not on official soundtrack):","release_dates":"August 19, 1988 (1988-08-19)|||||","produced_by":"Robert Shaye|Rachel Talalay|","starring":"Robert Englund","running_time":"93 minutes","music_by":"John Easdale|Craig Safan|","edited_by":"Michael N. Knue|Jack Turner|Chuck Weiss|","budget":"$13 million[1]"}