{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"The film tells the story of Captain EO (Michael Jackson) and the ragtag crew of his spaceship on a mission to deliver a gift to \"The Supreme Leader\" (Anjelica Huston), who lives on a world of rotting, twisted metal and steaming vents. Captain EO's alien crew consists of his small flying sidekick Fuzzball, the double-headed navigator and pilot Idey (Debbie Lee Carrington) and Ody (Cindy Sorenson), robotic security officer Major Domo (Gary Depew), a small robot, Minor Domo (who fits like a module into Major Domo), and the clumsy elephant-like shipmate Hooter (Tony Cox) who always manages to upset the crew's missions. Dick Shawn plays Captain EO's boss, Commander Bog.Upon arriving on the planet, the crew is captured by the henchmen of the Supreme Leader, and brought before her. She sentences the crew to be turned into trash cans, and Captain EO to 100 years of torture in her deepest dungeon. Before being sent away, Captain EO tells the Supreme Leader that he sees the beauty hidden within her, and that he brings her the key to unlock it: his song, \"We Are Here to Change the World\".The two robot members of the crew transform into musical instruments, and the crew members begin to play the various instruments. As Hooter runs toward his instrument, he trips over EO's cape and breaks it, stopping the music. The spell broken, the Supreme Leader orders her guards to capture Captain EO and his crew.Hooter manages to repair his instrument and sends out a blast of music, providing EO with the power to throw off the guards. He uses his power to transform the dark hulking guards into agile dancers who fall into step behind him for a dance number. As EO presses forward toward the Supreme Leader, she unleashes her Whip Warriors, two cybernetic defenders each with a whip and shield that can deflect EO's power.The others all run away, leaving Captain EO to fight the Whip Warriors alone. EO is trapped by a closing gate and is preparing for a last stand as both the whip warriors draw their whips back for a final blow. Fuzzball drops his instrument and speedily flies over to tie the two whips together, causing the Whip Warriors to be thrown off balance and giving EO an opportunity to transform them as well. With no further obstacles, EO uses his power to transform the remaining four henchmen (not yet unleashed) and they, the transformed whip warriors and the other dancers, press forward in dance before EO transforms the Supreme Leader into a beautiful woman, her lair into a peaceful Greek temple, and the planet into a verdant paradise.A celebration breaks out to \"Another Part of Me\", as Captain EO and his crew triumphantly exit and fly off into space.Captain EO made full use of its 3D effects. The action on the screen extended into the audience, including asteroids, lasers, laser impacts, smoke effects, and starfields that filled the theater. These effects resulted in the seventeen-minute film costing an estimated $30 million to produce.[6] At the time, it was the most expensive film ever produced on a per-minute basis, averaging out at $1.76 million per minute.[7]The 2010 version did not include the in-theater laser and starfield effects. It did utilize hydraulics previously used for Honey, I Shrunk the Audience! to make the seats shake along with Captain EO's spaceship, as well as LED flood-lighting which was new to the theater. They were also used for the bass-heavy musical numbers. The seats also bounced to the beat of Jackson's song. Honey, I Shrunk the Audience!'s seat-back misters were employed when Hooter sneezed. The leg ticklers from Honey, I Shrunk the Audience were also reused.The show's orchestral score was composed by James Horner, while the area and pre-show music was written by Richard Bellis.Two new songs appeared in the film. The first was an early mix of \"Another Part of Me\". The song was re-mixed and later appeared on Jackson's hugely successful Bad album. It was released as a single in 1988.\"We Are Here to Change the World\" was not officially released until 2004 as part of Michael Jackson: The Ultimate Collection. However, this version was a shorter edit of the full-length song. Soul/R&B singer Deniece Williams covered the song on her As Good As It Gets album in 1988.[8]","captain_eo":"Film poster","language":"English","Merchandising":"Concurrent with the opening of the attraction, a behind-the-scenes documentary special titled Captain EO: Backstage was produced for television by MKD Productions. The piece was directed by Muffett Kaufman and was hosted by Whoopi Goldberg. It featured interviews with the cast, writers and director.[9]The story was adapted with art by Tom Yeates in the comic book Eclipse 3D Special #18 and issued in two formats: regular sized for distribution to the national network of comic book stores and tabloid sized sold at Disneyland as a souvenir. Toys available included plush versions of Idey and Ody, Hooter, and the \"Fuzzball\" character. Other merchandise included trading cards, pins, keychains, a T-shirt of the film's logo, and a glow-in-the-dark T-shirt with the same three-color pattern painted across it that Captain EO wore in the film.","cinematography":"Peter Anderson","production_company":"Lucasfilm Walt Disney Pictures","directed_by":"Francis Coppola","Reception and legacy":"Several years after the attraction originally opened, it made its only network television appearance on MTV, albeit in a down-converted 2-D version. It has not aired again since, nor has it officially been issued on home video, although bootleg videos exist.After the death of Michael Jackson on June 25, 2009, Captain EO regained popularity on the Internet. For several years, a small group of fans had petitioned Disney to bring back the attraction and Jackson's death had brought this campaign to a peak.[10] Soon afterward, Disney officials were seen in Disneyland at the Magic Eye Theater and reportedly held a private screening of Captain EO to determine if it could be shown again. On September 10, Disney CEO Bob Iger said, \"There aren’t plans to bring back Captain EO at this time ... We are looking at it. It’s the kind of thing that, if we did it, would get a fair amount of attention and we’d want to make sure we do it right.\"[11]On December 18, 2009, Disney announced that Captain EO would return to Tomorrowland at Disneyland beginning in February 2010. Social and Print Media Manager Heather Hust Rivera from Disneyland Resort confirmed this on the DisneyParks Blog and stated that Honey, I Shrunk the Audience! would be closing. That attraction hosted its final public showing in the Magic Eye Theater at midnight on January 4, 2010 to make way for the Michael Jackson film's return.The attraction re-opened at Disneyland on February 23, 2010.[12] The attraction returned to Discoveryland at Disneyland Park (Paris) on June 12, 2010, returned to Epcot at Walt Disney World on July 2,[13] and to Tokyo Disneyland on July 1. At Epcot, the film had a \"soft opening\" (actual opening to the public prior to the official opening) on June 30, 2010, two days prior to its official re-opening.The attraction was billed as \"Captain EO Tribute\" to distinguish the presentation of the film from its original 1986–1997 run. The new presentation made use of existing in-theatre special effects held over from Honey, I Shrunk the Audience!, but many of the original \"4-D\" effects such as the enormous fiber-optic \"starfield\" wall along with smoke and lasers were removed from the building at the show's first closing, and were not returned for the revived presentation.[14] The removed special effects from the original presentation are also missing in the Epcot, Tokyo Disneyland, and Disneyland Paris revivals that followed.On December 19, 2013, Tokyo Disneyland announced it would be closing Captain EO on June 30, 2014, to make way for Stitch Encounter in spring 2015.[15]Beginning July 4, 2014, the Magic Eye Theater at Disneyland was used to present a sneak peek of Marvel Studios' Guardians of the Galaxy. Although Captain EO was expected to return to the venue at a later date, beginning September 26, 2014 the theater was used to present a sneak peek of Walt Disney Animation Studios' Big Hero 6.[16][17] Beginning mid-April 2015, the venue presented a sneak peek of Walt Disney Pictures' Tomorrowland. The venue was renamed the Tomorrowland Theater.[18] Beginning November 16, 2015, the theater has been used to present scenes from the Star Wars films as part of the park's \"Season of the Force\" event.[19]On November 13, 2015, Disney announced that Captain EO would be closing at Epcot on December 6, 2015 to make way for a \"Disney & Pixar Short Film Festival\".[1]","release_dates":"September 12, 1986 (1986-09-12) (Florida)|||||","produced_by":"Rusty Lemorande|George Lucas (executive producer)|","starring":"Michael Jackson|Anjelica Huston|Dick Shawn|Tony Cox|Debbie Lee Carrington|Cindy Sorenson|Gary DePew|","running_time":"17 minutes","music_by":"James Horner","written_by":"George Lucas|Rusty Lemorande|Francis Coppola|","budget":"$23,700,000[nb 1]"}