{"country":"United States","distributed_by":"Turtle Releasing (US) Miracle Films (UK)","Plot":"The story takes place on a Saturday in Anderson, a crime-infested ghetto in South Central Los Angeles. Members of a local gang known as 'Street Thunder' have recently stolen a large number of assault rifles and pistols. The film begins at 3 a.m. that morning, as a team of heavily-armed LAPD officers ambush and kill six members of the gang. Later, the gang's four warlords swear a blood oath of revenge, known as a \"Cholo\", against the police and the citizens of Los Angeles.During the day, three sequences of events occur parallel to one another: First, Lieutenant Ethan Bishop (Austin Stoker), a newly promoted CHP officer, is assigned to take charge of the decommissioned Anderson police precinct during the last few hours before it is permanently closed. The station is manned by a skeleton staff composed of Sergeant Chaney (Henry Brandon) and the station's two secretaries, Leigh (Laurie Zimmer) and Julie (Nancy Loomis).Across town, two of the Street Thunder warlords, along with two other gang members, drive around the neighborhood looking for people to kill. One of the warlords shoots and kills a little girl (Kim Richards) and the driver of an ice-cream truck. The girl's father, Lawson (Martin West), pursues and kills the warlord, upon which the other gang members chase him into the Anderson precinct. In shock, Lawson is unable to communicate to Bishop or Chaney what has happened to him.Just before this, a prison bus commanded by Starker (Charles Cyphers) stops at the station to find medical help for one of three prisoners being transported to the state prison. The prisoners are Napoleon Wilson (Darwin Joston), a convicted killer on his way to Death Row, Wells (Tony Burton), and Caudell, who is sick. As the prisoners are put into cells, the telephone lines go dead, and when Starker prepares to put the prisoners back on the bus, the gang opens fire on the precinct, using weapons fitted with silencers. In seconds, they kill Chaney, the bus driver, Caudell, Starker, and the two officers along with Starker. Bishop unchains Wilson from Starker's body and puts Wilson and Wells back into the cells.When the gang members cut the station's electricity and begin a second wave of shooting, Bishop sends Leigh to release Wells and Wilson, and they help Bishop and Leigh repel an attempted invasion, though Julie is killed in the firefight. Wells is chosen to sneak out of the precinct through the sewer line and hotwire a car, but is killed by a gang member hiding in the backseat.Meanwhile, the gang members remove all evidence of the skirmish in order to avoid attracting outside attention. Bishop hopes that someone has heard the un-silenced police weapons firing, but the neighborhood is too sparsely populated for nearby residents to pinpoint the location of the noise.As the gang rallies for an all-out final assault, Wilson, Leigh, and Bishop retreat to the basement, taking the still-catatonic Lawson with them. The gang then storms the building and rush the survivors. Bishop shoots a tank full of acetylene gas, which explodes violently, killing all the gang members in the basement.Finally, two police officers in a cruiser radio for backup after discovering the dead body of a telephone repairman hanging from a pole near the police station. When more police officers arrive and secure the station, the surviving gang members retreat. Venturing down into the basement, the police officers find dozens of badly burned and killed gang members strewn about the hallway. The only survivors are Bishop, Leigh, Wilson, and the comatose Lawson. As the others leave another officer tries to cuff Wilson whom Bishop waves off but ignores the order. Bishop angrily stops him and asks Wilson to walk out of the station with him rather than be led away in chains.","Home video releases":"Assault was released on VHS by Media Home Entertainment in 1978[75] and on laserdisc by Image Entertainment on March 12, 1997.[76] The '97 laserdisc came with commentary by John Carpenter, an isolated music score track and the original theatrical trailer.[76]The film was one of the first films to be released on the DVD medium on November 25, 1997, also by Image Entertainment.[77][78] On March 11, 2003, Image Entertainment released in new widescreen \"Special Edition\" DVD of the film.[79] Dalton Ross of Entertainment Weekly gave this 2003 DVD release a B+.[48] Brian Lindsay of Eccentric Cinema gave the film's 2003 DVD release a 10 out of 10, the website's highest rating.[51] Special features of the 2003 DVD release[51][77] include:The film was later released on UMD video for the PlayStation Portable in July 26, 2005[80] and in a \"Restored Collector's Edition\" for both DVD and Blu-ray Disc in 2008 and 2009, respectively. Both releases have all of the special features found on the 2003 \"Special Edition\" DVD.[81][82]","language":"English","Reception":"Assault was first released in Los Angeles at the State Theater on November 10, 1976 to mixed reviews and unimpressive box office earnings.[14][35] Whitney Wiliams of Variety wrote, \"Some exciting action in the second half packs enough interest to keep this entry alive for the violence market... John Carpenter's direction of his screenplay, after a pokey opening half, is responsible for the realistic movement.\"[15] Dan O'Bannon, Carpenter's co-writer on Dark Star, attended the Los Angeles premiere. At this point in their professional relationship, O'Bannon was jealous of Carpenter's success and reluctantly attended the premiere. O'Bannon was disgusted by the film and told Carpenter so. According to author Jason Zinoman, O'Bannon saw a reflection of the coolness that Carpenter displayed toward him in the film's casual disregard for the humanity of its characters. It reminded him of how easily their friendship had been discarded. \"His disdain for human beings would be serviced if he could make a film without people in it,\" replied O'Bannon.[36]The film opened at the Cannes Film Festival on May 1977 where it received favorable notices from some of the British critics.[14] \"Carpenter at Cannes wiped us off the face of the earth with Precinct 13\" replied director George A. Romero, who was at the festival with his film Martin. \"Right from the scene when the little girl gets blown away, I was blown away.\"[31] As a result, Linda Myles booked the film for the Edinburgh Film Festival in August 1977.[14] However, it wasn't until the film was screened at the 21st London Film Festival on December 1, 1977 that the film got critical acclaim.[5]:153[37] Ken Wlaschin, festival director,[38] described the film in the brochure:\"John Carpenter, whose small-budget science-fiction epic Dark Star was widely acclaimed, has turned his inventive imagination to the thriller for his first solo directional effort. The result, even without taking into consideration his tiny budget and cast of unknowns is astonishing. Assault on Precinct 13 is one of the most powerful and exciting crime thrillers from a new director in a long time. It grabs hold of the audience and simply doesn't let go as it builds to a crescendo of irrational violence that reflects only too well our fears of unmotivated attack... It is a frightening look at the crumbling of rational ideas of law and order under an irresistible attack by the forces of irrationality and death.\"[37]Wlaschin found Assault to be the best film of the London Film Festival and included it in his \"Action Cinema\" section of that festival.[14][37] It became one of the festival's best-received films, garnering tremendous critical and popular acclaim.[5]:156 According to Derek Malcolm of the Guardian, the applause was \"deafening\".[35] Carpenter was delighted by the new praise.[14]The overwhelmingly positive British response to the film led to its critical and commercial success throughout Europe. Derek Malcolm of Cosmopolitan wrote, \"[The film] is fast becoming one of the cult movies of the year ... The great virtue of the film is the way it grabs hold of its audience and simply refuses to let go. It exploits all our fears of irrational violence and unmotivated attack, and at the same time manages to laugh at itself without spoiling the tension - a very considerable feat. Carpenter, who is clearly a director with places to go, has succeeded in making a comedy that scares the pants off us. And don't think you're laughing at it. As a matter of fact, it's laughing at you.\"[39][a 4] Malcolm later wrote that he held some reservations about the film: \"I don't feel like going on and on about the movie, partly because I think it is in grave danger of being oversold anyway, and partly because it isn't much more to me than tremendous fun\".[35] The film broke one house record in the UK and was named one of the best films of the year by critics and moviegoers.[5]:162Subsequently, the film underwent reassessment by American critics and audiences, and it is now generally considered one of the best action films of the 1970s. When playing at the Chicago International Film Festival in 1978, the film was described in the program notes as, \"...a nightmarish poem which plays on our fears of irrational and uncontrolled violence.\"[40] Carpenter has said that the British audiences immediately understood and enjoyed the film's similarities to American westerns, whereas American audiences were too familiar with the western genre to fully appreciate the movie at first.[9][14][16]\"Lean, taut and compellingly gritty, John Carpenter's loose update of Rio Bravo ranks as a cult action classic and one of the filmmaker's best.\"Over the years, Assault has received acclaim from critics, emphasizing John Carpenter's resourceful abilities as director, writer, editor and music composer, Douglas Knapp's stylish cinematography as well as exceptional acting from Austin Stoker, Darwin Joston, Laurie Zimmer and Tony Burton.Vincent Canby of The New York Times wrote, \"[Assault] is a much more complex film than Mr. Carpenter's 'Halloween,' though it's not really about anything more complicated than a scare down the spine. A lot of its eerie power comes from the kind of unexplained, almost supernatural events one expects to find in a horror movie but not in a melodrama of this sort … If the movie is really about anything at all, it's about methods of urban warfare and defense. Mr. Carpenter is an extremely resourceful director whose ability to construct films entirely out of action and movement suggests that he may one day be a director to rank with Don Siegel.\"[42] Jeffrey Wells of Films In Review wrote, \"Skillfully paced and edited, Assault was rich with Hawksian dialogue and humor, especially in the clever caricature of the classic 'Hawks woman' by Laurie Zimmer.\"[43] Tom Allen and Andrew Sarris of the Village Voice described the film as \"one of the most stylishly kinetic independent films of the 1970s.\"[44] Alan Jones of Starburst wrote, \"Bravura remake of Rio Bravo.\"[45] Dave Golder of SFX magazine hailed the film as, \"A superb, bloody thriller about a siege in an abandoned L.A. cop station.\"[25] In his book The Horror Films of the 1970s, John Kenneth Muir gave the film three and a half stars, calling it \"a lean, mean exciting horror motion picture... a movie of ingenuity, cunning and thrills.\"[46] Mick Martin & Marsha Porter of the Video Movie Guide gave the film four and a half stars out of five, writing, \"…John Carpenter's riveting movie about a nearly deserted L.A. police station that finds itself under siege by a youth gang. It's a modern day version of Howard Hawks' Rio Bravo, with exceptional performances by the entire cast.\"[47] In 2003, Dalton Ross of Entertainment Weekly described Assault as \"a tight, tense thriller … Carpenter's eerie score and Douglas Knapp's stylish cinematography give this low-budget shoot-out all the weight of an urban Rio Bravo.\"[48] Leonard Maltin also gave the film three and a half stars out of four: \"A nearly deserted L.A. police station finds itself under a state of siege by a youth gang in this riveting thriller, a modern-day paraphrase of Howard Hawks' Rio Bravo. Writer/director Carpenter also did the eerie music score for this knockout.\"[49]Tim Pulleine of The Guardian described the film as superficial despite successfully meeting the requirements of the genre.[50] Brian Lindsey of Eccentric Cinema gave the film 6 out of a scale of 10, saying the film \"isn't believable for a second—yet this doesn't stop it from being a fun little B picture in the best drive-in tradition\".[51]The film currently has a 97% approval rating on Rotten Tomatoes,[41] Carpenter's highest rated film as writer-director on the website.[52] The RT consensus is: \"Lean, taut and compellingly gritty, John Carpenter's loose update of Rio Bravo ranks as a cult action classic and one of the filmmaker's best.\"[41]John Carpenter won the 1978 annual British Film Institute award for the \"originality and achievement of his first two films\", Dark Star and Assault, at the 1977 London Film Festival.[53][54]Assault on Precinct 13 is now considered by many to be one of the greatest and most underrated action films of the 1970s as well as one of the best, if not the best, films in John Carpenter's career.[41][56] In the July 1999 issue, Premiere put Assault on its list of 50 \"Lost and Profound\" unsung film classics, writing:\"A trim, grim, vicious, and incredibly effective action movie with no cut comic-relief bit players, no winks at the audience, and no stars. Just a powder keg of a premise (lifted in part from Howard Hawks's Rio Bravo), in which a quasi-terrorist group's killing spree culminates in the action described in the title. Carpenter's mastery of wide-screen and almost uncanny talent at crafting suspense and action sequences make Assault such a nerve-racking experience that you may have to reupholster your easy chair after watching it at home.\"[57]In 1988 Alan Jones of Starburst said Assault is \"arguably still the best film [Carpenter] ever made.\"[45] In 2000 John Kenneth Muir placed the film at No. 3 on his rated list of John Carpenter's filmography, behind The Thing and Halloween.[58] In October 2007, Noel Murray and Scott Tobias of The A.V. Club also ranked Assault at No. 3 of John Carpenter's best films (\"The Essentials\"), saying, \"The first John Carpenter film that really feels like a John Carpenter film, this homage to Howard Hawks Westerns suggests a path that Carpenter’s career might’ve taken if Halloween hadn’t become such a hit. Carpenter’s made many different kinds of movies over the course of his long career, but he hasn’t gotten to return often enough to terse tales of gun-toting heroes and villains.\"[59] In his fifth edition of The New Biographical Dictionary of Film in 2010, film historian David Thomson described Assault as \"a Hawksian set of a police station besieged by hoodlums - economical, tense, beautiful and highly arousing. It fulfills all Carpenter's ambitions for gripping the audience emotionally and never letting go.\"[60] Writers Michelle Le Blanc and Colin Odell have written of the film: \"[Assault] looks as fresh as the day it was first screened; its violence still shocking, its soundtrack still effective and both the dialogue and its delivery are top notch, all in a film whose $100,000 budget wouldn't satisfy the catering demands of the average Hollywood picture. This is because there is an overriding vision, a consistency to Carpenter's work that rewards repeat viewing and presents a single unifying world view.\"[61]Film director Edgar Wright and actor Simon Pegg are big fans of Assault. \"You wouldn't really call it an action film,\" claims Pegg, \"because it was pre- the evolution of that kind of film. And yet it is kind of an action film in a way.\" \"It's very much his [Carpenter's] kind of urban western\", adds Wright, \"in the way it is staging Rio Bravo set up in downtown 70s LA... And the other thing is, for a low-budget film particularly, it looks great.\"[62] On October 2011, artist Tyler Stout premiered his mondo-style poster of Assault.[55] Stout's poster would later serve as the cover on the Region B Blu-ray of Assault.[63]Assault has influenced a number of action films that came after, setting the rules for the genre that would continue with films like Die Hard and The Matrix.[26][62] The second section of From Dusk till Dawn was described by Variety as a \"Night of the Living Dead-tinged offshoot of ... Assault on Precinct 13\".[64] In 2002, the film inspired Florent Emilio Siri's 2002 quasi-remake The Nest,[65]As a result of this film, John Carpenter would go on to work with producer Irwin Yablans on Halloween, the most successful film of Carpenter's career. Due to the success of Assault in London, Carpenter named the Shape in Halloween after Michael Myers of Miracle Films, the British distributor for Assault, as a sort of campy tribute. Myers's son Martin considered the tribute as a \"tremendous honor\" and \"a lasting memorial to his late father\".[66] Donald Pleasence would go on to star in Carpenter's Halloween because his daughters were big fans of Assault.[67] Debra Hill, the film's script supervisor, would go on to produce Carpenter's future features and become his girlfriend.[6]In 2005, Assault was remade by director Jean-François Richet and starring Ethan Hawke and Laurence Fishburne.[68] The Richet remake has been praised by some as an expertly made B-movie, and dismissed by others as formulaic,[69] with many critics preferring the original Assault to the remake.[70][a 5]","assault_on_precinct_13":"Original theatrical promotional poster, 2nd version[1]","cinematography":"Douglas Knapp","production_company":"CKK Corporation","directed_by":"John Carpenter","release_dates":"November 10, 1976 (1976-11-10)|||||","Production":"Following the release of Dark Star, Assault and a second script entitled Eyes were supposed to be two ultra-low-budget films written and directed by John Carpenter, with financing by J. Stein Kaplan and Joseph Kaufman. After reviewing the first draft of Assault and following the sale of the script Eyes to Barbra Streisand and Jon Peters, later renamed Eyes of Laura Mars, Kaplan and Kaufman concentrated on just Assault. \"J. Stein Kaplan was a friend of mine from USC,\" said Carpenter. \"He knew Joseph Kaufman from his days in Philadelphia … Basically their fathers were funding Assault on Precinct 13\". The two families of the producers formed the CKK corporation to finance the film.[3][4][5]:1[6]Carpenter had hoped to make a Howard Hawks style western like El Dorado or Rio Lobo, but when the $100,000 budget prohibited it, Carpenter refashioned the basic scenario of Rio Bravo into a modern setting.[7][5]:2[6] Carpenter employed the John T. Chance pseudonym for his original version of script, entitled The Anderson Alamo, but he used his own name for the writing credit on the completed film.[5]:3 The script was written in eight days.[8] Carpenter joked, \"The script came together fast, some would say too fast.\"[9]Carpenter's script makes many allusions to film history and inspirations for this film. There are many references to the films of Howard Hawks. For example, the character of Leigh, played by Laurie Zimmer, was a reference to Rio Bravo scribe Leigh Brackett.[10] The running gag of having Napoleon Wilson constantly ask Got a smoke? was inspired by the cigarette gags used in many of Howard Hawks's westerns.[7] There are also subtle references to directors Sergio Leone and Alfred Hitchcock.[7] The day and time titles were used to make the film feel more like a documentary.[7][5]:5&10Assault underwent several months of pre-production.[5]:44 Carpenter assembled a main cast that consisted mostly of experienced but relatively obscure actors. The two leads were Austin Stoker, who had appeared previously in Battle for the Planet of the Apes and Sheba, Baby, and Darwin Joston, who had worked primarily in television and was also Carpenter's next-door neighbor.[9] After an open casting call, Carpenter added Charles Cyphers and Nancy Loomis to the cast.[6]Behind the scenes, Carpenter worked with cinematographer Douglas Knapp (a fellow USC student),[7] art director Tommy Lee Wallace, sound mixer Bill Varney[11] and property master Craig Stearns.[6] \"I hardly knew what the job required,\" said Wallace, \"but he believed in me, and, of course my price was right. It was typical of John during those lean days. He made the very best of whatever talent and facilities he had around him.\"[12] Carpenter drew storyboards for key sequences, including the \"ice cream truck\" sequence, the death of the white warlord, Napoleon Wilson struggling to get the keys of the guard after the siege starts, and the failed escape by prisoner Wells.[5]:13[13]Assault started in November 1975 and was shot in only 20 days, including Thanksgiving, on a budget of $100,000.[7][5]:43[6][a 1] The film was shot on 35mm Panavision in a 2.35:1 anamorphic aspect ratio with Metrocolor film,[7][15] Carpenter's first experience with Panavision cameras and lenses.[7] Carpenter has referred to this film as the most fun he has ever had directing.[16]Two weeks of shooting indoors were followed by two weeks on-location.[5]:70 The interiors of the police station were shot on the now-defunct Producers Studios set while the exterior shots and jail cells were from the old Venice police station.[5]:87[9] The bus traveling to Sonora was shot on a closed section of the Los Angeles freeway system, with cast and crew having lunch on the freeway.[5]:77–86 Carpenter has said that the trick with shooting a low-budget film is to shoot as little footage as possible and extend the scenes for as long as one can.[7]The first scene, in which several gang members of Street Thunder are gunned down by cops, was shot at USC. The gang members were USC students who, Carpenter added, had a lot of fun finding ways of dying while spilling blood over themselves.[7]\"The first night I saw dailies,\" replied art director Wallace, \"projected on a bedsheet in the producer's ratty apartment… My jaw dropped and I sat up so straight I cast a shadow with my head. This looked like a zillion dollars. This looked like a real movie.\"[17]One of the film's distinctive features is its score, written in three days by John Carpenter[9] and performed by Carpenter and Tommy Lee Wallace.[5]:192 Carpenter, assisted by Dan Wyman, had several banks of synthesizers that would each have to be reset when another sound had to be created, taking a great deal of time.[7][10] \"When I did my original themes for [Assault] … it was done with very old technology,\" replied Carpenter. \"It was very difficult to get the sounds, and it took very long to get something simple.\"[18] Carpenter made roughly three to five separate pieces of music and edited them to the film as appropriate.[9]The main title theme, partially inspired by both Lalo Schifrin's score to Dirty Harry and Led Zeppelin's \"Immigrant Song\",[19] is composed of a pop synthesizer riff with a drum machine underneath that \"builds only in texture, but not thematically,\" according to David Burnand and Miguel Mera. A held, high synthesizer note, with no other changes except inner frequency modulations, becomes the musical motif of the gang members, and reoccurs during certain violent acts in the film. In the film, synthesizers and drum machines represent the city and the gang.[20][21]Carpenter also uses a plaintive electric piano theme when Lt. Bishop first enters the abandoned precinct. It reoccurs in the film during the quiet moments of the siege, becoming in effect a musical articulation of rhythm of the siege itself.[22] Bishop is heard whistling the tune of this particular theme at the beginning and end of the film, making the electric piano theme \"a non-diegetic realization of a diegetic source.\"[20] Burnand and Mera have noted that \"there is some attempt to show the common denominators of human behavior regardless of 'tribal' affiliations, and there is a clear attempt to represent this through simple musical devices.\"[23]Many film critics who praised the film also praised the musical score by Carpenter. As John Kenneth Muir noted, \"Carpenter wrote the riveting musical score for Assault... The final result was a unique, synthetic sound that is still quite catchy, even after 20 years … Delightfully, it even serves as a counterpoint in one important scene.\"[10][24] Dave Goldner of SFX wrote that Assault had \"one of the most catchy theme tunes in film history.\"[25] In early 2004, Piers Martin of NME wrote that Carpenter's minimalist synthesizer score accounted for much of the film's tense and menacing atmosphere and its \"impact, 27 years on, is still being felt.\"[19]A vocal version of the theme, titled You Can't Fight It, with lyrics and production by Kenny Lynch, was recorded by Trinidad singer Jimmy Chambers and released in the UK as a 45 on the Pye label in April 1978, but it failed to chart and is now a rare item. Beyond its use in the film, the score is often cited as an influence on various electronic and hip hop artists with its main title theme being sampled by artists including Afrika Bambaataa, Tricky, Dead Prez and Bomb the Bass.[5]:192[26][27] The main theme was reworked in 1986 as an Italo disco 12\"[28] and more famously as the 1990 UK-charting rave-song Hardcore Uproar.[29]Despite this influence, except for a few compilation appearances,[5]:193–195 the film's score remained available only in bootleg form until 2003 when it was given an official release through the French label, Record Makers.[26]Carpenter edited the film using the pseudonym John T. Chance, the name of John Wayne's character in Rio Bravo. Debra Hill acted as an uncredited assistant editor.[5]:49 According to Carpenter, the editing process was very bare bones. One mistake Carpenter was not proud of was one shot \"cut out of frame,\" which means the cut is made within the frame so a viewer can see it. Assault was shot on Panavision, which takes up the entire negative, and edited on Moviola, which cannot show the whole image, so if a cut was made improperly (i.e., frame line not lined up properly) then one would cut a half of a sprocket into the film and \"cut out of frame,\" as happened to Carpenter. In the end, it did not matter because he said \"It was so dark no one could see it, thank God!\"[9]Tommy Lee Wallace, the film's art director, spoke admirably about Carpenter during post. \"[Carpenter] asked if I could cut sound effects. The answer, of course was 'Sure!' Once again, here I was, a perfectly green recruit, yet John made a leap of faith … he further insisted we get the best processing money could, which at that time was the legendary MGM color labs. Finally, he insisted we get the best postproduction sound money could buy, which was Samuel Goldwin Sound, another legend. The expense for this unorthodox approach ate up a huge amount of the budget. The production manager fumed that we were exploiting people to pay for processing— and it was true.\"[17]","produced_by":"J. S. Kaplan","starring":"Austin Stoker Darwin Joston Laurie Zimmer Nancy Kyes","running_time":"91 minutes","Themes and analysis":"Critics and commentators have often described Assault as a cross between Howard Hawks's Rio Bravo and George A. Romero's Night of the Living Dead.[51][70][71] Carpenter acknowledges the influence of both films.[7][9]In his 2000 book The Films of John Carpenter, John Kenneth Muir deconstructs Carpenter's use of Rio Bravo as a template for Assault: \"Although [the film's] premise may sound like typical 1970s picture, it was quintessential Carpenter in execution — which meant it was really quintessential Howard Hawks. Of primary importance was not the bloodshed or action, but rather the developing friendship and respect in evidence between the white convict Napoleon Wilson and black cop Lt. Bishop … also important in [Assault]'s homage to director Hawks was the unforgettable presence of actress Laurie Zimmer as a prototypical 'Hawksian Woman,' i.e., a female who gives as good as she gets and is both tough and feminine at the same time.\"[10]As with most of Carpenter's antagonists, Street Thunder is portrayed as a force that possesses mysterious origins and almost supernatural qualities. \"Rather than going for any particular type of gang,\" replied Carpenter, \"I decided to include everybody.\"[7] The gang members are not humanized and are instead represented as though they were zombies or ghouls—they are given almost no dialogue, and their movements are stylized, with a slow, deliberate, relentless quality. Carpenter has acknowledged the influence of George A. Romero's Night of the Living Dead on his portrayal of the gang.[7][9]Assault was shot in 2.35:1 anamorphic Panavision widescreen, Carpenter's first use of the format which he would use on all of his feature films.[72][a 6] \"I just love Panavision,\" replied Carpenter. \"It's a cinematic ratio.\"[73]Assault also marks the first time Carpenter's name would precede the title, e.g., John Carpenter's Assault on Precinct 13, which he would do on every subsequent feature film.[74]","music_by":"John Carpenter","edited_by":"John Carpenter (as John T. Chance)","Release":"Although the film's title is Assault on Precinct 13, the action mainly takes place in a police station referred to as Precinct 9, Division 13, by Bishop's staff sergeant over the radio. The film's distributor was responsible for the misnomer. Carpenter originally called the film The Anderson Alamo[5] before briefly changing the title to The Siege to shop to distributors.[3][a 2] The film was acquired by Irwin Yablans.[3] During post-production, however, the distributor rejected Carpenter's title in favor of the film's present name. The moniker \"Precinct 13\" was used in order to give the new title a more ominous tone.[5] When the film became popular in Britain, Michael Myers of Miracle Films purchased the British theatrical distribution rights.[14]The film was released in Germany on September 3, 1979 under the title Assault – Anschlag bei Nacht, or Assault–Stop at Night.[5]:168[30]The most infamous scene in the movie occurs when a gang member, without hesitation, shoots and kills a little girl standing near an ice-cream truck. The MPAA, headed by Richard Heffner at the time, threatened to give the film an X rating if the scene was not cut.[31][32] Following the advice of his distributor, Carpenter gave the appearance of complying by cutting the scene from the copy he gave to the MPAA, but he distributed the film with the \"ice cream truck\" scene intact, a common practice among low-budget films.[9][32] Carpenter regrets shooting the ice cream scene in such an explicit fashion: \"…it was pretty horrible at the time … I don’t think I’d do it again but I was young and stupid.\"[33]The film eventually received an R rating[15] and has a running time of 91 minutes.[a 3]The German remake in 2005 was titled Das Ende – Assault on Precinct 13 (The end - Assault on Precinct 13).[34]","written_by":"John Carpenter","budget":"$100,000"}