{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Daniel Petrie, Jr. (I)|Larry Ferguson (II)|Warren Skaaren (II)|Steven E. de Souza (III)|Josh Appelbaum (IV)|André Nemec (IV)|","story_by":"Danilo Bach (I)|Daniel Petrie, Jr. (I)|Eddie Murphy (II)|Robert D. Wachs (II)|Steven E. de Souza (III)|Josh Appelbaum (IV)|André Nemec (IV)|","Films":"In Beverly Hills Cop (1984), Axel Foley (Eddie Murphy) is introduced as a Detroit cop who, after the murder of his friend, travels to California to investigate and track down the killer(s), who he believes operate an arts dealership as a cover in Beverly Hills. He teams up with two reluctant detectives, Billy Rosewood (Judge Reinhold) and John Taggart (John Ashton), from the Beverly Hills police department who were supposed to keep a watch on him, especially after seeing Foley's different approach to tackling the situations which were considered unacceptable by the chief of police.In Beverly Hills Cop II (1987), Axel returns to Beverly Hills, after finding out that Captain Andrew Bogomil (Ronny Cox) was shot. He once again teams up with Detective Billy Rosewood and Sgt. John Taggart, who, reluctantly and against Police Chief Harold Lutz's (Allen Garfield) orders, help Foley to find out the person responsible for Bogomil's shooting. Axel, Billy, and John soon discover that the alphabet crimes, a series of felonies (robberies and Bogomil's shooting) that have been going on in the area, are masterminded by weapons kingpin Maxwell Dent (Jürgen Prochnow). With this information, Axel, Billy, and Taggart try to find Dent and his lover, Karla Fry (Brigitte Nielsen), (who had shot Bogomil).In Beverly Hills Cop III (1994), Axel returns to Beverly Hills once again. During an assignment, his boss, Inspector Todd (Gil Hill) is killed, and certain evidence points towards an amusement park called \"Wonderworld\". Upon arriving in Beverly Hills, Axel looks up his old friend Billy Rosewood who has attained the title of DDOJSIOC (Deputy Director of Joint Special Inter Operational Command). Taggart has retired and a new detective called Jon Flint (Hector Elizondo) is Rosewood's new partner.CBS ordered a pilot with Brandon T. Jackson starring as Axel Foley's son, Aaron.[7] The hour long crime drama was produced by the critically acclaimed writer Shawn Ryan who created The Shield and The Chicago Code.[8]In January 2013, Ryan stated, \"It's going to be a CBS procedural. We're going to solve a case every week, but we're going to do it with a lot of humor and a lot of fun. And I would say the stealth thing I would like to get in is, in a day and age when income inequality and class inequities dominate a lot of the country, this is going to be an opportunity to put a young working-class kid in Detroit in the middle of Beverly Hills, you can do a lot of stealth social commentary. My approach is to update it and make it feel modern and 2013. The pilot opens with a 4-5 minute sequence which I think is really harrowing and really dangerous, that would be something that you might have seen on Chicago Code or The Shield. I want it to feel grounded in that way. There'll be some opportunities for laughs after that. It's not a laughs come first show.\"[9]In February 2013, Kevin Pollak was cast as Rodney Daloof, an irritating and incredibly risk-averse in-house attorney for the Beverly Hills Police Department.[10] David Denman was cast as Brad, an honest and likable but socially awkward detective, formerly a baseball player and a musician.[11] Director Barry Sonnenfeld agreed to both direct the Beverly Hills Cop pilot and serve as an executive producer.[12] In May 2013, CBS decided to pass on the Beverly Hills Cop TV series.[13] In August 2013, Brandon T. Jackson give his reason about the pass:I think we were very edgy for CBS. I think we were the edgiest as you could've went for CBS. It would have been like a 'Fresh Prince' thing on CBS, like the edgiest you can go on network TV. But it doesn't agree to our franchise man.\"[14]In February 2015, Eddie Murphy stated that his cameo appearance in the pilot ironically doomed the show's chances: \"I was gonna be in the pilot, and they thought I should be recurring. I’m not gonna do Beverly Hills Cop on TV. I remember when they tested it — they had this little knob that you turn if you like it or you don’t like it. So when Axel shows up in the pilot, some people turned the knob so much, they broke it. So the network decided 'if he isn’t recurring, then this isn’t gonna happen.' So it didn’t happen.\"[15]In a January 2016 interview, Shawn Ryan blamed personality clashes with the network: \"The official answer is they decided they liked other pilots better. If you look at what pilots they picked up that year, I think that's kind of incredible. I would say there were a lot of 400 lb. gorillas involved in the show and sometimes the gorillas don’t always get along.\". He also said that he was very proud of the pilot and loved working with Murphy.[16]During late Summer 2013, after CBS decided to pass on the TV series, Paramount decided to move forward with the fourth film.There is a recurring instrumental theme throughout the film series called \"Axel F\", which was composed by Harold Faltermeyer.[17] The theme became popular with audiences, and has been remixed by Crazy Frog.[18] A new version of the theme was created for Beverly Hills Cop III, with Faltermeyer not returning for the film.[19]A fourth entry in the series was initially announced for release in the mid-1990s, under the production of Eddie Murphy's own production company \"Eddie Murphy Productions\", though production later fizzled out.[20] It was re-announced in 2006, when producer Jerry Bruckheimer announced his intention to resurrect the film series, though he eventually gave up his option to produce the film, instead passing production duties to Lorenzo di Bonaventura.[21][22] In September 2006 a script, an amalgamation of several earlier drafts, was presented to Murphy who was reported to be \"very happy\" with the outline which was described as an attempt to recapture the \"feel of the original\".[23][24] Murphy admitted one of his motivations for making a fourth Beverly Hills Cop film was to make up for the fact that the third film was \"horrible\" and that \"he didn't want to leave (the series) like that\".[25][26]In May 2008, Rush Hour director Brett Ratner was officially named director, who promised the film would return under the series' standard \"R\" rating, rather than as a rumored watered down PG-13.[27][28] Michael Brandt and Derek Haas were hired as screenwriters to improve on the existing script in July 2008[29] and completed a new script, under the working title Beverly Hills Cop 2009, which would see Foley return to Beverly Hills to investigate the murder of his friend Billy Rosewood.[20] The script was eventually rejected, leaving Ratner to work on a new idea. In an interview with Empire magazine, Ratner stated \"I'm working very hard on the fourth. It's very difficult, especially since there were three before. We're trying to figure out some important things, like where do we start? Is Axel retired? Is he in Beverly Hills? Is he on vacation? Does Judge Reinhold return as the loveable Billy Rosewood? Many questions to figure out, but I'm hoping to have a script before film disappears from our existence.\"[20] Although Murphy himself committed to the project, it was unconfirmed whether the series' other principal actors, Judge Reinhold, John Ashton, Ronny Cox or Bronson Pinchot would also return,[30] though Ratner stated in late 2009 that he was trying to convince Reinhold and Ashton to reprise their roles.[31] Harold Faltermeyer's \"Axel F\", however, would definitely be returning for the proposed fourth installment, with Ratner quoted as saying \"It'll be back but it'll be a whole new interpretation.\"[32] On November 15, 2010, Ratner stated in an interview with MTV that there was still a possibility that they will make a fourth film, but that it wouldn't be \"anytime soon.\"[33]In October 2011, Murphy discussed a possible fourth film, stating, \"They're not doing it. What I'm trying to do now is produce a TV show starring Axel Foley's son, and Axel is the chief of police now in Detroit. I'd do the pilot, show up here and there. None of the movie scripts were right; it was trying to force the premise. If you have to force something, you shouldn't be doing it. It was always a rehash of the old thing. It was always wrong.\"[34]During late Summer 2013, after CBS decided to pass on the TV series, Paramount decided to move forward with the fourth film. On September 13, 2013, Jerry Bruckheimer, stated he was in talks to produce. On December 6, 2013, it was announced that Eddie Murphy will again reprise the role of Axel Foley and Brett Ratner will direct.[35] On May 2, 2014, Deadline announced that screenwriters Josh Appelbaum and Andre Nemec would be penning the screenplay.[6]On June 27, 2014, in an interview with Rolling Stone, Murphy discussed returning to the edgier type character of Axel Foley after years of making family friendly films. \"I haven't done a street guy, working class, blue-collar character in ages so maybe it's like, 'Oh, wow, I didn't remember he was able to do that'\" Murphy said. According to studio reports on the film's plot, Foley will return to Detroit after leaving his job in Beverly Hills and he will be faced with the coldest winter on record to navigate the new rules and old enemies of one of America's most tenacious cities. The state of Michigan approved $13.5 million in film incentives, based on an estimated $56.6 million of filmmaker spending in the state. The film will be shot in and around Detroit and is estimated to provide jobs for 352 workers. The film was originally scheduled for a March 25, 2016 release,[36] but on May 6, 2015, Paramount Pictures pulled Beverly Hills Cop IV from its release schedule, due to script concerns.[37][38] On June 14, 2016, Deadline.com reported that Adil El Arbi and Bilall Fallah, directors of the Belgian drama Black, would direct the film.[39]","language":"English","box_office":"$735.5 million","cinematography":"Bruce Surtees (I)|Jeffrey L. Kimball (II)|Mac Ahlberg (III)|Dante Spinotti (IV)|","production_company":"Simpson/Bruckheimer (I-II) Eddie Murphy Productions (I-III)","directed_by":"Martin Brest (I)|Tony Scott (II)|John Landis (III)|''Adil El Arbi'' (nl) ''Bilall Fallah'' (nl) (IV)|","release_dates":"December 5, 1984 (1984-12-05) (I)|May 20, 1987 (1987-05-20) (II)|May 25, 1994 (1994-05-25) (III)|||","produced_by":"Jerry Bruckheimer (I-II,IV)|Don Simpson (I-II)|Mace Neufeld (III)|Robert Rehme (III)|Eddie Murphy (IV)|","starring":"Eddie Murphy|Judge Reinhold|John Ashton (l-ll, lV)|Gil Hill (l-lll)|Ronny Cox (I-II)|Brandon T. Jackson (Unaired Pilot)|","running_time":"105 minutes[1] (I)|103 minutes[2] (II)|104 minutes[3] (III)|312 minutes|","music_by":"Harold Faltermeyer (I-II)|Nile Rodgers (III)|","edited_by":"Billy Weber (I-II)|Arthur Coburn (I)|Chris Lebenzon (II)|Michael Tronick (II)|Dale Beldin (III)|","budget":"$85 million"}