{"country":"United Kingdom","distributed_by":"Columbia Pictures Screen Gems BBC Films","screenplay_by":"Jimmy Perry David Croft","dad's_army":"Theatrical release poster","Reception and possible sequel":"Filming took place between 10 August and 25 September 1970, at Shepperton Studios and various locations, notably Chalfont St Giles.[4] The film was inspected by BBFC on 27 January 1971,[5] and its UK premiere was on 12 March 1971 at the Columbia Theatre in London. Critical reviews were mixed, but it performed well at the UK box office, being the fifth most popular film of the year.[6]Discussions were held about a possible sequel, to be called Dad's Army and the Secret U-Boat Base, but the project never came to fruition.[7]The film still often appears on British terrestrial television over the Christmas period.","Plot":"1940 - Operation Dynamo has just taken place. From the newly conquered French coastline, a Wehrmacht colonel looks out over the English Channel with powerful binoculars. Surveying the white cliffs of Dover, he spies Godfrey emerging from a lavatory. Godfrey joins the rest of his platoon, who are defiantly waving the Union Flag. The colonel fumes contemptuously, \"How can the stupid British ever hope to win?!\"One morning, George Mainwaring, the manager of the Walmington-on-Sea branch of Martins Bank, and his chief clerk, Arthur Wilson, listen to Anthony Eden making a radio broadcast about forming the Local Defence Volunteers (LDV).[1] At the local police station chaos ensues because there is nobody to organise the enrolment of the men. Characteristically, Mainwaring takes charge and after commandeering the local church hall he registers the assembled volunteers.The local platoon is eventually formed with Mainwaring in command as Captain, Wilson as his Sergeant and Jack Jones as the Lance-Corporal. With no weapons or training, the platoon is initially forced to improvise, using devices invented and assembled by Jones. These invariably backfire or malfunction with disastrous consequences. The chaos includes an anti-aircraft rocket launcher blowing up a farmer's barn and a submarine made from a cast iron bathtub rolling into the river with Private Joe Walker still inside. The platoon secure uniforms and, eventually, weapons. Following the evacuation from Dunkirk, the LDV is renamed the \"Home Guard\".The platoon is ordered to take part in a war games/training weekend, but after Lance-Corporal Jones' newly gas-converted van breaks down they are towed by a steam roller. Out of control, the roller destroys the platoon's tents, as well as other equipment, angering Major-General Fullard who is in charge of the weekend exercises.After a night sleeping without tents the platoon oversleep despite being detailed to hold a pontoon bridge during the day's exercise. The bridge has been sabotaged by the Royal Marines and the results are comically chaotic. Captain Mainwaring is summoned by the Major-General and told that due to the platoon's poor showing he will recommend Mainwaring be replaced.While the platoon are walking back to Walmington, a Luftwaffe reconnaissance aircraft is shot down and its three-man crew parachute to safety. They enter Walmington church hall, where a meeting is taking place to raise money to fund a Spitfire. They hold all present as hostages, including the mayor and vicar, and demand a boat back to France. Mainwaring and his men reach home and discover what has happened. By this point the police and the military have begun to arrive.The home guard platoon infiltrate the building though the church crypt. Dressed in choir surplices, they enter the church hall singing All Things Bright and Beautiful, with their own extemporised second verse. Mainwaring takes a revolver concealed under a collection plate and confronts the Luftwaffe leader, who aims his Luger at him. Both officers agree they will shoot at the count of three. The platoon draws their rifles from beneath their robes. The German intruders reluctantly surrender. Mainwaring and his men become the pride of the town.In the final scenes, Mainwaring and the Home Guard look towards France from the cliffs. The weather has changed for the worse and it is unlikely that Hitler will ever invade, although that doesn't stop the group digging downwards when they start to suspect they've detected a Nazi attempt to tunnel into Britain.","language":"English","cinematography":"Terry Maher","production_company":"Norcon Film Productions","directed_by":"Norman Cohen","Differences from the television series":"The film made a number of significant changes, imposed by Columbia Pictures, such as recasting Liz Fraser as Mavis Pike instead of Janet Davies and filming outdoor scenes in Chalfont St Giles rather than Thetford. Also, the bank was now \"Martins\" rather than \"Swallow\" Bank. In addition, with the increase in budget, the set interiors and the vehicles used were completely different, and the streets of Walmington had extras walking on them. As well as this, the audience saw the Germans preparing across the Channel, rather than them simply being an unseen threat. In addition to this, the events of the platoon's formation were revised in various ways for the big screen treatment.Many of the changes, in particular the recasting of Mrs Pike, met with criticism. Liz Fraser was chosen because director Norman Cohen wanted a less homely, more \"sexy\" actress for the role.[2] Jimmy Perry has said \"It was a mistake...not to cast Janet in the role because the viewing public has come to recognise her as Mrs. Pike. But that was a decision made by Columbia.\".[3]Another less notable change, was the vehicle portraying Jones' butcher's van. In the TV series the van was a 1935 Ford BB (still registered as BUC852), whereas a closed cab Ford Model AA was used for the film.","release_dates":"12 March 1971 (1971-03-12) (UK)|September 1971 (1971-09) (US)||||","produced_by":"John R. Sloan","starring":"Arthur Lowe John Le Mesurier Clive Dunn John Laurie James Beck Arnold Ridley Ian Lavender Bernard Archard","running_time":"95 minutes","music_by":"Wilfred Burns"}