{"country":"Mexico Spain","distributed_by":"LD Entertainment Roadside Attractions (US)","biutiful":"Theatrical release poster","Plot":"Uxbal lives in a shabby apartment in Barcelona with his two young children, Ana and Mateo. He is separated from their mother Marambra, a woman suffering from alcoholism and bipolar disorder. Having grown up an orphan, Uxbal has no family other than his brother Tito, who works in the construction business. Uxbal earns a living by procuring work for illegal immigrants and managing a group of Chinese women producing forged designer goods along with the African street vendors who are selling them. He is able to talk to the dead and is sometimes paid to pass on messages from the recently deceased at wakes and funerals. When he is diagnosed with terminal prostate cancer leaving him with only a few months to live, his world progressively falls apart.Uxbal initially begins chemotherapy, but he later ends the treatment at the advice of his friend and traditional healer Bea. She also gives him two black stones which she asks him to give his children before he dies. The group of Africans are brutally arrested by the police despite Uxbal's regular bribes because of their involvement with drugs. When his friend Ekweme faces deportation to Senegal, Uxbal offers Ekweme's wife Ige and their baby son a room in his apartment. Meanwhile, an attempt at reconciliation with Marambra fails when Uxbal realizes she cannot be trusted to raise his children. Tito brokers a deal to put the Chinese to work at a construction site. However, almost all of them die while asleep in the basement of their sweatshop due to malfunctioning gas heaters installed by Uxbal. An attempt by a human trafficker to dump the bodies into the sea fails when they are washed up on the shore shortly after.As Uxbal's health continues to deteriorate, he is plagued with guilt that he is responsible for the death of the immigrants. As his death draws nearer, he realizes that there will be nobody to take care of Ana and Mateo once he is gone. He entrusts the remainder of his savings to Ige, asking her to stay with the children after his death. She accepts his request but later decides to use the money to pay for her return to Africa. She changes her mind at the last minute, however, and returns to the apartment. Knowing that Ige will take care of his children, Uxbal lies down next to Ana and dies after having passed on to her a diamond ring which his father had once given to his mother. He is then reunited in a snowy winter landscape with his father, who had died before Uxbal's birth shortly after having fled Spain for Mexico during the Franco regime.","language":"Spanish Chinese Wolof","Reception":"Review aggregation website Rotten Tomatoes reports 64% of critics featured on the site gave a positive review of the film at an average rating of 6.4/10 based on 143 reviews. Kirk Honeycutt of the Hollywood Reporter calls the film, \"a gorgeous melancholy tone poem about love, fatherhood and guilt\", and describes Bardem’s performance as \"...a knockout. \"[3] Betsy Sharkey of the LA Times wrote, \"Bardem gives a performance of staggering depth, unquestionably one of the year’s best. \" [4] A. O. Scott from the New York Times writes, \" Mr. Iñárritu creates a feeling of raw, sprawling intimacy…every shot is full of emotional and social detail. \" [5] Roger Ebert wrote \"What drew me into the film and engaged my sympathy was the presence of Bardem...a vastly human actor. \" [6] Steve Pond of The Wrap writes Bardem’s performance is a \"towering achievement\". The film has been overwhelmingly well received in many countries including France and the UK. Peter Bradshaw of The Guardian writes, \"The fluency and confidence of Inarritu's cinematic language are really spectacular. It may not convert, or convince, but it is certainly arresting: not magic realism exactly, but rather the director's very own brand of magic naturalism\".Critical praise was not universal. At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film has so far received an average score of 58, translating to \"mixed or average reviews.\"[7] Some dismissed the story as too bleak; Justin Chang of Variety wrote Iñárritu is \"...stuck in a grim rut.\"[8] Movieseum.com described it as \"...one of the finest films you’ll never, ever want to see again.\"[9]Filmmakers Sean Penn, Werner Herzog and Michael Mann have been very outspoken in their acclaim for the film. Herzog likened it to a \"poem\" and Penn compared Bardem’s performance to that of Marlon Brando’s in Last Tango in Paris. Julia Roberts has also been very supportive.[citation needed]Biutiful grossed $5,101,237 in the domestic box office and $20,046,549 overseas for a worldwide total of $25,147,786.[2]","box_office":"$25.1 million[2]","cinematography":"Rodrigo Prieto","production_company":"Televisió de Catalunya Televisión Española Cha Cha Cha Films Focus Features International","directed_by":"Alejandro González Iñárritu","Awards":"The film competed for the Palme d'Or at the 2010 Cannes Film Festival. It premiered at Cannes on 17 May 2010,[10] with Bardem winning for Best Actor, an award shared with Elio Germano for La Nostra Vita.[11] On 17 December 2010, the film was named Best Foreign Language Film of 2010 at the 17th Dallas–Fort Worth Film Critics Association Awards.[12][13]On 25 January 2011, the film was nominated for the Best Foreign Language Film at the 83rd Academy Awards while Javier Bardem received a nomination for Best Actor.[14] The film was also nominated for the 64th British Academy Film Awards for Best Film Not in the English Language, while Javier Bardem was nominated for Best Actor. Biutiful received eight nominations for the 25th Goya Awards; Best Actor for Javier Bardem, Best Supporting Actor for Eduard Fernández, Best Supporting Actress for Ana Wagener, Best Original Screenplay for Alejandro González Iñárritu, Armando Bó, Jr. and Nicolás Giacobone, Best Cinematography for Rodrigo Prieto, Best Editing for Stephen Mirrione, Best Art Direction for Brigitte Broch and Best Original Score for Gustavo Santaolalla.The film was also nominated at the 16th Critics' Choice Award for Best Foreign Language Film and the 68th Golden Globe Awards for Best Foreign Film, but lost to The Girl with the Dragon Tattoo and In a Better World, respectively.","release_dates":"17 May 2010 (2010-05-17) (Cannes)|22 October 2010 (2010-10-22) (Mexico)|3 December 2010 (2010-12-03) (Spain)|||","Production":"Biutiful took three and a half years to make, since the beginning of the writing process. It was shot between October 2008 and February 2009 in Barcelona, Spain. It was a Mexican and Spanish co-production. The film was shot in chronological order by scenes.","produced_by":"Alejandro González Iñárritu Jon Kilik Fernando Bovaira Ann Ruark Sandra Hermida","starring":"Javier Bardem Maricel Álvarez Hanaa Bouchaib Guillermo Estrella Diaryatou Daff Cheng Tai Shen Nasser Saleh","running_time":"147 minutes[1]","music_by":"Gustavo Santaolalla","edited_by":"Stephen Mirrione","written_by":"Alejandro González Iñárritu Armando Bó, Jr Nicolás Giacobone"}