{"breach":"Original theatrical poster","country":"United States","distributed_by":"Universal Pictures","Plot":"Eric O'Neill (Ryan Phillippe) is a young FBI employee assigned to work undercover as a clerk to Robert Hanssen (Chris Cooper), a senior agent he is told is suspected of being a sexual deviant. Hanssen has been recalled from a detail post at the State Department to FBI headquarters ostensibly to head up a new division specializing in Information Assurance. Initially, Hanssen insists on a strict formality between the two men. He frequently rails against the bureaucracy of the FBI and complains that only those who regularly \"shoot guns\" are considered for senior positions instead of those, like himself, who are involved in vital national security matters. He calls the bureau's information technology systems antiquated and laments the lack of coordination and information exchange with other intelligence agencies.Eventually, Hanssen becomes a friend and mentor to O'Neill and takes a personal interest in him and his wife Juliana (Caroline Dhavernas), who is suspicious of Hanssen and resents his intrusions. A devout Catholic who is also a member of Opus Dei, Hanssen urges O'Neill, a lapsed Catholic, and his secular East German-born wife to become active churchgoers.O'Neill finds no evidence of Hanssen leading a secret double life and develops a growing respect for his boss, so he confronts his handler in the undercover assignment, Kate Burroughs (Laura Linney), and she admits that the sexual deviance allegations are only a secondary consideration. Hanssen is suspected of spying for the Soviet Union and Russia for years and being responsible for the deaths of agents working for the United States. He learns that FBI Director Louis Freeh is personally leading the investigation.While the FBI could arrest Hanssen under lesser charges, they want to catch him in an act of espionage, so they can threaten him with the death penalty for treason and possibly induce him to divulge the information he has compromised. O'Neill is ordered to obtain data from Hanssen's Palm Pilot and keep him occupied while FBI agents search his car and plant covert listening devices in it.The tracking devices in Hanssen's car cause interference with the radio, which makes Hanssen suspicious. He also wonders why he was placed in an isolated position in the FBI only a few months before he's scheduled to retire. He tells O'Neill he believes he is being watched by Russian agents. The FBI intercepts a message he sends to his Russian handlers saying he will not provide any more information. O'Neill persuades Hanssen that he is not being trailed by the Russians or by him on behalf of the FBI. With his confidence restored, Hanssen makes one last dead drop of stolen information, and the FBI catches him in the act.Although he is assured promotion, O'Neill is discouraged with the toll the case has taken on his marriage and opts to leave the agency. When O'Neill leaves his office with his belongings, he unexpectedly encounters Hanssen in an elevator being escorted by arresting officers. Hanssen tells O'Neill to \"Pray for me\" and O'Neill promises that he will.","language":"English","Critical reception":"The review aggregator Rotten Tomatoes reported 84% of critics gave the film positive reviews, based on 167 reviews.[2] Metacritic reported the film had an average score of 74 out of 100, based on 36 reviews.[3]Manohla Dargis of The New York Times said, \"One of the strengths of Breach, a thriller that manages to excite and unnerve despite our knowing the ending, is how well it captures the utter banality of this man and his world.\"[4]Peter Travers of Rolling Stone rated the film 3½ out of four stars, calling it a \"steadily gripping hothouse of a thriller.\" He added, \"Director and co-writer Billy Ray, who detailed the misconduct of journalist Stephen Glass at The New Republic in 2003's Shattered Glass ... proves himself a filmmaker of uncommon talent and ambition.\"[5]Ruthe Stein of the San Francisco Chronicle commented, \"Breach suffers from lavishing so much attention on a relatively minor figure ... O'Neill, at least the way he's presented, isn't a particularly compelling character, and he is made less so by Phillippe's lackluster performance ... [The film] expends too much energy on a minor functionary, but it is still worth seeing for its fleeting looks into a heart of darkness.\"[6]Peter Rainer of The Christian Science Monitor named Breach the best film of the year.[3] Richard Schickel of Time ranked it #6 and called Chris Cooper's performance \"brilliant\".[7] Stephen Hunter of The Washington Post named it the ninth best film of 2007.[3]","box_office":"$41 million[1]","cinematography":"Tak Fujimoto","production_company":"Sidney Kimmel Entertainment","directed_by":"Billy Ray","Accuracy":"The filmmakers fictionalized much of Eric O'Neill's story, as mentioned in the end credits. Among the major changes made for the film:","release_dates":"February 16, 2007 (2007-02-16)","Box office":"The film opened on 1,489 theaters screens in the US and earned $10,504,990 on its opening weekend, ranking #6 among all films in release. It eventually grossed $33,231,264 domestically and $7,722,671 in foreign markets for a total worldwide box office of $40,953,935.[8]","produced_by":"Scott Kroop Adam Merims Scott Strauss","starring":"Chris Cooper Ryan Phillippe Laura Linney Dennis Haysbert Caroline Dhavernas Gary Cole","running_time":"110 minutes","music_by":"Mychael Danna","edited_by":"Jeffrey Ford","written_by":"Billy Ray Adam Mazer William Rotko","budget":"$23 million"}