{"based_on":"A Taste of Honey  by Shelagh Delaney","country":"United Kingdom","distributed_by":"British Lion Films","Awards and honours":"The film won four BAFTA awards: Richardson won Best British Screenplay (with Delaney) and Best British Film, Bryan won Best Actress and Tushingham was named Most Promising Newcomer. Tushingham and Melvin were Best Actress and Actor at the 1962 Cannes Film Festival.[3] In America the film won Tushingham a 1963 Golden Globe for Most Promising Female Newcomer and got Richardson a 1963 Directors Guild of America award nomination. Delaney and Richardson also won a Writers' Guild of Great Britain award.A Taste of Honey was ranked at 56th place in the BFI Top 100 British films list, made in 1999.","screenplay_by":"Shelagh Delaney Tony Richardson","Plot":"Jo is a 17-year old Salford schoolgirl,[2] with an abusive, forty-year-old alcoholic mother, Helen. After sustaining a fall while walking past the dockyards after school, Jo meets a black sailor called Jimmy who invites her onto his ship to attend to her grazed knee. They soon start a brief romantic relationship, after which Jimmy returns to his ship and departs. Relations between Jo and her mother become strained when her mother meets and marries a new man, Peter Smith.Feeling rejected by her mother, Jo starts a job in a shoe shop and rents a flat on her own. She meets a gay textile design student, Geoffrey Ingham, and invites him to move in with her. When Jo discovers she is pregnant by Jimmy, Geoff is supportive of her, even offering to marry her, saying at one point, \"You need somebody to love you while you're looking for somebody to love.\"Helen re-appears on the scene after the failure of her relationship with Peter, who turns out to have been a selfish lout. She moves in with Jo, which causes tensions between Helen and Geoff. Geoff decides he can no longer stay at the flat and moves out, leaving Helen to care for Jo and her soon-to-be-born baby. Symbolic of Helen's disdain of Geoffrey is her return, near the end of the film, of the bassinet he gave to Jo.","language":"English","cinematography":"Walter Lassally","production_company":"Woodfall Film Productions","directed_by":"Tony Richardson","a_taste_of_honey":"UK release window card","release_dates":"14 September 1961 (1961-09-14)|||||","produced_by":"Tony Richardson","starring":"Dora Bryan Robert Stephens Murray Melvin Paul Danquah Rita Tushingham","running_time":"100 minutes","music_by":"John Addison","External links":"","edited_by":"Antony Gibbs","Release":"The Criterion Collection will release a new, restored 4K digital transfer of the film on Blu-ray and DVD on August 23, 2016.[4]","budget":"£120,000[1]"}