{"country":"United States","Awards and nominations":"","distributed_by":"Screen Gems","Plot":"Ali Rose (Aguilera) moves to Los Angeles after she quits her bar job when her boss refuses to pay her. Once in L.A., she tries and fails at every audition she does until one night, she finds herself unknowingly in a burlesque club when she hears the music on the street. She finds Tess (Cher) and the dancers performing “Welcome to Burlesque” and decides to pursue a career on stage once she meets Jack (Gigandet). Jack refers her to Tess for an audition, but she is rejected instantly and ushered out by Sean (Tucci). Instead of leaving, Ali begins serving customers at the club as a waitress, while Tess and Sean observe with Jack asking Tess to give Ali a chance.When Georgia (Hough) becomes pregnant, auditions are held to replace her. Ali begins her audition when everyone leaves, and after performing \"Wagon Wheel Watusi\", persuades Tess to allow her to become one of the club's dancers, much to the annoyance of Nikki (Bell), a performer who is always late and caught drinking before numbers. One day Ali has to replace Nikki on stage because Nikki is too drunk to perform. Nikki sabotages the performance by turning off the music that the dancers usually lip sync to but before the curtain is dropped down, Ali impresses everyone with her amazing singing skills. Tess immediately decides to have Ali be the star of a whole new show at the club. It becomes increasingly popular and Ali enjoys her newfound stardom while Nikki fumes in the background. Despite the club's growing success, Tess is still unable to pay the bank all the money that she owes it.One night after the club closes, Tess, worried with the club's economic prospects, sings \"You Haven't Seen the Last of Me\". A very jealous Nikki shows up drunk and picks a fight with Tess, calling Ali a \"slut with mutant lungs\". Tess, who has grown frustrated with Nikki, questions her gratitude for the help she has received. Angered, Nikki quits on the spot (before falsely claiming that she slept with Vince after his and Tess's honeymoon), and the altercation ends when Tess angrily retaliates by smashing the passenger side window on Nikki's convertible with a crowbar.Tensions arise between Ali and Jack as Marcus grows increasingly infatuated with Ali, making Jack jealous. At Georgia's wedding, Jack appears to call off his engagement, getting drunk. That night, Ali and Jack sleep together, but the following morning Jack's fiancé, Natalie (Agron), returns unexpectedly from her play in New York and tells Ali that the engagement is still on. Jack denies this, and while trying to fix things, he asks Ali to leave. Feeling heartbroken and betrayed, Ali runs to Sean for support, who prompts her to go with Marcus after his phone call.While spending time with Marcus, Ali finds out about \"air rights\", which refers to the empty space above a building and what can be done with it. Ali breaks things off with Marcus after she sees his plans to build a skyscraper on the property the club is on. Ali tells Tess, and together they inform the owner of the new million-dollar condos across the street; fearing the loss of business that would result from the obstruction of his prospective tenants' view, he purchases the air rights to the club's property. The resulting money is enough for Tess to buy out Vince's share, pay off the bank, and re-fashion the club to her own vision. She also makes up with Nikki and rehires her at the club. In the end Ali, having reunited with Jack and earned Nikki's respect, performs \"Show Me How You Burlesque\" with all of the dancers, a song which Jack wrote and finally finished.","language":"English","Reception":"Movie review aggregate website Rotten Tomatoes labeled Burlesque with a 36% rating based on 143 reviews, with the consensus of critics nationwide saying that the film is \"Campy and clichéd...wastes its talented cast (including a better-than-expected Christina Aguilera) on a movie that wavers uncertainly between 'bad' and 'so bad it's good.'\"[23] Metacritic, however, said the film received \"mixed or average\" reviews, and gave the film a weighted average score of 47%, based on 38 reviews.[24] Michael Phillips of the Chicago Tribune said, \"The choicest dialogue in Burlesque provokes the sort of laughter that other, intentionally funny films only dream of generating.\"[25][26] Mick LeSalle from San Francisco Chronicle gave the movie a full score and praised Aguilera's acting, calling her \"jaw-droppingly good in several numbers\" and said, \"Aguilera knows how to listen to her fellow actors, to react and be spontaneous, and it makes all the difference\".[27] Kirk Honeycutt of The Hollywood Reporter called Burlesque \"a refreshing throwback to movie musicals that celebrates its stars while indulging in sexy fun\" and also praised Aguilera's acting and singing.[28] Lou Lumenick of the New York Post said, \"Aguilera can dance like nobody's business, but her acting debut isn't going to keep Anne Hathaway awake at night.\"[29] Stanley Tucci's performance received praise from Entertainment Weekly[30] and Empire thought the dance numbers were thrilling.[31] Time Out labelled the drama \"perfunctory\"[32] while Roger Ebert said that \"Burlesque shows Cher and Christina Aguilera being all that they can be, and that's more than enough.\"[33] Variety observed that the film \"wants to be Cabaret, but lacks the edge and historical context to pull it off.\"[34] The New York Times said that the story line \"had already gathered dust by the time [of] the 1933 musical 42nd Street.\".[35]Burlesque was released on Wednesday, November 24, 2010, the day before Thanksgiving in the United States; on its opening day, it came in third to Harry Potter and the Deathly Hallows – Part 1 and Tangled. On Thursday, November 25, 2010, it dropped down to fourth place in the box office behind Harry Potter and the Deathly Hallows: Part 1, Tangled and Unstoppable and went down to fifth on Friday, November 26, 2010. On Sunday, November 28, 2010, it went back up to third place behind Tangled and Harry Potter and the Deathly Hallows: Part 1. It stayed in the top five until December 10, 2010, when it fell to sixth behind The Chronicles of Narnia: The Voyage of the Dawn Treader, The Tourist, Tangled, Harry Potter and the Deathly Hallows: Part 1 and Unstoppable. By the Christmas weekend, it was number 15 at the box office.[36]The week after Thanksgiving, Burlesque experienced a substantial decrease on ticket sales, earning $9.65 million ($6.1 million for the weekend), for a total of $26.98 million for its first twelve days.[37] As of February 6, 2011, it had grossed $39.4 million in North America, and, as of May 15, 2011, $50.15 million in foreign countries, for a total of $90 million worldwide.[1]","box_office":"$89,657,398[1] $119,710,764[2] (with DVD sales)","cinematography":"Bojan Bazelli","production_company":"De Line Pictures","directed_by":"Steven Antin","burlesque":"Theatrical release poster","Music":"The soundtrack album features ten tracks: eight performed by Aguilera including \"Express\"; and two performed by Cher which are her first original recordings in 7 years. The soundtrack includes a mix of original and cover songs. Both the ballads from the soundtrack – \"Bound to You\" performed by Aguilera and \"You Haven't Seen the Last of Me\" performed by Cher – were nominated for the Golden Globe Award for Best Original Song. Cher's \"You Haven't Seen the Last of Me\", which was written by Diane Warren, won the award.[15][16] In United States, the soundtrack was certified Gold by the RIAA for shipments of 500,000 copies in October 2011[17]","release_dates":"November 24, 2010 (2010-11-24)|||||","Production":"Aguilera made her theatrical film and musical debut as the lead character, a \"small-town girl with a big voice\", who finds work at a Los Angeles Neo-Burlesque club, inspired by Bob Fosse's Cabaret and European burlesque entertainment.[11] Burlesque started shooting on November 9, 2009[5] and ended on March 3, 2010. Cher co-stars in her first film role since 2003's Stuck on You and first musical film.[12] She plays Tess, a former dancer who struggles to keep the nightclub open and serves as a mentor to Aguilera's character, Ali. Aguilera's love interest is played by Cam Gigandet, Stanley Tucci is the nightclub's manager, and Alan Cumming, Kristen Bell, Eric Dane and Julianne Hough round off the cast.[5] Dianna Agron makes a cameo as Jack's fiancée, Natalie. Director Steven Antin wrote the original screenplay. Diablo Cody (Juno) revised it uncredited.[13] It was later further revised by Susannah Grant, also uncredited.[11] Burlesque is Screen Gems' most expensive movie, with the exception of the Resident Evil films, with costs of $55 million.[14]","produced_by":"Donald De Line","starring":"Cher Christina Aguilera Cam Gigandet Kristen Bell Stanley Tucci Eric Dane Julianne Hough Alan Cumming Peter Gallagher Dianna Agron","running_time":"119 minutes","music_by":"Christophe Beck","edited_by":"Virginia Katz","Release":"The theatrical trailer was attached to screenings of Step Up 3D and Easy A. The first TV spot premiered during the season 2 premiere of Fox's Glee on September 21, 2010. A third TV spot also aired the following day during Dancing with the Stars, later followed by another during MTV's Jersey Shore. Several teasers have been released for promotional purposes including the Etta James's \"Something's Got a Hold on Me\". This was then followed by the track \"But I Am a Good Girl\" which was released in November 2010.[3]Aguilera performed \"Bound to You\" on The Tonight Show with Jay Leno and gave an interview and performance on Conan. Aguilera also gave an interview to show host Chelsea Handler to discuss the film and other subjects. On November 19, 2010, Aguilera also gave a television interview to Ellen DeGeneres. She then performed a track from the soundtrack, the Etta James track \"Something's Got a Hold on Me\". Aguilera performed \"Express\" at the American Music Awards of 2010 and \"Show Me How You Burlesque\" at the Dancing with the Stars finale. She also performed \"Express\" on the final of the seventh series of The X Factor which received criticism and complaints for the raunchy content.[18]The DVD and Blu-ray were released in North America on March 1, 2011.[19] A Blu-ray/DVD combo has been released as well. The DVD and Blu-ray sales exceed one million units and have grossed $20,563,918 in the United States alone;[20] and, as of May 19, 2011, it is the 19th highest selling movie of the year.[21] In all, the DVD has sold over 1.4 million units in the United States.[20] Overall, it has grossed over $30,053,366 on video sales (DVD and Blu-ray sales) in United States alone.[22]","written_by":"Steven Antin","budget":"$55 million"}