{"based_on":"Atithi (short story)  by Satyajit Ray","country":"India France","distributed_by":"Artificial Eye (UK)","Plot summary":"Anila Bose (Mamata Shankar) receives a letter from a man, who claims to be her long lost uncle Manomohan Mitra (Utpal Dutt). He is visiting India after 35 years abroad and Anila is his only surviving relative, so he wants to meet her in Calcutta before he sets off again. Anila looks forward to the meeting, but her husband Sudhindra (Deepankar De) is suspicious. The uncle arrives and stays with the family. He says that he is an anthropologist[3] who has traveled all over the world, and he immediately wins the friendship of Anila's son Satyaki.Anila suddenly remembers her grandfather's will, and Sudhindra is quick to suspect that the man calling himself Manomohan has come only to claim his share of the inheritance. Anila now also starts to doubt his identity, while their son truly believes that he is the man he claims to be.The central conflict of the film rests upon the identity of the man and the family's struggle to accept or reject it. Sudhindra subjects the visitor to various tests in an effort to resolve this conflict. In a final attempt to unravel the truth, he invites a lawyer friend to gently question the guest. However, things turn ugly as the lawyer's anger builds up until he orders the guest to \"either come clean or just clear out.\" Next morning, the visitor is gone. Desperate to find him and win him back, the family finally learns that he is in fact Manmohan Mitra, and locate him in a remote village.The couple apologises to Manmohan, and persuades him to come back to Calcutta. Back in Calcutta, just before he leaves for Australia, Manmohan gives the family his entire share of the inheritance.","screenplay_by":"Satyajit Ray","language":"Bengali","cinematography":"Barun Raha","production_company":"NFD DD Productions","directed_by":"Satyajit Ray","Awards":"At the 1992 Indian National Film Awards, Agantuk won the awards for Best Feature Film and Best Directing, and the Special Jury Award went to Mamata Shankar for her portrayal of Anila.[citation needed]","release_dates":"1991 (1991) (India)|22 May 1992 (1992-05-22) (US)|19 November 1993 (1993-11-19) (UK)|||","Production":"Agantuk was to become Satyajit Ray's last film. He died on 23 April 1992, at the age of 70. The film was a joint Indian-French production with financial backing from Gérard Depardieu's DD Productions, Canal+ and a couple of other French companies.[2] Gérard Depardieu is credited as executive producer.[4]","produced_by":"Satyajit Ray","starring":"Utpal Dutt Mamata Shankar Deepankar De Dhritiman Chatterjee Promod Ganguli Rabi Ghosh","running_time":"120 mins","Sequel":"A stand-alone sequel named Agantuker Pore is in production. Where Mamata Shankar, Deepankar De and Dhritiman Chatterjee will reprise their roles from this film. Actor Abir Chatterjee will play the role of adult Satyaki. Paayel Sarkar and Tridha Chowdhury will be seen in important roles.[5] Directed by Orko Sinha. Sinha said the story will be completely different from the previous film.[6]","agantuk":"DVD cover","music_by":"Satyajit Ray","edited_by":"Dulal Dutta"}