{"bad_day_at_black_rock":"Theatrical release poster","based_on":"\"Bad Time at Honda\" 1947 short story in The American Magazine  by Howard Breslin","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Don McGuire Millard Kaufman","Plot":"In late 1945, one-armed John J. Macreedy (Spencer Tracy) gets off a passenger train at the isolated desert hamlet of Black Rock. It is the first time in four years that the train has stopped there. Macreedy is looking for a man named Komoko, but the few residents are inexplicably hostile. The young hotel desk clerk, Pete Wirth (John Ericson), claims he has no vacant rooms. Macreedy is threatened by Hector David (Lee Marvin). Later, Reno Smith (Robert Ryan) informs Macreedy that Komoko, a Japanese-American, was interned during World War II.Certain that something is wrong, Macreedy sees the local sheriff, Tim Horn (Dean Jagger), but the alcoholic lawman is clearly afraid of Smith and is impotent to help. The veterinarian and undertaker, Doc Velie (Walter Brennan), advises Macreedy to leave town immediately, but also lets slip that Komoko is dead. Pete's sister, Liz (Anne Francis), rents Macreedy a Jeep. He drives to nearby Adobe Flat, where he finds a homestead burned to the ground and wildflowers. On the way back, Coley Trimble (Ernest Borgnine) tries to run him off the road.When Smith asks, Macreedy reveals he lost his left arm fighting in Italy. Macreedy says the wildflowers at the Komoko place lead him to suspect that a body is buried there. Smith reveals that he is virulently anti-Japanese; he tried to enlist in the Marines the day after the attack on Pearl Harbor, but failed the physical.Macreedy tries to telephone the state police, but Pete refuses to put the call through. Doc Velie admits that something terrible happened four years ago and that Smith has everyone too terrified to speak up. Velie offers Macreedy his hearse to leave town. Hector rips out the distributor cap and spark plug wires. Macreedy goes to Hastings' (Russell Collins) telegraph office and writes a telegram addressed to the state police. At the town diner, Trimble picks a fight with Macreedy, but Macreedy uses martial arts to beat him up. Macreedy tells Smith that he knows Smith killed Komoko and that he was too cowardly to do it alone, so he involved Hector, Pete, and Coley.When Macreedy goes to the hotel lobby, Smith and his henchmen are already there, as are Doc Velie and Sheriff Horn. Hastings arrives and tries to give Smith a piece of paper, but Macreedy snatches it away and discovers that it is his own unsent telegram. Macreedy and Doc Velie demand that Sheriff Horn do something. When Horn tries, Smith just takes away his sheriff's badge and pins it on Hector. Hector tears up the telegram form.After Smith and Hector leave, Macreedy reveals that the loss of his arm had left him wallowing in self-pity, but Smith's attempt to kill him has reinvigorated him. Macreedy finally reveals why he is there: Komoko's son died in combat while saving Macreedy's life. Macreedy intended to give his posthumous medal to Komoko. In turn, Macreedy learns that the elder Komoko had leased some farmland from Smith, who was sure there was no water there. Komoko had dug a well and found water. After Smith was turned down for enlistment after Pearl Harbor, he and the other men spent the day drinking, then decided to scare Komoko. The old man barricaded himself inside his home, but the men set the place on fire. When Komoko emerged ablaze, Smith shot him.Later, Macreedy and Doc Velie devise a plan for Macreedy to escape under the cover of darkness. Hector is standing guard outside the hotel; Pete lures him into the hotel office, where Doc Velie knocks him out. Liz drives Macreedy out of town in her Jeep, but stops in a canyon. Macreedy realizes he has been betrayed. When Smith starts shooting at him, Macreedy hides behind the Jeep. Liz rushes to Smith despite Macreedy's warning. Smith tells her that she has to die along with the rest of his accomplices. He shoots her in the back as she runs away. Macreedy finds a bottle and fills it with gasoline, creating a Molotov cocktail. When Smith climbs down for a better shot, Macreedy lights and throws it, setting Smith on fire.Macreedy drives into town with the injured Smith and Liz's body. The state police are called in. As Macreedy is leaving, Doc Velie requests Komoko's medal to help Black Rock heal. Macreedy gives it to him just before boarding the train.","language":"English","Reception":"According to MGM records the film earned $1,966,000 in the US and Canada and $1,822,000 elsewhere, making the studio a profit of $947,000.[1]Variety magazine's reviewer wrote: \"Considerable excitement is whipped up in this suspense drama, and fans who go for tight action will find it entirely satisfactory. Besides telling a yarn of tense suspense, the picture is concerned with a social message on civic complacency.\"[10]Bosley Crowther, film critic for The New York Times, also liked it, writing, \"Slowly, through a process of guarded discourse, which director John Sturges has built up by patient, methodical pacing of his almost completely male cast, an eerie light begins to glimmer ... Quite as interesting as the drama, which smacks of being contrived, are the types of masculine creatures paraded in this film. Mr. Tracy is sturdy and laconic as a war veteran with a lame arm (which does not hamper him, however, in fighting judo style). Mr. Ryan is angular and vicious as the uneasy king-pin of the town, and Walter Brennan is cryptic and caustic as the local mortician with a streak of spunk. Ernest Borgnine as a potbellied bully (he was Sgt. \"Fatso\" Judson in From Here to Eternity), Dean Jagger as a rum-guzzling sheriff, Lee Marvin as a dimwitted tough, John Ericson as a nervous hotel clerk and Russell Collins as a station-master are all good, too.\"[11] (Ericson and Ms. Francis later starred together in Honey West.)The review aggregator Rotten Tomatoes reported that 96% of critics gave the film a positive review, based on 25 reviews.\"[12]WinsNominations","box_office":"$3,788,000[1]","cinematography":"William C. Mellor","directed_by":"John Sturges","release_dates":"January 7, 1955 (1955-01-07) (United States)|||||","Production":"Nicholas Schenck, president of Loews Incorporated, MGM's parent company, nearly did not allow the picture to be made because he felt the story was subversive. The film's producer, Dore Schary, wanted Spencer Tracy for the leading role. Concerned that Tracy might not accept, Schary ordered the script changed so that Macreedy was a one-armed man. He concluded that no actor would turn down the chance to play a character with a handicap.Just before shooting began, an indecisive Tracy tried to back out of the picture. Schary made clear that he was willing to sue the actor if he quit the film.[9] According to Robert Osborne of the television network Turner Classic Movies, in the introduction to the film's airing on its weekly segment \"The Essentials,\" Tracy, weighed down by his growing alcoholism, refused to give MGM an answer. In order to close the deal, according to Osborne, an MGM executive contacted Tracy shortly before filming was to begin and said, \"Don't worry, Mr. Tracy, a copy of the script has been sent to Alan Ladd and he has agreed to do the picture.\" The next day, Tracy committed to Bad Day at Black Rock. Ladd, however, apparently never even saw the script. It turned out to be Tracy's last film for MGM, with the exception of How the West Was Won (1962), for which Tracy supplied the narration.Preview audiences reacted negatively to the film's original opening sequence. A revised one, showing the speeding train rushing at the camera, replaced it. The shot was taken from a helicopter as it flew away from the moving train. The film was run in reverse to create the opening shot.Bad Day at Black Rock was filmed in Lone Pine, California and the nearby Alabama Hills, one of hundreds of movies that have been filmed in the area since 1920. The \"town\" of Black Rock was built for the film. Today nothing remains of the set, erected one mile north (36°38′2.84″N 118°2′23.74″W﻿ / ﻿36.6341222°N 118.0399278°W﻿ / 36.6341222; -118.0399278Coordinates: 36°38′2.84″N 118°2′23.74″W﻿ / ﻿36.6341222°N 118.0399278°W﻿ / 36.6341222; -118.0399278) of the Lone Pine station, a stop on the Southern Pacific Railroad's Jawbone Branch, which served the northern Mojave Desert and Owens Valley.","produced_by":"Dore Schary","starring":"Spencer Tracy Robert Ryan Anne Francis Dean Jagger Walter Brennan Ernest Borgnine Lee Marvin","running_time":"81 minutes","music_by":"André Previn","edited_by":"Newell P. Kimlin","budget":"$1,271,000[1][2]"}