{"country":"United Kingdom","distributed_by":"Lionsgate","Plot":"On V.E. Day in 1945, as peace is declared across Europe and London is celebrating, Princesses Elizabeth and Margaret are allowed to join the celebrations, against the Queen's wishes. The King, impressed by Elizabeth's pleading, asks her to report back on the people's feelings towards him and his midnight speech on the radio.Each girl, incognito, is given a chaperone of an army officer, and an itinerary to be back at Buckingham Palace by 1am. Soon realising the planned itinerary by the Queen does not live up to their expectations of fun and meeting the ordinary people, Margaret is the first to slip away from her escort, followed by Elizabeth.The Princesses are separated on two different buses, and Margaret is befriended by a Naval Officer seeking to take advantage of what he believes is just an ordinary girl, and Elizabeth by an airman who is absent without leave.Margaret is led by her naval officer into a world of nightclubs, gambling, spiked drinks and brothels. Elizabeth and her airman have their own adventures trying to catch up with Margaret, which take them far beyond the 1am deadline into the early hours of the following morning.","language":"English","Critical reception":"On Rotten Tomatoes, the film has a 71% rating, based on 51 reviews, with an average rating of 5.8/10. The site's consensus states: \"Undeniably slight yet thoroughly charming, A Royal Night Out uses a fascinating historical footnote as a springboard into a fun dramedy diversion.\"[4] Metacritic reports a 59 out of 100 rating, based on 16 critics, indicating \"mixed or average reviews\".[5]","box_office":"$4.3 million[2]","cinematography":"Christophe Beaucarne","directed_by":"Julian Jarrold","a_royal_night_out":"UK theatrical release poster","production_companies":"Ecosse Films Filmgate Films Scope Pictures","Connection to actual events":"The screenplay makes no mention that Princess Margaret was 14 years old at the time, Elizabeth was 19 years old and that they went out in a group of 16 including their nanny, several friends their own age and military protection including Group Captain Peter Townsend, at the time, 30 years old and still married. The two officer escorts and the airman in the screenplay were fictional creations. The group returned to Buckingham Palace at 1am.[3]","release_dates":"8 May 2015 (2015-05-08) (United Kingdom)|4 December 2015 (2015-12-04) (United States)||||","produced_by":"Robert Bernstein|Douglas Rae|","starring":"Sarah Gadon|Bel Powley|Jack Reynor|Rupert Everett|Emily Watson|Roger Allam|","running_time":"97 minutes[1]","music_by":"Paul Englishby","edited_by":"Luke Dunkley","Release":"A Royal Night Out was released in the United Kingdom on 8 May 2015 [1] and on DVD on 7 September 2015. The film was released in the United States on 4 December 2015. The film was released on DVD on 3 May 2016.","written_by":"Trevor de Silva|Kevin Hood|"}