{"country":"United States","Awards and nominations":"Charles Lang was nominated for the Academy Award for Best Black-and-White Cinematography but lost to William H. Daniels for The Naked City. Billy Wilder, Charles Brackett, and Richard L. Breen were nominated for the Academy Award for Best Adapted Screenplay but lost to John Huston for The Treasure of the Sierra Madre, and the Writers Guild of America Award, which was won by Frank Partos and Millen Brand for The Snake Pit.[6]","distributed_by":"Paramount Pictures","screenplay_by":"Billy Wilder|Charles Brackett|Richard L. Breen|Robert Harari (adaptation)|","story_by":"David Shaw","Plot":"In 1947, a United States congressional committee which includes prim Phoebe Frost of Iowa (Jean Arthur) arrives in post-World War II Berlin to visit the American troops stationed there. Phoebe hears rumors that cabaret torch singer Erika von Schlütow (Marlene Dietrich), suspected of being the former mistress of either Hermann Göring or Joseph Goebbels, is being protected by an unidentified American officer. She enlists Captain John Pringle (John Lund), another Iowan, to assist in her investigation, unaware he is Erika's current lover.After seeing Erika with Adolf Hitler in a newsreel filmed during the war, Phoebe asks John to take her to army headquarters after hours to retrieve the singer's official file. In order to distract her, John woos Phoebe, who initially resists his romantic advances but eventually succumbs to his charms.Colonel Rufus J. Plummer (Millard Mitchell) advises John he is aware of his relationship with Erika and orders him to continue seeing her in the hope she will lead them to another of her ex-lovers, ex-Gestapo agent Hans Otto Birgel (Peter von Zerneck), believed to be hiding in the American occupation zone. Meanwhile, Erika and Phoebe are arrested during a raid designed to catch Germans without proper identification papers at the Lorelei, the nightclub where Erika performs. At the police station, Erika claims Phoebe as her cousin in order to secure her release.Phoebe, grateful for Erika's intercession on her behalf, goes with her to her apartment, where Erika confesses that John is her lover just before he arrives. Humiliated, Phoebe leaves. Colonel Plummer attempts to reconcile Phoebe and John. John is targeted by a jealous and armed Birgel at the Lorelei, but Birgel is killed by American soldiers who shoot him first. Erika is arrested and sentenced to serve time in a labour camp, and Phoebe and John are reunited.","language":"English","Reception":"Bosley Crowther of the New York Times called the film \"a dandy entertainment which has some shrewd and realistic things to say\" and added, \"Congress may not like this picture . . . and even the Department of the Army may find it a shade embarrassing. For the Messrs. Brackett and Wilder, who are not the sort to call a spade a trowel . . . are here making light of regulations and the gravity of officialdom in a smoothly sophisticated and slyly sardonic way.\" He continued, \"Under less clever presentation this sort of traffic with big stuff in the current events department might be offensive to reason and taste. But as handled by the Messrs. Brackett and Wilder . . . it has wit, worldliness and charm. It also has serious implications, via some actuality scenes in bombed Berlin, of the wretched and terrifying problem of repairing the ravages of war. Indeed, there are moments when the picture becomes down-right cynical in tone, but it is always artfully salvaged by a hasty nip-up of the yarn.\"[3]In later years, Channel 4 lauded A Foreign Affair as \"one of Wilder's great forgotten films ... worthy of rapid rediscovery,\"[4] while Andrea Mullaney of Eye For Film wrote in 2006 that the film was \"talky, intelligent, cynical\" and \"as relevant to the current American involvement in Iraq as if it had been made yesterday.\"[5]","box_office":"$2.5 million (US rentals)[1]","cinematography":"Charles Lang","production_company":"Paramount Pictures","a_foreign_affair":"Theatrical release poster","directed_by":"Billy Wilder","Home media":"A Foreign Affair has been released in both VHS and DVD formats. On 27 November 2006, it was released as part of the 18-film Marlene Dietrich: The Movie Collection for the UK market.[7] However, in April 2007 Dietrich's estate, Die Marlene Dietrich Collection GmbH, obtained an injunction which forced Universal Pictures to withdraw the DVD set due to an alleged contract breach.[8][9]In 2012, Universal through TCM released a 2-DVD set \"Directed by Billy Wilder\" featuring Five Graves to Cairo and A Foreign Affair (as of 2015, it is still in print).[citation needed]","release_dates":"June 30, 1948 (1948-06-30) (USA)|||||","Production":"While serving with the United States Army in Germany during World War II, Billy Wilder was promised government assistance if he made a film about Allied-occupied Germany, and he took advantage of the offer by developing A Foreign Affair with Charles Brackett and Richard L. Breen. Erich Pommer, who was responsible for the rebuilding of the German film industry, placed what was left of the facilities at Universum Film AG at Wilder's disposal. While researching the existing situation for his screenplay, he interviewed many of the American military personnel stationed in Berlin, as well as its residents, many of whom were having difficulty dealing with the destruction of their city. One of them was a woman he met while she was clearing rubble from the streets. \"The woman was grateful the Allies had come to fix the gas,\" Wilder later recalled. \"I thought it was so she could have a hot meal, but she said it was so she could commit suicide.\"[2]Marlene Dietrich was Wilder's first choice to play Erika, and Friedrich Hollaender already had written three songs – \"Black Market\", \"Illusions\", and \"The Ruins of Berlin\" – for her to sing in the film (the lyrics were closely tied to the plot), but the director suspected she would be opposed to portraying a woman who collaborated with the Nazis. En route home from Berlin, he stopped in Paris to visit her, ostensibly to hear her opinion about a screen test he had made with June Havoc. \"She kept making criticisms and suggestions ... and finally I said, like I had thought of it just that moment, 'Marlene, only you can play this part.' And she agreed with me,\" Wilder said.[2]Wilder persuaded Jean Arthur, who was attending college at the time, to come out of retirement to play Phoebe. Throughout filming, the actress felt the director was favouring Dietrich, and late one night she and her husband Frank Ross went to Wilder's home to confront him with her suspicions. \"Marlene told you to burn my close-up\", an extremely upset Arthur insisted. \"She doesn't want me to look better than she does.\" Wilder, knowing such insecurities were common when two very different personalities were working together, tried to reassure her he was not playing favourites, although of all the actresses he directed, he admired Dietrich most of all. \"The crews adored her ... She liked to find somebody with a cold, so she could make chicken soup for him. She loved to cook,\" Wilder recollected. Years later, Arthur called Wilder to tell him she finally had seen the film and liked it, apologised and said she would act in any future Wilder project.[2]Location shooting, much of it in the Soviet occupation zone, began in August 1947, and filming continued at Paramount Pictures in Hollywood between December 1947 and February 1948. The film was edited within a week after principal photography was completed, and it premiered at the Paramount Theatre in New York City on June 30, 1948, shortly after Wilder's The Emperor Waltz opened at Radio City Music Hall.[2]","produced_by":"Charles Brackett","starring":"Jean Arthur|Marlene Dietrich|John Lund|","running_time":"116 minutes","music_by":"Friedrich Hollaender","External links":"Streaming audio","edited_by":"Doane Harrison"}