{"based_on":"Characters  by Joe Simon Jack Kirby","country":"United States","distributed_by":"21st Century Film Corporation","screenplay_by":"Stephen Tolkin","story_by":"Stephen Tolkin|Lawrence Block|","captain_america":"Promotional poster","Plot":"In Fascist Italy in 1936, the government kidnaps a boy, Tadzio de Santis (Massimilio Massimi), and kills his family. The child is needed for an experimental project to create a Fascist supersoldier. Dr. Maria Vaselli (Carla Cassola) objects to using Tadzio, and, under the cover of gunfire, flees to the United States to offer her services to the Americans.Seven years later, the American government finds a volunteer in Steve Rogers (Matt Salinger), a soldier who is excluded from the draft because of his polio. The formula successfully transforms Rogers into a superhero, but before any more super soldiers can be created, Vaselli is murdered by a Nazi spy. Meanwhile, Tadzio (Scott Paulin) has become the Red Skull and is planning to launch a missile at the White House. Rogers, code named Captain America, is sent in to defeat the Skull and deactivate the missile.Rogers penetrates the launch compound, but after an initial battle, the Red Skull defeats Captain America and ties him to the missile as it is about to launch. Captain America grabs the Red Skull and forces him to cut off his own hand to avoid being launched along with Rogers. While the missile is over Washington, D.C., a young boy named Thomas Kimball (Garrette Ratliffe) takes a photograph as Captain America forces the missile to change course and land somewhere in Alaska, where he remains frozen for fifty years until 1993.Kimball (Ronny Cox) becomes a Vietnam War hero and is elected the President of the United States of America. A year into his term, he pushes for pro-environmentalist legislation that angers the military-industrial complex, who hold a secret conference in Italy led by the Red Skull. Following the war, Red Skull had extensive plastic surgery to partially alter his disfigured features, raised a daughter, Valentina (Francesca Neri), and has become the leader of a powerful crime family. In the 1960s, this American military-industrial complex hired the Red Skull and his thugs to murder various Americans who were against their militarism and Red Skull's fascism, such as Dr. Martin Luther King, Jr., President John F. Kennedy, and Robert Kennedy. Now, Red Skull targets Kimball for kidnapping and brainwashing.Researchers find Rogers' frozen body, and he awakens still thinking that it is the 1940s. After battling some of Red Skull's thugs, he brushes off Sam Kolawetz, a reporter and childhood friend of President Kimball, and hitchhikes his way back to his wartime girlfriend, Bernice (Kim Gillingham), in California. While Bernice still lives at her old residence, she has long since married and raised her own daughter, Sharon, who gives Rogers a series of VHS history tapes to watch. Meanwhile, Red Skull's thugs, led by Valentina, break into Bernice's house, kill her, and cause her husband to have a heart attack during their efforts to find Rogers.Rogers and Sharon visit the secret underground base where he gained his superpowers to recover Vaselli's diary and learn the original name of Red Skull. Although Rogers and Sharon find the diary, Red Skull's thugs grab it. Rogers and Sharon vow revenge and to rescue the recently kidnapped president. They travel to Italy and, in the Red Skull's home, locate an old recording of the murder of his parents. Sharon agrees to be kidnapped to allow Rogers, who once again dons his costume, to enter the Red Skull's castle.In the midst of their battle, the Red Skull pulls out a remote trigger for a nuclear dirty bomb, but Rogers uses Sharon's recording of the murder of Red Skull's family fifty-seven years earlier to distract him. While the Red Skull is lost in thought, Captain America uses his shield to send Red Skull off a cliff before the bomb can be set off. As Valentina prepares to kill Rogers, she is then decapitated from behind by his returning shield.The United States Marines arrive to save the President and arrest the Americans involved in the kidnapping. The credits roll with a comic book image of Captain America in the background and a plea to support the United States Environmental Protection Act 1990.","language":"English","Reception":"The film was universally panned by critics, holding a 0% 'rotten' rating on the film critic aggregation site Rotten Tomatoes, based on 10 critics (all of whom wrote reviews at least a decade after release). The consensus states: \"Lacking a script, budget, direction, or star capable of doing justice to its source material, this Captain America should have been left under the ice.\"[11]In one of the few contemporaneous reviews, Entertainment Weekly critic Frank Lovece wrote, \"The movie isn't merely wrong for kids — it opens in pre-war Italy with a sequence in Italian with subtitles, and a machine-gun slaughter — it's just all wrong\", and decried the \"shapeless blob of a plot\" in grading the film \"F\".[7]","box_office":"$10,173[3]","cinematography":"Philip Alan Waters","directed_by":"Albert Pyun","Home media":"The film was first released direct-to-video on VHS and LaserDisc[12] by Columbia TriStar Home Video in 1992.The film was released on DVD as part of the MGM limited edition made-on-demand series.[8]A Blu-ray Disc of the film was released by Shout! Factory on May 21, 2013 as a Collector's Edition which features a widescreen HD presentation and brand new interviews with director Pyun and star Salinger.[13]","production_companies":"Marvel Entertainment Group Jadran Film","release_dates":"December 14, 1990 (1990-12-14) (United Kingdom)|July 22, 1992 (1992-07-22) (United States)||||","Production":"The first big screen production of Captain America has a long and tumultuous production history. The film rights were originally purchased by The Cannon Group founders Menahem Golan and Yoram Globus in 1984.[5] Initially director Michael Winner was attached to direct a James Silke script.[5] Later, in 1986, Winner took over the writing chores alongside Stan Lee and Lawrence Block.[5] By 1987, Winner was off the project and actor-director John Stockwell came aboard with a script by Stephen Tolkin.[5]Golan left Cannon in 1989 and as part of a severance package he was given control of 21st Century Film Corporation and allowed to carry over the film rights to the Captain America character.[5] Director Albert Pyun, who had previously worked at Cannon, was brought on board and worked with the Tolkin script that originally started at Cannon.[5] Principal photography began in 1989 and was completed in 1990. Entertainment Tonight also visited the set during making of the film, airing a segment in August 1989.","produced_by":"Joseph Calamari|Menahem Golan|Tom Karnowski|Stan Lee|","starring":"Matt Salinger|Ronny Cox|Scott Paulin|Ned Beatty|Darren McGavin|Francesca Neri|Michael Nouri|","running_time":"97 minutes[1]","music_by":"Barry Goldberg","edited_by":"Jon Poll","Release":"The film was intended for release in the summer of 1990, to coincide with the fiftieth anniversary of Captain America. Several release dates were announced between fall 1990 and winter 1991,[6] but the film went unreleased for two years before debuting direct-to-video and on cable television in the United States in the summer of 1992.[7] It was given a limited theatrical release internationally.[8]The film was invited to screen as part of the 2013 Comic-Con in San Diego in July 2013[9]The film also has its debut on Cinemax Asia.[10]","budget":"$10 million[2]"}