{"based_on":"Dreamcatcher  by Stephen King","dreamcatcher":"Theatrical release poster","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"William Goldman|Lawrence Kasdan|","Plot":"Jonesy, Beaver, Pete, and Henry are four friends on an annual hunting trip in Maine. As children, they all acquired telepathy which they call \"the line\". A flashback shows them as they save a mentally handicapped boy named Douglas \"Duddits\" Cavell from bullies and befriend him.Jonesy sees Duddits beckoning him to cross the street, but as he does so Jonesy is hit by a car. His injuries heal with mysterious speed and 6 months later he is able to make the group's annual trip. Jonesy meets a man lost in the forest named Rick McCarthy. He is very ill, so Jonesy and Beaver let him rest and recover inside their cabin. Suddenly herds of forest animals flee past their cabin, followed by two military helicopters that announce the area is now quarantined. Jonesy and Beaver return to the cabin to find a trail of blood from the bedroom to the bathroom, where Rick sits semi-catatonic on the toilet, the room covered with blood. Suddenly Rick is thrown from the toilet, dead into the tub as a creature writhes and screams in the toilet. Beaver attempts to trap the creature under the toilet lid, but while trying to get a toothpick, the three-foot long lamprey-like creature, with multiple rows of razor-sharp teeth, breaks out. Beaver fights it but the creature kills him. Jonesy tries to escape but is confronted by a large alien called Mr. Grey, who possesses Jonesy's body and emits a red dust around the entire cabin.Nearby, Henry and Pete crash their International Scout II SUV to avoid running over a frostbitten woman from Rick's original hunting party. Henry walks for help while Pete stays with the woman. She dies and also excretes a worm, which Pete barely manages to kill. Mr. Grey then tricks and 'kidnaps' Pete, but Jonesy telepathically warns Henry to stay hidden.Henry returns to the cabin to find Beaver dead and the worm that killed him laying a group of eggs. In order to kill all of the alien larvae, he sets fire to the cabin.Meanwhile, an elite military unit specializing in extraterrestrials, led by a slightly unhinged Colonel Abraham Curtis, seeks to contain everyone exposed to the aliens, jailing them at a fenced-in concentration-camp. Col. Curtis is planning to retire after this operation and will pass the torch along with a pearl-handled stainless steel .45 pistol to Captain Owen Underhill, his trusted friend and second in command. The two lead a helicopter air-strike into a large forest clearing where the aliens' spaceship has crash-landed. The aliens use telepathy to distract the pilots, but the four Apaches and Curtis' Little Bird massacre most of the aliens with mini-guns and missiles. The alien ship then self-destructs destroying the remaining aliens and two helicopters.Jonesy, conscious within his mind, retraces his memories of the area while watching Mr. Grey use his body. Mr. Grey tries to coerce Pete into cooperating, but bites him in half when he refuses. Jonesy realizes that Mr. Grey possessed him, not by chance, but to access past memories of Duddits which he needs. Jonesy locks his memories in a \"mental warehouse\", to deny Mr. Grey the knowledge he seeks.Henry arrives at the fenced-in camp only to realize that Col. Curtis plans to kill all of those quarantined. Henry convinces Cpt. Underhill to prevent this by inviting a larger U.S. Army unit to relieve Col. Curtis and takes over the entire operation.Henry and Cpt. Underhill go to Duddits' home, with Duddits informing them that Mr. Grey is headed for the Quabbin Reservoir, which serves Boston, to seed the water with alien larva.Col. Curtis, realizing the danger that still looms to the entire planet, leaves the camp in his armed Little Bird and tracks down Henry, Cpt. Underhill and Duddits, via a micro-chip in the gift .45 pistol. At the reservoir, Owen Underhill is strafed by Curtis' helicopter and mortally wounded, but not before he shoots Curtis down.In the reservoir's pump-house, Henry uses Underhill's machine-gun to kill Mr. Grey's first worm, but cannot decide if Jonesy is possessed. Duddits confronts Mr. Grey, who finally exits Jonesy's body. The two struggle as Duddits reveals himself to be a different race of alien—both aliens explode in a cloud of red-dust which briefly resembles a dreamcatcher. Jonesy, now himself again, steps on the final larva-worm before it can escape and contaminate the reservoir.","language":"English","box_office":"$75.7 million[2]","cinematography":"John Seale","directed_by":"Lawrence Kasdan","production_companies":"Castle Rock Entertainment Village Roadshow Pictures Kasdan Pictures NPV Entertainment WV Films II","release_dates":"March 21, 2003 (2003-03-21)|||||","Production":"Dreamcatcher was filmed around Prince George, British Columbia.","produced_by":"Lawrence Kasdan|Charles Okun|","starring":"Morgan Freeman|Thomas Jane|Jason Lee|Damian Lewis|Timothy Olyphant|Tom Sizemore|Donnie Wahlberg|","running_time":"133 minutes[1]","music_by":"James Newton Howard","edited_by":"Carol Littleton","Release":"With a box-office gross of $33,685,268 in the North American domestic market, Dreamcatcher earned only half of its estimated $68 million production budget, barely surpassing it worldwide with $75,715,436. Thus the film is considered a flop.[3]In a 2012 interview, during a promotional tour for his film Darling Companion, Kasdan admitted that the commercial failure of Dreamcatcher left him \"Wounded careerwise...But not so much personally. I've been personally wounded by other movies, where I'd written it, and thought, 'Oh, God, the world's not interested in what I'm interested in.' With Dreamcatcher, the career was hurt. I was planning to do The Risk Pool with Tom Hanks. I had written the script from a great book by Richard Russo (Nobody's Fool). And it didn't happen. Then another one didn't happen. Meanwhile, two years have passed here, two have passed there. That's how you're wounded.\"[4]The film was poorly received by most critics, earning a 30% \"rotten\" rating on review aggregation website Rotten Tomatoes based on 168 reviews.[5]Mick LaSalle's review for the San Francisco Chronicle summed up the film as \"a likeable disaster.\"[6] Richard Roeper commented that \"not since Death to Smoochy have so many talented people made such a mess of things.\"[7]","budget":"$68 million"}