{"country":"Thailand","distributed_by":"Kick the Machine Anna Sanders Films","Plot":"Min is an illegal Burmese immigrant living in Thailand who has contracted a mysterious rash that is painful and covers the upper part of his body. His girlfriend, Roong, and an older woman, Orn, take him to see a doctor. Min pretends that he cannot speak because he is not fluent in Thai and speaking would reveal him to be an illegal immigrant. The doctor treats him, however because he does not have proper ID documents, the doctor refuses to supply him with the medical papers necessary to get a work permit. Orn's prescribed medication is also mentioned, and it is unclear whether she is taking pain killers or anti-depressants.Orn brings Min to her husband's work and instead of using the prescription she got for Min's rash, Orn prepares a homemade concoction, a mix of finely chopped vegetables and store-bought skin creams. Orn also mentions to her husband that she'd like to have another child. Her husband is sympathetic, but is afraid to try again because their first-born child died. While waiting in silence, Min is approached by a man who places his hand on Min's lap suggestively.Roong works in a factory, painting ceramic figurines. She does not want to work after having worked overtime the day before. Min and Orn drive over to the factory, and Roong feigns an illness and takes off with Min. She drives into the countryside, while Min directs her to a secret location she does not know. They come upon a cliff-side plateau over looking the mountainous jungle. Roong is surprised by the beautiful view and they have a romantic picnic on the cliff and later by a river in the jungle. It is mentioned briefly by Roong that she dislikes Orn, and also claims that no one likes the older woman.Orn, meanwhile has an erotic affair with one of her husband's co-workers. They are suddenly interrupted when the motorcycle is stolen. The man chases after the thief and disappears, leaving Orn in anxious solitude. She ends up lost in the woods, and eventually stumbles upon the young lovers by the river while Roong is giving oral fellatio to Min.Orn approaches the young couple after they finish. Roong leads Orn into a stream where they both rub lotion on Min. They then dry off and lie down by the river bank, Roong with Min and Orn by herself. Orn looks over at the couple and becomes emotional. She discovers ants on all the picnic articles and throws the majority of the garbage into the river. She brushes off the picnic blanket, lies down on it and begins to cry. Meanwhile, Roong brings Min's penis out of his pants and rubs it with her hand. She slowly falls asleep as she whispers Min's name. The final shot is of Roong turning over and gazing directly into the camera.The film ends with text stating: December 2001. Min is in Bangkok while waiting for work at a casino on the Thai-Cambodian border. Roong got back together with her boyfriend and they sell noodles in a town not far from Bangkok. Orn continues working as an extra in Thai movies.","language":"Thai","Reception":"Blissfully Yours has received mostly positive reviews from critics.[3] On review aggregator website Rotten Tomatoes, the film currently holds a 90% approval rating based on 10 reviews, with an average rating of 7.6/10.\"[4] On Metacritic, the film currently has a weighted average score of 75/100 based on 6 reviews, indicating \"generally favorable reviews\".Blissfully Yours received 10 votes in the British Film Institute's decennial Sight & Sound polls of the greatest films ever made.[5] The aggregation site They Shoot Pictures, Don't They has also found it to be the 18th most acclaimed film of the 21st century.[6]","blissfully_yours":"The Thai film poster.","cinematography":"Sayombhu Mukdeeprom","directed_by":"Apichatpong Weerasethakul","Alternate versions":"Because of its graphic sex scenes, the film was censored in Thailand, with about 10 minutes cut from the Thai DVD release.","release_dates":"May 17, 2002 (France) August 13, 2002 (Thailand)","Title sequence and soundtrack":"The opening title credits roll about 45 minutes into the film, during Roong and Min's drive into the jungle. Roong turns on the car radio and the music playing is a Thai-language version of \"Summer Samba (So Nice)\", composed by Marcos Valle and sung by the Thai artist, Nadia.","produced_by":"Eric Chan Charles de Meaux","starring":"Kanokporn Thong-aram Min Oo Jenjira Jansuda","running_time":"125 minutes","edited_by":"Lee Chatametikool","written_by":"Apichatpong Weerasethakul"}