{"country":"New Zealand[2]|United States[2]|South Africa[2]|","distributed_by":"TriStar Pictures","Plot":"In an alternate 1982, an alien ship inexplicably stops over Johannesburg. When investigation teams enter the ship, they discover a population of sick and malnourished extraterrestrials, who become nicknamed \"prawns\". The South African government confines the aliens to \"District 9\", a government camp that is located outside of Johannesburg. Twenty-eight years later, in 2010, following periodic conflict between the aliens and the locals living near District 9, the government hires private military company Multinational United (MNU) to relocate the aliens to a new internment. Wikus van de Merwe (Sharlto Copley), an Afrikaner bureaucrat, is appointed by Piet Smit (Louis Minnaar), an MNU executive and his father-in-law, to lead the relocation.Meanwhile, three aliens — Christopher Johnson (Jason Cope), his son, and a friend — scavenge pieces of their technology from which they distill a fluid of their native provenance, and store it in a small canister. Wikus confiscates the canister from the shack of Christopher's friend, but accidentally sprays some of the fluid onto his face. Christopher's friend is subsequently killed by Koobus Venter (David James), a sadistic mercenary soldier employed by MNU.Under the fluid's influence, Wikus' body, starting with his injured left arm, begins to deteriorate and become alien tissue. He is immediately detained and transported to MNU headquarters for experimentation, where it is discovered that Wikus' chimeric DNA grants him the ability to use alien weapons- which are biologically restricted to work for alien users only. Realizing the potential fortune to be made from Wikus' tissue in its current state, Smit and his scientists decide to vivisect Wikus; but he overpowers them and escapes the facility. Smit orders Venter and his men to hunt Wikus down, while a smear story is published that claims Wikus has been engaging in sexual activity with aliens and is a fugitive infected by an alien STD. Everyone believes the story, even, for a time, Wikus' wife (and Smit's daughter) Tania (Vanessa Haywood).Wikus finds refuge in District 9 and stumbles into Christopher's shack, where he learns that Christopher is hiding the lost command module of their spacecraft underground. Christopher discloses that the fluid in the canister would allow him to reactivate the command module and the dormant mothership, in which he claims he can reverse Wikus' mutation. To recover the canister from MNU headquarters, Wikus obtains alien weapons from superstitious Nigerian arms-dealer Obesandjo (Eugene Khumbanyiwa) and his gang, then he and Christopher attack the MNU offices, retrieve the canister, and flee to District 9 with MNU forces in pursuit.Appalled by the illegal experiments on his fellow aliens at MNU headquarters, Christopher decides to get help before curing Wikus, which will take three years. Frustrated, Wikus knocks out Christopher and attempts to fly the command module to the mothership, but is almost immediately shot down by Venter and his men. They capture Wikus and Christopher, but Obesandjo's gang intervene and seize Wikus, acting on Obesandjo's belief that eating Wikus' transformed arm will enable him to use alien weaponry. Obesandjo's base is then attacked by MNU.In the command module, Christopher's son remotely activates the mothership and an alien mechanized battle suit in Obesandjo's base which kills Obesandjo and his men. Wikus takes control of the battle suit and rescues Christopher, who promises to return in three years with a cure. Wikus kills all the attacking soldiers before Venter cripples the suit, which ejects Wikus. As he corners Wikus, a group of aliens kill Venter by tearing him apart. The command module with Christopher and his son is lifted into the mothership, which they use to leave Earth, and Johannesburg's residents celebrate its departure.A series of interviews and news broadcasts are shown speculating about Wikus' whereabouts and the potential return of Christopher and the spacecraft, and what it may entail. MNU's illegal experiments are exposed by Wikus' friend and assistant Fundiswa (Mandla Gaduka), and District 9 is demolished; all the aliens are subsequently moved to the larger District 10. Tania finds a metal flower on her doorstep, giving her hope that Wikus is still alive. The final scene shows a fully transformed Wikus in a junkyard, crafting a similar flower.","language":"English","Themes":"Like Alive in Joburg, the short film on which the feature film is based, the setting of District 9 is inspired by historical events during the apartheid era, particularly alluding to District Six, an inner-city residential area in Cape Town, declared a \"whites only\" area by the government in 1966, with 60,000 people forcibly removed to Cape Flats, 25 km (15 mi) away.[8] The film also refers to contemporary evictions and forced removals to suburban ghettos in post-apartheid South Africa, as well as the resistance of its residents.[9][10] This includes the high profile attempted forced removal of the Joe Slovo informal settlement in Cape Town to temporary relocation areas in Delft, plus the attempted evictions of Abahlali baseMjondolo and evictions in the shack settlement, Chiawelo, where the film was actually shot.[7] Blikkiesdorp, a temporary relocation area in Cape Town, has also been compared with the District 9 camp earning a front page spread in The Daily Voice.[11][12]The film emphasizes the irony of Wikus becoming more humane as he becomes less human.[13] Chris Mikesell from the University of Hawaii newspaper Ka Leo writes that \"Substitute 'black,' 'Asian,' 'Mexican,' 'illegal,' 'Jew,' or any number of different labels for the word 'prawn' in this film and you will hear the hidden truth behind the dialogue\".[14]Themes of racism and xenophobia are shown in the form of speciesism. Used to describe the aliens, the word \"prawn\" is a reference to the Parktown prawn, a king cricket species considered a pest in South Africa.[15] Copley has said that the theme is not intended to be the main focus of the work, but can work at a subconscious level even if it is not noticed.[16]Duane Dudek of the Journal Sentinel wrote that \"The result is an action film about xenophobia, in which all races of humans are united in their dislike and mistrust of an insect-like species\".[17]An underlying theme in District 9 is state reliance on multinational corporations as a government-funded enforcement. As MNU represents the type of corporation which partners with governments, the negative portrayal of MNU in the film depicts the dangers of outsourcing militaries and bureaucracies to private contractors.[18][19]","Reception":"As of November 4, 2009[update], District 9 had grossed an estimated US$210,819,611, of which US$115,646,235 was from Canada and the United States. Its production budget was US$30 million.[3]It opened in 3,048 theaters in Canada and the United States on August 14, 2009, and the film ranked first at the weekend box office with an opening gross of US$37,354,308. Among comparable science fiction films in the past, its opening attendance was slightly less than the 2008 film Cloverfield and the 1997 film Starship Troopers. The audience demographic for District 9 was 64 percent male and 57 percent people 25 years or older.[34] The film stood out as a summer film that generated strong business despite little-known casting.[44] Its opening success was attributed to the studio's unusual marketing campaign. In the film's second weekend, it dropped 49% in revenue while competing against the opening film Inglourious Basterds for the male audience, as Sony Pictures attributed the \"good hold\" to District 9's strong playability.[45]The film enjoyed similar success in the UK with an opening gross of £2,288,378 showing at 447 cinemas.[46]Rotten Tomatoes reported that 90% of critics gave the film a positive review, based on a sample of 261, with an average score of 7.8 out of 10. The website wrote of the consensus, \"Technically brilliant and emotionally wrenching, District 9 has action, imagination, and all the elements of a thoroughly entertaining science-fiction classic.\"[47] At Metacritic, which assigns a weighted average rating out of 100 to reviews from mainstream critics, the film has received a score of 81 based on 36 reviews, indicating \"universal acclaim\".[48] IGN listed District 9 as 24 on a list of the 25 Great Sci-Fi films ever.[49]Sara Vilkomerson of The New York Observer wrote, \"District 9 is the most exciting science fiction movie to come along in ages; definitely the most thrilling film of the summer; and quite possibly the best film I've seen all year.\"[50] Christy Lemire from the Associated Press was impressed by the plot and thematic content, claiming that \"District 9 has the aesthetic trappings of science fiction but it's really more of a character drama, an examination of how a man responds when he's forced to confront his identity during extraordinary circumstances.\"[51] Entertainment Weekly's Lisa Schwarzbaum described it as \"... madly original, cheekily political, [and] altogether exciting ...\"[52]Roger Ebert praised the film for \"giving us aliens to remind us not everyone who comes in a spaceship need be angelic, octopod or stainless steel\", but complains that \"... the third act is disappointing, involving standard shoot-out action. No attempt is made to resolve the situation, and if that's a happy ending, I've seen happier. Despite its creativity, the film remains space opera and avoids the higher realms of science-fiction.\"[53] Josh Tyler of Cinema Blend says the film is unique in interpretation and execution, but considers it to be a knockoff of the 1988 film Alien Nation.[54]Nigeria's Information Minister Dora Akunyili asked movie theatres around the country to either ban the film or edit out specific references to the country, because of the film's negative depiction of the Nigerian characters as criminals and cannibals. Letters of complaint were sent to the producer and distributor of the film demanding an apology. She also said the gang leader Obesandjo is almost identical in spelling and pronunciation to the surname of former president Olusegun Obasanjo.[55] The film was later banned in Nigeria; the Nigerian Film and Video Censors Board was asked to prevent cinemas from showing the film and also to confiscate it.[56]Hakeem Kae-Kazim, a Nigerian-born British actor also criticized the portrayal of Nigerians in the film,[57] telling the Beeld newspaper: \"Africa is a beautiful place and the problems it does have can not be shown by such a small group of people.\"[citation needed]However, the Malawian actor Eugene Khumbanyiwa, who played Obesandjo, has stated that the Nigerians in the cast of District 9 were not perturbed by the portrayal of Nigerians in the film, and that the film should not be taken literally: \"It's a story, you know. It's not like Nigerians do eat aliens. Aliens don't even exist in the first place.\"[58]Teju Cole, a Nigerian-American writer, has commented that the \"one-dimensionality of the Nigerian characters is striking,\" even when taking into account the fact that District 9 is meant to be a fable. He suggests two possible explanations for Blomkamp's narrative choice: first, that it is meant to reflect ongoing anti-foreigner sentiment within South Africa itself; or second, that it simply represents an oversight on Blomkamp's part.[59]District 9 was named one of the top 10 independent films of 2009 by the National Board of Review of Motion Pictures. The film received four Academy Awards nominations, seven British Academy Film Awards nominations, five Broadcast Film Critics Association nominations, and one Golden Globe nomination. It is the fourth TriStar Pictures film ever nominated for Best Picture at the Academy Awards (the previous three were As Good as It Gets, Jerry Maguire, and Bugsy). It won the 2009 Bradbury Award from the Science Fiction and Fantasy Writers of America.[60]","Potential sequel":"On August 1, 2009, two weeks before District 9 was released to cinemas, Neill Blomkamp hinted that he intended to make a sequel if the film was successful enough. During an interview on the Rude Awakening 94.7 Highveld Stereo breakfast radio show, he alluded to it, saying \"There probably will be.\" Nevertheless, he revealed that his next project is unrelated to the District 9 universe.[65] In an interview with Rotten Tomatoes, Blomkamp stated that he was \"totally\" hoping for a follow-up: \"I haven't thought of a story yet but if people want to see another one, I'd love to do it.\"[66] Blomkamp has posed the possibility of the next movie in the series being a prequel.[67] In an interview with Empire magazine posted on April 28, 2010, Sharlto Copley suggested that a follow-up, while very likely, would be about two years away, given his and Neill Blomkamp's current commitments.[68]In an interview with IGN in June 2013, Blomkamp said, \"I really want to make a District 9 sequel. I genuinely do. The problem is I have a bunch of ideas and stuff that I want to make. I'm relatively new to this – I'm about to make my third film, and now the pattern that I'm starting to realise is very true is that you lock yourself into a film beyond the film you're currently working on. But it just doesn't work for me.\" Referring to a potential sequel, Blomkamp said \"[he] want[s] to make District 10 at some point\".[69]","box_office":"US$210.8 million[3]","cinematography":"Trent Opaloch","Marketing":"Sony Pictures launched a \"Humans Only\" marketing campaign to promote District 9. Sony's marketing team designed its promotional material to emulate the segregational billboards that appear throughout the film.[29] Billboards, banners, posters, and stickers were thus designed with the theme in mind, and the material was spread across public places such as bus stops in various cities, including \"humans only\" signs in certain locations and providing toll-free numbers to report \"non-human\" activity.[34][35] Promotional material was also presented at the 2008 San Diego Comic-Con, advertising the website D-9.com,[36] which had an application presented by the fictional Multi-National United (MNU). The website had a local alert system for Johannesburg (the film's setting), news feeds, behavior recommendations, and rules and regulations. Other viral websites for the film were also launched, including an MNU website with a countdown timer for the film's release,[37] an anti-MNU blog run by fictional alien character Christopher Johnson,[38] and an MNU-sponsored educational website.[39][40] An online game for District 9 has also been made where players can choose to be a human or an alien. Humans are MNU agents on patrol trying to arrest or kill aliens. Aliens try to avoid capture from MNU agents whilst searching for alien canisters.[41]WETA released in July 2010 Christopher Johnson and Son as sculptures.[42]According to the American Humane Association, the film displays an unauthorized \"no animals were harmed\" end credit, which is a registered trademark of the group.[43]","directed_by":"Neill Blomkamp","Home media":"The Blu-ray Disc and Region 1 Code widescreen edition of District 9 as well as the 2-disc special edition version on DVD was released on December 22, 2009.[61] The DVD and Blu-ray Disc includes the documentary \"The Alien Agenda: A Filmmaker's Log\" and the special features \"Metamorphosis: The Transformation of Wikus\", \"Innovation: Acting and Improvisation\", \"Conception and Design: Creating the World of District 9\", and \"Alien Generation: Visual Effects\".[62] The demo for the video game God of War III featured in the 2009 Electronic Entertainment Expo is also included with the Blu-ray release of District 9 playable on the Sony PlayStation 3.[63][64]","district_9":"Theatrical release poster","production_companies":"QED International WingNut Films","release_dates":"August 13, 2009 (2009-08-13) (New Zealand)|August 14, 2009 (2009-08-14) (United States)|August 28, 2009 (2009-08-28) (South Africa)|||","Production":"Producer Peter Jackson planned to produce a film adaptation based on the Halo video-game franchise with first-time director Neill Blomkamp. Due to a lack of financing, the Halo adaptation was placed on hold. Jackson and Blomkamp discussed pursuing alternative projects and eventually chose to produce and direct, respectively, District 9. Blomkamp had previously directed commercials and short films, but District 9 was his first feature film. The director co-wrote the script with Terri Tatchell and chose to film in South Africa, where he was born.[20] In District 9, Tatchell and Blomkamp returned to the world explored in his short film Alive in Joburg, choosing characters, moments and concepts that they found interesting including the documentary style filmmaking, staged interviews, alien designs, alien technology/mecha suits, and the parallels to racial conflict and segregation in South Africa, and fleshing out these elements for the feature film.[21]QED International fully financed the production of the independent film, underwriting the negative cost prior to American Film Market (AFM) 2007. At AFM 2007, QED entered into a distribution deal with Sony's TriStar Pictures for North America and other English-language territories, Korea, Italy, Russia and Portugal.[22]The film was shot on location in Chiawelo, Soweto during a time of violent unrest in Alexandra, Gauteng and other South African townships involving clashes between native South Africans and Africans born in other countries.[23] The location that portrays District 9 in itself was in fact a real impoverished neighborhood from which people were being forcibly relocated to government-subsidised housing.[7] Several scenes were shot at the Ponte building.[24]Filming for District 9 took place during the winter in Johannesburg, South Africa. According to director Neill Blomkamp, during the winter season, Johannesburg \"actually looks like Chernobyl\", a \"nuclear apocalyptic wasteland\". Blomkamp wanted to capture the deserted, bleak atmosphere and environment, so he and the crew had to film during the months of June through July. The film took a total of 60 days of shooting. Filming in December raised another issue in that there was much more rain. Due to the rain, there was a lot of greenery to work with, which Blomkamp did not want. In fact, Blomkamp had to cut some of the vegetation in the scenery to portray the setting as desolate and dark.The film features many weapons and vehicles produced by the South African arms-industry, including the R5 and Vektor CR-21 assault rifles, Denel NTW-20 20mm anti-materiel rifle, BXP submachine gun, Casspir armored personnel carrier, Ratel infantry fighting vehicle, Rooikat armored fighting vehicle, Atlas Oryx helicopter and militarized Toyota Hilux \"technical\" pickup truck.[25][26]Blomkamp said no single film influenced District 9, but cited the 1980s \"hardcore sci-fi/action\" films such as Alien, Aliens, The Terminator, Terminator 2: Judgment Day, Predator and RoboCop as subconscious influences. The director said, \"I don't know whether the film has that feeling or not for the audience, but I wanted it to have that harsh 1980s kind of vibe — I didn't want it to feel glossy and slick.\"[21]Because of the amount of hand-held shooting required for the film, the producers and crew decided to shoot using the digital Red One 4K camera. Cinematographer Trent Opaloch used nine digital Red Ones owned by Peter Jackson for primary filming.[27] According to HD Magazine, District 9 was shot on RED One cameras using build 15, Cooke S4 primes and Angenieux zooms. The documentary style and CCTV style cam footage was shot on the Sony EX1/EX3 XDCAM-HD. Additionally, the post-production team was warned that the most RED footage they could handle a day was about an hour and a half. When that got to five hours a day reinforcements were called in and 120 Terabytes of data was filled.[28]Already as a young child living in South Africa, Blomkamp was captivated by artwork and visual effects. \"I knew I wanted to be in movies… So I thought I wanted to be in special effects, like model-making and prosthetic effects.\" The combination of knowing he would find a career in the visual effects area and the advancement of technology allowing better computer graphics capabilities led him to work at a Canadian post-production company as a visual effects artist. The aliens in District 9 were designed by Weta Workshop, and the design was executed by Image Engine.Blomkamp wanted the aliens to maintain both humanistic and barbaric features in the design of the creatures. According to Terri Tatchell, the director's writing partner, \"They are not appealing, they are not cute, and they don't tug at our heartstrings. He went for a scary, hard, warrior-looking alien, which is much more of a challenge.\" The look of the alien, with its exoskeleton-crustacean hybrid and crab-like shells, was meant to initially evoke a sense of disgust from viewers but as the story progresses, the audience was meant to sympathize with these creatures who had such human-like emotions and characteristics. Blomkamp established criteria for the design of the aliens. He wanted the species to be insect-like but also bipedal. The director wanted the audience to relate to the aliens and said of the restriction on the creature design, \"Unfortunately, they had to be human-esque because our psychology doesn't allow us to really empathize with something unless it has a face and an anthropomorphic shape. Like if you see something that's four-legged, you think it's a dog; that's just how we're wired... If you make a film about an alien force, which is the oppressor or aggressor, and you don't want to empathize with them, you can go to town. So creatively that's what I wanted to do but story-wise, I just couldn't.\"[29]Blomkamp originally sought to have Weta Digital design the creatures, but the company was busy with effects for Avatar. The director then decided to choose a Vancouver-based effects company because he anticipated to make films there in the future and because British Columbia offered a tax credit. Blomkamp met with Image Engine and considered them \"a bit of a gamble\" since the company had not pursued a project as large as a feature film.[21] Aside from the aliens appearing on the operating table in the medical lab, all of them were created using CGI visual effects.[30]Weta Digital designed the 2.5 km diameter mothership[31] and the drop ship, while the exo-suit and the little pets were designed by The Embassy Visual Effects. Zoic Studios performed overflow 2D work.[21] On-set live special effects were created by MXFX.[32]The music for District 9 was scored by Canadian composer Clinton Shorter, who spent three weeks preparing for the film. Director Neill Blomkamp wanted a \"raw and dark\" score, but one that maintained its South African roots. This was a challenge for Shorter, who found much of the South African music he worked with to be optimistic and joyful. Unable to get the African drums to sound dark and heavy, Shorter used a combination of taiko drums and synthesized instruments for the desired effects, with the core African elements of the score conveyed in the vocals and smaller percussion.[33] Both the score and soundtrack feature music and vocals from Kwaito artists.","produced_by":"Peter Jackson|Carolynne Cunningham|","starring":"Sharlto Copley|Jason Cope|David James|Vanessa Haywood|Mandla Gaduka|Kenneth Nkosi|Eugene Khumbanyiwa|Louis Minnaar|William Allen Young|","running_time":"112 minutes[1]","music_by":"Clinton Shorter","edited_by":"Julian Clarke","written_by":"Neill Blomkamp|Terri Tatchell|","budget":"US$30 million[3]"}