{"based_on":"Ben-Hur: A Tale of the Christ  by Lew Wallace","country":"United States","distributed_by":"Paramount Pictures Metro-Goldwyn-Mayer Pictures","ben-hur":"Teaser poster","screenplay_by":"Keith Clarke John Ridley","language":"English","Premise":"A nobleman, Judah Ben-Hur (Jack Huston), is falsely accused of an assassination attempt by his childhood friend and adoptive brother Messala (Toby Kebbell). He survives years of slavery under the Romans and attempts to get revenge by challenging his adoptive brother in a grand chariot race while being forever changed after a series of encounters with Jesus of Nazareth.","cinematography":"Oliver Wood","Marketing":"Two exclusive photos of the film were released by USA Today on March 14, 2016.[3] On March 15, Entertainment Tonight released a world exclusive premiere of some of the scenes of the chariot race[57] and on the following day the first official trailer was released online,[58][59] along with a teaser poster.[60] The trailer was released a week after Paramount released 10 Cloverfield Lane in theaters.[59] Although Paramount did not secure a Super Bowl commercial spot for the film, Scott Mendelson of Forbes felt that it was an appropriate film to advertise before Sony Pictures' Miracles from Heaven opened on March 16.[59]The trailer garnered polarized reception from critics and audiences[61][62][63] with comparisons being made to 300: Rise of an Empire,[64] Gladiator,[65][66][67] and Spartacus: Blood and Sand.[68] In its first week, the trailer was viewed over 8.2 million times across YouTube and Facebook, making it the fourth most viewed trailer of the week.[69]","directed_by":"Timur Bekmambetov","production_companies":"Sean Daniels Productions Lightworkers Media","release_dates":"August 19, 2016 (2016-08-19) (United States)|||||","Production":"In 2013, Metro-Goldwyn-Mayer acquired Keith R. Clarke's script, an adaptation of Lew Wallace's 1880 novel Ben-Hur: A Tale of the Christ, which is in the public domain.[25] In April 2014, Paramount Pictures and MGM announced that they will co-produce a new version of Ben-Hur, based on the novel with Mark Burnett and Roma Downey serving to produce and executive produce.[26] MGM had previously released two films based on the book, the 1925 silent film and the more famous 1959 film of same name after which the rights of the later film was sold to Ted Turner in the 1980s.[26] MGM had just emerged from bankruptcy due to the global success of the twenty-third James Bond film, Skyfall and The Hobbit: An Unexpected Journey which both went to gross over $1 billion at the box office worldwide including above $300 million in the United States and Canada and Paramount was having their share of success at that time with the biblical tale, Noah.[26][27] Later John Ridley (12 Years a Slave) was hired to revise the script with Sean Daniel, Burnett and Joni Levin attached to produce and Downey, Clarke and Jason Brown executive producing.[26][25] Duncan Henderson was later attached to produce while John Ridley to executive producer.[4] It was also announced that the new film will differ much from the 1959 film and will deal with the formative relationships of Ben-Hur and Messala growing up as best friends before the Roman Empire took control of Jerusalem and that Christ will have a prominent role.[26]In September 2013, Timur Bekmambetov was hired to direct the film.[28] Bekmambetov said the story of Ben-Hur reminded him of Romeo and Juliet, Hamlet, and any story written by Anton Chekhov.[29] He was fascinated by the 1959 film but found the focus on revenge rather than forgiveness to be the main problem. Hence, he wanted to stress on themes of forgiveness and love rather then mere vengeance. He found \"the most important values of pride, rivalry, power, strength, the dictatorship of power and self-love\" that were prominent in the Roman Empire to be passé in the contemporary world of today. Hence, he wanted those themes to be the primary subjects in this version.[29] He said that the film is not just about the story of Ben-Hur alone, but rather a shared story of him and his brother, Messala.[1] Bekmambetov was well aware of the comparisons being made with the earlier classical adapted films and hence he felt the need to make the film very different from the others. As a result, he decided to make a realistic drama film rather then a huge tentpole attraction.[1] The director didn't set out to make a more stylized version of the past, as he did with Abraham Lincoln: Vampire Hunter; he wanted to make a film that’s more grounded and tangible.[30]In June 2015, Rob Moore, the vice chairman of Paramount explained that this version is not so much a remake of the 1959 film, but a new interpretation of the Lew Wallace novel on which both are based.[2]\"It's going to be different in the sense that the original writer Keith Clarke wrote an amazing script and then went back to the Lew Wallace novel and really excavated the relationship between the two main characters, Ben-Hur and Messala. It's interesting to a degree. It’s kind of like going after Jimi Hendrix, because there are things about the 1959 movie that we think we remember, there are things that really happened, including obviously the chariot race, so it's going to be different in the sense that were's not really trying to completely chase the movie people remember but there are elements of that movie: the heart of the film, the emotional drive of the film that we want to try to bring to a whole new audience. I think it's an interesting project. Its certainly challenging. It's certainly one that people are going to come into with expectations, but like anything you do, you gotta exceed those expectations to a degree and also not worry about them because at its core, we hope and believe that weve got something thats unique.\"John Ridley re-wrote the script based on an original screenplay by Keith Clarke which itself was based on Lew Wallace's 1880 novel Ben-Hur: A Tale of the Christ.[32] Ridley admired how Clarke went back to the source material and focused his attention on subjects of racial slavery and colonization and the deep relationships of the two friends. He was more drawn to the project since it dealt with themes of faith in a very \"potent manner\".[32][33] The studio approached him in October 2013 after he wrote the screenplay for 12 Years a Slave which went on to win an Oscar the following year.[34] The studio wanted him to do \"a production polish that deals with just honing the story and making it filmable.\"[32]Tom Hiddleston was originally considered for the title role, Judah Ben-Hur.[35] But Jack Huston was later cast in the title role.[36] On September 11, Morgan Freeman was added to the cast to play Sheik Ilderim, the man who teaches Ben-Hur to become a champion chariot racer.[37] On September 18, sources confirmed that Toby Kebbell was in early talks to play the villain, Messala.[38] On October 15, Gal Gadot was in talks to join the film for the female lead role as Esther, a slave with whom Ben-Hur is in love.[39] Pedro Pascal from the TV series Game of Thrones was in talks to play Pontius Pilate.[40] On October 30, TheWrap confirmed that Gadot's negotiations with Paramount and MGM had ended and the actress withdrew due to scheduling conflicts with Batman v Superman: Dawn of Justice.[41] On November 4, Marwan Kenzari was added to the cast as Druses, a Roman captain.[42] On November 11, Ayelet Zurer was in final negotiations to play Naomi, Judah Ben-Hur's mother[19] (Miriam in the book and the 1959 adaptation). On November 13, Olivia Cooke was being considered for Tirzah, Ben-Hur's sister.[43] On December 2, Nazanin Boniadi was confirmed to as Esther, winning the role over actresses Sofia Boutella, Moran Atias and Natalia Warner.[10] On January 12, 2015, Sofia Black D'Elia was cast in the film as Ben-Hur's sister, Tirzah, a role once offered to Cooke.[18] On January 13, Rodrigo Santoro was announced as Jesus.[13] On January 20, Moisés Arias was added to the cast to play Gestas, a teenage Jewish zealot who is desperate to fight for freedom after his family has been murdered by the Romans.[20] On January 21, Pilou Asbæk was cast as Pontius Pilate, replacing Pascal for the role.[22]On February 2, 2015, MGM and Paramount Pictures announced that principal photography had begun and that, like the original film, filming would take place in Italy, specifically in Rome and Matera.[4] The Sassi di Matera in Basilicata and the Cinecittà studios in Rome were also chosen among the film settings.[45][46] In most instances, CGI were used extensively. However, Bekmambetov wanted to rely more on practical effects and tried to do as little CGI as possible in moments where it wasn't heavily needed.[47][30] Producers Roma Downey and Mark Burnett chose Matera as a location for Jerusalem, one of the same locations where Mel Gibson's biblical pic The Passion of the Christ was filmed.[5] Exterior shooting finished in early April 2015 and lasted for two months.[48]Production then moved to Cinecittà Studios where interior shooting took place for four months including the chariot scene among others.[49][50] The famous chariot race sequence was originally planned to be filmed in the Circus Maximus arena in Rome where the original film was shot, however, producers were denied access by Italy's national cultural authorities due to fears that the stunts would damage the fragile historic site, which was under restoration at that time.[44][51] The decision was approved by locals as well as Rome's mayor, Ignazio Marino who lamented on the decision saying, \"The aim of the city administration isn't so much to raise revenue in exchange for the use of public space, but to give back to Rome the role of being a big international set, which is in our history and our tradition.\"[44] According to sources obtained by The Guardian, the decision to forbid Ben-Hur from filming there was due to \"technical\" issues.[44] Though no official reasons have been given, archaeological experts speculate that the influx of heavy filming vehicles and hundreds of extras to the arena could cause untold damage to the site.[52][53] However, the Italian cultural minister, Dario Franceschini declined to make any comments.[44] As a result, producers were forced to film the scene at Cinecittà Studios where much of the original film was also shot.[44] Howbeit, it is not clear whether the filmmakers had planned to use that location for the main chariot race, which is supposed to take place in Antioch, or if they were planning to shoot one of the earlier races that Judah Ben-Hur takes part in while he is still living in Rome.[48] In order to re-create the sequence, producers built 1,000-foot-long surface, with a track, stands, and gates. Unique chariots were also built based on original references. Around 86–90 horses were trained for several months, to be able to race.[30][54] Huston and Kebbell spent two and a half months preparing and rehearsing, to learn how to drive chariot races in Italy,[3] six days a week.[47] Stuntmen were only called in for extremely dangerous stunts. But overall, it was actors in the chariots.[30] A total of 20 chariots were used.[54] A bulk of scene was done using real practical stunts.[30] Bekmambetov's goal was to shoot these action scenes so realistically that the audience feels that they're in the chariot, driving.[55] Phil Neilson served as the stunt coordinator for the film who had previously worked on many films including Ridley Scott's Gladiator.[30] Shooting for this particular scene lasted for 45 days.[30] The inspiration for the use of minimal CGI for this sequence came from Hardcore Henry in which Bekmambetov was a producer.[56]","Box office":"The Hollywood Reporter placed it among the biggest summer box office risks of 2016.[78]","produced_by":"Sean Daniel Joni Levin Duncan Henderson","starring":"Jack Huston Toby Kebbell Rodrigo Santoro Nazanin Boniadi Ayelet Zurer Morgan Freeman","music_by":"Marco Beltrami","edited_by":"Dody Dorn","Release":"Ben-Hur was originally planned to be released on February 26, 2016 in the United States and Canada but Paramount later moved it to August 12, 2016.[70] At the 2016 CinemaCon, Paramount again shifted its release date a week later to August 19, 2016 and its previous date was occupied by Paramount's own Florence Foster Jenkins.[71][72] It will be released in regular 2D, 3D and Digital 3D.[73][74] It is scheduled to be released in the United Kingdom and Ireland on August 26, 2016 a week after its U.S. premiere.[75] According to Variety, this decision to switch from February to August may have been due to the studio's faith in summer being the best time to unspool a tentpole epic.[70] Deadline.com called the date a prime time for the studio after witnessing success with the release of Mission: Impossible – Rogue Nation and Teenage Mutant Ninja Turtles during the month of August. Furthermore, the site also highlighted that the 2016 Summer Olympics will be an ideal platform for the studio to promote the film and since mid-August has proven to be the last point of time in the summer for a film to accrue large amount of revenue before weekend box office performances drop from Labor Day holiday onwards.[76][77] Ben-Hur is the third consecutive tentpole from Paramount Pictures to be releasing in that corner following Teenage Mutant Ninja Turtles: Out of the Shadows (June 3) and Star Trek Beyond (July 22).[59]"}