{"based_on":"Me Two  by Edwin Davis","Cast":"In an interview, Martin described his sense of his character Roger Cobb: \"This man is not an idiot. He is a contemporary person with some brains, [...] he's not naive or a victim of circumstances. He's an intelligent man who happens to get caught in a disaster. That's a big difference between this role and any other part I've played. [...] For the first time I'm in a story with a beginning, middle, and end. It's old-fashioned and solid [...] This movie was like going to school. I learned a lot about structure and character.\"[2] He stated in Steve Martin: The Magic Years, \"My mature film career started with All of Me and ends with L.A. Story.\"[3]","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Phil Alden Robinson Henry Olek","Plot":"Dissatisfied 38-year-old attorney Roger Cobb (Martin) is dating his boss' daughter and is also an aspiring jazz guitarist. A difficult, eccentric millionairess named Edwina Cutwater (Tomlin) has been bedridden since childhood. Cutwater hires Roger to make some unusual final arrangements to her will.Having discovered she is dying, Edwina has enlisted the aid of a culture-shocked mystic named Prahka Lasa (Richard Libertini), who has mastered the secret of transferring human souls. She has made an arrangement with Terry Hoskins (Victoria Tennant), a beautiful young woman. Edwina wants her own soul placed in Terry's vacated body so that she can finally experience youth and health. Roger is to change Edwina's will so that Terry, her future self, is her sole beneficiary. Roger, unsurprisingly, believes the whole plan is \"bananas\".Edwina dies at the law office. The soul-transfer works, but the vase temporarily holding her soul falls out the window and hits Roger. Roger ends up with Edwina's soul sharing his body. She has control over the right side of his body and he the left. She causes him to lose both his girlfriend and his job. Besides being able to hear her thoughts, Roger talks to Edwina's image that appears in mirrors and other reflective surfaces. Their relationship gradually warms up, but both of them want Edwina out of his body. Terry, meanwhile, is shocked to learn that the soul-transference really works, as she only agreed to it to get Edwina's fortune. Terry tries to prevent Roger from reaching the holy man, but when he does, she refuses to cooperate.When Roger, Prahka and Roger's blind friend Tyrone Wattell (Jason Bernard) sneak into Terry's bedroom, she is waiting with a loaded gun. She intends to kill Roger and pass him off as an intruder, but Roger manages to gain the upper hand. Rather than go to jail for life as a three-time loser, Terry consents to having her soul placed into the body of her favorite horse and let Edwina take up residence in her body as originally planned. The final shot shows Roger and Edwina (who now resides in Terry's body) dancing together.","language":"English","Reception":"The film received a 91% Rotten Tomatoes score based on 35 reviews.[4][5] On release, The New York Times described the film: \"Some things simply have to be seen to be believed, and the sensational teamwork of Steve Martin and Lily Tomlin in All of Me is one of them [...] Mr. Martin's astonishing performance is the film's most conspicuous asset, but the entire cast is good.\"[5]","box_office":"$36,403,064","Remake":"In 2012, DreamWorks announced a remake of All of Me is in the works. Abby Kohn and Marc Silverstein will be writing, and John Davis will be producing.[7]","cinematography":"Richard H. Kline","production_company":"Thorn EMI Screen Entertainment Kings Road Entertainment","directed_by":"Carl Reiner","Following the film":"Steve Martin and Victoria Tennant met during the making of the film and were married in 1986, staying together until 1994.[3][6]","all_of_me":"Theatrical release poster","release_dates":"September 21, 1984 (1984-09-21)","TV series":"As of October 2015, NBC planned to develop a TV series of All of Me with Betsy Thomas serving as writer and executive producer/showrunner of the show.[8]","produced_by":"Stephen J. Friedman","starring":"Steve Martin|Lily Tomlin|Richard Libertini|Victoria Tennant|","running_time":"93 minutes","music_by":"Patrick Williams","edited_by":"Bud Molin"}