{"country":"United States","distributed_by":"Triumph Films","Plot":"A lonely boy named Michael Brower (Edward Furlong) lives an isolated existence in his absent father's mansion. Michael's mother was killed in a car accident, which also permanently injured his leg. He spends his spare time stalking his crush, a typical girl-next-door named Kimberly. A huge fan of horror films and video games, Michael's only friend is a similar-minded misfit named Kyle. Kyle tells Michael about a new, ultra-realistic game called Brainscan. Intrigued, Michael sends away for the first disc.During his first experience with the game, Michael is encouraged to act as a psychopathic murderer by the game's host, an entity known as Trickster. In-game, Michael murders a stranger and takes his foot as a trophy. Later, he is horrified to discover that his victim in the game was a real person, and that the same murder also happened in the real world. Kyle begs Michael to let him play the game, and Michael angrily rebuffs him. Later Michael is tormented by Trickster, who exits the game and plays a song by the musical group Primus in Michael's bedroom. Because he is a possible witness to the earlier murder, Trickster tells Michael he must kill Kyle, which he eventually does in-game.Michael doesn't remember Kyle's murder and calls his house. The phone is answered by a policeman, Detective Hayden (Frank Langella). Michael becomes paranoid that he will be sent to jail. He is also continually annoyed by the presence of Trickster, who refuses to leave his home. Trickster ultimately instructs him to kill Kimberly. At nightfall Michael sneaks into her room, but refuses to hurt her. Trickster reveals that he is actually the evil part of Michael. He possesses Michael, the struggle of which wakes Kimberly. Kimberly tells Michael that she loves him, which allows him to break free from his own inner darkness. At the last minute, the Trickster materializes and opens the bedroom door. Detective Hayden enters and shoots Michael dead.Michael awakens in his room. He discovers that the whole experience was a fantasy. He is excitedly realizes that Kyle is still alive and that nothing in the game happened in the real world. He goes over to Kimberly's and asks her out, which she replies with \"maybe\" before giving him a kiss.","language":"English","box_office":"$4,352,094","cinematography":"François Protat","production_company":"Admire Productions Ltd. Coral Productions","directed_by":"John Flynn","Soundtrack":"The film's soundtrack features a good deal of hard rock, grunge, and heavy metal from then-emerging bands. Amongst the bands featured on the soundtrack are Mudhoney, White Zombie, OLD, Dandelion, Primus, Tad, Pitchshifter and the Butthole Surfers. It also featured the film's main title theme from George S. Clinton's score.","brainscan":"Original theatrical poster","release_dates":"April 22, 1994 (1994-April-22)","Production":"John Flynn later recalled:The main interest for me was the Trickster character (a cadaverous Alice Cooper-like entity who materializes from a CD-ROM computer game - Ed.). The Trickster was the core of the movie and what attracted me to the script. We found this stage actor (T. Ryder Smith) to play the Trickster and he was extraordinary. Eddie Furlong was a 15-year-old kid who couldn’t act. You had to “slap him awake” every morning. I don’t want to get into knocking people, but I was not a big Eddie Furlong fan. [1]","produced_by":"Michel Roy","starring":"Edward Furlong Frank Langella T. Ryder Smith","running_time":"96 minutes","Critical Reception":"Critical reception was mostly negative. Rotten Tomatoes gave the film a \"Rotten\" rating of 18%, based on 11 reviews; conversely, the audience rated the film 61% \"Fresh\". Entertainment Weekly gave Brainscan a \"D\" rating, and stated \"Despite the lurid premise, Brainscan offers zero in the way of sick thrills\".[2]","music_by":"George S. Clinton","edited_by":"Jay Cassidy Phillip Linson","written_by":"Brian Owens Andrew Kevin Walker"}