{"country":"United Kingdom West Germany South Africa","distributed_by":"Constantin Film (Germany) Planet Films (UK)","Plot":"In an unnamed small British colony on the west coast of Africa, somewhat resembling The Gambia, two policemen patrolling a wharf sight a sack of peanuts dropped by stevedores. As the sack breaks the workers discover a pouch in it that is quickly grabbed by a man who then runs away. The policemen chase him and he eventually kills one of them before disappearing. Police Commissioner Sanders (Todd) questions Pearson (Bill Brewer), a suspected criminal, but finds no information.At the same time, a Dr. Jung (Koch) arrives at the airport and is met by Todd's assistant, Inspector Hamilton (Jeremy Lloyd). Dr. Jung is going to a German-run clinic up country, close to the colony's eastern border. Also on the plane with her is an American journalist (Robert Arden) who wishes to visit the clinic to do a story, and also turns out to be an old friend of Pearson.Commissioner Sanders begins to suspect the clinic as a location for smuggled diamonds from across the border.","Locations":"The film was shot in Durban, Durban North, Zululand and Lake St. Lucia.[3]","language":"English","death_drums_along_the_river":"DVD cover","cinematography":"Robert Huke","production_company":"Hallam Productions Constantin Film","directed_by":"Lawrence Huntington","release_dates":"20 December 1963 (1963-12-20) (Germany)|27 March 1965 (1965-03-27) (UK)||||","Production":"Harry Alan Towers was active in South Africa producing several films with West German financing from Constantin Film and a cast of West German actors.[1] The film has very little to do with Edgar Wallace's Sanders of the River except the name of Sanders and the boat Zaire (which is now a small motorboat rather than a steamer). The film was marketed in Germany as one of the then popular Edgar Wallace series of films.Richard Todd had been in Africa filming The Hellions and was attempting to produce a film of Ian Fleming's The Diamond Smugglers.[2]The intertribal warfare of Edgar Wallace's work and the 1935 British film has been replaced by a standard detective story involving murder and diamond smuggling. The fictional colony is not given a name, but in the spirit of the times Dr Jung asks Sanders what he'll do when it is granted independence. Sanders replies he'll stay on \"if they'll have me\".","produced_by":"Harry Alan Towers","starring":"Richard Todd Marianne Koch Albert Lieven Walter Rilla","running_time":"83 minutes","Sequel":"Todd would reprise the role of Harry Sanders in the follow-up film, Coast of Skeletons (1965).","music_by":"Sidney Torch","written_by":"Harry Alan Towers Lawrence Huntington Nicolas Roeg"}