{"country":"Italy France[1]","distributed_by":"Cineriz (Italy) Columbia Pictures (France) Embassy Pictures (US)","screenplay_by":"Federico Fellini Ennio Flaiano Tullio Pinelli Brunello Rondi","story_by":"Federico Fellini Ennio Flaiano","8½":"Original theatrical poster","Plot":"Guido Anselmi (Marcello Mastroianni), a famous Italian film director, is suffering from \"director's block\". Stalled on his new science fiction film that includes thinly veiled autobiographical references, he has lost interest amid artistic and marital difficulties.While attempting to recover from his anxieties at a luxurious spa, Guido hires a well-known critic (Jean Rougeul) to review his ideas for his film, but the critic blasts them as weak, intellectually spineless, and confusing. Meanwhile, Guido has recurring visions of an Ideal Woman (Claudia Cardinale), which he sees as key to his story. His vivacious mistress Carla (Sandra Milo) comes from Rome to visit him, but Guido puts her in a separate hotel and mostly ignores her.The film production crew relocates to Guido's hotel in an attempt to get him to work on the movie, but he evades his staff, ignores journalists, and refuses to make decisions, not even telling actors their roles. As the pressure mounts to begin filming, Guido retreats into childhood memories: spending the night at his grandmother's villa, dancing with a prostitute (Eddra Gale) on the beach as a schoolboy, and being punished by his strict Catholic school as a result. The film critic claims that these memories are too sentimental and ambiguous to be used in Guido's movie.Granted the rare opportunity to have a personal audience with a Cardinal in a steam bath (a scene which Guido plans to replicate in his movie), Guido admits that he isn't happy. The Cardinal responds with quotes from the catechism and offers little insight into his condition.Guido invites his estranged wife Luisa (Anouk Aimée) and her friends to join him. They dance, suggesting that the couple still has a chance to reconcile, but Guido abandons her for his production crew. The crew tours the steel infrastructure of a life-sized rocket ship set built on the beach, and Guido confesses to his wife's best friend Rosella (Rossella Falk) that he wanted to make a movie that was pure and honest, but he is struggling with something honest to say.Carla surprises Guido, Luisa, and Rosella outside the hotel, and Guido claims that he and Carla ended their affair years ago. Luisa and Rosella call him on the lie, and Guido slips into a fantasy world where he lords over a harem of women from his life. They bathe him (like at his grandmother's villa) and spray him with powder, but a rejected showgirl starts a rebellion. The fantasy women attack Guido with harsh truths about himself and his sex life, and Guido literally whips them back into shape.Fed up with delays, the producer (Guido Alberti) forces Guido to review his many screen tests, but Guido still won't make any decisions. The screen tests are for roles portrayed earlier in 8½, such as Carla, the prostitute, the Cardinal, etc. When Luisa sees how bitterly Guido chooses to represent her in the movie, she flees the theater, declaring that their marriage is over since Guido is unable to deal with the truth.But Guido's Ideal Woman arrives in the form of an actress named Claudia. Guido takes her to visit a proposed set, explaining that his movie is about a burned-out man who finds salvation in this Ideal Woman. Claudia listens intently, but concludes that the protagonist is unsympathetic because he is incapable of love.Broken, Guido calls off the film, but the producer and the film's staff announce a massive press conference at the rocket ship set. Guido attempts to escape from the frenzied journalists, and when pressed for a statement, he instead crawls under a table and shoots himself in the head.The crew begins to disassemble the rocket ship, since the film is canceled. The critic praises Guido for making a wise decision, and Guido has a revelation— he was attempting to solve his personal confusion by creating a film to help others, when instead he needs to accept his life for what it is. He asks Luisa for her assistance in doing so, and she says she'll try.A group of musical clowns, led by a young Guido, transform the rocket ship set into a circus, leading the men and women of Guido's life down the steps of the set. Shouting through a megaphone, Guido directs them into a circus ring, and Carla tells him that she figured out what he was trying to say— that Guido can't do without the people in his life. The men and women hold hands and run around the circle, Guido and Luisa joining them last.","language":"Italian French English German","Reception":"First released in Italy on 14 February 1963, Otto e mezzo received virtually unanimous acclaim, with reviewers hailing Fellini as \"a genius possessed of a magic touch, a prodigious style\".[12] Italian novelist and critic Alberto Moravia described the film's protagonist, Guido Anselmi, as \"obsessed by eroticism, a sadist, a masochist, a self-mythologizer, an adulterer, a clown, a liar and a cheat. He's afraid of life and wants to return to his mother's womb.... In some respects he resembles Leopold Bloom, the hero of James Joyce's Ulysses, and we have the impression that Fellini has read and contemplated this book. The film is introverted, a sort of private monologue interspersed with glimpses of reality.... Fellini's dreams are always surprising and, in a figurative sense, original, but his memories are pervaded by a deeper, more delicate sentiment. This is why the two episodes concerning the hero's childhood at the old country house in Romagna and his meeting with the woman on the beach in Rimini are the best of the film, and among the best of all Fellini's works to date\".[13]Reviewing for Corriere della Sera, Giovanni Grazzini underlined that \"the beauty of the film lies in its 'confusion'... a mixture of error and truth, reality and dream, stylistic and human values, and in the complete harmony between Fellini's cinematographic language and Guido's rambling imagination. It is impossible to distinguish Fellini from his fictional director and so Fellini's faults coincide with Guido's spiritual doubts. The osmosis between art and life is amazing. It will be difficult to repeat this achievement.[14] Fellini's genius shines in everything here, as it has rarely shone in the movies. There isn't a set, a character or a situation that doesn't have a precise meaning on the great stage that is 8½\".[15] Mario Verdone of Bianco e Nero insisted the film was \"like a brilliant improvisation.... The film became the most difficult feat the director ever tried to pull off. It is like a series of acrobats [sic] that a tightrope walker tries to execute high above the crowd,... always on the verge of falling and being smashed on the ground. But at just the right moment, the acrobat knows how to perform the right somersault: with a push he straightens up, saves himself and wins\".[16]8½ screened at the 1963 Cannes Film Festival in April to \"almost universal acclaim\"[17] and was Italy's official entry in the later 3rd Moscow International Film Festival where it won the Grand Prize. French film director François Truffaut wrote: \"Fellini's film is complete, simple, beautiful, honest, like the one Guido wants to make in 8½\".[18] Premier Plan critics André Bouissy and Raymond Borde argued that the film \"has the importance, magnitude, and technical mastery of Citizen Kane. It has aged twenty years of the avant-garde in one fell swoop because it both integrates and surpasses all the discoveries of experimental cinema\".[19] Pierre Kast of Les Cahiers du Cinéma explained that \"my admiration for Fellini is not without limits. For instance, I did not enjoy La strada but I did I vitelloni. But I think we must all admit that 8½, leaving aside for the moment all prejudice and reserve, is prodigious. Fantastic liberality, a total absence of precaution and hypocrisy, absolute dispassionate sincerity, artistic and financial courage these are the characteristics of this incredible undertaking\".[20]Released in the United States on 25 June 1963 by Joseph E. Levine, who had bought the rights sight unseen, the film was screened at the Festival Theatre in New York in the presence of Fellini and Marcello Mastroianni. The acclaim was unanimous with the exception of reviews by Judith Crist, Pauline Kael, and John Simon. Crist \"didn't think the film touched the heart or moved the spirit\".[17] Kael derided the film as a \"structural disaster\" while Simon considered it \"a disheartening fiasco\".[21][22] Newsweek defended the film as \"beyond doubt, a work of art of the first magnitude\".[17] Bosley Crowther praised it in the New York Times as \"a piece of entertainment that will really make you sit up straight and think, a movie endowed with the challenge of a fascinating intellectual game.... If Mr. Fellini has not produced another masterpiece –another all-powerful exposure of Italy's ironic sweet life –he has made a stimulating contemplation of what might be called, with equal irony, a sweet guy\".[23] Archer Winsten of The New York Post interpreted the film as \"a kind of review and summary of Fellini's picture-making\" but doubted that it would appeal as directly to the American public as La Dolce Vita had three years earlier: \"This is a subtler, more imaginative, less sensational piece of work. There will be more people here who consider it confused and confusing. And when they do understand what it is about –the simultaneous creation of a work of art, a philosophy of living together in happiness, and the imposition of each upon the other, they will not be as pleased as if they had attended the exposition of an international scandal\".[24] Audiences, however, loved it to such an extent that a company attempted to obtain the rights to mass-produce Guido Anselmi's black director's hat.[21]Fellini biographer Hollis Alpert noted that in the months following its release, critical commentary on 8½ proliferated as the film \"became an intellectual cud to chew on\".[25] Philosopher and social critic Dwight Macdonald, for example, insisted it was \"the most brilliant, varied, and entertaining movie since Citizen Kane\".[25] In 1987, a group of thirty European intellectuals and filmmakers voted Otto e mezzo the most important European film ever made.[26] In 1993, Chicago Sun-Times film reviewer Roger Ebert wrote that \"despite the efforts of several other filmmakers to make their own versions of the same story, it remains the definitive film about director's block\".[27] It came number two on the 1992 and 2002 Sight & Sound Director's Poll beaten only by Citizen Kane. 8½ is a fixture on the British Film Institute's Sight & Sound critics' and directors' polls of the top ten films ever made. It ranked number two on the magazine's 2002 Directors' Top Ten Poll and number eight on the Critics' Top Ten Poll.[6] and stayed within the top ten, but slightly lower in the 2012 poll (number four on the 2012 directors' poll[28] and ten on the 2012 critics' poll).[29] Director Martin Scorsese also listed it as one of his favourite films of all time.[30]","Themes":"8½ is about the struggles involved in the creative process, both technical and personal, and the problems artists face when expected to deliver something personal and profound with intense public scrutiny, on a constricted schedule, while simultaneously having to deal with their own personal relationships. It is, in a larger sense, about finding true personal happiness in a difficult, fragmented life. Like several Italian films of the period (most evident in the films of Fellini's contemporary, Michelangelo Antonioni), 8½ also is about the alienating effects of modernization.[31]The title is in keeping with Fellini's self-reflexive theme: the making of his eighth-and-a-half film.[32] His previous six feature films included Lo sceicco bianco (1952), I vitelloni (1953), La strada (1954), Il bidone (1955), Le notti di Cabiria (1957), and La Dolce Vita (1960). With Alberto Lattuada, he co-directed Luci del varietà (Variety Lights) in 1950. His two short segments included Un'Agenzia Matrimoniale (A Marriage Agency) in the 1953 omnibus film L'amore in città (Love in the City) and Le Tentazioni del Dottor Antonio from the 1962 omnibus film Boccaccio '70. The working title for 8½ was La bella confusione (The Beautiful Confusion) proposed by co-screenwriter, Ennio Flaiano, but Fellini then \"had the simpler idea (which proved entirely wrong) to call it Comedy\".[33]According to Italian writer Alberto Arbasino, Fellini's film used similar artistic procedures and had parallels with Musil's 1930 novel The Man Without Qualities.[34]","box_office":"$3.5 million (rentals)[2]","cinematography":"Gianni Di Venanzo","production_company":"Cineriz Francinex","directed_by":"Federico Fellini","Awards":"8½ won two Academy Awards for Best Foreign Language Film and Best Costume Design (black-and-white) while garnering three other nominations for Best Director, Best Original Screenplay, and Best Art Direction (black-and-white).[39] The New York Film Critics Circle also named 8½ best foreign language film. The Italian National Syndicate of Film Journalists awarded the movie all seven prizes for director, producer, original story, screenplay, music, cinematography, and best supporting actress (Sandra Milo). It also garnered nominations for Best Actor, Best Costume Design, and Best Production Design.At the Saint Vincent Film Festival, it was awarded Grand Prize over Luchino Visconti's Il gattopardo (The Leopard). The film screened in April at the 1963 Cannes Film Festival[40] to \"almost universal acclaim but no prize was awarded because it was shown outside the competition. Cannes rules demanded exclusivity in competition entries, and 8½ was already earmarked as Italy's official entry in the later Moscow festival\".[41] Presented on 18 July 1963 to an audience of 8,000 in the Kremlin's conference hall, 8½ won the prestigious Grand Prize at the 3rd Moscow International Film Festival[42] to acclaim that, according to Fellini biographer Tullio Kezich, worried the Soviet festival authorities: the applause was \"a cry for freedom\".[21] Jury members included Stanley Kramer, Jean Marais, Satyajit Ray, and screenwriter Sergio Amidei.[43]","release_dates":"14 February 1963 (1963-02-14)|||||","Production":"When shooting began on 9 May 1962, Eugene Walter recalled Fellini taking \"a little piece of brown paper tape\" and sticking it near the viewfinder of the camera. Written on it was Ricordati che è un film comico (\"Remember that this is a comic film\").[8] 8½ was filmed in the spherical cinematographic process, using 35-millimeter film, and exhibited with an aspect ratio of 1.85:1.As with most Italian films of this period, the sound was entirely dubbed in afterwards; following a technique dear to Fellini, many lines of the dialogue were written only during post production, while the actors on the set mouthed random lines. Otto e mezzo marks the first time that actress Claudia Cardinale was allowed to dub her own dialogue; previously her voice was thought to be too throaty and, coupled with her Tunisian accent, was considered undesirable.[9]In September 1962, Fellini shot the end of the film as initially written: Guido and his wife sit together in the restaurant car of a train bound for Rome. Lost in thought, Guido looks up to see all the characters of his film smiling ambiguously at him as the train enters a tunnel. Fellini then shot an alternative ending set around the spaceship on the beach at dusk but with the intention of using the scenes as a trailer for promotional purposes only. In the documentary Fellini: I'm a Born Liar, co-scriptwriter Tullio Pinelli explains how he warned Fellini to abandon the train sequence with its implicit theme of suicide for an upbeat ending.[10] Fellini accepted the advice, using the alternate beach sequence as a more harmonious and exuberant finale.[11]","produced_by":"Angelo Rizzoli","starring":"Marcello Mastroianni Claudia Cardinale Anouk Aimée Sandra Milo","running_time":"138 minutes","Influence":"Later in the year of the film's 1963 release, a group of young Italian writers founded Gruppo '63, a literary collective of the neoavanguardia composed of novelists, reviewers, critics, and poets inspired by 8½ and Umberto Eco's seminal essay, Opera aperta (Open Work).[35]\"Imitations of 8½ pile up by directors all over the world\", wrote Fellini biographer Tullio Kezich.[36] The following is Kezich's short-list of the films it has inspired: Mickey One (Arthur Penn, 1965), Alex in Wonderland (Paul Mazursky, 1970), Beware of a Holy Whore (Rainer Werner Fassbinder, 1971), La Nuit américaine (\"Day for Night\") (François Truffaut, 1974), All That Jazz (Bob Fosse, 1979), Stardust Memories (Woody Allen, 1980), Sogni d'oro (Nanni Moretti, 1981), Parad Planet (Vadim Abdrashitov, 1984), La Pelicula del rey (Carlos Sorin, 1986), Living in Oblivion (Tom DiCillo, 1995), 8½ Women (Peter Greenaway, 1999), Other films include Synecdoche, New York (Charlie Kaufman, 2008) and The Great Beauty (Paolo Sorrentino, 2013).The Tony-winning 1982 Broadway musical, Nine (score by Maury Yeston, book by Arthur Kopit) is based on the film, underscoring Guido's obsession with women by making him the only male character. The original production, directed by Tommy Tune starred Raul Julia as Guido, Anita Morris as Carla, Liliane Montevecchi as Liliane LaFleur, Guido's producer and Karen Akers as Luisa. A 2003 broadway revival starred Antonio Banderas, Jane Krakowski, Mary Stuart Masterson and Chita Rivera. It was made into a film in 2009, directed by Rob Marshall and starring Daniel Day-Lewis as Guido alongside Nicole Kidman, Marion Cotillard, Judi Dench, Selma Hayak and Sophia Loren.[37]The 1993 music video for R.E.M.'s song \"Everybody Hurts\" draws heavily from 8½'s opening dream sequence, with the band stuck in a traffic jam. Subtitles of the thoughts of people trapped inside cars appear on screen until everyone abandons their vehicle to walk instead; then they vanish.The European Network of Young Cinema NISI MASA was named after the phrase \"Asa Nisi Masa\" in 8½.In 2010, the film was ranked #62 in Empire magazine's \"The 100 Best Films Of World Cinema\".[38]","music_by":"Nino Rota","edited_by":"Leo Catozzo"}