{"country":"United States","distributed_by":"Columbia Pictures","Plot":"After seventeen years of marriage, affluent Los Angeles suburban couple Richard Harmon (Van Dyke) and his wife Barbara (Reynolds) seem to have it all, but they're constantly bickering. When they discover they can no longer communicate, even to argue, they make an effort to salvage their relationship through counseling. But after catching each other emptying their joint bank accounts (at the urging of friends), they file for divorce.Richard finds himself living in a small apartment and trying to survive on $87.30 a week. His take-home income has been cut to ribbons by high alimony. Richard meets a recently divorced man, Nelson Downes (Robards), who introduces him to ex-wife Nancy (Simmons). Nelson wants to marry off Nancy to be free of his alimony burden, so that he can marry his pregnant fiancee. Nancy also wishes to marry because she is lonely.Since Richard now cannot afford to be remarried, Nelson and Nancy plot to set up Barbara with a millionaire auto dealer, Big Al Yearling (Johnson).Barbara begins a relationship with Big Al, but the night before the Harmon divorce becomes final, all of the principal characters meet to celebrate the success of their plans. At a nightclub, a hypnotist pulls Barbara from the audience and puts her into a trance. After inducing her into performing a mock striptease, she instructs Barbara to kiss her true love. Barbara plants one on Richard, and just like that their marriage problems are resolved.Nelson, not to be deterred, immediately tries to get Nancy interested in Big Al.","divorce_american_style":"Theatrical poster","language":"English","Reception":"The film earned an estimated $5,150,000 in North American rentals in 1967.[3]In his review in the Chicago Sun-Times, Roger Ebert called the film \"a member of that rare species, the Hollywood comedy with teeth in it\" and added, \"Bud Yorkin has directed with wit and style, and the cast, which seems unlikely on paper, comes across splendidly on the screen . . . The charm of this film is in its low-key approach. The plot isn't milked for humor or pathos: Both emerge naturally from familiar situations.\"[4]Variety observed, \"Comedy and satire, not feverish melodrama, are the best weapons with which to harpoon social mores. An outstanding example is Divorce American Style . . . which pokes incisive, sometimes chilling, fun at US marriage-divorce problems.\"[5]New York Times film critic Bosley Crowther disliked the film, saying that \"it is rather depressing, saddening and annoying, largely because it does labor to turn a solemn subject into a great big American-boob joke.\" Crowther criticized Van Dyke's performance, remarking that \"He is too much of a giggler, too much of a dyed-in-the-wool television comedian for this serio-comic husband role.\"[6]A more recent review in Time Out New York cites \"Two or three very funny scenes . . . and a first-rate batch of supporting performances.\"[7]","box_office":"$12,000,000[1]","cinematography":"Conrad L. Hall","production_company":"Tandem Productions","directed_by":"Bud Yorkin","Awards and honors":"Norman Lear and Robert Kaufman were nominated for the Academy Award for Best Original Screenplay but lost to William Rose for Guess Who's Coming to Dinner. Lear also was nominated for the Writers Guild of America Award for Best Written American Comedy.","release_dates":"June 21, 1967 (1967-06-21)|||||","produced_by":"Norman Lear","starring":"Dick Van Dyke Debbie Reynolds Jason Robards Jean Simmons","running_time":"109 minutes","music_by":"Dave Grusin","edited_by":"Ferris Webster","written_by":"Norman Lear Robert Kaufman"}