{"country":"United States","distributed_by":"Warner Bros.","Plot":"A junkman (Frank Otto) does business with the Dead End Kids: Frankie (Billy Halop), Squirt (Bobby Jordan), Spike (Leo Gorcey), Goofy (Huntz Hall), Fats (Bernard Punsly), and Bugs (Gabriel Dell). When the boys ask for a $20 payoff, \"Junkie\" says \"Five is all you'll get. Now take it and get out of here.\" In a rage, Spike strikes the man in the back of the head with a hard object, and the junkman falls to the floor and doesn't move. When Judge Clinton (Charles Trowbridge) cannot convince the boys to divulge which one struck the damaging blow, they are all sent to reform school.The harsh warden of the reformatory, Morgan (Cy Kendall), inflicts discipline at the school and flogs Frankie after he tries to escape. The superintendent of the state reformatories, Mark Braden (Humphrey Bogart), visits the school and finds evidence of Morgan's subtle cruelty, as in feeding his new inmates poor-quality food. He then visits Frankie in the hospital ward, finding him untreated and the doctor inebriated. As a way of starting over, he fires the doctor, Morgan, and four ex-convict guards, while retaining the head guard, Cooper (Weldon Heyburn). Braden takes charge of the reformatory himself and wins over the boys' cooperation by considerate treatment, while romancing Frankie's sister, Sue Warren (Gale Page).Meanwhile, Cooper is afraid that Braden will learn of Morgan's embezzlement of the food budget, which would implicate him as well. He learns that Spike is the one who dealt the blow to the junkman and blackmails him. He gets him to tell Frankie that Braden's generous treatment is due to his sister's acceptance of Braden's attentions. Although untrue, it causes the kids to escape from the school in Cooper's car with his gun. They go to Sue's apartment, and Frankie climbs the fire escape with the gun to confront Braden, but Sue and Braden dispel Frankie's suspicions.Meanwhile, Cooper \"discovers\" that the kids have escaped, and Morgan calls the press to discredit Braden and get him fired. But, Braden drives the boys back to the reformatory and gets them into their beds, before the Commissioner (Frank Jaquet), alerted by Morgan, arrives for an inspection with the police in tow. Their plot foiled and their fraud uncovered, Morgan and Cooper are arrested. The boys are subsequently paroled into the care of their parents.","language":"English","cinematography":"Arthur Todd","directed_by":"Lewis Seiler","Home media":"Warner Archives released the film on made to order DVD in the United States on August 4, 2009.","crime_school":"Theatrical release poster","release_dates":"May 28, 1938 (1938-05-28) (U.S.)|||||","produced_by":"Bryan Foy","starring":"Humphrey Bogart Gale Page Billy Halop Bobby Jordan Huntz Hall Leo Gorcey Bernard Punsly Gabriel Dell Charles Trowbridge","running_time":"86 minutes","music_by":"Max Steiner","edited_by":"Terry Morse","written_by":"Crane Wilbur Vincent Sherman"}