{"based_on":"Aquamarine  by Alice Hoffman","country":"United States","distributed_by":"20th Century Fox","aquamarine":"Theatrical release poster","Plot":"Best friends Hailey Rogers (JoJo) and Claire Brown (Emma Roberts) are upset to know that they will be separated in five days as Hailey has to move to Australia because of her mother's (Claudia Karvan) job. Claire, sensible and slightly naive, looks up to Hailey as a mother figure in some ways, since her parents drowned in a boat accident years before. She now lives with her grandparents by the beach near Hailey, who is more daring and adventurous, in a small Florida town.One night while the girls have a slumber party, Hailey wishes for a miracle that will make her mother change her mind about moving. Minutes later, a violent storm occurs. The following morning, Claire accidentally slips into the local beach club swimming pool and notices something strange under the water with blue hair and a tail. She tries to tell herself it was only a figment of her imagination since she's been afraid of water ever since her parents died, but Hailey convinces Claire to come back and explore it later that night. When they do, they find a mermaid named Aquamarine (Sara Paxton). They instantly become friends and Aquamarine tells the girls that she needs to prove to her father that true love exists or she'll be made to get married to a man she doesn't know when she returns home. She also explains that if you help a mermaid, you get a wish.Aquamarine immediately sets her eyes on Raymond (Jake McDorman), a handsome lifeguard who Hailey and Claire have had a crush on for years. They are reluctant at first but know it is their last hope, so they agree to help her. However, because Aquamarine isn't human, she doesn't understand that people don't just love one another instantly, and is rejected by Raymond when they first meet. Still, the girls promise to make Raymond fall in love with Aquamarine over the next three days. They use strategies found in teenage magazines, and proceed to stalk Raymond around town so he can notice Aquamarine more and more.At a street fair, Raymond spends the day with Aquamarine. While enjoying a paddleboat ride, he mentions that he wants to see her at a party, The Last Splash, the following night, but she flees before she can give him an answer knowing a sunset can cause her legs to transform back into a tail. Claire and Hailey show Aquamarine a water tower for her to spend the night in, and promise to visit her the next day. In the morning, the three take a bus to Tampa to buy new outfits for the party.For years, Hailey and Claire have had disagreements with a more popular group of girls, especially Cecilia Banks (Arielle Kebbel) who also has a crush on Raymond. Cecilia lies and tells him that the reason Aquamarine left so soon is to be with her boyfriend, so Raymond invites Cecilia to the party instead. Later that day, Claire goes to find Raymond to tell him that Cecilia made the whole thing up, and he and Aquamarine reconcile. At the party, Aquamarine and Raymond bond more, and before she flees again because of another sunset, she kisses him and asks him to meet her on the pier in the morning. When the three girls leave the party, Cecilia follows them to the water tower and discovers Aquamarine's secret. She unhooks the ladder so Aquamarine is unable to get down and calls the news so they can expose her on national television. However, in the night, the town's mysterious handyman Leonard (Bruce Spence) helps her out and promises to tell nobody what he knows. Aquamarine grants him a wish for helping her out.After three days are up, although he cares for her a lot, Raymond still has not fallen in love with Aquamarine. They meet on the pier where Cecilia interrupts and pushes Aquamarine into the ocean. Aquamarine's father calls her back home in a giant storm, but Hailey and Claire swim after her after she tries to defy her father again. They discover the meaning of platonic love and Aquamarine's father is satisfied knowing love is real, and the girls receive their wish. They decide to not use it to keep Hailey from moving away, and instead they part ways with Aquamarine, with promises that they will remain friends despite their distance from each other.","language":"English","Reception":"Aquamarine received mixed reviews; as of February 2015, it holds a 51% rating on Rotten Tomatoes, with the consensus \"A lighthearted, gum-smacking, boy-crazy film with a hopeful message for young girls.\"[2] On Metacritic, which uses an average of critics' reviews, the film holds 51/100, indicating \"mixed or average reviews\".[3]In its opening weekend the film grossed $7,482,669 in 2,512 theaters, ranking #5 at the box office. By the end of its run, Aquamarine grossed $18,597,342 domestically and $4,409,507 internationally for a worldwide total of $23,006,849.[1]","box_office":"$23,006,849[1]","cinematography":"Brian Breheny","production_company":"Storefront Pictures","directed_by":"Elizabeth Allen","Home media":"The film was released June 13, 2006, on Region 1 DVD, and Blu-Ray on March 6, 2012.","Soundtrack":"Two of the film's main stars, Emma and Sara, were also featured on the soundtrack however JoJo, an accomplished singer with one album out did not take part. In 2008, La La Land Records released a limited edition CD (1000 pressings) of David Hirschfelder's score (incorporating the voice of Sara Paxton) for the film.","release_dates":"March 3, 2006 (2006-03-03) (United States)|||||","produced_by":"Susan Cartsonis","starring":"Emma Roberts Joanna Levesque Sara Paxton Jake McDorman Arielle Kebbel","running_time":"110 minutes","music_by":"David Hirschfelder","edited_by":"Jane Moran","written_by":"Jessica Bendinger John Quaintance","budget":"$12 million[1]"}