{"based_on":"Theatre  by W. Somerset Maugham","country":"Canada United States Hungary","distributed_by":"Sony Pictures Classics","Plot":"Set in London in 1938, the film focuses on highly successful and extremely popular theatre actress Julia Lambert (Annette Bening), whose gradual disillusionment with her career as she approaches middle age has prompted her to ask her husband, stage director Michael Gosselyn (Jeremy Irons), and his financial backer Dolly de Vries (Miriam Margolyes) to close her current production to allow her time to travel abroad. They persuade her to remain with the play throughout the summer; and Michael introduces her to Tom Fennel (Shaun Evans), an enterprising American, who confesses his deep appreciation of her work. Seeking the passion missing from her marriage, and anxious to fill the void left when her close friend Lord Charles (Bruce Greenwood) suggested they part ways to avoid scandalous gossip, Julia embarks on a passionate affair with the young man and begins to support him so he may enjoy the glamorous lifestyle to which she has introduced him. Their relationship revives her, sparking a distinct change in her personality. Always hovering in the background and offering counsel is the spirit of her mentor, Jimmie Langton (Michael Gambon), the theatrical manager who gave Julia her start and made her a star, while flesh-and-blood Evie (Juliet Stevenson) serves as her personal maid, dresser, and confidante.Michael suggests they invite Tom to spend time at their country estate, where he can become better acquainted with their son Roger (Tom Sturridge). At a party there, Tom meets aspiring actress Avice Crichton (Lucy Punch), and, when Julia sees him flirting with the pretty young woman, she becomes jealous and anxious and angrily confronts him. He slowly reveals himself to be a callous, social-climbing, gold-digging gigolo, and Julia is shattered when their affair comes to an end.Avice, now romantically involved with Tom, asks him to bring Julia to see her perform in a play in the hope the actress will induce her husband to cast her in a supporting role in Julia's upcoming project. The play is dreadful, and Avice is not much better. Backstage, Julia compliments her even-worse co-star and barely acknowledges Avice, although she promises to tell Michael about her. Afterwards, she forces Tom to admit he loves Avice, then - although her heart is broken by his admission - she assures him she will insist the ingenue be cast in her next play.When Julia's performance in her current play begins to suffer from her personal discontent, Michael closes the production; and Julia visits her mother (Rosemary Harris) and her Aunt Carrie (Rita Tushingham) in Jersey, where Lord Charles comes to visit her. Julia suggests a romantic tryst, and he gently tells her that he's gay. Meanwhile, back in London, Avice auditions for Michael; and, although Julia resents it, she is given the role.Julia returns home to begin rehearsals for the new play. Shortly after, she learns from her son that Avice has been one of Michael's casual trysts. Still, she is uncharacteristically solicitous toward the girl, making suggestions that place her in the spotlight and insisting her own wardrobe be drab to allow Avice to shine. What her director and fellow cast members don't realize is there's a method to her seeming madness - Julia has planned her sweet revenge for the opening night performance, during which she successfully affirms her position as London theatre's foremost diva by upstaging every aspect of her performance.","language":"English","Critical reception":"Being Julia has received fairly positive reviews, with Bening receiving acclaim for her performance, and an average score of 65/100 at the review aggregator Metacritic.[2]In his review in the New York Times, A.O. Scott called the film \"a flimsy frame surrounding a brightly colored performance by Annette Bening, whose quick, high-spirited charm is on marvelous display . . . She gives Being Julia a giddy, reckless effervescence that neither Mr. Szabo's stolid direction nor Ronald Harwood's lurching script . . . are quite able to match . . . Ms. Bening walks right up to the edge of melodramatic bathos (the hallmark of the kind of plays in which Julia stars) and then, in a wonderful climactic coup de théâtre, turns it all into farce. Being Julia may not make much psychological or dramatic sense, but Ms. Bening, pretending to be Julia (who is always pretending to be herself), is sensational.\"[3]Roger Ebert of the Chicago Sun-Times said, \"Annette Bening plays Julia in a performance that has great verve and energy, and just as well, because the basic material is wheezy melodrama. All About Eve breathed new life into it all those years ago, but now it's gasping again . . . I liked the movie in its own way, while it was cheerfully chugging along, but the ending let me down; the materials are past their sell-by date and were when Maugham first retailed them. The pleasures are in the actual presence of the actors, Bening most of all, and the droll Irons, and Juliet Stevenson as the practical aide-de-camp, and Thomas Sturridge, so good as Julia's son that I wonder why he wasn't given the role of her young lover.\"[4]In the San Francisco Chronicle, Carla Meyer described the film as \"a one-woman show\" and added, \"There are several notable actors in it, most of them quite good, but it's the glorious Annette Bening who hoists this flawed production on her mink-wrapped shoulders and makes it work . . . Her stage background at American Conservatory Theater shows in her multilayered tour de force.\"[5]Todd McCarthy of Variety observed, \"Annette Bening has fun running the vast gamut of her emotions, be they authentic or manufactured. But Istvan Szabo's new film, like the W. Somerset Maugham novel upon which it's based, is a minor affair, a confection based on dalliances and the way a set of sophisticated theater people handle them, that lacks true distinction . . . Working in a much lighter vein than usual, Szabo has said he studied the films of Ernst Lubitsch and Billy Wilder in preparation for this picture. Unfortunately, Being Julia has little to do with the specifically Viennese strain of wise and winkingly cynical romantic comedy perfected by those two masters of the sexual charade and nearly everything to do with the world of pre-war London theater. This is a film that, above all else, needed to be steeped in Britishness, in the very particular mores and manners of the time; as a Canadian production mostly shot in Budapest by a Hungarian director and an American star and a number of Canuck thesps, this just doesn't happen. The deficiencies may be intangible, but they deprive film of the solid footing it requires . . . The majority of the seriocomic doings, while superficially diverting, provide neither indelible wit nor the gravitas of a genuinely meaningful comedy of manners (see Oscar Wilde), leaving a relatively wispy impression in its wake.\"[6]In Rolling Stone, Peter Travers awarded the film two out of a possible four stars and commented, \"Annette Bening can act - watch American Beauty or Bugsy or The Grifters - but she works too hard to prove it in Being Julia . . . Director Istvan Szabo overplays his hand and traps [her] in a role that's all emoting, no emotion.\"[7]Mark Kermode of The Observer said, \"Annette Bening makes a claim for an Oscar nomination . . . Chewing up the scenery in lipsmacking form, she savours the ribald dialogue like an overripe wine, spitting venom and self-pity in equally bilious measures, lending much needed weight to this contrived fluff.\"[8]","box_office":"US$14,339,171","cinematography":"Lajos Koltai","directed_by":"István Szabó","Production notes":"Filming began in June 2003. Exteriors were shot on location in London and Jersey. Interiors were filmed in Budapest, including inside the Danubius Hotel Astoria, and Kecskemét in Hungary.The soundtrack features a number of popular songs of the era, including \"They Didn't Believe Me\" by Jerome Kern and Herbert Reynolds; \"Life is Just a Bowl of Cherries\" by Lew Brown and Ray Henderson; \"Mad About the Boy\" by Noël Coward; \"I Get a Kick Out of You\" by Cole Porter; \"She's My Lovely\" by Vivian Ellis; \"Bei Mir Bist Du Schon\" by Sholom Secunda, Jacob Jacobs, Sammy Cahn, and Saul Chaplin; and \"Smoke Gets in Your Eyes\" by Otto A. Harbach and Jerome Kern.The film premiered at the Telluride Film Festival and was shown at the Toronto Film Festival, the San Sebastián Film Festival, the Vancouver International Film Festival, the Calgary Film Festival, and the Chicago International Film Festival before opening in the US in limited release.The film grossed $7,739,049 in the US and $6,600,122 in foreign markets for a total worldwide box office of $14,339,171.[1]","release_dates":"October 15, 2004 (2004-10-15)|||||","produced_by":"Robert Lantos","starring":"Annette Bening Jeremy Irons Shaun Evans","running_time":"104 minutes","being_julia":"Original poster","music_by":"Mychael Danna","edited_by":"Susan Shipton","written_by":"Ronald Harwood","budget":"US$18 million"}