{"country":"United States","distributed_by":"Esperanza Films The Samuel Goldwyn Company","screenplay_by":"John Sayles","Plot":"The film tells the story of Nick Rinaldi (Vincent Spano), who has spent his life in one New Jersey city, getting a free ride from his well-connected father (Tony LoBianco) and hearing the locals talk of his brother's death in Vietnam. As Rinaldi searches for more self-control, he quits the contractor's job provided by his father, feeling that major events are about to happen in his life. By the film's ending, his life will change, as will the lives of many others.","language":"English","Reception":"Film critic Roger Ebert wrote, \"City of Hope is a powerful film, and an angry one. It is impossible not to find echoes of its despair on the front pages every day. It asks a hard question: Is it possible for a good person to prevail in a corrupt system, just simply because right is on his side? The answer, in the short run, is that power is stronger than right. The notion of a long run, of course, is all that keeps hope alive.\"[3]The staff at Variety magazine wrote, \"John Sayles' ambitious, wide-ranging study of corruption and community in a small Eastern city has as many parallel plots and characters as Hill Street Blues, while at the same time having a richness of theme and specificity of vision more common to serious cinema.\"[4]Film critics Frederic and Mary Ann Brussat wrote about the varied aspects of the film, writing, \"Through the diverse activities of over three dozen characters in this film, we see some of the major challenges of urban living including crime, political chicanery, the patronage system, the demise of the work ethic, the rapacious side of capitalism, and the high cost of civic apathy. City of Hope helps us see that community is enriched or torn apart by the ethical decisions we make every day.\"[5]The review aggregator Rotten Tomatoes reported that 93% of critics gave the film a positive review, based on fifteen reviews.\"[6]WinsNominations","city_of_hope":"Theatrical release poster","box_office":"$1.3 million (US).[1]","cinematography":"Robert Richardson","production_company":"Esperanza Films The Samuel Goldwyn Company","directed_by":"John Sayles","release_dates":"October 11, 1991 (1991-10-11) (Boston New York City)|||||","Distribution":"The producers used the following tagline to market the film:The film premiered in Baltimore, Boston, and New York City, on October 11, 1991 and debuted in Los Angeles on October 25, 1991.The film was screened at various film festivals, including: the Deauville Film Festival, France; the Tokyo International Film Festival, Japan; and others.","produced_by":"Harold Welb John Sloss","starring":"Vincent Spano|Tony Lo Bianco|Joe Morton|Todd Graff|David Strathairn|Anthony John Denison|Barbara Williams|Angela Bassett|Gloria Foster|Lawrence Tierney|","running_time":"129 minutes","music_by":"Mason Daring","edited_by":"John Sayles","budget":"$3 million[1]"}