{"country":"United States","distributed_by":"New Line Cinema","screenplay_by":"Barry Michael Cooper Jeff Pollack","story_by":"Jeff Pollack Benny Medina","above_the_rim":"Theatrical release poster","Plot":"Kyle Watson (Duane Martin) is a talented basketball player who is about to graduate from high school. While he waits to find out if he will receive a scholarship to Georgetown University he finds himself in a difficult dilemma over a playground basketball tournament. He must decide whether to play for and follow his widely beloved basketball coach or Birdie (Tupac Shakur), a local thug in the neighborhood. Thomas \"Shep\" Sheppard (Leon Robinson) a former standout player himself, now works as a high school security guard. Kyle feels resentment towards the security guard, because Kyle's own mother is falling in love with Shep.Coincidentally, Kyle's coach also wants Shep to coach his team when he feels it is time for him to retire. It is later revealed to Kyle that Shep is Birdie's older brother. Kyle makes a decision to run with Birdie's team until he decided to come back to his old team, because of Birdie's wrongful actions against a local Flip and Kyle's friend Bugaloo (Marlon Wayans). In the tournament, both Kyle's and Birdie's teams march to the finals, with Kyle's team playing solid team basketball, while Birdie's team plays a very thuggish style. Before the finals, Birdie threatens Kyle, demanding Kyle to throw away the game so that Birdie's team would win. Kyle is brutalized throughout the game, with Birdie's team having a solid lead, and is injured. Shep, unable to watch anymore, steps in the game in Kyle's place - despite being aggressively attacked throughout, Shep helps the team come back, and in the final seconds, passes the ball to Kyle, who hits the game winner. After the loss, Birdie orders Motaw (Wood Harris), his star player and gang member, to kill Kyle. Shep protects Kyle and is shot, while Motaw is shot dead by security. Birdie is later killed by Bugaloo as revenge for previous humiliations. In the end, Kyle is revealed to have gotten the scholarship to Georgetown University - during a televised game, Kyle hits the game winner, while a recovered Shep watches with a smile.","language":"English","Reception":"The film was released on March 23, 1994, grossing $3,738,800 on opening weekend. At the end of its theatrical run, it had grossed a total of $16,192,320.1995 MTV Movie AwardsIt holds a 53% rating on Rotten Tomatoes, based on 19 reviews. Peter Travers stated \"It's Shakur who steals the show. The rapper's offscreen legal problems are well known, but there's no denying his power as an actor.\" Variety said \"A fine cast and the movie's general energy can't overcome that mix of cliches and technical flaws, which should conspire to prevent any high flying at the box office.\"[3]","box_office":"$16,192,320[1]","directed_by":"Jeff Pollack","release_dates":"March 23, 1994 (1994-03-23)|||||","Production":"The movie was filmed in 1993. Allen Payne was the original choice to portray Kyle Watson, but was rejected by Pollack in favor of Duane Martin.","produced_by":"James D. Brubaker Benny Medina Jeff Pollack","starring":"Duane Martin Leon Robinson Tupac Shakur Bernie Mac Tonya Pinkins David Bailey Marlon Wayans","running_time":"96 minutes","budget":"$6.5 million"}