{"country":"France","distributed_by":"Focus Features","language":"English Japanese Mongolian Afrikaans","Reception":"Babies received generally positive reviews. 69% of ninety-one reviews on the site Rotten Tomatoes favored the film. The site's consensus is that \"Babies is a joyous celebration of humankind that's loaded with adorable images, but it lacks insight and depth.\"[4] The film received a score of sixty-three on Metacritic. Owen Gleiberman, a reviewer for Entertainment Weekly, called Babies a crowd-pleaser and gave it a \"B\".[5] Katey Rich of Cinema Blend called the film \"brilliantly simple\".[6]","cinematography":"Jérôme Alméras Frazer Bradshaw Steeven Petitteville","production_company":"StudioCanal","directed_by":"Thomas Balmès","release_dates":"7 May 2010 (2010-05-07)|16 June 2010 (2010-06-16) (France)||||","Box office":"With the widest release in 543 theaters(Domestic) the film grossed $7,320,323 at Domestic box office and $2,175,039 at Foreign box office for a worldwide gross of $9,495,362.[7]","baby":"Theatrical release poster","produced_by":"Alain Chabat","starring":"Ponijao Bayar(jargal) Mari Hattie","running_time":"79 minutes","Summary":"The documentary opens showing how Ponijao comes into the world in a modest hut after her mother rubs some red pigment all over her pregnancy-swollen belly. Hattie, on the other hand, arrives in a state-of-the-art birthing center surrounded by medical equipment and technicians. Another scene shows Bayar being born and tightly swaddled in a hospital, before heading off with his parents and a sibling on a motorcycle to the rural area where the family lives. Other highlights include Mari's tantrum when she is frustrated with a toy, Hattie getting bored during an organized play session, Bayar taking a bath while a goat comes to drink from the same water, and Ponijao fighting with a sibling when they are playing on the ground.The documentary shows the contrasts of the four cultures without using any form of narration, leaving it to the viewers to take from the film what they want.","music_by":"Bruno Coulais","External links":"","edited_by":"Reynald Bertrand Craig McKay"}