{"based_on":"August: Osage County  by Tracy Letts","country":"United States","distributed_by":"The Weinstein Company","screenplay_by":"Tracy Letts","Plot":"The title designates time and location: an unusually hot August in a rural area outside Pawhuska, Oklahoma. Beverly Weston (Sam Shepard), an alcoholic, once-noted poet, interviews and hires a young native American woman Johnna (Misty Upham) as a live-in cook and caregiver for his strong-willed and contentious wife Violet (Meryl Streep), who is suffering from oral cancer and addiction to narcotics. Shortly after this, he disappears from the house, and Violet calls her sister and daughters for support. Her sister Mattie Fae (Margo Martindale) arrives with husband Charles Aiken (Chris Cooper). Violet's middle daughter Ivy (Julianne Nicholson) is single and the only one living locally; Barbara (Julia Roberts), her oldest, who has inherited her mother's mean streak, arrives from Colorado with her husband Bill (Ewan McGregor) and 14-year-old daughter Jean (Abigail Breslin). Barbara and Bill are separated, but they put up a united front for Violet.After five days, the sheriff arrives with the news that Beverly took his boat out on the lake and has drowned. Youngest daughter Karen (Juliette Lewis) arrives with the latest in a string of boyfriends, Steve Huberbrecht (Dermot Mulroney), a sleazy Florida businessman whom she introduces as her fiancé. Mattie Fae and Charles's shy, awkward son \"Little Charles\" (Benedict Cumberbatch) misses the funeral because he overslept and is met at the bus station by his father. Charles loves his son, whereas Mattie constantly belittles him. Ivy confides to Barbara that she is in love with her cousin, Little Charles, who plans to move to New York, and she cannot have children because she had a hysterectomy. She feels this is her only chance to finally marry.The family sits down to dinner after the funeral, fueled by Violet's brutal \"truth telling\", which results in Barbara pouncing on her mother. She decides she has had enough of her mother's drug addiction and confiscates all her several kinds of pills. Later, after Violet has had a chance to sober up, she has a tender moment with her daughters and shares a story that demonstrates how cruel her own mother was when she longed for a new pair of cowgirl boots when she was in her early teens.As Little Charles sings Ivy a song he has written for her, Mattie Fae walks in and berates him. This exhausts Charles's patience with his wife's lack of love and compassion for her son, and he threatens to leave her if she keeps it up. Mattie subsequently reveals to Barbara, who unintentionally listened in, that she had a long-ago affair with Beverly, and Charles is in fact their younger half-brother and that is the true reason why Ivy and \"Little Charles\" cannot be together.That evening, Steve and Jean are playfully sharing a joint of marijuana. Johnna sees this and, sensing that he intends on molesting her, goes after him with a shovel. Barbara confronts Jean and slaps her. This impels Bill to take Jean back to Colorado, leaving Barbara. Karen also leaves with Steve.Later, Ivy tries to tell her mother about her love for Little Charles. Barbara tries to deflect the admission. Violet tells Ivy Charles is actually her brother, something she knew all along. Ivy leaves and promises to never come back. In the last confrontation between Violet and Barbara, Violet admits she was contacted by Beverly from his motel the week after he had left home, but did nothing to help him until after she removed money from the couple's joint safe deposit box. By this time he had already drowned. This revelation leads Barbara to depart. Violet is left with only Johnna.Barbara is driving through the plains, stops, gets out of the car, cries then gets back in the car and follows signage showing highways and number of miles to Salina and Denver.","language":"English","box_office":"$74,188,937[3]","cinematography":"Adriano Goldman","production_company":"Jean Doumanian Productions Smokehouse Pictures Battle Mountain Films Yucaipa Films","directed_by":"John Wells","Soundtrack":"Gustavo Santaolalla composed the original music for August: Osage County. The soundtrack was released on January 7, 2014 through Sony Classical.[38]An album of Santaolalla's score was released digitally on January 3, 2014.[39]","august:_osage_county":"Theatrical release poster","release_dates":"September 9, 2013 (2013-09-09) (TIFF)|December 27, 2013 (2013-12-27) (United States)||||","Production":"John Wells directed,[6] while Bob and Harvey Weinstein, Steve Traxler, Jean Doumanian, and George Clooney produced the film.[7][8] Renée Zellweger and Andrea Riseborough were considered for a role. Riseborough was cast but dropped out due to scheduling conflicts. Juliette Lewis replaced her.[9] Chloë Grace Moretz also auditioned for the role of Jean Fordham.[10]Principal photography took place between October 16 and December 8, 2012,[8] in Bartlesville and Pawhuska, Oklahoma, and Los Angeles, California.","produced_by":"George Clooney Grant Heslov Jean Doumanian Steve Traxler","starring":"Meryl Streep Julia Roberts Ewan McGregor Chris Cooper Abigail Breslin Benedict Cumberbatch Juliette Lewis Margo Martindale Dermot Mulroney Julianne Nicholson Sam Shepard Misty Upham","running_time":"120 minutes[1]","music_by":"Gustavo Santaolalla","edited_by":"Stephen Mirrione","Release":"August: Osage County premiered at the 2013 Toronto International Film Festival[11][12] on September 9, 2013, before its release in select cities on December 27, 2013, followed by a wide release on January 10, 2014, in the United States. It was also released on January 1, 2014, in Australia. In its limited box-office debut, the film grossed $179,475 from five theaters, a $35,895 per-screen average.[13]August: Osage County received mixed-to-positive reviews with the entire cast being praised for their performances, especially Streep and Roberts. Review aggregator Rotten Tomatoes sampled 177 reviews, and as of February 8, 2015, the film holds a 64% approval rating, with an average score of 6.4/10. The website's consensus reads, \"The sheer amount of acting going on in August: Osage County threatens to overwhelm, but when the actors involved are as talented as Meryl Streep and Julia Roberts, it's difficult to complain.\" There was also significant praise for the performances of Chris Cooper, Margo Martindale, Juliette Lewis, and Julianne Nicholson, with some critics stating that this film gives the finest ensemble acting seen in years.[14] Another review aggregator, Metacritic, which assigns a weighted mean rating out of 100 to reviews from mainstream critics, calculated an average score of 58, based on 45 reviews, considered to be \"mixed or average reviews\".[15]","budget":"$25 million[2]"}