{"country":"India","distributed_by":"R. K. Films, Chembur","Plot":"Judge Raghunath is a wealthy district judge who convicts Jagga, a man whose father was a criminal, of rape on little evidence. The judge believes that \"good people are born to good people, and criminals are born to criminals.\" Jagga later escapes and kidnaps the judge's wife Leela for revenge. When he finds out that she has just become pregnant, he releases her after four days and plans a different kind of revenge. The judge suspects that Leela was unfaithful to him with Jagga, and throws her out of the house.She has a son, Raj, and they live in poverty as a result of being estranged from the father. As a child, Raj befriends Rita in school, but he is removed from the school rolls while trying to maintain a job, and Rita moves to another city. Even though they are separated, Rita remains in Raj's thoughts. On the streets, Raj turns to a life of petty crime and finds a father-figure in Jagga, who helps him to become a talented criminal.While planning a bank robbery with his friends, Raj realises they need an automobile. He snatches a woman's purse after she steps out of the car, but finds no keys, and pretends to pursue the thief to release suspicion from himself. After his elaborate act, he returns the purse to the woman, who is soon revealed to be Rita. Rita is now a ward of the Judge, who suspects that Raj is no good and eventually restricts Rita from seeing him. Raj and Rita, who is becoming a lawyer, eventually realise that they are the same childhood friends, and they fall in love. Raj tries to quit his life of crime, but his employers fire him when they find out that he was a thief.Becoming desperate he goes back to Jagga for a money loan, but Jagga wants him to commit more crimes. Raj refuses, but steals a necklace from a man he meets on the street, not knowing it was the judge. When he gives the necklace to Rita for her birthday, she discover that he is indeed a thief. Rita goes to Raj's mother and finds out the whole truth about his life.When Raj realises that Jagga is responsible for his mother's misery, he kills Jagga in a fit of rage. At his trial the judge in the case is Raghunath. Rita persuades him that Raj acted in self-defense. However, when Raj learns that the judge is his father, he escapes and attempts to kill him. Due to these actions, Raj is brought to another court, and is defended by Rita. In the end, Raj is sentenced to 3 years in prison for his crime, but Rita promises to wait for him.","language":"Hindi","Reception":"It was entered into the 1953 Cannes Film Festival,[10] where it was nominated for the Grand Prize of the Festival.[5]In 2003, Time magazine included it in a list of \"10 Indian Films to Treasure\".[11] Time magazine also chose Raj Kapoor's performance in Awaara as one of the top ten greatest performances of all time.[12] In 2005, Indiatimes Movies ranked the movie amongst the \"Top 25 Must See Bollywood Films\", writing, \"Whenever Raj Kapoor and Nargis came together on screen, sparks flew. Their chemistry was electrifying and it crackles with raw passion in Raj Kapoor's Awaara. Nargis's wild and carefree sensuality pulsates and Raj Kapoor's scruffy hair-rebellious persona only adds fuel to the fire\".[13] The TIME magazine included the film among the 20 new entries added to All-Time 100 greatest films in 2012.[14][15][16]In India, the film grossed a record of over Rs.12 million. This record was later beaten the next year by Aan.In the Soviet Union, Awaara is estimated to have drawn between 40 and 63 million viewers to cinemas across the nation. It remained the most successful Indian film in the Soviet Union up until films like Bobby, Seeta Aur Geeta and Disco Dancer achieved a similar level of success there.[2]The film was also a success in China, where the song \"Awaara Hoon\" and actor Raj Kapoor became widely known across the nation, much like in the Soviet Union. The film's success in both the Soviet Union and China has been attributed to the socialist themes expressed in the film.[3][4] The film Awaara and the song \"Awaara Hoon\" are believed to have been Chairman Mao's favourite film and song, respectively.[4][12] In more recent years, Awaara was referenced in the 2000 Chinese film Platform.[17]Due to the film's remarkable success with Turkish audiences, Awaara was remade in Turkey as Avare (1964) starring the Turkish actor Sadri Alışık, along with actress Ajda Pekkan.[18]","cinematography":"Radhu Karmakar","production_company":"All India Film Corporation, R. K. Films","directed_by":"Raj Kapoor","Soundtrack":"The music for this film was composed by Shankar Jaikishan while the songs were written by Shailendra and Hasrat Jaipuri. The soundtrack was listed by Planet Bollywood as number 3 on their list of 100 Greatest Bollywood Soundtracks.[7]","release_dates":"1951","Production":"The film is a collaboration of the famous team of director/producer Kapoor and writer Khwaja Ahmad Abbas. KA Abbas originally wanted Mehboob Khan to direct the film but the two disagreed over the casting. Khan wanted Ashok Kumar to play the judge and Dilip Kumar the son. In the event, Abbas withdrew his script from Mehboob Studios and Raj Kapoor decided to direct it.[8]The scene with the song \"Ghar Aaya Mera Pardesi\" is considered the first dream sequence in Indian cinema, with its sea of twirling clouds symbolising the conflicts in the lead character's mind.[9]","produced_by":"Raj Kapoor","starring":"Prithviraj Kapoor Nargis Raj Kapoor Leela Chitnis K.N.Singh Shashi Kapoor","running_time":"193 minutes","music_by":"Shankar-Jaikishan","written_by":"Khwaja Ahmad Abbas V.P. Sathe"}