{"distributed_by":"Gravitas Ventures","Plot":"Brooklynite Shirin, the daughter of well-off Persian immigrants, is left homeless and jobless after her girlfriend Maxine breaks up with her. With the encouragement of her friend Crystal she moves in with strange roommates and gets a new job teaching 5 year old Park Slope children the art of movie making.Shirin's parents are confused as to why Maxine move out of her old apartment as Shirin has never told them she was bisexual and dating a woman. Determined to get her life back on track Shirin begins trying to follow Maxine hoping to rekindle their relationship. After seeing Maxine is now dating Tibet, a fellow teacher at the Park Slope school where she works Shirin realizes that they are never going to get back together she devotes herself to her work and comes out to her brother who is mostly supportive, and her mother, who is in denial.On the subway Shirin tells Crystal that she plans to bring up the issue of her sexuality up with her mother again in a month. She sees Maxine outside the subway car on the platform and the two women wave goodbye to one another.","Accolades":"","language":"English","Reception":"Review aggregator Rotten Tomatoes reports a 98% of positive responses from the critics.[5] On Metacritic, which assigns a weighted mean rating out of 100 reviews from film critics, the film holds an average score of '75', based on 16 reviews, indicating a 'generally favorable' response.[6]David Rooney in his review for The Hollywood Reporter praised the film by saying that \"The promise of fresh cultural perspectives gives way to a more amorphous slice of contemporary romantic angst comedy.\"[7] Ryan Gilbey wrote in the New Statesman that Akhavan is \"a whiz at writing characters whose life seems to extend beyond their brief screentime.\"[5] Katie Walsh of Indiewire grade the film B+ by saying that \"Funny, unique, and entirely inappropriate, Appropriate Behavior is a supremely satisfying and irreverent take on the New York rom-com.\"[8]","cinematography":"Chris Teague","production_company":"Parkville Pictures","directed_by":"Desiree Akhavan","release_dates":"January 18, 2014 (2014-01-18) (Sundance)|January 16, 2015 (2015-01-16) (USA)||||","produced_by":"Cecilia Frugiuele","starring":"Desiree Akhavan|Rebecca Henderson|Scott Adsit|Halley Feiffer|","running_time":"90 minutes","appropriate_behavior":"UK film poster","music_by":"Josephine Wiggs","edited_by":"Sara Shaw","written_by":"Desiree Akhavan"}