{"based_on":"Decalogue VI  by Krzysztof Kieślowski","a_short_film_about_love":"Theatrical release poster","country":"Poland","distributed_by":"Film Polski","Plot":"Nineteen-year-old Tomek (Olaf Lubaszenko) is living in an apartment complex in Warsaw with his godmother—staying in her son's room while he's away. Raised in an orphanage, the shy Tomek has few friends and works as a postal clerk. Tomek has been spying on a beautiful older woman, Magda (Grazyna Szapolowska), who lives in an adjacent apartment complex. Using a telescope, he watches her every night performing mundane tasks, working on her artwork, and entertaining men. To get closer to her, he slips fake postal notices in her mailbox for a nonexistent money order at his post office. He also calls her anonymously to hear her voice. Tomek's obsession is focused more on her everyday activities rather than her sex life; when he sees her becoming sexual with men, he trains the telescope away and does not watch.Tomek learns there is a problem with the milk deliveries for Magda's apartment complex, so he takes the delivery job to be closer to her. One night he sees her return home after breaking up with her latest boyfriend, spilling a bottle of milk, and then weeping over another failed relationship. Later, Tomek asks his godmother, \"Why do people cry?\" After receiving another fake postal notice, Magda has a confrontation with the postmistress who accuses her of extortion. When Magda walks away upset, Tomek follows her and admits that he has been leaving the fake postal notices, that he saw her crying, and that he's been watching her. That night, Magda arranges her bed so that Tomek can see her with another boyfriend. When they're in bed, she tells him that they're being watched by someone across the way. The boyfriend rushes down to the street, calls out to Tomek who comes downstairs, and then punches him in the face for peeping.The next day, while delivering milk to Magda, Tomek admits that he loves her and that he expects nothing in return. Overwhelmed by his feelings, Tomek rushes up to the roof of the building, and then returns to Magda's apartment and asks her for a date—and she accepts. An elated Tomek races through the courtyard with his milkcart. During their date at a cafe, Magda learns that Tomek has been watching her for a year and that he stole letters mailed to her by an old boyfriend. At first she's upset, but then she dismisses it saying, \"What does it matter.\" In response to his earlier declaration of love, she tells him that love doesn't exist—only sex. She shows him how to caress her hands the way lovers do.Later that night at her apartment, after she showers and changes into a short bathrobe, he gives her a small gift, but she says she's not a good person and doesn't deserve gifts. Crouching in front of him, she guides his hands onto her thighs and he has an orgasm. Magda says, \"Love ... that's all it is.\" After Tomek rushes out of her apartment embarrassed and upset, Magda feels guilty and tries to communicate to him at her window—gesturing for him to call her and holding up a sign that reads, \"Come back. Sorry.\" But there is no response. Back in his apartment, Tomek cuts his wrists with a razor blade. Later, Magda comes to Tomek's apartment to return the coat he left behind and learns from his godmother that he tried to kill himself and was taken to a hospital. Magda tells her, \"I think I hurt him.\" Tomek's godmother shows her Tomek's room and his telescope and tells her, \"He's fallen in love with you.\" When asked if he's \"fallen for the wrong woman,\" Magda responds, \"Yes.\"In the coming days, Magda is unable to find Tomek—she is clearly worried and concerned about his wellbeing. One night, she receives a phone call, and thinking it is Tomek, she acknowledges that he was right about love (the call is actually from someone with phone trouble). After days of waiting and watching Tomek's window with her small binoculars, she finally sees he's returned. Magda goes to Tomek's apartment and his godmother shows her to his room where she sees Tomek sleeping, his wrists still bandaged. The godmother prevents her from getting too close to him—even preventing her from touching his bandaged wrist.[Note 1] Noticing the telescope, Magda looks through it toward her own apartment and imagines what Tomek must have seen that night, watching her come home, spilling the milk, and weeping over another failed relationship. Then she closes her eyes and imagines Tomek in her apartment with her, reaching out to comfort her—and she smiles.","language":"Polish","Reception":"A Short Film About Love received very positive critical reviews, with many of the critics noting that the film points to Kieslowski's later masterworks. In his review in The New York Times, Stephan Holden wrote that the film \"which has rich, subtly shaded performances by Mr. Lubaszenko and Miss Szapolowska, has a bleak eloquence.\"[6]In his review in the San Francisco Chronicle, Edward Guthmann called the film \"well-crafted and satisfying\" and prefigured Kieślowski's film Three Colors: Red.[7]Also reviewing at the San Francisco Chronicle, Gary Kamiya wrote, \"Kieslowski has crafted a compelling portrait of love, that weed that forces its strange way through life's hardest cement.\"[8]In his review on Cinema Sights, James Blake Ewing called the film \"a complex and perplexing examination of a simple rule\" and praised outcome:It's this synthesis of emotionally powerful storytelling and cinematic overdrive that makes A Short Film About Love such an unforgettable and unrelenting experience on every level. By the end, you’ve been rocked about and blown away by the power of the piece. And yet, somehow, it’s with a grace. Kieslowski doesn’t bring you down with a sledgehammer blow, but by softly and slowly picking away until he breaks you down.[9]On the aggregate reviewer web site Rotten Tomatoes, the film received a 100% positive rating from top film critics based on 13 reviews, and a 93% positive audience rating based on 5,273 reviews.[10]","cinematography":"Witold Adamek","production_company":"Zespol Filmowy \"Tor\"","directed_by":"Krzysztof Kieślowski","Remakes":"A Short Film About Love was remade in Hindi in the 2002 film Ek Chhotisi Love Story.","release_dates":"October 21, 1988 (1988-10-21) (Poland)|||||","Production":"The film is based on Kieślowski's Decalogue VI, with minor changes and expansions to the script. The most significant change is to the ending, which was rewritten at the suggestion of lead actress Grażyna Szapołowska, who wanted the film to have a \"fairytale ending\".[5] The original version ends with Tomek back at work, recovered from his attempted suicide, and telling Magda that he does not watch her anymore. The film ends with Magda's more developed concern for Tomek mirroring his earlier obsession with her. The film concludes in Tomek's room after his return from hospital. She looks through his telescope into her own apartment and Kieślowski replays an earlier scene of Magda crying in her kitchen, which had led Tomek to reveal his feelings to her, only this time she is joined and comforted by Tomek. Like Kieślowski's other Decalogue films, it features the mysterious angelic Man in White.","produced_by":"Ryszard Chutkowski","starring":"Grażyna Szapołowska|Olaf Lubaszenko|","running_time":"86 minutes","music_by":"Zbigniew Preisner","edited_by":"Ewa Smal","written_by":"Krzysztof Piesiewicz|Krzysztof Kieślowski|"}