{"country":"United States","distributed_by":"Paramount Pictures","Legacy":"Towne's screenplay has become legendary among critics and filmmakers, often cited as one of the best examples of the craft.[9][24][25] Polanski decided on the fatal final scene, changing Towne's idea of a happy ending.Chinatown brought more public awareness to the land dealings and disputes over water rights, which arose while drawing Los Angeles' water supply from the Owens Valley in the 1910s.[26] Margaret Leslie Davis, in her 1993 book Rivers in the Desert: William Mulholland and the Inventing of Los Angeles, says the sexually charged film is a metaphor for the \"rape\" of the Owens Valley and notes that it fictionalizes Mulholland, while concealing the strong public support for Southern California's water projects.","Plot":"A woman identifying herself as Evelyn Mulwray hires private investigator J. J. \"Jake\" Gittes to surveil her husband, Hollis Mulwray, chief engineer for the Los Angeles Department of Water and Power. Gittes tails him, hears him publicly oppose the creation of a new reservoir, and shoots photographs of him with a young woman, which are published on the front page of the following day's paper. Back at his office, Gittes is confronted by a woman who informs him she is the real Evelyn Mulwray, and that he can expect a lawsuit.Realizing he was set up, Gittes assumes that Mulwray's husband is the real target. Before he can question him, Lieutenant Lou Escobar fishes Mulwray, drowned, from a freshwater reservoir. Under retainer to Mrs. Mulwray, Gittes investigates his suspicions of murder and notices that, although huge quantities of water are released from the reservoir every night, the land is almost dry. Gittes is warned off by Water Department Security Chief Claude Mulvihill and a henchman, who slashes Gittes's nose. Back at his office, Gittes receives a call from Ida Sessions, who identifies herself as the imposter Mrs. Mulwray. She is afraid to identify her employer, but tells Gittes to check the day's obituaries.Gittes learns that Mulwray was once the business partner of his wife's wealthy father, Noah Cross. Over lunch at his personal club, Cross warns Gittes that he does not understand the forces at work, and offers to double Gittes's fee to search for Mulwray's missing mistress. At the hall of records, Gittes discovers that much of the Northwest Valley has changed ownership. Investigating the valley, he is attacked by angry landowners, who believe he is an agent of the water department attempting to force them out by sabotaging their water supply.Gittes deduces that the water department is drying the land so it can be bought at a reduced price, and that Mulwray was murdered when he discovered the plan. He discovers that a former retirement home resident is one of the valley's new landowners, and seemingly purchased the property a week after his death. Evelyn and Gittes bluff their way into the home and confirm that the real estate deals are surreptitiously completed in the names of its residents.After fleeing Mulvihill and his thugs, Gittes and Evelyn hide at Evelyn's house and sleep together. Early in the morning, Evelyn has to leave suddenly; she warns Gittes that her father is dangerous. Gittes follows her car to a house, where he spies her through the windows comforting Mulwray's mistress. He accuses Evelyn of holding the woman against her will, but she confesses that she is her sister.The next day, an anonymous call draws Gittes to Ida Sessions's apartment; he finds her murdered and Escobar waiting for his arrival. Escobar tells him the coroner's report found salt water in Mulwray's lungs, indicating that he did not drown in the freshwater reservoir. Escobar suspects Evelyn of the murder and tells Gittes to produce her quickly. At Evelyn's mansion, Gittes finds her servants packing her things. He realizes her garden pond is salt water and discovers a pair of bifocals in it. He confronts Evelyn about her \"sister\"; after Gittes slaps her, she admits that the woman, Katherine, is her sister and her daughter: her father raped her when she was fifteen. She says that the eyeglasses are not Mulwray's, as he did not wear bifocals.Gittes arranges for the women to flee to Mexico and instructs Evelyn to meet him at her butler's home in Chinatown. He summons Cross to the Mulwray home to settle their deal. Cross admits his intention to annex the Northwest Valley into the City of Los Angeles, then irrigate and develop it. Gittes accuses Cross of murdering Mulwray. Cross takes the bifocals and he and his men force Gittes at gunpoint to drive them to the women. When they reach the Chinatown address, the police are already there and detain Gittes. When Cross approaches Katherine, Evelyn shoots him in the arm and drives away with Katherine. The police open fire, killing Evelyn. Cross clutches Katherine and leads her away, while Escobar orders Gittes released. Lawrence Walsh, one of Gittes's associates, tells him: \"Forget it, Jake. It's Chinatown.\"","chinatown":"Theatrical release poster by Jim Pearsall","language":"English","Reception":"The film earned $17 million at the box office outside North America, which Evans said was a million dollars more than it earned in North America.[19]The film holds a 98% \"Certified Fresh\" rating on Rotten Tomatoes with 60 reviews. The site's critical consensus reads, \"As bruised and cynical as the decade that produced it, this noir classic benefits from Robert Towne's brilliant screenplay, director Roman Polanski's steady hand, and wonderful performances from Jack Nicholson and Faye Dunaway.\"[20] Metacritic assigned a rating of 86 out of 100, based on 10 critics, indicating \"universal acclaim\".[21]Roger Ebert added it to his \"Great Movies\" list, saying that Nicholson's performance was \"key in keeping Chinatown from becoming just a genre crime picture\", along with Towne's screenplay, concluding that the film \"seems to settle easily beside the original noirs\".[22] Vincent Canby of The New York Times was not impressed with the screenplay as compared to the film's predecessors, saying: \"Mr. Polanski and Mr. Towne have attempted nothing so witty and entertaining, being content instead to make a competently stylish, more or less thirties-ish movie that continually made me wish I were back seeing The Maltese Falcon or The Big Sleep\", but noted Nicholson's performance, calling it the film's \"major contribution to the genre\".[23]","Historical background":"In his 2004 film essay and documentary Los Angeles Plays Itself, film scholar Thom Andersen lays out the complex relationship between Chinatown’s script and its historical background:Robert Towne took an urban myth about the founding of Los Angeles on water stolen from the Owens River Valley and made it resonate. Chinatown isn’t a docudrama, it’s a fiction. The water project it depicts isn’t the construction of the Los Angeles Aqueduct, engineered by William Mulholland before the First World War. Chinatown is set in 1938, not 1905. The Mullholland-like figure—\"Hollis Mulwray\"—isn’t the chief architect of the project, but rather its strongest opponent, who must be discredited and murdered. Mulwray is against the “Alto Vallejo Dam” because it’s unsafe, not because it’s stealing water from somebody else…. But there are echoes of Mullholland’s aqueduct project in Chinatown…. Mullholland’s project enriched its promoters through insider land deals in the San Fernando Valley, just like the dam project in Chinatown. The disgruntled San Fernando Valley farmers of Chinatown, forced to sell off their land at bargain prices because of an artificial drought, seem like stand-ins for the Owens Valley settlers whose homesteads turned to dust when Los Angeles took the water that irrigated them. The “Van Der Lip Dam” disaster, which Hollis Mulwray cites to explain his opposition to the proposed dam, is an obvious reference to the collapse of the Saint Francis Dam in 1928. Mullholland built this dam after completing the aqueduct and its failure was the greatest man-made disaster in the history of California. These echoes have led many viewers to regard Chinatown, not only as docudrama, but as truth—the real secret history of how Los Angeles got its water. And it has become a ruling metaphor of the non-fictional critiques of Los Angeles development.[18]In the film, the fictional “Alto Vallejo Dam” is being built (in 1938) ostensibly to redirect water from the San Fernando Valley to LA, but in reality as a “con job” to create an artificial drought which will drive down land prices so that the dispossessed settlers’ land can be re-sold to secret investors “for peanuts”. In history, the Los Angeles Aqueduct (Owens Valley aqueduct) was built (between 1908 and 1913) to supply water from the Owens Valley (about 175 miles away) to LA and did exactly that. In the film, the fictional “Van Der Lip Dam” disaster is cited by Hollis Mulwray to explain his opposition to the proposed “Alto Vallejo Dam”. The “Van Der Lip Dam” is a fictionalized Saint Francis Dam which was built (1924-1926) to supplement the LA Aqueduct’s Owens Valley water with additional water from about 40 miles away from LA. There was no ambitious water project (dam or aqueduct) in the late 1930s paralleling the fictional “Alto Vallejo Dam” of the movie and conspiratorially driving farmers off their land. The authentic historical echo, however, was that—a generation before—Mullholland’s aqueduct did enrich its promoters through insider land deals in the San Fernando Valley, which was thereafter readily supplied with water from the Owens Valley. (The San Fernando Valley, incidentally, is mostly within the city limits of LA.) This coincided with another consequence of the aqueduct, the ruination of the Owens Valley settlers whose homesteads failed when much of their irrigation water was taken away.","box_office":"$29.2 million (North America)[3]","cinematography":"John A. Alonzo","production_company":"Paramount-Penthouse Long Road Productions","directed_by":"Roman Polanski","Awards and honors":"The film won one Academy Award of the eleven total nomination categories:[27][28]American Film Institute recognition","release_dates":"June 20, 1974 (1974-06-20)|||||","Production":"In 1971 producer Robert Evans offered Towne $175,000 to write a screenplay for The Great Gatsby (1974), but Towne felt he could not better the F. Scott Fitzgerald novel. Instead, Towne asked for $25,000 from Evans to write his own story, Chinatown, to which Evans agreed.[7][8]Chinatown is set in 1937 and portrays the manipulation of a critical municipal resource—water—by a cadre of shadowy oligarchs. It was the first part of Towne's planned trilogy about the character J.J. Gittes, the foibles of the Los Angeles power structure, and the subjugation of public good by private greed.[9] The second part, The Two Jakes, was about another grab for a natural resource—oil—with a thicker-torsoed Gittes in the 1940s. It was directed by Jack Nicholson and released in 1990, but the second film's commercial and critical failure scuttled plans to make Gittes vs. Gittes,[10] about the third finite resource—land—in Los Angeles, circa 1968.[9]The character of Hollis Mulwray refers to the career of William Mulholland (1855–1935),[citation needed] the superintendent and chief engineer of the Los Angeles Department of Water and Power. He was the designer and engineer for the Los Angeles Aqueduct,[citation needed] which brought Owens Valley water to Los Angeles. For reasons of engineering and safety, Mulwray opposes the dam that Noah Cross and the city want, arguing he will not repeat his previous mistake as when his dam broke, resulting in the deaths of hundreds. This alludes to the disaster of the St. Francis Dam, personally inspected by Mulholland on the day of its catastrophic failure just before midnight on March 12, 1928.[11] As many as 600 people (including 42 school-aged children) died that day and the Santa Clara River Valley, including the town of Santa Paula, was inundated with flood water, the result being the end of Mulholland's career.[12][13]Towne wrote the screenplay with Jack Nicholson in mind.[7] He took the title (and the exchange, \"What did you do in Chinatown?\" / \"As little as possible\") from a Hungarian vice cop who had worked in Chinatown and explained to the writer that the complicated array of dialects and gangs in Los Angeles's Chinatown made it impossible for the police to know whether their interventions were helping victims or furthering their exploitation.[7]Polanski learned of the script through Nicholson, with whom he had been searching for a suitable joint project. Producer Robert Evans wanted Polanski to direct for his European vision of the United States, which Evans believed would be darker and more cynical. Polanski, a few years removed from the murder of his wife and unborn child in Los Angeles, was initially reluctant to return but was persuaded on the strength of the script.[7]Evans wanted Cross to die and Evelyn Mulwray to survive. The producer and director argued over it, with Polanski insisting on a tragic end. \"I knew that if Chinatown was to be special,\" Polanski said, \"not just another thriller where the good guys triumph in the final reel, Evelyn had to die.\"[14] They parted ways over this dispute and Polanski wrote the final scene a few days before it was shot.[7]The original script was more than 180 pages and included a narration by Gittes; Polanski cut that and reordered the story so the audience and Gittes unraveled the mysteries at the same time.William A. Fraker accepted the cinematographer position from Polanski when Paramount agreed. He had worked with the studio previously in Polanski's Rosemary's Baby. Robert Evans, never consulted about the decision, insisted that the offer be rescinded since he felt pairing Polanski and Fraker again would create a team with too much control over the project and complicate the production. Fraker was replaced by John A. Alonzo.[citation needed]In keeping with a technique Polanski attributes to Raymond Chandler, all of the events of the film are seen subjectively through the main character's eyes; for example, when Gittes is knocked unconscious, the film fades to black and fades in when he awakens. Gittes appears in every scene of the film.[7]Jerry Goldsmith composed and recorded the film's music score in ten days, after producer Robert Evans rejected Phillip Lambro's original effort at the last minute. It received an Academy Award nomination and ranks ninth on the American Film Institute's top 25 American film scores.[15] Terry Teachout of the Wall Street Journal[16] and filmmaker David Lynch have both praised it.[17] Goldsmith's score, with haunting trumpet solos, by Hollywood studio musician and MGM first trumpet Uan Rasey, was released through ABC Records and features twelve tracks at a running time just over thirty minutes. It was later reissued on CD by the Varèse Sarabande label.Portions of the Phillip Lambro effort can be heard in the original trailer for the film. Lambro felt he deserved to retain the rights to his work after it was rejected. Paramount granted his wish, on condition that he could not release it under the title Chinatown. Lambro's score was eventually issued by Perseverance Records on the 2012 CD Los Angeles, 1937. One may notice that it tries to evoke the 1930s more than Goldsmith's score, something Robert Evans envisioned.","produced_by":"Robert Evans","starring":"Jack Nicholson|Faye Dunaway|John Hillerman|Perry Lopez|Burt Young|John Huston|","running_time":"131 minutes[1]","music_by":"Jerry Goldsmith","edited_by":"Sam O'Steen","written_by":"Robert Towne","budget":"$6 million[2]"}