{"country":"United States","distributed_by":"Warner Bros. Pictures","language":"English","cinematography":"John Lindley","directed_by":"Lawrence Sher","production_companies":"Alcon Entertainment The Montecito Picture Company","release_dates":"January 27, 2017 (2017-01-27)|||||","Production":"On June 14, 2011, it was announced that Paramount Pictures had acquired the rights to the comedy spec script Bastards written by Justin Malen, about two brothers who believe that their father died when they were young, but later they discover that is a lie.[9] The Montecito Picture Company would produce the film.[9] On August 7, 2014, Alcon Entertainment came on board to produce and finance the film for Warner Bros. after Paramount left the project, while cinematographer Lawrence Sher was attached to make his directorial debut.[10] Ivan Reitman, Tom Pollock, and Ali Bell would produce the film through Montecito.[10] On July 15, 2015, Owen Wilson and Ed Helms joined the lead cast of the film to play the brothers, while Broderick Johnson and Andrew Kosove would also produce the film through Alcon.[1] J. K. Simmons and Terry Bradshaw also joined the cast on August 13, 2015, where both would play the lead characters' biological fathers. Bradshaw would play the role of himself.[2] On August 18, 2015, Ving Rhames signed on to play Rod Hamilton, friend and the ex-teammate of football player Bradshaw.[3] On September 11, 2015, Katt Williams joined the cast of the film.[5] On September 17, 2015, Glenn Close was in final negotiations to join the film.[4] On October 7, 2015, Katie Aselton was also in final talks to sign on.[6] On October 22, 2015, Zachary Haven also joined the cast.[7]Principal photography on the film began on October 5, 2015 in Atlanta, Georgia.[11] Filming also took place in Miami.[2] It wrapped up on December 5, 2015.[12]","produced_by":"Chris Cowles|Ivan Reitman|","starring":"Owen Wilson|Ed Helms|J. K. Simmons|Terry Bradshaw|Ving Rhames|Glenn Close|","edited_by":"Dana E. Glauberman","Release":"Bastards is scheduled to be released by Warner Bros. on January 27, 2017.[13]","written_by":"Justin Malen"}