{"based_on":"The Hundred and One Dalmatians by Dodie Smith","country":"United Kingdom","distributed_by":"Buena Vista Pictures","screenplay_by":"Kristen Buckley Brian Regan Bob Tzudiker Noni White","story_by":"Kristen Buckley Brian Regan","Plot":"After three years in prison, Cruella de Vil has been cured of her desire for fur coats by Dr. Pavlov and is released into the custody of the probation office on the provision that she will be forced to pay the remainder of her fortune (eight million pounds) to all the dog shelters in the borough of Westminster should she repeat her crime. Cruella therefore mends her working relationship with her valet Alonzo and has him lock away all her fur coats. Cruella's probation officer, Chloe Simon, nevertheless suspects her, partly because Chloe is the owner of the now-adult Dipstick (one of the original 15 puppies of the previous film). Dipstick's mate Dottie has recently given birth to three puppies: Domino, Little Dipper, and Oddball (the latter lacking spots).To mend her reputation, Cruella buys the Second Chance Dog shelter, owned by Kevin Shepherd, to resolve its financial insolvency that is on the verge of eviction. Meanwhile, Dr. Pavlov discovers that when his therapy's subjects are subjected to loud noises, they revert to their original states but conceals this discovery. When Big Ben rings in her presence, Cruella reverts to her former personality and enlists the help of furrier Jean-Pierre LePelt to steal 102 Dalmatian puppies for a new fur coat. When Kevin tells Chloe that if Cruella violates her parole, her entire fortune will go to him, since his dog shelter is the only one in the borough of Westminster, Cruella has Kevin framed for the theft of the puppies and invites Chloe to dinner while LePelt steals Dottie and her three puppies. Dipstick hurries back to the apartment and hides in LePelt's truck but is later captured at the train station. Chloe rushes home to save her pets but arrives too late. She is joined by Kevin, who has escaped from prison with help from his dogs and talking parrot, Waddlesworth. Upon finding a ticket for the Orient Express dropped by LePelt, Kevin and Chloe attempt and fail to stop Cruella and LePelt, but Oddball and Waddlesworth pursue their enemies secretly. In Paris, Kevin and Chloe save some of the captive puppies, but they are seen and locked in the cellar just as the puppies flee. Cruella goes after the puppies alone. Alonzo, when scolded beyond his patience and had enough of being abused, defeats LePelt and frees Kevin and Chloe, and they give chase to a wedding cake factory, where the puppies and Kevin's dogs imprison Cruella in an immense cake. She and LePelt are thereupon arrested. Kevin and Chloe are awarded the remnants of Cruella's fortune by Alonzo himself, and Oddball's coat develops spots.","102_dalmatians":"Theatrical release poster","language":"English","Reception":"The film opened at the third position behind M. Night Shyamalan's Unbreakable and How the Grinch Stole Christmas. The film did well at the box office, earning $66,957,026 in the U.S. and $116,654,745 overseas, bringing its total to $183,611,771 worldwide.[1]After premiering in New Zealand, the film received positive reviews and was described by media as a \"howling success\".[6]In America, the film received generally negative reviews from critics. On Rotten Tomatoes, the film has a 31% \"Rotten\" rating, based on 90 reviews, with the site's consensus reading \"This sequel to the live-action 101 Dalmatians is simply more of the same. Critics say it also drags in parts, potentially boring children, and that it's too violent for a G-rated movie.\"[7]On the similar review site Metacritic, the film has a score of 35/100, based on 24 critics.[8]","box_office":"$183.6 million[1]","cinematography":"Adrian Biddle","production_company":"Walt Disney Pictures","directed_by":"Kevin Lima","Video game":"A video game based on the film, that was entitled 102 Dalmatians: Puppies to the Rescue, was released in 2000, with Frankie Muniz as the voice of Domino, Molly Marlette as the voice of Oddball and Susanne Blakeslee as the voice of Cruella de Vil. Jasper and Horace also appeared in the game despite not being present in the film.[9]","release_dates":"November 22, 2000 (2000-11-22)|||||","Production":"The early working title was 101 Dalmatians Returns. Production began in December 1998 through January 1999 to mid November/December 1999. The film was set to be released on June 30, 2000 but was pushed back to November 22, 2000. Oxford Prison was used for the scene as Cruella walked out of prison. 102 Dalmatians was filmed partially in Paris.In November 6, 1999, Disney released the soundtrack to the movie, including pre-eminently, a cover of Paul Anka's \"Puppy Love\" (sung by Myra)[3] and original songs: Mike Himelstein's \"What Can a Bird Do?\" (voiced by Jeff Bennett), \"My Spot in the World\" (sung by Lauren Christy) and \"Cruella De Vil 2000\" (better known as \"Cruella De Vil (102 Dalmatians)\", sung by Camara Kambon, and Mark Campbell[4] of Jack Mack and the Heart Attack[citation needed] – a derivation of \"Cruella de Vil\").[5]","Home media releases":"102 Dalmatians was released on VHS and DVD on April 3, 2001 and re-released on September 16, 2008.","produced_by":"Edward S. Feldman","starring":"Glenn Close Ioan Gruffudd Alice Evans Tim McInnerny Gérard Depardieu","running_time":"100 minutes","music_by":"David Newman","edited_by":"Gregory Perler","budget":"$85 million"}