{"country":"United States","distributed_by":"Columbia Pictures (United States) 20th Century Fox (International)","Plot":"Military contractor Brian Gilcrest (Bradley Cooper) returns to Hawaii to organize a traditional blessing for a new pedestrian gate on behalf of billionaire Carson Welch (Bill Murray), who intends to develop nearby land into a space center. Following a celebrated military career that ended in shadowy deals in Afghanistan, the now disillusioned Gilcrest is tasked with negotiating a deal with the Hawaiian natives and supporting Carson's launch of a privately funded satellite. Gilcrest's mission is complicated by his former girlfriend Tracy (Rachel McAdams), now married with two children, and his idealistic Air Force liaison, Captain Allison Ng (Emma Stone), whose wide-eyed fascination with space reminds him of his own childhood sense of wonder.Gilcrest and Ng travel to meet King Kanahele at his isolated community to negotiate a deal for his participation in the gate blessing ceremony. Along the way, Ng tries to engage Gilcrest in conversation about his life and work, but is unable to break through his cynicism. When they meet the king, Ng, who is part Hawaiian, bonds with him and his companions, identifying with their spiritual view of the land and sky. After prolonged negotiations, Gilcrest brokers a deal for the king's participation in exchange for two mountains and free cell phone service. The next night, Gilcrest and Ng have dinner at Tracy's house, where they meet her husband Woody (John Krasinski) and their two children, Grace and Mitch. At one point, Gilcrest and Tracy find themselves alone in the kitchen, where she admits that she loved him and had plans to make a life with him before he abandoned her 13 years ago.The next evening, they attend Carson's Christmas party, where General Dixon (Alec Baldwin) tells Gilcrest not to screw up the deal with the Hawaiians. One of the general's men hands Gilcrest a thumb drive containing top secret information for the upcoming satellite launch. During the party, Gilcrest becomes attracted to Ng, who is having fun dancing with Carson. Afterwards, Ng joins Gilcrest in his room where he recounts his experiences in Kabul, where he almost died. He tells her that this was the first night he was truly happy to have lived, and the two make love. The next day, Ng discovers that Carson's satellite will actually carry a nuclear payload. When she tries to resign, her colonel tells her it is a private operation run by Carson, and that Gilcrest is aware of the details. Later she confronts Gilcrest in tears for lying to her and to the Hawaiians.Meanwhile, Woody and Tracy confront each other about recent tensions in their marriage, which he believes were caused by Gilcrest's arrival. They agree to separate. The next morning, Tracy shows up at Gilcrest's hotel and reveals that Grace is his daughter. Later that day, after the successful blessing of the new pedestrian gate, Gilcrest learns that the Chinese are attempting to hack the satellite's code to prevent the impending launch. He rushes to the command center and undermines the hackers' efforts. As he watches the satellite enter geosynchronous orbit, he realizes what he's done and its impact on Ng, whom he has come to love. Quickly, he orders a massive sonic upload to be sent to space, and he and Ng hold hands as they watch the satellite explode. Believing Ng's continued association with him will ruin her promising career, he tells her they should not see each other again.Carson is not pleased with the destruction of his satellite and confronts Gilcrest, who tells him he cannot \"buy the sky\". General Dixon is also incensed by Gilcrest's actions, threatening to prosecute him.Gilcrest returns to Tracy's house, where she reads him a moving love letter from Woody. Gilcrest tells her she belongs with her husband, and she encourages him to go after Ng. Woody comes home and sees Gilcrest in his home. Woody tells Gilcrest, he know Gilcrest is Gracie's father. He asks Gilcrest if he slept with his wife, Tracy, while he was gone. Gilcrest lets Woody know he slept with Ng and not with his wife. Woody goes into the living room where Tracy is cleaning up the living room. She sees Woody and they both run into each other's arms, then are joined by Gracie and Mitch. Gilcrest leaves the house while the happy family reunion continues.General Dixon soon learns that Gilcrest was telling the truth about the nuclear weapons payload, and praises him for what he's done and reveals that authorities will soon be taking Carson into custody. Outside the hotel, Gilcrest finds Ng, who is preparing to leave. He tells her he loves her, is staying in Hawaii, and will be waiting for her to return. Later that night, Gilcrest stands outside Grace's hula class and watches her dance. She notices him, he nods at her, and she suddenly realizes, he is her father. With tears of joy in her eyes, she runs outside and embraces him, then returns to her class to continue her hula dancing.","language":"English","box_office":"$26.3 million[3]","cinematography":"Eric Gautier","directed_by":"Cameron Crowe","aloha":"Theatrical release poster","production_companies":"RatPac Entertainment Regency Enterprises Scott Rudin Productions Vinyl Films","release_dates":"May 27, 2015 (2015-05-27) (Hollywood premiere)|May 29, 2015 (2015-05-29) (United States)||||","Production":"Emma Stone was first to be cast in the film in 2012.[4]On July 31, 2013, Alec Baldwin joined the cast of the film.[5] There was a casting call for extras on August 29 on Oahu.[6] Cooper went to Hawaii on September 14, twelve days before filming began.[7][8]On October 7, it was announced that principal photography was still underway in Hawaii.[9] Stone received ground training on how to fly the Piper PA44-180 Seminole airplane from Rob Moore, Chief Instructor Pilot of Galvin Flight Services Hawaii, who later flew the airplane near Ka'aa'wa valley for the inflight shots. Moore acted as the aviation technical advisor. Cooper was filming in downtown Honolulu on December 18 and 19. On February 2, 2015, Sony Pictures stated that the film's final title to be Aloha;[10] a previous working title was Deep Tiki.[11]The musical score for Aloha was composed by Jónsi & Alex,[12] following Jónsi's collaboration with Crowe on We Bought a Zoo (2011). Originally, Mark Mothersbaugh said in May 2014 that he was going to score the film.[13] A soundtrack album was released on May 26, 2015 by Madison Gate Records and Sony Legacy.[14]","produced_by":"Cameron Crowe|Scott Rudin|","starring":"Bradley Cooper|Emma Stone|Rachel McAdams|Bill Murray|John Krasinski|Danny McBride|Alec Baldwin|","running_time":"105 minutes[1]","music_by":"Jónsi & Alex","edited_by":"Joe Hutshing","Release":"On February 14, 2014, it was announced that the film was scheduled for release on December 25, 2014.[15] On July 21, the release date was changed to May 29, 2015.[16]The film's first trailer was released on February 11, 2015.[17]Aloha grossed $21.1 million in North America and $5.2 million in other territories for a total gross of $26.3 million, against a $37 million budget.[3]In North America, Aloha opened simultaneously with the disaster film San Andreas. It made $500,000 from Thursday night showings at 2,275 theaters[18] and an estimated $3.5 million on its opening day from 2,815 theaters.[19] In its opening weekend, the film grossed $9.7 million, finishing 6th at the box office.[20] The film earned $1.65 million in its opening weekend overseas from 7 countries. Australia and New Zealand had an opening weekend combined of $1.5 million[21] and Brazil opened with $240,000.[22] The film went directly to video on demand in the UK[23] and France.[24]The Hollywood Reporter estimated that the financial losses by the film finished to around $65 million by the time the film ended its global theatrical run.[25]Aloha has received negative reviews from critics. Based on Metacritic's sample of 36 critics, 21 gave mixed reviews, 12 negative, and 3 positive. The website scored the film with 40 out of 100 and assessed the critical response as \"mixed or average reviews\".[26] Rotten Tomatoes gives the film a rating of 19%, based on 150 reviews, with an average rating of 4.3/10. The site's critical consensus states: \"Meandering and insubstantial, Aloha finds writer-director Cameron Crowe at his most sentimental and least compelling.\"[27] CinemaScore polls conducted during the opening weekend, cinema audiences gave Aloha an average grade of \"B-\" on an A+ to F scale.[28]","Whitewashing controversy":"The film became controversial due to the Media Action Network for Asian-Americans accusing it of whitewashing the cast, and Crowe has apologized about the casting of Emma Stone as a character who is meant to be of one quarter Chinese and one quarter Hawaiian descent.[30][31][32][33]In June 2015, Crowe responded to the backlash: \"I have heard your words and your disappointment, and I offer you a heart-felt apology to all who felt this was an odd or misguided casting choice. As far back as 2007, Captain Allison Ng was written to be a super-proud one quarter Hawaiian who was frustrated that, by all outward appearances, she looked nothing like one. A half-Chinese father was meant to show the surprising mix of cultures often prevalent in Hawaii. Extremely proud of her unlikely heritage, she feels personally compelled to over-explain every chance she gets. The character was based on a real-life, red-headed local who did just that.\"[34][35]However, Sony Pictures defended the film's portrayal of Hawaiian culture stating, \"While some have been quick to judge a movie they haven't seen and a script they haven't read, the film 'Aloha' respectfully showcases the spirit and culture of the Hawaiian people.\"[36]Emma Stone later said she regretted herself being miscast, and acknowledged whitewashing as a prevalent problem in Hollywood.[37][38][39]","written_by":"Cameron Crowe","budget":"$52 million[2]"}