{"based_on":"Anatomy of a Murder (novel) by John D. Voelker","References in media and popular culture":"The making of the film is the subject of the song, \"Marquette County, 1959\", by Great Lakes Myth Society.[47] The lyrics read: \"Jimmy Stewart came to Marquette County in 1959/ And he was shot for two months there/ And all the pines wept stardust for a while/ And the Duke would play his soundtrack there/ As Preminger had cast him in the film/ His character was Pie-Eye\".[48]","country":"United States","Inspiration":"On July 31, 1952, Lt. Coleman A. Peterson shot and killed Maurice Chenoweth in Big Bay, Michigan.[6] Voelker was retained as defense attorney a few days later.[7] The trial started on September 15, 1952,[8] and Assistant Attorney General Irving Beattie assisted Marquette County Prosecuting Attorney Edward Thomas.[9] Voelker used a rare version of the insanity defense called irresistible impulse that had not been used in Michigan since 1886.[10] The jury deliberated for four hours on September 23, 1952, before returning a verdict of not guilty by reason of insanity.[11] Two days later, after Peterson was examined by a psychiatrist who judged him sane, he was released.[12] Peterson and his wife were divorced soon after the trial.[13] Hillsdale Circuit Court Judge Charles O. Arch, Sr. tried the case.","distributed_by":"Columbia Pictures","language":"English","box_office":"$11,000,000","cinematography":"Sam Leavitt","production_company":"Carlyle Productions","directed_by":"Otto Preminger","anatomy_of_a_murder":"Theatrical release poster by Saul Bass","Awards and honors":"WinsNominationsAcademy Awards:British Academy Film Awards:Directors Guild of America Awards:Golden Globe Awards:Anatomy of a Murder was one of 25 films added to the National Film Registry in 2012. \"The annual selections by the Library of Congress span more than a century of American filmmaking.\"[52]","release_dates":"July 1, 1959 (1959-07-01) (US)|||||","Production":"The film was shot in several locations in the Upper Peninsula (Big Bay, Marquette, Ishpeming, and Michigamme). Some scenes were actually filmed in the Thunder Bay Inn in Big Bay, Michigan, one block from the Lumberjack Tavern, the site of a 1952 murder[14] that inspired much of the novel. Though set in and filmed in the Upper Peninsula of Michigan, the world premiere for the 1959 film was held at the United Artists Theater in Detroit.[15] This was subsequent to a local premiere at the Butler Theater in Ishpeming, Michigan.The Lumberjack Tavern is still in existence today. The murder scene body outline is still there, although it is possibly a restoration and not the original outline. The members of the jury panel from the original trial were contacted and asked to sit on the set. With the exception of a few that had either died or moved, most appeared in the film. The missing ones were replaced with local residents.[citation needed]The role of the judge was offered to both Spencer Tracy and Burl Ives, but ultimately went to Joseph Welch, who had made a name for himself representing the U.S. Army in hearings conducted by Senator Joseph McCarthy. It was Welch who famously asked of McCarthy, \"Have you no sense of decency, sir? At long last, have you left no sense of decency?\" Welch accepted the part only after Preminger agreed to let his wife be on the jury. Chicago newspaper columnist Irv \"Kup\" Kupcinet has a small uncredited role in the film. Duke Ellington, who composed the music, appears as \"Pie-Eye\", the owner of a roadhouse, with whom Jimmy Stewart's character plays piano.[citation needed]","running_time":"160 minutes","screenplay_by":"Wendell Mayes","Plot":"In the Upper Peninsula of Michigan, small-town lawyer Paul Biegler (James Stewart), a former district attorney who lost his re-election bid, spends most of his time fishing, playing the piano and hanging out with his alcoholic friend and colleague Parnell McCarthy (Arthur O'Connell) and sardonic secretary Maida Rutledge (Eve Arden).One day Biegler is contacted by Laura Manion (Lee Remick), the wife of US Army Lieutenant Frederick \"Manny\" Manion (Ben Gazzara), who has been arrested for the first degree murder of innkeeper Bernard \"Barney\" Quill. Manion does not deny the murder, but claims that Quill raped his wife. Even with such a motivation, it would be difficult to get Manion cleared of murder, but Manion claims to have no memory of the event, suggesting that he may be eligible for a defense of irresistible impulse—a version of a temporary insanity defense. Biegler's folksy speech and laid-back demeanor hide a sharp legal mind and a propensity for courtroom theatrics that has the judge busy keeping things under control. However, the case for the defense does not go well, especially since the local district attorney (Brooks West) is assisted by high-powered prosecutor Claude Dancer (George C. Scott) from the Attorney General's office.Furthermore, the prosecution tries at every instance to block any mention of Manion's motive for killing Quill. Biegler eventually manages to get Laura Manion's rape into the record and Judge Weaver (Joseph N. Welch) agrees to allow the matter to be part of the deliberations. However, during cross-examination Dancer insinuates that Laura openly flirted with other men, including the man she claimed raped her. Psychiatrists give conflicting testimony to Manion's state of mind at the time that he killed Quill. Dancer says that Manion may have suspected Laura of cheating on him because he asked his wife, a Catholic, to swear on a rosary that Quill raped her. This raises doubt as to whether the act was non-consensual.Quill's estate is to be inherited by Mary Pilant (Kathryn Grant), whom Dancer accuses of being Quill's mistress. McCarthy learns that she is in fact Quill's daughter, a fact she is anxious to keep secret since she was born out of wedlock. Biegler, who is losing the case, tries to persuade Pilant that Al Paquette, (Murray Hamilton) the bartender who witnessed the murder, may know that Quill admitted to raping Laura but Paquette is covering this up, either because he loves Pilant or out of loyalty to Quill. Through Pilant, Biegler tries to persuade Paquette to testify for the defense, but Paquette refuses.During the trial, Laura claims that Quill tore off her panties while raping her; these panties were not found in the crime scene, where she alleges the rape took place. Pilant, unaware of any details of the case, voluntarily returns to the courtroom to testify that she found the panties in the inn's laundry room. Biegler suggests Quill may have dropped the panties down the laundry chute, located next to his room, to avoid suspicion. Dancer tries to establish that Pilant's answers are founded on her jealousy. When Dancer asserts forcibly that Quill was Pilant's lover and that Pilant lied to cover this fact, Pilant shocks everyone by stating that Quill was her father. Manion is found \"not guilty by reason of insanity\". After the trial, Biegler decides to open a new practice, with a newly sober McCarthy as his partner.The next day Biegler and McCarthy travel to the Manions' trailer park home in order to get Manion's signature on a promissory note which they hope will suffice as collateral for a desperately needed loan. It turns out the Manions have vacated the trailer park, however, with the trailer park superintendent commenting that Laura Manion had been crying. Manion left a note for Biegler, indicating that his flight was \"an irresistible impulse\" — the same terminology Biegler used during the trial. Biegler states that Mary Pilant has retained him to execute Quill's estate. McCarthy says that working for her will be \"poetic justice\".","Stage adaptation":"After Traver's novel was published, St. Martins Press planned to have it adapted for the stage, intending a Broadway production, which would then be made into a film. Before he died in December 1957, John Van Druten wrote a rough draft of the play adaptation. Some time after that, the publisher then made the film rights available, and these were purchased by Otto Preminger.[45]Eventually, Traver's book was adapted for the stage in 1963 by Elihu Winer. It premiered at the Mill Run Theater in suburban Chicago, and was published in 1964 by Samuel French.[46]","Critical reception":"The language used during the film startled Chicago, Illinois Mayor Richard J. Daley,[25] and his Police Commissioner. As a result, the film was temporarily banned in the heavily Catholic city.[26] Preminger filed a motion in federal court in Illinois and the mayor's decision was overturned. The film was allowed to be exhibited after the court determined that the clinical language during the trial was realistic and appropriate within the film's context.[27][28]Anatomy of a Murder has been well received by members of the legal and educational professions. In 1989, the American Bar Association rated this as one of the 12 best trial films of all time. In addition to its plot and musical score, the article noted: \"The film's real highlight is its ability to demonstrate how a legal defense is developed in a difficult case. How many trial films would dare spend so much time watching lawyers do what many lawyers do most (and enjoy least)—research?\"[29] The film has also been used as a teaching tool in law schools, as it encompasses (from the defense standpoint) all of the basic stages in the U.S. criminal justice system from client interview and arraignment through trial. The film was listed as No. 4 of 25 \"Greatest Legal Movies\" by the American Bar Association.[30]The film earned an estimated $5.5 million in rentals in the U.S. and Canada during its first year of release.[31]Film critics have noted the moral ambiguity, where a small town lawyer triumphs by guile, stealth and trickery. The film is frank and direct. Language and sexual themes are explicit, at variance with the times (and other films) when it was produced. The black and white palette is seen as a complement to Michigan's harsh Upper Peninsula landscape.[32] The film is \"[m]ade in black-and-white but full of local color\".[33]Bosley Crowther, film critic for The New York Times said, \"After watching an endless succession of courtroom melodramas that have more or less transgressed the bounds of human reason and the rules of advocacy, it is cheering and fascinating to see one that hews magnificently to a line of dramatic but reasonable behavior and proper procedure in a court. Such a one is Anatomy of a Murder, which opened at the Criterion and the Plaza yesterday. It is the best courtroom melodrama this old judge has ever seen... . Outside of the fact that this drama gets a little tiring in spots—in its two hours and forty minutes, most of which is spent in court—it is well nigh flawless as a picture of an American court at work, of small-town American characters and of the average sordidness of crime.\"[34]TIME felt that it was a well-paced, well-acted, and that the explicit language was warranted within the film's context.[26]In June 2008, the American Film Institute revealed AFI's 10 Top 10, the best 10 films in 10 \"classic\" American film genres, after polling over 1,500 people from the creative community. Anatomy of a Murder was selected as the seventh best film in the courtroom drama genre.[35] The Internet Movie Database rates it number 23 of 1,177 trial films.[36] ' It holds a perfect 100% score on Rotten Tomatoes, based on 40 reviews with a consensus: \"One of cinema's greatest courtroom dramas, Anatomy of a Murder is tense, thought-provoking, and brilliantly acted, with great performances from James Stewart and George C. Scott.\"[37]","Soundtrack":"The jazz score of Anatomy of a Murder was composed by Duke Ellington and Billy Strayhorn and played by Ellington's orchestra. Several of the Ellington band's sidemen, notably Johnny Hodges, Paul Gonsalves, Harry Carney, Russell Procope, and William \"Cat\" Anderson, are heard prominently throughout the film, and Ellington himself appears briefly as \"Pie-Eye,\" the owner of a roadhouse where Paul Biegler (Stewart) and Laura Manion (Remick) have a confrontation.[38]Despite being heard \"in bits and pieces\" the score \"contains some of his most evocative and eloquent music... and beckons with the alluring scent of a femme fatale.\" Including small pieces by Billy Strayhorn, film historians recognize it \"as a landmark—the first significant Hollywood film music by African Americans comprising non-diegetic music, that is, music whose source is not visible or implied by action in the film, like an on-screen band.\" The score avoids cultural stereotypes which previously characterized jazz scores and \"rejected a strict adherence to visuals in ways that presaged the New Wave cinema of the '60s.\"[39]The soundtrack album, containing 13 tracks, was released by Columbia Records on May 29, 1959. A CD was released on April 28, 1995, and reissued by Sony in a deluxe edition in 1999.[40]Detroit Free Press music critic Mark Stryker concluded: \"Though indispensable, I think the score is too sketchy to rank in the top echelon among Ellington-Strayhorn masterpiece suites like Such Sweet Thunder and The Far East Suite, but its most inspired moments are their equal.\"[41] The score employs a \"handful of themes, endlessly recombined and re-orchestrated. Ellington never wrote a melody more seductive than the hip-swaying \"Flirtibird\", featuring the \"irresistibly salacious tremor\" by Johnny Hodges on the alto saxophone.\" A stalking back-beat barely contains the simmering violence of the main title music\" The score is heavily dipped in \"the scent of the blues and Ellington's orchestra bursts with color.\"[41] The AllMusic review by Bruce Eder awarded the album 3 stars calling it \"a virtuoso jazz score—moody, witty, sexy, and—in its own quiet way—playful\".[42]Ellington's score won three Grammy Awards in 1959, for Best Performance by a Dance Band, Best Musical Composition First Recorded and Released in 1959 and Best Sound Track Album.All songs written and composed by Duke Ellington and Billy Strayhorn, except as indicated. ","produced_by":"Otto Preminger","starring":"James Stewart Lee Remick Ben Gazzara Arthur O'Connell George C. Scott","music_by":"Duke Ellington","edited_by":"Louis R. Loeffler","Legal aspects":"The film examines the apparent fallibility of the human factor in jurisprudence.[16][17] In various ways all of the human components — the counsels for defense and prosecution, the defendant and his wife, and the witnesses have their own differing positions on what is right or wrong, and varying perspectives on integrity, justice, morality and ethics. It is to be noted that the reliance on credibility of witnesses, and the \"finding of facts\" based upon those determinations, is the \"Achilles heel\" of the judicial process.[17]One controversial legal issue in this film is possible witness coaching, a violation of legal canons. The only plausible legal defense Lt. Manion has—the insanity defense—is virtually spelled out to a befuddled Manion by his prospective counsel,[18] who then temporarily suspends the conversation and suggests that Manion rethink his factual/legal position. Witness coaching by the prosecution is even more blatant as they call in other jail inmates awaiting sentencing to testify against Manion, and is portrayed as subornation of perjury to an extent. The first suggests that the defendant may be concealing the truth and manipulating his story in order to obtain the best possible verdict, and the latter that the prosecution dangled a possible lighter sentence through plea bargain as an incentive to perjury.[4][19]Thus, there could be a synergy: compounding the inherent fallible nature of the process with the malleability of memory, the potential mendacity of witnesses, the showmanship and \"magic tricks\" involved in trials[20] and advocacy,[19] and the self-interest, venality, morality, poor perception and recollection, and ethical standards of the participants.[16][17] Indeed, the unreliability of judicial decisions based on demeanor has been legally established.[21]In protracted litigation, confabulated memory—filling in the blanks and recreating memories — is common, and research has documented the tendency. Repetitive and suggestive questioning tends to plant the seeds of memory.[22] The book and the film are examples of the lawyers' dance. \"Horse shedding\" of witnesses is well known, if controversial and potentially unethical; it is not just an occasion to directly orchestrate perjury. What is more problematic is that it is possible to reach a point where \"if you believe it, then it isn't a lie.\" Thus, even letter-perfect \"bona fide\" certainty of belief is not equivalent to a certification of accuracy or even truthfulness. This process is called \"horse shedding\", \"sandpapering\", or \"wood shedding\" — the first and last terms being metaphorical references to the location of such a \"collaboration.\"[23][24]"}