{"based_on":"Autobiography  by Loretta Lynn George Vecsey","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Tom Rickman","language":"English","box_office":"$67,182,787","Synopsis":"In 1945, 13-year-old Loretta Webb is one of eight children of Ted Webb (Levon Helm), a Van Lear coal miner raising a family with his wife in the midst of grinding poverty in Butcher Hollow, Kentucky (pronounced by locals as \"Butcher Holler\").In 1948, at the age of 15, she marries 22-year-old Oliver Vanetta Lynn, Jr. (aka \"Doolittle\", \"Doo\" or Mooney\") (Tommy Lee Jones), becoming a mother of four by the time she is 19 (and a grandmother by age 29). Now known as Loretta Lynn, she begins singing the occasional songs at local honky-tonks on weekends as well as making the occasional radio appearance.When she is 25, Norm Burley—the owner of Zero Records, a small Canadian record label—hears her sing during one of her early Northern Washington radio appearances. Burley gives the couple the money needed to travel to Los Angeles to cut a demo tape from which her first single, \"I'm a Honky Tonk Girl,\" would be made. After returning home from the sessions, Mooney suggests that they go on a promotional tour to push the record. He shoots his own publicity photo for her, and spends many late nights writing letters to show promoters and to radio disc jockeys all over the South. After Loretta receives an emergency phone call from her mother telling her that her father had died, she and Mooney hit the road with records, photos, and their children. The two embark on an extensive promotional tour of radio stations across the South.En route, and unbeknownst to the pair, Loretta's first single, \"I'm a Honky Tonk Girl,\" hits the charts based on radio and jukebox plays, and earns her a spot on the Grand Ole Opry. After seventeen straight weekly performances on the Opry, she is invited to sing at the Ernest Tubb Record Shop Midnite Jamboree after her performance that night. Country superstar Patsy Cline (Beverly D'Angelo), one of Loretta's idols, who had recently been hospitalized from a near-fatal car wreck, inspires Loretta to dedicate Patsy's newest hit \"I Fall to Pieces\" to the singer herself as a musical get-well card. Cline listens to the broadcast that night from her hospital room and sends her husband Charlie Dick down to Tubbs' record shop to fetch Loretta so the two can meet. A long and close friendship with Patsy Cline follows, and ends only by the tragic death of her idol in a plane crash on March 5, 1963.Extensive touring, keeping up her image, overwork, and a great deal of stress (from trying to keep her marriage and family together) cause her a nervous breakdown. However, after a year off at her ranch, in Hurricane Mills, Tennessee, Loretta goes back on the road in fine form and becomes the First Lady of Country Music.Some months later Mooney drives Loretta at breakneck speed to a site for a proposed new house. They argue about where to put the bedrooms, and finally Mooney jokingly says that, if they can't settle the question about where to put the bedrooms, then he'll live in a treehouse at the top of a hill.Finally, in 1969, Loretta performs her hit, \"Coal Miner's Daughter\", to a sold-out audience, with the tune becoming her signature song.","cinematography":"Ralf D. Bode","directed_by":"Michael Apted","Soundtrack":"Coal Miner's Daughter: Original Motion Picture Soundtrack was released on March 7, 1980, under the MCA Nashville label.[12] It included music by Beverly D'Angelo, Levon Helm, and Sissy Spacek except for the \"End Credits Medley\" and material by other artists which were not under contract to MCA. The album was certified Gold by the RIAA on January 11, 1982[13] and has been released on vinyl,[14] cassette tape,[15] and CD.[12] Levon Helm's Blue Moon of Kentucky was released as a single on 7\" vinyl, both as a double-A-side and also with a non-album track also sung by Helm, Allen Toussaint's Working in the Coal Mine, on the B-side.[16]","release_dates":"March 7, 1980 (1980-03-07)|||||","Production":"Lynn personally chose Spacek to portray her, making the decision based on a photograph of the actress despite being unfamiliar with her films, a story Spacek recounts in an DVD audio commentary for the Collector's Edition of the film. Initially, Spacek was reluctant to participate, and asked to do her own singing in the film in hopes of scaring off the studio from pursuing her for the role. At the time that Lynn prematurely announced on The Tonight Show Starring Johnny Carson that \"Sissy Spacek is going to play me,\" the actress was torn between friends who advised her to do Lynn's film and those who advised her to choose instead a Nicolas Roeg project due to start filming at the same time. Talking it over with her mother-in-law that evening, Spacek was advised to pray for a sign, which she did. She and her husband subsequently went for a drive in his mother's car, where the radio was tuned to a classical music station that changed formats at sunset every evening. As the couple pulled out of the parking garage, the title line of the song \"Coal Miner's Daughter\" sallied forth from the radio.[4]","produced_by":"Bernard Schwartz","starring":"Sissy Spacek Tommy Lee Jones Beverly D'Angelo Levon Helm","running_time":"125 minutes","music_by":"Owen Bradley","coal_miner's_daughter":"Theatrical release poster","edited_by":"Arthur Schmidt","Release":"It has a 100% approval rating on Rotten Tomatoes based on 14 reviews; the average rating is 8.3/10.[5] Variety called it \"a thoughtful, endearing film charting the life of singer Loretta Lynn from the depths of poverty in rural Kentucky to her eventual rise to the title of 'queen of country music'.\"[6] Roger Ebert stated that the film \"has been made with great taste and style; it's more intelligent and observant than movie biographies of singing stars used to be.\"[7]The film won the Academy Award for Best Actress (Sissy Spacek), and was nominated for Best Art Direction-Set Decoration (John W. Corso, John M. Dwyer), Best Cinematography, Best Film Editing, Best Picture, Best Sound (Richard Portman, Roger Heman and James R. Alexander) and Best Writing, Screenplay Based on Material from Another Medium.[8][9]For her performance, Spacek won an Academy Award, as well as \"Best Actress\" awards from the Golden Globes, the National Board of Review, the Los Angeles Film Critics Association, the New York Film Critics Circle, and the Kansas City Film Critics Circle. Her co-star Beverly D'Angelo, who played Loretta's mentor, Patsy Cline, also chose to do her own singing rather than lip-synching; she was nominated for a Golden Globe, as was Tommy Lee Jones.","budget":"$15 million[1]","Adaptation":"On May 10, 2012, at the Grand Ole Opry, Lynn announced that Zooey Deschanel will play her in a Broadway musical adaptation.[18]One episode of The Simpsons, entitled \"Colonel Homer\", is partly based on this film. The episode also stars Beverly D'Angelo as cocktail waitress Lurleen Lumpkin, who happens to have a beautiful country singing voice."}