{"based_on":"Christine  by Stephen King","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Bill Phillips","Plot":"Arnold \"Arnie\" Cunningham (Keith Gordon) is an awkward, unpopular teen with only one friend, Dennis Guilder (John Stockwell). Arnie's life begins to change when he buys a used red-and-white 1958 Plymouth Fury, nicknamed \"Christine\", in need of extensive repairs. Arnie begins to restore Christine, but as he spends more of his time working on the car, he discards his glasses, dresses differently, and develops an arrogant personality. Dennis and Arnie's new friend, Leigh Cabot (Alexandra Paul), discover the car's previous owner was obsessed with Christine and had died in it due to carbon monoxide poisoning.A group of bullies at school—angry with Arnie after a shop class confrontation results in Buddy Repperton (William Ostrander) getting expelled—vandalize Christine. Arnie is devastated and determined to repair Christine. As he examines the ruined car, he hears the creaking of metal and notices the engine is now fully restored. Arnie tells the car \"show me\"; Christine restores itself to showroom quality, then seeks out the vandals; Moochie Welch (Malcolm Danare) is targeted first and crushed to death in an alley. Buddy, Richie Trelawney (Steven Tash) and Don Vandenberg (Stuart Charno) are then killed: Richie and Don are caught in a gas station explosion (which sets Christine on fire), and Buddy is run over and burned by the flaming car. Darnell is eventually killed in the garage when he sits in the car and is crushed by the seat adjuster.On New Year's Eve, Dennis and Leigh reason that the only way to stop Christine and save Arnie is to destroy the car. Dennis scratches \"Darnell's Tonight\"—referencing the name of a local junkyard—into Christine's hood, then makes his way there with Leigh. Dennis waits in a tracked loader while Leigh heads to the office so that she can shut the door after Christine arrives, trapping the car. Christine, who has been lying in wait the entire time, shines the headlights from under a pile of garbage and the car charges after Leigh. Christine crashes into Darnell's office in an attempt to kill Leigh, and Arnie is thrown through Christine's windshield. He is impaled on a shard of glass and survives just long enough to admire Christine one last time. Christine continues to attack Dennis and Leigh, repeatedly sustaining damage and regenerating. Dennis pulls Leigh into the cab of the loader; the two then crush Christine with the loader.Dennis and Leigh survive and leave behind the remains of the car. The closing shot of the film is of Christine, now having been crushed into a cube by a car crusher, as a piece of the grill slowly begins to straighten.","language":"English","christine":"Theatrical release poster","box_office":"$21 million (US)[2]","cinematography":"Donald M. Morgan","production_company":"Columbia Pictures Delphi Premier Productions Polar Film","directed_by":"John Carpenter","Soundtrack":"Two soundtracks were released, one consisting purely of the music written and composed by John Carpenter and Alan Howarth, the other consisting of the contemporary pop songs used in the film.[21]The soundtrack album containing songs used in the film was entitled Christine: Original Motion Picture Soundtrack and was released on LP and cassette on Motown Records.[22] It contained 10 (of the 15) songs listed in the film's credits, plus one track from John Carpenter and Alan Howarth's own score. The track listing was as follows:The following tracks were not included on this LP release, but were used in the film and listed in the film's credits:","release_dates":"December 9, 1983 (1983-12-09)|||||","Production":"Producer Richard Kobritz had previously produced the miniseries Salem's Lot, also based on a Stephen King novel; through producing the miniseries, Kobritz became acquainted with King, who sent him manuscripts of two of his novels, Cujo, and Christine.[3] Kobritz purchased the rights to Christine after finding himself attracted to the novel's \"celebration of America's obsession with the motorcar.\"[3]According to John Carpenter, Christine was not a film he had planned on directing, saying that he directed the film as \"a job\" as opposed to a \"personal project.\"[4] He had previously directed The Thing (1982), which had done poorly at the box office and led to critical backlash.[3] In retrospect, Carpenter stated that upon reading Christine, he felt that \"It just wasn't very frightening. But it was something I needed to do at that time for my career.\"[4]King's novel, the source material for Carpenter's film, made it clear that the car was possessed by the evil spirit of its previous owner, Roland D. LeBay, whereas the film version of the story shows that the evil spirit surrounding the car was present on the day it was built.[5] Other elements from the novel were altered for the film, particularly the execution of the death scenes, which the filmmakers opted for a more \"cinematic approach.\"[6]Initially, Columbia Pictures had wanted to cast Brooke Shields in the role of Leigh due to her publicity after the release of The Blue Lagoon (1980), and Scott Baio as Arnie.[3] The filmmakers declined the suggestion, opting to cast young actors who were still fairly unknown. Kevin Bacon auditioned for the role, but opted out when offered a part in Footloose (1984).[3] Carpenter cast Keith Gordon in the role of Arnie after an audition in New York City; Gordon had some experience in film, and was also working in theater at the time; John Stockwell was cast at an audition in Los Angeles.[3]Nineteen-year-old Alexandra Paul was cast in the film after audition in New York City; according to Carpenter, Paul was an \"untrained, young actress\" at the time, but brought a \"great quality\" about the character of Leigh.[3] According to Paul, she had not read any of King's book's or seen Carpenter's films, and read the novel in preparation.[3]Christine was shot largely in Los Angeles, California, while the location for Darnell's garage was located in Santa Clarita.[6] Filming began in April 1983, merely days after the King novel had been published.[7] The film's stunts were primarily completed by stunt coordinator Terry Leonard, who was behind the wheel of the car during the high-speed chase scenes, as well as the scene in which the car drives down a highway engulfed in flames.[6]Although the car in the film is identified as a 1958 Plymouth Fury[8]—and in 1983 radio ads promoting the film, voiceover artists announced, \"she's a '57 Fury\"—two other Plymouth models, the Belvedere and the Savoy, were also used to portray the malevolent automobile onscreen. John Carpenter placed ads throughout Southern California searching for models of the car, and was able to purchase twenty-four of them in various states of disrepair, which were used to build a total of seventeen models of the Fury.[7]Total production for the 1958 Plymouth Fury was only 5,303, and they were difficult to find and expensive to buy at the time. In addition, the real-life Furys only came in one color, \"Buckskin Beige\", seen on the other Furies on the assembly line during the initial scenes of the movie.[9] Several vehicles were destroyed during filming, but most of the cars were Savoy and Belvedere models dressed to look like the Fury.Originally, Carpenter had not planned to film the car's regeneration scenes, but decided after the shoot had finished to include them. The shots of the car regenerating itself were shot in post-production and done using hydraulics.[6]Of the twenty cars used in the film, only two still exist. One is a stunt vehicle with a manual transmission and now resides in the hands of a private California collector.[10] The other vehicle was rescued from a junkyard and restored by collector Bill Gibson of Pensacola, Florida.[11]","produced_by":"Richard Kobritz|Larry J. Franco|","starring":"Keith Gordon|John Stockwell|Alexandra Paul|Robert Prosky|Harry Dean Stanton|","running_time":"110 minutes","music_by":"John Carpenter|Alan Howarth|","edited_by":"Marion Rothman","Release":"Christine was released in North America on December 9, 1983, to 1,045 theaters.[12]In its opening weekend Christine brought in $3,408,904 landing at #4. The film dropped 39.6% in its second weekend, grossing $2,058,517 slipping from fourth to eighth place. In its third weekend, it grossed $1,851,909 dropping to #9. The film remained at #9 its fourth weekend, grossing $2,736,782. In its fifth weekend, it returned to #8, grossing $2,015,922. Bringing in $1,316,835 it its sixth weekend, the film dropped out of the box office top ten to twelfth place. In its seventh and final weekend, the film brought in $819,972 landing at #14, bringing the total gross for Christine to $21,017,849.[2]Based on 25 reviews collected by Rotten Tomatoes, Christine has an overall 68% approval rating from critics and an average score of 5.7 out of 10.[13] Variety gave the film a negative review, stating: \"Christine seems like a retread. This time it’s a fire-engine red, 1958 Plymouth Fury that’s possessed by the Devil, and this deja-vu premise [from the novel by Stephen King] combined with the crazed-vehicle format, makes Christine appear pretty shop worn.\"[14]Roger Ebert gave the movie three out of four stars, saying: \"by the end of the movie, Christine has developed such a formidable personality that we are actually taking sides during its duel with a bulldozer. This is the kind of movie where you walk out with a silly grin, get in your car, and lay rubber halfway down the Eisenhower.\"[15] Janet Maslin of The New York Times gave the film a middling review, saying: \"The early parts of the film are engaging and well acted, creating a believable high-school atmosphere. Unfortunately, the later part of the film is slow in developing, and it unfolds in predictable ways.\"[16] Time Out said of the film: \"Carpenter and novelist Stephen King share not merely a taste for genre horror but a love of '50's teenage culture; and although set in the present, Christine reflects the second taste far more effectively than the first.\"[17]The film was released on VHS by Columbia Pictures, and later in a special edition DVD in 2004.[18] On March 12, 2013, Twilight Time video released the film on Blu-ray for the first time in a limited edition run numbered at 3,000 copies.[19] On September 29, 2015, Sony Pictures Home Entertainment re-released the film on Blu-ray.[20]","budget":"$10 million[1]"}