{"8_mile":"Theatrical release poster","country":"United States","distributed_by":"Universal Pictures","Plot":"Jimmy Smith Jr. , a blue-collar worker from a poor family, struggles with various aspects of his life. Jimmy and his friends, simple-minded Cheddar Bob (Evan Jones); fun-loving Sol George (Omar Benson Miller); socially minded DJ Iz (De'Angelo Wilson); and Jimmy's best friend, the charismatic Future (Mekhi Phifer) all of whom have also formed a rap crew together named \"Three-One-Third\" (a play on the Detroit area code 313), aspire to fame and notoriety.Although encouraged by his friends who hail him as a talented rap music artist, Jimmy worries about his potential as a musician due to his lack of confidence. One night at a club called \"The Shelter\", where Future is the MC, Jimmy panics and chokes-up during a rap battle and leaves the stage humiliated and defeated.It has been revealed that he has moved back north of 8 Mile Road to the rundown trailer home in Warren of his alcoholic, co-dependent mother Stephanie (Kim Basinger), his little sister Lily (Chloe Greenfield), and Stephanie's indolent semi-live-in boyfriend Greg (Michael Shannon) After the battle he comes home, unintentionally walking in on his mother and Greg having sex. Afterwards an altercation erupts between him and Greg, which inadvertently wakes Lily, whose presence immediately quiets Jimmy's anger. Jimmy puts her back to bed and sings her a lullaby.Jimmy's friend Wink (Eugene Byrd), a radio station employee with ties to a record label prompter, offers to use his connections to help Jimmy record his demo.Jimmy works at an automotive factory, but when he asks for extra shifts, his supervisor dismisses his request on account of his habitual tardiness. Jimmy meets a woman named Alex (Brittany Murphy), and is immediately attracted to her. They meet again one night at a club where she flirts with him and the two talk about their pasts and what they are aspiring to. Alex expresses her confidence in Jimmy's abilities throughout the film, telling him that she can feel that his talent and passion will lead him to success.At home, Stephanie finds out that they're being evicted due to non-payment. Concerned for the well being of his sister, Jimmy implores his mother to ask Greg to help, she refuses afraid that he'll leave her, believing that he will soon ask her and Lily to move in with him.Jimmy's friendship with Wink becomes strained after he discovers that Wink does promotional work for Jimmy's rivals, a gang of rappers known as \"Tha Leadaz of tha Free World\", led by the egocentric sociopath, Papa Doc (Anthony Mackie). At one point, Jimmy and his friends get into a brawl with Tha Free World, which is broken only when Cheddar Bob pulls out a gun and accidentally shoots himself in the leg; he survives, but is relegated to crutches.At work one day, Jimmy sees a rap battle in which a worker named Mike (Xzibit) insults a gay co-worker Paul with his lyrics. Jimmy joins the battle to defend Paul by insulting Mike. Wink also knows Alex, as he is helping her put together a book so she can start a modeling career in New York.Greg finds out about the eviction and immediately confronts and dumps Stephanie, insulting the entire family, leading to an angry assault by Jimmy. Jimmy later comes home to a dejected and intoxicated Stephanie, who blames Jimmy for Greg leaving her and selfishly crying about how no one is going to want her now and asking what is she going to do. Finally fed-up with her behavior, Jimmy admonishes her about being so selfish and for the most part ignoring Lily, he ends the confrontation asking her, \"What did we ever do to you?\" to which she responds by kicking him out.Future pushes Jimmy to get his revenge by competing against Tha Leadaz of tha Free World at the next rap battle. Even though Jimmy doubts himself, Future is confident that he has what it takes. Meaning well, Future signs Jimmy up for the next round of battles without his knowledge which enrages him and causes him to angrily push Future away.Wink arranges for Jimmy to meet with producers at a recording studio, but Jimmy finds Wink and Alex having sex atop a mixing console. Enraged, he beats up Wink and their friendship is ended. In retaliation, Wink and Tha Leadaz of tha Free World jump and beat up Jimmy outside his mother's trailer. Papa Doc holds a defeated Jimmy at gunpoint, but Wink dissuades Papa Doc from killing him.A now-sober Stephanie then comes home after the attack on Jimmy, cleaned up with groceries in hand. She then reveals to Jimmy that she won at bingo that night and she now has enough money to pay off the overdue rent. Jimmy, proud of his mother for changing her ways, confides in Stephanie that he has been saving up to record his demo, but now he will no longer rely on Wink but do it himself on his own terms. Stephanie expresses both encouragement and pride, saying that doing something yourself is the best way. The interaction gives Jimmy a renewed sense of confidence and determination.Throughout the course of the film Jimmy takes more responsibility for the direction of his life. When he exhibits an improved attitude and performance at work, his supervisor grants him the extra shifts he requested. However Jimmy's late-night shift conflicts with the next battle tournament. But a goodbye visit from Alex, who is moving to New York, changes his mind about competing. Paul, the co-worker whom Jimmy had stood up for, agrees to cover for him at work, and Jimmy enters the battle.In each of the three rounds of the battle, Jimmy is pitted against a different member of Tha Free World and wins the first two rounds. In the last round he is paired against Papa Doc. Jimmy is aware that Doc knows all his weak points, so he uses his difficult life as a springboard to reveal the truth about Papa Doc: his real name is Clarence and despite passing himself off as a thug he comes from a privileged background, having attended Cranbrook School, a private high school in upper-class suburb and grown up in a stable two-parent household.With nothing to say in rebuttal, Clarence hands the microphone back to Future, feeling embarrassed that someone he thought was below him beat him in a battle. After being congratulated by Alex and his friends, Future offers him a position hosting battles at The Shelter. Jimmy declines, saying he has to get back to work and to find success his own way. He walks back to work, with a renewed sense of confidence about his future, as the song \"Lose Yourself\" plays in the background, probably implying that Jimmy has achieved his goals of becoming a musician.","In popular culture":"In the episode of American Dad! called \"The Worst Stan\", Stan Smith is seen looking out the windows of a bus with headphones and a notebook, which is similar to a scene in 8 Mile where Jimmy Smith is seen doing the same when writing \"Lose Yourself\".","language":"English","Reception":"8 Mile received critical acclaim, with critics praising the music and Eminem's performance. Review aggregator Rotten Tomatoes reports the film is \"Certified Fresh\", with 76% of 206 professional critics giving the film a positive review and a rating average of 6.8 out of 10. The site's consensus is that \"Even though the story is overly familiar, there's enough here for an engaging ride.\"[4] On Metacritic, which assigns a weighted mean rating out of 100 reviews from film critics, the film has rating score of 77 based on 38 reviews, which indicates \"generally favorable reviews\".[5] CinemaScore polls conducted during the opening weekend revealed the average grade cinemagoers gave 8 Mile was B+ on an A+ to F scale, with the core under-21 demographics giving it an A.[6]Roger Ebert gave the film 3 out of 4 stars. He said that we \"are hardly started in \"8 Mile,\" and already we see that this movie stands aside from routine debut films by pop stars\" and that it is \"a faithful reflection of his myth\". He said that Eminem, as an actor, is \"convincing without being too electric\" and \"survives the X-ray truth-telling of the movie camera\". He praised Eminem's approach to his role, saying that \"The genius of Rabbit is to admit his own weaknesses.\" He complimented Basinger, saying that \"Her performance finds the right note somewhere between love and exasperation; it cannot be easy to live with this sullen malcontent, whose face lights up only when he sees his baby sister, Lily.\" He said that criticism of Basinger for being \"too attractive and glamorous to play Rabbit's mother\" were unfair: \"Given the numbers of ugly people who live in big houses, why can't there be beautiful people living in trailers?\" He called the film \"a grungy version of a familiar formula, in which the would-be performer first fails at his art, then succeeds, is unhappy in romance but lucky in his friends, and comes from an unfortunate background. He even finds love, sort of, with Alex,\" but \"What the movie is missing, however, is the third act in which the hero becomes a star,\" as it \"avoids the rags-to-riches route and shows Rabbit moving from rags to slightly better rags.\" He said that he \"would love to see a sequel in which Rabbit makes millions and becomes world famous, and we learn at last if it is possible for him to be happy.\"[7]In the At the Movies with Ebert and Roeper review, both Ebert and Richard Roeper gave the film a thumbs up; Roeper said that Eminem has a \"winning screen presence\" and \"raw magic\" to him. He was happy with Rabbit's \"tender side\" presented through his relationship with the \"adorable\" Greenfield as his sister, but felt that Basinger was \"really miscast\". But as in his own review, Ebert felt that the dark, depressing atmosphere of 8 Mile would turn off some Eminem fans, while Roeper thought they would like it. Roeper said: \"8 Mile probably won't win converts to rap, but it should thrill Eminem fans.\"[8]Peter Travers gave the film 3.5 out of 4 stars. He said that 8 Mile \"is a real movie, not a fast-buck package to exploit the fan base of a rap nonentity\" that \"qualifies as a cinematic event by tapping into the roots of Eminem and the fury and feeling that inform his rap. Hanson spares us the rags-to-riches cliches by leaving Rabbit on the edge of success. The film ends not with a blast but with the peace that comes to a rapper who finds his voice at last. That kind of class is a big risk for a novice stepping into the movie ring. Eminem wins by a knockout.\" He praised Hanson's directing, stating that he \"succeeds brilliantly at creating a world around Eminem that teems with hip-hop energy and truth\" and \"excels with actors.\" He hailed Eminem's performance, saying that in 8 Mile, \"Eminem is on fire\" with an \"electric\" screen presence, \"hold[ing] the camera by natural right\" and \"read[ing] lines with an offbeat freshness that makes his talk and his rap sound interchangeable,\" and sulk of \"intensity to rival James Dean's.\" He said that Murphy was \"dynamite, \"play[ing] Alex with hot desperation and calloused vulnerability,\" while saying that \"Basinger shines\" in her role as well. \"Hanson builds to a spectacular climax\" with Rabbit's last three battles, and compared his final battle with Papa Doc to fight between Rocky Balboa and Apollo Creed in Rocky.[9]8 Mile opened at #1 with $51,240,555 in its opening weekend, the then second highest opening for an R-rated movie in the U.S.[10] The film would go on to gross $116,750,901 in the domestic box office and $242,875,078 worldwide.[2] The film's final domestic gross would hold the film at #3 in Box Office Mojo's \"Pop Star Debuts\" list, behind Austin Powers in Goldmember (Beyoncé) and The Bodyguard (Whitney Houston).The 8 Mile DVD, which was released on March 18, 2003, generated $75 million in sales and rentals in its first week, making it the biggest DVD debut ever for an R-rated movie and putting it in the all-time Top 10 for first week home video sales for a movie. A VHS version was also released on the same date.[11][12]8 Mile has been named to various year-end and all-time top lists:In 2003, Eminem won the Academy Award for Best Original Song at the 75th Academy Awards, for his single \"Lose Yourself\" from the soundtrack of 8 Mile.[18][19] Thus he became the first hip hop artist ever to win an Academy Award. He was not present at the ceremony, but musician Luis Resto accepted the award.[20] The film has been nominated for 32 awards, winning 11.[21]","box_office":"$242.9 million[2]","cinematography":"Rodrigo Prieto","production_company":"Imagine Entertainment","directed_by":"Curtis Hanson","Music":"Music from and Inspired by the Motion Picture 8 Mile is the official music soundtrack to 8 Mile. Eminem features on five tracks from the album. It was released under the Shady/Interscope label and spawned the massive hit single \"Lose Yourself\". The album debuted at number one on the U.S. Billboard 200 Albums Chart that year with over 702,000 copies sold and 507,000 sold in the second week also finishing the year as the fifth best-selling album of 2002 with US sales of 3.2 million, despite only two months of release. It also reached #1 on the UK Compilations Chart and the Australian ARIAnet Albums Chart. It also spawned a follow up soundtrack, More Music from 8 Mile, consisting of songs that appear in 8 Mile that were current singles during the film's time setting of 1995. The album was also made in a clean edition removing most of the strong profanity and violent content.","release_dates":"November 8, 2002 (2002-11-08)|||||","produced_by":"Curtis Hanson Brian Grazer Jimmy Iovine","starring":"Eminem Kim Basinger Brittany Murphy Mekhi Phifer","running_time":"110 minutes[1]","edited_by":"Jay Rabinowitz","written_by":"Scott Silver","budget":"$41 million[2]"}