{"based_on":"21 Jump Street  by Patrick Hasburgh Stephen J. Cannell","country":"United States","distributed_by":"Columbia Pictures|Metro-Goldwyn-Mayer Pictures|","screenplay_by":"Michael Bacall|Oren Uziel|Rodney Rothman|","story_by":"Michael Bacall|Jonah Hill|","Sequel and spin-offs":"On September 10, 2014, 23 Jump Street was confirmed.[63] Channing Tatum has yet to sign on to the project, stating, \"I don't know if that joke works three times, so we'll see.\"[64] On August 7, 2015, it was revealed that Lord and Miller will not direct the film, but instead write and produce. A first draft of the film's script has been completed.[65] On December 10, 2014, it was revealed that Sony was planning a crossover between Men in Black and Jump Street. The news was leaked after Sony's system was hacked[66] and then confirmed by the directors of the films, Chris Miller and Phil Lord, during an interview about it.[67][5] James Bobin was announced as the director in March 2016.[68][69] The title of the crossover was later revealed as MIB 23, and it was revealed that the crossover would replace a 23 Jump Street film. In early 2015, a female-driven 21 Jump Street film was rumoured to also be in the works, but with the announcement of the Men in Black crossover, the status of that film is unclear. [70]","Plot":"Two years following their success in the 21 Jump Street program, Schmidt (Jonah Hill) and Jenko (Channing Tatum) are back on the streets chasing narcotics. However, after failing in the pursuit of a group of drug dealers led by Ghost (Peter Stormare), Deputy Chief Hardy (Nick Offerman) puts the duo back on the program to work for Captain Dickson (Ice Cube) – now located across the street at 22 Jump Street. Their assignment is to go undercover as college students and locate the supplier of a drug known as \"WHYPHY\" (Work Hard, Yes, Play Hard, Yes) that killed a student photographed buying it on campus.At college, Jenko quickly makes friends with a pair of jocks named Zook (Wyatt Russell) and Rooster (Jimmy Tatro), the latter being a prime suspect of the investigation. Jenko starts attending parties with the jocks who do not take as kindly to Schmidt. Meanwhile, Schmidt gets the attention of an art student, Maya (Amber Stevens), by feigning an interest in slam poetry. The two sleep together, to the disapproval of Maya's roommate Mercedes (Jillian Bell), and it is revealed that Maya is the daughter of the vehemently disapproving Captain Dickson. Despite sleeping together, Maya tells Schmidt not to take it seriously, and he starts to feel left out as Jenko bonds more and more with Zook who encourages him to join the football team.When Schmidt and Jenko feel as if they have no clue to who the dealer is because they have no leads, they decide to pay a visit to Mr. Walters (Rob Riggle) and Eric (Dave Franco) in jail for advice on how to look for the WHYPHY supplier. Walters tells the two to look more closely as he notices a unique tattoo on the arm of the dealer in the photograph. He insists that if they find the tattoo, they will have found their man. Whilst hanging out with Zook and Rooster, Jenko notices that Rooster does not have the tattoo but sees it on Zook's arm. Schmidt and Jenko are invited to join the fraternity led by the jocks but Schmidt refuses, furthering the tension between the two as Jenko passes all the requirements. At a counselling session, they realise that maybe Zook isn't the dealer but was buying the drugs rather than selling them, and soon afterwards they find Ghost and his men on campus. A chase ensues and Ghost again evades the pair. Jenko reveals to Schmidt that he's been offered a football scholarship with Zook and is unsure whether he wants to continue to be a police officer. Schmidt decides for him by telling officers on the scene that Jenko had nothing to do with the melee caused by the chase. Immediately afterwards, Schmidt moves out of the dorm and Maya finds out who he really is.Spring Break arrives and Schmidt prepares to go after Ghost alone. Jenko asks to help so that the two can have one final mission together, and the pair head to the beach where Ghost is likely to be dealing WHYPHY. Inside a bar, they find Mercedes, revealed to be Ghost's daughter, giving instructions to other dealers. The pair, backed up by Dickson and the rest of Jump Street, ambush the meeting and give chase as they flee. Mercedes is able to handcuff Dickson and take him hostage, pursued by Schmidt. Meanwhile, Jenko goes after Ghost. After a fist fight with Mercedes, Schmidt is held at gunpoint by her but Maya sneaks up and knocks her out. Schmidt goes to help Jenko who is now on a hotel roof in pursuit of Ghost, and inadvertently shoots Jenko in the shoulder. Ghost attempts to escape in a helicopter and Jenko jumps across to it but struggles to hold on with his injured arm. Schmidt makes the same jump and the two fall into the sea, but not before Jenko is able to throw a grenade into the helicopter, supposedly killing Ghost.Back on land, Jenko tells Schmidt that he still wants to be a police officer as he believes their differences help their partnership, and the two reconcile in front of a cheering crowd. Dickson approaches them claiming to have a new mission undercover at a med school.During the credits, Jenko and Schmidt go on to a variety of undercover missions to different schools, which are portrayed as fictional sequels, an animated series, and a toy line. One mission features Detective Booker (Richard Grieco) while another sees the return of Ghost, who survived the helicopter explosion. In a post-credits scene, Walters reveals to Eric that he's late.","language":"English","box_office":"$331.3 million[3]","cinematography":"Barry Peterson","directed_by":"Phil Lord|Christopher Miller|","production_companies":"LStar Capital Media Rights Capital Original Film The Cannell Studios Storyville 75 Year Plan Productions","22_jump_street":"Theatrical release poster","Music":"The score for the film was composed by Mark Mothersbaugh and was released by La-La Land Records on a double disc album, limited to 2,000 copies, in September 2014. The second disc of the album also contains the score from the film's predecessor, 21 Jump Street, composed by Mothersbaugh as well.[26]","release_dates":"June 4, 2014 (2014-06-04) (New York City)|June 13, 2014 (2014-06-13) (United States)||||","Production":"On March 17, 2012, Sony Pictures announced that it was pursuing a sequel to 21 Jump Street, signing a deal that would see Jonah Hill and Michael Bacall return to write a script treatment that would be again developed by Bacall.[17] The film was originally scheduled to be released on June 6, 2014.[18] On May 8, 2013, it was announced that the film would be pushed back a week until June 13, 2014.[19] In June 2013, it was announced the film would be titled 22 Jump Street.[20] In July 2013, Phil Lord and Christopher Miller confirmed they would return to direct the film.[21] On September 6, 2013, Amber Stevens joined the cast of the film.[11] On September 27, 2013, Kurt Russell mentioned that his son Wyatt turned down a role for The Hunger Games sequels to star in 22 Jump Street.[22] Principal photography began on September 28, 2013, in New Orleans, Louisiana, with shots in San Juan, Puerto Rico as well (acting for the shots in the movie as the spring break in \"Puerto Mexico\") and ended on December 15, 2013.[23][24]The end titles, featuring satirical concepts for an ongoing series of Jump Street films and merchandise, were designed by the studio Alma Mater.[25]","produced_by":"Neal H. Moritz|Jonah Hill|Channing Tatum|","starring":"Jonah Hill|Channing Tatum|Peter Stormare|Ice Cube|","running_time":"112 minutes[1]","music_by":"Mark Mothersbaugh","edited_by":"David Rennie|Keith Brachmann|","Release":"22 Jump Street grossed $191.7 million in North America and $139.4 million in other countries for a worldwide total of $331.3 million, against a budget of $65 million.[3] It outgrossed the first Jump Street film, which made a total of $201.6 million during its theatrical run.[27]22 Jump Street grossed $5.5 million at its early Thursday night showings.[28] On its opening day it grossed $25 million, including the early Thursday showings.[29] In North America, the film opened at number one in its first weekend, with $57.1 million.[30] In its second weekend, the film dropped to number two, grossing an additional $27.5 million.[31] In its third weekend, the film stayed at number two, grossing $15.8 million.[32] In its fourth weekend, the film dropped to number three, grossing $9.8 million.[33]22 Jump Street received positive reviews from critics. On the website Rotten Tomatoes, the film holds a rating of 85%, based on 198 reviews, with an average rating of 7/10. The site's critical consensus reads, \"Boasting even more of the bromantic chemistry between its stars — and even more of the goofy, good-natured humor that made its predecessor so much fun — 22 Jump Street is the rare sequel that improves upon the original.\"[34] On Metacritic, the film has a score of 71 out of 100, based on 46 critics, indicating \"generally favorable reviews\".[35]Inkoo Kang of The Wrap gave the film a positive review, saying \"If 22 isn't as trim and tight as its predecessor, it's certainly smarter and more heartfelt. Whether this sequel is better than the original is up for debate, but the franchise has definitely grown up.\"[36] Chris Nashawaty of Entertainment Weekly gave the film a B-, saying \"Hill's neurotic-motormouth act and Tatum's lovable-lunkhead shtick still shoot giddy sparks.\"[37] Claudia Puig of USA Today gave the film three out of four stars, saying \"This is the ultimate meta movie. The repetition is exactly the point.\"[38] Kyle Smith of the New York Post gave the film two out of four stars, saying \"What's the difference between 21 Jump Street and 22 Jump Street? Same as the difference between getting a 21 and a 22 at blackjack.\"[39] Jocelyn Noveck of the Associated Press gave the film three out of four stars, saying \"Hill and Tatum ... have a Laurel-and-Hardy-like implausible chemistry that keeps you laughing pretty much no matter what they're doing.\"[40] Bill Goodykoontz of The Arizona Republic gave the film four out of five stars, saying \"What makes it all work is the chemistry between Hill and Tatum, which in turn, of course, is a rich source of the film's humor.\"[41] Michael Phillips of the Chicago Tribune gave the film three out of four stars, saying \"The peculiar sweetness of 21 Jump Street has taken a hiatus in 22 Jump Street, a brazen sequel that's both slightly disappointing and a reliable, often riotous 'laffer' in the old Variety trade-magazine parlance.\"[42] Peter Travers of Rolling Stone gave the film three out of four stars, saying \"22 Jump Street is damn funny, sometimes outrageously so. It laughs at its own dumb logic and invites us in on the fun.\"[43] Joe Neumaier of the New York Daily News gave the film three out of four stars, saying \"Like its stars, Jump Street gets extra credit for getting by on charm while sticking to the rules.\"[44] Ian Buckwalter of NPR gave the film a seven out of ten, saying \"What separates 22 Jump Street from sequel mediocrity is that everyone's in on the joke.\"[45]Sean Fitz-Gerald of The Denver Post gave the film three out of four stars, saying \"Jump Street knows you know about the predictability and cheapness of sequels and rip-offs – and in this case, to avoid the downfalls of other summer comedy sagas, embracing that problem might have been the best move for this absurd, unique franchise.\"[46] Betsy Sharkey of the Los Angeles Times gave the film a positive review, saying \"This sequel's spoof of its predecessor's riff on the original 1980s-era buddy-cop TV show coalesces into a raucous, raunchy, irreverent, imperfect riot.\"[47] Ty Burr of The Boston Globe gave the film three and a half stars out of four, saying \"Lord and Miller are on a roll, and there may be no better moviemakers at playing to our modern need for irony – at giving us the entertainment we crave while acknowledging our distrust of it.\"[48] Rene Rodriguez of the Miami Herald gave the film three out of four stars, saying \"There's something going on at the edges of the frame in practically every scene of 22 Jump Street, a testament to the care and attention to detail directors Lord and Miller bring to this potentially silly material.\"[49] Stephen Whitty of the Newark Star-Ledger gave the film two and a half stars out of four, saying \"At what point is sarcasm just a cheap substitute for wit? Exactly when does joking about how all sequels are just lame, repetitive cash-grabs start to suggest that maybe yours is, too? Actually, in this case, about 40 minutes in.\"[50] Bill Zwecker of the Chicago Sun-Times gave the film three out of four stars, saying \"Though I enjoyed enormously this latest offering in the rebooted Jump franchise, it's the effortless, unexpected bromance/partnership between the two unlikely undercover cops is what makes this franchise work.\"[51]James Berardinelli of ReelViews gave the film two and a half stars out of four, saying \"There are times when 22 Jump Street is borderline brilliant. Unfortunately, those instances are outnumbered by segments that don't work for one reason or another.\"[52] Jaime N. Christley of Slant Magazine gave the film two out of four stars, saying \"As funny and batshit insane as the movie often is, the fact that 22 Jump Street knows it's a tiresome sequel doesn't save it from being a tiresome sequel, even as Lord and Miller struggle to conceal the bitter pill of convention in the sweet tapioca pudding of wall-to-wall jokes.\"[53] Scott Tobias of The Dissolve gave the film three and a half stars out of five, saying \"22 Jump Street squeezes every last drop of comic inspiration it can get from Tatum and Hill, as well as the very notion of a sequel to such a superfluous enterprise.\"[54] Steve Persall of the Tampa Bay Times gave the film a B, saying \"22 Jump Street is a mixed bag of clever spoofery and miscalculated outrageousness. The unveiled homoeroticism of practically all interaction between Jenko and Schmidt is amusing to the point when it isn't.\"[55] Ann Hornaday of The Washington Post gave the film three out of five stars, saying \"This is a sequel that wears its well-worn formula, mocking inside jokes and gleeful taste for overkill proudly, flying the high-lowbrow flag for audiences that like their comedy just smart enough to be not-too-dumb.\"[56] Scott Foundas of Variety gave the film a positive review, saying \"22 Jump Street hits far more often than it misses, and even when it misses by a mile, the effort is so delightfully zany that it's hard not to give Lord and Miller an 'A' for effort.\"[57]Peter Howell of the Toronto Star gave the film three out of four stars, saying \"If it seemed Channing Tatum and Jonah Hill couldn't possibly exceed their over-the-top buddy cop antics of 21 Jump Street, you lost that bet.\"[58] Tom Long of The Detroit News gave the film a B-, saying \"There's no real reason 22 Jump Street should work. Yet it does.\"[59] Joe Williams of the St. Louis Post-Dispatch gave the film three out of four stars, saying \"A self-aware sequel has to hop over hurdles to keep from swallowing its own tail, but the sharp writing and tag-team antics lift 22 Jump Street to a high level.\"[60] Mick LaSalle of the San Francisco Chronicle gave the film three out of four stars, saying \"22 Jump Street is exactly what comedy is today. It's coarse, free-flowing and playful.\"[61]22 Jump Street was released on DVD and Blu-ray on November 18, 2014.[62]","budget":"$65 million[2]"}