{"country":"United States","distributed_by":"Cannon Group","Plot":"Harry Mitchell (Roy Scheider) is a successful industrialist living in the suburbs of Los Angeles whose wife Barbara (Ann-Margret) is running for city council while he is having an affair. Harry is confronted by three blackmailers demanding $105,000 for a videotape of him and his mistress, Cini (Kelly Preston).Because of his wife's political aspirations, he can't go to the police. Harry's lawyer advises him that paying the blackmailers won't likely make them go away, so he refuses to pay. The three criminals up the ante by murdering Cini, capturing the killing on videotape and framing Harry for the murder, demanding $105,000 a year for the rest of his life to keep the evidence they have on him under wraps.Harry opens his financial records to one of the blackmailers, Alan Raimy (John Glover the ringleader of the group and who also has a background in accounting. Seeing that their mark owes money to the government and cannot afford the $105,000, Raimy agrees to accept Harry's counter offer of $52,000, at least as a first payment. Harry then turns the blackmailers against one another, putting his wife's life in grave danger in the process.A stripper, Doreen (Vanity), helps Harry, is assaulted by Raimy's accomplice, Bobby Shy (Clarence Williams III), who then kills their third partner, Leo, believing he has betrayed them. Raimy successfully ambushes and kills both Bobby and Doreen, then kidnaps Harry's wife and sedates her with a hypodermic needle. In the final scene, Harry brings the $52,000 ransom and also gives Raimy his sports car, which explodes after Raimy turns the key.","52_pick-up":"Theatrical release poster","language":"English","Reception":"The movie gained mixed reviews. On the one hand, Patrick Goldstein, writing in the Los Angeles Times, described it as \"a dull, plodding thriller that finds Mitchell in a deadly war with a trio of crazed blackmailers.\"[3] On the other hand, Roger Ebert, writing in the Chicago Sun-Times, claimed it \"provides us with the best, most reprehensible villain of the year and uses his vile charm as the starting point for a surprisingly good film. ... This is a well-crafted movie by a man who knows how to hook the audience with his story; it's Frankenheimer's best work in years.\"[4] The New York Times film critic Janet Maslin described it as \"fast-paced, lurid, exploitative and loaded with malevolent energy. John Frankenheimer, who directed, hasn't done anything this darkly entertaining since Black Sunday.\"[5]","box_office":"$5,186,646[1]","cinematography":"Jost Vacano and Stephen Ramsey","directed_by":"John Frankenheimer","release_dates":"November 7, 1986 (1986-11-07)|||||","Box office":"The movie debuted poorly at the box office.[6]","produced_by":"Yoram Globus and Menahem Golan","starring":"Roy Scheider|Ann-Margret|Vanity|John Glover|Clarence Williams III|","running_time":"110 minutes","music_by":"Gary Chang","edited_by":"Robert F. Shugrue","written_by":"Elmore Leonard (novel) Elmore Leonard and John Steppling (screenplay)"}