{"based_on":"Ben-Hur: A Tale of the Christ by Lew Wallace","country":"United States","distributed_by":"Loew's, Inc.[1]","ben-hur":"Original theatrical poster by Reynold Brown","screenplay_by":"Karl Tunberg[a]","Plot":"In AD 26, Judah Ben-Hur (Charlton Heston) is a wealthy prince and merchant in Jerusalem, who lives with his mother, Miriam (Martha Scott); his sister, Tirzah (Cathy O'Donnell); their loyal slave, Simonides (Sam Jaffe) and his daughter, Esther (Haya Harareet). Esther loves Judah but is betrothed to another. Judah's childhood friend, the Roman citizen Messala (Stephen Boyd), is now a tribune. After several years away from Jerusalem, Messala returns as the new commander of the Roman garrison. Messala believes in the glory of Rome and its imperial power, while Judah is devoted to his faith and the freedom of the Jewish people. This difference causes tension between the friends, and results in their split after Messala issues an ultimatum to Judah.During the parade for the new governor of Judea, Valerius Gratus, loose tiles fall from the roof of Judah's house. Gratus is thrown from his spooked horse and nearly killed. Although Messala knows this was an accident, he condemns Judah to the galleys and imprisons Miriam and Tirzah. By punishing a known friend and prominent citizen, he hopes to intimidate the Jewish populace. Judah swears to take revenge.After three years as a galley slave, Judah is assigned to the flagship of the Roman Consul Quintus Arrius (Jack Hawkins), who has been charged with destroying a fleet of Macedonian pirates. Arrius admires Judah's determination and self-discipline and offers to train him as a gladiator or charioteer. Judah declines the offer, declaring that God will aid him in his quest for vengeance. When the Roman fleet encounters the Macedonians, Arrius orders all the rowers except Judah to be chained to their oars. Arrius' galley is rammed and sunk, but Judah unchains the other rowers, and rescues Arrius. In despair, Arrius wrongly believes the battle ended in defeat and attempts to atone in the Roman way by \"falling on his sword\", but Judah stops him. They are rescued, and Arrius is credited with the Roman fleet's victory.Arrius successfully petitions Emperor Tiberius (George Relph) to free Judah, and adopts him as his son. Another year passes. Wealthy again, Judah learns Roman ways and becomes a champion charioteer, but still longs for his family and homeland.Judah returns to Judea. Along the way, he meets Balthasar (Finlay Currie) and an Arab, Sheik Ilderim (Hugh Griffith). The sheik has heard of Judah's prowess as a charioteer, and asks him to drive his quadriga in a race before the new Judean governor Pontius Pilate (Frank Thring). Judah declines, even after he learns that Messala will also compete.Judah returns to his home in Jerusalem. He meets Esther, and learns her arranged marriage did not occur and that she is still in love with him. He visits Messala and demands his mother and sister's freedom. The Romans discover that Miriam and Tirzah contracted leprosy in prison, and expel them from the city. The women beg Esther to conceal their condition from Judah so that he may remember them as they were before, so she tells him that they died. It is then that he changes his mind and decides to seek vengeance on Messala by competing against him in the chariot race.During the chariot race, Messala drives a Greek chariot with blades on the hubs to tear apart competing vehicles; he attempts to destroy Judah's chariot but destroys his own instead. Messala is fatally injured, while Judah wins the race. Before dying, Messala tells Judah that \"the race is not over\" and that he can find his family \"in the Valley of the Lepers, if you can recognize them.\" Judah visits the nearby leper colony, where (hidden from their view) he sees his mother and sister.Blaming Roman rule for his family's fate, Judah rejects his patrimony and Roman citizenship. Learning that Tirzah is dying, Judah and Esther take her and Miriam to see Jesus Christ (Claude Heater), but the trial of Jesus before Pontius Pilate has begun. Judah witnesses the crucifixion of Jesus, and Miriam and Tirzah are miraculously healed during the rainstorm following the crucifixion. Judah declares, \"And I felt His voice take the sword out of my hand.\"","Chariot race sequence":"The chariot race in Ben-Hur was directed by Andrew Marton and Yakima Canutt,[115] filmmakers who often acted as second unit directors on other people's films. Each man had an assistant director, who shot additional footage.[116] Among these were Sergio Leone,[117] who was senior assistant director in the second unit and responsible for retakes.[118] William Wyler shot the \"pageantry\" sequence that occurs before the race, scenes of the jubilant crowd, and the victory scenes after the race concludes.[119] The \"pageantry\" sequence before the race begins is a shot-by-shot remake of the same sequence from the 1925 silent film version.[120] Wyler added the parade around the track because he knew that the chariot race would be primarily composed of close-up and medium shots. To impress the audience with the grandeur of the arena, Wyler added the parade in formation (even though it was not historically accurate).[50]The chariot arena was modeled on a historic circus in Jerusalem.[96] Covering 18 acres (7.3 ha), it was the largest film set ever built at that time.[121] Constructed at a cost of $1 million, it took a thousand workmen more than a year to carve the oval out of a rock quarry.[95][96] The racetrack featured 1,500-foot (460 m) long straightaways and five-story-high grandstands.[96] Over 250 miles (400 km) of metal tubing were used to erect the grandstands.[47] Matte paintings created the illusion of upper stories of the grandstands and the background mountains.[122] More than 40,000 short tons (36,000 t) of sand were brought in from beaches on the Mediterranean to cover the track.[123] Other elements of the circus were also historically accurate. Imperial Roman racecourses featured a raised 10-foot (3.0 m) high spina (the center section), metae (columnar goalposts at each end of the spina), dolphin-shaped lap counters, and carceres (the columned building in the rear which housed the cells where horses waited prior to the race).[122][124] The four statues atop the spina were 30 feet (9.1 m) high.[44] A chariot track identical in size was constructed next to the set and used to train the horses and lay out camera shots.[124]Planning for the chariot race took nearly a year to complete.[96] Seventy eight horses were bought and imported from Yugoslavia and Sicily in November 1957, exercised into peak physical condition, and trained by Hollywood animal handler Glenn Randall to pull the quadriga (a Roman Empire chariot drawn by four horses abreast).[81][96] Andalusian horses played Ben-Hur's Arabians, while the others in the chariot race were primarily Lipizzans.[125] A veterinarian, a harness maker, and 20 stable boys were employed to care for the horses and ensure they were outfitted for racing each day.[81] The firm of Danesi Brothers[126] built 18 chariots,[127] nine of which were used for practice,[126] each weighing 900 pounds (410 kg).[17] Principal cast members, stand-ins, and stunt people made 100 practice laps of the arena in preparation for shooting.[93]Heston and Boyd both had to learn how to drive a chariot. Heston, an experienced horseman, took daily three-hour lessons in chariot driving after he arrived in Rome and picked up the skill quickly.[o] [42][129] Heston was outfitted with special contact lenses to prevent the grit kicked up during the race from injuring his eyes.[129] For the other charioteers, six actors with extensive experience with horses were flown in from Hollywood, including Giuseppe Tosi, who had once been a bodyguard for Victor Emmanuel III of Italy.[46]The chariot scene took five weeks (spread over three months) to film at a total cost of $1 million[130] and required more than 200 miles (320 km) of racing to complete.[121] Marton and Canutt filmed the entire chariot sequence with stunt doubles in long shot, edited the footage together, and showed the footage to Zimbalist, Wyler, and Heston to show them what the race should look like and to indicate where close-up shots with Heston and Boyd should go.[130] Seven thousand extras were hired to cheer in the stands.[12][121][p] Economic conditions in Italy were poor at the time, and as shooting for the chariot scene wound down only 1,500 extras were needed on any given day. On June 6, more than 3,000 people seeking work were turned away. The crowd rioted, throwing stones and assaulting the set's gates until police arrived and dispersed them.[131] Dynamite charges were used to show the chariot wheels and axles splintering from the effects of Messala's barbed-wheel attacks.[122] Three lifelike dummies were placed at key points in the race to give the appearance of men being run over by chariots.[132]The cameras used during the chariot race also presented problems. The 70mm lenses had a minimum focusing distance of 50 feet (15 m), and the camera was mounted on a small Italian-made car so the camera crew could keep in front of the chariots. The horses, however, accelerated down the 1,500-foot (460 m) straightaway much faster than the car could, and the long focal length left Marton and Canutt with too little time to get their shots. The production company purchased a more powerful American car, but the horses were still too fast, and even with a head start, the filmmakers only had a few more seconds of shot time. As filming progressed, vast amounts of footage were shot for this sequence. The ratio of footage shot to footage used was 263:1, one of the highest ratios ever for a film.[132]One of the most notable moments in the race came from a near-fatal accident when stunt man Joe Canutt, Yakima Canutt's son, was tossed into the air by accident; he incurred a minor chin injury.[133] Marton wanted to keep the shot, but Zimbalist felt the footage was unusable. Marton conceived the idea of showing that Ben-Hur was able to land on and cling to the front of his chariot, then scramble back into the quadriga while the horses kept going.[134] The long shot of Canutt's accident was cut together with a close-up of Heston climbing back aboard, resulting in one of the race's most memorable moments.[135] Boyd did all but two of his own stunts.[14] For the sequence where Messala is dragged beneath a chariot's horses and trampled, Boyd wore steel armor under his costume and acted out the close-up shot and the shot of him on his back, attempting to climb up into the horses' harness to escape injury. A dummy was used to obtain the trampling shot in this sequence.[133]Several urban legends exist regarding the chariot sequence. One claims that a stuntman died during filming, which Nosher Powell claims in his autobiography,[136] and another states that a red Ferrari can be seen during the chariot race. The book Movie Mistakes claims this is a myth.[137] Heston, in a DVD commentary track for the film, mentions that a third urban legend claims that he wore a wristwatch during the chariot race, but points out that he wore leather bracers up to the elbow.[138]","language":"English","box_office":"$146.9 million (initial release)","Remake":"On April 25, 2014, Paramount Pictures and MGM announced that they will co-produce another Ben-Hur film with Mark Burnett and Roma Downey, who also made the 2013 miniseries The Bible. The film is set for release in August 2016.[175] On September 11, Morgan Freeman was added to the cast to play the role of Ildarin, the man who teaches the slave Ben-Hur to become a champion-caliber chariot racer.[176]","cinematography":"Robert L. Surtees","production_company":"Metro-Goldwyn-Mayer","directed_by":"William Wyler","narrated_by":"Finlay Currie","release_dates":"November 18, 1959 (1959-11-18)|||||","Production":"Metro-Goldwyn-Mayer (MGM) originally announced a remake of the 1925 silent film Ben-Hur in December 1952, ostensibly as a way to spend its Italian assets.[b][5] Stewart Granger and Robert Taylor were reported to be in the running for the lead.[5] Nine months later, MGM announced it would make the film in CinemaScope, with shooting beginning in 1954.[6] In November 1953, MGM announced it had assigned producer Sam Zimbalist to the picture and hired screenwriter Karl Tunberg to write it.[7] Sidney Franklin was scheduled to direct, with Marlon Brando intended for the lead.[8] In September 1955, Zimbalist, who continued to claim that Tunberg's script was complete, announced that a $7 million, six-to-seven month production would begin in April 1956 in either Israel or Egypt in MGM's new 65mm widescreen process, MGM Camera 65.[9] MGM, however, suspended production in early 1956, following Franklin's resignation.[10]By the late 1950s, the consent decree of 1948 forcing film studios to divest themselves of theater chains[11] and the competitive pressure of television had caused significant financial distress at MGM.[12] In a gamble to save the studio, and inspired by the success of Paramount Pictures' 1956 Biblical epic The Ten Commandments,[12] studio head Joseph Vogel announced in 1957 that MGM would again move forward on a remake of Ben-Hur.[13] Filming started in May 1958 and wrapped in January 1959, and post-production took six months.[14] Although the budget for Ben-Hur was initially $7 million,[15] it was reported to be $10 million by February 1958,[16] reaching $15.175 million by the time shooting began—making it the costliest film ever produced up to that time.[17] When adjusted for inflation, the budget of Ben Hur was approximately $123 million in constant dollars.[18]One notable change in the film involved the opening titles. Concerned that a roaring Leo the Lion (the MGM mascot) would create the wrong mood for the sensitive and sacred nativity scene, Wyler received permission to replace the traditional logo with one in which Leo the Lion is quiet.[19]Lew Wallace's 1880 novel, Ben-Hur: A Tale of the Christ, ran to about 550 pages. Zimbalist hired a number of screenwriters to cut the story down and turn the novel into a script. According to Gore Vidal, more than 12 versions of the script had been written by various writers by the spring of 1958.[20] Vidal himself had been asked to write a version of the script in 1957, refused, and been placed on suspension for his decision.[20] According to Vidal, Karl Tunberg was one of the last writers to work on the script. Other sources place Tunberg's initial involvement much earlier. Tunberg cut out everything in the book after the crucifixion of Jesus, omitted the sub-plot in which Ben-Hur fakes his death and raises a Jewish army to overthrow the Romans, and altered the manner in which the leperous women are healed. [c][21] According to Wyler, Vidal, their biographers (see bibliography below) and the sources that follow them, Zimbalist was unhappy with Tunberg's script, considering it to be \"pedestrian\"[21] and \"unshootable\".[22]The writing effort changed direction when director Sidney Franklin fell ill and was removed from the production. Zimbalist offered the project to William Wyler, who had been one of 30 assistant directors on the 1925 film,[23] in early 1957.[24] Wyler initially rejected it, considering the quality of the script to be \"very primitive, elementary\" and no better than hack work.[25] Zimbalist showed Wyler some preliminary storyboards for the chariot race and informed him that MGM would be willing to spend up to $10 million, and as a result Wyler began to express an interest in the picture.[26] MGM permitted Wyler to start casting, and in April 1957, mainstream media outlets reported that Wyler was giving screen tests to Italian leading men, such as Cesare Danova.[27]Wyler did not formally agree to direct the film until September 1957,[26] and MGM did not announce his hiring until January 3, 1958.[28] Even though he still lacked a leading man, Wyler took the assignment for many reasons: He was promised a base salary of $350,000 as well as 8 percent of the gross box office (or 3 percent of the net profits, whichever was greater),[29] and he wanted to work in Rome again (where he had filmed Roman Holiday (1954).[12][15] His base salary was, at the time, the largest ever paid to a director for a single film.[12] Professional competitive reasons also played a role in his decision to direct, and Wyler later admitted that he wished to out do Cecil B. DeMille,[15] and make a \"thinking man's\" Biblical epic.[30] In later years, William Wyler would joke that it took a Jew to make a good film about Christ.[31]Wyler felt Tunberg's draft was too much of a morality play overlaid with current Western political overtones, and that the dialogue was too modern-sounding.[32] Zimbalist brought in playwright S. N. Behrman (who also wrote the script for Quo Vadis) and then playwright Maxwell Anderson to write drafts.[15] Gore Vidal biographer Fred Kaplan states that British poet and playwright Christopher Fry was hired simultaneously with Vidal, although most sources (including Vidal himself) state that Vidal followed Anderson, and that Fry did not come aboard until Vidal was close to leaving the picture.[33] Vidal arrived in Rome in early March 1958 to meet with Wyler.[20][d] Vidal claimed that Wyler had not read the script, and that when he did so (at Vidal's urging) on his flight from the U.S. to Italy, he was upset with the modernist dialogue.[20][34] Vidal agreed to work on the script for three months so that he would come off suspension and fulfill his contract with MGM,[15][20] although Zimbalist pushed him to stay throughout the entire production.[33] Vidal was researching a book on the 4th century Roman emperor Julian and knew a great deal about ancient Rome.[35]Vidal's working style was to finish a scene and review it with Zimbalist. Once Vidal and Zimbalist had come to agreement, the scene would be passed to Wyler.[33] Vidal said he kept the structure of the Tunberg/Behrman/Anderson script, but rewrote nearly all the dialogue.[36] Vidal admitted to William Morris in March 1959 that Fry rewrote as much as a third of the dialogue which Vidal had added to the first half of the script. Vidal made one structural change which was not revised, however. The Tunberg script had Ben-Hur and Messala reuniting and falling out in a single scene. Vidal broke the scene in two, so that the men first reunite at the Castle Antonia and then later argue and end their friendship at Ben-Hur's home. Vidal also added small character touches to the script, such as Messala's purchase of a brooch for Tirzah and Ben-Hur's purchase of a horse for Messala.[36] Vidal claimed that he worked on the first half of the script (everything up to the chariot race), and scripted 10 versions of the scene where Ben-Hur confronts Messala and begs for his family's freedom.[31][37]Vidal's claim about a homoerotic subtext is hotly debated. Vidal first made the claim in an interview in the 1995 documentary film The Celluloid Closet, and asserted that he persuaded Wyler to direct Stephen Boyd to play the role as if he were a spurned homosexual lover.[38] Vidal said that he believed that Messala's vindictiveness could only be motivated by the feeling of rejection that a lover would feel, and claimed to have suggested to Wyler that Stephen Boyd should play the role that way, and that Heston be kept in the dark about the Messala character's motivations.[31] Whether Vidal wrote the scene in question or had the acting conversation with Wyler, and whether Wyler shot what Vidal wrote, remain issues of debate.[21][31][39] Wyler himself says that he does not remember any conversation about this part of the script or Boyd's acting with Gore Vidal,[31] and that he discarded Vidal's draft in favor of Fry's.[15] Morgan Hudgens, publicity director for the film, however, wrote to Vidal in late May 1958 about the crucial scene, and implied there was a homosexual context: \"... the big cornpone [the crew's nickname for Heston] really threw himself into your 'first meeting' scene yesterday. You should have seen those boys embrace!\"[40] Film critic F. X. Feeney, in a comparison of script drafts, concludes that Vidal made significant and extensive contributions to the script.[41]The final writer on the film was Christopher Fry. Charlton Heston has claimed that Fry was Wyler's first choice as screenwriter, but that Zimbalist forced him to use Vidal.[31] Whether Fry worked on the script before Vidal or not, sources agree that Fry arrived in Rome in early May 1958 and spent six days a week on the set, writing and rewriting lines of dialogue as well as entire scenes, until the picture was finished.[42] In particular, Fry gave the dialogue a slightly more formal and archaic tone without making it sound stilted and medieval.[42] A highly publicized bitter dispute later broke out over screenplay credits to the film, involving Wyler, Tunberg, Vidal, Fry and the Screen Writers' Guild.[e][43]The final script ran 230 pages.[44] The screenplay differed more from the original novel than did the 1925 silent film version. Some changes made the film's storyline more dramatic. Others inserted an admiration for Jewish people (who had founded the state of Israel by this time) and the more pluralistic society of 1950s America rather than the \"Christian superiority\" view of Wallace's novel.[45]MGM opened a casting office in Rome in mid-1957 to select the 50,000 people who would act in minor roles and as extras in the film,[46] and a total of 365 actors had speaking parts in the film, although only 45 of them were considered \"principal\" performers.[47] In casting, Wyler placed heavy emphasis on characterization rather than looks or acting history.[48] He typically cast the Romans with British actors and the Jews with American actors to help underscore the divide between the two groups.[17][49] The Romans were the aristocrats in the film, and Wyler believed that American audiences would interpret British accents as patrician.[50]Several actors were offered the role of Judah Ben-Hur before it was accepted by Charlton Heston. Burt Lancaster stated he turned down the role because he found the script boring[51] and belittling to Christianity.[f] Paul Newman turned it down because he said he didn't have the legs to wear a tunic.[52] Marlon Brando,[52] Rock Hudson,[g] Geoffrey Horne,[h] and Leslie Nielsen[53] were also offered the role, as were a number of muscular, handsome Italian actors (many of whom did not speak English).[54] Kirk Douglas was interested in the role, but was turned down in favor of Heston,[i] who was formally cast on January 22, 1958.[56] His salary was $250,000 for 30 weeks, a prorated salary for any time over 30 weeks, and travel expenses for his family.[34]Stephen Boyd was cast as the antagonist, Messala, on April 13, 1958.[57] William Wyler originally wanted Heston for the role, but sought another actor after he moved Heston into the role of Judah Ben-Hur.[58] Because both Boyd and Heston had blue eyes, Wyler had Boyd outfitted with brown contact lenses as a way of contrasting the two men.[59] Marie Ney was originally cast as Miriam, but was fired after two days of work because she could not cry on cue.[50][60] Heston says that he was the one who suggested that Wyler cast Martha Scott as Miriam, and she was hired on July 17, 1958.[j][61][62] Cathy O'Donnell was Wyler's sister-in-law, and although her career was in decline, Wyler cast her as Tirzah.[48]More than 30 actresses were considered for the role of Esther.[63] The Israeli actress Haya Harareet, a relative newcomer to film, was cast as Esther on May 16, 1958,[63] after providing a 30-second silent screen test.[64] Wyler had met her at the Cannes Film Festival, where she impressed him with her conversational skills and force of personality.[65] Sam Jaffe was cast as Simonides on April 3, 1958,[66] and Finlay Currie was cast as Balthasar on the same day.[66] Wyler had to persuade Jack Hawkins to appear in the film, because Hawkins was unwilling to act in another epic motion picture so soon after The Bridge on the River Kwai.[32] Hugh Griffith, who gained acclaim in the post-World War II era in Ealing Studios comedies, was cast as the colorful Sheik Ilderim.[67] The role of Jesus was played by Claude Heater (uncredited), an American opera singer performing with the Vienna State Opera in Rome when he was asked to do a screen test for the film.[68]Robert L. Surtees, who had already filmed several of the most successful epics of the 1950s, was hired as cinematographer for the film.[69] Early on in the film's production, Zimbalist and other MGM executives made the decision to film the picture in a widescreen format. Wyler strongly disliked the widescreen format, commenting that \"Nothing is out of the picture, and you can't fill it. You either have a lot of empty space, or you have two people talking and a flock of others surrounding them who have nothing to do with the scene. Your eye just wanders out of curiosity.\"[70] The cameras were also quite large, heavy, and difficult and time-consuming to move.[70] To overcome these difficulties, Surtees and Wyler collaborated on using the widescreen lenses, film stocks, and projection technologies to create highly detailed images for the film.[71] Wyler was best known for composition in depth, a visual technique in which people, props, and architecture are not merely composed horizontally but in depth of field as well. He also had a strong preference for long takes, during which his actors could move within this highly detailed space.[71]The movie was filmed in a process known as \"MGM Camera 65\". 1957's Raintree County was the first MGM film to use the process.[72] The MGM Camera 65 used special 65mm Eastmancolor film stock with a 2.76:1 aspect ratio.[73] 70mm anamorphic camera lenses developed by the Mitchell Camera Company were manufactured to specifications submitted by MGM.[74] These lenses squeezed the image down 1.25 times to fit on the image area of the film stock.[75] Because the film could be adapted to the requirements of individual theaters, movie houses did not need to install special, expensive 70mm projection equipment.[76] Six of the 70mm lenses, each worth $100,000, were shipped to Rome for use by the production.[77][78][k]I spent sleepless nights trying to find a way to deal with the figure of Christ. It was a frightening thing when all the great painters of twenty centuries have painted events you have to deal with, events in the life of the best-known man who ever lived. Everyone already has his own concept of him. I wanted to be reverent, and yet realistic. Crucifixion is a bloody, awful, horrible thing, and a man does not go through it with a benign expression on his face. I had to deal with that. It is a very challenging thing to do that and get no complaints from anybody.Pre-production began at Cinecittà Studios around October 1957.[16] The MGM Art Department produced more than 15,000 sketches and drawings of costumes, sets, props, and other items needed for the film (8,000 alone for the costumes); photostatted each item; and cross-referenced and catalogued them for use by the production design team and fabricators.[80] More than a million props were ultimately manufactured.[81] Construction of miniatures for the entrance of Quintus Arrius into Rome and for the sea battle were under way by the end of November 1957.[82] MGM location scouts arrived in Rome to identify shooting locations in August 1957.[83] Location shooting in Africa was actively under consideration, and in mid-January 1958, MGM said that filming in North Africa (later revealed to be Libya) would begin on March 1, 1958, and that 200 camels and 2,500 horses had already been procured for the studio's use there.[84] The production was then scheduled to move to Rome on April 1, where Andrew Marton had been hired as second unit director and 72 horses were being trained for the chariot race sequence.[84] However, the Libyan government canceled the production's film permit for religious reasons on March 11, 1958, just a week before filming was to have begun.[l][85][86] It is unclear whether any second unit filming took place in Israel. A June 8, 1958, reported in The New York Times said second unit director Andrew Martin had roamed \"up and down the countryside\" filming footage.[87] However, the American Film Institute claims the filming permit was revoked in Israel for religious reasons as well (although when is not clear), and no footage from the planned location shooting near Jerusalem appeared in the film.[82]Principal photography began in Rome on May 18, 1958.[88] The script was still unfinished when cinematography began, so that Wyler had only read the first 10 to 12 pages of it.[89] Shooting lasted for 12 to 14 hours a day, six days a week. On Sundays, Wyler would meet with Fry and Zimbalist for story conferences. The pace of the film was so grueling that a doctor was brought onto the set to give a vitamin B complex injection to anyone who requested it (shots which Wyler and his family later suspected may have contained amphetamines).[90] To speed things up, Wyler often kept principal actors on stand-by, in full costume and make-up, so that he could shoot pick-up scenes if the first unit slowed down. Actresses Martha Scott and Cathy O'Donnell spent almost the entire month of November 1958 in full leprosy make-up and costumes so that Wyler could shoot \"leper scenes\" when other shots didn't go well.[91] Wyler was unhappy with Heston's performances, feeling they did not make Judah Ben-Hur a plausible character, and Heston had to reshoot \"I'm a Jew\" 16 times.[92] Shooting took nine months, which included three months for the chariot race scene alone.[93] Principal photography ended on January 7, 1959, with filming of the crucifixion scene, which took four days to shoot.[14][79]Italy was MGM's top choice for hosting the production. However, a number of countries—including France, Mexico, Spain, and the United Kingdom—were also considered.[94] Cinecittà Studios, a very large motion picture production facility constructed in 1937 on the outskirts of Rome, was identified early on as the primary shooting location.[16] Zimbalist hired Wyler's long-term production supervisor, Henry Henigson, to oversee the film, and art directors William A. Horning and Edward Carfagno created the overall look of the film, relying on the more than five years of research which had already been completed for the production.[95] A skeleton crew of studio technicians arrived in the summer of 1956 to begin preparing the Cinecittà soundstages and back lot.[94]The Ben-Hur production utilized 300 sets scattered over 148 acres (60 ha) and nine sound stages.[96] Several sets still standing from Quo Vadis in 1951 were refurbished and used for Ben-Hur.[96] By the end of the production more than 1,000,000 pounds (450,000 kg) of plaster and 40,000 cubic feet (1,100 m3) of lumber were used.[47][97] The budget called for more than 100,000 costumes and 1,000 suits of armor to be made, for the hiring of 10,000 extras, and the procurement of hundreds of camels, donkeys, horses, and sheep.[17][44] Costume designer Elizabeth Haffenden oversaw a staff of 100 wardrobe fabricators who began manufacturing the costumes for the film a year before filming began. Special silk was imported from Thailand, the armor manufactured in West Germany, and the woolens made and embroidered in the United Kingdom and various countries of South America. Many leather goods were hand-tooled in the United Kingdom as well, while Italian shoemakers manufactured the boots and shoes. The lace for costumes came from France, while costume jewelry was purchased in Switzerland.[98] More than 400 pounds (180 kg) of hair were donated by women in the Piedmont region of Italy to make wigs and beards for the production,[99] and 1,000 feet (300 m) of track laid down for the camera dollies.[47] A workshop employing 200 artists and workmen provided the hundreds of friezes and statues needed.[44] The mountain village of Arcinazzo Romano,[99] 40 miles (64 km) from Rome, served as a stand-in for the town of Nazareth.[42] Beaches near Anzio were also used,[81] and caves just south of the city served as the leper colony.[91] Some additional desert panoramas were shot in Arizona, and some close-up inserts taken at the MGM Studios, with the final images photographed on February 3, 1958.[88]The sea battle was one of the first sequences created for the film,[100] filmed using miniatures in a huge tank on the back lot at the MGM Studios in Culver City, California in November and December 1957.[56][96] More than 40 miniature ships[81] and two 175-foot (53 m) long Roman galleys, each of them seaworthy, were built for the live-action segment.[44] The ships were constructed based on plans found in Italian museums for actual ancient Roman galleys.[95] An artificial lake with equipment capable of generating sea-sized waves was built at the Cinecittà studios to accommodate the galleys.[47] A massive backdrop, 200 feet (61 m) wide by 50 feet (15 m) high, was painted and erected to hide the city and hills in the background.[47] To make the scene bloodier, Dunning sought out Italian extras who had missing limbs, then had the makeup crews rig them with fake bone and blood to make it appear as if they had lost a hand or leg during the battle.[100] When Dunning edited his own footage later, he made sure that these men were not on screen for long so that audiences would be upset.[100][m] The above-decks footage was integrated with the miniature work using process shots and traveling mattes.[102]One of the most lavish sets was the villa of Quintus Arrius, which included 45 working fountains and 8.9 miles (14.3 km) of pipes.[95] Wealthy citizens and nobles of Rome, who wanted to portray their ancient selves, acted as extras in the villa scenes.[46][96] To recreate the ancient city streets of Jerusalem, a vast set covering 0.5-square-mile (1.3 km2) was built,[12] which included a 75-foot (23 m) high Joppa Gate.[96] The sets were so vast and visually exciting that they became a tourist attraction, and various film stars visited during production.[12][103] The huge sets could be seen from the outskirts of Rome, and MGM estimated that more than 5,000 people were given tours of the sets.[47]Dismantling the sets cost $125,000.[47] Almost all the filmmaking equipment was turned over to the Italian government, which sold and exported it.[47] MGM turned title to the artificial lake over to Cinecittà.[47] MGM retained control over the costumes and the artificial lake background, which went back to the United States.[47] The chariots were also returned to the U.S., where they were used as promotional props.[47] The life-size galleys and pirate ships were dismantled to prevent them from being used by competing studios.[47] Some of the horses were adopted by the men who trained them, while others were sold.[47] Many of the camels, donkeys, and other exotic animals were sold to circuses and zoos in Europe.[47]A total of 1,100,000 feet (340,000 m) was shot for the film.[88] According to editor John D. Dunning, the first cut of the film was four and one-half hours long.[100][n] William Wyler stated that his goal was to bring the running time down to three and a half hours.[104] The most difficult editing decisions, according to Dunning, came during scenes which involved Jesus Christ, as these contained almost no dialogue and most of the footage was purely reaction shots by actors.[105] Dunning also believed that in the final cut the leper scene was too long and needed trimming. Editing was also complicated by the 70mm footage being printed. Because no editing equipment (such as the Moviola) existed which could handle the 70mm print, the 70mm footage would be reduced to 35mm and then cut. This caused much of the image to be lost.[106] When the film was edited into its final form, it ran 213 minutes and included just 19,000 feet (5,800 m) of film.[88] It was the third-longest motion picture ever made at the time, behind Gone With The Wind and The Ten Commandments.[88]The film score was composed and conducted by Miklós Rózsa, who scored most of MGM's epics,[107] although Zimbalist had previously commissioned and then set aside a score from Sir William Walton.[108] Rózsa conducted research into Greek and Roman music of the period to give his score an archaic sound while still being modern. Rózsa himself directed the 100-piece MGM Symphony Orchestra during the 12 recording sessions (which stretched over 72 hours). The soundtrack was recorded in six-channel stereo.[98] More than three hours of music were composed for the film,[109] and two-and-a-half hours of it were finally used, making it (as of 2001[update]) the longest score ever composed for a motion picture.[110] The score contains no leitmotifs for the main characters. While not a leitmotif, the score does transition from full orchestra to pipe organ whenever Jesus Christ appears.[98]Rózsa won his third Academy Award for his score. As of 2001[update], it was the only musical score in the ancient and medieval epic genre of film to win an Oscar.[110] Like most film musical soundtracks, it was issued as an album for the public to enjoy as a distinct piece of music. The score was so lengthy that it had to be released in 1959 on three LP records, although a one-LP version with Carlo Savina conducting the Symphony Orchestra of Rome was also issued. In addition, to provide a more \"listenable\" album, Rózsa arranged his score into a \"Ben-Hur Suite\", which was released on Lion Records (an MGM subsidiary which issued low-priced records) in 1959.[109][111] This made the Ben-Hur film musical score the first to be released not only in its entirety but also as a separate album.[110]The Ben-Hur score is considered to be the best of Rózsa's career.[112] The musical soundtrack to Ben-Hur remained deeply influential into the mid 1970s, when film music composed by John Williams for films such as Jaws, Star Wars, and Raiders of the Lost Ark became more popular among composers and film-goers.[113] Rózsa's score has since seen several notable re-releases, including by the Nuremberg Symphony Orchestra on Capitol Records in 1967, several of the tracks by the United Kingdom's National Philharmonic Orchestra and Chorus on Decca Records in 1977 and a Sony Music reissue as a two-CD set in 1991.[114] In 2012, Film Score Monthly and WaterTower Music issued a limited edition five-CD set of music from the film.[114]","produced_by":"Sam Zimbalist","starring":"Charlton Heston Jack Hawkins Haya Harareet Stephen Boyd Hugh Griffith","running_time":"212 minutes[2]","music_by":"Miklós Rózsa","edited_by":"John D. Dunning Ralph E. Winters","Release":"A massive $14.7 million marketing effort helped promote Ben-Hur.[139] MGM established a special \"Ben-Hur Research Department\" which surveyed more than 2,000 high schools in 47 American cities to gauge teenage interest in the film.[140] A high school study guide was also created and distributed.[140] Sindlinger and Company was hired to conduct a nationwide survey to gauge the impact of the marketing campaign.[141] In 1959 and 1960, more than $20 million in candy; children's tricycles in the shape of chariots; gowns; hair barrettes; items of jewelry; men's ties; bottles of perfume; \"Ben-Her\" and \"Ben-His\" towels; toy armor, helmets, and swords; umbrellas; and hardback and paperback versions of the novel (tied to the film with cover art) were sold.[93][107]Ben-Hur premiered at Loew's State Theatre in New York City on November 18, 1959. Present at the premiere were William Wyler, Charlton Heston, Stephen Boyd, Haya Harareet, Martha Scott, Ramon Novarro (who played Judah Ben-Hur in the 1925 silent film version), Spyros Skouras (president of the 20th Century Fox), Barney Balaban (president of Paramount Pictures), Jack L. Warner (president of Warner Bros.), Leonard Goldenson (president of the American Broadcasting Company), Moss Hart (playwright), Robert Kintner (an ABC Television executive), Sidney Kingsley (playwright), and Adolph Zukor (founder of Paramount Pictures).[142]During its initial release the film earned $33.6 million in North American theater rentals (the distributor's share of the box office), generating approximately $74.7 million in box office sales. Outside of North America, it earned $32.5 million in rentals (about $72.2 million at the box office) for a worldwide total of $66.1 million in rental earnings, roughly equivalent to $146.9 million in box office receipts.[139] It was the fastest-grossing film[12] as well as the highest grossing film of 1959,[143] in the process becoming the second-highest grossing film of all-time (at that time) behind Gone with the Wind.[144][145] Ben-Hur saved MGM from financial disaster,[146] making a profit of $20,409,000 on its initial release,[4] and another $10.1 million in profits when re-released in 1969.[12] By 1989, Ben-Hur had earned $90 million in worldwide theatrical rentals.[147]Ben-Hur received overwhelmingly positive reviews upon its release.[148] Bosley Crowther, writing for The New York Times, called Ben-Hur \"a remarkably intelligent and engrossing human drama\".[149] While praising the acting and William Wyler's \"close-to\" direction, he also had high praise for the chariot race: \"There has seldom been anything in movies to compare with this picture's chariot race. It is a stunning complex of mighty setting, thrilling action by horses and men, panoramic observation and overwhelming use of dramatic sound.\"[149] Jack Gaver, writing for United Press International, also had praise for the acting, calling it full of \"genuine warmth and fervor and finely acted intimate scenes\".[150] Philip K. Scheuer of the Los Angeles Times called it \"magnificent, inspiring, awesome, enthralling, and all the other adjectives you have been reading about it.\"[151] He also called the editing \"generally expert\" although at times abrupt.[151] Ronald Holloway, writing for Variety, called Ben-Hur \"a majestic achievement, representing a superb blending of the motion picture arts by master craftsmen,\" and concluded that \"Gone With the Wind, Metro's own champion all-time top grosser, will eventually have to take a back seat.\"[152] The chariot race \"will probably be preserved in film archives as the finest example of the use of the motion picture camera to record an action sequence. The race, directed by Andrew Marton and Yakima Canutt, represents some 40 minutes of the most hair-raising excitement that film audiences have ever witnessed.\"[152]There was some criticism, however. Crowther felt the film was too long.[149] Scheuer, whilst mostly praising the film, felt that its biggest fault was \"overstatement\", and that it hammered home at points long after they had been made. He singled out the galley rowing sequence, Jesus' journey to the place of crucifixion, and nearly all the sequences involving the lepers. He also lightly criticized Charlton Heston for being more physically than emotionally compelling.[151] John McCarten of The New Yorker was more critical of Heston, writing that he \"speaks English as if he'd learned it from records.\"[153] Even William Wyler later privately admitted he was disappointed with Heston's acting.[14] Film critic Dwight Macdonald also was largely negative.[148] He found the film so uninvolving and lengthy that he said, \"I felt like a motorist trapped at a railroad crossing while a long freight train slowly trundles by.\"[154] British film critic John Pym, writing for Time Out, was equally dismissive, calling the film a \"four-hour Sunday school lesson\".[155] Many French and American film critics who believed in the auteur theory of filmmaking saw the film as confirmation of their belief that William Wyler was \"merely a commercial craftsman\" rather than a serious artist.[25]The film currently has an 88% \"Certified Fresh\" rating on Rotten Tomatoes. The consensus reads, \"Uneven, but in terms of epic scope and grand spectacle, Ben-Hur still ranks among Hollywood's finest examples of pure entertainment.\"[156]Ben-Hur was nominated for 12 Academy Awards and won an unprecedented 11. As of 2016[update], only Titanic in 1998 and The Lord of the Rings: The Return of the King in 2004 have matched the film's wins.[157][158] The lone category where Ben-Hur did not win was for Best Adapted Screenplay (losing to Room at the Top), and most observers attributed this to the controversy over the writing credit.[14][159] MGM and Panavision shared a special technical Oscar in March 1960 for developing the Camera 65 photographic process.[160]Ben-Hur also won three Golden Globe Awards – Best Motion Picture – Drama, Best Director, Best Supporting Actor – Motion Picture for Stephen Boyd – and received a Special Achievement Award (which went to Andrew Marton for directing the chariot race sequence).[161] Heston was nominated for a Golden Globe in the Best Performance by an Actor in a Motion Picture – Drama category, but did not win. The picture also won the BAFTA Award for Best Film,[162] the New York Film Critics Circle Award for Best Film,[163] and the Directors Guild of America Award for Outstanding Directorial Achievement in a Motion Picture for William Wyler's masterful direction.[164]Ben-Hur also appears on several \"best of\" lists generated by the American Film Institute, an independent non-profit organization created by the National Endowment for the Arts in 1967. The \"AFI 100 Years... series\" were created by juries consisting of over 1,500 artists, scholars, critics, and historians, with movies selected based on the film's popularity over time, historical significance, and cultural impact. Ben-Hur appeared at #72 on the 100 Movies, #49 on the 100 Thrills, #21 on the Film Scores, #56 on the 100 Cheers and #2 on the AFI's 10 Top 10 Epic film lists. Judah Ben-Hur was also nominated as a hero and Messala nominated as a villain in the AFI's 100 Years...100 Heroes and Villains list. In 2004, the National Film Preservation Board selected Ben-Hur for preservation by the National Film Registry for being a \"culturally, historically, or aesthetically significant\" motion picture.[165]The film's first telecast took place on Sunday, February 14, 1971.[166] In what was then a television first for a Hollywood film, it was broadcast over five hours (including commercials) during a single evening by CBS,[167][q] preempting all of that network's regular programming for that one evening. It was watched by 85.82 million people for a 37.1 average rating.[168] It was one of the highest rated movies ever screened on television at the time (behind the broadcast premiere of Bridge on the River Kwai).[169]Ben-Hur has been released on home video on several occasions. Recent releases have all been on DVD and Blu-ray Disc. A two-sided single disc widescreen release occurred in the United States on March 13, 2001.[138] This release included several featurettes, including a commentary by Charlton Heston, a making-of documentary (made for a laserdisc release in 1993), screen tests, and a photo gallery.[138] This edition was released soon thereafter as a two-disc set in other countries. The film saw another DVD release on September 13, 2005.[170] This four-disc edition included remastered images and audio, an additional commentary, two additional featurettes, and a complete version of the 1925 silent version of Ben-Hur.[170] A boxed \"Deluxe Edition\", issued in the U.S. in 2002, included postcard-sized reprints of lobby cards, postcard-sized black-and-white stills with machine-reproduced autographs of cast members, a matte-framed color image from the film with a 35mm film frame mounted below it, and a 27-by-40-inch (69 by 102 cm) reproduction film poster.[171]In 2011, Warner Home Video released a 50th anniversary edition on Blu-ray Disc and DVD, making it the first home video release where the film is present on its original aspect ratio.[172] For this release, the film was completely restored frame by frame from an 8K scan of the original 65mm negative. The restoration cost $1 million, and was one of the highest resolution restorations ever made by Warner Bros.[173] A new musical soundtrack-only option and six new featurettes (one of which was an hour long) were also included.[174]","budget":"$15.2 million[3][4]"}