{"based_on":"Dead Calm  by Charles Williams","country":"Australia","distributed_by":"Warner Bros.","screenplay_by":"Terry Hayes","dead_calm":"Dead Calm poster","Plot":"Rae Ingram (Kidman), is involved in a car crash which results in the death of her son. Her older husband, a Royal Australian Navy officer John Ingram (Neill), suggests that they help deal with their grief by heading out for a vacation alone on their yacht. In the middle of the Pacific, they encounter a drifting boat that seems to be taking on water. A man, Hughie Warriner (Zane), rows over to the Ingrams' boat for help. He claims that his boat is sinking and that his companions have all died of food poisoning.Suspicious of Hughie's story, John rows over to the other ship, leaving Rae alone with Hughie. Inside, John discovers the mangled corpses of the other passengers and video footage indicating that Hughie may have murdered them in a feat of extraordinary violence. John rushes back to his own boat, but he's too late as Hughie awakes, knocks out Rae and sails their yacht away, leaving John behind.As John attempts to keep Hughie's ship from sinking and catch up with them, Rae awakens and tries to convince Hughie to go back for her husband. Hughie denies her request and keeps on sailing, alternating between kindness and bouts of rage. John manages to get through to his wife on the radio, but the water damage makes him unable to reply save for clicks on his boat's radio receiver. He can respond only yes or no to her questions. John assures her that he is following close by. Rae tries to stall the yacht by turning off the engine and tossing the keys overboard. Her dog jumps in to retrieve the keys and brings them back as he had done earlier with his fetch ball. Hughie starts the yacht back up and tries to convince Rae to be friends with him. Rae accepts, attempting to earn his trust. After a while, she goes back to the radar room to contact John. A blip appears on the edge of the radar's range, signifying the damaged boat. She soon learns that it is too far gone and will sink in the next several hours. With John unable to come to her rescue, Rae realizes that she alone must act and save her husband.Rae seduces Hughie, attempting to gain his trust. She tries to get to the ship's shotgun, but cannot get away from Hughie long enough. The two eventually have sex. Afterwards, she sits on her bed feeling guilty and devises another plan to bring him down. She fixes some lemonade, putting a heavy dose of her prescription sedatives into his drink. Claiming to go get dressed, Rae heads back for the shotgun, and is discovered soon after. As a fierce storm approaches, Rae and Hughie come to blows. Hughie takes hold of the shotgun, but the effects of the sedative cause him to aim poorly and shoot the radio by mistake. Rae eventually takes hold of a harpoon gun and locks herself in the bedroom. As the door opens she fires off a harpoon. Seeing blood she pushes it open, only to discover she killed her dog. Hughie comes out of hiding to strangle her, but passes out from the drugs. Rae ties him up and sails back to rescue John. Hughie comes to and cuts himself free with a shard of broken mirror, but after making his way to Rae, she shoots him in the shoulder with a harpoon and knocks him unconscious. She then sets him adrift in the boat's life raft and continues to look for her husband.Meanwhile, the damage and the storm have caused the other boat to sink almost completely. The storm intensifies and breaks the boat's main mast, trapping John below deck. The water rises and eventually he is submerged over his head, able to breathe only through a piece of pipe leading to the deck. The only way he can go is down into the boat's hull, in search of an opening. He takes one last breath from the pipe and dives. Through a gaping hole in the boat's bottom, John emerges back on the surface. He sets the wreck on fire to signal his location to Rae, who is now desperate to find him. Dusk sets in as Rae notices the flames and sets course to the faint fire on the horizon. Without any means to signal his wife, all John can do is wait on a piece of floating debris. After night falls, the pair reunite when Rae arrives and pulls John aboard.Later they find the life raft and Rae shoots it with a flare, setting it on fire. The next day they are relaxing on deck when John takes a break from washing Rae's hair to prepare breakfast for her. Her eyes closed, Rae feels a pair of hands begin massaging her scalp and assumes it is John, but when she opens her eyes she sees a bloody Hughie, who begins to strangle her. While Rae struggles, John arrives from below deck. Seeing her being attacked, he shoots Hughie in the mouth with a flare, killing him.","language":"English","Reception":"Dead Calm has an 82% \"fresh\" rating at Rotten Tomatoes based on 28 reviews, albeit significantly lower with audiences, culminating in a score of 62% \"fresh\" and a critical rating of 7.6/10.[7] According to Variety, Kidman is \"excellent throughout, ... [giving] the character of Rae real tenacity and energy;\" and the picture is \"handsomely produced and inventively directed.\"[8] Roger Ebert of the Chicago Sun-Times wrote that the film \"generates genuine tension.\"[9] Desson Howe of the Washington Post praised the film's creators: \"Noyce's direction moves impressively from sensual tenderness (between husband and wife) to edge-of-the-seat horror. With accomplished editing by Richard Francis-Bruce and scoring by Graeme Revell, he finds lurking dangers in quiet, peaceful waters.\"[10]On the other hand, Caryn James of The New York Times felt that the film was \"an unsettling hybrid of escapist suspense and the kind of pure trash that depends on dead babies and murdered dogs for effect,\" and that Dead Calm \"becomes disturbing for all the wrong reasons.\"[11] A number of critics faulted the film's ending as being over-the-top, with the Post's Howe writing, \"... while it's afloat, 'Dead Calm' is a majestic horror cruise. ... For much of the movie, you're enthralled. By the end, you're laughing.\"[10]The acting was generally considered excellent, with Zane being cited for injecting \"unforgettable humanity and evil puckishness into his role\"[10] and being \"suitably manic and evil.\" And while Rita Kempley of The Washington Post wrote \"what's most fascinating about it is Rae's place in the pantheon of heroines, an Amazon for the '90s,\"[12] the Times' James called Kidman's character \"tough but stupid.\"[11]The film is listed on The New York Times Top 1000 Movies list,[13] derived from editor Peter M. Nichols' The New York Times Guide to the Best 1,000 Movies Ever Made (St. Martin's Griffin, 2004).The film was the inspiration for 1993 Hindi language film Darr.[14]","box_office":"$10.2 million[3][4]","cinematography":"Dean Semler","production_company":"Kennedy Miller","directed_by":"Phillip Noyce","release_dates":"7 April 1989 (1989-04-07)|||||","Production":"The movie is based on the novel Dead Calm by Charles Williams, which Orson Welles had started filming in the late 1960s but never completed. Producer Tony Bill had tried to buy the rights from Welles but was never successful. He mentioned this to Phil Noyce, giving him a copy of the book in 1984. Noyce enjoyed the book and showed it to George Miller and Terry Hayes, who were enthusiastic. Miller managed to persuade Oja Kodar, Welles' companion who controlled the rights to the novel, to sell the book to Kennedy Miller.[5][6]Other than character names and the scenario of a woman trapped on a boat with a psychopath, the film bears little resemblance to the book, which had several other main characters (including Hughie's wife and another couple), and presented Hughie as a nominally asexual manchild.[citation needed]The movie was filmed over a 14-week span in the Whitsunday Islands in the winter of 1987. George Miller directed some sequences himself, including one where Sam Neill's character is tormented in the boat by a shark. This scene ended up being dropped from the final film. The final coda sequence was filmed at the request of Warner Bros seven months after principal photography finished.[5]","Box office":"Dead Calm grossed $2,444,407 at the box office in Australia,[15] which is equivalent to $4,253,268 in 2009 dollars. It grossed $7,825,009 in the U.S.[3]","produced_by":"Terry Hayes George Miller Doug Mitchell","starring":"Sam Neill|Nicole Kidman|Billy Zane|","running_time":"95 minutes[1]","music_by":"Graeme Revell","edited_by":"Richard Francis-Bruce","budget":"$10.4 million[2]"}