{"based_on":"Battle Hymn 1956 autobiography  by Dean Hess","country":"United States","distributed_by":"Universal Pictures Co. Inc.","Popular culture":"A poster for Battle Hymn appears outside the movie theater in the pilot episode of The Twilight Zone, \"Where Is Everybody?\"","Plot":"Prior to the attack on Pearl Harbor, Dean Hess (Rock Hudson) was a minister in Ohio. The attack prompts him to become a fighter pilot. Hess had accidentally dropped a bomb on an orphanage in Germany during World War II, killing 37 orphans. At the start of the Korean War, Hess volunteers to return to the cockpit and is assigned as the senior USAF advisor/Instructor Pilot to the Republic of Korea Air Force, flying F-51D Mustangs.As Hess and his cadre of USAF instructors train the South Korean pilots, several orphaned war refugees gather at the base. He solicits the aid of two Korean adults (En Soon Yang (Anna Kashfi), and Lun Wa (Philip Ahn) and establishes a shelter for the orphans. When the Communists begin an offensive in the area, Hess evacuates the orphans on foot and then later, after much struggle with higher headquarters, obtains an airlift of USAF cargo aircraft to evacuate them to the island of Cheju where a more permanent orphanage is established.","battle_hymn":"Film poster by Reynold Brown","language":"English","Reception":"Bosley Crowther dismissed the film in The New York Times, writing, \"Perhaps the most candid comment to be made about Universal's 'Battle Hymn' is also the most propitious, so far as its box-office chances are concerned. That is to say, it is conventional. It follows religiously the line of mingled piety and pugnacity laid down for standard idealistic service films. What's more, it has Rock Hudson playing the big hero role. And it is in CinemaScope and color. Wrap them up and what have you got? The popular thing.\"[6]","box_office":"$3.9 million (US)","cinematography":"Russell Metty[Note 1]","production_company":"Universal-International","directed_by":"Douglas Sirk","References":"NotesCitationsBibliography","release_dates":"February 14, 1957 (1957-02-14) (U.S.)|||||","Production":"Lt. Col. Hess was a technical advisor to Universal to ensure that the final production did not stray far from his original biography. Nonetheless, the inevitable \"Hollywood\" screenplay prevailed.[2] Hess had a hand in vetoing the studio's first choice to play him: Robert Mitchum, having reservations about the actor's character.[3] Unable to film in Korea, locations shifted to Nogales, Arizona that provided at least a modicum of similar landscape. On Soon Whang, Director of the Orphans Home of Korea arrived in the U.S. along with 25 orphans who would reprise their own lives on film.[4]In order to replicate the ROK unit, the 12 F-51D Mustangs of 182nd Fighter Squadron, 149th Fighter Group of the Texas Air National Guard were enlisted by the USAF to provide the necessary authentic aircraft of the period. During filming, an additional surplus F-51 was acquired from USAF stocks to be used in an accident scene where it would be deliberately destroyed.[5]The gold flying helmet with the United Nations emblem that Rock Hudson wears in the movie was Dean Hess's actual helmet. It was a Navy-issue helmet that Hess scrounged from a Navy pilot who crash-landed at their airfield in Korea (since the Navy pilot was going to be issued a new helmet as a result of the crash-landing). The helmet is now on display at the National Museum of the United States Air Force at Wright-Patterson AFB, Dayton, Ohio.There were significant differences between the film and real life as recorded in Hess's book. Most prominently, On Soon Whang, Director of the Orphans Home of Korea, incorrectly identified as En Soon Yang in the film, was approximately 50 years old at the time, and was Korean (instead of half-Indian to match Anna Kashfi's screen image). On Soon Whang was a personal friend of Mr. and Mrs. Syngman Rhee, the President and First Lady of the Republic of Korea, and was introduced to Hess by them and she survived the war, meeting Hess in 1954. Hess had already been an ordained minister when he became a fighter pilot in World War II, was not nearly as emotionally affected by the accidental bombing of the German orphanage as depicted, and was recalled to active duty in July 1948, two years before the start of the Korean War.In the film, there was an incident where a pilot named Lieutenant Maples (played by James Edwards) accidentally strafes a truckload of civilian refugees that happened to be near a convoy of North Korean troop trucks. In the real-life incident, it was a fishing junk full of civilian refugees that happened to be near an amphibious assault by North Korean landing craft.","produced_by":"Ross Hunter","starring":"Rock Hudson Anna Kashfi Dan Duryea","running_time":"108 min.","music_by":"Frank Skinner","edited_by":"Russell F. Schoengarth","written_by":"Vincent B. Evans Charles Grayson"}