{"country":"Italy|France[4]|","distributed_by":"Warner Bros. (Italy)[3]","Plot":"Rosy (Michèle Mercier), a French call-girl, returns to her basement apartment at night. She receives a series of strange phone calls. The caller eventually identifies himself as Frank, her former pimp who has recently escaped from prison. Rosy is terrified; it was her testimony that sent Frank to prison. Rosy phones Mary (Lydia Alfonsi) for solace. The women have been estranged, but Rosy is certain that only Mary can help her. Mary agrees to come over that night. Seconds later, Frank calls again, promising that no matter what Rosy does he will have his revenge. Rosy doesn't realize that Mary is impersonating Frank on the telephone. Mary arrives at Rosy's apartment and attempts to calm Rosy's nerves. Mary provides Rosy with a large knife for protection before she goes to sleep.As Rosy sleeps, Mary writes a confession explaining that she made the calls to force a reunion, knowing that Rosy would call on her for help. While she is writing, an intruder enters the apartment. The intruder is Frank, who strangles Mary. The sound of their struggle awakens Rosy, and Frank realizes he murdered the wrong woman. Frank approaches Rosy's bed, but she seizes her knife and stabs Frank. Rosy drops the knife and breaks down in hysteria.In 19th Century Russia, Vladimir Durfe (Mark Damon) is a young nobleman who finds a beheaded corpse with a knife plunged into its heart. He takes the blade, and finds shelter in a small cottage. Durfe is approached by Giorgio (Glauco Onorato) who explains that the knife belongs to his father, who has not been seen for five days. Giorgio offers a room to Durfe and introduces him to the rest of the family: his wife (Rika Dialina), their young son Ivan, Giorgio's younger brother Pietro (Massimo Righi), and sister Sdenka (Susy Andersen). They all await the return of Gorca, who has gone to fight the wurdalak, a living cadaver who feeds on human blood, especially of close friends and family members. At midnight, Gorca (Boris Karloff) returns to the cottage with a sour demeanor and unkempt appearance. After the family goes to sleep, Ivan and Pietro are attacked by Gorca who flees the cottage with Ivan. Giorgio chases after Gorca but only returns with Ivan's corpse. Giorgio plans to stake and behead Ivan to prevent him from reviving as a Wurdalak, but is prevented from doing so by his wife. The two agree to give their son a burial.That same night, their child appears outside and begs to be invited in. Giorgio is stabbed by his wife while she attempts to let in her son. On opening the door, she is greeted by Gorca who bites her. Vladimir and Sdenka flee from their home and hide in the ruins of a cathedral. As Vladimir sleeps, Sdenka walks outside and finds Gorca and his family surrounding her. Vladimir awakens and searches for Sdenka, finding her lying motionless in her bed at home. Sdenka awakens and upon receiving Vladimir's embrace, she bites into his neck.In London, England, Nurse Helen Chester (Jacqueline Pierreux) is called to a large house to prepare the corpse of an elderly medium for her burial. As she dresses the body, she notices a sapphire ring on its finger. Chester steals it, accidentally tipping over a glass of water which drips on the floor; she is then assailed by a fly. Chester takes her ring home to her flat and witnesses strange events. The fly returns and continues to pester her, and the lights in her apartment go out as the sound of the dripping water is heard from various locations. Chester finds the woman's corpse lying in her bed. It rises and floats toward her. Chester begs for forgiveness, but ultimately strangles herself. The next morning, the concierge (Harriet White Medin) discovers Chester's body and calls the police. The pathologist arrives to examine the body and only finds a small bruise on her left finger where her ring once was. As the doctor announces this observation, the concierge appears distressed and hears the dripping of water.","Reception":"In a contemporary review of the American International Picture's edit, The Globe and Mail stated that \"The Drop of Water\" and \"The Telephone\" were \"a good deal more sophisticated than usual horror fare\" while \"The Wurdulak\" \"bears no trace of [Bava's] manner of directing\" and that the acting was \"rudimentary\".[45] The Boston Globe gave the film a negative review, referring to the Black Sabbath as \"three short films botched together\".[46] The Monthly Film Bulletin stated that \"the eeriest thing about the picture is its decor (especially the heavy, dusty interiors of [The Drop of Water]\" while noting the \"acting is very unstylish and made worse by dubbing\".[47] The review stated that Bava could \"do better than this with less obvious material\" and that he seemed \"determined to spell everything out with a sudden zoom shots and shock cuts.\"[47]Reviewing the English-language version of the film, Time Out praised the film stating that \"pictorially it's amazing, and even the script and dubbing are way above average.\"[48] Time Out compared the film to anthology horror films made by the British production company Amicus noting that \"If only Amicus...had taken heed they might have got some ideas as to what can be done with the format.\"[48] Entertainment Weekly awarded the film an A- rating referring to it as \"excellent\" and that the stories were \"composed of three tales of expertly building suspense\"[49] Kim Newman wrote in a retrospective review of the English dub, that \"The Drop of Water\" is the best of the three stories, and was described as \"Bava's most simply frightening work.\"[36] \"The Telephone\" was dismissed as being \"less satisfying\", specifying that it potentially American International Pictures attempt at re-writing the story that caused the stories problems.[36] Newman declared that \"The Wurdalak\" was a \"little masterpiece\" praising Karloff's performance and that the themes of the story looked torwards the themes in Night of the Living Dead and It's Alive.[36]In contemporary reviews of the Italian-language version, The Dissolve gave the film three and a half stars out of five, stating \"There are small twists in all three stories, but for the most part, the segments suggest where they’re headed early\" and that the dialogue in the film is \"sparse, and doesn't shy away from any exploitable elements, from scantily clad women to bloody wounds and warped-faced ghouls. But even more terrifying is the movie’s atmosphere of doom [...] Black Sabbath is fraught with fatalism.\"[50] Total Film awarded the film four stars out of five, referring to it as a \"wonderful horror anthology\".[51] Online film database AllMovie praised \"The Wurdulak\" stating that Karloff's \"ghostly visage provides several unforgettable scares\" and that \"The Drop of Water\" is short but \"remains scary and suspenseful throughout\"[25] AllMovie described \"The Telephone\" as \"only an average tale that follows through to a predictable twist\"[25] In the early 2010s, Time Out conducted a poll with several authors, directors, actors and critics who have worked within the horror genre to vote for their top horror films.[52] Black Sabbath placed at number 73 on their top list.[53]","Influence and aftermath":"Boris Karloff enjoyed working with Bava on Black Sabbath and he praised his work to both Christopher Lee and Vincent Price who would later go on to work with Bava in The Whip and the Body and Dr. Goldfoot and the Girl Bombs respectively.[54][55][56] Plans were initially going to be made to involve Bava and Karloff working together on a film titled Scarlet Friday based on \"The Dunwich Horror\".[57] The project was later taken away from Bava and was released as The Dunwich Horror directed by Daniel Haller without Karloff involved.[57][58]The English rock band Black Sabbath appropriate their name from the film.[59] Originally known as Earth, the group wanted to change their name as another group had the same name.[60] The group saw a local cinema playing Black Sabbath and marveled that people paid money to be frightened.[60]Directors Roger Avary and Quentin Tarantino were influenced by Black Sabbath's story structure for their original script for Pulp Fiction (1994).[61] The film was originally going to be three short films with each one being directed by Avary, Tarantino and another unknown director.[61][62] Tarantino originally described this idea by stating that \"what Mario Bava did with the horror film in Black Sabbath, I was gonna do with the crime film.\"[63]","box_office":"₤103.5 million","cinematography":"Ubaldo Terzano|Mario Bava|","production_company":"Emmepi Cinematografica Galatea Film Societé Cinématographique Lyre[2]","directed_by":"Mario Bava","release_dates":"September 17, 1963 (1963-09-17) (Italy)|November 17, 1965 (1965-11-17) (France)||||","Production":"In 1958, American International Pictures founders James H. Nicholson and Samuel Z. Arkoff hired European talent agent Flavio Lucisano to look for Italian commercial films for them after the large success of the Italian feature Hercules (1958).[5] In February 1963, American International Pictures made a deal with the Italian film production company Galatea that they would contribute to a minimum of nine co-productions in the next eight years.[6] Black Sabbath follows many production trends of Italian films of the era.[7] These co-productions were influenced by the lack of large film stars in Italy.[6] To avoid high costs or larger stars, producers created anthology films involving three or four short narratives whose combined running time was that of a regular feature film, as in Yesterday, Today and Tomorrow (1963).[6] A second trend was to match an up-and-coming actor or a much older actor with a European ingenue actress, as in Spy in Your Eye which paired Pier Angeli and Dana Andrews.[6][7] The third trend was the move towards making Westerns and horror films which were less expensive to produce than the previous sword and sandal films.[7]American International Pictures secured the rights to have American actors Mark Damon and Boris Karloff while the French co-production company Societé Cinématographique Lyre secured Michele Mercier and Jacqueline Pierreux (the latter is credited under the pseudonym Jacqueline Soussard).[7][8] Mercier had previously worked with director Mario Bava on his film The Wonders of Aladdin (1961).[9] Italian production company Galatea had Susy Andersen cast while retaining Mario Bava who had directed their production of Black Sunday.[7]Bava is credited as writing the film's script along with Alberto Bevilacqua and Marcello Fondato.[1] The film's opening credits credit the stories as \"The Drop of Water\" by Ivan Chekov, \"The Telephone\" by F.G. Snyder and \"Sem'ya vurdalaka\" by Aleksei Tolstoy.[1][10] Bava later took credit for the original story of \"The Drop of Water\", but Italian critic Antonio Bruscini traced its origins to a story titled \"Dalle tre alle tre e mezzo\" (\"Between Three and Three-thirty\") that was included in a 1960 anthology book titled Storie di fantasmi (Ghost Stories).[10][11][12] British historian Julian Granger identified the author of the story as Franco Lucentini.[11] \"The Wurdulak\" is loosely based on The Family of the Vourdalak by Aleksey Konstantinovich Tolstoy.[13] The story of \"The Wurdulak\" was found in the 1960 anthology I vampiri tra noi.[14] Other parts of the story were inspired by the Guy de Maupassant story \"Fear\" and Bram Stoker's Dracula.[15]Bevilacqua stated that Bava wanted to create a stories about how terror can strike mankind in different time periods and asked his screenwriters to get him stories from books.[16][17] After Bevilacqua finished his draft the screenplay, Marcello Fondato was brought in to work on it.[17] Bevilacqua claimed that he was recalled for later rewrites, but that most of his added material was cut from the final film.[18] American International Pictures approved of Bava's thematic idea but encouraged him to look for public domain titles.[19]It was decided early in production that Boris Karloff would not only star in one of the tales, but also act as the film's host; he had recently hosted his own anthology television series, Thriller.[20] Karloff was under contract with American International Pictures, and had just completed filming The Raven for them.[21] The film's cinematographer is credited as Ubaldo Terzano, but Bava shot several scenes himself without credit.[1]Black Sabbath was made at the end of production of The Girl Who Knew Too Much during an eight-week period between February and March 1963.[22][23] American International Production's involvement with the film allowed Salvatore Billitteri of the Titra Sound Corporation to be on set to supervise the film for dubbing on its English-language release.[7] As the film was going to be dubbed in different languages, actors could no longer phonetically pronounce their dialogue as it had to be done rhythmically to match various languages.[7] Billitteri was also on set to give suggestions to Bava on how to make his film more appropriate for American audiences which led to decreasing the amount of violence in the film.[24] The film was first conceived under the title The Fear.[16]Bava wanted to include a contemporary story which led to the development of \"The Telephone\".[19] \"The Telephone\" has been described as \"one of Bava's first attempts at a giallo film[25][26] The giallo film is a style of Italian film that involves a murder mystery that emphasized stylish visuals, flamboyant music and violence.[27][28] \"The Telephone\" was Bava first color film that attempted to emulate the visual style of the covers that appeared on giallo digests.[28] Some of the set pieces for \"The Telephone\" were taken from the black-and-white giallo film The Girl Who Knew Too Much (1962).[26]\"The Wurdulak\" was the last of the short films to be shot, with shooting commencing on either February 25 or 27.[29] While filming, Karloff contracted pneumonia which led to him having to rely on oxygen tanks after production ended.[30] Bava was initially going to end the film on a shot of Jacqueline Pierreux's dead character.[20] On the last day of filming, Billitteri suggested to not end the film on such a bleak image and told Bava to change it.[20] Bava changed the ending to Boris Karloff's character of Gorka on horseback who cautions the audience to watch out for vampires. The camera than pans back revealing he is on a stuffed horse revealing the studio set and simulated effects.[20]By the 1960s, Italian horror films such as Black Sabbath were more violent, sexualized and downbeat than the horror films created in America.[31] American International Pictures focused on a youth-oriented audience whereas horror in Europe was intended for adults.[31][32] The lead to the American edit removing plot elements of prostitution and lesbianism and making the most altered of Bava's films on its English language version.[32][33] American International Pictures made changes to all three stories and intro segments in the English-language version of the film. The company re-arranged the order of the stories to start with \"The Drop of Water\", followed by \"The Telephone\" and then \"The Wurdalak\".[32] Changes were then made the plots with the most extensively edited being \"The Telephone\".[32] \"The Telephone\" removes any suggestion of a lesbian relationship between Rosy and Mary and references to prostitution.[32] The character of Frank is also no longer a pimp but a ghost who leaves behind enchanted notes that magically write themselves as soon as the envelope they are contained in is opened.[32][34] A new character is introduced named \"The Colonel\" who is Suzy's neighbor in the film.[34] \"The Wurdalak\" features alternative cuts of certain scenes and has violence trimmed from the Italian version.[20] \"The Drop of Water\" features the least amount of changes from the Italian version.[20] American International Pictures reshot the introduction by Boris Karloff in Los Angeles. It is unknown who directed these scenes.[24]American International Pictures completely changed the Roberto Nicolosi's soundtrack from the original film with a soundtrack from Les Baxter.[20][35] Kim Newman described Baxter's score as \"inappropriate\" with \"each shock is accompanied by overdone 'scary music'\".[36] Both the Italian and English language films have a different look. Bava supervised the Italian language version at Technicolor Roma under his own supervision while American International Pictures shipped their version to Pathé Color for processing.[35] Mario Bava biographer Tim Lucas described the English language print as looking \"warmer, but less nuanced, with flatter tonalities\" and that it \"doesn't look bad\" but that the Italian version \"looks more vibrant, more flamboyantly nightmarish\".[35]","produced_by":"Salvatore Billitteri|Paolo Mercuri[1]|","starring":"Boris Karloff|Mark Damon|Michèle Mercier|Susy Andersen|Lydia Alfonsi|Glauco Onorato|Jacqueline Pierreux|","running_time":"93 minutes[3]","music_by":"Roberto Nicolosi","edited_by":"Mario Serandrei","Release":"The film opened in Italy in September 17, 1963 under the title I tre volti della paura which translates to The Three Faces of Fear.[3][8][37] Black Sabbath grossed ₤103.5 million Italian lira on its initial theatrical release in Italy.[3] American International Pictures released the English version of Black Sabbath in May 6, 1964 as a double bill with Bava's The Girl Who Knew Too Much then titled The Evil Eye.[3][38] The English title of Black Sabbath was chosen to connect it with Bava's previous film Black Sunday.[37] The film opened in Paris in November 1965 under the title Les trois visages de la peur.[8]In 2004, Variety announced that Valhalla Motion Pictures and Kismet Entertainment Group were collaborating to produce a remake Black Sabbath.[39] Jonathan Hensleigh was attached to contribute to the script development of the film.[39]Image Entertainment released the film in both the English and Italian versions on DVD on August 1, 2000.[40] Kino released the film on Blu-ray and DVD on July 16, 2013.[41] Kino's edition of the film was mastered in high definition from the 35mm negative with the Italian language dub and original soundtrack.[41] Arrow Films released Black Sabbath on DVD and Blu-ray in 2013.[42] Arrow's transfer of the Italian version was from an original 35mm internegative print transferred in Italy that had additional grading and restoration done in London.[43] Arrow's version of the American version of Black Sabbath was made from an 35mm interpositive in California.[43] Arrow noted the high definition master they received from Italy was very difficult to restore as the master had issues with the image, sound and color quality and had the stories in the wrong order.[44]","black_sabbath":"Italian release poster","written_by":"Mario Bava|Alberto Bevilacqua|Marcello Fondato|"}