{"Cast":"Bullock replaced original actress Lori Petty in the role of Lenina Huxley after a few days filming.[6] Her character's name is a reference to Aldous Huxley, the author of Brave New World, and Lenina Crowne, a character in Brave New World.[4]Originally Jean-Claude Van Damme and Steven Seagal were offered lead roles in the film.[7] The role of Simon Phoenix was also offered to Jackie Chan.[8]","Adaptations":"A four-part limited-series comic adaptation was published by DC Comics starting in November 1993. A novelization, written by Robert Tine, was also published in October 1993.[citation needed]Acclaim Entertainment and Virgin Interactive released Demolition Man on various home video game systems. The 16-bit versions were shooting games distributed by Acclaim. The 3DO version is a multi-genre game that incorporates Full Motion Video scenes, with both Sylvester Stallone and Wesley Snipes reprising their roles as their characters in scenes that were filmed exclusively for the game.[citation needed]In April 1994, Williams released a widebody pinball machine, Demolition Man based on the movie. It is designed by Dennis Nordman. The game features sound clips from the movie, as well as original speech by Stallone and Snipes. This game was part of WMS' SuperPin series (Twilight Zone, Indiana Jones, etc.).","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Daniel Waters|Robert Reneau|Peter M. Lenkov|","story_by":"Peter M. Lenkov|Robert Reneau|","demolition_man":"Theatrical release poster","Plot":"In 1996, psychopathic career criminal Simon Phoenix kidnaps a number of hostages and takes refuge with his gang in an abandoned building. LAPD Sgt. John Spartan uses a thermal scan of the building and finds no trace of the hostages, and leads an unauthorized assault to capture Phoenix. When he is captured, Phoenix sets off a series of explosives that bring down the building, and when the police search the wreckage, they find the corpses of the hostages. Spartan is charged with manslaughter, and he is incarcerated along with Phoenix in the city's new \"California Cryo-Penitentiary\", where they will be cryogenically frozen. During their time \"in deep freeze\", they are to be rehabilitated through subconscious conditioning.During their incarceration, the \"Great Earthquake\" leads the cities of Los Angeles, San Diego, and Santa Barbara to merge into a single metropolis under the name San Angeles. The city becomes a utopia run under the pseudo-pacifist guidance and control of the evangelistic Dr. Raymond Cocteau, where human behavior is tightly controlled. In 2032, Phoenix is woken for a parole hearing, but he finds he somehow knows the access codes to the security systems, and is able to escape the prison and begins wreaking havoc on the city. The police, having not dealt with violent crime for many years, are unable to handle Phoenix and opt to wake Spartan and enlist his help. Spartan is assigned to Lieutenant Lenina Huxley to help with acclimation to the future, which he finds depressing. Others on the police force find his behavior brutish and uncivilized, though Huxley, who is fascinated by the lifestyles of the late 20th century, helps Spartan to overcome this, and the two grow close, despite the limitations on displays of public affection.They attempt to stop Phoenix from stealing 20th century weapons from a museum display, but Phoenix manages to escape. Phoenix encounters Dr. Cocteau during his escape, and though he tries to shoot him, finds himself unable to do so. Dr. Cocteau calmly asks Phoenix to assassinate Edgar Friendly, the leader of the resistance group called the Scraps that fight against Cocteau's rule, and allows Phoenix to bring other criminals out of cryo-sleep to help at his request. Meanwhile, Spartan and Huxley review the cryo-prison records and find that instead of the normal rehabilitation program, Phoenix had been given the information necessary for his escape by Cocteau directly. They also discover information directing Phoenix towards Friendly, and go off to warn him.At the Scraps' underground base, Friendly is initially distrustful but Spartan is able to convince him of the threat and takes sympathy in their cause given what he has seen above ground. When Phoenix and his gang attack, Spartan and the Scraps ward off the attack, leading to a car chase between Spartan and Phoenix. During the chase, Phoenix taunts Spartan by revealing that he had killed the hostages before Spartan had arrived in 1996. Phoenix escapes while Spartan comes to terms that he had been wrongly charged with the crime. Meanwhile, Friendly and the Scraps work with the police to try to help stop Phoenix and his gang of cryo-cons.Phoenix returns to Dr. Cocteau with his gang, and as the rehabilitation programming prevents him from killing Cocteau, orders one of his gang to do so. Spartan and Huxley arrive soon after, finding that Phoenix has already left to release more prisoners. Spartan enters the prison alone to fight Phoenix, engages in a violent fight that ravages the facility, and eventually uses the cryogenic chemical to freeze Phoenix before shattering him. Spartan escapes the prison before it explodes and regroups with the police and the Scraps. The police fear the loss of Cocteau will send their society into a downward spiral, but Spartan suggests that they and the Scraps work together to recreate a society that returns some of the personal freedoms that were lost. He then kisses Huxley and the two go off together.","language":"English","Reception":"Rotten Tomatoes gives the film a 64% rating based on 36 reviews. The site's consensus reads: \"A better-than-average sci-fi shoot-em-up with a satirical undercurrent, Demolition Man is bolstered by strong performances by Sylvester Stallone, Wesley Snipes, and Sandra Bullock.\"[19] The film scored a 34/100 on Metacritic based on 9 reviews.[20] Kenneth Turan of the Los Angeles Times wrote that the film fails to give actions fans what they desire, instead substituting out-of-place satirical commentary.[21] Vincent Canby of The New York Times called it \"a significant artifact of our time or, at least, of this week\".[22] Richard Schickel of Time wrote, \"Some sharp social satire is almost undermined by excessive explosions and careless casting.\"[23]","box_office":"$159.1 million[2]","cinematography":"Alex Thomson","production_company":"Silver Pictures","directed_by":"Marco Brambilla","release_dates":"October 8, 1993 (1993-10-08)|||||","Production":"General Motors provided the production team with 18 concept vehicles, including the Ultralite concept vehicle. More than 20 fiberglass replicas of the Ultralite were produced to portray civilian and SAPD patrol vehicles in the film. After filming had completed, the remaining Ultralites were returned to Michigan as part of GM's concept vehicle fleet.[9]The film featured the actual demolition of one of the buildings of the famed, no longer operative Belknap Hardware and Manufacturing Company in Louisville, Kentucky.One of the film's focal points is Taco Bell being the sole surviving restaurant chain in the world. Because Taco Bell is not widely available outside the U.S., the European version substitutes it with Pizza Hut, with lines re-dubbed and logos changed during post-production.[10]The film predicts Arnold Schwarzenegger as a politician, here as president, before he served two terms as the 38th Governor of California from 2003 until 2011.Hungarian science fiction writer István Nemere says that most of Demolition Man is based on his novel Holtak harca (Fight of the Dead), published in 1986. In the novel, a terrorist and his enemy, a counter-terrorism soldier, are cryogenically frozen and awakened in the 22nd century to find violence has been purged from society. Nemere claimed that a committee proved that 75% of the film is identical to the book. He chose not to initiate a lawsuit, as it would have been too expensive for him to hire a lawyer and fight against major Hollywood forces in the United States. He also claimed that Hollywood has plagiarized works of many Eastern European writers after the fall of the Iron Curtain, and that he knows the person he claims to be responsible for illegally selling his idea to the filmmakers.[11]The title theme is a heavier remix of the song originally recorded by Grace Jones and written by Sting during his time as frontman for The Police. The song was first released in March 1981, as an advance single from Jones's fifth album, Nightclubbing. Sting released an EP featuring this song and other live tracks, entitled Demolition Man.Elliot Goldenthal composed the score for the film. It was his second big Hollywood project after the Alien³ score.","produced_by":"Joel Silver[1]|Michael Levy|Howard Kazanjian|","starring":"Sylvester Stallone|Wesley Snipes|Sandra Bullock|Nigel Hawthorne|","running_time":"115 minutes","music_by":"Elliot Goldenthal","edited_by":"Stuart Baird","Release":"The film debuted at No. 1 at the box office.[12][13][14][15] Demolition Man grossed $58,055,768 by the end of its box office run in North America and $159,055,768 worldwide.[2]Warner Bros. released it on VHS in March 1994,[16] on DVD in October 1997 and 2014,[17] and on Blu-ray in August 2011.[18]"}