{"based_on":"A Sound of Thunder  by Ray Bradbury","country":"United States|","distributed_by":"Warner Bros. (US)|Bioscop (CR)|","screenplay_by":"Thomas Dean Donnelly|Joshua Oppenheimer|Gregory Poirier|","Plot":"In Chicago, 2055, the Time Safari company offers the ability for people to hunt dinosaurs in the past via time travel technology. As a precaution against the potential change of the past, the company preys only on the dinosaurs who would otherwise die of natural causes and keeps the clients from stepping off the designated path. Because of the dangers of interferring with the time line, the company's activities are vocally attacked by Sonia Rand, the developer of the time machine software TAMI, who feels scorned for not receiving credit and fears they may alter the past through their activities.A trip with clients Eckels and Middleton goes afoul when the gun carried by team leader Travis Ryer fails to go off. The dinosaur rushes the group, scattering the clients. Ryer kills the dinosaur, regroups the clients and returns to 2055, unaware that Middleton had stepped on a butterfly. The next day, they hear reports of global increases in temperature and humidity, and Ryer observes a sudden increase in plant life. On their next trip, they find that the Allosaurus they intend to hunt is already dead when they arrive and the volcano erupting much sooner. They quickly return and report the changes, and the government shuts down Time Safari to investigate. Ryer learns from Rand they are being struck by \"time waves\" that cause drastic alterations to the city as they pass due to something that happened on a previous expedition. Ryer and Rand narrowly escape a building after a time wave causes the appearance of thousands of beetles and a tree bursting through its structure. Rand warns that more time waves can be expected, and each will affect more advanced life forms, people being the last.They return to Time Safari to try to fix what has gone wrong along with the government. They are struck by another time wave that leaves the city without power and now covered by dense vegetation. Evaluating the machine's logs, they find that the Eckels/Middleton expedition had come back a few grams heavier, and that the bio-filter was turned off. They recognize that they can use the time machine to go back to intercept their past selves so to prevent whatever happened, but will only have a few seconds to act, and so must work to figure out who they need to stop. The Time Safari finds their equipment and gear free of anything, so Ryer and Rand leads a group through the city - now filled with evolved and deadly Baboonlizards and other new hazards that kill some of their party members - to find Eckels and Middleton. Eckels is safe but asserts he remained on the path, while Middeleton, poisoned by the new wildlife, takes his life before they can stop him. However, they are able to find a dead butterfly on the sole of the suit he used for the safari. The party make it back to Time Safari after more time waves hit, now finding the time machine partially underwater and unusable. Rand obtains the hard drive containing the TAMI software with plans to use it with the nearby university's particle accelerator as a substitute time machine.Ryer and Rand are the only two survivors once they finally make it to the university, Rand noting that the appearance of simian-like Babboonlizards from the latest time wave means the next one will wipe away humanity. Rand prepares the accelerator and stays behind while Ryer goes through the time portal, just as the last time wave hits turning Rand into a humanoid catfish-like creature. Ryer catches up to the previous expedition, catches Middleton to prevent him stepping on the butterfly, tells Jenny the bio-filter is off at the same time asking her to give his earlier self a recording of the events he has witnessed. The expedition returns without incident to the future they had left. Ryer shares the footage with Rand.","language":"English|Mandarin|","a_sound_of_thunder":"Theatrical release poster","box_office":"$11.7 million[1]","cinematography":"Peter Hyams","production_company":"Franchise Pictures Crusader Entertainment Baldwin Entertainment Group","directed_by":"Peter Hyams","Video games":"A video game based on the film was released for the Game Boy Advance. It also had been considerably delayed, and ended up coming out slightly before the film, in March 2005.[6] It was an overhead shooter with some driving stages, and included support for co-op and deathmatch multiplayer via link cable.A third-person action-adventure shooter based on The Thing engine was being developed by Computer Artworks for BAM! Entertainment for the PlayStation 2 and Xbox, but ended up being cancelled. Its plot differed from that of the film: the changes in the course of evolution were not an accident, but acts of terrorism caused by a Luddite cult. The \"present\" time was also changed to 2038. The game was to have nine missions taking place in both the past and present. Real-life bands would have been hired to provide the music.[6]","release_dates":"September 2, 2005 (2005-09-02) (United States)|||||","Production":"The film, announced in 2001, was originally going to be directed by Renny Harlin, star Pierce Brosnan in the main role,[2] and be shot in Montreal.[3] Harlin was fired over a disagreement with Ray Bradbury. Brosnan left the project as well and was replaced by Edward Burns.After Franchise Pictures went bankrupt during post-production, the remaining backers provided only $30 million to work with,[4] out of the $80 million originally allocated. Previsualization software was used.[5]","produced_by":"Moshe Diamant|Howard Baldwin|Karen Baldwin|","starring":"Edward Burns|Catherine McCormack|Ben Kingsley|","running_time":"103 minutes","music_by":"Nick Glennie-Smith","edited_by":"Sylvie Landra","Release":"The film was panned by critics. On Rotten Tomatoes, it has a 6% score based on 98 reviews, with an average rating of 2.8/10. The site's consensus states: \"Choppy logic and uneven performances are overshadowed by not-so-special effects that makes the suspension of disbelief a nearly impossible task.\"[7] Common criticisms against the film included its poor special effects, uninvolved performances, scientific errors and Ben Kingsley's hair.[8][9][10]The Boston Globe stated \"The combination of awful special effects and mediocre acting created this catastrophe,\" and it included the film in its list of \"Box Office Bombs\".[11] Roger Ebert stated that while he \"cannot endorse it, [he] can appreciate it\" as a film that is bad because it \"want[s] so much to be terrific that [it] explode[s] under the strain.\"[12]Due to negative reviews and lack of promotion, the production grossed only $1,900,451 in the United States and $9,765,014 elsewhere for a worldwide total of $11,665,465.[1]","budget":"$80 million[1]"}