{"based_on":"Fortress in the Rice  by Benjamin Appel","country":"United States","distributed_by":"Allied Artists","Plot":"The film begins on December 8, 1941 with the Japanese attacking the Philippines. Dave McVey Jr., the son of a rich American businessman with extensive holdings in the Philippines, is attacked by murderous bandits. He is rescued by Careo, a Filipino patriot who has put together a group of anti-Japanese Filipino guerrillas. Carero hides Dave with an elderly Filpino and his granddaughter who teach Dave Tagalog.Careo returns again to tell Dave that his father has left the Philippines, but Dave is joined by a fellow American, Joe Trent, a rough merchant sailor who was third mate on a cargo ship that was sunk by the Japanese. Joe's ship was part of a merchant line owned by Dave's father. Joe figures that Dave's father will reward him for keeping his son safe. Joe gets drunk and rapes the teenage granddaughter. When the girl starts screeming, Dave has no choice but to flee with Joe.They meet a band of armed Filipinos led by Atong and the English-speaking woman Sisa. The quick-thinking Joe tells the band that if they bring them to Colonel Ryker, an American officer in charge of a guerrilla unit, Ryker will reward them. Ryker tells Dave that the Japanese would probably give him a comfortable existence and might repatriate him to the United States due to his father's extensive business dealings with Japan. Dave replies that his father's connections to Japan were from before the war and he would rather fight with the guerrillas. The group join Ryker's unit in fighting the Japanese.Joe is promoted to lieutenant and is to accompany a Filipino captain on a raid against a Japanese-held sugar refinery and railway. Joe brings Dave, Atong, Sisa and a group of their original band on the mission. After the captain is killed, Atong kills one of his own men over the captain's pistol. Joe makes Atong give the pistol to Dave. Not wishing to complete their mission, Joe sends Dave and Sisa into a village to ask the locals for food. As they are negotiating, Joe's band massacres the villagers to steal their rice, with Joe shooting Atong during the raid. Sisa quickly switches her loyalties to Joe.","In popular culture":"Cry of Battle was the first of two features (along with War Is Hell) playing at the Texas Theatre in Dallas, Texas on November 22, 1963. Lee Harvey Oswald sneaked into this theater without paying. After box office cashier Julie Postal received a tip on Oswald from nearby shoe store employee John Brewer, she called Dallas police. While War Is Hell was in progress, Oswald was arrested, though not before he attempted to shoot the arresting officer.[6] Oswald was fatally shot two days later while being transferred to another jail by club owner Jack Ruby.[7]","language":"English","cinematography":"Felipe Sacdalan","directed_by":"Irving Lerner","cry_of_battle":"Original film poster","release_dates":"October 1963 (1963-10)|||||","Production":"Producer Joe Steinberg had a wealthy brother named Harry Stonehill in the Philippines who assisted with the financing of the film. He hired his friends Irving Lerner to direct and Bernard Gordon to write the screenplay. Gordon saw the opportunity to use the screenplay as a comment on American attitudes towards Third World people and attitudes towards masculinity explaining the film's working title of To Be a Man.[2] During the film, Dave asks Joe if raping his host's granddaughter made him feel like a man. Joe responded that fighting when you have to and having a woman when you can was feeling like a man. Joe also initiates Dave into manhood by using his winnings in a poker game to give Dave a night with a prostitute. In Dave's first battle, Dave captures a panicked Japanese soldier with Joe grabbing Dave's hands holding his rifle with bayonet that he thrusts into the prisoner.Rita Moreno's scenes were shot around her flying back to Hollywood to accept her Academy Award for Best Supporting Actress for West Side Story. A Filpino designed her dress for the Awards ceremony; Edith Head voted her dress the most original of the night. She returned the Philippines the next day.[3]Moreno's planned nude bathing scene in the film attracted a great deal of publicity.[4] She eventually filmed the scene wearing a dress.[5]","produced_by":"Joe Steinberg Eddie Romero","starring":"James MacArthur Van Heflin Rita Moreno Leopoldo Salcedo","running_time":"99 minutes","music_by":"Richard Markowitz","written_by":"Bernard Gordon"}