{"country":"United States","distributed_by":"New Line Cinema1","Legacy":"In 1995, a Hanna-Barbera-produced animated series aired on ABC, as part of its Saturday morning cartoon lineup; Matt Frewer provided the voice of Lloyd, while Bill Fagerbakke voiced Harry. In the cartoon, Harry and Lloyd have reacquired their van, now named \"Otto\". The cartoon also features a new character, Kitty, a female pet purple beaver who appears to be smarter than both men. The animated series was written by Bennett Yellin, co-writer of the film. The show was short-lived and was shelved after one season.[citation needed]In 2003, a prequel was theatrically released, entitled Dumb and Dumberer: When Harry Met Lloyd. The film featured a cast and crew different from the previous film, and the Farrelly brothers had no involvement in the film's production. It was heavily panned by critics, receiving a 10% rating on Rotten Tomatoes. It grossed approximately $39.2 million worldwide against a $19 million budget, as opposed to the original film's far greater $247 million worldwide gross against a $17 million budget.[23][24]In October 2011, the Farrelly brothers confirmed that they would make a sequel to Dumb and Dumber.[25] The sequel, titled Dumb and Dumber To, was shot in the fall of 2013. Carrey and Daniels have returned to lead the film, and Bobby and Peter Farrelly returned to direct along with original screenwriter Bennett Yellin, and actors reprising their roles from the first film include Brady Bluhm, who played Billy in (Apartment) 4C, and Cam Neely, who played Sea Bass. Dumb and Dumber To was released on November 14, 2014.[26]Unlike the original film, Dumb and Dumber To was not released by Warner Bros. but rather by Universal Pictures.[27] Despite Warner having no involvement in the film, its New Line Cinema division, which produced the first film and the prequel, was still given studio credit from Universal.[28][29]","Plot":"Lloyd Christmas (Jim Carrey) and Harry Dunne (Jeff Daniels) are best friends and roommates living in Providence, Rhode Island who struggle at every aspect of life. Lloyd, a limousine driver, falls in love with Mary Swanson (Lauren Holly), a woman he is driving to the airport. She intentionally leaves a briefcase in the terminal; Lloyd, unaware that it contains ransom money for her kidnapped husband, Bobby, retrieves it and tries to return it to her, but her Aspen-bound plane has already departed, leading to Lloyd running through and falling out of the jetway.Fired from his job, Lloyd returns to his apartment and learns that Harry has also been fired as a dog groomer after delivering dogs late to a show and accidentally getting them dirty. Bobby's kidnappers, Joe \"Mental\" Mentalino (Mike Starr) and J.P. Shay (Karen Duffy), follow Lloyd home from the airport in pursuit of the briefcase. Mistaking the crooks for debt collectors, the duo flee the apartment and return later to find that Mental and Shay have decapitated Harry's parakeet. Upset about their situation, Lloyd suggests they head to Aspen to find Mary and return the briefcase, hoping she can \"plug them into the social pipeline.\" At first Harry opposes the idea, but eventually agrees and the duo leave the next day. Mental and Shay learn about their plans and follow them.Mental and Shay catch up to the duo at a motel that night. Posing as a hitchhiker, Mental is picked up by Harry and Lloyd the next day only to be driven crazy by their childish antics, while Shay secretly follows them. During a lunch stop, the duo prank Mental with chili peppers in his burger and then accidentally kill him with rat poison pills (which he planned to use on them) after mistaking it for his medication. Nearing Colorado, Lloyd takes a wrong turn and ends up driving all night through Nebraska. Upon waking up and realizing Lloyd's mishap, Harry gives up on the journey and decides to walk home, but Lloyd later persuades him to continue after trading the van for a minibike.The two arrive in Aspen but are unable to locate Mary. After a short scuffle over some gloves that night, the briefcase breaks open and they discover the money, and \"borrow\" it for a hotel suite, clothes and a Lamborghini Diablo. They learn that Mary and her family are hosting a gala and prepare to attend. At the gala, Harry, attempting to lure Mary over to Lloyd, reluctantly agrees to go skiing with her the next day and lies to Lloyd that he got him a date. The next day, Lloyd finds out Harry lied to him after waiting all day for Mary at the hotel bar.In retaliation, Lloyd pranks Harry with coffee spiked with laxatives, leading to him to defecate in a broken toilet at Mary's house. Lloyd then arrives at Mary's house and informs her he has her briefcase. He takes her to the hotel and shows her the briefcase and confesses his love after some initial struggle, but is rejected. Nicholas Andre, an old friend of the Swansons and the mastermind behind Bobby's kidnapping, arrives with Shay and, upon learning most of the ransom money has been spent by Harry and Lloyd and replaced with IOUs, takes Lloyd and Mary hostage, as well as Harry when he returns. Before Nicholas can kill them, an FBI team raids the suite and arrests him and Shay. After the incident, Mary and Bobby are reunited, much to Lloyd's jealousy.The next day, Harry and Lloyd begin walking home. All of the items they bought were confiscated and their moped has broken down. The two unknowingly decline the chance to be oil boys for a group of bikini girls, after which Harry ironically tells Lloyd that they will get their \"break\" one day. Harry and Lloyd then play a friendly game of tag as they continue to walk back home.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 66% of 50 surveyed critics gave the film a positive review; the average rating is 5.9/10. The site's consensus reads: \"A relentlessly stupid comedy elevated by its main actors: Jim Carrey goes bonkers and Jeff Daniels carries himself admirably in an against-type performance.\"[14] On Metacritic, which assigns a normalized rating out of 100 to reviews from film critics, it has a score of 41 based on reviews from 14 critics, which indicates mixed or average reviews.[15]Roger Ebert gave the film two of four stars (despite praise for the performances of Carrey and Daniels, dubbing the former a \"true original\", and the dead parakeet joke).[16] Stephen Holden of The New York Times called Carrey \"the new Jerry Lewis\",[17] and Peter Stack of the San Francisco Chronicle called it \"riotous\", \"rib-splitting\", and gave the film praise for being both a crude and slapstick comedy and a \"smart comedy\" at the same time.[18] Carrey was nominated for a Razzie Award for \"Worst New Star\".[19]It has since become a cult film.[3]Although the film did not secure any major American film awards, it was successful at the 1995 MTV Movie Awards. Carrey won for Best Comic Performance, Carrey and Holly (a couple who would later endure a short-lived marriage) won for Best Kiss, and Carrey and Daniels were nominated for Best On-Screen Duo.In 2000, readers of Total Film magazine voted Dumb and Dumber the fifth greatest comedy film of all time.[citation needed] The film ranks 445th on Empire Magazine's 2008 list of the 500 greatest movies of all time.[20]The film opened at No. 1 in its opening weekend earning $16.4 million.[21] It went on to gross $127,175,374 in the United States, and $247,275,374 worldwide, and topping the holiday season film gross.[22]","box_office":"$247 million[2]","cinematography":"Mark Irwin","production_company":"Motion Picture Corporation of America","directed_by":"Peter Farrelly|Bobby Farrelly (uncredited)|","dumb_and_dumber":"Theatrical release poster, parodying Forrest Gump","Soundtrack":"Dumb and Dumber: Original Motion Picture Soundtrack is the original soundtrack to the film, and was released by RCA Records on November 22, 1994.[12]The song \"The Rain, The Park & Other Things\" by The Cowsills was not on the soundtrack, although it was played quite prominently in the montage of Lloyd fantasizing about Mary, nor was \"Oh, Pretty Woman\" by Roy Orbison, though it was featured prominently in the make-over montage.Also missing are \"Can We Still Be Friends\" by Todd Rundgren (who also wrote the original soundtrack), \"Rollin' Down the Hill\" by The Rembrandts, \"Mmm Mmm Mmm Mmm\" by the Crash Test Dummies, \"Red Right Hand\" by Nick Cave and the Bad Seeds, \"Boom Shack-A-Lak\" by Apache Indian, and \"Make Love Now\" by Patrick Wilson. \"2 Ft. 0 Butt Crack\" by Bruce Greenwood was also omitted from the soundtrack and was erroneously credited to the band Circle the Wagon in the film's credits.[13]","release_dates":"December 16, 1994 (1994-12-16)|||||","Production":"Jim Carrey, based on the box-office success of Ace Ventura: Pet Detective (1994), received a salary of $7 million for this film.[5]Jeff Daniels was only paid around $50,000. New Line Cinema originally didn't want Daniels in the film, as he was known only for his dramatic work at the time. The Farrelly brothers fought to have him cast and won out, but the studio offered Daniels the low salary hoping he would turn down the film. Daniels ultimately accepted the role.[6]Steve Martin and Martin Short both turned down the role of Lloyd.[7]Jim Carrey's chipped tooth is genuine, resulting from a tussle with a schoolfellow in his boyhood, but he had since had it capped. He simply had the crown temporarily removed from that tooth to portray Lloyd.[8]Scenes taking place in Aspen were filmed in Breckenridge, Colorado and Park City, Utah. The Stanley Hotel in Estes Park, Colorado was transformed into the \"Danbury Hotel\" for the filming of the movie. The \"Danbury Hotel\" bar scene and staircase shot were the shots filmed there. The scenes filmed in the snow were shot at Copper Mountain Resort, Colorado.[9]The truck stop shots, salt shaker C-Bass diner scene, leg on fire at the gas pump, restroom assault scene,and two-lane country road scenes were filmed in and around Fort Morgan, CO with a number of locals filling the extra roles.[citation needed]Some of the external street scenes were filmed in Salt Lake City, and the airport scene was filmed at Salt Lake City International Airport.[10]Some scenes from the beginning of the film were also shot on location in the Providence, Rhode Island, metropolitan area, including shots of the skyline, The Big Blue Bug, and scenes from the beginning of their road trip were shot in locations in Cumberland.[11][better source needed]","produced_by":"Charles B. Wessler|Brad Krevoy|Steve Stabler|","starring":"Jim Carrey|Jeff Daniels|Lauren Holly|Karen Duffy|Mike Starr|Charles Rocket|Teri Garr|","running_time":"107 minutes","music_by":"Todd Rundgren","edited_by":"Christopher Greenbury","written_by":"Peter Farrelly|Bennett Yellin|Bobby Farrelly|","budget":"$17 million[1]"}