{"based_on":"Arthur and the Minimoys and Arthur and the Forbidden City  by Luc Besson","country":"France","distributed_by":"The Weinstein Company Metro-Goldwyn-Mayer","Differences between release versions":"After a screening test in the United States, the Weinstein company edited the film.[15] Approximately nine minutes were cut. Most of the edits pertained to the love story between Arthur and Selenia. The Scenes were:The entire storyline involving the parents and their greed for money was also deleted, cut short by a small cutscene and a narrator explaining that worrying over their son was all they needed to reform completely.The British version of the film, also distributed by the Weinstein Company, similarly lacked these scenes.The Minimoys featured in the first Augmented Reality Nestle Chocopic cereal box with the help of Dassault Systemes technology 3DVIA Virtools.[16]","story_by":"Luc Besson","Plot":"In the year 1960, protagonist Arthur lives with his grandmother Daisy in a quiet farm house on a dirt road, in a small rural community in Northeastern Connecticut (based on Sterling). His grandfather Archibald has recently gone missing and he sees little of his parents (who are away looking for work). Daisy entertains Arthur with stories of his grandfather's adventures in Africa, featuring the tall Bogo Matassalai and the minuscule Minimoys, of whom the latter now live in Archibald's garden, protecting a collection of rubies. Arthur becomes enamoured of a picture of Selenia, the princess of the Minimoys. When Daisy receives a two-day deadline to pay a large sum of money to a building developer named Ernest Davido, who plans to evict the two, Arthur looks for the rubies to pay off the debt, and discovers various clues left by his grandfather. He is met in the garden by the Bogo Matassala, who reduce Arthur to Minimoy size. From the Minimoys, Arthur learns that they are in danger from Maltazard, a Minimoy war hero who now rules the nearby 'Necropolis', after corruption by a weevil, by whom he has a son named Darkos.Arthur, reflecting his legendary British namesake, draws a sacred sword from its recess and uses it to protect the Minimoys from Maltazard's soldiers; whereupon Sifrat, the ruler of the Minimoys, sends Arthur to Necropolis, with the princess Selenia and her brother Betameche. En route, they are attacked on two occasions by Maltazard's soldiers. In Necropolis, Selenia kisses Arthur, marking him as her husband and potential successor, and confronts Maltazard alone. When Maltazard learns that she has already kissed Arthur and thus can no longer give him her powers and cure his corruption, he imprisons all three, who discover a Minimoy form of Archibald. Thereafter Arthur and his grandfather escape and return to human form, with little time to spare before Maltazard's flood reaches the Minimoys. With the help of Mino, a royal advisor's long-lost son, Arthur redirects the flood to Necropolis; whereupon Maltazard abandons Necropolis and his son, and the water ejects the rubies above ground. Archibald pays Davido with one ruby; and when he tries to take them all, the Bogo Matassalai capture him and give him to the authorities (scene deleted in the U.S. edition). The film ends with Arthur asking Selenia to wait for his return, and her agreement to do so.","language":"English","Reception":"The film was budgeted at $85 million.[1] In its first two weeks in cinemas in France Arthur earned over US$20 million.[1]Arthur and the Invisibles received negative reviews from film critics. In the United States, the movie's Los Angeles run garnered 21% positive reviews at the critic review aggregate site RottenTomatoes.com. The critic's census reads, \"Arthur wastes its big-name voice talent on a predictable script and substandard CG animation.\"[6] Los Angeles Times reviewer Alex Chun wrote that, \"Director Luc Besson admits he knew nothing about animation before he started this project, and it shows\".[7] Variety's Robert Koehler called it \"alienating and dislikable\" and specifically noted that, \"Having African-American thesps Snoop Dogg and Anthony Anderson voice creatures that are basically humanoid monkeys shows poor taste.\"[8] Many found it derivative of sources ranging from King Arthur's sword-in-the-stone to the films The Dark Crystal and The Ant Bully, which itself was based on a children's book written three years before Besson's. \"It all simply looks as if [conceptual artist Patrice] Garcia and Besson couldn't decide on any one thing to copy,\" said Frank Lovece of Film Journal International, \"so they copied them all.\"[9] Lovece also noted that, \"the whole thing gets seriously creepy when [the animated versions of] the grown-up, pinup-beauty princess and the 10-year-old boy fall for each other. Mary Kay Letourneau comes uncomfortably to mind.\" Common Sense Media disliked the film, giving it 2 stars out of 5 and saying, \"Uneven animation-live action combo may bore kids.\"[10] Josh Tyler of Cinema Blend greatly disliked the film, giving it 1.5 stars out of 5 and saying, \"Sure it has sometimes loved French director Luc Besson’s name on it, but the character designs look like they were stolen from those wispy haired troll dolls that were popular for about five minutes fifteen years ago, and the plot sounded like it was written by a ten-year-old kid underneath a heavy bedspread with a big chief tablet and a pencil the size of a horse’s leg.\"[11] Besson, in a May 2007 interview, blamed American distributor The Weinstein Company for the film's failure in the U.S., saying \"Why the critics didn't like Arthur was because [Weinstein] changed so much of the film and tried to pretend the film was American. [...] America and the UK were the only countries where the films were changed. The rest of the world has the same film as France.\"[12]On February 1, 2007, the film received the Imagina Award in the category Prix du Long-Métrage.[13] On October 1, 2007, Mylène Farmer was awarded the NRJ Ciné Award for her dubbing of Sélénia's voice in Arthur and the Minimoys.[14]","box_office":"$107,944,236[1]","cinematography":"Thierry Arbogast","production_company":"EuropaCorp Apipoulaï Avalanche Productions Narfia Entertainment Group","directed_by":"Luc Besson","Home media release":"The US edition DVD was released on May 15, 2007 with just the English-language version and cut down about 10 minutes from the original version. The international DVD versions include the uncut English-language version and the local-language version.","arthur_and_the_invisibles":"Theatrical release poster","release_dates":"December 13, 2006 (2006-12-13)|||||","Production":"The animation was done by the French company BUF Compagnie, which hired approximately 100 animators, most of them from French animation schools and without any previous experience. Besson wanted a photorealistic environment, and BUF initially used microlenses to film physical environments, but eventually instead used photogrammetry, where a digitized photograph of a real object is manipulated with a computer. Sets were built to 1:3 scale, which allowed the animators to use natural elements, such as plants and grass. While the film did not use motion capture, real actors were used as reference, and recorded with 13 to 14 video cameras, but without the markers used in motion capture. Besson directed their performances. In terms of lip sync with actors' dialog, the French animators could not cope with the English phonemes. For Madonna and David Bowie, a camera was used to record their lips to help the animators. The animation was done with proprietary software.[5]","produced_by":"Luc Besson Emmanuel Prévost","starring":"Freddie Highmore Madonna Jimmy Fallon Mia Farrow David Bowie Ron Crawford Robert De Niro Jason Bateman Snoop Dogg Anthony Anderson","running_time":"94 minutes (2007 version) 104 minutes (2006 version)","Sequels":"Arthur and the Invisibles was followed by a 2009 sequel, Arthur and the Revenge of Maltazard, based on a novel of the same name, and another sequel in 2010 titled Arthur and The War of the Two Worlds, based on the final book in the series. The two films were edited together and released in the UK and Ireland as a single film titled Arthur and the Great Adventure.","music_by":"Éric Serra","edited_by":"Karim Benhammouda Yann Hervé Vincent Tabaillon","written_by":"Luc Besson Céline Garcia","budget":"€60 million ($85 million)[1]"}