{"country":"United States","distributed_by":"Warner Bros.","Plot":"Two years after throwing his fight with Tank Murdock at the end of Every Which Way but Loose, Philo Beddoe (Clint Eastwood) keeps fighting in underground bare-knuckle boxing matches to make money on the side. Philo decides to retire when he realizes that he has started to enjoy the pain. Philo and his manager Orville (Geoffrey Lewis) decide to end his career. The problem is Jack Wilson (William Smith), a new breed of East Coast brawler who mixes martial arts with boxing. He is so effective at maiming his opponents that his handlers cannot book fights for him.The Black Widows, the biker gang with a long-running grudge against Philo, make their return. They still want revenge for the destruction of their bikes last time. However, Philo bests them in a chase that runs through an asphalt machine during a road-paving project. They lose their hair and must wear wigs and penciled-on eyebrows to camouflage their appearance.After a fight between a mongoose and a rattlesnake, one of the handlers realizes that if Philo, king of the West Coast brawlers, agreed to fight Wilson it would be the biggest draw in the history of modern bareknuckle fighting. The Handlers, led by handicapper Jimmy Beekman (Harry Guardino), in conjunction with the mafia, kidnap Philo's love interest, country-western singer Lynn Halsey-Taylor (Sondra Locke), in order to coerce Philo to agree to the fight. Wilson, however, is a prize fighter with a sense of right and wrong. After learning of the plot, and helping Philo and Orville rescue Lynn, he decides they really don't need to fight to prove who is best. On the other hand, both fighter's personal pride makes them wonder who would have won. The long brawl between the two characters ends up taking place, but is punctuated by pauses and personal reflections on their mutual admiration. Near the end, Wilson breaks Philo's arm and offers to end the fight, but the two men continue the brawl. In the end, Philo knocks Wilson out long enough to qualify for a win. Wilson helps Philo to the hospital to have his arm looked at, and the fighters and their friends have a beer at a bar.Meanwhile, the Black Widows bet everything they have on Philo because, despite their rivalry, they know he is the better fighter. When the mobsters decide to kill Philo once he gains the upper hand, the Black Widows protect their investment by beating up the mafia men. After collecting their winnings, the Black Widows declare a truce with Philo.","language":"English","Reception":"The review aggregator website Rotten Tomatoes reported that 20% of critics gave the film a positive review based on a sample of 10 reviews, with an average score of 4.9/10.[4]Any Which Way You Can was the 5th highest-grossing film of 1980.[5] The film has had total gross receipts of $70,687,344 in the North America.[6][7]","box_office":"$70.7 million(North America)","cinematography":"David Worth","production_company":"The Malpaso Company","directed_by":"Buddy Van Horn","release_dates":"December 17, 1980 (1980-12-17)|||||","Production":"Any Which Way You Can's filming started in summer 1980.[2] The film was filmed in the California communities of Sun Valley, North Hollywood, and Bakersfield, and in Jackson, Wyoming.[2]Clyde is much physically different in the film than in Every Which Way but Loose. This is because the original orangutan, Manis, had matured too much since the first film and was too large and possibly dangerous. Glen Campbell performed the \"Any Which Way You Can\" title song track in the final scene of the movie, and the song was a Top-10 hit on the country music charts.[3]","produced_by":"Robert Daley, Fritz Manes","starring":"Clint Eastwood|Sondra Locke|Geoffrey Lewis|Ruth Gordon|William Smith|","running_time":"116 minutes","any_which_way_you_can":"Poster by Bill Gold Illustrated by Bob Peak","music_by":"Steve Dorff|Ray Charles|Clint Eastwood|Glen Campbell|Jim Stafford|Fats Domino|John Durrill|","edited_by":"Ron Spang|Ferris Webster|","written_by":"Stanford Sherman Jeremy Joe Kronsberg (characters)","budget":"$15 million[1]"}