{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","east_side,_west_side":"Theatrical Film Poster","Plot":"Just after World War II, socialite Jessie Bourne (Barbara Stanwyck) is home alone one night in her Gramercy Park apartment on New York’s East Side when she receives a mysterious hang-up phone call. Her wealthy playboy husband Brandon (James Mason) is out enjoying himself at the Del Rio night club where young model Rosa Senta (Cyd Charisse)–-who has seen and admired Jessie, who has been a customer at the dress salon where she works-–admonishes Brandon for going out alone. Brandon tries to mollify Rosa but is cut short when Brandon’s former mistress, gold-digging Isabel Lorrison (Ava Gardner), walks in. She has returned from Paris intent on rekindling the romance; but he rebuffs her, professing faithfulness to his wife. An argument ensues in which Isabel's date, wealthy Alec Dawning (Douglas Kennedy), who knows Brandon's reputation, knocks him unconscious. Brandon is rescued by Rosa, who takes him to her home to recover.Brandon eventually returns home in the wee hours to find Jessie waiting up and tells her that he was working late, stopped for a drink, was knocked out by a drunk, and then rescued by Rosa. He explains how Rosa knows Jessie. The next morning, Jessie's friend Helen Lee (Nancy Davis) calls on her, presumably to remind her of the Lees' party that night for an intelligence officer and ex-NYPD beat cop Mark Dwyer (Van Heflin) returning to the States from post-war service in Italy. Both women have already seen the morning newspaper in which the nightclub brawl is front-page news. After much prodding, Jessie confesses to Helen that she is afraid of what will happen to her marriage with Isabel back in town. Jessie says she intends to live her life normally, including going shopping. She decides to go to the dress salon where Rosa works to hear for herself what transpired at the club. Once there, Jessie takes Rosa aside to thank her for rescuing Brandon. Rosa confirms Brandon's story—a relief to Jessie. As thanks, Jessie offers to take Rosa to LaGuardia Airport to pick up Mark Dwyer, whom Rosa has had a long-standing crush on.As he is leaving his office for Helen's party, Brandon is visited by Isabel, who manages to entice him to her apartment. Jessie goes to the Lees' party alone when Brandon is a no-show and becomes better acquainted with Mark. Dwyer explains the crush Rosa has on him and that she would have gotten over it long ago except that he was overseas. Jessie finds out that Brandon is with Isabel and begins to leave the party; Mark, tired of being celebrated throughout the day for his return to the States, and falling hard for Jessie, offers to escort her home. They talk, and he remains with her until Brandon returns. After Dwyer leaves, and although they argue viciously, Brandon convinces Jessie of his love, they make up, and he proposes a trip to Virginia.The next day, while explaining to Rosa that they can't be in a relationship, and that he's interested in Jessie, Dwyer spots Dawning out with an imposing, frosty blonde on his arm. So, although Isabel is being kept by Dawning, he is not faithful to her.As she prepares to go out with Dwyer for a drive, Jessie is telephoned by Isabel, who asks her for a meeting at her apartment in Greenwich Village on the West Side. Mark unwittingly drives Jessie there and, while doing so, admits his attraction to her, but he is resigned to her trying to save her marriage. During the showdown at the apartment, Jessie refuses to back down even after Isabel gloats that, if she calls, Brandon “will come running.” Dwyer returns Jessie to her home where she is given a message to call Brandon—at Isabel's apartment. Suspecting she has been duped by her husband, Jessie calls. Brandon answers, telling her that he found Isabel murdered and he has summoned the police.Before Jessie and Mark go to the apartment, Mark discovers he had just delivered Jessie there earlier. A friend of Dwyer's, Lt. Jake Jacobi (William Conrad), is in charge of the crime scene. There, Mark introduces Jessie to the lieutenant, and they are admitted to the apartment. While Jacobi questions Brandon and Jessie, Mark finds a woman's broken fingernail next to the body. After confirming the nail is not Jessie's or Isabel's, and mindful of all he has seen since his return, Dwyer asks Jacobi to let him do a little detecting, and while Jacobi takes Brandon 'downtown' for further questioning, Jessie is allowed to go home. Dwyer heads to Alec Dawning’s private party at the Del Rio club. Using a ruse, he determines that Alec's jealous girlfriend, Felice Backett (Beverly Michaels), the frosty blonde, committed the murder. Dwyer takes her to the police station and Brandon is released. Brandon returns to Jessie in their high-rise apartment, but she finally realizes that she no longer loves him, and leaves. Brandon ponders what will happen next as he looks out over New York City.","language":"English","Reception":"According to MGM records the film earned $1,518,000 in the US and Canada and $1,022,000 overseas resulting in a small profit to the studio of $31,000.[1]","box_office":"$2,540,000[1]","cinematography":"Charles Rosher","production_company":"Metro-Goldwyn-Mayer","directed_by":"Mervyn Leroy","release_dates":"December 22, 1949","produced_by":"Voldemar Vetluguin","starring":"Barbara Stanwyck James Mason Van Heflin Ava Gardner","running_time":"108 minutes","music_by":"Miklós Rózsa","edited_by":"Harold F. Kress","written_by":"Marcia Davenport (novel) Isobel Lennart","budget":"$1,754,000[1]"}