{"country":"United Kingdom Germany","distributed_by":"Gramercy Pictures Universal Pictures (current rights holder)","language":"English","backbeat":"UK film poster","box_office":"$2,392,589","cinematography":"Ian Wilson","production_company":"PolyGram Filmed Entertainment","directed_by":"Iain Softley","Response":"Paul McCartney was not impressed with the film, stating:One of my annoyances about the film Backbeat is that they've actually taken my rock 'n' rollness off me. They give John the song \"Long Tall Sally\" to sing and he never sang it in his life. But now it's set in cement. ['Paul' sang Long Tall Sally in the Glasgow stage version]. It's like the Buddy Holly and Glenn Miller stories. The Buddy Holly Story does not even mention Norman Petty, and The Glenn Miller Story is a sugarcoated version of his life. Now Backbeat has done the same thing to the story of the Beatles. I was quite taken, however, with Stephen Dorff's astonishing performance as Stu.[1]Cynthia Lennon was unimpressed with Jennifer Ehle's portrayal of her, saying that in the film she was portrayed \"as a clingy, dim little girl in a headscarf.\"Astrid Kirchherr praised the accuracy and detail of her relationship with Sutcliffe and the Beatles.[2]The film did well on limited release.[3][vague]","release_dates":"14 April 1994","Production":"The original script was written by Iain Softley from interviews in 1988. After failing to secure funding, screenwriter Stephen Ward was brought in to completely rewrite the script in 1993. Ward interviewed Astrid Kirchherr and others who were close to the Beatles during their time in Hamburg. The project was green-lighted that year.The soundtrack to the film includes no songs written by members of the Beatles, but various songs the group performed in Hamburg, written and recorded by other artists.Rather than re-create the sounds of the period, iconoclastic, rebellious musicians were recruited (as a producer noted, the Beatles' pre-recording stage act was \"the punk of its day\"). This was done to better convey the way the music came across to the audience, at the time. The musicians were all members of American rock bands:The original recording of \"My Bonnie,\" performed by Tony Sheridan with the Beatles as a backing group was used in the film, the only use of a real Beatles performance.[citation needed]Additionally, the film's distributor, PolyGram Filmed Entertainment, was then under common ownership with the label which owned the rights to release and distribute the Beatles' music from the Hamburg days, Polydor Records.The film's title, \"Backbeat\", is derived from a lyric in Chuck Berry's \"Rock and Roll Music\": Just let me hear some of that rock'n'roll music - any old way you choose it - It's got a backbeat, you can't lose it...\"","produced_by":"Finola Dwyer Stephen Woolley","starring":"Sheryl Lee Stephen Dorff Ian Hart","running_time":"100 minutes","Main cast":"Hart also played Lennon in the film The Hours and Times. Bakewell later reprised his role as McCartney in the television film The Linda McCartney Story, and Williams again played Best in the television film In His Life: The John Lennon Story.","music_by":"Don Was","edited_by":"Martin Walsh","Stage version":"Re-imagined for the stage by the original writer and director of the 1994 film, Iain Softley, Backbeat premiered at Glasgow's Citizens' Theatre on 9 February 2010[4] featuring a live band.In 2011 the stage version opened at the Duke of York's Theatre in London. It was co-written by Iain Softley and Stephen Jeffreys, with musical direction by Paul Stacey, and directed by David Leveaux.[5]","written_by":"Iain Softley and Stephen Ward"}