{"based_on":"Dracula characters  by Bram Stoker","country":"United States France","distributed_by":"Columbia Pictures","screenplay_by":"Mel Brooks Rudy De Luca Steve Haberman","story_by":"Rudy De Luca Steve Haberman","Plot":"Solicitor Thomas Renfield travels all the way from London to \"Castle Dracula\" in Transylvania to finalize Count Dracula's purchase of Carfax Abbey in England. As the stagecoach driver refuses to take him any further, Renfield continues on foot despite turning back.Renfield meets Count Dracula, a charming but rather strange man who is a vampire. He then casts a hypnotic spell on the highly suggestible Renfield, making him his slave. Dracula and Renfield soon embark for England. During the voyage, Dracula dines upon the ship's crew. When the ship arrives and Renfield, (by this time raving mad in the style of Dwight Frye), is discovered alone on the ship, he is confined to a lunatic asylum.Meanwhile, Dracula visits an opera house, where he introduces himself to his new neighbors: Doctor Seward, (the lunatic asylum's administrator and head psychiatrist, who is obsessed with prescribing his patients enemas), Mina (Seward's nubile daughter), Jonathan Harker (Seward's assistant and Mina's fiance), and Lucy (Seward's equally nubile ward). Dracula flirts with Lucy and, later that night, enters her bedroom and feeds on her blood.Mina discovers Lucy still in bed late in the morning, looking strangely pale. Seward, puzzled by the odd puncture marks on her throat, calls in an expert on obscure diseases, Dr. Abraham Van Helsing. Van Helsing informs the skeptical Dr. Seward that Lucy has been attacked by a vampire. After some hesitation, Seward and Harker allow garlic to be placed in Lucy's bedroom to repel the vampire. After a failed attempt by Renfield to remove the garlic, Dracula uses mind-control to make Lucy leave her room, and kills her. Despite Van Helsing's warnings, Seward refuses to believe him.Van Helsing meets Dracula and begins to suspect him of being the local vampire after the two trade words, phrases and insults in Moldavian, each attempting to have the last word in the foreign language 'discussion'. Lucy, now a vampire herself, rises from her crypt, drains the blood from her guard, and tries to attack and seduce Harker, who had come to watch over her grave to be sure if Van Helsing was indeed right.Dracula's next victim is Mina, but he has bigger plans for her; he wants her to be his undead bride throughout eternity. He spirits her away to Carfax Abbey, where they dance, and he sucks her blood. The following morning, she is unusually frisky, and tries to seduce the prudish Jonathan. Dr Seward mistakenly assumes Jonathon to be seducing Mina and orders him to leave. However, Van Helsing becomes suspicious at this strange behavior. Noticing a scarf around Mina's neck, he removes it, revealing two puncture marks. Though she lies about how she got them, Van Hesling confirms she has been attacked by a vampire by placing a cross on her hand, which burns a mark into it.Van Helsing devises a plan to reveal the vampire's secret identity. Both Dracula and Renfield are invited to a ball, where Van Helsing has placed a huge mirror, covered with a curtain, on one of the walls. While Dracula and Mina perform an excellent dance routine the curtain over the mirror is dropped, and guests are stunned to see that Dracula has no reflection. Dracula grabs Mina and escapes out a window.Van Helsing deduces that Renfield is Dracula's slave, and thus might know where he has taken his coffin after a search of Carfax turns up empty. He locks himself in a room to finish making Mina his bride. His pursuers break down the door, and they fight. Van Helsing, noticing sunlight creeping into the room, starts opening the blinds. As his body begins to burn, Dracula then to attempts flee, but is inadvertently killed by Renfield.With Dracula dead, Renfield falls into despair with no master to serve and scrapes Draculas ashes into the coffin. Seward tells him \"You are free, now\", and he realizes this to be true with Dracula gone, and seems relieved. But the instant Dr. Seward calls for Renfield to follow him out of the church, he follows with \"Yes, Master\". Van Helsing dusts himself off, opens Dracula's coffin and yells something in Moldavian to ensure that he has the final word between himself and the count. However after the end credits roll, Dracula responds in Moldavian despite being dead, giving him the 'true' final word.","language":"English German","Reception":"Critical reaction to Dracula: Dead and Loving It has been overwhelmingly negative, with the film earning a \"rotten\" rating of only 11% on Rotten Tomatoes based on 36 reviews and a 3.1/10 rating.[3]James Berardinelli of ReelViews wrote: \"[...] Dracula: Dead and Loving It doesn't come close to the level attained by Young Frankenstein. It's a toothless parody that misses more often than it hits. ... Given the comic turn his career has taken since the early '80s, it's hard to believe that Leslie Nielsen was once a serious actor. These days, thanks to the Zucker brothers [...], he has become an accomplished satirical performer. His sense of timing is impeccable, and this asset has made him a sought-after commodity for a wide variety of spoofs. Here, Nielsen takes on the title role, but his presence can't resurrect this stillborn lampoon. Unless you're a die hard Mel Brooks fan, there's no compelling reason to sit through Dracula: Dead and Loving It. The sporadic humor promises some laughs, but the ninety minutes will go by slowly.\"[4]Joe Leydon of Variety wrote: \"Leslie Nielsen toplines to agreeable effect as Count Dracula, depicted here as a dead-serious but frequently flustered fellow who's prone to slipping on bat droppings in his baroque castle. ... Trouble is, while Dead and Loving It earns a fair share of grins and giggles, it never really cuts loose and goes for the belly laughs. Compared with the recent glut of dumb, dumber and dumbest comedies, Brooks's pic seems positively understated. Indeed, there isn't much here that would have seemed out of place (or too tasteless) in comedy sketches for TV variety shows of the 1950s. ... As a result, unfortunately, Dead and Loving It is so mild, it comes perilously close to blandness. ... The only real sparks are set off by MacNicol as Renfield, the solicitor who develops a taste for flies and spiders after being bitten by Dracula.\"[5]Despite the reviews, the film, like many of Brooks's later films, has gained a cult following in later years.[citation needed]The film debuted at #10.[6] By the end of its run, Dracula grossed $10,772,144.[2]","box_office":"$10.7 million[2]","cinematography":"Michael D. O'Shea","production_company":"Gaumont Brooksfilms Castle Rock Entertainment","directed_by":"Mel Brooks","release_dates":"December 22, 1995 (1995-12-22)|||||","Production":"Principal photography began in May 1995 and wrapped in September 1995.","dracula:_dead_and_loving_it":"Theatrical release poster","produced_by":"Mel Brooks Executive: Peter Schindler","starring":"Leslie Nielsen Peter MacNicol Steven Weber Amy Yasbeck Lysette Anthony Harvey Korman Mel Brooks","running_time":"90 minutes[1]","music_by":"Hummie Mann","edited_by":"Adam Weiss","budget":"$30 million"}