{"based_on":"Characters  by George Gallo","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Ron Shelton|Jerry Stahl|","story_by":"Ron Shelton|Cormac Wibberley Marianne Wibberley|","Plot":"Eight years after the events of the first film, Miami Police Department (MPD) narcotics division detectives Marcus Burnett and Mike Lowrey are investigating the flow of highly-potent ecstasy into the city. Their surveillance of boats coming in from Cuba leads them to a Ku Klux Klan meeting and drug drop in a swamp docks outside Miami. The subsequent raid on the Klan members proves to be a disaster; malfunctioning radios delay back-up, causing a firefight when Mike accidentally shoots Marcus in the buttocks, while the Klan members are revealed to be mere small-time buyers and not the distributors of the ecstasy. The incident leaves Marcus to further question if he still wants to partner with Mike, while Mike fears that Marcus may discover his new relationship with Marcus' sister, Syd.Unbeknownst to Mike and Marcus, Syd is an undercover operative with the Drug Enforcement Administration (DEA), as a money laundering agent for Russian gangsters; the Russian gangsters are in fact the distributors of the ecstasy on behalf of neurotic Cuban drug lord Johnny Tapia. During her first assignment in Miami, a violent Haitian gang attempts to hijack the money transport between the Russians and Tapia, putting Syd in danger. Mike and Marcus inadvertently stumble into the action, and an intense firefight and car chase ensues between the gang members and the MPD/DEA, devastating the local area and enraging Police Captain Conrad Howard. Marcus and Mike learn of Syd's actual work, which makes Marcus unhappy, while Capt. Howard demands they find the supplier of ecstasy.Marcus and Mike go to confront the Haitian gang leader, which results in a firefight and the leader revealing that his information about the transport came from his friend's camcorder. After viewing the footage, Marcus and Mike find out that a local business, the Spanish Palms Mortuary, is possibly being used as a front for money laundery by Tapia. Disguised as pest terminators since Tapia has a major rodent problem, the detectives penetrate Tapia's mansion and discover that Tapia has eliminated some of his Russian distributors and has begun to woo their former associate Syd, who is still undercover with the DEA and has refocused the investigation towards Tapia. The detectives also recover evidence linking Tapia to one of the boats involved in the Klan raid in the swamps.After pressuring one of the arrested Klansman into making Tapia's boat, the detectives find themselves involved in another firefight, this time while pursuing a morgue van from the docks carrying emptied cadavers. Mike and Marcus decide to infiltrate Tapia's mortuary (disguised as ambulance workers) where they learn that the drug lord is using dead bodies to smuggle his drugs and money. The mission is nearly sabotaged when the pair are almost discovered, resulting in Marcus accidentally ingesting some of the ecstasy and Mike ordering the disguised officers outside the building to crash an ambulance into it, creating a diversion.After Mike and an intoxicated Marcus obtain a search warrant from Capt. Howard, the mortuary and Tapia's mansion are raided, with the drugs and money being intercepted by the U.S. Coast Guard. However, the mansion raid is botched when a vengeful Russian gangster, Alexei, violently storms the mansion on his own, intending to have revenge against Tapia for murdering his friends. Alexei is however unable to get to Tapia as he is shot by the police, while Syd is discovered by Tapia and is kidnapped by him and taken to Cuba. With Syd held prisoner in Tapia's compound and guarded by the Cuban military, the drug lord demands the return of his money in two days in exchange for Syd's life.Mike and Marcus, along with their voluntary S.W.A.T. team and Syd's DEA co-workers, prepare a military assault to rescue Syd from Tapia's home. During the battle, Mike and Marcus extract Syd and escape Tapia's home, which is blown up. After a lengthy pursuit by an infuriated Tapia, they end up in a minefield just outside U.S. Naval Station Guantanamo Bay, where Tapia holds Mike at gunpoint taunting him that the US Navy force can't help him as they are still on Cuban soil. Tapia also suggests that they will stay in Cuba not knowing they are aiming their rifles at Tapia. Syd distracts Tapia by killing one of his men while Marcus rescues Mike with a skillful headshot to Tapia's skull in the middle of the minefield with his last bullet resulting in Tapia's body being blown up after falling onto a mine.Later, at the Burnett house, Mike has bought Marcus a new pool (replacing a previous pool that had been destroyed in a prior gag), and Marcus finally makes peace with Mike dating Syd and no longer doubts their partnership. Despite the sentiment, Mike's new pool breaks, washing the two into a river, as they sing the \"Bad Boys\" theme song.","bad_boys_ii":"Theatrical release poster","language":"English","Reception":"On Rotten Tomatoes, the film has a 23% approval rating, based on 176 reviews, with an average rating of 4.1/10. The site's critical consensus reads, \"Two and a half hours of explosions and witless banter\".[3]Roger Ebert of the Chicago Sun-Times gave the film one out of a possible four stars, especially offended by one scene involving a teenage boy and the use of the word nigga, saying, \"The needless cruelty of this scene took me out of the movie and into the minds of its makers. What were they thinking? Have they so lost touch with human nature that they think audiences will like this scene?\"[4] On an episode of At the Movies with Ebert & Roeper, film critic Richard Roeper named Bad Boys II the worst film of 2003.Among the more positive reviews was Seattle Post-Intelligencer critic Ellen A. Kim, who wrote that the film was \"mindlessly fun... If you like this type of movie, that is.\" The film was also praised by a few critics and viewers for its deftly handled action sequences and visual effects.The film was a financial success. It made $138,608,444 in North America and $134,731,112 in other territories, totaling $273,339,556 worldwide — almost twice the gross of the original film.[2]At the 2004 MTV Movie Awards, the film was nominated for \"Best Action Sequence\" for the inter-coastal freeway pursuit and \"Best On-Screen Team\", but lost to The Lord of the Rings: The Return of the King and 50 First Dates.Bad Boys II was nominated at the 2nd Annual Visual Effects Society Awards (VES) for \"Outstanding Supporting Visual Effects in a Motion Picture\".[5]","box_office":"$273.3 million[2]","cinematography":"Amir Mokri","directed_by":"Michael Bay","production_companies":"Simpson/Bruckheimer","release_dates":"July 18, 2003 (2003-07-18)|||||","produced_by":"Jerry Bruckheimer","starring":"Martin Lawrence|Will Smith|Jordi Mollà|Gabrielle Union|Peter Stormare|Theresa Randle|Joe Pantoliano|","running_time":"147 minutes[1]","Sequels":"In June 2008, Bay stated that he may direct Bad Boys III, but that the greatest obstacle to the potential sequel would be the cost, as he and Will Smith demand some of the highest salaries in the film industry.[7] In August 2009, The Film Stage reported that Columbia Pictures has hired Peter Craig to write the script for Bad Boys III.[8] In a February 2011 appearance on BET's The Mo'Nique Show, Martin Lawrence confirmed that Bad Boys III was in the works.[9]In June 2014, during the Monte Carlo Television Festival, Bruckheimer announced that Safe House screenwriter David Guggenheim is currently working on the storyline for the sequel.[10] In July 2014, during an interview they asked if Bad Boys III is still happening, in which Bruckheimer replied, \"Well, we're working on an outline right now. Hopefully we'll get a screenplay in the next three months. And that will become a movie I hope.\"[11] On August 13, 2014, Lawrence announced a third Bad Boys film on Conan. He said that a script had been written and parts had been cast.[12]In June 2015, it was reported than director Joe Carnahan is in early talks to write and possibly direct the film.[13] It was also reported that the studio is keen to get Smith to sign on quickly, so the film could be made after Smith finishes shooting Suicide Squad.[14]On August 5, 2015, Sony Pictures Entertainment officially announced that Bad Boys III would be released on February 17, 2017. An additional sequel, titled Bad Boys IV, is also scheduled for release on July 3, 2019.[15] A report has stated that Smith may only produce both sequels.[16] In October 2015, Smith shared that the film is definitely coming, and may arrive a lot sooner than expected. Smith also said that there's a \"very, very, very strong possibility that\" there will be a third Bad Boys film \"within the next 12 to 18 months,\" which would give it a release date of late 2016/early-mid 2017.[17] On February 9, 2016, Will Smith was speaking to BBC Radio 1 and said he had run into Martin Lawrence a few weeks ago and again confirmed that they will definitely be making a third sequel. On March 5, 2016, the film was pushed back to June 2, 2017.[18]","In other media":"A video game version of the film, known as Bad Boys: Miami Takedown in North America, was released in 2004 on the PlayStation 2, Xbox, GameCube and Windows. Originally planned for release in late 2003 (to tie in with the film's DVD release), the game was pushed back several months. The game failed to deliver any sort of sales or critical acclaim due to poor development; it was given low ratings from many game websites.[6]","music_by":"Trevor Rabin","edited_by":"Roger Barton|Mark Goldblatt|Thomas A. Muldoon|","budget":"$130 million[2]"}