{"country":"United States","distributed_by":"20th Century Fox","story_by":"Bob Israel","Plot":"Party-animal Rick Gassko (Tom Hanks), who makes his living as a school bus driver, decides to finally settle down and marry his girlfriend Debbie Thompson (Tawny Kitaen). After gathering his buddies to give them the news, his shocked friends (led by Adrian Zmed) decide to throw him the bachelor party to end all bachelor parties. The bride's wealthy, conservative parents are not at all happy with her decision and her father decides to enlist the help of Debbie's ex-boyfriend Cole Whittier (Robert Prescott) to break them up and win her back.While Debbie worries and goes off to her bridal shower thrown by her friends, Rick heads off to the bachelor party and promises to remain faithful. Both parties start off on the wrong foot thanks to a little sabotage by Cole. As the bachelor party starts to heat up, Debbie and the girls decide to get even with Rick and his friends by having a party of their own. Both parties eventually collide leading to Debbie accusing Rick of infidelity.Both parties end up becoming one big drunken orgy and the bachelors' hotel room ends up getting trashed much to the chagrin of the hotel's ever-frustrated manager (Kenneth Kimmins). Adding to the confusion is Rick's friend, Brad who has become despondent over his wife breaking up with him. At various points during the movie, he riotously botches every suicide he attempts. He even tries slitting his wrists with an electric razor to which Rick says, \"Well.....at least your wrists will be smooth and kissable.\"Rick convinces Debbie of his love and faithfulness just as the party is raided by the police. In the ensuing melee, Rick and Debbie become separated and Cole kidnaps Debbie leaving Rick and his friends to chase after them culminating in a showdown between Rick and Cole, which includes a chase through a 36-screen movie theater. Rick and Cole have a humorous fist fight just below the movie screen which is showing a 3D movie. The fight is in direct synchronization to the on-screen fist fight. A female audience member gets punched in the face but attributes it to a 3D movie effect. Rick wins and he and Debbie embrace. After the wedding, Rick and Debbie are driven to the airport for their honeymoon in Rick's school bus driven by a laughing Brad.","language":"English","Reception":"Reviews for Bachelor Party were mixed, holding a rating of 52% on Rotten Tomatoes based on 25 reviews. While some critics appreciated the humor, others found it to be vulgar and gratuitous. Both film critics Roger Ebert and Janet Maslin recommended the film, but had reservations about certain aspects, calling it \"sophomoric\" and \"not a great film\".[3][4]","bachelor_party":"Theatrical poster","box_office":"$38.4 million (USA)","cinematography":"Hal Trussell","directed_by":"Neal Israel","Music":"The soundtrack album from Bachelor Party was released in 1984.The film also features songs:","release_dates":"June 29, 1984 (1984-06-29)|||||","Production":"The origins of the film came from an actual bachelor party thrown by producer Ron Moler and a group of friends for fellow producer Bob Israel. In fact, several members of the cast and crew involved with the production of the movie were at that party when the idea began to take shape.[1]The film was made in the wake of the success of Police Academy.[2]","produced_by":"Joe Roth Bob Israel Ron Moler","starring":"Tom Hanks|Adrian Zmed|William Tepper|Tawny Kitaen|","running_time":"105 minutes","Sequel":"Twenty-four years after Bachelor Party was released, 20th Century Fox Home Entertainment produced a straight-to-DVD sequel-in-name-only[5] called Bachelor Party 2: The Last Temptation.","music_by":"Robert Folk","edited_by":"Tom Walls","TV show":"On October 21, 2014, it was reported that American Broadcasting Company will be developing a TV show inspired by the film.[6]","written_by":"Neal Israel Pat Proft","budget":"$6 million"}