{"based_on":"Atlas Shrugged  by Ayn Rand","country":"United States","distributed_by":"Rocky Mountain Pictures","screenplay_by":"John Aglialoro Brian Patrick O'Toole[1]","Plot":"It is 2016 and the United States is in a sustained economic depression. Industrial disasters, resource shortages, and gasoline at $37/gallon have made railroads the primary mode of transportation, but even they are in disrepair. After a major accident on the Rio Norte line of the Taggart Transcontinental railroad, CEO James Taggart shirks responsibility. His sister Dagny Taggart, Vice-President in Charge of Operation, defies him by replacing the aging track with new rails made of Rearden Metal, which is claimed to be lighter yet stronger than steel. Dagny meets with its inventor, Hank Rearden, and they negotiate a deal they both admit serves their respective self-interests.Politician Wesley Mouch—nominally Rearden's lobbyist in Washington, D.C.—is part of a crowd that views heads of industry as persons who must be broken or tamed. James Taggart uses political influence to ensure that Taggart Transcontinental is designated the exclusive railroad for the state of Colorado. Dagny is confronted by Ellis Wyatt, a Colorado oil man angry to be forced to do business with Taggart Transcontinental. Dagny promises him that he will get the service he needs. Dagny encounters former lover Francisco d'Anconia, who presents a façade of a playboy grown bored with the pursuit of money. He reveals that a series of copper mines he built are worthless, costing his investors (including the Taggart railroad) millions.Rearden lives in a magnificent home with a wife and a brother who are happy to live off his effort, though they overtly disrespect it. Rearden's anniversary gift to his wife Lillian is a bracelet made from the first batch of Rearden Metal, but she considers it a garish symbol of Hank's egotism. At a dinner party, Dagny dares Lillian to exchange it for Dagny's diamond necklace, which she does.As Dagny and Rearden rebuild the Rio Norte line, talented people quit their jobs and refuse all inducements to stay. Meanwhile, Dr. Robert Stadler of the State Science Institute puts out a report implying that Rearden Metal is dangerous. Taggart Transcontinental stock plummets because of its use of Rearden Metal, and Dagny leaves Taggart Transcontinental temporarily and forms her own company to finish the Rio Norte line. She renames it the John Galt Line, in defiance of the phrase \"Who is John Galt?\"—which has come to stand for any question to which it is pointless to seek an answer.A new law forces Rearden to sell most of his businesses, but he retains Rearden Steel for the sake of his metal and to finish the John Galt Line. Despite strong government and union opposition to Rearden Metal, Dagny and Rearden complete the line ahead of schedule and successfully test it on a record-setting run to Wyatt's oil fields in Colorado. At the home of Wyatt, now a close friend, Dagny and Rearden celebrate the success of the line. As Dagny and Rearden continue their celebration into the night by fulfilling their growing sexual attraction, the shadowy figure responsible for the disappearances of prominent people visits Wyatt with an offer for a better society based on personal achievement.The next morning, Dagny and Rearden begin investigating an abandoned prototype of an advanced motor that could revolutionize the world. They realize the genius of the motor's creator and try to track him down. Dagny finds Dr. Hugh Akston, working as a cook at a diner, but he is not willing to reveal the identity of the inventor; Akston knows whom Dagny is seeking and says she will never find him, though he may find her.Another new law limits rail freight and levies a special tax on Colorado. It is the final straw for Ellis Wyatt. When Dagny hears that Wyatt's oil fields are on fire, she rushes to his home but finds a handwritten sign that reads, \"I am leaving it as I found it. Take over. It's yours.\"Wyatt declares in an answering machine message that he is \"on strike\".","language":"English","Release and reception":"The U.S. release of Atlas Shrugged: Part I opened on 300 screens on April 15, 2011, and made US$1,676,917 in its opening weekend, finishing in 14th place overall.[27] Producers announced expansion to 423 theaters several days after release and promised 1,000 theaters by the end of April,[28] but the release peaked at 465 screens. Ticket sales dropped off significantly in its second week of release, despite the addition of 165 screens; after six weeks, the film was showing on only 32 screens and total ticket sales had not crossed the $5 million mark, recouping less than a quarter of the production budget.[29]Atlas Shrugged: Part I was released on DVD and Blu-ray Disc on November 8, 2011 by 20th Century Fox Home Entertainment.[30] More than 100,000 DVD inserts were recalled within days due to the jacket's philosophically incorrect description of \"Ayn Rand's timeless novel of courage and self-sacrifice\".[31] As of April, 2013, 247,044 DVDs had been sold, grossing $3,433,445.[32]The film received overwhelmingly negative reviews. Rotten Tomatoes gives the film a score of 11% based on 47 reviews, with an average score of 3.6 out of 10. The site's consensus was: \"Passionate ideologues may find it compelling, but most filmgoers will find this low-budget adaptation of the Ayn Rand bestseller decidedly lacking.\"[33] Metacritic gives the film a \"generally unfavorable\" rating of 28%, as determined by averaging 19 professional reviews.[34] Some commentators noted differences in film critics' reactions from audience members' reactions; from the latter group, the film received high scores even before the film was released.[35][36][37]Let's say you know the novel, you agree with Ayn Rand, you're an objectivist or a libertarian, and you've been waiting eagerly for this movie. Man, are you going to get a letdown. It's not enough that a movie agree with you, in however an incoherent and murky fashion. It would help if it were like, you know, entertaining?Roger Ebert of the Chicago Sun-Times gave the film only one star, calling it \"the most anticlimactic non-event since Geraldo Rivera broke into Al Capone's vault.\"[1] Columnist Cathy Young of The Boston Globe gave the film a negative review.[38] Chicago Tribune published a predominantly negative review, arguing that the film lacks Rand's philosophical theme, while at the same time saying \"the actors, none of them big names, are well-suited to the roles. The story has drive, color and mystery. It looks good on the screen.\"[39] In the New York Post, Kyle Smith gave the film a mostly negative review, grading it at 2.5/4 stars, criticizing its \"stilted dialogue and stern, unironic hectoring\" and calling it \"stiff in the joints\", but also adding that it \"nevertheless contains a fire and a fury that makes it more compelling than the average mass-produced studio item.\"[40]Reviews in the conservative press were more mixed. American economist Mark Skousen praised the film, writing in Human Events, \"The script is true to the philosophy of Ayn Rand's novel.\"[41] The Weekly Standard senior editor Fred Barnes noted that the film \"gets Rand's point across forcefully without too much pounding\", that it is \"fast-paced\" when compared with the original novel's 1200-page length, and that it is \"at least as relevant today as it was when the novel was published in 1957.\"[42] Jack Hunter, contributing editor to The American Conservative, wrote, \"If you ask the average film critic about the new movie adaptation of Ayn Rand's Atlas Shrugged they will tell you it is a horrible movie. If you ask the average conservative or libertarian they will tell you it is a great movie. Objectively, it is a mediocre movie at best. Subjectively, it is one of the best mediocre movies you'll ever see.\"[43] In the National Post, Peter Foster credited the movie for the daunting job of fidelity to the novel, wryly suggested a plot rewrite along the lines of comparable current events, and concluded, \"if it sinks without trace, its backers should at least be proud that they lost their own money.\"[44]","box_office":"$4,627,375[3]","atlas_shrugged:_part_i":"Theatrical release poster","cinematography":"Ross Berryman","production_company":"The Strike Productions","directed_by":"Paul Johansson","release_dates":"April 15, 2011 (2011-04-15)|||||","Production":"In 1972, Albert S. Ruddy approached Rand to produce a cinematic adaptation of Atlas Shrugged. Rand agreed that Ruddy could focus on the love story. \"That's all it ever was,\" Rand said.[9][10][11] Rand insisted on having final script approval, which Ruddy refused to give her, thus preventing a deal. In 1978, Henry and Michael Jaffe negotiated a deal for an eight-hour Atlas Shrugged television miniseries on NBC. Jaffe hired screenwriter Stirling Silliphant to adapt the novel and he obtained approval from Rand on the final script. However, in 1979, with Fred Silverman's rise as president of NBC, the project was scrapped.[12]Rand, a former Hollywood screenwriter herself, began writing her own screenplay, but died in 1982 with only one third of it finished. She left her estate, including the film rights to Atlas Shrugged, to her student Leonard Peikoff, who sold an option to Michael Jaffe and Ed Snider. Peikoff would not approve the script they wrote and the deal fell through. In 1992, investor John Aglialoro bought an option to produce the film, paying Peikoff over $1 million for full creative control.[12]In 1999, under John Aglialoro's sponsorship, Albert Ruddy negotiated a deal with Turner Network Television for a four-hour miniseries, but the project was killed after the AOL Time Warner merger. After the TNT deal fell through, Howard and Karen Baldwin, while running Phillip Anschutz's Crusader Entertainment, obtained the rights. The Baldwins left Crusader, taking the rights to Atlas Shrugged with them, and formed Baldwin Entertainment Group in 2004. Michael Burns of Lions Gate Entertainment approached the Baldwins to fund and distribute Atlas Shrugged.[12] A two-part draft screenplay written by James V. Hart[13] was re-written into a 127–page screenplay by Randall Wallace, with Vadim Perelman expected to direct.[14] Potential cast members for this production had included Angelina Jolie,[15] Charlize Theron,[16] Julia Roberts,[16] and Anne Hathaway.[16] Between 2009 and 2010, however, these deals came apart, including studio backing from Lions Gate, and therefore none of the stars mentioned above appear in the final film. Also, Wallace did not do the screenplay, and Perelman did not direct.[1][17] Aglialoro says producers have spent \"something in the $20 million range\" on the project over the last 18 years.[2]In May 2010, Brian Patrick O'Toole and Aglialoro wrote a screenplay, intent on filming in June 2010. While initial rumors claimed that the films would have a \"timeless\" setting—the producers say Rand envisioned the story as occurring \"the day after tomorrow\"[18]—the released film is set in late 2016. The writers were mindful of the desire of some fans for fidelity to the novel,[18] but gave some characters, such as Eddie Willers, short shrift and omitted others, such as the composer Richard Halley. The film is styled as a mystery, with black-and-white freeze frames as each innovator goes \"missing\". However, Galt appears and speaks in the film, solving the mystery more clearly than in the first third of the novel.Though director Johansson had been reported as playing the pivotal role of John Galt, he made it clear in an interview that with regard to who is John Galt in the film, the answer was, \"Not me.\"[7] He explained that his portrayal of the character would be limited to the first film as a silhouetted figure wearing a trenchcoat and fedora,[8] suggesting that another actor will be cast as Galt for the subsequent parts of the trilogy.Though Stephen Polk was initially set to direct,[19] he was replaced by Paul Johansson nine days before filming was scheduled to begin. With the 18-year-long option to the films rights set to expire on June 15, 2010, producers Harmon Kaslow and Aglialoro began principal photography on June 13, 2010, thus allowing Aglialoro to retain the motion picture rights. Shooting took five weeks, and he says that the total production cost of the movie came in on a budget around US$10 million,[20] though Box Office Mojo lists the production cost as $20 million.[3]Elia Cmiral composed the score for the film.[21] Peter Debruge wrote in Variety that \"More ambitious sound design and score, rather than the low-key filler from composer Elia Cmiral and music supervisor Steve Weisberg, might have significantly boosted the pic's limited scale.\"[22]In a lot of ways, this project reflects the ethos of the Tea Party. You had both Republicans and Democrats who felt rejected by the establishment, and the same process is going to happen with Atlas Shrugged: We're going to build a constituency of people who believe in limited government and individual liberty.The film had a very low marketing budget and was not marketed in conventional methods.[24] Prior to the film's release on the politically symbolic date of Tax Day, the project was promoted throughout the Tea Party movement and affiliated organizations such as FreedomWorks.[23] The National Journal reported that FreedomWorks, the Tea Party-allied group headed by former House Majority Leader Dick Armey, (R-Texas), had been trying to get the movie opened in more theaters.[23] FreedomWorks also helped unveil the Atlas Shrugged movie trailer at the February 2011 Conservative Political Action Conference.[23] Additionally, it was reported that Tea Party groups across the country were plugging the movie trailer on their websites and Facebook pages.[23] Release of the movie was also covered and promoted by Fox News TV personalities John Stossel and Sean Hannity.[25][26]","produced_by":"John Aglialoro Harmon Kaslow","starring":"Taylor Schilling Grant Bowler","running_time":"102 minutes","Sequels":"The poor critical reception of Atlas Shrugged: Part I initially made Aglialoro reconsider his plans for the rest of the trilogy.[45] In an interview with The Hollywood Reporter, he said he was continuing with plans to produce Part II and Part III for release on April 15 in 2012 and 2013, respectively.[46] In a later interview with The Boston Globe, Aglialoro was ambivalent: \"I learned something long ago playing poker. If you think you're beat[en], don't go all in. If Part 1 makes [enough of] a return to support Part 2, I'll do it. Other than that, I'll throw the hand in.\"[47]In July 2011, Aglialoro planned to start production of Atlas Shrugged: Part II in September, with its release timed to coincide with the 2012 U.S. elections.[48] In October 2011, producer Harmon Kaslow stated that he hoped filming for Part II would begin in early 2012, \"with hopes of previewing it around the time of the nominating conventions\". Kaslow anticipated that the film, which would encompass the second third of Atlas Shrugged, would \"probably be 30 to 40 minutes longer than the first movie.\" Kaslow also stated his intent that Part II would have a bigger production budget, as well as a larger advertising budget.[49]On February 2, 2012, Kaslow and Aglialoro, the producers of Atlas Shrugged: Part II, announced a start date for principal photography in April 2012 with a release date of October 12, 2012.[50] Joining the production team was Duncan Scott, who, in 1986, was responsible for creating a new, re-edited version with English subtitles of the 1942 Italian film adaptation of We the Living. The first film's entire cast was replaced for the sequel.The sequel film, Atlas Shrugged: Part II, was released on October 12, 2012.[51] Critics gave the film a 5% rating on Rotten Tomatoes based on 22 reviews.[52] One reviewer gave the film a \"D\" rating,[53] while another reviewer gave the film a \"1\" rating (of 4).[54] In naming Part II to its list of 2012's worst films, The A.V. Club said \"The irony of Part II's mere existence is rich enough: The free market is a religion for Rand acolytes, and it emphatically rejected Part I.\"[55]","music_by":"Elia Cmiral","edited_by":"Jim Flynn Sherril Schlesinger","budget":"$20 million[2][3]"}