{"country":"United States","distributed_by":"Miramax Films","albino_alligator":"Theatrical release poster","Plot":"Brothers Dova (Matt Dillon) and Milo (Gary Sinise) are small-time crooks, their partner, Law (William Fichtner) pull a holdup in New Orleans that goes terribly wrong. A police officer is killed, as are two other men. The robbers flee to a local bar, Dino's Last Chance, desperately taking everyone inside hostage. Milo is seriously wounded and bleeding. Law is a sociopath who is ready and willing to kill anyone who gets in his way. Dova is their leader, trying to keep the situation calm while federal agents, led by Browning (Joe Mantegna), surround the bar. A bar employee, Janet (Faye Dunaway), tries but fails to reason with the intruders. Her boss, Dino, behind the bar, secretly has a shotgun that he is hoping to get a chance to use. Besides a barfly (John Spencer) who is barely coherent and a younger man (Skeet Ulrich) shooting pool, there is one other customer (Viggo Mortensen), a man named Foucard dressed in a business suit, who is not as innocent as he seems. As the life of Milo slips away and the robbers' demands to the cops go unmet, Dova decides whether to surrender or start letting Law shoot hostages one at a time.","language":"English","Reception":"Reviews for the film were generally mixed. It maintains a 47% \"rotten\" rating on Rotten Tomatoes.Faye Dunaway was nominated for a Golden Raspberry Award as Worst Supporting Actress.","box_office":"$339,379","cinematography":"Mark Plummer","directed_by":"Kevin Spacey","Soundtrack":"Ambient guitarist and record producer Michael Brook produced the score for Albino Alligator. The soundtrack was released by 4AD on CD in the United States on 11 February 1997, and CD and vinyl LP in the United Kingdom on 24 February 1997. The score includes a cover of \"Ill Wind (You're Blowing Me No Good)\" featuring bass by Flea and guest vocals from R.E.M.'s Michael Stipe and jazz singer Jimmy Scott.All songs written and composed by Michael Brook, except where noted. ","release_dates":"January 17, 1997 (1997-01-17)|||||","produced_by":"Bradley Jenkel Brad Krevoy Steven Stabler","starring":"Matt Dillon Faye Dunaway Gary Sinise","running_time":"97 minutes","music_by":"Michael Brook","edited_by":"Jay Lash Cassidy","written_by":"Christian Forte","budget":"$6 million"}