{"Cast":"Open auditions for the roles of Danny and Sarah were held on May 4, 2008, at the Sabes Jewish Community Center in St. Louis Park, Minnesota, one of the scheduled shooting locations. Open auditions for the role of Sarah were also held in June 2008 in Chicago, Illinois.[3][4]","country":"United States|United Kingdom|France|","distributed_by":"Focus Features","Plot":"In a prologue, a Jewish man in an unnamed pre-WWII Eastern European shtetl (possibly in Poland, as suggested by the mention of Lublin and Kraków) tells his wife that he was helped on his way home by Reb Groshkover, whom he has invited in for soup. She says Groshkover is dead and must be a dybbuk. Groshkover (Fyvush Finkel) arrives and laughs off the accusation, but she plunges an icepick into his chest. Bleeding, he exits their home into the snowy night.In 1967, Larry Gopnik (Michael Stuhlbarg) is a professor of physics living in St. Louis Park, Minnesota. His wife, Judith (Sari Lennick), tells him that she needs a get (a Jewish divorce document) so she can marry widower Sy Ableman (Fred Melamed). Meanwhile, their son Danny (Aaron Wolff) owes twenty dollars for marijuana to an intimidating Hebrew school classmate. He has the money, but it is hidden in a transistor radio that was confiscated by his teacher. Daughter Sarah is always washing her hair and going out. Larry's brother, Arthur (Richard Kind), sleeps on the couch and spends his free time filling a notebook with what he calls a \"probability map of the universe\".Larry faces an impending vote on his application for tenure, and his department head (Ari Hoptman) lets slip that anonymous letters have urged the committee to deny him. Clive Park, a student worried about losing his scholarship, meets with Larry in his office to argue he should not fail the class. After he leaves, Larry finds an envelope stuffed with cash. When Larry attempts to return it, Clive's father threatens to sue Larry either for defamation if Larry accuses Clive of bribery, or for keeping the money if he does not give him a passing grade.At the insistence of Judith and Sy, Larry and Arthur move into a nearby motel. Judith empties the couple's bank accounts, leaving Larry penniless, so he enlists the services of a divorce attorney (Adam Arkin). Larry learns Arthur faces charges of solicitation and sodomy.Larry turns to his Jewish faith for consolation. He consults two rabbis (Simon Helberg and George Wyner) but his synagogue's senior rabbi, Marshak, is never available. Larry and Sy are involved in separate, simultaneous car crashes. Larry is unharmed, but Sy dies. At Judith's insistence, Larry pays for Sy's funeral. At the funeral, Sy is eulogized as \"a serious man\".Larry is proud and moved by Danny's bar mitzvah, unaware that his son is under the influence of marijuana. During the service, Judith apologizes to Larry for all the recent trouble and informs him that Sy liked him so much that he even wrote letters to the tenure committee. Danny finally meets with Marshak, in a brief encounter in which Marshak only quotes Jefferson Airplane's \"Somebody To Love\", names the members of the band and returns the radio while counseling Danny to \"be a good boy\".Larry's department head compliments him on Danny's bar mitzvah and hints that he will receive tenure. The mail brings a large bill from Arthur's lawyer. Larry decides to pass Clive, whereupon Larry's doctor calls, asking to see him immediately about the results of a chest X-ray. At the same moment, Danny's teacher struggles to open the emergency shelter as a massive tornado closes in on the school.","language":"English","box_office":"$31.4 million[1]","cinematography":"Roger Deakins","production_company":"Relativity Media StudioCanal Working Title Films Mike Zoss Productions","directed_by":"Joel Coen Ethan Coen","Soundtrack":"All of the film's original music is by Carter Burwell,[15] who also worked on every previous Coen Brothers film except O Brother, Where Art Thou?.[16] The film also contains pieces of Yiddish music including \"Dem Milner’s Trern\" by Mark Warshawsky and performed by Sidor Belarsky,[17] which deals with the abuse and recurring evictions of Jews from Shtetlekh.[18]The soundtrack also includes the following songs by popular 1960s artists:","release_dates":"October 2, 2009 (2009-10-02)|||||","Production":"Considerable attention was paid to the setting; it was important to the Coens to find a neighborhood of original-looking suburban rambler homes as they would have appeared in St. Louis Park, Minnesota, in the late 1960s. Locations were scouted in nearby communities Edina, Richfield, Brooklyn Center, and Hopkins[5] before a suitable location was found in Bloomington.[6] The look of the film is partly based on the Brad Zellar book Suburban World: The Norling Photographs, a collection of photographs of Bloomington in the 1950s and 60s.[7]Location filming began on September 8, 2008, in Minnesota. An office scene was shot at Normandale Community College in Bloomington. The film also used a set built in the school's library, as well as small sections of the second floor science building hallway. The synagogue is the B'nai Emet Synagogue in St. Louis Park. The Coen brothers also shot some scenes in St. Olaf College's old science building because of its similar period architecture.[8][9] Scenes were also shot at the Minneapolis legal offices of Meshbesher & Spence, the name of whose founder and president, Ronald I. Meshbesher, is mentioned as the criminal lawyer recommended to Larry in the film.[10] Filming wrapped on November 6, 2008, after 44 days, ahead of schedule and within budget.[11]Despite many accurate recreations of the look and feel of period fashions, automobiles, and culture of 1967 Minnesota, there remain some anachronisms, including references to two albums, Carlos Santana's Abraxas and Creedence Clearwater Revival's Cosmo's Factory, that were released in 1970.Longtime collaborator Roger Deakins rejoined the Coen brothers as cinematographer, following his absence from Burn After Reading. This was his tenth film with the Coen brothers.[12] Costume designer Mary Zophres returned for her ninth collaboration with the directors.[12]The Coens themselves stated that the \"germ\" of the story was a rabbi from their adolescence: a \"mysterious figure\" who had a private conversation with each student at the conclusion of their religious education.[13] Ethan Coen said that it seemed appropriate to open the film with a Yiddish folk tale, but as the brothers did not know any suitable ones, they wrote their own.[14]","a_serious_man":"Theatrical release poster","produced_by":"Joel Coen|Ethan Coen|","starring":"Michael Stuhlbarg|Richard Kind|Fred Melamed|","running_time":"106 minutes","music_by":"Carter Burwell","edited_by":"Roderick Jaynes","Release":"The film began a limited release in the United States on October 2, 2009. It premiered at the Toronto International Film Festival[19] on September 12, 2009.[20]A Serious Man grossed $9,228,768 domestically, and $22,201,566 internationally, making for a worldwide gross of $31,430,334.[1]A Serious Man received mostly positive reviews from critics, and currently holds an 89% approval rating on Rotten Tomatoes, based on 209 reviews, with an average rating of 7.9/10. The site's critical consensus reads, \"Blending dark humor with profoundly personal themes, the Coen brothers deliver what might be their most mature -- if not their best -- film to date.\"[25] The film also holds a score of 79 out of 100 on Metacritic, based on 35 critics, indicating \"generally favorable reviews.\"[26]Roger Ebert, of the Chicago Sun-Times, rated the film four out of four stars. His review highlighted the film’s Yiddish folktale prologue, suggesting that though the Coens maintain it has no relation to the rest of the film, \"maybe because an ancestor invited a dybbuk (wandering soul) to cross his threshold, Larry is cursed.\"[27] Steve Zemmelman in his essay \"The Tempest Speaks: Liminality in A Serious Man\" considered that the prologue may link to the Jefferson Airplane soundtrack motif, reflecting Larry’s normal sense of order becoming increasingly disrupted. He writes, \"what can happen when 'the wheel falls off the cart,' as Velvel says happened to him on the road that night, or 'when the truth is found to be lies,' that lyric from 'Somebody to Love' that serves as bookends for this film.\"[28]Claudia Puig of USA Today wrote, \"A Serious Man is a wonderfully odd, bleakly comic and thoroughly engrossing film. Underlying the grim humor are serious questions about faith, family, mortality and misfortune.\"[29] Time critic Richard Corliss described it as \"disquieting\" and \"haunting\".[30]Many critics commented on the link between the film and the Biblical Book of Job. K. L. Evans wrote that \"we identify it as a Job story because its central character is tormented by his failure to account for the miseries that befall him.\"[31] In his essay \"Job of Suburbia?\", David Tollerton commented that the \"more substantial connection between A Serious Man and the Book of Job – the connection that reaches deeper – is their similarly absurd presentations of the human struggle with anguish and the divine.\"[32]The Wall Street Journal's Joe Morgenstern disliked what he saw as misanthropy in the film, saying that \"their caricatures range from dislikable through despicable, with not a smidgeon of humanity to redeem them.\"[33] David Denby of The New Yorker enjoyed the look and feel of the film, but found fault with the script and characterization: \"A Serious Man, like Burn After Reading, is in their bleak, black, belittling mode, and it's hell to sit through....As a piece of movie-making craft, A Serious Man is fascinating; in every other way, it's intolerable.\"[34] Steve Zemmelman commented that this kind of viewer response results from the film's lack of narrative resolution: \"The film is perplexing and the dialogue reminds the viewer repeatedly that we are in an encounter with the ever-conflictual and the infinitely mysterious.\"[35]Todd McCarthy said that \"A Serious Man is the kind of picture you get to make after you've won an Oscar.'\"[36]A Serious Man received numerous awards and nominations,[37][38] primarily within the categories of Best Picture, Screenplay, Cast, and Cinematography. Joel and Ethan Coen were awarded Best Original Screenplay at the 2009 National Board of Review Awards and the 2010 National Society of Film Critics Awards.[39] The screenplay also received a nomination for Best Original Screenplay at the 2010 Academy Awards. Other nominations for Best Original Screenplay include acknowledgment from the Writers Guild of America Awards, BAFTA,[40] the Broadcast Film Critics Association's 15th Annual Critic's Choice Awards[41] and the 2010 Boston Society of Film Critics.[42]The film was also nominated for Best Picture at the 82nd Academy Awards;[43] BBC News called it \"one of the less talked about nominees\".[44] Other nominations for Best Picture include the Broadcast Film Critics Association's 15th Annual Critics' Choice Awards, Boston Society of Film Critics and the Chicago Film Critics Association. The film was listed as one of the ten best films of 2009 by the National Board of Review of Motion Pictures, the American Film Institute, the Satellite Awards and the Southeastern Film Critics Association Awards.Stuhlbarg was awarded the Chaplin Virtuoso Award at the Santa Barbara International Film Festival[45] and nominated for Best Actor at the 2010 Golden Globe Awards.[46] Stuhlbarg, Kind, Melamed and Lennick were nominated for a Gotham Award for Best Performance by an Ensemble Cast.[47] Ethan Coen, Joel Coen, casting directors Ellen Chenoweth and Rachel Tenner, and actors Kind, Lennick, Melamed, Stuhlbarg, Wolff and McManus were awarded the 2010 Robert Altman Spirit Award by Film Independent for Excellence in Collaborative Cinematic Achievement by Directors, Casting Directors alongside an Ensemble Cast and Best Cinematography at the 2010 Independent Spirit Awards.[48]Roger Deakins was also recognized, receiving the Best Cinematography awards at both the 2009 Hollywood Awards and the 2009 San Francisco Film Critics Circle Awards, along with the Nikola Tesla Award[49] at the 2009 14th Satellite Awards.[50]","written_by":"Joel Coen|Ethan Coen|","budget":"$7 million"}