{"country":"Japan","distributed_by":"Rockwell Eyes","Plot":"All About Lily Chou-Chou follows two boys, Shūsuke Hoshino and Yūichi Hasumi, from the start of junior middle school when they first meet, and into second grade. The film has a discontinuous storyline, starting midway through the story, just after the second term of junior high school begins, then flashes back to the first term and summer vacation, and then skips back to the present.In elementary school, Hoshino was one of the best students in school, but was picked on by his classmates. Hoshino and Hasumi meet and become friends when they join the kendo club, and Hoshino invites Hasumi to stay over at his house. Hoshino's family is wealthy in comparison to Hasumi's family. Hasumi mistakes Hoshino's attractive young mother for his sister.The kendo club summer camp training is tough, and Hoshino, Hasumi and some other first-grade boys decide to take a trip to Okinawa. Once there, Hoshino has a traumatic near-death experience and his personality changes from good-natured to dangerous and manipulative. Back at school in September for second term, he takes his place as class bully and shows his newfound power by ruining the lives of his classmates. An alternative voice, that of the character Sumika Kanzaki, attributes Hoshino's personality change to the collapse of his family's business and his parent's divorce; this matches several scenes connecting the decline of Hoshino – who has had to change his name – to divorce.Hasumi, the confused and shy former friend of Hoshino, finds himself sucked into his now-tormentor's gang. He is ridiculed and coerced into doing Hoshino's dirty work, and finds solace only in the ethereal music Lily Chou-Chou makes, and acting as web editor for his fan website. Things become far worse for everyone when Hasumi is assigned to supervising Shiori Tsuda, whom Hoshino has blackmailed into enjo kōsai, and another girl is raped by Hoshino's lackeys after unwittingly offending the school's girl gang. The whole quagmire comes to a head when Hasumi heads to Tokyo to see a Lily Chou-Chou concert, where he encounters the last person he thought would be there.The story of Hoshino and Hasumi is paralleled by messages posted to a Lily Chou-Chou message board which are displayed on screen. Until the meeting at the concert, it is left up to the viewer to figure out which characters in the story are posting under what names.","language":"Japanese","cinematography":"Noboru Shinoda","directed_by":"Shunji Iwai","Box office totals":"Local:International:Rentals:","Music":"The soundtrack of Lily Chou-Chou was written and arranged by Takeshi Kobayashi, with vocals by the singer Salyu. It features a number of songs that are sung by the fictional rock star Lily Chou-Chou in the film. The soundtrack also makes heavy use of the classical music of Claude Debussy.In 2010 Salyu and Takeshi Kobayashi released a new song under the YouTube name 'LilyChouChou2000', suggesting that the Lily Chou-Chou moniker was still alive.","release_dates":"2001","Production":"On April 1, 2000, Shunji Iwai went live with his internet novel, in the form of a website called Lilyholic, where he posted messages as several characters on the BBS. Readers of the novel were free to post alongside Iwai's characters and interact with each other, indeed this BBS is where some of the content from the movie comes from. After the main incident in the novel took place, posting was closed and the second phase of the novel started, about the lives of 14-year-olds. (The novel is available on CD-ROM, but only in Japanese.)Production on the film began in Ashikaga, Tochigi Prefecture on August 13, 2000 and ended on November 28, 2000. It premiered at the Toronto International Film Festival on September 7, 2001 and opened in Japan on October 6, 2001.Iwai was the first Japanese director to use the, at the time, completely new digital video camera, the \"24 Progressive\" to shoot the film.It is thought that Iwai was inspired to shoot in digital by his friend, the anime and live-action film director Hideaki Anno, who shot his own digital film entitled Love & Pop, in 1998. Anno later cast Iwai as the lead in his second live-action film, Shiki-Jitsu. After the films a release a synopsis written from the point of view of the main character Yūichi was published online to explain the films events.[2]","produced_by":"Koko Maeda","starring":"Hayato Ichihara Shugo Oshinari Ayumi Ito Takao Osawa Miwako Ichikawa Izumi Inamori Yū Aoi","running_time":"146 min","all_about_lily_chou-chou":"Theatrical release poster","edited_by":"Yoshiharu Nakagami","written_by":"Shunji Iwai"}