{"based_on":"the 1953 novel A Kiss Before Dying  by Ira Levin","country":"United States United Kingdom","distributed_by":"Universal Pictures","screenplay_by":"James Dearden","a_kiss_before_dying":"Theatrical release poster","Comparisons to novel":"While leaving Corliss' character basically unchanged (other than renaming him Jonathan), the film drastically changed the story of the novel. In the film, Corliss fakes his own suicide after murdering Dorothy, and re-emerges as \"Jay Faraday\" to woo and marry Dorothy's sister, Ellen. In the novel, Corliss does not take on a new identity. Ellen's other sister, Marion, does not appear in either film version of the story. The \"Gant\" character in the novel was rewritten as a homicide detective who had investigated Dorothy's death. In this film, Corliss meets his end while attempting to kill Ellen after she discovers who he really is; while chasing her down, and for the sake of irony, he is run over by one of her father's trains.[8]","Plot":"Sometime in the past, a copper refinery owned by Thor Carlsson (Max von Sydow) has metal shipped out on Carlsson Copper trains that run right behind a young boy's house, who stares out forlornly at the tracks.1987: The University of Pennsylvania. A blonde student, Dorothy Carlsson (Sean Young) doodles in her notebook during class, drawing herself being married to a suitor. After class, she changes into a more formal outfit, and runs into her friend Patricia Farren (Martha Gehman) on her way out. Patricia asks if she is going to meet her \"mystery man\", but Dorothy claims she is just going to meet her father for lunch.On her way across town, Dorothy asks the cab to wait while she buys a new pair of shoes. At city hall, she meets Jonathan Corliss (Matt Dillon). The couple go up to the marriage license bureau, but it is closed for lunch. They discuss how her father would disown her if he knew what she was doing. Jonathan convinces her to wait for the office to reopen on the roof of the building. Eventually, he tosses her over the edge, taking her gold lighter and cigarettes, leaving her purse and tossing her new shoes after her plunging body. In the lobby, he mails a letter and calmly walks past her body as the crowd gathers.Thor and his daughter Ellen, Dorothy's twin, are shocked to find out Dorothy was pregnant and to read Dorothy's suicide note, which was mailed the day she died. Ellen cannot believe that her sister would kill herself. Jonathan returns to his working class home in Pittsburgh possessing a portfolio of clippings regarding the Carlsson family and fortunes, particularly the suicides of Thor's wife and son. Promising his mother that he will make something of his life, he hitchikes to New York, getting a ride from Jay Farraday (Adam Horovitz) who reveals that he is a bohemian drifter whose parents had died on Korean Air Lines Flight 007.Four months later, Ellen is working at Castle House, a shelter and outreach program working to help troubled kids and prostitutes. Ellen takes off from the night shift to visit Philadelphia and investigate Dorothy's death. She meets Detective Dan Corelli (James Russo) and shows him the drawing Dorothy had made in class of her wedding. Because the drawing is dated on the day she died, and given the fact that the building houses a marriage license bureau, Ellen believes Dorothy had no motive to kill herself, and that the suicide note must have been mailed as a cover. As such, she believes that Dorothy must have been lured to her death with the promise of marriage, and that her killer was her boyfriend.Det. Corelli dismisses her theory, and Ellen returns to the UPenn campus, speaking with Patricia, who reveals that Dorothy had been dating some mystery man. Patricia's tip leads Ellen to the law library where she meets Dorothy's ex-boyfriend Tommy Roussell (Ben Browder). Tommy explains that he had a breakdown after his relationship with Dorothy ended, and he was out of school when she died, then remembered that she was dating a new man, and he takes her back to his apartment to show her the yearbook photo of the man she was dating. Ellen waits outside Tommy's building, while Jonathan silently stalks her in his car. Tommy finds Jonathan's photo in the yearbook, but as he heads downstairs, Jonathan surprises him and strangles Tommy with his belt then types a suicide note that admits to killing Dorothy on Tommy's computer and strings his body up. Ellen is left convinced that Tommy must have killed Dorothy.Back in New York, she gets ready for bed, when her boyfriend comes over. Jonathan has assumed the identity of Jay Faraday and begun a relationship with Ellen. The pair seem quite happy, and she has no idea who he really is. As their relationship develops, they work together at Castle House, and Jay manages to impress Thor with his ambition and good nature. Ellen and Jay marry, and he begins to work for Carlsson Copper. One day, he intercepts a phone call from Patricia, who is heading to New York because she has remembered the identity of Dorothy's boyfriend at the time that she died. Jay claims that Ellen is out of town, but arranges for Patricia to wait in her hotel room for a call from Ellen the next day at 6:30 p.m. At that time, he attacks Patricia, strangling her and dismembering her body in the bathtub. Jay stuffs her carcass in a suitcase, and packs it in the trunk of his car, before going out on a date with Ellen. After dropping Ellen off back home, he dumps the suitcase off of a bridge into the East River.A police detective visits Ellen to ask if Patricia had contacted her by investigating her disappearance, and Ellen's name and number were in Patricia's diary. The disappearance strikes Ellen as one coincidence too many in which she calls Tommy's parents and confirms that he was institutionalised at the time of Dorothy's death. Ellen then asks Det. Corelli to reopen the investigation, but nothing turns up.One night when she is at a bar with Jay, one of his co-workers from a burger joint back at UPenn recognises him as Jonathan Corliss. Jay insists that he is mistaken, eventually hitting him. The incident deeply unsettles Ellen, who digs up an old UPenn yearbook, where she finds a picture of Jonathan, confirming that he looks identical to Jay. Tracking down Jonathan's mother, she explains that Jonathan died three years ago. Ellen visits Jonathan's mother in the house where he grew up, and hears about his childhood. After the mother leaves, Ellen sneaks back into the house to snoop around Jonathan's room, finding his suitcase of clippings about her family, which also contains her sister's lighter. Jonathan has followed her back to his home, and he confesses that he killed Jay Faraday and assumed his identity since no one would miss him. Afterwards, he had planned to position himself in the Carlsson lineage by marrying Dorothy, but her unplanned pregnancy had meant that she would be disinherited. Jonathan unties his belt and approaches Ellen explaining that he will simply have to comfort her father as he loses another child. Ellen manages to escape, fleeing out the back of the house and up to the train tracks. Jonathan pursues her and is run over by a Carlsson train.","language":"English","Reception":"Chicago Sun-Times film critic Roger Ebert praised the direction of the picture and Matt Dillon's work, writing, \"This is Matt Dillon's first film since Drugstore Cowboy, and demonstrates again that he is one of the best actors working in movies. He possesses the secret of not giving too much, of not trying so hard that we're distracted by his performance...[and director] Dearden helps it work because he doesn't press his point.\"[5]Rolling Stone's Peter Travers was not as kind in his review of this film, especially when compared to the 1956 original. He blasts the screenplay and the direction of the film. He wrote: \"Though Dearden gets the surface right – the movie looks sleek – he skimps on characterization...[and] Dearden's script fails to provide the raw material that would let him go beyond the stereotype...Dearden merely walks the cast through a gauntlet of film noir cliches\".[6]The review aggregator Rotten Tomatoes reported that 31% of critics gave the film a positive review, based on 13 reviews.[7]Wins","box_office":"$15,429,177","cinematography":"Mike Southon","directed_by":"James Dearden","release_dates":"26 April 1991 (1991-04-26) (Los Angeles)|14 June 1991 (1991-06-14) (United Kingdom)||||","Production":"The producers of A Kiss Before Dying wanted River Phoenix to play Jonathan. They approached him several times for the role, and kept increasing their offers, but he didn't feel a connection to the material and felt he was unsuitable to play the part, so he repeatedly turned it down and Matt Dillon was then cast. Diane Lane and Penelope Ann Miller were each considered for the dual roles of Ellen and Dorothy, but both rejected it. Bridget Fonda was originally cast, but quit the production due to scheduling conflicts and Sean Young signed on to replace her.[2]The film was primarily shot in Great Britain, with secondary locations in the United States.British locations include: Port Talbot steelworks, Cardiff, South Glamorgan, Wales, (opening sequence at \"Abbey Coke Ovens area of Port Talbot Steel works, with Main Pumphouse, cooling tower and water storage towers in the background\"); Brocket Hall, Welwyn Garden City, Hertfordshire, England; Gaddesden Place, Hemel Hempstead, Hertfordshire, England; Lee International Studios, Shepperton, Surrey, England; and London, England.United States: Charlottesville, Virginia; New York City; and Philadelphia, Pennsylvania.The film opened in wide release on 26 April 1991 in the United States.[3] In England it opened on 14 June 1991.The box-office receipts were poor. The first week's gross was $4,348,165 and the total receipts for the four-week run were $14,478,720. The film was in wide release for thirty-one days.In its widest release the film was featured in 1,546 theatres across the country.[4]","produced_by":"Robert Lawrence","starring":"Matt Dillon|Sean Young|Max von Sydow|Diane Ladd|James Russo|","running_time":"94 minutes","music_by":"Howard Shore","edited_by":"Michael Bradsell","budget":"$27 million"}