{"country":"Italy","Plot":"The film is set in Rome during the Marshall Plan. Ferdinando Esposito (Totò) is a small villain who tries to support his family with his tricks. With his accomplice Amilcare (Aldo Giuffrè) pretends to have found an ancient coin in the Roman Forum and an American tourist cheats: Mr. Locuzzo that, unfortunately for him, is the chairman of a committee of the American charity. During the distribution of some gift-packs, also Esposito, these recognize and denounce the spot.So begins a comical car chase with a fat police officer, Sergeant Lorenzo Buttoni (Aldo Fabrizi). At first unable to capture him, but then cheated by Esposito, if he blurts out. Suspended from duty for the protests of Mr. Locuzzo, the agent Bottoni risk of losing their jobs if they fail to stop the thief within three months. Dressed civilian clothes and hid the incident to his family, goes in search of Esposito. Find his house and so he knows the family, trying to ingraziarsela with favors and offers of food. Esposito, however, no trace. Gradually the two families become friends, and between his brother's wife's \"Thief\" and the daughter of the \"guard\" is a sympathy.Comes the day of the meal during which you know the two families and is taken for granted the presence of Esposito, unaware of his identity. Currently dell'agnizione, which takes place outside the home, Esposito chides him for having taken away the good faith of his family, while Bottoni confides his drama. A sort of human complicity develops between the two. So the roles are reversed and it is the same Esposito who decided to carry him to prison, despite the sergeant he is now reluctant. By hiding the truth to their families, believing instead that they have common concerns, the two leave the room friendly by making them believe that Esposito leaves for a business trip and accompany him to the station buttons. In his absence, will be Bottoni to think about the Esposito family.","language":"Italian","cinematography":"Mario Bava","directed_by":"Steno Mario Monicelli","guardie_e_ladri":"Italian film poster","release_dates":"21 October 1951 (1951-10-21)","Production":"The subject of Cops and Robbers was born Piero Tellini, which was inspired by an idea had by Federico Fellini. The film was to be directed by Luigi Zampa. The director wanted to allocate the proportion of the guard at Peppino De Filippo and that of his wife Anna Magnani, but had to cancel the movie because some of his old movies had problems with censorship. So the direction was entrusted to Monicelli and Steno. The film was one of the first to be produced by the production house \"Ponti-De Laurentiis\" and was Carlo Ponti had the idea to put together Totò and Aldo Fabrizi. In real life, the two actors were affectionate friends, but had never worked together. Everyone was worried about what might happen Totò and putting together Fabrizi, however, everything went very well. Totò was a bit 'hesitant at first, when he was offered the role, because it was very different from the characters he had played before. The shooting of Steno and Monicelli began February 3, 1951, but because of the problems they had with the censorship the film was released towards the end of the year, so Steno and Monicelli had to change some things in the film already shot.","Box office":"The proceeds of the film was ₤ 653.790.000, became one of the highest grossing films of Totò.","produced_by":"Carlo Ponti Dino De Laurentiis","starring":"Totò Aldo Fabrizi Ave Ninchi Rossana Podestà","running_time":"109 minutes","music_by":"Alessandro Cicognini","edited_by":"Adriana Novelli","written_by":"Vitaliano Brancati Ennio Flaiano Aldo Fabrizi Mario Monicelli Ruggero Maccari Steno"}