{"based_on":"Cat on a Hot Tin Roof by Tennessee Williams","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Richard Brooks James Poe","Plot":"Late one night, a drunken Brick Pollitt (Paul Newman) is out trying to recapture his glory days of high school sports by leaping hurdles on a track field, dreaming about his moments as a youthful athlete. Unexpectedly, he falls and breaks his leg, leaving him dependent on a crutch. Brick, along with his wife, Maggie \"the Cat\" (Elizabeth Taylor), are seen the next day visiting his family's estate in eastern Mississippi, there to celebrate Big Daddy's (Burl Ives) 65th birthday.Depressed, Brick decides to spend his days drinking while resisting the affections of his wife, who taunts him about the inheritance of Big Daddy's wealth. Numerous allusions are made to their tempestuous marriage – there are speculations as to why Maggie does not yet have children while Brick's brother Gooper (Jack Carson) and his wife Mae (Madeleine Sherwood) have a whole clan, many of whom run around the \"plantation\" (as Big Daddy's estate is called) unsupervised and singing obnoxiously.Big Daddy and Big Mama (Judith Anderson) arrive home from the hospital via their private airplane and are greeted by Gooper and his wife, along with Maggie. Despite the efforts of Mae, Gooper and their kids to draw his attention to them, Big Daddy has eyes only for Maggie. The news is that Big Daddy is not dying from cancer. However, the doctor later meets privately with first Gooper and then Brick where he divulges that it is a deception. Big Daddy has inoperable cancer and will likely be dead within a year, and the truth is being kept from him. Brick later confides in Maggie with the truth about Big Daddy's health, and she is very heartbroken. Maggie wants Brick to take an interest in his father’s wealth as well as health, but Brick stubbornly refuses.As the party winds down for the night, Big Daddy meets with Brick in his room and reveals that he is fed up with his alcoholic son’s behavior, demanding to know why he is so stubborn. A revealing moment ensues when Maggie joins them and tells what happened a few years ago on the night Brick's best friend and football teammate Skipper committed suicide. Maggie was jealous of Skipper because he had more of Brick's time. (There is a very subtle hint at this point that Skipper and Brick may have been romantically involved with each other.) She decided to ruin their relationship \"by any means necessary\", intending to seduce Skipper and put the lie to his loyalty to her husband. However, Maggie ran away without completing the plan. Brick had blamed Maggie for Skipper's death, but actually blames himself for not helping Skipper when he repeatedly phoned Brick in a hysterical state.After an argument, Big Daddy learns from Brick that he will die from cancer and that this birthday will be his last. Shaken, he retreats to the basement. Meanwhile, Gooper, who is a lawyer, and his wife argue with Big Mama about the family's cotton business and Big Daddy's will. Brick descends into the basement, a labyrinth of antiques and family possessions hidden away. He and Big Daddy confront each other before a large cut-out of Brick in his glory days as an athlete.The rest of the family begins to crumble under pressure, with Big Mama stepping up as a strong figure. Maggie says that she'd like to give Big Daddy her birthday present: the announcement of her being pregnant. After Mae calls Maggie a liar, Big Daddy and Brick defend her, even though they know the statement to be untrue. Even Gooper finds himself admitting, \"That girl's got life in her, alright.\" Maggie and Brick reconcile, and the two kiss, with the implication that they will make love, possibly making Maggie's \"lie\" become \"truth\".","language":"English","box_office":"$11,285,000[1]","cinematography":"William Daniels","directed_by":"Richard Brooks","Production notes":"The original stage production of Cat on a Hot Tin Roof opened on Broadway March 24, 1955, with Ives and Sherwood in the roles they subsequently played in the movie. Ben Gazzara played Brick in the stage production and rejected the film role as did Elvis Presley.[citation needed] Athlete turned film star Floyd Simmons also tested for the role.[4]Lana Turner[citation needed] and Grace Kelly[5] were both considered for the part of Maggie before the role went to Taylor.Production began on March 12, 1958, and by March 19, Taylor had contracted a virus which kept her off the shoot. On March 21, she canceled plans to fly with her husband Mike Todd to New York, where he was to be honored the following day by the New York Friars' Club. The plane crashed, and all passengers, including Todd, were killed. Beset with grief, Taylor remained off the film until April 14, 1958, at which time she returned to the set in a much thinner and weaker condition.[6]","Academy Awards":"Tennessee Williams was reportedly unhappy with the screenplay, which removed almost all of the homosexual themes and revised the third act section to include a lengthy scene of reconciliation between Brick and Big Daddy. Paul Newman, the film's star, had also stated his disappointment with the adaptation. The Hays Code limited Brick's portrayal of sexual desire for Skipper, and diminished the original play's critique of homophobia and sexism. Williams so disliked the toned-down film adaptation of his play that he told people in the queue, \"This movie will set the industry back 50 years. Go home!\"[7]Despite this, the film was highly acclaimed and though it did not win any Academy Awards, it received several nominations including Best Picture, Best Actor (Newman), Best Actress (Taylor), and Best Director (Brooks). The film also received nominations for Best Cinematography, Color (William Daniels), and Best Writing, Screenplay Based on Material from Another Medium. Cat may have been too controversial for the Academy voters; the film won no Oscars, and the Best Picture award went to Gigi that year. Ives won the Best Supporting Actor Oscar for The Big Country at the same ceremony.","cat_on_a_hot_tin_roof":"Theatrical release poster by Reynold Brown","release_dates":"September 20, 1958 (1958-09-20)|||||","produced_by":"Lawrence Weingarten","starring":"Elizabeth Taylor Paul Newman Burl Ives Judith Anderson","running_time":"107 minutes","Box Office":"According to MGM records the film earned $7,660,000 in the US and Canada and $3,625,000 elsewhere resulting in a profit of $2,428,000.[1]","edited_by":"Ferris Webster","budget":"$2,345,000[1]"}