{"based_on":"story by Tim Kelly","distributed_by":"American International Pictures","Plot":"The film is set in Elizabethan England and revolves around a wicked magistrate who tries to kill all the members of a coven of witches. It opens, like many Vincent Price movies, with a quote from Edgar Allan Poe—in this case, The Bells.Lord Edward Whitman (Vincent Price), as magistrate presides over the trial of a young woman. Ruling that she is a witch, he has her branded, whipped through the streets, then placed in the village stocks.That night, Lord Edward hosts a feast as his henchmen search the countryside for the killers of a sheep. Two poor and ragged-looking teenagers are pulled into the hall. A burst of wolf-like howling from outside the walls warns that they may be \"devil-marked.\" The lord decides to kill them in spite of the risk. As his shifty eldest son Sean (Stephan Chase) sleeps with his father's pretty young wife Lady Patricia (Essy Persson), Lord Whitman begins mumbling that he wants to \"clean up\" the witches in the area.Assisted by his two older sons, Whitman goes hunting in the hills for witches. His armed posse breaks up what is apparently meant to be a witches' Black Sabbath. He kills several of them, and tells the rest to scatter to the hills and never return. This makes the leader of the coven, Oona (Elizabeth Bergner), extremely angry. To get revenge on the Whitman clan Oona calls up a magical servant, a \"sidhe\", to destroy the lord's family. Unfortunately, the demonic beast takes possession of the friendly, decent young servant, Roderick (Patrick Mower), that free-spirited Maureen Whitman (Hilary Dwyer) has been in love with for years. The servant turned demon begins to systematically kill off members of the Whitman family.Eventually, Harry (Carl Rigg), Whitman's son from Cambridge, and Father Tom (Marshall Jones) find Oona and her coven conjuring the death of Maureen and kill Oona. At that moment, Roderick, who was attacking Maureen, breaks off and leaves her. He soon returns and attacks Lord Edward. During this attack, Maureen shoots the demon in the head with a blunderbuss, apparently killing him.Exhilarated that the curse is over, Whitman plans to leave the house with his two remaining children by coach. On the way, he stops at the cemetery, so he can reassure himself Roderick is dead. To his horror, he finds the coffin empty, and hurries back to the coach, only to find both Harry and Maureen dead. It is then revealed that Bully Boy (Andrew McCulloch), the coach's driver, was murdered by Roderick, who is now driving the coach.The film ends with Whitman screeching his driver's name in terror, as the coach heads for parts unknown.","language":"English","Trivia":"\"Who spurs the beast the corpse will ride? \"Who cries the cry that kills? \"When Satan questioned, who replied? \"Whenst blows this wind that chills? \"Who walks amongst these empty graves \"And seeks a place to lie? \"'Tis something God ne'er had planned, \"A thing that ne'er had learned to die.\"This verse was spuriously attributed to Edgar Allan Poe.","box_office":"$1,306,000 (US/ Canada rentals)[2]","cry_of_the_banshee":"Theatrical release poster.","cinematography":"John Coquillon","directed_by":"Gordon Hessler","Home Video Release":"In April 1991, Cry of the Banshee was packaged as a Laserdisc double feature (Catalog Number ID7661HB), paired with the first of the Count Yorga movies, Count Yorga, Vampire. Both films were not letterboxed, but employed a full screen, pan-and-scan process.The 1988 UK Guild video release featured the same heavily edited print as the US and UK cinema ones. All DVD releases however have featured the full uncut version, which also restores the original Wilfred Josephs music score.","release_dates":"Jul 29, 1970 (U.S. release)","Production":"Gordon Hessler did not like Tim Kelly's original script and hired Chris Wicking to rewrite it.[3] Hessler says he would have got Wicking to change it further and improving the witch characters - but AIP would not let him. The original music score was composed by Wilfred Josephs but AIP decided not to use it, commissioning a score by Les Baxter instead. Josephs' score was restored in the later uncut DVD releases. Elisabeth Bergner plays a small rôle; it was her first appearance in a film in 29 years.[1]","produced_by":"Louis M. Heyward Executive Samuel Z. Arkoff James H. Nicholson Gordon Hessler","starring":"Vincent Price Elizabeth Bergner Essy Persson Hugh Griffith Patrick Mower Hilary Dwyer Sally Geeson","running_time":"91 min.","music_by":"Les Baxter (U.S theatrical version) Wilfred Josephs (uncut version)","edited_by":"Oswald Hafenrichter","Release":"The US theatrical release featured the 'GP' rated print which replaced the opening animated credits with still ones, completely altered the music score, and was cut to remove all footage of topless nudity and to tone down assorted whippings and assault scenes. This print was also used for the original UK cinema release in 1970. The film was a commercial success but Hessler was dissatisfied with it and calls it the least interesting of the four movies he made for AIP.[1]","written_by":"Tim Kelly Christopher Wicking (screenplay)","budget":"$450,000-$500,000 (est.)[1]"}