{"based_on":"Casino Royale  by Ian Fleming","Cast":"Casino Royale also takes credit for the greatest number of actors in a Bond film either to have appeared or to go on to appear in the rest of the Eon series – besides Ursula Andress in Dr. No, Vladek Sheybal appeared as Kronsteen in From Russia with Love, Burt Kwouk featured as Mr. Ling in Goldfinger and an unnamed SPECTRE operative in You Only Live Twice, Jeanne Roland plays a masseuse in You Only Live Twice, and Angela Scoular appeared as Ruby Bartlett in On Her Majesty's Secret Service. Jack Gwillim, who had a tiny role as a British army officer, played a Royal Navy officer in Thunderball. Caroline Munro, who can be seen very briefly as one of Dr Noah's gun-toting guards, received the role of Naomi in The Spy Who Loved Me. Milton Reid, who appears in a bit part as the temple guard, opening the door to Mata Bond's hall, played one of Dr. No's guards and Stromberg's underling, Sandor, in The Spy Who Loved Me. John Hollis, who plays the temple priest in Mata Bond's hall, went on to play the unnamed figure clearly intended to be Blofeld in the pre-credits sequence of For Your Eyes Only. John Wells, Q's assistant, appeared in For Your Eyes Only as Denis Thatcher. Hal Galili, who appears briefly as a US army officer at the auction, had earlier played gangster Jack Strap in Goldfinger.Major stars like George Raft and Jean-Paul Belmondo were given top billing in the film's promotion and screen trailers despite the fact that they only appeared for a few minutes in the final scene.[3]Well established stars like Peter O'Toole and sporting legends like Stirling Moss were prepared to take uncredited parts in the film just to be able to work with the other members of the cast.[3] Stunt director Richard Talmadge employed Geraldine Chaplin to appear in a brief Keystone Cops insert. The film also proved to be young Anjelica Huston's first experience in the film industry as she was called upon by her father, John Huston, to cover the screen shots of Deborah Kerr's hands.[3] The film also marks the debut of Dave Prowse, later the physical form of Darth Vader in the Star Wars series, as Frankenstein's monster, a role he would later play again in the Hammer films The Horror of Frankenstein and Frankenstein and the Monster from Hell. John Le Mesurier also features in the early scenes of the film as M's driver.[4]","country":"United Kingdom","distributed_by":"Columbia Pictures","screenplay_by":"Wolf Mankowitz John Law Michael Sayers","casino_royale":"British cinema poster by Robert McGinnis","Plot":"The story of Casino Royale is told in an episodic format. Val Guest oversaw the assembly of the sections, although he turned down the credit of \"co-ordinating director\".[1]Evelyn Tremble/James Bond 007 (Peter Sellers) and Inspector Mathis meet in a pissoir, where Mathis presents his credentials—in a shot suggesting a display of Mathis' genitals, and setting the tone of the film by satirising the dramatic opening sequences in the Eon Bond films.Sir James Bond 007, a legendary British spy who retired from the secret service 20 years previously, is visited by the head of British MI6, M, CIA representative Ransome, KGB representative Smernov, and Deuxième Bureau representative Le Grand. All implore Bond to come out of retirement to deal with SMERSH who have been eliminating agents: Bond spurns all their pleas. When Bond continues to stand firm, his mansion is destroyed by a mortar attack at the orders of M, who is, however, killed in the explosion.Bond travels to Scotland to return M's remains to the grieving widow, Lady Fiona McTarry. However, the real Lady Fiona has been replaced by SMERSH's Agent Mimi. The rest of the household have been likewise replaced, with SMERSH’s aim to discredit Bond by destroying his \"celibate image\". Attempts by a bevy of beauties to seduce Bond fail, but Mimi/Lady Fiona becomes so impressed with Bond that she changes loyalties and helps Bond to foil the plot against him. On his way back to London, Bond survives another attempt on his life.Bond is promoted to the head of MI6. He learns that many British agents around the world have been eliminated by enemy spies because of their inability to resist sex. Bond is also told that the \"sex maniac\" who was given the name of \"James Bond\" when the original Bond retired has gone to work in television. He then orders that all remaining MI6 agents will be named \"James Bond 007\", to confuse SMERSH. He also creates a rigorous programme to train male agents to ignore the charms of women. Moneypenny recruits \"Coop\", a karate expert who begins training to resist seductive women: he also meets an exotic agent known as the Detainer.Bond then hires Vesper Lynd, a retired agent turned millionaire, to recruit baccarat expert Evelyn Tremble, whom he intends to use to beat SMERSH agent Le Chiffre. Having embezzled SMERSH's money, Le Chiffre is desperate for money to cover up his theft before he is executed.Following up a clue from agent Mimi, Bond persuades his estranged daughter Mata Bond to travel to East Berlin to infiltrate International Mothers' Help, an au pair service that is a cover for a SMERSH training center. Mata uncovers a plan to sell compromising photographs of military leaders from the US, USSR, China and Great Britain at an \"art auction\", another scheme Le Chiffre hopes to use to raise money: Mata destroys the photos. Le Chiffre's only remaining option is to raise the money by playing baccarat.Tremble arrives at the Casino Royale accompanied by Lynd, who foils an attempt to disable him by seductive SMERSH agent Miss Goodthighs. Later that night, Tremble observes Le Chiffre playing at the casino and realises that he is using infrared sunglasses to cheat. Lynd steals the sunglasses, allowing Evelyn to eventually beat Le Chiffre in a game of baccarat. Lynd is apparently abducted outside the casino, and Tremble is also kidnapped while pursuing her. Le Chiffre, desperate for the winning cheque, hallucinogenically tortures Tremble. Lynd rescues Tremble, only to subsequently kill him. Meanwhile, SMERSH agents raid Le Chiffre's base and kill him.In London, Mata Bond is kidnapped by SMERSH in a giant flying saucer, and Sir James and Moneypenny travel to Casino Royale to rescue her. They discover that the casino is located atop a giant underground headquarters run by the evil Dr. Noah, secretly Sir James' nephew Jimmy Bond, a former MI6 agent who defected to SMERSH to spite his famous uncle. Jimmy reveals that he plans to use biological warfare to make all women beautiful and kill all men over 4-foot-6-inch (1.37 m) tall, leaving him as the \"big man\" who gets all the girls. Jimmy has already captured The Detainer, and he tries to convince her to be his partner; she agrees, but only to dupe him into swallowing one of his \"atomic time pills\", turning him into a \"walking atomic bomb\".Sir James, Moneypenny, Mata and Coop manage to escape from their cell and fight their way back to the Casino Director's office where Sir James establishes Lynd is a double agent. The casino is then overrun by secret agents and a battle ensues. American and French support arrive, but just add to the chaos. Eventually, Jimmy's atomic pill explodes, destroying Casino Royale with everyone inside. Sir James and all of his agents then appear in heaven, and Jimmy Bond is shown descending to hell.","language":"English","Release and reception":"Casino Royale had its world premiere in London's Odeon Leicester Square on 13 April 1967, breaking many opening records in the theatre's history.[30] Its American premiere was held in New York on 28 April, at the Capitol and Cinema I theatres.[31] It opened two months prior to the fifth Bond film by Eon Productions, You Only Live Twice.[12]Despite the lukewarm nature of the contemporary reviews, the pull of the James Bond name was sufficient to make it the 13th highest grossing film in North America in 1967 with a gross of $22.7 million and a worldwide total of $41.7 million[32] ($296 million in 2016 dollars[6]).[a] Orson Welles attributed the success of the film to a marketing strategy that featured a naked tattooed woman on the film's posters and print ads[3] as well as a billboard in New York's Times Square.[34] The campaign also included a series of commercials featuring British model Twiggy.[35] As late as 2011, the film was still making money for the estate of Peter Sellers, who negotiated an extraordinary 3% of the gross profits (an estimated £120 million), with the proceeds currently going to Cassie Unger, the daughter and sole heir of Sellers' beneficiary, fourth wife Lynne Frederick.[36]No advance press screenings of Casino Royale were held, leading reviews to only appear after the premiere.[30] The chaotic nature of the production was featured heavily in contemporary reviews, while later reviewers have sometimes been kinder towards this. Roger Ebert said \"This is possibly the most indulgent film ever made\",[37] Time described Casino Royale as \"an incoherent and vulgar vaudeville\",[38] and Variety declared the film to be \"a conglomeration of frenzied situations, ‘in’ gags and special effects, lacking discipline and cohesion.\"[39] Bosley Crowther of The New York Times had some positive statements about the film, considering Casino Royale had \"more of the talent agent than the secret agent\" and praising the \"fast start\" and the scenes up to the baccarat game between Bond and Le Chiffre. Afterwards, Crowther felt, the script became tiresome, repetitive and filled with clichés due to \"wild and haphazard injections of 'in' jokes and outlandish gags\", leading to an excessive length that made the film a \"reckless, disconnected nonsense that could be telescoped or stopped at any point\".[40]Since its release the film has been widely criticised by a number of people. The film currently holds a 29% rating on Rotten Tomatoes based on 34 reviews with the consensus stating: \"A goofy, dated parody of spy movie cliches, Casino Royale squanders its all-star cast on a meandering, mostly laugh-free script.\"[41] For instance, Simon Winder called Casino Royale \"a pitiful spoof\",[42] while Robert Druce described it as \"an abstraction of real life\".[43] In his review of the film, Leonard Maltin remarked, \"Money, money everywhere, but [the] film is terribly uneven – sometimes funny, often not.\"[44]Some later reviewers have been more impressed by the film. Andrea LeVasseur, in the AllMovie review, called it \"the original ultimate spy spoof\", and opined that the \"nearly impossible to follow\" plot made it \"a satire to the highest degree\". Further describing it as a \"hideous, zany disaster\" LeVasseur concluded that it was \"a psychedelic, absurd masterpiece\".[45] Cinema historian Robert von Dassanowsky has written about the artistic merits of the film and says \"like Casablanca, Casino Royale is a film of momentary vision, collaboration, adaption, pastiche, and accident. It is the anti-auteur work of all time, a film shaped by the very zeitgeist it took on.\"[29] Romano Tozzi complimented the acting and humour, although he also mentioned that the film has several dull stretches.[46]Writing in 1986, Danny Peary noted, \"It's hard to believe that in 1967 we actually waited in anticipation for this so-called James Bond spoof. It was a disappointment then; it's a curio today, but just as hard to get through.\" Peary described the film as being \"disjointed and stylistically erratic\" and \"a testament to wastefulness in the bigger-is-better cinema,\" before adding, \"It would have been a good idea to cut the picture drastically, perhaps down to the scenes featuring Peter Sellers and Woody Allen. In fact, I recommend you see it on television when it's in a two-hour (including commercials) slot. Then you won't expect it to make any sense.\"[47]Columbia Pictures released Casino Royale on VHS in 1989,[48] and on Laserdisc in 1994.[49] In 1997, following the Columbia/MGM/Kevin McClory lawsuit on ownership of the Bond film series, the rights to the film reverted to Metro-Goldwyn-Mayer (whose sister company United Artists co-owns the Bond film franchise) as a condition of the settlement.[50] MGM then issued the first DVD release of Casino Royale in 2002,[51] followed by a 40th anniversary special edition in 2007.[52][53]Years later, as a result of the Sony/Comcast acquisition of MGM, Columbia would once again become responsible for the co-distribution of this film as well as the entire Eon Bond series, including the 2006 adaptation of Casino Royale. However, MGM Home Entertainment changed its distributor to 20th Century Fox Home Entertainment in May 2006. Fox has since been responsible for the debut of the 1967 Casino Royale on Blu-ray disc in 2011. Danjaq LLC, Eon's holding company, is shown as one of its present copyright owners.[53]Alongside six other MGM-owned films, the studio posted Casino Royale on YouTube.[54]","box_office":"$41.7 million","cinematography":"Jack Hildyard, BSC Nicolas Roeg, BSC John Wilcox, BSC","production_company":"Famous Artists Productions","directed_by":"Ken Hughes John Huston Joseph McGrath Robert Parrish Val Guest Richard Talmadge (uncredited)","Music":"For the music, Feldman decided to bring Burt Bacharach, who had done the score for his previous production What's New Pussycat?. Bacharach worked over two years writing for Casino Royale, in the meantime composing the After the Fox score and being forced to decline participation in Luv. Lyricist Hal David contributed with various songs, many of which appeared in just instrumental versions.[21] Herb Alpert & the Tijuana Brass performed some of the songs with Mike Redway singing the lyrics to the title song as the end credits rolled (a version of the song was also sung by Peter Sellers). The title theme was Alpert's second number one on the Easy Listening chart where it spent two weeks at the top in June 1967 and peaked at number 27 on the Billboard Hot 100.[22]The fourth chapter of the film features the song \"The Look of Love\" performed by Dusty Springfield. It is played in the scene of Vesper Lynd recruiting Evelyn Tremble, seen through a man-size aquarium in a seductive walk. \"The Look of Love\" was nominated for the Academy Award for Best Song. The song was a Top 10 radio hit at the KGB and KHJ radio stations. It was heard again in the first Austin Powers film, which was to a degree inspired by Casino Royale.[21] For the European release, Mireille Mathieu sang versions of \"The Look of Love\" in both French (\"Les Yeux D'Amour\"),[23] and German (\"Ein Blick von Dir\").[24]Bacharach would later rework two tracks of the score into songs: \"Home James, Don't Spare the Horses\" was re-arranged as \"Bond Street\", appearing on Bacharach's album Reach Out (1967), and \"Flying Saucer – First Stop Berlin\", was reworked with vocals as \"Let the Love Come Through\" by orchestra leader and arranger Roland Shaw. A clarinet melody would later be featured in a Cracker Jack commercial. As an in-joke, a brief snippet of John Barry's song \"Born Free\" is used in the film. At the time, Barry was the main composer for the Eon Bond series, and said song won an Academy Award over Bacharach's own \"Alfie\".[25]The original album cover art was done by Robert McGinnis, based on the film poster and the original stereo vinyl release of the soundtrack (Colgems #COSO-5005) is still highly sought after by audiophiles. It has been regarded by some music critics as the finest-sounding LP of all time.[26][27] The original LP was later issued by Varèse Sarabande in the same track order as shown below:Soundtrack listingThe film soundtrack has since been released by other companies in different configurations (including complete score releases).","References":"Explanatory notesCitationsBibliography","release_dates":"13 April 1967 (1967-04-13) (London)|||||","Production":"In March 1955 Ian Fleming sold the film rights of his novel Casino Royale, the first book featuring the character of James Bond, to the producer Gregory Ratoff for $6,000[5] ($53,001 in 2016 dollars).[6] In 1956 Ratoff set up a production company with Michael Garrison to produce a film adaptation, but wound up not finding financial backers before his death in December 1960.[7] After Ratoff's death, the producer Charles K. Feldman represented Ratoff's widow and obtained the Casino Royale rights.[8] Albert R. Broccoli, who had a long time interest in adapting James Bond, offered to purchase the Casino Royale rights from Feldman, but he declined.[9] Feldman and his friend, the director Howard Hawks, had an interest in adapting Casino Royale, considering Leigh Brackett as a writer and Cary Grant as James Bond. They eventually gave up once they saw the 1962 film Dr. No, the first Bond adaptation made by Broccoli and his partner Harry Saltzman through their company Eon Productions.[10]By 1964, with Feldman having invested nearly $550,000 of his own money into pre-production of Casino Royale, he decided to try a deal with Eon Productions and its distributor United Artists. The attempt at a co-production eventually fell through as Feldman frequently argued with Broccoli and Saltzman, specially regarding the profit divisions and when the Casino Royale adaptation would start production. Feldman approached Sean Connery to play Bond, with Connery's offering to do the film for one million dollars being rejected.[11] Feldman eventually decided to offer his project to Columbia Pictures through a script written by Ben Hecht, and the studio accepted. Given Eon's series led to a spy film craze at the time, Feldman opted to make his film a spoof of the Bond series instead of a straightforward adaptation.[12]Ben Hecht's contribution to the project, if not the final result, was in fact substantial. The Oscar-winning writer was recruited by Feldman to produce a screenplay for the film and wrote several drafts, with various evolutions of the story incorporating different scenes and characters. All of his treatments were \"straight\" adaptations, far closer to the original source novel than the spoof which the final production became. A draft from 1957 discovered in Hecht's papers – but which does not identify the screenwriter – is a direct adaptation of the novel, albeit with the Bond character absent, instead being replaced by a poker-playing American gangster.[7]Later drafts see vice made central to the plot, with the Le Chiffre character becoming head of a network of brothels (as he is in the novel) whose patrons are then blackmailed by Le Chiffre to fund Spectre (an invention of the screenwriter). The racy plot elements opened up by this change of background include a chase scene through Hamburg's red light district that results in Bond escaping whilst disguised as a female mud wrestler. New characters appear such as Lili Wing, a brothel madam and former lover of Bond whose ultimate fate is to be crushed in the back of a garbage truck, and Gita, wife of Le Chiffre. The beautiful Gita, whose face and throat are hideously disfigured as a result of Bond using her as a shield during a gunfight in the same sequence which sees Wing meet her fate, goes on to become the prime protagonist in the torture scene that features in the book, a role originally Le Chiffre's.[7]Virtually nothing from Hecht's scripts were ever filmed. He died from a heart attack in April 1964, two days before he was due to present it to Feldman. Time reported in 1966 that the script had been completely re-written by Billy Wilder, and by the time the film reached production only the idea that the name James Bond should be given to a number of other agents remained. This key plot device in the finished film, in the case of Hecht's version, occurs after the demise of the original James Bond (an event which happened prior to the beginning of his story) which, as Hecht's M puts it \"not only perpetuates his memory, but confuses the opposition.\"[7]Peter Sellers hired Terry Southern to write his dialogue (and not the rest of the script) to \"outshine\" Orson Welles and Woody Allen.[13]The principal filming was carried out at Pinewood Studios, Shepperton Studios and Twickenham Studios in London. Extensive sequences also featured London, notably Trafalgar Square and the exterior of 10 Downing Street. Mereworth Castle in Kent was used as the home of Sir James Bond, which is blown up at the start of the film.[14] Much of the filming for M's Scottish castle was actually done on location in County Meath, Ireland, with Killeen Castle, Dunsany, as the focus.[15] However, the car chase sequences where Bond leaves the castle were shot in the Perthshire village of Killin.[16]The production proved to be rather troubled, with five different directors helming different segments of the film and with stunt co-ordinator Richard Talmadge co-directing the final sequence. In addition to the credited writers, Woody Allen, Peter Sellers, Val Guest, Ben Hecht, Joseph Heller, Terry Southern, and Billy Wilder are all believed to have contributed to the screenplay to varying degrees. Val Guest was given the responsibility of splicing the various \"chapters\" together, and was offered the unique title of \"Co-ordinating Director\" but declined, claiming the chaotic plot would not reflect well on him if he were so credited. His extra credit was labelled \"Additional Sequences\" instead.[1]Part of the behind-the-scenes drama of this film's production concerned the filming of the segments involving Peter Sellers. Screenwriter Wolf Mankowitz declared that Sellers felt intimidated by Orson Welles to the extent that, except for a couple of shots, neither was in the studio simultaneously. Other versions of the legend depict the drama stemming from Sellers being slighted, in favour of Welles, by Princess Margaret (whom Sellers knew) during her visit to the set. Welles also insisted on performing magic tricks as Le Chiffre, and the director obliged. Director Val Guest wrote that Welles did not think much of Sellers, and had refused to work with \"that amateur\". Director Joseph McGrath, a personal friend of Sellers, was punched by the actor when he complained about Sellers' behavior on the set.[17]Some biographies of Sellers suggest that he took the role of Bond to heart, and was annoyed at the decision to make Casino Royale a comedy, as he wanted to play Bond straight. This is illustrated in somewhat fictionalised form in the film The Life and Death of Peter Sellers, based on the biography by Roger Lewis, who has claimed that Sellers kept re-writing and improvising scenes to make them play seriously. This story is in agreement with the observation that the only parts of the film close to the book are the ones featuring Sellers and Welles.[18] In the end, Sellers' involvement with the film was cut abruptly short.[citation needed]Jean-Paul Belmondo and George Raft received major billing, even though both actors appear only briefly. Both appear during the climactic brawl at the end, Raft flipping his trademark coin and promptly shooting himself dead with a backwards-firing pistol, while Belmondo appears wearing a fake moustache as the French Foreign Legion officer who requires an English phrase book to translate \"merde!\" into \"ooch!\" during his fistfight.[3] Raft's coin flip, which originally appeared in Scarface (1932), had been spoofed a few years earlier in Some Like It Hot (1959).[19]At the Intercon science fiction convention held in Slough in 1978, David Prowse commented on his part in this film, apparently his big-screen debut. He claimed that he was originally asked to play \"Super Pooh\", a giant Winnie-the-Pooh in a superhero costume who attacks Tremble during the Torture of The Mind sequence. This idea, as with many others in the film's script, was rapidly dropped, and Prowse was re-cast as a Frankenstein-type Monster for the closing scenes. The final sequence was principally directed by former actor and stuntman Richard Talmadge.[12]Director credits:[20]Sellers left the production before all his scenes were shot, which is why his character, Tremble, is so abruptly captured in the film. Whether Sellers was fired or simply walked off is unclear. Given that he often went absent for days at a time and was involved in conflicts with Welles, either explanation is plausible.[18] Regardless, Sellers was unavailable for the filming of an ending and of linking footage to explain the details, leaving the filmmakers to devise a way to make the existing footage work without him. The framing device of a beginning and ending with David Niven was invented to salvage the footage.[12] Val Guest said that he was given the task of creating a narrative thread which would link all segments of the film. He chose to use the original Bond and Vesper as linking characters to tie the story together. In the originally released versions of the film, a cardboard cutout of Sellers in the background was used for the final scenes. In later versions, this cardboard cutout was replaced by footage of Sellers in highland dress, inserted by \"trick photography\".[citation needed]Signs of missing footage from the Sellers segments are evident at various points. Evelyn Tremble is not captured on camera; an outtake of Sellers entering a racing car was substituted. In this outtake, he calls for the car, à la Pink Panther, to chase down Vesper and her kidnappers; the next thing that is shown is Tremble being tortured. Out-takes of Sellers were also used for Tremble's dream sequence (pretending to play the piano on Ursula Andress' torso), in the finale - blowing out the candles whilst in highland dress - and at the end of the film when all the various \"James Bond doubles\" are together. In the kidnap sequence, Tremble's death is also very abruptly inserted; it consists of pre-existing footage of Tremble being rescued by Vesper, followed by a later-filmed shot of her abruptly deciding to shoot him, followed by a freeze-frame over some of the previous footage of her surrounded by bodies (noticeably a zoom-in on the previous shot).[12]As well as this, an entire sequence involving Tremble going to the front for the underground James Bond training school (which turns out to be under Harrods, of which the training area was the lowest level) was never shot, thus creating an abrupt cut from Vesper announcing that Tremble will be James Bond to Tremble exiting the lift into the training school.[citation needed]So many sequences from the film were removed, that several well-known actors never appeared in the final cut, including Ian Hendry (as 006, the agent whose body is briefly seen being disposed of by Vesper), Mona Washbourne and Arthur Mullard.[12]","produced_by":"Charles K. Feldman Jerry Bresler","starring":"Peter Sellers Ursula Andress David Niven Woody Allen Joanna Pettet Orson Welles Daliah Lavi","running_time":"131 minutes","Budget":"The studio approved the film's production budget of $6 million, already quite large in 1966. However, during filming the project ran into several problems and the shoot ran months over schedule, with the costs also running well over. When the film was finally completed it had doubled its original budget. The final production budget of $12 million made it one of the most expensive films that had been made to that point. The previous Eon Bond film, Thunderball (1965), had a budget of $11 million while the nearly contemporary You Only Live Twice (1967), had a budget of $9.5 million.[28] The extremely high budget of Casino Royale led to comparisons with a troubled production from 1963, and it was referred to as \"a runaway mini-Cleopatra\".[29] Columbia at first announced the film was due to be released in time for Christmas 1966. The problems postponed the launch until April 1967.[12]","music_by":"Burt Bacharach","edited_by":"Bill Lenny","budget":"$12 million"}