{"country":"United Kingdom","distributed_by":"Atlantic Entertainment Group[1]","Plot":"In the summer of 1902 Frank Ashton, an educated young man from London, is on a walking holiday in Devon with a friend. When he falls and twists his ankle, Ashton is helped at a nearby farmhouse and stays there for a few days to recover, while his friend goes on. Ashton quickly falls for the village girl who looks after him, Megan David, and she falls in love with him, to the great distress of her cousin Joe Narracombe, who wants her for himself. Ashton and Megan spend a night together, and after that he takes the train to a seaside town to cash a cheque at a bank, promising to return the next morning and take Megan away with him and marry her.On arrival in the town, Ashton finds a branch of his bank, but it will not cash his cheque, insisting on first contacting his branch in London. While he is delayed, Ashton meets an old school friend, staying at a local hotel with his three sisters, of whom the oldest is Stella Halliday. Thanks to the bank's delays, he misses the train he needed to catch to make his rendezvous with Megan. During the day that follows, he spends more time with his friend and his sisters, and while Stella flirts with him he begins to have second thoughts about marrying Megan.Megan then travels to the seaside town looking for Ashton, carrying her luggage for running away. He sees her on the beach and follows her into the town, but when she turns and catches a glimpse of him, he hides.Twenty years later, Ashton is married to Stella and they are motoring through Devon. They have no children. Ashton visits the farm where he seduced Megan and is recognized. He learns that Megan was heart-broken about losing him and also that she died soon after giving birth to a son, who she named \"Francis\", or Frank. He is taken to see Megan's grave, which is at the spot where he had arranged to meet her. She had asked to be buried there, to wait for his return. In motoring away with Stella, Ashton passes his son, young Frank, who gives him a friendly wave.","language":"English","cinematography":"Kenneth MacMillan","production_company":"ITC Entertainment[1]","directed_by":"Piers Haggard","release_dates":"11 August 1988 (1988-08-11) (New York City New York)|||||","produced_by":"Danton Rissner","starring":"James Wilby Imogen Stubbs Susannah York Kenneth Colley","running_time":"95 minutes","music_by":"Georges Delerue","edited_by":"Ralph Sheldon","written_by":"John Galsworthy Penelope Mortimer"}