{"distributed_by":"United Artists","DVD release":"Dance with Me, Henry was released on DVD in June 2005 by MGM Entertainment. It was paired in its release with another independently produced Abbott and Costello film, The Noose Hangs High (1948).[7]","Plot":"Lou Henry (Lou Costello) is the owner of Kiddyland, an amusement park, and Bud Flick (Bud Abbott) is his friend and partner. Together they share a home with two orphan children, Duffer (Rusty Hamer) and Shelly (Gigi Perreau). Welfare worker Miss Mayberry (Mary Wickes) does not think that their home is a suitable environment for the children and attempts to remove them. One of the reasons is that Bud is a gambler and owes $10,000 to Big Frank (Ted de Corsia), who offers to forget the debt if Bud agrees to help launder $200,000 that Big Frank took from a Chicago bank. Bud agrees to meet Big Frank's man, Mushie (Richard Reeves), at Kiddyland to pick up the money and a plane ticket. Lou, however, informs District Attorney Proctor (Robert Shayne) of the plan and he shows up at Kiddyland during Bud and Mushie's meeting. Mushie sees the DA and hides the money just before he murders Proctor and frames Lou for it. Miss Mayberry uses Lou's arrest as a reason to take the children from his home.Bud informs Mushie that he knows that he really killed Proctor, and Mushie threatens to kill him. However, Big Frank and Dutch (Paul Sorensen) kill Mushie. They kidnap Bud and demand that he tell them where the money is hidden. Meanwhile, Lou is released by the police, who believe that he will lead them to Bud. Dutch then kidnaps Lou and takes him to their hideout, where Bud is also being held. Bud lies and tells Big Frank that he knows where the money is and they all head to Kiddyland, with the police following them every step of the way. Bud then tricks Big Frank into confessing to everything while they are inside the park's recording booth, then Lou grabs the recording and escapes into the park. Shelly and Duffer have also escaped from Miss Mayberry and are now inside the park playing when they see Lou being chased. They return to the orphanage to get help from the other children, and they all head back to Kiddyland. The children then wreak havoc in the park, foiling the gangsters at every turn. The police capture them, and the reward money that Bud and Lou receive is donated to the orphanage. Miss Mayberry, seeing what a good role model Lou really is, returns custody of the orphans to him.[2]","language":"English","dance_with_me,_henry":"Theatrical release poster","directed_by":"Charles Barton","release_dates":"December 14, 1956 (1956-12-14) (U.S.)|||||","Production":"Dance with Me, Henry was filmed from May 23 through June 22, 1956. It was their 36th feature film and their first after being dropped by Universal Pictures in 1955 following the completion of Abbott and Costello Meet the Mummy. Independent film producer Bob Goldstein hired the duo for this film, which was released through United Artists. It turned out to be the last film that Abbott and Costello made together as a team, as they ended their partnership in July 1957.[3]The film's title was taken from the 1955 song \"The Wallflower (Dance with Me, Henry)\", although the film's plot has nothing to do with the song.[2]During filming, Abbott and Costello's routine Who's On First? was inducted into the National Baseball Hall of Fame in Cooperstown, NY, where a clip still runs continuously.[4]A bit part in the film went to the \"just released from contract\" Mouseketeer Sherry Allen, who was advised by Lou Costello to return to the use (professionally) of her true surname, \"Alberoni\". She took his advice, and has been known professionally since that time by her birth name Sherry Alberoni.","produced_by":"Bob Goldstein","starring":"Bud Abbott Lou Costello Gigi Perreau Rusty Hamer Mary Wickes","running_time":"80 min.","music_by":"Paul Dunlap","edited_by":"Robert Golden","Release":"Dance With Me, Henry received mixed reviews when it was theatrically released in December 1956. A.H. Weiler, reviewing the film for The New York Times, complained \"it is perfectly clear that any attempt to lend dramatic dimension to the simple and egregious fantasy expected of an Abbott and Costello venture can be fraught with the makings of a loud backfire.\"[5] The New York Herald Tribune was more conciliatory, noting \"this time, the team is more sedate\" while praising Costello for eschewing slapstick comedy and \"developing along the lines of a Chaplinesque character.\"[2]During their appearance on Ralph Edwards' This Is Your Life on NBC, they mentioned the release of this film.[6]","written_by":"Devery Freeman","budget":"$450,000[1]"}