{"country":"Mexico United States","distributed_by":"Pantelion Films Participant Media","Plot":"The film follows Chávez's efforts to organize 50,000 farm workers in California, some of whom were braceros—temporary workers from Mexico permitted to live and work in the United States in agriculture, and required to return to Mexico if they stopped working. Working conditions are very poor for the braceros, who also suffer from racism and brutality at the hands of the employers and local Californians. To help the workers, César Chávez (Michael Peña) forms a labor union known as the United Farm Workers (UFW). Chávez's efforts opposed, sometimes violently, by the owners of the large industrial farms where the braceros work. The film touches on several major nonviolent campaigns by the UFW: the Delano grape strike, the Salad Bowl strike, and the 1975 Modesto march.","language":"English Spanish","Reception":"Cesar Chavez received a mixed reception from critics upon its release. It currently holds a 41% rating on Rotten Tomatoes based on 69 reviews, with an average rating of 5.6/10. The consensus states: \"Too in awe of its subject's great works to present him as a human being, Cesar Chávez settles for trite hagiography.\"[8] On Metacritic, the film has a score of 51 out of 100, based on 26 critics, indicating \"mixed or average reviews\" from critics.[9] One negative view, from historian Matt Garcia, expressed that the film concentrates too much on hero-making and avoids criticism and complexity, but offers that this is a limitation of the biopic genre.[10] However, critic Owen Gleiberman, in his positive review of the film, stated that it \"couldn't be more timely.\"[11]","box_office":"$6.7 million[2]","cinematography":"Enrique Chediak","production_company":"Canana Films","directed_by":"Diego Luna","release_dates":"February 12, 2014 (2014-02-12) (Berlin)|March 28, 2014 (2014-03-28) (United States)[1]||||","Production":"Although numerous books, magazine articles, and scholarly studies have been written about César Chávez, Chávez is the first feature film about the labor leader.[5] Keir Pearson, who wrote the Academy Award-nominated screenplay for the 2004 film Hotel Rwanda, wrote Chávez.[6] Many writers and producers had tried for years to obtain the rights to Chávez's life story, but failed.[5][7] Pearson negotiated for two years with Chavez's heirs before he and production partner, television producer Larry Meli, were able to secure the rights to Chávez's life in 2011. Pearson says his script focuses on the positive aspects of Chávez's personality, family life, and public accomplishments, but it is not a whitewash. Pearson and the producers reviewed the script with the Chávez family. Many of the comments made by the family, as well as anecdotes told by them, made it into the script. Pearson also relied heavily on archival material held by the César Chávez Foundation. The script focuses primarily on the grape boycotts and strikes of the 1960s and early 1970s.[5]The producers of Chávez include Diego Luna, Gael Garcia Bernal, and Pablo Cruz (all principals of Canana Films); John Malkovich, Lianne Halfon, and Russell Smith (principals in Malkovich's production company, Mr. Mudd); writer Keir Pearson; and TV producer Larry Meli.[4] In June 2012, production company Participant Media purchased the North American distribution rights to the film, and Participant Media's Jeff Skoll and Jonathan King were added as executive producers.[4]Chávez is directed by Diego Luna. The film is only Luna's second motion picture, and is his first film whose primary language is English. Luna said that directing in both English (for the main actors) and Spanish (for the extras) was a struggle.[5]Chicago-born Michael Peña stars as César Chávez, the Mexican American labor leader born in Yuma, Arizona, in 1927. Peña says he knew almost nothing about César Chávez prior to taking the role. His father, a Mexican farmer who emigrated to the United States, almost wept when Peña told him that he was going to play César Chávez. Peña says he extensively studied historical records to gain a better understanding Chávez. Because Peña keeps his hair very short, he had to wear a wig during the production.[5]America Ferrera was cast as Helen, the wife of César Chávez who played a quiet, behind-the scenes role in Chávez's work. In contrast to Michael Peña, Ferrera (who was born in Los Angeles, California, to parents who had emigrated from Honduras) said she had learned a great deal about who César Chávez was while growing up and in school. Ferrera said she met several times with Helen Chávez to learn more about her role in the farmworker movement. Ferrera says that she learned that Helen Chávez pushed her husband hard to keep the farmworker movement alive, all while raising eight children. Ferrera called the role daunting.[5]Rosario Dawson was cast as Dolores Huerta, the Dawson, New Mexico-born daughter of a union activist and New Mexico state assemblyman who co-founded the United Farm Workers with Chávez.[5] Dawson admitted that she did not know much about Dolores Huerta when she took the role. But, she says, she spoke with Huerta and research the role, and the more she learned the more impressed she was. She also admitted to being \"a little frightened about making sure that I get it right.\"[7] Huerta has expressed her happiness that Dawson took the role.[7]John Malkovich became involved with Chávez through his role as producer. Diego Luna convinced him to take the role of an abusive grape-grower. Malkovich agreed to the role because he admired Luna's previous film, and wished to take part in telling an important story about fairness. Actor Gabriel Mann plays another abusive agricultural producer. Mann says he took the role because he felt it was a timely story that spoke to what happens when workers lack union protections.[5]Most of Chávez was shot in Mexico. In part, Mexico offered much lower production costs, and was where most of the producers lived and worked. But many rural and urban parts of Mexico still look as California did in the 1960s, which proved critical in obtaining a sense of visual realism for the film. A portion of the picture was filmed in Hermosillo. The city, which is ethnically diverse, was able to provide a large number of Anglo-looking actors to portray non-Hispanic Americans. Workers in Hermosillo's numerous Chinese restaurants were recruited to portray the Filipino agricultural workers whom Chávez also sought to organize. The city's Art Deco public library served as the headquarters of one of the large agricultural companies Chávez dealt with, and a 40 acres (160,000 m2) field outside Hermosillo served as a farm near Delano, California. Scenes in grape fields were filmed in vineyards in the Mexican state of Sonora, where grape-growers still drape grape vines over wooden crosses as Californians did in the 1960s. The production built shacks in the Sonoran grape fields to replicate the housing of migrant workers in California in the 1960s. The shooting in the Sonoran grape fields was difficult. The production was afflicted with dust storms and a tremendous number of insects. It was also terribly hot, and several actors collapsed on the set from dehydration.[5]Historic accuracy was important to the filmmakers. In addition to choosing locations which looked like California in the 1960s, actors were taught to speak in a Chicano dialect typical of the late 1960s and early 1970s. Dialect coach Claudia Vazquez says that dialect is very different from the Spanish and Spanish-inflected English spoken by many Mexican Americans in California today.[5]The film has a production budget of $10 million, nearly all of which came from Mexican investors.[5]","produced_by":"Emilio Azcárraga Jean Lianne Halfon John Malkovich Gael Garcia Bernal Russell Smith Diego Luna Larry Meli Keir Pearson Pablo Cruz","starring":"Michael Peña America Ferrera Rosario Dawson John Malkovich","running_time":"102 minutes","césar_chávez":"Film poster","music_by":"Michael Brook","edited_by":"Douglas Crise Miguel Schverdfinger","written_by":"Keir Pearson","budget":"$10 million"}