{"country":"United Kingdom","distributed_by":"Thorn EMI (UK) Universal Pictures (USA)","screenplay_by":"Bill Forsyth","Plot":"A few days before Christmas, Glasgow radio disc jockey Allan \"Dicky\" Bird is stunned when Maddy (Eleanor David), his kleptomaniac girlfriend of four years, suddenly announces that she is moving out. His doctor friend Colin (Patrick Malahide) tries to console him, but Bird is heartbroken.One day, he goes for a drive to take his mind off his troubles. Noticing an attractive girl, Charlotte (Clare Grogan), in the back of a \"Mr. Bunny\" ice cream van, he follows it under a railway bridge on a whim and when the van stops, purchases an ice cream cone. (As in Alice in Wonderland, the protagonist has followed a rabbit through a tunnel, with sometimes bizarre consequences.) To his amazement, three men drive up and proceed to smash up the van with baseball bats. The occupants retaliate with squirts of raspberry sauce. By sheer chance, Bird finds himself involved in a turf war between rival Italian ice cream vendors: the young interloper Trevor (Alex Norton) and the older, more established \"Mr. McCool\" (Roberto Bernardi).As an admired local celebrity, Bird meets with McCool and his sons Bruno, Paolo, and Renato. He then goes back and forth between them and Trevor and Charlotte (later revealed to be McCool's rebellious daughter), trying to negotiate a peaceful settlement. Various misadventures follow, with his red BMW 323i Baur convertible suffering more and more damage each time. Bird becomes obsessed with resolving the war. To contact the combatants, he starts broadcasting coded messages on his early morning show, causing Hilary (Rikki Fulton), his boss, to ask his secretary if Mr. Bird's contract includes a \"sanity clause\". Hilary then orders Bird to see a psychiatrist about the Mr. Bunny he keeps trying to reach.In the end, Bird proposes that the rival entrepreneurs, who turn out to be uncle and nephew, join forces to market a new treat: ice cream fritters. Both sides are impressed by the product's potential. It appeals both to Trevor's fish and chips frying background as well as Mr. McCool's ice cream expertise. Since Bird alone knows the secret ingredient of the ancient Chinese recipe, he cuts himself in for 30% of the gross as well as repairs to his abused car.During the credits, he is heard trying to record a commercial for the new product: \"Frosty Hots\".","language":"English","Reception":"In his review in the New York Times, Vincent Canby wrote, \"Comfort and Joy is a charming film on its own, but something of a disappointment when compared to Gregory's Girl and Local Hero, in which the inventions were more consistently comic and crazy.\"[3] The staff at Film4 agreed, calling it \"... somehow not as satisfying as his [Forsyth's] early films.\"[4] The reviewer went on to observe that, \"Paterson is always worth seeing, while Grogan and David are equally watchable, but there aren't the belly laughs That Sinking Feeling provides so readily, or the casual charm of Gregory's Girl.\" The Variety magazine staff review was also lukewarm, concluding that after \"... evincing much laughter over an unexpectedly funny couple living together, Forsyth abruptly switches into a more conventional plot\" and that \"David and Paterson are terrific together and almost every line between them is a joy. From the point she departs with no explanation the pic flashes a sparky moment or two, but it doesn't reach the high spots again.\"[5]On the other hand, Roger Ebert called Comfort and Joy \"... one of the happiest and most engaging movies you are likely to see this year, and it comes from a Glasgow director who has made a specialty out of characters who are as real as you and me, and nicer than me.\"[6]Rotten Tomatoes gives the film a rating of 100% based on ten reviews.[7]","cinematography":"Chris Menges","production_company":"Thorn EMI Lake Ltd. Scottish Television Kings Road Entertainment","directed_by":"Bill Forsyth","Soundtrack":"As with Forsyth's previous film Local Hero, Mark Knopfler provided the film's score. Some musical passages were taken from the 1982 Dire Straits album Love Over Gold.","release_dates":"10 October 1984 (1984-10-10) (United States)|||||","starring":"Bill Paterson Eleanor David Clare Grogan Alex Norton","running_time":"106 minutes","comfort_and_joy":"Theatrical release poster","music_by":"Mark Knopfler","edited_by":"Michael Ellis"}