{"mandarin":"Ā Fēi Zhèng Zhuàn","country":"Hong Kong","distributed_by":"In-Gear Films","language":"Cantonese Shanghainese Mandarin Filipino English","cantonese":"Aa3 Fei1 zing3zyun6","box_office":"US$146,310 (Worldwide)[1]","cinematography":"Christopher Doyle","directed_by":"Wong Kar-wai","days_of_being_wild":"Film poster for Days of Being Wild","traditional":"阿飛正傳","simplified":"阿飞正传","Plot details":"The movie is set in Hong Kong and the Philippines in 1960. Yuddy[citation needed], or 'York' in English (Leslie Cheung), is a playboy in Hong Kong and is well known for stealing girls' hearts and breaking them. His first lover in the film is Li-zhen (Maggie Cheung), who suffers emotional and mental depression as a result of Yuddy's[citation needed] wayward attitude. Li-zhen eventually seeks much-needed solace from a sympathetic policeman named Tide (Andy Lau). Their near-romance is often hinted at but never materializes.York's next romance is with a vivacious cabaret dancer whose stage name is Mimi (Carina Lau). Mimi is also loved by York's best friend, Zeb (Jacky Cheung). Unsurprisingly, York dumps her too and she begins a period of self-destruction. York initiates romantic relationships but refuses to commit to the relationship and is unwilling to make compromises. He is conflicted about his feelings about his adoptive mother, a former prostitute played by Rebecca Pan, and is obsessed about his biological mother, who he eventually discovers is a Filipino aristocrat.","Analysis":"Almost entirely ignored on its original release, the film has gathered strong critical interest over time, and has a Metacritic score of 96%.[4] Critics praise the film for its beauty and eroticism, though some do not discern a narrative arc that brings the pieces together.","release_dates":"15 December 1990 (1990-12-15)|||||","Box office":"Days of Being Wild grossed HK $9,751,942 in its Hong Kong run,[5] a number that would become typical for a Wong Kar Wai film. With the starry cast, this figure was considered a disappointment. Still, the film was successful enough to warrant a parody (The Days of Being Dumb, which also featured Tony Leung), and now routinely tops Hong Kong critics' lists of the best local productions.","produced_by":"Alan Tang","starring":"Leslie Cheung Andy Lau Maggie Cheung Carina Lau Jacky Cheung","running_time":"94 minutes","music_by":"Terry Chan Leuribna-Lombardo Oflyne","edited_by":"Kai Kit-wai Patrick Tam","written_by":"Wong Kar-wai"}