{"based_on":"The 25th Hour  by David Benioff","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"David Benioff","Writing and production":"Benioff completed the book The 25th Hour while studying at the University of California Irvine,[2][3] which was published in 2001. Six months before the book's publication, a preliminary trade copy was circulated, which Tobey Maguire read and he was interested in playing the role of Monty Brogan. He acquired the option for a potential film project and asked Benioff to adapt it into a screenplay.[4][3] However, after the script was written, Maguire became pre-occupied with the Spider-Man film and had to abandon the plan, although he would later act as a producer on the film that was made. Spike Lee then expressed an interest in directing the film.[3][5] A long monologue that Benioff called the \"fuck monologue\" whereby Monty ranted against the five boroughs of New York and all their major ethnic groups was initially cut, but Spike Lee wanted it re-instated. Disney picked up the film rights but also wanted the monologue cut, but Lee filmed the scene nonetheless.[3]The film was in the \"planning stages\" at the time of the September 11 attacks, and so Lee \"decided not to ignore the tragedy but to integrate it into his story\".[6]","Plot":"A canary yellow vintage Super Bee pulls up short on a New York City street, and Montgomery \"Monty\" Brogan gets out with his buddy Kostya to look at a dog lying in the road. The animal was mauled in a dogfight so Monty intends to shoot him, but changes his mind after he looks it in the eye. Monty decides to take the dog to a nearby clinic instead.Fast forward to late 2002. Monty is about to begin serving a seven-year prison sentence for dealing drugs. He sits in a park with Doyle, the dog he rescued, on his last day of freedom. He plans to meet childhood friends Frank Slaughtery and Jacob Elinsky at a club with his girlfriend Naturelle. Frank is a hotshot trader on Wall Street; Jacob is an introverted high school teacher with a crush on 17-year-old Mary, one of his students.Monty visits his father, James, a former firefighter and recovering alcoholic who owns a bar, to confirm their plans to drive to the prison the following morning. Monty's drug money helped James keep the bar, so a remorseful James sneaks a drink when Monty goes to the bathroom. Facing himself in the mirror, Monty lashes out in his mind against everyone else: all the New York stereotypes he can think of, from the cabbies to the firefighters, the corner grocers to the mobsters, as if he hates them all. Finally, he turns on himself, revealing that he is actually angry for getting greedy and having not given up drug dealing before he was caught.In a flashback, Monty remembers the night he was arrested. Detectives come to Monty's apartment while he's still there. They find the drugs immediately and not after any real search, suggesting that Monty had been betrayed. Monty sold drugs for Uncle Nikolai, a Russian mobster. Kostya tries to persuade Monty it was Naturelle who turned him in, since she knew where he hid his drugs and money. Monty refused to turn state's evidence against Nikolai, but he's not sure what Nikolai will do at the club that night. Monty remembers how he met Naturelle when she was 18, hanging around his old school, and how happy they were. He asks Frank to find out if it was Naturelle who betrayed him.Jacob sees Mary outside the club, so Monty invites her inside with them. Discussing what kind of a future Monty can have after prison, Frank says they can open a bar together, even though he told Jacob he believes Monty's life is over, and that Monty deserves his sentence for dealing drugs. Frank accuses Naturelle of living high on Monty's money, not caring where it came from, but she reminds Frank that he knew as well and said nothing. The argument culminates in Frank's insulting Naturelle's ethnicity, followed by her slapping Frank and leaving. Jacob, meanwhile, finds the courage to kiss Mary, but both appear to be in shock afterwards and go their separate ways.Monty and Kostya go see Uncle Nikolai, who gives Monty advice on surviving in prison. Nikolai then reveals it was Kostya, not Naturelle, who betrayed Monty, and offers him a chance to kill Kostya in exchange for protecting his father's bar. Monty refuses, reminding Nikolai that he had asked Monty to trust Kostya in the first place. Monty walks out, leaving Kostya to be killed by the Russian mobsters.Monty returns to his apartment and apologizes to Naturelle for mistrusting her. At the park, he transfers custody of Doyle to Jacob. Then he admits that he is terrified of being raped in prison, whereupon he asks Frank to brutally beat him, saying if he goes in ugly he might have a chance at survival. Frank refuses, so Monty deliberately provokes him. Frank is goaded into taking out his frustration, leaving Monty bruised and bloody, with a broken nose. Frank is in tears as Monty gets up and goes home.Naturelle tries to comfort him as Monty's father arrives to take him to Otisville. On the drive to prison, James suggests they go west, into hiding, giving Monty one last vision of freedom. Once again Monty sees a parade of faces from the streets of the city, followed by a vision of a future where Monty avoids imprisonment, reunites with Naturelle, starts a family, and grows old. As the fantasy ends, we see Monty, his eyes closed and face still bruised, sitting in the passenger's seat of the car, which has driven past the bridge to the west and towards prison.","language":"English","Reception":"25th Hour received a 78% rating on Rotten Tomatoes, based on 161 reviews.[7] The film also holds a 67/100 score on Metacritic.[8]Five years after 9/11, Mick LaSalle of the San Francisco Chronicle wrote: \"Released 15 months after Sept. 11, 2001, Spike Lee's 25th Hour is the only great film dealing with the Sept. 11 tragedy... 25th Hour is as much an urban historical document as Rossellini's Open City, filmed in the immediate aftermath of the Nazi occupation of Rome\".[6]Film critic Roger Ebert added this film to his \"Great Movies\" list on December 16, 2009.[9] A. O. Scott,[10] Richard Roeper[11] and Roger Ebert all put it on their \"best films of the decade list\".[12]","box_office":"$23.9 million[1]","cinematography":"Rodrigo Prieto","directed_by":"Spike Lee","production_companies":"Touchstone Pictures 40 Acres and a Mule Filmworks Industry Entertainment Gamut Films","Music":"Terence Blanchard composed the film's musical score. Other songs that appear in the film (and are not included in the original score) include:[citation needed]","release_dates":"December 19, 2002 (2002-12-19)|||||","produced_by":"Tobey Maguire|Julia Chasman|Spike Lee|Jon Kilik|","starring":"Edward Norton|Philip Seymour Hoffman|Barry Pepper|Rosario Dawson|Anna Paquin|Brian Cox|","running_time":"135 minutes","music_by":"Terence Blanchard","25th_hour":"Theatrical release poster","edited_by":"Barry Alexander Brown","budget":"$5 million[1]"}