{"Cast":"(directed by Basil Dearden)(directed by Basil Dearden; based on \"The Bus-Conductor\", a short story by E. F. Benson published in The Pall Mall Magazine in 1906)(directed by Alberto Cavalcanti; story by Angus MacPhail)(directed by Robert Hamer; story by John Baines)(directed by Charles Crichton; based on a story by H.G. Wells)(directed by Alberto Cavalcanti; story by John Baines)","country":"United Kingdom","distributed_by":"Eagle-Lion Distributors Limited (UK) Universal Pictures (US)","Legacy":"The circular plot of Dead of Night inspired Fred Hoyle's Steady State model of the universe, developed in 1948.[2]Dead of Night currently holds a 96% \"fresh\" rating on Rotten Tomatoes.In the early 2010s, Time Out conducted a poll with several authors, directors, actors and critics who have worked within the horror genre to vote for their top horror films.[3] Dead of Night placed at number 35 on their top 100 list.[4] Director Martin Scorsese placed Dead of Night on his list of the 11 scariest horror films of all time.[5] Writer/Director Christopher Smith was inspired by the circular narrative in Dead of Night when making his 2009 film Triangle.[6]","Plot":"Architect Walter Craig (Mervyn Johns) has been invited by Elliot Foley (Ronald Culver) to his country home to consult on some renovations. Upon arrival at the cottage, he reveals to Foley and his assembled guests that despite never having met any of them, he has seen them all in a recurring dream. He appears to have no prior personal knowledge of them but he is able to predict spontaneous events in the house before they unfold. Craig partially recalls with some dismay that something awful will later occur, and becomes increasingly disturbed. The other guests attempt to test Craig's foresight and set him at ease, while entertaining each other with various tales of uncanny or supernatural events that they experienced or were told about. These include a racing car driver's premonition of a fatal bus crash; a ghostly encounter during a children's Christmas party (another tale cut from the initial USA release); a haunted antique mirror; a light-hearted tale of two obsessed golfers, one of whom becomes haunted by the other's ghost (cut from the initial USA release); and the story of an unbalanced ventriloquist (Michael Redgrave) who believes his amoral dummy is truly alive. The framing story is then capped by a twist ending in which Craig murders one of the guests, then escapes into a feverish montage of scenes and characters from the house guests' tales. At the climax, the dummy Hugo is strangling him when Craig suddenly wakes up at home from the nightmare to the sound of a phone ringing. Elliot Foley invites him to his country home to consult on some renovations. As the end credits roll, Craig is again driving up to his host's cottage as he did in the film's opening, and we presume the entire evening will be repeated.","language":"English","Reception":"According to Kinematograph Weekly the film performed well at the British box office in 1945.[1]","cinematography":"Jack Parker Stanley Pavey Douglas Slocombe","dead_of_night":"Dead of Night US release poster","directed_by":"Cavalcanti (\"Christmas Party\" and \"The Ventriloquist's Dummy\") Charles Crichton (\"Golfing Story\") Basil Dearden (\"Hearse Driver\" and \"Linking Narrative\") Robert Hamer (\"The Haunted Mirror\")","Related":"The theme of a recurring nightmare has been visited in other works and media:The theme of the mad ventriloquist has been visited in other works and media:The theme of the fatal crash premonition has also been visited in other works and media:The theme of a mirror casting a murderous spell has been visited in other works and media:","release_dates":"4 September 1945 (UK) 28 June 1946 (USA)","produced_by":"Michael Balcon","starring":"Michael Redgrave Mervyn Johns Frederick Valk Roland Culver","running_time":"102 minutes","music_by":"Georges Auric London Philharmonic Orchestra","edited_by":"Charles Hasse","written_by":"H.G. Wells (original story) E.F. Benson (original story) John Baines (original story and screenplay) Angus MacPhail (original story and screenplay)"}