{"country":"United States","distributed_by":"20th Century Fox","Plot":"Four socialites unexpectedly clash: heiress Brooke Carter runs into the italian gambler Johnny Spanish at the race track while playboy Michael O. Pritchard nearly runs into stage star Kitty O'Kelly with his car. Backstage at Kitty's show, it turns out she and Brooke are old friends who attended public school together. The foursome do the town, accompanied by Brooke's companion Elizabeth, who throws herself at Michael's butler and chauffeur Rodney James.The four friends change partners at a party, where Brooke and Michael step outside behind the backs of Kitty and Johnny. In an effort to make the others jealous, Kitty and Johnny begin a romance and genuinely fall in love, as do Brooke and Michael, and (eventually) Elizabeth and Rodney.","language":"English","Reception":"The film opened in March 1975 to scathing reviews and poor box office returns.Jay Cocks in Time Magazine led that condemnation, stating \"This Cole Porter coloring book, mounted with great expense and no taste, is one of those grand catastrophes that make audiences either hoot in derisive surprise or look away in embarrassment,\" adding, \"when dancing, the stars look as if they're extinguishing a camp fire.\"[8]TV Guide wrote, \"One of the worst bombs of the 1970s, this foolish attempt at re-creating the lush musicals of the 1930's offers fabulous art deco sets, memorable Cole Porter songs, and slick production values, yet it goes down like a stricken elephant.\"[9] Pauline Kael in The New Yorker called it a \"stillborn musical comedy-a relentlessly vapid pastiche.\"[10]John Simon wrote in The National Review that the film, “may be the worst movie musical of this or any decade: Sitting through this movie is like having someone at a fancy Parisian restaurant, who neither speaks nor reads French, read out stentoriously the entire long menu in his best Arkansas accent, and occasionally interrupt himself to chortle at his own cleverness”[11] and he particularly criticized Cybill Shepherd, stating, \"Cybill Shepherd, Mr B's inamorata, plays a poor little snotty rich girl with a notion of sophistication that is underpassed onIy by her acting ability. (I will not even sully my pen by making it describe her singing and dancing.) If it weren't for an asinine superciliousness radiating from her, Miss Shepherd would actually be pitiable, rather like a kid from an orphanage trying to play Noel Coward.\"Frank Rich also condemned the film and Shepherd specifically in The New Times, calling the film, \"The most perverse movie musical ever made... a colossal, overextravagant in-joke.... Every time his stars open their mouths or shake their legs, they trample on Cole Porter’s grave...As for Shepherd’s dancing, the best to be said is that it may not be recognizable as such: when this horsey ex-model starts prancing around, she tends to look as if she’s fighting off a chronic case of trots.[12]Bruce Williamson attacked the film in a review for Playboy Magazine and stated, \"Duilio Del Prete, an Italian discovery with no voice, sings as if he came to paint the mansion and stayed on to regale the company with wobbly impersonations of Louis Jourdan and Maurice Chevalier.\"[13]John Barbour wrote in Los Angeles magazine, \"If this Peter Bogdanovich fiasco were any more of a dog, it would shed,\" and \"Burt Reynolds sings like Dean Martin with adenoids and dances like a drunk killing cockroaches.\"[13]The chorus of critical attacks prompted Bogdanovich to have an open letter of apology printed in newspapers throughout the U.S.Burt Reynolds later said the film was:Not as bad as it was reviewed. What was reviewed was Cybill and Peter's relationship. You see, Peter Bogdanovich has done something that all critics will never forgive him for doing. That is, stop being a critic, go make a film and have that film be enormously successful. What he did then was to go on talk shows, and be rather arrogant and talk about how bad critics are. That was the final straw. So they were waiting with their knives and whatever. And along came Peter who finally gave them something they could kill him with. Unfortunately there I was, between Cybill's broad shoulders and Peter's ego. And I got killed along with the rest of them.[14]Bogdanovich later said the film was rushed into release:That was a disaster and unfortunately people say to me now \"Gee, I really like that picture, why was it so attacked?\" But the people who are reacting to that now have only seen the recut version which was the one I recut after it opened, you see. It was an original musical comedy and we only had two previews. Two. The first one was a total disaster in San Jose and the second one in Denver was OK. It played. But then I made some more changes to it because of pressure from the studio and didn't preview that version. So that version which had never previewed opened and it was the worst version there was. It was fucked. Then I saw that playing and I realized what I needed to do, but by then it was too late. It was overconfidence on the part of the studio, because the studio really liked the movie, that was the funny thing. They liked it, they thought it was terrific but in a musical, well in anything, it all has to do with construction. And in a musical particularly, the balance between the musical numbers and the dialogue has to be delicate and I just was still too inexperienced to realize how critical that was and so after the picture had opened it was declared a bomb. The only place it made money was at the Music Hall. Then I realized how I should have cut it after that and I immediately did cut it, they let me recut and I think I paid for that, and that version was then shown on television and that's the version that all release prints have been ever since. That was quite different from the opening version. Very different, but unfortunately it was too late.[15]Despite the negative reviews, Roger Ebert gave the film a mildly positive review, writing \"It's impossible not to feel affection for At Long Last Love Peter Bogdanovich's much-maligned evocation of the classical 1930s musical. It's a light, silly, impeccably stylish entertainment...The movie's no masterpiece, but I can't account for the viciousness of some of the critical attacks against it. It's almost as if Bogdanovich is being accused of the sin of pride for daring to make a musical in the classical Hollywood style... Bogdanovich has too much taste, too sure a feel for the right tone, to go seriously wrong. And if he doesn't go spectacularly right, at least he provides small pleasures and great music.\"In a documentary of his career, Bogdanovich has said he regretted that the film was hastily cut prior to theatrical release based on reactions to only two studio previews. He subsequently recut the film himself, before it reached cable and regular TV, and has stated many people who first saw it in this version did not react so badly to the film.[16] At Long Last Love was listed in the 1978 book The Fifty Worst Films of All Time, was cited in The Golden Turkey Awards (Winning the award for \"The Worst Musical Extravaganza of All Time\".), and listed as a major financial disaster in The Hollywood Wall of Shame, both by Harry and Michael Medved.[17]","box_office":"$2.5 million[3][4]","cinematography":"Laszlo Kovacs","directed_by":"Peter Bogdanovich","Home media":"At Long Last Love was only released once on videocassette, by Magnetic Video in 1981.[18] In addition, there were different versions (each with different scenes and numbers added and missing) floating around among fans and collectors, from 16mm prints and various TV broadcasts.The director dismissed the film as a painful memory until around 2011 when he was told it was streaming on Netflix and people were liking it. For the first time in many years he watched it himself, and for the first time in years, he liked what he saw. But it was not his cut.It was discovered that a longtime studio editor named Jim Blakely had secretly assembled another version of the film (running approximately 121 minutes) which more closely resembled Bogdanovich's shooting script and first preview cut. He quietly substituted it as the default version as early as 1979, and that was the version made available to Netflix.[19] As a result of Netflix streaming and showings on Fox Movie Channel this version helped turn the tide and change the picture's fate. The director has gratefully acknowledged Jim Blakely, who died before anyone learned what he had done.After finding out how it happened, Bogdanovich called Fox to say he liked that version. He made some refinements, including 90 seconds of restored footage, bringing the final running time to 123 minutes. The studio released it as the \"Definitive Director's Version\" on Blu-ray disc in June 2013, resulting in more positive reviews than the theatrical version received.","release_dates":"March 1, 1975 (1975-03-01)|||||","Production":"Bogdanovich originally announced the cast would be Cybill Shepherd, Madeline Kahn, Ryan O'Neal and the director himself. He was inspired by the films of Ernst Lubitsch.[5] Shepherd had recorded an album of Cole Porter songs paid for by Paramount.[6]Resisting the urge to shoot another film in black and white, Bogdanovich had it art directed as \"Black and White in Color.\" The film is unique in being the first since the early 1930s in which all of the musical numbers were recorded live, without the actors lip-synching to a previously recorded soundtrack. (This method was also used by Rex Harrison for his songs in My Fair Lady and by Barbra Streisand for the climactic \"My Man\" in Funny Girl). At Long Last Love is also unusual in that most musical numbers were performed in one continuous take.Bogdanovich says the film was originally called Quadrille and was equally weighted between the four lead characters.[7]","produced_by":"Peter Bogdanovich Frank Marshall","starring":"Burt Reynolds Cybill Shepherd","running_time":"123 minutes[1]","music_by":"Cole Porter","at_long_last_love":"Theatrical release poster","edited_by":"Douglas Robertson","written_by":"Peter Bogdanovich","budget":"$5.14 million[2]"}