{"country":"United States","distributed_by":"Sony Pictures Classics","at_any_price":"Theatrical release poster","Plot":"In the competitive world of modern agriculture, ambitious Henry Whipple (Dennis Quaid) wants his rebellious son Dean (Zac Efron) to help expand his family's farming empire. However, Dean has his sights set on becoming a professional race car driver. When a high-stakes investigation into their business is exposed, father and son are pushed into an unexpected crisis that threatens the family's entire livelihood.","language":"English","Critical reception":"At Any Price received mixed reviews. The film holds a 51% rating based on 91 reviews on review aggregator website Rotten Tomatoes with the reported consensus \"At Any Price features a terrific performance from Dennis Quaid, and it offers further evidence of Ramin Bahrani's unique eye for detail, but film is weighted down by an overly melodramatic story.\"[5] On Metacritic, the film has a 60 out of 100 rating based on 32 critics, indicating \"mixed or average reviews\".[6]Film critic Roger Ebert gave the film 4 out of 4 stars, praising Bahrani for delving deep into the plot with layers and themes that communicate effectively and singling out Dennis Quaid's performance as his best as \"a flawed man with selfish values, a man for whom business success has seemed desirable no matter what its human cost.\"[7] Stephen Holden of The New York Times said that the performances of Quaid and Efron help deviate the film away from its credit straining plot twist, saying that they \"drive them home in a movie that sticks to your ribs and stays in your head.\"[8] Noel Murray of The A.V. Club gave the film a \"C–\", finding it a disappointment with its complex farmland plot being wasted with performances and dialogue \"at the level of a Founders’ Day pageant\". Holden also noted that Bahrani's intention of making a mainstream film with substance will detract his usual audience, saying that \"He’s treating them like dolts by making a film that holds to the corniest aspects of Hollywood storytelling, interrupted by bullet points.\"[9]","box_office":"$487,455[2]","cinematography":"Michael Simmonds","directed_by":"Ramin Bahrani","production_companies":"Big Indie Pictures Black Bear Pictures Cineric Killer Films Noruz Films Treehouse Pictures","release_dates":"August 30, 2012 (2012-08-30) (Venice)|April 24, 2013 (2013-04-24) (United States)||||","produced_by":"Ramin Bahrani|Pamela Koffler|Justin Nappi|Teddy Schwarzman|Kevin Turen|Christine Vachon|","starring":"Dennis Quaid|Zac Efron|Kim Dickens|Heather Graham|Clancy Brown|","running_time":"104 minutes[1]","music_by":"Dickon Hinchliffe","edited_by":"Douglas Aibel","written_by":"Ramin Bahrani|Hallie Elizabeth Newton|"}