{"country":"United Kingdom","distributed_by":"Rank Organisation","Plot":"Frustrated butcher Fred Ramsden (Windsor Davies) and his dim electrician mate Ernie Bragg (Jack Douglas) happily head off for a holiday trip at the Riverside Caravan Park while their respective wives Sylvia (Liz Fraser) and Vera (Patricia Franklin) look forward to their health farm holiday. Once at the caravan site of Major Leaper (Kenneth Connor), Fred starts making eyes at a couple of gorgeous campers, Carol (Sherrie Hewson) and Sandra (Carol Hawkins). However, as Ernie talks in his sleep and any infidelities are likely to be repeated in the marital bed after their holiday, Fred is despondent. Professor Roland Crump (Kenneth Williams) teams with Roman expert Anna Vrooshka (Elke Sommer) in an archaeological dig at the site. Arthur Upmore (Bernard Bresslaw) and his wife Linda (Patsy Rowlands) are saddled with her mother Daphne (Joan Sims) and her vulgar mynah bird. Arthur is caught in a compromising position with blonde babe Norma Baxter (Adrienne Posta) whose husband Joe (Ian Lavender) is lumbered with their giant wolfhound. After a few pints with the amused pub landlord (David Lodge), Fred and Ernie discover that the caravan site is riddled with excavation holes. Daphne is perturbed by the discovery of her estranged husband, Henry Barnes (Peter Butterworth) living a downtrodden life as the camp's odd-job man, despite having won the pools. Major Leaper is determined to give the place a boost and arranges an evening cabaret for the caravanners but a mix-up over the phone secures a stripper, Veronica (Jenny Cox), rather than the singer he wanted. With Carol and Sandra having hooked up with archaeology students, Bob (Brian Osborne) and Clive (Larry Dann) Fred and Ernie pick up Maureen (Diana Darvey) and Sally (Georgina Moon), a couple of beauties from the village. Some wet paint, the rain, the collapsing tunnels and their wives soon bring their planned night of passion to a halt.","language":"English","cinematography":"Ernest Steward","directed_by":"Gerald Thomas","Casting":"Main roles are played by Carry On regulars Kenneth Williams, Bernard Bresslaw, Peter Butterworth, Joan Sims, Kenneth Connor, Jack Douglas, and Patsy Rowlands. Newcomers to the series in major roles are Windsor Davies, and Elke Sommer. Sims played the role of Rowlands' mother, despite being only eight months older than her on screen daughter.Supporting roles are played by Sherrie Hewson, Carol Hawkins, Ian Lavender, Adrienne Posta, Liz Fraser, George Layton, Larry Dann, Larry Martyn and David Lodge. These supporting players were mostly recognisable comedy actors at the time but not long term regular members of the Carry On team.This was the last Carry On film for Bernard Bresslaw and Patsy Rowlands. By this time Sid James, Terry Scott, Hattie Jacques and Charles Hawtrey had already made their final Carry On film appearances.","release_dates":"December 1975","Filming":"Chilly spring filming meant the bare trees, muddy fields and icy breath are all quite visible, although the setting is a summer caravanning holiday. A similar dilemma met the cast and crew in Carry On Camping.Whilst this film was in production, Bernard Bresslaw and Joan Sims also appeared in One of Our Dinosaurs Is Missing, another film being made at Pinewood Studios alongside Carry On Behind. Previous Carry On actors Jon Pertwee and Amanda Barrie also appeared in Dinosaurs.","produced_by":"Peter Rogers","starring":"Elke Sommer Kenneth Williams Bernard Bresslaw Kenneth Connor Jack Douglas Joan Sims Windsor Davies Peter Butterworth Liz Fraser","running_time":"90 minutes","Filming and locations":"Interiors:Exteriors:","music_by":"Eric Rogers","edited_by":"Alfred Roome","carry_on_behind":"Original UK quad poster","written_by":"Dave Freeman","budget":"£217,000"}