{"country":"United States","distributed_by":"Pandora Cinema","Plot":"Morgan Sullivan (Northam), a recently unemployed accountant, is bored with his suburban life. Pressured by his wife to take a job with her father's company, he instead pursues a position in corporate espionage. Digicorp's Head of Security, Finster (Bennett), inducts Morgan and assigns him a new identity. As Jack Thursby, he is sent to conventions to secretly record presentations and transmit them to headquarters. Sullivan is soon haunted by recurring nightmares and neck pain. When he meets Rita Foster (Liu) from a competing corporation, his life starts to become complicated.Rita gives him pills to cure his pain and nightmares and tells him not to transmit at the next convention. After the convention, Digicorp confirms the receipt of his transmission, though Morgan had sent nothing. Sure that something strange is going on, Morgan takes the pills Rita gave him and finds that they work. Confused by what is going on, and intrigued by Rita, he arranges to meet with her again. At the meeting, she tells him about Digicorp's deception and offers him an antidote – a green liquid in a large syringe. Morgan hesitantly accepts. She warns him that no matter what happens at the next convention he must not react.Morgan discovers that all the convention attendees are spies like him, all thinking themselves individual spies working for Digicorp. While they are drugged from the served drinks, plastic-clad scientists probe, inject and brainwash them. Individual headsets reinforce their new identities, preparing them to be used and then disposed of. Morgan manages to convince Digicorp that he believes his new identity. He is then recruited by Sunway Systems, a rival of Digicorp. Sunway's Head of Security, Callaway (Webber), encourages Morgan to act as a double agent, feeding corrupted data to Digicorp. Morgan calls Rita, who warns him that Sunway is equally ruthless, and that he is in fact being used by Rita's boss, Sebastian Rooks. Morgan manages to steal the required information from Sunway Systems' vault, escaping with Rita's help.Rita ultimately takes him to meet Rooks. When she temporarily leaves the room, a nervous Morgan calls Finster, and becomes even more distressed. He accidentally shoots Rita, who encourages him to ignore her and meet Rooks in the room next door. Morgan finds the room filled with objects which appear to be personal to him, including a photograph of him and Rita together. Realising that he is apparently Rooks, he turns to Rita in disbelief.Before Rita can convince him, the apartment is invaded by armed men. Rita and Morgan escape to the roof of the skyscraper as the security teams of Digicorp and Sunway meet, led by Finster and Callaway. After a short Mexican standoff both sides realise they are after the same person, Sebastian Rooks, and rush to the roof, where they find Morgan and Rita in a helicopter. Rita cannot fly it, but, having designed it himself, Sebastian can after Rita encourages him to remember his past self, connecting through his love for her. He lifts off amid gunfire from the security teams. Finster and Callaway comment as the couple seem to have escaped:Looking up, they see the helicopter hovering and realise, too late, the true identity of Morgan Sullivan. Sebastian triggers a bomb, causing the whole roof to explode. On a boat in the South Pacific Ocean, Sebastian reveals the content of the stolen disc to Rita. Marked \"terminate with extreme prejudice\", it is the last copy of Rita's identity (after the one in the vault was destroyed). Sebastian throws the disc into the sea and says, \"Now there's no copy at all.\"","language":"English","Reception":"The film received mixed reviews. According to film review aggregator Rotten Tomatoes, the film holds a 58% critic rating average from 19 reviews.[2]Derek Elley of Variety called the film \"consistently intriguing\" and \"100% plot driven\" with excellent performances from the cast,[3] while BBC's Neil Smith compared Cypher to The Manchurian Candidate, and noticed feelings of tension and claustrophobia, as in Natali's directorial début Cube, finally concluding that \"Natali seeps his yarn in an Orwellian atmosphere of paranoia.\"[4] Scott Weinberg, reviewing for DVD Talk, recommended the film, calling it \"one of the best direct-to-video titles [he has] seen all year\", noting similarities to The Matrix, Dark City and the works of Phillip K. Dick.[5] English horror fiction writer and journalist Kim Newman, writing for the Empire magazine, awarded the film 4 out of 5 stars, praising Northam's and Liu's performances and calling the film a \"semi-science-fictional exercise in puzzle-setting and solving\".[6]Some critics found problems with the film's complex narrative. Paul Byrnes of The Sydney Morning Herald found that the plot overwhelmed the characters so much that he \"stopped caring\".[7] John J. Puccio, writing for Movie Metropolis, thought that \"[Cypher's] corporate espionage plot doesn't prove simply too complicated, it ends up downright muddled\", but concluded that the film was nevertheless \"still kind of fun\".[8]For his performance in Cypher, Jeremy Northam received the Best Actor award on the 2002 Sitges Film Festival in Catalonia.[9]","cinematography":"Derek Rogers","production_company":"Miramax Films","directed_by":"Vincenzo Natali","cypher":"Promotional movie poster","release_dates":"August 2, 2002 (2002-08-02)|||||","produced_by":"Paul Federbush|Wendy Grean|Casey La Scala|Hunt Lowry|","starring":"Jeremy Northam|Lucy Liu|Nigel Bennett|Timothy Webber|","running_time":"95 minutes","music_by":"Michael Andrews","edited_by":"Bert Kish","written_by":"Brian King","budget":"$7 million[1]"}