{"based_on":"East to the Dawn by Susan Butler and The Sound of Wings by Mary S. Lovell","Cast":"[Note 1]","country":"United States Canada","distributed_by":"Fox Searchlight Pictures","Plot":"On July 2, 1937, Amelia Earhart (Hilary Swank) and her navigator, Fred Noonan (Christopher Eccleston), are on the last leg of an around-the-world flight. Moving in vignettes from her early years when Earhart was captivated by the sight of an aircraft flying overhead on the Kansas prairie where she grew up, her life over the preceding decade gradually unfolds. As a young woman, she is recruited by publishing tycoon and eventual husband, George Putnam (Richard Gere) to become the first woman to cross the Atlantic Ocean, albeit as a passenger. Taking command of the flight results in a success and she is thrust into the limelight as the most famous woman pilot of her time. Putnam helps Earhart write a book chronicling the flight, much like his earlier triumph with Charles Lindbergh's We. Earhart gradually falls in love with Putnam and they eventually marry, although she enacts a \"cruel\" pledge as her wedding contract.Embarrassed that her fame was not earned, Earhart commences to set myriad aviation records, and in 1932, recreates her earlier transatlantic flight, becoming the first female pilot to fly solo across the Atlantic. Throughout a decade of notoriety, Earhart falls into an awkward love affair with pilot and future Federal Aviation administrator Gene Vidal (Ewan McGregor). In a display of romantic jealousy, Putnam quietly tells Amelia that he does not want Vidal in his house. Earhart is annoyed by the seemingly endless agenda of celebrity appearances and endorsements but Putnam reminds his wife that it funds her flying. Earhart returns to her husband on the eve of her last momentous flight. Earhart's last flight was her biggest and most dangerous adventure to date. Her plan was to fly around the world. Earhart's first attempt ends in a runway crash in Hawaii, due to a collapsed landing gear, and her aircraft requires extensive repairs before the flight can be attempted again. Eventually, she takes the repaired Lockheed Model 10 Electra, sponsored by Purdue University, in a reverse direction, leaving the lengthy trans-Pacific crossing at the end of her flight.Setting out to refuel at tiny Howland Island, radio transmissions between USCGC Itasca, a Coast Guard picket ship, and Earhart's aircraft reveal a rising crisis. Earhart radios to Itasca that the sky has become cloudy and overcast. When Itasca attempts to radio her back, however, all Earhart gets is static. For the rest of the approach, Earhart cannot hear Itasca's transmissions, although they can hear hers. The Coast Guard radio operators realize that they do not have sufficient length to provide a \"fix\". Itasca has a directional finder with a dead battery, and weak radio communications prevent Earhart and USCG Itasca from making contact. Running low on fuel, Earhart and Noonan continue to fly on over empty ocean, as Earhart informs the Itasca that she is on position line 157-337, running north and south. She is not heard from again. A massive search effort is unsuccessful, but solidifies Earhart as an aviation icon.","language":"English","Reception":"Amelia received negative reviews from film critics, with a 20% \"rotten\" rating on the Rotten Tomatoes website based on 159 reviews with an average score of 4.4/10. The website's critical consensus reads, \"Amelia takes the compelling raw materials of its subject's life and does little with them, conventionally ticking off Earhart's accomplishments without exploring the soul of the woman.\"[19] Another review aggretator, Metacritic, which assigns rating of 100 reviews from mainstream critics, gave the film a score of 37 based on 34 reviews.[20]Echoing the majority view, Martin Morrow's review on the Canadian Broadcasting Corporation website was very critical of the film, labeling it \"a dud,\" declaring: \"Hilary Swank may look the spitting image of Earhart in those vintage newsreels, but her performance is more insipid than inspiring. Mira Nair directs as if she were piloting an overloaded plane on an endless runway – the film lumbers along interminably, never achieving takeoff ... As the film limps to a close, Amelia has accomplished a feat we didn’t think possible: it has made us indifferent to this real-life heroine’s tragic fate.\"[21] Most critics decried the inconsistencies and lack of focus in the film; Manohla Dargis of The New York Times wrote, \"The actors don’t make a persuasive fit, despite all their long stares and infernal smiling. ...the movie is a more effective testament to the triumphs of American dentistry than to Earhart or aviation.\"[22] Ric Gillespie, author of Finding Amelia, wrote that \"Swank, under Nair’s direction, accomplishes the amazing feat of making one of the most complex, passionate, ferociously ambitious, and successful women of the 20th century seem shallow, weepy, and rather dull.\"[14]A small number of positive reviews included Ray Bennett of the Hollywood Reporter who characterized the film as an \"instant bio classic,\" stressing the production values in which \"director Nair and star Swank make her quest not only understandable but truly impressive.\"[23] Matthew Sorrento of Film Threat, gave the film 4 stars, and wrote: \"Director Mira Nair trusts her oldschool filmmaking style enough to inspire a fresh take on a legend.\"[24] Roger Ebert of the Chicago Sun-Times, however, gave the film a positive review and gave it 3 stars out of 4, and called it \"a perfectly sound biopic, well directed and acted\".[25] In pre-release publicity, Hilary Swank had been touted as a candidate for a third Oscar,[26][27] but later that prospect was viewed as distant.[8] Carrie Rickey of the Philadelphia Inquirer, however, awarded the film 3 stars, praising Swank's performance in her review stating that \"like Maggie in Million Dollar Baby, [Swank] is unwavering in her gaze, ambition, and drive,\" and \"in Nair's evocatively art-directed (and sensationally costumed) film, Earhart comes alive.\"[28]","box_office":"$19.6 million[1]","cinematography":"Stuart Dryburgh","production_company":"Mirabai Films 2S Films Avalon Pictures AE Electra Productions","directed_by":"Mira Nair","Home media release":"On February 2, 2010, Fox Home Entertainment released Amelia in DVD and Blu-ray versions. Extras on the DVD include deleted scenes and \"The Power of Amelia Earhart\", \"Making Amelia\" and \"Movietone News\" featurettes. The Blu-ray release also has two additional featurettes: \"The Plane Behind the Legend\" and \"Re-constructing the Planes of Amelia\" along with a digital copy of the film.[29]","release_dates":"October 23, 2009 (2009-10-23)|||||","Production":"Hilary Swank took on the role of Executive Producer, working closely with Nair.[7] Filming took place in New York, Toronto, Parkwood Estate in Oshawa, Nova Scotia, Dunnville, Ontario and Niagara-on-the-Lake, Ontario as well as various locations in South Africa. Over the weekend of June 22, 2008, Swank was in Wolfville, Nova Scotia for filming at Acadia University. At the time, although Swank was a pilot-in-training,[8] her appearance in the aerial sequences was limited, with three other women pilots contracted for the flying scenes.[9] Nair was concerned about insurance and liability issues, and opted for professional pilots, Jimmy Leeward and Bryan Regan to do the bulk of the flying in the film.[10] Contemporary newsreel footage of Earhart was interspersed throughout the film while a combination of static, real aircraft and CGI effects was utilized for the flying sequences.[11] Numerous period aircraft, automobiles and equipment were obtained to provide authenticity, including the use of two replica aircraft, a Lockheed Vega and Fokker F.VIIb/3m Tri-motor Friendship (with limited ability to run up engines and taxi).[12] The Lockheed 12A Electra Junior \"Hazy Lily\" (F-AZLL) used alongside another Electra Junior, filled in for the much rarer Lockheed Electra 10E that Earhart used.[13] Despite the efforts to faithfully replicate the period, numerous historical inaccuracies were evident, as chronicled in some reviews.[14]At the completion of filming, the two replica aircraft featured in the Earhart transatlantic flights were donated to museums. The Lockheed Vega is now in the collection of the San Diego Air & Space Museum[15] while the Fokker F. VIIB/3M tri-motor is now housed at the Canadian Bushplane Heritage Centre in Sault Ste. Marie, Ontario where it was unveiled in 2009 with a local Amelia Earhart reenactor Kathie Brosemer recounting the story of Earhart's flight in 1928.[16]Oscar-winning screenwriter Ronald Bass wrote seven drafts of the script for aviation buff and Gateway founder Ted Waitt, who has funded expeditions to search for Earhart's aircraft, and was prepared to finance the film himself.[17] Bass used research from books on Earhart, such as biographies by Susan Butler, East to the Dawn and Mary S. Lovell's The Sound of the Wings as well as Elgen and Mary Long's Amelia Earhart: The Mystery Solved.[2] Although the film was not intended to be a documentary, Bass incorporated many of Earhart's actual words into key scenes.[18] Oscar-nominated screenwriter Anna Hamilton Phelan did a re-write, taking a different approach from the original screenplay.[17]","produced_by":"Ted Waitt Kevin Hyman Lydia Dean Pilcher","starring":"Hilary Swank Richard Gere Ewan McGregor Christopher Eccleston","running_time":"111 minutes","music_by":"Gabriel Yared","amelia":"Theatrical release poster","edited_by":"Allyson C. Johnson Lee Percy","written_by":"Ronald Bass Anna Hamilton Phelan","budget":"$40 million"}