{"based_on":"A Midsummer Night's Dream  by William Shakespeare","country":"United Kingdom United States Italy","distributed_by":"Fox Searchlight Pictures","screenplay_by":"Michael Hoffman","Plot":"In Monte Athena, in the Kingdom of Italy, young lovers Lysander (Dominic West) and Hermia (Anna Friel) are forbidden to marry by her father Egeus (Bernard Hill), who has promised Hermia to Demetrius (Christian Bale). Lysander and Hermia make plans to flee to the forest to escape the arrangement. Demetrius follows them, having been made aware of the plan by Helena (Calista Flockhart), a young woman who is desperately in love with him. Once in the forest, they wander into the fairy world, ruled by Oberon (Rupert Everett) and Titania (Michelle Pfeiffer), King and Queen of the fairies. Oberon and his servant sprite Puck (Stanley Tucci) cause mayhem among the lovers with a magic potion that causes both Lysander and Demetrius to fall in love with Helena, leading to a rift between all four that culminates (famously in this adaptation) in a mud-wrestling scene. Oberon then bewitches Titania with the same potion.Meanwhile, an acting troupe prepares a play for the entertainment of the Duke. The leader of the actors (Roger Rees) and the actors (including a weaver named Bottom (Kevin Kline) and Francis Flute (Sam Rockwell) take their rehearsal to the forest. The mischievous Puck magically enchants Bottom with the head of an ass and Bottom is then seen by the bewitched Titania. Titania woos Bottom in her bower, attended by fairies. Oberon tires of the sport and puts all to rights, pairing Lysander back with Hermia and Demetrius with Helena, and reconciling with his own queen, Titania.In the final part, Bottom and his troupe of \"rude Mechanicals\" perform their amateur play, based on the tragedy of Pyramus and Thisbe, before Duke Theseus (David Strathairn), his wife Hippolyta (Sophie Marceau), and the court, unintentionally producing a comedy.","language":"English Italian","Critical reception":"A Midsummer Night's Dream currently holds a rating of 67% on Rotten Tomatoes,[4] and a score of 61 on Metacritic,[5] indicating generally favorable reviews. Many critics singled out Kevin Kline and Stanley Tucci for particular praise.In the New York Times, Janet Maslin wrote:Michael Hoffman's fussy production of A Midsummer Night's Dream is just such a parade of incongruities, with performances ranging from the sublime to the you-know-what ... Not even Michelle Pfeiffer's commanding loveliness as the fairy queen Titania, and her ability to speak of such things as 'my bower' with perfect ease, can offset the decision to have the actors grapple awkwardly with bicycles ... The hoodwinked characters of A Midsummer Night's Dream are meant to be mismatched much of the time. But not like this. The distraught Helena, played as a hand-waving, eye-rolling ditz by Calista Flockhart, hardly fits into the same film with David Strathairn's reserved Duke Theseus, or with Rupert Everett as a slinky Oberon. Everett, like the inspired Kevin Kline as the ham actor Bottom, is utterly at ease with this material in ways that many other cast members are not ... Though West and especially Ms. Friel approach their roles with gratifying ease, Bale is once again given the cheesecake treatment and little occasion to rise above it. This production tarts up the play any way it can ... The theatrical carryings-on of Bottom and company provide the film's best attempts at comedy. Staging a play about Pyramus and Thisbe with a troupe including Bill Irwin, Roger Rees and Sam Rockwell (as the beauteous heroine), Bottom's acting company delights its late-19th-century audience in ways Hoffman's film can only occasionally manage. In a completely unexpected turn, Rockwell moves the sceptical and bemused audience to tears as he performs Thisbe's scene reacting to the death of Pyramus, proving that he alone among the band of actors has any real talent for the craft.[6]In the Chicago Sun-Times, Roger Ebert wrote:Michael Hoffman's new film of William Shakespeare's A Midsummer Night's Dream (who else's?) is updated to the 19th century, set in Italy and furnished with bicycles and operatic interludes. But it is founded on Shakespeare's language and is faithful, by and large, to the original play... It's wonderful to behold Pfeiffer's infatuation with the donkey-eared Bottom, who she winds in her arms as 'doth the woodbine the sweet honeysuckle gently twist'; her love is so real, we almost believe it. Kline's Bottom tactfully humors her mad infatuation, good-natured and accepting. And Tucci's Puck suggests sometimes that he has a darker side, but it not so much malicious as incompetent.[7]In the San Francisco Chronicle, Peter Stack wrote:Purists will quibble, but William Shakespeare's A Midsummer Night's Dream is a playful, sexy piece of work - just what the Bard might have conjured up for a movie adaptation of his beloved spring-fever comedy. The film is over the top - and willfully so ... As might be expected, Kevin Kline steals the show with his hearty gifts for comedy ... Kline, a Shakespearean veteran, has that flourish, that golden touch. In his glorious way of overdoing it - turning the very notion of acting into farce - he embodies a supreme comic madness that is audacious yet embracing ... Michelle Pfeiffer plays it regal, pouty and come-hither as Titania. Her seduction of Bottom, turned to an ass under the spell of Puck (Stanley Tucci with horns and impish grin), is riotous ... A real surprise is the sly comic depth of Calista Flockhart's bicycle-riding Helena, miles from Ally McBeal ... Rupert Everett is imperious as Oberon, the jealous fairy king, and Tucci's Puck is amusingly tweaky as he keeps messing up his missions to drop magic nectar into lovers' eyes.[8]In Time Out New York, Andrew Johnston (critic) wrote:A strangely uneven adaptation of the Bard's most famous comedy, Michael Hoffman's Dream is, if nothing else, admirable for its lack of a contrived gimmick. Yes, the story has been transplanted to Tuscany in the 1890s, and the cast is packed with big names, but Hoffman rightly treats the text as the real star of the show. The film soars when actors who remember that Shakespeare was primarily an entertainer carry the ball, but things get pretty turgid when the focus is on those who seem cowed by appearing in an adaptation of a Major Literary Classic.[9]In the Washington Post, Jane Horwitz wrote:Instead of Shakespeare's Athens, Hoffman dreams his Dream in a gorgeous Tuscan hill town at the turn of the century, with production designer Luciana Arrighi and costume designer Gabriella Pescucci creating a luscious milieu of dusty green shutters, olive groves and vineyards reminiscent of the 1986 Merchant-Ivory gem A Room With a View ... some in the cast negotiate Shakespeare's lines better than others. Kevin Kline's stage savvy serves him especially well as a movie-stealing Bottom.[10]Also in the Washington Post, Desson Howe wrote:After watching William Shakespeare's 'A Midsummer Night's Dream, Michael Hoffman's adaptation of the romantic comedy, I'm left with more admiration than fairy dust. But it was pleasurable all the same... Kline and Flockhart do most of the pedaling. When Kline gets goofy – as he did in A Fish Called Wanda and In & Out, he's an irresistible, madcap Errol Flynn, twisting his good looks into hilarious contortions. And Flockhart exudes a wonderful vulnerability and sense of comic timing, as she pursues Demetrius, suffering all manner of indignity and incredulity along the way.[11]In Variety, Emanuel Levy described the film as a \"whimsical, intermittently enjoyable but decidedly unmagical version of the playwright's wild romantic comedy ... There is not much chemistry between Pfeiffer and Everett, nor between Pfeiffer and Kline, particularly in their big love scene. Kline overacts physically and emotionally, Flockhart is entertaining in a broad manner, and Pfeiffer renders a strenuously theatrical performance. Overall, the Brits give more coherent and resonant performances, especially Friel and West as the romantic couple, a restrained Everett as Oberon, and Rees as the theatrical manager.\"[12]Time Out wrote that \"this Dream is middlebrow and unashamed of it. Injecting the film with fun and pathos, Kline makes a superb Bottom; it's his play and he acts it to the hilt.\"[13]","box_office":"$16,071,990[1]","cinematography":"Oliver Stapleton","production_company":"Regency Enterprises","directed_by":"Michael Hoffman","release_dates":"April 26, 1999 (1999-04-26) (Premiere)|May 14, 1999 (1999-05-14) (USA)||||","Production":"A Midsummer Night's Dream was filmed on location in Lazio and Tuscany, and at Cinecittà Studios, Rome, Italy.[2] The action of the play was transported from Athens, Greece, to a fictional Monte Athena, located in the Tuscan region of Italy, although all textual mentions of Athens were retained.The film made use of Felix Mendelssohn's incidental music for an 1843 stage production (including the famous Wedding March), alongside operatic works from Giuseppe Verdi, Gaetano Donizetti, Vincenzo Bellini, Gioacchino Rossini and Pietro Mascagni.[3]","produced_by":"Michael Hoffman Leslie Urdang","starring":"Kevin Kline Stanley Tucci Calista Flockhart Anna Friel Christian Bale Dominic West David Strathairn Sophie Marceau Roger Rees Max Wright Gregory Jbara Bill Irwin Sam Rockwell Bernard Hill John Sessions","running_time":"116 minutes[1]","a_midsummer_night's_dream":"Theatrical release poster","music_by":"Simon Boswell","edited_by":"Garth Craven","budget":"$11 million[1]"}