{"Cast":"Real-life movie and theatre critics Stewart Klein, Jeffrey Lyons and Joel Siegel have cameo appearances as themselves.","country":"United States","distributed_by":"Warner Bros.","Plot":"Famed playwright Sidney Bruhl (Caine) debuts the latest in a series of Broadway flops and returns to his opulent Long Island home and his wife, Myra (Cannon). Although their financial situation is not dire, Sidney is hungry for a hit. He has received a manuscript of a play called Deathtrap written by one of his students, Clifford Anderson, that he considers near perfection. Clifford recently attended one of Sidney's writing workshops and now asks for input on his play. Sidney suggests that he murder Clifford and produce the play as his own. He invites Clifford to their secluded home, decorated with weapons from Sidney's plays, to discuss it.Clifford (Reeve) arrives by train. Myra tries desperately over the course of an evening to convince Sidney to work with Clifford as equal partners, but to no avail; Sidney attacks Clifford, strangling him with a chain. Sidney removes the body but still has to convince Myra to conspire with him. She reveals nothing when they receive an unexpected visit from the psychic Helga Ten Dorp (Irene Worth), a minor celebrity who is staying with the Bruhls' neighbors. Helga senses pain and death in the house; before she leaves she warns Sidney about a man in boots who will attack him.As she prepares for bed, Myra is beginning to come to terms with what Sidney has done. All is calm until Clifford bursts through the bedroom window and beats Sidney with a log. Clifford chases Myra through the house until her weak heart gives out; she collapses and dies. Sidney calmly descends the stairs, uninjured, and sidles unperturbed to Clifford's side. They exchange a few words about what to do with Myra's body, then exchange a passionate kiss.Clifford moves in with Sidney. The two work together at a partner's desk, Sidney suffering from writer's block but Clifford busily typing page after page of a new play that he keeps suspiciously under lock and key. While Clifford is out grocery shopping, Sidney tries to break into the drawer but fails before Clifford returns home. He waits for Clifford to retrieve his play, then switches Clifford's manuscript with a fake. He is horrified to discover that Clifford is using the true story of Myra's murder as the basis of Deathtrap. He angrily confronts Clifford, who boasts about the play's potential and offers to share the credit with him. Sidney comes to realize from Clifford's behavior that he is a sociopath, and lies about the solvency of Myra's estate as an excuse to assist Clifford while he contemplates a solution.A few days later, Helga stops by, ostensibly for candles in anticipation of a predicted thunderstorm. Almost immediately after meeting Clifford, she warns Sidney that Clifford is the man in boots.Sidney double crosses Clifford by asking him to arm himself with an axe to demonstrate a bit of stage business, then producing a gun to dispose of Clifford and \"Deathtrap\". But Clifford has loaded the bullets into a different gun, and he secures Sidney to a chair with manacles, unaware they were once the property of Harry Houdini. Sidney easily releases himself, grabs a crossbow and knocks out Clifford with a single shot. Before Sidney can dispose of the body, the storm hits with full force, plunging him into darkness. A flash of lightning illuminates the living room and a fleeting figure scurries through. It is Helga, aware of the mortal danger at the house. Sidney finds a knife while Helga grabs a gun. Clifford regains consciousness and trips Helga. The gun goes flying and a struggle for it ensues that ...... culminates on a stage with actors before a full house, where \"Clifford\" stabs \"Sidney\" and both die, leaving \"Helga\" victorious. The opening night audience erupts in thunderous applause, and at the back of the house stands Helga Ten Dorp, now the author of a hit Broadway play called Deathtrap.","language":"English","Reception":"Deathtrap has an aggregate rating of 75% at Rotten Tomatoes.[4] Critic Roger Ebert gave it three stars, calling it \"a comic study of ancient and honorable human defects, including greed, envy, lust, pride, avarice, sloth, and falsehood.\"[1] Ebert, along with Janet Maslin, and Gary Arnold of the Washington Post noted the similarities to Caine's 1972 film Sleuth,[1][3][5] and similarities have subsequently been noted by film historians.[6][7][8]Cannon was nominated for a Golden Raspberry Award for \"Worst Supporting Actress\" for her performance. Mad Magazine parodied the film as Deathcrap.[9]The kissing scene between Sidney and Clifford is not in the original play (although they are revealed to be lovers). In his book The Celluloid Closet, gay film historian Vito Russo reports that Reeve said that the kiss was booed by preview audiences in Denver, Colorado, and estimated that a Time magazine report of the kiss spoiled a key plot element and cost the film $10 million in ticket sales.[citation needed] (The film earned more than $19 million at the box office.)[10] In his book Murder Most Queer (2014), Jordan Schildcrout describes attending a screening at which an audience member screamed, \"No, Superman, don't do it!\" at the moment of the Caine-Reeve kiss.[11] The controversy over the kiss inspired the Tom Smith song \"Two Guys Kissin' (Ruined My Life)\".[12]","box_office":"$19,282,134","cinematography":"Andrzej Bartkowiak","directed_by":"Sidney Lumet","deathtrap":"Theatrical poster by Bill Gold","release_dates":"March 19, 1982 (1982-03-19)|||||","produced_by":"Burtt Harris","starring":"Michael Caine Christopher Reeve Dyan Cannon","running_time":"116 minutes","Home video release":"Deathtrap was released on Region 1 DVD on July 27, 1999. It was re-released on November 8, 2003, as half of a two-pack with the Henry Winkler/Michael Keaton buddy film Night Shift. Warner Home Video released Deathtrap on Blu-ray Disc on November 20, 2012, as part of the Warner Archive Collection.[13]","music_by":"Johnny Mandel","edited_by":"Jack Fitzstephens","written_by":"Ira Levin (play) Jay Presson Allen (screenplay)"}