{"country":"United States United Arab Emirates","distributed_by":"Warner Bros. Pictures","Plot":"Returning from a Hong Kong business trip, Beth Emhoff (Gwyneth Paltrow) has a layover in Chicago to have sex with a former lover before returning to her family in suburban Minneapolis. She appears to have contracted a cold during her trip. Her six-year-old son from a previous marriage, Clark, also becomes symptomatic and is sent home from school. Beth's condition worsens and two days later she collapses with severe seizures. Her husband, Mitch (Matt Damon), rushes her to the hospital, but she dies of an unknown cause.Mitch returns home and finds that Clark has also died from a similar infection. Mitch is put in isolation but seems to be immune to the disease. He is released and returns home to his teenaged daughter Jory, who had been living with Mitch's former wife and her husband and has decided to stay with Mitch since he's now all alone. They face decaying social order and rampant looting of stores and homes. Mitch is unsure if Jory has inherited his immunity and he struggles with the frustration of quarantine, his desire to protect his daughter and learning that his wife was cheating on him immediately prior to both her death and that of his stepson.In Atlanta, representatives of the Department of Homeland Security meet with Dr. Ellis Cheever (Laurence Fishburne) of the CDC and express fears that the disease is a bio weapon intended to cause terror over the Thanksgiving weekend. Dr. Cheever dispatches Dr. Erin Mears (Kate Winslet), an Epidemic Intelligence Service officer, to Minneapolis to begin investigating. Mears traces the outbreak back to Emhoff while negotiating with local bureaucrats initially reluctant to commit resources for a proper public health response to the virus. Dr. Mears later becomes infected and dies.At the CDC, Dr. Ally Hextall (Jennifer Ehle) determines the virus is a mix of genetic material from pig and bat viruses. Work on a cure stalls because scientists cannot discover a cell culture within which to grow the newly identified Meningoencephalitis Virus One (MEV-1).UCSF professor Dr. Ian Sussman (Elliott Gould) violates orders from Cheever (relayed through Hextall) to destroy his samples, and identifies a usable MEV-1 cell culture using bat cells. Hextall uses the breakthrough to work on a vaccine. Other scientists determine the virus is spread by fomites, with a basic reproduction number of four when the virus mutates, with projections of one in twelve of the population being infected, and a 25-30% mortality rate.Conspiracy theorist Alan Krumwiede (Jude Law) posts videos about the virus on his popular blog. In one video, he shows himself sick and later claims he recovered using a homeopathic cure derived from forsythia. In a panic, people seeking forsythia overwhelm pharmacies, spreading and accelerating the contagion as the infected come into contact with healthy people.Krumwiede's claims attract national attention. During a television interview he discloses that Dr. Cheever had secretly informed friends and family to leave Chicago just before the city was quarantined. Cheever is then informed the government will investigate and may charge him for leaking information. Later it is revealed Krumwiede had faked being infected by the virus in an attempt to increase profits for shareholders in companies producing and selling forsythia. Krumwiede is arrested for conspiracy and securities fraud, only to walk free when his many supporters successfully raise funds to provide for his bail.Using an attenuated virus Dr. Hextall identifies a possible vaccine. To cut out the lengthy time it would take to obtain informed consent from infected patients, Dr. Hextall inoculates herself with the experimental vaccine and immediately visits her gravely ill father, who has been infected with MEV-1. The doctor does not contract MEV-1 and the vaccine is declared a success.The vaccine's production is rapidly increased, but due to limited production, the CDC awards vaccinations by lottery based on birth date. Inoculations take place for one full year until every survivor is vaccinated. First responders, doctors and others designated by the government are declared exempt from the lottery. Dr. Cheever gives his fast-tracked MEV-1 vaccination to the son of Roger (John Hawkes), a CDC janitor who had overheard Dr. Cheever's phone call warning his girlfriend to leave Chicago.Dr. Leonora Orantes (Marion Cotillard), a WHO epidemiologist, travels to Hong Kong to follow the Beth Emhoff lead. She collaborates with Sun Feng (Chin Han) and other local epidemiologists and public health officials; they identify Emhoff as patient zero. As the virus spreads, Feng kidnaps Orantes to use her as leverage to obtain MEV-1 vaccine doses for his village. Orantes spends months living with the villagers until the vaccine is announced. Feng exchanges Orantes for the vaccine doses. Her colleague mentions that the exchanged doses were placebos and Orantes rushes away to warn them.The death toll reached 2.5 million in the U.S. and 26 million worldwide. Dr. Hextall places samples of MEV-1 in cryogenic storage, alongside samples of H1N1 and SARS.The source of the virus is revealed to viewers. A bulldozer (coincidently, operating for the company Emhoff works for) knocks down a palm tree disturbing some bats, with one finding shelter and food in a banana tree. That bat then flies over a pig pen, dropping a chunk of banana from its mouth, which was then eaten by a piglet. Chinese chefs later collected pigs from the pen and took them to a casino where one chef was called away from his preparations of the piglet, casually wiping his hands on his apron. The chef then shook hands with Beth Emhoff, giving her the mix of bat and pig viruses that makes her patient zero and the origin of the MEV-1 virus.","language":"English","Themes":"Steven Soderbergh was motivated to make an \"ultra-realistic\" film about the public health and scientific response to a pandemic.[19] The movie touches on a variety of themes, including the factors which drive mass panic and collapse of social order, the scientific process for characterizing and containing a novel pathogen, balancing personal motives against professional responsibilities and rules in the face of an existential threat, the limitations and consequences of public health responses, and the pervasiveness of interpersonal connections which can serve as vectors to spread disease.[20] Soderbergh acknowledged the salience of these post-apocalyptic themes is heightened by reactions to the September 11 attacks and Hurricane Katrina.[20] The movie was intended to realistically convey the \"intense\" and \"unnerving\" social and scientific reactions to a pandemic.[21] The recent real-life epidemics such as the 2003 SARS epidemic and the 2009 flu pandemic have been inspirations and influences in the film.[21] The chain of contagion involving bats and pigs is reminiscent of the trail of the Nipah virus that originated in Malaysia in 1997, which similarly involved the disturbance of a bat colony by deforestation.[22]The film presents examples of crowd psychology and collective behavior which can lead to mass hysteria and the loss of social order. The bafflement, outrage, and helplessness associated with the lack of information, combined with new media such as blogs, allow conspiracy theorists like Krumwiede to spread disinformation and fear, which become dangerous contagions themselves.[20][23][24] Dr. Cheever must balance the need for full disclosure but avoid a panic and allow the time to characterize and respond to an unknown virus.[25] The movie indirectly critiques the greed, selfishness, and hypocrisy of isolated acts in contemporary culture and the unintended consequences they can have in the context of a pandemic.[26] For example, the Centers for Disease Control and Prevention recommends social distancing by forcibly isolating the healthy to limit the spread of the disease, which stands in stark opposition to contemporary demands for social networking.[26] Responding to the pandemic presents a paradox, as the contagiousness and lethality of the virus instills deep distrust of others but surviving and limiting the spread of the disease also requires individuals to work together.[27]Against this existential threat and fraying social order, the film also explores how individual characters bend or break existing rules for both selfish and selfless reasons.[28] Dr. Hextall violates protocols by testing a potential vaccine on herself, Dr. Sussman continues experiments on a cell line despite orders to destroy his samples, Dr. Cheever notifies his fiancé to leave the city before a public quarantine is imposed, Sun Feng kidnaps Dr. Orantes to secure vaccine supplies for his village, Dr. Mears continues her containment work despite contracting the virus, and Krumwiede is paid to use his blog to peddle snake oil cures so as to drive demand and profit for investors in Alternative Medicine. Soderbergh repeatedly uses the cinematographic style of lingering and focusing on the items and objects which are touched by the infected and become vectors (fomites) to infect other people.[29] These objects link characters together and reinforce the multi-narrative hyperlink cinema style which Soderbergh developed in Traffic (2000) and Syriana (2005), which he produced.[27][30]The story also highlights examples of political cronyism (a plane to evacuate Dr. Mears from Minneapolis is instead diverted to evacuate a Congressman), platitudes and rigid thinking (public health officials consider postponing the closing of shopping malls until after the Thanksgiving shopping season), federal responders trying to navigate 50 separate state-level public health policies, and the heroism of Federal bureaucrats.[20][24] Soderbergh does not use type-cast pharmaceutical executives or politicians as villains,[31] but instead portrays bloggers such as Krumwiede in a negative light.[24] Social media plays a role in Krumwiede's accusations against Dr. Cheever and in Emhoff's daughter's attempts to carry on a relationship with her boyfriend through text messaging.[27] Other responses in the movie, such as Emhoff's appropriating a shotgun from a friend's abandoned house to protect his home from looters, imposition of federal quarantines and curfews, the allocation of vaccines by lottery, inadequate federal preparation and responses, and use of bar-coded wristbands to identify the inoculated highlight the complex tensions between freedom and order in responding to a pandemic.[25] Soderbergh uses Emhoff to illustrate the micro-effects of macro-level decisions.[32]","Reception":"Contagion premiered on September 3, 2011 at the 68th Venice Film Festival in Venice, Italy,[33] and a wider release followed on September 9.[34] In the United States and Canada, Contagion was shown in 3,222 theaters, of which 254 screenings occurred at IMAX venues.[35] Various American commercial analysts anticipated that the film would have ticket sales of between $20 million and $25 million during its opening weekend,[34][35] which it did, grossing $8 million on its first day,[36] and $23.1M for the entire weekend.[37] Of that total, ten percent ($2.3M) of the gross came from IMAX screenings.[38] By outgrossing competitor The Help ($8.7M), Contagion became the highest-grossing film of the week.[37] Demographically, the opening audience was evenly divided among gender, according to Warner Bros., while eighty percent of spectators were of the age of 25 and over.[37][39] Contagion did well the following weekend, generating a $14.5M box office, but came in second to the re-release of The Lion King (1994).[40] The third week saw the box office drop by forty percent, for a total gross of $8.7M.[41] By the fourth week, Contagion had dropped to ninth place at the box office with $5M, and the number of theaters narrowed to 2,744.[42] The film completed its theatrical run on December 15, 2011, at which point its total domestic gross was $75.6M.[1]Contagion made its international debut in six foreign markets the same weekend as its American release, including Italy, where it achieved $663,000 from 309 theaters.[43] The first week saw Contagion acquire $2.1M from 553 establishments—a per-theater average of $3,797.[43] Foreign grosses for Contagion would remain relatively stagnant up until the weekend of October 14–16, 2011, when the film expanded into several additional European markets.[44] Out of the $3.9M that was generated from 1,100 venues during that weekend, nearly 40% of the gross originated from Spain, where the film earned $1.5M from 325 theaters.[44] With the growing expansion of the film in seven additional markets, the weekend of October 21–23, 2011 saw Contagion take in $9.8M from 2,505 locations, increasing the international gross to $22.9M.[45] In the United Kingdom, one of the film's significant international releases, Contagion opened in third place at the box office with $2.3M from 398 theaters;[45] it subsequently garnered the highest debut gross of a Soderbergh film since Ocean's Thirteen (2007).[46] International grosses for Contagion stand at $59.8M.[1]Contagion has received positive reviews by film commentators. Review aggregator Rotten Tomatoes sampled 237 reviewers and judged 84% of the reviews to be positive. With a mean score of 7/10, the site's consensus stated, \"Tense, tightly plotted, and bolstered by a stellar cast, Contagion is an exceptionally smart—and scary—disaster movie.\"[47] At Metacritic, which assigns a normalized rating out of 100 based on the critiques from mainstream critics, the film received an average score of 70 based on 38 reviews.[48]The Guardian journalist Peter Bradshaw felt that Contagion blended well together as a film, although opined that Soderbergh was somewhat unsuccessful on channeling the fears, frights, and \"the massive sense of loss\" of \"ordinary people\".[49] To David Denby of The New Yorker, the \"brilliant\" film was \"serious, precise, frightening,\" and \"emotionally enveloping\".[20] Despite applauding Soderbergh for \"hopscotching\" tidily \"between the intimate and international\", The Atlantic's Christopher Orr was disappointed with the film's detached and \"clinical\" disposition, which led him to conclude that Contagion should have gone with a more inflexible rationale, or a lesson \"beyond 'wash your hands often and hope you're lucky'.\"[50] \"For all the craft that went into it, Contagion is ultimately beyond good or bad, beyond criticism. It just is,\" professed The Atlantic writer.[50] Described as a \"smart\" and \"spooky\" installment, Manohla Dargis of The New York Times wrote, \"Mr. Soderbergh doesn't milk your tears as things fall apart, but a passion that can feel like cold rage is inscribed in his images of men and women isolated in the frame, in the blurred point of view of the dying and in the insistent stillness of a visual style that seems like an exhortation to look.\"[29] In regards to the story, Salon columnist Andrew O'Hehir avouched that the \"crisp\" and succinct narrative matched up to the \"beautifully composed\" visuals of the film.[24] Todd McCarthy of The Hollywood Reporter proclaimed that Soderbergh and Burns effectively created anxiety in the \"shrewd\" and \"unsensationalistic\" film without becoming exaggerated,[51] a sentiment echoed by Jeanette Catsolis of NPR, who insisted that the duo \"weave multiple characters into a narrative that's complex without being confusing, and intelligent without being baffling\".[32] Writing for The Village Voice, Karina Longworth thought that Contagion reflected the \"self-consciousness\" and \"experimentation\" of some of Soderbergh's previous efforts, such as the Ocean's trilogy and The Girlfriend Experience (2009).[26]The performances of multiple cast members were frequently mentioned in the reviews. Lou Lumenick of New York Post asserted that Ehle was \"outstanding\",[23] a view that was analogous to that of The Boston Globe journalist Wesley Morris, who praised not only Ehle's performance, but the work of the \"undercard\" such as Cranston, Gould, and Colantoni, among others.[30] Similarly, Peter Travers of Rolling Stone called Ehle the \"best in show\".[52] As Los Angeles Times' Kenneth Turan summed up, \"Two-time Tony-winning actress Jennifer Ehle comes close to stealing the picture with this quietly yet quirkily empathetic performance.\"[53] In regards to Law, The Philadelphia Inquirer's Steven Rea stated that the actor portrayed the character with a \"nutty\" confidence;[54] Mick LaSalle from the San Francisco Chronicle agreed with Rea's thoughts.[55][56] Damon provided the film's \"relatable heart\", according to Forrest Wickman of Slate, who concluded that even with her controlled performance, Winslet \"lives up to her head-of-the-class reputation even in an unusually small role\".[27]The character development of multiple characters produced varying response from critics. Contrary to Mitch's stance as the main protagonist, Michael O'Sullivan of The Washington Post felt that Contagion \"treats him with an oddly clinical detachment\".[57] In particular Law's character, Alan Krumwiede, attracted commentary from Roger Ebert of the Chicago Sun-Times, who wrote, \"The blogger subplot doesn't interact clearly with the main story lines and functions mostly as an alarming but vague distraction.\"[58]Ferris Jabr of New Scientist approved of Contagion for accurately portraying the \"successes and frustrations\" of science. Jabr cites story elements such as \"the fact that before researchers can study a virus, they need to figure out how to grow it in cell cultures in the lab, without the virus destroying all the cells\" as examples of accurate depictions of science.[59] Carl Zimmer, a science commentator, praised the film, stating, \"It shows how reconstructing the course of an outbreak can provide crucial clues, such as how many people an infected person can give a virus to, how many of them get sick, and how many of them die.\" He also describes a conversation with the film's scientific consultant, W. Ian Lipkin, in which Lipkin defended the rapid generation of a vaccine in the film. Zimmer wrote that \"Lipkin and his colleagues are now capable of figuring out how to trigger immune reactions to exotic viruses from animals in a matter of weeks, not months. And once they've created a vaccine, they don't have to use Eisenhower-era technology to manufacture it in bulk.\"[60] Paul Offit, a pediatrician and vaccination expert, stated that \"typically when movies take on science, they tend to sacrifice the science in favor of drama. That wasn't true here.\" Offit appreciated the film's usage of concepts such as R0 and fomites, as well as the fictional strain's origins, which was based on the Nipah virus.[61]Contagion was released on DVD and Blu-ray in North America on January 3, 2012,[62] and in the United Kingdom on March 5, 2012.[63] In its first week of release, the film topped the DVD chart with 411,000 units sold for $6.16 million.[64] That same week it sold 274,000 Blu-ray copies for $4.93 million, topping that chart as well.[65] DVD sales dropped during the second week of release, with 193,000 units sold for $2.89 million.[66] As of early July 2012, Contagion had sold 802,535 copies in DVD, for $12.01 million in revenue.[62]","box_office":"$135.5 million[1]","cinematography":"Steven Soderbergh (as Peter Andrews)","production_company":"Participant Media Imagenation Abu Dhabi Double Feature Films","contagion":"Theatrical release poster","directed_by":"Steven Soderbergh","release_dates":"September 3, 2011 (2011-09-03) (Venice Film Festival)|September 9, 2011 (2011-09-09)||||","Production":"There's a scene in The Informant! where Matt (Damon) is watching Scott Bakula's character talk on the phone and Scott coughs on the phone, and there's this whole rant that Matt goes off on of 'Oh, great, now what happens? He gets sick and then I'm going to get it, my kids are going to get it.' I've always been fascinated by transmissibility, so I said to Steven, 'I want to do an interesting thriller version of a pandemic movie' and he said, 'Great! Let's do that instead.'Concerted efforts to devise Contagion coincided with Burns' collaboration with Soderbergh in The Informant! (2009).[5] The duo had initially planned to create a biographical film on Leni Riefenstahl, a trailblazer in German cinema during the 1930s and a figure in the rise of the Nazi Party. Soderbergh later contacted Burns to cancel the project, as he thought that a film about Riefenstahl would struggle to attract an audience.[5] Intrigued with the field of transmission, Burns suggested that they instead create a film that centered on a pandemic situation—\"an interesting thriller version of a pandemic movie\". His main objective was to construct a medical thriller that \"really felt like what could happen\".[5]Burns consulted with Lawrence \"Larry\" Brilliant, renowned for his work in eradicating smallpox, to develop an accurate perception of a pandemic event.[5] He had seen one of Brilliant's TED presentations, which he was fascinated by, and realized that \"the point of view of people within that field isn't 'If this is going to happen', it's 'When is this going to happen?'\"[5] Brilliant introduced Burns to another specialist, W. Ian Lipkin. With the aid of these physicians, the producers were able to obtain additional perspectives from representatives of the World Health Organization.[5] Burns also met with the author of The Coming Plague, Laurie Garrett. Her 1995 book helped Burns consider a variety of potential plots for the film. He wanted to feature an official from the CDC, and ultimately decided to use an epidemiologist, since that role requires interacting with people while tracking the disease.[5]Although he had done research on pandemics six months prior to the 2009 flu pandemic, the outbreak was \"really helpful\" to his studies, because it provided a glimpse of the societal apparatus following the onset stages of a pandemic. To him, it was not solely the virus itself that one had to be concerned about, but how society handles the situation.[5] \"I saw them come to life\", Burns said, \"and I saw issues about, 'Well, do you close the schools and if you close the schools, then who stays home with the kids? And will everyone keep their kids at home?' Things happening online, which is where the Jude Law character came from, that there's going to be information that comes out online where people want to be ahead of the curve, so some people will write things about anti-virals or different treatment protocols, and so there's always going to be an information and that information also has sort of a viral pulse.\"[5]In conjunction with overseeing the directing process, Soderbergh functioned as a cinematographer for Contagion.[3] The film was wholly shot using Red Digital Cinema Camera Company's RED One MX digital camera, which uses ambient light and has a 4.5K image resolution.[3][9] Since he hoped for the premise to be authentic and \"as realistic as possible\", Soderbergh opted not to film in the studio. \"There's, to me, nothing more satisfying occasionally than making someplace look like someplace else on film and having nobody know the difference.\"[10] For choosing cities, Soderbergh felt that they couldn't \"go anywhere where one of our characters hasn't been\", since he wanted to portray an \"epic\", yet \"intimate\" scenario.[6] He explained,We can't cut to a city or a group of extras that we've never been to that we don’t know personally. That was our rule. And that’s a pretty significant rule to adhere to in a movie in which you're trying to give a sense of something that’s happening on a large scale, but we felt that all of the elements that we had issues with prior, when we see any kind of disaster film, we're centered around that idea.[6]Principal photography started in Hong Kong in September 2010,[3] and continued for approximately two weeks.[5] Soderbergh was originally hoping to also film in mainland China, though Moviefone journalist David Ehrlich believed that permission from the Chinese government was unlikely to be forthcoming.[11] Although producers also intended to establish a filming location in one of the many casinos in Macau, the Jumbo Floating Restaurant in Hong Kong's Aberdeen Harbour was used instead for the casino setting, as filming within the vicinity of a gambling establishment is prohibited by law.[3] To move the equipment for the casino scenes to the on-the-water location, producers hired a number of locals to carry out the task, as they were accustomed to \"using sampans like trucks\".[3] Additional locations included the Hong Kong International Airport, InterContinental Hong Kong, and the Princess Margaret Hospital.[3]Principal photography relocated in the following month to Chicago, Illinois, which served as the nexus for production.[3] Much of the cityscape and its surrounding suburbs were used to emulate Minneapolis, Minnesota, and Atlanta, Georgia, in addition to serving as backdrop for Chicago itself.[3] Since principal photography occurred during the winter months, snowfall was a prerequisite in simulating a \"persistent coldness\" that encompassed \"a hypersensitive kind of glare\".[3] Within the city limits, filming locations were installed at the Shedd Aquarium,[12] O'Hare International Airport, and the Midway Airport.[3] Arguably the largest sets were at the General Jones Armory, which was converted into an infirmary, and a major location shoot occurred in Waukegan, where a portion of the Amstutz Expressway was used to simulate the Dan Ryan Expressway.[3][13] Production also took place at Sherman Hospital in Elgin and Central Elementary School in Wilmette, and also in Downtown Western Springs, where the grocery store scene was filmed.[3]Filming moved once again in January 2011 to the Druid Hills quadrant of Atlanta, which contains the headquarters of the Centers for Disease Control and Prevention. The restricted nature of the CDC campus meant that producers were only allowed to shoot exterior scenes of the area, as well as within the parking garage and reception area for the CDC's museum onsite.[14] Principal photography then proceeded into Atlanta's central business district and Decatur,[14] before advancing to London, Geneva, and lastly San Francisco, California, in the ensuing month.[15] The San Francisco Film Commission charged filmmakers $300 per day for production within the city limits.[15] In the North Beach and Potrero Hill sections of the city, production designer Howard Cummings scattered trash and discarded clothing on the ground to depict the rapid decline of civilization.[3] For the Civic Center set, over 2,000 extras were sought for in background roles; actors who were a part of the Screen Actors Guild were paid $139 per day, while nonunion workers received $64 per day for their work.[16] Other filming locations were established at Golden Gate Park, Chinatown, and Candlestick Park; it cost $60,000 to rent the football stadium for six days.[3][15]Cliff Martinez composed the film's soundtrack, which was his first score for Soderbergh since Solaris in 2002.[17] Given that the pacing of the music was one of Soderbergh's biggest concerns, Martinez needed to maintain a brisk pace throughout the soundtrack, while also conveying fear and hope within the music.[17] \"I tried to create the sound of anxiety. And at key, strategic moments I tried to use the music to conjure up the sense of tragedy and loss.\"[17] Martinez incorporated orchestral elements, and fused them with the predominantly electronic sounds of the score. He noted that the \"sound palette for Contagion came by way of combining three very different approaches Steven went through as he was cutting the film.\"[17] Martinez received a rough cut for the film in October 2010, which contained music that was imbued with elements of The French Connection (1971) and Marathon Man (1976). He \"loved\" those two soundtracks, and composed a few pieces in their style.[17] A few months later, he acquired a new cut, which included music influenced by German electronic group Tangerine Dream.[17] Toward the end, Soderbergh changed again and used contemporary soundtrack music that was \"more energetic and more rhythmic\".[18] Ultimately, Martinez used aspects of all three approaches: \"I reasoned that combining them would not only be effective but would give the score a style all its own.\"[17]","produced_by":"Michael Shamberg Stacey Sher Gregory Jacobs","starring":"Marion Cotillard Matt Damon Laurence Fishburne Jude Law Gwyneth Paltrow Kate Winslet","running_time":"106 minutes","music_by":"Cliff Martinez","edited_by":"Stephen Mirrione","written_by":"Scott Z. Burns","budget":"$60 million"}