{"based_on":"9½ Weeks  by Ingeborg Day","country":"United States","distributed_by":"MGM/UA Entertainment Co.","screenplay_by":"Sarah Kernochan|Zalman King|Patricia Louisanna Knop|","Plot":"The title of the film refers to the duration of a relationship between Wall Street arbitrageur John Gray and divorced SoHo art gallery employee Elizabeth McGraw. John initiates and controls the various experimental sexual practices of this volatile relationship to push Elizabeth's boundaries. In doing so, Elizabeth experiences a gradual downward spiral toward emotional breakdown.Elizabeth first sees John in New York City where she grocery shops and again at a street market where she decides against buying an expensive scarf. John wins her heart when he eventually produces that scarf. They start dating, and Elizabeth is increasingly subjected to John's behavioral peculiarities; he blindfolds Elizabeth, who is at first reluctant to comply with his sexual fantasy demands. Yet she sees him as loving and playful. He gives her an expensive gold watch, and instructs her to use it to think about him at noon. She takes this imperative even further by masturbating at her workplace at the designated time. However, he ultimately confuses Elizabeth by his reluctance to meet her friends despite the intimacy of their sexual relations.Elizabeth's confusion about John increases when he leaves her alone at his apartment. She examines his closet until she discovers a photograph of him with another woman. John asks her if she went through his stuff, declaring that he will punish her. Their ensuing altercation escalates into sexual assault until she blissfully concedes to his struggle to overpower her. Their sexual intensity grows as they start having sex in public places.Elizabeth's heightened need for psychosexual stimulation drives her to stalk John to his office and to obey his injunction to cross-dress herself for a rendezvous. On leaving the establishment, two men hurl a homophobic slur when they mistake John and Elizabeth for a gay couple. A fight ensues. Elizabeth picks up a knife from one of the attackers and stabs one of them in the buttocks and both attackers flee. After the fight, Elizabeth reveals a wet tank-top and has sex onsite with John with intensely visceral passion. Following this encounter, John's sexual games acquire sadomasochistic elements.Rather than satisfying or empowering Elizabeth, such experiences intensify her emotional vulnerability. While meeting at a hotel room, John blindfolds her. A prostitute starts caressing Elizabeth as John observes them. The prostitute removes Elizabeth's blindfold and starts working on John. Elizabeth violently intervenes, and flees the hotel, with John pursuing her. They run until they find themselves in an adult entertainment venue. Moments later, John and Elizabeth gravitate towards each other, finding themselves interlocked in each other's seemingly inescapable embrace.The following morning, John senses that he will never see her again. He attempts to share with her details about his life. Elizabeth tells him that it is too late as she leaves the apartment. John begins his mental countdown to 50, hoping she will come back by the time he is finished.","language":"English|Spanish|","box_office":"$100 million[2]","cinematography":"Peter Biziou","production_company":"Galactic Films Jonesfilm Producers Sales Organization Triple Ajaxxx","directed_by":"Adrian Lyne","Home media":"In 1998, Warner Bros. released an \"uncut, uncensored version\" on DVD that was 117 minutes.[8] The film was released on the Blu-ray format in the United States on March 6, 2012.","9½_weeks":"Theatrical release poster","Music":"The main single released from the 9½ Weeks: Original Motion Picture Soundtrack was \"I Do What I Do\", performed by Duran Duran bass guitarist John Taylor, giving his first solo singing performance during a hiatus in Duran Duran's career. The song reached #23 on the Billboard Hot 100 and #42 on the UK Singles Chart. Music for the score was composed by Taylor and Jonathan Elias. Original music for the movie was also written by Jack Nitzsche, but his compositions are not included on the soundtrack.The soundtrack also included tracks from Luba, Bryan Ferry, Dalbello, Corey Hart, Joe Cocker, Devo, Eurythmics and Stewart Copeland. Winston Grennan's reggae \"Savior\" as well as Jean Michel Jarre's \"Arpegiator\", played during the sex scene on the stairs in the rain, were not included on the record.","release_dates":"February 21, 1986 (1986-02-21)|||||","produced_by":"Mark Damon|Sidney Kimmel|Zalman King|Antony Rufus-Isaacs|","starring":"Kim Basinger|Mickey Rourke|","running_time":"117 minutes[1]","Derivative works":"In 1997, a sequel was released via direct-to-video called Another 9½ Weeks, starring Rourke and Angie Everhart and directed by Anne Goursaud.In 1998, a second straight-to-video film was released, this one a prequel called The First 9½ Weeks that starred Paul Mercurio and Clara Bellar.A parody to the original film, 9½ Ninjas!, was released in 1991.[9]","music_by":"Jack Nitzsche","edited_by":"Caroline Biggerstaff|Ed Hansen|Tom Rolf|Mark Winitsky|","Release":"In a preview screening of the film for 1,000 people, all but 40 walked out. Of the 40 who filled out cards, 35 said they hated it.[2]9½ Weeks has a 64% rating on Rotten Tomatoes based on 22 reviews.[5]The film was championed by some critics. Roger Ebert praised the film, giving it three and a half stars out of four, stating: \"A lot of the success of 9½ Weeks is because Rourke and Basinger make the characters and their relationship convincing.\" He further elaborated by saying that their relationship was believable, and unlike many other characters in other erotic films at that time, the characters in this movie are much more real and human.[6]Over time, some critics have warmed to the film and audiences gave it somewhat of a legacy thanks to its success in the rental market. It performed very well in Europe, particularly in Italy, France and also in Latin America. Its success in France was so strong that it played for five years at a Paris cinema, earning approximately $100 million.[7]The film was nominated for three categories at the 1986 Golden Raspberry Awards, Worst Actress (Kim Basinger, who lost to Madonna for Shanghai Surprise), Worst Original Song (\"I Do What I Do\" by Jonathan Elias, John Taylor, Michael Des Barres, which lost to \"Love or Money\" from Under the Cherry Moon), and Worst Screenplay (Patricia Louisianna Knop, Zalman King, Sarah Kernochan, which lost to Howard the Duck). The film gained a huge following on home video, and regardless of its reception, both Basinger and Rourke became huge stars.","budget":"$17 million"}