{"based_on":"Characters  by Jay Ward","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Hugh Wilson","Plot":"The story begins with three children and a horse. These are young versions of Dudley Do-Right, Nell Fenwick, Snidely Whiplash, and Horse. The three talk of their aspirations; Dudley believes he is destined to be a Royal Canadian Mounted Police officer (Mountie) while Nell wishes to see the world. Snidely, however, wishes to be the \"bad guy\" and travel around the world.Several years later, all three have fulfilled their supposed destinies. Dudley is now a Mountie (but always sticks to the rules and is frequently oblivious to even the most obvious of things), and Snidely has become an infamous bank robber. After Snidely and his gang rob a bank of its money and gold, Snidely tricks his entire gang into believing he has fled with the bulk of the cash to the Sudan and going on a wild goose chase after him. Snidely subsequently salts the stolen gold and spreads it in the lakes. Dudley catches him the act, but Snidely fools him into thinking he is vampire hunting, and uses a similar tactic to scare Horse off. Not long after, Nell returns from her world tour and reunites with Dudley. The two attend a festival at the nearby Kumquat tribe.Meanwhile, Prospector Kim J. Darling (Eric Idle), the poorest man in Semi-Happy Valley, stumbles across the gold in the river and is made into a media sensation by Snidely. The subsequent gold rush boosts Snidely's popularity and he quickly takes control of the town, renaming it \"Whiplash City\". Eventually, Snidely's men return from the Sudan to kill him for his deceit, but Snidely convinces them otherwise by offering them lives of luxury in his new town. Dudley becomes convinced that Snidely is up to something and confronts him, but Snidely laughs him off and snatches Nell from him. Snidely sends his second in command, Homer (Jack Kehler), to assassinate Dudley with a bomb, but Dudley is absent when the bomb goes off. Nell's father Inspector Fenwick (Robert Prosky), who is in good favor with Snidely, discovers Dudley's feud with Snidely and discharges Dudley from the Mounties. Dudley falls into a depression and wanders across the town until he runs into a drunken Darling, who offers him shelter at his underground cave in the woods. Darling tells Dudley of Snidely's plans and newfound popularity and takes him to see a Gala Ball in Snidely's honor. Despite Darling's warning not to challenge Snidely due to his loss of favor, Dudley comically attempts to take Nell back from Snidely, but loses pathetically.Feeling sympathy for Dudley, Darling decides to put him through a very harsh training regimen to make him a more formidable opponent and take back Semi-Valley from Snidely. Dudley's first act is to intimidate one of Snidely's men into telling him the next gold shipment. Dudley sabotages the shipment and leaves his mark on Snidely's workshop as well as his favorite golf course. Snidely is offended by this and more so with his men's incompetence to stop him, believing Dudley is enjoying the perks of being the villain. Eventually, Darling leaves to find his family and parts ways with Dudley thanking him for his friendship. Dudley then uses his new training to win Nell back from Snidely, who swears revenge. At a nighttime town meeting, Snidely attempts to rally the people against Dudley, but it falls on deaf ears. The populace have grown weary of Snidely and shows more respect for Dudley in his efforts to retake their town back. Snidely ultimately discovers that Dudley and Nell are at another festival with the Kumquat tribe and leads a full-scale attack on them. The Kumquats flee for their lives until Horse reappears and helps Dudley sabotage Snidely's tanks by making Snidely and Homer accidentally shoot each other. A cavalry of Mounties appears and arrests Snidely and his men. Darling also arrives with his wife (Jessica Schreier) and is reunited with Dudley, revealing that they called out the cavalry. Inspector Fenwick reinstates Dudley in the Mounties.The final scene shows Dudley and Nell living together in Dudley's rebuilt house. They share a kiss as the film closes.","language":"English","Reception":"The film received generally negative reviews from critics.[4][5] It currently has a 'Rotten' rating of 16% on Rotten Tomatoes, with the site's consensus stating \"[The] gags aren't that funny.\"[6]Chicago Sun-Times critic Roger Ebert gave the film a two and a half stars rating, writing: \"Dudley Do-Right is a genial live-action version of the old cartoon, with a lot of broad slapstick humor that kids like and adults wince at. I did a little wincing the ninth or 10th time Dudley stepped on a loose plank and it slammed him in the head, but I enjoyed the film more than I expected to. It's harmless, simple-minded, and has a couple of sequences better than Dudley really deserves.\"[7]The film was a box office bomb. In its opening weekend, it grossed $3,018,345 - ranking eleventh for the weekend - and went on to gross just $9,974,410 domestically[2] against a budget of $70 million.","box_office":"$10 million[2]","cinematography":"Donald E. Thorin","production_company":"Classic Media Davis Entertainment Jay Ward Productions Joseph M. Singer Entertainment","directed_by":"Hugh Wilson","narrated_by":"Corey Burton","release_dates":"August 27, 1999 (1999-08-27)|||||","Production":"The film was shot on-site in Vancouver, British Columbia and Santa Clarita, California.Dudley Do-Right was Fraser's second film based on a Jay Ward cartoon, 1997's George of the Jungle being the first. Despite the different studios producing each film (George of the Jungle was adapted by Disney), advertising for the Dudley Do-Right film made open reference to this coincidence: \"From the creator of George of the Jungle…and the star of George of the Jungle…and the acclaimed director who saw George of the Jungle…\"","dudley_do-right":"Theatrical release poster","produced_by":"John Davis|J. Todd Harris|Joseph M. Singer|","starring":"Brendan Fraser|Sarah Jessica Parker|Alfred Molina|Eric Idle|","running_time":"77 minutes[1]","music_by":"Steve Dorff","edited_by":"Don Brochu","budget":"$70 million"}