{"country":"United Kingdom Australia","distributed_by":"Weinstein Co.[2]","death_defying_acts":"Promotional movie poster","Plot":"In 1926, 13 years after his mother's death, illusionist Harry Houdini (Guy Pearce) has begun debunking mystics, psychics and others who claim to have paranormal powers. He offers US$10,000 to anyone who can quote his mother's dying words to him.Impoverished and uneducated Scottish con artist Mary McGarvie (Catherine Zeta-Jones) and her daughter Benji (Saoirse Ronan) set their sights on Houdini's reward when he visits Edinburgh on tour. Mary's psychic act pulls in the public: Benji surreptitiously gathers information on members of the audience, information Mary uses to con them into believing they can reach out to their deceased loved ones.Their only obstacle is Houdini's protective manager, Sugarman (Timothy Spall). Mary manages to charm the unsuspecting magician, but as they spend more and more time together, Sugarman intervenes, trying to prevent Houdini from becoming entangled with Mary, of whom he is suspicious.Sugarman's main desire is to see Mary and Benji gone; they claim they will be gone for good once they secure the reward for finding out what Houdini's mother said to him on her death bed. Sugarman realizes he can't get rid of them as easily as he had hoped. Mary is caught trying to open Houdini's chest and covers up by saying she was just searching for something to channel the psychic energy of the deceased.Benji gets the key to the chest from Sugarman. When Mary and Benji fail to turn up any useful information, they turn again to Sugarman. He tells them that Houdini was out doing a show and missed seeing his mother before she died. When the time comes, Mary is unable to perform the experiment and attempts to leave. At this point Benji starts having a fit on the ground and claims to be channelling Houdini's mother on her death bed, uttering the words of the Kaddish and addressing Houdini as \"Ehrich\", his real name, and speaking partly in German and partly in German-accented English asking where he is, and why he is not with her. This could be interpreted as either a genuine seance or a very skillful and convincing impersonation by the young artist. When the note he wrote to confirm the veracity of the experiment was removed from its safe and shown to be blank, Houdini reveals the \"eternal shame\" he feels because he wasn't able to reach his mother before she died, and thus was unable to comfort her in her moment of death, or to hear her final words. The McGarvies are awarded the $10,000.Mary is disgruntled because she believes Harry does not love her as she believed. When he says he does, they become romantically involved before Houdini leaves for his last performance, in Montreal. During his travels, he is climbing a set of stairs when a \"Red-Haired Prankster\" punches him in the stomach while he was not prepared, rupturing his appendix, eventually killing him.","language":"English","Critical reception":"The film received mixed reviews, with a 44% rating on Rotten Tomatoes.[7]","box_office":"$8,380,329","cinematography":"Haris Zambarloukos","directed_by":"Gillian Armstrong[1]","narrated_by":"Saoirse Ronan","release_dates":"13 September 2007 (2007-09-13) (Toronto International Film Festival)|10 March 2008 (2008-03-10) (Australia)|8 August 2008 (2008-08-08) (United Kingdom)|||","Production":"The film was shot on location in London and Edinburgh, and at Pinewood Studios, Buckinghamshire, produced by Myriad Pictures and is being distributed by The Weinstein Company. Guy Pearce spent six weeks learning Houdini's tricks from magician Ross Skiffington.[3] Magic consultant for the film was English magician Scott Penrose.","Box office":"Death Defying Acts earned $2,839,345 at the Spanish box office, $800,505 in South Korea, $713,741[4] in Australia and $608,455 in Mexico.[5] Globally, the film took $6,415,141.[6] It was on a very limited release in larger markets such as the United Kingdom, Canada and the United States, resulting in low box-office takings there.","produced_by":"Chris Curling[1] Marian Macgowan[1]","starring":"Guy Pearce[1] Catherine Zeta-Jones[1] Timothy Spall Saoirse Ronan[1]","running_time":"97 minutes","music_by":"Cezary Skubiszewski","edited_by":"Nicholas Beauman","written_by":"Tony Grisoni[1] Brian Ward[1]"}