{"based_on":"Death in Venice  by Thomas Mann","country":"Italy France","distributed_by":"Warner Bros.","screenplay_by":"Luchino Visconti Nicola Badalucco","Plot":"The protagonist, Gustav von Aschenbach, travels to Venice for health reasons. There, he becomes obsessed with the stunning beauty of an adolescent Polish boy named Tadzio who is staying with his family at the same Grand Hôtel des Bains on the Lido as Aschenbach.While the character Aschenbach in the novella is an author, Visconti changed his profession from writer to composer. This allows the musical score, in particular the Adagietto from the Fifth Symphony by Gustav Mahler, which opens and closes the film, and sections from Mahler's Third Symphony, to represent Aschenbach's writing. Apart from this change, the film is relatively faithful to the book, but with added scenes where Aschenbach and a musician friend debate the degraded aesthetics of his music.While Aschenbach attempts to find peace and quiet, the rest of the city is gripped by a cholera epidemic, and the city authorities do not inform the holiday-makers of the problem for fear that they will leave. As Aschenbach and the other guests make day-trips into the city centre, they begin to realize that something is seriously wrong. Aschenbach decides to leave, but in a moment of impulse decides to stay. However, he himself is dying.Rejuvenated by the presence of Tadzio—though they never actually converse—he visits the barber who, in his words, \"returns to you merely what has been lost\", dyeing his grey hair black and whitening his face and reddening his lips to try to make him look younger. As he leaves the barber's shop the barber exclaims: \"And now Sir is ready to fall in love as soon as he pleases\". Aschenbach continues to gaze at Tadzio from afar, the latter more aware that he is being gazed at. In the climactic scene, Aschenbach sees Tadzio being beaten up on the beach by an older boy. When released, Tadzio walks away from him alone towards the horizon. He suddenly turns back to look at Aschenbach, then turns away to face the sun, and stretches his arm out towards it. Aschenbach too, stretches his hand as if to reach Tadzio, and at that very moment—heightened by the crescendo in Mahler's Adagietto—he dies from the cholera infection. A few people notice him collapsed on his chair and alert the hotel staff. They carry Aschenbach's body away.","language":"English French Italian Polish","Critical reception":"Death in Venice holds a 76% \"fresh\" rating at Rotten Tomatoes.[2]Film historian Lawrence J. Quirk wrote, in his study, The Great Romantic Films (1974), \"Some shots of Björn Andrésen, the Tadzio of the film, could be extracted from the frame and hung on the walls of the Louvre or the Vatican in Rome.\" He says Andrésen did not represent just a pretty youngster as an object of perverted lust, but that novelist Mann and director-screen writer Visconti intended him as a symbol of beauty in the realm of Michelangelo's David or Da Vinci's Mona Lisa, the beauty that moved Dante to \"...seek ultimate aesthetic catharsis in the distant figure of Beatrice.\"In 2011, writer Will Aitken published Death in Venice: A Queer Film Classic, a critical analysis the film, as part of Arsenal Pulp Press's Queer Film Classics series.[3]","cinematography":"Pasqualino De Santis","directed_by":"Luchino Visconti","Behind the scenes":"In the second volume of his autobiography, Snakes and Ladders, Bogarde recounts how the film crew created his character's deathly white skin for the final scenes of the film, just as he dies. The makeup department tried various face paints and creams, none of which were satisfactory, as they smeared. When a suitable cream was found and the scenes were shot, Bogarde recalls that his face began to burn terribly. The tube of cream was found and written on the side was \"Keep away from eyes and skin\": the director had ignored this and had been testing it out, as small patches, on various members of the film crew, before finally having it applied to Bogarde's face.In another volume of his memoirs, An Orderly Man, Dirk Bogarde relates that, after the finished film was screened for them by Visconti in Los Angeles, the Warner Bros. executives wanted to write off the project, fearing it would be banned in the United States for obscenity because of its subject matter. They eventually relented when a gala premiere of Death in Venice was organized in London, with Elizabeth II and Princess Anne in attendance, to gather funds for the sinking city.","Awards":"25th Birthday Award (special award created for the occasion to decide between the two favorites for the Palme d'Or)[4]Best Art Direction, Best Cinematography, Best Costume Design, Best Sound TrackBest Director, Best Cinematography, Best Costume Design, Best Production Design.Best Costume DesignBest Actor, Best Direction, Best FilmGolden Palm (Best Film)[4]","release_dates":"March 1, 1971 (1971-03-01)","produced_by":"Luchino Visconti","starring":"Dirk Bogarde Silvana Mangano Romolo Valli Mark Burns Björn Andrésen","running_time":"130 min.","music_by":"Gustav Mahler","death_in_venice":"Theatrical poster","edited_by":"Ruggero Mastroianni","budget":"$2 million[1]"}