{"based_on":"Bridget Jones: The Edge of Reason  by Helen Fielding","country":"United Kingdom France Germany Ireland United States","distributed_by":"Universal Pictures","screenplay_by":"Andrew Davies Richard Curtis Adam Brooks Helen Fielding","Plot":"The film begins shortly before Bridget's mother's (Gemma Jones) annual Turkey Curry Buffet. Bridget (Renée Zellweger) is ecstatic about her relationship with Mark Darcy (Colin Firth). However, Bridget's confidence in her relationship is shattered when she meets Mark's colleague, the beautiful Rebecca Gilles (Jacinda Barrett). Bridget meets her ex, Daniel Cleaver (Hugh Grant), at her job for Sit-Up Britain and is offered a position as the \"Smooth Guidess\". Bridget initially refuses, quoting that Daniel Cleaver is a \"deceitful, sexist, disgusting specimen of humanity\". Bridget is delighted to be asked by Mark to go to the \"Law Council Dinner\", assuming he will propose afterwards, but because balding Tories quietly take offense at her ad hominem claim that depriving the poor of welfare is something advocated by balding Tories, the night does not end well.After the \"Law Council Dinner\", Mark and Bridget have an argument and she walks away from him. Mark goes to Bridget's apartment, apologizes, and tells her he loves her for the first time. Later in the night, Mark asks Bridget if she'd like to go on a ski holiday in Vorarlberg, Austria. Once on the slopes, she learns Rebecca recommended the vacation spot to Mark. While on the holiday, Bridget thinks she's pregnant and after an argument concerning the future of children, the test is negative. After they return home, Bridget and Mark have lunch with both of their parents. When the subject of marriage comes up during conversation, Bridget is hurt by Mark's comment that it's not something they're even thinking about yet.Bridget hears a message from Rebecca and discusses the message with one of her alleged \"friends\", who advises Bridget that if Mark says \"I refuse to dignify that question with an answer\", then you know he's having an affair. Bridget, hearing that answer, breaks up with Mark and goes with Daniel to Thailand to film \"The Smooth Guide\" with her friend, Shazzer (Sally Phillips). Bridget and Daniel flirt in Thailand. Bridget loses faith in Daniel again when she is in a hotel room and notices that a Thai prostitute has arrived for him. Daniel later says that the \"gorgeous Thai girl\" was revealed to be a \"gorgeous Thai boy\".While packing up for their trip back home, Shazzer asks Bridget to put Jed's (Paul Nicholls) gift in her bag. Bridget is arrested and sent to a Thai prison after airport security dogs recognize that there is a large stash of cocaine inside the gift. In prison, Bridget spends her time sharing relationship stories with the inmates and teaching them Madonna's \"Like a Virgin\". Mark arrives to tell Bridget that his superiors have sent him to put her release in motion. Bridget identifies Jed on a picture as the man who gave Shazzer the hidden cocaine. Mark walks away after clearly stating that he was just the messenger and stating that her sex life does not interest him. In Britain, Mark confronts Daniel for not helping Bridget when she was arrested, and they start a fight outside a museum. Eventually, Daniel swears off Bridget for good and sarcastically suggests that Mark \"just marry her.\"When Bridget arrives in Heathrow Airport, she is an international human rights celebrity. She is greeted by her parents who have been busy planning their vow renewal ceremony. At home, she is surprised by her friends who inform her that Mark was the one who tracked down Jed and forced him into custody in order to free her, in the process putting into motion the British Government, MI5, Interpol & many other diplomatic big-wigs. Hopeful that he still loves her, she runs to his house. She finds Rebecca there and assumes that there is a romantic relationship between Mark and her. Rebecca reveals that she is not seeking an affair with Mark. She is instead infatuated with Bridget, who is flattered, but politely turns her down.Bridget confronts Mark at his legal chambers and asks him to take her back. Mark proposes to Bridget and she accepts. The film ends with Bridget's parents renewing their vows and Bridget catching the bouquet.","language":"English German Thai","Reception":"Although the film received mostly negative reviews from critics, it was voted Evening Standard Readers' Film of 2004, was in the shortlist for the Orange Film of the Year award at 2005 BAFTAs and the second interpretation of Bridget gained Zellweger another Golden Globe nomination and the People's Choice Awards as Favorite Leading Lady of 2005.The film holds a 27% 'rotten' rating, with the consensus \"Edge of Reason is a predictable continuation to the Bridget Jones story, with too much slapstick and silliness.\"[1]Bridget Jones: The Edge of Reason opened in the United States on a limited release on November 12, 2004 and grossed $8,684,055, at #5 at the box office;[2] a week later, the film was given a wide release, again hitting #5 at the box office, this time with $10,044,890.[3] By the end of its theatrical run, it had grossed $40,226,215 domestically and $222,294,509 internationally, totaling $262,520,724 worldwide.[4]","bridget_jones:_the_edge_of_reason":"British theatrical release poster","box_office":"$262,520,724","cinematography":"Adrian Biddle","production_company":"StudioCanal Miramax Films Working Title Films Little Bird Limited","directed_by":"Beeban Kidron","DVD":"The film was released on DVD in 2004 with a variety of bonus features.","Soundtrack":"Uncut magazine gave the album three stars out of five stars, saying that \"[I]ts quality control is close to impeccable.\"[9] Allmusic called it \"a generally enjoyable, if slick, musical counterpart to the film's frothy romantic shenanigans.\"[10]","release_dates":"8 November 2004 (2004-11-08) (Netherlands, premiere)|12 November 2004 (2004-11-12) (United Kingdom)|19 November 2004 (2004-11-19) (United States)|||","Production":"During the fight scene between Daniel and Mark, it was for the most part not choreographed, instead, the actors were simply asked to fight each other any way they could. At one point in the film (where Bridget and Shazzer are at the Thai airport), Bridget indulges in a fantasy of Mark coming out of water in a wet white shirt, just like Colin Firth did in the 1995 BBC version of Pride and Prejudice. The poem that Daniel quotes from while passing Ko Panyi is the story of \"Phra Aphai Mani\" by Sunthorn Phu.One of the more significant differences between the novel and the film is that the film makes no mention of Bridget's fascination with the BBC television version of Jane Austen's Pride and Prejudice (Colin Firth starred in that production.)","produced_by":"Tim Bevan Eric Fellner Jonathan Cavendish","starring":"Renée Zellweger Hugh Grant Colin Firth Jim Broadbent Gemma Jones","running_time":"107 minutes","Sequel":"In July 2009, the BBC reported that a third film was in the early stages of production. On 1 March, 2011 it was reported that both Renée Zellweger and Colin Firth had shown interest in reprising their roles.[5] An announcement was made on August 11, 2011 that a third film was greenlit by Universal Pictures, Miramax and Working Title.[6]Colin Firth talked to The Chicago Sun Times in April 2013. \"Unfortunately, it might be a bit of a long wait,\" he said. \"I wouldn't say that it's completely dead in the water, but the way it's going, you might be seeing Bridget Jones' granddaughter's story being told by the time we get there.\"[7]In an interview in October 2014 Hugh Grant mentioned an existing script for a sequel, however also expressed his dislike for it and that he would not star in a third film.[8] Filming officially began on October 2, 2015. The movie will open on September 16, 2016.","music_by":"Harry Gregson-Williams","edited_by":"Greg Hayden","budget":"$40 million"}