{"country":"Australia United States","distributed_by":"Paramount Pictures","\"crocodile\"_dundee_ii":"Theatrical release poster","Plot":"A year has passed since the events of \"Crocodile\" Dundee, and Mick Dundee and Sue Charlton are living happily together in New York. Although Mick's ignorance of city life is a hazard when he attempts to continue his former lifestyle, like blast fishing in Manhattan's waters, Sue's writing has made him a popular public figure. He later goes to work for Leroy Brown, a mild-mannered stationery salesman trying to live up to his self-perceived 'bad guy in the streets' image.While working for the DEA in Colombia, Sue's ex-husband Bob (mentioned, but not seen, in the first movie) takes photographs of a drug cartel leader's murder of an unknown person, and is spotted by one of the cartel's sentries. He sends the photographs to Sue before being murdered himself. Colombian Cartel leader Luis Rico and his brother and top lieutenant, Miguel, go to New York City to retrieve the photos.The gangsters take Sue hostage, leading Mick to ask Leroy for help. Leroy contacts a local street gang, whom Mick asks to create a distraction by caterwauling at the mansion's perimeter, leading most of the cartel's guards on a wild goose chase while Mick rescues Sue. Rico is arrested but soon escapes police custody, and after a failed attempt by Rico to kill Sue, Mick decides to take Sue to Australia in order to fight on familiar ground. In Walkabout Creek, Mick is enthusiastically welcomed back by his friends. After provisioning, he and Sue take refuge on his personal land, named Belonga Mick (\"Mick's Place\"; see bilong in Tok Pisin). Here, Sue discovers that Mick legally owns land almost twice the size of New York State, including a gold mine.Rico and his men track their quarry to Australia, where they hire some local thugs to assist them, but their Aboriginal tracker abandons them when he hears that their quarry is Mick. As a replacement, the gangsters kidnap Mick's friend Walter and force him to guide them, but Mick saves his friend by faking an attempt on Walter's life. They then lead the gangsters on a false trail through the Outback territory, during which Mick, with the help of his Aboriginal friends, manages to reduce the opposition's numbers one by one, leaving the rest increasingly nervous. In the end, he retrieves Walter from Rico and Miguel, leaving the latter to face him alone.Tired of chasing Dundee, Rico sets a bushfire to corner Mick, but Mick regains the upper hand, captures Rico, and switches clothes with him in order to lure Miguel into a vulnerable position. Sue and Walter, observing them from a distance, mistake Mick for Rico and take shots at him. Walter shoots Mick, though not fatally, and Rico tries to escape but is shot by Miguel (who mistakes him for Mick). Rico loses his balance and falls to his death in a ravine. Miguel is in turn shot and killed by Sue. Though thinking at first that Mick is dead, they soon re-unite with him (Walter's bullet had only hit Mick in the side), and Sue and Mick embrace. When Mick asks her whether she is ready to go home, Sue replies \"I am home\", concluding the film.","language":"English","Reception":"The film did well at the box office but not with critics.[8] It was sixth-highest-grossing film of the year in the United States and earned more than $240 million worldwide. For its first six days of American release, its box office receipts of US$29.2 million exceeded those of Rambo III at $21.2 million.[9]\"Crocodile\" Dundee II received generally negative reviews from critics. Janet Maslin of The New York Times deemed the sequel to be inferior, noting \"the novelty has begun to wear thin, even if Mr. Hogan remains generally irresistible.\"[3] Review aggregator Rotten Tomatoes assessed a \"Rotten\" score of 11% with an average 3.5/10 rating.[10]","box_office":"$239.6 million[2]","cinematography":"Russell Boyd","directed_by":"John Cornell","release_dates":"20 May 1988 (1988-05-20) (Australia)|25 May 1988 (1988-05-25) (North America)|23 June 1988 (1988-06-23) (United Kingdom)|||","produced_by":"John Cornell","starring":"Paul Hogan|Linda Kozlowski|John Meillon|","running_time":"108 minutes","music_by":"Peter Best","edited_by":"David Stiven","Release":"The film opened 25 May 1988 in the United States and Canada.[3][4]\"Crocodile\" Dundee II was also a worldwide hit,[5] but not as big as its predecessor.The film grossed $24,916,805 in Australia,[6] which is equivalent to $48,843,593 in 2009 dollars.The film was released theatrically in the United States by Paramount Pictures in May 1988. It grossed $109,306,210 at the domestic box office.[5] It was the second highest grossing film that year for Paramount (second only to Coming to America) and the sixth highest grossing film at the United States box office.[7]","written_by":"Paul Hogan Brett Hogan","budget":"$14 million[1]"}