{"country":"United States","distributed_by":"Astor Pictures","Plot summary":"A dead John Doe is found on the beach and Detective Lieutenant Tony Ricco gets the case to solve. However, there are no clues whatsoever to the dead man's identity and Tony is all out of options to bring the investigation any closer to a finish. An old friend of his from Scotland Yard in London, Geoffrey James, comes to visit him, and Tony asks for some input on the case.After examining the body and the man's clothes, Geoffrey concludes he wore a Harris Tweed coat and had Sterling pound notes on him, and therefore has to be of English origin. Geoffrey also discovers a fluorescent paint on the coat, which would suggest it is the same paint as the one used to mark floating objects in water to easier spot and rescue them.Since the dead man had no water in his lungs he hasn't drowned,but maybe got the paint on him picking something up from the water, for example a life jacket.Geoffrey goes to the site on the beach where the body was found and discovers a life jacket as suggested, in a beachcomber shack. He puts it on over his own coat but then he is suddenly attacked by the beachcomber. A strange woman also appears with the beachcomber. Geoffrey easily fends off the attack and left is he and the strange woman, who doesn't want to reveal her name to him. Instead she runs away from him.Geoffrey runs after the woman but is knocked down by her friend. When he wakes up again, the life jacket is gone. Geoffrey changes tactics and looks into all the flights over the Atlantic ocean in the last few days, and eventually finds one where the bathroom window had been broken during the flight. He gets a beautiful flight attendant, Anne Hogan, to identify John Doe at the morgue as a Mr. Rodine, who worked as a diplomat and could pass through customs unchecked.He meets up with Tony again, and the American colleague presents a theory about Geoff being in the U.S. to track down the gang members who were behind a very large hit on a jewelry store. Geoffrey confesses that he indeed suspects Mr. Rodine of involvement in the theft. He guesses that Rodine could have dropped the jewels into the ocean from the plane, using a life jacket to hold them afloat.When Geoffrey speaks to the British consul he finds out that Rodine was killed a few days ago, long before the flight took place. Thus, the police still has no clue as to whom was found dead on the beach.Geoffrey and the flight attendant go on a search for the supposed seaplane that could have been used to pick up the jewels from the surface. They find that a pilot named Joe King has flown a plane with Rodine out to sea to retrieve the jewels. When they later meet the strange woman from the beach, the flight attendant identifies her as one Irene Trilling, who was also a passenger on the same flight as the man pretending to be Mr. Rodine.Irene runs off again, but her friend is another passenger from the flight, whose name is Frank Farrington. When they talk to the pilot, he finally identifies the man posing as Mr. Rodine as Louis Gannet, a known criminal and con artist. King also tells them that he witnessed Farrington kill Gannet after they had retrieved the jewels. Farrington then seemed to believe that King had taken the jewels from Gannet.Since neither Farrington not King has the jewels, someone else must have taken them. Geoffrey guesses that the beachcomber might have found them together with the life jacket, and goes back to the shack to look. He finds the jewels hidden in a lobster tank and takes them with him to Anne, the flight attendant, who has gone to find Irene and Farrington.Farrington suspects that Gannet and Irene were trying to trick him, and he shoots and kills Irene before Geoffrey and Anne arrives. He also tries to kill Goffrey, but he is saved by Blake, an undercover policeman who has posed as a drunk and kept an eye on the Englishman during the investigation.[1]","language":"English","cinematography":"James S. Brown Jr.","directed_by":"Leslie Goodwins","release_dates":"August 16, 1947 (1947-08-16)|||||","produced_by":"Maurice Conn David Permut","starring":"Henry Wilcoxon Mary Brian Douglass Dumbrille Virginia Dale Don C. Harvey and Ralph Dunn","running_time":"71 minutes","music_by":"Irving Gertz","edited_by":"William D. Gordeon Richard Halsey","written_by":"Harry Essex Barbara Worth"}