{"based_on":"The Murder of Bob Crane by Robert Graysmith","country":"United States","Awards and nominations":"Paul Schrader was nominated for the Golden Seashell at the San Sebastián International Film Festival.[citation needed] Willem Dafoe was nominated for Best Supporting Actor by the Chicago Film Critics Association but lost to Tim Robbins for Mystic River.[citation needed]","distributed_by":"Sony Pictures Classics","language":"English","auto_focus":"Theatrical release poster","Critical reception":"The film met with a largely positive reception from critics. A.O. Scott of the New York Times said the film \"gets to you like a low-grade fever, a malaise with no known antidote. When it was over, I wasn't sure if I needed a drink, a shower or a lifelong vow of chastity ... there is [a] severe, powerful moralism lurking beneath the film's dispassionate matter-of-factness. Mr. Schrader is indifferent to the sinner, but he cannot contain his loathing of the sin, which is not so much sex as the fascination with images ... To argue that images can corrupt the flesh and hollow out the soul is, for a filmmaker, an obviously contradictory exercise, but not necessarily a hypocritical one. There is plenty of nudity in Auto Focus, but you can always glimpse the abyss behind the undulating bodies, and the director leads you from easy titillation to suffocating dread, pausing only briefly and cautiously to consider the possibility of pleasure.\"[5]Roger Ebert of the Chicago Sun-Times gave the film four stars calling it \"a hypnotic portrait ... pitch-perfect in its decor, music, clothes, cars, language and values ... Greg Kinnear gives a creepy, brilliant performance as a man lacking in all insight ... Crane was not a complex man, but that should not blind us to the subtlety and complexity of Kinnear's performance.\"[6]Edward Guthmann of the San Francisco Chronicle called it \"a compelling, sympathetic portrait ... Kinnear undercuts the seaminess of the Crane story, and shows us a man with more dimension and complexity than his behavior might suggest.\"[7]Peter Travers of Rolling Stone awarded it 3½ out of 4 stars and added, \"Schrader, the writer of Taxi Driver and the director of American Gigolo, is a poet of male sexual pathology. Shot through with profane laughs and stinging drama, Auto Focus ranks with his best films.\"[8]Todd McCarthy of Variety called it \"one of director Paul Schrader's best films, and like Boogie Nights ranks as a shrewd exposé of recent Hollywood's slimy underside ... Schrader directs with a very smooth hand, providing a good-natured and frequently amusing spin to eventually grim material that aptly reflects the protagonist's almost unfailing good humor ... Pic overall has an excellent L.A. period feel without getting elaborate about it, and musical contributions by Angelo Badalamenti and a host of pop tunes are tops.\"[9]The film has an 72% approval rating on review-aggregation website Rotten Tomatoes, based on 158 reviews.[citation needed]","box_office":"$2.7 million","Synopsis":"Disc-jockey-turned-actor Bob Crane develops a secret personal life, focusing on his relationship with John Henry Carpenter, an electronics expert involved with the nascent home video market. Encouraged by Carpenter and enabled by his expertise, Crane—a church-going, clean-cut family man—becomes a sex addict obsessed with women and with recording his encounters using video and photographic equipment, usually with Carpenter participating. With the passing of the years the relationship between Crane and Carpenter unravels in a dangerous way.","cinematography":"Jeffrey Greeley Fred Murphy","production_company":"Propaganda Films Good Machine","directed_by":"Paul Schrader","Production notes":"The film premiered at the Toronto Film Festival and was shown at the San Sebastián Film Festival, the Helsinki International Film Festival, the Chicago International Film Festival, the New Orleans Film Festival, and the Bergen International Film Festival before going into limited release on eleven screens in the US, earning $123,761 on its opening weekend. It grossed $2,063,196 in the US and $641,755 in foreign markets for a total worldwide box office of $2,704,951.[4]The DVD release includes a 50-minute documentary, Murder in Scottsdale, which delves into the initial murder investigation and the reopening of the case some 15 years later.[citation needed]","release_dates":"October 18, 2002 (2002-10-18)|||||","produced_by":"Scott Alexander and Larry Karaszewski Alicia Allain Patrick Dollard Brian Oliver Todd Rosken","starring":"Greg Kinnear Willem Dafoe Rita Wilson with Maria Bello and Ron Leibman","running_time":"105 minutes","music_by":"Angelo Badalamenti","edited_by":"Kristina Boden","Criticism by Scotty Crane":"Bob Crane's son, Scotty, bitterly attacked the film as being inaccurate. In an October 2002 piece he wrote on the movie, Scotty said that his father was not a regular church-goer and had only been to church three times in the last dozen years of his life, including his own funeral. There is no evidence that Crane engaged in S&M, and director Paul Schrader told Scotty that the S&M scene was based on Schrader's own personal experience. Scotty claims that his father and John Carpenter did not become close friends who socialized together until 1975, and that Crane was a sex addict long before he became a star, recording his sexual encounters at least as early as 1956.[10]Scotty and his mother had shopped a rival script for a Bob Crane movie biography. The spec script, alternately titled \"F-Stop\" and \"Take Off Your Clothes and Smile\", was written up in Variety by venerable columnist Army Archerd, but after Auto-Focus was announced, interest in Scotty's script ceased.[11]","written_by":"Michael Gerbosi","budget":"$7 million"}