{"country":"United States","distributed_by":"Columbia Pictures","Plot":"A successful Manhattan couple, lawyer Paul Michael Morgan (Hugh Grant) and real estate agent Meryl Judith Morgan (Sarah Jessica Parker), are separated due to Paul's infidelity. After dinner one night, Meryl and Paul witness the murder of one of Meryl's real estate clients. Then they become targets of contract killer Vincent (Michael Kelly) and must enter the Witness Protection Program.Paul and Meryl are relocated to the small town of Ray, Wyoming and placed temporarily under the protection of husband and wife/sheriff and deputy, Clay and Emma Wheeler (Sam Elliot and Mary Steenburgen). For their own safety, they are permitted no outside contact via telephone or e-mail. They have trouble adjusting to small-town life, but after an unfortunate encounter with a bear and bumbling attempts at shooting rifles, chopping wood, and horseback riding, they eventually adjust and begin assisting the local citizens professionally. Meanwhile, neither of their assistants back in NY know their whereabouts. Vincent plants a bug at Meryl's office and in her assistant Jackie's purse, hoping to gain information, which is eventually successful.Jackie attempts to call Meryl but Paul's assistant Adam stops her by kissing her, which she responds to by tasering him. Paul and Meryl go on a \"date\" in town and begin to reconcile, but then Paul is alienated when he learns that Meryl had a one-night stand with one of their acquaintances during their separation. The next day, with Vincent in town unbeknownst to them, the Morgans anticipate leaving Ray for a permanent hiding place. The Wheelers invite them to a rodeo, but the Morgans are quarreling, so they decline. Leaving the Morgans without any form of security, the Wheelers leave for the rodeo. Vincent tries to attack the house but is accosted by a bear, which gives the Morgans sufficient warning to allow them to escape. They flee on horseback to the rodeo to seek assistance. Vincent follows them to the rodeo, they spot him and hide in a bull suit. However, they end up in the ring with a bull, which then charges them, injuring Meryl. Meryl, unable to walk, stays hidden from Vincent while Paul confronts him with a canister of bear repellent spray. Paul accidentally sprays himself in the face, alerting Vincent who then holds Paul at gun-point. The Morgans are rescued by the Wheelers and their new friends from the town.Six months later, Paul and Meryl have repaired their marriage. They have an adopted baby girl from China, named Rae in honor of the Wyoming town, and Meryl is pregnant with their biological child. Jackie and Adam are dating.","language":"English","Reception":"The film has received generally negative reviews. Metacritic described reviews as \"generally unfavorable\", with an average score of 26 based on 25 reviews.[4] As of December 20, 2009, 12% of 120 critics listed by review aggregation website Rotten Tomatoes had given the film a positive review, with an average rating of 3.4/10.[5] Sarah Jessica Parker was nominated for a Golden Raspberry Award as Worst Actress for her performance, but lost to Sandra Bullock for All About Steve.In its first opening weekend, the film opened at #4 in the United States box office raking in $6,616,571. With a budget of $58 million, Did You Hear About the Morgans? grossed only $29.5 million domestically at the box office. It did a little better overseas, earning an additional $56 million, for a total of $85 million worldwide.","box_office":"$85.3 million[2]","cinematography":"Florian Ballhaus","production_company":"Relativity Media Castle Rock Entertainment Banter Films","directed_by":"Marc Lawrence","Home media":"Did You Hear About the Morgans? was released on DVD and Blu-ray on March 16, 2010.[6]The DVD features:","did_you_hear_about_the_morgans?":"Theatrical release poster","release_dates":"December 18, 2009 (2009-12-18)|||||","Production":"Filming for Did You Hear About the Morgans took place over 25 days in May and June in 2009. The film was shot in New York City, Santa Fe, New Mexico, and Roy, New Mexico.[3]","produced_by":"Martin Shafer Liz Glotzer","starring":"Hugh Grant Sarah Jessica Parker Sam Elliott Mary Steenburgen Elisabeth Moss Wilford Brimley David Call Michael Kelly","running_time":"103 minutes[1]","music_by":"Theodore Shapiro","edited_by":"Susan E. Morse","written_by":"Marc Lawrence","budget":"$58 million[2]"}