{"based_on":"Driving Miss Daisy by Alfred Uhry","Cast":"Warner Bros. originally wanted Eddie Murphy and Bette Midler to play Hoke and Daisy respectively.[5]","country":"United States","distributed_by":"Warner Bros.[1]","screenplay_by":"Alfred Uhry","Plot":"In 1948, Mrs. Daisy Werthan, or Miss Daisy, (Jessica Tandy), a 72-year-old wealthy, white, Jewish, widowed, retired school teacher, lives alone in Atlanta, Georgia, except for a black housemaid named Idella (Esther Rolle). When Miss Daisy wrecks her car, her son, Boolie (Dan Aykroyd), hires Hoke Colburn (Morgan Freeman), a black chauffeur. Miss Daisy at first refuses to let anyone else drive her, but gradually gives in.As Miss Daisy and Hoke spend time together, she gains appreciation for his many skills. After Idella dies in 1962, rather than hire a new maid, Miss Daisy decides to care for her own house and have Hoke do the cooking and the driving.The film explores racism against blacks, which affects Hoke at that time. The film also touches on anti-semitism in the South. After her synagogue is bombed, Miss Daisy realizes that she is also a victim of prejudice. But American society is undergoing radical changes, and Miss Daisy attends a dinner at which Dr. Martin Luther King gives a speech. She initially invites Boolie to the dinner, but he declines, and suggests that Miss Daisy invite Hoke. However, Miss Daisy only asks him to be her guest during the car ride to the event and ends up attending the dinner alone, with Hoke insulted by the manner of the invitation, listening to the speech on the car radio outside.Hoke arrives at the house one morning in 1971 to find Miss Daisy agitated and showing signs of dementia. Hoke calms her down. Boolie arranges for Miss Daisy to enter a retirement home. In 1980, Hoke, now 85, retires. Boolie and Hoke drive to the retirement home to visit Miss Daisy, now 97.[clarification needed] As Hoke feeds her pumpkin pie, the image fades, with a car driving away in the distance.","language":"English Hebrew","Reception":"Driving Miss Daisy was given a limited release on December 15, 1989, earning $73,745 in three theaters. The film was given a wide release on January 26, 1990, earning $5,705,721 over its opening weekend in 895 theaters. The film ultimately grossed $106,593,296 in North America and $39,200,000 in other territories for a worldwide total of $145,793,296.[3]Driving Miss Daisy was well received by critics, with particular emphasis on Morgan Freeman and Jessica Tandy's performances. The review aggregator Rotten Tomatoes gives the film a score of 82% based on reviews from 55 critics, with an average score of 7.2/10. The site's consensus states: \"Warm and smartly paced, and boasting impeccable performances from Morgan Freeman and Jessica Tandy.\"[6] On Metacritic, which assigns a rating out of 100 based on reviews from mainstream critics, the film has a score of 81 based on 16 reviews, indicating \"universal acclaim\".[7] CinemaScore similarly reported that audiences gave the film a rare \"A+\" grade.[8]Gene Siskel of the Chicago Tribune declared Driving Miss Daisy one of the best films of 1989.[9] Roger Ebert of the Chicago Sun-Times called it \"a film of great love and patience\" and wrote, \"It is an immensely subtle film, in which hardly any of the most important information is carried in the dialogue and in which body language, tone of voice or the look in an eye can be the most important thing in a scene. After so many movies in which shallow and violent people deny their humanity and ours, what a lesson to see a film that looks into the heart.\"[10] Peter Travers of Rolling Stone also gave the film a positive review, calling Tandy's performance \"glorious\" and opining, \"This is Tandy's finest two hours onscreen in a film career that goes back to 1932.\"[11] The performances of Tandy and Freeman were also praised by Vincent Canby of The New York Times, who observed, \"The two actors manage to be highly theatrical without breaking out of the realistic frame of the film.\"[2]Driving Miss Daisy also achieved the following distinctions at the 62nd Academy Awards:Driving Miss Daisy also won three Golden Globe Awards (Best Picture, Best Actor Morgan Freeman, and Best Actress Jessica Tandy) in the Comedy/Musical categories.[14] At the 1989 Writers Guild of America Awards, the film won in the Best Adapted Screenplay category. Rounding out its United States awards, the film won both Best Picture and Best Actor from the National Board of Review of Motion Pictures. In the United Kingdom, Driving Miss Daisy was nominated for four British Academy Film Awards, with Jessica Tandy winning in the Best Actress category. Jessica Tandy and Morgan Freeman won the Silver Bear for the Best Joint Performance at the 40th Berlin International Film Festival.[15]","driving_miss_daisy":"Theatrical release poster","box_office":"$145.8 million[3]","Home release":"The film was successful on home video.[16] The film was released on DVD in the USA on April 30, 1997 and the special edition was released on February 4, 2003. The movie was first released on Blu-ray disc in Germany and finally was released on Blu-ray in the US in a special edition digibook in January 2013 by Warner Bros.","cinematography":"Peter James","production_company":"The Zanuck Company","directed_by":"Bruce Beresford","Soundtrack":"The film's score was composed by Hans Zimmer, who won a BMI Film Music Award and was nominated for a Grammy Award for Best Instrumental Composition Written for a Motion Picture or for Television for his work. The score was performed entirely by Zimmer, done electronically using samplers and synthesizers, and did not feature a single live instrument. There is a scene, however, in which the \"Song to the Moon\" from the opera Rusalka by Antonín Dvořák is heard on a radio as sung by Gabriela Beňačková. The soundtrack was issued on Varèse Sarabande.","release_dates":"December 13, 1989 (1989-12-13)|||||","produced_by":"Richard D. Zanuck Lili Fini Zanuck","starring":"Morgan Freeman|Jessica Tandy|Dan Aykroyd|Patti Lupone|Esther Rolle|","running_time":"100 minutes","music_by":"Hans Zimmer","edited_by":"Mark Warner","budget":"$7.5 million[1]"}