{"Cast":"The film features Michael Jenn as Barclay, Robert Addie as Delahay, Rupert Wainwright as Donald Devenish, Tristan Oliver as Fowler, Piers Flint-Shipman (credited as Frederick Alexander) as Jim Menzies, and Anna Massey as Imogen Bennett. Charles Spencer, 9th Earl Spencer, the younger brother of Diana, Princess of Wales, is an extra (with no dialogue) in three scenes.Rupert Everett also played the role of Bennett in the play's first run.","country":"United Kingdom","distributed_by":"20th Century Fox (UK) Orion Classics (US)","Plot summary":"The setting is a 1930s Eton-esque public school, where Guy Bennett (Rupert Everett) and Tommy Judd (Colin Firth) are friends because they are both outsiders in their own ways. Bennett is openly gay. Judd is a Marxist.One day, a teacher walks in on Martineau (Philip Dupuy) and a boy from another house engaged in mutual masturbation. Martineau subsequently kills himself and chaos erupts as teachers and the senior pupils try their hardest to keep the scandal away from parents and the rest of the outside world. The gay scandal however gives the army-obsessed house captain Fowler (Tristan Oliver) a welcome reason to scheme against Bennett. Fowler dislikes him and Judd and wants to stop Bennett from becoming a \"God\" - a school title for the two top prefects. Fowler is able to intercept a love letter from Bennett to James Harcourt (Cary Elwes). Bennett agrees to be punished with a whipping so as not to compromise Harcourt; whereas on earlier occasions, he had blackmailed the other \"Gods\" with their own \"experiences\" with him to avoid punishment.Meanwhile, Judd is reluctant to become a prefect, since he feels that he cannot endorse a \"system of oppression\" such as this. He makes a memorable, bitter speech about how the boys oppressed by the system grow up to be the fathers who maintain it. Eventually however he agrees to become a prefect in order to prevent the hateful Fowler from becoming Head of House. This never comes about because Donald Devenish (Rupert Wainwright) agrees to stay at school and become a prefect if he is nominated to become a God instead of Bennett.Devastated at the loss of his cherished dream of becoming a God, Bennett comes to realize that the British class system strongly relies on outward appearance and that to be openly gay is a severe hindrance to his intended career as a diplomat.The film's epilogue states that he defected to Russia later in his life, after having been a spy for the Soviet Union. Judd died fighting in the Spanish Civil War.","Title":"The title refers not only to Soviet Russia, which is the \"other country\" Bennett turns to in the end, but it can be seen to take on a number of different meanings and connotations. It could be a reference to the first line of the second (or third, depending on the version) stanza of the hymn I Vow to Thee, My Country, which is sung in both the play and film, as well as referring to the fact that English public school life in the 1930s was indeed very much like \"another country\". In the hymn, the other country referred to is Heaven (or the Kingdom of Heaven), although this allusion does not appear to relate to the film in any way.Another Country is also the title of a novel by James Baldwin, which includes gay and bisexual characters.The Go-Between is a novel by L.P. Hartley (1895-1972), published in London in 1953. The novel begins with the famous line:The most direct reference is to several well-known lines from British literature, originating from Christopher Marlowe's play, The Jew of MaltaFriar Barnadine: \"Thou hast committed--\" Barabas: \"Fornication-- but that was in another country; / And besides, the wench is dead.\"Here \"the wench\" may refer to Martineau. Most of the students are more interested in covering up a potential scandal than worrying about the actual death. If so, the \"adultery\" may refer to what is done to Martineau and perhaps all students by the school, rather than his actual sexual liaisons.","language":"English","cinematography":"Peter Biziou","production_company":"Virgin Goldcrest Films NFFC Eastern Counties Newspapers, Ltd.","directed_by":"Marek Kanievska","Awards":"The film was entered into the 1984 Cannes Film Festival where it won the award for Best Artistic Contribution.[4][5]It was nominated for three BAFTA Awards in film: Editing (1984) Gerry Hambling, Most Outstanding Newcomer to Film (1984) Rupert Everett, and Adapted Screenplay (1984) Julian Mitchell [6]","release_dates":"29 June 1984 (1984-06-29)|||||","Production":"Eton College declined the opportunity to be featured as a location for the film.[1] With an additional fountain brought in, the Old Schools Quadrangle at Oxford University became an important location, along other localities such as the Bodleian Library, Brasenose College, Brasenose Lane, and Broad Street. Many interiors were shot at Althorp, seat of the famous Spencer family.[1] Other scenes were filmed at Apethorpe Hall.[2][3]","produced_by":"Alan Marshall Robert Fox","starring":"Rupert Everett Colin Firth Cary Elwes","running_time":"90 minutes","another_country":"DVD cover","music_by":"Michael Storey","edited_by":"Gerry Hambling","written_by":"Julian Mitchell"}