{"country":"United Kingdom","distributed_by":"Drafthouse Films","Accolades":"","language":"English","Reception":"20,000 Days on Earth received general acclaim upon its premiere at the 2014 Sundance Film Festival. Review aggregator Rotten Tomatoes reports that 97% of 38 film critics have given the film a positive review, with a rating average of 7.4 out of 10.[19] On Metacritic, which assigns a weighted mean rating out of 100 reviews from film critics, the film holds an average score of 84, based on 15 reviews, indicating \"universal acclaim\".[20]Cory Everett of Indiewire praised the film and said that \"While the doc should prove essential for Nick Cave fans, it should be inspiring for those interested in the creative process or anyone searching for their muse.\"[21]John Semley of Slant Magazine gave the film two and a half stars out of four and said that \"While the film is seemingly accessible as a portrait of an artist who seems particularly attuned to his own creative process, and particularly adept at describing this attunement, it's unlikely that many who aren't already whole-hog Bad Seeds fans would be able to stomach much of Cave's self-styled pomposity.\"[22]Rob Nelson, in his review for Variety, praised the film by saying that \"This innovative study of Nick Cave playfully disguises itself as fiction while more than fulfilling the requirements of a biographical documentary.\"[23]David Rooney in his review for The Hollywood Reporter said that \"What makes 20,000 Days on Earth distinctive is that it provides an overview of the man and his art while creating the illusion that this has come together organically -- out of poetic ruminations, casual encounters, ghost-like visitations and good old Freudian psychoanalysis.\"[24]","box_office":"$2,095,156[1]","Synopsis":"The film depicts a fictitious 24-hour period in the life of Australian musician, model, songwriter, author, screenwriter, composer and actor Nick Cave,[11] prior to and during the recording of his 2013 album Push the Sky Away.","cinematography":"Erik Wilson","production_company":"Corniche Pictures BFI Film4 Pulse Films","directed_by":"Iain Forsyth Jane Pollard","Releases":"The film also premiered at 64th Berlin International Film Festival in Panorama Dokumente section, in February 2014[12][13][14] and at the 2014 True/False Film Festival.[15] It also served as the opening night film at 2014 Sydney Film Festival on 4 June 2014.[16][17]It released on 19 September 2014 in United Kingdom.[18]","release_dates":"20 January 2014 (2014-01-20) (Sundance Film Festival)|17 September 2014 (2014-09-17) (United States)||||","produced_by":"Dan Bowen Alex Dunnett James Wilson","running_time":"95 minutes","20,000_days_on_earth":"Theatrical release poster","music_by":"Warren Ellis","edited_by":"Jonathan Amos","written_by":"Iain Forsyth Jane Pollard Nick Cave"}