{"Cast":"Cast notes:","country":"United Kingdom","distributed_by":"United Artists","Plot":"Harry Palmer (Michael Caine), who has left MI5 to work as a private investigator, is told by a mechanical voice on the phone to take a package to Helsinki. The package contains six virus-laden eggs that have been stolen from the British government's research facility at Porton Down. In Helsinki, he is met by Anya (Françoise Dorléac) who takes him to meet her handler, Harry's old friend Leo Newbigen (Karl Malden). Leo is in love with Anya, but Harry knows that she is only pretending to reciprocate. Leo takes Harry to a secret room where a computer issues daily instructions to Leo and Anya. The computer speaks in the same voice as the one which summoned Harry to Helsinki.After determining that he cannot trust either Leo or Anya, Harry is abducted by his former MI5 superior, Colonel Ross (Guy Doleman), who coerces him into working once more for the British government in pursuing the conspiracy. Harry is ordered to Latvia where he embeds with some rebels to obtain intelligence for Leo's operation. After being captured and left for dead, Harry is extracted from Russia by Colonel Stok (Oskar Homolka), an old acquaintance from the KGB. Back in Helsinki, Anya tries to kill Harry while seducing him, then confesses that the computer told her to kill him. Harry locks her in a room and waits for Leo at the computer's location. Leo offers to pay off Harry for his trouble, but Harry insists on half of the money Leo is getting from whatever the conspiracy is all about.The pair go to Texas, where Harry meets oil tycoon General Midwinter (Ed Begley). The General proudly displays his billion-dollar 'brain', a room full of computers that dispenses orders to his agents around the world. The General is in the midst of planning a rebellion in Latvia which he thinks will trigger the fall of the Soviet Union. His plan is to infect the Red Army with the viruses, while using his Latvian agents to begin a rebellion as his own private army invades. Meanwhile, Leo subverts the General's computer orders and escapes with the eggs. The General realises Harry is a double agent, but Harry convinces him that he can track Leo down.Back in Helsinki, Leo and Anya board a train for the Soviet Union with the eggs, but Harry, accompanied by two of Midwinter's men, intercepts them and escorts Leo off the train with the eggs. Anya shoots Harry's bodyguards as the train pulls away from the station. Leo runs after the train and hands the eggs to Anya. As he tries to pull himself up, Anya pushes him off the train and shrugs as he looks at her in bewilderment. \"She used me,\" Leo tells Harry. He then offers to help Harry stop the General's insane plan, which could trigger World War III.In personnel carriers made from oil tanker trucks from his company, the General leads his private army across the frozen Baltic Sea into Latvia. Harry and Leo attempt to catch up with the General, but he orders their car to be fired upon and Leo is killed. Meanwhile, Col. Stok is fully aware of the invasion and orders bombers to intercept the convoy. Rather than dropping their bombs directly on the convoy, they simply drop the bombs on the ice in the convoy's path, breaking the ice (a homage to the 1938 film Alexander Nevsky).[4] The entire convoy plunges into the freezing water, and all the vehicles and soldiers — including the General himself — sink below the ice to a cold, watery, Baltic grave.Harry awakes alone on an ice floe. Col. Stok arrives in a helicopter with Anya and the eggs. He gives the eggs to Harry. \"We don't need them,\" he says, \"We have our own ideas.\" Stok confirms that Anya is one of his spies. Back in London, Harry delivers the eggs to Colonel Ross, who agrees to reward Harry with a promotion. However, when he opens the package to inspect the eggs, he finds they have hatched and the box is full of baby chicks.","language":"English","Reception":"The film has 60% approval on Rotten Tomatoes. Author and critic Anne Billson calls this \"by far\" the best film of the series, noting that critics and audiences did not like it on first release.[7]","box_office":"$1,500,000 (US/ Canada)[1]","cinematography":"Billy Williams","production_company":"Jovera S.A. Lowndes Productions Limited","directed_by":"Ken Russell","Soundtrack":"The score is by Richard Rodney Bennett. To create a relentless, harsh mood, he left out sweet-sounding instruments like violins and flutes and relied mainly on brass and percussion[8] including three pianos, which are featured prominently in the main theme, and later, together with the percussion, create sonorities similar to Stravinsky's Les Noces. The score is basically monothematic, constantly varying the main theme. For more romantic moods, it features the ondes Martenot, an early electronic instrument, played by its most prominent soloist, Jeanne Loriod. Thus, even the tender moments have an eerie undertone.Later on, Harry Palmer attends the end of a symphony concert, which is supposed to feature Dmitri Shostakovich's \"Leningrad\" Symphony, written in 1941 during the siege of Leningrad. What we hear, however, is the end of Shostakovich's 11th Symphony \"The Year 1905\". Yet, music from the \"Leningrad\" symphony is featured later on during Midwinter's speech to his soldiers in Finland and during the final battle on the ice.","billion_dollar_brain":"original film poster","release_dates":"20 December 1967 (US)","Production":"Principal photography took place from 30 January to the end of May 1967.[5] Approximately five weeks later, on 26 June, Françoise Dorléac was killed in an automobile accident in Nice, France. It is unclear whether or not her voice was dubbed by another actress, due to her death.Location filming for Billion Dollar Brain took place in Helsinki and other parts of Finland, including Turku. The Riga scenes were filmed in Porvoo, also in Finland. Scenes involving \"The Brain\" were filmed in Honeywell facilities and featured a Honeywell 200 mini-computer. The remainder of the film was shot in the United Kingdom. Scenes on the ice were filmed on a disused airfield which was covered with a layer of salt. All other scenes were shot at Pinewood Studios, including the scene where Midwinter's convoy falls through the broken ice - this was done in a giant tank with slabs of polystyrene used to represent the ice itself. The large size of the tank was deemed necessary because of the decision to use real vehicles instead of miniatures.Otto Heller – who had photographed the first two Harry Palmer films – was supposed to shoot the film but would not submit to a medical examination and so the production could not hire him.[6]","produced_by":"Harry Saltzman","starring":"Michael Caine Karl Malden Ed Begley Oscar Homolka Françoise Dorléac","running_time":"111 minutes","music_by":"Richard Rodney Bennett","edited_by":"Alan Osbiston","written_by":"Len Deighton (novel) John McGrath"}