{"Cast":"The film also features several cameos, including Gary Payton, Karl Malone, Phil Jackson, Jeff Garlin, Dyan Cannon, Edward Norton and Shaquille O'Neal as themselves.","country":"United States","distributed_by":"New Line Cinema1","screenplay_by":"Paul Zbyszewski Craig Rosenberg","story_by":"Paul Zbyszewski","Plot":"Master thief Max Burdett (Pierce Brosnan) and his beautiful accomplice, Lola Cirillo (Salma Hayek), steal the second of three famous diamonds, known as the Napoleon diamonds, from FBI Agent Stanley P. Lloyd (Woody Harrelson). But Lloyd shoots Max before passing out from being gassed by the thieves. Max survives and tells Lola to get the diamond. She does, leaving in its place the one-dollar bill that she had received as a tip for washing the agents' windshield (while in disguise). Max and Lola then fly to Paradise Island in The Bahamas.Agent Lloyd shows up 6 months later and accuses Burdett of planning to steal the third Napoleon daimond, which is on a cruise ship that will be docking for a week on the island. He denies this, and unwittingly turns the tables and befriends the frustrated detective Lloyd, showing him the pleasures that Paradise Island has to offer, even paying for the most expensive suite, the bridge suite, for as long as Lloyd is there. Lloyd, out of his element, adapts quickly to the easy-going Caribbean lifestyle and partners up with Sophia, a local constable, to try and capture Max at last when he steals the diamond, which Max visits and later gives in to the temptation to steal. Henri Mooré, a powerful, popular tycoon thought of by some as a gangster, learns of Burdett's impressive history as a thief and offers him additional island-life benefits and pleasures in return for stealing the diamond.Burdett, still wanting the diamond for himself, pretends to work with Mooré, and gives him a fake plan as to how he would steal the diamond (which he had earlier related to Stan), having no trouble keeping ahead of his nemesis in the meantime. Lola kicks Max out after he breaks his promise to spend their first sunset on her new deck she had been working on and after she finds out he lied about writing his vows to her. Max is forced to bunk with Stan, and they share their thoughts about each other's lives. The next morning, the authorities and Sophie discover them, revealing that Stan's FBI license is suspended. They team up to win back Sophia and Lola, but Max still gives in and uses the dive trip as a distraction to steal the diamond, which works perfectly when Mooré's man tries at the same time is a caught after the fake plan doesn't work. After the fallout, Lola leaves Max after Lloyd shoots Mooré dead when he comes for the diamond. He realizes his error, writes his vows, and manages to win back Lola at the airport before she leaves, proposing to her with \"the first diamond he ever bought\".The next day, Max is met by Stan while celebrating, who reveals he set him up and let Max do all the work while he later recovered the diamond. Max concedes that his nemesis has won this time, and is simply happy to live out his life with Lola, watching sunsets. However, he has fun with Stan when he tries to leave by remote controlling his car again, promising Lola it is the last time.","language":"English","Reception":"The film opened at #3 in the North American box office, earning $11,100,392 in its opening weekend, with its widest release in 2,819 theaters. It grossed $28,331,233 domestically and $33,016,564 in international markets, adding up to a worldwide gross of $61,347,797.[7]After the Sunset was generally panned by critics and has an 18% approval rating based on 139 reviews from critics at the review aggregator website Rotten Tomatoes,[8] with the critical consensus \"A slick but bland thriller.\" At the website Metacritic, which utilizes a normalized rating system, the film earned a rating of 38/100 based on 32 reviews.[9]","box_office":"$61,347,797","cinematography":"Dante Spinotti","directed_by":"Brett Ratner","release_dates":"November 12, 2004 (2004-11-12)|||||","Production":"Paul Zbyszewski's original screenplay for After the Sunset was discovered by producers Beau Flynn and Tripp Vinson, both known for producing movies such as Tigerland (2000) and Requiem for a Dream (2000). The script was purchased by New Line Cinema and the producers hired Australian screenwriter Craig Rosenberg to create a re-write. Both the studio and the producers agreed that their first choice for the role of master thief Max Burdett was Pierce Brosnan.[1] Salma Hayek, Oscar-nominated for her role in Frida (2002), was the next to join the cast.[2]Next to join the cast was director Brett Ratner.[3] The film had originally been scheduled to be directed by John Stockwell but Stockwell dropped out due to creative differences.[4] Talking about joining the movie, Ratner said: \"I love caper films. There are so many great films in this genre, but what makes After the Sunset different is that it's a heist movie that has a combination of great relationships, heart and comedy.\"Chris Tucker and Jackie Chan were both offered film cameos as American police officers (a nod to the Rush Hour series which Brett Ratner also directed) but turned them down.With the two leads set, Woody Harrelson was cast in the role of Burdett’s nemesis, FBI agent Stanley Lloyd.[5] Harrelson said during promotion: \"When this movie came along, I loved it right away.\" Don Cheadle's casting marked a third collaboration with Ratner, following The Family Man (2000) and Rush Hour 2 (2001). The role of Sophie, the Bahamian cop, was the next role to be cast. British actress Naomie Harris landed the role.[6]With the majority of the script set on an island in the Caribbean, the filmmakers decided to shoot in The Bahamas, Basing their production out of Kerzner International's Atlantis resort in Nassau, cast and crew flew in from Los Angeles, Miami and New York City to commence filming.","produced_by":"Beau Flynn Jay Stern Tripp Vinson","starring":"Pierce Brosnan Salma Hayek Woody Harrelson Don Cheadle","running_time":"97 minutes","music_by":"Lalo Schifrin","after_the_sunset":"International poster","edited_by":"Mark Helfrich","budget":"$59 million"}