{"country":"United States","distributed_by":"TriStar Pictures","Plot":"Bingo is an outcast circus dog whom his owners pay little attention to. Their star puppy, Lauren, develops an infection so they use Bingo for their next act - The Ring of Fire. But Bingo is afraid of fire (due to the fact that he experienced it as a young puppy) and chickens out. His master (Simon Webb) gets ready to kill him, but his wife stops him and tells Bingo to start over and find a family. Bingo does so when the master's wife finally agrees to kill him when Bingo mistakes the wife's orders several times.The next day, Chuckie and his friends (including his brother, Chickie) go for a bike ride but Chuckie is too slow. To prove to his friends that he isn't scared, he attempts to jump a bridge (with sunglasses) but nearly kills himself in the process. Bingo sees the whole thing and jumps on Chuckie's stomach to get the water out of him. The next day after that, Chuckie wakes up to find himself completely naked and all his clothes have been hung up on the washing line (including Bingo's collar). He eventually finds Bingo and thanks him for saving his life, and that they'll be friends for life. Bingo finds a fish for Chuckie to eat but encounter a bear in the process, to which Bingo manages to drive off.Meanwhile, Chuckie's parents Natalie and Hal, the latter being the place kicker for the Denver Broncos, worry over their son. But the next morning, when Chuckie does return, they don't want to know where he was, instead telling him to take a shower as he smells like \"wet dog\". Chuckie has to leave for school. After that, both boy and dog spend more time together (skateboarding, reading magazines, video games, math homework. Feeling ignored and even emotionally abused by his parents and older brother who seem to care more about his father's NFL career he considers Bingo to be godsend, but Bingo causes trouble as well (getting into Natalie's cold cream, chewing Chickie's citizenship award, soiling the driveway which Hal had slipped in).Chuckie returns home and his best friend is largely blamed for the incidents. Hal tells him to go upstairs and start packing as he has been traded to another team, the Green Bay Packers. Chuckie makes a death-proof box for Bingo to sleep in so he can take him with him. But Bingo sneaks out in the middle of the night and goes to see the next-door's dog (whom he met earlier) with flowers and a bottle of champagne. The next morning, he misses Chuckie's car as it drives off to their new home. Chasing the car, Chuckie's parents spot him, and they drive away.Bingo then gets into an encounter with a policeman, who believes he has been drinking and fines him. After escaping, Bingo passes out from dehydration and is taken in by a man (who turns out that he kills dogs and cooks them). Bingo advises the rest of the captured dogs to dig under the cells and then attack him. Then he drives a truck (with the man and his wife in a cell) and jumps out as they crash.Bingo goes to a motel where Chuckie's parents and Chuckie himself are staying at. There, he is taken in by two criminals. He sees that they have taken a couple and their two children, Sandy and Cindy, as hostages. Bingo realises they could be killed, so he telephones 911 and frees the family. The next day, the authorities arrive to arrest the kidnappers, Lenny and Eli. The family take him in and the girls argue over what to call their new pet until a man comes in to take Bingo to court. After an unfair trial, Bingo is jailed for contempt of court.Bingo ends up in a cell with a man known as \"Four-Eyes\" (Wayne Robson), who befriends him and saves him from a knife incident (involving Lenny and Eli) in the laundry room. That night, they escape together, but Four-Eyes isn't so lucky (he is shot non-fatally at by a nightwatchman). Then Bingo walks for a long time and stops for a rest at a kind young woman's house. She gives him some travel goodies and he walks again. He then finds Chuckie, but he has another dog, so he mistakenly thinks he doesn't like him anymore. Homeless and alone, he finds work in a friendly cook's restaurant.Lenny and Eli are informed of Bingo's escape and set out to kill him, but when they have him cornered, Chuckie spots them and races his bike towards the criminals, before he is picked up and put in their car. Once at their hideout, Chuckie is tied up and gagged. After an altercation over the phone with Natalie, Eli tells her they have Chuckie and that they want Hal to miss all his field-goals for that day's game. Natalie and Chickie repeatedly answer the door to Bingo, who holds a number of Chuckie's clothes. When he brings home his hat, Natalie suddenly becomes worried.Natalie phones Hal (although he told her numerous times that she shouldn't call him at the stadium) and tells him about how Lenny and Eli have Chuckie and are holding him captive. When said that they'll pay any amount, Natalie informs him that it's not like that and that Hal needs to miss all his field-goals or risk Chuckie being killed. After the phone call, Hal asks if he could have a word with his coach; he asks him \"What's more important, family or football?\", to which the coach responds that football is his life.Chickie runs into the room and tells Natalie that he's found Chuckie and that they have no choice but to call the police. Meanwhile, Eli is bitten by Bingo and drops his cigarette, setting the lair on fire. Chuckie, seemingly dying, tells Bingo to ring the fire alarm. Bingo does so, overcoming his fear of fire. The police move in and listen to the game on the radio. Then they arrest Lenny and Eli and nurse Chuckie's injuries. They call the bomb squad to find a bomb that was hidden in one of the suitcases. After finding out that Chuckie is safe, Hal scores a last-minute, crucial field-goal, but at the same time Bingo is holding the suitcase containing the bomb and it explodes. Natalie screams and faints, and so does Chuckie. The fireman then makes a call and finds a piece of fur in mid-air.When Chuckie wakes up, he is in the hospital with Natalie, Hal and Chickie. Hal tells him they found Bingo so they go to see him in his room. Once they enter his room, they find a crowd of people (including the dogs that were tortured). They are all the people whom Bingo met on his journey, and Natalie tells Chuckie that they are Bingo's friends and they've been at the hospital all night, since they all heard his story on the news and wanted to wish him well. Chuckie pulls the curtain to reveal Bingo with a bandaged arm, and lying down in bed. Chuckie tells him he needs him and he must pull through, and the doctor muses that he'll be fine. Then Chuckie asks Hal if he can keep Bingo, and after some encouragement from everybody, he gives in and says \"Sure, son. Just as soon as we have him neutered.\" The film ends with a circle around Bingo's head when he gives an upset look.","language":"English","Reception":"The Washington Times gave Bingo a half-star out of four, and deemed it \"The Problem Child of pet pooch movies.\"[1]","box_office":"$8,667,684","cinematography":"John McPherson","directed_by":"Matthew Robbins","release_dates":"August 9, 1991 (1991-08-09)|||||","bingo":"Theatrical release poster","produced_by":"Thomas Baer","starring":"Cindy Williams|David Rasche|Robert J. Steinmiller Jr.|","running_time":"89 minutes","music_by":"Richard Gibbs","edited_by":"Maryann Brandon","Soft toy":"The toy company Commonwealth Toy & Novelty Inc. produced toy Bingos to tie in with the film's release. The dog came with a blue backpack. Even though he is not seen wearing one in the film, number five of the collector card set has him wearing one.","written_by":"Jim Strain"}