{"big":"Theatrical release poster","country":"United States","distributed_by":"20th Century Fox","Plot":"Twelve-year-old Josh Baskin, who lives with his parents and infant sister in Cliffside Park, New Jersey, is told he is too short for a carnival ride called the Ring of Fire, while attempting to impress Cynthia Benson, an older girl. He puts a coin into an unusual antique arcade fortune teller machine called Zoltar Speaks, and makes a wish to be \"big\". It dispenses a card stating \"Your wish is granted\", but Josh is spooked to see it was unplugged the entire time.The next morning, Josh has been transformed into a 30-year-old man. He tries to find the Zoltar machine, only to see an empty plaza, the carnival having moved on. Returning home, he tries to explain his predicament to his mother, who refuses to listen, thinking he is a stranger who kidnapped her son. Fleeing from her, he then finds his best friend, Billy Kopecki, and convinces him of his identity by singing a rap that only they know. With Billy's help, he learns that it will take a couple of months to find the machine, so Josh rents a flophouse room in New York City and gets a job as a data entry clerk at MacMillan Toy Company.Josh runs into the company's owner, Mr. MacMillan, at FAO Schwarz, and impresses him with his insight into current toys and his childlike enthusiasm. They play a duet on a foot-operated electronic keyboard, performing \"Heart and Soul\" and \"Chopsticks.\" This earns Josh a promotion to a dream job: getting paid to test toys as Vice President in Charge of Production. With his promotion, his larger salary enables him to move into a spacious luxury apartment, which he and Billy fill with toys, a rigged Pepsi vending machine dispensing free drinks, and a pinball machine. He soon attracts the attention of Susan Lawrence, a fellow McMillan executive. A romance begins to develop, to the annoyance of her ruthless boyfriend and coworker, Paul Davenport. Josh becomes increasingly entwined in his \"adult\" life by spending time with her, mingling with her friends, and being in a steady relationship. His ideas become valuable assets to MacMillan Toys; however, he begins to forget what it is like to be a child, and he never has time to hang out with his best friend Billy because of his busy schedule.MacMillan asks Josh to come up with proposals for a new line of toys. He is intimidated by the need to formulate the business aspects of the proposal, but Susan says she will handle the business end while he comes up with ideas. Nonetheless, he feels pressured, and longs for his old life. When he expresses doubts to her and attempts to explain that he is really a child, she interprets this as fear of commitment on his part, and dismisses his explanation.Josh learns from Billy that the Zoltar machine is now at Sea Point Park. He leaves in the middle of presenting their proposal to MacMillan and other executives. Susan also leaves, and encounters Billy, who tells her where Josh went. At the park, Josh finds the machine, unplugs it and makes a wish to become \"a kid again.\" He is then confronted by Susan, who, seeing the machine and the fortune it gave him, realizes he was telling the truth. She becomes despondent at realizing their relationship is over. He tells her she was the one thing about his adult life he wishes would not end and suggests she use the machine to turn herself into a little girl. She declines, saying that being a child once was enough, and takes him home. After sharing an emotional goodbye with Susan, he becomes a child again. He waves goodbye to Susan one last time before reuniting with his family. The film ends with Josh and Billy hanging out together, with the song \"Heart and Soul\" playing over the credits.","Broadway musical":"In 1996, the film was made into a musical for the Broadway stage. It featured music by David Shire, lyrics by Richard Maltby, Jr., and a book by John Weidman. Directed by Mike Ockrent, and choreographed by Susan Stroman, it opened on April 28, 1996 and closed on October 13, 1996, after 193 performances.","language":"English","Reception":"The film was received with almost unanimous critical acclaim; based on 66 reviews collected by review aggregation website Rotten Tomatoes, 97% of critics gave it a positive \"Certified Fresh\" review and the consensus stating \"Refreshingly sweet and undeniably funny, it is a showcase for Tom Hanks, who dives into his role and infuses it with charm and surprising poignancy.\"[3] The New York Times praised the performances of Moscow and Rushton, saying the film \"features believable young teen-age mannerisms from the two real boys in its cast and this only makes Mr. Hanks's funny, flawless impression that much more adorable.\"[4]The film was nominated for Academy Awards for Best Actor in a Leading Role (Hanks) and Best Writing, Original Screenplay.The film is number 23 on Bravo's 100 Funniest Movies. In 2000, it was ranked 42nd on the American Film Institute's \"100 Years…100 Laughs\" list.[5] In June 2008, AFI named it as the tenth-best film in the fantasy genre.[6] In 2008, it was selected by Empire Magazine as one of \"The 500 Greatest Movies of All Time.\"[7]","box_office":"$151.7 million[1]","cinematography":"Barry Sonnenfeld","production_company":"Gracie Films","directed_by":"Penny Marshall","Home media":"The film was re-released in 2007 in a 2-disc Extended Edition DVD. The DVD features the theatrical (104 minutes) and extended (130 minutes) versions of the film on the first disc. The second disc contains deleted scenes, featurettes, an AMC Backstory, and trailers and TV spots.A Blu-ray edition was released on 20 December 2013, in conjunction with the film's 25th anniversary.","release_dates":"June 3, 1988 (1988-06-03)|||||","Box office":"The film opened #2 with $8.2 million its first weekend.[11] It would end up grossing over $151 million ($116 million USA, $36 million international).[11] It was the first feature film directed by a woman to gross over $100 million.","produced_by":"James L. Brooks|Robert Greenhut|","starring":"Tom Hanks|Elizabeth Perkins|Robert Loggia|John Heard|","running_time":"104 minutes","music_by":"Howard Shore","edited_by":"Barry Malkin","TV show":"On September 30, 2014, Fox announced that a TV remake, loosely based on the film, is in the works. Written and executive produced by Kevin Biegel and Mike Royce, it deals with what it means to be an adult and kid in present times.[12]","written_by":"Gary Ross|Anne Spielberg|","budget":"$18 million[1]"}