{"country":"Australia","distributed_by":"Hoyts (Australia) Umbrella Entertainment Universal (US)","Plot":"Annie O'Farrell (based on Anne McDonald) is a 13-year-old girl with cerebral palsy who is unable to communicate and has been living in a government institution from an early age. Jessica Hathaway (based on Rosemary Crossley) is a therapist who learns to communicate with Annie using an alphabet board and comes to believe that although physically disabled, Annie is not intellectually impaired. When Annie turns 18, Jessica begins a legal fight to get her released.[2][3]","language":"English","Reception":"Annie's Coming Out won three 1984 Australian Film Institute Awards for Best Film, Best Adapted Screenplay and Best Lead Actress (Angela Punch McGregor).[4] It was nominated for four other AFI awards. The film won the Prize of the Ecumenical Jury at the 1984 Montréal World Film Festival.[4]The film was not a large commercial success but it screened in the US as A Test of Love.[1]","cinematography":"Mick von Bornemann","production_company":"Film Australia","directed_by":"Gil Brealey","Home media":"Annie's Coming Out was released on DVD by Umbrella Entertainment in October 2010. The DVD is compatible with all region codes and includes special features such as press clippings, photos, and audio commentary with Gil Brealey, Rosemary Crossley, Chris Borthwick and Anne McDonald.[5]","release_dates":"27 September 1984 (1984-09-27) (Australia)|23 November 1984 (1984-11-23) (UK)|29 March 1985 (1985-03-29) (U.S.)|||","Production":"Film rights to the book were bought by Film Australia and Gil Brealey was assigned to direct. It was originally intended that Ann McDonald play herself but she had grown too big by the time she left hospital so 9 year old Tina Arhondis was cast instead. Shooting started in September 1983 and went for four weeks, mostly at the Convent of the Good Shepherd in Melbourne.[1]","produced_by":"Don Murray","running_time":"96 minutes","music_by":"Simon Walker","edited_by":"Lindsay Frazer","written_by":"Chris Borthwick Rosemary Crossley Anne McDonald John Patterson","budget":"under AU$1 million[1]"}