{"country":"United States","distributed_by":"DreamWorks Pictures (USA & Canada) Columbia Pictures (International)","Plot":"Colm (Barry McEvoy) takes a job as a barber in a Belfast psychiatric hospital. He meets the staff and is warned against talking about poetry with George, a fellow barber (Brían F. O'Byrne). when he brings it up, George subjects him to his own poor work. The pair chat anyway. Later they meet an orderly escorting a new patient, whom he refers to as \"The Scalper\" (Billy Connolly), described as the only seller of hair pieces in all of Northern Ireland until he had a nervous breakdown and scalped some of his own customers. Colm and George decide to meet with the Scalper to gain his list of customers; they intend to take over his former hairpiece monopoly. The Scalper agrees to give them the list.Colm and George, calling themselves \"The Piece People\", embark on their plan to get rich. Colm's girlfriend Bronagh (Anna Friel) helps. She sets up their first appointment with a Mr Black (Des McAleer), who eventually agrees to buy a hairpiece, although he denies having been a customer of \"The Scalper\". Bronagh had seen his picture in the newspaper (featured after he shot a Catholic) and, as he was bald, thought he'd be a good prospect. Having little success in sales, Colm and George discover they have competition from \"Toupée or not Toupée\", rivals who also acquired the client list. The supplier, \"Wigs Of Wimbledon\", decides to hold a meeting with two companies to inform them that the one who sells the most in a given time period will win an exclusive rights for all of Northern Ireland. The partners visit a farmer but lose the sale, learning that their competitors are underselling them. On a remote road, they are stopped by members of the Irish Republican Army (IRA), demanding to know what they are up to. This confrontation results in the partners selling a wig to the lead IRA man (Colum Convey), who fails to notice it had been chewed by dogs.The competition is raging, but the IRA man accidentally leaves the unique wig at the scene of a bombing. The Royal Ulster Constabulary (RUC) trace it to The Piece People. After being interrogated, George and Colm have a falling out. Meanwhile, the IRA man who lost the wig tracks Colm down and demands Colm sell him his whole inventory because now every bald Catholic in Northern Ireland is a potential suspect for the police. Colm refuses as his business partner is a Protestant and thinks it would be unethical to protect the IRA because the sales would likely help The Piece People win the exclusive deal with Wigs Of Wimbledon.Colm goes to a poetry reading by George and the two make peace. With the help of Bronagh, the duo learn that many British Army soldiers in Northern Ireland are suffering from alopecia (hair loss) due to the stressful conditions, and secure a government contract to supply wigs to all soldiers who want them. With this, they win the competition and gain the rights to Northern Ireland.","language":"English","Reception":"An Everlasting Piece received mixed reviews from critics and holds a 48% rating on Rotten Tomatoes based on 43 reviews.","an_everlasting_piece":"Theatrical release poster","box_office":"$75,228","directed_by":"Barry Levinson","Lawsuit against Dreamworks":"In 2001, one of the film's producers, Jerome O'Connor, filed a $10 million lawsuit in federal court in Manhattan against Steven Spielberg's studio DreamWorks, the film's distributor. He complained that, although his film had received favorable reviews, the studio had reduced distribution from a projected 800 to eight theaters in the United States, and then pulled it from distribution. O'Connor alleged the film was \"sabotaged\" because director Barry Levinson would not change scenes to please British officials in its Foreign Office, which objected to its \"sympathetic portrayal\" of the IRA. O'Connor claimed DreamWorks officials feared the film might interfere with Steven Spielberg's attaining an honorary knighthood (which Spielberg received in January 2001).[1]O'Connor argued that then Prime Minister Tony Blair had arranged for a loan of military equipment and 2,000 troops to Spielberg's production of Band of Brothers (TV miniseries), which aired in 2001 on HBO, and that Spielberg gave Blair's son Euan a job in the production, indicating a quid pro quo.[1] A DreamWorks spokesman said the studio had not requested any film cuts. An Everlasting Piece was released on DVD, and the film, which had a $14,000,000 budget, earned $75,228.[1]A decade after filing his lawsuit, a New York judge dismissed it in February 2011. O'Connor's counsel reserved the right to file an appeal, but ultimately did not file one.[2]","release_dates":"December 25, 2000 (2000-12-25)|||||","produced_by":"Mark Johnson, Barry Levinson, Patrick McCormick, Jerome O'Connor, and Paula Weinstein","starring":"Barry McEvoy Brían F. O'Byrne Anna Friel Billy Connolly","running_time":"108 minutes","music_by":"Hans Zimmer","edited_by":"Stu Linder","written_by":"Barry McEvoy","budget":"$14 million"}