{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Daryl Chase (Jones) is a successful investment banker who handles international accounts for a major New York firm. Chase discovers to his surprise that one of his biggest clients, a company from Mexico, is actually a front for a cartel of drug smugglers; he realizes too late that he's been framed for money laundering and the murder of two cops, and is now wanted by the FBI.Chase is soon approached by a CIA agent, who thinks Chase's relationship with the Mexican drug kingpins might prove useful, but when his local contact disappears, Chase has to make his way to Mexico in order to save his skin and hopefully clear his name. Needing a new identity to get out of town and across the border, Chase obtains a stolen passport— and soon learns the man whose name he's using is in even deeper trouble with the law than himself.With nowhere else to turn, Chase asks streetwise hustler Freddie Tiffany (Griffin) (in reality, an undercover FBI agent) to help him get out of town; Chase pretends to be Freddie, while Tiffany will pose as a businessman like Chase. However, Chase finds out Tiffany isn't the man he thought he was, and that his sticky situation is even more perilous and fraught with secrets than he imagined.","language":"English","Reception":"The film received mostly negative reviews. 12% of online critics gave the film a positive review according to review aggregator Rotten Tomatoes. The consensus being that despite a good performance by Orlando Jones, the movie is ruined by a ridiculous, messy plot and fails to generate laughs.[1]","box_office":"$31.6 million","cinematography":"Theo van de Sande","production_company":"Touchstone Pictures","directed_by":"George Gallo","Music":"A dance competition in the film features the song Return of the Tres by hip hop group Delinquent Habits. The Joe song Stutter (featuring Mystikal) is also used in the movie.","release_dates":"January 12, 2001 (2001-01-12)|||||","Box office":"The film opened at #4 at the North American box office making $11.7 million USD in its opening weekend behind Traffic, Cast Away and Save the Last Dance, which debuted at the top spot.","produced_by":"David Permut Brett Ratner","starring":"Eddie Griffin Orlando Jones Edward Herrmann Gary Grubbs Daniel Roebuck Sterling Macer Jr","running_time":"91 minutes","music_by":"Graeme Revell","edited_by":"Malcolm Campbell","written_by":"Graham Greene","budget":"$24 million"}