{"country":"United States","distributed_by":"Orion Pictures","Plot":"At a Catholic school in 2050, a troublesome boy named Roger (Ben Savage) is running away after blowing up the gym due to not being allowed to play on the basketball team—he was accepted onto the team but his parents have forbidden contact sports. He is stopped by Father Clifford (Martin Short), an old priest, who tries to persuade him to change his ways by telling him a story of his own youth.In a flashback, 10-year-old Clifford is a deceptive, weird-looking boy who never lets go of a toy dinosaur named Steffen. He talks to and blames him for his own actions. He loves dinosaurs and his dream is to visit Dinosaur World, a theme park in California.While flying with his parents to Honolulu, Clifford purposely causes a catastrophe on board that puts everyone on the plane in danger and forces the pilot to make an emergency landing in Los Angeles. His father, Julian, scolds him because he is not allowed to get back on the plane, though he has an important engagement to attend. He phones his brother, Martin (Charles Grodin)—who resides in Los Angeles—to propose the idea of Clifford staying with him temporarily. Martin thinks that this is the perfect opportunity to prove to his fiancee, Sarah Davis (Mary Steenburgen), how well he interacts with children. He has not seen Clifford since his baptism.Upon their reunion, Martin reveals to Clifford that he designed Larry the Scary Rex (a Dinosaur World attraction) and can get into the park free of charge, which strengthens Clifford's obsession to visit. Martin promises to take him there, but is ultimately forced to break it because of work.Clifford becomes enraged and sabotages Martin's life, jeopardizing his career and his relationship with Sarah. He compliments Martin's boss, Mr. Ellis (Dabney Coleman), on his toupee and humiliates Martin at Sarah's parents' 35th wedding anniversary party by replacing his Bloody Mary with Tabasco sauce, ruining an unprepared toast that Martin is giving. Clifford gets Martin arrested in front of Sarah's family after calling in a bomb threat and gets Martin fired by bombing a presentation during a press conference.Martin's sanity snaps. He finally takes Clifford to Dinosaur World after hours and makes him ride Larry the Scary Rex until he can no longer take it. After going through it once, Clifford seems to enjoy himself, so Martin increases the ride's speed repeatedly. It malfunctions and Clifford's cart crashes, leaving him dangling above the jaws of a robotic dinosaur. He cries out for Martin to save him. Martin hesitates—worried about the future of mankind if he saves Clifford—but ultimately risks his own life. Clifford finally apologizes for his behavior, but Martin is fed up. He tells Clifford that he is a destructive thing, not a human. Clifford, who was upset, decides not to go home with Martin.Back in the future, Father Clifford says that this experience made him turn his life around. He wrote hundreds of letters asking Martin's forgiveness. Eventually, Martin invited him to his and Sarah's wedding, finally forgiving him.Roger decides to not run away and to write hundreds of letters, asking for forgiveness. Father Clifford then takes Steffen saying, \"Mission accomplished, old friend.\"","language":"English","Reception":"The film was critically panned. It currently holds a 9% approval rating at Rotten Tomatoes based on 22 reviews (20 negative, 2 positive).[1] Roger Ebert gave the film a half-star of a possible four. He wrote: \"The movie is so odd, it's almost worth seeing just because we'll never see anything like it again. I hope.\"[2]Like other films which were released by Orion Pictures several years after they had surpassed their bankruptcy period,[citation needed] Clifford failed to make a profit at the box office in addition to being critically panned. Its domestic gross was $7 million at the domestic box office.[citation needed]","box_office":"$7.4 million","clifford":"Theatrical release poster","cinematography":"John A. Alonzo","directed_by":"Paul Flaherty","narrated_by":"Martin Short","production_companies":"Morra, Brezner, Steinberg and Tenenbaum Entertainment (MBST) Orion Pictures","release_dates":"April 1, 1994 (1994-04-01) (United States)|||||","produced_by":"Larry Brezner Pieter Jan Brugge","starring":"Martin Short Charles Grodin Mary Steenburgen Dabney Coleman","running_time":"90 minutes","music_by":"Richard Gibbs","edited_by":"Tim Board Pembroke J. Herring","written_by":"Jay Dee Rock Bobby Von Hayes","budget":"$19 million"}