{"country":"United States","distributed_by":"United Artists","Background":"The film Cotton Comes to Harlem is perhaps the most commercially successful film Hollywood produced in the 1970 starring blacks.[4] Produced on a budget of $1.2 million,[5] it earned $5.2 million in theatrical rentals during its North American release,[1] making it the 21st highest grossing film of 1970.[6]The film was one of the many black films that appeared in the 1970s and became an overnight hit. Davis parleyed both humor and drama together and got a film that worked: he also attracted a black audience, which helped make the film a cult classic over the years. It inspired more black films during the '70s, including more action-packed numbers like Shaft and Super Fly. Ossie Davis resigned from doing the sequel to Cotton Comes to Harlem called The Heat's On due to strong artistic differences with Metro-Goldwyn-Mayer (MGM).[7] yet the film inspired the sequel Come Back, Charleston Blue, loosely based on The Heat's On, with much original material injected.","Plot":"Reverend Deke O'Malley (Calvin Lockhart) is selling shares in a Harlem rally for a Back-to-Africa movement ship to be called The Black Beauty. During the rally, several masked gunman jump out of a meat truck and steal $87,000 in cash from the back of an armored car. Two Harlem detectives, Gravedigger Jones (Godfrey Cambridge) and \"Coffin\" Ed Johnson (Raymond St. Jacques) chase the car and a bale of cotton falls out of the vehicle. Uncle Budd (Redd Foxx) has found the bale of cotton and sells it for $25 to a junk dealer but buys it back later for $30. There was a reward out for the bale of cotton because the $87,000 was thought to be hidden inside of the bale. After accusing O’Malley for stealing the money and taking him captive, Detectives Jones and Johnson were able to bribe Calhoun (J.D. Cannon), a mob leader, to give them $87,000 after discovering that Uncle Budd had run off with the money to retire in Africa. According to, Bud Wilkins, the reviewer in Slant Magazine, \"under the sway of a fundamentally unjust and corrupt system, \"Cotton Comes to Harlem\" seems to suggest, the best that the impoverished and disenfranchised can hope for is to clamber and fight to carve out a larger slice of the pie any way they can.\"[2]","language":"English","Themes":"\"Cotton Comes to Harlem\" is hailed by many as the first blaxploitation film, although others felt that it was basically an action comedy film that didn’t exploit blacks.[9] The film \"explores the racism and its accompanying economic and social oppression inherent in American culture.\"[10] Detectives Grave Digger and Coffin Ed aren't necessarily fighting to protect the law but rather to protect their people from racist attitudes.\"Cotton Comes to Harlem\" also depicts Black Power by depicting the power black people can utilize via methods such as self-determination. The detectives worked throughout the whole movie to prove that the black community was being taken advantage of and by the end of the film, they were much more respected by other white officers and were able to demand $87,000 from Calhoun.Reverend O'Malley's, Black Beauty, was named after the \"Black is beautiful\" movement. The \"Black is beautiful\" movement was started to recognize themselves as a mighty race. In his own words, \"I am the equal of any white man; I want you to feel the same way.\" Therefore, naming the ship to take all the black people in Harlem back to Africa was a form of empowering them as they embark upon the journey to embrace their African roots.Lastly, the film provided a holistic perspective, by highlighting the struggles within the black community as well. Even during the car chase between the detectives and thieves, there were different video takes of stereotypes of black people in the streets. For example, there was a drug addict stumbling in the middle of the road, unfriendly black hotties strutting on the sidewalk in traditional African cloth and of course, a guy who was trying to holler at them. The car chase ends with the detectives running into a cart of watermelons.","box_office":"$5.2 million (rentals)[1]","Screen debuts":"Davis' film saw four people debut in the film: Calvin Lockhart, Judy Pace, and Cleavon Little. Lockhart appeared in numerous films and TV shows, sometimes playing tough guy roles. Judy Pace appeared in film and TV, appearing in the TV show The Young Lawyers and the film Frogs, and Cleavon Little made nightclub performances plus films afterwards: the most famous role he did was as Bart in the Mel Brooks comedy Blazing Saddles. Another person who debuted was Redd Foxx, and he proved that even a veteran night club star up in age can do movies as well, leading him to be considered for the TV Show Sanford and Son. Also, Cambridge would later star as a white man who turns black in the motion picture comedy Watermelon Man.[8]","cinematography":"Gerald Hirschfeld","directed_by":"Ossie Davis","DVD":"Cotton Comes to Harlem was released to DVD by Fox Video (acting as distributor for MGM) April 1, 2003, and will be released on Blu-ray DVD by Kino Lorber (under license from MGM) on September 2, 2014.","cotton_comes_to_harlem":"Theatrical release poster by Robert McGinnis","release_dates":"May 26, 1970 (1970-05-26)|||||","produced_by":"Samuel Goldwyn, Jr.","starring":"Godfrey Cambridge Raymond St. Jacques Calvin Lockhart","running_time":"97 minutes","music_by":"Galt MacDermot","Discussion":"The film’s inspirational opening theme song, “Ain’t Now But It’s Gonna Be,” was written by Ossie Davis and performed by Melba Moore, who at the time was also starring in the hit Broadway musical, Purlie![8]Cotton Comes to Harlem employed many local people as extras and crew in the Harlem neighborhood where it was filmed, which helped to put a positive spotlight on Harlem, which at the time was ravaged with crime.[8]Seeing that the film would be shot in Harlem featuring large crowd scenes, such as riots and rallies, John Shabazz and the Black Citizens Patrol volunteered to control the scenes with their experience in keeping out unwanted spectators and policing traffic. The Black Citizens Patrol’s purpose was to protect the black community from itself so they made themselves available at all times, even operating as an escort service.[11]","edited_by":"Robert Q. Lovett","written_by":"Ossie Davis Arnold Perl Chester Himes (novel)"}