{"based_on":"Annie  by Charles Strouse Martin Charnin Thomas Meehan and Little Orphan Annie  by Harold Gray","Cast":"Phil Lord and Christopher Miller's names appear in the end credits of MoonQuake Lake, a fictional film within the film. The scenes were actually directed by Lord and Miller.","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Will Gluck|Aline Brosh McKenna|","Plot":"In Harlem, Manhattan Island, N.Y.C, Annie Bennett lives in foster care with several other girls in the care of Colleen Hannigan, a bitter former singer who spends her days drinking or trying to find a husband. Annie spends Fridays waiting outside Domoni's restaurant, believing her parents will come for her because a note written on a receipt from Domoni's says they would return. When a city inspector checks on Hannigan's treatment of the girls, Annie takes advantage of the situation; she manages to copy her social security number from his clipboard and heads off to get her information. Annie learns that there's nothing more about her than what she already knows.Trying to save a Shiba Inu from bullies, Annie is nearly run over; however, she is saved by William Stacks, a germaphobe cell phone mogul running for mayor. Annie's rescue goes viral on the internet, boosting Stacks popularity; per suggestion of Stacks' campaign manager Guy Danlily, Annie moves in with Stacks to boost his popularity further. Annie enjoys her new surroundings, befriending Stacks' assistant Grace Farrell. Annie also gets to adopt the stray dog from before, naming her Sandy. Bonding with Annie, Stacks reveals that he had humble beginnings in Queens; he never really knew his father due to his work hours, but believed he could understand him if he worked just as hard. Annie also helps Grace and Stacks begin realizing that they like each other romantically.Per Annie's request, Stacks takes her and her friends in Hannigan's foster care to see the premiere of MoonQuake Lake. Stacks is uninterested in the movie at first, but soon becomes a major fan, along with Grace. Per Annie and Grace's insistence, Stacks joins in the after-movie party. After returning her friends home, Annie shows Grace her Friday routine of waiting to see if her parents will return; Grace sympathizes, agreeing to keep this a secret from Stacks. At Hannigan's, the girls accidentally wake her; Hannigan snaps at them, saying rich people aren't nice, and will ditch anyone they don't like anymore (recalling her own past). Slightly hungover, she laments about her situation of foster kids and her desire to reclaim stardom.When Annie is asked to read a speech during a charity event, she runs out, revealing that she doesn't know how to read. Stacks decides to get her a tutor, but Guy decides that Annie will only hinder Stacks' campaign as his popularity isn't improving anymore. Teaming up with Hannigan, Guy plans to have imposters claim Annie as their daughter to boost Stacks popularity to the point where he wins; Guy will then share his payment with Hannigan. However, Guy plans to dump Annie back into the system after the election, not caring about her well-being. By the time Hannigan has second thoughts, Annie has already been kidnapped by the imposters; Hannigan tells Stacks about the plan, getting Guy fired. Stacks, Grace, Hannigan and the girls board Stacks' helicopter; aided by the police, they chase the getaway car into the park. Annie, thinking Stacks arranged this (due to the kidnappers believing Stacks paid them, not Guy), is surprised when Stacks announces to the press that he quits the mayoral race; Annie then helps Grace and Stacks admit their love. All three dance and sing happily.Later, Annie announces the opening of the Stacks Education Facility, to help children like herself who couldn't read. Everyone sings Annie's The Sun Will Come Out Tomorrow; unhumorously, Hannigan attempts to continue singing after the song is done, only to receive stares that cue her to stop.","language":"English","box_office":"$133.8 million[3]","cinematography":"Michael Grady","production_company":"Village Roadshow Pictures Overbrook Entertainment","directed_by":"Will Gluck","Changes from prior adaptations":"While \"rooted in the same story\" according to Gluck, the 2014 film adaptation is a contemporary take on the 1977 Broadway musical and contains some differences from the original:[10] The setting was changed from the 1930s—the era of Franklin D. Roosevelt's presidency and the Great Depression—to present-day New York City. The opening school scene features class presentations by both the new Annie, and a student representing her classic appearance, discussing aspects of and parallels between the economic states of the two settings, such as the New Deal and the modern lower class.[32]The character of Oliver Warbucks was modified to create William Stacks, an entrepreneur in the technology sector (particularly, the mobile phone industry) turned politician, who is trying to run for Mayor of New York City. Annie also no longer lives in an orphanage, but is kept in foster care.[10][33][34] Miss Hannigan's first name is changed to Colleen, instead of her previous film name Agatha. While Hannigan is complicit in deceiving Stacks and Annie that Annie's birth parents have been found (conspiring with Stacks' campaign manager Guy Danlily), they are not impersonated by Hannigan's brother Rooster and his girlfriend Lily as in the original version. Instead, Guy has 'people he uses for this kind of work' take Annie. Hannigan's character is also softened from her prior appearances, to the point of experiencing guilt over her part in separating Stacks and Annie, and even helping to rescue Annie from her false parents in the film's finale. Annie's dog Sandy is a female in this film, as opposed to past adaptations where the dog is a male. Annie is black, previously being white and having red hair.","annie":"Theatrical release poster","release_dates":"December 7, 2014 (2014-12-07) (Ziegfeld Theatre)|December 19, 2014 (2014-12-19) (United States)||||","Production":"Sony first announced the remake in January 2011; Jay-Z and Will Smith served as producers, and Smith's daughter Willow was attached to play the lead role.[13] In February 2011, Glee co-creator Ryan Murphy became front-runner to direct the film,[14] but by March, he had declined.[15]The production soon began seeking a screenwriter, and actress Emma Thompson was considered.[16] No developments arrived until May 2012, when Will Smith appeared on Good Morning America and provided updates, including that the film would be set in modern-day New York City, that Thompson was providing a script, and that Jay-Z would also provide newly written songs for the film.[17] In July 2012, We Bought a Zoo screenwriter Aline Brosh McKenna wrote a second draft of the script.[18] In August, it was announced production was to begin in Spring 2013.[19]In January 2013, Easy A director Will Gluck was hired to direct, but Willow Smith had dropped out.[20]By February 2013, Beasts of the Southern Wild star and Oscar nominee Quvenzhané Wallis had replaced Smith in the lead role,[21] and the film had scheduled a Christmas 2014 release.[22]In March 2013, the search for the rest of the cast continued, and Justin Timberlake was rumored for the role of Daddy Warbucks.[23] This was proven false when Jamie Foxx signed on for the role, now named Will Stacks.[24] In June 2013, Cameron Diaz was cast as Miss Hannigan, after Sandra Bullock declined.[25]In July 2013, Rose Byrne joined the cast as Grace Farrell, Stacks's faithful assistant[26] and in August, Boardwalk Empire star Bobby Cannavale joined the cast as a \"bulldog political adviser\" to Will Stacks.[27] In September, the rest of the cast was announced: Amanda Troya, Nicolette Pierini, Eden Duncan-Smith, and Zoe Colletti as Annie's foster sisters.[28]As of September 19, 2013, principal photography had begun.[29][30] Shooting was done at Grumman Studios.[31] Other scenes were filmed at the new Four World Trade Center.","produced_by":"James Lassiter|Will Gluck|Jada Pinkett Smith|Will Smith|Caleeb Pinkett|Shawn \"Jay Z\" Carter|Jay Brown|Tyran Smith|","starring":"Jamie Foxx|Quvenzhané Wallis|Rose Byrne|Bobby Cannavale|Adewale Akinnuoye-Agbaje|David Zayas|Cameron Diaz|","running_time":"118 minutes[1]","Musical numbers":"While the film incorporates notable songs from the original Broadway production, written by composer Charles Strouse and lyricist Martin Charnin, the songs themselves were rearranged by Sia and Greg Kurstin to reflect its new contemporary setting. Executive music supervisor Matt Sullivan explained that there was a desire to make the film's use of music \"seamless\" rather than \"abrupt\", and to maintain the integrity and familiarity of the musical's most iconic songs, including \"Tomorrow\" and \"It's the Hard Knock Life\". The songs were rearranged with a percussive, pop-inspired style: in particular, \"It's the Hard Knock Life\"—whilst maintaining the use of \"natural\" sounds for its rhythm, was updated in a hip hop style. Lyrics to some songs were also updated to reflect the differences in the film's storyline and settings.[10] Sia and Kurstin wrote three new songs for the soundtrack: \"Opportunity\", \"Who Am I\", and \"Moonquake Lake\". Sia additionally co-wrote \"The City's Yours\" with Stargate.[11][12]","music_by":"Charles Strouse Greg Kurstin","edited_by":"Tia Nolan","Release":"The film officially premiered at the Ziegfeld Theater in New York City on December 7, 2014.[35]On November 27, 2014, Annie was one of several films leaked by the \"Guardians of Peace\", a group that the FBI believes has ties to North Korea,[36] following its breach of Columbia's parent company Sony Pictures Entertainment. Within three days of the initial leak, Annie had been downloaded by an estimated 206,000 unique IPs.[6] By December 9, the count had risen to over 316,000. The chief analyst at BoxOffice.com felt that despite this, the leak was unlikely to affect Annie's box office performance as the demographic who pirates movies isn't the target audience for the film.[37]Annie opened on December 19, 2014, and earned $5,289,149 on its opening day. In the first weekend, the film made $15,861,939, ranking third in the domestic box office behind other new releases The Hobbit: The Battle of the Five Armies and Night at the Museum: Secret of the Tomb.[38] The film grossed $85.9 million in North America and $48.7 million overseas for a worldwide total of $134.6 million.[39]Annie was unfavorably received by critics. On Rotten Tomatoes, a review aggregator, the film has a 27% approval rating, based on 140 reviews, with an average rating of 4.5/10. The site's critical consensus reads, \"The new-look Annie hints at a progressive take on a well-worn story, but smothers its likable cast under clichés, cloying cuteness, and a distasteful materialism.\"[40] On Metacritic, the film has a score of 33 out of 100, based on 38 critics, indicating \"generally unfavorable reviews\".[41] Audiences rated the film an “A-\" on CinemaScore.[42]PopMatters magazine rated Annie with a three out of ten, saying, \"In its aggravatingly choreographed frenzy, the party scene epitomizes Annie: it's trying too hard both to be and not be the previous Annies, it's trying too little to be innovative or vaguely inspired. It's as crass as Miss Hannigan and as greedy as Stacks, at least until they learn their lessons. The movie doesn't appear to learn a thing.\"[43] Michael Phillips of the Chicago Tribune gave Annie one-and-a-half stars, describing the adaptation as being \"wobbly\" and \"unsatisfying\", criticizing the commercialized nature of the plot changes, concluding that it was \"finesse-free and perilously low on the simple performance pleasures we look for in any musical, of any period\".[34] Ben Sachs of the Chicago Reader gave the film three out of four stars, praising the \"surprising amount of bite: the filmmakers openly acknowledge the similarities between the Great Depression and the present, and the populist message, however overstated, always registers as sincere.\" Sachs also praised director Will Gluck for \"striking a buoyant tone that feels closer to classic Hollywood musicals than contemporary kiddie fare.\"[44]The soundtrack, rearranged by Sia and Greg Kurstin, received a polarizing response from critics, with much criticism going towards the heavy use of auto-tune. Entertainment Weekly described its soundtrack as an auto-tuned \"disaster\", noting that \"you won't ever hear a worse rendition of 'Easy Street' than the one performed by Diaz and Cannivale — I promise\".[33] David Rooney of The Hollywood Reporter says \"all but a handful of the existing songs have been shredded, often retaining just a signature line or two and drowning it in desperately hip polyrhythmic sounds, aurally assaultive arrangements and inane new lyrics.\"[45] Matt Zoller Seitz however, praised the soundtracks' new songs.[46]The performances, however, were more positively received by some critics. IGN.com praised Wallis and Foxx for being \"on-point\" throughout much of the film, as well as Rose Byrne, calling her the \"surprise\" of the film.[47] Matt Zoller Seitz called Wallis \"the first Annie to bring something both culturally and personally new to this role\", and praised the rest of the cast too, including Foxx and Byrne.[46] However, Cameron Diaz's performance was widely panned, with critics calling it \"vampy\",[46] as well as \"strident and obnoxious\".[45] Peter Travers of Rolling Stone says that she \"overacts the role to the point of hysteria\".[48]Annie was released on DVD and Blu-ray/DVD combo pack on March 17, 2015.[54]","budget":"$65 million[2][3]"}