{"country":"Australia","distributed_by":"Roadshow Entertainment (Australia)","Plot":"Jack Simpson is a wise-cracking, directionless layabout who works at an inner-city telemarketing firm. For years, he has been a member at the Cityside Lawn Bowls Club (in fact he has three memberships). But he has never played a single game, having only joined to get the free parking spaces from which he makes extra cash by renting them to his work-mates. But Cityside is in dire financial trouble and a greedy developer, Bernie Fowler, wants to turn it into a soul-less pokies venue. The Club President, Len, decides that all existing members must now play and Jack reluctantly has to turn up on Saturdays to take part in the bowling matches. Jack proves to be a natural player but he soon annoys and upsets the older club members with his brashness and lack of tact. Veteran player Stan, sensing that Jack only needs some guidance, both in the game and in life, takes him under his wing, trying to teach him to think of other people apart from himself.After losing his job and his girlfriend, the Bowls Club suddenly becomes all Jack has in his life and, despite himself, he grows fond of the older members. His flatmate Dave joins the club and he starts a relationship with Nancy, a journalist. Bernie, determined to take over the club, investigates Jack and exposes his illegal car-park hiring scam, which almost gets him expelled. Cityside enters a major tournament at Bernie's glitzy club, the prize money from which will save their independence. Jack's selfish show-boating almost costs them the first round but Stan and the others make Jack finally realize he is part of a team.Police arrive to arrest Len as (in a tip-off from Bernie), they discovered marijuana stored at the club. The greenkeeper has been secretly growing it but Jack is blamed by the other members. Dave and two of the ladies Gwen and Eileen approach the State Governor and convince her to over-turn a lifetime ban on Cliff Carew, the club's best player, and the latter takes Len's place. Cityside fights their way into the lead and Stan throws the winning shot but he suffers a severe heart-attack as he does so and Bernie lodges a protest, meaning the shot is dis-allowed. Jack insists that the rules allows the team a re-shot and he takes his special shot- the 'Flipper'- which wins the tournament. To rub salt into the wounds, Nancy proves that, whilst spying on the club, Bernie paid Jack for one of his car-park spaces, an illegal act for which Bernie must be dismissed.Cityside is saved and can continue in its old form. Stan passes away and the club names the green in his honour. The pot-growing greenkeeper is sacked and Jack takes over his job and he and Nancy begin a new life with their friends at the club. The film's end-credits feature a postscript with still images and a narration by Jack describing the later exploits of all the characters.","language":"English","Reception":"Paul Byrnes, writing in the Sydney Morning Herald, referred to Crackerjack as 'a good-natured comedy...in which there's a nostalgia for our lost honour...This nostalgia for an Australia of mateship and communal spirit is the film's main surprise. This is a broad comedy with a televisual style - including some dreadful mugging to camera - so who expected social critique as well? The movie is about Jack getting knocked off the donkey, like St Paul. Jack grows to manhood through bowls. This field of green becomes his Gallipoli, in a way, as a bunch of senior citizens teach him about honour, fidelity, and teamwork.'[2]Megan Spencer, reviewing the film for Triple J, gave the film a positive review. 'Yes, Crackerjack is a familiar journeyman story, but it is one that rings true with some generously observed comedy and pathos, a film that unlike its Aussie cousins The Dish, Welcome To Woop Woop, The Castle, Siam Sunset etc. etc.… it doesn't patronise its characters, nor over-exploit the 'middle Australia' culture in which it is set.'[3]David Stratton, writing in Variety, was less enthusatic, referring to Crackerjack as 'a middling comedy which fails to live up to its explosive title....A pleasant enough screen personality, Molloy is, however, barely able to carry such a modest project... Stronger support comes from a fine ensemble of vets, especially saucy octogenarian Esme Melville; and John Flaus as the club's most enigmatic member.'[4]When Crackerjack was first screened on free-to-air television, Network Ten ran station promotions over the film's end credits, obscuring most of the postscript narration by the character Jack. Mick Molloy was interviewed by ABC TV's Media Watch where he voiced his annoyance.[5]","box_office":"$8.6 million[1]","cinematography":"Brent Crockett","production_company":"Macquarie Film Corporation","directed_by":"Paul Moloney","crackerjack":"Promotional poster","release_dates":"7 November 2002 (2002-11-07)|||||","Box office":"Crackerjack grossed $8,618,107 at the box office in Australia.[8]Crackerjack was the highest-grossing Australian film of the year and received two AFI Award nominations, for direction (Paul Moloney) and the screenplay (by Mick and brother Richard Molloy).","Filming":"The main location for bowls scenes, including the greens, carpark, and interior rooms, were filmed at the Melbourne Bowling Club in Windsor, Victoria.[6] Location shots of other bowls clubs included filming at the Carrum Bowling Club in the Melbourne suburb of Carrum.[7] The Corowa Bowls Club in the NSW town of Corowa was also used for scenes featured in the finale.","produced_by":"Greg Sitch Mick Molloy","starring":"Mick Molloy Bill Hunter Frank Wilson Monica Maughan John Clarke Judith Lucy Samuel Johnson Lois Ramsay Bob Hornery Esme Melville","running_time":"92 minutes","music_by":"Gareth Skinner","edited_by":"Ken Sallows","written_by":"Mick Molloy Richard Molloy","budget":"$3.5 million[1]"}