{"country":"United States","adam":"Promotional film poster","distributed_by":"Fox Searchlight Pictures","Plot":"Adam Raki (Dancy) is a young man, who has Asperger syndrome, living alone in Manhattan after his father's recent death. He has a friend, Harlan Keyes (Frankie Faison), an old army friend of his father's, who is always there for him. Because of his condition, Adam has difficulty communicating with others and likes to escape into his love of space exploration. His fixation on detail, repetitive behaviors, and mind-blindness cost him his job at a toy manufacturing company and nearly get him arrested after he is mistaken for a pedophile. He does not want to leave the apartment he and his father had been living in, but the loss of his job leaves him with an uncertain future, including the problem of continuing to pay the mortgage. Although he has Asperger syndrome and likes to stick to his own routine, avoiding socializing with others, Adam is lonely and wishes things could be different.Beth Buchwald (Byrne), a school teacher and aspiring children's book writer, moves into the apartment above his and they strike up an awkward friendship. One night, Beth is shocked to find him trying to clean her apartment windows suspended from the roof of the building in a space suit.Beth takes a liking to Adam despite his oddities. Adam hopes for a relationship, but the first attempts are uneasy due to his fear of social interaction. Eventually he breaks out of his beloved routines enough to be able to date Beth.When Adam asks Beth if she was aroused, as he was during an outing to Central Park, she is taken aback. Adam admits his Asperger's to her, explaining his inability to interpret her emotions. Surprised by his innocence, Beth understands the reason for his question. The next day she asks a co-worker about Asperger's syndrome and concludes with the assertion that surely Adam is not \"dating material\".However, Beth is drawn to Adam and, the eccentricities of Asperger's serve to make him more attractive to her. Adam's innocence, honesty and unique ways endear him to her and she falls in love. Eventually their relationship becomes sexually intimate and Beth also helps him understand how to better connect with her, and how to interview for a new job. As time goes on, there are moments in which Beth and Adam do not understand each other. One of those moments involves Adam's suggestion to Beth that her children's book on raccoons simply be true to life and avoid anthropomorphizing the animals.Things go downhill as Beth's father, Marty (Peter Gallagher), gets into legal trouble. Adam naively asks him about the details of Marty's alleged crimes, to make conversation, not understanding how to make small talk. This creates a rift with Beth, who does not understand Adam's mistake as unintentional, although she later apologizes to him.Marty pleads guilty and is about to be sentenced. Beth's mother (Amy Irving) calls Adam trying to find Beth. She asks him to check Beth's calendar for any way to reach her. He finds that Beth had put down a reminder to meet her parents on the night they \"unexpectedly\" bumped into each other. Beth knew that Adam would be uncomfortable, so she and her father engineered an \"accidental\" meeting. When Beth confirms this, Adam angrily accuses her of being a liar and her father a criminal. Beth storms out and goes to her parents' home.Adam gets a call from the Mount Wilson Observatory in California offering a job there building microcircuits for satellite guidance and navigation systems. He is uncertain about leaving the home he has known all his life. Feeling guilty for the things he said to Beth, he sets out by any means of transportation to the Buchwalds' home in upstate New York, even on foot, to apologize to Beth. He asks her to go to California with him. Marty tries to convince Beth not to go with someone \"not of this world.\" This leads to a heated argument with Beth, who tells her father that he has lied to her and the family about his crimes.Beth returns with Adam to New York City to prepare to go to California, but she has second thoughts when she asks Adam exactly why he wants her to come with him. Not realizing this is meant to be an opportunity for him to express his feelings for her, he lists practical ways in which she helps him, which Beth interprets as meaning that Adam doesn't feel love for her in the same way that she feels it for him. Realizing that the ways in which they express themselves are extremely different, she tells Adam she can't go with him. Beth, therefore, essentially submits to her father's view that they are from different worlds. To navigate the continuation of learning to be with each other is too much for Beth, while she struggles with the strong emotions connected to her father's imprisonment.A year later, Adam is working at the observatory, where his keen interest in space telescopes and his eidetic memory have made him successful and fulfilled in his job. He has also seemingly learned much more about picking up on social cues and making an effort to deliberately put himself in social situations. Adam receives a package from Beth, containing her first published children's book inspired by Adam and Asperger syndrome. He reads the first page in which Beth has anthropomorphized raccoons, used to represent Adam and his family and that Adam did not feel he had a place in society in New York. Adam looks deep in thought and has a moment of realization, he understands why Beth wanted to anthropomorphize the raccoons. Even after a year apart, this moment of clarity seems to bring him closer to Beth and he smiles in happiness.","language":"English","Reception":"The movie received mixed reviews. Roger Ebert gave it 2.5/4 stars, saying that the movie \"wraps up their story in too tidy a package, insisting on finding the upbeat in the murky, and missing the chance to be more thoughtful about this challenging situation.\" The movie holds a 64% rating at Rotten Tomatoes and 56% at Metacritic. Nina Caplan of Time Out London accused the movie of dishonesty: \"But it’s not clear why a pretty daddy’s girl would fall for a talkative and lonesome engineer with Asperger’s and a space fixation.\"","box_office":"$12,549,605[1]","cinematography":"Seamus Tierney","production_company":"Olympus Pictures","directed_by":"Max Mayer","release_dates":"July 29, 2009 (2009-07-29)|||||","Production":"Max Mayer formed the idea for Adam when he heard a man with Asperger syndrome being interviewed on National Public Radio about how he viewed the world. He was intrigued and, after doing further research on Asperger's, felt that the syndrome was a metaphor for \"the tension between all of us human beings [... and] the desire to connect to one another\".[2][3] As he worked on the screenplay, Mayer drew the character of Adam from the man he had heard talking on the radio in addition to his research, while Beth's character was based on numerous people Mayer knew.[2] Hugh Dancy and Mayer worked together for a month before filming began to develop Adam's character,[2] and in preparation for his role, Dancy spoke with individuals affected by Asperger's about their feelings, sensory issues and interests.Principal photography took place in New York City in December 2005.[4] Specific filming locations included Greenwich Village and Central Park.[4][5]","produced_by":"Miranda De Pencier Leslie Urdang Dean Vanech","starring":"Hugh Dancy Rose Byrne Frankie Faison Mark Linn-Baker Amy Irving Peter Gallagher","music_by":"Christopher Lennertz","edited_by":"Grant Myers","Release":"Adam had its world premiere at the 2009 Sundance Film Festival on January 20, 2009 where it won the Alfred P. Sloan Prize for \"an outstanding feature film focusing on science or technology as a theme, or depicting a scientist, engineer or mathematician as a major character.\"[6] Although producer Leslie Urdang was initially doubtful of the film's chances of finding a distributor at Sundance,[7] Fox Searchlight Pictures bought the distribution rights.[8] In March 2009, Adam was screened at the Method Fest Independent Film Festival, winning the Jury Award for Best Picture.[9] It was shown at the Seattle International Film Festival,[10] Edinburgh Film Festival,[11] CineVegas Film Festival[12] and San Francisco Jewish Film Festival[13] before it had a U.S. theatrical release on July 29, 2009. It was released on DVD January 5, 2010.[14]","written_by":"Max Mayer","budget":"$3,200,000"}