{"based_on":"Alvin and the Chipmunks  by Ross Bagdasarian","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Jon Vitti|Will McRobb|Chris Viscardi|","story_by":"Jon Vitti","alvin_and_the_chipmunks":"Theatrical release poster","Plot":"A tree that the chipmunks Alvin (Justin Long), Simon (Matthew Gray Gubler) and Theodore (Jesse McCartney) live in is cut down and driven to Los Angeles. Once in L.A., the Chipmunks meet struggling songwriter and composer David Seville (Jason Lee) who had his latest song rejected by JETT Records executive Ian Hawke (David Cross), his old college roommate. Dave also once had a relationship with his next door neighbor, Claire Wilson (Cameron Richardson).After winding up at Dave's interview, the Chipmunks hop into a basket Dave stole from one of Ian's coworkers and follow him home. Once there, Dave discovers the Chipmunks and kicks them out, only to hear them sing \"Only You (And You Alone)\". Dave then makes a deal with them; they sing the songs he writes, and he provides food and shelter for them. Unfortunately, when Dave tries to present the Chipmunks to Ian, they fail to sing to him on account of stage fright. Making matters worse, Dave is dismissed as the chipmunks ruin his job presentation by coloring on it. When Alvin tries to set the mood for Dave's dinner with Claire, things become peculiar and she rejects Dave after having been told about the Chipmunks. To make it up to Dave, the Chipmunks go to Ian in an attempt to get a record deal.Once the Chipmunks sing Dave's song to Ian, Ian signs them to the label and calls Dave the next day. After a few singles, the Chipmunks have a worldwide success. When Dave expresses concern for their well-being and insists that the Chipmunks are \"children\" who do not need so much craziness in their lives, Ian convinces the Chipmunks that Dave is holding them back. After a misunderstanding with Dave, they go live with Ian. They become enchanted with Ian at first, but once they set off on a nationwide coast-to-coast tour, Ian takes advantage of their naïvete, changing their image and working them constantly. Meanwhile, Dave misses the chipmunks and he wishes they would come back home. He calls Ian to see if he can talk to them but Ian refuses, and then conceals Dave's motives from the boys. Later, the Chipmunks are wearing out, and it is all over the news. Angered by what Ian has done to the three, Dave decides to take matters into his own hands by infiltrating their concert.On the night before the big concert that is to transition the coast-to-coast tour into a world tour, a vet (Adriane Lenox) explains to Ian that the Chipmunks' voices have worn down due to exhaustion, and suggests that they take a long rest. Rather than cancel the concert and hand out refunds, Ian advises the Chipmunks to lip sync. With Claire's help, Dave sneaks into the concert, but gets ejected by security. With the commotion seen, the Chipmunks realize that they've been tricked and, deciding that they have had enough of Ian, they stall the concert. Ian locks them in a cage and prepares to take them to the world tour. Dave tries to convince Ian to let the boys go but Ian refuses. Ian then leaves in his limo with the boys and Dave chases them but the boys have already escaped to Dave's car. Dave immediately pulls over and admits that he loves them like his own family. Meanwhile, Ian looks in the cage and is shocked to see the boys have replaced themselves with international merchandising dolls.Later that night, the boys are fully accepted as part of the family, and they invite Claire over for dinner again. Alvin accidentally creates a short circuit after having difficulty opening a champagne bottle. Though Dave decides not to say his catchphrase, the short circuit causes a blackout in the kitchen. As a result, Dave can no longer prevent it and finally yells out his catchphrase, \"ALLLLVINNN!!\", to which Alvin responds with \"Okay!\".In a mid-credits scene, Ian (now unemployed) tries to make three squirrels sing, but fails. After this, a message is shown dedicating the film to the creator of the Chipmunks, Ross Bagdasarian, Sr., \"who was crazy enough to invent three singing chipmunks nearly fifty years ago\".","language":"English","box_office":"$361.3 million","cinematography":"Peter Lyons Collister","production_company":"Fox 2000 Pictures Regency Enterprises Bagdasarian Company Dune Entertainment III LLC","Marketing":"The video game for this film was released December 4, 2007 for the Wii, Nintendo DS, PlayStation 2, and the PC, just ten days before the film was released. It was written and produced by DeeTown Entertainment.","directed_by":"Tim Hill","Soundtrack":"The soundtrack was released November 20, 2007, three weeks before the film's opening and contains new versions of old songs such as \"Witch Doctor\" and \"The Chipmunk Song (Christmas, Don't Be Late)\" (as made famous by David Seville and The Chipmunks), cover versions of songs such as \"Bad Day\" (as made famous by Daniel Powter) and \"Funkytown\" (as made famous by Lipps Inc.) and new songs such as \"Coast 2 Coast\", \"Get You Goin'\" and \"Get Munk'd\". The second track on the album is \"The Chipmunk Song (Christmas Don't Be Late)\", a remake version, without Jason Lee as the voice of Dave. However, the seventh track, the rock version of the song features Jason Lee as the voice of Dave. The soundtrack is the first album to be released in three years by Bagdasarian Productions, and is the group's 43rd album overall. Four songs from the album have charted on the Billboard Hot 100.The album has been certified Platinum by the Recording Industry Association of America for shipments of over one million copies.In December 2007, the album debuted at #133 on the Billboard 200. In its second week of sales, however, the album jumped to #67 on the chart.The album's highest peak was #5 on the Billboard 200, making it the group's highest on the chart album since Chipmunks in Low Places (which peaked at #21).The album has been certified Platinum by the RIAA and has sold over 1,000,000 copies in the United States. By doing this, the album has become the group's first RIAA-certified album since Chipmunks in Low Places (which also went Platinum). Alvin and the Chipmunks: Original Motion Picture Soundtrack has become the Chipmunks' third Platinum album and sixth RIAA-certified album total.Four songs from the album managed to chart on the Billboard Hot 100 during the month of December 2007. By doing this, it became the group's first charting songs in 47 years (\"Alvin for President\" became the last charting single for the group; it peaked at #95 in 1960). Despite this feat, none of the songs were released as singles or ever solicited to mainstream radio (although it is possible that kid-oriented radio stations, such as Radio Disney, might have played them anyway) and charted solely because of high digital downloads caused by the anticipation of the group's film, Alvin and the Chipmunks.The four songs that charted on the Billboard Hot 100 (and with the chart peaks included and the songs' Hot Digital Songs peaks) were:A soundtrack sampler was released along with the DVD of the film in a two pack sold exclusively at Walmart.[13] This features five songs produced exclusively for the soundtrack.The film's original score was composed and conducted by Christopher Lennertz, a fan of the Chipmunks since childhood.[16] La-La Land Records released a limited edition album on September 19, 2008.","release_dates":"December 14, 2007 (2007-12-14)|||||","produced_by":"Janice Karman|Ross Bagdasarian|","starring":"Jason Lee|David Cross|Cameron Richardson|Justin Long|Matthew Gray Gubler|Jesse McCartney|","running_time":"92 minutes","Sequels":"A sequel, titled Alvin and the Chipmunks: The Squeakquel, was released on December 23, 2009. Zachary Levi joined the cast to replace Jason Lee due to his small role and because of his role on My Name Is Earl; the main cast members reprised their roles for the sequel and the film also re-introduced the Chipettes. A third film, titled Alvin and the Chipmunks: Chipwrecked, was released on December 16, 2011. A fourth film, titled Alvin and the Chipmunks: The Road Chip, was released on December 18, 2015.","music_by":"Christopher Lennertz","edited_by":"Peter Berger","Release":"Review aggregator Rotten Tomatoes gives the film a score of 27% based on reviews from 108, with a rating average of 4.4 out of 10. The site's critical consensus reads: \"Though cutely rendered, Alvin and the Chipmunks suffers from bland potty humor and a rehashed kids' movie formula.\"[4] On Metacritic, which assigns a normalized rating out of 100 to reviews from film critics, the film is considered to have \"generally unfavorable reviews\" with a rating score of 39 based on 23 reviews.[5] Joe Leydon of Variety called the film a \"harmless and frequently humorous trifle that might be a potent B.O. performer, if only by default, during a holiday season surprisingly short on kidpics\" and noted that \"homevid prospects are huge\";[6] the home video prediction later proved to be accurate. Roger Ebert of the Chicago Sun Times gave it two stars out of four, saying it is \"about as good as a movie with these characters can probably be...at some level, the movie may even be doing something satirical about rock stars and the hype machine.\"[7] The critics for The Guardian and The Observer were split, with Philip French saying it is a \"film that kids will love and adults will find tolerable\" and Peter Bradshaw giving it one star out of five and calling it a \"thoroughly brain-dead semi-animated family comedy\".[8]Alvin and the Chipmunks was released in North America on December 14, 2007. Despite negative reviews, the film grossed $44,307,417 in 3,475 theaters its opening weekend averaging to about $12,750 per venue, and placing second at the box office behind I Am Legend.[9] According to Box Office Guru, the first weekend was twice as much as Fox originally expected. Its second weekend was $28,179,556, behind National Treasure: Book of Secrets and I Am Legend. On its third weekend, it surpassed I Am Legend for #2 at the box office, but still ranked behind National Treasure: Book of Secrets. The film closed on Thursday June 5, 2008, making $217,326,974 domestically and $144,009,659 overseas for a total of $361,336,633 worldwide, making it a huge commercial success considering the film's modest $60 million budget.[9] The sustained box-office success of the film surprised 20th Century Fox; Elizabeth Gabler of Fox 2000 told the Los Angeles Times \"I look at the numbers every day, and we just laugh.\"[10] Given its budget, Alvin was far more profitable than either I Am Legend or National Treasure: Book of Secrets.[10] According to MTV, it also became the highest-grossing talking animal/cartoon adaptation until its sequel. It is also 20th Century Fox's highest grossing film domestically to be released in 2007.[1]Alvin and the Chipmunks was released for DVD and Blu-ray on April 1, 2008. The DVD release is presented on a double-sided disc, featuring both full screen (1.33:1 aspect ratio) and widescreen formats (1.85:1 aspect ratio) with English 5.1 Dolby Surround, Spanish and French Dolby Surround with English and Spanish subtitles. Special features include a preview of Dr. Seuss’ Horton Hears a Who!, a history of The Chipmunks, and an explanation of how the singing is created.[11] The Wal-Mart edition includes a bonus exclusive music CD.[11] The K-Mart edition includes a free junior novel of the film.[11] The Best Buy edition includes 3 mini plush toys of Alvin, Simon, and Theodore in a collectible box.[11]","budget":"$60 million"}