{"country":"United States","distributed_by":"Columbia Pictures (USA & Canada) Buena Vista Pictures (International)","Novelization":"A novelization of the film was published in June 1997 by author Max Allan Collins. Though the book has the same central plot and outcomes as the film, its main storyline significantly differs from the film.[18]","Plot":"American and Russian Special Forces capture General Ivan Radek (Jürgen Prochnow), the dictator of a rogue terrorist regime in Kazakhstan that possessed stolen Soviet nuclear weapons, threatening to start a new Cold War. Three weeks after the mission, U.S. President James Marshall (Harrison Ford) attends a diplomatic dinner in Moscow, during which he praises the capture and insists the United States will no longer negotiate with terrorists. Marshall and his entourage, including his wife Grace (Wendy Crewson) and daughter Alice (Liesel Matthews), and several of his Cabinet and advisers, prepare to return to the United States on Air Force One. In addition, a number of members of the press corps have been invited aboard, including Russian terrorists and Radek loyalists disguised as journalists led by Ivan Korshunov (Gary Oldman).After takeoff, Secret Service agent Gibbs (Xander Berkeley), who has been a mole, enables Korshunov and his men to obtain weapons and storm the plane, killing many of the other agents and military personnel before taking the civilians hostage. Marshall is raced to an escape pod in the cargo hold while pursued by Korshunov's men but they are too late to capture him as the pod is ejected. Instead, Korshunov storms the cockpit and prevents the plane from making an emergency landing at Ramstein Air Force Base in Germany, and secures Grace and Alice separately from the other hostages. Several F-15s escort Air Force One as Korshunov has it piloted towards Radek-loyal airspace.Unknown to Korshunov, Marshall, a Medal of Honor recipient, has remained hidden in the cargo hold instead of using the pod, and begins to observe the loyalists using his military training. Marshall manages to kill some of Korshunov's men and then uses a satellite phone to make contact with his Vice President Kathryn Bennett (Glenn Close), letting his staff know he is alive. Korshunov, believing that only a rogue Secret Security agent is in the cargo hold, contacts Bennett and demands Radek's release, threatening to kill a hostage every half hour. Marshall and military advisors devise a plan to trick Korshunov to take Air Force One to a lower altitude for a mid-air refueling, giving time for the hostages to parachute safely off the plane. As a KC-10 tanker docks with Air Force One, Marshall helps to kill another loyalist and escorts the hostages to the cargo hold, where most parachute away; Marshall insists on staying to rescue his family. Korshunov discovers the deception and forces Air Force One away, causing the fuel to ignite, destroying the tanker; the shockwave disrupts the escape process, and Korshunov is able to stop Marshall, Chief of Staff Lloyd Shepherd (Paul Guilfoyle), Major Caldwell (William H. Macy), and Gibbs from escaping.With the President and his family under his control, Korshunov forces Marshall to contact Russian President Petrov and arrange for Radek's release. Bennett is urged by Defense Secretary Walter Dean (Dean Stockwell) to declare the President incapable under the 25th amendment, so as to override Radek's release, but she refuses. While Korushunov and his men celebrate the news of Radek's release, Marshall breaks his bonds, kills Korshunov's last two henchmen, before strangling and throwing Korshunov off the plane when he tries to escape himself. Marshall races back to lift his order, and Radek is subsequently killed when he attempts to escape.Marshall and Caldwell direct the plane back to friendly airspace, accompanied by the F-15s, only to be quickly tailed by a second batch of Radek loyalists piloting MiG-29s. Marshall is able to evade most of the missile launches, while one F-15 pilot sacrifices himself to intercept a missile; the resulting explosion damages the plane's tail, and they start to lose altitude. A standby USAF Rescue HC-130 is called to help, sending parajumpers on tether lines to help rescue the survivors. Marshall insists that his family and the injured Shepherd be transferred first. When there is time for only one more transfer, Gibbs reveals himself as the mole, killing Caldwell and the parajumper. Marshall and Gibbs fight for control of the transfer line, and Marshall manages to grab and detach it at the last minute. Air Force One crashes into the Caspian Sea, killing Gibbs. The HC-130 airmen reel Marshall in, who is safely reunited with his family. The HC-130 is subsequently renamed \"Air Force One\" as they fly back to friendly space.","language":"English Russian","Reception":"Air Force One received generally positive reviews from critics, with an overall \"fresh\" rating of 79% on review aggregator Rotten Tomatoes.[4] Peter Travers of Rolling Stone awarded the film 3.5/4 stars, describing it as \"superior escapism\", and concluding, \"Air Force One doesn't insult the audience. It is crafted by a film-maker who takes pride in the thrills and sly fun he packs into every frame. Welcome to something rare in a summer of crass commercialism: a class act.\"[5] Todd McCarthy of Variety described the film as \"a preposterously pulpy but quite entertaining suspense meller\" that is \"spiked by some spectacularly staged and genuinely tense action sequences.\" He lauded the film's antagonist: \"[Gary] Oldman, in his second malevolent lead of the summer, after The Fifth Element, registers strongly as a veteran of the Afghan campaign pushed to desperate lengths to newly ennoble his country.\"[6]In a lukewarm review, Roger Ebert of the Chicago Sun-Times gave the film 2.5 stars out of 4 and found it flawed and cliché-ridden yet \"well-served by the quality of the performances ... Air Force One is a fairly competent recycling of familiar ingredients, given an additional interest because of Harrison Ford's personal appeal.\"[7] Adam Mars-Jones of The Independent was more critical, calling it \"so preposterous that it begins to seem like a science-fiction artifact...the product of a parallel-universe 1990s which somehow by-passed the decades since the 1950s.\"[8]The film was a major box office success, earning $172,650,002 (54.9%) domestically and $142,200,000 (45.1%) in other countries.[9] It grossed a total of $315,156,409 worldwide in the box office.[10] It was the year's fifth highest-grossing film worldwide.[11]President Bill Clinton saw the film twice while in office and gave it good reviews. He noted, however, that certain elements of the film's version of Air Force One, such as the escape pod and the rear parachute ramp, did not reflect features of the actual Air Force One.[12] In the audio commentary, Wolfgang Petersen mused that although the real plane did not have those features at the time of the filming, they would probably be added by future governments.The film was nominated for two Academy Awards; one for Best Film Editing, the other for Best Sound Mixing (Paul Massey, Rick Kline, Doug Hemphill and Keith A. Wester).[13]","box_office":"$315.1 million","air_force_one":"Theatrical release poster","cinematography":"Michael Ballhaus","production_company":"Beacon Pictures Radiant","directed_by":"Wolfgang Petersen","Score":"Randy Newman was initially hired to write the film score; however, Petersen considered his composition to be almost a parody and commissioned Jerry Goldsmith to write and record a more sombre and patriotic score in just twelve days, with assistance from Joel McNeely.[14][15] After the harrowing experience, Goldsmith vowed never again to take on such a last-minute task.[16]Newman used some of his material from the rejected score in Toy Story 3.[17]Varèse Sarabande released a soundtrack album featuring Goldsmith's music (McNeely receives a credit on the back cover for \"Additional Music in the Motion Picture\", but none of his work is on the CD, although his cues include the material heard when Air Force One is under attack).[original research?]","release_dates":"July 25, 1997 (1997-07-25)|||||","Production":"A large part of the crew took a tour of the real Air Force One before filming. They based some of the film's scenes, where the terrorists disguised as journalists survey the plane's layout and begin to take their seats, on the touring experience. The character of Deputy Press Secretary Melanie Mitchell was based largely on their real life tour guide, and the crew felt uncomfortable having to film the character's execution by the terrorists.[1]For the exterior scenes, the producers rented a Boeing 747-146 aircraft, N703CK from Kalitta Air and repainted it to replicate the iconic Air Force One livery. [2]Scenes explaining why Agent Gibbs was the mole were cut from the final script. According to director Wolfgang Petersen, Gibbs was a former CIA agent who lost a lot after the end of the Cold War and thus became angry with the American government.[1] The hijackers never reveal to anyone Gibbs' true identity, to the point where they also tie him up along with President Marshall, Major Caldwell, and Chief of Staff Lloyd Shepherd.Gary Oldman did not stay in character between the scenes. The director later said he called the filming experience \"Air Force Fun\" because of how comic and genial Oldman would be off-screen. He also said that Oldman would suddenly return to the menacing film persona like a shot.[1]General Radek's palace, seen in the film's opening, was portrayed by two locations in Cleveland, Ohio: the exterior was Severance Hall, and the interior was the Cuyahoga County Courthouse. The Russian prison where Radek was incarcerated was the Ohio State Reformatory, previously seen in The Shawshank Redemption.F-15 Eagle aircraft from the 33d Operations Group were used in the movie.[3]","produced_by":"Armyan Bernstein Gail Katz Jonathan Shestack Wolfgang Petersen","starring":"Harrison Ford Gary Oldman Glenn Close Dean Stockwell Xander Berkeley William H. Macy Paul Guilfoyle","running_time":"124 minutes","music_by":"Jerry Goldsmith","edited_by":"Richard Francis-Bruce","written_by":"Andrew W. Marlowe","budget":"$85 million"}