{"country":"United States","Awards and nominations":"Elizabeth Taylor was nominated for the Golden Globe Award for Best Actress – Motion Picture Drama but lost to Marsha Mason in Cinderella Liberty.","distributed_by":"Paramount Pictures","ash_wednesday":"Original poster","Plot":"In a desperate attempt to save her faltering marriage, 55-year-old Barbara Sawyer submits to full-body plastic surgery in a Swiss clinic, then checks into an exclusive ski resort Cortina d'Ampezzo to await the arrival of her attorney husband Mark. Reveling in her considerably younger and tauter appearance, she allows playboy Erich to seduce her. When Mark finally arrives, he makes an announcement that changes Barbara's initial plans forever.","language":"English","Critical reception":"The film's critical reception was reasonably favorable, particularly for Taylor, who was nominated for a Golden Globe. Rex Reed's review in The New York Observer amounted to a love letter to Taylor: \"She's subtle, sensitive, glowing with freshness and beauty, fifty pounds lighter in weight, her hair is coiffed simply, her clothes ravishing, her make-up a symphony of perfection. For those who grew up in love with Elizabeth Taylor, the movie is pure magic. She is once again the kind of star marquees light up for.\"Variety agreed: \"Taylor, fashionably gowned and bejeweled carries the film almost single-handedly. Fonda is excellent in his climatic appearance, an unusually superb casting idea. Taylor's performance also is very good, and relative to many of her recent roles, this is one of the strongest and most effective in some time. Her Beauty remains sensational.\"[1]Vincent Canby of The New York Times added a dissenting voice, saying the film \"was directed by Larry Peerce . . . and written by Jean-Claude Tramont with all the fearlessness and perception demanded in the boiling of an egg.\"[2]Roger Dooley of the Village Voice disagreed, thinking the film \"Elizabeth Taylor's best role in years... Jean Claude Tramont's screenplay, directed by Larry Pearce, makes one remember why millions of people used to enjoy movies.\"[3]Roger Ebert of the Chicago Sun-Times thought \"The movie's story is not really very interesting, but we're intrigued because the star is Taylor. She's 40 or 41 now, and yet she looks great. There's a kind of voyeuristic sensuality in watching her look at herself in the mirror (which she spends no end of time doing) . . . Maybe the fundamental problem with the movie is that we can't quite believe any man would leave Elizabeth Taylor. It's a good thing we never see Henry Fonda's bimbo, because if we did, we wouldn't be convinced.\"[4]","cinematography":"Ennio Guarnieri","production_company":"Sagittarius Productions","directed_by":"Larry Peerce","release_dates":"November 1, 1973 (1973-11-01)|||||","produced_by":"Dominick Dunne","starring":"Elizabeth Taylor Henry Fonda Helmut Berger","running_time":"99 minutes","music_by":"Maurice Jarre","edited_by":"Marion Rothman","written_by":"Jean-Claude Tramont"}