{"country":"United States","distributed_by":"Sundance Selects","language":"English","Reception":"Buck premiered at the 2011 Sundance Film Festival in Park City, Utah where it won the U.S. Documentary Competition Audience Award.[4]The New York Times gives Buck its NYT Critics' Pick.[5] John DeFore of The Hollywood Reporter calls the film \"a quietly captivating portrait of an unlikely character\" that is \"as modest as its subject and wins viewers over just as easily.\"[6] For The Washington Post, DeFore gives the documentary the Critic's Pick and writes Buck is \"one of those rare documentaries whose subject is so inherently fascinating that a fictional character could hardly compete.\"[7]Marshall Fine, of Hollywood and Fine, wrote in The Huffington Post that Buck is \"as engrossing as a documentary can be, a film that will touch you emotionally even as you watch the action in fascination.\"[8] David Edelstein, of NPR, call Buck a \"shambling yet uncannily beautiful documentary.\"[9]Roger Ebert of the Chicago Sun Times gives the film three stars and writes \"What I was left with was the goodness of Buck Brannaman as a man. He was dealt a hand that might have destroyed him. He overcame his start and is now a wise and influential role model. He does unto horses as he wishes his father had done onto him.\"[10]","box_office":"$3.4 million (8/11/11)[1]","Synopsis":"Buck explores the life of Buck Brannaman from his childhood living with an abusive father to his successful approach to handling and training horses. Brannaman worked on the Robert Redford film The Horse Whisperer as the lead equine consultant. He teaches people to communicate with their horses through leadership and sensitivity, not punishment.The documentary follows Brannaman to several stops on his normal, 40-week-per-year circuit of ranches where he gives clinics on \"natural horsemanship\". He spends most of the year on the road, apart from his wife and daughters. Along the way, viewers learn about his childhood including his celebrity as a child performer of rope tricks, the physical abuse that he and his brother endured at the hands of their father, how a football coach helped to free him from his father after seeing welts on Buck's back and legs, and life with the Shirleys, his foster parents.","cinematography":"Guy Mossman Luke Geissbühler","production_company":"Cedar Creek Productions, LLC","directed_by":"Cindy Meehl","buck":"Theatrical release poster","release_dates":"January 21, 2011 (2011-01-21) (Sundance)|June 17, 2011 (2011-06-17) (United States)||||","Production":"Buck was conceived, directed, and produced by Cindy Meehl. This is her first film. As Meehl watched Brannaman at one of his clinics in Pennsylvania, she thought, \"Everyone should know this. Everyone should know the way he teaches\".[2]Ultimately, she worked up the courage to ask Brannaman if he would be interested in making a film about his methods. During a clinic at the McGinnis Meadows Cattle & Guest Ranch in Montana, she spotted Brannaman sitting alone at lunch and approached him about doing a film. Two and a half minutes later, she had a \"yes\" and his phone number – and was off on a two year journey making her first film.[3] Meehl formed Cedar Creek Productions, LLC in 2008 to produce the film.","produced_by":"Andrea Meditch Julie Goldman Alice Henty","running_time":"88 minutes","music_by":"David Robbins","edited_by":"Toby Shimin"}