{"based_on":"the Biggles books  by W. E. Johns","country":"United Kingdom","distributed_by":"UIP (UK)","screenplay_by":"John Groves Kent Walwin","Plot":"Catering salesman Jim Ferguson (Alex Hyde-White), living in the present time in New York City, falls through a time hole to 1917 where he saves the life of dashing Royal Flying Corps pilot James \"Biggles\" Bigglesworth (Neil Dickson) after his photo recon mission is shot down. Before he can work out what has happened, Jim is zapped back to the 1980s. With assistance from Biggles' former commanding officer Raymond (Peter Cushing) who lives in the Tower Bridge in London, Ferguson learns that he and Biggles are \"time twins\", spontaneously travelling through time when one or the other is in mortal danger. Together, Ferguson and Biggles fight across time and against the odds to stop the Germans changing the course of history by destroying a \"Sound Weapon\" with a Metropolitan Police helicopter that was stolen by Biggles while escaping a SWAT Team in 1986 London.","language":"English","Reception":"The film premiered on Friday 23 May 1986[1] at the Plaza Cinema on Lower Regent Street in London,[11] and David Robinson in The Times was not impressed, writing that \"the flying ace might well have been made over into a sort of period James Bond. Instead there is a misguided and inept attempt to give the film an appeal for imagined mid-Atlantic teenage audiences\", and concluded that \"the script is witless, the direction is showy and the performances of the twin heroes (Neil Dixon as Biggles and Alex Hyde-White) are weakly amiable. The principal consolation is a cadaverous Peter Cushing as Biggles's old C.O., Captain Raymonds.\"[12]Later reviewers have not been less critical, although Scott McKenzie at DVDActive.com concludes that while the whole plot idea \"makes no sense whatsoever\", the dialogue is \"unbelievably corny\", and the soundtrack \"comes nowhere close to matching the mood of the movie\", he finds the flying scenes \"particularly impressive, with wing-mounted cameras putting the viewer right in the middle of the action. These sequences alone make Biggles an intriguing watch even for the most casual viewer.\"[13]","cinematography":"Ernest Vincze","production_company":"Compact Yellowbill Tambarle","directed_by":"John Hough","Video game":"As a tie-in to the film, a video game with the same title was released in 1986 by Image Works for the Amstrad CPC, Commodore 64 and ZX Spectrum.[14]","release_dates":"23 May 1986 (1986-05-23) (UK [1])|||||","Production":"The film was produced by Yellowbill Films, a company set up in 1979[4] by British producer Kent Walwin, and one of its first acquisitions was the rights to the Biggles character.[5] Additional financing came from a subsidiary of Hammer Films, Tambarle Ab Ltd,[6] and Heath Financial Services, a group of insurance brokers,[7] which the film is copyrighted by.[8] In 1988, Compact Yellowbill Ltd was set up,[9] a company 50/50 owned by Kent Walwin and the other producer, Pom Oliver, and the film's production credit was changed to that.The original script called for an adventure film in the mould of Raiders of the Lost Ark and would have been much more faithful to Johns' original novels. During scriptwriting, however, Back to the Future was released and became a major hit, so the script was duly altered to follow this trend, in an attempt to capitalise on Back to the Future's popularity.The film was mostly shot in London and on various locations in the home counties. Some of the aerial sequences were shot near Millbrook Proving Ground in Bedfordshire. The 1917 weapon testing ground scene was shot at the Beckton Gas Works, which a year later was used for scenes in Full Metal Jacket and had been the location for the pre title sequence in the 1981 Bond film For Your Eyes Only. The exterior church scenes were all filmed at All Saints Church, Holdenby, and the courtyard scenes were filmed by the stable blocks of Holdenby House.Several aircraft were used in the film. These included a Stampe SV.4, which is flown by Biggles, and a Boeing Stearman, which is flown by his archrival, von Stalhein. Both these bi-planes are actually from the 1930s. Also used in ground scenes are several genuine World War I aircraft from the Shuttleworth Collection, including the Avro 504 and LVG C.VI. The film includes a scene where Biggles lands the helicopter (a Bell 206 JetRanger) on a flat wagon on a moving train. This was filmed on the Nene Valley Railway and was apparently the first time such a stunt had been attempted.The film takes much liberty with the storyline of the original novels. In addition to the introduction of a science-fiction plot, Biggles is much older than in the books (where he is only a teenager in 1917), and the characters Ginger and Bertie feature although they don't join Biggles until much later in the book series. However, the presence of Biggles' friend Algy, adversary Erich von Stahlein and love interest Marie fits with the earlier books in the series.[10]Dickson later reprised the Biggles character in all but name in the Pet Shop Boys' 1987 feature film It Couldn't Happen Here.","biggles":"Original British 1986 quad film poster","produced_by":"Pom Oliver Kent Walwin","starring":"Neil Dickson Alex Hyde-White Fiona Hutchison Peter Cushing Marcus Gilbert William Hootkins","running_time":"92 min.[2]","music_by":"Stanislas Syrewicz","External links":"","edited_by":"Richard Trevor"}