{"country":"United Kingdom","distributed_by":"Metro-Goldwyn-Mayer","Plot":"When the Vikings invade England, Alfred (David Hemmings) is about to take his priesthood vows. However, his brother, King Æthelred of Wessex (Alan Dobie), summons him to his aid and Alfred leaves for battle, where he appears to be a great tactician. Æthelred dies shortly after Alfred marries the Mercian princess Aelhswith (Prunella Ransome). Torn between following intellect or passion, Alfred at first refuses to succeed Æthelred and consummate his marriage, but is forced to accept kingship after the Danes attack again.Realising the weak position of Wessex, Alfred goes into negotiations with Guthrum (Michael York), leader of the Vikings. Aelhswith on the other hand agrees to become Guthrum's hostage and they start to develop feelings for each other.Alfred has difficulty acting like a king, calling for obedience and egalitarianism in the Medieval society of three estates, which the fighting nobility does not appreciate. The cleric Asser (Colin Blakely) warns him that he is too proud and later, the Danes defeat Alfred. The latter is forced to retreat to the fens of Somerset. Roger's bandits, who take Alfred in, are more loyal to Alfred than his noblemen.The nobles however, drop their regicide plans and support Alfred in the climactic Battle of Athelney. Roger (Ian McKellen) sees that Alfred will need help and in the midst of battle, he arrives with monks, old men and peasant women, armed with clubs and pitchforks. Alfred defeats Guthrum, knocking him out, but decides to spare his life and forgives Aelhswith.[3]","language":"English","box_office":"$197,788 (US)[2]","cinematography":"Alex Thomson","directed_by":"Clive Donner","release_dates":"14 July 1969 (1969-07-14)|||||","Production":"Producer Bernie Smith says he became interested in Alfred the Great after reading about him in Winston Churchill's History of the English Speaking Peoples. Smith said he \"wanted a director who had never done a historical. That way I knew we could minimise cliches and the possibility of someone simply repeating, imitating what went before.\"[4] Clive Donner, then best known for What's New Pussycat? was hired, while Michael Killanin became associate producer.[5]Donner said he wanted to make the film \"because of the inherent youth problem which is so close to our so-called youth revolt; turning the destructiveness of youth into constructiveness. Like so many students today, he [Alfred] advocated peace, but at the same time proclaimed violence in order to redo the world.\"[1]The film was shot in County Galway, Ireland, including locations such as Castlehackett in Tuam,[6] Kilchreest, Ross Lake, and Knockma.[5]Many resources went into replicating the ninth century, turning parts of County Galway into Wessex. This included a 200-foot-long hill figure of a white horse near Knockma. Members of the Irish military served as extras during the battle scenes filmed in Counties Galway and Westmeath.[5]Mary J. Murphy discussed the film's production and reasons for its flopping in Viking Summer, the filming of Alfred the Great in Galway in 1968.[5]","produced_by":"Bernard Smith","starring":"David Hemmings Michael York Prunella Ransome Colin Blakely Ian McKellen Peter Vaughan Alan Dobie Julian Glover","running_time":"122 minutes","music_by":"Raymond Leppard","edited_by":"Fergus McDonell","written_by":"James R. Webb Ken Taylor","budget":"$6 million[1]"}