{"country":"United States","distributed_by":"Fox Star Studios Reliance Entertainment","Plot":"Firmly in the tradition of American Westerns, it follows the lives of the two orphaned brothers. The older one, Buddy, sees his father being shot. Vulnerable and described as “slow”, Buddy gets co-opted by gangster Julius Hench (Vincent D’Onofrio) and turns into his key assassin. While Buddy grows up in a lawless environment, younger brother Jakey is a violinist auditioning for the New York Philharmonic and on the verge of marrying his Portuguese girlfriend. But first Jakey must return to his dusty home town near the U.S.-Mexican border to receive his wedding present from his older brother. Returning to that one-horse town opens up unhealed wounds and forces Jakey and Buddy to confront some ugly truths.Hench won’t let Buddy quit the job. He will do anything to keep his most efficient, easily manipulated killing machine on his rolls, including bumping off Jakey. When Jakey realizes what Buddy is up against, he orchestrates a rather poorly designed plan to help them both escape from Hench.","language":"English","Reception":"The film received mixed reception from the critics.[6] Writing for Variety, Ben Kenigsberg gave a mixed review and said, \"This overwrought tale of two orphaned brothers and their violent hometown reunion fails to convince on several crucial levels, including plotting and dialogue. Despite name cast members and ace work from regular Clint Eastwood d.p. Tom Stern, the audience for this curio exists mainly in the Twilight Zone, which is where the movie often seems to be set.\"[7]","cinematography":"Tom Stern[2]","production_company":"Vinod Chopra Films","directed_by":"Vidhu Vinod Chopra","release_dates":"April 10, 2015 (2015-04-10)|||||","Production":"Principal photography began on October 29, 2012, in and around Los Angeles.[2]The teaser trailer for the film was released on December 19, 2014.[1] Reliance Entertainment is presenting the film together with Vinod Chopra Films.[5]","produced_by":"Vidhu Vinod Chopra","starring":"Vincent D'Onofrio|Anton Yelchin|Chris Marquette|María Valverde|Thomas Jane|","running_time":"101 minutes[3]","broken_horses":"Theatrical release poster","music_by":"John Debney[1]","edited_by":"Todd E. Miller","written_by":"Vidhu Vinod Chopra|Abhijat Joshi|","budget":"$20 million[4]"}