{"Cast":"The films and the game share a common cast. All of the actors (except Devon Bostick) have been mo-capped (for narrative sequences), their faces have been scanned and their voices have been recorded for the video game.[3]","country":"Canada France","distributed_by":"New Video Group","Plot":"The story is a prequel to the video game Assassin's Creed II. It centers on Giovanni Auditore, the father of the game's main character, Ezio Auditore da Firenze.Giovanni is an Assassin living in 15th-century Italy during the Renaissance. At this dawn of a new era, a conspiracy is being plotted by one corrupt family to overthrow the powerful Medici family and destroy a unified Italy. As an Assassin, Giovanni must face this threat and bring the guilty parties to justice. The story introduces the situation before Assassin's Creed II, and the enemies of both Giovanni and his son Ezio.In the city of Florence in 1476, the Assassin Giovanni Auditore monologues on how, hidden behind the enlightenment of the Renaissance, corruption, betrayal and murder are rife, but that in order to preserve justice, honor and the safety of his family, he will fight. From the shadows, he quietly watches his family enjoying themselves at dinner, before departing into the moonlit streets of Florence. Outside, he ambushes a party of mercenaries led by Rodrigo Borgia as they attempt to sneak out of the city under cover of darkness. Giovanni is able to kill two of the mercenaries and incapacitate the third, but Borgia escapes in the confusion.Giovanni brings the injured man to his master, Lorenzo de' Medici, and warns Lorenzo that he has heard rumors of an approaching event that will trigger a shift in power. Lorenzo has the captive interrogated; under torture on the rack, the prisoner confesses that in the city of Milan, on the day after Christmas, the Duke of Milan will be assassinated during the Feast of St Stephen, when the church bell strikes for the twelfth and final time. Giovanni races to Milan and finds the Duke at Mass in church, but is unable to intervene before the Duke is killed. The murderers are swiftly dispatched by the Duke's guards and Giovanni himself; however, Giovanni's efforts to try to subdue one of the killers for interrogation fail, as the guard kills the last assassin. Giovanni searches the body of one of the killers, finding a purse of gold coins stamped with the coat of arms of Venice.Returning home, Giovanni watches his elder sons play chess, advising his younger son Ezio on how to become a better player. In private, he monologues that the Duke of Milan's death has robbed Medici of a powerful ally, and that even now, his enemies will be plotting their next move. However, he now knows where to find them...Giovanni arrives in Venice to investigate the possibility that whoever ordered the Duke of Milan's assassination is hiding in the city. His investigations lead him to St Mark's Basilica and the Doge's Palace, where, after killing a guard to cover his tracks, he eavesdrops on a group of men (Silvio and Marco Barbarigo) conversing in a nearby room. He sees them dispatch a courier carrying a letter for 'their master' in Rome, insisting its delivery is of great importance. Giovanni tracks and intercepts the courier in Venice's back alleys; after a lengthy fight, Giovanni overpowers the courier and tries to interrogate him, but the courier refuses to talk, and kills himself on Giovanni's blade. Furious, Giovanni takes the letter, which bears the seal of the Barbarigo family, and returns to Florence.Back in Florence, Giovanni presents the letter to Lorenzo de' Medici: however, it is encrypted, written in a strange code. Lorenzo's aide, the Gonfaloniere of Justice Uberto Alberti states it will take some time to decode, and sends Giovanni home to get some rest, promising to call him when it is done. A priest in Medici's service (Father Antonio Maffei) translates the letter and presents it to Uberto, who tells Fr. Maffei to summon Giovanni and Lorenzo, but warns him to tell no one of the letter's contents. Back at his villa, Giovanni enjoys some time with his wife and family, before being summoned by Maffei to the palace. His son Ezio is confused as to why his father must leave so late in the night, and asks to go with him, but Giovanni refuses.At the palace, Uberto claims they were unable to translate the letter, and therefore the only way to see who it is intended for is to take it to Rome and deliver it personally. In spite of the danger, Giovanni volunteers to take it; Lorenzo instructs him to find his enemies... and show no mercy.Back in Venice, the Barbarigos, with Rodrigo Borgia at their head, pray \"May The Father of Understanding be with us!\" (confirming they are Templars) and prepare themselves for battle, arranging their swords in a familiar symbol.Giovanni arrives in Rome and delivers the letter as ordered, which is passed through the crowd until it reaches Borgia; Borgia goes straight to the Vatican, where he delivers the letter to Pope Sixtus IV. The pair discuss the fact that Lorenzo de' Medici is unwilling to bend to the Pope's authority; when Borgia suggests he could use force, the Pope agrees to lend his spiritual support and military aid to an endeavour to restore order in Florence.When Borgia leaves, he is followed by Giovanni, but he manages to give Giovanni the slip, and disappears into St Peter's Basilica. As Giovanni investigates inside, he is confronted by Borgia, who addresses him by name and remarks that what follows next is of his making. He appreciates that Giovanni's skills would be of much use to the Templar cause, and that if Giovanni joins them, he will live to see 'a new world'. When Giovanni refuses, and remarks the only way this will end is with an Assassin's blade in Borgia's throat, Borgia sneers \"We shall see!\", and orders his men to attack. Giovanni fights bravely and defeats his attackers, but is struck in the chest with a throwing knife by Borgia, and his hidden blade is broken. Though he survives, Borgia uses the distraction to escape.Badly wounded, Giovanni returns home to Florence, where his wife tends to his wounds. He confesses to her his fear that the Duke of Milan's assassination was merely the start of a conspiracy, and that the next blow will strike Florence; he fears for the safety of de'Medici, his allies and himself.Suddenly, Father Antonio Maffei, along with some armed men of the city guard, arrive at the house, asking for Giovanni. Giovanni has his elder son Federico tell the guards he has already left, then escapes through a hidden passage.Back in Rome, Borgia and his fellow Templars agree that the main threat to their plans is Giovanni; however, Borgia says he has a plan to deal with the Assassin, and that with him gone, nothing will stand in their way.Back in Florence, Giovanni prowls the streets (pausing to muse when he sees Ezio flirting with his girlfriend in the street), monologuing that dark days are approaching Florence and time is running out; the final battle is about to begin. He remarks that no matter what happens, he and his sons are \"the Auditore da Firenze, and we are Assassins!\"The film concludes with the message \"The conclusion... is in your hands\", setting the stage for Assassin's Creed II.","language":"English","cinematography":"Guy Dufaux","production_company":"Ubisoft (Montreal) Hybride Technologies","directed_by":"Yves Simoneau","Soundtrack":"The score of the films is composed by George S. Clinton, unlike Assassin's Creed II's soundtrack, which was scored by Jesper Kyd.[4]","release_dates":"26 October 2009 (2009-10-26)|||||","Production":"Both film makers and game makers worked very closely to link the two titles. Live actors were filmed on green screen (just like Hybride Technologies, participating in the production, did with 300, Sin City and Avatar) which was then replaced by the game's environment extracted from the engine to XSI (half of those assets were re-worked on the texture and geometrical levels before being exported to be used in the film).[3]About 50% of the costumes that appear in Lineage were authentic period re-creations leased from Italy, the rest of the costumes were designed and crafted by a 3rd party design studio on behalf of Ubisoft and assembled by a group of Montreal, Quebec costume specialists.[3]Corey May, the writer of Assassin's Creed II, worked closely with the Assassin's Creed: Lineage scriptwriter, William Reymond, in order to make sure both stories were linked to the original story.[3]","produced_by":"Pierre Raymond Serge Hascoet (executive) Yannis Mallat (executive) Yves Guillemot (executive) Ian Whitehead (line)","starring":"Romano Orzari","running_time":"36 minutes","music_by":"George S. Clinton","edited_by":"Isabelle Malenfant","Critical reaction":"IGN's Christopher Monfette said in a 2009 review that \"Lineage feels more like something that would make an excellent inclusion in a high-priced special edition than anything that one would pay to see\".[14] In a 2011 review R.L. Shaffer said that \"The short is very good, but not quite engaging enough to earn the series any new fans\".[15]","written_by":"William Reymond, Yves Simoneau","Promotion and release":"Ubisoft acquired on 8 July 2008 the post-production VFX studio Hybride Technologies based in Piedmont as part of the game company's strategy to extend its brands to other media and to converge gaming and filming entertainment.[5]A year later, during a press conference held at the E3 2009, Ubisoft revealed the making of short films based on the universe of Assassin's Creed II using the game's engine with the participation of Hybride and Ubisoft Digital Arts.[6] Ubisoft then released more details about the project during the 2009's Comic-Con, revealing some behind the scenes shots at the same period.[7]Ubisoft held a special press screening of the first episode at a theater in the Champs-Élysées on 19 October 2009[8] and a public teaser trailer was released on the same day.[9]The first episode was released on YouTube on 26 October 2009, though it was announced for the 27th, and it was showcased on YouTube homepage in eight different countries. It was also released on EuroGamerTV on 2 November 2009.[1] The second and the third parts of the Lineage were released on YouTube on 12 November 2009. The complete film was released two days later.[10]Assassin's Creed: Lineage was first released on DVD in March 2010 as a bonus content in a special Lineage Edition of Assassin's Creed II (also known as Special Film Edition). The DVD was included in the special editions of Assassin's Creed: Brotherhood: Auditore Edition (exclusive to Australia, Europe[11] and New Zealand)[12] and Limited Codex Edition.[13] A North American DVD release has been announced and will be in stores 15 November."}