{"country":"United States","distributed_by":"Jour de Fête Films Swift Distribution TLA Releasing","Critical response":"Critical reaction to Circuit was sharply divided, skewing to the negative. Variety, while finding that the film is \"unafraid to display the circuit's depressingly aimless hedonism and its seductive power for lonely bachelors\" and suggesting that it would be of \"immense interest in the gay [film] fest community\", also found that its \"sclerotic pacing and excessive length undermine its social ambitions\".[5] Boxoffice magazine concurred in these assessments, noting that director Shafer \"is unflinching in his exploration of the dark side of this particular niche of gay life, yet he manages to make it clear that it is indeed just a niche.\" The acting by the leads is described as \"stilted\" although work by supporting cast members including Allen and Katt is praised. Overall, \"the film itself is about something very interesting and odd that would probably work better as a real documentary without the insinuation of mediocre acting or a fairly trite narrative.\"[6]Conversely, the San Francisco Chronicle gave the film a positive review, saying it \"succeeds as a well-made evocation of a subculture, though director Dirk Shafer's uncontainable enthusiasm for the world he's exposing blunts his movie's edge\". Although calling some of the sequences \"banal\" and \"boring\", the Chronicle praises Drahos and Khabbazi's acting and states that \"here and there something happens that's jaw dropping\".[7] The New York Times suggests that Shafer covers and updates the territory explored by Larry Kramer in his 1978 novel Faggots. The Times finds that although the film would benefit from editing and some of the acting is awkward, \"there is a real subject here, and it is handled with intelligence and care\".[8]Circuit won the 2001 Coachella Valley Festival of Festivals Award for Best Film, Underground/Alternative Collection. The film was nominated for the 2002 Political Film Society Award for Exposé.","circuit":"Theatrical release poster","DVD release":"Circuit was released on Region 1 DVD on December 31, 2002. The DVD features a \"director's cut\" with approximately ten minutes of additional footage along with a commentary track by Shafer.","Plot":"The film opens with John (Jonathan Wade Drahos) regaining consciousness in a restroom stall at \"The Red Party.\" He stares at himself in the mirror and flashes back to when he was a small-town cop from Illinois who moved to Los Angeles, hoping to find a more welcoming environment. He temporarily moves in with his cousin Tad (Daniel Kucan), who is living with his suddenly ex-boyfriend Gill (Brian Lane Green) and Tad's new boyfriend Julian (Darryl Stephens). Tad is a filmmaker, shooting a documentary on circuit parties and Julian DJs at the parties. Gill takes John to a party in the Hollywood hills, where he meets Hector (Andre Khabbazi), a hustler who is battling mounting insecurities over his looks and age as he is about to turn 30. John and Hector forge a friendship and Hector introduces John to the world of circuit parties and illicit drugs.One of Tad's subjects is Bobby (Paul Lekakis), an exotic dancer and model who performs at circuit parties (and with whom coincidentally John tricked at a party). Bobby is HIV-positive but asymptomatic. Tad records Bobby's performance at a club. Also performing at the club, as a comedian, is Nina (Kiersten Warren), who coincidentally is a friend of John's. She is living out of her car so John invites her and her cat to stay with him in his new trailer.Tad shows his footage of Bobby to Gino (William Katt), who is an investor, to secure the funding to finish the film. Gino is involved in a number of business ventures, including running circuit parties with his wife Louise (Nancy Allen), distributing drugs and buying viatical settlements, including Bobby's. Gino offers Tad half the money he needs. After viewing the footage Gino angrily confronts Bobby, who remarks that Gino gambled by buying his insurance policy and lost.John follows Hector deeper into circuit scene, using a variety of drugs including Special K, GHB, cocaine, crystal meth and, suffering from body dysmorphia despite being in terrific physical shape, anabolic steroids.Gill has grown tired of Tad and Julian living with him and gives them a deadline for moving out. Initially he agrees to let them stay until after the White Party so Julian can earn rent money and Tad can finish his film but then decides he wants them out sooner. Desperate, Tad returns to Gino for more financing. Gino refuses. Louise, growing more disgusted with Gino, later secretly gives Tad the money.Gino becomes obsessed with Bobby and plans to kill him. He offers to pay Hector to sleep with Bobby and slip Bobby poisoned drugs.John begins working security for Gino's parties (which is largely an excuse for his own partying). One such party is The Red Party, where John runs into a drag queen who remembers him from his small town days. This reminder of his past nearly sends John over the edge, leading to the drug binge which lands him on the stall floor.Gill and Nina realize John is in trouble but are not able to help him. John goes so far as to prostitute himself, joining Hector for a scene in which they have sex while a client watches. John, disgusted with himself, argues with Hector and refuses to take his cut of the fee. Eventually Nina moves out after John, in a drug-induced rage, attacks her cat. John tries to seduce Gill, who refuses him because of his heavy partying and drug abuse.John reduces his partying and drug use and goes to Gill for a job with his landscaping business. He and Gill also pursue a romantic relationship, but John, having stopped his steroid use, can't perform sexually because his body feels \"soft.\" He returns to Hector for more \"juice.\"It is the weekend of the annual Palm Springs White Party. Gino has provided Hector, who has become more terrified about losing his youth and looks, with the poisoned drugs. Tad is going to the party to record the last footage he needs to complete his documentary, including Bobby's farewell performance. Julian is DJing. John is going to supervise security. He and Hector travel by limousine and they reconcile. After giving John his headphones to listen to a song, Hector confesses that he loves him. Gino and Louise are also at the party and amidst the chaos Louise leaves him.After Bobby's farewell performance, Hector goes to his room and they have sex for most of the night. When they're spent, Bobby says to Hector, \"you saved my life tonight.\" Hector replies, \"More than you'll ever know\" and ingests the poisoned drugs. He dies, on his 30th birthday.The next morning, Bobby discovers that Hector is dead. John, on his way to find Hector, runs into Gino outside the room, who says how sorry he is about Bobby's death, but trails off when Bobby walks out of the room. John looks in and sees Hector's body. He realizes Gino is involved and starts to attacks him, then, shattered by grief, runs off weeping.Six months later, John and Gill (still dating), Nina, Tad, Bobby, Louise and others gather for the premiere of Tad's documentary.","language":"English","box_office":"$235,087[1]","cinematography":"Joaquin Sedillo","directed_by":"Dirk Shafer","release_dates":"2001 (2001)|||||","Production":"Circuit was filmed over a six-month period in digital video.[2] Shafer, who was not part of the circuit party scene but who did some \"experimenting\"[3] as research for the film, used circuit party music to guide him in shaping the film. \"I picked out what I liked for this or that sequence, and pictured scenes to certain music.\"[3] Shafer based the character of Hector on a real person who, obsessed with growing older and his looks, killed himself on his 30th birthday.[4] To represent visually this obsession with youth and beauty, Shafer shot each character reflected in a mirror. \"That was a subtext in the movie. The characters are obsessed with their images/mirrors.\"[3] The film is narratively structured in 3/4 flashback, which Shafer describes as his \"homage to Funny Girl.\"[3]","produced_by":"Gregory Hinton Michael J. Roth Steven J. Wolfe","starring":"Jonathan Wade Drahos Andre Khabbazi Brian Lane Green Kiersten Warren Paul Lekakis William Katt Nancy Allen","running_time":"120 minutes","music_by":"Tony Moran","edited_by":"Glen Richardson","written_by":"Gregory Hinton Dirk Shafer"}