{"Cast":"In uncredited appearances: one of the dancers is Teri Garr; among the kids during the \"Confidence\" scene is a young Corbin Bernsen; and the little girl afraid to go down a playground slide, to whom Elvis sings, is Lisa Slagle, who later joined the Joffrey Ballet.[citation needed] Water Ski[4] and Corvette double for Elvis, Artie Warren.","country":"United States","distributed_by":"United Artists","clambake":"Theatrical release poster","Plot":"Scott Heyward (Presley) rebels against the plans and expectations of his father, extremely rich oil tycoon Duster Heyward (Gregory). Scott abandons his family, driving to Florida in his shiny red 1959 Chevrolet Corvette Stingray Racer to find himself. When Scott stops for gas and refreshments, he encounters Tom Wilson(Hutchins), who is on his way to take a job as a waterskiing instructor at a Miami hotel. Scott and Tom make small talk, and a chance remark by Tom gives Scott an idea: He switches identities with Tom so he can find out how people react to him as an ordinary person rather than a millionaire. Tom has fun staying at the same hotel and pretending he is rich.Shortly after, hotel guest Dianne Carter (Fabares) insists on taking a lesson minutes after Scott checks in with his new \"employer\". However, once they are out on the water, Dianne proves herself to be an expert skier, performing fancy maneuvers to gain the attention of wealthy young playboy James J. Jamison III(Bixby). Later, Dianne confesses to Scott that she is a gold digger, assuming that he is one too. Scott agrees to help Dianne land Jamison, but ends up falling for her himself.Scott persuades boat builder Sam Burton (Merrill) to allow him to rebuild the Rawhide, a damaged high-performance boat, and drive it in the annual Orange Bowl Race, which Jamison has won the last three years. Scott sends for some \"goop\", an experimental coating his father spent a lot of money trying (and failing) to perfect. Between his day job and moonlighting as a chemist, Scott is run ragged, but he manages to (hopefully) fix goop's major flaw: losing its strength in water. With no time for testing before the race, he applies it to the boat's hull and prays it will hold the Rawhide together.[2][3] Duster learns where his son is and comes to see what he is doing. To Scott's surprise, his father is enormously proud of what he has accomplished.Meanwhile, Jamison proposes to Dianne. Scott barges into the suite before she can give Jamison an answer, but the obviously jealous playboy informs Scott they are getting married right after he wins the race.In the race, Jamison takes the lead in his boat, the Scarlet Lady, but Scott passes him at the finish line. Dianne decides to give up her scheme and return home. Scott then offers to give Dianne a lift. On the drive, he gives her an engagement ring he bought with the winnings from the race. Dianne insists that Scott takes it back, but agrees to marry him. This prompts Scott to confess to Dianne who he really is. She does not believe him at first, but when he shows her his driver's license as proof, she faints.","language":"English","Reception":"The film premiered in October 1967, but did not have a wide release until December. The New York Times' Howard Thompson called the film \"a real Christmas clinker\" and a \"silly, tired little frolic,\" remarking that \"even staunch Presley admirers—and we're one of them when he delivers the likes of Fun in Acapulco and Viva Las Vegas—will have to strain to justify this one.\" Thompson's review dismisses everything in the film, including the co-stars, music, predictable finale, the overuse of rear-screen projection and the obvious West Coast location shots.[7]","cinematography":"William Margulies","production_company":"Levy-Gardner-Laven Rhodes Pictures","directed_by":"Arthur H. Nadel","Soundtrack":"The soundtrack album reached No. 40 on the Billboard album chart.","release_dates":"October 18, 1967 (1967-10-18) (USA)|||||","Production":"After numerous delays, principal photography on Clambake began on March 22, 1967. As Presley began the last decade of his life, Clambake was the last film for which he was able to demand and receive a $1,000,000 salary. The relative lackluster box office performance of this movie, combined with his desire to do more serious, less commercial films, meant that studios were no longer willing to guarantee him a seven-figure paycheck for his performance.In her 1985 book Elvis and Me, on which Sandra Harmon collaborated with her, Priscilla Presley writes that by the time filming was to begin on Clambake, Elvis's growing distress with the quality of his films led to a despondency accompanied by overeating that saw his weight balloon from his normal 170 lb (77 kg) to 200 lb (91 kg). (Elvis, Albert Goldman's biography of Presley, corroborates this.[page needed]) A movie studio executive ordered him to lose the weight in a hurry,[5] marking the introduction of diet pills to his already excessive regimen of medications.During this time Presley was growing increasingly interested in religious studies and spirituality, and reading a great deal on the subjects. Colonel Tom Parker felt that these pursuits were distracting Elvis from his performance, and while he ordered the singer to not read any books while the film was being shot, there is no evidence that Presley complied with the directive.[citation needed]Production was halted for nearly two weeks in the middle of filming when Elvis fell and hit his head in the mansion he was living in during the shooting, resulting in a mild concussion.[6]Although set in Florida, only some second unit stock footage was shot there. Virtually the entire film was shot in southern California (resulting in the scene with the sun seemingly setting over the ocean in the east). Several exterior \"Florida\" scenes also have very conspicuous California mountains in the background. Other bloopers include oil fields in \"Florida.\" The boats in the boat garage have registration numbers starting with \"CF\" (California) and not \"FL\" (Florida).In Japan, the film was released under the alternate title Blue Miami (rendered in Japanese script); a reference to the earlier Presley film Blue Hawaii.","produced_by":"Arthur Gardner|Arnold Laven|Jules Levy|","starring":"Elvis Presley|Will Hutchins|Shelley Fabares|Bill Bixby|","running_time":"100 minutes","music_by":"Jeff Alexander","edited_by":"Tom Rolf","written_by":"Arthur Browne Jr."}