{"country":"France","distributed_by":"StudioCanal","chaos":"Film poster","Plot":"Paul and Hélène, a wealthy Parisian couple, are preparing to go out for the evening. While driving, they see three men chasing a prostitute down the street. She begs them to save her by letting her into the car, but Paul locks the doors and drives away as the three men savagely beat her, leaving her unconscious in the street. He refuses to let Hélène phone an ambulance, afraid of being charged with not helping a person in danger (which is a crime in France).Hélène cannot forget the incident, and the next day she goes to the hospital, where she finds the prostitute, Noémie, in a coma. Moved, Hélène stops work and leaves her family responsibilities to stay with Noémie throughout her recovery, aiding her as she regains mobility and helping her to communicate since she can't yet speak. When one of the pimps returns to threaten and beat Noémie again into submission, Hélène follows him out of the hospital, knocks him unconscious with a wooden plank, and leaves him for the police to find.Meanwhile, Paul and Hélène's son Fabrice, a university student, is cheating on his girlfriend with another girl, who is pregnant. When his girlfriend discovers the truth, she destroys his apartment. He moves into Paul's apartment just as Hélène moves out, and the two girls follow him, much to Paul's chagrin.When Hélène returns home for a day, one of Noémie's pimps goes to the hospital with a friend and removes Noémie under the pretense that they are relatives taking her for a walk. Noémie, who still cannot speak, is unable to protest. Realising what has happened, she accosts the pimps on the street and takes Noémie to Paul's mother's house. There, Noémie recovers her ability to talk, and explains her life story:Her name is actually Malika, and she is a child of poor French-Algerian immigrants. At 17, her father attempted to sell her into an arrange marriage and she fled. She was picked up by a pimp, named Touki, on the street and he subsequently sold her into sexual slavery and had her hooked on heroin. She convinced Touki to move to Paris to speak to her step-mother and retrieve her passport. Her family kicked her out, and she formed plans to leave her life of forced prostitution behind. She sobered up and opened up an account with her sister, Zora's passport to put some money behind. She tried going to SOS Racism for help, but she was dismissed. She moved to Geneva and seduced a rich man and conned him into giving her all of his money and jewelry, just before he died. She and Touki returned to Paris with the money. However, the rich man's family went to the press with claims that their money was stolen from the bank. Her pimps found out that she laundered the money for herself and beat her into signing a proxy. She escaped, with Touki and the other two pimps chasing after her, which was when Hélène and her husband came across her in their car at the beginning.The two women plan Malika's freedom and revenge on her abusers. Hélène tells Malika that she her husband were the couple who locked the doors of their car during her attack, but Malika doesn't care. Later, she manages to distract Paul at the Basel airport, who looking for his Hélène, and has sex with him. All three manage to get on the same flight back to Paris, with Malika keeping her distance, in order to avoid the police. Hélène finally stands up to the selfishness of her husband and son. Paul falls madly in love with Malika, going insane when she doesn't call. Fabrice also meets and falls in love with her.Hélène and Malika set up the pimps and their gang to be arrested by the police. Touki is shot after trying to escape. Malika returns to her estranged family and tells her sister, Zora, that she will be forced into marriage as soon as she's old enough, just as Malika was at her age. To save her from a life of patriarchal misery, she begs her sister to come with her to live in freedom, but she refuses, saying she loves them.Malika meets up with Paul again and she takes him to his mother's house. When Zora is beaten by her sexist brothers, her father reveals that she will indeed be married to older man soon. Malika and Hélène rush to Marseilles and stop Malika's father from sending Zora off to a forced marriage. Her father curses her and she replies that it is the first time he has ever given her anything. The film ends with Malika, Hélène, Zora and Paul's mother sitting on a bench gazing at the sun.","language":"French","Reception":"Stephen Holden of The New York Times described the film as \"gripping feminist fable with a savage comic edge\".[3]","cinematography":"Jean-François Robin","directed_by":"Coline Serreau","release_dates":"3 October 2001 (2001-10-03)|||||","produced_by":"Christine Gozlan Alain Sarde","starring":"Vincent Lindon Catherine Frot Rachida Brakni","running_time":"109 minutes","music_by":"Saint Germain","edited_by":"Catherine Renault","written_by":"Coline Serreau","budget":"€7.29 million[1]"}