{"country":"United States","distributed_by":"Paramount Pictures","Possible sequel":"Having originally planned the film as a direct sequel to Cloverfield, Abrams suggested that he has thought of something that if they are lucky enough to get it made \"could be really cool that [it] connects some stories\" in a third film, even teasing a larger Cloverfield universe.[22][59] Interviews with Trachtenberg and Winstead confirm that the movie is, and always was intended to be, an expansion of the first film, with Trachtenberg calling it the \"Cloververse\".[60]Winstead has voiced her interest in returning for another installment.[61]","screenplay_by":"Josh Campbell|Matt Stuecken|Damien Chazelle|","story_by":"Josh Campbell|Matt Stuecken|","Plot":"Following an argument with her fiancé Ben, Michelle leaves New Orleans and drives through rural Louisiana. Late at night, she turns on the radio only to hear that there were continuous blackouts in major cities. Distracted by a call from Ben, Michelle gets into an accident and is rendered unconscious. She wakes up in a concrete room chained to a wall, and is approached by a man named Howard, who explains that an attack of unknown origin has taken place and that he brought her to his bunker after finding her on the side of the road. Michelle meets Emmett, another survivor who witnessed the attack and fled to Howard's bunker. During dinner, an unconvinced Michelle steals Howard's keys and tries to escape, but discovers Leslie, a woman suffering from severe skin lesions, begging to get into the bunker. When the desperate woman bangs her head against the bunker's reinforced door in an attempt to get in, Michelle realizes Howard was right and stays.As time passes, the trio begins adapting to living underground, and Howard tells Michelle about his daughter Megan, of whom he lost custody. But Michelle and Emmett eventually detect inconsistencies in his story, ultimately discovering that the picture of \"Megan\" Howard showed Michelle is actually that of Brittany, a high-school classmate of Emmett's younger sister who went missing two years before. Upon finding another photo of Howard and a glum Brittany in the bunker, Michelle and Emmett realize that Howard abducted and murdered Brittany. Realizing that Howard is dangerous, they begin to plan an escape and fashion a makeshift biohazard suit, but Howard discovers that they are planning something. In defense of Michelle, Emmett accepts the blame and claims he was creating a weapon in order to steal Howard's gun, wanting Michelle to respect him the same way she respected Howard. After seemingly accepting the apology from Emmett, Howard summarily murders him with a revolver. Michelle works to complete the biohazard suit but is again discovered by Howard, who realizes her true intentions of leaving. She dumps a vat of perchloric acid on him, severely burning him and inadvertently starting an electrical fire. She climbs through the air ducts despite the burnt Howard's protests that \"they will get you\", puts on the suit, and escapes outside, where she realizes the air is not toxic.A techno-organic extraterrestrial craft appears in the distance; the bunker then explodes from the fire, killing Howard in the process and drawing the craft's attention. Michelle is attacked by the craft and by a creature on the ground. The craft releases toxic gas, forcing her to take shelter in Howard's truck, which is then picked up by the craft as it attempts to consume her. However, Michelle assembles a Molotov cocktail and throws it into the craft, which is destroyed. Michelle drives away in Leslie's car and hears a radio broadcast about successful human resistance efforts. Survivors are directed to evacuate north of Baton Rouge, while those able to aid in the fight are directed to Houston; reaching a crossroads, she heads for Houston while another alien ship can be seen in the air.","language":"English","Reception":"As of June 2, 2016[update], 10 Cloverfield Lane has grossed $72 million in the United States and $36.2 million in other territories for a worldwide total of $108.3 million.[4]In the United States and Canada, the film made $1.8 million from its Thursday night previews at 2,500 theaters,[40][41][42] and $8 million on its first day (including Thursday previews).[43] In its opening weekend, it earned $24.7 million, finishing in second place at the box office behind Zootopia ($51.3 million), which was in its second weekend.[44]Outside North America, 10 Cloverfield Lane is receiving a staggered release,[45] across 54 countries.[46] It earned just $1.5 million in its opening weekend from six international markets with a bulk of it coming from Australia ($1 million).[45] Overall, the top openings were in the United Kingdom and Ireland ($2.2 million), South Korea ($1.7 million), and France ($1.4 million).[47][48]10 Cloverfield Lane received positive reviews from critics. On Rotten Tomatoes, the film has a rating of 90%, based on 250 reviews, with an average rating of 7.5/10. The site's critical consensus reads, \"Smart, solidly crafted, and palpably tense, 10 Cloverfield Lane makes the most of its confined setting and outstanding cast—and suggests a new frontier for franchise filmmaking.\"[49] Metacritic gives the film a score of 76 out of 100, based on 43 critics, indicating \"generally favorable reviews\".[50] Audiences polled by CinemaScore gave the film an average grade of \"B–\" on an A+ to F scale.[51]Bill Zwecker of the Chicago Sun-Times gave 10 Cloverfield Lane four stars out of four, commending the film as \"continually gripping and extremely engrossing ... [Dan Trachtenberg] helmed this film with artistry, imagination and skillful precision.\"[52] Jeannette Catsoulis of the New York Times praised the cast's performance and Jeff Cutter's cinematography, while writing: \"Sneakily tweaking our fears of terrorism, '10 Cloverfield Lane,' though no more than a kissing cousin to its namesake, is smartly chilling and finally spectacular. A sequel is virtually a given.\"[53] Alan Scherstuhl of Village Voice also praised the acting and technical aspects, but wrote that the film \"is less compelling in terms of character and meaning.\"[54]In a mixed review for Slant, Chuck Bowen found a lack of character development between the three leads, and labeled the film's ending as anticlimactic. Bowen also writes: \"The film hits its expositional narrative marks and nothing else ... 10 Cloverfield Lane will almost immediately evaporate from the mind, before J.J. Abrams commences in selling you the same thing all over again.\"[55] Soren Andersen of the Seattle Times, who gave 10 Cloverfield Lane one and half stars out of four, similarly criticized the film's ending, labeling it as \"full-bore\" and \"Too little. Too late.\"[56] James Verniere of the Boston Herald disapproved of the characters and pacing, and he ultimately described the film as \"a crummy, low-rent, intellectually bereft thriller.\"[57]","box_office":"$108.3 million[4]","cinematography":"Jeff Cutter","production_company":"Bad Robot Productions","Marketing":"The film's title was revealed on January 15, 2016 in a trailer attached to 13 Hours: The Secret Soldiers of Benghazi.[20] As with Cloverfield, a viral marketing campaign was used that included elements of an alternate reality game. Bad Robot kick-started the campaign in early February 2016 by updating the Tagruato.jp website[7] used in the original. The campaign revealed backstory information about the character Howard Stambler and his daughter.[36]","directed_by":"Dan Trachtenberg","release_dates":"March 8, 2016 (2016-03-08) (New York City)|March 11, 2016 (2016-03-11) (United States)|March 18, 2016 (2016-03-18) (United Kingdom)|||","Production":"10 Cloverfield Lane originated from an \"ultra low budget\" spec script penned by Josh Campbell and Matt Stuecken, titled The Cellar.[10][11] The Tracking Board included the script in \"The Hit List\" of 2012[11] – an annually published list of spec scripts written within the year that have impressed its voting members.[12] In 2012, Paramount Pictures bought the script and commenced further development under Bad Robot Productions for Insurge Pictures, Paramount's specialty label for films with a micro-budget. When Bad Robot became involved, the film was assigned the codename Valencia to keep exact details of the production a secret.[13]Damien Chazelle was brought in to rewrite Campbell and Stuecken's draft and direct the film. Chazelle dropped out from directing when his Whiplash project received funding.[6] On April 3, 2014, it was reported production for Valencia was greenlit to begin in the fall of 2014, under the direction of Dan Trachtenberg with the latest draft being written by Dan Casey.[14] A budget of about $5 million was reported to be expected, in keeping with the mandate of Paramount's Insurge division of producing micro-budgeted films.[15]On July 8, 2014, Variety reported John Goodman was in negotiations to star in the film.[16] On August 25, 2014, they reported Mary Elizabeth Winstead had entered negotiations,[17] and on September 22, 2014, John Gallagher, Jr. reportedly joined the cast.[18]During production, the filmmakers noticed core similarities to Cloverfield,[19] and decided to make the picture what Abrams calls \"a blood relative\" or \"spiritual successor\" of that film.[20][21] \"The spirit of it, the genre of it, the heart of it, the fear factor, the comedy factor, the weirdness factor, there were so many elements that felt like the DNA of this story were of the same place that Cloverfield was born out of,\" said Abrams. In other interviews he explained: \"Those characters and that monster [from Cloverfield] are not in this movie, but there are other characters and other monsters,\"[21] and \"This movie is very purposefully not called Cloverfield 2, because it's not Cloverfield 2, [...] So if you're approaching it as a literal sequel, you'll be surprised to see what this movie is. But while it's not what you might expect from a movie that has the name Cloverfield in it, I think you'll find that you'll understand the connection when you see the whole thing.\"[22][23][24] Winstead and Gallagher mentioned that during production they were aware that the film had thematic similarities to Cloverfield, but did not learn that there would be an official connection until they were informed of the chosen title, only a few days before the release of the trailer.[25] Abrams came up with the title after finishing Star Wars: The Force Awakens.[26][27]In a March 2015 interview, a few months after production wrapped, Winstead was asked about her experience during Valencia and described it as a \"really contained film\", reiterating the premise of The Cellar about a woman being trapped with her mysterious savior in a supposed post-nuclear fallout world.[28] Later in the month, Insurge Pictures was reported to have been dismantled and its staff absorbed by its parent company. Insurge's only film that had yet to be released was reported to be Valencia.[29] Speaking of rewrites that took place during production, Winstead called them \"nothing that was major\".[30]During an interview with Abrams to promote 10 Cloverfield Lane, he said the creative team behind the original had some ideas on developing Cloverfield 2, but the release of films such as Godzilla and Pacific Rim led them to abandon them as they found the concept of kaiju films played out.[22]Principal photography on the film began on October 20, 2014 in New Orleans, Louisiana.[31] Filming took place in chronological order on only one set.[32] Scenes involving explosions, fire, and smoke were shot in early December 2014 in Hahnville, Louisiana.[33] Filming ended on December 15, 2014.[34]Bear McCreary composed the music for the film.[32] The soundtrack was digitally released on March 11, 2016.[35]","produced_by":"J. J. Abrams|Lindsey Weber|","starring":"John Goodman|Mary Elizabeth Winstead|John Gallagher, Jr.|","running_time":"103 minutes[1]","10_cloverfield_lane":"Theatrical release poster","music_by":"Bear McCreary","edited_by":"Stefan Grube","Release":"The film was released in select countries on March 10, 2016, in regular and IMAX theaters, before its official release in North America on March 11, also in conventional and IMAX theaters.[37] Those who attended screenings of the film at AMC IMAX theaters were eligible to receive collectible movie posters, which illustrated the three main characters separately.[38] The film was rated PG-13 by the Motion Picture Association of America for \"thematic material including frightening sequences of threat with some violence, and brief language\".[39]","budget":"$15 million[2][3]"}