{"country":"United States","distributed_by":"Warner Bros.","best_in_show":"Theatrical release poster","Plot":"Best in Show is presented as a documentary of five dogs and their owners destined to show in the Mayflower Kennel Club Dog Show, held in Philadelphia. The documentary jumps among owners as they prepare to leave for the show, arrive at the hotel, and prepare backstage before their dog takes the show, as well as post-show. The owners and their dogs include:The owners and their dogs all arrive in time for the show, which is hosted by dog expert Trevor Beckwith (Jim Piddock), and oblivious \"color\" commentator Buck Laughlin (Fred Willard). During the first round, Beatrice is disqualified when Hamilton cannot control her, but the other four dogs advance to the final round. Just before the finals, Cookie dislocates her knee and insists that Gerry take over for her. Though the audience is initially awed by seeing Gerry's \"two left feet\" (the result of a birth defect), ultimately Winky takes Best in Show.Afterwards, the film explores what each character is doing after the competition. Gerry and Cookie return home to Florida and are overcome with attention after the victory. They go on to record, in amusingly bad style, songs about terriers but discover to Gerry's frustration that the recording engineer is yet another of Cookie's ex-boyfriends (Steven Porter). Sherri Ann and Christy have entered into a partnership (It is unknown if either Leslie has died or if he has gotten divorced from Sherri Ann.) and publish a magazine for lesbian owners of purebred dogs, called American Bitch. Harlan fulfills his dreams and becomes a ventriloquist, entertaining sparse crowds with a honky tonk song and dance number. Stefan and Scott are in the process of designing a calendar featuring Shih Tzu dogs appearing in scenes, with appropriate costume, from famous classic films, such as Gone with the Wind and Casablanca (and McMillan and Wife, for some reason.) Hamilton and Meg Swan have given Beatrice away, allowing them to enjoy a calmer, more loving partnership as well as a new dog (a pug) named Kipper, that they claim enjoys watching them make love. The closing shot is of the Pug attempting to have sex with the therapist's leg.","language":"English","Reception":"Best in Show received critical acclaim. The film has a 95% approval rating on Rotten Tomatoes, based on 110 reviews, with an average rating on 7.5/10. The site's critical consensus reads, \"A fine example of writer/director/star Christopher Guest's gift for improv comedy, Best in Show boasts an appealingly quirky premise and a brilliantly talented cast\".[3] The film also has a score of 78 out of 100 on Metacritic, based on 33 critics, indicating \"generally favorable reviews\".[4] It won American, British, and Canadian Comedy Awards. The film is number 38 on Bravo's \"100 Funniest Movies\". In 2012 Best in Show won a spot on Yahoo's list of the \"100 Funniest Movies to See Before You Die\".The film opened to a weekend gross of $413,436 to thirteen theatres with an average of $31,802 per theater. After opening to a total of 497 theaters, the film ended its run with a domestic total $18,715,392. With a foreign gross of $2,074,164 it brought the total gross revenue to $20,789,556.[1]","box_office":"$20.8 million[1]","cinematography":"Roberto Schaefer","production_company":"Castle Rock Entertainment","directed_by":"Christopher Guest","release_dates":"September 29, 2000","produced_by":"Gordon Mark Karen Murphy","starring":"Christopher Guest Eugene Levy Catherine O'Hara John Michael Higgins Michael McKean Michael Hitchcock Parker Posey Jennifer Coolidge Jane Lynch","running_time":"90 minutes","music_by":"Jeffrey CJ Vanston","edited_by":"Robert Leighton","written_by":"Christopher Guest Eugene Levy","budget":"$10 million[1]"}