{"country":"United States","distributed_by":"Trimark Pictures","screenplay_by":"Al Septien Turi Meyer Alex Zamm","story_by":"Al Septien Turi Meyer","Plot":"Edison (Carrot Top) is a poor, failed inventor and surf bum, but soon runs into and befriends wealthy business magnate Armand McMillan (Jack Warden). When Armand passes away shortly thereafter, he leaves Edison the majority of shares in his large invention corporation, and leaves his jealous nephew, his only living relative, Bradford (Larry Miller) only a surfboard. Bradford attempts to derail Edison's success by stealing his formula for glow in the dark, which had not previously existed in the reality of this movie, and sharing it with a consumer who covers himself in it and alleges that Edison's prize invention—a portable TV/TV dinner combo—leaks radiation. When Edison reveals to all that radiation causes sickness and death—but not a literal glowing—and that he had invented the formula for glow in the dark, the company is saved and Edison appoints beau Natalie Stockwell (Courtney Thorne-Smith) to run the company.","language":"English","Reception":"Chairman of the Board has received negative reviews, currently holding a Rotten Tomatoes approval rating of 13%.During a promotional appearance for the film on Late Night with Conan O'Brien, Thorne-Smith was the second guest after comedian Norm Macdonald, who frequently interrupted Thorne-Smith's attempt to promote the movie with jokes about Carrot Top and the movie failing at the box office, going so far as to say that the film's title should be \"Box Office Poison\", and claimed the title is spelled \"Chairman of the Bored\". This led to the apparent surprise and amusement of O'Brien, the audience, and even Thorne-Smith. This interview was selected as a top moment from Late Night in several compilation episodes and specials, and continues to be distributed today via outlets such as YouTube.Comedian and former Mystery Science Theater 3000 host Michael J. Nelson named the film the fifth worst comedy ever made.[1] It is currently among the 100 lowest rated movies on IMDb.[2]","box_office":"$181,233","cinematography":"David Lewis","directed_by":"Alex Zamm","release_dates":"March 13, 1998","produced_by":"Rupert Harvey Peter M. Lenkov","starring":"Carrot Top Courtney Thorne-Smith Larry Miller Raquel Welch","running_time":"95 minutes","music_by":"Chris Hajian","edited_by":"Jimmy Hill","budget":"$10 million"}