{"based_on":"Naruto  by Masashi Kishimoto","country":"Japan","distributed_by":"Toho","screenplay_by":"Masashi Kishimoto[1] Ukyō Kodachi","story_by":"Masashi Kishimoto","Plot":"The film opens with a battle between Sasuke Uchiha and an unknown adversary. Many years after the events of the main series, Naruto Uzumaki is the Seventh Hokage of Konohagakure. Naruto is married to Hinata Hyuga and they have two children, Boruto and Himawari Uzumaki. Boruto is in an elite team under Konohamaru Sarutobi, with Sasuke and Sakura Haruno's daughter Sarada Uchiha; and a mysterious boy named Mitsuki, as his teammates. Boruto is upset that Naruto focuses more on his Hokage duties than their family. Sasuke returns to Konoha to warn Naruto of the powerful enemy he encountered. After Boruto learns about Sasuke from Sarada, he requests Sasuke to train him to become strong enough to surpass Naruto. Sasuke agrees on the condition that Boruto performs the technique Rasengan which he learns from Konohamaru. When Boruto presents his completed but undersized Rasengan to Sasuke, Sasuke honors his promise despite feeling unconvinced, and teaches Boruto to prepare for the upcoming ninja exams. In the exams, Boruto's team excels in the first two stages. However, when Boruto defeats Shikadai Nara, Shikamaru and Temari's son, in the third stage with a multi-shadow clone jutsu, Naruto notice Boruto had used a device that can store and release jutsu. Therefore, he disqualifies his son and declares Shikadai the winner. Outraged, an argument ensues before two figures make their presence known; one of them – Kinshiki Ōtsutsuki.Alongside his master, Momoshiki Ōtsutsuki, they are revealed to be after Kurama's chakra by gathering scattered chakra to create another chakra fruit like Kaguya Ōtsutsuki had acquired to be immortal and invincible. Naruto eventually sacrifices himself to protect everyone, then entrusts Boruto's safety to Sasuke. Sensing that Naruto is still alive in another dimension, Sasuke allies himself with the remaining Kages – Gaara, Darui, Chojūro, and Kurotsuchi to rescue him. Boruto insists on joining them to make amends with his father. They arrive in the other dimension to find Naruto bound by the Ōtsutsuki duo, and the four Kage engage Kinshiki in a fight. When the Kage fail to subdue him, Naruto and Sasuke fight as well, but Momoshiki eventually turns Kinshiki into a chakra pill and swallows him to increase his strength. Momoshiki is overpowered, however, the conceited scientist Katasuke arrives and shoots Momoshiki with an experimental ninja tool that only restores his strength.Overpowered by Momoshiki's strength and left without options, Naruto lends his remaining chakra to Boruto while Sasuke distracts Momoshiki long enough for Boruto to create a giant Rasengan. Boruto blinds Momoshiki's Rinnegan and attacks him with Rasengan. Momoshiki ends up absorbing his own chakra along with Boruto's Rasengan, destroying him. After Boruto reconciles with his father, he resolves to become a ninja who protects the village from the shadows, so he supports Sarada's dream of being Hokage, confirm they have romantic feelings for each other.It ends with Konohamaru chased by a wild bear and Boruto, Sarada, and Mitsuki jump from the Hokage Monument into midair.In a post-credits scene, Boruto and Sarada ask Mitsuki who his parents are, and he reveals he is the son of Orochimaru, surprising both of them. Orochimaru himself is seen watching over them.","language":"Japanese","Reception":"The film was the 11th highest-grossing Japanese film (and the 7th highest-grossing anime film) at the Japanese box office in 2015, with ¥2.62 billion.[2] It earned ¥680.1 million yen (around US$5.46 million) during its debut giving the series its highest grossing opening.[10] On August 25 the film became the highest grossing in the Naruto series making ¥2.02 billion in 19 days with 1.56 million admissions.[2] The film grossed US$919,651 in the United States and Canada[3] and it has grossed CN¥102.9 million in China.[11]Amy McNulty of Anime News Network gave the film an overall grade of A-, calling it \"a step in the right direction for Masashi Kishimoto's Start of a New Era Project\".[12]","box_office":"¥2.62 billion US$40.2 million[2][3]","production_company":"Pierrot","directed_by":"Hiroyuki Yamashita","release_dates":"August 7, 2015 (2015-08-07)|||||","starring":"Yūko Sanpei|Kokoro Kikuchi|Junko Takeuchi|Noriaki Sugiyama|","running_time":"96 mins","music_by":"Yasuharu Takanashi"}