{"country":"United States","distributed_by":"Universal Pictures NBC (Original Airing)","Plot":"Lionel Evans (Charlton Heston) is the director of a well-respected symphony orchestra touring European concert halls around 1944 in WW2. In the midst of one concert, the city where they are playing is attacked by German troops, and when Evans and his musicians try to escape, they are captured by Nazi soldiers led by Col. Arndt (Anton Diffring). Evans and the orchestra are taken to a castle where they are to bide their time before being executed; but it turns out that Arndt's superior, Gen. Schiller (Maximilian Schell), is a big classical music fan. Schiller commands Evans and his symphony to prepare a special concert for the Nazis, but Evans realizes that the moment the concert is over, he and his musicians will be killed.","language":"English","counterpoint":"Film Poster","cinematography":"Russell Metty","directed_by":"Ralph Nelson","Music":"The orchestra's performances, which include works by Tchaikovsky, Beethoven, Brahms, Wagner, and Schubert, were performed by the Los Angeles Philharmonic Orchestra.[1]","release_dates":"March 13, 1968 (1968-03-13)|||||","Production":"Filmed at Universal Studios including a set built for The Hunchback of Notre Dame (1923 film), the film began shooting on 21 November 1966 and concluded 24 January 1967. Two days were removed from the production schedule and the script was rewritten without consulting the director Ralph Nelson.[2]","produced_by":"Richard Berg","starring":"Charlton Heston Maximilian Schell Leslie Nielsen Kathryn Hays","running_time":"107 Min.","music_by":"Bronislau Kaper","Translations":"Also known as:[3]Denmark : Krigens symfoni West Germany : Der Befehl Greece : Nyhtes kolaseos Finland : Sankareitten sinfonia France : La Symphonie des héros Italy : Sinfonia di guerra Spain : Una Tumba al amanecer Sweden : I krigets järngrepp Turkey : Esirler Kampı USA (working title) : The Battle Horns USA (working title) : The General","edited_by":"Howard Epstein","written_by":"James Lee (Screenplay) Joel Oliansky (Screenplay) Alan Sillitoe (novel)"}