{"based_on":"Charlotte's Web  by E. B. White","distributed_by":"Paramount Pictures","screenplay_by":"Susannah Grant Karey Kirkpatrick","Plot":"One spring, on a farm in Somerset County, Maine, Fern Arable (Dakota Fanning) finds her father about to kill the runt of a litter of newborn pigs. She successfully begs him to spare its life. He gives it to her, who names him Wilbur and raises him as her pet. To her regret, when he grows into an adult pig, she is forced to take him to the Zuckerman farm, where he is to be prepared as dinner in due time.Charlotte A. Cavatica (Julia Roberts), a spider, lives in the space above Wilbur's sty in the Zuckermans' barn; she befriends him and decides to help prevent him from being eaten. With the help of the other barn animals, including a comedic rat named Templeton (Steve Buscemi), she convinces the Zuckerman family that Wilbur is actually quite special, by spelling out descriptions of him in her web: \"Some pig\", \"Terrific\", \"Radiant\", and \"Humble\". She gives her full name, revealing her as a barn spider, an orb-weaver spider with the scientific name Araneus cavaticus.The Arables, Zuckermans, Wilbur, Charlotte, and Templeton go to a fair, where Wilbur is entered in a contest. While there, Charlotte produces an egg sac. She cannot return home because she is dying. Wilbur and Templeton bid emotional goodbyes to her but manage to take her egg sac home, where hundreds of offspring emerge. Most of the young spiders soon leave, but three, named Joy, Aranea, and Nellie, stay and become Wilbur's friends.","language":"English","Reception":"Reviews were generally positive, especially with respect to Dakota Fanning's portrayal of Fern. The film currently holds a 78% \"Certified Fresh\" rating at Rotten Tomatoes.[7] Michael Medved gave Charlotte's Web three and a half stars (out of four) calling it \"irresistible\" and \"glowing with goodness\". Medved also said that Dakota Fanning's performance was \"delightfully spunky\".[8] Entertainment Weekly's Owen Gleiberman complains that the film is \"a bit noisy\" but applauds the director for putting \"the book, in all its glorious tall-tale reverence, right up on screen.\" He goes on to say that \"What hooks you from the start is Dakota Fanning's unfussy passion as Fern.\"[9]Colm Andrew of the Manx Independent gave the film 6/10, saying that the main problem was \"the ultra-cute characterisation of Wilbur, resulting in half the audience rooting for his demise\" although overall it was \"a competent retelling of a classic story that won't offend\".[10]The film was awarded a 2006 Critics' Choice Award for Best Family Film in the live-action category,[11] and Fanning won the Blimp Award for Favorite Movie Actress at the 2007 Kids' Choice Awards.The film debut in third place at the box office with only $11 million. The film performed very well after spending 14 weeks in theaters for a total of $82 million, $61 million elsewhere, for a total of $144 million before closing on March 22, 2007.[1]","box_office":"$144,877,632","cinematography":"Seamus McGarvey","production_company":"Kerner Entertainment Company Walden Media Nickelodeon Movies","directed_by":"Gary Winick","Video game":"A video game of the movie, developed by Backbone Entertainment and published by THQ and Sega, was released on December 12, 2006 for the GBA, Nintendo DS, PS2 and PC.","Soundtrack":"Charlotte's Web: Music from the Motion Picture was released by Sony Classical on December 5, 2006. In addition to the instrumental score by Danny Elfman, the soundtrack includes a song named \"Ordinary Miracle\" by Sarah McLachlan, which she herself performed during the opening ceremonies of her hometown Vancouver Winter Olympics. A CD compilation of \"Music Inspired by the Motion Picture\" was issued on December 12, 2006.","narrated_by":"Sam Shepard","release_dates":"December 7, 2006 (2006-12-07) (Australia)|December 15, 2006 (2006-12-15) (United States)||||","Production":"Charlotte's Web was produced without any involvement from E. B. White's estate.[2] It was the first film based on a book by E. B. White since 2001's The Trumpet of the Swan. Paramount had distributed the film as a result of its acquisition of DreamWorks, whose animation division became its own company in late 2004.Major shooting was completed in May 2006. It was filmed on location in Bacchus Marsh, Victoria and suburbs in Melbourne, Australia. The fair scene in the story was filmed in Heidelberg in Melbourne, Australia at Heidelberg West Football Club's football ground.Visual effects are by Rising Sun Pictures, Fuel International, Proof, Rhythm and Hues Studios, Digital Pictures Iloura and Tippett Studio. The visual effects supervisor for the film as a whole was John Berton, who noted that a live action version of Charlotte's Web has become much more practical in recent years due to advances in technology.[3] Winick \"was adamant\" that Charlotte and Templeton (the film's two entirely computer-generated characters) should be realistic and not stylized, although they did give Charlotte almond-shaped eyes.[4] John Dietz, visual effects supervisor for Rising Sun Pictures, notes that there was a debate over whether to give her a mouth, and that in the end they decided to have her chelicerae move in what he describes as being almost like a veil, as if there were a mouth behind it.[5]","produced_by":"Jordan Kerner","starring":"Dakota Fanning Julia Roberts Steve Buscemi Cedric the Entertainer John Cleese Oprah Winfrey Thomas Haden Church Andre Benjamin Reba McEntire Kathy Bates Robert Redford","running_time":"97 minutes","charlotte's_web":"Theatrical release poster","music_by":"Danny Elfman","edited_by":"Susan Littenberg Sabrina Plisco","Release":"The film was at one time intended for a June 2006 release, but was pushed back to December 2006 to avoid competition with two other films from Nickelodeon Movies - Nacho Libre and Barnyard - as well as Over the Hedge and Cars among other films. It was released in Australia on December 7, 2006 and in the United States and Canada on December 15, 2006.[6] The U.S. and Canadian release date matches that of 20th Century Fox's Eragon, another film with fantasy elements and a young protagonist. The scheduled release date in the UK is February 9, 2007.Charlotte's Web was released on DVD on April 3, 2007 in the United States and Canada and May 28 in the United Kingdom. It was released on Blu-ray on March 29, 2011 along with The SpongeBob SquarePants Movie.","budget":"$85 million[1]"}