{"based_on":"Crazy Heart  by Thomas Cobb","country":"United States","crazy_heart":"Theatrical release poster","distributed_by":"Fox Searchlight Pictures","screenplay_by":"Scott Cooper","Plot":"Otis \"Bad\" Blake (Jeff Bridges) is a 57-year-old alcoholic singer-songwriter who was once a country music star. He now earns a modest living by singing and playing his guitar at one-night stands, in small town bars, in the southwestern United States. Having a history of failed marriages (four that he admitted to, although a reference is made to a fifth he does not discuss) Blake is without a family. He has a son, aged 28, with whom he has not had contact in 24 years. He is mostly on the road performing, staying in cheap motels and traveling in his old '78 Suburban alone. The film opens with his arrival at a bowling alley for a show.Enter Jean Craddock (Maggie Gyllenhaal), a young journalist after a story, divorced and with a four-year-old son, Buddy (Jack Nation). She interviews Blake, and the two enter into a relationship. Jean and her son become a catalyst for Blake beginning to get his life back on track. In doing so, he lets himself be pushed into renewing a professional relationship with Tommy Sweet (Colin Farrell), a popular and successful country music star he once mentored, and plays as the opening act at one of Tommy's concerts, despite his initial balking and wounded pride at being the opening act to his former student. He asks Tommy to record an album with him, but Tommy says his record company insists on a couple more solo albums before a duet project can be recorded. He instead suggests that Blake concentrate on writing new songs that Tommy can record solo, telling him he writes better songs than anyone else.Blake's drinking soon gets out of control, and he ends up running off the road while driving drunk. In the hospital, the doctor informs him that although he only sustained a broken ankle from the crash, he is slowly killing himself, and must stop drinking and smoking and lose 25 pounds if he wants to live more than a few more years. Blake's relationship with Jean makes him start to rethink his life. He calls up his son to make amends, only to have his son tell him that his mother, Bad's ex-wife, has died, and hang up on him. The relationship starts to look up, with Jean visiting him with her son Buddy. After a situation where Blake loses Buddy briefly at a shopping mall while drinking at a bar, Jean breaks up with him.After losing Jean and her son, who were becoming his only family, Blake resolves to quit drinking. After going through a treatment program at a rehab center, and with support from his Alcoholics Anonymous group and his old friend Wayne (Robert Duvall), Blake finally manages to get sober. Having cleaned up his act, he tries to reunite with Jean, but she tells him that the best thing he can do for her and Buddy is to leave them alone. After losing Jean, Blake finishes writing a song that he thinks is his best ever, \"The Weary Kind\", and sells it to Tommy.Sixteen months later, Tommy plays \"The Weary Kind\" to an appreciative audience while Blake watches backstage, as his manager presents him with another of the large royalty checks for the song. As Blake is leaving, Jean approaches him, saying she has come to the show as writer for a large music publication. As they catch up, Blake sees an engagement ring on Jean's finger and tells her that she deserves a good man. He offers her the money from that royalty check for Buddy to have for his 18th birthday, which Jean initially refuses but eventually accepts after Blake says the song would not exist without them. Jean asks if Blake would like to see Buddy again, but Blake declines saying it might be too unsettling for the young boy. The film ends with them walking away from the concert and chatting to each other.","language":"English","Reception":"Review aggregator Rotten Tomatoes reports that 91% of critics have given the film a positive review based on 199 reviews, with an average score of 7.4/10.[13]Critics mainly praised the performance of Jeff Bridges as Bad Blake, with many claiming he elevated the film above its seemingly conventional story and languid pace. Tom Long from Detroit News writes, \"It's a bit too easy, a bit too familiar, and maybe even a bit too much fun. But the easy magic Bridges brings to the screen makes it all work.\"[14] The Toronto Star 's Linda Barnard attests that \"some goodwill evaporates in the final reel, when a few false endings lead to a choice that's not the best one for Crazy Heart, but the generosity of Bridges' performance puts us in a forgiving mood.\"[15]Jeff Bridges' performance earned him the Academy Award for Best Actor, as well as Best Actor prizes from the Los Angeles Film Critics Association, Broadcast Film Critics Association, Golden Globe Awards, Screen Actors Guild and the Independent Spirit Awards. Bridges also received nominations from the Chicago Film Critics Association, London Critics Circle, Online Film Critics Society and the Satellite Awards. Gyllenhaal was nominated for an Academy Award for Best Supporting Actress for her performance. The song \"The Weary Kind\" earned Ryan Bingham and T Bone Burnett the 2009 Academy Award for Best Original Song[16] and a Golden Globe.[17]","box_office":"$47.4 million[2]","cinematography":"Barry Markowitz","production_company":"Informant Media Butcher's Run Films Dune Entertainment","directed_by":"Scott Cooper","Home media":"The film was released on April 20, 2010, on DVD and Blu-ray. The single-disc DVDs special features included six deleted scenes, while the Blu-ray 2-disc set contained eight deleted scenes (including one in which Bad reunites with his son), plus two alternative music cuts and a short documentary in which the stars discuss \"What Brought Them to Crazy Heart\".[18]","release_dates":"December 6, 2009 (2009-12-06) (Santa Fe Film Festival[1])|December 16, 2009 (2009-12-16) (United States[2])||||","Production":"The New York Times said the novel, written by Thomas Cobb, \"also functions as a shrewd and funny running critique of contemporary country music.\"[9] Cobb based the character \"Bad\" Blake on country music entertainer Hank Thompson, Ramblin' Jack Elliott and Cobb's doctoral advisor in graduate school, Donald Barthelme;[10] Cobb studied with Barthelme in a creative writing class in the University of Houston in the 1980s. When Cobb struggled between using an \"upbeat\" ending and a \"downbeat\" ending, Barthelme suggested that Cobb use the \"downbeat\" ending.[9] The nickname \"Bad\" came from a sentence that popped into Cobb's mind, \"Bad's got the sweats again.\" \"Blake\" came from W. Glenn Blake, and a friend from graduate school, and some people Cobb knew in Tucson, Arizona.[11] The book, which was out of print since its original publication, went into print again when the film was released.[9]The process of creating a film adaptation took many years because the concept was optioned, but was never produced into an actual adaptation until director Scott Cooper produced the film.[11] Cobb assumed that the film would use a more upbeat ending, because the Hollywood film industry often prefers \"things that are generally positive\".[9] According to Cobb, he had nothing to do with the making of the film.[10] The shooting of a sequence depicting the novel's ending - in which Bad falls off the wagon and dies of a heart attack - occurred; Cooper wanted to use it as the ending, but he did not get final authority to do so. A sequence of Bad Blake visiting his son in Los Angeles was also cut from the final film.[11]Bridges initially passed on the role when he was first offered it. He explained to Vanity Fair that although he liked the script, he realized that the songs would make or break it and at the time the film had no musical attachments.[12] A year later he talked with T-Bone Burnett who was approached to work on the film's soundtrack, together they both agreed to work on the film and Bridges joined the project.[12]The album entitled Crazy Heart: Original Motion Picture Soundtrack was released in 2009 to accompany the film. The 23-track album contains many songs written by Burnett, Bruton, and Bingham, but also some by John Goodwin, Bob Neuwirth, Sam Hopkins, Gary Nicholson, Townes Van Zandt, Sam Philips, Greg Brown, Billy Joe Shaver, and Eddy ShaverThe songs are performed by various artists including actors Bridges, Farrell, and Duvall, as well as singers Bingham (who sings the theme song \"The Weary Kind\" and plays Tony in the film), Buck Owens, The Louvin Brothers, Lightnin' Hopkins, Waylon Jennings, Townes Van Zandt, and Sam Philips.At the 82nd Grammy Awards, the theme song \"The Weary Kind\" by Ryan Bingham won for Best Song Written For Motion Picture, Television Or Other Visual Media and the soundtrack also won for Best Compilation Soundtrack Album For Motion Picture, Television Or Other Visual Media.","produced_by":"Robert Duvall Rob Carliner Judy Cairo T Bone Burnett Scott Cooper","starring":"Jeff Bridges Maggie Gyllenhaal Colin Farrell Robert Duvall","running_time":"112 minutes","music_by":"Stephen Bruton T Bone Burnett Ryan Bingham","edited_by":"John Axelrad","budget":"$7 million[2]"}