{"based_on":"Sammy's Hill by Kristin Gore","country":"United States","distributed_by":"Millennium Entertainment","screenplay_by":"David O. Russell (as Stephen Greene) Kristin Gore Dave Jeser Matt Silverstein","language":"English","Reception":"Review aggregator website Rotten Tomatoes reported a 7% approval rating, with a rating average of 3.3/10, based on 31 reviews.[13] On Metacritic, which assigns a normalized rating out of 100 based on reviews from critics, the film has a score of 20 based on 13 reviews, indicating \"generally unfavorable reviews.\"[14]","box_office":"$4,500[2]","cinematography":"Max Malkin","production_company":"K. JAM Media Persistent Entertainment Vocal Yokels","directed_by":"David O. Russell (as Stephen Greene)","accidental_love":"Theatrical release poster","release_dates":"February 10, 2015 (2015-02-10)|||||","Production":"Red Wagon Productions' Douglas Wick and Lucy Fisher first developed the property, hiring Kristin Gore—daughter of Al Gore—to adapt the screenplay based on her 2004 novel Sammy's Hill.[3] In 2008, Russell was named the director of the film, then titled Nailed. Russell, Wick, and Fisher were reportedly promised a budget of $26 million by Capitol Films, a production company led by then-Hollywood newcomer David Bergstein.[4] Principal photography began in April 2008.[5] That month, James Caan dropped out of the film, after \"creative differences\" over his character's death scene.[6] Production was shut down frequently—as many as 14 times—for nonpayment of the cast and crew, leading to walk-outs by stars Biel and Gyllenhaal as well as several crew members.[7] Bergstein attributed the film's financial woes to the 2008 financial collapse, but the filmmakers believed they were being \"intentionally squeezed.\" In a dispute over control of the film, and to prevent the possibility of Capitol releasing an unpolished version of the film, Wick and Fisher decided to withhold film negatives and postpone shooting the crucial sequence in which Biel's character is injured with a nail gun until the final day of filming. As a result of one of the unions eventually pulling support for the film with only two days left to shoot, the sequence was not shot and the film was left incomplete.[4]In early 2010, the film's financier Ronald Tutor, who controlled the film's rights along with Bergstein, paid millions of dollars to get several films, including Nailed, out of a foreclosure action. Bergstein hired an editor to assemble a cut of the film that was shown to Russell when he was asked to return and film reshoots. Russell and Tutor were unable to strike a deal and Russell permanently left the production in July. According to The Hollywood Reporter, Russell's primary grievance was Wick and Fisher being pushed to accept 50% pay cuts. The producers, who also left the film, called requested concessions \"unfair, unprofessional and detrimental to the movie.\"[3] Russell said of quitting the film: \"This has been a painful process for me. The multiple production delays and stoppages, which were caused by David Bergstein and preceded Ron Tutor's direct involvement with me, have now spanned two years, and the circumstances under which the film would now be completed are much different on several fundamental levels than when we embarked several years ago. I, unfortunately, am no longer involved in the project and cannot call it 'my' film. I wish Ron Tutor well.\"[3] Contractual agreements required Biel and Tracy Morgan to film reshoots, which did not involve Russell.[3]Capitol Productions went bankrupt in 2010 and the property was purchased in 2014 by independent distributor Millennium Entertainment for an undisclosed sum. Retitled Accidental Love, a cut was assembled under producer Kia Jam, a former executive with Capitol, who said, “People are expecting to see a broken film, and it’s not. We tried very much to be respectful of the creative forces behind it.”[4] With the film set to be released, Russell negotiated with the Directors Guild of America to remove his name from the film; he is credited for his roles as director and co-writer as \"Stephen Greene,\"[4] an alternative to the former official pseudonym, Alan Smithee, used by directors wishing to disown a film.","produced_by":"Kia Jam Judd Payne Matthew Rhodes","starring":"Jessica Biel Jake Gyllenhaal Catherine Keener James Marsden Tracy Morgan James Brolin","running_time":"100 minutes","music_by":"John Swihart","edited_by":"Mark Bourgeois Robert K. Lambert","Release":"In March 2011, an unfinished cut of the film was screened in Los Angeles.[8] The film was released on VOD on February 10, 2015.[9] The film was released in a limited release on March 20, 2015 bringing in a low gross of $4,500.[2] It was released on DVD and Blu-ray in the United States on April 28, 2015.[10]Following a home video release by Mongrel Media in Canada, A.A. Dowd, film critic with The A.V. Club, accused the company of quoting his review out of context, making a negative film review look like a positive one.[11] In response to the accusation, Mongrel Media issued an apology and claimed they would remove the quote from further prints of the DVD.[12]","budget":"$26 million[1]"}