{"country":"United States","distributed_by":"20th Century Fox","Plot summary":"Stefan \"Stef\" Djordjevic (Tom Cruise) is a Serbian American high school defensive back who is both gifted in sports and academics seeking a college football scholarship to escape the economically depressed small western Pennsylvania town of Ampipe and a dead-end job and life working at the mill like his father and brother Greg. Ampipe is a company town whose economy is dominated by the town's main employer, American Pipe & Steel, a steel mill struggling through the downturn of the early 1980s recession. Stef gets through his days with the love of his girlfriend, Lisa Lietzke (Lea Thompson), and his strong bond with his teammates.Most of the film takes place after the big football game against undefeated Walnut Heights High School. Ampipe appears headed to win the game, when a fumbled handoff in the closing seconds—as well as Stefan's pass interference penalty earlier in the game—leads to a Walnut Heights victory. Following the game, Coach Burt Nickerson (Craig T. Nelson) lambastes the fumbler in the locker room, telling him he \"quit\". When Stefan retorts that the coach himself quit, the coach kicks him off the team.In the aftermath, disgruntled Ampipe fans vandalize Coach Nickerson's house and yard. Stefan is present and is a reluctant participant, but is nonetheless seen by Nickerson as the vandals flee. From there, Stefan deals with personal battles, including dealing with the coach blacklisting him among colleges because of his attitude and participation in the desecration of Nickerson's yard and house. Stefan gets in an argument with Lisa and his best friend Brian (Chris Penn) drops out of school after getting his girlfriend pregnant.Stefan, frustrated by what Nickerson did, angrily confronts his former coach which ends in a shouting match out in the street. But Lisa decides to talk to Nickerson's wife to try and help. In the end, Nickerson realizes he was wrong for blacklisting Stefan. He has accepted a coaching position at Cal Poly San Luis Obispo and offers Stefan a full scholarship to play football there, which he accepts.","language":"English","box_office":"$17,233,166[1]","cinematography":"Jan de Bont","directed_by":"Michael Chapman","all_the_right_moves":"Theatrical release poster","release_dates":"October 21, 1983 (1983-10-21)|||||","Production":"The film was produced by Stephen Deutsch, with Phillip Goldfarb as co-producer. Gary Morton of Lucille Ball Productions was executive producer. The production was filmed over seven weeks in Johnstown, Pennsylvania in mid 1983. A sixty-year-old, recently closed high school was used as the location of the film, along with the town's Point Stadium. Actress Lea Thompson was inserted as a new student at Ferndale Area High School for three days prior to shooting. Tom Cruise was similarly inserted into Greater Johnstown High School but was recognized immediately.[3]","produced_by":"Stephen Deutsch","starring":"Tom Cruise|Craig T. Nelson|Lea Thompson|","running_time":"91 minutes","music_by":"David Richard Campbell","edited_by":"David Garfield","Release":"The film has a score of 53% on Rotten Tomatoes based on 19 reviews[4] and a score of a generally favorable 62% on Metacritic based on 7 reviews. Jay Carr from The Boston Globe stated \"Cruise is believable as an athlete,\" and Janet Maslin of The New York Times called it \"a well-made but sugar-coated working-class fable about a football star.\"[5]Among the unfavorable reviews, TV Guide called the movie \"cliche-riddled\" and Richard Corliss of Time called it a \"naive little movie (that) hopes to prove itself the Flashdance of football.\"[5]","written_by":"Michael Kane"}