{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Doris Attinger (Judy Holliday) follows her husband (Tom Ewell) with a gun one day after suspecting he is having an affair with another woman (Jean Hagen). In her rage, she fires at the couple multiple times. One of the bullets hits her husband in the shoulder.The following morning, married lawyers Adam and Amanda Bonner (Spencer Tracy and Katharine Hepburn) read about the incident in the newspaper. They argue over the case. Amanda sympathizes with the woman, particularly noting the double standard that exists for men and women regarding adultery. Adam thinks Doris is guilty of attempted murder. When Adam arrives at work, he learns that he has been assigned to prosecute the case. When Amanda hears this, she seeks out Doris and becomes her defense lawyer.Amanda bases her case on the belief that women and men are equal, and that Doris had been forced into the situation through her husband's poor treatment of her. Adam thinks Amanda is showing a disregard for the law, since there should never be an excuse for such behavior. Tension increasingly builds at home as the two battle each other in court. The situation comes to a head when Adam feels humiliated during the trial when Amanda encourages one of her witnesses, a woman weightlifter, to lift him overhead. Adam, still angry, later storms out of their apartment. When the verdict for the trial is returned, Amanda's plea to the jury to \"judge this case as you would if the sexes were reversed\" proves successful, and Doris is acquitted.That night, Adam sees Amanda and their neighbor Kip Lurie (David Wayne), who has shown a clear interest in Amanda, through the window. He breaks into the apartment, pointing a gun at the pair. Amanda is horrified, and says to Adam, \"You've no right to do this -- nobody does!\" Adam feels he has proven his point about the injustice of Amanda's line of defense. He then puts the gun in his mouth. Amanda and Kip scream in terror. Adam then bites down on the gun and chews off a piece; it is made of licorice. Amanda is furious with this prank, and a three-way fight ensues.Adam and Amanda, in the midst of a divorce, reluctantly reunite for a meeting with their tax accountant. They talk about their relationship in the past tense. They become emotional when talking about the farm they own and realize how much they love each other. They go to the farm, where Adam announces that he has been selected as the Republican nominee for County Court Judge. Amanda jokes about running for the post as the Democratic candidate.","language":"English","Reception":"According to MGM records the film earned $2,971,000 in the US and Canada and $976,000 elsewhere resulting in a profit of $826,000.[1]","box_office":"$3,947,000[1]","TV adaptation":"Adam's Rib was adapted as a television sitcom in 1973 with Ken Howard and Blythe Danner. The series was cancelled after 13 episodes.","cinematography":"George J. Folsey","directed_by":"George Cukor","adam's_rib":"Theatrical poster","Awards and honors":"Ruth Gordon (later of Rosemary's Baby and Harold and Maude fame) and Garson Kanin were nominated for the Academy Award for Best Story and Screenplay in 1951.In 1992, Adam's Rib was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".[5]American Film Institute ListsAFI has also honored the film's stars, naming Katharine Hepburn the greatest American screen legend among females and Spencer Tracy #9 among males.","release_dates":"November 18, 1949 (1949-11-18)|||||","Production":"The film was written specifically as a Tracy-Hepburn vehicle (their sixth film together) by friends of the couple, Garson Kanin and Ruth Gordon. The pair, who were married to each other, got their inspiration for the story from the real life case of William and Dorothy Whitney, married lawyers who ended up divorcing and marrying their respective clients in a case. Kanin saw great potential in the idea of married lawyers as adversaries, and the plot for Adam's Rib was developed. The original title for the film was Man and Wife, but the MGM front office quickly vetoed it as dangerously indiscreet.[2] Although set in New York, Adam's Rib was filmed mainly on MGM's stages in Culver City, Los Angeles.[3]Hepburn and Kanin encouraged Judy Holliday to play the role of Doris in the movie, which was used by Columbia Pictures president Harry Cohn as a screen test for the chance to re-create on film her Broadway success in Kanin's play Born Yesterday. Receiving positive notices for Adam's Rib, Holliday was cast in the 1950 film version of Born Yesterday, for which she won the Academy Award for Best Actress.It has been noted that in several scenes of the film, there are unusually long takes, where the camera does not move for minutes at a time. Most of these scenes happen when the principal characters are arguing.[4]","produced_by":"Lawrence Weingarten","starring":"Spencer Tracy Katharine Hepburn","running_time":"101 minutes","music_by":"Miklós Rózsa Cole Porter","edited_by":"George Boemler","written_by":"Ruth Gordon Garson Kanin","budget":"$1,728,000[1]"}