{"country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Darryl Quarles Don Rhymer","story_by":"Darryl Quarles","Plot":"The film begins in an illegal underground dog-fighting arena in Korea, where an FBI agent, John Maxwell (Paul Giamatti), has been identified. John is ordered to be killed by a Korean mob boss, but is eventually rescued by his undercover partner and master of disguise, Malcolm Turner (Martin Lawrence). Suddenly, a group of FBI agents storm around the arena.Meanwhile, a criminal named Lester Vesco (Terrence Howard), who was originally serving a life sentence in prison for murder and armed robbery, escapes from his cell by killing the doctor and stealing his car. The FBI assigns Malcolm and John to capture Lester by sending them to small-town Cartersville, Georgia to stake out the house of a heavyset, elderly African American woman, Hattie Mae Pierce (Ella Mitchell; whom her friends call \"Big Momma\"), the estranged Southern grandmother of Lester's ex-girlfriend, Sherry Pierce (Nia Long), who supposedly aided Lester in his original bank robbery by giving him the key to the vault. After Big Momma unexpectedly leaves town to help her ill friend within a couple of weeks, Malcolm and John sneak into her house to plant security cameras and tap the phones. Sherry later calls Big Momma's house and Malcolm disguises his voice as Big Momma in order to lure Sherry and possibly obtain a confession. The plan works, and Malcolm and John work together on a Big Momma disguise costume before Sherry's arrival the next day.The next day, Sherry arrives at Big Momma's house with her 10-year-old son, Trent (Jascha Washington). However, Malcolm's inexperience with cooking and strange behavior prompt Sherry to believe that Big Momma might have gone senile. Malcolm also has to deal with Big Momma's lecherous boyfriend, Ben Rawley (Carl Wright), act as midwife for Ritha (Tichina Arnold), who has gone into labor, and attend self-defense classes under Ritha's older brother and dim-witted security guard, Nolan (Anthony Anderson), whom Malcolm handily defeats and humiliates in front of all the other old women.After Malcolm almost damages the suit during the night, he tries to sneak back to the safe house where he and John are staying to capture Lester. However, Sherry captures him on the porch, and Malcolm poses as a \"handyman\" after just barely hiding the suit in a bush. Malcolm and John repair the suit, and when Malcolm leaves town with Sherry, John searches the safe house for any trace of the money Lester had stolen from the bank, but to no avail. Malcolm also bonds with Trent when he defends him against the two older guys who bullied Trent and kicked him off the court so they could play. Malcolm and Trent eventually beat the boys at basketball, amazing Nolan and Trent. Malcolm also begins to bond with Sherry and Trent by accompanying them on a fishing trip. After Malcolm returns to the safe house with John that evening, Nolan bursts in and tries to arrest Malcolm and John for dismembering Big Momma. Malcolm and John identify themselves and reluctantly recruit Nolan to help them out, promising Nolan that Malcolm and John will recommend him for a place in the FBI if he succeeds.Malcolm, Sherry, and Trent go to church, where the Reverend (Cedric the Entertainer) calls on Malcolm to give his testimony. While posing as Big Momma, Malcolm attempts to influence Sherry and Trent by giving them his testimony about the importance of not keeping secrets. While returning to Big Momma's house after mass, Malcolm pulls his gun on Big Momma's surprise birthday party. During the party that evening, the real Big Momma returns home prematurely, whom John tries to stall her. Malcolm accidentally stumbles across the stolen money hidden in Trent's footlocker. Sherry sees this, and tells Malcolm the real story: Lester had merely been playing her for a fool the whole time. Lester wooed Sherry, stole her keys, and got into the vault during the robbery, which Sherry did not tell anyone about her stolen keys out of fear of getting fired. Malcolm goes off to call for his real name to come help them out. In the bathroom, John quietly tells Nolan that the real Big Momma is back, and Nolan accidentally locks Malcolm out of the house to think that he is the real Big Momma.Meanwhile, Lester finally arrives in Big Momma's house, where he successfully tracked Sherry, Trent, and the money. Lester later tries to take Sherry and Trent out of the house with him, but after Sherry pleads Lester to say goodbye to the real Big Momma, Nolan spots Lester's gun and intends to arrest him, but he accidentally unloads his own gun. Before Lester can kill Nolan, Malcolm breaks through the window to fight Lester, causing confusion among the partygoers as they see two Big Mommas at once. In the ensuing struggle, Lester shoots John in his right shoulder, and ends up ripping Malcolm's mask during a fistfight to reveal his identity. Nonetheless, Malcolm eventually subdues Lester, who tries to shoot him from behind and is knock out of the window. Sherry and Trent are heartbroken to realize that Malcolm was just an FBI agent the whole time, and they refuse to speak to him, even when the police arrest Lester and paramedics take John to the hospital for a gunshot wounded in his right arm.In the epilogue, Malcolm goes to church on Sunday morning to testify Sherry, Trent, and Big Momma. Malcolm delivers his confession and heartfelt speech to Sherry and Trent and admits that he genuinely loves them. Big Momma eventually forgives Malcolm with a big, strong hug, and the crowd cheers as Malcolm and Sherry kiss. Malcolm and Sherry invite Trent over for a group hug and the crowd celebrates as Big Momma and the choir sings \"Oh Happy Day\" during the film's closing credits.","language":"English","Reception":"Big Momma's House received generally negative reviews at the time of its release. It has a rating of 4.4/10 at Rotten Tomatoes, with 30% of 81 reviews being positive. The critical consensus was that \"Big Momma's House is funny in some parts, but it is essentially a one-joke movie.\"[2] Metacritic gives the film a score of 33% based on reviews from 27 critics, indicating \"generally unfavorable reviews\".[3]The film, and the series as a whole, have been derided as typical of \"representations of the big black woman that have appeared in mass marketed comedies\" which at the same time devalue the women by casting \"male actors wearing Latex fat suits\".[4] One review of the third film sarcastically comments, \"Believe it or not, the Big Momma's House series rigidly follows the classic Hollywood trilogy structure\".[5] By the third film, the series was derided for its unnecessary rehashing of the cross-dressing gimmick.[5]The film was released on 2 June 2000, and was a surprise hit as it opened as the number two movie in North America, and almost overtook Mission: Impossible II for the top spot that weekend. Big Momma's House went on to gross over $117 million at the US box office, and with a worldwide total just under $174 million.[6] Each installment in the series declined from the box office realized by the original:","box_office":"$173,959,438","cinematography":"Michael D. O'Shea","production_company":"Regency Enterprises Runteldat Entertainment Friendly Productions Taurus Films Nina Saxon Film Design","directed_by":"Raja Gosnell","Home media":"The film is one of very few titles to be released on EVD as well as DVD and VHS.","big_momma's_house":"Theatrical release poster","Music":"A soundtrack containing hip hop music was released on May 30, 2000 by So So Def Records. The film's theme song was \"Bounce with Me\" by Lil Bow Wow. The soundtrack was also a moderate success and has been certified gold since its release. Other than Lil Bow Wow, the soundtrack featured artists such as Jermaine Dupri and Da Brat. It peaked at 41 on the Billboard 200 and 12 on the Top R&B/Hip-Hop Albums and spawned two hit singles, \"Bounce with Me\" and \"I've Got to Have It\".This was the only Big Momma film to have an official soundtrack. However, the third film spawned one single, \"Imma Do It Big\", by T-Pain, Brandon T. Jackson, and One Chance.","release_dates":"June 2, 2000 (2000-06-02)|||||","produced_by":"David T. Friendly Michael Green","starring":"Martin Lawrence Nia Long Paul Giamatti Terrence Howard Anthony Anderson Jascha Washington Ella Mitchell Cedric the Entertainer","running_time":"98 minutes","Sequels":"Big Momma's House spawned 2 sequels: Big Momma's House 2 (2006) and Big Mommas: Like Father, Like Son (2011). The sequels included some, but not all, of the same crew members, characters, and actors from the original:","music_by":"Richard Gibbs","edited_by":"Bruce Green Kent Beyda","budget":"$30 million"}