{"based_on":"Chitty-Chitty-Bang-Bang 1964 novel  by Ian Fleming","Cast":"The cast includes:[4]The part of Truly Scrumptious had originally been offered to Julie Andrews, to reunite her with Van Dyke after their success in Mary Poppins. Andrews rejected the role specifically because she considered that the part was too close to the Poppins mould.[5] Instead, Sally Ann Howes was given the role. Dick Van Dyke was cast after he turned down the role of Fagin from another 1968 musical Oliver! (which ended up going to Ron Moody).","chitty_chitty_bang_bang":"Original cinema release poster.","country":"United Kingdom","distributed_by":"United Artists","screenplay_by":"Roald Dahl Ken Hughes","Plot":"Set in the 1910s, the story opens with a montage of European Grand Prix races in which a particular car appears to win every race. In the final race during a thunderstorm, the car swerves to avoid a girl and her dog, loses control, crashes, and explodes and catches fire when it is struck by a bolt of lightning, ending its racing career. The car ends up in an old garage in rural England, where two children, Jeremy (Adrian Hall) and Jemima Potts (Heather Ripley), have grown fond of it. However, they are told by a man in the junkyard that he intends to buy the car from the garage owner, Mr. Coggins (Desmond Llewelyn), for scrap. The children (who live with their widowed father Caractacus Potts (Dick Van Dyke), an eccentric inventor, and his equally peculiar father) implore their father to buy the car before the junkman does, but he refuses to have the money. While playing hooky from school, they meet Truly Scrumptious (Sally Ann Howes), a beautiful upper class woman with her very own motorcar. She brings them home to report their truancy to their father. Although Truly is interested in Caractacus' odd inventions, he is affronted by her insistence that his children are supposed to be in school.One day, Caractacus discovers that the sweets produced by a machine he has invented can be played like a flute. He tries to sell the \"Toot Sweets\" to Truly's father, Lord Scrumptious (James Robertson Justice), a major confectionery manufacturer. He is almost successful until the whistle attracts a pack of dogs responding to the whistle who overrun the factory, resulting in Caractacus getting fired. He takes his automatic hair-cutting machine to a carnival to raise money, but his invention accidentally ruins the hair of a large, angry customer. He eludes the man by joining a song-and-dance act, accidentally stealing the show; he earns enough in tips to buy the car. Potts rebuilds the car in his own eccentric way, using such materials as an old boat hull and a chimney breast. He nicknames the car \"Chitty Chitty Bang Bang\" for the noises its engine makes. In the first trip in the car, Potts, the children, and Truly go for a picnic on the beach, where Truly becomes very fond of the Potts family and vice versa. Caractacus tells them a tale about nasty Baron Bomburst (Gert Fröbe), the tyrant of fictional Vulgaria, who wants to steal Chitty Chitty Bang Bang for himself.As Potts tells his story, the quartet and the car are stranded by high tide, and find themselves under attack by pirates working for the Baron. Chitty suddenly deploys huge flotation devices and transforms into a power boat, and they escape Bomburst's yacht and return to shore. The Baron sends two comical spies to capture the car, but they briefly capture Lord Scrumptious then Grandpa Potts (Lionel Jeffries), mistaking each for the car's creator. Caractacus, Truly, and the children see Grandpa being taken away by airship, and they give chase. When they accidentally drive off a cliff, Chitty sprouts wings and propellers and begins to fly. They follow the airship to Vulgaria, and find a land without children; the Baroness Bomburst (Anna Quayle) abhors them and imprisons any she finds. Grandpa has been ordered by the Baron to make another floating car, and he bluffs his abilities to avoid being tortured. The Potts' party is hidden by the local Toymaker (Benny Hill), who now works only for the childish Baron. Chitty is discovered and taken to the castle. While Caractacus and the toymaker search for Grandpa and Truly searches for food, the children are soon captured by the Baron's evil Child Catcher (Robert Helpmann).The Toymaker takes Truly and Caractacus to a grotto far beneath the castle, where the townspeople have been hiding their children. They concoct a scheme to free the children and the village from the Baron. The Toymaker sneaks them into the castle disguised as life-size dolls for the Baron's birthday. Caractacus snares the Baron and the children swarm into the banquet hall, overcoming the Baron's palace guards and guests. In the ensuing chaos, the Baron, Baroness, and the evil Child Catcher are all captured. The Potts and Truly fly back to England. Jeremy and Jemima finish the story themselves: \"And Daddy and Truly were married and lived happily ever after!\" Truly seems to find this suggestion appealing, but Caractacus is evasive, believing that the class difference between them is too great. When they arrive home, Caractacus is surprised to find his father and Lord Scrumptious playing a lively game of toy soldiers. Scrumptious surprises him with an offer to buy the Toot Sweet as a canine confection. Caratacus realising that he will be rich rushes to tell Truly the news. They kiss, and Truly agrees to marry him. As they drive home, he acknowledges the importance of pragmatism, as the car takes to the air again.","Home video releases":"Chitty Chitty Bang Bang was released numerous times in the VHS format. In 1998 the film saw its first DVD release. 2003 brought a two-disc \"Special Edition\" release. On 2 November 2010, 20th Century Fox released a two-disc Blu-ray and DVD combination set featuring the extras from the 2003 release as well as new features. The 1993 LaserDisc release by MGM/UA Home Video was the first home video release with the proper 2.20:1 Super Panavision 70 aspect ratio.","language":"English","Reception":"The film was the tenth most popular at the US box office in 1969.[12]Time began its review saying the film is a \"picture for the ages—the ages between five and twelve\" and ends noting that \"At a time when violence and sex are the dual sellers at the box office, Chitty Chitty Bang Bang looks better than it is simply because it's not not all all bad bad\"; the film's \"eleven songs have all the rich melodic variety of an automobile horn. Persistent syncopation and some breathless choreography partly redeem it, but most of the film's sporadic success is due to Director Ken Hughes's fantasy scenes, which make up in imagination what they lack in technical facility.\"[13]During her brief period as chief film critic for The New York Times, Renata Adler reviewed the film, saying: \"in spite of the dreadful title, Chitty Chitty Bang Bang ... is a fast, dense, friendly children's musical, with something of the joys of singing together on a team bus on the way to a game\"; Adler called the screenplay \"remarkably good\" and the film's \"preoccupation with sweets and machinery seems ideal for children\"; she ends her review on the same note as Time: \"There is nothing coy, or stodgy or too frightening about the film; and this year, when it has seemed highly doubtful that children ought to go to the movies at all, Chitty Chitty Bang Bang sees to it that none of the audience's terrific eagerness to have a good time is betrayed or lost.\"[14]Film critic Roger Ebert reviewed the film (Chicago Sun Times, 24 December 1968). He wrote: \"Chitty Chitty Bang Bang contains about the best two-hour children's movie you could hope for, with a marvelous magical auto and lots of adventure and a nutty old grandpa and a mean Baron and some funny dances and a couple of [scary] moments.\"Film critic and historian Leonard Maltin considered the picture \"one big Edsel, with totally forgettable score and some of the shoddiest special effects ever.\"[15] In 2008, Entertainment Weekly called Helpmann's depiction of the Child Catcher one of the \"50 Most Vile Movie Villains.\"[16]As of March 2014, the film has a 65% \"Fresh\" rating (17 of 26 reviews) on Rotten Tomatoes.[17]","box_office":"$7.5 million (US/ Canada rentals)[2]","cinematography":"Christopher Challis","production_company":"Warfield Productions","directed_by":"Ken Hughes","Soundtrack":"The original soundtrack album, as was typical of soundtrack albums, presented mostly songs with very few instrumental tracks. The songs were also edited, with specially recorded intros and outros and most instrumental portions removed, both because of time limitations of the vinyl LP and the belief that listeners would not be interested in listening to long instrumental dance portions during the songs.The soundtrack has been released on CD four times, the first two releases using the original LP masters rather than going back to the original music masters to compile a more complete soundtrack album with underscoring and complete versions of songs. The 1997 Rykodisc release included several quick bits of dialogue from the film between some of the tracks and has gone out of circulation. On 24 February 2004, a few short months after MGM released the movie on a 2-Disc Special Edition DVD, Varèse Sarabande reissued a newly remastered soundtrack album without the dialogue tracks, restoring it to its original 1968 LP format.List of tracks:1. \"Chitty Chitty Bang Bang\"a 2. \"Elephant\"b 3. \"You Two\" 4. \"If I May\"b 5. \"Toot Sweets\" 6. \"Hushabye Mountain\" 7. \"Come to the Funfair\"c 8. \"Me Ol' Bamboo\" 9. \"Potts the Optimist\"b 10. \"Chitty Chitty Bang Bang\"d 11. \"Truly Scrumptious\"13. \"Chitty Chitty Bang Bang\"e 14. \"Lovely Lonely Man\" 15. \"Posh!\" 16. \"Hushabye Mountain\" (reprise) 17. \"The Roses of Success\" 18. \"Hang On\"b 19. \"Chu-Chi Face\" 20. \"Doll on a Music Box\" / \"Truly Scrumptious\" 21. \"Chitty Chitty Bang Bang\" (finale) 22. \"A Happy Ending\"b 23. \"Chitty Chitty Bang Bang\" (main title)a Instrumental used for the film's \"exit music\". b Dialogue track, only included on the Rykodisc release. c Tune and background lyrics only, as entire song was cut from film. d First vocal performance from the film. e Second vocal performance from the film.In 2011, Kritzerland released the definitive soundtrack album, a 2-CD set featuring the Original Soundtrack Album plus bonus tracks, music from the Song and Picture Book Album on disc 1, and the Richard Sherman Demos, as well as six Playback Tracks (including a long version of international covers of the theme song). Inexplicably, this release was limited to only 1,000 units.In April 2013, Perseverance Records re-released the Kritzerland double CD set with expansive new liner notes by John Trujillo and a completely new designed booklet by Perseverance regular James Wingrove.","Novelisation of film":"The film did not follow Fleming's novel closely. A separate novelisation of the film was published at the time of the film's release. It basically followed the film's story but with some differences of tone and emphasis, e.g. it mentioned that Caractacus Potts had had difficulty coping after the death of his wife, and it made it clearer that the sequences including Baron Bomburst were extended fantasy sequences. It was written by John Burke.[18]","release_dates":"16 December 1968 (1968-12-16) (London, premiere)|18 December 1968 (1968-12-18)||||","Production":"The Caractacus Potts inventions in the film were created by Rowland Emett; by 1976, Time magazine, describing Emett's work, said no term other than \"Fantasticator...could remotely convey the diverse genius of the perky, pink-cheeked Englishman whose pixilations, in cartoon, watercolor and clanking 3-D reality, range from the celebrated Far Tottering and Oyster Creek Railway to the demented thingamabobs that made the 1968 movie Chitty Chitty Bang Bang a minuscule classic.\"[6]At a 1973 auction in Florida, one of the Chitty-Chitty Bang-Bang cars sold for $37,000, equal to $197,232 today.[7] The original \"hero\" car, in a condition described as fully functional and road-going, was offered at auction on 15 May 2011 by a California-based auction house.[8] The car sold for $805,000, less than the $1–2 million it was expected to reach.[9] It was purchased by New Zealand film director Sir Peter Jackson.[10]","produced_by":"Albert R. Broccoli","starring":"Dick Van Dyke Sally Ann Howes Lionel Jeffries James Robertson Justice Robert Helpmann","running_time":"144 minutes","music_by":"Songs: Richard M. Sherman (lyrics) Robert B. Sherman (lyrics) Score: Irwin Kostal","edited_by":"John Shirley","budget":"$10 million[1]"}