{"country":"United States","distributed_by":"American International Pictures","language":"English","box_office":"$4.000.000 (inflated figure reported as $18,901,176)","cinematography":"William Asman","directed_by":"William Girdler","abby":"Theatrical release poster.","Plot elements":"The film's use of the Yoruba religion distinguishes it from being simply a copy of the Exorcist with a black cast. In the story, Abby is apparently possessed by Eshu, a West African orisha of chaos and whirlwinds. He is also a trickster and the guardian of roads, particularly crossroads.In the opening scene of the film, Dr. Garrett Williams (William Marshall) explains to his students, \"Eshu is the most powerful of all earthly deities. Eshu is a trickster, creator of whirlwinds... chaos.\"While on an archaeological dig in a cave in Nigeria, Dr. Williams finds a small, ebony puzzle box, carved with the symbols of Eshu: the whirlwind, the cock's comb, and the erect phallus. When Dr. Williams discovers the mechanism to open the box and unlatches it, a tremendous wind blasts out, knocking Dr. Williams and his men against the cave walls and floor.The spirit released by Dr. Williams crosses the Atlantic to Louisville, Kentucky to the new home of Dr. Williams's son, Emmett Williams (Terry Carter) and Abby Williams (Carol Speed). Why and how the spirit travels the globe is not explained. After Abby becomes possessed, her behavior becomes increasingly bizarre and dangerous.In the movie, the dialogue is ambiguous as to whether the spirit inside Abby is actually the powerful orisha, Eshu. The plot's final resolution leaves the point unclear.[9] In And You Call Yourself A Scientist, Elizabeth A. Kingsley wrote \"from a theological point of view, the final section of Abby is quite fascinating. Towards the end of the film, having spent some time taking the demon's measure, Garret decides that it is not in fact Eshu, but a rather pathetic Eshu wannabe... who presumably was imprisoned by Eshu.\"[10]","release_dates":"December 25, 1974 (1974-12-25)|||||","Production":"Abby was written and produced by William Girdler, a filmmaker who specialized in exploitation pictures that were often in the horror genre. Films such as Grizzly and The Manitou are some of Girdler's more notable productions, while Abby achieved a more infamous reputation because it was accused of copyright violation by Warner Bros., who felt it was a direct copy of The Exorcist. Warner Bros. won their court case, and Abby was eventually pulled from theaters, but not before it was able to take in almost $4 million.[3][4]Abby was filmed in 1974 in Louisville, Kentucky.[5] Carol Speed landed the part of Abby after the original actress demanded a masseuse, for which the film's low budget had no provisions. Speed's agent recommended her to Girdler, and she flew to Louisville, meeting her director for the first time on the set.In one scene, Speed's character was required to sing a song in church, and the song was one that Speed herself composed, \"Is Your Soul A Witness?\"The production of the film was met with an unusual threat when Louisville experienced a series of tornadoes that tore through the area around the set of Abby. Speed recalled spending time with co-star Juanita Moore huddled in the lobby of their hotel, wrapped in blankets for protection. \"Juanita and I immediately left the set when the daytime sky turned pitch black. We ended up rolled in some blankets on the lobby floor. Ramada had built this nice hotel, but no basement or tornado shelter. Just glass windows... everywhere.\"[6]William Marshall was vocal about his unhappiness with the production of Abby, mostly because he'd been promised certain script revisions that never materialized. Marshall did add certain elements to the film regarding the Yoruba religion.[7]","produced_by":"William Girdler Mike Henry G. Cornell Layne","starring":"Carol Speed William Marshall Terry Carter Austin Stoker","running_time":"89 min","Scarcity of prints":"Abby was out of circulation for many years, partially due to the lawsuit instigated by Warner Bros., and also because of the uncertain propriety of distribution rights. The ownership of the original film elements of Abby is still in question. The film was finally released on DVD on three different occasions, all within a year's period of each other. It was first released October 2006 as a Collector's Edition, released by CineFear. That edition went out of stock on the day of its release in Amazon.[12] It appears to have been transferred from a visually flawed 16 mm print of the film, which is possibly the only format in which celluloid prints of Abby are still found.[13] The Black Exorcist Edition was then released June 2007. Its third DVD release appeared as part of a Demonic Double Feature set in September 2007, packaged with the German Exorcist film Magdalena, vom Teufel besessen.As the clean, original copy of the film remains unreleased, it is unknown if the injunction awarded to Warner is still active. In 2013, the movie was aired at The CineFamily.[14] It is also suggested that Warner not only instigated a lawsuit against the film, but also confiscated all of the copies produced in 1975.[citation needed]","Urban legends and on-set incidents":"Carol Speed talked about the set of Abby being cursed, similar to what happened with The Exorcist a year before. She mentioned accidents, people falling ill and tornadoes. Pat Kelly, who managed the film, stated: \"Nothing happened that would be considered unusual. Carol -and maybe a couple of others -were so hoping things would go strange, that they may have convinced themselves of a great evil over us - the tornadoes were the closest - but they hit 10 states, so it was not just Abby that had somebody up there (or down) awful mad!\".[11]","music_by":"Robert O. Ragland","edited_by":"Henry Asman Corky Ehlers","Critical reaction":"The New York Times review published December 26, 1974, mentioned that \"Abby is more silly than shocking even if it seems to take itself seriously.\"[8]","written_by":"G. Cornell Layne","budget":"$100.000 (inflated figure reported as $472,529)"}