{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer Artisan Entertainment","blue_steel":"Theatrical release poster","Plot":"Megan Turner (Jamie Lee Curtis) is a rookie New York City policewoman who shoots and kills a suspect (Tom Sizemore) with her service revolver while he's holding up a neighborhood market. The suspect's handgun lands on the floor of the market in the shopping area as the suspect is blown backward through the front window.As she continues to the checkout area, Turner nearly steps on the suspect's handgun directly in front of Eugene Hunt (Ron Silver), a commodities trader, who is also a latent psychopath. Hunt takes the gun and slips away, using it to commit several bloody and brutal murders over the next few days. Because the robber's weapon was not found at the scene, Turner is accused of killing an unarmed man.While the officer attempts to clear her name with Chief Hoyt and her superiors, Hunt begins to romance the suspended Turner in a twisted love fetish. Turner arrests him but he is freed by his attorney, Mel Dawson. He begins to stalk Turner at her family home, an uncomfortable place where Turner remembers her mother being physically abused by her dad.Turner fights to keep her badge and solve the murders with the help of Detective Nick Mann (Clancy Brown), while trying to figure out her relationship with a killer. Hunt turns up at her apartment, injures Turner and kills her best friend, Tracy. This causes Turner to have an emotional breakdown.She spends the night with Mann, her fellow officer. Mann is ambushed by Hunt when he goes to the bathroom. Turner doesn't hear the shot because it was muffled. Hunt attacks and rapes her, and she shoots him, but he runs off. Mann is unconscious and taken to the hospital.Determined to find Hunt and finish him off, Turner finally shoots and kills him after a long and violent confrontation and a bullet wound to her shoulder. She is then taken away by fellow police officers.","language":"English","box_office":"$8.2 million[3]","cinematography":"Amir Mokri","directed_by":"Kathryn Bigelow","production_companies":"Lightning Pictures Mack-Taylor Productions Precision Films","release_dates":"May 26, 1989 (1989-05-26) (Cannes)|March 16, 1990 (1990-03-16)||||","produced_by":"Edward R. Pressman|Oliver Stone|","starring":"Jamie Lee Curtis|Ron Silver|Clancy Brown|Elizabeth Peña|Louise Fletcher|","running_time":"101 minutes[2]","music_by":"Brad Fiedel","edited_by":"Lee Percy","Release":"The film gained positive reviews,[5][6][7][8]garnering a \"fresh\" 70% rating on rotten tomatoes based on 20 reviews. Film critic Roger Ebert compared it to John Carpenter's Halloween (1978 film), noting: \"Blue Steel is a sophisticated update of Halloween, the movie that first made Jamie Lee Curtis a star. (...) What makes it more interesting than yet another sequel to Halloween is the way the filmmakers have fleshed out the formula with intriguing characters and a few angry ideas.\"The film was not a box office success.[9]","written_by":"Kathryn Bigelow|Eric Red[1]|"}