{"country":"United States","distributed_by":"Vestron Pictures","Plot":"Bobby Keller (Corey Feldman) is a slacker high school student who, while running through a short cut through a backyard in his neighborhood one night, collides with Lainie Diamond (Meredith Salenger), over whom Bobby has recently been obsessing. During the collision, elderly professor Coleman Ettinger (Jason Robards) is performing a meditation exercise in the yard with his wife Gena (Piper Laurie), theorizing that if he and his wife can enter a meditative alpha state together voluntarily, they will be able to live together forever. However, just as the Ettingers are on the verge of completing their meditation experiment, the teenagers' collision renders both teens unconscious, enacting a type of body switch between the four characters.Bobby wakes up in his bedroom to find his best friend Dinger (Corey Haim) and his parents asking him if he's okay, but \"Bobby\" has no idea who these people are because he is actually Coleman trapped in Bobby Keller's body. Coleman leaves the house to find his wife but returns when he cannot find her or make any sense of the situation. On his return to Bobby's home, Coleman plays up the role of Bobby for his family and friend, just wanting to go to sleep to see if the alpha state he attains in dreams will give him any clue to what has gone wrong with the experiment.In his dream, Coleman is greeted by the real Bobby, who appears to be trapped in a dream partially generated by Coleman's own subconscious. Coleman discovers that Gena, skeptical of her husband's \"dream state\" theory from the beginning, is also trapped in the dream but is unable to communicate with him because part of her mind has been transferred to Lainie's body. Bobby informs Coleman that he has very little time to prevent what's left of his wife from forgetting about him and becoming lost in the dream forever.Bobby claims to know the secret to switch them all back, yet is reluctant to help Coleman do so, finding the dream-world he now inhabits to be more satisfying than the physical world in which he existed as a troubled teen. Coleman realizes he only has a few days (while pretending to be Bobby) to overcome generation gaps, high-school bullies, Lainie's violent and unstable boyfriend Joel, and Lainie's bitter and manipulative divorced mother in order to improve Bobby's grades, love-life, relationships with his family and friends, and connect with Lainie (who is not particularly fond of Bobby) enough to convince her to recreate the meditation experiment that might save his beloved wife.","language":"English","Reception":"The movie made around $2,500,000 during its opening weekend, with its widest release, in 1,019 theaters. The following week, its weekend gross dropped dramatically (by around 51%). Its domestic gross came out to be around $5,500,000.[1] The film also received negative reviews, earning 0% on Rotten Tomatoes based on all 9 reviews counted.","box_office":"$5,552,441[1]","cinematography":"King Baggot","directed_by":"Marc Rocco","Music":"The soundtrack includes a mix of 1980s rock and classic music. Some songs featured are \"Dreams to Remember\" by Otis Redding, \"Into the Mystic\" by Van Morrison, \"Time Runs Wild\" by Danny Wilde, \"It's The End Of The World As We Know It\" by R.E.M., \"The Future's So Bright, I Gotta Wear Shades\" by Timbuk 3, and Michael Damian's \"Rock On\". The video clip for \"Rock On\" featured the film's cast members Corey Feldman, Meredith Salenger, and Corey Haim. Damian's song—a remake of the 1973 David Essex song—became a #1 hit single on the Billboard Hot 100 the week of June 3, 1989.[2]Mickey Thomas, the lead singer of the popular 1980s band Starship, recorded the film's title theme song and its duet version with Mel Tormé for the soundtrack. The duet version also plays at the end of the film. Thomas also appears as the teacher Mr. Pattison in the film.","dream_a_little_dream":"Promotional film poster","release_dates":"March 3, 1989 (1989-03-03)|||||","produced_by":"Marc Rocco D.E. Eisenberg","starring":"Jason Robards|Corey Feldman|Piper Laurie|Meredith Salenger|Harry Dean Stanton|Corey Haim|Susan Blakely|William McNamara|Matt Adler|Victoria Jackson|Alex Rocco|","running_time":"114 minutes","music_by":"John William Dexter","edited_by":"Russell Livingstone","written_by":"Marc Rocco Daniel Jay Franklin D.E. Eisenberg"}