{"country":"United Kingdom","distributed_by":"Rank Organisation (UK) Universal Pictures (US)","screenplay_by":"Gerry and Sylvia Anderson Donald James Tony Williamson","story_by":"Gerry and Sylvia Anderson","Plot":"In 2069, the unmanned Sun Probe locates a planet lying on the same orbital path as Earth on the opposite side of the Sun. Dr Kurt Hassler (Herbert Lom) of the European Space Exploration Council (EUROSEC) has been relaying the spacecraft's flight data to a rival power in the East; after tracing the transmissions to Hassler's laboratory, Security Chief Mark Neuman (George Sewell) catches the scientist in the act and kills him. EUROSEC director Jason Webb (Patrick Wymark) convinces NASA representative David Poulson (Ed Bishop) that the West must be the first to send a mission to investigate the planet. With EUROSEC member states France and Germany unwilling to provide financial support, Webb obtains majority funding from NASA; American astronaut Colonel Glenn Ross (Roy Thinnes) and British astrophysicist Dr John Kane (Ian Hendry), the head of the Sun Probe project, are assigned to the mission.Launched from the EUROSEC Space Centre in Portugal in the spacecraft Phoenix, Ross and Kane spend the first half of their six-week round trip in stasis with \"Heart Lung Kidney\" machines managing their life functions. Three weeks after launch, the astronauts are revived in the planet's orbit. Scans for the existence of extraterrestrial life are inconclusive, and Ross and Kane decide to make a surface landing. As the astronauts descend through the atmosphere, an electrical storm damages their Dove lander shuttle, which crashes in a mountainous region that is revealed to be near Ulan Bator, Mongolia. When an air-sea rescue unit returns Ross and Kane, the latter critically injured, to the Space Centre, it is apparent that the Phoenix mission has come to an untimely end after three weeks and that the astronauts have returned to Earth.Neuman and EUROSEC official Lise Hartman (Loni von Friedl) interrogate Ross, who denies that he aborted the mission. Shortly after, Kane dies from his injuries. Eventually, Ross concludes that he is not on Earth, but indeed on the unknown planet – a Counter-Earth that is a mirror image of his. (Signs of this reversal include a clock whose hands move anticlockwise, a tape deck's reels that turn clockwise and an oscilloscope that scans from right to left. In addition, while driving at night, Ross almost collides with another vehicle that he believes to be on the wrong side of the road.)Many at EUROSEC, including Ross's wife, Sharon (Lynn Loring), are baffled by the astronaut's claims that all aspects of life on the planet are reversed. However, Webb's view starts to change when Ross demonstrates the ability to read aloud from a sign, without hesitation, when it is reflected in a mirror; Webb is later convinced of the truth when X-rays from Kane's post-mortem examination reveal that his internal organs are positioned on the \"wrong\" side of his body. Ross conjectures that the two Earths lie parallel, inferring that his counterpart from this world is experiencing similar events on the far side of the Sun.Webb suggests that Ross recover the flight recorder from Phoenix and return to his Earth. EUROSEC builds a replacement for Dove designed to be compatible with the reversed technologies of Phoenix. Modifications include the reverse-polarisation of the electric circuits, although no one is certain that the differences between the two Earths extend to the direction of current. Ross christens the new shuttle Doppelganger, a German word denoting a duplicate of a person or object.Lifting off and entering orbit, Ross attempts to dock with Phoenix. However, Doppelganger experiences a technical malfunction, indicating that current is constant after all. The shuttle detaches from Phoenix and loses contact with EUROSEC, falling through the atmosphere towards the Space Centre with Ross struggling to disengage the automatic landing control. EUROSEC is unable to repair the fault from the ground, and Doppelganger crashes into a parked spacecraft. Ross is incinerated in the collision and a chain reaction destroys much of the Space Centre, killing personnel and destroying all records of Ross's presence on the Counter-Earth.Many years later, an embittered and wheelchair-bound Jason Webb, long since dismissed from EUROSEC, has been admitted to a nursing home. In his dementia, he sees his reflection in a mirror placed in front of a window. Reaching out to touch his reflected image, Webb crashes through the mirror and dies.[7]","language":"English","Reception":"Since its original release, Doppelgänger has had a mixed critical reception in both the UK and the US, although Archer and Nicholls argue that it has acquired cult status.[5] Gary Gerani, co-writer of Pumpkinhead (1988), ranks the film 81st in his book Top 100 Sci-Fi Movies, praising Doppelgänger as a \"fine example of speculative fantasy in the late '60s\".[34] He expresses satisfaction with Thinnes' and Wymark's performances, the characterisation (and the themes entailed, including adultery, infertility and corruption) and the \"Fourth of July-style\" special effects, calling the film \"enigmatic\".[34]There were some great sequences and the special effects were outstanding. Perhaps the mistake I made was in insisting that we incorporate \"Gerry's view of the future\", where everybody is squeaky clean and everything is sparkling and shining and sanitised. Unfortunately that isn't what most people see as humanity's natural state ... Star Trek was similar but succeeded because it had a philosophy attached to it. It also had believable people with good characterisation.In a review published in The Times in October 1969, John Russell Taylor praised the concept of the film as \"quite ingenious\" but suggested that the title and pre-release marketing had revealed too much of the plot for the film to sustain the interest of its audience.[2] Commenting in New York magazine in November, Judith Crist introduced Doppelgänger as \"a science-fiction film that comes up with a fascinating premise three-quarters of the way along and does nothing with it.\"[35] She praised the production as being \"nicely gadget-ridden\" and raising questions on the conflict between politics and science, but criticised the editing.[35] Variety magazine cited a confusing plot, and related the crash of the Dove module to the coherence of the scriptwriting in its declaration that, \"Astronauts take a pill to induce a three-week sleep during their flight. Thereafter the script falls to pieces in as many parts as their craft.\"[36]In his 1975 work A Pictorial History of Science Fiction Films, Jeff Rovin stated that the film was \"confusing but colourful\", and commended it for its \"superb special effects\".[37] Although it was argued to be better than average for the genre in The Miami News in September 1969[38] and The Montreal Gazette in April 1972,[39] a December 1969 edition of the Pittsburgh Press dismissed it as \"a churned out science-fiction yarn ... Let's hope there's only one movie like this one\", and ranked it among the worst films of the year.[40] The The Montreal Gazette review maintained that, although the quality deteriorates towards the end of the film, \"until then it's a reasonably diverting futuristic melodrama.\"[39]Made as a science-fiction thriller by imagination producers Gerry and Sylvia Anderson, events since its filming may well demand the dropping of the word \"fiction\" from its description. In today's space terminology it almost rates as science – and pure reportage through film. Still it evolves as a fascinating motion-picture entertainment.In a 2008 review for Den of Geek, Martin Anderson praised Robert Parrish's direction and Derek Meddings' effects.[28] However, the dialogue, described as \"robust and prosaic\", was said to sit \"ill-at-ease with the metaphysical ponderings\".[28] Anderson also expressed concern about the editing, stating that every effects shot precedes another shot \"with that 'Hornby' factor, slowing up the narrative unnecessarily\".[28] Doppelgänger is awarded a rating of three stars out of five, and is summarised as \"an interesting journey with many rewards\".[28] Glenn Erickson, commenting in 2008 on the website DVD Talk, argued that Doppelgänger \"takes an okay premise but does next to nothing with it. We see 100 minutes of bad drama and good special effects, and then the script opts for frustration and meaningless mystery.\"[32] He complained of unappealing cinematography, comparing it to the premise of Thunderbirds in so far as \"people stand and talk a lot\", while defining the script as being composed of \"at least 60 percent hardware-talk and exposition ... How people move about – airplane, parachute, centrifuge – is more important than what they're doing.\"[32]On the subject of effects, Erickson asserted that sequences such as the \"thuddingly generic, drama-challenged main rocket launch\" detract from the human factor of the film.[32] Other design elements were criticised: viewing the costumes as dated, Erickson added that \"the actors are defeated by the Barbie doll house surroundings\", and suggested that the visuals of Doppelgänger match an ethos of \"the future will be a shopping mall\".[32] Despite judging Doppelgänger \"good\" (a rating higher than \"fair\" but lower than \"excellent\"), Erickson argued that the opportunities presented by the parallel Earth concept were squandered in the determination to turn the production into \"an excuse to show cool rocket toys\".[32]Doppelgänger is given a rating of two-and-a-half stars out of five in a negative review published on the Film4 website, which praises the effects work and costume design but criticises the scenes with the character of Dr Hassler for their irrelevance to the main plot, and the subtext of the Rosses' troubled marriage as an unnecessary diversion from the narrative.[42] Although Ross and Kane's mission through space is described as a \"brief, trippy light show\", the review questions the originality of having a parallel Earth as the focus, and the depth of the script's vision: \"Anderson's has to be the cheapest alternate Earth ever. Whereas audiences might expect a world where the Roman Empire never fell or the Nazis won World War II, here the shocking discovery is that people write backwards. That's it.\"[42] Doppelgänger is only recommended for fans of the Anderson productions, and is considered \"an occasionally interesting failure\".[42]Director Robert Parrish has made some extraordinarily expressive movies ... but must have run up against too many uncontrollable elements on this show – namely, producers that dictate every detail as if all the actors have strings attached to their heads and arms.Gary Westfahl of the webzine SF Site asserts that the use of a near-perfect parallel Earth is uninspired, referring to the setting as \"the most boring and unimaginative alien world imaginable\".[43] Among other reviews, TV Guide magazine describes Doppelgänger as a \"strange, little film\" with an \"overwritten script\", and considers the subplot concerning Dr Hassler's treachery to be distracting.[44] It awards a rating of two stars out of four.[44] To Chris Bentley, writer of episode guides on the Anderson productions, Doppelgänger is a \"stylish and thought-provoking science-fiction thriller\".[45]Sylvia Anderson suggested that American audiences, who were less familiar with the Supermarionation productions of Century 21, were more enthusiastic.[9] She explained, \"It was all too easy to compare our real actors with our puppet characters and descriptions such as 'wooden', 'expressionless', 'no strings attached' and 'puppet-like' were cheap shots some of the UK critics could not resist ... Typecasting is the lazy man's friend, and boy, were we typecast in Britain.\"[9] On Doppelgänger, she said in 1992, \"I saw it on TV a couple of years ago and I was very pleased with it. I thought it came over quite well.\"[46]Archer and Nicholls cite among possible causes of the commercial failure of Doppelgänger its \"quirky, offbeat nature\" and the loss of public interest in space exploration after the Apollo 11 mission.[5] The subject of the July 1969 Moon landing dominated a contemporary review in The Milwaukee Journal, in which Bennett F. Waxse noted comparisons with Doppelgänger: \"... the spacemen find a few bugs in their 'LM' and crash on the planet. And do they ever have their hands full in getting back to Earth!\"[47] Writing that the proliferation of technical dialogue hampers the acting, he concluded, \"... the makers of this space exploiter may get lots of mileage at the box office, but Neil, Buzz and Mike did it better on TV.\"[47]It has also been suggested that the 1968 releases of 2001: A Space Odyssey and Planet of the Apes established an unattainable standard for other films of the science-fiction genre.[2][32] Erickson argues that the film is inferior to 2001 for its depiction of a realistic \"working future\" in which humans remain attached to commercialism.[32] Comparing the visual style of Doppelgänger to that used by film director Stanley Kubrick, he notes similarities in the use of close-up eye shots and various \"psychedelic\" images, regretting that \"all these borrowings are fluff without any deeper meaning.\"[32] Film4's review describes the final scenes featuring the character of Jason Webb as \"hell-bent on recreating the enigmatic finale of 2001 by using a mirror, a wheelchair and a tartan blanket.\"[42]Martin Anderson discusses connections between Doppelgänger and other science-fiction films of the 1960s and 1970s, such as Solaris, acknowledging a \"lyrical\" tone in the dialogue.[28] Ultimately, however, Doppelgänger \"doesn't bear comparison with Kubrick or [Solaris director Andrei] Tarkovsky.\"[28] Comparing Doppelgänger to 2001, Rovin writes that the effects of the former \"[occasionally] outshine\" those of the latter.\"[48] He goes onto state that the film \"attempts to kindle a profundity similar to that of [2001] in its abstract philosophising about the dichotomy of dual worlds, but fails with a combination of meat-and-potatoes science fiction and quasi-profound themes.\"[49] He suggests that it is \"neither a kid's film nor a cult film\", but rules that \"the elements that comprise the finished effort are more than individually successful.\"[49]Erickson contrasts perceived failures on the part of the script with the efforts of Nigel Kneale for the 1958 BBC serial Quatermass and the Pit and the 1964 film adaptation of the 1901 H.G. Wells novel The First Men in the Moon.[32] Both Douglas Pratt and the Institute of Contemporary Arts (ICA) in London liken the concept of the alternative Earth to the plot of \"The Parallel\", a 1963 episode of the American television series The Twilight Zone: in the episode, an astronaut returns to Earth to find that his world has undergone many changes – some trivial, some drastic – and concludes that he has arrived in a parallel universe.[50][51] Critic S. T. Joshi compares the theme of duplication in Doppelgänger to the premise of Invasion of the Body Snatchers (1956), in which characters' fears that their relatives have been abducted and replaced with alien impostors are vindicated with the appearance of the Pod People, an extraterrestrial species with the power to create doppelgangers that are nearly indistinguishable from humans.[52]Despite the polarised critical reception and commercial failure of Doppelgänger, Lew Grade offered the Andersons further opportunities to film in live action.[22] Their first television series not based on puppetry was UFO, which premièred in the UK in 1970.[22] Doppelgänger is considered an immediate precursor to UFO,[1] and has also been described as a \"trial run\" for the Andersons' second live-action series, Space: 1999.[6] UFO featured actors, costumes, props, locations and music that had previously appeared in Doppelgänger.[53] Of the film's cast, Ed Bishop, Keith Alexander, Cy Grant, Martin King and Jeremy Wilkin had previously had an association with the Andersons: all had provided voices for Captain Scarlet and the Mysterons except Alexander, who had voiced characters for the penultimate Supermarionation series, Joe 90. With 11 other cast members, all but Grant and King appeared in at least one episode of UFO, in which Bishop had in the lead role of Commander Ed Straker.[12]Special effects elements from Doppelgänger that were recycled for UFO included the scale models of Phoenix and Dove .[12] Futuristic cars (which consultants from the Ford corporation based on the chassis of the Zephyr Zodiac)[54] and jeeps (adapted from British Leyland Mini Mokes) were also re-used.[12] Neptune House, one of the filming locations for Doppelgänger, became the face of the Harlington-Straker Film Studios where the SHADO Organisation is headquartered.[12] Tracks from Barry Gray's score that were recycled for UFO included \"Sleeping Astronauts\" and \"Strange Planet\", the latter serving as the ending theme music.[1] The teleprinter images that served as the focus of the film's titles formed a creative element that was imitated in the opening titles of UFO.[55]In a retrospective of Anderson's career published on the IGN website, it is stated that the discussion of politics and economics in Doppelgänger contrast with the conventions of 1960s science fiction.[6] Furthermore, such aspects are reflected in the atmosphere of UFO in so far as the characters \"were constantly having to deal with the pressures of having to show progress under the scrutiny of accountants and elected officials, much the same way NASA was starting to in the US.\"[6] Commenting on the parallels between the film and the television series, Martin Anderson makes another connection to Kubrick: turning his attention to the scripting, he argues, \"the most interesting common ground between the two projects remains the bleak ending(s) and the slight flirtation with the acid-induced imagery and mind fucks of 2001.\"[28]","doppelgänger":"Film poster for US release, featuring alternative title Journey to the Far Side of the Sun","cinematography":"John Read","production_company":"Century 21 Cinema","directed_by":"Robert Parrish","release_dates":"27 August 1969 (US) 8 October 1969 (UK)","Production":"As his first contribution to live-action film, Gerry Anderson had directed Crossroads to Crime, a 1960 B feature, for Anglo-Amalgamated.[3] Talent agent Leslie Grade had since approached Anderson with a proposal for a film starring actor Arthur Haynes, but discussions between Grade and Anderson had not produced a commission.[3] In the summer of 1967, during the production of Anderson's Supermarionation television series Captain Scarlet and the Mysterons, Universal Pictures executive Jay Kanter arrived in London from the United States.[8] Planning to establish a European production office, Kanter expressed his willingness to provide funding for promising film ideas.[8] Lew Grade, brother to Leslie and Anderson's financier at his TV distributor ITC Entertainment, arranged a meeting with Kanter for Anderson to pitch a story concept concerning the hypothesis of a \"replicated\" or \"mirror\" Earth.[3] According to Anderson, he \"thought, rather naïvely, what if there was another planet the other side of the Sun, orbiting at exactly the same speed and the same size as Earth? That idea then developed into the planet being a replicated Earth and that's how it ended up, a mirrored planet ... We were perfectly poised – I was Lew Grade's golden boy and the [Century 21] studio was a big success story.\"[3]With the assistance of scriptwriter Tony Williamson,[8] Anderson and his wife, Sylvia, had drafted a 194-page treatment long before the initial meeting with Kanter.[9][10] The Andersons had originally intended to film the script as a one-hour drama for ATV; Sylvia explained that since the concept \"was too good for a television play, I suggested to Gerry that we try to develop it as a movie.\"[9] Responding to claims that Doppelgänger had \"dark\" scripting,[11] Gerry stated that he wanted the film to have an interesting and entertaining premise.[11] He also discussed the significance of the title, which was suggested to him by Century 21 co-director John Read:[3] Doppelgänger being \"a German word which means 'a copy of oneself', and the legend goes that if you meet your doppelganger, it is the point of your death. Following that legend, clearly, I had to steer the film so that I could end it illustrating the meaning of that word.\"[11]When Kanter expressed dissatisfaction with the draft, Gerry hired Donald James, a novelist whom he considered \"a classy writer with a good reputation\",[3] to strengthen the characterisation.[8] Although the film retained its original 2069 setting,[3] the scenes set on the Counter-Earth underwent significant changes while James completed his revisions.[12] Fundamentally, the characters of Ross and Kane switched roles: in the Andersons' draft, it was Ross who is injured in the Dove crash and Kane who was interrogated at the EUROSEC Space Centre.[12] In scenes absent from the finished film, Kane is diagnosed with brain damage on the basis of his apparent insanity, while Ross regains consciousness to find that the accident has left him blind.[12] The return mission to Phoenix fails due not to an electrical fault, but rather because of a structural defect in the second Dove module, which disintegrates in the atmosphere of the Counter-Earth with Kane trapped inside.[12] EUROSEC Headquarters is left intact, and Kane's funeral is attended by his wife, the Rosses and Jason Webb.[12]Despite remaining unenthusiastic with the script, Kanter agreed to commission it as a film on the condition that he reserve the right to select a \"bankable\" director.[8] Anderson would have selected David Lane, who had directed the two Thunderbirds film sequels, Thunderbirds Are Go (1966) and Thunderbird 6 (1968).[8] After a ten-week delay to filming, Robert Parrish, an American director whose latest project had been shelved, accepted the post.[13] Parrish's film career up to 1968 had included co-editing Body and Soul (for which he had shared the 1947 Academy Award for Best Film Editing) and co-directing the 1967 James Bond spoof, Casino Royale.[14] Anderson remembered Parrish as being \"very ingratiating\", stating that he \"told us he loved the script and said it would be an honour to work with us. Jay Kanter gave Bob the thumbs up and we were in business.\"[7] Although the box office failure of Casino Royale had prompted Anderson to question Parrish's ability, he stated that Doppelgänger could not have been made without his recruitment:[14] \"It wasn't a question of, 'Will we get on with him?' or, 'Is he the right man?' He was a name director, so we signed him up immediately.\"[13]Heading the cast of Doppelgänger is Roy Thinnes in the role of Colonel Glenn Ross of NASA. Anderson, who perceived a likeness to fellow American actor Paul Newman, cast Thinnes as the male lead after viewing his performance in the television series The Invaders (1967–68).[14] In the Andersons' draft script, Ross's first name is Stewart, and he is said to have been the first man to walk on Mars.[12] In a 2008 interview, Thinnes said, \"I thought [Doppelgänger] was an interesting premise, although now we know that there isn't another planet on the other side of the Sun, through our space exploration and telescopic abilities. But at that time it was conceivable, and it could have been scary.\"[15] To conform to the script's characterisation of Ross, and to the detriment of his respiratory health, Thinnes ended up smoking many packets' worth of cigarettes in the course of the production.[16] Reporting on Thinnes' intention to demand a non-smoking clause in his next film contract, in September 1969 Australian newspaper The Age stated, \"He smokes about two packets a day, but the perpetual lighting up of new cigarettes for continuity purposes was too much.\"[16]Ian Hendry stars as Dr John Kane, British astrophysicist and head of the Phoenix project. Hendry, who had appeared in the television series The Avengers (1961–69) and, according to Anderson, \"was always drinking\",[14] performed the stunt sequence depicting the aftermath of the Dove crash while drunk: \"... he was pissed as a newt, and it was as much as he could do to stagger away. Despite all that, it looked exactly as it was supposed to on-screen!\"[17] In the draft script, Kane's first name is Philip, and he has a wife called Susan.[12] In scenes deleted from the completed film, a romance between Kane and Lise Hartman, a EUROSEC official portrayed by Austrian actress Loni von Friedl, is played out at Kane's villa and on a beach in Portugal.[12]Lynn Loring stars as Sharon Ross, the Colonel's wife. The role of the female lead had first been offered to Gayle Hunnicutt, who quit at the start of the filming after unexpectedly falling ill.[8] Hunnicutt's withdrawal resulted in the casting of Loring, Thinnes' wife since 1967 and star of the television series The F.B.I. (1965–74).[8] Had she remained in the role, Hunnicutt would have appeared in a nude scene scripted to distance the tone of Doppelgänger from that of earlier Anderson productions.[14] In a 1968 interview in the Daily Mail newspaper, Anderson expressed his intention to change the public's perception of Century 21, who, in his view, had been \"typecast as makers of children's films\".[14] On rumours that Doppelgänger would receive an X certificate from the British Board of Film Censors (BBFC) for adult content, he replied, \"We want to work with live artists doing subjects unsuitable for children.\"[14] For the final cut of the film, the original nude shots were replaced with softer alternatives depicting Sharon stepping into and out of a shower.[14]The draft script describes Sharon as the daughter of a United States Senator, and she is said to be in a romantic affair with EUROSEC public relations officer Carlo Monetti.[12] In the completed film, Italian actor Franco De Rosa briefly stars as Paulo Landi.[18] The affair is implied in one scene but not explored further,[14] prompting Simon Archer and Marcus Hearn, authors of What Made Thunderbirds Go! The Authorised Biography of Gerry Anderson, to suggest that De Rosa starred in a role \"all but cut from Doppelgänger\".[19] In a deleted scene, on finding Paolo and Sharon in bed together at the Rosses' villa, Glenn angrily ejects the couple from the room and throws them both into a swimming pool.[12] Archer and Hearn note an additional subplot concerning the Rosses' attempts to conceive a child and the deceit of Sharon, who has been using birth control pills to inhibit pregnancy without Glenn's knowledge.[14]Completing the main cast, Patrick Wymark stars as Jason Webb, director of EUROSEC. Having selected him on the basis of his performance as John Wilder in the television series The Plane Makers (1963–65) and The Power Game (1965–70), Anderson stated that Wymark's acting impressed him as much as Hendry's, but also that his similar drinking habits resulted in slurred lines on set.[17] During the filming of one scene, Wymark \"had to list these explanations ... and on take after take he couldn't remember that 'two' followed 'one'. We had to do it over and over again.\"[17] Archer and Hearn identify Wymark's portrayal of Webb, a character described as \"John Wilder (2069 model)\" in publicity material,[17] as the dominant performance of the film.[17] The draft script describes Webb as a former British Minister of Technology, who is now romantically involved with his secretary, Pam Kirby.[12]Among the supporting cast, George Sewell stars as Mark Neuman, a German Operations Chief in EUROSEC who uncovers Dr Hassler's dealing with Communist China and whose parallel self directs the interrogation of Ross after the Dove crash.[12] His surname in the draft script is Hallam.[12] Finally, Ed Bishop stars as David Poulson, a NASA official. Bishop replaced English actor Peter Dyneley, who had voiced characters for Thunderbirds (1965–66), after the producers decided that Dyneley bore too much of a resemblance to Wymark and that scenes featuring both the characters of Poulson and Webb would confuse audiences.[8]Fifteen weeks of principal photography commenced on 1 July 1968 at Pinewood Studios, Buckinghamshire; shooting wrapped on 16 October[8] having run alongside that for Joe 90.[12] In September, location shooting in Albufeira, Portugal was accelerated for completion in two weeks as opposed to a month after politician Marcello Caetano deposed incapacitated Prime Minister Antonio Salazar, Parrish fearing that the coup d'état would cause the production of Doppelgänger to fall behind schedule.[8] Filming in Borehamwood, Hertfordshire used the exterior of Neptune House (now part of the BBC's Elstree Studios) as a double for EUROSEC Headquarters in Portugal.[12] Heatherden Hall (part of the Pinewood complex) appears as the old Webb's nursing home.[12]To create the illusion of the parallel Earth – apparent in images such as reversed text – both quickly and cheaply, the production staff inverted the film negatives using an optical process known as \"flop-over\".[8] This technique saved the time and money that would otherwise needed to have been spent in building sets and props with specially reversed elements, or organising road closures to film cars driving on the \"wrong\" side of the road. However, the scenes set in or around the parallel EUROSEC Headquarters required careful rehearsal and co-ordination with cast and crew prior to filming.[8] The incorporation of the flop-over technique results in some continuity errors: for example, the terminals of the Heart Lung Kidney machines onboard Phoenix are seen to be connected first to Ross and Kane's left wrists, then their right.[12]The production staff encountered difficulties in realising a scene at the start of the film depicting an international teleconference being conducted using high-resolution viewing monitors.[20] Due to both the limited use of colour TV at the time of production, and the need to avoid black-and-white so as to honour the futuristic setting of Doppelgänger, it was decided to position the actors playing the conference delegates behind the set and cut the \"screens\" out of the set wall.[20] Silver paper was added to reflect the studio lighting, producing a realistic impression of a high-resolution image.[20] Altered eyelines strengthen the audience's perception that each delegate is facing a camera rather than the other actors in the scene, and are in different locations around the world.[20] Archer and Hearn promote the teleconference scene as an example of how Anderson \"proved once again that his productions were ahead of their time.\"[20]During the course of the production, the creative styles of Anderson and Parrish came into conflict. Anderson remembered that on several occasions Kanter was called on to mediate: \"[Sylvia and I] both knew how important the picture was to our careers, and we both desperately wanted to be in the big time.\"[4] During one session, Parrish refused to follow the shooting script, having determined independently that not all the scripted scenes were essential to the plot.[4] When Anderson reminded Parrish of his contractual responsibilities, the director announced to the cast and crew, \"Hell, you heard the producer. If I don't shoot these scenes which I don't really want, don't need and will cut out anyway, I'll be in breach of contract. So what we'll do is shoot those scenes next!\"[4] Anderson discussed how the production of Doppelgänger presented new challenges, explaining, \"I had worked for so many years employing directors to do what I told them ... Suddenly I came up against a Hollywood movie director who didn't want to play and we ended up extremely bad friends.\"[4] In his 2002 biography, Anderson stated that his sole regret about the film \"[was] that I hired Bob Parrish in the first place.\"[4] Sylvia Anderson comments that Parrish's direction was \"uninspired. We had a lot of trouble getting what we wanted from him.\"[10]One dispute among the founders of Century 21 – Gerry and Sylvia Anderson, Reg Hill and John Read – emerged from the filming of other scenes, including one in which the character of Lise Hartman bathes in a shower.[21] Read, the director of photography, had complied with Parrish's instructions to light the sequence in silhouette.[22] Anderson, who had intended the scene to display full-frontal nudity from actress Loni von Friedl, demanded a re-shoot, insisting that Read honour his obligations not just to Parrish as director but also to his Century 21 partners.[22] According to Sylvia Anderson, \"Gerry was very keen to show that he was part of the 'Swinging Sixties' and felt that seeing a detailed nude shot – as he visualised it – was more 'with it' than the more subdued version.\"[23] Anderson clashed with Read and Parrish for a second time when special effects shots of Phoenix were filmed with a hand-held camera: \"I knew enough about space travel to know that in a vacuum a spacecraft will travel as straight as a die ... [Parrish] told me that people were not familiar with space travel and therefore they would expect to see this kind of movement.\"[2][20] Refusing to re-film the scenes on the basis that Parrish's instructions had precedence over Anderson's, Read resigned from both Century 21 and the production of Doppelgänger at the Andersons' and Hill's request.[22] Anderson elaborated: \"Clearly John was in a difficult position. I do now understand how he must have felt, but in my heart I feel he couldn't play a double role.\"[2]The production base for special effects was Century 21 Studios in Slough, Berkshire,[8] which had been prepared for filming on the last Supermarionation series, The Secret Service.[4] Supervising director Derek Meddings oversaw the shooting of more than 200 effects shots, including the destruction of EUROSEC Headquarters at the end of the film.[4] A six-foot (1.8 m) Phoenix scale model, which emulated the design of the NASA multi-stage Saturn V rocket, had to be rebuilt after unexpectedly igniting and nearly injuring a technician.[4] For authenticity, the effects staff mounted the shots of the Phoenix lift-off outdoors in a section of the Century 21 car park so as to film against a genuine sky backdrop.[4][8] Archer and Hearn describe the sequence as \"one of the most spectacular\" of its kind produced by Century 21.[4] Sylvia Anderson, who considers it indistinguishable from a Cape Kennedy launch, comments that she is \"still impressed by the magic of the effects. Technology has come a long way since the early Seventies, but Derek's effects have endured.\"[9]Although Century 21 had constructed a life-size Dove capsule in Slough, it could not be used for filming at Pinewood Studios due to an arrangement with the National Association of Theatrical Television and Kine Employees (NATTKE) to build and use such props exclusively on-site.[20] Once the original had been incinerated, carpenters at Pinewood re-built the prop, although Anderson remained disappointed with the finished product, which he considered inferior.[20] Reviewing the scale models of Doppelgänger, Martin Anderson of the entertainment website Den of Geek describes the Phoenix command module as \"beautifully ergonomic without losing too much NASA-ness\",[24] and the Dove lander module as \"a beautiful fusion of JPL gloss with classic lines\".[24] He argues that the Phoenix launch sequence stood as the finest example of Meddings' work until his contributions to the 1979 James Bond film Moonraker, and praises his efforts all the more for the absence of computer animation in the late 1960s.[24]Composer Barry Gray recorded his score, his favourite of all his musical contributions to the Anderson productions,[25] in three days from 27 to 29 March 1969.[2][26] Fifty-five musicians attended the first studio session, with 44 at the second and 28 at the last.[26] The track titled \"Sleeping Astronauts\", which accompanies the scenes of Ross and Kane's journey through the Solar System, features an Ondes Martenot,[26] played by French ondiste Sylvette Allart.[25] Archer and Hearn credit \"Sleeping Astronauts\" as \"one of the most enchanting pieces Gray ever wrote\", and state that the soundtrack, which has not yet received a commercial release, evokes a \"traditional Hollywood feel\" that is in contrast to the 2069 setting of Doppelgänger.[2]The inspiration for the title sequence, set inside the secret laboratory of Dr Hassler, was the espionage theme embodied by the character: in what Archer and Hearn describe as an imitation of the style of 1960s James Bond films, a miniature camera is seen to be concealed inside Hassler's artificial eye.[17]","Distribution":"When production on Doppelgänger ended in October 1968, all 30 episodes of Joe 90 had been completed and the Andersons' upcoming television series, The Secret Service, had entered pre-production.[12] The final cut was given a mediocre reception by Universal Pictures executives, causing the film's release to be postponed for a year.[12] It received an A certificate from the British Board of Film Classification (BBFC) on 26 March 1969,[8][27] dispelling rumours of an X rating and fulfilling the Andersons' objective that Doppelgänger be suitable for children accompanied by adults.[14] To secure an A certificate, brief cuts were made to shots of contraceptive pills, shortening the running time from the original 104 minutes.[27][28]Doppelgänger opened at the Odeon Cinema in London's Leicester Square on 8 October 1969,[8] having premiered on 27 August in the United States.[29] On 1 November, it debuted in Detroit, Michigan, commencing a second round of presentations in American cinemas.[29] The film received a disappointing box office reception on general release.[12]British distributors Rank released the film under its original name in the UK and the rest of Europe.[2] The title Journey to the Far Side of the Sun was adopted in the United States and Australia,[2] since it had been determined by Universal that the audiences of these countries might not understand the meaning of the term \"doppelganger\".[5] Simon Archer and Stan Nicholls, authors of Gerry Anderson: The Authorised Biography, concede that Journey to the Far Side of the Sun – which has superseded Doppelgänger as the more popular title[2] – provides a clearer explanation of the plot, but argue that it lacks the \"intrigue and even poetic quality of Doppelgänger\".[5]Two prints of Doppelgänger in its original 35 mm format, for UK release, are known to exist.[1] One is retained by the British Film Institute (BFI), the other by Fanderson, the official fan society dedicated to the Gerry Anderson productions.[1] The original prints of Doppelgänger position Ian Hendry before Roy Thinnes in the opening credits; in the Journey to the Far Side of the Sun format, Thinnes is billed before Hendry.[12] Certain UK prints alter the final scene featuring the old Jason Webb with the addition of a short voice-over from Thinnes in character as Ross, who is heard speaking a line that he says to Webb earlier in the film: \"Jason, we were right. There are definitely two identical planets.\"[1]In the UK, Doppelgänger has been aired on TV under the title Journey to the Far Side of the Sun and has been formatted accordingly.[1] Broadcasts have often contained inverted picture due to a mistake made in transferring the original print to videotape.[1] Prior to a screening in the 1980s, a telecine operator viewed the print and, being unfamiliar with the premise of the film, concluded that the scenes set on the parallel Earth had been reversed in error.[5] An additional \"flop-over\" edit restored the image to normal, which became the standard for all broadcasts but compromised the plot: if Doppelgänger is screened in this modified form, the viewer is led to conclude that the parallel Ross has landed on the non-reversed, normal Earth.[5]Previously available in laserdisc format,[1] Doppelgänger was released on NTSC Region 1 DVD in both 1998 and – in digitally-remastered form – 2008.[30] The 2008 release included PAL Region 2 but was titled Journey to the Far Side of the Sun rather than Doppelgänger.[31] No additional material is present on the Region 1 releases;[32] the Region 2 version includes a film trailer.[28] While the Motion Picture Association of America (MPAA) has certified the film G since its original release,[29] before the 2008 DVD release the BBFC re-rated Doppelgänger PG (from the original A) for \"mild violence and language\".[27] A Blu-ray version was released in Region A in April 2015 as Journey to the Far Side of the Sun.[33]","produced_by":"Gerry and Sylvia Anderson","starring":"Roy Thinnes Ian Hendry Lynn Loring Patrick Wymark","running_time":"101 minutes","music_by":"Barry Gray","edited_by":"Len Walter"}