{"country":"United States","distributed_by":"20th Century Fox","Plot":"Police Officer Alex Kearney (Edwards) is a patrolman in Bryn Mawr, a rich plush suburb of Philadelphia until he stops an important businessman and his story of the incident is not believed. He is sent to work Downtown, the most dangerous, crime filled precinct in the city. Everyone there is sure that this 'by the book' suburb pampered cop is going to get himself and whoever is assigned as his partner, killed. Sergeant Dennis Curren (Whitaker) draws the unfortunate 'babysitting' assignment but when Alex's best friend is killed investigating a stolen car, Alex throws the book out the window tracking down the killer.Though the plot of the movie references a Philadelphia suburb, Bryn Mawr, most of the exterior filming is done within the City of Philadelphia. The beginning of the film features Cresheim Valley Road, Stenton, and Germantown Avenues. This is in the Mount Airy and Chestnut Hill neighborhoods. However, there are a few early scenes that are filmed in and around Los Angeles. For example, the scene where Anthony Edwards pretends to pull over Penelope Ann Miller is filmed on Yale Street, in Claremont, CA. Later portions of the film are in the Fairhill and Norris Square neighborhoods which are now known as \"The Badlands\" circa 2000. Diamond Street is within this area, but Philadelphia police districts are numbered, not named for streets or neighborhoods. Any Philadelphian would enjoy trying to catch their street in the fast paced filming.","downtown":"Movie promotional poster","language":"English","box_office":"$2,346,150[1]","cinematography":"Richard H. Kline","directed_by":"Richard Benjamin","release_dates":"January 12, 1990 (1990-01-12)|||||","produced_by":"Charles H. Maguire","starring":"Anthony Edwards|Forest Whitaker|Penelope Ann Miller|Joe Pantoliano|","running_time":"96 minutes","music_by":"Alan Silvestri","External links":"","edited_by":"Jacqueline Cambas Brian L. Chambers","written_by":"Nat Mauldin"}