{"country":"Hong Kong","Awards and nominations":"Composer: Chris Babida Lyricist: Wong Yuk Singer: One-Fang","distributed_by":"Newport Entertainment","language":"Cantonese","box_office":"HK$31,149,673","cinematography":"Peter Ngor Tam Tsi-wai","production_company":"Film Unlimited Production","c'est_la_vie,_mon_chéri":"DVD cover","directed_by":"Derek Yee","Television Series":"In 2008, Derek Yee and CCTV produced a television adaptation of C'est la vie, mon chéri, starring Chen Kun, Fiona Sit, Alex Fong, Candice Yu, and Benz Hui.","release_dates":"11 November 1993 (1993-11-11) (Hong Kong)|19 February 1994 (1994-02-19) (Berlin International Film Festival)||||","running_time":"105 minutes","mandarin":"Xīn Bù Liǎo Qíng","Plot":"Min (Anita Yuen), who is part of a Cantonese street opera troupe and a part-time cover artiste, meets Kit (Lau Ching-Wan), a struggling jazz musician who has just broken up with his celebrity singer girlfriend (Carina Lau). Through her bubbly personality, she affects Kit for the better. However, just as their relationship begins to stabilize and win acceptance from Min's family, which includes a strict mother and a doting, saxophone-playing uncle, Min is re-diagnosed with bone cancer, which she had once suffered as a young child.","Title":"The movie is sometimes referred to as C'est la vie, mon chérie even though this is grammatically incorrect in French (either \"mon chéri\" or \"ma chérie\" is grammatically correct). The title may be roughly translated as \"That's life, my darling/love\".The original Chinese title refers to the classic 1961 Hong Kong film Love Without End (不了情) starring Lin Dai, with the word \"new\" (新) added in front of it. The storyline is similar, in that the female lead character is also diagnosed with a fatal illness.An alternative English title is Endless Love.","cantonese":"San1 Bat1 Liu2 Cing4","traditional":"新不了情","Cast and roles":"[1] [2]","simplified":"新不了情","produced_by":"Alexander Chan","starring":"Lau Ching-wan Anita Yuen Carina Lau","Theme song":"The theme song of the same name C'est la vie, mon chéri (Chinese: 新不了情; pinyin: Xīn bùliǎo qíng) is sung by Taiwanese singer One-Fang.","music_by":"Chris Babida William Wu","edited_by":"Mei Fung Eric Kwong","written_by":"Derek Yee"}