{"country":"France Hungary","Awards and nominations":"Cyrano de Bergerac marked the second time that an actor had been nominated for an Oscar for his portrayal of Cyrano; the first time was in 1950, when José Ferrer won the award for his performance in the English-language version of the film.Gérard Depardieu won the Best Actor award at the 1990 Cannes Film Festival.[5]The film was nominated for 13 César Awards in 1991, and received 10, which is a record, including awards for Best Film, Best Actor, Best Cinematography, and Best Director.The film won the Golden Globe Award for Best Foreign Language Film.","distributed_by":"UGC","Plot":"Cyrano de Bergerac is a Parisian poet and swashbuckler with a large nose of which he is self-conscious, but pretends to be proud. He is madly in love with his \"friendly cousin\" (they were not actually related as cousins), the beautiful Roxane; however, he does not believe she will requite his love because he considers himself physically unattractive, because of his over large nose. Soon, he finds that Roxane has become infatuated with Christian de Neuvillette, a dashing new recruit to the Cadets de Gascogne, the military unit in which Cyrano is serving. Christian however, despite his good looks, is tongue-tied when speaking with women. Seeing an opportunity to vicariously declare his love for Roxane, he decides to aid Christian, who does not know how to court a woman and gain her love.Cyrano aids Christian, writing love letters and poems describing the very emotions that Cyrano himself feels for Roxane. Roxane begins to appreciate Christian, not only for his good looks but also his apparent eloquence. She eventually falls in love with him and they contract a secret marriage in order to thwart the plans of the Comte de Guiche, an arrogant nobleman who is himself a frustrated wooer of Roxane. In revenge, De Guiche summons Christian to fight in the war against the Spanish. The war is harsh and brutal: the Cadets de Gascogne are starving. Cyrano escapes over enemy lines each morning to deliver a love letter written by Cyrano himself but signed with Christian's name, sent to Roxane.Christian, at this time, is completely unaware of Cyrano's doings on his behalf. The love letters Cyrano writes eventually draw Roxane out from the city of Paris to the war front. She had come to visit Christian, the supposed romantic poet. Apparently, she admitted that she would rather love an ugly, but great poet, than a handsome, dimwitted fellow. Christian, realising his mistake, tries to find out whether Roxane loves him or Cyrano, and asks Cyrano to find out. However, during the battle that follows Roxane's visit, Christian is wounded and dies in battle. As he lies dying, Cyrano tells him that he asked Roxane and it was Christian she loved, but he actually has done no such thing. Cyrano fights off the attackers and the French win.Cyrano keeps his love for Roxane a secret for fourteen years, during which time he becomes unpopular because of his writings satirising the nobility. Roxane, grief-stricken, enters a convent. For fourteen years, Cyrano faithfully visits Roxane at her convent every week, never late until a fateful attempt on his life leaves him mortally injured. (He is not wounded by a sword, but instead suffers a serious head injury when struck by a heavy wooden beam.)One evening, against doctor's orders, Cyrano visits Roxane at the convent. Although he faints while telling her the court news, he dismisses it as the effect of his wound at Arras. When she mentions Christian's last letter, he asks to read it, but after she gives it to him, he instead is forced to recite it from memory, as it is now too dark for him to be able to read it. Only then does Roxane realise that it was Cyrano who wooed her under the balcony and wrote the love letters. After fainting again, he is forced to reveal his mortal wound to her. As Cyrano dies, Roxane realises that it was he, and not Christian, whom she had really loved all along.","Setting":"The film was shot in several locations across France and Hungary. Notable locations include:","language":"French","box_office":"$41.3 million[1]","cinematography":"Pierre Lhomme","directed_by":"Jean-Paul Rappeneau","Home media":"Cyrano de Bergerac was released on DVD by Umbrella Entertainment in May 2005 as part of a collection with the 1950 version. The DVD is compatible with all region codes and includes special features such as the theatrical trailer, Umbrella Entertainment trailers, talent biographies, an interview with Gérard Depardieu and a Roger Ebert review.[6] In February 2009 an Academy Award edition was released by Umbrella Entertainment.[7]","release_dates":"28 March 1990 (1990-03-28)|||||","produced_by":"René Cleitman Michel Seydoux André Szots","starring":"Gérard Depardieu Anne Brochet Vincent Pérez Jacques Weber","running_time":"137 minutes","cyrano_de_bergerac":"Film poster","music_by":"Jean-Claude Petit","edited_by":"Noëlle Boisson","written_by":"Jean-Claude Carrière Jean-Paul Rappeneau Edmond Rostand","budget":"$15.3 million"}