{"based_on":"A Christmas Carol  by Charles Dickens","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Hugo Butler","Plot":"The film opens on Christmas Eve in early Victorian London where Fred is sliding on ice on a sidewalk. He meets Peter and Tim Cratchit, sons of his uncle Ebenezer's clerk, Bob Cratchit. When Fred reveals who he is, the boys take off in terror. Fred soon arrives at the counting-house of his maternal uncle, Ebenezer Scrooge. After disdaining an invitation from his nephew to dine with him on Christmas, Scrooge turns away two men who are collecting money for the poor, instead supporting the prisons and workhouses. That night, Scrooge grudgingly allows his clerk Bob Cratchit the next day off with pay but orders him back all the earlier the day after. Later on, Bob accidentally knocks off Scrooge's hat with a snowball. Scrooge sacks him on the spot, withholding a week's pay to compensate for his ruined hat as well as demanding a shilling to make up the difference. Bob spends the last of his wages on food for his family's Christmas dinner.At home, Scrooge is confronted by the ghost of his seven-years-deceased partner, Jacob Marley, who in his life was also mean and greedy. As a result, he may not rest in peace but his spirit must roam and is forced to carry a chain as a reminder of all the deeds he did in his life instead of helping others. He tells Scrooge he will be haunted by three spirits and to expect the first at one in the morning.As Marley warned, the Ghost of Christmas Past shows Scrooge his youthful years. Scrooge is shown his unhappiness when he was left to spend the holidays alone at school, and his joy when his sister, Fan, came to take him home for Christmas. The spirit reminds Scrooge that Fan, dead for some years, is the mother of his nephew. Scrooge is then shown when he worked for Fezziwig, who was a cheerful and generous employer, in contrast to the kind of employer that Scrooge himself became.The second spirit, the Ghost of Christmas Present, shows Scrooge how others keep Christmas. At a church service, Fred and his fiancée, Bess, are seen as happy and in love. The couple must wait to marry because of Fred's financial circumstances, and the spirit observes that perhaps they will not marry at all and their love may end (just how Scrooge lost his unnamed fiancée in his youth). Scrooge is then shown the Cratchit home. Despite wearing a cheery manner for his family's sake, Bob is deeply troubled by the loss of his job (though he confides in no one except his daughter Martha). The spirit hints that Bob's youngest son, Timothy \"Tiny Tim\", will die of his unknown illness by the same time next year if things do not change.The final spirit, the Ghost of Christmas Yet to Come, shows Scrooge what will happen if he does not change. Scrooge discovers Tiny Tim is dead and his family mourn for him. Scrooge also discovers that his own death will not be mourned. Scrooge promises to repent and returns home.Waking in his own bed, Scrooge is now a changed man. He orders a boy in the street below his window to buy a turkey for him, meaning to take it to the Cratchits. Running into the two men who petitioned him for charity the evening before, Scrooge gives a large donation. He visits Fred and makes him his new partner, then goes to the Cratchit house where he rehires Bob and increases his wages. The film ends with Scrooge wishing everyone a \"Merry Christmas\".","language":"English","Television broadcast":"The film was shown on local television stations in the United States throughout the 1960s and 1970s, and was a staple of Chicago's WGN television's Family Classics. It also became a Christmas Eve tradition when it was telecast annually on WCBS-TV Channel 2 as part of their Late Late Show beginning in the early 1960s. By the early 1970s, WCBS-TV had acquired the 1951 film version and at that time ran both versions back to back. The MGM version would move to WNEW-TV, while the 1951 version had already moved back to WOR-TV (which first telecast it in the U.S.) in 1975. It ran in syndication throughout the United States from the 1960s to the 1990s until the advent of Cable Television. Since the late 1990s the MGM version has been almost exclusively broadcast on the Turner Classic Movies cable network, airing several times during December. In Los Angeles, this film aired on KTLA-TV while the 1951 version aired on KTTV. In later years, KTTV, today co-owned with FXM which holds the U.S. TV rights to the 1951 version, aired both versions of A Christmas Carol, especially after the 1938 version was colorized (the 1951 version was likewise colorized in the late 1980s), while KCOP, today sister to KTTV, aired the 1970 version.","cinematography":"Sidney Wagner|John F. Seitz|","directed_by":"Edwin L. Marin","Theatrical release":"Originally intended as a 1939 release, A Christmas Carol was rushed into production in October 1938 and was finished in a matter of weeks. It opened in December 1938 at New York City's Radio City Music Hall where it did moderately well. One of many adaptations of the work, it was frequently revived in theaters by MGM.","release_dates":"December 16, 1938 (1938-12-16)[1]|||||","Production":"Made by Metro-Goldwyn-Mayer, and originally intended to star Lionel Barrymore (who played the role of Scrooge annually on radio but was forced to drop out of the film because of his arthritis, though he narrated its trailer),[2] the movie starred Reginald Owen as Scrooge and the married couple Gene and Kathleen Lockhart as the Cratchits. Terry Kilburn, better known for his portrayal of Colley in Goodbye, Mr. Chips, costarred as Tiny Tim and a young June Lockhart (Gene and Kathleen's daughter) made her screen debut as one of the Cratchit daughters.[3] Leo G. Carroll played Marley's Ghost. The characters of Fred (Scrooge's nephew) and Elizabeth, his fianceé (his wife in the novelette), were greatly expanded in order to work in a romantic angle to the story that Dickens did not intend. The couple was played by Barry MacKay and Lynne Carver. Ann Rutherford, better known as Polly Benedict in the Andy Hardy films and as Carreen O'Hara in Gone with the Wind, was a young and attractive Ghost of Christmas Past, rather than the somewhat unusual creation that Dickens described.The music for the film was composed by Franz Waxman, in contrast to most MGM films of the period, whose scores were composed by Herbert Stothart.Some of the grimmer aspects of the story went completely unmentioned or unseen, in order to make this a \"family film\" in the style of other MGM literary adaptations, and also to accommodate a 69-minute run time. Although Marley's Ghost did appear, the phantoms wailing outside Scrooge's window were not shown. Scrooge's fiancee, who eventually leaves him because of his miserly ways, was completely dropped from the film, as were the two starving children \"Want\" and \"Ignorance\", who hid within the folds of the Ghost of Christmas Present's robe. Also gone were the thieves who ransack Scrooge's belongings after he \"dies\" in the Ghost of Christmas Yet to Come segment. While Gene Lockhart's performance as Bob Cratchit is admired, he is often criticized for looking too \"well-fed\" for the role. In this production, unlike Dickens' original story, Scrooge actually fires Cratchit rather than just threatening to do so.One of the changes made in this film that differs from the novel is the arrival of the ghosts. While the first still arrives at 1:00 a.m., the second appears at 2:00 and the third appears at 3:00. In the original novel, the second appears the next night at 1:00 and the last appears the third night when the last stroke of 12:00 has ceased to vibrate. This change was also used in other versions such as Scrooge (1970), Mickey's Christmas Carol (1983), and A Christmas Carol (1984).","Home media releases":"In 1988, MGM/UA Home Video and Turner Entertainment released A Christmas Carol on VHS celebrating its 50th anniversary, for the first time in a colorized version. In an interview with The Hollywood Reporter in 1988 promoting the film's release on home video, actress June Lockhart admitted that, despite being an MGM production, it was \"a 'B' picture\". The colorized version was released once again on VHS by Warner Home Video in 2000. On November 8, 2005, the black and white version was released on DVD in a \"Classic Holiday Collection\" box set including Boys Town and Christmas in Connecticut, two other MGM titles with a holiday/family theme; it was also released as an individual title. Since its first DVD release, it has seen multiple releases in various Christmas movie collection box sets. A Blu-ray version was released in November 2014.","produced_by":"Joseph L. Mankiewicz","starring":"Reginald Owen|Gene Lockhart|Kathleen Lockhart|Terry Kilburn|Barry MacKay|","running_time":"69 minutes","a_christmas_carol":"Theatrical release poster","music_by":"Franz Waxman","edited_by":"George Boemler"}