{"based_on":"The Race of My Life by Milkha Singh and Sonia Sanwalka","country":"India","distributed_by":"Viacom 18 Motion Pictures","Critical response":"The film received mostly positive reviews from critics.[43]Bollywood Hungama's Taran Adarsh predicted that it would \"win accolades, admiration, respect and esteem, besides emerging as a champ\",[44] while Sneha May Francis of Emirates 24/7 gave a thumbs up, saying that the film is \"truly epic\" and that \"despite the prestigious Olympic glory eluding him, Mehra deservedly honors the runner’s other victories and impeccable talent, allowing us to applaud the prodigy.\"[45] Desimartini, with almost 5000 ratings by the end of the weekend stated the following: \"Superbly directed, Bhaag Milkha Bhaag is an outstanding film with an incredible performance by Farhan Akhtar. Though long, it keeps you hooked throughout. Don't miss this patriotic tribute to Milkha Singh.\"Madhureeta Mukherjee of The Times of India stated, \"While you are on-the-run, pause to watch this one.\"[46] The India Today review concluded, \"Go and run with Milkha. In this fast-paced life, this race will definitely soothe your senses.\"[47] Sify's Vijay Sinha praised the film, judging \"Bhaag Milkha Bhaag should get even drug-addled Punjab flocking to the cinemas.\"[48] Gayatri Sankar of Zee News wrote, \"If you are a patriotic Indian, you will be left teary eyed and your head held high.\"[49] Yahoo! Movies' review summed up, \"Mehra has helmed 'Bhaag Milkha Bhaag' into a compelling story and an exemplar of cinematic brilliance; that it is also an inspiring tale almost seems to be a by-product.\"[50]Hrithik Roshan praised Akhtar’s performance and deemed the film to be \"phenomenal\".[51] Veteran actor Amitabh Bachchan highly praised it on his blog, describing it as \"too emotionally and creatively moving to put anything down in words\".[52] Carl Lewis watched Bhaag Milkha Bhaag in the US and called Milkha Singh in India to express his appreciation for the film and the athlete.[53]Aseem Chhabra of Rediff.com gave a mixed review and reasoned that film does not offer anything new. However, he praised Akhtar's performance, writing \"If there is one reason to see BMB it is to watch Akhtar – how much he has evolved as an actor and the sincerity with which he immerses himself in the character.\"[54] NDTV echoed the same sentiment, \"Bhaag Milkha Singh is a 400 meters sprint that feels like a cross-country race.\"[55] Despite praising the technical aspects and music, Rajeev Masand of CNN-IBN criticized the length: \"The film itself is well intentioned and shines a light on an important figure. The film is an ambitious account of the first 27 years or so of celebrated Indian sprinter Milkha Singh's roller-coaster life. But it's too long and too unfocused to leave a lasting impression.\"[56][57]Robert Abele of the Los Angeles Times described the film as \"a stirring bio of Milkha Singh\",[58] while Nicolas Rapold of The New York Times said that \"the movie strikes its chosen couple of notes resoundingly, making clear what makes Singh run.\"[59] Twitch Film's review said, \"[..]in the grand scheme of things. Bhaag Milkha Bhaag is easily one of the best mainstream films to come out of Bollywood this year.\"[60] Scott Foundas of Variety described it as a \"rousing and handsomely crafted biopic\".[61] Lisa Tsering of The Hollywood Reporter opined that the biopic \"requires viewer endurance, but pays off with an exhilarating climax.\"[62] Digital Spy praised the wwork and said, \"It is a blessing that this film was made and the inspiring story of India's greatest sporting hero told to a generation who might otherwise never have known the legend of 'The Flying Sikh.'\"[63]The Los Angeles Times stated that there's enough dramatic restraint and performance charm to give Singh his due as a justifiably glorified figure in India's independence.[64]The Washington Post stated that the Bollywood import dramatizes the life of famed Indian sprinter Milkha Singh.[65]","Plot":"The film starts in the 1960 Summer Olympics in Rome, where a coach says \"Bhaag Milkha Bhaag!\" The runner is taken back to the memories of his childhood days which haunt him, resulting in him dropping to fourth. Partition of India in 1947 caused chaos which resulted in mass religious violence in Punjab in British India, killing the parents of Milkha Singh (Farhan Akhtar). He reaches Delhi and later meets his sister there. Living in impoverished refugee camps, Milkha makes friends and survives by stealing with them. He falls in love with Biro (Sonam Kapoor), but she asks him to live a life of honesty.Milkha finds himself in the army where he gets noticed by a havaldar (sergeant) after he wins a race in which the top 10 runners will get milk, two eggs and excused from exercise. He gets selected for service commission where he is miffed and gets beaten up by senior players whom he had defeated earlier, on the day before selection of Indian team for Olympics. In spite of being injured, he participates in the race. Overcoming his pain, he wins the race thus breaking the national record.During the Melbourne 1956 Olympics he is attracted to the granddaughter of his Australian technical coach. After a frolicking night in a bar, they have a one-night stand. The following day he feels exhausted from the night's activities and loses the final race. He realizes his mistake. Suffering from guilt, he even slaps himself in front of a mirror. On the flight back to India he asks his coach what the world record is for the 400m race and learns that it is 45.90 seconds. He trains hard and wins in several places. He then breaks the previous world record for the 400m race with a time of 45.80 seconds.Jawaharlal Nehru (Dalip Tahil), the prime minister, convinces him to lead the Indian team in Pakistan for a friendly race with Abdul Khaliq (Dev Gill), also known as the fastest man of Asia. In Pakistan he misses the press conference and goes to his village where, in a flashback, it is shown how his parents were murdered and the last words of his father were \"Bhaag Milkha Bhaag!\" He starts crying and is comforted by a boy who turns out to be his childhood friend's son. He also meets his friend Sampreet.In the games, initially the Pakistani favorite is winning, but Milkha takes the lead overtaking opponents one by one, taking a convincing lead, and winning the race and respect of the two nations. The president of Pakistan, General Ayub Khan, impressed by his effort gives him the title \"The Flying Sikh\". Jawaharlal Nehru declares a day in the name of Milkha as national holiday as desired by Milkha himself.","language":"Hindi","box_office":"₹1.64 billion (US$24 million)[5]","cinematography":"Binod Pradhan","production_company":"ROMP Pictures","directed_by":"Rakeysh Omprakash Mehra[1][2]","Soundtrack":"The music and the background score were composed by Shankar-Ehsaan-Loy, their first film collaboration with Rakeysh Omprakash Mehra. The soundtrack features seven tracks with lyrics written by Prasoon Joshi. The audio was released by Sony Music on 14 June 2013, on digital platforms including iTunes and Amazon.Farhan Akhtar and director Rakeysh Omprakash Mehra launched the movie's official mobile game at the Reliance Digital electronics store in Times Square on 3 August 2013.[29]","release_dates":"12 July 2013 (2013-07-12)|||||","Production":"After the release of Delhi-6 (2009), director Om Prakash Mehra started developing two projects: a historical love story, Mirza Sahiban, and a biopic of Milkha Singh. The biopic developed better, and he chose the latter. Prasoon Joshi, who co-wrote Delhi-6 with Mehra, started working on the script.[18] Joshi later clarified that the film's title, Bhaag Milkha Bhaag (Run Milkha Run) was never actually spoken by Milkha's father. Rather, it was phrase coined by him and was used liberally throughout the narrative.[19]\"This film is not a mirror of Milkha Singh's life. It is an interpretation of his life.\"Growing up in Delhi, Mehra was familiar with anecdotes from the life of Milkha Singh, the ace runner popular as \"Flying Sikh\". He used to visit the National Stadium, Delhi for swimming, where Singh also came for his practice. Gradually, he came to know details regarding his early life, including how he witnessed his entire family being killed during the partition and traveled alone to Delhi as a refugee. Mehra started developing the project as personal story rather than a sports film, taking the theme of \"zindagi se bhago nahin, zindagi ke saath bhago\" (\"don't run away from life, run with life\"), depicting his life from 13 to 28 years.For research, he visited Chandigarh several times, where he talked for hours with Singh. Jeev Milkha Singh, the son of Milkha Singh and a notable golfer, arranged his meetings with the family members.[18] Milkha Singh refused a large offer for allowing his story to be adapted and charged a token amount of ₹1 (1.5¢ US), as he believed if the film could \"inspire our young people and result in India's first Olympic track gold, that would [be] reward enough for him.\"[20]It took the next two and half years to write the story.[21] According to the director, it is not a sports film, but a film about human spirit.[22]In 2010, early contenders of the lead role were Abhishek Bachchan and Akshay Kumar. While Bachchan was preferred by Mehra, Kumar was preferred by Milkha Singh. However, Mehra deferred the final decision on the cast till the final script was completed.[23] After months of search,[21] in September 2011, the principal cast were announced. Actor-director Farhan Akhtar and Sonam Kapoor received the lead roles. Thereafter, Akhtar visited Punjab to meet Milkha Singh and his family.[24] Before deciding, Akhtar met Mehra once for a story session and immediately agreed to play the role.[25] He was inspired by Milkha Singh's life and underwent extensive physical training for the role.[22]Pakistani actress and singer, Meesha Shafi — who got fame after her song \"Alif Allah (Jugni),\" played RAW agent in the hit Pakistani film Waar and in 2013 made her Hollywood debut with The Reluctant Fundamentalist — was selected for the role of Perizaad (Milkha Singh's best friend).The principal photography commenced in February 2012 and mainly took place in Punjab, India, with some scenes shot in Delhi, Tokyo, Melbourne and Rome.[26][27][28]International company ReelSports coordinated the sports action for Bhaag Milkha Bhaag and cast all the elite runners.","Box office":"Bhaag Milkha Bhaag grossed ₹1.64 billion (US$24 million) worldwide and is the fifth highest-grossing 2013 Bollywood film.[5]The film opened very well at multiplexes across India, especially in Punjab and Delhi.[66] It earned approximately ₹85 million (US$1.3 million) on its first day. The film showed a 21-percent growth and earned ₹105 million (US$1.6 million) on the second day of its box office run.[67] Bhaag Milka Bhaag grossed approximately ₹317 million (US$4.7 million) nett over its first weekend,[68] and earned a total of ₹55 million (US$820,000) nett on Monday. Its four-day gross amounted to ₹365 million (US$5.4 million) nett.[69] Bhaag Milkha Bhaag ended its first week with a total collection of approximately ₹535 million (US$8.0 million) nett.[70][70] It collected around ₹35 million (US$520,000) nett on its eighth day.[71] It collected ₹55 million (US$820,000) nett on its second Saturday.[31] The ten-day domestic business was ₹695 million (US$10 million) nett approx.[10][72] The film grossed around ₹279.80 million (US$4.2 million) nett in its second week taking its total collections to ₹810 million (US$12 million).[72][73] It had grossed over ₹900 million (US$13 million) nett in 17 days as it grossed around ₹95 million (US$1.4 million) nett in its third weekend.[74] The film added ₹15 million (US$220,000) nett approx in its third week to take its nett gross to ₹964 million (US$14 million).[75][76] It grossed ₹1.02 billion (US$15 million) nett in 24 days as it added around ₹50 million (US$740,000) nett in its fourth weekend.[77]Bhaag Milkha Bhaag grossed around $1.4 million over its first weekend.[78] The film grossed US$647,112 in its first week of release in the United States, and debuted at the 15th spot at the box office.[79] It has done well overseas with collections of around $2.7 million. The film has done well in US.[80] It has done overseas business of over US$3.5 million and has been declared a hit.[81] The final overseas business is around US$3.8 million.[82]","produced_by":"Rajiv Tandon Raghav Bahl Maitreyee Dasgupta Madhav Roy Kapur Rachvin Narula Shyam P.S Navmeet Singh P. S. Bharathi","starring":"Farhan Akhtar Art Malik Sonam Kapoor Hikaru Ito Meesha Shafi Divya Dutta Pawan Malhotra Yograj Singh Prakash Raj Japtej Singh Jass Bhatia","running_time":"189 minutes[3]","bhaag_milkha_bhaag":"Theatrical release poster","Controversy":"The film's song \"Maston Ka Jhund\" landed into controversy after a right-wing Hindu organization, Hindu Janajagruti Samiti (HJS), took objection to the use of the word \"havan\" in the song. They alleged that havan (Yagya) has been used in a derogatory manner. Their reference is to the allegedly 'obscene' actions that the actors performed in the song. Demonstrations were held in Goa regarding the issue.[83]Certain members of the Central Board of Film Certification (CBFC) boycotted a workshop held in accordance with Information and Broadcast Ministry's wish citing partially of some officials of the censor board particularly regarding the certificate given to Bhaag Milkha Bhaag which, in spite of a sex scene and some violence, got a U certificate[a] lashing out and criticising the decisions of the censor examining member and former actress, Sharmila Tagore accusing CEO Pankaja Thakur along with some other board officials being puppets controlled by film directors and promoting vulgarity.[85]As a consequence the Delhi High Court sought an explanation from the I&B ministry and the CBFC regarding the escalating levels of vulgarity in recent times.[85][86]Although the story mentions that Milkha Singh held the men's 400 meter world record, the men's 400 metres world record progression does not mention Milkha Singh's name in the world record holders. It is shown that Ranbir Singh (Milkha Singh's coach) mentions world record as 45.9 seconds after 1952 Olympics; while Milkha eventually bested that time in the 1956 Olympics with a personal record of 45.73 seconds, the newest world record was 45.2 seconds set by Lou Jones of United States, the first-place winner in the same race.[87]Gurbachan Singh Randhawa, renowned athlete, who was part of Indian team at Rome Olympics mentions that the claim made in movie about Milkha Singh leading the 400 meter race and he lost it as he looked behind, is incorrect. He never led the race and he was at fifth position at 300 meters.[87]In the final race when Milkha Singh’s sister tune in the radio to follow the developments in Lahore live, the radio commentator can be heard as announcing, “It seems that entire Pakistan has settled inside the Gaddafi Stadium in Lahore.” The Lahore Stadium which was originally built in 1959 wasn’t renamed as Gaddafi Stadium until 1974.[88]The Malaysian flag did not exist until 1957. There a Malaysian flag in a scene during 1956 in Melbourne.Though the movie is set in the 1950s, Farhan Akhtar sings the song \"Nanha munna rahi hoon.\" The song is from the movie Son of India which was released in 1962.[89]","music_by":"Shankar-Ehsaan-Loy","edited_by":"P. S. Bharathi","Release":"Bhaag Milkha Bhaag released on 12 July 2013 in 1200 screens worldwide including 140 screens in USA.[30]Maharashtra government and Madhya Pradesh government granted an entertainment tax exemption to Bhaag Milkha Bhaag on 20 July 2013.[10][31][32][33] On 24 July 2013, the Delhi government also announced a tax exemption.[34][35][36] On 25 July 2013, Goa's government gave tax-free status to the film for three months.[37][38] On 29 July 2013, Haryana government made the film tax-free in the state.[39][40][41] On 1 August 2013, Uttar Pradesh government approved a proposal to exempt Bhaag Milkha Bhaag from entertainment tax in two installments or for a maximum of two months.[42]","written_by":"Prasoon Joshi","budget":"₹300 million (US$4.5 million)[4]"}