{"Cast":"On MLB Network's Costas at the Movies in 2013, director Penny Marshall talked about her initial interest in Demi Moore for the part of Dottie Hinson, saying: \"Demi Moore, I liked, but by the time we came around, she was pregnant.\"[3]","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Lowell Ganz Babaloo Mandel","story_by":"Kelly Candaele Kim Wilson","Plot":"In 1988, Dottie Hinson attends the opening of the new All-American Girls Professional Baseball League (AAGPBL) exhibit at the Baseball Hall of Fame. She sees many of her former teammates and friends, prompting a flashback to 1943.When World War II threatens to shut down Major League Baseball, candy magnate and Cubs owner Walter Harvey persuades his fellow owners to bankroll a women's league. Ira Lowenstein is put in charge, and Ernie Capadino is sent out to recruit players. Capadino attends an industrial-league softball game in rural Oregon and likes what he sees in Dottie, the catcher for a local dairy's team. Dottie turns down Capadino's offer, happy with her simple farm life while waiting for her husband Bob to come back from the war. Her sister (and teammate) Kit, however, is desperate to get away and make something of herself. Capadino is not impressed by Kit's hitting performance, but agrees to take her along if she can change Dottie's mind. Dottie agrees, but only for her sister's sake.Dottie and Kit head out to Harvey Field in Chicago for the tryout. There they meet a pair of New Yorkers, taxi dancer \"All the Way\" Mae Mordabito and her best friend, bouncer Doris Murphy, along with soft-spoken right fielder Evelyn Gardner, illiterate, shy left fielder Shirley Baker, pitcher/shortstop and former Miss Georgia beauty queen Ellen Sue Gotlander, homely second baseman Marla Hooch, who was discovered by Ernie, Dottie and Kit in Fort Collins, Colorado playing for her father's American Legion team, and first baseman Helen Haley, a native of Saskatchewan. They and eight others are selected to form the Rockford Peaches, while 48 others are split among the Racine Belles, Kenosha Comets, and South Bend Blue Sox.The Peaches are managed by Jimmy Dugan, a former marquee Cubs slugger who initially treats the whole thing as a joke. The league attracts little interest at first. With a Life magazine photographer in the stands, Lowenstein begs the players to do something spectacular. Dottie obliges when a ball is popped up behind home plate, catching it while doing a split. The resulting photograph makes the magazine cover. A publicity campaign draws more people to the ballgames, but the owners remain unconvinced. Due to Kit's sibling rivalry with her sister, she is traded to the Peaches' rival, the Racine Belles.The Peaches end the season qualifying for the league's World Series, but just before the end of the season Betty \"Spaghetti\" Horn, the team's utility player, is informed that her husband George was killed while fighting in the Pacific Theater. Later that evening, Dottie receives a surprise when Bob, who has been serving in Italy, shows up. He has been discharged from the Army. The following morning, Jimmy discovers that Dottie is going home with Bob. He is unable to persuade her to at least play in the World Series; he tells her she will regret her decision.The Peaches and Belles meet in the World Series, which reaches a seventh and deciding game. Dottie, having reconsidered on the drive back to Oregon, is the catcher for the Peaches, while Kit is the starting pitcher for the Belles. With the Belles leading by a run in the top of the ninth, Dottie drives in the go-ahead run. Kit is the final batter. Under immense pressure, she gets a hit and, ignoring the third base coach's sign to stop, scores the winning run by knocking her sister over at the plate and dislodging the ball from Dottie's hand. The sellout crowd convinces Harvey to give Lowenstein the owners' support. After the game, the sisters reconcile before Dottie leaves.Back in the present, Dottie is reunited with several other players, including Kit, whom she has not seen in several years. The fates of several of the characters are revealed: Jimmy, Bob, and Evelyn have died, while Marla has been married to Nelson, a man she met in a bar, for over 40 years. The original Peaches sing a team song composed by Evelyn and pose for a group photo.","language":"English","Television series":"A short-lived series of the same title aired in 1993. Megan Cavanagh and Tracy Reiner reprised their roles.","a_league_of_their_own":"Theatrical release poster","box_office":"$132,440,069[1]","cinematography":"Miroslav Ondricek","production_company":"Parkway Productions","directed_by":"Penny Marshall","Soundtrack":"A League of Their Own soundtrack was released on CD and cassette tape by Columbia Records on June 30, 1992. The album peaked at #159 on the US Billboard 200 album chart on July 25, 1992.[12] Although Madonna contributed \"This Used to Be My Playground\" to the film, featured over the closing credits, her recording was not included on the soundtrack album for contractual reasons.[13]","release_dates":"July 1, 1992 (1992-07-01)|||||","produced_by":"Elliot Abbott Robert Greenhut","starring":"Tom Hanks|Geena Davis|Madonna|Lori Petty|Jon Lovitz|David Strathairn|Garry Marshall|Bill Pullman|","running_time":"128 minutes","20th anniversary":"With 2012 marking the 20th year since the film's release, A League of Their Own was released as a 20th Anniversary Edition Blu-ray on October 16, 2012.[14]Forty-seven former players of the AAGPBL reunited in New York to celebrate the film and the real women who inspired it. Events included a trip to Cooperstown for a special program at the National Baseball Hall of Fame, reminiscent of the film's final scene depicting members of the AAGPBL and family coming together to witness the honoring of the Women's Professional Baseball League. The reunion wrapped up with a game of softball held at Alliance Bank Stadium in nearby Syracuse.[15]Former players also made an appearance at Bosse Field in Evansville, Indiana on June 6, 2012, where many of the film's game scenes were filmed. The event included an outdoor screening of the film as well as a scene-setting display of cars featured in the film.[16] In addition to Bosse Field, the production used Huntingburg, Indiana's League Stadium, another Southwestern Indiana field older than Bosse that was renovated for the film.[17][18]On December 19, 2012 it was announced that the film would be preserved as part of the United States National Film Registry.[19]","music_by":"Hans Zimmer","edited_by":"George Bowers","Production and reception":"Discussing the skirts they wore playing baseball in the film, Geena Davis said on MLB Network's Costas at the Movies in 2013, \"Some of our real cast, from sliding into home, had ripped the skin off their legs. It was nutty.\"[citation needed]The film was released on July 1, 1992 and was #1 by its second weekend (July 10–12).[4] It was a commercial success, making $107 million in the United States (and an additional $25 million worldwide) on a $40 million budget, and was well received by critics.[5][6][7][8][9]The Jimmy Dugan proclamation, \"There's no crying in baseball!\", was rated 54th on the American Film Institute's list of the greatest film quotes of all time.[10]A television series[11] based on the film aired on CBS in April 1993, with Garry Marshall, Megan Cavanagh, Tracy Reiner, and Jon Lovitz reprising their roles. Only five of the six episodes made were broadcast.","budget":"$40 million"}