{"country":"United States[1]","distributed_by":"Warner Bros. Family Entertainment","Plot":"The film begins in a Kingdom of Trolls, where Stanley (Dom DeLuise) has a magical green thumb with the ability to bring flowers and plants to life at a touch. When he is discovered doing so, the other trolls take him as prisoner to Gnorga (Cloris Leachman), the Queen of the Trolls, who concludes that Stanley \"gives a bad name to trolls everywhere\" and demands that he be turned to stone. At the behest of her consort King Llort (Charles Nelson Reilly), Gnorga instead banishes Stanley to Central Park where, after a series of mishaps, Stanley hides himself under a bridge. In New York City, two young siblings named Gus and Rosie (Phillip Glasser and Tawny Sunshine Glover) learn that their father Alan (Jonathan Pryce) and mother Hilary (Hayley Mills) cannot take them to Central Park. While left alone with their nanny, Maria, Gus takes Rosie to the Park himself. While playing with Gus's toy boat, which is later accidentally smashed, Rosie befriends Stanley. When Queen Gnorga discovers Stanley happy in exile, she creates a flood to drown them by making Gus cry, but Stanley enlarges Gus's toy boat to escape. Soon after, Stanley shows the children his own ideals, depicted as a world of his own.Determined to suppress Stanley, Queen Gnorga sends a tornado to destroy Central Park, and kidnaps Rosie. Gus, having failed to persuade Stanley's help, himself faces Gnorga. In the resulting fight, Gnorga transforms Gus into a troll, while Stanley rescues Rosie. Having arrived, Stanley challenges Gnorga to a thumb-wrestling match, which when Stanley gains advantage, plants roses all around Gnorga's body. As Stanley, Gus, and Rosie escape and celebrate their victory, Gnorga uses Gus's thumb to turn Stanley to stone. Gus and Rosie fall into their apartment and the last of Stanley's power changes Gnorga into a rose bush. Gnorga, Llort and their dog then return to the Kingdom of Trolls, while Gus returns to his human form. The next day, Gus, Rosie, and their parents enter Central Park, where Gus and Rosie place the petrified Stanley on a makeshift pedestal, and attempt to revive him without apparent effect, only to find him revived after a moment's pause. Restored to life, Stanley recreates Central Park and covers Manhattan with flowering plants.In the Kingdom of Trolls, Llort takes Gnorga's place as a kinder ruler. Llort is last seen reading a newspaper with \"Gnorga: Queen of Posies\" written on it; as he read the headline, Gnorga's dog bites him.","a_troll_in_central_park":"Theatrical release poster by John Alvin.","language":"English","Reception":"The film grossed $71,368 in North America.[5] It was Don Bluth's lowest-grossing film to date, though not his film to lose the most money overall. Gary Goldman has said the reason for this was that the film was released without any sign of promotion and its release was limited. He also stated that its distributor Warner Bros. did not have any confidence in the film.[this quote needs a citation]A Troll in Central Park holds an approval rating of 17% based on six reviews, five negative and one positive, from Rotten Tomatoes.[6] TV Guide gave the movie two out of five stars and felt that the film's appeal was very age-limited, calling it \"Pastel-pretty and cloyingly sweet,\" and that A Troll in Central Park is strictly for the youngest members of the moviegoing audience.\"[7] In the July 2001 issue of his magazine ToonTalk, Don Bluth said that \"the development of a story is like the development of a child in a womb; it takes time and it must be done right and building A Troll in Central Park, taught us this lesson, the hard way.\" The A.V. Club wrote that A Troll in Central Park is \"widely considered to be [Don Bluth's] worst film.\"[8]","box_office":"$71,368","production_company":"Don Bluth Entertainment","directed_by":"Don Bluth|Gary Goldman|","Soundtrack":"The music for A Troll in Central Park was composed and conducted by Robert Folk, who previously provided the soundtrack for Rock-a-Doodle, and was performed by the Irish Film Orchestra.[3] Although a commercial soundtrack was not released alongside the film in 1994, a limited edition CD containing 15 tracks from the movie was made available on February 12, 2012 by Intrada Records as part of their Intrada Special Collection.[4] The tracks were taken from the original digital session masters, with three songs ultimately omitted due to being permanently wedded to sound effects and dialogue from the film.[4]","release_dates":"October 7, 1994 (1994-10-07)|||||","Production":"Work on A Troll in Central Park began in 1990, following the near completion of Rock-a-Doodle. During production, Don Bluth said to his employees that they should put their best in this film, but if they don't, they can \"go plant themselves in another garden\".[2] A while after he said that, some animators left to work at Disney on Beauty and the Beast. Buddy Hackett and Robert Morley recorded their voices for Stanley and King Llort, but were eventually replaced by Dom DeLuise and Charles Nelson Reilly. Even though the film was completed in 1992, it was not released in theaters until 1994. At that time, the film was originally slated for a March 1994 release, but due to production difficulties and the producers deciding to release Thumbelina first, the film's release date was changed to October 7, 1994.","Home media releases":"On January 10, 1995, Warner Home Video released A Troll in Central Park on VHS and LaserDisc in the United States and Canada.[9] In the UK, the movie was released on VHS under the title Stanley's Magic Garden.[10] 20th Century Fox Home Entertainment released the film on DVD for the first time on February 19, 2002.[11]","produced_by":"John Pomeroy|Don Bluth|Gary Goldman|","starring":"Dom DeLuise|Phillip Glasser|Tawny Sunshine Glover|Cloris Leachman|Charles Nelson Reilly|","running_time":"76 minutes","music_by":"Robert Folk","edited_by":"Fiona Trayler","written_by":"Stu Krieger"}