{"country":"United States","bad_manners":"Bad Manners Region 2 DVD cover","distributed_by":"New World Pictures","language":"English","Reception":"Targeted to a teen audience, the film has received largely negative reviews from adult critics. In his October 2, 1984 review for the Boston Phoenix, film critic Owen Gleiberman criticized Houston's directing, writing, \"Houston has fashioned a cinematic contradiction: the corporate cult film. He's taken the derisive black comedy of directors like John Waters and the pre-70s Roger Corman and repackaged it like laundry detergent.\", adding, \"Local publicists have been telling me that this is going to be the first cult movie for kids, but somehow it's hard to imagine packs of 12-year-olds jamming the Nickelodeon for an R-rated movie about abused orphans.\" Despite finding elements of the film cynical and contrived, Gleiberman would go on to praise some of the young stars' performances, writing \"The actors are agreeably rowdy prepubescents, and a couple of them are genuine finds. As Piper, Georg Olden has a charisma and physical grace far beyond his years, and musclebound Christopher Brown playing a suave black kid named, uh, Blackie, has the penetrating presence of a mini Yaphet Kotto.[1]In her overview of the film, Eleanor Mannikka of AllRovi felt the \"comedy\" elements of the film fell short, writing \"Everyone is a stereotypical extreme in this sometimes mean-spirited black comedy about the vicious staff at an orphanage, the garrulous punk kids who live there, and the pretentious overblown rich couple who adopt one of the orphans – this is not a happy world. [...] With a low-brow, low-budget approach, the premises are obviously meant to key in to the slapstick characterizations, but for some viewers, even the comic moments may not assuage the meaner undertones of the film.\"[2] TV Guide's review felt the film had potential, but was played too over-the-top: \"Sort of a modern-day version of Oliver Twist, Bad Manners was an independently made movie that might have made noise at the box office had more attention been paid to detail and less to overplaying. [...] The film takes lots of whacks at \"The Establishment,\" and the shame of it is that in the right hands this might have been a good film.\"[3]","Synopsis":"The film begins at the ominous \"Home of the Bleeding Heart\" Catholic orphanage, where teenage delinquent \"Piper\" (Georg Olden) arrives by police escort. There he meets the cruel overseers: the stern head-mistress of the orphanage, Sister Serena (Anne De Salvo), and the cattle-prod wielding head-master, Mr. Kurtz (Murphy Dunne). After disobeying the home's loathsome authority figures, Piper is sent into solitary confinement where he befriends a group of adolescent trouble-makers; \"Girl Joey\" (Pamela Segall), the tough-talking \"tomboy\" of the group; \"Mouse\" (Michael Hentz), the smallest, youngest and \"cutest\" of the group; \"Whitey\" (Joey Coleman), the platinum blonde, self-appointed \"leader\" of the group; and \"Blackie\" (Christopher Brown), the \"intellectual\" and only black orphan at the home.[1][2][3][4]As prospective \"parents\" come to the Home of the Bleeding Heart to assess the children for adoption, the orphans, desperate not to be separated from the \"family\" they have in each other, make every attempt not to be selected. However, the family of young misfits is shattered when the Fitzpatricks (Martin Mull and Karen Black), a self-absorbed upper-class couple, find Mouse irresistible and decide to adopt him, promptly whisking him away to their suburban home in Santa Barbara, California. Devastated by Mouse's departure, the group of young rebels devise a plan to \"rescue\" him, outwitting the maniacal staff and escaping the oppressive orphanage. In their odyssey to free Mouse, the four street-smart teenagers lie, cheat, and steal their way to Santa Barbara, wreaking havoc on suburbia every step of the way.[1][2][3][4]","cinematography":"Jan De Bont","production_company":"Growing Pains Productions, Inc.","directed_by":"Bobby Houston","release_dates":"October 1984 (1984-10) (United States)|||||","Production":"Although listed by several online sources under the title Growing Pains, in his October 1984 review of the film, Boston Phoenix film critic Owen Gleiberman consistently referred to the film by the title Bad Manners. The film was both written and directed by, then 29-year-old, Robert Houston (credited as \"Bobby Houston\"), whose only previous writing/directing credit was the Samurai themed action-adventure feature film, Shogun Assassin. Filmed in 1983 and produced by Growing Pains Productions, Bad Manners was released by New World Pictures in October 1984. Songs for the film's soundtrack were written by Ron Mael and Russell Mael of Sparks. Sparks also performed several of the songs for the film, including the film's title song, \"Bad Manners\".[1][2][3][4]","produced_by":"Kim Jorgensen","starring":"Martin Mull Karen Black Anne De Salvo Murphy Dunne Georg Olden Pamela Segall Michael Hentz Joey Coleman Christopher Brown","running_time":"82 minutes","music_by":"Ron & Russell Mael (\"The Sparks\")","edited_by":"Barry Zetlin","written_by":"Bobby Houston Joseph Kwong"}