{"based_on":"novel by Robert MacLeod","country":"United States","distributed_by":"20th Century Fox","Plot":"In 1912 Sonora, Mexico, Lyedecker is an Arizona lawman who travels to a remote village to meet Yaqui Joe, a half-Native, half-white bank robber who has stolen $6,000 to buy 100 rifles for his Yaqui people who are being repressed by the government.Lyedecker is not concerned with Joe's cause of helping his tribe, and all he cares about is getting the money returned to a Phoenix bank within his jurisdiction. The two men escape to the hills where they are joined by Sarita (Welch), a beautiful Indian revolutionary. They eventually become allies and fight for the Indians.Taking over the leadership of the Yaquis, Lyedecker ambushes Verdugo's train while Sarita distracts the attention of the soldiers on board by taking a public shower. The train is later derailed in a town and the culmination had a fierce gun battle, which Joe and his people finally win.","language":"English","box_office":"$3.5 million (US/ Canada rentals)[2][3]","cinematography":"Cecilio Paniagua","production_company":"Marvin Schwartz Productions","directed_by":"Tom Gries","release_dates":"March 26, 1969 (1969-03-26)|||||","Production":"The film was the first of a four-picture deal producer Martin Schwartz had with 20th Century Fox.[5] It was based on a novel by Robert McLeod. The script was originally written by Clair Huffaker.[6] Tom Gries signed to direct following his successful feature debut with Will Penny. Gries wrote two further drafts of the script himself. \"He says he's not a carpenter,\" reported the Los Angeles Times. \"He says he can't work with a script that he doesn't believe in himself.\"[7] Huffaker later requested his name be taken off the credits and replaced with a pseudonym, \"Cecil Hanson,\" because \"the finished product... bears absolutely no resemblance to my original script.\"[8]The leads were given to Raquel Welch (Gries: \"in some situations, this woman is just a piece of candy but I think she will prove in this film that she can act as well\"),[7] Jim Brown (\"he's a great actor with a lot of appeal\", said Gries),[7] and Burt Reynolds.\"I'd like to bring a style to the screen that means something to the cats out on the street,\" said Brown. \"It's an image I want to portray of a strong black man in breaking down social taboos. In 100 Rifles... it's a different thing for a black man to be a lawman, get the woman and ride away into the sunset.\"[9]It was the fifth movie Burt Reynolds had made in a row. The first four — Shark!, Fade In, Impasse and Whiskey Renegades — had not been released when 100 Rifles was being shot.[10]\"I was playing Yaqui Joe, supposedly an Indian with a moustache,\" said Reynolds. \"Raquel had a Spanish accent that sounded like a cross between Carmen Miranda and Zasu Pitts. Jimmy Brown was afraid of only two things in the entire world: one was heights, the other was horses. And he was on a horse fighting me on a cliff. It just didn't work.\"[11]The film was shot in Almeria, Spain, in order to save money.[7] \"It's a tough, physical picture,\" says Gries, who was hospitalised for three days during the shoot when he came down with typhus.[7]\"I play a half breed but... I send it up,\" said Reynolds. \"I make it seem like the other 'half' of the guy is from Alabama. I play it nasty, dirty, funky. I look like a Christmas tree — wrist bands, arm bands. At the beginning I even wore these funky spurs. But every time I walked I couldn't hear dialog.\"[12]There were a number of press reports that Brown and Welch clashed during filming. Brown later said:The thing I wanted to avoid most was any suggestion that I was coming on to her. So I withdrew. If I'd tried to socialise, we'd have had problems. You know, Raquel is married too and out of respect for her husband I wanted to deal with Raquel through him... She was so suspicious and concerned that we were there to steal something away, or something. You can get very hung up on who's going to get the close ups and so on... [Burt Reynolds] was usually a stabilising influence [between the stars]... He's a heck of a cat. He had various talks with Raquel and tried to assure her that nothing was going on, that we weren't trying to steal anything.[13]Welch later confirmed the tension:It was an atmosphere. And it was really, in all seriousness, as ambiguous as hell. I don't know why it happened and I don't think Jimmy knows why it happened... My attitude on a film has always been, once it goes I'm interested only in my job. I'm not interested in asserting myself on a picture. Because it means too much to me.[13]\"I spent the entire time refereeing fights between Jim Brown and Raquel Welch,\" said Reynolds.[14] He elaborated:It started because they were kind of attracted to each other. After a while they both displayed a little temperament, but don't forget we were out in the middle of the bloody desert with the temperature at 110. Of course, I don't think they'll ever work together again. The critics have really been knocking those two — murdering them — but as far as I know no one ever said they were Lunt and Fontanne. Jim is the most honest man I know... And Raquel — one of the gutsiest broads I know, physically. She did all her own stunts. There's also a performance in there somewhere.[12]Raquel Welch later said she \"was the baloney in a cheesecake factory\" on that film. \"I wanted to keep up with all the action with the boys.\" She was sorry Tom Gries “wanted to get all the sex scenes (with Jim Brown) in the can in the first day. There was no time for icing — and it made it difficult for me.” She says Brown “was very forceful and I am feisty. I was a little uncomfortable with too much male aggression. But — it turned out to be great exploitation for the film, now as you look back. It broke new ground.\"[15]","produced_by":"Marvin Schwartz","starring":"Jim Brown|Raquel Welch|Burt Reynolds|","running_time":"110 minutes","music_by":"Jerry Goldsmith","edited_by":"Robert L. Simpson","written_by":"Clair Huffaker Tom Gries","budget":"$3,920,000[1]"}