{"dan_in_real_life":"Theatrical release poster","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures (U.S and Canada) Focus Features (International) Icon Film Distribution (UK/Australia)","Plot":"Dan Burns (Steve Carell) is a newspaper advice columnist, a widower, and single-parent to his three girls. The family takes a trip to the rambling, Rhode Island home of his parents (Dianne Wiest and John Mahoney) for an annual family gathering. Also in attendance are Dan's sister and brother with their families and Dan's younger brother Mitch (Dane Cook).The morning after their arrival, Dan meets Marie (Juliette Binoche) in a bookshop. They share a muffin and a heart-felt chat, although Marie gently warns Dan that she has a boyfriend. Dan returns to his parents' house and announces that he has 'met someone'. Brother Mitch introduces his new girlfriend Annie. Lo and behold, Dan's Marie is Mitch's Annie. Dan is disheartened and resists his father's relationship advice about finding someone of his own.Dan reluctantly agrees to a foursome dinner with their once unattractive childhood friend, \"pig-faced\" Ruthie (Emily Blunt). Marie jealously watches Dan and Ruthie. The next morning, Dan endures her 'punishment' for his late night with Ruthie by eating the burnt pancakes which she serves him. Marie and Dan meet to talk at a bowling alley. The meeting evolves into a date and finally a passionate kiss, but unfortunately Dan's entire family arrives to bowl. Mitch punches Dan in the face, and Marie hurries outThe plot resolves with Dan and his daughters going to New York City, where they finally find Marie at her gym. As he makes eye contact with her, Dan, in voice-over, tells the readers of his advice column that instead of merely planning ahead in life, they should \"plan to be surprised\".The film ends with Dan and Marie celebrating their wedding at his parents' Rhode Island home, and Mitch happily dancing with Ruthie.","language":"English","Critical reception":"The review aggregator website Rotten Tomatoes reported a 64% approval rating with an average rating of 6.2/10 based on 169 reviews. The site's consensus reads: \"The fine performances elevate Dan in Real Life beyond its sentimental plot.\"[4] Review aggregator Metacritic, which provides a score out of 100 based on a weighted average, gave the film a score of 65/100 from 34 reviews, indicating \"generally favorable reviews.\" [5]","box_office":"$68.4 million[2]","cinematography":"Lawrence Sher","production_company":"Touchstone Pictures NALA Films","directed_by":"Peter Hedges","Box office performance":"The film opened October 26, 2007 in the United States and Canada and grossed $11.8 million in 1,921 theaters its opening weekend, ranking #2 at the box office.[3] As of February 2, 2011, it has grossed $68,377,859.It was released on DVD and Blu-ray on March 11, 2008.","Soundtrack":"Norwegian singer-songwriter Sondre Lerche composed the majority of the music in the film, and has a cameo appearance in a scene at the end.Full soundtrack listing:\"Mr. Blue Sky\" by the Electric Light Orchestra is featured in the TV and radio advertisements for the movie, as well as \"Let My Love Open the Door\" by Pete Townshend and \"Henrietta\" by The Fratellis. The club mix of Inaya Day's \"Nasty Girl\" and Earth, Wind & Fire's \"September '99 (Phats & Small Remix)\" are also featured in separated scenes in the movie but are not on the soundtrack. \"Human Hands\" written by Elvis Costello (original version appears on his album Imperial Bedroom).","release_dates":"October 26, 2007 (2007-10-26)|||||","Production":"The opening scene was in New Jersey and then Rhode Island in the cities of Newport, East Greenwich, West Greenwich, Jamestown, Westerly, and Providence in November and December 2006. The opening scene was filmed at Seven Stars Bakery in Providence. However, the facade of the building and the interior are altered. The first time Dan is pulled over by the Jamestown, Rhode Island police, he is on Ocean Ave Newport, Rhode Island. The second time Dan is pulled over by Mackerel Cove in Jamestown. In scenes filmed in Jamestown, two bridges are clearly visible: the Jamestown Bridge and its replacement, the Jamestown-Verrazzano Bridge. Demolition of the Jamestown Bridge was initiated on April 18, 2006. The film also cast local residents of neighboring towns and cities consisting of Middletown, North Kingstown and North Providence as Dan's nieces and nephews. The date scene was filmed in two different places in Westerly. The inside shots were filmed at Alley Katz Bowling center, while the exterior shots were filmed at Misquamicut Beach. What is now the Windjammer was dressed to look like the outside of the bowling center. The sunset scene with the entire family on the beach was filmed at Napatree Point in Westerly.","produced_by":"Jonathan Shestack","starring":"Steve Carell Alison Pill Juliette Binoche Dianne Wiest John Mahoney Dane Cook","running_time":"98 minutes","music_by":"Sondre Lerche","edited_by":"Sarah Flack","written_by":"Pierce Gardner Peter Hedges","budget":"$25 million[1]"}