{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"James O'Hanlon","Plot":"Mankind has achieved space flight capability and built \"The Wheel\" space station in orbit 1,075 miles above Earth. It is commanded by its designer, Colonel Samuel T. Merritt (Walter Brooke). His son, Captain Barney (Eric Fleming), having been aboard for a year, wants to return to Earth.A giant spaceship has been built in a nearby orbit, and an Earth inspector arrives aboard the station with new orders: Merritt is being promoted to general and will command the new spaceship, now being sent to Mars instead of the Moon. As General Merritt considers his crew of three enlisted men and one officer, his close friend, Sgt. Mahoney (Mickey Shaughnessy) volunteers. The general turns him down for being 20 years too old. Hearing that Mars is the new destination, Barney Merritt volunteers to be the second officer.Right after the crew watch a TV broadcast from their family and friends, the mission blasts off for the Red Planet. The general's undiagnosed and growing space fatigue is beginning to seriously affect his judgement: Reading his Bible frequently, he has doubts about the righteousness of the mission. After launch, Sgt. Mahoney is discovered to be a stowaway, having hidden in a crew spacesuit. Their piloting radar antenna later fails, and two crew go outside to make repairs. They manage to get it working just as their monitors show a glowing planetoid, 20 times larger than their spaceship, coming at them from astern. The general fires the engines, barely managing to avoid a collision. But the planetoid's fast-orbiting debris punctures Sgt. Fodor (Ross Martin)'s spacesuit, killing him instantly. After a religious service in space, Fodor's body is cast adrift into the void.Eight months later, the general is becoming increasingly mentally unbalanced, focusing on Sgt. Fodor's loss as \"God's judgement\". On the Mars landing approach, he attempts to crash their spaceship, now convinced the mission violates the laws of God. Barney wrests control away from his father, landing the large flying wing glider-rocket safely. Later, as the crew takes their first steps on the Red Planet, they look up and see water pouring down from the now vertical return rocket. Barney quickly discovers the leak is sabotage caused by his father, who threatens his son with a .45 automatic. The two struggle and the pistol discharges, killing the general. Sgt. Mahoney, who observed only the last stages of the struggle, wants Barney confined under arrest with the threat of court-marshal, but cooler heads prevail; Barney becomes the ranking officer.Mars proves to be inhospitable, and they struggle to survive with their decreased water supply. Earth's correct orbital position for a return trip is one year away. While glumly celebrating their first Christmas on Mars, a sudden snowstorm blows in, allowing them to replenish their water supply. As their launch window arrives, they hear low rumbling sounds, then see rocks falling, and feel the ground shake violently. The ground level shifts during this violent Marsquake. Their spaceship is now leaning at a precarious angle and can not make an emergency blastoff. To right the spaceship, the crew uses the rocket engines' powerful thrust to shift the ground under the landing legs. The attempt works and they blastoff, the spaceship rising just as the Martian surface completely collapses.Once in space, Barney and Mahoney reconcile. Impressed with Barney's heroism and leadership while on Mars, Mahoney concludes that pursuing Barney's court-martial for his father's death would only impugn the general's reputation, tarnishing what previously had been a spotless military career. Better the fiction that \"the man who conquered space\" died in the line of duty, sacrificing himself to save his crew.","language":"English","Reception":"Judgments on the quality of the film's special effects have varied. Modern audiences are apt to notice the presence of matte lines. Reviewer Glenn Erickson said that \"the ambitious special effects were some of the first to garner jeers for their lack of realism.\"[3] Paul Brenner said \"Pal pulls out all stops in the special effects department, creating 'The Wheel', rocket launches into space, and a breathtaking near collision with an asteroid.\" The Encyclopedia of Science Fiction said \"The special effects are quite ambitious but clumsily executed, in particular the matte work.\"[4] Paul Corupe said that often \"the overall image on screen that inspires awe: the Martian landscape, the general's high-tech office and the vastness of the cosmos. The film's budget is certainly up on screen for your entertainment, but it's just spectacle for spectacle's sake.\" He too complains of matte lines but acknowledges that \"the composites are convincing enough for the time the film was made.\"[5]Upon the film's release, reviewer Oscar A. Godbout in his review for The New York Times praised the effects, but was disparaging of the storyline, noting \"... as plots go...it is not offensive.\"[6] The public was even less kind: Erickson called the film \"a flop that seriously hindered George Pal's career as a producer.\"[3] Corupe described it as the \"first big flop in Pal's career. It was a major setback that saw him abandon science fiction filmmaking for five years, including a planned sequel to When Worlds Collide.\"[5] The Encyclopedia of Science Fiction remarks \"A truly awful film, Conquest of Space is probably George Pal's worst production.\"[4] The film review aggregator website Rotten Tomatoes currently rates the film at only 27% (\"Rotten\").[7]","box_office":"$1 million (US)[1]","production_company":"Paramount Pictures Corp.","directed_by":"Byron Haskin","release_dates":"April 20, 1955 (1955-04-20)|||||","Production":"The science and technology portrayed in Conquest of Space were intended to be as realistic as possible in depicting the first voyage to Mars. The film's theatrical release poster tagline reads: \"See how it will happen in your lifetime!\"[2]Conquest of Space is based on The Conquest of Space, a 1949 non-fiction book written by Willy Ley and illustrated by Chesley Bonestell. Bonestell is noted for his photo-realistic paintings showing views from outer space; he worked on the space matte paintings used in the film.[2]The production also incorporated material from Wernher von Braun's 1952 book The Mars Project. Both books feature text that is straight popular science with no fictional characters or story line.[2]Had Producer George Pal followed either book as written, he would have produced a speculative futuristic documentary, much like of the trio of 1955 Tomorrowland-set (Walt Disney's) Disneyland television episodes: Man in Space, Man and the Moon, and Mars and Beyond. The final screenplay by James O'Hanlon, from an adaptation by Philip Yordan, Barré Lyndon and George Worthing Yates, instead creates a fictional story from whole cloth.[2]","produced_by":"George Pal","starring":"Walter Brooke Eric Fleming Mickey Shaughnessy","running_time":"81 minutes","music_by":"Nathan Van Cleave","edited_by":"Everett Douglas","conquest_of_space":"Theatrical release poster"}