{"carlos":"Cannes Film Festival poster","original_language(s)":"English, French, Arabic, German, Spanish, Japanese, Hungarian, Russian","Plot summary":"Ilich Ramírez Sánchez—who adopts the code name of \"Carlos\" early in the film—is a grim and elusive Venezuelan Marxist terrorist whose life is tracked as he executes dozens of assassination plots, abductions, and bombings across Europe and the Middle East in the cause of Palestinian liberation. For two decades, he is one of the world's most wanted terrorists. The film begins in Paris in 1973, where the young Ramírez Sánchez is endeavoring to prove himself as a Popular Front for the Liberation of Palestine (PFLP) fighter, and ends with his capture in Sudan, in 1994. In between, Carlos and his fellow terrorists wreak havoc on the Left Bank in Paris, storm OPEC's headquarters in Vienna, and carry out other devastating acts of politically motivated violence.Ramírez Sánchez, who has fought alongside the Palestinians in Jordan, carries out a series of attacks in London in 1973. He moves to Paris where the PFLP puts him in charge of its European branch under the command of a Lebanese militant, Michel Moukharbal, alias \"André\". He coordinates several operations, in particular the hostage taking in the French Embassy in The Hague by militants of the Japanese Red Army. When André is arrested, French agents of the domestic intelligence service, the DST, want to know more about Ilich, who has by now adopted the nom de guerre \"Carlos.\" To escape arrest, Carlos shoots three policemen. He then joins the head of the PFLP, Wadie Haddad, in southern Yemen. Haddad entrusts him with a daring mission – taking hostage the oil ministers of the OPEC countries at their forthcoming conference in Vienna.Most of the second episode is devoted to a detailed account of the operation that remains one of the most spectacular terrorist acts of the period. It is December 21, 1975. Leading a group of six militants – leftists from German Revolutionary Cells and Palestinian militants including Anis Naccache – Carlos seizes control of the OPEC headquarters, taking ministers and accompanying delegates hostage. He is at the height of his notoriety in the media. However, he and his group are unable to find asylum in the countries of Algeria, Tunisia and Libya and are unable to fly to Iraq because the plane they requested, a DC-9, does not possess the range to fly the thousands of miles necessary. By finally releasing the ministers at Algiers airport in exchange for a large ransom, he fails in the mission that Haddad had given him. This marks the end of relations between the two men. From now on, Carlos becomes a mercenary for hire to whichever country offers the most, including first Iraq, then Syria. He switches operations to behind the Iron Curtain, moving between Budapest and East Berlin under the protection of the East German Stasi. He works with the remnants of the Revolutionary Cells, in particular Johannes Weinrich and his wife Magdalena Kopp, who soon leaves Weinrich for Carlos.Carlos’ band, based in Budapest and protected by Syria, fosters links with various clients interested in their particular capabilities, among them Nicolae Ceauşescu’s Romania and Libya. This intense activity of geopolitical destabilization, orchestrated by Carlos who is trafficking arms, handling huge sums of cash and leading the life of the \"Godfather of European terrorism\", is soon to come to an end. His decline is closely linked to the changes in the world order. With the fall of the Berlin Wall in November 1989, he loses several of his backers, is told to leave Syria, and his arena of operation is drastically reduced. The last place offering refuge is Sudan: Carlos is by now retired and tracked by the secret services of several countries, abandoned by his closest allies, a long way from the center stage of international politics. His role as a player is over; he is left to observe the shifts in global power from a distance. With the complicity of the Sudanese authorities, and due to immobility from a testicular condition, he is captured on August 14, 1994 and brought back to Paris to stand trial for crimes that have not been forgotten in France.","production_company(s)":"Film En Stock Egoli Tossell Film","Background":"Initially, Carlos was to focus on the terrorist's capture in Sudan in 1994 and run only 90 minutes. However, once director Olivier Assayas agreed to make the film and he conducted extensive research, he realized that there was much more to explore with the man and his times: \"I felt it was the fate of one man and, in a certain way, the story of one generation, plus a meditation on time, history, fate and issues more universal than the specific history of Carlos\".[8] Former foreign correspondent and Le Monde editor Stephen Smith compiled the film's research, some of which came from the files of intelligence agencies[8] that became available after the fall of the Berlin Wall when files from former Soviet Bloc countries surfaced. Some of the film's dialogue came from tape recordings made by the Stasi, the secret police of the former East Germany.[9] Made with a budget of $18 million, Carlos was Assayas' first foray into television.[10] Originally, he was not interested in the project because it seemed \"too crazy and too complicated\".[11] He was drawn to the project because it allowed him to make a film dealing with recent history and real people. He said, \"not long ago, the idea of making a film about Carlos would have scared French producers, but nowadays I sense that we're being encouraged to make films that have a contemporary dimension\".[10] Actor Edgar Ramirez said, \"What we're trying to do is demystify him. This guy who supposedly had everything figured out was not as keen as he was said to be. The public and historical image was as history's big manipulator but in many moments of his life, he was being manipulated\".[11]","country_of_origin":"France, Germany","Reception":"Ilich Ramirez Sanchez, the real-life 'Carlos', saw extracts of Assayas' film and his lawyer threatened legal action to prevent its general release, arguing that it could prejudice future trial hearings for Carlos who faces trial for at least four more attacks in France.[16] He read the screenplay and criticized it for its \"deliberate falsifications of history, and lies\".[16] He was specifically unhappy with a sequence depicting a hostage-taking by his gang at the 1975 OPEC conference in Vienna and how his methods were depicted: \"Showing hysterical men waving submachine guns and threatening people is completely ridiculous,\" he insisted. \"Things didn't happen like that. These were professionals, commandos of a very high standard\".[16] His lawyer tried to block the film's release, arguing that Carlos had a right to see it beforehand, but the judge dismissed the complaint on the grounds that it violated Assayas' freedom of expression. His lawyer plans to bring two more lawsuits, one that argues the film breaches pre-trial judicial secrecy laws and a second that demands Carlos be paid royalties for his life's role in providing material for the scriptwriters.[16]Carlos has received widespread critical acclaim. Review aggregation website Rotten Tomatoes gives the film a score of 93% based on reviews from 59 critics, with an average score of 8.1/10.[17] Metacritic gave the film a weighted score of 94/100, based on 30 critics, which it ranks as \"universal acclaim\".[18] indieWIRE's Todd McCarthy found the film to be \"a dynamic, convincing and revelatory account of a notorious revolutionary terrorist's career that rivets the attention during every one of its 321 minutes\" and praised Assayas' \"ever-propulsive style that creates an extraordinary you-are-there sense of verisimilitude, while Edgar Ramirez inhabits the title role with arrogant charisma of Brando in his prime. It's an astonishing film\".[19] In his review for the Los Angeles Times, Steven Zeitchik wrote, \"How good is Olivier Assayas' Carlos? Think of The Bourne Identity with more substance, or Munich with more of a pulse, and you begin to have a sense of what the French filmmaker accomplished with this globetrotting and epic look at one man's rise to the station of international guerrilla leader and terrorist celebrity\".[5] In his review for USA Today, Anthony Breznican wrote, \"The closest cousin to Carlos, cinematically speaking, might be There Will Be Blood – another epic view inside a mind of twisted humanity\".[20] In his review for Time Out London, Geoff Andrew wrote, \"Certainly, the film doesn't feel anything like television. It's shot in Scope, boasts the fleet way with narrative, camera movement and cutting that are characteristic of Assayas at his best and has a sense of scale, depth and seriousness of purpose that is essentially cinematic\", but felt that \"the third and final part runs out of steam a little\".[21] Sight and Sound magazine's Nick James called the film, \"a breathtaking political epic\", and felt that there were, \"brilliant scenes aplenty\".[22] In his review for the Village Voice, J. Hoberman wrote, \"Carlos is gripping stuff, despite its incongruously fashionable rock soundtrack and a grossly over-played final section. The extended account of the OPEC caper includes the festival's best hour of filmmaking this side of Godard's Film Socialisme and would make a terrific movie in its own right\".[23]However, Entertainment Weekly magazine's Owen Gleiberman wrote, \"But as electrifying as some of it is, I wish that Assayas had made Carlos at once shorter and richer. I wish it were more than an episodic series of galvanizingly staged plots and executions and mishaps\".[24] In his review for the Boston Globe, Wesley Morris felt that the film was, \"hardly dumb. But it peaks early and never returns to the sharper ideas and sharper filmmaking of the second of its three sections\".[25] Time magazine's Richard Corliss wrote, \"And Carlos, while matching the Coppola and Lean films in length and breadth, misses out on depth ... No masterpiece, Assayas' movie is a fast-paced, knowing trip through two decades of violence on two continents\".[26] In her review for The New York Times, Manohla Dargis wrote, \"Played by Mr. Ramirez with jolts of charisma and, smartly, little of the usual movie-star charm – if not much depth or nuance – Carlos is a difficult character on which to hang such an ambitious, inherently cumbersome tale\".[27]In his review for New York Magazine, David Edelstein wrote, \" In retrospect, it's a bit of a blur, and you might opt to see Assayas' condensed version (alternating in some theaters), which clocks in at a trim two and a half hours. I say go for the whole shebang. Shot by shot, scene by scene, it's a fluid and enthralling piece of work. I wasn’t bored for a millisecond\".[28] In her review for the Los Angeles Times, Betsy Sharkey wrote, \"In the end the collaboration between Ramirez and Assayas creates a fiercely astute portrait of a terrorist that neither romanticizes nor demonizes him, but rather dismantles the myth to take some measure of the man underneath. It also brings a searing insight into the early days of the guerrilla-warfare-writ-large style of attack that would evolve into the sort of terrorism we fear most today\".[29] However, in his review for the Washington Post, Hank Stuever wrote, \"The result is a beautiful film that requires a hardy and determined viewer. I assume that anyone who will recognize and follow each and every event and the historical players portrayed in Carlos must have worked in foreign diplomacy back when the rest of us were busy watching the Fonz\".[30] In her review for the The Sixties, Christina Gerhardt wrote, \"Carlos makes two contributions to films about 1970s terrorism that stand out. First, the film shows terrorism's international relays ... Second, [it shows] Carlos as charismatic and enticing, as well as utterly selfish and abusive\".[31]Carlos earned high placements in all of the major critics' polls in 2010. It was voted Best Film of the Year in Film Comment's annual critics' poll,[32] while both the film and Assayas placed second for best picture and best director in separate polls conducted by IndieWire and the Village Voice. Ramirez also won for best lead performance in the same IndieWire poll[33] while placing second in the Village Voice for best lead actor.[34]Carlos was later nominated for two Golden Globe Awards, one for Best Miniseries or TV Movie and Ramirez for Best Actor in a Miniseries. It won the 2011 Golden Globe Award for Best Miniseries or Television Film. However, because it was released on French television before theatrical distribution, it was ineligible for the Academy Awards.[35]At the French César Awards 2011, Édgar Ramírez was awarded, for the film version of the TV series, the César Award for Most Promising Actor.[36]Edgar Ramirez was also nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or Movie, for his portrait of Carlos.","distributor":"MK2 (France) IFC Films (US)","cinematography":"Yorick Le Saux Denis Lenoir","directed_by":"Olivier Assayas","original_release":"19 May 2010 (2010-05-19) (Canal+ & Cannes Film Festival)|||||","Soundtrack":"Initially, Assayas planned to use several songs by The Feelies on the soundtrack but shortly before post-production was completed he was informed that members of the band did not want their music associated with terrorism. The director remembers, \"We ended up managing to keep one song for a scene that did not involve any kind of terroristic activity. But I had to completely reinvent the whole score\".[37] He ended up using several songs by Wire. The soundtrack includes:","editor(s)":"Luc Barnier Marion Monnier","Production":"Initially, Assayas was worried about finding the right actor to play Carlos because they needed one who had \"the shoulders and the charisma to carry this kind of movie on his back\".[8] He cast Ramirez who, like the real Carlos, is a Venezuelan and his family came from the same small Western Andean state. The actor described Carlos as, \"a bit of a monster, a bit of a dreamer, a bit of an idealist, a bit of an assassin, a mixture of everything, full of contradictions, and that's what made him interesting to me\".[8] The production was shot in seven months across three continents in countries such as Austria, France, Germany, Hungary, Lebanon, and Morocco.[12] The film was shot mostly in English with passages in French, Spanish, Hungarian, Italian, Arabic, German, Russian, Dutch and Japanese.[13] As filming continued, Ramirez put on 35 pounds in order to resemble Carlos's overweight physical condition at the time of his capture. The final two hours of the film were shot in sequence.[14]","starring":"Édgar Ramírez Alexander Scheer Nora von Waldstätten Ahmad Kaabour Christoph Bach Susanne Wuest Anna Thalbach Julia Hummer","running_time":"338–319 min (full version)[1] 187–166 min (short versions)","producer(s)":"Daniel Leconte Jens Meuer","US release":"Already in November 2009, IFC Films acquired the US rights to both the mini-series and the theatrical version.[15] The mini-series premiered on the Sundance Channel on October 11, 2010, where it was shown over three nights, while both long and short versions received a theatrical release.","written_by":"Olivier Assayas Dan Franck Daniel Leconte","budget":"$18,000,000"}