{"country":"Italy","distributed_by":"Euro International Film (Italy) Paramount Pictures (US)","screenplay_by":"Giuseppe Colizzi","Plot":"Cat and Hutch arrive in El Paso where they unsuccessfully try to get bounty for Bill San Antonio from his last earthly remains – the boots. Instead they go to the bank manager Harold – which Bill in the first film disclosed as his partner in setting up the robberies – and announce themselves as Bill to see if they are received. They are, and convince him (not without some physical force) to make them a cashier’s check to be paid out in gold.The banker visits the condemned man Cacopoulos, who is to be hanged the next day, and offers to help him escape if he restores the money. At night the deputy is knifed by two men, who let Cacopoulos out. He takes the dead man’s gun and shoots the two. He pours himself a footbath and tests the dead men’s boots to find a pair that fits. He then pays a visit to the bank manager. Cacopoulos reminds the manager that he and two others put him in jail for 15 years, and on his release framed him for murder with a stolen knife, that again was used to kill the deputy tonight. Consequently, he wants guarantees that he will not be tricked again. Harold throws the knife but Cacopoulos swings the chair so it strikes in the back, then swings back around and shoots the manager, adding that it is guaranty enough!Dressed as a peon on a donkey Cacopoulos meets Cat and Hutch and robs them. They follow his trail south to Mexico and encounter people that he has given money – and a high wire performer Thomas, and assistant, that he offered money. They catch up with him in a village during a fiesta (that he has paid for). While Cat is lured away looking for him elsewhere, Caco, playing a joke on Hutch, appears before him and, in a quieter place, tells him about Harold and the other two ”friends” who shot his horse so he got caught after a bank robbery, and then framed him for murder. He says that he will give back their money, including what he has spent, if Hutch helps him collect his debts with the remaining two. The first one is Paco who is a ”revolutionary” shown presiding over a kangaroo court condemning men to death for ”not fighting for country and freedom.” His men capture Cacopoulos and Hutch, but Cat enlists help from another ”revolutionary,” Canganceiro, by telling him about Cacopoulos´ ”treasure.” Together they defeat Paco’s men and the latter is killed by Cacopoulos, who in his wrath forgets to make him give back any money. After some pillaging by his men, Canganceiro starts another kangaroo court that executes people for ”fighting for country and freedom.” Cacopoulous is jailed until he tells where his treasure is. Caco attempts to escape by lulling the guards to sleep by telling the story of his heritage; his grandfather was a Greek who married a young Cherokee woman, and his father was one of their children. He told of how his father raised his family in a small mining town until he was mysteriously murdered, and how his grandfather, carrying little Caco, had to take his own son's body back to his own tribe. Hutch and Cat then help Cacopoulos escape, but he shoots off their saddles, quoting his grandfather that one partner is too little, and two are too many. They ambush the last two men of the pursuing Canganceiro bunch and take their horses.They now follow Cacopoulos in the opposite direction, encountering dead Canganceiro men along the way, the last ones with their leader just outside Memphis. In Memphis they find Caco washing dishes in a saloon, together with the acrobat and assistant – because in this town people are only interested in gambling. That is substantiated by the fact that Cacopoulos has lost all his money while he was looking for Drake the third ”partner.”Cat and Hutch visit Drake’s casino. Hutch loses all his money, while Cat spots the croupier looking at a hole in the ceiling. They put up Hutch to win money in a prizefight, buy weapons and give the rest to Cacopoulos with instruction for him to show up with it in the casino tomorrow.That night, with some acrobatic prowess Thomas and Cat gain entrance to a room in the attic of the casino. There is the peek-hole down to the roulette table and a voice tube down to a basement room where a magnet can guide the roulette ball. Cat, Thomas and Hutch take positions in the two rooms. Cacopoulos however, seeks the company of a saloon girl and awakes in the morning robbed of his cash. He hastily replenishes it by forcibly inviting a bill collector to a ”game” of cards that Cacopoulos ”wins.” So Cacopoulos finally enters the casino, where he repeatedly puts the money on 13 until he breaks the bank with a $360,000 win. Drake and his men arrive and confront Cacopoulos leading to a showdown. The apposing parties wait for the roulette ball to stop, while the customers lie down on the floor and a Viennese Waltz is played (on suggestion from Cacopoulos). Drake’s men are shot and he is wounded, and taken by the vengeful customers, who realize they have been swindled. Cacopoulos faints from the shoot-out, but only his arm was wounded, and he leaves together with Cat and Hutch.","language":"Italian","Reception":"In his investigation of narrative structures in Spaghetti Western films, Fridlund writes that all the Colizzi westerns present clever variations on several different kinds of partnerships encountered in other films inspired by For a Few Dollars More. Also, the pervading protagonists Cat and Hutch are differentiated by a set of physical and personal characteristics that reappear in the even more commercially successful They Call Me Trinity and Trinity Is Still My Name.[3]","ace_high_(i_quattro_dell'ave_maria)":"US film poster","cinematography":"Marcello Masciocchi","production_company":"Cronocinematografica Finanzia San Marco","directed_by":"Giuseppe Colizzi","release_dates":"October 31, 1968 (1968-10-31)","produced_by":"Bino Cicogna Giuseppe Colizzi","starring":"Eli Wallach Terence Hill Brock Peters Kevin McCarthy Bud Spencer Livio Lorenzon Steffen Zacharias","running_time":"137 minutes","music_by":"Carlo Rustichelli","edited_by":"Marcello Malvestito"}