{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Judith Singer is a former Newsday reporter who misses her old life, now that her husband Bob spends most of his time at work and her time at home on Long Island has become a bore.When her dentist, Dr. Bruce Fleckstein, is found murdered, Judith sees the possibility of a story that she might be able to sell to the newspaper's editor, maybe even get her old job back. Judith might have been the last person to see Fleckstein alive, which makes detective David Suarez consider her both a possible witness and a suspect.Fleckstein was a lecher and a louse. Decked out in gold jewelry, he cheated on his wife Phyllis and preyed on his female patients. Not only did Fleckstein have affairs in a motel with several of his patients, but he also took compromising Polaroids of many women while they were asleep in his dentist chair.The murderer could have been sculptor Nancy Miller, or perhaps Judith's next-door neighbor Peg Tuccio, or any number of possibilities. Suarez is determined to solve the case before amateur detective Judith beats him to it.","language":"English","Reaction":"The film is reviewed, favorably, in Pauline Kael's ninth collection of movie reviews Hooked. She is especially complimentary about Susan Sarandon's performance. \"The screenplay provides a batch of actresses with a chance to show some comic verve. Susan Sarandon's smile has never been more incredibly lush, and she does some inspired double takes - just letting her beautiful dark eyes pop.\" \"It's fun to have a movie about a woman whose curiosity is her salvation.\"","box_office":"$12,531,831","cinematography":"Barry Sonnenfeld","directed_by":"Frank Perry","release_dates":"August 30, 1985 (1985-08-30)|||||","produced_by":"Salah M. Hassanein, Frank Perry","starring":"Susan Sarandon|Raúl Juliá|Edward Herrmann|Judith Ivey|Mary Beth Hurt|Anne De Salvo|Josh Mostel|Deborah Rush|Joe Mantegna|","running_time":"99 minutes","music_by":"Brad Fiedel","edited_by":"Peter Frank","written_by":"Susan Isaacs (also novel)","budget":"$9 million"}