{"country":"France","distributed_by":"Parafrance Films","Plot":"Rémi (Patrick Dewaere) is a struggling pianist with a wife named Martine (Nicole Garcia), a model who is getting too old to find desirable work, and a 14-year-old stepdaughter Marion (Ariel Besse). When Martine is killed in a car crash, Marion expresses her desire to stay with Rémi in their apartment, but is taken away by her father Charly (Maurice Ronet), an alcoholic who dislikes Rémi. Marion comes back, much to her father's disapproval, and takes up babysitting to help make ends meet while Rémi gives piano lessons. Soon, Marion tells Rémi she is physically attracted to him, but he resists her advances because of her young age.When Marion proves to be ailing, she is sent to the mountains while Rémi loses his apartment and moves in with friends. A broken man, he meets with Marion and they have sex in a hotel. She comes back to live with him in a new home, and although he first resists any more sex, gradually gives in. While visiting, Marion's father at one point sees the two embrace. He asks them if they are having an affair, but when Rémi objects, Charly apologizes and leaves. Eventually Rémi takes interest in an older woman, Charlotte (Nathalie Baye), who is also a more skilled piano player, while Marion also seeks out a substitute for him and moves back in with her father.","language":"French","Reception":"The film had a total of 1,197,816 admissions in France. [6] The subject matter of an adult having sex with a minor caused the film to be shunned by film distributors in the US for over a year.[5] In Canada, the film was banned in the province of Ontario but approved for Quebec and British Columbia, and was a particularly controversial case concerning censorship and community standards.[7]The film has received positive reviews, with Rotten Tomatoes counting four favourable reviews out of five.[8] The Chicago Reader observes similarities to Lolita and says Beau Pere \"has enough of Blier's customary taboo-busting vigor to provide a reasonably unsettling good time.\"[4] In his 2002 Movie & Video Guide, Leonard Maltin gives the film three and a half stars and calls it thoughtful and sensitive.[1] Janet Maslin of The New York Times wrote in 1981 that despite the objectionable subject matter, \"Mr. Blier tells this story very gently, with as much attention to the humor of the situation as to its eroticism.\"[3] James Berardinelli of ReelViews credits the film with a \"provocative script featuring well-defined characters and a pair of powerful performances.\"[5] People calls the film convincing and touching, and in spite of the topic, not pornographic.[9] Conversely, New York called the film \"heavy-handed and sluggish.\"[10]Beau Pere tied with Taxi zum Klo in winning the 1981 Boston Society of Film Critics Award for best foreign language film.[11]","cinematography":"Sacha Vierny","directed_by":"Bertrand Blier","release_dates":"16 September 1981","Production":"Writer and director Bertrand Blier declared Beau Pere, was intended as \"an ode to the fair sex and to womanhood in its purest form.\"[3] It stars Patrick Dewaere, and is one of his last films,[4] as well as Ariel Besse in her first film role.[5] Besse played the character as an \"extremely changeable creature, childish one minute and precocious the next.\"[3]","produced_by":"Alain Sarde","starring":"Patrick Dewaere Ariel Besse Maurice Ronet Nathalie Baye Geneviève Mnich","running_time":"123 minutes","music_by":"Philippe Sarde","edited_by":"Claudine Merlin","written_by":"Bertrand Blier"}