{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Nick Conklin is a New York City police officer facing possible criminal charges; Internal Affairs believes Nick was involved with his partner who was caught taking criminal money in a corruption scandal. Nick is divorced from his wife, who has custody of their two children. Nick also has financial difficulties.At a restaurant, Nick and his partner Charlie Vincent observe two Japanese men meet with Mafia gangsters. Nick's suspicions are validated when another Japanese man enters the restaurant, seizes a small package at gunpoint, kills two people, and leaves. Nick and Charlie chase and arrest the suspect after he nearly kills Nick. The suspect, a Yakuza gangster named Sato, is to be extradited to Osaka and given to the police there. Though angered Sato will not be prosecuted in the US, Nick agrees to escort him. Nick’s captain believes it will keep Nick from causing more trouble and exacerbating the already biased Internal Affairs investigation.When they arrive in Osaka, they surrender Sato to the Japanese police, only to be told that they were duped by impostors. Nick convinces the Osaka police to allow them to observe the investigation, though their weapons are confiscated. They are assigned to Masahiro Matsumoto. Nick behaves rudely and offends Matsumoto, while Charlie attempts to be more polite. Nick also makes contact with an American nightclub hostess, Joyce, who explains that Nick and Charlie represent American inefficiency and stupidity to the Japanese. Through her, Nick discovers Sato is fighting a gang war with a notorious crime boss, Sugai, and traveled to New York to disrupt Sugai's counterfeiting scheme.Nick joins a police raid without permission and takes a few $100 bills from the crime scene. The next day, Matsumoto explains they have dishonored themselves, him, and the police force by his theft, which has been reported in America; Nick calls him a snitch and demonstrates the money is counterfeit by burning one of the bills. At night, Nick and Charlie walk back to their hotel drunk and unescorted, despite warnings about their safety. In an apparent prank, a young motorcyclist steals Charlie's coat and leads him to an underground parking garage. Separated from Charlie, Nick watches in horror as Sato and several others briefly torture and kill him. Joyce comforts the distraught Nick at her apartment. Later, Mastumoto hands him Charlie's service pistol.As Matsumoto and Nick trail one of Sato's operatives, Nick admits he stole money in New York. The operative retrieves a sample counterfeit note, which she passes to a gangster. Nick and Matsumoto tail him to a steel foundry, where they find Sato is meeting Sugai, and the package from New York is a printing plate for American $100 bills. Nick confronts Sato, who escapes when swarming police arrest Nick for waving a gun in public. Though deported, Nick sneaks off the plane to pursue Sato on his own, as Matsumoto has been suspended and demoted. Joyce helps him meet Sugai, who explains that making counterfeit US currency is his revenge for the \"black rain\", or nuclear fallout, after the bombing of Hiroshima in World War II. Nick suggests a deal where Sugai can use Nick to retrieve the stolen plate from Sato, leaving Sugai's reputation and hands clean.Sugai drops Nick at a remote farm with a shotgun. Matsumoto arrives, and they deduce Sato plans a massacre. During a meeting with Sugai, Sato cuts off one of his fingers in atonement, stabs Sugai, and escapes with the plates, prompting a gunfight between Sugai's and Sato's men. Sato escapes the fight on a dirt bike, Nick pursues, and the two fight briefly. Nick gains the advantage and, having Sato at his mercy, has the choice of whether or not to kill Sato for Charlie and all the humiliation he has suffered. Matsumoto and Nick walk a handcuffed Sato into police headquarters to the amazement of everyone and later receive commendations, which Nick accepts gratefully. Before boarding his flight home, Nick thanks Matsumoto for his assistance and friendship, and gives him a dress shirt in a gift box. Underneath it, Matsumoto finds the counterfeit printing plates.","black_rain":"Theatrical release poster","language":"English Japanese","Reception":"The film was met with a mixed critical reception.[11][12] It currently holds a 52% rating on Rotten Tomatoes based on 21 reviews.[13] Black Rain was nominated for the Academy Awards for Best Sound (Donald O. Mitchell, Kevin O'Connell, Greg P. Russell and Keith A. Wester) and Best Sound Effects Editing. (Milton Burrow and William Manger) [14]","box_office":"$134.2 million","cinematography":"Jan de Bont","directed_by":"Ridley Scott","release_dates":"September 22, 1989 (1989-09-22)|||||","Production":"Chinese iconic actor Jackie Chan was first approached to choreograph action scenes and play a small part as a villain but decided the role did not match his values or image.[4] Japanese musician Ryuichi Sakamoto contributed the song \"Laserman\" to the film's soundtrack.[5]The film began shooting in November 1988 and ended in March 1989. Japanese actor Yusaku Matsuda, who played Sato, died of bladder cancer shortly after the film's completion.[6] Director Ridley Scott dedicated the film to his memory.The high cost and red tape involved in filming in Japan prompted director Scott to declare that he would never film in that country again.[7] Scott was eventually forced to leave the country and complete the final climactic scene (which included American character actor Al Leong) in Napa Valley, California.This film marks the first collaboration between Hans Zimmer and Ridley Scott. He would go on to score several more films for Scott, including Gladiator, Thelma and Louise, Hannibal, Black Hawk Down and Matchstick Men.Large parts of Black Rain were filmed in Osaka, although some of the locations have changed somewhat since the late 1980s when production took place. The original intention of Ridley Scott was to film in the Kabukicho nightlife district of Shinjuku, Tokyo. However, the Osaka authorities were more receptive towards film permits so the similarly futuristic neon-infused Dotonbori in Namba was chosen as the principal filming location in Japan.An aerial shot of Osaka bay at sunset with the estuaries of the Yodogawa, Kanzakigawa and Ajigawa rivers frames the opening sequence of the arrival into Japan.The main filming location in Osaka is by the Ebisubashi bridge. The futurist Kirin Plaza building (architect Shin Takamatsu, built 1987), the Ebisubashi and the famous neon wall overlooking the Dotonbori canal creates the Bladerunner-esque mise-en-scène.Umeda, Osaka's northern centre, is represented by the first floor shopping mall concourse of Hankyu Umeda station Terminal Building. Resembling a futuristic neo-gothic nave from a cathedral, this is where Charlie Vincent's (Andy Garcia) jacket is stolen by a bosozoku biker. Because the production could not finish the segment in Japan, Andy's demise, the subsequent escalator chase and car park scenes, replete with appropriate Japanese signs, were shot in downtown Los Angeles.The now removed Shinsaibashi bridge (dismantled in 1995), Osaka Municipal Central Wholesale Market, Nippon Steel Works in Sakai City (south Osaka), Kyobashi, the elevated Hanshin Expressway, Osaka Castle and Nanko Port Town also feature briefly.In New York City, the 1964 World Expo's Unisphere opens the film, followed by Nick Conklin (Michael Douglas) riding over the Queensborough Bridge. The illegal bike race between Nick and an anonymous challenger took place from underneath the west underside of the Brooklyn Bridge north to the Manhattan Bridge.","produced_by":"Stanley R. Jaffe|Sherry Lansing|","starring":"Michael Douglas|Andy García|Ken Takakura|Kate Capshaw|","running_time":"125 minutes","music_by":"Hans Zimmer","edited_by":"Tom Rolf","Release":"In its opening weekend, Black Rain grossed $9.6 million in 1,610 theaters in the United States and Canada, ranking #1 at the box office.[8] It stayed at the #1 spot for two more weeks.[9] The film grossed a total of $46.2 million in the United States and Canada and $88 million in other territories, for a worldwide gross of $134.2 million.[10]","written_by":"Craig Bolotin|Warren Lewis|","budget":"$30 million[1]"}