{"country":"Australia Italy","distributed_by":"Roadshow Entertainment","Plot":"Bubby is a 35-year-old man who has never set foot outside his mother's dingy apartment in the back of a printing press in an industrial area of Adelaide. In addition to beating and sexually abusing him, she confines him to the apartment, telling him that the air outside is poisonous and telling him he will die if he tries to leave. Bubby eventually escapes, joins up with a rock band, and embarks on a journey of self-discovery and shocking mayhem.","Production background":"Shortly after he had graduated from film school, Rolf de Heer and Ritchie Singer collaborated on the idea of what would eventually become Bad Boy Bubby. For most of the 1980s, de Heer collected ideas and wrote them on index cards. In 1987, he took a hiatus from making Bubby index cards, but in 1989 he resumed work. Sometime between 1989 and 1990, he saw the short film Confessor Caressor starring Nicholas Hope and tracked him down. In 1991, he began work on the actual script.After he heard a rumour about the reintroduction of the death penalty to Australia, de Heer was angered and rewrote the ending so that Bubby would be executed at the end of the film. This ending was scrapped when the rumour proved to be false.","language":"English German","box_office":"A$808,789[2]","cinematography":"Ian Jones","production_company":"South Australian Film Corporation","directed_by":"Rolf de Heer","bad_boy_bubby":"Blue Underground DVD cover","release_dates":"28 July 1994 (1994-07-28) (Australia)|||||","produced_by":"Rolf de Heer Giorgio Draskovic Domenico Procacci","starring":"Nicholas Hope Claire Benito Ralph Cotterill Carmel Johnson","running_time":"114 minutes[1]","music_by":"Graham Tardif","edited_by":"Suresh Ayyar","Release":"On 23 April 2007, Eureka Entertainment released Bad Boy Bubby on DVD for the UK market with all scenes intact. On the Blue Underground DVD, director Rolf de Heer claims that Bubby was the second highest grossing film in Norway in 1995, second only to Batman Forever. In the UK, it was cut for cruelty to a cat.[4] The film was released on DVD in April 2005 by the Blue Underground company, and a special Two Disc Collectors' Edition was also released in June 2005 by Umbrella Entertainment.Bad Boy Bubby grossed $808,789 at the box office in Australia.[2]","written_by":"Rolf de Heer","budget":"USD$750,000","Audio and visual innovation":"Director de Heer describes the film as one large experiment, especially in the method used to record the dialogue: binaural microphones were sewn into the wig worn by leading actor Nicholas Hope, one above each ear. This method gave the sound track a unique sound that closely resembled what the character would actually be hearing. The film also used 31 individual directors of photography to shoot different scenes. Once Bubby leaves the apartment a different director of photography is used for every location until the last third of the film, allowing an individual visual slant on everything Bubby sees for the first time. No director of photography was allowed to refer to the work of the others.[3]"}