{"Cast":"The film features four of the then Degrassi cast members as Charlie's fellow students: Jake Epstein (Craig Manning), Lauren Collins (Paige Michalchuk), Aubrey Graham (Jimmy Brooks), and Ishan Davé (Linus).","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"The son of a depressed but doting mother (Hope Davis) and a father who is serving time for tax evasion, wealthy teenager Charlie Bartlett (Anton Yelchin), - after being expelled from several private academies for various infractions - enrolls in a public school run by embittered alcoholic Principal Nathan Gardner (Robert Downey, Jr.), who was formerly a history teacher. Unable to fit in with most of his fellow students, Charlie forms an alliance with school bully Murphy Bivens (Tyler Hilton) and offers him half the proceeds from the sale of a variety of prescription drugs Charlie obtains by feigning physical and emotional symptoms during sessions with different psychiatrists.Before long, his natural charm and likability positions him as the school's resident therapist, who offers advice within the confines of the boys bathroom. Charlie's social life noticeably improves as he gains the confidence and admiration of the student body and begins to date the principal's rebellious daughter, Susan (Kat Dennings).Complications arise when seriously depressed Kip Crombwell (Mark Rendall) attempts suicide by swallowing a handful of anti-depressants provided by Charlie. Charlie befriends Kip after having an in-depth conversation with Principal Gardner. Charlie discovers Kip is writing a play about adolescent issues and pitches it to Gardner who is, at first, unsure but agrees when Kip says that it would make him less inclined to attempt suicide again. The students then have trouble with the student lounge; security cameras get installed, and they start a riot.One day, Charlie comes by Susan's house to pick her up for a date and he gives her a pharmacy bag. Mr. Gardner comes out, thinking the bag is full of \"inappropriate items\", and pushes Charlie, who then punches Gardner as a reflex. He tries to apologize, but the principal is not forgiving. Susan and Charlie drive off, and the bag turns out to contain nicotine gum, to help Susan quit smoking cigarettes.That night, the students are all in the student lounge when the cops arrive. They arrest Charlie for assault, Principal Gardner is fired, and the kids trash the lounge building. Charlie is released, and before the play, stops by Mr. Gardner's house to invite him. Charlie finds Mr. Gardner heavily intoxicated and waving a revolver. They get into a heated argument which culminates in Charlie falling into the pool after attempting to tackle Mr. Gardner, thinking he is about to commit suicide. Mr. Gardner, appearing sober, comes to his senses and dives into the pool to save Charlie and states that he was not attempting to commit suicide because he has too many responsibilities to do such a thing. They talk over their problems about Charlie's father and Susan, and then go to the play. Mr. Gardner takes up his old job as a history teacher again (and is now much happier), and Charlie finally gains the confidence to visit his father in prison (something he had felt uncomfortable about earlier in the film). The film ends with Charlie applying for a summer internship at a psychiatric institute.","language":"English","Critical reception":"Charlie Bartlett received a 56% rating on Rotten Tomatoes and with a consensus: \"With engaging performances marked by an inconsistent tone, Charlie Bartlett is a mixed bag of clever teen angst comedy and muddled storytelling\". Stephen Holden of The New York Times wrote \"If the attention span of Charlie Bartlett didn’t wander here and there, the movie might have been a high school satire worthy of comparison with Alexander Payne’s Election. But as it dashes around and eventually turns soft, it loses its train of thought ... [and] never coalesces into the character-driven, serious comedy with heart that you want it be.\"[3]David Wiegand of the San Francisco Chronicle commented \"The script is adequate, although screenwriter Nash has created one distasteful character after another, and there's barely a ripple of relieving humor in the entire film ... The material might have worked better if the filmmakers had adopted a satirical tone, or even if they'd gone the whole American Pie route. Instead, the film grinds on with only a few bright moments. The big problem, though, isn't the script but rather the direction and, specifically, the plodding pace of the film. That's surprising, given that first-time director Jon Poll has a background in film editing. It may have something to do with knowing pretty much what will happen from one moment to the next, but you keep wanting Poll and his cast to get on with things, or at least, energize the film some way or another. The tone is often just turgid ... Yet, for all its problems, the film is often sincere, often earnest ... You'll find yourself rooting for the filmmakers in spite of yourself, and, more to the point, in spite of the mistakes they've made.\"[4]Jonathan Rosenbaum of the Chicago Reader called the film \"a rebellious teen comedy that isn't as good or as radical as Pump Up the Volume, but still feels like a shot in the arm and is full of irreverent energy.\" He added, \"Despite an ineffectual subplot about the hero's absent father, there are some good satirical riffs here on adult hypocrisies (with Robert Downey Jr. especially good as the beleaguered, alcoholic school principal), a few echoes of the underrated Mumford, and lots of high spirits.\"[5]Darrell Hartmann of the New York Sun said, \"John Poll's rebellious-teen comedy falls well below the high bar set by recent genre hits Juno and Superbad. An anything-goes kookiness pervades the first half, but the film then takes a trite turn that only serves to highlight its unlikely premise.\"[6]David Balzer of Toronto Life, rating it three out of five stars, called it \"a cool trip down teen dramedy lane, but one senses the film could be a lot smarter. Bartlett’s drug selling, it turns out, is not the main subject of the movie; 'messed-up people' are, and this causes Charlie Bartlett to lean on psychobabble about disaffection that it initially tries so hard to mock. The film’s use of Cat Stevens’ anthem from Harold and Maude, “If You Want to Sing Out, Sing Out,” encapsulates its problems; instead of acting as a wry expression of Bartlett’s dark philosophy, the song becomes the kind of pat message of self-empowerment that drives teens to Prozac in the first place.\"[7]","box_office":"$5,254,986[1]","cinematography":"Paul Sarossy","production_company":"SKE","directed_by":"Jon Poll","Home media":"MGM Home Entertainment released the film on Region 1 DVD on June 24, 2008. Viewers have the option of watching it in fullscreen (with optional commentary by Jon Poll and Gustin Nash) or anamorphic widescreen (with optional commentary by Poll, Anton Yelchin, and Kat Dennings) format. It has audio tracks and subtitles in English and Spanish. Bonus features include Restroom Confessionals and a music video by Spiral Beach.","Soundtrack":"The soundtrack to Charlie Bartlett was released on January 22, 2008.","release_dates":"February 22, 2008","Production":"The film was shot on location in Toronto as well as at Parkwood Estate in Oshawa, Ontario and Trafalgar Castle School in Whitby, Ontario. It was also filmed at Western Technical-Commercial School, where parts of Billy Madison, Ice Princess, Alley Kids Strike, \"Fever Pitch\" and Being Erica were shot.","produced_by":"Sidney Kimmel Barron Kidd Jay Roach David Permut","starring":"Anton Yelchin Kat Dennings Robert Downey Jr. Tyler Hilton Hope Davis","running_time":"97 minutes","music_by":"Christophe Beck","charlie_bartlett":"Theatrical release poster","edited_by":"Alen Baumgarten","written_by":"Gustin Nash","budget":"$12 million[1]"}