{"country":"India","distributed_by":"SLB Films Vinod Chopra Productions","1942:_a_love_story":"Film poster","language":"Hindi","Synopsis":"The film is set in 1942, when the British Raj was declining. It was a time when many Indians were either working for the British or rallying in underground meetings and protests against them. In this atmosphere, Naren Singh (Anil Kapoor) falls in love with Rajeshwari \"Rajjo\" Pathak (Manisha Koirala). Their romance is shown developing in spite of the political and social unrest at the time.Naren's father, Diwan Hari Singh (Manohar Singh), is a loyal British employee, while Rajjo's father Raghuvir Pathak (Anupam Kher) is a revolutionary fighting against British rule. When Naren asks Raghuvir for Rajjo's hand in marriage, Raghuvir gets livid. Naren declares that he is willing to sacrifice everything for Rajjo, and convinces Raghuvir of his love for her. Pathak relents and tells Naren to talk to his father. When Naren does so, Hari Singh is angry that his son has chosen Rajjo, the daughter of a revolutionary, but pretends that he will do anything for Naren's happiness.Hari Singh tricks Naren into revealing Pathak's secret location, and leaks the information to the British authorities. Soon, police barge into Pathak's hideaway and try to kill him, only to find him waiting to light a bomb. He kills them all, dying with them. Rajjo, who was out at that time, realizes what has happened and runs away. She is taken into refuge by Shubhankar (Jackie Shroff), a compatriot of Pathak who has learned of his death. Under Shubhankar's tutelage, Rajjo follows her father's revolutionary path. Meanwhile, Naren is angry with his father for being used as a pawn in the ambush and killing of Pathak and driving Rajjo away. Promising to make up with Rajjo and help her cause, he pledges to become a protester or a revolutionary, opposing his own father.Naren severs all ties with his father and stands up against British rule, in particular General Douglas, in front of the city. He is convicted and sentenced to hang for attempted murder. Moved by Naren's actions, Rajjo tells Shubhankar about him. Shubhankar saves Naren from being hanged and the two finish off Hari Singh and many of the British loyalists. They are helped by Major Bisht (Danny Dengzongpa), who has a change of heart after having tragically witnessed the killing of his daughter Chanda, a revolutionary, by the gunshots of British loyalists upon General Douglas' orders. With the loyalists dead, Shubhankar hangs General Douglas by the same noose that was intended for Naren. Shubhankar, Rajjo and Naren, together with Major Bisht and the citizens are shown at the end of the movie saluting the Indian flag, being hoisted by Shubhankar.","cinematography":"Binod Pradhan","directed_by":"Vidhu Vinod Chopra","Soundtrack":"The film's music was composed by music director R.D. Burman with lyrics by Javed Akhtar. R.D. Burman won his last Filmfare Award for Best Music Director and Javed Akthar bagged the Filmfare Award for Best Lyricist. Kumar Sanu won his 5th consecutive Filmfare Award for Best Male Playback Singer and Kavita Krishnamurthy won the Filmfare Award for Best Female Playback Singer, the first of her Hat-trick feat. The music in the introduction of the film is from Gustav Holst's 'The Planets - Mars the bringer of war'.","release_dates":"April 15, 1994 (1994-04-15)|||||","Box office":"The film's adjusted gross amounts to Rs 896.4 million and was declared \"average\".[4]","produced_by":"Vidhu Vinod Chopra","starring":"Anil Kapoor Jackie Shroff Manisha Koirala Anupam Kher","running_time":"157 minutes","music_by":"R. D. Burman Javed Akhtar (lyrics)","edited_by":"Renu Saluja","written_by":"Sanjay Leela Bhansali Kamna Chandra Vidhu Vinod Chopra","budget":"5 million"}