{"based_on":"84 Charing Cross Road by James Roose-Evans adapted from the book by Helene Hanff","country":"United Kingdom United States","distributed_by":"Columbia Pictures","Plot":"In 1949, Helene Hanff is in search of obscure classics and British literature titles that she has been unable to find in New York City. She notices an ad in the Saturday Review of Literature placed by antiquarian booksellers Marks & Co, located at the titular address in London. She contacts the shop, where chief buyer and manager Frank Doel fulfills her requests. A long-distance friendship develops over time between the two and between Hanff and other staff members, as well, including birthday gifts, holiday packages, and food parcels to compensate for post–World War II food shortages in Britain. Their correspondence includes discussions about topics as diverse as the sermons of John Donne, how to make Yorkshire Pudding, the Brooklyn Dodgers, and the coronation of Elizabeth II.Hanff postpones visiting her English friends until too late: Doel dies in December 1968 and the bookshop eventually closes. She finally visits Charing Cross Road and the vacant shop in the summer of 1971.","language":"English","Reception":"In his review in The New York Times, Vincent Canby called it \"a movie guaranteed to put all teeth on edge . . . a movie of such unrelieved genteelness that it makes one long to head for Schrafft's for a double-gin martini, straight up, and a stack of cinnamon toast from which the crusts have been removed.\"[1]Variety described it as \"an appealing film on several counts, one of the most notable being Anne Bancroft's fantastic performance in the leading role ... [She] brings Helene Hanff alive in all her dimensions, in the process creating one of her most memorable characterizations.\"[2]Roger Ebert of the Chicago Sun-Times observed, \"The film is based on a hit London and New York play, which was based on a best-selling book. Given the thin and unlikely subject matter, that already is a series of miracles. And yet there are people who are pushovers for this material. I should know. I read the book and I saw the play and now I am reviewing the movie, and I still don't think the basic idea is sound . . . Miss Fiske . . . was the librarian at the Urbana Free Library when I was growing up . . . She never had to talk to me about the love of books because she simply exuded it and I absorbed it. She would have loved this movie. Sitting next to her, I suspect, I would have loved it, too. But Miss Fiske is gone now, and I found it pretty slow-going on my own.\"[3]Gene Siskel, in his review for The Chicago Tribune, wrote: \"Years ago, 84 Charing Cross Road would have been called a 'woman's picture' or a 'perfect matinee.' But it's that and more. It should be irresistible to anyone able to appreciate the goodness of its spirit and its spirited characters.\"The film enjoyed an overall positive reception, and has a 'fresh' 86% rating on Rotten Tomatoes.In its opening weekend in the U.S. the film grossed $24,350 at one theater. The total U.S. box office was $1,083,486.[4]Anne Bancroft won the BAFTA Award for Best Actress in a Leading Role. Judi Dench was nominated for the BAFTA Award for Best Actress in a Supporting Role, and Hugh Whitemore for BAFTA Award for Best Adapted Screenplay. At the 15th Moscow International Film Festival, Anthony Hopkins was named Best Actor, and David Hugh Jones was nominated for the Golden Prize for his direction.[5] Whitemore and Helene Hanff shared the first USC Scripter Award for their contributions to the screenplay.","box_office":"$1 million (domestic)","cinematography":"Brian West","production_company":"Brooksfilms","directed_by":"David Jones","release_dates":"February 13, 1987 (1987-02-13) (United States)|||||","Production":"The film was shot on location in London and New York City. London settings include Buckingham Palace, Soho Square, Trafalgar Square, St James's, Westminster, White Hart Lane in Tottenham, and suburban Richmond. Manhattan settings include Central Park, Madison Avenue, and Saint Thomas Church. Interiors were filmed at Lee International Studios and Shepperton Studios in Surrey.","produced_by":"Mel Brooks Geoffrey Helman","starring":"Anne Bancroft|Anthony Hopkins|","running_time":"100 minutes","84_charing_cross_road":"Theatrical release poster","music_by":"George Fenton","edited_by":"Chris Wimble","written_by":"Hugh Whitemore"}