{"country":"United States","distributed_by":"Paramount Pictures1","Plot":"A honeybee named Barry B. Benson (Jerry Seinfeld) has recently graduated from college and is about to enter the hive's Honex Industries honey-making workforce alongside his best friend Adam Flayman (Matthew Broderick). Barry is initially excited to join the workforce, but his latent non-conformist attitude emerges upon discovering that his choice of job will never change once picked. Later, the two bees run into a group of Pollen Jocks, bees who collect pollen from flowers outside the hive. The Jocks offer to take Barry outside the hive to a flower patch, and he accepts. While on his first pollen-gathering expedition, Barry gets caught in the rain, and ends up on the balcony of a human named Vanessa (Renée Zellweger). Upon noticing Barry, Vanessa's boyfriend Ken (Patrick Warburton) attempts to swat him, but Vanessa instead safely catches and releases Barry outside the window, saving his life.Barry later returns to express his gratitude to Vanessa, breaking the sacred rule that bees are not supposed to communicate with humans. Barry and Vanessa develop an instant bond, bordering on attraction, and spend time together frequently. Later, while Barry and Vanessa are walking through a grocery store, Barry is shocked to discover that the humans have been stealing and eating the bees' honey for centuries. He decides to journey to Honey Farms, which supplies the grocery store with its honey. Outraged at the poor treatment of the bees in the hive, including the use of bee smokers to subdue the colony, Barry resolves to sue the human race to put an end to the exploitation of bees.Barry's mission attracts wide attention from bees and humans alike, and hundreds of people show up to watch the trial. Although Barry is up against formidable defense attorney Layton T. Montgomery (John Goodman) the trial's first day goes well. That evening, Barry is having dinner with Vanessa when Ken shows up. Vanessa leaves the room, and Ken expresses to Barry that he dislikes Barry and Vanessa spending time together. When Barry leaves to use the restroom, Ken ambushes Barry and attempts to kill him, only for Vanessa to intervene and break up with Ken.The next day at the trial, Montgomery repeatedly insults bees, which antagonizes Adam into stinging him. Adam's actions jeopardize the bees' credibility and put Adam's life in danger, though he manages to survive. While visiting Adam in the hospital, Barry notices a man smoking outside, and is struck by inspiration. The next day, Barry wins the trial by exposing the jury to the harsh treatment bees are subjected to, particularly the smoker, and humans are banned from stealing honey from bees ever again.Having lost the trial, Montgomery angrily warns Barry that a negative shift in the balance of nature is imminent. As it turns out, the sudden, massive stockpile of honey has put every bee out of a job, including the vitally important Pollen Jocks. As a result, without anything to pollinate them, the world's flowers slowly begin to die out. Before long, the only flowers left with healthy pollen are those in a flower parade in Pasadena, California. Barry and Vanessa travel to the parade and steal a parade float, which they load onto a plane to be delivered to the bees so they can re-pollinate the world's flowers. When the plane's pilot and copilot are knocked unconscious, Vanessa is forced to land the plane, with help from Barry and the bees from Barry's hive.Armed with the pollen of the last flowers, Barry and the Pollen Jocks manage to reverse the damage and save the world's flowers, restarting the bees' honey production. Humans and bees are seen treating each other visibly better, and certain brands of honey are now \"bee-approved\". Barry becomes a member of the Pollen Jocks, helping to pollinate the world's plants. Barry is also seen running a law firm inside Vanessa's shop, titled \"Insects at Law\", handling disputes between animals and humans. The film ends with Barry flying off to a flower patch with the Pollen Jocks.","language":"English","Voice cast":"Megan Mullally originally voiced the Queen of the Hive and had even recorded her lines; but this character was cut from the film. Seinfeld still wanted her to have a part in the movie, so he gave her the role of the Honex Tour Guide. At one point, Uma Thurman, Rebecca Soler, Lisa Kudrow, David Letterman, and Raven-Symoné were all attached to the film, but they dropped out for various reasons.[4]","Reception":"Bee Movie received mixed reviews from critics. The film holds a 51% approval rating on the review aggregator website Rotten Tomatoes, based on 169 reviews with an average rating of 5.7/10. The site's critical consensus reads: \"Bee Movie has humorous moments, but its awkward premise and tame delivery render it mostly forgettable.\"[26] Another review aggregator, Metacritic, which assigns a normalized rating out of 100 top reviews from mainstream critics, calculated a score of 54 based on 34 reviews.[27]Kyle Smith of the New York Post gave the film three out of four stars, saying \"After Shrek the Third's flatulence jokes, the return of that Seinfeldian wit brings animation up a level.\"[28] Michael Phillips of the Chicago Tribune gave the film two and a half stars out of four, saying \"It's on the easygoing level of Surf's Up, and a full tick up from, say, Over the Hedge or The Ant Bully. But given the Seinfeld pedigree it's something of a disappointment.\"[29] Peter Travers of Rolling Stone gave the film three out of four stars, saying \"At its relaxed best, when it's about, well, nothing, the slyly comic Bee Movie is truly beguiling.\"[29] Desson Thomson of The Washington Post said, \"Bee Movie feels phoned in on every level. The images, usually computer animation's biggest draw, are disappointingly average. And as for the funny stuff, well, that's where you were supposed to come in.\"[30] A.O. Scott of the New York Times gave the film three and a half stars out of four, saying \"The most genuinely apian aspect of Bee Movie is that it spends a lot of its running time buzzing happily around, sniffing out fresh jokes wherever they may bloom.\"[29] Claudia Puig gave the film one and a half stars out of four, saying \"Bee Movie is certainly not low-budget, but it has all the staying power and creative value of a B-movie. The secret life of bees, as told by Seinfeld, is a bore with a capital B.\"[29] Steven Rea of The Philadelphia Inquirer gave the film three stars out of four, saying \"Bee Movie is not Shrek, and it is not Ratatouille either (by far the standout computer-animated feature of the year). But it has enough buzzing wit and eye-popping animation to win over the kids—and probably more than a few parents, too.\"[31] Richard Roeper gave the film a positive review, saying \"This is a beautifully animated, cleverly executed, warm and funny adventure.\"[29]Roger Ebert of the Chicago Sun-Times gave the film two out of four stars, saying \"All of this material, written by Seinfeld and writers associated with his television series, tries hard, but never really takes off. We learn at the outset of the movie that bees theoretically cannot fly. Unfortunately, in the movie, that applies only to the screenplay. It is really, really, really hard to care much about a platonic romantic relationship between Renee Zellweger and a bee, although if anyone could pull it off, she could.\"[32] Ty Burr of The Boston Globe gave the film three out of four stars, saying \"The vibe is loose-limbed and fluky, and the gags have an extra snap that's recognizably Seinfeldian. If I believed in a sitcom afterlife, I'd swear the whole thing was cooked up by Kramer and George's dad.\"[33] Jack Mathews of the New York Daily News gave the film three out of four stars, saying \"Watching this pun-filled cartoon is like falling into a tray of children's watercolors—the warm end, where oranges and yellows and ambers wave.\"[34] Stephen Whitty of the Newark Star-Ledger gave the film two and a half stars out of four, saying \"The movie has some pretty pictures and a few good jokes, but not nearly enough. And the story suffers from sitcom attention-deficit disorder, veering off in a new direction every half-hour or so.\"[29] David Botti of Newsweek said, \"What I like about Bee Movie is its comfy, off-the-cuff charm: unlike a lot of animated family entertainment, it's not all Thwack Smash Kaboom.\"[35] Moira MacDonald of The Seattle Times gave the film two and a half stars out of four, saying \"Bee Movie doesn't touch the bar raised so high by Pixar, but it creates a little buzz of its own.\"[36] Peter Howell of the Toronto Star gave the film two and a half stars out of four, saying \"Bee Movie is a cute movie. Not that there's anything ... well, you know the rest. But cute is not what adults expect from Jerry Seinfeld, although children will be delighted.\"[37]The film opened in second place to American Gangster, but its gross of $38,021,044 had it more in line with the studios' lowest-grossing features, such as Shark Tale. The film had an average of $9,679 from 3,928 theaters.[38] In its second weekend, the film held well with a 33% drop to $25,565,462 and claiming the top spot, resulting in a $6,482 average from expanding to 3,944 theaters.[39] Its widest release was 3,984 theaters, and closed on February 14, 2008 after 104 days of release, grossing $126,631,277 domestically along with an additional $160,963,300 overseas for a worldwide total of $287,594,577.[2] Produced on a $150 million budget, the film was a moderate box office success worldwide, but it was a disappointment in the United States and is DreamWorks Animation's third lowest-grossing computer-animated film to date.[40] It was #3 in the UK Box office (behind Enchanted and The Golden Compass).Bee Movie was nominated for Best Animated Feature Film at the 65th Golden Globe Awards.[41]Barry B. Benson was the announcer for Best Animated Short on the Oscars for 2008. But beforehand, he showed the audience some of his \"prior\" roles, including every bee in the swarm in The Swarm.[42]","box_office":"$287.6 million[2]","production_company":"DreamWorks Animation Columbus 81 Productions[1]","Marketing":"Two teaser trailers were released for the film that feature Seinfeld dressed in a bee costume, trying to shoot the film in live-action. Eddie Izzard portrays the direction agent, and Steven Spielberg suggests to Seinfeld in the second trailer to just do it as a cartoon. Upon the release of the first trailer, it was announced that three of the live-action teasers would be released in total.[6] In the second trailer, Steven Spielberg is taking a picture of himself and an assistant director, referencing the camera gag Ellen DeGeneres pulled on him during the 79th Academy Awards. After Seinfeld fails to do scenes in live-action, Spielberg suggests Seinfeld that the film can just be made as a cartoon. One of the crew members announce that the film is a cartoon, having the crew leave the stage studio. The trailer finally shows the movie as an animated CGI feature. Also in the second trailer, the bear that jumps out at Barry is Vincent the Bear from Over the Hedge, another DreamWorks Animation SKG movie.[7][8]The third trailer was released with Shrek the Third, but this was an animated teaser. The fourth trailer was released on the Bee Movie official website, and revealed most of the film's plot.[9] In addition, two weeks before the release, NBC aired 22 behind-the-scenes skits called \"Bee Movie TV Juniors,\" all of which are staged and tongue-in-cheek in nature.[10] The popular internet site Gaia Online featured a great deal of promotional material for the film.[11]Ten books were released for the film: Bee Movie: The Story Book,[12] Bee Movie: The Honey Disaster,[13] The Art of Bee Movie,[14] Bee Movie: Deluxe Sound Storybook,[15] Bee Movie (Ultimate Sticker Books),[16] Bee Movie (I Can Find It),[17] Bee Movie: The Junior Novel,[18] Bee Movie: What’s the Buzz?,[18] Bee Movie Mad Libs,[19] and Bee Movie: Bee Meets Girl.[20]A video game titled Bee Movie Game was released on October 30, 2007 for Microsoft Windows, Xbox 360, Wii, PlayStation 2, and Nintendo DS.[21]Bee Movie was released on DVD on March 11, 2008 in both fullscreen and widescreen formats and a 2-disc special edition DVD. The single-disc extras include the \"Inside the Hive: The Cast of Bee Movie\" and \"Tech of Bee Movie\" featurettes, \"We Got the Bee\" music video, \"Meet Barry B. Benson\" feature, interactive games, and more.[22] The special edition DVD extras includes these along with a filmmaker commentary, alternate endings, lost scenes with commentary, the live action trailers, and Jerry's Flight Over Cannes.[23] HD DVD version was cancelled after the demise of HD DVD.[24] Paramount released the movie on Blu-ray Disc on May 20, 2008.[25]","directed_by":"Simon J. Smith|Steve Hickner|","Soundtrack":"All music composed by Rupert Gregson-Williams, except as noted.","narrated_by":"Jim Cummings","Lawsuits":"Bee Movie is alleged to be similar to a concept developed in 2000 by a team of Swedish animation students, which they claim was presented to DreamWorks in 2001 under the name Beebylon. The animation students say DreamWorks rejected the idea, on the basis of it being \"too childish.\" When Bee Movie was announced in 2003, the students claim they once again contacted DreamWorks to make sure the movie was not similar to their original concept, and was given a reassuring answer. When one of the members of the Beebylon team saw a trailer of the movie in 2007, he found it to be extremely similar and attempted to find a U.S. lawyer who could represent them. Jerry Seinfeld rejected the plagiarism claims during his PR tour for Bee Movie in Sweden. \"I'm doing my best not to laugh and I'm taking it as serious as I can. But it's a little bit hard. It is entirely possible that somebody else came up with an idea about making a movie about bees. I knew nothing of this until this very morning and I hope they are not too upset.\"[43][44][45][46][47][48]A Florida-based cosmetics company called Beeceuticals filed a lawsuit over the use of their trademarked phrase \"Give Bees a Chance\".[49][50] The suit between the parties was settled out of court.[51]","release_dates":"November 2, 2007 (2007-11-02)|||||","produced_by":"Jerry Seinfeld|Christina Steinberg|Cameron Stevning|","starring":"Jerry Seinfeld|Renée Zellweger|","running_time":"91 minutes","bee_movie":"Theatrical release poster","music_by":"Rupert Gregson-Williams","edited_by":"Nick Fletcher","written_by":"Jerry Seinfeld|Andy Robin|Barry Marder|Spike Feresten|","budget":"$150 million[2]"}