{"Cast":"Hayden Rorke, best known for playing Dr. Bellows on the TV series I Dream of Jeannie (1965–70), has a small part as a friend of Milo. Noel Neill, later to portray Lois Lane on the TV series The Adventures of Superman, has a small role as an American art student who tries to criticize Jerry's paintings. Jazz musician Benny Carter plays the leader of a jazz ensemble performing in the club where Milo first takes Jerry.Madge Blake, best known for playing Bruce Wayne's aunt Harriet Cooper on the TV series Batman (1966-1968), has a small part as a customer in the perfume shop in which Lise works. Judy Landon, better known for her appearance in Kelly's next musical Singin' in the Rain (and as the wife of Brian Keith), appears as a dancer in the Stairway to Paradise sequence.","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Digital restoration":"In 2011, the film was digitally restored by Warner Bros. motion Picture imaging. Frame-by-frame digital restoration by Prasad Corporation removed dirt, tears, scratches and other defects.[citation needed] The film was restored to its original look for its 60th-anniversary.[5][6]","Plot":"American World War II veteran Jerry Mulligan (Gene Kelly) is now an exuberant expatriate in Paris trying to make a reputation as a painter. His friend and neighbor, Adam Cook (Oscar Levant), is a struggling concert pianist who is a longtime associate of a French singer, Henri Baurel (Georges Guétary). At the ground-floor bar, Henri tells Adam about his cultured girlfriend. Jerry joins them later, before going out to sell his art.A lonely society woman and heiress, Milo Roberts (Nina Foch), finds Jerry displaying his art on the street and takes an interest in him and his art. She brings him to her apartment to pay for his works, and invites him to a dinner party she is throwing later that night. After singing with French children on the way home, Jerry shows up to Milo's apartment. He quickly finds out that the \"party\" is actually a one-on-one date, and tells Milo he has no interest in being a paid escort. When he attempts to leave after giving her money back, she insists that she is only interested in his art.They go to a crowded bar, and she offers to sponsor an art show for Jerry as a friendly gesture. Some of Milo's friends arrive, and while sitting with them, he sees Lise Bouvier (Leslie Caron), a French girl seated at the next table. Jerry ignores Milo and her acquaintances, and instead pretends to know Lise already and dances with her. She is standoffish and gives Jerry a wrong phone number, but she is innocently corrected by someone at her table. Heading home, Milo tells Jerry he was very rude cavorting with a girl he does not know while in her presence, but he gets out of the car and bids her farewell.The next day, Jerry calls Lise at her work, but she tells him to never call her again. Jerry and Milo meet at a cafe, and she informs him that a collector is interested in his paintings and she arranged a showing later that day. Before going to the showing, he goes to the parfumerie where Lise works and she consents to dinner with him. She does not want to be seen eating with him in public, but they share a romantic song and dance on the banks of the Seine River in the shadows of Notre Dame.Later, Adam humorously daydreams that he is performing Gershwin's Concerto in F for Piano and Orchestra for a gala audience in a concert hall. As the scene progresses, Adam is also revealed to be the conductor, other members of the orchestra, and even an enthusiastic audience member applauding himself at the end.Milo gets Jerry an art studio and tells him she has planned an exhibition of his work in three months. He initially refuses the studio because he does not have the money for it, but eventually accepts it under the condition that he pay Milo back when his art proceeds allow him. Roughly a month later and after much courting, Lise abruptly runs off when she and Jerry arrive by taxi at his apartment. When Jerry complains to Adam, he is shocked to realize that both Henri and Jerry are involved with the same woman. Henri and Jerry discuss the woman they each love, unaware she is the same woman.That night, Jerry and Lise reunite in the same place on the banks of the Seine close to Notre Dame. She informs him that she is marrying Henri the next day and going to America. Lise feels a sense of duty to Henri, to whom she feels indebted for keeping her safe during World War II. She and Jerry proclaim their love for each other.Feeling slighted, Jerry invites Milo to the art students' masked ball and kisses her. At the raucous party, with everyone in black-and-white costumes, Milo learns from Adam that Jerry is not interested in her, and Henri overhears Jerry and Lise saying goodbye to each other. When Henri and Lise drive away, Jerry daydreams about being with Lise all over Paris to the tune of the George Gershwin composition An American in Paris. His reverie is broken by a car horn, the sound of Henri bringing Lise back to him. They embrace as the Gershwin composition (and the film) ends.","language":"English","box_office":"$6,981,000[1]","cinematography":"Alfred Gilks Ballet: John Alton","directed_by":"Vincente Minnelli","Music and dance":"The 17 minute ballet sequence was the climax of the film, and cost the studio approximately $450,000 to produce.[2] Production on the film was halted on September 15, 1950. Minnelli left to direct another film, Father's Little Dividend. Upon completion of that film in late October, he returned to film the ballet sequence.[3]","Awards and honors":"Kelly received an Academy Honorary Award that year for \"his versatility as an actor, singer, director and dancer, and specifically for his brilliant achievements in the art of choreography on film.\" It was his only Oscar.The film was entered into the 1952 Cannes Film Festival.[4]In 1993, An American in Paris was selected for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\".American Film Institute recognitionAFI also honored star Kelly as #15 of the top 25 American male screen legends.","release_dates":"November 11, 1951 (1951-11-11)|||||","Box office":"According to MGM records, the film earned $3,750,000 in the US and Canada and $3,231,000 in other countries during its initial theatrical release. This resulted in the studio making a $1,346,000 profit.[1]","produced_by":"Arthur Freed","starring":"Gene Kelly Leslie Caron Oscar Levant Georges Guétary Nina Foch","running_time":"113 minutes","Stage adaptations":"A stage version of the musical was adapted by Ken Ludwig, and began previews at the Alley Theatre (Houston) on April 29, 2008, officially opening on May 18 and running through June 22. The production, directed by Alley artistic director Gregory Boyd with choreography by Randy Skinner, starred Harry Groener and Kerry O'Malley. The musical had many of the film's original songs, and also incorporated other Gershwin songs, such as \"They All Laughed\", \"Let's Call the Whole Thing Off\", and \"Love Walked In\".[7][8]In 2014, a stage adaptation premiered in Paris at the Théâtre du Châtelet, with Robert Fairchild as Jerry Mulligan and Leanne Cope as Lise Bouvier (here renamed Lise Dassin). The production, which ran from November to January 2015, was directed and choreographed by Christopher Wheeldon, written by Craig Lucas and designed by Bob Crowley. The musical then transferred to Broadway, with previews at Palace Theatre beginning on March 13, 2015, before officially opening there on April 12.[9][10][11]","music_by":"George Gershwin Lyrics: Ira Gershwin Musical Direction: Johnny Green Saul Chaplin","edited_by":"Adrienne Fazan","an_american_in_paris":"Theatrical release poster","written_by":"Alan Jay Lerner","budget":"$2,724,000[1]"}