{"country":"United States","distributed_by":"TriStar Pictures","Plot":"George, a former mental patient and pathological liar, is released from the hospital, and he is quickly, purposefully mistaken for millionaire brewery heir Abe Fielding by a troop of actors hired by the dubious and unscrupulous business manager Rupert. Rupert needs George to believe he is Fielding in order to kill him off and inherit the Fielding Brewery and family fortune. Eddie Dash, a con man who tenuously and forcefully befriends George due to a community service assignment attempts at first to capitalize on George's mistaken identity--but after being conned by Rupert into killing George for profit, turns the tables on Rupert and helps George fake his death, only to come back to the land of the living and inheriting both the brewery and the Fielding fortune instead. Along the way, Eddie and George turn two of Rupert's female associates into allies and partners--while getting themselves into plenty of contrived comical chaos and hilarity.","language":"English","Reception":"Another You was a critical and box office failure.[2][3][4] It ranks among the top ten widely-released films for having the biggest second weekend drop at the box office, dropping 78.1% from $1,537,965 to $334,836.[5] The film currently has a 11% on Rotten Tomatoes, based on 15 reviews.","box_office":"$2,865,916","cinematography":"Victor J. Kemper","directed_by":"Maurice Phillips","release_dates":"July 26, 1991 (1991-07-26)","Production":"The film was released four years after Pryor revealed that he had been diagnosed with multiple sclerosis, and his physical deterioration is evident in this film.[1] Peter Bogdanovich was the original director, but he was replaced after five weeks of shooting.Wilder has not acted in any theatrically released films since, although he has starred in two murder mystery television films and appeared as the Mock Turtle in an adaptation of Alice in Wonderland.","produced_by":"Ziggy Steinberg Ted Zachary (Executive Producer)","starring":"Richard Pryor|Gene Wilder|Mercedes Ruehl|Stephen Lang|Vanessa Williams|","running_time":"94 minutes","another_you":"Theatrical Release Poster","music_by":"Charles Gross","written_by":"Ziggy Steinberg","budget":"$17 million"}