{"country":"United States","distributed_by":"DreamWorks Pictures","Plot":"In 1974, Ron Burgundy (Will Ferrell) is the famous anchorman for a local San Diego television station, fictional KVWN channel 4. He works alongside his friends on the news team; lead field reporter Brian Fantana (Paul Rudd), sportscaster Champion \"Champ\" Kind (David Koechner), and intellectually disabled chief meteorologist Brick Tamland (Steve Carell). Station director Ed Harken (Fred Willard) informs the team that they have maintained their long-held status as the highest-rated news program in San Diego, leading them to throw a wild party, where Ron unsuccessfully tries to pick up a beautiful, blonde woman, Veronica Corningstone (Christina Applegate). Ed later informs the team that they have been forced to hire Veronica Corningstone, the same woman whom Ron tried to pick up. After a series of unsuccessful attempts by the team to seduce her, she finally relents and consents to a \"professional tour\" of the city with Ron, culminating in a sexual relationship. Despite agreeing to keep the relationship discreet, Ron announces it on air.After a dispute with a motorcyclist (Jack Black) involving Ron's dog, Baxter, being punted off the San Diego–Coronado Bridge, Ron is late to work. Veronica fills in for him on-air, and the couple break up. Veronica is made co-anchor, to the disgust of the team, and the two co-anchors become fierce rivals, both on and off the air. Depressed, the news team decides to buy new suits, but Brick, who was leading the way, gets them lost in a shady part of town. Confronted by main competitor Wes Mantooth (Vince Vaughn) and his news team, Ron challenges them to a fight. However, when several other news teams converge on the site, a full-on melee ensues, only to be broken up by police sirens and causing them to flee. Realizing that having a woman as a co-anchor is straining their reputation, Ron gets in another heated argument with Veronica, and they get in a physical fight after she insults him about his hair, further increasing tensions.One of Veronica's co-workers tells her that Ron will read anything written on the teleprompter, so she sneaks into the station and changes the text in revenge. The next day, Ron (unaware of what he is saying) concludes the broadcast by saying, \"Go fuck yourself, San Diego!\", instead of his usual closing line, \"You stay classy, San Diego!\", subsequently provoking an angry mob outside the studio and prompting Ed to fire Ron. Realizing she went too far, Veronica tries apologizing, but Burgundy angrily dismisses her. Burgundy becomes unemployed, friendless, and heavily antagonized by the public while Veronica enjoys fame, although her male co-workers hate her. Ed then informs Champ, Brick, and Brian that if they see Ron, they are not to talk to him or else they will be fired.Three months later, when a panda is about to give birth, all the news teams in San Diego head to the zoo to cover the story. In an attempt to sabotage her, a rival news anchor (Tim Robbins) pushes Veronica into a Kodiak bear enclosure. When Ed cannot locate Veronica, he recruits Ron. Once at the zoo, Ron jumps in the bear pen to save Veronica, as the public watches helplessly. The news team then jumps in to save Ron. Just as a bear is about to attack, Baxter, who miraculously survived, appears and persuades the bear to spare them. As the group climbs out of the pit, Wes appears and holds the ladder over the bear pit, threatening to drop Ron in, and tells him that deep down he has always hated him, but then admits to Ron that he also respects him and pulls Ron out to safety.After Ron and Veronica reconcile, it is shown that in years to come, Brian becomes the host of a Fox reality show named Intercourse Island, Brick is married with 11 children and is a top political adviser to George W. Bush, Champ is a commentator for the NFL before getting fired after being accused by Terry Bradshaw of sexual harassment, and Ron and Veronica are co-anchors for the CNN-esque World News Center.","language":"English","Reception":"Anchorman: The Legend of Ron Burgundy grossed $85,288,303 in North America, and $5,285,885 in other countries, for a worldwide total of $90,574,188.[2] In North America, the film opened at number two in its first weekend, with $28,416,365, behind Spider-Man 2.[17] In its second weekend, the film dropped to number three in the United States, grossing an additional $13,849,313.[18] In its third weekend, the film dropped to number six in the United States, grossing $6,974,614.[19] In its fourth weekend, the film dropped to number nine in the United States, grossing $3,132,946.[20]Anchorman: The Legend of Ron Burgundy received generally positive reviews from critics. Rotten Tomatoes gives the film a score of 66% based on 196 reviews, with an average rating of 6.3/10. The site's consensus reads: \"Filled with inspired silliness and quotable lines, Anchorman isn't the most consistent comedy in the world, but Will Ferrell's buffoonish central performance helps keep this portrait of a clueless newsman from going off the rails.\"[21] Another review aggregation website Metacritic, which assigns a normalized rating out of 100 top reviews from mainstream critics, calculated a score of 63 based on 38 reviews.[22]Empire magazine ranked Ron Burgundy #26 in their \"The 100 Greatest Movie Characters\" poll.[23] Empire also ranked Anchorman at number 113 in their poll of the 500 Greatest Films Ever.[24] Entertainment Weekly ranked Burgundy #40 in their \"The 100 Greatest Characters of the Last 20 Years\" poll and Ferrell said, \"He is my favorite character I've played, if I have to choose one ... Looking back, that makes it the most satisfying thing I've ever done\".[25] He also stated later on that he had no idea that the film would take off like it did, saying \"We had no idea that certain lines would be quoted the way they are and that the film would just take on this life after it left theatres, but thank god it did.\"[26]Kirk Honeycutt of The Hollywood Reporter gave the film a positive review, saying \"Proving that even infantile humor can be funny, Anchorman: The Legend of Ron Burgundy does make you laugh even if you hate yourself for doing so.\"[27] Brian Lowry of Variety gave the film a positive review, saying \"Ferrell has seized on a clever concept rife with possibilities – namely, women breaking the glass ceiling in male-dominated TV news during the '70s – and smartly surrounded himself with a topnotch cast.\"[28] Manohla Dargis of the Los Angeles Times gave the film a positive review, saying \"Tightly directed by newcomer Adam McKay, a former head writer on Saturday Night Live who cooked up the screenplay with Ferrell, Anchorman never reaches the sublime heights of that modern comedy classic There's Something About Mary. Big deal—it's a hoot nonetheless and the scaled-down aspirations seem smart\".[29] Claudia Puig of USA Today gave the film three out of four stars, saying \"That he can make his anchorman chauvinistic, deluded and ridiculous but still manage to give him some humanity is testimony to Ferrell's comic talents\".[30] Owen Gleiberman of Entertainment Weekly gave the film a C+, saying \"Yet for a comedy set during the formative era of happy-talk news, Anchorman doesn't do enough to tweak the on-camera phoniness of dum-dum local journalism\".[31] Peter Travers of Rolling Stone gave the film three out of four stars, saying \"If you sense the presence of recycled jokes from Animal House onward, you'd be right. But you'd be wrong to discount the comic rapport Ferrell has with his cohorts, notably the priceless Fred Willard as the harried station manager\".[32] Roger Ebert of the Chicago Sun-Times gave the film three out of four stars, saying \"Most of the time... Anchorman works, and a lot of the time it's very funny\".[33]James Berardinelli of ReelViews gave the film three out of four stars, saying \"Ferrell carries the movie on his broad shoulders, nailing the character perfectly.\"[34] Michael Wilmington of the Chicago Tribune gave the film two and a half stars out of four, saying \"It's a cute, silly, likable movie without much weight or intensity, but it's also pretty funny.\"[35] Ella Taylor of L.A. Weekly gave the film a negative review, saying \"It's a long string of heavy-footed sight and sound gags that must have seemed a stitch at the drawing board, but made me squirm in my seat.\"[27] Bill Muller of The Arizona Republic gave the film three out of four stars, saying \"For every gag that works, there's one that doesn't, and the story is too thin to keep us engaged otherwise.\"[27] Terry Lawson of the Detroit Free Press gave the film two out of four stars, saying \"Little more than an extended Saturday Night Live skit with better wigs, real locations and a script that sputters as soon as its one-joke premise is exhausted.\"[36] Rene Rodriguez of the Miami Herald gave the film two out of four stars, saying \"It's a flat, dull picture marked by sporadic flashes of ridiculous brilliance.\"[27] A.O. Scott of The New York Times gave the film three out of five stars, saying \"It is not as maniacally uninhibited as Old School or as dementedly lovable as Elf, but its cheerful dumbness is hard to resist.\"[37] Stephen Cole of The Globe and Mail gave the film two and a half stars out of four, saying \"Knights of Columbus! Wouldn't it be great if TV-based comedians weren't afraid of making movies that were funnier than they are?\"[38] Geoff Pevere of the Toronto Star gave the film two out of five stars, saying \"Like most of these sofa-spud comedies, Anchorman bears its attention-deficit disorder proudly, as it shifts tone and abruptly sidetracks.\"[27]Ty Burr of The Boston Globe gave the film two and a half stars out of four, saying \"Sloppy, crude, pursuing the most far-flung tangents in hopes of a laugh, Anchorman still gave me more stupid giggles than I'd care to admit if I weren't paid to.\"[27] Michael Booth of The Denver Post gave the film three and a half stars out of four, saying \"Always affectionate toward its people, especially when they are at their most ridiculous, Anchorman meticulously builds America's dimmest news team. And we root for them.\"[27] Jack Mathews of the New York Daily News gave the film three out of four stars, saying \"As much credit as Ferrell deserves for keeping this nonsense from slipping off the screen, Applegate deserves as well.\"[27] Megan Lehmann of the New York Post gave the film two out of four stars, saying \"Ferrell is funny spouting his weird stream-of-consciousness rants, but too often the plot leaves him hanging and he resorts to just Yelling Really Loud.\"[27] Jay Boyar of the Orlando Sentinel gave the film two out of five stars, saying \"Most of it isn't even as funny as those supposedly humorous features that local news broadcasts sometimes end with.\"[27] Joe Baltake of The Sacramento Bee gave the film three out of four stars, saying \"There isn't a second that goes by without Ferrell filling it with some form of comic shtick – a well-turned punch line, a goofy facial expression, a pratfall or some other kind of physical comedy business.\"[27] Moira MacDonald of The Seattle Times gave the film two out of four stars, saying \"While the film is sporadically funny, it was done much better on the small screen, decades ago.\"[39] Anna Smith of Time Out gave the film a positive review, saying \"Takes a joke and runs with it – sometimes too far, but usually long enough to wear you down and force you to submit to its craziness.\"[40]","box_office":"$90.6 million[2]","cinematography":"Thomas E. Ackerman","production_company":"Apatow Productions","directed_by":"Adam McKay","Home media":"Anchorman: The Legend of Ron Burgundy was released on DVD and VHS on December 28, 2004.[41][42] It was released on Blu-ray on March 15, 2011.[43]","anchorman:_the_legend_of_ron_burgundy":"Theatrical release poster","release_dates":"June 28, 2004 (2004-06-28) (Los Angeles)|July 9, 2004 (2004-07-09) (United States)||||","Production":"The first draft of Anchorman written by Will Ferrell and Adam McKay was very strange and wildly different from the film's final form; Adam McKay stated that the script originally included \"a musical number with sharks\". Film director Paul Thomas Anderson, who used to be a producer of Anchorman, was taken aback by the script's bizarre nature, so much so that afterwards he left production, although in retrospect he mentioned lightheartedly, \"I blew that [opportunity].\"[7]Even though Anchorman is set in San Diego, the real San Diego is only seen in brief aerial shots—modern shots which include numerous buildings in downtown San Diego which had not yet been built or opened during the 1970s.[8] According to the official production notes and \"making of\" documentary (both included on the DVD), Anchorman was actually filmed in Los Angeles, Glendale, and Long Beach on sets which were made to look like San Diego during the 1970s.[8]The film initially centered around the reporters tracking down a clumsy yet elusive group of hippie bank robbers known as \"The Alarm Clock\".[9] This version of the film was met with poor test audience results, and a significant portion of the film was re-written and re-shot to replace the Alarm Clock with the panda story that appeared in the final version.[9] The original Alarm Clock version was re-edited, along with alternate takes of existing scenes, into a separate direct-to-video film entitled Wake Up, Ron Burgundy: The Lost Movie.[9] It was released straight to DVD on December 28, 2004.[10]The physical appearance of the Ron Burgundy character was modeled after real-life news anchorman Harold Greene who worked at KCST-TV and KGTV in San Diego, CA during the mid-1970s.[11]Although he has no role in the final film John C. Reilly attended an early read through and impressed Ferrell so much that a part in Talladega Nights: The Ballad of Ricky Bobby was developed for him.[12]The film's musical score was composed by Alex Wurman.[13] A soundtrack album compiling the songs used in the film was released on July 9, 2004.[13] The \"jazz flute\" solo heard in the film is played by Katisse Buckingham, a Los Angeles-based studio musician.[14][15][16]","produced_by":"Judd Apatow","starring":"Will Ferrell|Christina Applegate|Paul Rudd|Steve Carell|David Koechner|Fred Willard|","running_time":"95 minutes 99 minutes (unrated cut)[1]","Sequel":"A sequel, titled Anchorman 2: The Legend Continues, was released on December 18, 2013.[44] Adam McKay, the director of the first film, returned as director.[44] The main cast, including Will Ferrell, Steve Carell, Paul Rudd, David Koechner, and Christina Applegate reprised their roles.[44] New cast included Meagan Good, James Marsden and Kristen Wiig.[44]","music_by":"Alex Wurman","edited_by":"Brent White","written_by":"Will Ferrell|Adam McKay|","budget":"$26 million[2]"}