{"based_on":"Astro Boy  by Osamu Tezuka","country":"United States Hong Kong","distributed_by":"Summit Entertainment","screenplay_by":"Timothy Harris David Bowers","story_by":"David Bowers","Plot":"Toby Tenma is a teenager who lives in the futuristic city-state Metro City, which floats above the polluted \"Surface\". Toby's father, Dr. Tenma, is a famous roboticist and head of the Ministry of Science, but has a distant relationship with his son. Dr. Tenma meets the city's obstructive leader President Stone to demonstrate a new defensive robot called the Peacekeeper. To power it, Tenma's friend Dr. Elefun unveils the Blue and Red Core, two energy spheres which have opposing positive and negative energy. Stone has the destructive Red Core placed into the Peacekeeper, causing it to go berserk, leading to Toby being disintegrated after sneaking into the room.A distraught Tenma secretly constructs a robotic replica of Toby, complete with his memories, but has in-built defences to protect him and is powered by the Blue Core. Toby's replica is awakened, believing nothing has happened. While he has Toby's mind, his personality is different in Tenma's eyes, when in actuality it is quite similar. Toby discovers his robotic capabilities including rocket-powered flight and the ability to understand other robots. Toby flies home but learns from Tenma of his origins and is rejected by him, flying away much to the sadness of Dr. Elefun. Stone, desperate to win a re-election, has Toby pursued by his guards but the battle leads to Toby tumbling off the city edge onto the Surface. Tenma and Elefun are arrested.Toby awakens in an enormous junkyard, created from the redundant robots dumped by Metro City. He is found by a group of human children, illiterate but smart Zane, twins Sludge and Widget, and the oldest Cora who has a grudge against Metro City. They accompanied by a dog-like waste disposal robot named Trashcan. Toby also meets the members of the Robot Revolutionary Front (RRF), Sparx, Robotsky, and Mike the Fridge, who wish to free robots from mankind's control but are very inept and bound by the Laws of Robotics. However, they give Toby a new name, calling him \"Astro\". Astro departs with the kids, finding people still live on the Surface. He is taken in by robot repairman Hamegg, who also runs a robot fighting ring. The next day, Astro comes across an offline construction robot Zog, whom he revives with the Blue Core's energy. Hamegg accidentally scans Astro, realising he is a robot, and paralyzes him the next day to participate in the fighting ring.Astro defeats Hamegg's fighters until Zog is deployed, but the two robots refuse to fight one another. Hamegg assaults them with an electrical blaster, only for Zog to attempt to harm him, immune from the Laws of Robotics. Astro saves Hamegg. President Stone's flagship arrives and Astro is taken back to Metro City. Reuniting with Tenma and Elefun, Astro agrees to be shut down, apologising to his father for not being Toby. Realising Astro is still his son, Dr. Tenma reactivates him and lets him escape. Stone loads the Red Core into the Peacekeeper, only for it to absorb him and take on his personality. The Peacekeeper absorbs weapons and buildings, growing in size until it's the height of skyscrapers. It then goes on a rampage across Metro City, prompting Astro to battle it. During the fight, Metro City's systems shut down, causing it to tumble to the ground. Astro uses his superhuman strength to help it land safely.The Peacekeeper grabs Astro, but the connection of their cores causes them both pain. Dr. Tenma finds Astro and informs him that if the two cores reunite, they will be destroyed. When Astro's friends are captured, he flies into the Red Core, destroying himself and the Peacekeeper. Stone survives but is arrested for his crimes. Dr. Elefun and the children find Astro's body, discovering the Blue Core is dead. Zog appears and revives Astro using the Blue Core energy given to him. Astro reunites with his loved ones, making peace with his father. A cycloptic extraterrestrial attacks the city, Astro leaping into action as the film ends.","language":"English","Reception":"The film received mixed reviews from film critics. Review aggregator Rotten Tomatoes reports that 49% of 132 critics have given the film a positive review, with a rating average of 5.6 out of 10. The site's general consensus is that \"While it isn't terribly original, and it seems to have a political agenda that may rankle some viewers, Astro Boy boasts enough visual thrills to please its target demographic.\"[24] On Metacritic, which assigns an average rating out of 100 to reviews from film critics, has a rating score of 53 based on 22 reviews.[25]Owen Gleiberman of Entertainment Weekly gave the film a B and wrote of the film having \"little too much lost-boys-and-girls mopiness\", but \"Astro Boy is a marvelously designed piece of cartoon kinetics...\"[26] Glenn Whipp of the Los Angeles Times gave the mixed review claiming \"The kids won't get it but will enjoy the big, climactic robot rumpuses, which owe a heavy debt to Brad Bird's The Iron Giant\".[27]The film was a flop in Japan, appearing at the bottom of the opening week's Top 10 rankings and earning only $328,457. Conversely, the film was very successful in China, breaking a box-office record for a CG animated film. This follows the same pattern as Dragonball Evolution and Speed Racer, other American-produced films based on Japanese sources that were not big hits in the land of their origin but were very successful in China.[28] The film also was a box office bomb in the U.S., opening at #6, grossing $6.7 million,[29] where it remained in the Top 10 for three weeks. When it closed in January 2010, it had a total gross of $20 million.[30] Due to these factors, the film would only produce a worldwide gross of $44.6 million against a $65 million budget.","box_office":"$41.6 million[2]","cinematography":"Pepe Valencia","production_company":"Imagi Animation Studios Tezuka Productions","directed_by":"David Bowers","Video game":"A video game based on the film was released on October 20, 2009 by D3 Publisher to coincide with the film's theatrical release.[31] The Wii, PlayStation 2 and PSP versions were developed by High Voltage Software, and the Nintendo DS version by Art Co., Ltd.[32]","astro_boy":"Theatrical release poster","release_dates":"October 8, 2009 (2009-10-08) (Hong Kong)|October 23, 2009 (2009-10-23) (United States)||||","Production":"In 1997, Sony Pictures Entertainment purchased the film rights to Astro Boy from Tezuka Productions, intending to produce a live-action feature film. Todd Alcott was set to write the screenplay, but the film halted in 2000 when Steven Spielberg began A.I., another film with a robot boy who replaces a dead child.[7] In December 2001, Sony hired Eric Leighton to direct an all-CGI film, with Angry Films and Jim Henson Productions producing it for a 2004 release.[8] A screenplay draft was written, but the film did not go into production, and Leighton left in early 2003 to pursue other film projects. In June 2004, animator Genndy Tartakovsky was hired to direct a live-action/animatronics/CGI feature film.[7] After writing the script, the film didn't go into the production, and Tartakovsky left next year to direct CG-animated feature films at a new studio, Orphanage Animation Studios.[9] Few months later it was revealed, that he was set to direct The Dark Crystal sequel, The Power of the Dark Crystal, another co-production with Jim Henson Productions.[10] In September 2006, it was announced that Hong Kong-based animation firm Imagi Animation Studios would produce a CGI animated Astro Boy film,[11] with Colin Brady directing it.[12] A year later, the studio made a three-picture distribution deal with Warner Bros. and The Weinstein Company, which also included TMNT and Gatchaman.[13] In 2008, Summit Entertainment took over the film's distribution rights.[14] The same year, Brady was replaced with David Bowers.[15]When adapting the film for a western audience and making the leap from 2D to 3D, some changes to Astro had to be made. The more challenging was his kawaii portrayal, part of which were his large eyes and curly eyelashes, which made him too feminine. Imagi had several discussions on how round and curvy Astro's body proportions should be and in the end they were made to be more lean. Also there were issues on Astro's rear end being too small, and that too was altered. The by-product of these changes was Astro's Caucasian look.[16] In early development Astro's design was younger, resembling his iconic design of a 6-year-old boy. The design team changed that and made him look like a 12-year-old to appeal to a larger audience.[16] They also gave him a shirt, and a jacket since they thought it would be strange to have a normal boy running around without one.[17] They also replaced his heart-shaped energy core with a glowing blue one.[18]The score to Astro Boy was composed by John Ottman, who recorded his score with a 95-piece orchestra and choir at Abbey Road Studios.[19] A soundtrack album was released on October 20, 2009 by Varèse Sarabande Records.","Live-action film":"New Line Cinema is in negotiations to come on board a live-action \"Astro Boy\" movie, and it's tapped \"San Andreas\" writers Andre Fabrizio and Jeremy Passmore to pen the script.[33][34]","produced_by":"Maryann Garger Kuzuka Yayoki","starring":"Freddie Highmore|Kristen Bell|Nathan Lane|Eugene Levy|Matt Lucas|Bill Nighy|Donald Sutherland|Charlize Theron|Nicolas Cage|","running_time":"95 minutes","music_by":"John Ottman","edited_by":"Robert Anich Cole","Release":"Beginning in May 2009 and continuing through September 2009, IDW Publishing published a \"prequel\" and comic book adaptation of the film as both mini-series and in graphic novel format to coincide with the North American release of the film in October 2009. A model of a motionless Astro Boy waiting to be powered up was set up at Peak Tower, Hong Kong, outside Madame Tussauds Hong Kong in September 2009. A panel of the film was held at the San Diego Comic-Con on July 23, 2009.[20]Astro Boy was released in the US on DVD and Blu-ray March 16, 2010, by Summit Entertainment. Both releases include two new animated sequences; a featurette with the voice cast including Nicolas Cage, Kristen Bell, Freddie Highmore and Donald Sutherland, among others; three other featurettes about drawing Astro Boy, making an animated movie and getting the Astro Boy look; and an image gallery.[21] In Japan a special Limited Edition Astro Boy Premium Box Set was released. It featured the same content from the US release with the exception of it spanning on two DVDs (One the film, the other special features with two bonus features exclusive to Japanese) and has both English and Japanese dub (along with English and Japanese subtitles.) The box set also comes with a DVD (containing a single story on Astro's first flight and an image gallery), Dr Tenma's Project Notes (featuring 80 pages of CGI models, character art and set designs from the film), a Micro SD (featuring the motion manga Atomu Tanjo (Birth of Astro Boy) originally written by Osamu Tezuka), a postcard of 1980 Astro Boy flying, a small bookmark (that is actually a reel from the film inside a plastic cover) and Astro's blueprints from the film.[22][23]","budget":"$65 million[1]"}