{"based_on":"Journey to the West  by Wu Cheng'en Boku no Son Gokū  by Osamu Tezuka","country":"Japan","distributed_by":"Toei Company (Japan) American International Pictures (USA)","Plot":"Alakazam is a young and brave monkey (a macaque) who has been encouraged by all the other monkeys to become their king. After attaining the throne, he becomes rude and dictatorial, and does not believe that human beings are greater than he is. Then he tricks/forces Merlin the magician to teach him magic (reluctantly on Merlin's part, who warns Alakazam that the powers he acquires now will bring him much unhappiness later).Alakazam becomes so arrogant that he abuses his magic powers, and chooses to go up to Majutsu Land (the Heavens), to challenge King Amo. He is defeated by King Amo. For his punishment, he is sentenced to serve as the bodyguard of Prince Amat on a pilgrimage; in order to learn humility, mercy and to fight with wisdom. Ultimately, he learns his lesson and becomes a true hero.","language":"Japanese","U.S. release":"The film was released in the United States by American International on July 26, 1961. For the American release, a few scenes were heavily edited and rearranged and bandleader Les Baxter was hired to compose a new soundtrack. Teen idol Frankie Avalon supplied the singing voice of Alakazam (the speaking voice was done by Peter Fernandez), and Sterling Holloway provided English-language narration. Other famous voices included Jonathan Winters, Arnold Stang, Dodie Stevens, & E.G. Marshall.Despite a large marketing budget and heavy promotion, the film was unsuccessful in America. The Los Angeles Times called it \"warm, amusing and exciting... the art work is really excellent\".[3]","cinematography":"Harusato Otsuka Komei Ishikawa Kenji Sugiyama","production_company":"Toei Animation","directed_by":"Taiji Yabushita Daisaku Shirakawa","Home media release":"The AIP version of the film was first released on VHS in the 1980s by HBO/Cannon Video (under licensed from then-owner Orion Pictures). Orion Home Video re-released the film in both pan-and-scan and widescreen letterbox VHS editions and on a widescreen laserdisc in 1995. As of May 27, 2014, plans for a DVD and Blu-ray release of the AIP version have yet to be announced.","narrated_by":"Sterling Holloway","release_dates":"August 14, 1960 (1960-08-14) (Japan)|July 14, 1961 (1961-07-14) (USA)||||","produced_by":"Hiroshi Okawa","starring":"Kiyoshi Komiyama Noriko Shindō Hideo Kinoshita Setsuo Shinoda Peter Fernandez Frankie Avalon","running_time":"88 minutes (Japanese Version) 80 minutes (American Version)","music_by":"Ryoichi Hattori (Japanese Version) Les Baxter (American Version)","edited_by":"Shintaro Miyamoto Kanjiro Igusa Salvatore Billitteri Laurette Odney","alakazam_the_great":"1961 US release lobby card","written_by":"Keinosuke Uekusa"}