{"based_on":"A Month in the Country  by J. L. Carr","Cast":"A Month in the Country featured film debuts or early roles of several notable British actors. Although it was the third cinema feature film to cast Colin Firth, it was his first lead role. Similarly, it was Kenneth Branagh's first cinema film, and Natasha Richardson's second. Conversely, it was the last role of David Garth who died in May 1988.[3]","country":"United Kingdom","distributed_by":"Euston Films Channel Four Films Warner Bros.","screenplay_by":"Simon Gray","Plot":"Set in 1920, the film follows the experiences of Tom Birkin (Colin Firth), who has been employed under a bequest to carry out restoration work on a Medieval mural discovered in a church in the small rural community of Oxgodby, Yorkshire. The escape to the idyllic countryside is cathartic for Birkin, haunted by his experiences in World War I. Birkin soon fits into the slow-paced life of the remote village, and over the course of the summer uncovering the painting begins to lose his trauma-induced stammer and tics.In particular, he forms a close friendship with archaeologist James Moon (Kenneth Branagh), another veteran, who like Birkin has been emotionally scarred by the war. Moon is employed in the village under the same bequest, working to uncover a mysterious lost grave, but is more interested in discovering the remains of an earlier Saxon church building in the field next to the churchyard.Birkin becomes accepted into the Nonconformist family of Mr Ellerbeck the station master (Jim Carter), with whom he dines on Sundays; the hospitality of the chapel congregation is contrasted against the established church, who have consigned the penniless Birkin to sleep in the church belfry. Ellerbeck's children eventually persuade Birkin to preach a sermon at a nearby Methodist chapel. Birkin also forms an emotional, albeit unspoken, attachment to Alice Keach (Natasha Richardson), the young wife of the vicar. The vicar himself (Patrick Malahide) is portrayed unsympathetically as an obstruction to the work in the church, viewing the medieval painting as symptomatic of the superstition prevalent in the community.","language":"English","DVD and Blu-ray release":"Following its cinema release, the film was transferred to VHS in 1991 in a pan and scan edition. However, when Glyn Watkins, a poet who had been encouraged by J.L. Carr early in his career, wanted to screen the film at the launch of a poetry book in 2003 at the National Media Museum in Bradford, the museum found that all original 35mm film prints had disappeared.Undeterred, Watkins contacted the agents of the cast and director, and eventually the online fan clubs \"Friends of Firth\" and \"Ken Friends\". He discovered that the film had appeared as part of the National Film Theatre's Branagh season in May 1999, and that the film's American distributors, Warner Bros., had a print in a bonded warehouse. However, it was unclear who possessed the rights to the film. Only after several months it was found that Channel 4 still owned the rights, and the film was eventually released on a limited-edition Region 2 DVD in late 2004.[2] However, the DVD is now no longer widely available in the United Kingdom. In 2008, a complete 96 minute print was located in the Academy Film Archive in Los Angeles and a campaign began to have it restored and released on DVD.[23] A limited edition Region A Blu-ray release of the full 96 minute version of the film is planned on 14 July 2015.[24][25]","box_office":"$443,524 (USA)[1]","cinematography":"Kenneth MacMillan","directed_by":"Pat O'Connor","a_month_in_the_country":"Original theatrical poster, showing Colin Firth and Natasha Richardson.","release_dates":"27 September 1987 (1987-09-27) (U.S.)|||||","Production":"Initially intended to be a made-for-TV film, the film's producer Kenith Trodd upgraded his original plan to a cinema feature.[4] The original working title for the film was \"Falling Man\".[5] Playwright Simon Gray was commissioned to write the screenplay, and Pat O’Connor chosen to direct. In contrast to the book, which is narrated as a recollection by Birkin as an old man, the film is set entirely in the 1920s, except for a brief moment towards the end. In initial drafts of the screenplay, Gray had included a narrator, but O'Connor felt this was not the correct way to present the story:I felt that if I couldn’t do it in the present, suggesting internal pain by performance, then I wouldn’t really want to do it at all.[6]Funding for the film was scarce, and it eventually fell to Euston Films (a subsidiary of Thames Television) and Channel Four Films, who had had some success with low budget features such as My Beautiful Laundrette.[2]To compensate for the lack of budget, a very tight shooting schedule was planned over 28 days, during which Kenneth Branagh was only available for two weeks and was performing on-stage nightly in London.[4][7]Despite being set in Yorkshire, the majority of location filming was moved to Buckinghamshire, although Levisham railway station and the surrounding area in North Yorkshire were utilised.[8] The location shooting of the film began on August 18, 1986 at St. Mary's church in Radnage.[9] Filming was periodically hindered by inclement weather — the perfect summer in which the book was set was not forthcoming, and scenes were filmed during breaks in heavy rain. Interiors were shot at Bray Studios in Berkshire.[4]The church, which is a main location for the film, was substantially set-dressed. Despite having several original medieval wall paintings, the largest addition was the creation of the medieval mural by artist Margot Noyes. To create the impression of an austere country church, Victorian stone flags were replaced with brick pavers for the duration of filming and the original wall paintings covered up. Plastic guttering and other modern additions were covered up or removed.[10] The churchyard had several gravestones added, including the large box tomb which is a focus of several scenes.[11]Several members of the local community were used as extras in the film, and local children were recruited by the director to collect butterflies to be released out-of-shot to create a \"summer feeling\". However there was some opposition to the disruption caused by the filming, and also problems involving unwelcome damage to a section of the interior plasterwork, which had to be restored after filming had concluded.[11][12]The soundtrack of the film was written by Howard Blake, and is scored entirely for string orchestra in the style of early 20th Century British music. Blake notes that the style chosen was intended to complement and contrast recordings of classical music during particular scenes: Verdi's Quattro pezzi sacri was used during the uncovering of the mediaeval mural and a flashback montage of the First World War which opened the film utilised an excerpt from Schubert's Deutsche Messe (D. 872) \"Zum Sanctus: Heilig, heilig ist der Herr\".[13]Howard Blake recalls: \"I went to a viewing and saw that the film was very profound, with a serious anti-war theme, but a certain amount of 'found' choral music had already been laid in by the editors...I explained that I loved the film and I thought the choral/orchestral music worked brilliantly but it was very big and rich and I felt a score would have to emerge from it and be very pure and expressive and quite small — and that I could only hear this in my head as done by strings only.\"[13] Blake decided to compose his score to match the key of the Schubert Mass, in order for the music to continue seamlessly. However, during the recording session with his orchestra, the Sinfonia of London, he found that the Schubert piece was running slow and therefore flat, and he had to ask the players to tune flat to match his intended key.[14]Due to the small budget of the film, Blake agreed \"in lieu of a reasonable fee\" to retain the copyright to his music.[14] The score was subsequently arranged into a suite for string orchestra, and is available on CD in a recording by the English Northern Philharmonia conducted by Paul Daniel.[15]","Reception and awards":"Upon its release in 1987, the film was generally well received by critics. Rita Kempley, writing in The Washington Post suggested \"It's all rather Arthurian, with its chivalric hero on his spiritual quest, the atmosphere suffused, seeming to dance with once and future truths.\"[16] Tom Hutchinson in the Mail on Sunday praised \"a script whose delight is in the rounded reality of its characters\". Janet Maslin, writing in The New York Times praised O'Connor's direction, suggesting it lent the film \"a strong sense of yearning, as well as a spiritual quality more apparent in the look of the film than in its dialogue.\"[17] Desmond Ryan of The Philadelphia Inquirer wrote \"Rarely has the impossibility of love been more wrenchingly presented than in the scenes of dashed hope between Firth and Richardson.[18]However, Nigel Andrews of the Financial Times found it \"like a pastoral parable that has been left outside in the damp too long, causing its batteries to go flat\"[18] and following a 2008 screening, Sam Jordison of The Guardian suggested \"even though this film is (unusually) faithful to the book...it is really little better than inoffensive. Somehow the magic that makes JL Carr's book so precious is missing.\"[19]The film was the recipient of two awards: Pat O'Connor won the Silver Rosa Camuna at the Bergamo Film Meeting in 1987[20] and Howard Blake was awarded the Anthony Asquith Award for Musical Excellence by the British Film Institute in 1988.[14] In addition, Colin Firth was nominated for an Evening Standard Award.[21] The film was screened in the Un Certain Regard section at the 1987 Cannes Film Festival.[22]","produced_by":"Kenith Trodd","starring":"Colin Firth Kenneth Branagh Natasha Richardson Patrick Malahide","running_time":"96 minutes","music_by":"Howard Blake"}