{"based_on":"The novel by P. F. Kluge","country":"United States","eddie_and_the_cruisers":"Theatrical release poster.","screenplay_by":"Martin Davidson Arlene Davidson","Plot":"A television reporter named Maggie Foley (Ellen Barkin) investigates the mysterious disappearance of legendary rock star Eddie Wilson (Michael Paré). Flashbacks dramatize Eddie's life and the rise and fall of his rock and roll band, Eddie and the Cruisers.The band gets its start at a Somers Point, New Jersey club called Tony Mart's. Not adept at writing lyrics, Eddie hires Frank Ridgeway (Tom Berenger) aka \"Wordman\" to be the band's keyboard player and lyricist, over the protests of band manager Doc Robbins (Joe Pantoliano) and bassist Sal Amato (Matthew Laurance). Rounding out the Cruisers are saxophonist Wendell Newton (Michael \"Tunes\" Antunes), background singer and Eddie's girlfriend Joann Carlino (Helen Schneider), and drummer Kenny Hopkins (David Wilson).The band's first album, Tender Years, became a major hit album. But recording their next album, A Season in Hell, turns out to be a nightmare. Inspired by the bleak, fatalistic poetry of Arthur Rimbaud, Eddie pushes his bandmates beyond their limits, musically and personally. Eddie wants to be great, but bassist Sal replies, \"We ain't great. We're just some guys from Jersey.\" Eddie makes this clear that if the band cannot be great, there is no reason to ever play music again. A Season in Hell is ultimately rejected by Satin Records on the grounds that it is \"dark and strange\". In the early morning hours, Eddie's car crashes through the railing and over the Stainton Memorial Causeway. Eddie vanishes without a trace, his body never found.Almost 20 years later, Satin re-releases the band's first album, which charts even higher than it did originally. A television documentary is soon in the works, exploring the mystery of the band's second album, which had disappeared from the vaults of Satin Records the day after Eddie's disappearance. All of the original Cruisers are set to participate in it except Eddie and Wendell Newton, who had died of an overdose in August 1963 at age 37. The others are now living ordinary lives: Sal Amato fronts a Cruisers tribute band. Ridgeway is a high school English teacher in Vineland. Doc works as a radio disc jockey in Asbury Park. Joann is a stage choreographer in Wildwood, and Hopkins works in an Atlantic City casino.During the documentary interviews, the band expresses a desire to relive the past, even though many of their memories are humiliating. For example, during a concert at Benton College, where Frank was once a student, Eddie ridicules Frank repeatedly by referring to him as \"Toby Tyler\". The other Cruisers members share similar stories.Joann is able to complete the one piece of the puzzle that Frank could not: revealing what happened to the band's second album. After storming from the studio, Eddie brought her to the Palace of Depression, a makeshift castle made of garbage and junk that he visited often as a child. She reveals it was in fact she who took the master tapes for the album from Satin Records, hiding them in the Palace of Depression, where she felt they belonged.Frank and Joann go back to the Palace of Depression to retrieve the master tapes. A mystery man driving a blue '57 Chevy Bel Air convertible identical to Eddie's arrives at the house and calls to Joann. But before she can reach the car, Frank unmasks the impostor, revealing him to be Doc, who was after the master tapes all these years. Moved by his story, Frank and Joann give him the master tapes. Doc drives off into the night vowing that the Cruisers will finally conquer the world this time.In a surprise reveal near the ending, a bearded, much older looking Eddie is shown alive, watching the ending credits roll of a documentary tribute to him and the band. He smiles serenely, proud to know that his work is finally being heard, and then disappears into the night.","language":"English","Reaction":"Eddie and the Cruisers was originally intended to open during the summer, but a scheduling error resulted in a September release, when its target audience - teenagers - were back in school.[10] The film had its world premiere at Deauville.[16] Embassy Pictures threw a promotional party for the film at a West Hollywood dance club in September, 1983 where Cafferty and his band played.[2]The film was a box office flop, receiving many negative to mixed reviews from critics(see below). The film was released into theaters on September 23, 1983 and grossed USD $1.4 million on its opening weekend. It would go on to make a paltry $4.7 million in North America.[17] The film was pulled from theaters after three weeks and all of the promotional ads pulled after one week.[10]In the fall of 1984, the single \"On the Dark Side\" from the soundtrack album suddenly climbed the charts, as the film was rediscovered on cable television and home video, prompting the studio to briefly re-release the album.","Critical reception":"Eddie and the Cruisers was not well received by critics. Roger Ebert gave the film two out of four stars and wrote, \"the ending is so frustrating, so dumb, so unsatisfactory, that it gives a bad reputation to the whole movie.\"[18] In her review for The New York Times, Janet Maslin wrote, \"Some of the details ring uncannily true, like the slick oldies nightclub act that one of the Cruisers is still doing nearly 20 years after Eddie's supposed death. Other aspects of the film are inexplicably wrong. Eddie's music sounds good, but it also sounds a lot like Bruce Springsteen's, and it would not have been the rage in 1963.\" However, she did praise Pare's performance: \"Mr. Pare makes a fine debut; he captures the manner of a hot-blooded young rocker with great conviction, and his lip-synching is almost perfect.\"[19] Gary Arnold, in the Washington Post, wrote, \"At any rate, it seemed to me that what Eddie and the Cruisers aspired to do was certainly worth doing. The problem is that it finally lacks the storytelling resources to tell enough of an intriguing story about a musical mystery man.\"[20]","box_office":"$4,700,000","cinematography":"Fred Murphy","production_company":"Aurora Productions","directed_by":"Martin Davidson","Re-release":"In 1984, Eddie and the Cruisers was discovered by additional audiences during its first pay cable run on HBO.[12] Embassy Pictures re-released the film for one week based on successful summer cable screenings and a popular radio single, but it once again failed to perform at the box office.[21] Looking back, Davidson said, \"that picture should have been a theatrical success. There was an audience for it. People still watch it and still tell me about it.\"[12]Davidson was offered the job of directing a sequel to the film, but he was not keen on the idea and wanted no participation.[12] The eventual project, which, unlike the first, had had no source novel from Kluge as its basis, was released as Eddie and the Cruisers II: Eddie Lives! in 1989.","Soundtrack":"Vance asked Davidson to describe his fictitious band and their music. Initially, Davidson said that the Cruisers sounded like Dion and the Belmonts, but when they meet Frank, they have elements of Jim Morrison and The Doors.[4] However, Davidson did not want to lose sight of the fact that the Cruisers were essentially a Jersey bar band, and he thought of Bruce Springsteen and the E Street Band. The filmmaker told Vance to find him someone that could produce music that contained elements of these three bands.[4] Davidson was getting close to rehearsals when Vance called him and said that he had found the band--John Cafferty & The Beaver Brown Band from Providence, Rhode Island. Davidson met the band and realized that they closely resembled the band as described in the script, right down to a Cape Verdean saxophone player, whom he cast in the film.[10] Initially, Cafferty was only hired to write a few songs for the film, but he did such a good job of capturing the feeling of the 1960s and 1980s that Davidson asked him to score the entire film.[6]After successful screenings on HBO in 1984, the album suddenly climbed the charts, going quadruple platinum. The studio re-released the soundtrack in the fall of 1984.[11] Nine months after the film was released in theaters, the main song in the film, \"On the Dark Side,\" was the number one song in the country on Billboard's Mainstream, Rock, and Heatseeker charts;[12] and #7 on the Billboard Hot 100 chart.[13][14] Another single from the film, \"Tender Years\", peaked at #31 on the Billboard Hot 100.[15]","release_dates":"September 23, 1983 (1983-09-23)|||||","Production":"Martin Davidson has said that the inspiration for the film came from a desire to \"get all my feelings about the music of the last 30 years of rock music into it.\"[2] He optioned P. F. Kluge's novel with his own money and at great financial risk.[3] He wrote the screenplay with Arlene Davidson and decided to use a Citizen Kane-style story structure. He remembered, \"That was in my head: the search.\"[4]Davidson made a deal with Time-Life, a company that was going into the movie-making business. However, it quickly left the business after making two films that were not financially successful. He was understandably upset and a couple of days later he went out to dinner and met a secretary who had worked on his first film.[3] He told her what had happened to his film, and she gave his script for Eddie and the Cruisers to her business partners. In a relatively short time, a deal was struck with Aurora and Davidson was given a $6 million budget.In order to get a credible looking and sounding band for the film, Davidson hired Kenny Vance, one of the original members of Jay and the Americans.[4] He showed Davidson his scrapbook, the places the band performed, the car they drove in, and how they transported their instruments. Vance also told Davidson stories about the band, some of which he incorporated into the script.[4] Tom Berenger has said that he did not try to learn piano for the film but did practice keyboards for hours in his trailer.[5] Matthew Laurance actually learned how to play the bass through rehearsals. Only Michael \"Tunes\" Antunes, the tenor saxophone player for John Cafferty and the Beaver Brown Band, and Helen Schneider were professional musicians in the cast.[6]Michael Pare was discovered in a New York City restaurant working as a chef. He said of his role in the film that it was \"a thrill I've never experienced. It's a really weird high. For a few moments, you feel like a king, a god. It's scary, a dangerous feeling. If you take it too seriously ...\"[5]Davidson had the actors who played in Eddie's band rehearse as if they were getting ready for a real concert. Pare remembers, \"The first time we played together - as a band - was a college concert. An odd thing happened. At first, the extras simply did what they were told. Then, as the music heated up, so did the audience. They weren't play-acting anymore. The screaming, stomping and applause became spontaneous.\"[6] Davidson recalls, \"One by one, kids began standing up in their seats, screaming and raising their hands in rhythmic applause. A few girls made a dash for the stage, tearing at Michael's shirt. We certainly hadn't told them to do that. But we kept the cameras rolling.\"[6] Additionally, New Jersey musician Southside Johnny was hired as a technical advisor for the film.[7]Ellen Barkin, who has the small role of the television reporter, Maggie Foley, later said that she \"hated\" making the film:That was what we liked to call a “pay the rent” job. It wasn’t a script I liked, but I remember my agent at the time saying, “Look, you only have to work two weeks, and they’re going to pay you a lot of money. We’ll just say it was your first movie and they just didn’t release it.”... I think people were all fucked-up on drugs. I don’t know. I was a little removed, because I wasn’t on the movie the whole time, but it seemed like it was just a mess. Like, when I’d go, I’d think--I like to make a movie where I know who the boss is. I like a big boss. I like a real director. And it seemed like it was just, “Who’s driving the ship here? What’s going on?”[8]According to Davidson, when he completed making the film, three different studios wanted to distribute it, and he went with Embassy Pictures because they offered him the most money. However, they had no prior experience in distribution and were unable to properly release it in theaters. Davidson remembered, \"And six months later, somebody said, 'Your picture is appearing on HBO this weekend,' and I didn't even know.\"[9]","produced_by":"Joseph Brooks Robert K. Lifton","starring":"Tom Berenger|Michael Paré|","running_time":"95 minutes","music_by":"John Cafferty","edited_by":"Priscilla Nedd-Friendly","Cast notes":"Only two cast members, Michael \"Tunes\" Antunes, the tenor saxophone player for John Cafferty & The Beaver Brown Band, and backup singer Helen Schneider were professional musicians in the fictional band.","budget":"$5 million[1]"}