{"Cast":"The twelve jurors in the order in which they are referred to. They are seated in this order in the movie.Uncredited","country":"United States","distributed_by":"United Artists","screenplay_by":"Reginald Rose","story_by":"Reginald Rose","12_angry_men":"Theatrical release poster","language":"English","Reception":"On its first release, 12 Angry Men received critical acclaim. A. H. Weiler of The New York Times wrote \"It makes for taut, absorbing, and compelling drama that reaches far beyond the close confines of its jury room setting.\" His observation of the twelve men was that \"their dramas are powerful and provocative enough to keep a viewer spellbound.\"[15] However, the film was a box office disappointment.[16][17] The advent of color and widescreen productions may have contributed disappointing box office performance.[16] It was not until its first airing on television that the movie finally found its audience.[18]The film is today viewed as a classic, highly regarded from both a critical and popular viewpoint: Roger Ebert listed it as one of his \"Great Movies\".[19] The American Film Institute named Juror 8, played by Henry Fonda, 28th in a list of the 50 greatest movie heroes of the 20th century. AFI also named 12 Angry Men the 42nd most inspiring film, the 88th most heart-pounding film and the 87th best film of the past hundred years. The film was also nominated for the 100 movies list in 1998.[20] As of January 2015, the film holds a 100% approval rating on the review aggregate website Rotten Tomatoes.[21] In 2011, the film was the second most screened film in secondary schools in the United Kingdom.[22]American Film Institute lists:The film was nominated for Academy Awards in the categories of Best Director, Best Picture, and Best Writing of Adapted Screenplay. It lost to the movie The Bridge on the River Kwai in all three categories. At the 7th Berlin International Film Festival, the film won the Golden Bear Award.[23]","box_office":"$1,000,000 (rentals)[3]","cinematography":"Boris Kaufman","production_company":"Orion-Nova Productions","directed_by":"Sidney Lumet","Cultural influences":"Speaking at a screening of the film during the 2010 Fordham University Law School Film festival, Supreme Court Justice Sonia Sotomayor stated that seeing 12 Angry Men while she was in college influenced her decision to pursue a career in law. She was particularly inspired by immigrant Juror 11's monologue on his reverence for the American justice system. She also told the audience of law students that, as a lower-court judge, she would sometimes instruct juries to not follow the film's example, because most of the jurors' conclusions are based on speculation, not fact.[24] Sotomayor noted that events such as Juror 8 entering a similar knife into the proceeding, doing outside research into the case matter in the first place, and ultimately the jury as a whole making broad, wide-ranging assumptions far beyond the scope of reasonable doubt (such as the inferences regarding the \"Old Woman\" wearing glasses) would never be allowed to occur in a real life jury situation, and would in fact have yielded a mistrial[25] (assuming, of course, that applicable law permitted the content of jury deliberations to be revealed).The movie has had a number of adaptations. A 1991 homage by Kōki Mitani, Juninin no Yasashii Nihonjin (\"12 gentle Japanese\"), posits a Japan with a jury system and features a group of normal Japanese people grappling with their responsibility in the face of Japanese cultural norms. The 1987 Indian film Ek Ruka Hua Faisla (\"a pending decision\") is a remake of the film, with an almost identical storyline. Russian director Nikita Mikhalkov also made a 2007 adaptation, 12. A 2015 Chinese adaptation, 12 Citizens, follows the plot of the original 1957 American movie while including characters reflecting contemporary Beijing society, including a cab driver, guard, businessman, policeman, a retiree persecuted in a 1950s political movement, and others.[26] The detective drama television show Veronica Mars, which like the film includes a theme of class issues, featured an episode \"One Angry Veronica\" in which the title character is selected for jury duty. The episode flips the film's format and depicts one holdout convincing the jury to convict the privileged defendants of assault against a less well-off victim, despite their lawyers initially convincing 11 jury members of a not guilty verdict.The film has also been subject to parody. In 2015, the Comedy Central TV series Inside Amy Schumer aired a half-hour parody of the film titled \"12 Angry Men Inside Amy Schumer\". The sketch revolves around the twelve jurors' deliberations over whether comedian and actress Amy Schumer is attractive enough to be on television. John Hawkes stars as Juror No. 8, Jeff Goldblum as Juror No. 1, Paul Giamatti as Juror No. 10, Vincent Kartheiser as Juror No. 4 and Dennis Quaid as the weary judge. The episode received widespread praise for its humor, dissection of cultural standards of beauty, and emulation of the visual style and tone of the original.[27][28] BBC Radio comedy Hancock's Half Hour, starring Tony Hancock and Sid James, written by Ray Galton and Alan Simpson, broadcast a half-hour parody on October 16, 1959, also known as Twelve Angry Men. The Flintstones story \"Disorder in the Court\" and The Simpsons story \"The Boy Who Knew Too Much\" similarly feature the respective patriarchs of both families playing holdout jurors. The American sitcom Happy Days also features a similar story when Howard Cunningham and Fonzie get picked for a jury, with Fonzie being the lone hold-out for innocence and swaying the rest of the jury in the season 5 episode \"Fonzie for the Defense\".[29]","release_dates":"April 13, 1957 (1957-04-13)|||||","Production":"Reginald Rose's screenplay for 12 Angry Men was initially produced for television (starring Robert Cummings as Juror 8), and was broadcast live on the CBS program Studio One in September 1954. A complete kinescope of that performance, which had been missing for years and was feared lost, was discovered in 2003. It was staged at Chelsea Studios in New York City.[13]The success of the television production resulted in a film adaptation. Sidney Lumet, whose prior directorial credits included dramas for television productions such as The Alcoa Hour and Studio One, was recruited by Henry Fonda and Rose to direct. 12 Angry Men was Lumet's first feature film, and for Fonda and Rose, who co-produced the film, it was their first and only role as film producers. Fonda later stated that he would never again produce a film.The filming was completed after a short but rigorous rehearsal schedule in less than three weeks on a tight budget of $340,000 (equivalent to $2,865,000 in 2015).At the beginning of the film, the cameras are positioned above eye level and mounted with wide-angle lenses to give the appearance of greater depth between subjects, but as the film progresses the focal length of the lenses is gradually increased. By the end of the film, nearly everyone is shown in closeup using telephoto lenses from a lower angle, which decreases or \"shortens\" depth of field. Lumet, who began his career as a director of photography, stated that his intention in using these techniques with cinematographer Boris Kaufman was to create a nearly palpable claustrophobia.[14]","produced_by":"Henry Fonda|Reginald Rose|","starring":"Henry Fonda|Lee J. Cobb|Ed Begley|E. G. Marshall|Jack Warden|","running_time":"96 minutes","music_by":"Kenyon Hopkins","Story":"In a New York City courthouse an eighteen-year-old boy from a slum is on trial for allegedly stabbing his father to death. Final closing arguments having been presented, the jury must decide on the boy's guilt. If there is any reasonable doubt of his guilt they are to return a verdict of not guilty. If not, a guilty verdict will be accompanied by a mandatory death sentence.[9]The jurors spend a short while getting acquainted before they begin deliberating. In a preliminary vote it is apparent that the jurors have already decided that the boy is guilty with the sole exception of Juror 8 (Henry Fonda), who is the only \"not guilty\" vote. He explains that there is too much at stake for him to go along with the verdict without at least a discussion. His vote annoys the other jurors, especially Juror 7 (Jack Warden), who has tickets to a baseball game that evening; and Juror 10 (Ed Begley), who believes that people from slum backgrounds are inherently dishonest, wild, and dangerous.[9] At that mention, Juror 5 (Jack Klugman) notes that he grew up in a slum.The rest of the film's focus is the jury's difficulty in reaching a unanimous verdict. While several of the jurors harbor personal prejudices, Juror 8 maintains that the evidence presented in the case is circumstantial, and that the boy deserves a fair deliberation. He calls into question the accuracy and reliability of the only two witnesses to the murder, the \"rarity\" of the murder weapon (a common switchblade, of which he has an identical copy), and the overall questionable circumstances. He further argues that he cannot in good conscience vote \"guilty\" when he feels there is reasonable doubt of the boy's guilt.Having argued several points and gotten no favorable response from the others, Juror 8 reluctantly agrees that he has only succeeded in hanging the jury. Instead, he requests another vote, this time by secret ballot. He proposes that he will abstain from voting, and if the other 11 jurors are still unanimous in a guilty vote, then he will acquiesce to their decision. The secret ballot is held, and a new \"not guilty\" vote appears. This earns intense criticism from Juror 3 (Lee J. Cobb), who blatantly accuses Juror 5 of switching out of sympathy toward slum children. However, Juror 9 (Joseph Sweeney) reveals that he himself changed his vote, feeling that Juror 8's points deserve further discussion.Juror 8 presents the argument that one of the witnesses, an elderly man who claimed to have heard the boy yell \"I'm going to kill you\" shortly before the murder took place, could not have heard the voices as clearly as he had testified due to an elevated train passing by at the time; it's also noted that \"I'm going to kill you\" is often said by people who don't mean it. Juror 5 changes his vote to \"not guilty\". Soon afterward, Juror 11 (George Voskovec) questions whether it is reasonable to suppose the defendant would have fled the scene, having cleaned the knife of fingerprints but leaving it behind, and then come back three hours later to retrieve it (having been left in his father's chest). Juror 11 then changes his vote.Juror 8 then mentions the man's second claim: upon hearing the father's body hit the floor, he had run to the door of his apartment and seen the defendant running out of the building from his front door in 15 seconds. Jurors 5, 6 and 8 question whether this is true, as the witness in question had a stroke, limiting his ability to walk. Upon the end of an experiment, the jury finds that the witness would not have made it to the door in enough time to actually see the killer running out. Juror 8 concludes that, judging from what he claims to have heard earlier, the witness must have merely assumed it was the defendant running. Juror 3, growing more irritated throughout the process, explodes in a rant: \"He's got to burn! He's slipping through our fingers!\" Juror 8 takes him to task, calling him a \"self-appointed public avenger\" and a sadist, saying he wants the defendant to die because of personal desire rather than the facts. Juror 3 shouts \"I'll kill him!\" and starts lunging at Juror 8, but is restrained by Jurors 5 and 7. Juror 8 calmly retorts, \"You don't really mean you'll kill me, do you?\" proving his previous point.[6]Jurors 2 (John Fiedler) and 6 (Edward Binns) also decide to vote \"not guilty\", tying the vote at 6–6. Soon after, a rainstorm hits the city, threatening to cancel the baseball game for which Juror 7 has tickets.Juror 4 (E. G. Marshall) states that he doesn't believe the boy's alibi, which was being at the movies with a few friends at the time of the murder, because the boy couldn't remember what movie he had seen when questioned by police shortly after the murder. Juror 8 explains that being under emotional stress can make you forget certain things, and tests how well Juror 4 can remember the events of previous days. Juror 4 remembers, with some difficulty, the events of the previous five days, and Juror 8 points out that he hadn't been under emotional stress at that time, thus there was no reason to think the boy should be able to remember the particulars of the movie that he claimed to have seen.[10]Juror 2 calls into question the prosecution's claim that the accused, who was 5'7\" tall, was able to inflict the downward stab wound found on his father, who was 6'2\". Jurors 3 and 8 conduct an experiment to see if it's possible for a shorter person to stab downward into a taller person. The experiment proves the possibility, but Juror 5 then explains that he had grown up amidst knife fights in his neighborhood, and shows, through demonstrating the correct use of a switchblade, that no one so much shorter than his opponent would have held a switchblade in such a way as to stab downward, as the grip would have been too awkward and the act of changing hands too time-consuming. Rather, someone that much shorter than his opponent would stab underhanded at an upwards angle. This revelation augments the certainty of several of the jurors in their belief that the defendant is innocent.Increasingly impatient, Juror 7 changes his vote just so that the deliberation may end, which earns him the ire of Jurors 3 and 11, both on opposite sides of the discussion. Juror 11, an immigrant who has repeatedly displayed strong patriotic pride, presses Juror 7 hard about using his vote frivolously, and eventually Juror 7 admits that he now truly believes the defendant is innocent.[11]The next jurors to change their votes are Jurors 12 (Robert Webber) and 1 (Martin Balsam), making the vote 9–3 and leaving only three dissenters: Jurors 3, 4 and 10. Outraged at how the proceedings have gone, Juror 10 goes into a rage on why people from the slums cannot be trusted, of how they are little better than animals who gleefully kill each other off for fun. His speech offends Juror 5, who turns his back to him, and one by one the rest of the jurors start turning away from him. Confused and disturbed by this reaction to his diatribe, Juror 10 continues in a steadily fading voice and manner, slowing to a stop with \"Listen to me. Listen...\" Juror 4, the only man still facing him, tersely responds, \"I have. Now sit down and don't open your mouth again.\" As Juror 10 moves to sit in a corner by himself, Juror 8 speaks quietly about the evils of prejudice, and the other jurors slowly resume their seats.When those remaining in favor of a guilty vote are pressed as to why they still maintain that there is no reasonable doubt, Juror 4 states his belief that despite all the other evidence that has been called into question, the fact remains that the woman who saw the murder from her bedroom window across the street (through the passing train) still stands as solid evidence. After he points this out, Juror 12 changes his vote back to \"guilty\", making the vote 8–4.Then Juror 9, after seeing Juror 4 rub his nose (which is being irritated by his glasses), realizes that, like Juror 4, the woman who allegedly saw the murder had impressions in the sides of her nose which she rubbed, indicating that she wore glasses, but did not wear them to court out of vanity. Juror 9 cannily asks Juror 4 if he wears his eyeglasses to sleep, and Juror 4 admits that he doesn't wear them – nobody does.[12] Juror 9 explains that there was thus no logical reason to expect that the witness happened to be wearing her glasses while trying to sleep, and he points out that on her own evidence the attack happened so swiftly that she wouldn't have had time to put them on. After he points this out, Jurors 12, 10 and 4 all change their vote to \"not guilty\".At this point, the only remaining juror with a guilty vote is Juror 3. Juror 3 gives a long and increasingly tortured string of arguments, ending with, \"Rotten kids, you work your life out—!\" This builds on a more emotionally ambivalent earlier revelation that his relationship with his own son is deeply strained, and his anger over this fact is the main reason that he wants the defendant to be guilty. Juror 3 finally loses his temper and tears up a photo of himself and his son, then suddenly breaks down crying and changes his vote to \"not guilty\", making the vote unanimous.As the jurors leave the room, Juror 8 helps the distraught Juror 3 with his coat in a show of compassion. The film ends when the friendly Jurors 8 (Davis) and 9 (McCardle) exchange names, and all of the jurors descend the courthouse steps to return to their individual lives.","edited_by":"Carl Lerner","budget":"$340,000[1][2]"}