{"Cast":"The cast of A Nightmare on Elm Street included a crew of veteran actors such as Robert Englund and John Saxon, as well as several aspiring young actors including Johnny Depp and Heather Langenkamp.The task of creating Krueger's disfigured face fell to makeup man David Miller, who based his creation on photographs of burn victims he obtained from the UCLA Medical Center.[10]","country":"United States","distributed_by":"New Line Cinema","Plot":"Tina Gray, a teenager, walks through a boiler room dressed in a nightgown. She is stalked and attacked by a disfigured man wearing a blade-fixed glove. She awakens from the nightmare, but her mother points out four mysterious slashes in her gown.The following morning, Tina is consoled by her friend Nancy and her boyfriend, Glen. Later, Nancy and Glen sleepover with Tina following her mother's out-of-town departure. The sleepover is interrupted by Tina's boyfriend Rod, who tries to have sex to reconcile after arguing. Falling asleep, she sees the man and runs. Awakened by Tina's thrashing, Rod witnesses her being fatally slashed by an unseen force. He flees as Nancy and Glen find Tina, mistakenly blaming Rod. Nancy tells her father, Lieutenant Don Thompson, of Tina's death.The next day, Rod proclaims innocence to Nancy, but Don arrests him. At school, Nancy falls asleep in class and finds the man, calling himself Freddy Krueger, chasing her in the boiler room. Nancy burns her arm on a pipe and awakens in the middle of class, excusing herself. She notices the burn mark on her arm and is concerned. At home, Nancy falls asleep in the bathtub and nearly gets drowned by Freddy. Nancy goes to Rod, who tells her what happened to Tina, and Nancy believes Freddy is responsible for Tina's death.Nancy has Glen watch over her as she falls asleep. She tries to find Freddy and sees him preparing to kill Rod. He turns his attention on her; she runs and wakes up when her alarm clock goes off. Nancy and Glen go to the jail and discover Rod has been hanged in his cell by his bed sheet in an apparent suicide. At Rod's funeral, Nancy's parents become worried when she describes the man in her dreams. Her mother, Marge, takes her to a dream clinic. In her dream, Nancy is attacked again and grabs Freddy's hat. When the staff wake her up, she has a gash in her arm and she somehow has Freddy's hat with her.At home, Marge bars the windows and begins drinking heavily. Eventually, she tells Nancy that Freddy was a child murderer released on a technicality. In a form of vigilante justice, the parents in the neighborhood burned him alive. Realizing that Freddy desires revenge, Nancy convinces Glen to help her. She plans to take Freddy into the real world and set up booby traps in her house. Concerned over her influence, Glen's parents prevent the two from meeting. Glen falls asleep at their appointed hour, and Freddy kills him.Alone, Nancy puts her drunken mother to bed and convinces her father across the street to break into the house in twenty minutes. In her sleep, she locates Freddy at the last second and pulls him out of the dream. In the real world, Nancy runs from Freddy, who trips on the booby traps. She lights him on fire, locks him in the basement, and rushes to the door for help. The police arrive, and they realize Freddy has escaped the basement. In Marge's bedroom, they see a still-burning Freddy smother her. After Don puts out the fire, Freddy and Marge have vanished. Despite her father's words, Nancy believes she is still in danger.Freddy attacks Nancy once again. Realizing he is powered by his victim's fear, she calmly turns her back on him, reducing him to nothingness. She steps outside into a bright morning where all of her friends and mother are still alive. She gets into Glen's car to go to school when the top comes down and suddenly locks them in. As the car is driven uncontrollably down the street, Marge is grabbed through the window of their front door and is dragged through it to her apparent death.","a_nightmare_on_elm_street":"Theatrical release poster","language":"English","Themes":"Freddy exclusively attacks teenagers and his actions have been interpreted as symbolic of the often traumatic experiences of adolescence.[28] Nancy, like the archetypal teenager, experiences social anxiety and her relationships with her parents becomes very strained. Sexuality is present in Freudian images and is almost exclusively displayed in a threatening and mysterious context (e.g., Tina's death visually evokes a rape, Freddy's glove between Nancy's legs in the bath). The original script actually called for Krueger to be a child molester, rather than a child killer, before being murdered.[29]\"In Nightmare, all the adults are damaged: They're alcoholic, they're on pills, they're not around,\" Englund has observed. Blakley says the parents in the film \"verge on being villains.\" Englund adds: \"The adolescents have to wade through that, and Heather is the last girl standing. She lives. She defeats Freddy.\" Langenkamp agrees: \"Nightmare is a feminist movie, but I look at it more as a 'youth power' film.\"[19]","Reception":"A Nightmare on Elm Street premiered in the United States with a limited theatrical release on November 9, 1984, opening in 165 cinemas across the country.[2] Grossing $1,271,000 during its opening weekend, the film was considered an instant commercial success. The film eventually earned a total of $25,504,513 at the American box office.[2] Additionally, A Nightmare on Elm Street was released in Europe, Canada and Australia.[33]In a contemporary review, Kim Newman wrote in the Monthly Film Bulletin that A Nightmare on Elm Street was closer to a Stephen King adaptation with its small-town setting, and \"invented monster myth\".[1] Newman concluded that the film found \"Craven emerging from the his recent career slump (Swamp Thing, The Hills Have Eyes Part 2, Invitation to Hell) with a fine, perhaps definitive bogeyman to back him up.\" and that the film was \"a superior example of an over-worked genre\".[1] Paul Attanasio of the Washington Post praised the film, stating that \"for such a low-budget movie, Nightmare on Elm Street is extraordinarily polished. The script is consistently witty, the camera work (by cinematographer Jacques Haitkin) is crisp and expressive.\"[34] The review stated praised it as superior work in the slasher film, noting that \"the genre has built-in limitations [...] but Craven faces the challenge admirably; \"A Nightmare on Elm Street\" is half-way between an exploitation flick and classic surrealism\". The review also commented on Freddy Krueger, calling him \"the most chilling figure in the genre since \"The Shape\" made his debut in \"Halloween\".\"[34] Variety commented that the film was \"a highly imaginative horror film\" praising the special effects while finding that the film \"fails to tie up his thematic threads satisfyingly at the conclusion.\".[35]The review commented negatively on some of the scenes involving Nancy's family, noting that \"the movie's worst scenes involve Nancy and her alcoholic mother\"[34] Newman also noted on the character development stating that \"the impression that about two hundred pages worth of characterisation has been compressed into cliché details like boozy Ronee Blakley demonstrating her renewed self-respect by throwing away a half-full bottle.\"[1] Newman noted that the nightmares in the film worked against itself, stating that \"while the kissing telephone and bottomless bathtub are disorienting in the [David] Cronenberg spirit, they get in the way of the relentless, pursuing-monster aspect that Carpenter manages so well.\"[1]Author Ian Conrich praised the film's ability to rupture \"the boundaries between the imaginary and real\",[36] and critic James Berardinelli said it toys with audience perceptions.[9] Kelly Bulkeley interpreted the overriding theme as a social subtext, \"the struggles of adolescents in American society\".[37]The film has a 94% approval rating based on 47 reviews on Rotten Tomatoes[38] and is considered one of the best films of 1984 by Filmsite.org.[39] It ranked at #17 on Bravo's 100 Scariest Movie Moments (2004), a five-hour program that selected cinema's scariest moments. In 2003, Freddy Krueger was named the 40th greatest film villain on American Film Institute's 100 Years... 100 Heroes and Villains.[40] In 2008, Empire ranked A Nightmare on Elm Street 162nd on their list of The 500 Greatest Movies of All Time.[41] It also was selected by The New York Times as one of The Best 1000 Movies Ever Made.[42]American Film Institute recognition","box_office":"$25.5 million[2]","cinematography":"Jacques Haitkin","directed_by":"Wes Craven","Remakes":"In 2010, a remake was released, also titled A Nightmare on Elm Street, starring Jackie Earle Haley as Freddy Krueger. The film was produced by Michael Bay, and directed by Samuel Bayer and written by the team of Wesley Strick and Eric Heisserer. The film is also a reboot to the franchise.On August 7, 2015, it was reported that New Line Cinema are developing a second remake with Orphan writer David Leslie Johnson.[45]","production_companies":"New Line Cinema Media Home Entertainment Smart Egg Pictures[1]","release_dates":"November 9, 1984 (1984-11-09)|||||","Production":"A Nightmare on Elm Street contains many biographical elements, taking inspiration from director Wes Craven's childhood.[12] The basis of the film was inspired by several newspaper articles printed in the LA Times in the 1970s on a group of Khmer refugees, who, after fleeing to the United States from the results of American bombing in Cambodia, were suffering disturbing nightmares, after which they refused to sleep. Some of the men died in their sleep soon after. Medical authorities called the phenomenon Asian Death Syndrome. The condition itself afflicted only men between the ages of 19 and 57 and is believed to be sudden unexplained death syndrome or Brugada syndrome, or both.[13] The 1970s pop song \"Dream Weaver\" by Gary Wright sealed the story for Craven, giving him not only an artistic setting to \"jump off\" from, but a synthesizer riff from the Elm Street soundtrack as well.[14] Craven has also stated that he drew some inspiration for the film from Eastern religions.[15]Other sources also attribute the inspiration for the film to be a 1968 student film project made by students of Craven's at Clarkson University. The student film parodied contemporary horror films, and was filmed along Elm Street in Potsdam, New York[16][17] (the town in the film was named Madstop—Potsdam spelled backwards).[18]The film's villain, Freddy Krueger, draws heavily from Craven's early life. One night, a young Craven saw an elderly man walking on the sidepath outside the window of his home. The man stopped to glance at a startled Craven and walked off. This served as the inspiration for Krueger.[12] Initially, Fred Krueger was intended to be a child molester, but Craven eventually characterized him as a child murderer to avoid being accused of exploiting a spate of highly publicized child molestation cases that occurred in California around the time of production of the film.[10]By Craven's account, his own adolescent experiences led to the naming of Freddy Krueger. He had been bullied at school by a child named Fred Krueger, and he named his villain accordingly.[10] Additionally, Craven had done the same in his earlier film The Last House on the Left (1972), where the villain's name was shortened to \"Krug\". The colored sweater he chose for his villain was based on the DC Comics character Plastic Man, and Craven chose to make Krueger's sweater red and green, after reading an article in Scientific American in 1982 that said the two most clashing colors to the human retina were this particular combination.[11]Craven strove to make Krueger different from other horror-film villains of the era. \"A lot of the killers were wearing masks: Leatherface, Michael Myers, Jason,\" he recalled in 2014. \"I wanted my villain to have a 'mask,' but be able to talk and taunt and threaten. So I thought of him being burned and scarred.\" He also felt the killer should use something other than a knife, which was too common. \"So I thought, How about a glove with steak knives? I gave the idea to our special-effects guy, Jim Doyle.\" Ultimately two models of the glove were built: one called the \"hero glove\" used only whenever anything needs to be cut, and the other a stunt glove less likely to cause injury.[19]Wes Craven began writing A Nightmare on Elm Street's screenplay around 1981, after he had finished production on Swamp Thing (1982). He pitched it to several studios, but each one of them rejected it for different reasons. The first studio to show interest was Walt Disney Productions, although they wanted Craven to tone down the content to make it suitable for children and pre-teens. Craven declined.[10][11] Another early suitor was Paramount Pictures; however the studios passed on the project due to Nightmare on Elm Street's similarity to Dreamscape (1984), a film they were producing at the time. Universal Studios also passed; Craven, who was in desperate personal and financial straits during this period, later framed their rejection letter on the wall of his office.[19]Finally, the fledgling and independent New Line Cinema corporation—which had up to that point only distributed films, rather than making its own—gave the project the go-ahead.[10] During filming, New Line's distribution deal for the film fell through and for two weeks it was unable to pay its cast and crew. Although New Line has gone on to make much bigger and more profitable films, Nightmare holds such an important place in the company's history that the studio is often referred to as \"The House That Freddy Built\".[20] In fact, much of the successful application filed by producer Robert Shaye for a public offering of New Line's stock centered around the Nightmare franchise, because it provided a Hollywood rarity of large profits that could also be regularly counted on by the company.Actor David Warner was originally slated to play Freddy.[21] Make-up tests were done,[22] but he had to drop out due to scheduling conflicts. Replacing him was difficult at first. \"I couldn’t find an actor to play Freddy Krueger with the sense of ferocity I was seeking,\" Craven recalled on the film's 30th anniversary. \"Everyone was too quiet, too compassionate towards children. Then Robert Englund auditioned. [He] wasn’t as tall I’d hoped, and he had baby fat on his face, but he impressed me with his willingness to go to the dark places in his mind. Robert understood Freddy.\"[19]To get that understanding, Englund had darkened his lower eyelids with cigarette ash on his way to the audition and slicked his hair back. \"I looked strange. I sat there and listened to Wes talk. He was tall and preppy and erudite. I posed a bit, like Klaus Kinski, and that was the audition,\" he said later. He took the part because it was the only project that fit his schedule during the hiatus between the V miniseries and series.[19]Craven said he wanted someone very \"non-Hollywood\" for the role of Nancy, and he believed Langenkamp met this quality.[12] Langenkamp, before becoming an actress, worked as a newspaper copy girl, and saw an advertisement for extras needed on The Outsiders earlier that year, which was being shot in Tulsa. She did not get the part, but it encouraged her to take time off from her studies at Stanford and continue acting.[19] Eventually she landed the role of Nancy Thompson after an open audition, beating out more than 200 actresses including Demi Moore, Courteney Cox, Tracey Gold, and Jennifer Grey.[23] Langenkamp returned as Nancy in A Nightmare on Elm Street 3: Dream Warriors (1987), and also played herself in Wes Craven's New Nightmare (1994).Johnny Depp was another unknown when he was cast; he initially went to accompany a friend (Jackie Earle Haley, who went on to play Freddy in the 2010 remake) so he could audition, yet eventually got the part of Glen.[12] Glen Lantz's epic death in this movie is paid homage to by a flashback in Freddy vs. Jason and Depp gets his own nod in a cameo role in Freddy's Dead: The Final Nightmare as a guy on TV.[24] Craven's daughters picked Depp's headshot from the set he showed them.[19] Other actors such as Charlie Sheen (who wanted too much money[19]), John Cusack, Kiefer Sutherland, Nicolas Cage, and C. Thomas Howell were considered.[citation needed]According to Shaye, all the film's original investors backed out at one point or another during pre-production. The original budget was merely $700,000. \"It ended up at $1.1 million ... Half the funding came from a Yugoslavian guy who had a girlfriend he wanted in movies.\"[19]Principal photography began in June 1984 in several locations throughout Los Angeles, California. The fictional address of the house that appears in the film is 1428 Elm Street in Springwood, Ohio. The actual house is a private home located in Los Angeles on 1428 North Genesee Avenue.[25] During production, over 500 gallons of fake blood were used for the special effects production.[26] For the famous blood geyser sequence, the filmmakers used the same revolving room set that was used for Tina's death.They put the set so that it was upside down and attached the camera so that it looked like the room was right side up, then they poured gallons of red water into the room, because the normal film blood would not make the right effect for the geyser. During the filming of this scene, the blood poured in an unexpected way causing the rotating room to spin. Much of the blood spilled out of the bedroom window covering Craven and Langenkamp.[27] The scene where Nancy is attacked by Krueger in her bathtub was accomplished with a special bottomless tub. The tub was put in a bathroom set that was built over a swimming pool. During the underwater sequence Heather Langenkamp was replaced with a stuntwoman. The \"melting staircase\" as seen in Nancy's dream was Robert Shaye's idea; it was created using pancake mix.[27]Jsu Garcia, who was credited as Rod under the name \"Nick Corri\", says the production was difficult for him. He had recently come off a period of homelessness, and was still dealing with the depression from that by snorting heroin in the bathroom between takes. In 2014, he revealed that he was high on that drug during the scene between him and Langenkamp in his jail cell. \"His eyes were watery and they weren’t focused,\" Langenkamp said. \"I thought, Wow, he’s giving the best performance of his life.\"[19]A scene from Sam Raimi's The Evil Dead appears on a television when Nancy is trying to stay awake about halfway through. This was in response to Raimi featuring a Hills Have Eyes poster in the film. Craven was so impressed that he included it on the TV, and in return a Freddy Krueger glove was featured in the tool shed in Evil Dead II: Dead by Dawn.[citation needed]Wes Craven originally planned for the film to have a more evocative ending: Nancy kills Krueger by ceasing to believe in him, then awakes to discover that everything that happened in the film was an elongated nightmare. However, New Line leader Robert Shaye demanded a twist ending, in which Krueger disappears and the film all appears to have been a dream, only for the audience to discover that they are watching a dream-within-a-dream-within-a-dream, where Fred reappears as a car that \"kidnaps\" Nancy and her friends, followed by Fred reaching through a window on the front door to pull Nancy's mother inside.[27] Both a happy ending and a twist ending were filmed, but the final film used the twist ending. As a result, Craven (who never wanted the film to be an ongoing franchise), dropped out of working on the first sequel, Freddy's Revenge (1985).[27] Production wrapped in July, and was rushed to get it ready for its November release.","Distribution":"The film was first introduced to the home video market by Media Home Entertainment in early 1985 and was eventually released on Laserdisc. It has since been released on DVD, first in 1999 in the United States as part of the Nightmare on Elm Street Collection box set (along with the other six sequels), and once again in Restored \"Infinifilm\" Special Edition in 2006, containing various special features with contributions from Wes Craven, Heather Langenkamp, John Saxon and the director of photography.The Special Edition consisted of 2 DVDs, one with the film picture and sound restored (DTS 5.1, Dolby Digital 5.1 and original mono audio track) and another DVD with special features. Along with the restored version of the film, DVD 1 also had 2 commentaries, other nightmares (if not all) from the film's sequels (2–7 & Freddy Vs. Jason). It also included additional, extended or alternate scenes of the film, such as one scene where Marge reveals to Nancy that she had another sibling that was killed by Freddy. These unused clips/scenes were not included/added in the film but could be viewed separately from the DVD's Menus.The film's distribution rights were transferred to Warner Bros. in 2008. On April 13, 2010, the film was released on Blu-ray Disc by Warner Home Video,[30] with all the same extras from the 2006 Special Edition included on the Blu-ray release.[31] A new DVD box set containing all of the films up to that point was released on the same day.[32]","produced_by":"Robert Shaye","starring":"John Saxon|Ronee Blakley|Heather Langenkamp|Amanda Wyss|Nick Corri|Johnny Depp|Robert Englund|","running_time":"91 minutes","music_by":"Charles Bernstein","edited_by":"Patrick McMahon Rick Shaine","written_by":"Wes Craven","budget":"$1.8 million"}