{"country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Seven years after escaping Guantanamo Bay, best friends and roommates Harold Lee and Kumar Patel have gone their separate ways. Harold has given up smoking cannabis, become a successful business man on Wall Street and married his Latina girlfriend Maria. Kumar on the other hand is poor, and still lives in the messy apartment he once shared with Harold. Kumar has recently been dumped by his girlfriend Vanessa, who arrives at Kumar's apartment to inform him that she is pregnant with his child. Maria's father and Harold's father-in-law, Mr. Perez, decides to stay at Harold and Maria's house for the Christmas holiday. Mr. Perez, who doesn't like Harold, also brings over his prized Christmas tree that he has been growing for eight years, and gives Harold a short lecture about the tree's importance. Kumar receives a package with Harold's name on it at his apartment, and decides to deliver it to Harold. At Harold's house, they discover the item inside is a large marijuana joint.Kumar lights it up, but Harold throws it out of the window, only for it to magically land in the tree, and burn it down. Harold learns that Kumar's new friend Adrian is attending a party with a Fraser Fir Christmas tree, and promises to drive him to the party on the condition that he can have the tree. Harold, Kumar, Adrian, and Harold's new best friend Todd, arrive at the party, where a girl named Mary attempts to seduce Harold. It turns out that Mary is the daughter of a Russian mob kingpin named Sergei Katsov who sends two of his men to kill Harold and Kumar, believing that they were trying to rape his daughter. The duo make it out of the building, without the Christmas tree, and run into their friends, Rosenberg and Goldstein, for the first time in years. Harold and Kumar plan to steal a tree from a church, but end up participating in a Christmas show featuring Neil Patrick Harris, who they thought had died after being shot outside a Texas whorehouse seven years ago. Harris reveals that he did die but Jesus Christ kicked him out of Heaven. Harris hooks the pair up with a Christmas tree, and a Wafflebot, before sending them off.The two make their way to Harold's house to put up the tree, but end up being kidnapped by two of Katsov's men, and are saved by Wafflebot. After accidentally shooting Santa Claus in the head, Kumar gives him emergency surgery. In exchange for saving his life, Santa agrees to fly them back home in his sleigh, and reveals that he sent the package to reunite the friends. Harold arrives home to encounter Mr. Perez, who is angered when he discovers his Christmas tree is gone. Harold finally stands up to him, explaining that he may not be the perfect son-in-law, but he is the perfect guy for Maria. Mr. Perez says that he always knew Harold was a nice guy, he just wanted to make sure that he had \"cojones\" before accepting him into his family. Harold and Kumar rekindle their friendship, Kumar and Vanessa rekindle their romance, and Kumar tells Vanessa that he will re-take the exams to become a doctor for the sake of their child. Maria discovers that she is pregnant on Christmas morning and that Santa has left a replacement tree in their lounge. Harold decides to smoke weed again, and he and Kumar share a joint again for the first time. The film ends with Santa smoking a bong while riding his sleigh.","language":"English","Reception":"During its first weekend, the film opened at third place behind Puss in Boots and Tower Heist, grossing approximately $13.1 million and underperforming its prediction of $18 million.[11] At the end of its box office run, the film has earned a total of $35,061,031 in North America and $326,181 in other territories, for a worldwide total of $35,387,212 against a budget of $19 million.[3]A Very Harold & Kumar Christmas received generally positive reviews. On Rotten Tomatoes, the film has a rating of 68%, based on 128 reviews, with a rating average of 6.1/10. The site's critical consensus reads, \"Still raunchy, still irreverent, and still hit-and-miss, this Harold & Kumar outing also has a Christmas miracle: The audience gets to see the sweeter side of the duo.\"[12] Metacritic, which assigns a weighted average score to reviews from mainstream critics, gives the film a score of 61 out of 100, based on 29 critics, indicating \"generally favorable reviews\".[13] CinemaScore polls reported that the average grade moviegoers gave the film was a \"B\" on an A+ to F scale.[11]Roger Ebert of the Chicago Sun-Times gave the film 2.5 out of 4 stars, saying \"It's not that I was particularly offended; it's that I didn't laugh very much.\"[14]A Very Harold & Kumar 3D Christmas was released on DVD and Blu-ray Disc on February 7, 2012. The film was released on Blu-ray Disc in two versions: firstly, Single-Disc Blu-ray and DVD combo and secondly, Movie-Only Edition.[15] As of February 3, 2015, the film has sold 344,002 DVDs and 160,042 Blu-ray Discs totaling a gross of $6,649,425 and $4,855,462 respectively for a total gross of $11,504,887 in North America.[16]","box_office":"$35.4 million[3]","a_very_harold_&_kumar_3d_christmas":"Theatrical release poster","cinematography":"Michael Barrett","production_company":"New Line Cinema Mandate Pictures Kingsgate Films","directed_by":"Todd Strauss-Schulson","release_dates":"November 4, 2011 (2011-11-04)|||||","Production":"In April 2009, Kal Penn accepted the position of Associate Director of the White House Office of Public Liaison in the Obama administration; when asked if his new job would mean no more Harold and Kumar films, he said, \"That's probably true for now.\"[4] However, A Very Harold & Kumar Christmas was announced on May 7, 2009, for release on December 5, 2010 at the earliest and possibly deferred to the 2011 holiday season.[5] Jon Hurwitz and Hayden Schlossberg returned to write the film while Todd Strauss-Schulson directed and Greg Shapiro returned as producer.[6][7] Penn left his job with the White House on June 1, 2010 to reprise his role as Kumar in the third Harold & Kumar installment.[8]Filming took place in Detroit, Michigan, then Los Angeles and New York City from June to August 2010, with the use of Panavision Genesis and Element Technica 3D Rig. The film was released in RealD 3D on November 4, 2011. Animators of Laika created the clay animation scene.After filming was completed, Penn returned to the White House.[9] Cho and Penn went on a tour to promote the film in different college towns. At each stop they had a bus hand out \"munchies\".[10]","produced_by":"Greg Shapiro","starring":"John Cho|Kal Penn|Neil Patrick Harris|Danneel Harris|Paula Garcés|Danny Trejo|Amir Blumenfeld|","running_time":"89 minutes[1]","music_by":"William Ross","edited_by":"Eric Kissack","written_by":"Jon Hurwitz|Hayden Schlossberg|","budget":"$19 million[2]"}