{"based_on":"The Ballad of Cat Ballou (novel) by Roy Chanslor","Cast":"Cast notes","country":"United States","distributed_by":"Columbia Pictures","Plot":"Catherine Ballou (Jane Fonda), who wants to be a schoolteacher, is returning home by train to Wolf City, Wyoming, to the ranch of her father, Frankie Ballou (John Marley). On the way, she unwittingly helps accused cattle rustler Clay Boone (Michael Callan) elude his captor, Sheriff Maledon (Bruce Cabot), when Boone's Uncle Jed (Dwayne Hickman), a drunkard disguised as a preacher, distracts the lawman.At the ranch, she learns that the Wolf City Development Corporation is scheming to take the ranch from her father, whose sole defender is his ranch hand, an educated Native American, Jackson Two-Bears (Tom Nardini). Clay and Jed appear and reluctantly offer to help Catherine, and she hires legendary gunfighter Kid Shelleen (Lee Marvin) to help protect her father from gunslinger Tim Strawn (also played by Lee Marvin), the hired killer who is threatening him.Shelleen arrives, a drunken bum whose pants fall down when he draws his gun, and who is unable to hit a barn when he shoots. Strawn kills Frankie, and when the townspeople refuse to bring Strawn to justice, Catherine becomes a revenge-seeking outlaw known as Cat Ballou. She and her gang rob a train carrying the Wolf City payroll, then take refuge in \"Hole-in-the-Wall\", where desperados go to hide from the law, but are thrown out when it is learned what they have done, since Hole-in-the-Wall can only continue to exist on the sufferance of Wolf City. Shelleen, inspired by his love for Cat, works himself into shape, dresses up in his finest gunfighting outfit, and goes into town to kill Strawn, casually revealing later that Strawn is his brother. In a humorous scene, Shelleen enters the funeral parlor where Frankie's body is resting, and sings \"Happy Birthday\" before blowing out the candles.Cat poses as a prostitute and confronts Sir Harry Percival (Reginald Denny), the head of the Wolf City Development Corporation. A struggle ensues, Sir Harry is killed, and Cat is sentenced to be hanged on the gallows. With Sir Harry dead, there's no hope for Wolf City's future, and the townspeople have no mercy for Cat. As the noose is placed around her neck, Uncle Jed appears, again dressed as a preacher, and cuts the rope just as the trapdoor is opened. Cat falls through and onto a wagon and her gang spirits her away in a daring rescue.","language":"English","Reception":"Although the film received mixed reviews, it was popular with moviegoers and earned $20 million in ticket sales in 1965, making it one of the top ten moneymaking movies that year.[2]","box_office":"$20,666,667[1][2]","cinematography":"Jack A. Marta","production_company":"Harold Hecht Productions","directed_by":"Elliot Silverstein","Awards and honors":"Lee Marvin awards wonIn his Oscar acceptance speech, Lee Marvin concluded by saying, \"I think, though, that half of this belongs to a horse somewhere out in San Fernando Valley,\" a reference to the horse Kid Shelleen rode, which appeared to be as drunk as Shelleen was.[5]Academy Award nominationsAmerican Film Institute recognitionIn June 2008, AFI revealed its \"Ten top Ten\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. Cat Ballou was acknowledged as the tenth best film in the Western genre.[9][10]","release_dates":"June 24, 1965 (US)","produced_by":"Harold Hecht","starring":"Jane Fonda Lee Marvin Michael Callan Dwayne Hickman Nat King Cole Stubby Kaye","running_time":"97 minutes","music_by":"Frank De Vol (score) Mack David (songs) Jerry Livingston (songs)","External links":"","edited_by":"Charles Nelson","cat_ballou":"theatrical release poster","written_by":"Walter Newman Frank Pierson"}