{"country":"Denmark","Plot":"Lars (Thure Lindhardt) leaves the Danish army after anonymous accusations of having made passes at some of his men prevent his promotion to a higher rank. Disillusioned, and angry at his overbearing social democrat politician mother, he falls in with a Neo-Nazi group and, after initial uncertainty, joins and is taken up as a promising new recruit. Lars then discovers the Nazis are homophobic as well as racist and practice gay-bashing. He and his homophobic peer Jimmy (David Dencik) become comrades then friends, moving from hostility through grudging admiration to friendship and finally a secret love affair of tenderness and passion.Jimmy's emotionally unstable younger brother Patrick (Morten Holst) is already jealous that newcomer Lars quickly advanced above him in the pecking order within the Nazi group, discovers their relationship. Tormented and angry, he informs on them to Michael (Nicolas Bro), Leader of the Nazi group. The whole group seek out Lars, and force Jimmy at knifepoint to beat Lars viciously. But after the vicious attack Jimmy stays with Lars and takes him to the isolated Nazi safe house they had been sharing. The two resolve to leave the Brotherhood and escape, but just as they are hastily packing the car to flee, a gay man whom Jimmy had beaten savagely in a Nazi group queer-bashing expedition, shown in the movie's opening scene, emerges from the dark and stabs him.The movie ends with Jimmy lying unconscious in a hospital bed, Lars holding his hand, their fates unclear.","language":"Danish","cinematography":"Laust Trier-Mørch","directed_by":"Nicolo Donato","Awards":"In 2009 Broderskab won the award for Best Film at the International Rome Film Festival.[2]Brotherhood won the 2012 \"Berlin's Favourite Award\" at the Favourites Film Festival in Berlin.[3]","release_dates":"October 21, 2009 (2009-10-21) (Rome Film Festival)|April 8, 2010 (2010-04-08) (Denmark)||||","produced_by":"Per Holst Barbara Crone","starring":"Thure Lindhardt David Dencik","running_time":"101 minutes[1]","music_by":"Simon Brenting Jesper Mechlenburg","edited_by":"Bodil Kjærhauge","written_by":"Rasmus Birch Nicolo Donato"}