{"based_on":"A Walk Among the Tombstones  by Lawrence Block","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Scott Frank","Plot":"In 1991, Detective Matthew Scudder (Liam Neeson) is in a car with his partner. He then enters a bar and gets two shots of alcohol and a cup of coffee. Two masked men then come in and kill the bartender, prompting Matt to take his gun and fire at them. He runs into the street and shoots one man down. The second man and a third drive away. Matt shoots the driver while the final man flees. Matt shoots him in the thigh and follows him down some steps and kills him.Eight years later, a junkie named Peter (Boyd Holbrook) approaches Matt, now a recovering alcoholic, and asks him to help his brother Kenny Kristo (Dan Stevens), a drug trafficker whose wife Carrie was kidnapped and then murdered, despite Kenny paying the ransom fee. Kenny offers Matt $20,000 to find the kidnappers. At first, Matt rejects the offer, but the next day Kenny shows up outside Matt's apartment to plead with him. Upon getting a phone call from the kidnappers, Kenny tried to haggle the ransom price from $1,000,000 to $400,000. The kidnappers agreed and after giving Kenny the runaround, told him his wife was waiting for him in a car in Red Hook. When Kenny gets to the car, all he finds are packages which resemble bags of powdered drugs but are in fact filled with his dismembered wife.Matt looks around Red Hook and determines that the kidnappers were most likely involved with the DEA. All the people he asks say they saw a van and two men close to where Carrie was last seen. Every person Matt asks gives him a different name of what was written on the van, since the two men keep repainting the van. Matt goes to the library to find articles on similar killings. He reads two articles on victims named Marie Gotteskind and Leila Anderssen. Behind him is a street kid named TJ (Brian \"Astro\" Bradley). Matt asks him for help with looking for other articles. Together, they learn that a leg was found in a dumpster by a florist, while other bags filled with body parts were in the pond of a cemetery. Matt goes to the cemetery to speak with the groundskeeper, Jonas Loogan (Olafur Darri Olafsson). He had repressed the memory of finding the dead woman in all those bags, and is upset when Matt brings it up.Matt goes to talk to Leila's fiancé Reuben (Mark Consuelos) in his apartment and asks him about the last time he saw Leila. Reuben says he witnessed two men drag her into a van, driven by a third person. Matt also suspects Reuben of being a drug trafficker. Matt looks out the window and sees Jonas exiting an apartment building across from their apartment. He goes to that building and finds cage of pigeons and a shed at the top that belongs to Jonas. In it is a page of a book he was writing, along with pictures of Reuben and Leila having sex. Jonas admits that he was the driver when he and the two men kidnapped Leila. He did not like that she was doing drugs with Reuben, so he conspired with the two men to take her away from there and keep her safe. Instead, they had Jonas drive to a spot where he witnessed the main kidnapper torture her. That is when Jonas fled the scene. Jonas feeds his birds and gives Matt one name (Ray) before he jumps off the roof to his death.We meet the two kidnappers, Ray and Albert (David Harbour and Adam David Thompson), in their home. They drive by the home of another drug trafficker, Yuri Landau (Sebastian Roche). After realizing Yuri's wife is bedridden, they prepare to leave and look for a new target, but then they see Yuri's 14-year-old daughter Ludmilla (a.k.a. Lucia (Danielle Rose Russell)), walking her dog. Ray decides to take Lucia later that night.Matt goes to a store and asks the owner about Marie Gotteskind. Matt later goes to an apartment where he is struck by the owner and his son since they have apparently been repeatedly accused of killing her. It is revealed that the store is a front for their drug operation and that Gotteskind was a DEA agent trying to infiltrate their organization. The next day, Matt is followed by a man coming out of a van with East Village Plumbing Supply written on it, similar to the one the kidnappers were driving. Matt finds out the man is a DEA agent with his partners. They take Matt in a van and drop him off after he asks them about Marie and gets no answers.Later that night, during a conversation with TJ, Matt explains why he stopped being a cop. Matt reveals that during the shootout (from the opening scene), one of the bullets accidentally struck a 7-year-old girl in the eye, killing her. Kenny finds Matt and brings him to the Landau home where the kidnappers have called and are demanding a ransom for Lucia. Yuri answers and tries to negotiate, but Matt takes the phone from him and tells Ray that they will not get a cent if Lucia is harmed. After Ray proves that the girl is safe, they arrange a drop. Matt calls TJ and asks him to go to his place and get a box, and to give it to Peter. TJ and Peter bring the box to the Landau home.The group all goes to the cemetery to meet with the kidnappers. After a brief stand off, Lucia is returned to her father with severely injured fingers. Albert realizes the money is counterfeit and yells to Ray. Matt then shoots Ray twice in the chest, but Ray is saved by his bulletproof vest. Peter is shot and killed and Matt is able to shoot Ray in his side, wounding him. Both Albert and Ray are able to escape in their van.After the gunfight, it is revealed that TJ had snuck into the back of the kidnappers' van and followed them to their home. He gets the street name and lets Matt know. In their house, Albert strangles Ray with a garrote in the basement. He goes back upstairs to eat when Matt, Kenny, and TJ come into the house. Matt cuffs Albert to a pipe and leaves him to Kenny. Matt sends TJ back to his place in a cab. Kenny whacks Albert in the head with a bottle and goes downstairs to find Ray. Albert is able to free himself. Matt decides to go back inside and finish the job, remembering the 12 Steps he heard at an AA meeting. He finds Kenny's dismembered corpse downstairs. Albert attacks Matt and they fight for a short while, before Matt is able to shoot Albert in the head.Matt returns home to find TJ sleeping on the couch. He spots a drawing that TJ made of himself as a superhero. Matt sits down and slowly closes his eyes.","a_walk_among_the_tombstones":"Theatrical release poster","language":"English","Reception":"A Walk Among the Tombstones grossed $26.3 million in North America and $32.5 million in other territories for a total gross of $58.8 million, against its $28 million budget.[2]The film earned $428,000 from Thursday night from 1,918 theaters, and $4.7 million from 2,712 theaters on its opening day.[10][11] It debuted at number two at the box office on its opening weekend earning $13.1 million behind The Maze Runner ($32.5 million).[12]A Walk Among the Tombstones received mixed to positive reviews from critics. On Rotten Tomatoes, the film holds a rating of 65%, based on 144 reviews, with an average rating of 6.2/10. The site's consensus reads, \"A Walk Among the Tombstones doesn't entirely transcend its genre clichés, but it does offer Liam Neeson one of his more compelling roles in recent memory, and that's often enough.\"[13] On Metacritic, the film has a score of 57 out of 100, based on 36 critics, indicating \"mixed or average reviews\".[14]Richard Roeper gave the film a B+ rating, calling the film \"a stylish and smart thriller\".[15] Manohla Dargis in The New York Times called it \"one of those rare cinematic offerings: intelligent pulp\" but also noted that the film \"can be tough to watch, particularly its fleeting images of tortured women\".[16] In Variety, Andrew Barker found it a well-made thriller \"with a good deal of panache and style\".[17]","box_office":"$58.8 million[2]","cinematography":"Mihai Mălaimare Jr.","production_company":"Cross Creek Pictures Endgame Entertainment 1984 Private Defense Contractors Exclusive Media Jersey Films Double Feature Films","directed_by":"Scott Frank","release_dates":"September 19, 2014 (2014-09-19)|||||","Development":"A film adaptation of Lawrence Block’s novel had been in development for several years with a script from Scott Frank. In 2002, Harrison Ford was attached to star and D. J. Caruso to direct.[3] In May 2012, Liam Neeson had reportedly signed on to play Matthew Scudder in the film, with Frank himself directing and production slated to begin February 2013.[4]Filming began on March 3, 2013 in New York City.[5] Producers invited author Block to the set to watch filming. On the casting of Neeson, Block said, \"Readers often ask who'd be my ideal Matt Scudder, and I usually change the subject. But now it's safe to tell you that, ever since I saw him in Michael Collins, Neeson has been up at the top of my personal Scudder wish list. I couldn't be happier about either the star or the writer/director, both of them genuine artists and brilliant professionals. My book's in good hands.\"[6]The film was completed on October 8, 2013 and classified by the MPAA as rated R for \"strong violence, disturbing images, language, and brief nudity\".[7] On October 18, 2013, Block tweeted that he had seen the film and revealed producers were aiming for a September 2014 release.[8] On January 30, 2014, it was announced the film would be released on September 19, 2014.[9]","produced_by":"Danny DeVito|Michael Shamberg|Stacey Sher|Brian Oliver|Tobin Armbrust|","starring":"Liam Neeson|Dan Stevens|David Harbour|Brian Bradley|Boyd Holbrook|","running_time":"114 minutes[1]","music_by":"Carlos Rafael Rivera","edited_by":"Jill Savitt","budget":"$28 million[2]"}