{"country":"United Kingdom","distributed_by":"Eros Films","Plot":"Successful mystery novelist Janet Frobisher, who has been separated for years from her husband, a man with a criminal past, lives in an isolated home in England. Her nearest neighbour is nosy veterinarian Dr. Henderson. Janet falls in love and occasionally dabbles with her secretary Chris' fiancé, Larry, who is years younger than she. When her estranged husband unexpectedly appears, Janet poisons him by administering horse medication given to her by her neighbour. One of the deceased man's criminal cohorts arrives as she's preparing to dispose of the body in the local lake. When Frobisher's secretary and Larry arrive at the secluded house, the mysterious man, who has assisted her with her scheme, impersonates the long-absent spouse of Janet, who plots to get rid of her unplanned accomplice, as well.","language":"English","Critical reception":"The New York Times described the film as \"a garrulous but occasionally interesting excursion into murder and unrequited love . . . the script . . . is basically a static affair that rarely escapes from its sets or the scenarist's verbosity. Suspense is only fitfully generated and then quickly dissipated . . . Gary Merrill contributes a thoroughly seasoned and convincing portrayal . . . Emlyn Williams adds a professionally polished characterization . . . and Anthony Steel and Barbara Murray are adequate . . . However, Another Man's Poison is strictly Bette Davis' meat. She is permitted a wide latitude of histrionics in delineating the designing neurotic who is as flinty a killer as any we've seen in the recent past.\"[2]In his review in New Statesman and Nation, Frank Hauser wrote, \"No one has ever accused Bette Davis of failing to rise to a good script; what this film shows is how far she can go to meet a bad one.\"[3]","cinematography":"Robert Krasker","production_company":"Angel Productions","directed_by":"Irving Rapper","Production notes":"Of the project, star Bette Davis recalled, \"We had nothing but script trouble. Gary [Merrill] and I often wondered why we agreed to make this film after we got started working on it. Emlyn [Williams] rewrote many scenes for us, which gave it some plausibility, but we never cured the basic ills of the story.\"[1]This was the second on-screen pairing of then-married couple Davis and Gary Merrill, following All About Eve the previous year.Rapper, who was selected by Davis to helm the film, had directed her in Now, Voyager ten years earlier.Co-star and script doctor Emlyn Williams wrote the original play on which Davis' 1945 film The Corn Is Green was based.Exteriors of the United Artists release were filmed on location in Malham, North Yorkshire, and interiors were shot at the Nettlefold Studios in Walton-on-Thames, Surrey.","release_dates":"20 November 1951 (1951-11-20)","produced_by":"Daniel M. Angel Douglas Fairbanks Jr.","starring":"Bette Davis Gary Merrill Emlyn Williams Anthony Steel Barbara Murray","running_time":"90 minutes","music_by":"John Greenwood Paul Sawtell","edited_by":"Gordon Hales","another_man's_poison":"Original poster","written_by":"Val Guest"}