{"country":"United States","distributed_by":"Universal Pictures","Plot":"Jim Dodge (Frank Whaley) is a self-proclaimed \"people person\" and dreamer who is perceived as lazy and good for nothing. After being fired from numerous low-paying jobs, Jim is given the choice by his father, Bud Dodge (John M. Jackson), to either land a job at the local Target or be put on a bus to St. Louis.Jim is hired as night cleanup boy at Target. On his first shift at his new job, Jim is locked alone in the store by his boss, the head custodian, who leaves him there until his shift ends at 7 am. He encounters Josie McClellan (Jennifer Connelly), a stereotypical \"spoiled rich girl\" who he has known all his life from school, though they were worlds apart. Josie had spent the past several hours asleep in a dressing room after backing out of shoplifting some merchandise in a half-hearted attempt to run away from her abusive father, Roger Roy McClellan (Noble Willingham). Josie and Jim begin to connect with each other, realizing they are not so different, and Josie convinces Jim to run away with her. They begin to form a romantic relationship, and proceed to enjoy the freedom of having such a large store to themselves. Josie, having $52,000 in her purse, convinces Jim to run away with her to California as soon as they get out of Target in the morning. Meanwhile, Roger teams up with the town sheriff to search for his runaway daughter all night.Things become complicated when two incompetent crooks, Nestor Pyle and Gil Kinney (brothers Dermot and Kieran Mulroney, respectively), break into Target and hold the two hostage. Eventually, Josie seduces one of the crooks and convinces him to take her with them after robbing the store. While the criminals are loading stolen merchandise into the trunk, Josie jumps into the front seat and drives away quickly, leaving the two men stranded in the parking lot. Meanwhile, in the building, Jim loads up a shotgun found in the head custodian's locker and tricks Nestor and Gil by luring them to the back of the store and holding them at gunpoint.In the morning, the sheriff arrives at Target and stumbles upon the two crooks, having been tied up by Jim. After making a pit stop in town in a limousine in order to impress the townsfolk, Jim and Josie run away to Hollywood and the film ends with a shot of the two lounging leisurely poolside in Los Angeles.","language":"English","Reception":"Career Opportunities was a modest success at the time of its release making $11,336,986 in the North American market.[1]Rotten Tomatoes gives the film a score of 38% based on reviews from 16 critics.[2]","box_office":"$11.3 million","cinematography":"Donald McAlpine","production_company":"Hughes Entertainment","directed_by":"Bryan Gordon","release_dates":"March 29, 1991 (1991-03-29)|||||","produced_by":"John Hughes Hunt Lowry","starring":"Frank Whaley|Jennifer Connelly|Dermot Mulroney|","running_time":"83 minutes","career_opportunities":"Theatrical release poster","music_by":"Thomas Newman","edited_by":"Glenn Farr Peck Prior","written_by":"John Hughes"}