{"country":"United States Poland","Plot":"The film depicts a Jewish boy (Haley Joel Osment) who is hidden from the occupying Germans by posing as the Catholic nephew of a local farmer (Olaf Lubaszenko), with the aid of a compassionate priest (Willem Dafoe).","language":"English","cinematography":"Paweł Edelman","directed_by":"Yurek Bogayevicz","Release History":"The film was first released in theatres in 2001, in Poland. In 2002, it had theatrical releases in Spain, the Czech Republic, Japan, Italy, Portugal and Hong Kong. In the Czech Republic, it was shown at the Febio Film Festival. Other theatrical releases included Kazakhstan, in 2007 and Belgium, in 2008, among other countries. The film had direct-to-DVD releases in Sweden (2002) and the United States (2005).[5] The 2005 release of the film in the United States, by its distributor, Miramax/Buuna Vista, was subject to cricicism for delay.[3]","Awards":"The film won the award for Best Screenplay (by Yurek Bogayevicz, who also directed the film) at the 2001 Polish Film Festival.[4] The film was also nominated for six awards at the 2002 Polish Film Awards: Best Film, Best Supporting Actress (Olga Frycz), Best Director (Yurek Bogayevicz), Best Screenplay (Yurek Bogayevicz), Best Cinematography (Pawel Edelman) and Best Costume Design (Jagna Janicka)[4]","release_dates":"October 12, 2001 (2001-10-12)","produced_by":"Zev Braun","starring":"Haley Joel Osment Willem Dafoe Richard Banel Liam Hess Olaf Lubaszenko","running_time":"95 minutes","edges_of_the_lord":"DVD cover","Critical Reception":"The film was not widely reviewed, and the published reviews were mixed. Haley Joel Osment was described by one reviewer as having an \"unusual emotional depth\" in the film, where he \"emotionally centers the film, with a balanced, thoughtful portrait\". This reviewer also correctly predicted that because the film was shot in English, with many of the actors speaking with Polish accents, it would quickly go to video and TV.[1] David Nusair described the film as \"a fairly decent set-up that's entirely squandered by Bogayevicz, with the filmmaker's apparent inability to develop these characters beyond their most superficial attributes surely playing a key role in the movie's ultimate (and colossal) downfall.\"[2] Reviewer John J. Puccio described the film as \"a movie that starts grimly, lightens up slightly, and then gets very gloomy, indeed.\"[3]","music_by":"Jan A.P. Kaczmarek","written_by":"Yurek Bogayevicz"}