{"Cast":"\"Mondo Condo\" (directed by John Landis):\"Pethouse Video\" (directed by Carl Gottlieb):\"Murray in Videoland\" (directed by Robert K. Weiss):\"Hospital\" (directed by Landis):\"Hairlooming\" (directed by Joe Dante):\"Amazon Women on the Moon\" (directed by Weiss):\"Blacks Without Soul\" (directed by Landis):\"Two I.D.s\" (directed by Peter Horton):\"Bullshit or Not\" (directed by Dante):\"Critics' Corner\" (directed by Dante):\"Silly Pâté\" (directed by Weiss):\"Roast Your Loved One\" (directed by Dante):\"Video Pirates\" (directed by Weiss):\"Son of the Invisible Man\" (directed by Gottlieb):\"French Ventriloquist's Dummy\" (directed by Dante):\"Art Sale\" (directed by Gottlieb):\"First Lady of the Evening\" (directed by Weiss):\"Titan Man\" (directed by Weiss):\"Video Date\" (directed by Landis):\"Reckless Youth\" (directed by Dante):","country":"United States","distributed_by":"Universal Pictures","Plot":"Fictional television station WIDB-TV (channel 8) experiences problems with its late-night airing of science-fiction classic Amazon Women on the Moon, a 1950s B movie in which Queen Lara (Sybil Danning) and Captain Nelson (Steve Forrest) battle exploding volcanoes and man-eating spiders on the moon. Waiting for the film to resume, an unseen viewer begins channel surfing—simulated by bursts of white noise—through late night cable, with the various segments and sketches of the film representing the programming found on different channels. The viewer intermittently returns to channel 8, where Amazon Women continues to resume airing before faltering once more.These segments feature:An alternate version of the \"Pethouse Video\" sketch was filmed for the television broadcast of the film, with Monique Gabrielle in lingerie instead of appearing naked throughout the segment. However, most European television broadcasts of the film retained the original theatrical version. Bullshit or Not? was retitled Baloney or Not? for the television version.The American television edit, in addition to the alternative \"Pethouse Video\" sketch, features an additional bridging sequence between the death of Harvey Pitnik and his subsequent celebrity roast. In it, the mortician successfully cons Pitnik's widow into having the celebrity roast as part of the funeral, and her performance gets such strong positive feedback, it becomes a continuing performance series lasting for weeks.The DVD release features an unreleased sketch titled \"The Unknown Soldier\", starring Robert Loggia. Some television broadcasts of the film featured the sketches \"Peter Pan Theater\" and \"The French Ventriloquist's Dummy\", which were not present in the theatrical version.","amazon_women_on_the_moon":"Theatrical release poster","language":"English","Critical reception":"The majority of critical opinion agreed that the quality was inconsistent throughout the film. Variety called it \"irreverent, vulgar and silly... [with] some hilarious moments and some real groaners too.\"[2] Roger Ebert in the Chicago Sun-Times felt that the exercise was somewhat unnecessary: \"Satirists are in trouble when their subjects are funnier than they are.\"[3]Janet Maslin of the New York Times, in a largely positive review, described the film as \"an anarchic, often hilarious adventure in dial-spinning, a collection of brief skits and wacko parodies that are sometimes quite clever, though they're just as often happily sophomoric, too.\"[4]Certain portions of the film were singled out for praise. \"The funniest episode probably is 'Son of the Invisible Man', directed by Carl Gottlieb, in which Ed Begley, Jr. plays a man who thinks he is invisible but is not\", wrote the Chicago Sun-Times.[3] \"The film's best sight gags come from Robert K. Weiss, who deserves kudos for the inspired idiocy of his Amazon Women segments\", was the opinion of the New York Times.[4]In a retrospective article for Entertainment Weekly, Chris Nashawaty called this film \"the beginning of the end of Landis' career\". He cited the episodes featuring Monique Gabrielle, Archie Hahn, Ed Begley, Jr. and David Alan Grier as \"inspired\", but criticised others for their failure: \"You'll never see Michelle Pfeiffer look as trapped as she does in her skit with thirtysomething's Peter Horton, or Joe Pantoliano and Arsenio Hall as unfunny as they are in their skits.\"[5]Amazon Women on the Moon has a rating of 60% on Rotten Tomatoes, based on 15 reviews, indicating a mixed critical response.[6]","box_office":"$548,696","cinematography":"Daniel Pearl","directed_by":"Joe Dante Carl Gottlieb Peter Horton John Landis Robert K. Weiss","release_dates":"September 18, 1987 (1987-09-18)|||||","produced_by":"John Landis Robert K. Weiss","starring":"Rosanna Arquette|Paul Bartel|Ralph Bellamy|Carrie Fisher|Sybil Danning|Griffin Dunne|Steve Forrest|Monique Gabrielle|Steve Allen|Steve Guttenberg|Arsenio Hall|Howard Hesseman|Lou Jacobi|Ed Begley, Jr.|Russ Meyer|Kelly Preston|Henny Youngman|B.B. King|","running_time":"85 minutes","music_by":"Ira Newborn","edited_by":"Malcolm Campbell","written_by":"Michael Barrie Jim Muholland","budget":"$5 million"}