{"dead_man_on_campus":"Theatrical release poster","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Michael Traeger Mike White","story_by":"Anthony Abrams Adam Larson Broder","Plot":"Josh (Tom Everett Scott) gets in to college on a scholarship, and Cooper (Mark-Paul Gosselaar) is assigned as his roommate. Cooper does little work and instead spends all the time partying and consistently fails his course, but his father continues to pay his tuition. The normally studious Josh is led astray by Cooper's lifestyle and spends the first half of his first semester partying instead of studying, and consequently flunks all of his mid-terms. To his horror he then finds out that a condition of his scholarship is a passing grade average each semester, and that with his poor mid-term score he needs an A+++ (which is impossible) in all of his courses or he will lose his scholarship.Meanwhile, Cooper's father finally realizes Cooper is not trying to pass his course at all and threatens to pull his funding if he does not get a passing grade this semester, leaving him in a similar position. They find out about an obscure academic rule that states that if a student's roommate commits suicide then the roommates get perfect grades for that semester, regardless of any previous academic standing. They set out to find roommates who are likely to commit suicide; their first potential roommate, Cliff O'Malley (Lochlyn Munro), is more likely to get himself (and any one with him) killed than commit suicide. They soon realize that he will likely get them killed or arrested and jump out of his moving car when he is being chased by the police.Next they try Buckley Schrank (Randy Pearlstein), a computer geek who thinks Bill Gates wants his brain. After they move Buckley in, they try to help push him over the edge. First, Cooper poses as a suicide hotline volunteer, and when Buckley calls, he tells him that he is Bill Gates and wants his brain. Then, Cooper buys equipment that may assist in a suicide (rope, daggers, prescription drugs) and as he and Josh are trying to plant the items around the dorm room, Buckley discovers the pair hiding from him with a noose and knife in hand. Buckley, who thinks that they're trying to kill him, and that the conspiracy to kill him and steal his brain is real, runs away.Finally, Josh and Cooper move in Matt Noonan (Corey Page), a moody rock musician who talks about the futility of life. Later, Cooper catches him singing show tunes and learns he was voted Mr. Happy in high school, leading them to believe that he is only pretending to be depressed to impress girls and make a name for himself in music.Facing the loss of his scholarship, Josh stands on the edge of a bridge, about to commit suicide himself. Cooper tells Josh he is not a failure and talks him down. When Josh comes down from the bridge he reveals to Cooper that he was faking his suicide attempt so the school would not fail him, and Cooper would look like a hero to his father. The film ends with Josh narrating that he was given an additional semester to improve his grades, in which he saved his scholarship, and that Cooper became a more serious student, but did work summers cleaning toilets for his father's business to learn how to eventually take over.","language":"English","Reception":"Dead Man on Campus received negative reviews from critics. The movie has a 15% rating on the aggregate film review site Rotten Tomatoes based on 46 reviews.[1] The New York Times said the film was \"predictably dumb\", but praised Mark-Paul Gosselaar's performance, saying, \"Mr. Gosselaar is so good, however, that his performance as Cooper sometimes overrides the film's adolescent tone.\"[2] The film was made on a $14 million budget, and grossed $15,064,946 domestically, barely turning a profit at the box office.[3] The movie has since gone out of print.","box_office":"$15,064,946","cinematography":"John A. Thomas","production_company":"MTV Productions Pacific Western","directed_by":"Alan Cohn","Filming Location":"Scenes were shot on the campus of University of the Pacific (Stockton, California), Modesto's 7th Street Bridge, and outside the campus of University of Southern California.","release_dates":"August 21, 1998 (1998-08-21)|||||","produced_by":"Gale Anne Hurd","starring":"Mark-Paul Gosselaar Tom Everett Scott","running_time":"96 minutes","music_by":"Mark Mothersbaugh","edited_by":"Debra Chiate","budget":"$14 million"}