{"country":"Iran France","Plot":"Nogreh, a Pakistani immigrant in Kabul, Afghanistan begins covertly attending an all girls school against her father's wishes. Nogreh is one of the few girls at the school who dreams of one day becoming president. While searching for water one day after school she comes across several truckloads of Pakistani refugees and helps them resettle in the ruins she calls home. However the number of refugees overwhelms the shelter where her family have been living and they are eventually forced out by several other families. They manage to find shelter in an abandoned airplane but this too is eventually overcrowded by refugees.Nogreh meets a refugee among the ruins who is a poet. She asks him if he knows whether the president of Pakistan is a man or a woman and he, like everyone else, does not know. However after befriending Nogreh and learning of her ambitions to be president he helps procure political speeches and goes with her to a photographer to get photos of her that she can use to campaign.Nogreh's father learns from some of the Pakistan refugees that his son has died. Unwilling to tell his daughter-in-law he moves the family further into the desert where his grandson dies of starvation and malnourishment.In the desert they meet an old man who is waiting by his donkey who is dying of hunger and thirst. The man had been trying to get to the city to speak on behalf of Osama Bin Laden to try to prevent him from being given to the Americans. Nogreh's father informs him he is too late and that the Americans have already invaded. After Nogreh's father buries his grandson the family continues on into the desert.","language":"Dari Persian","cinematography":"Ebrahim Ghafori Samira Makhmalbaf","directed_by":"Samira Makhmalbaf","release_dates":"16 May 2003 (Cannes) 16 April 2004 (UK)","Development":"At Five in the Afternoon was the first film to be shot in Kabul after the NATO invasion. It was an international co-production between the Iranian company Makhmalbaf Productions and the French companies Bac Films and Wild Bunch.Makhmalbaf had difficulty finding an actress willing to play the lead character. Her original choice for the role would not allow her face to appear on camera.[2]Samira's 14-year-old sister Hana Makhmalbaf made a documentary about the making of the film, entitled Joy of Madness (Lezate divanegi). It documents Samira's trials and tribulations whilst trying to persuade people in Kabul to take part in her film. As a teenager, Hana was able to amass a lot of digital video footage unnoticed.","produced_by":"Siamak Alagheband Mohsen Makhmalbaf","starring":"Agheleh Rezaie Abdolgani Yousefrazi Razi Mohebi Marzieh Amiri","running_time":"105 minutes","music_by":"Mohammad Reza Darvishi","External links":"","edited_by":"Mohsen Makhmalbaf","written_by":"Mohsen Makhmalbaf Samira Makhmalbaf"}