{"based_on":"Cloudy with a Chance of Meatballs  by Judi and Ron Barrett","country":"United States","distributed_by":"Columbia Pictures","Plot":"Flint Lockwood is a wannabe-scientist who lives in Swallow Falls, a tiny island in the middle of the Atlantic Ocean that has sardines as the base of its economy. Flint lives with Tim, his widowed technophobic father who misunderstands his son's talent, and his pet monkey, Steve. Despite Flint's zealous enthusiasm, his inventions, including spray-on shoes, a remote controlled television, rat birds, hair-un-balder, and a flying car, all ended in failure. Flint states that his dream was to help his hometown and that Swallow Falls used to be famous for sardines until the popular Baby Brent Sardine cannery went out of business permanently.Flint then invents a machine that transforms water into food, called the \"Flint Lockwood Diatonic Super Mutating Dynamic Food Replicator\" (FLDSMDFR). Flint turns on the FLDSMDFR in his laboratory, but ends up overloading the house's electrical supply. He then decides to power the machine by hooking it up to a nearby power plant. When he turns the machine back on, it ends up rocketing through town, causing various damage, ultimately shooting up into the sky. While recovering from his failure, Flint meets Samantha \"Sam\" Sparks, a weather intern whose big break was foiled by Flint's actions. Their conversation is cut short when rainbow colored clouds float over the town and begin to rain cheeseburgers.The town rejoices in their renewed food choices, and Flint creates a communication device to send orders to the machine and order it to create different types of food. Swallow Falls (now renamed Chewandswallow) suddenly becomes a successful \"food tourism\" destination. Everything is going well until the townsfolk start greedily requesting food from Flint's machine. Flint notices that the food is beginning to grow larger in size. Although he is concerned that the food is starting to \"over mutate\", the now morbidly obese mayor sees it as profitable for him and the city, and guilts Flint into continuing to make food rain.Citizens and worldly tourists in Chewandswallow are blissful until suddenly a large tornado formed of spaghetti and meatballs threatens the town. Flint rushes to his lab to turn the FLDSMDFR off and attempts to send a \"kill code\" to stop the machine, but the mayor destroys the communication device by throwing a giant radish at it before he can do it. With Flint unable to control the machine, a massive food storm is created which threatens the world. When Flint's father encourages him to fix the mess, Flint gains self-confidence, places the kill code in a USB flash drive, and builds a new flying car to reach and deactivate the FLDSMDFR, with the aid of Sam, her cameraman Manny, Steve and Brent (namesake of the Baby Brent Sardine cannery).As they approach the machine in the sky, they find that it is now at the core of a giant meatball, where clouds go in the top and a food hurricane goes out the bottom. The machine sends sentient food to attack them. In the chaos, the flash drive with the kill code is sucked by the wind out the window.Back at Chewandswallow, the citizens and tourists escape while the last leftovers fall. Mt. Leftovers collapses, causing an avalanche of food that destroys the town. Despite the avalanche ravaging Flint's Lab, Tim manages to re-send the kill code to Flint's cell phone from there. Flint then goes inside the meatball, finds the machine, and connects the phone to a port. To his dismay, Flint discovers that Tim sent him the wrong file, so he is unable to stop the FLDSMDFR. Flint then gets an idea and uses his Spray-On Shoes formula on the machine, causing it to explode. With the machine destroyed, the food storm subsides and everyone is able to return safely to Chewandswallow. Tim finally shows his appreciation for his son and his inventions before Flint and Sam celebrate with a kiss. Meanwhile, the obese mayor is seen stranded in the middle of the sea, having eaten nearly all of his peanut butter and jelly sandwich boat, while muttering that his plans were not well thought out.","language":"English","Reception":"The film received positive reviews from critics. Review aggregator Rotten Tomatoes reports that 87% of critics gave positive reviews based on 138 reviews with an average rating of 7.3/10. The consensus statement reads, \"Quirky humor, plucky characters and solid slapstick make this family comedy a frenetically tasty time at the movies.\"[13] Another review aggretator, Metacritic, which normalizes a rating from mainstream critics, gave the film an approval rating of 66 based on 24 reviews.[14]Ernest Hardy of LA Weekly stated the film \"is smart, insightful on a host of relationship dynamics, and filled with fast-paced action\". Hardy also applauded the 3-D effects which \"are wonderful, full of witty sight gags that play out both center-screen and on the periphery\".[15] Michael Phillips of the Chicago Tribune gave the film a mixed review stating that \"Crazy doesn't always equal funny, and the gigantism of this 3-D offering's second half puts a damper on your enjoyment. But look: This film wasn't made for you, or me. It was made for dangerously, easily distracted 9-year-olds.\"[16] Kyle Smith of the New York Post gave the film two stars stating that the animated film \"greatly expands on the kids' book on which it's based in a clever and engaging first half. But the second half leaves a foul aftertaste.\"[17] Animator John Kricfalusi, known for his generally negative opinions on modern animation, did a review of the film on his blog, saying that \"It was an optimistic portent of what could be. It's basically an undirected film—but one that allowed many of the artists to take nothing scenes and add some kind of cleverness, design and action to the formulaic events being told by the story.\"[18]Cloudy with a Chance of Meatballs earned a total of $243 million on a reported budget of $100 million. Of the gross, 51%, or $124,870,275, came from the domestic market, while the rest, $118,135,851, from other territories.[1] For the film's marketing, Sony spent $43.3 million in the United States, and $26 million in other countries.[19] The film earned $8,137,358 on its opening Friday, and ranked #1 at the box office with a total of $30.3 million for the first weekend.[20] On its second weekend, it remained at #1 with a decrease of only 17%.[21] It currently holds the record for third largest-opening weekend in the month of September.[1]","cloudy_with_a_chance_of_meatballs":"Theatrical release poster","box_office":"$243 million[1]","Expanded franchise":"A sequel, titled Cloudy with a Chance of Meatballs 2, was released on September 27, 2013. Directed by Cody Cameron and Kris Pearn, and it is based on an original idea, where Flint and his friends must again save the world from the food machine, this time producing living food beasts.[27] Most of the main cast reprised their roles, with Terry Crews replacing Mr. T. New cast also includes Kristen Schaal as orangutan Barb, and Will Forte in his new role of Chester V.[28]On October 9, 2014, DHX Media announced that it will develop and produce a television series based on the film franchise, titled Cloudy with a Chance of Meatballs: The Series.[29] The series will be traditionally animated and will consist of 26 22-minute episodes.[29] It will take place before the first film, showing Flint Lockwood as a high school student who dreams to become a serious scientist.[29] In his adventures, he will be joined by Sam Sparks, a new girl in town and the school's \"wannabe\" reporter, along with Flint's dad Tim, Steve the Monkey, Manny as the head of the school's audiovisual club, Earl as a school gym teacher, Brent as a baby wear model, and mayor Shelbourne.[29] DHX Media will handle the global television and non-US home entertainment distribution, along with worldwide merchandising rights, while Sony will distribute home entertainment in the US.[29] The series was commissioned by Teletoon in Canada, and will be broadcast on the Boomerang channel in other territories.[30]","production_company":"Sony Pictures Animation","directed_by":"Phil Lord Christopher Miller","Music":"Cloudy with a Chance of Meatballs is a soundtrack to the film of the same name, released under Sony Pictures Entertainment on September 15, 2009. The music of the film and this album are both credited to be composed and produced by American composer Mark Mothersbaugh.All music composed by Mark Mothersbaugh, except where noted.","release_dates":"September 18, 2009 (2009-09-18)|||||","Production":"On May 9, 2003, a year after establishment, Sony Pictures Animation announced its first animated slate, including Cloudy with a Chance of Meatballs, a film adaptation of the book. The Brizzi brothers were brought to direct the film, with Wayne Rice adapting the screenplay.[2] In 2006, it was reported that the film had been helmed by new directors and writers, Phil Lord and Christopher Miller.[3] On September 18, 2008, Variety announced that Bill Hader and Anna Faris had signed on to voice the two lead characters, with James Caan, Bruce Campbell, Mr. T, Andy Samberg, Neil Patrick Harris, Bobb'e J. Thompson, Benjamin Bratt, Al Roker, Lauren Graham and Will Forte also in the voice cast.[4] Co-writers and co-directors Phil Lord and Christopher Miller said later that year that it would be a homage to, and a parody of, disaster films such as Twister, Armageddon, The Core, and The Day After Tomorrow.[5] Cloudy with a Chance of Meatballs is the second film (after Monster House) made using animation rendering software Arnold[6] and the open source image toolkit OpenImageIO.[7]","produced_by":"Pam Marsden","starring":"Bill Hader Anna Faris James Caan Andy Samberg Bruce Campbell Bobb'e J. Thompson Mr. T Benjamin Bratt Neil Patrick Harris","running_time":"90 minutes","music_by":"Mark Mothersbaugh","edited_by":"Robert Fisher Jr.","Release":"The film was released on DVD, Blu-ray and PSP UMD on January 5, 2010 in the United States and Canada.[8][9] A 3D Blu-ray was released on June 22, 2010. It was the first 3D Blu-ray sold individually in the United States.[10]In August 2009, Insight Editions published a companion book to the film called The Art and Making of Cloudy with a Chance of Meatballs.[11][12]","written_by":"Phil Lord Christopher Miller","budget":"$100 million[1]"}