{"country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Charles Edward Pogue","story_by":"Charles Edward Pogue Russell Rouse Clarence Greene","Plot":"A man staggers into the police station to report a murder. When the desk sergeant asks who was murdered, he answers: \"I was.\"That man is Professor Dexter Cornell (Dennis Quaid), who then sits down to video-tape his account.Thirty-six hours previously, Cornell is on campus. He is a college professor, was once a promising writer, made his name and is secure in his tenure, but he has spent the last four years going though the motions and playing it safe. \"Publish or perish\" is the contrasting rule of university politics and Cornell helps his friend Hal Petersham (Daniel Stern) with his first book.While he is in his office, a promising student, Nick Lang (Robert Knepper), jumps off a building right outside his office in an apparent suicide. This, coupled with the depressing Christmas season, unseasonably hot weather and the divorce papers given to him by his wife Gail (Jane Kaczmarek) leads Cornell to seek out the local bars for a night of drinking. There he meets admiring student Sydney Fuller (Meg Ryan) and they proceed to get drunk.The next morning, Cornell, feeling his sickness is more than just a hangover, stops by the campus medical clinic for a checkup. After running some tests, they discover that he has been poisoned and has 36 hours to live. An incredulous Cornell staggers out to try to make sense of it all.Aided by Fuller, whom he kidnaps by super-gluing himself to her arm, he attempts to recreate the events of the previous night hoping to discover who could have murdered him. The list of suspects includes his wife, who is also the victim of a murder, which the police make half-hearted efforts to pin on Cornell.It is learned that Lang was not a suicide but was also murdered. Cornell also suspects Lang's mentor Mrs. Fitzwaring (Charlotte Rampling), Bernard (Christopher Neame) the Fitzwarings' chauffeur and Graham Corey (Jay Patterson), a jealous co-worker.In the end, at the police station, Cornell has solved the crime. His friend Hal had read and was impressed with Nick Lang's manuscript that he decided to kill Nick and steal the novel for himself. However, this involved killing anyone who knew that Nick was the original author, including Dexter. After a scuffle, Dexter shoots Hal who then falls out his office window. Dexter resigns himself to his fate.","language":"English","Reception":"D.O.A. opened to mixed reviews and currently has a rating of 61% on Rotten Tomatoes. Film critic Roger Ebert called it a \"witty and literate thriller\",[1] while Caryn James of The New York Times called it \"one of the season's biggest disappointments\".[2]The movie debuted strongly, despite its poor reviews, at No.3 at the US box office.[3]","box_office":"$12,706,478","cinematography":"Yuri Neyman","production_company":"Touchstone Pictures Silver Screen Partners III","directed_by":"Annabel Jankel Rocky Morton","d.o.a.":"Theatrical release poster","release_dates":"March 18, 1988 (1988-03-18)|||||","produced_by":"Ian Sander Laura Ziskin","starring":"Dennis Quaid|Meg Ryan|Daniel Stern|Charlotte Rampling|","running_time":"96 minutes","music_by":"Chaz Jankel","edited_by":"Raja Gosnell Michael R. Miller","budget":"$29 million"}