{"baby's_day_out":"Theatrical release poster","country":"United States","distributed_by":"20th Century Fox","Plot":"Bennington Austin \"Bink\" Cotwell IV (Adam and Jacob Worton), a mischievous baby who lives in a huge mansion with his family, is just about to appear in the social pages of the newspaper. Three criminals, Eddie, Norby, and Veeko, pose as the photographers and kidnap him, demanding a ransom. After the kidnapping, however, they have difficulty controlling him. While trying to get Bink to fall asleep, Norby does so reading Bink's book titled \"Baby's Day Out\", leaving him unattended. Looking through it, Bink notices a bird on the page and then one by the open window. He follows it out and successfully gets away from his kidnappers, with Eddie falling off the building and into a garbage bin while chasing after him through the rooftop.The FBI arrives at the mansion, headed by Dale Grissom (Fred Thompson), where they try to piece together clues along with Bink's parents and his loving nanny, Gilbertine (Cynthia Nixon).Bink follows the story of his book by exploring the city and visiting the same locations in the same order. He crawls onto a bus, goes inside a department store and is briefly mistaken for having escaped from the care centre, stows away in a taxi and goes to the zoo, where he ends up inside a cage with a protective gorilla, and eventually a construction site. All the while, the kidnappers pursue him all over, but are unable to catch him. When they end up stuck inside the construction site after its closure for the day, they decide to give up and go home. Bink next visits the Old Soldiers' Home, where the veterans recognize him as the missing baby.Bink's parents are notified by the FBI of various sightings of him in the city and Gilbertine deduces that he has been following the happenings of his favorite book and will most likely head for the Old Soldiers' Home next. Sure enough, they find him there, but on the way home, he begins to call out \"Boo-Boo\" toward the kidnappers' apartment. As the kidnappers contemplate such a humiliating defeat, they are horrified when the FBI moves in and arrests them after Grissom demands to throw down the book first.Back home, Bink is put to bed by his family. As his parents discuss having his picture taken by a normal photographer in the morning, he wakes up and gets ready to read another book, this one entitled Baby's Trip to China.","language":"English","Reception":"Baby's Day Out was panned by critics, and holds a 21% \"rotten\" approval rating at the review website Rotten Tomatoes, with 3 positive reviews from 14.[2]On the Siskel & Ebert show, critic Roger Ebert wrote that \"'Baby's Day Out' contains gags that might have worked in a Baby Herman cartoon, but in live action, with real people, taxis, buses, streets, and a real baby, they're just not funny. The Worton twins are adorable as Baby Bink, however; the audience produced an audible coo the first time they saw him on the screen.\" He gave the film 1 1/2 stars.[3]His partner, Gene Siskel, however, liked the film because he thought that young children would love it for the humor. Hal Hinson, writing for the Washington Post, wrote: \"The pace is quick and efficient but never frantic...almost everything in the picture is just right, including the two-bit crooks who abduct the superhero toddler and end up bruised and begging hilariously for mercy. Best of all, though, is the Binkman himself, whose tiny face is so expressive that he brings new meaning to the phrase 'conquering with a smile.'\"[4]The film opened with takings of $4,044,662 at the start of July 1994.[5][6][7] The film finally grossed $16,827,402 at the domestic box office, a disappointing return considering the $48 million production budget for the film. It ranked at #83 for the best performing films of 1994.[1]It was also the 26th best performing PG-rated family film of the year in 1994.[1]Baby's Day Out was tremendously popular in South Asia, including India, Pakistan and Bangladesh. In India the movie was played at the largest theater in Calcutta for over a year. Recalling a trip to Calcutta, Roger Ebert says, \"I asked if \"Star Wars\" had been their most successful American film. No, I was told, it was \"Baby's Day Out\"...\"[8] It was remade twice, first in Telugu in 1995 under the title Sisindri and then in Malayalam in 1999 under the title James Bond. It was dubbed in Tamil with the title Chutti Kuzhanthai meaning Naughty baby. It was also dubbed in Bengali and played at theaters in Bangladesh. It was also dubbed in Punjabi as a funny comedy in Pakistan.","box_office":"$16.8 million (domestic)[1]","cinematography":"Thomas E. Ackerman","production_company":"Hughes Entertainment","directed_by":"Patrick Read Johnson","Home media":"20th Century Fox Home Entertainment released the DVD on January 29, 2001.","Video game":"A video game version of the film was planned, completed, and slated to be released on Super Nintendo Entertainment System, Sega Genesis and Game Boy in October 1994,[9][10] but was cancelled at the last minute. Two prototypes of the Genesis port can be found for download on several ROM sites. One is a near completed version while the other is a very early beta. Instead of playing as Bink the player controls what appears to be Bink's guardian angel. The objective is to use it to guide Bink to safety away from the robber aka Pacman 2.","release_dates":"July 1, 1994 (1994-07-01)|||||","produced_by":"John Hughes Richard Vane","starring":"Adam Robert Worton Jacob Joseph Worton Lara Flynn Boyle Joe Mantegna Joe Pantoliano Brian Haley Cynthia Nixon Fred Dalton Thompson John Neville Matthew Glave","running_time":"99 minutes[1]","music_by":"Bruce Broughton","edited_by":"David Rawlins","written_by":"John Hughes","budget":"$48 million[1]"}