{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Elizabeth Halsey is an immoral, gold-digging Chicago-area middle school English teacher who curses at her students, drinks heavily, smokes marijuana, and shows movies while sleeping through class. She plans to quit teaching and marry her wealthy fiancé, Mark, but when he dumps her after learning she is only after his money, Elizabeth must resume her job. She tries to win over substitute teacher Scott Delacorte, who is also wealthy because his family runs a watch company. Amy Squirrel, a dedicated but overly enthusiastic colleague, also pursues Scott while the school's gym teacher, Russell Gettis, makes it clear that he is interested in Elizabeth romantically; she, however, is not interested in him because he's just a gym teacher.[3]Early in the film, Elizabeth plans to get surgery to enlarge her breasts, and becomes all the more motivated to do so once she learns Scott's ex-girlfriend had large breasts. However, when she tries to schedule an appointment for her breast surgery, she cannot afford the $9,300 procedure. To make things worse, Scott admits that he has a crush on Amy, and that he only likes Elizabeth as a friend. Elizabeth attempts to raise money for the surgery by participating in her 7th grade class car wash in provocative clothing and by manipulating parents to give her money for more school supplies and tutoring, but her efforts are not enough. Amy, acting on the growing resentment between them due to Elizabeth pursuing Scott and ignoring school rules, attempts to warn the principal about Elizabeth's embezzlement scheme, but he dismisses her claims as groundless.Elizabeth later learns from her best friend, Lynn Davies, that the teacher of the class with the highest state test scores will receive a $5,700 bonus. With this knowledge, Elizabeth decides to change her style of teaching, forcing the class to intensely read and study To Kill A Mockingbird for the upcoming test. However, the change is too late and insufficient. The students have terrible scores on their quizzes, frustrating her even more. Meanwhile, she befriends Russell the gym teacher as Amy and Scott start dating. Desperate to pay off the procedure for her breast surgery, Elizabeth steals the state test answers by disguising herself as a journalist and seducing Carl Halabi, a state official who is in charge of creating and distributing the exams. Elizabeth gets Carl drunk and convinces him to taker her to his office to have sex, but she spikes his drink and steals a copy of the answers. A month later, Elizabeth's class aces the test and she wins the bonus, giving her the funds needed to get her breasts enlarged.When Elizabeth learns that Amy and Scott are chaperoning an upcoming field trip, she smears an apple with poison ivy and leaves it for Amy, who ends up with her face breaking out in blisters, so she cannot go. On the trip, Elizabeth seduces Scott. They dry hump and Elizabeth secretly calls Amy using Scott's phone leaving a message recording all the action, ensuring she knows about the affair. However, Scott's peculiar behavior, which was subtly exposed by Russell, disappoints Elizabeth. Elizabeth later gives advice to one of her students who has an unrequited crush on the superficial Chase in class, which causes her to reflect on how she has been superficial as well. On a field trip the boy makes an embarrassing public confession of his love and is ridiculed by his classmates. Elizabeth takes him aside, gives him her bra, and tells everyone she caught him having sex with a student from another school, which erases his image as a loser.Left behind at the school, Amy switches Elizabeth's desk with her own to trick the janitor into unlocking Elizabeth's sealed drawer. Amy finds Elizabeth's journalist disguise and the practice test, which leads her to suspect Elizabeth cheated on the state exam. Amy informs the principal and gets Carl to testify against her. However, Elizabeth took embarrassing photos of Carl while he was drugged and, with the help of her roommate, Kirk, uses them to blackmail him to say she is innocent. Having failed to nail Elizabeth for cheating, Amy accuses her of drug use, based on a tip from a student. When the police arrive and bring their sniffer dog to search the school, they find Elizabeth's mini liquor bottles, marijuana and OxyContin pills in Amy's classroom, in a secret compartment in Elizabeth's desk which Elizabeth helpfully points out to the police. At the end of the school year, Amy is moved to the worst school in the county by the superintendent. Scott asks Elizabeth to start over, indicating that he now has a crush on her, but Elizabeth rejects him in favor of a relationship with Russell, who she has learned she has a lot in common with.When the new school year starts, Elizabeth has not gotten the breast enlargement after all, because she feels that she looks fine the way she is. She also has a new position as the school's guidance counselor.","language":"English","box_office":"$216.2 million[2]","cinematography":"Alar Kivilo","production_company":"Radar Pictures Mosaic Media Group","directed_by":"Jake Kasdan","bad_teacher":"Theatrical release poster","release_dates":"June 24, 2011 (2011-06-24) (United States)|||||","Production":"Bad Teacher is directed by Jake Kasdan based on a screenplay by Lee Eisenberg and Gene Stupnitsky. Columbia Pictures purchased Eisenberg and Stupnitsky's spec script in August 2008.[4] In May 2009, Kasdan was hired to direct Bad Teacher.[5] The following December, Cameron Diaz was cast in the film's lead role.[6] Justin Timberlake was cast opposite Diaz in March 2010, and filming began later in the month.[7]","produced_by":"Jimmy Miller David Householter","starring":"Cameron Diaz Justin Timberlake Lucy Punch John Michael Higgins Phyllis Smith Jason Segel","running_time":"92 minutes","Sequel and TV series":"On June 20, 2013, Sony announced that it was working on Bad Teacher 2. The company hired Justin Malen to write the sequel. Lee Eisenberg and Gene Stupnitsky, who wrote the first film, will return as producers. A release from Sony studios said the project is \"being developed for Cameron Diaz to star in the film but no deal is yet set with the actress\". Jake Kasdan will again be the director.[16]On May 23, 2013, CBS announced a TV series based on the movie to debut in the April television season, with CBS Studios and Sony Pictures Television as production partners. The show premiered on April 24, 2014 in the 9:30pm time slot.[17] Ari Graynor played the Cameron Diaz role,[18] while Sara Gilbert, Ryan Hansen, David Alan Grier, Kristin Davis and Sara Rodier also appeared. On May 10, 2014, CBS canceled Bad Teacher after airing only three episodes.[19] Bad Teacher last aired on May 22, 2014. However, in July of 2014, CBS aired the remaining unseen episodes by showing two episodes on Saturday nights.","music_by":"Michael Andrews","edited_by":"Tara Timpone","Release":"The film was released in North America on June 20, 2011 in 3,049 theaters. It took in $12,243,987—$4,016 per theater—in its opening day, and grossed a total of $31,603,106 in its opening weekend, finishing second at the box office, behind Cars 2.[2] In Germany, the film reached No. 1 on the country's Cinema Charts in its opening week after 496,000 people saw the film. This caused Kung Fu Panda 2, which reached No. 1 the week before, to fall to No. 2.[8] The film grossed $100.3 million in the U.S.A. and Canada while its worldwide total stands at $216.2 million.[2]Bad Teacher received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 44%, based on 178 reviews, with a rating average of 5.3/10. The site's critical consensus reads, \"In spite of a promising concept and a charmingly brazen performance from Cameron Diaz, Bad Teacher is never as funny as it should be.\"[9] Metacritic gave the film a score of 47 out of 100, based on 38 critics, indicating \"mixed or average reviews\".[10] CinemaScore polls reported that moviegoers gave the film an average grade of \"C+\" on an A+ to F scale.[1]Bad Teacher was released on DVD, Blu-ray, and a combo pack on October 18, 2011.[15]","written_by":"Lee Eisenberg Gene Stupnitsky","budget":"$20 million[1][2]"}