{"country":"United States","distributed_by":"United Artists","Plot":"Frankie (Gary Busey) and Patch (Robbie Robertson) are friends who work for the Great American Carnival, a small-time carnival that tours the South. Frankie does an act as The Mighty Bozo, a character who sits in a dunk tank insulting the crowd, while Patch takes the money, points out the next mark to milk of his money to the Bozo, and distributes the balls outside. Patch is also the show's \"adjuster,\" hence his carny name, working with the owner of the carnival, Heavy St. John (Kenneth McMillan) negotiating deals with local officials and representatives of the local underworld to keep the show open.What it takes to keep the show open varies from town to town. In one town, it's making good on a city official's losses gambling on the midway and giving a city councilor a pile of free passes to the carnival. In another, it's compromising to allow the strippers to work, but keeping the freak show closed. In a third, it involves providing an underworld boss's thug with a girl he fancies. He also works to maintain harmony among the carnies. Patch is good at his job of patching together the deals that keep the carnival rolling and keeping the peace on the lot, but never likes being played for a fool.At one stand Donna (Jodie Foster), a wayward bisexual 18-year-old bored with small town life, strikes up a friendship with Frankie and at his invitation follows the carny onto the carnival circuit. Patch is less than happy with her presence, and would like her out of the picture. To get Patch off her back, she takes a job with the cooch show as a \"side girl,\" a backup dancer who does not actually take her clothes off. Patch plants the suggestion with Delno, the carny who runs the girlie show, that Donna wants to \"work strong\"—be a stripper, in other words. When she is thrust onstage, she freezes and a brawl ensues. Afterwards, she covers with Heavy to keep Patch out of it, taking the blame for Patch's setting her up to fail herself.Frankie gets her a job in the string joint, one of the midway games of chance, under the tutelage of Gerta (Meg Foster). Coached in how the game works, Donna is a big success, learning how to con the marks and get their money without giving herself (which is what the rubes really want) to them. After one successful scamming, she winds up in bed with Patch and the two of them are caught in flagrante by Frankie, which puts a strain on his relationships with Patch and with Donna.While this is going on, a con run by Nails (Theodore Wilson) on Skeets, the local crime boss's main enforcer, goes badly wrong. Upset at losing their money, the local underworld's muscle boys wreck the Bozo Joint and kill On-Your-Mark (Elisha Cook), a carny who has been \"with it\" for more than fifty years and was planning to retire at the end of the season. Crime boss Marvin Dill (Bill McKinney) comes after the carnival intending to extort more money than they have already paid him. However, the carnies have had enough of his shaking them down. To avenge On-Your-Mark's death and get Dill off their backs, Patch, Frankie, Donna and Heavy run a scam on Mr. Dill involving the apparent beheading of Skeets. (They don't actually kill him, of course, but the effect used to terrify Dill and make him believe they did is simple and horrifyingly effective.)The movie ends with the Great American Carnival continuing on its way, with Donna her own woman rather than Frankie's girlfriend, Frankie and the Patch reconciled, and the implication that in a season or two Heavy will retire and Patch will be the one running the show.","language":"English","Reception":"Roger Ebert of the Chicago Sun-Times said, \"Carny is bursting with more information about American carnivals than it can contain, surrounding a plot too thin to support it. ...Inside this movie is a documentary struggling to get out.\"[1]","cinematography":"Harry Stradling, Jr.","production_company":"Lorimar Film Entertainment","directed_by":"Robert Kaylor","release_dates":"June 13, 1980 (1980-06-13)|||||","produced_by":"Robbie Robertson","starring":"Gary Busey Jodie Foster Robbie Robertson","running_time":"107 minutes","music_by":"Alex North","edited_by":"Stuart H. Pappé","written_by":"Phoebe Kaylor (story) Robert Kaylor (story) Robbie Robertson (story) Thomas Baum"}