{"Cast":"Randal Kleiser makes an uncredited cameo as a Popcorn Vendor.","country":"United States","distributed_by":"Paramount Pictures","Plot":"Pee-wee Herman has a dream of being a famous singer. He makes his exit by disguising himself as Abraham Lincoln. One of the fans asks him for his autograph, but his disguise is promptly exposed. They chase after him and he flies off to his ranch. Pee-wee finally awakens from his dream that morning to work on his farm with Vance the pig (Wayne White). Later, he has lunch with his fiancée, school teacher Winnie Johnson (Penelope Ann Miller). Next, he races Vance to a general store owned by Mr. Ryan (Albert Henderson) to order a cheese sandwich.The Sheriff (Kenneth Tobey) warns everyone of a large storm approaching town. After the storm ends, Pee-wee emerges from his storm shelter to discover that an entire traveling circus has been blown into his backyard. Befriended by Cabrini Circus manager Mace Montana (Kris Kristofferson), Pee-wee is hoping to impress Gina Piccolapupula (Valeria Golino), a trapeze artist and the circus' star attraction, thereby incurring the jealousy of his relationship with Winnie until she meets Gina's older brothers, the Piccolapupula Brothers. Gina leaves Pee-wee when she finds out about Winnie, but later returns to him when she realizes that Pee-wee actually loves her.Pee-wee wants to join the circus, but his attempts fail. Gina then tells Pee-wee about her deceased father Papa Piccolapupula who was a famous aerialist who suffered a fall performing the Spiral of Death. Gina states that Pee-wee should try walking the tightrope in his honor.Mace comes up with a brilliant idea: to stage a three-ring spectacular saluting the American Farm. The problem is that the majority of the town's residents are careless elderly people who have been demanding the circus Pee-wee is helping leave town.The Sheriff and Mr. Ryan lead the elderly townspeople show up as the Sheriff attempts to arrest Pee-wee. The Sheriff promises to drop the charges if the circus leaves town. While the Circus is packing, Mace tells Pee-wee they will do the circus elsewhere to prevent Pee-wee from going to prison. Pee-wee saves the day when he sneaks modified cocktail weenies from his hot dog tree to the elderly townspeople, causing them to become children once again. Without any memories of what happened, the children attend Mace's circus and watch Pee-wee perform.","language":"English","Release and reception":"During a 1988 television special, Herman acknowledged the long hours of circus training undertaken by the film's actors and that they spent a year and a half working on the movie. He also humorously compared himself as an actor to James Cagney and Spencer Tracy and ended by saying that Big Top Pee-wee is \"at least as good as Police Academy.\"[4]The film received a score 35% on Rotten Tomatoes, based on 20 reviews.[5] Roger Ebert greeted the film with two stars[6] and (along with colleague Gene Siskel) also rated it thumbs down on their television program, stating that Pee-wee entered the real world and, comparing it to Pee-wee's Playhouse (dubbed by the duo as 'the television show') and Pee-wee's Big Adventure, claimed that 'the characters in those have absolutely no connection with reality whatsoever, and that is why they were so enduring and enjoyable'. The negative reviews reflected the action at the box office, where it grossed $15,122,324,[3] suffering from competition with Who Framed Roger Rabbit, A Fish Called Wanda, and the re-issue of Bambi, among other summer releases.","box_office":"$15.1 million[3]","cinematography":"Steven B. Poster","directed_by":"Randal Kleiser","release_dates":"July 22, 1988 (1988-07-22)|||||","Production":"The Paramount Pictures production was directed by Randal Kleiser and written by Paul Reubens and George McGrath. Reubens also co-produced the film with Debra Hill. Filming locations include Disney's Golden Oak Ranch in Newhall, California, USA and the auditorium at Hart High School. This was Kleiser's first movie for Paramount since 1978's Grease.","produced_by":"Debra Hill Paul Reubens Richard Gilbert Abramson","starring":"Paul Reubens|Kris Kristofferson|Susan Tyrrell|Valeria Golino|","running_time":"85 minutes[1]","big_top_pee-wee":"Theatrical release poster","music_by":"Danny Elfman","edited_by":"Jeff Gourson","written_by":"Paul Reubens George McGrath","budget":"$20 million[2]"}