{"based_on":"I Saw the Devil   by Kim Jee-woon","country":"India","distributed_by":"AA Films","screenplay_by":"Tushar Hiranandani","story_by":"Adapted Story:- Tushar Hiranandani Original Story:- Park Hoon-jung","Plot":"The movie starts with Aisha (Shraddha Kapoor) calling her husband and leaving a message for him. A mysterious man in a hood breaks into her house, murders her with a screwdriver, and throws her out of the window. At her funeral, CBI officer, Aditya Rathore (Shaad Randhawa), points out to the police, that it is vital to track down the murderer or else Guru Pratap Singh (Sidharth Malhotra), Aisha's husband, would go on a killing spree. He misguides Guru by blaming Guru's former boss, a gangster Caeser (Remo Fernandes), for killing Aisha. In a flashback, he reveals that Guru used to work as a hitman for Caeser. Two years back, Guru had mercilessly killed a young man in a fit of anger, in front of his mother and younger brother. She told Guru that one day God would make him pay for all his crimes.Guru meets new Aisha, a free spirited girl in love with life, who requests him to help her with reuniting two aged lovers. They soon become friends and Aisha reveals to him that she is suffering from a terminal illness, and tells him about her bucket list. Guru helps her fulfill most of those wishes but her health deteriorates. Falling in love with her, Guru marries Aisha. He tries every means to save her. She receives treatment in Mumbai and miraculously recovers. Few days later she discovers she is pregnant but conceals the fact from Guru. In a parallel story, Rakesh Mahadkar (Riteish Deshmukh) is an unsuccessful and henpecked man who is constantly nagged and ridiculed by his wife Sulochana (Aamna Sharif) for being useless and poor. He vents out his frustration by murdering women who speak rudely to him, and Aisha turns out to be one of them.In present day, Guru aims to track down Aisha's killer. After finding out that it was not Caeser behind the murder, he finally tracks down Rakesh, while he is assaulting another victim. Guru beats Rakesh brutally but later admits him to a hospital and pays for the expenses, intending to return. While at the hospital, Guru finds out that Aisha was pregnant which makes him even more angry. While assaulting a nurse who had earlier spoken rudely to him, Rakesh is again intercepted by Guru who almost kills him, but revives him again after delivering an adrenaline shot and sets him free. Meanwhile, the police finds out the truth about Rakesh and takes his wife for questioning. Rakesh goes to his friend Brijesh Yadav (Kamaal R Khan), who suggests that Guru must be the husband of one of his victims and is thus taking revenge. He realizes that Guru is Aisha's husband as she had begged him not to kill her by saying that she is pregnant.Rakesh, who now knows Guru's identity, taunts him over the phone before killing Aisha's father, and then surrenders himself to Aditya. Rakesh expected Guru to kill him so that he would become a \"hero\" in the eyes of his wife and everyone else, while Guru would become a \"villain\". However, Caesar calls Guru at that moment and says that he has killed Rakesh's wife and asks Guru to finish off his son. Enraged, Rakesh injures Guru and is about to kill him when he is run over by a car and dies on the spot. Guru later adopts Rakesh's son instead of killing him, and completes the remaining wishes on Aisha's bucket list.","language":"Hindi","box_office":"₹1.53 billion (US$23 million)[2]","ek_villain":"Theatrical release poster","cinematography":"Vishnu Rao","production_company":"Balaji Motion Pictures","directed_by":"Mohit Suri","Soundtrack":"The songs are composed by Mithoon, Ankit Tiwari and the band Soch. The lyrics are written by Manoj Muntashir, Mithoon and members of Soch . The album consists of 6 songs with Tiwari composing \"Galliyan\", Mithoon composing \"Zaroorat\", \"Humdard\" and \"Banjaara\" while the remaining track \"Awari\" is composed by Soch.The film score was composed by Raju Singh.Mohar Basu of Koimoi gave the album 4/5 stars and wrote, \"Mohit Suri’s taste for melody cannot be doubted as the filmmaker uses an album that is fine blend of ballads and rock, infusing the right octave of harmony is every single song. In a long time there hasn’t come an album which has such perfectly pitched songs, each of them a winner. Music Directors get all the credit for creating a wholesome album like this.\"[20] Rediff also awarded the album 4 out of 5 stars and noted, \"The music of Ek Villain meets the high expectations that one had from it. Mohit Suri maintains his record of coming up with memorable music for each of his films.\"[21] Filmfare wrote, \"All-in-all, The OST of Ek Villain is another winner for Mohit Suri who has a knack for bringing out the best in his music directors. Go for it if you like soulful romantic tracks with loads of fusion thrown in.\"[22]","release_dates":"27 June 2014 (2014-06-27)|||||","Production":"Ekta Kapoor signed Mohit Suri to direct a romantic thriller. Ek Villain was earlier reported to be a remake of the Korean film I Saw the Devil, though Suri, the director, refuted the claim.[5][6] Suri stated that every character in the film would have grey shades.[7]The Central Board of Film Certification (CBFC) cleared the film after a total of eight cuts designed to tone down the action sequences and mute a particular word. Tanuj Garg, representative of Balaji Motion Pictures stated the cuts were less than a minute of screen time.[8]The movie's official teaser which was released on 4 April 2014 with the film Main Tera Hero,[9] got 1 million views on YouTube within three days of release.[10] The official trailer of 2 minutes 18 secs was launched later and was well received by critics,[11][12] as well as garnered praise from around the industry including Karan Johar, Ranbir Kapoor, Katrina Kaif among others.[13]Sidharth Malhotra, Shraddha Kapoor, Riteish Deshmukh, Mohit Suri and the film’s music directors attended a musical event in Mumbai to promote the soundtrack of the film.[14] Further, Malhotra and Kapoor promoted the movie at the IPL semi finals[15] as well as on reality shows like Jhalak Dikhhla Jaa.[16] Promotion campaigns were also organized across the country in cities like Jaipur, Kolkata[17] and Delhi.[18] As a part of the promtional strategy, a television show based on Bollywood villains was hosted by Malhotra.[19]","produced_by":"Ekta Kapoor Shobha Kapoor","starring":"Sidharth Malhotra Riteish Deshmukh Shraddha Kapoor","running_time":"129 minutes[1]","music_by":"Original songs:- Ankit Tiwari Mithoon Soch (Band) Background Score:- Raju Singh","edited_by":"Deven Murudeshwar","Release":"Ek Villain was released theatrically on 27 June 2014, in 2539 screens in the domestic market.[23]Ek Villain received mixed to positive reviews from critics with praise towards performances of Malhotra and Deshmukh.[3]Taran Adarsh of Bollywood Hungama awarded the movie 4/5 stars and wrote that, \"On the whole, Ek Villain is a stylish, spellbinding and terrifying edge-of-the-seat thriller. It's a step forward in this genre, without doubt. A sure-shot winner!\"[24] Raedita Tandon from Filmfare gave the film 4/5 stars and stated that, \"Though indulgent in parts, Ek Villain packs in a punch. Copy of a Korean film or not, it’s ‘good’ paisa vasool entertainment. .\"[25] Meena Iyer of The Times of India gave the film 3 stars in a scale of 5, stating that \"You cannot fault the scale of Ek Villain or berate its lead star cast. But you wish you could celebrate this thriller like you did Suri's last movie outing Aashiqui 2. This one lacks soul.\"[26]Aparna Mudi of Zee News gave the film a rating of 2.5/5 stars, concluding her review that \"The unveiling of the visceral saga has a lot of strong characters and Mohit has done a good job in adapting a foreign film and complimenting it with the drama that the Indian audience is used to. But he has gone a tad over in making a thriller. Maybe, filmmakers should step out of this trap more often and we wouldn`t be too far from making beacons of world cinema.\"[27] Rajeev Masand of CNN-IBN stated that \"I'm going with two-and-a-half out of five for 'Ek Villain'. If you're still wondering, the real villain here is the lousy script\".[28]Shubhra Gupta of The Indian Express gave the film 2 stars, commenting that \"Suri is an innate story-teller, and can keep things moving. All he needs is a strong, all-the-way credible, original plot.\"[29] Saibal Chatterjee of NDTV rated the film 2/5 and wrote that \"As a whole, this film, besides its surface flair, does not have too much to fall back upon. Watch it only if that is good enough for you.\"[30] Raja Sen of Rediff gave the film 1.5 stars out of 5, stating that \"Given free tickets, sure, you could escape Humshakals in theatres this weekend with this mediocre effort, but I say do yourself a favour and seek out the Korean DVD. (Uncover it, even.) Now that’s bloody special.\"[31]Ek Villain had what Box Office India called \"very good\" opening, with occupancies at around 55–60%.[32] The film earned around ₹167.2 million (US$2.5 million) in its first day and around ₹507 million (US$7.5 million) in its first weekend, collecting around ₹165.4 million (US$2.5 million) and ₹174.4 million (US$2.6 million) in its second and third days respectively.[33] The film collected around ₹81 million (US$1.2 million) in its fourth day[34] and around ₹68 million (US$1.0 million) in its fifth day.[35] The film collected ₹1.013 billion (US$15 million) in two weeks[36] and around ₹1.056 billion (US$16 million) in three weeks.[37][38] Box Office India reported that it will earn around ₹1.08 billion (US$16 million) in India alone.[39] The film earned a distributor share of around ₹51 crore (US$7.6 million)(Share).[40]Ek Villain collected ₹132.4 million (US$2.0 million) outside India in its first weekend.[41]","written_by":"Milap Zaveri (Dialogue)","budget":"₹350 million (US$5.2 million)[2]"}