{"country":"United Kingdom Ireland","distributed_by":"Buena Vista International (UK) Miramax Films (US)","Music and soundtrack":"The musical score of the film was written by English composer Adrian Johnston. To prepare melodies, he reviewed music books that had belonged to the Austen family.[30] The first track, \"First Impressions,\" has been described as a \"depressing\"[31] song that \"exhibits slow, pure and classical piano work;[32] one critic quipped that it belonged in \"Becoming Sylvia Plath\". Later tracks ranged \"in mood from upbeat and playful to somber and teary.\"[31] In his review of the score, Tim Clark of Soundtrack.net lamented the \"absence of a truly memorable theme, despite a wealth of thematic material,\" and found similarities to Dario Marianelli's composition for the 2005 film Pride & Prejudice.[33]Patsy Morita, a music critic for Allmusic, wrote that the second half of Johnston's score becomes as \"unremarkable\" as \"so many other dramatic film scores of the early twenty-first century.\"[30] She continued, \"It fulfills its purpose of underscoring the emotion of the story by being moody and slow to change melodically and harmonically, and by using many pregnant pauses and minimalist-leaning repetitive figures.\"[30] Morita added that \"there is nothing in it to draw attention away from the film.\"[30] The score later received a nomination for Best Original Film Score at the 2008 Ivor Novello Awards.[34] The film soundtrack was released on 31 July 2007.[35] A track listing for the album is as follows:[30]Henry Purcell's \"Hole in the Wall,\" also known as \"St. Martin's Lane,\" which is featured in the ballroom scene, was first published in 1695 and is highly unlikely to have been common during the Regency, when Jane Austen was a young adult.[36]Downloadable editions of the original soundtrack include six bonus tracks of music heard in the film:","Plot":"Jane Austen is the younger daughter of Reverend George Austen and his wife and has yet to find a suitable husband. She aspires to be a writer, to the dismay of her mother and proud delight of her father.Thomas Lefroy is a promising lawyer with a bad reputation, which he describes as \"typical\" for people in the profession. Tom makes a terrible first impression upon meeting Jane, when he nearly falls asleep while she gives a reading of her work for the company. Overhearing his subsequent criticism, Jane cannot stand the arrogant Irishman. Meanwhile, she turns down the affections of other men, including Mr. Wisley, the nephew and heir of the wealthy Lady Gresham. Wisley proposes but Jane ultimately rejects him due to lack of affection. The mischievous Tom encounters Jane again; they argue but increasingly take interest in each other and Tom demonstrates that he takes Jane's literary aspirations seriously. In time they fall in love.Tom, Jane, her brother Henry and Jane's rich widowed cousin, Eliza, Comtesse de Feullide, conspire to receive an invitation from Tom's uncle and benefactor, the Lord Chief Judge Langlois of London, for the rich \"Madame La Comtesse\" and her friends. This visit is meant to be a short break in their journey to see Jane's brother, Edward. This would allow Judge Langlois to get to know Jane before and give a blessing for their marriage. Full of hope, Jane cannot sleep during the night at the Judge's place. In a flow of inspiration, she then begins the writing of First Impressions, the manuscript that will become Pride and Prejudice.However, Judge Langlois receives a letter informing him of the genteel poverty of Jane's family and he refuses to give Tom his blessing, declaring that he would wish Tom to be the whoremonger he had been rather than allow him to live in poverty because of a bad marriage. Tom tells Jane that he cannot marry her and she is crushed, not knowing that Tom has a legitimate reason; his family depends on him financially.Jane returns home and soon learns that Tom has become engaged to someone else at the arrangement of his family. Jane accepts the marriage proposal of Mr. Wisley, whom she had earlier declined. Later, Tom realises he cannot live without Jane, and returns, asking Jane to run away with him, for \"what value will there be in life, if we are not together?\" Jane agrees, and they leave, with only Jane's sister Cassandra knowing they plan to marry in secret.On the way, Jane stumbles upon a letter from Tom's mother, and realises his situation: he sends money he receives from his uncle back to his parents and siblings, and his family cannot survive without it. She tells Tom that they cannot elope, not with so many people depending upon him. He insists that he and Jane must marry and tells her he will earn money, but Jane tells him that it will not be enough; he will never be able to make enough money to support his dependents with a High Court judge (his uncle) as an enemy and with a penniless wife. Distraught, Tom asks her if she loves him, and she replies, \"Yes, but if our love destroys your family, then it will destroy itself, in a long, slow degradation of guilt and regret and blame.\" As she leaves, Jane catches a last glimpse of Tom through the carriage window as he briefly follows, the horses outpacing him.Twenty years later, Jane, now a successful author and by choice unmarried, sees Tom during a gathering. Henry, now married to Eliza, brings Tom to her. Tom introduces his eldest daughter, who admires Jane's novels. As she asks Jane to read aloud, he remonstrates her by her name, also Jane.[clarification needed] Astonished that he named his eldest after her, Jane agrees to read. The last scene shows Tom's daughter sitting by Jane as she reads aloud from Pride and Prejudice, while Tom watches Jane affectionately. As she concludes, their eyes meet, and Tom joins the rest of the company in honouring Jane and her work with applause.","becoming_jane":"UK theatrical release poster","language":"English","Release and reception":"The world premiere of Becoming Jane took place in London on 5 March 2007.[57] It was released to cinemas on 9 March 2007 in the United Kingdom[58][59] and a week later in Ireland by Buena Vista International.[7] It ultimately grossed £3.78 million in the UK and Ireland, placing in sixteenth among all UK films for the year in those markets. Sixty-three percent of the audience was female, and 40.5 percent were above the age of 55.[60] The film's performance was considered \"disappointing\", and it influenced the US release date.[61] It arrived in Australia on 29 March.[62]Miramax Films distributed the film in the United States,[63] giving it a release date of 3 August 2007.[64] Originally, the studio intended to release Becoming Jane in June or July due to a \"counter-programming\" strategy,[note 1] attempting to attract demographic groups who were not interested in large blockbusters.[61] The film was expected to perform well during all seven days of the week and gradually gain more viewers during its time in cinemas. Due to the presence of recognizable stars such as Hathaway, Becoming Jane was expected to also do well among mainstream audiences. However, due to its weak UK release, the film's release was moved to August, when it opened on 100 screens in its first week. It increased to 601 screens the following week, later reaching 1,210 screens.[61] While the film made under $1 million in its first week, it was considered \"a highly respectable showing for a heritage biopic\" and enough of a figure to \"justify a ten-week run.\"[65] The film eventually grossed a total of $18,670,946 in the US.[64]On an international scale, Becoming Jane received a total of $37,311,672. It earned its highest grosses in the US, the UK, and Australia.[64]Becoming Jane was released on DVD and Blu-ray in the UK on 10 September 2007,[66] a month after it arrives in cinemas in the US. On 12 February 2008, Disney and Miramax released the DVD and Blu-ray in the US.[67] Both versions contained audio commentary with Jarrold, Hood, and Bernstein, deleted scenes, \"Pop-Up Facts & Footnotes,\" and a featurette called \"Discovering the Real Jane Austen\".[68][69] The US home video rights to the film have since been picked up by Echo Bridge Entertainment and the film has seen several reissues on Blu-ray and DVD, often packaged with other films such as Jane Eyre.Film review aggregation website Rotten Tomatoes gave the film a score of 57% based on reviews from 136 critics. The site summarized the consensus: \"Although Becoming Jane is a well-crafted period piece, it lacks fresh insight into the life and works of Jane Austen. The film focuses too much on wardrobe and not enough on Austen's achievements.\"[70] The New York Times called the film a \"triumph\" for Hathaway, but observed that \"the screenplay’s pseudo-Austen tone is so consistent that its lapses into modern romance-novel fantasy [and] threatens to derail the film.\"[71] More positive, Entertainment Weekly called the film \"a charmer,\" articulating that \"the supporting cast (Julie Walters, Maggie Smith, James Cromwell) is top-drawer; and Anne Hathaway, with her coltish beauty and frank demeanor, is a welcome Jane.\"[72]Critics lauded Hathaway and McAvoy for the chemistry between their characters, finding that it lent authenticity to the love story between Austen and Lefroy.[12][46] While Hathaway was admired for her performance by some critics,[12][72] some reviews negatively focused on her nationality[73] as well as the inauthenticity of her accent.[74][75] James McAvoy defended the decision of casting Hathaway by stating that a director should, \"find the right actor…and [she] is undoubtedly brilliant.\"[76] Hathaway herself admitted the persistent tendency to \"sound too much like myself and not at all like Jane\", blaming cold weather in Ireland, which meant she had to do voice retakes for several scenes.[4] Nonetheless, Jarrold praised Hathaway for her performance. In a wrap up party after the filming, the director confessed that the actress had been a different person, \"not just her accent but also the whole character, the way of holding yourself and speaking was so completely different\".[9]Time Out London gave a positive review, enunciating that \"Overall, the approach is less fluffily contrived than you’d expect, and though the alignment of circumstance and social status thwarting innocent passions is hardly fresh, it’s handled with thoughtful decorum. The emotional temperature’s rather restrained as a result, but with luxury casting all down the line,... elegant visuals balancing verdant and velvet, and a delightful faux-classical score, it’s a classy package, all right – just missing the extra spark.\"[77] Some reviewers have questioned the historical accuracy of the film, for instance critiquing the depicted relationship between Austen and Lefroy.[78][79]","box_office":"$39,380,877[2]","cinematography":"Eigil Bryld","production_company":"HanWay Films BBC Films Ecosse Films 2 Entertain Blueprint Pictures Bord Scannán na hÉireann","directed_by":"Julian Jarrold","release_dates":"9 March 2007 (2007-03-09)|||||","Production":"\"It's like dot-to-dot. There are documented facts and we've joined the dots in our own Austenesque landscape.\"In 2004, screenwriter Sarah Williams approached Douglas Rae and Robert Bernstein of Ecosse Films with the intention of creating a film about the life of Jane Austen, a popular eighteenth century English novelist.[3][4] Williams had recently read Becoming Jane Austen, a 2003 biography that largely pieced together several known facts, such as Austen's meeting Tom Lefroy on Christmas 1795, into a coherent story about unrequited love. Bernstein agreed to adapt the work, believing that it depicted \"a pivotal relationship in Jane Austen's early life that was largely unknown to the public.\"[3] The book's author, Jon Hunter Spence, was hired as a historical consultant on the film,[5][6] with the task of \"see[ing] that, given that the 'story' is a work of imagination, the factual material was as accurate as possible within the limitations of the story.\"[3]After Williams completed several drafts of the screenplay, the company hired Kevin Hood to aid in further script development. Bernstein believed that Hood's past work contained \"a romantic sensibility... There is a poetic quality about his writing as well as there being a rigorous emotional truth which I thought was important for Jane.\"[3] Hood was attracted to the film because he believed \"the story is such an important one and very much the inspiration for Pride and Prejudice.\"[3] Calling Austen a \"genius\" and \"one of the top two or three prose writers of all time\", Hood thought that her relationship with Lefroy \"was absolutely essential in shaping her work.\"[3] Hood acknowledged however that Becoming Jane is \"based on the facts as they are known and the majority of characters did exist, as did many of the situations and circumstances in the film. Some have been fictionalised, weaving together what we know about Austen's world from her books and letters, creating a rich Austenite landscape.\"[3]Julian Jarrold became attached to direct the film in early 2005.[3] It was his second feature film, after Kinky Boots, which was released later that year.[7] According to Bernstein, he \"liked [Jarrold's] style as it was modern and visceral, and I just had a feeling that he was the right choice. This piece needed to be handed with delicacy but also with a certain amount of brio and Julian was able to bring those two things to the production.\"[3] The director began work on the project in early 2006, rereading the novels Pride and Prejudice, Sense and Sensibility, and Persuasion and also reviewing Austen biographies such as Spence's book. Jarrold depended most heavily on the script, calling it \"a rich, witty and clever screenplay from someone who obviously knew his subject very well. It is a love story but much more besides. Kevin's screenplay has so many layers and interesting ideas. Apart from the love story I was very attracted by the themes of imagination and experience.\"[3] The director intended to \"bring Austen up to date by roughening her up a bit\" and adding \"more life and energy and fun,\" opining that past Austen adaptations had been \"a little bit picture-postcard and safe and sweet and nice.\"[6]Jarrold sought to make Becoming Jane \"look and feel\" realistic \"so everything is not lit in a very glamorous Hollywood way.\"[9] According to him, \"One of the key ideas in the film was to get away from the old, stuffy costume drama kind of feel of what Jane Austen is and to look at somebody before she becomes a genius, when she is in her early twenties and on the verge of writing her great thing; she had a real exuberance for life, intelligent and independent and a sort of outsider in rural Hampshire, more intelligent than the people around her and kicking against all those pressures.\"[9] To further set his film apart from other costume dramas, American actress Anne Hathaway was cast as the title character. A fan of Jane Austen since she was fourteen, Hathaway immediately began rereading Austen's books, conducting historical research including perusing the author's letters, and also learned sign language, calligraphy, dance choreography, and playing the piano. She moved to England a month before production began to improve her English accent, and attempted to stay in character throughout filming, the first time she had done so for a movie.[9]There were concerns in some quarters that the American Hathaway was playing a beloved English writer. James McAvoy, who plays Thomas Langlois Lefroy, believed that filming in Ireland made her casting \"a bit safer\" than if they had shot in England. McAvoy accepted the role because he enjoyed Austen's writings and was eager to work with Jarrold, having collaborated with him previously on the 2002 television production White Teeth.[10] McAvoy first assumed that Becoming Jane would be directly associated with Pride and Prejudice, with his character possessing similarities with Mr. Darcy; the actor soon realised however \"that the screenplay was nothing like Pride and Prejudice. The screenwriter probably speculated on some of the inspiration for Pride and Prejudice but it is a completely different story.\"[3]Julie Walters had once disliked Austen's writings but changed her mind when she read Pride and Prejudice after receiving her role as Mrs. Austen.[10] Appearing as Mr. Austen was actor James Cromwell, who viewed his character as \"a generous gentleman, well educated and supportive of Jane for the most part. He is bedevilled by his financial circumstances but deeply in love with his wife and sympathetic to her concerns about what will happen to the girls if they don't marry.\"[3] Joe Anderson portrayed Henry Austen, while Lucy Cohu played the widowed Eliza de Feuillide, the Austens' worldly cousin and Henry's romantic interest. Cohu believed that her character \"needs security. She is looking to be safe. She finds that security with Henry as she knows the Austen family.\"[3]Anna Maxwell Martin appeared as Jane's sister Cassandra. The actress called her character \"terribly sensible\", noting that she \"gets her heart broken. It's very sad. She's the levelling force for Jane Austen, the wild one. She tries to get her back in line, but fails miserably.\"[11] Becoming Jane also featured Laurence Fox as Mr. Wisley and Dame Maggie Smith as Lady Gresham, whom Jarrold viewed as possessing \"similarities to Lady Catherine De Burgh in Pride and Prejudice but in this film you get to see her hidden vulnerabilities – the pain of never having had children and her controlling maternal power over Wisley.\"[3] Other cast members included Ian Richardson as Judge Langlois, Leo Bill as John Warren, Jessica Ashworth as Lucy Lefroy, Michael James Ford as Mr. Lefroy, Tom Vaughan-Lawlor as Robert Fowle, and Helen McCrory as Mrs. Radcliffe.[12]Irish costume designer Eimer Ní Mhaoldomhnaigh designed the clothing seen in the film.[13] She attempted to create a different style of costumes than had been seen in recent Austen adaptations, and drew inspiration from the fashions of the 1790s, a time period she considered \"fascinating\" and a \"very transitional era in terms of fashion... it was a real challenge to make it work.\"[3] Ní Mhaoldhomhnaigh attended the Cannes Film Festival in May 2006 but then had to quickly return to the Becoming Jane set to complete the last two days of filming.[14] She later collaborated with Jarrold in the 2008 drama film Brideshead Revisited.[15]For research, Ní Mhaoldhomhnaigh visited museums and art galleries, and also read Austen's letters and novels. She was interested in both the effects of continental fashions on English clothing and the differences between social classes.[3] While she recognised that 1795 \"marked the beginning\" of the empire waistline trend, Ní Mhaoldhomhnaigh also understood this fashion would have barely been introduced to Austen's circle in the country; rather, the film displayed many costume designs from the early 1790s. She explained, \"We wanted to show that transition especially for the women. The look in London is very different from the look in the countryside. For the country ball the fashion for the older women is more of the old style but for the younger women we show the introduction of the Empire line.\"[3]The costume designer created all of Hathaway's outfits from scratch, and \"looked for images of a young Jane Austen.\"[3] Ní Mhaoldhomhnaigh explained, \"I wanted to get her youthfulness and innocence across through her dress. But crucially there was also her strength of character. So we kept away from frills and flounces. I wanted a definite look that was quite strong but also pretty at the same time. Jane was living on a working farm so her dress had to be practical as well. In terms of the costume we were definitely trying to steer away from the chocolate box image that we associate with Jane Austen.\"[3]Ní Mhaoldhomhnaigh dressed McAvoy in rich fabrics, such as velvet and beaver fur, to help distinguish him from the other men. She recalled that \"he wears very stylish waist coats and cut-away jackets. With Jane around he'd have an extra swagger in front of her. James (McAvoy) was really into it. We'd talk about the colours and fabrics to achieve his distinctive look.\"[3] Ní Mhaoldhomhnaigh and Maggie Smith agreed that Lady Gresham's dresses would be modelled after 1770s fashion, which was \"the sort of dress that the character would have worn when she was much younger and suited her back then. Lady Gresham is very much her own character and is not someone who is dictated to by fashion.\"[3] Smith's dresses contained stiff fabrics \"to emphasise a woman who was very set in her ways\".[3]Produced independently by Ecosse,[7] Becoming Jane was given a limited budget of €12.7 million (£9 million or $16.5 million).[4][16][17] Production designer Eve Stewart researched Regency literature and Austen's life, and along with Jarrold, scouted locations in Dublin and nearby counties for five weeks in January and February 2006.[3] They ultimately opted to shoot in Dublin and the Irish counties of Meath and Wicklow instead of Hampshire, the birthplace of Austen,[7] because it held \"a sense of countryside that felt more unchanged,\" while Hampshire had unfortunately become too \"groomed and manicured\".[18] Jarrold also found \"a great variety of Georgian houses and older houses\" in Ireland.[9] His production received funds from the Irish Film Board,[9] the UK Film Council Premiere Fund,[19][20] 2 Entertain, Scion Films, and Miramax Films.[21] Film critic Andrew Sarris noted that in Ireland \"happily, there are still architectural traces of life more than 200 years ago to correspond with the year 1795.\"[22] However, Ireland did include a few disadvantages: Stewart found that \"the rural aspects were the most difficult as the Irish country landscape is nothing like Hampshire. There are no rolling hills so the vegetation and the landscaping was the trickiest thing for me as a production designer.\"[3]Due to its low budget,[7] Becoming Jane was filmed on a \"tight\" schedule of eight weeks[16] from March to May 2006.[3] Jarrold observed however that because Ecosse was not a film studio, he had more creative freedom.[7] Bernstein stated of filming, \"We recreated a world that Jane Austen lovers can recognise and associate with. But hopefully we can also take them into areas and places like the boxing club, the cricket game and the fair that do not feature in Jane Austen's fiction. They are sort of seedy and dangerous areas that are not normally associated with Austen.\"[3] Jarrold found filming \"very difficult. We had to make it work in the locations that we had as efficiently as possible.\"[9] Filming outdoors was often so cold that Hathaway turned blue and had difficulty saying her lines; Automated Dialogue Replacement in post-production helped correct this by re-dubbing her lines.[9]The story's central location was set at Steventon rectory where Austen was raised.[3] While it had been demolished in 1824,[23] Jarrold and his crew \"fortunately found a wonderful house that was very like the original... We honed the script as well to make it as practical as possible.\"[9] Stewart believed that the Austen house expressed their status and wealth, \"I think that you will lose the central thrust of the story unless you understand the status of the Austen's and that they are pretty poor. Jane spent all her formative years there and that was the place that influenced her view of the world. You have to believe that the family live in that house because that is a crucial piece of the jigsaw.\"[3] Scenes at Steventon rectory were filmed in Higginsbrook House, a few miles off Trim in County Meath.[24] Later in fall 2006, it appeared again as the house of the Morlands in Northanger Abbey.[25][26]Charleville Castle stood in for the interior scenes of Lady Gresham's estate,[27] while Kilruddery House, an old Elizabethan revival estate, provided the exterior shots of the property.[3][28][29] Other filming sites included Cloghlee Bridge in the Dublin Mountains (as Mr. Austen's rectory) and Dublin's Henrietta Street and North Great George's Street as Regency London. A house on Henrietta Street also provided the filming site for Mrs. Radcliffe's residence. Gentleman Jackson's club, where Lefroy boxes, was represented by \"the dark and otherworldly\" Mother Redcaps tavern, also in Dublin.[3]","produced_by":"Graham Broadbent Robert Bernstein Douglas Rae","starring":"Anne Hathaway|James McAvoy|Julie Walters|James Cromwell|Maggie Smith|","running_time":"120 minutes[1]","Themes and analysis":"Jon Spence, the author of the biography the film was based on, identifies \"Tom Lefroy as the love of Austen's life and her relationship with him as the origin of her genius. But he never suggests that there was an aborted elopement (much less subsequent reading sessions with any of Lefroy's children). And he is careful, as the filmmakers are not, to clarify that in speculating about Austen's romantic experience he is reading between the lines of the family records and of the three rather opaque Austen letters that are his principal sources.\"[37]An important deviation of the film's plot from history is that there is scant evidence in real life Austen and Lefroy's relationship went beyond acquaintance. Rather, all that is known of them together is that they danced at three Christmas balls before Tom returned to school and that Jane was \"too proud\" to ask his aunt about him two years later. In the latter years of Tom Lefroy's life, he was questioned about his relationship with Jane Austen by his nephew, and admitted to having loved Jane Austen, but stated that it was a \"boyish love\".[38] As is written in a letter sent from T.E.P. Lefroy to James Edward Austen Leigh in 1870,My late venerable uncle ... said in so many words that he was in love with her, although he qualified his confession by saying it was a boyish love. As this occurred in a friendly & private conversation, I feel some doubt whether I ought to make it public.[39]Lori Smith, author of The Jane Austen Guide to Life, opined that:No doubt this relationship and her [Jane's] repartee with Tom fueled her writing. Whether it was \"her greatest inspiration\" as the trailers for Becoming Jane claim, well, that's debatable. But I'm sure it provided as spark.[40]However, contrary to the film's story line, Jane had attempted her first full-length novel before she met Tom and had already read The History of Tom Jones, a Foundling before meeting him.[41] In a cut scene from the movie, it is clear that she is reading the novel for the second time, but in the theatrical release without that scene, it appears he introduces her to it.Various commentators have offered opinions concerning the presence in the film of characters and themes from Austen's works, particularly with Pride and Prejudice. Deborah Cartmell contended that Hathaway's Austen is a \"replica of Elizabeth Bennet (with a touch of impetuous Lydia thrown in),\"[42] and added that the associations between Austen and Elizabeth are \"more explicit than in\" any other Austen biopic.[43] Tim Robey of The Daily Telegraph declared that the film took \"good old P&P's storyline and replace[d] Elizabeth Bennet with Austen herself [and added] a real-life pseudo-Darcy from the skimpiest of biographical evidence.\"[44] A Companion to Jane Austen observed that the \"physicality\" of Jane and Lefroy's kiss was similar to the \"passionate kiss\" between Elizabeth and Darcy in the 1995 serial Pride and Prejudice.[45]Empire magazine further expressed thatThe characters peopling the young Jane’s life are plainly recognisable as the prototypes for her most celebrated characters: Walters’ anxious mother and Cromwell’s strong, fair-minded Mr. Austen are clear relatives of Pride & Prejudice's Mr. and Mrs. Bennet; Smith’s aloof, disdainful dowager exemplifies the snobbery and social climbing that provide context for Austen’s romances; McAvoy’s cocksure, worldly Lefroy is the epitome of the outwardly arrogant, inwardly sensitive hero of whom Mr. Darcy is the paradigm, while Jane herself shares the wit and passion of Austen’s most beloved heroine, Lizzie Bennet.The implementation of mass marketing in the film's production and release has attracted notice from film and literary scholars. Dianne F. Sadoff writes that Becoming Jane \"confirms the two-decades-long megaplexing of Jane Austen.\"[47] According to Andrew Higson, the film was another example of \"Austen Power\" and the desire of filmmakers to \"exploit the possibilities of both the Austen industry and the market for literary cinema and television – and more generally, the market for 'traditional' English drama.\"[48] While reviewing Austen adaptations of the 1990s and 2000s in her book Heritage Film: Nation, Genre and Representation, author Belén Vidal viewed Becoming Jane as yet another \"transformation of Austen's novels into icons of popular culture.\"[49] To Vidal, this and other productions, such as The Jane Austen Book Club (2007) and Miss Austen Regrets (2008), confirmed \"the generic status of the Austen phenomenon whilst dispensing with the incorporation of the literary text.\"[49]Becoming Jane followed a different formula than the Austen adaptations of the 1990s and attempted to draw viewers from a variety of demographic groups.[47] Hathaway's casting was intended to attract young female viewers who had enjoyed the actress in The Princess Diaries and The Princess Diaries 2: Royal Engagement.[50] According to producers, the view was that this demographic group would have been in their early teens during the release of the Princess films, making them \"the right age\" for Austen as 15-year-olds. Expecting Becoming Jane to be a popular film, in February 2007 Penguin Books announced new editions of six of Austen's best-known novels; their redesigned covers were intended to attract teenage readers.[51]Becoming Jane has been referred to as a heritage costume drama film, a genre which has been popular in the United States among both its audiences and its film studios. According to Andrew Higson, Becoming Jane falls into the continuing trend of American attitudes influencing English film.[52] Belén Vidal wrote that the film \"exploit[s] a well-defined heritage iconography and strategically combine[s] American stars with supporting casts of international 'quality' players.\"[49] Hilary Radner analysed the presence of the \"marriage plot\" – a girl succeeding only by marrying the man of her choice – in film and television, and noted that while Becoming Jane critiques this film trope, it \"points to the power of the traditional marriage plot as a residual paradigm influencing feminine identity.\"[53]Jarrold's adaptation also came in the wake of a number of literary biographical films, such as Shakespeare in Love and Miss Potter.[54] Deborah Cartmell, author of Screen Adaptations: Jane Austen's Pride and Prejudice: A Close Study of the Relationship between Text and Film, found similarities between Becoming Jane and Shakespeare in Love \"almost so obvious that the [former] film risks the accusation of being dangerously derivative.\" A given example included the characters of Austen and William Shakespeare inputting their personal experiences directly into their works.[55] Marina Cano López and Rosa María García-Periago explained that the film \"follows the path opened by John Madden’s Shakespeare in Love. The numerous intertextual connections between both movies can be reduced to one: just as Shakespeare is imagined as the hero of his own play, Jane Austen becomes the heroine of her own novel.\" Among other listed similarities, they noted that the romantic interests of both protagonists serve as their literary muses, and that the middle part of both films \"lie\" when viewed from a historical perspective.[56]","Impact and legacy":"Becoming Jane and the 2008 BBC serial Sense and Sensibility have been credited with \"renew[ing] interest\" in Jane Austen's House Museum in Chawton.[87] According to Robin Bischert, the chief executive of Bath Tourism Plus, Bath, Somerset gained \"more than £150,000 worth of free media exposure\" in the wake of Becoming Jane and Persuasion, a 2007 television production adapted from another Austen novel.[88] As the city is heavily associated with Austen, the company took advantage of Becoming Jane's release in order to celebrate the author and her writings.[89] In late September 2007, Bath launched the seventh Jane Austen festival, which included a parade of people in Regency costumes, readings, tours, and discussions about the author. In addition, the city offered events such as Tea with Mr. Darcy to mark the release of the Becoming Jane DVD.[90]The film's production had a positive impact on the Irish economy, as it resulted in a direct expenditure of €7.1 million, providing jobs for 116 crew members and 17 actors, and also offered 1,250 days of work for extras.[7][21] John O'Donoghue, the country's Minister for Arts, Sport and Tourism, visited the set and statedThe Irish economy continues to directly benefit from having major feature films such as Becoming Jane shoot on location here. As well as the direct benefits to the local economy such as job creation and tourism, it is also important to have images of Ireland screened to international audiences around the world. Encouraging feature films to shoot in Ireland remains a major priority for the Irish Government and we hope that the recent changes to Section 481 will mean that Ireland remains a competitive international location for feature film.","music_by":"Adrian Johnston","edited_by":"Emma E. Hickox","written_by":"Kevin Hood Sarah Williams","budget":"$16.5 million[2]"}