{"country":"United States","distributed_by":"20th Century Fox","a_change_of_seasons":"Videotape cover","Plot":"When fortysomething Karen Evans discovers her arrogantly self-centered professor husband Adam is having an affair with student Lindsey Rutledge, she retaliates by having a dalliance of her own with young, philosophical campus carpenter Pete Lachappelle. Adam is infuriated when he learns about his wife's new relationship, and she in turn defends her right to enjoy the same carnal pleasures he does. The four decide to share a Vermont ski house, where their efforts to behave like liberal adults are tested by middle-aged angst, hurt feelings, and teenager Kasey Evans, who unexpectedly arrives to confront her parents with their outrageous behavior.","language":"English","Critical reception":"In his review in the New York Times, Vincent Canby said the film \"exhibits no sense of humor and no appreciation for the ridiculous … the screenplay [is] often dreadful … the only appealing performance is Miss MacLaine's, and she's too good to be true. A Change of Seasons does prove one thing, though. A farce about characters who've been freed of their conventional obligations quickly becomes aimless.\"[11]Variety observed, \"It would take the genius of an Ernst Lubitsch to do justice to the incredibly tangled relationships in A Change of Seasons, and director Richard Lang is no Lubitsch. The switching of couples seems arbitrary and mechanical, and more sour than amusing.\"[12]TV Guide rates it one out of a possible four stars, adding the film \"is as predictable as a long Arctic winter, and just about as interesting … Marybeth Hurt … steals what there is of the picture to steal.\"[13]Time Out London calls it \"kitsch without conviction, schlock without end … glib trappings … and witless dialogue sink everything except for the perky intelligence of MacLaine, who clearly deserves better than this.\"[14]The film is rated M in New Zealand, \"Suitable for mature audiences 16 years and over.\"","box_office":"$7,270,000 (US/ Canada)[2]","cinematography":"Philip H. Lathrop","directed_by":"Richard Lang","Production notes":"The film was shot on location in Glenwood Springs, Colorado and Williamstown, Massachusetts. Hopkins and MacLaine famously did not get along during the filming and Hopkins said “she was the most obnoxious actress I have ever worked with.\"[3][4][5][6]The theme song \"Where Do You Catch The Bus For Tomorrow?\" was written by Alan and Marilyn Bergman and Henry Mancini and performed by Kenny Rankin.Originally, Noel Black was hired to direct after producer Martin Ransohoff saw his film, A Man, a Woman, and a Bank (1979).[7] Black left the film during shooting due to creative differences. He was replaced by Richard Lang.[8] Black shot the first half of the film only.[9][10]Consenting Adults was the film's working title.[7]","release_dates":"December 1, 1980 (1980-12-01)|||||","produced_by":"Martin Ransohoff","starring":"Shirley MacLaine Anthony Hopkins Bo Derek Michael Brandon Mary Beth Hurt K Callan","running_time":"102 minutes","music_by":"Henry Mancini","edited_by":"Don Zimmerman","written_by":"Erich Segal Martin Ranshoff Ronni Kern Fred Segal","budget":"$6 million[1]"}