{"based_on":"Characters  by Jack Bernstein","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Legendary pet detective Ace Ventura (Jim Carrey) returns for another adventure when he's coerced out of retirement while on a soul-searching retreat in the Himalayas. He must now retrieve an endangered white bat from a village located in Africa. The sacred animal was offered up as a wedding dowry from the Wachootoo prince to the Wachati princess, and, if Ace can't track down the culprit behind the kidnapping in time, civil war will break out between the two rival tribes.","ace_ventura:_when_nature_calls":"Theatrical release poster","language":"English","box_office":"$212.4 million[1]","cinematography":"Donald E. Thorin","production_company":"Morgan Creek Productions","directed_by":"Steve Oedekerk","Production notes":"The movie was set in a fictional location in Africa but was actually shot in various locations in and around Charleston, South Carolina.Part of the film was shot in San Antonio, Texas and British Columbia, Canada.When listing other words that start with \"sh-\" after hearing of the Shikaka, Ace includes \"Shawshank Redemption\". This may be a nod to actor Bob Gunton, as he appears in both films. Also, when Ace has Bob Gunton's character, Burton Quinn, tied to a chair, Ace calls him \"Sweeney Toad\", a reference to his having played the title character in a theater production of Sweeney Todd.","release_dates":"November 10, 1995 (1995-11-10)|||||","Alternative versions":"When aired in syndication, there is an alternative version of the 'rhino scene' (wherein Ace escapes with difficulty from within a mechanical rhinoceros) in which Ace stands up after emerging from the rhino and shouts \"Man, was I lost!\".In order to receive a PG certificate, the UK release of the film features a number of cuts, equalling one minute and 35 seconds for the theatrical release, plus a further three seconds when re-classified for home video. These cut scenes include:During the 'projector scene', the U.K. version features Ace casting bird-like shadows with both hands, as opposed to the single hand in the original release.This film was shot in Super 35, so the fullscreen version is open matte, and reveals more to the top and bottom of the screen (sections that were not actually intended to be seen); it also crops the sides.","produced_by":"James G. Robinson","starring":"Jim Carrey Ian McNeice Simon Callow Maynard Eziashi Bob Gunton Sophie Okonedo Tommy Davidson","running_time":"94 minutes","music_by":"Robert Folk","edited_by":"Malcolm Campbell","Release":"The film grossed $37,804,076 during its opening weekend, taking the #1 spot. In the U.S. and Canada, the film grossed $108.3 million, and in other territories, it grossed $104 million. The worldwide gross was $212.3 million. Against its $30 million budget, Ace Ventura: When Nature Calls was a major financial success.[1]On Rotten Tomatoes, the film gained a 33% based on 24 reviews, with an average rating of 4/10, and the consensus reading: \"Nature Calls in this Ace Ventura sequel, and it's answered by the law of diminishing returns.\"[5] On Metacritic, the film received a 45 out of 100 based on 17 reviews.[6] But just like the first film, the sequel has gained a positive response from the public.1996 ASCAP Award1996 American Comedy Award1996 Kid's Choice Awards1996 MTV Movie Awards1996 Razzie Awards1996 Stinkers Bad Movie Awards[7]","written_by":"Steve Oedekerk","budget":"$30 million"}