{"country":"Italy","distributed_by":"Roissy Films","Plot":"Glauco, a middle-aged industrial designer of gas masks, is growing tired of his occupation. Having discussed alienation with a colleague at the factory, he returns home. His wife is in bed with a headache but has left him dinner, which has become cold. He is dissatisfied with the food and begins preparing himself a gourmet meal. While collecting ingredients he discovers an old revolver wrapped in a 1934 newspaper with the headline \"Dillinger is dead\" and an account of the famous American gangster's death. Glauco cleans and restores the gun while continuing to cook his dinner, then paints it red with white polka dots. He also eats his meal, watches some television and projected home movies, listens to music and seduces their maid. With the gun he enacts suicide a number of times. At dawn he shoots his wife thrice in the head as she sleeps. Then he drives to the seaside where he gets a job as a chef on a yacht bound for Tahiti.","language":"Italian","Themes":"The film, and especially its surreal finale in which the character Glauco leaves home and finds a job on a yacht, has been interpreted variously. Author Fabio Vighi approached it from a psychoanalytical standpoint, suggesting the uxoricide is an attempt to \"kill\" something inside himself. Glauco repeatedly stages his own suicide throughout the film. The final murder, then, is a means to escape his life by eliminating the primary link to his bourgeois lifestyle, which he would otherwise be unable to leave.[1]Writer Mira Liehm posits director Marco Ferreri followed in the style of the Theatre of the Absurd and did not apply psychology or logic to his characters but then placed his absurdist creations in a real world context. The home with its many luxuries, such as the gourmet dining and film projector, as well as the cleaning and decoration of the gun, are meaningless diversions which trap Glauco in a metaphorical prison and suffocate him. His isolation leads to death or an \"illusionary escape.\"[2] As Italian film historian Paolo Bertetto explained, \"The escape to Tahiti means a total closure of all horizons, the paralysis of all possibilities; we are brought down to zero, stripped of all perspectives, and restored to the original nothingness.\"[2]","Release and reception":"The film was entered into the 1969 Cannes Film Festival.[4] Dillinger Is Dead was the subject of controversy on its release for its violence and depiction of the parvenu set.[3] Critics have also called it director Marco Ferreri's masterpiece.[2] The influential French film magazine Cahiers du Cinéma praised the film, interviewed the director and translated two of his previous interviews from the Italian magazine Cinema & Film. The acclaim opened the resources of Paris to Ferreri and he spent much of the next 15 years living there. During that time he made his internationally best known films, including The Last Woman (1976) and Bye Bye Monkey (1978). Ferreri and Michel Piccoli became fast friends and worked together subsequently on films such as The Last Woman and La Grande Bouffe (1973).[5]According to critic Viano Maurizio, by the mid-1980s Reaganomics' effect on the film market resulted in Dillinger's near disappearance and it has been rarely seen since.[5] It appeared in the 2006 Marco Ferreri Retrospective in London.[6][7] A new print was provided by The Criterion Collection for the 2007 Telluride Film Festival.[8]","cinematography":"Mario Vulpiani","directed_by":"Marco Ferreri","release_dates":"23 January 1969","Production":"Director Marco Ferreri first met leading man Michel Piccoli when he visited the actor on the set of Alain Cavalier's La Chamade (1968). Ferreri had Piccoli read a few pages from Dillinger Is Dead and hired him immediately. Piccoli has said Ferreri did not direct his performance and only gave simple blocking instructions. He played the character as solitary and volatile, comparing it to his role in Agnès Varda's The Creatures (1966).","produced_by":"Ever Haggiag Alfred Levy for Pegaso Film","starring":"Michel Piccoli Anita Pallenberg Annie Girardot","running_time":"95 minutes","dillinger_is_dead":"Theatrical release poster","music_by":"Teo Usuelli","edited_by":"Mirella Mencio","written_by":"Marco Ferreri Sergio Bazzini"}