{"country":"United States","distributed_by":"Alliance Films Fine Line Features","all_over_me":"Theatrical release poster","Ratings and distribution":"The MPAA gave All Over Me an R rating for sexuality and drug use involving teen girls, and for strong language. The film premiered at the 1997 Berlin International Film Festival where it played in the Panorama section.[2] It went on to show at several festivals including the 1997 Turin International Gay and Lesbian Film Festival and the 1998 Lisbon Gay and Lesbian Film Festival. It opened in American theaters on April 25, 1997 distributed by Fine Line Features.[3] It was released in Australian theaters on February 19, 1998. It was released onto Region 1 DVD on June 14, 2005 distributed by Image Entertainment. It was released on Region 2 DVD on April 8, 2002 distributed by Millivres Multimedia.[4]","Plot":"This film focuses on Claude (Alison Folland), a teenage girl who lives in Hell's Kitchen, New York City, and is the story of her sexual discovery and budding lesbianism. Claude's best friend is Ellen (Tara Subkoff). Her plan to start a band with Ellen is subverted when Ellen begins dating Mark (Cole Hauser).Claude discovers that Luke (Pat Briggs), a gay musician who has just moved into her apartment building, has been stabbed to death in what might have been a hate crime. Ellen hints at the fact that she was there when Luke was killed, but Claude keeps her mouth shut in order to protect her. Claude then goes to a gay bar and meets Lucy (Leisha Hailey), a pink-haired guitarist who is playing in the house band. Claude goes to Lucy's apartment, but freaks out and leaves, returning to her apartment to find Ellen waiting for her. They have a fight which ends with Claude screaming that she would die without Ellen.Claude goes out along with Ellen and Mark on one of their dates; Mark gives Ellen downers which make her violently ill. Claude brings her to the bathroom and forces her to vomit, and Ellen refers to Claude as her \"Knight in Shining Armor.\" Mark is visibly furious but manages to contain himself. Claude leaves and goes to Lucy's apartment again, but leaves after a brief make-out session. On the way home, Claude is ambushed in the street by Mark, who questions her relationship with Ellen. Claude threatens to tell the police about Mark's possible involvement in Luke's death.Claude goes home to find Ellen waiting for her. Claude tells her that they need to tell the police about Mark, but Ellen says she would go to jail if they knew about her involvement. Claude says she would never let that happen. Claude kisses Ellen and tells her that she loves her. Ellen tells Claude not to say that, and Claude leaves. The next day, Claude cleans out her room, removing all traces of Ellen. She goes to the police before work. Later, the police comes in to her workplace and takes Mark away for questioning. Ellen tells Claude that she hates her. Claude says that she knows, and that she's sorry. Claude then starts seeing Lucy.","language":"English","Reception":"Critical response to All Over Me was generally positive. Rotten Tomatoes gives it a \"fresh\" rating of 84% based on 25 reviews.[5] Critics were impressed with this directional debut and described it as powerful and conspicuously well-made.[6][7] They praised the Sichel sisters for telling a story of adolescence and friendship which is at once honest, realistic and authentic, while remaining subtle, subdued and compassionate.[8][9] Emanuel Levy called it complex and interesting, and Marjorie Baumgarten called it a film for \"riot grrrls of all ages\".[6][10] Janet Maslin of The New York Times praised it as a confident first feature but said that it has more style than substance.[7] Its detractors included Don Willmot, who found it melodramatic, and E!, which described it as titillating but contrived; \"a walk on the mild side\".[11][12]Alison Folland was widely praised by critics for her performance as Claude. Emanuel Levy called her an instinctive actress who \"dominates every frame of the picture\".[6] Janet Maslin said Folland brings a \"wistful sincerity\" to the role.[7] Tara Subkoff was also praised for a performance compared by some to Rosanna Arquette.[7][10] Not all the critics liked her portrayal of Ellen; E! called her \"merely grating\".[12]With its coming-of-age theme and exploration of teenage sexuality, All Over Me drew comparisons from critics to other films, in particular Larry Clark's Kids and Maria Maggenti's The Incredibly True Adventure of Two Girls in Love, both from 1995.[8][10][13] Although similarities were noted, All Over Me was praised for its differences to these two films. E! called it gentler than Kids, and Muskewitz said All Over Me was less exploitative than that film.[9][12] Emanual Levy described it as the far more interesting and complex of the two.[6] Ron Wells said \"thank god it's not Kids\" and Bernstein said that \"comparison misses the point\".[14][15] When comparing it to The Incredibly True Adventure of Two Girls in Love, Emanuel Levy called All Over Me \"much more accomplished\".[6] SplicedWire called it \" an ideal companion feature for Todd Solondz's Welcome to the Dollhouse, another female-centred coming-of-age film from the mid-1990s.[16]All Over Me won the Teddy Award for Best Feature Film at the 1997 Berlin International Film Festival.[17] It was nominated for the Grand Jury Prize at the 1997 Sundance Film Festival, the Open Palm Award at the 1997 Gotham Awards and the Outstanding Film (Limited Release) Award at the 1998 GLAAD Media Awards. Alison Folland was nominated for the Independent Spirit Award for Best Female Lead.","box_office":"$150,646 (Domestic)","cinematography":"Joe DeSalvo","production_company":"Baldini Pictures Medusa Pictures Slam Pictures","directed_by":"Alex Sichel","Music":"The film score for All Over me was composed by Miki Navazio.[18] The soundtrack to the film was released on the TVT label on April 29, 1997.[19] It features songs from several indie and riot grrl musicians interspersed with parts of Navazio's score.","release_dates":"February 1997 (1997-02) (Berlin International Film Festival)|April 25, 1997 (1997-04-25) (United States)|February 19, 1998 (1998-02-19) (Australia)|||","produced_by":"Dolly Hall","starring":"Alison Folland Tara Subkoff","running_time":"90 mins.","music_by":"Leisha Hailey Miki Navazio","edited_by":"Sabine Hoffmann","written_by":"Sylvia Sichel"}