{"country":"United Kingdom United States Italy South Africa","distributed_by":"Universal Pictures","screenplay_by":"John Briley","Plot":"Following a news story depicting the demolition of a slum in East London, South Africa, journalist Donald Woods (Kevin Kline) seeks more information about the incident and ventures off to meet black activist Steve Biko (Denzel Washington). Biko has been officially banned by the South African government and is not permitted to leave his defined banning area at King William's Town. Woods is formally against Biko's banning, but remains critical of his political views. Biko invites Woods to visit a black township to see the impoverished conditions and to witness the effect of the government-imposed restrictions, which make up the apartheid system. Woods begins to agree with Biko's desire for a South Africa where blacks have the same opportunities and freedoms as those enjoyed by the white population. As Woods comes to understand Biko's point of view, a friendship slowly develops between them.After being arrested for speaking at a gathering of black South Africans outside of his banishment zone, Biko is arrested and interrogated by South African security forces. Following this, he is brought to court in order to explain his message directed toward the South African government. After he speaks eloquently in court and advocates non-violence, the security officers who interrogated him visit his church and vandalize the property. Woods assures Biko that he will meet with a government official to discuss the matter. Woods then meets with Jimmy Kruger (John Thaw), the South African Minister of Justice in his house in Pretoria in an attempt to prevent further abuse by the security force. Kruger first expresses discontent over the actions of security force, however Woods is later harassed by security forces at his home. The security men that harass Woods insinuate that their orders to visit Woods came directly from Kruger.Later, Biko decides to travel to Cape Town to speak at a student-run meeting. En route, security forces stop his car and arrest him. He is held in harsh conditions and beaten, causing a severe brain injury. A doctor recommends consulting a nearby specialist in order to best treat his injuries, but the police refuse out of fear that he might escape. The security forces instead decide to take him to a police hospital in Pretoria, around 700 miles (1 020 km) away from Cape Town. He is thrown into the back of a prison van and driven on a bumpy road, aggravating his brain injury and resulting in his death.Woods then works to expose the police's complicity in Biko's death. He attempts to expose photographs of Biko's body that contradict police reports that he died of a hunger strike, but he is prevented just before boarding a plane to leave and informed that he is now banned, therefore not able to leave the country. Woods and his family are targeted in a campaign of harassment by the security police. He later decides to seek asylum in England to expose the corrupt and racist nature of the South African authorities. After a long trek, Woods is eventually able to escape to the Kingdom of Lesotho, disguised as a priest. His wife Wendy (Penelope Wilton) and their family later join him. With the aid of Australian journalist Bruce Haigh (John Hargreaves), the British High Commission in Maseru, and the Government of Lesotho, they are flown under United Nations passports and with one Lesotho official over South African territory, via Botswana to London, where they were granted political asylum.The film's epilogue displays a graphic detailing a long list of anti-apartheid activists (including Biko), who died under suspicious circumstances while imprisoned by the government. Contrary to popular belief, the listing's dates in the graphic actually stopped in June 1987, a few months before the film's release, as the Apartheid government stopped releasing the increasingly obviously false \"official explanations\" for deaths in custody.","language":"English Afrikaans Xhosa Zulu","Reception":"Among mainstream critics in the U.S., the film received mostly positive reviews. Rotten Tomatoes reported that 81% of 21 sampled critics gave the film a positive review, with an average score of 6.4 out of 10.[8]Rita Kempley, writing in The Washington Post, said actor Washington gave a \"zealous, Oscar-caliber performance as this African messiah, who was recognized as one of South Africa's major political voices when he was only 25.\"[10] Also writing for The Washington Post, Desson Howe thought the film \"could have reached further\" and felt the story centring on Woods's character was \"its major flaw\". He saw director Attenborough's aims as \"more academic and political than dramatic\". Overall, he expressed his disappointment by exclaiming, \"In a country busier than Chile with oppression, violence and subjugation, the story of Woods' slow awakening is certainly not the most exciting, or revealing.\"[11] Roger Ebert in the Chicago Sun-Times offered a mixed review calling it a \"sincere and valuable movie\" while also exclaiming, \"Interesting things were happening, the performances were good and it is always absorbing to see how other people live.\" But on a negative front, he noted how the film \"promises to be an honest account of the turmoil in South Africa but turns into a routine cliff-hanger about the editor's flight across the border. It's sort of a liberal yuppie version of that Disney movie where the brave East German family builds a hot-air balloon and floats to freedom.\"[12]Janet Maslin writing in The New York Times saw the film as \"bewildering at some points and ineffectual at others\" but pointed out that \"it isn't dull. Its frankly grandiose style is transporting in its way, as is the story itself, even in this watered-down form.\" She also complimented the African scenery, noting that \"Cry Freedom can also be admired for Ronnie Taylor's picturesque cinematography\".[9] The Variety Staff, felt Washington did \"a remarkable job of transforming himself into the articulate and mesmerizing black nationalist leader, whose refusal to keep silent led to his death in police custody and a subsequent coverup.\" On Kline's performance, they noticed how his \"low-key screen presence served him well in his portrayal of the strong-willed but even-tempered journalist.\"[13] Film critic Gene Siskel of the Chicago Tribune gave the film a thumbs up review calling it \"fresh\" and a \"solid adventure\" while commenting \"its images do remain in the mind ... I admire this film very much.\" He thought both Washington's and Kline's portrayals were \"effective\" and \"quite good\".[14] Similarly, Michael Price writing in the Fort Worth Press viewed Cry Freedom as often \"harrowing and naturalistic but ultimately self-important in its indictment of police-state politics.\"[15]Mark Salisbury of TimeOut boasted on the film's merits by declaring the lead acting to be \"excellent\" and the crowd scenes \"astonishing\", while equally observing how the climax was \"truly nerve-wracking\". He called it \"an implacable work of authority and compassion, Cry Freedom is political cinema at its best.\"[16] James Sanford however, writing for the Kalamazoo Gazette, did not appreciate the film's enduring qualities, calling it \"a Hollywood whitewashing of a potentially explosive story.\"[17] Rating the film with 3 Stars, critic Leonard Maltin wrote that the film was a \"Sweeping and compassionate film\". He did however note that the film \"loses momentum as it spends too much time on Kline and his family's escape from South Africa\". But in positive followup, he pointed out that it \"cannily injects flashbacks of Biko to steer it back on course.\"[18]The film was nominated and won several awards in 1987–88.[19][20] Among awards won were from the British Academy of Film and Television Arts, the Berlin International Film Festival and the Political Film Society.The film premiered in cinemas on 6 November 1987 in limited release throughout the U.S. During its opening weekend, the film opened in a distant 19th place and grossed $318,723 in business showing at 27 cinemas.[28] The film Fatal Attraction opened in first place with $7,089,680 screening at 1,351 theaters.[1] The film's revenue dropped by 10.6% in its second week of release, earning $284,853. For that particular weekend, the film fell to 25th place showing in 19 cinemas. The film The Running Man unseated Fatal Attraction to open in first place with $8,117,465 in box office revenue showing at 1,692 cinemas.[1][28]Cry Freedom had one week in wider release beginning with the 19–21 February weekend in 1988.[1] The film opened in 14th place showing at 479 cinemas grossing $802,235 in box office business. The film went on to top out domestically at $5,899,797 in total ticket sales through an 4-week cinematic run.[1] For 1987 as a whole, the film would cumulatively rank at a box office performance position of 103.[1]Following its cinematic release, the film was released in VHS video format on 5 May 1998.[29] The Region 1 Code widescreen edition of the film was released on DVD in the United States on 23 February 1999. Special features for the DVD include; production notes, cast and filmmakers' biographies, film highlights, web links, and the theatrical cinematic.[30] Currently, there is no scheduled release date set for a future Blu-ray Disc version of the film, although it is available in other media formats such as Video on demand.[31]","box_office":"$5,899,797[1]","cinematography":"Ronnie Taylor","production_company":"Marble Arch Productions","directed_by":"Richard Attenborough","cry_freedom":"Theatrical release poster","release_dates":"6 November 1987","Production":"The premise of Cry Freedom is based on the true story of Steve Biko, the charismatic South African Black Consciousness Movement leader who attempts to bring awareness to the injustice of Apartheid; and Donald Woods, the liberal white editor of the Daily Dispatch newspaper who struggles to do the same after Biko is murdered. In 1972, Biko was one of the founders of the Black People's Convention working on social upliftment projects around Durban.[2] The BPC brought together almost 70 different black consciousness groups and associations, such as the South African Student's Movement (SASM), which played a significant role in the 1976 uprisings, and the Black Workers Project which supported black workers whose unions were not recognized under the Apartheid regime.[2] Biko’s political activities eventually drew the attention of the South African government which often harassed, arrested, and detained him. These situations resulted in his being banned in 1973.[3] The banning restricted Biko from talking to more than one person at a time, in an attempt to suppress the rising anti-apartheid political movement. Following a violation of his banning, Biko was arrested and later killed while in police custody. The circumstances leading to Biko's death caused worldwide anger, as he became a martyr and symbol of black resistance.[2] As a result, the South African government banned a number of individuals (including Donald Woods) and organizations, especially those closely associated with Biko.[2] The United Nations Security Council responded swiftly to the killing by later imposing an arms embargo against South Africa.[2] After a period of routine harassment against his family by the authorities, as well as fearing for his life,[4] Woods fled the country after being placed under house arrest by the South African government.[4] Woods later wrote a book in 1978 entitled: Biko, exposing police complicity in his death.[3] That book, along with Woods's autobiography Asking For Trouble, both being published in the UK, became the basis for the film.[3]Principal filming took place primarily in the Republic of Zimbabwe because of the tense political situation in South Africa at the time of shooting. Other filming locations included Kenya, as well as film studios in Shepperton and Middlesex, England.[5] The film includes a dramatized depiction of the Soweto uprising which occurred on 16 June 1976. Indiscriminate firing by police killed and injured hundreds of African schoolchildren during a protest march.[3]The original motion picture soundtrack for Cry Freedom was released by MCA Records on 25 October 1990.[6] It features songs composed by veteran musicians George Fenton, Jonas Gwangwa and Thuli Dumakude. At Biko's funeral they sing the hymn Nkosi Sikelel' iAfrika. Jonathan Bates edited the film's music.[7]","produced_by":"Richard Attenborough","starring":"Kevin Kline|Penelope Wilton|Denzel Washington|","running_time":"157 minutes","music_by":"George Fenton Jonas Gwangwa","edited_by":"Lesley Walker","budget":"$29 million"}