{"country":"United Kingdom Germany United States","distributed_by":"Walt Disney Studios Motion Pictures (North America) Lionsgate (UK)","Plot":"Over the course of a calendar year, Earth takes the viewer on a journey from the North Pole in January to the South in December, revealing how plants and animals respond to the power of the sun and the changing seasons. The film focuses on three particular species, the polar bear, African bush elephant and humpback whale.Starting in the high Arctic in January, as the darkness of winter gives way to the sun, a mother polar bear is shown emerging from her den with two new cubs. She needs food and must lead her cubs to her hunting ground on the sea ice before it begins to break up. By April, the sun never sets, and by August all the sea ice has melted. The mother and cubs have retreated to dry land, but a male polar bear is trapped at sea and must seek out land by swimming. He reaches an island with a walrus colony but is too exhausted to make a successful kill. He dies from injuries sustained in a walrus attack.African bush elephants are filmed from the air as they negotiate a dust storm in the Kalahari Desert. June is the dry season and they must follow ancient paths passed down through generations to reach watering holes. A mother and calf are separated from the herd in the storm but manage to reach shelter. The matriarch leads the herd to a temporary watering hole, but they must share it with hungry lions and scavenger white-backed vultures. The lions are shown attacking a solitary elephant at night, when their superior vision gives them the upper hand. The herd times its arrival at the Okavango Delta to coincide with seasonal floodwaters which transform the desert into a lush water world.A humpback whale mother and calf are filmed from the air and underwater at their breeding grounds in the shallow seas of the tropics. There is nothing here for the mother to eat, so she must guide her calf on a 4,000-mile (6,400 km) journey south to the rich feeding grounds near Antarctica, the longest migration of any marine mammal. En route, they negotiate dangerous seas where great white sharks are filmed breaching as they hunt. Sea lions, and sailfish and dolphins combine to bait a shoal of small fish. By October they enter polar waters, and by December the Antarctic sun has melted the sea ice to form sheltered bays. Here, the whales are shown feeding on krill by trapping them in bubble nets.The stories of these individual creatures are woven into the film alongside a great many additional scenes. The supporting cast of animals include mandarin ducklings filmed jumping from their tree hole nest, Arctic wolves hunting caribou, cheetah hunting Thomson's gazelle, elephants charge at white-backed vulture, birds of paradise displaying in the New Guinea rainforest, Adelie penguins in the Antarctic and demoiselle cranes on their autumn migration across the Himalayas.Time-lapse photography is used to show the blossoming of spring flowers, seasonal changes to deciduous forests, clouds sweeping up Himalayan valleys, and the growth of jungle spores and fungi.","language":"English","Themes":"The narration is woven around the theme of anthropogenic environmental change. The three species it features are used to illustrate particular threats to the planet's wildlife. In the Arctic, rising temperatures are causing a greater area of sea ice to melt and threatening the polar bear with extinction as early as 2030. Global warming is also disrupting the planet's weather systems and making seasonal rainfall patterns less predictable. This poses a threat to creatures like elephants, which must travel greater distances to reach water. Rising ocean temperatures have started to kill the plankton on which humpback whales and most other sea life depend. The film ends with the message that \"it's not too late to make a difference.\"\"Of all the planets in our universe, there is only one we know can support life. Just the right distance from its sun, with a perfect climate, it's been called the lucky planet. All life on Earth is built on chance and powered by the Sun, but the delicate balances of our world are faltering as the planet struggles to support our growing demands. This is the time to take stock of what we have, and what we stand to lose.\"","Reception":"Rotten Tomatoes reported that 87% of critics gave the film positive reviews based on 91 reviews, the second highest score of all the Disneynature films (behind Monkey Kingdom, which has a score of 93%), with an average score of 7.2 out of 10. Its consensus stated: \"With its spectacular and extensive footage, Earth is both informative and entertaining.\" [9] Another review aggregator, Metacritic, which assigns a normalized rating out of 100 top reviews from mainstream critics, gave an average score of 72, being a generally favorable review, based on 26 reviews.[10]On its first day of release in the US, Earth opened at #1, grossing $4,023,788 from 1,810 theaters. For its first weekend, it opened at #5, grossing $8,825,760, as well as $14,472,792 over the five-day period. Despite dropping to #7 the next weekend, taking in $4,340,235, it took in $12,017,017 over the previous week (including Sunday), and ending up with a two-week total of $22,004,284. It closed on July 30, 2009 after 100 days of release, ending up with a final gross of $32,011,576, making it a modest success in the US.Earth picked up an additional $76,931,115 at the international box office. It took over $30 million in Germany alone, became one of the three highest-grossing films of the year in France and had the best opening of any natural history documentary in Spain. By contrast, in the UK Earth debuted on just 14 screens and amassed less than £75,000 in ticket sales.In January 2008, the Japanese version of Earth, narrated by actor Ken Watanabe, knocked Hollywood blockbuster I Am Legend off the top of the box office despite opening on half the number of screens. It went on to gross more than 2 billion yen ($18.5 million), making it the most successful documentary there of the last 10 years.Its worldwide total of $108,942,691 made Earth a commercial success and placed it second on the all-time list of highest-grossing nature documentaries, behind March of the Penguins.","box_office":"$109 million[2]","production_company":"Disneynature BBC Natural History Unit BBC Worldwide Discovery Channel Greenlight Media","directed_by":"Alastair Fothergill Mark Linfield","narrated_by":"Patrick Stewart (British release) James Earl Jones (American release) Constantino Romero (Spanish release) Ulrich Tukur (German release)","earth":"North American release poster","release_dates":"October 10, 2007 (2007-10-10) (France)|November 16, 2007 (2007-11-16) (United Kingdom)|January 12, 2008 (2008-01-12) (Germany)|April 22, 2009 (2009-04-22) (United States)||","Production":"Earth was produced by Alix Tidmarsh of BBC Worldwide and Sophokles Tasioulis of Greenlight Media. Following Deep Blue, it is the second film of a five-picture deal between the two companies. The process of bringing Planet Earth and Earth to the screen took over 5 years. With a budget of $47 million, the film is the most expensive production in the history of documentary filmmaking.[5] Principal photography began in 2004 and was completed in 2006.","produced_by":"Alix Tidmarsh Sophokles Tasioulius","running_time":"99 minutes (UK version),[1] 90 minutes (U.S. version)","music_by":"George Fenton Berliner Philharmoniker","edited_by":"Martin Elsbury Vartan Nazarian","Release":"Earth received its world premiere at Spain's San Sebastian International Film Festival in September 2007. It was released across Europe in the fourth quarter of 2007 and early 2008 to much success. In April 2008, it was announced that Earth would be the first feature released by Disneynature, a newly formed film unit of the Walt Disney Studios and partnership with Walt Disney Pictures, specializing in natural history documentaries since True-Life Adventures.[6] The film was released in the US on April 22, 2009, with James Earl Jones narrating in place of Patrick Stewart. Walt Disney Studios Motion Pictures also handled distribution in Canada and Latin American countries.[7] Outside of those territories, the film's distribution rights were sold to various independent distributors including; Lionsgate in the U.K. and Australia, Gaumont in France, and Universum Film AG in Germany.[8]","written_by":"Alastair Fothergill Mark Linfield Leslie Megahey","budget":"$47 million","Regional differences":"In addition to replacing Patrick Stewart with James Earl Jones as a narrator, the U.S. version uses a more dramatic soundtrack and runs only 90 minutes, compared to the original cut's 99 minutes."}