{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Kristofor Brown Seth Rogen","story_by":"Kristofor Brown John Hughes Seth Rogen","Plot":"On the first day of high school, Wade and Ryan witness two bullies, Filkins and Ronnie, attack a geek, Emmit, by stuffing him into his locker. Wade intervenes. Filkins and Ronnie begin endlessly targeting Wade, Ryan and Emmit.Wade suggests hiring a bodyguard. They place an ad on the Internet, and after a series of disturbing interviews with ex-cons and hired guns, they end up selecting Drillbit Taylor (Owen Wilson). Drillbit pretends to be a martial arts expert and mercenary, but is really a homeless beggar. His real intention of becoming their bodyguard was to rob them and use the money to buy a ticket to Canada. Drillbit tells the boys to find some common interests and become friends with Filkins and Ronnie. Ryan challenges Filkins to a rap battle, but gets carried away and ends up humiliating Filkins. As an angry Filkins, alongside Ronnie, ambushes Wade, Ryan, and Emmit. The boys try using a tactic Drillbit taught them, but it ultimately fails. The boys are furious with Drillbit's teachings. But they decide to bring him to school as a substitute teacher, and in that capacity he is able to protect them. While there, Drillbit meets a teacher, Lisa Zachey (Leslie Mann), and they start a relationship.One morning as his mother is driving him to school, Ronnie sees Drillbit taking a shower at the beach; his mother reveals that he is homeless. Ronnie tells Filkins and Filkins finds the boys and punches Drillbit. Later on, at Wade's house, they catch Drillbit's homeless friends stealing everything in sight, leaving the house completely empty. Drillbit confesses that his real name is Bob and he went AWOL from the U.S. Army and his name was drillbit because he hurt his pinky in high school with a drillbit. The boys fire Drillbit, who later recovers all of Wade's possessions and places them back before Wade's parents return home. Unfortunately, the boys accidentally let slip about Drillbit. Their parents take things up with the principal, who contacts the police. Filkins plays innocent and charms all the adults; Filkins continues to ridicule the boys after Drillbit's disappearance. Tensions finally burst when Filkins interrupts Wade's attempt to ask his crush, Brooke Nguyen, out. Without realizing what he was doing, Wade challenges Filkins to a fight.Wade and Ryan arrive at Filkins' house, where he is hosting a party; Ronnie shows up to help Filkins against them. Emmit, who initially refused to fight, comes to their aid and for a while causes quite a lot of pain to Filkins, almost defeating him; but Ronnie knocks him out while trying to break Filkins' leg. Drillbit shows up and Filkins punches him. Drillbit refuses to fight back until it is revealed Filkins is not a minor (he's 18, therefore, he's not really emancipated); Drillbit quickly begins fighting and knocks Filkins out cold. He is about to defeat Ronnie, but he's a minor (he's only 17). Within minutes, the police arrive and Drillbit flees for fear of prosecution. Filkins wakes up and throws a samurai sword at the boys, but Drillbit catches it. He saves them, at the cost of half of his pinkie finger in the process.Filkins is arrested and shipped off to Hong Kong where he will live with his parents under house arrest until he turns 21 as an alternative to being sent to prison for the attempted murder of the three boys with the sword along with his breaking many underage drinking laws. Another condition of house arrest as opposed to prison is that he is to never attempt to make any contact Wade, Ryan and Emmit ever again. Ronnie no longer ridicules the other boys because Filkins is gone and reveals that he had been bullied by him several times. As a result, Ronnie has become kind to everyone, and is now friends with the boys. Drillbit is taken to jail, but ends up being released within three weeks. He is reunited with Lisa and the boys.In a post-credits scene, Drillbit is revealed to have become a school nurse and asks a kid with a bloody nose if he needs a bodyguard.","language":"English","Reception":"In its opening weekend, the film grossed $10.2 million in 3,056 theaters in the United States and Canada, ranking #4 at the box office.[2] The film has grossed $32,862,104 in the United States and $16,828,521 in foreign countries adding to a total worldwide gross of $49,690,625.Drillbit Taylor received mostly poor reviews, with Rotten Tomatoes giving it a 25% saying: \"Owen Wilson's charms can't save Drillbit Taylor, an unfunny, overly familiar bullied-teen comedy.\"[3] The film received a 41/100 rating on Metacritic, indicating \"mixed or average reviews\".[4]The film was released on both rated (102 minutes) and unrated (109 minutes) DVD and Blu-ray on July 1, 2008. About 620,927 units have been sold, bringing in $11,669,617 in revenue.","box_office":"$49.7 million","cinematography":"Fred Murphy","production_company":"Apatow Productions","Marketing":"Marketing for the movie included television promos and coming attractions previews, but actor Owen Wilson did not conduct any interviews to promote the film. Instead, Paramount Pictures had Wilson record introductions for Fox's Sunday night primetime shows such as The Simpsons, American Dad!, King of the Hill, Family Guy, and Unhitched. The character of Drillbit was also featured as a \"Superstar\" on the RAW page of WWE.com for a period of time. Wilson's publicist said his availability was limited due to filming Marley & Me.John Horn and Gina Piccalo of the Los Angeles Times wrote that the reason for Wilson's limited promotional schedule was due to studio executives being worried that interviewers would bring up Wilson's hospitalization for severe depression in the summer of 2007.[1]","directed_by":"Steven Brill","release_dates":"March 21, 2008 (2008-03-21)|||||","produced_by":"Judd Apatow Susan Arnold Donna Arkoff Roth","starring":"Owen Wilson Troy Gentile Nate Hartley David Dorfman Alex Frost Josh Peck Leslie Mann","running_time":"102 minutes (theatrical release) 109 minutes (unrated cut)","drillbit_taylor":"Theatrical release poster","music_by":"Christophe Beck","edited_by":"Brady Heck Thomas J. Nordberg","budget":"$40 million"}