{"country":"United States","distributed_by":"Columbia Pictures","Plot":"On August 12, 2011, large masses thought to be meteors land in the oceans near several major coastal cities. The objects are discovered to be spacecraft containing hostile extraterrestrial life. Marines from Camp Pendleton arrive in Los Angeles, including SSgt. Michael Nantz (Eckhart), an Iraq War veteran. Nantz was to begin retirement, but because of the attack, he is made the acting platoon sergeant for 1st Platoon, Echo Company, of the 2nd Battalion 5th Marines.[5]Under the command of 2ndLt William Martinez (Rodríguez), the platoon arrives at Santa Monica Airport, now a Forward Operating Base. The alien ground forces have no apparent air support, so the Air Force prepares to carpet bomb the Santa Monica area, and the platoon is tasked with rescuing civilians from an LAPD police station in West Los Angeles before the bombing. As they advance through the city, they are ambushed and suffer multiple casualties, namely Grayston, Guerrero and Lenihan in the firefight. Nantz takes Imlay and Harris to look for Lenihan, who is missing from the group after having been wounded. After fighting off a hostile alien, they manage to regroup and team up with a group of Army National Guard soldiers from the 40th Infantry Division, and an Air Force intelligence TSgt, Elena Santos (Michelle Rodriguez). At the police station, the platoon finds five civilians: veterinarian Michele (Moynahan), children Hector Rincon (Cass), Kirsten (King) Amy (Gould), and Hector's father Joe (Peña). A helicopter arrives to evacuate the wounded Marines, but cannot rescue the civilians due to weight restrictions. As the helicopter takes off, it is destroyed by alien air forces, killing Grayston, Guerrero, Lenihan and Simmons.[5]The Marines commandeer a city bus for evacuation. They also vivisect a wounded alien with the help of Santos and find a vulnerable spot in its torso, as well as learning that the alien aircraft are drones that track down humans through radio transmissions. Santos reveals that her original mission was to locate the aliens' central command center, believing that its destruction would deactivate the drones. On the I-10 freeway, the bus comes under attack. Because the off-ramp is destroyed, the Marines are forced to rappel the civilians off the freeway. Marines Stavrou (Pesi) and Mottola (Liao) and the National Guard soldiers are killed, while Joe and Lieutenant Martinez are wounded. Martinez detonates explosives inside the bus, killing himself and the aliens, leaving Nantz in command. The surviving Marines Nantz, Santos, Imlay, Kerns, Lockett, Harris, Adukwu and the civilians escape the bombing zone. A news report speculates that the aliens are seeking Earth's water for fuel while attempting to colonize the planet and eradicate humans. The team prepares for the bombing, but nothing happens. Returning to the FOB, the Marines find that it is destroyed and the military is retreating from Los Angeles. The Marines plan to escort the civilians to an alternate extraction point. Joe dies from his wounds and Lockett confronts Nantz over his brother, Cpl Dwayne G. Lockett and the others who were killed in Nantz's last tour. They come to peace when Nantz explains that he thinks of them every day, and recites each person's name, rank and serial number. Nantz then says that the surviving Marines should move forward united to honor their fallen comrades, including Joe. They successfully reach the extraction point and evacuate through a helicopter.[5]In mid-air, the chopper experiences a brief loss of power. Nantz theorizes that they are hovering over a location occupied by the alien command center as it relays radio energy to its drones. He decides to recon the area alone, but his team insists on accompanying him. Searching underground, the Marines confirm the presence of a large alien vessel. Kerns radios in to request for missiles, which Nantz manually directs using a laser designator while the others defend his position. Despite Kerns being killed when a Drone spots his signals, the Marines succeed in routing a missile to the command module, which is destroyed. The alien ground forces retreat as their uncontrolled drones crash, just as reinforcements for the Marines arrive. At a Temporary Operating Base in the Mojave Desert, Nantz, Imlay, Lockett, Harris, and Adukwu, the six survivors of the original platoon along with Santos, are greeted as heroes. Despite orders to rest, they join the rest of the Marines in retaking Los Angeles as other countries wage similar military operations against the hostile species.[5]","battle:_los_angeles":"Theatrical release poster","language":"English","Reception":"Battle: Los Angeles received generally negative reviews. Review aggregater Rotten Tomatoes gave the film a rating of 35%, based on 193 reviews, with an average rating of 4.8/10. The site's critical consensus reads, \"Overlong and overly burdened with war movie clichés, Battle: Los Angeles will entertain only the most ardent action junkies\".[32] Review aggregator Metacritic assigned the film a weighted average score of 37 out of 100, based on 35 critics, indicating \"generally unfavorable reviews\".[33]Noted film critic Roger Ebert panned Battle: Los Angeles in a lengthy review, calling the movie \"noisy, violent, ugly and stupid\", giving the film a mere half star rating. Though he praised Aaron Eckhart's performance, Ebert heavily criticized the film's writing, effects designs, camerawork and editing. He closed his review by saying, \"When I think of the elegant construction of something like Gunfight at the O.K. Corral, I want to rend the hair from my head and weep bitter tears of despair. Generations of filmmakers devoted their lives to perfecting techniques that a director like Jonathan Liebesman is either ignorant of, or indifferent to. Yet he is given millions of dollars to produce this assault on the attention span of a generation.\"[34] Anthony Lane of The New Yorker gave the film a better review only by comparing it to films that were worse, stating: \"Battle: Los Angeles is a lot more fun than bludgeoning, soul-draining follies like Terminator Salvation or the Transformers films.\"[35]Battle: Los Angeles was largely given poor reviews by the Los Angeles Times,[36] The New York Times,[37] USA Today,[38] Entertainment Weekly,[39] and Variety.[40] One stand out, the San Francisco Chronicle,[41] gave it a sympathetic review. Kim Newman of Empire rated the film 2 stars out of 5, conceding that the combat scenes were good, but criticizing its lack of originality, writing \"Things blow up good and Eckhart is a classier actor than his role warrants, but we’ve all been here before.\"[42] Nigel Floyd of Time Out rated the film 2 stars saying that it \"... lumbers the flat military characters with hackneyed dialogue and corny sentimentality\".[43]Neil Smith of Total Film magazine rated the film as 3 stars out of 5 and summarized, \"Imagine Black Hawk Down with ET's instead of Somalis and you'll have the measure of an explosive if functional actioner that will do while we're waiting for summer's big guns to arrive\".[44] Movie critic Michael Phillips of the Chicago Tribune also rated the film 3 out of 5 stars, remarking how the story was \"gratifyingly narrow: It's about a handful of people trying to get a handful of blocks to a safe zone on the west side of LA, and not get killed in the process. The saving-the-world part is almost an afterthought.\"[45] In mild positive sentiment, Ty Burr of The Boston Globe emphatically stated that the film was a \"loud, frenetic, viscerally gripping two-hour tour of duty that mostly plays fair by the rules of the genre and mostly avoids macho posturing.\"[46] Similarly, Connie Ogle of The Miami Herald deduced that Battle: Los Angeles was \"not so goofy as Independence Day, not so terrifying as War of the Worlds, and it utterly lacks the imagination and emotional resonance of District 9\" but was a \"solid popcorn movie, with plenty of action, explosions and low-key mayhem unlikely to scar even the most fragile of psyches.\"[47] In his review for The Arizona Republic, critic Bill Goodykoontz called the film \"good, dumb fun.\"[48] Michael Phelps wrote in The Chicago Tribune, \"Original, it's not. Exciting, it is. This jacked-up B-movie hybrid of Black Hawk Down and War of the Worlds is a modest but crafty triumph of tension over good sense and cliche.\"[49]Battle: Los Angeles received an award nomination for actor Peña in the category of Favorite Movie Actor, along with a nomination for Rodriguez for Favorite Movie Actress from the ALMA Awards. Additionally, composer Tyler won the BMI TV Music Award for his work on the film.[50][51]Battle: Los Angeles debuted on March 11, 2011 in the United States screening at 3,417 theaters. It grossed $13,399,310 on its opening day, which was the best opening-day gross for 2011 until the record was surpassed by Fast Five. Overall, the film made $35,573,187 and ranked number one on its opening weekend ahead of Red Riding Hood and Mars Needs Moms.[52] The film dropped to No. 2 after a week when Rango topped the box office on St. Patrick's Day. During its final week in release, Battle: Los Angeles opened in a distant 46th place with $68,843 in revenue.[53] At the end of its run in 2011, the film has grossed $83,552,429 in the United States and Canadian markets and $128,266,925 in international markets, for a worldwide total of $211,819,354.[54]","box_office":"$211.8 million[3]","cinematography":"Lukas Ettlin","production_company":"Relativity Media Original Film","Marketing":"A first-person shooter video game developed by Live Action Studios and published by Konami was released on Xbox Live Arcade on March 11, 2011. The OnLive game service (as part of its Playpack subscription service) was made available to subscribers on March 15, and on the PlayStation Network on March 22.[26] Eckhart reprised his role for the game.[27] Players assume the role of Corporal Lee Imlay throughout the game.","directed_by":"Jonathan Liebesman","release_dates":"March 8, 2011 (2011-03-08) (Westwood premiere)|March 11, 2011 (2011-03-11)||||","Production":"Jonathan Liebesman intended the film to be a realistic depiction of an alien invasion in the style of a war film, taking inspiration from the films Black Hawk Down, Saving Private Ryan, and United 93 for his documentary style of filming.[6][7][8] Liebesman also drew inspiration from YouTube videos of Marines fighting in Fallujah for the look of the film.[9][10] As a result, the film was not shot in 3D as the director felt that combined with the handheld camera style of shooting would make the audience \"throw up in two minutes.\"[7] Instead, standard film was used, intercutting footage from three different cameras.[6] The filmmakers tested shooting the film digitally on a Red camera, but found the camera could not capture the same quality image as standard film.[6] The film was shot for a PG-13 rating, as the director felt making the film overly gory did not suit the more suspenseful tone they were trying to achieve.[6] Screenwriter Chris Bertolini tried to include humour and suspense as well as action, which he felt were important elements to help draw the audience into the drama.[6] In an interview with IGN, Liebesman described the interaction between actors, as well as the natural development of the film during pre-production exclaiming, \"What comes out of that is a lot of tiny little details and tiny things that these guys bring out,\". He also noted, \"Whether it's, just off the top of my head, Ne-Yo, who plays Harris, and Gino [Pesi], who plays Stavrou, have a great relationship, a lot of which they made up behind the scenes. Just little things, characters that you thought, 'Ah, s--t this wasn't really in the script.' These guys, like Guerrero (Neil Brown, Jr.). He's one of the guys way back there but he's got a personality and he brought it and it was just stuff you don't expect.\"[11][12]The film's story was partly inspired by the Battle of Los Angeles, a rumored enemy attack and subsequent anti-aircraft artillery barrage that took place in Los Angeles during World War II, on the night of February 24, 1942; this real incident was used as the main focus of an early teaser trailer to promote the film, in which it is strongly implied the alien invaders spent decades planning their attack and invasion.[4] The filmmakers drew upon this historical event in an attempt to help ground the film in reality.[13] Aaron Eckhart said that the objective of the film was to make as realistic an alien invasion movie as possible; \"The goal was: this is a war movie, a documentary style war movie—with aliens in it.\"[14] The film however, was not the first motion picture to touch upon the events surrounding the tale of the Pacific air raids. In 1979, the comedy drama film 1941 directed by Steven Spielberg, alluded to the 1942 shelling as well as other surprise military engagements.[15] On March 12, 2011, a day after the official release for Battle: Los Angeles, a mockbuster produced by the independent film company The Asylum, entitled Battle of Los Angeles, premiered on the Syfy cable TV channel in the United States.Filming took place from September 2009 through December 2009 in Shreveport and Baton Rouge, Louisiana[16] (with some scenes filmed at Camp Pendleton in San Diego, CA). Louisiana was chosen instead of Los Angeles mainly due to financial advantages.[17] Principal photography began in the second week of September in Shreveport with scenes depicting a destroyed interstate filled with cars, an overturned tanker truck, and a crashed helicopter. Post-production lasted throughout 2010 and into 2011. Special effects used in the principal photography included pyrotechnics. The most climactic of all was a large fireball-producing explosion which was said to have alarmed some residents and passers-by. Film crews implemented use of a large \"green-screen\" billboard at the base (end) of the \"destroyed\" interstate to use later for inserting CGI images of Los Angeles.[18] The actors went through three weeks of boot camp, in order to learn how to realistically operate as a Marine platoon.[6] In addition, Eckhart had done training with the Marines for a few months beforehand in weapons training and drills.[17] On set, military technical advisors worked with the actors to ensure they gave a realistic performance.[19] Eckhart broke his upper arm when he fell off a ledge during an action sequence, but continued to work for the remainder of the film without having it put in a cast.[17]There was military support for filming. Numerous Marine units assisted in filming, including infantry from 2nd Battalion 1st Marines, MV-22 Ospreys from VMMT-204 (based at Marine Corps Air Station New River in North Carolina), CH-46 Sea Knights from HMM-268 and HMM-774 (based in Camp Pendleton and Naval Station Norfolk, respectively), and reservists from 3rd Battalion 23rd Marines based in Belle Chasse, Louisiana.[20]While Liebesman tried to use practical effects whenever possible (although green screen and CGI were used), such as for explosions, 90% of the aliens are computer generated, as the director felt they would be too difficult to achieve any other way.[6][7] The invaders were designed by Paul Gerrard,[8] who made them to appear \"very alien\", neither arthropod nor vertebrate, while Liebesman described them as \"genocidal Nazis... They look at us like we look at ants.\"[7] Liebesman wanted the aliens to appear to function as a real army, complete with medics and different ranking officers, and using tactics such as taking cover to protect themselves.[7][9] Liebesman also confirmed that the aliens are invading for the Earth's natural resources, specifically because the Earth is 70% covered with water.[9]Sony investigated the possibility of legal action against the filmmakers Greg and Colin Strause, who were hired to do visual effects work on Battle: Los Angeles through their special effects company Hydraulx. Sony suspected the Strause brothers had created their own Los Angeles-based alien invasion film Skyline, which would compete with the Battle: Los Angeles release, by using resources they had gained while working on the film without the consent of Sony Pictures.[21] A spokesman for the Strauses responded by saying, \"Any claims of impropriety are completely baseless. This is a blatant attempt by Sony to force these independent filmmakers to move a release date that has long been set by Universal and Relativity and is outside the filmmakers' control.\"[22] Sony initiated arbitration against Hydraulx and the Strause brothers, but later dismissed the arbitration.[23]The score was composed & conducted By Brian Tyler and performed by the Hollywood Studio Symphony. The soundtrack for the film released on March 8, 2011.[24] A song used in the trailer is \"The Sun's Gone Dim and the Sky's Turned Black\" by Jóhann Jóhannsson.[25] Songs used in the film were \"California Love\" by 2Pac featuring Dr. Dre and Roger Troutman but not included on the soundtrack album.","produced_by":"Jeffrey Chernov|David Greenblatt|","starring":"Aaron Eckhart|Michelle Rodriguez|Ramon Rodriguez|Bridget Moynahan|Ne-Yo|Michael Peña|","running_time":"116 minutes[1]","Sequel":"Eckhart has stated he would be interested in returning for a sequel.[55] In an interview on March 25, 2012, director Jonathan Liebesman announced that work on a script for a sequel had begun. He also commented that the budget \"will be as big.\"[56]","music_by":"Brian Tyler","edited_by":"Christian Wagner","Release":"The film had its world premiere in the United States on March 11, 2011. The next day, on March 12, it premiered in the Asia Pacific region in Taiwan. Other European markets in Germany and Denmark had the film premiering on April 14.[28] The film made its debut in Sweden on April 20 and Switzerland on April 22nd. It went into general theatrical release in Latin America in Argentina on March 10.[28] Certain Middle Eastern markets; the United Arab Emirates and Lebanon saw the premiere of the film on March 10, while in South Africa it screened later in the month on March 25.[citation needed]Following its cinematic release in theaters, the Region 1 Code widescreen edition of the film was released on DVD by Sony Pictures Home Entertainment in the United States on June 14, 2011. Special features for the DVD include; Behind The Battle, Building the Aliens, Acting with Aliens, Shooting the Aliens, Preparing for Battle, and Creating L.A. in LA.[29] Additionally, a combo two-disc Blu-ray Disc/DVD was also released by Sony Pictures Home Entertainment on June 14, 2011. Special features for the DVD/Blu-ray Disc pack include; PS3 Theme, Behind The Battle, Directing the Battle, Building the Aliens, Acting with Aliens, Shooting the Aliens, Preparing for Battle, Boot Camp, Creating L.A. in LA, The Freeway Battle, Command Control, Staff Sergeant Nantz, Marine Behind The Scenes, Aliens Ambush The Marines, Battling Unknown Forces, Technical Sergeant Santos, Alien Autopsy, Gas Station Explosion, Visual FX on the Freeway, Do You Believe in Aliens?, and Alien Command & Control.[29]Concurrently, the widescreen hi-definition Blu-ray version of the film was released on June 14, 2011, too. Special features include; PS3 Theme, Resistance 3 Game Demo Hybrid—PS3 Game, Behind The Battle, Directing the Battle, Building the Aliens, Acting with Aliens, Shooting the Aliens, Preparing for Battle, Boot Camp, Creating L.A. in LA, The Freeway Battle, Command Control, Staff Sergeant Nantz, Marine Behind The Scenes, Aliens Ambush The Marines, Battling Unknown Forces, Technical Sergeant Santos, Alien Autopsy, Gas Station Explosion, Visual FX on the Freeway, Do You Believe in Aliens?, and Alien Command & Control.[29] A supplemental viewing option for the film in the media format of Video on demand is available as well.[30]Battle: Los Angeles is one of the first titles to be re-mastered in the ultra-high resolution format 4K.[31]","written_by":"Chris Bertolini","budget":"$70 million[2]"}