{"country":"West Germany|United States|","distributed_by":"Island Pictures","Plot":"German tourist Jasmin Münchgstettner (Sägebrecht) from Rosenheim and her husband fight whilst they are driving across the desert. She storms out of the car and makes her way to the isolated truck stop, which is run by the tough-as-nails and short-tempered Brenda (Pounder), whose own husband, after an argument out front, is soon to leave as well. Jasmin takes a room at the adjacent motel. Initially suspicious of the foreigner, Brenda eventually befriends Jasmin and allows her to work at the café.The café is visited by an assortment of colorful characters, including a strange ex-Hollywood set-painter (Palance) and a glamorous tattoo artist (Kaufmann). Brenda's son (Darron Flagg) plays J. S. Bach preludes on the piano. With an ability to quietly empathize with everyone she meets at the café, helped by a passion for cleaning and performing magic tricks, Jasmin gradually transforms the café and all the people in it.","bagdad_café":"French-language film poster","language":"German|English|","Reception":"The film had positive reviews.[2][3][4] It holds an 88% approval rating on Rotten Tomatoes.[5]The film was successful at the box office, with a US gross of $3.59 million.[6][7]","Television series":"In 1990 the film was re-created as a television series starring James Gammon, Whoopi Goldberg, Cleavon Little, and Jean Stapleton, with Stapleton as the abandoned tourist, and Goldberg as the restaurant operator. In the TV version the tourist was no longer from Germany. The series was shot in the conventional sitcom format, before a studio audience.[9] The show did not attract a sizable audience, being aired against ABC's more successful series, Family Matters, and it was cancelled after one season.[10]","cinematography":"Bernd Heinl","production_company":"Bayerischer Rundfunk Hessischer Rundfunk Pelemele Film Pro-ject Filmproduktion","directed_by":"Percy Adlon","Soundtrack":"The soundtrack has the song \"Calling You,\" by Jevetta Steele, and has a track in which the director narrates the story, including the film's missing scenes.The principal piano pieces heard, performed by Darron Flagg, are preludes from Book I of Bach's The Well-Tempered Clavier: the C major, no. 1, BWV 845; the C minor, BWV 846, no. 2; and the D major, no. 5, BWV 850.Harmonica was performed by William Galison.","release_dates":"12 November 1987 (1987-11-12) (Europe)|22 April 1988 (1988-04-22) (US)||||","produced_by":"Percy Adlon|Dietrich von Watzdorf|","starring":"Marianne Sägebrecht|CCH Pounder|Jack Palance|","running_time":"108 minutes (German) 95 minutes (US)","music_by":"Bob Telson","edited_by":"Norbert Herzner","written_by":"Percy Adlon|","Location":"Bagdad, California is the original setting (Bagdad, Arizona is an unrelated town). There was an actual Bagdad Cafe that existed in the 1960s when U.S. Route 66 ran through the town. The town of Bagdad included a café, a gasoline station, cabins for rent, and an airstrip. When Interstate 40 opened and bypassed the two-lane Route 66, the town's economy collapsed and the businesses all closed; eventually the town was completely razed. It is marked today by a clearing on the north side of old Route 66 and a single tree.The film was shot at what was then the Sidewinder Cafe in Newberry Springs, California, 50 miles west of the original site of Bagdad on old U.S. 66. Since then, the café has become something of a tourist destination and to capitalize on the movie it changed its name to the Bagdad Café. A small notice board on the café wall features snapshots of the film's cast and crew."}