{"country":"Canada","distributed_by":"National Film Board of Canada","language":"English","Reception":"In April 1954, Corral would play theatrically across Canada and in some American cities, including Washington, D.C. Individual films in the Canada Carries On series were further distributed worldwide by the NFB and were also made available to film libraries operated by university and provincial authorities.[4] A total of 199 films in the Canada Carries On series were produced before the series was canceled in 1959.[5]","Synopsis":"With the aid of a trained dog, a cowboy (Wallace Jensen) in southwestern Alberta, has located and rounded up a large herd of wild horses. Driving the mustangs into a corral at the Cochrane Ranch, he begins the process of \"breaking\" each horse. The process is a familiar one for cowboys that requires years of experience and a knowledge of handling horses.Selecting one wild horse that is marked with a white streak on its face, the cowboy lassoes the horse and cinches the rope to a large stump, gradually pulling the animal closer to him. Once the wild horse gets used to his hands near the head, ears and neck, the cowboy ties a rope halter on its head. The next step is to introduce a loose halter, fitted without a bridle and bit and finally, a blanket and saddle on the half-broken steed.The cowboy mounts the rearing, high-spirited mustang, and driving through the open corral, rides rapidly at break-neck speed across the Alberta Rocky Mountain Foothills, until his mount is finally able to get used to his rider.[Note 1] The cowboy reins in the charging steed, slowing the gait to a trot, finally heading back to the ranch.","cinematography":"Wolf Koenig","directed_by":"Colin Low","Awards":"Corral received the Best Documentary award at the 1954 Venice Film Festival.[2]","corral":"DVD cover art","release_dates":"April 1954 (1954-04)|||||","Production":"Filmmaker Colin Low got the idea for the film after attending a cattle auction in 1952 with his father, who had worked as a foreman at the Cochrane Ranch, in what is now Cochrane, Alberta. The following summer, Low asked NFB colleague Wolf Koenig, an ex-farm boy, if he would like to come to Alberta to make a film about a cowboy. Koenig was in the NFB Animation Department, with film becoming his first live-action production using a new Arriflex cinema camera fitted with a gyro stabilizer.[2]Corral has no narration, [Note 2] although Low had been initially worried that he would need extensive narration to explain the process of horse breaking. The film represents a break in tradition for the NFB, which had until that time, relied heavily on narration in its documentaries. Low had left the narration for colleague Stanley Jackson to write over the weekend. When Low and producer Daly arrived on Monday to see the finished film Jackson had said, \"it's done.\" However, when they gathered around the moviola to watch the film, the visual were accompanied only by Rathburn's musical score. \"Where's the commentary?\" someone reportedly asked. Jackson replied, \"What would a commentary do for that?\"[1]The gentle guitar score and use of handheld camera also breaks with Hollywood's traditionally epic portal of the cowboy.[3]Corral was shot in 1953 at the Cochrane Ranch. Low's father provided the horses and his top hand, \"Wally\" Jensen. Low had written a script but Jensen re-wrote it as they filmed. Film producer Tom Daly edited the film with Eldon Rathburn writing the score for two jazz guitarists, based on well-known cowboy songs.[2]","produced_by":"Tom Daly","starring":"Wallace Jensen","running_time":"11 minutes, 32 seconds","music_by":"Eldon Rathburn (composer)|Stan Wilson (guitarist)|Al Harris (guitarist)|","edited_by":"Tom Daly","written_by":"Colin Low|Wallace Jensen|"}