{"directed_by":"Paul Hoen","distributed_by":"Disney-ABC Domestic Television","release_dates":"July 18, 2003","Plot":"Eddie Ogden is a 14-year-old at Cedar Valley High School, playing baseball for the Groundhogs, coached by his father. His father wants Eddie to win a scholarship for his baseball skills. Eddie likes baseball, but in his spare time, he watches The Food Network (specifically Bobby Flay). Eddie enjoys cooking for him and his friends.When the time comes to sign up for electives, Eddie's friends want to sign up for computer science. Eddie wants to join the class as well until he sees the home economics classroom. Eddie tricks his friends D.B. and Frankie into signing it so they all end up in home economics together.Eddie and his friends goof around and get into trouble frequently. But then Eddie learns of a million dollar cook-off that can get him into a culinary institute. He signs up secretly, afraid of what his friends and family will think. His mother learns of Eddie's interest and encourages him to go on. When Eddie's teacher announces to the class who is in the finals, everyone is shocked that Eddie actually entered and won. As a result, he is teased and humiliated relentlessly by his friends and the kids at school, as well as his brothers.Eddie starts spending more time on cooking and less on baseball. When his father learns of the cook-off, he is extremely disappointed. Eddie repeatedly switches between cooking and baseball as he struggles to decide between pleasing his father and pursuing his dream. In the process, he is laughed at and humiliated by nearly everyone, loses all of his friends except for Hannah who understands what its like not to be able to live up to a parent's expectations, and displeases his father.As it turns out, the day of the baseball finals and the day of the cook-off are the same, leaving Eddie to make the choice to please his father or follow his dreams. Eddie stops by the building where the competition is being held, only to find that his idol, Bobby Flay, is hosting.Ultimately Eddie goes to the game but cannot concentrate. Seeing the state he is in, his friends finally accept that he loves cooking and tell him to go to the cook-off and let them win on their own for once. With his friends now behind him, Eddie and his mother go to the cook-off, leaving his father stunned by his decision. He arrives half an hour late and has no one to help him but he is determined to try his best. His friends watch the cook-off on a portable television in the dugout and see that Eddie is struggling as he has less time and no one to help. After hearing this, and seeing Hannah's mom finally supporting her, his father purposely gets himself kicked out of the game to go and help Eddie. Eddie is surprised by this, but his father proves to be a huge help.Together the two manage to complete the cook-off just in time but Eddie does not win although Bobby privately admits to Frankie that he did think Eddie did the best. Eddie's father now supports him whole-heartedly and comforts him, telling him no matter what he does, he will support him from now on. Eddie's brothers even show up to finally support him after seeing the cook-off on TV. Eddie's team wins without him thanks to his best friend DB who finally hit a ball. Eddie and his friends go to celebrate at his house and Eddie's cooking rival Bridget (who won the cook-off) comes too and seems to share her trophy with Eddie.","produced_by":"Richard D. Arredondo","starring":"Mark L. Taylor Taylor Ball Rose McIver Orlando Brown Reiley McClendon","running_time":"85 minutes","language":"English","music_by":"Mason Daring","eddie's_million_dollar_cook-off":"Promotional advertisement","written_by":"Jack Jason Rick Bitzelberger Daniel Berendsen"}