{"based_on":"Shopaholic by Sophie Kinsella","Cast":"According to DVD commentary, Lithgow turned down the role of Edgar West twice before accepting it. Armisen was approached for the West role after Lithgow initially turned it down, but after Lithgow changed his mind, the Ryan Koenig role was written for Armisen. Ed Helms was cast as Derek Smeathe but scheduling conflicts prevented him from taking the role. He quickly shot the Garrett role in one day","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Tim Firth Tracey Jackson","Plot":"Rebecca Bloomwood (Isla Fisher) is a shopping addict who lives with her best friend Suze (Krysten Ritter). She works as a journalist for a gardening magazine but dreams of joining the fashion magazine Alette. On the way to an interview with Alette, she buys a green scarf. Her credit card is declined, so Rebecca goes to a hot dog stand and offers to buy all the hot dogs with a check, if the seller gives her back change in cash, saying the scarf is to be a gift for her sick aunt. The hot dog vendor refuses but a man offers her $20.When Rebecca arrives at the interview, she's told that the position has been filled. However, the receptionist tells her there is an open position with the magazine Successful Savings, explaining that getting a job at Successful Savings could eventually lead to a position at Alette magazine. Rebecca interviews with Luke Brandon (Hugh Dancy), the editor of Successful Savings and the man who just gave her the $20. She hides her scarf outside his office, but Luke's assistant comes into the office and gives it back to her. Rebecca knows the game is up and leaves.That evening, drunk, she and Suze write letters to Alette and Successful Savings, but she mails each to the wrong magazine. Luke likes the letter she meant to send to Alette and hires her. Rather than completing a work assignment for a new column, Rebecca goes to a clothing sale. While inspecting a cashmere coat she has just purchased, she realizes it is not 100% cashmere and she has been duped. This gives her an idea for the column, which she writes under the name \"The Girl in the Green Scarf\" and is an instant success.Rebecca later returns home to renewed confrontations with her debt collector, so Suze makes her attend Shopaholics Anonymous. After one shopping spree she meets a friendly woman, Miss Korch (Wendie Malick), only to learn that she is the group leader and forces Rebecca to donate all the clothes she just bought, including a bridesmaid's dress for Suze's wedding and a dress for a TV interview. After the meeting Rebecca can't afford to buy back both and buys back the interview dress. During the interview, the debt collector is in the audience and confronts Rebecca. Successful Savings terminates Rebecca's column after the public confrontation for bringing discredit on the magazine and believing she is a risk for not paying debts. Suze is angry when she finds out that Rebecca lost the bridesmaid dress, and Rebecca feels like she let everyone down. Rebecca's father (John Goodman) is more sympathetic, making a remark that the United States has not fallen despite its gigantic national debt, and offers to sell his recreational vehicle to help her. Rebecca declines his offer, saying that he earned the camper through years of hard work and saving, and that she will need to tackle her debts on her own. Alette offers Rebecca a position at the magazine, but she declines. Meanwhile, Luke starts a new company, Brandon Communications.The members of Shopaholic Anonymous promote Rebecca's clothes sale, which generates a lot of revenue, but not enough to retire her debts. She finally sells her green scarf when a woman bids on it, making it possible for her to give all the cash to the debt collector, which she pays in pennies - to give it to him in the \"most inconvenient way possible\".Rebecca attends Suze's wedding after reclaiming her bridesmaid dress, and Suze forgives her. Luke returns the green scarf to Rebecca after revealing that the person who bought it at an auction was acting as his agent. Rebecca becomes romantically involved with Luke and starts working at his new company.","language":"English","Reception":"Confessions of a Shopaholic has received generally negative reviews from critics. As of March 6, 2009 the film holds an average score of 38, based on 30 reviews on the web site Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics.[7] On Rotten Tomatoes the film holds a rating of 25%, based on 160 reviews with a consensus \"This middling romantic comedy underutilizes a talented cast and delivers muddled messages on materialism and conspicuous consumption.\"[8]Isla Fisher's performance generated good reviews and she was nominated for Choice Movie Actress: Comedy at the Teen Choice Awards 2009, but she lost to Anne Hathaway for Bride Wars. The film itself was also nominated for Choice Movie: Romance but lost to Twilight.On its opening weekend without Presidents' Day, the film opened #4 behind Taken, He's Just Not That Into You, and Friday the 13th grossing $15,054,000 in 2,507 theaters with a $6,005 average.[9] As of May 22, 2009, the film grossed $44,277,350 at the domestic box office, while its worldwide box office is $106,904,619.[10]","box_office":"$108.3 million[1]","cinematography":"Jo Willems","production_company":"Touchstone Pictures Jerry Bruckheimer Films","directed_by":"P. J. Hogan","Soundtrack":"The soundtrack of Confessions of a Shopaholic was released on February 17, 2009 under Hollywood Records.[11] However, an alternate track listing was posted on Tommy2.net on January 25, 2009.[12] In the alternate track listing, Adrienne Bailon also sing \"Big Spender\" instead of Girlicious, and the Pussycat Dolls sing \"Bad Girl\" instead of Rihanna featuring Chris Brown. In addition, Ric Ocasek is said to sing \"Emotion in Motion\" instead, and \"Music Of The Sun\" by Rihanna has been replaced by \"Calling You\" by Kat DeLuna. Shontelle sings \"Stuck With Each Other\" with Akon for the soundtrack, Lady Gaga's \"Fashion\" was also in the soundtrack.","Home media release":"The film was released by Touchstone Home Entertainment on DVD and Blu-ray on June 23, 2009 in North America and in Australia on August 5, 2009.","release_dates":"February 13, 2009 (2009-02-13)|||||","Production":"The film adapts the two books The Secret Dreamworld of a Shopaholic and Shopaholic Abroad which in the United States were known as Confessions of a Shopaholic and Shopaholic Takes Manhattan respectively.[2] The film uses the novel's American title Confessions of a Shopaholic reinterpreting Rebecca as an American rather than English.Filming took place in New York, Connecticut, and Florida from February to May 2008.[3][4] To change the ending to be more sympathetic to audiences during a time of recession, re-shoots took place in New York City on December 4 and 8, 2008.[5]Production on the film also included creating a group of faux upscale brand stores at the base of the Hearst Tower. Present were brands such as Valentino, Anna Sui, Catherine Malandrino and Alberta Ferretti. Several of the costumes were from the collection of French couture designer Gilles Montezin.[6]","produced_by":"Jerry Bruckheimer","starring":"Isla Fisher Hugh Dancy Krysten Ritter John Goodman Joan Cusack John Lithgow Leslie Bibb Julie Hagerty","running_time":"104 minutes","music_by":"James Newton Howard","confessions_of_a_shopaholic":"Theatrical release poster","edited_by":"William Goldenberg"}