{"country":"United Kingdom Ireland","distributed_by":"TLA Releasing (USA - DVD) Element Pictures (UK and Ireland - DVD) Watch Entertainment (USA - theatrical) Joejack Entertainment (Non-USA - DVD)","Plot":"Father Sweeney (Patrick Casey), a gay Catholic priest living with HIV, commits suicide. His death leads local investigative journalist David Foley (Jason Barry) to write a story that publicly identifies Sweeney as having HIV.At the local seminary, two students near ordination are expelled because one, Daniel (Jonathon Forbes) was seen leaving the room of the other, Niall (Paudge Behan). Niall is gay and Daniel is straight and they engaged in no sexual activity but were still expelled for the sake of appearances. Daniel returns home, where he is torn between his calling to the priesthood and his love for his ex-girlfriend Sinead (Catherine Walker).Daniel meets with Foley, who writes a follow-up article exposing a covered-up AIDS protest that Sweeney had staged at the Vatican three years earlier and Daniel's dismissal. He also alleges that cardinals close to the Pope are engaged in sexual relationships and calls on the Church to re-examine its celibacy requirement for priests. The local bishop, Michael Quinn (Jim Norton), pressures the editor of the local paper not to run the second story. The editor acquiesces but after reading the story sends it to the Irish Times, which prints it.The next day the bishop, his aide, Foley and Daniel appear together in a live television debate. Before the broadcast, agents of the Church threaten to harm Foley's family unless he retracts his story on the air. Bishop Quinn offers to reinstate Daniel if Daniel is willing to admit he has been wrong. On-air Foley capitulates but Daniel does not, asking the bishop if he himself practices celibacy. When the bishop refuses to answer, Father Sweeney's partner, former priest Matthew Francis (John Lynch) confronts Quinn with Sweeney's suicide note in which Sweeney discloses that Quinn and he had had an affair.At film's end, Daniel is back at home with Sinead.","language":"English","box_office":"$2,598[1]","cinematography":"Jason Lehel","production_company":"Flick Features Little Wing Films","directed_by":"John Deery","release_dates":"2003 (limited) 2014 (re-release)","produced_by":"John Deery & Davina Stanley","starring":"Jonathan Forbes Jason Barry Hugh Quarshie Hugh Bonneville Sean McGinley Chris O'Dowd Brenda Fricker","running_time":"90 minutes","edited_by":"Jamie Trevill","Release":"The film got a limited US theatrical release in December 2004,[5] following its festival screenings.The film was re-launched at the Berlin International Film Festival in February 2014 by a new US boutique sales company, Angel Grace Productions, headed by Michael Fister.[6][7]","written_by":"John Deery","budget":"$3 million"}