{"based_on":"Another Bullshit Night in Suck City  by Nick Flynn","country":"United States","distributed_by":"Focus Features","screenplay_by":"Paul Weitz","Plot":"Nick Flynn (Dano) is an aspiring writer who works at a homeless shelter where his estranged father Jonathan (De Niro) is a client. Jonathan, an alcoholic ex-con and self-proclaimed \"master storyteller\", left Nick's mother Jody (Moore) years earlier to raise Nick on her own. She eventually committed suicide, for which Nick feels responsible. Jonathan gets into fights with the other clients, and Nick is tempted to throw him out. Nick and Jonathan get into an intense argument, during which Jonathan tells Nick that they are the same. The stress of seeing his father again drives Nick to drink heavily and abuse drugs, costing him his relationship with his girlfriend and coworker, Denise (Olivia Thirlby).Jonathan eventually gets kicked out of the shelter, with Nick voting with the staff for his removal. Nick tries to numb the guilt by smoking crack, but the drug only intensifies his pain, and he realizes that he has a problem. He enters a rehabilitation program, and makes amends with Denise. One night, he finds Jonathan sleeping on the street and invites him to stay with him. When they part ways the next day, Jonathan tells Nick that he is not responsible for his mother's suicide, and that they are not the same after all.Nick becomes a teacher, starts a family, and publishes a book of his poetry, while Jonathan qualifies for Section 8 housing thanks to Nick's recommendation. Jonathan shows his appreciation by letting Nick read his \"masterpiece\", Memoirs of a Moron, which Jonathan finds to be initially promising, but ultimately falling short - much like Jonathan himself. He invites Jonathan to his poetry reading, where he introduces his father to his wife and infant daughter. After some hesitation, he allows Jonathan to hold his daughter.","language":"English","Reception":"Being Flynn received mixed reviews. Rotten Tomatoes gives a score of 53% based on 74 reviews.[2] On Metacritic, the film received a 53% rating based on 27 reviews, indicating \"mixed or average reviews\".[3]Many critics praised De Niro's performance.[4][5] Roger Ebert stated that \"to summon up his most iconic role must represent De Niro's faith in this film\".[6] Richard Roeper said \"De Niro returns to genius form in 'Being Flynn'.\"[7]","box_office":"$540,152","cinematography":"Declan Quinn","production_company":"Depth of Field Corduroy Films Tribeca Productions","directed_by":"Paul Weitz","narrated_by":"Robert De Niro","release_dates":"March 2, 2012 (2012-03-02)|||||","produced_by":"Paul Weitz Andrew Miano Michael Costigan","starring":"Robert De Niro Paul Dano Olivia Thirlby Lili Taylor Wes Studi Julianne Moore","running_time":"102 minutes","music_by":"Badly Drawn Boy","edited_by":"Joan Sobel"}