{"best_seller":"Theatrical release poster","country":"United States","distributed_by":"Orion Pictures","Plot":"The movie opens in 1972 as a group of gunmen wearing Richard Nixon Halloween masks steal evidence from a police evidence storage unit, killing several officers in the process. Officer Dennis Meechum (Brian Dennehy) is seriously wounded after stabbing one of the robbers. He survives and publishes a book titled Inside Job based on his experience. Years later, Meechum, who by now has become an acclaimed author and a much decorated Detective, is working on his next novel. He now suffers from writer's block, and is a widowed father raising his daughter, Holly (Allison Balson).On a case at the docks, a suspect runs as Meechum gives chase. A man named Cleve (James Woods) joins the chase. The suspect hides in an overhead crane and attempts to shoot Meechum, but Cleve kills the man, then mysteriously disappears.Cleve arranges a meeting with Meechum, and tries to convince to write a book about his history as a paid assassin for a corporate empire, Kappa International. Cleve intimidates Kappa's founder, David Madlock (Paul Shenar) about Meechum's next book, and promises Meechum to show evidence to back up his claims. They proceed to take trips to New York and Texas where Cleve tries to convince Meechum of his history of hits. While they are in Texas, it is revealed that Cleve was the injured masked gunmen that Meechum had stabbed years earlier. Madlock, through his legal representatives, tries to bribe Meechum but fails.When an enforcer tries to steal a manuscript of Meechum's novel and attempt to kill Holly, Cleve intervenes by killing him. When Cleve attempts to keep Holly safe by sending her to Meechum's agent, Roberta Gillian (Victoria Tennant). Madlock, however, manages to kidnap Holly. Meechum decides to have a meeting with Madlock at the latter's oceanfront estate. Cleve storms into the house, and guns down all of Madlock's bodyguards. Cleve then sacrifices his own life to save Holly from Madlock. Meechum arrests Madlock, before comforting a dying Cleve. Cleve reminds Meechum about the book and says \"Remember I'm the hero\". At the end of the film, it is revealed that Meechum has published the book titled Retribution: The Fall of David Madlock and Kappa International and it has had 28 weeks on the best seller list.","language":"English","box_office":"$4,278,150","cinematography":"Fred Murphy","production_company":"Hemdale Film Corporation","directed_by":"John Flynn","release_dates":"September 25, 1987 (1987-09-25)|||||","Production":"John Flynn says he substantially rewrote the script which was originally called Hard Cover.[1]","produced_by":"Carter De Haven","starring":"James Woods|Brian Dennehy|Victoria Tennant|","running_time":"95 minutes","music_by":"Jay Ferguson","edited_by":"David Rosenbloom","written_by":"Larry Cohen"}