{"country":"United States","distributed_by":"Orion Pictures (USA & Canada) De Laurentiis Entertainment Group (International)[1]","Related productions":"A theatrical sequel, Bill & Ted's Bogus Journey, was released in 1991.A third theatrical film in the Bill & Ted franchise was planned, and a screenplay was written, though it never got past the pre-production phase. Although rumors claimed that the script was adapted into the 1996 film Bio-Dome, Alex Winter has said that it was not.[12]In 2010, Reeves indicated that Matheson and Solomon were working on a script for a third film,[13] confirming in April 2011 that a draft was complete.[14] Winter said in March 2012 that he and Reeves both liked the finished script, which revisits the two characters after the changes of the past twenty years.[15] The current script does not feature the return of the Grim Reaper from Bogus Journey, but since actor William Sadler has expressed interest, the writers are considering ways to include the character.[16] In August 2012, Dean Parisot (director of the sci-fi/comedy film Galaxy Quest) signed on to direct the film, although MGM, which holds the rights to the Bill & Ted franchise, has yet to give the movie an official greenlight.[17] In an April 2014 article on the original film's 25th anniversary, Alex Winter reported that work on going ahead with the second sequel was still in progress.[10]Two spin-off television series were produced; both were titled Bill & Ted's Excellent Adventures.DC Comics produced a tie-in comic following the plot of the first movie timed to coincide with that film's release on home video. [1] The sequel was adapted by DC's competitor Marvel Comics, published to coincide with the second film's release in theaters. Its popularity led to the ongoing Marvel series Bill & Ted's Excellent Comic Book by Evan Dorkin, which lasted for 12 issues. [2]There was a weekly 2/4 page semi-adaptation of the animated series published for a year by UK's defunct Look-In Magazine from 1991 to 1992. [3]There were also Game Boy, NES and Atari Lynx games released, which were very loosely based on the film's plot. A PC title and nearly identical Amiga and Commodore 64 port were made in 1991 by Off the Wall Productions and IntraCorp, Inc. under contract by Capstone Software and followed the original film very closely.The annual Halloween Horror Nights events at Universal Studios Orlando and Hollywood have featured since 1992 (Orlando) and 1997-1999/2007 (Hollywood) Bill & Ted's Excellent Halloween Adventure, a show satirizing pop culture of the year with Bill & Ted as the protagonists fighting villains who steal their phone booth for their own schemes.The show differs from year to year, with spoofs of various pop culture icons. The main plot involves Bill and Ted being threatened by an evil villain from a popular film of that year, with appearances by a host of villains, heroes, and celebrities. The show usually includes elaborate dance numbers, stunts, and multiple double-entendres for the late night event crowd.[19][20] In 2013, the Hollywood version of the show was cancelled in the middle of its run following complaints of homophobic humor.[21]","Plot":"In Futuristic City, 2688, humanity exists as a utopian society due to the inspiration of the music and wisdom of the Two Great Ones: Bill S. Preston, Esq. (Alex Winter) and Ted \"Theodore\" Logan (Keanu Reeves). Rufus (George Carlin) is tasked by the leaders to travel back to San Dimas, California, in 1988 using a time machine disguised as a telephone booth to ensure that Bill and Ted, who are dimwitted metalhead high school students, get a good grade in their final history oral report and allow them to pass the class. Should they fail, Ted's father, Police Captain John Logan (Hal Langdon), plans to ship Ted to a military academy in Alaska, ending Bill and Ted's fledgling band, the \"Wyld Stallyns\", thus altering the future.Bill and Ted struggle with the report, which asks them to envision how three historical figures would see San Dimas in the present. While they are asking strangers at the local Circle K convenience store for help, Rufus arrives in the time machine. The two are distrustful until the time machine arrives again nearby, out from which step future versions of Bill and Ted. They prove to their younger selves that they are really them and that they should trust Rufus. They privately ask Rufus a question and then depart. The younger versions of Bill and Ted accept Rufus' offer to take them into the past. Rufus takes them to a battlefield in Austria, 1805 where Napoleon Bonaparte (Terry Camilleri) is commanding the French army against Austria. They return to the present, unaware that the time machine has caught Napoleon in its wake and pulled him along. Landing near Ted's house, Rufus reminds them that they must still reach the school on time to give their report and then departs, returning the time machine to them. The two discover Napoleon stuck in a tree, and after freeing him, come up with the idea of kidnapping other historical figures to bring to the present. They leave Napoleon with Ted's younger brother, Deacon (Frazier Bain), and start traveling through time.The two befriend Billy the Kid (Dan Shor) in The Old West, 1879 and Socrates (Tony Steedman) in Ancient Greece, 410 BC before stopping in London, 1461 where they become infatuated with Princesses Elizabeth (Kimberley Kates) and Joanna (Diane Franklin). The teens anger the princesses' father, who orders their beheading, but they are rescued by Billy and Socrates. They are forced to leave without the princesses and, in the escape, the telephone booth is damaged. Dialing a random number, they land next in the Utopian future, where Bill and Ted are amazed by the music playing and that the citizens worship them. They leave after a brief stay and, believing they have plenty of time before the report, start collecting more historical figures for extra credit, including Sigmund Freud (Rod Loomis) in Vienna, 1901, Ludwig van Beethoven (Clifford David) in Vienna, 1809, Joan of Arc (Jane Wiedlin) in Orléans, 1429, Genghis Khan (Al Leong) in Mongolia, 1209, and Abraham Lincoln (Robert V. Barron) in Washington, D.C. in 1863. Having run out of room in the phone booth, Bill and Ted finally discover the time machine is damaged.After making ad hoc repairs to the time machine, Bill and Ted try to return to the present but land outside the Circle K, recognizing the situation they previously witnessed. After reassuring their younger selves, they learn from Rufus how to dial the right number to get to their present. Ted finds Deacon had ditched Napoleon earlier out of embarrassment. They leave the other historical figures at the local mall to experience San Dimas while they look for Napoleon, finding him at the water slide park \"Waterloo\". They discover the historical figures had caused trouble and have been arrested by Captain Logan. They figure out how they can use the time machine to set up an event at the police station to allow them to free the historical figures without getting caught, and then race for the high school. Arriving just in time, they give an impressive presentation with the help of the historical figures that receives a standing ovation. They pass their course, and return the historical figures to their proper times.Later, as Bill and Ted are practicing, Rufus arrives, showing he had rescued the princesses from England and introduced them to the modern world, and that they become part of Wyld Stallyns. Elated, Bill and Ted resume their practice, with Rufus breaking the fourth wall and promising, \"They do get better ...\"","language":"English","Reception":"Bill & Ted's Excellent Adventure grossed $40.4 million domestically on a budget of about $10 million.[22] The Washington Post gave the film a negative review, finding the script written by Chris Matheson and Ed Solomon as \"made only the sketchiest attempts to draw their historical characters. They exist as foils and nothing else, and the gags that are hung on them are far from first-rate\", and that if director \"Stephen Herek, has any talent for comedy, it's not visible here. More than anything, the picture looks paltry and undernourished.\"[23] Variety wrote about each historical figure that Bill & Ted meet, stating that \"Each encounter is so brief and utterly cliched that history has little chance to contribute anything to this pic’s two dimensions.\"[24] Vincent Canby of The New York Times referred to the film as a \"painfully inept comedy\" and that the \"one dimly interesting thing about Bill and Ted's Excellent Adventure is the way the two teen-age heroes communicate in superlatives. We are about to fail most egregiously, says Ted to Bill, or maybe it's Bill to Ted. They are also fond of odd words, such as bodacious.\"[25] In the Los Angeles Times, Chris Willman was also unimpressed, concluding: \"Make no mistake, Bill & Ted's Excellent Adventure […] is not a satire of mindlessness; it's unabashed glorification of dumbness for dumbness' sake. Bill and Ted are heroic in their ability to reduce some of history's great minds to their level.[2] However, writing for Radio Times, Alan Jones decided: \"A nonstop giggle from start to finish, this beguiling grab-bag of time-travel clichés, hard-rock music and Valley-speaking cool dudes is a flawless, purpose-built junk movie\".[26]The film has an 79% fresh rating at Rotten Tomatoes, based on 43 reviews with a consensus saying \"Keanu Reeves and Alex Winter are just charming, goofy, and silly enough to make this fluffy time-travel Adventure work\".[27]The successes of the film and the animated series spawned a short-lived breakfast cereal called Bill & Ted's Excellent Cereal.[28]The phone booth used in the film was given away in a contest presented by Nintendo Power magazine, to promote Bill & Ted's Excellent Video Game Adventure. It was won by Kenneth Grayson of Mississippi.[29][30]In 2010, the city of San Dimas celebrated 50 years of incorporation. The celebration's slogan was San Dimas, 1960–2010 – An Excellent Adventure.[31]Bill and Ted's Excellent Adventure was selected as number 8 in Rolling Stone's '10 Best Stoner Movies of All Time' in 2013.[32]Writing in The Guardian on the occasion of the film's 25th anniversary, Hadley Freeman found: \"Of all the delightfully improbable scenarios depicted in Bill & Ted's Excellent Adventure – from Napoleon Bonaparte causing havoc on a waterslide to Billy the Kid and Socrates (aka \"So-crayts\", of course) picking up chicks in a California mall to George Carlin acting in a film alongside Keanu Reeves and a member of the Go-Go's – none would have seemed more unlikely on its release than the idea that one day, with much media fanfare, the public would be celebrating the film's 25th anniversary. By the time Bill & Ted was released in 1989, the 80s teen film explosion was starting to taper out. […] Moreover, there had already been plenty of films about time-travelling teens by the time Bill & Ted rocked up in cinemas, such as Peggy Sue Got Married and Back to the Future. Few who were around then would have bet that a goofy movie about a pair of California metalheads skipping back through time in a phonebox collecting historical characters to bring back to 20th-century California for their history report would still be remembered today. But I am very much among those few\".[10]","box_office":"$40.5 million","cinematography":"Timothy Suhrstedt","production_company":"Interscope Communications Nelson Entertainment","directed_by":"Stephen Herek","bill_&_ted's_excellent_adventure":"Theatrical release poster","Soundtrack":"The film's soundtrack was released in 1989. The tracks are as follows:These tracks are ordered for the album differently than they are in the movie. In the movie, the songs show up in the following order: \"I Can't Break Away\", \"Dancing with a Gypsy\", \"Father Time\", \"Dangerous\", \"In Time\", \"Two Heads Are Better Than One\", \"The Boys and Girls Are Doing It\", \"Play with Me\", \"Walk Away\", \"Not So Far Away\" and \"Two Heads\" (reprised over the credits).The following songs appeared in the film but were not included in the soundtrack:[citation needed]","release_dates":"February 17, 1989","Production":"The film was shot in 1987 in the Phoenix, Arizona, metropolitan area, mostly in and around Scottsdale's Coronado High School. Coronado's auditorium was torn down during 2005-07 renovations, but its unique roof and intricate exterior mosaic, seen in an opening scene when Bill and Ted leave school in a red Mustang, was saved and moved, piece by piece, to the new auditorium. The interior shots of the auditorium were filmed inside the East High School auditorium, which was in Phoenix on 48th Street just north of Van Buren. East High School was demolished in 2002 as part of a redevelopment project. The production also shot a sequence on the Western Street on the back lot of Southwestern Studio in Carefree, Arizona.The scenes at Waterloo are a combination of establishing shots at Raging Waters in San Dimas and shots with the actors at Golfland Sunsplash in Mesa, Arizona. The bowling alley was a Fair Lanes-branded alley at that time but is now the AMF Tempe Village Lanes on Rural Road at US 60, three miles south of Arizona State University. The mall was Phoenix Metrocenter, between Peoria and Dunlap Avenues at Interstate 17. It has since been renovated and no longer looks as it did in the film. The Circle K store is at the intersection of Southern and Hardy in Tempe.[3][4]The film's writers, Ed Solomon and Chris Matheson, appear in the film's ice cream scene. Solomon is credited as the \"stupid\" waiter, and Matheson is credited as the \"ugly\" waiter. They are given similar credits in Bill & Ted's Bogus Journey.When Rufus plays his guitar solo, the hands in the close-up are those of Stevie Salas, who composed the film's guitar music.[5]The film took nearly two years to make. Filming took place from February to May 1987[6] and it was planned to be released in 1988. However, the film's original distributor, De Laurentiis Entertainment Group, went bankrupt. Orion Pictures and Nelson Entertainment bought the rights to the movie in 1988, and it was released theatrically on February 17, 1989.[7] As a partial result of the delay, certain dates in the film originally scripted as \"1987\" had to be re-dubbed as \"1988\". The copyright date of this film is 1989, while 1988 incorrectly appears on the DVD cover (though some copies still note 1989 as its release date).It was followed in 1991 by a sequel, Bill & Ted's Bogus Journey.Writing for Wired to mark the 25th anniversary of the film's release, Angela Watercutter noted:\"There's a longstanding urban legend that Reeves auditioned for the role of Bill and Winter auditioned for Ted, but that's not exactly how Winter remembers it. 'The reason that that ended up in lore was because at a certain point Keanu got it in his head that he was playing Bill and I was playing Ted,' he says. 'To be fair to Reeves, it's possible that out of the 80 trillion times we had to do the scenes [in auditions] the very, very last time we went in he happened to get the Bill sides and I happened to get the Ted sides.' After Reeves found out he was playing Ted, though, he was Sad Keanu. 'We're sitting in the office waiting to meet the producers for the first time and I'm pretty jazzed and he's miserable,' Winters says. 'I'm like, \"Dude, what's wrong? We finally got it after all this bullshit,\" you know? And he's like, \"Yeah, but I'm Ted.\" And I was like, \"Yeah, you're Ted. That's awesome.\" He was like, \"I thought I was Bill.\" I was like, \"What fucking difference does it make? For god's sake, they're completely interchangeable. If you want you can be Bill and I'll be Ted, I really don't care. It's not going to impact the way I play this guy one iota.'\"[8]In earlier drafts of the script, Rufus was 28 years old and historical figures Bill and Ted plucked from history included Charlemagne (whom they referred to as \"Charlie Mangay\"), Babe Ruth, and a non-famous medieval person called \"John the Serf\". John is listed in the credits.[9]In a 1991 interview, co-writer Ed Solomon said the characters of Bill and Ted were originally envisaged as \"14-year-old skinny guys, with low-rider bell-bottoms and heavy metal T-shirts\" who were despised by the popular kids at school. Casting Reeves and Winter changed the filmmakers' images of the characters because \"...once you cast Alex and Keanu, who look like pretty cool guys, that was hard to believe\".[10]Originally, the time machine was to be a 1969 Chevrolet van, but the idea was abandoned as being too close in concept to the DeLorean used in the Back to the Future trilogy.[8] Instead, despite the similarities to Doctor Who's time machine, the TARDIS, the film's time machine was styled after a 1960s American telephone booth, though a newer model Ford van would be used as the rock concert \"band wagon\" for the sequel.In April 2013, Winter commented on Carlin's casting: \"He was a very happy accident. They were going after serious people first. Like Sean Connery. And someone had the idea, way after we started shooting, of George. That whole movie was a happy accident. No one thought it would ever see the light of day.\"[11]","produced_by":"Scott Kroopf Michael S. Murphey Joel Soisson","starring":"Keanu Reeves|Alex Winter|George Carlin|","running_time":"90 minutes","music_by":"David Newman","In cultural analysis":"Writing in British Sunday newspaper The Observer, Tom Holland noted,\"Bill & Ted's Excellent Adventure does not tend to be rated as one of cinema's profounder treatments of the relationship between present and past. The story of two Californian slackers with a time machine who, for complicated reasons, have to assemble assorted celebrities from history in order to pass a high-school project, it is chiefly remembered for bringing Keanu Reeves to the attention of a mass audience. Classicists, however, will always cherish it as the only film ever to combine the music of Van Halen with Greek philosophy. When Bill and Ted embark on their quest, what should be their first destination if not classical Athens, and who should be the very first 'historical dude' bundled into their time machine if not a bald-headed man in a sheet whom they persist in calling 'Soh-kraytz'?\"[33]Holland continued:\"Even to metalheads, then, the philosophy of ancient Greece serves as something that is both primal and emblematic of civilisation as a whole. Socrates, in particular, the 'lover of wisdom' who insisted that the most fundamental presumptions of his countrymen should be subjected to experimental investigation, and who ended up being made to drink hemlock for his pains, has always been admired as the very fountainhead of rationalism. Yet when it comes to identifying what he taught and believed, there is a problem, on which Bill & Ted's Excellent Adventure, rather unexpectedly, puts its finger. Socrates, transplanted to 1980s California, can only communicate with his abductors by gesturing and gurning – since Bill and Ted, it goes without saying, speak not a word of ancient Greek. Even the miracle of time travel, it appears, cannot serve to alter what is, for any historian, a most awkward fact: that it is impossible to be certain of what Socrates actually said.\"[33]","edited_by":"Larry Bock Patrick Rand","written_by":"Chris Matheson Ed Solomon","budget":"$10 million"}