{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Lucy, Kit, and Mimi are three friends who live in a small Georgia town. While as young children, they bury a \"wish box\" and vow to dig it up on the night of their high school graduation, also pledging to stay best friends forever. However, as they grow up, their friendship fades due to their different approaches of high school: Lucy becomes the valedictorian, Kit becomes the most popular girl in school, and Mimi faces teenage pregnancy. On the night of their graduation, they keep their promise and get together to open the \"wish box\". As they start talking again, they remember their old wishes while burying the box: Mimi wanted to travel to California, Lucy wanted to see her mother again, and Kit wanted to get married. Mimi brings up the topic of going to Los Angeles for a record contract audition. They all leave together: Lucy to visit her mom in Tucson, Arizona, and Kit to visit her fiance in Los Angeles.They set out on the road with little money in a yellow 1973 Buick Skylark convertible with a guy named Ben. Lucy, however, leaves without the permission of her father Pete, who wakes up the next day to find his daughter is gone. Shortly into their journey, the car breaks down. They realise that they don't have enough money between them for the travel nor the repair costs. Mimi then suggests that she sing karaoke at a local bar, where good singers are tipped well by the customers. While at the bar, the girls dress up and go the stage to perform. However, when the song starts Mimi develops stage fright, being unable to sing. Seeing that they needed the money, Lucy takes her place, and quickly becomes a hit with the crowd. They make enough money to fix the car and continue on their way.Shortly after the group checks into a motel, Kit tells the girls that she heard a rumor about Ben, commenting that he had recently been released from jail, after killing someone. The girls then spend most of the journey feeling uneasy around him, until they confront him. Ben reveals that he was in jail for driving his step-sister across state borders without parental consent, after his father was abusing her. Having established that Ben was not the assassin they imagined him to be, Lucy and Ben grow closer. The girls talk properly to each other for the first time since they were kids. Lucy reveals that her mother abandoned her and her father when she was three. Kit, who was overweight as a child, has an overbearing mother who sent her to \"fat camp\" but now cannot stand that her daughter is more beautiful than her. Mimi reveals that the baby's father was not her boyfriend, but a guy who raped her after she got drunk at a party.After they arrive in Arizona, Lucy finally meets her mother Caroline after eighteen years; however, Caroline reveals that she has remarried, and that she now has two sons ages seven and ten. She reveals to Lucy that she was an unintended pregnancy, and Lucy leaves the house. Promptly arriving at the motel, Ben comforts her. The following day, Lucy rejoins the others and goes on to Los Angeles. When they arrive, Kit brings Mimi along to surprise her fiance, Dylan. While alone in the hotel, Lucy gives her virginity to Ben. When Kit and Mimi arrive to Dylan's place, it is revealed that he is cheating on Kit after they see another girl in his apartment. Already upset, Kit suddenly realizes that it was Dylan who raped Mimi and got her pregnant, and she punches him. Scared, Mimi runs away, and falls down the stairs. Consequently, she loses her baby. Lucy and Ben fall in love, and against her father's wishes, she stays in Los Angeles and goes to the audition instead of Mimi, since Mimi and Kit decide to sing backup for Lucy instead, and they receive a standing ovation at the end. \"This time we didn't make any wishes for the future... We said goodbye to our past. Now, none of us have any idea where life's gonna take us. 'Cause what we have is now, and right now... we have Each Other.\"[2]","language":"English","Release and reception":"Crossroads was released in the United States on February 15, 2002. On its opening day, the film grossed an estimated $5.2 million in 2,380 theaters, becoming the second highest grossing film of the day.[12] On the first weekend of its release, Crossroads placed second, grossing an estimate of $14,527,187.[12] By the second week, the film dropped a 52% on tickets sales, ranking at number 5 on the Box Office.[12] Crossroads was a moderate financial success, grossing a total $37,191,304 in the United States.[12] Worldwide, the film grossed a total of $61,141,030 until its close day, on May 9, 2002.[12]Crossroads received mostly negative reviews. The film has a 14% approval rating on the review aggregator website Rotten Tomatoes, based on 103 reviews with an average rating of 3.9/10, with the consensus: \"A cliched and silly pop star vanity project, Crossroads is strictly for Britney fans only.\"[13] Metacritic, which assigns a weighted average score, gave the film a 27 out of 100 based on 31 reviews from critics.[14]Robert K. Elder of the Chicago Tribune said \"Spears delivers a performance with the same sincerity she invests into a Pepsi commercial, only this film contains twice the sugary calories\", while New York Daily News writer Elizabeth Weitzma noted, \"Here's what Crossroads does not have: Cohesive direction from Tamra Davis, intelligent dialogue, a comprehensible plot\".[14] Maitland McDonagh of TV Guide commented that \"the film's mealy-mouthed messages about feminine empowerment will almost certainly fall on deaf ears, since even 11-year-olds know Spears's power resides largely in her taut torso\".[14] Claudia Puig of USA Today considered it \"less a movie than a mind-numbingly dull road trip\", while The Washington Post reporter Ann Hornaday said, \"not a music video, not yet a movie, but more like an extended-play advertisement for the Product that is Britney\".[14] Jane Dark of Village Voice compared Crossroads to Mariah Carey's Glitter, saying, \"you spend a lot of time wondering, 'Better or worse than Glitter?' You think if the projectionist cranked the volume a little you could actually sort of get into this\".[14]John Anderson of Los Angeles Times commented \"Spears acquits herself as well as anyone might, in a movie as contrived and lazy as this one\".[14] Chris Kaltenbach of Baltimore Sun said, \"go see Crossroads if you want to hear Britney sing or see her wear next-to-nothing. But otherwise, avoid this train wreck at all costs\".[14] Lisa Schwarzbaum of Entertainment Weekly, however, gave the movie a positive review, commenting Crossroads \"not only makes excellent use of the singer's sweetly coltish acting abilities, but it also promotes a standardized set of sturdy values with none of Mariah Carey's desperate Glitter, or any of Mandy Moore's gummy pap in A Walk to Remember\".[14] Bret Fetzer of Amazon.com also gave a positive review, noting that the movie \"could have been trite schmaltz, but the script has some grit and the direction is fresh and relaxed--and, most significantly, Spears is far more sympathetic and engaging than you might expect\".[15] Jane Crowther of BBC applauded Cattrall and Aykroyd's interactions with the characters, and said that \"Spears manages to come across on film as natural, endearing, and extremely likable\".[16] Time named it one of the top 10 worst chick flicks.[17]","box_office":"$61.1 million[1]","cinematography":"Eric Alan Edwards","production_company":"MTV Films Zomba Films Shondaland","directed_by":"Tamra Davis","Soundtrack":"Spears had initially recorded \"Overprotected\" and \"I'm Not a Girl, Not Yet a Woman\" for Crossroads; the songs were later included on the singer's third studio album, Britney (2001).[9] The soundtrack album features six tracks by Spears, Mystikal, Matthew Sweet, Jars of Clay and Bowling for Soup.[22] Music from the Major Motion Picture Crossroads was released by Zomba Records on February 2, 2002,[23] and was produced by Rodney Jerkins, The Neptunes, Fred Maher, Matthew Sweet, Dennis Herring, Jaret Reddick, Max Martin, and Rami Yacoub. \"Overprotected\" was remixed by JS16 for the soundtrack album.[22]Source:[22]","crossroads":"Theatrical release poster","release_dates":"February 15, 2002 (2002-02-15)|||||","Production":"In early 2001, Spears said that she had plans to make her film debut.[4] She and her team then created a concept for it,[4] which was later developed by Grey's Anatomy creator Shonda Rimes.[5] Spears commented that she \"talked to [Rimes] and told her what I wanted the movie to be about and she elaborated on it. It was my little project. When you do a movie, I think you have to be really passionate about it. I was having a lot of offers, but this is something my heart was into.\"[5] A press conference was held during the Marché International du Disque et de l'Edition Musicale (MIDEM) in Cannes, France, on January 19, 2002, where Spears also premiered the film.[6]Filming for Crossroads initiated in March 2001 in Baton Rouge and Hammond, Louisiana, near Spears' hometown.[7] Due to the fact that Spears was also recording her third studio album along with the film's production, filming only wrapped up after six months.[7] Additional scenes were filmed in Los Angeles, California.[7] Crossroads had a total budget of $10 million; a relatively low budget by industry standards.[8] According to the Louisiana Film and Video Commission, the film was originally titled What Friends are For.[8] Spears described it as a teen movie that deals with real issues that normal teenagers live on a daily basis.[9] She continued to explain the film's content, saying that it \"is about this journey that the three of us best friends take, finding ourselves and what we want out of life and getting our friendship back. Friends are all you have at the end of the day. When your boyfriend breaks up with you, who do you call? Your girlfriend. I just love that message.\"[9]Justin Long, who plays one of Lucy's best friends from high school, thought that Crossroads is \"like a road trip buddy movie for girls.\"[10] Long also said that he was impressed by Spears' work ethic, commenting that \"she could not have been more down to earth. She's the sweetest girl. After 10 minutes, I forgot she was a big pop star.\"[10] Anson Mount, who plays Ben, revealed that actor Robert De Niro ran a few of Spears' lines with him while rehearsing for the film. Mount revealed that De Niro called the singer \"a sweet girl\" and convinced him to do Crossroads.[11]","produced_by":"Ann Carli","starring":"Britney Spears Anson Mount Zoe Saldana Taryn Manning Kim Cattrall Dan Aykroyd","running_time":"94 minutes","music_by":"Trevor Jones","edited_by":"Melissa Kent","written_by":"Shonda Rhimes","budget":"$12 million[1]"}