{"country":"United States","distributed_by":"American International Pictures","Legacy":"After the sequel The Return of Count Yorga, a third \"Yorga film\" was planned, which would have featured a broken Count living in Los Angeles's sewers and creating an army of undead street people, but it never materialised.American International Pictures had planned at one stage to revive Count Yorga as an adversary for Dr. Anton Phibes in Dr. Phibes Rises Again. This plan was dropped, however, and Quarry appeared as the artificially young Dr. Biederbeck.Quarry later played another vampire, the messianic Khorda in 1973's The Deathmaster, which is often confused with the Yorga films because AIP picked up the distribution rights and began using the term \"The Deathmaster\" to promote the Yorga sequel, The Return of Count Yorga.","Plot":"The scenario opens with narration (by character actor George Macready, whose son, Michael Macready, both produced the film and played \"Michael\") about superstition and the abilities of vampires. A truck is loaded at the Port of Los Angeles, and as it climbs to a gated mansion in the Southern California hills, the cargo is revealed to be a coffin.Donna (played by Donna Anders) hosts a séance in hopes of contacting her recently deceased mother. At the party are several of her friends and Count Yorga (Robert Quarry), a mysterious Bulgarian mystic who performs the séance. Donna becomes hysterical during the proceedings, and Yorga uses hypnosis to calm her. After the party is over, Erica (played by Judy Lang) and her boyfriend Paul (Michael Murphy) offer to drive the Count home. Not long after the three leave, in the after-party conversation with friends, Donna reveals that she knows Yorga from being her mother's boyfriend. Adding that the two were dating a few weeks shortly before her death and in fact, Yorga had insisted that her mother be buried rather than cremated as she originally requested in the event of death. Yet oddly, she can't recall seeing him at her mother's funeral. Meanwhile, Erica and Paul drop off Yorga at his home. However suddenly experiences car trouble outside of Yorga's mansion (although Paul notices the road was dry a minute ago), the two resign themselves to spend the night in their van. Yorga watches the couple copulate, then attacks them, revealing himself to be a vampire. The following day, Paul tells Michael, Donna's boyfriend, about the attack. Paul didn't see their attacker, and Erica doesn't remember the attack at all.Erica visits Dr. Hayes to have the mysterious bite wounds on her neck inspected. In contrast to her exuberant personality on the night before, Erica now seems despondent and listless. Hayes notices she has lost a lot of blood. Unable to diagnose the cause, he recommends rest and a high protein diet. Not shortly after Paul and Michael discuss the strange changes in Erica's behavior. They try to check in on her via phone but she just drops the phone to the floor without answering it. The concerned men then drive to her home where they find the place in disarray, and an hysterical Erica eating her pet kitten. She reacts erratically to their presence, first threatening them with violence and then attempting to seduce Paul before coming to her senses and breaking down. They restrain her and call Dr. Hayes (Roger Perry), who begins an emergency blood transfusion. Erica babbles incoherently. apparently afraid of something, begging Paul to forgive her and even kill her. Meanwhile, Yorga awakens in his manor and heads to his throne room where his two vampiric-brides lie on slabs. One of whom is shown to be Donna's mother (Marsha Jordan) whom he had drained, made into an undead-servant and dug up her body after she was buried. He awakens the two and watches as they have sex, presumably using his powers of mind-control to force them to do so.Although Michael is skeptical, the three men consider the possibility of vampirism as an excuse for Erica's behavior. That night, Yorga visits Erica while Paul sleeps downstairs. Promising her immortality, he drains Erica of blood and completes her transformation before taking her back to his manor to add Erica as his third vampire bride. Paul, upon finding Erica missing, rashly goes to Yorga's mansion to rescue her. Yorga easily kills him with help of his deformed servant, Brudah (played by Edward Walsh). Michael alerts Hayes that Paul has gone to the mansion, and Hayes confides that Paul's lack of preparation will probably lead to his death. Hayes considers his girlfriend's advice, citing a baby being found drained of its blood with bite wounds on the neck, to involve the police. But he is rejected as a deluded prankster following a recent rash of such calls. Hayes, Michael and Donna go to the mansion themselves to inquire about Paul's whereabouts and keep Yorga active until sunrise. While Hayes distracts Yorga with enthusiastic questions about Yorga's occult experiments, Brudah rebuffs Michael's attempts to explore the mansion. Michael and Hayes switch places to keep Yorga off his guard, but Yorga becomes increasingly insistent that it is late and his guests must leave. Yorga distracts Hayes, and Yorga strengthens his hypnotic control over Donna.After leaving the manor, Hayes convinces Michael that killing Yorga will not be easy: vampires have greater strength and the wisdom that comes from living much longer than a \"mere mortal\". He also grimly adds they might have to kill Paul and Erica too if they have become vampires since the people they were are dead and now nothing but monsters loyal only to Yorga. They plan to attack later that afternoon. Michael and Donna rest while Hayes studies vampire lore until he too falls asleep. Yorga awakens Donna telepathically and summons her to the mansion. On her arrival, Brudah rapes her. Michael oversleeps because Donna sabotaget the alarm clock, and it's nearly evening when he calls to awaken Hayes. They stock up on stakes and makeshift crosses before heading to Yorga's mansion as night falls. They split up, and Hayes is confronted by Yorga. Both drop the pretense that Yorga is anything but a vampire, and Yorga leads Hayes into his basement where his vampire-brides lie dormant. Hayes finds Erica's body among them with no pulse or heartbeat. He attacks Yorga with cross and stake, while yelling out for Michael (who hears Hayes and begins to run in the direction of his call). Yorga is irritated by Hayes' cross and taunts the doctor as he silently commands his brides to awaken. With Hayes' back to the approaching brides and his attention fixed on Yorga, the brides attack and drain the helpless Hayes.Yorga reunites Donna with her mother. Michael finds Paul's mutilated body while navigating the crypt. Brudah attacks him, but Michael stabs him—presumably to death. Michael manages to reach the throne room but find Hayes as he lays dying from bites wounds and blood loss. With his last breath, Hayes tells Michael where Donna is. Erica, now a vampire and completely under Yorga's control, and an unnamed, red-headed vampire charge into the room. Michael fends them off, chasing away the red-head while Erica pauses, giving Michael a chance to stake her. Despite seeing she is no longer the Erica he knows, he can't bring himself to do so, and proceeds upstairs while she hisses at him.On the way to the staircase, Brudah emerges from the living room, holding his profusely bleeding knife wound, intent on attacking Michael. Michael—somewhat stunned that Brudah is still alive—moves up the staircase as Brudah reaches out for him. Brudah then collapses, finally dying. Upstairs, Michael confronts Yorga and Donna's mother. Yorga pushes Donna's mother into Michael's stake and flees. Michael follows and Yorga ambushes him outside the room. Michael rams the charging Yorga with his stake, killing him. Donna mourns her mother a second time before Michael collects her. He and Donna watch Yorga turn to dust.As they start to leave, they are confronted by Erica and the red-headed bride who, despite Yorga's death, still remain as vampires. They chase Michael and Donna downstairs until repelled by Michael's cross. As the vampire women are forced back and toward a cellar, Erica glances ominously at Donna. Michael locks them in and takes Donna's hand, believing the danger is over. However, as he turns to leave, Donna hisses and lunges at him, fangs bared, fully transformed into a vampire. He was too late to prevent Yorga from turning her.In a final line of voice-over, the narrator sarcastically disputes that vampirism is just superstition as he laughs evilly. The film ends on a shot of Michael's bloodied and lifeless corpse.","language":"English","cinematography":"Arch Archambault","production_company":"Erica Productions Inc.","directed_by":"Bob Kelljan","release_dates":"June 10, 1970 (1970-06-10)|||||","Production":"The film was originally to have been a soft core porn film called The Loves of Count Iorga, and some prints of the film display this as the on-screen title. Quarry told actor/producer Michael Macready he would play the vampire role if they turned the story into a straight horror film.[1]Stephen Farber's 1972 book, The Movie Ratings Game, details the problems that the film's distributor American International Pictures had in securing a GP rating (formerly known as M, later renamed to PG) from the Motion Picture Association of America, which initially was divided as to whether to give the film an R or X rating. AIP insisted that they needed an unrestricted GP rating for the film in order to get the film released into the largest possible number of theaters, most importantly drive-in theaters.The film ended up going before the MPAA ratings board six times before being granted the GP rating, and two or three minutes of violent and sexual content were ultimately removed by AIP. Alterations to the movie's soundtrack were also required to lessen the impact of violent scenes that remained in the film. The current MGM DVD release of the film carries a PG-13 rating, indicating the possibility that some of the deleted footage may have been restored. The most obvious excision was the scene wherein a woman, having succumbed to bloodlust after being bitten by Yorga, is discovered with her dead pet cat in her hands. In the theatrical version, the scene is so brief that it was hard to tell what was happening. Complete prints of the film show the bloody cat quite clearly.[citation needed]","produced_by":"Michael Macready","starring":"Robert Quarry Roger Perry Michael Murphy Michael Macready Donna Anders","running_time":"93 minutes","Home video release":"Count Yorga, Vampire has been the subject of several home video releases in nearly all formats since the 1980s. In April 1991, the film was packaged as a Laserdisc double feature (Catalog Number ID7661HB), paired with the Vincent Price horror film, Cry of the Banshee; both films were not letterboxed, but employed a full screen, pan-and-scan process.In 2004, MGM's Midnite Movies DVD line (which redistributed much of the American International Pictures horror catalog previously owned by Orion Pictures Home Video) released Count Yorga, Vampire and its sequel, The Return of Count Yorga as a DVD double feature. Both films were presented in the widescreen format, and included original theatrical trailers.","count_yorga,_vampire":"Theatrical release poster","music_by":"Bill Marx","edited_by":"Tony de Zarraga","written_by":"Bob Kelljan"}