{"don_juan_demarco":"Theatrical release poster","country":"United States","distributed_by":"New Line Cinema","Plot":"Psychiatrist Jack Mickler (Marlon Brando) dissuades a would-be suicide—a 21-year-old, costumed like Zorro and claiming to be Don Juan (Johnny Depp), who is then held for a ten-day review in a mental institution. Mickler, who is about to retire, insists on doing the evaluation and conducts it without medicating the youth. \"Don Juan\" tells his story—born in Mexico, the death of his father, a year in a harem, and finding true love (and being rejected) on a remote island. Listening enlivens Mickler's relationship with his own wife, Marilyn (Faye Dunaway). As the ten days tick down and pressure mounts on Mickler to support the youth's indefinite confinement, finding reality within the romantic imagination becomes Jack's last professional challenge.","language":"English Spanish","box_office":"$68,792,531","cinematography":"Ralf D. Bode","production_company":"American Zoetrope","directed_by":"Jeremy Leven","Music":"The film features the original Bryan Adams song, \"Have You Ever Really Loved a Woman?\"; the lyrics incorporate quotes from Depp's character, and the melody is used as a musical motif throughout the film. In addition, the song itself is performed three times, once by Selena and a mariachi band serenading the characters in Spanish, once by Jose Hernandez and Nydia, as background music (again in Spanish), and once by Bryan Adams during the closing credits. The song is also available on the soundtrack. The song was nominated for an Oscar for Best Original Song at the 68th Academy Awards, but lost to \"Colors of the Wind\" from Pocahontas.Selena recorded other songs for the soundtrack, including \"El Toro Relajo\". The score was composed, orchestrated, and conducted by Michael Kamen and was performed by the London Metropolitan Orchestra.","release_dates":"April 7, 1995 (1995-04-07)|||||","produced_by":"Francis Ford Coppola Michael De Luca Fred Fuchs","starring":"Marlon Brando Johnny Depp Faye Dunaway","running_time":"97 minutes","music_by":"Michael Kamen","edited_by":"Tony Gibbs","Release":"The film currently holds 74% on review aggregator Rotten Tomatoes, averaging a 6 out of 10 rating. The film also currently holds a 6.8 rating on IMDB.[1][2]The film had an estimated budget of $25 million, grossing just $22,150,451 in the U.S. With a total $68,592,731 gross worldwide, it was then considered a hit for New Line Cinema.[3] Upon its opening weekend, Don Juan DeMarco opened at #4 with $4,556,274 behind the openings of Bad Boys and A Goofy Movie, and the second weekend of Tommy Boy.[4]","written_by":"Lord Byron (Character) Jeremy Leven","budget":"$25 million"}