{"based_on":"Lunes de fiel  by Pascal Bruckner","country":"France|United Kingdom|United States|","distributed_by":"AMLF (France)|Columbia Pictures (UK)|Fine Line Features (US)|","screenplay_by":"Roman Polanski|Gérard Brach|John Brownjohn|","story_by":"Jeff Gross (Script collaboration)[1][2]","Plot":"British couple Nigel (Hugh Grant) and Fiona Dobson (Kristin Scott Thomas) are on a Mediterranean cruise ship to Istanbul en route to India. They encounter a beautiful French woman, Mimi (Emmanuelle Seigner), and that night Nigel meets her while dancing alone in the ship's bar. Later Nigel meets her much older and crippled American husband Oscar (Peter Coyote), who is acerbic and cynical, having been jaded and a failure as a writer.Oscar invites Nigel to his cabin where he tells Nigel in great detail how he and Mimi first met on a bus in Paris and fell passionately in love. Nigel relates all to Fiona. Both are appalled by Oscar's exhibitionism, but Nigel is also fascinated by Mimi, who provokes him. Later, Oscar narrates how they explored bondage, sadomasochism, and voyeurism. As a contrast to their sexual adventurousness, we see Nigel and Fiona meeting a distinguished Indian gentleman, Mr. Singh (Victor Banerjee), who is traveling with his little daughter Amrita (Sophie Patel).Invited by Mimi, Nigel, escaping from a bridge game, goes to meet her in her cabin, but it turns out she and Oscar have played a joke on him. Nigel wants to leave, but another session unfolds, with Oscar describing how their hate/love relationship developed. Bored, he tried to break up, but Mimi begged him to let her live with him under any conditions. He complied, but started to explore sadistic fantasies at her expense, humiliating her in public. When Mimi became pregnant, he made her have an abortion, saying that he would be a terrible father. When he visited her in hospital, he was shocked by her condition and almost relented in his attempts to drive her away. He promised her a holiday in the Caribbean, but he managed to get off the plane just before take off. Mimi departed alone, crying.Leaving Oscar's cabin, Nigel meets Mimi and they kiss. Afterwards, he finds Fiona in the bar flirting with a young man. She warns Nigel not to stray too far, and that anything he can do, she can do better. Nigel goes to Oscar, who continues his narration. After two years of parties and one-night stands, he drunkenly stepped in front of a vehicle. To his surprise, Mimi came to visit him in the hospital where he was recovering from minor injuries and a broken leg. Mimi shook hands with him, then pulled him out of his bed and left him hanging in his traction device. Having become paraplegic this way, Oscar had no choice but to let Mimi move in with him again and take care of him. She reveled in dominating and humiliating him, seducing men in front of him. When Oscar was desperate and wanted to die, she gave him a gun as a birthday present. Having experienced highs and lows together, they realized they needed each other and actually got married.Nigel clumsily tries to woo Mimi, encouraged and coached by Oscar. Things come to a head at the New Year's Eve party, when Fiona sees them dance together. Fiona tells him that Oscar had made her come to the party. She goes on to dance erotically with Mimi, cheered on by the other partygoers. A stormy sea interrupts the party and the two women leave together. Nigel goes outside clutching a bottle of liquor and screams his frustration into the wind and waves.Nigel finds Fiona in Oscar's cabin, sleeping naked side by side with Mimi. Oscar claims the women have had sex together. Enraged, Nigel grabs his throat, but Oscar points a gun at him and he backs off. Oscar shoots the sleeping Mimi several times, then kills himself. While the bodies of Oscar and Mimi are being stretchered off the ship, Fiona and Nigel, shaken, embrace each other. Mr. Singh encourages his little girl to comfort them.","language":"English|French|","Reception":"On its release in Europe (in 1992) and North America (in 1994), Bitter Moon was not a commercial success and received mixed reviews from critics. One notable positive review came from Roger Ebert:\"Polanski directs it without compromise or apology, and it's a funny thing how critics may condescend to it, but while they're watching it you could hear a pin drop.\" Chicago Sun Times[6]Based on 30 reviews collected by Rotten Tomatoes, 63% of critics gave the film a positive review.[7]","box_office":"$1.9 million[5]","bitter_moon":"Theatrical release poster","cinematography":"Tonino Delli Colli","production_company":"Les Films Alain Sarde Le Studio Canal+","directed_by":"Roman Polanski","release_dates":"September 23, 1992 (1992-09-23) (France)|October 2, 1992 (1992-10-02) (United Kingdom)|March 11, 1994 (1994-03-11) (United States)|||","produced_by":"Roman Polanski|Alain Sarde|Timothy Burrill|","starring":"Hugh Grant|Kristin Scott Thomas|Emmanuelle Seigner|Peter Coyote|","running_time":"139 minutes[3]","music_by":"Vangelis","edited_by":"Herve De Luze","budget":"US$5 million[4]"}