{"based_on":"Oru Kaidhiyin Diary By P. Bharathiraja","distributed_by":"Lakshmi Productions(Madras)[P].LTD","screenplay_by":"K. Bhagyaraj","story_by":"K. Bhagyaraj","language":"Hindi","Synopsis":"David D'Costa (Amitabh Bachchan) lives a relatively poor life in Chennai with his wife Mary D'Costa (Jayaprada) who is pregnant. He literally worships the Member of Parliament Chaturvedi (Sadashiv Amrapurkar), and is even willing to die for him. He introduces Mary to Chaturvedi, and with his blessings they name the new-born son James. Then one day while he is busy obstructing rail traffic, he gets arrested and is bailed out by Mahesh (Anupam Kher) When he returns home he finds that Mary has committed suicide. She left a note blaming Chaturvedi for raping her. An upset David goes to confront Chaturvedi, is intercepted by Police Inspector Roop Kumar Sahay (Dalip Tahil) and Dr. Verma (Bharat Kapoor), the evidence is destroyed, and he is sentenced to 24 years in prison for Mary's murder. He asks his friend Mahesh to look after James in his long absence. Twenty four years later, David is released, he goes to visit Mahesh and is shocked to find that Mahesh has changed, he is no longer a boot-legger, he now lives a wealthy life-style, he wants David to forget the past, and live with his CID Inspector son Vijay (also Amitabh Bachchan). David is devastated with this news, but is determined to avenge his wrongful conviction and Mary's death, so he sets about to kill his tormentors one by one - the only obstruction he faces is none other than Vijay who, unaware of David being his father, is out to protect the 3 people.","Film Response":"The film opened to packed houses in 1986 and turned out to be a roaring blockbuster hit. It was Amitabh Bachchan's last hit before his gloomy period had started. Critics had mixed reviews about the box office collections but it was declared a super-hit. Amitabh's double role, which he'd played with ease, fetched him a much needed hit. Picturized mainly in Chennai(then Madras) and Ooty, the film had a beautiful line up of superstars like Jayaprada, Sridevi, Anupam Kher, Sadashiv Amrapurkar, Dalip Tahil and Bharat Kapoor. This was Sridevi's second film with Bachchan. However, their romantic track did not go too well with the script as the script was too serious to cater to romance. The highlights of the movie have been the confrontation scenes of both of Amitabh's characters. Aakhree Raasta is still considered as Bachchan's finest works to date.","cinematography":"S. Gopal Reddy","production_company":"Lakshmi Productions(Madras)[P].LTD","directed_by":"K. Bhagyaraj","Home Media":"The DVD version of the film was released by IndiaWeekly under its own label. [4]","Watch Online":"Watch online at the site https://www.youtube.com/watch?v=fo1dnU2cmgQ YouTube (this site is not a spam)","release_dates":"6 June 1986","aakhree_raasta_आख़री_रास्ता":"Promotional Poster","produced_by":"T. Rama Rao (Presenter) A. Poornachandra Rao","starring":"Amitabh Bachchan Sridevi Jayaprada","running_time":"165 min.","music_by":"Laxmikant-Pyarelal","edited_by":"A. Selvanathan A. P. Manivannan","written_by":"Rahi Masoom Reza (Dialogue)"}