{"based_on":"Annie Get Your Gun 1946 book  by Dorothy Fields Herbert Fields","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Sidney Sheldon","Production history":"The film was originally budgeted at $1.5 million, with $600,000 paying for the score and the book.[2]Betty Hutton played Annie with Howard Keel (making his American film debut) as Frank Butler and Benay Venuta as Dolly Tate. Frank Morgan, cast as Buffalo Bill Cody, died suddenly of a heart attack shortly after shooting the film's opening production number, \"Colonel Buffalo Bill.\" Morgan was replaced by Louis Calhern. Judy Garland, originally cast in the title role, recorded songs for the soundtrack and worked for two months under the direction of Busby Berkeley, who was in charge of all the musical numbers. In the late 1930s, the teaming of Garland and fellow juvenile star Mickey Rooney in the \"Andy Hardy\" film series featured musical productions staged and directed by Berkeley. He was severe with Garland insisting she perform at her best effort. She resented the hard driving Berkeley primarily from her past experience working on these films with him. Berkeley felt the twenty-eight year old's attitude on the \"Annie\" set lacked any effort or enthusiasm. She continually complained about Busby to studio head Louis B. Mayer, attempting to have him fired from the feature. Garland's revenge was to arrive late or simply not show up at all for each day's filming schedule. MGM suspended Garland for delinquency and for not appearing daily at scheduled call times. Garland claimed she was forced to leave the production (according to press releases) because of poor health and other personal problems This would eventually bring an end to her career at MGM. Garland's dismissal from this film (from which some footage and recordings have survived) figures stoic in the show-biz legend of the Garland fall from grace, her alleged unreliability, and the view of her as a victim of the studio system. Betty Garrett was considered as a replacement but the role of Annie eventually went to Hutton. Shooting resumed after five months, with George Sidney replacing Charles Walters (who in turn replaced Berkeley) as director.[3]According to Betty Hutton, she was treated coldly by most of the cast and crew because of her replacing Garland. During an interview with Robert Osborne (first telecast on Turner Classic Movies \"Private Screenings\" on July 18, 2000), she recalled the other cast members being hostile and the MGM management as so unappreciative they neglected to invite her to the New York premiere. Louis Calhern was reportedly the only major cast member who treated Betty with any kindness and respect. Betty also stated one day Judy Garland was visiting the set and Betty greeted her with a bouncy \"Hiya', Judy!\" only to be answered by a string of profanities. Only two production numbers were completed with Garland: \"Doin' What Comes Naturally\" and \"I'm an Indian Too\" and these were released to the public for the first time in the 1990s in That's Entertainment III. Additional studio recordings of Garland also exist and have been released by Rhino Records.","language":"English","box_office":"$7,756,000[1]","cinematography":"Charles Rosher","directed_by":"George Sidney Busby Berkeley (uncredited) Charles Walters (uncredited)","annie_get_your_gun":"Theatrical release poster","release_dates":"May 17, 1950 (1950-05-17)|||||","produced_by":"Arthur Freed Roger Edens","starring":"Betty Hutton Howard Keel Benay Venuta","running_time":"107 minutes","Musical numbers":"The film adaptation cut the following numbers from the original score: \"I'm a Bad, Bad Man\", \"Moonshine Lullaby\", and \"I Got Lost in His Arms\", (\"An Old Fashioned Wedding\" was written for the 1966 revival). The 2000 compact disc release of the soundtrack includes all of the film's numbers and, \"Let's Go West Again\" (a Hutton number deleted before the film's release), an alternate take of Wynn's \"Colonel Buffalo Bill\", and Garland's renditions of Annie's pieces.","music_by":"Irving Berlin originally Jerome Kern","edited_by":"James E. Newcom","Release":"Despite the production problems, the film became popular in its own right. During its initial release, MGM recorded it as earning $4,708,000 in the US and Canada and $3,048,000 overseas, resulting in a profit of $1,061,000.[1][4]In 1973 it was withdrawn from distribution, owing to a dispute between Irving Berlin and MGM over music rights, which prevented the public from viewing this film for almost 30 years. It was not until the film's 50th Anniversary in 2000 that it was finally seen again in its entirety.One of Hutton's costumes, the very first \"Wild West Show\" costume seen in the film for the reprise of \"There's No Business Like Show Business\" is on permanent display at the Costume World Broadway Collection Museum in Pompano Beach, Florida.","budget":"$3,734,000[1]"}