{"based_on":"Belle de Jour  by Joseph Kessel","country":"France/Italy","distributed_by":"Valoria (France) Allied Artists (USA)","Plot":"Séverine Serizy (Catherine Deneuve), a young and beautiful housewife, is unable to share physical intimacy with her husband, Dr. Pierre Serizy (Jean Sorel), despite their love for each other. Her sexual life is restricted to elaborate fantasies involving domination, sadomasochism, and bondage. Although frustrated by his wife's frigidity toward him, he respects her wishes.While visiting a ski resort, they meet two friends, Henri Husson (Michel Piccoli) and Renée (Macha Méril). Séverine does not like Husson's manner and the way he looks at her. Back in Paris, Séverine meets up with Renée and learns that a mutual friend, Henriette, now works at a brothel. At her home, Séverine receives roses from Husson and is unsettled by the gesture. At the tennis courts, she meets Husson and they discuss Henriette and houses of pleasure. Husson mentions a high-class brothel to Séverine at 11 Cité Jean de Saumur. He also confesses his desire for her, but Séverine rejects his advances.Haunted by childhood memories, including one involving a man who appears to touch her inappropriately, Séverine goes to the high-class brothel, which is run by Madame Anaïs (Geneviève Page). That afternoon Séverine services her first client. Reluctant at first, she responds to the \"firm hand\" of Madame Anaïs, who names her \"Belle de Jour,\" and has sex with the stranger. After staying away for a week, Séverine returns to the brothel and begins working from two to five o'clock each day, returning to her unsuspecting husband in the evenings. One day Husson comes to visit her at home, but Séverine refuses to see him. Still she fantasizes about having sex with him in her husband's presence. Ironically, Séverine's physical relationship with her husband is improving and she begins having sex with him.Séverine becomes involved with a young gangster, Marcel (Pierre Clémenti), who offers her the kind of thrills and excitement of her fantasies. When Marcel becomes increasingly jealous and demanding, Séverine decides to leave the brothel, with Madame Anaïs' agreement. Séverine is also concerned about Husson, who has discovered her secret life at the brothel. After one of Marcel's gangster associates follows Séverine to her home, Marcel visits her and threatens to reveal her secret to her husband. Séverine pleads with him to leave, which he does, referring to her husband as \"the obstacle.\"Marcel waits downstairs for Pierre to return home and shoots him three times. He flees, but is shot dead by police. Séverine's husband survives, but is left in a coma. The police are unable to find a motive for the attempted murder. Sometime later Séverine is at home taking care of Pierre, who is now completely paralyzed and in a wheelchair. Husson visits Pierre to tell him the truth about his wife's secret life; she does not try to stop him. Afterwards, in an ambiguous ending, Séverine sees her husband as healthy again, and they are happy.","language":"French Spanish","box_office":"$20,246,403 [1]","cinematography":"Sacha Vierny","directed_by":"Luis Buñuel","release_dates":"May 24, 1967 (1967-05-24) (France)|April 10, 1968 (1968-04-10) (United States)||||","belle_de_jour":"Theatrical release poster","produced_by":"Henri Baum Robert and Raymond Hakim","starring":"Catherine Deneuve Jean Sorel","running_time":"101 minutes","edited_by":"Louisette Hautecoeur","written_by":"Luis Buñuel Jean-Claude Carrière"}