{"based_on":"A Patriot for Me  by John Osborne","country":"Hungary Austria West Germany","colonel_redl":"Theatrical release poster","distributed_by":"Orion Pictures (USA)","Plot":"Alfred Redl, a Ruthenian boy from Galicia in the Austria- Hungary Empire, wins an appointment to a prestigious military academy in spite of being the son of a mere peasant farmer. At his departure from home, his mother installs in him eternal gratitude towards the Emperor Franz Josef. Redl is never to forget that he owes to the emperor his promising career.At the military academy, the young Redl soon stands out for his talent, drive and loyalty to the Crown. One of his teachers forces him to inform on Kristof Kubinyi, a student who's the source of a practical joke; though he beats himself up for incriminating his comrade, Alfred soon realizes that to rise in the ranks he must overcome his peasant background by ingratiating himself with his superiors. Alfred and Kristof become fast friends. Kubinyi invites Redl home for the holidays to the elegant residence of his parents, who lead a life of privilege and nobility in Hungary. There, Alfred meets Kristof's pretty sister, Katalin, who welcomes him warmly. To Kubinyi's aristocratic parents, Redl hides his true humble background pretending to be of Hungarian ancestry and a member from an old family who lost all its fortune.Redl and Kubinyi slowly climb the ladder of career-officers. Once they become adults, the two friends have different political ideals. As a Hungarian, Kubinyi slowly falls prey to the national aspirations of a Habsburg-free Hungary, while Redl remains fiercely patriotic and faithful to his benefactor, the Austrian Emperor. For Redl his relationship with Kubinyi goes beyond friendship as Redl harbors an unrequited love for his comrade. When the two young men visit a brothel, Redl seems more interested in watching his friend Kristof having sex with one of the prostitutes than in engaging the woman in his own room. Redl suppresses his attraction to Kristof, however, and transfers it, as best as he can, to Katalin, his friend's beautiful sister. Back at the academy, Alfred serves as a second in a duel between Kristof and another classmate, who is killed in the contest. This foolishness jeopardizes the careers of both Kubinyi and Redl, but the commanding officer, Colonel von Roden, having noted Redl's hard work and loyalty to the Emperor, arranges a promotion for him and a prized assignment in Vienna. In Vienna, Redl is able to renew his friendship with Katalin, who is, by then, unhappily married. They become lovers in spite of Katalin knowing well that it is her brother who Alfred really loves.Redl is assigned to a garrison serving on the Russian border. The discipline there is lax and Redl readily stands out as a serious-minded young officer. When the district commander decides to retire, Redl is recommended for the job. As commanding officer, he proves very demanding, working hard to reinvigorate the discipline of his outfit. This does not sit well with the junior officers, including Kristof, especially because they feel superior to Redl by birth. When Redl and Kristof have a falling out over Kristof's sloppy habits and poor performance, Kristof mocks Redl's lowly origins in conversation with other officers.Colonel von Roden intervenes on Redl's behalf again, bringing him back to Vienna to serve as deputy chief of the counter-espionage service. It's a nasty kind of job, since it entails spying on officers throughout the service, trying to identify those engaging in espionage activities for the Russians. On Katalin's suggestion, Redl undertakes a loveless marriage of convenience in order to quell rumors of his homosexual proclivities. His wife, Clarissa, suffers from ill health and remains a distant figure in his life.Redl's single-minded devotion to duty soon draws him into the orbit of the heir to the crown, Archduke Franz Ferdinand, who is a ruthless schemer (whose ultimate objective is portrayed as to overthrow the Emperor in a coup d'etat). Redl participates in one of the Archduke's plots, which involves setting up an aging Ukrainian officer for a dramatic fall so as to shake the army out of its complacency. The man is accidentally shot to death, however, during the search and seizure, negating the value of the plan. The Archduke then decides to make Redl the fall guy instead. Redl contributes to his own downfall by allowing himself to be seduced by a homosexual Italian officer. Redl is now doomed. Under arrest, he is given a service pistol with which to take his own life. It falls upon Kristof to provide Redl with the gun and order him to commit suicide. After experiencing anger, hesitation and despair, Redl finally shoots himself in the head. The film ends with a brief depiction of the notorious assassination of the Archduke, at Sarajevo, and the resulting World War I.","language":"German Hungarian","cinematography":"Lajos Koltai","production_company":"Jadran Film MAFILM Objektív Filmstúdió","directed_by":"István Szabó","Acuracy":"When looking at the film questions arise about tha accuracy of the film : Redl is said to be a Ruthenian (i.e. Ukrainian). In fact, his family was of German-Czech origin. Redl is shown as coming from a poor family : in fact his father was a senior employee of the railways. It was a middle-class family. His sister is shown as a poor illiterate peasant woman : in fact she was a school-teacher. There is no objective reason for the plot against Redl : why would have Franz-Ferdinand organized a plot in order to accuse falsely an officer of his own's army ? Just to create some trouble ?","Awards":"The film won the BAFTA Award for Best Foreign Language Film. It was nominated for an Academy Award for Best Foreign Language Film, but lost to The Official Story.[1]It won the Jury Prize at the 1985 Cannes Film Festival.[2]","release_dates":"20 February 1985 (1985-02-20) (Hungary)|29 March 1985 (1985-03-29) (West Germany)||||","produced_by":"Manfred Durniok","starring":"Klaus Maria Brandauer|Gudrun Landgrebe|Hans-Christian Blech|Jan Niklas|Armin Mueller-Stahl|","running_time":"144 minutes","music_by":"Zdenkó Tamássy","edited_by":"Zsuzsa Csákány","written_by":"István Szabó Péter Dobai"}