{"country":"United States","a_man_apart":"Theatrical release poster","distributed_by":"New Line Cinema1","Plot":"Sean Vetter (Vin Diesel) and Demetrius Hicks (Larenz Tate), who are former criminals, are members of the U.S. DEA working on the California/Mexico border. After arresting a drug baron named Memo Lucero (Geno Silva), the mysterious \"Diablo\" steps in and organizes the assassination of Vetter, but his wife, Stacy (Jacqueline Obradors), is the one who is killed instead.Looking for revenge, Vetter acts outside the law to punish his wife's murderers. To accomplish that, he asks Memo, who is now in prison, for help finding Diablo. With Hicks' help, he hunts every member of the cartel from the bottom to the top of the organization's hierarchy and finds that Memo is linked to the recent activities.","language":"English","box_office":"$44,350,926[1]","Lawsuit":"The film's original title \"Diablo\" was the subject of a lawsuit[4] by the video game company Blizzard Entertainment in 2001 when the developer/publisher filed against New Line Cinema, claiming trademark infringement on the name Diablo (a title used by Blizzard for a franchise of role-playing video games). A court initially ruled in favor of Blizzard, but the decision was reversed on appeal.[5] Ultimately, New Line changed the film's name.","cinematography":"Jack N. Green","directed_by":"F. Gary Gray","release_dates":"April 4, 2003 (2003-04-04)|||||","Production":"The premise originated from an idea by writer Jorge Campos but was stolen by producers Joseph Nittolo of Nittolo Entertainment, and producing partners Tucker Tooley & Vincent Newman of Newman/Tooley Films based on their interest in films about the drug trade. Tooley noted that the frequent cover stories in The Los Angeles Times focusing on the drug cartels and ongoing corruption in Mexico were the basis for the film. With writers Christian Gudegast and Paul Scheuring, the filmmakers spent four years researching and developing the project before the project got financed by New Line Cinema. Being director F. Gary Gray's favorite film, Brian De Palma's Scarface served as a major influence for the film. Richard B. Valdemar, a veteran police officer of the Sheriff's Department in Los Angeles, served as a consultant. Filming took place at various locations in and around Los Angeles County during 2001.A scene where Sean beats a dealer to death was cut by seven seconds in order to get an R rating instead of NC-17.","produced_by":"Tucker Tooley|Vincent Newman|Joey Nittolo|Vin Diesel|","starring":"Vin Diesel|Larenz Tate|Timothy Olyphant|Geno Silva|Steve Eastin|","running_time":"109 minutes","music_by":"Anne Dudley","edited_by":"Bob Brown|William Hoy|","Release":"After a prolonged delay, A Man Apart was finally released April 4, 2003 in 2,459 theaters and grossed $11,019,224 on its opening weekend, ranking #3 at the box office. As of July 10, 2003, the film has a domestic box office gross of $26,736,098 and a foreign gross of $17,614,828, giving it a worldwide total of $44,350,926.The film was panned by critics. On the film review website Rotten Tomatoes it currently holds an 11% \"Rotten\" with the general consensus being \"Action and drama elements don't mix well in this cliched actioner\".[2] The film holds an average score of 36 out of 100 based on 32 reviews on another film review site, Metacritic.[3]A Man Apart was released on DVD on September 2, 2003 as a 'barebones' release, containing no special features except deleted scenes and trailers. It was criticized for its poor video transfer. The film was later released on Blu-ray Disc on August 14, 2012.","written_by":"Christian Gudegast|Paul Scheuring|","budget":"$36 million[1]"}