{"country":"United States","distributed_by":"Gathr","Plot":"The film follows William Reynolds, a former assassin for the British East India Company. To redeem his past and earn the heart of the woman he loves, he must aid in the cause of the colonists during the American Revolution.","language":"English","Reception":"The review aggregator website Rotten Tomatoes lists a 25% approval rating for the film, based on 12 major media reviewers (including the Los Angeles Times and Chicago Tribune).[6]The Christian movie review site PluggedIn gave the film four out of five \"Plugs\" (Units for measuring family-friendliness).[7] The Christian media site BreatheCast gave the film four stars, saying \"The movie's fight choreography and period costuming are to be commended. With a slim budget of $4 million, Burns Family Productions manages to create a film that visually rivals many big budget movies of the same genre (such as 'The Count of Monte Cristo' and 'Zorro'.) The film was met with great enthusiasm from fans across the U.S. and in multiple other countries.The movie was partially funded by a 2011 Kickstarter campaign.\"[3]","box_office":"$1,236,094[4]","beyond_the_mask":"Theatrical film poster","cinematography":"Ethan Ledden","production_company":"Burns Family Studios","directed_by":"Chad Burns","Releases":"Burns Family Studios released Beyond the Mask in April 6, 2015[1] and after increasing demand and talks with movie theaters,[2] Burns Family Studios reached an agreement with film distributor Gathr to release the films to 111 movie theaters nationwide on June 5, 2015.The film was to be released on DVD on Tuesday, September 8, 2015 in 3,900 Walmart stores across the U.S., but some didn't receive copies until a few days later due to a distribution problem. The DVD was also available on Amazon, ChristianCinema.com, and its own website (beyondthemaskmovie.com), along with a \"making-of\" book, soundtrack CD (which had been released substantially earlier), and other promotional merchandise.","release_dates":"April 6, 2015 (2015-04-06)|||||","produced_by":"Aaron Burns","starring":"Andrew Cheney John Rhys-Davies Kara Killmer Adetokumboh M'Cormack Steve Blackwood Thomas D. Mahard John Arden McClure Alan Madlane","running_time":"103 minutes","music_by":"Jurgen Beck","edited_by":"Mike Wech","written_by":"Paul McCusker","budget":"$4 million[3]"}