{"country":"United States","distributed_by":"Sony Pictures Classics","screenplay_by":"David Gordon Green","story_by":"David Gordon Green Paul Schneider","Plot":"Paul is a womanizer in his early twenties who lives in a small Southern town, where he earns a living fixing cars for his uncle. Paul still lives with his mother, Elvira, who works as a clown cheering up children at the local hospital. He spends most of his time hanging out with his best friend and self-proclaimed partner-in-crime, Tip, and their friends Bo and Bust-Ass. Among his friends, Paul has a reputation as a ladies' man, but he's not at all known for being involved with long-term relationships; most of Paul's romances last only a few weeks, and he's slept with nearly every girl in town. Paul is beginning to reach a point where he would like to lead a different life, and that feeling becomes all the more clear when he meets Noel, Tip's teenage sister who has come back home after attending a boarding school. Noel is more thoughtful and mature than the girls Paul is used to. Paul and Noel soon fall in love, but for Paul this is a different sort of relationship than he's accustomed to — Noel is still a virgin, and her contemplative nature gives him a desire to be a better, stronger person, but Tip does not approve of Paul dating his younger sister, which leads to a rift between these longtime friends.","language":"English","Reception":"The film got mostly positive reviews when it was initially released in 2003; it currently holds a 71% rating on Rotten Tomatoes and a 71 out of 100 metascore on Metacritic.[1][2] Roger Ebert of the Chicago Sun Times said “Green is 27, old enough to be jaded, but he has the soul of a romantic poet. Wordsworth, after all, was 36 when he published, ‘The Rainbow comes and goes and lovely as the Rose.’ How many guys that age would have that kind of nerve today?” He gave the film a four out of four star rating.[3]All the Real Girls was a financial failure at the box office. The film was released on February 14, 2003 and played in six theaters, bringing in $39,714 in its opening weekend. By the time it ended its theatrical run on July 10, 2003 it had made back $549,666 of its $2,500,000 budget.[4] The film was nominated for awards at several different film festivals globally. Green was nominated for the Grand Jury Prize but won the Special Jury Prize at the Sundance Film Festival along with Clarkson for her role in the film. Deschanel was nominated for Best Female Lead at the 2004 Independent Spirit Awards and Best Actress at the 2004 Mar del Plata Film Festival.[5]","box_office":"$548,712","cinematography":"Tim Orr","directed_by":"David Gordon Green","all_the_real_girls":"Theatrical release poster","release_dates":"January 19, 2003 (2003-01-19) (Sundance)|February 14, 2003 (2003-02-14) (United States, limited)||||","produced_by":"Jean Doumanian Lisa Muskat","starring":"Patricia Clarkson Zooey Deschanel Paul Schneider","running_time":"108 minutes","music_by":"Michael Linnen David Wingo","edited_by":"Zene Baker Steven Gonzales","budget":"$2.5 million"}