{"based_on":"Wings of Desire  by Wim Wenders Peter Handke Richard Reitinger","country":"Germany United States","distributed_by":"Warner Bros.","screenplay_by":"Dana Stevens","Plot":"Seth (Nicolas Cage) is one of many angels who watch over humans and protect them in unseen ways. Seth's main responsibility is to appear to those who are close to death and guide them to the next life. As part of this task, Seth and one of his fellow angels, Cassiel (Andre Braugher), like to ask people what their favorite thing in life was. Despite these daily encounters, they have trouble understanding human beings and their ways.While waiting to escort a man who will not survive heart surgery to the other world, Seth is impressed by the vigorous efforts of the surgeon, Maggie Rice (Meg Ryan), to try to save the ill-fated man's life and her sincere anguish at her failure to do so. Seth soon becomes preoccupied with Maggie and decides to become visible to her despite his obvious inability to give her many convincing details about himself, such as what he does for a living or even his last name. Despite this, they develop a friendship which soon turns to mutual attraction, although Maggie is already involved with one of her colleagues, Jordan Ferris (Colm Feore), at the hospital. Seth then meets Nathaniel Messinger (Dennis Franz), one of Maggie's patients, who can sense Seth's presence and that of other angels. Nathaniel soon relates to Seth that he, too, had once been an angel but, by way of the free will granted to angels, decided to become human through the process he refers to as \"falling\". Seth begins to consider exercising this option so that he can be with Maggie in a fully physical and emotional relationship. When Maggie receives a marriage proposal from Jordan, she finds herself having to choose between him and Seth.Having realized that Seth is impervious to injury, Maggie confronts him and demands to know who or what he really is, but she is unable to accept the revelation and sends him away. Maggie later talks with Nathaniel, who gradually reveals his own angelic origin, explaining why he himself chose to become human and telling her that Seth is thinking of doing the same. Seth decides to become human through the symbolic gesture of jumping from the top of a skyscraper. Immediately upon awakening, he starts to experience all of the human feelings and sensations that he had never been able to understand, beginning with physical injury and pain. Up until this point, Seth's personality and emotions, like those of all the other angels, had been very subdued, but that starts to change. Now human, Seth heads to the hospital to see Maggie, but is told that she has gone to her uncle's mountain cabin for a break. Penniless and naive, he cannot pay for the journey and ends up getting mugged and having his boots taken by a gang of roving predators. He eventually hitches a ride to Lake Tahoe and appears, soaked and cold, at Maggie's doorstep. Seeing the split lip and condensed breath coming from his mouth in the cold air, Maggie realizes that he has given up his exalted status for her love. She sees to his wounds and they enjoy warm, passionate lovemaking at last.The next morning, as Seth is in the shower, enjoying his first sensation of running hot water on his body, Maggie rides her bike to a local store to buy some pears for him. On her way back, happy and fulfilled, she rides her bike with her eyes closed and her arms wide open. Her happiness is cut short by a truck that catches her by surprise when it pulls out in front of her. Seth senses that Maggie is in trouble and runs to her aid. He arrives in time for Maggie to tell him that she sees the angel who has come to escort her away. Although Seth is no longer able to see the angels, he knows they are there and frantically begs Maggie not to look at them. Maggie tells him that she is not afraid anymore and that when they will ask her what her favorite thing in life used to be, she will say it was Seth, before she passes away.Grieving and alone, Seth is visited by Cassiel. Seth questions if he is being punished for leaving heaven to be a human, which Cassiel assures him is not the case: He tells Seth people die, and one day, so will he. Cassiel offers comfort and asks Seth if he had known this would happen, would he still decide to become human. Seth answers, \"I would rather have had one breath of her hair, one kiss of her mouth, one touch of her hand, than eternity without it. Just one.\"The final scene recalls an earlier one with Nathaniel. It shows Seth at the beach where the angels meet every day at dawn to listen to the celestial music while watching the sunrise. With Cassiel and the rest of the angels watching, Seth expresses his joy in being human and the fact that he has come to terms with his new life by running into the water and playing in the waves. In a rare moment of emotion, Cassiel is seen laughing joyfully for his old friend.","language":"English","Reception":"City of Angels earned almost $200 million in worldwide box office,[1][2] and had a mixed reaction from critics, earning a 59% score on Rotten Tomatoes based on 61 reviews.[3]","box_office":"$198,685,114","cinematography":"John Seale","production_company":"Regency Enterprises Atlas Entertainment","directed_by":"Brad Silberling","city_of_angels":"Theatrical release poster","release_dates":"April 10, 1998 (1998-04-10) (United States)|July 23, 1998 (1998-07-23) (Germany)||||","produced_by":"Charles Roven Dawn Steel","starring":"Nicolas Cage Meg Ryan Andre Braugher Dennis Franz","running_time":"114 minutes","music_by":"Gabriel Yared","External links":"","edited_by":"Lynzee Klingman","budget":"$66 million"}