{"based_on":"Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean  by Ed Graczyk","country":"United States","distributed_by":"Cinecom International Films (1982, original) Olive Films (under license from Paramount Pictures) (2014, Blu-ray DVD)","screenplay_by":"Ed Graczyk","Plot":"On September 30, 1975, an all-female fan club called the Disciples of James Dean meets inside a Woolworth's five-and-dime store in McCarthy, Texas,[3]:90 to honor the twentieth anniversary of the actor's death. The store is 62 miles away from Marfa, where Dean filmed Giant in 1955. Inside, store owner Juanita prepares for another day on the job while listening to Gospel music on the radio, and also calls for Jimmy Dean by name. Meanwhile, one of the Disciples, Sissy, comes in late after helping out at the truck stop; Juanita remarks that more members could arrive soon. Another one, Mona, is taking a late bus.After Sissy worries about the weather (\"118 degrees in the shade\"), a flashback to a stormy night in 1955 occurs. Coming inside for shelter, Sissy asks about three friends of hers: Mona, Sydney and Joseph Qualley (or \"Joe\" for short).[1]:131 Joe is busy stocking up some new issues of Photoplay magazine; Mona arrives late due to the weather. To Juanita's chagrin, Sissy, Mona and Joe go up at the counter and begin singing the doo-wop tune \"Sincerely\", which Juanita opposes, preferring to listen only to Gospel music.Back in 1975, another two Disciples, Stella Mae and Edna Louise, make their way to the five-and-dime, bringing a red jacket that the club used to wear. Mona joins them and explains that the bus she was riding on broke down and had to be repaired. Looking at a group picture (with James Dean), she recalls the last time the Disciples, all dressed in jackets, came together. As reunion preparations continue, so does the flashback. (At this point, Sissy's friends joyfully break the news that Elizabeth Taylor, Rock Hudson and James Dean will be visiting the McCarthy vicinity to film Giant; auditions will be carried out across that area. This only prompts Mona's desires to play alongside Dean, her idol, in that film.) When Mona reveals that Dean chose her to raise his son, Juanita thinks that she is \"warped and demented\". Mona loses her temper when Sissy badmouths her; the latter goes outside to \"cool off\".Mona and Juanita leave the shop for a while, and see a window shopper, Joanne, driving in a Porsche sports car. Joanne has arrived in McCarthy thanks to an old highway sign promoting Dean's son at the store. The Disciples learn that she had a sex change operation[3]:91 almost thirteen years ago, and (as Joe) was the only man in this group. In a flashback, Joe was scorned by town-dwellers after attending a high school dance in drag,[7] and got brutally beaten in a graveyard. Hearing that story, Stella wonders whether Joanne is a hermaphrodite—\"half-man, half-woman\". Joanne explains she had a sex-change operation 13 years before and is a woman, showing physical proof to several of the friends.Later in the day, Juanita tells the Disciples to brace themselves for stormy weather, after thinking she hears thunder. Instead, the loud noise comes from a sports car—Mona's son Jimmy Dean has stolen Joanne's car. As Joanne phones the local Highway Patrol to have Jimmy Dean returned, another flashback takes root: they hear the radio announcer reveal that a car accident has killed actor James Dean. They decide to hold a vigil.Among the other secrets and revelations, Mona announces that she almost died from asthma. She claims she was an extra in Giant.[1]:131 As the reunion winds down, it appears that Jo/Joanne was the father of Mona's never-seen 20-year-old son, Jimmy Dean, who has stolen Joanne's Porsche. The Disciples make a pact to hold another one in the next twenty years. Mona refuses. She, Sissy and Joanne appear in front of the mirrors and sing \"Sincerely\" again. The film ends with shots of the decaying, abandoned five-and-dime store, while the song fades and the wind blows.","language":"English","Critical reception":"On its original release, The Boston Globe's Michael Blowen hailed Jimmy Dean as \"[Altman's] best film since Nashville\". He added, \"[The director] is having fun again. He seems more comfortable in a desolate Woolworth's than he did on the frozen tundra of Quintet. In contrast with A Wedding, in which Altman cynically patronized his characters, he seems to love these three women. And why not?\"[28] The Associated Press' Bob Thomas said, \"The film is a heartening example of how good writing [...], gifted direction and solid acting can produce something worthwhile on a tiny (under $1 million) budget.\"[29]The New York Times' Vincent Canby gave Jimmy Dean a mixed review. \"There are some interesting things about [the film],\" he observed, \"but they have less to do with anything on the screen than with the manner in which the film was produced and with Mr. Altman's unflagging if misguided faith in the project.\" He complained that \"The actresses are not treated kindly, either by the material or by the camera,\" and noted that Sandy Dennis' character, Mona, received most of the close-ups. \"The only person in the film who comes off well,\" he said, \"is Miss [Sudie] Bond.\"[8] New York Magazine's David Denby wrote: \"Altman uses cinema to celebrate theater, and his technique is so fluidly self-assured that he almost makes you forget the rubbishy situations and lines created by playwright Ed Graczyk. Almost, but not quite.\"[30]Pauline Kael wrote in 5001 Nights at the Movies: \"When Robert Altman gives a project everything he's got, his skills are such that he can make poetry out of fake poetry and magic out of fake magic. Moving in apparent freedom, the principal actresses [...] go at their roles so creatively that they find some kind of acting truth in what they're doing. They bring conviction to their looneytunes characters.\"[31] Film critic Leonard Maltin gave Jimmy Dean two and a half stars out of four in his Movie Guide. \"Strong performances, and Altman's lively approach to filming [Graczyk's] Broadway play,\" he said, \"can't completely hide the fact that this is second-rate material.\"[32] The staff of Halliwell's Film Guide wrote, \"[Jimmy Dean] descends from cynicism through gloom to hysteria and is never very revealing.\"[33]At the Chicago premiere of Jimmy Dean, Altman spoke of its festival acclaim to his audience: \"I never have had a film of mine received as well as this film—I don't understand it, but I like it!\"[1]:131 In a January 1983 interview with the Boston Globe, he stated that \"The critical reaction doesn't surprise me. Nothing surprises me any more. I take that back. One thing surprised me when I showed Jimmy Dean at film festivals—no one walked out.\"[1]:130Jimmy Dean won the Best Film Award at the Chicago International Film Festival, as well as a Best Screenplay Award at the Belgium International Film Festival.[1]:131[34] Cher, who played Sissy in the film, received a Golden Globe nomination for Best Supporting Actress in a Motion Picture.[35]","Themes and criticism":"Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean has been noted to address the subject of feminism.[1]:135[3]:92[36] In Robert Altman: Hollywood Survivor, Daniel O'Brien wrote that \"[Jimmy Dean] is in part an attempt to explore the way women are forced to suppress their emotions and personalities in order to be accepted by the male-dominated society around them\".[3]:92On the film's sexuality issues, Robin Wood said: \"What is especially interesting about Come Back to the Five and Dime is the connection it makes between the oppression of women and patriarchy's dread of sexual deviation and gender ambiguity. Joe (the only male character to appear in the film, in flashback) is clearly (and sympathetically) presented as feminine (as opposed to the stereotypically effeminate), woman-identified, and gay; as Don Short has perceptively shown, the film implies that he has become a transsexual [...] because his society had no place for a gay male.\"[36]In his 1985 book on Altman, Gerard Plecki wrote: \"The reference to the James Dean myth is a clue to Altman's pervasive film message. Altman knows that James Dean had the kind of screen presence and magic that caused people to 'give in' to cinema.\" He added that \"In each film [the director] strives to reinforce and respond to that essential need—to give in to cinema.\" Plecki observed that \"It is fascinating that, after The James Dean Story, Altman would select another project touching upon the life of [the late actor].\"[1]:135O'Brien criticized the character development of the supporting roles,[3]:92 while Plecki said that, compared to those in previous Altman films, none of the characters \"are immediately likable\".[1]:133 \"The reasons for the limited appeal of the characters are quite complex,\" Plecki wrote. \"Most of the women's problems are physical or sexual ones.\"[1]:133In Jimmy Dean, Altman frequently uses mirrors as a device for seamlessly connecting scenes between the present and the past. Reflections in mirrors are part of many of the film's frame compositions.[1]:130[3]:93 As noted Daniel O'Brien in Robert Altman: Hollywood Survivor, they \"[become] a window into 1955, enabling the characters to gaze into the past\".[3]:93","come_back_to_the_five_and_dime,_jimmy_dean,_jimmy_dean":"Original theatrical poster","box_office":"US$2,276,900[4]","cinematography":"Pierre Mignot","production_company":"Mark Goodson Productions Viacom Enterprises Sandcastle 5","directed_by":"Robert Altman","release_dates":"September 30, 1982 (1982-09-30) (Chicago[1]:129)|November 12, 1982 (1982-11-12) (United States[2])||||","Production":"After directing 1980's critically panned Popeye and selling his Lion's Gate studio, Robert Altman turned his attention to the stage.[3]:89 One of his first tasks in this field was acquiring and directing Ed Graczyk's Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean,[1]:126[3]:89 a drama originally performed in Columbus, Ohio in 1976.[9] Altman's work on the play, despite its bad reviews and short run, convinced him that a film version was imminent.[3]:89–90 \"On stage it was humorous and bawdy,\" he commented. \"On film it's more emotional.\"[10] Jimmy Dean was his first feature adaptation of a play; he followed this effort with 1983's Streamers and 1987's Beyond Therapy, among others.[11]Altman then made a deal with the play's production executive, Peter Newman, and retained the original cast members.[3]:90 The filmmaker received over US$800,000 from Viacom Enterprises, through game show company Mark Goodson Productions,[1]:129 almost as much money as the play had cost him.[12] It was his intention to shoot Jimmy Dean for the cinema; \"the initial press report that it was made for cable is not true,\" he said.[1]:129Of his preparations for Jimmy Dean, Altman added, \"I didn't do what they told me I had to do, I hired the people I wanted.\"[1]:129 The production was his first to involve Pierre Mignot, a Canadian cinematographer;[3]:92[13]:xix they would both collaborate on five more films.[3]:92 Filming took place on just one set:[3]:90 a \"redressed\" version of its Broadway counterpart.[1]:129 Altman used Super 16 equipment[1]:129 during the nineteen-day shoot;[14] this was later converted to 35 mm stock for the first answer print.[1]:129 For the film's flashbacks, he built a double set with two-way mirrors that were controlled by computerized lighting techniques—which became problematic for both him and the film's critics.[1]:130","produced_by":"Scott Bushnell","starring":"Sandy Dennis Cher Karen Black Sudie Bond Kathy Bates","running_time":"109 minutes","edited_by":"Jason Rosenfield","Release":"Robert Altman took Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean to the Montreal and Toronto film festivals in Canada, as well as those in Belgium, Venice and Deauville.[1]:131 The film received its U.S. premiere on September 30, 1982 (the 27th anniversary of the late actor's death) at the Chicago International Film Festival, where it received a ten-minute standing ovation. After this screening, Altman discussed various aspects of the production during a question-and-answer session.[1]:129The filmmaker refused to let any major U.S. studio handle Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean, due to the problems he had with 20th Century-Fox over his 1979 production HealtH.[1]:129 Instead, he let Cinecom, an independent distributor in New York City, open it in arthouse theaters \"to guarantee a long play\";[1]:129 it became the first release for that company.[15] The film opened on a limited basis in just two theaters on November 12, 1982, grossing US$22,298 and placing 18th at the North American box office that weekend.[2] By its fourth week, it made US$177,500 after going to four venues;[2] during its entire run, it grossed US$840,958.[4]Jimmy Dean aired on the Showtime cable network in May 1983.[16] It was released on VHS by Embassy Home Entertainment that same year,[17] and on laserdisc in 1984;[18] a video re-issue from Virgin Vision followed in June 1989.[19] It was released on Blu-ray on November 18, 2014, by Olive Films, under license from Paramount Pictures.[20]A restored version of the film was released in 2011. The film was restored by the UCLA Film & Television Archive (in cooperation with Sandcastle 5 Productions) as “the first fruit of a new, larger project ... to preserve Mr. Altman's artistic legacy.”[21] The preservation was funded by the Hollywood Foreign Press Association and The Film Foundation.[22]The new print was made “from the original Super-16mm color negative, a 35mm CRI, a 35mm print, and the original ½ inch analog discreet mono D-M-E track.”[22]The restoration premiered at the UCLA Festival of Preservation on March 3, 2011[22][23] and was screened at other North American cities in 2011 including New York City,[24] Chicago,[25][26] and Vancouver.[27]","budget":"US$850,000[3]:90"}