{"based_on":"Along Came a Spider  by James Patterson","country":"United States","Awards and nominations":"Jerry Goldsmith won the BMI Film & TV Award for his original score, and Morgan Freeman was nominated for the NAACP Image Award for Outstanding Actor in a Motion Picture but lost to Denzel Washington for Training Day.","distributed_by":"Paramount Pictures","Plot summary":"After Washington, D.C. detective, forensic psychologist and author Alex Cross (Morgan Freeman) loses control of a sting operation, resulting in the death of his partner, he opts to retire from the force. He finds himself drawn back to police work when Megan Rose (Mika Boorem), the daughter of a United States senator, is kidnapped from her exclusive private school by computer science teacher Gary Soneji (Michael Wincott). U.S. Secret Service Special Agent Jezzie Flannigan (Monica Potter), held responsible for the breach in security, joins forces with Cross to find the missing girl.Soneji contacts Cross by phone and alerts him to the fact one of Megan's sneakers is in the detective's mailbox, proving he's the kidnapper. Cross deduces the man is obsessed with the 1932 Charles A. Lindbergh Jr. kidnapping and hopes to become as infamous as Bruno Hauptmann by committing a new \"Crime of the Century\" which might be discussed by Cross in one of his true crime books. Megan's kidnapping proves to be only part of Soneji's real plan: to kidnap Dimitri Starodubov (Anton Yelchin), the son of the Russian president, guaranteeing himself greater infamy.After Cross and Flannigan foil his second kidnapping plot, a supposed call from the kidnapper demands Cross deliver a ransom of $10 million in diamonds by following an intricate maze of calls made to public phone booths scattered throughout the city. Cross ultimately tosses the gems out the window of a rapidly moving Metro train to a figure standing by the tracks. When Soneji later arrives at Flannigan's home and confronts Cross after disabling Flannigan with a taser, the detective realizes the kidnapper is unaware of the ransom demand and delivery. Soneji tries to leave with Flannigan but Cross kills him.Cross becomes suspicious and realizes someone discovered Soneji long before his plot came to fruition. After searching Flannigan's home computer, he finds enough evidence to prove Flannigan and her fellow Secret Service agent, Ben Devine (Billy Burke), used Soneji as a pawn in their own plot. He tracks them down to a secluded farmhouse where Flannigan has murdered Devine and is now intent on eliminating Megan Rose. Cross saves Megan and shoots Flannigan in the heart, killing her. Afterwards, Alex takes Megan back to her parents.","screenplay_by":"Marc Moss","language":"English","Critical reception":"The film received mixed to negative reviews and has a \"rotten\" rating of 32% on Rotten Tomatoes.[4]Elvis Mitchell of The New York Times called the film an \"overplotted, hollow thriller, which crams in so much exposition that characters speak in fetid hunks for what seems like minutes at a time ... But Spider couldn't be better served than it is by Mr. Freeman, whose prickly smarts and silken impatience bring believability to a classless, underdeveloped thriller ... Still, he is wasted in this impersonal, almost inept thriller.\"[5]Roger Ebert of the Chicago Sun-Times gave the film a mixed 2 stars out of a possible 4. He wrote: \"A few loopholes I can forgive. But when a plot is riddled with them, crippled by them, made implausible by them, as in Along Came a Spider, I get distracted. I'm wondering, since Dr. Alex Cross is so brilliant, how come he doesn't notice yawning logical holes in the very fabric of the story he's occupying? ... The film contains two kinds of loopholes: (1) Those that emerge when you think back on the plot, and (2) Those that seem like loopholes at the time, and then are explained by later developments that may contain loopholes of their own ... There are places in this movie you just can't get to from other places in this movie.\"[6] Nonetheless, Ebert thought that Freeman's performance made Cross an intriguing character, even when the plot was verging on the nonsensical.Robert Koehler of Variety felt \"the very characteristics that have made Cross so appealing, particularly his mind-tickling abilities to assess and outmaneuver his criminal opponents, are reduced here to the most fundamental and predictable level ... As reliable as any actor in Hollywood, Freeman delivers the requisite gravitas, but the bland script curtails any personal touches he might have inserted were his sleuth character unraveling a truly vexing mystery.\"[7]However, critic Harvey O'Brian weighed in with the sentiment that \"Unlike, for example, the overblown kidnap movie Ransom, Along Came a Spider plays down its sensational elements. It favours the procedural aspects of Cross' investigation which, though infected with the usual 'Eureka' factor of brilliant discoveries by the leading man at regular intervals just when it looked like he was stumped, are largely delivered with sincerity. Freeman has such a strong grip on this kind of determined, middle aged, everyman character by now that he can easily take the audience along for the ride. The film itself is otherwise sincere in general, with no real attempt at smarmy black humour or winks to the audience. It draws you in to a (relatively) realistic depiction of a tense situation in which people behave less like action heroes and more like human beings.\"[8]Compuserve's Harvey Karten argued, \"Some critics will tell you that despite Lee Tamahori's overplotting of Marc Moss's adaptation of James Patterson's novel, Along Came a Spider is one of those thrillers that allow you to check your brains at the door. Not true. Did the journalists all go for popcorn when Detective Alex Cross and Special Agent Jezzie Flannigan (nice spelling) engaged first in a discussion of psychology and then of philosophy? This may have been Phil 101, but imagine the interest that must have been aroused in the audience with a product placement for university education. Says Cross in discussing what makes us choose our careers: 'You do what you are.' 'Not so,' replies Jezzie, every hair in place, not one gram of makeup disturbed, despite the excitement of the discussion... 'You are what you do.'\"[9]","box_office":"$105.2 million[2]","cinematography":"Matthew F. Leonetti","production_company":"Rhythm and Hues Studios Revelations Entertainment","directed_by":"Lee Tamahori","Character reboot":"There were no further sequels, but the character of Alex Cross was rebooted with a 2012 film adaptation of the novel Cross under the title Alex Cross starring Tyler Perry in the titular role.","along_came_a_spider":"Theatrical release poster","release_dates":"April 6, 2001 (2001-04-06)|||||","Production":"One of the primary elements of the book screenwriter Marc Moss eliminated from his script was the fact that Soneji is actually a mild-mannered suburban husband and father suffering from dissociative identity disorder resulting from having been abused as a child. After a lengthy trial for kidnapping and several murders not included in the film, he is found guilty but remanded to a mental institution to serve his sentence. Also missing from the film is a romantic relationship shared by Cross and Jezzie, her trial and eventual execution by lethal injection, and the discovery of Megan (Maggie as she is known in the book), hidden away with a native Bolivian family near the Andes Mountains, two years after her kidnapping.A few other minor differences from the original book include: Dimitri (Michael \"Shrimpie\" Goldberg as referred to in the book) being kidnapped at the same time as Megan (Maggie); Megan's (Maggie's) mother was the more famous of her parents, being a popular actress; when the children are kidnapped they are sprayed with chloroform spray.","Box office":"Box office receipts totaled US$105,178,561, of which $74,078,174 was from the United States having earned US$16,712,407 in its opening weekend at 2,530 theaters.[3]","produced_by":"David Brown|Joe Wizan|Morgan Freeman|Marty Hornstein|","starring":"Morgan Freeman|Monica Potter|Michael Wincott|","running_time":"103 minutes","music_by":"Jerry Goldsmith","External links":"","edited_by":"Neil Travis","budget":"$60 million[1]"}