{"country":"United States","distributed_by":"New Line Cinema1","Plot":"While growing up in Oklahoma, young Lane Frost (Cameron Finley) learns the tricks of the bull riding trade at the hand of his father, Clyde (James Rebhorn), an accomplished rodeo bronco rider himself. As he enters his teenage and early adult years, Lane (Luke Perry) travels the western rodeo circuit with his best friends Tuff Hedeman (Stephen Baldwin) and Cody Lambert (Red Mitchell). He meets and falls in love with a young barrel racer, Kellie Kyle, and they eventually marry in 1984.As Lane's legend and fame increase, so does the amount of pressure he puts on himself, to be what everyone wants him to be, and he wants to show that he is as good as they say he is. His ascent to the world championship is marred by a cheating incident, questions about Kellie's devotion, and a near broken neck. The film also follows him through the true life series between himself and Red Rock, a bull that no cowboy had ever been able to stay on for 8 seconds. It cuts the series down to three rides. In 1989, he is the second-to-last rider at the Cheyenne Frontier Days Rodeo. While riding on the bull known as \"Takin' Care Of Business\", he dismounts after his 8 second ride but the bull turns back and hits him in the side with his horn, breaking some ribs and severing a main artery. As a result of excessive internal bleeding, he dies on the arena floor before he can be transported to the hospital.The final scene shows Hedeman later that same year at the National Finals Rodeo riding for the world championship. After the 8 second bell sounds, he continues to ride and stays on an additional 8 seconds as a tribute to his fallen best friend.","language":"English","Reception":"The film gained a mixed reception.[2] It currently holds a 33% \"Rotten\" rating from critics.[3]","8_seconds":"Theatrical release poster","box_office":"$19,623,396[1]","cinematography":"Victor Hammer","production_company":"Jersey Films","directed_by":"John G. Avildsen","release_dates":"February 25, 1994 (1994-02-25)|||||","produced_by":"Clyde LeVin Danny DeVito Tony Mark Jeffery Swab","starring":"Luke Perry Stephen Baldwin","running_time":"105 minutes","music_by":"Bill Conti","edited_by":"J. Douglas Seelig","written_by":"Monte Merrick","budget":"$7 million"}