{"country":"Taiwan","Critical response":"In his in-depth analysis of Daughter of the Nile, Michael Joshua Rowin of Reverse Shot wrote that Daughter is one of Hou's most accessible films, and that although the film never found theatrical distribution in the United States and never received a home video release, its foreshadowing of the themes Hou would later use in Millennium Mambo, Hou's first film to be distributed in the United States, make Daughter ripe for rediscovery, summarizing \"Daughter's themes and immediate imagery would be the future of Hou.\".[3]","Background":"The film's title is a reference to a character in a manga called Crest of the Royal Family who is hailed as Daughter of the Nile.[4] The film is a study of the life of young people in contemporary Taipei urban life, focusing on the marginalised figure of a woman and centred on a fast-food server's hapless crush on a gigolo.[5] The introductory sequence of the film suggests a parallel between the difficulties faced by people in the film (Taiwan's urban youth, transitioning from a classical civilization into a changing world) and the mythic struggles of characters in the Egyptian Book of the Dead.It features Taiwan pop singer Lin Yang,[3] Jack Kao (Kao Jai) as her brother, and Tianlu Li in the role of the grandfather. Li became a central part of Hou's major films, and Kao starred in several of them.","Screenings and reception":"The film was originally released in October 1987 at the Turin International Film Festival of Young Cinema in Italy, where it won a Special Jury Prize in the International Feature Film Competition for Hou Hsiao-hsien. When it screened in January 1988 at the AFI Fest, the Washington Post wrote \"Hou Hsiao-hsien has the slickness that gives Daughter of the Nile the most East-West crossover appeal.[7] In September 1988 it screened at both the Toronto Film Festival and the New York Film Festival.[4] After the NYFF screening, Vincent Canby of the New York Times wrote the film \"...is not about alienation as much as it is an example of it. It is an artifact from a revolution taking place elsewhere\".[8] When it aired at the Chicago International Film Festival in October, 1988, Lloyd Sachs of the Chicago Sun-Times wrote \"slow and grudgingly revealing, Taiwanese director Hou Hsiao-hsien's \"Daughter of the Nile\" does not lend itself to easy description\".[9]In October 1999 the film was screened as part of a Hou Hsiao-hsien retrospective by New York's Anthology Film Archives.[3][10][11] In October 2000 it was screened in a Taiwanese film retrospective at both the National Gallery of Art and the Freer Gallery.[12]In April 2002 in screened at the Buenos Aires International Festival of Independent Cinema in Brazil, and in 2005 it screened at the Thessaloniki International Film Festival in Greece.In December 2006 it screened as part of a Hou Hsiao-hsien retrospective at the Canadian National Film Repository.[13]","language":"Mandarin","Synopsis":"Lin Hsiao-yang (Lin Yang), tries to keep her family together while working as a waitress at Kentucky Fried Chicken and going to night school. Her mother and older brother are dead. Her father (Fu Sheng Tsui) works out of town. It's up to Lin Hsiao-yang to take care of her pre-teen sister, who has already begun to steal, and a brother (Jack Kao) who is a burglar and gang member.[4]","cinematography":"Chen Huai-en","production_company":"Fu-Film","directed_by":"Hou Hsiao-hsien","Awards":"Daughter of the Nile won the special jury prize at the 1987 Turin International Festival of Young Cinema, and entered into the Directors' Fortnight at Cannes Film Festival.","release_dates":"October 1987 (1987-10)|||||","produced_by":"Lu Wen-jen","starring":"Jack Kao Tianlu Li Fu Sheng Tsui Fan Yang Lin Yang","running_time":"91 minutes","music_by":"Chang Hung-yi Cih-Yuan Ch'en","edited_by":"Ching-Song Liao","written_by":"Chu T'ien-wen"}