{"based_on":"An Education  by Lynn Barber","country":"United Kingdom|United States[1]|","distributed_by":"Sony Pictures Classics","screenplay_by":"Nick Hornby","Plot":"In 1961 London, Jenny Mellor is a 16-year-old schoolgirl preparing for Oxford University when she meets a charming older man driving a Bristol 405, David Goldman, who pursues her romantically. He takes her to concerts, clubs and fine restaurants, easily charming and manipulating her parents into approving of the relationship. Later, Jenny discovers that David is a con man who makes money through a variety of shady practices. She is initially shocked but silences her misgivings in the face of David's charm. Jenny's parents invite Graham, a boy Jenny knows from Youth Orchestra, to Jenny's birthday party but David arrives and Graham goes home. A few days later, David takes Jenny to Paris as a birthday gift, where she loses her virginity to him. When David proposes marriage, Jenny accepts and leaves school. However, she later discovers David is already married. When she reveals her discovery to David, he drops out of sight. Jenny despairs, feeling she has thrown her life away but, with the help of her favourite teacher, resumes her studies and is accepted at Oxford the following year.","language":"English","box_office":"$26,096,852[3]","cinematography":"John de Borman","production_company":"BBC Films Finola Dwyer Productions Wildgaze Films Endgame Entertainment","directed_by":"Lone Scherfig","an_education":"UK release poster","release_dates":"18 January 2009 (2009-01-18) (Sundance)|30 October 2009 (2009-10-30) (United Kingdom)|5 February 2010 (2010-02-05) (United States)|||","Production":"Nick Hornby created the screenplay based on an autobiographical essay by the British journalist Lynn Barber about her schoolgirl affair with conman Simon Prewalski, referred to by her as Simon Goldman, which was published in the literary magazine Granta.[11][12] Both the memoir and the film also allude briefly to Peter Rachman, the notorious post-war London property speculator, who Goldman is working for. Barber's full memoir, An Education, was not published in book form until June 2009, when filming had already been completed. Hornby said that what appealed to him in the memoir was that \"She's a suburban girl who's frightened that she's going to get cut out of everything good that happens in the city. That, to me, is a big story in popular culture. It's the story of pretty much every rock 'n' roll band.\"[13] Although the screenplay involved Hornby writing about a teenage girl, he did not feel it was more challenging than writing any other character: \"I think the moment you're writing about somebody who's not exactly you, then the challenge is all equal. I was glad that everyone around me on this movie was a woman so that they could watch me carefully. But I don't remember anyone saying to me, 'That isn't how women think.'\"[13]Although Jenny's family home and her school are supposed to be in the suburb of Twickenham, Middlesex (incorrectly referred to as 'Twickenham, London' - Twickenham did not become part of Greater London until 1965), the residential scenes featured in the film were shot on Carbery Avenue[14][15] in the Gunnersbury area of Ealing, west London as well as Mattock Lane in West Ealing and The Japanese School in Acton, which used to be the site of the girls' school called Haberdashers' Aske's School for Girls.[16]","produced_by":"Finola Dwyer|Amanda Posey|","starring":"Carey Mulligan|Peter Sarsgaard|Alfred Molina|Rosamund Pike|Dominic Cooper|Olivia Williams|Emma Thompson|","running_time":"95 minutes","music_by":"Paul Englishby","edited_by":"Barney Pilling","Release":"It has a 94% approval rating and an 7.9 average rating on Rotten Tomatoes based on 179 critics' reviews. The site's consensus reads: \"Though the latter part of the film may not appeal to all, An Education is a charming coming-of-age tale powered by the strength of former newcomer Carey Mulligan's standout performance.\"[17] The film has a Metacritic score of 85/100 based on 34 reviews, indicating \"universal acclaim\".[18]An Education grossed £1,633,504 in the UK.[19] and $US26,096,852 worldwide.[20]An Education won the Audience Choice award and the Cinematography award at the 2009 Sundance Film Festival.[9] Mulligan won a Hollywood Film Festival award for Best Hollywood Breakthrough Performance for a Female.[21] It was selected as Sight & Sound's film of the month.The film lost all its nominations including Academy Awards: Best Picture, Best Actress for Carey Mulligan and Best Adapted Screenplay.[22] The 63rd British Academy Film Awards saw the film come away with one award (for Best Actress) from nine nominations. The film received six British Independent Film Awards nominations and five Satellite Awards nominations.[23][24]An Education was released on DVD and Blu-ray on 30 March 2010.[25]","budget":"$7.5 million[2]"}