{"distributed_by":"Metro-Goldwyn-Mayer","Plot":"The film opens with the MGM logo, as usual, but with the voice of Rene Auberjonois saying, \"I forgot the opening line,\" replacing the lion roar[1] and proceeds with The Lecturer (Auberjonois) regaling his unseen students with a wealth of knowledge of the habits of birds. Owlish Brewster (Bud Cort), living hidden and alone under the Houston Astrodome, dreams of creating wings that will help him fly like a bird. His only assistance comes from Louise (Sally Kellerman), a beautiful woman who wants to help. Wearing only a trench coat, Louise has unexplained scars on her shoulder blades, suggestive of a fallen angel. She warns him against having sexual intercourse, as this could kill his instinct to fly.While Brewster works to complete his wings and condition himself for flight, Houston suffers a string of unexplained murders, the work of a serial killer whose victims are found strangled and covered in bird droppings. Haskell Weeks (William Windom) a prominent figure in Houston, pulls strings to have the Houston Police call \"San Francisco super cop\" Frank Shaft (Michael Murphy) to investigate. Shaft immediately fixates on the bird droppings and soon finds a link to Brewster. Brewster eludes the police with the apparent help of Louise but he eventually drives her away—and dooms himself—when he ignores her advice about sex by hooking up with Astrodome usher Suzanne (Shelley Duvall). Suzanne saves Brewster by out-driving Shaft in her Plymouth Road Runner. Severely injured after losing Brewster, Shaft kills himself. Despite her sweetness, Suzanne will not give up her comfortable home to fly with Brewster. Sensing something very wrong with Brewster, Suzanne betrays him to the police.In the climactic scene, a small army of policemen enter the Astrodome but fail to nab Brewster before he takes flight using his completed wings. Although Brewster escapes the police, he cannot escape the human being's inherent unsuitability for flight. Exhausted by the effort, he falls out of the air, crashing in a heap on the floor of the Astrodome. The film ends with a Circus entering the Astrodome, played by the cast of the film, costumed as clowns, strongmen and other circus performers. The Ringmaster (played by William Windom) announces the names of each cast member, finishing with Brewster, who remains crumpled on the floor.","language":"English","Cultural references":"The film features references to other films, including those of Fellini[2] and to Altman's own work. Altman pays homage to Bullitt (1968) through the character of San Francisco detective Frank Shaft.[2] Character Haskell Weeks' name resembles that of Haskell Wexler, a cinematographer Altman admired and considered working with on California Split.[3]Visual references to The Wizard of Oz (1939) are suggested in the film:[2] for example, Margaret Hamilton, who played the Wicked Witch of the West, appears wearing ruby slippers. Hope (Jennifer Salt), who supplies Brewster with health food, resembles Dorothy, with her distinctive gingham dress, pigtails and basket. At the end of the film, Hope is shown in the cast as Dorothy, carrying Toto.","cinematography":"Lamar Boren Jordan Cronenweth","directed_by":"Robert Altman","brewster_mccloud":"Theatrical release poster","release_dates":"December 5, 1970 (1970-12-05)|||||","Production":"This film marks the first feature produced by Altman's Lions' Gate Films. The film records landmarks and streetscapes that later were demolished or radically changed. The hotel Frank Shaft checks into was part of the Astrodome complex; it has gone through several changes.","produced_by":"Lou Adler","starring":"Bud Cort Sally Kellerman Michael Murphy","running_time":"105 minutes","music_by":"Gene Page","edited_by":"Lou Lombardo","written_by":"Doran William Cannon"}