{"country":"United Kingdom","distributed_by":"Cinerama Releasing Corporation","DVD release":"After years of releases using degraded 16mm (for TV) and old theatrical 35mm prints, the film finally received a deluxe DVD release in 2006 from Dark Sky Films. The DVD provides extensive special features including an audio commentary by director Roy Ward Baker and cameraman Neil Binney, plus \"Inside the Fear Factory\" (a featurette about Hammer rival Amicus Films), cast and crew bios, liner notes, trailers and a still photo gallery. The film was remastered from a pristine 35mm print.","Plot":"Dr Martin (Robert Powell) arrives at a secluded asylum \"for the incurably insane\" to be interviewed for a job by the wheelchair-bound, authoritarian Dr. Lionel Rutherford (Patrick Magee). Rutherford explains that he owes his current incapacitation to an attack by an inmate.Rutherford reveals his unorthodox plan to determine Martin's suitability for the post of chief doctor. One of the asylum's current inmates is Dr B. Starr, the former head of the asylum, who underwent a complete mental breakdown. Martin is to interview the inmates of the asylum to deduce which one is Dr Starr. If his choice is correct, Rutherford will \"consider\" him for the post.The attendant Max Reynolds (Geoffrey Bayldon) admits Martin through the security door to the inmates's solitary confinement cells, where he interviews each in turn.Bonnie (Barbara Parkins) recounts the plot to murder Ruth (Sylvia Syms), the wealthy wife of her lover Walter (Richard Todd). Ruth is a possessive heiress who studies voodoo. This results in horrific repercussions after Ruth's dead body has been dismembered and wrapped in individual parcels.Bruno (Barry Morse) recounts how poverty forced him to accept the unusual request of a Mr. Smith (Peter Cushing) to produce an elaborate suit of clothing from a mysterious, scintillating fabric that can animate anything, including the dead.After learning what the suit will be used for, Bruno fights Smith and accidentally kills him. He returns with the unsold suit. His wife Anna (Ann Firbank) dresses their store mannequin in the suit, and its true powers are revealed.This story was also earlier adapted as an episode of the Boris Karloff-hosted television series Thriller (\"The Weird Tailor\", Season 2, Episode 4).[4]The ebullient Barbara (Charlotte Rampling) informs Martin she has been in an asylum before. After her release from that facility, she was closely monitored at home by her brother George (James Villiers) and a nurse, Miss Higgins (Megs Jenkins). This frustrated existence is relived when her mischievous friend Lucy (Britt Ekland) comes to visit.Martin interviews Dr. Byron (Herbert Lom), who holds Rutherford in contempt. Byron explains he is working towards soul transference with a small automaton whose head is a likeness of his own, showing Martin several earlier models. Byron plans to \"will\" his mannequin to life. He explains the interior of the robot is organic, a miniaturised version of his own viscera. Martin concludes his interview, and Max shows him downstairs to deliver his judgment to Rutherford.Byron successfully brings his mannequin to life; it makes its way to Rutherford's office and kills him with a scalpel. Martin destroys the mannequin, which results in the death of Dr. Byron, and seeks help. Dr. Starr's true identity is revealed: it is \"Max Reynolds,\" who has murdered the real Reynolds two days before. He then strangles Martin to death.Sometime later, a new candidate for the job arrives and is met by Dr. Starr, who escorts him into the asylum.This story was later loosely adapted for the Monsters episode \"Mannikins of Horror\".","language":"English","Critical reception":"Allmovie's review of the film was favourable: \"Asylum is a textbook example of the skill that Amicus Productions showed for producing entertaining horror anthology films.\"[5]The film was one of Amicus' most popular movies at the UK box office. Despite this it was the last movie Robert Bloch wrote for the studio.[6]","asylum":"Theatrical poster to Asylum (1972)","cinematography":"Denys N. Coop","production_company":"Amicus Productions","directed_by":"Roy Ward Baker","Soundtrack":"Though Douglas Gamley is credited as having composed the music for this film, the majority of the score is drawn from public domain pieces by Modest Mussorgsky, in particular Night on Bald Mountain[7] (heard over the opening and closing credits). Selections from his Pictures at an Exhibition are also used: \"Gnomus\" is heard over both an early display of artworks depicting lunatics and past medical practices to deal with the insane, and during the sequence of Byron's mannequin coming to life and making its way downstairs. The booming crescendo of \"The Hut on Hen's Legs\" is heard over the sequence where the tailor's dummy is animated and rampages in Bruno's shop.","release_dates":"17 November 1972","produced_by":"Max Rosenberg Milton Subotsky","starring":"Peter Cushing Britt Ekland Robert Powell Herbert Lom Barry Morse Patrick Magee","running_time":"88 min","music_by":"Douglas Gamley","edited_by":"Peter Tanner","written_by":"Robert Bloch"}