{"a_better_life":"Theatrical release poster","country":"United States","distributed_by":"Summit Entertainment","screenplay_by":"Eric Eason","story_by":"Roger L. Simon","Background":"This film is uncommon among Hollywood productions in that it is set in a Hispanic community and features an almost entirely Hispanic cast.[2]Weitz uses A Better Life to explore the culture and geography of Los Angeles. Father Gregory Boyle of Homeboy Industries, run by former gang members, helped Weitz and his crew with finding locations and making their film as authentic as possible. The language of the script was modified to reflect the actual slang used in Los Angeles, even reflecting linguistic differences from street-to-street.[2]","Plot":"Carlos Galindo (Demián Bichir) works as a gardener with Blasco Martinez (Joaquín Cosio) in Los Angeles, California. Blasco wants to return to Mexico and continually tries to persuade Carlos to purchase his business from him, which includes the work truck and gardening tools. Carlos's son Luis (José Julián) is in high school and is dating Ruthie Valdez (Chelsea Rendon), the niece of a local gang leader. Luis regularly goes to her house after school where gang members congregate. Luis is embarrassed by his father and, although he does not wish to follow in his footsteps, has a hard time committing himself to his education. However, his relationship with Ruthie and his friendship with Facundo (Bobby Soto) pushes him toward becoming a gang member.Carlos asks his sister Anita (Dolores Heredia) for a loan to purchase Blasco's truck and tools. Anita lends Carlos $12,000, which comes out of her family's emergency fund. Carlos reluctantly accepts.Carlos returns to a corner where he used to look for work and hires Santiago (Carlos Linares). However, on the first day, Santiago steals the truck.The next morning, Carlos and Luis head out to find Santiago. A trip leads them to a South Central apartment complex. The apartment is used as lodgings for undocumented immigrant workers. One man, to whom Santiago sold Carlos’ cellphone, tells them that Santiago moonlights as a dishwasher at a nightclub. When they first go, the club is closed and they go to a nearby rodeo.At the rodeo, Carlos and Luis talk about Luis’s feelings toward his culture and his family. Luis is bitter about his mother abandoning them. He does not like Mexican music or certain Mexican traditions. When the nightclub opens, Carlos finds Santiago washing dishes. Santiago runs away, but Luis is waiting outside and tackles him and brutally beats him until Carlos pulls Luis away. They discover that Santiago has sold the truck and sent the money to his family back home to El Salvador. Luis runs away since he feels Carlos betrayed him for defending the man who stole their opportunity of improving their lives.The next morning Carlos goes looking for Luis and finds him at Facundo’s house. They argue, and Luis decides to stand by his father. They find the garage where Santiago sold the truck and steal it back. However, on their way home, they are pulled over by the police, and Carlos is arrested and incarcerated as an illegal immigrant. He is quickly processed, and Luis gets to the prison just before Carlos is about to board a deportation bus. The guards allow Luis and Carlos to see each other, and Carlos apologizes to Luis for not being there for him. Luis tells him he should not be sorry. Carlos makes Luis promise him that he will succeed in his studies and Luis makes Carlos promise him that he will return. They both agree and Luis and Anita watch Carlos board the deportation bus.The film closes with Luis at a soccer game with Anita and his two cousins watching him play. In the final scene, Carlos is about to go into the desert with other undocumented immigrants and a coyote who says: “Listos, para el otro lado” - “Ready for the other side?”, Carlos responds, “Vamos a casa\" - \"Let’s go home”","language":"English Spanish","box_office":"$1,759,252[1]","cinematography":"Javier Aguirresarobe","production_company":"Lime Orchard Productions","directed_by":"Chris Weitz","release_dates":"June 24, 2011 (2011-06-24)|||||","produced_by":"Paul Junger Witt Christian McLaughlin Chris Weitz Jami Gertz","starring":"Demian Bichir José Julián","running_time":"94 minutes","Telenovela version":"Telemundo is producing a telenovela based on the film called Bajo el mismo cielo, starring Gabriel Porras and María Elisa Camargo.[12][13] As of July 28, 2015, the telenovela will air in Telemundo weeknights at 9pm/8pm central.[14]","music_by":"Alexandre Desplat","edited_by":"Peter Lambert","Release":"A Better Life was released on June 24, 2011, by Summit Entertainment.Critical response to A Better Life has been positive. The film has garnered an 86% \"fresh\" rating from Rotten Tomatoes.[3] The critical aggregator Metacritic awarded the film a score of 64 out of 100, signifying \"generally positive reviews\".[4] Demián Bichir was nominated for an Academy Award as lead actor on Jan. 24, 2012. Manola Dargis, film critic for The New York Times, called the film \"Touching and startling.\"[5] Peter Travers of Rolling Stone called the film \"a haunting movie that gets under your skin.\"[6] Writing for Entertainment Weekly, Dave Karger called A Better Life an \"unfussy, yet quite powerful drama with a terrific central performance by Demián Bichir.\" Karger called the film an \"awards contender\" and wrote, \"With the right reviews and commercial reception, it could go even further.\"[7]Roger Ebert, of the Chicago Sun-Times, wrote that \"the performances are pitch perfect\" and he gave the film 3.5 stars out of 4.[8] The New Yorker critic Richard Brody wrote: \"The story unfolds without hagiography, pity, or trumped-up heroism, as the filmmaker approaches the lives of everyday people with modest compassion and imaginative sympathy.[9] Amy Biancolli, writing in the Houston Chronicle, said \"It's straight, true and heartbreaking, a masterstroke of raw emotional minimalism\".[10]","budget":"$10 million[1]"}