{"country":"UK","distributed_by":"Renown Pictures (UK) Victoria Films (USA)","Plot":"Paul Linden (David Farrar), a wealthy and prominent architect, returns home to London bringing his new wife, beautiful 24-year-old Nichole (Noelle Adam), whom he has just married in Paris. Paul is anxious to introduce Nichole to his teenage daughter Jennifer (Gillian Hills), but Jennifer appears less than happy about her father's remarriage and coldly rejects Nichole's friendly overtures all evening. After Paul and Nichole go to bed, Jennifer sneaks out to the local beatnik club for an evening of rock music and dancing with her friends, including Dave (Adam Faith), a youth from a working-class background who plays guitar and writes songs; Tony (Peter McEnery) , a general's son whose mother was killed in the Blitz and who has a drinking problem, although beatniks frown on alcohol; and Dodo (Shirley Anne Field), Tony's well-bred girlfriend. Dave and Jennifer are attracted to each other.The next day Nichole plans to meet Jennifer at her art college so they can have lunch together. At lunchtime, Nichole arrives at Jennifer's school but is told that Jennifer has left and gone to the beatnik coffee club in Soho. Nichole goes to the club and confronts Jennifer in front of her friends, who are impressed by Nichole's youth, good looks, and knowledge of modern jazz. The fact that her friends, especially Dave, seem to like Nichole upsets Jennifer. Nichole leaves, reminding Jennifer to be home for her father's important business dinner that night. As Nichole leaves, she passes Greta (Delphi Lawrence), the star performer at the strip club across the street. Greta recognizes Nichole and greets her by name, but Nichole ignores her, to Greta's annoyance. Jennifer and her friends see this encounter and wonder how Greta and Nichole might know each other. Jennifer suspects that Nichole was also a stripper before meeting her father.That night at Paul's business dinner, Jennifer tries to embarrass Nichole in front of the guests by bringing up the encounter with Greta, making sure to emphasize that Greta is a stripper. After the guests leave, Paul questions Nichole, who says that she knew Greta in Paris and that they were in ballet together but Greta pursued a different way of life and Nichole lost track of her. Paul accepts her explanation, but Jennifer goes to the strip club to ask Greta directly. Greta at first claims she made a mistake and doesn't really know Nichole, but under pressure from her boyfriend, strip club manager Kenny King (Christopher Lee), she reveals that she and Nichole worked together as strippers and occasional prostitutes in Paris. Jennifer, encouraged by Kenny, becomes enamored with the idea of becoming a stripper herself. Jennifer is caught by Paul and Nichole coming home from the strip club at 3 am and an angry confrontation results. Jennifer taunts Nichole by telling her she has spoken with Greta and threatens that if Nichole doesn't stay out of her life, Jennifer will tell her father what she knows about herNichole visits the strip club to tell Kenny and Greta to stay away from her stepdaughter, but Kenny says that Jennifer will be welcome at the club any time and that if Nichole interferes he will tell Paul about her past.Jennifer and her friends have a wild night including dancing at a candlelit cavern, a dangerous auto race, and a game of \"chicken\" on railroad tracks where the last person to leave the rails before the train arrives (Jennifer) wins. Throughout the evening, Jennifer and Dave dare each other to increasingly dangerous behaviors as a way of flirting. Jennifer invites everyone to continue the party at her house, as her father is out of town and Nichole presumably won't interfere for fear Jennifer will reveal her past. Jennifer accepts a dare to \"strip like a Frenchie\" and begins a strip tease to music, but when she gets down to her underwear Nichole bursts from her bedroom and stops her. Then Paul suddenly arrives home and breaks up the party, throwing all of the beatniks out of his house including Dave. Jennifer angrily tells her father about Nichole's activities in Paris. Nichole, crying, admits it is true and explains she only did it because she was broke and hungry. Paul and Nichole profess their love for each other and reconcile.Jennifer goes to the beat club, but now finds it boring. She walks out on her friends and meets Kenny across the street at the strip club. Kenny invites her to go to Paris with him and have him train her to be a star stripper. Greta, performing onstage, is told by stage manager Simon (Nigel Green) that Kenny plans to leave her and go off with Jennifer. Just as Kenny makes a pass at Jennifer, a woman's hand is shown stabbing Kenny to death with a letter opener. The club staff, thinking Jennifer killed Kenny, lock her up and call the police. Jennifer screams that she didn't do it, and the real culprit, jealous Greta, emerges from behind a curtain. Meanwhile, Dave, Tony and Dodo confront some Teddy Boys who vandalize Dave's jalopy and smash his guitar. Paul and Nichole arrive on the scene searching for Jennifer just as the police drag her, in hysterics, out of the strip club. The police release Jennifer to Paul and Nichole and the family, arms around each other, heads for home, as Dave throws his broken guitar in a trash bin and proclaims, \"Funny, only squares know where to go.\"","language":"English","cinematography":"Walter Lassally","directed_by":"Edmond T. Gréville","Production notes":"The original script, entitled \"Striptease Girl,\" was submitted to the British Board of Film Censors in March 1959, whose reviewer termed it \"machine-made dirt\" and \"the worst script I have read for some years.\" The project was then renamed \"Beat Girl\" and nudity was reduced; however, censors still objected to scenes of strip tease, juvenile delinquency, and teenagers playing \"chicken\" by lying on railroad tracks before an oncoming train. Ultimately, the film received an \"X\" certificate, causing its release to be delayed as its release was queued behind a glut of other X-rated films.[6][12] When finally released it performed reasonably well at the box office in UK, despite receiving bad reviews.[11]The movie was filmed at MGM-British Studios at Borehamwood, Hertfordshire, UK, with exteriors filmed in Soho and Chislehurst Caves (then located in Kent).[6]After Adam Faith was cast, John Barry was asked to compose the film soundtrack as he had already been collaborating with Faith as an arranger.[13] Barry was subsequently hired to score Faith's next films Never Let Go and Mix Me a Person, leading to Barry's successful career as a composer and arranger of film music. In addition to the Beat Girl soundtrack LP reaching number 11 in the album charts, the song \"Made You,\" composed by John Barry and Trevor Peacock and performed in the film by Faith, achieved minor hit status before being banned by the BBC for suggestive lyrics.[14]Pascaline, the Haitian exotic dancer who appears in a sequence performing with a scarf, had performed in real life as an exotic dancer at the Crazy Horse Saloon in Paris.[15]Some versions of the released film have cut the original striptease sequences (which included topless nudity), some exposition scenes set in the strip club, the \"chicken\" game scene, and/or some opening exposition scenes with David Farrar and Noëlle Adam on a train and then with Gillian Hills at the \"Linden\" home.","release_dates":"1960","produced_by":"George Willoughby","starring":"David Farrar Noëlle Adam Christopher Lee Gillian Hills Adam Faith","running_time":"85 min.","music_by":"John Barry Trevor Peacock (lyrics)","edited_by":"Gordon Pilkington","written_by":"Dail Ambler"}