{"based_on":"Ferenc Molnár's Liliom","country":"United States","distributed_by":"20th Century Fox","Original casting of Frank Sinatra":"Frank Sinatra was originally cast to play Billy Bigelow. He even pre-recorded the songs he was to sing in the film. Prior to filming, the cast knew they had to film some scenes twice, one for regular Cinemascope and the other for CinemaScope 55. According to one account, when Sinatra arrived on the set, he claimed that he was being paid to film one movie, not two, and he walked away from the set and said: \"You’re not getting two Sinatras for the price of one\". However, according to Shirley Jones' 2014 autobiography, the real reason he walked away from the film was that the love of his life, Ava Gardner, told him that if he didn't accompany her on her film set immediately, she would start an affair with her costar.[3] Gardner was in the late stages of filming The Barefoot Contessa at the time. Whichever is the truth, after Sinatra left the production, the filmmakers found a way to film the scene once on 55mm, then transfer it onto 35mm; thus, the film did not have to be shot twice. But on February 14, 1958, Shirley Jones guested on the Frank Sinatra Show and was able to perform \"If I Loved You\" with him. This performance gives a taste of what could have been if Sinatra had not quit the film, and can be seen on the DVD Sinatra – The Classic Duets. The songs that Sinatra recorded for the original soundtrack were never released to the general public due to contractual issues. \"Soliloquy\", the song that the character Billy Bigelow sings when he learns that his wife is expecting a child, was one of Sinatra's favorites. He recorded it in the 1940s for Columbia, tried it at Capitol in the 1950s, and recorded it again in the 1960s for Reprise.","Deleted and cut songs":"Two songs recorded for the film, \"You're a Queer One, Julie Jordan\" (sung by Barbara Ruick and Shirley Jones) and \"Blow High, Blow Low\" (sung by Cameron Mitchell and a male chorus) were eventually left out of the movie because the producers wanted to keep the length at 128 minutes. They have, however, been included in all editions of the soundtrack album. \"The Highest Judge of All\", a song which precedes Billy's meeting with the Starkeeper in the show, in which he asks to meet God, was eliminated from the film score and does not appear on the soundtrack album, presumably because the flashback scenes precluded it. Mr. Snow's sentimental song, \"Geraniums in the Winder\", which serves as an introduction to \"Stonecutters Cut It on Stone\", was also eliminated, as was a reprise of \"Mister Snow\". As with \"The Highest Judge\", neither \"Geraniums\" nor the reprise of \"Mister Snow\" were ever recorded for the film, and have not appeared on any editions of the film's soundtrack. One verse of \"Stonecutters Cut It on Stone\" (which appears on the album) was omitted from the film, perhaps because it contains a veiled reference to sex and the movie censors of the day might have objected.The soundtrack album also featured (as noted above) the complete version of \"Carousel Waltz\" which is first heard at the beginning of the original show and early in the film. Because of its nearly eight-minute length, only an abridged version of the waltz was actually heard in the movie, and many stage productions of Carousel tend to shorten the piece as well, because of time considerations. In addition, the soundtrack album version of the song \"When the Children Are Asleep\" includes the long introductory section to the song sung by Mr. Snow as it is in the show; the film does not use this. The soundtrack album also includes a section of \"If I Loved You\" not in the film. The lyric of this section, which is supposed to be sung by Billy Bigelow, is as follows:This section leads to Billy reprising the refrain of the song. In the film, the refrain is still there, but the lines quoted above are omitted. Billy simply says \"I wonder what it'd be like\", upon which Julie responds knowingly, \"If you loved me? But you don't\". Billy, in turn, answers, \"No I don't\", and goes on to sing the refrain of the song beginning with the lines","language":"English","carousel":"Theatrical film release poster","box_office":"$3.75 million (US rentals)[2]","cinematography":"Charles G. Clarke","First telecast":"The film was first telecast on The ABC Sunday Night Movie, on the evening of March 13, 1966, pan and scanned in a slightly edited version which ran between 9:00 and 11:30 P.M, E.S.T. It was repeated only three months later, on the evening of June 26, 1966. After these two network telecasts, the film was sold to local stations.[12] It now occasionally turns up on cable and was finally shown on Turner Classic Movies for the first time on April 18, 2013, in letterbox format[13] and anamorphically enhanced in its proper aspect ratio for hi-def television sets.","directed_by":"Henry King","Film size":"The film was made in CinemaScope 55, and in color by DeLuxe. It was, however, ultimately shown in regular 35 mm CinemaScope rather than the 55 mm version of the process, although the original premiere did feature a 6-track magnetic stereo soundtrack specially devised for CinemaScope 55. It was played on a separate machine synchronized with the picture. All of the other prints of the film were composite prints, and used the standard 4-track stereo soundtrack featured on regular CinemaScope films circa 1953–1957.","release_dates":"February 16, 1956","running_time":"128 minutes","budget":"$3,380,000[1]","Plot":"The story revolves around Billy Bigelow, a rough-talking, macho, handsome carousel barker, and Julie Jordan, a young, innocent mill worker, both living their busy lives in the small town of Boothbay Harbor, Maine. They fall in love, but both are fired from their jobs for different reasons – Billy because he paid too much attention to Julie and incurred the wrath of the jealous carousel owner Mrs. Mullin, and Julie because she stayed out past the curfew imposed by the understanding but stern mill owner, Mr. Bascombe. Billy and Julie marry and go to live at the seaside spa of her cousin Nettie, but Billy becomes bitter because he is unable to find work, and in his frustration, strikes Julie (this moment is not shown at all in the film). Mrs. Mullin, the jealous carousel owner who is infatuated with him, hears of this and goes to Nettie's to offer Billy his old job back, but will not re-hire him unless he leaves his wife. Billy seems to be considering the idea when Julie asks to talk privately. Julie, fearing he will be enraged, timidly tells him she is pregnant. But Billy is overjoyed and now firmly refuses Mrs. Mullin's offer. However, newly worried about not having enough money to provide for his child, and unskilled at anything except being a carousel barker, Billy secretly agrees to join his pal Jigger Craigin in robbing the wealthy Bascombe.During a clambake, held on a nearby island, Billy and Jigger sneak to the mainland to commit the robbery, but Bascombe, who is usually unarmed, carries a gun and the robbery is foiled. While Bascombe is momentarily distracted, Jigger flees and leaves Billy at the mercy of the police. Cornered, but trying to escape, Billy climbs atop a pile of crates, whereupon the pile collapses and Billy accidentally falls on his own knife. The others return from the clambake, and Julie sees the mortally wounded Billy. She rushes over to him and he dies after saying his last words to her. Julie is devastated because she truly loved him, even though she never had the courage to say it out loud.Fifteen years later, in the other world (apparently the back door of Heaven), Billy is told that he can return to Earth for one day to make amends. Billy returns to find his daughter Louise emotionally scarred because she is constantly taunted over the fact that her father tried to commit a robbery. Billy, not telling her who he is, makes himself visible, tries to cheer her up, and gives her a star that he stole from Heaven. Louise refuses it, frightened, and Billy, in desperation, slaps her hand. She rushes inside the house and informs Julie of what happened, saying that she did not feel a slap, but a kiss. Billy tries to make himself invisible before Julie can see him, but she has glimpsed him for just a split second, and senses that he has come back for a reason. Billy asks his Heavenly Guide for permission to go to Louise's high school graduation, and there he silently gives both her and Julie the confidence they need and the knowledge that, in spite of everything, he loved Julie.","Reception":"The world premiere of the film, held in New York, was attended by Washington diplomats as well as film stars. Among those in the audience were Averell Harriman and Edmund Muskie. Muskie was at that time the governor of Maine, where the story is set and where a large part of the movie was filmed. Locations for the film include:The film received mostly good reviews, but sources differ as to its financial success. Musical theatre scholar Thomas Hischak stated that the film \"was a box office success across the country and 20th Century-Fox earned a considerable profit on the picture\".[6][7] However, the review at allmovie.com states: \"The film's often downbeat tone ... did not resonate with 1950s audiences, making Carousel a surprising box-office flop. Some reviewers were also critical of the acceptance of wife beating in the film.\"[8] Another analysis states that \"The American release of Carousel actually lost money for Twentieth Century Fox, but Kine Weekly claimed that it was generally successful at the British box office.\"[9]The soundtrack album sold well, and the film's exposure on television, VHS and DVD has won a larger audience for it. It was one of only three Rodgers and Hammerstein films (out of nine) that were not nominated for any Academy Awards. (The 1962 State Fair, an unsuccessful remake of R&H's hit musical written especially for film, and an unsuccessful animated remake of The King and I (1999) received no nominations either. Unlike Carousel, however, they were almost universally reviled by critics.) However, some of the technical staff of Carousel also worked on the first film version of The King and I, also released in 1956, and they did receive Academy Awards for that film, so they did not go home empty-handed on Oscar Night 1957.Carousel was named #41 on Channel 4's (London) list of 100 Greatest Musicals.[10]","Remake":"Another Carousel film, produced by Hugh Jackman, who would star as Billy Bigelow, has been in pre-production for several years. Like the original, this remake would be distributed by 20th Century Fox. As of May 2009, the script was reportedly finished.[14][15] Jackman mentioned that he would like to see Anne Hathaway considered for Julie Jordan. No news has been announced about the proposed film since mid-2009.[citation needed] IMDB projected this film's release for 2013, but the spare nature of the page provided little in the way of proof.[16]","Differences from musical":"The film followed the stage musical faithfully, except for five major changes:A smaller, less important change was the switching of the song \"When The Children Are Asleep\" to a later moment in order to take full advantage of the Maine locale. In the film, it is sung in a new scene by Carrie and Mr. Snow in their boat as the couple, together with Julie and Billy, sail to the island for the clambake. (This would logically place the song between Acts I and II of the stage version.) In the stage version, the song is unheard by any of the other characters, but the film places it so that Julie and Billy are there to listen to the song, and to lend a sharp contrast to the happiness that Mr. Snow feels in comparison to Billy's obvious uneasiness about the robbery that he and Jigger are soon to commit.Other minor changes include a scene bridging the duet between Julie and Billy singing \"If I Loved You\" and the ensemble number \"June is Bustin' Out All Over\", in which Cousin Nettie is first introduced arguing with a local fisherman who is gossiping about where Julie has disappeared to with Billy after losing their jobs. Immediately afterwards, Julie appears with a sullen Billy whom she introduces to Nettie as her new husband, and Nettie welcoming him into the family despite her obvious reservations. Followed by a dialogue in Heaven between Billy and the Starkeeper, during which Billy admits he didn't so much mind sponging off of Nettie as he did mind having nothing to do.Another minor change, albeit an interesting one, was an additional bit of dialogue concerning the fate of Jigger, which was not revealed in the original musical. The Starkeeper informs Billy that Jigger has died, and although he refuses to say anything further than that, it is implied that Jigger's soul ended up in Hell.","Soundtrack album":"The soundtrack album was first issued on LP in 1956 by Capitol Records, but only in mono. However, because the film's soundtrack had been recorded in then state-of-the-art stereo, as all Cinemascope films were back then, it was possible for Capitol to release a stereo LP of the album in 1958, after stereo records became a reality. The later release was shortened by about 5 minutes, by abridging the opening instrumental \"Carousel Waltz\" due to technical limitations imposed by the then-new format. The mono release, as originally issued, played for about fifty minutes, while the stereo one played for forty-five.A large team of orchestrators lent their expertise to the complex musical arrangements recorded for the soundtrack: Nelson Riddle, Herbert W. Spencer, Earle Hagen, Edward B. Powell (responsible for \"If I Loved You\"), Bernard Mayer and Gus Levene.Three editions of the soundtrack album were issued on compact disc, all in stereo. The first, issued in 1986 by Capitol, was an exact duplicate of the 1958 stereo LP. The rights then were obtained by Angel Records, which issued a second edition of the album, this time featuring the complete \"Carousel Waltz\" in stereo for the first time, along with all of the other songs included on the previous CD and LP incarnations. This album was superseded in 2001 by Angel's \"expanded edition\" of the soundtrack, which, for the first time, featured practically all of the songs and music recorded for the film, including the dance music, resulting in a playing time of 70 minutes, as opposed to the original 45 minute stereo LP and CD.Under the vocal direction of Ken Darby, the songs and performers on the expanded edition of the album are:","produced_by":"Henry Ephron","starring":"Gordon MacRae Shirley Jones Cameron Mitchell Barbara Ruick Claramae Turner Robert Rounseville Gene Lockhart Susan Luckey John Dehner Jacques d'Amboise William LeMassena","music_by":"Richard Rodgers","edited_by":"William H. Reynolds","written_by":"Ferenc Molnár (play Liliom) Oscar Hammerstein II (musical book) Phoebe Ephron (screenplay) Henry Ephron (screenplay)"}