{"based_on":"Doctor in the House  by Richard Gordon","country":"United Kingdom","distributed_by":"GFD","Plot summary":"The story follows the fortunes of Simon Sparrow (Dirk Bogarde), starting as a new medical student at the fictional St Swithin's Hospital in London. His five years of student life, involving drinking, dating women, and falling foul of the rigid hospital authorities, provide many humorous incidents.When he has to leave his first choice of lodgings to get away from his landlady's amorous daughter (Shirley Eaton), he ends up with three amiable but less-than-shining fellow students as flatmates:Towering over them all is the short-tempered, demanding chief surgeon, Sir Lancelot Spratt (played by James Robertson Justice in a manner quite unlike Gordon's original literary character), who strikes terror into everyone.Simon's friends cajole him into a series of disastrous dates, first with a placidly uninterested \"Rigor Mortis\" (Joan Sims), then with Isobel (Kay Kendall), a woman with very expensive tastes, and finally with Joy (Muriel Pavlow), a nurse at St Swithin's. After a rocky start, he finds he likes Joy a great deal. Meanwhile, Richard is given an ultimatum by his fiancée Stella (Suzanne Cloutier) – graduate or she will leave him. He buckles down.The climax of the film is a rugby match with a rival medical school during Simon's fifth and final year. After St Swithin's wins, the other side tries to steal the school mascot, a stuffed gorilla, resulting in a riot and car chase through the streets of London. Simon and his friends are almost expelled for their part in this by the humourless Dean of St Swithin's (Geoffrey Keen). When Simon helps Joy sneak into the nurses' residence after curfew, he accidentally falls through a skylight. This second incident gets him expelled, even though he is a short time away from completing his finals. Sir Lancelot, however, has fond memories of his own student days, particularly of the Dean's own youthful indiscretion (persuading a nurse to reenact Lady Godiva's ride). His discreet blackmail gets Simon reinstated. In the end, Richard fails (as does Tony), but Stella decides to enroll at St Swithin's herself so there will be at least one doctor in the family. Simon and Taffy graduate.","screenplay_by":"Richard Gordon|Nicholas Phipps|Ronald Wilkinson|","doctor_in_the_house":"British original cinema poster","language":"English","Reception":"The film was a massive success at the box office. Betty Box estimated it recouped its budget in the first six weeks of release.[2] Thomas says it paid for itself in two weeks and claims it was the first \"purely British picture without any foreign involvement to make a million pounds' profit within two years.\"[10]It became the most successful film in Rank's history and had admissions of 15,500,000 - one third of the British population.[11]Thomas put its success down to the fact that \"it was about something which, until that time, had been treated with about as much reverence as you would treat your confessor. People used to hold medicine in great awe... In our film, people liked and identified with the funny situations they had seen appen or which had happened to themselves as patients, doctors or nurses.\"[12]","cinematography":"Ernest Steward","production_company":"Rank Organisation","directed_by":"Ralph Thomas","release_dates":"23 March 1954 (1954-03-23) (UK)|2 February 1955 (1955-02-02) (US)||||","Production":"Producer Betty Box picked up a copy of the book at Crewe during a long rail journey and saw its possibility as a film. The film rights had been optioned to ABPC but they decided not to make the movie, and Box bought the rights. She and Ralph Thomas had a job convincing the Rank Organisation to make the movie because of the lack of a central story. But Box said \"I think I know how to do it. I take my four students through three or four years of medical training and make that the story.\"[2]She later said she was \"very lucky\" to get Nicholas Phipps to write the script. \"There wasn't a great deal of the book in it, except for the characters,\" she said.[2]\"I'd never made comedies before but I reckoned I wanted to make it both real and funny and so I wouldn't deal with comedians.\"[4]Rank executives thought that people would not be interested in a film about medicine, and that Bogarde, who up to then had played spivs and Second World War heroes, lacked sex appeal and could not play light comedy. As a result, the filmmakers got a low budget and were only allowed to use available Rank contract artists.[5]\"They didn't really have any funny actors to work with; they were all straight actors. Dirk Bogarde... had never played a funny line in his life,\" said Thomas.[6]\"Not one of them every did anything because they wanted to make it funny,\" Thomas added. \"They played it within a very strict, tight limit of believability. Dirk was able to do that, he got away with it and it stopped him from being just another bright, good looking leading man and made him a star.\"[7]St Swithin's Hospital is represented by the front of University College London, and is thought to be based upon Barts and The London School of Medicine and Dentistry, the medical school attached to St Bartholomew's Hospital, where Richard Gordon was a student.Kenneth More had just made Genevieve (1953) when he signed to appear in the cast, but Genevieve had not been released yet. Accordingly, his fee was only £3,500.[8] Robert Morley was approached to play the surgeon but his agent insisted on a fee of £15,000 so they cast James Robertson Justice instead at a fee of £1,500.[2]Filming started in September 1953.[9]","produced_by":"Betty E. Box","starring":"Dirk Bogarde|Muriel Pavlow|Kenneth More|Donald Sinden|Kay Kendall|James Robertson Justice|Donald Houston|","running_time":"87 minutes","Sequels":"Doctor in the House was the most popular film at the British box office in 1954.[13] Its success resulted in six sequels, three starring Bogarde, one with Michael Craig and Leslie Phillips, and the other two with Phillips, as well as a successful television series from London Weekend Television.","music_by":"Bruce Montgomery","edited_by":"Gerald Thomas","budget":"£120,000[1] or £97,000[2] pr £109,000[3]"}