{"based_on":"Characters  by Don Mancini David Kirschner (Chucky doll)","country":"United States","distributed_by":"Universal Pictures","Novelization":"A tie-in novelization to the film was later written by Matthew J. Costello. The author added in some of his own plot scenes exclusive to the novel, such as going deeper into Andy Barclay and Chucky`s past. Chucky is characterized to have an absent father and his abusive mother being a dwarf. Chucky got teased a lot because of this and later strangled his mother to death. Also, Chucky was put in special classes when he was younger. Another difference is that in the film, Andy Barclay is eight years old and is in second grade. In the novel, he is a seven-year-old and is in first grade meaning the novel takes place in 1989, one year after the first film whereas the film version takes place in 1990, two years after.","Plot":"In 1990, two years after Chucky was destroyed by the Barclays and detective Mike Norris, the killer \"Good Guys\" doll Chucky (voiced by Brad Dourif) is rebuilt from scratch by the Play Pals doll company to prove there is no fault with the dolls. As a result of Andy Barclay (Alex Vincent) blaming Chucky for the murders committed, the company has suffered. One of the men working on Chucky is killed via electrocution, resulting the CEO of the company Mr. Sullivan (Peter Haskell) orders his assistant Mattson (Greg Germann) to cover the accident and get rid of Chucky.Meanwhile, Andy is now in foster care, due to his mother being in a mental hospital for supporting his story about Chucky until she is able to care for him again. Andy is adopted by Phil (Gerrit Graham) and Joanne Simpson (Jenny Agutter). In his new home, Andy meets his new foster sister Kyle (Christine Elise).After work Mattson stops at a corner store and while he is out of his car, Chucky phones Grace Poole (Grace Zabriskie), the manager of Andy's foster center. He claims to be a relative of Andy's in order to get his new address. He then carjacks the car and orders Mattson to drive outside the Simpson household at gun point. Chucky then kills him by suffocating him with a plastic bag. In the house, Chucky accidentally activates \"Tommy\", another \"Good-Guy\" doll (who Andy mistook for Chucky), and destroys him with Joanne's ornament. Chucky then buries the toy in the garden and takes his place as \"Tommy\". Phil punishes the children thinking one of them broke the ornament. After Andy spends the rest of the day with Kyle, Chucky waits for nightfall and ties up Andy and almost possesses him. However, Kyle, who snuck out, arrives. After Andy claimed Chucky tied him up, Phil throws Chucky in the basement.The next day, Chucky hitches a ride on the bus to Andy's new school. Andy's teacher Miss Kettlewell (Beth Grant) discovers obscenity written on his worksheet, forces Andy to stay in the classroom as punishment, and locks Chucky in the closet. Andy escapes, and the doll beats Miss Kettlewell to death with a yard stick . After Andy insisted Chucky got him in trouble, Phil considers taking him back to the foster center.That night, Andy tries to kill Chucky with an electric knife in the basement, but Chucky attacks him. Phil is killed by Chucky by being tripped and thrown to the floor, snapping his neck. Joanne, convinced that Andy killed him, sends him back to the foster center. Later, Kyle discovers \"Tommy\" in the garden and realizes Andy was telling the truth, and begins to search for Chucky inside the house. After finding Joanne's dead body, Chucky attacks her and orders her to take him to the center. There, during a false fire alarm, he kills Grace by stabbing her in the heart, and orders Andy, who is being held at knifepoint by the doll, to take him to the PlayPals \"Good-Guy\" factory for the transfer.Kyle follows the duo to the factory. After knocking Andy unconscious once again, Chucky fails to possess the boy, since he spent too much time within the doll's body. Enraged, Chucky decides to kill Andy and Kyle instead. Chucky murders a security guard. He then loses one of his hands, which he replaces with his knife, and his legs, but still goes after the two. Kyle and Andy then pour molten wax over him before putting an air hose in his mouth, which causes his head to explode and finally defeating him. The pair leaves the factory for \"home\", with Andy asking where \"home\" is and Kyle responding that, in truth, she doesn't know.","language":"English","Reception":"Its opening weekend earned an estimated $10,718,520 on 1,996 screens in the US. The film grossed an estimated $28,501,605 in the US and was #1 at the box office.[4] It grossed an additional $7.2 million internationally.Rotten Tomatoes gives the film an approval rating of 40% based on 15 reviews.[5] Evan Dickson of Bloody Disgusting, in describing how it surpasses the origin film, wrote, \"Child’s Play 2 manages to strip away all artifice and still manage to be an effective slasher.\"[6] Variety wrote, \"Child's Play 2 is another case of rehashing the few novel elements of an original to the point of utter numbness.\"[7]Child's Play 2 was first released on VHS in North America on April 11, 1991.[8] The film was later released on DVD in 1999. Child's Play 2 was also re-released in The Chucky Collection (which also featured Child's Play 3 and Bride of Chucky) in 2003.[9] On September 19, 2006 it was released as part of Chucky - The Killer DVD Collection (alongside Child's Play 3, Bride of Chucky, and Seed of Chucky).[10] On October 8, 2013, Child's Play 2 was re-released on DVD and Blu-ray as part of Chucky: The Complete Collection (alongside the original Child's Play, Child's Play 3, Bride of Chucky, Seed of Chucky, and Curse of Chucky).[11]","box_office":"$32.7–$35.7 million[1][2]","cinematography":"Stefan Czapsky","directed_by":"John Lafia","child's_play_2":"Theatrical poster","release_dates":"November 9, 1990 (1990-11-09)|||||","Production":"United Artists released the original Child's Play in 1988 and greenlit the second film. The sequel was in pre-production when an UA executive told producer David Kirschner that the film was put on hold as the studio was about to be acquired by the Australian group Qintex, who decided that in their best interest was not to make horror films. After offers with Paramount Pictures, Warner Bros., Columbia Pictures, 20th Century Fox, the Price Company, Carolco, New Line Cinema, and Disney to buy the film were rejected, Kirschner produced it independently with Universal Pictures distributing.[3]","produced_by":"David Kirschner","starring":"Alex Vincent|Jenny Agutter|Gerrit Graham|Christine Elise|Grace Zabriskie|","running_time":"84 minutes","Sequel":"The film was followed by a sequel in 1991, Child's Play 3.","music_by":"Graeme Revell","edited_by":"Edward Warschilka","written_by":"Don Mancini","budget":"$13 million[1]"}