{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Larry Kozinski (Danson) and Maria Hardy (Rossellini) meet at the marriage of Larry's uncle Phil and Maria's mother Edie (Aleandro). Newly made cousins-by-marriage, they find they have more in common than expected as their respective spouses, insecure Tish (Young) and boorish Tom (Petersen) begin an affair. Over a series of ritualized family events, dreamer Larry and repressed Maria decide to exact revenge on their spouses by pretending to have an affair themselves. Their good-natured plan takes on unexpected gravity when they learn not only are they great friends, but they realize they're falling in love with each other.They consummate the affair, but the ramifications shake their families, including Larry's artistic son Mitch (Coogan) and Maria's adorable but aggressive daughter Chloe (Isabelle). They end the affair to bring stability back into their families' lives. Meanwhile, (after the sudden death of Uncle Phil), Larry's father Vince (Bridges) becomes interested in his widowed sister-in-law Edie and courts her.Larry and Maria meet again some time later at Vince and Edie's wedding. Encouraged by Tish (who had split from Larry earlier in the film), he asks Maria to \"dance with him\", angering Tom but convincing Maria to break free from her unhappy marriage. In an epilogue, Larry and Maria are seen sailing away with their children, living a fantasy they had shared from their earlier affair.","language":"English","Reception":"The film has received mixed reviews. Review aggregator Rotten Tomatoes reports that 50% of 8 film critics have given the film a positive review, with a rating average of 5.8 out of 10.[2] At the initial release, the film received two thumbs up from Siskel & Ebert. The film grossed a total of US$22 million, with an opening weekend of $3.5 million.[3]Individual praise went to Rossellini, whose performance of Maria has a winning simple sweetness. Danson crafts a likeable character who has nice chemistry with Rossellini. Supporting performances by William Peterson and Lloyd Bridges are also standouts.[4] Other comments called the film \"underrated\" and \"While not amongst the great movie romances, there is something undeniably touching—and dare I say heart-warming—about Cousins\".[4]","box_office":"$22,026,369","cinematography":"Ralf D. Bode","directed_by":"Joel Schumacher","release_dates":"February 10, 1989 (1989-02-10)|||||","Production":"The film was directed by Joel Schumacher, known mostly for his works St. Elmo's Fire and The Lost Boys. Although not identified as such, the locations were primarily shot around Vancouver, Canada, among the first times the city was featured so prominently, and led to the city being used as a film location much more. The soaring score was composed by Angelo Badalamenti, who was extremely popular at the time from his work with Twin Peaks and Blue Velvet director David Lynch. Film Score Monthly described Badalamenti's melodic score as a definite asset to the film, underscoring several scenes with comical, Henry Mancini-like cues, and others with a delicate, poignant theme that blossoms into a waltz over the end credits.[1]","produced_by":"William Allyn","starring":"Ted Danson|Isabella Rossellini|Sean Young|William Petersen|Norma Aleandro|","running_time":"109 minutes","cousins":"Theatrical release poster","music_by":"Angelo Badalamenti","edited_by":"Robert Brown","written_by":"Jean-Charles Tacchella Stephen Metcalfe"}