{"based_on":"an idea by Fulvio Lucisano (Italy version) story by Robert Kaufman (US version)","country":"Italy United States","distributed_by":"American International Pictures","Plot":"Price plays the titular mad scientist who is working with the Chinese government to use exploding female robots to disrupt a scheduled NATO war-game by blowing up the various generals involved in the exercise (one of whom looks exactly like Goldfoot, and whom Goldfoot later impersonates). Fabian is the hero who works to thwart the plot, when he isn't busy chasing women such as Laura Antonelli's character. The film ends with an extended frantic chase through the streets of Rome, and Goldfoot attempting to start World War III between Russia and the United States by dropping a nuclear bomb on Moscow.","language":"English, Italian","Reception":"Two versions of the film were made, Italian and American. The American version was re-written, re-scored and re-edited without the participation of Bava.[2]The film was not particularly successful, and is considered by many critics to be director Bava's worst movie,[8] yet it was his commercially most successful movie in Italy.[citation needed] Vincent Price's Goldfoot is the only character who appears in both movies.Samuel Z. Arkoff said the film's commercial reception was hurt by the refusal of female lead Laura Antonelli to take her clothes off. Arkoff claims she was originally willing to, but then his nephew, Ted Rusoff, who was sent to supervise the film, developed a crush on her and persuaded her not to do it.[9]Vincent Price later called the film \"the most dreadful movie I've ever been in. Just about everything that could go wrong, did.\"[10]","cinematography":"Antonio Rinaldi","production_company":"Italian International Pictures American International Pictures","directed_by":"Mario Bava","release_dates":"July 29, 1966 (Italy) November 9, 1966 (US)","Production":"Fulvio Lucisano, the head of Italian International Pictures, originally envisioned the film as a sequel to the Franco and Ciccio film, Due mafiosi contro Goldginger. AIP agreed to co-finance, provided it could be turned into a sequel to Dr. Goldfoot and the Bikini Machine. The Italian version of the film would emphasise Franco and Ciccio, while the American one would put forward Vincent Price's Goldfoot.[2]Mario Bava was signed to direct. He did not want the job but Lucisano had him under contract.[2]Frankie Avalon was originally announced for the sequel[3] but he pulled out due to the impending birth of his third child and his part ended up being taken by Fabian.[4] At one stage the movie was known as Dr Goldfoot and the Love Bomb[5] and Dr Goldfoot and the S Bomb.[6]Filming started in April 1966 and took place in Rome, mostly at Cinecitta Studios but also such locations as Parco di Principe, the Rome Cavalieri Hilton, and Luna Park.[4]Louis Heyward estimates the script was rewritten about nine times just prior to production and says there were difficulties satisfying the Italian and American backers; some different scenes were shot for each country, including emphasising brunettes in the Italian version and blondes in the American version.[7]","produced_by":"Louis M. Heyward Fulvio Lucisano","starring":"Vincent Price Fabian Franco Franchi Ciccio Ingrassia Laura Antonelli","running_time":"82 minutes","music_by":"Les Baxter","edited_by":"Federico Muller (Italy version) Ronald Sinclair (US version)","dr._goldfoot_and_the_girl_bombs":"theatrical release poster","written_by":"Louis M. Heyward Robert Kaufman Pipolo"}