{"Availability":"After the film's spring 1995 theatrical run, the film was released on videocassette in 1995 by A-Pix Entertainment and in Canada that same year by Cineplex Odeon. The Canadian tape contained the music video for \"Cemetery\" performed by The Headstones. Video Service Corporation released the film on DVD in 2008.","country":"Canada","distributed_by":"Apex Entertainment Shadow Shows Distribution Cineplex Odeon Films","Plot":"Set on the Kidabanesee reserve in Northern Ontario. Silas Crow (Ryan Black) is a young man confused about his direction in life; he wants to take an automobile mechanic's course in college, but is uncertain whether he should apply. His general confusion with life is most readily evident in his appearance. He wears an old, ratty black hat resembling a fedora, a strange assortment of cargo pants, as well as a long, black trench coat. Frank Fencepost (Adam Beach) is Crow's best friend, and Sadie Maracle (Jennifer Podemski) is his girlfriend.Events are set in motion when a young girl from the reserve is murdered by Clarence Gaskill (Hugh Dillon), a white man who gets off with a light sentence, prompting the community to demand vengeance..","language":"English","Television series":"A television series, The Rez, was spun off from the film in 1996. In the series, Frank Fencepost was played by Darrel Dennis instead of Adam Beach, who was instead given the role of the chief's son, Charlie. Ryan Black and Jennifer Podemski kept their roles, while Podemski's sister Tamara played a new character named Lucy.","box_office":"$304,852 (USA)","cinematography":"Miroslaw Baszak","directed_by":"Bruce McDonald","Filming locations":"The film was shot at the Shawanaga, Wasauksing and Sucker Creek First Nations reserves near Parry Sound.","release_dates":"September 1994 (Toronto Festival of Festivals) March 10, 1995 (USA)","Production":"Dance Me Outside was the first acting role for Dillon, who was previously known as a rock singer. His band, The Headstones, also contributed several songs to the film's soundtrack. Dillon later starred in McDonald's Hard Core Logo, and has since gone on to become an acclaimed actor in television series such as Durham County and Flashpoint.The band Leslie Spit Treeo had a cameo in Dance Me Outside, performing in concert at the reserve's community hall, \"The Blue Quill Hall\". Blue Quill is a borrowed name of a community in W.P. Kinsella's hometown of Edmonton. Other contributors to the soundtrack included the folk music duo Kashtin.","produced_by":"Brian Dennis Bruce McDonald Duke Redbird","starring":"Hugh Dillon|Ryan Black|Sandrine Holt|Adam Beach|Jennifer Podemski|","running_time":"84 minutes","music_by":"Mychael Danna, Keith Secola","edited_by":"Michael Pacek","written_by":"John Frizzell Bruce McDonald Don McKellar W. P. Kinsella (book)"}