{"country":"United States","distributed_by":"United Artists","Plot":"In Paris in 1969, young film editor Paul Ballard (Jeremy Davies) is currently working on a science-fiction adventure film called Codename: Dragonfly, written and directed by renowned director Andrezej (Gérard Depardieu).In Codename: Dragonfly, Valentine plays \"Dragonfly,\" a sexy freelance super-agent - in the futuristic year of 2001 - who lives in a spaceship perched on top of the Eiffel Tower and undertakes assignments for the \"World Council\". Dragonfly's latest mission is to stop a revolutionary leader known as \"Mr. E\" (Billy Zane) who is based on the \"far-out\" side of the Moon. The World Council turns for help to Dragonfly, reluctantly because she charges huge sums of money - with which the council literally showers her.Andrezej is utterly infatuated with his film's star, Valentine (Angela Lindvall), a young American whom he discovered at a political rally some time ago. Paul, an aspiring filmmaker working on Codename: Dragonfly, regularly borrows cameras and other equipment from work in order to film his own project: a documentary of his own self-reflections. When the producers prove unhappy with Andrezej's ideas for the movie's ending, they fire him. They are particularly upset with Andrezej's ideas for what they had expected would be an action movie: Andrezej believes it should end with a whimper instead of a bang, in order to subvert the audience's expectations.Andrezej is first replaced with the flashy Felix DeMarco (Jason Schwartzman) - but ultimately producers settle on Paul. Much as Andrezej before him, Paul finds his efforts to complete Codename: Dragonfly stymied by his infatuation with Valentine. Paul has a girlfriend, Marlene (Elodie Bouchez), an Air France flight attendant who makes time for Paul despite her schedule, his obvious growing infatuation with Valentine, his obsession with film making and his self-absorption. Ultimately, Marlene leaves Paul, realizing that his obsessions will never include her. Paul is also challenged by the apparent work of a saboteur, who cuts up footage before it can be edited, and who sends cryptic messages to the remaining crew. Others suspect Andrezej - who resents being fired and losing control of what he considers to be his film.As the crew prepares to shoot a climactic chase scene in Codename: Dragonfly, Andrezej sneaks onto the set and steals their film. Valentine and Paul jump into Dragonfly's car and chase Andrezej through Paris, ultimately confronting him on the banks of the Seine. Paul convinces Andrezej to return the film, and ultimately it is completed, apparently keeping Andrezej's original idea for the ending.Finally, Paul is a guest speaker at a French film festival in early 1970. Despite signs of stature, he is asked to pass along a script to Felix DeMarco, as though he is still in the other man's shadow. The festival also presents Paul's own film - the collection of self-reflections he'd been shooting over the course of Codename: Dragonfly. In voice overs accompanying Paul's film, it is learned that Marlene and Paul never got back together.","language":"English French","cq":"Promotional poster","cinematography":"Robert D. Yeoman","directed_by":"Roman Coppola","release_dates":"May 12, 2001 (2001-05-12) (Cannes) 000000002002-05-24-0000May 24, 2002","produced_by":"Willi Bär Georgia Kacandes","starring":"Jeremy Davies Angela Lindvall Élodie Bouchez Gérard Depardieu Billy Zane","running_time":"88 minutes","music_by":"Mellow","edited_by":"Leslie Jones Louise Rubacky","written_by":"Roman Coppola","budget":"$7 million"}