{"country":"United States","a_cinderella_story":"Theatrical release poster","distributed_by":"Warner Bros. Pictures","Plot":"Young Samantha \"Sam\" Montgomery (Hannah Robinson) lives in the San Fernando Valley area of Los Angeles, with her widowed father Hal (Whip Hubley), who runs a popular sports-themed diner. Hal soon marries an exceedingly vain, selfish woman named Fiona (Jennifer Coolidge), who has naive fraternal twin daughters from her previous marriage, Brianna (Carly Westerman) and Gabriella (Lilly Babb). During the 1994 Northridge earthquake, Hal is killed when he runs to save Fiona. Having supposedly left no will, Fiona receives all of his belongings, including the house, the diner, and to her dismay, Sam.Eight years later, Sam (Hilary Duff) is employed as a waitress at the diner to save money to attend Princeton University, but she is regularly tormented by Fiona and Brianna (Madeline Zima) and Gabriella (Andrea Avery). Sam struggles to cope socially at North Valley High School, where queen bee Shelby Cummings (Julie Gonzalo), also torments her and calls her \"Diner Girl\" along with other members of the popular clique.Sam confides in her online pen pal \"Nomad\" about her dream to attend Princeton, a dream which he also shares. However, Nomad's true identity is Austin Ames (Chad Michael Murray), the popular, yet unhappy, quarterback of the school's football team, and Shelby's ex-boyfriend, although she refuses to accept that that he has broken up with her. Nomad proposes that they meet in person at the school's Halloween themed home coming dance. Initially reluctant, Sam is convinced by her best friend, Carter Ferrell (Dan Byrd), to go to the dance and meet her mysterious online friend. On the night of the dance, Fiona orders Sam to work the night shift at the diner, then leaves to drive Brianna and Gabriella to the dance.Carter, Rhonda (Regina King), Sam's other best friend, and the rest of the diner's staff convince her to disobey Fiona and go to the dance anyway. Sam, wearing a mask and a beautiful white dress, meets \"Nomad\" at the dance, and is surprised and shocked to learn that he is Austin, who had become smitten with her upon her entrance. The two decide to leave the party to walk alone and get to know each other a little better. While sharing a romantic dance, Sam and Austin begin to fall in love. But just as Austin is about to unmask her, Sam's cell phone alarm goes off, warning her to return to the diner before Fiona comes back at midnight. She leaves without revealing her identity to Austin, and drops her phone on her way out.Austin picks up her phone and begins a desperate search to figure out who his \"Cinderella\" really is, but every girl at the dance claims to be the mysterious owner of the phone. Sam is reluctant to reveal her identity to Austin, feeling that he won't accept her due to her being an outsider. When Austin comes into the diner one day, Sam is forced to help him and, after a talk, she attempts to reveal her identity to him, but is cut off by Fiona. Sam's stepsisters find out about Sam and Austin's email relationship, and (after having failed to convince Austin that one of them is the owner of the phone) convince Shelby that Sam tried to steal Austin from her. During a pep rally, Shelby, Sam's stepsisters and the cheerleaders humiliate her in front of the entire school and expose her identity as well as naming her an impostor. Austin is hurt by Sam's secrecy and Sam leaves the pep rally feeling devastated.Like Austin, Sam had been accepted to Princeton, only to be duped by Fiona into believing she was rejected. Sam then decides to give up her dreams and resigns herself to working at the diner, but Rhonda gives Sam a pep talk not to lose hope. When her stepsisters come in, they slam the door, causing a guitar to fall off the wall, taking the wallpaper down with it. Sam then sees her father's words, \"Never let the fear of striking out keep you from playing the game,\" and regains her confidence (in real life this quote came from Babe Ruth). She stands up to Fiona, quits her job at the diner, and moves in with Rhonda, who quits along with the entirety of the diner's staff, having only put up with Fiona's abuse for so many years after Hal's death for Sam's sake. The customers, who witness the entire scene, promptly leave in disgust as well.Before a school football game, Sam confronts Austin about his cowardice and lies. Before the final play of the game, he sees Sam making her way out of the stands, and finally stands up to his father, saying he wants to attend Princeton rather than simply play football all his life. He chases after Sam and apologizes. She accepts his apology and they share their first kiss as rain falls over the drought-plagued valley. Soon after, Sam finds Hal's will hidden in her childhood fairy-tale book, stating that all of his possessions belong to her. Since this leaves her their rightful and legal owner, Sam sells her step-family's fancy cars so that she can pay for college, and Fiona, who signed the will as a witness but claims she'd never seen it before, is arrested by the police after they chase her around the lawn.Fiona, Brianna, and Gabriella are made by the District Attorney to work off the money they stole from Sam at the diner, which is restored to its former glory by its new owners, Sam and Rhonda. Sam finds that she was in fact accepted by Princeton; the acceptance letter was found in the garbage by her stepsisters. Also, Austin's father comes to accept his son's desire to attend Princeton. Things even work out in the end for Carter as he makes a commercial for acne medication. Shelby, having been dumped by Austin earlier (and having previously turned Carter down after he defended her at the Halloween dance), aims to pursue him since he is now popular, but having finally seen her for the shallow and mean-spirited person she really is, he turns her down for Astrid, the high school's goth DJ and announcer. The film ends with Sam and Austin, now officially a couple, driving off to Princeton together.","language":"English","Reception":"A Cinderella Story received generally negative reviews. On Rotten Tomatoes, the film has a rating of 11%, based on 103 reviews, with an average rating of 3.6/10. The site's critical consensus reads, \"An uninspired, generic updating of the classic fairy tale.\"[2] On Metacritic, the film has a score on 25 out of 100, based on 30 critics, indicating \"generally unfavorable reviews\".[3] Roger Ebert called A Cinderella Story \"a lame, stupid movie\".[4]The film was nominated for five Teen Choice Awards at the 2005 ceremony, winning the award for Choice Movie Blush Scene, the same year Duff won the Kids Choice Awards for Favorite Movie Actress. In 2005, Duff also received a Golden Raspberry Award for Worst Actress nomination.In its opening weekend, the film grossed $13,623,350 in 2,625 theaters in the United States and Canada, ranking #4 at the box office, behind I, Robot, Spider-Man 2 and Anchorman: The Legend of Ron Burgundy. By the end of its run, A Cinderella Story grossed $51,438,175 domestically and $18,629,734 internationally, totaling $70,067,909 worldwide.[1]","box_office":"$70.1 million","cinematography":"Anthony B. Richmond","directed_by":"Mark Rosman","narrated_by":"Hilary Duff","release_dates":"July 16, 2004 (2004-07-16)|||||","produced_by":"Clifford Werber|Ilyssa Goodman|Hunt Lowry|Dylan Sellers|","starring":"Hilary Duff|Chad Michael Murray|Jennifer Coolidge|Regina King|Dan Byrd|Julie Gonzalo|Madeline Zima|Brad Bufanda|Andrea Avery|Paul Rodriguez|","running_time":"95 minutes","Sequels":"The film was followed by three sequels, Another Cinderella Story (2008), A Cinderella Story: Once Upon a Song (2011) and A Cinderella Story: If the Shoe Fits (2016).","music_by":"Christophe Beck","edited_by":"Cara Silverman","written_by":"Leigh Dunlap","budget":"$19 million[1]"}