{"big_bully":"Theatrical poster","country":"United States","distributed_by":"Warner Bros.","Plot":"Growing up in Hastings, Minnesota, young David Leary was bullied by Roscoe Bigger, nicknamed \"Fang\" because of a pointed tooth. David is ecstatic when his parents announce they're moving to Oakland. David informs teachers about Fang stealing a moon rock and Fang is arrested.Twenty-six years later, David is divorced and raising his troubled son Ben as a single parent. Not having much success as a writer, David's old school offers him a job teaching creative writing for the semester. He meets his neighbors Art and Betty Lundstrum and rekindling a relationship with his old flame Victoria. He also encounters the school librarian Mrs. Rumpert who is still waiting for David to return Green Eggs and Ham to the library. After Ben begins picking on a kid named Kirby, David meets the boy's father Ross Bigger when both are called to the office of Principal Kokelar. Following a fire drill, David meets with his old friend Ulf, a firefighter. When meeting with Ulf, Alanand Gerry at a bar, David learns that after Ross got out of juvenile hall, Ross' parent's skipped town which led to him growing up in an orphanage.When Ross learns who David is, he reembarks on his old routine of bullying him to make himself feel better. Ross drops his mild-mannered and pushover attitude and begins taking charge in his classroom and home. David's son begins bullying Ross's son, but after a discussion they become friends. Ross begins to intimidate until David becomes paranoid, and begins freaking out another teacher, Clark, who thinks he is on crack. When David brings Ross' actions to Principal Kokelar after a recent pranking, David is told by Principal Kokelar that Ross has been a teacher longer than David has and even states that he had gotten some complaints from Clark about David and that if David can't straighten up his act, he will get another teacher to cover for him for the remainder of the school semester.Later that night, they meet at the old see-saw where Ross reaffirms that David has never stood up for himself at which point David admits snitching to get Ross put in Juvenile hall. After a game of cat-and-mouse in the school after hours, David flees to his hiding place he used when he was a child, a cave. Ross chases him onto a waterfall and tells David that he always thought of him as a friend, before an enraged Ross attacks him. David hits him with a piece of driftwood causing Ross to fall into the river. Fearing that he has killed his enemy, David tries to turn himself over to the police only to find that the cops are out. Ulf drives David to his home while he tries to find Ross' body. After a talk with Art, David attempts to go to sleep only to discover Ross alive and well. The two men fight once again until Kirby and Ben come in and reveal that they've made up and encourage their fathers do the same. Ross reveals he stole the moon rock because he wanted to be an astronaut. It was also shown that during their recent fight, Ross' \"fang\" was chipped. They finally patch things up.With nothing left for him in Hastings, David's semester teaching job was over. David begins to pack up and move to New York. He has Victoria return Green Eggs and Ham to the school library for him. Ross arrives and as a goodbye present for David, Ross gives him an Evel Knievel action figure identical to the one David had as a child before Ross threw it into a river. David tells them to visit whenever, and the changed family leaves. Ross hooks up his mobile home to his truck, and follows David telling his family that they have been \"invited\" to come to New York.","language":"English","Reception":"The film was a box office bomb, grossing only $2,042,530 from an estimated $15 million budget.[1] It was also a critical failure, currently holding a 0% on Rotten Tomatoes.[2]Tom Arnold tied with Pauly Shore for a 1996 Razzie Award in part for his role in Big Bully as well as for Carpool and The Stupids.","box_office":"$2,042,530","cinematography":"Daryn Okada","production_company":"Morgan Creek Productions","directed_by":"Steve Miner","release_dates":"January 26, 1996 (1996-01-26)|||||","produced_by":"Gary Foster Lee Rich James G. Robinson Gary Barber Dylan Sellers","starring":"Rick Moranis Tom Arnold Carol Kane","running_time":"91 minutes","music_by":"David Newman","edited_by":"Marshall Harvey","written_by":"Mark Steven Johnson","budget":"$15 million"}