{"country":"Argentina Netherlands","distributed_by":"Cinema Tropical","Background":"The motion picture was financed partly by the Rotterdam International Film Festival's Hubert Bals Fund and the INCAA (Instituto Nacional de Cine y Artes Audiovisuales de la Argentina).The filming was a stop-and-go production and required three years of discontinuous shooting. It was shot on different days and at different times. According to director Caetano, he was never able to film for more than three days at a time.[3]Caetano said, \"[W]hen writing the script, what interested me was the story; the issue of racism was not very present. However, it is inevitable that when addressing those characters and setting the story in that particular social strata, there is a series of themes that appear on their own and impose themselves.\"[4]Caetano believes that, \"[T]he film’s main theme is the collision among people of the same social class, they are workers about to be left out of any class at all, and thus they are intolerant towards one another. Basically, they are trapped in a situation they can not escape.\"[4]Caetano, in neo-realist fashion, used both professional and non-professional actors.[4]  Freddy Flores, the main character, for example, is a non-professional actor.[5]","Plot":"The mostly plot-free film is confined to a café-bar in the lower-middle class Buenos Aires neighborhood of Villa Crespo, with few trips outside.Bolivia tells the story of Freddy (Freddy Flores), a Bolivian with a gentle disposition, who, after Americans burn down the coca fields where he is employed, loses his job. With little work opportunities in Bolivia, he leaves his wife and three daughters and travels to Argentina to search for employment as an undocumented worker. He hopes to make money and later return to his family.He lands a job as a grill cook in a seedy Villa Crespo café where the brutish owner (Enrique Liporace) is happy to skirt Argentinian immigrant laws in order to secure cheap labor.It is in this café that Freddy meets the characters who affect his life: Rosa (Rosa Sánchez), a waitress of Paraguayan/Argentine descent, and an outsider by virtue of her mixed heritage; Héctor (Héctor Anglada), a traveling salesman from the province of Córdoba who's gay; a Porteño taxi driver (Oscar Bertea), and one of the driver's buddies.Freddy also has to deal with various Argentine café patrons who view all Paraguayans and Bolivians with disdain due to their ethnicity.","language":"Spanish","Critical reception":"Film critic Elvis Mitchell, writing for The New York Times, liked the direction of the film, and wrote, \"Mr. Caetano's work is most telling and gripping...[and] has an emotional integrity that's concise and direct.\"[6]Film critics Frederic and Mary Ann Brussat of the website Spirituality and Practice were touched by the story they viewed, and wrote, \"Bolivia is a riveting slice-of-life drama...[that] hits the mark with its harrowing depiction of urban poverty and the divisive and explosive impact of the hatred of foreigners.\"[7]Manohla Dargis, film critic for the Los Angeles Times, makes the case that the film sub silento informs of what is happening in Argentina (in 2001) both economically and culturally. She wrote, \"Life in Bolivia, a parable about contemporary Argentina, is even grittier than the film's churning black-and-white cinematography...[and the film] offers up characters in a state of ongoing crisis. Underpaid and overwhelmed, financially unmoored and spiritually adrift, these are men and women for whom the tanking economy is, finally, just the most obvious manifestation of a deeper malaise.\"[8]Currently, the film has a 100% \"Fresh\" rating at Rotten Tomatoes, based on twelve reviews.[9]","cinematography":"Julián Apezteguia","directed_by":"Israel Adrián Caetano","Awards":"WinsNominated","bolivia":"Theatrical release poster","release_dates":"January 24, 2002 (2002-01-24) (Netherlands)|April 11, 2002 (2002-04-11) (Argentina)|February 26, 2003 (2003-02-26) (United States)|||","Distribution":"The film was first featured at the Cannes Film Festival in May 2001 where it won the Best Feature Young Critics Award. It opened in the Netherlands on January 24, 2002 and in Argentina on April 11, 2002.The film was also shown at various film festivals, including: the Donostia-San Sebastián International Film Festival, the London Film Festival, the Rotterdam International Film Festival, the Karlovy Vary Film Festival, the Festivalissimo Montréal, the Cinémas d'Amérique Latine de Toulouse, the Cleveland International Film Festival, and the Film by the Sea Film Festival.In the United States, the movie opened in New York City on February 26, 2003.","produced_by":"Executive Producer: Matías Mosteirín Producer: Roberto Ferro Associate Producer: Lita Stantic","starring":"Freddy Flores Enrique Liporace Rosa Sánchez","running_time":"75 minutes","music_by":"Los Kjarkas","edited_by":"Santiago Ricci Lucas Scavino","written_by":"Screenplay: Israel Adrián Caetano Story: Romina Lafranchini"}