{"country":"United States","distributed_by":"Film Foundry Releasing","Plot":"In 1936, golfer Bobby Jones comes to Scotland to visit the Old Course at St. Andrews. Unsure of his reception, he is warmly welcomed by many spectators.The scene changes to Atlanta, Georgia, where Jones, a young boy, observes his father \"Colonel\" Jones playing golf, poorly. The more young Bobby watches, the more he emulates the better players he sees, such as Stewart Maiden, a club professional originally from Scotland. By the time he is 14, Bobby is good enough to reach the quarterfinals of the U.S. Amateur tournament.As sportswriters of the era such as O.B. Keeler and Grantland Rice take a keen interest in him, Bobby wins the state amateur championship at 16 and the U.S. Open itself at 18, even defeating the greatest golfer of that time, the colorful Walter Hagen. He also attends Georgia Tech, where he receives a diploma and meets Mary Malone, whom he ultimately marries.Bobby has a hot temper that affects his game and reputation. His first time at St. Andrews, in 1921, Bobby walks off the course after 11 holes of the third round, expressing his dislike for the course. His idol Harry Vardon, who would win The Open Championship six times during his career, cautions Bobby never to quit, particularly at St. Andrews, which he considers the greatest golf course of all.Before long, Bobby is a great success, winning four major tournaments in one year. But by 1930, he has lost interest in playing golf. He becomes a lawyer instead and retires from the sport at age 28. Bobby continues to influence the game in other ways, however, designing courses, also becoming one of the founders of Augusta National Golf Club and the Masters Tournament.","language":"English","box_office":"$2,707,913[2]","bobby_jones:_stroke_of_genius":"Theatrical release poster","cinematography":"Tom Stern","production_company":"McDongall Films","directed_by":"Rowdy Herrington","release_dates":"April 30, 2004 (2004-04-30)|||||","Production":"The film was shot in multiple locations, including Southern California, Georgia: Agnes Scott College, Decatur, GA, East Lake Golf Club, Castleberry Hill, Covington, Griffin; and Scotland and St. Andrews, Fife.[citation needed]","produced_by":"Kim Dawson","starring":"Jim Caviezel Claire Forlani Jeremy Northam Malcolm McDowell Aidan Quinn","running_time":"123 minutes [1]","music_by":"James Horner","edited_by":"Pasquale Buba","Release":"The film was a commercial failure, with an opening weekend gross of $1.2 million and $2,707,913 overall,[3] against a production cost of $20 million.[2]The film received negative reviews with a 26% rating on Rotten Tomatoes.[4] On Metacritic, which uses an average of critics' reviews, the film has a 45/100 rating, indicating \"mixed or average reviews\".[5]","written_by":"Rowdy Herrington Bill Pryor","budget":"$20 million[2]"}