{"country":"Indonesia","distributed_by":"Warner Indonesia","Plot":"Renjani (Ria Irawan), a former ballerina and rape victim who aborted the resulting foetus, and Wid (Jajang C. Noer), a doctor and daughter of a prostitute, are two women who volunteer at an orphanage for children with several disabilities in Yogyakarta. One day, while practicing her dancing, Renjani notes that Dewa (Dicky Lebrianto), a tiny eight-year-old with autism and brain damage, is responding. This convinces her that music therapy could promote healing. Renjani later asks Bhisma (Nicholas Saputra), a violinist that she met by chance, to assist him; they later fall in love. After Bhisma writes a song, \"Biola Tak Berdawai\", for Dewa, he prepares for a recital. Renjani and Dewa attend the recital, but Renjani faints and is rushed to the hospital; the cause is later discovered to be cervical cancer. After a week in a coma, Renjani dies; at her grave, Dewa plays \"Biola Tak Berdawai\" as Bhisma listens.","language":"Indonesian","Themes":"According to Asmara, Biola Tak Berdawai is \"a metaphor for the multiple- handicapped babies\" that symbolizes the souls of people who have never known love, and those whose hearts have been scarred by it.[1][4] She also notes that the film conveys the message that one must be ready to sacrifice things for love.[4]","cinematography":"German G. Mintapradja","directed_by":"Sekar Ayu Asmara","release_dates":"22 March 2003 (2003-03-22)|||||","Production":"Biola Tak Berdawai was directed by Sekar Ayu Asmara, a Jakarta-born self-taught director.[1] It was her directorial debut.[2] Asmara also produced the film and wrote the lyrics to the theme song.[3]According to Asmara, Ria Irawan, Nicholas Saputra and Jajang C. Noer immediately accepted the offer to play in the film. However, the role of Dewa was filled by Dicky Lebrianto after casting in both Yogyakarta and Jakarta; she notes that it was difficult as the person who played him had to be a non-handicapped child capable of acting like he had a handicap.[4]Addie MS, a musician cum conductor from the Twilite Orchestra and Asmara's long-time friend, was chosen to compose the film's music.[5][4] The Victorian Philharmonic Orchestra in Melbourne, Australia, provided the music.[4]The movie was shot in Yogyakarta and the surrounding area over a period of 25 days in 2002.[3]","produced_by":"Seto Harjojudanto Sekar Ayu Asmara Nia Dinata Afi Shamara","starring":"Ria Irawan Nicholas Saputra Jajang C. Noer","running_time":"97 minutes","music_by":"Addie MS","edited_by":"Dewi S. Alibasah","Release":"Biola Tak Berdawai premiered on 22 March 2003,[1] with wider release on 4 April.[6] It garnered the Best New Director award at the Cairo International Film Festival for Asmara.[2] It later became Indonesia's submission to the 76th Academy Awards for the Academy Award for Best Foreign Language Film. However, it was not accepted as a nominee.[1] The film was later novelised by Seno Gumira Ajidarma.[7]Hera Diani of The Jakarta Post gave the movie two and a half out of four stars, writing that Noer's character was \"ridiculous\", with \"bad makeup, unnecessary histrionics and absurd statements on how life and everything in it are a riddle\". Irawan's character was described as \"sometimes unconvincing\". Regarding the film itself, she wrote that the dialogue was at times pat and some scenes were illogical. However, she praised the cinematography and score, as well as Lebrianto's portrayal of Dewa.[5]","written_by":"Sekar Ayu Asmara"}