{"country":"United States","distributed_by":"Fox Searchlight Pictures","Plot":"Jamie (Catherine Keener) informs her ex-husband John (John C. Reilly) that she is getting married. Even though they have been apart for seven years, the news devastates John, who was already depressed. At a party the next night, John gets more and more drunk until he ends up urinating in the bushes, where Molly (Marisa Tomei) strikes up a conversation. Molly goes back to John's house but leaves during the night, after they have had sex. Molly returns for dinner the next night, and again leaves after they have had sex. John follows her to her house and falls asleep in his car. The next morning, he approaches the house and meets Molly's 21 year-old son Cyrus (Jonah Hill). Cyrus invites John inside and makes friendly conversation with him. Molly is startled to see John in her house when she returns, but the trio have dinner together. John is unnerved by the unnatural intimacy between Molly and Cyrus.The next morning, John cannot find his shoes, which he had left in the living room. Through the day, he gets increasingly disturbed by their disappearance and starts to worry that Cyrus is messing with him. He ropes Jamie into meeting Molly and Cyrus, in order to appraise his paranoia. Jamie finds Cyrus sweet, if a little overly intimate with his mother. Relieved, John returns for another night at Molly's home. As they begin to have sex for the first time in her house, Cyrus screams in his room, and Molly runs to comfort him. She does not return to John, who goes out looking for her in the middle of the night. He encounters Cyrus holding a large kitchen knife, allegedly making a snack. Cyrus says he had a night terror, and that Molly has gone to sleep. He then advises John to back off on the relationship because he is scaring off Molly. John leaves a note for her and goes home. In the morning, Cyrus sits Molly down and tells her that John had confessed to him that she was coming on too strong. When she presses Cyrus for details, he explodes in a tantrum and storms off, checking through the window to make sure that she is upset. When Cyrus finally comes home, he explains that he has rented a room and will be moving out. After a few happy days alone together, John decides to move in with Molly.One night, as they begin to have sex, Cyrus surprises them and says that he has had another panic attack and wants to return home. John confronts Cyrus privately, and Cyrus admits that he has been deliberately sabotaging their relationship. He moves back home, and John remains wary of him. The night before Jamie's wedding, he warns Cyrus not to cause trouble. At the wedding however, Cyrus is hurt when he sees how the event stirs romantic feelings between John and his mother. Drunk, he confronts John in the bathroom and attacks him, yelling that John will not take his mother away from him. As John defends himself, they spill out of the bathroom, into open view. Cyrus makes it look like John attacked him. John advises Molly to open her eyes, and storms off furious.Later, Molly believes John's explanation, but John will not continue the relationship, convinced that Cyrus will sabotage it and that he will end up alone in a few years. He moves into a cheap apartment. Molly confronts Cyrus about his behavior, and describes how unhealthy their intimacy has become. Cyrus reconsiders his position and visits John, begging him to come back. John opens his door to see Cyrus crying, and they reconcile. John takes Cyrus home and decides to continue his relationship with Molly.","language":"English","Reception":"The film has received generally positive reviews. Review aggregate Rotten Tomatoes reports that 80% of critics have given the film a positive review based on 149 reviews, with an average score of 6.7/10. The critical consensus is: \"While it may strike some viewers as slight, Cyrus is a successful hybrid of mainstream production values and the mumblecore ideals of directors Jay and Mark Duplass.[2] Critics reacting negatively include Manohla Dargis of The New York Times, who criticized the Duplass brothers for displaying an \"almost aggressive lack of ambition\",[3] and Damien Magee of 702 ABC Sydney, who identified Cyrus as \"the sort of film that many people, including a number of well-respected critics, have started to confuse with good cinema\" going on to call it \"a checklist of indie-chic clichés\", and concluding with the suggestion \"If you're really stuck for something to see, stick this on the maybe pile, otherwise marked Juno.\"[4] Peter Travers added it to his top ten movies of 2010 as one of the movies that tied for eleventh place.","box_office":"$9,931,520[1]","cinematography":"Jas Shelton","production_company":"Scott Free Productions","directed_by":"Jay Duplass|Mark Duplass|","cyrus":"Theatrical release poster","release_dates":"January 23, 2010 (2010-01-23) (Sundance)|June 18, 2010 (2010-06-18) (United States)||||","produced_by":"Michael Costigan","starring":"John C. Reilly|Jonah Hill|Marisa Tomei|Catherine Keener|","running_time":"91 minutes","music_by":"Michael Andrews","edited_by":"Jay Deuby","written_by":"Jay Duplass|Mark Duplass|","budget":"$7 million[1]"}