{"based_on":"Dark Water  by Koji Suzuki","country":"Japan","distributed_by":"Toho","screenplay_by":"Yoshihiro Nakamura|Kenichi Suzuki[1]|","Plot":"Yoshimi Matsubara (松原 淑美 Matsubara Yoshimi; Hitomi Kuroki), in the midst of a divorce, moves to a run-down apartment with her daughter, Ikuko (松原 郁子 Matsubara Ikuko; Rio Kanno). She enrolls Ikuko in a nearby kindergarten and in order to win custody of her daughter, starts working as a proofreader, a job she held before she was married. The ceiling of the apartment has a leak, which worsens on a daily basis. Matsubara complains to the janitor but he does nothing to fix the leak. She then tries to go to the floor above her apartment to find out the root of the leak, and discovers that the apartment is locked.Strange events then happen repeatedly: a red bag with a bunny on the front reappears no matter how often Yoshimi tries to dispose of it. Hair is found in tap water. Yoshimi gets glimpses of a mysterious long-haired girl who is of similar age to her daughter. Yoshimi discovers that the upstairs apartment, the source of the leak, was formerly the home of a girl named Mitsuko Kawai (河合 美津子 Kawai Mitsuko; Mirei Oguchi), who was Ikuko's age. She had attended the same kindergarten Ikuko now attends. Mitsuko was abandoned by her mother and vanished more than a year ago.One day, Ikuko goes missing and Yoshimi finds her in the apartment upstairs, where the walls are running with water and the entire place is flooded. Convinced something eerie is happening, she decides to move but her lawyer convinces her that moving now would weaken her position greatly in her divorce.One evening, after Yoshimi finds that the red bag has reappeared in Ikuko's school bag, she heads to the roof of the building, and is drawn to the huge water tank. She notices that it was last inspected – and thus opened – over a year ago, on the day Mitsuko was last reported seen. She comes to the horrific realization via a vision that Mitsuko had fallen into the tank while trying to retrieve her red bag, and was thus drowned.Meanwhile, Ikuko, left alone in the apartment, attempts to turn off the bath tap, which has started to spurt filthy water. Mitsuko's spirit emerges from the flooded bathtub and attempts to drown her.Yoshimi finds Ikuko unconscious on the bathroom floor. Intending to escape, she rushes into the elevator, apparently fleeing from the apparition of Mitsuko. But as the elevator door closes, she sees that the figure pursuing her is in fact her own daughter – and realizes she is carrying Mitsuko, who claims Yoshimi as her mother in a torrent of water. Yoshimi realizes that Mitsuko won't let her go and with Ikuko looking on in tears, Yoshimi sacrifices herself by staying in the elevator and pretending to be Mitsuko's mother to appease her spirit. The elevator ascends and Ikuko follows, but when the doors open, a flood of murky brown water rushes out and nobody emerges.The end of the film shows Ikuko, now sixteen (Asami Mizukawa), re-visiting the abandoned block. She notices that her old apartment looks oddly clean and seems occupied. She then sees her mother, looking exactly as she did that fateful night, and they have a conversation. Her mother affirms that as long as Ikuko is all right, she is happy. Ikuko pleads to live with her mother, whom she thinks is alive, and though Yoshimi smiles, she tells Ikuko that it would be impossible and apologizes that they cannot be together. Sensing someone behind her, Ikuko turns, but sees no one (the audience though sees Mitsuko). When she turns back, Yoshimi has also disappeared. As she leaves, Ikuko realizes that her mother's spirit has been watching over her.","Reception":"The movie received positive reviews upon its release. This film currently holds a 77% \"fresh\" rating at Rotten Tomatoes.","box_office":"$0.9 million (Japan)","Related work":"The original title, Honogurai Mizu no Soko kara (仄暗い水の底から, From the Depths of Dark Water), is also the title of the horror anthology by Koji Suzuki and the manga adaptation, authored by Koji Suzuki and illustrated by MEIMU, under Kadokawa Shoten in 2002. The English manga version, translated by Javier Lopez, was published as Dark Water by ADV Manga in 2004.A U.S. remake of the film, directed by Walter Salles and starring Jennifer Connelly, was released on July 8, 2005.","cinematography":"Junichiro Hayashi[1]","directed_by":"Hideo Nakata","production_companies":"Oz Honogurai mizu no soko kara[1]","release_dates":"January 19, 2002 (2002-01-19) (Japan)|||||","dark_water":"Japanese film poster","produced_by":"Takashige Ichise[1]","running_time":"101 minutes[1]","music_by":"Kenji Kawai|Shikao Suga[1]|","edited_by":"Katsumi Nakazawa[1]","Release":"The film was released theatrically in Japan on January 19, 2002 where it was distributed by Toho.[1] The film grossed a total of $906,344 on its Japanese release.[2]The film was shown at the AFI Film Festival in the United States on November 9, 2002.[1]"}