{"based_on":"Strange Case of Dr Jekyll and Mr Hyde Jack the Ripper","country":"U.S.","Plot":"In the opening scene, Henry Jekyll, a young boy, witnesses his father having sex with another woman in a barn and when his father catches him, the father violently whips Henry for his bad behavior of spying, scarring him for life with repressed sadomasochistic longings. Many years later in late 1880s England, the adult Dr. Henry Jekyll is experimenting with the human psych when he accidentally ingests a mix of ether and cocaine and goes insane. He transforms into the monstrous-looking Edward \"Jack the Ripper\" Hyde, he murders a prostitute who resembles one that he previously met as a child. He begins a murder spree, using the mixture, originally meant to be an anesthetic, to influence prostitutes and the johns to torture and kill each other.[2] The murders bring upon the attention of a detective from Scotland Yard as well as Jekyll's wife Elisabeth, who begins suspect where her husband is leaving at nights.As 'Jack' Hyde, he enlists two acolytes with giving out his anesthetic drug to distribute among the lower-class population of Whitechapel. One night, Elisabeth follows Jekyll after he transforms to the brothel where she follows him from there to a sadomasochistic threesome at a local abandoned warehouse where both of Hyde's partners go crazy and attempt to kill each other and her until Elisabeth subdues and kills both and gets away. But Hyde follows her back to her house and after breaking in, murders her before transforming back to Dr. Jekyll and thus gets away with everything to continue his killing spree.","language":"English","Reception":"Vincent Canby wrote in The New York Times that Anthony Perkins \"gives a good, funny, if somewhat lopsided performance as the madman of medicine\".[1]TV Guide reviewed the film, giving it 1 out of 4 stars and saying, \"EDGE OF SANITY obviously isn't meant to be taken seriously, despite its expensive production values and surrealistic photography—both surprisingly good. But the rest of EDGE OF SANITY (shot mostly in Budapest with some English exteriors) doesn't measure up to its technical proficiency.\"[4] Leonard Maltin described the film as \"Tasteless, pointless, and unpleasant\".[5]","edge_of_sanity":"Film poster","box_office":"$102,219","production_company":"Allied Vision","directed_by":"Gérard Kikoïne","release_dates":"April 14, 1989","Production":"A few exterior sets were filmed in London. Vincent Canby stated that he thinks the film looks \"19th-century atmospheric\".[1]Alain Silver compared the style of the film to those directed by Ken Russell, based on the way that the films incorporate the supernatural, psychology, and sexual imagery. He also said that the prostitutes \"further unsettle the preconceptions of the audience\".[2]The book Marked Women: Prostitutes and Prostitution in the Cinema uses the film as an example of sexual brutality against women in films.[3]","produced_by":"Jacques Fiorentino Harry Alan Towers","starring":"Anthony Perkins Glynis Barber David Lodge","running_time":"85 mins","music_by":"Frédéric Talgorn","written_by":"J.P. Félix Ron Raley"}