{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Victor Ajax has been sentenced to death, sitting in an electric chair. In a flashback, we learn that Victor once was a promising young technician in the employ of Trend-Odegard Security. Mr. Trend, co-owner of the company, has learned of a plan by his partner to sell the company to Renaldo \"The Heel\" and responds by hiring two exterminators who promise to \"kill all sizes\" in order to eliminate Odegard and his plan. When Victor, who has been installing security cameras in Trend's apartment building, seems about to go back to the store, Trend distracts him with a lecture about \"the grand design\" and sends Victor on a quest to find his dream girl.The dream girl is found in the form of Nancy, who responds minimally to Vic but is enamored of Renaldo. Victor and several residents of the building, including Mrs. Trend, run afoul of the killers, and a seemingly random series of slapstick murders occur, for all of which Victor is ultimately blamed. Nancy inevitably becomes target and Vic saves her and kills the exterminators after a long comical fight sequence. The flashback ends and Victor is in the electric chair, and awaits his execution while an elaborate race sequence occurs in which Nancy, accompanied by several nuns, drive manically, Nancy at the wheel, to the scene in order to prove his innocence. Before the switch is pulled however, Nancy arrives just in time and clears his name. The movie concludes with their marriage.","language":"English","Release and reception":"After all the editing imposed by the studio, Crimewave still became a box-office flop. Campbell reasoned that \"cross-genre\" films \"send marketing people scurrying under a desk\".[23] According to him, the film was hard to market because it featured elements of horror films, comedies, and dramas.[23] To make matters even more confusing, in France and Italy, the film's title was changed to Death on the Grill and The Two Craziest Killers in the World respectively.[23] In the United States, the film was only released in Kansas and Alaska, to make the film eligible for HBO broadcasting. Upon release, the film \"went down in box-office flames\", with Campbell commenting \"it wasn't released. It escaped!\"[23] The \"only good\" screening came the Seattle International Film Festival, where the movie was promoted as a novelty film.[23]Along with Raimi and Campbell, film critics were largely dismissive of the film. A writer for Time Out gave a negative review, writing \"despite its ambition and a Coen Brothers script credit, Raimi's second film was a disappointment after his astonishing debut The Evil Dead.\"[26] The writer did however compliment some of the set pieces featured in the film, ultimately commenting that only people interested in the early work by Raimi would be interested.[26] Film Junk writer Sean Harley commented that the main appeal of the film is that it was directed and written by notable artists, insisting \"based on their impressive filmographies and the cult followings that both have amassed, a collaboration of this magnitude would be a cinematic event like no other.\"[27] However, he commented that the film was a disappointment, noting that fans of the films by Raimi could likely enjoy it. He summarized that the film was \"not a particularly brilliant movie, and it's easily one of the weakest projects that any of these great filmmakers have been involved in\", giving it a weak recommendation.[27]Leonard Maltin awarded the film two and a half stars out of four, describing it a \"weird, almost incoherent crime story.\"[28] Celluloid Dream's Simon Hill commented that the writing was a disappointment, musing that it did however feature \"glimpses of director Raimi would become\".[29] A scene in a dentist office reminded him of a scene from Spider-Man 2, a film also directed by Raimi. He commented that \"even in his small part Campbell is the most memorable character in the film\", also praising the performance of the two exterminators.[29] Campbell also criticized the film, describing it as a \"lesson about abject failure\", writing \"no matter how you slice it, the film was a dog, and everyone involved can pretty much line up and take forty whacks. As filmmakers, we failed to execute a misguided concept and our studio refused us the benefit of any doubt.\"[27] The film has achieved the status of a minor cult film. In one of the few positive notices, MTV writer Adam Rosenberg described the film as \"criminally underrated\".[30] Rosenberg disagreed with the consensus about the film, labeling it as a \"hard-to-find classic\".[31] Kim Newman also called the film underrated, writing that the film \"revels\" in its slapstick nature, taking influence from everything from horror comics to The Three Stooges.[32]","box_office":"$5,101[4]","cinematography":"Robert Primes","directed_by":"Sam Raimi","Home media":"Shout! Factory released Crimewave on Blu-ray/DVD Combo Pack on May 14, 2013.[41]","production_companies":"Embassy Pictures Renaissance Pictures","release_dates":"April 25, 1986 (1986-04-25)[1]|||||","Production":"By 1983, long-time friends Campbell and Raimi had collaborated on several projects together.[5][6] The duo had just completed the production of Within the Woods and The Evil Dead, the latter of which was a box-office and critical hit.[7][8][9] Following his involvement in The Evil Dead, Campbell had difficulty establishing a career as an actor.[10] He appeared on the soap opera Generations, and in several local Detroit commercial ads.[10] Meanwhile, Raimi had been collaborating with the Ethan and Joel Coen on a screenplay.[11] Joel Coen had been one of the editors on The Evil Dead, which led to him befriending Raimi.[12][13] Joel Coen's experience editing The Evil Dead inspired him to complete his own film, Blood Simple, which was released to critical acclaim.[14] The script would later develop into Relentless, a narrative about \"two crazed killers.\"[11]Raimi was not initially optimistic about the talents of the Coen brothers.[11] He recounted that Ethan was \"just a statistic accountant at Macy's at the time.\"[11] After reading the Blood Simple script, however, Campbell commented that the screenplay was \"great\", comparing it to the work of Alfred Hitchcock.[11] It featured \"mild-mannered leading men\" who \"get caught up in a web of fear, murder and mayhem\", elements that often defined the films directed by Hitchcock.[11][15] Distributor Irvin Shapiro, who was instrumental in the commercial success of The Evil Dead, did not like the title of Relentless.[16][17] He suggested putting \"X\" and \"Murder\" in the title, believing it would be more enticing to audiences. With Shapiro's suggestion in mind, Raimi gave the film the tentative title of The XYZ Murders.[3]Given the commercial success of The Evil Dead, studio financial backing for the new project came quickly.[3] Though Raimi and Campbell did not profit from the film, the studio believed in Raimi, initially allowing the director complete creative control on the project; however, executives later took control of the production.[3] Raimi and Campbell developed the project with Embassy Pictures' producer Norman Lear, who supposedly had a \"Midas touch\", because of the consistent success he had attained from various television productions.[3][18] He suggested the title Crimewave, which was ultimately used.[3]Raimi and the studio clashed several times during production.[19] The first disagreement between the director and the executives stemmed from the latter's insistence on casting a \"Hollywood\" actor in the lead role instead of Raimi's long-time collaborator and friend Campbell.[6] In his 2002 autobiography If Chins Could Kill: Confessions of a B Movie Actor, Campbell commented about how difficult it was working with more established producers; \"jumping into the big time meant dealing with the excruciatingly specific and alternately vague demands of a studio, ... Hollywood executives took an interest in everything.\"[3] Campbell was surprised that he had to audition for the lead role, as he did not have to test for The Evil Dead.[3] Campbell and his photographer friend Mike Ditz used a 16 mm film camera and shot a scene to show to the producers. Upon viewing it, the producers asserted that \"Campbell will not star in this film\".[3] In retaliation, Raimi lengthened a supporting role and gave it to Campbell: the character of Renaldo \"The Heel\". This allowed for Campbell to be present through the production.[3]Raimi budgeted the film at $2.5 million, an amount the studio greenlit. But the calculations had not taken union fees and regulations into account, making the proposed budgeting and scheduling unrealistic.[3] In addition, the crew were talked into spending three times the allotted money for one shooting location. The shoot quickly went both over budget and over schedule.[20] At that point, the studio stepped in, with executives demanding cuts in the script, budget restrictions, layoffs, and their own supervision of the project.[21] The studio also insisted on reviewing every batch of dailies, criticizing the decision to use cast and crew members (including Campbell) as extras in several scenes (a Raimi trademark known as \"Shemping\").[21][22]Even without Embassy's interference, however, the production was plagued with difficulties.[19] According to Campbell, lead actress Lasser—under the influence of cocaine—fired her make-up artist.[20] She insisted that she apply all her own make-up, despite objections from the cast. She would often show up on set with poorly applied \"clown make-up\" and messed up hair, oblivious to how she appeared.[20] There were occasions when she outright refused to leave her trailer, to the annoyance of the cast and crew.[20] Production was often affected by \"weird\" events; actor Brion James trashed his hotel room in an attempt to \"exorcise a ghost from his light fixtures\".[20]At one point, shooting was to take place at a bridge overlooking the Detroit River, which was frozen at the time.[1] The script, however, called for clear and running water, meaning that the crew had to brave dangerously low temperatures and conditions to clear the ice; finally they blew up the ice with dynamite.[1] At another time, the crew spent a week filming on a Detroit street after dark, directly under a nursing home, with huge wind machines blowing for long hours. One evening a glass bottle with a note in it crashed to the ground from an upper floor. The note inside read, \"The noise is keeping me awake all night long and I am getting sick. I am dying because of you.\"[1] John Cameron, second assistant director on the film, would later remark, \"I see Crimewave as a real turning point in a certain way, because if you survived that experience, nothing in the business could ever be as hard again.\"[23] Raimi cited the experience as one of the least favorite moments of his career.[1]In post-production, Embassy's self-imposed role in making Crimewave was even greater.[24] Although Raimi, Tapert, and Campbell insisted that they had made the film as partners, the studio refused — because of the already ballooning costs — to pay for Campbell to stay in Los Angeles during post-production (although the executives later compromised).[1][25] The studio replaced Raimi's music composer, Joseph LoDuca, with one of its own choosing. It did the same with the editor, removing Raimi's influence over the film's final cut.[24]An argument broke out near the end of the post-production between Campbell and the producers.[24] Campbell argued that he and Raimi had always closely been involved with their own film's editing, describing the behavior of the producers as \"nickel-and-dime-bullshit\".[24] One of the producers replied by calling Campbell an \"asshole\", commenting that the crew had gone severely over budget.[24] The difficulty during production left a negative impression on Campbell, who insisted that he wanted to never work with big-budget producers again, insisting that the conduct was \"soulless\" and \"just a business.\"[24] Raimi commented negatively about the process too, musing that \"it was really wrong. It was such a horrible, horrible, horrible, depressing scene.\"[1]","produced_by":"Robert Tapert|Bruce Campbell|","starring":"Louise Lasser|Paul L. Smith|Brion James|Sheree J. Wilson|Edward R. Pressman|Bruce Campbell|Reed Birney|","running_time":"86 minutes[2]","Aftermath":"The production of the film was a \"disaster\" according to Campbell, who stated that usually \"missteps\" like Crimewave lead to the end of a director's career.[33] Other people involved with the film expressed similar disappointment with the project.[19][23] Fortunately, Raimi had the studio support to make a sequel to The Evil Dead, which he initially decided to make out of desperation.[33] His career quickly recovered after Evil Dead II was filmed and released in 1987, and was a box office success.[34] The Coen brothers expressed similar dissatisfaction with the film, and have since directed every one of their screenplays with the exception of the 2012 film Gambit.[35][36]Raimi and the Coens remained friends, and the duo cast Campbell in some of their films such as The Hudsucker Proxy (1994) and Intolerable Cruelty (2003), the former of which was co-written by Raimi.[14][37] Elements of Crimewave were re-used by frequent Raimi collaborator Josh Becker for the movie Lunatics: A Love Story, as well as by Raimi himself in Spider-Man and its sequels.[33][38][39] In 2010, a Funny or Die comedy video featuring actors James Franco and Bill Hader paid tribute to Raimi, and in parody of a scene from Spider-Man 2 the actors discussed Crimewave among Raimi's other films. Collider's Matt Goldberg stated, \"I think this sketch features the first reference to Crimewave ever\".[40]","music_by":"Arlon Ober","edited_by":"Michael Kelly|Kathie Weaver|Kaye Davis|","written_by":"Joel Coen Ethan Coen|Sam Raimi|","budget":"$2.5 million[3]"}