{"Adaptations":"In 1985, Random House released a children's book adaptation of The Ewok Adventure by Amy Ehrlich, titled The Ewoks and the Lost Children, and utilized the story presented in the film, along with stills from the film.","original_language(s)":"English","caravan_of_courage:_an_ewok_adventure":"The film's tagline: \"You'll live the adventure... You'll love its heroes.\"","cinematography":"John Korty","directed_by":"John Korty","original_release":"November 25, 1984 (1984-11-25)|||||","Documentaries and commentary":"During the production of The Ewok Adventure, the children in the cast had to balance their school work with acting in the film. During their time on the set, Lucasfilm decided that it might be an educational and rewarding experience for the older children, Eric Walker (Mace) and Warwick Davis (Wicket), to be given their own camera to use between takes. So, calling themselves W&W Productions, Eric and Warwick shot a documentary of the making of the film, which was released to Eric's YouTube-channel in 2014.[4]When the film was released on DVD in 2004 it contained nothing but the film itself. Eric Walker and Warwick Davis stated in interviews that they would be happy to record a cast commentary for another future DVD release, if Lucasfilm someday allowed a more detailed release of the films.","narrated_by":"Burl Ives","theme_music_composer":"Peter Bernstein","editor(s)":"John Nutt","Production":"The original impetus for The Ewok Adventure was an idea George Lucas had for a one-hour television special dealing with the Ewoks, but this was eventually expanded into two hours. Lucas had allowed his Star Wars universe to be produced for television six years earlier with Star Wars Holiday Special which, although economically successful for the most part, had proved an embarrassment to Lucas. With The Ewok Adventure, Lucas assumed full control over the content and production of the film, to ensure a film of good quality. One such event during production which exemplifies this need for creative control was around the time when the film neared completion. The production crew had prepared a script and shot a TV advertisement for the upcoming release. The ad featured Mace, Cindel, and Wicket walking into a diner, which was set in the 50's, where they ordered milkshakes. Mace turns to the camera, and says something to the effect of \"Don't forget to tune in to The Ewok Adventure, on November 25.\" When Lucas was shown the commercial for his personal approval, he disliked the idea, and prevented the commercial from airing.[citation needed]The film's producer was Thomas G. Smith, at the time an employee at Industrial Light and Magic. Smith had intended for Indiana Jones and the Temple of Doom to be his last project for ILM, wanting to make his own movies, however Lucas convinced him to stay by offering the producer role for a half-hour Ewok film he was developing.[2] When shopping the film around Smith discovered that none of the TV networks at the time were interested in airing a movie so short.[2] ABC showed interest, however under the condition that the movie be fleshed out so that it could fit in a two-hour movie of the week slot as such the movie was expanded to fill the request [2]Working from a story written by George Lucas, and a screenplay by Bob Carrau, director John Korty transformed the scenic northern California redwood forests into the forest moon of Endor. Joe Johnston, an art director at Industrial Light & Magic for years and one of the key concept artists of the classic Star Wars trilogy, acted as production designer. Prior to this movie, Johnston had written and illustrated a book about Ewoks, The Adventures of Teebo: A Tale of Magic and Suspense. This gave him a background to the arboreal aliens that was crucial in designing new Ewoks and their surroundings.Both Ewok films were some of the last intensive stop-motion animation work Industrial Light & Magic (ILM) produced, as by the early 80s, the technique was being replaced by go-motion animation, a more advanced form with motorized articulated puppets that moved while the camera shutter was open, capturing motion blur in the otherwise static puppet, eliminating the harsh staccato movement often associated with stop-motion. However, the budgets of the Ewok films were such that go-motion was simply too expensive for the projects, so stop-motion was used to realize creatures such as the condor dragon, the blurrgs, and the boar-wolves.The Ewok movies proved an opportunity for ILM to hone a technique from 2001: A Space Odyssey. The technique, used in photographing matte paintings, is called latent image matte painting. In this technique, during live action photography, a section of the camera's lens is blocked off, remaining unexposed, and a painting is crafted to occupy that space. The film is rewound, the blocked areas reversed, and the painting photographed. Since the painting now exists on the original film, there is no generational quality loss.The musical score for Caravan of Courage: An Ewok Adventure was composed by Peter Bernstein. Selections from the score were released on LP by Varèse Sarabande in 1986.[3] The release was known simply as Ewoks and also contained cues from Bernstein's score to Ewoks: The Battle for Endor.","genre":"Adventure Family Fantasy Science Fiction","running_time":"96 min.","Release":"The Ewok Adventure was first shown on American television November 25, 1984. In its overseas theatrical release, it was rechristened Caravan of Courage: An Ewok Adventure. The film was released on VHS and Laserdisc in 1990 through MGM under the original title.The film was released on DVD as a double feature collection with its sequel, Ewoks: The Battle for Endor, on November 23, 2004. The release was a single double-sided disc, with one film on each side. For this release, the film bore theatrical release title, Caravan of Courage.Features:","production_company(s)":"Lucasfilm Korty Films","Setting":"The film is set in a timeframe approximate to the Ewoks animated series, occurring sometime after the events of Episode IV: A New Hope but before the events of Episode VI: Return of the Jedi.[1] As the film opens, the Towani family's starcruiser has crashed on the forest moon of Endor, and the Towani parents, Jeremitt and Catarine cannot locate their children, Mace and Cindel.","Plot":"On the forest moon of Endor three years after the Battle of Yavin, the Towani family starcruiser lies wrecked. The Towani family (Catarine, Jeremitt, Mace, and Cindel) are stranded. When Catarine and Jeremitt vanish (having been captured by the Gorax), the children are found by the Ewok Deej. After Mace tries to kill them, the Ewoks subdue him and take both children to the Ewoks’ home. There, Cindel and Wicket become friends. Shortly thereafter, the Ewoks kill a beast only to find a life-monitor from one of the Towani parents with the creature.They seek out the Ewok Logray who informs them that the parents have been taken by the monstrous Gorax, which resides in a deserted, dangerous area. A caravan of Ewoks is formed to help the children find their parents. They meet up with a wistie named Izrina and a boisterous Ewok named Chukha-Trok before finally reaching the lair of the Gorax. They engage the Gorax in battle, freeing Jeremitt and Catarine, but Chukha-Trok is killed. The Gorax is thought destroyed when it is knocked into a chasm, but it takes a final blow from Mace (using Chukha-Trok’s axe) to kill the creature, which tries to climb back up after them. Thus reunited, the Towanis decide to stay with the Ewoks until they can repair the starcruiser, and Izrina leaves to go back to her family.","country_of_origin":"United States","original_network":"ABC","distributor":"ABC","Awards":"Caravan of Courage: An Ewok Adventure was one of four films to be juried-awarded Emmys for Outstanding Special Visual Effects at the 37th Primetime Emmy Awards.[5] The film was additionally nominated for Outstanding Children's Program, but lost in this category to an episode of American Playhouse.[6]","starring":"Eric Walker Warwick Davis Fionnula Flanagan Guy Boyd Aubree Miller","Later expanded universe appearances":"Since the release of The Ewok Adventure in 1984, several elements from the film have gone on to appear in other works from the Star Wars expanded universe. Many of the characters, locations, or other elements are elaborated on in greater detail.","Sequels":"A sequel to this movie released in 1985. While the sequel's working title was simply Ewoks II, it was released as Ewoks: The Battle for Endor. According to an interview with Warwick Davis, a second sequel, known only as Ewoks III, was in at least the planning stages around the late eighties, but never happened. The plot of the film was unknown.","producer(s)":"Thomas G. Smith (producer) George Lucas (executive producer) Patricia Rose Duignan (associate Producer)","written_by":"George Lucas (story) Bob Carrau"}