{"directed_by":"Konstantin Bromberg","country":"Soviet Union","Plot summary":"Ivan Puhov (A. Abdulov) is in love with a very kind and friendly girl, Alyona (A. Yakovleva). Alyona works as a witch in a research institution that researches magic called NUINU (Scientific Universal Institute of Extraordinary Services, a NIICHAVO subsidiary in Kitezhgrad; for NIICHAVO see Monday Begins on Saturday). The couple are about to get married when Alyona's jealous and scheming co-worker, Sataneev (V. Gaft), tricks Alyona's boss, Kira Shemahanskaya (Ye. Vasilyeva), the institute director, into putting a spell on Alyona. The spell makes Alyona undergo a severe personality change, become unable to control her actions, and forget about Ivan. Ivan and Alyona's friends must figure out a way to break the curse while simultaneously protecting the institution's latest research development, a magic wand.","charodei":"Film DVD cover","release_dates":"1982","Production":"The film was initially written by brothers Boris and Arkady Strugatsky as adaptaion of their science fantasy novel Monday Begins on Saturday. But Bromberg turned down the script due to its serious tone and social commentary. Strugatskies had to rewrite their script as a light-hearted romantic comedy. As a result, movie bore almost no resemblance to the book besides the setting and several characters' names. History later repeated with another film by Sokurov \"Days of Eclipse\" (Dni zatmeniya).Film became a classic Soviet New Year's Eve romantic comedies, such as Irony of Fate (Ironiya sud'by) and The Carnival Night (Karnavalnaya noch).","running_time":"160 min","language":"Russian","Film soundtrack":"Film soundtrack includes many classical Soviet songs (some of them romantic), written by Yevgeni Krylatov and Leonid Derbenyov, including:Music performance by State Symphony Orchestra of Cinematography of the USSR.","music_by":"Yevgeni Krylatov","written_by":"Arkady Strugatsky Boris Strugatsky","production_company":"Odessa Film Studio"}