{"based_on":"Nothing Lasts Forever  by Roderick Thorp","Cast":"Additional cast includes Hans's henchmen: Bruno Doyon as Franco, Andreas Wisniewski as Tony, Joey Plewa as Alexander, Lorenzo Caccialanza as Marco, Gerard Bonn as Kristoff, Dennis Hayden as Eddie, Al Leong as Uli, Gary Roberts as Heinrich, Hans Buhringer as Fritz, and Wilhelm von Homburg as James. Robert Davi and Grand L. Bush appear as FBI Special Agent Big Johnson and Agent Little Johnson, respectively, Tracy Reiner appears as Thornburg's assistant, and Taylor Fry and Noah Land make minor appearances as McClane's children Lucy McClane and John Jr.","country":"United States","die_hard":"Theatrical release poster","distributed_by":"20th Century Fox","screenplay_by":"Jeb Stuart|Steven E. de Souza|","Legacy":"The film spawned four sequels: Die Hard 2 (1990), Die Hard with a Vengeance (1995), Live Free or Die Hard (2007), and A Good Day to Die Hard (2013). In July 2007, Bruce Willis donated the undershirt worn in the film to the National Museum of American History at the Smithsonian Institution.[29] The film's title and its story of a lone hero battling a multitude of single-minded opponents in an isolated setting also became a common descriptor for later action films: \"Die Hard on a _____\" became a simple and easy way to define the plot of many action films that came in its wake. For example, the 1992 film Under Siege was referred to as \"Die Hard on a battleship\", the 1992 film Passenger 57 was nicknamed \"Die Hard on a plane\", the 1994 film Speed was called \"Die Hard on a bus\",[30] and the 1996 film The Rock was dubbed \"Die Hard on an island\".[31] The 2013 films Olympus Has Fallen and White House Down were dubbed \"Die Hard in The White House\",[32][33] and even television shows, such as the Star Trek: The Next Generation episode \"Starship Mine\", which was described as \"Die Hard in space\".[34]In 2001, Die Hard was listed at #39 on AFI's 100 Years... 100 Thrills, a list America's most heart-pounding films.[35] In 2003, Hans Gruber was listed at #46 on the AFI's 100 Years... 100 Heroes and Villains list.[36] Additionally, the film received nominations for AFI's 100 Years lists between 1998 and 2007, including AFI's 100 Years...100 Movies (1998),[37] John McClane in the hero category on AFI's 100 Years...100 Heroes & Villains,[38] McClane's line \"Yippie-ki-yay, motherfucker!\" for AFI's 100 Years...100 Movie Quotes,[39] and the film was again nominated for the tenth anniversary edition of AFI's 100 Years...100 Movies.[40] It was also selected by Empire magazine as #29 on their \"500 Greatest Movies of All Time\" list.[41]In 2006, Gruber was listed as the 17th greatest film character by Empire magazine.[11] John McClane was placed at number 12 on the same list.[42] In the June 22, 2007 issue of Entertainment Weekly it was named the best action film of all time.[43] McClane's catchphrase \"Yippee-ki-yay, motherfucker\" was voted as #96 of \"The 100 Greatest Movie Lines\" by Premiere magazine in 2007.[citation needed] In 2010, Die Hard was voted by Empire magazine as \"The Greatest Christmas Film of All Time\".[44] In 2012, IGN also listed it at the top spot on their list of the \"Top 25 Action Movies\".[citation needed]","Plot":"On Christmas Eve, New York City Police Detective John McClane arrives in Los Angeles. He aims to reconcile with his estranged wife, Holly, at the Christmas party of her employer, the fictional Nakatomi corporation. McClane is driven to the party by Argyle, an airport limousine driver. While McClane changes clothes, the party is disrupted by the arrival of Hans Gruber and his heavily armed terrorists: Karl, Franco, Tony, Theo, Alexander, Marco, Kristoff, Eddie, Uli, Heinrich, Fritz, and James. The group seizes the tower and secures those inside as hostages, except for McClane, who manages to slip away.Gruber singles out Nakatomi executive Joseph Takagi, and says he intends to teach the corporation a lesson for its greed. Away from the hostages, Gruber interrogates Takagi for the code to the building's vault. Gruber admits that they are using terrorism as a distraction while they attempt to steal $640 million in bearer bonds in the vault. Takagi refuses to cooperate and is murdered by Gruber. McClane, who has been secretly watching, accidentally gives himself away and is pursued by Tony. McClane manages to kill Tony, taking his weapon and radio, which he uses to contact the Los Angeles Police Department (LAPD). Sgt. Al Powell is sent to investigate. Gruber sends Heinrich and Marco to stop McClane, who kills them both. Powell, having been greeted by Eddie, who poses as a concierge, finds nothing strange about the building. As Powell turns to leave, McClane drops Marco's corpse onto his patrol car. After being fired upon by the terrorists, Powell summons the LAPD who surround the building. McClane takes Heinrich's bag containing C-4 explosives and detonators.A SWAT team assaulting the building is driven off by gunfire from Uli and Eddie. James and Alexander use anti-tank missiles to knock out the SWAT Greyhound armored car but before they can finish its destruction, they are killed when their building floor is blown up by C-4 that McClane dropped down the elevator shaft. Holly's coworker Harry Ellis attempts to mediate between Hans and McClane for the return of the detonators. McClane refuses to return them, causing Gruber to murder Ellis. While checking the explosives attached to the roof, Gruber is confronted by McClane. Gruber passes himself off as an escaped hostage and is given a gun by McClane. Gruber attempts to shoot McClane but finds that the gun is unloaded. Before McClane can act, Karl, Franco, and Fritz arrive. McClane kills Fritz and Franco, but is forced to flee, leaving the detonators behind.FBI agents arrive and take command of the police situation outside, ordering the building's power be shut off. The loss of power—as Gruber had anticipated—disables the vault's final lock. Gruber demands that a helicopter arrive on the roof for transport, and the FBI prepare to double-cross him by sending helicopter gunships to take down the terrorists (while accepting the death of some hostages). However, McClane discovers that Gruber's true intention is to detonate the explosives on the roof, to fake the deaths of his men and himself so they can escape with the bearer bonds, a plan that would also kill the hostages. Meanwhile, Gruber sees a news report by intrusive reporter Richard Thornburg that features McClane's children, and deduces that McClane is Holly's husband. The criminals order the hostages to the roof, but Gruber takes Holly with him to use against McClane. McClane defeats Karl in a fight and heads to the roof. He kills Uli and sends the hostages back downstairs before the explosives detonate, destroying the roof and the FBI helicopter.Theo goes to the parking garage to retrieve their getaway vehicle but is knocked unconscious by Argyle who had been trapped in the garage during the siege. A weary McClane finds Holly with Gruber and his remaining men and knocks Kristoff unconscious. McClane surrenders his machine gun to spare Holly, but then distracts Gruber and Eddie by laughing, allowing him to grab a concealed handgun (holding his last two bullets) taped to his back. McClane shoots Gruber in the shoulder and then kills Eddie with his final shot. Gruber crashes through a window, and while he momentarily saves himself by grabbing Holly's watch, McClane removes it and Gruber falls to his death.McClane and Holly are escorted from the building and meet Powell in person. Karl emerges from the building disguised as a hostage and attempts to shoot McClane, but is gunned down by Powell. Argyle crashes through the parking garage door in the limo. Thornburg arrives and attempts to interview McClane, but is punched by Holly. McClane and Holly are driven away by Argyle.","language":"English","box_office":"$140.8 million[2]","cinematography":"Jan de Bont","directed_by":"John McTiernan","production_companies":"Gordon Company Silver Pictures","Music":"Beethoven's 9th Symphony is featured prominently in Michael Kamen's score throughout the film, in many guises and variations (mostly as a leitmotif for Gruber and the terrorists), and thematic variations on \"Singin' in the Rain\" are also featured, as the theme for the character Theo. McTiernan said that he incorporated those themes into the film's soundtrack as an homage to Stanley Kubrick's A Clockwork Orange (which featured both pieces of music). Basing his score around thematic variations on well-known pieces is a conceit that Kamen previously used in Brazil. Bach's Brandenburg Concerto No. 3 is playing during the party sequence near the film's beginning.As the film has a Christmas setting, the score also features sleigh bells in some cues, as well as the Christmas pop standard \"Winter Wonderland\". Two 1987 pop songs are used as source music: near the film's beginning, limousine driver Argyle plays the rap song \"Christmas in Hollis\", performed by Run–D.M.C., and later, while talking on the phone in the limousine, Argyle is listening to Stevie Wonder's \"Skeletons\". The end credits of the film begin with the Christmas song \"Let It Snow! Let It Snow! Let It Snow!\" (performed by Vaughn Monroe) and continues/concludes with Beethoven's 9th Symphony.The film's final four minutes were tracked with music from two other Twentieth Century Fox features – these were 'temp tracks' which the studio ultimately decided to leave in the film. The music heard when McClane and Powell see each other for the first time is from John Scott's score for the 1987 film Man on Fire. When Karl appears with his rifle, McTiernan decided that he did not like Kamen's produced music for the scene and chose to use a piece of temporary score that the production had purchased. The piece was actually unused score composed by James Horner for the 1986 science fiction action film Aliens.[12]Similarly to Aliens, the score by Michael Kamen was heavily edited, with music samples looped over and over and cues added to scenes. The most notable example is the \"brass blast\" heard when John slams the chair at the window as he confronts Marco, then Heinrich appears and he kills him, and later when Hans Gruber falls to his death.[26]The score as heard in the film was released by Varèse Sarabande in February 2002, but was limited to 3000 copies.[27] It was subsequently reissued by La-La Land Records in November 2011, in a two-disc limited edition of 3500 copies.[28] In addition to the Kamen score, this release also includes the Monroe and Beethoven end credits pieces, Run-D.M.C.'s \"Christmas in Hollis,\" and the John Scott track from Man on Fire.","release_dates":"July 12, 1988 (1988-07-12) (Los Angeles)|July 15, 1988 (1988-07-15) (United States)||||","Production":"The Detective, the 1968 movie based on Roderick Thorp's first novel, was a box-office success. When Thorp wrote the sequel, the studio was contractually obliged to offer Sinatra the lead role. Sinatra, then in his early 70s, turned down the project. The story was then changed to have no connection to The Detective, and instead pursued as a sequel to the 1985 Arnold Schwarzenegger-starring action film Commando, but Schwarzenegger was not interested in reprising his role. The script was offered to a variety of action stars, including Sylvester Stallone, Harrison Ford, and Don Johnson, all of whom turned it down.[6] Writer de Souza stated in March 2015 that all claims that Die Hard was meant to be a sequel to Commando are baseless.[7] De Souza has said he wrote the script as if Hans Gruber was the protagonist. \"If he had not planned the robbery and put it together, Bruce Willis would have just gone to the party and reconciled or not with his wife. You should sometimes think about looking at your movie through the point of view of the villain who is really driving the narrative.”[8]Willis was paid $5 million to star in the film, a figure virtually unheard of at the time for an actor who had starred in only one moderately successful film, and normally paid to the major stars of the time, such as Dustin Hoffman and Warren Beatty. Then-20th Century Fox president Leonard Goldman justified the cost, stating the film was reliant on its lead actor, while other sources within the studio would state that Fox was desperate for a star for Die Hard, intended to be its big summer action blockbuster, and they had already been turned down by several actors, including Richard Gere, Clint Eastwood,[9] and Burt Reynolds.[10] At the time, Willis was largely known for his comedic role as detective David Addison on the television series Moonlighting, and the studio did not believe in his action star appeal. The marketing campaign's initial billboards and posters reflected this, and Willis' face was not a focal point.[6] Die Hard was Rickman's first feature film role.[11]Director John McTiernan did not want the villains to be terrorists, considering them too mean. He chose to avoid the terrorists' politics in favor of making them thieves in pursuit of monetary gain, believing it would make the film more suitable for summer entertainment. The film's ending had not been finalized by the time filming had begun; one result is that the truck depicted as transporting the terrorists to the building is too small to house the ambulance that was later revealed to be inside it. Other scenes also lacked context: De Govia had built the building's computer room before they knew what it would be used for. Likewise, the character of McClane had not been fully realized until almost halfway through production, when McTiernan and Willis decided that he was a man who did not like himself very much, but was doing the best he could in a bad situation. In the original script, Die Hard took place over three days, but McTiernan was inspired to have it take place over a single night by Shakespeare's A Midsummer Night's Dream.[12]The corporate headquarters of 20th Century Fox, Fox Plaza in Century City, serves as the film's setting, providing both external and internal scenes. At the time of filming, the building was still under construction, and a scene of McClane exploring an unfinished floor complete with construction equipment was real. Production designer Jackson De Govia came up with the idea to use the building. The Nakatomi building's 30th floor, where the hostages are held, was a recreation of Frank Lloyd Wright's Fallingwater, including a large rock with water dripping from it. Govia's inspiration came from Japanese corporations of the time buying up American products, rationalizing that they had bought Fallingwater and reassembled it in their own building. The building's logo originally was too reminiscent of a Swastika for McTiernan. The final design is closer to a Samurai warrior's helmet. A 380 foot long background painting provided the city backdrop viewed from inside the Nakatomi building's 30th floor. It featured animated lights and other lighting techniques to present both moving traffic and day and night cycles. As of 2011, the painting is still in Fox's inventory and is sometimes used in other films. The scene in which the SWAT Greyhound knocks over a stair railing at the front of Fox Plaza required months of negotiations with Fox to gain approval. The end helicopter scene took six months of preparation, and the production was given only two hours in which to film it. It took three attempts above Fox Plaza, nine camera crews, and everyone within 500 feet of the line of flight had to be an employee. The scene of McClane falling down a ventilation shaft and catching onto a lower opening was the result of an accident after Willis' stunt man fell. Editor Frank J. Urioste chose to use the unintentional scene in the final film.[12]Alan Rickman was dropped 70 feet (21 m) on a green screen set for his death scene. The shot used was the first take, and sooner than Rickman was told he would be dropped, so the look of fear on Rickman's face was genuine.[12] The DVD text commentary track reveals that the shooting script did not originally feature the meeting between McClane and Gruber pretending to be a hostage; it was only written in when it was discovered that Rickman could perform a convincing American accent.","produced_by":"Lawrence Gordon|Joel Silver|","starring":"Bruce Willis|Alan Rickman|Alexander Godunov|Bonnie Bedelia|","running_time":"132 minutes[1]","music_by":"Michael Kamen","edited_by":"Frank J. Urioste|John F. Link|","Release":"The premiere of Die Hard took place on July 12, 1988, at the AVCO theater in Los Angeles, California.[13]Die Hard opened in limited release in 21 theaters on July 15, 1988, earning $601,851—an average of $28,659 per theater. The film began a wide release in North America on July 22, 1988, earning approximately $7.1 million from 1,276 theaters—an average of $5,568 per theater—finishing as the weekend's number three film. By the time Die Hard ended its theatrical run, it had earned $83 million in North America and a further $57.7 million from markets elsewhere, totaling $140.7 million.[2]Die Hard received positive reviews from critics. English film critic Mark Kermode expressed admiration for the film, calling it an exciting setup of \"Cowboys and Indians in The Towering Inferno.\" However, Roger Ebert gave it a less than flattering review, rating it a mere two stars and criticizing the stupidity of the deputy police chief character, claiming that \"all by himself he successfully undermines the last half of the movie.\"[14]Contemporary analysis by review-aggregation websites Rotten Tomatoes and Metacritic provides a positive reception. The film garnered a 92% approval rating from 64 critics—an average rating of 8.4 out of 10—on Rotten Tomatoes, which said, \"Its many imitators (and sequels) have never come close to matching the taut thrills of the definitive holiday action classic.\"[15] Metacritic provides a score of 70 out of 100 from 13 critics, which indicates \"generally favorable\" reviews.[16]Some critics have ranked the film on respective lists of the all-time best Christmas movies as the following:The film was nominated for four Academy Awards: Best Sound Editing (Stephen Hunter Flick and Richard Shorr), Best Film Editing, Best Sound Mixing (Don J. Bassman, Kevin F. Cleary, Richard Overton and Al Overton, Jr.) and Best Visual Effects (Richard Edlund, Al Di Sarro, Brent Boates and Thaine Morris.)[24] Michael Kamen's score earned him a BMI TV/Film Music Award in 1989.[25]","budget":"$28 million[2]"}