{"country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Ivan Goff Larry Marcus Ben Roberts","story_by":"Larry Marcus","Plot":"Bob Corey (Gordon MacRae) is an American soldier badly wounded at the end of World War II, and undergoing a number of surgical operations on his spine at a military hospital in California. He is tended by a nurse, Julie Benson (Virginia Mayo), and they have fallen in love. Corey's military pal, Steve Connolly (Edmond O'Brien), arrives in early November to discuss plans for the ranch they plan to purchase and operate together once Corey is out of the hospital. The two men pool their G.I. benefits (totaling $40,000) to do so. Corey's final surgery is in mid-December, but Connolly does not appear at the hospital afterward to see his friend. By Christmas, Corey is still in recovery but Connolly still remains absent. One night, as Corey lies semi-conscious in bed after being administered a sleeping drug, a woman with an foreign accent (Viveca Lindfors) appears at his bedside. She says Connolly has been in a horrible accident; his spine is shattered and he wants to die, but she has refused to help him commit suicide. The woman asks Corey what to do, and he advises her to do nothing to harm Steve, and just to wait. Corey slips into unconsciousness, and the woman disappears.After New Year's, Corey is released from the hospital. He is immediately stopped by police detectives and then questioned by Captain Garcia (Ed Begley) of the Los Angeles Police, who tells him that Connolly is wanted for the murder of Solly Blayne (Richard Rober), a local high-stakes gambler and racketeer. Corey denies that Connolly would be mixed up in anything criminal. How could he be, if he were injured? Corey and Nurse Benson decide to talk to Mrs. Blayne (Frances Robinson). The film engages in a visual flashback, which depicts an unseen assassin gunning down Solly Blayne in his home one night. Window shades prevent Mrs. Blayne or the audience from seeing the murderer, who was outside the home. Mrs. Blayne calls for a doctor, but he arrives too late.Corey learns from Garcia which hotel Connolly was staying in, and he lodges in Connolly's old room in an attempt to understand his friend's thinking and feelings. Corey encounters Sybil (Ida Moore), a gossipy old hotel maid, who says that Mr. Blayne often visited Connolly at the hotel. She also gives Corey a business card from a local funeral home. Corey visits the funeral home and discovers that another military friend, Ben Arno (Dane Clark), owns the mortuary. In another flashback, Arno describes how he went to a night of boxing matches where he saw Connolly fighting in the ring. Connolly lost his match (even though Arno does not believe he should have). Arno asks Connolly why he is boxing at his age, but Connolly refuses to explain other than to say he needs money.Corey returns to the hotel, where he is asked by the desk clerk to pay Connolly's hotel bill. Realizing Connolly made some local phone calls, Corey dials the numbers listed in the hotel records. A young woman answers the phone. Corey pretends to be Connolly and the voice on the phone unintentionally reveals Connolly had a girlfriend named Lysa Radoff. Corey asks for and is given the address of Radoff's rented home. Corey goes to Radoff's home, finds no one home, breaks in, and discovers that Radoff is the same woman who visited him in the hospital. One of Radoff's roommates, Bonnie Willis (Sheila MacRae), comes home. Corey pretends to be waiting for Radoff to arrive, and the chatty Willis provides him with the story of how Connolly and Radoff met.In yet another flashback, the audience learns that Connolly was working for a local gambler named Lou Walsh. Walsh's girlfriend was Lysa Radoff. One night, Connolly went to a nightclub to pick up Radoff and bring her to a party Walsh was hosting. Willis went along with them to the party. The three went to a large apartment Walsh was using as a high-stakes gambling den. Walsh entertains his guests by having beautiful women act as call girls; Radoff is one of the call girls. (Due to the prevalent censorship of the time, this is all handled very gingerly.) Connolly, unlike the other men, never paws and manhandles the girls, and he and Radoff fall in love. Pointedly, the flashback never shows Lou Walsh. Connolly is depicted meeting Solly Blayne, who is there gambling. Blayne offers Connolly a job as a highly paid gofer. The flashback ends. To escape further questioning, Corey runs out of the house while Willis is in the kitchen. Moments later, she is gunned down by an unseen assailant who fires through the window.The next night, Garcia interrogates Corey and Nurse Benson and accuses them of interfering in the investigation and causing Willis' death. Garcia is alerted by telephone that a local Chinese man, Lee Quong (Leonard Strong), has been shot and is claiming he has information on Steve Connolly. Garcia, Corey, and Benson race to the hospital to interrogate Quong. In another flashback, Quong relates how he was the butler and cook at a magnificent nearby home which Walsh purchased as a gift for Radoff. Walsh installed Connolly in the house as her bodyguard. Unwittingly, he put the two lovers together, and their relationship intensified. In the flashback, Quong relates that he eavesdropped on Connolly and Radoff as they made plans to run away and get married. Connolly went to the garage and backed the car up the steeply inclined driveway. Unbeknownst to Connolly, Walsh came home early and overheard Connolly professing his love to Radoff. Walsh released the parking brake on the car, and it rolled down the driveway and injured Connolly — crushing several of the vertebrae in his back. The flashback ends. Quong says he was shot by Lou Walsh after Walsh realized Quong had seen him commit murder. Quong dies before he can reveal the address of the home.Garcia now has evidence that Connolly was physically incapable of committing murder. Garcia tells the press that the murder weapon used to kill Solly Blayne was also used to kill Bonnie Willis. Acting on a hunch, Nurse Benson contacts Mrs. Blayne and asks her the name of the doctor she called the night her husband was murdered. Mrs. Blayne says it was Dr. Herbert Anstead. Benson (dressed in her nursing uniform) goes to Dr. Anstead's office later that night, pretending to be a nurse retrieving some files for the doctor. The janitor lets her in. She is unable to locate Connolly's medical file. Anstead (Mack Williams) himself arrives a few minutes later, and Nurse Benson hides. Anstead retrieves Connolly's file from its hiding place, and attempts to destroy it. Nurse Benson prevents him from doing so, [clarification needed] and tells him Connolly was not in an accident but was a victim of attempted murder. Anstead forces Benson into a locked room. Using information obtained from Benson, Anstead calls Bob Corey to tell him where Connolly can be located, and Benson overhears the address. Just then, Lou Walsh (not shown on screen) enters the office and guns down Anstead. Walsh flees, and Nurse Benson is released minutes later by the janitor.Corey rushes to the address Dr. Anstead gave him, which the audience realizes is the home Lou Walsh purchased for Lysa Radoff. Corey is intercepted inside the house by Ben Arno, who reveals that he is, in fact, the gambler Lou Walsh. Arno tells Corey that Connolly (a known small-time gambler) had lost money to Solly Blayne. To get the money back, Connolly agreed to box and throw the fight to get out of debt. Arno told Connolly that he led a double-life as the high-stakes gambler \"Lou Walsh\", and proposed using Connolly's $40,000 to cheat Blayne out of tens of thousands of dollars at gambling. Connolly agreed. In yet another flashback, Radoff realizes that the brakes on her car work just fine, and that Connolly's injuries were no accident. She attempts to leave, but Walsh strangles her. The flashback ends. Arno tells Corey he did not want to martyr Connolly for fear of losing Radoff's love, so he staged the accident. But once Radoff knew the truth, he was forced to kill her. Arno admits he began killing anyone who could connect Lysa to him or who knew about Connolly's accident. Corey (still weak from his back surgery) is knocked to the ground and Arno prepares to shoot him. As Arno is about to kill Corey, an injured Connolly (his body encased in braces and plaster) launches himself down the stairs and stops Arno. The police, summoned by Nurse Benson, arrive. Arno attempts to flee, but is killed.After a jump cut, Connolly is shown leaving the military hospital many months later, his injuries repaired by military surgeons. Bob Corey and his new wife, Julie, arrive and take Steve to their ranch.","language":"English","Reception":"Although the film was completed in October 1948, it was not released until 1950. The film opened at The Globe cinema in New York City, New York, on January 26, 1950.[1] White Heat, starring James Cagney, Edmund O'Brian, and Virginia Mayo, had been released to widespread acclaim and strong box office while Backfire remained unreleased. To take advantage of White Heat's popularity, movie posters for Backfire prominently featured Mayo in a femme fatale pose (very unlike her character in the film) and contained the tag-line: \"That 'White Heat' girl turns it on again!\" The poster also gave away the surprise conclusion to the film by depicting Dane Clark strangling Viveca Lindfors.[citation needed]The picture did not receive good reviews. Bosley Crowther, writing for the New York Times, found the film feeble and listless, and the plot rambling.[12] He had little praise for the cast, concluding \"...the most that can possibly be said for them is that they get the thing done.\"[12] Leslie Halliwell, writing in 1977, noted that the flashback structure, intended to solve some of the expository problems in the film, did not work.[13] Author Clive Hirschhorn noted in 1980 that there were so many coincidences in the film that any feeling of suspense was eliminated and the realism so essential to film noir dissipated.[14] Critic John Howard Reid assessed the film as \"borderline\" in 2006, but felt cinematography was effectively atmospheric and the action sequences fair.[15] He found that the supporting players (O'Brien, Begley, Lindfors, Clark, and Sheila MacRae) delivered performances remarkably superior to that of the two stars, and singled out Lindfors for her acting.[15]Some reviewers singled out the script as the underlying cause of the acting problems. Reid thought Mayo's part too slim, and that it had been improperly built up by the script and editing to accommodate a star of her stature.[16] David Shipman felt Gordon MacRae was \"wasted\" in the picture.[17]Swedish actress Viveca Lindfors was under contract to Warner Bros. for four pictures. Unhappy with her work, however, the studio declined to pick up her option after her performance in Backfire.[18] Warners was much more pleased with the efforts of Goff and Roberts, and gave them a five-year contract to write screenplays.[5] They produced White Heat the following year. In return for directing Backfire, Jack Warner permitted Vincent Sherman to direct The Hasty Heart,[19] which became a major hit for the studio.","backfire":"Theatrical release poster","cinematography":"Carl E. Guthrie","production_company":"Warner Bros.","directed_by":"Vincent Sherman","Home media":"The film was regularly screened on broadcast television in the United States in the 1950s and 1960s, although most airings trimmed Mayo's part substantially.[16] Warner Bros. released the film on DVD on July 13, 2010, in its Film Noir Classic Collection, Vol. 5.[20]","release_dates":"January 26, 1950 (1950-01-26) (New York City)|||||","Production":"Around 1946 or 1947, Warner Bros. had purchased the rights to a Larry Marcus story titled \"Into the Night.\"[2][3] The studio tried to interest director Vincent Sherman in directing the picture, but he felt the story was \"confused and pointless\" and refused.[2] One of the story's problems was that it contained flashback within flashback within flashback.[4] By the spring of 1948, however, Sherman finished directing Adventures of Don Juan with Errol Flynn and Viveca Lindfors, and wanted to work on a simple picture. He knew that Warner Bros. had the rights to John Patrick's play, The Hasty Heart. Sherman asked studio head Jack L. Warner if he could turn the play into a film, but Warner refused and put him to work on adapting \"Into the Night\" into a motion picture.[2]Sherman met with producer Anthony Veiller, who admitted the story needed a lot of work.[2] Veiller hired two aspiring writers, Ivan Goff and Ben Roberts. The two unpublished authors had written a popular play, Portrait in Black (later made into a motion picture of the same name in 1960), as well as an unpublished screenplay, The Shadow, based on a Ben Hecht story. Although Goff and Roberts considered themselves comedy writers, Warners hired them to work on the crime story \"Into the Night.\"[5] Sherman met with Goff and Roberts over the weekend, and they talked through the story's problems. Sherman concluded that the film was still unworkable, but Goff and Roberts said they needed the work and continued to craft a screenplay. Sherman voiced his reservations to Jack Warner, but Warner told him if he agreed to do the film then Warner would do him a favor in return.[2] Sherman agreed.Jack Warner intended for the film to be a B movie which would put his contract actors to work.[2] Warner had six actors who, he felt, were \"sitting around doing nothing but picking up their checks\": Edmond O'Brien, Gordon MacRae, Virginia Mayo, Dane Clark, Viveca Lindfors, and Richard Rober.[6] Warners had signed Broadway star Gordon MacRae to a short-term contract in November 1947.[7] The studio announced his first film was to be a musical film, Rise Above It (a remake of the 1938 film Brother Rat which would be scripted by I. A. L. Diamond). But this film was never made. \"Into the Night\" would be his first film for the studio. Edmond O'Brien signed a contract with Warners in May 1948.[8] \"Into the Night\" would also be his first film for the studio. Lindfors refused at first to participate in the film, upset with what she felt was its excessive violence. Placed on suspension by the studio, she relented to continue to receive her pay (\"I sold out,\" she later said).[9]The shooting title of the film was changed from Into the Night to Somewhere in the City.[3] Principal filming occurred from late July to mid October 1948. Interior and exterior hospital scenes were shot at Birmingham Veterans' Hospital in Van Nuys, California.[10] Birmingham's Chief of Nursing Services Monica Cahill and Assistant Chief of Surgery Dr. Franklin Wilkins both served as technical consultants on the film.[10] Additional scenes were filmed in and around the city of Los Angeles, California, included the Los Angeles City Hall, the Fremont Hotel, the Biltmore Hotel, Olvera Street, the Los Feliz neighborhood, and Stone Canyon in the Bel Air neighborhood. Additional scenes were shot in the nearby city of Glendale, California.[10] Sherman later said that he believed Goff and Roberts had turned in a good script, and that the actors had done the best job they could.[11] He found Mayo to be a very nice person and an extremely competent actress, but without a lot of personal depth.[4]","produced_by":"Anthony Veiller","starring":"Edmond O'Brien Virginia Mayo Gordon MacRae Dane Clark Viveca Lindfors","running_time":"91 minutes","music_by":"Daniele Amfitheatrof","edited_by":"Thomas Reilly"}