{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Cliff Ruby & Elana Lesser|David Steven Cohen|Roger S.H. Schulman|","story_by":"Cliff Ruby & Elana Lesser","Plot":"In New York City, an elderly woman and her granddaughter are walking through Central Park, looking for a memorial statue. As they seat themselves for a rest, the grandmother tells a story about Nome, Alaska back in 1925, which shifts the film from live-action to animation.Balto, a wolfdog hybrid, lives on the outskirts of Nome with his adoptive father, a snow goose named Boris, and two polar bears, Muk and Luk. Being half-breed, Balto is ridiculed by dogs and humans alike. His only friend in town is a red husky named Jenna who Balto has a crush on and is challenged by the town's favorite sled dog, Steele, a fierce and arrogant Alaskan Malamute.That night, all the children, including Jenna's owner, Rosie, fall ill with diphtheria. Severe winter weather conditions prevent medicine from being brought by air or sea, and the closest rail line ends in Nenana. A dog race is held to determine the best-fit dogs for a sled dog team to get the medicine. Balto enter and wins, but Steele exposes his wolf-dog heritage, resulting in him being disqualified. The team departs that night with Steele in the lead and picks up the medicine successfully, but on the way back, conditions deteriorate and the disoriented team ends up stranded at the base of a steep slope with the musher knocked unconscious.When the word reaches Nome, Balto sets out in search of them with Boris, Muk and Luk. On the way, they are attacked by a huge grizzly bear, but Jenna, who followed their tracks, intervenes. The bear pursues Balto out onto a frozen lake, where it falls through the ice and drowns, while Muk and Luk save Balto from a similar fate. However, Jenna got injured and cannot continue on. Balto instructs Boris and the polar bears to take her back home while he continues on alone. Balto eventually finds the team, but Steele does not want his help and attacks him until he loses his balance and falls off a cliff. Balto takes charge of the team, but Steele, refusing to concede defeat, throws them off the trail and they lose their way again. While attempting to save the medicine from falling down a cliff, Balto himself falls.Back in Nome, Jenna is explaining Balto's mission to the other dogs when Steele returns, claiming the entire team, including Balto, is dead. However, Jenna sees through his deception and assures Balto will return with the medicine. Using a trick Balto showed her earlier, she places broken colored glass bottles on the outskirts of town and shines a lantern on them to simulate the lights of an aurora, hoping it will help guide Balto home. When Balto regains consciousness, he is ready to give up hope, but when a large, white wolf appears and he notices the medicine crate still intact nearby, he realizes that his part-wolf heritage is a strength, not a weakness and drags the medicine back up the cliff to the waiting team. Using his advanced senses, Balto is able to filter out the false markers Steele created.After encountering further challenges, and losing only one vial, Balto and the sled team finally make it back to Nome. A pity-playing Steele is exposed as a liar and abandoned by the other dogs, ruining his reputation. Reunited with Jenna and his friends, Balto earns respect from both the dogs and the humans. He visits a cured Rosie, who thanks him for saving her. Back in the present day, the elderly woman and her granddaughter finally found the memorial commemorating Balto, and she explains that the Iditarod trail covers the same path that Balto and his team took from Nenana to Nome. The woman, who is actually Rosie, repeats the same line, \"Thank you, Balto. I would have been lost without you,\" before walking off to join her granddaughter and her Siberian Husky, Blaze. The Balto statue stands proudly in the sunlight.","language":"English","box_office":"$11.3 million[1]","cinematography":"Jan Richter-Friis","production_company":"Amblin Entertainment Amblimation","directed_by":"Simon Wells","Soundtrack":"Balto: Original Motion Picture Soundtrack is the soundtrack of the film, composed by James Horner.[12]","narrated_by":"Miriam Margoyles","release_dates":"December 22, 1995 (1995-12-22)|||||","produced_by":"Steve Hickner","starring":"Kevin Bacon|Bridget Fonda|Phil Collins|Bob Hoskins|Jim Cummings|Juliette Brewer|Robbie Rist|Danny Mann|Jack Angel|Sandra Dickinson|Miriam Margoyles (live-action sequences)|Lola Bates-Campbell (live-action sequences)|","running_time":"77 minutes","balto":"Theatrical release poster by John Alvin.","Sequels":"Two direct-to-video sequels of the film followed, made by the Universal Cartoon Studios. The first, Balto II: Wolf Quest, was released in 2002 and follows the adventures of one of Balto and Jenna's pups, Aleu, who sets off to discover her wolf heritage.[14] The second, Balto III: Wings of Change, was released in 2004. The storyline follows the same litter of pups from Balto II but focuses on Kodi as part of a U.S. Mail dog sled delivery team.[15] Unlike the original, neither films took any historical references from the true story of Balto.","music_by":"James Horner","edited_by":"Renee Edwards|Nick Fletcher and Sim Evan-Jones (supervising editors)|","Release":"The film was theatrically released in the United States on December 22, 1995 and then international theatres on January 13, 1996 when it first premiered in Brazil.[2] Its release was vastly overshadowed by the performance of Disney•Pixar's Toy Story. But the film did end up recouping its small budget and did modest business at the box office.[3]The film ranked 15th on its opening weekend and earned $1,519,755 from a total of 1,427 theatres.[9] The film also ranked 7th among G-rated movies in 1995. Total domestic gross reach up to $11,348,324.[3] While the film was not as successful at the box office, it was far more successful in terms of video sales. These strong video sales led to the release of two direct-to-video sequels: Balto II: Wolf Quest and Balto III: Wings of Change being created, though neither sequel received as strong a reception as the original film.The film received mixed reviews upon release. According to review aggregator website Rotten Tomatoes, it holds a 50% rating based on 24 reviews. The site's critical consensus reads: \"The animation is great, but Balto's details and its plot are so-so\".[10] Film critic Roger Ebert gave the film a positive review, describing the film as \"a kids' movie, simply told, with lots of excitement and characters you can care about\". He gave the film 3 out of 4 stars. However, others, such as Susan Wloszczyna of USA Today, criticised the film for its lackluster voice work, particularly from Bacon, and its story.[11] Despite the mixed response, the film has garnered a strong cult following on the internet and is generally considered to be a cult classic by animation fans. Another review aggregator, Metacritic, calculated an average score of 52/100 based on 10 reviews, indicating \"mixed or average reviews\"."}