{"country":"United States","distributed_by":"Palm Pictures","language":"English","Critical reception":"The film was generally very well-received critically. It currently has an approval rating of 90% on review aggregator website Rotten Tomatoes, based on 69 reviews.[7] BBC Movies called it \"Erratic, tragic, and absolutely hilarious: Dig! is fantastic filmmaking\" that \"works as both a savagely funny rockumentary and a sardonic comment on the politics of selling out.\"[8] Empire gave the film five stars out of five.[9]Allmovie, while giving the film a generally positive review, criticized the film's emphasis, writing \"DIG! isn't as concerned with differences in the groups' musical styles (few songs are heard for more than a few bars at a time) as it is with personalities and interpersonal conflict. In this regard, it echoes the purportedly superficial concerns of the fickle industry it depicts, and it's not entirely clear whether this is Timoner's intent [...] In the end, the music should matter more than it apparently does.\"[10]PopMatters gave the film a mixed review, commenting that \"The film is less effective at conveying the genius of Anton Newcombe than the madness, possibly because the latter only requires a camera and Anton himself\" but ultimately called it \"fascinating\" as a \"behind-the-music-scenes glimpse\".[11]","box_office":"$127,067[1]","cinematography":"Vasco Nunes David Timoner Ondi Timoner","production_company":"Interloper Films Celluloid Dreams","dig!":"Theatrical release poster","directed_by":"Ondi Timoner","Band member reactions":"Taylor-Taylor, Newcombe and Warhols guitarist Peter Holmstrom have all criticized the film as being unfair in its portrayal of Newcombe and The Brian Jonestown Massacre.[2][3][4] On The Brian Jonestown Massacre's official website the film was denounced as reducing several years of hard work to \"at best a series of punch-ups and mishaps taken out of context, and at worst bold faced lies and misrepresentation of fact.\"[5] Courtney Taylor-Taylor said in an interview: \"It's a movie, not a documentary [...] She worked her ass off and forged a plot when there was no plot. She crafted the thing to swell and ebb by taking eight years of us and a year and a half of the Brian Jonestown Massacre\".[6] Holmstrom was generally displeased with the film initially, citing Timoner's use of footage that he claims \"was not to be used\" as a reason, but has maintained that \"it's still a good film\", though one \"I would have done differently\".[4] Dandy Warhols drummer Brent DeBoer noted the film could have easily been a \"feel-good story\", but instead a few rare moments were specifically chosen to give the film a \"Jerry Springer\"-type storyline.[3]The story also leaves one with the impression, by using Courtney as a voice over, that The Brian Jonestown Massacre were no longer a band. There was no update regarding Anton at the time of release.","release_dates":"18 January 2004 (2004-01-18)|||||","produced_by":"Ondi Timoner","starring":"Anton Newcombe Courtney Taylor-Taylor","running_time":"107 min.","edited_by":"Ondi Timoner","written_by":"Ondi Timoner"}