{"country":"United States","distributed_by":"Columbia Pictures","Plot":"On May 26, 1987, Jenna Rink, an unpopular girl, celebrates her 13th birthday. She wants to join the \"Six Chicks\", a clique led by Lucy \"Tom-Tom\" Wyman. Before her birthday party, Jenna's best friend Matty Flamhaff gives her a doll dream house that he built for her and a packet of \"magic wishing dust\", which he sprinkles on the house.The Six Chicks show up at Jenna's party where they play a practical joke on her during a game of \"Seven Minutes in Heaven\". Jenna, mistakenly thinking Matt was responsible, barricades herself in the closet where she put the Dream House. She cries and rocks backs and forth, bumping into the wall, wishing to be \"30, flirty, and thriving\". The wishing dust from the dollhouse sprinkles on her, causing her to fall asleep. The next morning, Jenna awakens as a 30-year-old woman living in a Fifth Avenue apartment. It is now 2004, and Jenna has no memory of the 17 years that have passed since her 13th birthday.30-year old Jenna's best friend, Lucy, drives her to her work office, where Jenna discovers that she works for Poise, her favorite fashion magazine from when she was a teenager. Missing her best friend from 1987, Jenna asks her assistant to track down Matt. Jenna learns she and Matty have been estranged since high school when Jenna fell in with the in-crowd and became best friends with Tom-Tom, her real name Lucy. Matt is now a struggling photographer who's engaged.After Jenna overhears Lucy badmouthing her to a co-worker, she realizes that what she thought she wanted wasn't important. She lost almost all contact with her parents and is having an affair with the husband of a colleague. She is hated by her co-workers and is suspected of giving her magazine's ideas to a rival publication, Sparkle. Jenna realizes that the person she became is neither trustworthy nor likable and begins to reverse the situation by distancing herself from her boyfriend.She heads back to her hometown in New Jersey and hides in the same closet as 17 years before and cries. Her parents return and find her hiding, and they welcome her. The next day, she reminisces by looking through school yearbooks and other items from her school days and catches up on the 17 years she doesn't remember. Over several outings and working together on a magazine project, Jenna becomes friends with Matt again and they kiss.After arranging a magazine photo shoot with Matt, then making a presentation for a revamp for Poise, Jenna gets bad news from the publisher: Poise is shutting down because the work she put into the relaunch ended up in Sparkle. Jenna learns from Lucy that she was responsible for sabotaging Poise by sending their material to Sparkle for months. When Lucy had learned this, she had conned Matt into signing over the photo rights from the relaunch shoot to her. Lucy was given the position of Sparkle editor-in-chief instead of Jenna.When Jenna remembers that Matt is getting married that day, she rushes to his house and begs him to call off the wedding. Matt realizes he loves Jenna but cannot change the past. From his closet, he pulls the \"dream house\" he made 17 years before, and Jenna asks for it back. Jenna leaves in tears, crying over the dream house. Jenna hears wedding bells, implying that Matt has already married.Specks of wishing dust remain on the dream house and she wishes to be 13 again. When she opens her eyes, she finds herself back in 1987. When Matt comes to check on her, she kisses him. She also tells Tom-Tom she can be the pot and kettle all by herself and ruins her outfit by spilling punch on it. Jenna and Matt are shown getting married and moving into a house which resembles the dollhouse.","language":"English","Release and reception":"The film opened on April 23, 2004, with an initial box office take of US$22 million in its first weekend, debuting at number 2, almost tied with Denzel Washington's thriller Man on Fire.[13] In its second week, it dropped to number 3, earning US$ 10 million.[14] In its third week, it fell to number 5, earning US$ 5.5 million.[15] In its fourth week, it took sixth place with an estimated $4.2 million.[16] In its fifth week, it only fell to number 7, with an estimated $2.5 million.[17] In its sixth week, the film fell to number 9, earning $1 million.[18] It ended with nearly $60 million at the domestic box office.[19] The same picture became one of the five biggest DVD rentals of the year, with over $57 million in rentals alone according to the Internet Movie Database. The film's success on DVD granted it a re-release (The Fun and Flirty Edition) in 2006 with special packaging. The picture grossed $96,455,697, going on to become one of the year's biggest DVD rentals and sellers.[19] The Blu-ray version of 13 Going on 30 was released on January 20, 2009.[20]The film received an approval rating of 65% on Rotten Tomatoes based on 158 reviews.[31] Owen Gleiberman of Entertainment Weekly gave the film a very positive review with a grade of \"A-\", writing \"13 Going on 30 is the rare commercial comedy that leaves you entranced by what can happen only in the movies.\"[21] Gleiberman also praised Jennifer Garner's performance, writing: \"She cuts out all traces of adult consciousness, of irony and flirtation and manipulation, reducing herself to a keen, goggle-eyed earnestness that's utterly beguiling.\"[21] Joe Leydon of Variety also praised her performance, writing \"Garner throws herself so fully and effectively into the role that in a few key scenes, she vividly conveys Jenna's high spirits and giddy pleasure through the graceful curling of her toes.\"[24] Leydon praised the director Gary Winick for \" bringing a fresh spin to most of the script's cliches and emphasizing nuggets of emotional truth provided by Goldsmith and Yuspa.\"[24] Wesley Morris of the Boston Globe wrote that \"The movie is tailor-made for women who openly lust for dream houses, dream jobs, and dream hubbies.\"[25] He also wrote that \"the best stuff involves the childhood preamble. (The young actors playing Jenna, Matt, and Lucy are terrific.) Those moments feel painfully, comically true.\"[25] Claudia Puig of USA Today gave the film 3 out of 4 stars, commenting, \"This romantic comedy is intended as a cautionary fairy tale. The silly humor works with the movie's gentle message of self-empowerment and avoids sappiness in a tender interlude where the adult Jenna returns to her childhood home. Amusing, charming and pleasantly nostalgic, 13 Going on 30 should fall easily onto moviegoers' wish lists.\"[23]Elvis Mitchell of The New York Times wrote: \"The performances give the movie more flavor and life than the situation does; it often feels like prechewed Bubble Yum. The message of the plot is that a lack of sophistication is the key to success, even at a fashion magazine that attracts readers through sexy exhibitionism. The movie would have shown some daring savvy if it had played more with the role-playing aspect of fashion spreads. Instead it is content to eat its retro snack cake and have it, too.\"[27] Andrea Gronvall of the Chicago Reader wrote that \"The formula works, thanks in large part to star Jennifer Garner, who's so radiant theaters should be stocking sunblock. Underlying the shenanigans and the pop-psychology moral—self-love is a prerequisite for true love—there's a touching wistfulness about roads not taken.\"[28] Jorge Morales of The Village Voice commented: \"The thirtysomething in me was all, gag me with a spoon, but the kid in me was like, this movie's rad to the max.\"[30]Garner was nominated for MTV movie and Teen Choice awards for her role as Jenna Rink.[32]","13_going_on_30":"Theatrical release poster","box_office":"$96,455,697[1]","cinematography":"Don Burgess","production_company":"Revolution Studios","directed_by":"Gary Winick","Music":"The 13 Going on 30 soundtrack was released on April 20, 2004 from Hollywood Records.[12]The songs \"Breathe\" by Michelle Branch and \"Iris\" by the Goo Goo Dolls were featured in promotional trailers, but were not in the movie or on the soundtrack.","release_dates":"April 23, 2004 (2004-04-23)|||||","Production":"In October 2002, American director Gary Winick was in negotiations to direct 13 Going on 30.[3] It was also announced that Susan Arnold and Donna Arkoff Roth were producing the project with the writers' manager, Gina Matthews.[3] In May 13, 2003, it was reported that filming for the movie was underway in Los Angeles on Revolution Studios.[4] It was filmed in Los Angeles, New York City, and South Pasadena, California.[5][6] Interiors shots were filmed in Los Angeles. The crew moved to New York City where they shot exteriors for 17 days.[7] Principal photography took place from May to November 2003. Written by Josh Goldsmith and Cathy Yuspa, the script was \"polished\" by Niels Mueller (who lost an initial writing credit in a subsequent dispute arbitrated by the Writers Guild of America).[8]American actress Jennifer Garner was cast for the movie's lead role. In order to film the picture, Garner shot it while on break from filming her TV series Alias.[9] Gwyneth Paltrow, Hilary Swank, and Renée Zellweger were all considered for the part played by Garner.[9] Judy Greer was cast to play Lucy, Garner's best friend; Kathy Baker and Phil Reeves were invited to be Garner's mother and father, respectively.[4] Later, Andy Serkis was selected to play Garner's boss; while Samuel Ball was announced as Garner's boyfriend.[10] Christa B. Allen, who portrays 13-year-old Jenna, would later \"reprise\" her role as a younger version of Jennifer Garner by portraying the teenaged version of Jenny Perotti in Ghosts of Girlfriends Past.[11]","produced_by":"Susan Arnold Donna Arkoff Roth Gina Matthews","starring":"Jennifer Garner Mark Ruffalo Judy Greer","running_time":"97 minutes[1]","music_by":"Theodore Shapiro","edited_by":"Susan Littenberg","written_by":"Josh Goldsmith Cathy Yuspa","budget":"$37 million[1]"}