{"country":"United States Canada Kuwait","distributed_by":"National Geographic Entertainment Imagenation","Plot":"Muna Farah (Nisreen Faour) is a divorced Palestinian Christian mother raising her teenage son Fadi (Melkar Muallem). She works for a bank in Ramallah, part of the West Bank, Palestinian territories. Each day after work, Muna picks up Fadi from school and crosses through an Israeli checkpoint in order to get to their home in Bethlehem. She lives with her aging mother and has occasional visits from her brother Samer. One day after arriving home, Muna discovers that she has been awarded an American green card through the lottery.[5][6] Although she initially considered declining the offer, Muna reconsiders after she and Fadi are harassed at the checkpoint by Israeli soldiers.They arrive in the United States shortly after the 2003 invasion of Iraq to stay with her sister’s family in Illinois. After a difficult time with customs, Muna is reunited with her sister, Raghda Halaby (Hiam Abbass), physician brother-in-law Nabeel (Yussuf Abu-Warda) and their three children Salma (Alia Shawkat), Rana (Jenna Kawar), and Lamis (Selena Haddad). Later, however, Muna discovers that a box of cookies was confiscated during the customs search and is horrified: the box contained all of her life savings. Muna thus searches for work, but is disappointed to discover that her multiple degrees and work experience do not guarantee the kind of employment she is seeking. She finally takes a job at White Castle. Too ashamed to tell her family the truth, she pretends to have been hired by the bank next door to White Castle. She maintains the facade through the help of an employee of the bank next door to White Castle (Miriam Smith) and her blue-haired high school drop-out co-worker, Matt (Brodie Sanderson).Meanwhile, Muna begins to discover that her sister's family has been experiencing difficulties in the Post-9/11 and Iraq war atmosphere of the United States. The family receives anonymous threats in the mail and Nabeel is continually losing patients from his medical practice. They are also behind on their mortgage and risk losing their home. The strain of living in this atmosphere becomes so severe that Raghda and Nabeel temporarily \"separate\" and Nabeel moves into the basement of the family home.Later, when some of the students make derogatory remarks to Fadi, he gets into a fight and his mother is called to meet with the school's principal Mr. Novatski (Joseph Ziegler). Shortly after the meeting, Mr. Novatski sees Muna waiting for her sister and insists on driving her to work. He apologizes to her for the behavior of the students towards Fadi saying that they are influenced by the media's depiction of Muslims. Muna is dismayed by the stereotypes he describes to her. She also informs him that she and Fadi are not Muslims, but are rather from a minority community. Embarrassed by his assumption, Mr. Novatski apologizes and says that he is a minority as well as an American Jew whose grandparents were Polish Jews. She is surprised to learn that he is Jewish. Muna asks him to drop her off at the bank but forgets her purse, an act which leads him to discover that she works secretly at White Castle. Deciding to have a meal there, they discover that they are both divorced.On another day, local high school students make discriminatory remarks about Fadi to Muna while she is working in White Castle. She chases them out, only to slip on a drink one of the boys poured on the floor and falls flat on her back. Matt immediately calls her family who then discovers her secret. Furious over the incident, Fadi gets into a fight with one of the boys and is subsequently arrested. In addition to assault, ambiguous charges are also leveled towards him that are serious enough to prevent Muna from getting him released. Muna contacts Mr. Novatski who rushes to the police station and tells the officers that the accusations are without merit and that he will assume responsibility for Fadi. Fadi is thus released from jail. These events also lead Raghda and Nabeel to reconcile.A little while later, Muna is working at White Castle and her family comes to take her to a Middle Eastern restaurant for dinner. While leaving she bumps into Mr. Novatski and invites him to join them for dinner. Raghda teases Muna when he enters the car and the evening ends with music and dancing.","language":"English Arabic","Critical reception":"As of June 7, 2013, Amreeka has received an overall rating of 87% from Rotten Tomatoes (61 fresh and 9 rotten reviews).[15] On Metacritic, the film had an average score of 73 out of 100, based on 23 reviews, indicating \"Generally Favorable\" reviews.[16] American critic Roger Ebert gave Amreeka three and a half out of four stars and described it as \"Cherien Dabis's heart-warming and funny first feature.\"[17]","box_office":"$2,147,715[1]","amreeka":"Theatrical release poster","directed_by":"Cherien Dabis","Awards":"2011 Intersections Film Festival2010 Heartland Film Festival2010 Independent Spirit Awards2010 NAACP Image Awards2009 Cairo International Film Festival2009 Cannes Film Festival2009 Dubai International Film FestivalGotham Independent Film Awards 20092009 National Board of Review of Motion Pictures2009 New Directors/New Films Festival2009 Sundance Film FestivalThe screenplay was presented with the $15,000 Tribeca All Access L’Oréal Paris Women of Worth Vision Award.","DVD":"The DVD of the film was released on January 12, 2010.[28] It contains a number of deleted scenes and outtakes. It also includes director Cherien Dabis' short feature, Make a Wish, which premiered at the 2007 Sundance Film Festival and received a number of awards at other festivals.[3]","Music":"Music in the film the closing song \"Jawaz al-safar\" (\"Passport\"), music by Marcel Khalife, based on a poem by Mahmoud Darwish.","release_dates":"January 17, 2009 (2009-01-17) (Sundance Film Festival)|September 4, 2009 (2009-09-04) (United States)|October 30, 2009 (2009-10-30) (Canada)|||","Production":"\"We shot in a loose, semi-documentary style with the Arri-416, which allowed us freedom of movement because it’s so lightweight and portable. And we planned long takes and fluid camera movements choreographed in congruence with the blocking of the actors to lend an organic, true-to-life feel. I used improvisational techniques in working with the actors to achieve natural performances and capture the honesty of human emotion. Throughout the process, I was influenced by the work of such directors as Mike Leigh, John Cassavetes and Robert Altman for their amazing ability to re-create the truth of everyday life. I also referenced photographers like Robert Frank, Gary Winogrand, Philip-Lorca diCorcia, Dorthea Lange and Lee Friedlander for their visual style, ironic wit and depiction of social issues.\"[7]Dabis began working on the screenplay for Amreeka while a graduate student in film at Columbia University School of the Arts in 2003.[8] Christina Piovesan, a producer in Toronto, read about Dabis in Filmmaker Magazine, thus leading the two of them to collaborate on '\"Amreeka.\" Over the next three years, Piovesan gathered financing from a number of sources in the Middle East and Canada. Dabis also traveled for months in order to hold casting auditions in New York, Chicago, Los Angeles, Dearborn, Toronto, Winnipeg, Paris, Amman, Beirut, Haifa, Jerusalem, Bethlehem and Ramallah.[9] In choosing Nisreen Faour for the lead role of Muna, Dabis commented that she \"had a sweetness about her [...] a kindness and a childlike sense of wonder. There was something about her that was so youthful, and yet, I could still see in her eyes the depth of sadness that her life experience had given her.” [9] On the choice of Melkar Muallem as Fadi, Dabis commented that he was, \"the son of a Palestinian woman who helped cast the film. He wanted nothing to do with acting—both parents are actors, and he’s only interested in computer science. I begged him to audition, and after he did, he wanted the part.\"[10] Muallem is from Ramallah, one of the locations for the film. Dabis also chose to work with film and television actors Hiam Abbass and Alia Shawkat and a theater actor from Haifa, Yussef Abu Warda.[9] Dabis modeled the family after her own, making them Christian Palestinians.[11] Events surrounding the inclusion of a kind high school principal were taken from Dabis' own life. While in high school, serious accusations were leveled at her sister, who was saved by the intervention of the school principal. Dabis chose to make her fictional version of this principal, Mr. Novatski (Joseph Ziegler), Jewish-American in order to create parallel experiences related to \"immigration and displacement.\"[12] In another interview Dabis stated that she included this because in the United States Arabs and Jews are friends and \"we don't get to see that enough.\"[13]The scenes in the West Bank were shot on location in Ramallah while the portion of the film set in Illinois was shot in Winnipeg. Dabis states that she chose to work in Canada rather than the United States because of \"the tax incentives combined with the fact that Manitoba offered us provincial equity for shooting the film there. That was huge! It enabled us to close our financing and go into production sooner rather than later.\"[14] The scenes in the Halaby home were set in the house of a local Palestinian family from Ramallah with three daughters close in age to the characters in the film.[9] White Castle was also \"an enthusiastic supporter of the film\" and contributed \"a truckload of real White Castle supplies.\"[9]","produced_by":"Christina Piovesan Paul Barkin","starring":"Nisreen Faour Melkar Muallem Hiam Abbass Alia Shawkat Yussuf Abu-Warda Joseph Ziegler Miriam Smith","running_time":"96 minutes","music_by":"Doug Bernheim","edited_by":"Keith Reamer","written_by":"Cherien Dabis"}