{"country":"United States","distributed_by":"Columbia Pictures","butterflies_are_free":"Butterflies Are Free","Plot":"In the San Francisco of the 1970s, Don Baker (Edward Albert), who was born blind, has lived all his life with his mother (Eileen Heckart). Don moves out into an apartment on his own, but Don finds himself all alone. He has made a contract that his mother will not come to see him for at least two months.One month has passed. This is when Jill Tanner (Goldie Hawn) moves into an apartment next door to Don. She listens to Don talking to his mother over the phone and turns on the radio. When Don asks her to turn the volume down, she invites herself over for a cup of coffee. They start talking and find each other friendly. Jill does not realize that Don is blind until she sees him dropping his cigarette ash on the table. Jill has never met a blind man before, so she asks all sorts of questions about how Don manages everyday chores. She tells Don that her favorite quote is: \"I only ask to be free. The butterflies are free. Mankind will surely not deny to Harold Skimpole what it concedes to the butterflies.\" (From Dickens' \"Bleak House\"). Don makes up a song and starts to sing \"Butterflies are free\" on his guitar.Surprising Don with a visit, Mrs. Baker sees that Don has attached himself to Jill. She fears that Jill will break Don's heart. She takes Jill out for a lunch and tries to talk her out of Don's life. Jill has strong feelings for Don and tells Mrs. Baker that if there is someone who should get out of Don's life, it is she.","language":"English","Reception":"When the film opened in the U.S., it was an instant success. Variety wrote: \"Although the setting has been changed from New York to San Francisco for no apparent reason, Leonard Gershe's screen adaptation of his successful Broadway play is an excellent example of how to switch from one medium to another.\"[2] The review further praises the acting of Goldie Hawn, saying: \"Hawn, funny and touching, is a delight throughout and Heckart gets a film role that enables her to display versatility.\"[2]Time magazine pointed out the talent of Goldie Hawn, saying: \"Goldie Hawn, as the girl next door, has come a long way from her giddy role in Laugh-In; she is often genuinely touching.\"[3] Time praised the acting of both Edward Albert and Eileen Heckart: \"Edward Albert, the son of Actor Edward Albert, is creditable as the blind boy, and Eileen Heckart is appropriately hateful as the mother, although she is unable to be convincing in her transformation. But then nobody could be.\"[3]","box_office":"$6.7 million (US/Canada rentals)[1]","cinematography":"Charles B. Lang","directed_by":"Milton Katselas","release_dates":"July 6, 1972 (1972-07-06)|||||","produced_by":"M.J. Frankovich","starring":"Goldie Hawn Eileen Heckart Edward Albert","running_time":"109 minutes","music_by":"Bob Alcivar","edited_by":"David Blewitt","written_by":"Leonard Gershe"}