{"based_on":"Catch-22 by Joseph Heller","Cast":"Main cast (as appearing in screen credits):","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Buck Henry","Plot":"Captain Yossarian (Alan Arkin), a U.S. Army Air Force B-25 bombardier, is stationed on the Mediterranean base on Pianosa during World War II. Along with his squadron members, Yossarian is committed to flying dangerous missions, and after watching friends die, he seeks a means of escape.Futilely appealing to his commanding officer, Colonel Cathcart (Martin Balsam), who continually increases the number of missions required to rotate home before anyone can reach it, Yossarian learns that even a mental breakdown is no release when Doc Daneeka (Jack Gilford) explains the \"Catch-22\" the Army Air Corps employs. As explained, an airman \"would be crazy to fly more missions and sane if he didn't, but if he was sane he'd have to fly them. If he flew them he was crazy and didn't have to; but if he didn't, he was sane and had to.\"Trapped by this convoluted logic, Yossarian watches as individuals in the squadron resort to unusual means to cope; Lt. Milo Minderbinder (Jon Voight) concocts elaborate black market schemes while crazed Captain \"Aarfy\" Aardvark (Charles Grodin) commits murder to silence a girl he raped. Lieutenant Nately (Art Garfunkel) falls for a prostitute, Major Danby (Richard Benjamin) delivers goofy pep talks before every bomb run and Captain Orr (Bob Balaban) keeps crash-landing. Meanwhile, Nurse Duckett (Paula Prentiss) occasionally beds Yossarian.Yossarian survives an attempt on his life when an unknown assailant stabs him (in the novel it was \"Nately's whore,\" and in the director's commentary Nichols says he regrets not making this clear in the film): the murder attempt is shown in the film's start and ending. Once recovered, Yossarian sets out to sea in a raft, paddling to Sweden, after he learns from the Chaplain and Major Danby that it is now the refuge for Captain Orr, whose repeated 'crash' landings had been a subterfuge for practicing and planning his own escape from the madness.","language":"English","Reception":"Catch-22 was not regarded as a great success with the contemporary public or critics, earning less money and acclaim than MASH, another war-themed black comedy from the same year. In addition, the film appeared as Americans were becoming resentful of the bitter and ugly experience of the Vietnam War, leading to a general declined interest in war movies, with the notable exceptions of MASH and Patton.[8] Critic Lucia Bozzola wrote \"Paramount spent a great deal of money on Catch-22, but it wound up getting trumped by another 1970 antiwar farce: Robert Altman's MASH.\"[16] Film historians and reviewers Jack Harwick and Ed Schnepf characterized it as deeply flawed, noting that Henry's screenplay was disjointed and that the only redeeming features were the limited aerial sequences.[17] Despite the film's commercial and critical failures, it was nominated for a BAFTA Award for Best Cinematography and retained a cult following. A modern reassessment has made the film a \"cult\" favorite; it presently holds an 85% \"Fresh\" rating on Rotten Tomatoes based on 26 reviews.","box_office":"$24,911,670[1]","cinematography":"David Watkin","production_company":"Filmways Paramount Pictures","directed_by":"Mike Nichols","DVD":"Catch-22 was re-released to DVD by Paramount Home Video on May 21, 2013: a previous version was released on May 11, 2004.","catch-22":"Theatrical release poster","Adaptations in other media":"A pilot episode for a Catch-22 series was aired on CBS in 1973, with Richard Dreyfuss in the Captain Yossarian role.[18]There have been other films with \"Catch-22\" in their names, including the documentary Catch-22 (2007) and the short films Catch 22: The New Contract (2009) and Catch22 (2010), but they have been unrelated to either the book or film adaptation.[19]","References":"NotesCitationsBibliography'","release_dates":"June 21, 1970 (1970-06-21)|||||","Production":"The adaptation changed the book's plot. Several story arcs are left out, and many characters in the movie speak dialogue and experience events of other characters in the book.[2] Despite the changes in the screenplay, Heller approved of the film, according to a commentary by Nichols and Steven Soderbergh included on a DVD release.[3] According to Nichols, Heller was particularly impressed with a few scenes and bits of dialogue Henry created for the film, and said he wished he could have included them in the novel.[4]The pacing of the novel Catch-22 is frenetic, its tenor intellectual, and its tone largely absurdist,[5] interspersed with brief moments of gritty, almost horrific, realism. The novel did not follow a normal chronological progression; rather, it was told as a series of different and often (seemingly, until later) unrelated events, most from the point of view of the central character Yossarian. The film simplified the plot to largely follow events in chronological order, with only one event shown in Yossarian's flashbacks.[2][6]In a long, continuous shot, in the scene where Captain Major accepts his rank as Major, becoming Major Major Major Major, the portrait in his office inexplicably changes from President Roosevelt, to Prime Minister Churchill, then to Premier Stalin.[7]Paramount assigned a $17 million budget to the production and planned to film key flying scenes for six weeks, but the aerial sequences required six months of camera work, resulting in the bombers flying about 1,500 hours.[8] They appear on screen for approximately 10 minutes.[9][Note 1]Catch-22 is renowned for its role in saving the B-25 Mitchell aircraft from possible extinction.[10] The film's budget accommodated 17 flyable B-25 Mitchells, and one hulk was acquired in Mexico, and flown with landing gear down to the Guaymas, Sonora, Mexico filming location.[3] The aircraft was burned and destroyed in the landing crash scene. The wreck was then buried in the ground by the runway, where it remains.[11]For the film, prop upper turrets were installed, and to represent different models, several aircraft had turrets installed behind the wings representing early (B-25C/D type) aircraft.[9] Initially, the camera ships also had mock turrets installed, but problems with buffeting necessitated their removal.[12]Many of the \"Tallman Air Force fleet\" went on to careers in films and television, before being sold as surplus.[13] Fifteen of the 18 bombers remain intact, including one displayed at the Smithsonian Institution's National Air and Space Museum.[14]Second Unit Director John Jordan refused to wear a harness during a bomber scene and fell out of the open tail turret 4,000 ft. to his death.[15]","produced_by":"John Calley Martin Ransohoff","starring":"Alan Arkin","running_time":"122 minutes","music_by":"Richard Strauss","edited_by":"Sam O'Steen","budget":"$18 million"}