{"country":"United States","distributed_by":"20th Century Fox","dr._dolittle":"Theatrical release poster","Plot":"Young John Dolittle talks to his dog (voiced by Ellen DeGeneres), who explains dogs sniff each other's butts as a way of greeting, and John does so when meeting his new principal. This behavior concerns his, apparently, single father (Ossie Davis), who hires the local minister to perform an exorcism. When John is scared, his dog attacks the minister, and his father gives the dog up for adoption. The incident greatly upsets John and he stops talking to animals, eventually forgetting he could.Thirty years later, John (Eddie Murphy) is now living in San Francisco, California. He is a doctor, married with two children, and an animal hater. His 13-year-old daughter Charisse (Raven-Symoné) demands to be called Paprika, similar to Salt-n-Pepa, and his youngest daughter Maya (Kyla Pratt) is a nerdy girl who dislikes socializing, and is raising what she believes to be a swan egg so it will bond with her. She also has a guinea pig named Rodney (voiced by Chris Rock). John tries to raise Maya to social and fit in, just like his father raised him, but she refuses. John's wife Lisa (Kristen Wilson) wants to spend time with him, while a large medical company owned by Calloway (Peter Boyle) wants to buy his practice, making them a great deal of money.John takes his family out to the country for a vacation. He has to return to work to see a patient and bring Rodney. On the way home, John accidentally hits a dog (voiced by Norm MacDonald) and bumps his head on the windshield. The dog runs off, shouting \"Watch where you're going next time, you bone head!\"; the first time that John has understood an animal since childhood. The next day, John is driving Rodney to the country and Rodney starts talking to him as well. John, with still no memory of his long-lost gift, is terrified of what is happening to him.During the night, an owl (voiced by Jenna Elfman) asks him to remove a twig in her wing. He obliges and she tells all the animals about his kind act. Soon, many animals start asking favors of John. Frightened, he gets a CAT scan, but nothing is wrong with him. The next day he finds the dog he nearly hit being taken to a kennel. John rescues the dog and attempts to set him free, but Maya overhears the dog's barking and assumes the dog is a gift for her. Reluctantly, John decides to let him stay, giving him a real name: Lucky.That night, John finds that his reputation for understanding animals has spread, and a mass of animals come to him seeking treatment. In the process, John relearns to appreciate his gift and confides in Lucky that he feels a bit more energized about his work than he has in years. A drunken circus monkey tells the doctor about a sick tiger (voiced by Albert Brooks) who is planning to commit suicide. They find the tiger, named Jake, on top of Coit Tower planning to jump, as something in his brain is causing him immense pain. John and Lucky convince Jake they can help him. Lisa and John's super avaricious partner Mark (Oliver Platt) catch him giving CPR to a rat and have him committed to an insane asylum.Lucky comes to see John and tells him Jake is getting worse, but John is angry at what has happened to him, and no longer cares what happens to Lucky or any animal, including Jake. Lucky leaves, telling John, in total disbelief, he's hiding from his true self, and John, now with an even stronger hatred for the entire animal kingdom, is released when he vows to never talk to animals again. At home, Maya hears the news and tells her grandfather, who still remains the only one who knew his son's ability, what has happened, and that she liked the idea that John could talk to animals. This makes him feel terrible for not letting his son keep his talent or accepting it himself. John overhears this, remembers his childhood tragedy and apologizes to Lucky. During a party where Calloway will buy the company, John and Lucky bring Jake to the clinic to operate on him. The police arrive seeking the tiger, but Lucky gathers all the animals of San Francisco to help guard the building in which John is operating on the tiger.At the party the guests discover Jake, but John explains what he is doing and gets Jake onto the operating table as the guests watch. John's father, finally realizing John's ability as the gift it is, confides in Lisa that he knows John truly can talk to animals. He originally thought it was only a handicap, but Maya made him see it was a gift. Lisa comes inside to comfort Jake as John works. John finds out that Jake is suffering from a blood clot stuck in his head, and saves his life. Calloway is impressed, but John declines his offer to buy his practice.In an epilogue, John is now both a doctor and a veterinarian, and Maya's egg hatches, revealing it to be an alligator. John and Lucky head to the circus to visit Jake and talk about their future as friends while the song \"Talk with the Animals\" plays in the background.","language":"English","box_office":"$294.4 million[2]","cinematography":"Russell Boyd","directed_by":"Betty Thomas","Soundtrack":"The soundtrack was released on June 16, 1998 through Atlantic Records and consisted of a blend of hip hop and contemporary R&B. The soundtrack was a huge success, peaking at 4 on both the Billboard 200 and the Top R&B/Hip-Hop Albums and was certified 2× Multi-Platinum on October 20, 1998. Allmusic rated the soundtrack four stars out of five.[6]The soundtrack's lone charting single, \"Are You That Somebody?\" by Aaliyah, also found success, making it to 21 on the Billboard Hot 100 and received a nomination for Best Female R&B Vocal Performance at the Grammy Awards.[7]","production_companies":"Davis Entertainment Friendly Films","release_dates":"June 26, 1998 (1998-06-26)|||||","produced_by":"John Davis|David T. Friendly|Joseph M. Singer|","starring":"Eddie Murphy|Ossie Davis|Oliver Platt|Peter Boyle|Kristen Wilson|Norm Macdonald|Kyla Pratt|Raven-Symoné|","running_time":"85 minutes[1]","music_by":"Richard Gibbs","edited_by":"Peter Teschner","Release":"On its opening weekend, Dr. Dolittle earned $29,014,324 across 2,777 theaters in the United States and Canada, ranking #1 at the box office, the best debut for a Fox film that week. By the end of its run, the film had grossed $144,156,605 in the United States and $150,300,000 internationally, totaling $294,456,605 worldwide.[2]The film received mixed reviews from critics. On Rotten Tomatoes, it holds a 44% score based on 51 reviews, with an average rating of 5.3/10.[3] Metacritic reports a 46 out of 100 rating based on 20 critics, indicating \"mixed or average reviews\".[4]","written_by":"Larry Levin|Nat Mauldin|","budget":"$70.5 million"}