{"based_on":"Dragon Ball  by Akira Toriyama","Cast":"Originally released in Japan in 1986, this film has been dubbed into English multiple times, including one produced in the UK by AB Groupe.","country":"Japan","distributed_by":"Toei Company, Ltd.","screenplay_by":"Toshiki Inoue","Plot":"Curse of the Blood Rubies is a modified adaptation of the initial story arc in the Dragon Ball manga, with the original character King Gurumes substituting Emperor Pilaf's role as the main antagonist. Like in the manga, Curse of the Blood Rubies depicts how Goku meets up with Bulma. During their travel Goku meets Oolong, Yamcha, Puar and finally Master Roshi during his first search for the Dragon Balls.The movie starts with King Gurumes' soldiers destroying the homes and lands of farmers within his kingdom to look for blood rubies. His two main enforcers are Pasta and Bongo (Raven and Major Domo in the 1995 dub), whom he has also tasked with finding the Dragon Balls. Since finding the blood rubies, King Gurumes has fallen under a curse that makes his hunger insatiable. He hopes to wish the curse away with the Dragon Balls. A little girl named Pansy decides to go and find help.A teenage girl named Bulma is also searching for the Dragon Balls with the help of a device called a Dragon Radar. Before she can reach the next ball, she runs into Goku (a young boy with a tail) while he’s carrying home a giant fish. Goku tells Bulma that his grandpa gave him a Dragon Ball before he died. Pasta and Bongo arrive at Goku's home and steal his Dragon Ball. They flee in a fighter jet and Bulma and Goku give chase in Bulma's jet, But they are shot down by Pasta.Later that night, Goku and Bulma are looking for food in the forest when they find Penny, who is being accosted by a large monster. The monster flees when Goku proves his strength by destroying a large tree. Goku chases the monster and it finds its true form to be a shape-shifting pig named Oolong. Oolong freaks out when he realizes they have landed in the Desert Bandit Yamcha’s territory. Yamcha and his sidekick Puar attack the duo. Goku battles Yamcha but their duel is cut short when Bulma arrives. Yamcha flees because he has a paralyzing fear of beautiful women. Penny tells the others about her people’s plight and how she must find the great Master Roshi.The next day, the team arrives on Master Roshi’s island, but Yamcha has arrived first and tricked Roshi into thinking Goku is there to steal his shell. To find out who’s telling the truth, Roshi summons the Nimbus Cloud, which only an honest person can ride. Goku successfully rides it and clears his name; Yamcha flees again, vowing that he will be back. Master Roshi also says he will give Bulma his Dragon Ball, but only if she shows him her boobs. She uses Oolong to transform into her in order to trick Roshi, and it works, but Pasta and Bongo arrive in a submarine and attack the island. One of Bulma's two Dragon Balls is stolen and Roshi’s house is destroyed. Angered by the destruction of his house, Roshi uses the Kamehameha to destroy the submarine. Pasta and Bongo flee in an escape jet. Penny asks Roshi to help her defeat King Gurumes, but he declines, saying that he is an old man, and assures Penny that Goku and Bulma will be all the help she needs. They journey to King Gurumes' castle and are immediately attacked by the king’s air force. Bulma is shot down while Goku has an aerial duel with Bongo, in which Goku destroys Bongo's hovercraft. Yamcha and Puar also arrive and infiltrate the castle, where they meet up with Bulma, Penny, and Oolong. Yamcha is attacked by Pasta but is unable to fight back because of his phobia of beautiful women, so they flee. Goku defeats Bongo by knocking him through a wall with his power pole. They all end up in King Gurumes' throne room. King Gurumes' curse has turned him into a large, purple monster. He attacks Goku to get the last Dragon Ball. Goku tries the Kamehameha, but it fails. Bulma realizes the other six Dragon Balls are inside Gurumes' stomach, so she throws her Dragon Ball into his mouth. The Eternal Dragon, Shenron, erupts from his mouth and offers to grant one wish. Penny wishes for her land to be peaceful and beautiful again. The dragon then removes all the blood rubies and makes the land fertile again. After granting the wish, the dragon vanishes and the Dragon Balls are scattered across the Earth again.King Gurumes' curse is lifted, as he is reduced to a small, bald man, Yamcha and Bulma decide to date, and Goku heads off to Master Roshi's island to train with the Turtle Hermit. At the end, the land is shown to be fertile and beautiful again, as above the picture is the Japanese word for \"The End.\"","language":"Japanese","box_office":"¥1.25 billion (US$7.8 million)","cinematography":"Motoaki Ikegami","production_company":"Toei Animation","English release":"Curse of the Blood Rubies (originally titled Dragon Ball: The Movie and later, Dragon Ball: The Legend of Shenron) was originally licensed to Harmony Gold USA in 1989, who dubbed and released the film in conjunction with Mystical Adventure. The dub aired as a special to the TV series on WPSG Philly 57 in Philadelphia, Pennsylvania. The dub was edited for content, and most of the characters were renamed. The audio track was recorded at InterSound, inc. in Hollywood, CA, United States. Because of the failure with Harmony Gold's release of the franchise, the Dragon Ball series was dropped, and the two movies went through several companies such as Trimark Pictures before being licensed to Funimation Productions in 1995.The second English dub version of Curse of the Blood Rubies, which was produced by Funimation as a pilot to sell the Dragon Ball series to American syndicators, was originally premiered on syndication on September 9, 1995 (along with the first episode of the Emperor Pilaf Saga; Secret of the Dragon Ball), and released on VHS in North America by Trimark on September 24, 1996 (although it was produced in 1995). The dub version was also edited for content and used a scene from the second episode of the TV series to fill in lost time. However, unlike the previous dub, most of the series' returning characters got to keep their original names (though this dub did make use of most of the supporting character names from the 1989 dub, such as Penny). In addition, the dialogue was loosely based on the 1989 dub script. The audio track for the 1995 English dub was recorded in Vancouver, BC, Canada. The dub was later released on Region 1 DVD on October 24, 2000 as part of the Saga of Goku set from Trimark along with Funimation/BLT Productions' original dub of the first thirteen episodes of the TV series. For a long time, it was the only Dragon Ball movie that had yet to be released by Funimation in an uncut bilingual format due to licensing issues with Lions Gate Entertainment (who bought Trimark in 2002). The 1995 English dub was also released on DVD in Australia by Madman Entertainment as part of the Saga of Goku set released to Region 4 DVD, despite using Funimation's newer in-house dub of the first thirteen episodes.Another English dub of the film was produced for European markets by AB Group and dubbed in France and aired in the UK as The Legend of Shenron on Toonami UK in the Summer of 2005, and was released on DVD as the alternate English language track on some European releases. The entire voice cast for this English dub is unknown.In 2009, Funimation announced that they had acquired the Home Video rights to the film from Lions Gate Entertainment, and that the film will be released uncut. On April 6, 2010 Funimation announced that Curse of the Blood Rubies would be released to a bilingual DVD on July 27, 2010, but the release was delayed to December 28, 2010. Funimation announced the voice cast for a new English dub of the film on November 12, 2010.[1] The 2010 English dub is mostly unedited (the only visual edits being to the title and credit sequences), but the script was mostly recycled from the 1995 English dub (which itself was based on the 1989 dub script), with the most notable change being all the character names reverting to their originals. The audio was recorded in Dallas, TX, United States. However, very few voice actors from FUNimation's English dub of the original Dragon Ball series reprised their roles for this film, with their replacements from the dub of Dragon Ball Z Kai (in production at the time) being used instead.The film (containing the 2010 dubbing) was later re-released in a Dragon Ball Movie 4-Pack on February 8, 2011.[2]","directed_by":"Daisuke Nishio","dragon_ball:_curse_of_the_blood_rubies":"Japanese film poster","japanese":"ドラゴンボール (original title) ドラゴンボール 神龍の伝説","Music":"The BLT English dub featured music composed by Peter Berring, with a theme song by Peter Berring and Brian Griffith.The Funimation English dub featured an English version of the above theme songs performed by Jimi Tunnell and Daphne Gere respectively, which were recorded for the English adaptation of the television series.","release_dates":"December 20, 1986 (1986-12-20) (Japan)|||||","hepburn":"Doragon Bōru (original title) Doragon Bōru Shenron no Densetsu","produced_by":"Chiaki Imada[ja] (executive producer)","starring":"see below","running_time":"50 minutes","music_by":"Shunsuke Kikuchi","edited_by":"Shin'ichi Fukumitsu"}