{"country":"Ireland","distributed_by":"Paramount Classics","Casting and production":"Cooper is played by James Nesbitt, himself a Protestant from Northern Ireland. In recognition of the role his book played in achieving the new Bloody Sunday Inquiry, his book's role as inspiration for the movie, and the fact that he was a schoolboy witness to the tragedy, Don Mullan was asked by director Paul Greengrass to appear in the film as a Bogside Priest. A number of the military characters were played by ex-members of the British Army, including Simon Mann. Gerry Donaghy was played by Declan Duddy, nephew of Jackie Duddy, one of those killed on Bloody Sunday. Big Brother 2007 (UK) housemate Seány O'Kane was in the film also.[1]","bloody_sunday":"Film poster","language":"English","box_office":"£482,117","cinematography":"Ivan Strasburg","production_company":"Bórd Scannán na hÉireann Granada Television Hell's Kitchen Films Irish Film Board (funding) Portman Entertainment Group","Responses":"The film was critically acclaimed.[2] It won the Audience Award at Sundance and the Golden Bear at the Berlin International Film Festival (tied with Spirited Away), in addition to the Hitchcock d'Or best film prize at the Dinard Festival of British Cinema.[3]Bloody Sunday appeared a week before Jimmy McGovern's TV film on the same subject, entitled Sunday (shown by Channel 4). McGovern subsequently criticised Greengrass's film for concentrating on the leadership of the march, and not the perspective of those who joined it.[4]It holds a 92% approval rating on aggregate review site Rotten Tomatoes, based on 102 collected reviews, with an average score of 7.9/10. The sites consensus reads: \"Bloody Sunday powerfully recreates the events of that day with startling immediacy.\"[5]","directed_by":"Paul Greengrass","Content":"The movie was inspired by Don Mullan's politically influential book Eyewitness Bloody Sunday (Wolfhound Press, 1997). The drama shows the events of the day through the eyes of Ivan Cooper, a SDLP Member of the Parliament of Northern Ireland who was a central organiser of the Northern Ireland Civil Rights Association march in Derry on 30 January 1972. The march ended when British Army paratroopers fired on the demonstrators, killing thirteen and wounding another who died 4½ months later.The soundtrack contains only one piece of music, a live version of \"Sunday Bloody Sunday\" by U2 which plays over the closing credits.","release_dates":"16 January 2002 (2002-01-16) (Sundance)|25 January 2002 (2002-01-25) (UK)||||","produced_by":"Mark Redhead","starring":"James Nesbitt Allan Gildea Gerard Crossan","running_time":"105 minutes","music_by":"Dominic Muldowney","edited_by":"Clare Douglas","written_by":"Paul Greengrass","budget":"£2,000,000"}