{"country":"United States","distributed_by":"13 Moons Productions LLC Lot 47 Films","Plot":"The film opens with a clown (Buscemi) whose wife (Beals) and stripper girlfriend (Parsons) just discovered each other's existence. When his wife is jailed for trying to run him over, the stripper, the clown and his partner (Dinklage) contact a bail bondsman (Proval) whose wife just left their sickly son Timmy (Wolff) in his care. On the way, they are accosted by a crazed drug addict named Slovo (Stormare) who is hit by a car soon after.At the jail, the five meet up with an angry record producer (Mitchell) and the girlfriend he believes to be pregnant (Rollins) whom he plans to make a star, despite her protestations of not having any talent. Also along for the ride are two priests (Vince and Williams), one of whom has begun to doubt the wisdom of the Roman Catholic Church, and who are trailing to bail out a third priest (Messina) who was goaded into a fight by the proprietor of a strip club (Rockwell).When the nine characters intersect, they discover that Timmy has a defective kidney and is slowly dying. However, he has just been paged, as there is a donor at the hospital: Slovo. The three caring characters immediately take Timmy to the hospital, with the others in pursuit. By the time they arrive, Slovo partially recovered and escapes to wander the streets, cheerfully ignoring his internal bleeding and must be tracked down, before both he and Timmy die.","language":"English","cinematography":"Phil Parmet","directed_by":"Alexandre Rockwell","13_moons":"DVD release cover","release_dates":"January 2002 (2002-01)|||||","produced_by":"Paul Brooks (executive) Brandon Cole Mike Crawford (line) Michael Din Larry Katz (executive) David Kronemeyer","starring":"Jennifer Beals Elizabeth Bracco Steve Buscemi Peter Dinklage Sam Rockwell Peter Stormare","running_time":"93 minutes","music_by":"Brian Kelly Kevin Salem","edited_by":"John David Allen","written_by":"Brandon Cole Alexandre Rockwell"}