{"Sequels and spin-offs":"In 2004, MGM released the sequel, Barbershop 2: Back in Business. All of the original cast returned, but director Tim Story did not. This film was directed by Kevin Rodney Sullivan. In the same year, Billie Woodruff directed a spin-off film entitled Beauty Shop, with Queen Latifah as the lead (Latifah's character made her debut in Barbershop 2). Beauty Shop was pushed back from a late summer 2004 release, and finally reached theaters in February 2005.During the fall of 2005, State Street and Ice Cube debuted Barbershop: The Series on the Showtime cable network, with Omar Gooding taking over Ice Cube's role of Calvin. The character \"Dinka\" is renamed \"Yinka\" on Barbershop: The Series, as \"Dinka\" is not a typical Nigerian name (although a certain tribe in the Nigerian middle belt bears the name \"Dimka\"). In addition, Isaac's last name is changed from \"Rosenberg\" to \"Brice\", and the character Ricky has been replaced by a more hardened ex-con, Romadal.In 2014, a third Barbershop film was announced, titled Barbershop: The Next Cut. In late March of that year, MGM executives revealed that they have been negotiating deals with Ice Cube to appear in the film.[5] A year later, MGM announced that the studio has been setting up deals with Cedric the Entertainer, Queen Latifah, Lisa Maffia, and Nicki Minaj to appear in the film. Malcolm D. Lee is set to direct and New Line Cinema will distribute.[6] Barbershop: The Next Cut has a scheduled release date for April 15, 2016.[7]","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Mark Brown Don D. Scott Marshall Todd","story_by":"Mark Brown","Plot":"On a cold winter, Calvin Palmer, Jr. (Ice Cube) decides he has had enough of trying to keep open the barbershop his father handed down to him. He cannot borrow, revenues are falling, and he seems more interested in get-rich-quick schemes to bring in easy money. Without telling his employees, or the customers, he sells the barbershop to a greedy loan shark, Lester Wallace (Keith David), who lies about its future by announcing plans to turn it into a strip club.After spending a day at work, and realizing just how vital the barbershop is to the surrounding community, Calvin rethinks his decision and tries to get the shop back - only to find out Wallace wants double the $20,000 he paid Calvin to return it, and before 7 pm that day. Right after he admits to the employees that he sold the barber shop, and that it would be closing at the end of the day, the police arrive to arrest one of the barbers, named Ricky (Michael Ealy). He is accused of driving his pickup truck into a nearby market to steal an ATM, but the ATM thief, JD (Anthony Anderson), a cousin of Ricky's, is revealed to be actually the one who committed the crime after borrowing Ricky's truck. Because this is, potentially, Ricky's 'third strike', he could be sentenced to life in prison. Calvin uses the $20,000 from Lester to bail Ricky out of jail, yet Ricky is still angry, as JD set him up.Calvin reveals that he found a gun in Ricky's locker in the barbershop and shows it to him. They stop the car and Ricky throws the gun into the river, proving that he does not want to get into any more trouble. Then they both go to confront Lester. Lester, as well as JD and his best friend Billy (Lahmard Tate) (who were still trying to pry the ATM open and took it to Lester's place without his knowledge) are confronted by Calvin and Ricky. They demand Lester give the barbershop back. Lester is angered and orders his bodyguard Monk to pull out his gun. The police arrive just in time to save Calvin and Ricky, but JD and Billy are arrested. Calvin and Ricky see the ATM, and get a $50,000 reward for returning it to police. They get the money, and the barbershop reopens with even better business than before. In the meantime, Calvin's wife, Jennifer (Jazsmin Lewis), has given birth to a baby boy.","language":"English","Reception":"The film received positive reviews. Rotten Tomatoes gives the film a \"Certified Fresh\" rating and a score of 82% based on 124 reviews,[3] with the critical consensus \"Besides bringing on the laughs, Barbershop displays a big heart and demonstrates the value of community.\" Metacritic gives the film a weighted average score of 66% based on reviews from 29 critics.[4]","box_office":"$77,063,924[1]","cinematography":"Tom Priestley Jr.","production_company":"State Street Pictures Cube Vision","directed_by":"Tim Story","Soundtrack":"A soundtrack containing hip hop and R&B music was released on August 27, 2002 by Epic Records. It peaked at #29 on the Billboard 200 and #9 on the Top R&B/Hip-Hop Albums.","release_dates":"September 13, 2002 (2002-09-13)|||||","Production":"Produced on a $12 million budget, Barbershop, with a story by Mark Brown and a screenplay by Brown, Marshall Todd, and Don D. Scott, was filmed in Chicago during the winter of 2001 to early 2002. The filmmakers used a storefront in the South Chicago community area (79th Street and Exchange Avenue) that was once a laundromat to build the set for Calvin's barbershop, and the set was duplicated on a soundstage. Similar to what he achieved with his 1997 film Soul Food, producer George Tillman, Jr. wanted to portray African Americans in a more positive and three-dimensional light than many other Hollywood films had in the past. This film also features three original songs by R&B singer/songwriter Sherod Lindsey.","produced_by":"George Tillman, Jr. Robert Teitel Mark Brown","starring":"Ice Cube Anthony Anderson Sean Patrick Thomas Eve Michael Ealy Troy Garity Keith David DeRay Davis Cedric the Entertainer","running_time":"102 minutes","barbershop":"Theatrical poster","music_by":"Terence Blanchard","edited_by":"John Carter","budget":"$12 million"}