{"based_on":"Deliverance  by James Dickey","Soundtrack and copyright dispute":"The film's soundtrack brought new attention to the banjo work \"Dueling Banjos,\" which had been recorded numerous times since 1955. Only Eric Weissberg and Steve Mandel were originally credited for the piece. The songwriter and producer Arthur \"Guitar Boogie\" Smith, who wrote the original piece, \"Feudin' Banjos\" (1955), and recorded it with five-string banjo player Don Reno, filed a lawsuit for songwriting credit and a percentage of royalties. He was awarded both in a landmark copyright infringement case.[6] Smith asked Warner Bros. to include his name on the official soundtrack listing, but reportedly asked to be omitted from the movie credits because he found the film offensive.[7]No credit was given for the film score. The film has a number of sparse, brooding passages of music scattered throughout, including several played on a synthesizer. Some prints of the movie omit much of this extra music.Boorman was given a gold record for the \"Dueling Banjos\" hit single; this was later stolen from his house by the Dublin gangster Martin Cahill. Boorman recreated this scene in The General (1998), his biographical film about Cahill.","country":"United States","deliverance":"Theatrical release poster by Bill Gold","distributed_by":"Warner Bros.","screenplay_by":"James Dickey Uncredited: John Boorman","Plot":"Four Atlanta businessmen, Lewis Medlock (Burt Reynolds), Ed Gentry (Jon Voight), Bobby Trippe (Ned Beatty) and Drew Ballinger (Ronny Cox), decide to canoe down a river in the remote northern Georgia wilderness, expecting to have fun and witness the area's unspoiled nature before the fictional Cahulawassee River valley is flooded by construction of a dam. Lewis, an experienced outdoorsman, is the leader. Ed is also a veteran of several trips but lacks Lewis' machismo. Bobby and Drew are novices. While traveling to their launch site, the men (Bobby in particular) are condescending towards the locals, who are unimpressed by the \"city boys\".Traveling in pairs, the foursome's two canoes are briefly separated. The occupants of one canoe (Bobby and Ed), land briefly and encounter a pair of local men emerging from the woods, one carrying a shotgun. Following a verbal altercation, Bobby is forced at gunpoint to strip, his ear twisted to bring him to his hands and knees, and then ordered to \"squeal like a pig\" before being raped while Ed is bound to a tree and held at gunpoint by the other man.Hearing the commotion, Lewis sneaks up and kills the rapist with an arrow from his recurve bow; meanwhile, the other man quickly escapes into the woods. After a brief but hotheaded debate between Lewis and Drew about whether to inform the authorities, the men vote to side with Lewis' recommendation to bury the dead man's body and continue on as if nothing had happened — since Lewis tells them that they will be arrested and that they wouldn't receive a fair trial, as the local jury would be composed of the dead man's friends and relatives; likewise, Bobby doesn't want what had happened to him to be known. The four continue downriver but soon disaster strikes as the canoes reach a dangerous stretch of rapids. As Drew and Ed reach the rapids in the lead canoe, Drew shakes his head and falls into the water. It is unclear why.After Drew's fall into the river, the survivors' canoes collide on the rocks, spilling Lewis, Bobby and Ed into the river. Lewis breaks his femur and the others are washed ashore alongside him. Encouraged by the badly injured Lewis, who believes they are being stalked by the rapist's partner, Ed climbs a nearby rock face in order to dispatch the stalker using his bow while Bobby stays behind to look after Lewis. Ed reaches the top and hides out until the next morning, when the stalker appears on the top of the cliff with a rifle, looking down into the gorge where Lewis and Bobby are located. Ed clumsily shoots and manages to kill him, accidentally stabbing himself with one of his own spare arrows in the process. It is unclear if this is the same man who was the rapist's accomplice. Ed and Bobby weigh down the body in the river to ensure it will never be found, and repeat the same with Drew's body which they encounter downriver.Upon finally reaching the small town of Aintry, they get the injured Lewis to the hospital. The men carefully concoct a cover story for the authorities about Drew's death and disappearance being an accident, lying about their ordeal to Sheriff Bullard in order to escape a possible double murder charge. The sheriff clearly doesn't believe them, but has no evidence to arrest them and simply tells the men never to come back. They readily agree. The trio vow to keep their story of death and survival a secret for the rest of their lives. In the final scene, Ed awakes, startled by a nightmare in which a white skeletal hand rises from the lake.","language":"English","Reception":"Deliverance was a box office success in the United States, becoming the fifth-highest grossing film of 1972 after grossing a domestic total of over $46 million.[1] The film's financial success continued the following year, when it went on to earn $18 million in North American \"distributor rentals\" (receipts).[8]Deliverance was well received by critics and is widely regarded as one of the best films of 1972.[9][10][11][12] The film is in the top tier of films on the critical review aggregate website Rotten Tomatoes, with a 93% \"fresh\" rating, [13] despite scoring only 50% based on the six \"top critic\" reviews.Not all reviews were positive. Roger Ebert of the Chicago Sun-Times said:Dickey, who wrote the original novel and the screenplay, lards this plot with a lot of significance -- universal, local, whatever happens to be on the market. He is clearly under the impression that he is telling us something about the nature of man, and particularly civilized man's ability to survive primitive challenges[…] But I don't think it works that way.[…] What the movie totally fails at, however, is its attempt to make some kind of significant statement about its action.[…] [W]hat James Dickey has given us here is a fantasy about violence, not a realistic consideration of it.[…] It's possible to consider civilized men in a confrontation with the wilderness without throwing in rapes, cowboy-and-Indian stunts and pure exploitative sensationalism.[14]The instrumental piece, \"Dueling Banjos,\" won the 1974 Grammy Award for Best Country Instrumental Performance. The film was selected by The New York Times as one of The Best 1,000 Movies Ever Made, while the viewers of Channel 4 in the United Kingdom voted it #45 in a list of The 100 Greatest Films.Reynolds later called it \"the best film I've ever been in.\"[15]","box_office":"$46.1 million[1]","cinematography":"Vilmos Zsigmond","production_company":"Elmer Productions","directed_by":"John Boorman","release_dates":"July 30, 1972 (1972-07-30)|||||","Production":"Deliverance was shot primarily in Rabun County in northeastern Georgia. The canoe scenes were filmed in the Tallulah Gorge southeast of Clayton and on the Chattooga River. This river divides the northeastern corner of Georgia from the northwestern corner of South Carolina. Additional scenes were shot in Salem, South Carolina.A scene was also shot at the Mount Carmel Baptist Church cemetery. This site has since been flooded and lies 130 feet under the surface of Lake Jocassee, on the border between Oconee and Pickens counties in South Carolina.[2][3] The dam shown under construction is Jocassee Dam.During the filming of the canoe scene, author James Dickey showed up inebriated and got into a bitter argument with producer-director John Boorman, who had rewritten Dickey's script. They had a brief fistfight in which Boorman's nose was broken and four of his teeth shattered. Dickey was thrown off the set, but no charges were filed against him. The two reconciled and became good friends, and Boorman gave Dickey a cameo role as the sheriff at the end of the film.The inspiration for the Cahulawassee River was the Coosawattee River, which was dammed in the 1970s and contained several dangerous whitewater rapids before being flooded by Carters Lake.[4]The film is famous for cutting costs by not insuring the production and having the actors do their own stunts (most notably, Jon Voight climbed the cliff himself). In one scene, the stunt coordinator decided that a scene showing a canoe with a dummy of Burt Reynolds in it looked phony; he said it looked \"like a canoe with a dummy in it.\" Reynolds requested to have the scene re-shot with himself in the canoe rather than the dummy. After shooting the scene, Reynolds, coughing up river water and nursing a broken coccyx, asked how the scene looked. The director responded, \"like a canoe with a dummy in it.\"Regarding the courage of the four main actors in the movie doing their own stunts without insurance protection, Dickey was quoted as saying all of them \"had more guts than a burglar\". In a nod to their stunt-performing audacity, early in the movie Lewis says, \"Insurance? I've never been insured in my life. I don't believe in insurance. There's no risk.\"Several people have been credited with the now-famous line including the phrase, \"squeal like a pig.\" Ned Beatty said he thought of it while he and actor McKinney were improvising the scene.[5]James Dickey's son, Christopher Dickey, in his memoir about the film production, Summer of Deliverance, said that one of the crewmen suggested that Beatty's character, Bobby, \"squeal like a pig,\" to add some backwoods horror to the scene and make it more shocking.[page needed] According to Boorman's running commentary on the home media releases, the studio wanted the scene shot two ways, one of which would be acceptable for TV. Boorman did not want to do this. He decided that the phrase \"squeal like a pig\", suggested by Frank Rickman, a Clayton native, was a good replacement for the dialogue in the script. It would work for both the theatrical and TV versions.[citation needed]","produced_by":"John Boorman","starring":"Jon Voight Burt Reynolds Ned Beatty Ronny Cox","running_time":"110 minutes","music_by":"Eric Weissberg Arthur \"Guitar Boogie\" Smith (uncredited)","edited_by":"Tom Priestley","budget":"$2 million"}