{"chasing_ice":"Theatrical release poster","country":"United States","distributed_by":"Submarine Deluxe","language":"English","Reception":"As of October 2013[update], this film has a rating of 96% on Rotten Tomatoes, based on 68 reviews and an average score of 7.6/10.[5] The film won the Satellite Award for Best Documentary Film.","box_office":"$1,331,836","Synopsis":"Acclaimed environmental photographer James Balog heads to Greenland, Iceland and Alaska in order to capture images that will help to convey the effects of global warming. Balog was initially skeptical about climate change when the issue entered scientific discussion, but after his first trip north, he becomes convinced of the impact that humans have on the planet and becomes committed to bringing the story to the public.Within months of the first trip to Iceland, Balog initiates The Extreme Ice Survey - an expedition to collect data on the seasonal changes of glaciers. Balog and his team deploy cameras that utilize time-lapse photography across various places in the Arctic to capture a multi-year record of the world’s glaciers.The expedition starts off poorly as the team is plagued by numerous technical problems and camera malfunctions. Meanwhile, due to the extreme physical nature of the expeditions, Balog's personal health suffers in the form of knee complications.After making improvements to the equipment, Balog and his team are finally able to collect time-lapse photos that depict the drastic erosion and disappearance of enormous, ancient glaciers.","cinematography":"Jeff Orlowski","directed_by":"Jeff Orlowski","Music":"The film received an Academy Award nomination for Best Original Song for the song \"Before My Time,\" written by J. Ralph and performed by Scarlett Johansson and Joshua Bell.[6]","release_dates":"January 23, 2012 (2012-01-23) (Sundance Film Festival)|November 16, 2012 (2012-11-16) (United States)||||","produced_by":"Paula DuPre' Pesemen, Jerry Aronson","running_time":"75 min","music_by":"J. Ralph","edited_by":"Davis Coombe","written_by":"Mark Monroe"}