{"country":"United States","distributed_by":"Warner Bros.","language":"English","Reception":"Badlands was the closing feature film at the 1973 New York Film Festival,[2] reportedly \"overshadowing even Martin Scorsese's Mean Streets.\"[11] Vincent Canby, who saw the film at the festival debut, called it a \"cool, sometimes brilliant, always ferociously American film\"; according to Canby, \"Sheen and Miss Spacek are splendid as the self-absorbed, cruel, possibly psychotic children of our time, as are the members of the supporting cast, including Warren Oates as Holly's father. One may legitimately debate the validity of Malick's vision, but not, I think, his immense talent. Badlands is a most important and exciting film.\"[2] In April 1974, Jay Cocks wrote that the film \"might better be regarded less as a companion piece to Bonnie and Clyde than as an elaboration and reply. It is not loose and high-spirited. All its comedy has a frosty irony, and its violence, instead of being brutally balletic, is executed with a dry, remorseless drive.\"[4] According to executive producer Edward Pressman, apart from Canby's New York Times review, most initial reviews of the film were negative, but its reputation with critics improved over time.[7]Writing years later for The Chicago Reader, Dave Kehr wrote: \"Malick's 1973 first feature is a film so rich in ideas it hardly knows where to turn. Transcendent themes of love and death are fused with a pop-culture sensibility and played out against a midwestern background, which is breathtaking both in its sweep and in its banality.\"[12] Spacek later said that Badlands changed the whole way she thought about filmmaking. \"After working with Terry Malick, I was like, 'The artist rules. Nothing else matters.' My career would have been very different if I hadn't had that experience\".[13] In 2003, Bill Paxton said: \"It had a lyricism that films have only once in a while, moments of a transcendental nature.... You've seen these kinds of moments in other films – they're really hard to pull off, and usually they come off as a pretension. [Malick] knew how to set his characters against the landscape. There's this wonderful sequence where the couple have been cut adrift from civilisation. They know the noose is tightening and they've gone off the road, across the Badlands. You hear Sissy narrating various stories, and she's talking about visiting faraway places. There's this strange piece of classical music [an ethereal orchestration of Erik Satie's Trois Morceaux en forme de Poire], and a very long-lens shot. You see something in the distance – I think it's a train moving – and it looks like a shot of an Arabian caravan moving across the desert. These are moments that have nothing to do with the story, and yet everything to do with it. They're not plot-orientated, but they have to do with the longing or the dreams of these characters. And they're the kind of moments you never forget, a certain kind of lyricism that just strikes some deep part of you and that you hold on to.\"[14]The film has a 98% \"fresh\" rating on Rotten Tomatoes and an average score of 8.9/10 based on the reviews of 50 critics, with the general consensus being \"Terrence Malick's debut is a masterful slice of American cinema, rife with the visual poetry and measured performances that would characterize his work.\"[15] On Metacritic the film holds a weighted score of 90/100 based on 12 reviews.[16] Variety stated that the film was an \"impressive\" debut.[17]Roger Ebert added it to his \"Great Movie\" list in 2011.[18]Martin Sheen commented in 1999 that Badlands \"still is\" the best script he had ever read.[6] He wrote that \"It was mesmerising. It disarmed you. It was a period piece, and yet of all time. It was extremely American, it caught the spirit of the people, of the culture, in a way that was immediately identifiable.\"[6]","Synopsis":"Badlands is set in 1959 and is narrated by the impressionable 15-year-old Holly Sargis (Spacek), a teenage girl living in a dead-end South Dakota town called Fort Dupree. Holly lives with her sign painter father, although their relationship has been strained since her mother died of pneumonia some years earlier. One day she meets the 25-year-old garbage collector Kit Carruthers (Sheen). Kit is a young, troubled greaser, who resembles James Dean, an actor Holly admires. Kit charms Holly, and she slowly falls in love with him. Holly's narration, describing her adventures with Kit in romantic clichés, is juxtaposed with the gradual revelations of Kit's increasingly antisocial and violent behavior. Holly's father disapproves of the relationship between Kit and Holly, and shoots her dog as a punishment for spending time with him. Kit comes to Holly's house and shoots her father dead. They then fake suicide by burning down the house and go on the run together, making their way towards the badlands of Montana. Kit and Holly build a treehouse in a remote area and live there happily for a time, fishing and stealing chickens for food, but are eventually discovered by bounty hunters. Kit shoots the three bounty hunters dead and the couple flee. They next seek shelter with Kit's friend Cato, but when Cato attempts to deceive them and go for help, Kit shoots him, and also shoots a teenage couple who arrive to visit Cato shortly thereafter.Kit and Holly are hunted across the Midwest by law enforcement. They stop at a rich man's mansion and take supplies, clothing and his Cadillac, but spare the lives of the man and his housemaid. Heading across Montana to Saskatchewan, the police find and pursue them. Holly, who is tired of life on the run and of her relationship with Kit, refuses to go with him and turns herself in. Kit leads the police on a car chase but is soon caught, and enjoys the attention he receives from police and reporters. They admire him and engage with him as he is sitting in their custody, asking him questions and cracking jokes. Kit is later executed for his crimes, while Holly receives probation and marries the son of her defense attorney.","cinematography":"Tak Fujimoto Stevan Larner Brian Probyn","badlands":"Badlands promotional poster","directed_by":"Terrence Malick","Score":"The film's score makes repeated use of the short composition Gassenhauer from Carl Orff's Schulwerk, and also uses other pieces from the Schulwerk.[citation needed] The same piece was used for a scene in the 1999 film Ratcatcher and used as an influence in the film Monster (2003) and Finding Forrester (2000). A similar-sounding piece by Hans Zimmer titled \"You're So Cool\" is used throughout the 1993 crime film True Romance.[10]","release_dates":"October 15, 1973","Production":"Malick, a protégé of Arthur Penn (whom he thanked in the film's end credits),[4] began work on Badlands after his second year as a student at the American Film Institute.[5] In 1970, Malick, at age 27, began working on the screenplay during a road trip.[6] \"I wrote and, at the same time, developed a kind of sales kit with slides and video tape of actors, all with a view to presenting investors with something that would look ready to shoot,\" Malick said. \"To my surprise, they didn't pay too much attention to it; they invested on faith. I raised about half the money and executive producer Edward Pressman the other half.\"[5] Malick paid $25,000 of his own funds. The remainder of his share was raised from professionals such as doctors and dentists. Badlands was the first feature film that Malick had written for himself to direct.[6]Principal photography took place in the summer of 1972, beginning in July, with a non-union crew and a low budget of $300,000 (excluding some deferments to film labs and actors).[5] The film had a somewhat troubled production history; several members of the crew clashed with Malick and another was severely injured when an explosion occurred during filming of the fire scene.[7][8] The Frank G. Bloom House in Trinidad, Colorado is the location used for the rich man's house where Kit and Holly steal the Cadillac they drive until they are caught. The Film beginning was mostly filmed in the Southeastern Colorado town of Las Animas in Bent County, in which the scene Holly was running out of school, was that of Columbian Elemtary School.The film was originally set to be edited by Robert Estrin. However, when Malick saw Estrin's cut of the film, he disliked it, and removed Estrin from the production. Malick himself and Billy Weber then recut the movie. Estrin remains credited as the sole editor, however, with Weber credited as associate editor.[7] Both Weber and art designer Jack Fisk worked on all of Malick's subsequent features through 2016 (The Tree of Life, To the Wonder, Knight of Cups).[9]Though Malick paid close attention to period detail, he did not want it to overwhelm the picture. \"I tried to keep the 1950s to a bare minimum,\" he said. \"Nostalgia is a powerful feeling; it can drown out anything. I wanted the picture to set up like a fairy tale, outside time.\"[5] Malick, at a news conference coinciding with the film's festival debut, called Kit \"so desensitized that [he] can regard the gun with which he shoots people as a kind of magic wand that eliminates small nuisances.\"[2] Malick also pointed out that \"Kit and Holly even think of themselves as living in a fairy tale\", and he felt that was very appropriate as \"children's books like Treasure Island were often filled with violence.\" He also hoped a \"fairy tale\" tone would \"take a little of the sharpness out of the violence but still keep its dreamy quality.\"[5]Warner Brothers eventually purchased and distributed the completed film for a sum just under a million dollars.[5] Warners initially previewed the film on a double bill with the Mel Brooks comedy Blazing Saddles, resulting in very negative audience response, and forcing the production team to book the film into several other theaters in locations such as Little Rock, Arkansas to demonstrate that the film could make money.[7]","produced_by":"Terrence Malick Edward R. Pressman","starring":"Martin Sheen Sissy Spacek Ramon Bieri Warren Oates","running_time":"95 minutes","music_by":"George Tipton James Taylor (theme \"Migration\")","edited_by":"Robert Estrin","written_by":"Terrence Malick","budget":"$500,000 (estimated)"}