{"country":"United States","distributed_by":"Universal Pictures","Plot":"Slicker Smith and Herbie Brown (Abbott and Costello) are sidewalk peddlers who hawk neckties out of a suitcase. They are chased by a cop and duck into a movie theater, not realizing that it is now being used as an Army Recruitment Center. Believing that they are signing up for theater prizes, they end up enlisting instead.Meanwhile, spoiled playboy Randolph Parker (Lee Bowman) and his long-suffering valet, Bob Martin (Alan Curtis), are also enlisting at the old theater. Randolph expects his influential father to pull some strings so he can avoid military service. Bob, on the other hand, takes his military obligations in stride. Tensions between the two men escalate with the introduction of Judy Gray (Jane Frazee), a camp hostess and friend of Bob's upon whom Randolph sets his sights.At boot camp, Slicker and Herbie are mortified to discover that the policeman who chased them (Nat Pendleton) is now their drill instructor(!). Randolph, meanwhile, learns that his father will not use his influence on his behalf, believing that a year in the Army will do Randolph some good. Life at camp is not so bad, since The Andrews Sisters appear at regular intervals to sing patriotic or sentimental tunes, and Herbie continues to screw up with little consequence.Randolph decides to skip an army shooting match, although he is an expert marksman, in order to meet with Judy. The company loses the match—on which, knowing Randolph's shooting skill, they had bet a sizeable amount of money with a competing unit—causing them to resent him. However, during a war game exercise, Randolph redeems himself by saving Bob and coming up with a ruse to win the exercise for his company. He is finally accepted by his unit, and wins Bob's and Judy's admiration in the process. He soon learns that he's been accepted to Officer Training School but initially refuses, thinking that his father's political influence was responsible. However, his commanding officer assures him that his training record (along with recommendations from others in his class) factored in the decision. Randolph later finds out that Bob has also been offered an appointment to OTS, and Judy announces that she will be joining them as a hostess at the OTS training facility. As their Drill Sgt has won bets with the \"Blue army\" Smith and Brown try to sucker play with dice the Sgt gambling winnings-but its Brown who ends up losing his \"pants\" and having to wear a barrel!","language":"English","Reception":"The film received positive reviews from critics. Theodore Strauss of The New York Times called the film \"an hour and a half of uproarious monkeyshines. Army humor isn't apt to be subtle and neither are Abbott and Costello. Their antics have as much innuendo as a 1,000-pound bomb but nearly as much explosive force.\"[3] Variety wrote, \"Geared at a zippy pace, and providing lusty and enthusiastic comedy of the broadest slapstick, Buck Privates is a hilarious laugh concoction that will click solidly in the general runs for profitable biz.\"[4] Film Daily enthused, \"If ever a 'sleeper' appeared out of Hollywood, this is it ... the attraction is a grand, madcap musical which packs a whale of a wallop for the general public liking laughs galore on the frankly slapstick side.\"[5] Harrison's Reports called it \"A good comedy for the masses ... Abbott and Costello definitely establish themselves as a comedy team that should win wide popularity.\"[6]","box_office":"$4,000,000 (USA)[1]","cinematography":"Milton R. Krasner","directed_by":"Arthur Lubin","Award nominations":"The film received two Academy Award nominations in 1941. Hughie Prince and Don Raye were nominated for an Academy Award for Best Original Song for Boogie Woogie Bugle Boy and Charles Previn was nominated for an Academy Award for Original Music Score (Scoring of a Musical Picture). This film was one of the biggest money-makers of the year for Universal, grossing over $4 million at the box office at a time when movie tickets averaged 25 cents. It performed so well, in fact, that Universal gave director Arthur Lubin—who was under contract at a fixed salary—a $5000 bonus.[7]","buck_privates":"Theatrical release poster","release_dates":"January 31, 1941 (1941-01-31) (U.S.)|||||","Production":"Buck Privates was filmed from December 13, 1940, through January 11, 1941. It was originally budgeted at $233,000 and meant to shoot over 20 days; in the end it went $12,000 over budget and four days over schedule.[1]The famous \"drill routine\", where Smitty tries to get Herbie and other soldiers to march in formation, was actually a series of shorter takes that were strung together to expand the bit to more than three minutes of screen time.[1]","Rerelease":"It was re-released in 1948, and again on a double bill with Keep 'Em Flying in 1953. It was one of Universal's most successful war time films.","Home media releases":"This film was released on VHS and Beta in 1983, then re-released on VHS in 1989 and again in 1991.This film has been released three times on DVD. Originally released as single DVD on April 1, 1998 OCLC 44543569, it was released twice as part of two different Abbott and Costello collections. The first time, on The Best of Abbott and Costello Volume One, on February 10, 2004, and again on October 28, 2008 as part of Abbott and Costello: The Complete Universal Pictures Collection. A Blu-ray edition was released on April 17, 2012.","produced_by":"Alex Gottlieb","starring":"Bud Abbott Lou Costello The Andrews Sisters","running_time":"84 minutes","music_by":"Charles Previn","edited_by":"Philip Cahn","Andrews Sisters":"The Andrews Sisters perform four songs during the course of the film: \"You're a Lucky Fellow, Mr. Smith\", \"Boogie Woogie Bugle Boy\", \"Bounce Me, Brother, With a Solid Four\", and \"(I'll Be With You) In Apple Blossom Time\". Their performance of \"Bounce Me, Brother, With a Solid Four\" also features one of the more famous Lindy Hop dance sequences of the swing era. Many dancers from Los Angeles, including Dean Collins, Jewel McGowan, Ray Hirsch, and Patty Lacey, are featured.The composers of the songs sung by the Andrews Sisters are Don Raye and Hughie Prince, who appear in the film as new recruits alongside Abbott and Costello.","written_by":"Arthur T. Horman","budget":"$245,000[1][2]","World War II":"Japan used this film as propaganda to demonstrate to its own troops the \"incompetence\" of the United States Army.[1]"}