{"based_on":"Blade  by Marv Wolfman Gene Colan","country":"United States","distributed_by":"New Line Cinema","Connections to the comic":"The character Blade was created in 1973 for Marvel Comics by writer Marv Wolfman and artist Gene Colan as a supporting character in the 1970s comic The Tomb of Dracula. The comic Blade used teakwood knives and was much more the everyman in his behavior and attitude. Though courageous and brave, he displayed flaws as well, such as an inability to get along with certain other supporting cast members and a hatred of vampires that bordered on fanaticism.The character was not originally a \"daywalker\" but a human being immune to being turned into a vampire. Lacking the superhuman speed and strength of his undead quarry, he relied solely on his wits and skill until he was bitten by the character Morbius. (As seen in Peter Parker: Spider-Man #8, first published in August 1999) The film portrayal of Blade was updated for a 1990s audience and the comics character was subsequently modified to match. The film's version of Deacon Frost also differs greatly from his comic counterpart. Although the movie retains Frost's upstart ambitions, he was a great deal younger and more updated for the 1990s.A Blade anime series was also done by Madhouse Company in 2011. The series consists of 12 episodes.","Plot":"In 1967, a pregnant woman is attacked by an unknown creature. She is taken to a hospital where she dies, but her child lives.Three decades later, a woman leads a young man to a rave club filled with vampires who prepare to feast on the man. Vampire-hunter Eric \"Blade\" Brooks enters the club and begins killing the vampires. He sets the last vampire, Quinn, on fire and leaves before the police arrive. In the hospital, Quinn awakens, kills an examiner and bites hematologist Karen Jenson. When Blade intervenes, Quinn escapes. Blade brings Karen back to his safe house, where Abraham Whistler, his mentor and weaponsmith, injects her with garlic extract to suppress her transformation. Whistler informs Karen of the vampires' existence and weaknesses against silver, garlic and ultraviolet rays, as well as the silent war they have been fighting. He and Blade advise her to leave town, as the vampires will hunt her down.Meanwhile, at the House of Erebus, the vampire elders criticize Deacon Frost, a younger vampire, for drawing attention to their kind. The elders insist on subtly ruling humans to avoid an all-out war. Frost, however, believes that vampires should openly enslave humanity. Because he was turned into a vampire instead of being born as one, Frost's opinions are dismissed. Together with his minions, Frost kidnaps and kills the chief vampire of the region and imprisons the other elders.Blade drops Karen off at her apartment. There, a police officer named Krieger attacks her but Blade subdues him. Krieger is a \"familiar\" - a human who serves vampires in hope of being turned into one. Using Krieger, Blade and Karen locate an archive. They interrogate the record keeper and learn of a prophecy concerning La Magra, the Blood God. They run into several vampires who overwhelm Blade, but Whistler bursts in, having followed them the entire time. The trio retreat to a subway tunnel and escapes on a train. Blade injects himself with a serum, and Whistler explains his condition to Karen that Blade's mother, Vanessa, had been bitten while pregnant. Blade was born a half-vampire hybrid and possesses all of the vampires' strengths but none of their weaknesses. However, Blade suffers from a constant thirst for blood, which he suppresses by taking the serum, however, it is becoming less and less effective.Back at the safehouse, Karen resolves to find a cure for vampirism. In the process, she discovers that anticoagulant EDTA reacts explosively with vampire blood. When Blade leaves to acquire his serum, Frost unexpectedly confronts him on the street. He tempts Blade to join him, and retreats when Blade refuses. Blade then fires shot at him when he threw a little girl as she landed in front of a bus, but Blade was there in time to save her. Karen figures out a cure for \"turned\" vampires, including herself. However, the cure doesn't work on Blade. When Blade returns, he finds the safehouse invaded, Karen kidnapped and Whistler infected. Blade gives Whistler a gun to commit suicide, arms himself with weapons - including the newly made EDTA syringes - and leaves.At Frost's penthouse, Blade is shocked to meet Vanessa, who is now Frost's lover. She reveals Frost was responsible for Blade's conditions. Frost's guards capture Blade, then take him and Karen to the Temple of Eternal Night. At the temple, Frost has Blade's blood drained. Karen is thrown into a pit, where she is attacked by a bitten colleague, who failed to become a vampire but is stuck in a zombie-like state. Karen escapes the pit and feeds Blade her blood, restoring his strength. Frost sacrifices the elder vampires in a ritual, absorbing their souls along with Blade's blood, and becomes imbued with their powers. Blade cuts through Frost's minions, including his mother and Quinn, while Karen sprays Mercury with garlic. Blade confronts Frost, whose new powers make him immune to Blade's weapons. Blade injects Frost with multiple EDTA syringes, causing him to explode.As the two leave the temple, Karen offers to find a cure for Blade. He turns her down, and asks her to improve the serum instead. In the epilogue, Blade stops a vampire attack in Russia.","language":"English","box_office":"$131.2 million[3]","Lawsuit":"Marv Wolfman, the original creator of the Blade character, unsuccessfully sued Marvel and New Line for $50 million after the release of the film. He, along with artist Gene Colan, received a \"based on characters created by\" credit in this film, but did not receive credit in Blade II or the TV series.[20]","blade":"Theatrical release poster","cinematography":"Theo van de Sande","production_company":"Marvel Enterprises Amen Ra Films Imaginary Forces","directed_by":"Stephen Norrington","Video game":"A video game based on the movie was published and released by Activision in 2000.[21]","release_dates":"August 21, 1998 (1998-08-21)|||||","Production":"Marvel Studios had developed the film as early as 1992, when rapper/actor LL Cool J was interested in playing the lead role.[5] Blade was eventually set up at New Line Cinema, with David S. Goyer writing the script. According to Goyer, New Line originally wanted to do Blade as \"something that was almost a spoof\" before the writer convinced them otherwise.[2] By 1996 Wesley Snipes was attached to star.[6]When Goyer first pitched the idea of doing a Blade film, the executives of New Line felt there were only three actors who could possibly do the role: Snipes, Denzel Washington, and Laurence Fishburne, but to Goyer, Snipes was always the perfect choice for Blade. Marc Singer was the original choice for Whistler. Jet Li was offered the role of Deacon Frost but opted to do Lethal Weapon 4 instead. Bruce Payne was also considered for the role of Frost.Blade was produced on a budget of $45 million[2] and principal photography commenced on February 5, 1997,[7] in large part done in Los Angeles, with some scenes being shot in Death Valley. All sets were constructed, and all on-set filming occurred, in what was formerly the Redken Shampoo factory in Canoga Park.[8] The effects for the film were done by Flat Earth Productions.[9]A soundtrack containing hip hop music was released on August 25, 1998 by TVT Records and Epic Records. It peaked at #36 on the Billboard 200 and #28 on the Top R&B/Hip-Hop Albums. The British techno band The Prodigy were approached to do the soundtrack and score to the film but had to turn down the offer due to other commitments.The first cut of the film was 140 minutes long and it had a disastrous test screening with audiences. Heavy edits and re-shoots were implemented which delayed the release date more than half a year. The most significant change was the addition of the final sword fight between Blade and Deacon Frost, which did not exist in the original cut. In the original ending, Frost turned into La Magra and became a large swirling mass of blood instead of keeping his form. This was scrapped because they couldn't get the special effects to look right. It can be seen as a special feature on the DVD. Stan Lee originally had a cameo that was ultimately cut from the film. He played one of the cops that came in to the blood club during the aftermath and discover Quinn's body on fire. The scene where Karen and Deacon are talking about the cure for vampirism initially ran a bit longer and answered the question of how the vampires would feed if everybody was turned into a vampire. They would keep some humans alive in giant blood bags to harvest them. The bags can still be seen in a doorway during the scene, and later played an integral part of the plot in Blade: Trinity [10]","produced_by":"Peter Frankfurt|Wesley Snipes|Robert Engelman|Andrew J. Horne|Avi Arad|","starring":"Wesley Snipes|Stephen Dorff|Kris Kristofferson|N'Bushe Wright|Donal Logue|","running_time":"120 minutes[1]","Future":"In August 2014, Snipes spoke about his desire to return to the franchise, telling MTV.com, \"I'd be open to it. I think we've got some stones left unturned and there's some latitude left for us to build on and I'd love to get back in the suit again and do some things I've learned how to do now that I didn't know how to do then.\" [22]","music_by":"Mark Isham","edited_by":"Paul Rubell","Release":"Blade was Marvel's first box office success, and set the stage for further comic film adaptations. Blade followed the disastrous Howard the Duck as the second Marvel property to get a wide theatrical release in the United States. The Punisher and Captain America both had films made previously, but neither saw a theatrical release in the United States.The film went to number one in both Spain and Australia for their opening weekends. With 200 theatres showing the film, Spain's filmgoers earned the film $1.5 million (US) in three days, whilst Australia earned $1 million from 132 cinemas showing the film.[11] In the Flemish Region of Belgium, the film earned $323,000 from 20 cinemas, and the Netherlands earned the film $246,000 from 44 cinemas.[12] France made $1.9 million in five days from 241 cinemas, but the film was less successful in Hong Kong (with $182,000 from 22 cinemas) and South Africa ($159,000 from 64 cinemas). The United Kingdom was more successful, taking in $5.7 million over 10 days,[13] as was Brazil, making $855,000 in four days from 133 cinemas.[14] The film was banned from showing in Malaysia, widely considered to have the most controlling censors in Southeast Asia.[15]On review aggregator Rotten Tomatoes, the film holds a 54% rating.[16] Roger Ebert gave the film 3 stars out of 4, writing: \"Blade ... is a movie that relishes high visual style. It uses the extreme camera angles, the bizarre costumes and sets, the exaggerated shadows, the confident cutting between long shots and extreme closeups. It slams ahead in pure visceral imagery.\"[17] Conversely, James Berardinelli gave the film 2½ stars out of 4, writing: \"Blade has the capacity to dazzle, but it also will leave many viewers dissatisfied.\"[18]Critics such as A. Asbjørn Jøn have noted not only the important place of Blade (film) in the wider vampire genre but also possible intertextual links between the Whistler character and a character named Whistler in A Dozen Black Roses (1996) by Nancy A. Collins, as they possess \"striking similarities in role, dramatic focus, visual appearance, and sharing the name\".[19]","written_by":"David S. Goyer","budget":"$40 million[2]"}