{"country":"United States","distributed_by":"Columbia Pictures","absence_of_malice":"Absence of Malice promotional movie poster","Plot":"Miami liquor wholesaler Michael Gallagher (Newman), who is the son of a deceased criminal, awakes one day to find himself a front-page story in the local newspaper, indicating that he is being investigated in the disappearance and presumed murder of a local longshoremen's union official, Joey Diaz.The story was written by Miami Standard newspaper reporter Megan Carter (Field), who reads it from a file, left intentionally on the desktop of federal prosecutor Elliot Rosen (Balaban). As it turns out, Rosen is doing a bogus investigation and has leaked it with the purpose of squeezing Gallagher for information.Gallagher comes to the newspaper's office trying to discover the basis for the story, but Carter does not reveal her source.Gallagher's business is shut down by union officials who are now suspicious of him, since he has been implicated in Diaz's murder. Local crime boss Malderone, Gallagher's uncle, has him followed, just in case he talks to the government.Teresa Peron (Melinda Dillon), a lifelong friend of Gallagher, tells the reporter that Gallagher couldn't have killed Diaz because he was taking her out of town for an abortion on that weekend. A devout Catholic, she doesn't want Carter to reveal this publicly, but Carter prints the story anyway. When the paper comes out the next morning, Peron is so ashamed that she steals newspapers from the yards of her neighbors. Later, offscreen, she commits suicide.The paper's editor McAdam tells Carter that Peron has committed suicide. Carter goes to Gallagher to apologize, but an enraged Gallagher assaults her. Nevertheless, she attempts to make it up to him by revealing Rosen's role in the investigation.Gallagher hatches a plan for revenge. He arranges a secret meeting with District Attorney Quinn, offering to use his organized-crime contacts to give Quinn exclusive information on Diaz's murder, in exchange for the D.A. calling off the investigation and issuing a public statement clearing him. Both before his meeting with Quinn and after Quinn's public statement, Gallagher makes significant anonymous contributions to one of Quinn's political action committee backers. Gallagher, thankful for Carter's help, also begins a love affair with her.Rosen is mystified by Quinn's exoneration of Gallagher, so he places phone taps on both and begins a surveillance of their movements. He and federal agent Bob Waddell obtain evidence of Gallagher's donations to Quinn's political committee. They also find out about Gallagher and Carter's relationship.Waddell, as a friend, warns Carter about the investigation to keep her out of trouble, but she breaks the story that the office of the district attorney (D.A.) is investigating Gallagher's attempt to bribe the D.A.The story makes the front page again and causes a huge uproar over the government investigating the District Attorney. The US Assistant Attorney General Wells (Wilford Brimley) ultimately calls all of the principals together. After the truth comes out, Wells suggests Quinn resign. (Gallagher's donations to Quinn's political committee, though not illegal, cast suspicions on Quinn's motives in issuing his statement clearing Gallagher.) Wells also suspects that Gallagher set everything up, but cannot prove it, so he will not investigate further. Finally, Wells fires Rosen for malfeasance. The newspaper now prints a new story written by a different reporter revealing details of the incidents.It is unclear whether Carter keeps her job, or whether Carter's relationship with Gallagher will continue, but the final scene shows them having a cordial conversation on the wharf where Gallagher's boat is docked.","language":"English","Reception":"Absence of Malice received mostly positive reviews. Rotten Tomatoes gives the film a score of 86% based on reviews from 22 critics, with an average score of 6.6/10.[4] Newman and Dillon's performances were praised, as was Brimley's cameo. Many reviewers compared the film to the 1976 Academy Award-winner All the President's Men.In his review, Time magazine's Richard Schickel wrote, \"Absence of Malice does not invalidate All the President's Men. But with entertainment values – and a moral sense — every bit as high as that film's, it observes that there is an underside to journalistic gallantry.\"[5] Similarly, Variety called it \"a splendidly disturbing look at the power of sloppy reporting to inflict harm on the innocent.\"[6]The Chicago Sun-Times' Roger Ebert wrote that some may take the approach \"that no respectable journalist would ever do the things that Sally Field does about, to, and with Paul Newman in this movie. She is a disgrace to her profession.\" Instead he preferred a \"romantic\" approach, writing that he \"liked this movie despite its factual and ethical problems\" and wasn't \"even so sure they matter so much to most viewers.\"[7] Janet Maslin of the New York Times found the movie lacking in momentum, but praised its \"quiet gravity.\"[8] Dave Kehr of the Chicago Reader disliked Absence of Malice, writing that \"the picture has a smug, demoralizing sense of pervasive corruption.\"[9] Although Pauline Kael described the film as only \"moderately entertaining\", she offered higher praise for Newman's \"sly, compact performance\" and particularly for \"the marvelously inventive acting of Melinda Dillon\". [10]Absence of Malice was nominated for three Academy Awards; Best Actor in a Leading Role (Newman), Best Actress in a Supporting Role (Dillon) and Best Writing, Screenplay Written Directly for the Screen. At the 32nd Berlin International Film Festival the film won an Honourable Mention.[11]","box_office":"$40,716,963","cinematography":"Owen Roizman","directed_by":"Sydney Pollack","release_dates":"December 18, 1981 (1981-12-18)|||||","Production":"The movie was written by Kurt Luedtke, a former newspaper editor, and David Rayfiel (uncredited).[2] Newman stated that the film was a \"direct attack on the New York Post\", which had earlier published a caption for a photo of Newman that he stated was inaccurate. Because of the dispute the Post banned him from its pages, even removing his name from movies in the TV listings.[3]","produced_by":"Sydney Pollack Ronald L. Schwary","starring":"Paul Newman|Sally Field|","running_time":"116 minutes","music_by":"Dave Grusin","edited_by":"Sheldon Kahn","written_by":"Kurt Luedtke David Rayfiel (uncredited)"}