{"country":"United Kingdom","distributed_by":"Anglo-Amalgamated","Plot":"While on foot patrol, Police Constable Don Ross (Anthony Oliver) chances upon a gang of lorry hijackers operating from the back of a transport café. After seeing Diamond (George Murcell) and Johnny (David Graham) drive off in a car with the manageress, Connie Williams (Miriam Karlin), apparently being held hostage in the back seat, Ross jumps onto and clings to the vehicle's side; however, he is quickly thrown into the road, suffering a head injury. Pretending to have come across the disorientated officer purely by chance, Diamond and Johnny drop Ross off at his home. Later, Williams is brought before the hijackers' wealthy ringleader, Miles (Ferdy Mayne), who warns her not to betray the gang to the authorities.Despite strong evidence linking the gang to a spate of vehicle thefts along the A1 road, Ross is unable to persuade his superior, Sergeant Pearson (Arthur Rigby), to investigate the café. He therefore pursues the matter on his own, confronting Diamond with his knowledge and forcing the gangster to bribe him in exchange for his silence. When Pearson learns of Ross' private investigation, he threatens the officer's job, causing tension between Ross and his wife Joan (Patricia Heneghan).Ross continues to gather evidence while the hijackers capture a shipment of cigarettes worth £10,000. As the gang prepare to make one last raid – their target being a £20,000 haul of nickel ingots – Ross himself joins the operation with the aim of exposing Miles. Having uncovered the truth behind Ross's actions, Diamond pulls a gun on the officer and chases him through the cellars underneath the café. Wounding Ross with one of his bullets, Diamond eventually corners him, only to be shot dead by Johnny – an undercover detective who has successfully infiltrated the gang. Johnny informs Ross that the authorities are already aware of Miles' location and that he and the rest of the gang will soon be apprehended. Ross returns to his former life as an ordinary beat constable.","language":"English","Reception":"When the film finished and the lights came up, there was complete silence. Then Nat Cohen turned round slowly and said, \"Well, I've seen worse.\" In retrospect, I can smile about it. But whenever I work on a production I give it my all in terms of energy and hours spent trying to get it right. Crossroads to Crime was no exception. So at the time I felt terrible about it not being up to the standard I'd hoped it would be.On top of a poor commercial showing at the box office in 1960, critical reception to Crossroads to Crime has remained consistently negative.[10] Anderson once called it \"possibly the worst film ever made\",[1] while Elliott considers it \"awful\".[3] Cohen and Levy were similarly unimpressed and offered Anderson no further commissions for Anglo-Amalgamated.[6] During the promotional campaign for Thunderbirds Are Go, made by AP Films' successor company Century 21 and released in 1966, Sylvia Anderson said of the earlier film, \"The less said about it, the better\";[16] she has since commented that it \"hardly ranks as one of our best efforts\".[17] A contemporary review in Monthly Film Bulletin was more positive: \"Quick off the mark, this modest little thriller soon settles down into a routine 'cops and robbers' format, efficient if not always too convincing.\"[1] Stronger praise came in the October 1960 issue of Kine Weekly, which commended Crossroads to Crime as being \"refreshingly free from pretence\", adding: \"The film's moral is lofty, its tender domestic asides encourage feminine interest, and the climax is a corker.\"[10]Simon Archer and Marcus Hearn, writers of Anderson's official biography, describe Mayne as the film's \"saving grace\".[2] However, they consider Gray's music overbearing and unsuited to the subject matter, commenting, \"Its innovative combination of booming brass and twangy electric guitar was possibly intended to evoke the contemporary sounds of Stanley Black or John Barry, but fell wide of the mark on both counts.\"[10] Crossroads to Crime is summed up as \"irredeemably compromised by its prosaic settings, convoluted screenplay and minuscule budget\".[2] Stephen La Rivière, writer of Filmed in Supermarionation: A History of the Future, notes that it is \"remembered with dread\", describing the \"wafer-thin\" story is a \"tedious affair\" before criticising the editing for producing a finished version that is \"more than a little rough around the edges\".[3] He suggests that what little attention Crossroads to Crime receives is attributable to the fact that the Andersons would go on to produce the highly successful Thunderbirds.[11]","crossroads_to_crime":"Original title","cinematography":"John Read","production_company":"AP Films","directed_by":"Gerry Anderson","release_dates":"November 1960","Production":"Following the success of Four Feather Falls, in 1960 Gerry Anderson approached Anglo-Amalgamated for work after broadcaster Granada Television rejected his plans for a new Supermarionation television series, which would ultimately become Supercar.[6] Known for distributing such films as the Carry On series,[7] Anglo-Amalgamated had helped to commission Four Feather Falls after responding positively to its pilot episode.[8] It often produced low-budget B movies with short running times to increase the amount of British-made content in its output.[7] Desperate for a project from Anglo-Amalgamated's founders Nat Cohen and Stuart Levy, and keen to establish himself as a film director, Anderson agreed to make such a title without a contract and on a low budget of £16,250 (equivalent to £337,000 in 2015).[7][9] Alun Falconer, writer of the Peter Sellers thriller Never Let Go and the crime drama The Unstoppable Man, wrote the script.[7] As an in-joke, Four Feather Falls is mentioned in the film's dialogue when two young men consider a tune from the TV series' soundtrack while searching for records to play on the transport café's jukebox.[10]Impressed by his performance in a West End production of the Agatha Christie murder mystery The Mousetrap, Anderson cast actor Anthony Oliver in the leading role of Police Constable Don Ross.[7] David Graham, who appears as undercover agent Johnny, had starred in a 1957 episode of the TV series Martin Kane, Private Investigator that Anderson had directed.[9] A number of the cast contributed to later Anderson productions: George Murcell (Diamond) provided the voices of Professor Popkiss and Masterspy in the first series of Supercar, while Graham voiced various characters in Stingray and Thunderbirds.Anderson remembers that Ferdy Mayne (Miles) occasionally misinterpreted the script.[10] A scene between Oliver and Miriam Karlin (Connie Williams) at the café was re-mounted several times when Karlin repeatedly \"upstaged\" Oliver, changing the arrangement of the scene with the result that the other actor's face was hidden from the camera.[10] Terence Brook, who was cast based on his \"tough-guy\" appearance in an advertisement for Strand cigarettes, was doubled by editor and second unit director David Elliott for a stunt sequence in which gang member Harry jumps off the back of a lorry.[11]Filming was conducted in and around Slough, Buckinghamshire and Maidenhead, Berkshire over five weeks between May and June 1960.[2][6] The Slough location shooting made use of the AP Films Studio itself (doubling as the gang's warehouse), a café on the other side of the road (as the main hideout), the woods of Burnham Beeches[2][11] and various points along the A4 road.[9] Halliford Studios in Shepperton, Surrey was also used briefly for filming.[7] On one occasion, when the production had fallen behind schedule and night filming inside the café had run into the morning, the crew attached black drapes to the windows to block out the dawn sunlight and allow the shoot to finish.[2]A number of production staff – including Elliott and John Read, the director of photography – would continue to be employed by AP Films. Anderson's future wife, Sylvia, performed the uncredited role of continuity supervisor under her maiden name, Thamm.[1] After the filming was completed, Anderson and his first wife divorced and he was remarried to Sylvia.[1]Composer Barry Gray recorded his musical score in six hours[12] on 21 June 1960.[9][10] The music accompanying the opening credits was recycled for the Supercar episode \"The White Line\", the Fireball XL5 episode \"The Robot Freighter Mystery\" and the Captain Scarlet and the Mysterons episode \"Manhunt\";[9] it was also released on the Fanderson soundtrack sampler International Concerto and Other Classic Themes in 2005. In a biography of Gray, it is suggested that the instrumental character of the soundtrack is emulated by later Anderson TV series, such as Thunderbirds.[13]To secure a family-friendly U certificate from the British Board of Film Classification, Elliott dubbed over expletives such as \"bloody\" (which was replaced with the milder \"ruddy\").[10] In addition, to make the film more accessible to American audiences, references to \"quid\" (a British slang term for the pound sterling) were also changed during post-production.[10] The BBFC certified the film U on 26 July 1960.[9][14]","Distribution":"The tagline for the November 1960 theatrical release was \"£20,000 the Prize and Death the Price!\"[1] During the 1960s, the film was incorporated into the Edgar Wallace Mysteries B-movie series (also distributed by Anglo-Amalgamated) and re-edited with new opening credits.[4][5] Crossroads to Crime has been transmitted at least once on British TV since the 1960s.[1] A print of the film is owned by the British Film Institute, which screened it at the National Museum of Photography, Film and Television's Pictureville Cinema, Bradford in 1997 to commemorate Anderson's career in TV and film-making.[1]Crossroads to Crime was not released in any home video format until a Region 2 DVD was published by Network Distributing in 2013.[4][5] The DVD version of the film is introduced by the newer \"Edgar Wallace Presents\" credits, with the originals provided as an extra feature.[4][5] Also included is a behind-the-scenes film, Remembering Crossroads to Crime, featuring interviews with the Andersons, editor David Elliott and actor David Graham.[4][5] The BBFC has re-classified the film PG for \"moderate violence\".[14]","produced_by":"Gerry Anderson","starring":"Anthony Oliver Ferdy Mayne George Murcell Miriam Karlin Arthur Rigby David Graham","running_time":"57 minutes","music_by":"Barry Gray","edited_by":"David Elliott","written_by":"Alun Falconer","budget":"£16,250"}