{"country":"United States","distributed_by":"TriStar Pictures","3_ninjas:_high_noon_at_mega_mountain":"Theatrical release poster","language":"English","Reception":"The film had universally negative reviews and is generally considered to be the worst of the four in the series.[2] It holds a 29% audience rating on Rotten Tomatoes based on 76,075 votes.","box_office":"$ 375,805 (U.S.) (sub-total)","cinematography":"Blake T. Evans","production_company":"Sheen Productions, inc. Leeds Ben-Ami Productions, inc.","directed_by":"Sean McNamara","Plot synopsis":"During their summer vacation with their grandfather Mori, Rocky, Colt and Tum-Tum take a test on an obstacle course in pitch blackness. They fail the test, much to Mori's disappointment. Later that night, he overhears Rocky and Colt planning on not returning the next year, due to getting older and he becomes depressed at this.Returning home, Tum-Tum also becomes depressed that his favorite TV Series Dave Dragon is going off the air soon and not even food can cheer him up, which confuses his mother Jessica. They meet a new neighbor, Amanda who accidentally sends her remote controlled helicopter into their house; she apologizes, and Jessica invites her to attend Tum-Tum's birthday party at Mega Mountain; an amusement park modeled after Six Flags. Once they get to the park, Rocky goes off on his own to be with his girlfriend Jennifer while Tum-Tum convinces Colt to go with him to a special live Dave Dragon show as his last performance. While the kids are enjoying themselves, a thief named Medusa Rogers and her men sneak in and commandeer the park, disabling many rides and shutting the place down to hold the patrons hostage in exchange for $40 Million from the park's owner Harry Jacobson. The boys and Amanda discover this and save Dave from being captured, as he seems to be the only viable threat to Medusa's plans. Amanda uses her laptop to try and override the controls, but Medusa's henchmen wrest control from her. Fearing they will interfere with her, she sends her idiot nephews out to capture them, but they are tricked by the boys and their access to an arsenal of small weapons and devices that Amanda possesses. Meanwhile, Dave sneaks into the command center, but is quickly discovered and captured.Finding video of Rocky and his girlfriend, she sends her second-in-command Lothar out to make sure they don't interfere. He captures Jennifer and ties her to the bottom of a roller coaster loop. Medusa threatens to release the breaks and crush her if they don't cooperate, but Rocky goes to rescue her. After a fight leading Rocky and Lothar to the top of the coaster, Rocky sends him off and he bounces out of the park and into the hands of the FBI. He then manages to free Jennifer before the roller coaster can crush them. Jacobson arrives via helicopter with the money to pay the ransom, but Amanda manages to destroy one of the bags with her helicopter. She is quickly captured by Medusa and they escape underground with the remainder of the money. Darkening the halls, the boys must overcome their weakness in the dark in order to rescue Amanda, who is tied to a bomb. They manage to free her, but they are unable to disarm the bomb, they attach it to an oxygen tank and with Dave's help, they bat off the top of the tank, sending it like a torpedo down Medusa's escape route. Alerted to the explosion, the FBI manages to capture Medusa, who resigns herself to defeat.Now hailed as heroes, the boys give the credit to Dave Dragon, hailing him as the real hero, to the press, the boys return home and assure Mori they will not be leaving their training. They also extend the offer to Amanda to come train with them the following year, and she gladly accepts.","release_dates":"April 10, 1998 (1998-04-10)|||||","Development":"Filming began in 1996. Hulk Hogan, wrestling in World Championship Wrestling at the time, wore a wig for the film which resulted in him having a different hairstyle than his traditional bald look. As a result, he is seen in Halloween Havoc 1996 with a similar hairstyle as he had in the film. Elitch Gardens, the park at which it was filmed, underwent a complete remodel, with all the signs for the park and rides being changed and renamed for the film. However, there are a few times when the real ones are seen in the background.","produced_by":"Arthur Leeds Sang-ok Shin","starring":"Hulk Hogan Loni Anderson Jim Varney Mathew Botuchis Michael O'Laskey II James Paul Roeske II Brian Carl Victor Wong Alan McRae","running_time":"93 min. (94 min. in video release version)","music_by":"John Coda","edited_by":"Annamaria Szanto","written_by":"Sean McNamara Jeff Phillips"}