{"country":"United States","distributed_by":"Paramount Pictures","Plot":"The basic plot concerns Groucho, as explorer Captain Geoffrey (or Jeffrey) T. (\"The 'T.' stands for Edgar.\") Spaulding, attending a party in his honor at the estate of society matron Mrs. Rittenhouse, and investigating the theft of a valuable painting during the party. The bulk of the movie consists of a succession of comedy sketches, one liner jokes, and visual gags.","Multicolor clip":"In the 1990s, a 15-second clip filmed in Multicolor during the rehearsal of a scene in Animal Crackers was found and aired as a part of the AMC documentary Glorious Technicolor (1998). The clip is significant because it is the oldest known color footage of the Marx Brothers, and also for an appearance by Harpo without his usual costume and wig.[10]","language":"English","animal_crackers":"Theatrical release poster","directed_by":"Victor Heerman","Re-release":"In December 1973, UCLA student and Marx Brothers fan Steve Stoliar drove to Anaheim, California, to view a rare screening of Animal Crackers at the Old Town Music Hall theater. The print shown there was a poor-quality bootleg, probably because the film had not been distributed for theatrical release since the mid-1950s. Paramount Pictures had allowed its licenses to expire, and rights had reverted to the authors of the Broadway stage play: the playwrights George S. Kaufman and Morrie Ryskind, the composer Harry Ruby, and the lyricist Bert Kalmar. Although EMKA, Ltd. (now part of Universal Television) had acquired Paramount's older films in 1959, Animal Crackers evidently was regarded as a mess best left untouched. Stoliar impulsively called Groucho Marx to enlist Groucho's support for an unlikely campaign to attempt to persuade — or pressure — Universal to re-release the film. Groucho agreed to visit the UCLA campus for a publicity event.[5]On February 7, 1974, Groucho and his assistant, Erin Fleming, visited UCLA under the aegis of Stoliar's newly formed \"Committee for the Re-release of Animal Crackers\" (CRAC). The event drew about 200 students, 2,000 signatures on re-release petitions, and several reporters.[6] Universal scrambled to appear responsive: a spokesman told a UCLA Daily Bruin reporter that the studio was \"delighted\" by the interest, and that \"we have negotiated with the heirs of the writers (Morrie Ryskind and George S. Kaufman), but they were asking much more than we wanted to spend. Just recently we reached an agreement, and we're waiting to sign the contracts.\" (Not quite: Ryskind was still in the pre-heir stage — he lived until 1985. The songwriter Harry Ruby was also alive, though he died two weeks later, aged 79.) The spokesman added that he expected the film would soon be released. As the Daily Bruin put it, \"The rest of the day belonged to Groucho, as he showed surprising flashes of his old brilliance.\" Asked to name his favorite comedian, he said: \"Me.\" He also said that \"Animal Crackers is the best of our movies.\"[7]Groucho's UCLA appearance generated national press coverage. An appearance on the nationally syndicated Merv Griffin Show soon followed. In April, 1974, Groucho and Stoliar \"received an answer from Universal. According to Vice President Arnold Shane, they were 'delighted with the response of the students.'\" On May 23, 1974, attempting to gauge public interest, Universal screened a sharp new print of the film at the UA Theater in Westwood, just south of the UCLA campus. Groucho made a personal appearance and walked unescorted into the theatre on the left aisle. He was wearing his beret. People in the audience stood up and started applauding and soon the entire theater joined in. Encouraged by the response there — the lines stretched around the block for months — on June 23 the studio screened the film at the Sutton Theater in New York.[8] Groucho attended the New York premiere. A near-riot broke out and a police escort was summoned. From there Animal Crackers went into national release.It is also because of these rights issues that Animal Crackers did not see an appearance on television until July 21, 1979, when CBS aired a special broadcast of the film.[9]","Jokes":"Four of Groucho's best known quips:Other quotes from Groucho:The film also contains the well-known Chico-Harpo scene in which Chico keeps asking Harpo for \"a flash\" (meaning a flashlight), and Harpo—not understanding—produces from his bottomless trenchcoat and baggy pants a fish, a flask, a flute, a \"flit\", a \"flush\", etc.Zeppo figures in a well-known scene in which Groucho dictates a letter to his lawyers in rambling pseudo-legalese. Zeppo gets to one-up Groucho: When asked to read the letter back, Zeppo informs him, \"You said a lot of things I didn't think were very important, so I just omitted them!\" whereupon a minor skirmish ensues: what he's omitted is the body of the letter. (Joe Adamson, in Groucho, Harpo, Chico, and Sometimes Zeppo, observed that this scene disproved the common notion that Zeppo was the least of the Marx Brothers: \"It takes a Marx Brother to pull something like that on a Marx Brother and get away with it.\")One more complex running joke has Groucho turning the dialogue into a scene out of the Eugene O'Neill play, Strange Interlude, in which the characters continually spoke asides that convey their thoughts. Groucho's voice becomes deep and droning as he steps apart from the other characters to comment on the scene:\"Living with your folks. Living with your folks. The beginning of the end. Drab dead yesterdays shutting out beautiful tomorrows. Hideous, stumbling footsteps creaking along the misty corridors of time. And in those corridors I see figures, strange figures, weird figures: Steel 186, Anaconda 74, American Can 138...\"The comedy, thus, is in the unpredictable shifting of the scene's meaning, from two socialite ladies and a world-famous explorer mingling at a party, to a parody of O'Neill's work, to a mimicking of a man reading out stock prices. Incidentally, Groucho had heavy investments in Anaconda Copper and after having lost everything in the stock market crash of 1929 experienced a bout of depression as well as insomnia.[3]In the final scene, Harpo uses a Flit gun to pacify an entire crowd, finally spraying Groucho, who falls unconscious to the ground. The current prints of the film have the \"Flit\" name blotted out, since Paramount Pictures didn't get permission to use the trademarked name.","release_dates":"August 23, 1930 (1930-08-23)|||||","starring":"Groucho Marx Harpo Marx Chico Marx Zeppo Marx Lillian Roth Margaret Dumont","running_time":"96 minutes","Musical numbers":"Groucho's songs, \"Hello, I Must Be Going\" and \"Hooray for Captain Spaulding\", both written by Bert Kalmar and Harry Ruby, became recurring themes for Groucho through the years. The latter song became the theme of Groucho's radio and TV game show You Bet Your Life. It referred to a real Captain Spaulding, an army officer arrested a few years earlier for selling cocaine to Hollywood residents. The original full version of \"Hooray for Captain Spaulding\" was edited in compliance to the Hays Code when it was re-released in 1936: the sexually suggestive line \"I think I'll try to make her\" was removed - it came after Mrs. Rittenhouse's line: \"He was the only white man to cover every acre.\" There is no known print or audio of those few seconds that were trimmed from the film. Prints of the film reveal an obvious edit when they reach that point in the song.Ironically, Groucho used an even more risqué line in introducing Chico's piano sequence: \"Signor Ravelli's first selection will be, 'Somewhere My Love Lies Sleeping', with a male chorus.\" Chico's own piano composition \"I'm Daffy over You\" would be played again in their next feature film, Monkey Business, by Harpo on the harp.","music_by":"Bert Kalmar Harry Ruby","written_by":"Bert Kalmar Harry Ruby George S. Kaufman"}