{"country":"United States","distributed_by":"Columbia Pictures","daddy_day_care":"Theatrical release poster","Plot":"Charlie Hinton (Eddie Murphy) is a recently laid-off food products marketing executive and stay-at-home father whose wife Kim (Regina King) has just gone back to work as a lawyer. They enroll their child, Ben (Khamani Griffin), in Chapman Academy, a very academic pre-school headed by Miss Harridan (Anjelica Huston). But when Kim finds out how much the parents have to pay per month, she takes Ben out of Chapman and looks for other daycare facilities. Unable to find either a suitable daycare or new employment, Hinton opens up a day care center in his home with the help of his best friend Phil Ryerson (Jeff Garlin) and calls it Daddy Day Care. At first, the local moms are suspicious of men wanting to work with children, but as Daddy Day Care is cheaper and more child-centered than the academy, the latter begins to lose students.Unwilling to accept the presence of competition, Miss Harridan attempts to shut down Daddy Day Care by notifying child services that Charlie and Phil are not following the relevant regulations. Mr. Kubitz (Jonathan Katz), a director of child services, notifies them of the codes that need to be fixed, which Charlie and Phil quickly correct. Daddy Day Care grows in popularity and attracts more children. Mr. Kubitz informs Phil and Charlie that they need another employee to keep an appropriate ratio of children to caregivers. Luckily, Marvin (Steve Zahn), a nerdy former co-worker, had dropped by, and after seeing how good he is at entertaining the children, Phil and Charlie ask him about joining. Marvin is unsure at first, but then finds himself falling for Kelli (Leila Arcieri), the single mother of Dylan, and agrees.Later, Mr. Kubitz tells them they have too many kids to stay at Charlie's residence. They find an abandoned building with potential, but do not have the money to buy it. They hold a fund-raising event called \"Rock for Daddy Day Care\", which Miss Harridan finds out about. She and her assistant Jennifer (Lacey Chabert) wreck the festival by unplugging a bouncy castle, filling the food with cockroaches, switching face paint with glue, releasing animals from the petting zoo and turning on the park sprinklers. Daddy Day Care does not raise enough money. Shortly after, Charlie and Phil are offered their old jobs back, accepting Miss Harridan's offer to take the kids back to the academy. Marvin, heartbroken by the closing of the day care, declines Charlie and Phil's offer to be on board their marketing panel.Charlie soon realizes during a cereal pitch that the time he has given to his new life, and the increased bond with his son is \"the most important thing\", and starts to question the morality of his current assignment (which involves marketing high-sugar breakfast cereal to children). He resigns his job, picks up Phil and Marvin before heading off to Chapman Academy, and successfully convinces the children and their parents to return to Daddy Day Care, making it a raging success, causing Chapman Academy to shut down. Marvin is now in a relationship with Kelli, Miss Harridan gets demoted to a crossing guard, and Jennifer joins Daddy Day Care at the new facility.","language":"English","box_office":"$177.4 million[1]","cinematography":"Steven Poster","production_company":"Revolution Studios Davis Entertainment","directed_by":"Steve Carr","release_dates":"May 9, 2003 (2003-05-09) (United States of America)|||||","Production":"In April 2002, The Hollywood Reporter reported Eddie Murphy was to reteam with Steve Carr, whom directed Dr. Dolittle 2, in Daddy Day Care.[2] In June 2002, Anjelica Huston was in negotiations to star in the film.[3] The following month, Revolution Studios set Jeff Garlin, as well as Steve Zahn, to join Murphy in the film.[4]The movie was filmed on location in and around Los Angeles, California. Production was started on August 5, 2002, and wrapped on November 22, 2002. In December 2002, the film's poster was officially released, with the tagline: D-Day is coming.[5]","produced_by":"John Davis Wyck Godfrey Matt Berenson","starring":"Eddie Murphy Jeff Garlin Steve Zahn Regina King William Coulthard Lacey Chabert","running_time":"96 minutes","Sequel":"In August 2003, soon after the release of Daddy Day Care, Murphy was lured into making a sequel movie, although he hadn't signed up for the film.[8]A sequel was released in 2007 titled Daddy Day Camp, with Cuba Gooding, Jr. replacing Eddie Murphy's role as Charlie Hinton. In 2007, the film won the Razzie Award for \"Worst Prequel or Sequel\".[9][better source needed]","music_by":"David Newman","edited_by":"Christopher Greenbury","Release":"Rotten Tomatoes gives the film a score of 28% rating based on reviews from 127 critics; the site's consensus is: \"Daddy Day Care does its job of babysitting the tots. Anyone older will probably be bored.\"[6] On Metacritic, the film has a 39/100 rating based on 31 reviews, indicating \"generally unfavorable\" reviews.[7]Despite the negative critical ratings, the film was a box office success, grossing over $160 million worldwide based on a $60 million budget.[1]","written_by":"Geoff Rodkey","budget":"$69 million[1]"}