{"based_on":"Characters  by Marlon Wayans Rick Alvarez","country":"United States","distributed_by":"Open Road Films","Plot":"Malcolm Johnson and his cousin Ray-Ray are driving Malcolm's possessed girlfriend Kisha to the hospital after he beat her senseless for trying to attack him. Kisha starts making a fuss and fights Malcolm, then breathes into Ray's face. He passes out at the wheel and collides with a truck. Somehow, everybody is okay, but Malcolm and Ray leave an unconscious Kisha in the backseat and run away. A year later, Malcolm moves in with his girlfriend Megan, an insecure woman with two kids, her bratty and promiscuous teenage daughter Becky and effeminate son Wyatt, who has a stereotypically black imaginary friend named Tony. The family moves into a new home with their dog, Shiloh Jr. After the movers hang a safe next to the lawn, an invisible force unties the rope tied to a support beam, causing the safe to fall on the dog and crush him. Malcolm hysterically cries all the way to when they bury the dog.Megan then puts a creepy looking doll named Abigail on a chair by their bed. Malcolm messes around with it until he starts having sex with it. Malcolm carries his camera around to record everything he sees. He meets the neighbor, Miguel, who jumps at every chance he gets to call Malcolm racist whenever he comments on something related to a Mexican stereotype, though all of it is in jest. Weird things start happening again. Malcolm records himself having sex with Megan and notices the Abigail doll turning its head. He also finds old videotapes with a demonic being in it trying to kill a family of three by hanging them from a tree.He fails when the rope breaks and he never actually gets to hang them. Additionally, Becky finds an old box and develops an attachment to it, and Wyatt continues to hang out with his imaginary friend. Malcolm seeks help from a paranormal psychologist named Professor Wilde. He deduces that Malcolm must have had a previous encounter with a demonic force. Malcolm thinks it has to do with Kisha. Wilde then proceeds to cook meth with some prostitutes. Malcolm finds himself being terrorized and taunted by Abigail, as he is getting sent crude photos from her to his phone. She also ends up burning his clothes. Later, Malcolm sees a box moving in the dark and begins to attack it in every possible way. Megan and the kids run downstairs and tell Malcolm that what was in the box was supposed to be a surprise for him to make up for Shiloh Jr. And so Malcolm pulls out a horribly mangled dog. He blows its head off to put it out of its misery.Among other weird scenarios that plague the family is Becky opening her box and having a whole swarm of moths fly out. Malcolm fixes this by installing lights to attract bugs to their doom. He also notices the demon, which Professor Wilde says is named Aghoul, taunting him in the videos. Although he tries to explain the weirdness to Megan and the kids, they don't believe him. To make matters worse, Malcolm comes home the next day to discover Kisha talking to Megan, looking very much not possessed. She has told Megan that Malcolm left her in a ditch to die, and she leaves after flashing him some scary black demon eyes. Later, Malcolm sees Abigail wrote \"Miss me?\" in red crayon all over the walls. He tries getting rid of her by burying her, but she comes back. He sends her back to Taiwan she still comes back. He chops her up and barbecues her, but again she still comes back.Malcolm resorts to seeking help from the insane Father Doug Williams. He finds the crazy priest in a church, shanking another priest for absurd reasons. When Malcolm asks for his help, Doug only makes weird comments about the Kardashians coming after him and other men. Malcolm leaves when he thinks he sees demons surrounding a church, but they're really just church women who make comments about Malcolm being with a white woman. Miguel comes over and offers a chicken to be used as a blood sacrifice. Malcolm ends up wrestling the chicken all across the kitchen, ending with him throwing the chicken up into the ceiling fan where it is decapitated. He and Miguel fry the remains and eat it with waffles.As a last resort, Malcolm goes to find Ned and Noreen Swanson, a sort of racist and sexually frustrated paranormal investigative husband and wife duo. He brings them to his house, where they determine that the demonic presence has attracted the family to it, explaining Becky's need for the box, Wyatt's imaginary friend, and Malcolm's sexual attraction to Abigail. They take hits from a bong mask and go downstairs to find Becky fully possessed. She flails around and gets thrown everywhere. Malcolm calls upon Doug to come by, but he has a mental breakdown and ends up shooting himself in the head. Becky runs upstairs and Malcolm chases after her. After some reluctance, he gets the demon to transfer itself to himself by having Becky regurgitate red goo. Everybody runs upstairs to find Malcolm possessed. He too pukes up the goo back into Becky's box. The Swansons take the possessed items, including Abigail so Ned can have sex with her. Everything seems okay until the night when Malcolm and Megan are watching TV and Kisha shows up behind them. She twists Megan's neck around, sending Malcolm running away.Ray and his boys come to Malcolm's house to find Megan dead, along with Becky upstairs, impaled in her bed, and Wyatt is missing. They find Malcolm lying on the floor in the basement, still alive. After a bit of panicked rambling, Kisha comes downstairs, leaving all the guys to scream in fear.","language":"English","box_office":"$24 million[2]","cinematography":"David Ortkiese","production_company":"IM Global Octane Wayans Bros. Entertainment Baby Way Productions","directed_by":"Michael Tiddes","a_haunted_house_2":"Theatrical release poster with original release date","release_dates":"April 18, 2014 (2014-04-18)|||||","Production":"On April 8, 2013, it was confirmed that Wayans, Open Road Films, and IM Global Octane would produce a sequel due to the financial success of the first film.[5] On May 3, 2013, it was confirmed that A Haunted House 2 would be released on March 28, 2014.[6] On August 24, 2013, it was announced that Jaime Pressly, Ashley Rickards and Gabriel Iglesias had joined the cast of the film.[7] Principal photography and production began on August 26, 2013, and ended on September 29, 2013.[7][8] On January 18, 2014, the film was pushed back to April 18, 2014.[9]","produced_by":"Marlon Wayans Rick Alvarez","starring":"Marlon Wayans Jaime Pressly Essence Atkins Gabriel Iglesias Cedric the Entertainer","running_time":"86 minutes[1]","music_by":"Jesse Voccia","edited_by":"Tim Mirkovich","Release":"A Haunted House 2 grossed $17.3 million in North America, and $6.6 million in other countries, for a worldwide total of $24 million, against a budget of $4 million.[2]In North America, the film opened at number five in its first weekend with $8,843,875, behind Transcendence, Heaven Is for Real, Rio 2, and Captain America: The Winter Soldier.[10] In its second weekend, the film dropped to number 10, grossing an additional $3,202,679.[11] In its third weekend, the film dropped to number 14, grossing $1,075,668.[12] In its fourth weekend, the film dropped to number 22, grossing $346,430.[13]Like its predecessor, A Haunted House 2 was panned by critics. Review aggregation website Rotten Tomatoes gives the film a rating of 8% based on 37 reviews, with an average rating of 2/10. The site's consensus reads, \"Sloppy, vulgar, and manic, A Haunted House 2 might be worth a chuckle or two, but mostly it's a string of pop culture references and crude gags that fail to hit their intended targets.\"[14] Another review aggregation website, Metacritic, gave the film a score of 17 out of 100, based on 16 critics, indicating \"overwhelming dislike\".[15]Bruce Demara of the Toronto Star gave the film half a star out of four, saying \"It is a vile, wretched, appalling waste of time, a movie for morons that is offensive on so many levels. It is loud, profane and profoundly stupid. One has to question how a film so awful could even be made, it is that bad. Most regrettably, it is not funny, not even a tiny bit.\"[16] John Semley of The Globe and Mail gave the film zero stars out of four, saying \"A Haunted House 2 is dumber than dumb dumb, which at least has the nerve to be unapologetically dumb. Worse, it's Wayans dumb.\"[17] Kevin C. Johnson of the St. Louis Post-Dispatch gave the film three out of five stars, saying \"This send-up of current horror movies is a go-for-broke hoot, a hot mess of a comedy that doesn't have a lick of sense. And knowing that going in adds to the often knee-slapping laughs.\"[18] Jennifer Miller of Film.com gave the film a one out of ten, saying \"There are almost no redeeming qualities to this movie. It is bad enough to trigger an existential crisis in the heartiest of movie-lovers.\"[19] Justin Lowe of The Hollywood Reporter gave the film a negative review, saying \"Wayans' performance again relies primarily on mugging it up and outrageous attempts at self-indulgent humor to elicit laughs, topped with copious doses of raunchy sexual innuendo and activity.\"[20] Stephan Lee of Entertainment Weekly gave the film a D, saying \"You don't walk into a movie like A Haunted House 2 expecting anything remotely scary or serious, but you don't expect to walk out feeling a terrible sense of dread, either.\"[21]Stephanie Merry of The Washington Post gave the film a negative review, saying \"A Haunted House 2 is so bombastically stupid that its well-earned R rating doesn't seem sufficient. The movie should come with another warning: The following 87 minutes would be better spent alphabetizing your spice rack.\"[22] Alonso Duralde of The Wrap gave the film a negative review, saying \"Calling this one an improvement is like saying that being kicked in the shin is better than being punched in the stomach. Either way, it hurts.\"[23] Andrew Barker of Variety gave the film a negative review, saying \"Marlon Wayans' parody sequel is as inept and puerile as its predecessor, but let no one say its screenwriter and star doesn't give it his all.\"[24] Sherilyn Connelly of The Village Voice gave the film a positive review, saying \"Though he's not for all tastes, there's something admirable about Wayans's willingness to do anything for a laugh, often reminiscent of Jerry Lewis at his most frantic.\"[25] Scott Tobias of The Dissolve gave the film a negative review, saying \"Like sunrise over a steaming pile of garbage, A Haunted House 2 offers another sharp whiff of its predecessor, a Scary Movie-style spoof of the Paranormal Activity movies that makes up in volume what it lacks in invention.\"[26] Ignatiy Vishnevetsky of The A.V. Club gave the film a D+, saying \"A Haunted House 2 is unlikely to put anyone to sleep. That’s enough to mark it as an improvement over its predecessor, a Scary Movie take-off so poky and dull that it played more like a bad festival-circuit art film than a bad lowbrow comedy. However rubbery and manic, though, A Haunted House 2 still can’t overcome star attraction Marlon Wayans’ severely limited comic skill set.\"[27]A Haunted House 2 was released on DVD and Blu-ray on August 12, 2014.[28]","written_by":"Marlon Wayans Rick Alvarez","budget":"$4 million[2]"}