{"based_on":"Doug  by Jim Jinkins","country":"United States","distributed_by":"Buena Vista Pictures Distribution","Plot":"Doug (Tom McHugh) and Skeeter (Fred Newman) discover a Monster (Frank Welker) that lives in Lucky Duck Lake. Believing the monster is evil, they are scared of him at first, but later on, they find him to be nice. Despite this, however, the monster is proof that Bill Bluff (Doug Preis) is polluting the lake, and this fact created this monster. The Monster almost eats the book Moby Dick, but Skeeter stops him and says, \"Stop! You almost ate Herman Melville! You don't eat books, that is a NO!\" and the monster returns it to them as an apology, so they name him Herman Melville after the Monster takes a liking to the author's name. Unfortunately, all of this commotion with the monster makes Doug forget that he was supposed to meet Patti (Constance Shulman) at Mr. Swirly's (Bruce Bayley Johnson). When he remembers this at the last minute, he runs to Swirly's as fast as he can using the quickest shortcuts that he knows. Once he gets there, Patti is nowhere to be seen. He asks Mr. Swirly if he's seen her, and he says the she was here for a while and looked very upset, and then left with a guy who kept talking about his big plans for a dance. When Doug heard this, he knew that this guy was no one else but Guy Graham (Guy Hadley), a snobby upper class man who wants Patti. Meanwhile, Roger (Chris Phillips) and the AV nerds are building a robot (Eddie Korbich) to kidnap Herman, but when they build the robot it acts like Roger's babysitter, much to his dismay and annoyance.Doug then rushes to the Funky Town night club, where Guy and Patti are working on the dance. He apologizes to Patti there and she accepts his apology, but Guy cuts in and says that Doug is \"just a stupid little kid.\" Doug, very angry now, says that he has proof that Bluff is evil and is polluting the lake. Guy then calls Doug a liar. Doug then invites them both to the report that is being held in front of Mr. Dink's (also played by Newman) house about Herman and the pollution. Doug then leaves, but the picture of the monster falls out of his pocket without him knowing. Guy picks up the picture and realizes that Doug was telling the truth; however, he calls Bluff, with whom he has connections to. At the reporting, Doug sees that a news reporters camera is inflatable. He then realizes that the news company is a fake, that it is supporting Bluff, and trying to compensate the monster. Doug then has to tell everyone that there has been a mistake, Patti gets mad at him, thinks that he is a liar and walks away with Guy.That night, Bluff finds the boys with Herman and kidnaps the monster. The next morning, Doug knows that this is his last chance to save Herman. He goes to the school newspaper room, hoping to find Guy who can lead him to Bluff. Guy isn't in the room, but Doug sees a newspaper article that says that Bluff and his men blast a monster to smithereens at a school dance. Doug is at first sad and believes that Herman has died, but he then realizes that the school dance isn't until tonight and this is what is being planned to happen, so Doug and Skeeter call Roger and The Sleech twins (also voiced by Korbich) to help.At the school dance, Doug has to make the biggest choice of his life: going after Patti or saving Herman. When he does the latter, Bluff catches the quintet in front of Crystal Lake and plans to enslave them, but is stopped by his daughter, Beebe, and Mrs. Dink (Doris Belack). Beebe forces Bluff off of the scene to defend her friends. Doug then finds Patti in front of the woods and Doug tries to tell her he is in love with her, but is interrupted by Herman. With the return of Herman and a copy of the newspaper, Patti sees that Doug had been telling her the truth all along and dumps Guy. Also, Skeeter gives Herman the Moby Dick book for something to eat in the lake and Herman also gives Doug a flower to give to Porkchop (also played by Newman) to which Porkchop comes running out of the woods into Herman's arms (earlier in the film, Porkchop was opposed to Herman, but softened up when the Monster gave the dog a gift). The kids say goodbye to Herman; after Herman jumps back into the lake, Doug tells Patti he likes her and Roger almost becomes friends with Doug, but is interrupted by the robot. Doug starts dancing with Patti and Skeeter dances with Beebe as the music continues in the background, ending the film.","language":"English","Cast and characters":"Main charactersCast","box_office":"$19.4 million[1]","doug's_1st_movie":"Theatrical release poster","production_company":"Walt Disney Pictures Jumbo Pictures A. Film A/S Walt Disney Television Animation","directed_by":"Maurice Joyce","release_dates":"March 26, 1999 (1999-03-26)","Production":"Nickelodeon set out to do a Doug film in 1993, to be released by 20th Century Fox, along with films based on Rugrats and The Ren & Stimpy Show, but the plans fell through and the films were never produced (with the exception of Rugrats, which got a 1998 film by Paramount Pictures).[2]When The Walt Disney Company bought Jumbo Pictures along with the cartoon, they decided to re-circle the project for the Doug film. This film was originally planned as a direct-to-video release under the title The First Doug Movie Ever as shown in trailers, but due to the success of The Rugrats Movie, it saw a theatrical release. The film was released on VHS on September 21, 1999, and on DVD as a Disney Movie Club exclusive on July 20, 2012.","produced_by":"David Campbell Melanie Grisanti Jim Jinkins Bruce Knapp Jack Spillum","starring":"Tom McHugh Fred Newman Chris Phillips Constance Shulman Frank Welker Alice Playten Guy Hadley","running_time":"77 minutes","music_by":"Mark Watters","edited_by":"Alysha Cohen Christopher Gee","Release":"The film garnered a 26% approval rating on Rotten Tomatoes, with 8 of a total 32 reviews being determined as positive.[3] Critics were harsh to Doug's 1st Movie when it was released theatrically. Many noted that the film felt too much like an extended episode of the show (story and animation-wise) and many mention that the film should have stayed a direct-to-video release. Screenit.com awarded the film 4 out of 10. The reviewer mentioned it was mediocre and did not have \"that magic or cinematic feel to warrant the big screen treatment\" and it felt like the regular series.[4] Kenneth Turan however was positive toward the film, on the show At the Movies he gave the film a thumbs up, while Roger Ebert gave it a thumbs down.Doug's 1st Movie opened at #5 in its opening weekend with $4,470,489, for an average of $1,971 from a very wide 2,268 theaters. While this may be deemed as low for an average Hollywood film, Doug only cost $5 million to make due to its direct-to-video budget and a somewhat low-key promotional campaign. As such, the film still managed to gross $19,421,271 in ticket sales, creating a large profit for Disney and making it a box office success.","written_by":"Ken Scarborough","budget":"$5 million"}