{"country":"Italy","Comment":"Verdone's second movie, coming through his successful Fun is beautiful (Un sacco bello). He uses the same formula of the first work, as director and multi-role starring. The election day as background to mock the miseries and hardships of Italian society, especially in the emigrant's misfortunes. The producer Sergio Leone was formerly afraid the character Furio would result hateful to viewers, so he was of an old aged and actual diabetic Lella Fabrizi's performance. He's latter agreed with Verdone's choices. The obsessive, pedantic Furio character often falls in Verdone's works, telling to be inspired by one's of his relatives. Russian actress Irina Sanpiter was chosen because of her big blue eyes and angelical, pale face. Pasquale's dated character stereotypes the helpless Italian emigrant, emphasyzed by his untidy and old fashioned wear, garish car decoration, listening of Italian '50s music.","distributed_by":"Medusa Produzione","Plot":"Italian election day in the early '80s. Three men leave to reach their voting places. Furio, a pedantic and chatterbox clerk living in Turin, is with his family on his way to Rome, so are half witted Mimmo with his diabetic grandmother. Pasquale, an Italian emigrant in Germany and married to a local valkyrie-like woman, leaves alone with his Alfasud car to Matera, South Italy. Theirs is an eventful journey through Italian motorways. Furio's wife Magda is on the edge of a nervous breakdown because of his character. Mimmo is continuously mocked by his disabled but smart grandmother. Pasquale, ignoring all current hardships of Italy, gets some theft in each stop. Magda, Mimmo and their relatives spend a night in the same motel, while Furio stays at hospital because of a car crash. The woman is courted by Raul, a handsome man that follows them from the beginning. Mimmo is taken by a call-girl who works in the motel. He's so idiot to ignore her job and he mistakes her pubic hair with a \"fur underwear\". Pasquale's car eventually miss seats, windscreen and decorative wheel rims. They eventually get to their polling stations. Magda escapes with Raul while Furio is voting. Mimmo's grandma dies in the voting cabin and the scrutiners argue the validity of her vote while Mimmo is crying and screaming. Pasquale gives to the scrutiners his anger. He speaks a fictitious and unintelligible dialect, upon his misfortunes and hardships of Italy and uselessness of his vote.","language":"Italian","cinematography":"Luciano Tovoli","directed_by":"Carlo Verdone","bianco,_rosso_e_verdone":"Film poster","release_dates":"20 February 1981","produced_by":"Sergio Leone","starring":"Carlo Verdone, Mario Brega, Elena Fabrizi","running_time":"110 minutes","music_by":"Ennio Morricone","edited_by":"Nino Baragli","written_by":"Leonardo Benvenuti, Piero De Bernardi, Carlo Verdone"}