{"based_on":"Ali G from Da Ali G Show","country":"United Kingdom","distributed_by":"United International Pictures (UK)|Universal Pictures (US)|","Plot":"Ali G is the leader of Da West Staines Massiv, a fictional gang composed of wannabe gangsters from Staines; their chief rivals are Da East Staines Massiv. Da West Staines Massiv are heartbroken to learn that their beloved local leisure centre will be demolished by the local council, so they decide to protest. After he goes on a hunger strike and is spotted chained to some railings by the Chancellor of the Exchequer and Deputy Prime Minister David Carlton, he is drawn into a world of political intrigue, as the Deputy Prime Minister tries to use Ali as a tool to destroy the Prime Minister's credibility. Ali is put forward as a candidate to be the next MP for Staines and manages to alienate most who cross his path. During a debate with his rival candidate, Ali tries to insult his rival by claiming that he \"sucked off a horse,\" but the rival did do it and Ali wins.Out of his depth as a Member of Parliament, Ali's bizarre behaviour and solutions seem to work. He visits a Customs checkpoint in Dover, as a delegate compiling a report. Through ideas such as making more relatable education and ensuring the immigration of attractive women into the UK, Ali becomes incredibly popular, meeting the Prime Minister's intentions and bringing his percentage lead in the polls up twenty two percent. With this the Prime Minister offers to save Ali's leisure centre. Ali accompanies the Prime Minister to a United Nations peace conference to avert war between the French-speaking African nations of Chad and Burkina Faso. The United States and Russia back opposite countries and both threaten nuclear attacks. Ali sneaks into the catering area and puts a bag of marijuana into the delegates' tea. A side-effect is that the two opposing presidents become allies. The Prime Minister says that Ali has saved the world. Carlton's secretary Kate Hedges figures out what Ali has done and retrieves the empty bag, which she mails to the press. Upon his return to the UK, Ali is forced to leave parliament.Before the Leisure Centre can be saved, a video emerges of Ali and his girlfriend having sex in the Prime Minister's bedroom at Chequers. As Ali was wearing items of the Prime Minister's at the time, the media believe the video details the Prime Minister with a prostitute, forcing his resignation. This results in Carlton being made Prime Minister. Carlton orders the destruction of the leisure centre. He has bought all available real estate in Staines knowing that the town will be destroyed to make way for a new terminal for Heathrow Airport, which will make him wealthy. The West Staines Massiv race to find the master copy of the CCTV tape proving the former Prime Minister's innocence, extending the olive branch to the gangs of Staines and Berkshire to help them break into the vaults and retrieve the tape. They do this successfully and reinstate the original Prime Minister, save the Leisure Centre, and live happily ever after when Ali is posted as the British ambassador to Jamaica. Carl is forced to work under Ali in Jamaica and dance with other people during Ali's parties. Staines is saved from destruction, with the Prime Minister declaring that Slough is to be destroyed instead.","language":"English|French|Spanish|","box_office":"$25.9 million[2]","cinematography":"Ashley Rowe","directed_by":"Mark Mylod","Soundtrack":"On 18 March 2002, a soundtrack album for the film was released. Featuring music used in the film, it also featured linking material by Ali G, as if the album was a pirate radio broadcast on Ali's \"Drive By FM\". It was an enhanced CD, featuring the music video for \"Me Julie\".","production_companies":"Working Title Films StudioCanal WT2 Productions Talkback Productions","release_dates":"22 March 2002 (2002-03-22)|||||","Production":"The opening 'gangland' dream sequence was filmed in Los Angeles, with all other scenes photographed in London and Staines.When Ali references the Berkshire Massiv of Englefield Green, this is actually in Surrey. The John Nike Leisure Centre is a real facility, though located several miles west of Staines in Bracknell, central Berkshire.","produced_by":"Sacha Baron Cohen|Dan Mazer|Tim Bevan|Eric Fellner|","starring":"Sacha Baron Cohen","running_time":"88 minutes[1]","Cultural impact":"Staines was officially renamed by local councillors to Staines-upon-Thames in part to avoid the fictional gangland associations implied by this film.[9]","ali_g_indahouse":"Theatrical release poster","music_by":"Adam F","edited_by":"Paul Knight","Release":"The movie premiered in UK theaters on 22 March 2002, and across various other countries (France, Germany, Ireland, Norway, Poland, Spain, etc.) throughout the rest of 2002 and midway through 2003.[3] Ali G Indahouse was not theatrically released in the United States and Canada.The film was released via DVD in the UK on 11 November 2002, and in the US and Canada on 2 November 2004. The DVD version has been modified from the original UK theatrical version. In the original cut, the movie opens with Ali G appearing over the BBFC Certificate and changes the categorisation from '15' to '18'. He goes on to warn about having sex in the back row of the cinema (other people's semen on the seats) and to suggest that our enjoyment will be enhanced by lighting a spliff. [4]This thirty second introduction is missing from all international theatrical releases as well as all current home video releases.The film received mixed reviews, holding a 56% rating on review aggregator website Rotten Tomatoes.[5] It opened to some notably negative reviews from critics; however, over the years, the film began to receive some positive mentions following the successes of Borat and Brüno. While some hailed it as a successful low culture comedy,[6] it inspired little of the strong fan enthusiasm associated with Da Ali G Show[7] and with Baron Cohen's subsequent film, Borat.[8]","written_by":"Sacha Baron Cohen|Dan Mazer|","budget":"£5 million|($7 million)|"}