{"country":"United States","distributed_by":"Atlantic Releasing","Plot":"The boys (Robert Downey, Jr. and Kiefer Sutherland) arrive on Easter morning and shout their greetings across the glen to their family during a lakeside Easter Sunrise service, much to the amusement of Ralph's younger sister Beth (Winona Ryder) and mother Ev (Joanna Cassidy) and embarrassment of Scott's mother Jessie (Mariette Hartley) and father Cliff (Bruce Dern).Emboldened by the news of Alden's disappearance, Ralph and Scott hatch a plan to steal their files from the local draft board office.Scott is now determined to avoid Ralph's fate and plans to leave town and head to Canada to avoid the draft. Beth finds Scott in his van and convinces him to allow her to join him on his trip. They admit their attraction to each other. Later, the two decide to visit Ralph in jail to tell him that they are leaving.Scott and Beth get to the Canadian border and are about to cross but have a change of heart and head back to Maryland. When they get home, they learn of Alden's death. Scott leads a huge march downtown in the midst of the Alden's funeral, and where Ralph is released from jail and they are reunited.","language":"English","Critical reception":"Critics shared some mixed feelings about the movie. Overall, the film has a 55% \"Rotten\" rating on Rotten Tomatoes based on 11 critic reviews. \"\"1969,\" the directorial debut of Ernest Thompson, is an aimless drama, its purpose and promise lost in a thicket of false endings and a fog of nostalgia,\" wrote Rita Kempley of The Washington Post.[2] Janet Maslin of The New York Times, wrote that \"Mr. [ Bruce ] Dern, unusually laconic here, is unexpectedly moving as the character who seems most confused by changing times.[3] And Variety said of it, \"Affecting memories and good intentions don't always add up to good screen stories, and such is the case in 1969, one of the murkiest reflections on the Vietnam War era yet, notwithstanding good performances all around and bright packaging of Kiefer Sutherland and Robert Downey, Jr. in the leads.\"[4]","box_office":"$5,979,011[1]","cinematography":"Jules Brenner","directed_by":"Ernest Thompson","Soundtrack":"The film's soundtrack consists of original period rock. However, it also includes a notable re-recording of The Youngbloods' classic hit \"Get Together\", performed as a solo by Youngbloods lead singer, Jesse Colin Young.","release_dates":"November 18, 1988 (1988-11-18)|||||","Box office":"The film was a box office bomb, grossing $5,979,011 against a $37 millon budget.","produced_by":"Bill Badalato Daniel Grodnik","starring":"Robert Downey, Jr.|Kiefer Sutherland|Bruce Dern|Mariette Hartley|Winona Ryder|Joanna Cassidy|","running_time":"95 minutes","1969":"Theatrical release poster","music_by":"Michael Small","edited_by":"William M. Anderson","written_by":"Ernest Thompson","budget":"$37 million"}