{"country":"United States[2]","distributed_by":"Universal Pictures","Plot":"Scarlett Marlowe, a young alchemy scholar, continues her dead father's work searching for the philosopher's stone, a legendary alchemical substance said to be capable of turning base metals such as lead into gold or silver and grant eternal life, discovered by Nicolas Flamel. After finding the \"Rose Key\" in a cave in Iran which she narrowly escapes as it collapses, she travels to Paris, where she then enlists the help of George, her former lover whom she abandoned in Turkey while in pursuit of the stone. Along with Benji the cameraman, they translate Flamel's headstone, which contains a riddle that leads them to a point, 370 feet underneath the streets of Paris. She then enlists the help of a guide called Papillon, his girlfriend Souxie, and friend Zed to search the Catacombs beneath Paris, France, to locate the stone. George explicitly refuses to go, but is driven into the caves with the group when they are spotted by a policeman. After crawling through a narrow tunnel which collapses, they encounter some female cultists who are singing and have possessed appearances. They find themselves in a blocked tunnel that Papillion is reluctant to breach, as the only people who have gone through, including Pap's friend La Taupe (The Mole), have never been seen again.After venturing deeper into the catacombs, they encounter La Taupe, who agrees to guide them out, and informs them that the only way out is down. They eventually find a tomb with a preserved Templar Knight, a mound of treasure, and the Flamel Stone. Removing the stone, Scarlett realizes too late that the treasure is a trap, and the room collapses. La Taupe is lost under the rubble and is left behind by the group.With the Flamel Stone, Scarlett magically heals the group's injuries. They find a drawing of a door on the ceiling along with a Gnostic Star of David, symbolizing \"As above, so below,\" revealing a door hidden in the floor. Going through the opening, they find a tunnel marked with the phrase \"Abandon all hope, ye who enter here\" in Greek, identical to the entrance to Hell.Passing through, they find a dark reflection of the room they just left, including La Taupe, who attacks and kills Souxie, before disappearing in the narrow tunnels. They realize they must continue and go deeper in order to find a way out. Along the way, Benji the cameraman is pushed to his death down a hole by the lead female cultist, who caught his eye in Paris as well as while singing in the upper levels of the catacombs. Later they encounter a burning car and an occupant, an incident from Pap's past who pulls in Papillon and then sinks into the floor. They attempt to pull Pap out of the ground, but to no avail. As they continue, they see apparitions of terrifying spirits and demons. Statues in the wall come to life and one attacks George, violently. After trying to drag him further, George murmurs \"Vitriol,\" another riddle from earlier, and Scarlett realizes the Flamel stone itself is yet another trap, and that only by returning it will she find the real stone.She races back to the crypt in a hurry. Along the way, she comes across a room containing a man who hanged himself, who she realizes is her dead father, tearfully holding his corpse. After nearly being dragged down and drowned in a line of blood by an unseen force, she makes it back to the crypt and finds a polished mirror, which is when she realizes she has the magical abilities of the stone. She returns to George, kissing him as she holds his wounds, healing them. She then explains that where they are is about confronting their torments, providing an alternate form of reality, such as George's brother who drowned when he failed to get help for him, her father who called her to tell her he was committing suicide, but refused to answer his call, and a child which Zed refuses to acknowledge, who also plagued him multiple times along the journey. Then as the hooded demons begin to chase them, they find and jump down a deep hole which they first believe that there is no logical way of surviving the fall, but end up surviving. As they land at the bottom, they look up, see the hole they came down is no longer there. Eventually, Scarlett, George and Zed find a manhole on the floor, which when pushed down somehow delivers them right side up onto the surface, on a street overlooking the Notre Dame. Scarlett and George than hold each other while Zed walks away, finally safe. In an ending log, Scarlett concludes her documentary by stating that her mission has been accomplished.","language":"English","Reception":"On Rotten Tomatoes, the film has an approval rating of 26% based on 60 reviews and an average rating of 4.4/10; the general consensus states, \"After an intriguing setup that threatens to claw its way out of found-footage overkill, As Above, So Below plummets into clichéd mediocrity.\"[12] On Metacritic, the film has a rating of 38 out of 100 based on 23 critics, indicating \"generally unfavorable reviews.\"[13]Peter Debruge gave the film a mixed review in Variety, writing, \"It all makes for clumsy-fun escapism, not bad as end-of-summer chillers go, but small-time compared with other Legendary releases\". Debruge called the ending \"unspeakably corny\".[14] Bruce Demara wrote in The Toronto Star, \"As Above, So Below has some good scares and a decent cast. But it’s yet another found footage thriller, so jittery camera sequences may induce nausea.\".[15] Drew Hunt expressed similar sentiments in The Chicago Reader, writing \"An intriguing and intensely creepy premise is sqaundered on this rudimentary found-footage horror film.\".[16] Terry Staunton gave the film a mildly positive review in Radio Times, stating, \"It's a perfectly serviceable addition to the \"found footage\" genre of chillers from director/co-writer John Erick Dowdle (Devil), who puts cameras in each character's helmet, allowing quick cuts from one scene to another. But despite the claustrophobia of the setting, he never quite racks up enough tension for a full-on fright-fest.\"[17] The entertainment oriented website JoBlo wrote, \"Not the worst example of found footage by a long shot, and it moves a decent pace with a couple of good scares. However, this could have been a far more frightening feature if only it had expanded on its scary premise.\"[18]The film grossed $8.3 million its opening weekend, finishing in 3rd place. As of November 4, 2014, the film has grossed $21.2 million in North America and $18.9 million in other territories, for a total gross of $40.1 million.[4]","box_office":"$41.8–41.9 million[4][3]","as_above,_so_below":"Theatrical release poster","cinematography":"Léo Hinstin","production_company":"Legendary Pictures Brothers Dowdle","directed_by":"John Erick Dowdle","release_dates":"August 29, 2014 (2014-08-29)|||||","Production":"With permission from the French authorities the film was shot in the real catacombs of Paris. There was very little use of props, as the actors had to use the environment around them. Production in the actual catacombs was difficult for the cast and especially the crew as there was no electricity or cell phone service in the centuries-old tunnels.[8]","Distribution":"The first trailer of the film was revealed on April 24, 2014.[9] YouTuber PewDiePie and his girlfriend CutiePieMarzia promoted the film by embarking on a quest into the catacombs, where they would be scared in a variety of ways.[10]As Above, So Below was released on DVD and Blu-ray on December 2, 2014.[11]","produced_by":"Thomas Tull|Jon Jashni|Drew Dowdle|Patrick Aiello|","starring":"Perdita Weeks|Ben Feldman|Edwin Hodge|François Civil|Marion Lambert|Ali Marhyar|","running_time":"93 minutes[1]","music_by":"Keefus Ciancia","edited_by":"Elliot Greenberg","written_by":"Drew Dowdle|John Erick Dowdle|","budget":"$5 million[3]"}