{"based_on":"Doctor Dolittle  by Hugh Lofting","doctor_dolittle":"Theatrical release poster by Tom Chantrell","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Leslie Bricusse","Plot":"In early Victorian England, Matthew Mugg (Anthony Newley) takes his young friend Tommy Stubbins (William Dix) to visit eccentric Doctor John Dolittle (Rex Harrison) for a sick duck that Tommy had found in the streets, Dolittle, a former physician, lives with an extended menagerie, including a chimpanzee named Chee-Chee (Cheeta), a dog named Jip, and a talking parrot named Polynesia (the uncredited voice of Ginny Tyler). Dolittle claims that he can talk to animals. In a flashback, he explains that he kept so many animals in his home that they created havoc with his human patients, who took their medical needs elsewhere. His sister, who served as his housekeeper, demanded that he dispose of the animals or she would leave; he chose the animals. Polynesia taught him that different animal species can talk to each other, prompting Dolittle to study animal languages so that he could become an animal doctor.While treating a horse, Dolittle's lack of human empathy offends the horse's owner, General Bellowes (Peter Bull). Bellowes' niece, Emma Fairfax (Samantha Eggar), chides Dolittle for his irresponsibility and rudeness to her uncle. Matthew falls in love with her at first sight. After she has gone, Dolittle admits he also finds her attractive.A friend of Dolittle's sends him a rare Pushmi-pullyu, a creature that looks like a llama with a head on each end of its body. Dolittle takes the creature to a nearby circus, where the Pushmi-Pullyu becomes the star attraction. The doctor befriends a circus seal named Sophie who longs to return to her husband at the North Pole. Dolittle disguises her in women's clothing to convey her to the coast, and then throws her into the ocean. Fishermen mistake the seal for a woman, and have Doctor Dolittle arrested on a charge of murder. General Bellowes is the magistrate in his case, but Dolittle proves he can converse with animals by talking with Bellowes' dog. Though Dolittle is acquitted, the vindictive judge sentences him to a lunatic asylum. Dolittle's animal friends rescue him, and he, Matthew, Tommy, Polynesia, Chee-Chee and Jip set sail in search of the legendary Great Pink Sea Snail. Emma stows away, seeking adventure. They randomly choose their destination: Sea-Star Island, a floating island currently in the Atlantic Ocean.The ship is torn apart during a storm, but everyone washes ashore on Sea-Star Island. Emma and Dolittle admit they have grown to like each other. The party is met by the island's natives, whom they mistake for hostile savages. The populace are highly educated and cultured from reading books that have washed ashore from innumerable shipwrecks. Their leader is William Shakespeare the Tenth (Geoffrey Holder); his name reflects the tribe's tradition of naming children after favorite authors. William explains that they are wary of strangers coming to the island, and that the tropical island is currently endangered because it is drifting north into colder waters. Mistrust leads the islanders to blame the doctor and his party. Dolittle persuades a whale to push the island south, but this causes a balancing rock to drop into a volcano, fulfilling a prophecy that dooms Dolittle and party to be burned at the stake. The whale also causes the island to rejoin the mainland, fulfilling another prophecy that dictates that the doctor and his friends be heralded as heroes, and they are freed. While treating the animals on the island, Dolittle receives a surprise patient - the Great Pink Sea Snail, which has caught a severe cold. Dolittle discovers that the snail's shell is watertight and can carry passengers. Dolittle sends Matthew, Tommy, Emma, Polynesia, Chee-Chee, and Jip back to England with the snail. Emma wishes to stay on the island with him, but the Doctor is adamant that a relationship would never work. She finally admits her love for the Doctor, and kisses him goodbye.Dolittle cannot go back because he is still a wanted man. Furthermore, he wishes to investigate the natives' stories of another creature, the Giant Lunar Moth. After his friends leave, Dolittle realizes painfully that he has feelings for Emma. Sophie the seal arrives, accompanied by her husband. They bring a message: the animals of England have gone on strike to protest his sentence, and Bellowes has agreed to pardon him. Dolittle and the islanders construct a saddle for the Giant Lunar Moth, and Dolittle flies back to England.","language":"English","Reception":"The film's first sneak preview in September, 1967 at the Mann Theatre in Minneapolis was a failure. The audience consisted largely of adults, who were not the primary target audience. The general audience response was muted during the screening and comment cards rated it poorly, with frequent complaints about the film's length. A shorter edit of the film previewed in San Francisco was no more successful; a still shorter edit previewed in San Jose was well enough received to be approved as the final cut.[12]The film had its official Royal World Charity Premiere on 12 December 1967 at the Odeon Marble Arch in London in the presence of HM Queen Elizabeth II. The US premiere was one week later. Doctor Dolittle screenings acted as fundraisers for various places after its release including Cedars of Lebanon Children's Hospital, Project Hope, and the library at The College of Mount St. Vincent.Reviewing the film for The New York Times, Bosley Crowther said, \"The music is not exceptional, the rendering of the songs lacks variety, and the pace, under Richard Fleischer's direction, is slow and without surprise.\"[13] In his annual Movie Guide, critic and historian Leonard Maltin called the film a \"colossal dud\". Maltin admired the film's photography, but was quick to point out how it nearly bankrupted 20th Century Fox. He admitted that, \"The movie has one merit: If you have unruly children, it may put them to sleep.\"[14]The film also faced strong competition from the Walt Disney animated feature film, The Jungle Book, which opened on the same week to considerable critical and audience acclaim. Doctor Dolittle's appeal as family fare was undermined when the press drew attention to racist content in the books, prompting demands to have them removed from public schools.[15]There is speculation that the film's poor reception may have had to do with the timing of its release. Doctor Dolittle came out soon after the smash hit The Sound of Music; starting with that film particularly, film musicals had become all the rage once again, and production studios went on a sort of musical spree. When the musical era began its downturn, Hollywood studios tried to revamp it by creating Roadshow releases that were seen as special events and had expensive tickets, but Roadshow releases became too common as well. By the time Doctor Dolittle had its Roadshow release, audiences were tired of the genre and wanted something different and the film lost $11 million.According to the book Behind the Oscar, Fox mounted an unparalleled nomination campaign in which Academy members were wined and dined. As a result, the film was nominated for nine Oscars, including Best Picture.The film currently holds a 32% rating on Rotten Tomatoes.[16]","box_office":"$9 million[2]","cinematography":"Robert L. Surtees","production_company":"APJAC Productions","directed_by":"Richard Fleischer","Academy Awards":"The film won Academy Awards for Best Effects, Special Effects (L.B. Abbott) and Best Music, Song (Leslie Bricusse for \"Talk to the Animals\").[24]It was nominated for Best Picture, Best Art Direction-Set Decoration (Mario Chiari, Jack Martin Smith, Ed Graves, Walter M. Scott, Stuart A. Reiss), Best Cinematography (Robert L. Surtees), Best Film Editing (Samuel E. Beetley), (Marjorie Fowler), Best Music, Original Music Score (Leslie Bricusse), Best Music, Scoring of Music, Adaptation or Treatment (Lionel Newman), (Alexander Courage) and Best Sound (20th Century Fox).[25]","release_dates":"December 19, 1967 (1967-12-19)|||||","Production":"20th Century Fox had originally intended the film to reunite Rex Harrison and Lerner & Loewe, following the success of My Fair Lady, but Loewe had retired from writing musicals. Alan Jay Lerner was originally chosen to write the script, but was fired by producer Arthur P. Jacobs on May 7, 1965 for his endless procrastination stretching over a year.[4] Jacobs then tried to get the Sherman Brothers, but they were tied to Walt Disney. Instead, Lerner was replaced by Leslie Bricusse, who was in high demand after his success with the musical Stop the World - I Want to Get Off. Determined to make a good impression for his first screenplay commission, Bricusse proved agreeably productive from the start for Jacobs, suggesting numerous story ideas at their first meeting on May 6, 1965 and followed up just two months later with a full treatment that included various song suggestions while effectively blunting the book's racist content in an adaptation that met with Hugh Lofting's widow's approval.[5] Lerner's replacement by Bricusse gave Harrison the chance to sit out his contract, while demanding that the proposed actor for the role of Bumpo, Sammy Davis Jr., be replaced by Sidney Poitier, despite the fact that Poitier was not a musical performer.[6] Eventually, the part of Bumpo was cut altogether. Harrison's demands drove the producers to approach Christopher Plummer as a replacement, but when Harrison agreed to stay the producers paid Plummer his agreed-upon salary to leave the production. The film was originally budgeted at $6 million, but the final cost was triple that.It was photographed in 70 mm Todd-AO by Robert Surtees. The village scenes were filmed in Castle Combe in Wiltshire. The producers did not anticipate that the trained animals for the production would be quarantined upon entering the UK, forcing replacement of the animals at considerable extra expense to meet deadlines. The producers chose to ignore reports of the area's frequently rainy summers, and the resulting weather continually interfered with shooting and caused health problems for the animals. Some of the producers' decisions (such as removing TV aerials from personal residences in town) irritated the population. An artificial dam built by the production was destroyed by British Army officer (and future explorer) Ranulph Fiennes because he believed it ruined the village.[7] The producers were forced to rebuild some sets in California for costly re-shoots. The film ended up taking over four years to complete.Scenes were shot in Marigot Bay, Saint Lucia; this location was equally problematic, and problems with insects and frequent tropical storms halted production. The final scene with a giant snail was complicated not only by the poor design of the large prop, but because the island's children had recently been struck by a gastrointestinal epidemic caused by freshwater snails, and mobs of angry locals threw rocks at it.[8] The Marigot Bay Hotel, now located there, has the Pink Snail Champagne Bar in honor of the film. The walls of the bar are adorned with original photos from the film.Personality conflicts added to the tension during the production. Anthony Newley was incensed by comments made by Harrison that he deemed anti-Semitic. Harrison was apparently jealous of his Jewish co-star's participation, and demanded Newley's role be reduced and disrupted scenes featuring Newley.[9] Geoffrey Holder received racist abuse from Harrison's entourage.[10] The younger cast members grew to loathe Harrison for this abuse and they retaliated by antagonizing him.[9]Over 1,200 live animals were used in the film including dogs, pigs, birds, and even giraffes. One giraffe died on set before insurance had gone into effect. There are anecdotes of a goat who ate a script and a parrot that learned to yell \"cut.\" In one instance, ducks for the film were placed on a lake, but had apparently forgotten how to swim and began to sink. Crew members had to jump into the water to save them. Animals also bit and defecated on the cast and crew.Just prior to release, 20th Century Fox was sued for $4.5 million by Helen Winston, a producer involved early in the development of the film. She claimed that the plot point about animals threatening to go on strike on Dolittle's behalf was lifted from her rejected screenplay. Bricusse, who had read Winston's script, assumed it was from the books and included it in his own treatment by mistake. Because the producers only had rights to the content of the original books, they had no legal defence and were forced to settle out of court. The animal strike is mentioned in the movie but was not actually filmed.[11]","produced_by":"Arthur P. Jacobs","starring":"Rex Harrison Samantha Eggar Anthony Newley Richard Attenborough","running_time":"152 minutes","Influence":"The first film to attempt merchandising was Dr. Dolittle in 1967. It failed miserably. The public was bombarded with over 300 different products to choose from months before the film was even released. Products ranged from talking dolls and soundtracks to cereal and even pet food. However, the marketing efforts did not appeal to the public and $200 million worth of merchandise was never sold. The lackluster sales of tie-in merchandise diminished studio enthusiasm for similar forms of marketing for years. George Lucas took advantage of this attitude to acquire those rights, and he profited spectacularly with his 1977 film, Star Wars Episode IV: A New Hope.In 1998, the film was adapted into a stage musical, starring Phillip Schofield as Doctor Dolittle, a pre-recorded Julie Andrews as the voice of Dolittle's parrot Polynesia, and the animatronic wizardry of Jim Henson's Creature Shop. The show ran for 400 performances in London's West End and at the time was one of the most expensive musicals ever produced. The musical also starred Bryan Smyth, a former milkman and full-time actor and singer who then went on to host his own TV game show for RTÉ.[17]Bobby Darin Sings Doctor Dolittle was released on Atlantic Records in August, 1967.[18] Darin's recording of \"Beautiful Things\" from this LP was featured in a 2013 TV commercial for Etihad Airways.[19][20][21] A cover version of the same song by The Shiny Lapel Trio was used in a Christmas 2008 TV commercial campaign for the United States retail chain Kohl's.[22][23]The film is shown to the students of Springfield Elementary School in the episode \"Cue Detective\" episode of the American television series The Simpsons. The episode first aired on 4 October 2015.","Musical numbers":"In the original cut of the movie, Dr. Dolittle and Emma did eventually begin a relationship. He sang Where Are the Words?, when he realised he was falling in love with her, but in a revised version, it's actually Matthew who falls for Emma and it is his recording of the song which is featured on the soundtrack album.Both versions were filmed and both actors recorded their respective versions, but the footage for both, as well as the vocal track by Rex Harrison have been lost to history.In both scenarioes, Something In Your Smile, is sung by Dolittle when he realizes he himself has fallen for Emma, however, although Harrison's vocal for the song survives, the footage does not.As a result, in an upcoming Special Anniversary Blu-ray deluxe box-set release, 20th Century Fox intends to play audio from both Newley's version of the former as well as Harrison's version of the latter against production stills taken at the time of shooting to give the viewer an idea of how the missing footage might have originally appeared.The film's 1967 release was accompanied by an enormous media blitz, with over a million copies of the soundtrack issued to stores in both Mono as well as Stereo however the advertising campaign failed miserably. Being the last musical to be mixed for mono on a soundtrack album, copies of the original release, especially the monaural versions could be found in \"bargain bins\" for decades after the film's theatrical run. The album has never been re-released on LP since then and only received a CD re-release for its 30th Anniversary; however, no extraneous material such as excised numbers (other than those described above) was included.","music_by":"Leslie Bricusse Lionel Newman, Alexander Courage","edited_by":"Samuel E. Beetley Marjorie Fowler","budget":"$17 million[1]"}