{"country":"United Kingdom","Video release":"The movie was not released on home video until 1996, with the VHS format as part of the Universal Cinema Classics series. Then in 2003 it was released onto DVD in widescreen format, and later re-released as part of the DVD set Marlon Brando: The Franchise Collection.[8]","distributed_by":"Universal Pictures","Plot summary":"Ambassador-designate to Saudi Arabia Ogden Mears (Marlon Brando) sails back to America after touring the world. He meets Natascha, a Russian countess (Sophia Loren), in Hong Kong after she sneaks aboard in evening dress to escape her life at a dance hall for sailors. A refugee, she has no passport and is forced to stay in his cabin during the voyage.Ogden dislikes the situation, being a married man, although seeking a divorce, and worries how it might affect his career if she is found. But he reluctantly agrees to let her stay. They then have to figure out a way to get her off the ship, and it is arranged that she marry his aged valet, Hudson (Patrick Cargill).Although it is only a formality, Hudson wishes to consummate the relationship, a wish she does not share. Natascha avoids him and, before docking at port, jumps off the ship and swims ashore.Ogden's wife (Tippi Hedren) then joins the cruise, having just missed Natasha. Ogden's lawyer friend Harvey (Sydney Earle Chaplin), who helped arrange the marriage, meets Natascha ashore and tells her that the immigration officers have accepted her as Hudson's wife. Ogden's wife then confronts him about Natasha, speaking rather roughly about her and the life she led. He then asks if his wife would have done as well under such circumstances.The film ends with Ogden and Natascha meeting in a hotel's cabaret, where they begin dancing, since he has left the cruise and his wife behind.Charlie Chaplin makes two brief appearances as an aged ship's steward.","language":"English","box_office":"$1,100,000 (US/ Canada)[2]","cinematography":"Arthur Ibbetson","directed_by":"Charlie Chaplin","release_dates":"5 January 1967","Production":"This was Chaplin's first film in ten years, after 1957's A King in New York. He had written a draft of the script in the late 1930s under the working title \"The Stowaway\", as a starring vehicle for his then-wife Paulette Goddard.He originally wanted Rex Harrison or Cary Grant to play the lead but eventually Marlon Brando was cast. Both Brando and Sophia Loren agreed to play their parts without reading a script. Shooting began on 25 January 1966 at Pinewood Studios; it was frequently interrupted by Brando arriving late and then being hospitalised with appendicitis, Chaplin and Brando having the flu, and Loren remarrying Carlo Ponti. Filming wrapped on 5 January 1967.[7]This is Tippi Hedren's first feature film after her break with director Alfred Hitchcock. She had high hopes for the film, until she received the script. When she realised that she had a small part as Brando's estranged wife, she asked Chaplin to expand her role. Although Chaplin tried to accommodate her, he could not, as the story mostly takes place on a ship, which Hedren's character boards near the end of the film. In the end, she remained in the film and later said that it was a pleasure working for him.Chaplin's three eldest daughters appeared in the film: Geraldine (at minutes 46 and 1:05), Josephine and Victoria Chaplin (at minute 1:32).It was filmed entirely at Pinewood Studios in Buckinghamshire, just outside London, in 1966. The film was the second of Universal's European unit, following Fahrenheit 451.","produced_by":"Charlie Chaplin Jerome Epstein","starring":"Marlon Brando Sophia Loren","running_time":"120 minutes","a_countess_from_hong_kong":"Movie Poster","music_by":"Charlie Chaplin","written_by":"Charlie Chaplin","budget":"$3,500,000 (estimated)[1]"}