{"country":"Canada France","distributed_by":"Miramax Films","language":"English Armenian French German","box_office":"$2,743,336[1]","ararat":"Theatrical release poster","cinematography":"Paul Sarossy","directed_by":"Atom Egoyan","release_dates":"20 May 2002 (2002-05-20) (Cannes)|4 September 2002 (2002-09-04) (France)|3 October 2002 (2002-10-03) (VIFF)|15 November 2002 (2002-11-15) (United States)||","Background and structure":"Ararat depicts the efforts of an Armenian director, Edward Saroyan, to make a Hollywood-style film about the Armenian genocide, from the fictionalised point of view of a genuine historical figure, Arshile Gorky. The name of Aznavour's character is a modified version of his character's real name in the classic French film Shoot the Piano Player.As filming progresses, various characters involved with it encounter the ethical problems that arise when adaptating contentious subjects into movies; for example, Ali is a Turkish-Canadian actor who becomes uncomfortable with playing the role of an evil Turkish military officer. There are also a number of secondary plots that relate to the genocide. One involves the relationship between Ani, an art historian who is an expert on Gorky and an adviser on Saroyan's film, and her son Raffi. Another features Raffi and a Canadian customs official, David, whose son is having a homosexual relationship with Ali, the actor in Saroyan's film. David stops Raffi at the airport, suspecting him of carrying drugs into Canada, disguised as film canisters.The film also features roughly shot documentary camcorder footage of Lake Van and real ruined Armenian churches in the deserted city of Ani, near Mount Ararat.","produced_by":"Atom Egoyan Robert Lantos","starring":"Charles Aznavour Christopher Plummer David Alpay Arsinée Khanjian Eric Bogosian","running_time":"115 min.","music_by":"Mychael Danna","edited_by":"Susan Shipton","Release":"The film was screened out of competition at the 2002 Cannes Film Festival.[2] It was then given only a limited release in most countries, and failed to make a significant gross at the box office.[1]The Italian release of Ararat was intended to for 24 April 2003. However, its showing was unexpectedly banned by Italian authorities a day before the planned release, with the authorities explaining that the film's distributor had failed to submit in time the application to obtain the required censorship certificate. The film's distributor BIM Diztribuzione stated that they had never encountered such a problem before. There was media speculation that the film had actually been banned at the request of Turkey.[3]Critical reception was generally positive. Ararat received a 57% rating at Rotten Tomatoes[4] and a metascore of 62 (\"Generally favorable reviews\") at Metacritic.[5]Ararat won several awards. At the 2003 Genie Awards for best Canadian film, it was named best film of the year, and picked up awards for costume design and original score; in addition, Arsinée Khanjian won the best actress award and Elias Koteas best supporting actor. Egoyan won a prize from the Writers Guild of Canada awards, 2003. The film also won an award for best human rights film from the Political Film Society, and won the Golden Apricot at the Yerevan International Film Festival, 2004. An edited version of Ararat has been shown on the Turkish television station Kanal Turk.","written_by":"Atom Egoyan","budget":"$15.5 million[1]"}