{"based_on":"Arthur and the Revenge of Maltazard  by Luc Besson","country":"France","distributed_by":"EuropaCorp (France) 20th Century Fox/The Weinstein Company (USA) Entertainment Film Distributors (UK)","Plot":"In 1963, protagonist Arthur stays with his grandparents for the holidays, during which the Bogo Matassalai (a fictitious African society) assign Arthur a series of tests including camouflage and environmental nonviolence. Having passed these tests, Arthur prepares to see the Minimoys to celebrate, until his father decides to take him and his mother back to the metropolis. When a spider gives Arthur a grain of rice containing a distress-call, which he believes has come from the Minimoys, he returns to his grandparents' house, where the Bogo Matassalai's attempt to give him Minimoy stature through a telescope fails, and they instead wrap him in vines of increasing tightness until he falls in a drop of sap into the Minimoy Max's bar. En route to investigate the Minimoys' condition, Arthur and Max rescue Betameche, who leads Arthur to the King. He then learns that Selenia is held by Maltazard, who is inspired to invade the human world by increasing his own size. Maltazard tricks the Minimoys into completing this design. The telescope itself is destroyed in the process, leaving Arthur trapped at his Minimoy size.","UK version":"Shortly after the third film Arthur 3: The War of the Two Worlds was released, the two films were edited into a single feature titled Arthur and the Great Adventure, which was given a theatrical release in the UK on December 24, 2010.","language":"English","Reception":"Both the original and UK versions received mixed to poor reviews. Arthur and the Revenge of Maltazard is widely thought of as the weakest film in the Arthur series.[3]","box_office":"$78,520,547[1]","cinematography":"Thierry Arbogast","production_company":"EuropaCorp Apipoulaï Avalanche Productions Narfia Entertainment Group","directed_by":"Luc Besson","Home media":"On March 22, 2011 20th Century Fox, the North American distributor for the Arthur films, released Arthur and the Revenge of Maltazard and Arthur and the War of the Two Worlds in a two-movie direct-to-video release titled Arthur and the Invisibles 2+3: The New Minimoy Adventures. A theatrical release for the film was not given in the US after Arthur and the Invisibles was a failure at the North American box office. However, the film was still released theatrically in Europe and as well as in the UK and Ireland as Arthur and the Great Adventure.","Video game":"To promote the film, a video game was released for PlayStation 3, Xbox 360, Nintendo Wii and Microsoft Windows. The game composes of mostly minigames and cutscenes which are loosely related to the plot of the film.","arthur_and_the_revenge_of_maltazard":"Teaser poster","release_dates":"November 26, 2009 (2009-11-26) (Germany)|December 2, 2009 (2009-12-02) (France)||||","produced_by":"Luc Besson Emmanuel Prévost","starring":"Freddie Highmore Selena Gomez Mia Farrow Lou Reed Jimmy Fallon Ron Crawford Stacy Ferguson Snoop Dogg will.i.am Logan Miller Robert Stanton Penny Balfour Jean-Paul Rouve","running_time":"93 minutes","Sequel":"In 2010, a sequel titled Arthur and the War of the Two Worlds was released.","music_by":"Éric Serra","edited_by":"Julien Rey","written_by":"Luc Besson Céline Garcia","budget":"€65 million ($90 million) shared with Arthur 3"}