{"chandni_chowk_to_china":"Theatrical release poster","country":"India","distributed_by":"Ramesh Sippy Entertainment People Tree Films Pvt. Ltd. Orion Pictures Warner Bros.","screenplay_by":"Rajat Arora Sridhar Raghavan","story_by":"Rajat Arora Sridhar Raghavan","Plot":"Sidhu (Akshay Kumar) is a lowly vegetable cutter at a roadside food stall in the Chandni Chowk section of Delhi, who consults astrologers, tarot card readers, and fake fakirs despite his foster father Dada's (Mithun Chakraborty) exhortations. When two strangers from China claim him as a reincarnation of war hero 'Liu Shen' and take him to China, Sidhu, encouraged by trickster Chopstick (Ranvir Shorey), believes he will be feted as a hero, unaware of his own recruitment to assassinate the smuggler Hojo (Gordon Liu).Sidhu travels to China with Chopstick. Along the way he meets Sakhi (Deepika Padukone), the Indian-Chinese spokesmodel known as Ms. Tele Shoppers Media, or Ms. TSM, who also appears in China. Her twin sister Suzy, known as the femme fatale Meow Meow, works for Hojo, not knowing Hojo tried to kill her father, Inspector Chiang (Roger Yuan). Sidhu, through a series of accidents, initially eludes Hojo, but Hojo eventually exposes him as a fraud. Thereupon Hojo kills Dada, and Sidhu is beaten and urinated on by Hojo. Injured and disgraced Sidhu vows revenge. He thereafter encounters an amnesiac vagrant, whom he later identifies to Sakhi as Inspector Chiang. Chiang later recovers his memory and trains Sidhu in kung fu. When Hojo again meets with Sidhu, Suzy injures Chiang; but upon seeing Sakhi, betrays Hojo. Sidhu fights Hojo in single combat, eventually using a modified vegetable-cutting technique to overwhelm him. In the aftermath, Sidhu opens a vegetable stall in China, but is recruited to fight for some African pygmies. The film thereupon concludes with the announcement \"To be Continued – Chandni Chowk to Africa\".","language":"Hindi","box_office":"₹554.7 million (US$8.2 million)[2]","cinematography":"Himman Dhamija","directed_by":"Nikhil Advani","Music":"The music of Chandni Chowk to China was released on 2 December 2008. The album features composers as diverse as Shankar-Ehsaan-Loy, Kailash-Paresh-Naresh, Bappi Lahiri-Bappa Lahiri and Bohemia.Joginder Tuteja of Bollywood Hungama.com rated it 3.5/5, claiming, \"Chandni Chowk to China is clearly the next musical hit in the making.\"[28][not in citation given]The album consists of the following eight tracks:","release_dates":"16 January 2009 (2009-01-16)|||||","Production":"The film, earlier known as Mera Naam Chin Chin Choo and also Made in China,[8] is written by Sridhar Raghavan.Shooting began in January 2008 and included a schedule in China.[9]The music is by Shankar, Ehsaan and Loy. The film also features music by Kailash Kher, Bappi Lahiri-Bappa Lahiri and a rap song sung by Akshay Kumar and composed by Punjabi rapper Bohemia. The soundtrack album was released 2 December 2008.","produced_by":"Rohan Sippy Ramesh Sippy Mukesh Talreja","starring":"Akshay Kumar Deepika Padukone Mithun Chakraborty Ranvir Shorey","running_time":"154 minutes","Cultural impact":"In Nepal, India, and other Buddhist countries there were protests against the film due to a passing claim that Buddha was born in India; Lumbini, which is the birthplace of Buddha, is located in Nepal.Several shows were cancelled in Nepal due to the protests from students, archeologists, Buddhist monks, researchers, and youth groups.[24] Protests included threats by Buddhists to burn cinemas that screened the film, and racial slurs like \"Dhoti\" hurled at the Indian embassy in Kathmandu.[24]The protests continued for several days, despite the Nepali distributor deleting the piece of narration that mentioned Buddha in the copies of the film shown in Nepal. On 22 January Nepali cinemas stopped and banned screening Chandni Chowk to China; but In India, Indian government took no action against that narration.[25]In the aftermath of the Nepal controversy, actor Shekhar Suman criticised the film with some derogatory and rude comments. He also stated the movie is an amateurish attempt by Nikhil Advani, terming it as a \"worst\" film.[26] Mostly, supporters of Kumar especially Nikhil Advani stated that it was a publicity stunt to bring Suman's son Adhyayan in limelight for release of his film Raaz: The Mystery Continues. Suman replied to the claim that it was not a publicity act and the latter apologized to Kumar for it.[27]","music_by":"Shankar-Ehsaan-Loy Kailash Kher Bappi Lahiri Bohemia","edited_by":"Aarif Shaikh","Release":"Chandni Chowk to China earned ₹330 million (US$4.9 million) in its opening weekend.[1] It went on to earn a total of ₹407 million (US$6.0 million) in India.[10] The film's total North American box office in the four weeks of running was $921,738, and total worldwide gross was $13,439,480.[11] The film was rated as a flop.[10]The movie received negative reviews. It received 46% positive ratings on the film-critics aggregate site Rotten Tomatoes[12] and a 44 out of 100 score from Metacritic.[13] Claudia Puig of USA Today said, \"This Indian/Chinese cinematic hybrid is likable and entertaining but overlong and occasionally hokey\", and that star Akshay Kumar's \"physical humor brings to mind Jim Carrey\".[14] John Anderson of Variety wrote, \"If Chandni Chowk to China were a person, it would need Valium\", and found that \"everything is fast and furious, hilarious, hysterical and frantic. Some of the sequences as are quite beautiful and, in the case of the dance numbers featuring Padukone, stunning. But it's the fight scenes as that truly take off\".[15] Frank Lovece of Newsday wrote, \"Less a Bollywood bonbon than a pan-Asian fusion dish, this combination of Indian musical and Chinese chopsocky is, nonetheless, delicious fun\".[16]Steven Rae of The Philadelphia Inquirer stated that, \"Chandni Chowk is entertainingly goofy for about 30 minutes. And then, for the next two hours-plus, it's agony.\"[17] Scott Tobias of The Onion described the film as \"crass, schizophrenic, culturally insensitive, horribly paced, and shameless in its pandering to the lowest common denominator\",[18] while Owen Gleiberman of Entertainment Weekly said, \"This galumphing elephant of a chopsocky revenge-of-the-nerd quasi-musical lacks the lyrical choreographic beauty that has marked such Stateside Bollywood releases as the gorgeous Lagaan\".[19] Michael Philips of the Chicago Tribune called the film \"a massive and rather tiring showcase for Bollywood action hero Akshay Kumar\".[20] Indian critic Taran Adarsh gave the movie 1.5/5 stars, calling it \"a big, big, big letdown\".[21] Rajeev Masand of IBN termed it a tiring watch, while praising Kumar's performance.[22]The film has received one award nomination, with Deepika Padukone being nominated for Best Actress at the 3rd Asian Film Awards held in March 2009.[23]","budget":"₹800 million (US$12 million)[1]"}