{"based_on":"Beloved  by Toni Morrison","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Akosua Busia Richard LaGravenese Adam Brooks","Plot":"Sethe is a former slave living on the outskirts of Cincinnati shortly after the Civil War. An angry poltergeist terrorizes Sethe and her three children, causing her two sons to run away forever. Eight years later, Sethe (Oprah Winfrey) lives alone with her daughter, Denver (Kimberly Elise). Paul D. (Danny Glover), an old friend from Sweet Home, the plantation Sethe had escaped from years earlier, finds Sethe's home, where he drives off the angry spirit. Afterwards, Paul D. proposes that he should stay and Sethe responds favorably. Shortly after Paul D. moves in, a clean, mentally handicapped young woman (Thandie Newton) named Beloved stumbles into Sethe's yard and also stays with them.Denver is initially happy to have Beloved around, but learns that she is Sethe's reincarnated daughter. Nonetheless, she chooses not to divulge Beloved's origins to Sethe. One night, Beloved, aware that Paul D. dislikes her, immobilizes him with a spell and proceeds to assault him sexually. Paul D. resolves to tell Sethe what happened, but instead tells what has happened to a co-worker, Stamp Paid (Albert Hall). Stamp Paid, who has known Sethe for many years, pulls a newspaper clipping featuring Sethe and tells her story to the illiterate Paul D.Years ago, Sethe was raped by the nephews of Schoolteacher, the owner of Sweet Home. She complained to Mrs. Garner, Schoolteacher's sister-in-law, who confronted him. In retaliation, Schoolteacher and his nephews whip Sethe. Heavily pregnant with her fourth child, Sethe planned to escape. Her other children were sent off earlier to live with Baby Suggs, Sethe's mother-in-law, but Sethe stayed behind to look for her husband, Halle (Hill Harper) Sethe was assaulted while searching for him in the barn. The Schoolteacher's nephews held her down, raped her and forcibly took her breast milk.When Halle failed to comply, Sethe ran off alone. She crossed paths with Amy Denver, a white girl who treated Sethe's injuries and delivered Sethe's child, whom Sethe named Denver after Amy. Sethe eventually reached Baby Suggs' home, but her initial happiness was short-lived when Schoolteacher came to claim Sethe and her children. In desperation, Sethe slits her older daughter's throat, and attempts to kill her other children. Stamp Paid manages to stop her and the disgusted Schoolteacher departs.Paul D., horrified by the revelation and suddenly understanding the origin of the poltergeist, confronts Sethe. Sethe justifies her decision without apology, claiming that her children would be better off dead than enslaved. Paul D. departs shortly thereafter in protest. After Paul D.'s departure, Sethe realizes that Beloved is the reincarnation of her dead daughter. Feeling elated yet guilty, Sethe spoils Beloved with elaborate gifts while neglecting Denver. Beloved soon throws a destructive tantrum and her malevolent presence causes living conditions in the house to deteriorate. The women live in squalor and Sethe is unable to work. Denver becomes depressed yet, inspired by a memory of her grandmother's confidence in her, she eventually musters the courage to leave the house and seek employment.After Denver attains employment, women from the local church visit Sethe's house at the request of her new co-worker to perform an exorcism. The women from the church comfort the family, and they are praying and singing loudly when Denver's new employer arrives to pick her up for work. Sethe sees him and, reminded of Schoolteacher's arrival, tries to attack him with an icepick, but is subdued by Denver and the women. During the commotion, Beloved disappears completely and Sethe, freed from Beloved's grip, becomes permanently bedridden.Some months later, Paul D. encounters Denver at the marketplace. He notices she has transformed into a confident and mature young woman. When Paul D. later arrives at Sethe's house, he finds her suffering from a deep malaise. He assures Sethe that he and Denver will now take care of her. Sethe tells him that she doesn't see the point, as Beloved, her \"best thing\", is gone. Paul D. disagrees, telling Sethe that she herself is her own best thing.","language":"English","Critical reception":"Critical reception was positive, with a 78% \"fresh\" rating on Rotten Tomatoes based on 67 reviews.[9] The film, however, was a failure at the box office and could not come close to surpassing its $80 million budget. According to BoxOfficeMojo.com and TheNumbers.com, the movie grossed only $8,165,551 on its opening weekend,[10] ranking #5 and being beat out by the horror movie Bride of Chucky which ranked #2 and grossed approx $11,830,855 the same weekend. Winfrey has gone on public record stating that she ate 30 pounds of macaroni and cheese when she was informed the Saturday after the movie opened that \"we got beat by something called Chucky.\"[11] Oprah also claimed that Beloved's failure at the box office was the worst moment in her career and brought her into a major depression. \"It was the only time in my life that I was ever depressed, and I recognised that I (was) depressed because I've done enough shows (on the topic). 'Oh, this is what people must feel like who are depressed.'\"[11]Director Jonathan Demme has commented, \"Beloved only played in theaters for four weeks. It made $22 million dollars -- I think that's a lot of money. And the only reason it left theaters after a month was because the Disney corporation that released the picture wanted all the Beloved theaters -- where we were doing very well, in a number of situations. The Walt Disney company wanted those theaters for Adam Sandler's Waterboy. So, we were told that they were gonna bring us back at the end of the year, and they didn't.\"[12] Box office records have shown that Beloved remained in theaters into the holiday season, and by December 27, 1998, had grossed $22,746,521.[10] The film later returned to theaters for two weeks in March 1999, grossing an additional $1,000.[10]In 2013, Winfrey reflected on the film, saying: \"To this day I ask myself, was it a mistake? Was it a mistake to not try and make [it] a more commercial film? To take some things out and tell the story differently so that it would be more palatable to an audience? Well, if you wanted to make a film that everybody would see, then that would be a mistake. But at the time, I was pleased with the film that we did because it represented to me the essence of the Beloved book.\"[3]","box_office":"$22.9 million","cinematography":"Tak Fujimoto","production_company":"Touchstone Pictures Harpo Films Clinica Estetico","directed_by":"Jonathan Demme","release_dates":"October 8, 1998 (1998-10-08) (US: limited)|October 16, 1998 (1998-10-16) (US: wide)||||","Production":"Prior to Morrison's receipt of the Pulitzer Prize for Beloved, Winfrey purchased the rights to the novel in 1987; the translation to film then occurred a decade later.[3] There was a conflict over screenplay credit with Akosua Busia demanding sole credit and saying Adam Brooks and Richard LaGravenese got too much. WGA gave credit to all three. Busia said they were all little more than script doctors.[4]Filming locations included a soundstage in Philadelphia, Pennsylvania and a field in Fair Hill Natural Resources Management Area, in Cecil County, Maryland, at a spot just east of Big Elk Creek and just south of the border with Chester County, Pennsylvania.[5] In 1998 the State of Maryland compiled a document that included a location-map and photographs of the buildings constructed for the film as they stood in Fair Hill NRMA.[6] Filming also took place In Montgomery County PA, on the north side of the Schuylkill River with in Valley Forge National Historical Park.[7] Filming locations also included New Castle, DelawareDuring promotion of the film, Thandie Newton said to Vogue magazine, \"Here we were working on this project with the heavy underbelly of political and social realism, and she managed to lighten things up ... I've worked with a lot of good actors, and I know Oprah hasn't made many films. I was stunned. She's a very strong technical actress and it's because she's so smart. She's acute. She's got a mind like a razor blade.\"[8]","produced_by":"Edward Saxon Jonathan Demme Gary Goetzman Oprah Winfrey Kate Forte","starring":"Oprah Winfrey Danny Glover Thandie Newton Kimberly Elise","running_time":"172 minutes","music_by":"Rachel Portman","budget":"$80 million[1]"}