{"country":"United States","Awards and nominations":"The film was nominated for the Golden Globe Award for Best Motion Picture - Musical or Comedy but lost to Cabaret. Harry Stradling Jr. was nominated for the Academy Award for Best Cinematography but lost to Geoffrey Unsworth for Cabaret.","distributed_by":"Columbia Pictures","Plot":"While General George Washington is conducting the struggle against the British Empire on the battlefield, the Continental Congress in Philadelphia piddles away its time over trivial matters and continually refuses to begin debating the question of American independence. The leader of the independence faction is the abrasive John Adams of Massachusetts, whose continuous pushing of the issue has brought their cause to a complete standstill. John Dickinson of Pennsylvania leads the opposition that hopes for reconciliation with England. During his quieter moments, Adams calls up the image of his wife Abigail Adams who resides in Massachusetts and gives him insight and encouragement (These conversations are based on letters between the couple). Dr. Benjamin Franklin of Pennsylvania suggests another colony that supports independence should submit a proposal.Richard Henry Lee of Virginia voluntarily rides off to Williamsburg, Virginia to get authorization from the Virginia Colony to propose independence. Dr. Lyman Hall arrives to represent Georgia, and immediately, he is interrogated by his fellow delegates regarding his views on independence (with Dickinson framing it as \"treason\"). Weeks later, Lee returns with the resolution, and debate on the question begins. However, in the midst of debate, Caesar Rodney falters because of his cancer and is taken back to Delaware by fellow delegate Thomas McKean, leaving the anti-independence George Read to represent Delaware.After heated discussions, the question is called without a majority of positive votes present. The New Jersey delegation, led by Reverend John Witherspoon, arrives just in time to provide a vote supporting independence. In a move intended to defeat the resolution, Dickinson calls for a vote requiring unanimity for passage. The vote ends in a tie between the colonies, New York abstaining as it does in every vote. It is ultimately decided in favor of unanimity by John Hancock, president of the Continental Congress, who argues that any objecting colony would fight for England against independence. Stalling for time to rally support for the resolution, Adams and Franklin call again for a postponement, justifying their call by stating the need for a declaration describing their grievances. Once again tied and ultimately decided by Hancock, the vote is successfully postponed until such a document can be written.Hancock appoints a committee that includes Adams, Franklin, Roger Sherman of Connecticut, Robert Livingston of New York, and Thomas Jefferson (after Lee declines due to an appointment to serve as governor of Virginia). Jefferson resists because he desires to return home to Virginia to see his wife, Martha, but the others present more compelling reasons to avoid the responsibility; they opine that Jefferson's diplomatic nature and superior writing skill are required to draft the declaration. Jefferson develops writer's block due to missing his wife, so Adams sends for Martha: \"It simply occurred to me that the sooner his problem was solved the sooner ours would be.\" Upon meeting her, Adams and Franklin are quite taken with Martha. While maneuvering to get the required unanimity for the vote on independence, Adams, Franklin and Samuel Chase of Maryland visit the Colonial Army encamped in New Brunswick, New Jersey, at the request of General Washington, to help convince Maryland.When they return to Philadelphia, the declaration is read and then subsequently debated and amended. Jefferson agrees to most alterations to the document, much to Adams' growing consternation. The debate reaches a head when the Southern delegates, led by Edward Rutledge of South Carolina, walk out of Congress when a clause opposing slavery is not removed. Adams remains adamant that the clause remain, but Franklin appeals to him to allow the passage to be removed so that they can first achieve the vote on independence and the formation of a nation, deferring the slavery fight to a later time. Adams leaves the final decision to Jefferson, who reluctantly concedes. After removing that clause, 11 of 13 colonies are now in favor. New York abstains yet again (since its delegates have never been given specific orders by the disorganized New York legislature).The question is therefore up to the Colony of Pennsylvania, whose delegation is polled at Franklin's request. Franklin votes for the declaration, but Dickinson votes against. The outcome is now in the hands of their fellow Pennsylvanian Judge James Wilson. Wilson has always followed Dickinson's lead, but in this case Wilson votes in favor of the declaration, securing its passage, so that he would not be remembered by history as the man who voted to prevent American independence. After receiving word of the destruction of his property from General Washington, Lewis Morris finally withdraws New York's abstention and agrees to sign the document. Finally, with the Declaration of Independence ready to be signed, Hancock places his signature first, whereupon the others (including New York) affix theirs to the Declaration, establishing the United States on July 4, 1776.","language":"English","Critical reception":"Vincent Canby of The New York Times observed, \"The music is resolutely unmemorable. The lyrics sound as if they'd been written by someone high on root beer, and the book is familiar history — compressed here, stretched there — that has been gagged up and paced to Broadway's not inspiring standards. Yet Peter H. Hunt's screen version of 1776 ... insists on being so entertaining and, at times, even moving, that you might as well stop resisting it. This reaction, I suspect, represents a clear triumph of emotional associations over material ... [It] is far from being a landmark of musical cinema, but it is the first film in my memory that comes close to treating seriously a magnificent chapter in the American history.\"[28]Roger Ebert of the Chicago Sun-Times gave it two stars and declared, \"This is an insult to the real men who were Adams, Jefferson, Franklin and the rest ... The performances trapped inside these roles, as you might expect, are fairly dreadful. There are good actors in the movie (especially William Daniels as Adams and Donald Madden as John Dickinson), but they're forced to strut and posture so much that you wonder if they ever scratched or spit or anything ... I can hardly bear to remember the songs, much less discuss them. Perhaps I shouldn't. It is just too damn bad this movie didn't take advantage of its right to the pursuit of happiness.\"[29]","box_office":"$2,800,000 (Rentals)[3]","Political changes":"According to the Los Angeles Times, \"The song 'Cool, Cool, Considerate Men' depicts Revolutionary War–era conservatives as power-hungry wheedlers focused on maintaining wealth.\"[9] According to Jack L. Warner, the film's producer and a friend of U.S. President Richard Nixon, Nixon requested to have the song removed from the film. Nixon apparently saw the song as an insult to the conservatives of his time, as it suggested that the conservatives were the ones who were hindering American Independence as they danced a minuet singing the song that included the stanza,Come ye cool, cool considerate set We'll dance together to the same minuet To the right, ever to the right Never to the left, forever to the right.To further complicate things as mentioned above, the song is anachronistic, because the terms \"right\" and \"left\" in politics were not coined until the French Revolution.Warner's attempt to comply with Nixon's demands had initially been rebuffed by director Hunt during production, only for the song to be removed in post-production while Hunt was on vacation. Warner also wanted the original negative of the song shredded, but the film's editor kept it in storage unaltered.[9] Trailers were already released in theaters with the \"Considerate Men\" number as its centerpiece; Warner had those trailers pulled and re-edited.[10] Hunt later mentioned in a 2015 interview that Warner, on his deathbed, told a friend that he regretted editing the scene, believing that he had ruined the structure of the film as a result of those edits.[10] It was only decades later that the song was restored to the film.[9]Interestingly, when the Broadway musical was about to be presented to Nixon at the White House in 1970, before the film was made, his staff pressed the producers to cut the song then; their request was denied.[9]","Historical accuracy":"According to The Columbia Companion to American History on Film, historical \"[i]naccuracies pervade 1776, though few are very troubling.\"[11] Because Congress was held in secrecy and there are no contemporary records on the debate over the Declaration of Independence, the authors of the play created the narrative based on later accounts and educated guesses, inventing scenes and dialogue as needed for storytelling purposes. Some of the dialogue was taken from words written, often years or even decades later, by the actual people involved, and rearranged for dramatic effect.[12]The movie particularly distorts and omits the views of the mid-Atlantic Quaker population, represented by Dickinson. Although in the movie Dickinson is portrayed as loyalist, and John Adams is seen making the points of objection about the tax abuses of George III of the United Kingdom, including regressive taxes and \"taxation without representation, and all to fund wars and the King's lifestyle, not to benefit the people, it was Dickinson's Letters from a Farmer in Pennsylvania that had originally made these points. A supposed physical fight between Dickinson and Adams is portrayed, in which Dickinson calls Adams a \"lawyer\" as an epithet, which makes little sense since Dickinson was a lawyer himself.Also, despite the movie's heavy focus on John Adams, John Dickinson, Thomas Jefferson and Benjamin Franklin, only Martha Jefferson and Abigail Adams and their marriages are depicted, despite Dickinson's wife, Mary Norris Dickinson, being the only one of these spouses actually present in Philadelphia during the convention. (Franklin's common law wife, Deborah Read, had died a year or so earlier.) Although the movie initially uses actual correspondence between Abigail Adams and John Adams as a basis for dialogue, it romanticizes her views in later scenes. The movie also fictionalizes the Martha Jefferson relationship in particular, depicting her as coming to the convention, when she had actually just suffered a miscarriage and was also dealing with complications of gestational diabetes and was invalid in Virginia. The omission of Mary Norris and Dickinson's marriage to her is also particularly distorting as Quaker marriages such as that of Dickinson and Norris were more egalitarian than those of some of the other founding cultures (including the patriarchal Puritan-style Adams marriage, to which Abigail Adams objects in her letters quoted in the movie) and were by definition not bound to gender stereotypes.Another departure from history is that the separation from Great Britain was accomplished in two steps: the actual vote for independence came on July 2 with the approval of Lee's resolution of independence. The wording of the Declaration of Independence—the statement to the world as to the reasons necessitating the split—was then debated for three days before being approved on July 4. The vote for independence did not hinge on some passages being removed from the Declaration, as implied in the movie (and the play), since Congress had already voted in favor of independence before debating the Declaration. For the sake of drama, the play's authors combined the two events.[13] In addition, some historians believe that the Declaration was not signed on July 4, as shown in 1776, but was instead signed on August 2, 1776. Others point out that the final, official copy of the document was signed by the delegates not on a single date, but over several weeks and months, commencing in July but not being completed until as late as September. The authors of 1776 had the delegates sign the Declaration on July 4 for dramatic reasons.[13]The Liberty Bell in 1776 is shown being rung as the delegates were signing the Declaration on July 4; however, this was also for dramatic effect. Independence Hall's wooden steeple was structurally unstable, and the Liberty Bell was silent, having been lowered into the upper chamber of the brick tower.[14] A smaller bell, used to toll the hours, may have rung on July 8, for the public reading of the Declaration.Many characters in 1776 differ from their historical counterparts. Central to the drama is the depiction of John Adams as \"obnoxious and disliked.\" According to biographer David McCullough, however, Adams was one of the most respected members of Congress in 1776. Adams's often-quoted description of himself in Congress as \"obnoxious, suspected, and unpopular\" is from a letter written 46 years later in 1822,[15] after his unpopular presidency had likely colored his view of the past. According to McCullough, no delegate described Adams as obnoxious in 1776.[16] Historian Garry Wills earlier made a similar argument, writing that \"historians relay John Adams's memories without sufficient skepticism\", and that it was Dickinson, not Adams, who was advocating an unpopular position in 1776.[17]For practical and dramatic purposes, the work does not depict all of the more than 50 members of Congress who were present at the time. This version of John Adams is, in part, a composite character, combining the real Adams with his cousin Samuel Adams, who was in Congress at the time but is not depicted in the play.[18] Although the play depicts Delaware's Caesar Rodney as an elderly man near death from skin cancer (which would eventually kill him), he was just 47 years old at the time and continued to be very active in the Revolution after signing the Declaration. He was not absent from the voting because of health; however, the play is accurate in having him arrive \"in the nick of time,\" having ridden 80 miles the night before (an event depicted on Delaware's 1999 State Quarter) unaided, instead of with the help of another delegate. Further, Richard Henry Lee announces that he is returning to Virginia to serve as governor. He was never governor; his cousin Henry Lee (who is anachronistically called \"General 'Lighthorse' Harry Lee,\" a rank and nickname earned later) did eventually become governor (and the father of Confederate general Robert E. Lee). John Adams was also depicted as disliking Richard Henry Lee, but according to McCullough, Adams expressed nothing but \"respect and admiration for the tall, masterly Virginian.\" He did dislike Benjamin Franklin, contrary to what was portrayed.Martha Jefferson never traveled to Philadelphia to be with her husband; she was extremely ill during the summer of 1776, having just endured a miscarriage. The play's authors invented the scene \"to show something of the young Jefferson's life without destroying the unity of setting.\"[19] James Wilson was not the indecisive milquetoast depicted in the play and the movie. The real Wilson, who was not yet a judge in 1776, had been cautious about supporting independence at an earlier date, but he supported the resolution of independence when it came up for a vote. Pennsylvania's deciding swing vote was actually cast by John Morton, who is not depicted in the musical.[18]The quote attributed to Edmund Burke by Dr. Lyman Hall in a key scene with Adams is a paraphrase of a real quote by Burke.[20]The song \"Cool Considerate Men\" is anachronistic; the terms \"right\" and \"left\" in politics were not in use until the French Revolution of 1789. John Dickinson, who is portrayed as an antagonist here, was motivated mainly by his Quaker roots and his respect for the British Constitution, having lived in England for 3 years in the 1750s.[21] He was no wealthier than some members of the pro-Independence faction, and freed his slaves in 1777. Thomas Jefferson wrote that \"his name will be consecrated in history as one of the great worthies of the revolution\".[22]The movie also misses the objection some had to the Declaration's stated basis in \"rights of Man\" based in \"natural law\" derived from a supernatural being. The Quaker-based population in the mid-Atlantic, represented by Dickinson, objected to this conception. Dickinson's objection to the Declaration had to do with this, as well as the fact he and his base preferred civil disobedience to war as the means, and a view that the colonies were too immature and the egalitarian mid-Atlantic culture would be overruled by the slavery of the South and the patriarchal Puritan attitudes of New England, represented by John Adams, in the foundation of the new country. The movie also omits the fact that Dickinson, after refusing to sign the Declaration, set about drafting the Articles of Confederation, which he based on \"rights of Person\" with no reference to anything but law created by human beings and the only reference to \"men\" being in the context of mustering armies. This basis was then used when the Articles were converted to the Constitution but by then completely omitting the word \"man\" and only using the word \"Person.\"The musical also deviates from history in its portrayal of attitudes about slavery. In 1776, after a dramatic debate over slavery, the southern delegates walk out in protest of the Declaration's denunciation of the slave trade, and only support independence when that language was removed from the Declaration. The walkout is fictional, and apparently most delegates, northern and southern, supported the deletion of the clause.The musical depicts Edward Rutledge as the leader of the opposition to an anti-slavery clause in Jefferson's original draft of the Declaration. However, while we do know that, according to Jefferson, the clause was opposed by South Carolina and Georgia, plus unspecified \"northern brethren\";[23] that is all that is known about opposition to the clause. Rutledge was a delegate from South Carolina, but there is no historical evidence that he played any part – much less a leadership role – in the opposition to the clause.[24] The musical does acknowledge the complexity of the colonial attitudes toward slavery in the dramatic song \"Molasses, to Rum, to Slaves\", sung by the Rutledge character, which illustrates the hypocrisy in northern condemnations of slavery since northerners profited from the triangle trade.Thomas Jefferson is depicted in the musical as saying that he has resolved to free his slaves, something he did not do, except for a few slaves freed after his death 50 years later. The musical also depicts Franklin as claiming that he is the founder of the first abolitionist organization in the New World; the real Franklin did not become an abolitionist until after the American Revolution, becoming president of the Pennsylvania Abolition Society in 1785.[25] It was actually Dickinson who freed his slaves in 1776, conditionally at first, and fully by 1787 when the Constitution was ratified.In both the play and the film, John Adams sarcastically predicts that Benjamin Franklin will receive from posterity too great a share of credit for the Revolution. \"Franklin smote the ground and out sprang—George Washington. Fully grown, and on his horse. Franklin then electrified them with his miraculous lightning rod and the three of them—Franklin, Washington, and the horse—conducted the entire Revolution all by themselves.\" Adams did make a similar comment about Franklin in April 1790, just after Franklin's death, although the mention of the horse was a humorous twist added by the authors of the musical.[26]James Wilson is portrayed as subordinating himself to Dickinson's opposition to independence, only changing his vote so that he would not be remembered unfavorably. In fact, Wilson was considered one of the leading thinkers behind the American cause, consistently supporting and arguing for independence, although he would not cast his vote until his district had been caucused.[27]","cinematography":"Harry Stradling, Jr.","directed_by":"Peter H. Hunt","1776":"Theatrical release poster","Soundtrack":"An original motion picture soundtrack album was released in 1972 by Columbia Records on the vinyl LP format. It contained all the musical numbers listed above with the exception of \"Cool, Cool Considerate Men\" and \"Compliments\". This soundtrack also contains the edited versions of some of the musical numbers which were presented in full on the laserdisc and DVD releases. Although the Broadway cast recording was released on CD in 1992, the movie soundtrack was not.","release_dates":"November 17, 1972 (1972-11-17)|||||","Production":"Jack L. Warner bought the film rights to the musical for $1.25 million.Many members of the original Broadway cast, including William Daniels, Ken Howard, John Cullum, and Howard Da Silva, reprised their roles for the film. Ralston Hill, Ron Holgate, David Ford, Charles Rule and others repeated their roles from the Broadway production, marking their only appearances in feature film. This was a decision Warner made himself after feeling he made a mistake by turning down Julie Andrews for the 1964 film adaptation of My Fair Lady in favor of Audrey Hepburn.This was also the only film of Donald Madden, who was not in the original Broadway cast.Exteriors were filmed at the Warner Ranch in Burbank, California, the former Columbia Pictures backlot, where they built an entire street of colonial Philadelphia. Most of the colonial sets were destroyed by a fire in the mid-1970s.[citation needed]The water fountain seen during the musical number \"The Lees of Old Virginia,\" with Ben Franklin, John Adams, and Richard Henry Lee, became known to television viewers as the fountain seen during the beginning credits of the TV series Friends. This fountain still exists directly across the street from the Bewitched and I Dream of Jeannie houses.[5]Interiors were shot at the old Columbia studio on Gower Street in Hollywood.[6][7] 1776 was among the final films shot at Gower Studios before the Warner/Columbia merger in 1971.[8]In its theatrical and original home video releases, the film was rated G; following the restoration of various parts cut by producer Jack L. Warner, the DVD was rated PG.[citation needed] The Laserdisc version, out of print, contains additional footage and background music not contained on the DVD release. The 168-minute version is considered director Peter Hunt's preferred version, hence its \"director's cut\" moniker. The film was the Christmas attraction at Radio City Music Hall in New York City.[citation needed]\"Cool, Cool, Considerate Men\" was cut from the film prior to its release and not included on the soundtrack recording nor on the first VHS tapes and laserdiscs. The footage, some of physically poor quality, was restored for the later laserdisc and DVD releases.","Home media releases":"The film was released on videocassette and laserdisc in the 1980s, and on DVD in 2002. This DVD version was released as the \"Restored Director's Cut\" and contains clips that were unreleased and unavailable in videocassette versions, most notably the \"Cool, Cool Considerate Men\" musical number and accompanying dialogue. Although out of print, the laserdisc contains an additional four minutes of material which is not available on the DVD.The film was released on Blu-ray 4K-master on June 2, 2015.[30] It contains an all-new commentary with director Peter H. Hunt, William Daniels, Ken Howard, and Peter Stone. It also contains two versions of the film: the DVD's \"Director's Cut\", and an \"extended cut\" adding an additional 2 minutes and 44 seconds to the DVD edition's time. It also includes deleted and alternate scenes with filmmaker commentary.","produced_by":"Jack L. Warner","starring":"William Daniels Howard Da Silva Ken Howard Donald Madden John Cullum","running_time":"141 minutes[1] (Theatrical) 168 minutes (DVD)","music_by":"Sherman Edwards","External links":"President of Pennsylvania (1785–1788), Ambassador to France (1779–1785)","edited_by":"Florence Williamson William H. Ziegler","written_by":"Peter Stone","budget":"$6 million[2]"}