{"country":"United States[1]","distributed_by":"Metro-Goldwyn-Mayer","bulletproof_monk":"Theatrical poster","Plot":"In 1943 Tibet, a Tibetan monk is informed that he has fulfilled the prophecies made of him (fighting for justice while cranes circled overhead, fighting for love under a palace of jade, and rescuing friends he never met with family he never knew he had) which include forgoing his name. He is then entrusted by his master with the protection of a Scroll which contains knowledge by which the reader becomes the most powerful of living things, a protection that will keep him youthful and immunize him to injury until, at the close of 60 years, he must pass the knowledge to an heir. The master, who has formerly been the guardian of this Scroll, is killed by German soldiers shortly after the transfer. His pupil, the now nameless Monk, escapes the Nazis.Sixty years later, a young pickpocket named Kar robs a police officer. He is arrested, frees himself, and flees reinforcements. Above, the Nameless Monk notices several men attempt to capture him, and he escapes into the subway. He and Kar collide and cause a young girl to fall into the path of an oncoming train. Kar and the Nameless Monk rescue the girl, and the three escape; Kar leaves his bag of stolen goods in the station. The Nameless Monk and Kar introduce themselves and Kar steals the Scroll from the Nameless Monk and runs away. The Nameless Monk chases after Kar, whom he suspects may be a suitable successor, as cranes were visible far above their fight.When fighting underground against a minor crime lord called Mister Funktastic, Kar meets a young woman named Jade, with whom he falls in love. The Nameless Monk follows Kar home and watches him practice Kung-fu by mimicking Chinese martial arts films. The next day, Jade meets with Nina at the opening of a human rights exhibit. Later, the Monk and Kar meet again and are talking when Jade walks up to them and asks Kar to return her necklace, which he had stolen to earn her esteem when he eventually returned it. A group of mercenaries sent to kill the Nameless Monk interrupt them, and he flees with Kar.The Nameless Monk and Kar hide beneath an Asian laundromat that houses several fellow monks, and the Nameless Monk shows Kar advanced combat techniques. They are attacked and the Scroll is taken to the employer of the mercenary forces, a crime lord named Strucker, who is revealed to be the earlier Nazi commander. Upon reading the Scroll, Strucker realizes it is a fake; the true secret is tattooed on the Nameless Monk's torso. The Nameless Monk and Kar return home to find that Kar's employer has been murdered by Strucker's granddaughter, Nina. They return to the Asian laundromat but are betrayed by an ambitious monk. All parties are taken to Strucker's base of operations and tortured.The Nameless Monk and Kar seek the help of Jade, whom they learn is the daughter of a currently imprisoned Russian crime lord. The Nameless Monk realizes that by fighting Jade in her \"palace\" (as she is a Mafia \"princess\"), Kar has fulfilled the second prophecy. Nina interrupts their meeting, captures the Nameless Monk, and has Jade and Kar beaten. Later, Jade and Kar infiltrate Strucker's headquarters, where they are separated. Jade fights Nina and defeats her, and Kar finds the Nameless Monk. By now, Strucker has regained his youth, but he is unable to obtain the content of the last line of the Scroll, which is present only in the Nameless Monk's memory. Strucker attempts to scan the Nameless Monk's brain, but Kar prevents him. A fight ensues, and Strucker is thrown from the roof onto electric cables; however, the power of the Scroll preserves Strucker from death.While Jade frees the other monks, the Nameless Monk transfers the Scroll's content, and the task of protecting it for 60 years, to Kar. Strucker then attempts to kill Kar, but is killed himself – Jade is revealed to have taken some of the Scroll's power, as it was she who fulfilled the final prophecy by rescuing the monks. The Nameless Monk tells them that they both passed the three prophecies and the final test. The next day, the now aged Nameless Monk meets Kar and Jade, to whom he reveals the final line of the Scroll and whom he now deems inseparable. He then departs, lighthearted.","language":"English","Reception":"Bulletproof Monk received generally poor reviews; David Edelstein of Slate contended that Bulletproof Monk was \"Crouching Tiger, Hidden Dragon for the American Pie audience\"; panning its poor special effects and cinematography (the former he compared to an \"afternoon Japanese kiddie series\"), and concluded that \"they made a ton of junky movies in Hong Kong, but those were dazzlingly fluid and high-flying junky movies. This American retread has the same sort of hack plot but none of the bravura. It makes them look like monkeys, and not bulletproof ones.\"[3] Bill Stamets of the Chicago Reader panned Bulletproof Monk for having \"routine\" fight scenes and juvenile humor, and that \"the film plays off Chow's imperturbable persona, but the Tibetan philosophy boils down to the paradox of hot dogs coming ten to a package while buns are sold in sets of eight.\"[4]On Rotten Tomatoes, a review aggregator, Bulletproof Monk has an aggregate score of 23% based on 131 reviews. The site's consensus reads: \"Venerable action star Chow Yun-Fat is the only saving grace in this silly action flick that more often than not resembles a commercial in style.\"[5] Metacritic scored it 40/100 based on 29 reviews.[6]The movie grossed approximately $23 million in the United States, with a worldwide total of $37 million, less than the production budget of $52 million.[2]","box_office":"$37.7 million[2]","cinematography":"Stefan Czapsky","production_company":"Lakeshore Entertainment Mosaic Media Group Lion Rock Productions","directed_by":"Paul Hunter","release_dates":"April 16, 2003 (2003-04-16)|||||","produced_by":"Charles Roven|Terence Chang|John Woo|Douglas Segal|","starring":"Chow Yun-fat|Seann William Scott|Jaime King|","running_time":"104 minutes","music_by":"Éric Serra","edited_by":"Robert K. Lambert","written_by":"Ethan Reiff|Cyrus Voris|","budget":"$52 million[2]"}