{"based_on":"The Fruits of the Death of Jazz  by Ed Bland","country":"USA","Inspiration":"According to Bland, The Cry of Jazz was made in part as a reaction to the rising popularity of the cool jazz of the 1950s. In the early years of that decade, Bland, Hill, Kennedy, and Titus frequented a club in Chicago's Southside called Jimmy's, where they would converse with young musicians and jazz fans, both black and white. The most popular and well-known players of cool jazz were white, and in Bland's view, the general excitement with cool jazz neglected to recognize jazz as fundamentally black music. In an interview with Waxpoetics, Bland referred specifically to the young white jazz fans he termed \"jazz critics-to-be” as the primary perpetrators of this crime. In Bland's words: \"I felt there was a racial angle too; I felt they were trying to, shall we say, wipe the Blackness out of jazz. And they wouldn't listen to us, so we decided to put it in stone.\"[2] In an introduction to The Cry of Jazz delivered at the Maysles Documentary Center in Harlem, film critic Armond White hypothesized that Bland may also have been responding to Norman Mailer's essay The White Negro, which reflects positively on the appropriation of African American culture and language by young white hipsters.[7]","screenplay_by":"Ed Bland , Nelam Hill, Mark Kennedy, Eugene Titus","Plot":"The Cry of Jazz is set in Chicago at the meeting of a jazz appreciation club of musicians and intellectuals, both Black and White. It is broken up into seven parts. Parts one, three, five, and seven center around conversations between the jazz club members. Parts two, four, and six are done in a documentary style and utilize footage of life in Chicago as well as of Sun Ra’s band performing the music. Alex, the film’s main character, serves as narrator during these sections.[1] Although the film is nominally about jazz, jazz is utilized primaily as a metaphor through which to understand the African American experience.[3]As the majority of the attendees of the jazz club leave, the crowd that remains is composed of two White men, Bruce and John, two White women, Natalie and Faye, and three Black men, Alex, Louis, and Bob. Alex overhears Bruce telling Natalie that rock and roll is jazz, which prompts a discussion about what jazz is. When Bruce asserts, “jazz is merely the Negro’s cry of joy and suffering,” the White characters protest, upset with Bruce’s implication that only Black people could have created jazz. Alex elaborates on Bruce’s point, explaining, “the Negro was the only one with the necessary musical and human history to create jazz.”Alex makes a direct comparison between the structure of jazz and the Black experience in the United States. Jazz plays over shots of Black neighborhoods of Chicago, an attempt to demonstrate the affinity between jazz and Black life. Alex continues to explain jazz as the “triumph of the Negro spirit” over the difficulties Black people face in a racist America. He links the restrictive form and changes of jazz to this limitation and suffering, and improvisation to an expression of joy and freedom within a restrictive society. Alex also argues that the sound of jazz reflects the “characteristic atmosphere, color, and sensuality” of Black life, just as the sound of jazz played by Whites reflects White life.Bruce and Natalie again express confusion with the claim that Blacks see America differently than Whites. Alex responds that Black people see America in a unique way because they have never been fully included in American society, yet have found ways to survive. Alex and Louis then assert that slavery and continued racism constitute an erasure of the past, present, and future of Black people in America, and that through music Black people have created a record of their history.Alex traces the history of jazz, from New Orleans jazz, to swing, to be-bop, to cool jazz. Footage of Sun Ra’s band playing examples of each style accompanies the description of each type of jazz.A discussion arises concerning what it would take to achieve racial equality in America. From Alex and Louis’s perspective, America must come to celebrate the story of joy and suffering told through jazz, as it is a story that transcends national and ethnic boundaries. When Natalie then asks about the future of jazz, Alex claims that jazz is dead, startling all the characters.In Alex’s opinion, jazz is dead because the form and the changes of jazz cannot evolve, as any alteration to the form and changes of jazz would not result in jazz. Alex claims that therefore, because jazz cannot grow, it is dead. While Alex asserts that this “jazz body” is dead, he maintains that the “spirit of jazz” is alive. He goes on to express that the “jazz body,” which contains the restraining elements of jazz, must die because the social restraints on Black people in America must end.The White characters continue to contest the death of jazz. Alex suggests that the “spirit of jazz” will give rise to a new form of music. When Bruce then asks how Whites fit into this story, Louis and Alex proclaim that what happens to Black people in America concerns Whites because it implicates their morality and humanity. The film ends with Alex’s assertion that the world’s perceptions of the United States will depend on American society's treatment black people.[4]","language":"English","Reception":"The reception of The Cry of Jazz when it was first released in 1959 was mixed at best, \"hideous\" at worst.[2] In 1960 Bland claimed that \"The reaction of a great majority of Negro audiences...has been favorable.\"[6] However, in a 2007 interview, Bland described the film's reception in the following manner: \"It was considered the work of madmen. Black racists. At best it was considered a personal statement. Bad music, bad thinking, bad acting, bad writing and bad photography. Unfair to jazz, because we made jazz a political act.\"[3] However, The Cry of Jazz did receive some favorable coverage from white film critics. Kenneth Tynan, film critic for the London Observer, hailed it as “the first film in which the American Negro has issued a direct challenge to the white.\"[8] In their review for Film Quarterly, Ernest Callenbach and Dominic Salvatore called it \"brave,\" \"immensely significant,\" and \"a film everybody should look at with attention.\"[9] Black intellectuals' reception of The Cry of Jazz was incredibly divided. The poet Amiri Baraka, one of the founding voices of the Black Arts Movement, reportedly found the film \"profoundly insightful.\"[8] Novelist Ralph Ellison, by Bland's own account, hated it. In 1960 the filmmaker Jonas Mekas organized a viewing and discussion of The Cry of Jazz in New York City. Attendees included Bland, Ellison, Nat Hentoff, and Marshall Stantoff. Debate over the film became so heated that the police were called.[2] Bland responded to criticism of The Cry of Jazz in a 1960 article for Film Culture. In this article, Bland identifies the most frequent critiques of The Cry of Jazz, beginning with the contestation that jazz is not dead. Bland dismisses this critique on the grounds that it is voiced only by the \"musically illiterate.\" Bland also acknowledges critiques of the quality of the film, to which he concedes, as well as assertions that The Cry of Jazz is racist and no different that the White Citizens Council, which Bland again dismisses.[6]","directed_by":"Ed Bland","release_dates":"1959","Production":"In the early to mid 1950s the composer Edward Bland, novelist Mark Kennedy, city-planner Nelam Hill, and mathematician Eugene Titus conceived the idea for The Cry of Jazz. Together they formed KHTB Productions, which took its name from the first letter of each person's last name. It took several years for them to write the script, and several more to make the film itself. Bland assumed the role of director while maintaining his job as a postal worker, the income from which he devoted to the film. Along with Bland, Kennedy, Hill, and Titus contributed personal funds to the film, which amounted to a final budget of approximately $3,500. Given this minimal budget, Bland and his co-creators relied on an entirely volunteer cast and crew of 65 people to complete the production of The Cry of Jazz.[2] Production of the film was completed in 1958, and it was released by KHTB in 1959.[1]As the production of The Cry of Jazz began, Bland, serving as the film's Musical Director, was responsible for scoring the film. Bland knew Sun Ra personally, as they were both living in Chicago at the time. Additionally, Bland was aware that Sun Ra owned the rights to his music released through El Saturn Records, his personal record label. Ra and his business partner and co-owner of El Saturn, Alton Abraham, allowed Ra's music be used for The Cry of Jazz without charge in exchange for Bland’s incorporation of live footage of Ra’s band performing the music, as well as highlighting Ra’s involvement in billing and publicity. While Bland found Sun Ra’s music exciting and felt that it fit the aesthetic direction of the film, he was uninterested in Ra’s eccentric personal philosophy and cosmology. Thus, this element of Ra’s career did not factor into his involvement with The Cry of Jazz. Bland and Ra maintained a personal and professional relationship until 1967. According to Bland, by the mid 1960s Ra \"was stressing his \"Sun God of Jazz\" propaganda more than ever,\" and in addition began showing up late to recording sessions, prompting Bland to stop working with him.[5]Bland wrote the screenplay for a sequel to The Cry of Jazz titled The American Hero, but received 109 rejections from production companies, causing him to abandon the project. Bland gave this description of The American Hero in a 1960 article for the journal Film Culture:\"In our next film, which will be a 35mm feature length film amplifying and carrying further various facets of this film, we expect an even greater impact, primarily because the audience will not be able to use jazz as an escape.\"[6]","produced_by":"Ed Bland, Nelam Hill","starring":"George Waller, Dorothea Horton, Linda Dillon, Andrew Duncan, Laroy Inman, James Miller, Gavin McFadyen, Carl Dupree, Goldina Rojas, Alan Leavitt, Carl McCormack, Lettie Mae Randolph","running_time":"34 minutes","music_by":"Sun Ra","edited_by":"Howard Alk","written_by":"Ed Bland, Nelam Hill, Mark Kennedy","Jazz in 1959":"In contrast to the claim made in The Cry of Jazz that \"jazz is dead\", 1959 is widely considered a landmark year of innovation in jazz due to the release of four groundbreaking albums: Kind of Blue by Miles Davis, Time Out by The Dave Brubeck Quartet, Mingus Ah Um by Charles Mingus, and The Shape of Jazz to Come by Ornette Coleman.[10] Each of these albums made a unique contribution to jazz. With Kind of Blue, Miles Davis established a previously developing style of jazz, called modal jazz, which uses fewer chords and melodic improvisation based on scales. Today Kind of Blue is recognized as the best-selling jazz album of all time.[11] In Time Out, Dave Brubeck and his quartet pushed the boundaries of jazz by experimenting with different time signatures, such as 9/8 in “Blue Rondo a la Turk” and 5/4 in \"Take Five.\" Up to this point, the vast majority of jazz was based on 4/4 time. Time Out also became extremely popular for a jazz album, and catapulted Brubeck to international fame.[12] Charles Mingus’s Mingus Ah Um is most notable for its variety. Mingus was adept at pulling inspiration from and composing in a multiplicity of jazz styles. Elements of swing, hard bop, soul jazz, and cool jazz, are all evident in Mingus Ah Um.[13] With The Shape of Jazz to Come, Ornette Coleman took jazz in a radical new direction by debuting avant-garde jazz. This new style did away with many of the characteristic features of jazz, including easily discernable rhythms, regular form, and planned harmonic structure. For instance, the track “Lonely Woman” is not based on an underlying chord progression. While The Shape of Jazz to Come was very controversial, it did expand the boundaries of jazz.[14]"}