{"based_on":"Characters  by Bob Kane Batman: The Animated Series by Bruce Timm and Eric Radomski","Cast":"Additional voices: Jeff Bennett, Ed Gilbert, Marilu Henner, Pat Musick, Thom Pinto, Neil Ross, and Vernee Watson-Johnson","country":"United States","batman:_mask_of_the_phantasm":"Theatrical release poster","distributed_by":"Warner Bros.","story_by":"Alan Burnett","language":"English","box_office":"$5.6 million[1]","production_company":"Warner Bros. Animation Warner Bros. Family Entertainment","directed_by":"Eric Radomski Bruce Timm","Home media":"The film was released on laserdisc in April 1994[17] and on VHS in May of the same year.[18] The VHS was reissued in April 2003, though this time, part of a three-tape pack with Batman & Mr. Freeze: SubZero and Batman Beyond: Return of the Joker.[19] Mask of the Phantasm was first released on DVD in December 1999 as a snap case[20] and in October 2005 as a keep case with the insert.[21] The film was released in April 2004 as a three disc DVD box set that included SubZero and Return of the Joker but it is currently out of print.[22] Warner Home Video released the film once more in February 2008, but as a double feature DVD with SubZero.[23]","release_dates":"December 25, 1993 (1993-12-25)|||||","Production":"Impressed by the success of the first season of Batman: The Animated Series on the Fox Network, Warner Bros. assigned Alan Burnett to write a story for a full-length animated film. Although the Joker does play a pivotal role in the film, it was Burnett's intention to tell a story far removed from the television show's regular rogues gallery. Burnett also cited he \"wanted to do a love story with Bruce because no one had really done it on the TV show. I wanted a story that got into his head.\"[4] The writers were highly cautious of placing the Joker in the film as they did not want any connection to Tim Burton's 1989 film Batman, but writer Michael Reaves said, \"We then realized that we could make his appearance serve the story in a way that we never could in live-action.\"[5] Aiding Burnett in writing the script were: Martin Pasko, who handled most of the flashback segments; Michael Reaves, who wrote the climax; and Paul Dini, who claims he \"filled in holes here and there.\"[4] Orson Welles' 1941 classic Citizen Kane served as an influence for the flashbacks, a story about loss and the passage of time.[6]“It was basically an expanded episode. We boarded the script and did all of our designs and shipped it overseas. We were treating it with more quality, but we originally didn’t intend it for the big screen.”Early in production, Warner Bros. decided to release Phantasm with a theatrical release, rather than straight to video. That left less than a year for production time (most animated features take well over two years from finished story to final release). Due to this decision, the animators went over the scenes once more in order to accommodate widescreen theatrical aspect ratio.[8] The studio cooperated well, granting the filmmakers a large amount of creative control.[9]In addition to the creative control, the studio also increased the production budget to $6 million,[7] which gave the filmmakers opportunities for more elaborate set pieces. The opening title sequence featured a flight through an entirely computer-generated Gotham City.[4] As a visual joke, sequence director Kevin Altieri set the climax of the film inside a miniature automated model of Gotham City, where Batman and the Joker were giants. This was an homage to a mainstay of Batman comic books of the Dick Sprang era, often featuring the hero fighting against a backdrop of gigantic props (they would later do another homage to Sprang's works in The New Batman Adventures episode \"Legends of the Dark Knight\").[8] From start to finish, the film was completed within eight months.[7]Composer Shirley Walker cited the score of Phantasm as a favorite among her own compositions.[10] In an interview with Cinemusic.com, Walker explained that the \"latin\" lyrics used in the Main Title of Mask of The Phantasm were actually names of key Warner Bros staff read backwards. The lyrics are deciphered as follow:[11]Intro:NILK-CAN-URF LOGE (Joel Franklin) or EE-DRUCK-AHM NEEJ (Jean MacCurdy)KNAURF GUD, KNAURF GUD (Doug Frank x2)Main Theme, first phrase:OH-NAH-LIM MOT (Tom Milano)EAT-IM-UZ EE-TAP (Patti Zimmitti)EE-DRUCK-AHM NEEJ (Jean MacCurdy)RUR MIS NEH (Hans Zimmer)Main Theme, second phrase:NAHT-SHICK-UM KIME (Mike McCuistion)IX-MAH-DEER KI-RARE (Erik Radomski)NILK-CAN-URF LOGE (Joel Franklin)LICK-SNAHRB DRA-CHEER (Richard Bronskill)","running_time":"76 minutes","budget":"$6 million","screenplay_by":"Alan Burnett Paul Dini Martin Pasko Michael Reaves","Comic books and novelizations":"In December 1993, two novelizations were released. One was written by Alan Burnett, Paul Dini, and Andrew Helfer [14] with the other authored by Geary Gravel.[15]DC Comics released a comic book adaptation written by Kelley Puckett and drawn by Mike Parobeck.[16] The comic book adaptation was later included with the VHS release. Kenner who had already released toys for the regular Batman cartoon series, produced several tie in figures for the film, including the Joker and the Phantasm (packaged unmasked, spoiling a pivotal plot point in the film)Batman & Robin Adventures Annual #1: Shadow of the Phantasm is a comic book sequel to the film, written by Paul Dini, and was released in 1996.","Plot":"During a conference of crime bosses held in a Gotham City skyscraper, gangster Chuckie Sol is killed by a mysterious cloaked figure, shortly after Batman bursts in on the meeting. Since Chuckie was a gangster, Chuckie's killer is automatically a hero. Due to the killer's resemblance to Batman, the Dark Knight is blamed for Sol's death. Councilman Arthur Reeves tells the media that Batman is a public menace (despite Commissioner Gordon's protests), then later attends a party at the mansion of billionaire Bruce Wayne, Batman's secret identity. Reeves teases Bruce about his bad luck with women and for having allowed an old girlfriend, Andrea Beaumont, to get away.In a flashback to 10 years before, Bruce meets Andrea in a cemetery while visiting his parents' grave. That night, in one of his first crime-fighting attempts, Bruce foils an armored car robbery while disguised in a black ski-mask and leather jacket. Though he succeeds, he is discouraged that the criminals did not fear him. Around the same time, he begins a romance with Andrea. Eventually, Bruce decides to abandon his plan to become a crime-fighting vigilante and proposes marriage to Andrea. Soon afterward, however, Andrea mysteriously leaves Gotham with her father, Carl Beaumont, ending her engagement to Bruce in a Dear John letter. Believing that he has lost his last chance of having a normal life, Bruce dons the mask of Batman for the first time.The mysterious killer finds and murders another gangster, Buzz Bronski. Around the same time, Batman discovers that Andrea has returned to Gotham for the first time in 10 years, and she ends up finding out that Bruce is Batman. Batman soon finds evidence linking Andrea's father with gangster Salvatore Valestra, for whom both Sol and Bronski once worked as enforcers. When he visits Andrea to try to get more answers, she rebuffs him over the choices that he made while she was away. The killer later targets Valestra, who turns to the Joker for help. The killer arrives at Valestra's house, and finds the gangster already dead at the Joker's hands; the house explodes, with the killer barely escaping. Batman pursues the killer, but is interrupted by the police, who try to arrest Batman. Andrea rescues Batman in her car, and they spend the night together at Wayne Manor. Andrea explains to Bruce that she and her father had left Gotham and had been hiding in Europe from the Valestra mob, to whom he owed a lot of money. Batman comes to suspect that Andrea's father may be the killer, but later gets Reeves (who was told of Batman's innocence by the Joker before being poisoned by him, as he believed the Councilman to be the killer) to confess that he told the Valestra mob where Beaumont was hiding in return for campaign contributions, and that the mob ordered Beaumont's death.The killer tracks the Joker to his hideout — an abandoned world's fair amusement park — and removes its ominous costume: the killer is Andrea, intent on avenging her father's death at the hands of the Joker, who is revealed to be the last surviving member and professional hitman of the Valestra mob. Having already deduced her identity, and ready for her attack, the Joker fights her. Just before he can kill Andrea, Batman arrives and saves her from the Joker, and begs Andrea to give up her quest for revenge. She refuses, stating that the mob ruined her life by taking away her future with him; she tells Batman that he himself is driven by revenge before disappearing. Batman battles with the Joker, a struggle that ends in a stalemate. Moments later, Andrea returns and seizes the Joker, bidding Batman goodbye before vanishing with the maniacally laughing clown in a cloud of smoke as the entire amusement park erupts in a series of rigged explosions. Batman barely escapes by falling into a waterway and being swept away to safety by the current.Alfred later consoles a heartbroken Bruce, telling him that no one could have helped Andrea. Bruce finds a locket containing a picture of himself and Andrea left behind in the Batcave. Meanwhile, Andrea is shown standing alone on the deck of a departing ocean liner. In the final scene, Batman stands alone on the top of a Gotham building; when the Bat-Signal appears in the sky, he swings off into the night to continue his war on crime.","Themes":"Paul Dini intended each of the flashbacks into Batman's love life to \"have a tendency to get worse, when you hope things will get better.\" Bruce's relationship with Andrea, which at first shows promise, eventually turns into turmoil.[12] At first, Bruce and Andrea are set for marriage, but then Bruce is given a farewell note from Andrea cutting off their relationship. This eventually leads into Bruce's decision to become Batman.[12] Richard Corliss of Time felt this scene paralleled Andrea's decision to avenge her own parents and reject love, when she finds her own father murdered. Both events transform the two people (Bruce becomes Batman, Andrea becomes the Phantasm).[13] One scene depicts Bruce Wayne at his parents' tombstone saying \"I didn't count on being happy.\" According to writer Michael Reaves, this scene was to be a pivotal moment in Bruce's tragic life, as he denies himself the opportunity to live a normal life.[5] Reaves also stated: \"When Bruce puts on the mask for the first time, [after Andrea breaks their engagement], and Alfred says 'My God!' he's reacting in horror, because he's watching this man he's helped raise from childhood, this man who has let the desire for vengeance and retribution consume his life, at last embrace the unspeakable.\"[5]","Reception":"Batman: Mask of the Phantasm opened on December 25, 1993 in the United States in 1,506 theaters, accumulating $1,189,975 over its first 2 days. The film went on to gross $5,617,391 in the domestic total box office intake.[1] The filmmakers blamed Warner Bros. for the unsuccessful marketing campaign. Mask of the Phantasm did eventually pass its $6 million budget with its various home video releases.[8]Based on 27 reviews collected by Rotten Tomatoes, Batman: Mask of the Phantasm received an average 81% overall approval rating with the consensus stating, \"Stylish and admirably respectful of the source material, Batman: Mask of the Phantasm succeeds where many of the live-action Batman adaptations have failed.\"[24] Empire cited it as the best animated film of 1993, and felt it contained better storylines than Tim Burton's Batman and Batman Returns.[25] TV Guide was impressed with the art deco noir design that was presented. In addition the film's climax and Batman's escape from the Gotham City Police Department were considered to be elaborate action sequences.[26] Richard Harrington of The Washington Post agreed with overall aspects that included the animation, design, dialogue. and storyline, as well as Shirley Walker's film score.[27] Gene Siskel and Roger Ebert regretted not having viewed the film in its theatrical release and gave the film a positive reaction, with Siskel feeling that Phantasm was better than Batman Returns and Joel Schumacher's Batman Forever, and only slightly below Batman.[28] Stephen Holden of The New York Times thought the voice performances were \"flat and one-dimensional\".[29] Chris Hicks of the Deseret News felt \"the picture didn't come alive until the third act\" feeling that the animators sacrificed the visuals for the storyline. In addition, he felt Mark Hamill \"stole the show.\"[30] Leonard Klady of Variety had mixed reactions towards the film, but his review was negative overall. He felt the overall themes and morals were clichéd and cited the animation to be to the \"point of self-parody\".[31]More recently, IGN ranked Mask of the Phantasm as the 25th best animated film of all time in a list published in 2010.[32] Total Film named Mask of the Phantasm the 47th greatest animated film out of 50 in 2011.[33] In 2011, Time Magazine ranked Phantasm as one of the 10 best superhero movies.[34] Mask of the Phantasm has been largely cited by Batman fans and critics alike as one of the best Batman films ever made, and has appeared on numerous \"best-of\" lists for both animated films and superhero films.[citation needed] In 2010, IGN said it was \"the Dark Knight's best big screen story\" until Batman Begins (2005).[35] Wired magazine's Scott Thill said Kevin Conroy is \"the finest Batman on record\".[36] In October 2012, WhatCulture also praised the film, saying it was at the same level as Christopher Nolan's Dark Knight Trilogy, if not slightly higher.[37] In 2016, the Nostalgia Critic reviewed the film and called it the best ever cinematic representation of Batman.[38]Alongside The Lion King and The Nightmare Before Christmas, Mask of the Phantasm was nominated for an Annie Award in the category of Best Animated Feature, but lost out to The Lion King.[39]","Soundtrack":"The soundtrack score to Batman: Mask of the Phantasm, composed by Shirley Walker, was originally released on December 14, 1993 under the label of Reprise Records. The song \"I Never Even Told You\" was written by Siedah Garrett and Glen Ballard.Remastered version: On March 24, 2009, La-La Land Records released a limited edition remastered version of Shirley Walker's soundtrack score through their \"Expanded Archival Collection\". The new release included bonus tracks that extended the score 27 minutes longer than the original release. Bolded tracks are previously unreleased.","produced_by":"Alan Burnett Michael Uslan Benjamin Melniker Bruce Timm","starring":"Kevin Conroy Mark Hamill Dana Delany Hart Bochner Stacy Keach Abe Vigoda Efrem Zimbalist, Jr.","music_by":"Shirley Walker","edited_by":"Al Breitenbach"}