{"original_language(s)":"English","screenplay_by":"J.D. Feigelson (teleplay)","story_by":"J.D. Feigelson (story) Butler Handcock (story)","production_company(s)":"Wizan Productions","dark_night_of_the_scarecrow":"DVD cover","Legacy":"Aaron Crowell, Managing Editor for HorrorHound Magazine, wrote: \"With its 1981 release Dark Night of the Scarecrow was the first feature length horror film with a scarecrow as its centerpiece. In the intervening years many have copied this image, but with Dark Night of the Scarecrow writer J. D. Feigelson is credited as creator of the entire 'Killer Scarecrow' horror film subgenre\".[citation needed]","Plot":"In a small town in the Deep South, Charles Eliot \"Bubba\" Ritter, a large but gentle mentally challenged man, befriends young Marylee Williams. Some of the townspeople are upset by the closeness between Marylee and Bubba, and the brooding, mean-spirited postman Otis Hazelrigg is the worst. When Marylee is mauled by a vicious dog (Bubba saves her) and lies unconscious at a doctor's office, Otis promptly assumes that Bubba has murdered (and likely raped) her. Otis and three friends – gas station attendant Skeeter Norris and farmer-cousins Philby and Harliss Hocker – form a lynch mob. Bubba's mother disguises him as a scarecrow and posts him in a nearby field to wait for the drama to cool down. Otis' bloodhounds sniff Bubba out, and all four vigilantes empty multiple rounds from their guns, killing him. Afterwards, they discover that Marylee is in fact alive, thanks to Bubba, whom they have just murdered. Acting fast, Otis places a pitchfork in Bubba's lifeless hands to make it appear as if he were attacking them with a weapon. The vigilantes are subsequently released because of lack of evidence against them (and blatant perjury by Otis) when the murder is brought to court.Marylee, who has recovered from the attack, sneaks out of her room at night and goes over to the Ritter house looking for Bubba. Mrs. Ritter cannot bring herself to tell Marylee the truth and instead tells her that Bubba has gone away where no one can hurt him. Marylee runs out of the house to look for Bubba and Mrs. Ritter goes after her. She finds Marylee sitting in the field where Bubba had been killed singing a favorite song of hers and Bubba's, and she calmly tells Mrs. Ritter that Bubba isn't gone, only hiding.A day later, Harliss finds a scarecrow in his fields like the one Bubba was hidden in; there is no indication of who put it there. Otis suspects the district attorney of putting it there to rattle the four of them and tells the others to keep calm and do nothing. In the evening, the figure disappears, and Harliss hears activity in his barn. He is investigating up in the loft when a wood chipper below starts of its own accord. Startled, he topples over into the machine and is killed. Because the wood chipper had not run out of gasoline after Harliss had been killed but had been switched off, Otis, Philby and Skeeter suspect that Harliss' death was not accidental. Otis obliquely accuses Mrs. Ritter of having engineered this supposed accident; she denies involvement, but says that other agencies will punish her son's murderers (and also implies that Otis is a pedophile because of his intense interest in Marylee).At the local church's Halloween party while playing hide-and-seek with the other children, Marylee is confronted by Otis, who tries to get her to tell him that Mrs. Ritter is behind the recent events. Instead, she tells him that she knows what he and his friends did to Bubba and runs from him. Otis chases after her but is stopped by a security guard, who tells him to go back to the party.The scarecrow soon reappears in Philby's field, and that night Otis breaks into Mrs. Ritter's house. Trying to stop what he sees as the next stage of her plot, he handles her so roughly that she suffers a fatal heart attack. To cover his tracks, Otis starts a gas leak which results in an explosion that destroys the house. While everyone else believes the explosion was an accident, the district attorney is suspicious.The next night, Philby is disturbed by a commotion in his hog pen; while checking it out, mysterious occurrences make him panic and try to flee in his car, which refuses to start. When he gets out to check the motor, heavy footsteps are heard; he turns and sees something (unseen by the audience) which terrifies him. He is pursued across his property and takes refuge in a grain silo, shutting the door behind him. A conveyor belt feeding into the building is switched on. Philby, unable to open the now-locked door of the silo, is buried in the resulting avalanche of grain and suffocates.The next day, upon learning from Otis of Philby's death, Skeeter is ready to turn himself in rather than face the scarecrow's wrath. Otis remains convinced that recent occurrences are a hoax arranged to avenge Bubba's murder and that Bubba himself is still alive. That night he and Skeeter dig up Bubba's grave, ostensibly to prove that the corpse is not there. Skeeter opens the coffin to reveal that the corpse is in fact there and in panic tries to flee. Otis chases after and stops him, promising to go along with whatever Skeeter decides to do. They return to the grave to refill it, but while Skeeter is down in the grave closing the coffin lid, Otis decides to protect himself, kills Skeeter by smashing his skull with a shovel, and fills in the grave with Skeeter inside it.Driving home in an intoxicated state, Otis sees Marylee alone in the middle of the road. Pursuing her, he crashes his van and chases her on foot into a pumpkin patch. He has just caught her and accused her of masterminding the scarecrow murders when a plowing machine nearby starts up of its own accord. Otis bolts, with the machine chasing him, and collides with the same scarecrow that appeared to his accomplices. It is holding the pitchfork that the murderers had planted on Bubba's corpse, and Otis has been impaled on the tines. He collapses and dies, only realizing the truth at the moment of his death. Marylee, who has been hiding in the pumpkin patch, hears footsteps approaching; she looks up and smiles to see the scarecrow looking down at her. It bends down, presenting her with a flower, and she says \"Thank you, Bubba\". Marylee then innocently tells him that she has a new game to teach him, called \"the chasing game.\"","country_of_origin":"United States","original_network":"CBS","Reception":"Critical reception for the film has been mixed. Amazon has it with 4 1/2 stars out of five. It currently has a score of 40% \"Rotten\" on Rotten Tomatoes.[3]The film was released on VHS by Key Video in the mid-1980s;[4] it is now difficult to find the film in this format.The film was released on September 28, 2010 on DVD by VCI Entertainment. The 30th anniversary Blu-ray disc was released on October 11, 2011 with additional bonus features.[5][6][7]","created_by":"J.D. Feigelson","distributor":"CBS","cinematography":"Vincent A. Martinelli (as Vincent Martinelli)","directed_by":"Frank De Felitta","original_release":"October 24, 1981","theme_music_composer":"Glenn Paxton","References":"NotesCitations","editor(s)":"Skip Lusk","genre":"Suspense Horror","starring":"Larry Drake Charles Durning Tonya Crowe Jocelyn Brando Lane Smith","running_time":"96 minutes","producer(s)":"Bobbi Frank (producer) Janet Greek (associate producer) Joe Wizan (executive producer)","Release":"Dark Night of the Scarecrow premiered on CBS on October 24, 1981 and was re-released on 29 April 2010 as part of the Texas Frightmare Weekend 2010.[2]"}