{"based_on":"Celle qui n'était plus  by Boileau-Narcejac","country":"France","Legacy and remakes":"The film created a sensation upon its original release. It has often been likened to the films of Alfred Hitchcock; some sources say that Alfred Hitchcock missed out on purchasing the rights to the Boileau and Narcejac novel by just a few hours, Clouzot getting to the authors first.[10] The end credit contains an early example of an \"anti-spoiler message.\"[citation needed] The film was a success at the box office, with 3,674,380 admissions in France alone.The film gained additional press when, only five years after its release, Véra Clouzot died of a heart attack at age 46, somewhat mirroring her character in the film, who also had heart problems.The 1967 film Games, written by Gene R. Kearney and directed by Curtis Harrington, and starring James Caan and Katharine Ross, has a different basic situation, but similar twists at the end, and again features Simone Signoret as the corrupt woman of mystery.An American version of Les Diaboliques, titled Reflections of Murder, was made by ABC-TV in 1974 with Tuesday Weld, Joan Hackett, and Sam Waterston. In 1993, another made-for-television movie remake was made; this one was titled House of Secrets, and it starred Melissa Gilbert. In 1996, the film was remade again as Diabolique, adapted by Don Roos, directed by Jeremiah S. Chechik, and starring Sharon Stone and Isabelle Adjani in the leading female roles, with Chazz Palminteri as the husband and Kathy Bates as the detective.","distributed_by":"Cinédis (France) UMPO (US) Gala Film Dists. (UK)[1] Criterion (US DVD, 1999) Arrow Films (UK DVD, 2007)","screenplay_by":"Henri-Georges Clouzot Jérôme Géronimi","Plot":"A second-rate boarding school is run by the tyrannical and mean Michel Delassalle (Meurisse). The school is owned, though, by Delassalle's teacher wife, the frail Christina (Clouzot). Delassalle also has a relationship with Nicole Horner (Signoret), another teacher at the school. Rather than antagonism, the two women are shown to have a somewhat close relationship, primarily based on their apparent mutual hatred of Michel, who is physically and emotionally abusive to both, as well as unkind to the children.Unable to stand his mistreatment any longer, Nicole devises a plan to get rid of Michel forever. Though hesitant at first, Christina ultimately consents to help Nicole. Using a threatened divorce to lure Michel to Nicole's apartment building in a remote village several hundred kilometers away, Christina sedates him. The two women then drown him in a bathtub and dump his body in the school's neglected swimming pool. When his corpse floats to the surface, they think it will appear to have been an accident. Almost everything goes according to their plans until the body fails to surface. Michel's corpse is nowhere to be found when the pool is drained.Nicole sees in the paper that the police have found the corpse. However, when Christina goes to the morgue, she learns it is not actually Michel's body. There she meets Alfred Fichet (Vanel), a retired private detective. He becomes involved in the case, much to Nicole's chagrin.When Christina and Alfred come back, a boy is punished for breaking a window; the boy says it was Michel who punished him. After hearing this, Christina becomes very sick and is unable to be photographed for the school photo. However, it appears that Michel appears in the photo standing in the back next to a window. Nicole becomes worried and leaves the school.Christina, overcome by fear, tells Alfred everything. He does not believe her, but he investigates the pool. That night, Christina hears noises and wanders the school. When she realizes that someone is in the school, she runs back to her room. There she finds Michel's corpse in the bathtub. Michel rises from the tub, and Christina, who was said to have a weak heart, has a heart attack and dies. It is then revealed that Michel and Nicole have set up Christina from the beginning. Michel was acting as dead to scare Christina to death. However, Alfred hears their celebration and figures out everything. He then arrests them.Some time later, the same boy who had earlier broken a window breaks another. When asked how he got his slingshot back, the boy says that Christina gave it to him. A final title screen tells the audience not to reveal the ending to others.","language":"French","Critical reception":"In 2007, Time placed Les Diaboliques on their list of Top 25 Horror films.[7] The film holds a 97% approval rate based on 36 reviews on the Rotten Tomatoes web site.[8] In 1954 Les Diaboliques won the Louis Delluc Prize and the award for best foreign film at the New York Film Critics Circle Awards in 1955.[9]","cinematography":"Armand Thirard","directed_by":"Henri-Georges Clouzot","Home media":"The film was released on DVD by The Criterion Collection in July 1999 and was then re-released on DVD and Blu-ray in May 2011. The latter release features selected-scene commentary by French-film scholar Kelley Conway, a new video introduction by Serge Bromberg, and a new video interview with novelist and film critic Kim Newman.[11]","References":"Notes","release_dates":"29 January 1955 (1955-01-29) (France)|||||","les_diaboliques":"theatrical release poster","produced_by":"Henri-Georges Clouzot","starring":"Simone Signoret Véra Clouzot Paul Meurisse Charles Vanel","running_time":"114 minutes 107 minutes (US, 1955)[2]","music_by":"Georges Van Parys","edited_by":"Madeleine Gug"}