{"airplane_ii:_the_sequel":"Theatrical release poster","country":"United States","distributed_by":"Paramount Pictures","Plot":"In the near future, the Moon has been colonized and supports a station on its surface. A lunar shuttle known as Mayflower One is being rushed to launch from Houston. The head of the ground crew, The Sarge (Chuck Connors), does not like what is occurring, but he defers to the airline's management.On the flight crew are Captain Clarence Oveur (Peter Graves), navigator/co-pilot Unger (Kent McCord) and first officer/flight engineer Dunn (James A. Watson, Jr.). Also on board is computer officer Elaine Dickinson (Julie Hagerty). Elaine has long left Ted Striker (Robert Hays) and is now engaged to one of the flight crew, Simon Kurtz (Chad Everett). Striker has in the meantime been committed to an insane asylum, as he was declared mentally incompetent in a lawsuit following a test flight that Ted piloted and in which the lunar shuttle crashed. Striker believes that the lawsuit was used to silence him, because he knew there were problems with the lunar shuttle that made it unsafe, and he is once more haunted by his actions in \"The War\" - causing a relapse of his \"drinking problem\", specifically the events that took place over \"Macho Grande\", where he lost his entire squadron. When Striker reads of the upcoming lunar shuttle launch, he escapes the asylum and buys a ticket for the flight.During the flight, Mayflower One suffers a short circuit, causing the artificially intelligent computer ROK to go insane and send the ship toward the Sun. Unger and Dunn try to deactivate the computer, but are blown out of an airlock. Oveur tries to stop ROK, but the computer gasses him. Kurtz abandons Elaine and leaves in the only escape pod. Once again, Striker is called upon to save the day, but first he has to figure out how to make the computer relinquish control. Steve McCroskey (Lloyd Bridges), the air traffic controller, reveals that a passenger named Joe Seluchi (Sonny Bono) had boarded Mayflower One with a bomb in a briefcase, intending to commit suicide so that his wife can collect on insurance money. Striker manages to wrestle the bomb from Seluchi and uses it to blow up ROK and set course for the Moon as originally intended.Using the bomb to destroy the computer causes collateral damage to the shuttle, meaning the flight is not out of danger yet. On the way to the Moon, control of the flight is shifted to a lunar base, commanded by Commander Buck Murdock (William Shatner). He has a high level of contempt for Striker because of Macho Grande, but agrees to help anyway. They manage to land the craft on the Moon. Ted and Elaine fall back in love and are married at the end. After the wedding, Seluchi looks into the cockpit and asks for his briefcase back.A postcredit scene shows a screen that says \"Coming From Paramount Pictures: \"Airplane III\". Murdock is then seen saying \"That's exactly what they'll be expecting us to do!\"","language":"English","Reception":"Variety magazine commented that \"It can't be said that Airplane II is no better or worse than its predecessor. It is far worse, but might seem funnier had there been no original.\"[2] Roger Ebert gave the film two out of four stars, saying it \"never really seems to know whether it's about a spaceship. It's all sight gags, one-liners, puns, funny signs and scatological cross-references.\"[3]The film received a 42% rating on Rotten Tomatoes.[4]","box_office":"$27.2 million","cinematography":"Joe Biroc","directed_by":"Ken Finkleman","release_dates":"December 10, 1982 (1982-12-10)|||||","produced_by":"Howard W. Koch","starring":"Robert Hays|Julie Hagerty|Lloyd Bridges|Chad Everett|William Shatner|","running_time":"85 minutes","music_by":"Elmer Bernstein Richard Hazard","edited_by":"Tina Hirsch","written_by":"Ken Finkleman","budget":"$15 million[1]"}