{"country":"United States","distributed_by":"Island Alive","Plot":"After Mickey is released from a mental hospital, where his stories are perceived as lies, he goes back to Los Angeles in search of a woman named Eve. When he arrives at the bar that bears her name, he is immediately attracted to the new owner, a former call girl also named Eve. She tells Mickey she bought the bar after the old owner killed herself, \"over some guy\". Although Eve is also attracted to Mickey, she refuses to commit to any one man, confessing to radio talk show host Dr. Nancy Love that she ruined too many marriages to have one of her own. That night Eve rebuffs Mickey's advances and sleeps with the bartender who has a crush on her, while avoiding the married man she's been having an affair with.That same night, Dr. Nancy Love answered Eve's ad for a roommate to share her house, and moves in the next day. Nancy conceals her identity and begins to observe Eve's romantic entanglements even as she counsels Eve through her radio show. When Eve's married lover, Zack, calls looking for her, Nancy asks penetrating questions and begins dispensing relationship advice, despite the fact that she herself has been unable to maintain a successful relationship. Zack in turn resumes his pursuit of Eve, although his wife, Pearl, has begun to haunt Eve's bar hoping to catch him with her, unbeknownst to Eve.Mickey comes back to the bar the next night when he is unable to pay for a bus ticket home to Las Vegas. Pearl asks his opinion of a poem, and when she argues his interpretation Mickey reveals that he taught poetry, as well as being a photographer and a former soldier. Eve is intrigued but cool, and Mickey leaves when Pearl offers to get him into a hot card game where he can get the money for a ticket home. When she drops him off, Mickey kisses Pearl and asks her to marry him, but she just laughs, calling him crazy, although she invites him to drop by her place, and gives him Eve's address and phone number. At the game Mickey wins big, earning the ire of Pearl's husband Zack. Zack warns Mickey not to come back, before he goes to meet Eve, but Eve in turn sends Zack away, telling him their affair is over.Mickey goes to Pearl's apartment to crash, and when he wakes up begins taking pictures as she sleeps. She is just waking up when Zack walks in, still stinging from Eve's rejection, and he attacks Mickey, pulling a gun and taking back the money he lost. He slaps Pearl after Mickey runs out, assuming they slept together.Mickey calls Eve's house, and when Nancy answers pleads to come over and crash, hanging up before he realizes who she is. When he arrives Nancy tells him Eve isn't home, and while he is confused he welcomes the chance to bathe and eat when she allows him in. She snoops in his suitcase while he bathes, finding memorabilia showing the truth of his stories and travels. As he eats they talk about Eve, but sensing her loneliness he sweeps her into bed, then asks her to marry him and go with him to Las Vegas. Nancy laughs, but tells him she doesn't believe he's crazy. Then she tells him to leave before she goes to work.Eve calls into Nancy's radio show from the office above her bar, torn between her attraction for Mickey and her fear of making another mistake. Nancy's post-coital euphoria overcomes her normal intellectual approach, and she encourages Eve to give in to, rather than resist, her feelings. So when Mickey comes looking for Eve that night, she is almost ready to give in when Zack appears and assaults Mickey again. Eve takes off while they are fighting, and when she gets home is suddenly confronted by Nancy, who tells her everything. Eve is devastated when Nancy proposes that they \"share\" Mickey's affection, and she tells Nancy she can have him, before rushing out.Mickey goes back to Eve's house to recover his suitcase, and Zack finds him there and assaults him again. But Mickey prevails, recovering the money and leaving with his suitcase. He tries to cadge a ride to the bus station but spies Eve on the roof of the bar, and races up to see her. She pulls a gun and threatens to kill herself until he does the same; then she breaks down and they embrace.Soon they are on a bus, on their way to Las Vegas, and when a fellow passenger asks if they are gambling, Eve says you could call it that - they've just been married.","language":"English","box_office":"$2 million[1]","cinematography":"Jan Kiesser","directed_by":"Alan Rudolph","choose_me":"Choose Me theatrical poster","release_dates":"August 29, 1984 (1984-08-29)|||||","produced_by":"Carolyn Pfeiffer David Blocker","starring":"Geneviève Bujold Keith Carradine Lesley Ann Warren","running_time":"114 min.","music_by":"Phil Woods Luther Vandross Teddy Pendergrass (title song)","edited_by":"Mia Goldman","Critical reaction":"The film is reviewed favourably in Pauline Kael's eighth collection of movie reviews State of the Art: \"The love roundelay Choose Me, written and directed by Alan Rudolph, on a budget of $835,000, is pleasantly bananas. The songs are performed by Teddy Pendergrass and he's just right. The entire movie has a lilting, loose, choreographic flow to it [...] this low-budget comedy-fantasy has some of the most entertaining (and best-sustained) performances I've seen all year.\"The film was screened out of competition at the 1984 Cannes Film Festival.[2]","written_by":"Alan Rudolph","budget":"$835,000[1]"}