{"country":"United States","distributed_by":"Buena Vista Pictures","déjà_vu":"Theatrical release poster","Plot":"On Mardi Gras in New Orleans, the ferry Sen. Alvin T. Stumpf is carrying hundreds of the U.S. Navy sailors and their families across the Mississippi River from their base to the city. Suddenly, the ferry explodes and sinks, killing 543 passengers and crew members. Special Agent Douglas Carlin (Denzel Washington) from the Bureau of Alcohol, Tobacco, Firearms and Explosives (BATF) is sent to investigate and discovers evidence of a bomb planted by a domestic terrorist. Arriving at the scene he hears his unique ring tone coming from a nearby body bag. He then meets with local investigators and FBI Special Agent Paul Pryzwarra (Val Kilmer), and informs them of his findings. He learns about a charred body pulled from the river, identified as Claire Kuchever (Paula Patton). Unlike the other bodies from the ferry, though, this one appears to have been killed before the explosion.Pryzwarra is impressed with Doug's detective expertise, and asks him to join a newly formed governmental detective unit whose first case is to investigate the bombing. Led by Dr. Alexander Denny (Adam Goldberg), they investigate the events before the explosion by using a program called \"Snow White\", which enables them to look into the past (4 days, 6 hours, 3 minutes, 45 seconds, 14.5 nanoseconds) in detail by using several satellites to form a triangulated image of events. The system is limited in that they can only see past events once; there is no fast forwarding or rewinding, although they can record everything in the process. Convinced that Claire is a vital link, Doug persuades them to focus on her. While investigating Claire's past through \"Snow White\", the bomber calls her to buy the SUV that she has for sale so he can use it for the bomb. Although he doesn't buy her car, the \"Snow White\" team now knows exactly where and when the terrorist was during the call.Doug finds out \"Snow White\" is actually a time window, and can send inanimate objects into the past. Despite Denny's protests against tampering with the past, Doug has the team send a note back to his past self with the time and place to stop the ferry bomber. Instead, his partner Larry Minuti gets the note and while following up on it he is shot by the terrorist, and setting up his death in the present. The team attempts to follow the terrorist, who takes Minuti with him, but he moves outside of \"Snow White\"'s range. However, Doug is able to follow him in the present using a \"Snow White\" like helmet that increases the machine's range, and able to track him to the terrorist's home. In the past time, Minuti regains consciousness, but is killed and burned by the terrorist. Still needing a vehicle big enough to hold the bomb (and is not riddled with bullet holes) the terrorist goes to Claire's address, kidnaps her and takes her car.Using face recognition technology the ferry bomber is identified and taken into a custody. He turns out to be Carroll Oerstadt, angry at the military after being turned down by both Marines and Army, because their psychological profiling showed he was psychologically unstable. Considering the case now closed, the government shuts down the \"Snow White\" investigation, despite the killer having been caught, Claire and the ferry victims remain dead, which unsettles Doug since he is convinced that the \"Snow White\" team can actually alter history. Doug convinces Denny to do one last experiment, that is: send Doug to the past to save Claire and stop the bombing; a risky procedure, since no human has ever been sent back. Doug survives the trip, especially because he was sent back to a hospital emergency room, where they were able to revive him. He subsequently stops Claire from being murdered by Oerstadt in his very house.However, Doug goes to the ferry where, with Claire's help, he kills Oerstadt, but is unable to disarm the bomb. To save everyone, Doug and Claire purposely drive the bomb SUV off the end of the ferry before it explodes. Claire escapes but Doug, unable to get out of the vehicle, dies in the underwater explosion. As Claire mourns Doug's death, she is approached by an identical Doug Carlin, the one from her present who consoles her.","language":"English","Reception":"The film-critics aggregator Rotten Tomatoes reports 55% positive reviews based on 156 reviews and an average score of 5.9 out of 10. The consensus states, \"Tony Scott tries to combine action, science fiction, romance, and explosions into one movie, but the time travel conceit might be too preposterous and the action falls apart under scrutiny.\"[14] At the aggregator Metacritic, the film has a score of 59 out of 100, based on 32 reviews.[15]Joel Siegel of ABC News called the film technically \"well-made,\" but criticized its attempt to describe a supposedly scientific basis for time travel as both silly and dull,[16] as did Manohla Dargis of The New York Times, who additionally found the depiction of parishes decimated by Hurricane Katrina \"vulgar\".[17] Todd Gilchrist from IGN rated the film eight out of ten, calling it a \"bravura set piece\", despite an ending that \"feels inappropriate given the urgency (and seeming inevitability) of the story's dénouement.\"[18] Likewise, Michael Wilmington of the Orlando Sentinel rated the film three out of four stars, citing the \"good cast, Tony Scott's swift direction, and unyielding professionalism\" as rationale for his rating.[19] Kenneth Turan of the Los Angeles Times described the film's exploration of the nature of time and the implications of time travel as having been a \"sci-fi staple for generations\".[20]Both Terry Rossio and Bill Marsilii have acknowledged that the film was not shot the way they had wanted it to be, shifting the blame to director Tony Scott and his goal to focus more on the action aspect of the film than on the more meaningful plot the screenplay had called for. Marsilii, although \"quite critical of the mistakes made,\" said he was proud of the finished product.[21] Rossio, however, was so put off during filming that he, as of May 2008, had not seen the film.[22] Rossio complained that Scott had ignored the inclusion of important plot details from the screenplay whenever \"there was something he wanted to do\" instead.[23] In the DVD commentary, Scott admits that he thought he did a mediocre job shooting [the chase scene].[24]Rossio and Marsilii believe that many of the negative reviews of Déjà Vu are a direct result of Scott's direction of the film, and have stated that \"Tony Scott added nothing to Déjà Vu and made several hundred small mistakes and about eight or nine deadly mistakes\",[25] which makes the film seem like it has many unforgivable plot holes, when it should not have had any. \"[T]here are no plot holes at all, and scrutiny reveals the plot to be air tight.\" says Rossio. \"We had years to think of all this and work it out.\"[26] It was felt there were many misunderstandings that Scott's take on the plot introduced into the film. In his own defense, Scott cited in an interview with Iain Blair of BNET that only nineteen weeks were provided for the production of the film, which \"isn't a lot for a film like Déjà Vu.\"[27]Déjà Vu premiered in New York City on November 20, 2006, two days before its wide release in all of the United States and Canada. Alongside Mexico, the three countries were the sole nations to open the film in November. The United Kingdom opened the film on December 15, 2006, and was followed shortly thereafter by New Zealand on December 22. Australia was the last English-speaking country where the film premiered, on January 18, 2007.[28]The film opened in the #3 spot with $20.5 million in 3,108 theaters, an average of $6,619 per theater. Déjà Vu ran for fourteen weeks, staying in the top ten for its first three weeks. The U.S. domestic box office earnings for the film were $64,038,616, and the total worldwide box office earnings were $180,557,550. These earnings made Déjà Vu the 23rd most successful film of 2006 worldwide.[29]Although reviews from critics were mixed, Déjà Vu was nominated for six different awards, winning one.Déjà Vu was nominated for the Saturn Award in the category \"Best Science Fiction Film\", but lost to Children of Men.[30]Paula Patton, who played Claire Kuchever, was nominated for \"Best Breakthrough Performance\" for the Black Reel Awards. The award was won by Brandon T. Jackson for his performance in the film Roll Bounce.[31]Harry Gregson-Williams, the composer of the film's soundtrack, was nominated for the \"Film Composer of the Year\" division of the World Soundtrack Academy Awards (the award was won by Alexandre Desplat for his score with The Queen).[32]Déjà Vu received two nominations pertaining to the \"Best Fire Stunt\" and the \"Best Work with a Vehicle\", while it won the International Gold Reel Award at the Nielsen EDI Gold Reel Awards ceremonies.[33]","box_office":"$180.6 million[1]","Background and production":"The idea of a time travel thriller film originated between screenwriters Bill Marsilii and Terry Rossio, who communicated via email in attempts to develop the plot due to communication difficulties.[3] However, the creation of Déjà Vu's progenitor was set aside by the September 11, 2001 attacks that disrupted New York-native Marsilii,[3] and the advent of the 2003 film Pirates of the Caribbean: The Curse of the Black Pearl, which occupied Los Angeles-native Rossio.[3][4] However, by 2006, the two screenwriters had completed the concept. Brian Greene from Columbia University was brought in as a consultant to help create a scientifically plausible feel to the script.[3] Greene stated \"the way I try to explain wormholes in terms of bending paper and connecting the corners, that's there in the film and it was fun to see that that made it in.\"[5][6] The screenwriters submitted their work to Jerry Bruckheimer, who with Tony Scott were searching for new ideas for a feature film.[3]Principal photography in New Orleans, Louisiana, was delayed following Hurricane Katrina because of the devastation caused by the storm and the collapse of the levees.[2][7] Many of the exteriors were set to be shot in New Orleans, including a key sequence involving the Canal Street Ferry across the Mississippi River.[7] After the city was reopened, the cast and crew returned to New Orleans to continue filming. Some scenes of the post-Katrina devastation were worked into the plot, including those in the Lower 9th Ward; additionally, evidence of Katrina's impact on the city was worked into the script.[2] The filming crew spent two weeks filming a scene at the Four Mile Bayou in Morgan City, Louisiana.[8]According to director Tony Scott, Déjà Vu was written to take place on Long Island, but after a visit to New Orleans Scott felt that it would be a far better venue.[9] Jerry Bruckheimer reportedly said that Denzel Washington was \"adamant about returning to New Orleans to film after Hurricane Katrina devastated the region\", but Washington recalled to be neutral on the subject, while agreeing that it was \"a good thing to spend money there and put people to work there\".[10]To create a sense of realism, Scott and Washington interviewed numerous men and women whose real-life occupations pertained to positions in the Federal Bureau of Investigation and the Bureau of Alcohol, Tobacco, Firearms and Explosives; Washington has noted that he and Scott conducted similar research during the productions of Man on Fire and Crimson Tide.[10]Visual effects editor Marc Varisco, who had previously collaborated with director Scott on the 2005 film Domino, worked again with Scott to develop Déjà Vu into a fully-fledged work. In total, approximately 400 visual effects scenes were shot during the production of Déjà Vu.[11] They had acquired a LIDAR device, which incorporated lasers to scatter light with the intent of mapping out a small region, during the production of Domino; Scott and Varisco decided to use the apparatus again during the production of Déjà Vu.[11] Additionally, the two utilized the Panavision Genesis high definition camera to film the shots that would encompass the past that the Snow White team would peer at throughout the film, as well as the various night scenes.[11] The LIDAR apparatus, which was operated by a hired Texan company devoted to the device, performed scans of Claire Kuchever's apartment, the ferry, the ATF office, and actress Paula Patton, among others.[11] Effects editor Zachary Tucker combined the elements created by the Texan LIDAR company with computer-generated graphics to make possible the scenes of time-travel experienced in the film.[11]The explosion of the Stumpf was filmed using an actual New Orleans ferry in a portion of the Mississippi River sectioned off especially for the event; the occurrence took over four hours to prepare.[11] Under the supervision of pyrotechnics expert John Frazier, the ferry was coated entirely with fire retardant and rigged with fifty gasoline bombs including black dirt and diesel, each one set to detonate within a five-second range.[12] People and cars were added in later as elements of computer-generated graphics.[11] Chris Lebenzon was largely responsible for moving clips from each of the sixteen cameras in place to create the sensation of an extended explosion sequence.[12] The spectacular explosion actually caused no significant structural damage to the ferry; after a bout of sandblasting and repainting, the ferry was very similar to its previous state.[11] The ferry was returned into service four days after the production of the film's scene concluded.[12] During filming of the underwater car scenes, actual cars were dropped into the water; computer-generated effects were later added, simulating the entities' explosions. Compositing was done on the Autodesk Inferno special effects program.[11]Jim Caviezel's character, Carroll Oerstadt, seemed to mirror in several ways the story of Timothy McVeigh, a domestic terrorist who destroyed the Alfred P. Murrah Federal Building in Oklahoma City with a bomb in 1995. Caviezel and Scott[9] did not deny this, and both admitted that the Oerstadt character was at least partly based on McVeigh.[13] Ross Johnson of The New York Times also compared the ferry bombing at the film's beginning to the Oklahoma City bombing.[12]","cinematography":"Paul Cameron","production_company":"Touchstone Pictures Jerry Bruckheimer Films Scott Free Productions","directed_by":"Tony Scott","Home media":"Déjà Vu was released on DVD and home video approximately five months after its release in American theaters, on April 24, 2007. In the two weeks succeeding the day of the DVD's release, the film was the second most purchased DVD in the United States.[34] It was second only to Night at the Museum during this period in time.[35][36]Special features on the disc include an audio commentary from director Tony Scott for both the film and its deleted scenes. The DVD cover also includes a \"Surveillance Window\" feature, which includes featurettes on the film's production in New Orleans.[37]","Soundtrack":"The track listing for Déjà Vu largely borrows music not originally produced for the film; three of the songs that make an appearance in Déjà Vu uphold elements of soul and gospel. \"Don't Worry Baby\" by The Beach Boys simulated the actual concept of déjà vu, as detailed in the plot.Songwriters such as Harry Gregson-Williams contributed music to the film; artists like Charmaine Neville and Macy Grey performed music especially for the film.[38]The music featured in the film's trailer was titled \"Hello Zepp\", the main theme for Saw.The soundtrack was released by Hollywood Records.(featuring Alex Forbes)","release_dates":"November 22, 2006 (2006-11-22)|||||","produced_by":"Jerry Bruckheimer","starring":"Denzel Washington|Paula Patton|Jim Caviezel|Val Kilmer|Adam Goldberg|Bruce Greenwood|","running_time":"126 minutes","music_by":"Harry Gregson-Williams","edited_by":"Chris Lebenzon","written_by":"Bill Marsilii Terry Rossio","budget":"$75 million[1]"}