{"based_on":"Child 44  by Tom Rob Smith","country":"United States|United Kingdom|Czech Republic|Romania|Russia|","distributed_by":"Summit Entertainment/Lionsgate","screenplay_by":"Richard Price","Plot":"In 1933, a child (Xavier Atkins) orphaned during the Ukrainian Holodomor runs away from his orphanage and is taken in by a Red Army unit and adopted by its kindly commander (Mark Lewis Jones), who gives him the name Leo Demidov. In 1945, now a sergeant with the unit, Leo (Tom Hardy) becomes an icon across the Soviet Union when he is photographed planting the Soviet flag atop the Reichstag in Berlin. He becomes a Hero of the Soviet Union.In 1953, Leo, now married to Raisa (Noomi Rapace) and living in Moscow, is a captain in the Ministry of State Security (MGB), commanding a unit tasked with tracking down and arresting dissidents. They arrest a veterinarian, Anatoly Brodsky (Jason Clarke), and one of Leo's subordinates, the cowardly but ambitious Vasili Nikitin (Joel Kinnaman), shoots a farmer, Semyon Okun (Michael Nardone), and his wife in whose barn Brodsky has been hiding, orphaning their two young daughters. Angry, Leo strikes Vasili, who harbours growing resentment against Leo and the other officer in the unit, Alexei Andreyev (Fares Fares); all three were in Berlin together in 1945. Vasili is in charge of Brodsky's interrogation and execution, and one of the names he gives to their superior, Major Kuzmin (Vincent Cassel), is that of Raisa, a primary school teacher several of whose colleagues have recently been arrested for dissident views. Kuzmin orders Leo to investigate his own wife.Meanwhile, Alexei's young son, Jora (Zdenek Barinka), is found dead near a railway yard. Although the initial pathology report shows injuries consistent with torture, the surgically precise removal of organs, and drowning, the authorities declare that he was hit by a train, as Stalin has decreed that murder is a capitalist disease; there is no murder in paradise. Alexei is forced to accept the official conclusions in order to save himself and the rest of his family.Knowing what the consequences will be, Leo tells his superiors that his investigation has shown that Raisa is innocent of any crime and steadfastly refuses to denounce her. They are both later arrested by Vasili and Alexei and sent into internal exile in the provincial city of Volsk. Leo loses all rank and is forced to become a lowly militiaman under the command of General Nesterov (Gary Oldman), while Raisa is humiliated by becoming a cleaner in a school.When the body of another child is found near the railway line in Volsk with similar injuries to Jora, Leo begins to realise that a serial killer is on the loose. After discovering that Alexander Pickup (Anssi Lindström), the man who found the body, is a homosexual, Nesterov forces him to denounce every local homosexual he knows; when Pickup, a railway ticket collector, commits suicide by walking in front of a train, the authorities say the case has been solved. However, Leo persuades Nesterov, who has young sons himself, to investigate further, and the two discover that the bodies of at least 43 more children have been found along the railway line from Rostov-on-Don to Moscow.Meanwhile, Vasili, who now has Leo's old job, calls Raisa and attempts to persuade her to leave Leo and join him in Moscow. When she refuses, Vasili orders an MGB agent to abuse her. Raisa later admits to Leo that she only agreed to marry him because she was afraid to refuse the proposal given his status as an MGB officer.Leo and Raisa travel in secret to Moscow to interview a woman who reported seeing Jora with a stranger in the railway yards. Although Alexei helps them, the interview is unproductive, as the woman is too frightened to talk. Due to a large MGB and militia presence at the station, the pair ask Raisa's former colleague and friend Ivan Sukov (Nikolaj Lie Kaas), who she knows has contacts among dissident groups, to help them get out of Moscow. However, in his apartment they discover clues that he is in fact an undercover MGB officer (the cause of the arrests in Raisa's school) and that he has called the authorities; Leo kills him and they escape just before Vasili arrives. Leo tells Raisa that she can leave him if she wishes, but she chooses to stay with him.Leo and Raisa manage to return to Volsk, but there they are arrested by Vasili and his men for Sukov's murder. After being interrogated, Leo and Raisa are put on a train to a gulag. During the train ride, they are attacked by killers on Vasili's orders; after killing their assailants, Leo and Raisa jump off the train. They hitch a lift to Rostov, where the highest concentration of the serial killer's victims has been found; they correctly reason that the killer must work close to the rail yards there and travel the railway lines to Moscow in the course of his work. Vasili forces Alexei to tell him where they are likely to have gone, promising his family will be safe if he does so; Alexei tells him that Rostov is the likely destination before Vasili shoots him.In the Rostov tractor factory, Leo identifies the killer by cross-referencing workers' travel assignments with the location and date of the murders. Leo and Raisa pursue the killer, Vladimir Malevich (Paddy Considine), into the woods and corner him. He surrenders to them and says he cannot help his urge to kill children, but is suddenly shot in the head by Vasili, who has followed Leo and Raisa. Vasili tries to execute them, but, after a vicious struggle, they kill him. Leo cleverly tells the MGB agents who arrive that Malevich killed Vasili and that he then shot Malevich.Leo and Raisa are both reinstated in their old jobs and Kuzmin is removed for his failures. Leo is offered a promotion and a promising political position by his new superior, Major Grachev (Charles Dance), if he will agree that Malevich, a former army doctor who spent two years in a German POW camp, was 'turned' by the Germans and sent back to the Soviet Union to wreak havoc there. He refuses the promotion, but requests permission to set up and lead a homicide division in Moscow within the newly-created KGB, with the help of General Nesterov. Grachev agrees and Leo in return agrees that Malevich was clearly a Nazi agent. At least he will now have the ability and power to track down and deal with murderers, even if he still cannot openly admit that they are simply murderers and not enemy agents.Leo and Raisa track down Tamara and Elena Okun, go to the orphanage where they have been living, and adopt them.","child_44":"Theatrical release poster","language":"English","Reception":"Critical response to Child 44 was mostly negative. On Rotten Tomatoes, the film has a rating of 25%, based on 71 reviews, with an average rating of 4.7/10. The site's critical consensus reads, \"There's a gripping story at the heart of Child 44 and a solid performance from Tom Hardy in the lead, but it all still adds up to a would-be thriller that lacks sufficient thrills.\"[19] On Metacritic, the film has a score of 41 out of 100, based on 25 critics, indicating \"mixed or average reviews\".[20]Andy Lea of the Daily Star Sunday gave Child 44 three stars out of five. He wrote that \"the film is less than a sum of its parts\" and is \"a little bogged down with subplots\". However, Lea said that Hardy \"is excellent in the lead role\" and Espinosa \"crafts some brilliant individual scenes\".[21]Writing in The Guardian, Peter Bradshaw gave the film 2 stars out of 5 and reported that \"Tom Rob Smith’s page-turning bestseller from 2008 has been turned into a heavy, indigestible meal of a film, full of actors speaking English with very heavy Russian accents – actors from England, Sweden, Lebanon, Poland, Australia, almost anywhere but Russia\". Bradshaw added: \"Tom Hardy brings his robust, muscular presence to the role of Leo and he is watchable enough, but the forensic and psychological aspects are just dull; there is no fascination in the detection process. […] Everything is immersed in a cloudy brown soup\".[22] Also in The Guardian, reviewer Phil Hoad wrote: \"Child 44 has a fascinating premise and setting [but] failed to convincingly package this as either an upscale thriller along the lines of Tinker Tailor Soldier Spy, as implied by a powerhouse cast also featuring Gary Oldman, Noomi Rapace and Paddy Considine; or as something racier à la The Girl with the Dragon Tattoo or Gone Girl (indeed, the film itself falls awkwardly between these two stools)\". Hoad added, \"[a]s for the debacle over the Slavic-slathered English spoken by the entire cast, it further highlights the uncertainty about whether Child 44 was intended for the multiplex or the arthouse. Presumably a decision made to placate the former, opting to turn the film into an Iron Curtain version of ’Allo ’Allo damaged its integrity. Aren’t we past this kind of cultural bastardisation? It is possible for foreign-language films to cross over: The Lives of Others, which meted out its own totalitarian intrigue in German, took $66m overseas – the kind of cash Child 44 will never see\".[23]In The Observer, Jonathan Romney found, “In writer Richard Price’s boil-down of the labyrinthine original, the whodunit loses all momentum” adding that “the whole thing is scuppered by having everyone speak in borscht-thick Russian accents” before concluding that, \"[the film is] shot in several shades of Volga mud and drags like a Thursday afternoon in Nizhniy Novgorod\".[24]","box_office":"$13 million[2]","cinematography":"Oliver Wood","production_company":"Worldview Entertainment Scott Free Productions","directed_by":"Daniel Espinosa","release_dates":"April 17, 2015 (2015-04-17)|||||","Production":"Principal photography began in June 2013 in the cities of Prague, Ostrava and Kladno in the Czech Republic, and continued in Romania.[5] For the brief scene in the Moscow underground, the Prague subway was used. It was the first time in its history that it was shut to the public.[6][7]","produced_by":"Ridley Scott|Michael Schaefer|Greg Shapiro|","starring":"Tom Hardy|Gary Oldman|Noomi Rapace|Joel Kinnaman|Jason Clarke|Vincent Cassel|","running_time":"137 minutes","music_by":"Jon Ekstrand","edited_by":"Pietro Scalia|Dylan Tichenor|","Release":"On 15 April 2015, the Russian film distributor Central Partnership announced that the film would be withdrawn from cinemas in Russia, although some media stated that screening of the film was blocked by the Russian Ministry of Culture.[8][9][10] The decision was made following the press screening the day before. The Ministry of Culture and the Central Partnership issued a joint press release stating that the screening of the film before the 70th anniversary of the Victory Day was unacceptable.[11] The Ministry of Culture claimed that it received several questions on the film's contents, primarily concerning \"distortion of historical facts, peculiar treatment of events before, during and after the Great Patriotic War and images and characters of Soviet people of that era\".[11] Russian minister of culture Vladimir Medinsky welcomed the decision, but stressed that it was made solely by the Central Partnership. However, in his personal statement Medinsky complained that the film depicts Russians as \"physically and morally base sub-humans\", and compared the depiction of Soviet Union in the film with J. R. R. Tolkien's Mordor, and wished that such films should be screened neither before the 70th anniversary of the victory in the Great Patriotic War, nor any other time.[12] However, he also stated that the film would be available in Russia on DVD and online.[13]As a result of the decision the film was also withdrawn from cinemas in Belarus,[14] Ukraine,[15] Kazakhstan,[16] and Kyrgyzstan, while release of the film has been postponed until October in Georgia.[17]Ukrainian film director and producer Alexander Rodnyansky criticized the decision not to release Child 44 as bad for the country's film industry. \"Before, films where Soviet and Russian heroes were presented not in the best way have been released in Russia, but nothing similar happened. Now everything to do with history should clearly fit into a kind of framework set by the culture ministry.\"[18]","budget":"$50 million[1]"}