{"based_on":"The Unsuspecting Wife 1961 short story[1]  by Peter Stone Marc Behm","charade":"original film poster","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Peter Stone","Plot":"Regina \"Reggie\" Lampert (Audrey Hepburn), tells her friend Sylvie Gaudel (Dominique Minot) while on a skiing holiday that she has decided to divorce her husband Charles. She then meets a charming American stranger, Peter Joshua (Cary Grant). On her return to Paris, she finds her apartment is completely empty and police inspector Edouard Grandpierre (Jacques Marin) notifies her that Charles has been murdered while leaving Paris. Reggie is given her husband's travel bag, containing a letter addressed to her, a ticket to Venezuela, passports in multiple names and other items. At the funeral, three odd characters show up to view the body.Reggie is summoned to meet CIA administrator Hamilton Bartholomew (Walter Matthau) at the U.S. Embassy. She learns that the three men are Tex Panthollow (James Coburn), Herman Scobie (George Kennedy), and Leopold W. Gideon (Ned Glass), the three survivors of a World War II OSS operation. Together with Charles and a fifth man, Carson Dyle, they were to deliver $250,000 in gold to the French Resistance, but they stole it instead. Dyle was fatally wounded in a German ambush, and Charles double-crossed the others and took all the gold. The three men want the missing money, and the U.S. government wants it back. Bartholomew insists that Reggie has it, even if she does not know where it is.Peter tracks Reggie down and helps her move into a hotel. The three criminals separately threaten Reggie, each convinced that she knows where the money is. Scobie then shocks Reggie by claiming that Peter is in league with the trio, after which Peter confesses to her that he is really Carson Dyle's brother, Alexander, and is convinced that the others murdered Carson.As the hunt for the money continues, first Scobie is found murdered, then Gideon is killed in an elevator. Meanwhile, Reggie falls in love with Dyle, but gets yet another shock when she learns from Bartholomew that Carson Dyle had no brother. Confronted with this, Alexander now admits he is actually Adam Canfield, a professional thief. Although frustrated by his dishonesty, Reggie still finds herself trusting him.Reggie and Adam go to the location of Charles's last appointment and find an outdoor market. They also spot Tex there and Adam follows him. Seeing booths selling stamps to collectors, both realize separately that Charles must have purchased rare stamps and stuck them on an envelope in plain sight in his travel bag, but when they get to Reggie's hotel room the stamps are gone because Reggie had given them to Sylvie's boy, Jean-Louis (Thomas Chelimsky), for his collection. Reggie now also realizes the stamps' significance, so she, Sylvie, and Jean-Louis find the stamp trader, Mr. Felix (Paul Bonifas) who, recognizing the value of the stamps, returns them to Reggie.Back at the hotel, Reggie finds Tex murdered as well. While dying, he wrote the name \"Dyle\". Assuming that Alexander is the murderer after all, a frightened Reggie telephones Bartholomew, who arranges to meet her. When she leaves the hotel, Adam spots her and gives chase through the streets of Paris and the subway. At the rendezvous, Reggie is caught out in the open between the two men. Adam tells her that Bartholomew is really Carson Dyle, who was only wounded by the Germans. After another chase through an empty theater, Adam kills Dyle to save Reggie.Next day Reggie and Adam go to the embassy to turn over the stamps, but Adam refuses to accompany her further. Going in, Reggie is shocked to find that Adam is really Brian Cruikshank, the government official responsible for recovering stolen property. Now his true identity is revealed, he promises to marry her.The movie ends with a split-screen grid showing flashback shots of Brian's four identities, while Reggie says she hopes that they have lots of boys, so they can name them all after him.","language":"English","Reception":"Charade has received generally positive reviews from critics, receiving an 92% approval rating based on 35 reviews at Rotten Tomatoes, with an average of 8.1 out of 10.[8]In a review published January 6, 1964 in The New York Times by Bosley Crowther, the film was criticized for its \"grisly touches\" and \"gruesome violence,\" despite receiving praise for its screenplay with regards to its \"sudden twists, shocking gags, eccentric arrangements and occasionally bright and brittle lines\" as well as Donen's direction,[9] said to be halfway between a 1930s screwball comedy and North by Northwest by Alfred Hitchcock, which also starred Cary Grant.[9]In a Time Out review, the film was rated positively, with the assertion that it is a \"mammoth audience teaser [...] Grant imparts his ineffable charm, Kennedy (with metal hand) provides comic brutality, while Hepburn is elegantly fraught.\"[10] While reviewing the blu-ray DVD version of the film, Chris Cabin of Slant Magazine gave the film a positive three-and-a-half out of five rating, calling it a \"high-end, kitschy whodunit\",[11] and writing that it is \"riotous and chaotic take on the spy thriller, essentially, but it structurally resembles Agatha Christie's And Then There Were None\" as well as describing it as \"some sort of miraculous entertainment.\"[11] It inevitably resulted in a MAD Magazine parody called \"Charades\" with \"Cary Grand\" and \"Audrey Heartburn,\" and directed by \"Stanley Done-In.\"American Film Institute recognition","box_office":"$13,474,588 (US)[3]","cinematography":"Charles Lang","production_company":"Stanley Donen Productions","directed_by":"Stanley Donen","Soundtrack":"Henry Mancini composed the music and Johnny Mercer wrote the lyric. Mancini commented: \"Our next film together was 'Charade' in 1963. Stanley Donen directed Peter Stone's screenplay. There is a scene in the movie where Audrey returns from a happy winter holiday to her Paris flat to find it stripped of everything of value. Bare floors and the walls are all that remain. Her loutish husband had absconded with all of her worldly goods. She enters the dimly-lit apartment with her suitcase and surveys the scene. Her feelings are of sadness, loneliness and vulnerability. To me, it translated into a sad little Parisian waltz. With that image of Audrey in my mind, I went to the piano and within less than an hour 'Charade' was written. I played it for Audrey and Stanley. Both felt it was just right for the movie. Johnny Mercer added his poetry, and the song was nominated for an Oscar that year\". Although Mercer collaborated with Mancini on \"Moon River\", \"The Days of Wine and Roses\" and \"The Sweetheart Tree\", Mercer said that \"Charade\" was his favorite Mancini melody. The songs, all written by Mancini, include:In 2012, Intrada Records released the complete score as heard in the film (the previous soundtrack album was a re-recording).[19]","release_dates":"December 5, 1963 (1963-12-05) (United States)|||||","Production":"When screenwriters Peter Stone and Marc Behm submitted their script The Unsuspecting Wife around Hollywood, they were unable to sell it. Stone then turned it into a novel, retitled Charade, which found a publisher and was also serialized in Redbook magazine, as many novels were at the time. In Redbook it caught the attention of the same Hollywood companies that had passed on it earlier. The film rights were quickly sold to producer/director Stanley Donen. Stone then wrote the final shooting script, tailored to stars Cary Grant and Audrey Hepburn, with Behm receiving story co-credit.Hepburn shot the film in the fall of 1962, immediately after Paris When It Sizzles, which she shot that summer in a number of the same locations in Paris, but production difficulties with that film caused it to be released four months after Charade.When the film was released at Christmas, 1963, Audrey Hepburn's line, \"at any moment we could be assassinated,\" was dubbed over to become \"at any moment we could be eliminated\" due to the recent assassination of President John F. Kennedy. The dubbed word stood out quite clearly and all official video releases of the film have since restored the original dialogue, though some public domain videos taken from original release prints still carry the redubbed line.Cary Grant (who turned 59 during filming) was sensitive about the 25-year age difference between Audrey Hepburn (33 at the time of filming) and himself, and this made him uncomfortable with the romantic interplay between them. To satisfy his concerns, the filmmakers agreed to add several lines of dialogue in which Grant's character comments on his age and Regina — Hepburn's character — is portrayed as the pursuer.[7]The screenwriter, Peter Stone, and the director, Stanley Donen, have an unusual joint cameo role in the film. When Reggie goes to the U.S. Embassy to meet with Bartholomew, two men get on the elevator as she gets off. The man who says, \"I bluffed the old man out of the last pot — with a pair of deuces\" is Stone, but the voice is Donen's. Stone's voice is later used for the U.S. Marine who is guarding the Embassy at the end of the film.","produced_by":"Stanley Donen","starring":"Cary Grant Audrey Hepburn Walter Matthau James Coburn","running_time":"113 minutes","Public domain status":"Before 1978, U.S. copyright law required works to include the word \"Copyright,\" the abbreviation \"Copr.\" or the \"©\" symbol.[14][15][16]Because Universal Pictures included no proper copyright notice with Charade, the film entered public domain in the USA immediately upon its release.[5] Copies of this movie, made from film prints of varying quality, have been available on VHS and DVD based on its status in the public domain. However, while the film itself is public domain, the original music remains under copyright if outside of the context of the film.[17]Universal released an official VHS cassette of the film, transferred from original elements. However, when DVD was introduced, they licensed the film to The Criterion Collection rather than release it themselves. Competing with dozens of unofficial releases, the more expensive 2000 Criterion disc featured the only authorized professional transfer of the film on DVD. Universal eventually issued a version on DVD as a bonus feature included with the release of the remake The Truth About Charlie (2002). For the studio's 100th anniversary in 2012, Universal issued its own standalone DVD of the film that includes a digital copy. The film is available for free download at the Internet Archive.[18]Criterion subsequently reissued the DVD in 2004 with a new 16:9 transfer with more accurate colors, and then released a Blu-ray edition of the film in 2010. In 2013, for the film's 50th anniversary, Universal released their own restored Blu-ray.","music_by":"Henry Mancini","edited_by":"Jim Clark","budget":"$3 million[2]"}