{"based_on":"In Another Country  by David Constantine","country":"United Kingdom","distributed_by":"Artificial Eye","Critical response":"The review aggregator website Rotten Tomatoes reports a 97% approval rating with an average rating of 8.7/10, based on 155 reviews. The site's critical consensus reads, \"45 Years offers richly thought-provoking rewards for fans of adult cinema – and a mesmerizing acting showcase for leads Charlotte Rampling and Tom Courtenay.\"[9] On Metacritic, it has a score of 94 out of 100 based on 36 reviews, indicating \"universal acclaim.\"[10]Mark Kermode, writing in The Observer, described the film as a \"subtle examination of the persistence of the past and the fragile (in)stability of the present\", arguing that the lead performances \"turn an apparently everyday story of a marriage in quiet crisis into something rather extraordinary.\" He concludes the review by observing \"Like the final shot of The Long Good Friday, which lingers upon Bob Hoskins’s face as he revisits the events that brought him to this sorry pass, 45 Years shows us the past materialising in the expressions of those trapped in the present, staring into an uncertain future.\"[11]","screenplay_by":"Andrew Haigh","45_years":"Film poster","Plot":"The film takes place across six days, marked by intertitles.Five years after retirees Kate and Geoff Mercer had to cancel their 40th wedding anniversary because of his heart bypass surgery, the comfortably-off, childless, Norfolk couple are now planning to celebrate their 45th anniversary with dozens of friends at the Assembly House in Norwich.A week before the party, Geoff receives a letter from Switzerland telling him that the body of Katya, his lover in the early 1960s, has become visible in a melting glacier where she fell into a crevasse on their hike with a guide over five decades ago. Memories rush back to him and he realizes he has forgotten much of what little German he used to know and that he would need a dictionary to fully understand all that the letter says.Kate has known about Katya since the time Geoff and Kate met later in the 1960s and is initially unconcerned by Geoff's controlled disquiet. \"I can hardly be cross about something that happened before we even existed...\" she says, but after a pause adds \"Still...\".The next day Kate helps Geoff find his old German-English dictionary. Soon, Geoff's conduct begins to show that there is more on his mind than he says. Among other things, he tries to keep from Kate that he is beginning to take steps to fly to Switzerland without her to see Katya's body, which he imagines preserved in the now-transparent ice, still looking youthful.Prodded by Kate, Geoff talks about his relationship with Katya and thoughts evoked by the discovery of her body. He tells Kate that he and Katya had pretended to be married in order to be able to share a room in the more puritanical early 1960s. Because of this, the Swiss authorities consider him to be Katya's next of kin. Kate is troubled by the revelation.As the days pass and preparations for the party continue, Geoff continues to be moody and takes up smoking, which both had given up in the past. One night, Geoff climbs into the attic to look at his memorabilia of Katya and only reluctantly shows Kate a picture of Katya when she insists. Kate starts to ponder all of her life with Geoff, even begins \"to smell Katya's perfume\" in every room.While Geoff is attending a reunion luncheon at the plant from which he retired, Kate, neglecting their dog's jittery barking at the ladder, climbs up into the attic to see what things her husband may be keeping there. She finds Geoff's scrapbook filled with memorabilia from his life with Katya, including pressed flowers from their last hike. And then she finds a carousel slide projector, loaded with images of Switzerland and Katya, next to a makeshift screen to view them. One slide shows Katya with her hand on top of her protruding abdomen, indicating Katya was pregnant at the time of her death.Kate takes up smoking again, too, and confronts Geoff about his feelings for Katya without revealing what she saw in the attic. Geoff promises that their marriage will \"start again,\" which he begins by bringing her tea to bed and making breakfast for her the next morning.They attend their anniversary party in the historical Grand Hall. Kate is constrained, distracted, and remains impassive during Geoff's speech in which he professes his love for Kate, while saying \"the choices we make in our youth are most important\" and bringing himself to tears, just as Kate's friend Lena has predicted men always do at weddings and anniversaries. Geoff and Kate dance, but she moves rigidly in his embrace. As the dance ends, Geoff raises their hands together in the air. Kate yanks her arm down after a few seconds, and the final close-up isolates her amid the crush of people on the dance floor and a multitude of emotions play across her face.","language":"English","box_office":"$13.9 million[2]","cinematography":"Lol Crawley","production_company":"The Bureau","directed_by":"Andrew Haigh","release_dates":"6 February 2015 (2015-02-06) (Berlin)|28 August 2015 (2015-08-28) (UK)||||","produced_by":"Tristan Goligher","starring":"Charlotte Rampling|Tom Courtenay|","running_time":"95 minutes[1]","edited_by":"Jonathan Alberts"}