{"country":"United States","distributed_by":"United Artists","Plot":"In 1699, pirate William Kidd (Charles Laughton) loots and destroys the London galleon The Twelve Apostles. He and three confederates bury the stolen treasure on a remote island. He presents himself at the court of King William III (Henry Daniell) as an honest shipmaster seeking a royal commission as a privateer after striking his colors to a pirate. The king is persuaded that the captain of The Twelves Apostles is a pirate who has disappeared with its treasure and grants the commission. Kidd recruits a crew from condemned pirates in Newgate and Marshalsea prisons, promising them a royal pardon at the end of their voyage. Among them is the quarrelsome though cultured Adam Mercy (Randolph Scott), whom Kidd makes his new master gunner because of his claimed prior service with pirate Captain Avery.The King sends Kidd and his ship the Adventure Galley to the waters near Madagascar (where The Twelve Apostles met its fate) to rendezvous with the ship Quedagh Merchant and provide an escort back to England. The Quedagh Merchant carries Lord Fallsworth (an uncredited Lumsden Hare), the King's ambassador to the Grand Mughal, his daughter Lady Anne Dunstan (Barbara Britton), and a chest of treasure - a present from the Indian potentate to King William.Kidd's murderous plan quickly unfolds. His story about a pirate he fought recently in the waters nearby persuades Lord Fallsworth to switch ships with his daughter and the precious cargo. Meanwhile, Kidd's navigator Jose Lorenzo (Gilbert Roland) lights a candle in the ship's magazine. Just as the transfer takes place, the Quedagh Merchant blows up. Kidd also arranges a fatal \"accident\" for Lord Fallsworth, leaving only a frightened Lady Anne. She turns to the only man she thinks she can trust, Shadwell (Reginald Owen), Kidd's servant. When she mentions in passing the recent battle with pirates, the honest Shadwell tells her it never happened. He advises the woman to put her faith in Adam Mercy.On the voyage home, Kidd schemes to rid himself of his three close associates (to avoid sharing the booty) and Mercy, whom he rightly suspects. Mercy is really the vengeance-seeking son of Admiral Lord Blayne, the slandered captain of The Twelve Apostles. When a smitten Lorenzo tries to force himself on Lady Anne, Kidd is delighted when Mercy engages him in a sword fight. Lorenzo is driven overboard to drown. However, during the fight, Mercy's medallion is torn from his neck. Kidd finds it and recognizes the Blayne family crest.Kidd drops anchor at a lagoon. He, Orange Povey (John Carradine), his only surviving confederate (who had the foresight to prepare an incriminating letter to be sent if he should die), and Mercy go ashore and dig up the loot from The Twelve Apostles. When Mercy sees the Blayne crest, a fight breaks out. Outnumbered, Mercy is knocked unconscious, falls into the water, and does not resurface. However, he is not dead. He swims secretly back to the ship. Mercy and a loyal crewman (John Qualen) row Lady Anne away in the ship's jolly boat, but are spotted. Despite Shadwell's heroic, if fatal, attempt to interfere, the boat is blown up.Believing himself safe, Kidd appears before King William with his treasure and claims his reward (Lord Blayne's aristocratic title and estate). However, Mercy and Lady Anne have survived and preceded him to court. The King's men have found the booty looted from The Twelve Apostles after searching Kidd's cabin. Kidd is tried, condemned, and hanged.The film contains much historically incorrect material, including a London scene showing Tower Bridge - two hundred years before it was built. Kidd's London prisoner crew was removed before it sailed from England and Kidd was forced to find a new crew in New York City. Kidd returned to New York, not to London.","language":"English","cinematography":"Archie Stout","production_company":"Benedict Bogeaus Productions Captain Kidd Productions","directed_by":"Rowland V. Lee","Awards":"This film was nominated for an Academy Award for Best Original Score.","release_dates":"November 22, 1945 (1945-11-22) (United States)|||||","captain_kidd":"Movie poster","produced_by":"Benedict Bogeaus","starring":"Charles Laughton Randolph Scott Barbara Britton John Carradine","running_time":"90 minutes","music_by":"Werner Janssen","edited_by":"Charles Odds","written_by":"Robert N. Lee (story) Norman Reilly Raine (writer)"}