{"based_on":"American Sniper  by Chris Kyle Scott McEwen Jim DeFelice","american_sniper":"Theatrical release poster","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Growing up in Texas, Chris Kyle is taught by his father how to shoot a rifle and hunt deer. Years later, Kyle has become a ranch hand and rodeo cowboy, and returns home early, to find his girlfriend in bed with another man. After telling her to leave, he is mulling it over with his brother when he sees news coverage of the 1998 U.S. embassy bombings and decides to enlist in the Navy. He qualifies for special training and becomes a U.S. Navy SEALs sniper.Kyle meets Taya Renae at a bar, and the two soon marry. He is sent to Iraq after the September 11 attacks. His first kills are a woman and boy who attacked U.S. Marines with a Russian made RKG-3 anti-tank grenade. Chris is visibly upset by the experience but later earns the nickname \"Legend\" for his many kills. Assigned to hunt for the al-Qaeda leader Abu Musab al-Zarqawi, Chris interrogates a family whose father offers to lead the SEALs to \"The Butcher\", al-Zarqawi's second-in-command. The plan goes awry when The Butcher captures the father and his son, killing them while Chris is pinned down by a sniper using a Romanian PSL sniper rifle. This sniper goes by the name Mustafa and is an Olympic Games medalist from Syria. Meanwhile, the insurgents issue a bounty on Chris.Kyle returns home to his wife and the birth of his son. He is distracted by memories of his war experiences and by Taya’s concern for them as a couple; she wishes he would focus on his home and family.Kyle leaves for a second tour and is promoted to Chief Petty Officer. Involved in a shootout with The Butcher, he helps in killing him. When he returns home to a newborn daughter, Chris becomes increasingly distant from his family. On Chris' third tour, Mustafa seriously injures a unit member, Ryan \"Biggles\" Job, and the unit is evacuated back to base. When they decide to return to the field and continue the mission, another SEAL, Marc Lee, is killed by gunfire.Guilt compels Kyle to undertake a fourth tour, and Taya tells him that she may not be there when he returns. Back in Iraq, Chris is assigned to kill Mustafa, who has been sniping U.S. Army combat engineers building a barricade. Chris' sniper team is placed on a rooftop inside enemy territory. Chris spots Mustafa and takes him out with a risky long distance shot at 2100 yards (1920 meters), but this exposes his team's position to numerous armed insurgents. In the midst of the firefight, and low on ammunition, Chris tearfully calls Taya and tells her he is ready to come home. A sandstorm provides cover for a chaotic escape in which Chris is injured and almost left behind.After Kyle gets back, on edge and unable to adjust fully to civilian life, he is asked by a Veterans Affairs psychiatrist if he is haunted by all the things he did in war. When he replies that it is “all the guys [he] couldn't save\" that haunt him, the psychiatrist encourages him to help severely wounded veterans in the VA hospital. After that Kyle gradually begins to adjust to home life.Years later, on February 2, 2013, Kyle says goodbye to his wife and family as he leaves in good spirits to spend time with a veteran at a shooting range. An on-screen subtitle reveals: \"Chris Kyle was killed that day by a veteran he was trying to help\", followed by archive footage of crowds standing along the highway for his funeral procession.[10] More are shown attending his memorial service.","Accolades":"","language":"English","Reception":"American Sniper grossed $350.1 million in North America and $197 million in other territories for a worldwide total of $547.1 million, against a budget of around $58 million.[3] Calculating in all expenses and revenues, Deadline.com estimated that the film made a profit of $243 million, making it the second most profitable film of 2014 only behind Paramount's Transformers: Age of Extinction.[43] Worldwide, it is the highest-grossing war film of all time (breaking Saving Private Ryan's record)[44] and Eastwood's highest-grossing film to date. It is the seventh R-rated film to gross over $500 million.[45]In North America, it is the highest-grossing film of 2014,[46] the highest-grossing war film unadjusted for inflation and on an adjusted basis it stands second to Saving Private Ryan with $379 million,[47] the third highest-grossing R-rated film of all time (behind The Passion of the Christ and Deadpool),[48] Warner Bros' fourth highest-grossing film (behind The Dark Knight, The Dark Knight Rises and Harry Potter and the Deathly Hallows – Part 2),[49] and the eighth highest-grossing Best Picture nominee film (behind Avatar, Titanic, Star Wars, E.T. the Extra-Terrestrial, Toy Story 3, The Lord of the Rings: The Return of the King and The Lord of the Rings: The Two Towers).[50] It became the seventh Warner Bros' film to earn over $300 million in the U.S. and Canada and the 50th film to reach the mark.[51] It earned as much as the combined earnings of all of the other 2014 Best Picture nominees.[52] On March 8, 2015, it surpassed The Hunger Games: Mockingjay – Part 1 to become the highest-grossing film of 2014,[50] making it the first R-rated film since Saving Private Ryan (1998) and the first non-franchise film since The Grinch (2000) to top the year-end rankings.[50]American Sniper premiered at the AFI Fest on November 11, 2014, just after a screening of Selma at Grauman's Egyptian Theatre in Los Angeles.[53] In North America, the film opened to a limited release on December 25, 2014, playing at four theaters — two in New York, one in Los Angeles, and one in Dallas — and earned $610,000 in its opening weekend ($850,000 including Christmas Day) at an average of $152,500 per venue debuting at #22.[54][55] The following week the film earned $676,909 playing at the same number of locations at an average of $169,277 per theater, which is the second-biggest weekend average ever for a live-action movie (previously held by 2001's Moulin Rouge!).[56] American Sniper holds the record for the most entries in the top 20 Top Weekend Theater Averages with 3 entries. It earned a total of $3.4 million from limited release in three weekends.[57]The film began its wide debut across North American theaters on January 16, 2015 (Thursday night showings began at 7:00 pm).[58] It set an all-time highest Thursday night opening record for an R-rated drama with $5.3 million (previously held by Lone Survivor).[59][60][61] The film topped the box office on its opening day grossing $30.5 million (including Thursday previews) from 3,555 theaters setting January records for both biggest debut opening (previously held by Cloverfield) and single-day gross (previously held by Avatar).[62][63][64] In its traditional three-day opening the film earned $89.2 million which was double than expected and broke the record for the largest January opening (previously held by Ride Along)[65] and the largest winter opening,[66] which is also Eastwood's top opening as a director (breaking Gran Torino's opening).[67] The three-day opening is also the biggest opening weekend for a drama film (previously held by The Passion of the Christ),[68] the second biggest debut for a Best Picture Oscar nominee (behind Toy Story 3),[69] the second biggest debut for an R-rated film (behind The Matrix Reloaded), and the third biggest for a non-comic book, non-fantasy/sci-fi film (behind Furious 7 and Fast and Furious 6.[69][70] It also set an IMAX January opening and single weekend record with $10.6 million (previously held by Avatar in its fourth weekend) and an R-rated IMAX debut record (previously held by Prometheus).[71] It earned $107.2 million during its four-day Martin Luther King weekend setting a record for the biggest R-rated four-day gross.[72]In its second weekend, the film expanded to 3,705 theaters making it the second widest launch for an R-rated movie (behind the film itself).[73][74] It grossed an estimated $64.6 million in its second weekend, declining only by 28%—and set the record for the second-best hold ever for a movie opening to more than $85 million and also set the record for the eight largest second-weekend gross.[75][76] In just 10 days of release, the film surpassed Pearl Harbor ($198.5 million) to become the second highest-grossing war film in North America.[77] By its second weekend, Box Office Mojo had already reported that the film was on poise to become the highest-grossing film of 2014 in North America, a record that was, at the time held by The Hunger Games: Mockingjay – Part 1 ($334 million), judging from its gradual decline and strong holdovers.[78] It became the highest-grossing IMAX film of January grossing $18.8 million from 333 IMAX theaters.[79] On Thursday, January 29, 2015 – 35 days after its initial release, the film surpassed Saving Private Ryan ($216.5 million) to become the highest-grossing war film in North America, unadjusted for inflation.[80]By its third weekend of wide release, the film expanded to 3,885 theaters (180 additional theaters added), breaking its own record of being the widest R-rated film ever released.[81][82] The film topped the box office through its third weekend earning $30.66 million, which is the second highest Super Bowl weekend gross (behind Hannah Montana and Miley Cyrus: Best of Both Worlds Concert).[83] After topping the box office for three consecutive weekends, the film was overtaken by The SpongeBob Movie: Sponge Out of Water in its fourth weekend.[52]The film had the biggest debut weekend for a Clint Eastwood movie ever and went on to become the director's top grossing movie of all time in each of the countries it was released in.[84] It opened in Italy at number two with $7.1 million which is Eastwood's best opening of all time and Warner Bros' second biggest opening for a non-franchise U.S. film there[85] and topped the box office the following weekend.[86] Its other largest openings occurred in France ($6.3 million),[87] where it topped the box office for four consecutive weekends,[88] Australia ($4.3 million, $4.6 million including previews),[89] the UK, Ireland and Malta ($3.8 million),[90] Spain ($3.2 million), Japan ($2.8 million), Mexico ($2.6 million), Brazil ($1.8 million), and South Korea ($1.2 million).[87] In total earnings, its largest market outside of the U.S. are Italy ($23 million) and France ($22.8 million).[91]American Sniper received positive reviews from critics. Rotten Tomatoes gives the film a \"Certified Fresh\" rating of 72%, based on 243 reviews from critics, with an average rating of 6.9/10. The site's consensus states, \"Powered by Clint Eastwood's sure-handed direction and a gripping central performance from Bradley Cooper, American Sniper delivers a tense, vivid tribute to its real-life subject.\"[92] On Metacritic, the film has a score of 72 out of 100, based on reviews from 48 critics, indicating \"generally favorable reviews\".[93] In CinemaScore polls conducted during the opening weekend, cinema audiences gave American Sniper a rare grade of \"A+\" on an A+ to F scale.[94]Todd McCarthy of The Hollywood Reporter wrote: \"A taut, vivid and sad account of the brief life of the most accomplished marksman in American military annals.\"[95] Justin Chang of Variety gave the film a positive review, saying \"...an excellent performance from a bulked-up Bradley Cooper, this harrowing and intimate character study offers fairly blunt insights into the physical and psychological toll exacted on the front lines...\"[96] David Denby of The New Yorker gave the film a positive review, saying \"Both a devastating war movie and a devastating antiwar movie, a subdued celebration of a warrior's skill and a sorrowful lament over his alienation and misery.\"[97] Keith Phipps of The Dissolve wrote that the film, while well-made missed a chance to explore the toll that such service exacts on soldiers.[98] Chris Nashawaty of Entertainment Weekly gave the film a C+, saying \"The film's just a repetition of context-free combat missions and one-dimensional targets.\"[99] Elizabeth Weitzman of New York Daily News gave the film four out of five stars, saying \"The best movies are ever-shifting, intelligent and open-hearted enough to expand alongside an audience. American Sniper [...] is built on this foundation of uncommon compassion.\"[100] Kyle Smith of the New York Post gave the film four out of five stars, saying \"After 40 years of Hollywood counterpropaganda telling us war is necessarily corrupting and malign, [...] American Sniper nobly presents the case for the other side.\"[101]Peter Travers of Rolling Stone gave the film three and a half stars out of four, saying \"Bradley Cooper, as Navy SEAL Chris Kyle, and director Eastwood salute Kyle's patriotism best by not denying its toll. Their targets are clearly in sight, and their aim is true.\"[102] Ignatiy Vishnevetsky of The A.V. Club gave the film a B, saying \"American Sniper is imperfect and at times a little corny, but also ambivalent and complicated in ways that are uniquely Eastwoodian.\"[103] James Berardinelli of ReelViews gave the film three and a half stars out of four, saying \"American Sniper lifts director Clint Eastwood out of the doldrums that have plagued his last few films.\"[104] Rafer Guzman of Newsday gave the film three out of four stars, saying \"Cooper nails the role of an American killing machine in Clint Eastwood's clear-eyed look at the Iraq War.\"[105] Kenneth Turan of the Los Angeles Times gave the film a positive review, saying \"Eastwood's impeccably crafted action sequences so catch us up in the chaos of combat we are almost not aware that we're watching a film at all.\"[106] Claudia Puig of USA Today gave the film three out of four stars, saying \"It's clearly Cooper's show. Substantially bulked up and affecting a believable Texas drawl, Cooper embodies Kyle's confidence, intensity and vulnerability.\"[107] Joshua Rothkopf of Time Out New York gave the film four out of five stars, saying \"Only Clint Eastwood could make a movie about an Iraq War veteran and infuse it with doubts, mission anxiety and ruination.\"[108] Dean Obeidallah praised the film, saying \"His focus was not on whom we were fighting, but the unbearably high price Americans pay for waging war regardless of its target. The film is a cautionary tale for Americans about why we must avoid war. It is not a celebration of waging it.\"[109]The film drew some negative reviews. Matt Taibbi, of Rolling Stone, wrote that the movie turned the complicated moral questions and mass-bloodshed of the Iraq war into a black and white fairy tale, without presenting the historical context.[110] John Wight writing for RT (formerly Russia Today) asserted that American Sniper depicted the Iraqi people as a dehumanized mass of savages, which the white man was in the process of civilizing.[111] Alex von Tunzelmann of The Guardian argued that the film presented a simplified black and white portrayal of the Iraq war, and that it features the distortion of facts into unreliable myths based upon previous legends.[112] David Masciotra of Salon criticized the movie's focus on physical rather than moral courage as the ultimate manly virtue.[113] Cavalry Scout Sniper Garett Reppenhagen stated that he did not view Iraqi civilians as savages, but as part of a friendly culture for which the movie has furthered ignorance, fear, and bigotry.[114] Cinematographer Paul Edwards wrote in CounterPunch that he believes the film to be dangerous due to mutilating the classic hero's journey into a simplistic, brutal, and sadistic destruction of \"evildoers\".[115] Inkoo Kang of The Wrap gave the film a negative review, saying \"Director Clint Eastwood‘s focus on Kyle is so tight that no other character, including wife Taya (Sienna Miller), comes through as a person, and the scope so narrow that the film engages only superficially with the many moral issues surrounding the Iraq War.\"[116] Several other articles have also been critical of the movie.[117][118][119][120][121]Responding to critics, Eastwood said that American Sniper shows \"what it (war) does to the people left behind\",[122] and that presenting \"the fact of what [war] does to the family and the people who have to go back into civilian life like Chris Kyle did\" is the \"biggest antiwar statement any film\" can make.[123] He stated: \"One of my favorite war movies that I've been involved with is Letters from Iwo Jima and that was about family, about being taken away from life, being sent someplace. In World War II, everybody just sort of went home and got over it. Now there is some effort to help people through it.\"[123] He also said: \"I was a child growing up during World War II. That was supposed to be the one to end all wars. And four years later, I was standing at the draft board being drafted during the Korean conflict, and then after that there was Vietnam, and it goes on and on forever ... I just wonder ... does this ever stop? And no, it doesn't. So each time we get in these conflicts, it deserves a lot of thought before we go wading in or wading out. Going in or coming out. It needs a better thought process, I think.\"[124]Bradley Cooper stated that much of the criticism ignores that the film was about widespread neglect of returning veterans, and that people who take issue with Kyle should redirect their attention to the leaders who put troops there in the first place. He said: \"We looked at hopefully igniting attention about the lack of care that goes to vets. Discussion that has nothing to do with vets or what we did or did not do, every conversation in those terms is moving farther and farther from what our soldiers go through, and the fact that 22 veterans commit suicide each day.\" Cooper said that an increasing number of soldiers are returning from conflict psychologically damaged, only to be more or less discarded.[125]First Lady Michelle Obama and former Republican Party vice presidential nominee Sarah Palin also spoke out in support of the movie.[126][127][128]Several major news sources commented on the accuracy of the film and how it differs from Chris Kyle's written accounts. The enemy sniper Mustafa is a major character in the film but receives only a small mention in the memoir; Kyle noted: \"I never saw him, but other snipers later killed an Iraqi sniper we think was him.\"[129][130] According to the memoir, Kyle's 2100-yard shot was taken against an insurgent holding a rocket launcher, not Mustafa.[130][131] TIME notes that according to screenwriter Jason Hall, Kyle said of Mustafa: \"He shot my friend. I'm not going to put his name in my book.\" [132] The first combat scene in the film has Kyle killing a boy and mother who try to attack U.S. troops with a grenade; the boy was added for the film.[129][130][132] The film depicts Ryan \"Biggles\" Job as dying shortly after he is shot by Mustafa; in reality, Job survived for several years after the incident but died after surgical complications from an operation on his face.[130][131] The character \"the Butcher\" was created for the film,[129][132] although this character may have been based on the real-life Abu Deraa.[129]One aspect of the film that received negative comment was its use of a fake baby doll in one scene, which was so obviously artificial that it became a distraction.[133] In at least one media screening of the film, the audience laughed out loud at how artificial the doll appeared.[134] When discussing the film's prospects for winning an Academy Award, Fandango critic Dave Karger said, \"The reason why American Sniper is not going to win is because of the plastic baby.\"[135] In The Telegraph, journalist Mark Harris said, \"That plastic baby is going to be rationalised by Eastwood auteur cultists until the end of days.\"[136] In response, screenwriter Jason Hall replied, \"Hate to ruin the fun but real baby #1 showed up with a fever. Real baby #2 was no show. [Clint voice] 'Gimme the doll, kid.'\"[136][137]American Sniper was listed on many critics' top ten lists.[138]American Sniper was released on Blu-ray and DVD on May 19, 2015.[139]Upon its first week of release on home media in the U.S., the film topped both the Nielsen VideoScan First Alert chart, which tracks overall disc sales, as well as the Blu-ray Disc sales chart in the week ending May 24, 2015.[140]","box_office":"$547.4 million[3]","cinematography":"Tom Stern","production_company":"Village Roadshow Pictures Mad Chance Productions 22nd & Indiana Pictures Malpaso Productions","directed_by":"Clint Eastwood","release_dates":"November 11, 2014 (2014-11-11) (AFI Fest)|December 25, 2014 (2014-12-25) (United States)||||","Production":"On May 24, 2012, it was announced that Warner Bros. (WB) had acquired the rights to the book with Bradley Cooper set to produce and star in the screen adaptation.[11] Cooper had thought of Chris Pratt to play Kyle, but WB agreed to buy it only if Cooper would star.[22] In September 2012, David O. Russell said he was interested in directing the film.[23] On February 2, 2013, Chris Kyle was murdered. On May 2, 2013, it was announced that Steven Spielberg would direct.[24] Spielberg had read Kyle's book, though he desired to have a more psychological conflict present in the screenplay so an \"enemy sniper\" character can serve as the insurgent sharpshooter who was trying to track down and kill Kyle. Spielberg's ideas contributed to the development of a lengthy screenplay approaching 160 pages. Due to WB's budget constraints, Spielberg felt he could not bring his vision of the story to the screen.[4] On August 5, 2013, Spielberg dropped out of directing.[25] On August 21, 2013, it was reported that Clint Eastwood would instead direct the film.[26]On March 14, 2014, Sienna Miller joined the cast.[12] On March 16, 2014, Kyle Gallner was cast,[18] as was Cory Hardrict on March 18, 2014.[15] On March 20, 2014, Navid Negahban, Eric Close, Eric Ladin, Rey Gallegos, and Jake McDorman also joined the cast,[14][17] as did Luke Grimes and Sam Jaeger on March 25, 2014.[13][19] Kevin Lacz, a former Navy SEAL, was also cast and served as a technical advisor.[16] Another former Navy SEAL, Joel Lambert, also joined the film, portraying a Delta sniper.[27] On June 3, Max Charles was added to the cast to portray Kyle's son, Colton Kyle.[21]Principal photography began on March 31, 2014 in Los Angeles;[28] it was also shot in Morocco.[29] On April 23, the Los Angeles Times reported that ten days of filming set in an Afghan village was set to begin at the Blue Cloud Movie Ranch in the Santa Clarita area.[30] On May 7, shooting of the film was spotted around El Centro; a milk factory was used as the abandoned date factory which insurgents close in on from all directions at the climax of the film.[31][32] Later on May 14, Cooper was spotted filming some scenes in Culver City, California,[33] and then he followed by shooting scenes again in Los Angeles on May 16.[34] On May 30, Cooper and Miller were spotted during the filming of their characters' wedding scenes; they were filming aboard a yacht in Marina del Rey.[35] On June 3, Cooper was spotted in the uniform of a Navy SEAL marksman aiming during the filming of some scenes at a Los Angeles shooting range.[36] The pier and bar scenes were filmed in Seal Beach, California.[37]Cinematographer Tom Stern shot the film with Arri Alexa XT digital cameras and Panavision C-, E- and G-Series anamorphic lenses.[38] The film is Eastwood's second to be shot digitally, after Jersey Boys.[39]There is no \"Music by\" credit on this film. Clint Eastwood, who has composed the scores for most of his films since Mystic River (2003), is credited as the composer of \"Taya's Theme\". Joseph S. DeBeasi is credited as composer of additional music and as music editor.[40][41] The film also features the song \"Someone Like You\" by Van Morrison, which plays during the wedding scene, and \"The Funeral\" by Ennio Morricone.[42]","produced_by":"Clint Eastwood|Robert Lorenz|Andrew Lazar|Bradley Cooper|Peter Morgan|","starring":"Bradley Cooper|Sienna Miller|","running_time":"132 minutes[1][2]","edited_by":"Joel Cox|Gary D. Roach|","written_by":"Jason Hall","budget":"$58.8 million[3][4][5]"}