{"Cast":"This was the first credited feature film role for Daly, Barkin and Reiser.","Adaptations":"The film inspired a 1983 CBS television pilot written and directed by Levinson. Mike Binder starred as Eddie, Paul Reiser returned as Modell, Michael Madsen took over as Boogie and James Spader was Fenwick.A stage musical, with the book by Levinson and music by Sheryl Crow is being prepared, with plans for a Broadway production, originally opening in Autumn 2013. Kathleen Marshall is the director and choreographer. A \"creative workshop\" reading was held in December 2011, directed by Kathleen Marshall. A previously announced premiere at the Curran Theatre in San Francisco in October 2012 to November 2012 was cancelled. Instead, the musical had a staged workshop in New York and then was expected to open on Broadway in April 2013 (since postponed). The producer said, \"the producers and creative team of 'Diner' embarked on an exploratory exercise to determine if the show would play as effectively in a theatre with a capacity no larger than 1,100 seats, for which there is greater opportunity. Holding themselves to uncompromising standards they happily discovered that their answer was 'yes'.\"[2][3][4][5][6]The musical opened at the Signature Theatre, Arlington, Virginia, in December 2014 through January 2015, with direction and choreography by Kathleen Marshall.[7] Crow said: \"And to think we are going to premiere it so close to Baltimore, where the story took place, at Signature Theatre, which has birthed so many new musicals, well, I couldn't be happier.\"[8] The cast for the Signature premiere included Matthew James Thomas as Fenwick and Derek Klena as Boogie.[9] The musical next is being presented at the Delaware Theatre Company, Wilmington, Delaware, from December 2, 2015 (previews) through December 27, with Matthew James Thomas as Fenwick, Derek Klena as Boogie, Noah Weisberg as Shrevie and Brynn O’Malley as Barbara.[10][11][12]","country":"United States","distributed_by":"MGM/UA Entertainment Co.","diner":"theatrical release poster","Plot":"Set in the northwest section of Baltimore, Maryland in the last week of 1959, Diner tells the story of a circle of male friends, now in their early twenties, who reunite for the wedding of one of their group. The title refers to the Hilltop Diner, located at Reisterstown Road and Rogers Avenue, Baltimore, their late-night hangout. However, the Hilltop had been converted into a liquor store so the location in the film is in the Canton section of Baltimore. An element of the story includes the Baltimore Colts winning the 1959 NFL Championship Game.The semi-autobiographical film explores the changing relationships among these friends as they become adults through what is mostly a series of vignettes rather than a traditional narrative. Levinson encouraged improvisation among his cast to capture realistic camaraderie.","language":"English","Reception":"The film received positive reviews and currently has a 91% \"Fresh\" rating on review aggregate website Rotten Tomatoes based on 34 reviews.[13] It is ranked #57 on the American Film Institute's 100 Years, 100 Laughs list. Levinson also received an Academy Award nomination for Best Original Screenplay.","box_office":"$14,099,953 (United States)[1]","cinematography":"Peter Sova","production_company":"Metro-Goldwyn-Mayer","directed_by":"Barry Levinson","References":"Notes","release_dates":"March 5, 1982 (1982-03-05) (US)|||||","produced_by":"Jerry Weintraub","starring":"Steve Guttenberg|Daniel Stern|Mickey Rourke|Kevin Bacon|Timothy Daly|Ellen Barkin|","running_time":"110 minutes","music_by":"Bruce Brody Ivan Kral","edited_by":"Stu Linder","written_by":"Barry Levinson","budget":"$5 million"}