{"based_on":"Dark Places  by Gillian Flynn","country":"France|United Kingdom|United States|","distributed_by":"Mars Distribution (France)|Entertainment One (UK)|A24 (US)|","screenplay_by":"Gilles Paquet-Brenner","language":"English","box_office":"$3.5 million[2]","cinematography":"Barry Ackroyd","directed_by":"Gilles Paquet-Brenner","production_companies":"Exclusive Media Group Mandalay Pictures Denver and Delilah Productions","release_dates":"April 8, 2015 (2015-04-08) (France)|August 7, 2015 (2015-08-07) (United States)||||","Production":"Principal photography commenced in late August 2013 in Shreveport and Minden, Louisiana.[11][12]The National Enquirer reported that Theron suffered nightmares while playing her role in this film.[13]","produced_by":"Stéphane Marsil|Azim Bolkiah|Matthew Rhodes|Cathy Schulman|Charlize Theron|","starring":"Charlize Theron|Nicholas Hoult|Christina Hendricks|Chloë Grace Moretz|Tye Sheridan|Sterling Jerins|Corey Stoll|","running_time":"112 minutes[1]","Summary":"Set in a farming town in Kansas, Dark Places follows Libby Day, the only surviving witness of a horrific massacre that took the lives of her mother and sisters. Believing the slaughter to be the work of a Satanic cult, Libby testifies in court against her own brother. Thirty years after the murder, she remains haunted by the gruesome violence of her past when she meets a group of amateur investigators who call themselves \"The Kill Club\". Looking to satisfy their morbid curiosity, the group begins its own inquiry about the case, believing that Libby's brother might be innocent. To help them, Libby must unearth painful memories of the event and learn that her past may not be what it seems.","dark_places":"International release poster","music_by":"BT|Gregory Tripi|","edited_by":"Douglas Crise|Billy Fox|","Release":"Dark Places was released in France on April 8, 2015.[3] In November 2014, it was announced A24 Films and DirecTV Cinema had acquired rights to the film.[14] The film began airing on DirecTV Cinema on June 18, 2015,[15] and was released in limited release and through video on demand on August 7, 2015.[16]The film received mixed to negative reviews from critics. On review aggregator website Rotten Tomatoes, the film has a 26% approval rating based on 58 reviews, with an average rating of 4.8/10.[17] Metacritic, which uses a weighted average, assigns a score of 39 out of 100, based on 19 critics, indicating \"generally unfavorable reviews\".[18]The film grossed a meager total of $208,588 in the United States from 151 venues over the course of two weeks. Overseas, the film earned $3,304,354 for a worldwide total of $3,512,942.[2]"}