{"based_on":"Drums Along the Mohawk 1939 novel  by Walter D. Edmonds","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Sonya Levien Lamar Trotti","Plot":"In colonial America, Lana Borst (Claudette Colbert), the eldest daughter of a wealthy Albany, New York family, marries Gilbert Martin (Henry Fonda). Together they leave her family's luxurious home to embark on a frontier life on Gil's small farm in Deerfield, in the Mohawk Valley of central New York. The time is July, 1776, and the spirit of revolution is in the air. The valley's settlers have formed a local militia in anticipation of an imminent war, and Gil joins up.As Gil and his neighbors are clearing his land for farming, Blue Back (Chief John Big Tree), a friendly Oneida man, arrives to warn them that a raiding party of Seneca led by a Tory named Caldwell (John Carradine) is in the valley. The settlers evacuate their farms and take refuge in nearby Fort Schuyler. Lana, who is pregnant, miscarries during the frantic ride to the fort. The Martin farm is destroyed by the Seneca raiding party. With no home and winter approaching, the Martins accept work on the farm of a wealthy widow, Mrs. McKlennar (Edna May Oliver).During a peaceful interlude, Mrs. McKlennar and the Martins prosper. Then, word comes that a large force of British soldiers and Indians is approaching the valley. The militia sets out westward to intercept the attackers; but their approach is badly timed and the party is ambushed. Though the enemy is eventually defeated at Oriskany, more than half of the militiamen are killed. Gil returns home, wounded and delirious, but slowly recovers. Lana is again pregnant and delivers a son in May. That summer Indian and Tory raiding parties burn and pillage farms and small settlements. The harvest is small, and while Mrs. McKlennar’s stone house is not burned, there is barely enough food to survive the winter. Lana bears her second child, another son, the following August. The raids continue but the crops fare much better, so there is plenty to eat that winter, although the cold is severe.After the spring thaw, the British and their Indian allies mount a major attack to take the valley, and the settlers again take refuge in the fort. Mrs. McKlennar is mortally wounded and ammunition runs short. Gil makes a heroic dash through enemy lines to secure help from nearby Fort Dayton. Reinforcements arrive just in time to beat back the attackers, who are about to overwhelm the fort. The militia pursues, harasses, and defeats the British force, scattering its surviving soldiers in the wilderness. The Mohawk Valley is saved.Three years later, with the war over, Gil and Lana return to their farm at Deerfield. They have a third child (a baby girl), and they look forward to a happy and peaceful life in the valley as citizens of the new, independent United States of America.","drums_along_the_mohawk":"DVD release cover","language":"English","Critical reception":"Frank S. Nugent reviewed the film for the New York Times of November 4, 1939 and wrote, \"Walter D. Edmonds's exciting novel of the Mohawk Valley during the American Revolution has come to the...screen in a considerably elided, but still basically faithful, film edition bearing the trademark of Director John Ford...It is romantic enough for any adventure-story lover. It has its humor, its sentiment, its full complement of blood and thunder...a first-rate historical film, as rich atmospherically as it is in action...Mr. Fonda and Miss Colbert have done rather nicely with the Gil and Lana Martin...Miss Oliver could not have been bettered as the warlike Widow McKlennar...Mr. Shields's Rev. Rosenkrantz...Mr. Imhof's General Herkimer, Mr. Collins's Christian Reall, Spencer Charters's landlord, Ward Bond's Adam Helmer...They've matched the background excellently, all of them.\"[7]","Historical accuracy":"Like most of John Ford's films, Drums Along the Mohawk is loosely based on historical events. A central event of the plot is the Battle of Oriskany, a pivotal engagement of the Saratoga campaign in the American Revolutionary War, in which a British contingent moved southward from Canada in an attempt to occupy the Hudson Valley and separate New England (Connecticut, Rhode Island, New Hampshire and Massachusetts) from the remaining colonies.[2] A smaller force invaded the Mohawk Valley as a diversion, but the siege of Fort Schuyler depicted in the film had no direct historical counterpart. The actual fort besieged in the battle — Fort Stanwix — was located far from any civilian settlements and was attacked by British and Hessian soldiers, not Indians, and defended by Continental Army soldiers, not militiamen.[3] The raids on settlements in the valley likewise lacked a historical basis; but \"a key element of frontier life for Hollywood is Indian raids\", and Ford felt obliged to include several of them.[4]The film portrays only Indians and \"Tories\" as antagonists; British military personnel are barely referenced or seen. While local Iroquois tribes did fight on the loyalist side in the Mohawk Valley,[5] Indians were a minor factor compared to the British Army. Ford chose to minimize the British role in view of the international situation in 1939: \"He knew that war with Germany was coming, and he had little desire to show the British as villains when they were fighting for their lives against the Nazis.\"[6]","cinematography":"Bert Glennon Ray Rennahan","directed_by":"John Ford","Academy Award nominations":"The film was nominated for two awards: Best Supporting Actress (Edna May Oliver) and Best Cinematography (Ray Rennahan and Bert Glennon).","release_dates":"November 3, 1939 (1939-11-03)|||||","produced_by":"Darryl F. Zanuck (executive producer)","starring":"Claudette Colbert Henry Fonda Edna May Oliver John Carradine Ward Bond","running_time":"103 minutes","music_by":"Alfred Newman","edited_by":"Robert L. Simpson","budget":"over $2 million[1]"}