{"based_on":"Are You Being Served?[1]","Cast":"The senior sales assistant on the men's counter, expansive of personality and sexually ambivalent.The head of the ladies department, and the film's main female protagonist. She maintains an exaggeratedly dignified demeanour, but can easily become pugnacious in a crisis.The icy floorwalker at Grace Brothers. He fancies himself a ladies' man, and frequently makes himself ridiculous in his attempts to be seductive.The disorganized junior of the men's department, quietly looked down upon by the other staff members. He has a seemingly insatiable tendency to make fun of his co-workers, and irritates Mrs. Slocombe especially.The Cockney junior of the ladies' department and Mrs. Slocombe's friend. She is the most sensible person in her workspace, a fact of which she is irritably aware.The head of the men's department and the oldest member of the staff. He has a kind heart, but tends to be cranky, forgetful, and perpetually ready to fall asleep.The officious manager of the floor. He is constantly mocked because of his bald head and big ears.The ancient and quietly debauched head of Grace Brothers department store.The head of the packing department. Coarse of personality, he is clever enough to secure better treatment for himself than any of his nominal superiors.A young waitress who works at the hotel. Lusted after by several of the characters, she is smitten with Mr. Humphries (whom she makes intensely uncomfortable).A terrorist with a crush on Mrs. Slocombe.The moderately dishonest hotel manager, and Cesar's unwilling accomplice.","country":"United Kingdom[1]","distributed_by":"EMI[1]","screenplay_by":"David Croft|Jeremy Lloyd[1]|","Plot":"As Grace Brothers is being redecorated, the management sends the staff on a paid holiday on the tropical island of Costa Plonka, just off the coast of Spain. Their hotel and its surroundings prove to be dismal, and the group tries to pass the time by acting on the crushes they have developed for one another in the workplace. After the eventful plane flight, the staff arrive at the hotel; they are greeted by the hotel manager Carlos who says that no rooms are available until the day afterwards, but luxury penthouses are available for the night, so the staff decide to sleep in the penthouses. It turns out that Carlos's English isn't too good and gets his \"T\"s and \"P\"s muddled up, so he actually meant \"Tenthouses.\" After a dinner of love note misunderstandings the staff all need the loo after Carlos pouring the tropical drinks into the glasses with a small jug. Meanwhile, Carlos receives an unwelcome visit from an old acquaintance named Cesar who is after Mrs. Slocombe after seeing her (doctored) passport. He is also plotting a revolutionary uprising and wants to use the hotel as his base. The staff then decide to turn in for the night, but a night of tent swapping disturbs everyone. As Cesar is still after Mrs Slocombe, he goes into her tent to find Mr Humphries instead! After waking up the next morning, the Grace Brothers staff get a nasty ending to their holiday, narrowly surviving a gunfight between the revolutionaries and federal troops. During the gunfight, the staff lock Cesar in a bathroom stall and sends it floating up in the sky with a parachute. They are inadvertently saved by a group of tanks that arrive on the scene; these prove to have been commandeered by Young Mr. Grace, who wanted to visit his beleaguered underlings, but could not find a taxi.","are_you_being_served?":"Are You Being Served? British quad poster","language":"English","Reception":"Both initial and retrospective reviews of the film have been universally negative. In a contemporary review, John Pym of the Monthly Film Bulletin gave the film a negative review, stating that \"The humour consists mainly of withering selection of patent British puns; an inflatable brassiere, some let's-insult-the-Germans jokes and a rickey thunder-box which bolts from the outside are thrown in for good measure.\"[1]In a retrospective review, DVD Verdict's Michael Stailey as a film that is \"guilty of violating almost every law of comedy and film.\"[2] The film is widely considered to be lacking in originality, plot, and focus. At present, the film holds a 58% positive rating on Rotten Tomatoes; the cutoff for a positive rating is 59%.[3]","cinematography":"Jack Atcheler[1]","directed_by":"Bob Kellett","production_companies":"Anglo-EMI[1]","produced_by":"Andrew Mitchell[1]","starring":"John Inman|Mollie Sugden|Frank Thornton|Trevor Bannister|","running_time":"95 minutes[1]","music_by":"Ronnie Hazlehurst","edited_by":"Al Gell[1]"}