{"country":"United Kingdom","distributed_by":"Momentum Pictures","Plot":"Colin Diamond (Ray Winstone) is a successful car salesman who after a discovering his wife Liz is having an affair, has an emotional breakdown. His friends convince him to kidnap his wife's lover and then encourage him to torture and kill him.Diamond's partners in crime are suave homosexual gambler Meredith (Ian McShane), crotchety and bigoted Old Man Peanut (John Hurt), the down to earth Archie (Tom Wilkinson) and the combustible Mal (Stephen Dillane), who by turns encourage Colin's lust for revenge and sympathise with his situation, and conspire to emotionally and mentally torture Liz's new boyfriend, Loverboy, a \"Frog\" waiter, first by locking him in a cupboard and threatening him, and tying him up and subjecting him to humiliating verbal and physical assault.Parts of the story occur in flashback, with Colin discovering Liz's infidelity and the after effects of it, which then affect the present, in which he tries to come to terms with the shame and torment that this brings to him. Parts of the story also appear to happen inside Colin's mind, with him trying to reconcile with himself, using his friends as representations of his own turmoil, and his resolving of the situation.","language":"English","Reception":"44 Inch Chest has received mixed to negative reviews. Review aggregate Rotten Tomatoes reports that 41% of critics have given the film a positive review based on 78 reviews, with an average score of 5.2/10.[2] The Daily Telegraph gave the film 3/5 stars, calling the film \"A plum actors' piece which both gains and loses points by soberly stalling its own plot.\"[3] Peter Bradshaw of The Guardian was less enthusiastic, giving the film 2/5 saying \"The film talks the talk – in fact, it talks and talks and talks the talk. But the walk isn't happening.\"[4]","box_office":"$247,553","cinematography":"Daniel Landin","production_company":"Anonymous Content","directed_by":"Malcolm Venville","Home media":"On 10 May 2010, DVD was released in Region 2 in the United Kingdom, it was distributed by Momentum Pictures.","release_dates":"19 October 2009 (2009-10-19) (London Film Festival)|15 January 2010 (2010-01-15) (United Kingdom)||||","Production":"It is set and filmed in Borehamwood, Hertfordshire, and London, England on 26 May and 13 July 2008.","produced_by":"Richard Brown Steve Golin","starring":"Ray Winstone Ian McShane John Hurt Tom Wilkinson Stephen Dillane Joanne Whalley","running_time":"95 minutes","music_by":"Angelo Badalamenti","44_inch_chest":"Theatrical Release Poster","edited_by":"Rick Russell","written_by":"Louis Mellis David Scinto"}