{"country":"France Morocco Germany Palestinian territories","distributed_by":"Avatar Films (USA)","Plot":"In Nazareth, Santa Claus runs away from children as gifts fall from his basket. He's been stabbed and leans against a tree.Neighbors bicker over small stuff.A Palestinian couple meets in a car.More bickering neighbors.A tourist asks an Israeli policeman for directions. Unable to help her himself, the policeman brings out a blindfolded Palestinian prisoner from the back of his van. The Palestinian tells her three different possible routes.The couple is in the car again. The man (E.S.) blows up a red balloon with the face of Yasser Arafat drawn on it. He releases it near an Israeli checkpoint. An Israeli soldier is about to shoot it down but his comrade stops him. In the confusion, the couple are able to drive through the checkpoint together. The balloon floats across Jerusalem, eventually settling against the Dome of the Rock.At night, the couple again in a car.The next morning, five Israeli men practice an elaborate sequence of dance-like moves. Armed with guns, they repeatedly fire at targets painted like a Palestinian woman under the direction of a choreographer-officer. When one of the targets fails to fall to the ground, a real Palestinian woman (dressed like the targets) appears. The officer instructs his men to fire at her. In a supernatural feat, she gathers their bullets in the air around her and rises from the ground. The bullets form a crown of thorns around her head until she lets them fall to the ground. She then uses crescent-adorned stars and rocks to kill all but the officer. A helicopter appears to reinforce the Israelis, which the woman also easily destroys. The dance choreographer watches helplessly and the woman disappear.The film ends with a man and his mother watching their dinner cook in a pressure cooker.","language":"Arabic Hebrew English","directed_by":"Elia Suleiman","Oscar controversy":"Despite being nominated for the \"Palme d'Or\" award at the 2002 Cannes Film Festival, the film's consideration as candidate for Best Foreign Film at the Academy Awards was an occasion for considerable controversy. In late 2002, producer Humbert Balsan authorized the US distributor of the film to release a statement which stated that Balsan had asked the Academy of Motion Picture Arts and Sciences if the film could run for best foreign language picture. According to Balsan, the answer was no, because \"Palestine is not a state we recognize in our rules.\" However, spokesperson John Pavlik states that the Academy had never made a decision on that issue because Suleiman had never submitted his film. Critics like The Electronic Intifada and others, claim that the Academy did make a decision, and that it was based on political considerations.[3]The film was considered for an Oscar the following year; Pavlik told Variety \"The committee decided to treat Palestine as an exception in the same way we treat Hong Kong as an exception. It's always the goal of the foreign-language film award executive committee to be as inclusive as possible.\"[4]","Awards":"The film screened at the 2002 Cannes Film Festival on May 12,[5] was awarded the Jury Prize[6] and the FIPRESCI Prize for \"its sensitive, amusing and innovative vision of a complex and topical situation and the tragic consequences that result from it\".[7]","Music":"Elia Suleiman has used entirely non-original music of various genres and artists in the film. These include artists such as the Belgian singer Natacha Atlas, Indian composer A.R. Rahman, Lebanese electro-pop band Soapkills and Paris-based record producer Mirwais Ahmadzaï.Track listing:","release_dates":"May 19, 2002","produced_by":"Humbert Balsan Elia Suleiman","starring":"Elia Suleiman Manal Khader","running_time":"92 minutes","written_by":"Elia Suleiman"}