{"Tales from the Crypt film series":"This was the second of three planned movies under the HBO Tales from the Crypt banner. The first, Demon Knight, was made in 1995. A third feature, Ritual, was made in 2001, but released as a stand alone film due to the box office failure of Bordello (when Ritual was released on DVD, however, it was distributed as a Tales from the Crypt film). Bordello and Ritual were not part of the original blueprint for the planned trilogy and Demon Knight was originally supposed to be set as the second film. Dead Easy (aka Fat Tuesday), a zombie movie planned as the first film, and Body Count, planned as the third installment, were the original stories to be told. The Key from Demon Knight was supposed to appear in all three films, and did appear in Bordello, but not Ritual.","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"A. L. Katz|Gilbert Adler|","story_by":"Robert Zemeckis|Bob Gale|","Plot":"Vincent (Phil Fondacaro) and his associates explore a forest, until they find a cave containing a coffin with the skeleton of Lilith, mother of all vampires. Vincent takes a box out of his pocket, which contains the four sections of her heart. He puts it in her body, and she rapidly begins reanimating. Revived, she rips the hearts out of the associates and goes after Vincent, who produces the key artifact seen in Demon Knight. Vincent then explains that the artifact from \"Demon Knight\" and the blood within it allows him to have full control over her. Vincent then turns to Lilith and asks her if he allows her to eat the last associate would she then behave. She replies \"Anything for you, lover\".The Crypt Keeper is having lunch with the Mummy (William Sadler), who is boring him about film industry life. The Mummy challenges the Crypt Keeper to a contest of rock, paper, scissors which the Mummy wins, and he slices off the Keeper's hand with a meat cleaver. The Crypt Keeper laughs (as it didn't hurt him at all) and the Mummy gets ready for the next round. The Crypt Keeper addresses the audience, and the movie continues.Catherine Verdoux (Erika Eleniak) lives with her delinquent brother Caleb (Corey Feldman). He goes out one night against her wishes and, while hanging at a bar, is informed of a secret brothel in the guise of a funeral home by an odd man named Jenkins (Kim Kondrashoff). Caleb and his friend Reggie (Matt Hill) go to check it out, where they do indeed find the information true (albeit forced by the mortician McCutcheon (Aubrey Morris). Unknown to them however, it's run by the fully regenerated Lilith (Angie Everhart). All the women there are vampires turned by Lilith, completely evil, lustful and subservient to her. Lilith uses them for both business and to lure food. Reggie is taken by Tallulah (Juliet Reagh) and Caleb is taken by Patrice (Leslie Ann Phillips), each for a private session in which Lilith visits them both as the prostitutes prepare to drain their blood. Reggie is killed when Lilith kisses him and extends her tongue down his throat to push his heart out of his body. She promptly rips it out and eats it afterwards. Lilith then sets her sights on Caleb. As she offers a three-way, the screen fades to black as she growls ominously.A week later, Catherine asks the police to look for Caleb to no avail, so she reluctantly hires Rafe Guttman (Dennis Miller), a cynical and sarcastic P.I. whose office is an old adult movie theater, to look for Caleb. After getting the names of Caleb's friends from Catherine, Rafe tracks Caleb's trail to the bar where he finds them playing pool. One of them directs him to the funeral home. At his first visit (during the day), it appears to be just a funeral home, complete with a funeral in progress. He meets Catherine at her job working for the Reverend J. C. Current (Chris Sarandon) and tells her Caleb went to a whorehouse. She thanks him for his help and dismisses him. He returns to the bar, where he runs into Jenkins, who gives Rafe the same info he told Caleb and his friends, and Rafe revisits the funeral home that night. He is denied access the first time as the brothel is closed for the night, so he sneaks in and discovers that the money and other valuables from the clients visiting the brothel are put towards Current's organization which is being used as a front for their shady dealings. Rafe also passes by Lilith interviewing a woman, Tamara (Kiara Hunter), whom Vincent recommended for a job. At first, Rafe dismisses it as nothing, but as he continues snooping, he hears Tamara scream followed by a body hitting the floor, however he has to leave before he can look into it.On his second visit, Rafe is admitted into the brothel and is given to Tamara, who's now much more seductive then when she was being interviewed, an obvious sign she's been turned. He escapes by strapping her to a torture rack and investigating the funeral home further, finding Mr. Jenkins, a dead servant of Lilith's in the process, before fleeing. However, he drops his wallet while doing so, allowing Lilith to find his address. Having tasted some of Rafe's blood that Tamara managed to scratch off, Lilith takes an interest in Rafe and tries to seduce him, but he is unswayed by her sexual advances. At that moment Catherine comes by to check on his progress. She leaves when she thinks he's flirting but he tells her of the brothel's activity. They tell the police about it, but when they get the police to look over the grounds, all the evidence has been covered up and Rafe is dismissed as a fraud. Meanwhile, Vincent destroys the key so Lilith is now immortal at the cost of no control over her.As Catherine is looking over some footage shot at the strip club where they confronted Lilith, she notices Lilith isn't in the shot. Realizing that Rafe might be right, she calls him over to look over the tape as well. While they are discussing the tape, Caleb calls for help, asking them to meet him at the power plant. When they arrive they find Caleb on the ground. Rafe is wary and goes to check on him first. His instincts prove right as Caleb is now a vampire, having been spared having his heart eaten in exchange for undead servitude to Lilith. Rafe and Catherine try to escape, but Rafe, in trying to swing across a gap, swings too far and out a window, landing on the police chief's car. Catherine, who took a ladder down, is caught by Caleb, Vincent and McCutcheon, and is brought back to the brothel into Lilith's clutches.Rafe awakens in a hospital, but is strapped down to be taken into custody once he's healed. Rafe manages to break free just as Tamara, posing as a nurse, arrives to kill him. However, Rafe succeeds in getting the back of her outfit open and pushing her into a window, where the sunlight causes her to explode. This disturbs his sleeping roommate (Whoopi Goldberg), who tells him to keep the noise down so she can sleep. That night Lilith awakens to feed on Catherine in order to bring her into her undead horde. Catherine pleads for Caleb to help, but he's clearly beyond the point of humanity, and tells his sister that being a vampire \"is pretty damn cool.\"Rafe loads up on Super Soakers filled with holy water and raids the brothel, killing Vincent and McCutcheon. He meets up with Current, who realized his wrongdoing and wishes to make amends after Rafe luckily saved him from Vincent who had turned on him. Current tells Rafe that the holy water won't work on Lilith. Her heart has to be removed from her body and cut into four pieces, as before she was found by Vincent. Rafe gives him a spare water gun and the two enter the brothel, spraying all the vampires, including Patrice and Tallulah, who burn and explode on contact with the water. They split up to find Catherine. Caleb attacks Rafe with an axe, but Rafe sprays a hole straight through Caleb's midsection.Current finds Catherine, but it turns out to be Lilith in disguise. He tries to stab her, but she easily stops his attack, breaks his hand, and kills him with his own knife. Rafe arrives shortly after and manages to cut into Lilith's body with an axe. It does damage, but doesn't kill her. She reattaches her body before fleeing while Rafe finds the real Catherine and they tend to Current, who dies from his wounds.Rafe and Catherine head to the church to reveal the existence of vampires via the church's media equipment. Lilith returns, leaving a bloody trail as she confronts the two. She handcuffs Rafe to a railing before going after Catherine, who's no match for her in human strength. Rafe uses a nearby laser machine (used in Current's sermons to make cross-shaped burns) to aim and hit Lilith in the heart, cutting it into four parts. However, as the heart pieces need to be out of her body, Lilith remains alive. She turns her attention to Rafe, devolving into a hideous form. Just as she's about to kill him, Catherine grabs a candle stand and stabs Lilith's heart out from behind. Lilith's body burns as a result before collapsing to the ground, dead for good.The next day, the two have Lilith's remains burned to prevent her from returning, and lock away the box with the heart pieces in it. When asked why she saved him, Catherine says she had her reasons. As they sit in his car, he begins fondling Catherine, which she oddly seems more accepting of now. He asks \"What's that perfume you're wearing?\" He then pulls back her skirt to find a pair of bite-marks on her thigh, where she was bitten by Lilith. Catherine replies \"It's not perfume. It's sunblock.\" Catherine, dropping all pretense of her former self, then bites into Rafe, showing us that Lilith may be dead but her legacy will continue.The movie then goes back to the Crypt Keeper, where he jokes that if Rafe and Catherine got married, she'd know \"what's eating him... She is!\". He has also apparently bested the Mummy at the game and reduced him to nothing but a head. The Crypt Keeper tells him to \"quit while he's 'a head'\" before laughing, ending the movie.","tales_from_the_crypt_presents:_bordello_of_blood":"Theatrical release poster","Reception":"The film holds a 13% approval rating on Rotten Tomatoes based on 30 reviews, and the average rating is 3.2/10. The consensus states: \"Bordello of Blood is not as scary or funny as it thinks it is (or should've been), and all of Dennis Miller's lines sound like castoffs from his stand-up material\".[2]Writing for The Washington Post, Richard Harrington said, \"Triple the length of its cable television inspiration, Tales From the Crypt Presents Bordello of Blood is triple the gore, triple the naked women, but not, alas, triple the fun.\"[3]","box_office":"$5.8 million (US)[1]","cinematography":"Tom Priestley","directed_by":"Gilbert Adler","Home Media":"The film was released on VHS and DVD in 1997 and 2003 respectively. It was also released as part of a double pack with Demon Knight, the previous Tales from the Crypt film. Home video company Scream Factory, a branch of Shout! Factory that specializes in releasing cult horror and science fiction films on special edition versions of DVD and Blu-ray, released a Blu-ray version of the film on October 20, 2015, alongside another special edition release of Demon Knight.[4]","release_dates":"August 16, 1996 (1996-08-16)|||||","produced_by":"Gilbert Adler","starring":"Dennis Miller|Erika Eleniak|Angie Everhart|Chris Sarandon|Corey Feldman|Aubrey Morris|Phil Fondacaro|Juliet Reagh|Whoopi Goldberg|John Kassir|","running_time":"87 minutes","music_by":"Chris Boardman","edited_by":"Stephen Lovejoy"}