{"country":"United States","belly":"Theatrical release poster","distributed_by":"Artisan Entertainment","Possible sequel":"In 2006, DMX mentioned that a sequel is in the works called Beast. However, a film called Belly 2: Millionaire Boyz Club has already been released, starring rapper The Game. Lion's Gate Entertainment gave the Game's version of the film the \"Belly 2\" prefix, from a marketing standpoint, to attract a broader hip-hop audience, but the films are in no way related.","screenplay_by":"Hype Williams","story_by":"Nas Anthony Bodden Hype Williams","Plot":"The film begins in early 1999, with two young New York street criminals Tommy Bunds (\"Bundy\") (DMX) and Sincere (\"Sin\") (Nas), along with their associates in crime Mark and Black. The four violently rob a nightclub, murdering five people. Escaping in a stolen car, they cheer their success. Black goes to dump the car while the rest retreat to Tommy's house, where they celebrate and joke around (The movie Gummo is playing on the TV), waking Tommy's girlfriend Keisha (Taral Hicks). Sincere soon leaves and is followed in gesture by the others. He returns home to his girlfriend Tionne (Tionne \"T-Boz\" Watkins) and infant daughter Kenya. Meanwhile, Tommy learns of a new form of heroin which he takes as a lucrative business opportunity.The next day, Tommy meets with Sincere to discuss the venture. His rhetoric is met with resistance from the more intellectually inclined Sincere, who has become enlightened to the plight of urban poor and seeks a life free of crime. After Tommy ridicules Sincere for his sentiments and mentions his connection with a Jamaican drug lord \"Ox\" residing in New York City, Sincere reluctantly agrees. Tommy then visits Ox in his lavish mansion, to plead for Ox's assistance in obtaining the heroin. Ox agrees on the grounds that Tommy repays him via a huge favor at a later date.In Mark's grandmother's basement, the group convenes to discuss the imminent flux of business. Sin explains via narration that one of Tommy's associates, Knowledge, is to be involved in the operation. Meanwhile, Sincere teases Black, who is upset that his share of the money from the robbery was less than Sincere received. While this is happening, Knowledge tells Tommy over the phone that he had heard that Black had been talking about wanting to rob Sincere. Tommy becomes incredibly enraged. He pushes Black to the floor and forces him to strip naked in front of everyone while firing a handgun wildly into the floor. Tommy then orders Black to sit on the couch, as he visibly harbors hostile feelings towards the rest of the men.The duo, along with some of their friends, including Knowledge and Mark, start transporting drugs from Queens to Omaha, and begin to overrun the drug business there. This is met with jealousy from a local drug dealer Big Head Rico (Tyrin Turner), who informs the police of their activities. This results in a raid at their stash-house, which results Mark's death and Knowledge's arrest. Knowledge calls Tommy's house from jail and is told by Keisha that Tommy isn't there, nor should he have called since the FBI could have tapped their phone. Knowledge gets angry that Tommy won't come to bail him out, and calls Shameek, aka Father Sha (Method Man), to not only infiltrate Rico's gang, but to handle Tommy. While at a strip club in Omaha, Shameek confronts Rico and informs him that Knowledge sent him here to kill him and his associates. When Rico tries to run from Shameek, Shameek shoots and kills Rico as well as some members of his crew. While reloading, Shameek is shot by the bartender. Stumbling out the club, he manages to evade police.Meanwhile, Tommy goes to Jamaica with Ox, and repays him by killing Sosa, the son of a drug lord there. Back at Tommy's house, Keisha is arrested by police and later bailed out by Tionne. Tommy finds out about the raid and leaves town. Later, when Sosa's family and friends finds out that it was Ox who ordered the hit, Pelpa, the gang's leader and close friend of Sosa, sends a hit squad to kill him in his home. Ox is able to kill them all before a femme fatale named Chiquita drops down from his top floor stairwell and slits his throat.While these events occur, Sincere prepares to leave the drug game and move his girlfriend and child to Africa, despite Tommy's jokes that he was getting soft for wanting to leave. They make plans to leave on New Years Day, 2000. However, Sincere is now suspicious of Tommy since the Omaha incident. Tommy, meanwhile, has been laying low in Atlanta, selling marijuana with Wise and LaKid, two younger men from New York. One night at dinner, Tommy instigates an argument between Wise and LaKid, in which ends with both men to drawing their guns and LaKid shooting Wise dead. Tommy, extremely intoxicated, remains seated, calmly glancing at Wise's dead body as the police arrive to arrest him and is, inexplicably, later released. It is later revealed that Tommy was chosen by federal agents to assassinate a black Muslim leader, Rev. Saviour, (Dr. Benjamin Chavis) who plans to preach against the government on New Year's Eve.Tionne comes home from shopping to find Shameek and a few other men waiting for her inside and is confronted concerning the whereabouts of Sincere and Tommy. After a tense standoff with pistols, the men leave. Later while talking to a friend (AZ) outside a barbershop, Black and an accomplice confront Sincere and shoots him in the leg, causing Sincere to shoot back in self-defense, killing Black and his accomplice, before fleeing the scene.On New Years' Eve, Tommy confronts Rev. Saviour in his study before he was to make a massive speech of hope and points his gun at him. Saviour convinces Tommy not to go through with his mission, even though this will be seen as an act of betrayal by the feds and will put his life at risk. Tommy, in tears, agrees, and the two men embrace.Shameek visits Keisha's home, in the hopes of finding Tommy there. He physically assaults Keisha, and after a struggle, Keisha gets ahold of Shameek's gun, and shoots him in the face at point-blank range.Sincere, now in Africa with Tionne and their child, reflects on recent events, relieved and happy to start a new life.","language":"English","Reception":"The film was poorly received by critics, scoring 13% on Rotten Tomatoes.[3] Although it was generally praised for its highly stylized \"noir-like\"[citation needed] visual design and cinematography, it was criticized for what was seen as a weak plot. Terrance Tartt of the Iowa Film association gave it two thumbs up, he said it was \"the most accurate representation of living the gangster life style he has ever seen\" [1]","box_office":"$9,639,390 (US and Canada)[1]","cinematography":"Malik Hassan Sayeed","production_company":"Big Dog Films","directed_by":"Hype Williams","narrated_by":"Nas","release_dates":"November 4, 1998 (1998-11-04)|||||","produced_by":"Larry Meistrich Ron Rotholz Robert Salerno Hype Williams","starring":"Nas DMX Taral Hicks Tionne \"T-Boz\" Watkins Method Man","running_time":"92 minutes","music_by":"Stephen Cullo","edited_by":"David Leonard"}