{"country":"United Kingdom|United States|","distributed_by":"Warner Bros. Pictures","corpse_bride":"Theatrical release poster","screenplay_by":"John August|Caroline Thompson|Pamela Pettler|","Plot":"In an unspecified Victorian-era village somewhere in Europe, Victor Van Dort (Johnny Depp), the son of nouveau riche fish merchants, and Victoria Everglot (Emily Watson), the neglected daughter of hateful aristocrats, are preparing for their arranged marriage, which will simultaneously raise the social class of Victor's parents and restore the wealth of Victoria's penniless family. Both have concerns about marrying someone they do not know, but upon meeting for the first time, they fall for each other. After the shy Victor ruins the wedding rehearsal by forgetting his vows and is scolded by Pastor Galswells (Christopher Lee), he flees and practices his wedding vows in the nearby forest, placing the wedding ring on a nearby upturned tree root.The root turns out to be the finger of a murdered woman in a tattered bridal gown, who rises from the grave claiming that she is now Victor's wife. After fainting, Victor wakes up and finds out he was spirited away to the surprisingly festive Land of the Dead. The bewildered Victor learns the story of how Emily (Helena Bonham Carter), his new bride, was murdered years ago by an unknown criminal on the night of her secret elopement. Emily, as a wedding gift, reunites Victor with his long-dead dog, Scraps. Meanwhile, Victoria's parents hear that Victor has been seen in another woman's arms, and become suspicious.Wanting to reunite with Victoria, Victor tricks Emily into taking him back to the Land of the Living by pretending he wants her to meet his parents. She agrees to this and takes him to see Elder Gutknecht (Michael Gough), the kindly ruler of the underworld, to send him and Emily temporarily to the Land of the Living. Once back home, Victor asks Emily to wait in the forest while he rushes off to see Victoria and confess his wish to marry her as soon as possible, to which she gladly returns his feelings. Just as they are about to share a kiss, Emily arrives and sees the two of them together and, feeling betrayed and hurt, angrily drags Victor back to the Land of the Dead. Victoria tells her parents that Victor has been forcibly wed to a dead woman, but they believe she has lost her mind and lock her up in her bedroom. She escapes her room by window and rushes to Galswells to find a way to help Victor, but fails. With Victor gone, Victoria's parents decide to marry her off to a presumably wealthy newcomer in town named Lord Barkis Bittern (Richard E. Grant), who appeared at the wedding rehearsal, against her will.Emily is heartbroken by Victor's deception. Victor, however, apologizes for lying to her, and the two reconcile while playing the piano together. Shortly after, Victor's recently deceased family coachman appears in the afterlife and informs Victor of Victoria's impending marriage to Barkis. In order for their marriage to become valid, Victor must repeat his vows in the Land of the Living and willingly drink the Wine of Ages, a poison - thus joining her in death. Overhearing this, and fretting about having lost Victoria to another man, Victor agrees to die for Emily. All of the dead go \"upstairs\" to the Land of the Living to perform the wedding ceremony for Victor and Emily. Upon their arrival, the town erupts into a temporary panic until every living person recognizes each other's loved ones from the dead and they have a joyous reunion under the bizarre circumstances.After a quarrel with Barkis (and realizing he was only after her supposed money), Victoria follows the procession of dead to the church. Emily notices Victoria and realizes that she is denying Victoria her chance at happiness the same way it was stolen from her. As Victor prepares to drink the cup of poison to kill himself, Emily stops him and reunites him with Victoria. Barkis interrupts them, and Emily recognizes him as her former fiance - who is revealed to be the one who murdered her for her dowry. Barkis tries to kidnap Victoria at sword point, but Victor stops him and the two men duel. The dead townspeople are unable to interfere with the affairs of the living. Emily intercedes to save Victor and Barkis mockingly proposes a toast to Emily, claiming she was \"always the bridesmaid, never the bride.\" He unknowingly drinks the cup of poison. The dead, now able to intercede, happily drag the \"new arrival\" back to the Land of the Dead for retribution for his crimes. Victoria, now a widow, is once again able to marry Victor.Emily sets Victor free of his vow to marry her, giving the wedding ring back to Victor and her wedding bouquet to Victoria before exiting the church. As she steps into the moonlight, she transforms into hundreds of butterflies, presumably finding peace, as Victor and Victoria look on wrapped in each other's embrace.","language":"English","box_office":"$117.2 million[3]","cinematography":"Pete Kozachik","directed_by":"Mike Johnson|Tim Burton|","production_companies":"Tim Burton Productions Laika Entertainment Patalex II Productions","Music":"The soundtrack was produced by Danny Elfman with the help of John August and released on September 20, 2005.[8] It contains all of the music from the film including score music and four songs with lyrics sung by voice actors.[8]All songs written and composed by Danny Elfman and John August. All scores written by Elfman. ","release_dates":"September 7, 2005 (2005-09-07) (Venice)|September 23, 2005 (2005-09-23) (United States)|October 13, 2005 (2005-10-13) (United Kingdom)|||","Production":"The film is based on a 19th-century Russian folktale, which Joe Ranft introduced to Burton while they were finishing The Nightmare Before Christmas.[5] The film began production in November 2003, while Burton was completing Big Fish.[6] He continued with production on his next live-action feature, Charlie and the Chocolate Factory, which was produced simultaneously with the film.[6] Co-director Mike Johnson spoke about how they took a more organic approach to directing the film, saying: \"In a co-directing situation, one director usually handles one sequence while the other handles another. Our approach was more organic. Tim knew where he wanted the film to go as far as the emotional tone and story points to hit. My job was to work with the crew on a daily basis and get the footage as close as possible to how I thought he wanted it.\"[6]The film was originally supposed to have been shot on film, though a last-minute change by the studio helped introduce a different technology.[6] In 1997, during pre-production on Henry Selick's feature, Monkeybone, the film's cinematographer Pete Kozachik was looking for a type of filming that would streamline the process of integrating stop-motion characters with pre-filmed live actors.[6] After finishing Monkeybone, Kozachik continued to test cameras for a practical means of shooting feature animation digitally.[6] In early 2003, the production unit was not interested in digital capture for stop motion; the team was instead prepping the movie for a film shoot.[6] Two weeks before filming was to begin, Kozachik and visual effects consultant Chris Watts came up with a solution using digital still cameras that was deemed viable by Warner Bros. senior vice president of physical production and visual effects Chris DeFaria. The production then became digital.[6] After testing a dozen different models, Kozachik opted for a basic digital still camera, the Canon EOS-1D Mark II, an off-the-shelf model that was outfitted with adapters to allow the use of Nikon prime lenses (14mm-105mm).[6] Kozachik spoke about why he chose the camera, saying: \"One reason I went with this particular camera is that its image chip is just about the same size as Super 35 film negative, so we could use Nikon lenses and treat them like regular 35mm cine lenses and get the same effect—the same depth of field and angle of coverage. I knew that we were going to be fighting to make this look like a 'real' movie because we weren't shooting on film, so I wanted to at least have the optics look like movie optics.\"[6]Animation took place at 3 Mills Studios in East London.[6] A dozen animators/puppeteers were put to work when production began, but that number had tripled by the end of production.[6] The initial group spent time developing each puppet's unique characteristics.[6] The puppets themselves, built by Mackinnon and Saunders, were typically about 17 inches tall and animated on sets built three to four feet off the ground with trap doors that allowed animators access to the sets' surfaces to manipulate the puppets.[6] The three primary characters—Victor, Victoria and Corpse Bride—were fitted with heads the size of golf balls that contained special gearing to allow the animators to manipulate individual parts of the puppets' faces.[6] The animators' work was spread over 25 to 35 individual setups/stages, each having its own Canon digital camera.[6] A total of 32 cameras were used on the film.[6] Each camera was outfitted with a \"grabber\" system that enabled the animators to capture frames and download them into a computer to assemble a short \"reel\" of the shot being produced to check their work.[6]The film's images were stored on a 1GB image card that was capable of holding approximately 100 frames of animation.[6] Eight roving camera teams—each team including a lighting cameraman, an assistant, a lighting electrician and a set dresser to deal with any art department issues—worked with the animators to set up shots.[6] Each camera team had a \"lighting station\" workstation—comprising an Apple G4 computer and a monitor to assist in checking lighting and framing—to view TIFF file versions of the camera's images.[6] Once a shot was approved, the computer was removed and the animators were left to shoot the scene using their still camera and \"grabber\" computer/camera system to check their work.[6] The film's story department head Jeffrey Lynch explained that the scenes were developed initially from storyboards created by a team, saying: \"We shot as close to a 1:1 film ratio [one take per shot] as we could because there was no time for reshoots. We did most of our experimentation in the storyboard process—as many ways as needed—to get the scene how we wanted it. There was no coverage, as there would be for a live-action film.\"[6]Co-director Johnson would go over each scene with the animators, sometimes acting out the scene, if necessary. The animators would create a \"dope sheet\"—in which a shot was broken down, frame by frame—to account for key \"hits\". The animators would then shoot tests of the scene, often shooting on \"2s\" or \"4s\" (meaning shooting just every second or fourth frame of what would appear in the final animation).[6] Johnson explained: \"The next day, when they'd finish their test/rehearsal, we'd cut it in and see how it played in the reel and fine-tune from there. We might do some lighting tweaks, performance tweaks or have the art department get in and touch anything that needed it. Then we'd close the curtain and let the animator animate the shot.\"[6] The animators would sometimes make use of the voice and/or video recordings of the actors, a practice also common in cel animation.[6] Once photographed, the frames were manipulated by a team of \"data wranglers.\" Using a workflow developed by Chris Watts, the frames were downloaded from the camera image cards as RAW files, converted to Cineon files and processed through a \"color cube.\"[6] Cinematographer Pete Kozachik explained: \"The color cube is a 3D lookup table created by FilmLight Ltd. that forces the image data into behaving like a particular Eastman Kodak film stock—in this case, 5248, one of my favorites. With this film emulation, we could actually rate our cameras at ASA 100, then take our light meters and spot meters and, with great confidence, shoot as if we were using 5248. Sure enough, the footage would come back and look just like it.\"[6] The frames could be processed further to generate a TIFF file for viewing on the lighting station computer monitors so lighting, composition and color could be previewed.[6]Visual effects were delivered by London's Moving Picture Company (MPC), and were applied to the 1,000 or so shots in the film, though most of the effects simply painted out puppet supports and similar set equipment. Some visual effects elements—groups of birds and butterflies, were created completely in CG, though others were composited as visual effects from real-life elements.[6] Pete Kozachik explained that the trick for shooting the characters by themselves was obtaining visually interesting shots that would dependably support the director's storytelling, saying: \"The challenge is keeping the action clear and simple with lighting and composition. There's a discipline to clear storytelling with these puppets. You want to be abstract, but one can easily go overboard with these critters because they aren't as familiar to the audience as real humans. The characters don't necessarily translate the same as if you're shooting a real person. You have to consciously balance arty atmosphere and graphic clarity so as to not confuse the audience about what it is they're looking at.\"[6]In a 2005, interview with About.com, Burton spoke about the differences between directing Corpse Bride and The Nightmare Before Christmas, saying: \"The difference on that was that one I had designed completely. It was a very completed package in my mind. I felt like it was there. I felt more comfortable with it. With this, it was a bit more organic. It was based on an old folk tale. We kept kind of changing it but, you know, I had a great co-director with Mike Johnson. I feel like we complemented each other quite well. It was just a different movie, a different process.\"[7] He also spoke about casting Johnny Depp as Victor, saying: \"It was weird because we were doing both at the same time. He was Willy Wonka by day and Victor by night so it might have been a little schizophrenic for him. But he’s great. It's the first animated movie he's done and he's always into a challenge. We just treat it like fun and a creative process. Again, that’s the joy of working with him. He's kind of up for anything. He just always adds something to it. The amazing thing is all the actors never worked [together]. They were never in a room together, so they were all doing their voices, except for Albert [Finney] and Joanna [Lumley] did a few scenes together, everybody else was separate. They were all kind of working in a vacuum, which was interesting. That’s the thing that I felt ended up so beautifully, that their performances really meshed together. So he was very canny, as they all were, about trying to find the right tone and making it work while not being in the same room with each other.\"[7]","produced_by":"Tim Burton|Allison Abbate|","starring":"Johnny Depp|Helena Bonham Carter|","running_time":"77 minutes[1]","music_by":"Danny Elfman","edited_by":"Jonathan Lucas|Chris Lebenzon|","Release":"Corpse Bride premiered on September 7, 2005 at the Venice International Film Festival. The film was released on September 23, 2005 in United States and on October 13, 2005 in the United Kingdom.[9]Corpse Bride grossed $53,359,111 in North America, and $63,835,950 in other territories, for a worldwide total of $117,195,061.[3]In North America, the film opened to number two in its first weekend, with $19,145,480, behind Flightplan.[10] In its second weekend, the film dropped to number three, grossing an additional $10,033,257.[11] In its third weekend, the film dropped to number six, grossing $6,511,336.[11] In its fourth weekend, the film dropped to number nine, grossing $3,577,465.[11]The biggest market in other territories being France, UK and Japan where the film grossed $8.88 million, $8.57 million and $7.1 million respectively.[12]Corpse Bride received positive reviews from critics. The review aggregator website Rotten Tomatoes reported a 83% approval rating with an average rating of 7.2/10 based on 187 reviews.[13] The site's consensus reads: \"As can be expected from a Tim Burton movie, Corpse Bride is whimsically macabre, visually imaginative, and emotionally bittersweet.\"[13] Another review aggregator, Metacritic, which assigns a normalized rating out of 100 top reviews from mainstream critics, calculated a score of 83 based on 35 reviews, indicating \"universal acclaim\".[14] The film was nominated for AFI's 10 Top 10 in the \"Animation\" genre.[15] The film was nominated for the 78th Academy Awards for Best Animated Feature, but lost to Wallace & Gromit: The Curse of the Were-Rabbit.[16]Justin Chang of Variety gave the film a positive review, saying \"This macabre musical about a young bridegroom who mistakenly weds a girl from beyond the grave is an endearingly schizoid Frankenstein of a movie, by turns relentlessly high-spirited and darkly poignant.\"[17] Kirk Honeycutt of The Hollywood Reporter gave the film a positive review, calling it \"A wondrous flight of fancy, a stop-motion-animated treat brimming with imaginative characters, evocative sets, sly humor, inspired songs and a genuine whimsy that seldom finds its way into today's movies.\"[18] Michael Atkinson of The Village Voice gave the film a positive review, saying \"The variety of its cadaverous style is never less than inspired; never has the human skull's natural grin been redeployed so exhaustively for yuks.\"[19] Owen Gleiberman of Entertainment Weekly gave the film a B, saying \"As an achievement in macabre visual wizardry, Tim Burton's Corpse Bride has to be reckoned some sort of marvel.\"[20] Manohla Dargis of The New York Times gave the film four out of five stars, saying \"Cinema's reinvigorated fixation with the living dead suggests that we are in the grip of an impossible longing, or perhaps it's just another movie cycle running its course. Whatever the case, there is something heartening about Mr. Burton's love for bones and rot here, if only because it suggests, despite some recent evidence, that he is not yet ready to abandon his own dark kingdom.\"[21] Moira MacDonald of The Seattle Times gave the film three and a half stars out of four, saying \"What makes Corpse Bride sing, ultimately, is the breadth of imagination that it demonstrates; creating a cluttered, textured and mysteriously beautiful world that we're loathe to leave at the end.\"[22]Liam Lacey of The Globe and Mail gave the film three out of four stars, saying \"Ghoulishness and innocence walk hand-in-hand in Tim Burton's Corpse Bride, a movie that digs into Hollywood's past to resurrect the antique art of stop-motion animation and create a fabulous bauble of a movie.\"[18] Jack Mathews of the New York Daily News gave the film three and a half stars out of four, saying \"Stop-motion animation may be the hardest and most tedious job in Hollywood, but the makers of Tim Burton's Corpse Bride deserve a couple of years in Tahiti celebrating their effort.\"[18] Lou Lumenick of the New York Post gave the film three and a half stars out of four, saying \"Tim Burton's Corpse Bride is an instant classic.\"[18] Lisa Rose of the Newark Star-Ledger gave the film three out of five stars, saying \"Corpse Bride offers unclassifiable enchantment.\"[18] James Berardinelli of ReelViews gave the film three out of four stars, saying \"As animated films go, this is easily the best of a weak year.\"[23] Peter Howell of the Toronto Star gave the film four out of four stars, saying \"If his The Nightmare Before Christmas from a dozen years back was a treat for the eyes and mind, Tim Burton's Corpse Bride goes double or nothing by being a delight for the ears and also the heart.\"[18] Joe Williams of the St. Louis Post-Dispatch gave the film a B+, saying \"Beneath the bone pile of allusions, Corpse Bride is a darkly enchanting fable in its own right.\"[18]Andrew Sarris of The New York Observer gave the film a negative review, saying \"Corpse Bride turns out to be a ponderous mixture of puppetry and animation that is far too technologically complex and laborious for this hopelessly Luddite reviewer.\"[18] Roger Ebert gave the film three out of four stars, calling it \"A sweet and visually lovely tale of love lost.\"[24] Roger Moore of the Orlando Sentinel gave the film four out of five stars, saying \"The sweetness, the visual flourishes and inspired pieces of casting carry the Corpse Bride, if not all the way down the primrose path, then at least across the threshold.\"[25] Robert K. Elder of the Chicago Tribune gave the film three and a half stars out of four, saying \"If Nightmare Before Christmas was a jazzy pop number, Corpse Bride is a waltz--an elegant, deadly funny bit of macabre matrimony.\"[26] Kenneth Turan of the Los Angeles Times gave the film two out of five stars, saying \"The film does have a fairy-tale aspect, but, like many of its characters, it is more dead and buried than fully alive.\"[18] Claudia Puig of USA Today gave the film three and a half stars out of four, saying \"Corpse Bride is an unexpectedly touching celebration of love told in a quirky and inventive style.\"[27] Peter Travers of Rolling Stone gave the film three and a half stars out of five, saying \"In the guise of a family film, Burton evokes a darkly erotic obsession that recalls Edgar Allan Poe and Hitchcock's Vertigo. It would be a test for any filmmaker, and Burton aces it.\"[18]Steven Rea of The Philadelphia Inquirer gave the film three and a half stars out of four, saying \"Tim Burton's Corpse Bride is easily the best stop-motion animated necrophiliac musical romantic comedy of all time. It is also just simply, wonderful: a morbid, merry tale of true love that dazzles the eyes and delights the soul.\"[18] Bill Muller of The Arizona Republic gave the film four out of five stars, saying \"Corpse Bride is a delightful mix of strange goings-on and imaginatively crafted puppetry, a wild ride through Burton's chaotic, splendidly original world.\"[18] Michael Booth of The Denver Post gave the film three and a half stars out of four, saying \"Corpse Bride will win your heart, if it doesn't rip it out of your chest first.\"[28] Terry Lawson of the Detroit Free Press gave the film three out of four stars, saying \"There's a happy Halloween in store even for children who aren't allowed to trick or treat, and it's courtesy of Tim Burton's animated Corpse Bride.\"[18] Bruce Westbrook of The Houston Chronicle gave the film three and a half stars out of four, saying \"Amazingly fluid and drop-dead gorgeous, Tim Burton's Corpse Bride is the best-looking, stop-motion animation film ever.\"[29] Rene Rodriguez of the Miami Herald gave the film two and a half stars out of four, saying \"Corpse Bride suffers from the same problem that has plagued Burton's recent live-action films: for all its formidable razzle-dazzle, it doesn't engage the heart.\"[18] Colin Covert of the Star Tribune gave the film three and a half stars out of four, saying \"This vibrantly imaginative mix of horror and humor puts the f-u-n in funeral.\"[18]Corpse Bride was released on DVD and HD DVD on January 16, 2006.[30] It was released on Blu-ray on September 26, 2006.[31] As of February 3, 2015, the film has sold 2,777,736 DVDs and 40,411 Blu-ray Discs totaling a gross of $53,359,111 and $61,411,543 respectively for a total gross of $114,770,654 in North America.[32]","budget":"$40 million[2]"}