{"country":"United Kingdom","distributed_by":"Momentum Pictures (UK) Sony Pictures Classics (US)","another_year":"British cinema poster","Plot":"Tom Hepple, a geologist, and Gerri Hepple, a counsellor, are an older married couple who have a comfortable, loving relationship. The film observes them over the course of the four seasons of a year, surrounded by family and friends who mostly suffer some degree of unhappiness. Gerri's friend and colleague, Mary, works as a receptionist at the health centre. She is a middle-aged divorcee seeking a new relationship, and despite telling everyone she is happy, appears desperate and depressed. She often seems to drink too much. The Hepples' only child, Joe, is 30 and unmarried and works as a solicitor giving advice on housing.In the summer, the Hepples are visited by Ken, Tom's old friend from his student days. Ken is overweight, eats, smokes and drinks compulsively and seems very unhappy. Tom and Gerri host a barbecue in Ken's honour. Mary drives her newly bought car to the party, but gets lost and arrives late. Having had some wine, she flirts with Joe, whom she has known since he was a child. He remains friendly but does not reciprocate the flirtation. After the party, Mary reluctantly gives Ken a lift to the train station. He makes a clumsy romantic advance and Mary irritably rejects him.Months later, in the autumn, Mary is once again at Tom and Gerri's home. Joe arrives with a new girlfriend, Katie. Mary appears rude and hostile towards Katie, which is not appreciated by Tom and Gerri. This creates a rift between Gerri and Mary.In the winter, Tom, Gerri, and Joe attend the funeral for the wife of Tom's brother, Ronnie. Towards the end of the service, Ronnie's estranged son, Carl, arrives, and angrily asks why the ceremony was not delayed for him. At the reception at Ronnie's house, Carl becomes aggressive and walks out. Tom and Gerri invite Ronnie back to London to stay with them for a while and Ronnie agrees.While Tom and Gerri are at their garden allotment Mary arrives unannounced at their home and persuades Ronnie to let her in. Her car has just been written off and she is upset. The two have a cup of tea and a desultory chat before Mary takes a nap on the settee. When Tom and Gerri return they are unhappy to find Mary at their house. Gerri explains to Mary that she feels let down by her earlier behaviour towards Katie. Mary apologises and weeps. Gerri gradually extends a degree of warmth to Mary, suggesting that she should seek professional help and inviting her to stay for dinner, and the two women set the table. Joe and Katie arrive, their relationship still appearing strong and happy. The Hepples enjoy dinner together. Mary eats with them but appears lost and uncertain.","language":"English","Reception":"The film was well received by critics. According to review aggregation website, Rotten Tomatoes, 93% of critics have given the film a positive review, with a rating average of 8.2 out of 10 from 154 reviews.[9] The film debuted at the 2010 Cannes Film Festival in competition for the Palme d'Or and although it failed to receive any prizes, it was highly praised by critics,[10][11][12] scoring an 3.4/4 average at Screen International's annual Cannes Jury Grid, which polls international film critics from publications such as Sight & Sound, The Australian, Positif, L'Unità and Der Tagesspiegel.[13]Wendy Ide of The Times described the film as \"Leigh at his confident best\" and \"a disarmingly humane work\", writing, \"Mike Leigh shows admirable restraint: there are no manufactured crescendos, just a melancholy refrain that builds to its raw realisation in an achingly sad final shot.\"[14] Xan Brooks of The Guardian described Another Year as \"a rare treat\",[15] and Geoffrey Macnab of The Independent described the film as \"an acutely well-observed study of needy and unhappy people desperately trying to make sense of their lives.\"[16]","box_office":"$18,124,262[3]","cinematography":"Dick Pope","production_company":"Thin Man Films","directed_by":"Mike Leigh","release_dates":"15 May 2010 (2010-05-15) (Cannes)|5 November 2010 (2010-11-05)||||","Production":"Because the director's usual producer Simon Channing-Williams died in 2009, Another Year was produced by Georgina Lowe, who had worked regularly on Mike Leigh films since Naked (1993). Thin Man Films led the production together with television channel Film4 and Focus Features International.[6] The project received £1.2 million from the UK Film Council.[7] The production involved a budget of around US$8 million, which Leigh said was \"the lowest budget I've had for a long time\".[2]Most of Another Year's key cast members had already worked with the director multiple times. Leigh collaborated with the actors for five months to create their characters and world and to do research. The director employed his usual technique: the actors improvise extensively during rehearsals, and the result of those improvisations becomes the basis of the final script. Principal photography took 12 weeks. To simulate the four seasons of a year, cinematographer Dick Pope used four different film stocks, and much attention was paid to details in the props so that the passage of time would appear believable.[2]The location used for Tom and Gerri Hepple's house is St Margaret’s Road, Wanstead, East London.[8]","produced_by":"Georgina Lowe","starring":"Lesley Manville Jim Broadbent Ruth Sheen","running_time":"129 minutes[1]","music_by":"Gary Yershon","edited_by":"Jon Gregory","written_by":"Mike Leigh","budget":"$8 million[2]"}