{"brief_encounter":"Theatrical release poster","based_on":"Still Life 1936 play  by Noël Coward","country":"UK","distributed_by":"Eagle-Lion Distributors (UK) Universal Pictures (US)","Adaptation of Still Life":"The film is based on Noël Coward's one-act play Still Life (1936), one of ten short plays in the cycle Tonight at 8:30, designed for Gertrude Lawrence and Coward himself, and to be performed in various combinations as triple bills. All scenes in Still Life are set in the refreshment room of a railway station (the fictional Milford Junction).As is common in films based on stage plays, the film depicts places only referred to in the play: Dr. Lynn's flat, Laura's home, a cinema, a restaurant and a branch of Boots the Chemist. In addition, a number of scenes have been added which are not in the play: a scene on a lake in a rowing boat where Dr. Harvey gets his feet wet; Laura wandering alone in the dark, sitting down on a park bench, smoking in public and being confronted by a police officer; and a drive in the country in a borrowed car.Some scenes are made less ambiguous and more dramatic in the film. The scene in which the two lovers are about to commit adultery is toned down: in the play it is left for the audience to decide whether they actually consummate their relationship; in the film it is intimated that they do not. In the film, Laura has only just arrived at Dr. Lynn's flat when the owner returns and is immediately led out by Dr. Harvey via the kitchen service door. Later, when Laura seems to want to throw herself in front of an express train, the film makes the intention clearer by means of voice-over narration. Also, in the play, the characters at the Milford station—Mrs. Baggot, Mr. Godby, Beryl, and Stanley—are very much aware of the growing relationship between Laura and Alec and sometimes mention it in an offhand manner, whereas in the film, they barely take any notice of them or what they are doing, either showing them respect for their privacy or just being oblivious. The final scene of the film showing Laura embracing her husband after he shows that he has noticed her distance in the past few weeks and perhaps even guessed the reason is not in the original Coward play.There are two editions of Coward's original screenplay for the film adaptation, both listed in the bibliography.","Plot":"In the latter months of 1938, Laura Jesson (Celia Johnson), a respectable middle-class British woman in an affectionate but rather dull marriage, tells her story while sitting at home with her husband, imagining that she is confessing her affair to him.Laura, like many women of her class at that time, goes to a nearby town every Thursday for shopping and to the cinema for a matinée. Returning from one such excursion to Milford, while waiting in the railway station's tea shop, she is helped by another passenger, who solicitously removes a piece of grit from her eye. The man is Alec Harvey (Trevor Howard), an idealistic doctor who also works one day a week as a consultant at the local hospital. Both are in their late thirties or early forties, married and with children.Enjoying each other's company, the two arrange to meet again. They are soon troubled to find their innocent and casual relationship quickly developing into something deeper.For a while, they meet openly, until they run into friends of Laura and the perceived need to lie arises. The second lie comes easier. They eventually go to a flat belonging to Stephen (Valentine Dyall), a friend of Alec's and a fellow doctor, but are interrupted by Stephen's unexpected and judgmental return. Laura, humiliated and ashamed, runs down the back stairs and into the streets. She walks for hours, sits on a bench and smokes, and is confronted by a police officer, with the implication that she could be perceived as a \"streetwalker.\"The rather sordid turn of events brings home to the couple that both an affair and a future together are impossible. Realising the danger and not wishing to hurt their families, they agree to part. Alec has been offered a job in Johannesburg, South Africa, where his brother lives.Their final meeting occurs in the railway station refreshment room, now seen for a second time with the poignant perspective of their story. As they await a heart-rending final parting, Dolly Messiter (Everley Gregg), a talkative acquaintance of Laura, invites herself to join them and begins chattering away, oblivious to the couple's inner misery.As they realise that they have been robbed of the chance for a final goodbye, Alec's train arrives. With Dolly still chattering, Alec departs with a last look at Laura but without the passionate farewell for which they both long. After shaking Messiter's hand, he discreetly squeezes Laura on the shoulder and leaves. Laura waits for a moment, anxiously hoping that Alec will walk back into the refreshment room, but he does not. As the train is heard pulling away, Laura is galvanized by emotion and, hearing an approaching express train, suddenly dashes out to the platform. The lights of the train flash across her face as she conquers a suicidal impulse. She then returns home to her family.Laura's kind and patient husband, Fred (Cyril Raymond), suddenly shows not only that he has noticed her distance in the past few weeks but that he has perhaps even guessed the reason. He thanks her for coming back to him. She cries in his embrace.","language":"English","Reception":"According to trade papers, the film was a \"notable box office attraction\".[4]The film shared the 1946 Grand Prix at the Cannes Film Festival. At the 19th Academy Awards, Celia Johnson was nominated for Best Actress while David Lean was nominated for Best Director and Best Adapted Screenplay along with Anthony Havelock-Allan and Ronald Neame. In 1999 Brief Encounter came second in a British Film Institute poll of the top 100 British films. In 2004, the magazine Total Film named it the 44th greatest British film of all time. Derek Malcolm included the film in his 2000 column The Century of Films.Brief Encounter holds an 88% \"fresh\" rating at review aggregator Rotten Tomatoes.[5]In her book Noël Coward (1987), Frances Gray says that Brief Encounter is, after the major comedies, the one work of Coward that almost everybody knows and has probably seen; it has featured frequently on television and its viewing figures are invariably high.\"Its story is that of an unconsummated affair between two married people [....] Coward is keeping his lovers in check because he cannot handle the energies of a less inhibited love in a setting shorn of the wit and exotic flavour of his best comedies [....] To look at the script, shorn of David Lean's beautiful camera work, deprived of an audience who would automatically approve of the final sacrifice, is to find oneself asking awkward questions\" (p. 64–67).Gray acknowledges a common criticism of the play: why do the characters not consummate the affair? Gray argues that their problem is class consciousness: the working classes can act in a vulgar way, and the upper class can be silly; but the middle class is, or at least considers itself, the moral backbone of society – a notion whose validity Coward did not really want to question or jeopardise, as the middle classes were Coward's principal audience.However, Laura in her narration stresses that what holds her back is her horror at the thought of betraying her husband and her settled moral values, tempted though she is by the force of a love affair. Indeed, it is this very tension which has made the film such an enduring favourite.The values which Laura precariously, but ultimately successfully, clings to were widely shared and respected (if not always observed) at the time of the film's original setting (the status of a divorced woman, for example, remained sufficiently scandalous in the UK to cause Edward VIII to abdicate in 1936). Updating the story may have left those values behind and with them vanished the credibility of the plot, which may be why the 1974 remake could not compete.[6]The film is widely admired for the beauty of its black-and-white photography and the atmosphere created by the steam-age railway setting, both of which were particular to the original David Lean version.[7]The film was a great success in the UK and such a hit in the US that Celia Johnson was nominated for an Academy Award for Best Actress.The film was released amid the social and cultural context of the Second World War when 'brief encounters' were thought to be commonplace and women had far greater sexual and economic freedom than previously. In British National Cinema (1997), Sarah Street argues that \"Brief Encounter thus articulated a range of feelings about infidelity which invited easy identification, whether it involved one's husband, lover, children or country\" (p. 55). In this context, feminist critics read the film as an attempt at stabilising relationships to return to the status quo.[citation needed] Meanwhile, in his 1993 BFI book on the film, Richard Dyer notes that owing to the rise of homosexual law reform, gay men also viewed the plight of the characters as comparable to their own social constraint in the formation and maintenance of relationships. Sean O'Connor considers the film to be an \"allegorical representation of forbidden love\" informed by Noël Coward's experiences as a closeted homosexual.[8]The British play and film The History Boys features two of the main characters reciting a passage of the film. (The scene portrayed, with Posner playing Celia Johnson and Scripps as Cyril Raymond, is in the closing minutes of the film where Laura begins, \"I really meant to do it.\")Kathryn Altman, wife of director Robert Altman said, \"One day, years and years ago, just after the war, [Altman] had nothing to do and he went to a theater in the middle of the afternoon to see a movie. Not a Hollywood movie: a British movie. He said the main character was not glamorous, not a babe. And at first he wondered why he was even watching it. But twenty minutes later he was in tears, and had fallen in love with her. And it made him feel that it wasn't just a movie.\" The film was Brief Encounter. [9]The Channel 4 British drama series Shameless has a plot based on Brief Encounter in its fifth series. Similarities include the main character, Frank Gallagher getting grit in his eye from a bus, being caught by a friend of his wife, and the tearful departure. Frank's wife, Monica even thanks Frank for coming back.[citation needed]Brief Encounter also loosely inspired Mum's Army, an episode of the British comedy series Dad's Army. There is a similar final scene in a railway station.[citation needed]A 1974 television remake of the film, shown in the US on the Hallmark Hall of Fame, starred Richard Burton and Sophia Loren, but was not well received.[10]","Adaptations of the film":"Brief Encounter was adapted as a radio play on 20 November 1946 episode of Academy Award Theater, starring Greer Garson.[11] It was presented three times on The Screen Guild Theater, first on 12 May 1947 episode with Herbert Marshall and Lilli Palmer, again on 12 January 1948 with Herbert Marshall and Irene Dunne and finally on 11 January 1951 with Stewart Granger and Deborah Kerr. It was also adapted to Lux Radio Theater on 29 November 1948 episode with Van Heflin and Greer Garson and on 14 May 1951 episode with Olivia de Havilland and Richard Basehart.On 30 October 2009, as part of the celebrations for the 75th anniversary of the BBC's Maida Vale Studios, Jenny Seagrove and Nigel Havers starred in a special Radio 2 production of Brief Encounter, performed live from Maida Vale's studio 6 (MV6). The script used was a 1947 adaptation for radio by Maurice Horspool, which had been in the BBC's ownership and had never been used or performed since then. In addition, there were two Theatre Guild On The Air broadcasts of Brief Encounter in its original form, Still Life. The first version aired on April 6, 1947 over ABC with Ingrid Bergman, Sam Wanamaker, and Peggy Wood. The second one was presented over NBC on November 13, 1949 and starred Helen Hayes and David Niven.The first adaptation of Brief Encounter which sourced both the screenplay and Coward's original stage material was adapted by Andrew Taylor and starred Hayley Mills in the lead role. The first national tour took place in 1996 and later transferred into the West End (Lyric Theatre, Shaftesbury Avenue) in 2000 starring Jenny Seagrove.The 2008 Kneehigh Theatre production, produced by David Pugh and Dafydd Rogers, was adapted for the stage and directed by Emma Rice and is a mixture of the film and the stage play, with additional musical elements. It toured the UK before opening in February 2008 at the Haymarket Cinema in London, which was converted into a theatre for the play.[12][13] The 2008 London cast included Amanda Lawrence and Tamzin Griffin, with Tristan Sturrock and Naomi Frederick in the lead roles. The production ran until November 2008 and then toured the UK for 27 weeks from February to July 2009, with venues including the Oxford Playhouse, Marlowe Theatre and the Richmond Theatre and with the two leads played by Hannah Yelland and Milo Twomey. The US premiere at the American Conservatory Theater in San Francisco, CA ran from September to October 2009 [2]. The adaptation was performed in Brooklyn, New York at St. Ann's Warehouse in December 2009 and January 2010 and at the Guthrie Theater in Minneapolis in February – April 2010.[14]A Roundabout Theatre Company production of the Kneehigh adaptation opened at Studio 54 in New York City on 28 September 2010 starring Hannah Yelland, Tristan Sturrock, and other members of the London cast.[15] The limited engagement closed on 2 January 2011, after 21 previews and 119 performances, including a four-week extension.[16]After an Australian tour in autumn 2013, Kneehigh's production of Noël Coward's Brief Encounter appears at the new Wallis Annenberg Center in Beverly Hills and the Shakespeare Theater in Washington in Spring 2014 [17]In May 2009 Houston Grand Opera premiered a two-act opera Brief Encounter based on the story, with music by André Previn from a libretto by John Caird.[18]","cinematography":"Robert Krasker","directed_by":"David Lean","Production notes":"Much of the film version was shot at Carnforth railway station in Lancashire, then a junction on the London, Midland, and Scottish Railway. As well as a busy station being necessary for the plot, it was located far enough away from major cities to avoid the blackout for film purposes, shooting taking place in early 1945 before the Second World War had finished. At two points in the film the station location is indicated by platform signs referring to local destinations including, Leeds, Bradford, Morecambe and Lancaster. Noël Coward makes the station announcements in the film. The station refreshment room was a studio recreation. Carnforth Station still retains many of the period features present at the time of filming and remains a place of pilgrimage for fans of the film.[2] However, some of the urban scenes were shot in London or at Denham or Beaconsfield near Denham Studios where the film was made.[3]The poem that Fred asks Laura to assist him with is by John Keats: \"When I have Fears that I may Cease to Be\". The actual quote Fred recites is, \"When I behold, upon the night's starr'd face, Huge cloudy symbols of a high Romance...\"In addition to the verbal reference to Keats, there is a visual reference to an Arabic love poem. In Stephen Lynn's apartment, a wall hanging is prominently displayed twice. When Laura enters, there is a shot of it over the dining table. Later, when Stephen confronts Alec, it is seen over Alec's left shoulder.","Music":"Excerpts from Sergei Rachmaninoff's Piano Concerto No. 2 recur throughout the film, played by Eileen Joyce. There is also a scene in a tea room where a salon orchestra plays the Spanish Dance No. 5 (Bolero) by Moritz Moszkowski.","release_dates":"26 November 1945 (UK)","produced_by":"Noël Coward Anthony Havelock-Allan Ronald Neame","starring":"Celia Johnson Trevor Howard Stanley Holloway Joyce Carey Cyril Raymond Everley Gregg Margaret Barton","running_time":"86 minutes","music_by":"Sergei Rachmaninoff","External links":"Streaming audio","edited_by":"Jack Harris","written_by":"Anthony Havelock-Allan David Lean Ronald Neame","budget":"$1 million[1]"}