{"country":"United States","distributed_by":"Apparition","screenplay_by":"Michael Jai White|Scott Sanders|Byron Minns|","story_by":"Michael Jai White|Byron Minns|","Legacy":"An animated spin-off of the film was produced for Cartoon Network's late night programming block, Adult Swim, with animation production by the same team behind The Boondocks.[29]In 2013, Chris Hardwick's Nerdist News released a series of short videos titled Black Dynamite Teaches a Hard Way! on their YouTube channel. The video series is a parody of Japanese variety show sketches, featuring a Japanese-speaking Black Dynamite mannequin teaching the value of respect among other things to former WWE wrestlers, MMA fighters and American Gladiators athletes. Special guests include Roddy Piper, Chavo Guerrero, Jr., Chris Masters, Daniel Puder, John Hennigan, Tank Abbott, Josh Barnett, and Kimo Leopoldo.[30]Director Sanders said that he and White had ideas for a sequel if the film did well.[29] Star Michael Jai White hinted that a sequel was being written during an interview on G4's Attack of the Show. White stated in an April 2012 interview that he hoped filming would begin at the end of that year.[31]","Plot":"In the 1970s, Black Dynamite, a Vietnam War veteran and former CIA officer, vows to clean up the streets of drug dealers and gangsters after his younger brother Jimmy is killed by a shady organization. O'Leary, Black Dynamite's former army and CIA partner, reinstates him into the agency because they do not want him seeking vengeance by himself. While trying to get to the bottom of Jimmy's murder, he finds out that his brother was actually working undercover for the CIA. Black Dynamite also discovers the shady organization is filling the black orphanages with heroin. He declares war on local drug dealers and successfully cleans up the streets, earning him the affection of Gloria, a black power activist who works at the local orphanage.After discovering the government's involvement in the drug ring, Black Dynamite steals the ledger belonging to corrupt Congressman James which details illegal shipments to a warehouse. Black Dynamite and his team (consisting of close friend Bullhorn, street hustler Cream Corn, militant leader Saheed, and two militants) storm the warehouse to capture a big shipment. They learn of a top secret operation called \"Code Kansas\", but there are no drugs in the warehouse; only \"Anaconda\" brand malt liquor, a government-produced brand that, according to the advertising slogan, \"Gives You Ooooooo!\". In a diner, they decipher the slogan and uncover \"Code Kansas\" as a plan to literally emasculate African-American men through Anaconda Malt Liquor, which is formulated to \"give (you) a little dick\". The militant Gunsmoke, who has fallen victim to the liquor's effect, is killed to put him out of his misery. Returning to the warehouse, Black Dynamite finds O'Leary is part of the evil plan, but is just following orders. He kills O'Leary before acquiring his next lead to find the source of the \"Code Kansas\" plan.Black Dynamite heads to Kung Fu Island, where he discovers that his old nemesis, Fiendish Dr. Wu, is responsible for creating the secret formula found in Anaconda Malt Liquor. In a protracted battle which kills Saheed, the two militants, and Bullhorn, Black Dynamite discovers the true identity of the mastermind of the entire operation - the White House.Black Dynamite then travels to the White House (in the process, Cream Corn is killed by the secret service) and confronts President Richard Nixon, who has been giving the orders from the beginning. When Black Dynamite defeats Nixon in a kung-fu battle and threatens to expose Nixon as the subject of a series of bondage and cross dressing photographs, the president begs to be killed but Black Dynamite refuses and has Nixon watch out for his people. The film concludes with a monologue from Black Dynamite on his quest for justice as Gloria and Pat Nixon watch on rapturously.","language":"English","box_office":"$296,557[2]","cinematography":"Shawn Maurer","production_company":"ARS Nova","directed_by":"Scott Sanders","release_dates":"October 16, 2009 (2009-10-16)|||||","Production":"\"It’s just a little too badass. That’s the tone of the movie. Our humor comes from the fact that the movie is just a little too badass.\"Michael Jai White originally thought of the idea for Black Dynamite around April 2006, while listening to James Brown's \"Super Bad\". White had also held blaxploitation movie parties where he picked up the \"funny inconsistencies\" in the films. White rented costumes, photographed himself and showed it to Sanders who was attracted to the idea. The same blue costume on White's photograph was used in the final scene of the film.[5]The original trailer was recorded even before the film went into production in order to raise money.[6] It incorporated scenes from old blaxploitation movies with old voice overs from Adolph Caesar.[4] The trailer was shot on Super 8 mm film for around $500[6] and contained numerous cultural references that placed the film in the 1970s, such as referring to the star of the film as a Baltimore Colts running back (the Colts moved to Indianapolis in 1984) and marveling at Black Dynamite's \"five thousand dollar car\" and \"hundred dollar suit\". White and Sanders showed it to Jon Steingart, who told them \"Oh my God. Okay, we can raise the money for this.\"[4]Once financing was secured, writing the script took about three weeks.[5] During the writing process, Minns's almost \"encyclopedic knowledge\" of blaxploitation helped them produce the script more quickly.[4]Cinematographer Shawn Maurer shot Black Dynamite on Super 16 Color Reversal Kodak film stock to get the high contrast and saturated look common in many low-budget Blaxploitation films of the 1970s.[6] The film was then converted to digital for editing.[7] The filmmakers supplemented their shoot with period stock footage from Sony Pictures Stock Footage, using films such as Missing in Action, Charlie's Angels, and Police Woman.[8] Black Dynamite was shot in the Leimert Park and Angeles Vista sections of Los Angeles over twenty days, with several green-screen days and one reshoot day.[9] The film had such a low budget that they had to \"think in the same ways that they had to think\" in the classic blaxploitation movies.[6] Sanders and White had a difficult time keeping the modern world out of the movie. Sanders was worried about anything modern that could destroy \"the whole illusion.\" White worked individually with actors to keep their tone correct.[5]As an homage to the low production values and \"one take only\" style of blaxploitation films, many filming errors were done on purpose. For example, in one scene where Black Dynamite stands up from his desk, a red boom microphone appears above his head (which was common in Rudy Ray Moore films, such as Dolemite). Some of the actors recite their stage directions before their intended dialogue (In one scene, an actor verbalizes the stage direction \"the militants turn startled\" and continues on saying the scripted dialogue \"How did you get in here?\")...[6]During casting, White sent Arsenio Hall the script, and \"when he read that there's a Captain Kangaroo pimp in this thing,\" he accepted the role.[5]Adrian Younge plays all instruments and wrote the lyrics to every song on the soundtrack except \"Shine,\" \"Cleaning Up The Streets,\" and \"Gloria.\" His influences on the score were Curtis Mayfield, Isaac Hayes, Ennio Morricone and Wu-Tang Clan. Morricone greatly influenced Younge from the classical European funk music, while Wu-Tang Clan helped him focus on making music they would want to sample. Sanders gave Younge almost complete leeway, but he still had to work hard to impress others working on the film. To record the score, Younge used vintage tape recording equipment and then sent it to be digitally transferred.[7]The film's theme song is \"Dynomite\" by Sir Charles Hughes; its chorus plays nearly every time Black Dynamite appears or whenever a punch line is delivered.[10]","black_dynamite":"Theatrical release poster","produced_by":"Jon Steingart|Jenny Wiener Steingart|","starring":"Michael Jai White|Tommy Davidson|Salli Richardson|","running_time":"84 minutes[1]","music_by":"Adrian Younge","edited_by":"Adrian Younge","Release":"Black Dynamite premiered at the 2009 Sundance Film Festival, where Sony Worldwide Acquisitions picked it up for distribution for \"nearly $2 million.\"[11] On June 14, the film went on to win the Golden Space Needle Audience Award for Best Film at the Seattle International Film Festival, beating The Hurt Locker among other films.[12] On August 25, 2009, it was announced that Apparition, a new distributor headed by Bill Pohlad and Bob Berney, would handle the film's domestic release.[13]A viral campaign was launched on the web prior to the film's general release, spearheaded by a mock nonprofit organization called \"Fight Smack in the Orphanage\" (FSITO).[14]Black Dynamite had a limited release to only 70 theaters and a run time of two weeks. The film grossed $131,862 in its opening weekend, and its two-week total was $242,578. This placed it at number 264 for all films released in 2009.[2]Black Dynamite received positive reviews and currently holds an 85% approval rating on Rotten Tomatoes based on 60 reviews. The site's consensus states: \"A loving and meticulous send-up of 1970s blaxploitation movies, Black Dynamite is funny enough for the frat house and clever enough for film buffs.\"[20] On Metacritic, Black Dynamite has a 65/100 rating, based on 14 critics, indicating \"generally favorable reviews\".[21] Chris Hardwick, in his Nerdist Podcast, claimed the film was \"one of the best comedy films I've seen in my life.\"[22]Owen Gleiberman wrote in Entertainment Weekly, \"Black Dynamite blends satire, nostalgia, and cinema deconstruction into a one-of-a-kind comedy high\", noting Sanders captured the language and feel of blaxploitation.[23] Roger Ebert awarded the film three stars out of four, and said, \"Black Dynamite gets it mostly right, and when it's wrong, it's wrong on purpose and knows just what it's doing.\" He added that the film meticulously reproduces 1970s blaxploitation and brings back much-needed gratuitous nudity.[24]A.O. Scott of The New York Times considered Black Dynamite would be a better \"five-minute clip on YouTube\" than a feature film. Scott wrote, \"A boom mike drifts down into the frame; an actor recites stage directions along with his lines. The camera zooms, pans and shifts focus as if it were being wielded by an optometrist on a cocaine binge. The acting is stiff, the dialogue painfully self-conscious, the action sequences choreographed and edited to look as cartoonish as possible. All of which is fun, for a while, in an academic kind of way.\"[25] In a 2012 interview, \"Black Dynamite\" responded to Scott, saying \"Well, obviously A.O. stands for 'asshole’s opinion,' ‘cause we here talking about it right now. Damn movie’s been tweeted about every two minutes since 2009.\" [26]James Greenberg writing for The Hollywood Reporter believed the film would not hold audience's attention because among all the detail there was no real story.[27]Black Dynamite was released on February 16, 2010 on DVD and Blu-ray. Both releases contain an audio commentary, deleted scenes, a \"making-of\" featurette, and a Comic-Con Q&A panel. The Blu-ray has an extra featurette and trivia track.[28]","budget":"$2.9 million"}