{"country":"United States Germany","distributed_by":"Artisan Entertainment","Plot":"Dr. Sullivan Travis (aka \"Dr. T.\") (Richard Gere) is a wealthy Dallas gynecologist for some of the wealthiest women in Texas who finds his life beginning to fall apart starting when his wife, Kate (Farrah Fawcett), suffers a nervous breakdown and is committed to the state mental hospital. Dr. T's eldest daughter, Dee Dee (Kate Hudson), is planning to go through with her approaching wedding despite the secret that she is romantically involved with Marilyn (Liv Tyler), the maid of honor. Dr. T's youngest daughter, Connie (Tara Reid), is a spunky conspiracy theorist who has her own agenda, while Dr. T's loyal secretary, Carolyn (Shelley Long), has romantic feelings for him, which are not mutual. Dr. T's sister-in-law, Peggy (Laura Dern), meddles in every situation she stumbles into, while one woman, Bree (Helen Hunt), a golf instructor, offers him comfort.","language":"English German Spanish","Reception":"The film received mixed reviews from critics. Review aggregation website Rotten Tomatoes gave the film a score of 57% positive reviews, based on 107 reviews.[2] Metacritic gave the film an average score of 64/100, based on 35 reviews.[3] CinemaScore audience polling gave the film an \"F\".[4]Critic Roger Ebert gave the film three stars, stating \"When you hear that Dr. T is a gynecologist played by Richard Gere, you assume he is a love machine mowing down his patients. Nothing could be further from the truth\".[5]","box_office":"$22,844,291","cinematography":"Jan Kiesser","directed_by":"Robert Altman","dr._t_&_the_women":"Theatrical release poster","release_dates":"October 13, 2000 (2000-10-13)","produced_by":"Robert Altman Cindy Cowan","starring":"Richard Gere|Helen Hunt|Farrah Fawcett|Laura Dern|Shelley Long|Kate Hudson|Liv Tyler|Tara Reid|","running_time":"122 minutes","music_by":"Lyle Lovett","edited_by":"Geraldine Peroni","Release":"Dr. T & The Women was released in US cinemas on October 13, 2000, and earned $5,012,867 in its opening weekend on 1,489 screens, ranking #7 in the weekend of October 13, 2000[1] ultimately grossing $13,113,041 in the United States. It was later released in the United Kingdom on July 6, 2001, and went on to gross $9,731,250 in international profits.","written_by":"Anne Rapp","budget":"$23 million"}