{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Walter Newman Lesser Samuels Billy Wilder","story_by":"Victor Desny","Plot":"Chuck Tatum (Kirk Douglas) is a fiercely ambitious, self-centered, wisecracking, down-on-his-luck reporter who has worked his way down the ladder. He has come west to New Mexico from New York City, along the way having been fired from eleven newspapers for libel, adultery, and heavy drinking, among other charges. Now that his car has broken down and Tatum is broke, he talks his way into a reporting job for the Albuquerque Sun-Bulletin, a paper of little consequence.Tatum stays sober and works there uneventfully for a year. Then while unhappily on assignment to cover a rattlesnake hunt, he learns about Leo Minosa (Richard Benedict), a local man who has become trapped in a cave collapse while gathering ancient Indian artifacts.Sensing a golden opportunity, Tatum manipulates the rescue effort, convincing an unscrupulous sheriff to pressure the construction contractor charged with the rescue into drilling from above, rather than shoring up the existing passages, so that Tatum can prolong his stay on the front pages of newspapers nationwide.Lorraine (Jan Sterling), the victim's wife, goes along with the reporter's scheme. She is eager to leave Leo and their struggling business in the middle of nowhere, a combination trading post and restaurant. Thanks to the publicity Tatum generates, she experiences a financial windfall, particularly from thousands of tourists who come to witness the rescue.Herbie Cook (Robert Arthur), the newspaper's young photographer, slowly loses his idealism as he follows Tatum's lead and envisions himself selling pictures to Look or Life. The editor of the Albuquerque Sun-Bulletin tries to talk some sense into his employees, but Tatum quits on the spot, having sold the exclusive rights to his copy to a New York editor for a lot of money and, more importantly, his old job back.Thousands flock to the town. The rescue site literally becomes a carnival, with rides, entertainment, songs about Leo, even games of chance. Tatum begins drinking again. He takes up with Lorraine and is greeted heroically by the crowd each time he returns from visiting poor Leo in the cave.After five days of drilling, the party atmosphere ends abruptly. Upon learning that Leo is fading fast, Tatum belatedly tries to get the contractor to switch back to the quicker procedure of shoring up the walls of the cave, but the vibration from drilling has made this impossible. Leo dies.Tatum has mistreated Leo's wife once too often as well, and she stabs him with a pair of scissors. Tatum barely reaches his old office in Albuquerque. He enters calling for publisher Booth (Porter Hall). As Booth walks out of his office to deal with him, Tatum says he has a story for him, revealing how he caused Leo's death and is responsible for it. But before he could talk to Booth, Tatum falls dead on to the floor.","language":"English","Reception":"At the time of its release, critics found little to admire. In his review in The New York Times, Bosley Crowther called it \"a masterly film\" but added, \"Mr. Wilder has let imagination so fully take command of his yarn that it presents not only a distortion of journalistic practice but something of a dramatic grotesque . . . [it] is badly weakened by a poorly constructed plot, which depends for its strength upon assumptions that are not only naïve but absurd. There isn't any denying that there are vicious newspaper men and that one might conceivably take advantage of a disaster for his own private gain. But to reckon that one could so tie up and maneuver a story of any size, while other reporters chew their fingers, is simply incredible.\"[11]The Hollywood Reporter called it \"ruthless and cynical...a distorted study of corruption and mob psychology that...is nothing more than a brazen, uncalled-for slap in the face of two respected and frequently effective American institutions - democratic government and the free press.\"[12] Variety was more positive, noting \"the performances are fine. Douglas enacts the heel reporter ably, giving it color to balance its unsympathetic character. Jan Sterling also is good in a role that has no softening touches, and Benedict's victim portrayal is first-rate. Billy Wilder's direction captures the feel of morbid expectancy that always comes out in the curious that flock to scenes of tragedy.\"[13]The film has found new respect among critics. Roger Ebert of the Chicago Sun-Times wrote in 2007, \"Although the film is 56 years old, I found while watching it again that it still has all its power. It hasn't aged because Wilder and his co-writers, Walter Newman and Lesser Samuels, were so lean and mean [with their dialogue] . . . [Kirk Douglas'] focus and energy . . . is almost scary. There is nothing dated about [his] performance. It's as right-now as a sharpened knife.\"[14]Dave Kehr in the Chicago Reader called it \"cold, lurid, and fascinating\"[15] and Nathan Lee of The Village Voice wrote, \"Here is, half a century out of the past, a movie so acidly au courant it stings.\"[16]Time Out London wrote, \"As a diatribe against all that is worst in human nature, it has moments dipped in pure vitriol.\"[17] TV Guide called it \"a searing example of writer-director Billy Wilder at his most brilliantly misanthropic\" and adds, \"An uncompromising portrait of human nature at its worst, the film . . . stands as one of the great American films of the 1950s.\"[18]Ed Gonzalez of Slant Magazine wrote that the film \"... allowed Wilder to question the very nature of human interest stories and the twisted relationship between the American media and its public. More than 50 years after the film's release, when magazines compete to come up with the cattiest buzz terms and giddily celebrate the demise of celebrity relationships for buffo bucks, Ace in the Hole feels more relevant than ever.\"[19]In his Slate review, Jack Shafer wrote in 2007, \"If film noir illustrates the crackup of the American dream . . . Ace in the Hole is an exemplar of the form.\"[20]In September 2008, Empire Magazine published its list of the Top 500 greatest movies of all time. With votes from 10,000 readers of the magazine along with 500 key film critics and 150 film industry figures, this film is ranked number 385.[21]WinsNomination","box_office":"$1.3 million (rentals)[1]","cinematography":"Charles Lang","ace_in_the_hole":"Theatrical release poster","directed_by":"Billy Wilder","Production notes":"The film's plot was inspired by two real-life events. The first involved W. Floyd Collins, who in 1925 was trapped inside Sand Cave, Kentucky, following a landslide. A Louisville newspaper, the Courier-Journal, jumped on the story by dispatching reporter William Burke Miller to the scene. Miller's enterprising coverage turned the tragic episode into a national event and earned the writer a Pulitzer Prize. Collins's name is cited in the film as an example of a cave-in victim who becomes a media sensation.The second event took place in April 1949. Three-year-old Kathy Fiscus of San Marino, California, fell into an abandoned well and, during a rescue operation that lasted several days, thousands of people arrived to watch the action unfold. In both cases, the victims died before they were rescued.[5]The film set, constructed outside Gallup, was the largest non-combat set ever constructed at the time. It measured 235 feet (72 m) high, 1,200 feet (370 m) wide, and 1,600 feet (490 m) deep and included an ancient cliff dwelling, collapsed cave, roadside stands, parking lots, and a carnival site. Underground scenes were filmed in a mock-up at the Paramount Studios on Melrose Avenue in Hollywood, CA.[6] More than 1,000 extras and 400 cars were utilized in the crowd scenes. After the film was completed, Paramount charged admission to the set.[7]In the original script, Tatum colluded with the local sheriff. Joseph Breen of the Hays Code office strongly objected to the on-screen depiction of a corrupt law enforcement officer and insisted Wilder add dialogue making it clear the man eventually would be made to answer for his actions.[8]The film's final cost was $1,821,052 of which $250,000 was paid to Wilder as writer, producer, and director.[9]Jay Livingston and Ray Evans wrote the song \"We're Coming, Leo,\" performed by a vocalist and band at the carnival.[citation needed]Frank Cady's character identifies himself as a salesman for Pacific All-Risk Insurance, a fictitious company featured in Wilder's 1944 film Double Indemnity.","release_dates":"June 14, 1951 (1951-06-14) (premiere-Albuquerque, New Mexico)|June 29, 1951 (1951-06-29) (United States)||||","produced_by":"Billy Wilder","starring":"Kirk Douglas Jan Sterling Robert Arthur Porter Hall","running_time":"111 minutes","music_by":"Hugo Friedhofer","Legal aftermath":"Following the film's release, Wilder was sued for plagiarism by screenwriter Victor Desny, who claimed he had contacted Wilder's secretary Rosella Stewart to propose a film based on the story of Floyd Collins in November 1949. Wilder's attorneys responded that not only did a verbal plot summary not constitute a formal story submission, but the Collins case was of a historical nature and as such was not protected by copyright laws. In December 1953, Judge Stanley Mosk ruled in favor of Wilder and Paramount. Desny appealed, and in August 1956 the California Supreme Court ruled his oral submission had been legitimate. Wilder's attorneys settled, paying Desny $14,350.[10]","edited_by":"Arthur P. Schmidt","budget":"$1.8 million"}