{"country":"West Germany","Plot":"In 1976, 13-year-old Christiane Felscherinow lives with her mother and little sister in a small apartment in a typical multi-story concrete social-housing building in a dull neighbourhood in the outskirts of West Berlin. She's sick and tired of living there and has a passion for singer David Bowie. She hears of Sound, a new disco in the city centre, labelled as the most modern discothèque in Europe. Although she's legally too young to go there, she dresses up in high heels, wears makeup, and asks a friend from school, who hangs out there regularly, to take her, too. At the disco, she meets Detlef, who is a little older and is in a clique where everybody experiments with various drugs, one night while running through the Europa Center they vandalize a ticket booth. The next day she takes pills and LSD, and goes to a David Bowie concert in which she meets Babsi, a girl of her same age and tendencies, and tries heroin for the first time by snorting it. But soon after Christiane falls in love with Detlef, and in order to be closer to him begins using heroin on a regular basis, gradually delving deeper into the drug and ending up as a full-blown addict. After her 14th birthday her time at home is replaced with time spent at her cohorts' unkempt apartment, she is also drawn to the seedy Bahnhof Zoo scene, a large railway and subway station notorious for the drug and sex trade in its underpasses and backalleys. There she also begins prostituting herself, with handjobs at first, imitating her boyfriend who also sells himself to homosexual clients on a regular basis. She steals at home, too, sells all her possessions, and debases herself to abysmal levels. In one of the crudest scenes, Christiane is jumped in a filthy, blood- and urine-soaked cubicle by an older junkie who forces her to surrender her loaded syringe and proceeds to inject himself with it right in the neck in front of a horrified old woman who happens to be in the lavatories too.Christiane is discovered collapsed on the bathroom floor of her home and with the help of her mother and stepfather tries going cold turkey along with Detlef; their withdrawal period is depicted with extreme realism in all its bodily aspects. Right after, though, they relapse as soon as they visit the Station again. Christiane and Detlef then find their best friend and roommate Axel dead by overdose in their flat and run away, ending up in Detlef's homosexual client's apartment for a few days. When Christiane walks in on the two men having very loud anal intercourse, she loses her composure and desperately runs to the station to find her girlfriend Babsi, only to discover she was found dead by overdose, too, at barely 14 years of age. Feeling hopeless and despaired for her friends' death and her inability to break free from heroin addiction, Christiane tries to commit suicide by an heroin overdose, but the movie abruptly skips to off-camera voiceover that says eventually Christiane recovered, but most of her cohorts either died or are irrecuperable.","language":"German","Reception":"Both the movie and the book acquired cult status in Europe immediately after release, raising awareness of heroin addiction. The popularity of the movie was greatly boosted by David Bowie's participation as both himself (portrayed giving a concert early in the movie) and as the main contributor to the soundtrack. Bowie's music from his albums made in Berlin during 1976-77 is heavily featured throughout the picture, and as he was at the very peak of his popularity during the late 1970s-early 1980s, his presence helped boost the film's commercial success.The film shocked European audiences. The heroin plague that swept Western Europe between the mid-1970s and the early 1980s had yet to become apparent to the public, and it did just after the film's release, with the epidemic killing a significant number of European youth. The film depicted in very realistic detail all the proceedings of heroin addiction: hustling and scoring, shooting up, the effects of heavy drug withdrawal and heavy drug usage, the thinning of the body and the shootup scars, the socialising in rundown neighbourhoods such as peripheral train stations, back alleys, often too high to keep one's eyes open and dropping onto the floor in a stupor, scenes all too familiar to urban citizens in West Germany, Switzerland, the Netherlands, Belgium, Italy and France in those years.Christiane and her cohorts are seen losing consciousness in decrepit lavatory cublicles amidst urine, vomit and blood, injecting in close-ups, cleaning and re-filling syringes directly from the toilet bowl, vomiting all over themselves and falling asleep right on top of it. Also, the depiction of young addicts from seemingly normal families was particularly alarming: junkies at the time were still popularly perceived as much older, wilder characters, such as those depicted in Dennis Hopper's Easy Rider or in Lou Reed's songs. Christiane turns 14 halfway in the film, the same age as her friend Babsi, who fatally overdoses. Christiane's boyfriend in the film is 15, portrayed by a 14-year-old actor. Their cohorts, two of them also fatally overdosing in the film, are not older than 16, as reported by end titles recalling the birth and death dates of the real-life individuals portrayed in the movie. The fact that the characters prostitute themselves to obtain drugs, both hetero- and homosexually, at such a young age, revolted audiences.[1]","cinematography":"Jürgen Jürges Justus Pankau","directed_by":"Uli Edel","Soundtrack":"All songs written by David Bowie except \"Heroes/Helden\" written by Bowie/Eno/Maas, \"Boys Keep Swinging\" and \"Look Back In Anger\", both written by Bowie/Eno. According to the book, the real Christiane F. had had her first experience with heroin at a David Bowie concert some years earlier; this is told in the film with David Bowie starring as himself. The concert scene was filmed in October 1980 at New York's Hurrah Club, which was redressed to resemble a Berlin nightclub (Bowie was appearing nightly on Broadway at the time so director Ulrich Edel had to shoot the sequence in New York).[3]","release_dates":"1981","Production":"The movie, shot with a low budget in 1980 and released in 1981, but set between 1975 and 1977 in West Berlin, is much leaner than the book it portrays. It skips altogether the beginning and also the end of the book, and concentrates on the main central part starting when Christiane begins her nightlife in Berlin at just around 13, and stops rather abruptly after her suicide attempt by mentioning she recovered. Christiane F. in real life never fully recovered nor did her woes end with her being carried away to Hamburg to begin withdrawal, but the movie focuses on the main addiction portrayal. Originally the movie was going to be directed by Roland Klick, but after a long preparation he was fired only two weeks before shooting, after a fallout with Bernd Eichinger. Uli Edel came in to direct the movie. Cinematography is very bleak and livid, depicting a dilapidated, working-class Berlin with rundown structures and unclean, unkempt settings. Berlin today is rather different and the majority of landmarks from the movie (the station, the Bülow street stalls, the Sound discothèque) are either gone for good or completely remodeled. The film is played mainly by first-time actors, the majority of whom were still in school at the time and have not pursued acting careers since. Only Natja Brunckhorst remained in German movies and television, starting with 1982's Querelle by Rainer Werner Fassbinder, another lurid-themed film. Most of the extras at the railway station and at the Sound club were in fact actual junkies, prostitutes and low-lifes rounded up by producers just for those crowded scenes. In a special scene where Christiane runs the alleys of the station to find girlfriend Babsi before learning she is dead, the camera lingers on several last-stage junkies leaning along walls of the underpasses. In a 2011 interview, Thomas Haustein, who plays Detlev and was still in school at the time, recalls being severely frightened by being surrounded by all those real-life addicts but that he also successfully copied their behaviour for his character. Most shootup, nudity and sex scenes involving such underage actors in such graphic detail would not be permitted by today's legal standards; at the time, however, it only required a written letter of consent from the parents to proceed with filming.[2]There are minimal incongruencies in the movie:","produced_by":"Bernd Eichinger Hans H. Kaden Hans Weth","starring":"Natja Brunckhorst Thomas Haustein","running_time":"138 minutes","music_by":"Jürgen Knieper David Bowie","edited_by":"Jane Seitz","written_by":"Herman Weigel Kai Hermann Horst Rieck","budget":"$2.7 million"}