{"country":"United Kingdom|United Arab Emirates|Romania|Morocco|","distributed_by":"Metrodome Distribution (UK)|Relativity Media (US)|","Plot":"Set in Iran, the story follows the ambition of Afshin Ghaffarian. During the volatile climate of the 2009 presidential election, Afshin and some friends (including Elaheh played by Freida Pinto) risk their lives and form an underground dance company. The group learned the dancing from videos of Michael Jackson, Gene Kelly and Rudolf Nureyev even though the online videos are banned. Afshin and Elaheh also learn much from each other and learned how to embrace their passion for dance and for one another.[4]","language":"English","box_office":"$432,560[2]","cinematography":"Carlos Catalán","production_company":"CrossDay Productions Ltd. Head Gear Films Lipsync Productions May 13 Films Morocco Film Assistance","directed_by":"Richard Raymond","desert_dancer":"North American theatrical release poster","release_dates":"3 July 2014 (2014-07-03) (Germany)|10 April 2015 (2015-04-10) (United States)|15 April 2016 (2016-04-15) (United Kingdom)|||","Production":"Richard Raymond who is making his full-length debut and is working with acclaimed choreographer Akram Khan, whose work featured in the Olympic opening ceremony at London 2012. Richard Raymond is producing the film through his May 13 Films banner. Freida Pinto undertook an intensive training schedule for the role that comprised eight hours of dance rehearsals every day for 14 weeks.[5] Photo call for the film was held at the Palais des Festivals during the third day of the 65th annual Cannes Film Festival in Cannes, France on Friday May 18, 2012.[6][7] Relativity Media has acquired North America distribution rights to the film [8] at 2013 American Film Market.[9]","produced_by":"Luis Astorquia|Pippa Cross|Izabella Miko|","starring":"Reece Ritchie|Freida Pinto|Nazanin Boniadi|Tom Cullen|Marama Corlett|Akin Gazi|","running_time":"104 minutes[1]","music_by":"Benjamin Wallfisch","edited_by":"Chris Gill|Celia Haining|","Release":"Desert Dancer premiered in Germany on July 3, 2014.[10] It opened the Ischia Global Film and Music Fest in Ischia, Italy on July 13, 2014.[11] The film premiered in Hong Kong on August 28, 2014 and in the United States on April 10, 2015.[12]","written_by":"Jon Croker","budget":"$4 million"}