{"country":"Argentina","Influences":"No actor portrays Dictator Juan Manuel de Rosas and his actions are inferred only from the statements of other characters. This, and his constant presence in portraits, have caused some film critics to compare him to the ubiquitous Big Brother from George Orwell's dystopian novel Nineteen Eighty-Four.One of the themes of the film is politics and censorship. Filming started on the 10th of December, 1983, the day Democracy was re-established in Argentina.[2]During their elopement, Fr. Ladislao and Camila have sexual relations inside a horse-drawn coach. This is derived from a similar scene in the novel Madame Bovary by Gustav Flaubert.","Plot":"The film opens with the statement, \"In memory of Camila O'Gorman and Ladislao Gutiérrez.\"Argentina, c. 1827. Ana Perichon de O'Gorman is brought from imprisonment in a Brazilian convent to house arrest in the hacienda of her estranged son, Adolfo O'Gorman. Adolfo, who despises his mother for having had an adulterous affair decades earlier, treats her with unveiled contempt. Upon meeting her granddaughter, Camila O'Gorman, Ana asks whether she enjoys love stories. Camila responds that she doesn't know any.In 1847, a 23-year-old Camila (Susú Pecoraro), has become a pole of Buenos Aires society. Secretly, Camila has been raised on her grandmother's stories about her affair with former Colonial Viceroy Santiago de Liniers and their surviving love letters. Just as secretly, Camila reads French romance novels and books by political refugees like Esteban Echeverría.She is courted by Ignacio, a wealthy society man with whom she is not in love with. Her fellow socialites, who see marriage as a business arrangement, urge her to not let Ignacio get away. In reply, Camila bursts into tears as she describes her longing to marry for love and for a husband she could feel proud of. Her socialite friends are stunned.Meanwhile, Adolfo has come to enthusiastically support Caudillo Juan Manuel de Rosas, whom he praises for restoring order after the Argentine civil wars of the 1810's and '20's. Camila, however, is horrified by the state terrorism which Rosas routinely uses against real and imagined opposition. She openly expresses these views, which always enrages her father, who constantly reprimands her for doing things that are \"not for women.\" One day, during confession, she meets a Jesuit priest, Father Ladislao Gutiérrez (Imanol Arias). Camila immediately develops a crush on him, but after hearing Fr. Ladislao furiously denounce Rosas' death squads from the pulpit as she wishes she could, she falls deeply in love. Fr. Ladislao first rebukes Camila when she comes on to him and feels deeply ashamed that he returns her feelings. He attempts to do penance with a whip before sinking into a life-threatening fever.During the funeral of her grandmother, Camila learns that Fr. Ladislao is ill and rushes to his bedside. To her shock, she finds him caressing a handkerchief which she had given him, ostensibly as a gift to the poor but really as a token of love. Upon his recovery, Fr. Ladislao finally surrenders to Camila's advances. For a time, they conduct a discreet affair, but Fr. Ladislao is visibly troubled by the hypocrisy of his public priesthood and his private violation of his vows.Abandoning everything, Fr. Ladislao and Camila elope to Corrientes Province, where they pose as a married couple. Fr. Ladislao works as a school teacher and swiftly gains the admiration and gratitude of the village. Camila is ecstatically happy and tells Ladislao how proud she is to be his, \"wife.\" However, Ladislao remains torn between his love for Camila and a deep longing for his abandoned priesthood. During an Easter fiesta, Ladislao is recognized by Father Miguel Gannon, a Buenos Aires priest who angrily greets him with the words, \"God does not forget his chosen. Do you hear me, Father Ladislao Gutiérrez?\"With his troubled conscience brought to a crisis, Fr. Ladislao runs to the village church and screams at the Eucharist in the Tabernacle, \"Why can't You leave me in peace!\" Meanwhile, Father Gannon notifies the village's Police Commandante.The latter, feeling grateful to Ladislao for teaching his children to read, warns Camila that he will do nothing until morning. He urges her and Ladislao to immediately flee across the Brazilian border. Deeply grateful, Camila frantically searches for Fr. Ladislao to tell him the news. When she finds him kneeling in prayer before the altar of the church, she bursts into tears, knowing that he has made his peace with God.The next morning, Fr. Ladislao returns to Camila to say goodbye. Although he says that he still loves her, Fr. Ladislao explains that he must return to Buenos Aires, do penance, and continue his priestly ministry. Visibly ashamed, he apologizes to Camila for what he has done to her. Saddened but unremorseful, she responds, \"I knew what I was doing.\" To both their horror, the Commandante and his men arrive and arrest them both.Meanwhile, Camila's father, Adolfo O'Gorman, is infuriated by how the family name has been dragged through the mud by Camila's actions. Despite the pleas of Ignacio and the rest of the family, he writes to Rosas and demands the death penalty for his daughter. With the Church Hierarchy and his political allies demanding retribution, and his exiled opponents exploiting the scandal , for political gain, Rosas issues a decree that both Camila and Fr. Ladislao are to be shot without trial.In a military prison, Camila and Fr. Ladislao are forbidden to see each other. While imprisoned, Camila learns that she is carrying Fr. Ladislao's child. Heartbroken, she calls out from her cell, \"Ladislao! We are going to have a baby! We are going to have a baby!\" Despite the fact that the Law of Argentina forbids the execution of pregnant women, Rosas refuses to delay Camila's death sentence. The prison chaplain gives Camila glass of holy water to drink and thus baptizes her unborn child. Fr. Ladislao sends her a final letter affirming his love for her and saying that, because they could not be together on earth, they will be reunited in heaven before the throne of God.On August 18, 1848, Camila and Fr. Ladislao are tied to chairs, blindfolded, and carried before a firing squad in the prison courtyard side by side.The soldiers gun down Fr. Ladislao without hesitation, but they initially balk at killing a pregnant woman. When the Commandante threatens to shoot them if they refuse to obey God's will (as interpreted by Rosas), they open fire, riddle Camila's stomach with bullets, and place both bodies into the same coffin.The camera pans over the soldiers, the courtyard, and the Argentine flag, before lingering over Camila and Ladislao's coffin. Their final words are repeated in voiceover: \"Ladislao, are you there?\" - \"By your side, Camila\".","In popular culture":"In 2001, Camila: The Musical, based on the film and with words and music written by Lori McKelvey, debuted in Philadelphia.[7]Camila is also featured in the book Pop Culture in Latin America and the Caribbean written by Elizabeth Gackstetter Nichols and Timothy R. Robbins. The book explores the film and the significance it had.[8]","language":"Spanish","cinematography":"Fernando Arribas","directed_by":"María Luisa Bemberg","camila":"Film Poster","release_dates":"17 May 1984 (1984-05-17)|||||","produced_by":"Lita Stantic","starring":"Susú Pecoraro Imanol Arias Héctor Alterio","running_time":"105 minutes","music_by":"Luis María Sierra","edited_by":"Luis César D'Angiolillo","written_by":"María Luisa Bemberg Beda Docampo Feijóo Juan Bautista Stagnaro"}