{"based_on":"Survival  by You Fengwei","country":"China","distributed_by":"Fortissimo Films (United States)","screenplay_by":"Shi Ping Shi Jianquan Jiang Wen You Fengwei","Plot":"In a small village named Rack-Armor Terrace in Hebei, at the foot of the Great Wall of China, a local peasant called Ma Dasan (played by Jiang Wen) is caught by surprise when a man bursts into his home one night and deposits two men in gunnysacks, instructing him at gunpoint to keep them captive but alive for the next few days and interrogate them. The man, identified only as \"Me\", leaves before Ma can catch a glimpse of him. One of the gunnysacks contains Kosaburo Hanaya (Kagawa Teruyuki), a belligerent Japanese sergeant; the other Dong Hanchen (Yuan Ding), an obsequious Chinese interpreter working for the Japanese Army. Ma hurriedly enlists the help of his fellow villagers. Fearing both the mysterious \"Me\" and the Japanese, the village decides to follow the instructions from \"Me\" and detains the prisoners in Ma's cellar. Hanaya repeatedly attempts to provoke the peasants into killing him, but Dong, fearing for his own life, alters Hanaya's words in translation to make him appear conciliatory.The mystery man fails to return by the eve of Chinese New Year as promised. Six months later, the villagers finally run out of patience and resolve to kill the prisoners. The task falls on Ma after a drawing of lots. Not daring to commit murder, Ma instead hides the prisoners in a watchtower along the Great Wall, where he visits them regularly to bring them food and water. However, an unsuccessful escape attempt by the prisoners reveals Ma's secret to the rest of the village. A bitter argument ensues and the village decides to hire an assassin from town to carry out the deed. Ma enlists the help of an old man known as One Stroke Liu (Chen Qiang), a former Imperial executioner. He is told that being beheaded by Liu feels like a passing breeze, and that the severed head will roll nine times on the ground, blink three times, and smile in a gesture of gratitude for such a painless death. However, Liu fails to harm either prisoner with one stroke. Claiming that it is the will of Heaven, Liu leaves with the prisoners uninjured.By this time, however, Hanaya has lost all his defiance and is filled only with gratitude towards the villagers. He promises to reward the village with two wagons of grain should he be released. The villagers agree and return the prisoners to the Japanese Army encampment in the nearby town. However, the Japanese Army has already made Hanaya a war hero, believing that he was killed in battle. Returning alive after being a prisoner shames the Army. The commander of the encampment, Captain Inokichi Sakatsuka (Kenya Sawada), gives Hanaya a merciless beating but feels honor-bound to fulfill the agreement between the latter and the village. Captain Sakatsuka and his men bring a great bounty of food and wine to the village and hold a feast there that evening, as Ma goes off to fetch his lover Yu'er (Jiang Hongbo) from a neighboring village. During the feast, Captain Sakatsuka demands to have the man who captured Hanaya. He also accuses Ma of sneaking off to fetch resistance fighters. Not given a satisfactory answer, he orders all villagers to be killed and the village to be burned. Ma and Yu'er return on a raft only to find the entire village in flames. Meanwhile, Hanaya is about to commit harakiri before being stopped by Captain Sakatsuka and informed that Japan has recently surrendered, and the war is over.After the Chinese National Revolutionary Army takes back the area, Dong is publicly executed for collaborating with the enemy. Ma, bent on revenge, disguises himself as a cigarette vendor and loiters outside the Japanese encampment, now converted into a POW camp. When two Japanese soldiers come out to buy cigarettes, Ma hacks them with an axe and breaks into the camp, killing more POWs. He finds and pursues Hanaya, but is brought down by guards before he can kill the latter. Major Gao (David Wu), commander of the Chinese Army contingent administering the town, condemns Ma's act as too despicable to deserve death by the hands of a Chinese soldier, and instead orders a Japanese POW to carry out the execution before a massive crowd. Captain Sakatsuka hands a katana to Hanaya, who takes careful aim before delivering the fatal strike. As Ma's head falls to the ground, it rolls nine times, blinks three times, and smiles, just as 'One Strike' Liu's victims were supposed to have done.","language":"Chinese Japanese","cinematography":"Wang Min Zhao Xiaoshi","directed_by":"Jiang Wen","Director's intention":"According to director Jiang Wen, Ma is initially very fearful but does not know the origins of his fear. The turning point comes when he sees his village in flames and his fellow villagers massacred. He then overcomes his own fear and begins longing for death. In the final scene, Ma dies a satisfying death as he has fulfilled his desire.[4]","devils_on_the_doorstep":"American poster for Devils on the Doorstep","release_dates":"12 May 2000 (2000-05-12) (Cannes) 27 April 2002 (2002-04-27)","Production":"The film was inspired by and loosely based on a novella titled Survival by You Fengwei. However, the final screenplay was largely original, with only few similarities to You's novella. Director Jiang Wen and director of photography Gu Changwei made the unique choice of shooting the film in black and white in order to capture the details of the historical era depicted in the film. There were initial worries about the sales and distribution prospects for a black-and-white film, but the production eventually went ahead.The Japanese cast members in the film, two of whom came to know Jiang while on exchange in the Central Academy of Drama in the 1980s, initially expressed concerns with the Japanese war crimes depicted in the film. Jiang spent two weeks discussing the issue with them, and showed them documentaries about the war, including some made by Japanese filmmakers. According to Jiang, the Japanese cast members eventually came to trust him. Jiang also used many non-professional actors and actresses in the film, some of whom were also members of the crew. Jiang himself also played the leading role in the film, which he admitted was a tiring experience. He said he also came to distrust what most of the crew members said about his acting, especially when they were tired and wanting to finish for the day.[4]An executive director from Beijing Zhongbo Times Film Planning, one of the three investors in the film, said in an interview that the total expenditure on the film approached US$3.9 million, way above the original budget, which he did not specify.[1] Later, however, a general manager from the same company told a reporter that the initial budget was US$2 million, but the final expenditure exceeded this number by over 30 percent.[2]","produced_by":"Jiang Wen Dong Ping Yang Hongguang Liu Xiaodian Liu Xiaodong","starring":"Jiang Wen Kagawa Teruyuki Yuan Ding Jiang Hongbo","running_time":"139 minutes","music_by":"Cui Jian Liu Xing Li Haiying","edited_by":"Zhang Yifan Folmer Wiesinger","budget":"US$3.9 million[1] US$2.6 million[2]","Exhibition and reception":"Devils on the Doorstep opened on 12 May at the 2000 Cannes Film Festival where it won second place in the Grand Prix and was nominated for the Golden Palm.[3] However, the film was subsequently banned in China by the Chinese Film Bureau. According to director Jiang Wen, both the Japanese producers of the film and the Chinese Film Bureau expressed similar concerns: \"Don't let Japanese soldiers kill people; Chinese people shouldn't be so dumb; Japanese soldiers shouldn't be kept as prisoners.\"[5] A report confirmed that the authorities complained that \"Chinese civilians [in the movie] don't hate the Japanese [prisoner]\", but instead are \"as close as brothers\" with the latter.[6]Time Asia reported that the Chinese Film Bureau was furious at Jiang for having entered the film in the Cannes Film Festival without its permission. The Film Bureau reportedly sent two officials to Cannes to try to dissuade the festival from screening Devils on the Doorstep and demanded that Jiang hand over the negative (which was brought to Australia for post-production). There were also reports from Asian film circles that the authorities planned to punish Jiang by forbidding him to work in China for seven years.[7] A representative from the Chinese Film Bureau confirmed that Jiang's status was \"under review\" and that China suspected Jiang was awarded his prize at Cannes for \"political reasons\".[8]It was not known publicly if the seven-year ban was eventually imposed, but Jiang did not produce any directorial work between Devils on the Doorstep and the 2007 production The Sun Also Rises. However, he did act in several films, including The Missing Gun (2002), which was a huge commercial success in China. He was also nominated for Best Actor in the official Huabiao Awards in 2004 for his role in Warriors of Heaven and Earth (2003).The version shown at the 2000 Cannes Film Festival was three hours long. This was a working version that was later cut to 139 minutes with director Jiang Wen's full participation in order to enhance the film's commercial prospects and to tighten the storyline, which he did not have time to do before the Cannes premier.[9]The film was booked for showing on 3 November 2014 at the Cornerhouse Manchester (UK) as part of Asia Triennial Manchester 14, and a 161-minute version arrived, somewhat to the organisers' surprise. The film was well received at this screening.Devils on the Doorstep was commercially released in Japan on 27 April 2002, further delaying a possible lift of ban on the film in China.[10] All major newspapers in Japan gave the film mostly positive reviews. The liberal leaning Asahi Shimbun said the film \"illustrates and examines the weakness of human nature\". The Mainichi Shimbun called the film Jiang's \"overarching question on human nature\". The conservative Yomiuri Shimbun also complimented Jiang, Kagawa Teruyuki and Kenya Sawada, saying their acting was \"colorful\" and \"believable\". Inevitably, however, some reviewers voiced displeasure after viewing the film, saying that it \"further estranges the Sino-Japanese friendship that was seriously damaged in the past war\".[11]Many Japanese media reports on the film also mentioned Jiang's past visits to the controversial Yasukuni Shrine, where spirits of Japanese soldiers, including some convicted of war crimes, are housed. The news sparked a new round of debate in China, where criticism of famous actress Zhao Wei for appearing on the cover of Bazaar in a dress with a Japanese military flag design had newly subsided. Jiang responded that he visited the shrine several times to collect resources for Devils on the Doorstep.[12]According to Box Office Mojo, Devils on the Doorstep opened in a single cinema in the United States on 18 December 2002. In its 65 days in theater, the film grossed a meager US$18,944.[13]Devils on the Doorstep was screened at the National Film Theatre in London, United Kingdom on 28 March and 29 March 2006. A dialogue between Jiang Wen and British director Anthony Minghella (The English Patient, The Talented Mr. Ripley) was initially arranged to take place after the screening on 28 March, but Jiang was eventually unable to be present. After watching the film, Minghella gave it positive remarks, calling it \"candid, calm, yet filled with danger\".[14]A DVD featuring subtitles in English and an introduction by American director Steven Soderbergh (Traffic, Ocean's Eleven) was released on 19 April 2005 in the United States by Home Vision Entertainment."}