{"country":"United States","distributed_by":"New Line Cinema1","Plot":"The film opens and a scene of black-heeled shoes are seen. Voices are discussing food and recipes when the search for Molly (Tina Majorino) ensues. She is located under the serving table, by her grandfather who joins her. It is then understood that Molly's mother, Annie, has suddenly died; this gathering is the post-funerary \"pot-luck\" at the home of the now-widowed Manny Singer (Ray Liotta). Grandfather Harry (Don Ameche) stays under the table with Molly as they are slowly joined by (and we are introduced to) the other main cast including Manny's mother, the old world Eva (Erica Yohn).As his friends and family leave after the gathering, it is apparent that this new situation is going to be trying. A newly-widowed man and his seven-year old girl, who will no longer speak, due to her mother's passing, trying to find a way to move forward. There is a need for a housekeeper/nanny so that Manny can return to work (and to also crank out selling jingles for a living lest his job becomes shaky—per his best friend and boss, Sid (Larry Miller).After a failed trial run with a nanny of sorts, Corrina Washington (Whoopi Goldberg) interviews for the position. Since her mother's death, Molly has not only refused to speak but does not even acknowledge people. She responds to Corrina and Manny hires her as a housekeeper. Very quickly a strong bond is formed between them. Corrina works out a system to \"talk\" with her without making her speak and also helps her find a pet turtle they name Lois.Corrina watches the early struggles of life after Annie. She asks about an unfinished grocery list and Manny admits to being unable to erase Annie's handwriting from the board. Late one evening a distraught Manny lies and says Annie is in the bathtub, rather than admit to her sudden passing. Upon hearing this lie, Molly runs to the tub hoping to see her. Corrina sees the lonely Molly sit quietly in the empty tub while Manny buries his head in his hands as he sits in the chair Annie purchased for their home.As Corrina adjusts to her new role, Manny and Molly adjust to her ways too. Manny, overhearing her discussing Heaven, asks that she avoid the topic. He and Annie were atheists and he does not want Molly to believe in a god he does not believe in. Corrina does not disobey but notes that she too will just have to explain to Molly that her mother is in the bathtub instead of facing reality. Meanwhile, while watching TV, Molly sees a commercial that notes how deadly cigarettes are and watching her father smoke scares her. She begins hiding his cigarettes.While Corrina is making Manny's bed, Molly speaks for the first time noting the spot where her mother used to sleep. When consoling Molly about Annie, Corrina explains that she is with the angels and perhaps Manny is jealous of the ones who get to spend all day with her. Molly finds comfort in knowing she is somewhere happy. That night, when Manny comes home, Molly tells him about the dinner she has helped make. Hearing the sound of her voice brings joy to him. Corrina stays for dinner upon Molly's insistence and she and Manny discover a common bond in music.Molly begins to spend time with Corrina's sister, Jevina, her brother-in-law, Frank, her nephew, Percy, and her nieces, Lizzie and Mavis. They take her to church and welcome her into their home. The children welcome her and they become close friends. Meanwhile, Manny is introduced to Jenny (Wendy Crewson), a perky white woman with two unruly sons. Jevina wants her to date a black man, Anthony. Corrina says she is uninterested and, \"in the words of Gertrude Stein, girl, there ain't no \"there\" there.\"Manny is still struggling with losing Annie and although Sid feels Jenny is the perfect fit, he is not ready to date. Molly begins talk about Heaven and her mother. A frustrated Manny tells her that Heaven is just something that people make up so they won't feel sad anymore. She replies, \"Well, what's wrong with that?\" and starts asking about Annie. When he refuses to talk about her she cries, \"She's disappearing! She's almost gone!\"A frightened Molly must return to school and to give her some confidence, Corrina tells her to remember she is \"Molly Singer and there is no one in the world better than she is.\" While coloring family pictures, she is mocked for adding Corrina to her picture. She repeats Corrina's message to herself but she is visibly hurt. She runs into Corrina's arms at the end of the day, desperate to go home. Manny and Corrina have an exchange about stealing each other's cigarettes, not knowing how they can go through so many so quickly. That night, Molly awakes from a nightmare where she could not get her mother to turn around. Corrina and Manny run to her side but she is scared and angry. She tells her father, \"It's all your fault she's gone! I hate you\" and Corrina tells her she is allowed to be mad. Manny admits to her how hurt he is about losing Annie and how much he misses her too. That night Jevina chastises Corrina for pretending to become a part of this new family.A terrified Molly begs Corrina to let her stay home from school and she secretly agrees. At work, Manny struggles with a new project for Jell-O pudding. Corrina spends more time with them and she and Manny slowly discover they are more compatible with each other than anyone else. He confides in her about Annie and she talks about her long gone former husband. They share a love of music and she even assists him on his new jingle. After a successful advertising campaign, he comes home with flowers for Molly as well as Corrina. Their private celebration is interrupted by a visit from Jenny, which Corrina takes as a cue that she is not meant to stay. Molly starts hiding her father's cigarettes in the sandbox as for revenge of disliking what he has done.The next day, a flustered Corrina goes to work where Manny apologizes for Jenny's meeting. He admits all he wanted was to celebrate with Molly and Corrina. As they say goodbye, they share a kiss on the cheek. Manny's nosey neighbor sees this embrace. Corrina and Manny begin to fall in love and, in 1950s America, face difficulties as an interracial couple. A night out for dinner leads to racial slurs from fellow patrons that Molly does not understand. She, however, is taken with Corrina and she asks Harry to make sure that Manny marries Corrina one day.Manny buys Corrina an album one night, after she admits her interest in writing liner notes and Jevina finds the gesture inappropriate. She thinks that Manny and Corrina are wrong for each other. Molly also struggles with tension when she unknowing calls Lizzie a racial slur, not knowing what her words mean. Manny's nosey neighbor tells Eva about the budding romance and she tells Manny that she is concerned for him. He thinks Corrina is the best thing in the world for Molly.After losing Molly's kite, Manny finds it in the backyard next to dozens and dozens of cigarettes. He confronts her and she says that she doesn't want them to kill him. He promises to be there for her and hugs her. A moving truck delivers more furniture to the house but a couch won't fit in through the door so it remains on the lawn. That night, Corrina and Manny talk about their last words with their spouses and share a moonlight dance. They share a kiss that is witnessed by a glowing Molly.After weeks of not attending school, Corrina gives Molly a scrapbook with a turtle to keep her school items in, suggesting it's almost time for her to go back. She does not respond to the gesture as she is not yet ready to. After a call from Molly's teacher, Manny finds out that Corrina had been letting her skip school. Corrina felt she wasn’t ready to go back. In a fit of anger, he tells her that she is not Molly's mother and fires her, taking a heartbroken Molly home.Molly becomes withdrawn again, and soon after, Manny learns that Harry has died. Jenny tries to win over him again but he is not interested. After the funeral, he goes to visit Corrina at her house to tell her of Harry's passing and to properly apologize. After an unsuccessful talk, she overhears his not-so quiet prayers to God to help him out. She gives him the scrapbook for Molly and he hopes she will give it to her in person. She informs him that she quit and he assures her that she was replaced. They embrace and he begins to kiss her. She brings him inside to formally meet her family.The film ends with Molly singing \"This Little Light of Mine\" in order to cheer up Eva. Finally, she gives in and joins her in the joyful song.","language":"English","Reaction":"The film received mixed reviews from many film critics criticizing Nelson's failure to fully address the complications surrounding a romantic interracial relationship in the 1950s. Roger Ebert confessed that he enjoyed it but wrote, \"...seems almost as shy as the characters about the charged issues of race and romance. After it was over I felt that, yes, it was warm and good-hearted, but there was more of a story there to be told.\"[2] Janet Maslin of The New York Times praised the actors and actresses for their work on it but echoed a similar criticism regarding Manny and Corrina's relationship, \"The affection between them is evident, but not even by the end of her story has Ms. Nelson decided what sort of affection it is. That may be true to life, but for an otherwise mainstream movie, it's trouble.\"[3] It currently holds a 65% rating on Rotten Tomatoes.","box_office":"$20,164,171","cinematography":"Bruce Surtees","directed_by":"Jessie Nelson","corrina,_corrina":"Theatrical release poster","release_dates":"August 12, 1994 (1994-08-12)|||||","Box office":"The film was not a box office success. It grossed $20,160,000 (USA) [4]","produced_by":"Paula Mazur Jessie Nelson Steve Tisch","starring":"Whoopi Goldberg Ray Liotta Tina Majorino","running_time":"115 minutes","music_by":"Rick Cox","edited_by":"Lee Percy","written_by":"Jessie Nelson","budget":"$22 million"}