{"based_on":"Characters created by Judi Barrett Ron Barrett","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"John Francis Daley|Jonathan Goldstein|Erica Rivinoja|","story_by":"Phil Lord|Chris Miller|Erica Rivinoja[1]|","Plot":"After Flint Lockwood and his friends save the world from the food storm in the first film, super-inventor Chester V, the CEO of Live Corp and Flint's childhood idol, is tasked to clean the island. He relocates Flint, his friends, and the citizens of Swallow Falls to San Franjose, California. Unbeknownst to Flint, the FLDSMDFR survived the explosion and landed in the center of the island, and Chester is determined to find it. Chester invites Flint to work at Live Corp, where he meets Chester's assistant Barb, a talking orangutan with human intelligence. Six months later, Flint humiliates himself during a promotion ceremony when his invention, the \"Celebrationator\", explodes. Meanwhile, Chester is informed that his search-parties on the island have been attacked by monstrous cheeseburgers named cheespiders (a combination of a cheeseburger and a spider) which are trying to learn how to swim. Seemingly fearing the world's inevitable doom, Chester tasks Flint to find the FLDSMDFR and destroy it once and for all. Despite Chester's demands to keep the mission classified, Flint recruits his girlfriend, meteorologist Sam Sparks; her cameraman Manny; police officer Earl Devereaux; Steve, a monkey who communicates via a device on his chest; and \"Chicken\" Brent. Much to Flint's dismay, his father Tim joins the crew and they travel to Swallow Falls on his fishing boat.Upon arriving back at Swallow Falls, they notice that a jungle-like environment made of food has overgrown the island. Tim stays behind while Flint and the others investigate, finding a vast habitat of living food animals called foodimals and meet a cute strawberry nicknamed Barry. Tim, searching for sardines at his abandoned tackle shop, encounters a family of humanoid pickles and bonds with them by fishing. Chester discovers that Flint allowed his friends to join him on the mission, so he travels to the island with Barb, chagrined and determined to separate them, and he arrives just in time to save them from a Cheespider. Flint then finds his old lab and invents a device to find the FLDSMDFR. After escaping a Tacodile attack, Sam notices that the foodimal was protecting its family, and begins to suspect Chester is up to no good. Sam attempts to convince Flint to spare the foodimals, but Flint is intent on impressing Chester. Sam leaves in anger, and Flint's other companions go with her. In the jungle, Manny confirms Sam's suspicions when he reverses the Live Corp logo to reveal the \"Live\" as \"Evil\" spelled backwards. In addition, Sam proves that the foodimals mean no harm by taming a Cheespider. They also learn that the foodimals had known the truth about Live Corp before. Upon realizing Chester's intentions, the group is then ambushed by Evil Corp employees.Flint finds the FLDSMDFR, but notices a family of cute, friendly marshmallows and becomes hesitant to destroy the machine. Chester immediately seizes control of the FLDSMDFR and announces his plot to make his updated line of food bars out of the foodimals. A crushed Flint is knocked into the river but rescued by the marshmallows. Flint is taken to his father, and they and the foodimals all work together to allow Flint and Barry to infiltrate the Evil Corp building that is under construction on the island. Barry frees the trapped foodimals while Flint confronts Chester, who threatens to make food bars out of his friends. Chester makes numerous holograms of himself to overwhelm Flint, but Flint uses the Celebrationator to expose the real Chester, allowing Flint to rescue his friends. An army of foodimals led by Barry arrive and fight Chester's employees. Chester tries to make off with the FLDSMDFR, but is thwarted by Barb, who has a change of heart and Chester gets eaten by a Cheespider. With the island safe from Chester V and Evil Corp destroyed, Flint returns the FLDSMDFR to its place and frees it from Chester's control and the foodimals continue to live in peace as more are born. The film ends with Flint fishing with his father for the first time, finding it enjoyable. In the mid-credits scene, Barb was trying to asking out Steve and he was trying to eat a banana sandwich.","language":"English","Reception":"On review aggregator site Rotten Tomatoes, the film has a rating of 70%, based on 116 reviews, with an average rating of 6.4/10. The site's consensus reads: \"While not as clever or inventive as its predecessor, Cloudy with a Chance of Meatballs 2 compensates with enough dazzling visuals to keep younger viewers entertained.\"[31] Another aggregator, Metacritic, gave the film a score of 59 out of 100, based on 31 critics, indicating \"mixed or average reviews\".[32]Michael Rechtshaffen of The Hollywood Reporter gave the film a positive review, saying \"While not as delightfully breezy as the original, an engaging voice cast and hordes of 'Foodimals' still manage to serve up a tasty sequel.\"[33] Linda Barnard of the Toronto Star gave the film three out of four stars, saying \"At its heart, Cloudy with a Chance of Meatballs 2 is fun, even if it is occasionally so chaotic it tramples the movie's flow like a herd of stampeding Buffaloafs.\"[34] Michael Phillips of the Chicago Tribune gave the film three out of four stars, saying \"The movie is better in every respect than the original Cloudy With a Chance of Meatballs. It's also more fun than all three Ice Ages; Monsters University; Planes; Epic; Despicable Me 2; and though I could go on, I won't.\"[35] Jordan Hoffman of the New York Daily News gave the film four out of five stars, saying \"Cloudy 2 is loud, weird and chaotic — just as kids like it. There's plenty of screaming and running while arms flail about, and even the obligatory message bit is given a healthy dose of 'yeah, yeah, yeah.' Your car ride back from the theater won't be a quiet one, but sometimes it's good to have a sugary treat.\"[36] Dave McGinn of The Globe and Mail gave the film two out of four stars, saying \"Unfortunately, the film promises more fun and laughs than it delivers, and this meal tastes like too many that have gone before it.\"[37] Bill Goodykoontz of The Arizona Republic gave the film four out of five stars, saying \"It's the rare [sequel] that takes the spirit of the original and runs with it, coming up with something uniquely good in its own right.\"[38]Tim Robey of The Daily Telegraph gave the film three out of four stars, saying \"For all its properly surreal mayhem, this flick isn't quite as nimble or emotionally rounded as its predecessor.\"[39] Sean O'Connell of The Washington Post gave the film one and a half stars out of four, saying \"Kids will chuckle, for sure. But parents who were pleasantly surprised by the original film's intelligence will miss Lord and Miller's guiding hands, as what once felt so funny now leaves a stale taste.\"[40] Kyle Smith of the New York Post gave the film one out of four stars, saying \"Whelk, I hope the makers of Cloudy With a Chance of Meatballs earned a nice celery, but I'm afraid they made a hash of things. A hash seasoned with oy sauce.\"[41] Rafer Guzman of Newsday gave the film one and a half stars out of four, saying \"Mostly, Cloudy 2 relies on the usual noxious recipe for junky kid flicks: loud noise, pop music and poop jokes.\"[42] Miriam Bale of The New York Times gave the film three out of four stars, saying \"At times it felt as if this film might challenge Pixar's decade-long reign, but that promise wanes. Instead, the movie is sometimes so strange, colorful and wildly cute that it may end up becoming a Yellow Submarine for a new generation.\"[43] Tom Russo of The Boston Globe gave the film two out of four stars, saying \"It's another brightly rendered effort, but, as the title indicates, a lot of the real creativity seems to have been used up the first time around.\"[44] Mike Clark of USA Today gave the film two and a half stars out of four, saying \"There's not a surprise or moment of tension to be found here, but the film is all energy and color that makes the discomfort of 3-D glasses seem worth it.\"[45]Jocelyn Noveck of the Associated Press gave the film three out of four stars, saying \"Your enjoyment will probably depend on your tolerance of those countless food-based puns dreamed up by script writers Erica Rivinoja, John Francis Daley and Jonathan Goldstein. Some might find these tiresome, but let's just note here that this is a kid movie, and KIDS LOVE PUNS. So they laugh at 'There's a leek in the boat.' And they laugh even more the second time.\"[46] A.A. Dowd of The A.V. Club gave the film a C, saying \"Like too many sequels, this second helping of Meatballs confuses bigger for better, piling on the action but misplacing much of the original's charm.\"[47] David Hiltbrand of The Philadelphia Inquirer gave the film three out of four stars, saying \"This scrumptious sequel follows the same recipe as the 2009 original.\"[48] Peter Hartlaub of the San Francisco Chronicle gave the film two out of four stars, saying \"Cloudy With a Chance of Meatballs 2 is a humorous yet unfocused romp, so unwilling to settle on a single theme that hyperactivity medication should be handed out with the 3-D glasses.\"[49] Matt Patches of Film.com gave the film 7.1 out of 10, saying \"The 2009 original separated itself from the Pixar and Dreamworks competition with a joke-first approach. The sequel quadruples the recipe, with gags on top of gags on top of gags in a way only animation could achieve. Like a foodie Jurassic Park conjured up by Tex Avery, Cloudy 2 is a sight to behold ... as long as your brain hasn't turned to mush by the halfway point.\"[50]Amy Nicholson of The Village Voice gave the film a positive review, saying \"The Cloudy with a Chance of Meatballs franchise takes its comic cues from The Muppets and Pee Wee's Playhouse, kids' shows that ripen as their audience matures.\"[51] Keith Staskiewicz of Entertainment Weekly gave the film a B, saying \"While no one was exactly crying out for second helpings of this animated meat-eorology franchise, Cloudy With a Chance of Meatballs 2 is charming enough on its own not to feel like just reheated leftovers.\"[52] Steve Davis of The Austin Chronicle gave the film two out of five stars, saying \"For both kids and adults, CWCM2 is little more than a vague memory as soon as it's over.\"[53] Peter Debruge of Variety gave the film a positive review, saying \"What Erica Rivinoja, John Francis Daley and Jonathan Goldstein's script lacks in lingering nutritional value, it compensates for with amusing food puns. If nothing else, the pic's zany tone and manic pace are good for a quick-hit sugar high.\"[4] Betsy Sharkey of the Los Angeles Times gave the film three and a half stars out of five, saying \"Honestly, anyone who can pull off a running joke about leeks that does not make you gag, and is in fact a silly delight, deserves props.\"[54] Bill Zwecker of the Chicago Sun-Times gave the film three out of four stars, saying \"Unlike so many sequels, this fun-filled 3D adventure is sure to entertain younger kids but also charm the adults who will be accompanying them to the multiplexes.\"[55]Cloudy with a Chance of Meatballs 2 grossed $119,793,567 in North America, and $154,532,382 in other countries, for a worldwide total of $274,325,949.[6] Its budget was reported at $78 million,[6] while Sony spent $48.2 million for the film's marketing in the United States, and $41.3 million in other countries.[56]In North America, the film earned $9.3 million on its opening day,[57] and opened to number one in its first weekend, with $34,017,930.[58] In its second weekend, the film dropped to number two, grossing an additional $20,950,192.[59] In its third weekend, the film dropped to number three, grossing $13,774,742.[60] In its fourth weekend, the film dropped to number five, grossing $9,672,791.[61]","box_office":"$274.3 million[6]","production_company":"Sony Pictures Animation","directed_by":"Cody Cameron|Kris Pearn|","Video game":"A video game titled Cloudy with a Chance of Meatballs 2, published by GameMill Entertainment, was released on September 24, 2013 for Nintendo DS and Nintendo 3DS.[66] A free mobile game titled Cloudy with a Chance of Meatballs 2: Foodimal Frenzy was developed by PlayFirst and released for both iOS and Android devices.[67]","release_dates":"September 27, 2013 (2013-09-27)|||||","Production":"The first news of the sequel came out in April 2010, when website io9 reported that the original directors, Phil Lord and Chris Miller, won't return for the sequel.[11] In December 2011, it was reported that Cody Cameron, the story artist on the first film, and Kris Pearn, the head of story on the first, would direct the sequel, with Lord and Miller serving as exec-producers. John Francis Daley, Jonathan Goldstein, and Erica Rivinoja[2] wrote the screenplay, which is based on an original story idea, not on Pickles to Pittsburgh, Ron and Judi Barrett's follow-up book.[12] In February 2012, it was announced that the sequel would be titled Cloudy 2: Revenge of the Leftovers,[13] but it was later retitled Cloudy with a Chance of Meatballs 2.[14] The film was originally scheduled for release on December 20, 2013,[15] then pushed to February 7, 2014,[16] before moving up to September 27, 2013.[7]Bill Hader, Anna Faris, James Caan, Andy Samberg, Neil Patrick Harris, and Benjamin Bratt reprised their roles.[2] The role of Earl, the town cop, was taken over by Terry Crews, since Mr. T declined to return.[8] Kristen Schaal joined the cast to voice Barb, a talking and lipstick-wearing orangutan with a human brain.[9] Will Forte, who voiced Joseph Towne in the first film, voices Chester V, a world-famous super-inventor who commands Barb and is the head of the Live Corp Company.[8] On January 17, 2013, concept art from the film was released.[17]The music was composed by Mark Mothersbaugh.[3] Cody Simpson provided a single \"La Da Dee\", which was played at the film's end credits. Simpson also performed in a music video that incorporated footage from the film.[1] Paul McCartney's single, \"New\", from his 2013 album, was featured in the film.[18]","cloudy_with_a_chance_of_meatballs_2":"Theatrical release poster","produced_by":"Pam Marsden[1]|Kirk Bodyfelt[2]|","starring":"Bill Hader|Anna Faris|James Caan|Will Forte|Andy Samberg|Benjamin Bratt|Neil Patrick Harris|Terry Crews|Kristen Schaal|","running_time":"95 minutes[5]","music_by":"Mark Mothersbaugh[3]","edited_by":"Robert Fisher, Jr.[4]","Release":"Cloudy with a Chance of Meatballs 2 was released theatrically on September 27, 2013.[7]In promotional events before the film's release, Sony Pictures Animation partnered with some produce companies to provide more than 200,000 pounds (91 t) of produce for Feeding America's action to help children and families in need. Several food packing events across the country were organized, with Anna Faris and Will Forte attending the main one in Los Angeles.[20] Sony teamed up with marketing partners in the United States to promote the film through Subway Kids Meals with a set of 6 customized bags.[21]Cloudy with a Chance of Meatballs 2 was released on DVD and Blu-ray on January 28, 2014.[22] The home media was accompanied with four short animated films based on the main feature: Super Manny, Earl Scouts, Steve's First Bath, and Attack of the 50-Foot Gummi Bear.[22] Two of the shorts, Super Manny and Earl Scouts, were already released online before the media release, premiering in October 2013 on Univision[23][24][25] and Fandango,[26][27][28] respectively. David Feiss directed all four shorts,[29] which feature a computer-generated wraparound animation and a hand-drawn animation, provided by Six Point Harness.[30]","budget":"$78 million[6]"}