{"Cast":"Peppermint Patty and 5 have silent roles. Shermy is credited in the opening titles and appears in several scenes but is never heard as well.","country":"United States","distributed_by":"National General Pictures","Plot":"When Charlie Brown's baseball team loses the first Little League game of the season, he becomes convinced that he will never win anything. Linus encourages him to maintain a positive attitude and suggests that people learn more from losing. When Charlie Brown remains morose (\"That makes me the smartest person in the world,\" he says), Linus assures him that he will eventually win at something...but then promptly makes a liar of himself by beating Charlie at a game of tic-tac-toe. That night, Snoopy has a nightmare where he is a World War I flying ace, and is shot down while fighting an aerial battle with an unshown enemy (presumably the Red Baron), and he takes over Charlie Brown's bed. When Charlie Brown stops at Lucy's psychiatric help booth, she prepares slides to show him all of his faults; the experience only leaves him more depressed. On the way to school the next day, Lucy jokingly suggests that Charlie Brown enter the school spelling bee. Linus, however, considers it a good idea and encourages him despite the jeers of Lucy, Violet, and Patty (\"Failure Face\").Charlie Brown nervously enters the spelling bee, and he defeats the other children in his class when he spells insecure, a word he considers his trademark. As Charlie Brown studies for the school championship, he and Linus sing a spelling mnemonic (\"I Before E\") as Snoopy accompanies them on a Jew's harp. In class the next day, Charlie Brown freezes when challenged with perceive, but he recovers when Snoopy plays the song's accompaniment outside the school. Crowned champion, the other kids cheerfully follow him home and sing (\"Champion Charlie Brown\"). Lucy proclaims herself his agent, and when his friends suggest that he continue studying, he is confused. They tell him that he must now take part in the National Spelling Bee in New York City, and he is again filled with self-doubt. As Charlie Brown leaves, Linus reluctantly offers him his blanket for good luck, and the other kids cheer him.Back at home, Linus suffers terrible withdrawal after being separated from his blanket. Unable to withstand it, he pleads with Snoopy to go to New York City and help him recover it. The two meet with an exhausted Charlie Brown at his hotel room, and he apologizes for not knowing where he left Linus' blanket. As Linus checks the New York Public Library in vain, Snoopy engages in a fantasy ice-skating routine at Rockefeller Center. The two reunite and return to Charlie Brown, only to find him absentmindedly using the blanket as a shoe-shine cloth. Ecstatic to have his blanket back, Linus joins Snoopy in the audience as Charlie Brown competes; the other children watch the contest at home on television. One-by-one, the other contestants are eliminated until only Charlie Brown and one other boy remain who looks like \"Schroeder\". After correctly spelling several words, Charlie Brown is eliminated when he misspells beagle as in B-E-A-G-E-L. Besides it was a simple word, snoopy is a beagle.Depressed, Charlie Brown returns home, along with Linus and Snoopy, but unlike the crowd of people that saw them off, no one is there to greet them when their bus pulls in. They trudge home, and the next day, Linus visits Charlie Brown. Sally tells him her brother has been in his room all day with the shades down and refuses to see or talk to anybody. Linus tells Charlie Brown that the other kids missed him at school and that his baseball team finally got their first win of the season, but Charlie Brown says he will never return to school again. As Linus leaves, he points out that the world did not end despite Charlie Brown's failure. Charlie Brown thinks for a moment, gets dressed, and goes outside. He sees the other children playing, and when he spots Lucy as she plays with a football which is the same one he failed to kick earlier, he sneaks up behind her to kick it. She pulls it away before he can, and welcomes him home and the two look at the audience before the screen fades out.","Accolades":"The film was nominated for an Academy Award for Best Original Song Score, but lost to The Beatles' Let It Be.","language":"English","Reception":"The film was well received by critics and holds a 94% rating at Rotten Tomatoes.[3]Time praised its use of \"subtle, understated colors\" and its scrupulous fidelity to the source material, calling it a message film that \"should not be missed.\" The New York Times' Vincent Canby wrote: \"I do have some reservations about the film, but it's difficult—perhaps impossible—to be anything except benign towards a G-rated, animated movie that manages to include references to St. Stephen, Thomas Eakins, Harpers Ferry, baseball, contemporary morality (as it relates to Charlie Brown's use of his 'bean ball'), conservation and kite flying.\"[4]A 1971 Associated Press story argued the success of A Boy Named Charlie Brown \"broke the Disney monopoly\" on animated feature films that had existed since the 1937 release of Snow White and the Seven Dwarfs. \"The success of 'Peanuts' started a trend,\" animation producer Fred Calvert told the AP. \"But I hope the industry is not misled into thinking that animation is the only thing. You need to have a solid story and good characters, too. Audiences are no longer fascinated by the fact that Mickey Mouse can spit.\"[5]The movie was a huge success at the box office, receiving $12,000,000.[6][7] The movie premiered at the Radio City Music Hall.","box_office":"$6,000,000 (Rentals) $12,000,000[2]","production_company":"Cinema Center Films Lee Mendelson Films Melendez Features United Feature Syndicate","directed_by":"Bill Melendez","Home media":"A Boy Named Charlie Brown was released on VHS in 1985, 1992, and late 1999 before making its Region 1 DVD debut in anamorphic widescreen on March 28, 2006, by Paramount Home Entertainment/CBS Home Entertainment (co-producer Cinema Center Films was owned by CBS). The DVD has more than six minutes of footage not seen since the 1969 test screening and premiere. The footage consists of new scenes completely excised from earlier home video releases (VHS, CED Laserdisc, Japanese DVD) and TV prints — most notably, a scene of Lucy's infamous \"pulling-away-the-football\" trick after her slide presentation of Charlie Brown's faults (and her instant replay thereof), as well as extending existing scenes. The film was released on Blu-ray in September 2015 along with Snoopy, Come Home!.[8] The film earned $6 million in rentals [9][10]Warner Home Video did not release the film on the box set Peanuts 1960s Collection, as the four feature films were not included in the WB/Peanuts deal (CBS/Paramount still manages the Peanuts theatrical backlog as of the present).","release_dates":"December 4, 1969 (1969-12-04)|||||","Production":"The film was partly based on a series of Peanuts comic strips originally published in newspapers in 1966. That story had a much different ending: Charlie Brown was eliminated in his class spelling bee right away for misspelling the word maze (\"M-A-Y-S\" while thinking of baseball legend Willie Mays), thus confirming Violet's prediction that he would make a fool of himself. Charlie Brown then screams at his teacher in frustration, causing him to be sent to the principal's office (A few gags from that storyline, however, were also used in You're in Love, Charlie Brown).A Boy Named Charlie Brown also included several original songs, some of which boasted vocals for the first time: \"Failure Face\", \"I Before E\" and \"Champion Charlie Brown\" (Before this film, musical pieces in Peanuts specials were primarily instrumental, except for a few traditional songs in A Charlie Brown Christmas.) Rod McKuen wrote and sang the title song. He also wrote \"Failure Face\" and \"Champion Charlie Brown\".The instrumental tracks interspersed throughout the movie were composed by Vince Guaraldi and arranged by John Scott Trotter (who also wrote \"I Before E\"). The music consisted mostly of uptempo jazz tunes that had been heard since some of the earliest Peanuts television specials aired back in 1965; however, for A Boy Named Charlie Brown, they were given a more \"theatrical\" treatment, with lusher horn-filled arrangements. Instrumental tracks used in the film included \"Skating\" (first heard in A Charlie Brown Christmas) and \"Baseball Theme\" (first heard in Charlie Brown's All-Stars). Guaraldi and Trotter were nominated for an Academy Award for Best Original Score for their work on A Boy Named Charlie Brown.The segment during the \"Skating\" sequence was choreographed by American figure skater Skippy Baxter. A segment during the middle of the film, in which Schroeder plays the second movement of Beethoven's Sonata Pathétique, had piano performed by Ingolf Dahl.The film also features a Jew's harp, which Snoopy plays to help Charlie with his spelling.The French-language version replaces Rod McKuen's vocals with a French version sung by Serge Gainsbourg, \"Un petit garçon nommé Charlie Brown\".A soundtrack album was released on the Columbia Masterworks label in 1970.A Boy Named Charlie Brown, while directed and produced by the same team of Bill Meléndez and Lee Mendelson, who were responsible for all the Peanuts television specials (Phil Roman directed later TV specials starting around the mid-1970s), has many different aspects that most of the specials did not explore in a visual sense. The film itself has moments where there is rotoscoping prevalent, as in the sequence when Snoopy skates, and bleached-out silhouettes of real hockey players are visible behind him. Some backgrounds have a pop art feel, similar to much animation of the late 1960s, as in \"The Star-Spangled Banner\" sequence, where the images are purposely chaotically edited, or the sequence where Schroeder plays Beethoven on his piano, which effects a surrealistic quality similar to Disney's Fantasia.There also seems to be a strong Andy Warhol influence, wherein actual photographs appear to have been painted over in semi day-glo psychedelic colors (this is particularly evident during the film's closing credits). Melendez, who had previously worked with Bob Clampett on cartoons back in the 1940s, also uses garish colors in some sequences, which takes its cues from many Clampett backgrounds, particularly a Warner Bros. cartoon called The Big Snooze which was directed by Clampett and which Melendez had also worked on. Many backgrounds are also rendered in watercolor, or simple pen strokes, or fine lines, or sometimes all three at once. There are scenes where colors will change solidly and erratically, as witnessed by the Snoopy \"Red Baron\" sequence in the film. Perspective and horizon points are showcased in the \"I Before E\" scene. Split screen is also used to much effect in A Boy Named Charlie Brown, as well. But even with all these theatrical enhancements, at its core, the film still has the look and feel of many of the Peanuts television specials.","produced_by":"Lee Mendelson","starring":"Peter Robbins Pamelyn Ferdin Glenn Gilger Andy Pforsich","running_time":"86 minutes","music_by":"Vince Guaraldi","edited_by":"Robert T. Gillis Charles McCann Steven Melendez","a_boy_named_charlie_brown":"Theatrical release poster","written_by":"Charles M. Schulz","budget":"$1.1 million[1]"}