{"country":"United States France","distributed_by":"Focus Features","broken_flowers":"Theatrical release poster","Plot":"Don Johnston (Bill Murray), a former Don Juan who made a small fortune in the computer industry, wants to live in quiet retirement. He is content to lounge around watching old movies and listening to classical or easy listening music. His current girlfriend, Sherry (Julie Delpy), is ending their relationship and moving out of his house when a letter in a pink envelope arrives. After she walks out, Don reads the letter; it purports to be from an unnamed former girlfriend, informing him that he has a son who is nearly nineteen years old, and who may be looking for him. Initially, Don does not intend to do anything about it, but his busybody neighbor Winston (Jeffrey Wright), who is a mystery novel enthusiast, urges Don to investigate. Winston researches the current locations of the five women most likely to have written the letter and gives Don the information along with maps and flight reservations, and persuades him to visit them.Ultimately Don meets with four women, each encounter worse than the last and each woman damaged in some way:Later, Don stops at a florist to buy flowers from a young woman named Sun Green (Pell James) who treats his cut. Don leaves the flowers at the grave of the fifth woman, Michelle Pepe, who Don originally thought might be the mother before finding out she had died five years prior. Finally, Don returns home where he finds a pink letter from Sherry, admitting she still likes him. He discusses the trip and second letter with Winston, who theorizes that Sherry might have written the original letter as a hoax. He then goes home to compare the two letters. Don then meets a young man in the street (Mark Webber) who he suspects may be his son. He buys him a meal, but when he remarks that the young man believes that Don is his father, the young man becomes agitated and flees. As Don attempts to chase the man, he notices a Volkswagen Beetle drive past. A young man (Homer Murray) in the passenger seat is listening to the music which Don himself listens to as Don is left standing in the middle of a crossroads.","language":"English","box_office":"$46,720,491[2]","cinematography":"Frederick Elmes","production_company":"Five Roses Bac Films","directed_by":"Jim Jarmusch","Soundtrack":"The soundtrack to the film features an eclectic mix of music, chiefly using instrumentals by Ethiopian jazz artist Mulatu Astatke as the main score, mixed with garage rock (The Brian Jonestown Massacre, The Greenhornes, Holly Golightly), stoner metal (Sleep), soul (Marvin Gaye), rocksteady reggae (The Tennors), and classical (Gabriel Fauré's Requiem).Several songs in the film are not on the soundtrack album. They include:[citation needed]","release_dates":"August 5, 2005 (2005-08-05)|||||","Production":"The film is dedicated to French director Jean Eustache. In an interview, Jarmusch said he felt close to Eustache for his commitment to making films in a unique and independent fashion.[3]Director Jim Jarmusch generated the wording in the pink letter by asking each of the four female leads to write a version of the letter from the point of view of their respective characters. He used an amalgamation of those four letters in the finished film, \"using pieces of their own language\".[3]Slates for the film shown on the DVD extra \"Broken Flowers: Start to Finish\" list the title of the film as \"Dead Flowers.\"Reed Martin sued Jarmusch in March 2006, claiming that the director stole the film's concept from a very similar script that had circulated among several people eventually involved in the production.[4] Jarmusch denied the charges and stated in response that Martin's claim has \"absolutely no merit\". On September 28, 2007, a federal district court judge dismissed Martin's lawsuit that Jarmusch and Focus Films stole the screenplay from him.[5]","produced_by":"Jon Kilik Stacey Smith","starring":"Bill Murray Jeffrey Wright Sharon Stone Frances Conroy Jessica Lange Tilda Swinton Julie Delpy Mark Webber Chloë Sevigny Christopher McDonald Alexis Dziena","running_time":"106 minutes","music_by":"Mulatu Astatke","edited_by":"Jay Rabinowitz","Release":"Broken Flowers premiered in Europe at 2005 Cannes Film Festival on May 16, 2005.[6] It opened on August 5, 2005 in the US in a limited release.[7] It was released on video January 3, 2006.[8]The film was released theatrically on August 5, 2005 earning $780,408 from 27 theaters. After 15 weeks in release, the movie ended with a domestic total of $13,744,960. The film fared much better internationally, taking in $32,975,531 to bring its total gross to $46,720,491.[2]At the 2005 Cannes Film Festival, the film was nominated for the Palme d'Or and won the Grand Prix.[9] Review aggregator Rotten Tomatoes reports that 88% of 184 surveyed critics wrote a positive review, with the site's consensus stating: \"Bill Murray's subtle and understated style complements director Jim Jarmusch's minimalist storytelling in this quirky, but deadpan comedy.\"[10]According to Ken Tucker, \"Broken Flowers relies on Bill Murray’s persona, but it also turns that persona back on him. Instead of maintaining the satirical distance that made it easy to laugh at heartland eccentrics in, say, Alexander Payne’s About Schmidt, Jarmusch’s film avoids caricature, and Murray’s poker face melts. Don feels a bittersweet regret at becoming exactly the sort of granite-faced wise guy Bill Murray has made his rep at enshrining. Murray is at a point in his career when his self-effacement has achieved high comic art, and he collaborates with Jarmusch at a point in his career when he’s trying to be something more than hipster-serene. Both succeed, by committing to the notion that a yearning to be reborn within a hopeless, brittle soul is worthy of drama—as well as a deeper, gentler humor.\"[11]Peter Bradshaw called it \"Jarmusch's most enjoyable, accessible work for some time, perhaps his most emotionally generous film - like Cronenberg, he has made a bold venture into the mainstream with a movie that creates a gentle cloud of happiness. It is, it must be said, a lot more forgiving about ageing men than Alexander Payne's road-movies About Schmidt or Sideways, but it is still a very attractive piece of film-making, bolstered by terrific performances from an all-star cast, spearheaded by endlessly droll, seductively sensitive Bill Murray.\"[12]","written_by":"Jim Jarmusch (Inspired by an idea from Bill Raden and Sara Driver)","budget":"$10 million[1]"}