{"Cast":"This was Farley's last-released film appearance, filmed before his fatal drug overdose in December 1997. Former SNL writer Downey and former SNL writer/performer Wolf appeared as homeless men; both writers have collaborated frequently with Macdonald and Sandler.","Availability":"The film has been made available on VHS, Laserdisc, DVD and Blu Ray from MGM Home Entertainment.","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Production and Release":"Filmed at Wycliffe College and elsewhere around Toronto, Ontario, Canada, the film was produced for an estimated $13 million.[4] American domestic gross was just over $10 million. No ads for the film were shown on NBC until a week after the film's release.[5]In his first appearance on The Howard Stern Show on September 18, 2008,[6] Chevy Chase discussed the film's production and release with Artie Lange.[7] According to Chase, he was impressed by the original script's raunchy, R-rated, \"over the top\" tone (particularly a filmed but ultimately cut gag involving Macdonald and Lange delivering donuts that had been photographed around their genitals)[7] and, Lange related, went so far as to beg Macdonald not to allow any changes—to \"keep it funny.\" Lange said the studio insisted on a PG-13 rating and moved the film's release from February to June, where it fared poorly against blockbusters like Godzilla.[8]MGM released the film on DVD, in August 1999, and for digital rental/purchase.[9]","Plot":"Growing up, friends Mitch Weaver (Norm Macdonald) and Sam McKenna (Artie Lange) are taught by Sam's hard-nosed dad, \"Pops\" McKenna (Jack Warden), not to \"take crap from anyone\". To that end, the pair plant a bunch of guns in a schoolyard bully's desk and have him arrested for gun possession; next, they catch a kid-fondling crossing guard in the act, after having applied Krazy Glue to the bottom of Mitch's pants.As adults, after losing fourteen jobs in three months and being dumped by his girlfriend, Mitch moves in with Sam and Pops, who then has a heart attack. In the hospital, Pops confides that, because of their parents' swinging lifestyle, he is also Mitch's father. Even though Pops' heart is failing, Dr. Farthing (Chevy Chase), a hopeless gambler, will raise Mr. McKenna's position on the transplant waiting list if he is paid $50,000, to save himself from his bookie. Mitch and Sam get jobs in a cinema with an abusive manager (Don Rickles) and exact their revenge by showing Men In Black (Who Like To Have Sex With Each Other) to a packed house. The other workers congratulate them and suggest they go into business.Mitch and Sam open \"Dirty Work\", a revenge-for-hire business (the Dirty Work phone number is \"555-0187,\" a fictitious number used later on Saturday Night Live.[2]). Mitch falls for a woman named Kathy (Traylor Howard) who works for a shady used car dealer (David Koechner). After publicly embarrassing the dealer during a live TV commercial, the duo exacts increasingly lucrative reprisals for satisfied customers until they interfere with unscrupulous local property developer Travis Cole (Christopher McDonald). Cole tricks them into destroying \"his\" apartment building (actually owned by Mr. John Kirkpatrick, the landlord), promising to pay them enough to save Pops. Afterwards, Cole reneges, revealing that he is not the owner and that he had them vandalize the building so that he could buy it cheaply, evict the tenants (including Kathy's grandmother), and build a parking lot for his luxurious new opera house. Unknown to Cole, Mitch's \"note to self\"[3] mini-tape recorder captures this confession.Mitch and Sam plot their revenge on Cole, using the tape to set up an elaborate trap. Using skunks, a loyal army of prostitutes, homeless men, a noseless friend (Chris Farley), brownies with hallucinogenic additives, and Pops, they ruin the opening night of Don Giovanni, an opera sponsored prominently by Cole. With the media present, Mitch plays back Cole's confession over the theater's sound system. Cole sees that his public image is being tarnished and agrees to pay the $50,000. In the end, Cole is punched in the stomach, arrested and jailed, his dog is raped by a skunk, Pops gets his operation, and Mitch gets the girl. Dr. Farthing overcomes his gambling habit but is beaten to death by bookies in the end.","language":"English","Reception":"The film received mostly negative critical reviews. It was referred to as a \"leaden, taste-deprived attempted comedy\" and \"a desert of comedy\" with only infrequent humor in The New York Times.[10] The Los Angeles Times described it as \"a tone-deaf, scattershot and dispiritingly cheesy affair with more groans than laughs\", and though Macdonald \"does uncork a few solid one-liners\", his lack of conviction in his acting \"is amusing in and of itself, but it doesn't help the movie much\".[11] the San Francisco Chronicle recommended the film only for \"people who like stupid lowdown vulgar comedy. I had a few good laughs.\"[12]It has a 17% critic rating at Rotten Tomatoes, averaged from 30 reviews.[13] The film has been described as a \"cult classic.\"[14][15] In his column, My Year Of Flops, critic Nathan Rabin describes Dirty Work as an example of \"the ironic dumb comedy, the slyly postmodern lowbrow gag-fest that so lustily, nakedly embraces and exposes the machinations and conventions of stupid laffers that it becomes a sort of sublime bit of meta-comedy.\"[16]On co-star Artie Lange's stand-up comedy DVD, It's The Whiskey Talkin', an audience member asks him to sign his copy of Dirty Work; he does so, then gives the fan ten dollars, saying \"you don't see Ben Affleck doing that for Gigli!\" Lange then mentions being disappointed that the review in his home town paper, The Star Ledger, said that he \"had all the charm of a date rapist,\" to which Norm Macdonald replied, in a sincere attempt to cheer him up, \"that's a lot better than saying you have the charm of a regular rapist! A date rapist still has to get a date!\" [17]","box_office":"$10 million","cinematography":"Arthur Albert","directed_by":"Bob Saget","narrated_by":"Norm Macdonald","release_dates":"June 12, 1998","dirty_work":"Theatrical release poster","produced_by":"Robert Simonds","starring":"Norm Macdonald Artie Lange Jack Warden Traylor Howard Don Rickles Chris Farley Christopher McDonald Chevy Chase Adam Sandler","running_time":"81 minutes","music_by":"Richard Gibbs","edited_by":"George Folsey Jr.","written_by":"Frank Sebastiano Norm Macdonald Fred Wolf","budget":"$13 million"}