{"country":"United Kingdom|Germany[1]|","distributed_by":"Pathé (UK)|X Verleih AG[1] (Germany)|","screenplay_by":"Christopher Smith","Plot":"Arthur (Ken Campbell) and George (Vas Blackwood) are two London sewage workers who discover a tunnel in one of the walls that neither of them is familiar with. Arthur starts exploring the tunnel alone, while newbie George stays behind. After a while, George decides to enter the tunnel too, and soon discovers Arthur, injured and in a state of shock. Moments later, a similarly injured young woman jumps out in front of them, crying for help, only to be pulled back into the darkness.The focus then shifts to a young German woman, Kate (Franka Potente), at a party. After hearing that her friend, Jemma, went to seek George Clooney at another party without her even though they had planned to go together, she decides to try and join her. She heads to Charing Cross tube station, but soon falls asleep on the platform while waiting for the train. When she awakens, she is alone and the entire station has been locked up for the night. An empty train arrives and she boards it, but it soon abruptly stops and the lights go dark. While searching for help, she meets Guy (Jeremy Sheffield), a coworker who followed her from the party and whose awkward advances she kept rejecting. Guy, who appears to be under the influence, starts to flirt aggressively, and the situation quickly escalates into a rape attempt, only stopped by an unseen aggressor who drags Guy out of the train. Guy briefly reemerges, covered in blood, warning Kate to run.Kate flees from the train and runs into a homeless Scottish couple living in a storeroom, Jimmy (Paul Rattray) and Mandy (Kelly Scott), and their dog Ray. Kate explains what happened and Jimmy reluctantly agrees to help her by taking her to the night guard after she pays him. Together, they find Guy, horribly maimed and in shock but still alive. Meanwhile, Mandy, left alone, is also attacked and kidnapped, triggering Jimmy's despair and escape into a heroin-induced stupor. Kate manages to communicate with the security guard through intercom, but the man gets killed before being able to call for help, and Guy also dies of his wounds. Kate and Jimmy decide to walk through the tunnel to the next station. A train passes by and stops near them, and Kate fears he's the maniac killer driving it, so Jimmy decides to face him to avenge Mandy's probable death, but is slaughtered as well.While fleeing in panic, Kate falls into the sewer system below the station, where she finds Arthur's body, and from there she ends up in a storage facility with hundreds of boxes, where she finally meets and is captured by the killer, the titular \"creep\": a hideously deformed, mentally ill hermit named Craig (Sean Harris), who keeps his victims in semi-submerged, rat-infested cages until they're dead, after which he eats them. Kate finds herself in one of these cages, along with George. Together, they manage to escape, and end up in an abandoned medical facility (looking like an illegal abortion clinic with a long series of fetuses lined up along a wall) where they find an unconscious Mandy strapped to a rusty surgical chair. Thinking she's dead, Kate and George move on. After they're gone, Craig puts on a surgical gown and mimics the gestures of a surgeon in front of a terrorized Mandy before disembowels her with a bone saw while apparently mimicking an abortion procedure.Back in the railway tunnels, Kate and George find the disused railcar where Craig lives. Ray is there, and also old pictures of a medical doctor with a deformed child. Craig ambushes them, but George gains the upper hand. Kate has an opportunity to finish the creep but Craig parrots Mandy's pleas for mercy, which confuses Kate long enough for Craig to kill George. Kate tries to run away, but she's relentlessly hunted down by Craig. In a last, desperate effort, she sinks a hook and chain in Craig's throat, then has a running train rip it apart. Tattered and filthy, Kate eventually gets back to the initial station when it's already the next morning. She collapses on a platform's floor; Ray the dog shows up and curls onto her lap. Mistaking her for a beggar, a man waiting for the train leaves a coin next to her; Kate breaks into hysterical giggles and tears.","creep":"Theatrical release poster","language":"English","Critical reception":"Creep has received generally mixed reviews from critics. It currently holds a 43% 'rotten' rating on review aggregator website Rotten Tomatoes based on 14 reviews.[4]Time Out gave the film a negative review, writing, \"this London Underground-set slasher squanders a promising premise [...] for trashy shocks, old-school nastiness and a fistful of genre clichés. \"[5]AllMovie's review was favourable, writing, \"this pared-down shocker might be light on plot, but it's packed with creepy frights and psychopathic attitude from its mean main monster. \"[6]Matthew Turner ViewLondon said \"The performances are good, particularly Potente, who avoids scream queen clichés by making her character surprisingly unlikeable - Kate is rude and arrogant in her early scenes and the fact that she's German is, of course, a coincidence.\"[citation needed]","box_office":"£1.7 million","cinematography":"Danny Cohen","directed_by":"Christopher Smith","production_companies":"Dan Films Zero West[1]","release_dates":"10 August 2004 (2004-08-10) (Frankfurt Fantasy Filmfest)|||||","Production":"The storyline has been compared to the 1972 film Death Line, also set on the London Underground and featuring a cannibalistic killer. Director Smith, who had not seen Death Line, attributes his inspiration to a scene in An American Werewolf in London set in the London Underground.[3]","produced_by":"Julie Baines|Jason Newmark[1]|","starring":"Franka Potente|Ken Campbell|Vas Blackwood|Jeremy Sheffield|Sean Harris|","running_time":"85 minutes[2]","music_by":"The Insects","edited_by":"Kate Evans"}