{"based_on":"The Price of Salt  by Patricia Highsmith","country":"United Kingdom|United States|","distributed_by":"StudioCanal UK|The Weinstein Company|","screenplay_by":"Phyllis Nagy","Plot":"During the Christmas season of 1952, Therese Belivet, a temporary shopgirl and aspiring photographer, is working in Frankenberg's department store in Manhattan. She sees a glamorous woman across the room looking at a model train set display. Based on Therese's recommendation, the woman, Carol Aird, purchases a set for her daughter as a Christmas present. Carol engages Therese in friendly conversation and when she departs accidentally leaves her gloves behind. Therese takes the gloves home and, using Frankenberg's sales slip with Carol's name and address, mails them to her.Therese's boyfriend, Richard, wants her to go to France with him and hopes they will marry, but she feels ambivalent about their relationship. A mutual friend, Dannie, invites Therese to his workplace, The New York Times, offering to introduce her to a photo-editor friend. During the visit, Dannie seizes the opportunity to kiss her. Therese lets him, but becomes uncomfortable and leaves. Meanwhile, Carol is going through a difficult divorce from her neglectful husband, Harge, with whom she has a young daughter, Rindy. Carol calls the store to thank the person who returned the gloves and invites Therese to lunch. The two find themselves intrigued with one another. Carol then invites Therese to her home in New Jersey for Christmas. Carol stops to purchase a Christmas tree and Therese takes candid photos of her. Harge arrives unexpectedly to take Rindy to Florida with him and becomes suspicious of Therese because Carol had an affair years before with her best friend, Abby. Therese witnesses their argument and, after Rindy is gone, a distressed Carol takes Therese to the train station and Therese returns home.Carol later calls to apologize and the two agree to meet at Therese's apartment, where Carol surprises her with a gift: a Canon camera and film. Carol had learned that Harge is petitioning the judge to consider a \"morality clause\" against her, threatening to expose her homosexuality and give him full custody of Rindy. She decides to take a road trip West to escape the stress of her divorce proceedings and invites Therese along. Richard, feeling threatened, accuses Therese of having a crush on Carol and predicts that Carol will soon get tired of her. The two argue and their relationship comes to an end. Therese and Carol depart on their trip. On the second night together in a motel, Therese meets a traveling salesman, Tommy Tucker.On New Year's Eve, in a motel room in Waterloo, Iowa, Carol kisses Therese for the first time. The two finally acknowledge their strong feelings for each other and make love. The next morning they discover that the salesman they met is actually a private investigator hired by Harge to obtain evidence against Carol. Carol confronts Tucker, threatening him at gunpoint, but his secret tape recordings have already been sent to Harge. The next day, Therese learns that Carol has flown to New York during the night to fight for custody of her daughter, having asked Abby to drive Therese home. Back in New York, Therese telephones Carol, but knowing that she cannot continue her relationship with Therese if she wants any chance to see Rindy again, Carol remains silent and hangs up, leaving Therese in tears.Therese creates a portfolio of her photos and gets a job at The New York Times, partly based on those she took of Carol. Carol has been seeing a psychotherapist as a condition of the divorce settlement. During a confrontational meeting with both lawyers present, Carol suddenly admits the truth of what the tapes contained and refuses to deny her own nature. Not wanting the legal battle to make a mess of their child's life, she tells Harge that he can have permanent custody of Rindy, but demands regular visitation even if supervised. Carol tells Harge that if he were to contest her offer it would get ugly and they were not \"ugly people.\"Carol writes to Therese asking to see her, and they meet in the lounge of the Ritz Tower Hotel. Carol reveals she is going to work as a buyer for a furniture house and has taken an apartment on Madison Avenue. She says the apartment is big enough for two and hopes Therese might like to live with her. Therese declines and a silence hangs between them. Carol informs Therese that she is meeting associates in the Oak Room and if she changes her mind they can have dinner. Therese remains still and Carol whispers, \"I love you.\" The moment is interrupted by a colleague, Jack, who had not seen Therese in months. Carol rises to leave and touches Therese's shoulder before walking away.Therese accepts Jack's invitation to a party, where she finds that she cannot socially connect with anyone despite the interest of another woman there. Therese rushes to the Oak Room. She enters, scans the crowd, then sees Carol at a table at the rear of the room. Their eyes lock. Carol tilts her head, with a knowing smile that grows as Therese moves towards her.","language":"English","Reception":"Carol received a rapturous response, including a ten-minute standing ovation, at its Cannes Film Festival international press screening and premiere. Critics particularly lauded Haynes' direction, Blanchett and Mara's performances, the cinematography, costumes and score, and deemed it a strong contender for a Cannes award.[109] On the review aggregator website Rotten Tomatoes, the film has a 94% approval rating based on reviews from 231 critics, with an average rating of 8.6 out of 10. The site's critical consensus states: \"Shaped by Todd Haynes' deft direction and powered by a strong cast led by Cate Blanchett and Rooney Mara, Carol lives up to its groundbreaking source material.\"[110] Carol was named the best-reviewed romance film of 2015 in Rotten Tomatoes' annual Golden Tomato Awards.[111] On Metacritic, the film received a weighted average score of 95/100 based on 44 critics, indicating \"universal acclaim\".[112] Carol is Metacritic's best reviewed film of 2015.[113]Carol was named one of the best films of 2015 by numerous critics and publications, appearing in over 130 critics' Top Ten lists.[n 1] Film Comment magazine ranked Carol the best film of 2015 based on its year-end poll of over 100 film critics.[115] The film topped Variety film critics' Best Films of 2015 poll.[122] Carol was ranked second on Sight & Sound Best Films of 2015 critics' poll, voted on by 168 film critics.[116] The film also came in second place on the Village Voice Film Critics' Poll, voted on by over 125 film critics, and Indiewire's critics' poll of best films, voted on by over 200 film critics.[117][118] Metacritic ranked the film as the third most mentioned in critics' Top Ten lists.[114]As of May 5, 2016[update], Carol has grossed $12.7 million in North America and $27.6 million in other territories for a worldwide total of $40.3 million, against a budget of $11.8 million.[1][2] In the United States, the film began its limited run on November 20 at four theaters − The Paris Theater and Angelika Theater in New York City and the ArcLight Hollywood and Landmark Theater in Los Angeles − and was projected to earn around $50,000 per theater.[123] The film grossed $253,510 in its opening weekend at the four locations, the best opening of Haynes' films. Its per theater average of $63,378 was the third biggest of 2015.[84][124] In its second weekend, the film grossed $203,076, with a \"robust\" per location average of $50,769, the best of the week, bringing its nine-day cumulative from the four theaters to $588,355.[125] In its third weekend at the four locations, Carol earned $147,241, averaging an \"impressive\" $36,810, the highest for the third week in a row.[126]The film expanded from four to 16 theaters in its fourth week, and it was projected to average an estimated $10,000 over the weekend.[87] In its fourth weekend, it grossed $338,624, averaging $21,105, and bringing its United States cumulative total to $1.2 million.[127] The film was projected to earn an estimated $218,000 from 16 theaters in its fifth weekend. It grossed $231,137, averaging $14,446 per theater.[128][129] Carol then expanded from 16 to 180 theaters.[88][130] In it sixth weekend, the film made $1.1 million, with a $6,075 average across 180 locations; its United States total gross was $2.9 million, with a worldwide gross of $7.8 million from seven other territories.[131][132] Carol crossed $5 million in the United States in its seventh weekend. Expanding to 189 theaters, the film grossed $1.2 million, with a $6,429 average, indicating positive word-of-mouth, according to Deadline.[133] In the United Kingdom, the film earned $812,000 in its opening weekend from 206 screens.[134] Carol has grossed $4.2 million in the UK as of April 6, 2016.[135]Carol has received over 180 industry and critics nominations and over 50 awards. The film was selected to compete for the Palme d'Or at the 2015 Cannes Film Festival, where it won the Queer Palm and Mara tied for the Best Actress award.[136][137] The film won the Audience Award at the Whistler Film Festival, and the Chicago International Film Festival's Gold Q Hugo Award for exhibiting \"new artistic perspectives on sexuality and identity\".[138][139] Carol was the \"overall favorite\" on Indiewire's critics' poll on the best films and performances from the New York Film Festival, topping the Best Narrative Feature, Best Director, Best Lead Actress (Blanchett and Mara), Best Screenplay, and Best Cinematography categories.[140] Lachman was awarded the grand prize for Best Cinematography by the Camerimage International Film Festival. The jury statement proclaimed:[Carol] seamlessly evokes the period by paying homage to the great photography of the time. It also creates its own unique cinematic language and pulls the viewer deeper and deeper into a world where something as simple as love comes at a staggering cost. Its delicate and precise exploration of emotion through color and light led us to discuss what it meant to achieve mastery of our craft. [Lachman] is, for us, a master and [Carol] is a masterpiece.[141]The American Film Institute selected Carol as one of the Top Ten Films of the year.[142] The Weinstein Company had confirmed in September 2015 that it would campaign for Cate Blanchett as Lead Actress and Rooney Mara as Supporting Actress for the 88th Academy Awards.[143] The film received six Oscar nominations, including Best Actress, Best Supporting Actress, Best Cinematography, and Best Adapted Screenplay.[144] It garnered five Golden Globe Award nominations for Best Motion Picture – Drama, Best Director for Haynes, Best Actress for Blanchett and Mara, and Best Original Score for Burwell.[145] It received nine BAFTA Award nominations, including Best Film, Best Direction, Best Actress in a Leading Role, Best Actress in a Supporting Role, and Best Adapted Screenplay.[146] The film was nominated for six Independent Spirit Awards, including Best Feature, Best Director, Best Screenplay, and Best Female Lead for Blanchett and Mara, and won for Best Cinematography.[147] It also received nine Critics' Choice Movie Award nominations, including Best Film, Best Director, Best Actress and Best Supporting Actress.[148] Blanchett and Mara received Screen Actors Guild Award nominations for Outstanding Performance by a Female Actor in a Leading Role and Outstanding Performance by a Female Actor in a Supporting Role, respectively.[149]The New York Film Critics Circle awarded Carol Best Film, Best Director, Best Screenplay, and Best Cinematography.[150] The film won Best Music from the Los Angeles Film Critics Association and was runner-up for Best Director, Best Cinematography, and Best Production Design.[151] The National Society of Film Critics awarded Haynes Best Director and Lachman Best Cinematography.[152] Haynes and Lachman also received the Boston Society of Film Critics Award for Best Director and Best Cinematography, and Lachman won the London Film Critics' Circle Technical Achievement Award.[153][154] Carol was awarded the GLAAD Media Award for Outstanding Film – Wide Release.[155] The Frankfurt Book Fair named Carol the Best International Literary Adaptation.[156]In 2016, the British Film Institute named Carol the best LGBT film of all time, as voted by over 100 film experts, including critics, filmmakers, curators, academics, and programmers, in a poll encompassing over 80 years of cinema.[157][158]In addition to criticism regarding a lack of racial diversity in the Academy Award nominations, the omission of Carol from the Best Picture and Best Director categories prompted considerable discussion from journalists on the organization's perceived indifference toward female-centric and LGBTQ-centric films.[159][160][161][162]Nate Scott of USA Today called its absence \"the standout snub\" of the ceremony, \"one made all the more ridiculous because of the bloated Best Picture field\".[163] At HitFix, Louis Virtel suggested that Academy members' reception of the film was hurt by its focus on independent women, citing how other critically acclaimed \"female-centric\" films such as 45 Years and Inside Out were also excluded. Virtel noted that the two female-led films nominated for Best Picture (Brooklyn and Room) are \"movies about women who are thinking about men, whether they're dashing Italian paramours, a horrifying kidnapper, or a precocious son\" – whereas Carol is \"about characters who actively flout the presence of men in their lives ... [The film's] strident interest in female inner-life and how it doesn't relate to men is still more radical.\"[164]Among those with similar sentiments were Matthew Jacobs of The Huffington Post, who felt that the Academy's artistic tastes were \"too conventional to recognize its brilliance\",[165] and Nico Lang of The A.V. Club, who noted that despite the film being considered a \"lock\" for a Best Picture nomination, the omission \"shouldn’t have been a major shock\" given the controversy over Brokeback Mountain's loss a decade earlier:\"To date, a queer-themed movie has still never won Best Picture, and those that do receive any kind of recognition prominently feature queer suffering ... The reason that Carol is unique and extraordinary is likewise the exact reason that the Academy didn’t deem it Best Picture-worthy ... The Price Of Salt was a landmark work of LGBT fiction, not just because it was published in 1952 (a time many Americans were unaware lesbians even existed) but because it didn’t punish its star-crossed lovers for their desires ... [the novel] leaves the door open for a happy ending ... What makes stories like the romance portrayed in Carol isn’t the ecstasy of queer agony but that there were real women like Carol Aird and Therese Belivet.\"[166]Richard Lawson of Vanity Fair proposed that although its \"themes of passion and heartache may be universal\" the film may be \"too gay\", speaking \"in a vernacular that, I’d guess, only queer people are fully fluent in.\" He juxtaposed this notion, however, with the foreign scenarios of several Best Picture nominees, such as the bear attack and epic revenge of The Revenant, the seven-year sequestering in Room, or the stranding of Matt Damon's character on Mars in The Martian. Lawson stated that the film's lack of \"gushing melodrama\" put it at a disadvantage as \"loud and insisting tends to triumph over quiet and introspective\".[167]Dorothy Snarker of Indiewire attributed the omissions to the Academy's demographics. Snarker agreed with Lawson that Carol may be too gay and too female \"for the largely old white male voting base\" to connect with, as its \"quiet, sophisticated ... mid-century romance focuses entirely on the unstoppable attraction between two women where neither has the decency to sleep with a man, suffer tragically or die at the end\". Snarker also considered that the LGBT rights movement’s successes in the U.S. may be partly responsible for the lack of \"political urgency\" around the film, as when Brokeback Mountain was released in 2005, people could \"pat themselves on the back for sitting through 'that movie where the cowboys do it.\"[168]Writing for Paper magazine, Carey O'Donnell similarly noted that gay romances are only \"Oscar surefires\" when they use the tragedy/desolation equation. Brokeback Mountain's depiction of a \"doomed\" relationship that \"ends as violently sad for viewers as the violence that physically destroys their earthly bond\" is \"entertaining, in the most ghoulish sense\", O'Donnell remarked. \"There's inherent condescension from the mainstream world, compelled by a story like Brokeback ... So when a gay romantic relationship is depicted on the screen, it's only natural that people - including, apparently, the Academy - can only make sense of it if it ends in misery.\"[169]Marcie Bianco of Quartz noted that the film is \"centered around women’s desire\" and Haynes structured it in a way that \"elevates the power of women’s gaze\"; in that regard, \"Carol flips convention: men’s roles are marginal and antagonistic, while women and their desires wield power ... allocated and harnessed by women—by their gaze, and by their actions—for each other.\" When it comes to women, Bianco observed, \"it seems the Academy primarily recognizes their anger at the violence enacted upon them and their trauma\" and \"while they do fight back, [women] are the victims.\" The omission of Carol from Best Picture, Bianco concluded, illustrates \"yet again how sexism operates in the world, and in the Academy specifically, as the refusal to see women as protagonists and agents of desire.\"[170]Jason Bailey of Flavorwire pointed out that most Best Picture nominees that include gay themes \"put them firmly in the realm of subplots\", and most often the actors are nominated, not the film. Since Brokeback Mountain, \"we’ve seen Best Picture nominations for The Kids Are All Right and Dallas Buyers Club – though in both of those cases, the primary audience surrogate was arguably a straight man ... [and] Milk and The Imitation Game, both stories about gay men who met with tragedy.\" \"Carol's most transgressive quality\", Bailey declared, \"is its refusal to engage in such shenanigans; this is a film about full-blooded gay lives, not tragic gay deaths.\"[171] David Ehrlich of Rolling Stone commented that the film's \"patience and precision\" did not conform to Academy tastes, but its legacy \"will doubtlessly survive this year's most egregious snub\".[172]","box_office":"$40.3 million[2]","cinematography":"Edward Lachman","directed_by":"Todd Haynes","carol":"Theatrical release poster","Soundtrack":"The soundtrack includes the original score by Carter Burwell and additional music performed by The Clovers, Billie Holiday, Georgia Gibbs, Les Paul and Mary Ford, and Jo Stafford. Songs not featured on the soundtrack include \"Willow Weep for Me\" performed by Vince Giordano & the Nighthawks Orchestra, \"A Garden in the Rain\" performed by The Four Aces, \"Perdido\" performed by Woody Herman, \"That's the Chance You Take\" by Eddie Fisher, \"Slow Poke\" by Pee Wee King, and \"Why Don't You Believe Me\" performed by Patti Page.[73]The soundtrack for the film was released in both digital download and physical formats by Varèse Sarabande on November 20, 2015,[74] followed by a double album vinyl release on June 24, 2016.[75]","production_companies":"Number 9 Films Killer Films Film4 Productions","release_dates":"May 17, 2015 (2015-05-17) (Cannes)|November 20, 2015 (2015-11-20) (United States)|November 27, 2015 (2015-11-27) (United Kingdom)|||","Production":"Carol is based on Patricia Highsmith's 1952 semi-autobiographical romance novel The Price of Salt. The novel was originally published under the pseudonym \"Claire Morgan\" after Highsmith's publisher Harper & Brothers rejected it. Highsmith agreed to republish the novel in 1990 under her own name, retitling it Carol.[3][4][5] The story was inspired by a brief encounter Highsmith had with a blonde woman in a fur coat, Kathleen Senn, while working at Bloomingdale's in New York City in 1948. The character of Therese was based on Highsmith herself and Senn was the template for the character of Carol. Highsmith also drew on the experiences of her former lover, Virginia Kent Catherwood, a Philadelphia socialite who had lost custody of her child in a high-profile divorce involving secret tape recordings of her and her female lover used in court.[6][7] The evening Highsmith met Senn, she wrote an eight-page outline for the story, which she developed some weeks later and completed by 1951.[6][8]London-born, New York-based producer Dorothy Berwin was initially attached to the project in 1996, owning the rights to the novel. She enlisted then-playwright Phyllis Nagy to write the screenplay at the recommendation of her London agent.[9][10] Nagy, who was a friend of Highsmith, wrote the first draft of the script in 1997.[10][11][12] Highsmith had suggested to Nagy she adapt one of her novels.[13] According to Nagy, Highsmith was not confident that the novel could be made into a \"satisfying\" film because of its \"intense, subjective point of view\".[14] Nagy decided to adapt the script to ensure its fidelity to the source material, remarking, \"I felt a strange responsibility to take it, and to make sure that it wasn’t screwed up in some fundamental way, because she so disliked many of the screen adaptations of her work.\"[12]What still strikes me now [about the novel], is how radical it was in terms of its overall conception — two central figures not giving a rat’s ass about sexual identity. No one frets about being gay; others fret on their behalf ... I also found Highsmith’s notions of what makes a good mother to be quite radical — the choices that people have to make in order to make the lives of their children better seemed really fresh, and radical. And still do, to this day, actually.While searching for financing for the film, Nagy and Berwin learned at the time that the sexuality of the lead characters was not as much of a problem for investors as their gender. \"Having two women leads was the issue”, Nagy noted.[5] In 2015, Berwin said that, in those days, it was risky idea to play the role of Carol. \"As a project it came together with Cate Blanchett. You needed to always start with her role\".[15] Film4 Productions and Tessa Ross financed the development of the film and kept it alive throughout the years,[9][16][17] as it \"underwent a decade-plus of revision under various directors and investors\" − including Hettie MacDonald, Kenneth Branagh, Kimberly Peirce, John Maybury, and Stephen Frears − until the project completely stalled.[5][18][19] The long trek was a result of the struggles and roadblocks encountered with funding, rights, and trepidations about a film with gay themes and two female leads. \"During its development, there was a very different kind of lesbian or gay movie that got financed\", Nagy said. \"They were very agenda or issue driven, and this was not. In fact it insists on not being that in order to make the point. I would talk about that with financiers, and I could see them glaze over.\"[19]Nagy said it was important that the screenplay remained authentic to the early 1950s. \"There was a different protocol then, a different etiquette, a different way people related to each other physically\", she said. “It does you no service to spoon-feed a contemporary audience their own emotional codes and value systems.\" While various directors and investors had input in the script throughout the long gestation period, Nagy rejected recurrent suggestions that Carol or Therese \"should feel guilty about being gay and suffer some kind of breakdown scene about it.\"[5][14] \"What I knew going in to the adaptation\", Nagy said, \"was that Pat’s lack of psychologizing about Carol and Therese’s sexual attraction and ultimately their love, had to be maintained. It could not be corrupted by an impulse to indulge in any number of dramatic narrative cliches about guilt concerning one’s sexuality or the like.\"[14]Nagy set the adaption several years later than the time in which the novel is set, so \"the dawn of the Eisenhower administration and the rise of HUAC could be front and center\".[14] One of the challenges of adapting the novel was translating the subjective and limited third-person viewpoint whereby the narrator \"sits on the shoulder of Therese and makes regular advances into (and retreats from) her head\" and Carol is thus largely seen through Therese's fanatical prism.[14][20] Nagy was initially apprehensive of the narrative structure, considering \"there's no character of Carol. She's a ghost appropriately, as she should be, in the novel\", adding that she was \"overwhelmed by the task of trying to come up with the visual equivalent for it structurally.\"[9] Nagy decided to split the point of view and shift perspectives from Therese to Carol, as \"the point of view is always with the more vulnerable party\". She made Therese a photographer instead of a set designer, allowing her \"to be seen moving from objects to people\", which Nagy likened to Highsmith as Therese is a \"clear stand-in\" for the author.[20] Nagy drew from her personal knowledge of Highsmith for Therese, describing one of Therese's lines, \"I started taking pictures of people because my friend says I have to be more interested in humans\", as the epitome of Highsmith: \"that ability to step outside of life and comment on it before participating in it\".[5] For the character of Carol, Nagy took inspiration from the silhouette and underpinning of Grace Kelly's character in Rear Window.[10][21] Nagy had freedom in \"inventing a life for [Carol], for whom, basically, we knew the outline of what was going on.\" Once Nagy was able to dig into and understand the inner life of Carol, her motivations given the circumstances, then the character became easy to write.[9] Nagy aimed to \"focus on the nature of what it’s like to fall in love from two points of view\", and show the characters \"just behaving ... not inhabiting positions.\"[13][Haynes and I] are of a similar mind, of similar influences ... he understood exactly that we were going for something almost entirely subtextual, and that it required bravery and a resistance to over-explication.\"Nagy realized she would \"pass time in a different way\" to the novel, eliminating elements that were unnecessary and slowed down the story in the screenplay. She had \"great freedom\" developing the screenplay in England while no studio or director was attached and it was just her and the producer. Over the years, five \"proper\" drafts of the screenplay materialized.[9] Nagy said that after all the previous collaborations on the script, \"working for Todd was easy and quick. We both have an interest in restraint.\"[5] Haynes and Nagy collaborated on honing the screenplay.[10][22][23] When Haynes came on board, they had discussions about \"what became the framing device\"; Haynes was interested in films like Brief Encounter and suggested they try a framing device, which Nagy \"then ran with in a certain way\".[9][24][a] \"He was interested in the same things, tonally, that the script was interested in - which isn't always the case\", she noted. \"We were able to keep that restraint going\".[9] Working with Haynes, Nagy made the story more enigmatic, pruning some of the backstory in light of a significant line that Carol says to Therese early in the film: \"What a strange girl you are, flung out of space.\"[18] Nagy and Haynes were comparably determined not to make \"an agenda film\" or a \"look how far we’ve come\" film.[16]At the BFI London Film Festival, Nagy said she titled the film Carol, not The Price of Salt, because Highsmith herself had changed the title to Carol when the novel was republished, and she also \"liked the sort of strange, obsessive nature of calling it by someone's name.\" There were later other discussions with Haynes.[26] Haynes said that the film is called Carol because the novel \"is locked into the subjectivity of the younger woman\" and Carol is \"really the object of desire in the story.\" \"There’s an element of, something aloof ... something unsettled about [her], that puts Therese and these new feelings...on edge throughout much of the film. That relationship of who’s the object and who’s the subject does shift in the story, but it made sense ultimately that that would be the name for the film.\"[27] On the universality of the story, Haynes said that the \"real determining question is not whether society will accept [Therese's] feelings or not; it’s, will this person return her love or not? ... that is what transcends the class of love, or the period in which it’s occurring\".[28]British producer Elizabeth Karlsen of Number 9 Films came across Nagy's script circa 2004, during which she co-produced Nagy's film Mrs. Harris with Christine Vachon of New York-based Killer Films.[18][22][b] Berwin’s rights to the book lapsed in 2010, and the script went into turnaround.[5] Berwin remained an executive producer on the film.[9] Karlsen managed to convince Highsmith's estate to sign over the rights to her, closing down the deal with Tessa Ross in late 2011.[5][22] She then persuaded a disillusioned and reluctant Nagy to come back on board.[5][10] The producers hired a UK director who then dropped out because of scheduling conflicts.[22] They later recruited Irish director John Crowley, who was announced in May 2012 along with the film's lead cast, Cate Blanchett and Mia Wasikowska, and involved producers, Karlsen and Stephen Woolley of Number 9 Films and Tessa Ross of Film4, who received executive producer credit.[29][30] Carol was scheduled to start filming in early 2013 when Crowley left the project due to a scheduling conflict.[5][22][c] Karlsen called Christine Vachon to discuss losing another director. Vachon told her that it appeared as though Todd Haynes’ next film, which she was producing, was not going to happen after the star had dropped out. They then decided to approach Haynes. Vachon, Haynes' frequent collaborator, asked him if he would be interested and sent him the script. Within 48 hours he committed to direct, and Vachon joined the film as a producer.[22][24] Haynes was announced as the director of the film in May 2013.[31] Two days later, The Weinstein Company acquired U.S. distribution rights at the Cannes Film Festival.[32]Haynes had first heard about the film in 2012 from costume designer Sandy Powell, who informed him that Blanchett was attached and Karlsen was producing. Blanchett, who served as an executive producer through her production company Dirty Films Ltd., had been involved with the project for \"a long time\".[33][34] Haynes learned they were looking for a director when Vachon approached him in 2013. He regarded the story, its historical and social context, and collaborating again with Blanchett as motivating factors for his involvement.[35][36][37] \"What was so interesting to me when I first read this script\", Haynes said, \"is how it basically links that hothouse mentality of the desiring subject ... to that of the criminal subject, in that both are these over-productive minds that are conjuring narratives constantly ... this crazy state of this furtive hyperactivity in the mind.\"[13] Haynes collaborated with Blanchett on a dramaturgical level.[23][38]Another complication emerged, when Wasikowska had to drop out of the film because of a scheduling conflict.[5] Haynes then approached Rooney Mara, who had been offered the role of Therese after completing the 2011 film The Girl With the Dragon Tattoo. Mara said that although she loved the script and wanted to work with Blanchett, she turned it down as she felt exhausted and unconfident. By the time Haynes came on board she was \"in a much different head space\" and signing on to the project was \"a no brainer at that point.\"[39][40] In August 2013, it was reported that Mara had replaced Wasikowska.[39][41]In January 2014, Carter Burwell was hired to compose the music for the film.[42] Sarah Paulson was cast as Abby, a close friend of Carol, and Kyle Chandler was cast as Harge, Carol's husband.[43][44] The following month, Cory Michael Smith was cast as Tommy, a charming traveling salesman, and Jake Lacy joined the cast as Richard, Therese's boyfriend.[45][46] In April 2014, John Magaro was cast as Dannie, a writer who works at The New York Times.[47] Carrie Brownstein then joined the cast, playing the role of Genevieve Cantrell, a woman who has an encounter with Therese.[48] Edward Lachman, who had previously collaborated with Haynes, served as the director of photography.[49]In rehearsal, Haynes, Blanchett and Mara realized certain lines that either character did not need to say should be cut, which Haynes deemed the \"stylistic practice that we all took throughout the creative departments. I feel there was an understanding with them that words and dialogue were never carrying the weight of the story.\"[28] Costume Designer Sandy Powell said of working with Haynes, \"Todd is super visual, super prepared and he provides his own visuals at the beginning of the film. He starts with a look book of images that he’s compiled over the months and months. He’s almost OCD about it. In a good way.\"[50] Haynes used post-war color photography as a visual reference for depicting a \"dirty and sagging\" New York. The work of female photographers such as Ruth Orkin, Esther Bubley, Helen Levitt, and Vivian Maier, as well as the abstract photography of Saul Leiter influenced the look of the film.[25][51]In making preparations for filming, the producers found that New York was too expensive and not viable as the city does not resemble early 1950s New York, and filming there would be difficult moving from location to location with a limited time frame. Part of the financing plan was hinging on a co-production deal with Canada, with filming taking place in Montreal, but Haynes joining the production led a complete re-think. Karlsen recalled making a film 27 years ago set in 1950s New York, in Cincinnati, Ohio. After researching the city, she found that it had not changed in decades, and the state of Ohio also had one of the best tax rebates in the U.S. The city of Cincinnati was very accommodating to the production, which employed a lot of local crew.[24][51]In December 2013, it was announced that Carol would be filmed in Cincinnati, Ohio, and production offices would open in early January 2014, with filming expected from mid-March through May.[52] In February 2014, the Greater Cincinnati & Northern Kentucky Film Commission released the solicitation from producers for movie extras and vintage vehicles.[53][54][55] Principal photography began on March 12, 2014, at Eden Park in Cincinnati.[49][56][57] Various locations around Cincinnati, Ohio were used during production, including Downtown Cincinnati, Hyde Park, Over-the-Rhine, Wyoming, Cheviot, and Hamilton, as well as Alexandria, Kentucky.[58][59][60][61] The filmmakers used real locations except for one set, the hotel room, which was built on a music hall stage in Cincinnati. The department store in the film was designed on the site of an old department store.[24] Filming was completed on April 25, 2014.[58] The film was shot in 34 days.[62] Edward Lachman shot Carol on Super 16 mm film.[63]Post-production on the film took seven months to complete in New York. Haynes was involved in the editing process alongside editor Affonso Gonçalves. Visual effects (VFX) were used to remove modern components from backgrounds, with six \"key shots\" needing extensive VFX. Moving shots were particularly complicated when they were filtered through windows, rain, dust, and other elements, said Haynes, and the CGI details \"had to fit exactly into the vernacular itself, with the grain element and level of distress.\"[64] The digital intermediate process was used to achieve a \"very specific, slightly spoiled palette\".[64] Haynes spent five-and-a-half weeks making detailed notes on Gonçalves's assembly edit, and produced his director's cut within four weeks. The producers gave notes on the director's cut, and held some test screenings with friends and acquaintances. They decided to show the cut to Harvey Weinstein. Weinstein saw the cut a few weeks before picture lock, and was impressed and endorsed it.[24]Haynes confirmed deliverables were completed on December 15, 2014.[65] Carrie Brownstein stated that the first cut of the movie was extensive and most of her scenes were left out.[66][67] In November 2015, Sarah Paulson said that a key scene between Abby and Therese (Mara) as well as some of the conversation in a scene with Carol (Blanchett) was cut from the film.[68][69] In January 2016, Rooney Mara revealed that an intimate scene between Therese and Richard (Lacy) was also deleted.[70] Editor Affonso Gonçalves stated that the initial cut was two and a half hours and the final cut ended at 118 minutes.[71] Todd Haynes explained in an October 2015 interview: \"We cut a lot of scenes; it was too long, and they were all well-performed and nicely shot – we never, in my opinion, cut things because they were poorly executed. It was just a paring-down process, which all movies do.\"[72]","produced_by":"Elizabeth Karlsen|Stephen Woolley|Christine Vachon|","starring":"Cate Blanchett|Rooney Mara|Sarah Paulson|Jake Lacy|Kyle Chandler|","running_time":"118 minutes","music_by":"Carter Burwell","edited_by":"Affonso Gonçalves","Release":"The first official image from Carol, released by Film4, appeared in the London Evening Standard in May 2014.[17] Despite being completed in late 2014, producers withheld the film until 2015 to benefit from a film festival launch.[65][d] In October 2014, Haynes and producer Christine Vachon announced that the film would premiere in the spring of 2015 and would be released in the fall.[76]Carol had its world premiere at the 2015 Cannes Film Festival.[77][78] It made its North American debut at the Telluride Film Festival on September 4, and screened at the New York Film Festival on October 9, 2015.[79][80][81]The film premiered in the United Kingdom as the BFI London Film Festival’s Gala event on October 14, 2015.[82] Originally scheduled for a December 18, release in the United States, Carol opened in limited release in the U.S. on November 20, 2015.[83] It received a platform release in the country,[84][85][86] expanding from four to 16 locations on December 11,[87] from 16 to 180 theaters on December 25,[88] and reaching over 520 theatre locations by the weekend of January 8, 2016.[89] The film went into wide release on January 15, 2016.[2] Carol was released nationwide in the UK on November 27, 2015.[90]In December 2015, The Hollywood Reporter reported that Russian distribution company Arthouse had acquired distribution rights to release the film in Russia in March 2016. The CEO of Arthouse said that it is a \"huge challenge\" because of the \"federal 'gay propaganda' law that victimizes the Russian LGBT community\", and such law \"will prevent Carol to be sold to major TV channels or even being advertised on federal networks\". He noted that \"some cinemas will refuse to book the film\", but \"the controversy around the LGBT issues will help us market Carol to the right audience\", adding that it is a film about \"a relationship, it’s a story of forbidden love\" and he believes it will \"appeal to the public way beyond the LGBT community.\"[91] The film was released in Russia on March 10, 2016.[92][93]In January 2016, ABC rejected a commercial for the film featuring a snippet of the love scene between Carol and Therese, causing The Weinstein Company to re-edit the television trailer.[94][95]In March 2016, a 35mm film screening of Carol was held at the BFI Flare: London LGBT Film Festival.[96] The Metrograph independent cinema in New York City hosted a special 35mm screening event for the film, followed by a Q&A with Todd Haynes, cinematographer Ed Lachman, and producer Christine Vachon.[97][98] The event was sold out, and a second and third screening were added due to popular demand.[99][100]Carol was made available for digital download on March 4, 2016.[101] The film was released on DVD, Blu-ray and video on demand on March 15, 2016 in the United States by Anchor Bay Entertainment, and on March 21, 2016 in the United Kingdom by StudioCanal.[101][102] Disc format bonus features include behind the scenes gallery, Q&A interview with cast and filmmakers, and limited edition art cards.[101][102] As of March 10, 2016, both the DVD and Blu-ray were Number 7 on the list of top pre-order sales in the United States.[103][104] In the United Kingdom, the DVD debut charted at Number 7 and the Blu-ray at Number 12 of \"Top 100\" sales for both formats.[105][106] As of March 20, 2016, sales of the DVD and Blu-ray in the United States totaled $356,971 and $246,161 respectively, for a combined total of $603,132.[107][108]","budget":"$11.8 million[1]"}