{"country":"United States","distributed_by":"Paramount Pictures","dickie_roberts:_former_child_star":"Theatrical release poster","Plot":"Dickie Roberts is a former child star who shot to fame on a TV sitcom called The Glimmer Gang with his catchphrase \"This is Nuckin' Futs!\". His career subsequently halted after his 6th birthday. Since his heyday, he has been reduced to parking cars at Morton's and appearing on Celebrity Boxing, where he is matched with Emmanuel Lewis. In the public eye and to his girlfriend Cyndi who apparently leaves him during a roadside incident, Dickie is washed up.After talking to an old friend, Leif Garrett, Dickie is absolutely convinced that a new Rob Reiner movie in the works, Mr. Blake's Backyard, will be his comeback vehicle. Even after Sidney, his agent, does not land him an audition, Dickie persists. While on duty at Morton's, he joy rides in a customer's vehicle, drops into an Alcoholics Anonymous meeting, and he pesters Tom Arnold to hook him up with Reiner. After he is kicked out because he's not an alcoholic, Dickie fakes being wasted and crashes what turns out to be a Lamaze class. However, Brendan Fraser (in an uncredited cameo appearance) is in the class and, finding his entrance to the class hilarious and ridiculous, he agrees to help him out and calls Reiner for Dickie.Reiner bluntly tells Dickie that the part is not within his abilities because it requires knowing how a regular person lives. Unfortunately, Dickie never had a real childhood; he grew up in the limelight, and then his mother abandoned him when his show was cancelled. Desperate to prove to Reiner that he's right for the part, Dickie sells his raunchy autobiography to raise $30,000. With the money, he pays a family to \"adopt\" him for a month, as he believes he will \"watch and learn\".Once Dickie hires his \"family\", things get off to a rocky start, as George, the bread winning father, insists that they need the money, despite the rightful reservations of the other family members. Grace, the mother, comes to pity and gradually provides him with surrogate guidance, realizing the lesson from Blake's Backyard itself: sometimes all of the things you need are in your own backyard. Dickie learns much about himself and life in general, and begins to act as a third parent. He helps the family's son score a date with his dream girl and helps the daughter join the pep squad. Cyndi returns to him and is admired by George, who turns out to be an inept subject of fidelity.Sidney lands an audition for Dickie by donating a kidney to Reiner after Reiner is savagely beaten by a psychotic street douche whom Dickie provoked while unknowingly driving Reiner's vehicle; Dickie is awarded the part, proving that \"In Hollywood, Sometimes Your Dreams Can Come True...Again\". After George and Cyndi abandon the household together, Dickie gives up the part to be with the family he has come to love.The movie ends with a faux E! True Hollywood Story report on Dickie, who now turns his real story into a new sitcom that uses all of his old friends, as well as his new family (including the mother, whom he has married). The closing credits are a take-off on Relief albums listed as \"To help former child stars\". The song includes The Brady Bunch's Maureen McCormick singing \"But if one more person calls me 'Marcia', I'll bust his fucking head\", and many references to old television sitcoms.The movie shows Dickie interacting with numerous former child stars, played by over two dozen actual former stars lampooning their careers, such as Leif Garrett, Barry Williams, Dustin Diamond and Danny Bonaduce.","language":"English","Reception":"Dickie Roberts was a modest financial success, earning over $22 million against an estimated budget of $17 million[5]Critical reception was mostly negative. Rotten Tomatoes describes the film as \"rotten,\" with a 23% rating.[6] While critics generally agreed that the premise had potential and appreciated the involvement of actual former child stars, reactions to Spade's humor were mixed, and the attempts to make the film genuinely uplifting and sentimental in its second half were seen as contrived and unnecessary.[7] Roger Ebert gave the movie two-out-of-four stars, noting \"'Dickie Roberts: Former Child Star' has a premise that would be catnip for Steve Martin or Jim Carrey, but David Spade (who, to be fair, came up with the premise) casts a pall of smarmy sincerity over the material.\"[8] However, some critics still noted the film as an improvement over previous David Spade features, such as Joe Dirt.","box_office":"$23.8 million","Lawsuit":"Paramount Pictures was sued for trademark infringement and dilution after this film was released. Paramount had not requested permission from Wham-O for using the Slip 'n Slide in this movie.[2] The lawsuit claimed that the movie, which portrayed unsafe use of a Slip 'n Slide, might encourage others to use it in an unsafe manner.[3] The lawsuit was dismissed by a California court.[4]","cinematography":"Thomas E. Ackerman","production_company":"Happy Madison Productions","directed_by":"Sam Weisman","release_dates":"September 5, 2003 (2003-09-05)|||||","produced_by":"Adam Sandler Jack Giarraputo Fred Wolf","starring":"David Spade Mary McCormack Craig Bierko Rob Reiner","running_time":"98 minutes","music_by":"Christophe Beck Waddy Wachtel","edited_by":"Roger Bondelli","written_by":"David Spade Fred Wolf","budget":"$17 million"}