{"based_on":"Bringing Up Baby 1937 short story in Collier's  by Hagar Wilde","country":"United States","distributed_by":"RKO Radio Pictures","Legacy":"Bringing Up Baby was the second of four films starring Grant and Hepburn; the others were Sylvia Scarlett (1935), Holiday (1938) and The Philadelphia Story (1940). The film's concept was described by philosopher Stanley Cavell as a \"definitive achievement in the history of the art of film.\"[52] Cavell noted that Bringing Up Baby was made in a tradition of romantic comedy with inspiration from ancient Rome and Shakespeare.[53] Shakespeare's Much Ado About Nothing and As You Like It have been cited in particular as an influence on the film and the screwball comedy in general, with their \"haughty, self-sufficient men, strong women and fierce combat of words and wit.\"[54] Hepburn's character has been cited as an early example of the Manic Pixie Dream Girl film archetype.[55]The popularity of Bringing Up Baby has increased since it was shown on television during the 1950s, and by the 1960s film analysts (including the writers at Cahiers du Cinema in France) affirmed the film's quality. In a rebuttal of fellow New York Times critic Nugent's scathing review of the film at the time of release, A. O. Scott has said that you'll \"find yourself amazed at its freshness, its vigor, and its brilliance-qualities undiminished after sixty-five years, and likely to withstand repeated viewings.\"[43] Leonard Maltin stated that it is now \"considered the definitive screwball comedy, and one of the fastest, funniest films ever made; grand performances by all.\"[43]Bringing Up Baby has been adapted several times. Hawks recycled the nightclub scene in which Hepburn's dress is torn and Grant walks behind her in the 1964 comedy, Man's Favorite Sport. Peter Bogdanovich's 1972 film What's Up, Doc?, starring Barbra Streisand, was intended as an homage to the film, and has contributed to its reputation.[47] In the commentary track for Bringing Up Baby, Bogdanovich discusses how the coat-ripping scene in What's Up, Doc? was based on the scene in which Grant's coat and Hepburn's dress are torn in Bringing Up Baby.[30] The 1987 film Who's That Girl?, starring Madonna, is also loosely based on Bringing Up Baby.[56]In 1990 (the registry's second year), Bringing Up Baby was selected for preservation in the National Film Registry of the Library of Congress as \"culturally, historically, or aesthetically significant\". Entertainment Weekly voted the film 24th on its list of greatest films. In 2000, readers of Total Film magazine voted it the 47th-greatest comedy film of all time. Premiere ranked Cary Grant's performance as Dr. David Huxley 68th on its list of 100 all-time greatest performances,[57] and ranked Susan Vance 21st on its list of 100 all-time greatest movie characters.[58]The American Film Institute ranked the film 97th on its 100 greatest American films of all time list, 88th on the 10th Anniversary Edition,[59] and named it the fourteenth-funniest American film of all time. It was also ranked 51st on the 100 Passions list, and nominated for the AFI's 10 Top 10 romantic comedy list as was the quote \"It isn't that I don't like you, Susan, because after all, in moments of quiet, I'm strangely drawn toward you; but, well, there haven't been any quiet moments!\" for the AFI's 100 Years...100 Movie Quotes list.[60] The National Society of Film Critics also included Bringing Up Baby in their \"100 Essential Films\", considering it to be arguably the director's best film.[54]","Plot":"David Huxley (Cary Grant) is a mild-mannered paleontologist. For the past four years, he has been trying to assemble the skeleton of a Brontosaurus but is missing one bone: the \"intercostal clavicle\". Adding to his stress is his impending marriage to the dour Alice Swallow (Virginia Walker) and the need to impress Elizabeth Random (May Robson), who is considering a million-dollar donation to his museum.The day before his wedding, David meets Susan Vance (Katharine Hepburn) by chance on a golf course. She is a free-spirited young lady, and (unknown to him at first) Mrs. Random's niece. Susan's brother, Mark, has sent her a tame leopard from Brazil named Baby (Nissa) to give to their aunt. (The leopard is native to Africa and Asia but not to South America.) Susan thinks David is a zoologist (rather than a paleontologist), and persuades David to go to her country home in Connecticut to help bring up Baby (which includes singing \"I Can't Give You Anything But Love\" to soothe the leopard). Complications arise as Susan falls in love with David and tries to keep him at her house as long as possible to prevent his marriage.David finally receives the intercostal clavicle, but Susan's dog George (Asta) steals and buries it. Susan's aunt, Elizabeth Random, arrives. The dowager is unaware of David's identity, since Susan has introduced him as \"Mr. Bone\". Baby and George run off, and Susan and David mistake a dangerous leopard who has escaped from a nearby circus (also portrayed by Nissa) for Baby.They are jailed by a befuddled town policeman, Constable Slocum (Walter Catlett), for breaking into the house of Dr. Fritz Lehman (Fritz Feld) (where they had cornered the circus leopard). When Slocum does not believe their story, Susan tells him they are members of the \"Leopard Gang\"; she calls herself \"Swingin' Door Susie\", and David \"Jerry the Nipper\".[a] David fails to convince the constable that Susan makes things up \"from motion pictures she's seen\". Eventually, Alexander Peabody (George Irving) shows up to verify everyone's identity. Susan (who has sneaked out a window) unwittingly drags the irritated circus leopard into the jail; David saves her, using a chair to shoo the big cat into a cell.Several weeks later, Susan finds David (who has been jilted by Alice because of her) working on his brontosaurus reconstruction at the museum. After giving him the missing bone (which she found by trailing George), she tells him she has persuaded her aunt to make the large donation. Against his advice, Susan climbs a tall ladder next to the dinosaur to be closer to him. When the ladder starts swaying from side to side dangerously, she climbs onto the skeleton. Before it collapses, David grabs her hand. Surveying the wreckage of his work, David gives up and admits that he cannot live without her.","language":"English","Reception and box office":"The film received good advance reviews; Otis Ferguson of The New Republic thought the film very funny, praising Hawks' direction.[36] Variety praised the film, singling out Hawks' pacing and direction, calling Hepburn's performance \"one of her most invigorating screen characterizations\" and saying Grant \"performs his role to the hilt\";[37] their only criticism was the length of the jail scene.[38] Film Daily called it \"literally a riot from beginning to end, with the laugh total heavy and the action fast.\"[39] Harrison's Reports called the film \"An excellent farce\" with \"many situations that provoke hearty laughter,\"[40] and John Mosher of The New Yorker wrote that both stars \"manage to be funny\" and that Hepburn had never \"seemed so good-natured.\"[41] However, Frank S. Nugent of the New York Times disliked the film, considering it derivative and cliché-ridden, a rehash of dozens of other screwball comedies of the period. He labeled Hepburn's performance \"breathless, senseless, and terribly, terribly fatiguing\",[42] and added, \"If you've never been to the movies, Bringing Up Baby will be new to you – a zany-ridden product of the goofy-farce school. But who hasn't been to the movies?\"[43]Despite Bringing Up Baby's reputation as a flop, it was successful in some parts of the U.S. The film premiered on February 16, 1938 at the Golden Gate Theatre in San Francisco (where it was a hit), and was also successful in Los Angeles, Portland, Denver, Cincinnati and Washington, D.C.. However, it was a financial disappointment in the Midwest, as well as most other cities in the country, including NYC; to RKO's chagrin, the film's premiere in New York on March 3, 1938 at Radio City Music Hall made only $70,000 and it was pulled after one week[44] in favor of Jezebel with Bette Davis.[45]During its first run, Bringing Up Baby made $715,000 in the U.S. and $394,000 in foreign markets for a total of $1,109,000;[32] its reissue in 1940 and 1941 made an additional $95,000 in the US and $55,000 in foreign markets.[44] Following its second run, the film made a profit of $163,000.[32] Due to its perceived failure, Hawks was released early from his two-film contract with RKO[32] and Gunga Din was eventually directed by George Stevens.[46] Hawks later said the film \"had a great fault and I learned an awful lot from that. There were no normal people in it. Everyone you met was a screwball and since that time I learned my lesson and don't intend ever again to make everybody crazy\".[47] The director went on to work with RKO on three films over the next decade.[48] Long before Bringing Up Baby's release, Hepburn had been branded \"box-office poison\" by Harry Brandt (president of the Independent Theatre Owners of America) and thus was allowed to buy out her RKO contract for $22,000.[49][50] However, many critics marveled at her new skill at low comedy; Life magazine called her \"the surprise of the picture\".[51] Hepburn's former boyfriend Howard Hughes bought RKO in 1941, and sold it in 1959; when he sold the company, Hughes retained the copyright to six films (including Bringing Up Baby).[48]","box_office":"$1,109,000","cinematography":"Russell Metty","production_company":"RKO Radio Pictures","directed_by":"Howard Hawks","bringing_up_baby":"Original theatrical poster","release_dates":"February 16, 1938 (1938-02-16)|||||","Production":"In March 1937 Howard Hawks signed a contract at RKO for an adaptation of Rudyard Kipling's \"Gunga Din\", which had been in pre-production since the previous fall. When RKO was unable to borrow Clark Gable, Spencer Tracy and Franchot Tone from Metro-Goldwyn-Mayer for the film and the adaptation of \"Gunga Din\" was delayed, Hawks began looking for a new project. In April 1937 he read a short story by Hagar Wilde in Collier's magazine called \"Bringing Up Baby\" and immediately wanted to make a film from it,[3] remembering that it made him laugh out loud.[4] RKO bought the screen rights in June[5] for $1,004, and Hawks worked briefly with Wilde on the film's treatment.[6] Wilde's short story differed significantly from the film: David and Susan are engaged, he is not a scientist and there is no dinosaur, intercostal clavicle or museum. However, Susan gets a pet panther from her brother Mark to give to their Aunt Elizabeth; David and Susan must capture the panther in the Connecticut wilderness with the help of Baby's favorite song, \"I Can't Give You Anything but Love, Baby\".[5]Hawks then hired screenwriter Dudley Nichols, best known for his work with director John Ford, for the script; Wilde would develop the characters and comedic elements of the script, while Nichols would take care of the story and structure. Hawks worked with the two writers during summer 1937, and they came up with a 202-page script.[7] Wilde and Nichols wrote several drafts together, beginning a romantic relationship and co-authoring the Fred Astaire and Ginger Rogers film Carefree a few months later.[5] The Bringing Up Baby script underwent several changes, and at one point there was an elaborate pie fight, inspired by Mack Sennett films. Major Applegate had an assistant and food taster named Ali (which was intended to be played by Mischa Auer), but this character was replaced with Aloysius Gogarty. The script's final draft had several scenes in the middle of the film in which David and Susan declare their love for each other which Hawks cut during production.[8]Nichols was instructed to write the film for Hepburn, with whom he had worked on John Ford's Mary of Scotland in 1936.[9] Barbara Leaming alleged that Ford had an affair with Hepburn, and claims that many of the characteristics of Susan and David were based on Hepburn and Ford.[10] Nichols was in touch with Ford during the screenwriting, and the film included such members of the John Ford Stock Company as Ward Bond, Barry Fitzgerald, D'Arcy Corrigan and associate producer Cliff Reid.[11] John Ford was a friend of Hawks, and visited the set. The round glasses Grant wears in the film are reminiscent of Harold Lloyd and of Ford.[12]Filming was initially scheduled to begin on September 1, 1937 and wrap on October 31, but was delayed for several reasons. Production had to wait until mid-September to clear the rights for \"I Can't Give You Anything but Love, Baby\" for $1,000. In August Hawks hired gag writers Robert McGowan and Gertrude Purcell[13] for uncredited script rewrites, and McGowan added a scene inspired by the comic strip Professor Dinglehoofer and his Dog in which a dog buries a rare dinosaur bone.[8] RKO paid King Features $1,000 to use the idea for the film on September 21.[14]It is debated by some whether Bringing Up Baby is the first fictional work (apart from pornography) to use the word \"gay\" in a homosexual context.[15][16] In one scene, Cary Grant's character is wearing a woman's marabou-trimmed négligée; when asked why, he replies exasperatedly \"Because I just went gay all of a sudden!\" (leaping into the air at the word \"gay\"). As the term \"gay\" did not become familiar to the general public until the Stonewall riots in 1969,[17] it is debated whether the word was used here in its original sense (meaning \"happy\"[18]) or is an intentional, joking reference to homosexuality.[18]In the film, the line was an ad-lib by Grant and not in any version of the original script.[19] According to Vito Russo in The Celluloid Closet (1981, revised 1987), the script originally had Grant's character say \"I...I suppose you think it's odd, my wearing this. I realize it looks odd...I don't usually...I mean, I don't own one of these\". Russo suggests that this indicates that people in Hollywood (at least in Grant's circles) were familiar with the slang connotations of the word; however, neither Grant nor anyone involved in the film suggested this.[17]After briefly considering Hawks' cousin Carole Lombard for the role of Susan Vance, Katharine Hepburn was chosen to play the wealthy New Englander because of her background and similarities to the character. RKO agreed to the casting, but had reservations because of Hepburn's salary and lack of box-office success for several years.[7] Producer Lou Lusty said, \"You couldn't even break even if a Hepburn show cost eight hundred grand.\"[14] At first, Hawks and producer Pandro S. Berman could not agree on who to cast in the role of David Huxley. Hawks initially wanted silent-film comedian Harold Lloyd; Berman rejected Lloyd and Ronald Colman, offering the role to Robert Montgomery, Fredric March and Ray Milland (all of whom turned it down).[20]Hawks' friend Howard Hughes finally suggested Cary Grant for the role.[21] Grant had just finished shooting his breakthrough romantic comedy The Awful Truth,[7] and Hawks may have seen a rough cut of the unreleased film.[14] Grant then had a non-exclusive, four-picture deal with RKO for $50,000 per film, and Grant's manager used his casting in the film to renegotiate his contract, earning him $75,000 plus the bonuses Hepburn was receiving.[20] Grant was initially concerned about being able to play an intellectual character and took two weeks to accept the role, despite the new contract. Hawks built Grant's confidence by promising to coach him throughout the film, instructing him to watch Harold Lloyd films for inspiration.[22] Grant met with Howard Hughes throughout the film to discuss his character, which he said helped his performance.[22]Hawks obtained character actors Charlie Ruggles on loan from Paramount Pictures for Major Horace Applegate and Barry Fitzgerald on loan from The Mary Pickford Corporation to play gardener Aloysius Gogarty.[7] Hawks cast Virginia Walker as Alice Swallow, David's fiancée; Walker was under contract to him and later married his brother William Hawks.[23] As Hawks could not find a panther that would work for the film, Baby was changed to a leopard so they could cast the trained leopard Nissa, who had worked in films for eight years, making several B-movies.[14]Shooting began September 23, 1937 and was scheduled to end November 20, 1937[24] on a budget of $767,676.[25] Filming began in-studio with the scenes in Susan's apartment, moving to the Bel Air Country Club in early October for the golf-course scenes.[14] The production had a difficult start due to Hepburn's struggles with her character and her comedic abilities. She frequently overacted, trying too hard to be funny,[25] and Hawks asked vaudeville veteran Walter Catlett to help coach her. Catlett acted out scenes with Grant for Hepburn, showing her that he was funnier when he was serious. Hepburn understood, acted naturally and played herself for the rest of the shoot; she was so impressed by Catlett's talent and coaching ability that she insisted he play Constable Slocum in the film.[26][27]Most shooting was done at the Arthur Ranch in the San Francisco Valley, which was used as Aunt Elizabeth's estate for interior and exterior scenes.[14] Beginning at the Arthur Ranch shoot,[19] Grant and Hepburn often ad-libbed their dialogue and frequently delayed production by making each other laugh.[28] The scene where Grant frantically asks Hepburn where his bone is was shot from 10 am until well after 4 pm because of the stars' laughing fits.[29] After one month of shooting Hawks was seven days behind schedule. During the filming, Hawks would refer to four different versions of the film's script and make frequent changes to scenes and dialogue.[19] His leisurely attitude on set and shutting down production to see a horse race contributed to the time it took to film,[29] and he took twelve days to shoot the Westlake jail scene instead of the scheduled five.[19] Hawks later facetiously blamed the setbacks on his two stars' laughing fits and having to work with two animal actors.[29]The terrier George was played by Skippy, known as Asta in The Thin Man film series and co-starring with Grant (as Mr. Smith) in The Awful Truth. The tame leopard Baby and the escaped circus leopard were both played by a trained leopard, Nissa. The big cat was supervised by its trainer, Olga Celeste, who stood by with a whip during shooting. At one point, when Hepburn spun around (causing her skirt to twirl) Nissa lunged at her and was subdued when Celeste cracked her whip. Hepburn wore heavy perfume to keep Nissa calm and was unafraid of the leopard, but Grant was terrified; most scenes of the two interacting are done in close-up with a stand-in. Hepburn played upon this fear by throwing a toy leopard through the roof of Grant's dressing room during production[29] There were also several news reports about Hawks' difficulty filming a live leopard, and some scenes required rear-screen projection.[30]Hawks and Hepburn had a confrontation one day during shooting. While Hepburn was chatting with a crew member, Hawks yelled \"Quiet!\" until the only person still talking was Hepburn. When Hepburn paused and realized that everyone was looking at her, she asked what was the matter; Hawks asked her if she was finished imitating a parrot. Hepburn took Hawks aside, telling him never to talk to her like that again since she was old friends with most of the crew. When Hawks (an older friend of the crew) asked a lighting tech who he would rather drop a light on, Hepburn agreed to behave on set. A variation of this scene, with Grant yelling \"Quiet!\", was incorporated into the film.[27][31]The Westlake Street set was shot at 20th Century Fox Studios.[13] Filming was eventually completed on January 6, 1938 with the scenes outside Mr. Peabody's house. RKO producers expressed concerns about the film's delays and expense, coming 40 days over schedule and $330,000 over budget, and also disliked Grant's glasses and Hepburn's hair.[31] The film's final cost was $1,096,796.23, primarily due to overtime clauses in Hawks', Grant's and Hepburn's contracts.[24] The film's cost for sets and props was only $5,000 over budget, but all actors (including Nissa and Skippy) were paid approximately double their initial salaries. Hepburn's salary rose from $72,500 to $121,680.50, Grant's salary from $75,000 to $123,437.50 and Hawks' salary from $88,046.25 to $202,500. The director received an additional $40,000 to terminate his RKO contract on March 21, 1938.[32]Hawks' editor, George Hively, cut the film during production and the final prints were made a few days after shooting ended.[24] The first cut of the film (10,150 feet long)[33] was sent to the Hayes Office in mid-January.[34] Despite several double entendres and sexual references it passed the film,[24] overlooking Grant saying he \"went gay\" or Hepburn's reference to George urinating. The censor's only objections were to the scene where Hepburn's dress is torn, and references to politicians (such as Al Smith and Jim Farley).[34]Like all Hawks' comedies, the film is known for its fast pace (despite being filmed primarily in long medium shots, with little cross-cutting). Hawks told Peter Bogdanovich, \"You get more pace if you pace the actors quickly within the frame rather than cross cutting fast\".[30]By February 18, the film had been cut to 9,204 feet.[34] It had two advance previews in January 1938, where it received either As or A-pluses on audience-feedback cards. Producer Pandro S. Berman wanted to cut five more minutes, but relented when Hawks, Grant and Cliff Reid objected.[34] At the film's second preview, the film received rave reviews and RKO expected a hit.[24] The film's musical score is minimal, primarily Grant and Hepburn singing \"I Can't Give You Anything But Love, Baby\". There is incidental music in the Ritz scene, and an arrangement of \"I Can't Give You Anything But Love, Baby\" during the opening and closing credits by musical director Roy Webb.[35]","produced_by":"Cliff Reid Howard Hawks","starring":"Katharine Hepburn Cary Grant Charles Ruggles Walter Catlett May Robson Fritz Feld Barry Fitzgerald","running_time":"102 minutes","music_by":"Roy Webb (musical director) Jimmy McHugh Dorothy Fields (original writers of I Can't Give You Anything but Love, Baby)","edited_by":"George Hively","written_by":"Dudley Nichols Hagar Wilde Robert McGowan (uncredited) Gertrude Purcell (uncredited)","budget":"$1,096,796.23"}