{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Arthur Sheekman","story_by":"Irving Berlin","blue_skies":"Theatical release poster","Plot":"The story is told in a series of vignettes and musical numbers that serve to show events in flashback. Our narrative link is New York radio star Jed Potter, who once was a renowned Broadway hoofer. The conceit is that he is on the air, telling his life story... which does not yet have an ending. The tale starts just after World War I and centers on two men who became friends while serving in the Army: rising dancer Potter and the business-minded Johnny Adams. While young, hardworking Potter dreams of and works for stardom, the more laid-back and less disciplined Adams has hopes of becoming a successful nightclub owner. In time, dancer Potter falls in love with a band singer, a \"very pretty girl\" named Mary O'Hara. He takes Mary to Adams' nightclub, and she takes a shine to Adams. Potter warns Mary that his old buddy is not the marrying kind. So, of course, she marries Adams. The union is not a happy one, despite the birth of a child. Adams' nightclub business is anything but a resounding success, and it turns out Potter was right: Adams is self-centered and unable to commit to his nightclubs, his marriage, or his daughter. The couple divorces, and Mary tries again with Potter. The two even become engaged. But Mary can't go through with the wedding and takes off. A devastated Potter turns to booze and subsequently suffers an accident that puts an end to his dancing career. He winds up behind a radio microphone, sharing his story with his audience, hoping that wherever Mary is, she can hear him...","language":"English","Reception":"In its initial release period in the USA, the movie took $5.7 million in rental income making it one of the box office successes of the year. Variety gave a favorable review. \"Blue Skies” is another in the show biz cavalcade cycle and it’ll spell beaucoup blue skies and black ink for any exhibitor. With Crosby, Astaire and Joan Caulfield on the marquee, a wealth of Irving Berlin songs and lush Technicolor production values, this filmusical can’t miss for terrific grosses. . .Certainly, for Astaire, it’s perhaps a new triumph. If he ever seriously thought of retiring, ‘Skies’ should postpone any such ideas...Crosby is Crosby although a slightly heftier Bing. He’s the same troubadour, chirping the ditties as only Crosby does even though his waistline is somewhat more generous than behooves a juve.[2]Bosley Crowther of The New York Times liked it too. \"So many screen exercises in the music-album line have been so cluttered up with “biography” that it is a pleasure at last to see one in which a tune-vender’s life and his music are not mutually and mawkishly abused. Such a one is the Paramount’s current and cheerfully diverting “Blue Skies,” which catalogues some songs of Irving Berlin without catalyzing that gentleman’s career. And with Fred Astaire and Bing Crosby as its bright particular stars, everyone’s probity is honored by it—especially Mr. Berlin’s.\"[3]According to Variety the film earned $5 million in rentals in 1946.[9]","box_office":"$5.7 million (est. US/ Canada rentals)[1]","cinematography":"Charles Lang|William E. Snyder|","production_company":"Paramount Pictures","directed_by":"Stuart Heisler","Soundtrack and dance routines":"Crosby applies his famous relaxed crooning style to the many songs he delivers here. In contrast, Astaire, assisted by choreographers Hermes Pan and Dave Robel (for the \"Puttin' on the Ritz\" routine), delivers a series of dances which explore the theme of confrontation, both with partners and with the audience. As a result, it is one of only a few Astaire films not to feature a romantic partnered dance.The other Berlin songs which featured only as background music in the film are, in order of use: \"Tell Me Little Gypsy\" (1920), \"Nobody Knows\" (1920), \"Mandy\" (1918), \"I Wonder\" (1919), \"Some Sunny Day\" (1922), \"When You Walked Out Someone Else Walked In\" (1923), \"Because I Love You\" (1926), \"Homesick\" (1922), \"How Many Times\" (1926), \"The Song Is Ended\" (1927), \"Lazy\" (1924), \"Always\" (1925) and \"I Can't Remember\" (1933).Other Irving Berlin sings which were recorded by Bing Crosby for the film soundtrack but omitted from the released print were \"Say It Isn't So\", \"What'll I Do\", \"All Alone\", \"Remember\", \"I'm Putting All My Eggs in One Basket\", \"Cheek to Cheek\" and \"God Bless America\".[6]Bing Crosby recorded many of the songs for Decca Records.[7] and these were also issued as a 5-disc, 78 rpm album titled Blue Skies (Decca album). “You Keep Coming Back Like a Song” was in the Billboard charts for six weeks with a peak position of #12.[8] Crosby's songs were also included in the Bing's Hollywood series.","narrated_by":"Fred Astaire","release_dates":"October 16, 1946 (1946-10-16) (USA)|||||","produced_by":"Sol C. Siegel","starring":"Bing Crosby|Fred Astaire|Joan Caulfield|","running_time":"104 minutes","music_by":"Irving Berlin","edited_by":"LeRoy Stone","written_by":"Allan G. Scott (adaptation)"}