{"country":"United States","distributed_by":"Warner Bros.","story_by":"Harry Julian Fink R.M. Fink Jo Heims (uncredited)","Legacy":"Dirty Harry received recognition from the American Film Institute. The film was ranked #41 on 100 Years...100 Thrills, a list of America's most heart-pounding movies.[60] Harry Callahan was selected as the 17th greatest movie hero on 100 Years ... 100 Heroes and Villains.[61] The movie's famous quote \"You've got to ask yourself one question: 'Do I feel lucky?' Well, do ya, punk?\" was ranked 51st on 100 Years...100 Movie Quotes.[62] Dirty Harry was also on the ballot for several other AFI's 100 series lists including 100 Years... 100 Movies,[63] 100 Years ... 100 Movies (10th Anniversary Edition),[64] and 100 Years of Film Scores.[65]","language":"English","box_office":"$35,976,000[1]","cinematography":"Bruce Surtees","production_company":"Malpaso Productions","directed_by":"Don Siegel","release_dates":"December 23, 1971 (1971-12-23)|||||","Production":"The script, titled Dead Right, was originally written by Harry Julian and Rita M. Fink, a story about a hard-edged New York City police inspector, Harry Callahan, determined to stop Travis, a serial killer, by any means at his disposal.[4][5] The original draft ended with a police sniper, instead of Callahan, shooting Scorpio. Another earlier version of the story was set in Seattle, Washington. Four more drafts of the script were written.Although Dirty Harry is arguably Clint Eastwood's signature role, he was not a top contender for the part. The role of Harry Callahan was offered to John Wayne and Frank Sinatra,[6] and later to Robert Mitchum, Steve McQueen, and Burt Lancaster.[4] In his 1980 interview with Playboy, George C. Scott claimed that he was initially offered the role, but the script's violent nature led him to turn it down. When producer Jennings Lang initially could not find an actor to take the role of Callahan, he sold the film rights to ABC Television. Although ABC wanted to turn it into a television film, the amount of violence in the script was deemed too excessive for television, so the rights were sold to Warner Bros.[7]Warner Bros. purchased the script with a view to casting Frank Sinatra in the lead. Sinatra was 55 at the time and since the character of Harry Callahan was originally written as a man in his mid-to-late 50s (and Eastwood was then only 41), Sinatra fit the character profile. Initially, Warner Bros. wanted either Sydney Pollack or Irvin Kershner to direct.[5] Kershner was eventually hired when Sinatra was attached to the title role, but when Sinatra eventually left the film, so did Kershner.[8]John Milius was asked to work on the script when Sinatra was attached, along with Kershner as director. Milius claimed he was requested to write the screenplay for Sinatra in three weeks.[9] Terrence Malick wrote a draft of the film dated November 1970 (John Milius and Harry Julian Fink are also named as co-writers) in which the shooter (also named Travis) was a vigilante who killed wealthy criminals who had escaped justice.[10] Malick's ideas formed the basis for the sequel, Magnum Force, though with a group of vigilante motorcycle cops instead of a single shooter.Details about the film were first released in film industry trade papers in April, September and November 1970, with Frank Sinatra attached as Harry Callahan and Irvin Kershner listed as director and producer, with Arthur Jacobson acting as associate producer.[4]After Sinatra left the project, the producers started to consider younger actors for the role. Burt Lancaster turned down the lead role because he strongly disagreed with the violent, end-justifies-the-means moral of the story. He believed the role and plot contradicted his belief in collective responsibility for criminal and social justice and the protection of individual rights.[11] Marlon Brando was considered for the role, but was never formally approached. Both Steve McQueen and Paul Newman turned down the role.[4] McQueen refused to make another \"cop movie\" after Bullitt (1968). He would also turn down the lead in The French Connection the same year, giving the same reason. Believing the character was too \"right-wing\" for him, Newman suggested that the film would be a good vehicle for Eastwood.[8]The screenplay was initially brought to Eastwood’s attention around 1969 by Jennings Lang. Warner Bros offered him the part while still in post-production for his directorial debut film Play Misty for Me. By December 17, 1970, a Warner Brothers studio press release announced that Clint Eastwood would star in as well as produce the film through his company, Malpaso.Eastwood was given a number of scripts, but he ultimately reverted to the original as the best vehicle for him.[12] In a 2009 MTV interview, Eastwood said \"So I said, 'I'll do it,' but since they had initially talked to me, there had been all these rewrites. I said, 'I'm only interested in the original script'.\" Looking back on the 1971 Don Siegel film, he remembered \"[The rewrites had changed] everything. They had Marine snipers coming on in the end. And I said, 'No. This is losing the point of the whole story, of the guy chasing the killer down. It's becoming an extravaganza that's losing its character.' They said, 'OK, do what you want.' So, we went and made it.\"[13]Eastwood also agreed to star in the film only on condition that Don Siegel direct. Siegel was under contract to Universal at the time, and Eastwood personally went to the studio heads to ask them to \"loan\" Siegel to Warner. The two had just completed the movie The Beguiled (1971).[citation needed]Scorpio was loosely based on the real-life Zodiac Killer, an unidentified serial killer who had committed five murders in the San Francisco Bay Area several years earlier.[14] Elements of Gary Stephen Krist were also worked into the characterization, as Scorpio, like Krist, kidnaps a young girl and buries her alive while demanding ransom. In a later novelization of the film, Scorpio was referred to as \"Charles Davis\", a former mental patient from Springfield, Massachusetts who murdered his grandparents as a teenager.[15] There are significant differences between the book and the film. Among the differences are: Scorpio's point of view — in the book he uses astrology to make decisions (including being inspired to abduct Ann Mary Deacon); Harry working on a murder case involving a mugger before he is assigned to Scorpio; the omission of the suicide jumper; and Harry throwing away his badge at the end. Audie Murphy was initially considered to play Scorpio, but he died in a plane crash before his decision on the offer could be made.[16] When Kershner and Sinatra were still attached to the project, James Caan was under consideration for the role of Scorpio.[16] The part eventually went to a relatively unknown actor, Andy Robinson. Eastwood had seen Robinson in a play called Subject to Fits and recommended him for the role of Scorpio; his unkempt appearance fit the bill for a psychologically unbalanced hippie.[17] Siegel told Robinson that he cast him in the role of the Scorpio killer because he wanted someone \"with a face like a choirboy.\" Robinson's portrayal was so memorable that after the film was released he was reported to have received several death threats and was forced to get an unlisted telephone number. In real life, Robinson is a pacifist who deplores the use of firearms. Early in principal photography on the film, Robinson would reportedly flinch in discomfort every time he was required to use a gun. As a result, Siegel was forced to halt production briefly and sent Robinson for brief training in order to learn how to fire a gun convincingly.[18]Director John Milius owns one of the actual Model 29s used in principal photography in Dirty Harry and Magnum Force.[19] As of March 2012 it is on loan to the National Firearms Museum in Fairfax, Virginia, and is in the Hollywood Guns display in the William B. Ruger Gallery.[20]Glenn Wright, Eastwood's costume designer since Rawhide, was responsible for creating Callahan's distinctive old-fashioned brown and yellow checked jacket to emphasize his strong values in pursuing crime.[17] Filming for Dirty Harry began in April 1971 and involved some risky stunts, with much footage shot at night and filming the city of San Francisco aerially, a technique for which the film series is renowned.[17] Eastwood performed the stunt in which he jumps onto the roof of the hijacked school bus from a bridge, without a stunt double. His face is clearly visible throughout the shot. Eastwood also directed the suicide-jumper scene.The line, \"My, that's a big one,\" spoken by Scorpio when Callahan removes his gun, was an ad-lib by Robinson. The crew broke into laughter as a result of the double entendre and the scene had to be re-shot, but the line stayed.The final scene, in which Callahan throws his badge into the water, is a homage to a similar scene from 1952's High Noon.[21] Eastwood initially did not want to toss the badge, believing it indicated that Callahan was quitting the police department. Siegel argued that tossing the badge was instead Callahan's indication of casting away the inefficiency of the police force's rules and bureaucracy.[21] Although Eastwood was able to convince Siegel not to have Callahan toss the badge, when the scene was filmed, Eastwood changed his mind and went with Siegel's preferred ending.[21]One evening Eastwood and Siegel had been watching the San Francisco 49ers in Kezar Stadium in the last game of the season and thought the eerie Greek amphitheater-like setting would be an excellent location for shooting one of the scenes where Callahan encounters Scorpio.[22]In San Francisco, CaliforniaIn Marin County, CaliforniaIn Los Angeles County, California","running_time":"102 minutes","Release":"The film caused controversy when it was released, sparking debate over issues ranging from police brutality to victims' rights and the nature of law enforcement. Feminists in particular were outraged by the film and at the 44th Academy Awards protested outside the Dorothy Chandler Pavilion, holding up banners which read messages such as \"Dirty Harry is a Rotten Pig\".[36]Jay Cocks of Time praised Eastwood's performance as Dirty Harry, describing him as \"giving his best performance so far, tense, tough, full of implicit identification with his character\".[37] Neal Gabler also praised Eastwood's performance in the film: \"There's an incredible pleasure in watching Clint Eastwood do what he does, and he does it so well.\"[38] Film critic Roger Ebert, while praising the film's technical merits, denounced the film for its \"fascist moral position.\"[39] A section of the Philippine police force ordered a print of the film for use as a training film.[40][41]The film's critical reputation has grown in stature and it is commonly listed among the greatest films of all time. Dirty Harry was selected by in 2008 by Empire magazine as one of The 500 Greatest Movies of All Time.[42] It was placed similarly on The Best 1000 Movies Ever Made list by The New York Times.[43] In January 2010 Total Film included the film on its list of The 100 Greatest Movies of All Time.[44] TV Guide and Vanity Fair also included the film on their lists of the 50 best movies.[45][46]A generation later, Dirty Harry is now regarded as one of the best films of 1971.[47][48][49] Based mainly on reviews from the 2000s, the film holds a 95% approval rating on the review aggregate website Rotten Tomatoes.[50] It was nominated at the Edgar Allan Poe Awards for Best Motion Picture.[51]In 2014, Time Out polled several film critics, directors, actors and stunt actors to list their top action films.[52] Dirty Harry was listed at 78th place in this list.[53]The benefit world premiere of Dirty Harry was held at Loews' Market Street Cinema, 1077 Market Street (San Francisco),[54] on December 22, 1971.[55][56] The film was the fourth-highest grossing film of 1971, earning an approximate total of $36 million in its U.S. theatrical release,[1] making it a major financial success in comparison with its modest $4 million budget.[57]Warner Home Video owns rights to the Dirty Harry series. The studio first released the film to VHS and Betamax in 1979. Dirty Harry (1971) has been remastered for DVD three times — in 1998, 2001 and 2008. It has been repurposed for several DVD box sets. Dirty Harry made its high-definition debut with the 2008 Blu-ray Disc. The commentator on the 2008 DVD is Clint Eastwood biographer Richard Schickel.[58] The film, along with its sequels, has been released in High Definition, on various Digital distribution services, including the iTunes Store.[59]","budget":"$4 million","screenplay_by":"Harry Julian Fink R.M. Fink Dean Riesner John Milius (uncredited)","Plot":"A psychopathic serial killer calling himself \"Scorpio\" (Andy Robinson) shoots a young woman in a San Francisco swimming pool from a nearby rooftop. SFPD Inspector Harry Callahan (Clint Eastwood) finds a blackmail message demanding the city pay him $100,000 whilst also promising that for each day his demand is refused he will commit a murder; his next victim will be \"a Catholic priest or a nigger.\" The chief of police and the mayor (John Vernon) assign the inspector to the case, despite his reputation for violent solutions.While in a local diner, Callahan observes a bank robbery in progress. He goes outside and kills two of the robbers while wounding a third. Callahan then challenges him:I know what you’re thinking: 'Did he fire six shots or only five?' Well, to tell you the truth, in all this excitement, I’ve lost track myself. But being this is a .44 Magnum, the most powerful handgun in the world, and would blow your head clean off, you’ve got to ask yourself one question: 'Do I feel lucky?' Well, do you, punk?After the robber surrenders, he tells Callahan that he must know if the gun was still loaded. Callahan pulls the trigger with the weapon pointed directly at the robber, and laughs as it is revealed to be empty.When Scorpio kills a young black boy from another rooftop, the police believe the killer will next pursue a Catholic priest. Callahan and his rookie partner, Chico Gonzalez (Reni Santoni), wait for Scorpio near a Catholic church, where a rooftop-to-rooftop shootout ensues, with Callahan attempting to snipe Scorpio with a rifle while Scorpio returns fire with a submachine gun. Scorpio escapes, killing a police officer disguised as a priest.Scorpio then demands $200,000 ($1.2 million today) for a teenage girl he has kidnapped, threatening to let her suffocate otherwise. The mayor decides to pay and tells Callahan to deliver the money with no tricks, but the inspector wears a covert listening device, brings a switchblade, and has his partner follow him. As Scorpio sends Callahan to various payphones throughout the city to make sure he is alone, the chase ends at Mount Davidson. Scorpio brutally beats Callahan and tells him he's going to kill him and let the girl die anyway; Gonzalez comes to his partner's rescue but is wounded. Callahan stabs Scorpio in the leg, but the killer escapes without the money.The doctor who has treated Scorpio's wound phones the police and tells Callahan and his new partner that he has seen Scorpio in Kezar Stadium. The officers break in and Callahan shoots Scorpio in his wounded leg. When Scorpio refuses to reveal the location of the girl and demands his rights, Callahan makes him confess by standing on the wounded leg, but the police are too late to save her.Because Callahan searched Scorpio's home without a warrant and improperly seized his rifle for evidence, the District Attorney (Josef Sommer) has no choice but to let Scorpio go. Outraged, Callahan warns that Scorpio will kill again and follows him on his own time. To thwart Callahan, Scorpio pays to have himself beaten by a thug, then claims the inspector is responsible. Despite Callahan's protests, he is ordered to stop following Scorpio.After stealing a gun from a liquor store owner, Scorpio kidnaps a school busload of children and demands a $200,000 ransom and a plane to leave the country. The mayor again insists on paying but Callahan angrily refuses when asked to deliver the ransom. Instead he locates the bus and jumps onto the top from a bridge. The bus crashes into a dirt embankment and Scorpio flees into a nearby quarry, where he has a running gun battle with Callahan. Finally Scorpio spots a young boy sitting near a pond and grabs him as a hostage.The inspector feigns surrender, but fires, wounding Scorpio in his left shoulder. The boy runs away and Callahan stands over Scorpio, gun drawn, reprising his \"Do you feel lucky, punk?\" speech. Scorpio lunges for his gun and Callahan shoots him instantly, causing him to fall into the water. As Callahan watches the dead body floating, he takes out his inspector's badge and hurls it into the water before walking away.","Real-life copycat crime and killers":"The film supposedly inspired a real-life crime, the Faraday School kidnapping.[66] In October 1972, soon after the release of the movie in Australia, two armed men (one of whom coincidentally had the last name 'Eastwood') kidnapped a teacher and six school children in Victoria. They demanded a $1 million ransom. The state government agreed to pay, but the children managed to escape and the kidnappers were subsequently jailed.[67]In September 1981 a case occurred in Germany, under circumstances quite similar to the Barbara Jane Mackle case: A ten-year-old girl, Ursula Hermann, was buried alive in a box fitted with ventilation, lighting and sanitary systems to be held for ransom. The girl suffocated in her prison within 48 hours of her abduction because autumn leaves had clogged up the ventilation duct. Twenty seven (27) years later, a couple was arrested and tried for kidnapping and murder on circumstantial evidence. According to the Daily Mail, the couple were inspired by the film Dirty Harry, in which Scorpio kidnaps a girl and places her in an underground box.[68] This case was also dealt with in the German TV series Aktenzeichen XY ... ungelöst.","Music":"The soundtrack for Dirty Harry was created by composer Lalo Schifrin, who created the iconic music for both the theme of Mission: Impossible and the Bullitt soundtrack, and who had previously collaborated with director Don Siegel in the production of Coogan's Bluff and The Beguiled, both also starring Clint Eastwood. Schifrin fused a wide variety of influences, including classical music, jazz and psychedelic rock, along with Edda Dell'Orso-style vocals, into a score that \"could best be described as acid jazz some 25 years before that genre began.\" According to one reviewer, the Dirty Harry soundtrack's influence \"is paramount, heard daily in movies, on television, and in modern jazz and rock music.\"[34][35]","References":"NotesBibliography","produced_by":"Don Siegel Robert Daley","starring":"Clint Eastwood Andy Robinson Harry Guardino Reni Santoni John Vernon","Influence":"Eastwood's iconic portrayal of the blunt, cynical, unorthodox detective, who is seemingly in perpetual trouble with his incompetent bosses, set the style for a number of his later roles and, indeed, a whole genre of \"loose-cannon\" cop films. The film resonated with an American public that had become weary and frustrated with the increasing violent urban crime that was characteristic of the time.[69] The film was released at a time when there were frequent reports of local and federal police committing offences and overstepping their authority by entrapment and obstruction of justice.[70] Author McGilligan, argued that America needed a hero, a winner at a time when the authorities were losing the battle against crime.[70] The box-office success of Dirty Harry led to the production of four sequels.The Fred Williamson blaxploitation film Black Cobra, mimicked the famous 'Do You Feel Lucky, Punk?' scene from Dirty Harry. The same scene was parodied in The Mask in 1994 and in The Man Who Knew Too Little in 1997. The British virtual band Gorillaz also entitled a song \"Dirty Harry\" on their album Demon Days. The film can also be counted as the chief influence on the Italian tough-cop films, Poliziotteschi, which dominated the 1970s and that were critically praised in Europe and the U.S. as well.Dirty Harry helped popularize the Smith & Wesson Model 29 revolver, chambered for the powerful .44 Magnum cartridge. The film initiated an increase in sales of the powerful handgun, which continues to be popular forty years after the film's release.[71] The .44 Magnum ranked second in a 2008 20th Century Fox poll of the most popular film weapons, after only the lightsaber of Star Wars fame. The poll surveyed approximately two thousand film fans.[72] However, the only appearances of the Model 29 in the movie are in the close-ups: Any time Eastwood actually fired the revolver, he was shooting a Smith & Wesson Model 25 in .45 Long Colt.[citation needed] The reason was that in 1971 .45 caliber 5-in-1 blank cartridges were readily available, while .44 caliber blanks did not exist. As the Model 25 and Model 29 are both built on the Smith & Wesson N frame, visually they are almost indistinguishable.In the 2004 film Starsky & Hutch The movie poster was briefly shown when Hutch is carrying Starsky up the stairs after the Disco, due to his influence on Cocaine.In the 2007 film Zodiac, also inspired by the Zodiac Killer, cartoonist Robert Graysmith approaches police detective Dave Toschi at the cinema, where he is watching Dirty Harry with his wife. When Graysmith tells Toschi he is going to catch the Zodiac killer, Toschi replies, \"Pal? They're already making movies about it.\"[73]In 2010, artist James Georgopoulos included the screen-used guns from Dirty Harry in his popular Guns of Cinema series.[74]The 2013 satirical comedy film InAPPropriate Comedy parodied the character Dirty Harry with a fake trailer called \"Flirty Harry\", in which Flirty Harry was played by Adrien Brody.The 2014 video game Sunset Overdrive features a gun with the same name.","music_by":"Lalo Schifrin","edited_by":"Carl Pingitore","dirty_harry":"Theatrical release poster by Bill Gold"}