{"country":"United States","distributed_by":"20th Century Fox","broken_arrow":"Theatrical release poster","Plot":"Major Vic Deakins (John Travolta) and Captain Riley Hale (Christian Slater) are pilots in the United States Air Force. After a sparring match, they are assigned to a top secret evening exercise over Utah, flying a B-3 Stealth Bomber (a fictional iteration of the B-2 Spirit stealth bomber) with two B83 nuclear bombs on board. After successfully evading Air Force radar during the exercise, Deakins distracts and attacks Hale. A struggle ensues, ending when Deakins ejects Hale. Deakins then releases the bombs from the plane without detonating them, and reports that Hale's gone rogue. He then ejects from the bomber himself, leaving it to crash on the mountainside over the Utah canyons.A search and rescue team is sent to recover the warheads. They do not find the warheads and report a \"Broken Arrow\", a situation wherein nuclear weapons are missing. The team later locates the warheads in a canyon but are killed by mercenaries, including Sgt. Kelly (Howie Long), a corrupt member of the team. Deakins arrives moments later and plots his next move with Pritchett (Bob Gunton), the operation's financier. They plan to blackmail the government with the threat of detonating the warhead in a civilian area.Hale survives the ejection and is found by Park Ranger Terry Carmichael (Samantha Mathis). He convinces her to help him track down Deakins and foil his plot. After recovering one of the warheads from a hijacked Humvee and escaping to a nearby copper mine, Hale attempts to disable them using a safety feature which would render them unusable, by intentionally entering the arming code incorrectly. However, Deakins had anticipated this possibility, and rigged the device. As a result, Hale's action instead arms the warhead, setting the detonation timer for 30 minutes.Unable to disarm the warhead, Hale hides the unarmed one deep in an abandoned mine. Deakins arrives and secures the unarmed warhead. He then shortens the detonation time to 13 minutes and destroys the keyboard so the device cannot be stopped, then leaves Hale and Terry to die. A NEST team helicopter chases Deakins' team. During the chase, Deakins kills Pritchett when he becomes fed up with the latter's complaints. Hale and Terry escape from the mine via an underground river just before the bomb detonates. The bomb's EMP destroys the NEST helicopter, allowing Deakins to escape. Terry and Hale track him to a motorboat used for transporting the warhead. While trying to steal the boat, Terry is forced to hide on board while Deakins moves the warhead. Military forces rescue Hale.Hale deduces that Deakins intends to use a train to transport the warhead. Travelling on helicopter with Colonel Wilkins (Delroy Lindo), Hale locates and infiltrates the train, and finds Terry. A gunfight ensues and the helicopter is destroyed; Wilkins and most of Deakins' mercenaries are killed. With his own helicopter sabotaged by Hale and his plan falling apart, Deakins decides to detonate the nuke early. Kelly holds Deakins at gunpoint and forces him to disarm the weapon. Hale takes advantage of the distraction and kicks Kelly out of the train to his death.Terry detaches the rear section of the train (with the bomb) from the front, but gets into a shootout with the engineer. The latter is shot and falls on the train brakes, causing the train to stop. The detached boxcars continue to coast at high speed. Deakins, still in possession of a device that can either disarm or detonate the bomb instantly, forces Hale to drop his gun and challenges him to close-quarters combat. Hale eventually overpowers Deakins, acquires the detonator, disarms the warhead and leaps out of the train. As the detached boxcars slam into the halted front half, the warhead flies into Deakins, and the entire train derails and explodes, incinerating him.Hale finds Terry and the damaged nuclear warhead. The two formally introduce themselves to each other amidst the wreckage.","language":"English","Cast and crew":"The original music score was composed by Hans Zimmer, and features guitarist Duane Eddy. An expanded double-disc limited set of the music score was released by La-La Land Records in February 2011. Also credited for additional music are Zimmer-regulars Don L. Harper and Harry Gregson-Williams.","Reception":"Broken Arrow was No. 1 at the North American box office on its opening weekend grossing $15.6 million.[1] It stayed on top for a second week and ultimately had a domestic gross of $70,770,147 and an international gross of $79,500,000, for a total worldwide gross of $150,270,147.[2]Based on 30 reviews collected by the film review aggregator Rotten Tomatoes, 53% of critics gave Broken Arrow a positive review (16 \"Fresh\"; 14 \"Rotten\"), with an average rating of 5.9 out of 10.[3] Metacritic, which assigns a normalized rating out of top reviews from mainstream critics, calculated an average score of 61, \"generally favorable reviews\" based on 21 reviews.[4]The review of this movie on Siskel & Ebert & the Movies represents the only time in history where Roger Ebert convinced Gene Siskel to change his mind about his final judgment of a film. Siskel initially giving the film a \"thumbs up\" but changed it to a \"thumbs down\" after hearing Ebert's criticisms.[5]","box_office":"$150.2 million","cinematography":"Peter Levy","directed_by":"John Woo","release_dates":"February 9, 1996 (1996-02-09)","produced_by":"Bill Badalato Terence Chang Mark Gordon","starring":"John Travolta Christian Slater Samantha Mathis Delroy Lindo Frank Whaley Bob Gunton Howie Long","running_time":"110 minutes","music_by":"Hans Zimmer","edited_by":"Joe Hutshing Steve Mirkovich John Wright","written_by":"Graham Yost"}