{"country":"United States","distributed_by":"Warner Bros.","Plot":"The film starts with the same opening scene from The Conjuring, in which two young women and a young man are telling the demonologists Ed and Lorraine Warren about their experiences with a doll called Annabelle which they believe is haunted.In 1969, John and Mia Form live in Santa Monica and are expecting their first child. John gives her a doll that she has been trying to find. At night, Mia hears a murder occurring at their neighbors', the Higgins. When Mia calls the police, she is attacked by a woman holding the doll and a male accomplice. John and the police arrive and kill the man while the woman kills herself by slitting her own throat. A drop of her blood falls on the face of the doll in her arms. A news report shows that the assailants were Annabelle Higgins and her boyfriend. They are said to have been part of the Disciples of the Ram, a satanic cult, in which they worship a demon with horns.Since Annabelle was holding the doll while dying, Mia asks John to throw it away. Later, after a fire caused by the doll, Mia trips over furniture escaping from the fire and goes into labor. Mia gives birth to a healthy baby girl named Leah. The family moves into a new apartment and Mia finds the doll they thought they had discarded. More strange activity plagues Mia and her new baby. She contacts the detective, who informs her of Annabelle's history in a cult that seeks to summon a demon by claiming a soul. Mia goes to a bookstore run by a woman named Evelyn and determines that the presence haunting her wants Leah's soul. Evelyn tells Mia that she had a daughter named Ruby who died in a car accident caused by Evelyn. She was so guilt-ridden that she attempted suicide. However, she claims to have heard Ruby's voice telling her it wasn't her time.The couple contacts their church's priest, Father Perez, who tries to take the doll with him to church. Annabelle's ghost attacks him, and the doll disappears. Perez warns John that it was Annabelle's spirit that caused his injuries. During another attack, Annabelle appears to levitate, but Mia sees the demon holding Annabelle, manipulating its actions. Mia attempts to kill Annabelle and asks him if there is another way, and it says that she can offer him her soul. John and Evelyn break open the door to find Mia ready to jump out the window with Annabelle. John saves Mia; Evelyn takes hold of Annabelle and decides to make the sacrifice, knowing this is the way she can atone for Ruby's death. Evelyn then jumps out of the window to her death. However, the Annabelle doll disappears.Six months later, the Forms have moved on and have not seen Annabelle since then. Elsewhere, the mother of one of the girls in the opening scene purchases Annabelle as a gift for her child. The ending text states that the real Annabelle doll resides in a case in Ed and Lorraine Warren's museum and that it is blessed by a priest twice a month to keep the public safe from the evil that the doll possesses.","language":"English","Reception":"Annabelle was a major box office success, earning $84,273,813 in North America and $171,000,000 in other territories for a worldwide total of $255,273,813.In the U.S. and Canada, Annabelle is the fourteenth highest-grossing horror/supernatural film.[18] Early critics and box office trackers projected that Annabelle could gross around $25 – $27 million in its opening weekend. However, estimates declined shortly after to a range between $20 and $22 million.[19][20][21][22][23] Annabelle was released on October 3, 2014, in 3,185 theatres in North America.[24] Annabelle topped the box office in its opening day earning $15.4 million (including its $2.1 million midnight previews).[19][25][26] In its traditional three-day opening the film debuted at #2 at the box office with $37,134,255, at an average of $11,659 per theater from 3,185 theaters after a neck-and-neck competition against Gone Girl which earned $37.5 million. The two releases were separated by $378,854.[27] Its opening weekend gross is the eleventh highest in October and the biggest for a horror genre film of 2014, surpassing The Purge: Anarchy's $28.9 million opening. Dan Fellman, president of domestic distribution at Warner Bros., said about the opening box office performance, \"we had a wonderful campaign for the film and a good date\"; she added \"being a spinoff of The Conjuring set it up really well and we just hit the right note.\"[28] It is the second time that an October weekend has produced two $30 million or more debuts; the first was in 2008: High School Musical 3 ($42 million) and Saw V ($31 million).[29] According to Rentrak, the opening weekend crowd was evenly split between female with 51% and under 25 years with 54%. The film closed down its theatrical run on December 18, 2014 and earned a total of $84,273,813 becoming the thirty-fifth highest grossing movie of 2014 in the US.[30]The film was released in Russia on September 26, 2014, a week prior to its wide release and earned $2.1 million on its opening weekend, debuting at No. 3 at the Russian box office.[1][31] Overseas in its opening weekend the film earned $23.6 million from nearly 3,300 screen and 39 foreign markets for a first-weekend worldwide total of $60.8 million.[32][33][34]High openings of Annabelle internationally were reported in France ($3.4 million), Brazil ($3 million), the UK ($3.1 million), Argentina ($1.2 million), Spain ($1.45 million) and Germany ($1.14 million). In India Annabelle debuted at #2 behind Bollywood blockbuster Bang Bang! and collected $1.3 million.[35][35] It set an all-time opening record for a horror film in Peru with $1.34 million which is also Warner Bros. second biggest opening weekend of all time there overall.[36] In Mexico, the film earned $10.9 million (including previews) on its opening weekend and broke the record for the biggest debut ever for a horror movie and the best 2D opening. Its opening weekend gross is also the third-biggest opening overall of 2014 behind Maleficent and Transformers: Age of Extinction there. In total the film took 59% of the total market share.[37]As of October 13, 2014, Annabelle has become the highest-grossing horror film in the Philippines, earning over ₱121.33 million. The film surpassed Insidious: Chapter 2's record (₱113 million), doing so after 12 days of release.[38] The film has also become the highest-grossing horror movie in Lebanon after staying atop the box office for two weekends.[39]Annabelle received mixed reviews from film critics, the majority of which felt the film inferior to its forerunner.[40] The review aggregator website Rotten Tomatoes reports a 29% approval rating based on 119 reviews, with a rating average of 4.4 out of 10. The site's consensus is: \"Annabelle borrows unabashedly from better horror films, content to leave viewers with a string of cheap jolts that fail to build on the far more effective The Conjuring\".[41] On Metacritic, the film has a score of 37 out of 100, based on 27 critics, indicating \"generally unfavorable reviews\".[42] CinemaScore gave the film a positive review with a B+ grade on a scale of A to F, in contrast to The Conjuring's A-.Frank Scheck of The Hollywood Reporter criticized the film for its cheap production and screenplay, but was positive towards the performances of the cast and saying, \"the film is ultimately so scary and formulaic that you won't forget it.\"[43]Scott Foundas of Variety gave the film a positive review, calling the film \"inspired\" but periodically cheap. He added \"a cut-rate spinoff from James Wan's superlative haunted-house hit The Conjuring that (partly) makes up in crude shock effects, but lacks in atmosphere. Designed mainly as a starring vehicle for the eponymous, creepy-as-hell doll (who easily outclasses her human co-stars), this WB/New Line quickie is the thirst of die-hard genre fans and is by the far the best horror movie of the year\".[44]Pete Hammond of Deadline gave the film a positive review and said that the scary doll show has left him pining for Chucky in Child's Play. He further added, \"Annabelle may still draw horror fans in this Halloween month, and they will be quaking over the scares in this film.\"[45] Annabelle was also titled \"scariest movie of the year\" by Time magazine.[citation needed]","box_office":"$256.9 million","cinematography":"James Kniest","production_company":"New Line Cinema RatPac Entertainment The Safran Company Atomic Monster","directed_by":"John R. Leonetti","annabelle":"Theatrical release poster","Music":"On April 24, 2014, Joseph Bishara was hired to compose the music for the film.[16] WaterTower Music released the soundtrack album on September 30, 2014.[17]","release_dates":"September 26, 2014 (2014-09-26) (Russia[1])|||||","Production":"The film is a spinoff of the movie \"The Conjuring\" focusing on the origins of the Annabelle doll found in that film. Still the film was designed to be stand alone yet at the same time catering to fans of \"The Conjuring\" who would already be familiar with the latter film.[10] According to Backstage.com the film was one of the first in a new strategy by distributors Warner Brothers and New Line \"that capitalizes on the built-in fan bases for successful films, allowing for smaller budgets and production time with a bigger payout on the back end.\" [10]Casting was announced in January 2014 with Annabelle Wallis and Ward Horton playing the leads.[6] with actors Eric Ladinn Brian Howie and Alfre Woodward also being announced that month.[7][9]Principal photography began on January 27, 2014, at The Book Shop in Covina.[7][11][12][13] On February 25, 2014, filming continued at an apartment in South Normandie Avenue of Los Angeles County where the 55-member crew shot for several days.[14]Director Leonetti and producer Safran told reporters that the Annabelle set was \"haunted\" and that they thought \"supernatural phenomena\" had occurred there.[15] The film was shot in sequence so that the actors were always aware of their emotional arcs.[10]","produced_by":"Peter Safran James Wan","starring":"Annabelle Wallis|Ward Horton|Alfre Woodard|","running_time":"100 minutes[2]","Sequel":"Fellman told The Washington Post that the studio was considering a film series based on the film. A sequel is currently in the works.[46] In October 2015, it was reported that Gary Dauberman would be returning to write the script.[47] However, it is unclear if director John Leonetti will return and it is rumoured that Warner Bros and New Line are shortlisting potential candidates to direct Annabelle 2 if Leonetti does not return.[48] On March 22, 2016, Warner Bros. slated the film for release on May 19, 2017,[49] with Lights Out director David F. Sandberg directing the film.In June of 2016, Miranda Otto and Stephanie Sigman were cast to star in the sequel. The story centers on a dollmaker and his wife (Otto) whose daughter tragically dies. Twenty years later they decide to open their home to a nun (Sigman) and several girls from a shuttered orphanage. When the dollmaker’s possessed creation Annabelle sets her sights on the children, it turns their shelter into a storm of horror.[50]","music_by":"Joseph Bishara","edited_by":"Tom Elkins","written_by":"Gary Dauberman","budget":"$6.5 million"}