{"country":"United States","distributed_by":"Universal Pictures","back_to_the_future_part_iii":"Original theatrical poster by Drew Struzan","screenplay_by":"Bob Gale","story_by":"Robert Zemeckis|Bob Gale|","Plot":"On November 12, 1955, Marty McFly discovers that his friend, Dr. Emmett Brown, had become trapped in 1885. Marty, with the 1955 Doc, uses the information in Doc's 1885 letter to locate and repair the DeLorean. He spots a tombstone with Doc's name, dated six days after the letter. Learning that Doc was killed by Biff Tannen's great-grandfather, Buford \"Mad Dog\" Tannen, Marty travels back to 1885 to save Doc.Marty arrives on September 2, 1885, in the middle of a United States Cavalry pursuit of Indians. When the fuel line is torn, Marty hides the car in a cave and walks to Hill Valley. He meets his Irish-born great-great-grandparents, Seamus and Maggie McFly, and runs afoul of Buford and his gang. Buford tries to hang Marty, but Doc saves him. Doc agrees to leave 1885, but because commercial gasoline is not yet available, the DeLorean cannot reach 88 miles per hour under its own power.Doc devises a plan to use a locomotive to push the DeLorean up to the required speed. Doc and Marty explore a rail spur they intend to use and spot an out-of-control horse-drawn wagon. Doc saves the passenger, Clara Clayton, and the two fall in love. Buford tries to kill Doc at a town festival, but Marty saves him. Buford goads Marty into a showdown in two days' time. In the photograph of Doc's tombstone, Doc's name has disappeared, but the date on the tombstone remains unchanged. Doc warns Marty that he might be killed by Buford.The night before their departure, Marty and Doc place the DeLorean onto the rail spur. At Clara's house, Doc tells her he is from the future, but she believes it is an excuse to end their relationship and angrily dismisses him. Distraught, Doc returns to the town saloon for a binge, but Marty rides to the saloon and convinces Doc to leave with him. Doc drinks a single shot of whiskey and passes out instantly. Buford arrives early and calls out Marty, but Marty refuses to duel. Doc revives after drinking the bartender's special \"Wake-Up Juice\" and tries fleeing with Marty, but Buford's gang captures Doc, forcing Marty to duel. During a fistfight, Buford destroys the tombstone, is knocked unconscious into a wagon full of manure, then arrested for an earlier robbery. Marty and Doc depart to \"borrow\" the locomotive.As Clara is leaving on the train, she overhears a salesman discussing how heartbroken Doc was at the saloon. Clara applies the emergency brake and runs back to town. She discovers Doc's model of the time machine and rides after him. Having stolen the train at gunpoint, Doc and Marty begin pushing the DeLorean along the spur line, attempting to get it up to 88 miles per hour. Clara boards the locomotive while Doc climbs towards the DeLorean. Doc encourages Clara to join him. As she climbs to Doc, Clara falls and hangs by her dress. Marty passes the hoverboard to Doc, who saves Clara. They coast away from the train as the DeLorean returns to 1985, while the locomotive falls off the unfinished bridge.Marty arrives on October 27, 1985, escaping the powerless DeLorean before it is destroyed by an oncoming freight train. He discovers that everything has returned to the improved timeline and finds Jennifer sleeping on her front porch. He uses the lessons he learned in 1885 to avoid being goaded into a street race with Douglas J. Needles, avoiding a possible automobile accident. Remembering that this accident would have sent Marty's life spiraling downward by 2015, Jennifer opens the fax message she kept from 2015 and watches as the message regarding Marty being terminated is erased.Marty takes Jennifer to the time machine wreckage. A locomotive equipped with a flux capacitor appears, manned by Doc, Clara, and their two children Jules and Verne. Doc gives Marty a photo of the two of them by the clockworks at the 1885 festival. Jennifer asks about the fax, and Doc tells them it means that the future has not been written yet. Doc’s train converts into an aerial craft and disappears into an unknown time.","language":"English","Release and reception":"The film grossed $23 million in its first weekend of U.S. release and $87.6 million altogether in U.S. box office receipts (or about $152.4 million when adjusted for inflation[13] as of January 2011) – $243 million worldwide.[14][15][16]On December 17, 2002, Universal released Back to the Future Part III in a boxed set with the first two films on DVD and VHS. In the DVD widescreen edition, there was a framing flaw that Universal has since corrected, available in sets manufactured after February 21, 2003.[17]The review aggregate website Rotten Tomatoes reported a 74% approval rating, based on 42 reviews.[18]Kim Newman of Empire gave the film four out of five stars, saying that the film \"restores heart interest of the first film and has a satisfying complete storyline\". He praised Michael J. Fox for \"keeping the plot on the move,\" and mentioned that Christopher Lloyd and Mary Steenburgen's romance was \"funny\". He said that the film's ending was the \"neatest of all,\" and it \"features one of the best time machines in the cinema, promising that this is indeed the very last in the series and neatly wrapping it up for everybody.[19]Leonard Maltin preferred this film to the first two, giving it three-and-a-half stars out of four, saying it \"offers great fun, dazzling special effects, and imagination to spare. There's real movie magic at work here.\"[20] Michael McWhertor of the website Polygon wrote that while the film was not better than the original entry in the series, it is nonetheless \"leagues better than the second\"; he praised the film's comedic and romantic elements and commended Thomas F. Wilson's performance as \"Mad Dog\" Tannen.[21]Roger Ebert of the Chicago Sun-Times gave the film two-and-a-half out of four stars. He said that the film's western motifs are \"a sitcom version that looks exactly as if it were built on a back lot somewhere\".[22] Although Vincent Canby of The New York Times praised Christopher Lloyd's performance in the film, he also said that the film \"looks as if it could be the beginning of a continuing television series\". He complained that the film is \"so sweet-natured and bland that it is almost instantly forgettable\".[23]In 1990, the film won a Saturn Award for Best Music for Alan Silvestri and a Best Supporting Actor award for Thomas F. Wilson.[24] In 2003, it received an AOL Movies DVD Premiere Award for Best Special Edition of the Year, an award based on consumer online voting.[25]","box_office":"$244.5 million","cinematography":"Dean Cundey","production_company":"Amblin Entertainment","directed_by":"Robert Zemeckis","release_dates":"May 25, 1990 (1990-05-25)|||||","Production":"The origins of the western theme for Back to the Future Part III lie in the production of the original film. During filming for the original, director Zemeckis asked Michael J. Fox what time period he would like to see. Fox replied that he wanted to visit the Old West and meet cowboys. Zemeckis and writer/producer Bob Gale were intrigued by the idea, but held it off until Part III.[3] Rather than use existing sets, the filmmakers built the 1885 Hill Valley from scratch.[3] The western scenes were filmed on location in Monument Valley.[4] Some of the location shooting for the 1885 Hill Valley was done in Jamestown, California, and on a purpose-built set at the Red Hills Ranch near Sonora, California.[4] Some of the train scenes were filmed at Railtown 1897 State Historic Park,[5] a heritage line in Jamestown. Whereas the original film played to a more materialistic idea of success, Zemeckis considered Part III more of a \"human journey\" with spiritual overtones.[6]The shooting of the Back to the Future sequels, which were shot back-to-back throughout 1989, reunited much of the crew of the original.[6] The films were shot over the course of 11 months, save for a three-week hiatus between filming of Parts II and III. The most grueling part was editing Part II while filming Part III, and Zemeckis bore the brunt of the process over a three-week period. While Zemeckis was shooting most of the train sequences in Sonora, Gale was in Los Angeles supervising the final dub of Part II.[6] Zemeckis would wrap photography and board a private plane to Burbank, where Gale and engineers would greet him on the dubbing stage with dinner. He would oversee the reels completed that day, and make changes where needed.[6] Afterwards, he would retire to the Sheraton Universal Hotel for the night. The following morning, Zemeckis would drive to the Burbank Airport, board a flight back to the set in Northern California, and continue to shoot the film.[6]Although the schedule for most of the personnel involved was grueling, the actors found the remote location for Part III relaxing, compared to shooting its predecessor.[6] Rather than continue to explore Marty McFly's extended family, the writers gave the spotlight to Doc Brown.[original research?]The role of Clara Clayton was written with Mary Steenburgen in mind. When she received the script, however, she was reluctant to commit to the film until her kids, who loved the original, 'hounded' her.[6] Lloyd shared his first on-screen kiss with Steenburgen in Part III.[6] The Hill Valley Festival Dance scene proved to be the most dangerous for Lloyd and Steenburgen; overzealous dancing left Steenburgen with a torn ligament in her foot.[3]The film also starred veteran western film actors Pat Buttram, Harry Carey, Jr., and Dub Taylor, as three \"saloon old timers\".[7] Buttram was also known to younger audiences for his extensive voice work, particularly as the Sheriff of Nottingham in the Disney version of Robin Hood.[8] The inclusion of these noticeable Western actors was promoted in several documentaries about the film as well as the behind-the-scenes documentary of the DVD and in the obituary of one of the actors.[9] The Old West–style music band that performed in the film was played by rock band ZZ Top.[10]Shooting a film set in the Old West was appealing to the stuntmen, who were all experienced horse riders. \"We had every great stuntman in Hollywood wanting to work on Part III,\" recalled Gale in 2002.[6] Thomas F. Wilson, who played Buford Tannen, chose to perform his own stunts and spent a great deal of time learning to ride a horse and throw his lariat. Filming was halted when Michael J. Fox's father died and when his son was born.[3]Alan Silvestri, through his longtime collaboration with Zemeckis, returned to compose the score for Back to the Future Part III. Rather than dictate how the music should sound, Zemeckis directed Silvestri as he would an actor, seeking to evoke emotion and treating every piece of music like a character.[6]The photography in Part III was a \"dream\" for cinematographer Dean Cundey, who agreed with much of the crew in his excitement to shoot a western. The filmmakers sought a bright, colorful picture for each scene, with a hint of sepia tone in certain shots.[6] Zemeckis wished to create a spectacular climax to the film. He coordinated the actors, a live 4-6-0 ten wheeler steam locomotive, pyrotechnics, and special effects, and countless technicians all at once.[6] As they had done with the previous two films in the trilogy, the visual effects for Part III were managed by effects company Industrial Light & Magic; the head of its animation department, Wes Takahashi, returned to once again animate the DeLorean's time travel sequences.[11][12]","produced_by":"Neil Canton|Bob Gale|","starring":"Michael J. Fox|Christopher Lloyd|Mary Steenburgen|Thomas F. Wilson|Lea Thompson|","running_time":"119 minutes[1]","music_by":"Alan Silvestri","edited_by":"Harry Keramidas|Arthur Schmidt|","budget":"$40 million (shared with Part II)"}