{"based_on":"A Star is Born screenplay by Robert Carson Dorothy Parker Alan Campbell","country":"United States","distributed_by":"Warner Bros.","story_by":"William A. Wellman Robert Carson","language":"English","box_office":"$6,100,000 (rentals)[2][3]","cinematography":"Sam Leavitt","production_company":"Transcona Enterprises","directed_by":"George Cukor","Home media":"Warner Home Video released the 176-minute 1983 \"restored\" version on DVD in letterbox widescreen format on September 19, 2000. It features an English audio soundtrack in Dolby Digital 5.1 and subtitles in English and French. Bonus features include the network telecast of the September 29, 1954 Hollywood premiere at the Pantages Theatre; highlights from the post-premiere party at the Cocoanut Grove; three alternate filmings of \"The Man That Got Away\" with additional original recording session music; a short musical sequence that appeared in a test screening but was deleted before the film's official premiere, \"When My Sugar Walks Down the Street\" (which was to be part of the extended \"Born in a Trunk\" sequence); and the theatrical trailers for this, the 1937 original, and the 1976 remake.On June 22, 2010, Warner Home Video (WHV) released the film on Blu-ray and DVD. The original production negative has been restored and transferred to video at 6K resolution,[14] one of the first films transferred at such a high rate, however according to a WHV press release, no new footage has been found. The restoration \"has meticulously preserved and restored Ronald Haver's 176-minute version of A Star Is Born to its original luster, bringing back the brilliant, saturated colors and crisp picture.\"","1983 film restoration":"For years, Garland fans and film historians expressed great interest in viewing the missing footage from this film. Beginning about 1981, film preservationist Ronald Haver did extensive research of the Warner Bros. film vaults and located some of the missing scenes, including two complete musical numbers, \"Here's What I'm Here For\" and \"Lose That Long Face\".In 1983, a 176-minute \"restored\" (i.e. reconstructed) version was shown in theaters and then released on home video. The project was a collaboration between the Academy of Motion Picture Arts and Sciences and the studio. Some of the missing footage had to be reconstructed using pan and scan of production stills, accompanied by the restored dialogue. The original multi-track stereophonic sound was also restored.","Remakes":"A Star Is Born, a remake itself, was again remade in 1976 with Barbra Streisand and Kris Kristofferson. The film was remade in Bollywood as Aashiqui 2 in 2013. It also inspired Malayalam film Bharatham.","release_dates":"September 29, 1954 (1954-09-29)|||||","Production":"In December 1952, George Cukor was approached by Sid Luft, who proposed the director helm a musical remake of the 1937 film A Star is Born with his then-wife Judy Garland in the lead role.[4] Garland previously had portrayed Vicki Lester in a December 1942 Lux Radio Theater broadcast with Walter Pidgeon, and she and Luft, along with several associates, had formed Transcona Enterprises specifically to produce the project on screen.[5] Cukor had declined to direct the original film because it was too similar to his 1932 What Price Hollywood?, but the opportunity to direct his first Technicolor film, first musical film, and work with screenwriter Moss Hart and especially Garland appealed to him, and he accepted.[6]Getting the updated film to the screen proved to be a challenge. Cukor wanted Cary Grant, whom he had directed three times before, for the male lead and went so far as to read the entire script with him. Grant, while agreeing it was the role of a lifetime, was more interested in traveling with wife Betsy Drake, and steadfastly refused the role (he also turned down Roman Holiday and Sabrina).[7] He was also concerned about Garland's reputation for unreliability; Drake stated that \"Cary did not want to do it, because Judy Garland was a drug addict.\"[7] Cukor never forgave him for declining the role. The director then suggested either Humphrey Bogart or Frank Sinatra tackle the part, but Jack L. Warner rejected both. Stewart Granger was the front runner for a period of time, but he backed out when he was unable to adjust to Cukor's habit of acting out scenes as a form of direction.[8]James Mason ultimately was signed, and filming began on October 12, 1953. As the months passed, Cukor was forced to deal not only with constant script changes but a very unstable leading lady, who was plagued by chemical dependencies, significant weight fluctuations, and real and imagined illnesses.[9] After considerable footage had been shot, studio executives decided the film should be the first Warner Brothers motion picture to use CinemaScope, necessitating everything be scrapped and filmed again.[5]In March 1954, a rough cut still missing several musical numbers was assembled, and Cukor had mixed feelings about it. When the last scene was finally filmed in the early morning hours of July 28, 1954, Cukor already had departed the production and was unwinding in Europe.[10] The long \"Born in A Trunk\" sequence was added after Cukor had left, supervised by Garland's professional mentor, Roger Edens.The first test screening the following month ran 196 minutes and, despite ecstatic feedback from the audience, Cukor and editor Folmar Blangsted trimmed it to 182 minutes for its New York premiere in October. The reviews were excellent, but Warner executives, concerned the running time would limit the number of daily showings, made drastic cuts without Cukor, who had departed for India to scout locations for Bhowani Junction. At its final running time of 154 minutes, the film had lost two major musical numbers and crucial dramatic scenes, and Cukor called it \"very painful\" to watch.[11]A Star Is Born had cost over $5 million,[1] making it one of the most expensive films ever made in Hollywood. In its initial release, it did very well and attracted huge crowds. According to Variety, it grossed $6,100,000 in US theatrical rentals - an impressive amount of money, but clearly not enough to recoup its cost. As a result, the film was considered a box-office disappointment.","running_time":"Premiere: 182 minutes General Release: 154 minutes Restored Version: 176 minutes","budget":"$5,019,770[1]","a_star_is_born":"Theatrical release poster","Plot":"Esther Blodgett is a talented aspiring singer with a band, and Norman Maine is a former matinee idol with a career in the early stages of decline. When he arrives intoxicated at a function at the Shrine Auditorium, the studio publicist attempts to keep him away from reporters. After an angry exchange, Norman rushes away and bursts onto a stage where an orchestra is performing. Blodgett takes him by the hand and pretends he is part of the act, thereby turning a potentially embarrassing and disruptive moment into an opportunity for the audience to greet Norman with applause.Realizing that Esther has saved him from public humiliation, Norman thanks her and draws a heart on the wall with her lipstick. He invites her to dinner, and later watches her perform in an after-hours club while recognizing her impressive talent. He urges her to follow her dream and convinces her she can break into movies. Esther is surprised that someone of Norman's stature sees something special in her. He offers her a screen test and advises her to \"sleep on it,\" promises to call her the next day. Esther tells Danny, her bandmate, that she's quitting their upcoming gig to pursue movies in L.A. Thinking her crazy, he tries to talk her out of it, but Esther is determined. Norman is called away early in the morning to filming on location and then falls ill. He attempts to get a message to her but cannot remember her address. When she doesn't hear from him, she suspects he was insincere. Not disheartened, she takes jobs as a carhop and TV commercial singer to make ends meet, convinced she can make it, with or without Norman.Norman tries to find Esther, who's had to move from her apartment. Then he hears her singing on the television commercial and tracks her down. Studio head Oliver Niles believes Esther is just a passing fancy for the actor, but casts her in a small film role. The studio arbitrarily changes her name to Vicki Lester, which she finds out when she tries to pick up her paycheck. When Norman finally gets Niles to hear \"Vicki\" sing, he is impressed and she is cast in an important musical film, becoming a huge success. Her relationship with Norman flourishes, and they wed.As Vicki's career continues to flourish, Norman finds himself unemployed and going downhill fast—an alcoholic in a tough new film business which doesn't put up with it. Norman arrives, late and drunk, in the middle of Vicki's Oscar acceptance speech. He interrupts her speech, rambling and pacing back and forth in front of her. While begging for work from the assembled and embarrassed Hollywood community, he accidentally strikes Vicki in the face.Vicki continues working and tells Oliver that Norman has entered a sanitarium. After supporting him for so long, she worries about the effect of Norman's alcoholism on her, while acknowledging that he's trying very hard to overcome his addiction. Niles is amenable to offering Norman work, a gesture for which Vicki is grateful, thinking this may be just the boost her husband needs. At the racetrack, Norman runs into studio publicist Matt Libby (Jack Carson), who taunts him and accuses him of living on Vicki's earnings. The resulting fight prompts the actor to go on a drinking binge. He is eventually arrested for being drunk and disorderly and, even more humiliated, receives ninety days in the city jail. Vicki bails him out and brings him home, where they are joined by Niles. Norman goes to bed but overhears Vicki telling the studio head she will give up her career to take care of him. He also hears Oliver say that Norman ruined his own career with his drinking. Finally realizing what he's done to himself, Vicki, his career, and the people around him, Norman leaves his bed, tells Vicki cheerfully that he is going to go for a swim, walks into the ocean—and drowns himself.Despondent, Vicki becomes a recluse and refuses to see anyone. Finally, her old bandmate Danny convinces her she needs to attend a charity function because she constitutes the only good work Norman did and which he died trying to save. At the Shrine Auditorium, she notices the heart Norman drew on the wall on the night they met and for a moment seems to lose her composure. When she arrives on stage, the emcee tells her the event is being broadcast worldwide and asks her to say a few words to her fans. She says, \"Hello, everybody. This is Mrs. Norman Maine,\" which prompts the crowd into a standing ovation.","Critical reception":"Bosley Crowther of The New York Times called the film \"one of the grandest heartbreak dramas that has drenched the screen in years.\" He added, \"The whole thing runs for three hours, and during this extraordinary time a remarkable range of entertainment is developed upon the screen . . . No one surpasses Mr. Cukor at handling this sort of thing, and he gets performances from Miss Garland and Mr. Mason that make the heart flutter and bleed . . . Theirs is a credible enactment of a tragic little try at love in an environment that packages the product. It is the strong tie that binds the whole show. But there is more that is complementary to it. There is the muchness of music that runs from a fine, haunting torch-song . . . to a mammoth, extensive production number recounting the career of a singer . . . And there is, through it all, a gentle tracing of clever satire of Hollywood, not as sharp as it was in the original, but sharp enough to be stimulating fun.\"[12]Time said Garland \"gives what is just about the greatest one-woman show in modern movie history,\" while Newsweek said the film is \"best classified as a thrilling personal triumph for Judy Garland. As an actress Miss Garland is more than adequate. As a mime and comedienne she is even better. But as a singer she can handle anything from torch songs and blues to ballads. In more ways than one, the picture is hers.\"[5] When the Oscar for Best Actress went to Grace Kelly instead of Garland, Groucho Marx called it \"the biggest robbery since Brink's.\"","Soundtrack releases":"The soundtrack has never been out of print. It was originally released by Columbia Records in 1954 in 10-inch 78 rpm and 12-inch 33⅓ rpm editions, and also on 7-inch 45 rpm records.In 1988, Columbia released the soundtrack on compact disc, taking the overture and the main musical numbers directly from the film's stereo soundtrack due to the fact no stereo pre-recordings for the soundtrack master existed for this number.In 2004, in commemoration of the film's 50th anniversary, Columbia, Legacy Recordings, and Sony Music Soundtrax released a nearly complete, digitally-remastered, expanded edition of the soundtrack. Due to the lack of a complete multitrack version of all songs and score from the film, the CD includes a mix of monaural and stereo elements in order to make as complete a soundtrack as possible. 'Due in part to the fact that some of the songs were not complete on the film soundtrack, as well as the fact that many of the original music stems had been lost or destroyed subsequent to original mono mixdown, numbers such as \"Here's What I'm Here For\" and \"Lose That Long Face\" are taken from the original mono LP masters.Other numbers such as \"Gotta Have Me Go with You\" are mostly in stereo, save for brief sections where the mono soundtrack album master was used in order to remove various endemic plot-related sound effects from the track. All of the instrumental tracks are in mono as well due to the fact that the original elements have been lost or destroyed.The 2004 soundtrack also includes three vocal outtakes - an alternate vocal for the reprise of \"It's a New World\" that Esther sings while Norman goes for his final swim; \"When My Sugar Walks Down the Street\", which was intended to be part of the \"Born In a Trunk\" sequence, but was deleted for time constraints; and \"The Trinidad Coconut Oil Shampoo Commercial\", which was taken from the only surviving recording of the complete track, a very worn acetate artist reference disc.In addition, much of the instrumental portion of the 2004 soundtrack contains partial or whole outtakes. This CD also sees the first CD release of the complete version of \"Gotta Have Me Go with You\" with the full introduction, as well as \"The Man That Got Away\" with an expanded introduction not used in the original film.The original Columbia 1954 mono vinyl version of the soundtrack has been released on CD in Britain by Prism Leisure and is also available for digital download. This version includes bonus tracks of Judy Garland's Decca recordings of songs from other films.Bonus TracksBonus Tracks (Judy Garland studio recordings for Decca Records)","References":"NotesFurther reading","produced_by":"Sidney Luft","starring":"Judy Garland James Mason Jack Carson Charles Bickford","music_by":"Ray Heindorf","edited_by":"Folmar Blangsted","written_by":"Moss Hart"}