{"Cast":"[1] [2]","city_on_fire":"Hong Kong theatrical poster","country":"Hong Kong","distributed_by":"Cinema City & Films Co. (Hong Kong)","Plot":"After the death of a fellow cop (Elvis Tsui), Ko Chow (Chow Yun Fat) is sent undercover by his superior Inspector Lau (Sun Yueh) to infiltrate a syndicate responsible for a brutal jewelry robbery, led by their leader, Fu (Danny Lee). However, after gaining the confidence of the men he is supposed to be taking down, Ko Chow forms an unlikely friendship with Fu. Meanwhile, due to Ko Chow’s newfound association with the syndicate, he finds himself pursued by the police sent by Inspector John (Roy Cheung), who are unaware of his true identity. Disillusioned by the position he is in, Ko Chow’s personal ethics are put to the test, leaving him torn between his loyalty to his new friend, and his duty to bring the criminals to justice.","language":"Cantonese Mandarin","Reception":"City on Fire is Ringo Lam's most celebrated work. The film has been critically acclaimed, holding a 91% \"fresh\" rating at Rotten Tomatoes.[3]","box_office":"HK$ 19,723,505","cinematography":"Andrew Lau","directed_by":"Ringo Lam","release_dates":"February 13, 1987 (1987-02-13)|||||","Production":"Filming began in Hong Kong in 1985 and concluded around the Christmas season.","produced_by":"Karl Maka Ringo Lam","starring":"Chow Yun-fat Danny Lee Sun Yueh Carrie Ng Roy Cheung","running_time":"105 minutes","Influence":"Quentin Tarantino's 1992 film Reservoir Dogs includes several similar key plot elements and scenes, most notably the famous Mexican standoff near the end of the film. After critic Jeffrey Dawson noted \"in jest, similar elements\" in Empire, other publications including Film Threat promoted the observation, and a Michigan film student created a 1995 short film, Who Do You Think You're Fooling?,[4] which mixed dialog and visuals from both movies to demonstrate the similarities.[5] In addition to Reservoir Dogs, critic Matt McAllister notes that one \"can equally see the influence of City On Fire - and similar Hong Kong cops-and-robbers movies - on many other Hollywood 'undercover cop' movies such as Point Break.\"[6]Chow Yun-Fat and Danny Lee faced a role-reversal two years later when, in John Woo's The Killer, Chow plays a hitman who bonds with Lee, this time appearing as the cop.","music_by":"Teddy Robin Kwan","edited_by":"Wong Ming-Lam","written_by":"Ringo Lam"}