{"country":"United States","distributed_by":"Gramercy Pictures","Legacy":"Quentin Tarantino included it on his list of the 10 greatest films of all time in the 2002 Sight and Sound poll.[19] In 2003, Entertainment Weekly ranked the film #17 on their list of \"The Top 50 Cult Films\",[20] third on their list of the 50 Best High School Movies,[21] 10th on their \"Funniest Movies of the Past 25 Years\" list,[22] and ranked it #6 on their \"The Cult 25: The Essential Left-Field Movie Hits Since '83\" list.[23]In October 2004, three of Linklater's former classmates from Huntsville High School, whose surnames are Wooderson, Slater, and Floyd, filed a defamation lawsuit against Linklater, claiming to be the basis for the similarly named characters on the film. The lawsuit was filed in New Mexico rather than Texas because New Mexico has a longer statute of limitations.[24] The suit was subsequently dismissed.[25]In 2005, a quote from Dazed and Confused[note 1] was nominated for AFI's 100 Years...100 Movie Quotes; it failed to make the final list.[26]In 2012, McConaughey reprised his role as Wooderson in the Butch Walker and The Black Widows music video \"Synthesizers\".[27] To celebrate the film's 20th anniversary in 2013, the film received the Star of Texas award from the Texas Film Hall of Fame. Linklater accepted the award after being introduced by Tarantino, who reiterated his appreciation of the film as his favorite of the 1990s. The event featured a reunion of several cast members including Joey Lauren Adams, Wiley Wiggins, Christin Hinojosa, Nicky Katt, Mona Lee, Catherine Avril Morris, Anthony Rapp, Marissa Ribisi, Michelle Burke Thomas, and Mark Vandermeulen. At the event, Linklater described his intent to create an inverse John Hughes film: \"The drama is so low-key in [Dazed & Confused]. I don’t remember teenage being that dramatic. I remember just trying to go with the flow, socialize, fit in and be cool. The stakes were really low. To get Aerosmith tickets or not? That’s a big thing. It was really rare when the star-crossed lovers from the opposite side of the tracks and the girl gets pregnant and there’s a car crash and somebody dies. That didn’t really happen much. But riding around and trying to look for something to do with the music cranked up, now that happened a lot!\"[28][29]After Boyhood was released Linklater announced that his next film, Everybody Wants Some!!, would be a \"spiritual sequel\" to Dazed and Confused.[30] The newer film takes place in a Texas college in 1980.[30]The line \"alright, alright, alright\" became a catchphrase for Matthew McConaughey.[31]","dazed_and_confused":"Theatrical release poster","Plot":"It is May 28, 1976, the last day of school at Lee High School in the suburbs of Austin, Texas. The next year's group of seniors are preparing for the annual hazing of incoming freshmen. Randall \"Pink\" Floyd, the school's star football player, is asked to sign a pledge promising not to take drugs during the summer or do anything that would \"jeopardize the goal of a championship season\". When classes end, the incoming freshman boys are hunted down by the seniors and paddled. The incoming freshman girls are also hazed; they are rounded up in the school parking lot by senior girls, covered in mustard, ketchup, flour and raw eggs, and forced to propose to senior boys.Freshman Mitch Kramer escapes the initial hazing with his best friend Carl Burnett, but is later cornered after a baseball game and violently paddled. O'Bannion, a senior participating in the hazing tradition for a second year after failing to graduate, delights in punishing Mitch. Pink gives the injured Mitch a ride home and offers to take him cruising with friends that night. Plans for the evening are ruined when Kevin Pickford's parents discover he planned to host a keg party. Elsewhere, the intellectual trio of Cynthia Dunn, Tony Olson and Mike Newhouse decide to participate in the evening's activities. Pink and his friend David Wooderson, a man in his early 20s who still socializes with high school students, pick up Mitch and head for the Emporium, a pool hall frequented by teenagers.As the evening progresses, students loiter around the Emporium, listen to rock music, cruise the neighborhood and stop at the hamburger drive-in. Mitch is introduced to sophomore Julie Simms, with whom he shares a mutual attraction. While cruising again with Pink, Pickford, and Don Dawson, Mitch drinks beer and smokes marijuana for the first time. After a game of mailbox baseball, a neighborhood resident brandishing a gun threatens to call the police. They barely escape after the resident fires at their car. After returning to the Emporium, Mitch runs into his middle school friends. They hatch a plan to get revenge on O'Bannion. The plan culminates with them dumping paint on O'Bannion, who leaves in a fit of rage.After the Emporium closes, an impromptu keg party is planned in a field under a moonlight tower. Cynthia, Tony and Mike arrive at their first keg party, where Mike is threatened by tough guy Clint. Tony runs into freshman Sabrina Davis, whom he met earlier during the hazing, and they begin hanging out together. Cynthia likes Wooderson and exchanges phone numbers with him. Mike, suffering from the humiliation of his confrontation with Clint, decides to make a stand, punches him, and gets tackled. The fight is broken up by Pink and Wooderson. Football player Benny O'Donnell confronts Pink about his refusal to sign the pledge. Pink, the only player not to have signed, believes it violates his individuality and beliefs. Mitch leaves the keg party with Julie. They drive to a nearby hill overlooking town to make out. Tony gives Sabrina a ride home and they kiss good night.As night turns to dawn, Pink, Wooderson, Don, Ron Slater and several other friends decide to smoke marijuana on the 50-yard line of the football field. The police arrive, so they ditch the drugs. Recognizing Pink, the police call Coach Conrad, his football coach. Conrad lectures Pink about hanging out with \"losers\" and insists that he sign the pledge. Pink says that he might play football, but he is not going to sign the pledge. Pink leaves with his friends to get tickets to an Aerosmith concert. Mitch arrives home after sunrise to find his mother has waited up for him. She decides against punishment but warns him about coming home late again. Mitch goes to his bedroom, puts on headphones and listens to \"Slow Ride\" by Foghat as Pink, Wooderson, Slater and Simone travel down a highway to purchase their tickets.","language":"English","Reception":"Dazed and Confused was released on September 24, 1993 in 183 theaters, grossing $918,127 on its opening weekend. It went on to make $7.9 million in North America.[9]The film received positive reviews from critics. It garnered a 94% approval rating from 51 critics – an average rating of 7.8 out of 10 – on the review-aggregate website Rotten Tomatoes, whose consensus reads: \"Featuring an excellent ensemble cast, a precise feel for the 1970s, and a killer soundtrack, Dazed and Confused is a funny, affectionate, and clear-eyed look at high school life.\"[10] Metacritic provides a score of 78 out of 100 from 18 critics, indicating \"generally favorable\" reviews.[11]Film critic Roger Ebert awarded the film three stars out of four, praising the film as \"art crossed with anthropology\" with a \"painful underside\".[12] In her review for The New York Times, Janet Maslin wrote, \"Dazed and Confused has an enjoyably playful spirit, one that amply compensates for its lack of structure\".[13] Desson Howe, in his review for The Washington Post, wrote, \"Dazed succeeds on its own terms and reflects American culture so well, it becomes part of it\".[14] In her review for The Austin Chronicle, Marjorie Baumgarten gave particular praise to Matthew McConaughey's performance: \"He is a character we're all too familiar with in the movies but McConaughey nails this guy without a hint of condescension or whimsy, claiming this character for all time as his own\".[15]Rolling Stone's Peter Travers gave the film four stars out of four, and praised Linklater as a \"sly and formidable talent, bringing an anthropologist's eye to this spectacularly funny celebration of the rites of stupidity. His shitfaced American Graffiti is the ultimate party movie – loud, crude, socially irresponsible and totally irresistible\".[16] In his review for Time, Richard Corliss wrote, \"Linklater is surely no ham-fisted moralist, and his film has lots of attitude to shake a finger at. But it also has enough buoyant '70s music to shake anybody's tail feather, and a kind of easy jubilance of narrative and character\".[17] Entertainment Weekly gave the film an \"A\" rating, and Owen Gleiberman wrote, \"Yet if Linklater captures the comic goofiness of the time, he also evokes its liberating spirit. The film finds its meaning in the subtle clash between the older, sadistic macho-jock ethos and the follow-your-impulse hedonism that was the lingering legacy of the '60s\".[18]","Soundtracks":"The soundtrack for the film was released on September 28, 1993 by The Medicine Label. The songs \"Hurricane\" by Bob Dylan, \"Hey Baby\" by Ted Nugent, and \"Sweet Emotion\" by Aerosmith were also included in the film, but not on the commercial soundtracks. \"The Alien Song (For Those Who Listen)\" by Milla Jovovich was briefly performed by the character Michelle Burroughs, but was not included in the soundtrack either.","box_office":"$7,993,039","Home video":"MCA/Universal released Dazed and Confused on laserdisc in January 1994,[32] followed by a VHS release two months later.[33]The film was released on HD DVD in 2006.[34] The Criterion Collection released a two-disc boxed-set edition of the film on June 6, 2006 in the U.S. and Canada. Features included an audio commentary by Richard Linklater, deleted scenes, the original trailer, the 50 minute \"Making Dazed\" documentary that aired on the American Movie Classics channel on September 18, 2005, on-set interviews, behind-the-scenes footage, cast auditions and footage from the ten-year anniversary celebration. Also included is a 72-page book featuring new essays by Kent Jones, Jim DeRogatis, and Chuck Klosterman as well as memories from the cast and crew, character profiles and a mini reproduction of the original film poster designed by Frank Kozik. Entertainment Weekly gave it an \"A\" rating and called it a \"fine edition grants this enduring cult classic the DVD treatment it deserves\".[35]Universal Studio released Dazed and Confused on Blu-ray in August 2011, in a 1080p/AVC MPEG-4 transfer, with a DTS-HD Master Audio 5.1 soundtrack.[34]","cinematography":"Lee Daniel","production_company":"Alphaville","directed_by":"Richard Linklater","Book":"In September 1993, St. Martin's Press published a 127-page, softcover book (ISBN 0-312-09466-3) inspired by Richard Linklater's screenplay. It was compiled by Linklater, Denise Montgomery, and others, and designed by Erik Josowitz. It was presented as a kind of yearbook, with character profiles, essays by characters, a time-line focusing on the years 1973 to 1977, and various 1970s pop culture charts and quizzes. It also featured dozens of black-and-white photos from the film.","release_dates":"September 24, 1993 (1993-09-24)|||||","produced_by":"Richard Linklater Sean Daniel James Jacks","starring":"Jason London Rory Cochrane Wiley Wiggins Adam Goldberg Matthew McConaughey Cole Hauser Parker Posey Milla Jovovich Ben Affleck","running_time":"102 minutes[1]","edited_by":"Sandra Adair","written_by":"Richard Linklater","budget":"$6.9 million[2][3]"}