{"based_on":"A Single Man  by Christopher Isherwood","Cast":"Jon Hamm has an uncredited voice cameo as Harold Ackerly. He is a cousin of Jim who phones George to inform him of his partner's death.[4]","country":"United States","distributed_by":"The Weinstein Company","screenplay_by":"Tom Ford David Scearce","a_single_man":"Theatrical release poster","Plot":"Taking place over the course of a single day, November 30, 1962, a month after the Cuban missile crisis, A Single Man is the story of George Falconer (Colin Firth), a middle-aged English college professor living in Los Angeles. George dreams that he encounters the body of his longtime partner, Jim (Matthew Goode), at the scene of the car accident that took Jim's life eight months earlier. After awakening, George delivers a voiceover discussing the pain and depression he has endured since Jim's death and his intention to commit suicide that evening.George receives a phone call from his dearest friend, Charley (Julianne Moore), who projects lightheartedness despite her being equally miserable. George goes about his day putting his affairs in order and focusing on the beauty of isolated events, believing he is seeing things for the last time. Throughout, there are flashbacks to George and Jim's sixteen-year-long relationship.During the school day George comes into contact with a student, Kenny Potter (Nicholas Hoult), who shows interest in George and disregards conventional boundaries of student-professor discussion. George also forms an unexpected connection with a Spanish male prostitute, Carlos (Jon Kortajarena). That evening George meets Charley for dinner. Though they initially reminisce and amuse themselves by dancing, Charley's desire for a deeper relationship with George and her failure to understand his relationship with Jim angers George.George goes to a bar and discovers that Kenny has followed him. They get a round of drinks, go skinny dipping, and then return to George's house and continue drinking. George passes out and wakes up alone in bed with Kenny asleep in another room. George gets up and while watching Kenny discovers that he had fallen asleep holding George's gun, taken from the desktop, to keep George from committing suicide. George locks the gun away, burns his suicide notes and in a closing voiceover explains how he has rediscovered the ability \"to feel, rather than think\". As he makes peace with his grief, George suffers a heart attack and dies.","Accolades":"The film was nominated for the Golden Lion at the 66th Venice International Film Festival and won the festival's third annual Queer Lion.[20] Colin Firth was awarded the Volpi Cup for Best Actor at the film festival for his performance in the film.[21] He received a BAFTA Award for Best Actor in a Leading Role.[22] Firth also received Golden Globe, Screen Actors Guild and Academy Award nominations for Best Actor. For her performance, Julianne Moore was nominated for a Golden Globe Award for Best Supporting Actress in Motion Picture. Abel Korzeniowski was nominated for a Golden Globe Award for Best Original Score. The film received the Grand Prix from the Belgian Syndicate of Cinema Critics.[23]On January 14, 2010, the film was nominated for, and later won, Outstanding Film – Wide Release at the 21st GLAAD Media Awards.[24]","language":"English","Reception":"The film has received an overall positive reception from critics, with most reviews singling out Colin Firth's performance. It currently holds an 85% \"Fresh\" rating on Rotten Tomatoes, based on 175 reviews, with the site's consensus being that \"Though the costumes are beautiful and the art direction impeccable, what stands out most from this debut by fashion designer Tom Ford is the leading performance by Colin Firth.\"[13] Metacritic has compiled an average score of 77 (generally favorable reviews) from 35 critic reviews.[14]Michael Phillips from the Chicago Tribune wrote \"Some films aren’t revelations, exactly, but they burrow so deeply into old truths about love and loss and the mess and thrill of life, they seem new anyway\"[15] Bob Mondello from NPR commented “An exquisite, almost sensual grief suffuses every frame of A Single Man.”[15] Marc Savlov from The Austin Chronicle wrote “Everything fits perfectly, from titles to fin, but most of all Colin Firth, who dons the role of George like a fine bespoke suit.”[15]Critics who liked the film include The A. V. Club film critic Nathan Rabin, who gave the film an A- score, arguing that \"A Single Man is a film of tremendous style wedded to real substance, and rooted in \"Firth's affecting lead performance as a man trying to keep it together for one last day after his world has fallen apart.\"[16] Critic Roger Ebert from the Chicago Sun-Times also praised Firth, saying that he \"plays George superbly, as a man who prepares a face to meet the faces that he meets. He betrays very little emotion, and certainly his thoughts cannot be read in his eyes.\"[17]The Times newspaper of London called the film \"a thing of heart-stopping beauty . . . There will be critics who will be unable to get past the director's background, but rest assured: Tom Ford is the real deal.\"[18] Variety's verdict: \"Luminous and treasurable, despite its imperfections. An impressive helming debut for fashion designer Tom Ford.\"[19]","box_office":"$24.9 million[2]","cinematography":"Eduard Grau","production_company":"Artina Films Depth of Field Fade to Black","directed_by":"Tom Ford","release_dates":"September 11, 2009 (2009-09-11) (Venice Film Festival)|September 14, 2009 (2009-09-14) (Toronto Film Festival)|December 11, 2009 (2009-12-11) (United States)|||","Production":"Fashion designer Tom Ford, as a first-time director, financed the film himself.[5] The film places emphasis on the culture of the 1960s; the production design is by the same team that designed AMC television's Mad Men, which is set in the same era. Mad Men star Jon Hamm has an uncredited voice cameo as George's lover's cousin.[6] The actual house where the character George lives in the film was designed in 1948 by John Lautner, his first house after leaving Frank Lloyd Wright.[7]The film was shot in 21 days, according to \"The Making of A Single Man\" on the DVD.","produced_by":"Tom Ford Andrew Miano Robert Salerno Chris Weitz","starring":"Colin Firth Julianne Moore Matthew Goode Nicholas Hoult","running_time":"100 minutes","Marketing controversy":"An early theatrical poster for A Single Man featured a close-up shot of Colin Firth and Julianne Moore lying side by side, their arms and shoulders touching. This led to speculation that the work's gay content and themes were being deleted or diminished in its marketing materials to improve its chances of success with a wider audience. A new poster with Moore relocated to the background was issued. The film's original trailer placed more emphasis on the relationship between George and Jim but a re-cut trailer omitted a shot of George and Jim kissing while retaining a kiss between George and Charley. Also deleted were a shot of George staring into a male student's eyes, while keeping a shot of George staring into the eyes of a female student, shots of George meeting hustler Carlos outside a liquor store, and shots of George and Kenny running nude into the ocean.[8]Speaking of the controversy, Moore said that director Tom Ford expressed concern that the original poster made the film appear to be a romantic comedy and that he ordered that the poster be changed.[9] However Ford, noting he does not see the film in terms of gay or straight, said, \"I don't think the movie's been de-gayed. I have to say that we live in a society that's pretty weird. For example, you can have full-frontal male nudity on HBO, yet in cinema, you can't have naked male buttocks. You can't have men kissing each other without it being considered adult content. So, in order to cut a trailer that can go into broad distribution in theaters, certain things had to be edited out. But it wasn't an intentional attempt to remove the gayness of the movie.\"[10] Conversely, Colin Firth said, \"[The marketing] is deceptive. I don't think they should do that because there's nothing to sanitize. It's a beautiful story of love between two men and I see no point in hiding that. People should see it for what it is.\"[11] Harvey Weinstein would only say, when asked about the revised poster, \"I'm good. You got enough. Thank you.\"[12] Peter Knegt of Indiewire suggested that The Weinstein Company \"de-gayed\" the trailer to better the film's chances of receiving Academy Award nominations.[8]","music_by":"Abel Korzeniowski","edited_by":"Joan Sobel","budget":"$7 million[1]"}