{"country":"United Kingdom","distributed_by":"ITC Entertainment","Plot":"In London in the late 1970s, Guyanese immigrant Ben Jones arrives at Heathrow Airport with a suitcase and a wallet full of money. Immigration officials refuse to believe his naïve explanation that the cash was given by his grandmother, and strip-search him. Humiliated and confused, Ben travels to Brixton in search of an obscure address. A ten-year-old boy, Devon, spots him and offers to help find the address if Ben pays him. When Ben foolishly reveals his fat wallet, Devon runs off with it, and Ben is forced to sleep at the local hostel. Dave King, a charismatic petty crook and lover of Devon's mother Miriam, pretends to be a responsible adult and intercepts Ben's wallet, but he keeps the money knowing that Devon has stolen it. That evening, Dave tries to seduce Miriam but she resists him, explaining that she has recently become pregnant. An argument ensues and Miriam forces Dave to leave.Ben almost loses his suitcase at the hostel, but defends himself against the thief. In an attempt to find his missing wallet he follows Devon around Brixton, but is sidetracked by Devon's beautiful aunt Saffra. At Miriam's café, Ben confronts Devon about the stolen wallet but Dave intercedes and calms the situation, hiding Devon's guilt and befriending Ben by loaning him some money. Unaware that Dave's cash comes from his own stolen wallet, Ben accompanies Dave to a betting shop and defends him in a brawl. They place a bet on a horse that wins and Ben puts his winnings towards new accommodation. He finds a job as a dustman but loses it all again when he gives his earnings to a fraudulent landlord. Desperate for somewhere to stay, Ben appeals to Dave to share a flat. Once he realises that Ben now has a steady income Dave agrees to the flat-share and imposes a set of slanted rules that Ben is too naïve to reject.Ben uses his new income to decorate the flat and tries to impress Saffra. He gives her a family heirloom - a ring - but Saffra returns it because it is financially worthless. Dave realises that Ben is still a virgin and arranges a trip to Soho where they visit sex shops, strip clubs and a prostitute. At a nightclub Ben meets Sally, a white woman who seduces him, and that night he loses his virginity.Dave loses all his money in a poker game and goes to Miriam. She is furious and upset, having just returned from an abortion clinic. Dave is hurt that the unborn child has been aborted without his knowledge but this serves to anger Miriam more. With encouragement from Sally, Ben confronts Dave about the degree to which he has abused their friendship. Dave implies that Ben's naivety was as much to blame for his being duped as Dave's own immoral behaviour. Ben, now wiser, agrees to remain friends.In a bid to cement his relationship with Miriam and Ben, Dave takes advantage of a car deal arranged by Jomo, a loan shark and sometime boyfriend of Saffra. Taking Jomo's new Buick and money, he drives Miriam, Ben and Saffra to Margate for an overnight trip. The four spend a lot of money and Dave loses the rest at a casino. Ben and Saffra sleep together but Saffra remains non-committal. In the morning Dave approaches Ben for some cash to pay the bills he cannot afford. Ben refuses, but suggests that he buys Jomo's car and insists on a receipt. Dave reluctantly agrees and the group return to London.Once in Brixton, Ben refuses to resell the Buick, putting Dave in a dangerous position with Jomo. Jomo tries to force the sale but is overpowered by Ben who makes it clear he will not be bullied. Jomo backs down and Dave is thankful. Devon and Saffra join Ben in the Buick and they drive away.","language":"English","cinematography":"Phil Meheux","directed_by":"Anthony Simmons","Soundtrack":"The soundtrack album contains hits by a number of Soul/R&B stars from the 1960s and '70s:","release_dates":"1977","produced_by":"Elliott Kastner Arnon Milchan Martin Campbell","starring":"Norman Beaton Trevor Thomas","running_time":"110 min","music_by":"Gladys Knight and the Pips Aretha Franklin Jimmy Helms The Drifters Ben E. King The O'Jays","edited_by":"Thom Noble","written_by":"Jamal Ali","budget":"under £300,000[1] or $350,000[2]"}