{"Cast":"The beginning of the film's ending credits state that \"Most of the principal actors in Citizen Kane are new to motion pictures. The Mercury Theatre is proud to introduce them.\"[2] The cast is listed in the following order:Additionally, Charles Bennett appears as the entertainer at the head of the chorus line in the Inquirer party sequence,[4]:40–41 and cinematographer Gregg Toland makes a cameo appearance as an interviewer depicted in part of the News on the March newsreel.[5]","country":"United States","distributed_by":"RKO Radio Pictures","Legacy":"Citizen Kane was the only film made under Welles's original contract with RKO Pictures, which gave him complete creative control.[9]:223 Welles's new business manager and attorney permitted the contract to lapse. In July 1941,[121][122] Welles reluctantly signed a new and less favorable deal with RKO[9]:223 under which he produced and directed The Magnificent Ambersons (1942), produced Journey into Fear (1943), and began It's All True, a film he agreed to do without payment. In the new contract Welles was an employee of the studio[123] and lost the right to final cut, which later allowed RKO to modify and re-cut The Magnificent Ambersons over his objections.[9]:223 In June 1942 Schaefer resigned the presidency of RKO Pictures and Welles's contract was terminated by his successor.[50]During World War II, Citizen Kane was not seen in most European countries. It was shown in France for the first time on July 10, 1946 at the Marbeuf theatre in Paris.[124]:34–35[p] Initially most French film critics were influenced by the negative reviews of Jean-Paul Sartre in 1945 and Georges Sadoul in 1946.[8]:118 At that time many French intellectuals and filmmakers shared Sartre's negative opinion that Hollywood filmmakers were uncultured.[126]:124 Sartre criticized the film's flashbacks for its nostalgic and romantic preoccupation with the past instead of the realities of the present and said that \"the whole film is based on a misconception of what cinema is all about. The film is in the past tense, whereas we all know that cinema has got to be in the present tense.\"[127][128]André Bazin, a little-known film critic working for Sartre's Les Temps modernes, was asked to give an impromptu speech about the film after a screening at the Colisée Theatre in the autumn of 1946[124]:36 and changed the opinion of much of the audience. This speech led to Bazin's 1947 article \"The Technique of Citizen Kane\",[126]:125 which directly influenced public opinion about the film.[126]:124 Carringer wrote that Bazin was \"the one who did the most to enhance the film’s reputation.\"[8]:118[q] Both Bazin's critique of the film and his theories about cinema itself centered around his strong belief in mise en scène. These theories were diametrically opposed to both the popular Soviet montage theory[55]:xiii and the politically Marxist and anti-Hollywood beliefs of most French film critics at that time.[124]:36 Bazin believed that a film should depict reality without the filmmaker imposing their \"will\" on the spectator, which the Soviet theory supported.[55]:xiii Bazin wrote that Citizen Kane's mise en scène created a \"new conception of filmmaking\"[55]:233 and that the freedom given to the audience from the deep focus shots was innovative by changing the entire concept of the cinematic image.[126]:128 Bazin wrote extensively about the mise en scène in the scene where Susan Alexander attempts suicide, which was one long take while other films would have used four or five shots in the scene.[55]:234 Bazin wrote that the film's mise en scène \"forces the spectator to participate in the meaning of the film\" and creates \"a psychological realism which brings the spectator back to the real conditions of perception.\"[56]:72In his 1950 essay \"The Evolution of the Language of Cinema\", Bazin placed Citizen Kane center stage as a work which ushered in a new period in cinema.[129]:37 One of the first critics to defend motion pictures as being on the same artistic level as literature or painting, Bazin often used the film as an example of cinema as an art form[126]:129 and wrote that \"Welles has given the cinema a theoretical restoration. He has enriched his filmic repertory with new or forgotten effects that, in today’s artistic context, take on a significance we didn’t know they could have.\"[55]:236 Bazin also compared the film to Roberto Rossellini's Paisà for having \"the same aesthetic concept of realism\"[126]:117–118 and to the films of William Wyler shot by Toland (such as The Little Foxes and The Best Years of Our Lives), all of which used deep focus cinematography that Bazin called \"a dialectical step forward in film language.\"[56]:71Bazin's praise of the film went beyond film theory and reflected his own philosophy towards life itself.[126]:125 His metaphysical interpretations about the film reflected humankind’s place in the universe.[126]:128 Bazin believed that the film examined one person's identity and search for meaning. It portrayed the world as ambiguous and full of contradictions, whereas films up until then simply portrayed people’s actions and motivations.[126]:130 Bazin's biographer Dudley Andrew wrote that:The world of Citizen Kane, that mysterious, dark, and infinitely deep world of space and memory where voices trail off into distant echoes and where meaning dissolves into interpretation, seemed to Bazin to mark the starting point from which all of us try to construct provisionally the sense of our lives.[126]:129Bazin went on to co-found Cahiers du cinéma, whose contributors (including future film directors François Truffaut and Jean-Luc Godard) also praised the film.[129]:37 The popularity of Truffaut's auteur theory helped the film's and Welles's reputation.[130]:263By 1942 Citizen Kane had run its course theatrically and, apart from a few showings at big city arthouse cinemas, it largely vanished and both the film's and Welles's reputation fell among American critics. In 1949 critic Richard Griffith in his overview of cinema, The Film Till Now, dismissed Citizen Kane as \"... tinpot if not crackpot Freud.\"[8]:117–118In the United States, it was neglected and forgotten until its revival on television in the mid-1950s. Three key events in 1956 led to its re-evaluation in the United States: first, RKO was one of the first studios to sell its library to television, and early that year Citizen Kane started to appear on television; second, the film was re-released theatrically to coincide with Welles's return to the New York stage, where he played King Lear; and third, American film critic Andrew Sarris wrote \"Citizen Kane: The American Baroque\" for Film Culture, and described it as \"the great American film\" and \"the work that influenced the cinema more profoundly than any American film since Birth of a Nation.\"[131] Carringer considers Sarris's essay as the most important influence on the film's reputation in the US.[8]:119During Expo 58, a poll of over 100 film historians named Kane one of the top ten greatest films ever made (the group gave first-place honors to The Battleship Potemkin). When a group of young film directors announced their vote for the top six, they were booed for not including the film.[132]:152In the decades since, its critical status as the greatest film ever made has grown, with numerous essays and books on it including Peter Cowie's The Cinema of Orson Welles, Ronald Gottesman's Focus on Citizen Kane, a collection of significant reviews and background pieces, and most notably Kael's essay, \"Raising Kane\", which promoted the value of the film to a much wider audience than it had reached before.[8]:120 Despite its criticism of Welles, it further popularized the notion of Citizen Kane as the great American film. The rise of art house and film society circuits also aided in the film's rediscovery.[8]:119 David Thomson said that the film 'grows with every year as America comes to resemble it.\"[43]:1172The British magazine Sight & Sound has produced a Top Ten list surveying film critics every decade since 1952, and is regarded as one of the most respected barometers of critical taste.[133] Citizen Kane was a runner up to the top 10 in its 1952 poll but was voted as the greatest film ever made in its 1962 poll,[134] retaining the top spot in every subsequent poll[135][136][137] until 2012, when Vertigo displaced it.[138]The film has also ranked number one in the following film \"best of\" lists: Julio Castedo's The 100 Best Films of the Century,[139] Cahiers du cinéma's 100 films pour une cinémathèque idéale,[140] Kinovedcheskie Zapiski,[141] Time Out magazine's Top 100 Films (Centenary),[142] The Village Voice's 100 Greatest Films,[143] and The Royal Belgian Film Archive's Most Important and Misappreciated American Films.[144]Roger Ebert called Citizen Kane the greatest film ever made: \"But people don't always ask about the greatest film. They ask, 'What's your favorite movie?' Again, I always answer with Citizen Kane.\"[145]In 1989, the United States Library of Congress deemed the film \"culturally, historically, or aesthetically significant\" and selected it for preservation in the National Film Registry. Citizen Kane was one of the first 25 films inducted into the registry.[146]On February 18, 1999, the United States Postal Service honored Citizen Kane by including it in its Celebrate the Century series.[147] The film was honored again February 25, 2003, in a series of U.S. postage stamps marking the 75th anniversary of the Academy of Motion Picture Arts and Sciences. Art director Perry Ferguson represents the behind-the-scenes craftsmen of filmmaking in the series; he is depicted completing a sketch for Citizen Kane.[148]Citizen Kane was ranked number one in the American Film Institute's polls of film industry artists and leaders in 1998[149] and 2007.[150] \"Rosebud\" was chosen as the 17th most memorable movie quotation in a 2005 AFI poll.[151] The film's score was one of 250 nominees for the top 25 film scores in American cinema in another 2005 AFI poll.[152]The film currently has a 100% rating at Rotten Tomatoes, based on 70 reviews by approved critics, with an average rating of 9.4/10. The site's consensus states: \"Orson Welles's epic tale of a publishing tycoon's rise and fall is entertaining, poignant, and inventive in its storytelling, earning its reputation as a landmark achievement in film.\"[153]Citizen Kane has been called the most influential film of all time.[154] Richard Corliss has asserted that Jules Dassin's 1941 film The Tell-Tale Heart was the first example of its influence[155] and the first pop culture reference to the film occurred later in 1941 when the spoof comedy Hellzapoppin' featured a \"Rosebud\" sled.[156][r] The film's cinematography was almost immediately influential and in 1942 American Cinematographer wrote \"without a doubt the most immediately noticeable trend in cinematography methods during the year was the trend toward crisper definition and increased depth of field.\"[158]:51The cinematography influenced John Huston's The Maltese Falcon. Cinematographer Arthur Edeson used a wider-angle lens than Toland and the film includes many long takes, low angles and shots of the ceiling, but it did not use deep focus shots on large sets to the extent that Citizen Kane did. Edeson and Toland are often credited together for revolutionizing cinematography in 1941.[158]:48–50 Toland's cinematography influenced his own work on The Best Years of Our Lives. Other films influenced include Gaslight, Mildred Pierce and Jane Eyre.[8]:85–86 Cinematographer Kazuo Miyagawa said that his use of deep focus was influenced by \"the camera work of Gregg Toland in Citizen Kane\" and not by traditional Japanese art.[159]Its cinematography, lighting, and flashback structure influenced such film noirs of the 1940s and 1950s as The Killers, Keeper of the Flame, Caught, The Great Man[67]:425 and This Gun for Hire.[8]:85–86 David Bordwell and Kristin Thompson have written that “For over a decade thereafter American films displayed exaggerated foregrounds and somber lighting, enhanced by long takes and exaggerated camera movements.” However, by the 1960s filmmakers such as those from the French New Wave and Cinéma vérité movements favored \"flatter, more shallow images with softer focus\" and Citizen Kane's style became less fashionable. American filmmakers in the 1970s combined these two approaches by using long takes, rapid cutting, deep focus and telephoto shots all at once.[130]:798 Its use of long takes influenced films such as The Asphalt Jungle, and its use of deep focus cinematography influenced Gun Crazy,[130]:389–390 The Whip Hand, The Devil's General and Justice Is Done.[130]:414 The flashback structure in which different characters have conflicting versions of past events influenced La commare secca[130]:533 and Man of Marble.[130]:747The film's structure influenced the biographical films Lawrence of Arabia and Mishima: A Life in Four Chapters—which begin with the subject's death and show their life in flashbacks—as well as Welles's thriller Mr. Arkadin.[132]:154 Rosenbaum sees similarities in the film's plot to Mr. Arkadin, as well as the theme of nostalgia for loss of innocence throughout Welles's career, beginning with Citizen Kane and including The Magnificent Ambersons, Mr. Arkadin and Chimes at Midnight. Rosenbaum also points out how the film influenced Warren Beatty's Reds. The film depicts the life of Jack Reed through the eyes of Louise Bryant, much as Kane's life is seen through the eyes of Thompson and the people who he interviews. Rosenbaum also compared the romantic montage between Reed and Bryant with the breakfast table montage in Citizen Kane.[160]:113–116, 300–302Akira Kurosawa's Rashomon is often compared to the film due to both having complicated plot structures told by multiple characters in the film. Welles said his initial idea for the film was \"Basically, the idea Rashomon used later on,\"[10]:53 however Kurosawa had not yet seen the film before making Rashomon in 1950.[161]:78 Nigel Andrews has compared the film's complex plot structure to Rashomon, Last Year at Marienbad, Memento and Magnolia. Andrews also compares Charles Foster Kane to Michael Corleone in The Godfather, Jake LaMotta in Raging Bull and Daniel Plainview in There Will Be Blood for their portrayals of \"haunted megalomaniac[s], presiding over the shards of [their] own [lives].\"[162]The films of Paul Thomas Anderson have been compared to it. Variety compared There Will Be Blood to the film[163] and called it \"one that rivals Giant and Citizen Kane in our popular lore as origin stories about how we came to be the people we are.\"[164] The Master has been called \"movieland’s only spiritual sequel to Citizen Kane that doesn’t shrivel under the hefty comparison\"[165] and the film's loose depiction of L. Ron Hubbard has been compared to Citizen Kane's depiction of Hearst.[166] The Social Network has been compared to the film for its depiction of a media mogul and by the character Erica Albright being similar to \"Rosebud\".[167] The controversy of the Sony hacking before the release of The Interview brought comparisons of Hearst's attempt to suppress the film.[168] The film's plot structure and some specific shots influenced Todd Haynes's Velvet Goldmine.[169] Abbas Kiarostami's The Traveler has been called \"the Citizen Kane of the Iranian children’s cinema.\"[170] The film's use of overlapping dialogue has influenced the films of Robert Altman and Carol Reed.[67]:412 Reed's films Odd Man Out, The Third Man (in which Welles and Cotten appeared) and Outcast of the Islands were also influenced by the film's cinematography.[67]:425Many directors have listed it as one of the greatest films ever made, including Woody Allen, Michael Apted, Les Blank, Kenneth Branagh, Paul Greengrass, Michel Hazanavicius, Michael Mann, Sam Mendes, Jiri Menzel, Paul Schrader, Martin Scorsese,[171] Denys Arcand, Gillian Armstrong, John Boorman, Roger Corman, Alex Cox, Milos Forman, Norman Jewison, Richard Lester, Richard Linklater, Paul Mazursky, Ronald Neame, Sydney Pollack[172] and Stanley Kubrick.[173] Yasujirō Ozu said it was his favorite non-Japanese film and was impressed by its techniques.[174]:231 François Truffaut said that the film \"has inspired more vocations to cinema throughout the world than any other\" and recognized its influence in The Barefoot Contessa, Les Mauvaises Rencontres, Lola Montès, and 8 1/2.[175]:279–280 Truffaut's Day for Night pays tribute to the film in a dream sequence depicting a childhood memory of the character played by Truffaut stealing publicity photos from the film.[176] Numerous film directors have cited the film as influential on their own films, including Theo Angelopoulos,[177] Luc Besson, the Coen brothers, Francis Ford Coppola, Brian De Palma, John Frankenheimer, Stephen Frears, Sergio Leone, Michael Mann, Ridley Scott, Martin Scorsese, Bryan Singer and Steven Spielberg.[178] Ingmar Bergman disliked the film and called it \"a total bore. Above all, the performances are worthless. The amount of respect that movie has is absolutely unbelievable!\"[179]William Friedkin said that the film influenced him and called it \"a veritable quarry for filmmakers, just as Joyce's Ulysses is a quarry for writers.\"[180]:210 The film has also influenced other art forms. Carlos Fuentes's novel The Death of Artemio Cruz was partially inspired by the film[181] and the rock band The White Stripes paid unauthorized tribute to the film in the song \"The Union Forever\".[182]In 1982, film director Steven Spielberg bought a \"Rosebud\" sled for $60,500; it was one of three balsa sleds used in the closing scenes and the only one that was not burned.[183][184] After the Spielberg purchase, it was reported that retiree Arthur Bauer claimed to own another \"Rosebud\" sled.[185] In early 1942 when Bauer was 12 he won an RKO publicity contest and selected the hardwood sled as his prize.[186] In 1996, Bauer's estate offered the painted pine sled at auction through Christie's.[186] Bauer's son told CBS News that his mother had once wanted to paint the sled and use it as a plant stand, but Bauer told her to \"just save it and put it in the closet.\"[187] The sled was sold to an anonymous bidder for $233,500.[188]Welles's Oscar for Best Original Screenplay was believed to be lost until it was rediscovered in 1994. It was withdrawn from a 2007 auction at Sotheby's when bidding failed to reach its estimate of $800,000 to $1.2 million.[189] Owned by the charitable Dax Foundation,[189] it was auctioned for $861,542 in 2011 to an anonymous buyer.[190] Mankiewicz's Oscar was sold at least twice, in 1999 and again in 2012, the latest price being $588,455.[191]In 1989, Mankiewicz's personal copy of the Citizen Kane script was auctioned at Christie's. The leather-bound volume included the final shooting script and a carbon copy of American that bore handwritten annotations—purportedly made by Hearst's lawyers, who were said to have obtained it in the manner described by Kael in \"Raising Kane\".[192][193] Estimated to bring $70,000 to $90,000,[194] it sold for a record $231,000.[195]In 2007, Welles's personal copy of the last revised draft of Citizen Kane before the shooting script was sold at Sotheby's for $97,000.[189] A second draft of the script titled American, marked \"Mr. Welles' working copy\", was auctioned by Sotheby's in 2014 for $164,692.[196][s] A collection of 24 pages from a working script found in Welles's personal possessions by his daughter Beatrice Welles was auctioned in 2014 for $15,000.[198]In 2014, a collection of approximately 235 Citizen Kane stills and production photos that had belonged to Welles was sold at auction for $7,812.[199][200]","language":"English","cinematography":"Gregg Toland","production_company":"Mercury Productions","directed_by":"Orson Welles","release_dates":"May 1, 1941 (1941-05-01) (Palace Theatre)|September 5, 1941 (1941-09-05) (United States)||||","Production":"Citizen Kane was a rare film in that its principal roles were played by actors new to motion pictures. Ten were billed as Mercury Actors, members of the skilled repertory company assembled by Welles for the stage and radio performances of the Mercury Theatre, an independent theater company he founded with Houseman in 1937.[7]:119–120[35] \"He loved to use the Mercury players,\" wrote biographer Charles Higham, \"and consequently he launched several of them on movie careers.\"[34]:155The film represents the feature film debuts of William Alland, Ray Collins, Joseph Cotten, Agnes Moorehead, Erskine Sanford, Everett Sloane, Paul Stewart, and Welles himself.[3] Despite never having appeared in feature films, some of the cast members were already well known to the public. Cotten had recently become a Broadway star in the hit play The Philadelphia Story with Katharine Hepburn[9]:187 and Sloane was well known for his role on the radio show The Goldbergs.[9]:187 [f] Mercury actor George Coulouris was a star of the stage in New York and London.[35]Not all of the cast came from the Mercury Players. Welles cast Dorothy Comingore as Susan Alexander Kane. Comingore had never appeared in a film and was a discovery of Charlie Chaplin.[9]:188 Chaplin recommended Comingore to Welles,[36]:170 who then met Comingore at a party in Los Angeles and immediately cast her.[37]:44Welles had met stage actress Ruth Warrick while visiting New York on a break from Hollywood and remembered her as a good fit for Emily Norton Kane,[9]:188 later saying that she looked the part.[36]:169 Warrick told Carringer that she was struck by the extraordinary resemblance between herself and Welles's mother when she saw a photograph of Beatrice Ives Welles. She characterized her own personal relationship with Welles as motherly.[38]:14\"He trained us for films at the same time that he was training himself,\" recalled Agnes Moorehead. \"Orson believed in good acting, and he realized that rehearsals were needed to get the most from his actors. That was something new in Hollywood: nobody seemed interested in bringing in a group to rehearse before scenes were shot. But Orson knew it was necessary, and we rehearsed every sequence before it was shot.\"[39]:9When The March of Time narrator Westbrook Van Voorhis asked for $25,000 to narrate the News on the March sequence, Alland demonstrated his ability to imitate Van Voorhis and Welles cast him.[40]Welles later said that casting character actor Gino Corrado in the small part of the waiter at the El Rancho broke his heart. Corrado had appeared in many Hollywood films, often as a waiter, and Welles wanted all of the actors to be new to films.[36]:171Other uncredited roles went to Thomas A. Curran as Teddy Roosevelt in the faux newsreel; Richard Baer as Hillman, a man at Madison Square Garden, and a man in the News on the March screening room; and Alan Ladd, Arthur O'Connell and Louise Currie as reporters at Xanadu.[3] When Kathryn Trosper Popper died on March 6, 2016, at the age of 100 she was believed to have been the film's last surviving cast member.[41] Warrick was the last surviving member of the principal cast at the time of her death in 2005. Sonny Bupp, who played Kane's young son, was the last surviving credited cast member of Citizen Kane when he died in 2007.[42]Production advisor Miriam Geiger quickly compiled a handmade film textbook for Welles, a practical reference book of film techniques that he studied carefully. He then taught himself filmmaking by matching its visual vocabulary to The Cabinet of Dr. Caligari, which he ordered from the Museum of Modern Art,[9]:173 and films by Frank Capra, René Clair, Fritz Lang, King Vidor[43]:1172:1171 and Jean Renoir.[7]:209 The one film he genuinely studied was John Ford's Stagecoach,[10]:29 which he watched 40 times.[44] \"As it turned out, the first day I ever walked onto a set was my first day as a director,\" Welles said. \"I'd learned whatever I knew in the projection room—from Ford. After dinner every night for about a month, I'd run Stagecoach, often with some different technician or department head from the studio, and ask questions. 'How was this done?' 'Why was this done?' It was like going to school.\"[10]:29Welles's cinematographer for the film was Gregg Toland, described by Welles as \"just then, the number-one cameraman in the world.\" To Welles's astonishment, Toland visited him at his office and said, \"I want you to use me on your picture.\" He had seen some of the Mercury stage productions (including Caesar[13]:66) and said he wanted to work with someone who had never made a movie.[10]:59 RKO hired Toland on loan from Samuel Goldwyn Productions[32]:10 in the first week of June 1940.[8]:40\"And he never tried to impress us that he was doing any miracles,\" Welles recalled. \"I was calling for things only a beginner would have been ignorant enough to think anybody could ever do, and there he was, doing them.\"[10]:60 Toland later explained that he wanted to work with Welles because he anticipated the first time director's inexperience and reputation for audacious experimentation in the theater would allow the cinematographer to try new and innovative camera techniques that typical Hollywood films would never have allowed him to do.[9]:186 Unaware of filmmaking protocol, Welles adjusted the lights on set as he was accustomed to doing in the theater; Toland quietly re-balanced them, and was angry when one of the crew informed Welles that he was infringing on Toland's responsibilities.[45]:5:33–6:06 During the first few weeks of June, Welles had lengthy discussions about the film with Toland and art director Perry Ferguson in the morning, and in the afternoon and evening he worked with actors and revised the script.[8]:69On June 29, 1940—a Saturday morning when few inquisitive studio executives would be around—Welles began filming Citizen Kane.[8]:69[13]:107 After the disappointment of having Heart of Darkness cancelled,[10]:30–31 Welles followed Ferguson's suggestion[g][10]:57 and deceived RKO into believing that he was simply shooting camera tests. \"But we were shooting the picture,\" Welles said, \"because we wanted to get started and be already into it before anybody knew about it.\"[10]:57At the time RKO executives were pressuring him to agree to direct a film called The Men from Mars, to capitalize on \"The War of the Worlds\" radio broadcast. Welles said that he would consider making the project but wanted to make a different film first. At this time he did not inform them that he had already begun filming Citizen Kane.[9]:186The early footage was called \"Orson Welles Tests\" on all paperwork.[8]:69 The first \"test\" shot was the News on the March projection room scene, economically filmed in a real studio projection room in darkness that masked many actors who appeared in other roles later in the film.[8]:69[10]:77–78[h] \"At $809 Orson did run substantially beyond the test budget of $528—to create one of the most famous scenes in movie history,\" wrote Barton Whaley.[13]:107The next scenes were the El Rancho nightclub scenes and the scene in which Susan attempts suicide.[i][8]:69 Welles later said that the nightclub set was available after another film had wrapped and that filming took 10 to 12 days to complete. For these scenes Welles had Comingore's throat sprayed with chemicals to give her voice a harsh, raspy tone.[36]:170–171 Other scenes shot in secret included those in which Thompson interviews Leland and Bernstein, which were also shot on sets built for other films.[40]During production, the film was referred to as RKO 281. Most of the filming took place in what is now Stage 19 on the Paramount Pictures lot in Hollywood.[47] There was some location filming at Balboa Park in San Diego and the San Diego Zoo.[48]In the end of July, RKO approved the film and Welles was allowed to officially begin shooting, despite having already been filming \"tests\" for several weeks. Welles leaked stories to newspaper reporters that the tests had been so good that there was no need to re-shoot them. The first official scene to be shot was the breakfast montage sequence between Kane and his first wife Emily. To strategically save money and appease the RKO executives who opposed him, Welles rehearsed scenes extensively before actually shooting and filmed very few takes of each shot set-up.[9]:193 Welles never shot master shots for any scene after Toland told him that Ford never shot them.[36]:169 To appease the increasingly curious press, Welles threw a cocktail party for selected reporters, promising that they could watch a scene being filmed. When the journalists arrived Welles told them they had “just finished” shooting for the day but still had the party.[9]:193 Welles told the press that he was ahead of schedule (without factoring in the month of \"test shooting\"), thus discrediting claims that after a year in Hollywood without making a film he was a failure in the film industry.[9]:194Welles usually worked 16 to 18 hours a day on the film. He often began work at 4 a.m. since the special effects make-up used to age him for certain scenes took up to four hours to apply. Welles used this time to discuss the day's shooting with Toland and other crew members. The special contact lenses used to make Welles look elderly proved very painful, and a doctor was employed to place them into Welles's eyes. Welles had difficulty seeing clearly while wearing them, which caused him to badly cut his wrist when shooting the scene in which Kane breaks up the furniture in Susan's bedroom. While shooting the scene in which Kane shouts at Gettys on the stairs of Susan Alexander's apartment building, Welles fell ten feet; an X-ray revealed two bone chips in his ankle.[9]:194 The injury required him to direct the film from a wheelchair for two weeks.[9]:194–195 He eventually wore a steel brace to resume performing on camera; it is visible in the low-angle scene between Kane and Leland after Kane loses the election.[j][10]:61 For the final scene, a stage at the Selznick studio was equipped with a working furnace, and multiple takes were required to show the sled being put into the fire and the word \"Rosebud\" consumed. Paul Stewart recalled that on the ninth take the Culver City Fire Department arrived in full gear because the furnace had grown so hot the flue caught fire. \"Orson was delighted with the commotion\", he said.[39]:8–9When \"Rosebud\" was burned, Welles choreographed the scene while he had composer Bernard Herrmann's cue playing on the set.[49]Unlike Schaefer, many members of RKO's board of governors did not like Welles or the control that his contract gave him.[9]:186 However such board members as Nelson Rockefeller and NBC chief David Sarnoff[43]:1170 were sympathetic to Welles.[50] Throughout production Welles had problems with these executives not respecting his contract’s stipulation of non-interference and several spies arrived on set to report what they saw to the executives. When the executives would sometimes arrive on set unannounced the entire cast and crew would suddenly start playing softball until they left. Before official shooting began the executives intercepted all copies of the script and delayed their delivery to Welles. They had one copy sent to their office in New York, resulting in it being leaked to press.[9]:195Principal shooting wrapped October 24. Welles then took several weeks off of the film for a lecture tour, during which he also scouted additional locations with Toland and Ferguson. Filming resumed November 15[8]:87 with some re-shoots. Toland had to leave due to a commitment to shoot Howard Hughes' The Outlaw, but Toland's camera crew continued working on the film and Toland was replaced by RKO cinematographer Harry J. Wild. The final day of shooting on November 30 was Kane's death scene.[8]:85 Welles boasted that he only went 21 days over his official shooting schedule, without factoring in the month of \"camera tests.\"[9]:195 According to RKO records, the film cost $839,727. Its estimated budget had been $723,800.[3]Citizen Kane was edited by Robert Wise and assistant editor Mark Robson.[32]:85 Both would become successful film directors. Wise was hired after Welles finished shooting the \"camera tests\" and began officially making the film. Wise said that Welles \"had an older editor assigned to him for those tests and evidently he was not too happy and asked to have somebody else. I was roughly Orson’s age and had several good credits.” Wise and Robson began editing the film while it was still shooting and said that they “could tell certainly that we were getting something very special. It was outstanding film day in and day out.”[43]:1210 Welles gave Wise detailed instructions and was usually not present during the film's editing.[8]:109 The film was very well planned out and intentionally shot for such post-production techniques as slow dissolves.[40] The lack of coverage made editing easy since Welles and Toland edited the film \"in camera\" by leaving few options of how it could be put together.[8]:110 Wise said the breakfast table sequence took weeks to edit and get the correct \"timing\" and \"rhythm\" for the whip pans and over-lapping dialogue.[40] The News on the March sequence was edited by RKO's newsreel division to give it authenticity.[8]:110 They used stock footage from Pathé News and the General Film Library.[3]During post-production Welles and special effects artist Linwood G. Dunn experimented with an optical printer to improve certain scenes that Welles found unsatisfactory from the footage.[40] Whereas Welles was often immediately pleased with Wise's work, he would require Dunn and post-production audio engineer James G. Stewart to re-do their work several times until he was satisfied.[8]:109Welles hired Bernard Herrmann to compose the film's score. Where most Hollywood film scores were written quickly, in as few as two or three weeks after filming was completed, Herrmann was given 12 weeks to write the music. He had sufficient time to do his own orchestrations and conducting, and worked on the film reel by reel as it was shot and cut. He wrote complete musical pieces for some of the montages, and Welles edited many of the scenes to match their length.[51]Written and directed by Welles at Toland's suggestion, the theatrical trailer for Citizen Kane differs from other trailers in that it did not feature a single second of footage of the actual film itself, but acts as a wholly original, tongue-in-cheek, pseudo-documentary piece on the film's production.[36]:230 Filmed at the same time as Citizen Kane itself, it offers the only existing behind-the-scenes footage of the film. The trailer, shot by Harry J. Wild instead of Toland, follows an unseen Welles as he provides narration for a tour around the film set, introductions to the film's core cast members, and a brief overview of Kane's character.[10]:360 The trailer also contains a number of trick shots, including one of Everett Sloane appearing at first to be running into the camera, which turns out to be the reflection of the camera in a mirror.[52]At the time, it was almost unprecedented for a film trailer to not actually feature anything of the film itself; and while Citizen Kane is frequently cited as a ground-breaking, influential film, Simon Callow argues its trailer was no less original in its approach. Callow writes that it has \"great playful charm...it is a miniature documentary, almost an introduction to the cinema...Teasing, charming, completely original, it is a sort of conjuring trick: without his face appearing once on the screen, Welles entirely dominates its five [sic] minutes' duration.\"[12]:558-9","running_time":"119 minutes[1]","Style":"Film scholars and historians view Citizen Kane as Welles's attempt to create a new style of filmmaking by studying various forms of film making, and combining them all into one. However, Welles stated that his love for cinema began only when he started the work on the film. When asked where he got the confidence as a first-time director to direct a film so radically different from contemporary cinema, he responded, \"Ignorance, ignorance, sheer ignorance—you know there's no confidence to equal it. It's only when you know something about a profession, I think, that you're timid or careful.\"[22]:80David Bordwell wrote that \"The best way to understand Citizen Kane is to stop worshiping it as a triumph of technique.\" Bordwell argues that the film did not invent any of its famous techniques such as deep focus cinematography, shots of the ceilings, chiaroscuro lighting and temporal jump-cuts, and many of these stylistics had been used in German Expressionist films of the 1920s, such as The Cabinet of Dr. Caligari. But Bordwell asserts that the film did put them all together for the first time and perfected the medium in one single film.[43]:1171 In a 1948 interview D. W. Griffith said \"I loved Citizen Kane and particularly loved the ideas he took from me.\"[53]Arguments against the film's cinematic innovations were made as early as 1946 when French historian Georges Sadoul wrote that \"the film is an encyclopedia of old techniques.\" Sadoul pointed out such examples as compositions that used both the foreground and the background in the films of Auguste and Louis Lumière, special effects used in the films of Georges Méliès, shots of the ceiling in Erich von Stroheim's Greed and newsreel montages in the films of Dziga Vertov.[54]French film critic André Bazin defended the film and wrote that \"In this respect, the accusation of plagiarism could very well be extended to the film's use of panchromatic film or its exploitation of the properties of gelatinous silver halide.\" Bazin disagreed with Sadoul's comparison to Lumière's cinematography since Citizen Kane used more sophisticated lenses,[55]:232 but acknowledged that the film had similarities to such previous works as The 49th Parallel and The Power and the Glory. Bazin stated that \"even if Welles did not invent the cinematic devices employed in Citizen Kane, one should nevertheless credit him with the invention of their meaning.\"[55]:233 Bazin championed the techniques in the film for its depiction of heightened reality, but Bordwell believes that the film's use of special effects contradict some of Bazin's theories.[56]:75Citizen Kane eschews the traditional linear, chronological narrative, and tells Kane's story entirely in flashback using different points of view, many of them from Kane's aged and forgetful associates, the cinematic equivalent of the unreliable narrator in literature.[57]:83 Welles also dispenses with the idea of a single storyteller and uses multiple narrators to recount Kane's life. The use of multiple narrators was unheard of in Hollywood films.[57]:81 Each narrator recounts a different part of Kane's life, with each story partly overlapping.[58] The film depicts Kane as an enigma, a complicated man who, in the end, leaves viewers with more questions than answers as to his character, such as the newsreel footage where he is attacked for being both a communist and a fascist.[57]:82–84The technique of using flashbacks had been used in earlier films—most notably in The Power and the Glory (1933)[59]—but no film was as immersed in this technique as Citizen Kane. The use of the reporter Thompson acts as a surrogate for the audience, questioning Kane's associates and piecing together his life.[58]At that time films typically had an \"omniscient perspective\", which Marilyn Fabe says give the audience the \"illusion that we are looking with impunity into a world which is unaware of our gaze, Hollywood movies give us a feeling of power.\" The film begins in this fashion up until the News on the March sequence, after which we the audience see the film through the perspectives of others.[57]:81 The News on the March sequence gives an overview of Kane's entire life (and the film's entire story) at the beginning of the film, leaving the audience without the typical suspense of wondering how it will end. Instead the film's repetitions of events compels the audience to analyze and wonder why Kane's life happened the way that it did, under the pretext of finding out what \"Rosebud\" means. The film then returns to the omniscient perspective in the final scene, when only the audience discovers what \"Rosebud\" is.[57]:82–83The most innovative technical aspect of Citizen Kane is the extended use of deep focus.[60] In nearly every scene in the film, the foreground, background and everything in between are all in sharp focus. Cinematographer Toland did this through his experimentation with lenses and lighting. Toland described the achievement, made possible by the sensitivity of modern speed film, in an article for Theatre Arts magazine:New developments in the science of motion picture photography are not abundant at this advanced stage of the game but periodically one is perfected to make this a greater art. Of these I am in an excellent position to discuss what is termed “Pan-focus”, as I have been active for two years in its development and used it for the first time in Citizen Kane. Through its use, it is possible to photograph action from a range of eighteen inches from the camera lens to over two hundred feet away, with extreme foreground and background figures and action both recorded in sharp relief. Hitherto, the camera had to be focused either for a close or a distant shot, all efforts to encompass both at the same time resulting in one or the other being out of focus. This handicap necessitated the breaking up of a scene into long and short angles, with much consequent loss of realism. With pan-focus, the camera, like the human eye, sees an entire panorama at once, with everything clear and lifelike.[61]Both this article and a May 1941 Life magazine article with illustrated examples[62] helped popularize deep focus cinematography and Toland's achievements on the film.[56]:73Another unorthodox method used in the film was the way low-angle shots were used to display a point of view facing upwards, thus allowing ceilings to be shown in the background of several scenes. Breaking with studio convention, every set was built with a ceiling[61]—many constructed of fabric that ingeniously concealed microphones.[63] Welles felt that the camera should show what the eyes see, and that it was a bad theatrical convention to pretend there was no ceiling—\"a big lie in order to get all those terrible lights up there,\" he said. He became fascinated with the look of low angles, which made even dull interiors look interesting. One extremely low angle is used to photograph the encounter between Kane and Leland after Kane loses the election. A hole was dug for the camera, which required drilling into the concrete floor.[10]:61–62Welles credited Toland on the same title card as himself and said \"It's impossible to say how much I owe to Gregg. He was superb.\"[10]:59[k][l] He called Toland \"the best director of photography that ever existed.\"[65]Citizen Kane's sound was recorded by Bailey Fesler and re-recorded in post-production by audio engineer James G. Stewart,[32]:85 both of whom had worked in radio.[8]:102 Stewart said that Hollywood films never deviated from a basic pattern of how sound could be recorded or used, but with Welles \"deviation from the pattern was possible because he demanded it.\"[40] Although the film is known for its complex soundtrack, much of the audio is heard as it was recorded by Fesler and without manipulation.[8]:102Welles used techniques from radio like overlapping dialogue. The scene in which characters sing \"Oh, Mr. Kane\" was especially complicated and required mixing several soundtracks together.[8]:104 He also used different \"sound perspectives\" to create the illusion of distances,[8]:101 such as in scenes at Xanadu where characters speak to each other at far distances.[40] Welles experimented with sound in post-production, creating audio montages,[66]:94 and chose to create all of the sound effects for the film instead of using RKO's library of sound effects.[8]:100Welles used an aural technique from radio called the \"lightning-mix\". Welles used this technique to link complex montage sequences via a series of related sounds or phrases. For example, Kane grows from a child into a young man in just two shots. As Thatcher hands eight-year-old Kane a sled and wishes him a Merry Christmas, the sequence suddenly jumps to a shot of Thatcher fifteen years later, completing the sentence he began in both the previous shot and the chronological past. Other radio techniques include using a number of voices, each saying a sentence or sometimes merely a fragment of a sentence, and splicing the dialogue together in quick succession, such as the projection room scene.[67]:413-412 The film's sound cost $16,996, but was originally budgeted at $7,288.[8]:105Film critic and director François Truffaut wrote that \"Before Kane, nobody in Hollywood knew how to set music properly in movies. Kane was the first, in fact the only, great film that uses radio techniques. … A lot of filmmakers know enough to follow Auguste Renoir's advice to fill the eyes with images at all costs, but only Orson Welles understood that the sound track had to be filled in the same way.\"[68] Cedric Belfrage of The Clipper wrote \"of all of the delectable flavours that linger on the palate after seeing Kane, the use of sound is the strongest.\"[43]:1171The make-up for Citizen Kane was created and applied by Maurice Seiderman (1907–1989), a junior member of the RKO make-up department.[69]:19 Seiderman's family came to the United States from Russia in 1920, escaping persecution.[69]:18 As a child Seiderman had won a drawing competition and received an apprenticeship at the Moscow Art Theatre,[34]:157 where his father was a wigmaker and make-up artist.[70]:42 In New York his uncle was a theatrical scenic painter, and he helped Seiderman get into the union.[69]:18 He worked on Max Reinhardt's 1924 production of The Miracle and with the Yiddish Art Theatre,[34]:157 and he studied the human figure at the Art Students League of New York.[70]:42 After he moved to Los Angeles he was hired first by Max Factor and then by RKO.[69]:19 Seiderman had not been accepted into the union, which recognized him as only an apprentice, but RKO nevertheless used him to make up principal actors.[69]:19\"Apprentices were not supposed to make up any principals, only extras, and an apprentice could not be on a set without a journeyman present,\" wrote make-up artist Dick Smith, who became friends with Seiderman in 1979. \"During his years at RKO I suspect these rules were probably overlooked often.\"[69]:19 By 1940 Seiderman's uncredited film work included Winterset, Gunga Din, The Hunchback of Notre Dame, Swiss Family Robinson and Abe Lincoln in Illinois.[70]:48 \"Seiderman had gained a reputation as one of the most inventive and creatively precise up-and-coming makeup men in Hollywood,\" wrote biographer Frank Brady.[7]:253On an early tour of RKO, Welles met Seiderman in the small make-up lab he created for himself in an unused dressing room.[69]:19 \"Welles fastened on to him at once,\" wrote biographer Charles Higham. \"With his great knowledge of makeup—indeed, his obsession with it, for he hated his flat nose—Welles was fascinated … Seiderman had an intimate knowledge of anatomy and the process of aging and was acquainted with every line, wrinkle and accretion of fat in aging men and women. Impatient with most makeup methods of his era, he used casts of his subjects in order to develop makeup methods that ensured complete naturalness of expression—a naturalness unrivaled in Hollywood.\"[34]:157\"When Kane came out in script form, Orson told all of us about the picture and said that the most important aspect was the makeup,\" Seiderman recalled. \"I felt that I was being given an assignment that was unique—so I worked accordingly. And there was a lot of work to do. Straight makeups were done in the makeup department by staff, but all the trick stuff and the principal characters were my personal work; nobody else ever touched them. They could not have handled it.\"[70]:46Seiderman developed a thorough plan for aging the principal characters, first making a plaster cast of the face of each of the actors who aged, except Joseph Cotten who was unavailable at that time. He made a plaster mold of Welles's body down to the hips.[70]:46\"My sculptural techniques for the characters' aging were handled by adding pieces of white modeling clay, which matched the plaster, onto the surface of each bust,\" Seiderman told visual arts historian Norman Gambill. When Seiderman achieved the desired effect he cast the clay pieces in a soft plastic material[70]:46 that he formulated himself.[69]:20 These appliances were then placed onto the plaster bust and a four-piece mold was made for each phase of aging. The castings were then fully painted and paired with the appropriate wig for evaluation.[70]:46–47Before the actors went before the cameras each day, the pliable pieces were applied directly to their faces to recreate Seiderman's sculptural image. Welles was allergic to Max Factor's gum, so Seiderman invented an alternative that also photographed more realistically.[70]:46 The facial surface was underpainted in a flexible red plastic compound;[70]:43 Cotten recalled being instructed to puff out his cheeks during this process. Later, seeing the results in the mirror, Cotten told Seiderman, \"I am acting the part of a nice old gentleman, not a relief map of the Rocky Mountains.\" Seiderman replied, \"You'd be surprised at what the camera doesn't see unless we place it within its view. How about some more coffee?\"[71]:43The red ground resulted in a warmth of tone that was picked up by the sensitive panchromatic film. Over that was applied liquid greasepaint, and then finally a colorless translucent talcum.[70]:42–43 Seiderman created the effect of skin pores on Kane's face by stippling the surface with a negative cast he made from an orange peel.[70]:42, 47Welles was just as heavily made up as young Kane as he was for old Kane, and he often arrived on the set at 2:30 a.m.[10]:69 Application of the sculptural make-up for the oldest incarnation of the character took three-and-a-half hours. The make-up included appliances to age Welles's shoulders, breast and stomach.[69]:19–20 \"In the film and production photographs, you can see that Kane had a belly that overhung,\" Seiderman said. \"That was not a costume, it was the rubber sculpture that created the image. You could see how Kane's silk shirt clung wetly to the character's body. It could not have been done any other way.\"[70]:46Seiderman worked with Charles Wright on the wigs. These went over a flexible skull cover that Seiderman created and sewed into place with elastic thread. When he found the wigs too full he untied one hair at a time to alter their shape. Kane's mustache was inserted into the makeup surface a few hairs at a time, to realistically vary the color and texture.[70]:43, 47Seiderman made scleral lenses for Welles, Dorothy Comingore, George Coulouris and Everett Sloane, to dull the brightness of their young eyes. The lenses took a long time to fit properly, and Seiderman began work on them before devising any of the other makeup. \"I painted them to age in phases, ending with the blood vessels and the Aurora Senilis of old age.\"[70]:47[m]\"Cotten was the only principal for whom I had not made any sculptural casts, wigs or lenses,\" Seiderman said. When Cotten's old-age scenes needed to be shot out of sequence due to Welles's injured ankle, Seiderman improvised with appliances made for Kane's make-up. A sun visor was chosen to conceal Cotten's low hairline[70]:47–48 and the lenses he wore—hastily supplied by a Beverly Hills ophthalmologist—were uncomfortable.[71]:44–45Seiderman's tour de force, the breakfast montage, was shot all in one day. \"Twelve years, two years shot at each scene,\" he said. \"Please realize, by the way, that a two-year jump in age is a bit harder to accomplish visually than one of 20 years.\"[70]:47As they did with art direction, the major studios gave screen credit for make-up to only the department head. When RKO make-up department head Mel Berns refused to share credit with Seiderman, who was only an apprentice, Welles told Berns that there would be no make-up credit. Welles signed a large advertisement in the Los Angeles newspaper:[69]:22[70]:48THANKS TO EVERYBODY WHO GETS SCREEN CREDIT FOR \"CITIZEN KANE\" AND THANKS TO THOSE WHO DON'T TO ALL THE ACTORS, THE CREW, THE OFFICE, THE MUSICIANS, EVERYBODY AND PARTICULARLY TO MAURICE SEIDERMAN, THE BEST MAKE-UP MAN IN THE WORLD[69]:20\"To put this event in context, remember that I was a very low man,\" Seiderman recalled. \"I wasn't even called a make-up man. I had started their laboratory and developed their plastic appliances for make-up. But my salary was $25 a week. And I had no union card.\"[70]:48Seiderman told Gambill that after Citizen Kane was released, Welles was invited to a White House dinner where Frances Perkins was among the guests. Welles told her about the Russian immigrant who did the make-up for his film but could not join the union. Seiderman said the head of the union received a call from the Labor Department the next day, and in November 1941 he was a full union member.[69]:22[70]:48[n]Although credited as an assistant, the film's art direction was done by Perry Ferguson.[32]:85 Welles and Ferguson got along during their collaboration.[8]:37 In the weeks before production began Welles, Toland and Ferguson met regularly to discuss the film and plan every shot, set design and prop. Ferguson would take notes during these discussions and create rough designs of the sets and story boards for individual shots. After Welles approved the rough sketches, Ferguson made miniature models for Welles and Toland to experiment on with a periscope in order to rehearse and perfect each shot. Ferguson then had detailed drawings made for the set design, including the film's lighting design. The set design was an integral part of the film's overall look and Toland's cinematography.[8]:42In the original script the Great Hall at Xanadu was modeled after the Great Hall in Hearst Castle and its design included a mixture of Renaissance and Gothic styles.[8]:50–51 \"The Hearstian element is brought out in the almost perverse juxtaposition of incongruous architectural styles and motifs,\" wrote Carringer.[8]:54 Before RKO cut the film's budget, Ferguson's designs were more elaborate and resembled the production designs of early Cecil B. DeMille films and Intolerance.[8]:55 The budget cuts reduced Ferguson's budget by 33 percent and his work cost $58,775 total,[8]:65 which was below average at that time.[66]:93 To save costs Ferguson and Welles re-wrote scenes in Xanadu's living room and transported them to the Great Hall. A large staircase from another film was found and used at no additional cost.[8]:56–57 When asked about the limited budget, Ferguson said \"Very often—as in that much-discussed 'Xanadu' set in Citizen Kane—we can make a foreground piece, a background piece, and imaginative lighting suggest a great deal more on the screen than actually exists on the stage.\"[8]:65–66 According to the film's official budget there were 81 sets built, but Ferguson said there were between 106 and 116.[8]:64Still photographs of Oheka Castle in Huntington, New York, were used in the opening montage, representing Kane's Xanadu estate.[74][75] Ferguson also designed statues from Kane's collection with styles ranging from Greek to German Gothic.[8]:61 The sets were also built to accommodate Toland's camera movements. Walls were built to fold and furniture could quickly be moved. The film's famous ceilings were made out of muslin fabric and camera boxes were built into the floors for low angle shots.[8]:64–65 Welles later said that he was proud that the film production value looked much more expensive than the film's budget. Although neither worked with Welles again, Toland and Ferguson collaborated in several films in the 1940s.[8]:65The film's special effects were supervised by RKO department head Vernon L. Walker.[32]:85 Welles pioneered several visual effects to cheaply shoot things like crowd scenes and large interior spaces. For example, the scene in which the camera in the opera house rises dramatically to the rafters, to show the workmen showing a lack of appreciation for Susan Alexander Kane's performance, was shot by a camera craning upwards over the performance scene, then a curtain wipe to a miniature of the upper regions of the house, and then another curtain wipe matching it again with the scene of the workmen. Other scenes effectively employed miniatures to make the film look much more expensive than it truly was, such as various shots of Xanadu.[76]Some shots included rear screen projection in the background, such as Thompson's interview of Leland and some of the ocean backgrounds at Xanadu.[8]:88 Bordwell claims that the scene where Thatcher agrees to be Kane's guardian used rear screen projection to depict young Kane in the background, despite this scene being cited as a prime example of Toland's deep focus cinematography.[56]:74 A special effects camera crew from Walker's department was required for the extreme close-up shots such as Kane's lips when he says \"Rosebud\" and the shot of the typewriter typing Susan's bad review.[8]:88Optical effects artist Dunn claimed that “up to 80 percent of some reels was optically printed.” These shots were traditionally attributed to Toland for years.[77]:110 The optical printer improved some of the deep focus shots.[8]:92 One problem with the optical printer was that it sometimes created excessive graininess, such as the optical zoom out of the snow globe. Welles decided to superimpose snow falling to mask the graininess in these shots.[8]:94 Toland said that he disliked the results of the optical printer,[8]:92 but acknowledged that \"RKO special effects expert Vernon Walker, ASC, and his staff handled their part of the production—a by no means inconsiderable assignment—with ability and fine understanding.\"[56]:74–75Any time deep focus was impossible—as in the scene in which Kane finishes a negative review of Susan's opera while at the same time firing the person who began writing the review—an optical printer was used to make the whole screen appear in focus, visually layering one piece of film onto another.[8]:92 However, some apparently deep-focus shots were the result of in-camera effects, as in the famous scene in which Kane breaks into Susan's room after her suicide attempt. In the background, Kane and another man break into the room, while simultaneously the medicine bottle and a glass with a spoon in it are in closeup in the foreground. The shot was an in-camera matte shot. The foreground was shot first, with the background dark. Then the background was lit, the foreground darkened, the film rewound, and the scene re-shot with the background action.[8]:82The film's music was composed by Bernard Herrmann.[78]:72 Herrmann had composed for Welles for his Mercury Theatre radio broadcasts.[78]:63 Because it was Herrmann's first motion picture score, RKO wanted to pay him only a small fee, but Welles insisted he be paid at the same rate as Max Steiner.[78]:72The score established Herrmann as an important new composer of film soundtracks[33] and eschewed the typical Hollywood practice of scoring a film with virtually non-stop music. Instead Herrmann used what he later described as '\"radio scoring\", musical cues typically 5–15 seconds in length that bridge the action or suggest a different emotional response.[78]:77–78 The breakfast montage sequence begins with a graceful waltz theme and gets darker with each variation on that theme as the passage of time leads to the hardening of Kane's personality and the breakdown of his first marriage.[79][80]Herrmann realized that musicians slated to play his music were hired for individual unique sessions; there was no need to write for existing ensembles. This meant that he was free to score for unusual combinations of instruments, even instruments that are not commonly heard. In the opening sequence, for example, the tour of Kane's estate Xanadu, Herrmann introduces a recurring leitmotiv played by low woodwinds, including a quartet of alto flutes.[81]For Susan Alexander Kane's operatic sequence, Welles suggested that Herrmann compose a witty parody of a Mary Garden vehicle, an aria from Salammbô.[10]:57 \"Our problem was to create something that would give the audience the feeling of the quicksand into which this simple little girl, having a charming but small voice, is suddenly thrown,\" Herrmann said.[78]:79 Writing in the style of a 19th-century French Oriental opera,[51] Herrmann put the aria in a key that would force the singer to strain to reach the high notes, culminating in a high D, well outside the range of Susan Alexander.[78]:79–80 Soprano Jean Forward dubbed the vocal part for Comingore.[33] Houseman claimed to have written the libretto, based on Jean Racine’s Athalie and Phedre,[21]:460–461 although some confusion remains since Lucille Fletcher remembered preparing the lyrics.[78]:80 Fletcher, then Herrmann's wife, wrote the libretto for his opera Wuthering Heights.[78]:11Music enthusiasts consider the scene in which Susan Alexander Kane attempts to sing the famous cavatina \"Una voce poco fa\" from Il barbiere di Siviglia by Gioachino Rossini with vocal coach Signor Matiste as especially memorable for depicting the horrors of learning music through mistakes.[82]In 1972, Herrmann said, \"I was fortunate to start my career with a film like Citizen Kane, it's been a downhill run ever since!\" Welles loved Herrmann's score and told director Henry Jaglom that it was 50 percent responsible for the film's artistic success.[78]:84Some incidental music came from other sources. Welles heard the tune used for the publisher's theme, \"Oh, Mr. Kane\", in Mexico.[10]:57 Called \"A Poco No\", the song was written by Pepe Guízar and special lyrics were written by Herman Ruby.[83]\"In a Mizz\", a 1939 jazz song by Charlie Barnet and Haven Johnson, bookends Thompson's second interview of Susan Alexander Kane.[8]:108[83] \"I kind of based the whole scene around that song,\" Welles said. \"The music is by Nat Cole—it's his trio.\"[10]:56 Later—beginning with the lyrics, \"It can't be love\"—\"In a Mizz\" is performed at the Everglades picnic, framing the fight in the tent between Susan and Kane.[8]:108 Musicians including bandleader Cee Pee Johnson (drums), Alton Redd (vocals), Raymond Tate (trumpet), Buddy Collette (alto sax) and Buddy Banks (tenor sax) are featured.[84]All of the music used in the newsreel came from the RKO music library, edited at Welles's request by the newsreel department to achieve what Herrmann called \"their own crazy way of cutting\". The News on the March theme that accompanies the newsreel titles is \"Belgian March\" by Anthony Collins, from the film Nurse Edith Cavell. Other examples are an excerpt from Alfred Newman's score for Gunga Din (the exploration of Xanadu), Roy Webb's theme for the film Reno (the growth of Kane's empire), and bits of Webb's score for Five Came Back (introducing Walter Parks Thatcher).[78]:79[83]One of the editing techniques used in Citizen Kane was the use of montage to collapse time and space, using an episodic sequence on the same set while the characters changed costume and make-up between cuts so that the scene following each cut would look as if it took place in the same location, but at a time long after the previous cut. In the breakfast montage, Welles chronicles the breakdown of Kane's first marriage in five vignettes that condense 16 years of story time into two minutes of screen time.[85] Welles said that the idea for the breakfast scene \"was stolen from The Long Christmas Dinner of Thornton Wilder … a one-act play, which is a long Christmas dinner that takes you through something like 60 years of a family's life.\"[10]:51 The film often uses long dissolves to signify the passage of time and its psychological effect of the characters, such as the scene in which the abandoned sled is covered with snow after the young Kane is sent away with Thatcher.[57]:90–91Welles was influenced by the editing theories of Sergei Eisenstein by using jarring cuts that caused \"sudden graphic or associative contrasts\", such as the cut from Kane's deathbed to the beginning of the News on the March sequence and a sudden shot of a shrieking bird at the beginning of Raymond's flashback.[57]:88–89 Although the film typically favors mise-en-scène over montage, the scene in which Kane goes to Susan Alexander's apartment after first meeting her is the only one that is primarily cut as close-ups with shots and counter shots between Kane and Susan.[32]:68 Fabe says that \"by using a standard Hollywood technique sparingly, [Welles] revitalizes its psychological expressiveness.\"[57]:88","citizen_kane":"Theatrical release poster","budget":"$839,727","screenplay_by":"Herman J. Mankiewicz|Orson Welles|","Rights and home media":"The composited camera negative of Citizen Kane was destroyed in a New Jersey film laboratory fire in the 1970s. Subsequent prints were derived from a master positive (a fine-grain preservation element) made in the 1940s and originally intended for use in overseas distribution.[201] Modern techniques were used to produce a pristine print for a 50th Anniversary theatrical reissue in 1991 which Paramount released for then-owner Turner Broadcasting System,[202] which earned $1.6 million in North America.[203]In 1955, RKO sold the American television rights to its film library, including Citizen Kane, to C&C Television Corp.[204] In 1960, television rights to the pre-1956 RKO library were acquired by United Artists. RKO kept the non-broadcast television rights to its library.[205]In 1976, when home video was in its infancy, entrepreneur Snuff Garrett bought cassette rights to the RKO library for what United Press International termed \"a pittance.\" In 1978 The Nostalgia Merchant released the film through Media Home Entertainment. By 1980 the 800-title library of The Nostalgia Merchant was earning $2.3 million a year. \"Nobody wanted cassettes four years ago,\" Garrett told UPI. \"It wasn't the first time people called me crazy. It was a hobby with me which became big business.\"[206] RKO Home Video released the film on VHS and Betamax in 1985.[207]In 1984, The Criterion Collection released the film as its first LaserDisc. It was made from a fine grain master positive provided by the UCLA Film and Television Archive.[208] When told about the then-new concept of having an audio commentary on the disc, Welles was skeptical but said \"theoretically, that’s good for teaching movies, so long as they don’t talk nonsense.\"[36]:283 In 1992 Criterion released a new 50th Anniversary Edition LaserDisc. This version had an improved transfer and additional special features, including the documentary The Legacy of Citizen Kane and Welles's early short The Hearts of Age.[209]Turner Broadcasting System acquired broadcast television rights to the RKO library in 1986[210] and the full worldwide rights to the library in 1987.[211] The RKO Home Video unit was reorganized into Turner Home Entertainment that year.[212] In 1991 Turner released a 50th Anniversary Edition on VHS and as a collector's edition that includes the film, the documentary Reflections On Citizen Kane, Harlan Lebo's 50th anniversary album, a poster and a copy of the original script.[213] In 1996, Time Warner acquired Turner and Warner Home Video absorbed Turner Home Entertainment.[214] Today, Time Warner's Warner Bros. unit has distribution rights for the film.[215]In 2001, Warner Home Video released a 60th Anniversary Collectors Edition DVD. The two-disc DVD included feature-length commentaries by Roger Ebert and Peter Bogdanovich, as well as The Battle Over Citizen Kane. It was simultaneously released on VHS.[216] The DVD was criticized for being \"too bright, too clean; the dirt and grime had been cleared away, but so had a good deal of the texture, the depth, and the sense of film grain.\"[217]In 2003, Welles's daughter Beatrice Welles sued Turner Entertainment, claiming the Welles estate is the legal copyright holder of the film. She claimed that Welles's deal to terminate his contracts with RKO meant that Turner's copyright of the film was null and void. She also claimed that the estate of Orson Welles was owed 20% of the film's profits if her copyright claim was not upheld. In 2007 she was allowed to proceed with the lawsuit, overturning the 2004 decision in favor of Turner Entertainment on the issue of video rights.[218]In 2011, it was released on Blu-ray Disc and DVD in a 70th anniversary box set.[219] The San Francisco Chronicle called it \"the Blu-ray release of the year.\"[220] Supplements included everything available on the 2001 Warner Home Video release, as well as RKO 281 and packaging extras that include a hardcover booklet and a folio containing a reproduction of the original souvenir program, miniature lobby cards and other memorabilia.[221] The Blu-ray DVD was scanned as 4K resolution from three different 35mm prints and rectified the quality issues of the 2001 DVD.[217]In the 1980s, Citizen Kane became a catalyst in the controversy over the colorization of black-and-white films. One proponent of film colorization was Ted Turner,[222] whose Turner Entertainment Company owned the RKO library.[223] A Turner Entertainment spokesperson initially stated that Citizen Kane would not be colorized,[224] but in July 1988 Turner said, \"Citizen Kane? I'm thinking of colorizing it.\"[225] In early 1989 it was reported that two companies were producing color tests for Turner Entertainment. Criticism increased when filmmaker Henry Jaglom stated that shortly before his death Welles had implored him \"don't let Ted Turner deface my movie with his crayons.\"[226]In February 1989, Turner Entertainment president Roger Mayer announced that work to colorize the film had been stopped due to provisions in Welles's 1939 contract with RKO that \"could be read to prohibit colorization without permission of the Welles estate.\"[227] Mayer added that Welles's contract was \"quite unusual\" and \"other contracts we have checked out are not like this at all.\"[228] Turner had only colorized the final reel of the film before abandoning the project. In 1991 one minute of the colorized test footage was included in the BBC Arena documentary The Complete Citizen Kane.[t][229]The colorization controversy was a factor in the passage of the National Film Preservation Act in 1988 which created the National Film Registry the following year. ABC News anchor Peter Jennings reported that \"one major reason for doing this is to require people like the broadcaster Ted Turner, who's been adding color to some movies and re-editing others for television, to put notices on those versions saying that the movies have been altered\".[230]","Plot":"In a mansion in Xanadu, a vast palatial estate in Florida, the elderly Charles Foster Kane is on his deathbed. Holding a snow globe, he utters a word, \"Rosebud\", and dies; the globe slips from his hand and smashes on the floor. A newsreel obituary tells the life story of Kane, an enormously wealthy newspaper publisher. Kane's death becomes sensational news around the world, and the newsreel's producer tasks reporter Jerry Thompson with discovering the meaning of \"Rosebud\".Thompson sets out to interview Kane's friends and associates. He approaches Kane's second wife, Susan Alexander Kane, now an alcoholic who runs her own nightclub, but she refuses to talk to him. Thompson goes to the private archive of the late banker Walter Parks Thatcher. Through Thatcher's written memoirs, Thompson learns that Kane's childhood began in poverty in Colorado.In 1871, after a gold mine was discovered on her property, Kane's mother Mary Kane sends Charles away to live with Thatcher so that he would be properly educated. While Thatcher and Charles's parents discuss arrangements inside, the young Kane plays happily with a sled in the snow outside his parents' boarding-house and protests being sent to live with Thatcher.Years later, after gaining full control over his trust fund at the age of 25, Kane enters the newspaper business and embarks on a career of yellow journalism. He takes control of the New York Inquirer and starts publishing scandalous articles that attack Thatcher's business interests. After the stock market crash in 1929, Kane is forced to sell controlling interest of his newspaper empire to Thatcher.Back in the present, Thompson interviews Kane's personal business manager, Mr. Bernstein. Bernstein recalls how Kane hired the best journalists available to build the Inquirer's circulation. Kane rose to power by successfully manipulating public opinion regarding the Spanish–American War and marrying Emily Norton, the niece of a President of the United States.Thompson interviews Kane's estranged best friend, Jedediah Leland, in a retirement home. Leland recalls how Kane's marriage to Emily disintegrates more and more over the years, and he begins an affair with amateur singer Susan Alexander while he is running for Governor of New York. Both his wife and his political opponent discover the affair and the public scandal ends his political career. Kane marries Susan and forces her into a humiliating operatic career for which she has neither the talent nor the ambition.Back in the present, Susan now consents to an interview with Thompson, and recalls her failed opera career. Kane finally allows her to abandon her singing career after she attempts suicide. After years spent dominated by Kane and living in isolation at Xanadu, Susan leaves Kane. Kane's butler Raymond recounts that, after Susan leaves him, Kane begins violently destroying the contents of her bedroom. He suddenly calms down when he sees a snow globe and says, \"Rosebud.\"Back at Xanadu, Kane's belongings are being cataloged or discarded. Thompson concludes that he is unable to solve the mystery and that the meaning of Kane's last word will forever remain an enigma. As the film ends, the camera reveals that \"Rosebud\" is the trade name of the sled on which the eight-year-old Kane was playing on the day that he was taken from his home in Colorado. Thought to be junk by Xanadu's staff, the sled is burned in a furnace.","Themes":"In her 1992 monograph for the British Film Institute, critic Laura Mulvey explored the anti-fascist themes of Citizen Kane. The News on the March newsreel presents Kane keeping company with Hitler and other dictators while he smugly assures the public there will be no war.[86]:44 Mulvey wrote that the film reflects \"the battle between intervention and isolationism\" then being waged in the United States; the film was released six months before the attack on Pearl Harbor, while President Franklin D. Roosevelt was laboring to win public opinion for entering World War II. \"Not only was the war in Europe the burning public issue of the time,\" Mulvey wrote, \"it was of passionate personal importance to Orson Welles … In the rhetoric of Citizen Kane, the destiny of isolationism is realised in metaphor: in Kane's own fate, dying wealthy and lonely, surrounded by the detritus of European culture and history.\"[32]:15Journalist Ignacio Ramonet has cited the film as an early example of mass media manipulation of public opinion and the power that media conglomerates have on influencing the democratic process. Ramonet believes that this early example of a media mogul influencing politics is outdated and that \"today Citizen Kane would be a dwarf. He owned a few papers in one country. The forces that dominate today have integrated image with text and sound and the world is their market. There are media groups with the power of a thousand Citizen Kanes.\"[87][88] Media mogul Rupert Murdoch is sometimes labeled as a latter-day Citizen Kane.[89][90]","Reception":"To ensure that Citizen Kane's influence from Hearst's life was a secret, Welles limited access to dailies and managed the film's publicity. A December 1940 feature story in Stage magazine compared the film's narrative to Faust and made no mention of Hearst.[8]:111The film was scheduled to premiere at RKO's flagship theater Radio City Music Hall on February 14, but in early January 1941 Welles was not finished with post-production work and told RKO that it still needed its musical score.[9]:205 Writers for national magazines had early deadlines and so a rough cut was previewed for a select few on January 3, 1941[8]:111 for such magazines as Life, Look and Redbook. Gossip columnist Hedda Hopper (and Parsons' arch rival) showed up to the screening uninvited. Most of the critics at the preview said that they liked the film and gave it good advanced reviews. Hopper wrote negatively about it, calling the film a “vicious and irresponsible attack on a great man” and criticizing its corny writing and old fashioned photography.[9]:205 Friday magazine ran an article drawing point-by-point comparisons between Kane and Hearst and documented how Welles had led on Parsons, Hollywood correspondent for Hearst papers.[8]:111 Up until this Welles had been friendly with Parsons. The magazine quoted Welles as saying that he couldn’t understand why she was so nice to him and that she should “wait until the woman finds out that the picture’s about her boss.” Welles immediately denied making the statement and the editor of Friday admitted that it may be false. Welles apologized to Parsons and assured her that he had never made that remark.[9]:205Shortly after Friday's article Hearst sent Parsons an angry letter complaining that he had learned about Citizen Kane from Hopper and not her. The incident made a fool of Parsons and compelled her to start attacking Welles and the film. Parsons demanded a private screening of the film and personally threatened Schaefer on Hearst’s behalf, first with a lawsuit and then with a vague threat of consequences for everyone in Hollywood. On January 10 Parsons and two lawyers working for Hearst were given a private screening of the film.[9]:206 James G. Stewart was present at the screening and said that she walked out of the film.[39]:11 Soon after, Parsons called Schaefer and threatened RKO with a lawsuit if they released Kane.[8]:111 She also contacted the management of Radio City Music Hall and demanded that they not screen it.[9]:206 The next day, the front page headline in Daily Variety read, \"HEARST BANS RKO FROM PAPERS.\"[91] Hearst began this ban by suppressing promotion of RKO's Kitty Foyle,[66]:94 but in two weeks the ban was lifted for everything except Kane.[8]:111When Schaefer did not submit to Parsons she called other studio heads and made more threats on behalf of Hearst to expose the private lives of people throughout the entire film industry.[9]:206 Welles was threatened with an exposé about his romance with the married actress Dolores del Rio, who wanted the affair kept secret until her divorce was finalized.[9]:207 In a statement to journalists Welles denied that the film was about Hearst. Hearst began preparing an injunction against the film for libel and invasion of privacy, but Welles’s lawyer told him that he doubted Hearst would proceed due to the negative publicity and required testimony that an injunction would bring.[9]:209The Hollywood Reporter ran a front-page story on January 13 that Hearst papers were about to run a series of editorials attacking Hollywood's practice of hiring refugees and immigrants for jobs that could be done by Americans. The goal was to put pressure on the other studios to force RKO to shelve Kane.[8]:111 Many of those immigrants had fled Europe after the rise of fascism and feared losing the safe haven of the United States.[9]:209 Soon afterwards, Schaefer was approached by Nicholas Schenck, head of Metro-Goldwyn-Mayer's parent company, with an offer on the behalf of Louis B. Mayer and other Hollywood executives to RKO Pictures of $805,000 to destroy all prints of the film and burn the negative.[8]:111–112[92] Once RKO's legal team reassured Schaefer, the studio announced on January 21 that Kane would be released as scheduled, and with one of the largest promotional campaigns in the studio's history. Schaefer brought Welles to New York City for a private screening of the film with the New York corporate heads of the studios and their lawyers.[8]:112 There was no objection to its release provided that certain changes, including the removal or softening of specific references that might offend Hearst, were made.[8]:112–113 Welles agreed and cut the running time from 122 minutes to 119 minutes. The cuts satisfied the corporate lawyers.[8]:113Hearing about Citizen Kane enraged Hearst so much that he banned any advertising, reviewing, or mentioning of it in his papers, and had his journalists libel Welles.[92] Welles used Hearst's opposition as a pretext for previewing the film in several opinion-making screenings in Los Angeles, lobbying for its artistic worth against the hostile campaign that Hearst was waging.[92] A special press screening took place in early March. Henry Luce was in attendance and reportedly wanted to buy the film from RKO for $1 million to distribute it himself. The reviews for this screening were positive. A Hollywood Review headline read, \"Mr. Genius Comes Through; 'Kane' Astonishing Picture\". The Motion Picture Herald reported about the screening and Welles's intention to sue RKO. Time magazine wrote that \"The objection of Mr. Hearst, who founded a publishing empire on sensationalism, is ironic. For to most of the several hundred people who have seen the film at private screenings, Citizen Kane is the most sensational product of the U.S. movie industry.\" A second press screening occurred in April.[66]:94When Schaefer rejected Hearst's offer to suppress the film, Hearst banned every newspaper and station in his media conglomerate from reviewing—or even mentioning—the film. He also had many movie theaters ban it, and many did not show it through fear of being socially exposed by his massive newspaper empire.[93] The Oscar-nominated documentary The Battle Over Citizen Kane lays the blame for the film's relative failure squarely at the feet of Hearst. The film did decent business at the box office; it went on to be the sixth highest grossing film in its year of release, a modest success its backers found acceptable. Nevertheless, the film's commercial performance fell short of its creators' expectations.[23] Hearst's biographer David Nasaw points out that Hearst's actions were not the only reason Kane failed, however: the innovations Welles made with narrative, as well as the dark message at the heart of the film (that the pursuit of success is ultimately futile) meant that a popular audience could not appreciate its merits.[94]:572–573Hearst's attacks against Welles went beyond attempting to suppress the film. Welles said that while he was on his post-filming lecture tour a police detective approached him at a restaurant and advised him not to go back to his hotel. A 14-year-old girl had reportedly been hidden in the closet of his room, and two photographers were waiting for him to walk in. Knowing he would be jailed after the resulting publicity, Welles did not return to the hotel but waited until the train left town the following morning. \"But that wasn't Hearst,\" Welles said, \"that was a hatchet man from the local Hearst paper who thought he would advance himself by doing it.\"[10]:85–86In March 1941 Welles directed a Broadway version of Richard Wright's Native Son (and, for luck, used a \"Rosebud\" sled as a prop). Native Son received positive reviews, but Hearst-owned papers used the opportunity to attack Welles as a communist.[9]:213 The Hearst papers vociferously attacked Welles after his April 1941 radio play, \"His Honor, the Mayor\",[95] produced for The Free Company radio series on CBS.[31]:113[96]Welles described his chance encounter with Hearst in an elevator at the Fairmont Hotel on the night Citizen Kane opened in San Francisco. Hearst and Welles's father were acquaintances, so Welles introduced himself and asked Hearst if he would like to come to the opening. Hearst did not respond. \"As he was getting off at his floor, I said, 'Charles Foster Kane would have accepted.' No reply\", recalled Welles. \"And Kane would have you know. That was his style—just as he finished Jed Leland's bad review of Susan as an opera singer.\"[10]:49–50In 1945 Hearst journalist Robert Shaw wrote that the film got \"a full tide of insensate fury\" from Hearst papers, \"then it ebbed suddenly. With one brain cell working, the chief realized that such hysterical barking by the trained seals would attract too much attention to the picture. But to this day the name of Orson Welles is on the official son-of-a-bitch list of every Hearst newspaper.\"[97]:102Despite Hearst's attempts to destroy the film, since 1941 references to his life and career have usually included a reference to Citizen Kane, such as the headline 'Son of Citizen Kane Dies' for the obituary of Hearst's son.[98] In 2012 the Hearst estate agreed to screen the film at Hearst Castle in San Simeon, breaking Hearst's ban on the film.[99]Radio City Music Hall's management refused to screen Citizen Kane for its premiere. A possible factor was Parsons's threat that The American Weekly would run a defamatory story on the grandfather of major RKO stockholder Nelson Rockefeller.[8]:115 Other exhibitors feared being sued for libel by Hearst and refused to show the film.[9]:216 In March Welles threatened the RKO board of governors with a lawsuit if they did not release the film. Schaefer stood by Welles and opposed the board of governors.[9]:210 When RKO still delayed the film's release Welles offered to buy the film for $1 million and the studio finally agreed to release the film on May 1.[9]:215Schaefer managed to book a few theaters willing to show the film. Hearst papers refused to accept advertising.[8]:115 RKO's publicity advertisements for the film erroneously promoted it as a love story.[9]:217Kane opened at the RKO Palace Theatre on Broadway in New York on May 1, 1941,[3] in Chicago on May 6, and in Los Angeles on May 8.[8]:115 Welles said that at the Chicago premiere that he attended the theater was almost empty.[9]:216 It did well in cities and larger towns but fared poorly in more remote areas. RKO still had problems getting exhibitors to show the film. For example, one chain controlling more than 500 theaters got Welles's film as part of a package but refused to play it, reportedly out of fear of Hearst.[8]:117 Hearst's disruption of the film's release damaged its box office performance and, as a result, it lost $160,000 during its initial run.[100]:164[101] The film earned $23,878 during its first week in New York. By the ninth week it only made $7,279. Overall it lost money in New York, Boston, Chicago, Los Angeles, San Francisco and Washington, D.C., but made a profit in Seattle.[9]:216Citizen Kane received good reviews from several critics. New York Daily News critic Kate Cameron called it \"one of the most interesting and technically superior films that has ever come out of a Hollywood studio\".[102] New York World-Telegram critic William Boehnel said that the film was \"staggering and belongs at once among the greatest screen achievements\".[103] Time magazine wrote that \"it has found important new techniques in picture-making and story-telling.\"[9]:211 Life magazine's review said that \"few movies have ever come from Hollywood with such powerful narrative, such original technique, such exciting photography.\"[9]:211 John C. Mosher of The New Yorker called the film's style \"like fresh air\" and raved \"Something new has come to the movie world at last.\"[97]:68 Anthony Bower of The Nation called it \"brilliant\" and praised the cinematography and performances by Welles, Comingore and Cotten.[104] John O'Hara's Newsweek review called it the best picture he'd ever seen and said Welles was \"the best actor in the history of acting.\"[9]:211 Welles called O'Hara's review \"the greatest review that anybody ever had.\"[36]:100The day following the premiere of Citizen Kane, The New York Times critic Bosley Crowther wrote that \"... it comes close to being the most sensational film ever made in Hollywood.\"Count on Mr. Welles: he doesn't do things by halves. ... Upon the screen he discovered an area large enough for his expansive whims to have free play. And the consequence is that he has made a picture of tremendous and overpowering scope, not in physical extent so much as in its rapid and graphic rotation of thoughts. Mr. Welles has put upon the screen a motion picture that really moves.[105]In the UK C. A. Lejeune of The Observer called it \"The most exciting film that has come out of Hollywood in twenty-five years\"[106] and Dilys Powell of The Sunday Times said the film's style was made \"with the ease and boldness and resource of one who controls and is not controlled by his medium.\"[107]:63 Edward Tangye Lean of Horizon praised the film’s technical style, calling it \"perhaps a decade ahead of its contemporaries.\"[108][o]A few reviews were mixed. Otis Ferguson of The New Republic said it was \"the boldest free-hand stroke in major screen production since Griffith and Bitzer were running wild to unshackle the camera\", but also criticized its style, calling it a \"retrogression in film technique\" and stating that \"it holds no great place\" in film history.[110] In a rare film review, filmmaker Erich von Stroheim criticized the film's story and non-linear structure, but praised the technical style and performances, and wrote \"Whatever the truth may be about it, Citizen Kane is a great picture and will go down in screen history. More power to Welles!\"[111]Some prominent critics wrote negative reviews. In his 1941 review for Sur, Jorge Luis Borges famously called the film \"a labyrinth with no center\" and predicted that its legacy would be a film \"whose historical value is undeniable but which no one cares to see again.\"[112] The Argus Weekend Magazine critic Erle Cox called the film \"amazing\" but thought that Welles's break with Hollywood traditions was \"overdone.\"[113] Tatler's James Agate called it \"the well-intentioned, muddled, amateurish thing one expects from high-brows\"[114] and \"a quite good film which tries to run the psychological essay in harness with your detective thriller, and doesn't quite succeed.\"[115] Eileen Creelman of The New York Sun called it \"a cold picture, unemotional, a puzzle rather than a drama\".[34]:178 Other people who disliked the film were W. H. Auden[36]:98 and James Agee.[36]:99Citizen Kane received the New York Film Critics Circle Award for Best Picture.[116] The National Board of Review voted it Best Film of 1941,[117] and recognized Welles and Coulouris for their performances.[118]Citizen Kane received nine nominations at the 1941 Academy Awards:It was widely believed the film would win most of its Oscar nominations, but it received only the award for Best Writing (Original Screenplay), shared by Welles and Mankiewicz. Variety reported that block voting by screen extras deprived Citizen Kane of Academy Awards for Best Picture and Best Actor (Welles), and similar prejudices were likely to have been responsible for the film receiving no technical awards.[8]:117[120]","Pre-production":"Hollywood had shown interest in Welles as early as 1936.[6]:40 He turned down three scripts sent to him by Warner Bros. In 1937, he declined offers from David O. Selznick, who asked him to head his film company's story department, and William Wyler, who wanted him for a supporting role in Wuthering Heights. \"Although the possibility of making huge amounts of money in Hollywood greatly attracted him,\" wrote biographer Frank Brady, \"he was still totally, hopelessly, insanely in love with the theater, and it is there that he had every intention of remaining to make his mark.\"[7]:118–119, 130Following \"The War of the Worlds\" broadcast of his CBS radio series The Mercury Theatre on the Air, Welles was lured to Hollywood with a remarkable contract.[8]:1–2, 153 RKO Pictures studio head George J. Schaefer wanted to work with Welles after the notorious broadcast, believing that Welles had a gift for attracting mass attention.[9]:170 RKO was also uncharacteristically profitable and was entering into a series of independent production contracts that would add more artistically prestigious films to its roster.[8]:1–2, 153 Throughout the spring and early summer of 1939, Schaefer constantly tried to lure the reluctant Welles to Hollywood.[9]:170 Welles was in financial trouble after failure of his plays Five Kings and The Green Goddess. At first he simply wanted to spend three months in Hollywood and earn enough money to pay his debts and fund his next theatrical season.[9]:170 Welles first arrived on July 20, 1939[9]:168 and on his first tour, he called the movie studio \"the greatest electric train set a boy ever had\".[9]:174Welles signed his contract with RKO on August 21. This legendary contract stipulated that Welles would act in, direct, produce and write two films. Mercury would get $100,000 for the first film by January 1, 1940, plus 20% of profits after RKO recouped $500,000, and $125,000 for a second film by January 1, 1941, plus 20% of profits after RKO recouped $500,000. The most controversial aspect of the contract was granting Welles complete artistic control of the two films so long as RKO approved both project's stories[9]:169 and so long as the budget did not exceed $500,000.[8]:1–2, 153 RKO executives would not be allowed to see any footage until Welles chose to show it to them, and no cuts could be made to either film without Welles’s approval.[9]:169 Welles was allowed to develop the story without interference, select his own cast and crew, and have the right of final cut. Granting final cut privilege was unprecedented for a studio since it placed artistic considerations over financial investment. The contract was deeply resented in the film industry, and the Hollywood press took every opportunity to mock RKO and Welles. Schaefer remained a great supporter[8]:1–2, 153 and saw the unprecedented contract as good publicity.[9]:170 Film scholar Robert L. Carringer wrote: \"The simple fact seems to be that Schaefer believed Welles was going to pull off something really big almost as much as Welles did himself.\"[8]:1–2, 153Welles spent the first five months of his RKO contract trying to get his first project going, without success. \"They are laying bets over on the RKO lot that the Orson Welles deal will end up without Orson ever doing a picture there,\" wrote The Hollywood Reporter.[8]:15 It was agreed that Welles would film Heart of Darkness, previously adapted for The Mercury Theatre on the Air, which would be presented entirely through a first-person camera. After elaborate pre-production and a day of test shooting with a hand-held camera—unheard of at the time—the project never reached production because Welles was unable to trim $50,000 from its budget.[a][b][10]:30–31 Schaefer told Welles that the $500,000 budget could not be exceeded; revenue was declining sharply in Europe by the fall of 1939.[7]:215–216He then started work on the idea that became Citizen Kane. Knowing the script would take time to prepare, Welles suggested to RKO that while that was being done—\"so the year wouldn't be lost\"—he make a humorous political thriller. Welles proposed The Smiler with a Knife, from a novel by Cecil Day-Lewis.[10]:33–34 When that project stalled in December 1939, Welles began brainstorming other story ideas with screenwriter Herman J. Mankiewicz, who had been writing Mercury radio scripts. \"Arguing, inventing, discarding, these two powerful, headstrong, dazzlingly articulate personalities thrashed toward Kane\", wrote biographer Richard Meryman.[11]:245–246One of the long-standing controversies about Citizen Kane has been the authorship of the screenplay.[11]:237 Welles conceived the project with screenwriter Herman J. Mankiewicz, who was writing radio plays for Welles's CBS Radio series, The Campbell Playhouse.[8]:16 Mankiewicz based the original outline on the life of William Randolph Hearst, whom he knew socially and came to hate after he was exiled from Hearst's circle.[11]:231In February 1940 Welles supplied Mankiewicz with 300 pages of notes and put him under contract to write the first draft screenplay under the supervision of John Houseman, Welles's former partner in the Mercury Theatre. Welles later explained, \"I left him on his own finally, because we'd started to waste too much time haggling. So, after mutual agreements on storyline and character, Mank went off with Houseman and did his version, while I stayed in Hollywood and wrote mine.\"[10]:54 Taking these drafts, Welles drastically condensed and rearranged them, then added scenes of his own. The industry accused Welles of underplaying Mankiewicz's contribution to the script, but Welles countered the attacks by saying, \"At the end, naturally, I was the one making the picture, after all—who had to make the decisions. I used what I wanted of Mank's and, rightly or wrongly, kept what I liked of my own.\"[10]:54The terms of the contract stated that Mankiewicz was to receive no credit for his work, as he was hired as a script doctor.[12]:487 Before he signed the contract Mankiewicz was particularly advised by his agents that all credit for his work belonged to Welles and the Mercury Theatre, the \"author and creator\".[7]:236–237 As the film neared release, however, Mankiewicz began threatening Welles to get credit for the film—including threats to place full-page ads in trade papers and to get his friend Ben Hecht to write an exposé for The Saturday Evening Post. Mankiewicz also threatened to go to the Screen Writers Guild and claim full credit for writing the entire script by himself.[9]:204After lodging a protest with the Screen Writers Guild, Mankiewicz withdrew it, then vacillated. The question was resolved in January 1941 when the studio, RKO Pictures, awarded Mankiewicz credit. The guild credit form listed Welles first, Mankiewicz second. Welles's assistant Richard Wilson said that the person who circled Mankiewicz's name in pencil, then drew an arrow that put it in first place, was Welles. The official credit reads, \"Screenplay by Herman J. Mankiewicz and Orson Welles\".[11]:264–265 Mankiewicz's rancor toward Welles grew over the remaining 12 years of his life.[13]:498Questions over the authorship of the Citizen Kane screenplay were revived in 1971 by influential film critic Pauline Kael, whose controversial 50,000-word essay \"Raising Kane\" was commissioned as an introduction to the shooting script in The Citizen Kane Book,[10]:494 published in October 1971.[14] The book-length essay first appeared in February 1971, in two consecutive issues of The New Yorker magazine.[10]:494[15] In the ensuing controversy Welles was defended by colleagues, critics, biographers and scholars, but his reputation was damaged by its charges.[13]:394 The essay was later discredited and Kael's own scholarship was called into question.[16][17][18]Any question of authorship was resolved with Carringer's 1978 essay, \"The Scripts of Citizen Kane\".[19][c] Carringer studied the collection of script records—\"almost a day-to-day record of the history of the scripting\"—that was then still intact at RKO. He reviewed all seven drafts and concluded that \"the full evidence reveals that Welles's contribution to the Citizen Kane script was not only substantial but definitive.\"[19]:80","Sources":"Welles never confirmed a principal source for the character of Charles Foster Kane. Houseman wrote that Kane is a synthesis of different personalities, with Hearst's life used as the main source. Some events and details were invented,[21]:444 and Houseman and Mankiewicz also \"grafted anecdotes from other giants of journalism, including Pulitzer, Northcliffe and Mank's first boss, Herbert Bayard Swope.\"[21]:444 Welles said, \"Mr. Hearst was quite a bit like Kane, although Kane isn't really founded on Hearst in particular, many people sat for it so to speak\".[22]:78 He specifically acknowledged that aspects of Kane were drawn from the lives of two business tycoons familiar from his youth in Chicago—Samuel Insull and Harold Fowler McCormick.[d][10]:49The character of Jedediah Leland was based on drama critic Ashton Stevens, George Stevens's uncle and Welles's close boyhood friend.[10]:66 Some detail came from Mankiewicz's own experience as a drama critic in New York.[11]:77–78The assumption that the character of Susan Alexander Kane was based on Marion Davies was a major reason Hearst tried to destroy Citizen Kane.[23][e] Welles denied that the character was based on Davies,[25] whom he called \"an extraordinary woman—nothing like the character Dorothy Comingore played in the movie.\"[10]:49 He cited Insull's building of the Chicago Opera House, and McCormick's lavish promotion of the opera career of his second wife, Ganna Walska, as direct influences on the screenplay.[10]:49The character of political boss Jim W. Gettys is based on Charles F. Murphy, a leader in New York City's infamous Tammany Hall political machine.[15]:61Welles credited \"Rosebud\" to Mankiewicz.[10]:53 Biographer Richard Meryman wrote that the symbol of Mankiewicz's own damaged childhood was a treasured bicycle, stolen while he visited the public library and not replaced by his family as punishment. He regarded it as the prototype of Charles Foster Kane's sled.[11]:300 In his 2015 Welles biography, Patrick McGilligan reported that Mankiewicz himself stated that the word \"Rosebud\" was taken from the name of a famous racehorse, Old Rosebud. Mankiewicz had a bet on the horse in the 1914 Kentucky Derby, which he won, and McGilligan wrote that \"Old Rosebud symbolized his lost youth, and the break with his family\". In testimony for the Lundberg suit, Mankiewicz said, \"I had undergone psycho-analysis, and Rosebud, under circumstances slightly resembling the circumstances in [Citizen Kane], played a prominent part.\"[26] Other modern assertions that the term was a nickname Hearst used for Davies' clitoris were rejected by Houseman[27] and dismissed by Brady.[7]:287The News on the March sequence that begins the film satirizes the journalistic style of The March of Time, the news documentary and dramatization series presented in movie theaters by Time Inc.[28][29] From 1935 to 1938[30]:47 Welles was a member of the uncredited company of actors that presented the original radio version.[31]:77Houseman claimed that banker Walter P. Thatcher was loosely based on J. P. Morgan.[32]:55 Bernstein was named for Dr. Maurice Bernstein, appointed Welles's guardian;[10]:65–66 Sloane's portrayal was said to be based on Bernard Herrmann.[33] Herbert Carter, editor of The Inquirer, was named for actor Jack Carter.[34]:155","produced_by":"Orson Welles","starring":"Orson Welles|Joseph Cotten|Dorothy Comingore|Everett Sloane|Ray Collins|George Coulouris|Agnes Moorehead|Paul Stewart|Ruth Warrick|Erskine Sanford|William Alland|","music_by":"Bernard Herrmann","External links":"DatabaseOther","edited_by":"Robert Wise"}