{"apocalypto":"Theatrical release poster","country":"United States","distributed_by":"Buena Vista Pictures Distribution","Plot":"While hunting in the Mesoamerican rainforest, Jaguar Paw (Rudy Youngblood), his father Flint Sky (Morris Birdyellowhead), and their fellow tribesmen encounter a procession of refugees fleeing warfare. The group's leader explains that their lands were ravaged and they seek a new beginning. He asks for permission to pass through the jungle. Flint Sky comments to his son that the visitors were sick with fear, and urges him to never allow fear.At sunrise the next morning the tribe's village is raided by a group led by Zero Wolf (Raoul Trujillo). Huts are set on fire, many villagers are killed, including Flint Sky, and the rest of the adults are taken captive. Jaguar Paw's heavily pregnant wife Seven (Dalia Hernández) and their young son Turtle's Run (Carlos Emilio Báez) escape by hiding in a small natural pit cave that also serves as a water reservoir, but are left trapped when Jaguar Paw is captured. The raiders then lead the captives on a long forced march through the jungle, having left the children behind to fend for themselves.On the journey Cocoa Leaf (Israel Ríos), a badly wounded captive, is killed by the sadistic Middle Eye, eliciting anger from Zero Wolf, who threatens his fellow raider with death if he kills another captive without permission. As the party approach the Mayan city they encounter razed forests and failed maize crops, along with villages decimated by an unknown disease. A little girl (María Isidra Hoil) infected with the illness prophesies Zero Wolf's death and the end of the Mayan world. Once the raiders and captives reach the city the females are sold as slaves while the males are escorted to the top of a step pyramid to be sacrificed before the Mayan King (Rafael Velez) and Queen (Diana Botello).As a result of a solar eclipse and the superstitions surrounding it, Jaguar Paw and the remaining captives are spared from being sacrificed by beheading. Instead, they are ordered to be taken away and \"disposed of.\" They are offered freedom if they can avoid being killed during target practice by Zero Wolf and his men. After some tribesmen are killed, Jaguar Paw is severely injured but kills Zero Wolf's son Cut Rock (Ricardo Díaz Mendoza) and escapes back into the jungle. Zero Wolf sets off with eight comrades to chase down and kill Jaguar Paw. Back in his native jungle Jaguar Paw now has the advantage, although badly injured. Still, most of his pursuers are gradually killed off, via clever conceits and traps laid out by Jaguar Paw, until there are only two left to hunt him.The drought breaks and heavy rain begins to fall, threatening to drown Jaguar Paw's family who are still trapped in the pit cave, every escape attempt before, thwarted. At this time Seven gives birth to another son, water-birthed into the now dangerously rising water. Meanwhile, the two remaining raiders chase Jaguar Paw out of the undergrowth towards the coast. As they reach the beach, all three are stopped in their tracks as they see conquistador ships anchored off the coast and Christian Europeans making their way ashore with a cross held up. Jaguar Paw escapes while the two raiders remain seemingly mesmerized at the conquistadors' presence. Jaguar Paw returns in time to save his family from the flooded pit, overjoyed at the sight of his new baby son.Sometime later, as the reunited family look out over the water at the Spanish ships, Jaguar Paw has to decide whether to risk approaching the conquistadors or try to return to their traditional lifestyle. Seven, intrigued, questions whether they should approach them, but Jaguar Paw insists they should rather head back into the jungle. The family departs in search of a new home, heading deeper into the jungle.","language":"Mayan","Themes":"According to Mel Gibson, the Mayan setting of Apocalypto is \"merely the backdrop\" for a more universal story of exploring \"civilizations and what undermines them\".[22] The background to the events depicted is the terminal Postclassic period, immediately prior to the arrival of the Spanish, ca. 1511, which the filmmakers researched before writing. According to archaeologist Michael D. Coe,\"Maya civilization in the Central Area reached its full glory in the early eighth century, but it must have contained the seeds of its own destruction, for in the century and a half that followed, all its magnificent cities had fallen into decline and ultimately suffered abandonment. This was surely one of the most profound social and demographic catastrophes of all human history.\"[23]Coe lists \"environmental collapse\" as one of the leading causes of the fall of the great empire, alongside \"endemic warfare\", \"overpopulation\", and \"drought\". \"There is mounting evidence for massive deforestation and erosion throughout the Central Area. The Maya apocalypse, for such it was, surely had ecological roots,\" explains Coe.[24] The plight of the Postclassic Maya is thought to have replicated much of the same situations as existed centuries earlier during the collapse of the Classic period Maya.The corrosive forces of corruption are illustrated in specific scenes throughout the film. Excessive consumption can be seen in the extravagant lifestyle of the upper-class Maya, their vast wealth contrasted with the sickly, the extremely poor, and the enslaved. Environmental degradation is portrayed both in the exploitation of natural resources, such as the over-mining and farming of the land, but also through the treatment of people, families and entire tribes as resources to be harvested and sold into slavery. Political corruption is seen in the leaders' manipulation, the human sacrifice on a large scale, and the slave trade. The film shows slaves being forced to create the lime stucco cement that covered the temples, an act that some historians consider a major factor in the Maya decline. One calculation estimates that it would take five tons of jungle forestry to make one ton of quicklime. Historical consultant Richard D. Hansen explains, \"I found one pyramid in El Mirador that would have required nearly 650 hectares (1,600 acres) of every single available tree just to cover one building with lime stucco... Epic construction was happening... creating devastation on a huge scale.\"[25]The filmmakers intended this depiction of the Maya collapse to have relevance for contemporary society. The problems \"faced by the Maya are extraordinarily similar to those faced today by our own civilization,\" co-writer Safinia stated during production, \"especially when it comes to widespread environmental degradation, excessive consumption and political corruption\".[5] Gibson has stated that the film is an attempt at illustrating the parallels between a great fallen empire of the past and the great empires of today, saying \"People think that modern man is so enlightened, but we're susceptible to the same forces – and we are also capable of the same heroism and transcendence.\"[5][26] The film serves as a cultural critique – in Hansen's words, a \"social statement\" – sending the message that it is never a mistake to question our own assumptions about morality.[27] The main purpose of the movie has a lot to do with a quote from Will Durant at the very beginning of the movie \"A great civilization is not conquered from without until it has destroyed itself from within\", the fighting between tribes, and the arrival of the Conquistadors aboard the ships at the end of the movie.However, Gibson has also stated that he wanted the film to be hopeful rather than entirely negative. Gibson has defined the title as \"a new beginning or an unveiling – a revelation\"; he says \"Everything has a beginning and an end, and all civilizations have operated like that\".[28] The Greek word (ἀποκαλύπτω, apokaluptō) is in fact a verb meaning \"I uncover\", \"disclose\", or \"reveal\".[29] Gibson has also said a theme of the film is the exploration of primal fears.[28]","Reception":"Apocalypto received mixed to positive reviews from critics and as of March 2015 has a score of 65% on Rotten Tomatoes based on 196 reviews with an average rating of 6.3 out of 10. The critical consensus states \"Apocalypto is a brilliantly filmed, if mercilessly bloody, examination of a once great civilization.\"[30]Richard Roeper and guest critic Aisha Tyler on the television show Ebert & Roeper gave it \"two thumbs up\" rating.[31] Michael Medved gave Apocalypto four stars (out of four) calling the film \"an adrenaline-drenched chase movie\" and \"a visceral visual experience.\"[32]The film was released less than six months after Gibson's 2006 DUI incident, where the director made antisemitic comments to police after being stopped on suspicion of drunk driving;[33] the incident garnered Gibson much negative publicity and magnified concerns some had over alleged antisemitism in his previous film, The Passion of the Christ.[34] Several key film critics alluded to the incident in their reviews of Apocalypto: In his positive review, The New York Times A. O. Scott commented: \"say what you will about him – about his problem with booze or his problem with Jews – he is a serious filmmaker.\"[35] The Boston Globe review came to a similar conclusion, noting that \"Gibson may be a lunatic, but he's our lunatic, and while I wouldn't wish him behind the wheel of a car after happy hour or at a B'nai Brith function anytime, behind a camera is another matter.\"[36] In a negative review, Salon.com noted \"People are curious about this movie because of what might be called extra-textual reasons, because its director is an erratic and charismatic Hollywood figure who would have totally marginalized himself by now if he didn't possess a crude gift for crafting violent pop entertainment.\"[37]Apocalypto gained some passionate champions in the Hollywood community. Actor Robert Duvall called it \"maybe the best movie I've seen in 25 years\".[38][39] Director Quentin Tarantino said, \"I think it's a masterpiece. It was perhaps the best film of that year. I think it was the best artistic film of that year.\"[40] Martin Scorsese, writing about the film, called it \"a vision,\" adding, \"Many pictures today don't go into troubling areas like this, the importance of violence in the perpetuation of what's known as civilization. I admire Apocalypto for its frankness, but also for the power and artistry of the filmmaking.\"[41] Actor Edward James Olmos said, \"I was totally caught off guard. It's arguably the best movie I've seen in years. I was blown away.\"[20] In 2013, director Spike Lee put the film on his list of all-time essential films.[42]On release the film registered a wider number of viewers than Perfume and Rocky Balboa. It even displaced memorable Mexican premieres such as Titanic and Poseidon.[43] According to polls performed by the newspaper Reforma, 80% of polled Mexicans labeled the film as \"very good\" or \"good\".[43]For his role as producer and director of the film, Mel Gibson was given the Trustee Award by the First Americans in the Arts organization. Gibson was also awarded the Latino Business Association's Chairman's Visionary Award for his work on Apocalypto on November 2, 2006, at the Beverly Hilton Hotel in Los Angeles, California. At the ceremony, Gibson said that the film was a \"badge of honor for the Latino community.\"[44] Gibson also stated that Apocalypto would help dismiss the notion that \"history only began with Europeans\".[45]","box_office":"$120.7 million[2]","Distribution and marketing":"While Mel Gibson financed the film through his Icon Productions, Disney signed on to distribute Apocalypto for a fee in certain markets. The publicity for the film started with a December 2005 teaser trailer that was filmed before the start of principal photography and before Rudy Youngblood was cast as Jaguar Paw. As a joke, Gibson inserted a subliminal cameo of the bearded director in a plaid shirt with a cigarette hanging from his mouth posing next to a group of dust-covered Maya.[17] A clean-shaven Gibson also filmed a Mayan-language segment for the introduction of the 2006 Academy Awards in which he declined to host the ceremony. On September 23, 2006, Gibson pre-screened the unfinished film to two predominantly Native American audiences in the US state of Oklahoma, at the Riverwind Casino in Goldsby, owned by the Chickasaw Nation, and at Cameron University in Lawton.[18] He also did a pre-screening in Austin, Texas, on September 24 in conjunction with one of the film's stars, Rudy Youngblood.[19] In Los Angeles, Gibson screened Apocalypto and participated in a Q&A session for Latin Business Association[20] and for members of the Maya community.[21] Due to an enthusiastic response from exhibitors, Disney opened the film on more than 2,500 screens in the United States.[citation needed]","cinematography":"Dean Semler","production_company":"Touchstone Pictures Icon Productions","directed_by":"Mel Gibson","Soundtrack":"The soundtrack to Apocalypto was composed by James Horner in his third collaboration with director Mel Gibson. The soundtrack lacks a traditional orchestral score and instead features a large array of exotic instruments and vocals by Pakistani singer Rahat Fateh Ali Khan.","release_dates":"December 8, 2006 (2006-12-08)|||||","Production":"Screenwriter and co-producer Farhad Safinia first met Mel Gibson while working as an assistant during the post-production of The Passion of the Christ. Eventually, Gibson and Safinia found time to discuss \"their mutual love of movies and what excites them about moviemaking\".[3]We started to talk about what to do next, but we specifically spent a lot of time on the action-chase genre of filmmaking. Those conversations essentially grew into the skeleton of ('Apocalypto'). We wanted to update the chase genre by, in fact, not updating it with technology or machinery but stripping it down to its most intense form, which is a man running for his life, and at the same time getting back to something that matters to him.Gibson said they wanted to \"shake up the stale action-adventure genre\", which he felt was dominated by CGI, stock stories and shallow characters and to create a footchase that would \"feel like a car chase that just keeps turning the screws.\"[4]Gibson and Safinia were also interested in portraying and exploring an ancient culture as it existed before the arrival of the Europeans. Considering both the Aztecs and the Maya, they eventually chose the Maya for their high sophistication and their eventual decline.The Mayas were far more interesting to us. You can choose a civilization that is bloodthirsty, or you can show the Maya civilization that was so sophisticated with an immense knowledge of medicine, science, archaeology and engineering ... but also be able to illuminate the brutal undercurrent and ritual savagery that they practiced. It was a far more interesting world to explore why and what happened to them.The two researched ancient Maya history, reading both creation and destruction myths, including sacred texts such as the Popul Vuh.[5] In the audio commentary of the film's first DVD release, Safinia states that the old shaman's story (played by Espiridion Acosta Cache, a modern-day Maya storyteller[6]) was modified from an authentic Mesoamerican tale that was re-translated by the young Maya professor Hilario Chi Canul, a professor of Maya, into the Yucatec Maya language for the film. He also served as a dialogue coach during production. As they researched the script, Safinia and Gibson traveled to Guatemala, Costa Rica and the Yucatán peninsula to scout filming locations and visit Maya ruins.Striving for a degree of historical accuracy, the filmmakers employed a consultant, Richard D. Hansen, a specialist in the Maya and assistant professor of archaeology at Idaho State University. As director of the Mirador Basin Project, he works to preserve a large swath of the Guatemalan rain forest and its Maya ruins. Gibson has said of Hansen's involvement: \"Richard's enthusiasm for what he does is infectious. He was able to reassure us and make us feel secure that what we were writing had some authenticity as well as imagination.\"[5]Other scholars of Mesoamerican history criticized the film for what they said were numerous inaccuracies.[7][8] See further coverage on the film's questionable historical accuracy and representation of the Maya below under \"Controversy\". Numerous scholars have also risen to defend the film citing ignorance or political correctness as the primary motivator for the criticisms. A recent essay by Hansen on the film and a critical commentary on the criticisms of the film is now published.[9]Gibson decided that all the dialogue would be in the Yucatec Maya language.[10] Gibson explains: \"I think hearing a different language allows the audience to completely suspend their own reality and get drawn into the world of the film. And more importantly, this also puts the emphasis on the cinematic visuals, which are a kind of universal language of the heart.\"[5]The production team consisted of a large group of make-up artists and costume designers who worked to recreate the Maya look for the large cast. Led by Aldo Signoretti, the make-up artists daily applied the required tattoos, scarification, and earlobe extensions to all of the on-screen actors. According to advisor Richard D. Hansen, the choices in body make-up were based on both artistic license and fact: \"I spent hours and hours going through the pottery and the images looking for tattoos. The scarification and tattooing was all researched, the inlaid jade teeth are in there, the ear spools are in there. There is a little doohickey that comes down from the ear through the nose into the septum – that was entirely their artistic innovation.\"[11] An example of attention to detail is the left arm tattoo of Seven, Jaguar Paw's wife, which is a horizontal band with two dots above – the Mayan symbol for the number seven.Simon Atherton, an English armorer and weapon-maker who worked with Gibson on Braveheart, was hired to research and provide reconstructions of Maya weapons. Atherton also has a cameo as the cross-bearing Franciscan friar who appears on a Spanish ship at the end of the film.Mel Gibson wanted Apocalypto to feature sets with buildings rather than relying on computer-generated images. Most of the step pyramids seen at the Maya city were models designed by Thomas E. Sanders. Sanders explained his approach: \"We wanted to set up the Mayan world, but we were not trying to do a documentary. Visually, we wanted to go for what would have the most impact. Just as on Braveheart, you are treading the line of history and cinematography. Our job is to do a beautiful movie.\"[12]However, while many of the architectural details of Maya cities are correct,[8] they are blended from different locations and eras,[8] a decision Farhad Safinia said was made for aesthetic reasons.[13] While Apocalypto is set during the terminal post-classic period of Maya civilization, the central pyramid of the film comes from the classic period, which ended in A.D. 900,[13] such as those found in the Postclassic sites of Muyil, Coba, and others in Quintana Roo, Mexico, where later cities are built around earlier pyramids. The temples are in the shape of those of Tikal in the central lowlands classic style but decorated with the Puuc style elements of the northwest Yucatán centuries later. Richard D. Hansen comments, \"There was nothing in the post-classic period that would match the size and majesty of that pyramid in the film. But Gibson ... was trying to depict opulence, wealth, consumption of resources.\"[13] The mural in the arched walkway combined elements from the Maya codices, the Bonampak murals (over 700 years earlier than the film's setting), and the San Bartolo murals (some 1500 years earlier than the film's setting).[citation needed]Gibson filmed Apocalypto mainly in Catemaco, San Andrés Tuxtla and Paso de Ovejas in the Mexican state of Veracruz. The waterfall scene was filmed at Eyipantla Falls, located in San Andrés Tuxtla. Other filming by second-unit crews took place in El Petén, Guatemala. The film was originally slated for an August 4, 2006, release, but Touchstone Pictures delayed the release date to December 8, 2006, due to heavy rains and two hurricanes interfering with filming in Mexico. Principal photography ended in July 2006.Apocalypto was shot on high-definition digital video, using the Panavision Genesis camera.[14] During filming, Gibson and cinematographer Dean Semler employed the use of Spydercam,[15] a suspended camera system allowing shooting from atop. This equipment was used in a scene in which Jaguar Paw leaps off a waterfall.We had a Spydercam shot from the top of [the] 150-foot (46 m) waterfall, looking over an actor's shoulder and then plunging over the edge – literally in the waterfall. I thought we'd be doing it on film, but we put the Genesis [camera] up there in a light-weight water housing. The temperatures were beyond 100 degrees at [the] top, and about 60 degrees at the bottom, with the water and the mist. We shot two fifty-minute tapes without any problems – though we [did get] water in there once and fogged up.[14]A number of animals are featured in Apocalypto, including a Baird's tapir and a black jaguar. Animatronics or puppets were employed for the scenes injurious to animals.[16]","produced_by":"Mel Gibson|Bruce Davey|","starring":"Rudy Youngblood|Raoul Trujillo|Mayra Sérbulo|Dalia Hernández|Ian Uriel|Gerardo Taracena|Rodolfo Palacios|Bernardo Ruiz Juarez|Ammel Rodrigo Mendoza|Ricardo Diaz Mendoza|Israel Contreras|","running_time":"138 minutes[1]","Controversy":"William Booth of The Washington Post wrote that the film depicts the Maya as a \"super-cruel, psycho-sadistic society on the skids, a ghoulscape engaged in widespread slavery, reckless sewage treatment and bad rave dancing, with a real lust for human blood.\"[47] Gibson compared the savagery in the film to the Bush administration, telling British film magazine Hotdog, \"The fear-mongering we depict in the film reminds me of President Bush and his guys.\"[48] Just prior to its release, Apocalypto was criticized by activists in Guatemala, including Lucio Yaxon, who charged that the trailer depicts Maya as savages.[49] In her review of the film, anthropologist Traci Ardren wrote that Apocalypto was biased because \"no mention is made of the achievements in science and art, the profound spirituality and connection to agricultural cycles, or the engineering feats of Maya cities\".[50] Apocalypto also sparked a strong condemnation from art history professor Julia Guernsey, a Mesoamerican specialist, who said, \"I think it's despicable. It's offensive to Maya people. It's offensive to those of us who try to teach cultural sensitivity and alternative world views that might not match our own 21st century Western ones but are nonetheless valid [...]. I think Mel Gibson is the worst thing that's happened to indigenous populations since the arrival of the Spanish. I say that in jest, but what is scary is that people will leave the movie thinking that because the characters were speaking Mayan there is an air of authenticity [...]\".[51]Other writers felt that Gibson's film was more accurate about the Maya, since it depicts the era of decline and division that followed the civilization's peak, collapse, re-settlement, and proto-historic societal conditions. One Mexican reporter, Juan E. Pardinas, wrote that \"this historical interpretation bears some resemblances with reality [...]. Mel Gibson's characters are more similar to the Mayas of the Bonampak's murals than the ones that appear in the Mexican school textbooks.\"[52] \"The first researchers tried to make a distinction between the 'peaceful' Maya and the 'brutal' cultures of central Mexico\", David Stuart wrote in a 2003 article. \"They even tried to say human sacrifice was rare among the Maya.\" But in carvings and mural paintings, Stuart said: \"we have now found more and greater similarities between the Aztecs and Mayas.\"[53]Richard D. Hansen, who was a historical consultant on the film, stated that the impact the film will have on Maya archaeology will be beneficial: \"It is a wonderful opportunity to focus world attention on the ancient Maya and to realize the role they played in world history.\"[11] However, in an interview with The Washington Post, Hansen stated the film \"give[s] the feeling they're a sadistic lot\", and said, \"I'm a little apprehensive about how the contemporary Maya will take it.\"[47]Apocalypto has been criticized for portraying a type of human sacrifice which was more typical of the Aztecs than of the Maya. Archaeologist Lisa Lucero said, \"the classic Maya really didn't go in for mass sacrifice. That was the Aztecs.\"[13] Anthropology professor Karl Taube argued that, \"We know the Aztecs did that level of killing. Their accounts speak of 20,000.\"[54] According to the film's technical advisor, the film was meant to describe the post-classic period of the Maya when fiercer influences like the Toltecs and Aztecs arrived. According to Hansen, \"We know warfare was going on. The Postclassic center of Tulum is a walled city; these sites had to be in defensive positions. There was tremendous Aztec influence by this time. The Aztecs were clearly ruthless in their conquest and pursuit of sacrificial victims, a practice that spilled over into some of the Maya areas.\"[11] Anthropology professor Stephen Houston made the criticism that sacrifice victims were more likely to be royalty and elites rather than common forest dwellers, as shown in Apocalypto.[54] In contrast, Associate Professor William R. Fowler states that for major favors, worshippers \"offered the gods human sacrifice, usually children, slaves, or prisoners of war\".[55] Anthropology professor Karl Taube criticized the film's apparent depiction of widespread slavery, saying, \"We have no evidence of large numbers of slaves.\"[54] Another disputed scene, when Jaguar Paw and the rest of captives are used as target practice, was acknowledged by the filmmakers to be invented as a plot device for igniting the chase sequence.[13] Some anthropologists objected to the presence of a huge pit filled with rotting corpses near the fields of the Maya.[56] Hansen states that this is \"conjecture\", saying that \"all [Gibson was] trying to do there is express the horror of it\".[13]The Washington Post reported that the famous Bonampak murals were digitally altered to show a warrior holding a dripping human heart, which is not present in the original.[57]The scene where the main character is rescued from sacrifice by a total solar eclipse was seen by some as being reminiscent of a similar incident in the Tintin comic Prisoners of the Sun. In the comic, Tintin and his companions are captured by a tribe of Inca, but are spared by a solar eclipse. However, Mel Gibson and co-writer Farhad Safinia categorically denied the rumor in the DVD commentary, where Gibson pointed to the Mayan's heavy emphasis on solar eclipses and other astronomical events. A full moon is depicted over the pit cave within a day or two after the eclipse occurs, when in reality a full moon can only occur a fortnight after a new moon which is the only lunar phase possible during a solar eclipse, the full moon and the new moon being at opposite astronomical positions in the lunar cycle.According to the DVD commentary track by Mel Gibson and Farhad Safinia, the ending of the film was meant to depict the first contact between the Spaniards and Mayas that took place in 1502 during the fourth voyage of Christopher Columbus.[58]The thematic meaning of the arrival of the Europeans is a subject of disagreement. Traci Ardren wrote that the Spanish arrivals were Christian missionaries and that the film had a \"blatantly colonial message that the Mayas needed saving because they were 'rotten at the core'\". According to Ardren, the Gibson film \"replays, in glorious big-budget technicolor, an offensive and racist notion that Maya people were brutal to one another long before the arrival of Europeans and thus they deserved, in fact they needed, rescue. This same idea was used for 500 years to justify the subjugation of Maya people\".[50] On the other hand, David van Biema questions whether the Spaniards are portrayed as saviours of the Mayas, since they are depicted ominously and Jaguar Paw decides to return to the woods.[59] This view is supported by the reference of the Oracle Girl to those who would \"Scratch out the earth. Scratch you out. And end your world.\" However, recalling the opening quote to the film (\"A great civilization is not conquered from without until it has destroyed itself from within\"), professors David Stuart and Stephen Houston have written the implication is that Postclassic Mayans had become so corrupt that they were \"a civilization... that deserves to die.\"[47]In January 2007, it was reported that filmmaker Mel Gibson, his production company Icon Productions, and the film's distributor Buena Vista (Disney) were being sued by Mexican filmmaker Juan Mora Catlett, who claimed that Apocalypto used scenes and plotlines from his 1991 film Retorno a Aztlán.[60][61] Later it was reported that the Mexican director did not intend to pursue anything legally, his only concern being that his own work be given due recognition for make up design similarities between the two films.[62]","music_by":"James Horner","edited_by":"John Wright","written_by":"Mel Gibson|Farhad Safinia|","budget":"$40 million[2]"}