{"country":"India","distributed_by":"Yash Raj Films","chandni":"Theatrical release poster","Plot":"Rohit (Rishi Kapoor) meets Chandni (Sridevi) at a wedding of her relative and falls instantly in love with her. He pursues her relentlessly until she agrees to date him. Eventually they become engaged to be married. His family is very much against this because of the difference in their social status, but Rohit doesn't care. One day, Rohit calls Chandni and asks her to wait for him on the terrace of her house. As she's waiting, the afternoon's silence is broken by the roaring blades of a helicopter. Rohit appears and proceeds to shower Chandni in red rose petals from the copter. When he disappears, she is surrounded again by silence, but she has a feeling something has happened.Seconds later, Chandni hears the phone ringing and runs to answer, knowing it is Rohit. She is told that he is in the hospital. His family at the hospital greet her with stony expressions and accuse her of being the cause for Rohit's falling from the helicopter. Learning that he is paralysed on his right side, his family continues to berate her. Rohit too berates her, which is too much. Intent on erasing every memory of Rohit, Chandni moves to Bombay (now Mumbai).There she starts working for a travel agency headed by Lalit (Vinod Khanna), a handsome and charming man. He has his own heartache. He soon falls in love with Chandni and asks her to marry him. She finally agrees to his and his mother's delight. On a business trip in Switzerland, Lalit meets Rohit, who has traveled there for treatment for his paralysis and no longer needs a wheelchair. The men tell each other their stories and sing with the joy of love, not knowing they are singing about the same woman.Back in India, Rohit shows up one evening at Chandni's door. To her amazement, he stands up and does a little dance. They are keyed up with emotion and Rohit proposes to her. Chandni tells him she is committed to someone else.When Rohit becomes angry, Chandni asks him what he would have done in her place. He regretfully leaves. As Rohit and Lalit had become good friends in Switzerland, Lalit invited him to his wedding. Lalit invites Chandni to meet this new friend.Rohit and Chandni pretend to be strangers to spare Lalit. On the day of the wedding, Rohit has drunk too much and stumbles down a flight of stairs. When Chandni screams and yearns for him to be saved, Lalit realises she really loves Rohit and encourages her to go to the latter.","language":"Hindi","Critical reception":"According to iDiva, Chandni was \"more an event and less a movie. Even as it’s shooting rolled on the sets, the film was a constant subject of discussion in the press.\"[4] Chandni emerged as one of the biggest blockbusters of 1989[5] with The Hindu stating that \"the film opened to full houses and distributors had to drastically increase the number of theatres.\"'[6] It was cited by Times of India as \"one of the most watched films of Indian Cinema.\"[7] Hindustan Times featured the movie in its list of 'Yash Chopra's Greatest Hits' saying \"it was instrumental in ending the era of violence in Bollywood and bringing back the romance into Hindi films.\"The film reaffirmed Sridevi’s position as the top female star of the 1980s.[8] Describing Sridevi's performance in Chandni, Indiatimes wrote \"True to her screen-name, she was an epitome of radiance, warmth and vivacity. She effortlessly introduced us to the powerful streaks, her classic, angelic character was laden with.\"[9] The scene where she confronts Rishi Kapoor was ranked by Rediff as one of the 'Ten Best Scenes from Yash Chopra Films'.[10] While Sridevi topped the Hindustan Times list of Yash Chopra's 'Top 5 Heroines',[11] CNN-IBN ranked her no. 1 on its list of 'Yash Chopra's 10 Most Sensuous Heroines' saying that \"Yash Chopra immortalised Sridevi as the perfect Chandni.\"[12]The title role became one of the most famous characters of Hindi cinema with India Today including it in its list of 'Yash Chopra's Iconic Characters'.[13] CNN-IBN listed it among 'The Cult Characters Yash Chopra Created'[14] while NDTV featured it in its list of 'Yash Chopra's Greatest Creations' stating that the film established Sridevi \"as the nation's sweetheart\" and \"reinforced her position as the reigning actress in Bollywood.\"[15]Sridevi's iconic 'Chandni Look' revolutionized fashion in North India[4] and became synonymous with the actress,[16] with Rediff stating \"A luminous Sridevi slips into every possible design in white for a major chunk of the romance and no one complains.\"[17] Speaking about the look, Yash Chopra told film critic Rajeev Masand \"While making Chandni, I had a vision of who I wanted this girl to be. I told Sridevi that most of her costumes in the film would be in white.\"[18] The Tribune wrote \"Leena Daru scored a winner again when she created the 'Chandni Look' for Sridevi. Every street corner sold the salwar-kameez and dupatta that gave the heroine a refreshingly understated look, rarely seen on the Indian screen.\"[19] while Mid Day reported \"Leena Daru dressed Bollywood’s beauties for several years. But it was her simple white churidar and kurta with the leheriya dupatta for Sridevi in the film Chandni that gave the Southern belle an angelic image and caused the Chandni Chowk stores to hit the jackpot with thousands of copies.\"[20] BizAsia described the effect of the look saying \"Chopra never quite got over his Sridevi hangover and almost always chose to present his lead heroines in similar outfits (Juhi Chawla in ‘Darr’ (1993), Madhuri Dixit in ‘Dil To Pagal Hai’ (1997)), but none of them became half as iconic as Sridevi did after ‘Chandni.’\"[21] The 'Chandni Look' was also highlighted in the film's famous Tandav dance sequence by Sridevi where Rediff said \"the actress transformed into a mythical goddess in a white number.\"[22] Sridevi's chiffons became equally popular with Indian Express writing \"This movie made the chiffon sari a must-have in every Indian woman's wardrobe.\"[23]The music of Chandni became a multi-Platinum success[4] with Sridevi's famous dance number 'Mere Hathon Mein Nau Nau Choodiyan Hain' finding a place in the Rediff chart of 'Bollywood's Top 25 Wedding Songs.'[24] The actress also lent her voice to the film's popular title-track 'Chandni O Meri Chandni'[25] which featured among the 'Top 5 Songs' of Yash Chopra by Hindustan Times.[11] Talking about her role in Chandni, Sridevi said it was \"a lively and vibrant girl in the first half (who) becomes quiet and goes into a shell in the second half. I loved that transformation and when you have a director like Yash Chopra at the helm, you can be sure that he will make the best out of everything.\"[26]","cinematography":"Manmohan Singh","directed_by":"Yash Chopra","Music":"The music of Chandni was composed by Shiv Kumar Sharma and Hariprasad Chaurasia, known together as Shiv-Hari. The lyrics were provided by Anand Bakshi. In addition to the songs listed below, there was a recurring instrumental love melody, not part of a full song. That melody was further developed into the song \"Kabhi Main Kahoon\" for Chopra's next movie Lamhe, also scored by Shiv-Hari.The film's soundtrack was a major success in India.[citation needed] It is believed that the soundtrack brought back the musical genre, with its songs and lyrics all being critically acclaimed.[citation needed] According to Yash Raj Films, the soundtrack went four times Platinum on the day of the premiere.[citation needed] By the 25th week, it went 25 times Platinum, a new standard in the music industry.[citation needed]","release_dates":"14 September 1989 (1989-09-14)|||||","produced_by":"Yash Chopra T. Subbarami Reddy","starring":"Sridevi Rishi Kapoor Vinod Khanna","running_time":"187 minutes","music_by":"Shiv-Hari","edited_by":"Keshav Naidu","written_by":"Kamna Chandra Umesh Kalbagh Arun Kaul Sagar Sarhadi"}