{"country":"United States","distributed_by":"Warner Bros.","Plot":"Elizabeth Lane (Barbara Stanwyck) is a single food writer living in New York whose articles about her fictitious Connecticut farm and her husband and baby are admired by housewives across the country. Her publisher, Alexander Yardley (Sydney Greenstreet), is unaware of the charade and insists that Elizabeth host a Christmas dinner for returning war hero Jefferson Jones (Dennis Morgan), who lying in hospital reads all her recipes and is so fond of her, that his nurse writes a letter to the publisher. That's how Yardley got the idea. Facing a career-ending scandal for her and her editor, Dudley Beecham (Robert Shayne), she is forced to comply. In desperation, Elizabeth agrees to marry her friend John Sloan (Reginald Gardiner), who has a farm in Connecticut, even though she does not love him. She enlists the help of her friend, chef Felix Bassenak (S.Z. Sakall), who has been providing her with the recipes for her articles.At Sloan's picturesque Connecticut farm on Christmas Eve, Elizabeth meets Nora (Una O'Connor), the housemaid, and a neighbor's baby that they will pretend is their baby. Elizabeth and John plan to be married immediately by Judge Crothers (Dick Elliott), but the ceremony is interrupted when Jefferson arrives and it is love at first sight. Jefferson, in contrast to Elizabeth is trained through the children of his sister to cope with babies, so they - it's more him - give the baby a bath; after dinner they spend time together in the barn. They are falling in love, but Jefferson restrains himself because he believes that Elizabeth is married with a child.The judge returns on Christmas morning, but the ceremony is postponed a second time when a different neighbor's baby is presented instead of the one from the day before. The household is alarmed when Felix claims that the baby has swallowed his watch. After the judge leaves, Felix admits to Elizabeth that he had lied about the watch to stop the wedding. While the household attends a local dance, the baby's real mother arrives to pick up her baby. Yardley witnesses her leaving with the child, and assumes someone is kidnapping the baby. He calls the police and the newspapers. Elizabeth and Jones spend the night in jail, mistakenly charged with stealing a neighbor's horse and sleigh, and return to the farm early the next morning. Yardley chastises Elizabeth for being out all night and accuses her of neglecting her child. Elizabeth finally confesses all. Furious, Mr. Yardley fires her.Jefferson's fiancée, Mary Lee, arrives unexpectedly. Dejected, Elizabeth retires to pack her things and leave the farm. Felix learns that Mary Lee has already married someone else and must break the engagement. He entices Yardley into the kitchen with the smell of cooking kidneys. He fabricates a story about a competing magazine's attempts to hire Elizabeth, and Yardley decides to hire her back at double her salary. Felix tells Jones that he is free to pursue Elizabeth. Elizabeth's packing is interrupted, first by Yardley and then by Jones. After teasing her that he is a cad who woos married women, Jefferson reveals the truth. The couple kisses and plan to marry.","language":"English","Radio adaptation":"Christmas in Connecticut was presented on Stars in the Air March 20, 1952. The 30-minute adaptation starred Gordon MacRae and Phyllis Thaxter.[4]","box_office":"$3 million[1]","Remake":"In 1992, a remake of Christmas in Connecticut was made, starring Dyan Cannon as Elizabeth, Kris Kristofferson as Jefferson Jones, and Tony Curtis as Mr. Yardley. The made-for-TV movie, which first aired on TNT, was directed by Arnold Schwarzenegger, who also made a cameo as the man sitting in front of the media truck. In this remake, Elizabeth \"Blane\" is the hostess of her own cooking show. When her manager, Alexander Yardley, introduces her to Jefferson Jones—a forest ranger who lost his cabin in a fire—he asks her to make Jones Christmas dinner live on her show. As in the original, Elizabeth isn't as talented as she seems. This version was not as well-received as the original. As one critic wrote, \"You'll be hungry for a better movie after suffering through this film\".[2][3]","cinematography":"Carl E. Guthrie","directed_by":"Peter Godfrey","release_dates":"August 11, 1945 (1945-08-11)|||||","produced_by":"William Jacobs","starring":"Barbara Stanwyck Dennis Morgan Sydney Greenstreet","running_time":"102 minutes","christmas_in_connecticut":"One of theatrical release posters","music_by":"Frederick Hollander","edited_by":"Frank Magee","written_by":"Lionel Houser Adele Comandini Aileen Hamilton (story)"}