{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"George S. Kaufman Morrie Ryskind Uncredited: Al Boasberg Buster Keaton George Oppenheimer","story_by":"James Kevin McGuinness","Plot":"Otis B. Driftwood (Groucho), business manager for wealthy dowager Mrs. Claypool (Margaret Dumont), has stood her up and is having dinner with another woman in the very same restaurant. When she discovers him seated directly behind her, Driftwood joins Mrs. Claypool, and introduces her to Herman Gottlieb (Sig Ruman), director of the New York Opera Company, also dining at the restaurant. Driftwood has arranged for Mrs. Claypool to invest $200,000 in the opera company, allowing Gottlieb to engage Rodolfo Lassparri (Walter Woolf King), the \"greatest tenor since Caruso\".Backstage at the opera house, chorister Ricardo Baroni (Allan Jones) hires his best friend Fiorello (Chico) to be his manager. Ricardo is in love with the soprano, Rosa Castaldi (Kitty Carlisle), who is also being courted by Lassparri. Driftwood arrives and finds Lassparri attacking his dresser, Tomasso (Harpo), who knocks Lassparri unconscious by hitting him over the head with a mallet. Fiorello appears and identifies himself as the manager of the \"greatest tenor in the world\". Driftwood, mistakenly thinking Fiorello is referring to Lassparri, signs Baroni to a contract.After bidding farewell to Rosa at the pier, Ricardo, Fiorello and Tomasso stowaway on board the ocean liner to New York inside Driftwood's trunk. After Driftwood discovers them, he tries to get the three of them to leave, as he is expecting a rendezvous with Mrs. Claypool. They refuse to go until they've eaten and eventually, Driftwood's incredibly small stateroom is crowded with an assortment of people. (see Stateroom scene below)Lassparri later spots the stowaways among the immigrants on the ship and they are caught and thrown into the brig. They escape with help from Driftwood and are able to sneak into the country by assuming the identities of three famous bearded aviators,[n 1] who are traveling aboard the ship. After a welcoming reception in New York, their true identities are discovered and they hide out in Driftwood's hotel room, pursued by police sergeant Henderson (Robert Emmett O'Connor).Meanwhile, Ricardo is reunited with Rosa after climbing in the window of her hotel room. Ricardo has an altercation with Lassparri, which results in both Rosa and Driftwood being fired from the opera company by Gottlieb. The boys decide to seek revenge by sabotaging the opening night performance of Il trovatore and they abduct Lassparri, forcing Gottlieb to substitute Ricardo and Rosa in his place. The audience clearly prefers Baroni over Lassparri and the latter is booed and pelted with fruit after he attempts to return to the stage. The film ends with Driftwood and Fiorello attempting to negotiate another contract, as Rosa and Ricardo sing an encore.","language":"English","box_office":"$1,815,000[2]","directed_by":"Sam Wood","a_night_at_the_opera":"theatrical poster","Reputation and legacy":"A Night at the Opera is widely regarded as a classic and is arguably (along with Duck Soup) the Marx Brothers' most-recognized film.Contemporary reviews were positive. Andre Sennwald of The New York Times wrote, \" If \"A Night at the Opera\" is a trifle below their best, it is also considerably above the standard of laughter that has been our portion since they quit the screen. George S. Kaufman and Morrie Ryskind have given them a resounding slapstick to play with and they wield it with maniacal delight.\"[17] \"The comedy material is always good and sometimes brilliant\", reported Variety.[18] \"This should be a laugh fest with all types of audiences\", wrote Film Daily.[19] \"This is a good Marx brothers film, good as any they have done\", wrote John Mosher in The New Yorker. \"It may not be new or surprising, but it's quick and funny.\"[20]As of October 18, 2008, the film scores a 97% \"fresh\" rating at Rotten Tomatoes.[21] Internet reviews take a revisionist approach and suggest that the film is \"a very funny movie slowed down by MGM's expensive production values and idiotic songs.\"[21] Ken Hanke calls it \"hysterical, but not up to the boys’ Paramount films.\"[21] Mark Bourne concurs: \"[The Marx Brothers] still let the air out of stuffed shirts and barbecue a few sacred cows, but something got lost in all that MGMness when the screen's ultimate anti-authoritarian team starting working the Andy Hardy side of the street.\"[21]Roger Ebert admitted that, while A Night at the Opera \"contains some of their best work\", he \"fast-forward[ed] over the sappy interludes involving Kitty Carlisle and Allan Jones. In Duck Soup there are no sequences I can skip; the movie is funny from beginning to end.\"[22]Danel Griffin says: \"A Night at the Opera is funny, but this is NOT the Marx Brothers, and their earlier style is so sorely missed that the film falls flat. The main problem with A Night at the Opera is the obvious lack of the Marx Brothers’ trademark anarchy. What distinguished them in their Paramount films from all other comedians was their thumb-biting indictment of society.[23]American Film Institute Lists","release_dates":"November 15, 1935 (1935-11-15)|||||","Production":"In an interview with Richard J. Anobile in The Marx Brothers Scrapbook, Groucho said he was so appalled by an early draft of the script—which was reportedly written by Bert Kalmar and Harry Ruby—that he screamed, \"Why fuck around with second-rate talent, get Kaufman and Ryskind [to write the screenplay]!\" [6]At the suggestion of producer Irving Thalberg, the film marked a change of direction in the brothers' career. In their Paramount films, the brothers' characters were much more anarchic: they attacked anybody who was so unfortunate to cross their paths whether they deserved it or not, albeit comically. Thalberg, however, felt that this made the brothers unsympathetic, particularly to female filmgoers. So in the MGM films, the brothers were recast as more helpful characters, saving their comic attacks for the villains.Though some Marx Brothers fans were appalled at these changes, Thalberg was vindicated when the film became a solid hit. It helped that the film contained some of what fans consider to be the brothers' funniest routines. These routines were honed on stage, as the brothers performed the new material on the road before filming began.However, according to Oscar Levant, the first preview was a \"disaster\", with \"hardly a laugh\" as was the second. Thalberg and George S. Kaufman spent days in the editing room, adjusting the timing to match the rhythm of a stage performance. About nine minutes was cut from the running time, and the result was a hit.[7]","Box office":"The film grossed a total (domestic and foreign) of $1,815,000: $1,164,000 from the US and Canada and $651,000 elsewhere. It made a profit of $90,000.[2]True to its title, the film actually includes adaptations of some real opera scenes from I Pagliacci and Il trovatore, featuring the Miserere duet sung by Kitty Carlisle and Allan Jones. The opera setting also allowed MGM to add big production song numbers (which were one of this studio's specialties), such as the song Alone, with the departure of the steamship, and the song Cosi Cosa with the Italian buffet and dancing.Kitty Carlisle and Allan Jones, who were both trained in operatic singing, provided their own singing voices in the film. Walter Woolf King was a trained baritone but he portrayed a tenor in the film. His singing was dubbed by Metropolitan Opera tenor Tandy MacKenzie.The film originally was to have begun with each of the Marx Brothers taking turns roaring instead of Leo the Lion (MGM's iconic mascot); Harpo Marx was to have honked his horn. This unique opening was created, but not used in the released film because MGM studio head Louis B Mayer felt the parody would cheapen the trademark. It would turn up years later, however, in a re-release trailer for the film.[8][9]According to MGM's dialogue cutting continuity and Leonard Maltin's audio commentary on the current DVD release, the film originally began (after the opening credits) with the image of a \"boat on canal\". A superimposed title read, \"ITALY – WHERE THEY SING ALL DAY AND GO TO THE OPERA AT NIGHT\", and was followed by a musical number featuring bits and pieces from Leoncavallo's Pagliacci performed by \"everyday\" Italians: a street sweeper sings part of the prologue (\"Un nido di memorie...\") as he greets a man who then hands out opera tickets to a group of children emerging from a store; the children respond with \"la-la-la-la-la, verso un paese strano\" (from \"Stridono lassù\"); a \"captain\" comes down a set of steps, salutes a sentry, then bursts into \"Vesti la giubba\"; then, a lap dissolve into a hotel lobby, where a \"baggage man\" is rolling a trunk and crooning about \"nettare divino\" (\"divine nectar\"); a waiter joins the baggage man in song, enters the dining room, and sings as he serves a man who for a few notes also sings; the waiter then crosses the dining room to speak to Mrs. Claypool (Margaret Dumont), marking the beginning of the film in existing copies. Maltin[10] stated the scene was cut during World War II to remove references to Italy, and unfortunately, the main negative was cut as well, so the scene is now lost.[11] This notable cut, with several other small ones made at about the same time, is why the stated running time of the film (95 minutes) was three minutes longer than that of existing prints.[8]A persistent rumor concerning A Night at the Opera involves the presence of the Marx brothers' father Sam Marx (also known as \"Frenchy\") on the ship and on the dock, waving goodbye. Both Groucho and Harpo stated this as fact in their memoirs,[12][13] and Leonard Maltin repeats it in the DVD commentary. But this could not have occurred, because Sam Marx had died in 1933, during pre-production of Duck Soup, two years before A Night at the Opera was released.[9] The rumor arose because Frenchy had had such a cameo appearance in the Marx brothers' earlier Monkey Business. There is, however, a reference to the Marx brothers' mother, Minnie Marx, during the stateroom scene, in which a woman asks, \"Is my Aunt Minnie in here?\"[8]Part of the concept of casting the Marx brothers as stowaways on a ship was recycled from Monkey Business. As Groucho's and Margaret Dumont's characters are boarding the ocean liner, Dumont asks Groucho, \"Are you sure you have everything, Otis?\"; Groucho replies, \"I've never had any complaints yet.\" In two different interviews with Dick Cavett on The Dick Cavett Show – Comic Legends DVD, Groucho claimed that that exchange of dialogue was banned in a majority of states when the film was released because it was too suggestive, although the number of states varied with different tellings of the story.In 2008, a film student reported that the Hungarian National Film Archive possesses a longer print of the film.[14] While the print does not contain the opening musical number, it does contain several excised lines referencing Italy that had been cut upon the film's re-release in the 1940s. With the opening number still missing, it may be that this scene was cut after its original preview screenings during the 1930s rather than during its re-release, as previously thought. However, the discovery of the Hungarian print has not yet been independently verified, and Turner Entertainment, who owns the rights to the film, has not indicated that any restoration is forthcoming.In the scene where the three stowaways are impersonating \"the three greatest aviators in the world\", Driftwood seems to talk gibberish with the dignitaries. As a matter of fact, it is English; if played backwards, it can be heard what they are saying (\"This man is accusing you of being impostors\", etc.). It was recorded normally, then reversed and dubbed over the scene in post-production.[4]","produced_by":"Irving Thalberg","starring":"Groucho Marx Chico Marx Harpo Marx Kitty Carlisle Allan Jones Margaret Dumont","running_time":"93 minutes","Selected scenes":"This scene, one of the most famous comedy scenes of all time,[4] was developed with participation of silent comedy great Buster Keaton, who took inspiration from his own film, The Cameraman.[5]Driftwood plans a rendezvous with Mrs. Claypool in his stateroom. Then he finds out how small it is, and that he, his steamer trunk, and the bed barely fit in it. Driftwood discovers that Fiorello, Tomasso, and Riccardo Baroni have stowed away in his steamer trunk and discarded his clothes. Fiorello insists on eating (\"We getta food or we don't go\"). Driftwood calls a steward (\"I say, Stew\") and orders dinner.Driftwood: And two medium-boiled eggs. Fiorello: (inside room): And two hard-boiled eggs. Driftwood: And two hard-boiled eggs. Tomasso: (inside room): (honk) Driftwood: Make that three hard boiled eggs.This continues until Fiorello and Tomasso each have ordered about a dozen hard-boiled eggs and Driftwood has ordered about everything else—including coffee to sober up some stewed prunes. This is just a set-up for the famous \"Stateroom Scene\", in which a total of 15 people crowd into Driftwood's tiny cabin. Fiorello and Tomasso have to hide out in the room while a parade of people walk in, asking to either use the cabin, or to perform their regular duties. Crammed into this little space at the end of the scene are Driftwood, Fiorello, Tomasso, Baroni, two cleaning ladies who make up the bed, a manicurist, a ship's engineer and his fat assistant, a girl looking for her aunt, a maid (Maid: \"I come to mop up.\" Driftwood: \"You'll have to start on the ceiling.\") and four waiters with trays of food (prompting Driftwood's classic line: \"Is it my imagination, or is it getting crowded in here?\"). All of the foregoing tumble out into the hallway when Mrs. Claypool opens the door.The contract scene between Driftwood and Fiorello (\"the party of the first part ...\"):Fiorello: Hey, wait, wait. What does this say here, this thing here? Driftwood: Oh, that? Oh, that's the usual clause that's in every contract. That just says, uh, it says, uh, if any of the parties participating in this contract are shown not to be in their right mind, the entire agreement is automatically nullified. Fiorello: Well, I don't know... Driftwood: It's all right. That's, that's in every contract. That's, that's what they call a sanity clause. Fiorello: Ha-ha-ha-ha-ha! You can't fool me. There ain't no Sanity Clause!","Style change":"A Night at the Opera began a new era for the Marx Brothers' style of comedy. Whereas their previous comedies at Paramount Pictures consisted of a constant barrage of zany, free-for-all jokes sandwiched in between something resembling a plot, A Night at the Opera was calculated comedy. Producer Irving Thalberg insisted on a strong story structure, making the Brothers more sympathetic characters, interweaving their comedy with romantic plots and non-comic spectacular musical numbers. The targets of their mischief were largely confined to clear villains. Thalberg's logic was that the Marxes could get \"twice the box office with half the laughs\", believing their films would attract a wider audience.[15] Groucho himself agreed with Thalberg's rationale. In his autobiography, Groucho and Me, he wrote of the Marx Brothers' 13 films, \"Two were far above average. Some of the others were pretty good. Some were deplorable. The best two were made by Thalberg\"—a reference not only to A Night at the Opera but A Day at the Races.[16]Another idea of Thalberg's was that before filming would commence on an upcoming picture, the Marx Brothers would try out its material on the vaudeville stage, working on comic timing and learning what earned a laugh and what did not. He was keen to plant gags accordingly so the laughs could be timed correctly.[15] Interestingly enough, the famous \"stateroom\" scene was nearly eliminated because it was not getting any laughs. One evening the Marx Brothers threw away the script and ad-libbed the whole thing. As a result, a weak scene was transformed into one of their all-time classics.In A Night at the Opera, the Brothers' characters were refined. Groucho made more sense, and less trouble. Chico gained intelligence, and Harpo regressed into more of a child. The film dives straight into a plot and accompanying comedy, with every scene having a definitive beginning, middle, and end. The end consisted of a grand finale in traditional MGM musical fashion, something lacking from the Brothers' Paramount efforts.[15]Perhaps most notably, A Night at the Opera established a formula that would be used for every subsequent film the Marx Brothers made at MGM:","music_by":"Herbert Stothart","edited_by":"William LeVanway","budget":"$1,057,000[2]"}