{"distributed_by":"New Line Cinema Savoy Pictures","a_thin_line_between_love_and_hate":"Film poster","screenplay_by":"Martin Lawrence Bentley Kyle Evans Kenny Buford Kim Bass","story_by":"Martin Lawrence","Plot":"Nightclub manager Darnell Wright is a perpetual playboy and hopeless male chauvinist. He works for a nightclub called Chocolate City and aspires to be its owner. He trades VIP privileges at the club for favors from women. Though he is an expert at conning women, he sometimes worries about what his childhood sweetheart Mia (Regina King) thinks of his adventures.When the classy and elegant Brandi (Lynn Whitfield) steps out of a limousine to enter the club, Darnell feels that he's met his ultimate prize. She rejects his come-ons, which only fuels his appetite. He pursues her, showing up with flowers at her real estate office. He finally wins over Brandi, only to find out that he's really in love with Mia. But Brandi doesn't take kindly to rejection. It appears that she has borderline personality disorder and becomes an obsessed femme fatale stalking him, even taking all four wheels off his SUV to ground him from his rounds.Ending his relationship with Mia is not enough to satisfy Brandi, who finally administers Darnell's punishment for his misogyny. Darnell quickly learns the hard way that when you \"play\", you have to \"pay.\" The film ends much like the last verse of the song A Thin Line Between Love and Hate, with an injured Darnell in the hospital pondering over what happened to him and deciding to change, and a mugshot of Brandi and Darnell's voice saying \"Damn I'm truly sorry about what happened to Brandi. I hope po' baby lands on her feet, but they better make damn sure they fix that dent in her heart before they let her out\".","language":"English","box_office":"$34,746,109","cinematography":"Francis Kenny","production_company":"Jackson-McHenry Entertainment You Go Boy! Productions","directed_by":"Martin Lawrence","Soundtrack":"A soundtrack containing hip hop and R&B music was released on January 30, 1996 by Warner Bros. Records. It peaked at #22 on the Billboard 200 and #5 on the Top R&B/Hip-Hop Albums. It consisted of a blend of hip hop and R&B music. The soundtrack contained three charting singles, \"Beware of My Crew\", \"A Thin Line Between Love and Hate\" and \"Let's Stay Together\".","narrated_by":"Martin Lawrence","release_dates":"April 3, 1996","produced_by":"George Jackson Doug McHenry","starring":"Martin Lawrence Lynn Whitfield Bobby Brown Regina King","running_time":"108 minutes","Sequel":"On February 19, 2015, Lawrence uploaded a picture of the screenplay to a A Thin Line Between Love and Hate 2 to his Instagram profile. He captioned the picture writing, \"Just finished writing A Thin Line Between Love and Hate 2. Excited as a MF! #crazyderanged #comingatyou.\"[1]","music_by":"Roger Troutman","edited_by":"John Carter","budget":"$8,000,000"}