{"country":"United States","distributed_by":"20th Century Fox","Plot":"In 1936, Jack McGurn (Quaid) is a motion picture projectionist, involved in a campaign of harassment against non-union theaters in New York City. One such attack turns fatal, as one of his fellow union members starts a fire. McGurn's boss, knowing that the feelings of guilt would likely cause Jack to go to the police, urges him to leave the area. Jack moves to Los Angeles where his brother Gerry lives. Jack's role as a \"sweatshop lawyer\" strains an already-rocky relationship with Gerry who is willing to have any job, barely keeping his family afloat during the Great Depression.Taking the name McGann, Jack finds a job as a projectionist (ironically, non-union) in a movie theater run by a Japanese American family. He falls in love with Lily Kawamura, his boss' daughter. Forbidden to see one another by her Issei parents and banned from marrying by California law, the couple elopes to Seattle, where they marry and have a daughter, Mini.When World War II breaks out, Lily and their daughter are caught up in the Japanese American internment, rounded up and sent to Manzanar. Jack, away on a trip, is drafted into the United States Army with no chance to help his family prepare for their imprisonment.Finally visiting the camp, he arranges a private meeting with his wife's father, telling him that he has gone AWOL and wants to stay with them, whatever they have to go through. They are his family now and he belongs with them. The older man counsels him to return to the Army, and says that he now believes that Jack is truly in love with Lily, and a worthy husband.Returning, ready to face his punishment for desertion, he is met by FBI agents, who have identified \"McGann\" as being the McGurn wanted for his part in the arson of years before.The story is told in flashback as Lily tells the now pre-adolescent Mini (King) about the father and the life that she barely remembers, as the two of them are walking to a rural train station. The train arrives and they reunite with Jack, who has served his time in prison and finally is returning to his family.The title of the film came from a line of a poem by Russian poet Anna Akhmatova. Writer Alan Parker was unable to find the original poem and wrote his own poem before writing the script to try and say what the film would say:[1]We all dream our American dreamsWhen we're awake and when we sleep So much hope that grief belies Far beyond the lies and sighs Because dreams are free And so are we Come See the Paradise","Home video releases":"The VHS tape was released March 12, 1991. The DVD version was released June 6, 2006 and included a 2-sided disc:The film made its Blu-ray debut in November 2012.[7]","language":"English","Reception":"The film was well received, and on review aggregate Rotten Tomatoes, the rating was a 'fresh' 70%[2] Noted Chicago Sun Times critic Roger Ebert gave it 3 stars out of 4 and wrote that \"Come See the Paradise is a fable to remind us of how easily we can surrender our liberties, and how much we need them.\"[3] The film was entered into the 1990 Cannes Film Festival.[4]A 2014 study by Gabriel Rossman and Oliver Schilke, two sociologists at the University of California at Los Angeles (UCLA), identified Come See the Paradise as the most deliberate example of Oscar bait in their study of 3,000 films released since 1985. The identification is based on various elements calculated to be likely to draw Oscar nominations, including the previous nominations of Parker, the film's setting in Hollywood (including Quaid's projectionist character), and its depiction of a tragic historical event against the background of war and racism. It was only released in a few cities during the last week of that year to make it eligible for the awards. However, it was not nominated for any Oscars and failed at the box office.[5]","Soundtrack legacy":"A track from the film's score by Randy Edelman titled \"Fire in a Brooklyn Theater\" became an oft used musical cue for the trailers of other films, including those for A Few Good Men, Thirteen Days, Clear and Present Danger, Patriot Games, The Sum of All Fears, Devil In A Blue Dress, Rob Roy, and Cry, The Beloved Country.[8]","box_office":"$947,306","come_see_the_paradise":"Theatrical release poster","cinematography":"Michael Seresin","directed_by":"Alan Parker","release_dates":"December 23, 1990 (1990-12-23)|||||","produced_by":"Robert F. Colesberry Nellie Nugiel","starring":"Dennis Quaid|Tamlyn Tomita|Sab Shimono|Shizuko Hoshi|","running_time":"138 minutes","music_by":"Randy Edelman","edited_by":"Gerry Hambling","written_by":"Alan Parker","budget":"$15 million"}