{"based_on":"Du Plomb Dans La Tête  by Matz","bullet_to_the_head":"Theatrical release poster","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Alessandro Camon","Plot":"In the city of New Orleans, hitman Jimmy Bobo and his partner Louis Blanchard kill a corrupt former WDCPD policeman, Hank Greely, although Bobo leaves a prostitute, Lola, alive. Later, at a bar, Blanchard is murdered by Keegan, who also attempts to kill Bobo, but fails.Washington, D.C., Detective Taylor Kwon arrives in New Orleans to investigate his former partner's death and meets Lieutenant Lebreton, who informs him Lola confirmed Greely was assassinated. Kwon goes to the morgue, and, after seeing Blanchard's body and finding out who he is, he deduces that Blanchard and Bobo killed Greely. Meanwhile, Keegan meets with his employer, Robert Morel, and Morel's lawyer Marcus Baptiste. Baptiste reveals that Greely tried to blackmail Morel, and provided local mobster Baby Jack with a file detailing Morel's illegal operations. Keegan later kills Baby Jack and his men and retrieves the file.Kwon meets Bobo in a bar and informs him that he knows Bobo and Blanchard killed Greely. Bobo leaves, and when Kwon tries to follow him, he is attacked by corrupt cops who were ordered by Morel to prevent Kwon from further investigating about Greely. Bobo rescues Kwon and takes him to a tattoo parlor, where Bobo's estranged daughter, Lisa, treats Kwon's wounds. They later go to a massage parlor where Bobo interrogates Ronnie Earl, the middleman who hired Bobo and Blanchard on Morel's behalf. Ronnie Earl tries to kill Bobo, but Bobo manages to kill him, although his gun jams. Bobo later confronts Kwon, who admits to having tampered with Bobo's gun, nearly causing his death. Bobo and Kwon agree to work together.Bobo and Kwon kidnap Baptiste and take him to Bobo's house, where he is forced to give them a flash drive detailing Morel's plans to acquire housing projects and demolish them to build office buildings and reveals Keegan is an ex-mercenary hired to be Morel's enforcer. Afterwards, Bobo shoots him in the head. Keegan and his men trace Baptiste's cellphone to Bobo's house, but Bobo and Kwon are able to escape and detonate a bomb, killing Keegan's men. Keegan then becomes obsessed with killing Bobo.Kwon meets with Lieutenant Lebreton to ask for his help, but Lebreton tries to kill him, as he is also on Morel's payroll, but Bobo kills him and saves Kwon. Meanwhile, Keegan learns about Lisa and kidnaps her. Morel then calls Bobo and offers to trade Lisa for the flash drive. Bobo agrees, and meets with Morel in an abandoned warehouse, where he delivers the flash drive to him and rescues Lisa, while Kwon infiltrates the building to arrest Morel. Keegan becomes furious when Bobo is allowed to leave and kills Morel and his men before going after Bobo.Keegan confronts Bobo and they have an axe fight, which ends with Bobo stabbing Keegan in the throat with Blanchard's knife and Kwon shooting Keegan in the head. Kwon retrieves the flash drive and Bobo shoots him in the shoulder to make it appear as if Kwon failed to capture him. Lisa decides to stay with Kwon waiting for the police and Bobo leaves. He later meets Kwon at a bar, where Kwon tells him he did not mention Bobo's existence to the police this time, but if Bobo continues in the business, Kwon will take him down. Bobo welcomes him to try and drives off into the night.","language":"English","Reception":"Rotten Tomatoes gives the film an approval rating of 47% based on 133 reviews. The site's consensus reads: \"Bullet to the Head's unapologetically trashy thrills evoke memories of its star and director's proud cinematic pasts – but sadly, those memories are just about all it has to offer\".[13] Metacritic gives the film a score of 48/100 based on reviews from 34 critics, indicating \"mixed or average reviews\".[14] Jay Weissberg of Variety called it \"a kickass actioner driven by personality rather than plot\".[15]Sylvester Stallone was nominated for a Razzie Award for Worst Actor for his performances in this film, Escape Plan and Grudge Match, where he lost to Jaden Smith for After Earth.Bullet to the Head was Sylvester Stallone's worst opening weekend gross in 32 years, and his second-lowest opening weekend gross of all time.[16][17] Bullet to the Head made $4,458,201 for its opening weekend. As of March 24, 2013, the film has grossed $9,489,829 in the United States and $12,457,380 worldwide for a total of $21,947,209, failing to bring back its $55 million budget.[18]","box_office":"$21.9 million","cinematography":"Lloyd Ahern II","production_company":"Dark Castle Entertainment IM Global Millar Gough Ink Emjag After Dark Films","directed_by":"Walter Hill","Music":"The soundtrack album was released digitally on January 29, 2013 and in stores on February 19. The album features the film's score, consisting of 15 tracks composed by Steve Mazzaro and produced by Hans Zimmer.[19]","release_dates":"November 14, 2012 (2012-11-14) (Rome Film Festival)|February 1, 2013 (2013-02-01) (United States)||||","Production":"The film is based on Alexis Nolent's French graphic novel Du Plomb Dans La Tête (\"Lead in the Head\"), with a screenplay by Alessandro Camon under the working title \"Headshot\".[6] The producing team previously produced the film I Am Number Four. An executive attached to the film has said, \"[This movie] is exactly the type of fast-paced, universally themed project that suits our business model. Sylvester Stallone is an international icon and we're really excited to be in business with him.\"[7]Originally Wayne Kramer was attached to direct, but left the project when his vision of the film was darker than Stallone wanted.[8] Sylvester Stallone then called Walter Hill who had just had a movie fall apart six weeks before that he had been trying to do for a year.[9] Hill later recalled:When Sly and I first talked about doing it, I told him I thought if we did it as an homage to ’70s or ’80s action films – and if he got a haircut and if we played it not at some nuclear level and left a little room for humor – everything would probably work out. I mean, this is one of those plots... You know, in terms of the real world, they’re fairly preposterous. But that’s OK. That’s part of the given. As long as you don’t break the rules and contradict yourself within that sensibility, people go for the ride.... Sly and I have known each other for probably 35 years. I have always been a great admirer of Sly’s. Most directors love movie stars because they’re such fabulous tools to tell stories with. Sly is an actor but he’s a star and he’s been a star for a very long time. When he sent me this, there was a feeling on both our parts, that if this was ever going to happen – us working together – we better sit down and do it. Time is moving on.[10]Thomas Jane was originally cast for the part that would eventually go to Sung Kang. The role was recast at the insistence of producer Joel Silver, stating a need for a \"more 'ethnic' actor\" to appeal to a wider audience.[11][12] Hill stated:The real truth is these movies are all foreign driven. They need domestic releases. If the economics are right, people feel like they can be commercial in a reasonable way domestically. But they’re really foreign driven. This movie would not exist without expectation of the foreign audience being vastly greater than the domestic.[10]Hill said he wanted to have fun with the genre:We’re not breaking new ground. We’re trying to be entertaining within a format that’s familiar. There’s a kind of ice skating that goes on where you must let the audience know that you’re not taking yourself too seriously. But at the same time, the jokes are funny but the bullets are real. The jeopardy has to be real. When it gets outlandish, there needs to be no drift into parody – self-parody, maybe inevitable for old directors.[10]Hill said the film would be called a \"buddy movie\" but that he made \"anti-buddy movies:They don’t like each other. They’re not going to like each other. The most they’re going to achieve by the end is a kind of grudging respect. I’m just comfortable with that. It seems to be an inherently more dramatic situation than if they’re friendly and they get along and respect each other. Also, frankly, it gives you better avenue to work in humor. These things have to be leavened with humor. It actually reinforces the action.[10]Bullet to the Head was shot in New Orleans and started filming on June 27, 2011.[7] Hill:One of the things I like about New Orleans is it feels like you’re in a western with the architecture. All the balconies, the old buildings, it feels like you’re in the 1880s. Some of it spills into the movie. I don’t know how much of it creeps into the edges and helps you or how much of it is just by design. Usually you’re trying to tell a narrative through your characters and have all this stuff bleed in around the edges.[9]Hill said he told Stallone \"to play things more casually. I wanted him to play his natural personality as much as possible. He’s a very engaging guy. I told him, “I’m not interested in you inventing a character as much as imagining yourself as character.” He went right with that.\"[10]On August 23, 2011, it was announced that the film would be released on April 13, 2012. On February 23, 2012, the release date was moved back. It was released on February 1, 2013.","produced_by":"Alexandra Milchan|Alfred Gough|Miles Millar|Kevin King-Templeton|","starring":"Sylvester Stallone|Sung Kang|Sarah Shahi|Adewale Akinnuoye-Agbaje|Christian Slater|Jason Momoa|","running_time":"92 minutes[1]","music_by":"Steve Mazzaro","edited_by":"Tim Alverson","budget":"$55 million[2][3][4]"}