{"country":"United States","distributed_by":"Warner Bros.","body_heat":"theatrical release poster","Plot":"During a particularly intense Florida heatwave, inept lawyer Ned Racine (William Hurt) begins an affair with Matty (Kathleen Turner), the wife of wealthy businessman Edmund Walker (Richard Crenna). They go to great lengths to keep their affair a secret, but Ned carelessly propositions an old school friend of Matty, Mary Ann Simpson (Kim Zimmer), thinking she was Matty. Matty soon makes it clear to Ned that she wants to leave Edmund but also wants his money, explaining that a divorce would leave her with very little due to their prenuptial agreement. Racine suggests the only option is to kill Edmund. While planning the murder, Ned consults one of his shadier clients, Teddy Lewis (Mickey Rourke), an expert on incendiary devices, who supplies him with a bomb.Racine drives to the Walker estate at night to kill Edmund. He places the body in an abandoned building in which Edmund had a business interest, and uses the incendiary device to make it look like he died during a botched arson job. Ned is contacted by Edmund's lawyer about a new will that Racine supposedly drew up on Edmund's behalf, which was witnessed by Mary Ann Simpson. The new will is so poorly prepared it is declared null and void, resulting in Matty inheriting the entire fortune. Matty later admits to Ned that she forged the will.Two of Ned's friends, assistant deputy prosecutor Peter Lowenstein (Ted Danson) and police detective Oscar Grace (J.A. Preston) begin to suspect Ned of involvement with Matty in her husband's death. The men reveal to Ned that Edmund's steel-rim glasses, which he always wore, were not on him at the time of the explosion, and are nowhere to be found. Mary Ann Simpson has also disappeared. Nervous about the will, the glasses, the suspicions of the police, and Matty's loyalty, Ned happens upon a lawyer who once sued him over a mishandled legal case. The lawyer reveals that to make amends, he recommended Ned to Matty Walker, and admits to telling her about Ned's lack of competence as a lawyer.Lowenstein warns Ned that someone kept calling his hotel room on the night of the murder but never got an answer, thereby weakening his alibi. Lewis tells Ned that a woman came to him for another incendiary device, and he showed her how to booby trap a door. Matty calls Ned to tell him the glasses are in the boathouse on the Walker estate. Ned goes to the boathouse late at night and sees a long twisted wire attached to the door. When Matty shows up, Ned confronts her at gunpoint and tells her to get the glasses. Matty walks toward the boathouse and disappears from view; the boathouse explodes. Grace finds a body that is identified as Matty Walker (née Tyler) through dental records.Now in prison, Ned tries to convince Grace that Matty is still alive, laying out for him the scenario that the woman he knew as \"Matty\" assumed the identity of Matty Tyler in order to marry Edmund and get his money. The woman Ned knew as \"Mary Ann Simpson\" discovered this and played along but was then murdered and her body left in the boathouse. Had Ned been killed by entering the boathouse, the police would have found both suspects dead, and \"Matty\" would have gotten away with the money.Remembering that Matty told him when and where she had attended high school in Illinois, Ned writes to the school asking for the yearbook. Ned finds the pictures of Mary Ann Simpson and Matty Tyler, confirming his suspicion that Mary Ann Simpson stole Matty Tyler's identity, eventually becoming Matty Walker. Below the real Matty's picture is the nickname \"Smoocher\" and \"Ambition—To Graduate\"; below Mary Ann's is the nickname \"The Vamp\", swim-team membership, and \"Ambition—To be rich and live in an exotic land\".Mary Ann is last seen seated on a comfortable chair on a tropical beach. Reclining beside her is a man who speaks to her in Spanish. Lost in thought, Mary Ann turns away from him, puts on her sunglasses and faces the sun.","In popular culture":"In \"Give Me a Ring Sometime\", the first episode of Cheers, there is scene in which the barflies are playing a trivia game, debating which movie features the most body sweat. When Body Heat is mentioned, the camera cuts to Sam Malone smiling - an in-joke, as the actor playing Sam, Ted Danson, had a supporting role in Body Heat.In the Malcolm in the Middle episode \"Traffic Jam\", Hal's explanation of why they barely avoided a major accident leads Lois to reply \"And if you hadn't had rented Body Heat we would never have had Dewey\".In the song \"Frank and Lola\" written by Jimmy Buffett and Steve Goodman in 1982, Frank takes Lola \"to this movie called Body Heat\", about which Lola quips, \"the Junior Mints were mushy and the sex was neat!\"","language":"English","Critical reception":"Body Heat was a commercial success. Produced on a budget of $9 million, it grossed $24 million at the domestic box office.[2]Upon its release, Richard Corliss wrote \"Body Heat has more narrative drive, character congestion and sense of place than any original screenplay since Chinatown, yet it leaves room for some splendid young actors to breathe, to collaborate in creating the film's texture\"; it is \"full of meaty characters and pungent performances—Ted Danson as a tap-dancing prosecutor, J.A. Preston as a dogged detective, and especially Mickey Rourke as a savvy young ex-con who looks and acts as if he could be Ned's sleazier twin brother.\"[7] Variety magazine wrote \"Body Heat is an engrossing, mightily stylish meller [melodrama] in which sex and crime walk hand in hand down the path to tragedy, just like in the old days. Working in the imposing shadow of the late James M. Cain, screenwriter Lawrence Kasdan makes an impressively confident directorial debut\".[11] Roger Ebert included the film on his \"10 Best List\" for the year.[12]Janet Maslin said Body Heat was \"skillfully, though slavishly, derived\" from 1940s film noir classics; Maslin wrote \"Mr. Hurt does a wonderful job of bringing Ned to life\" but was not impressed by Miss Turner:\"[S]ex is all-important to Body Heat, as its title may indicate. And beyond that there isn't much to move the story along or to draw these characters together. A great deal of the distance between [Ned and Matty] can be attributed to the performance of Miss Turner, who looks like the quintessential forties siren, but sounds like the soap-opera actress she is. Miss Turner keeps her chin high in the air, speaks in a perfect monotone, and never seems to move from the position in which Mr. Kasdan has left her.\"[13]Pauline Kael dismissed the film, citing its \"insinuating, hotted-up dialogue that it would be fun to hoot at if only the hushed, sleepwalking manner of the film didn't make you cringe or yawn\".[14] Ebert responded to Kael's negative review:Yes, Lawrence Kasdan's Body Heat (1981) is aware of the films that inspired it—especially Billy Wilder's Double Indemnity (1944). But it has a power that transcends its sources. It exploits the personal style of its stars to insinuate itself; Kael is unfair to Turner, who in her debut role played a woman so sexually confident that we can believe her lover (William Hurt) could be dazed into doing almost anything for her. The moment we believe that, the movie stops being an exercise and starts working.[3]In a home video review for Turner Classic Movies, Glenn Erickson called it \"arguably the first conscious Neo Noir\"; he wrote \"Too often described as a quickie remake of Double Indemnity, Body Heat is more detailed in structure and more pessimistic about human nature. The noir hero for the Reagan years is ...more like the self-defeating Al Roberts of Edgar Ulmer's Detour\".[15]","box_office":"$24 million[2]","Home video":"Warner Bros. released a 25th anniversary Deluxe Edition DVD of Body Heat, including a documentary about the film by Laurent Bouzereau, a \"number of rightfully deleted scenes\",[15] and a trailer.","cinematography":"Richard H. Kline","production_company":"The Ladd Company","directed_by":"Lawrence Kasdan","Music":"In late 1980, Lawrence Kasdan met with four composers of those works he had admired, but only John Barry told him of ideas which were close to the director's own. 10 demos were recorded on March 31 and Barry wrote the whole score during April and early May 1981. The composer provided several themes and leitmotifs—the most memorable was \"Main Theme\", heard during the main titles and representing Matty.[8]Barry worked closely with recording sessions engineer Dan Wallin to mix the soundtrack album, but for several reasons J.S Lasher (who produced the limited-edition LP and CD) remixed multitracks himself without Barry's or Wallin's participation.[9]J.S Lasher's album was released several times: as a 45 RPM (Southern Cross LXSE 1.002) in 1983 and as a CD (Label X LXCD 2) in 1989. Both editions also included 'Ladd Company Logo' composed and conducted by John Williams.In 1998, Varèse Sarabande released a re-recording by Joel McNeely and the London Symphony Orchestra. This CD contains several new tracks (versus J.S Lasher's editions), but still was not complete.In August 2012, Film Score Monthly released a definitive two-disc edition: complete score with alternate, unused and source cues on disc 1 and original, Barry-authorized album and theme demos on disc 2.[10]","References":"Notes","release_dates":"August 28, 1981 (US)","Production":"Kasdan \"wanted this film to have the intricate structure of a dream, the density of a good novel, and the texture of recognizable people in extraordinary circumstances.\"[7]A substantial portion of the film was shot in east-central Palm Beach County, Florida, including downtown Lake Worth and in the oceanside enclave of Manalapan. Additional scenes were shot on Hollywood Beach, Florida, such as the scene set in a band shell.","produced_by":"Fred T. Gallo Robert Grand George Lucas (uncredited)","starring":"William Hurt Kathleen Turner Richard Crenna","running_time":"113 minutes","music_by":"John Barry","External links":"","edited_by":"Carol Littleton","written_by":"Lawrence Kasdan","budget":"$9 million[1]"}