{"Cast":"Fiona Richmond - Fiona","Release Notes":"The VHS release of the film had a reversible cover.","distributed_by":"CBS/Fox Video Ltd.","Plot":"The film begins in a high-class London restaurant named 'Bastards', staffed by the protagonist, waiter Alex (Alan Pellay). Alex is subject to the daily contempt and disgust of the upper-class customers, and is eventually fired for being obnoxious and rude to the clientele. After witnessing an act of terrorism on an embassy, he robs a benefits office and goes on the run with his new friend. Meanwhile, Nosher Powell plays the Home Secretary, a menacing, beer-swilling, fornicating, lovable lout who has his own no-nonsense way of dealing with trouble, usually with his fists. He's the darling of the voters, the press and the gorgeous Fiona (Fiona Richmond), a glamorous KGB agent. He was also the one who ended the terrorist situation that Alex witnessed earlier in the movie. However, Nosher has enemies, including the sinister Commander Fortune (Ronald Allen), who plots a people's revolution with a difference, and General Karprov (Dave Beard) and Spider (Ian Kilmister), who plot to derail the Home Secretary's campaign of becoming Prime Minister.After assembling a four-person team of would-be anarchists, Alex returns to 'Bastards' and lays waste to the clientele and staff. He begins serving them up to other rich people in their new restaurant, 'Eat the Rich'. When Commander Fortune and Spider find out about these changes to the menu, they formulate a plot to get rid of the conservative Home Secretary for good.","language":"English","Reception":"The film performed poorly at the box office, taking $200,723 across 4 screens in the USA.[2] Channel 4 were disappointed with the returns on the film and shelved another Richardson project, Five Go To Hell.[3]Critics were mixed in their opinions on the film. Hal Hinson writing in The Washington Post gave it a lukewarm review, writing \"The punk jaggedness they bring to their derivations is the only hint of originality, but this, too, seems a little staid. It feels like punk on the downward swing, after most of its rude energy has dissipated.\"[4] However Vincent Canby in The New York Times was more favourable and drew comparisons to \"an upscale John Waters satire\" and \"Jean-Luc Godard's pre-Maoist period.\"[5]In January 1988 the film was one of those attacked for its critique of Thatcherite society by Oxford University historian Norman Stone, which he condemned in the Sunday Times as being \"worthless and insulting\" and \"riddled with left wing bias\".[6]Eat The Rich featured at #49 in Time Out London's list of \"Cinema's 50 greatest flops, follies and failures.\" [7] The feature stated: \"[The film] may not have had the budget to be considered a true flop, but the back-alley production values and total lack of comic invention on display in this Thatcher-baiting misstep meant that any hopes of a Pythonesque run at the movies were knocked way back on their heels.\"","production_company":"Channel Four Films, Iron Fist Motion Pictures, Michael White Productions [1]","directed_by":"Peter Richardson","Soundtrack":"The soundtrack album was released on the Filmtrax label, and featured six tracks by Motörhead, including the track Eat the Rich, written especially for the film. The track also appeared on the Motörhead album Rock 'n' Roll, and was released in the UK as a single in its own right. It also featured a solo track, \"Bess\", by Würzel (Motörhead's second guitarist at the time).The album also featured several pieces of incidental music from the film, as well as the synthpop track Pistol In my Pocket by Alan Pillay (credited as Lannah).","release_dates":"October 1987 (UK TV premiere)","produced_by":"Tim Van Rellim","starring":"Nosher Powell Ronald Allen Nigel Planer Miranda Richardson","running_time":"90 min.","written_by":"Peter Richardson Pete Richens"}