{"based_on":"Choice Cuts  by Pierre Boileau and Thomas Narcejac","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Eric Red Norman Snider","story_by":"Patricia Herskovic Joyce Taylor","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 40% of 15 surveyed critics gave the film a positive review; the average rating was 4.4/10.[5] Variety wrote, \"What could have been a reasonably interesting thriller literally goes to pieces in last third, until the brain seems the most salient part missing.\"[6] Janet Maslin of The New York Times called it \"an intriguing sleeper\" that \"makes the mistake of opting for grisly horror effects when a less literal-minded approach would be more compelling.\"[7] Stephen Wigler of The Baltimore Sun called it a distasteful, \"so-bad-it's-almost-good film\" that is \"the best film for barbecue lovers since The Texas Chainsaw Massacre.\"[8] Peter Rainer of the Los Angeles Times wrote that the film \"isn't quite as terrible as you might imagine.\"[9] Richard Harrington of The Washington Post wrote that the film has an interesting premise but does not live up to it.[10] Time Out London called it a \"tacky but vigorous mad doctor movie\".[11] Patrick Naugle of DVD Verdict criticized the film's slow pace and poor execution.[12]","box_office":"$9,188,150[1]","cinematography":"Theo van de Sande","directed_by":"Eric Red","plot":"Bill Chrushank (Jeff Fahey) is a psychologist working with convicted killers at a prison in addition to teaching classes at a university. Ray, a convict who murdered his cellmate recently, tells Bill he can’t do anything to fix him. At home, Bill wonders to his wife (Kim Delaney) if this is true. He wants to be able to fix someone like Ray but in all his research and studies has never seen proof it’s possible. The next day, while driving to work, Bill gets in a horrific car accident where he loses his arm. At the hospital, Dr. Agatha Webb (Lindsay Duncan) convinces Bill’s wife to sign off on an experimental transplant surgery to give him a new arm from a donor they have waiting. Heavily drugged, Bill is wheeled into the operating room where he groggily notes several armed cops in hospital scrubs. The cops leave as soon as Dr. Webb removes the unknown donor’s head from his body at a nearby operating table. Bill awakens from the surgery and struggles to rehabilitate his new arm, which is covered in gruesome scars. One day, while struggling to lift a tiny weight, his arm makes a violent unexpected move upward. After this happens Bill makes a swift recovery and is released from the hospital. After some initial awkwardness between his wife with the new arm, he pleasures her with it and they make love. Just when it seems things are back to normal, Bill starts seeing flashes of horrible acts of murder (as if he is committing them). Next, he loses control of his new arm and cuts his face while shaving. Then at the prison, Ray freaks out seeing that Bill has the same tattoo on his wrist, which is only given to inmates on death row. Bill has a police friend scan his new fingerprints and is shocked to discover the arm came from convicted serial killer Charley Fletcher (John Walsh), who had murdered 20 people.Bill confronts Dr. Webb but she says his new arm can’t do anything he doesn’t want it to. Unconvinced, he follows her and finds the identities of two other patients: Mark Draper (Peter Murnik) and Remo Lacey (Brad Dourif) who received the killer’s legs and other arm, respectively. Bill visits Remo Lacey first, who was a struggling artist before the transplant but now is making a small fortune selling paintings he has made with his new arm. Bill notes that Remo’s new paintings are of the visions he has been seeing in his head, arguing he is painting what the killer saw when he murdered people. But Remo only cares about money and his newfound success and dismisses Bill’s warnings. Bill follows Mark next. While parked at a red light behind Mark, Mark’s new leg slams down on the gas pedal on its own accord, which almost kills Mark as his car drives through the red light into a busy intersection. Bill tells Mark he is having problems after the transplant as well but Mark is just happy to be able to walk again and tells Bill he should be grateful and move on with his life. But Bill is unable to, as he is becoming increasingly agitated and violent. He snaps at and has a fight with his wife, involuntarily hits his son after his son accidentally hurts his arm while wrestling, and almost strangles his wife to death while they are both sleeping. Bill is forced to move out of his house and into a hotel for the safety of his family. He demands that Dr. Webb take his arm off but she refuses, stating that the problems he is experiencing are insignificant compared to the success of her experiment. She tells him to see a psychologist and he tells her to \"go fuck [her]self.\" Feeling alone and isolated, Bill meets up with the Remo and Mark at a bar. Bill is obsessed with finding out where evil resides (the mind, the heart, the flesh?) but they eventually get him to cheer up and stop worrying about it, only to have a drunk guy who recognizes him from news about the surgery. The drunk demands to see “the arm from the TV” and Bill gets pissed and a bar fight breaks out where an enraged Bill singlehandedly takes out several patrons and almost kills another before the cops show up.Mark returns home to his apartment building and struggles to get to his room as his legs unexpectedly lock up on him. Scared, he calls Bill but gets his answering machine. Bill wakes in bed beside it just in time to catch the end of Mark’s message, where he hears Mark yell and a struggle with someone. Bill goes to Mark’s apartment and finds him dead in a pool of blood on his bed, both legs having been ripped from his torso. Bill calls the cops only to have a detective (Zakes Mokae) think he is a suspect. Bill implores the detective to check on Remo, fearing he is next, but they get to Remo’s too late. Charley — who is still alive, having his head transplanted and braced onto a new body — throws Remo out a window and rips his arm off before falling to his death. The detective tells Bill he will be safe with him but while they are stopped at a traffic light Charley pulls up in a car beside them and handcuffs his wrist to Bill. A thrilling car chase ensues as the two cars must stay together or Bill’s arm will get ripped off. Bill eventually uses the detectives gun to blast the handcuffs apart just before they hit a divider that splits the road in two. The detective stops his car and gets out and fires his gun at the escaping Charley only to have Bill steal his car to chase after him. Charley, driving wildly, crashes his car and is barely able to get the severed legs and arm out of the backseat before it explodes. Dr. Webb pulls up in her car and comforts him, revealing that Charley is her son and her diabolical plan becomes clear: she chopped up her son into pieces to keep him alive and put him back together again later (instead of letting him be executed via electric chair).Bill drives to the hospital and enters with a gun from the detective’s car. He finds an operating room where he sees the gruesome sight of Charley’s severed torso, legs and one arm in a glass case, wiggling from wires in some kind of stasis that keeps the parts alive. Dr. Webb appears and says she is ready to take his arm back now. Bill is going to shoot her but Charley knocks him out with a shotgun from behind. Bill wakes up tied to an operating table. Dr. Webb starts a circular saw to remove his arm but Bill uses the killer’s rage we have seen throughout the movie to break free of his restraints. He knocks out Dr. Webb and wrestles with Charley for his shotgun. Right before Charley can pull the trigger Bill is able to snap his neck. Bill yells and shoots the glass case of body parts with the shotgun, killing the rest of Charley’s parts. He calls the cops only to see that Charley is still alive and aiming his dropped gun at him from the floor. Bill rolls out of the way just in time and Charley accidentally shoots Dr. Webb as she is regaining consciousness. Bill grabs the shotgun and blows Charley’s head off, killing him for good.In the last scene, Bill sits with his wife in a nice park writing in his journal, where he notes that he hasn’t had any other problems with the arm since Charley was killed, and that while he does not know where evil resides he is thankful to both Dr. Webb and Charley for his new arm.","release_dates":"August 2, 1991 (1991-08-02)|||||","produced_by":"Frank Mancuso Jr.","starring":"Jeff Fahey|","running_time":"88 minutes","music_by":"Loek Dikker","Release":"Paramount pulled ads for Body Parts in Milwaukee, Wisconsin after police found dismembered bodies in Jeffrey Dahmer's apartment.[2]Body Parts was theatrically released August 2, 1991. It was first released on home video February 20, 1992[3] and later on DVD September 14, 2004.[4]","budget":"$10,000,000[citation needed]"}