{"country":"United States","distributed_by":"Magnolia Pictures","Plot":"Sandra, a manager of a fast food restaurant in the ChickWich chain, receives a phone call from someone identifying himself as Officer Daniels: he claims to be in contact with the regional manager about a customer whose purse was allegedly robbed by an employee that day. Daniels claims that he is searching the suspect's residence, but will remain on the phone while Sandra detains and searches the employee until the police can arrive. Sandra identifies Becky as the possible culprit based on the caller’s description, and the caller confirms this is the name he was given.Becky denies the theft and, at the behest of the officer, enters the restaurant office where the front counter closed-circuit camera monitors and the camera for the office are located. Another employee is brought into the office. The caller then directs that Becky's clothing pockets and purse be searched; nothing is found. Sandra is asked to strip-search Becky, being told that the alternative would be Becky going to jail while her home was searched. While Sandra is out of the room, Daniels fishes for information about her which he can use in his directing of the investigation at the restaurant.On Sandra's return the caller implies that searching of Becky's home is based on suspicion that her brother is involved in drugs, that Becky is possibly involved and the strip search is crucial. Eventually all of Becky's clothing is removed. Nothing is found; she is given an apron to cover herself. Sandra is told to put the clothing into a bag and take it to her car for later inspection by the police since sometimes they have imperceptible pockets, and traces of marijuana could be found on the clothing.Sandra insists she must resume managing the restaurant as it is busy, so Daniels directs that a male employee for \"security reasons\" stay. Kevin is brought in, and after instructions from Daniels seriously questions the caller's motives and leaves the room. Eventually Sandra's fiancé Van keeps watch and he also starts to question what is asked of him until Daniels pressures him with some implied action, since he has had a few beers before driving to the restaurant. Under further orders, Becky removes the apron and performs jumping jacks nude before Van under the pretense that contraband may be concealed in her body. Becky protests the treatment and Daniels directs Van to spank her for being disrespectful. Eventually, Becky is coerced into performing oral sex on Van. Van leaves with guilt and is replaced by the custodian, Harold, who is not fooled and becomes outraged by Daniels' requests. Harold heads out to tell Sandra about Daniels' orders, and she finally calls the regional manager to find that he has been home ill all day and has no idea about an investigation.The police escort Becky off-site and investigate the incident, finding that a similar incident had happened elsewhere. Eventually, Daniels is identified by closed circuit recordings and is apprehended while at work; he is a family man working as a telemarketer. Becky meets with an attorney to sort out the best route for a lawsuit. Sandra then is found to be unemployed and no longer seeing Van; when interviewed by a journalist, Sandra is advised by her accompanying attorney not to answer certain questions put to her.","language":"English","Reception":"The film received generally positive reviews and Dowd's performance as the manipulated restaurant manager was met with critical acclaim, earning her the National Board of Review Award for Best Supporting Actress.[6][7] The review aggregator website Rotten Tomatoes reports a 89% approval rating with an average rating of 7.5/10 based on 131 reviews. The website's consensus reads, \"Anchored by smart, sensitive direction and strong performances, Compliance is a ripped-from-the-headlines thriller that's equal parts gripping and disturbing.\"[8] On Metacritic, it has a score of 68 out of 100 based on 32 reviews, indicating \"generally favorable reviews.\"[9]At the premiere at the 2012 Sundance Film Festival, Compliance was met with controversy, as the audience's response included several walkouts and shouting matches during the film's question and answer session.[10]","box_office":"$319,285[2]","cinematography":"Adam Stone","production_company":"Dogfish Pictures","directed_by":"Craig Zobel","compliance":"Theatrical release poster","release_dates":"January 21, 2012 (2012-01-21) (Sundance)|August 17, 2012 (2012-08-17)||||","produced_by":"Craig Zobel Sophia Lin Theo Sena Lisa Muskat Tyler Davidson","starring":"Ann Dowd Dreama Walker Pat Healy","running_time":"90 minutes[1]","music_by":"Heather McIntosh","edited_by":"Jane Rizzo","Release":"Compliance premiered at the 2012 Sundance Film Festival in January.[5] The film received a limited release in the United States beginning August 17, 2012. It was released by Soda Pictures in the UK and Ireland on March 22, 2013.","written_by":"Craig Zobel"}