{"based_on":"Black Nativity  by Langston Hughes","country":"United States","distributed_by":"Fox Searchlight Pictures","screenplay_by":"Kasi Lemmons","Plot":"After his mother, Naima, is evicted from their Baltimore apartment, teenage Langston is sent to spend the holidays with his estranged grandparents in New York City. When Langston arrives in the city, he just misses his grandparents and, shortly after, is robbed of his possessions. Entering a hotel to get directions to his grandparents place, Langston is accused of trying to take a wallet and is quickly taken in by the police. While in the holding cell, he meets a man who makes fun of him for stealing wallets. Shortly after, Langston is reunited with his grandfather, the Reverend Cobbs, who takes him to his home.Langston is taken aback by the comfortable home his grandparents live in and by the fact that they know nothing about him and his mother Naima. In an attempt to bond with Langston, the Reverend shows him a pocket watch with a personalized inscription from Martin Luther King, Jr.. Langston pockets the watch that night and, in the morning, tries* to pawn it off. However, the pawnshop owner is a friend of his grandfather and refuses to buy it, telling Langston to treasure the pocket watch and return it to his grandfather. Outside the pawnbroker's shop, Langston meets the man he met in the holding cell passing out flyers for the pawnbroker who offers to procure for him whatever he wants. Langston tries to talk to his grandmother, Aretha, about why his mother left. She denies that he was the cause of the rift but says that his father was the reason behind their estrangement. Before leaving for church, Langston finds the man from the jail cell, the same man from the corner of the pawn shop, and asks him for a gun. The man then tells Langston to meet him at the same spot later at night.Despite his reluctance to attend church, Aretha and the Reverend pressure him to attend church as they are performing Langston Hughes' Black Nativity play. Langston sees the man from the pawn shop & Maria and the young man from an earlier scene. While there, Langston falls asleep and dreams that he is a part of the nativity, with Maria, a young pregnant woman he met earlier, playing the part of the virgin Mary. Waking up, Langston leaves the church to meet with the man he met in the jail cell. The man shows him the gun he wanted and Langston takes it from him and then tries to hold him up, asking him to give him a ring he spotted earlier in the display case and all the cash in the pawnbroker's cash register. Instead, the man quotes A Dream Deferred to him and reveals that he is Langston's father, Tyson. A passing police officer spots the two and enters, but Langston's father convinces him that they were only having an argument and Langston was only trying to convince him to go to church with him. The police officer then drives them to the church where they meet Naima.Inside the church with his father and mother, Langston asks his grandfather what happened between his parents. The Reverend confesses that he gave Tyson five thousand dollars to leave Naima and Langston, hoping that Naima would return to her parents. Instead, Naima found out what her father had done and left with Langston, cutting off both Tyson and her parents. Naima tries to leave with Langston, but he urges her to forgive her parents. She does, and the entire family is reunited at last.","language":"English","Reception":"Black Nativity holds a 48% approval rating on Rotten Tomatoes based on 81 reviews and an average rating of 5.6/10. The site's consensus reads: \"It's sweetly amiable and solidly performed, but Black Nativity suffers from director Kasi Lemmons' heavy-handed treatment of its celebrated source material.\" [3] On Metacritic, the film has a score of 48 out of 100, based on 29 critics, indicating \"mixed or average reviews\".[4]","box_office":"$7,454,185[2]","cinematography":"Anastas N. Michos","production_company":"Maven Pictures","directed_by":"Kasi Lemmons","black_nativity":"Theatrical release poster","release_dates":"November 27, 2013 (2013-11-27)|||||","produced_by":"William Horberg T. D. Jakes Galt Niederhoffer Celine Rattray Trudie Styler","starring":"Forest Whitaker Angela Bassett Tyrese Gibson Jennifer Hudson Mary J. Blige Vondie Curtis-Hall Nas Jacob Latimore","running_time":"93 minutes[1]","edited_by":"Terilyn A. Shropshire","budget":"$17.5 million[2]"}