{"country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Roberts Gannaway Cliff Ruby Elana Lesser Theresa Cullen","story_by":"Mark Dindal Robert Lence Brian McEntee Rick Schneider-Calabash David Womersley Kelvin Yasuda","Plot":"In 1939, Danny, an optimistic cat, dreams of Hollywood stardom, so he travels from Kokomo, Indiana to Hollywood in hopes of starting a career there. He is selected by Farley Wink to feature in a film called Little Ark Angel that is in production alongside a cat named Sawyer. Upon meeting Tillie, Cranston, Frances, and T.W., he is dismayed on learning how minor his role is and tries to weasel his way into more time in the limelight. Danny winds up angering Darla Dimple, a popular, extremely spoiled child actress and star of the film, so she assigns her Valet Max to intimidate Danny into no longer trying to enlarge his part.Danny learns from the studio's mascot Woolie the Mammoth that human actors are normally given more important roles than animals; a fact that none of them are very happy with but know they must accept. He longs for the spotlight and tries to make a plan that will encourage humans to provide animal actors with better parts — such as by assembling a massive cluster of animals and putting on a musical performance for the humans.Later, he is given advice by Darla Dimple (while masking her true villainous nature with a sweet one as she always does) through song on how to interest and satisfy audiences. Danny takes this information to heart and groups the animals for another performance in hopes of attracting the humans' attention. However, Darla, fearing that the animals are jeopardizing her spotlight, has Max help her flood Mammoth Studios while the head of Mammoth Studios, L.B. Mammoth, and the film's director Flanagan is giving an interview, getting the animals blamed and fired by L.B. Mammoth and Flanagan. The animals are depressed at being barred from acting in Mammoth Studios (especially Danny who was convinced by Darla that she was trying to help the animals). Woolie just tells Danny to go home since their plans are now over. As Danny plans to leave for home, Cranston, Frances, and T.W. blame him for ruining their plans while Tillie suggests to Sawyer to find Danny.After a comment from the bus driver and seeing Pudge wander the streets, Danny comes up with a plan for attracting the humans' attention yet again. He invites Sawyer, her friends, and Woolie to the premiere of Lil' Ark Angel. After the screening and a battle with Max that sends him flying away on a Darla Dimple balloon, Danny calls the audience's attention. Upon Sawyer, Woolie, and Tillie bringing Cranston, Frances, and T.W. backstage to help Danny, the eight animals put on a musical performance that entertains and impresses its viewers. Meanwhile, Darla attempts to sabotage the show by tampering with the set and special effects equipment, but her attempts instead cause her to inadvertently enhance the performance as well as injure herself. Maddened with frustration, she tries to ruin the show by pulling a big switch, but this sets off an enormous fireworks finale, making the animals' performance a complete success.Furious at the animals, Darla berates Danny for trying to attract the focus away from her and then unintentionally confesses to flooding Mammoth Studios and framing the animals. Darla's screaming is picked up and amplified by a nearby microphone, revealing the truth about the \"accident\" to the audience including L.B. Mammoth and Flanagan. Pudge pulls a lever, sending Darla down a trap door. Max was last seen flying by France in the runaway balloon. At last, the animals' demands for larger roles are met and their dreams are fulfilled after so long.There is a montage of film poster parodies which put the main animals in roles. It is revealed afterwards that Darla was fired from show business and is now working as a janitor for her punishment. She puts up a \"The End\" poster on a wall and it falls down and wraps around her.","language":"English","box_office":"$3.6 million[1]","production_company":"Warner Bros. Family Entertainment Turner Feature Animation","directed_by":"Mark Dindal","Home media":"Cats Don't Dance got its first home video release on VHS and Laserdisc on August 19, 1997 by Warner Home Video. While a standard 4:3 VHS, the Laserdisc was special in the fact that it remains to this day the only home video release of the film in its theatrical widescreen format in North America (the film is available on DVD in widescreen in Europe). The Laserdisc was never re-released and has become very rare. The VHS re-released for its second and final time on March 2, 1999. Home media sales improved more than its box office.The film saw its first DVD releases on August 19, 1997 and September 3, 2002, as a 4:3 pan-and-scan DVD with bonus features. The most recent release was a re-release of the same DVD, but bundled with Quest for Camelot, which was released on May 2, 2006. In July 2008, Cats Don't Dance was released on DVD in widescreen in Germany, Spain, and the Benelux countries (Belgium/the Netherlands/Luxembourg).","cats_don't_dance":"Theatrical release poster by John Alvin","release_dates":"March 26, 1997 (1997-03-26)|||||","Production":"The film was launched in 1993 as a vehicle for Michael Jackson, who would produce, star, and be a consultant in the music and choreography. It would have been a hybrid live-action/CGI film.[2] The film was ultimately made without Jackson's involvement. In its earlier stages, the film concerned less anthropomorphic stray cats that live among the sets and studio backlots. At one point, David Shire and Richard Maltby, Jr. composed songs for the film before Randy Newman was hired.[3]At that point the core team of filmmakers was assembled and it was time to begin casting the roles. As is the tradition in animation, the voice actors are videotaped as they record the voices of their characters; this enables the animators to use specific body language from each of the actors to lend dimension to their characterizations.Scott Bakula, best known to audiences as the star of the hit television series \"Quantum Leap,\" was cast as Danny. Explains Paul Gertz, \"People will be very surprised when they hear Danny and realize that it's Scott's voice doing all that singing. Scott had a successful career starring on Broadway before he began working in television and film. He's a very experienced singer and dancer, and he was a natural choice for Danny.\"Sawyer, Danny's verbal sparring partner and, eventually, his lady love, is voiced by Jasmine Guy, who became known to television viewers as snooty Whitley Gilbert on the hit series \"A Different World.\" Sawyer's singing voice is provided by recording diva Natalie Cole. \"There was something special about working with Natalie, who's a wonderful talent on her own, and whose father, Nat, was a part of Hollywood's fabulous past,\" says David Kirschner. \"Somehow I think it shows up in her interpretation of the music; there is a classic charm and romance to it.\"Other character voices were provided by such talents as George Kennedy, Hal Holbrook, Rene Auberjonois, John Rhys-Davies, Kathy Najimy, Betty Lou Gerson (the voice of the animated Cruella DeVil) and Don Knotts. \"Many of these actors have worked in animation before, and many others have done radio drama, which has trained them in using every expressive nuance in their voices,\" says Kirschner. \"We wanted each character to be an individual -- to sound as if they looked, moved and acted a certain way.\"The scheming star Darla Dimple was voiced by nine-year-old Ashley Peldon, who has herself been acting since her toddler days and is most recently seen in the acclaimed live-action drama \"The Crucible.\" The character Darla Dimple was a name parody of then child star Shirley Temple. There's a possibly they're poking fun at her last name from her film Dimples.The voice casting of the cute penguin Pudge is its own version of the classic Hollywood story, recalls Mark Dindal. \"A group of animators was eating lunch together in an outdoor cafe one day and a little boy came over to ask us for directions. Someone answered him and he walked away. At that same moment, another animator blurted, `That's Pudge exactly!,' and we all realized it was true.\"So we rushed after him and asked if he'd ever acted -- which he hadn't -- and if he'd like to -- which he would -- and the rest is moviemaking history. Little Matthew Herried became a terrific voice for Pudge.\"During production, management at Turner Feature Animation changed repeatedly and each head that came in attempted to take drastic revisions, including updating the setting to the 1950s rock-and-roll era. \"It's pretty hard to try and keep what you have finished so far, and then suddenly transition into a different period of time or introduce a different character or have a completely different ending that doesn't seem to fit the beginning you have,\" said director Mark Dindal.[3]Dindal's portrayal of Max was initially a scratch track and was never intended to be heard on the film. Dindal wanted Max to be voiced by a professional actor, but as the film started running out of money, he kept his own vocals in.[3]During the animation on Cats Don't Dance, Randy Newman was creating songs that gently poked fun at the idealism of the `30s movie hopeful while capturing the melodic, danceable sound that has made so many of those songs into classics.Production PhotoMuses Mark Dindal, \"One of the things that stuck in my mind after we spoke with people who'd been part of Hollywood's Golden Age was the number of times they described an effect or stunt that they had never done before. They said, `We just did it, and if it worked, we left it.'\"We're more analytical about film today -- we have more history to look back on, and the cost of making movies is so high that it leaves less room for experimentation. But we're still trying to push the boundaries of the possible, and some of that pioneering, risk-taking outlook is still what makes today's movies great.\"I like to think that we've kind of tipped our hats to the best of both worlds with Cats Don't Dance -- it's an homage to the past, but created with the talents of the present and the technology of the future. And the message -- giving everyone a chance to be his or her best by pursuing what they truly love -- is timeless.\"","produced_by":"Bill Bloom Timothy Campbell Paul Gertz David Kirschner","starring":"Scott Bakula Jasmine Guy Matthew Herried Ashley Peldon John Rhys-Davies Kathy Najimy Don Knotts Hal Holbrook René Auberjonois George Kennedy Mark Dindal","running_time":"75 minutes","music_by":"Steve Goldstein (score) Randy Newman (songs)","edited_by":"Dan Molina","Release":"Warner Bros. attached \"Pullet Surprise\", a newly produced Looney Tunes short featuring Foghorn Leghorn, to the original theatrical release, and \"The Big Sister\", a Dexter's Laboratory What a Cartoon! short, following the film in its original home video release.Cats Don't Dance received a 69% approval rating on Rotten Tomatoes based on 16 reviews.[4] It was the first non-Disney animated film to have won the Best Animated Feature award, and Randy Newman won the Best Individual Achievement: Music in a Feature/Home Video Production at the 1997 Annie Awards.[5]Cats Don't Dance became a casualty of the Turner/Time Warner merger: it received a traditional theatrical release in 1997 but without fanfare and did not draw an audience. The film's total domestic theatrical gross was $3,566,637 against its $32 million production budget.[1] Director Mark Dindal was frustrated with Warner over the lack of advertising and the failed marketing campaign.[3]","budget":"$32 million[1]"}