{"based_on":"Angry Video Game Nerd  by James Rolfe","country":"United States","distributed_by":"Screenwave Media","angry_video_game_nerd:_the_movie":"Theatrical release poster","Plot":"In 1983, 2 million copies of the \"worst video game of all time\", Eee Tee for the Atari 2600, are dumped into a landfill outside Alamogordo, New Mexico. In the present day, game executive Mandi (Sarah Glendening) of Cockburn Industries, Inc. proposes to her bosses creating an intentionally badly made sequel, Eee Tee 2. Thanks to the massive popularity and success of the Angry Video Game Nerd, the sales of poorly made video games has increased dramatically, and a review of Eee Tee 2 by the Nerd would cause his fans to buy the game and make profits for Cockburn.The Nerd (James Rolfe) and Cooper Folly (Jeremy Suarez) are working on the former's latest video game review. The Nerd has become increasingly disheartened over the years, as his fans continue to buy and play the video games he reviews and warns people to stay away from. On top of this, the Nerd is forced to promote and sell bad video games as part of his job at GameCops, and when he discovers marketing for Eee Tee 2, his fans encourage him to review E.T., something the Nerd has stood against for years because the game is so bad that it scarred him as a child. However, after a bad nightmare in a nightmare in a nightmare and some personal thought, the Nerd decides to go to Alamogordo to ultimately debunk the conspiracy surrounding the buried cartridges. He is accompanied by Cooper and Mandi, and the trip is completely funded by Cockburn Industries.While filming their expedition, Cooper reveals that he believes in a super-being known as Death Mwauthzyx, who has the power to collapse all of the dimensions in the universe and destroy all existence. Suddenly, the legless General Dark Onward (Stephen Mendel), thinking the trio is looking for extraterrestrials, brings along Sergeant McButter (Helena Barrett) in an attempt to capture them. In the process, Onward accidentally blows up his right arm with a grenade, giving the trio enough time to escape.The Nerd, Cooper and Mandi decide to search for the creator of Eee Tee, Howard Scott Warshaw, for answers. They instead stumble across the home of Dr. Zandor (Time Winters), who tells them that Eee Tee's level design is actually an exact map of Area 51. Dr. Zandor, a worker of Area 51 at the time, gave the code to Warshaw to help him meet the five-week deadline Atari set for Eee Tee's completion, and also to exact revenge on the government for kidnapping and holding hostage an alien he was attempting to free. The government then ordered the burial of the cartridges, supervised by General Onward himself, while Zandor escaped with the metallic material Area 51 was researching at the time in an attempt to reassemble the alien's spaceship, replacing it with identical tin foil. Dr. Zandor manages to keep the trio safe from the government for the night, but Mandi is captured by McButter while outside of the house. The Nerd and Cooper, believing she is a double agent, do not go after her.Going back to the Alamogordo site, the Nerd and Cooper discover a large crowd of fans and the head of Cockburn Industries promoting the release of Eee Tee 2 with the promise of digging out a copy of the original Eee Tee from the site itself. The Nerd tells his fans that there are no cartridges buried out there, but Howard Scott Warshaw himself appears and tells fans the opposite. Annoyed, the Nerd decides to break into Area 51. He dresses up in a cheesy alien suit and a spaceship that looks like it was put together in an hour with stuff found in a junkyard, but it works (after Cooper sends him flying off a nearby cliff, giving the illusion that the Nerd is flying, but Cooper falls off the cliff). After being captured, the Nerd is taken for examination, but they discover their \"alien\" is a fake. The Nerd subdues the doctors, and has to use one for the rectal scanner as the door lock, but, after escaping,the nerd walks into area 51 find out that it looks exactly like the game. Nerd is recaptured by General Onward. Onward attempts to force him to play E.T., but that fails, and the Nerd tells him that when Zandor escaped with the spaceship metal, he replaced it with the identical tin foil. Onward launches a missile at Mount Fuji, the basis for the Atari logo design, and while angrily leaving the room, gets his left arm cut off in the door, thus leaving him with no arms. During the launch countdown, an alien resembling the one in E.T. grabs the Nerd and pulls him to safety.The destruction of Mount Fuji releases Death Mwauthzyx, who was real all along and trapped inside the mountain. Meanwhile, Mandi manages to keep McButter away from the Nerd and Cooper's location altogether, eventually leading them to a confrontation on the Eiffel Tower in Las Vegas.The Nerd and Alien escape in a fighter jet similar to one in the NES Top Gun video game, while Alien reveals Death Mwauthzyx can collapse the dimensions and destroy all existence by completely turning the satellite dish on his head. Like Top Gun, the Nerd can't land the plane, and he and Alien just bail. Cooper is captured by Death Mwauthzyx and brought to Las Vegas, where Mandi manages to knock McButter off the Eiffel Tower to her death. Mandi is also captured by Death Mwauthzyx. The Nerd and Alien crash-land at the Alamogordo site, where a captured Dr. Zandor shouts to them that he hid Alien's spaceship metal inside the millions of E.T. game cartridges. Alien summons every single copy of the game to form the spaceship. The Nerd and Alien leave for Las Vegas to stop Death Mwauthzyx, and the armless General Onward is killed when attempting to stop them.In Las Vegas, the Nerd and Alien save Cooper and Mandi. The Nerd then fires a laser at Death Mwauthzyx's satellite dish, causing Death Mwauthzyx to fly away and disappear forever. They return to the Alamogordo site and reunite with Dr. Zandor and the Nerd's fans. Cooper and Mandi share a kiss, while the Nerd decides to finally review E.T. for his fans before Alien leaves for good (though he reviews the sequel first, declaring that while it is worse, true wretchedness was too unique to duplicate and that the original stood the test of infamy). Everyone, including Mandi, throw the copies of the sequel into the landfill and the Nerd finally reviews E.T..During the credits, the Nerd declares that E.T. is not the worst game that he has ever played, calling it cryptic and challenging as well as addicting, although it is still a bad game.","language":"English","Reception":"Angry Video Game Nerd: The Movie received generally mixed reviews from critics. The Hollywood Reporter called it an \"overly long and almost obsessively self-indulgent\" and \"aspiring cult film\" with production value which \"hovers above home-video quality by a few admirable notches\", noting that the \"filmmakers manage to capably anchor these disparate storylines to their central plot concerning crusading gamers\".[12]The Michigan Daily student newspaper of the University of Michigan gave this film a mostly negative review, describing it as unfunny, poorly edited, badly paced, and too long. This review argued that the soundtrack by Bear McCreary was good and the best aspect of the film. The reviewer noted that The Angry Video Game Nerd was \"the pioneering internet 'gamer' show\", which he had enjoyed greatly, so the film was a \"disappointing failure\".[13]","cinematography":"Jason Brewer","production_company":"Cinemassacre Productions Skinny Ugly Pilgrim","directed_by":"Kevin Finn|James Rolfe|","Soundtrack":"The film's score was composed by Bear McCreary, who had previously worked with Rolfe on the webseries Christmas special \"How The Nerd Stole Christmas\". McCreary utilized rock-and-roll music, heavy metal music, a symphonic orchestra, and synthesized elements from NES, SNES, and SEGA Genesis hardware to compose the score.[10] The album features two remixes by McCreary, as well as two songs written by his brother Brendan McCreary and performed by his band Young Beautiful in a Hurry. The album was released on the iTunes Store on September 2, 2014.[11]All music was composed by McCreary, except where otherwise noted.","release_dates":"July 21, 2014 (2014-07-21)|||||","Development":"James Rolfe had spent much of his life aspiring to be a professional feature filmmaker, and saw popularity of the AVGN web series the opportunity to fulfill this ambition.[2] Development of the film began in late 2006, following the popularity of The Angry Video Game Nerd web series, with the completion of the screenplay by 2008.[3] E.T. game designer Howard Scott Warshaw hinted in an article in GamesTM magazine that he would be playing himself in the movie.[4] Production of the film was delayed for several years due to the busy production schedule of Rolfe's AVGN web series, wherein Rolfe was continuously filming two episodes per month.The film's budget of more than US$325,000 was secured entirely via Internet crowdfunding, Indiegogo. Filming in California started April 1, 2012, and wrapped on May 11, 2012. Additional scenes were being filmed in the actors' spare time, mainly in Philadelphia. Production officially ended December 2013.Rolfe consistently utilized online articles and videos to document the movie's development and to solicit talent for casting and crew. Open casting calls were held, including one hosted by Channel Awesome held in Chicago, with live auditions held by one of the film's actors, Douglas Walker, also the actor of the Nostalgia Critic.[5] Rolfe asked for his fanbase to provide fictional webcam footage of themselves reacting to the Nerd's webseries to be used in a sequence at the beginning of the film which introduces the Angry Video Game Nerd character.[6]Using the Panasonic AG-AF100 camera,[7] James Rolfe chose to use mostly practical special effects for the film's 942 visual effects shots,[8] creating the majority by filming miniatures in front of a green screen which were then later digitally composited into the film. Though this process was more time consuming than using CGI, Rolfe believed that the use of scale models would help add to the film’s B movie feel.[9]","produced_by":"Sean Keegan","starring":"James Rolfe|Sarah Glendening|Stephen Mendel|Helena Barrett|Time Winters|Eddie Pepitone|Bobby Charles Reed|Jeremy Suarez|","running_time":"115 minutes","Sequel":"James Rolfe said in an interview with Doug Walker on his series Shut Up and Talk that he had six potential ideas for future AVGN movies and started writing one of them around New Year 2015, but decided to hold off on shooting that one for a while.[14]","music_by":"Bear McCreary","edited_by":"Paul Fontaine|Michael Licisyn|James Rolfe|","written_by":"Kevin Finn|James Rolfe|","budget":"$325,327"}