{"directed_by":"Lisa Immordino Vreeland|Bent-Jorgen Perlmutt|Frédéric Tcheng|","country":"United States","release_dates":"October 19, 2011 (2011-10-19) (TIFF Bell Lightbox)[1]|||||","produced_by":"Magnus Andersson|Ron Curtis|Jonathan Gray|Mark Lee|John Northrup|Raja Sethuraman|Lisa Immordino Vreeland|","running_time":"86 minutes","language":"English","Reception":"The film has received positive critical review. John DeFore of The Hollywood Reporter claims, “The vibrant, entertaining and of course stylish doc should enjoy a nice arthouse run before becoming an essential presence on the DVD shelves of fashionistas everywhere.”[5]Writing for Variety, Jay Weissberg says, “Few names conjure ‘style’ with the zest of Diana Vreeland, and documentary The Eye Has to Travel gets the zing just right.”[6]Currently, the film has a rating of 95% on Rotten Tomatoes, based on 63 reviews and an average score of 7.2/10.[7]","music_by":"Paul Cantelon","box_office":"$1,017,579[2]","Synopsis":"The film features recorded audio and filmed interviews of Vreeland, as well as interviews with colleagues, family, and friends of Vreeland. Beginning with an exploration of Vreeland’s childhood, the film offers a glimpse of fashionable Paris during the Belle Époque, a time when Vreeland had access to exciting and influential friends of her parents, such as ballet dancer Sergei Diaghilev. She even claimed to have ridden with Buffalo Bill Cody, though the documentary makes it clear that Vreeland would occasionally exaggerate for the sake of storytelling.The film then focuses on Diana’s move to New York City in the 1920s, where she was inspired by the dancing, jazz, and new fashions of the time, and her subsequent move to London with her husband, Reed Vreeland. Here she opened a lingerie shop, thus beginning her career in fashion. Shortly after moving back to New York when war broke out in Europe, Vreeland was asked to do a column in Harper’s Bazaar called “Why Don’t You…?” She quickly became the magazine’s fashion editor and, as such, revolutionized fashion by doing such acts as popularizing the blue jean and the bikini.Much of the documentary looks at Vreeland’s time at Vogue, where she began working after nearly two-and-a-half decades at Harper’s Bazaar. Vreeland quickly became the editor-in-chief at Vogue, making the magazine into a much-loved artistic publication. The documentary features several accounts from people who worked with Vreeland during this time, including models, photographers, and fellow editors, discussing Vreeland’s drive and her vision for the magazine.The film ends with Vreeland’s time as a consultant for the Costume Institute of the Metropolitan Museum of Art, which she became after being asked to leave Vogue in 1971, and final recollections of Vreeland and her fashion legacy.","written_by":"Lisa Immordino Vreeland|Bent-Jorgen Perlmutt|Frédéric Tcheng|","cinematography":"Cristobal Zanartu"}