{"based_on":"DuckTales  by Carl Barks","country":"France|United States|Australia|Italy|Denmark|","distributed_by":"Buena Vista Pictures","screenplay_by":"Alan Burnett","Plot":"Scrooge McDuck travels to the Middle East to inspect a recently discovered treasure chest he is certain contains the treasure of the great thief Collie Baba, accompanied by Huey, Dewey and Louie, Webby Vanderquack, and Launchpad McQuack. Although initially disappointed when the chest seems to only contain old clothes, Scrooge is excited when an ancient treasure map is found in the pocket of an old robe. Guided by the thief Dijon, they set out to find the lost treasure, not realizing that Dijon actually works for the evil sorcerer Merlock, who desires something Collie Baba owned. The group discovers Collie Baba's treasure in a sand-covered pyramid. Webby sees a lamp in the treasure, which Scrooge lets her keep since it does not hold any value.After packing up the treasure for transport, Scrooge and his group are trapped in a room full of monstrous scorpions by Merlock and Dijon, who steal the treasure. However, Merlock discovers that the lamp has been stolen; he drags Dijon with him to locate it. Scrooge and his friends manage to escape from the pyramid and, with nothing more than Webby's lamp, depart for Duckburg.Days later, the children discover the lamp holds a Genie. Ecstatic about his freedom, the Genie grants the four children 3 wishes each; to trick Scrooge, he poses as the boys' Woodchuck scout friend Gene. Their wishes include a baby elephant (which runs amok through Scrooge's mansion) and a giant ice cream sundae, among other things. Fearful of a bird flying by at night, Genie tells them about Merlock, who used his wishes for eternal life and the destruction of Atlantis and Pompeii, which were both popular vacation spots; Merlock's magic talisman, which allows him to take various animal forms, also overrides the lamp's rules, granting him unlimited wishes. Collie Baba stole the lamp from Merlock and hid it away with his treasure, and Merlock had spent the centuries since searching for it. They must prevent Merlock from obtaining the lamp or the world will suffer.The next day, Webby uses her last wish to bring all her toys to life, which forces the children to reveal the Genie's true identity to Scrooge. Wishing to impress the Archeological Society at their annual ball, Scrooge wishes for the treasure of Collie Baba, and brings the lamp and the Genie with him to the ball. He is followed by Merlock and Dijon, who violently ambush Scrooge. In the ensuing struggle, Scrooge mistakes a gravy boat for the lamp and leaves the lamp and the Genie behind, after which they both fall into the hands of Dijon, who is convinced by the Genie to keep the lamp instead of giving it to Merlock.Having wished for Scrooge's fortune, Dijon takes possession of the Money Bin and has Scrooge arrested for trespassing. However, Scrooge is immediately bailed out by Launchpad, his nephews, Webby, Mrs. Beakley and Duckworth, who agree to help Scrooge set things right. Scrooge, the nephews and Webby infiltrate the Money Bin in an attempt to steal the lamp, but are stopped by Merlock, who recovers the lamp. With the Genie under his control again, Merlock wishes for the \"disloyal swine\" Dijon to be turned into something \"fitting\" (Genie turns him into a pig), then turns the Money Bin into a fortress, which flies into the air high above Duckburg. When an indignant Scrooge threatens him, Merlock wishes him \"out of my house\", and a reluctant Genie raises the wind to send Scrooge to the edge of the fortress, hanging on for dear life. The nephews use a slingshot to knock the lamp out of Merlock's hands, tossing it to Scrooge, who loses his grip and falls towards the earth. Merlock recovers his talisman and pursues as a gryphon, grappling with Scrooge in the air. Scrooge knocks the talisman from Merlock's hand, and the sorcerer falls to his doom.Recovering the lamp, Scrooge uses his second wish to return himself, his family, and his Money Bin back to Duckburg. Back in the Money Bin, Scrooge declares that he's had \"enough of all this wishing\" and threatens to use his final wish to bury the lamp where it would never be found again. Instead, he wishes for Genie to become a real boy. Without the Genie, the lamp crumbles to dust. While the children play with their newest friend, Scrooge discovers Dijon, recovered from Merlock's wish, stuffing his trousers with his money. Scrooge chases him outside, yelling \"Somebody stop those pants!\"","language":"English","box_office":"$18.1 million[1]","directed_by":"Bob Hathcock","ducktales_the_movie:_treasure_of_the_lost_lamp":"Theatrical release poster, parodying Indiana Jones","production_companies":"Walt Disney Pictures Disney MovieToons","release_dates":"August 3, 1990 (1990-08-03)|||||","Production":"Animator Larry Ruppel shared his experience during the film's production:\"I was the sole American working at the Paris studio during this production, the other creative artists hailing mostly from France, Denmark, Australia and Italy. I'd like to add that this little movie ended up being quite important because of the many notable animation professionals who got their start on this project. Besides myself (I've animated numerous Disney projects, also Classic Warner Bros. shorts), there are, among others, DreamWorks animators Sylvain Deboissy and Nicholas Marlet, French animation director Pierre Lyphoudt, and ILM's James Baker and Daniel Jeannette. For all the Europeans working on this Disney feature, it was a dream come true, and because most of us were working on a feature for the first time in our lives, in a way it was our Snow White. As the only American on staff, there were many occasions when I had to explain to supervisors or other animators the exact meaning of some American slang phrases used in the dialogue of the script.\"During the film's main titles, the titles' typeface is similar to that of the Indiana Jones films. This was obviously to honor the film Raiders of the Lost Ark for using the original Carl Barks comic book series as part of the inspiration for the former (such as the scene when Jones being chased by a boulder which was inspired by \"The Seven Cities of Cibola,\" an Uncle Scrooge comic book issue. Also, the idea for the idol mechanism in the opening scene in Raiders, and deadly traps later in the film were inspired by several Uncle Scrooge comics). Another homage to the Indiana Jones films comes later in the movie when someone looking like Indiana Jones can be seen briefly when Scrooge and Genie visit the Explorer's Club.","produced_by":"Bob Hathcock|Jean-Pierre Quenet|","starring":"Alan Young|Terrence McGovern|Russi Taylor|Richard Libertini|Christopher Lloyd|June Foray|Chuck McCann|Joan Gerber|Rip Taylor|","running_time":"74 minutes","music_by":"David Newman","edited_by":"Charles King","Release":"While the film earned $18 million domestically and made back its budget, it was not the financial success Disney was supposedly hoping for, having to face competition from other larger-scale summer family releases such as Problem Child, and caused all planned DuckTales films to be shelved as well (there were plans for there to be several DuckTales films following this).[citation needed]Some critics considered the film to be a betrayal of Carl Barks's Uncle Scrooge comic books on which DuckTales was based.[2][3] Overseas, however, critics were generally kinder to the film.[citation needed] On the review aggregator Rotten Tomatoes, the film has a rating of 88%, based on 8 reviews.[4]The movie was released on VHS on March 15, 1991, followed by a Laserdisc release on April 26, 1991. On January 16, 2006, the region 1 DVD of DuckTales the Movie: Treasure of the Lost Lamp was released as an exclusive to the Disney Movie Club and the Disney Movie Rewards Program. The first release of the DVD to the general public was announced for January 13, 2015.[5] Ahead of this, DVDs were available in Canada in October 2014, apparently as a Wal-Mart Exclusive.[6] In addition, there was a DVD release also ahead of the general release date that was issued in the United States as a Wal-Mart Exclusive on October 14, 2014. Disney has given the DVD wide release in Europe and other parts of the world. The DVD release is in widescreen presentation (1.66:1) in region 1 and other countries. However, it is currently unknown whether the film will ever be released on Blu-ray or not.The film is available to rent and purchase (including in HD) on iTunes.[7]"}