{"Cast":"Retired U.S. Supreme Court Justice Harry Blackmun also appears in the film as Justice Joseph Story.","country":"United States","distributed_by":"DreamWorks Pictures","Plot":"Amistad is the name of a slave ship traveling from Cuba to the United States in 1839. It is carrying African people as its cargo. As the ship is crossing from Cuba to the United States, Cinqué, a leader of the Africans, leads a mutiny and takes over the ship. The mutineers spare the lives of two Spanish navigators to help them sail the ship back to Africa. Instead, the navigators play out the Africans and sail north to the east coast of the United States, where the ship is stopped by the American Navy, and the 53 living Africans imprisoned as runaway slaves.In an unfamiliar country and not speaking a single word of English, the Africans find themselves in a legal battle. District Attorney William S. Holabird brings charges of piracy and murder. The Secretary of State John Forsyth, on behalf of President Martin Van Buren (who is campaigning for re-election), represents the claim of Queen Isabella II of Spain that the Africans are slaves and are property of Spain based on a treaty. Two Naval officers claim them as salvage while the two Spanish navigators produce proof of purchase. A lawyer named Roger Sherman Baldwin, hired by the abolitionist Tappan and his black associate Joadson (a fictional character[1]) decides to defend the Africans.Baldwin argues that the Africans had been captured in Africa to be sold in the Americas illegally. Baldwin proves through documents found hidden on Amistad that the African people were initially cargo belonging to a Portuguese slave ship, The Tecora. Therefore, the Africans were free citizens of another country and not slaves at all. In light of this evidence, the staff of President Van Buren has the judge presiding over the case replaced by Judge Coglin, who is younger and believed to be impressionable and easily influenced. Consequently, seeking to make the case more personal, on the advice of John Quincy Adams, Baldwin and Joadson find James Covey, a former slave who speaks both Mende and English. Cinque tells his story at trial.District Attorney Holabird attacks Cinqué’s “tale” of being captured and kept in a Lomboko slave fortress and especially questions the throwing of precious cargo overboard. However, the Royal Navy's fervent abolitionist Captain Fitzgerald of the West Africa Squadron backs up Cinqué’s account. Baldwin shows from The Tecora's inventory that the number of African people taken as slaves was reduced by 50. Fitzgerald explains that some slave ships when interdicted do this to get rid of the evidence for their crime. But in The Tecora's case, they had underestimated the amount of provisions necessary for their journey. As the tension rises, Cinqué stands up from his seat and repeatedly cries, \"Give us, us free!\"Judge Coglin rules in favor of the Africans. After pressure from Senator Calhoun on President Van Buren, the case is appealed to the Supreme Court. Despite refusing to help when the case was initially presented, Adams agrees to assist with the case. At the Supreme Court, he makes an impassioned and eloquent plea for their release, and is successful.Lomboko slave fortress is liberated by the Royal Marines Captain Fitzgerald. He orders the ship's cannon to destroy the fortress. He then dictates a letter to Secretary of State John Forsyth saying that he was right—the slave fortress doesn't exist.Because of the release of the Africans, President Martin Van Buren loses his re-election campaign, and tension builds between the North and the South, which would eventually culminate in the Civil War.","language":"English","Reception":"Amistad received mainly positive reviews. On Rotten Tomatoes, the film receives an approval rating of 75% based on reviews from 61 critics, with an average score of 6.9/10. its consensus reads: \"Heartfelt without resorting to preachiness, Amistad tells an important story with engaging sensitivity and absorbing skill.\"[8]Susan Wloszczyna of USA Today summed up the feelings of many reviewers when she wrote: \"as Spielberg vehicles go, Amistad — part mystery, action thriller, courtroom drama, even culture-clash comedy — lands between the disturbing lyricism of Schindler's List and the storybook artificiality of The Color Purple.\"[9] Roger Ebert awarded the film three out of four stars, writing:\"Amistad,\" like Spielberg's \"Schindler's List,\" is [...] about the ways good men try to work realistically within an evil system to spare a few of its victims. [...] \"Schindler's List\" works better as narrative because it is about a risky deception, while \"Amistad\" is about the search for a truth that, if found, will be small consolation to the millions of existing slaves. As a result, the movie doesn't have the emotional charge of Spielberg's earlier film — or of \"The Color Purple,\" which moved me to tears. [...] What is most valuable about \"Amistad\" is the way it provides faces and names for its African characters, whom the movies so often make into faceless victims.[10]The film earned $44,229,441 at the box office in the United States, debuting at No. 5 on December 10, 1997.[11]Amistad was nominated for Academy Awards in four categories: Best Supporting Actor (Anthony Hopkins), Best Original Dramatic Score (John Williams), Best Cinematography (Janusz Kamiński), and Best Costume Design (Ruth E. Carter).[12]","box_office":"$44.2 million","Historical accuracy":"Many academics, including Columbia University professor Eric Foner, have criticized Amistad for historical inaccuracy and the misleading characterizations of the Amistad case as a \"turning point\" in the American perspective on slavery. [3] Foner wrote:Other reported inaccuracies include the following:","cinematography":"Janusz Kamiński","production_company":"HBO Films","directed_by":"Steven Spielberg","release_dates":"December 10, 1997 (1997-12-10)|||||","Production":"Actress and director Debbie Allen had run across some books about the mutiny on La Amistad and brought the subject to HBO films, which chose to make a film adaptation of the subject. She later presented the project to DreamWorks SKG to release the film, which agreed. Steven Spielberg, who wanted to stretch his artistic wings after making The Lost World: Jurassic Park (1997), was interested in directing it for DreamWorks, which he also co-founded, as well. Spielberg was an unlikely person to tackle the Amistad story since his previous picture about black characters, The Color Purple, had been badly received by the black community.Filming of the exterior and interior court scenes took place in the Marble House mansion, and then moved to Sonalyst Studios. The opening scene was filmed on a sound stage in Universal Studios. Production then went to Puerto Rico for the scenes set in Africa, including those with the slave fortress.Post-production was done rarely with Spielberg, due to his commitment to another DreamWorks film, Saving Private Ryan.The musical score for Amistad was composed by John Williams. A soundtrack album was released on December 9, 1997 by DreamWorks Records.[2] The lyrics from \"Dry Your Tears, Afrika\" are from a 1967 poem by French-speaking Ivorian poet Bernard Binlin Dadié. The words are primarily in Mende, one of Sierra Leone's major languages.","produced_by":"Debbie Allen Steven Spielberg Colin Wilson","starring":"Morgan Freeman Anthony Hopkins Djimon Hounsou Matthew McConaughey Nigel Hawthorne Stellan Skarsgård Harry Blackmun Anna Paquin","running_time":"154 minutes","amistad":"Home video release poster","music_by":"John Williams","edited_by":"Michael Kahn","written_by":"David Franzoni","budget":"$36 million"}