{"Cast":"","country":"United States","distributed_by":"Miramax Films","Plot":"In 1987, James Brennan (Jesse Eisenberg) has two plans. The first plan is to have a summer vacation in Europe after graduating with a comparative literature degree from Oberlin College. His second plan is to attend a journalism graduate school at Columbia University when his holidays end. A few days after his graduation, his parents (Wendie Malick and Jack Gilpin) advise him to seek a part-time job rather than going to Europe when they unexpectedly announce that financial problems have taken a toll on them and they would be unable to financially support him.James gets a job at Adventureland, a local amusement park in his hometown of Pittsburgh, Pennsylvania, where his childhood friend Tommy Frigo (Matt Bush) works. Assistant manager Bobby (Bill Hader) assigns James to the games area. He meets his co-workers: sarcastic Joel (Martin Starr); Bobby's wife and park manager Paulette (Kristen Wiig); Sue O'Malley (Paige Howard); Mark (Mark Miller); the alluring Lisa P. (Margarita Levieva); and the park's technician, Mike Connell (Ryan Reynolds), a part-time musician. Another games worker, Emily \"Em\" Lewin (Kristen Stewart), saves James from being stabbed by a lying-cheating customer.With her father and stepmother away, Em throws a party and gets to know James. During the conversation, Em persuades James to join her in the house's swimming pool. After Em leaves the pool, Frigo humiliates James by announcing to the party that James has an erection while leaving the pool, causing an embarrassed James to jump back into the water. After the party, Connell, who has been having an affair with Em, comes over to further pursue it.Later that week, James goes for a drink with Em and she is surprised to learn James has never had sex. They share a first kiss. The following day, James tells Connell about his strong feelings for Em, which Connell reports to her. Em tells James she wants to take things slow due to problems in her life, leaving James confused and upset. Sue drunkenly makes out with Joel, but rejects him the next day, saying her Catholic parents would not allow her to date a Jew; outraged, Em calls Sue an anti-Semite in front of other staff members. Lisa P. asks James on a date, but he has mixed feelings because of his relationship with Em. After Connell talks him into going, he accepts Lisa P.'s offer.After the date, during which Lisa and James kiss, James learns Em had called to say she regrets having rejected his feelings. Joel later sees James and Em walking together and, irritated by the chain of events, quits. James unsuccessfully tries to talk him out of it, and Joel reveals he's angry at James for dating Lisa P. when James is already in love with Em. James tells Em about going out with Lisa P. After hearing of this, Em goes to Connell's mother's home to end their affair. The park's mentally challenged parking attendant, prompted by Tommy, tells James he saw Em and Connell doing \"pushups without any pants on\" in the back of Connell's car.James goes to Connell's mother's house, which is where Lisa P. told him Connell takes girls to have sex, and sees Em leaving. Shocked to see James, Em becomes tongue-tied. James leaves angrily, and Em cries. James tells Lisa P. about the affair and asks her not to tell anyone, but she tells her friend Kelly. Upon noticing that all the park employees know, Em quits and moves back to New York. A heartbroken James drunkenly crashes his father's car into a tree and passes out. The next morning, his mother angrily wakes him up and tells him he has to pay to repair it with his summer earnings.Now, without enough money for graduate school, James nonetheless heads to New York City with his parents' blessing, and waits outside Em's apartment. She is reluctant to talk to him, feeling she has ruined everything. James tells her he sees her in a different way than she sees herself. Touched, Em brings James up to her apartment. James reveals he is not going to Columbia this year, and considers next year. He gets out of his wet clothes and finds Em still has an Adventureland shirt. They kiss and begin to take their clothes off. James asks, \"Are we doing this?\", and Em says, \"I think so.\"","language":"English","box_office":"$17.2 million[2]","cinematography":"Terry Stacey","production_company":"Sidney Kimmel Entertainment","directed_by":"Greg Mottola","Soundtrack":"A total of 41 songs were licensed for use in the film.[13] The soundtrack includes 14 songs and was released on April 1, 2009 by Hollywood Records. The songs included are mostly from the 1980s, to fit with the setting of the film, with several tracks from the late 1960s and early 1970s, most notably by The Velvet Underground, Lou Reed, the New York Dolls and cult darlings Big Star. The '80s bands represent a cross section of alternative bands from the time including Hüsker Dü, The Jesus and Mary Chain, Nick Lowe, The Cure, The Replacements, and Crowded House.The film maintains a notable reverence for Lou Reed, who is idolized by the main character, featured on T-shirts and posters of other cast members and has likewise elevated the status of the playground mechanic stemming from a rumored jam session with the artist. Earlier versions of the script replaced Lou Reed with singer-songwriter Neil Young as the musician Ryan Reynolds's character had played with, and used Young's songs \"Everybody Knows This Is Nowhere\" and \"Hey Hey, My My (Into The Black)\" in key scenes.","release_dates":"April 3, 2009 (2009-04-03)|||||","Production":"Adventureland was filmed in Pittsburgh, Pennsylvania, from October 2007 to January 2008, with most scenes shot in Kennywood, a historic amusement park in nearby West Mifflin, Pennsylvania. The park was heavily altered to look run-down.[3] The theme park from the film is based on the Farmingdale, New York amusement park Adventureland where Mottola once worked in the 1980s. The scenes of the family home were filmed in a neighborhood named Fox Ridge located in the town of McCandless, a suburb still within Allegheny County and approximately 12 miles north of the city of Pittsburgh. Other scenes were shot in Beaver County, Pennsylvania, and the airport area of Moon Township such as the Stardust Lounge.The story takes place during the summer, but since it was shot in the winter months in Pittsburgh, Pennsylvania, crews had to often hide snowfall. In some instances, during indoor takes, extras were paid to stand outside surrounding the windows and doors to block the snow falling behind the actors. Internet star iJustine makes an uncredited cameo appearance as she was already in Kennywood when filming started.","produced_by":"Sidney Kimmel Anne Carey Ted Hope","starring":"Jesse Eisenberg Kristen Stewart Martin Starr Kristen Wiig Bill Hader Ryan Reynolds","running_time":"107 minutes","adventureland":"Theatrical release poster","music_by":"Yo La Tengo","edited_by":"Anne McCabe","Release":"The film premiered at the 2009 Sundance Film Festival[4] and went on general release on April 3, 2009. The film was also screened at the 2009 Edinburgh International Film Festival.[5]Adventureland received positive reviews from critics. On Rotten Tomatoes, the film has an 88% \"Certified Fresh\" rating, based on 208 reviews, with an average rating of 7.3/10. The site's critical consensus reads, \"Full of humor and nostalgia, Adventureland is a sweet, insightful coming-of-age comedy that will resonate with teens and adults alike\".[6] On Metacritic, the film has a score of 76 out of 100, based on 34 critics, indicating \"generally favorable reviews\".[7]In its first week at the box office, Adventureland opened moderately wide in only 1,862 screens grossing $5.7 million ranking #6 at the box office. Despite opening up in fourteen more screens in its second week Adventureland only took in $3.4 million, falling to #9 at the box office. The film concluded its U.S. domestic run on May 28, 2009 with a gross of $16,044,025 and a total international gross of $17,164,377[8][9]The film was nominated for the Gotham Independent Film Awards \"Best Ensemble Cast\", scheduled in New York City on November 30, 2009.[10]Adventureland was the winner of High Times magazine's 2009 Stoner Movie of the Year Award. Kristen Stewart also received High Times' 2009 Stonette of the Year Award, due in part to her performance in the film.[11]Jesse Eisenberg was nominated for Favorite Male Breakthrough Performance at the Teen Choice Awards for his performance and also for his work in Zombieland.The film was released August 25, 2009 on DVD and Blu-ray with unrated bonus features.[12]","written_by":"Greg Mottola","budget":"$9.8 million[1]"}