{"based_on":"A Most Wanted Man  by John le Carré","country":"United Kingdom","distributed_by":"Lionsgate","screenplay_by":"Andrew Bovell","Plot":"Issa Karpov (Grigoriy Dobrygin), a political refugee from Chechnya who has been tortured by Russian security forces, enters Hamburg, Germany, illegally.Günther Bachmann (Philip Seymour Hoffman) leads an unconstitutional, covert government team that seeks to recruit local informants with ties to Islamic terrorist organizations. The disheveled Gunter's polar opposite is his efficient right-hand associate, Irna Frey (Nina Hoss). The team learns of Karpov's presence and his suspected links to Chechen terrorists.Bachmann's team is also tracking the activities of a local, respected, Muslim philanthropist, Dr. Abdullah (Homayoun Ershadi), who the team suspects is funneling a small portion of his legitimate funds to Al Qaeda, though the team is unable to prove this. High ranking German security official Mohr (Rainer Bock) and American diplomatic attaché Sullivan (Robin Wright) both learn of these investigations and take interest.Bachmann is interested in watching suspects and \"turning\" informants higher and higher up the chain, while protecting the naive who are caught up in the nefarious affairs of others. Mohr and Sullivan appear single-minded, and interested in merely capturing suspects, regardless of guilt or future usefulness.Gunther has been disgraced in the past for an apparently serious failure, and shows signs of self-neglect, but is a sophisticated operative who understands Islamic terrorism, and distrusts politicians and the Americans.Karpov contacts an immigration lawyer, Annabel Richter (Rachel McAdams), who helps put him in contact with Tommy Brue (Willem Dafoe), a wealthy banker whose father had long ago laundered money for Karpov's murderous father, of the Russian mafia. Karpov is the rightful heir to a multimillion-dollar account long held by this bank, but Karpov identifies with his maternal Chechen, Muslim heritage and decides he no longer wants his father's dirty money.Bachmann's team is able to turn Brue and Richter to their cause, using threats and seduction. Richter convinces Karpov to donate the funds to Abdullah's organization, in the hope that Abdullah will reroute some of the funds to a shipping company acting as a front for al-Qaeda.Bachmann plans to use this proof of guilt to turn Abdullah as well, in order to ensnare those higher up in the terrorist organization. The plan is approved by the interior minister, along with the American who has become an apparent ally of Bachmann. Bachmann secures asylum in Germany for the innocent Karpov.Abdullah does indeed route funds to the shipping company, but as Bachmann is about to try to make Abdullah into an informant, without disrupting his life or family, Bachmann is expertly ambushed by forces reporting to Mohr and Sullivan, who whisk away Abdullah and Karpov.Bachmann screams in frustrated, powerless anger, as Frey, Richter, and Brue look on in shock, and Bachmann drives off, defeated.","language":"English","Reception":"A Most Wanted Man received positive reviews and has a \"Certified Fresh\" score of 88% on Rotten Tomatoes based on 178 reviews with an average rating of 7.4 out of 10. The critical consensus states: \"Smart, subtle, and steadily absorbing, A Most Wanted Man proves once again that John le Carré books make for sharp, thoughtful thrillers\".[12] On Metacritic, the film has a score of 73 out of 100, based on 42 critics, indicating \"generally favorable reviews\". Richard Roeper called the film one of the best spy thrillers in recent years, and called it the seventh best film of 2014.[13]Many critics praised Hoffman's performance, which was his last leading role before his death in February 2014.[14] Critic Kenneth Turan of the Los Angeles Times called it a \"crackerjack thriller\" and praised the performance of the entire cast but Hoffman in particular. He wrote that A Most Wanted Man is \"a fitting film for him to leave on, not only because it is so expertly done but because his role was so challenging.\"[15]","box_office":"$36.2 million[4]","cinematography":"Benoît Delhomme","production_company":"Demarest Films Potboiler Productions The Ink Factory Film4 Productions","directed_by":"Anton Corbijn","a_most_wanted_man":"Theatrical release poster","release_dates":"19 January 2014 (2014-01-19) (Sundance)[1]|5 September 2014 (2014-09-05) (United Kingdom)||||","Production":"Principal photography took place in Hamburg, Germany in September 2012.[8]","produced_by":"Stephen Cornwell|Gail Egan|Malte Grunert|Simon Cornwell|Andrea Calderwood|","starring":"Philip Seymour Hoffman|Rachel McAdams|Willem Dafoe|Robin Wright|Grigoriy Dobrygin|Homayoun Ershadi|Nina Hoss|Daniel Brühl|","running_time":"122 minutes[2]","music_by":"Herbert Grönemeyer","edited_by":"Claire Simpson","Release":"In July 2013, Lionsgate acquired the US distribution rights to the film.[9]On 11 April 2014, the first trailer for the film was released.[10] A new trailer for the UK was revealed on 30 June.[11]On 25 July 2014, the film received a limited release in the United States, beginning with 361 theatres and later expanding wider. It has earned US$31,554,855 worldwide.[4]","budget":"$15 million[3]"}