{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"John Monks Jr.","story_by":"Hugh King Don McGuire","DVD release":"Warner Bros. released the film on DVD on July 13, 2010, in its Film Noir Classic Collection, Vol. 5.[4]","dial_1119":"Theatrical release poster","Plot":"Homicidal escaped mental patient Gunther Wyckoff (Marshall Thompson) arrives by bus in Terminal City. As he gets off, he is confronted by the bus driver for stealing his Colt pistol. Wyckoff uses it to kill the driver.Wyckoff tries to locate a man named Dr. Faron, at both his office and then at his home address - an apartment building - with no luck. As he leaves the building, it is a warm night, and he notices the Oasis Bar across the street. He goes into the bar and finds there is a good vantage point to observe the entryway to the apartment building. The bar is tended by Chuckles and his assistant/relief-person Skip (whose wife is in hospital about to have a baby).Chuckles, seeing a news flash story on the TV, notices Wyckoff is one of his customers and tries, unsuccessfully, to reach a pistol he has stashed behind the bar. At this point, there are four patrons in the bar: the sluttish barfly Freddy; the young Helen, who is accompanied by an attentive older gentleman, Earl; and newspaper reporter Harrison D. Barnes. Chuckles then tries to telephone the police, but Wyckoff shoots Chuckles dead as he is placing the call. Wyckoff then orders the bar patrons to occupy one table, where he can keep an eye on them. Meanwhile, the gunshot and subsequent scream by Helen attracts attention. As a beat police officer approaches the bar, he is shot in the leg by Wyckoff. Bystanders rescue the officer, and a call is made for reinforcements to respond to a man barricaded in the bar.The five hostages discuss what might be going on with Wyckoff. The relief barman, when asked, notes the gun holds eight rounds, but while he is speaking, Wyckoff replaces the magazine with a new one.Wyckoff calls the police. He demands the police stay away, but deliver Dr. Faron to the bar within 25 minutes or he will kill the hostages. It is revealed that Faron is the local police psychiatrist. The press set up TV coverage near the bar, while the crowd of onlookers grows.As police discuss tactics, Faron is found and brought to the bar. Being a newspaperman, Harrison reminds the others that Wyckoff's crime was a big local story three years before. As Faron pleads with the police to let him attempt to handle Wyckoff, they try to enter the bar undetected. Wyckoff becomes aware of the attempted breach and seriously wounds an officer. Faron again pleads with the police, and says, \"I demand that you let me do my job!\", which Wyckoff sees on the TV. The police captain resents Faron's success at getting Wyckoff a light sentence the first time around. The police prepare a breach en masse with two minutes left before Wyckoff's deadline, but Faron slips away and enters the bar. He tries to convince Wyckoff he is delusional, but after some discussion, Wyckoff becomes agitated and shoots Faron dead.The phone rings, and Skip knows it is the hospital calling about his wife. Desperate to answer, he struggles with Wyckoff; at the same moment, the police detonate an explosive charge and extinguish the lights. In the confusion, one of the hostages uses Chuckles under-counter gun to shoot Wyckoff. In shock, he staggers outside and is cut down by police gunfire. As he kneels over Faron's body, the police captain rhetorically asks an officer, \"How far does man have to go to prove that he's right?\"","language":"English","Reception":"Although the film was inexpensively made, it only earned $402,000 in the US and Canada and $201,000 elsewhere, resulting in a loss of $148,000.[1]Film critic Glenn Erickson discussed the production values of the film writing: \"1950's Dial 1119 is a low-budget MGM picture that resembles a one-act play expanded to short feature length. With economic pressures coming down hard on the studios, the expense of something like An American in Paris had to be balanced by making other studio producers come up with something for nothing. Thus we have Dial 1119, a taut little suspense item that uses only a couple of sets and utilizes the services of contractees already on the payroll. The show also resembles a typical live TV production from a few years later, the kind that garnered attention for the likes of James Dean.\"[2]Critic Jeff Stafford liked the film, writing, \"A taut and suspenseful B-movie, Dial 1119 is distinguished by the crisp black-and-white cinematography of Paul C. Vogel (He worked on such film noir favorites as Lady in the Lake, 1947) and the excellent ensemble cast which includes Virginia Field, Andrea King, Leon Ames, Keith Brasselle, and William Conrad (star of TV's detective series, Cannon, 1971-1976) as the unlucky bartender. It was the first film directed by Gerald Mayer, son of the famous MGM tycoon, Louis B. Mayer, and remains the best movie of his brief career.\"[3]","box_office":"$603,000[1]","cinematography":"Paul Vogel","production_company":"Metro-Goldwyn-Mayer","directed_by":"Gerald Mayer","release_dates":"November 3, 1950 (1950-11-03) (United States)|||||","produced_by":"Richard Goldstone","starring":"Marshall Thompson Virginia Field Andrea King Sam Levene","running_time":"75 minutes","music_by":"André Previn","edited_by":"Newell P. Kimlin","budget":"$473,000[1]"}