{"country":"United Kingdom","distributed_by":"AIP","curse_of_the_crimson_altar":"Curse of the Crimson Altar","language":"English","Critical reception":"The New York Times said \"Karloff himself, cadaverous and almost wholly crippled, acts with a quiet lucidity of such great beauty that it is a refreshment merely to hear him speak old claptrap. Nothing else in The Crimson Cult comes close to him—though there is Barbara Steele in greenface playing Lavinia, a glamorous 300-year-old and a monumental cast that lists no fewer than seven-party girls, plus several sacrificial virgins.\"[3]","cinematography":"John Coquillon","production_company":"Tigon Films","directed_by":"Vernon Sewell","Plot synopsis":"Robert Manning (Mark Eden) searches for his brother, who was last known to have visited the remote house of Craxted Lodge at Greymarsh. Arriving at night, he finds a party is in progress, and he is invited to stay by Eve (Virginia Wetherell), the niece of the owner of the house. His sleep is restless and strange dreams of ritual sacrifice disturb him. Enquiring about his brother, he is assured by the house owner, Morley (Christopher Lee), that the man is not there. Manning’s suspicions are aroused by nightmarish hallucinations. Occult expert Professor Marshe (Boris Karloff) informs Manning about a witchcraft cult led by Morley's ancestor, Lavinia (Barbara Steele). The cult is discovered to still be active. Craxted Lodge is burned to the ground, and the head of the cult is consumed in the flames.","release_dates":"1968 (1968) (UK)|15 April 1970 (1970-04-15) (USA)||||","Production":"The house used for Craxted Lodge is Grim's Dyke, the allegedly haunted former home of William S. Gilbert, located in Redding, Harrow Weald, Middlesex, London. The building, which is now a hotel, was used for both exterior and interior shots.","produced_by":"Louis M. Heyward executive Tony Tenser","starring":"Christopher Lee Boris Karloff Mark Eden","running_time":"89 minutes","edited_by":"Howard Lanning","written_by":"Mervyn Haisman and Henry Lincoln (screenplay)"}