{"country":"United States|United Kingdom|France|","distributed_by":"Focus Features","burn_after_reading":"Theatrical release poster","Plot":"Faced with a demotion at work due to a drinking problem (alcoholism), Osbourne Cox angrily quits his job as a CIA analyst and resolves to write a memoir about his life and career. When his pediatrician wife Katie finds out, she sees it as a justifiable opportunity to file for divorce and continue her adulterous affair unimpeded. Taking her lawyer's advice, she copies financial records and several other files from her husband's computer onto a CD. These files contain a rambling, meaningless diatribe by Cox on purported CIA activities.When the CD gets left on the locker room floor of Hardbodies, a local gym, by a careless law firm employee, it falls into the hands of dim-witted personal trainer Chad Feldheimer and his co-worker Linda Litzke, who mistakenly believe the numerical data in the Coxes' bank records, and especially, Cox's diatribes, to be highly sensitive government information. After getting the data traced back to Osbourne, who thinks his memoirs have been stolen, Chad and Linda plan to give the disc back to him for a reward, with Linda planning to use the money to pay for plastic surgery. When a phone call and subsequent meeting with Osbourne provoke a furious reaction and go horribly wrong, Chad and Linda turn over the disc to the Russian embassy, offering more information in return for monetary compensation. With no other data to give them, Linda persuades Chad to sneak into the Coxes' home to get more files from their computer.Meanwhile, Osbourne's increasingly erratic behavior, aggravated in part by his encounters with Chad and Linda, prompt Katie to move ahead with the divorce proceedings. She changes the locks on their house, forcing Osbourne to move onto the sailboat they have docked on the Chesapeake Bay. With her husband out of the picture, Katie invites her lover, Harry Pfarrer, to move in. A womanizing, multi-adulterous deputy U.S. Marshal, Harry is coincidentally also secretly seeing Linda. Harry finds Chad, whom Linda sent to find more files on Osbourne, hiding in a wardrobe in the Coxes' home, panics, and fatally shoots Chad.Two days later at the CIA headquarters, Palmer Smith, Osbourne's former superior, and his director learn that information from Osbourne has been given to the Russian Embassy. The two men are perplexed, given Osbourne's low-level security clearance, the material delivered to the Russians being of no importance to anyone, and the apparent motive of all involved parties remaining unknown. Smith is told to maintain observation until the situation \"makes sense\". Harry, burdened by keeping the day prior's events secret, gets into an argument with Katie and decides to leave the house. On his way out, he spots a man who has been trailing him for the past several days. After tackling him to the ground, Harry finds out that the man is a private detective hired by his wife Sandra \"Sandy\" to gather evidence for impending divorce proceedings. Sandy is shown to be having an extramarital liaison of her own. Harry is devastated and goes to see an agitated Linda, who confides in Harry that Chad is missing. Harry agrees to help find Chad.The next morning, Harry and Linda meet in a park, and Linda provides him with more information about Chad's disappearance. When Linda mentions the name \"Osbourne Cox\", Harry figures out that Chad is the man he shot. He panics, realizes that there are strange men in the park (most likely the CIA people trailing Linda) and flees, assuming Linda is a spy. Linda then turns to Ted Treffon, the kindhearted manager of Hardbodies, who has unrequited feelings for her and has been critical of Linda and Chad's scheming thus far. Believing the Russians have kidnapped Chad, he agrees to go to the Coxes' home to search Osbourne's computer. Unemployed and having spent the past several days living on a small boat, Osbourne becomes unhinged when he finds out that Katie has emptied his bank accounts and, no longer having keys, decides to break into the house to get some of his personal belongings. Finding Ted in the basement, Osbourne initially takes him to be Katie's lover. He soon realizes Ted's affiliation with Linda and what he refers to as the \"league of morons\" he feels that he has been struggling against his whole life and kills Ted.At CIA headquarters a few days later, Palmer and his director try to understand what exactly happened. It is revealed that while trying to board a flight to Venezuela, Harry was detained because his name was on a hot list and that the CIA is holding Linda, who is promising to \"play ball\" and \"sit on it\" if they will pay for her plastic surgery. A CIA agent shot Osbourne during his assault on Ted and the bullet has put Osbourne in a coma. The director instructs Palmer to let Harry fly to Venezuela (as that country has no extradition treaty with the US and therefore will not send him back) and pay for Linda's surgery. The director and Palmer conclude that despite their oversight and the unusual events that have unfolded, there appears to be no lesson for the agency to have learned, be it moral, espionage, or otherwise. \"I guess we learned not to do it again,\" the director concludes (despite not knowing exactly what they did), and closes his file.Meanwhile, staff at the Russian embassy have dismissed the contents of Cox's ramblings in the files from his computer - arguably the one factor that started off the entire chain of events - as \"drivel\".","Accolades":"The film was nominated at the 2009 Golden Globe Awards for Best Comedy or Musical and for Best Lead Actress in a Comedy or Musical (Frances McDormand).[32] Brad Pitt and Tilda Swinton received a BAFTA Award for Best Actor in a Supporting Role and BAFTA Award for Best Actress in a Supporting Role nomination, respectively. The National Board of Review named Burn After Reading in their list of the Top 10 Movies of 2008. Noel Murray of The A.V. Club named it the second best film of 2008,[33] Empire magazine named it the third best film of 2008,[33] and Owen Gleiberman of Entertainment Weekly named it the seventh best film of 2008.[33]","language":"English","box_office":"$163.7 million[2]","cinematography":"Emmanuel Lubezki","production_company":"Relativity Media StudioCanal Working Title Films","directed_by":"Joel Coen Ethan Coen","Home media":"Burn After Reading was released on DVD and Blu-ray Disc on December 21, 2008, on Region 1. The Region 2 version was released on February 9, 2009.","release_dates":"August 27, 2008 (2008-08-27) (Venice)|September 12, 2008 (2008-09-12) (United States)|October 17, 2008 (2008-10-17) (United Kingdom)|December 10, 2008 (2008-12-10) (France)||","Production":"Working Title Films produced the film for Focus Features, which also has worldwide distribution rights.[5]Burn After Reading was the first Coen brothers film not to use Roger Deakins as cinematographer since Miller's Crossing. Emmanuel Lubezki, four-time Academy Award-nominated cinematographer of Sleepy Hollow and Children of Men, took over for Deakins.[6] Mary Zophres served as costume designer, marking her eighth consecutive movie with the Coen brothers.[5] Carter Burwell, a composer who worked with the Coens in eleven previous films, created the score. Early in the production, Burwell and the Coens decided the score should include a great deal of percussion instruments, which the filmmakers felt would match the deluded self-importance of the characters. In creating the score, they discussed the political thriller Seven Days in May, which included an all-drums score; the Burn score consisted of a great deal of Japanese Taiko drums. Joel Coen said they wanted the score to be \"something big and bombastic, something important sounding but absolutely meaningless.\"[7]Burn After Reading is the first original screenplay penned by Joel and Ethan Coen since their 2001 film, The Man Who Wasn't There.[8] Ethan Coen compared Burn After Reading to the Allen Drury political novel Advise and Consent and called it \"our version of a Tony Scott/Jason Bourne kind of movie, without the explosions.\"[9] Joel Coen said they intended to create a spy movie because \"we hadn't done one before,\"[10] but he feels the final result was more of a character-driven movie than a spy story. Joel also said Burn After Reading was not meant to be a comment or satire on Washington D.C.[7]Parts of the Burn screenplay were written while the Coens were also writing their adaptation of No Country for Old Men.[7] The Coens created characters with actors George Clooney, Brad Pitt, Frances McDormand, John Malkovich and Richard Jenkins in mind for the parts, and the script derived from the brothers' desire to include them in a \"fun story.\"[11] Ethan Coen said Pitt's character was partially inspired by a botched hair coloring job from a commercial the actor filmed.[12] Tilda Swinton, who was cast later than the other actors, was the only major actor whose character was not written specifically for her. The Coens struggled to develop a common filming schedule among the A-list cast.[13]Production Weekly, an online entertainment industry magazine, falsely reported in October 2006 that Burn After Reading was a loose adaptation of Burn Before Reading: Presidents, CIA Directors, and Secret Intelligence, a memoir by former U.S. Director of Central Intelligence Stansfield Turner.[14] Although both stories involve the Central Intelligence Agency and derive their titles from the top secret classification term, the Coen brothers script has nothing to do with the Turner book; nevertheless, the rumor was not clarified until a Los Angeles Times article more than one year later.[11]Principal photography took place around Brooklyn Heights, as the Coens wanted to stay in New York City to be with their families.[15] Other scenes were filmed at Paramus, New Jersey, Westchester County, New York and Washington, D.C., particularly in the Georgetown neighborhood.[3] Filming began on August 27, 2007 and was completed on October 30, 2007.[3] John Malkovich, appearing in his first Coen brothers film, said of the shooting, \"The Coens are very delightful: smart, funny, very specific about what they want but not overly controlling, as some people can be.\"[16] The film opened the Venice Film Festival in August 2008.[17]The Coen brothers said idiocy was a major central theme of Burn After Reading; Joel said he and his brother have \"a long history of writing parts for idiotic characters\"[17] and described Clooney and Pitt's characters as \"dueling idiots.\"[12] Burn After Reading is the third Coen brothers film for Clooney (O Brother, Where Art Thou? and Intolerable Cruelty), who acknowledged that he usually plays a fool in their movies: \"I've done three films with them and they call it my trilogy of idiots.\"[17] Joel said after the last scene was shot, \"George said: 'OK, I've played my last idiot!' So I guess he won't be working with us again.\"[18]Pitt, who plays a particularly unintelligent character, said of his role, \"After reading the part, which they said was hand-written for myself, I was not sure if I should be flattered or insulted.\"[17] Pitt also said when he was shown the script, he told the Coens he did not know how to play the part because the character was such an idiot: \"There was a pause, and then Joel goes...'You'll be fine'.\"[19]During a fall movie preview, Entertainment Weekly wrote that Malkovich \"easily racks up the most laughs\"[20] among the cast as the foul-mouthed and short-tempered ex-CIA man. The first scene Malkovich performed was a phone call in which he shouts several obscenities at Pitt and McDormand. But Malkovich could not be on the sound stage for the call because he was rehearsing a play, so he called in the lines from his apartment in Paris. Regarding the scene, Malkovich said, \"It was really late at night and I was screaming at the top of my lungs. God knows what the neighbors thought.\"[20] Swinton plays Malkovich's wife who engages in an affair with Clooney, although the two characters do not get along well. Clooney's and Swinton's characters also had a poor relationship in their previous film together, Michael Clayton, prompting Clooney to say to Swinton at the end of a shoot, \"Well, maybe one day we'll get to make a film together when we say one nice thing to each other.\"[20] Swinton said of the dynamic, \"I'm very happy to shout at him on screen. It's great fun.\"[3]Swinton described Burn After Reading as \"a kind of monster caper movie,\"[18] and said of the characters, \"All of us are monsters – like, true monsters. It's ridiculous.\"[18] She also said, \"I think there is something random at the heart of this one. On the one hand, it really is bleak and scary. On the other, it is really funny. ... It's the whatever-ness of it. You feel that at any minute of any day in any town, this could happen.\"[9] Malkovich said of the characters, \"No one in this film is very good. They're either slightly emotional or mentally defective. Quirky, self-aggrandizing, scheming.\"[16] Pitt said the cast did little ad-libbing because the script was so tightly written and wove so many overlapping stories together.[10] Veteran actor Richard Jenkins said the Coen brothers asked him if he could lose weight for his role as the gym manager, to which Jenkins jokingly replied, \"I'm a 60-year-old man, not Brad Pitt. My body isn't going to change.\"[21]Joel Coen said the sex machine built by Clooney's character was inspired by a machine he once saw a key grip build, and by another machine he saw in the Museum of Sex in New York City.[7]","produced_by":"Joel Coen|Ethan Coen|","starring":"George Clooney|Frances McDormand|John Malkovich|Tilda Swinton|Richard Jenkins|Brad Pitt|","running_time":"96 minutes[1]","music_by":"Carter Burwell","edited_by":"Roderick Jaynes","Release":"In its opening weekend, the film grossed $19,128,001 in 2,651 theaters in the United States and Canada, ranking number one at the box office.[22] As of July 2009, it has grossed $60,355,347 in the United States and Canada and $103,364,722 overseas adding up to $163,720,069 worldwide gross.[2]Reviews for the film were mostly positive, earning a 78% \"Certified Fresh\" rating at Rotten Tomatoes[23] and a 63/100 average on Metacritic.[24] The Times, which gave the movie four out of five stars, compared it to Coen films Raising Arizona and Fargo in its \"savagely comic taste for creative violence and a slightly mocking eye for detail.\"[8] The review said the attention to detail was so impeccable that \"the Coens can even raise a laugh with something as simple as a well-placed photograph of Vladimir Putin,\"[8] and complimented Carter Burwell's musical score, which it described as \"the most paranoid piece of film music since Quincy Jones's neurotic soundtrack for The Anderson Tapes.\"[8] Andrew Pulver, film reviewer for The Guardian called the movie \"a tightly wound, slickly plotted spy comedy that couldn't be in bigger contrast to the Coens' last film, the bloodsoaked, brooding No Country for Old Men.\"[25] Pulver, who also gave Burn After Reading four out of five stars, said it \"may also go down as arguably the Coens' happiest engagement with the demands of the Hollywood A-list.\"[25] Pulver said Brad Pitt had some of the funniest moments and that compared to the other Coen brothers movies, Burn After Reading most resembles Intolerable Cruelty.[25] The Hollywood Reporter reviewer Kirk Honeycutt complimented the actors for making fun of their screen personae, and said the Coen brothers \"have taken some of cinema's top and most expensive actors and chucked them into Looney Tunes roles in a thriller.\"[26] Honeycutt also said \"it takes awhile to adjust to the rhythms and subversive humor of Burn because this is really an anti-spy thriller in which nothing is at stake, no one acts with intelligence and everything ends badly.\"[26]Todd McCarthy, of Variety magazine, wrote a strongly negative review of Burn After Reading, which he said \"tries to mate sex farce with a satire of a paranoid political thriller, with arch and ungainly results.\"[27] McCarthy said the talented cast was forced to act like cartoon characters, described Carter Burwell's score as \"uncustomarily overbearing\"[27] and said the dialogue is \"dialed up to an almost grotesquely exaggerated extent, making for a film that feels misjudged from the opening scene and thereafter only occasionally hits the right note.\" Time film critic Richard Corliss said he did not understand what the Coen brothers were attempting with the film, and after describing the plot, wrote, \"I have the sinking feeling I've made Burn After Reading sound funnier than it is. The movie's glacial affectlessness, its remove from all these subpar schemers, left me cold and perplexed.\"[28] Corliss complimented Richard Jenkins and J.K. Simmons for their brief supporting roles.[28] David Denby of The New Yorker said the movie had several funny scenes, but they \"are stifled by a farce plot so bleak and unfunny that it freezes your responses after about forty-five minutes.\"[29] Denby also criticized the pattern of violence in the movie, in which innocent people die quickly and the guilty go unpunished. \"These people don't mean much to [the Coen brothers]; it's hardly a surprise that they don't mean much to us, either. ... Even black comedy requires that the filmmakers love someone, and the mock cruelties in Burn After Reading come off as a case of terminal misanthropy.\"[29]Leah Rozen, of People magazine, said the characters' \"unrelenting dumbness and dim-witted behavior is at first amusing and enjoyable but eventually grows wearing.\"[30] But Rozen said the performances are a redeeming factor, especially that of Pitt, who she described as a standout who \"manages simultaneously to be delightfully broad and smartly nuanced.\"[30]Le Monde noticed its \"particularly bitter image of the U.S. The alliance of political incompetence (the CIA), the cult of appearance (the gym club) and vulgar stupidity (everyone) is the target of a settling of scores\" where the comedy \"sprouts from a well of bitterness.\"[31]","written_by":"Joel Coen|Ethan Coen|","budget":"$37 million[2]"}