{"country":"United States","distributed_by":"Warner Bros.","Plot":"Billy Jack is a \"half-breed\" American Navajo Indian,[2] a Green Beret Vietnam War veteran, and a hapkido master.Jack defends the hippie-themed Freedom School and students from townspeople who do not understand or like the counterculture students. The school is organized by Jean Roberts (Delores Taylor).A group of Indian children from the school go to town for ice cream and are refused service and then abused and humiliated by Bernard Posner and his gang. This prompts a violent outburst by Billy. Later, the director of the Freedom School, Jean, is raped and an Indian student is then murdered by Bernard (David Roya), the son of the county's corrupt political boss (Bert Freed). Billy confronts Bernard and sustains a gunshot wound before killing him with a hand strike to the throat, after Bernard was caught in bed with a 13-year-old girl. After a climactic shootout with the police, and pleading from Jean, Billy Jack surrenders to the authorities and is arrested. As he is driven away, a large crowd of supporters raise their fists as a show of defiance and support.","language":"English","box_office":"$32.5 million[1]","cinematography":"Fred Koenekamp John M. Stephens","production_company":"National Student Film Corporation","directed_by":"Tom Laughlin as T.C. Frank","Soundtrack":"The film score was composed, arranged and conducted by Mundell Lowe and the soundtrack album was originally released on the Warner Bros. label.[5]The Allmusic review states \"a strange and striking combination of styles that somehow is effective... a listenable disc whose flaws only add to the warmth\".[6] The film's theme song, \"One Tin Soldier (The Legend of Billy Jack)\" by the band Coven, became a Top 40 hit in 1971, and featured the chorus:Go ahead and hate your neighbor; go ahead and cheat a friend. Do it in the name of heaven; you can justify it in the end. There won't be any trumpets blowin' come the judgment day On the bloody morning after, one tin soldier rides awayAll compositions by Mundell Lowe, except as indicated.","release_dates":"May 1, 1971 (1971-05-01)|||||","billy_jack":"Theatrical release poster.","produced_by":"Tom Laughlin as Mary Rose Solti","starring":"Tom Laughlin Delores Taylor","running_time":"114 min.","Influence":"Marketed as an action film, the story focuses on the plight of Native Americans during the civil rights movement. It attained a cult following among younger audiences due to its youth-oriented, anti-authority message and the then-novel martial arts fight scenes which predate the Bruce Lee/kung fu movie trend that followed.[7] The centerpiece of the film features Billy Jack, enraged over the mistreatment of his Indian friends, fighting racist thugs using hapkido techniques.","Box-office and critical reception":"Billy Jack holds a \"Fresh\" rating of 62% at Rotten Tomatoes.[3]In his Movie and Video Guide, film critic Leonard Maltin writes: \"Seen today, its politics are highly questionable, and its 'message' of peace looks ridiculous, considering the amount of violence in the film.\"Roger Ebert also saw the message of the film as self-contradictory, writing: \"I'm also somewhat disturbed by the central theme of the movie. 'Billy Jack' seems to be saying the same thing as 'Born Losers,' that a gun is better than a constitution in the enforcement of justice.\"[4]Delores Taylor received a Golden Globe nomination as Most Promising Newcoming Actress. Tom Laughlin won the grand prize for the film at the 1971 Taormina International Film Festival in Italy.","music_by":"Mundell Lowe, Dennis Lambert, Brian Potter","edited_by":"Larry Heath Marion Rothman","written_by":"Tom Laughlin (as Frank Christina) Delores Taylor (as Theresa Christina)","budget":"$800,000"}