{"country":"United States","distributed_by":"Warner Bros.","Plot":"On Christmas Eve, the submarine USS Copperfin, under the command of Captain Cassidy (Cary Grant), departs San Francisco on a secret mission. At sea, Cassidy opens his sealed orders, which direct him to proceed first to the Aleutian Islands to pick up meteorologist Raymond (John Ridgely), then to Tokyo Bay to obtain vital weather intelligence for the upcoming Doolittle Raid.Two Japanese planes attack; both are shot down, but one pilot manages to parachute into the water. When Mike (Tom Tully) goes to pick him up, he is stabbed to death. New recruit Tommy Adams (Robert Hutton) shoots the pilot, but because he was slow to react, Tommy blames himself for Mike's death and volunteers to defuse an unexploded bomb stuck under the deck. When Mike is buried at sea, Greek-American Tin Can (Dane Clark) does not attend the service, which angers the other men until he explains that every Allied death causes him great pain. Meanwhile, Raymond, who lived in Japan, discusses how the Japanese people were led into the war by the military faction.As the submarine nears Tokyo Bay, the Copperfin has to somehow negotiate its way through protective minefields. When a Japanese ship enters the bay, Cassidy follows in its wake. That night, a small party goes ashore to make weather observations. Meanwhile, Tommy is diagnosed with appendicitis. Pills, the pharmacist, has to operate following instructions from a book, using improvised instruments. (There were actually a few emergency appendectomies performed in the course of wartime submarine patrols.)Raymond broadcasts the information in Japanese in an attempt to avoid detection, but the Japanese are alerted and search the bay. Fortunately, the Copperfin remains undetected, allowing the men to watch part of the raid through the periscope. After recovering Raymond and his team, the submarine then slips out following an exiting ship. (In reality, no American submarines ever got into the inner part of Tokyo Bay.)Later, the Copperfin sinks an aircraft carrier and is badly damaged by its escorts. In desperation, Cassidy attacks, sending a destroyer to the bottom and enabling the crew to return safely to San Francisco.","language":"English","cinematography":"Bert Glennon","directed_by":"Delmer Daves","narrated_by":"Lou Marcelle","References":"Notes","release_dates":"December 31, 1943 (1943-12-31) (US)|||||","destination_tokyo":"theatrical release poster","produced_by":"Jerry Wald Jack L. Warner","starring":"Cary Grant John Garfield","running_time":"135 minutes","Influence":"The film had some impact: when the crew of a World War II-submarine in the 1951 movie Operation Pacific is given the treat of seeing a submarine-movie, it is this film they are shown. Tony Curtis enlisted in the United States Navy after Pearl Harbor was bombed and war was declared. Having been inspired by Grant's role, he chose submarine duty and served aboard USS Proteus, a submarine tender. The film influenced Ronald Reagan (according to his autobiography) in his decision to accept the lead, as a World War II-submarine captain, in the 1957 movie Hellcats of the Navy. Also, Cary Grant once again starred as a World War II-submarine captain in the 1959 war comedy Operation Petticoat (which inspired a TV series 20 years later). Tony Curtis, who co-starred with Grant in \"Operation Petticoat\", said he had been inspired by watching the star in \"Destination Tokyo\" during the war. The film's screenwriter, Albert Maltz, was later brought before The House Committee on Un-American Activities on the premise that some lines of dialogue in the film reflected Communist sympathies.[1]","music_by":"Franz Waxman William Lava","External links":"","edited_by":"Christian Nyby Vladimir Barjansky","written_by":"Delmer Daves Steve Fisher Albert Maltz"}