{"country":"United States","distributed_by":"Columbia Pictures","Plot":"After a series of country-wide auditions, 12 young dancers gain entry to the American Ballet Academy (which is loosely based on the School of American Ballet). They work hard, attending classes every day for weeks to make them the best dancers they can possibly be, and in preparations for a final dance workshop which will determine the three boys and three girls who will be asked to join the American Ballet Company (which appears to be based on either the American Ballet Theatre or the New York City Ballet). The workshop will also provide an opportunity for the students to showcase their talent to other ballet companies across the country. Gaining a leading part in the workshop is therefore essential.Tensions mount between Jonathan (Peter Gallagher), the company's aging choreographer and director, and Cooper Nielson (Ethan Stiefel), his best dancer, who also wants to choreograph. They also have issues because Kathleen, Cooper's ex-girlfriend and fellow ballet dancer, left him for Jonathan. Star student Maureen (Susan May Pratt), a closet bulimic who seems poised for success, discovers that life is passing her by when she meets a pre-med student who shows her life without ballet. Sweet Jody Sawyer (Amanda Schull), despite body type issues and bad feet, is determined to dance professionally but it appears less and less likely as the movie progresses that she will be good enough. The talented but smart-mouthed Eva (Zoe Saldana) loves to dance but seems destined to be stuck in the back of the corps because of her attitude. Tensions also arise between Charlie (a naturally gifted fellow student) and Cooper. Charlie has a crush on Jody, who had a one-night stand with Cooper and remains infatuated with him.Despite Jonathan's objections, Cooper choreographs a rock music based ballet for the workshop. Three ballets are being presented; Jonathan and another choreographer create the other two respectively—the two more \"traditional\" ballets are not danced to actual ballet music, however. The first is to Mendelssohn's Italian Symphony, while Jonathan's ballet is set to Rachmaninov's 2nd Piano Concerto. Cooper's ballet mirrors the relationship between himself, Jonathan, and Kathleen (and also, though done unconsciously, Jody, Charlie and Cooper). Jody, Charlie, and their gay friend Erik (Shakiem Evans) are set to dance the three lead roles when Erik sprains his ankle in a rehearsal. Cooper then steps in to fill the role, and the tensions between Jody, Charlie and Cooper play out on the stage.After the final workshop, Cooper starts his own dance company – much to Jonathan's chagrin, as Cooper's financial backer is a woman that Jonathan was hoping would donate to his own company. Cooper asks Jody to be a principal dancer as her dancing style, though technically behind, is perfect for the kind of dance he wants in his company. He also asks to date her, but Jody turns him down in favor of Charlie. Maureen decides to give up ballet because she finally realizes that ballet is just something she does well, and not what she wants from life. She decides to attend regular university and also seek help for her eating disorder. Eva is picked by Jonathan to join the prestigious American Ballet Company after proving her worth in the workshop – secretly taking the place of Maureen, who had the lead, in Jonathan's ballet. Jody's boyfriend Charlie, and their friends Anna (a girl who was always favored by Jonathan) and Erik are also asked to join the American Ballet Company, and Sergei (a Russian dancer who also befriended them) joins his girlfriend in the San Francisco Ballet Company.There is a subplot in which Cooper attracts the financial support of a flirtatious wealthy female philanthropist (played by Elizabeth Hubbard). An August 15, 2004 New York Times article entitled \"How Much Is That Dancer in the Program?\" revealed that Stiefel has a very similar real-life sponsorship relationship with a philanthropist named Anka Palitz.","language":"English","Reception":"Center Stage received moderate to negative reviews.The New York Times critic A. O. Scott wrote for the film:Contactmusic.com gave the film just two stars, commenting that:The film currently holds a 43% \"Rotten\" score, on Rotten Tomatoes.[5]The film opened at #6 at the box office making $4,604,621 USD in its opening weekend.[6] The film has grossed a total of $26,385,941 worldwide.[2]","box_office":"$26,385,941[2]","cinematography":"Geoffrey Simpson","directed_by":"Nicholas Hytner","center_stage":"Theatrical release poster","release_dates":"May 12, 2000 (2000-05-12)","Production":"Of the main characters who are dancers, four are professional ballet dancers (Amanda Schull, Ethan Stiefel, Sascha Radetsky, and Julie Kent), one is a professional figure skater (Ilia Kulik), one had ballet training (Zoe Saldana), and two were actors with no ballet training (Susan May Pratt and Shakiem Evans). Body doubles were used for many of the major dance sequences.[citation needed]","produced_by":"Laurence Mark","starring":"Amanda Schull Zoë Saldana Susan May Pratt Peter Gallagher Debra Monk Ethan Stiefel Sascha Radetsky","running_time":"111 minutes","Sequels":"Center Stage: Turn It Up is a direct-to-cable television sequel starring Rachele Brooke Smith. It was first broadcast in the United States on November 1, 2008, on the Oxygen network. The DVD was released in January 2009, by Sony Pictures Home Entertainment.Another direct-to-cable television sequel film, Center Stage: On Pointe, premiered on Lifetime on June 25, 2016. The film features alumni from the first two films mentoring a younger generation of dancers, including Nicole Muñoz and former Dance Moms star Chloe Lukasiak.[7]","music_by":"George Fenton","edited_by":"Tariq Anwar","written_by":"Carol Heikkinen","budget":"$18 million[1]"}