{"based_on":"Casino Royale  by Ian Fleming","Cast":"Casino Royale includes a cameo by British entrepreneur Richard Branson (seen being frisked at Miami International Airport). The cameo was cut out of the in-flight versions shown on British Airways' in-flight entertainment systems, as was a shot of the Virgin Atlantic aircraft Branson supplied.[8]","country":"United Kingdom United States Czech Republic Germany[1]","distributed_by":"Metro-Goldwyn-Mayer Columbia Pictures","screenplay_by":"Neal Purvis Robert Wade|Paul Haggis|","casino_royale":"British theatrical release poster, designed by Empire Design","Plot":"In Prague, James Bond kills traitorous MI6 station chief Dryden and his terrorist contact, thus earning his licence to kill and becoming a 00 agent.In Uganda, the mysterious Mr. White introduces warlord Steven Obanno to Le Chiffre, a French financier of terrorism. Obanno entrusts Le Chiffre with a large sum of money, which Le Chiffre uses to short-sell stock in the aerospace company Skyfleet, thus betting Obanno's money on the company's failure.In Madagascar, Bond pursues bomb maker Mollaka to an African embassy. Bond kills Mollaka and blows up the building. In London, MI6 chief M admonishes Bond for his rashness, and advises him to rethink his future as an agent.Clues from Mollaka point to corrupt Greek official Alex Dimitrios. Bond finds Dimitrios in the Bahamas and pursues him to Miami. Bond kills Dimitrios and follows his henchman to the airport. He thwarts the destruction of Skyfleet's airliner, costing Le Chiffre his investment. To recoup the money, Le Chiffre sets up a high-stakes Texas hold 'em tournament at the Casino Royale in Montenegro. MI6 enters Bond in the tournament, believing a defeat will force Le Chiffre to aid the British government in exchange for protection from his creditors. M tells Bond the stakes: $10 million dollar buy-in, if the player loses all their money, they are allowed to return to the game with a $5 million dollar buy-in, and if they lose all their money again, they can no longer play. On the train to Montenegro, Bond meets Vesper Lynd, a British Treasury agent there to protect the government's $10 million buy-in. Vesper warns Bond that she will not stake him the spare $5 million if she isn't confident in his abilities.In Montenegro, Bond and Vesper meet their MI6 contact, René Mathis. When the tournament begins, Bond appears to have the upper hand. In Le Chiffre's suite, Obanno ambushes him, furious over the loss of his money. Bond engages Obanno, and in an ensuing struggle, kills him and his henchmen. Vesper is traumatized, but Bond comforts her. When the tournament resumes, Bond loses his initial stake, and Vesper refuses to fund further playing, saying that Bond lost the money so quickly, and may lose even more in his hastiness. Frustrated, Bond is about to assassinate Le Chiffre when Felix Leiter, a fellow player and undercover CIA agent, stops him. Agent Leiter recognizes Bond as a fellow spy and realizes that Bond is better card player than him, giving Bond a much better chance to beat Le Chiffre. Leiter offers to give Bond his remaining poker chips in exchange for the CIA getting the credit for apprehending Le Chiffre, to which Bond agrees.Le Chiffre's girlfriend Valenka.poisons Bond's martini. Bond throws up the poison and escapes to his Aston Martin, where he injects an antidote. MI6 instructs him to use the defibrillator, but he finds that one of the wires is disconnected. Vesper saves Bond by connecting the wires and pushing the button. Bond returns to the game, and wins the $150M pot with a straight flush.Le Chiffre captures Vesper and Bond, and reveals that Mathis is working for him. Le Chiffre tortures Bond for the password to the account containing the prize money, but Bond refuses.. As Le Chiffre prepares to castrate Bond, Mr. White bursts in and kills him. Bond awakens in a hospital on Lake Como and Mathis is taken in by MI6. Bond and Vesper fall in love, and he decides to resign from MI6 to be with her.Bond and Vesper travel to Venice. M calls Bond and tells him the money was never deposited, and Bond realizes Vesper has stolen the money. He pursues her and her clients into a building under renovation. In the ensuing struggle, the building is damaged and begins sinking into the Grand Canal. Bond kills Vesper's accomplices and tries to rescue her, but she allows herself to drown as the building sinks. Mr. White, watching nearby, walks away with the money.Bond rejoins MI6, and copes with Vesper's death by renouncing her as a traitor. M informs him the same organisation behind Le Chiffre had kidnapped Vesper's lover, and threatened to kill him unless she became a double agent. During the torture sessions with Le Chiffre, Vesper had made a deal: the money in exchange for Bond's life. Bond discovers a text message left for him by Vesper with Mr. White's name and phone number.At his estate in Lake Como, Mr. White receives a phone call, and is shot in the leg when he answers. Bond strolls into his path holding a machine gun, and introduces himself: \"The name's Bond... James Bond\".","language":"English","Reception":"Critics responded positively to the film, in particular to Craig's performance and credibility. During production, Craig had been subject to debate by the media and the public, as he did not appear to fit Ian Fleming's original portrait of the character as tall, dark and suave.[72] The Daily Telegraph compared the quality of Craig's characterisation of Bond to Sean Connery's and praised the script as smartly written, noting how the film departed from the series' conventions. The Times compared Craig's portrayal of the character to that of Timothy Dalton, and praised the action as \"edgy\",[73] with another reviewer citing in particular the action sequence involving the cranes in Madagascar.[74] Critics Paul Arendt of BBC Films,[75] Kim Newman of Empire,[76] and Todd McCarthy of Variety[77] all described Craig as the first actor to truly embody Ian Fleming's James Bond from the original novel: ironic, brutal and cold.The film was similarly well received in North America. MSNBC gave the movie a perfect 5 star rating.[78] The film was described as taking James Bond \"back to his roots\", similar to From Russia with Love,[79] where the focus was on character and plot rather than the high-tech gadgets and visual effects that were strongly criticised in Die Another Day.[77] Rotten Tomatoes gave the movie an aggregate rating of 95%, the highest rating for a wide-release of the year. It is the fourth-highest rating for a Bond film on the site behind Goldfinger which received a 96%,[80] From Russia with Love which received a 96%,[81] and Dr. No, with a 96% score.[82] Metacritic gave the movie a Metascore of 80, signifying \"generally favorable reviews\".[83] Entertainment Weekly named the film as the fifth best of the series,[84] and chose Vesper Lynd as the fourth best Bond girl in the series.[85] Some newspaper columnists and critics were impressed enough by Craig's performance to consider him a viable candidate for an Academy Award nomination.[86][87][88] Roger Ebert gave the film a four out of four star rating, and wrote that \"Craig makes a superb Bond ... who gives the sense of a hard man, wounded by life and his job, who nevertheless cares about people and right and wrong,\" and that the film \"has the answers to all my complaints about the 45-year-old James Bond series,\" specifically \"why nobody in a Bond movie ever seems to have any real emotions.\"[89] Time Out New York's Joshua Rothkopf called Craig \"the best Bond in the franchise's history,\" citing the actor's \"crisp, hateful, Mamet-worthy snarl ... This is a screwed-up Bond, a rogue Bond, a bounder, a scrapper and, in the movie's astoundingly bleak coda, an openhearted lover.\"[90]Vicky Allan of the Sunday Herald noted Bond himself, and not his love interests, was sexually objectified in this film. A moment where he rises from the sea is reminiscent of Ursula Andress in Dr. No; he feels \"skewered\" by Vesper Lynd's criticism of him; \"and though it would be almost unthinkable now have a female character in a mainstream film stripped naked and threatened with genital mutilation, that is exactly what happens to Bond in [the film].\" So although the film backed off from past criticism of Bond girls being sex objects, \"the once invincible James Bond becomes just another joint at the meat market.\"[91] This sentiment is shared by the University of Leicester's James Chapman, author of License to Thrill, who also notes Craig's Bond is \"not yet the polished article\"; he felt his incarnation of Bond is close to Fleming's because he is \"humourless,\" but is also different because \"Fleming's Bond did not enjoy killing; Craig's Bond seems almost to relish it.\"[92] Andrew Sarris of The New York Observer wrote that this particular Bond film is \"the very first that I would seriously consider placing on my own yearly 10-best list. Furthermore, I consider Daniel Craig to be the most effective and appealing of the six actors who have played 007, and that includes even Sean Connery.\"[93]Roger Moore wrote, \"Daniel Craig impressed me so greatly in his debut outing, Casino Royale, by introducing a more gritty, unrefined edge to the character that I thought Sean might just have to move over. Craig's interpretation was like nothing we'd seen on screen before; Jimmy Bond was earning his stripes and making mistakes. It was intriguing to see him being castigated by M, just like a naughty schoolboy would be by his headmaster. The script showed him as a vulnerable, troubled, and flawed character. Quite the opposite to my Bond! Craig was, and is, very much the Bond Ian Fleming had described in the books – a ruthless killing machine. It was a Bond that the public wanted.\" So impressed was Moore that he chose to buy the DVD.[94] Raymond Benson, the author of nine Bond novels, called Casino Royale \"a perfect Bond film.\"[95]However, the film met with mixed reactions from other critics. Rob Gonsalves of eFilmCritic.com gave the film a positive review, but commented, \"When you strip the 007 films down for action and 'realism,' you lose the soul of those old beloved Bond movies – they might as well be Jason Bourne movies.\"[96] John Beifuss of The Commercial Appeal said, \"Who wants to see Bond learn a lesson about ego, as if he were Greg Brady in his 'Johnny Bravo' phase?\"[97] Anthony Lane of The New Yorker criticised the more imperfect and self-aware depiction of the character, saying, \"Even James Bond, in other words, wants to be 007.\"[98]Though American radio personality Michael Medved gave the film three stars out of four, describing it as \"intriguing, audacious and very original ... more believable and less cartoonish, than previous 007 extravaganzas,\" he commented that the \"sometimes sluggish pacing will frustrate some Bond fanatics.\"[99] Similarly, a reviewer for The Sun praised the film for its darkness and Craig's performance, but felt that \"like the novel, it suffers from a lack of sharpness in the plot\" and believed that it required additional editing, particularly the finale.[100] Commentators such as Emanuel Levy concurred, feeling the ending was too long, and that the film's terrorist villains lacked depth, although he praised Craig and gave the film a B+ overall.[101] Other reviewers responded negatively, including Tim Adams of The Observer who felt the film came off uncomfortably in an attempt to make the series grittier.[102]In December 2006, Casino Royale was named the best film of the year by viewers of Film 2006.[103][104] The sequence with Craig sporting swimming trunks topped the sexiest male celebrity poll of The Sun,[105] and in 2009 Del Monte Foods launched an ice lolly moulded to resemble Craig emerging from the sea.[106] In 2008, Entertainment Weekly named it the 19th best film of the past 25 years.[107]The film appeared on many critics' top ten lists of the best films of 2006.[108]At the 2006 British Academy of Film and Television Arts Awards, Casino Royale won the Film Award for Best Sound (Chris Munro, Eddy Joseph, Mike Prestwood Smith, Martin Cantwell, Mark Taylor), and the Orange Rising Star Award, which was won by Eva Green.[109] The film was nominated for eight BAFTA awards, including the Alexander Korda Award for Best British Film of the Year; Best Screenplay (Neal Purvis, Robert Wade, Paul Haggis); the Anthony Asquith Award for Best Film Music (David Arnold); Best Cinematography (Phil Meheux); Best Editing (Stuart Baird); Best Production Design (Peter Lamont, Simon Wakefield); Best Achievement in Special Visual Effects (Steve Begg, Chris Corbould, John Paul Docherty, Ditch Doy); and Best Actor (Daniel Craig). This made Craig the first actor ever to receive a BAFTA nomination for a performance as James Bond.[110] He also received the Evening Standard British Film Award for Best Actor.[111]Casino Royale won the Excellence in Production Design Award from the Art Directors Guild,[112] and singer Chris Cornell's \"You Know My Name\" won the International Press Academy Satellite Award for Best Original Song.[113] The film was nominated for five Saturn Awards— Best Action/Adventure/Thriller Film, Best Actor (Daniel Craig), Best Supporting Actress (Eva Green), Best Writing (Purvis, Wade and Haggis) and Best Music (David Arnold).[114] The 2006 Golden Tomato Awards named Casino Royale the Wide Release Film of the Year.[115] Casino Royale was also nominated for, and has won, many other international awards for its screenplay,[116] film editing,[117] visual effects,[118] and production design.[119] At the 2007 Saturn Awards, the film was declared to be the Best Action/Adventure/Thriller film of 2006.[120] Several members of the crew were also recipients of 2007 Taurus World Stunt Awards, including Gary Powell for Best Stunt Coordination and Ben Cooke, Kai Martin, Marvin Stewart-Campbell and Adam Kirley for Best High Work.[121]","box_office":"$599 million[2]","cinematography":"Phil Meheux","production_company":"Eon Productions Stillking Films Babelsberg Film","directed_by":"Martin Campbell","release_dates":"14 November 2006 (2006-11-14) (London, premiere)|||||","Production":"Casino Royale was previously produced as a 1954 television episode and a 1967 satirical film. Eon Productions gained the rights to Casino Royale in 1999 after Sony Pictures Entertainment exchanged them for Metro-Goldwyn-Mayer's rights to Spider-Man.[9] In March 2004, Neal Purvis and Robert Wade began writing a screenplay for Pierce Brosnan as Bond, aiming to bring back the flavour of Ian Fleming's original Bond novels.[10] Paul Haggis' main contribution was to rewrite the climax of the film. He explained, \"the draft that was there was very faithful to the book and there was a confession, so in the original draft the character confessed and killed herself. She then sent Bond to chase after the villains; Bond chased the villains into the house. I don't know why but I thought that Vesper had to be in the sinking house and Bond has to want to kill her and then try and save her.\"[11]Director Quentin Tarantino expressed interest in directing an adaptation of Casino Royale,[12] but Eon were not interested. He claims to have worked behind the scenes with the Fleming family, and believed this was the reason why filmmakers finally went ahead with Casino Royale.[13] Tarantino also said, he would have set it in the 1960s and would have only made it with Pierce Brosnan as Bond. In February 2005, Martin Campbell was announced as the film's director.[14] Later in 2005, Sony led a consortium that purchased MGM, allowing Sony to gain distribution rights starting with the film.[15]Eon believed that they had relied too heavily on CGI effects in the more recent films, particularly Die Another Day, and were keen to accomplish the stunts in Casino Royale \"the old fashioned way\".[16] In keeping with this drive for more realism, screenwriters Purvis, Wade and Haggis wanted the script to follow as closely as possible to the original 1953 novel, keeping Fleming's darker storyline and characterisation of Bond.[17]Pierce Brosnan had signed a deal for four films when he was cast in the role of James Bond. This was fulfilled with the production of Die Another Day in 2002. At this stage, Brosnan was approaching his 50th birthday. Brosnan kept in mind fans and critics were not happy with Roger Moore playing Bond until he was 58 and speculation began the producers were seeking to replace Brosnan with a younger actor.[18] Brosnan officially announced he was stepping down in February 2005. At one point, producer Michael G. Wilson claimed there was a list of over 200 names being considered for his replacement.[19] Croatian actor Goran Višnjić auditioned for the role the same day as Craig, but was reportedly unable to master a British accent.[20] New Zealander Karl Urban was considered, but was unable to make the screen test due to filming commitments.[21] According to Martin Campbell, Henry Cavill was the only actor in serious contention for the role, but at 22 years old, was considered too young.[22] Australian actor Sam Worthington and Scottish actor Dougray Scott were also considered.[23]In May 2005, English actor Daniel Craig stated MGM and producers Michael G. Wilson and Barbara Broccoli had assured him he would get the role of Bond, and Matthew Vaughn told reporters MGM offered him the opportunity to direct the new film, but Eon Productions at that point had not approached either of them.[24] A year beforehand, Craig rejected the idea of starring, as he felt the series had descended into formula: only when he read the script did he become interested. Craig read all of Fleming's novels to prepare for the part, and cited Mossad and British Secret Service agents who served as advisors on the set of Munich as inspiring because, \"Bond has just come out of the service and he's a killer. [...] You can see it in their eyes, you know immediately: oh, hello, he's a killer. There's a look. These guys walk into a room and very subtly they check the perimeters for an exit. That's the sort of thing I wanted.\"[25]On 14 October 2005 Eon Productions, Sony Pictures Entertainment and MGM announced at a press conference in London that Craig would be the sixth actor to portray James Bond. A tuxedo-clad Craig boarded a Royal Marines Rigid Raider from HMS Belfast before travelling to HMS President where he was introduced to the world's press.[26][27] Significant controversy followed the decision, with some critics and fans expressing doubt the producers had made the right choice. Throughout the entire production period, Internet campaigns such as \"danielcraigisnotbond.com\" expressed their dissatisfaction and threatened to boycott the film in protest.[28] Craig, unlike previous actors, was not considered by the protesters to fit the tall, dark, handsome and charismatic image of Bond to which viewers had been accustomed.[29] The Daily Mirror ran a front page news story critical of Craig, with the headline, The Name's Bland – James Bland.[30]The next important casting was that of the lead Bond girl, Vesper Lynd. Casting director Debbie McWilliams acknowledged Hollywood actresses Angelina Jolie and Charlize Theron were \"strongly considered\" for the role and Belgian actress Cécile de France had also auditioned, but her English accent \"wasn't up to scratch.\"[31] French actress Audrey Tautou was also considered, but not chosen because of her role in The Da Vinci Code, which was released in May 2006.[32] It was announced on 16 February 2006 French actress Eva Green would play the part.[33]Principal photography for Casino Royale commenced on 3 January 2006 and concluded on 20 July 2006. The film was primarily shot at Barrandov Studios in Prague, with additional location shooting in the Bahamas, Italy and the United Kingdom. The shoot concluded at Pinewood Studios.[34]Michael G. Wilson had stated Casino Royale would either be filmed or take place in Prague and South Africa. However, Eon Productions encountered problems in securing film locations in South Africa.[35] After no other locations became available, the producers had to reconsider their options. In September 2005, Martin Campbell and director of photography Phil Meheux were scouting Paradise Island in the Bahamas as a possible location for the film.[36] On 6 October 2005, Martin Campbell confirmed Casino Royale would film in the Bahamas and \"maybe Italy\". In addition to the extensive location filming, studio work including choreography and stunt co-ordination practice was performed at the Barrandov Studios in Prague, and at Pinewood Studios, where the film used several stages, the paddock tank and the 007 Stage. Further shooting in the UK was scheduled for Dunsfold Aerodrome in Surrey, the cricket pavilion at Eton College (although that particular scene was cut from the completed movie) and the Millbrook Vehicle Proving Ground in Bedfordshire.[29]After Prague, the production moved to the Bahamas. Several locations around New Providence were used for filming during February and March, particularly on Paradise Island. Footage set in Mbale, Uganda, was filmed at Black Park, a Country Park in Buckinghamshire, on 4 July 2006. Additional scenes took place at Albany House, an estate owned by golfers Ernie Els and Tiger Woods.[37] The crew returned to the Czech Republic in April, and continued there, filming in Prague, Planá and Loket, before completing in the town of Karlovy Vary in May. A famous Czech spa, Karlovy Vary[38] was used as the exterior of the Casino Royale, with the Grandhotel Pupp serving as \"Hotel Splendide\".[39] The main Italian location was Venice, where the majority of the film's ending is set. Other scenes in the latter half of the film were shot in late May and early June at the Villa del Balbianello on the shores of Lake Como.[40] Further exterior shooting for the movie took place at properties such as the Villa la Gaeta, near the lakeside town of Menaggio.[29]A recreation of the Body Worlds exhibit provided a setting for one scene in the film. Among the Body Worlds plastinates featured in that scene were the Poker Playing Trio (which plays a key role in one scene) and Rearing Horse and Rider. The exhibition's developer and promoter, German anatomist Gunther von Hagens, also has a cameo appearance in the film,[41] although only his trademark hat is actually visible on screen.In designing the credit sequence for the film, graphic designer Daniel Kleinman was inspired by the cover of the 1953 British first edition of Casino Royale, which featured Ian Fleming's original design of a playing card bordered by eight red hearts dripping with blood. Kleinman said, \"The hearts not only represent cards but the tribulations of Bond's love story. So I took that as inspiration to use playing card graphics in different ways in the titles,\" like a club representing a puff of gun smoke, and slashed arteries spurting thousands of tiny hearts.[42] In creating the shadow images of the sequence, Kleinman digitised the footage of Craig and the film's stuntmen on the Inferno visual effects system, at Framestore CFC in London; the actors' silhouettes were incorporated into more than 20 digitally animated scenes depicting intricate and innovative card patterns. Kleinman decided not to use the female silhouettes commonly seen throughout the Bond title sequences, considering that the women did not fit with both the film's spirit and the storyline following Bond falling in love.[43]For the rest of the film, Chris Corbould, the special effects and miniature effects supervisor, returned to a more realistic style of film making and significantly reduced digital effects. According to Corbould, \"CGI is a great tool and can be very useful, but I will fight to the tooth and nail to do something for real. It's the best way to go\".[34] Three scenes involving primarily physical effects in the film were the chase at a building site in Madagascar, the Miami Airport chase sequence, and the sinking Venetian house, with sets located on the Grand Canal and in Pinewood Studios.[34]First on the schedule were the scenes on the Madagascar building site, shot in the Bahamas on the site of a derelict hotel which Michael G. Wilson had become acquainted with in 1977 during the filming of The Spy Who Loved Me.[34] In the scene, Bond drives a digger toward the building, slamming into the concrete plinth on which Mollaka is running. The stunt team built a model and put forward several ways in which the digger could conceivably take out the concrete, including taking out the pillar underneath. A section of the concrete wall was removed to fit the digger and reinforced with steel.[34]The sequence at Miami International Airport was partly shot at the Dunsfold Aerodrome, in Surrey, which is known from British car show Top Gear, with some footage from the Prague and Miami airports.[34] In filming the scene in which the engine thrust of the moving aircraft blows the police car high into the air, second unit directors Ian Lowe, Terry Madden and Alex Witt used a crane with a strong lead cable attached to the rear bumper of the vehicle to move it up and backwards at the moment of full extension away from the plane.[34]The Skyfleet S570 aircraft in the film was an ex-British Airways 747-200B G-BDXJ which had its engines removed and was modified for its appearance in the film. The modified aircraft had the outboard engines replaced by external fuel tanks, while the inboard engines were replaced by a mock-up pair of engines on each inboard pylon. The cockpit profile was altered to make the 747 look like a prototype of an advanced airliner.[44] The plane used can be seen on the BBC motoring programme Top Gear on the Test Track.The sinking of the Venetian house at the climax of the film featured the largest rig ever built for a Bond film.[34] For the scene involving Bond following Vesper into the house undergoing renovation supported by inflatable balloons, a tank was constructed at the 007 stage at Pinewood, consisting of a Venetian piazza and the interior of the three-story dilapidated house. The rig, weighing some 90 tons, incorporated electronics with hydraulic valves which were closely controlled by computer because of the dynamic movement within the system on its two axes. The same computer system also controlled the exterior model which the effects team built to one-third scale to film the building eventually collapsing into the Venetian canal. The model elevator within the rig could be immersed in 19 feet (5.8 m) of water, and used banks of compressors to strictly regulate movement.[34]At the time of filming, Aston Martin were still in the final phases of designing the DBS. The scene involving the car crash was devised using an Aston Martin DB9 that was especially modified to look like Bond's Aston Martin DBS V12 and reinforced to withstand the impact. Due to the low centre of gravity of the vehicle, an 18-inch (450 mm) ramp had to be implemented on the road tarmac at Millbrook Proving Grounds and Adam Kirley, the stunt driver who performed the stunt, had to use an air cannon located behind the driver's seat to propel the car into a roll at the precise moment of impact. At a speed exceeding 70 mph (113 km/h), the car rotated seven times while being filmed, and was confirmed by the Guinness Book of Records on 5 November 2006 as a new world record.[34]The soundtrack of Casino Royale, released by Sony Classical on 14 November 2006, featured music composed by veteran composer David Arnold, his fourth soundtrack for the Bond film series, while Nicholas Dodd orchestrated and conducted the score. Producers Michael G. Wilson and Barbara Broccoli announced on 26 July 2006 Chris Cornell, then-former lead singer of Soundgarden and former lead singer of Audioslave, composed and would perform the title song, \"You Know My Name\".[45] The song's main notes are played throughout the film as a substitute for the James Bond theme, to represent Bond's youth and inexperience. The classic theme only plays during the end credits to signal the climax of his character arc.[46]","produced_by":"Michael G. Wilson|Barbara Broccoli|","starring":"Daniel Craig|Eva Green|Mads Mikkelsen|Giancarlo Giannini|Jeffrey Wright|Judi Dench|","running_time":"144 minutes","music_by":"David Arnold","edited_by":"Stuart Baird","Release":"Casino Royale premiered at the Odeon Leicester Square, the Odeon West End and the Empire simultaneously in London on 14 November 2006. It marked the 60th Royal Film Performance and benefited the Cinema & Television Benevolent Fund (CTBF), whose patron, Queen Elizabeth II, was in attendance with the Duke of Edinburgh. It is the third James Bond premiere that the Queen attended, following You Only Live Twice and Die Another Day.[47] Along with the cast and crew, numerous celebrities and 5,000 paying guests were also in attendance with half the proceeds benefiting the CTBF.[48]Only two days following the premiere, unlicensed copies appeared for sale in London. \"The rapid appearance of this film on the streets shows the sophistication and organisation behind film piracy in the UK,\" said Kieron Sharp, from the Federation Against Copyright Theft.[49] Infringing copies of the DVD were selling for less than £1.57. Craig himself was offered such a DVD while walking anonymously through the streets of Beijing wearing a hat and glasses to avoid being identified.[50]In January 2007, Casino Royale became the first Bond film ever to be shown in mainland Chinese cinemas. The Chinese version was edited before release, with the reference to the Cold War re-dubbed and new dialogue added during the poker scene explaining the process of Texas hold 'em, as the game is less familiar in China (this addition is reminiscent of dialogue that was added to the 1954 American TV adaptation to explain the rules of baccarat, the game featured in the original book). Casino Royale has earned approximately $11.7 million in China since its opening on 30 January on 468 screens,[51] including a record opening weekend collection for a non-Chinese film, with $1.5 million.[52]After critics dubbed Die Another Day \"Buy Another Day\" because of around 20 product placement deals, Eon limited their promotions for Casino Royale. Partners included Ford Motors, Heineken Pilsener (which Eva Green starred in adverts for), Smirnoff, Omega SA, Virgin Atlantic Airways and Sony Ericsson.[53]The film has earned $599,045,960 worldwide. Casino Royale was the 4th highest-grossing film of 2006, and was the highest-grossing instalment of the James Bond series until Skyfall surpassed it in November 2012.[2]Upon its release in the United Kingdom Casino Royale broke series records on both opening day—£1.7 million[54]—and opening weekend—£13,370,969.[55] At the end of its box office run, the film had grossed £55.4 million, making it the most successful film of the year in the UK,[56] and as of 2011, the tenth highest-grossing film of all time in the country.[57]On its US opening day Casino Royale was on top with $14,741,135, and throughout the weekend grossed a total of $40,833,156, placing it second in the ranking behind Happy Feet ($41.5 million).[58] However, Casino Royale was playing in 370 fewer cinemas and had a better average ($11,890 per cinema, against $10,918 for Happy Feet).[59] It earned $167,445,960 by the end of its run in North America,[2] marking what was at the time the highest grossing film of the series, before being surpassed by Quantum of Solace's $168.4 million.[60]On 18 November 2006 Casino Royale opened at the first position in 27 countries, with a weekend gross of $43,407,886 in the non-UK, Irish, US or Canada markets.[61] The film retained the top spot at the worldwide box office for four weeks.[62]Casino Royale was simultaneously released on DVD, UMD and Blu-ray Disc on 16 March 2007.[63] In the UK, Casino Royale was released on 16 March 2007 on DVD and Blu-ray Disc.[64] The DVD and Blu-ray Disc releases broke sales records: the Region 1 Blu-ray Disc edition became the highest selling high-definition title to date, selling more than 100,000 copies since its release.[65] The region 2 DVD edition achieved the record of fastest selling title for its first-week release. The UK DVD has continued to sell well, with 1,622,852 copies sold since 19 March.[66] A copy of the Blu-ray Disc edition of Casino Royale was given out to the first 500,000 PAL PlayStation 3 owners who signed up to the PlayStation Network.[67] The DVD release includes the official music video for the film, and three documentaries detailing how Daniel Craig was chosen for the role of Bond, the filming, and an expanded version of the Bond Girls Are Forever documentary incorporating new interviews with Casino Royale cast members.A three-disc edition of Casino Royale on DVD was released in the United Kingdom on 31 October 2008, coinciding with the cinema release of the sequel, Quantum of Solace (the following week in the United States). As well as features present from the 2007 release, the collector's edition contains an audio commentary, deleted scenes, featurettes and a storyboard-to-film comparison.[68] A two-disc Blu-ray version also followed in late 2008, featuring additional supplementary materials, enhanced interactivity through BD-Live, and the previous version's 5.1 PCM soundtrack was replaced with a similar 5.1 Dolby TrueHD soundtrack.[69]Casino Royale was censored for its release in Britain, Germany and the United States. In Britain, the film received a BBFC 12 rating after omitting some of Le Chiffre's sadism and James Bond's reactions in the torture scene.[70] In the United States, two fight scenes were censored to achieve a PG-13 rating: the fight between Bond and the traitorous MI-6 agent's contact Fisher, and the fight between Bond and Obanno in the stairway at the Casino Royale.[71] The German edit of the film cuts a sequence where the bomb-planter at the airport breaks a man's neck, instead replacing it with an alternate take.[71] The mainland Chinese cut of the film also trims the torture scene and the stairway fight, as well as a shot of Bond cleaning his wound at the hotel, and a boat scene. The fully uncensored version can be found on the Australian, Dutch, French, Hong Kong, Japanese, and Scandinavian Blu-ray and DVD releases, and on more recent UK releases (rated 15).","budget":"$150 million"}