{"distributed_by":"Metro-Goldwyn-Mayer","Plot":"In Utah, Nancy Breyers (Kelly Lynch) is a defense lawyer who is inexplicably in love with client Michael Bosworth (Mickey Rourke), a sociopathic convict. During a break from a courtroom hearing, Nancy sneaks a gun to Bosworth. After Bosworth snaps a guard's neck, Bosworth and Nancy slip away.Bosworth tears at Nancy's clothing and leaves her behind, where she will tell authorities Bosworth held her at gunpoint during his escape. He speeds off in a car with his brother Wally (Elias Koteas), and their partner, the hulking, half-witted Albert (David Morse), then changes cars with one Nancy has left for him in a remote location.Needing a hideout until Nancy can catch up with them, the three settle on the home of decorated Vietnam veteran Tim Cornell (Anthony Hopkins) and Nora Cornell (Mimi Rogers), who have two kids—15-year-old May (Shawnee Smith) and her 8-year-old brother Zack (Danny Gerard). Their house with the \"For Sale\" sign is picked by Bosworth at random.Tim and Nora are separated due to his infidelity with a younger woman. But when he shows up trying to reconcile with Nora, with whom he is still in love, the two of them find themselves the prisoners of the Bosworth brothers and Albert.Nancy's innocent act does not fool FBI agent Brenda Chandler (Lindsay Crouse), who puts surveillance on her every move. Nancy eventually cuts a deal with Chandler to have charges against her reduced by betraying Bosworth.A friend of the Cornells visits the house by chance, so Bosworth shoots him. An anxiety-ridden Albert decides to go off on his own, and is killed by FBI agents on a river bank.The house is surrounded that night, and Wally is killed in a barrage of FBI bullets. Bosworth holds a gun on Nora and is prepared to use it if Tim interferes. He is unaware that Tim has removed the bullets. Tim drags the criminal outside, where Bosworth ignores the FBI's order to surrender, and is fatally shot.","language":"English","Reception":"The film, directed by Michael Cimino, was a commercial disappointment and received split reviews. Critic and movie historian Leonard Maltin referred to the film this way: \"Ludicrous...With no suspense, an at-times-laughable music score, and Shawnee Smith as a daughter/victim you'll beg to see cold-cocked.\" The film holds a 36% \"rotten\" rating on the reviews aggregation site Rotten Tomatoes based on 11 reviews.[3] Christopher Tookey, reviewing the film for the Sunday Telegraph called Desperate Hours: \"One of those films which should never have been released, even on parole - a danger to itself.\" [4]Mickey Rourke earned a Razzie Award nomination for Worst Actor for his performance in the film (also for Wild Orchid), but lost to Andrew Dice Clay for The Adventures of Ford Fairlane.According to some official sources, Michael Cimino's original cut of Desperate Hours was mutilated by producers, resulting in very badly edited film filled with plot holes. Only known proof of deleted scenes are some stills which show few of them.","box_office":"$2.7 million (US)[2]","cinematography":"Douglas Milsome","production_company":"Dino De Laurentiis Communications","directed_by":"Michael Cimino","release_dates":"October 5, 1990 (1990-10-05)|||||","produced_by":"Michael Cimino|Dino De Laurentiis|","starring":"Mickey Rourke|Anthony Hopkins|Mimi Rogers|Lindsay Crouse|Kelly Lynch|","running_time":"106 minutes","music_by":"David Mansfield","edited_by":"Christopher Rouse|Peter R. Hunt (supervising editor)|","written_by":"Joseph Hayes (novel, play & screenplay)|Lawrence Konner Mark Rosenthal (screenplay)|","budget":"$18 million[1]"}