{"country":"United Kingdom","distributed_by":"Entertainment Film Distributors (UK) IFC Films (US)","screenplay_by":"Piers Ashworth Nick Moorcroft","Plot":"The film opens in Edinburgh. Narration by Angus the Hangman explains how the corpses of the hanged are transported to Dr Robert Knox for dissection. Knox's rival, Dr Alexander Monro, wants the steady supply of cadavers but is forced to rely on severed limbs for dissection. Monro's assistant Charles Darwin arrives with a forged letter directing that all corpses thenceforth must be sent to Monro. Angus tells Knox's assistant, Patterson, the news. Patterson delivers the message to Knox.William Burke and William Hare, immigrants from Ireland, attempt to sell cheese mould as a patent medicine. When their fraud is discovered, they flee to an inn owned by Hare's wife, Lucky. She tells them that one of the lodgers has died. Burke and Hare decide to sell the corpse to Knox. They are forced to break the corpse's spine to fit it into a barrel in order to smuggle it through the city. They stop at a pub along the way, where a young former prostitute, Ginny Hawkins, loudly performs an excerpt from Macbeth. The patrons ignore her. Burke asks her why she did this, and she says that it is her ambition to become an actress. They share a drink; Hare reminds Burke that they must continue to Knox's house.Burke and Hare present the now-mangled corpse to Knox. After some negotiation, Knox agrees to pay them a good sum of money for each corpse they bring him for dissection. Burke plans to use his money to finance Ginny's theatrical ambitions, and Hare decides to open a funeral parlour. Returning to the inn, they find Lucky drunk and barely conscious. Lucky says she is drinking because Joseph, another lodger at the inn, is near death. Not willing to wait for the outcome, Burke and Hare suffocate Joseph and take the body to Knox.Afterward, Burke tells Ginny about the money. She allows him to take her home. Hare meets Fergus, the henchman of villain Danny McTavish, at a bar. Fergus says that McTavish uses him to cheat at games of chance, but keeps all the winnings for himself. Hare details the arrangement with Knox. Fergus relays the information to McTavish.Burke is kidnapped from Ginny's side and bundled into a horse carriage by McTavish and Fergus, whom have already captured Hare. McTavish threatens to kill them unless they give him half the money from Knox. Forced to agree, they are then thrown from the carriage. As they trod back to the inn, they plan a string of murders to make up their losses to McTavish. Lucky becomes suspicious of the mounting death toll, as does Police Captain Tom McLintock. McLintock seeks the advice of Lord Harrington and William Wordsworth, whom give permission to hunt down the criminals and have them hanged.McTavish kidnaps Hare again and attempts to extort the remainder of the money. Shortly afterward, McTavish appears as Knox's next dissection cadaver. McLintock takes notice. He arrests Burke and Ginny, and Hare and Lucky, while both couples are having sex. He tells them that if any one of them confesses to the murders, the others will go free. Burke agrees to confess if he and Ginny can finish what they were doing when McLintock apprehended them.Just before Burke's hanging, Angus advises him to speak if he has any final words. Burke sees Ginny in the crowd, and says, \"I did it for love.\"Onscreen text over the credits describes the fates of all the characters in the story, concluding with an image of the actual skeleton of William Burke at the Anatomical Museum of Scotland.[4]","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 33% of 55 surveyed critics gave the film a positive review; the average rating was 4.8/10.[12] Metacritic rated it 46/100 based on 10 reviews.[13] Nathan Rabin of The A.V. Club rated it B and called it a \"minor but welcome return\" for Landis.[14] Neil Genzlinger of The New York Times described it as \"a ghoulish comedy\" not for nitpickers.[15] Charles Gant of Variety called it an \"amiable, creaky comedy\" that represents \"a step back from the brink.\"[16] Ray Bennett of The Hollywood Reporter wrote that it is \"unpleasant drivel that tries to make fun out of murder.\"[17]","burke_&_hare":"UK release poster","box_office":"$4.3 million[2]","cinematography":"John Mathieson","production_company":"Ealing Studios","directed_by":"John Landis","release_dates":"29 October 2010 (2010-10-29)|||||","Production":"Burke & Hare was developed by Ealing Studios, who had been known for producing acclaimed black comedy films such as Kind Hearts and Coronets and The Ladykillers. John Landis read the screenplay, which piqued his interest in making the film. Landis wanted the film to be similar in style to Ealing's black comedies, as well as to the films of Laurel and Hardy, describing the portrayal of Burke and Hare in this film as an \"evil Laurel and Hardy\".[5]David Tennant was originally cast in the role of William Hare, but left the production before principal photography began; he was replaced by Andy Serkis.[6][7]Many cast members of the sitcom Spaced appear, including Simon Pegg, Jessica Hynes, Bill Bailey, Reece Shearsmith and Michael Smiley.Three actors from the John Landis film An American Werewolf In London appear; Jenny Agutter, David Schofield and John Woodvine.Filming took place around Edinburgh[8] with some scenes also being shot in Stirling, London and at Knole in Kent,[9] and also at Ealing Studios. The script was written by Piers Ashworth and Nick Moorcroft, who previously wrote St. Trinian's, also for Ealing, which was the highest grossing British independent film of the last 10 years.Landis stated:The first official trailer for the film was released on 5 October 2010.[11] It was shown in some UK cinemas before Paranormal Activity 2.It was released on 29 October 2010.[3]","produced_by":"Barnaby Thompson Nigel Green James Spring Paul Brett Tim Smith","starring":"Simon Pegg Andy Serkis Isla Fisher Tom Wilkinson","running_time":"91 minutes[1]","music_by":"Joby Talbot","edited_by":"Mark Everson","budget":"$10 million[citation needed]"}