{"country":"United States","distributed_by":"Columbia Pictures","Legacy":"Slate magazine said the film was a \"rock-star epic, a cartoon movie for and about grown-ups, in both style and substance.\"[8]Michael Barrier, an animation historian, described American Pop as one of two films that demonstrated \"that Bakshi was utterly lacking in the artistic self-discipline that might have permitted him to outgrow his limitations.\"[9]In 2008, director Hype Williams and Kanye West paid tribute to the film in the music video for West's single \"Heartless\", which featured use of rotoscoped animation and references to scenes and backgrounds from the film.[1][10]After attending a Quentin Tarantino FilmFest in April 1999 where Ralph Bakshi's film Coonskin was screened, Ain't It Cool News head writer Harry Knowles wrote that American Pop was his favorite Ralph Bakshi film.[11]On January 12, 2014, at The Egyptian Theatre in Hollywood, California, there was a special screening of American Pop with actors Ron Thompson and Mews Small in attendance,[12] it was the first time lead actor Ron Thompson had ever introduced the film before a live audience.[13]At the Aero Theatre in Santa Monica, California on March 27, 2015, there was a screening of American Pop with director Ralph Bakshi, Ron Thompson and Mews Small attending.[14]","language":"English Hebrew Russian Yiddish","Reception":"The film was a success upon its February 12, 1981, release.[4] Writer Jerry Beck called it \"one of Bakshi's best films\".[6] The film received mixed-to-positive reviews from critics and currently holds 59% on Rotten Tomatoes.[7]","box_office":"$6,000,000","production_company":"Bakshi Productions","directed_by":"Ralph Bakshi","release_dates":"February 13, 1981 (1981-02-13)|||||","Production":"Following the production struggles of The Lord of the Rings, Ralph Bakshi decided that it was time to work on something more personal.[4] He pitched American Pop to Columbia Pictures president Dan Melnick. Bakshi wanted to produce a film with an extensive soundtrack of songs which would be given an entirely new context in juxtaposition to the visuals in a film.[4] While the film does not reflect Bakshi's own experiences, its themes were strongly influenced by individuals he had encountered in Brownsville.[4] The film's crew included character layout and design artist Louise Zingarelli, Vita, Barry E. Jackson, and Marcia Adams, each of whom brought their own personal touch to the film.[4] Bakshi once again used rotoscoping, in an attempt to capture the range of emotions and movement required for the film's story. According to Bakshi, \"Rotoscoping is terrible for subtleties, so it was tough to get facial performances to match the stage ones.\"[4]The rock band Fear appeared in the film, Fear lead singer Lee Ving acted under the name Lee James Jude.[5]Actor Elya Baskin performed in the film in an early role as a tuba player.[5]The score for American Pop was composed by Lee Holdridge. As the result of his reputation as an innovator of adult animation, Bakshi was able to acquire the rights to an extensive soundtrack, including songs by Bob Dylan, Jefferson Airplane, Janis Joplin, The Doors, George Gershwin, The Mamas & the Papas, Herbie Hancock, Lou Reed and Louis Prima, for under US$1 million in permissions fees.[4] Due to music clearance issues, the film was not released on home video until 1998.[6]","produced_by":"Ralph Bakshi Martin Ransohoff","starring":"Ron Thompson Lisa Jane Persky Jeffrey Lippa Richard Singer Marya Small","running_time":"96 minutes","american_pop":"Theatrical release poster","music_by":"Lee Holdridge","Story":"In Imperial Russia during the late 1890s, a rabbi's wife and her young son Zalmie escape to America while the rabbi is killed by the Cossacks. Shortly after their arrival in New York City, Zalmie is recruited by Louie, a performer at a burlesque house, to hand out chorus slips. As Zalmie grows into adolescence, he spends more time with Louie backstage at burlesque shows. When Zalmie's mother dies in the Triangle Shirtwaist Factory fire, he begins working with Louie full-time at a small theatre. Though Zalmie aspires to be a singer, he is beginning to enter puberty and his changing voice becomes a significant obstacle. When World War I strikes, Zalmie travels the globe performing for the troops as the bottom half of a pantomime horse and sustains a wound to his throat, which ends his singing career.When Zalmie returns to New York, he briefly continues performing as a clown, and falls in love with a stripper named Bella, vowing to make her a famous singer and getting involved with mobsters in order to do so. After Zalmie impregnates her, he uses money from mob boss Nicky Palumbo to pay for their wedding. Bella achieves modest success, but she is killed after opening a package containing a bomb intended for Zalmie. Their son, Benny, who is already an introverted child, focuses all of his efforts into becoming a talented jazz pianist. Benny marries Palumbo's daughter at Zalmie's request and enlists to fight in World War II seeking redemption for his family, despite pleas from his father. Benny is killed in Nazi Germany when he stops to play on an abandoned piano and is caught off-guard by a Nazi soldier; Benny begins to play Lili Marleen and the Nazi closes his eyes in bliss, but when the song ends, the Nazi pauses only to thank Benny before riddling him and the piano with gunfire. Benny's wife and son, named Tony, now live in a suburban Long Island town, and they watch as Zalmie testifies against Palumbo on television, calling him a rat.A teenage Tony steals his stepfather's car and drives across the country for four weeks, ending up in Kansas, where he spends the day washing dishes at a diner and spends the night with a waitress. In California, Tony takes another job dishwashing, but soon grows tired of it and quits. A six-piece rock group invites him to write songs for them after hearing him playing harmonica under their doorstep. The band becomes successful but slowly starts to decompose because of the heroin addictions of female lead singer Frankie Heart and Tony himself. Tony becomes addicted to drugs after being hospitalized from falling off a stage while on acid at one of Frankie's shows. Frankie and the band's drummer, Johnny Webb marry, but divorce after two weeks, and Frankie begins an affair with Tony. In Kansas, the band is set to perform after Jimi Hendrix, but Frankie overdoses backstage, and Tony meets a blonde, blue-eyed boy, Little Pete, whom Tony realizes is his son, conceived the night he spent with the waitress.Tony moves back to New York City accompanied by Pete, where he becomes heavily involved with drug dealing. Pete makes a small amount of money playing the acoustic guitar, but Tony takes any money that Pete earns to buy drugs for himself. Tony gives Benny's harmonica to Pete, then takes Pete's guitar to pawn it, telling Pete to wait on a city bench. The next morning, a man approaches Pete and gives him a small package of drugs to sell and tells Pete that Tony said goodbye to him. After years of selling drugs to rock bands, Pete refuses to sell the band members any more cocaine unless they are willing to listen to his music. His talent stuns both the band and the management and they agree to record and hire him on the spot. The film ends with Pete performing in concert with the band, images of his ancestors appearing during his performance.","edited_by":"David Ramirez","written_by":"Ronni Kern"}