{"based_on":"Drum  by Kyle Onstott","country":"United States","distributed_by":"United Artists","screenplay_by":"Norman Wexler","drum":"Theatrical release poster","language":"English","Reception":"Vincent Canby of The New York Times wrote: \"Life on the old plantation was horrendous, I agree, but movies like this are less interested in information than titillation, which, in turn, reflects contemporary obsessions rather more than historical truths.\"[2]","Synopsis":"This film picks up the story 15 years after the events of the first film. Drum (Norton) has been born to a white prostitute (Vega), who raises him with her black lesbian lover (Kelly). Drum grows up to be a fighter and is often forced to bare-knuckle-box other slaves for the entertainment of the owners, one of whom is a gay Frenchman named Bernard DeMarigny (Colicos). DeMarigny wants to sleep with Drum, but his advances are rejected by the slave and DeMarigny vows revenge against Drum. Drum and his friend Blaise (Kotto) are eventually sold to plantation owner Hammond Maxwell (Oates) and are both taken to his plantation to work. Drum's girlfriend Regine (Grier) is purchased by Maxwell as well and is taken to the plantation for his own personal desires.After arriving at Maxwell's plantation, Regine ends up sleeping with Hammond and then with Drum as well. Augusta Chauvel (Lewis) is Maxwell's fiance though and she has other plans for Regine. Maxwell's daughter Sophie (Smith) wants to sleep with Drum, but he won't for fear of being killed. Sophie also attempts to sleep with Blaise and after being rejected, tells her father that Blaise has raped her, which is a lie. Blaise is put in chains and Maxwell decides that he must be castrated for the alleged rape.Meanwhile, a dinner party has been arranged to celebrate the engagement of Maxwell and Chauvel. DeMarigny has been invited to attend the celebration and the guests end up discussing the best way to castrate a slave at the dinner party. While the party is taking place, Drum frees Blaise from his chains and there ends up being a violent uprising from the slaves at the engagement party. DeMarigny shoots Blaise during the fighting and Drum in turn grabs hold of DeMarigny's privates and rips them off. Both slaves and slavers are killed during the battle, but Maxwell, Chauvel and Sophie are all saved by Drum. In appreciation for saving his family, Maxwell sets Drum free and sends him running into the night, which is the final scene of the movie, Drum running away.","cinematography":"Lucien Ballard","production_company":"Dino De Laurentiis Company","directed_by":"Steve Carver","release_dates":"July 30, 1976 (1976-07-30)|||||","Production":"The film was initially being directed by Burt Kennedy, but he was replaced due to creative differences with the executive producer, Dino De Laurentiis. Carver then took over as director with only four days of preparation, the film's print made use of material filmed by both Kennedy and Carver.[3]","produced_by":"Dino De Laurentiis|Raph B. Serpe|","starring":"Warren Oates|Pamela Grier|Ken Norton|","running_time":"110 minutes 100 minutes (UK)","music_by":"Charlie Smalls","edited_by":"Carl Kress"}