{"based_on":"an original treatment by François Truffaut Claude Chabrol (uncredited)","country":"France","distributed_by":"UGC (France, original) StudioCanal (France, 2010 re-release) Films Around The World (USA) Rialto Pictures (USA, 2010 re-release)","Legacy":"Godard said the success of Breathless was a mistake. He added \"there used to be just one way. There was one way you could do things. There were people who protected it like a copyright, a secret cult only for the initiated. That's why I don't regret making Breathless and blowing that all apart.\"[22]Breathless ranked as the No. 15 best film of all time in the British Film Institute's 2002 Sight and Sound Critics' Poll.[23]Breathless ranked as the No. 13 best film of all time in the British Film Institute's 2012 Sight and Sound Critics' Poll.[24]Breathless ranked as the No. 11 best film of all time in the British Film Institute's 2012 Sight and Sound Directors' Poll.[25]","Plot":"Michel (Jean-Paul Belmondo) is a youthful criminal who is intrigued with the film persona of Humphrey Bogart. After stealing a car in Marseille, Michel shoots and kills a policeman who has followed him onto a country road. Penniless and on the run from the police, he turns to an American love interest Patricia (Jean Seberg), a student and aspiring journalist, who sells the New York Herald Tribune on the streets of Paris. The ambivalent Patricia unwittingly hides him in her apartment as he simultaneously tries to seduce her and call in a loan to fund their escape to Italy. Patricia says she is pregnant, probably with Michel's child. She learns that Michel is on the run when questioned by the police. Eventually she betrays him, but before the police arrive she tells Michel what she has done. He is somewhat resigned to a life in prison, and does not try to escape at first. The police shoot him in the street and, after a prolonged death run, he dies “à bout de souffle” (out of breath).Michel's death scene is one of the most iconic scenes in the film, but the film's final lines of dialogue are the source of some confusion for English-speaking audiences. In some translations, it is unclear whether Michel is condemning Patricia, or alternatively condemning the world in general.As Patricia and Detective Vital catch up with the dying Michel, they have the following dialogue:MICHEL: C'est vraiment dégueulasse. PATRICIA: Qu'est-ce qu'il a dit? VITAL: Il a dit que vous êtes vraiment \"une dégueulasse\". PATRICIA: Qu'est-ce que c'est \"dégueulasse\"?[3][4]In the English captioning of the 2001 Fox-Lorber Region One DVD, \"dégueulasse\" is translated as \"scumbag\", producing the following dialogue:MICHEL: It's disgusting, really. PATRICIA: What did he say? VITAL: He said, \"You're a real scumbag\". PATRICIA: What's a scumbag?The 2007 Criterion Collection Region One DVD uses a less literal translation:MICHEL: Makes me want to puke. PATRICIA: What did he say? VITAL: He said you make him want to puke. PATRICIA: What's that mean, \"puke\"?This translation also was used for the 2010 restoration print.","language":"French English","Reception":"According to The New York Times, Breathless is both \"a pop artifact and a daring work of art\" and even at 50, \"still cool, still new, still – after all this time! – a bulletin from the future of movies\".[18] Roger Ebert included it in his list of great movies and said: \"No debut film since Citizen Kane in 1942 has been as influential\", dismissing its jump cuts as the biggest breakthrough, and instead calling revolutionary its \"headlong pacing, its cool detachment, its dismissal of authority, and the way its narcissistic young heroes are obsessed with themselves and oblivious to the larger society.\"[19]As of 1 April 2015[update], the film holds a 97% \"Fresh\" rating on Rotten Tomatoes.[20]","box_office":"$67,464 2,082,760 admissions (France)[1]","cinematography":"Raoul Coutard","directed_by":"Jean-Luc Godard","breathless":"Original release poster","release_dates":"March 17, 1960 (1960-03-17) (France)|||||","Production":"Breathless was loosely based on a newspaper article that François Truffaut read in The News in Brief. The character of Michel Poiccard is based on real-life Michel Portail and his American girlfriend and journalist Beverly Lynette. In November 1952 Portail stole a car to visit his sick mother in Le Havre and ended up killing a motorcycle cop named Grimberg.[6]Truffaut worked on a treatment for the story with Claude Chabrol, but they ended up dropping the idea when they could not agree on the story structure. Godard had read and liked the treatment and wanted to make the film. While working as a Press Agent at 20th Century Fox, Godard met producer Georges de Beauregard and told him that his latest film was shit. De Beauregard hired Godard to work on the script for Pêcheur d'Islande. After six weeks Godard became bored with the script and suggested making Breathless instead. Chabrol and Truffaut agreed to give Godard their treatment and wrote de Beauregard a letter from the Cannes Film Festival in May 1959 agreeing to work on the film if Godard directed it. Truffaut and Chabrol had recently become star directors and their names secured financing for the film. Truffaut was credited as the original writer and Chabrol as the technical adviser. Chabrol later claimed that he only visited the set twice and Truffaut's biggest contribution was persuading Godard to cast Liliane David in a minor role.[7] Fellow New Wave director Jacques Rivette appears in a cameo as the dead body of a man hit by a car in the street.[8]Godard wrote the script as he went along. As well as the real-life Michel Portail, Godard based the main character on screenwriter Paul Gégauff, who was known as a swaggering seducer of women. Godard also named several characters after people he had known earlier in his life when he lived in Geneva.[7] The film includes a couple of in-jokes as well: the young woman selling Cahiers du Cinéma on the street (Godard had written for the magazine), and Michel's occasional alias of László Kovács, the Hungarian-American cinematographer who would become famous for Five Easy Pieces and other films.Jean-Paul Belmondo had already appeared in a few feature films prior to Breathless, but he had no name recognition outside France at the time Godard was planning the film. In order to broaden the film's commercial appeal, Godard sought out a prominent leading lady who would be willing to work in his low-budget film. He came to Jean Seberg through her then-husband, Francois Moreuil, with whom he had been acquainted.[9] Seberg agreed to appear in the film on June 8, 1959, for $15,000, which was one-sixth of the film's budget. Godard ended up giving Seberg's husband a small part in the film.[7] During the production, Seberg privately questioned Godard's style and wondered if the film would be commercially viable. After the film's success, she collaborated with Godard again on the short Le Grand Escroc, which revived her Breathless character.[9]Godard had initially wanted cinematographer Michel Latouche to shoot the film after having worked with him on his first short films. De Beauregard hired Raoul Coutard instead, who was under contract to him.[10]Godard envisaged Breathless as a reportage (documentary), and tasked cinematographer Raoul Coutard to shoot the entire film on a hand-held camera, with next to no lighting.[11] In order to shoot under low light levels, Coutard had to use Ilford HPS film, which was not available as motion picture film stock at the time. He therefore took 18-metre lengths of HPS film sold for 35mm still cameras and spliced them together to 120-metre rolls. During development he pushed the negative one stop from 400 ASA to 800 ASA.[12] The size of the sprocket holes in the photographic film was different from the sprocket holes for motion picture film, and the Cameflex camera was the only camera that would work for the film used.[13]The production was filmed on location in Paris during the months of August and September in 1959,[11] using an Eclair Cameflex. Almost the whole film had to be dubbed in post-production because of the noisiness of the Cameflex camera[14] and because the Cameflex was incapable of synchronized sound.[10]Filming began on August 17, 1959. Godard met his crew at the Café Notre Dame near the Hôtel de Suède and shot for two hours until he ran out of ideas.[15] Coutard has stated that the film was virtually improvised on the spot, with Godard writing lines of dialogue in an exercise book that no one else was allowed to look at.[7] Godard would give the lines to Belmondo and Seberg while having a few brief rehearsals on scenes involved, then filming them. No permission was received to shoot the film in its various locations (mainly the side streets and boulevards of Paris) either, adding to the spontaneous feel that Godard was aiming for.[16] However, all locations were picked out before shooting began and assistant director Pierre Rissient has described the shoot as very organized. Actor Richard Balducci has stated that shooting days ranged from 15 minutes to 12 hours, depending on how many ideas Godard had that day. Producer Georges de Beauregard wrote a letter to the entire crew complaining about the erratic shooting schedule. Coutard says that on a day that Godard had called in sick de Beauregard bumped into the director at a cafe and the two got into a fist fight.[10]Godard shot most of the film chronologically, with the exception of the first sequence, which was shot towards the end of the shoot.[7] Filming at the Hôtel de Suède for the lengthy bedroom scene between Michel and Patricia included a minimal crew and no lights. This location was difficult to secure, but Godard was determined to shoot there after having lived at the hotel after returning from South America in the early 1950s. Instead of renting a dolly with complicated and time-consuming tracks to lay, Godard and Coutard rented a wheelchair for the film that Godard often pushed himself.[10] For certain street scenes Coutard would hide in a postal cart with a hole in it for the lens and stamped packages piled on top of him.[7] Shooting lasted for 23 days and ended on September 12, 1959. The final scene where Michel is shot in the street was filmed on the rue Campagne-Première in Paris.[7]Breathless was processed and edited at GTC Labs in Joinville with lead editor Cécile Decugis and assistant editor Lila Herman. Decugis has said that the film had a bad reputation before its premiere as the worst film of the year.[7]Coutard said that \"there was a panache in the way it was edited that didn't match at all the way it was shot. The editing gave it a very different tone than the films we were used to seeing.\"[10] The film's use of jump cuts has been called innovative. Andrew Sarris analyzed it as existentially representing \"the meaninglessness of the time interval between moral decisions.\"[17] Rissient said that the jump cut style was not intended during the film's shooting or the initial stages of editing.[10]","produced_by":"Georges de Beauregard","starring":"Jean-Paul Belmondo Jean Seberg","running_time":"87 minutes 90 minutes (unrated)","music_by":"Martial Solal","edited_by":"Cécile Decugis Lila Herman","written_by":"Jean-Luc Godard","budget":"FRF400,000"}