{"based_on":"Diary of a Wimpy Kid  by Jeff Kinney","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Jackie Filgo Jeff Filgo|Jeff Judah|Gabe Sachs|","Plot":"As a prank, Rodrick wakes up Greg claiming that it was time for school. It is found that Rodrick tricked Greg and the title sequence begins.The first day of Greg Heffley's middle school ends negatively; in gym, he plays Gladiator with other wimps, he learns about the Cheese Touch which is a rotten piece of cheese on the basketball court that one day Darren Walsh touched and the Cheese Touch begins. It all ends when Dieter Muller takes the Cheese Touch with him, discovers the ups and downs to the school, such as no stall doors in the boys' bathroom, and Greg and his best friend Rowley Jefferson (Robert Capron) eat on the floor, and at the end of the day, Rowley unintentionally embarrasses both boys. Greg looks through Rodrick's yearbook at home and Rodrick catches them, intending to \"kill\" Greg. The next day, Greg signs up for wrestling to become extremely popular, which results in two humiliating defeats joining the wrestling team by a weird, low popular kid named Fregley (Grayson Russell) and his arch-enemy Patty Farrell (Laine MacNeil). On Halloween, the two boys encounter teenagers while trick or treating, and they are drenched with water. Rowley's shield (part of his Halloween costume) blocks assumed 95% of the water. Nevertheless, Greg says he will call the cops. This causes the teenagers to chase them to his Grandma's house. The teens further chase them to the Devil Worshipper Woods, which Rodrick warned them about before the duo left to trick or treat. Some time later on, Greg makes it an effort to make Rowley popular by changing his style of clothing and looks, and how he wears a backpack.The boys join Safety Patrol in an effort to become popular; and they try out for a contest that offers a student a chance to become the new cartoonist for the school paper. Rowley fractures his arm during winter due to a game the boys played, and Rowley gets extremely popular, and wins the contest, causing Greg to become more jealous. At Safety Patrol, Rowley is unable to serve due to his injury; and Greg serves by himself but discovers a truck identical to the teenagers' from Halloween. In panic, he hides the kids in a construction zone and the neighbor spots Greg, mistaking him as Rowley due to the coat Greg's wearing; and the truck belongs to someone else. Rowley is soon banned inadvertently, but Greg decides to expose himself; causing an argument between them, in which Rowley states they aren't friends anymore. Rowley snitches, further parting the duo. Greg decides to pursue popularity without Rowley by joining the school play. At tryouts, Greg uses a wonderful soprano, prompting the music teacher to cast him as Dorothy; however Patty threatens the teacher into casting her as Dorothy. Chirag, (Karan Brar) tells him he could sign up as a tree to bean Patty with apples. During rehearsal, Greg is told he doesn't throw apples, and sings instead. He doesn't sing due to his brother Rodrick (Devon Bostick) videotaping him, and Greg throws apples at Patty; causing the play to end. Getting upset about the circumstances the year has become for Greg, he gets his brother Rodrick banned but fails to reconcile with Rowley.One day at school, Rowley and Greg confront each other, and catches attention to the rest of the school. Patty and the kids force Greg and Rowley to fight each other; however, none of them aren't good at fighting. The Halloween teenagers arrive at the scene and forces the school to flee, but catches Rowley and Greg. They force Rowley to eat the cheese, giving him the Cheese Touch; but as Greg is about to eat it, the gym teacher and the school comes out and forces them to flee. Greg with a change of heart covers up for Rowley by saying he ate the Cheese, which mends their friendship. However, the school then thinks that Greg has the Cheese Touch.Yearbooks eventually come, and Greg's popularity didn't succeed the way he planned, but that he and Rowley had some sort of representation; as they make the Class Favorites page as \"Cutest Friends.\"","language":"English","Reception":"Reviews of Diary of a Wimpy Kid have been mixed. Review aggregator site Rotten Tomatoes, based on 101 reviews, gives the film an approval rating of 53%. The consensus given is: \"Unlike its bestselling source material, Diary of a Wimpy Kid fails to place a likable protagonist at the center of its middle-school humor – and its underlying message is drowned out as a result.\"[12] It also holds a \"mixed or average\" rating of 56 at Metacritic, based on 26 reviews.[13] Roger Ebert gave the film three-and-a-half stars out of four, writing \"It's nimble, bright and funny. It doesn't dumb down. It doesn't patronize. It knows something about human nature.\"[14] Glenn Whipp of the Associated Press was less positive, saying, \"In transferring the clean, precise humor of Kinney's illustrations and prose to the big-screen, the material loses just a bit of its charm.\"[15] At the Movies host David Stratton gave the film one star while co-host Margaret Pomeranz gave it half a star. Stratton called the film \"tiresome\" and said there was \"nothing remotely interesting in Thor Freudenthal's direction or the screenplay.\" Pomeranz disliked the character of Greg Heffley, saying \"I really thought he was unpleasant. I did not want to spend time with him. I could not wait for the end of this film.\"[16]The film opened in second place at the weekend box office grossing $22.1 million, behind Alice in Wonderland.[17]Despite a lack of distinctive marketing, Diary of a Wimpy Kid drew a decent crowd, opening to $22.1 million on approximately 3,400 screens at 3,077 sites, notably beating out the heavily hyped The Bounty Hunter. It was the biggest start ever for a non-animated, non-fantasy children's book adaptation. Diary of a Wimpy Kid grossed more in its first three days than other film adaptions to children's novels like How to Eat Fried Worms and Hoot grossed in their entire runs.[17] The film grossed $63,003,625 in North America and $11,695,602 in other territories for a worldwide total of $75,699,227.[18]","box_office":"$75.7 million[2]","cinematography":"Jack N. Green","production_company":"Color Force Dune Entertainment","directed_by":"Thor Freudenthal","Soundtrack":"The soundtrack was released by La La Land Records with special thanks to the records labels of the featured artists; Universal Motown Records, Capitol Records, B-Unique Records, Columbia Records, XL Recordings, Rough Trade, Beautiful Bomb Records, Chrysalis Records, Stick Music and Gordy Records.[9]","narrated_by":"Zachary Gordon","release_dates":"March 19, 2010 (2010-03-19)|||||","Production":"Filming of Diary of a Wimpy Kid wrapped up on October 16, 2009.The official trailer for Wimpy Kid was released virally on January 21, 2010 and was shown in theaters with Tooth Fairy.[6] A poster for the film was released shortly after. Another trailer was shown with Percy Jackson & the Olympians: The Lightning Thief.[7]The official Facebook account for Wimpy Kid had uploaded three clips from the film, as of March 1, 2010.[8] In the United Kingdom and Ireland the film was released in cinemas on August 25, 2010.","Distribution":"A tie-in book, written by Kinney, called The Wimpy Kid Movie Diary was published on March 16, 2010, by Amulet Books (an imprint of Abrams Books). It includes film stills, storyboards, preliminary concept drawings, and also behind the scenes information to humorously chronicle the making of the film. It also includes some new illustrations.[10][11]The film was released on DVD and Blu-ray on August 3, 2010. The Blu-ray Version features six pages from Rowley's diary, Diary of an Awesome, Friendly Kid.","produced_by":"Nina Jacobson|Brad Simpson|","starring":"Zachary Gordon|Robert Capron|Rachael Harris|Steve Zahn|","running_time":"94 minutes","music_by":"Theodore Shapiro","edited_by":"Wendy Greene Bricmont","diary_of_a_wimpy_kid":"Theatrical release poster","budget":"$15 million[1]"}