{"country":"Denmark","distributed_by":"Fine Line Features","Critical response":"Reaction to Dancer in the Dark was polarized. For example, on The Movie Show, Margaret Pomeranz gave it five stars while David Stratton gave it a zero, a score shared only by Geoffrey Wright's Romper Stomper (1992).[14][15] Stratton later described it as his \"favourite horror film\".[16] Peter Bradshaw of The Guardian said it was \"one of the worst films, one of the worst artworks and perhaps one of the worst things in the history of the world.\"[17] The response is reflected in the film's official website, which posts both positive and negative reviews on its main page.[18] The diverse reviews result in an overall \"Fresh\" rating; 68% grade on the review aggregator website Rotten Tomatoes.[19]The film was praised for its stylistic innovations. Roger Ebert of the Chicago Sun-Times stated: \"It smashes down the walls of habit that surround so many movies. It returns to the wellsprings. It is a bold, reckless gesture.\"[20] Edward Guthmann from the San Francisco Chronicle wrote, \"It's great to see a movie so courageous and affecting, so committed to its own differentness.\"[21]However, criticism was directed at its storyline. Jonathan Foreman of the New York Post described the film as \"meretricious fakery\" and called it \"so unrelenting in its manipulative sentimentality that, if it had been made by an American and shot in a more conventional manner, it would be seen as a bad joke.\"[22]","dancer_in_the_dark":"US theatrical release poster","Plot":"The film is set in Washington state in 1964 and focuses on Selma Ježková (Björk), a Czech immigrant who has moved to the United States with her son, Gene Ježek (Vladica Kostic). They live a life of poverty as Selma works at a factory with her good friend Kathy (Catherine Deneuve), whom she nicknames Cvalda. She rents a trailer home on the property of town policeman Bill Houston (David Morse) and his wife Linda (Cara Seymour). She is also pursued by the shy but persistent Jeff (Peter Stormare), who also works at the factory.Selma suffers from a degenerative eye condition and because of this is losing her vision. She has been saving up to pay for an operation which will prevent her young son from suffering the same fate. To escape the misery of her daily life, Selma accompanies Kathy to the local cinema where together they watch fabulous Hollywood musicals (or more accurately, Selma listens as Cvalda describes them to her, to the annoyance of the other theater patrons, or acts out the dance steps upon Selma's hand using her fingers).In her day-to-day life, when things are too boring or upsetting, Selma slips into daydreams or perhaps a trance-like state where she imagines the ordinary circumstances and individuals around her have erupted into elaborate musical theater numbers. These songs use some sort of real-life noise (from factory machines buzzing to the sound of a flag rapping against a flag pole in the wind) as an underlying rhythm. Unfortunately, Selma slips into one such trance while working at the factory. Soon Jeff and Cvalda begin to realize that Selma can barely see at all. Additionally, Bill reveals to Selma that his materialistic wife Linda spends more than his salary, there is no money left from his inheritance, and he is behind in payments and the bank is going to take his house. He asks Selma for a loan, but she declines. He regrets telling Selma his secret. To comfort Bill, Selma reveals her secret blindness, hoping that together they can keep each other's secret. Bill then hides in the corner of Selma's home, knowing she can't see him, and watches as she puts some money in her kitchen tin.The next day, after having broken her machine the night before through careless error, Selma is fired from her job. When she comes home to put her final wages away she finds the tin is empty; she goes next door to report the theft to Bill and Linda only to hear Linda discussing how Bill has brought home their safe deposit box to count their savings. Linda additionally reveals that Bill has \"confessed\" his affair with Selma, and that Selma must move out immediately. Knowing that Bill was broke and that the money he is counting must be hers, she confronts him and attempts to take the money back. He draws a gun on her, and in a struggle he is wounded. Linda discovers the two of them and, assuming that Selma is attempting to steal the money, runs off to tell the police at Bill's command. Bill then begs Selma to take his life, telling her that this will be the only way she will ever reclaim the money that he stole from her. Selma shoots at him several times, but due to her blindness manages to only maim Bill further. In the end, she performs a coup de grâce with the safe deposit box. In one of the scenes, Selma slips into a trance and imagines that Bill's corpse stands up and slow dances with her, urging her to run to freedom. She does, and takes the money to the Institute for the Blind to pay for her son's operation before the police can take it from her.Selma is caught and eventually put on trial. It is here that she is pegged as a Communist sympathizer and murderess. Although she tells as much truth about the situation as she can, she refuses to reveal Bill's secret, saying that she had promised not to. Additionally, when her claim that the reason she didn't have any money was because she had been sending it to her father in Czechoslovakia is proven false, she is convicted and given the death penalty. Cvalda and Jeff eventually put the pieces of the puzzle together and get back Selma's money, using it instead to pay for a trial lawyer who can free her. Selma becomes furious and refuses the lawyer, opting to face the death penalty rather than let her son go blind, but she is deeply distraught as she awaits her death. Although a sympathetic female prison guard named Brenda tries to comfort her, the other state officials show no feelings and are eager to see her executed. Brenda encourages Selma to walk. On her way to the gallows, Selma goes to hug the other men on death row while singing to them. However, on the gallows, she becomes terrified, so that she must be strapped to a collapse board. Her hysteria when the hood is placed over her face delays the execution. Selma begins crying hysterically and Brenda cries with her, but Cvalda rushes to inform her that the operation was successful and that Gene will see. Relieved, Selma sings the final song on the gallows with no musical accompaniment, although she is hanged before she finishes. A curtain is then drawn in front of her body, while the missing part of the song shows on the screen: \"They say it's the last song/They don't know us, you see/It's only the last song/If we let it be.\"","language":"English","box_office":"$45.6 million[3][4]","cinematography":"Robby Müller","production_company":"Zentropa Entertainments Canal+ FilmFour France 3 Cinéma","directed_by":"Lars von Trier","Awards":"Dancer in the Dark premiered at the 2000 Cannes Film Festival and was awarded the Palme d'Or, along with the Best Actress award for Björk.[23] The song \"I've Seen It All\" was nominated for an Oscar for best song, at the performance of which Björk wore her famous swan dress.Sight & Sound magazine conducts a poll every ten years of the world's finest film directors to find out the Ten Greatest Films of All Time. This poll has been going since 1952, and has become the most recognised[24] poll of its kind in the world. In 2012[25] Cyrus Frisch voted for \"Dancer in the Dark\". Frisch commented: \"A superbly imaginative film that leaves conformity in shambles.\"","release_dates":"17 May 2000 (2000-05-17) (Cannes)|8 December 2000 (2000-12-08)||||","Production":"The film's title suggests the Fred Astaire/Cyd Charisse duet \"Dancing in the Dark\" from the 1953 film The Band Wagon, which ties in with the film's musical theatre theme.Actress Björk, who is known primarily as a contemporary composer, had rarely acted before, and has described the process of making this film as so emotionally taxing that she would not appear in any film ever again[8][9] (although in 2005, she appeared in Matthew Barney's Drawing Restraint 9). She had disagreements with the director over the content of the film, wanting the ending to be more uplifting.[citation needed] She later called von Trier sexist.[10] Deneuve and others have described her performance as feeling rather than acting.[11] Björk has said that it is a misunderstanding that she was put off acting by this film; rather, she never wanted to act but made an exception for Lars von Trier.[12]The musical sequences were filmed simultaneously with over 100 digital cameras so that multiple angles of the performance could be captured and cut together later, thus shortening the filming schedule.Björk lies down on a stack of birch logs during the \"Scatterheart\" sequence. In Icelandic, Faroese, and Swedish, \"Björk\" means \"birch.\"A Danish MY class locomotive (owned by Swedish train operator TÅGAB) was painted in the American Great Northern scheme for the movie, and not repainted afterward.[13] A T43 class locomotive was repainted too, though never used in the film.","produced_by":"Peter Aalbæk Jensen|Vibeke Windeløv|","starring":"Björk|Catherine Deneuve|David Morse|Peter Stormare|Jean-Marc Barr|Joel Grey|","running_time":"140 minutes[1][2]","Style":"Much of the film has a similar look to von Trier's earlier Dogme 95-influenced films: it is filmed on low-end, hand-held digital cameras to create a documentary-style appearance. It is not a true Dogme 95 film, however, because the Dogme rules stipulate that violence, non-diegetic music, and period pieces are not permitted. Trier differentiates the musical sequences from the rest of the film by using static cameras and by brightening the colours.","music_by":"Björk","edited_by":"François Gédigier|Molly Marlene Stensgård|","written_by":"Lars von Trier","budget":"USD$12.5 million[3] (120 million kr)"}