{"daffy_duck's_fantastic_island":"Looney Tunes and Merrie Melodies (Daffy Duck) compilation series","studio":"Richard H. Thomas","Availability":"The movie is available as a download from the iTunes Store. In 2011, it was made available on Netflix. It was later released exclusively through Wal-Mart on August 12, 2014. After many years of waiting, the movie was finally released on DVD by Warner Home Video on November 18, 2014.","distributed_by":"Warner Bros. Animation","story_by":"Friz Freleng Hal Geer Jean MacCurdy","voices_by":"John Dunn Dave Detiege Friz Freleng","layouts_by":"Brenda Banks Warren Batchelder Bob Bransford Brad Case Terry Lennon Bob Matz Norman McCabe Sam Nicholson Derry Ray","Plot":"The premise of the framing animation was a general parody of the popular 1970s/1980s television series Fantasy Island, with Daffy and Speedy playing caricatures of that series' principal characters, Mr. Roarke and Tattoo (respectively). They even wear the white suits worn on that show by Mr. Roarke and Tattoo.The pair, stranded on a desert island for months with nothing on it but a coconut tree (and Daffy sick and tired of eating coconuts), discover a treasure map which leads them to a magical, talking wishing well (voiced by Les Tremayne). The greedy Daffy proposes to use the power of the well, which obeys the commands of whoever holds the map, to make himself and Speedy rich by selling wishes for a hefty fee, and has the well transform the island into a tourist paradise. (This showcases the modern Daffy's short-sightedness along with his greed, as he could have easily used the well himself to wish for all the wealth he desired). As various Looney Tunes characters step up for their chance at the well, their wishes are fulfilled through the events of a classic Looney Tunes cartoon.Meanwhile, Yosemite Sam, cast as a pirate, and his first mate, the Tasmanian Devil, search for the map, which originally belonged to them (they had earlier lost their ship in a battle with Bugs Bunny). They find out that someone who took the Map has black feathers. Eventually, the map is lost to all after a chase leading up to a volcano, and Daffy, Speedy, Sam, and Taz end up trapped on the once-again-deserted island. The well gives them three wishes individually, but warns them to use them wisely for they are the last wishes it will ever grant. After Daffy and Speedy waste their wishes -Speedy wishing for a burrito, then Daffy angrily responding by wishing the burrito was stuck on the end of Speedy's nose (an obvious reference to The Ridiculous Wishes)- Daffy asks Sam to wish the burrito off Speedy's nose, but discovers that Sam already wished for a ship, abandoning Daffy and telling them after he sinks Bugs, he'll come back and pick the pair up. Daffy (now furious) then shouts \"You're Desthspicable!\" at Sam and Taz. The film concludes with the wishing well doing the famed \"That's all, folks!\" sign-off.","color_process":"August 5, 1983","Classic cartoons in order":"The following includes the Well's descriptions of each cartoon in relation to that character's wish.","animation_by":"Robert J. Walsh Carl Stalling (classic cartoons) Milt Franklyn (classic cartoons) Eugene Poddany (classic cartoons) William Lava (classic cartoons)","language":"78 min","directed_by":"Poster","followed_by":"Bugs Bunny's 3rd Movie: 1001 Rabbit Tales","backgrounds_by":"Bob Givens Michael Mitchell","release_date(s)":"Warner Bros.","preceded_by":"English","produced_by":"Friz Freleng","running_time":"Color","music_by":"Mel Blanc June Foray Les Tremayne","Merchandise":"In 1981 a puzzle showing 105 Looney Tunes characters has been issued. Among characters there are three ones that never appeared in animation, identified as Hoppy, Hysterical Hyram and Minniesoda Fats. In one scene in Daffy Duck's Fantastic Island Hoppy and Hysterical Hyram are seen waiting for their chance to make their dreams come true (along with two other unidentified characters, namely white dog and a small mouse with a hat). It is their only known appearance in animation.[2]"}