{"based_on":"Thunderstorm  by Cao Yu","country":"China","Awards and nominations":"Curse of the Golden Flower won four awards out of 14 nominations from the 26th Hong Kong Film Awards in 2007.","distributed_by":"Sony Pictures Classics","language":"Mandarin","box_office":"$78,568,977","cinematography":"Zhao Xiaoding","production_company":"Edko Film","curse_of_the_golden_flower":"Theatrical release poster","directed_by":"Zhang Yimou","release_dates":"December 21, 2006 (2006-12-21)|||||","running_time":"114 minutes","Release":"The US release garnered a generally positive reception (although tepid comparing to the director's past works).Richard Corliss of Time magazine praised the film's lurid operatic aspect and states: \"this is high, and high-wire, melodrama...where matters of love and death are played at a perfect fever pitch. And grand this Golden Flower is.\"[8] Jeannette Catsoulis of The New York Times states: \"In Curse of the Golden Flower Mr. Zhang achieves a kind of operatic delirium, opening the floodgates of image and melodrama until the line between tragedy and black comedy is all but erased.\"[9] Kevin Thomas of the Los Angeles Times describes the film as: \"A period spectacle, steeped in awesome splendor and lethal palace intrigue, it climaxes in a stupendous battle scene and epic tragedy\" and \"director Zhang Yimou's lavish epic celebrates the gifts of actress Gong Li while weaving a timeless tale of intrigue, corruption and tragedy.\"[10] Andrew O'Hehir of Salon states: \"the morbid grandiosity of Curse of the Golden Flower is its own distinctive accomplishment, another remarkable chapter in the career of Asia's most important living filmmaker.\"[11]Stephen Hunter of The Washington Post writes: \"Zhang Yimou's Curse of the Golden Flower is a kind of feast, an over-the-top, all-stops-pulled-out lollapalooza that means to play kitschy and grand at once\" and Hunter further states: \"It's just a great old wild ride at the movies.\"[12]On the other hand, Matt Brunson of Creative Loafing feels that the film was a poor reflection of director Zhang Yimou's acclaimed works of the past.[13] Bruce Westbrook of The Houston Chronicle though praising the film's spectacular visuals, states \"Visuals alone can't make a story soar, and too often this one becomes bogged down by spectacle...\"[14] Kirk Honeycutt of The Hollywood Reporter states the film is \"A disappointing misfire from a great director.\"[15] Gene Seymour of Newsweek states: \"Curse of the Golden Flower is to the feudal costumed adventure what Nicholas Ray's Johnny Guitar is to the Western. Both bend their genres to the extremes of operatic grandeur with such force as to pull up just below the level of High Camp.\"[16] However Seymour states in the end that the film is overly melodramatic and ludicrous to absorb.[16]The film received a score of 70 out of 100 from film critics according to the review aggregator Metacritic[17] and holds an average rating of 66% by film critics on the review ranking site Rotten Tomatoes.[18] Yahoo! Movies gave the film a B grade based on critical consensus.[19] It has grossed over $78 million worldwide.[20] It was also the third highest grossing non-English language film in 2006 after Apocalypto and Pan's Labyrinth.[21]","budget":"$45 million","mandarin":"Mǎnchéng Jìndài Huángjīnjiǎ","Plot":"Golden flowers fill the imperial palace on the eve of Zhong Yang. The Emperor (Chow Yun-fat) returns from his campaign with his second son, Prince Jai (Jay Chou), in order to celebrate with his family.For three years, the Empress (Gong Li) has had an affair with her stepson, Crown Prince Wan (Liu Ye), who was born from the Emperor's first wife. Crown Prince Wan is not interested in the throne and wishes to run away with his secret lover, Jiang Chan (Li Man), the daughter of the Imperial Doctor. Meanwhile, Prince Jai, the Emperess's first son, becomes worried over the Empress's ill health and wonders why she has an attraction to golden flowers. The Empress reveals that she is planning to overthrow the Emperor, who has been poisoning her. Prince Jai agrees to lead the Empress's soldiers.The Empress hires a mysterious woman to find out the poison's species. She is successful and reveals that it is Persian Black Fungus, but right after, Crown Prince Wan captures the woman and takes her to the Emperor. The woman identifies herself as Jiang Shi (Chen Jin), the wife of the Imperial Doctor and the former wife of the Emperor. Before ascending to the throne, the Emperor had her and her family assassinated and she was left for dead years ago and now hates the Emperor's regime. The Emperor decides not to punish her and she reunites with her husband and daughter. The Emperor also decides to promote the doctor to governor of the nearby province of Suzhou, so the doctor and his family pack their things and set out.Crown Prince Wan is sad that the doctor's daughter is leaving. He runs after their convoy and speaks to her, and learns that the Empress has woven ten thousands of scarves adorned with chrysanthemum motifs, sending them to a general of the imperial army afterwards. Fearing that this might mark the beginning of some conspiracy, Wan hurries back to the palace and confronts the Empress, who confesses that she is planning a coup d'état. Out of shock and anguish, Crown Prince Wan stabs himself with a dagger and is placed under care.The doctor's family is betrayed and attacked by the Emperor's assassins. His servants and soldiers loyally try to fight them, but the doctor is killed. The doctor's wife and daughter flee on horseback and head for the palace. When the two of them arrive at the palace, they interrupt the Chrysanthemum ceremony and demand that the Emperor answer why he wants them killed. The Emperor is reluctant to answer, and the Empress interrupts and reveals to everyone that the doctor's wife is the same woman who bore Crown Prince Wan, which means that the doctor's daughter and Crown Prince Wan were half-siblings all this time. The doctor's daughter screams upon hearing this and flees the palace, where she and her mother are promptly cut down by more assassins.Suddenly, the youngest son, Prince Yu, abruptly kills Crown Prince Wan with a sword, and he summons a group of his own soldiers to kill the Emperor and take the throne. He reveals that he knew about the Empress's affair and has been planning to supplant the Emperor. However, more of the Emperor's assassins descend from the ceiling and easily kill Prince Yu's soldiers. The Empress simply leaves the room as the Emperor proceeds to beat Prince Yu to death with his belt.Meanwhile, ten thousand soldiers wearing golden armor and golden chrysanthemum emblems storm the palace with Prince Jai leading them. It happens that Prince Jai, who excused himself from the ceremony, has chosen this very evening to start the rebellion. They easily overpower the Emperor's assassins and advance into the palace's inner square, trampling the golden flowers laid out for the ceremony. However, massive silver shields block their way in, and thousands of silver-armored archers appear on the walls surrounding them. The golden soldiers initially try to fight, but the wall of silver shields is impenetrable, and they are forced to retreat. They find the gates behind them blocked, and are shot down to the last man. The Emperor actually had full knowledge of the plot because Crown Prince Wan told him, and he set the trap beforehand.Prince Jai rises from the sea of dead bodies and is taken captive by the Emperor's soldiers. Behind him, the courtyard is cleaned up with mechanical efficiency by a legion of servants, with bodies being removed, floors being scrubbed and laid with carpets, and pots of yellow chrysanthemums replaced, making it seem as if the entire failed rebellion never even happened. At midnight, the Chrysanthemum Festival begins as scheduled.The Emperor speaks with Prince Jai and the Empress at the terrace's ceremonial table (the seats of the deceased Prince Yu and Crown Prince Wan remain unoccupied). Prince Jai is offered forgiveness on the condition that every day, he should personally serve the poisoned medicine to the Empress. Prince Jai refuses, apologizes to his mother for the rebellion's failure, and kills himself with a sword, letting his blood spill into the medicine in the process. The poisoned cup is still offered to his mother; horrified at the sight of her son's blood in the cup, she shrieks and slaps it away. The film ends as the spilled medicine is shown instantly corroding the table's engraved wooden chrysanthemum.","Title":"The Chinese title of the movie is taken from the last line of a Qi dynasty poem written by the rebel leader Huang Chao who was also the Emperor of the Qi Dynasty that was at war with the Later Tang Dynasty. Huang Chao had composed the poem \"On the Chrysanthemum, after failing the Imperial Examination\" (不第後賦菊/不第后赋菊) or simply \"Chrysanthemum\":Due to the film's high profile while it was still in production, its title, which can be literally translated as \"The Whole City is Clothed in Golden Armor\", became a colorful metaphor for the spring 2006 sandstorms in Beijing and the term \"golden armor\" (黄金甲, huángjīnjiǎ) has since become a metaphor for sandstorms among the locals.[5]","traditional":"滿城盡帶黃金甲","Soundtrack":"Besides starring in the film, Jay Chou has also recorded two songs to accompany the film, one titled \"Chrysanthemum Terrace\" (Chinese: 菊花台; pinyin: Júhuā tái), released on his 2006 album Still Fantasy and one included in his Curse of the Golden Flower (EP). The EP includes Jay Chou's song \"Golden Armor\" (Chinese: 黄金甲; pinyin: Huángjīn jiǎ).","simplified":"满城尽带黄金甲","Historical perspective":"The screenplay is based on Thunderstorm, a renowned Chinese play written by Cao Yu in the 1930s.[6]The English language version states that this movie is set in the \"Tang dynasty\" in the year 928. The Chinese version doesn't specify a time period. The film's published screenplay indicates it is set during Later Shu of the Five Dynasties and Ten Kingdoms period.[7] Neither the Tang dynasty (618–907) nor Later Shu (934–965) existed in the year 928, although another state named \"Tang\" — known as Later Tang in history — was, as well as other Chinese states Wu, Chu, Min, Southern Han, Jingnan and Wuyue, in addition to the Khitan-ruled Liao dynasty (known as just Khitan in 928). However, Later Tang rulers were known as \"Emperor\" (皇帝) and never \"King\" (大王), and of all the states mentioned above, only Chu, Wuyue, Min and Jingnan rulers could be called \"King\" by their subjects in 928.","produced_by":"William Kong Zhang Weiping Zhang Yimou","starring":"Chow Yun-fat Gong Li Jay Chou Qin Junjie","music_by":"Shigeru Umebayashi","written_by":"Zhang Yimou"}