{"arthur":"Theatrical release poster","country":"United States","Awards and nominations":"The film is #10 on Bravo's \"100 Funniest Movies,\" and #53 on the American Film Institute's 100 Years... 100 Laughs.American Film Institute lists","distributed_by":"Warner Bros.","Plot":"Arthur Bach (Dudley Moore) is a spoiled alcoholic from New York City who likes to be driven in his chauffeured Rolls-Royce through Central Park. Arthur is heir to a portion of his family's vast fortune, which he is told will be his only if he marries the upper class Susan Johnson (Jill Eikenberry), the daughter of a business acquaintance of his father. He does not love Susan, but his family feels she will make him finally grow up. During a shopping trip in Manhattan, accompanied by his valet Hobson (John Gielgud), Arthur witnesses a young woman, Linda Morolla (Liza Minnelli), shoplifting a necktie. He intercedes with the store security guard (Irving Metzman) on her behalf, and later asks her for a date. Despite his attraction to her, Arthur remains pressured by his family to marry Susan.While visiting his grandmother Martha (Geraldine Fitzgerald), Arthur shares his feelings for Linda, but is warned again that he will be disowned if he does not marry Susan. Hobson, who has been more like a father to him than Arthur's real father, realizes that Arthur is beginning to grow up and secretly encourages Linda to attend Arthur's engagement party (where Moore, an accomplished pianist, entertains guests). Hobson confides in Linda that he senses Arthur loves her. Linda crashes the party, held at the estate of Arthur's father, and she and Arthur eventually spend time alone together - which is noticed by both families. Hobson is later hospitalized and Arthur rushes to his side, vowing to care for the person who has long cared for him. After several weeks, Hobson dies and then Arthur, who has been sober the entire time, goes on a drinking binge. On his wedding day, he visits the diner where Linda works and proposes to her. At the church, he jilts Susan, resulting in her abusive father, Burt Johnson (Stephen Elliott), attempting to stab Arthur with a cheese knife, though he is prevented by Martha.A wounded Arthur announces in the church that there will be no wedding and passes out. Linda attends to his wounds and they discuss living a life of poverty. A horrified Martha tells Arthur that he can have his fortune because no Bach has ever been working class. Arthur declines, but at the last minute, talks privately to Martha. When he returns to Linda's side, he tells her that he declined again – Martha's dinner invitation, he means - but he did accept $750 million. Arthur's pleased chauffeur Bitterman (Ted Ross) drives the couple through Central Park.","language":"English","Reception":"The film received critical acclaim upon its release. It currently holds a 90% \"Fresh\" rating on the review aggregate website Rotten Tomatoes.[6][7][8][9]","box_office":"$95,461,682[1]","cinematography":"Fred Schuler","production_company":"Orion Pictures","directed_by":"Steve Gordon","Related films":"Arthur was followed by a sequel in 1988, Arthur 2: On the Rocks. Lead players Dudley Moore, Liza Minnelli, and John Gielgud, reprised their roles, as well as many supporting players such as Geraldine Fitzgerald, Barney Martin, and Ted Ross.[10] However, the film was enough of a failure for star Dudley Moore to disown it.[citation needed]It was first reported in 2008 that Arthur was to be remade by Warner Bros., with the British actor/comedian Russell Brand in the lead role.[11] Brand confirmed this during his March 10, 2009 appearance on The Howard Stern Show.On April 22, 2010 it was announced that Helen Mirren would star opposite Brand, taking on John Gielgud's part. On June 11, The Hollywood Reporter announced that Jennifer Garner and Nick Nolte had also joined the cast.[12] Garner plays the heiress while Nolte is her ruthless father. Greta Gerwig stars as a charismatic tour guide with whom Arthur falls in love. Jason Winer directed the remake and Peter Baynham penned the script. Filming began in July 2010. It was released in the US on April 8, 2011.The remake was a critical and financial failure.[13]This film was also remade in India twice, as the Hindi language film Sharaabi (1984) starring Amitabh Bachchan in the lead role and in the Kannada language as Nee Thanda Kanike (1985).","release_dates":"July 17, 1981 (1981-07-17)|||||","Production":"Gordon originally wrote the titular character with an American actor in mind to portray. Prior to the casting of Moore, Al Pacino, Jack Nicholson, Richard Dreyfuss and James Caan were all considered for the role. In addition, Alec Guinness and David Niven were considered for the role of Hobson.[3][4]Pop Singer Christopher Cross was initially asked to score the film however writer/director Steven Gordon did not feel comfortable with his lack of experience in composing for film, instead the job was given to Burt Bacharach.[5] However Cross was asked to compose a song for the film which he did, \"Arthur's Theme\", which he wrote with Bacharach along with Carole Bayer Sager and Peter Allen.[5]","produced_by":"Robert Greenhut","starring":"Dudley Moore Liza Minnelli John Gielgud","running_time":"97 minutes","music_by":"Burt Bacharach","edited_by":"Susan E. Morse","written_by":"Steve Gordon","budget":"$7 million"}