{"Productions":"Following a pre-Broadway engagement at the Curran Theatre in San Francisco,[1] Brighton Beach Memoirs premiered on Broadway at the Alvin Theatre[2] on March 27, 1983 and transferred to the 46th Street Theatre, where it closed on May 11, 1986 after 1,299 performances and 7 previews. Directed by Gene Saks, the cast featured Matthew Broderick (Eugene Jerome), Elizabeth Franz (Kate Jerome), Peter Michael Goetz (Jack Jerome), Mandy Ingber (Laurie Morton), Željko Ivanek (Stanley Jerome), Jodi Thelen (Nora Morton) and Joyce Van Patten (Blanche Morton). Van Patten joined the cast after Piper Laurie was let go during rehearsals. Scenic design was by David Mitchell, Costumes were by Patricia Zipprodt and lighting was by Tharon Musser.[3][4] Cast Replacements included Fisher Stevens, Doug McKeon, Jon Cryer, Robert Sean Leonard, and Jonathan Silverman as Eugene and Elizabeth Perkins, Josh Hamilton, Stanley Tucci, Anita Gillette, Patrick Breen and Dick Latessa in other roles.A revival opened on Broadway on October 25, 2009 at the Nederlander Theatre. Directed by David Cromer, the cast featured Laurie Metcalf as Kate Jerome and Dennis Boutsikaris as Jack Jerome, with Santino Fontana as Stanley Jerome, Jessica Hecht as Blanche, Gracie Bea Lawrence as Laurie, Noah Robbins as Eugene and Alexandra Socha as Nora.[5][6]The production was planned to run in repertory with Broadway Bound, which was to feature the same cast with the exception of Josh Grisetti, who was to assume the role of the \"older\" Eugene (played by Noah Robbins in the earlier play) and Allan Miller in the role of Ben. The two plays were produced and promoted as \"The Neil Simon Plays\".[7] Despite generally positive reviews from New York critics, Brighton Beach Memoirs closed on November 1, 2009 after 9 performances and 25 previews due to weak ticket sales. Subsequently, the planned production of Broadway Bound was cancelled.[8]The New York Times, in analyzing the revival's failure, wrote that \"What went wrong with 'Brighton Beach Memoirs' is a case study in success and failure on Broadway today. There were no big stars like Jude Law in the current commercial hit 'Hamlet,' there was no marketing campaign that framed the Simon play as a can’t-miss theatrical event, and there was no wow factor that brought the period piece to life, like the breakneck pacing of the popular farce 'Boeing-Boeing' last year. But the failure also reflects America’s evolving sense of humor and taste... It actually received good reviews, but the play was shuttered because people, for whatever reason, did not want to see the Simon show about a Depression-era family laughing through the tears. The show cost $3 million to produce but never grossed more than $125,000 a week in ticket sales during preview performances — or 15 percent of the maximum possible — an amount that did not even cover running costs.\"[9]","\"brighton_beach_memoirs\"":"Original Playbill","original_language":"English","Plot overview":"Set in the Brighton Beach section of Brooklyn, New York in September 1937 during The Great Depression, this coming-of-age comedy focuses on Eugene Morris Jerome, a Polish-Jewish American teenager who experiences puberty, sexual awakening, and a search for identity as he tries to deal with his family, including his older brother Stanley, his parents Kate and Jack, Kate's sister Blanche, and her two daughters, Nora and Laurie, who come to live there after their father's death.","place_premiered":"Curran Theatre in San Francisco","genre":"Comedy","Reception":"The play became popular on Broadway. In 1983 Dolores Dolan of The New York Times said that after it achieved popularity on Broadway, the community of Brighton Beach \"attracted some notice\" when it had historically \"receive[d] little attention\".[10]","date_premiered":"February 2, 1983","Film adaptation":"In 1986 the play was adapted into a movie directed by Gene Saks with the screenplay by Neil Simon. The cast featured Jonathan Silverman (Eugene), Blythe Danner (Kate), Bob Dishy (Jack), Lisa Waltz (Nora), Brian Drillinger (Stanley), Stacey Glick (Laurie), and Judith Ivey (Blanche). The film frequently breaks the fourth wall by having Eugene speak directly to the camera.Roger Ebert, in his review for the Chicago Sun-Times wrote: \"The movie feels so plotted, so constructed, so written, that I found myself thinking maybe they shouldn't have filmed the final draft of the screenplay. Maybe there was an earlier draft that was a little disorganized and unpolished, but still had the jumble of life in it.... The movie was directed by Gene Saks, who directs many of Simon's plays on both the stage and the screen, and whose gift is for the theater. His plays have the breath of life; his movies feel like the official authorized version. Everything is by the numbers.\"[11][12]","written_by":"Neil Simon"}