{"country":"United States","distributed_by":"First Look International","Plot":"Struggling photographer Rebecca Sommers finds her model boyfriend Richard in bed with another woman. He also destroys all of her camera equipment. Her life falls apart, and she alternates between desire for revenge upon him, sexual promiscuity and abandonment of all hope of love. Her best friends, Michelle and Carrie, try to set her up on dates. These include one with a freakish magician and another with a man who gives her ecstasy and has a fetish for fish. She attempts to make Richard jealous by taking a director, who is reminiscent of Woody Allen, to a runway show, but he ends up vomiting on her breasts in front of everyone.Ultimately, Rebecca realizes she should focus her energy on being with someone who truly loves her, and that turns out to be John, her nerdy but caring best male friend who has been supportive of her through the entire ordeal.","Accolades":"Dirty Love \"won\" four Razzie Awards at the 26th Golden Raspberry Awards:[7]","language":"English","box_office":"$36,099[1]","cinematography":"Eric Wycoff","directed_by":"John Mallory Asher","production_companies":"Big Screen Entertainment Group DEJ Productions Double Down Entertainment Palisades Pictures","release_dates":"January 2005 (2005-01) (Sundance)|September 23, 2005 (2005-09-23)||||","produced_by":"John Mallory Asher|BJ Davis|Rod Hamilton|Kimberley Kates|Michael Manasseri|Jenny McCarthy|Trent Walford|","starring":"Jenny McCarthy|Eddie Kaye Thomas|Carmen Electra|Victor Webster|","running_time":"91 minutes","dirty_love":"Theatrical release poster","music_by":"D. A. Young","edited_by":"Warren Bowman","Release":"Dirty Love opened theatrically on September 23, 2005 in 44 venues and earned $23,281 in its opening weekend.[3] The film ended its run two weeks later, on October 6, 2005, having grossed a mere $36,099 in the domestic box office.[1]The film received extremely negative reviews from critics. It currently holds a 4% \"Rotten\" rating on the review aggregator website Rotten Tomatoes, based on 28 reviews, with an average rating of 2.2/10. The site's consensus states: \"The laugh-free Dirty Love is a comedy dead zone -- it's aggressively crude and shoddily constructed.\"[4] Metacritic reports a 9 out of 100 rating, based on 12 critics, indicating \"overwhelming dislike\".[5]Film critic Roger Ebert of the Chicago Sun-Times gave a zero star rating and said it was the third worst film of 2005. In his written review, he stated, \"Here is a film so pitiful, it doesn't rise to the level of badness. It is hopelessly incompetent.\"[6]","written_by":"Jenny McCarthy"}