{"country":"United States Canada","distributed_by":"Gramercy Pictures","Plot":"Thousands of former employees are outraged with military businessman R.J. Hacker (G. D. Spradlin), who had closed down his weapons manufacturing plant, Hacker Dynamics. At a conference held at the former plant, he pins the blame for the shutdown of his business on the current President of the United States (Alan Alda), who has just arrived. The President defends his own belief that the future of the children is more important than war, which has caused major decline in his approval rating. After the conference, he expresses to confidantes General Dick Panzer (Rip Torn) and National Security Advisor Stuart Smiley (Kevin Pollak) his discontent about not having an enemy to engage in war. An attempted negotiation with Russian President Vladimir Kruschkin (Richard E. Council) to start a new cold war with Russia fails, and the President's suggestion of a war on international terrorism is deemed too absurd.Serendipitously, American sheriff Bud Boomer (John Candy) offensively criticizes Canadian beer while attending a hockey game between the neighboring nations in Niagara Falls, Ontario. The ensuing brawl ends up on the news and catches Stuart's attention; he collects more information about Canada from a CIA agent named Gus (Brad Sullivan), who suggests Canada as their new enemy. Before long, television channels are littered with anti-Canada propaganda, which Boomer believes wholeheartedly. He prepares for war by distributing guns to his fellow sheriffs, including his girlfriend Honey (Rhea Perlman) and their friends Roy Boy (Kevin J. O'Connor) and Kabral Jabar (Bill Nunn). After they apprehend a group of Americans \"dressed as Canadians\" attempting to destroy a hydroelectric plant, despite Gus' protests, they sneak across the border to litter on Canadian lands, which leads to Honey being arrested by the Royal Canadian Mounted Police. In a rescue attempt, Boomer, Roy Boy and Kabral sneak into a Canadian power plant and cause a countrywide blackout. When the President learns of this, he orders Boomer's immediate removal from Canada before it's too late.Hacker, seeking revenge on the President for shutting down his business, uses a software program (\"Hacker Hellstorm\") to activate missile silos across the country. The President learns that the signal causing the activation of the silos originated from Canada, and summons Hacker. Hacker offers to sell a program to the President that can cancel out the Hellstorm — for $1 trillion. With only six minutes left, the President is trying to figure out what's going on. Stuart, fed up with the President being too busy to give Hacker the money, realizes that Hacker, getting up to leave, is the one controlling the silos, not Canada, and, after storming up, takes the operating codes from him required to stop the Hellstorm (accidentally killing Hacker in the process). The President orders Stuart's arrest, despite his protests that he is now able to give the codes to the President so they could deactivate the missiles which are aimed at Moscow. As the launch time approaches the President pleads with Canadian Prime Minister Clark MacDonald (Wallace Shawn) over the phone to stop the launch.Meanwhile, Honey was taken to a mental hospital upon her capture and escaped all the way to the CN Tower. She discovers the central computer for the Hellstorm located at the top and destroys it with a machine gun, aborting the launch sequence. She then reunites with Boomer, who had tracked her to the Tower, and they return to the United States via a speedboat.An ending montage reveals the characters' fates: Boomer realizes his dream of appearing on Cops; Honey has been named \"Humanitarian of the Year\" by the National Rifle Association; The President was defeated in the next election by a large landslide and now hosts, Get Up, Cleveland; Stuart served eight months in prison, but was pardoned by the new President; General Panzer committed suicide after learning that \"Hogan's Heroes\" was fictional; Gus was last spotted heading to Mexico; R.J. Hacker's body has been viewed daily at Republican National Headquarters; Kabral has become a hockey star, winning the Hart Memorial Trophy three years in a row; Roy Boy's whereabouts become unknown; and MacDonald is \"still ruling with an iron fist.\"","language":"English","Reception":"Canadian Bacon received a 14% from Rotten Tomatoes.[9]Nathan Rabin in a 2009 review concluded, \"After generating solid laughs during its first hour, Canadian Bacon falls apart in its third act,\" lamenting the film \"was perceived as too lowbrow for the highbrows, and too highbrow for the lowbrows.\"[10]","box_office":"$178,104[2]","cinematography":"Haskell Wexler","production_company":"Dog Eat Dog Films Propaganda Films PolyGram Filmed Entertainment Maverick Picture Company","canadian_bacon":"Theatrical release poster","directed_by":"Michael Moore[1]","release_dates":"September 22, 1995","Production":"The film was shot in fall 1993,[5] in Toronto, Hamilton, and Niagara Falls, Ontario; and Buffalo and Niagara Falls, New York. Scenes depicting the rapids of the Niagara River were actually filmed at Twelve Mile Creek in St. Catharines. Parkwood Estate in Oshawa was the site for the White House, and Dofasco in Hamilton was the site for Hacker Dynamics. The scene where the American characters look longingly home at the US across the putative Niagara River is them looking across Burlington Bay at Stelco steelworks in Hamilton, Ontario.[6]The hockey game/riot were shot at the Niagara Falls Memorial Arena in Niagara Falls, Ontario,[7] and the actors portraying the police officers (who eventually join in the riot upon hearing \"Canadian beer sucks\") are wearing authentic Niagara Regional Police uniforms.[8]The film has numerous cameos by Canadian actors, including Dan Aykroyd, who appears uncredited as an Ontario Provincial Police officer who pulls Candy over (ticketing him not for the crude anti-Canadian graffiti on his truck, but its lack of a French translation). Other cameos are by Alex Trebek, William Shatner and Lorne Greene. Moore himself appears as an American gun nut.","produced_by":"Michael Moore","starring":"Alan Alda|John Candy|Rhea Perlman|Kevin J. O'Connor|Bill Nunn|Kevin Pollak|G.D. Spradlin|Rip Torn|","running_time":"91 minutes","music_by":"Elmer Bernstein|Peter Bernstein|","edited_by":"Michael Berenbaum|Wendey Stanzler|","written_by":"Michael Moore","budget":"$11 million"}