{"based_on":"Casino  by Nicholas Pileggi","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Nicholas Pileggi|Martin Scorsese|","Plot":"In 1970, sports handicapper and mafia associate Sam \"Ace\" Rothstein (Robert De Niro) is sent to Las Vegas to run the Teamsters Union-funded Tangiers Casino on behalf of Midwest mafia organizations, that secretly control the Teamsters, while Philip Green (Kevin Pollak) serves as the mob's frontman. Taking advantage of gaming laws that allow him to work in a casino while his gaming licence is pending, Sam doubles the casino's profits, which are skimmed by the mafia before they are reported to income tax agencies. Impressed with his work, mafia boss Remo Gaggi (Pasquale Cajano), sends Sam's childhood friend and mob enforcer Nicholas \"Nicky\" Santoro (Joe Pesci) and his associate Frank \"Frankie\" Marino (Frank Vincent) to protect Sam and the whole operation. Nicky's volatile temper soon gets him banned from every casino in Las Vegas, so he gathers his own crew and engages in independent shakedowns and burglaries instead.Sam meets and falls in love with a hustler and former prostitute, Ginger McKenna (Sharon Stone). They conceive a daughter and marry, but their marriage is proven difficult by Ginger's strong independence and love for her former boyfriend, con artist-turned pimp Lester Diamond (James Woods), who is ordered beaten severely by Sam and Nicky after they catch him conning Ginger out of some money. Ginger subsequently turns to alcohol. Meanwhile, Sam makes an enemy in county commissioner Pat Webb (L. Q. Jones) for firing his brother-in-law Don Ward (John Bloom) for incompetence. When Sam refuses to reinstate him, Webb pulls Sam's licence from the backlog, forcing him to face a hearing for his gaming licence while secretly arranging for the board to deny Sam. Sam blames the incident on Nicky's recklessness and the two argue furiously in the desert after Sam attempts to tell Nicky to leave Las Vegas.The casino counters begin stealing some money for themselves, prompting the Midwest mafia bosses to put Artie Piscano (Vinny Vella) of the Kansas City mafia in charge of overseeing the transactions. He rants about it in his grocery store, unaware that the FBI are listening on an old bug they had planted there long before. The FBI subsequently begin an investigation. Tired of his wife's alcoholism, Sam seeks a divorce from Ginger. She then kidnaps their daughter, Amy, taking her to Los Angeles, and plans to flee to Europe with Lester. Sam convinces her to come back with Amy, and then scolds her for stealing his money and kidnapping their daughter. After he overhears Ginger talking on the phone about killing him, he kicks her out of the house, but soon relents knowing if he gives Ginger money he would never see her again. Ginger then approaches Nicky for help in getting her valuables from their shared vault in the bank, and the two start an affair. Sam discovers this after finding Amy tied to her bed by Ginger, who is with Nicky at his restaurant. Sam disowns Ginger, and so does Nicky. A furious and drunk Ginger crashes her car into Sam's driveway, making a scene and retrieves the key to their deposit box after distracting the attending police. Though she succeeds in taking her share of the money from the bank, she is arrested by the FBI for aiding and abetting Sam.The FBI move in and the casino empire crumbles. Green decides to cooperate with the authorities and Piscano dies of a heart attack, though Nicky flees Las Vegas before he can be caught. The FBI approach Sam for help, but he turns them down. The bosses are arrested and put on trial, but decide to eliminate anyone involved in the scheme to stop them from testifying and prolonging their coming sentences, among them three casino executives, Teamsters head Andy Stone (Alan King) and money courier John Nance. Ginger flees to Los Angeles and ultimately dies penniless of a drug overdose in a motel. Sam himself is almost killed in a car bomb, and suspects Nicky was behind it. Before Sam can take revenge, Nicky and his brother Dominick are ambushed by Frankie and their own crew and savagely beaten and buried alive in a cornfield, the bosses having had enough of Nicky's behaviour and offered his crew clemency in exchange for the murder.With the mob now out of power, the old casinos are demolished and purchased by big corporations, who build new and gaudier attractions, which Sam laments are not the same as when the mafia was in control. Sam subsequently retires to San Diego and continues to live as a sports handicapper for the mob, in his own words, ending up \"right back where I started\". He closes the film with the words, \"and that's that\".","casino":"Theatrical release poster","language":"English","Reception":"The film made $116 million worldwide[2] on a $40–50 million budget.[1]While the film was heavily criticized for its excessive violence, it garnered a mostly positive critical response. Rotten Tomatoes gives the film an 80% approval rating based on 61 reviews.[13] On Metacritic, the rating is 73 (generally favorable reviews) out of 100 based on 17 reviews.[14]American Film Institute lists","box_office":"$116.1 million[2][3]","cinematography":"Robert Richardson","production_company":"Syalis D.A. Légende Entreprises De Fina / Cappa","directed_by":"Martin Scorsese","narrated_by":"Robert De Niro, Joe Pesci","release_dates":"November 22, 1995 (1995-11-22)|||||","Production":"The research for Casino began when screenwriter Nicholas Pileggi read a 1980 report from the Las Vegas Sun about a domestic argument between Frank \"Lefty\" Rosenthal, a casino figure, and his wife Geri McGee, a former topless dancer.[6] This gave him an idea to focus on a new book about the true story of mob infringement in Las Vegas during the 1970s, when filming of Goodfellas was coming to an end (the screenplay which he co-wrote with Scorsese).[7] The fictional Tangiers resort reflected the story of the Stardust Resort and Casino, which had been bought by Argent Corporation in 1974 using loans from the Teamsters Central States Pension Fund. Argent was owned by Allen Glick, but the casino was believed to be controlled by various organized crime families from the Midwest. Over the next six years, Argent Corporation siphoned off between $7 and $15 million using rigged scales. When exposed by the FBI, this skimming operation was the largest ever exposed.[8] A number of organized crime figures were convicted as a result of the skimming.[citation needed]Pileggi contacted Scorsese about taking the lead of the project, which became known as Casino.[6] Scorsese expressed interest, calling this an \"idea of success, no limits\".[9] Pileggi was keen to release the book and then concentrate on a film adaptation, but Scorsese encouraged him to \"reverse the order\".[10]Scorsese and Pileggi collaborated on the script for five months, towards the end of 1994.[7] Real-life characters were reshaped, such as Frank \"Lefty\" Rosenthal, Geri, Anthony Spilotro, and his brother. Some characters were combined, and parts of the story were set in Las Vegas instead of Chicago. A problem emerged when they were forced to refer to Chicago as \"back home\" and use the words \"adapted from a true story\" instead of \"based on a true story\".[9] They also decided to simplify the script, so that the character of Sam \"Ace\" Rothstein only worked at the Tangiers Casino, in order to show a glimpse of the trials involved in operating a Mafia-run casino hotel without overwhelming the audience.[9] According to Scorsese, the initial opening sequence was to feature the main character, Sam Rothstein, fighting with his estranged wife Ginger on the lawn of their house. The scene was too detailed, so they changed the sequence to show the explosion of Sam's car and his flying into the air before hovering over the flames in slow motion—like a soul about to go straight down to hell.[9]Filming took place at night in the Riviera casino in Las Vegas, with the nearby defunct Landmark Hotel as the entrance, to replicate the fictional Tangiers. According to the producer Barbara De Fina, there was no point in building a set if the cost were the same to use a real-life one.[9] The opening scene, with Sam's car exploding, was shot three times; the third take was used for the film.[9] When first submitted to the MPAA, the film received an NC-17 rating due to its depictions of violence. Several edits were made in order to reduce the rating to R.[11][12]","produced_by":"Barbara De Fina","starring":"Robert De Niro|Sharon Stone|Joe Pesci|","running_time":"178 minutes","edited_by":"Thelma Schoonmaker","budget":"$40–50 million[1]"}