{"based_on":"Characters  by Lewis Carroll","Cast":"Lindsay Duncan reprises her role as Alice's mother, Helen Kingsleigh.[8][9] from the first film. Leo Bill and Geraldine James also return as Hamish and Lady Ascot respectively. Andrew Scott plays Dr. Addison Bennett,[10] a cruel psychiatric doctor, while Ed Speleers plays James Harcourt,[4] an employee of the Ascots. Richard Armitage and Hattie Morahan appear as the parents of Iracebeth and Mirana; King Oleron and Queen Elsemere. Simone Kirby plays the Hatter's mother with Joe Hurst, Siobhan Redmond, Oliver Hawkes, Frederick Warder, Eve Hedderwick Turner, and Tom Godwin playing members of his extended family.Wally Wingert briefly voices Humpty Dumpty, though John Sessions was originally slated to voice the character.[13] Meera Syal voices \"Nobody\", whilst Edward Petherbridge voices the Gentleman Fish, Owain Rhys Davies voices the Delivery Frog, and Paul Hunter voices the White King, a chess piece.","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","Plot":"Alice Kingsleigh has spent the past three years following in her father's footsteps and sailing the high seas, demonstrating exceptional skill as a merchant ship captain escaping a pirate attack. Upon her return to London from China, she learns that her ex-fiancé, Hamish Ascot, has taken over her father's company and plans to have Alice sell him her father's ship in exchange for her family home. Filled with anger, Alice runs away and comes across her butterfly friend Absolem and returns to Underland through a mirror.Alice is greeted by the White Queen, the White Rabbit, the Tweedles, the Dormouse, the March Hare, Bayard, and the Cheshire Cat. They inform her that the Mad Hatter Tarrant Hightopp is in poor health and depressed because his family is missing following the Attack of the Jabberwocky. The attack occurred shortly after his father, a hat retailer, seemed to reject Tarrant's gift of a hat creation.Believing that finding the Mad Hatter's family is the only way to restore his health, the White Queen persuades Alice to consult Time and convince him to save the Mad Hatter's family in the past (something that no Underland resident can do, as it is said that history will be destroyed if someone sees their past/future self; Alice has no past self in Underland whom she could accidentally meet). Upon visiting Time's palace, Alice finds the Chronosphere, an object that powers all time in Underland and will allow her to travel through the Oceans of Time.After being told by Time that altering the past cannot be done, Alice steals the Chronosphere and travels back in time, shortly after finding the exiled Red Queen, Iracebeth of Crims, in the care of Time. The Red Queen urges Time to go after Alice to find the Chronosphere so she can get even with her sister, the White Queen. Alice accidentally flies to the day of Iracebeth's coronation, where a younger Mad Hatter/Tarrant Hightopp mocks the Red Queen when the royal crown doesn't fit on her abnormally large head. This causes Iracebeth to melt down. Her father deems her emotionally unqualified to rule and passes the title of queen to her younger sister Mirana of Marmoreal, the White Queen.Alice later learns of an event in Iracebeth's and Mirana's past that caused friction between the two and travels back in time again, hoping it will change Iracebeth's ways and stop the Jabberwocky from killing the Hatter's family. She soon learns that the hat that the Mad Hatter made when he was a child and which he thought his father casually threw away was actually treasured by his father. Meanwhile, she meets the White Queen and the Red Queen as sisters. While her mother was not looking, Mirana steals a tart from her mother and eats it, casually kicking the crumbs under Iracebeth's bed. When confronted by their mother, Mirana lies about eating the tart, and Iracebeth is accused, causing her to run out of the castle. Alice sees that Iracebeth is about to run into a clock, the event that deforms her head and personality. Alice prevents that collision but fails to change the past, as Iracebeth trips and slams her head into a stone wall instead.Alice is then confronted by a weakened Time, scolding her for putting all of time in danger. She runs into a nearby mirror back in the real world, where she wakes up in a mental hospital, diagnosed with female hysteria. As the doctor tries to inject Alice, she escapes from the mental hospital and with the help of her mother, returns to Underland via the mirror, where she travels to the Attack of the Jabberwocky Day. Alice discovers that the Mad Hatter's family never died, but were captured by the Red Queen. Returning to the present, Alice discovers she is too late, as the Mad Hatter is on the brink of death.After Alice tearfully says that she believes him, Tarrant transforms back to his normal self. The Underlandians go to the Red Queen's castle, where the Mad Hatter finds his family shrunk and trapped in an ant farm. However, the Red Queen apprehends them and steals the Chronosphere from Alice, taking the White Queen back to the day she lied about the tart. By the time the Mad Hatter and Alice get there, the Red Queen and Iracebeth have seen each other. Time becomes irrelevant, and Underland begins to freeze. Using the Chronosphere, Alice and the Mad Hatter race back to the present, where Alice is able at the last second to place the Chronosphere back in its original place.With the Chronosphere stabilized, Underland reverts to normal. The Mad Hatter reunites with his family and the White Queen apologizes to the Red Queen for lying and both of them make amends. Alice bids her friends farewell and returns to the real world. Alice arrives at the meeting where her mother is to sign over Alice's ship to Hamish, and her mother decides to support her daughter instead. Hamish gets the Kingsleigh family home but not the ship. Alice and her mother set out to travel the world together with their own shipping company.","alice_through_the_looking_glass":"Theatrical release poster","language":"English","Reception":"As of June 30, 2016[update], Alice Through the Looking Glass has grossed $75.3 million in North America and $175.1 million in other territories for a worldwide total of $250.4 million, against a budget of $170 million.[1]Alice Through the Looking Glass opened in the United States on May 27, 2016, alongside X-Men: Apocalypse, and was initially projected to gross $55–60 million from 3,763 theaters over its four-day Memorial Day opening weekend, but projections were continuously revised downwards due to poor word of mouth.[31] It had the added benefit of playing in over 3,100 3D theaters, 380 IMAX screens, 77 premium large formats and 79 D-box locations.[32][33] It made $1.5 million from Thursday previews (to the first film's $3.9 million)[34] and just $9.7 million on its first day, compared to the $41 million opening Friday of its predecessor.[35] Through its opening weekend, it earned $27 million, which when compared to its predecessor's $116 million opening is down 70%.[31] While 3D represented 71% ($82 million) of the original film's opening gross, 3D constituted only 41% ($11 million) for this sequel, with 29% coming from traditional 3D shows, 11% from IMAX, and 1% from premium large formats.[36] It became the studio's third Memorial Day opening flop following Tomorrowland in 2015 and Prince of Persia: The Sands of Time in 2010.[36] During its first week, the film grossed $40.1 million.[37] In its second weekend, the film grossed $11.3 million (a 55.1% drop), finishing 4th at the box office.[38]Outside North America, the film was released across 43 countries (72% of its total market place) the same weekend as the US, and was estimated to gross $80–100 million in its opening weekend. It faced competition from Warcraft and X-Men: Apocalypse.[39] It ended up grossing $62.7 million, which is well below the projections of which $4.1 million came from IMAX shows.[40] It had an opening weekend gross in Mexico ($4.5 million), Brazil ($4.1 million), and Russia ($3.9 million).[40] In the United Kingdom and Ireland, it had an unsuccessful opening by grossing just £2.23 million ($3.1 million) during its opening weekend, a mere 21% of the first film's £10.56 million ($15.2 million) opening from 603 theaters. It debuted in second place behind X-Men: Apocalypse which was on its second weekend of play.[41] In China, it had an opening day of an estimated $7.3 million[42] and went on to score the second biggest Disney live-action (non-Marvel or Lucasfilm) opening ever with $26.6 million, behind only The Jungle Book.[40] However, this was down from its $35–45 million projections.[43] Although the sequel's opening numbers in China is almost equivalent to the first film's entire $34.9 million gross, it is still considered a disappointment given China box office has grown more than three times since 2010. As a result, it became Disney's first film of 2016 to flop in the country and thereby ending their long streak of hits following Star Wars: The Force Awakens, Zootopia, The Jungle Book and Captain America: Civil War.[44] Elsewhere, it opens in France (June 1), Japan (July 1) and South Korea (September 8).[39]Alice Through the Looking Glass has received generally negative reviews from critics. On Rotten Tomatoes, the film has a rating of 30%, based on 203 reviews, with an average rating of 4.6/10. The site's critical consensus reads: \"Alice Through the Looking Glass is just as visually impressive as its predecessor, but that isn't enough to cover for an underwhelming story that fails to live up to its classic characters\".[45] On Metacritic, the film has a score of 34 out of 100, based on 42 critics, indicating \"generally unfavorable reviews\".[3] Audiences polled by CinemaScore gave the film an average grade of \"A–\" on an A+ to F scale, the same grade earned by its predecessor.[46]Stephen Holden of The New York Times wrote in his review, \"What does all this have to do with Lewis Carroll? Hardly anything\" and that overall, \"It's just an excuse on which to hang two trite overbearing fables and one amusing one\".[47] Ty Burr of The Boston Globe gave the movie 1.5 out of 4 stars and called the film, \"gaudy, loud, complacent, and vulgar.\"[48] Stephen Whitty of New York Daily News called the film \"hugely expensive and extravagantly stupid\" and that, overall, the movie \"is just one more silly Hollywood mashup, an innocent fantasy morphed into a noisy would-be blockbuster\".[49]Matt Zoller Seitz of RogerEbert.com was deeply critical. He described Through the Looking Glass as \"the most offensive kind of film...one that spends an enormous amount of money yet seems to have nothing on its mind but money. You give it, they take it. And you get nothing in return but assurances that you're seeing magic and wonder. The movie keeps repeating it in your ear, and flashing it onscreen in big block letters: MAGIC AND WONDER. MAGIC AND WONDER. But there is no magic, no wonder, just junk rehashed from a movie that was itself a rehash of Lewis Carroll, tricked out with physically unpersuasive characters and landscapes and \"action scenes,\" with blockbuster \"journey movie\" tropes affixed to every set-piece as blatantly as Post-It Notes.\"[50]Kyle Smith of New York Post gave the film a positive review writing: \"The screenplay (by Linda Woolverton) isn't exactly heaving with brilliant ideas, but it works well enough as a blank canvas against which the special-effects team goes bonkers\".[51] Matthew Lickona of San Diego Reader said that while he found the visual effects to be \"stupidly expensive\" and the story familiar, he called it, \"a solid kids’ movie in the old style\".[52]","box_office":"$250.4 million[1]","cinematography":"Stuart Dryburgh","production_company":"Walt Disney Pictures Roth Films Team Todd Tim Burton Productions","directed_by":"James Bobin","Music":"Track 28 written and composed by Alecia Moore, Max Martin, Karl Johan Schuster, and Oscar Holter; all other tracks composed by Danny Elfman","release_dates":"May 10, 2016 (2016-05-10) (London)|May 27, 2016 (2016-05-27) (United States)||||","Production":"The movie was announced via Variety in December 2012.[14] Bobin was first approached about the project while doing post-production work on Muppets Most Wanted,[15] Of being asked, Bobin has said that \"I just couldn’t pass it up\", as he has a passion for the works of Lewis Caroll as well as history in general.[16] In July 2013, it was announced that Johnny Depp would return as the Hatter,[17] with Mia Wasikowska's return confirmed the following November.[18] Also in November, a release date of May 27, 2016, was set, and it was officially announced that Bobin would direct the film.[18] On January 21, 2014, the film was retitled to Alice in Wonderland: Through the Looking Glass,[19] and Sacha Baron Cohen joined the cast to play a villain, Time.[20] In March 2014, it was confirmed that Academy Award Winner Anne Hathaway and Helena Bonham Carter would return as the White and Red Queen respectively.[21] [22] In May 2014, Rhys Ifans joined the cast to play Zanik Hightopp, the Mad Hatter's father.[23] In developing the character of \"Time\", Bobin sought to avoid creating a \"straight-up bad guy\", noting that it would be \"a bit dull\", and also that the role in that universe already existed in the form of The Red Queen.[15] Instead, Bobin sought to make Time a \"Twit\", further explaining that \"There's no one better at playing the confident idiot trope than Sacha Baron Cohen\", and adding that \"it was very much with Sacha in mind\".[15]Principal photography began on August 4, 2014, at Shepperton Studios.[24] In August 2014, filming took place in Gloucester Docks, which included the use of at least four historic ships: Kathleen and May, Irene, Excelsior, and the Earl of Pembroke, the last of which was renamed The Wonder for filming.[25][26][27][28][29] Principal photography ended on October 31, 2014.[30]","produced_by":"Tim Burton|Joe Roth|Suzanne Todd|Jennifer Todd|","starring":"Johnny Depp|Anne Hathaway|Mia Wasikowska|Matt Lucas|Rhys Ifans|Helena Bonham Carter|Sacha Baron Cohen|Alan Rickman|Stephen Fry|Michael Sheen|Timothy Spall|","running_time":"112 minutes[1]","music_by":"Danny Elfman","edited_by":"Andrew Weisblum","written_by":"Linda Woolverton","budget":"$170 million[2]"}