{"based_on":"characters created by Roger Spottiswoode Walter Hill & Larry Gross Steven E. de Souza","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"John Fasano|Jeb Stuart|Larry Gross|","story_by":"Eddie Murphy (credited as \"Fred Braughton\")","Plot":"San Francisco cop Jack Cates is at the Hunter's Point Raceway checking out a known associate of the Iceman, Tyrone Burroughs, who for unknown reasons is giving some money to mechanic Arthur Brock. When Jack orders them to surrender, Brock pulls out a gun and starts firing and Jack kills Brock in Self-defense as Burroughs escapes.Among those who show up at the scene are fellow cops Ben Kehoe and Frank Cruise, and also Blake Wilson, the head of the Internal Affairs division. Cates tells Wilson that he shot Brock in self-defense as Brock had opened fire on him. Cruise picks up a burnt piece of twisted metal but says that he can't find Brock's gun. Jack, however finds a partly burnt picture of Reggie Hammond in Brock's bag.Jack then goes to visit Reggie in prison, with Reggie due for release in 24 hours. After getting hit in the face with a basketball by Reggie for refusing to promise Reggie his $500,000 unless Reggie helps him find the Ice Man, Jack discovers that Wilson plans to prosecute him on a charge of third degree manslaughter for the Arthur Brock shooting, with Wilson claiming that it was not self-defence and Jack is placed on suspension. Wilson also doesn't believe that the Iceman exists and believes Jack is wasting department resources looking for him.After Reggie is released from prison, bikers Richard \"Cherry\" Ganz, the brother of Albert Ganz, and Willie Hickok from The Brotherhood who had earlier killed two highway patrol officers and a bartender at a bar out in the desert, pull up beside the prison bus and open fire on Reggie, causing the bus to crash. Ganz and Hickok then pull up to a diner where Ganz shoots Jack who is sitting inside. Jack and Reggie end up at the same hospital where it is revealed that Jack was wearing a bullet proof vest and Reggie had escaped the hit with nothing more than a bump on his head. Jack then convinces the attending police officers to release Reggie into his custody by telling them that he is needed to identify the Kingpin of a child pornography ring.After arriving back in San Francisco, Jack and Reggie go to a bar, the bartender having called the police complaining about some bikers, again revealed to be Ganz, Hickok and the leader of The Brotherhood Malcolm Price. While Reggie is in the women's bathroom getting another patron's wallet back from a pick-pocket who tries unsuccessfully to stab him, Cates ends up in a bar fight with a man that he put in prison two years ago, and when Jack loses the advantage and starts getting beaten up, Reggie returns and asks the bartender if she has a gun and saves Jack by shooting one of the assailants in the left kneecap.Reggie then tells Jack that if he wants to find the Iceman he needs to go back to prison to talk to a man named Kirkland Smith who had not only kept Reggie alive while inside, but knows everything that goes on. Smith tells Jack and Reggie that Malcolm Price is staying at the Sunset Motel on the beltway, then angrily tells Reggie to repay his debt to him before breaking the dividing glass with a single punch. However, before Jack and Reggie can get to the motel, the Iceman shows up and kills Malcolm by shooting Malcolm 16 times. Cherry Ganz and Hickok then visit Tyrone Burroughs and kill him as a warning to the Iceman that there is a heavy price for killing one of The Brotherhood.Later that same day, Jack, who now thinks that he may never clear his name and find the Iceman, starts emptying his locker at the police station, and finally gives Reggie his money. That night, while Reggie is giving the money that he owes Kirkland Smith to his daughter Amy Smith, Cherry and Willie kidnap Reggie and Amy, and take them to the Bird Cage Club, where they meet with Cruise to receive a payoff for handing Reggie over to him (as retribution for killing one of their own). Cruise orders Cherry and Willie to kill Reggie and Amy, but then Jack shows up. Reggie then identifies the Iceman as Jack's friend Detective Ben Kehoe.Jack realizes that Kehoe had Cruise pick up Brock's gun at the track because Kehoe wanted Jack out of the way. This leads to a wild shootout that takes place in the Bird Cage club, with all but Jack and Amy Smith being shot or killed. Reggie punches Cherry who falls out of the third floor window. Reggie is then taken hostage by Kehoe. Jack shoots Reggie in the shoulder after Reggie bluffs that Jack should shoot him (as in the first movie). When a surprised Reggie falls, Jack then kills Kehoe.While Reggie is being loaded onto the ambulance, Jack tells him that he found $500,000 that the Iceman was going to use to pay off the Brotherhood. Jack's name being cleared of all charges. Reggie tells Jack he is sorry that Jack had to kill his friend. Jack replies that Reggie is his real friend. As the ambulance leaves with Reggie, Jack realizes that Reggie (as in the conclusion of the first flim) has successfully stolen his lighter.","language":"English","another_48_hrs.":"Theatrical release poster","box_office":"$153.5 million[1]","cinematography":"Matthew F. Leonetti","production_company":"Eddie Murphy Productions","directed_by":"Walter Hill","Soundtrack":"The original version of \"The Boys Are Back in Town\" by The Busboys was not on the soundtrack, but played at the end of the film.The song \"Drinking Them Beers\", by the country music singer Tompall Glaser also appears in the movie during the time that Nick Nolte's character is in the diner at the beginning of the film. This song is also not on the official soundtrack of the film.","release_dates":"June 8, 1990 (1990-06-08)|||||","Production":"Eddie Murphy received a salary of $9,000,000 for his role as Reggie Hammond (because of his success in Beverly Hills Cop and later films), an improvement over his $450,000 salary from the first film. Nick Nolte received a salary of $3,000,000, an improvement over his original salary of $1,000,000 for the first film.","produced_by":"Lawrence Gordon|Robert D. Wachs|","starring":"Eddie Murphy|Nick Nolte|","running_time":"93 minutes","music_by":"James Horner","edited_by":"Donn Aron|Carmel Davies|Freeman A. Davies|Tim Ryder|","Release":"There were 1,460,259 admissions in France.[3]Original release of the movie was 145 minutes long. It was cut by either director Walter Hill or the Paramount studio down to 120 minutes, and a week before its summer theatrical release an additional 25 minutes were cut out by Paramount, making a final theatrical version 95 minutes long. Frank McRae's reprisal of his role from the original 48 Hrs. was entirely cut except for a brief, uncredited shot of him in the background of one scene in the police station. Brion James, also returning from the original, saw his role severely cut down as well, to create a faster-paced action-comedy.[4] Also removed was a scene which was partially shown in the theatrical trailer in which Jack explains to Reggie that he has a deadline to track down the Iceman; as such, there is no mention of '48 hours' anywhere in the final film.As of January 2012, there are no plans to release a director's cut of this film.The film grossed more at the US box office than its predecessor and made $72.7 million from foreign markets for a total of $153.5 million.[1][5]However, critical reception was very negative, and it currently holds a 15% rating on Rotten Tomatoes based on 27 reviews. Vincent Canby of The New York Times stated that it was \"as much a star vehicle for Mr. Murphy as The Gorgeous Hussy once was for Joan Crawford. The Crawford name isn't idly invoked. You have to go back to the old M-G-M days to find movies that, with every gesture, let the audience know it was watching a star.\" Canby continued, \"Though the body count is high, all of the people killed are faceless or only minor characters, until the end. It's as if the movie were saying that lethal violence is acceptable (and fun) as long as the victims - like the victims of guided missiles and high-altitude bombing - remain anonymous. Any comedy that allows the mind to ponder high-altitude bombing is in deep trouble.\"[6]Los Angeles Times critic Peter Rainer also gave a negative review, calling it \"a crude rehashing of the high points of the first film\" and singling out director Hill, who he said \"surely recognizes the hollowness of what he's doing here. He tries to ram through the muddled exposition as quickly as possible; essentially, the film is wall-to-wall mayhem, with more shots of hurled bodies shattering windows than I've ever seen in a movie.\"[7]"}