{"country":"United States","distributed_by":"Universal Pictures","Award Nomination":"Helen Reddy was nominated at the Golden Globe Awards for Golden Globe Award for New Star Of The Year-Actress/Most Promising Newcomer-Female.","Plot":"Columbia Air Lines' Flight 409 is a Boeing 747-100 on a red-eye route from Washington Dulles International Airport to Los Angeles International Airport. Scott Freeman, meanwhile, is a New Mexican businessman flying his private Beechcraft Baron to an urgent sales meeting in Boise, Idaho. However, an occluded front has the entire West Coast socked in, with Los Angeles reporting zero visibility. Columbia 409 and Freeman's Beechcraft are both diverted to Salt Lake City International Airport.Salt Lake air traffic control assigns Columbia 409 to land ahead of Freeman's Beechcraft. As Columbia 409 is about to start its descent, First Officer Urias unlocks himself from his seat to check out a vibration. Just then, Freeman suffers a massive heart attack and descends into the approach of Columbia 409. The Beechcraft impacts Columbia 409 just above the co-pilot seat, blowing Urias out of the plane to his death and killing Flight Engineer Julio. Captain Stacy is struck in the face by debris and is blinded. Nancy Pryor, the First Stewardess, rushes to the flight deck, where Captain Stacy is able to engage the autopilot and the altitude hold switch before losing consciousness.Pryor informs the Salt Lake control tower that the crew is dead or badly injured and that there is no one to fly the plane. She gives an assessment of the damage as a large hole on the right side of the flight deck that wiped out most of the instrument gauges over the engineer station. Joe Patroni, Columbia's Vice President of Operations, is apprised of Columbia 409's situation. He seeks the advice of Captain Al Murdock, Columbia's chief flight instructor, who also happens to be Nancy Pryor's boyfriend, even though their relationship was \"on the rocks\" at that time.Patroni and Murdock take the airline's executive jet to Salt Lake. En route, they communicate with Pryor, learning that the autopilot is keeping the aircraft in level flight, but it is inoperable for turns. The jet is heading into the Wasatch Mountains, so Murdock starts to guide Pryor by radio on how to perform the turn when radio communications are interrupted and the Salt Lake tower is unable to restore contact.Unable to turn, leaking fuel and dodging the peaks of the Wasatch Mountains, an air-to-air rescue attempt is undertaken from a jet-powered HH-53 helicopter flown by the USAF Aerospace Rescue and Recovery Service. While a replacement pilot is preparing to be released on a tether from the helicopter to Columbia 409, Captain Stacy is able to give a cryptic clue regarding the decrease in airspeed during a climb in altitude. Pryor realizes that she must accelerate to be able to climb over the mountain and successfully does so. After Columbia 409 has leveled off, the replacement pilot is released towards the stricken airliner. Just as Pryor is helping him in, the release cord from his harness becomes caught in the jagged metal surrounding the hole in the cockpit. As he climbs in, his harness is released from the tether and he falls from the aircraft.The only other person on the helicopter who can land a 747 is Captain Murdock. He is tethered to the helicopter, lowered to the jet and successfully enters it through the hole in the cockpit. He then lands the plane safely at Salt Lake City Airport, where the flight attendants successfully conduct an emergency evacuation of the passengers via the inflatable slides as Pryor and Murdock reconcile.","language":"English","Reception":"Airport 1975 was a massive commercial success, with a budget of $3 million[1] the film made over $47 million[2] at the box office, making it the seventh highest-grossing film of 1974 and the year's third highest-grossing disaster film, behind The Towering Inferno and Earthquake.Critical reception was mainly unfavourable with The New Yorker magazine's film critic Pauline Kael calling the picture \"cut-rate swill\", \"produced on a TV-movie budget by mercenary businessmen\". Kael also thought the audio problems gave Karen Black's voice a metallic sound that was grating and that the main character, a stewardess, was constantly being patronized by men.[7]Airport 1975 was included in the book The Fifty Worst Films of All Time published in 1978. The film is listed in Golden Raspberry Award founder John Wilson's book The Official Razzie Movie Guide as one of The 100 Most Enjoyably Bad Movies Ever Made.[8]This is one among many of a class of disaster films that became a popular craze during the 1970s. Its plot devices and characterizations, including a singing nun (Helen Reddy), a former glamorous star (Gloria Swanson as herself), an alcoholic (Myrna Loy), a child in need of an organ transplant (Linda Blair) and a chatterbox (Sid Caesar) were parodied in 1980's Airplane! and on The Carol Burnett Show as \"Disaster '75\".","box_office":"$47,285,152[2]","cinematography":"Philip H. Lathrop","directed_by":"Jack Smight","airport_1975":"Theatrical release poster","release_dates":"October 18, 1974 (1974-10-18)|||||","Production":"Airport 1975 used a Boeing 747-123 Freighter (cargo variant) s/n 20390 (registration N9675), leased from American Airlines.[6]","produced_by":"William Frye Jennings Lang","starring":"Charlton Heston Karen Black George Kennedy Efrem Zimbalist, Jr. Susan Clark Erik Estrada","running_time":"106 min.","music_by":"John Cacavas","edited_by":"J. Terry Williams","written_by":"Screenplay: Don Ingalls Novel: Arthur Hailey","budget":"$3 million[1]"}