{"country":"Iceland|Norway[1]|","distributed_by":"Well Go USA Entertainment (US)","Plot":"Martin and his friends draw the ire of Nazi zombies after unwittingly taking their gold. When Martin is bitten on the arm, he removes the infected arm with a chainsaw. After returning their gold to the Nazi zombies, Martin realizes he forgot a coin. The zombies chase after him, and their commander, Herzog, tenaciously holds on to Martin's car as he flees. An oncoming truck slices off Herzog's arm, which remains in the car with Martin. After Martin is involved in an accident, he wakes in a hospital. The police disbelieve his wild stories about zombies and charge him with the murder of his friends. To his horror, Martin finds that a surgeon has attached Herzog's arm to his stump. The zombie arm goes berserk and attacks everyone within reach. After Martin kills several people against his will, he is sedated and strapped tightly to the bed.Bobby, a young American tourist, sneaks into Martin's room when he hears rumors of a zombie attack. Impressed with Martin's zombie arm, Bobby frees Martin and tells him about the Zombie Squad, American professional zombie hunters. Before Bobby can contact them, the zombie arm throws Bobby out a window. Panicked, Martin follows and administers CPR. The zombie arm instead crushes Bobby's chest, killing him. Martin flees the police, who believe him a child killer, and makes contact with the Zombie Squad, who promise to come to Norway and assist. In the meantime, they ask Martin to find out what Herzog wants. After the call, the Zombie Squad is revealed to be three nerdy friends: Daniel, Monica, and Blake.At a World War II museum, Martin meets Glenn Kenneth. After the zombie arm intimidates him, Glenn tells Martin about Herzog's history: Herzog was originally tasked by Hitler himself to wipe out a Norwegian town for their anti-Nazi sabotage. As Martin realizes Herzog intends to carry out his orders, Herzog and his Nazi zombies attack a group of tourists outside the museum. After the battle, he resurrects the dead and takes a World War II-era Tiger tank. Martin and Glenn escape death by pretending to be mannequins in the museum. While surveying the carnage, Martin accidentally discovers that his zombie arm can also raise the dead. When Daniel arrives, he kills Martin's sidekick zombie; Martin demonstrates his newfound power by raising it again.Martin, Daniel, and the sidekick zombie race to find a graveyard where Russian POWs were buried, as Monica, Blake, and Glenn work to slow down Herzog. Monica and Blake convince Glenn to act as bait to draw some of the zombies into a local swamp, where they kill them with pipebombs they made from the supplies they had. After shooting at them with the tank gun several times, Herzog continues on his way, believing Blake, Glenn and Monica to be dead. Meanwhile, the others discover the graveyard, and Martin raises an entire troop of loyal Russian zombies. All converge at the town, where Martin confronts Herzog. Martin points out that they have evacuated the townspeople and thus prevented Herzog from completing his orders, but Herzog does not care and attacks them.The battle goes well at first, but the Nazi zombies eventually overpower Martin's Russian zombies. As the Nazi zombies close in on them, Daniel tells Martin to kill Herzog, as it is their only chance. Daniel attempts to take control of the Nazi zombie's tank, Martin directly confronts Herzog, and the others fight Herzog's remaining zombies. Glenn is killed by a sneaky knife attack to the throat by a Nazi zombie, and Monica and Blake are about to be overwhelmed when Daniel fires the tank gun directly at Herzog while Martin keeps him distracted. Herzog is decapitated and the head goes far off into the further away mountains, and his troops fall lifelessly to the ground, saving Monica and Blake.After they celebrate, Martin drives to the church where Hanna is buried, digs up her corpse, and brings her back as a zombie. The two proceed to make out and have sex as the sidekick zombie looks on in the distance. In a post-credits scene, a Nazi scientist zombie is seen holding Herzog's conscious head.","language":"English Norwegian","box_office":"$37,473[2]","cinematography":"Matthew Weston","production_company":"Saga Film Tappeluft Pictures The Fyzz Facility XYZ Films","directed_by":"Tommy Wirkola","dead_snow:_red_vs._dead":"Theatrical release poster","release_dates":"19 January 2014 (2014-01-19) (Sundance)|12 February 2014 (2014-02-12) (Norway)||||","Production":"Dead Snow: Red vs Dead was shot in both English and Norwegian at the same time.[3] Filming took place in Iceland. Many of the zombies were professional mixed martial arts fighters, and Wirkola found it easy to direct them, as they were willing to perform showy stunts.[4]","produced_by":"Terje Strømstad|Kjetil Omberg|","starring":"Vegar Hoel|Orjan Gamst|Martin Starr|Ingrid Haas|Jocelyn DeBoer|Stig Frode Henriksen|Kristoffer Joner|","running_time":"100 minutes","music_by":"Christian Wibe","edited_by":"Martin Stoltz","Release":"Dead Snow: Red vs. Dead had its world premiere at the 2014 Sundance Film Festival on 19 January 2014[5] before being released in its home country of Norway on 12 February.[citation needed] The film screened at the Stanley Film Festival on 25 April 2014.[citation needed] It was released online on 7 October 2014 before receiving a limited theatrical release in the US on 10 October.[6] Well Go USA released the film on home video on 9 December 2014 in the US,[7] and Entertainment One released the DVD and Blu-ray on 12 January 2015 in the United Kingdom.[8]Rotten Tomatoes, a review aggregator, reports that 83% of 29 surveyed critics gave the film a positive review; the average rating is 6.8/10. The site's consensus reads: \"Dead Snow 2: Red vs. Dead expands the original's canvas without sacrificing any of its bloody fun, adding up to a sequel that fans of the first are bound to enjoy.\"[9] On Metacritic, the film has a 59/100 rating based on 10 reviews, signifying \"mixed or average reviews\".[10]Dennis Harvey of Variety criticized the film's Troma-style tone and described the addition of the American characters as pandering to international audiences.[11] Boyd van Hoeij of The Hollywood Reporter summed up the film as \"cartoon violence and action, gore and humor, all rolled into one schlocky but enjoyable package\".[12] Jeannette Catsoulis of The New York Times wrote, \"...if the movie’s hilariously cruel treatment of the halt and the lame upsets you, you can enjoy the crisp cinematography, operatically repulsive effects and frequently witty dialogue.\"[13] Robert Abele of the Los Angeles Times wrote, \"As bad-taste splatter comedies go, Dead Snow 2 is one of the more charitably nutty ones, less about gorging on gore than reveling in how silly the whole genre can be.\"[14] Clark Collis of Entertainment Weekly rated it B and called it \"dementedly enjoyable\".[15]Ryan Daley of Bloody Disgusting rated it 4/5 stars and called the film \"a textbook example of a talented director using extreme violence as a cathartic safety valve\".[16] Brad McHargue of Dread Central rated it 4/5 stars and wrote, \"Dead Snow 2 is an utterly silly film that revels in its absurdity, and that’s why it works.\"[17]","written_by":"Tommy Wirkola|Stig Frode Henriksen|Vegar Hoel|"}