{"country":"Spain","distributed_by":"Lola Films","el_lute:_camina_o_revienta":"Theatrical release poster","DVD release":"El Lute: camina o revienta is available in Region 1 DVD in Spanish with English subtitles. The second part, El Lute II: mañana sere libre, is included in the same DVD.","language":"Spanish","Reception":"El Lute:camina o revienta opened in September 1987 at the San Sebastian International Film Festival; Imanol Arias and Victoria Abril were awarded best actor and best actress. In Spain, the film was a great success with critics and audiences.","box_office":"2.586.728,38 €","Synopsis":"In Spain of the 1960s, a poor family of quinquis (mercheros), a nomadic ethnic group with a tradition as old as that of the gitanos (gypsies) of Spain and of obscure origins, live as poor nomads. They craft tin goods and repair metal. The son, Eleuterio Sánchez Rodriguez, nicknamed \"El Lute\", steals some chickens and is condemned to six months in jail.El Lute moves to the slum outskirts of Madrid with his common-law wife, Chelo. He starts an itinerant life as a peddler of pots and pans, and they live with their infant daughter in a quinqui shantytown. He gradually embarks upon as life of petty criminality. He participates in the robbery of a jewelry store, during which a guard is killed.The Guardia Civil catch up with him fast. He is arrested again, but even under torture, he refuses to reveal the identities of his partners in crime. The two other suspects were soon arrested. All three were convicted and sentenced to death for murder. A last minute reprieve by General Franco saves their lives in the last minute, commuting the sentence to 30 years in military prison.Later, while being escorted by two civil guards in a train, El Lute escapes. He eluded a nationwide manhunt for several weeks despite having a broken arm. The Civil Guards eventually track him down and return him to prison.Thanks to his daring escape from police custody and anti-Franco stance, El Lute becomes a folk hero and symbol of oppression of the poor under Franco.","Tag line":"\"Survival by any means was his only option.\"","cinematography":"José Luis Alcaine","directed_by":"Vicente Aranda","Analysis":"Director, Vicente Aranda became well known in the 1980s due to his adaptations of literary works to film. For El Lute, camina o revienta, Aranda left fiction and based his film on the 1977 autobiography of the infamous Eleuterio Sánchez, El Lute.Aranda also adapted El Lute's second volume of memoir, published in 1979, which he released as El Lute II, mañana seré libre (1988) (El Lute: Tomorrow I'll be Free). While in prison, he learns to read, goes on to earn a law degree, and writes five books, two volumes of his autobiography published while he is still in prison.The films together are sometime grim but always gripping. Despite its length it never, flags in interest, both in respect to the human adventures being lived and in its reflection of the final years of Franco's Spain.Forced by social deprivation into delinquency in the 1960s, El Lute is elevated to folk hero by way of his resistance to authoritarian injustice. Aranda's hybrid combination of period drama, thriller and social realism reveals how the authorities manipulated and exploited the criminal career of this petty thief as a diversionary tactic at a time of political unrest in Spain. Employing the motifs of the thriller genre, the film presents the adventures of a man confronted with an adverse destiny and environment whose desire for freedom leads him to self-education and discovery. The film has a strong realistic and political tone, and it is a resounding critique of Franco's regime and its brutal treatment of an oppressed minority.","release_dates":"9 October 1987 (1987-10-09)|||||","produced_by":"José Maria Cunillés Isabel Mulá","starring":"Imanol Arias Victoria Abril Antonio Valero","running_time":"122 minutes","Theme":"The main theme of the films is the powerful individual response to injustice.","music_by":"José Nieto","edited_by":"Tersea Font","written_by":"Vicente Aranda Joaquim Jordá"}