{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Film publicist Lee Phillips (Billy Crystal) is tasked with promoting a film featuring movie stars Gwen Harrison (Catherine Zeta-Jones) and Eddie Thomas (John Cusack). His job is complicated by the fact that the eccentric director of the film, Hal Weidmann (Christopher Walken), refuses to show him a cut of the film and demands the first viewing take place at a press junket. To promote the film, Lee decides to focus on the two stars: Gwen and Eddie, once known as \"America's Sweethearts\". Unfortunately, they are now going through an ugly split. As a result of Gwen's affair with Hector (Hank Azaria), Eddie has an emotional breakdown and is at a New Age retreat. Lee decides that his best chance to promote the film is to reunite the couple.He tries to get them to attend the junket, playing on Gwen's ego by telling her she will look better to the press and her fans if she attends (and she will be able to serve Eddie with divorce papers). Lee bribes the retreat owner with a car to convince Eddie to come. Gwen's sister and personal assistant, Kiki (Julia Roberts), and Gwen's lover (Hector) are also involved. When Eddie sees her at the junket she has lost weight and is now physically attractive.As the junket begins, Eddie and Gwen are forced together as well as Kiki and Hector. Gwen encourages Kiki to be her go-between with Eddie so she can have some alone time with Hector. Eddie and Kiki begin to warm to each other. At first, Gwen is oblivious, but eventually discovers Kiki's feelings for Eddie. Out of her own desire to maintain her career by convincing the press that they are trying to reconcile, Gwen tries to prevent a blossoming relationship between Kiki and Eddie with her manipulation. She succeeds in hurting Kiki's feeling and causing her to eat again. However, Gwen's behavior enrages Eddie who always seen past her for the person she is and also sees his marriage for what it really is. He admits to Lee that he's in love with Kiki and has always liked her for the person she is inside and out. Realizing this along with how unhappy Eddie was with Gwen, Lee encourages him to tell Kiki and end his marriage to Gwen anyway.When the film is shown, the press, cast and crew discover that Weidmann junked the script; he made a \"reality movie\", composed of footage shot making the film (most without the actors' knowledge). The footage shows Gwen as self-centered, conniving and manipulative; Eddie is seen as a decent man who becomes paranoid as he begins to suspect that his wife is having an affair. Gwen and Hector are the antagonists, Eddie is the protagonist and Kiki is his love interest in the story. The cast and crew--particularly Gwen--are offended by the direction that Weidmann went with instead of sticking to the movie script and demands an explanation. Eddie is the only cast member pleased with Weidmann's direction and wants to work with him again. Because of praise from the press, the studio is forced to release the film (Weidmann's plan all along, this include ruining Gwen's career and reviving Eddie's).Gwen tries to salvage the situation by announcing that she is reconciling with Eddie. However, he sees past it and openly admits that he's done with her. Eddie mentions their relationship was a mistake and declares his love for Kiki. She reciprocates and stands up to Gwen for the first time. Kiki is fired by Gwen when she reveals dirty secrets about Gwen while they were growing up that even the press, the cast and crew who watched the \"reality movie\" didn't know about. After the junket, Gwen selfishly admits to the press that she and Eddie are through and saying she's in love with Hector. However, their relationship is seen to be disintegrating after Hector overheard Gwen insulting him in the film in addition to the revelation that Hector himself had an affair with Weidmann's young daughter. Kiki and Eddie prepare to leave the hotel together. Before they do, Lee catches them kissing and is happy for the two.","language":"English","america's_sweethearts":"Theatrical release poster","box_office":"$138.2 million[3]","cinematography":"Phedon Papamichael Jr.","directed_by":"Joe Roth","production_companies":"Revolution Studios Face Productions Roth-Arnold Productions Shoelace Productions","release_dates":"July 20, 2001 (2001-07-20)|||||","produced_by":"Susan Arnold|Billy Crystal|Donna Roth|","starring":"Julia Roberts|Billy Crystal|Catherine Zeta-Jones|John Cusack|","running_time":"103 minutes[1]","music_by":"James Newton Howard","edited_by":"Stephen A. Rotter","Release":"America's Sweethearts opened on July 20, 2001 and earned $30,181,877 in its opening weekend, ranking second behind Jurassic Park III ($50,771,645).[4] By the end of its run, the film had grossed $93,607,673 in the domestic box office and $44,583,755 overseas for a worldwide total of $138,191,428. Based on a $46 million budget, the film was a box office success.[3]Despite being a box office success, the film's reviews were generally unfavorable, with a 31% approval rating at Rotten Tomatoes. The site's consensus states: \"Despite its famous cast, the movie lacks sympathetic characters and is only funny in spurts.\"[5] On Metacritic, the film holds a 44 out of 100 rating based on 32 reviews, indicating \"mixed or average reviews\".[6]","written_by":"Billy Crystal|Peter Tolan|","budget":"$64.4 million[2]"}