{"country":"United States","distributed_by":"Media Home Entertainment, Qui Productions, Televicine International","language":"English","Reception":"The film won a Dramatic Films Award at the 1982 Sundance Film Festival.[5] Circle of Power played under the title Mystique at the 1981 Chicago International Film Festival.[1]A review in The New York Times described Circle of Power as an \"attack on monolithic belief systems,\" and referred to it as \"a worthwhile movie.\"[3] Roger Ebert gave the film three stars, writing that \"...it's an entertaining film with serious intentions.\"[1] Ebert compared it to events reported in Boston newspapers about a man who died during a seminar, commenting: \"Art anticipates life.\"[1] Ebert questioned the conceit of the film, asking the question: \"Could a major corporation get away with this brainwashing?\"[1] The authors of the book upon which the film was based concluded their preface by stating: \"And please remember as you read -- it's true.\"[6]","cinematography":"Affonso Beato","directed_by":"Bobby Roth","Plot synopsis":"Yvette Mimieux plays the chief executive of a giant corporation called \"Mystique\",[1] but the organization is also known as \"Executive Development Training\", or EDT.[2] Christopher Allport plays Jack Nilsson, a decent all-American young executive.[3]Top management executives are required to spend a weekend with Bianca Ray at a hotel, where they are put under psychological pressure.[1] As a prerequisite to the training course, participants must sign a waiver giving the company the release to physically and psychologically abuse the individuals in the course.[3] The participants struggle with their shortcomings, such as obesity and alcoholism.[3] Another individual is a closet homosexual, and a fourth is a transvestite.[2] At one point in the film, the obese trainee is forced to eat trash and discarded food in front of the other seminar participants.[2] Eventually, the seminar executives and their wives lose their inhibitions later on in the \"consciousness-raising\" coursework.[4]","release_dates":"1981","produced_by":"Gary Mehlman Anthony Quinn Jeffrey White","starring":"Yvette Mimieux, Christopher Allport, Cindy Pickett, John Considine, Walter Olkewicz","running_time":"98 minutes","circle_of_power":"Executives embracing after participating in \"Executive Development Training\"","music_by":"Richard Markowitz","edited_by":"Gail Yasunaga","written_by":"Beth Sullivan (screenplay), Gene Church (book)"}