{"Impact":"Since the release of the film, the band has received a second wave of popularity and success. This includes an appearance at Download Festival 2009 headlining the Tuborg stage and support slots for both AC/DC and Saxon. The band also performed on The Tonight Show with Conan O'Brien around this time. Anvil toured the US in 2010.","country":"United States","distributed_by":"Abramorama","anvil!_the_story_of_anvil":"Promotional film poster","Plot":"The film begins by listing the headlining acts of the Super Rock festival held in Japan in 1984: Scorpions, Whitesnake, and Bon Jovi, all of whom have gone on to sell millions of records, except one: Anvil. Despite their ambition, the Canadian band was unable to achieve the same level of success. Instead, singer and guitarist Steve \"Lips\" Kudlow drives trucks for Children's Choice Catering, delivering food to schools and institutions. Drummer Robb Reiner works in construction. But both would rather be playing on stage at the local sports bar to their small but dedicated group of fans, as shown during a show for Steve's 50th birthday party.Kudlow gets an email from a European fan named Tiziana Arrigoni, who offers to set up a European tour for the band, estimating 1500 Euros per show. The tour has a promising start at the Sweden Rock festival, where the group interacts with Michael Schenker and Carmine Appice, but it quickly goes downhill. Trains are full before the band can buy tickets, they miss travel connections altogether, they get lost in Prague due to language barriers and scuffle with the bar owner who refuses to pay since the band was two hours late, they play to mostly empty rooms and complain about the lack of promotion, eventually running out of money and sleeping in a train station. At one point, Reiner refuses to perform and announces he's quitting from the band, only to be persuaded by Kudlow to stick it out. The final concert of the tour is the Monsters of Transylvania rock concert, held in a 10,000 seat arena and promising a crowd of 5,000. Only 174 people show up.The band returns to Canada having taken five weeks off of work and making no money. Kudlow describes the financial difficulties that have befallen the band, including his own second mortgage, and bassist Glenn Five's homelessness. Guitarist Ivan Hurd ends up marrying Tiziana, and Anvil plays at the wedding reception as a handful of family members watch politely. Reiner describes his other passion, painting, focusing on themes of solitude.Kudlow notes that recent Anvil albums have not been as well written or produced as earlier efforts, such as Metal on Metal, and sends a rough demo tape to the producer of that record, Chris \"CT\" Tsangarides. Tsangarides replies to Kudlow that he feels the songs have potential, and after a face to face meeting they decide to record their 13th album, This Is Thirteen. The band still needs to raise the £13,000 to finance the recording. He returns to Canada and tries to raise the money as a telemarketer selling sunglasses, but does not make a single sale. Eventually, he borrows the money from his sister Rhonda.The band spends over a month recording in Dover, England. After several stressful weeks of recording, an argument ensues between Kudlow and Reiner over the quality of each other's recording takes. The argument turns heated and Reiner threatens to quit again, but they are able to reconcile and finish recording the album. Kudlow and Reiner try unsuccessfully to market it to several record labels (notably EMI Canada), but decide to sell the album themselves through internet and concert sales. Despite the lack of major label distribution, Kudlow considers the recording process and finished album a success, stating that the band was able to stay true to their roots and form/maintain strong relationships with family and friends.Kudlow receives a phone call asking Anvil to play a concert in Japan. Excitedly, the group returns to the site that marked the highlight of their career. Their spirits are dampened when they realize they are the very first act at a three-day festival, taking the stage at 11:35 am. Fearing disaster, the group however takes the stage to a large, receptive crowd.","language":"English","Reception":"The film has received praise and high acclaim in many reviews, receiving a 98% rating on Rotten Tomatoes.[5][6][7][8][9][10][11][12] The Times called it \"possibly the greatest film yet made about rock and roll\".[13]The film was named Best Documentary of 2009 at the Evening Standard British Film Awards in London. Chris Martin of Coldplay presented the award. The film won Best Documentary at the 2010 Independent Spirit Awards in Los Angeles. It also won an Emmy for Outstanding Arts & Culture Programming in 2010.[14]Steve Kudlow: \"One of my heroes is Ian Anderson from Jethro Tull, and he came up to me in Heathrow Airport and told me the movie had completely inspired him to keep playing music, and he just kept thanking me for all of the inspiration my band gave him. I mean, this is Ian Anderson from Jethro Tull—how cool is that?”[15]","box_office":"$951,380[1]","cinematography":"Christopher Soos","directed_by":"Sacha Gervasi","release_dates":"January 18, 2008 (2008-01-18) (Sundance Film Festival)|February 20, 2009 (2009-02-20) (United States)||||","Production":"Gervasi first met Anvil on September 21, 1982, after a gig at The Marquee Club in London, where he introduced himself to the band as \"England's number-one Anvil fan.\" He subsequently became a roadie for the band on their '82, '84 and '85 tours, and was given the nickname \"Teabag\" by the band.[2] He reunited with Anvil after a break of 20 years, and started shooting a documentary about them in November 2005.[2]","produced_by":"Sacha Gervasi Lauren McClard Dana Sano Christopher Soos Rebecca Yeldham","starring":"Anvil","running_time":"81 minutes","music_by":"David Norland","edited_by":"Andrew Dickler Jeff Renfroe","Release":"The film premiered at the Sundance Film Festival in January 2008, and won Audience Awards at the 2008 Sydney Film Festival, Los Angeles Film Festival and Galway International Film Festival. The film has been nominated in the \"Truer Than Fiction\" category of Film Independent's 2009 Independent Spirit Awards. The award recognizes emerging directors of non-fiction films.[3][4]Since its first season, VH1 Classic's That Metal Show has supported the film, and on March 28, 2009, Kudlow and Reiner were the show's featured guests. It was picked up for distribution in the United States by VH1 under their VH1 Rock Docs label, and opened to limited release on April 10, 2009. The band also went on the road with the film for what was dubbed The Anvil Experience.In North America, the film was released on DVD on October 6, 2009. Distribution was handled by Fontana Distribution on behalf of VH1."}