{"country":"United Kingdom[3]|United States[3]|","distributed_by":"Metro-Goldwyn-Mayer","Sequels and adaptations":"Kubrick did not envision a sequel to 2001. Fearing the later exploitation and recycling of his material in other productions (as was done with the props from MGM's Forbidden Planet), he ordered all sets, props, miniatures, production blueprints, and prints of unused scenes destroyed. Most of these materials were lost, with some exceptions: a 2001 spacesuit backpack appeared in the \"Close Up\" episode of the Gerry Anderson series UFO,[1][48][210][211][212] and one of Hal's eyepieces is in the possession of the author of Hal's Legacy, David G. Stork. In 2012 Lockheed engineer Adam Johnson, working with Frederick I. Ordway III, science adviser to Kubrick, wrote the book 2001: The Lost Science, which for the first time featured many of the blueprints of the spacecraft and film sets that previously had been thought destroyed.Clarke wrote three sequel novels: 2010: Odyssey Two (1982), 2061: Odyssey Three (1987), and 3001: The Final Odyssey (1997). The only filmed sequel, 2010, was based on Clarke's 1982 novel and was released in 1984. Kubrick was not involved in the production of this film, which was directed by Peter Hyams in a more conventional style with more dialogue. Clarke saw it as a fitting adaptation of his novel,[213] and had a brief cameo appearance in the film. As Kubrick had ordered all models and blueprints from 2001 destroyed, Hyams was forced to recreate these models from scratch for 2010. Hyams also claimed that he would not have made the film had he not received both Kubrick's and Clarke's blessings:I had a long conversation with Stanley and told him what was going on. If it met with his approval, I would do the film; and if it didn't, I wouldn't. I certainly would not have thought of doing the film if I had not gotten the blessing of Kubrick. He's one of my idols; simply one of the greatest talents that's ever walked the Earth. He more or less said, \"Sure. Go do it. I don't care.\" And another time he said, \"Don't be afraid. Just go do your own movie.\"[214]The other two novels have not been adapted for the screen, although actor Tom Hanks has expressed interest in possible adaptations.[215]In 2012, two screenplay adaptations of both 2061 and 3001 were posted on the 2001:Exhibit website, in the hopes of generating interest in both MGM and Warner Bros. to adapt the last two novels into films.[216]Beginning in 1976, Marvel Comics published a comic adaptation of the film written and drawn by Jack Kirby, and a 10-issue monthly series expanding on the ideas of the film and novel, also created by Kirby.","language":"English","box_office":"$138–190 million[6][7]","cinematography":"Geoffrey Unsworth","directed_by":"Stanley Kubrick","Accolades and honors":"2001 earned Stanley Kubrick an Academy Award for Best Visual Effects, as well as nominations for Best Director and Original Screenplay (shared with Arthur C. Clarke). Anthony Masters was also nominated for Best Art Direction. An honorary award was made to John Chambers in that year for his make-up work on Planet of the Apes, and Clarke reports that he \"wondered, as loudly as possible, whether the judges had passed over 2001 because they thought we had used real ape-men\".[170] The film won four Baftas, for Art Direction, Cinematography, Sound Track and as Best Road Show, and was a nominee in the Best Film category.[171]The National Board of Review listed 2001 among the Top Ten Films of 1968,[172] and Kansas City Film Critics gave it both the Best Film and Best Director awards.[173] Kubrick earned the Hugo Award for Best Dramatic Presentation,[160] and was nominated for both the Directors Guild of America Award,[174] and the Laurel Award (on which 2001 was named the Best Road Show of 1968).[175] Both the Cinema Writers Circle of Spain and the David di Donatello Awards in Italy named 2001 the best foreign production of 1968.[176][177]2001 was No. 15 on AFI's 2007 100 Years ... 100 Movies, was named No. 40 on its 100 Years, 100 Thrills, was included on its 100 Years, 100 Quotes (\"Open the pod bay doors, Hal.\"), and Hal 9000 is the No. 13 villain in the AFI's 100 Years... 100 Heroes and Villains.[178] 2001 is the only science fiction film to make the Sight & Sound poll for ten best films, and tops the Online Film Critics Society list of \"greatest science fiction films of all time.\"[179] In 1991, this film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in the National Film Registry.[180] Other lists that include the film are 50 Films to See Before You Die (#6), The Village Voice 100 Best Films of the 20th century (#11), the Sight & Sound Top Ten poll (#6),[181] and Roger Ebert's Top Ten (1968) (#2). In 1995, the Vatican named it as one of the 45 best films ever made (and included it in a sub-list of the \"Top Ten Art Movies\" of all time.)[182]In 2011, the film was the third most screened film in secondary schools in the United Kingdom.[183]","release_dates":"April 2, 1968 (1968-04-02) (Uptown Theater)|April 3, 1968 (1968-04-03) (United States)|May 15, 1968 (1968-05-15) (United Kingdom)|||","Production":"Principal photography began December 29, 1965, in Stage H at Shepperton Studios, Shepperton, England. The studio was chosen because it could house the 60-by-120-by-60-foot (18 m × 37 m × 18 m) pit for the Tycho crater excavation scene, the first to be shot.[55][56] The production moved in January 1966 to the smaller MGM-British Studios in Borehamwood, where the live action and special effects filming was done, starting with the scenes involving Floyd on the Orion spaceplane;[57] it was described as a \"huge throbbing nerve center ... with much the same frenetic atmosphere as a Cape Kennedy blockhouse during the final stages of Countdown.\"[58] The only scene not filmed in a studio—and the last live-action scene shot for the film—was the skull-smashing sequence, in which Moonwatcher (Richter) wields his new-found bone \"weapon-tool\" against a pile of nearby animal bones. A small elevated platform was built in a field near the studio so that the camera could shoot upward with the sky as background, avoiding cars and trucks passing by in the distance.[59][60]Filming of actors was completed in September 1967,[61] and from June 1966 until March 1968 Kubrick spent most of his time working on the 205 special effects shots in the film.[32] The director ordered the special effects technicians on 2001 to use the painstaking process of creating all visual effects seen in the film \"in camera\", avoiding degraded picture quality from the use of blue screen and traveling matte techniques. Although this technique, known as \"held takes\", resulted in a much better image, it meant exposed film would be stored for long periods of time between shots, sometimes as long as a year.[62] In March 1968, Kubrick finished the 'pre-premiere' editing of the film, making his final cuts just days before the film's general release in April 1968.[32]The film was initially planned to be photographed in 3-film-strip Cinerama (like How the West Was Won), because it was a part of a production/distribution deal between MGM and Cinerama Releasing Corporation, but that was changed to Super Panavision 70 (which uses a single-strip 65 mm negative) on the advice of special photographic effects supervisor Douglas Trumbull, due to distortion problems with the 3-strip system.[63] Color processing and 35 mm release prints were done using Technicolor's dye transfer process. The 70 mm prints were made by MGM Laboratories, Inc. on Metrocolor. The production was $4.5 million over the initial $6.0 million budget, and sixteen months behind schedule.[55]Russian documentarian Pavel Klushantsev's 1957 film Road to the Stars is believed to have significantly influenced Kubrick's technique in 2001: A Space Odyssey, particularly in its accurate depiction of weightlessness and a rotating space station. Encyclopedia Astronautica describes some scenes from 2001 as a \"shot-for-shot duplication of Road to the Stars\".[64] Specific comparisons of shots from the two films have been analyzed by the filmmaker Alessandro Cima.[64] A 1994 article in American Cinematographer says, \"When Stanley Kubrick made 2001: a Space Odyssey in 1968, he claimed to have been first to fly actor/astronauts on wires with the camera on the ground, shooting vertically while the actor's body covered the wires\" but observes that Klushantsev had preceded him in this.[65]For the opening sequence involving tribes of apes, professional mime Daniel Richter in addition to playing the lead ape was also responsible for choreographing the movements of the other man-apes, who were mostly portrayed by his standing mime troupe.[59]Kubrick involved himself in every aspect of production, even choosing the fabric for his actors' costumes,[66] and selecting notable pieces of contemporary furniture for use in the film. When Floyd exits the Space Station V elevator, he is greeted by an attendant seated behind a slightly modified George Nelson Action Office desk from Herman Miller's 1964 \"Action Office\" series.[67] First introduced in 1968, the Action Office-style \"cubicle\" would eventually occupy 70 percent of office space by the mid-2000s.[68][69] Danish designer Arne Jacobsen designed the cutlery used by the Discovery astronauts in the film.[70][71][72]Other examples of modern furniture in the film are the bright red Djinn chairs seen prominently throughout the space station[73][74] and Eero Saarinen's 1956 pedestal tables. Olivier Mourgue, designer of the Djinn chair, has used the connection to 2001 in his advertising; a frame from the film's space station sequence and three production stills appear on the homepage of Mourgue's website.[75] Shortly before Kubrick's death, film critic Alexander Walker informed Kubrick of Mourgue's use of the film, joking to him \"You're keeping the price up\".[76] Commenting on their use in the film, Walker writes:Everyone recalls one early sequence in the film, the space hotel,[77] primarily because the custom-made Olivier Mourgue furnishings, those foam-filled sofas, undulant and serpentine, are covered in scarlet fabric and are the first stabs of color one sees. They resemble Rorschach \"blots\" against the pristine purity of the rest of the lobby.[78]Detailed instructions in relatively small print for various technological devices appear at several points in the film, the most visible of which are the lengthy instructions for the zero-gravity toilet on the Aries Moon shuttle. Similar detailed instructions for replacing the explosive bolts also appear on the hatches of the E.V.A. pods, most visibly in closeup just before Bowman's pod leaves the ship to rescue Frank Poole.[79]The film features an extensive use of Eurostile Bold Extended, Futura and other sans serif typefaces as design elements of the 2001 world.[80] Computer displays show high resolution fonts, color and graphics—far in advance of computers in the 1960s when the film was made.2001 pioneered the use of front projection with retroreflective matting. Kubrick used the technique to produce the backdrops in the Africa scenes and the scene when astronauts walk on the moon.[81]The technique consisted of a separate scenery projector set at a right-angle to the camera, and a half-silvered mirror placed at an angle in front that reflected the projected image forward in line with the camera lens onto a backdrop made of retroreflective material. The reflective directional screen behind the actors could reflect light from the projected image a hundred times more efficiently than the foreground subject did. The lighting of the foreground subject had to be balanced with the image from the screen, making the image from the scenery projector on the subject too faint to record. The exception was the eyes of the leopard in the \"Dawn of Man\" sequence, which glowed orange from the projector illumination. Kubrick described this as \"a happy accident\".[82]Front projection had been used in smaller settings before 2001, mostly for still photography or television production, using small still images and projectors. The expansive backdrops for the African scenes required a screen 40 feet (12 m) tall and 110 feet (34 m) wide, far larger than had been used before. When the reflective material was applied to the backdrop in 100-foot (30 m) strips, variations at the seams of the strips led to visual artifacts; to solve this, the crew tore the material into smaller chunks and applied them in a random \"camouflage\" pattern on the backdrop. The existing projectors using 4-×-5-inch (10 × 13 cm) transparencies resulted in grainy images when projected that large, so the crew worked with MGM's special effects supervisor Tom Howard to build a custom projector using 8-×-10-inch (20 × 25 cm) transparencies, which required the largest water-cooled arc lamp available.[82] The technique was used widely in the film industry afterwards until it was replaced by blue/green screen systems in the 1990s.To heighten the reality of the film very intricate models of the various spacecraft and locations were built. Their sizes ranged from about two foot long models of satellites and the Aries translunar shuttle up to a 55 foot long Discovery One spacecraft. \"In-camera\" techniques were again used as much as possible to combine models and background shots together to prevent degradation of the image through continual duplicating.[83]In shots where there was no perspective change, still shots of the models were photographed and positive paper prints were made. The image of the model was cut out of the photographic print and mounted on glass and filmed on an animation stand. The undeveloped film was re-wound to film the star background with the silhouette of the model photograph acting as a matte to block out where the spaceship image was.[84]Shots where the spacecraft had parts in motion or the perspective changed were shot by directly filming the model. For most shots the model was stationary and camera was driven along a track on a special mount, the motor of which was mechanically linked to the camera motor—making it possible to repeat camera moves and match speeds exactly. Elements of the scene were recorded on same piece of film in separate passes to combine the lit model, stars, planets, or other spacecraft in the same shot. In moving shots of the long Discovery One spacecraft, in order to keep the entire model in focus, multiple passes had to be made with the lighting on it blocked out section by section. In each pass the camera would be focused on the one lit section.[85] Many matting techniques were tried to block out the stars behind the models, with film makers sometimes resorting to hand tracing frame by frame around the image of the spacecraft (rotoscoping) to create the matte.[86][87]Some shots required exposing the film again to record previously filmed live action shots of the people appearing in the windows the spacecraft or structures, achieved by mounting projection devices inside the model or, when two dimensional photographs were used, projecting from the backside through a hole cut in the photograph.[88]All of the shots required multiple takes so that some film could be developed and printed to check exposure, density, alignment of elements, and to supply footage used in further elements such as matting.[89][90]For spacecraft interior shots, ostensibly containing a giant centrifuge that produces artificial gravity, Kubrick had a 30-short-ton (27 t) rotating \"ferris wheel\" built by Vickers-Armstrong Engineering Group at a cost of $750,000. The set was 38 feet (12 m) in diameter and 10 feet (3.0 m) wide.[91] Various scenes in the Discovery centrifuge were shot by securing set pieces within the wheel, then rotating it while the actor walked or ran in sync with its motion, keeping him at the bottom of the wheel as it turned. The camera could be fixed to the inside of the rotating wheel to show the actor walking completely \"around\" the set, or mounted in such a way that the wheel rotated independently of the stationary camera, as in the jogging scene where the camera appears to alternately precede and follow the running actor. The shots where the actors appear on opposite sides of the wheel required one of the actors to be strapped securely into place at the \"top\" of the wheel as it moved to allow the other actor to walk to the \"bottom\" of the wheel to join him. The most notable case is when Bowman enters the centrifuge from the central hub on a ladder, and joins Poole, who is eating on the other side of the centrifuge. This required Gary Lockwood to be strapped into a seat while Keir Dullea walked toward him from the opposite side of the wheel as it turned with him.[92]Another rotating set appeared in an earlier sequence on board the Aries translunar shuttle. A stewardess is shown preparing in-flight meals, then carrying them into a circular walkway. Attached to the set as it rotates 180 degrees, the camera's point of view remains constant, and she appears to walk up the \"side\" of the circular walkway, and steps, now in an \"upside-down\" orientation, into a connecting hallway.[93]The realistic-looking effects of the astronauts floating weightless in space and inside the spacecraft were accomplished by suspending the actors from wires attached to the top of the set, and placing the camera underneath them. The actors' bodies blocked the camera's view of the suspension wires, creating a very believable appearance of floating. For the shot of Poole floating into the pod's arms during Bowman's rescue attempt, a stuntman replaced a dummy on the wire to realistically portray the movements of an unconscious human, and was shot in slow motion to enhance the illusion of drifting through space.[94] The scene showing Bowman entering the emergency airlock from the E.V.A. pod was done in a similar way: an off-camera stagehand, standing on a platform, held the wire suspending Dullea above the camera positioned at the bottom of the vertically configured airlock. At the proper moment, the stagehand first loosened his grip on the wire, causing Dullea to fall toward the camera, then, while holding the wire firmly, he jumped off the platform, causing Dullea to ascend back up toward the hatch.[95]The colored lights in the Star Gate sequence were accomplished by slit-scan photography of thousands of high-contrast images on film, including Op art paintings, architectural drawings, Moiré patterns, printed circuits, and crystal structures. Known to staff as \"Manhattan Project\", the shots of various nebula-like phenomena, including the expanding star field, were colored paints and chemicals swirling in a pool-like device known as a cloud tank, shot in slow-motion in a dark room.[96] The live-action landscape shots in the 'Star Gate' sequence were filmed in the Hebridean islands, the mountains of northern Scotland, and Monument Valley. The coloring and negative-image effects were achieved by the use of different color filters in the process of making duplicate negatives.[97]Music plays a crucial part in 2001, and not only because of the relatively sparse dialogue. From very early on in production, Kubrick decided that he wanted the film to be a primarily nonverbal experience,[98] one that did not rely on the traditional techniques of narrative cinema, and in which music would play a vital role in evoking particular moods. About half the music in the film appears either before the first line of dialogue or after the final line. Almost no music is heard during any scenes with dialogue.The film is notable for its innovative use of classical music taken from existing commercial recordings. Most feature films then and now are typically accompanied by elaborate film scores or songs written specially for them by professional composers. In the early stages of production, Kubrick had actually commissioned a score for 2001 from Hollywood composer Alex North, who had written the score for Spartacus and also worked on Dr. Strangelove.[99] However, during postproduction, Kubrick chose to abandon North's music in favor of the now-familiar classical pieces he had earlier chosen as \"guide pieces\" for the soundtrack. North did not know of the abandonment of the score until after he saw the film's premiere screening.[100]Also engaged to score the film was composer Frank Cordell. Cordell stated in interviews that the score would primarily consist of arrangements of Gustav Mahler works.[101] This score remains unreleased. Like North's score, Cordell's work was recorded at the now demolished Anvil, Denham studios.[102]2001 is particularly remembered for using pieces of Johann Strauss II's best-known waltz, The Blue Danube, during the extended space-station docking and Lunar landing sequences. This is the result of the association that Kubrick made between the spinning motion of the satellites and the dancers of waltzes.[103] It also makes use of the opening from the Richard Strauss tone poem Also sprach Zarathustra[104] performed by the Vienna Philharmonic conducted by Herbert von Karajan. The use of Strauss's Zarathustra may be a reference to the theme of mankind's eventual replacement by supermen (Übermensch) in Nietzsche's work Thus Spoke Zarathustra.[34][105] Gayane's Adagio from Aram Khachaturian's Gayane ballet suite is heard during the sections that introduce Bowman and Poole aboard the Discovery, conveying a somewhat lonely and mournful quality.In addition to the majestic yet fairly traditional compositions by the two Strausses and Khachaturian, Kubrick used four highly modernistic compositions by György Ligeti that employ micropolyphony, the use of sustained dissonant chords that shift slowly. This technique was pioneered in Atmosphères, the only Ligeti piece heard in its entirety in the film. Ligeti admired Kubrick's film but, in addition to being irritated by Kubrick's failure to obtain permission directly from him, he was offended that his music was used in a film soundtrack shared by composers Johann and Richard Strauss.[106] Other music used is Ligeti's Lux Aeterna, the second movement of his Requiem and an electronically altered form of his Aventures, the last of which was also used without Ligeti's permission and is not listed in the film's credits.[107]Hal's version of the popular song \"Daisy Bell\" (referred to by Hal as \"Daisy\" in the film) was inspired by a computer-synthesized arrangement by Max Mathews, which Arthur C. Clarke had heard in 1962 at the Bell Laboratories Murray Hill facility when he was, coincidentally, visiting friend and colleague John R. Pierce. At that time, a speech synthesis demonstration was being performed by physicist John Larry Kelly, Jr., by using an IBM 704 computer to synthesize speech. Kelly's voice recorder synthesizer vocoder recreated the song \"Daisy Bell\" (\"Bicycle Built For Two\"); Max Mathews provided the musical accompaniment. Arthur C. Clarke was so impressed that he later used it in the screenplay and novel.[108]Many non-English language versions of the film do not use the song \"Daisy\". In the French soundtrack, Hal sings the French folk song \"Au Clair de la Lune\" while being disconnected.[109] In the German version, Hal sings the children's song \"Hänschen klein\" (\"Johnny Little\"),[110] and in the Italian version Hal sings \"Giro giro tondo\" (Ring a Ring o' Roses).[111]A recording of British light music composer Sidney Torch's \"Off Beat Moods Part 1\" was chosen by Kubrick as the theme for the fictitious BBC news programme \"The World Tonight\" seen aboard the Discovery.[112]On June 25, 2010, a version of the film specially remastered by Warner Bros, without the music soundtrack, opened the three hundred and fiftieth anniversary celebrations of the Royal Society at Southbank Centre in cooperation with the British Film Institute. The score was played live by the Philharmonia Orchestra and Choir.[113]On June 14, 2013, a repeat presentation of the film accompanied by live orchestra and choir was performed at Symphony Hall in Birmingham, again accompanied by the Philharmonia Orchestra conducted by Benjamin Wallfisch together with the choir Ex Cathedra.[114]A presentation of the film accompanied by live orchestra and choir premiered in the United States on August 18, 2015 at The Hollywood Bowl in Hollywood, California, accompanied by the Los Angeles Philharmonic conducted by Brad Lubman together with the choir Los Angeles Master Chorale.[115]Kubrick filmed several scenes that were deleted from the final film. These fall into two categories: scenes cut before any public screenings of the film, and scenes cut a few days after the world premiere on April 2, 1968.[116]The first ('pre-premiere') set of cuts included a school-room on the Lunar base—a painting class around a decorative fountain that included Kubrick's daughters, additional scenes of life on the base, and Floyd buying a bush baby from a department store via videophone for his daughter. Additionally, a ten-minute black-and-white opening sequence featuring interviews with actual scientists, including Freeman Dyson discussing off-Earth life,[117] were removed after an early screening for MGM executives.[118] The actual text survives in the book The Making of Kubrick's 2001 by Jerome Agel.[119]The second ('post-premiere') set of cuts included details about the daily life on Discovery: additional space-walks, astronaut Bowman retrieving a spare part from an octagonal corridor, elements from the Poole murder sequence including the entire space-walk preparation and shots of Hal turning off radio contact with Poole, and a close-up of Bowman picking up a slipper during his walk in the alien room.[120] Agel describes the 19 minutes of post-premiere cuts, made on April 5–6, as coming from \"Dawn of Man, Orion, Poole exercising in the centrifuge, and Poole's pod exiting from Discovery.\"[121]Kubrick's rationale for editing the film was to tighten the narrative. Reviews suggested the film suffered too much by the radical departure from traditional cinematic story-telling conventions. Regarding the cuts, Kubrick stated, \"I didn't believe that the trims made a critical difference. ... The people who like it, like it no matter what its length, and the same holds true for the people who hate it\".[118] As was typical of most films of that era released both as a \"road-show\" (in Cinerama format in the case of Space Odyssey) and subsequently put into general release (in seventy-millimetre in the case of Odyssey), the entrance music, intermission music (and intermission altogether), and postcredit exit music were cut from most prints of the latter version, although these have been restored to most DVD releases.[122][123]According to Kubrick's brother-in-law Jan Harlan, the director was adamant the trims were never to be seen, and that he \"even burned the negatives\"—which he had kept in his garage—shortly before his death. This is confirmed by former Kubrick assistant Leon Vitali: \"I'll tell you right now, okay, on Clockwork Orange, The Shining, Barry Lyndon, some little parts of 2001, we had thousands of cans of negative outtakes and print, which we had stored in an area at his house where we worked out of, which he personally supervised the loading of it to a truck and then I went down to a big industrial waste lot and burned it. That's what he wanted.\"[124]In December 2010, Douglas Trumbull announced that Warner Bros. had located seventeen minutes of lost footage, \"perfectly preserved\", in a Kansas salt mine vault that originated from the post-premiere cuts.[125][2] No immediate plans have been announced for the footage.[126]","Development":"After completing Dr. Strangelove (1964), director Stanley Kubrick became fascinated by the possibility of extraterrestrial life,[17] and resolved to make \"the proverbial good science fiction movie\".[18] Searching for a collaborator in the science fiction community, Kubrick was advised by a mutual acquaintance, Columbia Pictures staffer Roger Caras, to talk to writer Arthur C. Clarke. Although convinced that Clarke was \"a recluse, a nut who lives in a tree\", Kubrick allowed Caras to cable the film proposal to Clarke, who lived in Ceylon. Clarke's cabled response stated that he was \"frightfully interested in working with enfant terrible\", and added \"what makes Kubrick think I'm a recluse?\"[19][20] Meeting for the first time at Trader Vic's in New York on April 22, 1964, the two began discussing the project that would take up the next four years of their lives.[21] Clarke kept a diary throughout his involvement with 2001, excerpts of which were published in 1972 as The Lost Worlds of 2001.[22]Kubrick told Clarke he wanted to make a film about \"Man's relationship to the universe\",[23] and was, in Clarke's words, \"determined to create a work of art which would arouse the emotions of wonder, awe ... even, if appropriate, terror\".[21] Clarke offered Kubrick six of his short stories, and by May 1964, Kubrick had chosen \"The Sentinel\" as the source material for the film. In search of more material to expand the film's plot, the two spent the rest of 1964 reading books on science and anthropology, screening science fiction films, and brainstorming ideas.[24] They spent two years transforming \"The Sentinel\" into a novel, and then into a script for 2001.[25] Clarke said that his short story \"Encounter in the Dawn\" inspired the film's \"Dawn Of Man\" sequence.[26]Kubrick and Clarke privately referred to the project as How the Solar System Was Won as a reference to MGM's 1962 Cinerama epic, How the West Was Won. On February 23, 1965, Kubrick issued a press release announcing the title Journey Beyond The Stars.[27] Other titles considered include Universe, Tunnel to the Stars, and Planetfall. In April 1965, eleven months after they began working on the project, Kubrick selected 2001: A Space Odyssey; Clarke said the title was \"entirely\" Kubrick's idea.[28] Intending to set the film apart from the \"monsters and sex\" type of science fiction films of the time, Kubrick used Homer's The Odyssey as inspiration for the title. Kubrick said, \"[i]t occurred to us that for the Greeks the vast stretches of the sea must have had the same sort of mystery and remoteness that space has for our generation.\"[29]\"How much would we appreciate La Gioconda today if Leonardo had written at the bottom of the canvas: \"This lady is smiling slightly because she has rotten teeth\"—or \"because she's hiding a secret from her lover\"? It would shut off the viewer's appreciation and shackle him to a reality other than his own. I don't want that to happen to 2001.\"Kubrick and Clarke planned to develop the 2001 novel first, free of the constraints of film, and then write the screenplay. They planned the writing credits to be \"Screenplay by Stanley Kubrick and Arthur C. Clarke, based on a novel by Arthur C. Clarke and Stanley Kubrick\" to reflect their preeminence in their respective fields.[31] In practice, the screenplay developed in parallel to the novel, and elements were shared between both. In a 1970 interview, Kubrick said:There are a number of differences between the book and the movie. The novel, for example, attempts to explain things much more explicitly than the film does, which is inevitable in a verbal medium. The novel came about after we did a 130-page prose treatment of the film at the very outset. This initial treatment was subsequently changed in the screenplay, and the screenplay in turn was altered during the making of the film. But Arthur took all the existing material, plus an impression of some of the rushes, and wrote the novel. As a result, there's a difference between the novel and the film ... I think that the divergences between the two works are interesting.[32]The screenplay credits were shared whereas the 2001 novel, released shortly after the film, was attributed to Clarke alone. Clarke wrote later that \"the nearest approximation to the complicated truth\" is that the screenplay should be credited to \"Kubrick and Clarke\" and the novel to \"Clarke and Kubrick\".[33]Clarke and Kubrick wrote the novel and screenplay simultaneously. Clarke opted for clearer explanations of the mysterious monolith and Star Gate in the novel; Kubrick made the film more cryptic by minimising dialogue and explanation.[34] Kubrick said the film is \"basically a visual, nonverbal experience\" that \"hits the viewer at an inner level of consciousness, just as music does, or painting\".[35]Astronomer Carl Sagan wrote in his book The Cosmic Connection that Clarke and Kubrick asked his opinion on how to best depict extraterrestrial intelligence. Sagan, while acknowledging Kubrick's desire to use actors to portray humanoid aliens for convenience's sake, argued that alien life forms were unlikely to bear any resemblance to terrestrial life, and that to do so would introduce \"at least an element of falseness\" to the film. Sagan proposed that the film suggest, rather than depict, extraterrestrial superintelligence. He attended the premiere and was \"pleased to see that I had been of some help.\"[36] Kubrick hinted at the nature of the mysterious unseen alien race in 2001 by suggesting, in a 1968 interview, that given millions of years of evolution, they progressed from biological beings to \"immortal machine entities\", and then into \"beings of pure energy and spirit\"; beings with \"limitless capabilities and ungraspable intelligence\".[37]The script went through many stages. In early 1965, when backing was secured for the film, Clarke and Kubrick still had no firm idea of what would happen to Bowman after the Star Gate sequence. Initially all of Discovery's astronauts were to survive the journey; by October 3, Clarke and Kubrick had decided to leave Bowman the sole survivor and have him regress to infancy. By October 17, Kubrick had come up with what Clarke called a \"wild idea of slightly fag robots who create a Victorian environment to put our heroes at their ease.\"[33] HAL 9000 was originally named Athena after the Greek goddess of wisdom and had a feminine voice and persona.[33]Early drafts included a prologue containing interviews with scientists about extraterrestrial life,[38] voice-over narration (a feature in all of Kubrick's previous films),[39] a stronger emphasis on the prevailing Cold War balance of terror, and a different and more explicitly explained breakdown for HAL.[40][41][42] Other changes include a different monolith for the \"Dawn of Man\" sequence, discarded when early prototypes did not photograph well; the use of Saturn as the final destination of the Discovery mission rather than Jupiter, discarded when the special effects team could not develop a convincing rendition of Saturn's rings; and the finale of the Star Child exploding nuclear weapons carried by Earth-orbiting satellites,[42] which Kubrick discarded for its similarity to his previous film, Dr. Strangelove.[38][42] The finale and many of the other discarded screenplay ideas survived into Clarke's novel.[42]Kubrick made further changes due to his desire to make the film more non-verbal, communicating at a visual and visceral level rather than through conventional narrative.[43] Vincent LeBrutto writes that Clarke's novel has \"strong narrative structure\", while the film is a mainly visual experience where much remains symbolic.[44]While many ideas were discarded in totality, at least two remnants of previous plot ideas remain in the final film.Although the film leaves it mysterious, early script drafts made clear that HAL's breakdown is triggered by authorities on Earth who order him to withhold information from the astronauts about the purpose of the mission (this is also explained in the film's sequel 2010). Frederick Ordway, Kubrick's science advisor and technical consultant, stated that in an earlier script Poole tells HAL there is \"... something about this mission that we weren't told. Something the rest of the crew knows and that you know. We would like to know whether this is true\", to which HAL responds: \"I'm sorry, Frank, but I don't think I can answer that question without knowing everything that all of you know.\"[40] HAL then falsely predicts a failure of the hardware maintaining radio contact with Earth (the source of HAL's difficult orders) during the broadcast of Frank Poole's birthday greetings from his parents.The final script removed this explanation, but it is hinted at when HAL asks David Bowman if Bowman is bothered by the \"oddities\" and \"tight security\" surrounding the mission. After Bowman concludes that HAL is dutifully drawing up the \"crew psychology report\", the computer makes his false prediction of hardware failure. Another hint occurs at the moment of HAL's deactivation when a video reveals the purpose of the mission.In an interview with Joseph Gelmis in 1969, Kubrick stated that HAL \"had an acute emotional crisis because he could not accept evidence of his own fallibility\".[45]Kubrick originally planned a voice-over to reveal that the satellites following a match cut from a bone-weapon are nuclear weapons,[46] and that the Star Child would detonate the weapons at the end of the film.[47] However, he decided this would create associations with his previous film Dr. Strangelove, and decided not to make it so obvious that they were \"war machines\".[48] A few weeks before the release of the film, the U.S. and Soviet governments had agreed not to put any nuclear weapons into outer space.In a book he wrote with Kubrick's assistance, Alexander Walker states that Kubrick eventually decided that as nuclear weapons the bombs had \"no place at all in the film's thematic development\", now being an \"orbiting red herring\" which would \"merely have raised irrelevant questions to suggest this as a reality of the twenty-first century\".[49]Kubrick scholar Michel Ciment, discussing Kubrick's attitude toward human aggression and instinct, observes: \"The bone cast into the air by the ape (now become a man) is transformed at the other extreme of civilization, by one of those abrupt ellipses characteristic of the director, into a spacecraft on its way to the moon.\"[50] In contrast to Ciment's reading of a cut to a serene \"other extreme of civilization\", science fiction novelist Robert Sawyer, speaking in the Canadian documentary 2001 and Beyond, saw it as a cut from a bone to a nuclear weapons platform, explaining that \"what we see is not how far we've leaped ahead, what we see is that today, '2001', and four million years ago on the African veldt, it's exactly the same—the power of mankind is the power of its weapons. It's a continuation, not a discontinuity in that jump.\"[51]The film contains no dialogue for the first and last 20 minutes or so.[52] By the time shooting began, Kubrick had removed much of the dialogue and narration; what remains is notable for its banality (making the computer Hal seem to have more emotion than the humans) juxtaposed with epic space scenes.[53]The first scenes of dialogue are Floyd's encounters on the space station: chit-chat with the colleague who greets him, his telephone call to his daughter, and the friendly but strained encounter with Soviet scientists. Later, en route to the monolith, Floyd engages in trite exchanges with his staff while a spectacular journey by Earth-light across the Lunar surface is shown. Hal is the only character who expresses anxiety, as well as feelings of pride and bewilderment.According to biographer Vincent Lobrutto, one of Kubrick's visual—and aural—inspirations was the 1960 National Film Board of Canada animated short documentary Universe. The 29 minute film, which had also proved popular at NASA for its realistic portrayal of outer space, achieved \"the standard of dynamic visionary realism that he was looking for.\" Wally Gentleman, one of the special effects artists on Universe, worked briefly on 2001. The short film's most notable influence may have been Kubrick's decision to cast the narrator of Universe, actor Douglas Rain, relatively unknown outside Canada, as the voice of HAL.[54]","running_time":"161 minutes (Premiere)[1]|142 minutes (Theatrical)[2]|","Release":"The film's world premiere was on April 2, 1968, at the Uptown Theater in Washington, D.C. It opened two days later at the Warner Cinerama Theatre in Hollywood and the Loew's Capitol in New York. Kubrick then deleted nineteen minutes of footage from the film before its general release in five other U.S. cities on April 10, 1968, and internationally in five cities the following day,[2][128] where it was shown in 70mm format, used a six-track stereo magnetic soundtrack, and projected in the 2.21:1 aspect ratio. The general release of the film in its 35mm anamorphic format took place in autumn 1968 and used either a four-track magnetic stereo soundtrack or an optical monaural soundtrack.[129]The original seventy-millimetre release, like many Super Panavision 70 films of the era such as Grand Prix, was advertised as being in \"Cinerama\" in cinemas equipped with special projection optics and a deeply curved screen. In standard cinemas, the film was identified as a seventy-millimetre production. The original release of 2001: A Space Odyssey in seventy-millimetre Cinerama with six-track sound played continually for more than a year in several venues, and for one hundred and three weeks in Los Angeles.[130]The following year, 2001 was appointed by a United States Department of State committee to be the American entry at the 6th Moscow International Film Festival.[131] The film was re-released in 1974, 1977, and again in 1980.[132] Once 2001, the film's timeset, arrived, a restoration of the seventy-millimetre version was screened at the Ebert's Overlooked Film Festival, and the production was also reissued to selected film houses in North America, Europe and Asia.[133][134]The film has been released in several forms:Additionally, the film has been released in high definition on both HD DVD and Blu-ray Disc.[137]The film's distribution rights were transferred to Warner Bros. in 1999.","budget":"$10.5–12 million[4][5]","screenplay_by":"Stanley Kubrick|Arthur C. Clarke|","Plot":"In an African desert millions of years ago, a tribe of man-apes is driven from their water hole by a rival tribe. They awaken to find a featureless black monolith has appeared before them. Guided in some fashion by the Black Monolith, one man-ape realizes how to use a bone as a tool and weapon; the tribe kills the leader of their rivals and reclaims the water hole.Millions of years later, a Pan Am space plane carries Dr. Heywood R. Floyd to a space station orbiting Earth for a layover on his trip to Clavius Base, a United States outpost on the moon. After a videophone call with his daughter, Floyd's Soviet scientist friend and her colleague ask him about rumors of a mysterious epidemic at Clavius. Floyd declines to answer. At Clavius, Floyd heads a meeting of base personnel, apologizing for the epidemic cover story but stressing secrecy. His mission is to investigate a recently found artifact buried four million years ago. Floyd and others ride in a Moonbus to the artifact, which is a monolith identical to the one encountered by the man-apes. Sunlight strikes the monolith and a loud high-pitched radio signal is heard.Eighteen months later, the U.S. spacecraft Discovery One is bound for Jupiter. On board are mission pilots and scientists Dr. David Bowman and Dr. Frank Poole with three other scientists in cryogenic hibernation. Most of Discovery's operations are controlled by the ship's computer, HAL 9000, referred to by the crew as \"Hal\". Bowman and Poole watch Hal and themselves being interviewed on a BBC show about the mission, in which the computer states that he is \"foolproof and incapable of error.\" When asked by the host if Hal has genuine emotions, Bowman replies that he appears to, but that the truth is unknown. Later, Hal questions Dave on the mysterious purpose of the mission, then reports the imminent failure of an antenna control device. The astronauts retrieve the component making use of an EVA Pod but find nothing wrong with it. Hal suggests reinstalling the part and letting it fail so the problem can be found. Mission Control advises the astronauts that results from their twin HAL 9000 backups indicate that Hal is in error. Hal insists that the problem, like previous issues ascribed to HAL series units, is due to human error. Concerned about Hal's behavior, Bowman and Poole enter an EVA pod to talk without Hal overhearing, and agree to disconnect Hal if he is proven wrong. Hal secretly follows their conversation by lip reading.While Poole attempts to replace the unit during a space walk, his EVA pod, controlled by Hal, rams him, severing his oxygen hose and setting him adrift. Bowman takes another pod to attempt rescue, leaving his helmet behind. Meanwhile, Hal turns off the life support functions of the crewmen in suspended animation. When Bowman returns to the ship with Poole's body, Hal refuses to let him in, stating that the astronauts' plan to deactivate him jeopardizes the mission. Bowman opens the ship's emergency airlock manually, enters the ship, and proceeds to Hal's processor core. Hal tries to reassure Bowman, then pleads with him to stop, and finally expresses fear. As Bowman deactivates the circuits controlling HAL's higher intellectual functions, HAL regresses to his earliest programmed memory, the song \"Daisy Bell\", which he sings for Bowman.When Hal is finally disconnected, a prerecorded video message from Floyd reveals the existence of the monolith on the moon, its purpose and origin unknown. With the exception of one short but extremely powerful radio emission aimed at Jupiter, the object has been inert. At Jupiter, Bowman leaves Discovery One in an EVA pod to investigate another monolith discovered in orbit around the planet. The pod is pulled into a vortex of colored light,[14] and Bowman races across vast distances of space, viewing bizarre cosmological phenomena and strange landscapes of unusual colors.He finds himself, still in the pod, in a bedroom appointed in the neoclassical style. He sees older versions of himself, his point of view switching each time, first standing in the bedroom, middle-aged, and still in his spacesuit, then dressed in leisure attire and eating dinner, and finally as an old man lying in the bed. A black monolith appears at the foot of the bed, and as Bowman reaches for it, he is transformed into a fetus enclosed in a transparent orb of light.[15] The film ends as the new being floats in space beside the Earth, gazing at it.","Reception":"The film earned $8.5 million in theatrical gross rental from roadshow engagements throughout 1968,[132][138] contributing to North American rentals of $15 million during its original release.[7] Reissues have brought its cumulative exhibition gross to $56.9 million in North America,[5] and over $190 million worldwide.[7]Upon release, 2001 polarized critical opinion, receiving both ecstatic praise and vehement derision. Some critics viewed the original 161-minute cut shown at premieres in Washington D.C., New York, and Los Angeles,[1] while others saw the nineteen-minute-shorter general release version that was in theatres from April 10, 1968 onwards.[128]In The New Yorker, Penelope Gilliatt said it was \"some kind of great film, and an unforgettable endeavor ... The film is hypnotically entertaining, and it is funny without once being gaggy, but it is also rather harrowing.\"[139] Charles Champlin of the Los Angeles Times opined that it was \"the picture that science fiction fans of every age and in every corner of the world have prayed (sometimes forlornly) that the industry might some day give them. It is an ultimate statement of the science fiction film, an awesome realization of the spatial future ... it is a milestone, a landmark for a spacemark, in the art of film.\"[140] Louise Sweeney of The Christian Science Monitor felt that 2001 was \"a brilliant intergalactic satire on modern technology. It's also a dazzling 160-minute tour on the Kubrick filmship through the universe out there beyond our earth.\"[141] Philip French wrote that the film was \"perhaps the first multi-million-dollar supercolossal movie since D.W. Griffith's Intolerance fifty years ago which can be regarded as the work of one man ...Space Odyssey is important as the high-water mark of science-fiction movie making, or at least of the genre's futuristic branch.\"[142] The Boston Globe's review indicated that it was \"the world's most extraordinary film. Nothing like it has ever been shown in Boston before or, for that matter, anywhere ... The film is as exciting as the discovery of a new dimension in life.\"[143] Roger Ebert gave the film four stars in his original review, believing the film \"succeeds magnificently on a cosmic scale.\"[144] He later put it on his Top 10 list for Sight & Sound.[145] Time provided at least seven different mini-reviews of the film in various issues in 1968, each one slightly more positive than the preceding one; in the final review dated December 27, 1968, the magazine called 2001 \"an epic film about the history and future of mankind, brilliantly directed by Stanley Kubrick. The special effects are mindblowing.\"[146] Director Martin Scorsese has also listed it as one of his favourite films of all time.[147] Critic David Denby later compared Kubrick to the monolith from 2001: A Space Odyssey, calling him \"a force of supernatural intelligence, appearing at great intervals amid high-pitched shrieks, who gives the world a violent kick up the next rung of the evolutionary ladder\".[148]Pauline Kael said it was \"a monumentally unimaginative movie\",[149] and Stanley Kauffmann of The New Republic called it \"a film that is so dull, it even dulls our interest in the technical ingenuity for the sake of which Kubrick has allowed it to become dull.\"[150] Renata Adler of The New York Times wrote that it was \"somewhere between hypnotic and immensely boring.\"[151] Variety's 'Robe' believed the film was a \"[b]ig, beautiful, but plodding sci-fi epic ... A major achievement in cinematography and special effects, 2001 lacks dramatic appeal to a large degree and only conveys suspense after the halfway mark.\"[152] Andrew Sarris called it \"one of the grimmest films I have ever seen in my life ...2001 is a disaster because it is much too abstract to make its abstract points.\"[153] (Sarris reversed his opinion upon a second viewing of the film, and declared, \"2001 is indeed a major work by a major artist.\"[154]) John Simon felt it was \"a regrettable failure, although not a total one. This film is fascinating when it concentrates on apes or machines ... and dreadful when it deals with the in-betweens: humans ...2001, for all its lively visual and mechanical spectacle, is a kind of space-Spartacus and, more pretentious still, a shaggy God story.\"[155] Eminent historian Arthur M. Schlesinger, Jr. deemed the film \"morally pretentious, intellectually obscure and inordinately long ... a film out of control\".[156] The BBC said that its slow pacing often alienates modern audiences more than it did upon its initial release.[157]Science fiction writers had a range of reactions to the film. Ray Bradbury praised the film's photography, but disliked the banality of most of the dialogue, and believed that the audience does not care when Poole dies.[158] Both he and Lester del Rey were put off by the film's feeling of sterility and blandness in all the human encounters amidst all the technological wonders, while both praised the pictorial element of the film. Del Rey was especially harsh, describing the film as dull, confusing, and boring, predicting \"[i]t will probably be a box-office disaster, too, and thus set major science-fiction movie making back another ten years.\" However, the film was praised by science-fiction novelist Samuel R. Delany who was impressed by how the film undercuts the audience's normal sense of space and orientation in several ways. Like Bradbury, Delany picked up on the banality of the dialogue (in Delany's phrasing the characters are saying nothing meaningful), but Delany regards this as a dramatic strength, a prelude to the rebirth at the conclusion of the film.[159] Without analyzing the film in detail, Isaac Asimov spoke well of Space Odyssey in his autobiography, and other essays. The film won the Hugo Award for best dramatic presentation, an award heavily voted on by science fiction fans and published science-fiction writers.[160] James P. Hogan liked the film but complained about the ending that didn't make any sense to him, leading to a bet about whether he could write something better or not; \"I stole Arthur's plot idea shamelessly and produced Inherit the Stars.\"[161]","Interpretation":"Since its premiere, 2001: A Space Odyssey has been analyzed and interpreted by professional film critics, amateur writers and science fiction fans, virtually all of whom have mentioned its deliberate ambiguity. Questions about 2001 range from uncertainty about its deeper philosophical implications about humanity's origins and final destiny in the universe,[192] to interpreting elements of the film's more enigmatic scenes such as the meaning of the monolith, or the final fate of astronaut David Bowman. There are also simpler and more mundane questions about what drives the plot, in particular the causes of Hal's breakdown (explained in earlier drafts but kept mysterious in the film).[193]Stanley Kubrick encouraged people to explore their own interpretations of the film and refused to offer an explanation of \"what really happened\" in the film, preferring instead to let audiences embrace their own ideas and theories. In a 1968 interview with Playboy magazine, Kubrick stated:You're free to speculate as you wish about the philosophical and allegorical meaning of the film—and such speculation is one indication that it has succeeded in gripping the audience at a deep level—but I don't want to spell out a verbal road map for 2001 that every viewer will feel obligated to pursue or else fear he's missed the point.[37]In a subsequent discussion of the film with Joseph Gelmis, Kubrick said his main aim was to avoid \"intellectual verbalization\" and reach \"the viewer's subconscious.\" However, he said he did not deliberately strive for ambiguity—it was simply an inevitable outcome of making the film nonverbal, though he acknowledged this ambiguity was an invaluable asset to the film. He was willing then to give a fairly straightforward explanation of the plot on what he called the \"simplest level,\" but unwilling to discuss the metaphysical interpretation of the film which he felt should be left up to the individual viewer.[194]For some readers, Arthur C. Clarke's more straightforward novelization of the script is key to interpreting the film. Clarke's novel explicitly identifies the monolith as a tool created by an alien race that has been through many stages of evolution, moving from organic form to biomechanical, and finally achieving a state of pure energy. These aliens travel the cosmos assisting lesser species to take evolutionary steps. Conversely, film critic Penelope Houston wrote in 1971 that because the novel differs in many key respects from the film, it perhaps should not be regarded as the skeleton key to unlock it.[195]Multiple allegorical interpretations of 2001 have been proposed, including seeing it as a commentary on Friedrich Nietzsche's philosophical tract Thus Spoke Zarathustra, or as an allegory of human conception, birth and death.[196] The latter can be seen through the final moments of the film, which are defined by the image of the \"star child,\" an in utero fetus that draws on the work of Lennart Nilsson.[197] The star child signifies a \"great new beginning,\"[197] and is depicted naked and ungirded, but with its eyes wide open.[198] Leonard F. Wheat sees Space Odyssey as a multi-layered allegory, commenting simultaneously on Nietzsche, Homer, and the relationship of man to machine.The reasons for Hal's malfunction and subsequent malignant behavior have also elicited much discussion. He has been compared to Frankenstein's monster. In Clarke's novel, Hal malfunctions because of being ordered to lie to the crew of Discovery and withhold confidential information from them, despite being constructed for \"the accurate processing of information without distortion or concealment\". Film critic Roger Ebert wrote that Hal, as the supposedly perfect computer, actually behaves in the most human fashion of all of the characters.[52]Rolling Stone reviewer Bob McClay sees the film as like a four-movement symphony, its story told with \"deliberate realism.\"[199] Carolyn Geduld believes that what \"structurally unites all four episodes of the film\" is the monolith, the film's largest and most unresolvable enigma.[200] Vincent LoBrutto's biography of Kubrick says that for many, Clarke's novel is the key to understanding the monolith.[201] Similarly, Geduld observes that \"the monolith ... has a very simple explanation in Clarke's novel,\" though she later asserts that even the novel doesn't fully explain the ending.McClay's Rolling Stone review describes a parallelism between the monolith's first appearance in which tool usage is imparted to the apes (thus 'beginning' mankind) and the completion of \"another evolution\" in the fourth and final encounter[202] with the monolith. In a similar vein, Tim Dirks ends his synopsis saying \"[t]he cyclical evolution from ape to man to spaceman to angel-starchild-superman is complete.\"[203]The first and second encounters of humanity with the monolith have visual elements in common; both apes, and later astronauts, touch the monolith gingerly with their hands, and both sequences conclude with near-identical images of the Sun appearing directly over the monolith (the first with a crescent moon adjacent to it in the sky, the second with a near-identical crescent Earth in the same position), both echoing the Sun–Earth–Moon alignment seen at the very beginning of the film.[204] The second encounter also suggests the triggering of the monolith's radio signal to Jupiter by the presence of humans,[205] echoing the premise of Clarke's source story \"The Sentinel\".The monolith is the subject of the film's final line of dialogue (spoken at the end of the \"Jupiter Mission\" segment): \"Its origin and purpose still a total mystery.\" Reviewers McClay and Roger Ebert wrote that the monolith is the main element of mystery in the film; Ebert described \"the shock of the monolith's straight edges and square corners among the weathered rocks,\" and the apes warily circling it as prefiguring man reaching \"for the stars.\"[144] Patrick Webster suggests the final line relates to how the film should be approached as a whole, noting \"The line appends not merely to the discovery of the monolith on the Moon, but to our understanding of the film in the light of the ultimate questions it raises about the mystery of the universe.\"[206]The film conveys what some viewers have described as a sense of the sublime and numinous. Roger Ebert writes in his essay on 2001 in The Great Movies:North's [rejected] score, which is available on a recording, is a good job of film composition, but would have been wrong for 2001 because, like all scores, it attempts to underline the action—to give us emotional cues. The classical music chosen by Kubrick exists outside the action. It uplifts. It wants to be sublime; it brings a seriousness and transcendence to the visuals.[52]In a book on architecture, Gregory Caicco writes that Space Odyssey illustrates how our quest for space is motivated by two contradictory desires, a \"desire for the sublime\" characterized by a need to encounter something totally other than ourselves—\"something numinous\"—and the conflicting desire for a beauty that makes us feel no longer \"lost in space,\" but at home.[207] Similarly, an article in The Greenwood Encyclopedia of Science Fiction and Fantasy, titled \"Sense of Wonder,\" describes how 2001 creates a \"numinous sense of wonder\" by portraying a universe that inspires a sense of awe, which at the same time we feel we can understand.[208] Christopher Palmer wrote that there exists in the film a coexistence of \"the sublime and the banal,\" as the film implies that to get into space, mankind had to suspend the \"sense of wonder\" that motivated him to explore space to begin with.[209]","2001:_a_space_odyssey":"Theatrical release poster by Robert McCall","Soundtrack":"The initial MGM soundtrack album release contained none of the material from the altered and uncredited rendition of Ligeti's \"Aventures\", used a different recording of \"Also sprach Zarathustra\" from that heard in the film, this time performed by the Berlin Philharmonic conducted by Herbert von Karajan, and a longer excerpt of \"Lux aeterna\" than that in the film.In 1996, Turner Entertainment/Rhino Records released a new soundtrack on CD which included the material from \"Aventures\" and restored the version of \"Zarathustra\" used in the film, and used the shorter version of \"Lux aeterna\" from the film. As additional \"bonus tracks\" at the end, this CD includes the versions of \"Zarathustra\" and \"Lux aeterna\" on the old MGM soundtrack, an unaltered performance of \"Aventures\", and a nine-minute compilation of all of Hal's dialogue from the film.North's unused music had its first public appearance in Telarc's issue of the main theme on Hollywood's Greatest Hits, Vol. 2, a compilation album by Erich Kunzel and the Cincinnati Pops Orchestra. All the music North originally wrote was recorded commercially by North's friend and colleague Jerry Goldsmith with the National Philharmonic Orchestra and was released on Varèse Sarabande CDs shortly after Telarc's first theme release but before North's death. Eventually, a mono mix-down of North's original recordings, which had survived in the interim, would be released as a limited-edition CD by Intrada Records.[127]","Parodies and homages":"2001 has been the frequent subject of both parody and homage, sometimes extensively and other times briefly, employing both its distinctive music and iconic imagery.","produced_by":"Stanley Kubrick","starring":"Keir Dullea|Gary Lockwood|","Influence":"\"Stanley Kubrick made the ultimate science fiction movie, and it is going to be very hard for someone to come along and make a better movie, as far as I'm concerned. On a technical level, it can be compared, but personally I think that '2001' is far superior.\"The influence of 2001 on subsequent filmmakers is considerable. Steven Spielberg, George Lucas and others, including many special effects technicians, discuss the impact the film has had on them in a featurette titled Standing on the Shoulders of Kubrick: The Legacy of 2001, included in the 2007 DVD release of the film. Spielberg calls it his film generation's \"big bang\", while Lucas says it was \"hugely inspirational\", labeling Kubrick as \"the filmmaker's filmmaker\". Sydney Pollack refers to it as \"groundbreaking\", and William Friedkin states 2001 is \"the grandfather of all such films\". At the 2007 Venice film festival, director Ridley Scott stated he believed 2001 was the unbeatable film that in a sense killed the science fiction genre.[162] Similarly, film critic Michel Ciment in his essay \"Odyssey of Stanley Kubrick\" stated, \"Kubrick has conceived a film which in one stroke has made the whole science fiction cinema obsolete.\"[163] However, others credit 2001 with opening up a market for films such as Close Encounters of the Third Kind, Alien, Blade Runner and Contact; proving that big-budget \"serious\" science-fiction films can be commercially successful, and establishing the \"sci-fi blockbuster\" as a Hollywood staple.[164] Science magazine Discover's blogger Stephen Cass, discussing the considerable impact of the film on subsequent science-fiction, writes that \"the balletic spacecraft scenes set to sweeping classical music, the tarantula-soft tones of HAL 9000, and the ultimate alien artifact, the Monolith, have all become enduring cultural icons in their own right.\"[165]One commentator has suggested that the image of the Star Child and Earth has contributed to the rise of the \"whole earth\" icon as a symbol of the unity of humanity. Writing in The Asia Pacific Journal Robert Jacobs traces the history of this icon from early cartoons and drawings of Earth to photographs of Earth from early space missions, to its historic appearance on the cover of The Whole Earth Catalog. Noting that images of the entire planet recur several times in A Space Odyssey, Jacobs writesthe most dramatic use of the icon was in the film's conclusion. In this scene ... Bowman is reborn as the Star Child ... depicted as a fetus floating in space in an amniotic sac. The Star Child turns to consider the Whole Earth floating in front of it, both glowing a bright blue-white. The two appear as newborn versions of Man and Earth, face-to-face, ready to be born into a future of unthinkable possibilities.[166]In August 2011, in response to Apple Inc.'s patent infringement lawsuit against Samsung, the latter argued that Apple's iPad was effectively modeled on the visual tablets that appear aboard spaceship Discovery in the Space Odyssey film, which constitute prior art.[167]\"Siri\", Apple's natural language voice control system for the iPhone 4S, features a reference to the film: it responds \"I'm sorry I can't do that\" when asked to \"open the pod bay doors\".[168] When asked repeatedly, it may say, \"Without your space helmet, you're going to find this rather... breathtaking.\"Inspired by Clarke's visual tablet device, in 1994 a European Commission-funded R&D project code named \"NewsPAD\" developed and pilot tested a portable 'multimedia viewer' aiming for the realisation of an electronic multimedia 'newspaper' pointing the way to a future fully interactive and highly personalised information source. Involved partners were Acorn RISC Technologies UK, Archimedes GR, Carat FR, Ediciones Primera Plana ES, Institut Català de Tecnologia ES, and TechMAPP UK.[169]","edited_by":"Ray Lovejoy"}