{"country":"United States","distributed_by":"Lionsgate","screenplay_by":"Jason Richman","Plot":"Joe (Cage) is a professional freelance contract killer. He works strictly by the rules; He never socializes outside his work, he stays secluded in quiet spots, never meets his handlers and always leaves on time, leaving without a trace. He usually hires young pickpockets or small-time criminals as his local help, whom he usually murders after the end of the job to prevent any identification. He uses multiple aliases and also has middlemen between him and his handlers. He also carries a watch to perform a hit in specific time and correctly visualizes his every target.After completing a hit in Prague and killing his current help, Joe travels to Bangkok for an assignment to assassinate four people for notorious Bangkok crime boss Surat, whom he never meets. Joe occasionally provides insight via voiceover narration throughout the film. He hires a local pickpocket with simple English knowledge, Kong, as his go-between in Bangkok, a condition of the contract being that the gang will never meet Joe. Contracts from the Bangkok gangsters are passed to Kong one by one via a nightclub dancer, Aom. Joe's first execution in Bangkok is done on motorcycle; when the target car stops at a red light, Joe kills all the passengers with a machine pistol.Kong retrieves information about the second target, again via Aom, and the pair become friendlier with every contact. Before Joe executes his mission, Kong informs him of the target, Pramod Juntasa, another notorious gang lord and Surat's rival crime boss who acts as sex trafficker, buying young girls from impoverished parents and selling them after sex deals. Joe sneaks into the target's penthouse and drowns him in his pool. Unsatisfied with Kong's assistance, Joe contemplates killing him, but after a brief confrontation when Kong is ambushed by local gangsters regarding a briefcase containing information files of Surat's/Joe's targets, he instead decides to act as Kong's mentor and trains him for self-defense.Midway through the movie, Joe meets Fon, a deaf-mute pharmacist, with whom he becomes intrigued after a brief consultation. Joe later returns to the pharmacy to invite Fon out for dinner. Soon after Joe falls for Fon and meets her mother. The affair is cut short when he shoots and kills two assailants in Fon's presence. Blood splatters on Fon, and she runs off, trembling and traumatized by the violent deaths. Feeling betrayed, Fon cannot forgive Joe and ends their relationship.Before the third kill, the gang attempts to identify Joe, and he warns them off. For the third execution that takes place at the Damnoen Saduak market, Kong assists Joe. The kill does not go as planned, and the target nearly gets away but Joe manages to catch and assassinate him. Before beginning his last mission Joe visits Fon, presumably to say goodbye. She initially ignores him but as Joe begins to drive away she runs after his car.His fourth target is the Prime Minister of Thailand. Joe is about to make the kill when he has second thoughts, is spotted, and escapes through a panicking crowd. Meanwhile, the gang has abducted Aom and Kong with plans to execute them. Joe, now a target, is attacked at his house by four of Surat's henchmen. He uses explosives to take them out and is faced with the choice of rescuing Kong or leaving the country unharmed. Joe decides to rescue Kong, so he sets off to the gang's headquarters with one of the half-alive attackers.Joe goes to the gang's headquarters, kills most of the gang including Surat's underboss/bodyguard (who is blown into half by explosives), and saves Kong and Aom. The fearful gang leader flees to his car with three other accomplices. Joe spots him and shoots the gang members, then gets into the back seat with Surat. As the police arrive at the location, Joe realizes he has only one bullet. He puts his head adjacent to Surat's, puts the gun up to his temple and pulls the trigger, killing himself and Surat.","language":"English","Reception":"The film received mostly negative reviews. As of April 7, 2013, the film has a 9% approval rating based on 94 reviews from critics at the review aggregator website Rotten Tomatoes, with its site summary saying: \"With murky cinematography, a meandering pace, a dull storyline and rather wooden performances, the Pang Brothers' Hollywood remake of Bangkok Dangerous is unsuccessful.\"[12] At the website Metacritic, which utilizes a normalized rating system, the film earned a rating of 24 out of 100 based on 16 reviews.[13]","box_office":"$42,487,390[1]","bangkok_dangerous":"Theatrical release poster","cinematography":"Decha Srimantra","production_company":"Blue Star Entertainment Initial Entertainment Group Virtual Studios Saturn Films","directed_by":"Pang Brothers","narrated_by":"Nicolas Cage","release_dates":"September 5, 2008 (2008-09-05)|||||","Production":"The original film's main character is a deaf hitman, whose disability makes him a fearless, unflinching gunman. That character has been changed in the remake. \"We'd like to keep him the same, but we understand that from a marketing point of view Nic needs to have some lines,\" Oxide was quoted as saying in the New York Times. \"So what we’re going to do is transform his girlfriend instead into a deaf-mute. This switch will maintain the drama of communication between the two main characters.\"[7]The Soi Cowboy entertainment district was among Thai locations used for filming.[8][9]","produced_by":"Nicolas Cage Norman Golightly William Sherak Jason Shuman","starring":"Nicolas Cage Charlie Yeung Shahkrit Yamnarm","running_time":"100 minutes","music_by":"Brian Tyler","edited_by":"Mike Jackson Curran Pang","Release":"The film grossed US$42,487,390, of which $15,298,133 was from the US.[1] However, the film grossed US$7.8 million on its opening weekend making this the first film since Dickie Roberts: Former Child Star to debut at number 1 with such a low gross. Lionsgate distribution topper Steve Rothenberg said, \"It will be a nicely profitable film for us.\"[10] When compared to the film's $45 million budget, Bangkok Dangerous was a box office bomb.Bangkok Dangerous was released on DVD and Blu-ray on January 6, 2009. As of December 1, 2009, 760,178 units have been sold, gathering US$15,058,164 in revenue.[11]An alternate ending to the theatrical version shows that before Joe kills himself in the original version, Kong steals a police car and comes to his rescue. He kills Surat and runs to the stolen car (although he is shot once in the arm). After eluding the police officers, they hide in a neighborhood a few meters away from Surat's headquarters. As locals come out to investigate the commotion, Kong reveals that Joe is the man who killed Surat. They help him recuperate while one local remarks that Surat was a very bad man, adding that his death marks an end to his crimes in their place (with the words \"it's good that he is dead\") Kong then takes Joe to a boatman and gives him his passports, so that he may flee the country. Joe thanks Kong for his assistance, and gives him a bank account number with \"a bonus\", stating that he was a good student. Joe then departs, with the camera focused on Kong (from Joe's perspective, similar to the original ending).","written_by":"Pang Brothers","budget":"$45 million[1]"}