{"original_language(s)":"English","Miscellaneous":"The real gunmen also were nicknamed the 'High Incident Bandits' and the shootout was also the basis for the final episode of the 1996-1997 ABC-TV police drama High Incident. The episode, \"Shootout\", takes place in the parking lot of an empty building, which serves as \"El Camino City Bank\" in the fictional suburb of El Camino. Surrounding Valley neighborhoods are used to film scenes in which officers hunt down fleeing robbers.In 44 Minutes, Mătăsăreanu's converted AR-15 has a full-length barrel, in real life, it was shortened.","Plot":"The plot, about bank robbers held at bay by the Los Angeles Police Department, is based on a real incident which occurred on February 28, 1997, known as the North Hollywood shootout. Homicide detective Frank McGregor (Michael Madsen) tracks a violent duo of bank robbers: Larry Eugene Phillips, Jr. and Emil Mătăsăreanu, who were named the High Incident Bandits by the L.A.P.D.The film opens with scenes of police officers getting ready for work in the morning interspersed with scenes of the robbers Phillips and Mătăsăreanu preparing to loot an armored bank truck. Meanwhile, SWAT Officer Donnie Anderson (Ron Livingston) is mourning the death of his father, who was also a policeman for over 31 years. Not soon afterward, Anderson displays a lack of coordination with members of his assignment during a raid on an apartment building, which almost cause one of his team members to be left alone with a few suspects, and is forced by his superior to take time off. Meanwhile, the staff at the North Hollywood branch of Bank of America are preparing for start of business. Phillips and Mătăsăreanu park outside the branch and wait for the armored truck. They are frustrated when the truck does not turn up and decide on robbing the bank instead (unaware that the bank had altered its delivery schedule). Donning black masks and homemade body armor, they enter the branch, firing at the roof with AK-47s. At the same time, an LAPD patrol car happens to be passing by and the officers observe the robbers entering the bank and call in a 211 for an armed robbery.After entering the bank, Phillips and Mătăsăreanu fire multiple rounds to frighten the customers. They then force the manager to open the vault and fill a duffel bag with all the cash in the branch. While Mătăsăreanu has his back turned, the manager places a stack of notes rigged with a dye-dispersing proximity-triggered explosive. With all of the officers arriving and setting up positions surrounding the bank, Phillips is shocked to see dozens of responding officers and decides to walk outside, firing at them with his AK-47 and quickly being joined by Mătăsăreanu. The officers are heavily outgunned in the shootout. Anderson listens to the call on his radio, gathers his SWAT team, and races to the bank. After several minutes of firing and injuring both officers and civilians, Phillips and Mătăsăreanu decide to make a getaway. Mătăsăreanu drives their car while Phillips walks beside the car and provides cover fire.On Archwood Street, Phillips separates from Mătăsăreanu and starts firing randomly at the pursuing officers. While reloading, Phillips' AK-47 jams, and he is unable to clear it. He draws a pistol. Raising the finger, he continues firing at the officers. Then, he turns the pistol on himself, shooting himself under the chin while being simultaneously shot by McGregor. Mătăsăreanu notices Phillips' body moments later and becomes enraged. As officers move to his location, he carjacks a pickup truck after the tires on his getaway car are shot out. However, he is unable to start the truck since the driver disabled the fuel pump just before fleeing. The SWAT team arrives and corners Mătăsăreanu, who then takes cover behind his car, and a close-range gunfight ensues. The SWAT team eventually fires below the cars at Mătăsăreanu's legs since they are the only portions of his body unprotected by his body armor; Mătăsăreanu is repeatedly hit in the feet and legs. Severely wounded, he drops his weapon and surrenders. It is later revealed that he bleeds to death at the scene before paramedics can arrive.The ending notes how the aftermath of the shootout proved to be a miracle, with no civilian or police deaths. It also notes how public opinion of the LAPD went up immensely due to their handling of the shootout. Actual footage is shown of LAPD officers receiving medals of valor and the public sending them thank-you notes and flowers in appreciation of their heroic efforts. McGregor closes by noting in an interview that \"in 44 minutes of sheer terror, not one officer ran away. Everyone did their job, and I think that means something.\"","country_of_origin":"United States","44_minutes:_the_north_hollywood_shoot-out":"US Poster","In popular culture":"\"44 Minutes\" is a song by the American thrash metal band Megadeth, which appears on their twelfth studio album, titled Endgame, which was released on September 15, 2009, written by frontman Dave Mustaine.[1] The third song on the album, the song's lyrics portray the events of the North Hollywood shootout, that occurred in the North Hollywood district of Los Angeles on February 28, 1997.[2][3][4] Though never released as a single from the album, the song has been played live by the band on several occasions.[5] The name is derived directly from this film.","distributor":"Fox Television Studios","directed_by":"Yves Simoneau","original_release":"June 5, 2003 (2003-06-05)|||||","theme_music_composer":"George S. Clinton","Filming":"The building in the real robbery was in North Hollywood, but the building used for the bank in the film was a vacant bank in a strip mall in La Habra, California. All of the scenes that are on the residential streets where the robbers fled were filmed on the actual locations.","starring":"Michael Madsen Ron Livingston","running_time":"103 minutes","producer(s)":"Michael R. Goldstein","written_by":"Tim Metcalfe"}