{"country":"South Korea","distributed_by":"ShowBox","revised_romanization":"Jungdok","language":"Korean","hangul":"중독","hanja":"中毒","mccune–reischauer":"Chungdok","box_office":"$4,086,108[1]","Synopsis":"Two brothers have different interests; Dae-jun (Lee Byung-hun) loves car racing, while Ho-jun (Lee Eol) loves carpentry, art and gardening. Despite their differences, the two brothers are very close. Ho-jun marries his girlfriend, Eun-soo (Lee Mi-yeon). Dae-jun decides to take part in a car race even though his brother, who is concerned for his safety, asks him not to do that particular race. With a heavy heart, Ho-jun plans on attending the car race to support Dae-jun. However, Ho-jun runs late and has to hail a taxi. The speeding taxi crashes into a lorry, and Ho-jun is seriously injured. At the same time as the taxi crashes, Dae-jun's car overturns in the middle of the race, and he is also badly injured.Both Dae-jun and Ho-jun fall into comas. A year later, Dae-jun wakes up, but is unable to walk properly, due in part to his physical injuries. He is brought home by Eun-soo, where she attempts to take care of him while he recovers. Over time, Eun-soo realises that Dae-jun is behaving identically to her husband. Dae-jun tries to convince Eun-soo that he feels like he is actually Ho-jun, but cannot explain why. He agrees to go for a hypnosis test, and his answers so reflect his brother's character that the doctor concludes that Ho-jun's spirit has entered Dae-jun's body. Eun-soo is devastated by this revelation.Eun-soo, unable to accept Dae-jun as Ho-jun, tells Dae-jun's girlfriend He-jin that she is unable to live with Dae-jun. He-jin offers to take Dae-jun away to work with her at a farm and Dae-jun agrees to go there for the sake of Eun-soo. However, one rainy day, Dae-jun appears to Eun-soo, just as Ho-jun had before. They discuss memories together and Eun-soo finally accepts Dae-jun as the \"possessed\" spirit of her former husband. Dae-jun and Eun-soo then share a slow, steamy, emotional night together after the tearful revelation. They start to live life together as a happy and loving couple. In time, Eun-soo becomes pregnant with Dae-jun's child.Meanwhile, the real Ho-jun is still on life support. The doctor suggests to Eun-soo that there is no chance of Ho-jun waking up and it may be best if he were allowed to die in peace. She agrees, and watches with Dae-jun as Ho-jun is taken off life support. He-jin returns and tells Eun-soo that she has accepted the fact that Dae-jun is no longer himself, and that she can no longer love him. She decides to go abroad to study.Dae-jun, as Ho-jun, opens an exhibit, displaying artworks and describing them as if he were Ho-jun. Eun-soo, not feeling well, decides to go home to get some rest. While she is home, a package addressed to Dae-jun arrives. She opens it and finds a necklace which had been given to her by her father and Ho-jun. She reads the accompanying note, from He-jin, saying that she cannot understand Dae-jun's crazy love. Frantic, she digs through Dae-jun's workroom and finds a number of hidden photos of herself, that were taken by Dae-jun. She realizes that Dae-jun had loved her before she got married to his brother. She also finds a notebook that Dae-jun wrote about loving her and being happy because he is able to watch her and live with her through his brother, Ho-jun. She cries sorrowfully.She drives back to Dae-jun's exhibit. She takes him aside and asks him various questions about the works of art and makes comments about how some pieces may look good in their home. She continues to pretend that Dae-Jun is in fact Ho-jun even though she now knows the truth.The final scene shows Dae-jun scattering Ho-jun's ashes across the sea. It is revealed that Dae-jun loved Eun-soo even before Ho-jun, and had for the entire time she was with Ho-jun. Dae-jun also confesses that he made use of all of his brother's secrets to \"transform\" himself into Ho-jun, to the extent of sacrificing his own identity and behaviour. He claims that it was \"Dae-jun\" who died after the accident. He tells his brother that Eun-soo will forever love him as Ho-jun. He apologizes and asks his brother never to forgive him for his deeds.","Remake":"Lee Pace and former Buffy the Vampire Slayer star Sarah Michelle Gellar starred in an American remake titled Possession. It was released on DVD and Blu-ray Disc on 9 March 2010.","cinematography":"Kim Byeong-il","directed_by":"Park Young-hoon","Awards":"2003 Grand Bell Awards","release_dates":"18 October 2002 (2002-10-18)|||||","produced_by":"Lee Choon-Yeon","starring":"Lee Byung-hun Lee Mi-yeon Lee Eol Park Sun-young","running_time":"114 minutes","written_by":"Byun Won-mi"}