{"directed_by":"Alex van Warmerdam","country":"Netherlands","distributed_by":"First Floor Features","release_dates":"1986 (1986)|||||","Plot":"Abel is a 31-year-old boy who still lives at his parents home. Due to agoraphobia, he hasn't been out for over 10 years, much to the chagrin of his father Victor. On the other hand, he gets spoiled by his mother Duif. He spends most of his days spying on the neighbors, setting up his parents against each other knowingly or unknowingly and fruitlessly trying to cut flies in two with an enormous pair of scissors.His father enlists a psychiatrist who deduces the cause of problems are the parents unhealthy relation with Abel. He then summons a mesmerist who gets frustrated by Abel. Victor then tries to set up his son with a girl in his theater society, it too fails. After a long planning the mother and son secretly buy a TV-set against Victor's wishes, when Victor finds out about this deception he gets furious and runs his son to the streets.Abel meets Zus, who works at a peepshow called \"De Naakte Meisjes\" (The naked girls). She takes pity on him and starts a relation with him. Abel finds out Zus has a relation with a married man and it turned out to be his own father. In the mean time his mother finds out Abel's whereabouts and informs to her husband. When Victor knows his Son is in relationship with his prostitute friend, he becomes enraged and goes into psychotic fit. A confrontation takes place at Zus' place with Victor and Duif present. The boozy Victor tries to chase around Zus in presence of his wife and son. His son informs Duif that Victor had an extramarital affair with Zus before. Duif hoots suicide. Though when she finds neither her beloved son or husband takes her seriously, she finds insight and finally leaves her son with the prostitute and takes her husband to home. Finally Abel laughs at all this with Zus and cuts a fly into two with his scissors.","Production":"Abel was Van Warmerdam's directional debut. He at first planned to make the movie in black and white but others discouraged this and he chose colour instead. The vast majority of the movie is situated in a fictive kind of Dutch fifties. Abel had over 300 000 viewers at its premiere, and it received a Gouden Kalf for 'Best film' and a Gouden Kalf for 'Best director'. In 1990 the tragedic comedy was named Best Dutch Film of the eighties by the Kring van Nederlandse Journalisten. In 2000 Abel was released on DVD. Abel was produced in collaboration with Orkater and the VPRO.","running_time":"100 minutes","language":"Dutch","music_by":"Vincent van Warmerdam","External links":"","written_by":"Alex van Warmerdam"}