{"country":"United States","distributed_by":"Paramount Classics","Accolades":"An Inconvenient Truth has received many different awards worldwide. The film won the 2006 Academy Awards for Best Documentary Feature[69] and Best Original Song for Melissa Etheridge's \"I Need to Wake Up\".[70] It is the first documentary to win 2 Oscars and the first to win a best original song Oscar.[71][72]After winning the 2007 Academy Award for Documentary Feature,[73] the Oscar was awarded to director Guggenheim, who asked Gore to join him and other members of the crew on stage. Gore then gave a brief speech, saying:My fellow Americans, people all over the world, we need to solve the climate crisis. It's not a political issue; it's a moral issue. We have everything we need to get started, with the possible exception of the will to act. That's a renewable resource. Let's renew it.[74]Sight & Sound magazine conducts a poll every ten years of the world's finest film directors to find out the Ten Greatest Films of All Time. This poll has been going since 1992, and has become the most recognised poll of its kind in the world.[75] In 2012 Cyrus Frisch voted for \"An Inconvenient Truth\". Frisch commented: \"A few years after this film was made, global industry has become more aware of its impact on nature.\"[76]In addition, the film received numerous other accolades, including a special recognition from the Humanitas Prize, the first time the organization had handed out a Special Award in over 10 years,[77] the 2007 Stanley Kramer Award from The Producers Guild of America, which recognizes \"work that dramatically illustrates provocative social issues\"[78] and the President’s Award 2007 from the Society for Technical Communication \"for demonstrating that effective and understandable technical communication, when coupled with passion and vision, has the power to educate—and change—the world.\"[79] For Gore's wide-reaching efforts to draw the world’s attention to the dangers of global warming which is centerpieced in the film, Al Gore, along with the Intergovernmental Panel on Climate Change (IPCC), won the 2007 Nobel Peace Prize.[80] The related album, which featured the voices of Beau Bridges, Cynthia Nixon and Blair Underwood, also won Best Spoken Word Album at the 51st Grammy Awards.[81]The film won many other awards for Best Documentary:[82]","language":"English","box_office":"$49.7 million[3] (worldwide)","cinematography":"Bob Richman|Davis Guggenheim|","production_company":"Lawrence Bender Productions Participant Productions","directed_by":"Davis Guggenheim","release_dates":"May 24, 2006 (2006-05-24)|||||","running_time":"96 minutes","Sequel":"When asked during a Reddit \"Ask Me Anything\" in 2013 whether there were plans for a follow-up film, Guggenheim said, \"I think about it a lot -- I think we need one right now.\"[150] In 2014, The Hollywood Reporter reported that the producers of the film were in talks over a possible sequel.[151] \"We have had conversations,\" co-producer Bender said. \"We've met; we've discussed. If we are going to make a movie, we want it to have an impact.\"[151] Co-producer David also believed a sequel was needed. \"God, do we need one,\" David said. \"Everything in that movie has come to pass. At the time we did the movie, there was Hurricane Katrina; now we have extreme weather events every other week. The update has to be incredible and shocking.\"[151]","Scientific basis":"The film's thesis is that global warming is real, potentially catastrophic, and human-caused. Gore presents specific data that supports the thesis, including:The Associated Press contacted more than 100 climate researchers and questioned them about the film's veracity. All 19 climate scientists who had seen the movie or had read the homonymous book said that Gore accurately conveyed the science, with few errors.[37]William H. Schlesinger, dean of the Nicholas School of Environment and Earth Sciences at Duke University said \"[Gore] got all the important material and got it right.\" Robert Corell, chairman of the Arctic Climate Impact Assessment was also impressed. \"I sat there and I'm amazed at how thorough and accurate. After the presentation I said, 'Al, I'm absolutely blown away. There's a lot of details you could get wrong.'...I could find no error.\"[37] Michael Shermer, scientific author and founder of The Skeptics Society, wrote in Scientific American that Gore's slide show \"shocked me out of my doubting stance.\"[38] Eric Steig, a climate scientist writing on RealClimate, lauded the film's science as \"remarkably up to date, with reference to some of the very latest research.\"[39] Ted Scambos, lead scientist from the National Snow and Ice Data Center, said the film \"does an excellent job of outlining the science behind global warming and the challenges society faces in the coming century because of it.\"[40]One concern among scientists in the film was the connection between hurricanes and global warming, which remains contentious in the science community. Gore cited five recent scientific studies to support his view.[37] \"I thought the use of imagery from Hurricane Katrina was inappropriate and unnecessary in this regard, as there are plenty of disturbing impacts associated with global warming for which there is much greater scientific consensus,\" said Brian Soden, professor of meteorology and oceanography at the University of Miami.[37] Gavin Schmidt, climate modeler for NASA, thought Gore appropriately addressed the issue.[41] \"Gore talked about 2005 and 2004 being very strong seasons, and if you weren't paying attention, you could be left with the impression that there was a direct cause and effect, but he was very careful to not say there's a direct correlation,\" Schmidt said.[41] \"There is a difference between saying 'we are confident that they will increase' and 'we are confident that they have increased due to this effect,'\" added Steig. \"Never in the movie does he say: 'This particular event is caused by global warming.'\"[41]Gore's use of long ice core records of CO2 and temperature (from oxygen isotope measurements) in Antarctic ice cores to illustrate the correlation between the two drew some scrutiny; Schmidt, Steig and Michael E. Mann back up Gore's data. \"Gore stated that the greenhouse gas levels and temperature changes over ice age signals had a complex relationship but that they 'fit'. Both of these statements are true,\" said Schmidt and Mann.[42] \"The complexity though is actually quite fascinating...a full understanding of why CO2 changes in precisely the pattern that it does during ice ages is elusive, but among the most plausible explanations is that increased received solar radiation in the southern hemisphere due to changes in Earth’s orbital geometry warms the southern ocean, releasing CO2 into the atmosphere, which then leads to further warming through an enhanced greenhouse effect. Gore’s terse explanation of course does not mention such complexities, but the crux of his point–that the observed long-term relationship between CO2 and temperature in Antarctica supports our understanding of the warming impact of increased CO2 concentrations–is correct. Moreover, our knowledge of why CO2 is changing now (fossil fuel burning) is solid. We also know that CO2 is a greenhouse gas, and that the carbon cycle feedback is positive (increasing temperatures lead to increasing CO2 and CH4), implying that future changes in CO2 will be larger than we might anticipate.\"[42] \"Gore is careful not to state what the temperature/CO2 scaling is,\" said Steig. \"He is making a qualitative point, which is entirely accurate. The fact is that it would be difficult or impossible to explain past changes in temperature during the ice age cycles without CO2 changes. In that sense, the ice core CO2-temperature correlation remains an appropriate demonstration of the influence of CO2 on climate.\"[39]Steig disputed Gore's statement that you can visibly see the effect that the United States Clean Air Act has had on ice cores in Antarctica. \"One can neither see, nor even detect using sensitive chemical methods any evidence in Antarctica of the Clean Air Act,\" he said, but did note that they are \"clearly recorded in ice core records from Greenland.\"[43] Despite these flaws, Steig said that the film got the fundamental science right and the minor factual errors did not undermine the main message of the film,[43] adding \"An Inconvenient Truth rests on a solid scientific foundation.\"[43]Lonnie Thompson, Earth Science professor at Ohio State University, whose work on retreating glaciers was featured in the film, was pleased with how his research was presented. \"It's so hard given the breadth of this topic to be factually correct, and make sure you don't lose your audience,\" Thompson said. \"As scientists, we publish our papers in Science and Nature, but very few people read those. Here's another way to get this message out. To me, it's an excellent overview for an introductory class at a university. What are the issues and what are the possible consequences of not doing anything about those changes? To me, it has tremendous value. It will reach people that scientists will never reach.\"[41]John Nielsen-Gammon from Texas A&M University said the \"main scientific argument presented in the movie is for the most part consistent with the weight of scientific evidence, but with some of the main points needing updating, correction, or qualification.\"[44] Nielsen-Gammon thought the film neglected information gained from computer models, and instead relied entirely on past and current observational evidence, \"perhaps because such information would be difficult for a lay audience to grasp, believe, or connect with emotionally.\"[44]Steven Quiring, climatologist from Texas A&M University added that \"whether scientists like it or not, An Inconvenient Truth has had a much greater impact on public opinion and public awareness of global climate change than any scientific paper or report.\"[45]","Use in education":"Several colleges and high schools have begun to use the film in science curricula. [120] In Germany, German Environment Minister Sigmar Gabriel bought 6,000 DVDs of An Inconvenient Truth to make it available to German schools.[121] Prime Minister José Luis Rodríguez Zapatero distributed 30 000 copies to the Spanish schools in October, 2007.[122] In Burlington, Ontario, Canada, the Halton District School Board made An Inconvenient Truth available at schools and as an educational resource.[123]As part of a nationwide \"Sustainable Schools Year of Action\" launched in late 2006, the UK Government, Welsh Assembly Government and Scottish Executive announced between January–March 2007 that copies of An Inconvenient Truth would be sent to all their secondary schools. The film was placed into the science curriculum for fourth and sixth-year students in Scotland as a joint initiative between Learning and Teaching Scotland and ScottishPower.[124]In May 2007, Stewart Dimmock—a lorry (HGV) driver, school governor from Kent, England, and member of a right-wing group called the New Party—challenged the UK Government's distribution of the film in a lawsuit, Dimmock v Secretary of State for Education and Skills, with help from political ally and New Party founder Viscount Monckton,[125][126] who notably pointed out \"35 serious scientific errors\".[127] The plaintiffs sought an injunction preventing the screening of the film in English schools, arguing that by law schools are forbidden to promote partisan political views and, when dealing with political issues, are required to provide a balanced presentation of opposing views.On October 10, 2007, Justice Michael Burton, after explaining that the requirement for a balanced presentation does not warrant that equal weight be given to alternative views of a mainstream view, ruled that it was clear that the film was substantially founded upon scientific research and fact, albeit that the science had been used, in the hands of a \"talented politician and communicator\", to make a political statement and to support a political program.[128] The judge ruled that An Inconvenient Truth contained nine scientific errors and thus must be accompanied by an explanation of those errors before being shown to school children. The judge said that showing the film without the explanations of error would be a violation of education laws.[129]The judge concluded \"I have no doubt that Dr Stott, the Defendant's expert, is right when he says that: 'Al Gore's presentation of the causes and likely effects of climate change in the film was broadly accurate.'\" On the basis of testimony from Robert M. Carter and the arguments put forth by the claimant's lawyers, the judge also pointed to nine \"errors\", i.e. statements the truth of which he did not rule on, but that he found to depart from the mainstream scientific positions on global warming.[129][130][131] He also found that some of these departures from the mainstream arose in the context of alarmism and exaggeration in support of political theses.[132][133] Since the government had already accepted to amend the guidance notes to address these along with other points in a fashion that the judge found satisfactory, no order was made on the application.Each side declared victory. Government Minister of Children, Young People and Families, Kevin Brennan stated: \"We have updated the accompanying guidance, as requested by the judge to make it clearer for teachers as to the stated Intergovernmental Panel on Climate Change position on a number of scientific points raised in the film.\"[134] Plaintiff Dimmock complained that \"no amount of turgid guidance\" could change his view that the film was unsuitable for the classroom.[135] A spokesman for Gore said: \"Of the thousands of facts in the film, the judge only took issue with just a handful. And of that handful, we have the studies to back those pieces up.\"[136]In the United States, 50,000 free copies of An Inconvenient Truth were offered to the National Science Teachers Association (NSTA), which declined to take them. Producer David provided an email correspondence from the NSTA detailing that their reasoning was that the DVDs would place \"unnecessary risk upon the [NSTA] capital campaign, especially certain targeted supporters,\" and that they saw \"little, if any, benefit to NSTA or its members\" in accepting the free DVDs.[137] A Washington Post editorial called the decision \"Science a la Joe Camel\", citing for example that the NSTA had received $6 million since 1996 from Exxon Mobil, which had a representative on the organization's corporate board.[138] In public, the NSTA argued that distributing this film to its members would have been contrary to a long-standing NSTA policy against distributing unsolicited materials to its members. The NSTA also said that they had offered several other options for distributing the film but ultimately \"[it] appears that these alternative distribution mechanisms were unsatisfactory.\"[139] David has said that NSTA Executive Director Gerry Wheeler promised in a telephone conversation to explore alternatives with NSTA's board for advertising the film but she had not yet received an alternative offer at the time of NSTA's public claim. She also said that she rejected their subsequent offers because they were nothing more than offers to sell their \"commercially available member mailing list\" and advertising space in their magazine and newsletter, which are available to anyone. She noted that in the past, NSTA had shipped out 20,000 copies of a 10-part video produced by Wheeler with funding provided by ConocoPhillips in 2003. NSTA indicated that they retained editorial control over the content, which David questioned based on the point of view portrayed in the global warming section of the video.[140]The American Association for the Advancement of Science publication ScienceNOW published an assessment discussing both sides of the NSTA decision in which it was reported that \"David says NSTA's imprimatur [i.e. endorsement or sanction] was essential and that buying a mailing list is a nonstarter. 'You don't want to send out a cold letter, and it costs a lot of money,' she says. 'There are a thousand reasons why that wouldn't work.'\"[141]In January 2007, the Federal Way (Washington State) School Board voted to require an approval by the principal and the superintendent for teachers to show the film to students and that the teachers must include the presentation of an approved \"opposing view\".[142] The moratorium was repealed, at a meeting on January 23, after a predominantly negative community reaction.[143] Shortly thereafter, the school board in Yakima, Washington, calling the film a \"controversial issue\", prevented the Environmental Club of Eisenhower High School from showing it, pending review by the school board, teachers, principal, and parents.[144] It lifted the stay a month later, upon the approval by a review panel.[145]Former ACT New Zealand Member of Parliament Muriel Newman filed a petition to have New Zealand schoolchildren be protected from political indoctrination by putting provisions that resembled those in the UK to the Education Act. The petition was in response to concerned parents talked with Newman after An Inconvenient Truth was shown in schools in 2007. The parents were worried that teachers were not pointing out supposed inaccuracies in the film and were not explaining differing viewpoints.[146]","budget":"$1 million[2]","Impact":"The documentary has been generally well-received politically in many parts of the world and is credited for raising further awareness of global warming internationally.[100] The film inspired producer Kevin Wall to conceive the 2007 Live Earth festival[101] and influenced Italian composer Giorgio Battistelli to write an operatic adaptation, entitled \"CO2,\" premiering at La Scala in Milan in 2015. [102]Following the film, Gore founded The Climate Reality Project in 2006 which trained 1,000 activists to give Gore’s presentation in their communities. Presently, the group has 3,500 presenters worldwide.[103] An additional initiative was launched in 2010, called \"Inconvenient Youth\". \"'Inconvenient Youth' is built on the belief that teens can help lead efforts to solve the climate crisis,\" said Gore. The project was inspired by Mary Doerr, a 16-year-old who trained as presenter for the organization.[103]University of Scranton professor Jessica Nolan found in a 2010 study published for Environment and Behavior that people became more informed and concerned about climate change right after seeing the film but that these concerns didn't translate into changed behavior a month later.[104] On the contrary, in a 2011 paper published in the Journal of Environmental Economics and Management, University of Oregon professor Grant Jacobsen found in the two months following the release of the film, zip codes within a 10-mile radius of a zip code where the film was shown experienced a 50 percent relative increase in the purchase of voluntary carbon offsets.[105]In a July 2007 47-country Internet survey conducted by The Nielsen Company and Oxford University, 66% of those respondents who said they had seen An Inconvenient Truth stated that it had \"changed their mind\" about global warming and 89% said it had made them more aware of the problem. Three out of four (74%) said they had changed some of their habits because of seeing the film.[100]Then-president George W. Bush, when asked whether he would watch the film, responded: \"Doubt it.\" Gore responded that \"The entire global scientific community has a consensus on the question that human beings are responsible for global warming and he [Bush] has today again expressed personal doubt that that is true.\" White House deputy press secretary Dana Perino stated that \"The president noted in 2001 the increase in temperatures over the past 100 years and that the increase in greenhouse gases was due to a certain extent to human activity\".[106]Several United States Senators screened the film. New Mexico Democratic Senator Jeff Bingaman and Nevada Democratic Senator Harry Reid saw the movie at its Washington premiere at the National Geographic Society.[107][108] New Mexico Democratic Senator Tom Udall planned to see the film saying \"It's such a powerful statement because of the way the movie is put together, I tell everybody, Democrat or Republican, they've got to go see this movie.\"[108] Former New Mexico Republican Senator Pete Domenici thought Gore's prominence on the global warming issue made it more difficult to get a consensus in Congress. Bingaman disputed this saying, \"It seems to me we were having great difficulty recruiting Republican members of Congress to support a bill before Al Gore came up with this movie.\"[108]Oklahoma Republican Senator Jim Inhofe, then-chairman of the Senate Environment and Public Works Committee, didn't plan to see the film (which he appears in), and compared it to Adolf Hitler's book \"Mein Kampf\". \"If you say the same lie over and over again, and particularly if you have the media's support, people will believe it,\" Inhofe said, adding that he thought Gore was trying to use the issue to run for president again in 2008.[108]In contrast to Inhofe, Arizona Republican Senator John McCain, did not criticize Gore's efforts or the movie, which he planned to see.[108]Tennessee Republican Senator Lamar Alexander, said \"Because (Gore) was a former vice president and presidential nominee, he brings a lot of visibility to (the issue),\" Alexander said. \"On the other hand it may be seen as political by some, and they may be less eager to be a part of it.\" Alexander also criticized the omission of nuclear power in the film. \"Maybe it needs a sequel: 'An Inconvenient Truth 2: Nuclear Power.'\"[108]In September 2006, Gore traveled to Sydney, Australia to promote the film. Then-Australian Prime Minister John Howard said he would not meet with Gore or agree to Kyoto because of the movie: \"I don't take policy advice from films.\" Former Opposition Leader Kim Beazley joined Gore for a viewing and other MPs attended a special screening at Parliament House earlier in the week.[109] After winning the general election a year later, Prime Minister Kevin Rudd ratified Kyoto in his first week of office, leaving the United States the only industrialized nation in the world not to have signed the treaty.[109]In the United Kingdom, Conservative party leader and future Prime Minister David Cameron urged people to watch the film in order to understand climate change.[110]In Belgium, Margaretha Guidone persuaded the entire Belgian government to see the film.[111] 200 politicians and political staff accepted her invitation, among whom were Belgian prime minister Guy Verhofstadt and Minister-President of Flanders, Yves Leterme.[112] Gore received the Prince of Asturias Prize in 2007 for international cooperation.[113][114]In Costa Rica, the film was screened by president Oscar Arias.[115] Arias's subsequent championing of the climate change issue was greatly influenced by the film.[116]The Competitive Enterprise Institute released pro-carbon dioxide television ads in preparation for the film's release in May 2006. The ads featured a little girl blowing a dandelion with the tagline, \"Carbon dioxide. They call it pollution. We call it life.\"[117]In August 2006, the Wall Street Journal[118][119] revealed that a YouTube video lampooning Gore and the movie, titled Al Gore's Penguin Army, appeared to be \"astroturfing\" by DCI Group, a Washington public relations firm.","screenplay_by":"Al Gore","Background":"Gore became interested in global warming when he took a course at Harvard University with Professor Roger Revelle, one of the first scientists to measure carbon dioxide in the atmosphere.[15] Later, when Gore was in Congress, he initiated the first congressional hearing on the subject in 1981.[16] Gore's 1992 book, Earth in the Balance, dealing with a number of environmental topics, reached the New York Times bestseller list.[17]As Vice President during the Clinton Administration, Gore pushed for the implementation of a carbon tax to encourage energy efficiency and diversify the choices of fuel better reflecting the true environmental costs of energy use; it was partially implemented in 1993.[18] He helped broker the 1997 Kyoto Protocol, an international treaty designed to curb greenhouse gas emissions.[19][20] The treaty was not ratified in the United States after a 95 to 0 vote in the Senate. The primary objections stemmed from the exemptions the treaty gave to China and India, whose industrial base and carbon footprint have grown rapidly, and fears that the exemptions would lead to further trade imbalances and offshoring arrangement with those countries.[21][22]Gore also supported the funding of the controversial, and much-delayed satellite called Triana, which would have provided an image of the Earth 24 hours a day, over the internet and would have acted as a barometer measuring the process of global warming.[23] During his 2000 presidential campaign, Gore ran, in part, on a pledge to ratify the Kyoto Protocol.[24]After his defeat in the 2000 presidential election by George W. Bush, Gore returned his focus to the topic. He edited and adapted a slide show he had compiled years earlier, and began featuring the slide show in presentations on global warming across the U.S. and around the world. At the time of the film, Gore estimated he had shown the presentation more than one thousand times.[25]Producer Laurie David saw Gore's slide show in New York City at a global warming town-hall meeting after the May 27, 2004 premiere of The Day After Tomorrow.[26] Gore was one of several panelists and he showed a ten-minute version of his slide show. [27]I had never seen it before, and I was floored. As soon as the evening's program concluded, I asked him to let me present his full briefing to leaders and friends in New York and Los Angeles. I would do all the organizing if he would commit to the dates. Gore's presentation was the most powerful and clear explanation of global warming I had ever seen. And it became my mission to get everyone I knew to see it too.Inspired, David assembled a team, including producer Lawrence Bender and former president of eBay Jeffrey Skoll, who met with Gore about the possibility of making the slide show into a movie. It took some convincing. The slide show, she says, \"was his baby, and he felt proprietary about it and it was hard for him to let go.\"[26]David said the box office returns weren't important to her. \"None of us are going to make a dime.\" What is at stake, she says, \"is, you know, the planet.\"[26]David and Bender later met with director Davis Guggenheim, to have him direct the film adaptation of his slide show. Guggenheim, who was skeptical at first, later saw the presentation for himself, stating that he was \"blown away,\" and \"left after an hour and a half thinking that global warming [was] the most important issue... I had no idea how you’d make a film out of it, but I wanted to try,\" he said.[28]In 2004 Gore enlisted Duarte Design to condense and update his material and add video and animation.[29] Ted Boda described the tools that went into designing the project: \"Gore's presentation was in fact using Apple's Keynote presentation software (the same software Steve Jobs presents from) and did so for a number of reasons. As a designer for the presentation, Keynote was the first choice to help create such an engaging presentation.\"[30]Initially reluctant of the film adaptation, Gore said after he and the crew were into the production of the movie, the director, Guggenheim, earned his trust.[31]I had seen enough to gain a tremendous respect for his skill and sensitivity. And he said that one of the huge differences between a live stage performance and a movie is that when you're in the same room with a live person who's on stage speaking – even if it's me – there's an element of dramatic tension and human connection that keeps your attention. And in a movie, that element is just not present. He explained to me that you have to create that element on screen, by supplying a narrative thread that allows the audience to make a connection with one or more characters. He said, \"You've got to be that character.\" So we talked about it, and as I say, by then he had earned such a high level of trust from me that he convinced me.When Bender first saw Gore's visual presentation he had concerns about connection with viewers, citing a \"need to find a personal way in.\" In the string of interviews with Gore that followed, Gore himself felt like they \"were making Kill Al Vol. 3\".[32] Bender had other issues including a time frame that was \"grueling\" and needed to be done in \"a very short period of time\" despite many filming locations planned. These included many locations throughout the United States and also included China. \"It was a lot of travel in a very short period of time. And they had to get this thing edited and cut starting in January, and ready to screen in May. That’s like a seriously tight schedule. So the logistics of pulling it off with a low budget were really difficult, and if there’s one person who gets credit, it’s Leslie Chilcott, because she really pulled it together.\"[32]The majority of the movie exhibits Gore delivering his lecture to an audience at a relatively small theater in Los Angeles. Gore's presentation was delivered on a 70-foot digital screen that Bender commissioned specifically for the movie.[32]While the bulk of the film was shot on 4:4:4 HDCAM, according to director Guggenheim, a vast array of different film formats were used: \"There’s 35mm and 16mm. A lot of the stuff on the farm I just shot myself on 8mm film. We used four Sony F950 HDCAMs for the presentation. We shot three different kinds of prosumer HD, both 30 and 24. There’s MiniDV, there’s 3200 black-and-white stills, there’s digital stills, some of them emailed on the day they were taken from as far off as Greenland. There was three or four different types of animation. One of the animators is from New Zealand and emailed me his work. There’s JPEG stuff.\"[33]Guggenheim says while it would've been a lot easier to use one format, it would not have had the same impact. \"Each format has its own feel and texture and touch. For the storytelling of what Gore’s memory was like of growing up on the farm, some of this 8mm stuff that I shot is very impressionistic. And for some of his memories of his son’s accident, these grainy black-and-white stills... have a feel that contrasted very beautifully with the crisp hi-def HD that we shot. Every format was used to its best potential. Some of the footage of Katrina has this blown-out video, where the chroma is just blasted, and it looks real muddy, but that too has its own kind of powerful, impactful feeling.\"[33]","Reception":"The film opened in New York City and Los Angeles on May 24, 2006. On Memorial Day weekend, it grossed an average of $91,447 per theater, the highest of any movie that weekend and a record for a documentary, though it was only playing on four screens at the time.[46]At the 2006 Sundance Film Festival, the movie received three standing ovations.[47] It was also screened at the 2006 Cannes Film Festival[48] and was the opening night film at the 27th Durban International Film Festival on June 14, 2006.[49] An Inconvenient Truth was the most popular documentary at the 2006 Brisbane International Film Festival.[50]The film has grossed over $24 million in the U.S., making it the tenth-highest-grossing documentary in the U.S. (from 1982 to the present).[51] It grossed nearly $26 million in foreign countries, the highest being France, where it grossed $5 million.[52] According to Gore, \"Tipper and I are devoting 100 percent of the profits from the book and the movie to a new bipartisan educational campaign to further spread the message about global warming.\"[53] Paramount Classics committed 5% of their domestic theatrical gross from the film to form a new bipartisan climate action group, Alliance for Climate Protection, dedicated to awareness and grassroots organizing.[54]The film received a positive reaction from film critics and audiences. It garnered a \"certified fresh\" 93% rating at Rotten Tomatoes. At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film has received an average score of 75, based on 32 reviews.[55] Film critics Roger Ebert and Richard Roeper gave the film \"two thumbs up\". Ebert said, \"In 39 years, I have never written these words in a movie review, but here they are: You owe it to yourself to see this film. If you do not, and you have grandchildren, you should explain to them why you decided not to,\"[56] calling the film \"horrifying, enthralling and [having] the potential, I believe, to actually change public policy and begin a process which could save the Earth.\"[9]New York Magazine critic David Edelstein called the film \"One of the most realistic documentaries I've ever seen—and, dry as it is, one of the most devastating in its implications.\"[57] The New Yorker's David Remnick added that while it was \"not the most entertaining film of the year...it might be the most important\" and a \"brilliantly lucid, often riveting attempt to warn Americans off our hellbent path to global suicide.\"[58] New York Times reviewer A.O. Scott thought the film was \"edited crisply enough to keep it from feeling like 90 minutes of C-SPAN and shaped to give Mr. Gore's argument a real sense of drama,\" and \"as unsettling as it can be,\" Scott continued, \"it is also intellectually exhilarating, and, like any good piece of pedagogy, whets the appetite for further study.\"[59] Bright Lights Film Journal critic Jayson Harsin declared the film's aesthetic qualities groundbreaking, as a new genre of slideshow film.[60] NASA climatologist James Hansen described the film as powerful, complemented by detail in the book. Hansen said that \"Gore has put together a coherent account of a complex topic that Americans desperately need to understand. The story is scientifically accurate and yet should be understandable to the public, a public that is less and less drawn to science.\" He added that with An Inconvenient Truth, \"Al Gore may have done for global warming what Silent Spring did for pesticides. He will be attacked, but the public will have the information needed to distinguish our long-term well-being from short-term special interests.\"[61]In \"extensive exit polling\" of An Inconvenient Truth in \"conservative suburban markets like Plano and Irvine (Orange County), as well as Dallas and Long Island\", 92 percent rated \"Truth\" highly and 87 percent of the respondents said they'd recommend the film to a friend.[62] University of Washington professor Michele Poff argued that Gore was successful in communicating to conservative-leaning audiences by framing the climate crisis as apolitical.[63] \"Gore’s and the environment’s identification with the Democratic Party posed a significant challenge to reaching Republicans and conservatives, as well as those disgruntled with politics in general,\" Poff wrote. \"To appeal to such individuals, Gore framed the matter as distinctly apolitical — as an issue both outside politics and one that was crucial regardless of one’s ideological leanings. These explicit attempts to frame the issue as apolitical take on further gravitas when we consider how Gore infused the film with reflections of conservative values. Indeed, Gore reached deeply into the value structure of American conservatives to highlight ideals that suggested his cause was not liberal, but rather was beyond politics, beyond ideology.\"[63]Several reviews criticized the film on scientific and political grounds. Journalist Ronald Bailey argued in the libertarian magazine Reason that although \"Gore gets [the science] more right than wrong,\" he exaggerates the risks.[64] MIT atmospheric physicist Richard S. Lindzen was vocally critical of the film, writing in a June 26, 2006 op-ed in the Wall Street Journal that Gore was using a biased presentation to exploit the fears of the public for his own political gain.[65]Some other reviewers were also skeptical of Gore's intent, wondering whether he was setting himself for another Presidential run. Boston Globe writer Peter Canello criticized the \"gauzy biographical material that seems to have been culled from old Gore campaign commercials.\"[66] Phil Hall of Film Threat gave the film a negative review, saying \"An Inconvenient Truth is something you rarely see in movies today: a blatant intellectual fraud.\"[67]Others felt Gore didn't go far enough in depicting the threat Indigenous peoples faced with the dire consequences of climate change. \"An Inconvenient Truth completely ignores the plight of Arctic indigenous peoples whose cultures and landscapes are facing profound changes produced by melting polar ice,\" argued environmental historian Finis Dunaway.[68]","Synopsis":"An Inconvenient Truth presents in film form an illustrated talk on climate by Al Gore, aimed at alerting the public to an increasing \"planetary emergency\" due to global warming, and shows re-enacted incidents from his life story which influenced his concerns about environmental issues. He began making these presentations in 1989 with flip chart illustrations,[6] the film version uses a Keynote presentation, which Gore refers to as \"the slide show\".[7]The former vice president opens the film by greeting an audience with his well known line about his campaign in 2000: \"I am Al Gore; I used to be the next President of the United States.\"[8] He is shown using his laptop to edit his presentation, and pondering the difficulty he has had in awakening public concern: \"I've been trying to tell this story for a long time and I feel as if I've failed to get the message across.\"[6]Gore then begins his slide show on Global Warming; a comprehensive presentation replete with detailed graphs, flow charts and stark visuals. Gore shows off several majestic photographs of the Earth taken from multiple space missions, Earthrise and The Blue Marble.[9] Gore notes that these photos dramatically transformed the way we see the Earth, helping spark modern environmentalism.Following this, Gore shares anecdotes that inspired his interest in the issue, including his college education with early climate expert Roger Revelle at Harvard University, his sister's death from lung cancer and his young son's near-fatal car accident. Gore recalls a story from his grade-school years, where a fellow student asked his geography teacher about continental drift; in response, the teacher called the concept the \"most ridiculous thing [he'd] ever heard.\" Gore ties this conclusion to the assumption that \"the Earth is so big, we can't possibly have any lasting, harmful impact on the Earth's environment.\" For comic effect, Gore uses a clip from the Futurama episode \"Crimes of the Hot\" to describe the greenhouse effect. Gore refers to his loss to George W. Bush in the 2000 United States presidential election as a \"hard blow\" yet one which subsequently \"brought into clear focus, the mission [he] had been pursuing for all these years.\"Throughout the movie, Gore discusses the scientific opinion on global warming, as well as the present and future effects of global warming and stresses that global warming \"is really not a political issue, so much as a moral one,\" describing the consequences he believes global warming will produce if the amount of human-generated greenhouse gases is not significantly reduced in the very near future. Gore also presents Antarctic ice coring data showing CO2 levels higher now than in the past 650,000 years.The film includes segments intended to refute critics who say that global warming is unproven or that warming will be insignificant. For example, Gore discusses the possibility of the collapse of a major ice sheet in Greenland or in West Antarctica, either of which could raise global sea levels by approximately 20 feet, flooding coastal areas and producing 100 million refugees. Melt water from Greenland, because of its lower salinity, could then halt the currents that keep northern Europe warm and quickly trigger dramatic local cooling there. It also contains various short animated projections of what could happen to different animals more vulnerable to global warmingThe documentary ends with Gore arguing that if appropriate actions are taken soon, the effects of global warming can be successfully reversed by releasing less CO2 and planting more vegetation to consume existing CO2. Gore calls upon his viewers to learn how they can help him in these efforts. Gore concludes the film by saying:\"Each one of us is a cause of global warming, but each one of us can make choices to change that with the things we buy, the electricity we use, the cars we drive; we can make choices to bring our individual carbon emissions to zero. The solutions are in our hands, we just have to have the determination to make it happen. We have everything that we need to reduce carbon emissions, everything but political will. But in America, the will to act is a renewable resource.\"[10]During the film's end credits, a diaporama pops up on screen suggesting to viewers things at home they can do to combat global warming, including \"recycle\", \"speak up in your community\", \"try to buy a hybrid vehicle\" and \"encourage everyone you know to watch this movie.\"[11]Gore's book of the same title was published concurrently with the theatrical release of the documentary. The book contains additional information, scientific analysis, and Gore's commentary on the issues presented in the documentary.[12][13] A 2007 documentary entitled An Update with Former Vice President Al Gore features Gore discussing additional information that came to light after the film was completed, such as Hurricane Katrina, coral reef depletion, glacial earthquake activity on the Greenland ice sheet, wildfires, and trapped methane gas release associated with permafrost melting.[14]","an_inconvenient_truth":"Promotional poster for An Inconvenient Truth designed by The Ant Farm[1]","Music":"An Inconvenient Truth was scored by Michael Brook with an accompanying theme song played during the end credits by Melissa Etheridge. Brook explained that he wanted to bring out the emotion expressed in the film: \"...in Inconvenient Truth, there's a lot of information and it's kind of a lecture, in a way, and very well organized and very well presented, but it's a lot to absorb. And the director, Guggenheim, wanted to have – sort of give people a little break every once in a while and say, okay, you don't have to absorb this information, you can just sort of – and it was more the personal side of Al Gore's life or how it connected to the theme of the film. And that's when there's music.\"[148]Etheridge agreed to write An Inconvenient Truth's theme song, \"I Need to Wake Up\" after viewing Gore's slide show.[149] \"I was so honored he would ask me to contribute to a project that is so powerful and so important, I felt such a huge responsibility,\" she said. \"Then I went, 'What am I going to write? What am I going to say?' \" Etheridge's former partner, Tammy Lynn Michaels, told her: \"Write what you feel, because that's what people are going to feel.\"[149] Of Etheridge's commitment to the project, Gore said, \"Melissa is a rare soul who gives a lot of time and effort to causes in which she strongly believes.\"[149] Etheridge received the 2006 Academy Award for Best Original Song for \"I Need to Wake Up.\" Upon receiving the award, she noted in her acceptance speech:Mostly I have to thank Al Gore, for inspiring us, for inspiring me, showing that caring about the Earth is not Republican or Democrat; it's not red or blue, it's all green.[74]","produced_by":"Laurie David|Lawrence Bender|Scott Z. Burns|","starring":"Al Gore","music_by":"Michael Brook","External links":"","edited_by":"Jay Cassidy|Dan Swietlik|"}