{"country":"United States","Awards and nominations":"","distributed_by":"Columbia Pictures","screenplay_by":"Gary Whitta|M. Night Shyamalan|","story_by":"Will Smith","after_earth":"Theatrical release poster","Plot":"In the 21st century, an environmental cataclysm forces the human race to abandon Earth and to settle on a new world, Nova Prime.One thousand years later, the Ranger Corps, a peacekeeping organization commanded by General Cypher Raige (Will Smith), comes into conflict with the S'krell, alien creatures who intend to conquer Nova Prime. Their secret weapons are the Ursas, large predatory creatures that hunt by \"sensing\" fear. The Rangers struggle against the Ursas until Cypher learns how to completely suppress his fear, a technique called \"ghosting\". After teaching this technique to the other Rangers, he leads the Ranger Corps to victory. Meanwhile, Cypher's son Kitai Raige (Jaden Smith) blames himself for the death of his sister Senshi (Zoë Kravitz) at the hands of an Ursa. Kitai trains to become a Ranger like Cypher, but his application is rejected due to his recklessness, and Cypher views him as a disappointment. Kitai's mother Faia (Sophie Okonedo) convinces Cypher to take Kitai on his last voyage before retirement.During their flight, however, an asteroid shower forces their spaceship to crash-land on the now-quarantined Earth, near erstwhile Central America. Both of Cypher's legs are broken, and the main emergency rescue beacon damaged. Cypher instructs Kitai to locate the tail section of the ship, which broke off on entry to the atmosphere. Inside is the backup beacon which they can use to signal Nova Prime. Cypher gives Kitai his weapon, a wrist communicator, and six capsules of a fluid that enhances the oxygen intake so he can breathe in Earth's low-oxygen atmosphere. Cypher warns him to avoid the highly evolved fauna and flora, and to beware of violent thermal shifts. Kitai leaves to find the tail section, with Cypher guiding him through the communicator.Giant baboons attack Kitai, and during his escape a poisonous leech bites him. Kitai administers the antidote, but two of his capsules become damaged and his nervous system shuts down. When Kitai awakens, he narrowly escapes a thermal shift. Kitai lies to Cypher, not informing him of the damaged capsules. That night, Kitai listens to Cypher tell him a story of when he was attacked by an Ursa, how Cypher realized that fear is merely an illusion created by the mind's thoughts of the future, and thus Cypher first began to \"ghost\" himself from the Ursas, choosing to live rather than to let his enemies - both fear and the Ursas - decide his fate.The following day Kitai reaches a mountaintop, and Cypher learns about the broken capsules. Knowing that the only way to complete the journey with only two capsules would be to skydive, Cypher orders Kitai to abort the mission. Believing his father still sees him as a disappointment, Kitai blames Senshi's death on Cypher's absence on the day of the attack. He skydives from the mountaintop, but a large eagle captures him and his communicator is damaged. Kitai wakes in the eagle's nest, surrounded by its chicks. Tigers attack the chicks, and Kitai defends—but fails to save—the chicks. The eagle attacks the tigers, and Kitai escapes. He reaches a river, and builds a raft to continue along it. Tired, Kitai falls asleep on the raft. He dreams of his sister, Senshi, who reassures him that Cypher's bitterness is just his own anger for not saving her. Senshi urges Kitai to wake up. When he does, another thermal shift catches him by surprise and he nearly freezes to death. Kitai is rescued by the eagle, who sacrifices itself for him.Kitai reaches the tail section and retrieves the emergency beacon along with another communicator, weapon, and more oxygen capsules. The communicator only allows Cypher to see and hear Kitai, but not for Kitai to hear him. Kitai learns that the ship's Ursa escaped and killed the remnants of the crew. The emergency beacon does not activate, and Cypher realizes that the atmosphere is blocking the signal. Kitai heads to a nearby volcano from which he can launch the beacon, and is injured when the Ursa attacks him. Kitai is able to control his fear and \"ghost\" himself from the Ursa enough to kill it. He then launches the beacon. A rescue team arrives, and the film ends with the two traveling back to Nova Prime, both agreeing that they would rather work with Faia.","language":"English","Reception":"The film received negative reviews from critics, with critics paining it's self-contradicting script, bad pacing, numerous inconsistencies and plot holes, but the most major criticism over Jaden Smith's performance. As a result, he won a Golden Raspberry Award for Worst Actor. On Rotten Tomatoes gives the film a score of 11% based on 189 reviews, with an average rating of 3.8/10. The site's consensus states, \"After Earth is a dull, ploddingly paced exercise in sentimental sci-fi – and the latest setback for director M. Night Shyamalan's once-promising career.\"[57] Metacritic gives it a score of 33/100 based on 41 reviews, indicating \"generally unfavorable reviews\".[58] The film earned a B grade from audiences surveyed by CinemaScore on opening day.[59] Under CinemaScore, a C grade is the equivalent of a failing grade, and a B grade signals general satisfaction.[60]Joe Morgenstern, film critic for The Wall Street Journal, opened his review by asking: \"Is After Earth the worst movie ever made?\" His answer was \"Maybe not; there's always Battlefield Earth to remind us how low the bar can go.\"[61] Like Morgenstern, Manohla Dargis of The New York Times made note of the film's use of central themes in Scientology before concluding the film was nothing more than a \"big-screen vanity project\".[62] Los Angeles Times reviewer Betsy Sharkey wondered how the elder Smith could have gone from the charismatic performance in the serious film The Pursuit of Happyness, also co-starring his son, to the performance in After Earth. She also saw compounding problems in the creative process leading to a lack of subtlety and nuance: \"The script has no nuance, none. And when Shyamalan moves into the director's chair, the script problems are magnified.\"[63] Both Dustin Putman and Scott Foundas of Variety opined that the film was further proof that Shyamalan had become a \"director-for-hire\", with \"his disinterest palpable from first frame to last\".[64][65] Peter Bradshaw of The Guardian gave the film one star out of five, calling it \"another uncompromisingly terrible film ... featuring a triple-whammy of abysmal acting, directing and story\" and saying that Jaden Smith \"plays the role throughout with a face like a smacked bum\" and \"Kitai [Jaden Smith's character] must be like his dad: show no fear. Or any emotion. Or any acting talent of any sort.\"[66]Matt Zoller Seitz of RogerEbert.com awarded the film 3.5 stars out of 4 and commented that the movie is \"a moral tale disguised as a sci-fi blockbuster. It's no classic, but it's a special movie: spectacular and wise.\"[67] Jim Vejvoda of IGN awarded the film a 6.7 out of 10 and commented, \"M. Night Shyamalan isn't quite back in top form here, but After Earth is certainly the best movie he's made in years.\"[68] Charlie Jane Anders of Io9 commented that \"Having suffered through Last Airbender, I can attest that this film is no Last Airbender... After Earth stays grounded, and manages to tell a pretty decent story.\"[69] John Hayward of Breitbart.com said the movie is not nearly as bad as its box-office thud and scathing reviews would suggest, Shyamalan does a \"solid job in the director's chair\", and Jaden Smith is \"really a decent actor.\"[70]The special effects received a mixed response. Rene Rodriguez of The Miami Herald said that \"the CGI creatures in the film look as fake as the monkeys in Indiana Jones and the Kingdom of the Crystal Skull\"[71] and Rebecca Murray of About.com said that the effects \"look as though they've been created by someone who just got accepted to film school\".[72] Charlie McCollum of the San Jose Mercury News called them \"surprisingly unconvincing, a step or two above the effects in those deliberately cheese ball sci-fi flicks the Syfy channel shows on Saturday night.\"[73] Michael O’Sullivan of The Washington Post called the production design \"blandly generic\" and the special effects, props and costumes \"cheap and slapdash-looking\".[74] However, Austin Kennedy of Film Geek Central said the special effects are \"top-notch\",[75] John Depko and Susanne Perez of Daily Pilot said it is \"impressive\",[76] Nathan Duke of Patch Media said it is \"impressive enough\",[77] and Peter Feldman of The Citizen said it is \"solid\".[78]American astronaut Buzz Aldrin said the movie is \"quite action packed\" and a \"touching father/son story\"[79] but is not realistic because \"there was a lot of noise. In space, you don't get that much noise,\"[80] a quote that is highly cited in the news[81][82][83] and misconstrued as him nitpicking[84][85] or panning the film.[86][87] Aldrin was impressed by the set design stating that \"the scenes of the cities were really remarkable\" but differed significantly from his experience on the moon, which he described as \"'magnificent desolation' in contrast to the magnificent experience that humanity could move itself ahead to get to the moon.\"[80]In a February 2015 interview with Variety, Smith called the film \"the most painful failure\" of his career and expressed regret at leading his son into the production. He also unfavourably compared the experience to Wild Wild West, which also under-performed at the box office.[88]Ryan Nakashima of Associated Press was generally impressed with the film's 4K resolution picture quality, though the visual-effects shots that comprised about a third of the movie were done in 2K resolution to save on cost and time.[19] Nakashima commented \"I could see details I've never noticed before – the actors' tiny skin imperfections, or Smith's salt-and-pepper whiskers. In a distant shot of Smith's son Jaden running down a riverbed, I was struck by how many small rocks were defined clearly from such a distance. Yet other shots that included computer-generated cityscapes or otherworldly creatures looked less sharp.\" The cinematographer Peter Suschitzky was apologetic about that, saying \"The movie is only half in true 4K. I'm sad about that. It still looks good.\"[89]Scott Wilkinson of AVS was similarly impressed by the visual effects (though he did not enjoy the movie itself): \"Even sitting too far away, the movie itself looked gorgeous—sharp as a tack with beautiful colors. The smallest details, such as Jaden Smith's character in the far distance, somehow looked clearer than I would have expected under normal circumstances; I got the distinct impression that the image could have been blown up by quite a bit and no detail would have been lost. The CGI animals did look a bit artificial, but that didn't bother me very much at all.\"[90]","box_office":"$243.8 million[2]","cinematography":"Peter Suschitzky","production_company":"Overbrook Entertainment Blinding Edge Pictures Relativity Media","Marketing":"The estimated worldwide marketing budget for After Earth was approximately $100 million in addition to the $135 million to produce the film.[25] Initial marketing began online with an internet marketing campaign on Facebook and Google+, including a teaser trailer. Alongside the Facebook marketing is a Web 2.0 site that lets people \"scroll\" through different images and paragraphs in a complex dynamic way. An image of Jaden's character in costume was released online on February 15, 2012.[26] Later in the year, a theatrical teaser was released alongside a trailer for the competing Joseph Kosinski film Oblivion. On March 12, a modified version of After Earth's theatrical teaser was released as the official trailer.[27] The official trailer was broadcast as a TV Spot during late May 2013. The trailer featured the menu music of the video game Deus Ex: Human Revolution, composed by Michael McCann.[28]In a stark contrast to his previous films, Shyamalan's name was notably absent from trailers, TV commercials, and marketing signage.[29] Instead, Sony Pictures opted to feature Will and Jaden Smith prominently in the marketing campaign.[30] Sony's worldwide marketing and distribution chairman, Jeff Blake, said that \"Night is, without a doubt, a world-class filmmaker who we were thrilled to team up with on this project,\" but \"Together, we decided to focus our campaign on both the action and Will and Jaden given that 'After Earth' is an adventure story of a father and son.\" Alex Suskind of Moviefone pointed out to Shyamalan that After Earth was not being marketed on the strength of his name unlike his previous projects, to which he responded, \"There's such a specific expectation that comes with a name. It's nice to have people watch the movie and then have them talk about the storyteller; it's a healthy balance.\"[31]On April 24, XPRIZE, Sony and Overbrook launched the XPRIZE After Earth Challenge, a robotics competition to promote the May 31 release of After Earth.[32] Dr. Peter H. Diamandis, chairman and CEO of XPRIZE said \"After Earth is not only a spectacular science fiction adventure but it also underscores the importance of protecting our planet, something we value deeply at XPRIZE. We are pleased to partner with the visionary team at Overbrook to present a complimentarily themed educational competition focusing on the sustainability of the Earth.\" Eligible teams (2–5 students between the ages of 13 and 17 with 1 adult captain) were able to register for the two-stage competition by visiting www.XPRIZEAfterEarth.com until June 7, 2013. In the first stage, teams create a 2–3 minute video essay that answers targeted questions and describes their thinking on the importance of space exploration, and the relationship between sustainability and survival. Ten teams selected for phase 2 of the contest are then given a Lego Mindstorms robotic kit and a Sony Handycam HDR-PJ230 camcorder to design and build a playfield for their robot to complete a series mission tasks in one or more of four thematic areas: (1) Natural resources, (2) Renewable energy, (3) Agriculture, and (4) Shelter/Protection. The winning team will be announced on August 9, 2013 and featured on the U.S. Blu-ray Disc of After Earth, and all members of that team will receive a signed Blu-ray and other prizes.The film premiered on May 29 at Ziegfeld Theatre in New York City, with a wide variety of celebrities attending including Bruce Willis, 50 Cent, Spike Lee, and Justin Bieber.[33] Canadian comedian Russell Peters who made fun of Shyamalan when accepting the Razzie Award on his behalf for The Last Airbender[34] also attended and even posed with Shyamalan.[35][36]Sony Electronics hosted an exclusive 4K screening of After Earth at the Paramount Studios Theater on Friday May 31 during the 2013 Cine Gear Expo in Hollywood.[37] The event was held for registered Cine Gear Expo attendees and Sony guests from 6:30-9:30 pm[38] followed by a panel discussion with the filmmakers and production team. After guests filled the 500-plus-seat theater,[39] a second screening was held on Saturday June 1 to accommodate additional guests[40] from 7:30 pm to 9:30 pm.On June 6, the European Space Agency (ESA) partnered with Sony Pictures International to support the release of the film, stating that it shares common themes in the film of concern for Earth's future and educating the next generation.[41] ESA and Sony are holding the After Earth competition to win the opportunity to go to Bordeaux, France and have a 'space experience' in weightlessness on a 'parabolic' flight on Novespace's ZERO-G aircraft. The winner will receive paid travel expenses to and from Bordeaux and one night's accommodation for two people, and will only be eligible to participate in the reduced gravity aircraft on October 25 following a medical exam.[42]Several books were released as supplemental tie-ins for the film: After Earth: Innocence by Michael Jan Friedman and Robert Greenberger, illustrated by Benito Lobel. Innocence is a prequel comic book to After Earth released by Del Rey Books on November 14, 2012.After Earth: United Ranger Corps Survival Manual is an illustrated manual that describes the After Earth universe from the history of the United Ranger Corps written by Robert Greenberger. It was published through Insight Editions LLC and released on May 21, 2013. The book also follows humanity's exodus from Earth, and the ongoing battle against the Skrel. It contains the secrets of ghosting, the mastery of the cutlass, a schematic of the Ranger base, a complete guide to the highly evolved animals of Earth, and a handwritten journal entry from Cypher Raige.After Earth: Kitai's Journal written by Christine Peymani illustrated Jason A. Katzenstein is a paperback book with black-and-white illustrations for younger readers released by HarperCollins on May 21, 2013.After Earth: The official novel of the epic film After Earth by Peter David was released in paperback by publishing company Del Rey Books on May 28, 2013. The book features an expanded story of the film as well as supplemental stories.","directed_by":"M. Night Shyamalan","Controversies":"Some critics were struck by what they saw as parallels in the movie's plot, dialogue and imagery with the Scientology teachings of L. Ron Hubbard[61] particularly those in Dianetics: The Modern Science of Mental Health[62] and Dianetics: The Original Thesis.[91] Similarly, Peter Travers of Rolling Stone compared the film to the Scientology-themed flop Battlefield Earth, describing the film as \"an unholy mess of platitudes and posturing\" that wastes the talents and charm of Will Smith.[92] Pointing out Smith's alleged ties to Scientology, including his funding of New Village Leadership Academy, a school that uses Study Tech as its teaching method, Matt Patches of Vulture declared the movie probably the clearest evidence of Smith's investment in Scientology, and detailed how he saw the film paralleling its teachings.[93] The Hollywood Reporter published a guest-column review written by former Scientology member Marc Headley which pointed out similar parallels.[94] The Sun noted an observation made by a former Scientologist that the fictional Rangers Corps is similar to the church's Sea Org branch, which has its own cadet branch.[95]David S. Touretzky, a research professor at Carnegie Mellon and a well-known expert on and critic of Scientology dismissed these perceived parallels, saying \"I don't see any Scientology content at all in this movie\".[96] He told Rich Juzwiak of Gawker, \"The themes of the movie appear to be standard adventure fare: physical courage, coming of age, father/son relationships, battling danger to prove oneself and earn a father's respect. These are not Scientology themes. There is no mention of evil psychiatrists, mind control, engrams, etc.\" Touretzky also addressed multiple points made by the Scientology hypothesis including the film's marketing materials prominently featuring a volcano: \"The original version of Dianetics did not have any pictures on the cover. After Hubbard dreamed up OT III around 1967, someone got the idea of putting a volcano on the cover of Dianetics to 'restimulate the engrams' of us nonbelievers and influence us to buy the book. But most Scientologists don't know anything about OT III or why there is a volcano on the cover of some versions of Dianetics.\"A parody website cheerupwillsmith.com, which was created for the purpose of cheering up Will Smith with the perceived failure of After Earth, gained some attention in the media,.[97][98] Flyers were also posted in East Village, Manhattan requesting Scientology members to see After Earth a minimum of three times and then upload a positive video for Will Smith on that website.[99] The site has a video mockumentary of two Sea Org members, along their way to see After Earth, recorded video praises for Will Smith from strangers and cajoled them into signing a billion-year contract with the Church of Scientology. When they delivered the signatures to a local branch of the church near Times Square, a church representative told them they were impersonating the church and threatened to call the police if they do not leave.[100] The video and the site was created by Jason Selvig and Davram Stiefler of the comedy duo The Good Liars[101][102] who had previously pretended to be Time Warner Cable representatives asking people how they can make service worse for customers.[103]The Church of Scientology International branded the Scientology claims as \"silly nonsense\" and a myth launched by a handful of self-promoters.[104] The church's director of public affairs, Karin Pouw, stated to TheImproper magazine that \"The film and its story line contain themes common to many of the world's philosophies, not unique to Scientology.\" While Pouw did not dispute the similarities, she countered that overcoming fear has been a universal theme in stories for thousands of years as well central to countless film plots. She noted the same logic would seemingly make Star Wars: Episode I – The Phantom Menace a Scientology-themed movie, which includes the dialogue, \"Fear is the path to the Dark Side. Fear leads to anger, anger leads to hate, hate leads to suffering.\"[105] Later, domain registrar and web-hosting company Go Daddy took down cheerupwillsmith.com citing \"Copyright Infringement, Trademark Infringement, and False Identity.\" Joe Kloc of The Daily Dot presumes the complaints came from the Church of Scientology.[101]There was heavy criticism of Jaden Smith's role in the film. Christopher Orr of The Atlantic stated, \"He is entirely lacking in the big-screen charisma that made his father one of Hollywood's major stars.\"[106] Gary Wolcott of Tri-City Herald commented that \"the 15-year old Jaden doesn't appear to demonstrate much talent and has zero charisma.\"[107] As the film also stars Zoë Kravitz, Alex Pappademas of Grantland called After Earth a \"parade-float tribute to nepotism.\"[108] Mikhail Lecaros of GMA calls the movie \"devoid of common sense and purpose (save for nepotism).\"[109]In response to the nepotism allegations, Gary Susman of Time magazine argued, \"In Hollywood, such nepotism is no sin; in fact, it's often a selling point.\"[110] David S. Cohen of Variety pointed out that \"putting family members into projects is hardly new, yet it rarely inspires such vituperation.[111] Abena Agyeman-Fisher of NewsOne.com suggested that the allegations were thinly-veiled racism and an example of a double standard being applied to black people.[112] However Charlie Lyne of The Guardian writes that nepotism has traditionally carried a stigma.[113]","release_dates":"May 1, 2013 (2013-05-01) (Tokyo premiere)|May 31, 2013 (2013-05-31) (United States)||||","Production":"Will Smith conceived this story when he was watching the television show called I Shouldn't Be Alive with his brother-in-law Caleeb Pinkett.[4] It was originally not a science fiction story but about a father and son crashing their car in the mountains or some remote region, with the son having to go out and get rescue for his father. Smith then decided to change the setting to 1000 years in the future, which imposed a higher budget. The film was also intended to be the first in a trilogy.[5] Smith had his production company Overbrook contact Gary Whitta (who was then known for his script for The Book of Eli) with a simple log line for a film: a father and son crash landed on Earth 1000 years after it had been abandoned by humankind. Impressed with his idea and excited about the opportunity to work with him, Whitta fleshed out Smith's idea and pitched it to him, subsequently becoming the first employee on the project.A month after the release of The Last Airbender, Smith contacted M. Night Shyamalan on August 6 to wish him \"Happy Birthday\" and to persuade him to direct his film with his son Jaden as the star.[6] Smith and Shyamalan had planned to work on a film before but it never worked out. Impressed with the entire script, Shyamalan officially made this project—then entitled One Thousand A. E.—his next directorial effort on October 20, and quietly shelved his own secret untitled project with Bruce Willis, Bradley Cooper, and Gwyneth Paltrow loosely attached.[7] There was another starring role for an adult male, but sources indicated that Smith would not be taking it on. Sony Pictures Entertainment has a first-look deal with Overbrook, so it was expected to be the studio home for A. E.[7] Shyamalan later suggested the film would feature other members of the Smith family, and that it would not be in 3D but he had \"an idea for something kind of technically interesting\".[8]In December 2011, Columbia Pictures, a subsidiary of Sony, signed Will and Jaden Smith to star in the film with Shyamalan directing. Shyamalan, who co-wrote the screenplay with Gary Whitta, produced the film with Overbrook's James Lassiter, Smith, Ken Stovitz, and Jada Pinkett Smith. Doug Belgrad, president of Columbia Pictures, made the announcement and said, \"Night is an outstanding filmmaker who has a tremendous vision for this science-fiction adventure story and we couldn't be more excited to be working again with Jaden after our experiences on The Pursuit of Happyness and The Karate Kid,\" and added \"We're thrilled to have the two of them together on this project.\" Shyamalan also added, \"The chance to make a scary, science-fiction film starring Jaden and Will is my dream project.\"[9] Will Smith's decision to take on the starring adult male role required him to step aside in producing and starring in the Hurricane Katrina drama The American Can, and offered the lead role to Denzel Washington instead. The shooting of the movie was also pushed back from September 2011 to January 2012.[10]On July 25, 2011, Smith traveled to Costa Rica accompanied by an entourage of about 20 people, including Shyamalan, to scout for locations to shoot the film.[11] They visited sites like the Arenal Volcano, hot springs and a lake, and some beaches.[12]In September, Columbia committed to a June 7, 2013 release date.[13] Shyamalan also scouted locations in Philadelphia. 50% of the filming was to take place at the new Sun Center Studios in Delaware County (Chester Township). Other locations would be in Costa Rica, Utah and Northern California.[14] Shyamalan also visited Valley Forge Military Academy, the filming location of Taps, for research of the film, then entitled After Earth, as Jaden Smith would be playing a military cadet of the future.[15]The screenplay by Whitta and Shyamalan was later polished by Stephen Gaghan[16] and Mark Boal.[17] Jonathan Young, a psychologist and screenwriter, polished the mythic journey structure.[18] Principal photography for After Earth began in February 2012. Much of the filming took place in Costa Rica, Humboldt County, and Aston.After Earth became the first film from Sony to be both shot and presented in the emerging 4K digital format.[19] It was primarily shot with Sony's CineAlta F65 camera, which was shipped in January 2012.[20] However, a skydiving sequence required a smaller sized Canon Cinema EOS C500 4K camera mounted on the helmet of a professional skydriver.[21] The cinematographer Peter Suschitzky who picked Sony F65 digital camera for the movie over other digital and film cameras, argued that benefits of film are lost when shown in theaters with digital projectors, as many are today.[19]On April 19, 2013, Shyamalan announced that the release date had been moved a week earlier to May 31, 2013[22] in North America and Korea, which put it against Now You See Me and The Purge, scheduled to open in the United States in the same week. A few days later, the U.S. release of The Purge was rescheduled for June 7, 2013,[23] taking over the slot vacated by After Earth.On May 3, it was revealed that Korean-American singer Jay Park would be participating on the official soundtrack of the film in Korea, with a song titled \"I Like 2 Party\". On May 5, a 30-second snippet of the song was released with a trailer.[24]","Box office":"During its opening weekend, After Earth took in $27.5 million in box office receipts in North America and $2.5M in South Korea.[43] Sony Pictures projected a launch of around $38 million, but the actual number was 17% lower than the lowest pre-release expectation of $33 million.[25][44] It finished in third place behind Fast & Furious 6, an action film, and Now You See Me, a caper film.[45] Taking into account the popularity of principal actor Will Smith, the disappointing finish led The Wall Street Journal to call it a \"flop\".[46] Ray Subers of Box Office Mojo noted the $27 million weekend placed it between two sci-fi flops of 2012 films with 200 million-plus budgets, Battleship ($25.5 million) and John Carter ($30.2 million), and also drew half of the co-stars' previous openings, Will Smith's Men in Black 3 ($54.6 million) and Jaden Smith's The Karate Kid ($55.7 million).[47] Scott Mendelson from Forbes argued that Sony made a mistake of hiding M. Night Shyamalan as they promoted the film because for better or worse, the general public knows who he is and \"His name on the marquee reflects that you’re not going to get a conventional genre film, that there may be something else up its sleeve.\"[48]Sony Pictures spokesman Steve Elzer said a weekend take of about $30 million in the United States and Canada would be a solid number for a movie that is not a branded sequel.[49] Sony distribution chief Rory Bruer said \"Certainly we would have liked to have done more, but this was always going to be a worldwide play.\"[50] The Hollywood Reporter reported Sony insiders estimate a potential loss at about $20 million if the film does not gross high overseas, though estimates of top executives at several rival studios are much higher.[51] On Jimmy Kimmel Live!, Will Smith admitted he was also disappointed with the box office performance and joked \"Here's how I think about it, Jimmy, let's be honest. Three is the new one. You know how many ones it takes to make a three?\" and \"It's been almost, like, two decades since I had a movie that wasn’t number one! ... That's over now, buddy! Thanks!\"[52][53]On the worldwide release the following week, After Earth took in an estimated $45.5 million in 60 overseas markets, narrowly beating Fast & Furious 6 estimates of $45.3 million for the No. 1 spot at the international box office.[54][55] Including the film's launch in South Korea, After Earth made an estimated total of $48.6 million at the international box office, bringing its worldwide gross to an estimated $95,192,000. Sources for Sony Pictures International Releasing said the overall launch was bigger than debuts in the same territories of Oblivion ($45.1 million), The Last Airbender ($42.7 million) and Jaden Smith vehicle The Karate Kid ($32.3 million).[55] Sony distribution chief Rory Bruer said that Sony was happy with the overseas opening and expects much of the film's ticket sales to come from international markets and \"It definitely was the exciting start we were looking for internationally.\"[56]","produced_by":"Caleeb Pinkett|Jada Pinkett Smith|Will Smith|James Lassiter|M. Night Shyamalan|","starring":"Jaden Smith|Will Smith|Zoë Isabella Kravitz|Sophie Okonedo|","running_time":"100 minutes[1]","music_by":"James Newton Howard","edited_by":"Steven Rosenblum","budget":"$130 million"}