{"based_on":"Cold Mountain  by Charles Frazier","country":"United States United Kingdom Romania Italy","distributed_by":"Miramax Films","screenplay_by":"Anthony Minghella","Plot":"When North Carolina secedes from the Union on May 20, 1861, the young men of a rural, provincial, North Carolina backwater known only as Cold Mountain hurry to enlist in the Confederate military. Among them is W.P. Inman (Jude Law), a carpenter who has fallen in love with Ada (Nicole Kidman), a minister´s daughter, and finds their whirlwind courtship interrupted by the American Civil War.Three years later, Inman finds himself in the trenches of Petersburg, Virginia, during the Battle of the Crater. Union soldiers tunneling beneath Confederate fortifications detonate over 300 kegs of gunpowder, in a futile attempt to undermine the position prior to their assault. As the ill-fated attack begins, Oakley (Lucas Black) an old acquaintance of Inman's from Cold Mountain, is impaled on a bayonet and mortally wounded. Inman rescues him from the fighting and takes him to a field hospital. Later that day Oakley dies in the hospital, with Inman and Stobrod Thewes (Brendan Gleeson) beside him.The next night, Inman, along with his Cherokee friend Swimmer (Jay Tavare), are sent to flush out surviving Union troops trapped behind their lines. During the raid, a burst of friendly fire kills Swimmer and seriously injures Inman. As Inman lies in the hospital near death, he has a letter from Ada read to him in which she pleads with him to stop fighting, stop marching, and come back to her. Inman recovers, and—with the war drawing ever closer to an inevitable Confederate defeat—decides to go home to Cold Mountain.On his journey he meets the corrupt preacher Reverend Veasey (Philip Seymour Hoffman), who is about to drown his pregnant slave lover. Inman stops Veasey, and leaves him tied up to face the town's justice. Exiled from his parish, Veasey later rejoins Inman on his journey.They help a young man named Junior (Giovanni Ribisi) butcher his cow, and join him and his family for dinner. Junior leaves the house after the feast, the women in Junior's family seduce Veasey, and Junior's wife, Lila, tries to seduce Inman. Junior returns home with the Confederate Home Guard, and both Inman and Veasey are arrested and led away with other deserters. During a subsequent skirmish with Union cavalry, Veasey is killed and Inman left for dead. An elderly hermit living in the woods (Eileen Atkins) finds him and nurses him back to health.Inman later meets a grieving young widow named Sara (Natalie Portman), who is raising her infant child Ethan alone; he stays the night at her cabin. The next morning, a party of Union foragers arrive demanding food. Sara orders Inman away for his protection, but he hides only a few feet away from the house. The leader, Nym (Richard Brake), and his lieutenant harass Sara, steal her livestock, and leave Ethan in the cold, though the third soldier (Cillian Murphy) attempts to keep the baby warm. Nym tries to rape Sara but both he and the lieutenant are killed by Inman. Inman forces the kind forager to surrender and lets him go, but as the latter flees, an enraged Sara fatally shoots him.In parallel with Inman's adventures, the film follows Ada's wartime experiences. Ada is a city gentlewoman who only recently moved to the rural farm named Black Cove. She met Inman on her first day at Cold Mountain and had a brief, chaste romance with him the night before he left for the army. Shortly after Inman leaves, Ada's father (Donald Sutherland) dies, leaving her alone on the farm with no money, food, or livelihood, and with little prospect for help, as the young, able-bodied men are off at war.Ada is completely inept at working the farm, having been raised as a southern lady. She manages to survive thanks to the kindness of her neighbors, one of whom eventually sends Ruby Thewes (Renée Zellweger) to her. Ruby is a young woman who has lived a hard-scrabble life and is very adept at the tasks needed to run the farm. Ruby lives at the farm with Ada, and together they take the farm from a state of disaster to working order. Meanwhile, Ada writes constant letters to Inman in hopes of meeting him again and renewing their romance.The two women form a close friendship and become each other's confidantes. They also are friends with the Swangers (James Gammon and Kathy Baker), who live down the road from Ada's farm Black Cove. It is at the Swangers' well that Ada \"sees\" a vision of Inman coming back to her in the snow, surrounded by crows.During the war, Ada and Ruby, and other members of their community, have several tense encounters with men of the Home Guard. This branch of the Home Guard is led by Captain Teague (Ray Winstone), whose grandfather once owned much of Cold Mountain. He and his deputies hunt deserters, partially with the goal of Teague's seizing their land. Teague also lusts after Ada.Although the purpose of the Home Guard was to protect the South and its citizen population from the North, they have become violent vigilantes who hunt and often kill deserters from the Confederate Army, and terrorize citizens who they believe are housing or helping the deserters. This includes the Swangers' sons, who, by torturing their mother, they coax out of hiding and kill. Esco Swanger—the family patriarch—is also killed protecting his sons.Ruby's estranged father Stobrod, a Confederate deserter and a violin player, arrives, reconciles with her, and convinces her to make a coat for his intellectually challenged banjo player Pangle (Ethan Suplee). Ruby finds herself drawn to mandolin player Georgia (Jack White).While camping, Stobrod, Pangle, and Georgia are cornered by the Home Guardsmen led by Teague. Pangle unintentionally reveals the band as the deserters Teague is seeking. Georgia is hidden a few feet away and witnesses the shooting of Pangle and Stobrod. He escapes to Black Cove Farm and informs Ruby and Ada, who rush to the campsite to find Pangle dead and Stobrod badly injured. Ada helps Ruby remove a bullet from Strobrod's back, and they decide to take shelter in some cabins in the woods to avoid Teague and his men.At this point the two story lines come together. Inman, half-dead from starvation, finally reaches Cold Mountain and is almost killed by Ada before she recognizes him. They later consummate their love and spend the night together.The Home Guardsmen, however, soon find them, having captured and tortured Georgia to learn that the women are harboring deserters. In the ensuing gunfight Inman ambushes and kills Teague and most of his band, but Teague's violent young lieutenant Bosie (Charlie Hunnam), escapes up the mountain. Cornering him near the top, Inman urges him to surrender peacefully, but Bosie draws, forcing him to fire; both men are mortally wounded. Ada goes after Inman, and finds him just as she saw him in her vision at the well... coming back to her in the snow surrounded by crows. He dies in her arms.The film ends several years later with Ada, Ruby and their families celebrating Easter. Ruby has married Georgia, and the two have a young daughter and an infant child. It is also revealed that Ada's night with Inman has produced a child, Grace Inman.","cold_mountain":"Theatrical release poster","language":"English","Reception":"Cold Mountain was met with overall positive reviews from critics, with Zellweger's performance receiving wide acclaim. On Rotten Tomatoes the film has a grade of 71% \"Fresh\" from critics, 87% among top critics, with the consensus \"The well-crafted Cold Mountain has an epic sweep and captures the horror and brutal hardship of war\".[4] On Metacritic, the film received a grade of 73 out of 100 points possible based on 41 generally favorable reviews.[5]Roger Ebert gave the film three stars out of four, noting that \"It evokes a backwater of the Civil War with rare beauty, and lights up with an assortment of colorful supporting characters.\"[6] Richard Corliss, film critic for Time Magazine, went even further, giving the film 100 points out of 100 possible; he called it \"A grand and poignant movie epic about what is lost in war and what's worth saving in life. It is also a rare blend of purity and maturity—the year's most rapturous love story.\" In his movie guide, Leonard Maltin gave the film 3 1/2 stars out of 4, writing \"Minghella's adaptation of the Charles Frazier best-seller captures both the grimness of battle and the starkness of life on the home front in the South,\" and concluded the film was \"Meticulously crafted\" with \"First-rate performances all around.\"[7]","box_office":"$173 million[1]","Historical accuracy":"The most obvious inaccuracy occurs early in the film with the giant explosion that kicked off the Battle of the Crater, during the Siege of Petersburg, Virginia. The scene was filmed in broad daylight, although the actual explosion occurred in pre-dawn darkness at 4:44 a.m.Several scholars reviewed the movie for its representation of historical studies on North Carolina during the Civil War, especially the state's mountainous western region. Their justification is the effect popular media has on national and worldwide perceptions of Appalachian people, particularly southern Appalachians in this case. The opinions vary, but the consensus among them is the historical context of the movie is close to the scholarship. Although these scholars disagree about the accuracy of particular elements of the movie, they agree that the story gets at least some things right.[8]These scholars admit that the film misrepresents some aspects of the region during the time. “Neither slavery nor slaves play much part in the film, with only fleeting references to both,” says John Inscoe. However, Margaret Redwood pointed out that the film takes place in a mountain region, not suitable for plantations, and therefore inhabited mainly by white farmers, and that \"Though the issue of slavery loomed large in the war as a whole, it was not necessarily crucial for these specific people\". John Crutchfield notes that “we see a thoroughly contemporary understanding at work … that views slavery in decidedly moral terms.” Another negative criticism is that it is nowhere close to a faithful representation of the geography of North Carolina, especially the town in Cold Mountain, which plays a major role in the story. Silas House claims that, “For a story that relies so much on sense of place, it was obvious throughout that the majority of the film had been shot in Europe.” A native of the area, Anna Creadick, says, “… the film’s geography was annoyingly off-kilter. True, the Carpathians are somebody’s mountains, but they’re not mine.” Lastly, Martin Crawford claims, “the novel’s underlying sentimentality limits its value as historical fiction and thereby undercuts its representational authority.” For Crawford, the story is far too romantic and emotional for the historical context.[citation needed]On the other hand, they praise the film for its conformity to the historical scholarship in other subjects. Inscoe asserts his astonishment that “the final product should … provide so unflinching a portrayal of the bleak and unsettling realities of a far less familiar version of the Civil War, but one that would be all too recognizable to thousands of hardscrabble southern men and women who lived through it.” Focusing on the impact of the war on women, he adds, “Even more powerful – and more historically based – are other incidents that convey the brutal toll taken on mountain women, who as mothers, wives, and widows are forced to protect their families, sometimes by violently retaliating against their tormentors.” Silas House says, “for the most part I thought director Anthony Minghella did an honorable job of portraying our region.” He agrees with Inscoe on the subject of the area’s population, stating, “most of all the characters are dignified, determined, and intelligent human beings, like the vast majority of Appalachians, and I am glad that this movie exists.” For House, the film goes beyond the people of western North Carolina to include all Appalachian communities.[citation needed]As for the music, House states that “most of the songs in the film were written specifically for the movie,” but traditional forms of singing in the region make up for it. Jack Wright, not to be confused with \"Jack White\" (John Anthony Gillis), who plays a musician in the film, expresses that the film honestly represents the music of the region, even with a couple of non-regional additions, like “Sitting on Top of the World” and “Great High Mountain.” In contrast to House’s remark, Wright says, “some of the best of the soundtrack was not composed for the movie but garnered from the body of time-tested and proven masterpieces of an earlier rural American culture.” Such selections were not necessarily performed authentically in the film: the two Sacred Harp songs, although generally authentic to the period and region, contained vocal parts not yet written at that time.[9]","cinematography":"John Seale","production_company":"Mirage Enterprises Bona Fide Productions","directed_by":"Anthony Minghella","Awards":"The film was nominated for more than seventy awards, including seven Academy Award nominations. Renée Zellweger won the Academy Award for Best Actress in a Supporting Role for her performance in the film.In addition, the film was nominated for the following Academy Awards:","Soundtrack":"Cold Mountain: Music from the Motion Picture shares producer T Bone Burnett with the soundtrack for O Brother, Where Art Thou?, a largely old-time and folk album with limited radio play that still enjoyed commercial success, and garnered a Grammy. As a result, comparisons were drawn between the two albums. The soundtrack, however, also employs many folk and blues elements.It features songs written by Jack White of The White Stripes (who also appeared in the film in the role of Georgia), Elvis Costello and Sting. Costello and Sting's contributions, \"The Scarlet Tide\" and \"You Will Be My Ain True Love\", were both nominated for the Academy Award for Best Original Song and featured vocals by bluegrass singer Alison Krauss. Gabriel Yared's Oscar-nominated score is represented by four tracks amounting to approximately fifteen minutes of music.","release_dates":"December 25, 2003 (2003-12-25)|||||","Production":"Cold Mountain, where the film is set, is a real mountain located within the Pisgah National Forest, Haywood County, North Carolina. However, it was filmed mostly in Romania, with numerous scenes filmed in Virginia, South Carolina, and North Carolina. The film was one of an increasing number of Hollywood productions made in eastern Europe. This is occurring as a result of much lower costs in the region; and in this specific instance, Transylvania was less marked by modern life than the Appalachians (fewer power lines, electric poles, paved roads and so on). Musician Ryan Adams was approached for the role of Georgia but declined.The film also marked a technological and industry turnaround in editing. Walter Murch edited Cold Mountain on Apple's sub-$1000 Final Cut Pro software using off-the-shelf G4s. This was a leap for such a big budgeted film, where expensive Avid systems are usually the standard editing system. His efforts on the film were documented in the 2005 book Behind the Seen: How Walter Murch Edited Cold Mountain Using Apple's Final Cut Pro and What This Means for Cinema.[3]","produced_by":"Sydney Pollack William Horberg Albert Berger Ron Yerxa","starring":"Jude Law Nicole Kidman Renée Zellweger","running_time":"154 minutes","music_by":"Gabriel Yared","edited_by":"Walter Murch","budget":"$79 million"}