{"country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Jimmy Santiago Baca Jeremy Iacone Floyd Mutrux","story_by":"Ross Thomas","Plot":"Miklo is a man of Mexican and Caucasian ethnicity who grew up in El Pico Aliso barrio in east Los Angeles. Upon moving back home from Las Vegas, Nevada, Miklo goes to stay with his two cousins Paco and Cruz. Miklo tells Cruz that he wants to join their gang Vatos Locos. While Paco is initially skeptical, Miklo later proves himself when he performs an attack on a rival gang, Tres Puntos. Afterwards he is made a member of Vatos Locos.However, the Tres Puntos gang soon takes revenge by brutally attacking Cruz who is a budding artist, and damages his back for life. When Vatos Locos learn of the attack, they perform a well-planned counterattack. However, things go wrong when Miklo ends up getting shot by their rival gang's leader, \"Spider\". Miklo is able to shoot and kill Spider, but has to be rushed to the hospital by Paco while being chased by police. Paco crashes into another car at the El Pino tree and they are both arrested.From here, the trio's paths diverges: Miklo is sent to San Quentin State Prison for murder, Paco volunteers for military service in the United States Marine Corps as an alternative choice to prison, and Cruz continues his passion for art. He also becomes a heroin addict due to the recurring back pain. His addiction leads to him being disowned by his family after his 12-year-old brother, Juanito, dies of an accidental overdose on Cruz's heroin supply. Paco becomes an L.A.P.D. narcotics detective after leaving the Marine Corps.Miklo finds trouble adapting to prison life. The prison is run by three prison gangs, all of whom are based on their racial backgrounds. The Black Guerrilla Army (B.G.A.) is led by \"Bonafide\", the Aryan Vanguard is led by \"Red Ryder\", and La Onda is led by Montana Segura. La Onda's members do not initially accept Miklo and one of them, Popeye, tries to rape Miklo at knife-point, but is stopped by Montana. After meeting Montana, he is told the only way into La Onda is killing an enemy inmate, in Miklo's case a white inmate named Big Al who runs the gambling in San Quentin. After gaining Big Al's trust, Miklo stabs him to death during a sexual encounter in the prison kitchen. Miklo is initiated into La Onda, is later promoted to its Ruling Council, and is granted parole after serving nine years in prison.On the outside, Miklo is disgusted by his menial job on which his supervisor is extorting money from him, so he joins in an armed robbery. The heist goes poorly and Miklo is intercepted by Paco, now a decorated cop. Miklo tries to run away, but Paco shoots him in the leg, which later has to be amputated. Miklo is sent back to prison where he notices the cocaine addictions of several inmates. Onda Council Member Carlos has entered the cocaine trade and is competing with the B.G.A. for customers. The Aryan Vanguard want to partner with Carlos in the cocaine business by becoming his new supplier. In return, Carlos move on the B.G.A. and take them out of the cocaine business. Montana, however, is fiercely against allowing La Onda to enter the drug trade, saying that drugs will destroy La Onda and that the Aryan Vanguard want to start a war between the Black and Chicano inmates. The other Council members agree with Montana and vote against it. This causes Carlos to leave La Onda to work with the Aryan Vanguard, causing other members to follow him. Carlos murders a B.G.A. soldier named \"Pockets\" who is running the B.G.A.'s cocaine operation. He also contacts his brother, Smokey, outside of prison to bomb a B.G.A. hangout where they move their drugs. After all of this happens, Carlos' usefulness has come to an end and the Aryan Vanguard drops their protection of him. The B.G.A. then takes the opportunity to murder Carlos. Despite his death, Miklo agrees with Carlos's outlook after being convinced by Carlos's old drug supplier.With hostility high between the Black and Hispanic inmates, Montana and Bonafide meet in the prison yard. Montana convinces Bonafide to agree to a truce if Montana reaches out to La Onda leaders in the Folsom and Chino prisons to end the violence. The warden grants Montana special permission to visit the Chino and Folsom prisons and Miklo is left in charge during his absence. Montana is granted a special request, and he gets to stay overnight at Delano penitentiary where he can see his daughter. On the morning of the visit, Montana is stabbed to death outside his cell by a member of the B.G.A.. Believing that the Aryan Vanguard sent forged orders to the hitman, Paco arranges a peace conference between La Onda and the B.G.A. However, Miklo, La Onda's new leader, manipulates the peace talks in order to build an alliance with the B.G.A. and they agree to kill the Aryan Vanguard leaders.Later, enforcers for La Onda and the B.G.A. sweep through the walls of San Quentin, killing the leaders of the Aryan Vanguard. After the killings are done, however, Miklo's men promptly exterminate the B.G.A. leaders as well. Paco is enraged that his own cousin has played him for a fool and angrily confronts Miklo in the prison visiting room. Paco leaves his cousin in disgust, disowning him forever.The members of La Onda hold a final gathering after the warden vows to split the council up transporting some members to their home states. Miklo plans on using this to expand La Onda to other states in the South West. Later, Miklo and his cellmate \"Magic\" destroy the mold which they used to send the forged orders to the B.G.A. hit man to kill Montana. Magic says \"We both loved him, but we did what we had to do for La Onda.\" Back in East Los Angeles, Paco visits one of Cruz's murals after the family re-accepts him to see a portrait of his former life. In a pep talk with Cruz, Paco realizes that by ordering Miklo to go after Spider, Paco is responsible for all of the things that have happened to Miklo. This causes Paco to feel guilty for his actions and ultimately forgive Miklo.","language":"English Spanish Arabic","Reception":"The film received mixed reviews from critics. It holds a 55% rating on Rotten Tomatoes, based on 11 reviews.[2] On IMDb it is holding a 8.0/10. According to TV Guide the review they made stated \"similarity to Edward James Olmos' American Me, in which a tormented drug dealer travels the same route through prison society as Miklo. The principal difference between the two films is that Bound By Honor is by far the glossier effort, relentlessly picturesque in the seamlessly anesthetized manner of mainstream Hollywood films.\"[3] Calling Taylor Hackford's Bound By Honor a less appealing and realistic version of American Me. Film critic Jonathan Rosenbaum for the Chicago Reader strongly reported this film is an \"ugly three-hour snoozefest is apparently supposed to do for East Los Angeles Chicanos what the Godfather movies did for New York mafiosi…\"[4] Also agreeing with TV guide review, Roger Ebert has also mention \"The East Los Angeles milieu and some of the characters seem familiar, because some of the same ground was covered by American Me... Bound by Honor covers similar material in a less passionate and finally less meaningful way.\"[5] Roger Ebert giving the film 2 stars out of 4. A critic from Entertainment Weekly, Owen Gleiberman gave Bound By Honor a B-, falling on the high end of the movie spectrum. Giving it that balance that movie critics have towards this film. He states \"Bound By Honor comes fully alive when it moves behind bars. There's an exploitative thrill built into the genre…\"[6] This film critic was definitely more interested in the second half of the movie once Miklo was in jail running La Onda. Owen states his likes and dislikes about the film giving it a fair review. Vincent Canby from New York Times had his own fairness in his review. Stating \"The film is big and long, passionate and flat. It's full of heroic and tragic incident, but skimpy about the details of quotidian lives.\" [7] Giving a very detailed review on the plot of the story he later exalts some of the characters in the movie one in particular, Enrique Castillo. Although Vincent Canby does not give an official rating for the film he says \"Though it's not the epic it means to be, it is not a failure.\"[8]","box_office":"$4,496,583","cinematography":"Gabriel Beristain","production_company":"Hollywood Pictures","directed_by":"Taylor Hackford","bound_by_honor":"Theatrical release poster","release_dates":"April 16, 1993 (1993-04-16)|||||","Production":"The three prison gangs in the film are fictional creations of screenwriter Jimmy Santiago Baca and director Taylor Hackford. However, they were all loosely based on actual prison gangs, with the Aryan Vanguard, Black Guerrilla Army and La Onda representing the Aryan Brotherhood, Black Guerrilla Family, and the Mexican Mafia, respectively.Actor Theodore Wilson died shortly after filming his scenes in the film.Artist Adan Hernandez was hired to create the paintings the character of Cruz Candelaria was supposed to have painted. All of the paintings that were used in the film were created by him. The mural in the reservoir seen in the film's climax has unfortunately been painted over. Hernandez made a cameo appearance in the film as the drug dealer Gilbert in the art gallery scene.The film was shot in and around Los Angeles and East Los Angeles and inside the walls of San Quentin State Prison. The main character Miklo is sent to San Quentin, where much of the film's plot takes place. Several of the then-inmates appear in the film as extras. In addition, several of the prison staff members also appear as others and some facilitated the production of the film by serving as technical advisors. Many members of the staff were given small lines in the film, with the warden giving an extended cameo in a part that is somewhat integral to the plot. In addition, actor Danny Trejo, who appears in the film as Geronimo, had served time in San Quentin before deciding to become an actor.The film was initially entitled Blood in Blood Out but was retitled Bound by Honor before the film's release. Blood in blood out refers to the initiation ritual of having to kill someone to enter a gang and, on the reverse end, not being able to leave the gang unless killed. This is a common initiation in many gangs, including prison gangs, and is also the motto of La Onda in the film. Hollywood Pictures insisted on the name change as the studio felt that it would incite violence in East Los Angeles. In addition, executives at Hollywood Pictures, a subsidiary of Disney, were cautious about the potential effect the film would have following the 1992 LA Riots and the attribution given to Boyz N the Hood as a partial cause/inspiration of the riots. Director Taylor Hackford has stated that he was very unhappy with this decision as the film's message was the exact opposite of the one that the studio feared would be transmitted.There were two soundtracks produced for the film. The first was released by Hollywood Pictures and used in the film after its re-titling to Bound by Honor. The second soundtrack was composed by Bill Conti and released by Varèse Sarabande Records. Conti's soundtrack had been commissioned for the film but was cancelled after the Blood In Blood Out title was dropped. Conti's soundtrack is still believed to be in existence, but has never been released.In addition to prison inmates and staff and artist Hernandez, screenwriter and barrio poet Jimmy Santiago Baca cameos as a prison inmate and member of the La Onda council.","produced_by":"Taylor Hackford Jerry Gershwin","starring":"Damian Chapa Jesse Borrego Benjamin Bratt Enrique Castillo Delroy Lindo Tom Towles Carlos Carrasco","running_time":"180 minutes[1] 190 minutes (Director's cut)","music_by":"Bill Conti","edited_by":"Fredric Steinkamp Karl F. Steinkamp","budget":"$35 million"}