{"country":"United States","distributed_by":"Universal Studios","screenplay_by":"Floyd Mutrux Desmond Nakano","story_by":"Floyd Mutrux","Plot":"The film depicts 30 years of Chicano gang life in Los Angeles. It focuses on Montoya Santana, a teen who, with his friends, J.D. (Steve Wilcox) and Mundo (Richard Coca), form their own gang. They soon find themselves at the wrong place at the wrong time and are arrested.In juvenile hall, Santana murders a fellow inmate (Eric Close) who had raped him and as a result, has his sentence extended into Folsom State Prison after he turns 18. Once there, Santana (now played by Edward James Olmos) becomes the leader of a powerful gang, La Eme. Upon his release he tries to relate his life experiences to the society that has changed so much since he left. La Eme has become a feared criminal organization beyond Folsom, selling drugs and committing murder.Santana starts to see the error of his ways but before he can take action, is sent back to prison for drug possession. There, he tells his former lieutenant, J.D. (William Forsythe) that he is no longer interested in leading the La Eme. However, following a precedent set by Santana himself earlier in the film, his men murder him to show the other prison gangs that, despite having no leader, they are not weak.","language":"English","Reception":"Roger Ebert of the Chicago Sun-Times liked the reality that came through in the film and that it rang true: \"What I felt watching American Me, however, is that it is based on a true situation - on the reality that street gangs and prison, mixed with the drug sales that finance the process, work together to create a professional criminal class.\"[2]Janet Maslin writes in The New York Times, \"But Mr. Olmos's direction...is dark, slow and solemn, so much so that it diverts energy from the film's fundamental frankness. Violent as it is, American Me is seldom dramatic enough to bring its material to life.\"[3]Marjorie Baumgarten, a film critic for The Austin Chronicle, wrote, \"American Me is crafted with heart and conviction and intelligence. It demands no less of its audience. It insists that there are no quick fixes, but that solutions are of the utmost urgency.\"[4]The film was screened in the Un Certain Regard section at the 1992 Cannes Film Festival.[5]The review aggregator Rotten Tomatoes currently lists American Me with a 75% positive approval rating, with 6 out of 8 reviews by professional movie critics listed as positive.[6]The film opened in wide release in the United States on March 13, 1992 (830 screens). The opening weekend's gross was $3,378,100 and the total receipts for the first three weeks were $9,108,435. The film was in wide release for three weeks (seventeen days). In its widest release the film was featured in 830 theaters across the country. The final box office gross amounted to $13,086,430.[7]The real Mexican Mafia continues to revere Cadena and was enraged by the film, as the Cadena character is portrayed as having been raped as a juvenile ward of the court at the beginning of his foray into the criminal justice system and ultimately stabbed to death by his own followers at the end of his criminal career. Eme godfather Joe \"Pegleg\" Morgan allegedly attempted to extort money from Olmos, the director and lead actor of the film. An Eme member-turned-informant raised the possibility of putting out a contract on him. Court documents show that Olmos was a victim in one extortion count contained in a 33-count federal indictment. According to reportage by CBS News weekly 60 Minutes, three consultants on this film were later murdered because of the depiction of a homosexual rape scene which offended the Mexican Mafia's internal code of \"ethics.\"[8] The first killing occurred 12 days after the movie's premiere when one of the film's consultants Charles \"Charlie Brown\" Manriquez, who was a member of La Eme, was slain in Ramona Gardens, L.A.'s oldest public housing project.[9] Another well-known person from East Los Angeles and paid consultant to the film, 49-year-old grandmother Ana Lizarraga commonly known as \"The Gang Lady\", was murdered when she was gunned down in her driveway unloading groceries.[9] A federal indictment accused La Eme of ordering the 1992 murder of Ana Lizarraga.[10]","american_me":"Theatrical release poster","box_office":"$13,086,430","cinematography":"Reynaldo Villalobos","production_company":"Olmos Productions YOY Productions","directed_by":"Edward James Olmos","Soundtrack":"Since the film deals with a Latino subculture, the music included in the soundtrack was Latino oriented; late 1970s urban sounds and oldies from the 1950s.The original soundtrack was released on April 28, 1992 by Virgin Records.The CD contains ten tracks and includes songs performed by various artists including: Los Lobos, Santana, Ike & Tina Turner, Bobby Day, Kid Frost, War, and other performers.","release_dates":"March 13, 1992 (1992-03-13)|||||","Production":"The film opens depicting events from the Zoot Suit Riots, where thousands of white American sailors and servicemen based in California attacked Latinos and others who took part in so-called \"pachuco\" culture, mostly targeting those who wore \"zoot suits\" (seen as symbols of Latino pride and considered by the rioters to be unpatriotic and extravagant in a time of war). This grew into heightened tension between European-Americans and Mexican-Americans in Southern California, setting the stage for the later gang conflicts depicted in the film.The character of Montoya Santana is modeled after Rodolfo Cadena, who was a high-ranking and founding member of in the prison gang La Eme, known popularly as the Mexican Mafia. In real life, Cadena unsuccessfully attempted to steer La Eme into left-wing activism before being stabbed to death by members of the rival Nuestra Familia. In the film, Santana is stabbed and killed by his own gang.The character of J.D. was based on Joe \"Pegleg\" Morgan, a Croatian-American gang member and prisoner who preferred the company of Chicanos and along with Cadena helped found La Eme, becoming a high-ranking, respected, and feared member of the Latino gang even though he was of Croatian descent. Morgan died from liver cancer in 1993, while he was incarcerated at California State Prison, Corcoran.Olmos, in neo-realist fashion, used actual prisoners as extras and bit players when he filmed at Folsom Prison.Filming locations include Folsom State Prison, Folsom, California; and East Los Angeles, California.The producers of the film used the following tagline to market the film: In prison, they are the law. On the streets, they are the power.","produced_by":"Edward James Olmos Robert M. Young Sean Daniel","starring":"Edward James Olmos|William Forsythe|Pepe Serna|Evelina Fernández|","running_time":"126 minutes","music_by":"Claude Gaudette Dennis Lambert","edited_by":"Richard Candib Arthur Coburn","budget":"$16 million"}