{"country":"India","distributed_by":"B. R. Films","screenplay_by":"Achala Nagar Satish Bhatnagar Ram Govind Shafiq Ansari","story_by":"B. R. Chopra Achala Nagar Satish Bhatnagar Ram Govind Shafiq Ansari","Awards & Nominations":"Filmfare Awards5th IIFA Awards","baghban_बाग़बान_باغبان":"Theatrical release poster","Plot":"The movie tells the story of Raj Malhotra (Amitabh Bachchan), his wife Pooja (Hema Malini), and their four sons Ajay (Aman Verma), Sanjay (Samir Soni), Rohit (Saahil Chadda), and Karan (Nasir Kazi). The couple have provided their children with everything, often at the cost of Raj's and Pooja's own requirements. The Malhotras have an adopted son Alok (Salman Khan), who is in love with Arpita (Mahima Chaudhry). Alok was an orphan and Raj provided him with money and education, bringing him up as his own son. Now a successful man, Alok worships Raj because of all his help and thinks him as his father.Raj has a flourishing job. But, once he retires, he is unable to support himself and has to vacate the house he and Pooja have shared for years. They decide to live with their kids to enjoy their love and affection. However, their kids do not want them: They think looking after their parents will be a hassle. The children decide to split the parents up, each parent going to live with one of the sons for the next six months. The children think the parents will refuse the offer and, therefore, they will remain in their home. However, the parents reluctantly accept the offer.The parents endure this separation as well as horrible treatment from their children after all they have sacrificed for them. Their grandson, Rahul, is the only one who gives Raj love and affection. Saddened by the treatment he has received from his children and their families, Raj writes down his feelings about how he fulfilled his children's dreams and, in return, how they treat him, as well as his love for his wife, and how much pain their separation has caused. His writing eventually becomes a novel. To pass time in the lonesome and angry house he temporarily lives in, he makes friends that admire him and regard him more than his sons. Pooja, meanwhile, endures abuse from her son and daughter-in-law, as well as her granddaughter, Payal. Payal, though, realizes her mistake when Pooja saves her from her boyfriend's sexual advances and nurtures Pooja with love.While changing their trains after six months, Raj and Pooja spend some time together in Vijaynagar. There they suddenly meet Alok, who takes them to his home and gives them the importance and care which their real sons did not. Raj finds out that his writing has become a published book named Baghban. This book becomes a big hit, selling the first copies immediately. Raj, as a result, gains the money he needs to support himself and Pooja in their old age. Their sons find out and are irked that they are not receiving any money. They ask their parents for forgiveness to achieve this end. Payal and Rahul, though, realize their true motives and refuse to come with their parents. Raj is honored for his work, and the four sons attend with their wives. When they ask Raj to forgive them, he refuses and instead disowns them. Not even Pooja will forgive her children for the pain they have put them through.Raj stays with Pooja at their old home, near Alok and Arpita, and enjoy the company of Rahul and Payal.","language":"Hindi","Reception":"Baghban was premiered at the Leeds International Film Festival, England. It was critically acclaimed and went on to become one of Chopra's biggest hits. The film received an award at the EMVIE 2004 for best media innovation, cinema for the in-film placement of the ICICI group done by Group M.[1]As per Filmfare, Baghban was made at a budget of ₹70 million (US$1.0 million) and made a domestic collections of ₹120 million (US$1.8 million) while it fetched ₹35 million (US$520,000) from overseas market.","box_office":"₹120 crore (equivalent to ₹309 crore or US$46 million in 2016)","cinematography":"Barun Mukherjee","directed_by":"Ravi Chopra","Soundtrack":"Lyrics are penned by Sameer and Hasan Kamaal.All music composed by Aadesh Shrivastav, Uttam Singh.","release_dates":"3 October 2003 (2003-10-03)|||||","Production":"According to film expert Rajesh Subramanian B. R. Chopra had planned to make this movie in the mid-eighties with Dilip Kumar and Raakhee in the lead roles.Mohnish Behl was offered Aman Verma's role; he did not accept it because he did not want to be portrayed as the father of a 15-year-old girl. Juhi Chawla was selected for the role of Salman Khan's wife but could not accept because of her pregnancy. Shahrukh Khan was offered the role played by Salman Khan. Amitabh Bachchan and Hema Malini were paired opposite each other 20 years after Nastik in 1983.Amitabh Bachchan sang three songs himself.","produced_by":"B. R. Chopra","starring":"Amitabh Bachchan Salman Khan Hema Malini Aman Verma Samir Soni Mahima Chaudhry","running_time":"183 minutes","music_by":"Aadesh Shrivastav Uttam Singh","edited_by":"Shailendra Doke Godfrey Gonsalves Shashi Mane"}