{"country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Michael Mann Eric Roth Stephen J. Rivele Christopher Wilkinson","story_by":"Gregory Allen Howard","Plot":"The film begins with Cassius Clay, Jr. before his championship debut against then heavyweight champion Sonny Liston. In the pre-fight weigh-in Clay heavily taunts Liston (such as calling Liston a \"big ugly bear\"). In the fight Clay is able to dominate the early rounds of the match, but halfway through he complains of a burning feeling in his eyes (implying that Liston has tried to cheat) and says he is unable to continue. However, his trainer/manager Angelo Dundee gets him to keep fighting. Once Clay is able to see again he easily dominates the fight and right before round seven Liston quits, making Clay the second youngest heavyweight champion at the time after Floyd Patterson. Clay spends valued time with Malcolm X and the two decide to take a trip to Africa.Clay is then invited to the home of Nation of Islam leader Elijah Muhammad where he is granted the name Muhammad Ali due to his status of World Heavyweight Champion. His father, Cassius Clay Sr. disapproves of this. Ali marries Sonji Roi, an ex-Playboy Bunny, despite her not being Muslim. While at home with his wife and children, Malcolm X is called by the Nation of Islam and is informed that his suspension has been extended and Ali will not go to Africa. However, Ali takes the trip to Africa where he finds Malcolm X, but later refuses to speak to him, honoring the wishes of Elijah Muhammad. He is extremely distraught when Malcolm is later assassinated.Upon returning to America, Ali goes against Sonny Liston a second time and knocks him out in the first round. He and Sonji divorce after she continually objects to certain obligations Muslim women have, notably wearing a hijab.After being officially called to fight in the Vietnam War with the U.S. Army, Ali refuses, and is subsequently stripped of his boxing license, passport and title, additionally facing a few years in prison. Ali marries 17-year-old Belinda Boyd. After a three-year hiatus, his conviction is later overturned and he defeats Jerry Quarry in three rounds.Ali attempts to regain the Heavyweight Championship against Joe Frazier. Dubbed the Fight of the Century, Frazier has the upper hand against Ali for most of the rounds, despite the fight lasting for a long time. In the fifteenth round, he defeats Ali by decision, giving Ali the first loss of his career. When Frazier loses the championship to George Foreman, Ali makes a decision to fight Foreman and become the first boxer to win his title a second time.Foreman and Ali go to Kinshasa, Zaire for the Rumble in the Jungle fight. While there, Ali meets a woman named Veronica Porché, and has an affair with her. After reading rumors of his infidelity through newspapers, his wife Belinda travels to Zaire to confront him about this. Ali says he is unsure as to whether he really loves Veronica or not, and just wants to focus on his upcoming title shot.For a good portion of the fight against Foreman, Ali leans back against the ropes and covers up, letting Foreman wildly throw punches at him. During the fight, Ali realizes that he has to react sooner or else he will be knocked out or possibly die in the ring. As the rounds go on, Foreman tires himself out and Ali takes advantage. He quickly knocks out the tired Foreman, and the film ends with Ali regaining the Heavyweight Championship of which he was previously stripped.","language":"English","Reception":"Ali opened on December 25, 2001 and grossed a total of $14.7 million in 2,446 theaters during its opening weekend. The film went on to gross a total of $87.7 million worldwide. Ali holds a 67% \"fresh\" rating at Rotten Tomatoes. In spite of the positive reviews, the film lost an estimated $63.1 million.The film had generally favorable reviews, with the performances of Smith and Voight being well received by critics in general. Roger Ebert derided the film with two stars in his review for the Chicago Sun-Times, and mentioned, \"it lacks much of the flash, fire and humor of Muhammad Ali and is shot more in the tone of a eulogy than a celebration\".[12] In Variety magazine, Todd McCarthy wrote, \"The director's visual and aural dapplings are strikingly effective at their best, but over the long haul don't represent a satisfactory alternative to in-depth dramatic scenes; one longs, for example, for even one sequence in which Ali and Dundee discuss boxing strategy or assess an opponent\", but he did have praise for the performances: \"The cast is outstanding, from Smith, who carries the picture with consummate skill, and Voight, who is unrecognizable under all the makeup but nails Cosell's distinctive vocal cadences\".[13] USA Today gave the film two and half stars out of four and stated that, \"for many Ali fans, the movie may be good enough, but some perspective is in order. The documentaries a.k.a. Cassius Clay and the Oscar-winning When We Were Kings cover a lot of the same ground and are consistently more engaging\".[14]In The New York Times, Elvis Mitchell proclaimed Ali to be a \"breakthrough\" film for Mann, adding that it was his \"first movie with feeling\" and that \"his overwhelming love of its subject will turn audiences into exuberant, thrilled fight crowds\".[15] J. Hoberman, in his review for the Village Voice, felt that the \"first half percolates wonderfully — and the first half hour is even better than that. Mann opens with a thrilling montage that, spinning in and out of a nightclub performance by Sam Cooke, contextualizes the hero in his times\", and concluded that, \"Ali's astonishing personality is skillfully evoked but, in the end, remains a mystery\".[16]When Ali died in June 2016, Smith was chosen to be one of Ali's pallbearers for the memorial service in Louisville.","box_office":"$87.7 million","Home release":"After the theatrical version (157 min.) was released on DVD in 2002, Mann revisited his film, creating a new cut that ran for 165 minutes and was released to DVD in 2004 as The Director's Cut.[17] Approximately 4 minutes of theatrical footage was removed, while 14 minutes of previously unseen footage was placed back in by Mann.[18] The theatrical cut of the film was released on Blu-ray in France in 2009 and in Germany in 2012.","cinematography":"Emmanuel Lubezki","production_company":"Peters Entertainment Forward Pass Overbrook Films","directed_by":"Michael Mann","release_dates":"December 25, 2001 (2001-12-25)|||||","Production":"Producer Jon Peters had started developed the film as far back as 1993.[2] Gregory Allen Howard wrote the initial draft of the script, which had the working title Power and Grace. Howard's draft focused on Ali's life from 12 to 40 years old, and his relationship with his father.[3] Howard was replaced by writers Stephen J. Rivele and Chris Wilkinson, and by 1998 the biopic was set up at Columbia Pictures, with Will Smith attached to star and the possibility of Ron Howard directing.[4] During the filming of Wild Wild West, Smith presented director Barry Sonnenfeld with the script. Columbia was hoping for filming to start towards the end of 1998,[5] but it was pushed back, and Sonnenfeld exited in November 1999. It was speculated the Columbia was hesitant to move forward with Sonnenfeld following the disappointing box office performance of Wild Wild West.[6] In February 2000, it was announced that Michael Mann had taken over as director, following his Academy Award nomination for The Insider. With this commitment to Ali, Mann turned down the opportunity to direct early versions of The Aviator, Shooter and Savages,[7] and brought Eric Roth to co-write the script.[8] After years of being attached to the Ali biopic, Smith officially signed on in May 2000 with a $20 million salary.[9]Filming began in Los Angeles on January 11, 2001 on a $105 million budget. Shooting also took place in Chicago, Miami and Mozambique.[10]Smith spent approximately one year learning all aspects of Ali's life. These included boxing training (up to seven hours a day), Islamic studies and dialect training. Smith has said that his portrayal of Ali is his proudest work to date.[citation needed]One of the selling points of the film is the realism of the fight scenes. Smith worked alongside boxing promoter Guy Sharpe from SharpeShooter Entertainment, and his lead fighter Ross Kent, to get the majority of his boxing tips for the film. All of the boxers in the film are former or current world heavyweight championship caliber boxers. It was quickly decided that 'Hollywood fighting'—passing the fist (or foot) between the camera and the face to create the illusion of a hit—would not be used in favor of actual boxing. The only limitation placed upon the fighters was for Charles Shufford (who plays George Foreman). He was permitted to hit Smith as hard as he could, so long as he did not actually knock the actor out.Smith had to gain a significant amount of weight to look the part of Muhammad Ali.[11]","produced_by":"Jon Peters Michael Mann James Lassiter Paul Ardaji A. Kitman Ho","starring":"Will Smith Jamie Foxx Jon Voight Mario Van Peebles Ron Silver Jeffrey Wright Mykelti Williamson James Toney","running_time":"157 minutes","music_by":"Pieter Bourke Lisa Gerrard","External links":"","edited_by":"William Goldenberg Lynzee Klingman Stephen E. Rivkin Stuart Waks","ali":"Theatrical release poster","budget":"$107 million[1]"}