{"country":"United States","distributed_by":"Lionsgate","crank":"Theatrical release poster","Plot":"Chev Chelios (Jason Statham) is a Los Angeles-based British hitman, working for a crime syndicate headed by Carlito (Carlos Sanz). Chelios is contracted by Carlito to kill mafia boss Don Kim (Keone Young) as members of the Triads have been encroaching on Carlito's business. Chelios goes to Don Kim and apparently murders him.However, Ricky Verona (Jose Pablo Cantillo), an ambitious small-time criminal uses the opportunity to conspire with Carlito against Chelios; Verona will kill Chelios so the Triads do not retaliate, and then take Chelios's place as Carlito's new hired gun. The morning after Don Kim's death, while Chelios sleeps in his apartment, Verona, his brother Alex (Jay Xcala), and several henchmen break in and inject Chelios with a Chinese synthetic drug which inhibits the flow of adrenaline, slowing the heart and eventually killing the victim. Chelios wakes to find a recording left by Verona showing what he has done. In anger, Chelios smashes his TV and heads out.Chelios phones Mafia surgeon Doc Miles (Dwight Yoakam), who informs Chelios that in order to survive he must keep his adrenaline pumping through constant excitement and danger, and he is unsure if the antidote exists. Chelios keeps his adrenaline up through reckless and dangerous acts like picking fights with other gangsters, taking illegal drugs and synthetic epinephrine, fighting with police, stealing a police officer's motorcycle, having public sex with his girlfriend Eve (Amy Smart), and driving his car through a shopping mall.Chelios visits Carlito at his penthouse and asks him to help find an antidote, as well as to find and kill Verona and his crew. Carlito says there is no antidote and only confirms that Carlito and Verona are working together. Carlito tells Chelios how he will use his death as a scapegoat against the Chinese. An angered Chelios leaves Carlito's penthouse to find Verona. Through Chelios' street contact, a transvestite named Kaylo (Efren Ramirez), he finds Alex at a restaurant and unsuccessfully interrogates him about his brother's whereabouts before killing him. Chelios phones Verona through Alex's phone and tells him of his brother's death, prompting Verona to send thugs after Eve as a revenge. Chelios rushes to pick up Eve before Verona's thugs get to her. Chelios reveals his true profession to her and that he was planning to retire to spend more time with her.Kaylo, who has been kidnapped by Carlito's men, is forced to call Chelios and tell him that Verona is at a Triad warehouse. Chelios goes there, finding Kaylo's corpse and the henchmen. They reveal that Carlito ordered them to kill Chelios. Eve, who has followed Chelios, unexpectedly arrives, but then escapes with Chelios after a shootout with Carlito's henchmen. Chelios and Eve go to Doc Miles's place, where Miles explains that he cannot cure Chelios. Knowing that he will die soon, Chelios decides to take his revenge on Verona and arranges a meeting with him at a downtown hotel.Chelios goes to the rooftop of the hotel and meets with Verona, Carlito, and his henchmen. Carlito takes out a syringe, filled with the same poison used by Verona. As he is about to kill Chelios by injecting the second dose into him, Don Kim, revealed to be alive as Chelios spared him, arrives with his Triads to assist Chelios and a shootout follows. During the battle, several of Don Kim's and all of Carlito's men are killed. Carlito tries to escape with his private helicopter, but Chelios manages to catch up to him and holds him at gunpoint. Before Chelios can kill Carlito, Verona sneaks behind and injects Chelios with the syringe, after which Chelios collapses. Carlito himself is betrayed by Verona, who shoots him to death and then tries to escape with his helicopter.Chelios manages to stand up, boards the helicopter, and engages in a fight with Verona. After some struggle, Chelios manages to pull Verona out of the helicopter and while mid-air, Chelios proceeds to snap Verona's neck, killing him. While falling, Chelios calls Eve on his cell phone to apologize for not coming back. Chelios hits a car, bounces off it and lands right in front of the camera. In the last shot, it is implied that his adrenaline is indeed still flowing fast; his nostrils flare, he blinks, and two heartbeats are heard.","language":"English","box_office":"$42.9 million[2]","cinematography":"Adam Biddle","Marketing":"Directors Neveldine and Taylor, along with actors Statham and Ramirez, appeared at the 2006 Comic-Con Convention in San Diego, California. The panel showed a short clip and promoted the film, mentioning that it was shot in HD and that no wires or CGI were used for the stunt scenes.[5]The filmmakers also made extensive use of web advertisement to promote the film. Lionsgate bought a featured spot on the home page of YouTube and paid several of its well-known members to advertise.[citation needed]","directed_by":"Neveldine/Taylor","Home media":"The Region 2 version of the DVD was released December 26, 2006, but initially had no special features. The Region 1 DVD was released by Lionsgate on January 9, 2007. This DVD is available in separate widescreen and fullscreen editions, each with Dolby Digital 5.1 and 2.0 tracks. The bonus materials includes running cast and crew audio commentary, behind-the-scenes footage, gags, maps, making-of insights, and interviews with the cast. These features are all accessible via the \"Crank'd Out Mode\" - a pop-up window feature that allows access to the extras without ever leaving the film. The DVD also includes a \"family friendly\" audio replacement, in which the film is dubbed over as it would appear on a television broadcast. However, the violence, language subtitles, and nudity are still the same.","Video games":"A J2ME game was developed by Silverbirch Studios.[8][9]In the popular video game Call of Duty: Ghosts, there is a game mode called Cranked, based on the film.[citation needed] Two teams fight each other, but when a player kills an enemy, they become 'cranked'. Once a player is cranked, they have boosted speed though have 30 seconds to kill another enemy to reset the timer, or else they'll explode, similar to the film's plot.","production_companies":"Lakeshore Entertainment @radical.media","release_dates":"September 1, 2006 (2006-09-01)|||||","Production":"The film was shot on location in Los Angeles. Co-directors Mark Neveldine and Brian Taylor operated both \"a\" and \"b\" cameras, where one would get a wide shot and the other would get a close-up shot. Jason Statham did all of his own fight and car stunts, including the fight with Verona in a helicopter 3,000 feet above Los Angeles.[3]The soundtrack for the film was released on August 22, 2006. Allmusic gave the album three out of five, stating \"What is here is imaginative, creative, and head-scratchingly cool. While it's a very tacky and overly obvious thing indeed to end with the Jefferson Starship tune \"Miracles\" (why not just give away the ending, huh?), this set is pretty much unassailable.\"[4]","produced_by":"Michael Davis|Gary Lucchesi|Tom Rosenberg|Skip Williamson|Richard S. Wright|","starring":"Jason Statham|Amy Smart|Jose Pablo Cantillo|","running_time":"88 minutes[1]","Sequel":"Crank: High Voltage is the 2009 sequel to Crank. It picks up seconds after the first film left off. It seems that the poison in Chelios' body has worn off, but retains the gimmick of the first installment; he now has an artificial heart which he must keep charged with electricity to stay alive.","music_by":"Paul Haslinger","edited_by":"Brian Berdan","Release":"Crank opened on September 1, 2006 in North America in 2,515 theaters and grossed $10,457,367 with an average of $4,157 per theater and ranking at No.2 at the box office. The film ended up grossing $27,838,408 domestically and $15,092,633 internationally for a total of $42,931,041, on a $12 million production budget.[2]Crank received mixed to positive reviews from critics and has a rating of 61% on Rotten Tomatoes based on 92 reviews with an average score of 6 out of 10. The consensus states \"It's a film about a guy injected with Speed... wait, there's no bus. It's a film about a guy who has to kick a bunch of squirmy butt to stay alive... wait, no snakes or planes here. But it is a film about doing lots of drugs and pulling lots of punches, and it entertains accordingly.\"[6] The film also has a score of 57 out of 100 on Metacritic based on 19 reviews indicating \"mixed or average reviews\".[7]","written_by":"Neveldine/Taylor","budget":"$12 million[2]"}