{"Cast":"Paul Hogan ... Terry Dean Elias Koteas ... Steve Garner Linda Kozlowski ... Rose Garner Doreen Lang ... Mrs. Garner Douglas Seale ... Father Ruth Warshawsky ... Irene Bealeman Parley Baer ... George Bealeman Michael Alldredge ... Det. Sgt. Freebody David Alan Grier ... Det. Bill Larry Miller ... Teller Travis Venable ... Bubba Robert Sutton ... Guido Ben Slack ... Rev. Barton, TV Evangelist Troy Curvey, Jr. ... Tom the Guard Eddie Frias ... Young Guard Trainee Peter Mark Vasquez ... Thug Lyle J. Omori ... Thug's Crony Joseph Walton ... Prisoner #1 Steven Brill ... 2nd Male Teller Richard Grove ... Uniformed Cop Susie Duff ... Mother Justin Murphy ... Small Boy Gregory J. Barnett ... Driver (Van) (billed as Greg Barnett) Ray Reinhardt ... Doctor Laurie Souza ... Young Nurse Hank Worden ... Pop, Hospital Patient","country":"US","distributed_by":"Paramount Pictures","Plot":"Terry Dean (Paul Hogan), a professional burglar specialized in sabotaging electronic surveillance systems, stands before his release from yet another stint in prison. Following a fellow inmate's suggestion, he decides to switch to bank robbery instead, with a special twist of his own design: first by having the security cameras record TV shows he would connect them to with a modified remote control, then entering disguised as a celebrity; the confusion over this unexpected appearance would serve to confound a detailed description.Terry's first heist (disguised as Willie Nelson) is successful, but shortly afterwards he witnesses a young boy about to be overrun by a van; he impulsively pushes the child away and is himself hit. While in the hospital, he has a nebulous experience (which may have been caused by Highway to Heaven playing on the room's TV) in which he meets God (Charlton Heston; this is used as a pun later on) who introduces himself as Terry's 'probation helper'. Though Terry has lived a sinful life, his last deed, impulsive as it was, has earned him a second chance to save his soul - by doing God's work as an angel in training.After reawakening, Terry tries another bank hold-up (this time disguised as Rod Stewart), but a stroke of luck occurs and a gang of amateur robbers interfere. As they escape, one of the thugs tries to shoot Terry, but gun was loaded with blanks by one of the other thugs. Thinking himself to be an immortal angel now, Terry reconsiders his ways, seeks advice in a church, and then he follows several 'signs' to another town. In a bar, he meets Steve Garner (Elias Koteas), an embittered young man confined to a wheelchair by a terminal sickness. In order to bring Steve out of his self-pity, Terry engages him in a fist-fight on equal terms, sitting fixed on a stool. Steve, taken with Terry's acceptance of him as a person, not a cripple, strikes up a friendship with Terry and offers him a place to stay at the youth center for children and teens, which he runs with his sister Rose (Linda Kozlowski).Rose is at first suspicious about Terry, but Terry proves himself by slyly intimidating two drug dealers into leaving the center's area and helping out as much as he can, and Rose gradually falls in love with him. The center itself, however, is in financial difficulties, since its backer George Bealeman (Parley Baer), while claiming himself to be a faithful Christian, refuses to provide any more funds. Since he has no angel's powers, Terry uses his technical know-how to convince Bealeman otherwise: by recording and re-editing a segment from TV evangelist Rev. Barton's (Ben Slack) telecast (which Bealeman watches feverently), and fitting the cross at the rooftop of the center's church with lighting effects, triggered by his universal remote.At the evening where Bealeman drops by, however, two police detectives close in on Terry. Steve, who happens to overhear them, rushes off in his wheelchair to warn Terry, but during the flight he injures himself critically, slowly bleeding to death. Just after Bealeman has left, he arrives at the center, and while Rose runs to calls an ambulance, Steve delivers his warning. Afraid of death, Steve feels lost, but is reassured he will find a place in Heaven when Terry uses the remote to trigger the lighted cross, creating a sign from God. No longer afraid of death, Steve dies in the arms of Terry and Rose.Terry then announces that he has to leave, and trying to comfort Rose, he reveals that he is \"almost an angel\". Rose is understandably skeptical, but after Terry leaves, she checks his universal remote which he had left her as a keepsake, only to discover that it contains no batteries, and the cross nevertheless begins to shine brilliantly on its own. She runs after Terry and calls out to him. Distracted, Terry slips and falls right before a speeding truck and is about to be run over. Rose is shocked to witness that the truck passes right though him, proving he was really an angel all along. Having passed his angel's exam, Terry continues on his quest to do God's work (though not without promising to return), and Rose is left comforted at last.","language":"English","Reception":"The film had a mostly negative reception.[2][3][4][5][6] It currently holds a 29% rating on Rotten Tomatoes.The film was also a commercial failure.[7] It grossed just under $7 million in ticket sales on a $25 million budget.","box_office":"$6,939,946 (USA)","cinematography":"Russell Boyd","directed_by":"John Cornell","almost_an_angel":"Theatrical release poster","release_dates":"December 19, 1990","produced_by":"John Cornell","starring":"Paul Hogan|Elias Koteas|Linda Kozlowski|","running_time":"95 minutes","music_by":"Maurice Jarre","edited_by":"David Stiven","written_by":"Paul Hogan","budget":"$25 million"}