{"country":"Canada[3]|United States[3]|","distributed_by":"Lionsgate (United States)|FilmNation Entertainment (International)[1]|","Plot":"Somewhere in the Indian Ocean, a man (Robert Redford) wakes to find water flooding his boat. He has collided with a wayward shipping container, ripping a hole in the hull. He uses a sea anchor to dislodge the container, then changes course to tilt the boat away from the hole. He patches the hole and uses the manual bilge pump to remove the water from the cabin.The boat’s navigational and communications systems have been damaged by saltwater intrusion. The man tries to repair the marine radio and connects it to one of the boat's batteries but is unsuccessful. When he climbs the mast to repair an antenna lead, he sees an oncoming tropical storm. When the storm arrives, he runs before the wind. He intends to bring the boat into a hove-to position, but when crawling to the bow to hoist the storm jib, he is thrown overboard and regains the deck after a long struggle. The boat capsizes, turtles after a further 180-degree roll and is dis-masted, and most of the equipment is destroyed. With the boat badly holed and sinking, the man abandons ship in an inflatable life raft, salvaging whatever he can to survive.As the man learns to operate a sextant, he discovers he is being pulled towards a major shipping lane by ocean currents. He survives another storm but his supplies dwindle, and he learns too late that his drinking water has been contaminated with sea water. He improvises a solar still from his water container and a plastic bag to produce freshwater.The man is passed by two container ships, which do not see him, despite his use of signaling flares. He drifts out of the shipping lane with no food and water. On the eighth day, he writes a letter, puts it in a jar, and throws it in the water as a message in a bottle. Later that night, he sees a light in the distance. He tears pages from his journal along with charts to create a signal fire. The fire grows out of control and consumes his raft. He falls into the water and allows himself to sink. Underwater, he sees the hull of a boat with a search light approaching his burning raft. He swims up towards the surface to grasp an outstretched hand.","language":"English","Reception":"Film review aggregator Rotten Tomatoes reports that 93% of critics gave the film a positive review based on 215 reviews, with an average score of 8/10. The site's consensus states: \"Anchored by another tremendous performance in a career full of them, All Is Lost offers a moving, eminently worthwhile testament to Robert Redford's ability to hold the screen.\"[22] On Metacritic the film has a score of 87 based on 45 reviews, considered to be \"universal acclaim\".[23]After the screening of the film at the Cannes Film Festival, Redford received a standing ovation.[24] Writing for The Independent, Geoffrey Macnab said the film was \"utterly compelling viewing\".[25] Andrew Pulver, writing for The Guardian, said that \"Redford delivers a tour de force performance: holding the screen effortlessly with no acting support whatsoever.\"[26] Justin Chang of Variety said of Redford's performance that he \"holds the viewer’s attention merely by wincing, scowling, troubleshooting and yelling the occasional expletive\".[27] Robbie Collin of The Telegraph said, \"The film's scope is limited, but as far as it goes, All Is Lost is very good indeed: a neat idea, very nimbly executed.\"[28]Peter Bradshaw, writing also for The Guardian, says the \"near-mute performance as a mysterious old man of the sea\" to be \"a bold, gripping thriller.\" Being an ambiguous and challenging metaphor, he concludes: \"What a strikingly bold and thoughtful film.\"[29] Alan Scherstuhl of The Village Voice writes that the film is \"a genuine nail-biter, scrupulously made and fully involving, elemental in its simplicity.\"[30] David Morgan of CBS News gave the film a positive review, stating, \"Four decades ago Redford demonstrated a similar capacity for survival skills as the mountain man Jeremiah Johnson. Today, at age 77, without a supporting cast and performing virtually all of his water stunts himself, Redford proves he is still up to the task, shining in what is an extremely physical but also an intellectually demanding role.\"[31]The film has been criticized in the sailing world for being unrealistic, in particular for the lack of certain safety equipment deemed standard for sailboats navigating the open ocean such as an EPIRB, and other bad decisions of the main character,[32][33][34] An exception to this criticism is English Yachting Monthly, for which Dick Durham claimed: \"Certainly the film is authentic and grippingly realistic.\"[35] Director Chandor himself, who says he went sailing with his parents when young and later a few times as an adult, stated in an interview with German sailing magazine Segeln that everything that happened in the film could have happened in reality. His only reservations were the probability of crossing the Indian Ocean single-handed and of not evading the storm with modern technology and due attention.[36]All Is Lost was listed on many critics' top ten lists.[37]","box_office":"$10.2–13.6 million[5][6]","cinematography":"Frank G. DeMarco","production_company":"Before the Door Pictures Washington Square Films","all_is_lost":"Theatrical release poster","directed_by":"J. C. Chandor","release_dates":"May 22, 2013 (2013-05-22) (Cannes)|October 25, 2013 (2013-10-25) (North America)||||","Production":"All Is Lost was written and directed by J. C. Chandor, his second feature film, following 2011's Margin Call. During his time commuting from Providence, Rhode Island to New York, Chandor developed the idea for All Is Lost.[8] After meeting Robert Redford at the 2011 Sundance Film Festival where Margin Call premiered, Chandor asked the veteran actor to be in the film. On February 9, 2012, Redford's casting was confirmed for All Is Lost as its only cast member.[9] In addition to there being only one actor in the film, Redford also stated that the film has no dialogue, however there are a few spoken lines.[10] Because of these aspects, the shooting script was only 31 pages long.[8]Principal photography began in mid-2012 at Baja Studios in Rosarito Beach in Mexico. Baja Studios was originally built for the 1997 film Titanic.[9] Filming took place for two months in the location's water tank.[11] In addition the crew spent \"two or three days\" filming in the actual ocean.[12] Chandor would later remark that completing the film was \"essentially a jigsaw puzzle\"[12] and that the crew spent less time on the actual ocean than the film would have viewers believe.[12] At a press conference after the film's screening at Cannes 2013, Redford revealed that his ear was damaged during the production.[13]Being filmed on the water and largely within the confines of a sailboat and liferaft, the film was technically difficult. It joined ranks with other water-plagued films: Alfred Hitchcock's Lifeboat; Roman Polanski's Knife in the Water; Kevin Costner's Waterworld;[14] James Cameron's Titanic; Robert Zemeckis's Cast Away and Steven Spielberg's Jaws.[citation needed]The film score to All Is Lost is composed by Edward Sharpe and the Magnetic Zeros’ frontman Alex Ebert, who signed on to the film in November 2012.[15] Speaking of the experience of working on the film, Ebert said, \"This project was a dream—an open space to play in but also space to listen to the elements—wind, water, rain, sun, are the story's other characters to me. I knew I had quite a task ahead of me: to at once allow the elements to sing and to give Redford a voice with which to, once in a while, respond.\"[16] The \"extra features\" of the Blu-ray Disc explicate on the unique development of the sound track, music, script and other production considerations.A soundtrack album featuring ten original compositions and one new song all written, composed, and produced by Ebert was released on October 1, 2013 by Community Music.[17] On September 12, 2013, the song \"Amen\" from the soundtrack was made available for streaming.[18]","produced_by":"Justin Nappi|Teddy Schwarzman|Neal Dodson|Anna Gerb|","starring":"Robert Redford","running_time":"105 minutes[2]","music_by":"Alex Ebert","edited_by":"Pete Beaudreau","Release":"All Is Lost screened out of competition at the 2013 Cannes Film Festival on May 22.[19] The film was distributed theatrically by Lionsgate and by Roadside Attractions in the United States.[20] FilmNation Entertainment handled foreign sales for the film. In February 2012, Universal Pictures purchased distribution of the film in 19 international territories (U.K., France, Italy, Spain, Hong Kong, South Korea, Russia, Portugal and Australia). Other deals were made with HGC in China, Square One in Germany, Sun Distribution in Latin America and Pony Canyon in Japan.[21] It began a limited release in the United States on October 18, 2013.","written_by":"J. C. Chandor","budget":"$8.5 million[4]"}