{"country":"United States","distributed_by":"MGM","Plot":"Young horse trainer Sally (Eleanor Powell) befriends Sonny (George Murphy) and Peter (Buddy Ebsen), who have been hired to look after a horse her family once owned. Concerned for the horse's well-being, she sneaks aboard a train taking the horse and its caretakers to New York City. En route she meets talent agent Steve Raleigh (Robert Taylor) who, impressed with her dancing and singing, sets her on the road to stardom and romance blossoms between the two. A subplot involves a boarding house for performers run by Sophie Tucker, who is trying to find a big break for young Judy Garland.","broadway_melody_of_1938":"Theatrical release poster","language":"English","box_office":"$2,846,000[1]","cinematography":"William H. Daniels","directed_by":"Roy Del Ruth","release_dates":"August 20, 1937 (1937-08-20)|||||","Production":"This was the third of the \"Broadway Melody\" series, and had the working title of Broadway Melody of 1937.[4] When it was released, late in 1937, it was advertised with the tagline So new it's a year ahead!.MGM borrowed Binnie Barnes from Universal Pictures for the film.[4]The film was in production from late February to 20 July 1937, and was released on 20 August.[5] Its initial running time was 115 minutes, compared to the final running time of 110 minutes.[4]Judy Garland's number, \"You Made Me Love You (I Didn't Want to Do It)\" has been cited as her first great film success. The song was specially prepared by Roger Edens for Clark Gable's 36th birthday as a present, and Garland sang it at the party given by MGM. Producer Louis B. Mayer was so impressed he ordered that it be included in the next possible musical MGM was producing.[4] Following the sensational audience reaction to the song, Garland was rushed into shooting two more films back to back, Thoroughbreds Don't Cry (1937) and the more musically elaborate Everybody Sing, which was held for later release in 1938.[6]The finale of the film takes place on a giant set upon which neon signs are visible showing the names of famous stage and screen stars. During Sophie Tucker's final number, all of the signs in the background actually change to read \"Sophie Tucker\" in tribute to her.","produced_by":"Jack Cummings","starring":"Robert Taylor Eleanor Powell","running_time":"110 minutes","Box Office":"According to MGM records the film earned $1,889,000 in the US and Canada and $957,000 elsewhere resulting in a profit of $271,000.[1]","Songs":"The majority of songs in Broadway Melody of 1938 were written by Nacio Herb Brown (music) and Arthur Freed (lyrics):[2][3]","music_by":"Nacio Herb Brown (songs-music) Arthur Freed (song-lyrics)","edited_by":"Blanche Sewell","written_by":"Jack McGowan","budget":"$1,588,000[1]"}