{"country":"Greece","distributed_by":"Feelgood Entertainment","Plot":"A couple and their adult son and two adult daughters live in a fenced compound. The children have no knowledge of the outside world; their parents say they will be ready to leave once they lose a dogtooth, and that one can only leave safely by car. The children entertain themselves with endurance games, such as holding their hands under hot water, and are rewarded with stickers for good behaviour and punished with violence for bad. They believe they have a brother on the other side of the fence to whom they throw supplies.The father pays a young woman who works at his factory, Christina, to come to the house and have sex with the son. Frustrated with the son's refusal to give her cunnilingus, Christina trades her headband in exchange for cunnilingus from the elder daughter.The father visits a dog training facility and demands to have his dog returned. The trainer refuses because the dog has not finished its training, and asks: \"Do we want an animal or a friend?\"When the children are terrified by a stray cat in the garden, the son kills it with a pair of pruning shears. Deciding to take advantage of the incident, the father shreds his clothes, covers himself in fake blood, and tells his children that their unseen brother was killed by a cat, the most dangerous creature. After he teaches them to bark on all fours to fend off cats, the family holds a memorial service for the brother.Christina again barters for oral sex from the elder daughter. The daughter rejects her offer of hair gel and demands the Hollywood film tapes in her bag. She watches the films in secret and afterwards recreates scenes and quotes their dialogue. When the father discovers the tapes, he beats her with one of them, then goes to Christina's flat and hits her with her VCR, cursing her future children to be corrupted by \"bad influences\".The parents decide that, with Christina no longer available, they will have the son choose one of his sisters as a replacement. After fondling both sisters with his eyes closed, he chooses the elder. She is uncomfortable during their sex and afterwards recites threatening dialogue from the film Rocky IV to her brother.During a performance for the parents' wedding anniversary, the elder daughter dances the choreography from the film Flashdance, disturbing her parents. Later, she knocks out one of her dogteeth with a dumbbell and hides in the boot of her father's car. The father discovers her tooth fragments and searches for her outside fruitlessly. He drives to work the next day; the car sits outside the factory, unattended.","Accolades":"Greek Prime Minister George Papandreou ended the Cabinet meeting on 25 January 2011 by saying \"The news that the film Dogtooth by Yorgos Lanthimos is nominated for Best Foreign Language Film goes far beyond the world of cinema, arts and culture. It concerns the whole country, its people, the new generation of artists who follow the motto \"Yes, we can do it\" during difficult times.\"[24] He continued by saying \"I won't say that the news shows that miracles happen, because the success of Yorgos Lanthimos is based on hard work, talent and his endless potential. Features that characterize the creative forces which lead Greece to a new era; forces which deserve our support and they will have it. Bravo Yorgos.\"[24]The film was chosen unanimously by the Greek Film Committee to represent Greece at the Oscars.[25]","language":"Greek","Reception":"In its home country, Greek critic Dimitris Danikas gave the film a rating of eight out of ten (\"with enthusiasm\") and characterizes it as \"black, surreal, nightmarish.\" He believes that Dogtooth is as important for Greek cinema as Theodoros Angelopoulos' 1970 film Reconstruction.[13] He goes on to say \"Lanthimos composes and goes from one level to another like a wildcat-creator, constantly and continuously maintaining the same rigorous style. Hence the aphasia; hence the uniformity; hence the submission and the scheduled mass culture; hence also the serial killer; hence, however, the disobedience, the anarchy. As I said at the beginning: Dogtooth has the surrealism of Buñuel, the scalpel of Haneke, the underground horror of a thriller without the splatter. Perfect.\"[13] Danikas characterized Dogtooth's Academy Award nomination as \"the greatest Greek triumph of recent years.\"[14] Columnist Dimitris Bouras, writing for Kathimerini, refers to \"the beneficial effects that the prestigious award could have\" and believes that the nomination reveals three interesting facts: \"1) in Greece we need to be extroverts (and not only in cinema), 2) exportable product is whatever has an identity, 3) Dogtooth's nomination is like an investment – manna from the heaven of Hollywood for the developing Greek cinema.\"[15]As of July 2014 the film had a 92% approval rating from critics at Rotten Tomatoes.[16] The Scotsman's Alistair Harkness hailed director Lanthimos as \"a bold new voice on the world cinema scene, someone who might soon be elevated to a similar position as those twin pillars of Euro provocation: Lars von Trier and Michael Haneke,\" although the film is \"not... designed simply to shock in the way von Trier's work often does,... nor does it have that annoyingly prescriptive, punitive air of superiority favoured by Haneke's films.\"[17]Peter Bradshaw of The Guardian praised the filmmakers' technique, finding it \"superbly shot, with some deadpan, elegant compositions, and intentionally skewiff framings\".[18] Roger Ebert (Chicago Sun-Times) gave the film three out of four stars. He noted the director's \"complete command of visuals and performances. His cinematography is like a series of family photographs of a family with something wrong with it. His dialogue sounds composed entirely of sentences memorized from tourist phrase books.\"[19] Mark Olsen of the Los Angeles Times said \"All of the film's purposeful weirdness is conveyed with an unaffected simplicity that recalls the dead-aim haphazard compositions of photographer William Eggleston.\" He concluded that \"as a film, it's pure and singular, but it's not quite fully formed enough to be what one could call truly visionary.\"[20][20] A. O. Scott of The New York Times wrote that the film \"at times seems as much an exercise in perversity as an examination of it\" and \"The static wide-screen compositions are beautiful and strange, with the heads and limbs of the characters frequently cropped. The light is gauzy and diffuse, helping to produce an atmosphere that is insistently and not always unpleasantly dreamlike. You might think of paintings by Balthus or maybe Alex Katz, though the implied stories in those pictures are more genuinely evocative and haunting than the actual narrative of Dogtooth.\"[21]Several reviewers, such as Harkness and Bradshaw, made comparisons to the 2008 Fritzl case, although they pointed out that the screenplay had been written before the case emerged.[17][18] Scott, like Ebert, made references to homeschooling.[19][21] Resemblances have been noted to the 1972 Mexican film The Castle of Purity.[22][23]The film's larger meanings eluded easy expression. Scott called the film \"a conversation piece. Though the conversation may... be more along the lines of: 'What was that?' 'I don’t know. Weird.' 'Yeah.' [shudder]. 'Weird.'\"[21] Olsen saw Dogtooth's substance as \"part enigma, part allegory and even part sci-fi in its creation of a completely alternate reality.\"[20] While Ebert found a \"message...: God help children whose parents insanely demand unquestioning obedience to their deranged standards.... [S]ome have even described the film as a comedy. I wasn't laughing.\"[19] For Bradshaw, the film investigates \"the essential strangeness of something society insists is the benchmark of normality: the family, a walled city state with its own autocratic rule and untellable secrets.\"[18] Harkness notes the \"absolute mockery the situation makes of the perfect family ideal\" where \"Lanthimos isn't interested in making specific political or social points and he refuses to offer any clarifying backstory\"; he found Dogtooth's oddness \"as organic and playful as its impact is incisor sharp.\" [17]","box_office":"$1.4m[3]","dogtooth":"Theatrical release poster","cinematography":"Thimios Bakatatakis","production_company":"Boo Productions","directed_by":"Yorgos Lanthimos","release_dates":"18 May 2009 (2009-05-18) (Cannes)|11 November 2009 (2009-11-11) (Greece)||||","Production":"Dogtooth was the feature film début for Boo Productions, an Athens-based advertising company. The Greek Film Center supported the project with about €200,000 and much of the production was done with help from volunteers.[6] Another €50,000 was offered by the production studio, bringing the overall budget to €250,000.[2] Anna Kalaitzidou and Christos Passalis were stage actors who were cast after having worked with Lanthimos earlier. Mary Tsoni was not a professional actress, but a singer in a punk band.[7] Lanthimos had an open approach to both acting and visual style, as he thought it would look fake if he involved too much in the details. It wasn't until the rehearsals started that he began to develop the idea of how the film should be shot, a style where he tried to combine a realistic environment with \"really strict framing and a cool, surreal look to go with the narrative\".[8]","produced_by":"Iraklis Mavroidis Athina Rachel Tsangari Yorgos Tsourianis","starring":"Christos Stergioglou Michelle Valley Angeliki Papoulia Mary Tsoni Christos Passalis","running_time":"97 minutes[1]","edited_by":"Yorgos Mavropsaridis","Release":"The film premiered on 18 May at the 2009 Cannes Film Festival,[9] and went on to screen within such festivals as Toronto International Film Festival and Maryland Film Festival. It was released in Greece on 11 November the same year through Feelgood Entertainment.[10][11] Verve Pictures picked up the British distribution rights and launched it on 23 April 2010.[8] The American premiere was on 25 June 2010, managed by Kino International.[12]","written_by":"Yorgos Lanthimos Efthymis Filippou","budget":"€250,000[2]"}