{"country":"United Kingdom","distributed_by":"Cinevista (USA) Umbrella Entertainment (AUS)","Details and awards":"Caravaggio was Jarman's first project with Tilda Swinton and was also her first film role. The cook Jennifer Paterson was an extra. The production designer was Christopher Hobbs who was also responsible for the copies of Caravaggio paintings seen in the film. The film was entered into the 36th Berlin International Film Festival where it won the Silver Bear for an outstanding single achievement.[2]","Plot":"Told in a segmented fashion, the film opens as Caravaggio (Nigel Terry) dies from lead poisoning while in exile, with only his long-time deaf-dumb companion Jerusaleme (Spencer Leigh) (who was given by his family to the artist as a boy) by his side. Caravaggio thinks back to his life as a teenage street ruffian (Dexter Fletcher) who hustles and paints. While taken ill and in the care of priests, young Caravaggio catches the eye of Cardinal Del Monte (Michael Gough). Del Monte nurtures Caravaggio's artistic and intellectual development but also appears to molest him.As an adult, Caravaggio still lives under the roof and paints with the funding of Del Monte. Caravaggio is shown employing street people, drunks and prostitutes as models for his intense, usually religious paintings (see the article on the painter for examples). He is depicted as frequently brawling, gambling, getting drunk and is implied to sleep with both male and female models, including the male Jerusaleme and the female contortionist Pipo (Dawn Archibald). In the art world, Caravaggio is regarded as vulgar and entitled due to his Vatican connections.One day, Ranuccio (Sean Bean), a street fighter for pay, catches Caravaggio's eye as a subject and potential lover. Ranuccio also introduces Caravaggio to his girlfriend Lena (Tilda Swinton), who also becomes an object of attraction and a model to the artist. When both Ranuccio and Lena are separately caught kissing Caravaggio, each displays jealousy over the artist's attentions. One day, Lena announces she is pregnant (although she does not state who the father is) and will become a mistress to the wealthy Scipione Borghese (Robbie Coltrane). Soon, she is found murdered by drowning. As the weeping Ranuccio looks on, Caravaggio and Jerusaleme clean Lena's body. Caravaggio is shown painting Lena after she dies and mournfully writhing with her nude body. Ranuccio is arrested for Lena's murder, although he claims to be innocent. Caravaggio pulls strings and goes to the Pope himself to free Ranuccio. When Ranuccio is freed, he tells Caravaggio he killed Lena so they could be together. In response, Caravaggio cuts Ranuccio's throat, killing him. Back on his deathbed, Caravaggio is shown having visions of himself as a boy and trying to refuse the last rites offered him by the priests.In keeping with Caravaggio's use of contemporary dress for his Biblical figures, Jarman intentionally includes several anachronisms in the film that do not fit with Caravaggio's life in the 16th century. In one scene, Caravaggio is in a bar lit with electric lights. Another character is seen using an electronic calculator. Car horns are heard honking outside of Caravaggio's studio and in one scene Caravaggio is seen leaning on a green truck. Cigarette smoking, a motorbike, and the use of a manual typewriter also feature in the film.","language":"English","cinematography":"Gabriel Beristain","directed_by":"Derek Jarman","Home media":"Caravaggio was released on DVD by Umbrella Entertainment in July 2008. The DVD is compatible with all region codes and includes special features such as the trailer, a gallery of production designs and storyboards, feature commentary by Gabriel Berestain, an interview with Christopher Hobbs titled Italy of the Memory, and interviews with Tilda Swinton, Derek Jarman, Nigel Terry.[3]","release_dates":"United States: 29 August 1986","produced_by":"Sarah Radclyffe","starring":"Nigel Terry Sean Bean Tilda Swinton","running_time":"93 minutes","music_by":"Simon Fisher-Turner","edited_by":"George Akers","written_by":"Derek Jarman Suso Cecchi d'Amico Nicholas Ward-Jackson (story)","budget":"£450,000[1]"}