{"a_guy_thing":"Theatrical poster","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Greg Glienna Pete Schwaba Matt Tarses Bill Wrubel","story_by":"Greg Glienna","language":"English","box_office":"$17,432,163[1]","Synopsis":"Karen (Blair) and Paul (Lee) are about to get married. During his bachelor party, Paul has a chat with one of the dancers at the party, Becky (Stiles) and they find that they have an affinity for each other. Paul wakes up the next morning and is terrified to see Becky in the bed next to him. Assuming they slept together, Paul rushes Becky out of his apartment and hopes never to see her again. He tries to cover up the connection for the few days before the wedding. Unfortunately, Becky unexpectedly shows up around town and turns out to be Karen's cousin. Even worse, Becky's ex-boyfriend cop Ray had Becky followed and photographed. Becky and Paul meet again to steal those pictures from Ray's apartment. Further problems arise with family and friends consistently showing up at the wrong times. Crabs, dirty underwear in the toilet tank, a horny best friend, and a best man/brother who is in love with the bride all provide for a week of wedding preparation hijinks. Through the snowballing of all his implausible lies and half truths, he receives corroboration and support from an unexpected corner: what seems to be a coordinated network of other men, including friends, complete strangers and to Paul's astonishment, Karen's own father; all who give the same explanation: \"It's a guy thing\".","cinematography":"Robbie Greenberg","production_company":"David Ladd Films","directed_by":"Chris Koch","release_dates":"January 17, 2003 (2003-01-17)|||||","Box office":"The film debuted at #7 in the U.S. box office, taking USD 6,988,749 in its opening weekend, before falling to #11 the following week.[2]","produced_by":"David Ladd David Nicksay","starring":"Jason Lee Julia Stiles Selma Blair","running_time":"101 minutes","music_by":"Mark Mothersbaugh","edited_by":"David Moritz","budget":"$20 million"}