{"country":"United States France Spain United Kingdom","distributed_by":"Paramount Pictures (United States) Pathé (United Kingdom and France)","Plot":"In the beginning, Columbus is obsessed with making a trip westwards to Asia, but lacks crew and a ship. The Catholic theologians at the University of Salamanca heavily disapprove of it, and they are not keen on ideas that go against the writings of Ptolemaeus. After continuous warnings at the monastery, he becomes involved in a brawl with the monks, ending up lying in the monastery courtyard to pay penance. His eldest son, Diego, one of the monks, looks on disapprovingly. As Columbus continues his penance through a vow of silence, he is approached by Martín Pinzon, a shipowner from Palos, who introduces Columbus to the banker Santángel. Queen Isabella I (Sigourney Weaver) owes money to Santángel. Columbus meets with the queen, who grants him his journey in exchange for his promise to bring back sufficient amounts of riches in gold.Columbus tricks many crewmen by telling them that the voyage would only last seven weeks. He goes to confession at the monastery to absolve his sins, and the monk reluctantly gives him absolution, as he is unable to inform the crewmen without breaking his oath. The next morning, three ships leave for the trip to Asia, with the flagship being the Santa Maria. During the voyage at night, Captain Méndez notices him navigating by the stars, a skill previously known only to the Moors. Columbus then happily teaches how to use the quadrant to find the North Star and that the 28th parallel must be followed to find land. Nine weeks go by and still no sign of land. The crew becomes restless and the other captain turns against Columbus. He tries to reinvigorate them, to let them see the dream that he wishes to share. While some of the crewmen were still not convinced, the main sail suddenly catches the wind, which the crewmen see as a small act of God's willingness. At night, Columbus notices mosquitoes on the deck, indicating that land is not far off. Some days later, Columbus and the crew spot an albatross flying around the ship, before disappearing. Suddenly, out of the mist they see Guanahani (\"San Salvador\") with lush vegetation and sandy beaches, the first discovery of the New World.They befriend the local natives, who show them gold they have collected. Columbus teaches one of them Spanish so that they are able to communicate. He then informs them that they are to return to Spain momentarily to visit the Queen and bring the word of God. They leave behind a group of crewmen to begin the colonisation of the New World. Columbus receives a high Spanish honour from the Queen and has dinner with the Council. They express disappointment with the small amount of gold he brought back, but the Queen approves of his gifts. On the 2nd expedition, Columbus takes 17 ships and 1,500 men with him to the island; however, all the crewmen left behind are found to have been killed. When the tribe is confronted by Columbus and his troops, they tell him that other strangers came and savaged them. Columbus chooses to believe them, but his commanding officer Moxica is not convinced. They begin to build the city of La Isabela and eventually manage to hoist the town bell into its tower, symbolising the arrival of Christianity in the New World.Four years later, Moxica cuts the hand off one of the natives, accusing him of lying about the whereabouts of gold. The word of this act of violence spreads throughout the native tribes and they all disappear into the forest. Columbus begins to worry about a potential war arising, with the natives heavily outnumbering them. Upon return to his home, he finds his house ablaze by Moxica and his followers, confirming his unpopularity among a certain faction of the settlers. Soon, the tribes arrive to fight the Spaniards and the island becomes war-torn, with Columbus' governorship being reassigned with orders for him to return to Spain.Christopher Columbus is accused of nepotism and offering administrative positions to his personal friends, thereby injuring the pride of the nobles such as Moxica; so, he is replaced by de Bobadilla. It is revealed that Amerigo Vespucci has already discovered the mainland America. Therefore, Columbus returns to Castile. Columbus is sentenced to many years in prison, but he is bailed out by his sons soon after. When summoned by the Queen about seeing the New World again, he makes a case for her about his dream to see the New World. She agrees to let him take a final voyage, with the proviso that he does not go with his brothers nor returns to Santo Domingo or the other colonies. In 1502, Columbus goes to Panama with his son Fernandez and finds the Pacific Ocean on the other side of the mainland. The closing scene shows him old, with his youngest son writing down his tales of the New World.","1492:_conquest_of_paradise":"Theatrical release poster","language":"English","Release and reception":"1492: Conquest of Paradise opened in theatres on 9 October 1992. It was rated PG-13 in the United States because of violence and brutality. The film was not a success, debuting at No. 7, and ultimately grossing far below its $47 million budget.[8]Overall, the film received mixed reviews,[9][10][11][12][13] with the review aggregator Rotten Tomatoes giving the film a \"rotten\" 39% rating based on 18 reviews. However, respected film critic Roger Ebert said in his review that the film was satisfactory, stating \"Depardieu lends it gravity, the supporting performances are convincing, the locations are realistic, and we are inspired to reflect that it did indeed take a certain nerve to sail off into nowhere just because an orange was round.\"[14]","cinematography":"Adrian Biddle","production_company":"Gaumont Film Company Légende Enterprises France 2 Due West CYRK Films","directed_by":"Ridley Scott[1]","Music":"Renowned Greek composer Vangelis composed the score. Its main theme, Conquest of Paradise, was used by former Portuguese Prime-Minister António Guterres at his 1995 election and it was used by the Portuguese Socialist Party as its campaign and rally anthem,[3][4][5] although it was replaced by the main theme from Gladiator (curiously another Riddley Scott film) since the first José Sócrates legislative elections campaign,[6] which doesn't prevent the theme from still being deeply associated with the Socialist Party.[7]The theme is also used at the starting line of the Ultra-Trail du Mont-Blanc ultramarathon. The German boxer Henry Maske (former world champion (IBF) in the Light heavyweight category) used the main theme as his official entry theme during his professional career. Other usages of the theme include New Zealand Super 15 Rugby franchise the Canterbury Crusaders, as they run onto the field, often accompanied by actors dressed as knights and riding on horseback, and rugby league team Wigan Warriors who play in Super League, as well as being played before the start of every match in the 2010 and 2014 cricket World Twenty20 championships as well as the 2011 Cricket World Cup. In these events the theme was played right before the national anthems of the two competing nations, as the flags of the two nations were carried into the ground, accompanied by the players of the two teams. The theme was also played in the Top Gear: US Special and became a signature piece for World Professional Champion figure skaters Anita Hartshorn and Frank Sweiding. Despite the film's dismal box office intake in the United States, the film's score became a successful album worldwide.","release_dates":"9 October 1992 (1992-10-09) (United States)|12 October 1992 (1992-10-12) (France)||||","produced_by":"Alain Goldman Ridley Scott","starring":"Gérard Depardieu Sigourney Weaver Armand Assante Fernando Rey","running_time":"142 minutes","music_by":"Vangelis","edited_by":"William M. Anderson Françoise Bonnot Les Healey Armen Minasian Deborah Zeitman","written_by":"Roselyne Bosch","budget":"$47 million"}