{"country":"United Kingdom","distributed_by":"London Independent Producers","Plot":"Stephen, a married Oxford tutor in his forties, has two students: the rich and likeable William, of whom he is fond, and a beautiful, enigmatic Austrian named Anna, whom he secretly covets. William also fancies Anna and hopes to know her better. Stephen, while his wife is away having their third child, looks up an old flame in London and they sleep together. Returning home, he finds that his pushy colleague Charlie has broken in and is using it for sex with Anna. Her tryst discovered, she tells Stephen privately that she is getting engaged to William. Excited at his good fortune, William says he will call round to Stephen's house after a party that night. As William is too drunk to drive, Anna takes the wheel and crashes the car outside Stephen's gate. Upon finding the accident and William dead, Stephen pulls the deeply shaken Anna from the wreckage and hides her upstairs while he calls the police. When they have gone, he forces himself on her although she is still in shock and then takes her back to her rooms. He comes by in the morning to find a bemused Charlie who cannot prevent Anna from packing to go back to Austria.","language":"English","Themes":"The screenplay showcased playwright Harold Pinter's trademark style, depicting the menace and angst bubbling just beneath the surface of commonplace remarks and seemingly innocent or banal situations. The crowning metaphor of the film comes when we see a dazed but unhurt Anna crushing her dying fiancé beneath her high-heeled shoe as she steps on his face while trying desperately to climb out of the overturned car.","Reception":"The film confused many viewers who were not sure what it meant. \"It's obvious what Accident meant,\" said Stanley Baker, who acted a lead role in the film. \"It meant what was shown on the screen.\" Baker did concede of Joseph Losey's filmmaking that, \"One of Joe's problems is that he tends to wrap things up too much for himself. I think that 75% of the audience didn't realise that Accident was a flashback.\"[5] In his review upon the film's release, New York Times critic Bosley Crowther was unimpressed, calling the film \"a sad little story of a wistful don\" that was \"neither strong drama nor stinging satire\".[6] More recently, the film has been called a \"masterpiece\" by Boston Globe critic Peter Keogh.[7]","cinematography":"Gerry Fisher","directed_by":"Joseph Losey","release_dates":"February 1967","produced_by":"Joseph Losey Norman Priggen","starring":"Dirk Bogarde Stanley Baker Jacqueline Sassard","running_time":"105 minutes","music_by":"John Dankworth","edited_by":"Reginald Beck","written_by":"Harold Pinter (screenplay) based on the novel by Nicholas Mosley","budget":"£299,970[1]"}