{"country":"United States","DVD release":"In 2003, Anchor Bay Entertainment released the Region 1 DVD box set of the first three Angel films entitled The Angel Collection.[4]","Plot":"Molly (Betsy Russell in place of original actress Donna Wilkes) is off the streets and studying to become a lawyer.Molly learns that Lt. Andrews (Robert F. Lyons, replacing Cliff Gorman), the detective who helped her leave prostitution, was murdered. She returns to the streets as Angel to track down his killer and avenge his death. She enlists help from her old friends, Yo-Yo Charlie, Solly, and Kit Carson and hunts for the sole witness, Johnny Glitter, to the crime.They break Kit out of the sanitarium and find Johnny at his home just as the thugs who killed Andrews find him. Kit and Angel save Johnny in a shootout. Angel discovers a scheme to buy up Hollywood Boulevard by intimidation and violence that Gerrard perpetuates. Gerrard's men corner Kit, Solly, Angel and Johnny in an alley. Kit shoots the car and causes it to crash, and they capture Gerrard's son. The son gets loose and threatens them with a gun, but the phone rings and Kit shoots him to death.The caller is Gerrard, who has kidnapped Solly's baby, Little Buck.. Gerrard offers to trade Buck for his son. They attempt to make the trade despite the son's death, but Gerrard discovers the ruse. When he discovers his son has died a shootout ensues and Gerrard takes the baby. Kit takes out one thug and Johnny Glitter, who shoots blind, shoots the other and also himself.Angel confronts Gerrard on the top floor and Gerrard threatens to throw the baby down. Angel surrenders and Gerrard puts the baby down, but the baby crawls toward the edge. Gerrard will not allow Angel to move. Solly sees what is happening and goes up to shoot Gerrard.Angel tries to get to the baby but the baby falls. Kit sees the baby fall and catches him. Angel and Solly come down with the baby safely wrapped in Kit's jacket.","language":"English","cinematography":"Peter Lyons Collister","directed_by":"Robert Vincent O'Neill","Soundtrack":"As Craig Safan was unvailable because of The Last Starfighter, Christopher Young scored the film. In 1990 Intrada Records issued his music on a compilation CD including his work from 1985's Def-Con 4, 1986's Torment and 1988's The Telephone; in 2013 BSX Records released a compilation album called The Angel Trilogy, featuring Young's score, Safan's music for Angel and Eric Allaman and Reinhard Scheuregger's music for Angel III: The Final Chapter.","release_dates":"January 11, 1985","produced_by":"Sandy Howard","starring":"Betsy Russell|Rory Calhoun|Robert F. Lyons|Ossie Davis|Susan Tyrrell|","running_time":"93 min","music_by":"Christopher Young","edited_by":"John R. Bowey","Release":"Avenging Angel went into production quickly after the success of its predecessor. Hoping to recreate the success of the first film, New World Pictures released the film on January 11, 1985, two days shy of the anniversary of the first film's release. The film was a box office disappointment for the company, opening in tenth place and eventually earning $5,622,787.[3]","written_by":"Joseph Michael Cala Robert Vincent O'Neill"}