{"Cast":"Richard Martin made his first appearance as the Mexican Irish character \"Chito\" Rafferty that he would later play in many RKO Westerns opposite Tim Holt.","country":"United States","bombardier":"Theatrical release poster","distributed_by":"RKO Pictures","Plot":"In 1941, at a staff meeting in Washington, D.C., two officers of the U.S. Army Air Corps (and old friends) debate the importance of bombardiers. Major \"Chick\" Davis (Pat O'Brien) argues that a bombardier, using the top secret American bombsight will be the \"spearhead of our striking force.\" After a year of observing the Royal Air Force fight the German Luftwaffe, Capt. \"Buck\" Oliver (Randolph Scott) is not convinced a bomber can get \"so close that a bomb can't miss\" and that new pilots are the priority. Davis challenges Oliver to a \"bombing duel\" to test their respective points of view. Oliver, using a dive bomber, misses the stationary target with all his bombs, while Davis, bombing from 20,000 feet in a Boeing B-17 Flying Fortress, succeeds in hitting his target with his first bomb.Later, Oliver recommends that \"Hughes Field\", in \"Almansor\", New Mexico, the civilian flying school of a friend, be leased as a new Bombardier Training School. As the school's first class nears graduation, Major Davis arrives, with right-hand man, M/Sgt. Archie Dixon (Barton MacLane), to take command. Davis is discomfited by the presence of so many civilian women clerks, including the field's former owner, Burton \"Burt\" Hughes (Anne Shirley), the daughter of a respected Air Corps general and now a secretary under terms of the lease. Davis is brusque with Burt and she observes he could use some training in manners.Buck Oliver arrives with the next cadet class, that includes Tom Hughes (Eddie Albert), Burt's brother. Davis is mildly disturbed to learn that Oliver and Burt have a romantic history, and the two friendly rivals continue to butt heads over the importance of bombardiers. Oliver, who heads the group of pilots flying bombers for cadet training, refuses to take them seriously because they will become sergeants upon graduation, not commissioned officers. Davis attempts to make up with Burt, and solicits the War Department to commission the bombardiers. Preflight ground school is intensive and with practice bombing, reveals many shortcomings: Tom Hughes has trouble with fear-induced air sickness, Joe Connors (Robert Ryan) with commitment issues, and \"Chito\" Rafferty (Richard Martin) with the lack of women on the base. Cadet Pete Jordan is not up to the complexity of the training and soon washes out.Connors reveals to Davis that a spy wants to buy information from him about the secret bombsight, and helps Davis lure the spy into a trap where he is arrested. Cadet Paul Harris, brilliant in ground school and a hero for saving his bomber from destruction when a flare goes awry, is conscience stricken that his mother thinks he will be a murderer of innocent civilians. Davis reassures him with a patriotic pep talk. When a bomber develops mechanical problems and the crew is ordered to bail out, Tom Hughes panics in fear and refuses to jump. His friend (and another suitor of Burt Hughes), Cadet Jim Carter (Walter Reed), crash- lands the aircraft, claiming that he is the one who panicked, but Hughes confesses afterward. Facing an elimination board, he successfully persuades Davis and receives a second chance.On a subsequent flight, Buck Oliver passes out from anoxia, nearly tossing Carter out of the opened bomb bay without a parachute. Tom Hughes falls to his death saving Carter's life. Oliver is subjected to a board of investigation but exonerated because his actions resulted from the failure of his oxygen equipment. Guilt-stricken and unable to face Burt, Oliver transfers out of the school. Shortly after, America is drawn into the war by the Japanese attack on Pearl Harbor. Davis, promoted to colonel, becomes a B-17 group commander, and awkwardly proposes marriage to Burt who turns him down. The group (and new bombardiers Carter, Connors, Rafferty, and Harris) leaves for a secret island base in the Pacific, and Burt passionately kisses Jim Carter goodbye, revealing her choice.At the base, Buck Oliver, now a major, joins the group just as it is about to fly a night mission to bomb an aircraft factory in Nagoya, Japan. Oliver's assignment is bomb with incendiaries to set the target on fire a half hour before the arrival of the group, which Davis will lead at high altitude. Joe Connors is Oliver's bombardier and Sgt. Dixon his tailgunner. Flying low, Oliver's bomber is shot down before he can drop his bombs, and Connors remains at his post, sacrificing his life to destroy the bombsight, fulfilling an oath he took upon entry into Bombardier School.Oliver and the remainder of his crew, including Dixon, are captured. Their Japanese captors execute the other crew members to coerce Oliver and Dixon into revealing the location of their base, but Dixon overwhelms his guard and attempts to escape. The stretchers used to carry the dead Americans are stamped \"USA Earthquake Relief 1923\". He is machine gunned in the attempt, but the shots also set fire to a truck carrying barrels of gasoline. Oliver drives the burning truck throughout the factory, setting fire to its camouflage netting and fulfills his mission, knowing he will be killed by his own men. The B-17 group fights off Japanese fighters, is riddled by flak, but overcomes the reluctance of the bombardiers to bomb their compatriots and successfully destroys the target.","language":"English","Reception":"Bombardier premiered on May 14, 1943, at Kirtland AAB,[11] (now Kirtland AFB). Despite a blistering review from Bosley Crowther,[12] the film was well received by the public.[13] In 1993, 50 years after its first release, a colorized version was released on VHS by Turner Home Entertainment.The film was popular with audiences and earned RKO a profit of $565,000.[14][15]Bombardier received an Academy Award nomination in 1944 for Best Special Effects: Vernon L. Walker (photographic), James G. Stewart and Roy Granville (sound).[16][17]The film featured a supporting character, the Mexican-American Chito played by Richard Martin. Chito was created by screenwriter Jack Wagner, who had been brought in to work on the screenplay. Chito proved so popular RKO used the character as a sidekick in a series of Westerns, notably with Tim Holt.[18]","box_office":"$2 million (US rentals)[1]","cinematography":"Nicholas Musuraca","directed_by":"Richard Wallace","release_dates":"May 14, 1943 (1943-05-14)|||||","produced_by":"Robert Fellows","starring":"Pat O'Brien Randolph Scott","running_time":"99 minutes","Production and background notes":"RKO Pictures began Bombardier as a project in 1940, with several rewrites to incorporate changes in world events.[3] With full cooperation of the United States Army Air Corps, the film was in production from October 12 to December 18, 1942, with six weeks of the filming done on location at Kirtland Army Air Base.[4] All the aviation cadets in training at the base were used as extras, and veteran aircrews assigned to the school as instructors flew the B-17s used in formation shots at the end of the film.[3] At Kirtland, filming featured live action photography of training aircraft including Beech AT-11 Kansan trainers, as well as Boeing B-17C and E Flying Fortress, Consolidated B-24 Liberator, Douglas B-18 Bolo and North American B-25 Mitchell bombers.[5] A Junkers Ju 87 and Vought SB2U Vindicator dive bombers were briefly seen at the beginning of the film.[6] The production moved to Midland, Texas to film the Japanese bombing scenes.[7]Notable members of the film crew included Robert Wise as film editor, and Robert Aldrich as second assistant director.[3] Lambert Hillyer directed filming (uncredited) of an aerial sequence, while Joseph F. Biroc completed the cinematography work begun and credited to Nicholas Musuraca.[8]The central conflict between competing points of view over the importance of specialized bombardier training in Bombardier reflected an actual doctrinal struggle within the U.S. Army Air Corps between 1939 and December 1941, when, as in the film, the proponents of specialized training won out. Three attempts at developing a school had been tried since July 1940 at Lowry Field, Colorado; Barksdale Field, Louisiana; and Ellington Field, Texas, before the permanent school was established at Kirtland by Col. John D. Ryan as the first step in meeting a wartime goal of training 30,000 bombardiers.[9][N 1]Albuquerque Army Air Base (renamed Kirtland in February 1942) was constructed from January to August 1941 on the site of the former Oxnard Field (a private airport) in Albuquerque, at which time the 19th Bomb Group (commanded in combat by Col. Eugene Eubank, who introduces the film) completed training for deployment to the Philippines. A permanent Bombardier Training School, the first of 10 in the southwest United States, opened in December 1941 at Albuquerque AAB and eventually graduated more than 5,000 bombardiers.[9]","music_by":"Roy Webb","edited_by":"Robert Wise","written_by":"John Twist Martin Rackin"}