{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Dan Fogelman Chris Williams","Plot":"In the prologue, a puppy named Bolt (John Travolta) is adopted by a seven-year-old girl named Penny (Miley Cyrus).Five years later, they star on a hit adventurous television series called Bolt in which the titular character has various superpowers and must constantly thwart the evil plans of the nefarious Doctor Calico (Malcolm McDowell). To gain a more realistic performance, the TV show's producers have deceived Bolt his entire life, arranging the filming in such a way that Bolt believes the television show is real and that he really has superpowers, including a powerful sonic scream-like \"superbark\". Mistakenly believing Penny has been kidnapped by the villain, Bolt escapes from his on-set trailer in Hollywood but knocks himself unconscious trying to break through a window and falls into a box of foam peanuts and unknown to the film company is accidentally shipped to New York City. In New York, Bolt eventually comes round, and starts to notice that his \"superpowers\" aren't working, and rationalizes this is the effect that styrofoam has on his body. He then meets Mittens (Susie Essman), a female alley cat who bullies pigeons out of their food. Bolt (believing she's one of Calico's minions) forces Mittens to help him get back to Penny, and after Bolt ends up knocking Mittens unconscious into a letter box, the two start their epic journey westward on a truck. In Hollywood, Penny is deeply saddened over Bolt's disappearance but is convinced by the studio to continue filming with a Bolt lookalike.Surprised at his first feelings of hunger, Bolt is shown by Mittens how to act like a cute, but needy dog, and is rewarded by food for the both of them at a nearby RV park in Elmwood Place, Ohio. Here, they meet Rhino (Mark Walton), a fearless, TV-obsessed hamster and Bolt fan who joins their team. Rhino’s unwavering faith in Bolt substantiates the dog’s illusions about his superpowers, but Mittens, who has learned that Bolt is from a television show, tries to convince Bolt that his superpowers aren't real. Bolt refuses to listen to Mittens, and instead becomes frustrated and attempts to \"superbark\" her repeatedly. The noise attracts Animal Control, who captures them both and transports them to an animal shelter. After being freed en route by Rhino, Bolt finally realizes that he is just a normal dog, but regains his confidence after Rhino (oblivious to this revelation) gives him a pep talk. They rescue Mittens from the shelter and escape, allowing them to continue their journey. Along the way, Mittens helps Bolt through his identity crisis by teaching him typical dog activities (such as hanging his head out car windows and chasing sticks), but Mittens refuses to go farther than Las Vegas. She tells Bolt that his Hollywood life is fake and there is no real love for him there. Her emotional rant reveals that she was once a house cat, but was abandoned by her previous owner and left to brave the harsh streets alone and declawed. Bolt refuses to believe that Penny doesn't love him, and continues on alone, wishing Mittens the best. Rhino, learning of Bolt's departure, convinces Mittens that they must help him, and the two set off to find Bolt once again.Bolt reaches the studio and finds Penny embracing his lookalike. Unaware that Penny still misses him and that her affection for the lookalike is only a part of a rehearsal for the show, he leaves, brokenhearted. Mittens, on a gantry in the studio, sees what Bolt does not: Penny telling her mother how much she misses Bolt. Realizing that Penny truly does love Bolt, Mittens follows Bolt and explains. At the same time, the Bolt-lookalike panics during the show's filming and accidentally knocks over some flaming torches, setting the sound stage on fire with Penny trapped inside. Bolt arrives and reunites with Penny inside the burning studio, but they cannot get out. In desperation, and unwilling to abandon Penny, Bolt uses his \"superbark\". The firefighters hear the noise through the building's air vent and manage to rescue them before they succumb to smoke inhalation.Penny and her mother subsequently quit the show when their overeager agent attempts to exploit the incident for publicity purposes. Penny herself adopts Mittens and Rhino, and she and her family move to a rural home to enjoy a simpler, happy lifestyle with Bolt and her new pets. The show continues, but with a replacement \"Bolt\" and \"Penny\" – \"Penny's\" new appearance being explained in the show as being serious injuries necessitating her undergoing facial reconstruction surgery, and adopting a new storyline about alien abduction (one that even Rhino finds unrealistic, and Bolt finds \"ridonculous\"). The epilogue scenes during the credits show Bolt, Penny, her mother, Mittens, and Rhino enjoying their new life together.","language":"English","Reception":"On Rotten Tomatoes the film has a rating of 89% based on 177 reviews. The site's critical consensus reads: \"Bolt is a pleasant animated comedy that overcomes the story's familiarity with strong visuals and likable characters.\"[25] Another review aggregator, Metacritic, gave the film a 67/100 approval rating based on 29 reviews following under the category \"generally favorable reviews\".[26]Perry Seibert of TV Guide gave the film 3 stars out of 4 and wrote the film \"amuses both those who make up the film's target audience and the parents along for the ride. This winning mix of exciting action, heart-tugging sentiment, and gentle character comedy makes Bolt yet another solid addition to Disney's history of family-friendly fare.\"[27] Tasha Robinson of the A.V. Club gave the film a B+ stating that \"Bolt is the studio's first film since Lilo & Stitch that feels like it's trying to recapture the old Disney instead of aggressively shedding it in favor of something slick and new. And yet it comes with a healthy cutting-edge Pixar flavor as well.\"[28] Kenneth Turan of The Los Angeles Times wrote that \"[Bolt] also has an intriguing plot that is kind of the family animation version of the Jim Carrey-starring The Truman Show.\"[29]On its opening weekend, the film opened number 3 with $26,223,128 behind Twilight and Quantum of Solace.[30] On its second weekend, it rose to No. 2 behind Four Christmases with a 1.4% increase.[31] In the United States and Canada, the film grossed $114,053,579 by its closing date on February 22, 2009.[32] An additional $195,926,415 was made internationally as of January 2, 2011, for a worldwide total of $309,979,994.[1][33]Bolt was nominated for the following awards:","box_office":"$310 million[1]","production_company":"Walt Disney Pictures Walt Disney Animation Studios","directed_by":"Chris Williams Byron Howard","Video games":"Disney Interactive Studios produced a video game based on the film, released in November 2008 for Nintendo DS, Wii, PlayStation 2, PlayStation 3, Xbox 360 and PC.[44] The game focuses on Bolt's fake TV life, not the actual storyline.[45] A separate game was released for mobile phones,[46] and a third game, RhinoBall, was released as an application on Apple's App Store.[47]","Music":"The score to Bolt was composed by John Powell.[11] The soundtrack featured the film's score and two original songs – I Thought I Lost You by Bolt's stars Miley Cyrus and John Travolta (nominated for a Golden Globe Award for Best Original Song on 2009) as well as \"Barking at the Moon\" by Rilo Kiley singer Jenny Lewis.[11] The soundtrack was released on November 18, 2008.[12]Although Motörhead has a song in the film, they do not seem to appear in either the soundtrack or the score. Motörhead's song, \"Dog-Face Boy\" (from their Sacrifice album) is in a mailroom scene where a young worker is listening to it on his headphones and inadvertently wraps Bolt up in a box that gets shipped off to New York City.[13]Track listing:All music composed by John Powell, except as noted.","release_dates":"November 21, 2008 (2008-11-21)|||||","Production":"At first, the film was going to be titled American Dog, and was written and directed by Chris Sanders. Eventually, Sanders was removed from the project and replaced by Chris Williams and Byron Howard.[2] The film's previous plot told the story of a dog named Henry, a famous TV star, who one day finds himself stranded in the Nevada desert with a testy, one-eyed cat and an oversized, radioactive rabbit who are themselves searching for new homes, all the while believing he is still on television. In 2006, after becoming Chief Creative Officer at Disney Animation, John Lasseter along with other directors from Pixar and Disney attended two screenings of the film and gave Sanders notes on how to improve the story. According to Lasseter, Sanders was replaced because he resisted the changes that Lasseter and the other directors had suggested. Lasseter was quoted as saying \"Chris Sanders is extremely talented, but he couldn't take it to the place it had to be.\"[3] After Sanders left and the original title was removed, the animation team was told to complete the filming in 18 months instead of the usual four years that is normally required to produce a computer-animated feature.[4] On June 8, 2007, Disney announced that the film, now under its current name, would be released on November 21, 2008 in Disney Digital 3-D.[5][6]The look of the film was inspired by the paintings of Edward Hopper and the cinematography of Vilmos Zsigmond.[7] New technology in non-photorealistic rendering (NPR) was used to give it a special visual appearance, a technique also used in Tangled (2010). To give the film's 3D backgrounds a hand-painted look, the company artists used new patented technology designed specifically for the film.[8]Bolt's characteristics are based on an amalgam of breeds, although the designers started with the American White Shepherd.[9] Joe Moshier, lead character designer, said, \"they American White Shepherds have really long ears, a trait that I tried to caricature in order to allow the animators to emphasize Bolt's expressiveness.\"[9]The design of Rhino in his plastic ball was based on executive producer John Lasseter's pet chinchilla, which was brought to an animators' retreat during the film's production.[10]","produced_by":"Clark Spencer John Lasseter","starring":"John Travolta Susie Essman Mark Walton Miley Cyrus","running_time":"96 minutes","bolt":"Theatrical release poster","music_by":"John Powell","edited_by":"Tim Mertens","Release":"Bolt was theatrically released in the United States on November 21, 2008. Beginning in its fourth week in theaters, the film was accompanied by Pixar Animation Studios' Cars Toons short Tokyo Mater.[14]Bolt was released on Region A Blu-ray Disc in the United States on March 22, 2009. The BD set included standard DVD and digital copy versions of the film. Single-disc DVD and Special Edition DVD with Digital Copy versions followed in Region 1 on March 24.[15] This marked the first time a major home-video release debuted on Blu-ray Disc before DVD.[16] Bolt was released on both Blu-ray and DVD in the United Kingdom on June 15, 2009.[17]A short film called Super Rhino is included in the DVD and Blu-ray versions of the film.[18] The DVD has sold 4,581,755 copies, generating $81.01 million in sales as of December 31, 2009.[19] The 3D Blu-ray version of the film was released in November 2010, in France[20] and UK.[21] A month later it was released worldwide, exclusively to select Sony TVs.[22][23] In US, it was released on November 8, 2011.[24]","budget":"$150 million[1]"}