{"original_language(s)":"English","production_company(s)":"Flying A Productions","Guest stars":"Dick Tufeld appeared fifteen times in assorted roles during the course of the series; Harry Lauter, twelve times; Stanley Andrews and Gregg Barton, eleven times each; Myron Healey, ten times; Roy Barcroft, eight times; William Fawcett, prior to his role as Pete Wilkey in Fury, seven times; William Tannen, six times, and Don C. Harvey, five times.","country_of_origin":"United States","original_network":"Syndication","audio_format":"Monaural","Synopsis":"The show starred Gail Davis in the title role, and co-starred Brad Johnson as Deputy Sheriff Lofty Craig and Jimmy Hawkins, as Annie's brother, Tagg. In one episode, \"Bull's Eye\", the role of Tagg was played by Billy Gray, better known as James \"Bud\" Anderson, Jr., on Father Knows Best. In the series, Annie Oakley rode a horse named Target, Tagg's horse was Pixie and Lofty's was named Forest.[1][2] Annie and Tagg lived in the town of Diablo, Arizona, with their uncle, Sheriff Luke MacTavish, who was usually away whenever trouble started. It would then be up to straight-shooting Annie and her \"silent suitor\" Lofty Craig to rescue law-abiding neighbors and arrest outlaws.[3] Often Tagg would be told to stay in town and out of the way, but through disobedience, the need to relay important new information, or being captured by outlaws, he would end up in the middle of the adventure.Annie always wore the same fringed cowgirl outfit, of which 15 or more copies were made throughout the show's production.[4] Her hairstyle was braided pigtails.Additional episodes were being considered, but Jimmy Hawkins had a growth spurt and outgrew the part of Annie's little brother.[5]Annie Oakley was among Gene Autry's Flying A Productions.","DVD releases":"Approximately two dozen episodes lapsed into the public domain and are currently available on DVD in North America (including several releases issued through Davis's estate) and elsewhere, although a full-series release has yet to happen.On March 31, 2009, Mill Creek Entertainment released Gun Justice Featuring The Lone Ranger, with other television Westerns such as Annie Oakley.On July 11, 2014, it was announced that VCI Entertainment will release the complete series on DVD in Region 1 for the first time on October 21, 2014.[6]","executive_producer(s)":"Gene Autry Louis Gray Armand Schaefer","no._of_episodes":"83","cinematography":"William Bradford Joe Novak","original_release":"January 9, 1954 (1954-01-09) – February 24, 1957 (1957-02-24)","picture_format":"Black-and-white","genre":"Western","starring":"Gail Davis Brad Johnson Jimmy Hawkins Bob Woodward","running_time":"30 mins.","composer(s)":"Erma E. Levin","producer(s)":"Colbert Clark Louis Gray","Comics":"A number of American comics were based on the TV series:Many of these issues were later reprinted in black and white by L. Miller and World Distributors Ltd.","Books":"At least three \"Authorized TV Adventures\" were published by Whitman Publishing Company.[citation needed]","no._of_seasons":"3"}