{"based_on":"The Borrowers  by Mary Norton","country":"Japan","distributed_by":"Toho","screenplay_by":"Hayao Miyazaki Keiko Niwa","arrietty":"theatrical poster for Arrietty","Plot":"A boy named Shō (Shawn in the Disney dub) tells the audience he still remembers the week in summer he spent at his mother's childhood home with his maternal great aunt, Sadako (Jessica in the Disney dub), and the house maid, Haru (Hara in the Disney dub). When Shō arrives at the house on the first day, he sees a cat, Niya, trying to attack something in the bushes but it gives up after it is attacked by a crow. Shō gets a glimpse of Arrietty, a young Borrower girl, returning to her home through an underground air vent.At night, Arrietty's father, Pod, takes her on her first \"borrowing\" mission, to get sugar and tissue paper. After obtaining a sugar cube from the kitchen, they travel inside a hollow wall to a bedroom which they enter through an intriguing dollhouse with working electric lights and kitchen utensils. However, it is Shō's bedroom; he lies awake and sees Arrietty when she tries to take a tissue from his night table. Startled, she drops the sugar cube. Shō tries to comfort her, but Pod and Arrietty quietly leave and go home.The next day, Shō puts the sugar cube and a little note beside the air vent where he first saw Arrietty. Pod warns Arrietty not to take it because their existence must be kept secret from humans. Nevertheless, she sneaks out to visit Shō in his bedroom. She drops the sugar cube on the floor, letting him know that she is there. Without showing herself, she tells Shō to leave her family alone and that they do not need his help. On her return, Arrietty is intercepted by her father. Realizing they have been detected, Pod and his wife Homily decide that they must move out. Shō learns from Sadako that some of his ancestors had noticed the presence of Borrowers in the house and had the dollhouse custom-built for them. The Borrowers had not been seen since, however.Pod returns injured from a borrowing mission and is helped home by Spiller, a Borrower boy he met on the way. He informs them that there are other places the Borrowers could move to. While Pod is recovering, Shō removes the floorboard concealing the Borrower household and replaces their kitchen with the kitchen from the dollhouse, to show he hopes them to stay. However, the Borrowers are frightened by this and instead speed up their moving process.After Pod recovers, he goes to explore possible new living quarters. Arrietty goes to bid farewell to Shō, but in the course of the conversation he suggests to her that the Borrowers are becoming extinct. Arrietty tells him fiercely that they will not give up so easily. Shō apologises that he has forced them to move out and reveals he has had a heart condition since birth and will have an operation in a few days. The operation does not have a good chance of success. He believes that there is nothing he can do about it, saying that eventually every living thing dies.While Sadako is out, Haru notices the floorboards have been disturbed. She unearths the Borrowers' house and captures Homily. Alerted by her mother's screams, Arrietty leaves Shō in the garden and goes to investigate. Saddened by her departure, Shō returns to his room. Haru locks him in and calls a pest removal company to capture the other Borrowers alive. Arrietty comes to Shō for help; they rescue Homily and he destroys all traces of the Borrowers’ presence.On their way out during the night, the Borrowers are spotted by the cat Niya. Sleepless Shō goes into the garden for a stroll and the cat leads him to the “river”, where the Borrowers are waiting for Spiller to take them further. Shō gives Arrietty a sugar cube and tells her that her courage and the Borrowers' fight for survival have made him want to live through the operation. Arrietty gives him her hair clip as a token of remembrance. The Borrowers leave in a floating teapot with Spiller.The Disney dubbed version contains a final monologue, where Shawn states that he never saw Arrietty again and returned to the home a year later, indicating that the operation had been successful. He is happy to hear rumors of objects disappearing in his neighbors' homes.","language":"Japanese","Reception":"Arrietty earned $19,202,743 in North America and $126,368,084 in other territories for a worldwide total of $145,570,827.[1] It is the 4th highest-grossing anime film in the United States, and the highest not based on a game franchise.[30]Arrietty debuted at the first position in the Japanese box office.[23] More than one million people went to see the film during its opening weekend.[23] It grossed around 1.35 billion yen that weekend.[23] Distributor Toho announced that as of August 5, 2010, the film managed to gross more than 3.5 billion yen and attracted more than 3.7 million viewers.[11] According to the Motion Picture Producers Association of Japan, Arrietty is the top grossing Japanese film in their box office for the year for 2010; it grossed approximately 9.25 billion yen[3] ($110.0 million).[31]In France, the film was well received by the public. More than 100,000 people watched the film on its debut week in France,[32] allowing the film to gross more than US$1.4 million that week.[33] Overall, ticket sales for Arrietty, le petit monde des chapardeurs in France totaled almost 740,000 between its release on January 12, 2011, and March 1, 2011.[32] In the United Kingdom, the film generated £76,000 ($120,232) in its first weekend.[34]In North America, Arrietty opened on 1,522 theaters, a record for a Studio Ghibli film.[35] The film opened in ninth place with $6.45 million during the 3-day President's Day weekend and went on to earn $8.68 million during the 4-day weekend.[36] This was the largest opening ever for a Studio Ghibli film (beating Ponyo's $3.6 million). The film also scored the best weekend per-theater average in North America for the studio ($4,235 against Ponyo's $3,868).[37] Arrietty closed in theaters on June 8, 2012 with $19 million. In total earnings, its highest grossing countries outside Japan and North America were France ($7.01 million), South Korea ($6.86 million) and Hong Kong ($1.75 million).[38]Arrietty has received very positive reviews from film critics; Rotten Tomatoes sampled 121 reviews and judged 95% of them to be positive.[39] Metacritic, which assigns a weighted average score, rated the film 80 out of 100 based on 28 reviews.[40]Cristoph Mark of The Daily Yomiuri praised the film, calling it \"likely a perennial favorite among children\".[41] He particularly liked the film effects, which he described as \"Drops of water loom large and drip like syrup; the ticking of a clock reverberates through the floor and the theater's speakers; tissue paper is large and stiff...\", adding that these effects gives the audience \"a glimpse into their own world, but from a different perspective\".[41] Mark Schilling of The Japan Times gave the film a rating of four out of five stars, and said that the film \"speaks straight to the heart and imagination of [everyone].\"[42] Schilling also praised the film's animation, saying that [Studio Ghibli animators] are past masters at creating the illusion of presence and depth without [3-D effects].[42] However, he also said that some scenes in the film \"threatens to devolve into the sappy, the preachy, and the slapsticky\" but noted that these scenes were \"mercifully brief\".[42]Steve Rose, the reviewer for The Guardian gave the film four out of five stars and praised the film, describing it as \"a gentle and entrancing tale, deeper and richer than more instantly gratifying fare.\"[43] Rose also described the film as \"the soul food of the animation world,\"[43] however, he did note that this film \"doesn't match previous hits such as Spirited Away or Princess Mononoke in terms of epic scale or adult appeal\", even though it bears many of their hallmarks: bright, detailed animation...\"[43] Deborah Young of The Hollywood Reporter gave a positive review of the film. She said that the film \"remains essentially a film for children\".[44] Young later went on to say that the relationship with Sho and Arrietty \"touches the heartstrings with gentle yearning\", and praised Yonebayashi for its direction.[44] In the opening remarks made by David Gritten of The Telegraph, he said that the film was \"ravishingly colourful and textured\".[45] He also praised the animation, saying that \"animation doesn’t get better than Arrietty.\"[45] Gritten gave the film a rating of 4 stars out of 5 stars.[45] In his review for Special Broadcasting Service, Don Groves gave a mixed review of the film and said that Arrietty was a \"very slender, minor work.\"[46] Groves also criticized the film's storyline, calling it \"a gentle, humourless, uncomplicated tale of friendship in an alien environment.\" However, he praised the voice acting as \"generally is as professional as [one would] expect.\"[46] Groves gave the film a rating of 3.5 stars out of 5 stars.[46]Zac Bertschy of Anime News Network gave the North American version of Arrietty an overall grade of \"B\".[47] Bertschy praised the voice acting in the film and also praised the intricate details of the film's backgrounds, but said that \"there isn't more going on here, even when it comes to the film's basic story\",[47] however, he later went on to say that it is \"foolish to deny the simple, warm, and familiar pleasures of Arrietty's world\".[47] Leslie Felperin of Variety praised the film as \"old school, mostly in a good way.\" She also praised the film for its animation, as well as Yonebayashi's direction. Felperin noted however, that the film lacked its \"approach to storytelling that made Studio Ghibli's other [films] so compelling.\"[48] Manohla Dargis of The New York Times praised the film for its hand-drawn animation and Yonebayashi's direction.[49] Dargis later went on to say that the film has \"a way of taking [the audience] where [they] may not expect.\"[49] Kenneth Turan of the Los Angeles Times described the film as \"beautiful, gentle and pure\".[50] Turan also praised the detail and animation in the film, as well as its storyline.[50] He also praised Karey Kirkpatrick and Gary Rydstrom for their adaptation of the film, as well as their casting decisions for the British and North American versions.[50] Lisa Schwarzbaum, the reviewer for Entertainment Weekly, gave the film a \"B+\" and praised Arrietty for its animation.[51] Schwarzbaum later went on to say that the result is a \"dreamy, soft-edge hybrid, equally interested in observing raindrops and the worries of a race of minuscule beings [the Borrowers].\"[51]","box_office":"$145.6 million[1]","cinematography":"Atsushi Okui","production_company":"Studio Ghibli","directed_by":"Hiromasa Yonebayashi","Music":"\"Arrietty's Song\" is a song performed by French recording artist musician Cécile Corbel. Corbel also performed the film's theme song, \"Arrietty's Song\", in Japanese, English, German, Italian and Breton.Corbel became known to Ghibli filmmakers when she sent them a fan letter showing her appreciation of their films, together with a copy of her own album.[11] After hearing the album of her music she had sent them, they thought they should collaborate with her for the music of this film.[11]The song made its public debut in a presentation of the song by singer Corbel and percussionist Marco in Apple's store in Shibuya, Tokyo, on August 8, 2010.[11] Some of the Japanese theme songs for this film, including \"Arrietty’s Song\" was first released online through the iTunes Store, mora and Musico on December 19, 2009.[12] Subsequently, the official album containing all of the theme songs of this film was released on July 14, 2010.[13] The album's listing on the Oricon charts peaked at the 31st position.[13] Separately, the song \"Arrietty’s Song\" was released as a singles album on April 7, 2010.[14]\"Summertime\" is a song performed by American pop recording artist Bridgit Mendler for the film's North American release. The song was released by Hollywood Records on February 2, 2012.The song premiered on Radio Disney on February 1, with its release on iTunes on February 2, 2012.[17] In an interview with Kidzworld about what the song is about, Mendler said: \"It’s not based on personal experience but I think the whole summertime, kind of cheerful, innocent thing was relatable for the movie and something they liked. The movie is about imagery and there are some good images in that song.\"[18]The music video premiered on Disney Channel on January 10. It was directed by Art Spigel, director of the Disney Channel Games, and was filmed on-location at Disney Golden Oak Ranch in Los Angeles, California.","release_dates":"July 17, 2010 (2010-07-17)|||||","Production":"On December 16, 2009, Studio Ghibli announced Karigurashi no Arrietty as their film for next year.[9] This film is based on the novel The Borrowers by the British writer Mary Norton.[9] The novel won the Carnegie Medal for children's literature in 1953,[9] and had already been adapted into two films and a TV series at the time. Studio Ghibli founders Isao Takahata and Hayao Miyazaki had been contemplating an adaptation of this novel for around 40 years.[2]The director of the film was announced as the animator Hiromasa Yonebayashi on the same day.[9] Hiromasa Yonebayashi was one of the animators for the Studio Ghibli films Howl's Moving Castle, Ponyo, and Spirited Away.[9] He was also the reserve director for the film Tales from Earthsea.[9] Miyazaki was announced as the production planner for the film.[9]The Japanese voice cast of the film was announced on April 13, 2010. Actress Mirai Shida was cast as the voice of Arrietty.[10] Arrietty was Shida's first voice acting role.[10] In addition, Ryunosuke Kamiki, who has voiced characters in other Studio Ghibli films, including Spirited Away, and Howl's Moving Castle was cast as Sho.[10][10]Besides them, the film’s cast includes Tomokazu Miura, Shinobu Otake, Keiko Takeshita, and Kirin Kiki.[10] The four actors have previous voice acting experience, but none of them have been in a Studio Ghibli film before.[10] Miura and Otake were respectively cast as Arrietty's parents Pod and Homily.[10] In addition, Takeshita voiced Sho's aunt and Kiki voiced one of the helpers in the human family.[10]On January 8, 2011, actress and singer Bridgit Mendler was cast as Arrietty for the film's North American release.[8] Besides Mendler, the cast included Will Arnett, Amy Poehler, Carol Burnett, and David Henrie.[7] The film had a different voice cast for the United Kingdom release.[6] The cast included Saoirse Ronan, Tom Holland, Mark Strong, Olivia Colman, Phyllida Law, and Geraldine McEwan.[6]","produced_by":"Toshio Suzuki","starring":"Mirai Shida Ryunosuke Kamiki Shinobu Otake Keiko Takeshita Tatsuya Fujiwara Tomokazu Miura Kirin Kiki","running_time":"95 minutes","music_by":"Cécile Corbel","edited_by":"Keiko Kadokawa Rie Matsubara Hiromi Sasaki Takeshi Seyama","Release":"Arrietty was first released in Japanese cinemas on July 17, 2010, by Japanese film distributor Toho.[21] The film was officially released at a ceremony attended by the film's cast and Yonebayashi.[22] Corbel performed the film's theme song at the event.[22] In addition, Yonebayashi hinted that he wanted the film to beat the record of over 12 million audiences set by previous Studio Ghibli film, Ponyo.[22] The film was screened in 447 theaters throughout Japan during its debut weekend.[23]In the United Kingdom, the film was released on July 29, 2011 by Optimum Releasing.[24] The film was released in the United States on February 17, 2012 by Disney, with the title The Secret World of Arrietty.[24] The North American dub was directed by Gary Rydstrom, produced by Frank Marshall and Kathleen Kennedy and written by Karey Kirkpatrick.A screening of the North American release was held on January 21, 2012 in New York City.[25] The film opened in least 1,522 screens during its general release.[26]Arrietty was released as part of the Studio Ghibli Collection by Disney Japan in both Blu-ray Disc and DVD formats within Japan. The DVD version of the film consists of two discs in the region 2 format. The Blu-ray version consists of a single disc in the Region A format. Both versions were released in Japan on June 17, 2011, and both contain English and Japanese subtitles.[27]StudioCanal (previously known as Optimum Releasing) released the movie on both region 2 DVD and region B Blu-Ray format in the United Kingdom on January 9, 2012. A DVD/Blu-Ray Double Play \"Collector's Edition\" was also released, featuring art cards.[28]The film was released by Walt Disney Studios Home Entertainment on DVD and as a Blu-ray and DVD combo pack on May 22, 2012 in North America.[29]","budget":"$23 million","Merchandise":"Arrietty was adapted into a Japanese manga series.[57] This manga adaptation was first published by Tokuma Shoten Publishing Co., Ltd. within Japan,[57] and was released in four separate volumes.[57] Viz Media released the English version of this manga adaptation of the film within North America in January 2012.[58]"}