{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Peter Sanderson (Steve Martin) is a workaholic tax attorney working for a set of competitive colleagues and bosses while he tries to turn his life around. Having just separated from his wife Kate (Jean Smart) and lost privileges to his children, 15-year-old Sarah (Kimberly J. Brown) and 8-year-old Georgie (Angus T. Jones), tells his wife that the previously planned Hawaii trip will not happen, but he lets them be in their house for some allotted time. While tending to his career, he corresponded with an online friend known only as \"lawyer-girl\". On their first blind date, Peter learns that \"lawyer-girl\" is Charlene Morton (Queen Latifah); a wrongfully convicted felon accused of bank robbery claiming her innocence who wants Peter's help in getting the charges dropped. He kicks her out but then decides to let her stay.The next day as Peter leaves the house to picks up the kids, he tricks Charlene to make her leave, but she breaks back into the house along with her friends. As they drive home, he realizes that Charlene didn't give up on leaving his house and again forces her to leave the house. While Howie Rottman (Eugene Levy) and Peter are waiting to have Peter make a deal promised for Mrs. Virginia Arness, she appears to finally convince him to help her out. Ashley (Missi Pyle), Kate's gold-digging sister, thinks she is here to serve drinks and food. However, Peter makes it seem that she is the nanny of his house since his ex-wife is not with him. Much later, Charlene appears in Peter's office informing him of new evidence. When his associate Sofia (Tracey Jones) told Peter that one of his bosses Mr. Edward Tobias (Jim Haynie) wants to see him, he & Howie try to get her out of there but to no avail as Tobias shows up before them. But the two gentlemen manage to get off the hook when Charlene tells Ed about Peter helping with the financial situation at a church and then leaves. At the golf resort, as Peter plays a round with Mrs. Arness and Howie and Charlene are having a talk, Ashley talks trash and nasty enough for Charlene to get in a fight with her.Later that night, Georgie sits with Charlene as she starts to help him develop his reading skills to impress his dad but by way of an inappropriate magazine Charlene found under Peter's desk. Georgie later goes to Mrs. Kline's house for ladies' poker night. At the same time, Sarah and her friend tricks her father into thinking she's going to dinner with him at his house; but in actuality they're going to a party. Meanwhile, Peter goes out to eat with Charlene and for the first time since the start of his separation, he begins to have fun and then Peter & Charlene dance. But Ashley and Kate, who are also at the restaurant are very scared of the scenario. When they return home, they start having sex, but as a way for Peter to win Kate back. When she brings Georgie back, Mrs. Kline believes he accidentally humped his nanny and the next day, Peter explains the whole situation to his bosses. Later that night by the pool, Charlene is speaking to her old boyfriend Widow (Steve Harris) about another piece of new evidence that could help or hurt Charlene. Then Charlene and Widow reconcile after which Peter confronts her, thinking they were planning another crime. Then Peter convinces Charlene not to have any further visitors. Next, Peter receives a call from Sarah who asks her father if she wants to speak to Charlene. So she does and she asks Charlene to take her home. When Charlene arrives at the house Sarah was in, Sarah informs Charlene that she lied to Peter and actually had a different boyfriend who tried to have sex with her to which Sarah refused. So to teach the boy a lesson, Charlene hangs him by his ankles at the balcony and forces him to tell Sarah that he's sorry and will never try to do it again. As Charlene takes Sarah home, Peter realizes that she was with bad friends but doesn't get angry after Charlene tells him, \"Sarah didn't need a warden, she needed her father.\"The next night Mrs. Arness comes for dinner but on that same night she's there she realizes that Peter has for a nanny, an escaped convict (Charlene), wanted for a murder she did not commit. So she walks out and at the same time, Peter kicks Charlene out. The next day at his firm, Peter fearing that his boss is going to fire him, realizes that Arness didn't call the cops but the FBI. Peter runs out of the firm in terror, but not before Howie asks him to tell Charlene if & when he sees her, this term: \"The cool points are out the window and she's got him all twisted up in the game\". When Peter gets into his car and after adjusting his rear view mirror, he sees Widow in the back. Widow threatens Peter not to reopen Charlene's case nor go anywhere near her. With that threat in his mind, Peter starts his car and drives off, causing Widow to roll out. This makes Peter realize that Charlene really \"is\" innocent and was framed by Widow as he made the case affect him all along as he was in hiding. So he decides to forgive Charlene and tries to call her, but he doesn't know where Charlene is until Sarah tells Peter that Charlene has his cell phone, so he calls her by his house phone. Charlene now knows who set her up and Peter is determined to get a confession. Howie's positive attention begins to get Charlene to be with him. They reach the Arness house but trouble doesn't come due to William Shakespeare (her dog) being tied up and Julia, Arness' assistant out of reach. Todd Gendler (Michael Rosenbaum), Peter's rival & his apparent replacement gets a punch from Charlene for making a negative remark. Back at the house, the kids told their mom about Charlene and try to persuade her to believing that he moved on from the old ways and he doesn't think about himself anymore.Later, we see Peter drive up to \"The Down Low\", the gangster club of Widow's and makes a final confrontation, disguising himself to get in undetected. Widow arrives later and when he sees Peter in disguise, he gets his bodyguards to take Peter in the backroom. The other three (Charlene, Howie and Arness) arrive shortly after. Howie & Charlene figure out a way to save Peter while Arness is having drinks and getting stoned next to two customers. Meanwhile in the room, Peter tells Widow he & Charlene now knows who Widows accomplice was; but Widow tells Peter that there was no accomplice at all, it was just him in disguise. After Charlene calls the FBI, she goes go into the backroom as Peter & Widow came out. Widow throws Peter onto the floor, & then points the gun at both Charlene and Howie. Peter elbows Widow in the groin, causing him to drop the gun. Howie grabs the gun and points it at Widow and his bodyguards, but Peter accidentally nudges Howie and he fires the gun towards the bar, causing everyone to panic and run out the club. Charlene and Widow ensue in a fistfight, but Widow quickly gets his gun off the floor and points it at Charlene. Widow shoots Charlene and she falls on the couch, presumably dead. This angers Howie and he jumps on Widow trying to fight him. Peter goes over to Charlene to grief but Charlene wakes up and pulls Peter's cellphone out of her shirt and reveals the bullet went through the phone, saving her life. The FBI agents come in the club to arrest them. However, Peter has a lot of proof to not only make Charlene's record expunged, but to put Widow away for a long time. Mrs. Arness almost wants no more from Peter, but Peter escorts her to an all-night diner, convincing her to make him her lawyer again.The next day, Gendler tells Ed that he called Arness four times with no success since she said she'll only talk to Peter. The bosses decide to keep Peter around when they see him move out. When Peter, Howie and Sofia move out, Tobias, and his partners are sorry for understanding the new dynamic in Peter but in self-retiring from the firm, he moves out of the office saying, \"Ed, you can kiss my natural black ass!\" At the new office, Charlene thanks him for everything he did with one final appreciated remark and she now leaves Peter to have a good conversation with his wife after they see her walk in. Peter gave the same line Howie gave to Charlene to Kate as a way of asking her to give him a second chance, she does and reconciles once and for all. Their reconciliation was briefly interrupted by Peter's cell phone, but rather than answering, Peter just threw it away and they continued to hug. The end of the film shows Charlene putting braids on Howie's head and she brings down the shade.","language":"English","Reception":"Since the film's release in 2003, Bringing Down the House has received mixed to negative reviews from critics. Review aggregator Rotten Tomatoes currently gives the film a \"rotten\" score of 34% based on 148 reviews, the general consensus being, \"Though the cast shines, they can't save this comedy, which is overly contrived and filled with outdated and offensive racial jokes.\"On a budget of $35 million, the film became a surprise hit. It earned $132.6 million in the United States and an international gross of $32 million, bringing its worldwide gross to $164.6 million.[1] As of March 2009, it is ranked #231 of the All Time Top Grossing USA Motion Pictures.[2]Queen LatifahSteve Martin","box_office":"$164.7 million","cinematography":"Julio Macat","production_company":"Touchstone Pictures Hyde Park Entertainment","directed_by":"Adam Shankman","bringing_down_the_house":"Theatrical release poster","Soundtrack":"A soundtrack containing hip hop and R&B music was released on March 4, 2003 by Hollywood Records. It peaked at 111 on the Billboard 200 and 23 on the Top R&B/Hip-Hop Albums.","release_dates":"March 7, 2003 (2003-03-07)|||||","produced_by":"David Hoberman Ashok Amritraj","starring":"Steve Martin Queen Latifah Eugene Levy Joan Plowright Jean Smart Missi Pyle Betty White","running_time":"105 minutes","music_by":"Lalo Schifrin","edited_by":"Gerald B. Greenberg","written_by":"Jason Filardi","budget":"$33 million"}