{"country":"Canada","distributed_by":"The Hot Ticket","celine:_through_the_eyes_of_the_world":"Theatrical release poster","language":"English French","Critical reception":"Review aggregation website Metacritic, which assigns a weighted mean rating out of 100 to reviews from mainstream critics, gave the film an average score of 52 based on 4 reviews, which indicates \"mixed or average reviews\".[11] Elysa Gardner of USA Today gave the movie 3 stars out of 4. She stated that \"Celine Dion may be responsible for some of the smoothest, most syrupy pop recordings in recent decades, but in concert, she is a pit bull.\" [21] Lauren Carter from Boston Herald gave the film A-. According to her \"the film succeeds because it lets us in on Celine the person as much as Celine the performer.\"[13]Richard Ouzounian of Toronto Star gave the film 3.5 out of 4 stars and said that \"it's more than just a collection of the Quebec singer's greatest hits performed in concert, although there's enough high-energy, nicely shot musical numbers to gladden the heart of any Dionista.\" Also \"what makes this a real surprise and something that should strike a chord with those who aren't necessarily Dion fans, is that it also takes you inside: inside the universe of a superstar tour as it careens around the world, as well as inside the mind, heart and – in one unforgettable scene – even the larynx of Dion.\" In the end, \"if you like Dion, the singer, then you will love Celine: Through the Eyes of the World. But even if you don't, you can't help but be impressed by this fascinating portrait of a superstar trying very hard to keep her feet on earth while her career keeps soaring ever upward.\"[19]Michelle Coude-Lord from Toronto Sun gave it 3.5 out of 5 stars and wrote that \"the movie is a must-see.\" It \"shows Celine as being human, and perfectly depicts the bond between her and Angélil. It connects the public with Dion's words, successes, career heights and her superstardom.\" She also noted that \"Dion's goal was for her world to remain human, real and authentic. Mission accomplished.\"[20] John Griffin of The Gazette said that \"fans die and go to pop heaven with Stéphane Laporte's sympathetic and even candid documentary about our very own superstar's world tour in 2008-09. Non-fans discover her real appeal in Céline: Through the Eyes of the World.\" He gave the film 3 out of 5 stars.[15]Linda Cook of Quad-City Times gave the film 3 out of 4 stars and said that she \"was pleasantly surprised when she realized the movie had her hooked about 15 minutes into the film\". She also said that \"it's mesmerizing to see audiences all over the world singing along in French and/or English, and to see the moment when she was presented with the Legion of Honour.\" She \"enjoyed watching as Celine and her family became tourists in the countries she visited, whether she was taking in the sounds and sights of Africa or Australia. Above all, it's fascinating to watch her music unite the world as audiences from Dubai and Amsterdam sing familiar lyrics.\"[18]Sara Schieron from Boxoffice stated that \"in sum, what you see is a woman and a family that handle celebrity with a unique grace.\" She also said that the \"box office will, no doubt, confirm demand for the movie\" and gave it 3 stars out of 5.[14] According to The Globe and Mail \"you have to admit Dion is the James Brown of her generation - the hardest working woman in showbusiness\".[16] Los Angeles Times wrote that \"rather than capturing a restless star pushing at her own boundaries, Through the Eyes of the World finds Dion sitting pretty, on top of the world and happy to stay there\".[17]","Background and release":"During the Taking Chances World Tour, Dion played concerts in five continents, 25 countries and 93 cities, selling more than three million tickets.[1] Running from February 2008 through February 2009, featuring both Anglophone and Francophone setlists, the tour broke attendance and box office records at venues around the world.[1] In December 2009, Sony Pictures Entertainment announced that their division, The Hot Ticket will bring a special motion picture entitled Celine: Through the Eyes of the World to theaters.[2][3]Intercutting concert performances of Dion's biggest hits with behind-the-scenes footage, the documentary depicts the singer's life during the Taking Chances World Tour, giving fans the unique opportunity to follow Dion everywhere, on stage, backstage, and enjoying free time with her family.[2] It was filmed by Jean Lamoureux and directed by Stéphane Laporte.[2] According to Dion herself, \"This was an amazing world tour, but there's a lot more than just concert footage on this film. I let the cameras follow me everywhere. There are a lot of ups and downs, and it's very personal... and it's definitely the most intimate journey that I've ever shared with my fans.\"[2]Dion promoted Celine: Through the Eyes of the World on The Oprah Winfrey Show on 10 February 2010 and Larry King Live on 15 February 2010.[4][5] She also attended the Miami premiere of the movie on 16 February 2010.[6][7] Starting on 17 February 2010 and for eight days only, fans could enjoy a very limited engagement featured in movie theatres across North America.[8] In addition, Sony Pictures Entertainment released Celine: Through the Eyes of the World in movie theatres in Australia for one week only (18–24 February 2010).[9] The film was also shown in Vue, Odeon and Cineworld cinemas across the United Kingdom in late February 2010.[10]","directed_by":"Stéphane Laporte","Home media":"Celine: Through the Eyes of the World was released on DVD and Blu-ray on 29 April 2010 in Australia and in early May 2010 in Europe and North America.[24][25][1] In the French-speaking countries, it was entitled Céline: autour du monde.[1] Clocking in at three hours, the home version of Celine: Through the Eyes of the World includes an additional hour of footage not seen in the film's limited theatrical run in February 2010.[1] This film came alongside the DVD/CD release of Taking Chances World Tour: The Concert (Tournée mondiale Taking Chances: le spectacle in Francophone countries), which was issued on the same date.[1]A special limited edition deluxe two-DVD set featuring both Celine: Through the Eyes of the World and Taking Chances World Tour: The Concert and a 52-page booklet and fold-out souvenir postcards was also released in mid-May 2010.[1] QVC was also offering Celine: Through the Eyes of the World with a bonus CD, containing tracks which weren't included on the Taking Chances World Tour: The Concert CD: \"I'm Alive,\" \"Fade Away,\" \"Pour que tu m'aimes encore,\" \"We Will Rock You\" and \"The Show Must Go On.\"[26]In Canada, Dion's new DVD releases debuted at the top three on the Nielsen SoundScan's Music Video Chart.[27][28] Celine: Through the Eyes of the World entered at number one, selling 69,000 copies.[27][28] Sales of this DVD achieved the second highest one week total for a music DVD, behind Dion's own, Live in Las Vegas: A New Day... (2007).[27] Tournée mondiale Taking Chances: le spectacle entered the chart at number two with 31,000 units sold, followed by Taking Chances World Tour: The Concert at number three with sales of 8,000 copies.[27][28] This was only the second time since 2004, after Hilary Duff, that an artist has held the top three positions on the Canadian Music Video Chart.[27][28] With over 100,000 copies of all three DVDs sold in one week, Dion set an all-time record for music DVD sales in Canada.[29] On 21 May 2010, CRIA certified all three releases: Celine: Through the Eyes of the World with two-times Diamond award for selling 200,000 copies, Tournée mondiale Taking Chances: le spectacle with Diamond for sales of 100,000 units and Taking Chances World Tour: The Concert with four-times Platinum for selling 40,000 copies.[30][31][32] This made Celine: Through the Eyes of the World, one of the fastest selling double-Diamond certification by a Canadian artist.[28]In the United States, Dion entered the Billboard's Top Music Video Sales chart at numbers one and two with Taking Chances World Tour: The Concert and Celine: Through the Eyes of the World, respectively.[33] She became the first artist other than Bill and Gloria Gaither and the Gaither Vocal Band to manage a double-debut in the chart's two top spots.[33] Taking Chances World Tour: The Concert has sold 26,000 copies in the first week and Celine: Through the Eyes of the World has sold 15,000 units.[34] On 16 July 2010, RIAA certified Taking Chances World Tour: The Concert Platinum for shipping 100,000 copies and Celine: Through the Eyes of the World Gold for shipment of 50,000 units.[35][36] On the Billboard's 2010 Year-End Top Music Video Sales chart, Taking Chances World Tour: The Concert was placed at number ten and Celine: Through the Eyes of the World at number nineteen.[37] According to Nielsen SoundScan, Taking Chances World Tour: The Concert has sold 76,000 copies in 2010 and Celine: Through the Eyes of the World ended the year with sales of 50,000 units in the United States.[38]Celine: Through the Eyes of the World also topped the DVD charts in the United Kingdom, Belgium Wallonia and Belgium Flanders, and reached top ten in many other countries. It was also certified Platinum in France and has sold 17,800 copies there during 2010.[39][40] The DVD was also awarded Gold in Australia in May 2010.*sales figures based on certification alone ^shipments figures based on certification alone","Concert footage":"The following concert performances were included in the documentary. While some showed a full performance, most of the songs were edited and cut short.","release_dates":"16 February 2010 (2010-02-16) (Miami)|||||","Box office":"In Canada, after just two days Celine: Through the Eyes of the World was shown in 81 theatres and entered the domestic chart at number two, earning $240,942. The next week it became number-one domestic movie. It was shown in 89 theatres and earned $476,412. In the third week, it stayed at number one, grossing $309,987 and was shown in 54 theatres. After just three weeks and eight days of screening (17, 18, 20, 21, 22, 25, 27 and 28 February 2010), the movie grossed $1,027,341 in Canada.[22] In Australia, Celine: Through the Eyes of the World earned $213,583 from only 45 screens, with $4,746 per-theater average and became the seventeenth most popular film between 18 and 24 February 2010.[23]","produced_by":"Julie Snyder","starring":"Celine Dion","running_time":"180 minutes"}