{"country":"India","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Tushar Hiranandani","story_by":"Remo D'Souza","Plot":"Suresh 'Suru' Mukund (Varun Dhawan) wants to be a big dancer to fulfill his mother's wish. Vini (Shraddha Kapoor) wants to be the best hip-hop dancer. Childhood friends from suburban Nalasopara, Mumbai, they form a team and participate in a national level competition \"Hum Kisi Se Kum Nahin\" where they are disqualified from the grand finale as their moves are revealed to be copied from the performance act of the \"Philippine All Stars\" and the judges term them cheaters. Everyone departs to search for jobs. Suru returns to work in a bar as a waiter, Vini rejoins a beauty parlour and Vernon (Sushant Pujari) gets back as a delivery boy where, time and again, they are insulted as cheaters. The departure of angry teammates adds injury to insult, and nothing is set to be corrected.Suru hopes to remove the negative tag by planning to win a grandeur hip-hop competition in Las Vegas. One day he watches Vishnu (Prabhudeva) dance in the bar and convinces him repeatedly to be their choreographer. They audition for people and collect the team. They visit the qualifiers in Bangalore, where they are pre-insulted as cheaters, but manage to win it after Vishnu begs the audience for one last chance for the team. Although things are fine, Suru is broken when Shetty Anna (Murli Sharma), the owner of the bar where he is employed, refuses to provide him financial support extending to Rs. 25 lakhs, something he had earlier publicly promised to Suru at the time of the \"Hum Kisi Se Kum Nahin\" finale. However, Vishnu manages to get the money from Crocxz's (Raghav Juyal) uncle who he convinces, after Suru loses hope when Vishnu gets angry at his inability to arrange team funds. Later they prepare to go to Las Vegas, but Vinod (Punit Pathak), a deaf-mute dancer, learns that Vishnu has ulterior motives to go to Vegas, and, as a matter of fact, he had deliberately impressed Suru and friends to procure a way out for his plan. In Las Vegas they win the qualifiers. Later Vishnu leaves the hotel with team money to meet his son Manu (Jineet Rath), whose mother, Swati (Tisca Chopra) is married to another man and has moved on in life. He talks to Manu and leaves with a contented heart.In the meantime, Vini gets injured due to excessive rehearsal and is replaced by Olive (Lauren Gottlieb), and Vishnu discovers this while thanking friend Gopi (Ganesh Acharya), who works in a bar-cum-hotel. . At the same time, Suru is enraged when he finds Vishnu missing and tries to proceed with jam sessions all on his own, but in vain. Vishnu returns while trying to save the day for Suru from the German team as they get into a fight, later admitting he had made a 'mistake' leaving without permission although he didn't want to lose a family he had yearned to create in years, apologizes, is forgiven by Suru, and the team enters the finals. Across rehearsals, Olive gets close to Suru and a jealous Vini tells Suru she loves him. Although Olive has feelings for Suru, an in-person conversation with Vini assures Olive that Suru had that inherent charm with nothing to do about his sweetness, and she agrees to continue with the Indian Stunners after Vini recovers. The team enters the final, where Vinod's health worsens during a fictitious assemblage and the Indian Stunners end up making this grave mistake in the formation only to fall down, since D (Dharmesh Yelande) knew about Vinod's tuberculosis problem. Everyone has almost given up after the accident, when Vinod convenes his fault to Suru, who forgoes it and the others return to make the formation with success with Vinod at the bottom. Though they don't win the competition as the German team won the competition, they do win the hearts of millions, with Suru lending a voiceover narrative about his mother's motivational lessons on dance.","language":"Hindi","abcd_2":"Theatrical release poster","Critical reception":"Meena Iyre from The Times of India gave it 3 out of 5 stars stating the film raises the bar from its first part.[13] Sukanya Verma of Rediff liked the choreography but thought that \"because of its poorly paced beginning, ABCD 2 feels a bit of stretch at 154 minutes.\" She gave the film 2.5 out of 5 stars.[14] Rajeev Masand of CNN-IBN also gave the film 2.5 out of 5 stars writing that the film \"makes up for its amateurish storytelling with its often jaw-dropping set pieces and the sheer hard work of its leads. Varun and Shraddha are so earnest, you're willing to forgive their less-than-convincing histrionics because their dancing – particularly Varun's – is mighty impressive. Both actors hold their own against the professionals without losing face.\"[15]The film got a negative review from Shubhra Gupta of The Indian Express who gave it 1.5 out of 5 stars. She wrote \"A dance movie needs to electrify. That's missing in this Shraddha Kapoor, Varun Dhawan starrer\".[16]","cinematography":"Vijay Arora","production_company":"Walt Disney Pictures UTV Motion Pictures","directed_by":"Remo D'Souza","Soundtrack":"The soundtrack of ABCD 2 is composed entirely by Jigar Saraiya and Sachin Sanghvi, while the lyrics were written by Mayur Puri, Badshah, Rimi Nique, D. Soldierz and Priya Saraiya.[12] The audio album was released on 22 May 2015. For the year 2015-16, Disney-UTV had decided to sell out the music rights to Zee Music Company. The film's soundtrack is the first step in the series.","release_dates":"19 June 2015 (2015-06-19)|||||","Filming":"ABCD 2 was shot in Mumbai, Bangalore and Las Vegas.[5] the shooting was finally over in March 2015.[6] The young-talented French duo Les Twins (Laurent and Larry Bourgeois) were also roped in for a special freestyle dance in the song \"Tattoo\".[7][8]","produced_by":"Siddharth Roy Kapur","starring":"Prabhu Deva Varun Dhawan Shraddha Kapoor","running_time":"154 minutes","music_by":"Sachin-Jigar","edited_by":"Manan Sagar","Release":"The film was released by Walt Disney Studios Motion Pictures on 19 June 2015.[9] However, the film's choreographer & director Remo D'Souza wanted to pre-release it on 18 June 2015 due to the beginning of the Muslim holy month of Ramadan.[10] He stated, We just come to know that the Holy month of Ramadan starts on 19 June, the day we have scheduled the release of ABCD2. I've been receiving so many emails and messages from my Muslim friends requesting not to release on that day, as they would be unable to go for the film.[11]"}