{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Tom Turner, a con artist, is arrested for working cons, something he is doing to pay off his gambling debt to a loan shark. He is sentenced by the judge to find a full-time job by the end of the year and keep it, or be sent to jail.Tom finds work at the post office sorting mail in the dead letter office. Surrounded by quirky coworkers, Tom finds out what happens to letters addressed to the Easter bunny, Elvis, and God, and out of curiosity reads one of the letters sent to God. While reading the letter, sent by a needy single mother, Tom accidentally drops his paycheck; it is mailed back to the single mother. When Tom comes to retrieve his paycheck, he sees the good it has done and leaves, not knowing that a burnt-out workaholic lawyer coworker has seen him doing so.Believing Tom sent the money on purpose, the co-worker rallies the rest of the dead letter office workers to continue what Tom has started. Tom, becoming the unwilling leader of the group, starts answering more and more letters sent to the post office asking God for help. Hilarity ensues as the group answers more prayers, enriching people's lives, while Tom tries to find love with a coffee bar waitress and keep out of jail.","language":"English","Reception":"Dear God received generally negative reviews from critics. Siskel & Ebert gave the film two thumbs down upon its release.[2] James Berardinelli gave the film one star and explained, \"At least after seeing this movie, I understand where the title came from – starting about thirty minutes into this interminable, unfunny feature, I began looking at my watch every few minutes and thinking, 'Dear God, is this ever going to end?' A sickeningly bad pastiche of much better pictures – It's a Wonderful Life, Miracle on 34th Street, and (believe it or not) Spartacus all leap to mind – Dear God is the worst excuse for a holiday film since Nora Ephron's hideous Mixed Nuts.\"[3] As of August 2010, film review aggregator Rotten Tomatoes had given the film a 12% positive rating, based on reviews from 33 critics.[4]","dear_god":"Theatrical release poster","box_office":"$7,138,523[1]","cinematography":"Charles Minsky","directed_by":"Garry Marshall","release_dates":"November 1, 1996","produced_by":"Mario Iscovich","starring":"Greg Kinnear Laurie Metcalf Maria Pitillo Tim Conway Hector Elizondo Jon Seda Roscoe Lee Browne","running_time":"112 minutes","music_by":"James Patrick Dunne Jeremy Lubbock","edited_by":"Debra Neil-Fisher","written_by":"Warren Leight Ed Kaplan","budget":"$22 million"}