{"country":"United States","distributed_by":"Columbia Pictures","armed_and_dangerous":"Theatrical release poster","Plot":"Officer Frank Dooley (John Candy) of the LAPD is framed for the theft of a television set by two corrupt detectives (who Dooley had actually caught robbing an appliance store). He is dismissed from the force, but escapes criminal punishment at his day in court. The next case in the courtroom features hapless defense attorney Norman Kane (Eugene Levy) attempting to defend a Charles Manson-type white supremacist leader named Lawrence Lupik (Glenn Withrow), who threatens him with death should Kane fail to keep him out of prison. A fearful Kane reveals his ineptitude and the death threat to the judge (Stacy Keach, Sr.), who tells Kane that he will give Lupik \"A sentence so long he won't even remember his own name, let alone yours\" so long as Kane agrees to find another line of work with a \"lot less responsibility\".Dooley and Kane meet for the first time when they both apply for work at Guard Dog Security, a low-rent firm run by gruff \"Captain\" Clarence O'Connell (Kenneth McMillan) and part of a security guard's union requiring heavy $15 a week contributions that is represented by Clyde Klepper (Jonathan Banks) and Tony Lazarus (Brion James). Becoming licensed armed security guards after a single afternoon of training, Dooley and Kane are made partners by Guard Dog supervisor Maggie Cavanaugh (Meg Ryan) and assigned to night duty at the Carlex Pharmaceutical Company's warehouse. After being loudly ordered to take a lunch break by senior guard Bruno (Tom Lister, Jr.), Kane happens upon an armed robbery of the warehouse and quickly calls over the radio to Frank for help, but they prove no match for the thieves (Klepper and Lazarus in ski masks) who used machine guns. Kane unwittingly escapes into the \"Annex\" where Bruno had told them to stay away from as it was guarded by the K9 Patrol (Rottweiler's and Doberman's). In there he is chased by the dogs until Frank shows up and fights them off with unusual tactics, including biting one and punching another.The next day, the pair are berated and fined $100 each by O'Connell for their screw up in not nabbing or identifying the thieves despite their contention that they had machine guns and were wearing ski masks. This leaves them suspicious of the company as they hadn't done anything to warrant the hefty fine (almost a week's pay). When Maggie asks about the meeting afterwards, both men vent their anger about O'Connell (Dooley calls him a jerk while Kane calls him a \"Sub-human, moronic, poop head\"), only to be informed by Maggie that O'Connell is actually her father.Dooley and Kane then attend a meeting of the union, where after getting turned down in their plea to have the fine revoked and it being revealed that Klepper and Lazarus work for union president Michael Carlino (Robert Loggia). Kane pointedly questions Carlino about how the union dues each member is required to pay are spent (roughly $4 million per year). After Kane rejects an evasive answer from Union treasurer Lou Brackman (James Tolkan), an enraged Carlino threatens to break Kane's legs should he ever attend another union meeting and then abruptly adjourns the meeting. Over the next few days, Dooley and Kane find themselves assigned to work at a landfill and a toxic waste dump, causing both to come to the conclusion that the assignments are the result of Kane speaking out at the union meeting.Convinced something illegal is afoot after hearing a similar story from two fellow burned-out security guards about a robbery that happened three weeks earlier at another warehouse, the pair track down Bruno at his gym and interrogate him. With the threat of heavy weights crashing down on his head, Bruno confesses that it was O'Connell who had him order them to lunch the night of the robbery. Dooley and Kane flee from the gym and get away from the enraged Bruno.The pair then visit an old friend of Dooley's, a retired thief and criminal informant named Cappy (Tony Burton) to get information on Carlino. Upon learning of Carlino's corruption (which cost Kane a week's pay in bribes for information as Cappy wouldn't take money from Dooley), they bring their suspicions to Maggie, but she rejects them as having no evidence to back them up.Dooley and Kane next attend a party thrown by Carlino in hopes of gathering some evidence. Eavesdropping on a meeting between Carlino and Brackman, they learn of Carlino's use of the pension fund to finance dealings with a Colombian drug cartel and his plans to have the money robbed from an armoured car, with insurance covering the loss. Fearing an investigation by the insurance company in which he will be the fall guy for turning the fund into cash, Brackman urges Carlino not to go through with the robbery. In response, Carlino instructs Klepper and Lazarus to dispose of him. Dooley and Kane attempt to save Brackman, but are too late to prevent his murder and instead find themselves framed for his death.After a night spent evading the police while dressed as an outlandish gay couple, the two make plans with a now receptive Maggie (who was also at the party and knew they did not kill Brackman as Carlino claimed) to prevent the armoured car robbery. Kane and Maggie take over driving the truck, while Dooley plans to meet them ahead of the would-be robbers.On the 6th Street Bridge, Dooley has problems with his motorcycle and is forced to hitch a ride with The Cowboy (Steve Railsback), a wild trucker who eagerly disobeys traffic laws and uses his truck to ram his way through a traffic jam (while hauling rocket fuel). Meanwhile, Kane and Maggie avoid assaults from multiple cars attempting to hold them up. With The Cowboy's help, Dooley is able to arrive in time to save the armoured car from a guided missile strike and foil a final attack from Klepper and Lazarus with his illegal .50 caliber handgun (Dooley tells The Cowboy that they only used the gun to hunt Buffalo \"up close\", and that its only legal in two states, but California wasn't one of them). O'Connell, a willing partner of Carlino's, no longer willing to abide the scheme after Carlino threatened to hurt Maggie if he didn't co-operate with the robbery, arrives having captured Carlino and his associates, the two detectives who originally framed Dooley and had him thrown off the police force.The criminals are arrested and Dooley is invited back to the police force as a plain clothed Detective, along with a reluctant Kane who wanted to go back to the relative safety of being a lawyer.","language":"English","box_office":"$15,945,534[1]","cinematography":"Fred Schuler","directed_by":"Mark L. Lester","Soundtrack":"The album features mainly R&B artists, and it was produced by Maurice White and Bill Meyers.","release_dates":"August 15, 1986 (1986-08-15)|||||","produced_by":"Brian Grazer James Keach","starring":"John Candy|Eugene Levy|Robert Loggia|Kenneth McMillan|Meg Ryan|","running_time":"88 minutes","music_by":"Bill Meyers","edited_by":"Daniel P. Hanley Mike Hill Gregory Prange","Release":"The film opened in the United States on 15 August 1986.","written_by":"Brian Grazer James Keach Harold Ramis Peter Torokvei","budget":"$12,000,000"}