{"country":"United States United Kingdom Spain","distributed_by":"Warner Bros.","screenplay_by":"John Briley Cary Bates Mario Puzo","story_by":"Mario Puzo","Plot":"The titular Genoese navigator overcomes intrigue in the court of King Ferdinand and Queen Isabella of Spain and gains financing for his expedition to the West Indies, which eventually leads to the discovery of the Americas.","christopher_columbus:_the_discovery":"Theatrical release poster by John Alvin","language":"English","Reception":"The film was not a commercial success, debuting at #4,[9][10] but ultimately bombed, grossing $8 million against its $45 million budget.Critically, the film received mostly negative reviews,[11][12] with a rotten 7% rating on Rotten Tomatoes based on 29 reviews.[13] Brando's performance in particular was singled out as his \"worst\".[14]","box_office":"$8,251,071","Home video":"The film was released on VHS format from Warner Home Video. It has not been released on DVD in North America, but is available in other format regions on DVD.","cinematography":"Alec Mills","directed_by":"John Glen","Awards":"It won one Golden Raspberry Award Worst Supporting Actor – Tom Selleck, and was nominated for another five, including; Worst Picture, Worst Supporting Actor – Marlon Brando, Worst New Star – Georges Corraface, Worst Screenplay – Mario Puzo and Worst Director – John Glen.","release_dates":"21 August 1992","Production":"Timothy Dalton and Isabella Rossellini, originally chosen to star in the picture, backed out when director George Pan Cosmatos was replaced by John Glen shortly before shooting began.[7] Dalton later filed a suit against the producers for breach of contract and fraud.[8] Glen had previously directed Dalton in both of his appearances as James Bond: The Living Daylights and Licence to Kill.","produced_by":"Alexander Salkind Ilya Salkind[1]","starring":"Marlon Brando|Tom Selleck|Georges Corraface|Rachel Ward|Robert Davi|Benicio del Toro|","running_time":"120 minutes","music_by":"Cliff Eidelman","edited_by":"Matthew Glen","budget":"$45 million[2]"}