{"all_about_the_benjamins":"Theatrical release poster","distributed_by":"New Line Cinema","Plot":"Tyson Bucum (Ice Cube), a maverick bounty hunter, is out to capture a petty drug dealer, Lil J (Anthony Michael Hall). Bucum confronts Lil J in his trailer home and nearly handcuffs him, but Lil J's girlfriend, who wields a shotgun, recklessly shoots at Bucum. Bucum manages to tackle Lil J's girlfriend and arrest Lil J. Bucum's boss Martinez (Anthony Giaimo), however, is not pleased with Bucum and pays him less than expected. After a brief conversation about the lottery with his attractive co-worker Pam (Valerie Rae Miller), Bucum learns from Martinez that he must capture a con man named Reggie Wright (Mike Epps), whom Bucum has captured three times prior. Bucum sees Reggie at a convenience store but fails to catch him. Meanwhile, during a photoshoot, diamond thieves Julian (Roger Guenveur Smith) and Ursula (Carmen Chaplin) are posing as a photographer and model until a Mr. Barkley arrives. The duo murder the co-photographer, the makeup artist and Barkley's bodyguards, much to Barkley's surprise. Barkley is then shot in the head after a brief dialogue with Julian for murdering the witnesses. They then retrieve diamonds from the shoot. Bucum catches at Reggie again and chases him until he remains unnoticed since he is hidden in a van. The thieves comes down, shoots at Bucum and escapes, unbeknownst to them that Reggie is hidden. In a boatyard, the thieves finds Reggie in the van and shoot at him when he escapes, leaving his wallet behind, which is picked up by Juilian. At the crime scene, Martinez is fed up of Bucum's attempts and orders him to stay away from Reggie.In Reggie's apartment, Reggie and his girlfriend Gina (Eva Mendes) eventually win the lottery, only to find out that Reggie lost the latter, which was in Reggie's wallet. In the boatyard, Julian and Ursula are yelled at by their boss Williamson (Tommy Flanagan), who takes out his anger by shooting Julian in the arm, severely wounding him and leading to an arm brace. Reggie is soon captured by Bucum during an attempt to retrieve his wallet and while in the car, Reggie manages to convince Bucum to find his wallet and find the thieves. At the boatyard, Bucum and Reggie realizes that the van is unclear of its location, so Bucum tries to find the thieves while Reggie is handcuffed to his bed with Gina. Julian, in a psychopathic estate, searches told to assassinate Reggie. He arrives at the apartment, and is knocked unconscious by Bucum. The duo then decides to torture Julian into answers by pending a screwdriver into Julian's arm brace, which can rip through his skin. Julian then reveals Williamson's name. Bucum awaits in the boatyard of Williamson's boat dealership and poses as a costumer. This soon fails, so the duo decides to go to the Barkley residence. At the house, they find a dead Mrs. Barkley, a man named Roscoe who was the one who murdered Mrs. Barkley, and attacks Bucum (only to be knocked out by Reggie) and eventually find the diamonds. They return to Bucum's apartment and discover that Williamson has kidnapped Gina.In response, they roll a car into Williamson's boat dealership with Julian and Roscoe, tied up and gagged in the trunk. Willamson finds a tape recorder that informs him to meet Reggie and Bucum at a dog track with Gina to exchange for the diamonds. This goes successful with Pam posing as a janitor, Reggie revealing the diamonds, and Bucum taking position as sniper in a dog tracksman disguise to take out a sniper working for Williamson until Reggie flips the diamonds off of Williamson's hands leading to a shootout and chase. During the chase, Williamson pulls out a bazooka and opens fire, missing Bucum, Reggie, Gina and Pam but instead blowing up a nearby fish truck. He escapes, and Bucum and Reggie are so fed up with the plan that they decide to break up their partnership . Pam convinces Bucum to talk to Reggie and they make up again. The duo leads to a boat dock in which Gina and Pam await behind them. Bucum gives Reggie a taser since Reggie accidentally dropped one of Bucum's guns into the ocean. On the boat, when Bucum leaves since he sees Pam and Gina running away, Reggie finds his wallet but is soon caught by Williamson and Ursula and he even forces Reggie to take his money on the boat. Bucum, taking Ursula as a hostage, catches up with them. Williamson, in response, kills Ursula by shooting her in the head and wounds Reggie, leading to a fight as the boat speeds up. Williamson is knocked out by the boat's speed and crashed ancessory, breaking his neck. Bucum and Reggie reunite until Williamson, badly injured, attacks Bucum when Reggie tases him and Bucum shoots Williamson to death. Later, Bucum and Reggie are figuring out what to do next but the coast guards are coming, and Bucum is forced to handcuff Reggie and hide the money.Six weeks later, Reggie is released from prison, and Bucum, who has a new car and spending money along with Gina and Pam, shows Reggie the ticket. The film ends as the quarter, along with two elderly con associates of Reggie, skiing on the boat through the ocean.","language":"English","box_office":"$26,306,533[1]","production_company":"Cube Vision Productions","directed_by":"Kevin Bray","Response":"Upon initial release, All About The Benjamins received generally negative reviews from critics & audiences. As of December 16, 2014, based on 76 reviews collected by the review aggregator website Rotten Tomatoes, All About the Benjamins has received an overall rating average of 30%, with an average score of 4.3 out of 10.","Soundtrack":"A soundtrack containing hip hop and R&B music was released on February 19, 2002 by New Line Records. It peaked at #65 on the Billboard 200 and #12 on the Top R&B/Hip-Hop Albums.","release_dates":"March 8, 2002 (2002-03-08)|||||","produced_by":"Matt Alvarez Ice Cube","starring":"Ice Cube Mike Epps Eva Mendes Tommy Flanagan Carmen Chaplin Valarie Rae Miller Roger Guenveur Smith Anthony Michael Hall Lil' Bow Wow","running_time":"98 minutes","music_by":"John Murphy","written_by":"Ice Cube Ronald Lang","budget":"$15 million"}