{"country":"United States","distributed_by":"New Line Cinema","Plot":"In 1979, Jimmy Bones (Snoop Dogg) is a numbers runner who is respected and loved in his neighborhood as its respected member and protector. When he is betrayed and brutally murdered by corrupt white cop Lupovich (Michael T. Weiss) and drug pusher Eddie Mack (Ricky Harris), Bones' elegant brownstone building becomes his own tomb, and is closed.The timeline flashes forward to 2001, where the neighborhood has become a black ghetto and Jimmy's brownstone building is a condemned ruin. Four teens, Patrick (Khalil Kain), his brother Bill (Merwin Mondesir), their white step-sister Tia (Katharine Isabelle) and their best friend Maurice (Sean Amsing), buy the property and they want to renovate it as a nightclub. In the process, Tia finds a black dog who is actually the spiritual manifestation of Jimmy's tortured spirit. As the dog starts to eat, Jimmy is slowly resurrected.Patrick meets Pearl (Pam Grier), Jimmy's old girlfriend, and her daughter Cynthia (Bianca Lawson). Patrick develops a romance with Cynthia. Patrick wanted to open a nightclub at the old ghetto neighborhood in hopes of making the neighborhood great again, and also to make a profit. While exploring the basement, Patrick, Cynthia, Bill, Tia and Maurice find Jimmy Bones' body and they realize that he was actually murdered. Patrick, Cynthia, Bill, Tia and Maurice decide to keep Jimmy's murder quiet or they won't be able to open the nightclub and they bury the remains.Later, Jeremiah (Clifton Powell) (who is Patrick and Bill's father as well as Tia's stepfather), finds out about Patrick and the gang's plan to open the club at Bones' old building. He freaks out and demands that Patrick and the others leave the building. Patrick, Bill and Tia refuse his request and open the nightclub, in spite of their father's objections. On opening night Maurice is lured into an upstairs room where he is mauled to death by the spiritual black dog.Once he is fully resurrected , Jimmy sets the club on fire and is intent on getting revenge on those responsible for his death, those who betrayed him, and anyone who gets in his way. Pearl and her neighbor felt that they should have burned the building down a long time ago. After the incident, Pearl admits to Cynthia that Jimmy Bones is her father, as she had a relationship with him.Patrick confronts his father Jeremiah and demands to know if he murdered Jimmy Bones 22 years ago. His father admits he betrayed Jimmy Bones to make money to leave the neighborhood. Also, he got fed up living in Bones' shadow and he wanted to be as popular and successful as him. Jeremiah allowed drugs into the neighborhood as long he got paid for it. Later, Eddie Mack is having sex with his white girlfriend Snowflake (Erin Wright). With Mack being one of the people who betrayed him, Jimmy confronts him after murdering Snowflake and stuffing her body in a trash bin. Jimmy decapitates Mack and does the same to Lupovich, but keeps their heads alive to transport their souls.Pearl, knowing that Jeremiah is next, goes with Cynthia to his house to rescue him. They ending up being too late. Pearl, Cynthia, Patrick, Bill, Tia and Jeremiah's wife Nancy (Lynda Boyd) watch him get dragged off by Jimmy, leaving nothing but a melted hole in the window. Jimmy brings Jeremiah back to the building, along with the heads of Lupovich and Mack. Jimmy sends Lupovich and Mack to hell for all eternity while Jeremiah begs for his life.Patrick, Cynthia, Bill, and Pearl go underground to find that Jimmy Bones' body has disappeared. Pearl tells them that in order to put Jimmy to rest, they have to destroy the dress she wore the night Jimmy was murdered which was buried alongside him as his blood which splattered onto it still contains his spirit and is the only thing keeping him anchored to the world of the living. As they look for Jimmy, Pearl steps in the elevator which closes and goes up. Meanwhile, Jeremiah asks Jimmy what he wants. He asks Jeremiah if he could give him his life back. When Jeremiah says no, Jimmy sends him to hell for eternity.Pearl gets off the elevator and walks into a room that is filled with ignited candles. She has a flashback and Jimmy appears, and puts the bloody dress on her. Patrick, Cynthia, and Bill head to the second floor where they see a ghostly Maurice, who leads Bill in the wrong direction where he is captured and killed. Patrick tries to reach him but is too late.Patrick and Cynthia make their way to the room where Pearl and Jimmy are at. Patrick knows it's a trap. As Cynthia is lured to Pearl and Jimmy, Patrick hears his father's voice in a mirror begging for help. When Patrick hesitates, Jeremiah chokes him. Patrick uses his knife to chop Jeremiah's arm off and he disappears into hell. Patrick goes after Jimmy, who disappears and reappears behind Patrick's back much more demonic-looking. He grabs Patrick by his throat, as Cynthia begs him to let go. Pearl, realizing what is happening, tells Jimmy she loves him before grabbing a candle and setting fire to the dress while still wearing it.As Jimmy and Pearl both die together, Patrick and Cynthia make their escape, barely making it out before the entire building collapses. Outside, Patrick finds an old picture of Jimmy and Pearl as Jimmy's face turns to him and says \"Dog eat dog, boy.\" Too late, Patrick realizes that as his daughter Cynthia has Jimmy's blood within her, and turns around as Cynthia, now possessed by Jimmy smiles at him and, vomits a mouthful of maggots into his face.","language":"English French Spanish","Reception":"The film received generally negative reviews and has a 21% rating on Rotten Tomatoes based on 66 reviews with an average rating of 3.8 out of 10 with the consensus \"Slow to start, the sleek looking Bones is more silly than scary.[2] The film also has a score of 42 on Metacritic based on 21 reviews.[3]The film opened at #10 at the U.S. box office, earning $2,823,548 in 847 theaters its opening weekend averaging $3,333 per theater. It ended up earning $7,316,658 domestically and $1,062,195 internationally for a total of $8,378,853, falling short of its $16 million budget.[1]","box_office":"$8,378,853[1]","cinematography":"Flavio Labiano","directed_by":"Ernest Dickerson","Soundtrack":"The soundtrack to the film was released on October 9, 2001 on Doggystyle Records and Priority Records. It peaked at #39 on the Billboard 200, #14 on the Top R&B/Hip-Hop Albums chart and #4 on the Top Soundtracks chart.","bones":"Theatrical release poster","release_dates":"October 26, 2001 (2001-10-26)","produced_by":"Rupert Harvey Peter Heller Lloyd Segan","starring":"Snoop Dogg Pam Grier Khalil Kain Clifton Powell Bianca Lawson Katharine Isabelle Michael T. Weiss","running_time":"96 minutes","music_by":"Elia Cmiral Snoop Dogg","edited_by":"Michael N. Knue Stephen Lovejoy","written_by":"Adam Simon Tim Metcalfe","budget":"$16 million[1]"}