{"based_on":"Journey's End  by R. C. Sherriff","Cast":"(Name in brackets for the equivalent character in Journey's End.)","country":"United Kingdom France","distributed_by":"EMI Films (UK)","Popular culture":"The song \"Aces High\" by Iron Maiden is named after and inspired by the film, although takes place during the Second World War, whereas the film takes place in the First World War. Iron Maiden frequently name songs after war films.[citation needed]The episode of Blackadder Goes Forth titled \"Private Plane\" reuses scenes from the film during the flying sequence.[citation needed]","screenplay_by":"Howard Barker","Plot":"In a one-week timeframe, life at the front in a RFC squadron is documented. The real story begins a year before with fighter ace Major John Gresham (Malcolm McDowell) speaking to a class of pupils at Eton College in October 1916. One year later, a new recruit arrives at Gresham's base in France, 2nd Lt. Croft (Peter Firth). Gresham had been his house captain at Eton and is also the boyfriend of his older sister. Gresham already relies on alcohol to cope with combat stress and continue flying. Now the strain of being responsible for this young recruit (a potential brother-in-law) is an additional burden. Croft has to learn how to survive not only in the air but on the ground as well as he makes some minor mistakes in squadron etiquette.Croft's week of rapid rite of passage from naive schoolboy to adult fighting soldier takes place. His initial hero worship of Gresham crumbles as he learns the realities of service at the front, yet he regains a respect for Gresham and the stresses he has to cope with.When Croft finally scores his first air victory and seems to have made the leap in skills necessary to survive, he is suddenly killed in a collision with a German aircraft. While looking out of his office window, Gresham sees an apparition of Croft returning from the battle field uninjured, which fades away. Gresham then orders for the new recruits to be sent in for his inspection.","language":"English","Reception":"Film historian Michael Paris saw Aces High as another of the period films that attempted to \"de-mystologise\" warfare. [5] Film archivist and historian Stephen Pendo saw the \"good aerial photography by Gerry Fisher\" as the strength of a film that played more as \"standard fare\".[6]","cinematography":"Gerry Fisher","production_company":"S. Benjamin Fisz Productions Les Productions Jacques Roitfeld","directed_by":"Jack Gold","aces_high":"Original British film poster","References":"NotesCitationsBibliography","release_dates":"19 May 1976 (1976-05-19) (UK)|8 June 1977 (1977-06-08) (France[1])||||","Production":"The film's exterior scenes were mainly shot in Southern England and Spain, while indoor scenes were made at Pinewood Studios, St Katharine Docks and Eton College, with principal photography shot at Booker Airfield, High Wycombe, Buckinghamshire. [3] The squadron depicted is loosely based on No. 56 Squadron, one of the notable S.E.5 squadrons. The airfield facilities, barracks and motor transport are authentic looking First World War era equipment and the aircraft flown, although not real S.E.5s but converted Stampe SV.4s, similar enough and the camouflage used authentic. There is a real Avro 504 used in the film. [Note 1][4] A Fokker E.III Eindecker reproduction makes an anachronistic appearance when it is brought down intact and its pilot given a toast by his British counterparts. This Eindecker reproduction may be the same replica that appeared in Crooks and Coronets in 1969.","produced_by":"Benjamin Fisz Jacques Roitfeld","starring":"Malcolm McDowell Christopher Plummer Simon Ward Peter Firth","running_time":"114 minutes","music_by":"Richard Hartley Carlo Rustichelli","edited_by":"Anne V. Coates","budget":"₤1,250,000[2]"}