{"country":"United States","distributed_by":"Miramax Films","Plot":"Shane O'Shea (Ryan Phillippe) is a young Jersey man, handsome enough to become a bartender at Studio 54. There he befriends aspiring singer Anita (Salma Hayek) and her husband, Greg Randazzo (Breckin Meyer). Shane gets sucked into the hard-partying scene at Studio 54, as his life spirals downward, so does It.","language":"English","box_office":"$16.8 million[2]","cinematography":"Alexander Gruszynski","directed_by":"Mark Christopher","Home media":"The 2012 Blu-ray release features several additional and alternate scenes that were not included in the theatrical release. This extended cut runs 100 minutes, 8 minutes of which are not in the studio's 92 minute release. A 105-minute director's cut, restoring 44 minutes of original footage and deleting all but a few seconds of the studio-dictated reshot footage, was screened in the Panorama section of the 65th Berlin International Film Festival in February 2015.[7] Miramax and Lionsgate Home Entertainment released 54: The Director’s Cut in digital HD on streaming video providers on June 2, 2015.[8]On May 24, 2016, 54: The Director's Cut was released on Blu-ray and currently available on Amazon.[9] This Blu-ray is garnering positive reviews on the Home Theater Forum [10]","release_dates":"August 28, 1998 (1998-08-28)|||||","Production":"Based on two short films he had made, Mark Christopher persuaded Miramax Films to back a full-length feature about Studio 54. He had spent five years researching the club and the time period, as well as working on a screenplay. Miramax purchased a partial screenplay in 1995 and developed the script with the filmmaker for over a year. Christopher shot the film in Toronto over two months in the fall of 1997. During the production, a Miramax executive was often found on the set and studio head Harvey Weinstein flew up from New York to give his approval.In the 1998 version, expectations were high with the hopes that the film would become a big summer hit. Christopher finished his cut of the film and the studio scheduled the film's release for July of the following year. After initial positive reaction within the company, early test screenings for the two-hour cut of the film were disappointing to the studio. Audiences found the characters unlikable and reacted negatively to the kiss between Shane and Greg. They also did not respond well to the happy ending for both of them and Anita.[3] Miramax requested cuts be made and Christopher initially refused.The studio forced Christopher to reshoot parts of his movie with only two months until its theatrical release, destroying the love triangle subplot between the three characters. Much of the cast was called back for two weeks of additional filming in New York without being told what they would be shooting. Meyer, for example, found out that his substantial part in the film had been cut down to a stereotypical best-friend role and a new scene was shot that portrayed his character as a thief. The kiss between Greg and Shane was replaced with a conversation. Ultimately, 45 minutes of the original film were deleted and replaced with 25 minutes of new scenes and voice-over.17 years later, Christopher had the opportunity to delete the reshoots, record a simple new opening voice-over with Phillippe (a cinematic first for an actor and director) and reinstate over 40 minutes of original material. Christopher and his director's cut producer, Jonathan King, believed that the film had merit and a fan base. Miramax finally gave the director's cut the green light in 2014.","produced_by":"Ira Deutchman Richard N. Gladstein Dolly Hall","starring":"Ryan Phillippe Salma Hayek Neve Campbell Mike Myers Sela Ward Breckin Meyer","running_time":"93 minutes 105 minutes (Director's cut)","music_by":"Marco Beltrami","edited_by":"Lee Percy","Critical reaction":"54 opened at #4 in its opening weekend (August 28–30, 1998) with $6,611,532 behind Blade, There's Something About Mary, and Saving Private Ryan.[4]The studio cut of the film received almost universally poor reviews and was a box office disappointment, grossing $16 million on an estimated budget of $13 million. Mike Myers, in his first serious dramatic role, garnered some of the film's only positive word-of-mouth. That generated brief buzz that his performance would land him among those nominated for an Academy Award (though he ultimately was not nominated, he was nominated for a New York Critics Circle Award until the critics viewed the recut of the film). In the 1998 version, many critics were particularly disappointed with the film's fictional characters and storyline, believing that Studio 54's notorious, real-life past should have been explored more in detail and with better realism. Critical response to the Director's cut, which has gained a substantial amount of cult status, is positive.The film currently holds a 15% 'Rotten' rating on Rotten Tomatoes based on 65 reviews, with the consensus \"Poor plot development and slow pacing keep 54 from capturing the energy of its legendary namesake.\"[5]The film was nominated for two Razzie Awards, including Worst Actor for Ryan Phillippe[6] and Worst Supporting Actress for Ellen Albertini Dow.[citation needed].The film is part of Frameline 39: The San Francisco International LGBTQ Film Festival.","54":"Theatrical release poster","written_by":"Mark Christopher","budget":"$13 million[1]"}