{"based_on":"the play by Woody Allen produced on the stage by David Merrick","country":"United States","distributed_by":"Avco Embassy Pictures","Plot":"Walter Hollander, a caterer, is on vacation with his wife Marion and daughter Susan. While flying to Athens, their plane is hijacked to Vulgaria, behind the Iron Curtain. While waiting for the plane to be cleared to take off again, Marion insists they go outside and take a few pictures. Unfortunately they are in a restricted area so the secret police suspect them of being spies. Inspector Krojak sends a squad of soldiers with machine guns to arrest them, and the Hollanders flee to the car of the American ambassador which is parked nearby.The Hollanders take refuge in the U.S. Embassy nearby. The ambassador is away, leaving only his inept son Axel Magee to grant the Hollanders political asylum. Picketers protest outside the embassy as everyone tries to figure a way out. Walter and Marion even don a sultan's robes and attempt to sneak out with his party, but complicating matters further is that Susan has fallen in love with Axel.","language":"English","Turner Classic Movies showing":"Turner Classic Movies presented this adaptation of Woody Allen's Don't Drink the Water as part of its November 2–3, 2015 political satire film series \"Geofiction Comedies\", with commentary by host Ben Mankiewicz. Shown earlier were two other color films, 1959's The Mouse That Roared and 1961's Romanoff and Juliet as well as two black-and-white features from an earlier era, 1933's Duck Soup and 1940's The Great Dictator.","cinematography":"Harvey Genkins","directed_by":"Howard Morris","release_dates":"1969 (1969)|||||","produced_by":"Charles H. Joffe A Jack Rollins and Charles H. Joffe Production Executive producer Joseph E. Levine","starring":"Jackie Gleason Estelle Parsons Ted Bessell Joan Delaney","running_time":"100 minutes","music_by":"Composed arranged and conducted by Pat Williams","External links":"","edited_by":"Ralph Rosenblum A.C.E. (editorial supervision)","written_by":"R. S. Allen and Harvey Bullock"}