{"call_me_madam":"Original Broadway Playbill","Productions":"Directed by George Abbott and choreographed by Jerome Robbins, the musical premiered at the Shubert Theatre in New Haven, Connecticut on September 11, 1950. Reviews were mixed - Variety said it \"inspires warm applause rather than cheer\"—and Berlin wrote two new songs to bolster the sagging second act. It opened in Boston on September 19, and while The Boston Record thought it offered \"only an occasional flash of inspirational fire\", it played to standing-room-only audiences throughout the run.[1]With a record advance sale of $2 million,[1] the Broadway production opened on October 12 at the Imperial Theatre, where it ran for 644 performances and grossed more than $4 million.[1] In addition to Merman and Nype, the cast included Paul Lukas, Pat Harrington, Sr., Galina Talva, Lilia Skala, and Richard Eastham. Brooks Atkinson of The New York Times thought it offered one of Berlin's \"most enchanting scores: fresh, light, and beguiling, and fitted to lyrics that fall out of it with grace and humor\", and the New York Post called Merman \"indescribably soul-satisfying\", \"a comedienne of rare skill\", and \"one of the joys of the world.\"[1] She remained with the show for the entire run and appeared in the limited four-week engagement staged to celebrate the reopening of the National Theatre in Washington, D.C., but her understudy Elaine Stritch starred in the national tour.[1]The musical opened in the West End at the London Coliseum on March 15, 1952 where it ran for 486 performances and starred Billie Worth.[2]The New York City Center Encores! semi-staged concert version starring Tyne Daly, Walter Charles, and Melissa Errico was presented in February 1995.[3] A regional production ran at the Paper Mill Playhouse, Millburn, New Jersey, in April–May 1996 and starred Leslie Uggams.[4] Other major productions have starred Constance Bennett, Joanne Worley and Karen Morrow.The Union Theatre in London produced Call Me Madam in the fall of 2012. It was staged and directed by Michael Strassen and starred Lucy Williamson, Gavin Kerr, Leo Miles and Natalie Lipin. It received five nominations at the Off West End Awards and was named as one of the productions when the Union won Best Fringe at The Stage Awards in 2013 alongside The Globe (Best Theatre)","music":"Irving Berlin","Background":"The lead character is based on Washington, D.C. hostess and Democratic Party fundraiser Perle Mesta, who was appointed Ambassador to Luxembourg in 1949. The Playbill distributed at each performance humorously noted that \"neither the character of Mrs. Sally Adams nor Miss Ethel Merman resemble any person living or dead.\"In 1949, Merman and her family were vacationing at the Hotel Colorado in Glenwood Springs with Howard Lindsay and his wife Dorothy Stickney. Watching Merman poolside while reading a magazine article about Mesta, Lindsay was struck by how typically \"American\" she was and immediately envisioned her portraying a colorful character similar to the newly appointed ambassador. When he proposed the idea to Merman, who had little interest in either society or political news, she responded, \"Who's Perle Mesta?\"[1]Although Merman had announced she was interested in playing a dramatic role in her next project, Lindsay and Russel Crouse approached Irving Berlin and began working on the book for Call Me Madam when he expressed interest in composing the score. Berlin's last production, Miss Liberty, had failed to recoup its investment, and he was determined to repeat the success he had had with Annie Get Your Gun. The three collaborators agreed they needed to treat their subject with care to avoid any legal action by Mesta. As the work progressed, Merman conceded she would be willing to sing two or three songs, but eventually accepted the fact she was going to star in a full-scale musical comedy instead of the drama she preferred.[1]Producer Leland Hayward budgeted the production at $250,000. In exchange for the original cast recording and television broadcast rights, he arranged to have it financed 100% by RCA Records and NBC, with the two sharing 35% of the net earnings. In order to increase the profits, Hayward decided to charge an all-time high of $7.20 for orchestra seats.[1]Hayward hired George Abbott to direct, and Abbott and casting director Harold Prince auditioned thousands of actors for the twenty speaking roles and twenty-nine chorus members. Raoul Pene du Bois was hired to design sets and costumes, although the wardrobe worn by Merman was the responsibility of Mainbocher.[1]Once the script was completed, everyone agreed that, while it was little more than standard situation comedy material, it was a perfect vehicle for Merman, and that Berlin's score, although far from his best, was tuneful and memorable. It included the comic song \"Mr. Monotony\", which originally was written for and dropped from the film Easter Parade. Berlin had then included it in Miss Liberty, but it was dropped from that as well. In this instance, the third time was not the charm: during out-of-town tryouts, Merman insisted it be dropped. (In 1988, Sarah Brightman recorded it for her CD The Songs That Got Away.) To fill the hole its omission left in the second act, Berlin wrote \"Something to Dance About\" to give the second act a lively opening. When the star requested a duet with Russell Nype playing her lovestruck press attaché, Berlin responded by writing the counterpoint tune \"You're Just in Love\" and it ultimately became a showstopper at every performance.[1]","awards":"Tony Award for Best Original Score","book":"Howard Lindsay Russel Crouse","productions":"1950 Broadway 1952 West End","Recordings":"In a highly unusual situation, two LP albums of the score were released. The recording rights had been granted to RCA Victor, which had invested in the show, but Merman was under contract to Decca Records, which refused to allow her to record the original cast album. Decca issued a 10-inch LP featuring Merman singing some of her songs, accompanied by arranger-conductor Gordon Jenkins and His Orchestra and Chorus, with vocalizing by Dick Haymes (who joined Merman in the show's biggest hit, \"You're Just in Love\", their single reaching Billboard magazine's number 30 for a week) and Eileen Wilson (who sang \"It's a Lovely Day Today\" with Haymes). RCA Victor went ahead with the original cast album replacing Merman with Dinah Shore. Merman was called back into the Decca studios to record additional songs from the show, and the label quickly re-released the album as a 12-inch LP under the title Ethel Merman: 12 Songs from Call Me Madam. The Victor album sold reasonably well, attaining the sixth spot on the Billboard popular album charts, but the LP was out of print from 1956 until RCA Red Seal reissued it briefly in 1977. Peaking at number two on Billboard's popular album charts, Merman's Decca recording, which would appear on MCA Records beginning in 1973, stayed steadily in print until the end of the LP era. Merman's Madam album currently is available on a Decca Broadway CD, which also features Merman singing four Cole Porter tunes from the stage score of Panama Hattie (1940).Merman also is heard on the film soundtrack album (with Donald O'Connor and George Sanders), issued in 1953 as a 10-inch album, also on the Decca label. Scoring fifth position on Billboard \"s popular albums charts when first released, the soundtrack, taken out of print in 1957, was reissued in 1981 by Stet Records on a 12-inch LP which also contained songs from the film scores of Guys and Dolls (1955) and I'll Cry Tomorrow (1955). The Merman soundtrack has not been legally updated to a CD.A 1995 Broadway concert cast album, featuring Tyne Daly, Lewis Cleale, Christopher Durang, Ken Page, and Melissa Errico, is available on the DRG label.The original London West End cast recording, starring Billie Worth, has been released on the Sepia label.","lyrics":"Irving Berlin","Film adaptation":"A 1953 20th Century Fox film adaptation stars Ethel Merman, George Sanders, Donald O'Connor, Billy DeWolfe, Charles Dingle, and Vera-Ellen.","Promotional Appearances":"On the premiere episode of The Big Show (NBC Radio) on November 5, 1950, original Broadway cast members Ethel Merman, Paul Lukas, and Russell Nype appeared in the first half-hour (of the hour-and-a-half program) and performed songs from the score in order of their appearance in the production, while host Tallulah Bankhead filled in story notes between songs (although accidentally missing one story cue). Merman sang \"The Hostess With the Mostes' on the Ball,\" then Lukas sang \"Lichtenburg,\" then Merman sang \"Can You Use Any Money Today?\" and \"The Best Thing for You (Would Be Me),\" and finally Merman sang \"You're Just in Love\" with Nype.[5]"}