{"country":"United States","distributed_by":"Columbia Pictures","Plot":"In New York, Mitch Robbins, Phil Berquist and Ed Furillo are in mid-life crises. Mitch has just turned 39, Phil is trapped in a 12-year loveless marriage to his overbearing wife, Arlene, and Ed is a successful sporting goods salesman and playboy who has recently married an underwear model but is struggling with monogamy and the pressure of having children. Ed's suggestions for youthful adventures do little to placate them, and Phil's marriage soon falls apart due to an affair with one of his co-workers.At Mitch's birthday party, Phil and Ed present a gift of a two-week cattle drive from New Mexico to Colorado. Despite Mitch's plans to go to Florida with his wife Barbara to visit her parents, Barbara persuades him to instead go with his friends and find some purpose before he contemplates adultery or suicide. In New Mexico, Mitch, Phil and Ed meet the ranch owner, Clay Stone, and their fellow drivers. Mitch develops a rivalry with the ranch's professional cowboys, Jeff and T.R., when they drunkenly proposition one of the drivers, Bonnie. The standoff is stopped by the trail boss, Curly, who inadvertently humiliates Mitch in front of his friends.During the drive, as Mitch, Phil and Ed begin to change their outlook on life, Mitch accidentally causes a stampede which wrecks most of the camp. In retribution, Curly orders him to help gather the lost cows, but over time, the two develop a bond when Mitch learns that Curly, despite his tough exterior, is actually a very wise man. Curly advises Mitch to discover the \"one thing\" in his life which is the most important to him, which will solve all of his problems. Along the way, Mitch helps deliver a calf from a dying cow, which Curly kills out of mercy. Mitch adopts the calf and names him Norman.Curly suddenly dies of a heart attack, leaving the drive under Jeff and T.R.. Trouble begins when the cook, Cookie, gets drunk and accidentally destroys their food supply, and Jeff and T.R. intoxicate themselves with Cookie's hidden stash. A fight ensues when they threaten Norman and assault Mitch, leading Phil to lash out at them and unleash a lifetime of stress on them at gunpoint. Jeff and T.R. abandon them to avoid reprisals from Clay Stone. Though the remaining drivers consider leaving the herd to seek out civilisation, Phil and Ed remain behind to finish the drive alone. Mitch has a change of heart and joins them while the others continue to Colorado.After braving a heavy storm, they finally manage to drive the herd to Colorado, but Norman gets stuck in the river. Mitch saves him but they are both swept away with the current. Phil and Ed only barely manage to save them both and finally overcome their crises while resting on the bank. They reach Clay Stone's ranch in Colorado shortly afterwards. Clay Stone offers to reimburse them for their troubles, but reveals that he is selling the herd to a meat company. Having changed their outlook on life, Mitch, Phil and Ed decide to rebuild their lives, and Mitch purchases Norman from Clay Stone to save him from slaughter.Mitch returns with Phil and Ed a happier man, and reunites with his family. Phil enters a relationship with Bonnie, and Ed becomes open to the idea of having children.","language":"English","Reception":"The film received a \"Fresh\" score of 90% on Rotten Tomatoes.[3] Jack Palance, for his role as Curly, won the Academy Award for Best Supporting Actor, the only Oscar nomination it received. His acceptance speech for the award is best remembered for his demonstration of one-armed push-ups,[4] which he claimed convinced studio insurance agents that he was healthy enough to work on it. Billy Crystal was hosting the Academy Awards that night, and used the humorous incident for several jokes afterward that evening. The next year's Oscars opened with Palance appearing to drag in a giant Academy Award, with Crystal (again the host) riding on the opposite end.Palance and Crystal both were nominated for Golden Globes for their performances, in separate categories, though only Palance won.The film is currently ranked #73 on Bravo's \"100 Funniest Movies\" and number 86 on AFI's 100 Years... 100 Laughs.","box_office":"$179,033,791[2]","cinematography":"Dean Semler","production_company":"Castle Rock Entertainment Nelson Entertainment","directed_by":"Ron Underwood","Awards and honors":"American Film Institute recognition","release_dates":"June 7, 1991 (1991-06-07)|||||","Production":"The film's plot, which consists of inexperienced cowboys battling villains as they press on with their cattle drive after the death of their leader, was conceived to be similar to John Wayne's The Cowboys, although that was a Western drama as opposed to a comedy.[5]In his 2013 memoir, Still Foolin' Em, Billy Crystal writes of how the casting of the film came about. \"Palance,\" he says, \"was the first choice from the beginning, but had a commitment to make another film.\" He wrote that he contacted Charles Bronson about the part, only to be rudely rebuffed because the character dies. Palance got out of his other obligation to join the cast. Rick Moranis, however, originally cast as Phil, had to leave the production due to his wife's illness. Daniel Stern was a late replacement in the role.On the night Palance won the Academy Award, according to Crystal, the 73-year-old actor placed the Oscar on his shoulder and said, \"Billy Crystal ... who thought it would be you?\" He added in his book, \"We had a glass of champagne together, and I could only imagine what Charles Bronson was thinking as he went to sleep that night.\"","produced_by":"Irby Smith","starring":"Billy Crystal|Daniel Stern|Bruno Kirby|Patricia Wettig|Helen Slater|Jack Palance|","running_time":"112 minutes","city_slickers":"Theatrical release poster by John Alvin.","music_by":"Marc Shaiman","edited_by":"O. Nicholas Brown","written_by":"Lowell Ganz Babaloo Mandel","budget":"$26 million[1]"}