{"Television version":"For the film's September, 1976 television premiere on NBC, additional footage was added to expand the film's running time so it could be shown over two nights.[25] This \"television version\" made no use of material left out of the theatrical release[citation needed] (save one brief scene featuring Victoria Principal and Reb Brown), but rather incorporated new footage filmed nearly two years after the original using two of the original film's stars, Marjoe Gortner and Victoria Principal, as well as Jesse Vint and Michael Richardson (reprising their film roles of Marjoe Gortner's taunting room mates), expanding on the original storyline from the theatrical film. Editing and re-recorded dialogue helped integrate this expansion into the original film. An entirely new storyline shot specifically for the television version was that of a young married couple (Debralee Scott and Sam Chew) flying to Los Angeles on an airplane. The husband seeks a job with the Royce Construction company of the film (in fact, hoping to work with Charlton Heston's character, Stewart Graff), while his wife has the eerily accurate ability to see the future with cards. Their airliner attempts to land at Los Angeles International Airport as the titular earthquake hits,[26] and the airliner makes a touch and go landing on a runway that is breaking up, diverting to San Francisco. Throughout the remainder of the television version, the film cuts back to the couple as they discuss their future together, and the husband's wish to return to Los Angeles and help rebuild the city.The \"Sensurround\" audio of the original film was simulcast in FM stereo in the Los Angeles and New York markets. This theoretically allowed the home viewer with the properly equipped sound system to experience a similar effect as in the theater.","country":"United States","distributed_by":"Universal Pictures","Stock footage":"Many scenes from the film, especially those featuring the destruction of Los Angeles, have appeared in other productions, often those of Universal Studios itself. Some examples include:","Plot":"Former pro-footballer Stewart Graff (Heston) is jogging near the Hollywood Sign. Back home, his wife Remy Royce-Graff (Gardner), bitter because of their failing marriage, starts her morning by picking a fight with him. After he has showered and is preparing to leave, Stewart finds Remy unconscious with a bottle of pills nearby. Accustomed to her periodic suicide attempts, Stewart prepares to induce vomiting when a violent tremor shakes the bedroom. Remy bolts out of bed, revealing that she was faking.Meanwhile, at the Mulholland Dam, two workers begin a routine inspection of the structure in response to the tremor. One of them drowns.In downtown Hollywood, LAPD Sgt. Lou Slade (Kennedy) and his partner Emilio Chavez (Pedro Armendáriz, Jr.) are in pursuit of a suspect. They chase him out of their jurisdiction, finally crashing into the hedges at Zsa Zsa Gabor's house. After an L.A. County sheriff's deputy yells at Lou for ruining Gabor's hedges, Lou punches him out. He receives a temporary suspension.On his way to work, Stewart visits Denise Marshall (Bujold), an actress who is the widow of one of his friends and co-workers. He drops off an autographed football for her son Corry (Tiger Williams) and helps Denise run her lines for a scene she is shooting later that day.A junior staffer, Walter Russell (Niven), at the California Seismological Institute has calculated that Los Angeles will suffer a major earthquake in the next day or two. He frantically tries to reach his superior, Dr. Frank Adams. Another tremor hits as Adams and his assistant are working in a deep trench and they are buried alive. The scientists at the center argue about whether or not to go public with their prediction of a major quake. The acting supervisor, Dr. Willis Stockle (Sullivan), insists that if they are wrong their funding will be jeopardized. They agree on a compromise to alert the National Guard and police so that they can at least mobilize to help deal with the fallout.While checking out at a grocery store, Rosa Amici (Principal) realizes she does not have enough money to pay for all her items. Jody Joad (Gortner), the seemingly kind store manager, insists that she keep the items and make up the deficit the next time she shops. Later, when he hears that the National Guard reserves are being called up on the radio, Jody leaves the store in the middle of his shift, revealing himself to be part of the reserve army. He goes to his run-down boarding house and changes into his NCO uniform - as well as a wig that covers his long hair - enduring the harassment of his housemates who, after seeing his bodybuilder wall art, accuse him of being homosexual.Blowing off steam at a bar, Lou orders a double bourbon. A drunk (Matthau) periodically wakes up to toast random people. Daredevil motorcyclist Miles Quade (Roundtree) arrives with his partner Sal Amici (Dell) and his sister Rosa. A pool shark collects $50 that Miles owes him, leaving him short for the propane tank he needs to do a stunt for a talent scout. Miles convinces Lou to loan him the money.The tremor cancelled Denise's shoot; she heads to Stewart's office, pretending to meet with a friend. When she runs into him, he is headed out for a drink. They go back to Denise's house for the drink and end up making love. He promises to come back later that night and invites her and Corry to spend the summer with him in Oregon, where he will be overseeing a project. Back at the office, his boss and father in-law Sam Royce (Greene) offers to hand over the company presidency to Stewart. He asks for some time to consider the idea. Stewart calls Denise and breaks off their plans for later that night. He goes to Sam's office to accept his offer but is stunned to see Remy there. He assumes she has convinced her father, Sam, to offer the promotion to Stewart in order to save their marriage. He storms out and she follows him, accusing him of cheating with Denise. He explains that he never had until that day.When the couple get outside the building, the main earthquake occurs, which reaches 9.9 on the Richter Scale, destroying much of L.A. and killing thousands. All of the buildings are mostly damaged.After the quake is over, Sam and most of his employees find themselves trapped on the upper floors of their 30-story skyscraper, as the elevators have crashed to the ground. They descend most of the way by the stairs, but the earthquake has collapsed part of the stairwell, leaving a gap of about two stories. Sam rigs a fire hose to a chair and lowers his staff down one at a time. When everyone is safe, he suffers a heart attack and Stewart climbs up to lower him down in the chair.Denise's son, meanwhile, has been caught on a bridge over a spillway, which has become entangled with high voltage electric cables from a fallen transmission tower. She spies him unconscious on the concrete and climbs down to save him. Unable to climb back out with her son, she hails Miles and Sal who are passing by in their truck. After saving Denise and her son, they drive in search of help, coming across Lou who is organizing rescue efforts in the street. Lou commandeers their truck to use it as an ambulance.Rosa is arrested by the National Guard for looting. Jody, now a sergeant, picks her out of a group of prisoners. Rosa assumes he is going to let her go, but he claims that the streets are too unsafe for her to go anywhere and he orders her to stay inside a secluded store. Another group of troops arrive with Jody's housemates as prisoners. Jody executes them in an act of revenge for all the ridicule he has endured from them, terrifying Rosa and his subordinates as they now see his dark psychopathic side.Once Stewart gets everyone safely from his office to a shopping center named Wilson Plaza, now converted into a triage center, he goes off in search of Denise and her son. Sam is taken to Dr. Jim Vance (Nolan), but he does not survive. Stewart ends up driving Lou around in search of survivors and they come across Jody and his regiment. Jody threatens to fire on them if they come any closer and Rosa emerges when she sees Lou, Screaming and begging for his help. Lou and Stewart pretend to comply with Jody by driving away down the street and stopping out of sight.meanwhile Sgt. Joad's scared men then leave to look for a superior officer to have Joad relieved from Duty, face a court martial and detainment. But Lou sneaks back and gets the jump on Jody, who's enraged at Rosa for betraying and rejecting him and then attempts to rape her. Lou then shoots Jody dead in self-defense and rescues Rosa.As they drive away, they hear that another aftershock has destroyed Wilson Plaza. After a quick survey of the building, Stewart realizes there are survivors trapped in an underground garage three stories below ground. He and Lou crawl into the sewer and through some rubble with a jackhammer, which they use to drill through to the garage. Stewart is overjoyed to find Denise, who is one of the people trapped inside. As he hugs her, he sees his wife standing just behind her.During the rescue, the Mulholland Dam finally gives way, sending water down the sewers. Lou and Denise make it up the ladder to safety, but as Remy climbs out, a man steps on the rung she's holding onto, injuring her hand in the process. She falls back into the water which is sweeping people away. Stewart looks up at Denise, but he cannot bring himself to abandon his wife to death. He sacrifices himself when he swims after her and both of them are swept away, along with others. Denise walks away from the manhole in shock and grief. Lou is holding Rosa when Dr. Vance walks up to him and says, \"This used to be a helluva town, officer.\" Lou mumbles, \"yeah.\"","earthquake":"Theatrical Film Poster","language":"English","Reception":"Released in the United States on November 15, 1974, Earthquake would become the third highest-grossing film of the year; its competition, The Towering Inferno, was the highest.[14][15]The disaster film trend reached a zenith in 1974 with the combined releases of Airport 1975 (the first Airport sequel), Earthquake and The Towering Inferno. The films enjoyed staggering success, with The Towering Inferno earning $55 million in rentals, Earthquake earning $36 million and Airport 1975 earning $25 million.[16] By 1976, the disaster film cycle had also left its mark on the list of all-time box office champions, with The Towering Inferno ranking 8th, Airport 14th, The Poseidon Adventure 16th and Earthquake 20th.[16] These successes ensured the flood of similar films throughout the decade.Earthquake eventually grossed nearly $80,000,000 ($349,858,800 adjusted for inflation in 2015 dollars).[17]At its release, critics generally acknowledged the special effects in Earthquake while discounting other aspects. Without either panning or praising the film, Nora Sayre of the New York Times wrote that it was an improvement on Airport '75 and observed, \"The impulse to shout advice to the screen—get out! go away! don't enter that building—is quite powerful, so this does rank as a participatory movie.\"[18] Judith Crist wrote in New York Magazine that \"the nonsense is bearable for the spectacle. And ... here we have a feast of feats of destruction.\"[3] Pauline Kael said of it, \"The picture is swill, but it isn't a cheat; it's an entertaining marathon of Grade-A destruction effects\".[19]The review aggregator website Rotten Tomatoes collected reviews from 23 critics, some contemporary with the film and some from subsequent years, to give the film a score of 35% with an average of 4.7 out of 10.[20] Leonard Maltin gave the film a \"BOMB\" rating, stating \"[the] title tells all in hackneyed disaster epic ... Marjoe as a sex deviate and Gardner as Lorne Greene's daughter tie for film's top casting honors.\"[21] Gardner was only 8 years younger than Lorne Greene.Earthquake was nominated for four Academy Awards including Best Film Editing, Best Cinematography, Best Production Design (Alexander Golitzen, E. Preston Ames, Frank R. McKelvy) and Best Sound Mixing (Ronald Pierce, Melvin Metcalfe, Sr.). It won for Best Sound Mixing (Ronald Pierce, Melvin M. Metcalfe, Sr.) and a Special Achievement Academy Award for Visual Effects (Frank Brendel, Glen Robinson, Albert Whitlock).[22][23]The film was also nominated for two Golden Globe Awards including Best Motion Picture – Drama and Best Original Score (John Williams).[24]","box_office":"$79,666,653[1]","cinematography":"Philip H. Lathrop","directed_by":"Mark Robson","Theme park attractions":"Earthquake inspired the attractions Earthquake: The Big One at Universal Studios Florida and Hollywood.The Hollywood attraction opened in March 1989 as part of the Studio Tour tram ride. The tram enters a sound stage, the interior designed to look like a San Francisco underground BART station, whereupon a two-and-a-half-minute simulation of an 8.3 earthquake takes place, featuring a trolley car falling into the station, a runaway train and a flood.[27][c]The Florida attraction opened in June 1990. It began with an introductory film on the making of Earthquake with Charlton Heston appearing to explain the special effects, followed by a live demonstration based on the film with audience participation. The attraction culminated in a simulated 8.3 earthquake aboard an underground train at Embarcadero Station in San Francisco.[28] In the fall of 2002, the pre-show was changed to a more generic \"magic of making movies\" theme, with slight modifications which included mentioning special effects used in other films besides Earthquake. The Florida attraction officially closed on November 5, 2007, and reopened several months later as \"Disaster!: A Major Motion Picture Ride...Starring You!.\"[27]","release_dates":"November 15, 1974 (1974-11-15)|||||","Production":"In the wake of the tremendous success of the 1970 disaster-suspense film Airport, Universal Studios began working with executive producer Jennings Lang to come up with a new idea that would work within the same \"disaster-suspense\" genre. Inspiration came in the form of the San Fernando earthquake of February 1971.[4] Director Mark Robson and Lang were intrigued by the idea of creating a disaster on film that would not be confined to an airliner, but rather take place over a large area. Producer Bernard Donnenfeld helped produce the film, but was uncredited.[5]Budgeted at $7,000,000, Earthquake found itself in a race against the clock with the bigger-budgeted disaster film, The Towering Inferno, which was being produced by Irwin Allen (The Poseidon Adventure) and financed by two studios (20th Century Fox and Warner Bros., a motion picture first).Lang scored a coup when he was able to sign on screenwriter Mario Puzo to pen the first draft during the summer of 1972. Puzo, fresh from the success of his novel and film, The Godfather, delivered the draft script in August. Much like his The Godfather films, the characters and situations in his Earthquake script were intricate, and showed a similar attention to detail. However, Puzo's detailed script necessitated a much larger production budget (as the action and characters were spread over a vast geographical area in Los Angeles), and Universal was faced with either cutting the script down, or increasing the film's projected budget. Puzo's involvement with Earthquake was short-lived, however, as Paramount Pictures was anxious to begin development with the followup to The Godfather, The Godfather Part II. Since Puzo's services were contractually obligated to the sequel, he felt he would be unable to continue work on two projects of such a large scale, so he opted out of continuing any further work on Earthquake.The Earthquake script languished at Universal Studios for a short period of time, but was brought back to life by the huge success of the 20th Century Fox hit, The Poseidon Adventure, released in December 1972. Fueled by that film's enormous box office receipts, Universal Studios put pre-production on Earthquake back into high gear, hiring writer George Fox to continue work with Puzo's first draft. Fox was principally a magazine writer and had never written a screenplay before, so director Mark Robson worked with him to narrow the scope of the script down to fit into the budgetary constraints. After eleven drafts, Earthquake went before the cameras in February 1974.[5]While The Towering Inferno featured a larger \"all star\" cast,[a] Universal was able to land Charlton Heston in the lead role. Rounding out the top billing were Ava Gardner, George Kennedy, Lorne Greene, and Geneviève Bujold (who agreed to a part in the film to head off an impending lawsuit by Universal over a prior project).[6] The cast also includes Richard Roundtree (riding a wave of success from the Shaft film series), former evangelical Marjoe Gortner as an antagonist, and newcomer Victoria Principal.Walter Matthau was cast in a cameo role, for which he was credited as \"Walter Matuschanskayasky\".[b]Production necessitated the complete destruction of the Universal Studios backlot in order to simulate the catastrophic earthquake of the title. Along with a clever use of miniatures of actual buildings, matte paintings, and full-scale sets, Earthquake used a new technique developed especially for the film: a \"shaker mount\" camera system which mimicked the effects of an earthquake by moving the entire camera body several inches side to side, as opposed to shaking the entire set.[8]Extensive use of highly trained stunt artists for the most dangerous scenes involving high falls, dodging falling debris, and flood sequences, set a Hollywood record for the most stunt artists involved in any film production up until that time: 141.[9] Major stunt sequences in the film required careful choreography between the stunt artists and behind-the-scenes stunt technicians who were responsible for triggering full-scale effects, such as falling debris. Timing was critical, since some rigged effects involved dropping six ton chunks of reinforced concrete in order to flatten cars, with stunt performers only a few feet away. In other scenarios, some stunt artists were required to fall sixty feet onto large air bags – for which they were paid the sum of $500.[10]Universal Studios and Jennings Lang wanted Earthquake to be an \"event film\", something that would draw audiences into the theatre multiple times. After several ideas were tossed about (which included bouncing styrofoam faux \"debris\" over audience members' heads), Universal's sound department came up with a process called \"Sensurround\" – a series of large speakers made by Cerwin-Vega powered by BGW amplifiers, that would pump in sub-audible \"infra bass\" sound waves at 120 decibels (equivalent to a jet airplane at takeoff), giving the viewer the sensation of an earthquake. The process was tested in several theatres around the United States prior to the film's release, yielding various results. A famous example is Grauman's Chinese Theatre in Hollywood, California, where the \"Sensurround\" cracked the plaster in the ceiling. The same theatre premiered Earthquake three months later – with a newly installed net over the audience to catch any falling debris – to tremendous success.[11]The \"Sensurround\" process proved to be a large audience draw, but not without generating a fair share of controversy. When the film premiered in Chicago, Illinois, the head of the building and safety department demanded the system be turned down, as he was afraid it would cause structural damage. In Billings, Montana, a knick-knack shop next door to a theatre using the system lost part of its inventory when items from several shelves were thrown to the floor when the system was cued during the quake scenes.[citation needed]Sensurround was used again for the films Midway (1976), Rollercoaster (1977) and Battlestar Galactica (1979).[12]The 2006 Universal Studios Home Entertainment DVD release features the original \"Sensurround\" 3.1 audio track, duplicating the original theatrical \"Sensurround\" track (but oddly in mono directed to the front 3 speakers rather than the original stereo mix), but sadly no actual 'rumble' generator was used and it's only the two control tones that activated the generator that can be heard. In addition, the film's original soundtrack was remixed in Surround Sound 5.1 which was simply a tag as once again only the control tones feature on the track.John Williams' music for Earthquake was the second of his trio of scores for large-scale disaster films, having previously scored The Poseidon Adventure and following with The Towering Inferno (briefly earning him the nickname \"King of the Disaster Scores\").[13] Williams scored both Earthquake and The Towering Inferno in the summer of 1974, both scores showing similarities to one another (notably Earthquake's theme and The Towering Inferno's love theme sharing the same eight-note melody). The music of the song \"C'est si Bon\" by Henri Betti is played on the guitar in the middle of the film.After October test screenings, Universal opted to cut 30 minutes from the film, notably from the pre-quake sequences, at the cost of some of the dramatic flow. This included a narration sequence about the San Andreas fault and an impending catastrophic earthquake that would occur in either Los Angeles or San Francisco. This scene was filmed and was set to be shown before the opening title credits, and while it was removed at the last minute, it was eventually included as the opening sequence of the NBC extended television edit. Also excised was extended footage of Stewart (Heston) running, and additional scenes of Remy (Gardner) and Stewart arguing. After Remy's fake suicide, Dr. Vance shows up, argues with the ambulance crew, and begins to talk with Stewart. Dr. Vance (Lloyd Nolan) informs Stewart that Remy had an abortion two years prior. Stewart realizes that Remy had lied to him, since he was told it was a miscarriage. Remy appears and they fight because Stewart wanted the baby and Remy did not. Stewart storms off, and this explains why Stewart resents Remy so much. (In the film, they just seem angry at one another.) There was more of Slade leaving the police station and footage of Rosa leaving the market was shot as well. She was filmed waiting for a bus, and being offered a lift from a man on a motorcycle (this footage was eventually used in the film's television cut). Just before the earthquake, Stewart and Remy had a final fight (in front of Stewart's car) which was deleted as well. During the earthquake, there was a scene of a nearby lumberyard falling apart, and this was removed from the final cut.The elevator scenes, some of the film's most infamous shots, were severely altered from their original scenes. Originally, the occupants ended up pressed to the ceiling of the elevator and dropped to the floor when the elevator crashed to the bottom of the shaft. This scene - shown in all test screening prints - was considered too graphic for a film intended to have a PG rating.[citation needed] Universal, decided to cut this portion of the sequence and replace it with a frame of the people on the elevator's floor, with the notorious 'cartoon blood' rushing into the camera.[citation needed]Other deleted scenes were shot to wrap up many characters' stories after the earthquake. Walt Russell and Dr. Stockle – whose fates are undetermined after the quake in the theatrical release – were shown alive in the seismology laboratory post-quake. They were shown finding the earthquake's magnitude to be 9.9 on the Richter scale. The film's final scene originally had Denise asking Lew Slade if Stewart had survived; upon hearing of his death, she walks over to Corry who has regained consciousness.","produced_by":"Mark Robson","starring":"Charlton Heston Ava Gardner George Kennedy Lorne Greene Geneviève Bujold Richard Roundtree","running_time":"121 minutes 161 minutes (extended)","music_by":"John Williams","edited_by":"Dorothy Spencer","written_by":"George Fox Mario Puzo","budget":"$7 million"}