{"based_on":"Characters  by Peter Farrelly Bobby Farrelly and Bennett Yellin","Cast":"Cameos include Bill Murray (as Ice Pick, the Meth cook), Derek Holland (as patient in the asylum), Mama June (as fantasy wife of Harry), and Cam Neely (as Sea Bass). Google chairman Eric Schmidt also filmed a cameo as himself but it did not make the final cut. Sean Gildea also reprises his role as Sea Bass's friend in the post-credits scene.[11][12]","country":"United States","distributed_by":"Universal Pictures","dumb_and_dumber_to":"Theatrical release poster","Plot":"Twenty years after the events of the first film, Lloyd Christmas has been committed at an insane asylum ever since his doomed romance with Mary Swanson. During a visit, Harry Dunne discovers that Lloyd pranked him into thinking he was handicapped the entire time. Lloyd leaves with Harry and they head to their apartment, where Harry reveals one of his kidneys is bad and he needs a donor soon.They go to Harry's old home, but Harry cannot get a kidney from his parents since he was adopted. Harry's dad gives him his mail that has been piling up since he moved out. It includes a postcard from old girlfriend Fraida Felcher dating back to 1991. It says she's pregnant and needs Harry to call. Fraida admits that she had a daughter named Fanny that she gave up for adoption. She wrote Fanny a letter, only for it to be sent back and noted to never contact her again.Hoping she can provide a kidney, Lloyd and Harry decide to find Fanny and drive to Oxford, Maryland, where she now lives. Dr. Bernard Pinchelow and his wife Adele are the adoptive parents of Fanny, who has taken up the new name Penny. She is going to a KEN Convention in El Paso, Texas to give a speech on her father's life work. Penny is also given a package to be given to one of the convention heads, but the dim Penny ends up forgetting both the package and her phone.Adele is secretly trying to poison Bernard and Penny out of jealousy, with the help of her secret lover, the family's housekeeper, Travis Lippincott. Harry and Lloyd arrive to inform the Pinchelows of their situation, at which point Bernard realizes Penny left the package, which he says is an invention worth billions. Adele suggests that Harry and Lloyd deliver the package to Penny. So that he and Adele can get whatever's inside in the box, Travis goes along, but he becomes annoyed with the duo's antics, eventually deciding to kill them. Instead, a train collision kills Travis. Adele hears of the death from Travis's twin brother Captain Lippincott, a former military man who agrees to help her kill Harry and Lloyd.The duo make it safely to El Paso for the KEN Convention. While there, Harry impersonates Bernard, so he and Lloyd are invited to a seminar. They get into an argument when Harry realizes that Lloyd has developed a romantic attraction to Penny. After being escorted out of the convention due to not being on the attendance list, Lloyd gets a call from Penny. They arrange a meeting after he tells Penny that he's in town with her dad. They head to a restaurant, where Lloyd deduces he, not Harry, is the real biological father of Penny.Adele arrives at the convention with Lippincott and exposes Harry as a fraud, telling the convention heads he is not her husband and lies that he stole the package. Fraida also arrives and tampers with the fire alarm as a diversion after she and Penny are denied entry, causing everybody to exit. Harry runs into Fraida and Penny, only to have Lippincott and Adele draw guns on them. The villains chase the trio into the bathroom. When Lloyd returns, Lippincott and Adele are about to shoot, but three FBI agents bust in with a healthy-looking Bernard, who knew that Adele was trying to poison him, and he reveals that Adele was the one who wrote not to contact again on the letter, not Penny. The package he gave Penny included only cupcakes, and that there was no priceless invention all along. In retaliation, Adele attempts to shoot Penny, but Harry jumps in front of the bullet and is severely injured. Adele and Lippincott are arrested.Harry is rushed to the hospital, where he reveals that he was pranking Lloyd about needing a kidney. Harry and Lloyd are told by Fraida that neither is Penny’s father and that her biological father is a dead high school friend of theirs named Pete \"Pee-Stain\" Stainer. As the duo leave El Paso, they spot two women walking in their direction and they shove both women into a bush as a joke. They run off and high-five each other.","language":"English","Reception":"Early analysts predicted that the film could gross around $30–32 million in its opening weekend[62][63] and as high as $36–40 million in North America.[64][65]The film earned $1.6 million from Thursday night previews[66][67] and $14.2 million on its opening day in Friday.[68][69] The film topped the box office in its opening weekend earning $38,053,000 from 3,154 theatres at an average of $12,065 per theatre.[6] The opening weekend gross is higher than the $16.1 million debut of the original film ($31 million adjusted for inflation), and is Carrey’s biggest debut weekend since Bruce Almighty in 2003 ($67.9 million). The film played 47% under the age of 25 and 55% male.[70] Universal distribution chief Nikki Rocco commented about the opening performance, \"This was tricky to market,” he added, \"A lot of these kids weren’t born when the first [film] came out. But it has been such a serious time in movies, we had great marketing, mindless humor, and we broadened the audience.\"[71]In its first weekend outside of North America, Dumb and Dumber To made over 13 million dollars. It opened number one in Brazil, Slovenia, Norway, Lebanon, South Africa, Iceland, Croatia, UAE, Uruguay. It opened number two in Poland, Austria, Colombia, Serbia, Spain, Finland, Sweden. It opened number three in Singapore, Germany, Nigeria, Netherlands, Mexico, Egypt.[72] The largest opening was in Brazil with $3,497,325.[73]Outside North America, Dumb and Dumber To earned $3.2 million from four markets. The highest debut came from Germany ($1.4 million).[70]Dumb and Dumber To received mostly negative reviews. On Rotten Tomatoes, the film holds a rating of 29%, based on 137 reviews, with an average rating of 4.3/10. The general consensus states, \"Dumb and Dumber To does have its moments, but not enough of them -- and the Farrelly brothers' brand of humor is nowhere near as refreshingly transgressive as it once seemed.\"[74] On Metacritic, the film has a score of 36 out of 100, based on 36 critics, indicating \"generally unfavorable reviews\".[75]I laughed a lot at this movie, possibly even more than I did at the original film, which I enjoyed quite a bit.J. R. Jones of the Chicago Reader gave the film a positive review, writing: \"Seeing the two fiftysomething stars in their idiot haircuts again is a little disconcerting, like watching your favorite old band on a desperate reunion tour, but this sequel to Dumb & Dumber maintains a respectable laugh quotient.\"[77] Colin Covert of the Star Tribune of Minnesota gave the film one out of four stars and wrote, \"The result is simply stupid. This embarrassing revival plays as if the script were written in Comic Sans.\"[78] Andrew Barker of Variety gave the film a negative review, noting: \"Sporadically funny and mostly tedious, this 18-years-too-late sequel nonetheless exhibits a puerile purity of purpose.\"[79] Joe Neumaier of New York Daily News gave the film zero out of five stars, writing: \"From junky production values to the parade of unfunny supporting characters to its lazy energy, Dumb and Dumber To falls on its face.\"[80] Jason Clark of Entertainment Weekly gave the film a C-, writing: \"The ultimate sad realization is not that Dumb & Dumber To doesn't match the original's good-time quotient, but that it might not even be as good as - yikes - Dumb and Dumberer: When Harry Met Lloyd.\"[81] Claudia Puig of USA Today gave the film one out of four stars, writing: \"If there was any doubt that most things in society have been dumbed down in the last couple of decades, Dumb and Dumber To could be exhibit A.\"[82]The lengthy gestation period hasn't resulted in an appreciably upgraded experience.David Ehrlich of Time Out New York gave the film three out of five stars, writing: \"Dumb and Dumber To may not be quite as funny as the first one, but it's the funniest thing the Farrellys have made since.\"[84] A.A. Dowd of The A.V. Club, gave the film D+ and wrote: \"A sequel as desperate, in its own \"official\" way, as the knockoff-brand origin story that previously besmirched the franchise name.\"[85] Critic Mick LaSalle of San Francisco Chronicle scored the film one out of four stars, asking: \"Is this worse for Jim Carrey or Jeff Daniels? That's the sort of question that comes to mind while not laughing at Dumb and Dumber To.\"[86] Manohla Dargis of The New York Times wrote, \"The Farrellys are still not much interested in film as a visual medium, and when Lloyd and Harry aren't smacking each other or dropping their pants, you might as well be listening to a radio play.\"[87] The Boston Globe's critic Ty Burr gave the film two-and-a-half stars out of four, writing: \"Everyone has piled into this dumber, sillier, more consistently funny reprise with an enthusiasm that's infectious, and not in a low-grade medical way.\"[88] Tom Long of The Detroit News gave the film a B+, writing: \"In a world of ISIS, Ebola, dwindling retirement funds and severe drought, somehow this film seems needed.\"[89]Betsy Sharkey of the Los Angeles Times wrote, \"What felt fresh in Peter and Bobby Farrelly's original Dumb and Dumber, with the Carrey-Daniels dense duo channeling the Stooges and Jerry Lewis and something else entirely, feels strangely old-fashioned two decades later.\"[90] Stephanie Zacharek of The Village Voice wrote, \"Dumb and Dumber To is mostly just a kick in the nuts, and not the good kind -- provided there is a good kind.\"[91] Liam Lacey of The Globe and Mail gave the film two out of four stars and concluded, \"Over all, the movie is just funny enough to make you wish it were much better than it is.\"[92] The Star-Ledger's Stephen Whitty gave the film one and a half out of four stars, writing: \"The majority of it isn't just dumb and dumber, or even crude and cruder. At nearly two hours, it's just dull - and duller.\"[93] David Edelstein of New York Magazine wrote, \"I reckon four out of every five jokes played to silence at the preview screening. If Dumb and Dumber To were a live comedian, he'd have said, \"Is this an audience or an oil painting?\" He'd have left the stage in tears.\"[94] Wesley Morris of Grantland observed, \"The directors Bobby and Peter Farrelly cram the movie with puns and those kinds of sight gags. Almost none of them work.\"[95] Critic Peter Travers of Rolling Stone gave the film one-and-a-half stars out of four and wrote, \"Time can be cruel, especially to sequels.\"[96]For Robbie Collin in The Daily Telegraph it started promisingly but “within moments, the joke is spent ... Here, as throughout the film, every punchline is followed by a quiet pause for audience laughter, the lengths of which might kindly be described as optimistic.” He added: “There are scattered moments of inspiration ... But far more often, the comedy’s just spiteful, sour or sloppily executed -- or, in the case of a running joke about the hideous middle-agedness of Kathleen Turner’s character, the mother of Harry’s daughter, all three at once.”[97] Mark Kermode, writing in The Observer, “counted a mere three chuckles (one of which I’m fairly sure was unintentional), leaving this several smiles shy of even the widely panned 2003 prequel Dumb and Dumberer: When Harry Met Lloyd”.[98] The Guardian’s Peter Bradshaw found “the movie does deliver some laughs, and the climactic scene in which the two low-IQ boys succeed in infiltrating the equivalent of a TED talk is enjoyably bizarre,” but concluded: “It’s a rental, rather than a visit to the cinema”.[99]","box_office":"$169.8 million[3]","cinematography":"Matthew F. Leonetti","production_company":"New Line Cinema Red Granite Pictures Conundrum Entertainment","directed_by":"Bobby Farrelly Peter Farrelly","Music":"The opening credits are set to Apache Indian's song \"Boom Shack-A-Lak\", just like in the first film.The soundtrack was released by WaterTower Music on November 11, 2014.[51] Empire of the Sun recorded two new tracks for the film, and used the song \"Alive\" from their 2013 album Ice on the Dune.[52] The rest of the soundtrack consists of previously recorded tracks, including a song by The Jane Carrey Band, a group led by Carrey's daughter Jane Carrey.[53] Another song by The Jane Carrey Band included in the film, \"Breathing Without You\",[53] was not included on the album itself.","release_dates":"November 14, 2014 (2014-11-14)|||||","Production":"After months of speculation, the Farrelly brothers confirmed in October 2011 that they would make a sequel to Dumb and Dumber.[13][14] On October 1, 2012, it was reported that the script was complete and that Jim Carrey and Jeff Daniels would reprise their roles, despite Carrey having temporarily withdrawn his involvement in June 2012 due to concerns that Warner Bros. had shown little enthusiasm for the sequel, and Daniels threatening to back out of the sequel if it did not include Carrey.[15][16][17]Regarding the progress of the sequel, Peter Farrelly explained in January 2013,It's going well. We have a great script and now we are just trying to get it made. I love the script. It's exactly like the first one. We pick up 20 years later. We explain what they've done for the last 17 or 18 years. We take off from that and it's just a lot of laughs. It's at Warner Bros., and right now it's being financed outside the studio, but it will be released by Warner Bros. And that's all being worked out right now. If you liked Dumb and Dumber, you'll like this because it's the same and more. It's really fun. It's being made through Warner Bros. but now we have several financiers that are negotiating with the studio and trying to make the best deal. Whichever one does will make the movie. It's going to be made through Warner Bros. and released by Warner Bros. but financed by an outside financer.[18]On April 18, 2013, the Farrellys tweeted that Australian band Empire of the Sun would compose the score for the film.[19] On June 10, 2013, Warner Bros. decided not to move forward with the sequel but allowed the film to be pitched to other studios.[20] The following week, an independent company, Red Granite, agreed to finance the sequel with a $35 million budget. Universal Pictures will distribute the film in North America.[21] Even though Warner Bros. had no involvement in making the sequel, its New Line Cinema division, which produced the first film, and its prequel, Dumb and Dumberer: When Harry Met Lloyd, was given studio credit from Universal.[22][23]On June 18, 2013, Peter Farrelly confirmed that the sequel would move forward in an interview with The Nerdist Podcast.[24] In July 2013, a lawsuit filed by Red Granite Pictures sought a declaration that Red Granite owes no contractual obligation to Dumb and Dumber producers Steve Stabler and Brad Krevoy and that the duo are not entitled to any producer fees or credits they claim they're contractually owed on the sequel.[25] In a counter claim, the producers of Dumb and Dumber accused the producers and Red Granite Pictures of racketeering.[26] On July 18, 2014, a request for dismissal was filed in a Los Angeles Superior Court and the case was officially settled. The announcement of the settlement listed the plaintiffs as executive producers, and all claims against Red Granite, Riza Aziz and Joey McFarland of racketeering were withdrawn. The plaintiffs said in a statement, \"We apologize for naming Riza Aziz and Joey McFarland as individual defendants rather than just Red Granite.\"[27]On July 9, 2013, while on Late Night with Jimmy Fallon, Daniels confirmed Carrey's involvement, and stated that shooting would start in September 2013 for a 2014 release.[28] On August 30, 2013, Kathleen Turner was confirmed to play the role of Fraida Felcher.[29][30] On August 31, 2013, it was announced that Brady Bluhm would reprise his role as Billy in 4C for the sequel[10][31] and that Farrelly brothers frequent collaborators Bennett Yellin and Mike Cerrone co-wrote the script.[32] Screenwriting duo Sean Anders and John Morris did work on the script as well.[33]On September 8, 2013, an article reported that Cam Neely agreed to reprise his role as Sea Bass for the sequel, while Boston Bruins left winger Milan Lucic would possibly make an appearance as the son of Sea Bass.[34] Later that month, Lucic and Neely both said they have not signed on to the film, although both said they were open to do so.[35] In June 2014, Neely shot a scene for the film, which appears after the credits.[36] On September 16, 2013, The Walking Dead star Laurie Holden, Steve Tom, and Rachel Melvin joined the cast of the film as the Pinchelow family.[37] In September 2013, it was reported Jennifer Lawrence would make a cameo in the film as a younger Fraida Felcher. Lawrence has said in past interviews that she is a big fan of the original film.[38] Some sources indicate that the scene was filmed, but cut from the film after Lawrence vetoed it, a claim denied by both the Lawrence and Farrelly camps.[39] Bobby Farrelly explained that they tried to work around her schedule, \"but we weren't able to do it.\" [40]On November 18, 2013, it was announced that the film would be released on November 14, 2014.[41]On September 4, 2013, it was announced that filming for the sequel would begin on September 24, 2013.[42] On September 8, 2013, Jim Carrey tweeted a picture of his iconic chipped front tooth, along with the caption, \"GESS HUUZ BAK BICHEZ?\"[43][44][45] On September 22, 2013, principal photography began in Atlanta.[46] On September 24, 2013, Daniels and Carrey posted a photo of themselves on set dressed as Harry and Lloyd.[47][48][49] On November 25, 2013, Daniels announced that principal photography had been completed.[50]","produced_by":"Charles B. Wessler Riza Aziz Joey McFarland Bradley Thomas","starring":"Jim Carrey Jeff Daniels Rob Riggle Laurie Holden Kathleen Turner","running_time":"109 minutes[1]","music_by":"Empire of the Sun","edited_by":"Steven Rasch","Release":"The theatrical trailer premiered on The Tonight Show Starring Jimmy Fallon on June 10, 2014.[55] In its first week, the trailer had 23.5 million views on YouTube, outpacing nine other trailers, whose combined views numbered 23 million.[56] The international trailer was released on June 25.[57]On August 15, 2014, Universal released two advance posters that spoofed the theatrical release poster for Lucy, another Universal-distributed release that was then in theaters.[58] The two spoof posters, that reversed the \"using more than ten percent of the brain\" premise of Lucy to imply Harry and Lloyd only used one percent, were made public via Tweets from the Twitter accounts of Jim Carrey and Jeff Daniels.[59] An official TV spot was released on September 25, 2014.[60]Dumb and Dumber To was released on Blu-ray and DVD on February 17, 2015.[61]","written_by":"Peter Farrelly Bobby Farrelly Sean Anders John Morris Bennett Yellin Mike Cerrone","budget":"$50 million[2]"}