{"country":"India","distributed_by":"M. R. Films International","amaidhi_padai":"DVD Cover","Plot":"Amavasai (Sathyaraj),homeless but egoistic, gets acquainted to politician Manimaran, then MLA of palladam constituency, near tirupur (Manivannan). Amavasai helps Mani with some petty tasks during election campaign and meetings. Amavasai grows into a well acclaimed helper and first associate for Mani. Meanwhile, Amavasai falls in love with thayamma(Kasthuri) and one day he gives her some drug making her groggy and then rapes her. Mani instructs Amavasai to stand for MLA election as independent candidate in the upcoming general election with his support as mani was not given his party ticket. Amavasai wins by huge margin and becomes the MLA. He forgets his relationship with Kasthuri and rejects her pregnancy and child. Kasthuri and her parents move out of that village to avoid humiliation. Soon kasthuri gives birth to a boy and dies. Amavasai forgets Mani's help and forces him in role under him. He changes his name to Nagaraja Cholan for gaining social status. He marries the only daughter of the rich local landlord, Sivakami (Sujatha) and even cheats him of his Palace. Over years Amavasai grows into highly influential and corrupt politician with high criminal affluence. He builds a strong political empire through shortcuts. His ego and pride to remain in power make him kill many. He wins and remains as MLA of palladam in all the general elections for next 20 years.Now, Amavasai's son Thangavel (also Sathyaraj) through Kasthuri comes out as a new police constable who is deputed in Amavasai's constituency.Thangavel Thangavel is betrothed to a beautiful +2 studying girl Kuyili. They both fall in love. But during the official wedding engagement, a dispute arises over the people asking about his father's identity and the wedding is cancelled. He asks his grandparents about his father but they remain silent. So he accuses his mother to be a slut, and his granddad bashes him and tells all about ammavasai. Thangavel now comes to know of his real father and about his betrayal of his Mother and also his corrupt practices. The state assembly is about to be dissolved to hold prior general elections. But the ruling party leadership does not wish to give seat for amavasai again, as he has minimal chances of winning, due to his corruption, illegal activities as MLA. So he invokes a cruel caste riot in his constituency and pretends to stop it. So he is given ticket again. Thangavel is posted as riot police head constable to stop riots and to protect ammavasai. He saves ammavasai from an assassination attempt. He then goes to ammavasai's house and reveals his identity. He challenges his father that he will stop all of his illegal activities. Then thangavel gets posted as Law and Order Sub-Inspector in the same area. The story further revolves around how Amavasai and Thangavel proceed in their battle and finally who wins the battle.","language":"Tamil","Reception":"Amaidhi Padai emerged victorious among the Pongal releases of 1994, winning the race against other successful films like Kamal Haasan's Mahanadi and Vijayakanth's Sethupathi IPS. It was praised by film critics who declared the film an Asathal Padai.","cinematography":"D. Shankar","production_company":"M. R. Films International","directed_by":"Manivannan","Soundtrack":"The music composed by Ilaiyaraaja while lyrics written by Vaali, Pulamaipithan and Ponnadiyan.","release_dates":"13 January 1994 (1994-01-13)|||||","Production":"Sathyaraj was enjoying a good success as lead actor, when his friend Manivannan narrated the script of \"Amaidhipadai\" to Sathyaraj he rejected the script as he was not interested to play negative role but after being impressed by narration he accepted to play the role.[1]","produced_by":"K. Balachandran U. K. Senthikumar K. N. Ilamurugan","starring":"Sathyaraj Manivannan Ranjitha Sujatha Kasturi","running_time":"160 minutes","music_by":"Ilaiyaraaja","edited_by":"P. Venkateshwara Rao","written_by":"Manivannan"}