{"country":"United States Australia","distributed_by":"Paramount Pictures (USA) Universal Studios (select countries)","Plot":"At the beginning of the film, protagonist Michael \"Crocodile\" Dundee (Paul Hogan) is living in the Australian Outback with Sue Charlton (Linda Kozlowski) and their young son Mikey (Serge Cockburn). Because crocodile hunting has been made illegal, Mick is reduced to wrestling crocodiles for the entertainment of tourists, having as his rival in the business another Outback survivalist named Jacko (Alec Wilson). When an opportunity arises for Sue to become the Los Angeles bureau chief of a newspaper owned by her father, Mick and his family cross the Pacific to California.In the United States, Mick and his son's encounters with the locals cause cross-cultural mishaps. Mick becomes an undercover amateur sleuth helping to probe the mysterious death of his wife's predecessor at the newspaper, while Mikey attends a local school, where he quickly impresses his classmates and teacher with his outback survival skills. Because the case takes up so much of their time, Mick and Sue eventually call in Jacko to babysit their son; Immediately, Jacko and Mikey's teacher become interested in each other.It is revealed that the dead reporter had been investigating a film studio, which is about to make a sequel to the action film Lethal Agent, despite the title's commercial failure. Mick becomes suspicious when several paintings from Southern Europe are brought onto the set; although at first he suspects drug smuggling, the pictures themselves are revealed to be missing art from a museum in former Yugoslavia thought lost in the recent civil wars. They are to appear in the movie as mere props, to be publicly 'destroyed' in a scene in which they are set on fire, at which point they will have been exchanged for copies.Attempting to secure one of the paintings as evidence, Mick, Sue, and Jacko run afoul of the studio director and his thugs. Using the studio's props and three lions used in filming to defeat the gangsters, Mick and Sue solve the case and return to Australia, where they are officially married.","language":"English","Reception":"Critical reception for Crocodile Dundee in Los Angeles was predominantly negative and the film holds a rating of 11% (out of 79 reviews) on Rotten Tomatoes with the consensus \"A family movie without toilet jokes, but there's nothing that haven't [sic] seen before.\"[3] The movie was nominated for a Razzie Award for Worst Remake or Sequel but lost to Planet of the Apes.[4]The film grossed $7,759,103 at the box office in Australia.[5] The movie debuted in 4th place at the US box office behind Bridget Jones's Diary (which was #1 in its second weekend), Spy Kids and Along Came a Spider.[6] It grossed only $39 million worldwide, well below the total gross of the previous two films.","box_office":"$39.4 million[2]","cinematography":"David Burr Ted Chu","production_company":"Silver Lion Films","directed_by":"Simon Wincer","crocodile_dundee_in_los_angeles":"Theatrical release poster","release_dates":"Australia 12 April 2001 United States 18 April 2001","produced_by":"Paul Hogan Lance Hool","starring":"Paul Hogan Linda Kozlowski Jere Burns Jonathan Banks Aida Turturro Paul Rodriguez","running_time":"92 minutes","music_by":"Basil Poledouris","edited_by":"Tyler Hartford","written_by":"Eric Abrams Matthew Berry Paul Hogan (characters)","budget":"$21.15 million[1]"}