{"Cast":"The names of the six main characters (and most minor characters) were inspired by Beatles song titles and lyrics.","country":"United Kingdom|United States|","distributed_by":"Columbia Pictures","screenplay_by":"Dick Clement|Ian La Frenais|","story_by":"Dick Clement|Ian La Frenais|Julie Taymor|","Plot":"In 1966 Jude, a young shipyard worker from Liverpool, enlists in the Merchant Navy and jumps ship in New Jersey hoping to find his American G.I. father, whom he has never met (\"Girl\", \"Hold Me Tight\", \"All My Loving\"). Meanwhile, Lucy Carrigan worries about her boyfriend Daniel who is headed for service in the Vietnam War; while in Dayton, Ohio, Prudence pines for a fellow female cheerleader (\"I Want to Hold Your Hand\"). Jude meets his father, who is a janitor at Princeton University, and befriends Lucy's brother, the privileged and rebellious student Max (\"With a Little Help from My Friends\"). Lucy receives a letter from Daniel (\"It Won't Be Long\"), but when Max brings Jude home with him for Thanksgiving Jude becomes attracted to Lucy (\"I've Just Seen a Face\").Max drops out of school and he and Jude move into a bohemian enclave in Greenwich Village, living with aspiring singer Sadie (Dana Fuchs). Meanwhile, after his younger brother is killed in the 1967 Detroit riot (\"Let It Be\"), Jojo is seen leaving home and arriving by bus in New York City (\"Come Together\"). While Jojo auditions for Sadie's band, Max becomes a taxi driver and Jude finds work as a freelance artist. They are soon joined by Prudence, who has hitchhiked to New York and left an abusive boyfriend.When Daniel is killed in Vietnam, Lucy decides to visit Max in New York before starting college (\"Why Don't We Do It in the Road?\"). She and Jude fall in love (\"If I Fell\"), while Max is drafted into the army (\"I Want You (She's So Heavy)\"). Prudence is attracted to Sadie, and becomes depressed when Sadie and Jojo begin a relationship. Prudence locks herself in a closet and has to be coaxed out of the closet (literally and figuratively) by her friends (\"Dear Prudence\"), then disappears after wandering off during a peace rally at which Paco, the leader of the Students for a Democratic Republic (SDR), is a speaker.At a book function for existential drug guru Doctor Robert, Jude, Lucy, Jojo, Sadie and Max drink punch laced with LSD. They embark with Doctor Robert on his \"Beyond\" bus (\"I Am the Walrus\"), end up stranded outside the compound of psychonaut, and see Mr. Kite's bizarre circus where they are reunited with Prudence, who performs as Henry the Horse (\"Being for the Benefit of Mr. Kite!\", \"Because\").Back in New York, Sadie reluctantly agrees to her manager's demand that she drop her backing band, leading to a bitter breakup and musical split between herself and Jojo (\"Oh! Darling\"). Max is deployed to Vietnam, leading Lucy to become increasingly involved in the anti-war movement, especially with the SDR. Jude remains comparatively apolitical but devoted to Lucy (\"Something\"). Jude dislikes the increasing amount of time that Lucy spends with the SDR and suspects that Paco is attempting to seduce Lucy, and this puts a strain on their relationship and affects Jude's art (\"Strawberry Fields Forever\"). Finally, Jude storms into the SDR office and points out the hypocrisy of the group's actions (\"Revolution\"), leading to an argument with Lucy in which she leaves him (\"While My Guitar Gently Weeps\"). Jude follows Lucy to an anti-war demonstration at Columbia University (\"Across the Universe\") but when the police start arresting the protestors (including Lucy and Paco), Jude tries to help Lucy but is beaten by police and arrested (\"Helter Skelter\").Having been in the United States illegally and unable to legally prove that he is the son of an American citizen, Jude is deported back to England, where he returns to his old job at the Liverpool shipyards (\"A Day in the Life (instrumental)\"). This is also revealed to be the time frame of the opening scene. Jojo continues his music, playing solo guitar in bars, while on tour (although her career is skyrocketing) Sadie drowns her sorrow and loneliness in alcohol. Max is wounded in Vietnam and sent home, psychologically scarred and dependent on morphine (\"Happiness Is a Warm Gun\"). Lucy continues her activities with the SDR, but finds herself caught up as Paco leads the movement deeper and deeper into violence. She finally leaves when she discovers that Paco is making bombs, but is surrounded by constant reminders of Jude and what they had shared (\"Blackbird\"). One of Paco's homemade bombs explodes, killing him and his confederates and destroying the SDR offices; on reading this news in the local newspaper, Jude thinks that Lucy is dead, but upon learning from Max that she is alive, he arranges to return to New York legally (\"Hey Jude\").Jojo and Sadie, who have reconciled, put on a rooftop concert, with Prudence as a member of their band (\"Don't Let Me Down\"). Max brings Jude to the rooftop, but the police arrive to break up the concert and Lucy down on the street cannot get through the barricade. Jude manages to remain on the roof and begins to sing (\"All You Need Is Love\"). The police allow the band to accompany him. Max draws Jude's attention to an opposite rooftop where Lucy is standing and looking at him. Lucy and Jude gaze smilingly at each other across opposite rooftops as the performance concludes (\"Lucy in the Sky with Diamonds\").","language":"English","Release and reception":"The film's release date and release pattern became the subject of some media and public discussion. The film had been originally scheduled for release in 2006. The release was postponed as the editing process became extended and internal disputes arose. The film was subsequently scheduled for a wide release on approximately 1,000 U.S. screens on September 28, 2007. In early September 2007, Sony announced that the release would be brought forward to September 14, 2007, with a \"platform release\" pattern starting on a small number of screens—with additional screens to be added in subsequent weeks.The film received its world premiere on Monday, September 10, 2007, at the Toronto International Film Festival.[1] The film was then given a very limited \"platform release\" on 27 screens in the U.S. on Friday, September 14. The film had the second-highest \"per-screen\" average on its opening weekend. In the following three weeks, the release was gradually expanded to select regions.[10] After four weeks in limited release, on October 12, the film was elevated to a comparatively broader release on 954 U.S. screens, breaking into the U.S. box office top ten at #8.[10][11][12]The DVD, UMD, and Blu-ray formats were released on February 5, 2008.The film received mixed reviews from critics. Rotten Tomatoes gives the film a score of 53% based on 153 reviews.[13] Metacritic gives the film a weighted average score of 56%, based on 29 reviews.[14] Roger Ebert of the Chicago Sun-Times was extremely positive towards the film, giving it four stars, calling it \"an audacious marriage of cutting-edge visual techniques, heart-warming performances, 1960s history and the Beatles songbook\" and calling Julie Taymor an \"inventive choreographer\".[15] The film appeared on a few notable critics' top ten lists of the best films of 2007:[16]","box_office":"$29.4 million[4]","cinematography":"Bruno Delbonnel","directed_by":"Julie Taymor","across_the_universe":"Theatrical release poster","production_companies":"Revolution Studios Team Todd","Music":"Below is a list of the 33 Beatles compositions heard on the soundtrack, in the order featured in the film. This list includes notation of three compositions that are heard twice in the course of the film, so there are a total of 34 individual music cues.There is extra music, such as in \"Hold Me Tight\", to have more opportunity for things such as dance sequences. In \"Come Together\" on the special features, there is extra music for a dance solo and a well-planned \"Six Degrees of Separation\" which connects the main characters as they enter New York lifestyle. \"I Want You (She's So Heavy)\" is also extended to add time for Max's medical check-up that is shown and for the dialogue about Max eating cotton balls and other theories to get out of the draft. The extended music is used as underscoring for dialogue after \"Dear Prudence\", \"Something\", and \"While My Guitar Gently Weeps\". Some songs are not extended, but also have dialogue, such as \"Revolution\" and \"All My Loving.\" Other extended songs include \"I Am the Walrus\", \"Oh! Darling\", \"Across the Universe\", and \"Helter Skelter\".The film's end credits identify 33 Beatles compositions featured in the film, either in their entirety or in part. All of these songs were written from 1962-69 by the members of The Beatles (John Lennon, Paul McCartney, George Harrison, and Ringo Starr) and recorded by The Beatles. Twenty-nine of them are compositions that are officially credited to the songwriting partnership of Lennon–McCartney. Three are credited to George Harrison. One title (\"Flying\") is a 1967 composition credited to all four members of the Beatles (Lennon-McCartney-Harrison-Starr).Thirty of the soundtrack's songs feature vocals. Two of them (\"And I Love Her\" and \"A Day in the Life\") are brief instrumental versions of songs that were originally written with lyrics, although \"And I Love Her\" is sung in a deleted scene. One song (\"Flying\") was originally written as an instrumental.Twenty-five of the vocal tracks are performed by one or more of the six lead cast members. Four of the songs are sung by stars with cameo roles (Bono, Eddie Izzard, Salma Hayek and Joe Cocker). One song (\"Let It Be\") is sung by supporting members of the cast. Another song (\"Blue Jay Way\") is sung by indie Texan trio The Secret Machines. In 29 of the vocal tracks, the vocalists are singing on-screen. Two of the vocal tracks (\"Blue Jay Way\" and \"Lucy in the Sky with Diamonds\") are sung by off-screen vocalists.The remaining three of the 33 tracks are instrumentals. \"Flying\" is performed by The Secret Machines, \"And I Love Her\" is heard briefly as part of the orchestral score, and \"A Day in the Life\" is performed on guitar by Jeff Beck in a version recorded for Sir George Martin's 1998 album In My Life.In addition to the Beatles compositions, the soundtrack features an original score composed by Elliot Goldenthal. Goldenthal worked on Taymor's previous films Titus and Frida. (Goldenthal and director Taymor have been romantic partners since 1982.)Interscope Records has released three variations of soundtrack from the film — a standard edition and two deluxe editions. The standard edition contains 16 tracks from the film soundtrack, although \"Let It Be\" is shortened, missing the third verse. The first version of the deluxe edition features 31 tracks — all of the vocal performances and one of the three instrumental tracks.[5] In the US, this 31-track version is available solely at Best Buy stores and in a digital version from iTunes, while in Europe it is available at other retail outlets. A second version of the deluxe edition is available at other retail outlets and digital download suppliers. The second version differs from the 31-track version in that it omits two tracks (\"Why Don't We Do It in the Road?\" and \"I Want You (She's So Heavy)\").The song \"It Won't Be Long\" was released as a single on iTunes on September 11, 2007. From October 15–17, 2007, and again from October 22–23, 2007, the 31-track deluxe edition was the #1 downloaded album on iTunes.The soundtrack includes seven songs from The Beatles (also known as The White Album), five from Magical Mystery Tour, five from Abbey Road, four from Sgt. Pepper's Lonely Hearts Club Band, three from With The Beatles, two from A Hard Day's Night, two from Let It Be, one from Help!, one from Rubber Soul, and three other non-album singles.","release_dates":"September 14, 2007 (2007-09-14) (TIFF[1])|October 12, 2007 (2007-10-12) (United States)||||","Production":"In March 2007, the media reported a dispute over the final cut of the film. Concerned with the length of director Julie Taymor's cut of the film, Revolution Studios chairman Joe Roth tested a sneak preview of a shortened version without first informing Taymor. The incident sparked some heat between the two, later involving Sony Pictures' Amy Pascal urging Taymor to agree to the shorter version.[6][7][8] After several months of dispute, Taymor's version was eventually reinstated as the theatrically released version.[9]","produced_by":"Matthew Gross|Jennifer Todd|Suzanne Todd|","starring":"Evan Rachel Wood|Jim Sturgess|Joe Anderson|Dana Fuchs|Martin Luther McCoy|T.V. Carpio|","running_time":"133 minutes[2]","music_by":"The Beatles|Score:|Elliot Goldenthal|","edited_by":"Françoise Bonnot","budget":"$70.8 million[3]"}