{"Cars":"The series featured two cars–number plates \"SWINGER\" and \"SWINGER2\" and collectively dubbed the \"Shaguars\"–that were portrayed by a 1961 Jaguar E Type and a 2001 XK8 convertible, with a Union Jack paint scheme. The Ministry of Defence creates two cars to transport Powers through time: a psychedelic-rainbow painted 1999 Volkswagen \"New Beetle\" convertible in the second film, and a purple 1975 Cadillac Eldorado Fleetwood \"pimpmobile\" (number plate \"SWNGR 3\") in the third.Additionally, Felicity Shagwell drives a 1965 Chevrolet Corvette Stingray with an American flag paint scheme in the second film and Nigel Powers has a 2001 Mini Cooper – able to travel underwater, and which bears the number plate \"GR8SHAG\" – in the third.","country":"United States","distributed_by":"New Line Cinema","Media":"The series consists of three films:","language":"English","Reception":"The films' distribution rights were transferred to Warner Bros. in 2008.","box_office":"$676.3 million","directed_by":"Jay Roach","release_dates":"1997-present","Development":"Myers himself has stated in interviews that the idea for Austin Powers came to him one night while driving home from ice hockey practice. Hearing the song \"The Look of Love\" by Burt Bacharach on his car radio, he wondered \"Where have all the swingers gone?\", and conceived the character who would become Austin Powers.The first phrase he thought the character might say was \"Do I make you horny?\" which later did indeed become a catch phrase for the character. He has also disclosed that the character also draws on his recollections of former Radio Caroline DJ Simon Dee who hosted the first real TV chat show in the United Kingdom in 1967 which ended with his driving off in a sports car with a young blonde in the passenger seat. An important inspiration for the series is British super spy James Bond. Myers said of Bond, \"I can't even tell you how huge it was in our house ... That's really why I wanted to do Austin Powers. Austin Powers is out of pure love for James Bond\".[1]Though Myers is Canadian by birth, his parents are natives of Liverpool, England, and Myers holds dual nationality. Although the films parody the plots and characters of 1960s spy movies, the humour is influenced by Myers' British heritage, particularly the Carry On films and the comedic works of Benny Hill and Peter Sellers, of the latter of whom Myers is a self-confessed fan (his favorite films being the Bond spoof Casino Royale and The Party).Influences from Sellers' films are apparent throughout the series; the character of Austin Powers reflects the inspiration of Sellers' portrayal of the character Roger Danvers in the 1970 film There's a Girl in My Soup. Powers' dandyish appearance can also be shown to have been inspired by that of the fictional Jason King – the adventurous character from the ITV Spy-fi series Department S who was featured in the eponymous spin-off series.Other obviously-apparent influences are The Beatles films, The Monkees television series, James Bondage, and the \"cocktail party\" skits from Rowan and Martin's Laugh-In.","produced_by":"Mike Myers|Demi Moore|Jennifer Todd|Suzanne Todd|","starring":"Mike Myers|Michael York|Robert Wagner|Mindy Sterling|Seth Green|Verne Troyer|","Future":"HBO purchased the rights to produce a cartoon series based on the Austin Powers films in 1999. Despite announcing plans for a thirteen episode season, HBO ultimately shelved the project.[11][12][13]In October 2005, in an interview with Entertainment Weekly, Mike Myers discussed the possibility of studio sources moving forward with a fourth film. \"There is hope!\". \"We're all circling and talking to each other. I miss doing the characters.\"[14] In May 2007, in an interview with IGN, \"So no more Austin Powers?\" was asked, and Myers replied, \"No, no, there is a fully conceived idea for a fourth and I can just say that it's from Dr. Evil's point of view. So if you balanced how much of it was Austin with Dr. Evil, it's more about Dr. Evil than Austin.\"[15]In May 2007, at the Shrek the Third première, Mike Myers announced that a fourth Austin Powers film was planned, but that it would focus more on Dr. Evil rather than Austin. He also said that he'd start work on it after he started work on The Love Guru, which became a box office bomb.[16]In February 2008, it was announced that Jay Roach would return as director. In April 2008, it was reported that Gisele Bündchen had been offered a role in the film.[17] In June 2008, in an interview, when asked about another Austin Powers film, Myers stated, \"I have an idea, and again it's one of those things that will emerge or it won't.\"[18] In July 2008, Mike Myers stated that he had begun writing Austin Powers 4, and that the plot is \"really about Dr. Evil and his son.\"[19]In March 2010, Jay Roach indicated to MTV that Myers is working on ideas for a fourth film.[20][21] In August 2011, Mike Myers revealed he would return, and had begun writing a script for a fourth installment.[22] In September 2013, when asked about the future of Austin Powers, Myers answered \"I'm still figuring that out.\"[23] As of 2016, Austin Powers 4 has yet to be produced.","austin_powers":"Series logo","music_by":"George S. Clinton","written_by":"Mike Myers|Michael McCullers|","budget":"$112.5 million"}