{"country":"United States","distributed_by":"United Artists","Plot":"Dr. Patrick Cory and his wife Janice live in a mountain retreat where Cory attempts to keep a monkey's brain alive after having been removed from the monkey's skull.The private plane of businessman William Donovan crashes near Cory's cabin, and rescuers request Cory's help. Donovan is seriously injured and not expected to live, so Cory takes the businessman's brain for experimentation. Cory manages to keep the brain alive in an electrified saline solution. After writing messages in Donovan's handwriting while he is sleeping, Cory believes Donovan's consciousness still survives and he attempts to communicate with the brain.Gradually, Cory begins to exhibit Donovan's personality traits such as smoking cigars, using ruthless personal manipulation, and walking with a limp. Janice and Frank Schratt, Cory's friend and assistant, suspect that Donovan's consciousness is using telepathic mind control to overpower Cory's free will. In the meantime, news photographer Yocum discovers that Cory has illegally stolen Donovan's brain and demands money to keep the secret.Donovan's brain grows increasingly powerful, using Cory to collect a financial fortune and taking control of Yocum's mind and forcing him into a fatal car crash. After realizing that Donovan can control only one person at a time, Janice and Frank plot to destroy the brain. However, Frank's plan goes wrong when Donovan forces Frank to shoot himself. Ultimately, lightning strikes the Cory home and a fire breaks out, burning Donovan's brain and bringing an end to the horror.","language":"English","cinematography":"Joseph F. Biroc","production_company":"Dowling Productions","directed_by":"Felix E. Feist","release_dates":"September 30, 1953 (1953-09-30)|||||","produced_by":"Allan Dowling Tom Gries","starring":"Lew Ayres Gene Evans Nancy Davis Steve Brodie","running_time":"83 minutes","music_by":"Eddie Dunstedter","edited_by":"Herbert L. Strock","written_by":"Curt Siodmak (novel) Hugh Brooke (adaptation) Felix E. Feist (screenplay)"}