{"country":"United States Australia","distributed_by":"Warner Bros. Pictures","Plot":"Mrs. Carolyn Brody (Elizabeth Perkins) and her son Scott (Alexander Pollock) return home and the family's Bloodhound Buddy starts chasing a cat, a chase which ends with Buddy's capture by other cats in an ambush.This is witnessed by Anatolian Shepherd dog named Butch (voiced by Alec Baldwin) who reports Buddy's capture to his superiors. The head dog then orders the best canine agents to complete the mission by preventing all (cats) from achieving their favorite goal: to make all humans allergic to dogs.Meanwhile, at a farm, a handful of Beagle puppies make fun of a younger puppy (voiced by Tobey Maguire), who wants to be free. The younger puppy tries an escape, but he fails. A group of young black Doberman puppies, all of them trained dog agents, led by a large Doberman Pinscher appear, round up the Beagle puppies and force them into hiding underground. Mrs. Brody comes into the puppy pen and she selects the younger puppy who was forgotten by the Dobermanns. She decides to adopt him and takes him home, naming him Lou after Scott sarcastically suggests the name \"Loser\".Lou goes near an explosive trap set by the cats but Butch comes out and detonates it harmlessly. Butch then shows Lou the network that dog agents use, then takes him to meet some more agents: Peek (voiced by Joe Pantoliano) is a Chinese Crested Dog who works in an underground tube and has surveillance and communications equipment and Sam (voiced by Michael Clarke Duncan) who is an Old English Sheepdog. Having mistaken Lou for a trained dog agent, Butch raises his concerns to his superiors, but is told that there is no time to send a replacement. Lou is then briefed on the origins of the war between cats and dogs, which apparently dates all the way back to Ancient Egypt. Butch also mentions that fate of Buddy, who meanwhile had managed to escape from the cats and was now retired from the spy business, living life in a condominium.Meanwhile, Mr. Tinkles (voiced by Sean Hayes), a white Persian cat, plans to conquer the world by making all humans allergic to dogs with Mr. Brody (Jeff Goldblum)'s research on a cure for dog allergies. He is briefly interrupted by Sophie the Maid (Miriam Margoyles) who needs to dress him upon seeing the comatose Mr. Mason (Myron Natwick). Tinkles then tells his sidekick Calico (voiced by Jon Lovitz), an Exotic Shorthair, to send in the ninja cats (voiced by Danny Mann and Billy West) he hired to steal the research. He sends in the Devon Rex ninjas but Lou manages to prevent the theft. Lou then meets a former agent and Butch's ex-sweetheart and girlfriend named Ivy (voiced by Susan Sarandon), a Saluki who belly scratches him. Disappointed that the ninja cats failed him, Mr. Tinkles then orders Calico to send a Russian Blue mercenary, whose name is Diemitir Kennelkoff, (voiced by Glenn Ficarra) to steal the research. Kennelkoff frames Lou for defecating in the house with a ball containing fake dog feces, causing Lou to be confined outside, then places a bomb on the lab door. Butch and Lou manage to get into the house through the window, but Peek and Sam are trapped outside after Lou knocks the window prop away. Kennelkoff fires a series of boomerangs around the Brodys' house causing serious damage and which break several vases and knock a lamp over; the boomerangs also cause the curtain pole to break. Lou then distracts the Russian while Butch tries to disable the bomb, but Kennelkoff turns his attention on Butch and tries to kill him. Butch gets caught in a telephone wire, then Mrs Brody comes home looking for her cell phone and surprisingly does not notice her wrecked living room. Although he suspects that dogs can see in black and white, Butch manages to escape and disables the bomb, but Kennelkoff holds out a remote that will detonate the bomb and laughs until the lab door opens and hits him. Kennelkoff is then captured and interrogated. The agent tells the gang that they pumped a few things out of Kennelkoff's stomach, including a note written by Mr. Tinkles.After an incident involving Lou playing with Scott, Professor Brody's machine finally gets the positive combinations for the formula. As Mr. Tinkles and Calico overhear the call between Professor Brody and a doctor, they decide to spring a trap for Dr. Brody and his family. First, Mr. Tinkles makes his sinister and talking side known to Sophie, causing her to faint, then he and his cats take Mr Mason's comatose body to Mason's Christmas tree flocking plant, where Tinkles passes his voice off as Mr Mason to send the employees home and commandeer the factory for the next plot. The cats send soccer tickets to an exhibition game between Uruguay and Chad to the Brody family, obviously a ruse. The cats make a fake entry and when the Brody family pulls up, the cats throw a gas bomb into their car, which goes off in a tremendous explosion and leaves the family unconscious.While trying to decipher Mr. Tinkles's location, the dogs are obviously unaware that the Brodys have been led into a trap and are kidnapped by the said cat. After receiving a video from the cat demanding Mr. Brody's research as a ransom, the dogs from around the world assemble at a meeting (like the United Nations General Assembly) run by the Mastiff (voiced by Charlton Heston). When the dog agents are unable to give up the formula after the meeting of the world's dogs, Lou angrily confronts Butch for not helping him. Butch then explains that when his owner went to college, he left him with his grandmother and storms off, cutting off all of Lou's communications with Peek and the others so Lou would not seek help to save his family. Lou gives in and brings Mr. Tinkles the research and is betrayed. Butch manages to find the depressed Lou and, along with Ivy, the two stage an ambush of Mr. Tinkles's factory where the latter plans to use mice to spread the now mass-produced allergy to dogs. While Butch, Ivy, Peek, and Sam fight Tinkles's cat forces, Lou frees the Brodys and Calico (who was betrayed by Tinkles), revealing he can speak in the process. Lou defeats Tinkles and rescues Butch, but the claw of the excavator hits his head and a flocking tank, causing an explosion that destroys the factory. Butch manages to save Lou and he tells him he was right about everything, but the puppy is unresponsive and seems to be dead. After a few hurtful moments of sadness and sorrow; in which Scott, feeling genuinely sorry and remorseful for referring to Lou as loser, tearfully apologizes to Lou; Lou suddenly awakens and all rejoice. Lou decides to be a normal canine and not a secret agent yet, but one day he will be when he is a full-grown beagle.Meanwhile, Mr. Tinkles is sent to live with Sophie and her three sisters, who dress him in hilariously ridiculous girly outfits as punishment and all Tinkles has to say is \"This can't be happening\".","language":"English","Reception":"Cats & Dogs received mixed reviews from movie critics. It has a 54% approval rating at Rotten Tomatoes, based upon 115 reviews, with an average rating of 5.5 out of 10.[2] Metacritic, which uses an aggregate rating system, collected an average score of 47/100, based upon 26 reviews.[3] The Washington Post's Jane Horwitz gave the film a positive review, calling it \"[a] surprisingly witty and sophisticated spy movie spoof that will tickle adult pet lovers and still capture kids 6 and older with its boy-and-his-dog love story and pet slapstick.\"[4] In contrast, Kevin Turan of the Los Angeles Times wrote \"Irritating, childish and more frantic than funny, Cats & Dogs does manage some few pleasant moments, but they are not worth waiting for.\" When released on Independence Day 2001, the movie opened at #1, beating out Scary Movie 2 as it grossed $21,707,617 on a $7,140 average from 3,040 theaters. It however would lose 44% of its gross the next week, as it grabbed the #3 spot its second weekend grossing $12,033,590, falling behind Legally Blonde and The Score. The film grossed $93 million domestically, and $107 million overseas for a total of $200 million worldwide on a $60 million budget.Cats & Dogs was nominated for the Young Artist Award for Best Family Feature Film (Comedy) and Best Performance in a Feature Film - Leading Young Actor (Alexander Pollock). John Debney won the ASCAP Award for his musical contribution to this film as well as The Princess Diaries and Spy Kids.Heston received the 2001 Razzie Award for Worst Supporting Actor for his involvement in three films that year, including his role as The Mastiff.","cats_and_dogs":"Theatrical release poster","box_office":"$200,687,492[1]","cinematography":"Julio Macat","production_company":"Village Roadshow Pictures Mad Chance Zide/Perry Productions Rhythm and Hues Studios","directed_by":"Lawrence Guterman","Filming locations":"The house, was filmed at an actual house: 1661 45th street Bikeway, Vancouver, British Columbia. The basement lab was the only part of the house that was filmed at Warner Bros. Studios, in Burbank, California. Butch's house was also filmed at an actual house: 6288 Churchill street, Vancouver, British Columbia. The interior of Mr. Mason's tree flocking factory was filmed at Warner Bros. Studios. The exterior was filmed at an abandoned boiler factory. The soccer stadium was filmed at the Pacific Coliseum. Mr. Mason's house was filmed at Craigdarroch Castle, in Victoria, British Columbia.","Soundtrack":"Cats & Dogs is a 2001 soundtrack on this film by composer John Debney.","release_dates":"July 4, 2001 (2001-07-04)|||||","produced_by":"Ed Jones Christopher de Faria Andrew Lazar Craig Perry Warren Zide","starring":"Jeff Goldblum Elizabeth Perkins Alexander Pollock","running_time":"87 minutes","Sequel":"A sequel titled Cats & Dogs: The Revenge of Kitty Galore entered production in September 2008 under the direction of Brad Peyton and was released on July 30, 2010. Michael Clarke Duncan, Joe Pantoliano, and Sean Hayes reprise their roles as Sam, Peek, and Mr. Tinkles, while Nick Nolte and Wallace Shawn replace Alec Baldwin and Jon Lovitz as Butch and Calico; and Charlton Heston who voiced The Mastiff from the first film, died from pneumonia in April 2008. In this film, Lou is now an adult and is voiced by Neil Patrick Harris. James Marsden, Christina Applegate, and Bette Midler voice new characters named Diggs, Catherine, and Kitty Galore.","music_by":"John Debney","edited_by":"Rick W. Finney Michael A. Stevenson","Release":"Cats & Dogs was released with the classic Looney Tunes short \"Chow Hound\" which was also seen in the movie itself.\"[citation needed]Cats & Dogs was released on VHS and DVD on October 16, 2001.","written_by":"John Requa Glenn Ficarra","budget":"$60 million[1]"}