{"country":"United States","distributed_by":"MGM/UA","Plot":"The film follows the exploits of Sam Boyd (Gene Hackman), a former operative for the CIA who is reactivated to escort Pyotr Ivanovich Grushenko (Mikhail Baryshnikov), a captured KGB mole, to a prisoner exchange in recently reunited Berlin. The exchange is actually a cover for a CIA plot to use drug cartel money to buy back Benjamin Sobel (Bob Sherman), a U-2 pilot who was shot down over the Soviet Union during the 1960s. The exchange goes wrong after Boyd recognizes the supposedly imprisoned Sobel as a man he saw two days before at Dulles Airport, and is subsequently told by Grushenko that it really is Sobel, who is now a KGB agent.The two agents are forced to go on the run from both Boyd's own Company superiors (Kurtwood Smith and Terry O'Quinn) and the head of the KGB (Oleg Rudnik), who all wish to see the exchange completed for reasons that are both obvious and not so obvious. Their only hope may lie in Natasha Grimaud (Géraldine Danon), a mysterious French beauty from Grushenko's past.","language":"English","Reception":"Company Business performed poorly at the box office. The film earned $533,610 over its opening weekend, playing in just 232 theaters. The film ultimately grossed only $1,501,785 in North America.[1]Company Business was met with mixed reviews. Vincent Canby of The New York Times gave the film a lukewarm review, stating, \"Mr. Hackman, who has played this role before, and Mr. Baryshnikov, who hasn't, are both sturdy if a little tired. Under the direction of Mr. Meyer, who also wrote the screenplay, the film makes sense without ever being surprising.\"[3] Time Out similarly described the film as \"offer[ing] familiar spy movie clichés, and although Meyer's direction creates a moderately menacing atmosphere, his script is at best undemanding, at worst simplistic.\"[4]Variety called the film a \"muddled comedic-thriller\" and added, \"Writer-director Nicholas Meyer also is all over the map with his direction and script, which begins as a thriller (complete with portentously brooding music by Michael Kamen) then shifts to a sort of screwy comedy.\"[5] Michael Wilmington of the Los Angeles Times called it \"a shallow pastiche\" and \"a thin movie with no real center.\" He added:It's a shame, because a movie with Hackman and Baryshnikov, and Kurtwood Smith and Terry O'Quinn among the villains, plus good minor roles from Nadim Sawalha (as a sweating, ruined Arab entrepreneur) and Andreas Grothusen (as an ex-Nazi forger) really should be better than this. It should have more character, grit, tension and humor.[6]","box_office":"$1,501,785[1]","cinematography":"Gerry Fisher","production_company":"MGM-Pathé Communications Pathè Entertainment","directed_by":"Nicholas Meyer","release_dates":"September 6, 1991","Production":"According to writer/director Nicholas Meyer's memoir The View from the Bridge, Meyer decided to try his hand at writing an original screenplay at the behest of then CAA executive Rick Nicita. Due to the changing political environment in Russia, Meyer was forced to quickly finish his screenplay \"that struggled to reflect fast-moving events in Eastern Europe, where the Berlin Wall was collapsing.\"[2] As a result, the film went into preproduction before the updates could be completed and actors Gene Hackman and Mikhail Baryshnikov were signed onto the leading roles. Later, Hackman, exhausted from shooting three films back-to-back (Postcards from the Edge, Narrow Margin, and Class Action), tried to back out of filming two weeks before production was set to begin. Fearing a lawsuit from MGM, Hackman begrudgingly stayed on.[2]The title \"Company Business\" comes from the depiction in the movie of the word \"company\" as meaning the CIA, so \"company business\" means operations not to be revealed to anyone outside the CIA. The working title was Dinosaurs and the scene relating to this term was left in the finished film: a restaurant scene in which the young lady calls the two main characters \"dinosaurs\" meaning that CIA and KGB agents are no longer needed in the post–Cold War era. This title was dropped when it was learned that Walt Disney Studios had already registered it.[2]The film was produced by frequent Nicholas Meyer collaborator Steven-Charles Jaffe, who also served as second unit director. Filming took place in Berlin and Paris, as well as numerous locations in the United States.Meyer later described his experience on Company Business, saying:The film, which came to be known as Company Business, was a catastrophe, and it was no one's fault but mine. Going forward without a finished script was suicide. And while on paper, the troika of Hackman, Baryshnikov, and Meyer might have appeared promising, in reality we were all pulling in different directions, and my bouts with Hackman just about wrecked me. [...] There were a couple of sequences in Company Business of which I was proud, notably the tense spy swap sequence in the Berlin subway—but isolated sequences do not a good film make. A great movie is great from start to finish. Company Business, alas, did not come close.[2]","produced_by":"Steven-Charles Jaffe","starring":"Gene Hackman|Mikhail Baryshnikov|","running_time":"99 minutes","music_by":"Michael Kamen","edited_by":"Ronald Roose","written_by":"Nicholas Meyer","budget":"$18 million"}