{"country":"Italy","distributed_by":"Surf Film","Plot":"On May 8, 1938, the day Hitler visited Mussolini in Rome, Antonietta, a naïve and sentimental homemaker (Loren) stays home doing her usual domestic tasks, while her fascist husband (Vernon) and her six spoilt children take to the streets to follow the parade. The building is empty except for a neighbor across the complex (Mastroianni), a charming man named Gabriele. He is a radio broadcaster who has been dismissed from his job and is about to be deported to Sardinia because of his anti-fascist stance and his homosexuality. They meet by chance and began to talk. Antonietta is surprised by his opinions and, unaware of his sexual orientation, flirts with him.Despite their differences, they warm to each other. Antonietta confides to him her troubles with her arrogant and unfaithful husband, and eventually they have sex before he is arrested and her family comes back home. At the end, Antonietta sits near the window and starts reading a book Gabriele has given her (The Three Musketeers) and watches her lover leaving the complex, escorted by fascist policemen; then she turns off the light and goes to bed, where her husband is waiting for her in order to beget the seventh child.[3][4]","language":"Italian","a_special_day":"Film poster","cinematography":"Pasqualino De Santis","directed_by":"Ettore Scola","release_dates":"17 May 1977 (1977-05-17) (Cannes)|12 August 1977 (1977-08-12) (Italy)||||","Special scenes":"A number of unusual cinematic techniques are used in this film. A long take scene introduces Antonietta and her family: the camera enters through the kitchen window and moves into the rooms. Deep focus is utilised in a scene in which the camera is in Antonietta's room with her in the frame, and through a distant window Gabriele can simultaneously be seen moving in his house in the same frame.","produced_by":"Carlo Ponti","starring":"Sophia Loren Marcello Mastroianni John Vernon","running_time":"110 minutes","music_by":"Armando Trovajoli","edited_by":"Raimondo Crociani","written_by":"Maurizio Costanzo Ruggero Maccari Ettore Scola"}