{"Cast":"Players from several NBA teams played major roles, including Alex English as the Cleveland Cavaliers' coach, Dwayne Schintzius, Greg Ostertag, and Rick Fox. Dennis Rodman, Muggsy Bogues, Vinny Del Negro, Vlade Divac, Bobby Phills, J.R. Reid, Terrell Brandon, Brad Daugherty, Mitch Richmond, Avery Johnson, Corie Blount, Larry Johnson, Randy Brown, Olden Polynice, and Scott Burrell appeared as themselves. Gary Payton, Anthony Mason, Herb Williams, and John Starks appeared as streetballers. Kurt Rambis appeared as the head coach of the Lakers. Chris Berman, Marv Albert and Walt Frazier also appeared in the movie as broadcasters.Donald Trump, Rudy Giuliani, Edward Koch, Fabio and David Letterman also appeared in the movie. Gene Anthony Ray (who played Leroy in both Fame the series and the 1980 film) also features as associate choreographer, one of his last credits before his death in 2003, aged 41.During the production of the film Goldberg and Langella started dating, their relationship lasted until 2001.","country":"United States","distributed_by":"Buena Vista Pictures (North America) PolyGram Filmed Entertainment (international)","screenplay_by":"Jon Connoly David Loucka Eric Champnella Keith Mitchell Steve Zacharias Jeff Buhai","story_by":"Steve Zacharias Jeff Buhai Jon Connolly David Loucka","Plot":"The New York Knicks are also-rans in the NBA, their roster filled with players who either lack talent or are too distracted by off-the-court issues. Nonetheless, limousine driver and rabid fan Edwina \"Eddie\" Franklin (Whoopi Goldberg) attends every Knicks game in the nosebleed section of Madison Square Garden.During halftime of a game, Eddie wins a contest to be honorary coach of the Knicks for the second half. She quickly gets on the nerves of head coach John Bailey (Dennis Farina), whom she had heckled earlier. Eddie's popularity piques the interest of the new Knicks owner, \"Wild Bill\" Burgess (Frank Langella). After he forces Bailey to quit, Burgess names Eddie the new head coach.At first, she is treated with skepticism and derision. However, she understands that the Knicks have the talent to win, but the players' individual problems have caused the team to underperform. Center Ivan Radmonovich, from Georgia (sometimes referred to as a \"Russian\"), focuses only on scoring, and his lack of defensive technique leads him to frequently commit unnecessary blocking fouls. Superstar forward Stacey Patton's me-first approach causes him to force low percentage shots because he is unwilling to pass, and his poor attitude hurts the team's morale - for example, he keeps referring to himself in the Third Person. Rookie Jamal Duncan's occupation with being a rap star keeps him from focusing on his game, especially his free throws. Power Forward Terry Hastings' pending divorce from his wife due to an extramarital affair in Phoenix has a negative effect on his play on the court. At a pivotal moment in practice, Eddie earns the team's respect by taking a hard foul from Patton in order to demonstrate proper defense to Ivan. Eddie also begins to bench Patton in favor of veteran Nate Wilson, who was generally considered washed up because of chronic knee injuries. Wilson experiences a late career resurgence, the Knicks begin to win, and New York embraces the team and Eddie's colorful personality.The team's winning streak eclipses their abysmal start, and as the season winds down, the Knicks are within reach of the playoffs. In order to qualify, they will need to beat the Charlotte Hornets, now coached by John Bailey, in the last game of the season.The night before the game, Burgess tells Eddie that if the Knicks win, he will sell the team to a group that intends to relocate the team to St. Louis, Missouri (this is a veiled reference to Georgia Frontiere's similar move of the Los Angeles Rams to St. Louis upon her assumption of the Rams ownership in 1995). A conflicted Eddie doesn't show to the game until right before tip-off.During the game, Hornets forward Larry Johnson proves difficult to contain, but strong play from Wilson keeps the score close. Bailey responds by telling Johnson to foul Wilson hard in the hopes of knocking him out of the game. Johnson makes an unsuccessful attempt right before halftime: Wilson is hurt, but he is able to hit both foul shots and continue playing. In the fourth quarter Johnson blows out Wilson's knee, forcing him out of the game. Stacey Patton enters the game and shows a new team-first attitude, particularly on the Knicks' last offensive possession. Eddie begins to diagram a play to get Patton the ball for a final shot, but assistant coach Carl Zimmer instead suggests that Bailey, remembering Patton's tendency to force low percentage shots, will swarm him with defenders. The Knicks instead inbound to Patton, who passes to an open teammate after three defenders come to him. The Knicks take a one point lead with seconds left in the game.Now, with the Knicks on the cusp of winning, Eddie realizes that a victory will cause the team to be relocated to St. Louis. She decides to get on the Garden's PA system and reveal the entire plan to the world. The fans react with shock and anger, and a frustrated Burgess is forced to promise the crowd he won't sell the team or move them out of New York City.When play resumes, the Hornets have one last chance to win. Bailey tells his team to get the ball to Johnson and have him drive the lane, expecting Ivan to commit a blocking foul. Instead, Ivan remains set in his defensive position and Johnson is called for charging, which nullifies the basket, giving the Knicks the win and the playoff berth.The film ends without explaining what happens to the Knicks in the playoffs that year.","language":"English","Reception":"The film received negative reviews from critics. Rotten Tomatoes gives the film a score of 15% based on reviews from 33 critics.[1] Roger Ebert gave the film one and a half stars.[2] Whoopi Goldberg was nominated for a Razzie Award as Worst Actress for her performance.","box_office":"$31,387,164","cinematography":"Victor J. Kemper","production_company":"Hollywood Pictures Polygram Filmed Entertainment Island Pictures","directed_by":"Steve Rash","Soundtrack":"A soundtrack containing hip hop and R&B music was released on May 21, 1996 by Polygram Records. It peaked at 119 on the Billboard 200 and 44 on the Top R&B/Hip-Hop Albums.","release_dates":"May 31, 1996 (U.S.)","produced_by":"David Permut Mark Burg","starring":"Whoopi Goldberg Frank Langella Dennis Farina","running_time":"100 minutes","music_by":"Stanley Clarke","edited_by":"Richard Halsey","Notes":"1. http://www.mrcranky.com/movies/eddie.html . See also Rita Kempley (June 1, 1996). \"'Eddie': No. 1 in Offense\". Washington Post. Retrieved 2012. ","eddie":"Theatrical release poster","budget":"$30 million"}