{"based_on":"Biloxi Blues by Neil Simon","country":"United States","distributed_by":"Universal Studios","language":"English","Reception":"Biloxi Blues received generally positive reviews from critics. It currently holds an 81% on Rotten Tomatoes based on 26 reviews.Vincent Canby of The New York Times called the film \"a very classy movie, directed and toned up by Mike Nichols so there's not an ounce of fat in it.\" He added, \"Mr. Nichols keeps the comedy small, precise and spare. Further, the humor is never flattened by the complex logistics of movie making, nor inflated to justify them.\"[3] Rita Kempley of the Washington Post thought the film was \"an endearing adaptation\" and \"overall Nichols, Simon and especially Broderick find fresh threads in the old fatigues\" despite some \"fallow spells and sugary interludes.\"[4]Variety called it \"an agreeable but hardly inspired film\" and added, \"Even with high-powered talents Mike Nichols and Matthew Broderick aboard, [the] World War II barracks comedy provokes just mild laughs and smiles rather than the guffaws Simon's work often elicits in the theater.\"[5]Roger Ebert of the Chicago Sun-Times called the film \"pale, shallow, unconvincing and predictable\" and added, \"nothing in this movie seems fresh, well-observed, deeply felt or even much thought about ... It's just a series of setups and camera moves and limp dialogue and stock characters who are dragged on to do their business.\"[6]The film opened on 1,239 screens in the US and earned $7,093,325 on its opening weekend, ranking #1 at the box office. It eventually grossed $43,184,798 in the US and $8,500,000 in foreign markets for a total worldwide box office of $51,684,798.[2]","box_office":"$51.7 million[2]","Synopsis":"The story centers on Eugene Morris Jerome, a 20-year-old Jewish Brooklynite who is drafted into the United States Army during the last year of World War II and is sent to Biloxi, Mississippi for basic training. While there he learns to cope with fellow soldiers from all walks of life, falls in love, and loses his virginity in less than ideal circumstances, all while having to cope with an eccentric drill instructor.","cinematography":"Bill Butler","production_company":"Rastar","directed_by":"Mike Nichols","biloxi_blues":"Original poster","Soundtrack":"Period songs heard on the soundtrack include:","release_dates":"March 25, 1988 (1988-03-25)|||||","produced_by":"Ray Stark","starring":"Matthew Broderick|Christopher Walken|","running_time":"107 minutes","music_by":"Georges Delerue","edited_by":"Sam O'Steen","written_by":"Neil Simon","budget":"$20 million[1]"}