{"based_on":"Days of Wine and Roses by JP Miller","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"JP Miller","Plot":"San Francisco public relations executive Joe Clay (Jack Lemmon) meets and falls in love with Kirsten Arnesen (Lee Remick), a secretary. Kirsten is a teetotaler until Joe introduces her to social drinking. She is reluctant at first, but after her first few Brandy Alexanders, she admits that having a drink \"made me feel good.\" Despite the misgivings of Kirsten's father (Charles Bickford), who runs a San Mateo landscaping business, they marry and have a daughter named Debbie.Joe and Kirsten slowly go from the \"two-martini lunch\" to full-blown alcoholism. Joe is demoted due to poor performance, and is sent out of town to work on a minor account. Kirsten is alone all day, and finds the best way to pass the time is to drink. While drunk one afternoon, she causes a fire in their apartment and almost kills herself and their child. Joe eventually gets fired, and goes from job to job over the next several years.One day, Joe walks by a bar and looks at his reflection in the window, and finds to his horror that he barely knows his own face. He goes home and tells Kirsten that they have to stop drinking, and she reluctantly agrees. Seeking escape from their addiction, Joe and Kirsten work together in Mr. Arnesen's business and succeed in staying sober for two months. However, the urges are too strong, and after a late-night drinking binge, Joe destroys his father-in-law's greenhouse and plants while looking for a stashed bottle of liquor.Joe is committed to a sanitarium, where he suffers from delirium tremens while confined in a straitjacket. After his release, Joe finally gets sober for a while, with the help of Alcoholics Anonymous, a dedicated sponsor named Jim Hungerford (Jack Klugman) and regular AA meetings. When Joe tries to help Kirsten, he instead ends up drinking again, and goes to a liquor store that closed for the night. Joe breaks into the store and steals a bottle, resulting in another trip to the sanitarium stripped down and tied to a treatment table.Hungerford warns him that he must keep sober no matter what, even if that means staying away from Kirsten. He explains to Joe how alcoholics often demonstrate obsessive behavior, pointing out that Kirsten's previous love of chocolate may have been the first sign of an addictive personality, and counsels him that most drinkers hate to drink alone in the company of sober people.Joe finally gets sober, becomes a responsible father to Debbie and holds down a steady job. He tries to make amends with his father-in-law by offering him a payment for past debts and wrongs, but Mr. Arnesen accuses him of being indirectly responsible for Kirsten's alcoholism. After calming down, Arnesen says that Kirsten has been disappearing for long stretches of time and picking up strangers in bars.One night, after Debbie is asleep, Kirsten, shakily sober for two days, comes to Joe's apartment to attempt a reconciliation. Joe replies that she is welcome back anytime, but only if she stops drinking. Kirsten refuses to admit she's an alcoholic, but does acknowledge that without alcohol, she \"can't get over how dirty everything looks.\" Kirsten sadly advises Joe to give up on her, and leaves. Joe fights the urge to go after her, and looks down the street as she walks away. When Debbie asks \"Daddy, will Mommy ever get well?\" he replies gently, \"I did, didn't I?\" Again Joe looks down the street, the bar's flashing sign reflecting in his window.","language":"English","Reception":"The producers used the following ironic tagline to market the film:The picture opened in wide release in the United States on December 26, 1962. The box office receipts for the film were good given the numbers reported are in 1962 dollars. It earned $4 million in US theatrical rentals,[7] making it the 15th highest grossing film of the year. Total domestic sales were $8,123,077.[1]The film became one of Blake Edwards' best-regarded films, opening to praise from the critics and audiences alike. New York Times film critic Bosley Crowther wrote, \"[It] is a commanding picture, and it is extremely well played by Mr. Lemmon and Miss Remick, who spare themselves none of the shameful, painful scenes. But for all their brilliant performing and the taut direction of Blake Edwards, they do not bring two pitiful characters to complete and overpowering life.\"[8]The staff at Variety magazine liked the film, especially the acting, writing, \"Miller's grueling drama illustrates how the unquenchable lure of alcohol can supersede even love, and how marital communication cannot exist in a house divided by one-sided boozing... Lemmon gives a dynamic and chilling performance. Scenes of his collapse, particularly in the violent ward, are brutally realistic and terrifying. Remick, too, is effective, and there is solid featured work from Charles Bickford and Jack Klugman in fine supporting performances.\"[9]In a review of the DVD, critic Gary W. Tooze lauded Edwards' direction and the acting, writing, \"Blake Edwards's powerful adaptation of J.P. Miller's Playhouse 90 story, starring Jack Lemmon and Lee Remick in career performances, remains a variation in his body of work largely devoted to comedy... Lemmon is at his best and ditto for Remick in this harrowing tale of people consumed by their mutual addiction. This turns to an honest and heartbreaking portrayal of alcoholism as deftly done as any film I can remember.\"[10]Margaret Parsons, film curator at the National Gallery of Art, said, \"[The film] remains one of the most gut-wrenching dramas of alcohol-related ruin and recovery ever captured on film...and it's also one of the pioneering films of the genre.\"[11]The review aggregator Rotten Tomatoes reported that 100% of critics gave the film a positive review, based on seven reviews.[12]Academy Awards Wins (1963)[13]Academy Awards Nominations (1963)Other winsOther NominationsOther honors","days_of_wine_and_roses":"Theatrical release poster","box_office":"$8,123,077[1]","cinematography":"Philip H. Lathrop","production_company":"Jalem Productions","directed_by":"Blake Edwards","Home media":"A DVD of the film was released on January 6, 2001 by Warner Home Video. The DVD contains an extra commentary track by director Blake Edwards, and an interview with Jack Lemmon. A laserdisc was released in 1990.","release_dates":"December 26, 1962 (1962-12-26) (United States)|||||","Production":"JP Miller found his title in the 1896 poem \"Vitae Summa Brevis Spem Nos Vetat Incohare Longam\" by the English writer Ernest Dowson (1867–1900):[3] It also inspired the title song devised by Henry Mancini and Johnny Mercer.Coincidentally, Johnny Mercer, who wrote the lyrics for the title tune, had also written the lyrics for the theme from Laura, a 1944 film in which Dowson's poem is quoted in its entirety.Miller's teleplay for Playhouse 90, also titled Days of Wine and Roses, had received favorable critical attention and was nominated for an Emmy Award in the category \"Best Writing of a Single Dramatic Program - One Hour or Longer.\" Manulis, a Playhouse 90 producer, decided the material was ideal for a movie. Some critics observed that the movie lacked the impact of the original television production, which starred Cliff Robertson as Joe and Piper Laurie as Kirsten. In an article written for DVD Journal, critic D.K. Holm noted numerous changes that altered the original considerably when the material was filmed. He cites as an example the hiring of Jack Lemmon. With his participation \"little remained of the founding teleplay, except for actor Charles Bickford reprising his role.\"[4]The film's Northern California locations included San Francisco, Albany and the Golden Gate Fields racetrack. The Oscar-winning title song had music by Henry Mancini and lyrics by Johnny Mercer. Single records by Andy Williams and the Henry Mancini chorus made the Billboard Top 40.Director Blake Edwards became a non-drinker a year after completing the film and went into substance recovery. He said that he and Jack Lemmon were heavy drinkers while making the film.[5] Edwards used the theme of alcohol abuse often in his films, including: 10 (1979), Blind Date (1987) and Skin Deep (1989). Both Lemmon and Remick sought help from Alcoholics Anonymous long after they had completed the film. Lemmon revealed to James Lipton on Inside the Actors Studio his past drinking problems and his recovery. The film had a lasting effect in reinforcing the growing social acceptance of Alcoholics Anonymous.[6]In the same Inside the Actors Studio interview, Lemmon stated that there was pressure by the studio to change the ending. To preserve the integrity of the movie, scenes were filmed in the same order as they appeared in the script, with the last scene filmed last. This is in contrast with the standard practice of filming different scenes together that take place in the same location, which reduces expenses, shortens the schedule and aids with scheduling the actors' time on set. Immediately following the completion of filming, Lemmon left for Europe and remained out of communication so that the studio would be forced to release the movie without changing the storyline.","produced_by":"Martin Manulis","starring":"Jack Lemmon Lee Remick Charles Bickford Jack Klugman Alan Hewitt","running_time":"117 minutes","music_by":"Henry Mancini","edited_by":"Patrick McCormack"}