{"crazy_as_hell":"DVD cover","directed_by":"Eriq La Salle","release_dates":"September 27, 2002","produced_by":"Butch Robinson Michael Huens (line producer)","starring":"Eriq La Salle Michael Beach Ronny Cox Tia Texada","running_time":"113 min.","language":"English","Synopsis":"Psychiatrist Dr. Ty Adams (Michael Beach) comes to the Sedah State Mental Hospital to film a documentary. While coming across self-assured and overconfident, Adams is secretly haunted by the death of his daughter. He strikes up a friendship with the facility's administrator, Dr. Samuel Delazo (Ronny Cox), playing an ongoing chess game with him. Adams is intrigued by a patient named Barnett (Eriq La Salle) who claims to be Satan and takes a personal interest in his case.When a patient goes to the roof to commit suicide, Adams arrogantly prevents the police from accessing the roof and attempts to talk her down himself. Barnett inexplicably appears on the rooftop and reveals jarring truths about Adams, and the patient subsequently jumps to her death. The incident calls a halt to the documentary. Adams declares Barnett a danger to the other patients and has him placed in solitary. Adams tracks down Barnett's mother and, satisfied that he had uncovered Barnett's real identity, prepares to move on from the facility. Adams and Dr. Delazo regretfully say their goodbyes, their chess game unfinished. Just before he leaves, Barnett's mother arrives and asks him to take a fruit basket to her son. She asks Adams if he believes in God, and he replies that he doesn't.He takes one last look at Barnett straitjacketed in his cell, but when he is distracted by an orderly (Sinbad), he looks back into the room to find it empty. Turning back to the hallway, he sees Barnett's mother taking off a wig, revealing herself to be Barnett in women's clothes. Pursuing him, Adams stumbles into a bedroom where he finds his own bloody corpse, apparently having killed himself over his daughter's death. He suddenly is in a library where Dr. Delazo sits on a throne as the devil surrounded by the patients and staff, all horribly transformed. Delazo says, \"Checkmate.\" Adams shouts that it isn't real, and that he knows who he is. Delazo asks \"Who are you?\" Adams says he's a good man. Delazo replies \"Then why are you here?\" As Adams keeps protesting that he's a good man, the screen fades to black.","written_by":"Jeremy Leven"}