{"convoy":"Original UK poster","country":"United Kingdom","distributed_by":"ABFD (UK) RKO Pictures (US)","Plot summary":"A Royal Navy cruiser returns to base to find all leave has been cancelled and they are to start out straight away for a special mission. Supplemented with a new 1st officer, who turns out to have caused the captain's divorce a few years earlier, they are sent to meet a convoy in the North Sea and escort it safely into British coastal waters. One stubborn freighter captain, who has the cargo hold full of refugees, mainly Jews, refuses to join the convoy and is captured by a U-boat which sets a trap for the convoy escort. One of the passengers is the former wife of the cruiser's captain, as well as the former lover of its 1st officer, and this is something the Germans make use of when sending urgent messages from the freighter, claiming it is sinking and naming her as one of the passengers. When the ex lover takes the bite and tries to send a destroyer to the freighter's rescue, the captain locks him up, as all ships must protect the convoy. Eventually, a North Sea patrol destroyer comes to the rescue instead, sinks the U-boat and takes the freighter on tow to the convoy, where the captain and his ex wife meet and come to an understanding.However, the German pocket battleship Deutschland soon emerges and, although his cruiser is hopelessly outgunned, the captain decides to attack in order to keep the battleship away from the convoy until British battleships arrive. During the battle, the captain and his wife's former lover reconciles before the ex lover dies trying to save the ship. The British battleships arrive at the last minute.","language":"English","cinematography":"Roy Kellino Günther Krampf","production_company":"Ealing Studios","directed_by":"Pen Tennyson","Soundtrack":"The music is by Ernest Irving and includes a slowed down version of \"Rule, Britannia!\".","release_dates":"5 July 1940 (1940-07-05) (UK[1])|3 January 1941 (1941-01-03) (US)||||","produced_by":"Michael Balcon","starring":"Clive Brook John Clements Edward Chapman Judy Campbell","running_time":"90 minutes 78 minutes (US)","music_by":"Ernest Irving","edited_by":"Ray Pitt","Release":"The film premiered at the New Gallery Cinema in London on 5 July 1940, as part of a double bill with The Saint's Double Trouble.[1]The reviewer in The Times wrote that \"this film up to a point succeeds in giving some idea of the work implied in the title. The pity is that it did not go farther, risk the charge of being labelled documentary\". but concluded that the film \"has some substantial merits to set against its lack of austerer virtues.\"[3]After the film had opened at the Rialto in New York City in January 1941, the reviewer in The New York Times wrote, \"if the film fails in its frankly propagandistic mission it is because of spurious craftsmanship and because it is a little too self-consciously heroic. British seamen deserve a document more honest than this...The authenticity of some actual shots at sea he (Michael Balcon) has compromised by dovetailing them with scenes in which model cruisers and destroyers fight a furious but obvious duel in a studio tank. The actors, including Clive Brook and John Clements, are all so teddibly British in the face of grave danger that their calm becomes unconvincing.\"[4]","written_by":"Patrick Kirwan Pen Tennyson"}