{"based_on":"Banlieue 13   by Luc Besson Bibi Naceri","country":"France Canada","distributed_by":"Warner Bros. (UK) Relativity Media (USA) VVS Films (Canada)","screenplay_by":"Luc Besson","Plot":"In 2018, in a dystopian Detroit, abandoned brick mansions left from better times now house only the most dangerous criminals. Unable to control the crime, the police have constructed a colossal containment wall around this area to protect the rest of the city. For undercover cop Damien Collier (Paul Walker), every day is a battle against corruption. For ex-convict Lino (David Belle), every day is a fight to live an honest life. Their paths never should have crossed, but when drug kingpin Tremaine (RZA) kidnaps Lino’s girlfriend, Damien reluctantly accepts Lino's help and together they struggle to stop a sinister plot that involves a stolen bomb set to destroy the entire city.Eventually, with the help of Lino and Tremaine, Damien realizes that his father was killed by his fellow officers and that the mayor was behind the plot. Damien, Lino and Tremaine confront the mayor and manage to prove his true intentions and have him arrested. Brick Mansions is welcomed back into the city, with Damien and Lino continuing their friendship.","language":"English","Reception":"Reviews for Brick Mansions have been generally negative. Rotten Tomatoes gives a 26% rating based on 88 reviews. The site's consensus states, \"Choppily edited and largely bereft of plot, Brick Mansions wastes a likable cast on a pointless remake of the far more entertaining District 13.\"[11] Metacritic gives the film a 40/100 rating, based on 28 critics, indicating \"mixed or average reviews\".[12] However, some critics have been more positive. Isaac Feldberg of We Got This Covered called the film \"a highly entertaining action thriller\". He also remarked, \"If Brick Mansions is to serve as his [Paul Walker's] final work, it's relieving, at least, to know that it's his best, and an appropriately sensational capstone to a career built on pulse-pounding, jaw-dropping action spectaculars.\" Variety's Justin Chang added that the film was \"propulsively entertaining.\"","box_office":"$69 million[3]","cinematography":"Christophe Collette","production_company":"EuropaCorp Canal+ Ciné+ D8","directed_by":"Camille Delamarre","release_dates":"April 23, 2014 (2014-04-23) (France)|April 25, 2014 (2014-04-25) (Canada & US)||||","Production":"Principal photography began on April 30, 2013, and the film was released in 2014 by EuropaCorp. Relativity Media distributed the film.[4] Following Walker's death, the North American release was scheduled for February and French release for April 23.[5][7] On February 6 2014, Relativity and EuropaCorp announced a move to April 25, 2014 as a release date for the film, along with paying the cost of the film’s world premiere and distribution.[8]","produced_by":"Claude Léger Jonathan Vanger","starring":"Paul Walker David Belle RZA","running_time":"90 minutes[1]","music_by":"Trevor Morris","edited_by":"Carlo Rizzo Arthur Tarnowski","Release":"The first official trailer was released on February 13, 2014, featuring the DJ Snake and Lil Jon song \"Turn Down for What\".[9] The second full trailer was released on March 20, 2014.[10]","brick_mansions":"Theatrical release poster","budget":"$23 million[2]"}