{"based_on":"Barney's Version  by Mordecai Richler","Cast":"There were also cameos by Canadian directors Atom Egoyan (early director of Barney's soap opera Constable O'Malley of the North), David Cronenberg (later director of Barney's soap), Paul Gross (star in Barney's soap), Denys Arcand (Jean, the maître d' at both of Barney and Miriam's luncheons beside the duck pond at Montreal's Ritz-Carlton), and Ted Kotcheff (train conductor).","country":"Canada","distributed_by":"Sony Pictures Classics","Plot":"Barney Panofsky is living with his best friend Boogie (Speedman) in Rome. He marries the mentally disturbed and unfaithful Clara Charnofsky (Lefevre) after she tells him she is pregnant with his child. Barney later finds out the child is not his, and he demands they separate. Clara commits suicide, and a devastated Barney decides to return home to Montreal.Barney soon gets a job back home and meets the woman who becomes his nameless second wife (Driver), the daughter of a wealthy Jewish family. At their lavish wedding, Barney meets Miriam Grant (Pike), and immediately falls in love. He tells Miriam his feelings for her that night but she rejects him. Despite his marriage, Barney sends Miriam flowers and gifts. Barney later picks up Boogie, who is in the middle of detox therapy, for a few days at Barney's lake house. He eventually finds Boogie in bed with his wife. Barney is at first overjoyed that he has an excuse to divorce her and pursue Miriam, but questions Boogie's integrity. The two argue, firing rounds from Barney's gun into the air before Barney collapses onto his dock and passes out, and a drunk Boogie falls backwards into the lake. When Barney awakens, it appears that he has shot Boogie. An abusive detective (Mark Addy) tries to beat a confession out of Barney until Barney's father, Izzy (Hoffman), intervenes. Barney continues to believe that Boogie ran away, and throughout the movie waits for him to reappear.With his divorce finalized, Barney asks Miriam out on a date. He travels to New York City to meet her, and they finally begin a relationship. They marry and have two children as Barney gets a job producing a television series. Izzy later dies in a brothel, causing Barney to laugh and cry and call his father a \"King\". Barney and Miriam live happily until, on another vacation to the lake house, Barney meets Blair (Bruce Greenwood), who works in radio, Miriam's old line of work. There is an immediate platonic connection between Blair and Miriam, much to Barney's noticeable consternation.After Barney and Miriam's son, Michael, leaves the family home, Miriam informs Barney of her intention to return to work. He attempts to dissuade her but she persists and secures employment, thanks to support from Blair.Miriam begins work on a radio station but Barney misses her first on air interview - because he \"was drunk and watching the hockey game, like has happened a thousand times before\".Barney is rude and dismissive to Miriam's colleagues but she remains steadfastly faithful to him despite his picaresque behaviour. Eventually his bad behaviour results in Miriam taking a week long visit to their son Michael's place in NYC.While Miriam is absent, Barney gets drunk at a bar and ends up having sex with a former actress on his show. Miriam returns from NYC and is eager to pick up where they left off but Barney tells her about his infidelity and the two divorce. Miriam later marries Blair.Barney, who displayed small signs of a deteriorating memory earlier in the film, forgetting where he had left his car on two occasions, now begins to show signs of acute memory loss, potentially Alzheimer's Disease or Dementia, though a clear diagnosis is never given.Boogie's body is discovered in the mountains near the lake house, apparently dead from injuries suggestive of a sky diving accident.Barney and Miriam meet for lunch in a favourite restaurant and she offers help, as a friend. She goes to the bathroom and when she returns Barney has paid for the meal but forgotten his wallet. She follows him and, by the time she catches up to him, he has forgotten that they were divorced. He speaks to her as if it was years earlier, assuming that they're still married and that their children are quite young.Barney's condition worsens until his death. While his children are helping settle some of his affairs at the lake house, they observe a \"water bomber\" plane scoop up water from the lake and dump it on a fire on the mountainside, showing the children what had probably happened to Boogie. (He had been scooped up by a water bomber plane by accident and dropped in the mountains.)The final scene shows Miriam visiting Barney's grave, leaving roses at a tombstone bearing both of their names.","language":"English","Reception":"Barney's Version has received mostly positive reviews. Review aggregation website Rotten Tomatoes reports that 80% of critics have given the film a positive review based on 125 reviews, with an average score of 6.7/10.[5]The film grossed $472,892 in Canada over its first few weeks.[6] As of April 17, 2011, the film had grossed $4.3 million in the United States and a total of $8 million worldwide. Most of the worldwide box office was in Italy[7]","box_office":"$8.5 million[1]","cinematography":"Guy Dufaux","directed_by":"Richard J. Lewis","release_dates":"September 10, 2010 (2010-09-10) (Venice)|December 24, 2010 (2010-12-24) (Canada)||||","Production":"After being in development for 12 years, the film was released in September 2010 with Paul Giamatti in the title role. It was directed by Richard J. Lewis and produced by Robert Lantos from a screenplay by Michael Konyves. Filming took place in Montreal, Lake Memphremagog, Rome and New York. Special effects were produced by Modus FX in Montreal.","barney's_version":"Film poster","produced_by":"Robert Lantos","starring":"Paul Giamatti|Rosamund Pike|Minnie Driver|Rachelle Lefevre|Scott Speedman|Dustin Hoffman|","running_time":"134 minutes","edited_by":"Susan Shipton","written_by":"Michael Konyves","budget":"$30 million"}