{"country":"United States","distributed_by":"Hart Sharp Video","Plot":"Irene Morrison (Vera Farmiga), a working class mother of two boys, lives in Upstate New York and works as a supermarket cashier. She also harbors a cocaine addiction. Her eldest son, Ben (Jasper Daniels), whose birthday is approaching, asks Irene to buy a snake for him; she suggests Lego instead. On the night of Halloween, Irene takes her kids trick-or-treating and, at one of the houses they visit, she meets Bob (Hugh Dillon), a nurse.Later that night, her husband Steve (Clint Jordan) arrives home with a toilet, announcing he's going to build them a second bathroom. In bed, Steve tries to initiate sex, but Irene says she doesn't feel very sexy. She changes the subject back to decorating their bathroom. The next day, Irene takes the kids to a reptile store to buy a snake, but finds that they don't have enough money for one. While her boys wait in the car, Irene visits her dealer, asking him for another fix, but he refuses since she hasn't been paying for the last couple of weeks.At work, Irene contemplates taking money from the cash register. She then goes back to her dealer with Ben's birthday check from her mother-in-law, but the dealer refuses to take it. Afterwards, Irene checks herself into a drug rehabilitation center. At a meeting about cravings, she meets fellow addict Lucy (Caridad de la Luz), and befriends her. While at the facility, Irene again encounters Bob. Before she leaves, Bob visits with a book that helped him during his quitting phase, and offers her his support.At Irene's first Narcotics Anonymous meeting, a man celebrates one year of abstinence. In the following weeks, Irene finds it difficult to stay clean when her friends use drugs around her recreationally. One day at work, she is called into the manager's office. She admits her past drug use and is subsequently fired. Lucy suggests they start a cleaning business in order to gain money, to which Irene agrees. On the way to her next NA meeting, Irene offers to give Bob a ride. However, in the car, she instigates an affair with him. Bob then takes her to a snake breeder so she can purchase one for Ben. Later on, the two become intimate, but Bob excuses himself to the bathroom. Irene then walks in to find him shooting up. Furious at his hypocrisy, she argues with him but ends up using his drugs.Irene and Steve attempt to play a sexual game with one another while using coke, but it becomes awkward. After using in Bob's car one night, the two are pulled over by the police. They are both arrested and detained when an officer finds a drug burner on the dashboard and one gram of cocaine. A lawyer briefs Irene on her charge of 50 individual counselling sessions, 100 group counselling sessions, and 250 NA meetings a year; he then informs her that if she screws up, she'll be sentenced to time in a state prison. When she arrives home, she admits her affair to Steve, who orders her to move out.Lucy gives her a place to crash, although she's angry with Irene for flaking out on a job. Irene eventually finds herself a house. Following another of Irene's Narcotics meetings, Bob shows up to apologize for getting her caught up in his mess and for subsequently avoiding her calls. Irene forgives him and he begins to stay at her house. Meanwhile, Bob is using, but intends to start going to support meetings again. His dealer tries to persuade him to sell some pills, but he refuses. Irene realizes he's been getting high, and as a result endangered her kids; she confronts him and silently asks him to leave.","language":"English","Reception":"Down to the Bone was given a limited release in the United States on November 25, 2005. The film made a total of $7,352 in its opening weekend from two theaters (in New York City and Los Angeles). It made an additional $22,889 from film screenings, for a total domestic gross of $30,241.[3] With international takings, the film made a total of $43,674 worldwide.[2]The film has received critical acclaim from film critics. On the review aggregator website Rotten Tomatoes, Down to the Bone holds a 94% approval rating, based on 33 reviews, with an average rating of 7.7/10. The site's consensus reads, \"A vivid portrayal of the effects of drug abuse that avoids cinematic clichés, Down to the Bone is a winning effort by first-time director Debra Granik and features a breakout performance by Vera Farmiga.\"[4] On Metacritic, the film scored a rating of 76 out of 100, based on 13 reviews, indicating \"generally favorable reviews\".[5]San Francisco Chronicle critic G. Allen Johnson gave a positive review, writing: \"Rarely is a shoestring-budget movie as maturely directed and well-acted as Down to the Bone, an intriguing film about a normal working woman trying to kick a cocaine habit. The film is so pitch perfect and realistic, it seems you are there with these people, watching their lives unfold before you as it happens.\"[6] Owen Gleiberman of Entertainment Weekly also praised the film, stating: \"From movies, you'd never guess the degree to which drug addiction is a small-town pastime. Vera Farmiga, the star of Down to the Bone, has the face of the world's saddest Madonna, and she's flat-out remarkable as Irene, a financially strapped mother of two who works as a cashier at a megamart-style superstore and snorts cocaine to get through the day. Irene's long straight hair has begun to turn stringy, and she rarely wears makeup, but beneath her sallow skin and dead eyes, you can glimpse the carefree, pretty, slightly hip party girl she once must have been.\"[7]","box_office":"$43,674[2]","cinematography":"Michael McDonough","production_company":"Susie Q Productions Down to the Bone Productions","directed_by":"Debra Granik","release_dates":"January 15, 2004 (2004-01-15) (Sundance)|November 25, 2005 (2005-11-25) (United States)||||","Production":"The film, which addresses the effects of drug addiction, was directed and co-written by Debra Granik. The film takes place in upstate New York and was filmed in and around Kingston, New York. Down to the Bone is Granik's first feature film and was filmed on digital video. Granik went on to direct the 2010 Oscar nominated film Winter's Bone.","down_to_the_bone":"Theatrical release poster","produced_by":"Susan Leber|Anne Rosellini|","starring":"Vera Farmiga|Hugh Dillon|","running_time":"110 minutes","edited_by":"Malcolm Jamieson","written_by":"Debra Granik|Richard Lieske|","budget":"$500,000[1]"}