{"country":"United States","distributed_by":"Allied Artists","Plot":"A group of scientists land on a remote island in the Pacific Ocean to search for the previous expedition that disappeared without a trace and to continue their research on the effects of radiation from the Bikini Atoll nuclear tests on the island's plant and sea life. They learn to their horror that the earlier group have been killed and eaten by two mutated, intelligent giant crabs, who have also absorbed the minds of their victims and can speak telepathically in the voices of their victims.Members of the current expedition are then systematically attacked and killed by the monsters, which are now invulnerable to most standard weaponry because of the mutations to their cell structures. The remaining scientists finally discover that both giant crabs are the cause of the ongoing earthquakes and landslides on the island; they are slowly destroying the island, reducing its size. The scientists turn their attention to a way to stop the mating pair of monsters from reproducing.As the island continues to fall away into the Pacific, and after barely escaping from a laboratory that is about to collapse, the surviving trio witness up close one of the intelligent giant crabs, Hoolar, for the first time. Hoolar speaks to them via telepathy and vows to go to the mainland with her fertilized eggs when the island is gone (and the three scientists are dead) to feed upon on even more humans, absorbing those minds in the process. One of the remaining three then sacrifices himself in order to kill the monster and her unhatched brood.Following the giant's destruction, the two survivors embrace on the small portion of what remains of the island.","language":"English","Reception":"According to Tim Dirks, the film was one of a wave of \"cheap teen movies\" released for the drive-in market. They consisted of \"exploitative, cheap fare created especially for them [teens] in a newly-established teen/drive-in genre\".[7]Film reviewer Glenn Erickson, writing retrospectively in DVD Savant, noted that for Corman, Attack of the Crab Monsters was \"... (a) more ambitious production, it covers the methodical destruction and inundation of an entire island – all of which occurs off-screen. Charles B. Griffith's screenplay keeps the story hopping for just over an hour but limits the show to a minimum of locations\".[8] In his book Horror and Science Fiction Film IV, Donald C. Willis noted that a \"spare script gets a lot mileage out of the eerie idea of the disembodied voices\" and that \"the film \"in fact has several interesting ideas, but generally perfunctory action and dialogue, and the monsters are visually unprepossessing\".[9]","box_office":"$1 million (est.)","cinematography":"Floyd Crosby","production_company":"Allied Artists","directed_by":"Roger Corman","Proposed remake":"Jim Wynorski, who remade another Corman/Griffith film, Not of This Earth, for Corman, loved Attack of the Crab Monsters and wanted to remake it. He said a script was written, but \"he (Corman) didn't want to do it -- he thinks too much of the original film to do a remake\".[10]","Theatrical release":"The film was distributed as the main feature on a standard double bill theatrical release with Corman's Not of This Earth. Earning an estimated $1 million,[2] Attack of the Crab Monsters was Corman's most profitable production up to that time, which he attributed to the \"wildness of the title,\" the construction of the storyline,[2] the structuring of every scene for horror and suspense, and editing for pace.[4] Corman:This was the most successful of all the early low budget horror movies. I think its success had something to do with the wildness of the title which, even I admit, is pretty off-the-wall. However, I do think a lot of its popularity had to do with the construction of the plotline. I've always believed that, in horror and science fiction films, too much time is usually spent explaining the characters in depth and developing various subplots. Genre audiences really come to these movies for their science fiction elements or their shock value. Of course they want to understand the characters and want to empathize with them all in order to share the emotions present. But they don't wish to do that at the expense of the other aspects of the picture. I talked to Chuck Griffith about this. Chuck and I worked out a general storyline before he went to work on the script. I told him, 'I don't want any scene in this picture that doesn't either end with a shock or the suspicion that a shocking event is about to take place.' And that's how the finished script read. You always had the feeling when watching the movie that something, anything was about to happen. I think this construction, plus the fact that the creature was big and ugly, won audiences.[5]Corman has stated that the success of the film convinced him that horror and humor was an effective combination.[6]","release_dates":"February 10, 1957 (1957-02-10) (US)|||||","Production":"The script was written by Charles B. Griffith, who had worked with Roger Corman on a number of occasions. Griffith later described the scripting process:\"Roger came to me and said, 'I want to make a picture called Attack of the Giant Crabs and I asked, 'Does it have to be atomic radiation?' He responded, 'Yes.' He said it was an experiment. 'I want suspense or action in every scene. No kind of scene without suspense or action.' His trick was saying it was an experiment, which it wasn't. He just didn't want to bother cutting out the other scenes, which he would do\".[1]The film's budget was $70,000.[2][2]Griffith directed some underwater sequences (and also appeared in a small role). Griffith said,\"I had just read 'The Silent World' by Jacques Cousteau and found it to be new and exciting. So when that picture came along, I wrote all the underwater stuff and went to Roger and told him I’d direct all the underwater parts for $100. He said 'okay.' If I had just asked, he would have said 'no.' I had to put it in a way that he would jump at. So I directed all that stuff and it was rather funny. I’d be down at the bottom of the tank at Marineland trying to get actors to do something while (director of photography) Floyd Crosby was hammering at the glass window trying to get them to do something else. (Laughs.) It was all pretty silly\".[3]","attack_of_the_crab_monsters":"Theatrical release poster by Reynold Brown","produced_by":"Roger Corman","starring":"Richard Garland Pamela Duncan Russell Johnson","running_time":"62 minutes","music_by":"Ronald Stein","External links":"","edited_by":"Charles Gross","written_by":"Charles B. Griffith","budget":"$70,000"}