{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Analisa LaBianco Jeff Bushell","story_by":"Jeff Bushell","Plot":"In Beverly Hills, California, wealthy heiress Vivian \"Viv\" Ashe leaves her richly pampered pet chihuahua, Chloe, with her irresponsible niece, Rachel, while she embarks on a business trip for ten days. Papi, the gardener Sam's pet Chihuahua of Mexican descent, has an unrequited crush on Chloe, by which she is disgusted. Rachel decides to go to Mexico with her friends and stay at a hotel by the beach. When Rachel leaves Chloe alone in the hotel room to go dancing at a club, Chloe goes looking for her. Chloe gets dog-napped as she tries to find Rachel and is sent to the dog fights in Mexico City. There, she meets a street-smart German Shepherd named Delgado. Rachel comes back to the hotel and is frantic when she finds Chloe missing.Chloe is picked to fight in the pit against El Diablo, a fierce Argentinean-Bolivian Doberman Pinscher. Delgado helps her escape the dog fights, unleashing the other dogs from their cages and unlocking the ring to allow both Chloe and himself to flee. After several arguments, he then decides to return her to Beverly Hills safely.Meanwhile, Rachel and Sam go to the Mexican police and offer rewards in an effort to find Chloe. El Diablo is sent by the dog fight ringleader, Vasquez, to capture Chloe and obtain the reward from Rachel. Delgado and Chloe arrive at Puerto Vallarta, where Chloe is caught by El Diablo but rescued. She then waits for Delgado to find help but is tricked into handing over her diamond-studded necklace to con artists Chico, an iguana, and Manuel, a pack rat who claims to be from the Yucutan. Chloe and Delgado sneak onto a train heading towards the border, but they are caught and are forced to jump out, eventually arriving in the barren deserts of Chihuahua, where Delgado explains that he was a former police dog; he was retired after he lost his sense of smell during a raid and a sneak attack from El Diablo.Rachel and Sam are in Puerto Vallarta and find that Chloe was spotted in the state of Chihuahua. After tracking Chloe and Delgado from Mexico City, El Diablo arrives in Chihuahua and attempts to capture Chloe, but Papi saves her and ends getting captured in a cage inside an abandoned Aztec temple, but Delgado comes to rescue the two and is briefly defeated. Chloe then rescues Papi, but Delgado discovers that El Diablo had vanished. Rachel finds Chloe, and Vasquez get arrested by the police. Chloe returns safely to Beverly Hills without Vivian finding out what happened and accepts a romantic relationship with Papi, as well as Rachel with Sam. The characters' fates are later revealed:","language":"English","Reception":"Beverly Hills Chihuahua received mixed reviews from critics. As of 2015, review aggregator Rotten Tomatoes reported that 41% of critics gave positive reviews based on 96 reviews; the website's consensus state, \"Despite hitting some sweet notes, Beverly Hills Chihuahua is little more than disposable family entertainment.\"[5] Metacritic reported that the film had an average score of 41 out of 100 based on 22 critics, which is considered \"mixed or average reviews\".[6] Mark Olsen of the Los Angeles Times wrote in his review that \"One could try to overlook the film's view of Mexico as an either-or land of resort poshness and street-level poverty, chiefly populated by criminals and hustlers of all stripes, except that view forms the entire film, driving the narrative impulse by which the spoiled puppy makes her journey.\" Olsen also wrote \"Think of it as the Paris Hilton Complex, that idea of young people as little princesses and princes who get what they want, and what they want is easy pickings and a life without engagement.\"[7] Walter Addiego of the San Francisco Chronicle gave a positive review, writing, \"the film combines the themes of dignity and empowerment - 'We are tiny, but we are mighty', says the leader of a vast Chihuahua pack - with a story of a spoiled rich canine who learns not to be so high and mighty, the film hits all the typical Disney notes. There's even a politically correct message at the end advising would-be dog adopters to make sure they know what they're getting into.\"[8]Beverly Hills Chihuahua was a commercial success. The film grossed $29,300,465 on its opening weekend from 3,215 theaters, averaging about $9,114 per theater, and ranking number 1 at the box office for that weekend.[9] On its second weekend, the film arrived number 1 again with $17,502,077.[10] As of May 10, 2009, Beverly Hills Chihuahua has grossed $94,514,402 domestically and $54,767,204 in other territories leading up to a total of $149,281,606 worldwide.Beverly Hills Chihuahua was released by Walt Disney Studios Home Entertainment on March 3, 2009 in the US and May 25, 2009 in the UK on Disney DVD and Blu-ray. As of November 1, 2009, the DVD has sold over 3 million copies generating $59,918,764 in sales revenue.[11]","box_office":"$149.3 million","cinematography":"Phil Meheux","production_company":"Walt Disney Pictures Mandeville Films","directed_by":"Raja Gosnell","beverly_hills_chihuahua":"Theatrical release poster","release_dates":"September 25, 2008 (2008-09-25) (Australia)|October 3, 2008 (2008-10-03) (United States)||||","Production":"Chloe was named after writer Analisa LaBianco's dog, a 4-year-old Chihuahua.[3]The Cinesite studio used their specially developed pipeline for creating digital muzzle replacements, animated the many talking dogs. The in-house visual effects supervisor was Matt Johnson, and the animation supervisor was Alexander Williams. The chihuahua regularly changes throughout the film.[clarification needed]The film score was written by composer Heitor Pereira, who recorded the score with the Hollywood Studio Symphony at the Eastwood Scoring Stage at Warner Bros..[4]","produced_by":"David Hoberman Todd Lieberman John Jacobs Ricardo Del Río","starring":"Jamie Lee Curtis Piper Perabo Manolo Cardona Drew Barrymore Andy García George Lopez José María Yazpik Edward James Olmos","running_time":"91 minutes","Sequels":"A direct-to-video sequel was released for DVD and Blu-ray in February 1, 2011 by Walt Disney Studios Home Entertainment.[12] It was filmed in October 2009 in Los Angeles and George Lopez returned as the voice of Papi. Jamie Lee Curtis, Piper Perabo, Manolo Cardona, Drew Barrymore and Andy García do not reprise their roles.Another direct-to-video sequel was released for DVD and Blu-ray on September 18, 2012, with Lopez once again reprising his role as Papi, making him the only actor from the original film to appear in any of the sequels.[13]","music_by":"Heitor Pereira","edited_by":"Sabrina Plisco","budget":"$20 million[1]"}