{"country":"United States","distributed_by":"Lionsgate Films","screenplay_by":"Evan Spiliotopoulos","story_by":"Aristomenis Tsirbas","Plot":"Mala (Evan Rachel Wood) and her friend Senn (Justin Long) are young alien creatures who live on Terra, a planet from a star system in the Milky Way. Terra is a peaceful planet of alien creatures who have a rich semi-advanced culture.One day a large, mysterious object blocks the Terrian sun, piquing the Terrians' interest. However, since the Terrian culture bans the development of new technologies, such as telescopes, without the approval of the ruling council, none of the inhabitants are able to get a closer look at the huge object in their sky.Mala, who is inventive and headstrong, goes against the rules of her community and creates a telescope, which she takes out into the dark empty area outside the Terrian city and uses to view the object and witnesses smaller objects coming from the large object that turn out to be incoming scout spaceships. She returns to the city to find that the scout spaceships have already started abducting Terrians (who willingly offer themselves to the scout spaceships mistaking them as their new \"gods\").After Mala's own father, Roven (Dennis Quaid) is abducted she goads a ship into tailing her and lures it into a trap, which causes it to crash. Afterward, she saves the life of the pilot, revealed to be a human, an officer named Lieutenant Jim Stanton (Luke Wilson). After his personal robot assistant named Giddy (David Cross) warns Mala that Stanton will die without a supply of oxygen (which the Terrian atmosphere does not contain), she creates an oxygen generator and fills a tent with air containing oxygen so that Jim can breathe, and eventually convinces Giddy to teach her human language. The Robot informs Mala that the mysterious object is a generation ship called The Ark, containing humans from Earth.Centuries beforehand, both Mars and Venus were terraformed by humans and colonized. But 200 years later, the two planets demanded independence from Earth, which the Earth government refused to grant them due to the high demand of resources from the two colonies. The dispute between the three planets escalated into a violent interplanetary war that left all three planets uninhabitable. The Ark, containing the remnants of the human race, traveled for several generations looking for a new home. When Stanton awakes the robot informs Stanton and Mala that a crucial part of the ship was damaged in the crash, so Mala offers to make a replacement part herself. When Stanton, Mala, and the robot return to the crash site, they discover that the ship has been moved.The trio track the ship to a huge underground military facility which had been built by a previous, warlike generation of the Terrians. The trio realizes that despite the current peaceful nature of the Terrian city, the elders have secretly retained the military technology from the dark days of war. After infiltrating the facility, fixing the ship and flying back to the Ark, Jim orders Mala to stay and goes to be debriefed.Mala ventures off and finds Roven, but before she can rescue him, the human guards are alerted to her presence. While trying to save Mala, Roven kills himself and two men after breaching the hull, and she is captured, but Stanton helps her to escape back to Terra. The commander of the military wing of the Ark, General Hemmer (Brian Cox), takes power over the civilian leaders in a coup, and declares war on Terra, citing the deteriorating condition of the Ark. His goal is to annihilate the Terrians so that the humans can turn Terra into the new Earth. He plans to drop a huge machine onto the planet's surface—called the Terraformer—which will create an Earth-like atmosphere. Stanton is sent to be in the first group of space-fighters designated to defend the Terraformer, while General Hemmer will go down to the planet's surface in the Terraformer to personally supervise the terraforming process.After the humans drop the Terraformer machine onto the surface, it begins to replace the native gases with oxygen and nitrogen, which will asphyxiate the aliens. The terrian elders bring out all of the secretly-hidden military technologies from their secret base, and huge waves of Terrian glider-fighters attack the Terraformer machine. The human spacefighter ships begin a huge and bloody battle against the high-tech alien glider-fighters, and the sky is filled with laser cannon fire and explosions.Finally, as the Terraformer is close to completing its terraforming objective, Lieutenant Stanton realizes that annihilating all Terrians is morally wrong. He turns his ship towards the Terraformer machine and attacks it. As his ship is raked with anti-aircraft defensive fire, Stanton fires his air-to-air missiles at the Terraformer's command module, destroying it, and killing General Hemmer. His ship is destroyed in the resulting explosion. Knowing that he has done a good deed, he accepts his fate and dies calm and serene.An epilogue shows what happened in Terra some time later. The Terrians and the humans have decided to live in peace. With the Terraformer machine destroyed, the Terrian atmosphere becomes safe once again for the aliens. The Terrians create a sanctuary for the human colonists to live in, with an Earth-like atmosphere. In the human sanctuary, a large statue of Lieutenant Stanton is erected, in honor of his memory and sacrifice.","language":"English","Reception":"The film has received average reviews from critics. Based on 94 reviews collected by Rotten Tomatoes, the film has an average rating of 5.5/10, and a score of 48% from critics.[8] Another review aggregator, Metacritic, gives the film an average score of 54%, based on 19 reviews, and a user score of 7.1 (out of 10) based on 29 ratings.[9] The film opened at #12 in the United States, grossing $1,082,064 in 1,159 theaters with an average of $934 per theater. The film's international box office began May 14, 2009 in Russia with a 5th place opening of $332,634 at 83 screens. \"Battle for Terra's\" current worldwide total is $6,101,046.","box_office":"$6,129,529[1]","cinematography":"Aristomenis Tsirbas","production_company":"Roadside Attractions Snoot toons","directed_by":"Aristomenis Tsirbas","battle_for_terra":"Theatrical release poster","release_dates":"September 8, 2007 (2007-09-08) (TIFF)|May 1, 2009 (2009-05-01) (United States)||||","produced_by":"Ryan Colucci|Keith Calder|Dane Allan Smith|Jessica Wu|","starring":"Evan Rachel Wood|Brian Cox|James Garner|Chris Evans|Danny Glover|Amanda Peet|David Cross|Justin Long|Dennis Quaid|Luke Wilson|","running_time":"90 minutes","music_by":"Abel Korzeniowski","edited_by":"J. Kathleen Gibson","Release":"Roadside Attractions handled theatrical marketing in North America and used its business relationship with Lionsgate to open the film wide in the United States. Battle for Terra received uncharacteristically little marketing for a wide release film. The television campaign consisted of a small number of television spots on Cartoon Network and a handful of network television ads in select markets. Awareness for the film on its opening weekend was subsequently little to non-existent. This strategy of having a disproportionately small advertising campaign for a wide release was employed only one other time a year earlier with the film Delgo. The results for that film were disastrous as the $40 million Delgo grossed a mere $694,782 on 2,160 screens. The lower costing Battle for Terra fared considerably better by taking in more than twice as much revenue ($1,647,083) on roughly half as many screens (1,159) and continued on to gross $6 million internationally. Battle For Terra opened May 1 in the United States against 2 other wide releases: X-Men Origins: Wolverine (4,099 screens) and Ghosts of Girlfriends Past (3,175). Battle for Terra was released on DVD and Blu-ray Disc September 22, 2009 by Lionsgate Home Entertainment.[5] Battle for Terra was released in France in French and English version by Rézo Films on DVD and Blu-ray Disc October 20, 2010 and include a 3D version of the movie with 4 3D glasses.[6] A Region B Blu-ray 3D was released in Germany.[7]","budget":"$4 million"}