{"Cast":"Note: The striking abstract expressionist paintings in the film were created by internationally renowned artist Paul Jenkins who taught Alan Bates his painting technique for his acting role.[3]","country":"United States","distributed_by":"20th Century Fox","Plot":"Wealthy New York City wife Erica Benton's (Jill Clayburgh) perfect life is shattered when her stockbroker husband Martin (Michael Murphy) leaves her for a younger woman. The film documents Erica's attempts at being single again, where she suffers confusion, sadness, and rage.As her life progresses, she begins to bond with several friends and finds herself inspired and even happier by her renewed liberation. The story also touches on the overall sexual liberation of the 1970s. Erica eventually finds love with a rugged, yet sensitive British artist (Alan Bates).","language":"English","Reception":"Vincent Canby wrote \"Miss Clayburgh is nothing less than extraordinary in what is the performance of the year to date. In her we see intelligence battling feeling — reason backed against the wall by pushy needs.\"[6]Pauline Kael in The New Yorker  :\" An Unmarried Woman may give Mazursky the popular success that his films Blume in Love, Harry and Tonto and Next Stop, Greenwich Village should have given him - Erica (Jill Clayburgh), the heroine, sleeps in a T-shirt and bikini panties. There are so few movies that deal with recognizable people that this detail alone is enough to pick up one's spirits...Jill Clayburgh has a cracked , warbly voice - a modern polluted-city huskiness...When Erica's life falls apart and her reactions go out of control, Clayburgh's floating, not-quite-sure, not-quite-here quality is just right.\"[7]Though An Unmarried Woman is viewed as a \"feminist movie\" due to the female lead, not everyone was happy with the way in which a divorced, single mother was portrayed. Todd Gitlin and Carol S. Wolman co-authored a review of An Unmarried Woman, that was published in Film Quarterly in the Autumn 1978 issue, that unapologetically criticized Paul Mazursky's screenplay. Referring to the film, they describe it as a “Romantic cartoon that keeps up with ‘life-style’ trends.” Using derogatory words such as, “buffoon,” “klutz,” and “uppity woman,” are a common theme throughout the review. The authors then go on to critique themes within the movie and offer suggestions of how Mazursky could have done better to further the Women’s Liberation Movement ideals. Gitlin and Wolman provide an interesting point of view from two lifelong advocates within the Feminist Movement.In “A Subject for the Seventies,” Charlotte Brunsdon and Jane Clark cite films such as, Alice Doesn’t Live Here Anymore (1974), Looking for Mr. Goodbar (1977), and Julia (1978), to signal the turning point that women can play the lead role in a film and succeed. Though some of these films were released before An Unmarried Woman, none received the same level of criticism, nor equal the level of praise received. The authors’ theory as it relates to the success of this film stems from the fact that Erica is “normal,” whereas in the other films that are mentioned, each main character has a flaw, whether it be they are “unwanted,” or “desirable but a mess.” The two main criticisms pointed out by Brunsdon and Clarke are that An Unmarried Woman is not relatable to all women because of the affluent life that Erica lives, and that even though the film shows Erica’s journey to independence, she ultimately does not want to be alone, and seeks out a relationship with Saul.","box_office":"$24,000,000[2]","cinematography":"Arthur J. Ornitz","directed_by":"Paul Mazursky","Awards":"It was nominated for three Academy Awards including Best Picture, Best Actress (Jill Clayburgh) and Best Writing, Screenplay Written Directly for the Screen. Mazursky's screenplay won awards from the New York Film Critics Circle and the Los Angeles Film Critics Association.Jill Clayburgh won the award for Best Actress at the 1978 Cannes Film Festival.[4]The film was also nominated for several 1978 New York Film Critics Circle Awards, including Best Film, Best Direction, Best Actress (for Jill Clayburgh) and Best Supporting Actress (for Lisa Lucas).[5]","release_dates":"March 5, 1978 (1978-03-05)|||||","produced_by":"Anthony Ray","starring":"Jill Clayburgh Alan Bates Michael Murphy Cliff Gorman","running_time":"130 minutes","music_by":"Bill Conti","written_by":"Paul Mazursky","budget":"$2,515,000[1]"}