{"Cast":"The film features cameo appearances by Brown Bears men's lacrosse coach Lars Tiffany Syracuse Orange men's lacrosse coach John Desko, women's lacrosse coach Gary Gait, Referees: Tom Kitterick, Brian Lenane, Bill Doherty, lacrosse stars Paul Rabil, Zack Greer and Brodie Merrill.","country":"United States","distributed_by":"20th Century Fox Home Entertainment Freestyle Releasing[1]","Plot":"A mixed-blood Native American, Joe Logan is eager to modernize his reservation's casino by expanding on the land of his ancestors, but first he must prove himself to his father, the traditionalist Tribal Chairman. The Chairman will only grant Joe's request on the condition that he meets his challenge - coaching the reservation's struggling high school lacrosse team, which competes against the better equipped and better trained players of the Prep School league. Joe reluctantly accepts, only to soon realize the challenge will require a leadership he had forfeited years ago as a star lacrosse player. Lost on how to reach his players, Joe finds that the answer lies deep in the traditional cultural heritage of the sport. Gaining the respect of his team, Joe helps them restore pride and return the game of lacrosse to their people.","language":"English","Reception":"The film received mostly mixed reviews, receiving 42 out of 100 by Metacritic[5] and achieving a 38% (rotten) rating on Rotten Tomatoes.[6]In its opening weekend the film grossed $257,364 in 55 theaters, ranking at #24. By the end of its run, Crooked Arrows grossed $1,832,541 domestically.Crooked Arrows was released on Blu-ray and DVD on October 23, 2012.","box_office":"$1,832,541[2]","cinematography":"Dan Stoloff","production_company":"Sports Studio","directed_by":"Steve Rash","release_dates":"May 18, 2012","produced_by":"Adam Leff J. Todd Harris","starring":"Brandon Routh Chelsea Ricketts Gil Birmingham Crystal Allen","running_time":"105 minutes","music_by":"Brian Ralston","External links":"","edited_by":"Bart Rachmil Danny Saphire","written_by":"Brad Riddell Todd Baird","budget":"$13,000,000"}