{"country":"Thailand","distributed_by":"Film Bangkok Magnolia Pictures","Plot":"The Burmese army is seeking to invade Ayutthaya, the capital of Siam. Seeking to block the invasion is a small band of villagers in Bang Rajan. The forces are at first led by Nai Taen, who is injured in an early battle. The villagers then turn to an outsider, Nai Chan Nuad Kheo, a moustachioed, veteran warrior. He brings along a handful of other men, who with the remaining men and women of Bang Rajan vow to put up a fight. They use all their resources to prepare the village for a siege, including melting down all available metal farming implements into a crudely constructed cannon. Lacking horses, the village drunkard, Nai Thongmen, mounts an old water buffalo and rides the draft animal into battle.","language":"Thai","cinematography":"Wichian Ruangwijchayakul","directed_by":"Tanit Jitnukul","Historical Accuracy":"The plot follows the Thai version of events. According to Thai tradition, the Burmese northern invasion army led by Gen. Ne Myo Thihapate was held up for five months at Bang Rachan, a small village northwest of Ayutthaya by a group of simple villagers.[1] However, not all the points of this traditional Thai story could be true as the entire northern campaign took just over five months (mid-August 1765 to late January 1766), and the northern army was still stuck in Phitsanulok, in north-central Siam, as late as December 1765. Burmese sources do mention \"petty chiefs\" stalling the northern army's advance but it was early in the campaign along the Wang River in northern Siam (not near Ayutthaya) during the rainy season (August–October 1765). The Burmese general who was actually stationed near Ayutthaya was not Thihapate but rather Maha Nawrahta, whose southern army was waiting for the northern army to show up to attack the Siamese capital.[2] It appears that the three verified events—petty chiefs resisting Thihapate in the north, Thihapate's campaign period of five months, and Maha Nawrahta staking out by Ayutthaya—have merged to create this popular mythology.","release_dates":"Thailand: December 29, 2000 United States: August 27, 2004","produced_by":"Nonzee Nimibutr Adirek Wattaleela Brian L. Marcar Prasarn Maleenont","starring":"Winai Kraibutr Jaran Ngamdee Bongkoj Khongmalai","running_time":"127 min.","music_by":"Carabao","edited_by":"Sunij Asavinikul","Production and reception":"Bang Rajan was made on a budget of around 50 million baht, which is about four times the cost of other Thai productions being made at the time. It was a box-office hit in Thailand, earning more than 300 million baht.The film was screened at several film festivals in 2001, including the Seattle International Film Festival, Toronto International Film Festival, the Vancouver International Film Festival and the Hawaii International Film Festival. At the Asia Pacific Film Festival, it won for best art direction. It was screen at the Fantasia Festival in Montreal in 2003, where it won second prize for Best Asian Film.The Battle of Bang Rajan was also depicted in a 1966 Thai film, starring Sombat Metanee in a role that won him a best actor honors at the \"Golden Doll\" Awards. The award was personally handed to Sombat by King Bhumibol Adulyadej.The long-horned water buffalo featured in the film died of old age shortly after the film was released and was feted in a lavish funeral ceremony.","written_by":"Tanit Jitnukul Kongkiat Khomsiri Patikarn Phejmunee Buinthin Thuaykaew","budget":"50 million baht"}