{"based_on":"Æon Flux by Peter Chung","country":"United States","æon_flux":"Theatrical release poster","distributed_by":"Paramount Pictures","Comic book prequel":"In late 2005, Dark Horse Comics published a four-issue comic book limited series tying in with the movie. The storyline serves as a prequel to the film and is a mixture of Chung's original TV series designs and characters, combined with the setting and story elements of the film; the comic book version of Æon loosely resembles Theron, while her colleague Sithandra, played by a black actress in the film, is depicted as white in the comic book. The first issue sets up Flux's mission for the miniseries: sabotage the Bregnan government's plan to destroy the forest outside of Bregna's walls. The last two issues of the limited series were published after the film had been released. By the time the final issue was published, the film had already ended its run in most areas. Dark Horse has not announced if additional Æon Flux-based comics will be published.","Plot":"In 2011, a deadly pathogenic virus has killed 99% of the Earth's population, forcing the survivors to regroup and scatter across the Earth.404 years later, in late 2415, all of the survivors inhabit Bregna, a walled futuristic city-state, which is ruled by a congress of scientists. Although Bregna is largely an idyllic place in the destroyed Earth, people routinely disappear and the population suffers from bad dreams.A skilled warrior, named Æon Flux, is a member of the Monicans, an underground rebel organization who communicate through telepathy-enabling technology and are led by the Handler. After a mission to destroy a surveillance station, Æon comes home to find her sister Una has been mistaken for a Monican and killed. When Æon is sent on a mission to kill the government's leader, Trevor Goodchild, she discovers that both she and the Monicans are being manipulated by council members in a secret coup.Æon questions the origins of everyone in Bregna, and in particular, her personal connection to Trevor. Everyone in Bregna is revealed to be a clone, grown from recycled DNA. With the dead constantly being reborn as new individuals and bearing partial memories of their previous lives, their troubling dreams have increased. Cloning was required because the antidote to the virus made humans infertile. Trevor's ongoing experiments were attempts to reverse the infertility. His ancestors had also worked on this problem. Æon learns that she is a clone of the original Trevor's wife Katherine, and is the first \"Katherine\" clone in over 400 years.One of Trevor's experiments, Una, was successful: she had become pregnant. However, in order to stay in power, Trevor's brother, Oren Goodchild, had her killed along with the other members of the experimental group. He ordered all of Trevor's research to be destroyed. In a confrontation with Trevor and Æon, Oren reveals that nature has corrected the infertility problem and that some women are becoming pregnant. Oren has had them all killed to maintain the Goodchild reign. Æon then goes against both her former allies, who want to kill Trevor, and Oren.She convinces the other Monicans to ignore the Handler and to help her kill Oren and his men. Æon goes to destroy the Relical, the dirigible that stores the DNA for cloning. There she meets the old man who monitors everything. She discovers that he preserved Katherine's DNA for years, although Oren had ordered it to be destroyed so \"Katherine\" could not influence Trevor in any way. The dirigible crashes into the city wall, breaking it down to reveal the surrounding land for the first time in centuries. It is lush and fertile, not a wasteland as they were taught.","language":"English","box_office":"$52,304,001","cinematography":"Stuart Dryburgh","production_company":"MTV Films Lakeshore Entertainment Valhalla Motion Pictures","directed_by":"Karyn Kusama","Home media":"Æon Flux was released on DVD on April 25, 2006. As of July 16, 2006, the DVD has grossed $31.80 million in rental sales.[11]","Video game":"On November 15, 2005, a video game tie-in prequel of the same name was released in North America for the PlayStation 2 and Xbox gaming consoles. The game takes place in eras before the film's setting of 2030 to 2338. The likenesses and voices of actors from the film were used. To help add to the box office gross of the film and to sell more games, specially marked copies sold in the US came with a pass to see the Æon Flux film.[10]","Music":"Graeme Revell composed the score for Æon Flux; the soundtrack is available via Varèse Sarabande as advertised on the film's official website.[9]","release_dates":"December 2, 2005 (2005-12-02)|||||","Production":"The screenplay was written by Phil Hay and Matt Manfredi, and directed by Karyn Kusama. It was based on the animated TV series by Peter Chung, who had a minor role in this film version of his work.[citation needed] This film was produced by MTV Films. In the early stages of production, actress Michelle Rodriguez was considered for the part of Æon. She had previously worked with Kusama in Girlfight. Kusama had originally suggested filming in Brasília, the capital of Brazil, because the 20th-century modern architecture of that city fit with her vision of Bregna. The producers rejected the idea because Brasília lacked the infrastructure and technical expertise to support a major film production. After several cities were scouted, Berlin and Potsdam in Germany were chosen for filming. Berlin had several locations that fit into the organic yet structured world of Æon Flux. The crew gained permission to film in several locations that had never allowed such access before, including the Treptow Crematorium, the Adlershof Trudelturm and Windkanal wind tunnel facility, and the Haus der Kulturen der Welt (\"House of the World's Cultures\"). Additional locations include the Bauhaus Archive and a dissection theatre built in 1790 to train veterinarians, part of the Berlin animal shelter. It was used as the Handler space.[1] Filming was temporarily suspended for a month during September 2004 while Theron recovered from a neck injury she suffered during stunt-work on the tenth day of shooting. She was hospitalized in Berlin for five days and required about six weeks of physiotherapy to recover.Director Karyn Kusama claims that after finishing the movie, the studio took it away from her and heavily re-edited it, changing storylines and characters, claiming that her version was too much of an art movie.[2]","produced_by":"Gale Anne Hurd|David Gale|Gary Lucchesi|Greg Goodman|","starring":"Charlize Theron|Marton Csokas|Jonny Lee Miller|Sophie Okonedo|Pete Postlethwaite|Frances McDormand|","running_time":"93 minutes","music_by":"Graeme Revell","edited_by":"Peter Honess|Plummy Tucker|","Release":"Paramount chose not to screen Æon Flux for critics prior to its release. The film opened at number two at the U.S. box office, making $12,661,112 in its opening weekend, held off the top spot by Harry Potter and the Goblet of Fire. Æon Flux suffered a decline of 63.97% in box office earnings, going down to number six the following week. On February 9, 2006, it completed its theatrical run, grossing a domestic take of $25,874,337 and a worldwide box office total of $52,304,001,[3] making it a write down and a box office bomb against its $62 million budget.The critical reception was mainly negative. The film holds a 10% 'rotten' rating on Rotten Tomatoes, with the consensus stating \"Aeon Flux lacks the gravity-defying pace of its animated predecessor, and, despite some flash, is largely a dull affair.\"[4] With a score of 36 out of 100, the film's reception is rated 'Generally unfavorable' on Metacritic.[5]Although Peter Chung was initially optimistic about the film and was impressed with the sets,[6] he ultimately described it as \"a travesty,\" adding:\"I was unhappy when I read the script four years ago; seeing it projected larger than life in a crowded theatre made me feel helpless, humiliated, and sad. ...[The movie's creators] claim to love the original version; yet they do not extend that faith to their audience. No, they will soften it for the public, which isn't hip enough to appreciate the raw, pure, unadulterated source like they do.\"[7]Chung primarily objected to the film's portrayal of Æon and Trevor, and their re-imagined history and relationship. He said, \"Ms. Flux does not actually appear in the movie.\"[7]Screenwriters Hay and Manfredi asserted in an interview[8] that the film was re-cut by the studio prior to release. They said the original director's cut contains nearly 30 minutes of additional footage, which Chung acknowledged in his criticism.[7]","written_by":"Phil Hay|Matt Manfredi|","budget":"$65 million"}