{"based_on":"Donnie Darko","Changes":"When originally editing Donnie Darko in 2001, Kelly was required to keep the final film shorter than two hours, with its final runtime coming to 113 minutes.[2] With more freedom in 2004, his director's cut is twenty minutes longer than the original release.[16] Most of the deleted scenes that had been included as extras on the Donnie Darko DVD were added to narrative, bringing the runtime to a total of 133 minutes.[14] Such scenes include additional sequences with Donnie and his parents, Donnie's therapist Dr Thurman telling him that his drugs are placebos, and his English teacher Karen Pomfrey teaching Watership Down to her class.[17][18] Close-up shots of Donnie's eyeballs were included, as well as footage of waves crashing on a beach, and a scene in which Donnie and Gretchen play the 1986 arcade game Out Run.[19]Alongside the deleted scenes, Kelly also superimposed pages from the fictional book The Philosopy of Time Travel, which had previously been available on the film's official website, onto the film.[20] Kelly had written these passages after he had finished shooting, and explained that their inclusion was to help the film \"operate on a more logical, fluid level, a bit more as the science fiction film that [he] always intended it to be\".[2] The text introduces new concepts that had previously been unmentioned in the original release. According to The Philosophy of Time Travel, much of the film's plot take place in an unstable \"Tangent Universe\", a duplicate of the \"Primary Universe\" from which Donnie originates. Donnie is described as being the \"Living Receiver\", and is granted superpowers such as strength, telekinesis and premonition. Donnie's task over the course of the film is to return the jet engine (called the \"Artifact\" in the book) to the Primary Universe to avert a disaster. During his quest, he is aided by \"The Manipulated Living\" and \"The Manipulated Dead\", who are the other characters in the film.[21] These plot points received criticism from reviewers, who objected to the narrative's new lack of ambiguity.[22][23] Jonathan Dean of Total Film described them as \"unsatisfactory\" and \"handholding\".[5] In an interview, Kelly stated that the pages had been created \"as an exercise in interpretation\", and that they were not necessarily intended to be viewed as canon.[21]The film's sound quality was improved and its soundtrack revised.[6] Kelly had originally wanted to use the songs \"Never Tear Us Apart\" by INXS and \"West End Girls\" by the Pet Shop Boys during the opening scene of Donnie cycling home and Sparkle Motion's dance at the talent show respectively, but financial constraints meant that he instead had to use \"The Killing Moon\" by Echo & the Bunnymen and \"Notorious\" by Duran Duran. For the director's cut, Kelly was able to gain the rights to use \"Never Tear Us Apart\" for the opening scene, and moved \"The Killing Moon\" to later in the film; \"Notorious\" was not moved from the talent show scene.[15]","country":"United States","distributed_by":"Pandora Cinema Newmarket Films","Background":"Initially struggling to find financial backing for Donnie Darko in Hollywood, director Richard Kelly spent a year and a half pitching the project to executives.[5] After reading the script, Drew Barrymore agreed to finance the film through her production company Flower Films.[4] Following Barrymore's involvement, Kelly was able to hire several well-known actors—such as Patrick Swayze, Mary McDonnell and Katharine Ross—and to produce the film for a budget of $4.5 million.[6] On January 19, 2001, Donnie Darko made its premiere at the Sundance Film Festival. Despite the film receiving considerable acclaim from critics, distributors felt daunted and were unsure of what could be done with it. With its genre-bending themes and complex plot, it was described as \"inaccessible\" and \"not marketable\".[2] After several months it was close to going directly to home video, but was eventually picked up by Newmarket Films and received a wide release on October 26, 2001.[3][4]Commercially, Donnie Darko performed poorly at first. Released only a month after the September 11 attacks in New York, audiences did not respond well to the film's dark mood or jet engine plot point.[6] Against its budget of $4.5 million, the film made only $110,000 in its first weekend in limited release at 58 screens.[6] By the end of 2001 it had taken $420,000 at the box office;[6] on completing its theatrical run, it had made a total of $515,375.[4] Consequently, the film had its international release date pushed back by a year, and was not released in the UK until October 25, 2002.[7] In this market, the film became a minor hit, making £1 million at the box office and being named the second best film of the year on BBC Two's Film 2002 programme.[8][9] Michael Andrews's cover of \"Mad World\" by Tears for Fears—used in the film's final sequence—topped the UK Singles Chart in December 2003 and became a Christmas number one.[10]As a result, in part, of its success overseas, Donnie Darko gained a new life in the US and developed a cult following. Its DVD was a best-seller on Amazon.com with sales reaching $10 million,[11] and it was regularly shown at midnight screenings across the country.[12] At Visions Bar Noir in Washington D.C., the film was screened for over a year,[13] while at the Pioneer Theater in the East Village, Manhattan, the film played for a consecutive 28 months in a series of midnight showings.[6] At one such event at the Pioneer in late 2003, Kelly was in attendance, and was approached by Bob Berney, president of Newmarket Films, who suggested that the film could benefit from a rerelease.[11] Kelly had always wanted to do a director's cut of the film, and proposed this to Berney; he went on to describe it as a \"win-win situation for everyone\".[6] Kelly was subsequently given $290,000 to create a new cut of Donnie Darko, which he called his interpretation of the film.[6][14] Given the film's box office performance, it was described as being the first \"flop\" to be given a director's cut.[2]","language":"English","box_office":"$1.3 million (domestic)[1]","cinematography":"Steven B. Poster","production_company":"Flower Films","donnie_darko:_the_director's_cut":"Theatrical release poster","directed_by":"Richard Kelly","release_dates":"May 29, 2004 (2004-05-29) (Seattle)|August 27, 2004 (2004-08-27) (Worldwide)||||","produced_by":"Sean McKittrick Nancy Juvonen Adam Fields","starring":"Jake Gyllenhaal Jena Malone Drew Barrymore James Duval Beth Grant Maggie Gyllenhaal Mary McDonnell Holmes Osborne Katharine Ross Patrick Swayze Noah Wyle","running_time":"133 minutes","music_by":"Michael Andrews","edited_by":"Sam Bauer Eric Strand","Release":"Donnie Darko: The Director's Cut made its world premiere at a sold-out screening on May 29, 2004, during the Seattle International Film Festival,[2] where it was described as an \"unprecedented experiment\".[11] To test the reaction to the film, Newmarket then opened it exclusively in eight further theaters in the Seattle/Tacoma area. Seattle was chosen for this run to see if it could perform well in the suburbs.[11] Six weeks after this test run, the film was released in New York City and Los Angeles, then in eight more cities that summer.[6] It received a wide release on August 27, three months after its Seattle premiere.[24] Domestically, Donnie Darko: The Director's Cut took a total of $1.3 million at the US box office.[1]Initial reaction to Donnie Darko: The Director's Cut was positive. On the review aggregator Rotten Tomatoes, the film has a rating of 91%, based on 43 reviews, with an average rating of 8/10.[24] At Metacritic, which assigns a normalized rating out of 100 to reviews from critics, the film received an average score of 88 based on 15 reviews, indicating \"universal acclaim\".[25] Roger Ebert gave the film three stars out of four, describing it as \"alive, original and exciting\".[3] Kevin Thomas of the Los Angeles Times predicted that, as a \"richer\" cut, the movie would \"be ranked as one of the key American films of the decade\".[20] Writing for the Chicago Tribune, Robert K. Elder gave the film 3½ stars out of 4, calling it Kelly's \"mind-bending masterwork\".[26] He added: \"In his quest to make 'Darko' more accessible, Kelly might upset a few loyalists of the original, but there are still enough questions left to confound and enthrall audiences in 'Donnie Darko's' reconfigured version.\"[26] In an otherwise positive review, Dennis Lim of The Village Voice criticized the superimposed shots of The Philosophy of Time Travel, stating that they \"[diminished] the narrative's mystery and [disrupted] its somnambulist tempo\".[27]Retrospective reviews of the film have been more negative. In 2014, David Sims of The Wire listed Donnie Darko: The Director's Cut in his list of \"directors' cuts messed up their own movies\". Sims disliked the lack of ambiguity in Kelly's new version, and argued that \"crowbarring [a very specific plot thread] into his director's cut made for a lesser movie\".[22] Similarly, Tom Hawking of Flavorwire felt that the director's cut ruined the \"enduring ambiguity\" of the original. Hawking included Donnie Darko: The Director's Cut in his 2010 list of \"10 director's cuts that are worse than the original\".[23] Writing in Collider.com for a review of the 10-year anniversary Blu-ray, Scott Wampler said that he felt \"let-down\" by the director's cut, and that it was \"right in line with the sort of choices [Kelly has] made as a filmmaker since releasing Donnie Darko\".[28] In the Total Film book The 100 Greatest Movies of All Time, where the original cut of Donnie Darko was listed at number 87, Jonathan Dean also criticized this loss of ambiguity, remarking: \"Unwisely building concrete bypasses over gossamer plot strands, [the director's cut] steers us through a spaghetti junction of possible meanings when all we really want to do is get lost.\"[5] In a 2016 retrospective review, Germain Lussler of io9 stated that the director's cut \"simply isn't as good\" and \"feels less magical\".[29] He argued that the inclusion of The Philosophy of Time Travel \"prevent the film from being a text that the viewer could read into whatever they wanted\".[29]The new soundtrack received considerable criticism, with several commentators bemoaning the decision to replace \"The Killing Moon\" with \"Never Tear Us Apart\" for the opening sequence. Wampler felt that the song \"didn't fit nearly as well\",[28] while Sims described it as being \"horribly mismatched\".[22] Ashe Cantrel of Film School Rejects echoed this sentiment, and argued that the soundtrack \"got turned into kind of a pile of crap\";[30] Shaun Munro of WhatCulture.com similarly felt that \"replacing the music is a crime\".[31] In an interview with the British music magazine NME, Ian McCulloch—the lead singer of Echo & the Bunnymen—branded Kelly a \"knobhead\" for making the change.[32]Donnie Darko: The Director's Cut was released on DVD on February 15, 2005 in both single and double-disc versions; the latter was available in a standard DVD case or in a limited edition lenticular slipcase. Most additional features are exclusive to the two-DVD set, such as an audio commentary with Kelly and director Kevin Smith, excerpts from the Donnie Darko storyboard, a 52-minute production diary with commentary by director of photography Steven Poster, featurettes #1 Fan: A Darkometary and They Made Me Do it Too – The Cult of Donnie Darko, and the film's theatrical trailer.[33]As a promotional giveaway, a single-DVD edition of Donnie Darko: The Director's Cut was covermounted to the February 19, 2006 issue of the UK's The Sunday Times newspaper.[34] The film was released on Blu-ray in February 2009, and received a 10th anniversary special edition rerelease on July 26, 2011.[35][36]","written_by":"Richard Kelly","budget":"$290,000"}