{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Eddie Hopper is a construction contractor from Long Island, New York, with two grown daughters. One of them, Betsy, is about to be married.Money is tight in the Hopper household, but Eddie, much to the distress of his wife, Lola, decides that it is important to throw a lavish wedding to impress the well-off family of the man Betsy is to marry. Everyone in the family is throwing advice Eddie's way, even the ghost of his father.A new house Eddie is building is adding to his financial and emotional woes. In desperation, he turns to his crooked brother-in-law, Oscar, who ends up getting Eddie involved with loan sharks. A young man named Stevie Dee is sent to keep an eye on Eddie, but instead turns his gaze to Connie Hopper, who is not only a police officer but the bride's sister.Betsy's wedding ultimately goes on as scheduled, but is disrupted by a torrential downpour of rain.","betsy's_wedding":"Theatrical release poster","language":"English","Reception":"Betsy's Wedding received mixed reviews from critics, with Rotten Tomatoes giving it a 50% rating. Reviews of the film included comments such as \"threadbare concoction\",[1] \"narcissism flourishing like ragweed\" and \"unctuous\".[2]It was nominated for two Razzie Awards: Worst Actress for Molly Ringwald (who lost to Bo Derek for Ghosts Can't Do It) and Worst Supporting Actress for Ally Sheedy (who lost to Sofia Coppola for The Godfather Part III).Betsy's Wedding has been cited as launching the movie career of Anthony LaPaglia.[3]","box_office":"$19,740,070","cinematography":"Kelvin Pike","production_company":"Touchstone Pictures","directed_by":"Alan Alda","release_dates":"June 22, 1990 (1990-06-22)","Production":"The plot was reportedly inspired by the marriage of Alda's youngest daughter.","produced_by":"Martin Bregman Louis A. Stroller","starring":"Alan Alda|Joey Bishop|Madeline Kahn|Catherine O'Hara|Joe Pesci|Ally Sheedy|Burt Young|Molly Ringwald|","running_time":"94 minutes","music_by":"Bruce Broughton","External links":"","edited_by":"Michael E. Polakow","written_by":"Alan Alda","budget":"$24 million"}