{"country":"United States","distributed_by":"Paramount Pictures","Plot":"The story is set in 1916.[6] Bill (Gere), a Chicago manual laborer, knocks down and kills a boss (Margolin) in the steel mill where he works. He flees to the Texas Panhandle with his girlfriend Abby (Adams) and younger sister Linda (Manz), who provides the film narration. Bill and Abby pretend to be siblings to prevent gossip. The three hire on as part of a large group of seasonal workers with a rich, shy farmer (Shepard). The farmer learns that he is dying, although the nature of the illness is not specified.After the farmer falls in love with Abby, Bill encourages her to marry the rich farmer so they can inherit his money after he dies. The marriage takes place and Bill stays on the farm as Abby's \"brother\". The farmer's foreman suspects their scheme. The farmer's health unexpectedly remains stable, foiling Bill's plans. Eventually, the farmer discovers Bill's true relationship with Abby. At the same time, Abby has begun to fall in love with her husband. After a locust swarm and a fire destroy his wheat fields, the incensed farmer goes after Bill with a gun, but Bill kills him with a screwdriver, fleeing with Abby and Linda. The foreman and the police pursue and eventually find them. Bill is killed by the police. Later, Abby inherits the farmer's money and leaves Linda at a boarding school. Abby leaves town on a train with soldiers departing for World War I. Linda runs away from school with a friend.","language":"English","Reception":"Days of Heaven opened theatrically on September 13, 1978. It later premiered at the Cannes Film Festival, in 1979, where Malick won the award for Best Director—making him the first American director to win the award since Jules Dassin in 1955 for Rififi (in a joint win shared with two other directors). The film was a commercial failure: its box office gross of $3,446,749 was only slightly more than it cost to make the film ($3 million),[citation needed] but Charles Bluhdorn who ran Paramount's parent company Gulf + Western, loved it so much he offered Malick $1 million for his next project, whatever it was.[23]Critical reaction initially varied, with many critics polarized by the beauty of the film, however finding a flaw in a perceived weakness of the story. Dave Kehr of The Chicago Reader offered a positive review and wrote: \"Terrence Malick's remarkably rich second feature is a story of human lives touched and passed over by the divine, told in a rush of stunning and precise imagery. Nestor Almendros's cinematography is as sharp and vivid as Malick's narration is elliptical and enigmatic. The result is a film that hovers just beyond our grasp—mysterious, beautiful, and, very possibly, a masterpiece\".[24] Variety Magazine called the film \"one of the great cinematic achievements of the 1970s.\"[25] Gene Siskel of The Chicago Tribune also wrote that the film \"truly tests a film critic's power of description ... Some critics have complained that the Days of Heaven story is too slight. I suppose it is, but, frankly, you don't think about it while the movie is playing\".[26] Time magazine's Frank Rich wrote, \"Days of Heaven is lush with brilliant images\".[27] The periodical went on to name it one of the best films of 1978.[28] Nick Schager of Slant Magazine has called it \"the greatest film ever made.\"[29]Meanwhile, detractors targeted the film's direction of storyline and structure. In his review for The New York Times, Harold C. Schonberg wrote, \"Days of Heaven never really makes up its mind what it wants to be. It ends up something between a Texas pastoral and Cavalleria Rusticana. Back of what basically is a conventional plot is all kinds of fancy, self-conscious cineaste techniques.\"[30] Additionally, Monica Eng of the Chicago Tribune criticized the lack of significant plot and stated \"the story becomes secondary to the visuals\".[31]The Chicago Sun-Times’ Roger Ebert responded to these criticisms by saying:Terrence Malick's \"Days of Heaven\" has been praised for its painterly images and evocative score, but criticized for its muted emotions: Although passions erupt in a deadly love triangle, all the feelings are somehow held at arm's length. This observation is true enough, if you think only about the actions of the adults in the story. But watching this 1978 film again recently, I was struck more than ever with the conviction that this is the story of a teenage girl, told by her, and its subject is the way that hope and cheer have been beaten down in her heart. We do not feel the full passion of the adults because it is not her passion: It is seen at a distance, as a phenomenon, like the weather, or the plague of grasshoppers that signals the beginning of the end.[32]Days of Heaven was re-evaluated years after its original theatrical release and is now considered a pioneering achievement in cinema. The film holds a 94% approval rating on Rotten Tomatoes with an average rating of 8.3/10 based on 48 reviews, as well as a 93/100 weighted average score on Metacritic.[33] It is frequently cited by critics and scholars, including Roger Ebert, as one of the most visually arresting films ever made;[34][35][36] in 1997, Ebert added Days of Heaven to his Great Movies list.[37] In 2007, the Library of Congress selected the film for preservation in the United States National Film Registry.In 2012, TIME included the film among the 20 new entries added to the magazine's \"All-TIME 100 Movies\" list.[38] The same year, Days of Heaven ranked #112 in the British Film Institute's decennial Sight & Sound critics' poll of the greatest films ever made,[39] and #132 in the directors' poll of the same magazine.The film won an Academy Award for Best Cinematography. Per Academy custom the award was given in the name of principal photographer Nestor Almendros.[18] This was somewhat controversial as Wexler also received credit on the film. The film was also nominated for three Academy Awards, for the Costume Design, Original Score, and Sound (John Wilkinson, Robert W. Glass, Jr., John T. Reitz, and Barry Thomas).[40] Malick won the Prix de la mise en scène (Best Director award) at the 1979 Cannes Film Festival.[41] Furthermore, he was named the best director by the National Society of Film Critics.American Film Institute recognitionDays of Heaven has been released on home video on various different formats over the years. Its first notable release was on home video in the early 1980s, followed by various reissues in the 1980s and 1990s. In particular, the film was released on a special widescreen edition format on home video to preserve the film's original theatrical aspect ratio, which was uncommon for videotapes at the time, with majority of them being pan and scan, a technique that crops a portion of the image to focus on the more important composition. This often results in the side being cut out and the middle centre being the only remaining part. Days of Heaven premiered on DVD on March 30, 1999 with no special features. The feature itself was presented in widescreen and released by Paramount Pictures, the copyright owner of the film itself. It was rereleased on DVD in 2004, again without special supplements.In 2007, the Criterion Collection released an exclusive special edition of the film, with digitally remastered sound and picture, supervised by Malick, editor Billy Weber and camera operator John Bailey. Bonus features include an audio commentary by art director Jack Fisk, editor Billy Weber, costume designer Patricia Norris, and casting director Dianne Crittenden; an audio interview with Richard Gere; video interviews with Sam Shepard, Haskell Wexler, and John Bailey; and a booklet featuring an essay on the film by Adrian Martin and an extract from Néstor Almendros' autobiography.[45] The Criterion Collection also released a Blu-ray disc format of the film on March 7, 2010, with the same special features. The design art created by Criterion for the film's packaging makes a departure from the early video releases, featuring a still of Gere's character in the wheat fields, with the mansion in the horizon.","box_office":"$3.4 million[2]","cinematography":"Néstor Almendros Haskell Wexler","directed_by":"Terrence Malick","Soundtrack":"The soundtrack for Days of Heaven is a strong reflection of the film's context. Ennio Morricone provided the film's score and received his first Academy Award nomination in his soundtrack composing career for his work on the film.[19] Morricone recalled the process as being \"demanding\" and said of Malick: \"He didn't know me very well, so he made suggestions, and in some cases, gave musical solutions. This kind of annoyed me because he'd say: 'This thing . . . try it with three flutes.' Something impossible! So, to humor him, I would do it with three flutes and then he'd decide to use my version after all. His was impossible or I would have written it myself. And more nitpicking like that which means he was very attentive and careful about music.\"[20]There are three main scores composed to Days of Heaven: the main theme, which references “Aquarium\", the seventh movement from Camille Saint-Saëns’s Carnival of the Animals, a \"pastoral melody\" for flute, and finally a love theme. The soundtrack was remastered and re-released in July 2011 in a two-disc edition and features excerpts of Manz's narration.[21]Additional songs were contributed by guitarist Leo Kottke. Kottke was originally approached by Malick for the entire score, but declined.[22]","release_dates":"September 13, 1978 (1978-09-13)|||||","Production":"Jacob Brackman introduced fellow producer Bert Schneider to Terrence Malick in 1975.[7] On a trip to Cuba, Schneider and Malick began conversations that would lead to the development of Days of Heaven. Malick had tried and failed to get Dustin Hoffman or Al Pacino to star in the film.[8] Schneider agreed to produce the film. He and Malick cast young actors Richard Gere and Brooke Adams and actor/playwright Sam Shepard for the lead roles. Paramount Pictures CEO at the time Barry Diller wanted Schneider to produce films for him and agreed to finance Days of Heaven. At the time, the studio was heading in a new direction. They were hiring new production heads who had worked in network television, and, according to former production chief Richard Sylbert, \"[manufacturing] product aimed at your knees\".[7] Despite the change in direction, Schneider was able to secure a deal with Paramount by guaranteeing the budget and taking personal responsibility for all overages. \"Those were the kind of deals I liked to make ... because then I could have final cut and not talk to nobody about why we're gonna use this person instead of that person\", Schneider said.[7]Malick admired cinematographer Nestor Almendros' work on The Wild Child (1970) and wanted him to shoot Days of Heaven.[9] Almendros was impressed by Malick's knowledge of photography and willingness to use little studio lighting. The two men modeled the film's cinematography after silent films, which often used natural light. They drew inspiration from painters such as Johannes Vermeer, Edward Hopper (particularly his House by the Railroad), and Andrew Wyeth, as well as photo-reporters from the start of the 20th century.[9]Production began in the fall of 1976.[10] Although the film was set in Texas, the exteriors were shot in Whiskey Gap, Alberta, a ghost town, and a final scene was shot on the grounds of Heritage Park Historical Village, Calgary.[11]Jack Fisk designed and built the mansion from plywood in the wheat fields and the smaller houses where the workers lived. The mansion was not a facade, as was normally the custom, but authentically recreated inside and out with period colors: brown, mahogany and dark wood for the interiors.[9] Patricia Norris designed and made the period costumes from used fabrics and old clothes to avoid the artificial look of studio-made costumes.[9]According to Almendros, the production was not \"rigidly prepared\", allowing for improvisation. Daily call sheets were not very detailed and the schedule changed to suit the weather. This upset some Hollywood crew members not used to working this way. Most of the crew were used to a \"glossy style of photography\" and felt frustrated because Almendros did not give them much work.[9] On a daily basis, he asked them to turn off the lights they had prepared for him. Some crew members said that Almendros and Malick did not know what they were doing. The tension led to some of the crew quitting the production. Malick supported what Almendros was doing and pushed the look of the film further, taking away more lighting aids, and leaving the image bare.[9]Due to union regulations in North America, Almendros was not allowed to operate the camera. With Malick, he would plan out and rehearse movements of the camera and the actors. Almendros would stand near the main camera and give instructions to the camera operators.[9] Almendros was gradually losing his sight by the time shooting began. To evaluate his set-ups, \"he had one of his assistants take Polaroids of the scene, then examined them through very strong glasses\".[7] According to Almendros, Malick wanted \"a very visual movie. The story would be told through visuals. Very few people really want to give that priority to image. Usually the director gives priority to the actors and the story, but here the story was told through images\".[12]Much of the film would be shot during magic hour, which Almendros called: \"a euphemism, because it's not an hour but around 25 minutes at the most. It is the moment when the sun sets, and after the sun sets and before it is night. The sky has light, but there is no actual sun. The light is very soft, and there is something magic about it. It limited us to around twenty minutes a day, but it did pay on the screen. It gave some kind of magic look, a beauty and romanticism.\"[12] Lighting was integral to filming and helped evoke the painterly quality of the landscapes in the film. A vast majority of the scenes were filmed late in the afternoon or after sunset, with the sky silhouetting the actors faces, which would otherwise be difficult to see.[13] Interior scenes that feature light coming in from the outside, were shot using artificial light to maintain the consistency of that intruding light. The \"magic look\", however, would also extend to interior scenes, which did occasionally utilize natural light.For the shot in the \"locusts\" sequence, where the insects rise into the sky, the film-makers dropped peanut shells from helicopters. They had the actors walk backwards while running the film in reverse through the camera. When it was projected, everything moved forward except the locusts.[14] For the close-ups and insert shots, thousands of live locusts were used which had been captured and supplied by Canada's Department of Agriculture. [9]While the photography yielded the director satisfactory results critically, the rest of the production was difficult from the start.[10] The actors and crew reportedly viewed Malick as cold and distant. After two weeks of shooting, Malick was so disappointed with the dailies, he \"decided to toss the script, go Leo Tolstoy instead of Fyodor Dostoyevsky, wide instead of deep [and] shoot miles of film with the hope of solving the problems in the editing room.\"[10]The harvesting machines constantly broke down, which resulted in shooting beginning late in the afternoon, allowing for only a few hours of light before it was too dark to go on. One day, two helicopters were scheduled to drop peanut shells that were to simulate locusts on film; however, Malick decided to shoot period cars instead. He kept the helicopters on hold at great cost. Production was lagging behind, with costs exceeding the budget $3,000,000 by about $800,000, and Schneider had already mortgaged his home in order to cover the overages.[10][15]The production ran so late that both Almendros and camera operator John Bailey had to leave due to a prior commitment on François Truffaut's The Man Who Loved Women (1977). Almendros approached cinematographer Haskell Wexler to complete the film. They worked together for a week so that Wexler could get familiar with the film's visual style.[9]Wexler was careful to match Almendros' work, but he did make some exceptions. \"I did some hand held shots on a Panaflex\", he said, \"[for] the opening of the film in the steel mill. I used some diffusion. Nestor didn't use any diffusion. I felt very guilty using the diffusion and having (sic) the feeling of violating a fellow cameraman.\"[12] Although half the finished picture was footage shot by Wexler, he received only credit for \"additional photography\", much to his chagrin. The credit denied him any chance of an Academy Award for his work on Days of Heaven. Wexler sent film critic Roger Ebert a letter \"in which he described sitting in a theater with a stop-watch to prove that more than half of the footage\" was his.[16]Following the completion of principal photography, the editing process took more than two years to complete.[13][17] Malick had a difficult time shaping the film and getting the pieces to go together.[18] Schneider reportedly showed some footage to director Richard Brooks, who was considering Gere for a role in Looking for Mr. Goodbar.According to Schneider, the editing for Days of Heaven took so long that \"Brooks cast Gere, shot, edited and released [Looking for Mr. Goodbar] while Malick was still editing\".[10] A breakthrough came when Malick experimented with voice-overs from Linda Manz's character, similar to what he had done with Sissy Spacek in Badlands. According to editor Billy Weber, Malick jettisoned much of the film's dialogue, replacing it with Manz's voice-over, which served as an oblique commentary on the story.[10] After a year, Malick had to call the actors to Los Angeles, California to shoot inserts of shots that were necessary but had not been filmed in Alberta. The finished film thus includes close-ups of Shepard that were shot under a freeway overpass. The underwater shot of Gere's falling face down into the river was shot in a large aquarium in Spacek's living room.[11]Meanwhile, Schneider was disappointed with Malick. He had confronted Malick numerous times about missed deadlines and broken promises. Due to further cost overruns, he had to ask Paramount for more money, which he preferred not to do. When they screened a demo for Paramount and made their pitch, the studio was impressed and reportedly \"gave Malick a very sweet deal at the studio, carte blanche, essentially\".[10] Malick was not able to capitalize on the deal. He was so exhausted from working on the film that he moved to Paris with his girlfriend. He tried developing another project for Paramount, but after a substantial amount of work, he abandoned it. He did not make another film until 1998's The Thin Red Line twenty years later.[18]","produced_by":"Bert Schneider Harold Schneider","starring":"Richard Gere Brooke Adams Sam Shepard Linda Manz","running_time":"94 minutes","music_by":"Ennio Morricone Leo Kottke[1]","days_of_heaven":"Theatrical release poster","edited_by":"Billy Weber","written_by":"Terrence Malick","budget":"$3 million"}