{"a_clockwork_orange":"Theatrical release poster by Bill Gold","based_on":"A Clockwork Orange  by Anthony Burgess","Cast":"[4]","country":"United Kingdom[2]|United States[2]|","distributed_by":"Warner Bros. (United States)|Columbia-Warner Distributors (United Kingdom)|","In popular culture":"The film's themes and visual characteristics have been referenced in popular culture, including music, television, film, sports, magazines and video games.[59]","language":"English|Nadsat|","Differences between the film and the novel":"Kubrick's film is relatively faithful to the Burgess novel, omitting only the final, positive chapter, wherein Alex matures and outgrows sociopathy. Whereas the film ends with Alex being offered an open-ended government job — implying he remains a sociopath at heart — the novel ends with Alex's positive change in character. This plot discrepancy occurred because Kubrick based his screenplay upon the novel's American edition, its final chapter deleted on insistence of the American publisher.[55] He claimed not to have read the complete, original version of the novel until he had almost finished writing the screenplay, and that he never considered using it. The introduction to the 1996 edition of A Clockwork Orange says that Kubrick found the end of the original edition too blandly optimistic and unrealistic.","box_office":"$26.6 million (North America)[3]","cinematography":"John Alcott","directed_by":"Stanley Kubrick","Home media":"In 2000, the film was released on VHS and DVD, both individually and as part of The Stanley Kubrick Collection DVD set. Consequent to negative comments from fans, Warner Bros re-released the film, its image digitally restored and its soundtrack remastered. A limited-edition collector's set with a soundtrack disc, film poster, booklet and film strip followed, but later was discontinued. In 2005, a British re-release, packaged as an \"Iconic Film\" in a limited-edition slipcase was published, identical to the remastered DVD set, except for different package cover art. In 2006, Warner Bros announced the September publication of a two-disc special edition featuring a Malcolm McDowell commentary, and the releases of other two-disc sets of Stanley Kubrick films. Several British retailers had set the release date as 6 November 2006; the release was delayed and re-announced for 2007 Holiday Season.An HD DVD, Blu-ray, and DVD re-release version of the film was released on October 23, 2007. The release accompanies four other Kubrick classics. 1080p video transfers and remixed Dolby TrueHD 5.1 (for HD DVD) and uncompressed 5.1 PCM (for Blu-ray) audio tracks are on both the Blu-ray and HD DVD editions. Unlike the previous version, the DVD re-release edition is anamorphically enhanced. The Blu-ray was reissued for the 40th anniversary of the film's release, identical to the previously released Blu-ray, apart from adding a Digibook and the Stanley Kubrick: A Life in Pictures documentary as a bonus feature.","release_dates":"19 December 1971 (1971-12-19) (New York City)|13 January 1972 (1972-01-13) (United Kingdom)|2 February 1972 (1972-02-02) (United States)|||","Production":"McDowell was chosen for the role of Alex after Kubrick saw him in the film if..... He also helped Kubrick on the uniform of Alex's gang, when he showed Kubrick the cricket whites he had. Kubrick asked him to put the box (jockstrap) not under but on top of the costume.[13][14]During the filming of the Ludovico technique scene, McDowell scratched a cornea,[15] and was temporarily blinded. The doctor standing next to him in the scene, dropping saline solution into Alex's forced-open eyes, was a real physician present to prevent the actor's eyes from drying. McDowell also cracked some ribs filming the humiliation stage show.[16] A unique special effect technique was used when Alex jumps out of the window in an attempt to commit suicide and the viewer sees the ground approaching the camera until collision, i.e., as if from Alex's point of view. This effect was achieved by dropping a Newman Sinclair clockwork camera in a box, lens-first, from the third story of the Corus Hotel. To Kubrick's surprise, the camera survived six takes.[17]The cinematic adaptation of A Clockwork Orange (1962) was accidental. Screenplay writer Terry Southern gave Kubrick a copy of the novel, but, as he was developing a Napoleon Bonaparte–related project, Kubrick put it aside. Kubrick's wife, in an interview, stated she then gave him the novel after having read it. It had an immediate impact. Of his enthusiasm for it, Kubrick said, \"I was excited by everything about it: The plot, the ideas, the characters, and, of course, the language. The story functions, of course, on several levels: Political, sociological, philosophical, and, what's most important, on a dreamlike psychological-symbolic level.\" Kubrick wrote a screenplay faithful to the novel, saying, \"I think whatever Burgess had to say about the story was said in the book, but I did invent a few useful narrative ideas and reshape some of the scenes.\"[18] Kubrick based the script on the shortened US edition of the book, which omitted the final chapter (restored in 1986).Burgess had mixed feelings about the cinema version of his novel, publicly saying he loved Malcolm McDowell and Michael Bates, and the use of music; he praised it as \"brilliant,\" even so brilliant that it might be dangerous. Despite this enthusiasm, he was concerned that it lacked the novel's redemptive final chapter, an absence he blamed upon his American publisher and not Kubrick. All US editions of the novel prior to 1986 omitted the final chapter.Burgess reports in his autobiography You've Had Your Time (1990) that he and Kubrick at first enjoyed a good relationship, each holding similar philosophical and political views and each very interested in literature, cinema, music, and Napoleon Bonaparte. Burgess's 1974 novel Napoleon Symphony was dedicated to Kubrick. Their relationship soured when Kubrick left Burgess to defend the film from accusations of glorifying violence. A lapsed Catholic, Burgess tried many times to explain the Christian moral points of the story to outraged Christian organizations and to defend it against newspaper accusations that it supported fascist dogma. He also went to receive awards given to Kubrick on his behalf.Kubrick was a perfectionist of meticulous research, with thousands of photographs taken of potential locations, as well as many scene takes; however, per Malcolm McDowell, he usually \"got it right\" early on, so there were few takes. So meticulous was Kubrick that McDowell stated \"If Kubrick hadn't been a film director he'd have been a General Chief of Staff of the US Forces. No matter what it is—even if it's a question of buying a shampoo it goes through him. He just likes total control.\"[19] Filming took place between September 1970 and April 1971, making A Clockwork Orange the quickest film shoot in his career. Technically, to achieve and convey the fantastic, dream-like quality of the story, he filmed with extreme wide-angle lenses[20] such as the Kinoptik Tegea 9.8mm for 35mm Arriflex cameras,[21] and used fast- and slow motion to convey the mechanical nature of its bedroom sex scene or stylize the violence in a manner similar to Toshio Matsumoto's Funeral Parade of Roses (1969).[22]The society depicted in the film was perceived by some as Communist (as Michel Ciment pointed out in an interview with Kubrick) due to its slight ties to Russian culture. The teenage slang has a heavily Russian influence, as in the novel; Burgess explains the slang as being, in part, intended to draw a reader into the world of the book's characters and to prevent the book from becoming outdated. There is some evidence to suggest that the society is a socialist one, or perhaps a society evolving from a failed socialism into a fully fascist society. In the novel, streets have paintings of working men in the style of Russian socialist art, and in the film, there is a mural of socialist artwork with obscenities drawn on it. As Malcolm McDowell points out on the DVD commentary, Alex's residence was shot on failed Labour Party architecture, and the name \"Municipal Flat Block 18A, Linear North\" alludes to socialist-style housing. Later in the film, when the new right-wing government takes power, the atmosphere is certainly more authoritarian than the anarchist air of the beginning. Kubrick's response to Ciment's question remained ambiguous as to exactly what kind of society it is. Kubrick asserted that the film held comparisons between both the left and right end of the political spectrum and that there is little difference between the two. Kubrick stated, \"The Minister, played by Anthony Sharp, is clearly a figure of the Right. The writer, Patrick Magee, is a lunatic of the Left... They differ only in their dogma. Their means and ends are hardly distinguishable.\"[23]A Clockwork Orange was photographed mostly on location in metropolitan London and within quick access of Kubrick's then home in Barnett Lane, Elstree.Shooting began on 7 September 1970 with call sheet no. 1 at the Duke Of New York pub: an unused scene and unused location (the first of many). A few days later, shooting commenced in Alex's Ludovico treatment bedroom and the Serum 114 injection by Dr. Branom.New Year's Eve started with rehearsals on the 31st at the Korova Milk Bar and shooting finished after four continuous days on 8 January.The last scenes were shot in February 1971 ending with call sheet no. 113. The last main scene to be filmed was Alex's fight with Billy Boy's gang, taking six days to cover. Shooting encompassed a total of around 113 days over six months of fairly continuous shooting. As is normal practice, there was no attempt to shoot the script in chronological order.The few scenes not shot on location were the Korova Milk Bar, the prison check-in area, Alex taking a bath at F. Alexander's house, and two corresponding scenes in the hallway. These sets were built at an old factory on Bullhead Road, Borehamwood, which also served as the production office. Seven call sheets are missing from the Stanley Kubrick Archive, so some locations, such as the hallway, cannot be confirmed.Otherwise, locations used in the film include:Despite Alex's obsession with Beethoven, the soundtrack contains more music by Rossini than by Beethoven. The fast-motion sex scene with the two girls, the slow-motion fight between Alex and his Droogs, the fight with Billy Boy's gang, the invasion of the Cat Lady's home, and the scene where Alex looks into the river and contemplates suicide before being approached by the beggar are all accompanied by Rossini's music.[24][25]","running_time":"136 minutes[1]","budget":"$2.2 million[3]","screenplay_by":"Stanley Kubrick","Plot":"In futuristic London, Alex DeLarge is the leader of his \"droogs\", Georgie, Dim and Pete. One night, after getting intoxicated on drug-ladened \"milk-plus\", they engage in an evening of \"ultra-violence\" including a fight with a rival gang led by Billyboy. They drive to the country home of writer F. Alexander and beat him to the point of crippling him for life. Alex then rapes his wife while singing \"Singin' in the Rain\". The next day, while truant from school, Alex is approached by his probation officer Mr. P. R. Deltoid, who is aware of Alex's activities and cautions him.Alex's droogs express discontent with petty crimes and want more equality and high yield thefts, but Alex asserts his authority by attacking them. Later, Alex invades the home of a wealthy \"cat-lady\" and bludgeons her with a phallic statue while his droogs remain outside. On hearing sirens, Alex tries to flee but Dim smashes a bottle on his face, stunning him and leaving him to be arrested by the police. With Alex in custody, Mr. Deltoid gloats that the woman he attacked died, making Alex a murderer. He is sentenced to 14 years in prison.Two years into the sentence, Alex eagerly takes up an offer to be a test subject for the Minister of the Interior's new Ludovico technique, an experimental aversion therapy for rehabilitating criminals within two weeks. Alex is strapped to a chair, injected with drugs, and forced to watch films of sex and violence with his eyes propped open. Alex becomes nauseated by the films, and then recognizes the films are set to music of his favorite composer, Ludwig van Beethoven. Fearing the technique will make him sick on hearing Beethoven, Alex begs for the end of the treatment. Two weeks later, the Minister demonstrates Alex's rehabilitation to a gathering of officials. Alex is unable to fight back against an actor that taunts and attacks him, and becomes ill at the sight of a topless woman. The prison chaplain complains Alex has been robbed of his freewill, but the prison governor asserts that the Ludovico technique will cut down crime and alleviate crowding in the prisons.Alex is let out as a free man, only to find his parents have sold his possessions as restitution to his victims, and have lent out his room. Alex encounters an elderly vagrant that he had attacked years earlier, and the vagrant and his friends attack him. Alex is saved by two policeman, but shocked to find they are his former droogs Dim and Georgie. They beat him up, drive him to the countryside, and nearly drown him before abandoning him. Alex barely makes it to the doorstep of a nearby home before collapsing.Alex wakes up to find himself in the home of Mr. Alexander and cared for by his manservent, Julian. Mr. Alexander does not recognize Alex from the previous attack but knows of Alex and the Ludovico technique from the newspapers. He sees Alex as a political weapon, and prepares to present him to his colleagues. While bathing, Alex breaks into \"Singin' in the Rain\", causing Mr. Alexander to remember the previous attack. With his colleagues, they knock out Alex and lock him in an upstairs bedroom, playing Beethoven's Ninth Symphony loudly from the floor below. Alex is unable to withstand the sickening pain and attempts suicide by throwing himself out the window, falling unconscious on the ground.Alex wakes up in a hospital with broken bones. While being given a series of psychological tests, Alex finds that he no longer has an aversion to violence or sex. The Minister arrives and apologizes to Alex. He offers to take care of Alex and get him a job in return for his cooperation with his election campaign and public relations counter-offensive. As a sign of goodwill, the Minister brings in a stereo system playing Beethoven's Ninth. Alex then contemplates violence and has vivid thoughts of himself having sex with a woman in front of an approving crowd, thinking: \"I was cured, all right!\"","Themes":"The film's central moral question (as in many of Burgess' books) is the definition of \"goodness\" and whether it makes sense to use aversion therapy to stop immoral behaviour.[5] Stanley Kubrick, writing in Saturday Review, described the film as:\"...A social satire dealing with the question of whether behavioural psychology and psychological conditioning are dangerous new weapons for a totalitarian government to use to impose vast controls on its citizens and turn them into little more than robots.\"[6]Similarly, on the film production's call sheet (cited at greater length above), Kubrick wrote:\"It is a story of the dubious redemption of a teenage delinquent by condition-reflex therapy. It is, at the same time, a running lecture on free-will.\"After aversion therapy, Alex behaves like a good member of society, but not by choice. His goodness is involuntary; he has become the titular clockwork orange — organic on the outside, mechanical on the inside. In the prison, after witnessing the Technique in action on Alex, the chaplain criticises it as false, arguing that true goodness must come from within. This leads to the theme of abusing liberties — personal, governmental, civil — by Alex, with two conflicting political forces, the Government and the Dissidents, both manipulating Alex for their purely political ends.[7] The story critically portrays the \"conservative\" and \"liberal\" parties as equal, for using Alex as a means to their political ends: the writer Frank Alexander — a victim of Alex and gang — wants revenge against Alex and sees him as a means of definitively turning the populace against the incumbent government and its new regime. Mr. Alexander fears the new government; in telephonic conversation, he says:\"...Recruiting brutal young roughs into the police; proposing debilitating and will-sapping techniques of conditioning. Oh, we've seen it all before in other countries; the thin end of the wedge! Before we know where we are, we shall have the full apparatus of totalitarianism.\"On the other side, the Minister of the Interior (the Government) jails Mr. Alexander (the Dissident Intellectual) on the excuse of his endangering Alex (the People), rather than the government's totalitarian regime (described by Mr. Alexander). It is unclear whether or not he has been harmed; however, the Minister tells Alex that the writer has been denied the ability to write and produce \"subversive\" material that is critical of the incumbent government and meant to provoke political unrest.It has been noted that Alex's immorality is reflected in the society in which he lives.[8] The Cat Lady's love of hardcore pornographic art is comparable to Alex's taste for sex and violence. Lighter forms of pornographic content adorn Alex's parents' home and, in a later scene, Alex awakens in hospital from his coma, interrupting a nurse and doctor engaged in a sexual act.Another critical target is the behaviourism or \"behavioural psychology\" propounded by psychologists John B. Watson and B. F. Skinner. Burgess disapproved of behaviourism, calling Skinner's book Beyond Freedom and Dignity (1971) \"one of the most dangerous books ever written.\" Although behaviourism's limitations were conceded by its principal founder, Watson, Skinner argued that behaviour modification — specifically, operant conditioning (learned behaviours via systematic reward-and-punishment techniques) rather than the \"classical\" Watsonian conditioning — is the key to an ideal society. The film's Ludovico technique is widely perceived as a parody of aversion therapy which is a form of classical conditioning.[9] Author Paul Duncan said of Alex: \"Alex is the narrator so we see everything from his point of view, including his mental images. The implication is that all of the images, both real and imagined, are part of Alex's fantasies\". [10] Psychiatrist Aaron Stern, the former head of the MPAA rating board, believed that Alex represents man in his natural state, the unconscious mind. Alex becomes \"civilised\" after receiving his Ludovico \"cure\", and the sickness in the aftermath Stern considered to be the \"neurosis imposed by society\".[11] Kubrick stated to Philip Strick and Penelope Houston that he believed Alex \"makes no attempt to deceive himself or the audience as to his total corruption or wickedness. He is the very personification of evil. On the other hand, he has winning qualities: his total candour, his wit, his intelligence and his energy; these are attractive qualities and ones, which I might add, which he shares with Richard III.\"[12]","Reception":"A Clockwork Orange was a hit with American audiences, grossing more than $26 million on a conservative budget of $2.2 million, was critically acclaimed, and was nominated for several awards, including the Academy Award for Best Picture (losing to The French Connection).[26] It also boosted sales of Beethoven's Symphony No. 9.[citation needed] As of 2015[update], A Clockwork Orange holds a 90% \"Certified Fresh\" rating among critics on Rotten Tomatoes.[27]The movie was the most popular film of 1972 in France with admissions of 7,611,745.[28]The film is ranked highly in many polls. It is ranked 46th in the AFI's 100 Years... 100 Movies and 70th in the AFI's 100 Years... 100 Movies (10th Anniversary Edition). In the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll.[29]Vincent Canby of The New York Times praised the film saying \"McDowell is splendid as tomorrow's child, but it is always Mr. Kubrick's picture, which is even technically more interesting than \"2001.\" Among other devices, Mr. Kubrick constantly uses what I assume to be a wide-angle lens to distort space relationships within scenes, so that the disconnection between lives, and between people and environment, becomes an actual, literal fact.\"[26] The following year, after the film won the New York Film Critics Award he called it \"a brilliant and dangerous work, but it is dangerous in a way that brilliant things sometimes are.\"[30]Despite general praise from critics, the film had notable detractors. Film critic Stanley Kauffmann commented, \"Inexplicably, the script leaves out Burgess' reference to the title\".[31] Roger Ebert gave A Clockwork Orange two stars out of four, calling it an \"ideological mess.\"[32] In the New Yorker review titled \"Stanley Strangelove\", Pauline Kael called it pornographic because of how it dehumanized Alex's victims while highlighting the sufferings of the protagonist. Kael derided Kubrick as a \"bad pornographer\", noting the Billyboy's gang extended stripping of the very buxom woman they intended to rape, claiming it was offered for titillation.[33]John Simon noted that the novel's most ambitious effects were based on language and the alienating effect of the narrator's Nadsat slang, making it a poor choice for a film. Concurring with some of Kael's criticisms about the depiction of Alex's victims, Simon noted that the writer character (young and likeable in the novel) was played by Patrick Magee, \"a very quirky and middle-aged actor who specialises in being repellent\". Simon comments further that \"Kubrick over-directs the basically excessive Magee until his eyes erupt like missiles from their silos and his face turns every shade of a Technicolor sunset.\"The film was re-released in North America in 1973 and earned $1.5 million in rentals.[34]Along with Bonnie and Clyde (1967), The Wild Bunch (1969), Soldier Blue (1970), Dirty Harry (1971), and Straw Dogs (1971), the film is considered a landmark in the relaxation of control on violence in the cinema.[35] In the United Kingdom, A Clockwork Orange was very controversial and withdrawn from release by Kubrick himself.[36] It is 21st in the AFI's 100 Years... 100 Thrills and number 46 in the AFI's 100 Years... 100 Movies, although in the second listing, it is ranked 70th of 100. \"Alex DeLarge\" is listed 12th in the villains section of the AFI's 100 Years... 100 Heroes and Villains. In 2008, the AFI's 10 Top 10 rated A Clockwork Orange as the 4th greatest science-fiction movie to date. In 2010, TIME placed it 9th on their list of the Top 10 Ridiculously Violent Movies.[37] In 2008, Empire ranked it 37th on their list of \"The 500 Greatest Movies of All Time.\", and in 2013, Empire ranked it 11th on their list of \"The 100 Best British Films Ever\".[38] Spanish auteur Luis Buñuel was highly praising of the film. He once said: \"A Clockwork Orange is my current favourite. I was predisposed against the film. After seeing it, I realised it is only a movie about what the modern world really means\".[12]In the United States, A Clockwork Orange was rated X in its original release in 1972. Later, Kubrick voluntarily replaced approximately 30 seconds of sexually explicit footage from two scenes with less explicit action for an R rating re-release in 1973. Current DVDs present the original version (reclassified with an \"R\" rating), and only some of the early 1980s VHS editions are the edited version.[44][45]Because of the explicit sex and violence, The National Catholic Office for Motion Pictures rated it C (\"Condemned\"), a rating which forbade Roman Catholics seeing the film. In 1982, the Office abolished the \"Condemned\" rating. Subsequently, films deemed to have unacceptable levels of sex and violence by the Conference of Bishops are rated O, \"Morally Offensive\".[46]Although it was passed uncut for UK cinemas in December 1971, British authorities considered the sexual violence in the film to be extreme. In March 1972, during the trial of a fourteen-year-old male accused of the manslaughter of a classmate, the prosecutor referred to A Clockwork Orange, suggesting that the film had a macabre relevance to the case.[47] The film was also linked to the murder of an elderly vagrant by a 16-year-old boy in Bletchley, Buckinghamshire, who pleaded guilty after telling police that friends had told him of the film \"and the beating up of an old boy like this one.\" Roger Gray QC, for the defence, told the court that \"the link between this crime and sensational literature, particularly A Clockwork Orange, is established beyond reasonable doubt\".[48] The press also blamed the film for a rape in which the attackers sang \"Singin' in the Rain\" as \"Singin' in the Rape\".[49] Christiane Kubrick, the director's wife, has said that the family received threats and had protesters outside their home.[50] Subsequently, Kubrick asked Warner Brothers to withdraw the film from British distribution. In response to allegations that the film was responsible for copycat violence Kubrick stated: \"To try and fasten any responsibility on art as the cause of life seems to me to put the case the wrong way around. Art consists of reshaping life, but it does not create life, nor cause life. Furthermore, to attribute powerful suggestive qualities to a film is at odds with the scientifically accepted view that, even after deep hypnosis in a posthypnotic state, people cannot be made to do things which are at odds with their natures.\"[51] The Scala Cinema Club went into receivership in 1993 after losing a legal battle following an unauthorized screening of the film.[52]Whatever the reason for the withdrawal, it was difficult to see A Clockwork Orange in the United Kingdom for 27 years. It was only after Kubrick's death in 1999 that the film reappeared in cinemas and was released on VHS and DVD. On July 4, 2001, the uncut version premiered on Sky TV's Sky Box Office, where it ran until mid-September.In 1993, Channel 4 broadcast Forbidden Fruit, a 27-minute documentary about the controversial withdrawal of the film in Britain.[53] It contains much footage from A Clockwork Orange, marking the only time portions of the film were shown to British audiences during the 27-year ban.","production_companies":"Polaris Productions Hawk Films","produced_by":"Stanley Kubrick","starring":"Malcolm McDowell|Patrick Magee|Adrienne Corri|Miriam Karlin|","music_by":"Walter Carlos","edited_by":"Bill Butler"}