{"country":"United States[1]","distributed_by":"Columbia Pictures","Plot":"In 2009, American geologist Adrian Helmsley visits astrophysicist Satnam Tsurutani in India and learns that neutrinos from a massive solar flare are heating the Earth's core. In Washington, D.C, Helmsley presents his information to White House Chief of Staff Carl Anheuser, who takes him to meet the President.In 2010, U.S. President Thomas Wilson and other international leaders begin a secret project to ensure humanity's survival. The G8 nations, plus China, start building nine enormous arks, capable of carrying 100,000 people each, near Cho Ming, Tibet, in the Himalayas. A Buddhist monk named Nima is evacuated while his brother Tenzin joins the Ark project. Funding is raised by selling tickets for €1 billion per person. By 2011, valuable items are moved to the arks with the help of art expert and First Daughter Dr. Laura Wilson.In 2012, science fiction writer Jackson Curtis is a chauffeur in Los Angeles for Russian billionaire Yuri Karpov. Jackson's former wife Kate, and their children Noah and Lilly, live with Kate's boyfriend, plastic surgeon Gordon Silberman. Jackson takes Noah and Lilly camping in Yellowstone National Park. When they find an area fenced off by the U.S. Army, Jackson takes his kids over the fence. They are caught and taken to see Helmsley. Released from military custody they meet Charlie Frost, who hosts a radio show from the park.That night, after the military evacuates from Yellowstone, Jackson watches Charlie's video of Charles Hapgood's theory that polar shifts and the Mesoamerican Long Count Calendar predict that the 2012 phenomenon will occur. Charlie tells Jackson that anyone who plotted to inform the public was killed. Earthquakes begin devastating California, and Jackson returns home to rescue his family. They escape Los Angeles in a private plane as the Earth crust displacement begins and California sinks into the Pacific Ocean.The group flies to Yellowstone to retrieve a map from Charlie displaying the location of the arks. They escape as the Yellowstone Caldera erupts spectacularly; Charlie stays behind to broadcast the eruption and is killed. The group later lands in Las Vegas to find a larger plane. They also find Yuri, his twin sons, Alec and Oleg, girlfriend Tamara and pilot Sasha. Sasha and Gordon fly them out in an available Antonov An-500 aircraft as the Yellowstone ash cloud destroys Las Vegas.Helmsley, Anheuser and Laura Wilson are flying to the Arks aboard Air Force One. President Wilson remains in Washington, D.C. to address the nation one last time. With the Vice President dead and the Speaker of the House missing, Anheuser becomes the acting commander-in-chief, despite not being part of the presidential line of succession. Millions of people die in devastating earthquakes worldwide, and megatsunamis destroy coastal areas, including D.C.When the group reaches China, the plane runs out of fuel. Sasha continues flying the plane as the others escape using a Bentley Continental Flying Spur stored in the cargo hold. Sasha is killed when the plane crashes; the others are spotted by helicopters from the Chinese army. Yuri and his sons, possessing tickets, are taken to the Arks, leaving the Curtis family, Tamara and Gordon behind. The remaining group are picked up by Nima and taken to the Arks with his grandparents. With the help of Tenzin, they stow away on Ark 4, where the United States contingent is aboard. As a megatsunami topples over the Himalayas and approaches the site, an impact driver becomes lodged in the gears of the Ark's doors, preventing a boarding gate from closing, which in turn prevents the ship from starting its engines. In the ensuing chaos, Yuri, Tamara and Gordon are killed, while Ark 4 begins filling with water and is set adrift. Jackson and Noah dislodge the impact driver, and the crew regains control of the Ark before it smashes into Mount Everest. Jackson reunites with his family, and he and Kate reconcile.Twenty-seven days later as waters recede, the three arks approach the Cape of Good Hope in South Africa where the Drakensberg mountain range has emerged, now the \"Tallest Mountain Range on Earth\". Helmsley starts a relationship with Laura while Jackson and Kate rekindle their relationship.An alternate ending is featured on the DVD release of the film. After Captain Michaels, the captain of Ark 4, announces that they are heading to the Cape of Good Hope, he tells Dr. Helmsley that he has a phone call waiting for him. Dr. Helmsley discovers that his father Harry is still alive. Harry tells his son that he, Tony (whose arm is in a sling), and some of the passengers and crew survived the megatsunami that struck the Genesis. Captain Michaels states that they should have a visual on the ocean-liner shortly. After Kate thanks Laura for taking care of Lily, Laura tells Jackson that she liked his book. Jackson then gives Noah his cell phone back which he recovered during Ark 4's flooding. Lily then announces that she sees an island. The Arks arrive at the shipwrecked Genesis and the survivors on the beach.[7][8]","2012":"Theatrical release poster","language":"English","Reception":"2012 earned $166,112,167 in North America and $603,567,306 in other territories for a worldwide total of $769,679,473. Worldwide it is the fifth highest-grossing 2009 film[29] and the fifth highest-grossing film distributed by Sony/Columbia, behind Sam Raimi's Spider-Man trilogy and Skyfall.[30] It is also the second highest grossing film directed by Roland Emmerich, behind Independence Day.[31] On its worldwide opening weekend it made $230.5 million, marking the fourth-largest opening of 2009 and the fourth-largest for Sony/Columbia.[32]In North America, it grossed $65,237,614 on its first weekend, ranking number one. Its opening is the fourth largest for a disaster film.[33] The film grossed $166,112,167 in total.[3]Outside North America, it is the 28th highest-grossing film, the fourth highest-grossing 2015 film[34] and the second highest-grossing film distributed by Sony/Columbia, after Skyfall. It earned $165.2 million on its opening weekend, which ranks as the 14th largest opening.[35] Its largest opening was recorded in France and the Maghreb region ($18.0 million). In total earnings, its three highest-grossing territories after North America are France and the Maghreb region ($44.0 million), Japan ($42.6 million), and Germany ($37.7 million).[36]Review aggregator Rotten Tomatoes shows that only 39% of 238 critics gave the film a positive review, with a rating average of 5 out of 10.[37] The site's consensus is that \"Roland Emmerich's 2012 provides plenty of visual thrills, but lacks a strong enough script to support its massive scope and inflated length.\"[38] Metacritic, which assigns a weighted average score out of 1–100 reviews from film critics, gave the film a 49 rating score based on 34 reviews.[39]Roger Ebert was enthusiastic about the film, giving it 3½ stars out of 4, saying it \"delivers what it promises, and since no sentient being will buy a ticket expecting anything else, it will be, for its audiences, one of the most satisfactory films of the year\".[40] Both Ebert and Claudia Puig of USA Today called the film the \"mother of all disaster movies\".[40][41] In contrast, Peter Travers of Rolling Stone gave the film a negative review and compared it to Transformers: Revenge of the Fallen: \"Beware 2012, which works the dubious miracle of almost matching Transformers 2 for sheer, cynical, mind-numbing, time-wasting, money-draining, soul-sucking stupidity.\"[42]North Korea had reportedly banned possession or viewing of the film. The year 2012 was the 100th anniversary of the birth of the nation's founder, Kim Il-sung, and has been designated by the North Korean government as \"the year for opening the grand gates to becoming a rising superpower\". Thus a movie depicting the year in a negative light was found to be offensive by the North Korean government. Several people in North Korea had reportedly been arrested for possessing or viewing imported copies of the movie and charged with \"grave provocation against the development of the state.\"[48][49]","Canceled television spin-off":"In 2010, Entertainment Weekly announced that there had been a plan for a spin-off television series entitled 2013 that would have served as a follow-up to the film.[50] Executive producer of 2012 Mark Gordon told EW that \"ABC will have an opening in their disaster-related programming after Lost ends, so people would be interested in this topic on a weekly basis. There's hope for the world despite the magnitude of the 2012 disaster as seen in the film. After the movie, there are some people who survive, and the question is how will these survivors build a new world and what will it look like. That might make an interesting TV series.\"[50] However, plans were later scrapped due to future budget concerns.[50] This would have been Emmerich's third film to get a spinoff, the first being Stargate (with its TV series Stargate SG-1, Stargate Infinity, Stargate Atlantis, Stargate Universe), and the second being Godzilla (with its cartoon sequel Godzilla: The Series).","box_office":"$769.7 million[3]","cinematography":"Dean Semler","production_company":"Centropolis Entertainment","directed_by":"Roland Emmerich","Soundtrack":"The original score for the film was composed by Harald Kloser and Thomas Wander. Singer Adam Lambert contributed a song for the film titled \"Time for Miracles\" and expressed his gratitude for the opportunity in an interview with MTV.[24]The film's soundtrack consists of 24 tracks, and it includes the songs \"Fades Like a Photograph\" by Filter and \"It Ain't the End of the World\", performed by George Segal and Blu Mankuma, which were featured in the film.[25] The trailer music was Master of Shadows by Two Steps From Hell.","release_dates":"November 13, 2009 (2009-11-13)|||||","Production":"The credits cite the bestselling book Fingerprints of the Gods by author Graham Hancock as inspiration for the film,[13] and in an interview with the London magazine Time Out, Emmerich states: \"I always wanted to do a biblical flood movie, but I never felt I had the hook. I first read about the Earth's Crust Displacement Theory in Graham Hancock's Fingerprints of the Gods.\"[14]Director Emmerich and composer-producer Harald Kloser had an extremely close relationship and also co-wrote a spec script entitled 2012, which was marketed to major studios in February 2008. Nearly all studios met with Emmerich and his representatives to hear the director's budget projection and story plans, a process that the director had previously gone through with the films Independence Day (1996) and The Day After Tomorrow (2004).[15] Later that month, Sony Pictures Entertainment won the rights for the spec script, planning to distribute it under Columbia Pictures[16] and was produced for less than budgeted. According to Emmerich, the film was eventually produced for about $200 million.[2]Filming was originally scheduled to begin in Los Angeles, California, in July 2008[4] but instead commenced in Kamloops, Savona, Cache Creek and Ashcroft in British Columbia, Canada.[17] Due to the possible 2008 Screen Actors Guild strike, filmmakers set up a contingency plan for salvaging the film.[18] Uncharted Territory, Digital Domain, Double Negative, Scanline, Sony Pictures Imageworks and others were hired to create computer animated visual effects for 2012.Although the film depicts the destruction of several major cultural and historical icons around the world, Emmerich stated that the Kaaba was also considered for selection. Kloser opposed the idea out of fear that a fatwā might be issued against him.[19][20]The film was promoted in a marketing campaign by a fictional organization, the \"Institute for Human Continuity\"; this entailed a fictitious book written by Jackson Curtis entitled Farewell Atlantis,[5] and streaming media, blog updates and radio broadcasts from the apocalyptic zealot Charlie Frost on his website This Is The End.[5]On November 12, 2008, the new studio released the first teaser trailer for 2012 that showed a tsunami surging over the Himalayas and interlaced a purportedly scientific message suggesting that the world would end in 2012, and that the world's governments were not preparing its population for the event. The trailer ended with a message to viewers to \"find out the truth\" by searching \"2012\" on search engines. The Guardian criticized the marketing effectiveness as \"deeply flawed\" and associated it with \"websites that make even more spurious claims about 2012\".[21]The studio also launched a viral marketing website operated by the fictional Institute for Human Continuity, where filmgoers could register for a lottery number to be part of a small population that would be rescued from the global destruction.[6] David Morrison of NASA received over 1000 inquiries from people who thought the website was genuine, and condemned it. \"I've even had cases of teenagers writing to me saying they are contemplating suicide because they don't want to see the world end,\" he said. \"I think when you lie on the internet and scare children to make a buck, that is ethically wrong.\"[22] Another viral marketing website promotes Farewell Atlantis, a fictional suspense novel about the events of 2012.[5]Comcast had also organized a \"roadblock campaign\" to promote the film, where a two-minute scene from the film was broadcast across 450 American commercial television networks, local English-language and Spanish-language stations, and 89 cable outlets within a ten-minute window between 10:50 PM EDT/PDT and 11:00 PM EDT/PDT on October 1, 2015.[23] The scene featured the destruction of Los Angeles and ended with a cliffhanger, with the entire 5-minute-38-second clip made available on Comcast's Fancast web site. The trade newspaper Variety estimated that, \"The stunt will put the footage in front of 90% of all households watching ad-supported TV, or nearly 110 million viewers. When combined with online and mobile streams, that could increase to more than 140 million\".[23]","produced_by":"Harald Kloser Mark Gordon Larry J. Franco","starring":"John Cusack|Chiwetel Ejiofor|Amanda Peet|Oliver Platt|Thandie Newton|Danny Glover|Woody Harrelson|","running_time":"158 minutes","music_by":"Harald Kloser Thomas Wander","edited_by":"David Brenner Peter Elliott","Release":"2012 was released on November 13, 2009.According to the studio, the film could have been completed for the summer release date, but the date change would give more time to the production. The film was released on November 13, 2009 in Sweden, Canada, Denmark, Mexico, India and the United States, and was released on November 13, 2009 in Japan.[26]The DVD and Blu-ray for 2012 was released on March 2, 2010. The 2-Disc Blu-ray Edition includes over 90 minutes of special features, including Adam Lambert's music video \"Time for Miracles\", and a Digital Copy for PSP, PC, Mac & iPod.[27] The European release date of 2012 on DVD was March 2, 2010; it includes the same special features as the North American version.A limited 3D version was re-released exclusively in select Cinemex theaters in Mexico in February 2010.[28]","written_by":"Harald Kloser Roland Emmerich","budget":"$200 million[2]"}