{"come_and_see":"Russian theatrical release poster","country":"Soviet Union","distributed_by":"Sovexportfilm","screenplay_by":"E. Klimov|A. Adamovich|","story_by":"A. Adamovich","Plot":"In 1943, two Belorussian boys dig in a sand field looking for abandoned rifles in order to join the Soviet partisan forces. One of the boys, Flyora, finds an SVT-40 rifle. The next day, partisans arrive at Flyora's house and conscript him. Flyora becomes a low-rank militiaman and is ordered to perform menial tasks. When the partisans are ready to move on, their commander, Kosach, orders Flyora to remain behind at the camp. Bitterly disappointed, Flyora walks into the forest weeping and meets Glafira (or Glasha), a beautiful girl infatuated with Kosach. Glasha becomes delusional and, thinking he is Kosach, kisses Flyora. Suddenly, the camp is attacked by German parachutists, and Flyora goes deaf from the heavy artillery fire.After hiding in the forest, Flyora and Glasha return to his house to find it deserted and covered in flies. Denying that his family is dead, Flyora believes that they are hiding on a nearby island across a bog. As they run from the village, Glasha sees a pile of bodies stacked behind the house, but doesn't tell him of it. Unable to accept the truth, Flyora becomes hysterical as he and Glasha wade through the bog. At the island, they meet a resistance fighter, Roubej, who takes the pair to a large group of villagers who have fled the Germans. Flyora sees Yustin, an elderly villager who had been doused in petrol and burnt by the Germans, and accepts that his family is dead and blames himself for the tragedy.Roubej takes Flyora and two others to find food, leaving Glasha to care for the villagers. They find that the food is being guarded by SS troops and is too well-defended to be raided. Flyora unknowingly leads the group through a minefield, resulting in the deaths of the two companions. At dusk, Roubej and Flyora sneak up to an occupied town and manage to steal a cow from a German-collaborating farmer, but Roubej and the cow are shot and killed as they flee. The next morning, Flyora, unable to move the dead cow, unsuccessfully tries to steal a horse and cart. The owner helps Flyora hide his partisan jacket and rifle when German soldiers approach, and takes him to his village of Perekhody, where they hurriedly discuss a fake identity for him.A German Einsatzkommando unit surrounds the village. While Flyora is introduced to much of the farmer's family, a German officer comes inside of the house and is given food and water. Flyora attempts to warn the townsfolk as they are herded by the German soldiers, but is caught by a collaborator and eventually forced to join them inside a church. When Flyora manages to leave the church, he is brought before the German unit's commander and is forced to watch as German soldiers set the church ablaze with the villagers inside. German soldiers play music and amuse themselves as the atrocity unfolds. Afterwards, a German officer points a gun to Flyora's head to pose for a picture before leaving him to die.Flyora wanders out of the scorched village, where he sees that the partisan soldiers ambushed the Germans as they left. After recovering his jacket and rifle, Flyora comes across a woman with a strong resemblance to Glasha who is in a fugue state after being raped. Flyora returns to the village and finds that his fellow partisans have captured eleven of the Germans and their collaborators, including the commander. Kosach forces most of the collaborators to douse the Germans with a can of petrol. However, the disgusted crowd shoots them all before they can be set on fire, ending their lives relatively painlessly. As the partisans leave, Flyora notices a framed portrait of Adolf Hitler in a puddle and shoots it – the first time he has used his rifle.In the film's final scene, Flyora catches up and blends in with his partisan comrades marching through the woods as snow blankets the ground.","language":"Belorussian|Russian|German|","Reception":"Come and See is widely considered a critical success, appearing on many lists of films considered the best. Film review aggregator Rotten Tomatoes reports a 95% approval critic response based on 21 reviews, with a weighted average score of 8.1/10.[8]According to Klimov, the film was so shocking for audiences that ambulances were sometimes called in to take away particularly impressionable viewers, both in the Soviet Union and abroad.[5] During one of the after-the-film discussions, an elderly German stood up and said: \"I was a soldier of the Wehrmacht; moreover, an officer of the Wehrmacht. I traveled through all of Poland and Belarus, finally reaching Ukraine. I will testify: everything that is told in this film is the truth. And the most frightening and shameful thing for me is that this film will be seen by my children and grandchildren.\"[4]Walter Goodman, writing for The New York Times, claimed that \"The history is harrowing and the presentation is graphic... Powerful material, powerfully rendered...\", dismissed the ending as \"a dose of instant inspirationalism,\" but concedes to Klimov's \"unquestionable talent.\"[9] Rita Kempley, of the Washington Post, wrote that \"directing with an angry eloquence, [Klimov] taps into that hallucinatory nether world of blood and mud and escalating madness that Francis Ford Coppola found in Apocalypse Now. And though he draws a surprisingly vivid performance from his inexperienced teen lead, Klimov's prowess is his visual poetry, muscular and animistic, like compatriot Andrei Konchalovsky's in his epic Siberiade.\" Mark Le Fanu wrote in Sight and Sound (03/01/1987) that Come and See is a \"powerful war film... The director has elicited an excellent performance form his central actor Kravchenko.\" Writing about Come and See, Daneet Steffens of Entertainment Weekly (11/02/2001) wrote that \"Klimov alternates the horrors of war with occasional fairy tale-like images; together they imbue the film with an unapologetically disturbing quality that persists long after the credits roll.\" Geoffrey Macnab of Sight and Sound (05/01/2006) wrote that \"Klimov's astonishing war movie combines intense lyricism with the kind of violent bloodletting that would make even Sam Peckinpah pause.\"In 2001, J. Hoberman of The Village Voice reviewed Come and See, writing the following: \"Directed for baroque intensity, Come and See is a robust art film with aspirations to the visionary – not so much graphic as leisurely literal-minded in its representation of mass murder. (The movie has been compared both to Schindler's List and Saving Private Ryan, and it would not be surprising to learn that Steven Spielberg had screened it before making either of these.[clarification needed]) The film's central atrocity is a barbaric circus of blaring music and barking dogs in which a squadron of drunken German soldiers round up and parade the peasants to their fiery doom... The bit of actual death-camp corpse footage that Klimov uses is doubly disturbing in that it retrospectively diminishes the care with which he orchestrates the town's destruction. For the most part, he prefers to show the Gorgon as reflected in Perseus's shield. There are few images more indelible than the sight of young Alexei Kravchenko's fear-petrified expression. By some accounts the boy was hypnotized for the movie's final scenes – most viewers will be as well.\"[10] In the same publication in 2009, Elliott Stein described Come and See as \"a startling mixture of lyrical poeticism and expressionist nightmare.\"[11]In 2002, Scott Tobias of The A.V. Club wrote that Klimov's \"impressions are unforgettable: the screaming cacophony of a bombing run broken up by the faint sound of a Mozart fugue, a dark, arid field suddenly lit up by eerily beautiful orange flares, German troops appearing like ghosts out of the heavy morning fog. A product of the glasnost era, Come and See is far from a patriotic memorial of Russia's hard-won victory. Instead, it's a chilling reminder of that victory's terrible costs.\"[12]British magazine The Word wrote that \"Come and See is widely regarded as the finest war film ever made, though possibly not by Great Escape fans.\"[13] Tim Lott wrote in 2009 that the film \"makes Apocalypse Now look lightweight\".[14]On 16 June 2010, Roger Ebert posted a review of Come and See as part of his \"Great Movies\" series, describing it as \"one of the most devastating films ever about anything, and in it, the survivors must envy the dead... The film depicts brutality and is occasionally very realistic, but there's an overlay of muted nightmarish exaggeration... I must not describe the famous sequence at the end. It must unfold as a surprise for you. It pretends to roll back history. You will see how. It is unutterably depressing, because history can never undo itself, and is with us forever.\"[15]The film was placed at number 60 on Empire magazines \"The 500 Greatest Movies of all Time\" in 2008.[16] Come and See was also included in Channel 4's list of 50 Films to See Before You Die[17] and was ranked number 24 in Empire magazines \"The 100 Best Films Of World Cinema\" in 2010.[18] Phil de Semlyen of Empire has described Come and See as \"Elim Klimov’s seriously influential, deeply unsettling Belarusian opus. No film – not Apocalypse Now, not Full Metal Jacket – spells out the dehumanising impact of conflict more vividly, or ferociously... An impressionist masterpiece and possibly the worst date movie ever.\"[19]Klimov did not make any more films after Come and See, leading some critics to speculate as to why. In 2001, Klimov said, \"I lost interest in making films ... Everything that was possible I felt I had already done.\"[20] Klimov died on 26 October 2003.[21]","cinematography":"A. Rodionov","production_company":"Mosfilm Belarusfilm","directed_by":"E. Klimov","Music":"The original soundtrack is rhythmically amorphous music composed by Oleg Yanchenko. At a few key points in the film existing music is used, sometimes mixed in with Yanchenko's music (such as Johann Strauss Jr.'s Blue Danube). At the end, during the montage, music by Richard Wagner is used, most notably the Tannhäuser Overture and the Ride from Die Walküre. The conclusion of the film uses the Lacrimosa from Mozart's Requiem. The Soviet marching song \"The Sacred War\" is also played in the movie once. During the scene where Glasha dances, the background music is taken from Grigori Aleksandrov's 1936 film Circus.","release_dates":"July 1985 (1985-07) (Moscow)|||||","Production":"Klimov co-wrote the screenplay with Ales Adamovich, who fought with the Belarusian partisans as a teenager. According to the director's recollections, work on the film began in 1977:And then I thought: the world doesn't know about Khatyn! They know about Katyn, about the massacre of the Polish officers there. But they don't know about Belorussia. Even though more than 600 villages were burned there!And I decided to make a film about this tragedy. I perfectly understood that the film would end up a harsh one. I decided that the central role of the village lad Flyora would not be played by a professional actor, who upon immersion into a difficult role could have protected himself psychologically with his accumulated acting experience, technique and skill. I wanted to find a simple boy fourteen years of age. We had to prepare him for the most difficult experiences, then capture them on film. And at the same time, we had to protect him from the stresses so that he wasn't left in the loony bin after filming was over, but was returned to his mother alive and healthy. Fortunately, with Lyosha Kravchenko, who played Flyora and who later became a good actor, everything went smoothly.I understood that this would be a very brutal film and that it was unlikely that people would be able to watch it. I told this to my screenplay coauthor, the writer Ales Adamovich. But he replied: \"Let them not watch it, then. This is something we must leave after us. As evidence of war, and as a plea for peace.\"For a long time, filming could not begin. The State Committee for Cinematography (Goskino) would not accept the screenplay, considering it a propaganda for the \"aesthetics of dirtiness\" and \"naturalism\".[4] In the end, Klimov was able to start filming in 1984 without having compromised to any censorship at all. The only change became the name of the film itself, which was changed to Come and See from the original title, Kill Hitler (Elem Klimov also says this in the 2006 UK DVD release).[5]The film was shot in chronological order over a period of nine months. Aleksey Kravchenko says that he underwent \"the most debilitating fatigue and hunger. I kept a most severe diet, and after the filming was over I returned to school not only thin, but grey-haired.\"[6] The 2006 UK DVD sleeve states that the guns in the film were often loaded with live ammunition as opposed to blanks, for realism. Aleksey Kravchenko mentions in interviews that bullets sometimes passed just 4 inches (10 centimeters) above his head (such as in the cow scene).The film's title derives from Chapter 6 of The Apocalypse of John, in which \"Come and see\" (Greek: Ἔρχου καὶ ἴδε, Erchou kai ide!) is said in the first, third, fifth, and seventh verses[Rev 6:1,3,5,7] as an invitation to look upon the destruction caused by the Four Horsemen of the Apocalypse.[7] Chapter 6, verses 7–8[Rev 6:7-8] have been cited as being particularly relevant to the film:And when he had opened the fourth seal, I heard the voice of the fourth beast say, Come and see! And I looked, and behold a pale horse: and his name that sat on him was Death, and Hell followed with him. And power was given unto them over the fourth part of the earth, to kill with sword, and with hunger, and with death, and with the beasts of the earth.","starring":"Aleksei Kravchenko|Olga Mironova|","running_time":"142 minutes[1]","music_by":"O. Yanchenko","edited_by":"V. Belova"}