{"based_on":"The Dark Command 1938 novel  by W.R. Burnett[1]","country":"United States","distributed_by":"Republic Pictures","Plot summary":"Mary McCloud (Claire Trevor) marries a seemingly peaceful Kansas schoolteacher William Cantrell (Walter Pidgeon), before finding out that he harbors a dark secret. He is actually an outlaw leader who attacks both sides in the Civil War for his own profit. After capturing a wagon loaded with Confederate uniforms, he decides to pass himself off as a Confederate officer. Her naive, idealistic brother Fletcher (Roy Rogers) joins what he believes is a Rebel guerrilla force. Meanwhile, Cantrell's stern, but loving mother (Marjorie Main) refuses to accept any of her son's ill-gotten loot.A former suitor of Mary's, Union supporter Bob Seton (John Wayne), is captured by Cantrell and scheduled for execution. After being rescued by a disillusioned Fletcher McCloud, Seton and Mary Cantrell race to the town of Lawrence (site of an actual infamous Quantrill-led massacre) to warn the residents of an impending attack by Cantrell's gang.","language":"English","cinematography":"Jack A. Marta","production_company":"Republic Pictures","directed_by":"Raoul Walsh","dark_command":"1940 film poster","release_dates":"April 15, 1940 (1940-04-15) (United States)|||||","Production":"Director Raoul Walsh had discovered John Wayne in 1929 when Wayne was a 23-year-old prop man named Marion \"Duke\" Morrison. Walsh was reading a biography of General \"Mad Anthony\" Wayne at the time and gave the prop boy the last name \"Wayne\" after casting him as the lead in The Big Trail (1930), a 70 mm Grandeur widescreen epic shot on location all across the West. Dark Command remains the only other film upon which both Walsh and Wayne collaborated during their lengthy careers.","produced_by":"Sol C. Siegel","starring":"Claire Trevor|John Wayne|Walter Pidgeon|Roy Rogers|Gabby Hayes|","running_time":"94 minutes","music_by":"Victor Young","edited_by":"William Morgan","written_by":"F. Hugh Herbert|Lionel Houser|Grover Jones|Jan Isbell Fortune (adaptation)|","budget":"$750,000[2]"}