{"directed_by":"Aleksei Balabanov","country":"Russian Federation","distributed_by":"Kino International Corp.","release_dates":"May 17, 1997 (Cannes)","Plot":"The film begins after the protagonist, Danila Bagrov (Sergei Bodrov Jr.) returns to his small hometown following his demobilisation from the Russian Army. Yet even before he reaches home, he ends up in a fight with security guards, when he accidentally walks onto a film set. The local police release him, on the condition that he will find work, and we learn that his late father, once a classmate of the precinct[clarification needed], became a thief in law and died in prison. His mother, not wishing for him to share his father's fate, insists he travels to St. Petersburg to seek out his successful older brother Viktor, whom his mother is confident will help him make a living.Danila travels to the city, but his first attempts to make contact with Viktor are unsuccessful. Instead, he travels around the city and befriends several people from a very wide urban spectrum: Kat (literally \"Torturer\", archaic), an energetic drug addict, and Nemets (literally \"German\") Hoffman (Yury Kuznetsov), a kind, homeless man whom Danila rescues from a thug.Unbeknown to their mother, Viktor (Viktor Sukhorukov) is an accomplished hitman who goes under the street name Tatarin, but is growing too independent and irritating his mob boss Krugly (literally: \"Round\"). His latest target is a Chechen mafia boss who was recently released from prison and who runs an open-air market. Krugly, who is unhappy with the amount of money that Viktor demanded for the hit, orders his thugs to secretly watch him.Viktor thus welcomes Danila, when they finally meet up. To avoid exposure, Viktor passes his assignment to his brother, gives him money to settle into the city, and then lies to him that the Chechen has been extorting from him, and asks Danila to perform the hit. Although he claims that his Army service was spent at the headquarters as a clerk, Danila carries out the task professionally. First he asks Nemets to find him a room in a communal flat in the city centre (much to the dismay of the old alcoholic landlord who threatens to shoot Nemets with his vintage hunting rifle, in revenge for World War II). He then constructs a makeshift silencer out of a plastic soda bottle and oil filter, and a decoy firecracker out of a matchbox. Finally he follows the Chechen and, despite the latter's security, takes him out without being spotted. As Danila makes his exit, Krugly's thugs spot him and chase him. Making his escape, Danila jumps into a freight tram, and despite being wounded in his palm, manages to kill one of his pursuers.The tram driver, a woman named Sveta, helps Danila escape. Later, despite her marriage to an abusive husband, the two begin an affair. After Danila recovers, he begins to enjoy St. Petersburg, gives his provincial image a makeover that includes buying some expensive clothing, goes to a concert with Sveta to his favourite band Nautilus Pompilius, and manages to scare her husband away from her. He meets up with Kat to go to a night club and then smokes pot in an afterparty, where he taunts a French tourist whom he mistakes for an American. The night ends with him sleeping with Kat.Krugly's loss of a thug, and the fact that Tatarin employed a substitute to carry out the hit (i.e. Danila), aggravates him even more. He decides to draw him into a combined raid. Once again Viktor, suspecting a trap, passes the job to Danila. The two thugs raid the apartment, but their main target is away. While they wait, by coincidence, in the apartment a floor above, a house party is taking place with several well known Russian Rock stars. A young radio director mistakes the raided flat for the party flat and is almost killed by the thugs, who take him as a hostage. Vyacheslav Butusov, Nautilus Pompilius's lead singer, makes the same mistake and almost shares the same fate, but Danila instead ventures above and for a moment relaxes in a friendly music atmosphere. Realising the balance between right and wrong, he comes downstairs, and finds that the thugs have just killed their main target and are about to do the same with Stepan, the radio director. Instead, Danila kills both thugs. Once again, Nemets helps Danila by disposing of the bodies.Krugly becomes incensed upon finding out what happened. Instead of going after Tatarin, he decides to track Danila and intercepts Sveta's tram. Later they raid her apartment, where his men beat and rape her, and learn his phone number, and thus his address. A henchman nicknamed Krot ambushes Danila near his apartment building but, luckily for Danila, the bullet hits his music player, giving him a chance to fire back and kill Krot. Realising it is not safe to stay at home, he travels to Sveta's and is shocked at her state. Initially thinking it was her husband, he is then shocked to learn who was responsible and realises the only way they could have tracked Sveta was when he returned a phone call from her home telephone to his brother.At the same time, Krugly raids Viktor's apartment and at gunpoint makes him call Danila so that he comes to pick up his payment. Realising the depth of the situation, Danila decides to end it all in one go. He goes back to the communal room that he was renting, buys the rifle from the old man, converts it into a sawn-off shotgun, and replaces the duck-hunting pellets with nail heads. At Viktor's apartment, he makes easy work of Krugly and two of his henchmen, and tells the surviving one to warn the rest of the gang that he keeps his word (not killing him) and that anyone who hurts his brother will be killed. In reply, the thug tells him that it was Viktor who turned him in.Despite this, Danila forgives his brother, gives him some of the money from Krugly's suitcase (keeping the rest for himself) and then tells him to return home. Danila decides to go to Moscow, as St. Petersburg, to quote Viktor \"is a pretty town, but provincial nonetheless\". Once again he visits Sveta, intending to take her with him, but her husband has returned and is beating her. Seeing Danila, he challenges him to a fight, but before he can come closer, Danila empties a shot into his thigh. Sveta rushes to her husband and begins to treat his wound. Danila urges her to come with him, but she tells him to get out and never come back. Danila leaves her a Nautilus Pompilius CD. Danila then meets up with Nemets, converses with him about the influence of the city on its residents, saying that everyone is weak here, to which Nemets replies that the city is an evil that drains the strength from those who enter it. Before he leaves the city, he finds Kat to say goodbye. She is indifferent to his departure, but he gives her money to go to a concert.The last scene of the film shows Danila walking out of a snow-covered forest. He hitches a ride to Moscow on a passing truck. As he chats up with the driver, the final shot is of the winter road stretching far into the wilderness.","produced_by":"Sergei Selyanov","starring":"Sergei Bodrov, Jr. Viktor Sukhorukov Vyacheslav Butusov","running_time":"99 minutes","language":"Russian","brother_брат":"Russian poster","written_by":"Aleksei Balabanov","budget":"$10,000[citation needed]"}