{"disconnect":"Theatrical release poster","country":"United States","distributed_by":"LD Entertainment","Plot":"An ambitious, up-and-coming reporter Nina Dunham has much success with her interview with underage video chat-room stripper Kyle. Kyle, a runaway, works in a whole \"house\" with other chat-room strippers under his boss, Harvey. However, the FBI wants her to reveal his address in order to shut down the whole website that hosts the web-rooms. Since she has paid him in order to make initial contact, she may have broken the law, making the police and her boss put pressure on her to cooperate. Nina wants to save him from the business, yet fears losing his trust in the process. Kyle reluctantly gives her the address, and somehow, Harvey is tipped off and the entire house flees. When Nina discovers this, she follows them to the motel where they're staying, and asks Kyle to leave with her. At first, Kyle is hopeful for the future and willing, but when Nina is hesitant to guarantee him safe haven in her home, he resists. Harvey watches the argument, then slaps Nina. The entire group of chat-room strippers leave and Nina drives away in tears.Two boys, Jason and his friend Frye, impersonate a girl, \"Jessica Rhony,\" on Facebook Messenger and convince teenager Ben (the son of Rich, a legal counsel at the TV station where Nina works) to send a nude picture of himself. The boys distribute it to classmates, and the picture circulates to nearly everyone in their grade. Ben is so embarrassed by this cyber bullying that he attempts suicide by hanging himself and ends up in a coma. Rich doggedly searches Ben's social media, looking for answers, and begins chatting with \"Jessica.\" Jason visits Ben in the hospital, where he meets Rich, and falsely calls himself Mike. Jason's father (the real Mike) discovers what Jason has been doing and becomes very angry with him. However, he grudgingly protects his son by erasing the evidence on Frye's iPad. Later, Rich discovers that Jason is actually \"Jessica,\" and goes to Mike's house angrily, resulting in a physical altercation. Jason tries to intervene, and Rich hits him with a hockey stick. Mike then hits Rich, who falls to the ground, which stops the fight.Cindy and Derek, a married couple who recently lost their child, struggle after their identities are stolen online. They hire private detective Mike (Jason's father) to find the thief, and after revealing that Cindy had been regularly chatting on a support group website, Mike determines their burglar. Cindy and Derek go after the suspect, Stephen Schumacher, following him at work, watching his movements, and breaking into his home for evidence. Right before Derek goes to confront him at his front door, Mike calls to tell him that Schumacher is not their guy, that he too was a victim of the burglar. Schumacher, who had been noticing Cindy and Derek stalking him, confronts them in their car with a rifle; however, Derek, a former Marine, disarms him and forces him back into his house. Cindy is able to coax the gun away, relating to the online chats about each of their losses.The film ends with none of the stories being resolved, and yet, with all characters having grown closer to the ones they love in the process, or rather, having stopped \"disconnecting.\"","language":"English","Reception":"Disconnect opened in a Limited release on April 12 2013 in 15 theaters and grossed $124,000 with an average of $8,267 per theater ranking #31 at the box office. The film's widest release domestically was 180 theaters and it ended up earning $1,436,900 in the United States and $1,991,148 internationally for a total of $3,428,048.[5][3]Disconnect received positive reviews from critics and has a score of 68% on Rotten Tomatoes based on 75 reviews with an average rating of 6.6 out of 10. The critical consensus states \"It's didactic in spots and melodramatic in others, but Disconnect's strong cast helps make it a timely, effective exploration of modern society's technological overload.\"[6] The film also has a score of 64 out of 100 on Metacritic based on 24 critics indicating \"generally favourable reviews\".[7]Richard Roeper of the Chicago Sun-Times gave the film four out of four stars and wrote \"Even when the dramatic stakes are raised to the point of pounding music accompanying super-slow motion, potentially tragic violence, \"Disconnect\" struck a chord with me in a way few films have in recent years. I believed the lives of these people. I believed they'd do the drastic things they do in the face of crisis. I ached for them when things went terribly wrong and rooted for them when there were glimmers of hope. You should see this movie. Please...There wasn't a moment during this movie when I thought about anything other than this movie.\"[8]","box_office":"$3.4 million[2][3]","cinematography":"Ken Seng","directed_by":"Henry Alex Rubin","release_dates":"September 11, 2012 (2012-09-11) (Toronto)|April 12, 2013 (2013-04-12) (United States)||||","produced_by":"Mickey Liddell|William Horberg|Jennifer Hilton|","starring":"Jason Bateman|Hope Davis|Frank Grillo|Michael Nyqvist|Paula Patton|Andrea Riseborough|Alexander Skarsgård|Max Thieriot|Colin Ford|Jonah Bobo|","running_time":"115 minutes[1]","music_by":"Max Richter","edited_by":"Lee Percy","written_by":"Andrew Stern"}