{"country":"Germany United Kingdom","distributed_by":"Columbia Pictures","Plot":"After a monologue delivered by Derek Jacobi, the film opens in 1603, with Robert Cecil, Earl of Salisbury, ordering a desperate search for a trove of manuscripts. Ben Jonson, who has the manuscripts, flees down the streets of London and into the theatre known as The Rose. Hot on his heels, the soldiers who have been sent to arrest Jonson, break down the doors and intentionally set the theatre alight. Successive flashbacks cast us back five and then forty years, as the film evokes the reputed life of Edward de Vere from childhood through to his entanglement in an insurrection, and later on to his deathbed.The main action takes place five years earlier in 1598, a decade after the defeat of the Spanish Armada, as political intrigue flourishes between the Tudors and the Cecils (father William and son Robert), over the succession to Queen Elizabeth I. In flashbacks, de Vere is portrayed as a prodigious genius, writing at eight or nine years of age (1558/1559) A Midsummer Night's Dream, de Vere acting the role of Puck before the young queen Elizabeth. He is then forced to live in the repressive, puritanical house of William Cecil where, years later, he kills a spying servant lurking behind an arras, much like the death of Polonius in Hamlet. William Cecil uses this murder to blackmail de Vere into a loveless marriage with his daughter, Anne Cecil, compelling him also to renounce literature. De Vere later becomes the Queen's lover, and sires – unknown to him – an illegitimate son; the son is adopted, becoming Henry Wriothesley, 3rd Earl of Southampton, but his true parentage is hidden from all but the Cecils.De Vere must struggle against a taboo that would forbid him to write; against his wife's impatience with his literary work as a dishonour to her family;[8] and against the Queen's counsellors. Foremost among these is his father-in-law William Cecil, who believes that theatres are sinful. Cecil's plan to have James VI of Scotland, the son of Mary, Queen of Scots, crowned king is also threatened by the presence of de Vere's and the Queen's child, who would be an alternative contender for the throne, and also of pure Tudor lineage.Almost four decades after his private premiere, de Vere visits a public theatre and is deeply impressed by the way spectators can be swayed. The play, written by Jonson, is halted mid-performance by the royal militia because of its allegedly seditious content. Jonson is arrested and imprisoned. Much taken by the propagandistic power of art, de Vere decides to employ his secretly written plays for the promotion of the Earl of Essex's cause (Essex being another of the Queen's illegitimate sons) over the candidate preferred by the Cecils, writing Henry V and, later, Richard III as propaganda designed to foment revolution. He contacts Jonson, who is confined in the Tower of London until de Vere uses his influence to free him, in order to have his play Henry V staged under Jonson's name. Jonson is unhappy about the plan, assuming that the play will be an amateurish effort that will tarnish his name. Jonson does not claim authorship, allowing an unscrupulous young actor, William Shakespeare, to step up on stage as author. It is this \"drunken oaf\" who takes on the role as de Vere's front man, while Jonson becomes de Vere's only confidant in the truth.Shakespeare however, having discovered the real author's identity, extorts money from de Vere to build the Globe Theatre, and wangles £400 per year for posturing as a front. After Christopher Marlowe stumbles on the truth that Shakespeare's inexplicable talents hide the genius of another hand, he is found with his throat slit. Jonson later confronts Shakespeare and accuses him of the murder.At the climax, de Vere uses the play Richard III as a thinly veiled attack on the hunchbacked Robert Cecil. The plan is to incite a mob to march against Cecil, and thus weaken his position at court. At the same time, Essex is to march with the Earl of Southampton to the Palace, to promote his own claim to the succession. Meanwhile, de Vere writes Venus and Adonis to remind the Queen of their old love. He hopes to see her again in an atmosphere of renewed intimacy, and to persuade her to dismiss Cecil.The plan fails, however, as a jealous Jonson, unaware of de Vere's plan, betrays the plot to Cecil. Jonson soon learns of the plan, but fails to alert Francesco of his betrayal in time, as the mob is massacred by soldiers with muskets and artillery pieces, stopping it from joining Essex. The Queen, swayed by Cecil, thinks that Essex is trying to depose her. Essex and his men are lured into the Palace courtyard, where they are ambushed by soldiers firing muskets from the balconies above. Essex and Southampton surrender honorably. Essex is later executed, but not before screaming \"God save the Queen!\". Southampton is later released.Robert Cecil then tells a broken de Vere that Elizabeth had other bastard sons – one of whom was de Vere himself. If true, it would mean that de Vere committed incest with his mother. He has a private audience with Elizabeth, at which the Queen agrees to spare Southampton, but insists that de Vere remain anonymous as the true author of \"Shakespeare's\" works.After the Queen's death, James VI succeeds as James I of England, though Cecil's hopes for a more puritanical regime are shattered when James reveals himself to be an avid \"theater man\". Shakespeare retires on his ill-gotten gains to Stratford to become a businessman, and de Vere dies in 1604, having commended his manuscripts to the care of a repentant Jonson. Cecil, however, still wants the manuscripts destroyed. With the destruction of The Rose, he believes them destroyed, but he later discovers they have survived. Nevertheless, the \"truth\" remains concealed: that Edward de Vere, not the nearly illiterate Shakespeare, is their real author.","language":"English","Reception":"The film received mixed reviews from critics. Review aggregator Rotten Tomatoes reports that 46% of 168 critics have given the film a positive review, with an average rating of 5.5/10. The site's consensus reads: \"Roland Emmerich delivers his trademark visual and emotional bombast, but the more Anonymous stops and tries to convince the audience of its half-baked theory, the less convincing it becomes.\"[20] Metacritic gives the film a score of 50 out of 100, based on 40 critics, indicating \"mixed or average reviews\".Rex Reed regards Anonymous as \"one of the most exciting on-screen literary rows since Norman Mailer was beaten with a hammer,\" and well worth the stamina required to sit out what is an otherwise exhausting film. Not only Shakespeare's identity, but also that of Queen Elizabeth, the \"Virgin Queen\" is challenged by Orloff's script, which has her as \"a randy piece of work who had many lovers and bore several children.\" Visually, the film gives us a \"dazzling panorama of Tudor history\" which will not bore viewers. It boasts a cast of pure gold, and its \"recreation of the Old Globe, the fame that brought ruin and dishonor to both Oxford and the money-grubbing Shakespeare, and the sacrifice of Oxford's own property and family fortune to write plays he believed in against a background of danger and violence make for a bloody good yarn, masterfully told, lushly appointed, slavishly researched and brilliantly acted.\" He adds the caveats that it does play \"hopscotch with history\", has a bewildering and confusing cast of characters and is jumpy in its timeframes.[21]Michael Phillips for the Chicago Tribune writes that the film is ridiculous but not dull. Displaying a \"rollicking belief in its own nutty bombast\" as \"history is simultaneously being made up and rewritten,\" its best scenes are those of the candle-lit interiors caught by the Alexa digital camera on a lovely copper-and-honey-toned palette. After a week, what remains in Phillips' memory is not the de Vere/Shakespeare conspiracy theory but \"the way Redgrave gazes out a window, her reign near the end, her eyes full of regret but also of fiery defiance of the balderdash lapping at her feet.\"[22]Roger Ebert finds Orloff's screenplay \"ingenious,\" Emmerich's direction \"precise\", and the cast \"memorable\". Though \"profoundly mistaken\", Anonymous is \"a marvellous historical film,\" giving viewers \"a splendid experience: the dialogue, the acting, the depiction of London, the lust, jealousy and intrigue.\" That said, he rounds off, he must \"tiresomely insist that Edward de Vere did not write Shakespeare's plays.\"[23]Kirk Honeycutt ranked it as Emmerich's best film, with a superb cast of British actors, and a stunning digitally-enhanced recreation of London in Elizabethan times. The film is \"glorious fun as it grows increasingly implausible\", for the plot \"is all historical rubbish\".[24] Damon Wise, reviewing the film for The Guardian, appraises Emmerich's \"meticulously crafted\" and \"stunningly designed takedown of the Bard\", as shocking only in that it is rather good. Emmerich's problem, he argues, is that he was so intent on proving his credentials as a serious director that the film ended up \"drowned in exposition\". Orloff's screenplay heavily confuses plotlines; the politics are retrofitted to suit the theory. The lead roles are \"unengaging\" but special mention is given to Edward Hogg's performance as Robert Cecil, and Vanessa Redgrave's role as Elizabeth.[25]Robert Koehler, writing for Variety, reads the film as an \"illustrated argument\" of an \"aggressively promoted and more frequently debunked\" theory, and finds it less interesting than the actors who play a role in, or endorse, it. Narrative cogency is strained by the constant switches in time signature, and the imbroglio of Shakespeare and Jonson squabbling publicly over claims to authorship is both tiresome and \"veers close to comedy\"; indeed it is superfluous given Ifans's commanding and convincing acting as the \"real\" Shakespeare. The supporting cast of actors is praised for fine performances, except for Spall's Shakespeare, who is \"often so ridiculous that the 'Stratfordians' will feel doubly insulted.\" Sebastian Krawinkel's \"ambitious and gorgeous production design\" comes in for special mention, as does Anna J. Foerster's elegant widescreen lensing. The score however fails their standards.[26]Kristopher Tapley champions the film, finding that Orloff has spun \"a fascinating yarn\". Ifans gives a stunning performance, and Spall's Shakespeare provides delightful comic relief. The film is \"gorgeous\" and Tapley agrees with a colleague's judgement that \"people will likely look back to Anonymous as the tipping point of what you can really do with digital in a next-level kind of way\".'[27]David Denby, reviewing for the New Yorker, writes of Emmerich's \"preposterous fantasia\", where confusion reigns as to which of the virgin queen's illegitimate children is Essex and which Southampton, and where it is not clear what the connection is between the plot to hide the authorship of the plays and the struggle to find a successor to the officially childless Elizabeth. He concludes that, \"The Oxford theory is ridiculous, yet the filmmakers go all the way with it, producing endless scenes of indecipherable court intrigue in dark, smoky rooms, and a fashion show of ruffs, farthingales, and halberds. The more far-fetched the idea, it seems, the more strenuous the effort to pass it off as authentic.\"[28]James Lileks, in the Star Tribune review, noting favourable responses, including one where a critic wondered if Emmerich had anything to do with it, says the devious message must be that a shlock-merchant like Emmerich wasn't involved, but, like the film plot itself, must conceal the hand of some more experienced filmmaker, whose identity will be much debated for centuries to come.[29] Reviewing for Associated Press, Christy Lemire commends Rhys Ifans' performance as \"flamboyant, funny, sexy\" in an otherwise heavy-handed and clumsy film, whose script \"jumps back and forth in time so quickly and without rhyme or reason, it convolutes the narrative.\" A \"flow chart\" is perhaps needed to keep track of all of the sons, and sons of sons. The \"blubbering\" about the brilliance of Shakespeare's works is repetitive, and upstages the initial whiff of scandal, giving the impression that the film is \"much ado about nothing\".[30]For A. O. Scott, writing for The New York Times, Anonymous is \"a vulgar prank on the English literary tradition, a travesty of British history and a brutal insult to the human imagination\". Yet, a fine cast manages to \"burnish even meretricious nonsense with craft and conviction\", and one is \"tempted to suspend disbelief, even if Mr. Emmerich finally makes it impossible.\"[31] Lou Lumenick, writing for the New York Post, writes that the movie \"is a thoroughly entertaining load of eye candy with solid performances, even if John Orloff’s exposition-heavy script practically requires a concordance to follow at times.\"[32] For the Globe and Mail's Liam Lacey, \"the less you know about Shakespeare, the more you're likely to enjoy Anonymous.\" Ingenuity is wasted on an \"unintelligent enterprise\", that of arguing that people of humble origins cannot outwrite blue-bloods. Emmerich's CGI effects are well-done, but it is amazing just to watch an \"actor on a bare wooden stage, using nothing but a sequence of words that make your scalp prickle.\"[33]Andrea Chase in Killer Movie Reviews rates Anonymous as \"superb\", dwelling on Orloff's rich script, which has \"done an excellent job of fitting the known facts to the thesis on offer\", on Emmerich's dramatic flair and the wonderful supporting cast. It is somewhat spoiled by Ifans's leaden presence, which betrays nothing of \"the ribald temper to be found in the plays.\" By contrast, Spall's Shakespeare, \"preening with the narcissist's elan of a confirmed ham, lights up the screen.\"[34]Louise Keller for Urban Cinefile admires the \"thought-provoking scenario\" of Orloff's \"marvellous conspiracy story\", though its \"twists and turns\" are headspinning: \"anyone who can follow the first 30 minutes of the plot, must have been polishing the grey matter with advanced Sudoku: it's an unholy mess of complicated situations and jumps in time frame.\" Despite the exemplary cast, exquisite production design and extraordinary look, Emmerich has lost an opportunity to make more of it, \"on account of the jumbled, convoluted storyline that had me confused, frustrated and mentally scrambling to keep abreast of every detail,\" though everything falls together in the final 45 minutes.[35]Perhaps the most accurate answer, summarizing most critical responses surrounding Anonymous, came from James Shapiro who published in The Guardian a convincing demonstration on November 4, 2011.[36]Anonymous was originally slated for world-wide release in a Shakespeare in Love-style opening, but was rescheduled for restricted release on 28 October 2011 in 265 theatres in the United States, Canada, Ireland, and the United Kingdom, expanding to 513 screens in its second week.[37] Pre-release surveys had predicted a weak opening weekend (under $5 million), leading Sony to stagger release dates and depend on word-of-mouth to support a more gradual release strategy (as they did with Company Town). According to Brendan Bettinger, \"Anonymous came out of Toronto with surprisingly positive early reviews for a Roland Emmerich picture.\" Sony distribution president Rory Bruer noted \"We love the picture and think it's going to get great word of mouth. We're committed to expanding it until it plays wide.\"[38] In the event the film was a \"box office disaster\".[39]Anonymous was nominated for an Academy Award for Best Costume Design for German Costume Designer Lisy Christl's work.[40] That same year, it was also nominated for 7 Lolas, winning in 6 Categories including Best Cinematography for Anna J. Foerster, Best Art Direction for Stephan O. Gessler and Sebastian T. Krawinkel and Best Costume Design for Lisy Christl. At the Satellite Awards, the film was nominated in two categories including Best Art Direction (and Production Design) for Stephan O. Gessler and Sebastian T. Krawinkel, and Best Costume Design for Lisy Christl.[41] Vanessa Redgrave was nominated for Best British Actress of the Year at the London Film Critics Circle Awards for Anonymous and Coriolanus.[42] The film also received a nomination from the Art Directors Guild for Period Film, honouring Production designer Sebastian T. Krawinkel.[43]","box_office":"$15.4 million [3]","cinematography":"Anna Foerster","production_company":"Anonymous Pictures Centropolis Entertainment Relativity Media Studio Babelsberg Motion Pictures","directed_by":"Roland Emmerich","release_dates":"11 September 2011 (2011-09-11) (Toronto International Film Festival)|28 October 2011 (2011-10-28) (United Kingdom)|10 November 2011 (2011-11-10) (Germany)|||","Production":"Screenwriter John Orloff (Band of Brothers, A Mighty Heart) became interested in the authorship debate after watching a 1989 Frontline programme about the controversy.[10] Penning his first draft in the late 1990s, commercial interest waned after Shakespeare in Love was released in 1998.[11] It was almost greenlit as The Soul of the Age for a 2005 release, with a budget of $30 to $35 million. However, financing proved to be \"a risky undertaking,\" according to director Roland Emmerich. In October 2009, Emmerich stated, \"It's very hard to get a movie like this made, and I want to make it in a certain way. I've actually had this project for eight years.\"[12] At a press conference at Studio Babelsberg on April 29, 2010, Emmerich noted that the success of his more commercial films made this one possible, and that he got the cast he wanted without the pressure to come up with \"at least two A-list American actors.\"[13]Emmerich noted he knew little of either Elizabethan history or the authorship question until he came across John Orloff's script, after which he \"steeped\" himself in the various theories.[14][15][16] Wary of similarities with Amadeus, Emmerich decided to recast it as a film on the politics of succession and the monarchy, a tragedy about kings, queens and princes, with broad plot lines including murder, illegitimacy and incest – \"all the elements of a Shakespeare play.\"[17]In a November 2009 interview, Emmerich said the heart of the movie is in the original title, The Soul of the Age, and revolved around three main characters: Ben Jonson, William Shakespeare, and the Earl of Oxford. In a subsequent announcement in 2010, Emmerich detailed the finalised plot line:[18]\"It's a mix of a lot of things: it's an historical thriller because it's about who will succeed Queen Elizabeth and the struggle of the people who want to have a hand in it. It's the Tudors on one side and the Cecils on the other, and in between [the two] is the Queen. Through that story we tell how the plays written by the Earl of Oxford ended up labelled 'William Shakespeare'.\"Anonymous was the first motion picture to be shot with Arriflex's new Alexa camera, with most of the period backgrounds created and enhanced via new CGI technology.[19] In addition, Elizabethan London was recreated for the film with more than 70 painstakingly hand-built sets at Germany's Studio Babelsberg. These include a full-scale replica of London's imposing The Rose theatre.","anonymous":"Theatrical release poster","produced_by":"Roland Emmerich Larry Franco Robert Leger","starring":"Rhys Ifans Vanessa Redgrave Joely Richardson David Thewlis Xavier Samuel Sebastian Armesto Rafe Spall Edward Hogg Jamie Campbell Bower Mark Rylance Trystan Gravelle Derek Jacobi","running_time":"130 minutes[1]","Controversy":"In a trailer for the movie, Emmerich lists ten reasons why in his view Shakespeare of Stratford did not write the plays attributed to him.[44] Postproduction plans envisaged the release of a documentary about the Shakespeare authorship question, and providing materials for teachers. According to Sony Pictures, \"The objective for our Anonymous program, as stated in the classroom literature, is 'to encourage critical thinking by challenging students to examine the theories about the authorship of Shakespeare's works and to formulate their own opinions.' The study guide does not state that Edward de Vere is the writer of Shakespeare's work, but it does pose the authorship question which has been debated by scholars for decades\".[45] In response, on September 1, 2011, the Shakespeare Birthplace Trust launched a programme to debunk conspiracy theories about Shakespeare, mounting an Internet video in which 60 scholars and writers reply to common queries and doubts about Shakespeare's identity for one minute each.[46][47] In Shakespeare's home county of Warwickshire, the Shakespeare Birthplace Trust promoted a protest against the film by temporarily covering or crossing out Shakespeare's image or name on pub signs and road signs.[48]Columbia University's James Shapiro, in an interview with the Wall Street Journal[49] noted that according to an article in the same journal in 2009, three U.S. Supreme Court Justices now lent support to the Oxfordian theory whereas in a moot court judgment in 1987 Justices John Paul Stevens, Harry Blackmun and William Brennan had \"ruled unanimously in favor of Shakespeare and against the Earl of Oxford.\"[50][51] \"The attraction of these ideas owes something to the Internet, where conspiracy theories proliferate,\" he argued, adding that \"Emmerich's film is one more sign that conspiracy theories about the authorship of Shakespeare's plays have gone mainstream\". Scriptwriter John Orloff replied that Shapiro oversimplified the facts since Justice Stevens later affirmed that he had had \"lingering concerns\" and \"gnawing doubts\" in 1987 that Shakespeare might have been someone else, and that if the author was not the man from Stratford, there was a high probability he was Edward de Vere.\"[52]Emmerich complains of what he sees as the \"arrogance of the literary establishment\" to say: \"We know it, we teach it, so shut the fuck up.\" He has singled out James Shapiro, an expert on these theories, as a liar:He [Shapiro] ... sometimes claims certain things which then I then as a scholar cannot dispute, but later I check on it and find out he was totally lying. Just outright lying. It's bizarre. But they also have a lot to lose. He wrote a bestseller about William Shakespeare called \"1599\" which is one year in the life of this mine (sic) which is incredible to read when you all of a sudden realize where did he get all of this stuff from?[53]Emmerich is on record as believing that \"everybody in the Stratfordian side is so pissed off because we've called them on their lies.\"[54] Shapiro believes that while supporters of de Vere's candidacy as the author of Shakespeare's plays have awaited this film with excitement, in his view, they may live to regret it.[55] Robert McCrum in The Guardian wrote that, as the Internet is the natural home of conspiracy theories, the Oxford case, \"a conspiracy theory in doublet and hose with a vengeance,\" means that Anonymous, irrespective of its merits or lack of them, will usher in an \"open season for every denomination of literary fanatic.\"[56]Screenwriter John Orloff argued that the film would reshape the way we read Shakespeare.[10] Derek Jacobi said that making the film was \"a very risky thing to do\", and imagines that \"the orthodox Stratfordians are going to be apoplectic with rage.\"[57]Bert Fields, a lawyer who wrote a book about the authorship issue, thinks scholars may be missing the larger benefit that Anonymous provides – widespread appreciation of the Bard's work. \"Why do these academics feel threatened by this? It isn't threatening anybody,\" Fields commented. \"The movie does things that I don't necessarily agree with. But if anything, it makes the work more important. It focuses attention on the most important body of work in the English language.\"[45]In an interview with The Atlantic, scriptwriter John Orloff was asked \"In crafting your characters and the narrative, how were you able to find the right balance between historical fact, fiction, and speculation?\" Orloff responded: \"Ultimately, Shakespeare himself was our guide. The Shakespeare histories are not really histories. They're dramas. He compresses time. He adds characters that have been dead by the time the events are occurring. He'll invent characters out of whole cloth, like Falstaff in the history plays. First and foremost it's a drama, and just like Shakespeare we're creating drama.\"Director Emmerich, when given examples of details that do not correspond to the facts, is reported as being more concerned with the mood of the film.[58] He agreed that there were many historical mistakes in his film, but said movies have a right to do this, citing Amadeus. Emmerich also notes that Shakespeare himself was not concerned with historical accuracy, and considers that the inner truth was his objective.[59]Crace, raising the issue of Emmerich as 'literary detective' comments that the director \"has never knowingly let the facts get in the way of a good story.\"[16] Historian Simon Schama calling the film 'inadvertently comic' said of its thesis that the real problem was not so much the \"idiotic misunderstanding of history and the world of the theater\" but rather the \"fatal lack of imagination on the subject of the imagination.\"[60] James Shapiro wrote that it is a film for our time, \"in which claims based on conviction are as valid as those based on hard evidence,\" which ingeniously circumvents objections that there is not a scrap of documentary evidence for de Vere's authorship by assuming a conspiracy to suppress the truth. The result is that \"the very absence of surviving evidence proves the case.\"[55]Tiffany Stern, professor of early modern drama at Oxford University, says that the film is fictional, and should be enjoyed as such. Gordon McMullan, professor of English at King's College, says Shakespeare wrote the plays, and the idea he didn't is related to a conspiracy theory that coincides with the emergence of the detective genre. For Orloff, criticisms by scholars that call the film fictional rather than factual are kneejerk reactions to the \"academic subversion of normality\".[61]In a pre-release interview, scriptwriter Orloff said that, with the exception of whether Shakespeare wrote the plays or not, \"The movie is unbelievably historically accurate... What I mean by that is that I, like Henry James, Mark Twain, Walt Whitman, Derek Jacobi and John Gielgud, don't think Shakespeare wrote the plays, but obviously a lot more people do think Shakespeare wrote the plays. Obviously, in my movie, he didn't, so a lot of people will say that's not historically accurate and they are totally welcome to that opinion. But, the world within the movie, that that story takes place in, is incredibly accurate, like the Essex Rebellion and the ages of the characters.\"Orloff also described the attention given to creating a \"real London\", noting that the effects crew \"took 30,000 pictures in England, of every Tudor building they could find, and then they scanned them all into the computer and built real London in 1600.\"[62]According to Holger Syme,[63] Stephen Marche[64] and James Shapiro,[65] the film does contain a number of historical inaccuracies. These include standard theatrical techniques such as time compression and the conflating of supporting characters and locations, as well as larger deviations from recorded history.Essex was King James of Scotland's most avid supporter in England during the closing years of Elizabeth's reign.[65] The film presents James as the Cecils' candidate, and Essex as a threat to his succession. In fact William Cecil feared James, believing he bore a grudge against him for his role in the death of James' mother, Mary Queen of Scots.[65]The film redates some plays and poems to fit the story of the 1601 Essex Rebellion. Most significantly, it was Richard II that was performed on the eve of Essex's uprising, not Richard III.[63] Richard III is advertised as brand-new in 1601, written for the uprising. It was printed four years earlier in 1597.[63] The crowd watching Richard III swarms out of the theatre towards the court, but are gunned down on Cecil's orders. This event never occurred.[65] The poem Venus and Adonis is presented as a \"hot-off-the-press bestseller\" written and printed by de Vere especially for the ageing Queen in 1601 to encourage her to support Essex. It was published in 1593.The film also shows the first production of a play by the Earl of Oxford, credited to Shakespeare, as being Henry V – although in reality that play is a sequel, completing the stories of several characters introduced in Henry IV Part I and Henry IV Part II. Later, Macbeth is shown being staged after Julius Caesar and before Richard III and Hamlet, though those plays are estimated by scholars to have been performed around 1593 and 1600–1601 respectively[66] whereas Macbeth, often called \"the Scottish play\" because of its Scottish setting and plot, is generally believed to have been written to commemorate the ascent of the Scottish king James to the English throne. That did not happen until 1603.[67] However, because the film uses non-linear storytelling, this may not necessarily be an inaccuracy, so much as a montage of plays performed at the Globe and a tribute to the extensive list of works that comprise the Shakespeare canon, with order not being relevant.The history of Elizabethan drama is also altered to portray de Vere as an innovator. Jonson is amazed to learn that Romeo and Juliet, written in 1598, is apparently entirely in blank verse. The play actually appeared in print in 1597,[63] and Gorboduc precedes it as the first to employ the measure throughout the play by more than 35 years. By 1598 the form was standard in theatre, however it should be noted that Jonson's shock may have been in reference to the fact that De Vere in particular would be capable of writing a play in iambic pentameter, and not to the idea that one could be written.[63] The film also portrays A Midsummer Night's Dream as composed by De Vere in his childhood, approximately 1560. It was written several decades later, however the film does imply that De Vere wrote many plays and hid them from the public for decades before having Shakespeare perform them, so this does not necessarily contradict the timeline of the play being first performed on the London stage in public between 1590 and 1597 as is the traditional belief.[64][68]Early in the film Jonson is arrested for writing a \"seditious\" play. This is based on the fact that in 1597 he was arrested for sedition as co-writer of the play The Isle of Dogs with Thomas Nashe, possibly his earliest work.[69] The text of the play does not survive.[70] He was eventually released without charge. The \"seditious\" play in the film is referred to by the name \"Every Man\". Jonson did write plays called Every Man in his Humour and Every Man out of His Humour. The fragments of dialogue we hear are from the latter. Neither were ever deemed seditious.The death of Christopher Marlowe plays a small but significant role in the storyline. Marlowe is portrayed alive in 1598, while in fact he died in 1593.[63] The slashing of Marlowe's throat occurs in Southwark with Shakespeare as his suggested murderer, whereas Marlowe was killed by Ingram Frizer with a knife stab above the left eye, in Deptford.[63] Marlowe is shown mocking Dekker's Shoemaker's Holiday in 1598, although it wasn't written until the following year.[63] Marlowe appears in the film to die on the same day that Essex departs for Ireland, however this juxtaposition of scenes may simply be non-linear storytelling rather than a historical error, as the events aren't related in the film whatsoever. These events actually happened 6 years apart.[64] Another writer shown to be alive after his death is Thomas Nashe, who appears in a scene set after 1601. He is known to have died by that year, though the exact date is uncertain.[63]Other departures for dramatic effect include the portrayal of Elizabeth's funeral taking place on the frozen Thames. The actual ceremony took place on land. The Thames did not freeze over that year.[58] Oxford's wife, Anne Cecil, died in 1588, and he remarried in 1591. The film conflates his two wives into the character of Anne.[59] The film shows a theatre burning down in 1603. It appears to be The Rose, which was never recorded as having caught fire, whereas the real Globe Theatre burned down in 1613 when explosions during a performance accidentally set it alight.[63]De Vere is shown pruning a rose bush, which he describes as a rare Tudor rose. The Tudor rose was not a real biological plant, but a graphic device used by the Tudor family, however, De Vere may have been speaking metaphorically.[71]","music_by":"Harald Kloser Thomas Wander","edited_by":"Peter R. Adam","written_by":"John Orloff","budget":"$30 million[2]"}