{"based_on":"13 Hours  by Mitchell Zuckoff","13_hours:_the_secret_soldiers_of_benghazi":"Theatrical release poster","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Chuck Hogan","Plot":"In 2012, Benghazi, Libya is named one of the most dangerous places in the world, and countries have pulled their embassies out of the country in fear of an attack by militants. The United States, however, still has a diplomatic compound (not an official embassy) open in the city. Less than a mile away is a not-so-secret CIA outpost called \"The Annex\", which is protected by a team of Private Military Contractors Global Response Staff made up of former military special operations personnel. New to the detail is Jack \"Da\" Silva (Krasinski), who arrives in Benghazi and is picked up by Tyrone S. \"Rone\" Woods (Dale), a member of the team and a personal friend of Silva. Arriving at the Annex, Da Silva is introduced to the rest of the team and the chief (Costabile), who constantly gives the team strict reminders to never engage the citizens to avoid conflict with local militants in the area.The U.S. Ambassador to Libya J. Christopher Stevens (Letscher) arrives in Benghazi to maintain diplomatic connections amidst the political and social chaos. Despite warnings, Ambassador Stevens decides to stay at the Special Mission with limited protection from a pair of Diplomatic Security Agents and guards hired from the local February 17th Martyrs Brigade militia nicknamed \"17-Feb\". On the morning and the eleventh anniversary of the September 11 attacks, Stevens notices suspicious men taking pictures of the compound and notifies his security detail. Back at the Annex, the GRS team communicates with their families and Da Silva finds out that his wife is pregnant.That night, a group of Islamist militants from Ansar al-Sharia assault the compound. Unwilling to die for $28 a day, the local 17-Feb guards quickly surrender their posts, allowing the attackers easy access to the Special Mission compound. Scott Wickland (Giuntoli), a Diplomatic Security (DS) agent, takes Stevens and an officer, Sean Smith, into the safe room. Unable to breach the safe room, the attackers set the building on fire hoping to burn the men out. Wickland is able to escape but loses both Stevens and Smith. At the Annex, the GRS team desperately wants to go to the compound to help, but the chief refuses, fearing that the GRS team's departure would leave the Annex vulnerable. Refusing to listen, the GRS team dispatches to the compound and meet up with the DS agents. Silva and Woods go into the building to try to find Stevens and Smith, but are only able to find Smith who has died from smoke inhalation. The team retreat back to the Annex. The team from the compound also follow suit, but after Wickland goes the wrong direction, they are followed back to the Annex.Knowing an attack by the militants is imminent, the staff of the CIA Annex make several desperate calls for help. The only help they can get is from Glen \"Bub\" Doherty (Stephens), a Global Response Staff officer, who forms a team including two Delta operators that flies to Benghazi after several delays. Meanwhile, the GRS team fends off the militants as they try to breach the Annex perimeter late into the night. As the attackers regroup after failed assaults, the GRS team takes time to regroup as well, and the down time allows them to think about their families while considering the gravity of the situation. After repulsing the largest attack wave, the Annex receives word that help is en route, but before it can arrive, the militants launch a mortar attack that wounds one of the DS agents and kills both Woods and Doherty.With the GRS team compromised, and the Annex now vulnerable, the remaining GRS operators watch as a convoy of vehicles rolls toward the Annex. Fearing the worst, the operators prepare to make a final stand, until it is revealed that the convoy is an element of the Libya Shield Force militia escorting the GRS reinforcements. They also find out that Stevens was found behind the compound, but was pronounced dead at the hospital from smoke inhalation. As the remainder of the team wait at the airstrip with the bodies of Stevens, Smith, Woods and Doherty, they reflect on the events that happened and how they will most likely receive no recognition for defending the Annex as they were off the books. Closing titles reveal that all of the members of the Annex security team received medals in a private ceremony and have since retired from the GRS team and live with their families.","language":"English","Reception":"13 Hours grossed $52.9 million in North America and $15.6 million in other territories, for a worldwide total of $68.5 million, against a budget of $50 million,[4] making it Michael Bay's lowest-grossing directorial film to date.[29]The film was projected to earn around $20 million in its four-day Martin Luther King weekend debut. It faced competition from fellow newcomer Ride Along 2, as well as holdovers The Revenant and Star Wars: The Force Awakens.[30] Other films in a similar vein that had opened on the MLK weekend in previous years, American Sniper ($107.2 million in 2015) and Lone Survivor ($37.8 million in 2014), found success, although they had faced weaker competition, and were considered less politically divisive.[31] However, The Hollywood Reporter noted that the film could outperform expectations if it was buoyed by waves of patriotism.[31] The film made $900,000 from 1,995 theaters during its Thursday previews and $16.2 million in its opening weekend, finishing fourth at the box office.[32]13 Hours has received mixed reviews from critics.[33][34][35][36][37] On Rotten Tomatoes, the film has a rating of 51%, based on 189 reviews, with an average rating of 5.5/10. The site's consensus reads, \"13 Hours: The Secret Soldiers of Benghazi is a comparatively mature and restrained effort from Michael Bay, albeit one that can't quite boast the impact its fact-based story deserves.\"[38] On Metacritic the film has a score of 48 out of 100, based on 36 critics, indicating \"mixed or average reviews\".[39] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.[32]Soren Andersen, writing for The Seattle Times, gave the film 3 stars out of 4, criticizing the lack of distinctive characters but ultimately summarizing 13 Hours as \"engrossing\" and \"a ground-level depiction of heroism in the midst of the fog of war.\"[40] Richard Roeper similarly praised 13 Hours in his review for the Chicago Sun-Times. Although he lamented the script, Roeper found the film to be a \"solid action thriller with well-choreographed battle sequences and strong work from the ensemble cast.\"[41] Like Roeper's review, New York Daily News' Joe Dziemianowicz was less receptive towards the script, but applauded the film's focus on the real-life attack, summarizing: \"War is gritty here, not glamorous... [Michael Bay] delivers a gripping, harrowing, and heartfelt film.\"[42]In a mixed review, Inkoo Kang of TheWrap praised 13 Hours for its action scenes, but panned Bay's direction as \"myopic\". She writes: \"13 Hours is the rare Michael Bay movie that wasn't made with teenage boys in mind. But that doesn't make his latest any less callously juvenile.\"[43] Lindsey Bahr of the Associated Press was critical of the film's direction and cinematography, and found the screenplay to be confusing.[44] Similarly, The Economist described the film as \"a sleek, poorly scripted and largely meaningless film.\"[45]","box_office":"$69.4 million[4]","Historical accuracy":"The film's historical accuracy has been disputed. In the film's most controversial scene, the CIA chief in Benghazi (identified only as \"Bob\") tells the military contractors there, who seek permission to go defend the embassy, to \"stand down\", thus denying them permission. The real-life CIA chief stated that there was no stand-down order.[46] His statement was echoed by the bipartisan Senate Intelligence Committee's finding that there was no evidence of intentional delay or obstruction by the Chief of Base or any other party.\"[47] However, National Review commentator David French argues that the Senate committee cited above found plenty of evidence of the\"stand down\" order in the form of personal testimonies. It just chose to rule that the contrary testimony outweighed it.[48]Kris \"Tonto\" Paronto, a CIA contractor was involved in action during the event, has claimed \"We were told to 'stand down'. Those words were used verbatim — 100 percent. ... If the truth of it affects someone's political career? Well, I'm sorry. It happens.\"[49] Paronto has been accused of fabricating his account in order to make money, because he \"had a book to sell and a movie to help promote.\"[50] The CIA base chief portrayed in the film has directly contradicted Paronto's claims, stating, \"There never was a stand-down order... At no time did I ever second-guess that the team would depart.\"[51]Also disputed is the film's portrayal that air support was denied. A House Armed Services report found that air support was unavailable, or it would have arrived too late to make a difference.[45] French defended the film's references to air support, writing that even if resources could not have been flown in during the time available, this would itself be \"scandalous\", given Libya's known instability.[52]American conservative columnist Deroy Murdock wrote that the film confirmed his personal view that President Barack Obama and Secretary of State Hillary Clinton were lying when they initially blamed the YouTube video Innocence of Muslims for the attacks in the weeks after they occurred. The video led to no actual protests around the world, and Obama and others initially stated publicly that the Benghazi attacks emerged from such a protest. Murdock noted that 13 Hours instead portrays the attacks as having been initiated by \"well-armed jihadists who know exactly what they are doing.\"[53]Zack Beauchamp of Vox criticized the film overall, writing that its depiction of the alleged stand-down order and the availability of air support indirectly promoted \"pernicious conspiracy theories\" that President Obama and/or Secretary Clinton did not want the embassy to be defended.[47]","cinematography":"Dion Beebe","directed_by":"Michael Bay","production_companies":"3 Arts Entertainment","release_dates":"January 12, 2016 (2016-01-12) (Arlington premiere)|January 15, 2016 (2016-01-15) (United States)||||","Production":"On February 10, 2014, it was announced that Paramount Pictures was in talks with 3 Arts Entertainment to acquire the film rights to the book 13 Hours, written by Mitchell Zuckoff, with Erwin Stoff to produce.[17] Chuck Hogan was set to adapt the book, based on the true events of the Benghazi attack by militants on the American diplomatic compound in Benghazi, Libya, on the evening of September 11, 2012.[17] The film would focus on six members of a security team that fought to defend the Americans stationed there.[17] On October 29, 2014, Michael Bay was set to direct and produce the thriller.[18]On January 14, 2015, John Krasinski was cast in the film, to play one of the lead roles, a former US Navy SEAL.[7] On February 3, Pablo Schreiber also signed on to star in the film, playing Kris \"Tanto\" Paronto, one of the six-man security team.[11] On February 6, James Badge Dale was set to star, as the leader of the security team.[5] Max Martini was cast as another member of the security team on February 17, 2015.[9] David Denman signed on to star in the film on March 3, 2015, playing Boon, an elite sniper.[12] On March 5, 2015, THR reported that Dominic Fumusa also signed on, to play John \"Tig\" Tiegen, one of the members of the security team, who is also a former Marine with weapons expertise.[10] Freddie Stroma was added to the cast on March 17, 2015 to play the role of an undercover CIA officer in Libya.[15] On May 7, 2015, Toby Stephens was set to play Glen \"Bub\" Doherty, another of the security team members.[14]Principal photography began on April 27, 2015 in Malta and Morocco.[12][19] A large film set was built in March 2015 in Ta' Qali, Malta.[20]","produced_by":"Michael Bay|Erwin Stoff|","starring":"James Badge Dale|John Krasinski|Max Martini|Pablo Schreiber|Toby Stephens|","running_time":"144 minutes[3]","music_by":"Lorne Balfe[1]","edited_by":"Pietro Scalia[2]","Release":"On June 30, 2015, Paramount announced that the new title would be 13 Hours: The Secret Soldiers of Benghazi, and set the film to be released on January 15, 2016, on the MLK Holiday weekend.[21] The film premiered on January 12, 2016, at the AT&T Stadium in Arlington, Texas,[22] benefitting the Shadow Warriors Project, which supports private military security personnel and other groups.[22]Unusually for a major American film, the film was given only a limited release in Canada during its American wide opening weekend, playing in select theatres in Toronto, Montreal, Vancouver, Edmonton, Calgary and Ottawa. The film expanded to a wide release in Canadian theatres the following weekend, January 22–24.[23][24]Paramount specifically marketed the film to conservatives,[25][26] in a method similar to previous films Lone Survivor and American Sniper, both of which had beaten box office expectations.[27] This included screening the film for key Republican Party figures in order to generate endorsement quotations.[28]13 Hours: The Secret Soldiers of Benghazi was released on DVD and Blu-ray on June 7, 2016.","budget":"$50 million[4]"}