{"Cast":"Angus T. Jones was in the Two and a Half Men scene as Jake Harper, but the scene was cut short, and his cameo was not shown in the original run. Alan Arkin filmed scenes as Peter's long lost father, but they were not left in the final cut of the film.","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Alan R. Cohen Alan Freedland Adam Sztykiel Todd Phillips","story_by":"Alan R. Cohen Alan Freedland","Plot":"Peter Highman (Robert Downey, Jr.) is on a plane, flying home to be with his wife Sarah (Michelle Monaghan), who is due to give birth. Sitting behind Peter is a man named Ethan Tremblay (Zach Galifianakis), who is going to LA to be an actor and is planning to scatter his recently deceased father's ashes at the Grand Canyon. When Ethan misuses the words \"terrorist\" and \"bomb\" while talking to Peter, they are both escorted off the plane. This is only the first of a series of misadventures caused by the drastically dysfunctional Ethan. Peter, now on the No Fly List and missing his wallet, agrees to drive with Ethan to Los Angeles.Ethan stops to buy marijuana, and Peter discovers that he is nearly out of money. Since Peter has no I.D., he gets his wife to wire the money to Ethan, but discovers Ethan had the money wired to his stage name instead of his legal name. When the Western Union employee (Danny McBride) refuses to accept Ethan's \"Stage name I.D.\" it leads to a violent altercation.After a night at a rest stop, Peter decides to drive off and leave Ethan there, but realizes that he still has Ethan's father's ashes, having forgotten to unload them with the rest of Ethan's stuff when he left. This causes him to wrestle with his conscience, and he decides to return. Peter gets Ethan to drive so Peter can get some rest, but Ethan falls asleep at the wheel and crashes the car. After Peter and Ethan are picked up by Peter's friend Darryl (Jamie Foxx), Peter again decides to part company with Ethan. Darryl initially persuades him otherwise, but then throws Ethan out after mistakenly drinking Ethan's father's ashes.When Darryl lets them use his Range Rover to make the rest of the trip, Ethan mistakenly drives to the Mexico–United States border. Despite assuring Peter that he'll handle the situation, Ethan flees, and Peter is arrested for possession of marijuana. The Mexican Federal Police lock Peter up, but Ethan steals a truck and breaks him out, causing several car crashes in the process.When they stop at the Grand Canyon, Peter confesses that he tried to leave Ethan at the rest area. Ethan makes a confession of his own: he has Peter's wallet. Peter and Ethan leave for California. When Ethan finds a gun in the truck, he accidentally shoots Peter. Arriving at the hospital where Sarah is in labor, Peter passes out from loss of blood.Sarah delivers the baby safely, and Peter expresses his discomfort at his new daughter being named Rosie Highman. Ethan leaves while telling Peter to call him. At the end, Ethan guest stars on an episode of his favorite television program, Two and a Half Men with Peter and Sarah watching it in bed with their daughter.","due_date":"Theatrical release poster","language":"English","box_office":"$212 million","cinematography":"Lawrence Sher","production_company":"Legendary Pictures Green Hat Films","Marketing":"The first trailer was released July 14, 2010. It was seen with Inception, Dinner for Schmucks and The Other Guys. The international trailer was released on September 2, 2010, and the full length trailer was released online on September 16, 2010. It was shown before The Town, and Life as We Know It.Previews for the film feature the songs \"New Moon Rising\" by Wolfmother and the original version of \"Check Yo Self\" by Ice Cube.In the film, Ethan is a huge fan of the sitcom Two and a Half Men. He also mentions that he started a website called itsrainingtwoandahalfmen.com. As a joke, a website was actually launched with the same name.[3]","directed_by":"Todd Phillips","Soundtrack":"Due Date (Original Motion Picture Soundtrack) was released on November 2, 2010 by WaterTower Music.The following songs are not included in the soundtrack, but they appear in some parts of the film:","release_dates":"October 31, 2010 (2010-10-31) (Night Visions)|November 5, 2010 (2010-11-05) (United States)||||","produced_by":"Todd Phillips Daniel Goldberg Susan Downey","starring":"Robert Downey Jr. Zach Galifianakis Michelle Monaghan Juliette Lewis Jamie Foxx","running_time":"95 minutes","music_by":"Christophe Beck","edited_by":"Debra Neil-Fisher","Release":"Despite mixed critical reviews, Due Date was commercially successful, it earned $12,216,515 at the North American domestic box office on its release day and $43,478,266 on its first week, placing behind Megamind but was number one in the UK for two consecutive weekends. On Monday, November 8, 2010, it went up to #1 overtaking Megamind. On Friday, November 12, it went down to #3 behind Unstoppable and Megamind. On Monday, November 15, it went up to #2 behind Unstoppable. On Wednesday, November 24, it went down to #8 behind Harry Potter and the Deathly Hallows – Part 1, Tangled, Burlesque, Megamind, Love and Other Drugs, Unstoppable and Faster. It closed in theaters on January 27, 2011. As of April 2011 Due Date grossed over $100 million in the U.S. and Canada as well as $200 million worldwide, against a production budget of $65 million.[4]Due Date received average reviews. Rotten Tomatoes gives the film a score of 40% \"rotten\", or a 5.2/10 rating, based on 185 reviews. The site's consensus is: \"Shamelessly derivative and only sporadically funny, Due Date doesn't live up to the possibilities suggested by its talented director and marvelously mismatched stars.\"[5] Metacritic gives the film a \"mixed or average\" score of 51, based on reviews from 39 critics.[6]Roger Ebert of the Chicago Sun-Times gave the film two and a half stars out of a possible four, noting \"The movie probably contains enough laughs to satisfy the weekend audience. Where it falls short is in the characters and relationships.\" Ebert compared Due Date to the 1987 film Planes, Trains and Automobiles, but bemoaned that Due Date could have learned and offered more.[7]Due Date was released on DVD and Blu-ray on February 22, 2011.[8]","budget":"$65 million[1]"}