{"Cast":"[1][2]","country":"Hong Kong","distributed_by":"San Bo Mega Star Media Asia","Plot":"500 years ago, during their journey to the west to fetch the Buddhist scriptures, Monkey got annoyed with the constant nagging of his master, Longevity Monk, and decided to betray him. He was intercepted and subdued by Guanyin, who decided to give him a second chance after Longevity Monk pleaded for leniency and sacrificed himself.Monkey is reincarnated in the present as Joker, chief of a group of outlaws. Joker and his gang are attacked by two demons, Spider Woman and Bak Jing-jing, who threatened and force them to do their bidding. Joker's second-in-command (a reincarnation of Pigsy) secretly overheard the demons' plan to capture Longevity Monk and feast on his flesh to gain immortality. Joker subsequently fell in love with Bak Jing-jing. Grandpa Buddha shows up in disguise as a bunch of grapes, informs Joker about the danger he is in, and gave him a magic mirror which can reveal a being's true form.The group are attacked by Bull King, who is also after Longevity Monk. Joker and Pigsy flee with Bak Jing-jing and Spider Woman to Waterfall Cave, where the two demons starts fighting over Joker. Bak Jing-jing and Joker eventually flee from the cave while Spider Woman is impregnated with Pigsy's child by accident. As Bak Jing-jing had been poisoned by Spider Woman, Joker goes back to the cave to ask for the antidote, but is imprisoned by Spider Woman. In the meantime, outside the cave, Bak Jing-jing is captured by Bull King, who cures her of the poison.Inside the cave, Joker finds Pandora's Box, which can open up a time portal when moonlight shines on it and when \"Prajñāpāramitā\" is chanted. He also overhears Guanyin's voice, telling him that he was actually Monkey in his past life and is destined to continue his quest to escort his master on the journey to the west. His true destiny will be revealed after he gets three marks on the sole of his foot. Meanwhile, Bull King and Bak Jing-jing enters the cave and fight with Spider Woman. Bak Jing-jing commits suicide after mistakenly believing that Joker has betrayed her love and fathered a child with Spider Woman.Joker finds Bak Jing-jing and tries to save her by travelling back in time with the aid of Pandora's Box, but each time he arrives a few seconds too late to stop her from committing suicide. He finally manages to make it on time to prevent Bak Jing-jing from slitting her throat, but she sacrifices herself to save him from Bull King. Joker travels back in time again, but ends up going back in time by 500 years. Outside the cave, he encounters a fairy, Zixia, who confiscates Pandora's Box and sears three dots on the sole of his foot to mark him as her servant. This fulfils his true destiny as Monkey. He looks in the magic mirror given to him by Grandpa Buddha earlier and is shocked to see a reflection of himself as Monkey.After travelling back in time, Joker learns more about his past life and reunites with his master, Longevity Monk, and his fellows, Pigsy and Sandy. However, he does not want to accept his fate as Monkey because he just wants to get back Pandora's Box and return to 500 years later to save Bak Jing-jing. Zixia falls in love with him after he pulls out her sword from its scabbard because she made a promise to marry the person who can unsheathe her sword.Zixia and Longevity Monk are captured by Bull King, who wants to take Zixia as his concubine and feast on Longevity Monk's flesh to become immortal. Pigsy and Sandy try to rescue their master but he refuses to leave unless Joker promises to fulfil his destiny. Joker goes off in search of Zixia, rescues her, and they flee from Bull King. In the ensuing fight between Joker and his companions against Bull King, Joker falls off a cliff and finds himself back in Waterfall Cave, where he meets Grandpa Buddha and Bak Jing-jing. Bak Jing-jing agrees to marry Joker initially, but she leaves later and tells him to save Zixia because she knows the one he truly loves is Zixia. Shortly after, Spider Woman comes to Waterfall Cave and kills everyone, including Joker. At the point of death, Joker realises the one he truly loves is Zixia.Joker, as a ghost, hears Guanyin's voice inside the cave again, reminding him about his destiny. He decides to accept his fate and puts on the golden headband, therefore transforming into Monkey. He returns to the world and rushes to Bull King's city to save his master and stop Bull King's wedding ceremony with Zixia. As he is now Monkey, he must relinquish all his human desires, including love, so he tells Zixia he is not Joker and pretends to scorn her.Monkey and Bull King engage in battle. When Bull King realises he is losing, he uses Princess Iron Fan's magic fan to churn up strong winds that will blow the entire city towards the sun and kill everyone in the process. Monkey succeeds in stopping Bull King and saves everyone, but Zixia sacrifices herself to save him. As she dies, Monkey reveals his love for her and, as a result, his headband tightens and causes him to feel extreme agony. In anger, he beats up Bull King before escaping together with his master, Pigsy and Sandy by using the Pandora's Box.Monkey wakes up later and finds himself in a cave, but with his master and fellows this time. Outside the cave, in a busy city, Monkey sees the incarnations of Joker and Zixia in a standoff on top of a wall. He uses his powers to possess Joker's body and gave Zixia a long and passionate kiss before leaving Joker's body. Joker recovered and is surprised to see himself locked in an embrace with Zixia, but accepts and continues the romance with her. They notice Monkey walking away in the crowd below and laughed at his appearance. Monkey does not turn back until outside the gates where he gave a final glance at the embracing couple and continues on the journey to the west with his companions.","language":"Cantonese (original) Mandarin (dub)","a_chinese_odyssey":"Hong Kong Blu-ray disc box set","box_office":"Part 1: HK$25,093,380 Part 2: HK$20,872,117","cinematography":"Poon Hang-sang Ray Wong William Yim","production_company":"Xi'an Film Studio Choi Sing Film Company","directed_by":"Jeffrey Lau","release_dates":"21 January 1995 (1995-01-21) (Part 1)|4 February 1995 (1995-02-04) (Part 2)||||","Box office":"The first part grossed HK$25,093,380 and the second HK$20,872,117 in Hong Kong.[3][4]","produced_by":"Yeung Kwok-fai","starring":"Stephen Chow Athena Chu Ng Man-tat Yammie Lam Karen Mok Law Kar-ying Jeffrey Lau Lu Shuming Ada Choi","running_time":"Part 1: 87 minutes Part 2: 95 minutes","music_by":"Zhao Jiping Lowell Lo","edited_by":"Hai Kit-wai","written_by":"Wu Cheng'en"}