{"Cast":"This film marks the first screen appearance of Eric Bogosian.[2] He plays a technician at a TV station who is forced at gunpoint to run a videotape on the network feed. The movie also features a rare acting appearance by Academy Award-winning film director Kathryn Bigelow.[1]","country":"United States","distributed_by":"First Run Features","Plot":"The plot concerns two feminist groups in New York City, each voicing their concerns to the public by pirate radio. One group, led by an outspoken white lesbian, Isabel (Adele Bertei), operates \"Radio Ragazza\". The other group, led by a soft-spoken African-American, Honey (Honey), operates \"Phoenix Radio.\" The local community is stimulated into action after a world-traveling political activist, Adelaide Norris (Jean Satterfield), is arrested upon arriving at a New York City airport, and suspiciously dies while in police custody. Also, there is a Women's Army led by Hilary Hurst (Hilary Hurst) and advised by Zella (Flo Kennedy) that initially both Honey and Isabel refuse to join. This group, along with Norris and the radio stations, are under investigation by a callous FBI agent (Ron Vawter). Their progress is tracked by three editors (Becky Johnston, Pat Murphy, Kathryn Bigelow) for a socialist newspaper run by screenwriter Ed Bowes, who go so far they get fired.The story involves several different women coming from different perspectives and attempts to show several examples of how sexism plays out, and how it can be dealt with through direct action. A famous scene is one during which two men are attacking a woman on the street and dozens of women on bicycles with whistles come to chase the men away and comfort the woman. The women in the movie have different ideas about what can and should be done, but all know that it is up to them, because the government will not take care of it. The movie shows women organizing in meetings, doing radio shows, creating art, wheatpasting, putting a condom on a penis, wrapping raw chicken at a processing plant, etc. The film portrays a world rife with violence against women, high female unemployment, and government oppression. The women in the film start to come together to make a bigger impact, by means that some would call terrorism.Ultimately, after both radio stations are suspiciously burned down, Honey and Isabel team up and broadcast \"Phoenix Ragazza Radio\" from stolen moving vans. They also join the Women's Army, which sends a group of terrorists to interrupt a broadcast of the President of the United States proposing that women be paid to do housework, followed by bombing the antenna on top of the World Trade Center to prevent additional such destructive messages from the mainstream.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 67% of nine surveyed critics gave the film a positive review; the average rating is 6.8/10.[3] Variety wrote that it has \"all the advantages and the disadvantages of a home movie\".[4] Janet Maslin of The New York Times wrote, \"Only those who already share Miss Borden's ideas are apt to find her film persuasive.\"[1] Marjorie Baumgarten of The Austin Chronicle wrote, \"Beautifully made, courageously edited, and swift-moving, this challenging, provocative film is a work that is both humanist and revolutionary.\"[5] Frances Dickinson of Time Out London wrote that Borden \"[handles] her story with audacity and make[s] even the driest argument crackle with humour, while the more poignant moments burn with a fierce white heat.\"[6] TV Guide rated it 2/4 stars and wrote, \"This feminist film wins laurels for close attention to detail in a radical filmmaking effort.\"[7] Nathan Rabin of The A.V. Club called it \"interesting as a historical curio but nearly unwatchable as entertainment\".[8] Greg Baise of the Metro Times called it \"an early '80s landmark of indie and queer cinema\".[9]","cinematography":"Ed Bowes|Al Santana Michael Oblowitz|Lizzie Borden|","directed_by":"Lizzie Borden","Awards":"In 1983, the film won the Reader Jury prize at the Berlin International Film Festival and the Grand Prix at the Créteil International Women's Film Festival.","release_dates":"February 20, 1983 (1983-02-20)|||||","produced_by":"Lizzie Borden","starring":"Honey|Adele Bertei|Kathryn Bigelow|","running_time":"90 minutes","Influence":"The film is discussed in Christina Lane's book Feminist Hollywood: From \"Born in Flames\" to \"Point Break\".[10]The film features the Red Krayola song \"Born In Flames\", released as a single in 1981.[citation needed]In 2013, a dossier on the film was published as a special issue of Women & Performance: A Journal of Feminist Theory.[11] With an introduction from Craig Willse and Dean Spade, the dossier includes a number of essays that address race, queerness, intersectionality, radicalism, violence, and feminism in the film.","music_by":"Ibis","edited_by":"Lizzie Borden","written_by":"Lizzie Borden"}