{"country":"United States, Canada","distributed_by":"Magnolia Pictures|StudioCanal|2929 Productions|","Background":"As a passenger on JetBlue Airways Flight 292 in 2005, flying for hours in a figure 8 over southern California to prepare for a risky landing, Zach Dean contemplated his mortality and resolved to write a screenplay about family.[4] The rights to the script, originally titled Kin, were optioned by Mutual Films and in 2010 it was reported that Bana, Wilde, and Hunnam were in casting talks.[5] Shooting began in Canada in 2011.","Plot":"Addison (Eric Bana) and Liza (Olivia Wilde) are siblings on the run in Michigan from a casino heist gone wrong. They decide to split up when their driver is fatally injured in a crash and Addison murders a state trooper responding to the crash scene. Their goal is to cross the Canadian border during a blizzard.Meanwhile, former boxer Jay (Charlie Hunnam) is released from prison. He calls his parents June (Sissy Spacek) and retired sheriff Chet (Kris Kristofferson) to say he'll be home for Thanksgiving. He confronts his former coach in Detroit, demanding money owed him. The two get into a fight and Jay, thinking he has killed him, flees, fearing he will be sent back to jail.Hannah (Kate Mara), the sheriff's deputy, visits Jay's parents, who invite her to join them for Thanksgiving dinner. At the police station, she is treated poorly by her father, sheriff Becker (Treat Williams), who does not want to include her in the hunt for the unknown criminals. Hannah, who has been accepted to be trained to become an FBI agent, excuses her father's behavior because of the loss of his wife, even though it was years ago.Jay finds a shivering Liza in the road and offers her a ride to the nearest gas station. Meanwhile, wandering in the snow, Addison encounters an elderly man tending to his damaged snowmobile. He attacks the man, who slices off Addison's little finger before being stabbed to death by his own knife. Addison drives off on the snowmobile, which he later abandons after it breaks down, but not before cauterizing his wound on the still hot engine.Jay and Liza stop at a bar during the blizzard. She sneaks back to his truck, finds Jay's address and leaves Addison a message to meet up there. A romantic relationship develops between Jay and Liza, who have sex in a motel.Addison invades a cabin in the woods and kills the abusive father of the family. After dumping the man's body, he tends to the distraught wife and her children. Hannah is called by a woman concerned for her relative (the mother living in the cabin), not having heard from her, and promises to investigate.Realizing that she has feelings for Jay, Liza calls Addison to say she couldn't proceed with the plan and that she'll find another ride. Jay confesses his feelings for her. Liza explains how her brother was her protector from their abusive father, who was killed when they were young.Hannah and two officers reach the cabin. Hannah notices a man's corpse and tries to warn the officer at the door, but Addison shoots him with a shotgun. Addison flees on a snowmobile with Hannah and the other officer giving chase, and the officer is killed.Addison arrives at Jay's house and holds his parents captive. When Liza and Jay arrive for Thanksgiving dinner, Addison pretends at first not to know who Liza is. They eat dinner together. Addison sees Liza act protectively of Jay and his family. Hannah receives a call from a Detroit detective about Jay's coach, who is recovering from a concussion. She goes to the house and is also taken captive by Addison.Becker finds Addison's snowmobile at the house, draws a weapon and goes inside. He fires at Addison, but it turns out to be his daughter, Hannah, surreptitiously dressed by Addison in his own jacket. Becker is then shot by Addison. A struggle between Jay and Addison ensues outside. Jay overpowers Addison but releases him when Liza begs him to, reminding Jay that Addison is her brother. Addison points another gun at Jay and challenges Jay to proclaim his love for Liza, which Jay does. Before Addison can decide what to do next, Liza fatally shoots him. Other police arrive to discover Hannah's life has been saved by a bulletproof vest. It is unknown what happens afterwards.","language":"English","Critical reception":"Deadfall received negative reviews and has a rating of 33% on Rotten Tomatoes based on 78 reviews with an average rating of 4.9 out of 10.[6] The film also has a score of 52 out of 100 on Metacritic based on 24 reviews.[7]","box_office":"$1.9 million[2]","cinematography":"Shane Hurlbut","production_company":"Mutual Film Company","directed_by":"Stefan Ruzowitzky","release_dates":"April 22, 2012 (2012-04-22) (Tribeca Film Festival)|December 7, 2012 (2012-12-07) (United States)||||","produced_by":"Gary Levinsohn|Shelly Clippard|Ben Cosgrove|Todd Wagner|","starring":"Eric Bana|Olivia Wilde|Charlie Hunnam|Kate Mara|Treat Williams|Kris Kristofferson|Sissy Spacek|","running_time":"94 minutes[1]","deadfall":"Theatrical release poster","music_by":"Marco Beltrami","edited_by":"Arthur Tarnowski|Dan Zimmerman|","written_by":"Zach Dean"}