{"based_on":"Characters appearing in magazines published   by DC Comics Batman characters  by Bob Kane","country":"United States","distributed_by":"Warner Bros.","Canceled sequel and later plans":"During the filming of Batman & Robin, Warner Bros. was impressed with the dailies, prompting them to immediately hire Joel Schumacher to return as director for a sequel. However, writer Akiva Goldsman turned down an offer to write the script.[8] In late 1996, Warner Bros. and Schumacher hired Mark Protosevich to write the script for a fifth Batman film. A projected mid-1999 release date was announced.[44] Titled Batman Unchained, Protosevich's script had the Scarecrow as the main villain. Through the use of his fear toxin, he resurrects the Joker as a hallucination in Batman's mind. Harley Quinn appeared as a supporting character, written as the Joker's daughter.[45] George Clooney, Chris O'Donnell, and Alicia Silverstone were set to reprise the roles of Batman, Robin, and Batgirl. However, following the poor critical reception of Batman & Robin, Clooney vowed never to reprise his role.[46]Warner Bros. decided to consider a live-action Batman Beyond film and an adaptation of Frank Miller's Batman: Year One. Warner would then produce whichever idea suited them the most.[47] Schumacher felt he \"owe[d] the Batman culture a real Batman movie. I would go back to the basics and make a dark portrayal of the Dark Knight.\"[48] He approached Warner Bros. about doing Batman: Year One in mid-1998,[48] but they were more interested in hiring Darren Aronofsky. Aronofsky and Frank Miller developed a Year One script with Aronofsky to direct, but it was ultimately canceled. Christopher Nolan was eventually hired to helm the next Batman film in January 2003, resulting in the rebooted Batman Begins (2005).[47]In \"Legends of the Dark Knight\", an episode of The New Batman Adventures, three teenagers discuss their ideas about what Batman is really like. They briefly meet a youth called Joel whose idea of Batman reflects characterizations and costumes portrayed within Schumacher's Batman and Robin. The teens treat Joel's ideas with utter disdain.[49] In Watchmen, director Zack Snyder and comic book artist Dave Gibbons chose to parody the molded muscle and nipple Batsuit design from Batman & Robin for the Ozymandias costume.[50][51] The film is referenced in the Batman: The Brave and the Bold episode \"Legends of the Dark Mite!\", when Bat-Mite briefly uses his powers to transform Batman's costume into the same suit shown in the Joel Schumacher Batman films, before declaring it \"Too icky\".[52] The Batman from Batman & Robin later appeared as part of an army of Batmen gathered from across the Multiverse in \"Night of the Batmen!\", complete with the blue rubber Batsuit. Additionally, there were worries within Warner Bros. surrounding the negative critical reaction to Batman & Robin and how that may come to harm the success of the subsequent direct-to-video animated film Batman & Mr. Freeze: SubZero, which was originally planned for release at around the same time as Batman & Robin but was subsequently delayed.[53] However, SubZero received a far stronger positive response from critics than Batman & Robin, with Mr. Freeze's role within it being seen in a much more positive light, returning his popularity as a Batman villain to a level comparable to that reached by him within the two Emmy-winning episodes the character featured in of Batman: The Animated Series.[53]","Plot":"Batman and Robin fail to stop Mr. Freeze from stealing a cache of diamonds. They learn that Freeze was once a scientist named Victor Fries, who became dependent on a diamond-powered subzero suit following an accident in a cryogenics lab while working to save his wife, Nora, from a terminal illness called MacGregor's Syndrome.Meanwhile, botanist Dr. Pamela Isley is experimenting with the strength serum \"Venom\" to create mutant plants capable of fighting back against mankind. She is angry that her senior colleague Dr. Jason Woodrue used her Venom to transform a diminutive prisoner into the \"super soldier\" Bane. She refuses to partner with Woodrue so he tries to kill her with animal-plant toxins and chemicals, causing her to transform into the beautiful, seductive and deadly Poison Ivy. She kills Woodrue with a venomous kiss and vows to establish botanical supremacy over the world.Alfred Pennyworth's niece Barbara Wilson makes a surprise visit from England and is invited to stay at Wayne Manor. Later, Barbara finds the Batcave and creates her own crime-fighting persona with the help of a computer simulation of Alfred. The real Alfred is suffering from MacGregor's Syndrome. He is, however, in stage 1, for which Mr. Freeze has developed a cure despite being unable to cure his wife's condition because it is too advanced.Ivy arrives in Gotham City with Bane as her henchman. She interrupts a Wayne Enterprises press conference at the Gotham Observatory where a giant telescope is being unveiled. Ivy demands Bruce Wayne use his fortune to safeguard the natural environment at the expense of millions of human lives, and Bruce refuses.Ivy appears at the Gotham Botanical Gardens fundraiser in a pink gorilla suit, performs a striptease revealing her Poison Ivy costume and began seducing everyone present with her pheromone dust, including the Dynamic Duo, who are there to protect a diamond from Mr. Freeze. When Freeze crashes the event Ivy is instantly captivated by his \"ruthless charm\". Freeze is captured by Batman and detained at the Arkham Asylum but is released by Ivy and Bane.After failing to seduce the Dynamic Duo to her kiss,Ivy turns off Nora Fries' life support and makes Freeze believe Batman did it, persuading him that they should destroy Batman along with the society that created him. They plan to turn the observatory's new telescope into a giant freeze ray to kill all humanity to allow Ivy's mutant plants to take over the world.Meanwhile, Robin is under Ivy's seductive spell and is rebelling against Batman. Robin goes to meet Ivy at her garden hideout, where her venomous kiss fails to kill Robin because Batman had prevailed on him to coat his lips with rubber. Ivy tries to drown Robin in her lily pond and entangles Batman in her crushing vines, but they are able to free themselves when Batgirl arrives and traps Ivy in her own floral throne.Batgirl reveals herself as Barbara. The three crime-fighters arrive at the Observatory to stop Freeze who has already frozen all of Gotham. Bane attacks Robin and Batgirl, but they incapacitate him and restore him to his original human state. Robin and Batgirl save Gotham by using the observatory's satellites to reflect sunlight from outer space to thaw the city.Batman shows Freeze video proof that Ivy pulled the plug on Nora and reveals that Batman was the one who saved her. He vows that Freeze will be allowed to continue his research at Arkham Asylum to cure Nora. Batman asks Freeze for his cure for the first stage of MacGregor's Syndrome for Alfred and Freeze atones for his misdeeds by giving him two vials of the medicine.At Arkham, due to Freeze's own cell being in the process of modification, he becomes Ivy's temporary cellmate and vows to exact revenge on her until work on Freeze's cell is finished. Back at Wayne Manor, Alfred is cured and Bruce invites Barbara to live with them, joining Batman and Robin to fight crime as Batgirl.","language":"English","Reception":"Batman & Robin was released on June 20, 1997 in North America, earning $42,872,605 in its opening weekend,[1] making it the third-highest opening weekend of 1997.[30] The film declined by 63% in its second week.[31] Batman & Robin faced early competition with Face/Off and Hercules.[2] Schumacher blamed it on yellow journalism started by Harry Knowles of Ain't It Cool News and other film websites such as Dark Horizons.[32] The film went on to gross $107.3 million in North America and $130.9 million internationally, coming to a worldwide total of $238.2 million.[1] Warner Bros. acknowledged Batman & Robin's shortcomings in the domestic market but pointed out success overseas.[2]\"If there's anybody watching this, that... let's say, loved Batman Forever, and went into Batman & Robin with great anticipation, if I've disappointed them in any way, then I really want to apologize. Because it wasn't my intention. My intention was just to entertain them.\"The film received generally unfavorable reviews on Rotten Tomatoes and Metacritic, two of the most popular review aggregator websites. While some critics praised the production and costume designs of the film, criticism was mainly directed towards the film's script, campiness and acting. The review aggregator website Rotten Tomatoes reported an 11% approval rating with an average rating of 3.7/10 based on 85 reviews. The website's consensus reads: \"Joel Schumacher's tongue-in-cheek attitude hits an unbearable limit in Batman & Robin, resulting in a frantic and mindless movie that's too jokey to care much for.\"[33] On Metacritic, the film achieved an average score of 28 out of 100 based on 21 reviews, signifying \"generally unfavorable reviews\".[34]Schumacher and producer Peter MacGregor-Scott blamed the negative reception of Batman & Robin on Warner Bros.' decision to fast track production. \"There was a lot of pressure from Warner Bros. to make Batman & Robin more family-friendly,\" Schumacher explained. \"We decided to do a less depressing Batman movie and less torture and more heroic. I know I have been criticized a lot for this, but I didn't see the harm in that approach at all.\"[7] Roger Ebert of the Chicago Sun-Times criticized the toyetic approach and Mr. Freeze's one-liner jokes in his two-star review of the film.[35] Kenneth Turan of the Los Angeles Times believed the film \"killed\" the Batman film series, and felt Batman & Robin depended too much on visual effects.[36] Desson Thomson of The Washington Post largely disapproved of Schumacher's direction and Akiva Goldsman's script.[37] Mick LaSalle, writing in the San Francisco Chronicle, said, \"George Clooney is the big zero of the film, and should go down in history as the George Lazenby of the series.\"[38] However, Janet Maslin of The New York Times gave a positive review. She praised Uma Thurman's acting, as well as the production and costume design.[39]Batman & Robin was nominated for the Saturn Award for Best Fantasy Film, as well as Best Make-up and Best Costume, but won none. Alicia Silverstone won the Razzie Award for Worst Supporting Actress. Other nominations at the Razzie Awards included Schumacher (Worst Director), George Clooney and Chris O'Donnell (Worst Screen Couple), Akiva Goldsman (Worst Screenplay), both Chris O'Donnell and Arnold Schwarzenegger (Worst Supporting Actor), Uma Thurman (Worst Supporting Actress), as well as Billy Corgan (Worst Song for \"The End Is the Beginning Is the End\"). Batman & Robin also received nominations for Worst Picture, Worst Remake or Sequel and Worst Reckless Disregard for Human Life and Public Property. Ultimately, out of 11 nominations, Batman & Robin garnered only one Razzie Award.Many observers thought Schumacher, a gay man, added possible homoerotic innuendo in the storyline.[7] James Berardinelli questioned the \"random amount [sic] of rubber nipples and camera angle close-ups of the Dynamic Duo's butts and Bat-crotches.\"[40] Similar to Batman Forever, this primarily included the decision to add nipples and enlarged codpieces to Batman and Robin suits. Schumacher stated, \"I had no idea that putting nipples on the Batsuit and Robin suit were going to spark international headlines. The bodies of the suits come from ancient Greek statues, which display perfect bodies. They are anatomically correct.\"[7] Chris O'Donnell, who portrayed Robin, felt \"it wasn't so much the nipples that bothered me. It was the codpiece. The press obviously played it up and made it a big deal, especially with Joel directing. I didn't think twice about the controversy, but going back and looking and seeing some of the pictures, it was very unusual.\"[7] George Clooney joked, \"Joel Schumacher told me we never made another Batman film because Batman was gay\".[41] Clooney himself has spoken critically of the film, saying, \"I think we might have killed the franchise\",[42] and called it \"a waste of money\".[43]","batman_&_robin":"Theatrical release poster","box_office":"$238.2 million[1]","cinematography":"Stephen Goldblatt","production_company":"PolyGram Pictures","Marketing":"The Batman & Robin film trailer debuted on the February 19, 1997 episode of Entertainment Tonight.[28] Warner Bros. spent $15 million to market and promote the film, in addition to its $125 million production budget.[2] The studio also brought in toy companies to be involved with pre-production, including the design of concept art and character illustrations. Director Joel Schumacher criticized Warner Bros.'s strategy for Batman & Robin as being overtly toyetic.Various Six Flags parks (Six Flags Great Adventure, Six Flags Over Texas, and Six Flags St. Louis) all debuted coasters themed to the film (all of which have since been closed or re-themed to Batman: The Animated Series).[7] Taco Bell featured a promotional campaign including collectible cups and a contest with a replica of the film's Batmobile as a grand prize. A junior novelization of the screenplay, written by Alan Grant, was published along with the release of the film in 1997.[29]","directed_by":"Joel Schumacher","release_dates":"June 20, 1997 (1997-06-20)|||||","Production":"With the box office success of Batman Forever in June 1995, Warner Bros. immediately commissioned a sequel.[6] They hired director Joel Schumacher and writer Akiva Goldsman to reprise their duties the following August,[7] and decided it was best to fast track production for a June 1997 target release date, which is a break from the usual 3-year gap between films.[6] Schumacher wanted to homage both the broad camp style of the 1960s television series and the work of Dick Sprang.[8] The storyline of Batman & Robin was conceived by Schumacher and Goldsman during pre-production on A Time to Kill.[9] Portions of Mr. Freeze's back-story were based on the Batman: The Animated Series episode \"Heart of Ice\", written by Paul Dini.[10]While Chris O'Donnell reprises the role of Robin, Val Kilmer decided not to reprise the role of Batman from Batman Forever. Schumacher admitted he had difficulty working with Kilmer on Forever. \"He sort of quit,\" Schumacher said, \"and we sort of fired him.\"[11] Kilmer said he was not aware of the fast track production and was already committed to The Saint (1997).[7] Schumacher originally had a strong interest in casting William Baldwin in Kilmer's place, but George Clooney was cast instead.[12] Schumacher believed Clooney could provide a lighter interpretation of the character than Michael Keaton (in Batman and Batman Returns) and Kilmer.[7][13] The shooting schedule allowed Clooney to simultaneously work on ER without any scheduling conflicts.[8]Patrick Stewart was considered for the role of Mr. Freeze,[14] before the script was rewritten to accommodate Arnold Schwarzenegger's casting.[15] Schumacher decided that Mr. Freeze must be \"big and strong like he was chiseled out of a glacier\".[7] Schwarzenegger was paid a $25 million salary for the role.[16][17] His prosthetic makeup and wardrobe took six hours to apply each day.[18] Thurman took the role of Poison Ivy because she liked the femme fatale characterization of the character.[7] Alicia Silverstone was the only choice for the role of Batgirl.[14] Leonardo DiCaprio stated that he had a meeting with Schumacher about appearing in the film, but was ultimately not cast.[19]The original start date was August 1996,[11] but principal photography did not begin until September 12, 1996.[20] Batman & Robin finished filming in late January 1997,[21] two weeks ahead of the shooting schedule.[8] The film was mostly shot at Warner Bros. Studios in Burbank, California.[7]When comparing work on Batman Forever, Chris O'Donnell, who portrayed Robin, explained, \"It just felt like everything got a little soft the second time. On Batman Forever, I felt like I was making a movie. The second time, I felt like I was making a kid's toy commercial.\"[7] He also complained of the Robin costume, saying it was more involved and uncomfortable than the one he wore in Batman Forever, with a glued-on mask which caused sweat to pool on his face.[22] According to John Glover, who played Dr. Jason Woodrue, \"Joel [Schumacher] would sit on a crane with a megaphone and yell before each take, 'Remember, everyone, this is a cartoon'. It was hard to act because that kind of set the tone for the film.\"[7] Production designer Barbara Ling admitted her influences for the Gotham City design came from \"neon-ridden Tokyo and the Machine Age. Gotham is like a World's Fair on ecstasy.\"[23] Rhythm and Hues and Pacific Data Images created the visual effects sequences, with John Dykstra and Andrew Adamson credited as the visual effects supervisors.[24]According to Shadows of the Bat: The Cinematic Saga of the Dark Knight Part 6: Batman Unbound, Chris O'Donnell revealed that despite hanging out with Arnold Schwarzenegger a lot off set and during promotion for the film, they never worked a single day together. This was achieved with stand ins when one of the actors wasn't available.Stunt coordinator Alex Field taught Alicia Silverstone to ride a motorcycle so that she could play Batgirl.[22]Like Batman Forever, the original score for the film was written by Elliot Goldenthal.[25] The soundtrack featured a variety of genres by various bands and performers, showcasing alternative rock on the lead single \"The End Is the Beginning Is the End\" by The Smashing Pumpkins, on the Goo Goo Dolls' contribution, \"Lazy Eye\" and with R.E.M.'s song \"Revolution\". R&B singer R. Kelly also wrote \"Gotham City\" for the soundtrack, which became the other song featured in the end credits, as well as one of the singles, reaching the top 10 in the United States and in the UK. Eric Benét and Meshell Ndegeocello also contributed R&B songs. Also included was the top 5 second single, \"Look into My Eyes\" by the hip hop group Bone Thugs-n-Harmony. Other songs featured included electronic dance elements, including those by Moloko and Arkana. The soundtrack was released on May 27, 1997, a month before the film.[26][27]","produced_by":"Peter MacGregor-Scott","starring":"Arnold Schwarzenegger George Clooney Chris O'Donnell Uma Thurman Alicia Silverstone Michael Gough Pat Hingle Elle Macpherson John Glover","running_time":"125 minutes","music_by":"Elliot Goldenthal","External links":"","edited_by":"Dennis Virkler Mark Stevens","written_by":"Akiva Goldsman","budget":"$125–140 million[1][2]"}