{"country":"United States","distributed_by":"Columbia Pictures","a_song_to_remember":"Video cover for A Song to Remember","Legacy":"Liberace's trademark electric candelabrum was inspired by a similar prop in A Song to Remember.[4]","Plot":"Chopin, played by Cornel Wilde, is first presented to the audience as a child prodigy playing a piece by Mozart. He suddenly starts to bang on the piano keys when he notices out the window that Polish people are being taken prisoners by the Russian authorities. Years later, Chopin takes part in secret meetings to work on saving Poland with his young friends. Director Vidor depicts patriotism as a major motive for Chopin playing the piano. Despite his family's apprehension, Chopin is egged on in his clandestine political activities by his devoted piano teacher, Professor Eisner.He attends a secret meeting instead of showing up on time for an important concert in front of a count and distinguished guests. When he finally performs at the concert, he stops playing when he sees the Russian Governor of Poland enter the room. Chopin stands up and announces, \"I do not perform for Czarist butchers.\" He storms out of the room as his famous Revolutionary Étude starts in the background. The resulting scandal forces Chopin to flee to France, along with Professor Eisner. Before leaving for Paris, Chopin clutches Polish earth in his hands. When he arrives in Paris, he says: \"I’m thinking of my people back home. You see, there was a purpose in coming to Paris.\"Eisner struggles to gain venues for his student, whom he is certain is a genius. Just before the night of his crucial debut, Chopin is informed of the murder of his revolutionary friends in Poland by Russian police. The first work of Chopin's that is heard in Paris is his \"Heroic\" Polonaise, a song for Poland. A few musicians, including Franz Liszt, recognize his genius, but the concert does not secure his reputation in France, as Eisner had hoped.The appearance of George Sand, played by Merle Oberon, alters Chopin's life. An important and influential writer as well as a minor aristocrat, she has the money and connections to promote his fame. But instead of promoting Chopin as a concert pianist, Sand wants Chopin to remain alone with her, coddled at her estate and devoting himself solely to composition. During this period, Chopin writes his most famous works. Vidor portrays George Sand as a selfish, manipulative and domineering figure in Chopin's life, who seduces him and distracts him from his desire to serve the cause of Poland. While under her influence, Chopin snubs his old friend Eisner, who patiently waits for him to remember his duty to his people.A young woman who Chopin knew in Poland arrives in Paris and presents Chopin with a tiny bag of Polish earth, awakening his sense of patriotism. By the end of the film, Chopin has finally reunited with Eisner and broken away from Sand so that he can embark on an international tour to raise money for the Polish cause. His playing is so passionate that in one of his concerts, Chopin starts bleeding. Finally, the strain of the tour destroys his fragile health and Chopin begs from his deathbed to see Sand once more, but she coldly spurns him. He succumbs to tuberculosis.","language":"English","Reception":"A Song to Remember was nominated for Best Actor in a Leading Role (Cornel Wilde), Best Cinematography, Color, Best Film Editing, Best Music, Scoring of a Dramatic or Comedy Picture, Best Sound, Recording (John P. Livadary) and Best Writing, Original Story.[1]Though Chopin was a true Polish patriot, Vidor highly romanticizes Chopin's patriotism in the film, which was produced during World War II. He fictionalizes Chopin's relationship with Eisner (who did not really accompany him to Paris) and greatly distorts Chopin's relationship with Sand to produce a \"good vs. evil\" struggle for Chopin's soul between Eisner and Sand. The script occasionally sounds more like propaganda for wartime self-sacrifice over individualism than like the real story of Chopin's life.Ayn Rand was sharply critical of the film, strongly taking the side of the George Sand character as against the Polish nationalist ones – a value judgement diametrically opposite to that taken by the film makers: \"George Sand, according to the film, is evil because she provides a beautiful, private retreat where Chopin can live in peace and luxury, because she takes care of his every need, attends to his health, and urges him to forget the world and devote himself exclusively to the work of writing music, which he is desperately eager to do. The young Polish girl, according to the film, is good because she urges Chopin to drop the work that he loves and go out on a concert tour to collect money 'for the people', for a cause that is identified as national or revolutionary or both, and this is supposed to justify everything – so she demands that Chopin renounce his genius, sacrifice his composing and go out to entertain paying audiences – even though he hates concert playing, is ill with tuberculosis and has been warned by the doctors that the strain of a tour will kill him\".[2]Victor Brown noted that \"The breakup of George Sand's relationship with Chopin was for personal reasons completely different from those shown in the film - mainly Chopin's siding with Sand's estrange daughter against her mother. In fact, George Sand was an outspoken supporter of the Polish national cause in her own right, an allegiance which which lasted long past the end of the relationship with Chopin. During the Revolution of 1848 in France George Sand took part in a Polish solidarity demonstration held in Paris on May 15, 1848, calling for the French Army to sent to liberate Poland.[3]The pianist José Iturbi played the piano music, and also orchestrated part of the B minor Sonata for the scene when Chopin and George Sand arrive in Majorca. The hands of pianist Ervin Nyiregyházi are shown playing the piano.","cinematography":"Tony Gaudio Allen M. Davey","directed_by":"Charles Vidor","release_dates":"January 18, 1945 (1945-01-18)|||||","produced_by":"B. F. Zeidman","starring":"Paul Muni Cornel Wilde Merle Oberon Nina Foch","running_time":"113 minutes","music_by":"Miklós Rózsa","edited_by":"Charles Nelson","written_by":"Ernst Marischka (Story) Sidney Buchman"}