{"country":"United States","distributed_by":"General Film Corporation (original release) Rolling Thunder Pictures (1998 re-release)","detroit_9000":"Film poster","Plot":"Street-smart white detective Danny Bassett (Alex Rocco) teams with educated black detective Sgt. Jesse Williams (Hari Rhodes) to investigate a theft of $400,000 at a fund-raiser for Representative Aubrey Hale Clayton (Rudy Challenger).[3]","language":"English","box_office":"$3,179 (1998 re-release)[1] $1,200,000 (US/ Canada rentals)[2]","cinematography":"Harry May","directed_by":"Arthur Marks","release_dates":"1973 (1973)|1998 (1998) (re-release)||||","Filming":"Actor Alex Rocco was cast as a result of director Arthur Marks' positive experience working with him on their 1973 film Bonnie's Kids.[4]Unlike many films set in Detroit (such as Robocop and Bird on a Wire), Detroit 9000 was shot on location in downtown Detroit and close-in neighborhoods. A number of now demolished landmark buildings can be seen including the J.L. Hudson Company, and the Fort Street Terminal train station. Fort Street Station was already closed when filming was taking place and the approach tracks to the station were used for a chase scene. The now restored Book Cadillac Hotel was used in the reception scenes, including the hotel's famed crystal ballroom. Although the hotel closed in 1983 and sat dormant for over 20 years, it was restored and reopened by the Westin Hotel group in 2009. Although Detroit suffered from race rioting in July 1967, and the riots are referred to in the movie, the film avoided showing areas that still showed signs of heavy damage from the rioting.The final shootout takes place in historic Elmwood Cemetery. Sacred Heart Seminary stands in for the \"Longview Sanitarium,\" where Bassett goes to visit his institutionalized wife. The hospital is Detroit Memorial Hospital on St. Antoine St. (The building was torn down in 1987.) Detroit Police headquarters at 1300 Beaubien Street is also shown.A number of local Detroit celebrities appeared in the film, such as disc jockey Dick Purtan, who plays the police detective who converses with Alex Rocco's character just prior to his boarding a police helicopter. Then-Detroit Police Chief John Nichols played himself in the TV station scene, and Detroit radio personality Martha Jean \"The Queen\" Steinberg played the host.The title is a reference to the Detroit Police radio code \"9000,\" which means \"officer down.\"","produced_by":"Arthur Marks Chuck Stroud","starring":"Hari Rhodes Alex Rocco Vonetta McGee Rudy Challenger Scatman Crothers","running_time":"106 minutes","Re-Release":"Championed by Quentin Tarantino, the film was given a limited re-release theatrically by his short-lived Rolling Thunder Pictures distribution company in October 1998.[1] It was subsequently released on video by Miramax in April 1999.[5] Tarantino also included a line of dialogue from the film into the soundtrack for his own film Jackie Brown.[6]The re-release met with generally favorable reviews. The New York Times critic Lawrence Van Gelder claimed \"In general release, Detroit 9000 illustrates the wisdom of the adage \"better late than never,\" and praised the film's complex racial politics,[3] while the A.V. Club's Nathan Rabin opined that, while the film was flawed, it was also an \"interesting, thoroughly watchable film, and considering its genre and origins, that's something of an achievement.\"[7] Reviewing the film's 2013 re-issue by Lionsgate Films as part of a Rolling Thunder Picture triple-pack (with The Mighty Peking Man and Switchblade Sisters), DVD Talk's Ian Jane called it a \"top notch cops and robbers urban crime thriller\" which is \"Not content to just titillate the audience with the more exploitative elements inherent in the genre... [the] film addresses head on the issues of racial tension, marital infidelity, and the difficulties of trying to make ends meet while still playing the part of an honest cop.\"[8]","music_by":"Luchi de Jesus","written_by":"Orville H. Hampton"}