{"country":"United States","distributed_by":"20th Century Fox","Plot":"Posing as a hangman, Mace Bishop (James Stewart) arrives in town with the intention of freeing his brother Dee (Dean Martin) from the gallows. Dee and his gang have been arrested for a bank robbery in which Maria Stoner's husband was killed by gang member Babe Jenkins (Clint Ritchie). After freeing his brother, Mace successfully robs the bank on his own after the gang has fled with the posse in pursuit.Dee has taken Maria as a hostage after they come across her wagon, during which Gang member Pop Chaney (Will Geer) shoots and kills the man escorting Maria. The posse, led by local sheriff July Johnson and deputy Roscoe Bookbinder (Andrew Prine), chases the fugitives across the Mexican border into territory policed by bandoleros, whom Maria describes as men out to kill any gringos (foreigners) that they can find. Maria further warns Dee that the sheriff will follow, because they have taken the one thing that July Johnson has always wanted: her.Despite initial protestations, Maria falls for Dee and finds herself in a quandary. She had never felt anything for the sheriff, nor for her husband, who had purchased her from her family. The posse tracks them to an abandoned town and captures the gang. The bandoleros also arrive, shooting and killing Roscoe, so the sheriff releases the outlaws so that the men can fight back in defense.In this final showdown, almost everyone is killed. Dee is fatally stabbed by the leader of the bandits, El Jefe, and then Mace is shot by another. Babe and gang member Robbie O'Hare (Sean McGlory) die after killing numerous bandoleros. Pop Chaney is killed while going after the money Mace stole, and his son Joe (Tom Heaton) dies after trying to rescue him. Maria grabs a pistol and shoots El Jefe dead. Maria and the sheriff, with little left of the posse, bury the Bishop brothers and dead posse members without markers, after which Maria notes that no one will know who was there nor what had happened.","language":"English","Reception":"The film earned North American rentals of $5.5 million in 1968.[8]","box_office":"$12,000,000[2]","cinematography":"William H. Clothier","directed_by":"Andrew V. McLaglen","bandolero!":"Film poster by Tom Chantrell","release_dates":"June 1, 1968 (1968-06-01)|||||","Production":"The film was originally known as Mace.[4]The film was shot at the Alamo Village, the movie set originally created for John Wayne's The Alamo.[5] The Alamo Village is located north of Brackettville, Texas. The location closed in 2009 after remaining open to movie companies and the public since 1960.Larry McMurtry, the author of the novel Lonesome Dove, reportedly paid homage to Bandolero! by using similar names for the characters in his book. Both tales begin near the Mexico border and involve bandoleros. Both have a sheriff named July Johnson and a deputy Roscoe who travel a great distance in search of a wanted criminal and the woman who has rejected the sheriff's love. Both stories have a charismatic outlaw named Dee, who is about to be hanged and who wins the love of the woman before he dies. In the Lonesome Dove miniseries, the main characters twice pass directly in front of the Alamo—or at least a set built to replicate the Alamo.Raquel Welch later said of her performance, \"No one is going to shout, 'Wow it's Anne Bancroft all over again', but at least I'm not Miss Sexpot running around half naked all the time.\"[6]\"I think she's going to stack up all right,\" Stewart said of Welch.[7]","produced_by":"Robert L. Jacks","starring":"James Stewart Dean Martin Raquel Welch George Kennedy Will Geer Denver Pyle","running_time":"106 minutes","music_by":"Jerry Goldsmith","edited_by":"Folmar Blangsted","written_by":"Stanley Hough (Story) James Lee Barrett (Screenplay)","budget":"$4.45 million[1]"}