{"country":"United States","distributed_by":"Cannon Films[1]","Plot":"10 To Midnight is a drama that mixes elements of police and slasher films. It portrays the homicidal behavior of Warren Stacy (Gene Davis), a young office equipment repairman who kills women after they reject his sexual advances. And his attempts at flirting are always seen as \"creepy\" by women, resulting in frequent rejections.[2] His first victim seen in the film is Betty, an office worker of his acquaintance. He tracks her down to wooded area, and observes her having sex with her boyfriend. He ambushes the couple, kills the boyfriend, and then gives chase to the naked woman. He stabs her to death.[2]Two Los Angeles police detectives, Leo Kessler (Charles Bronson) and Paul McAnn (Andrew Stevens), investigate his murders. Kessler is a seasoned veteran of the force, while McCann is considerably younger.[2] Stacy avoids prosecution by constructing sound alibis and assaulting his victims while naked except for a pair of latex gloves to hide fingerprints, thus minimizing evidence. This was before obtaining DNA evidence became possible.Laurie Kessler (Lisa Eilbacher) is the only daughter of Leo and an acquaintance to some of the victims. A student nurse herself, she becomes a target for the killer.[2] McAnn refuses to go along when Kessler plants evidence in order to frame the suspect. Stacy goes on another rampage, killing three nursing students who are friends with Kessler's daughter.When he is caught, stark naked in the street, Stacy boasts how he will say all the things that will \"prove\" that he is crazy: he hears voices telling him to do things, etc., so that one day, he will be back on the street and Kessler, as well as the \"whole f-ing world,\" will hear from him again. Kessler replies, \"No, we won't.\" He then shoots Stacy once in the forehead, executing him and leaving all other considerations aside. The film then ends with a bird's-eye view of Kessler standing over the body, surrounded by police as the camera slowly zooms out.","language":"English","Reception":"Violent and with unseemly subject matter, 10 to Midnight drew scathing reviews from film critics, including a \"zero stars\" rating from Roger Ebert of the Chicago Sun-Times who wrote, \"I admire [Bronson's] strong, simple talent. What is he doing in a garbage disposal like this?\"[4] The film did receive positive feedback from others, such as Ebert's colleague Gene Siskel of the Chicago Tribune and was a financial success. The film has maintained a sizeable cult following through home video releases and heavily edited broadcasts on television which displayed alternate scenes of Stacy and his victims in their underwear instead of being totally naked.","box_office":"$7,175,592 (USA)","cinematography":"Adam Greenberg","production_company":"Cannon Group City Films","directed_by":"J. Lee Thompson","10_to_midnight":"Theatrical release poster","Analysis":"The killer of the film is motivated by sexual frustration.[2] The character is intentionally portrayed as a \"creep\", as often called in the film. The intent was to portray the characters in a way that the audience will feel no empathy for him. The type of villain an audience wants to see go down.[2]The film features both violence, and \"gratuitous nudity\". It combines the two by having victims killed while naked or partially undressed.[2]","release_dates":"March 11, 1983 (1983-03-11) (U.S.)|||||","Production":"10 to Midnight uses a screenplay originally named Bloody Sunday. According to producer Pancho Kohner, Kohner and Bronson had purchased the film rights to the novel The Evil That Men Do (1978) by R. Lance Hill. Cannon Films chairman Menahem Golan wanted to market Bronson's next film project and the adaptation of the novel was going to be that project. But Kohner estimated the rights to the novel and the cost of the screenplay to be worth 200,000 dollars. Menahem refused to pay and the deal fell through.[3] But Menahem still offered to market Bronson's next film project, just not based on that novel. He and Kohner had already arranged a visit to the Cannes Film Festival to promote the film project. He asked Kohner to come up with a new title, and 10 to Midnight was the result of his brainstorm. At the Festival they promoted the project to potential buyers, as a film featuring action, danger, and revenge. But at this point, they really had no script for the suggested film. Back in Los Angeles, they went in search of a story of the film. It was Lance Hool who suggested using the screenplay Bloody Sunday by William Roberts. They simply attached the already chosen title to that screenplay.[3]The name of killer Warren for Warren Stacy was based on Hollywood star Warren Beatty.The music for 10 to Midnight was composed by Cannon Films mainstay Robert O. Ragland and the film was recorded by cinematographer Adam Greenberg. The film also features actor Robert F. Lyons and actress Kelly Preston (listed as Kelly Palzis) in smaller roles.","produced_by":"Pancho Kohner, Lance Hool,","starring":"Charles Bronson|Lisa Eilbacher|Andrew Stevens|Gene Davis|Geoffrey Lewis|Wilford Brimley|","running_time":"101 min","music_by":"Robert O. Ragland","edited_by":"Peter Lee Thompson","written_by":"William Roberts, J. Lee Thompson","budget":"$4,520,000 (USA)"}