{"country":"United States","distributed_by":"RKO Radio Pictures","screenplay_by":"Jonathan Latimer","Plot":"A passenger airliner piloted by Bill Lonagan (Robert Ryan) and Joe Brooks (Keith Andes) is bound for Boca Grande, South America, making a pick-up stop in Central America. The passengers are: Jud Ellis (Gene Barry), escorting his fiancée Louise Melhorn (Phyllis Kirk); repentant political assassin Vasquel (Rod Steiger) being transported back to the proper authorities by detective Crimp (Fred Clark); mobster Pete Bostwick (Jesse White), accompanying a little boy named Tommy, whose father is Bostwick's boss; an elderly couple, Professor and Mrs. Spangler (Cameron Prud'Homme and Beulah Bondi), apparently on vacation; and jilted blonde bombshell Rena (Anita Ekberg), on her way to a South American casino and vying for Ellis' attention.During the flight, the aircraft enters a rough storm and is dangerously jostled about. A portable oxygen tank is loosened from its mooring, and crashes through one of the fuselage doors, killing the flight attendant, Maria Alvarez (Adele Mara), who is thrown out of the aircraft.The crew is then forced to make an emergency landing in the jungle, aircraft intact. Crimp tries to take charge of the group, but the captain stops him. Late at night, Crimp renders Bostwick temporarily unconscious, steals the gun he was guarding, then flees into the jungle. Momentarily, Ellis becomes psychologically unhinged, and tries to force himself upon Louise, but co-pilot Brooks steps in to dissuade him. Later, the aircraft is repaired, but soon after searching and finding an errant Tommy, Bostwick and Rena discover Crimp’s headless body. Soon, local head hunters kill Bostwick with a poison dart.When Lonagan and Brooks start the engines, they discover an oil leak. Lonagan patches it, but informs the others that it will not hold long. With only one good engine, the aircraft can carry only four adults and the child over the mountains. With gun in hand, Vasquel takes charge. The elderly Spanglers volunteer to remain behind. Ellis tries to stop him and is shot dead. The aircraft manages to take off.As the head hunters close in, Vasquel shoots the Spanglers with the last two bullets and prays as he awaits a horrible death.","language":"English","Reception":"Despite its earlier notable screen heritage, Back from Eternity did not have a positive review from film critic Bosley Crowther at The New York Times. He said, in part, \" ... the plight of a group of people downed in the South American wilds when the airliner in which they are traveling is forced to crash land by a violent thunderstorm ... This is the undistinguished company, and we hasten to advise that nothing that happens to them is either inspired or interesting. \" [5]","box_office":"$1.5 million (US)[2]","cinematography":"William C. Mellor","production_company":"RKO Radio Pictures, Inc.","directed_by":"John Farrow","release_dates":"September 8, 1956 (1956-09-08) (US)[1]|||||","Production":"The supposed New York airport control tower shown near the beginning of the film is actually that of the Lockheed Air Terminal in Burbank, California. Principal photography on Back from Eternity took place from March 5 to April 26, 1956.[4]","produced_by":"John Farrow","starring":"Robert Ryan Anita Ekberg Rod Steiger Phyllis Kirk Keith Andes Gene Barry","running_time":"100 minutes","back_from_eternity":"Theatrical film poster[Note 1]","music_by":"Franz Waxman","edited_by":"Eda Warren","written_by":"Richard Carroll (story)"}