{"Adaptations":"Marcus Stern, associate director of the American Repertory Theater, directed a stage adaptation of Donnie Darko at the Zero Arrow Theatre, in Cambridge, Massachusetts, in the fall of 2007. It ran from October 27 until November 18, 2007, with opening night scheduled near Halloween.An article written by the production drama team stated that the director and production team planned to \"embrace the challenge to make the fantastical elements come alive on stage.\"[31] In 2004, Stern adapted and directed Kelly's screenplay for a graduate student production at the American Repertory Theatre's Institute for Advanced Theater Training (I.A.T.T./M.X.A.T.).","donnie_darko":"Theatrical release poster","country":"United States","Awards and nominations":"","distributed_by":"Pandora Cinema Newmarket Films","Plot":"On October 2, 1988, Donnie Darko, a troubled teenager living in suburban Virginia, is awakened and led outside by a figure in a monstrous rabbit costume, who introduces himself as \"Frank\" and tells him the world will end in 28 days, 6 hours, 42 minutes, and 12 seconds. At dawn, Donnie returns home to find a jet engine has crashed into his bedroom. His older sister, Elizabeth, informs him the FAA investigators do not know where it came from.Donnie tells his psychotherapist, Dr. Thurman, about his continuing visits from Frank. Acting under Frank's influence, he floods his school by damaging a water main. He also begins dating new student Gretchen Ross, who has moved to town with her mother under a new identity to escape her violent stepfather. Gym teacher Kitty Farmer blames the flooding on the influence of the short story \"The Destructors\", assigned by dedicated English teacher Karen Pomeroy, and begins teaching attitude lessons taken from motivational speaker Jim Cunningham. Donnie rebels against these motivational lessons, leading to friction between Kitty and Donnie's mother Rose.Donnie asks his science teacher, Dr. Kenneth Monnitoff, about time travel after Frank brings up the topic, and is given the book The Philosophy of Time Travel, written by Roberta Sparrow, a former science teacher at the school who is now a seemingly senile old woman.Dr. Thurman tells Donnie's parents that he is detached from reality, and that his visions of Frank are \"daylight hallucinations\", symptomatic of paranoid schizophrenia. Donnie disrupts a speech being given by Jim Cunningham by insulting him in front of the student body, then burns down Cunningham's house on instructions from Frank. When police find evidence of a child pornography operation in the house's remains, Cunningham is arrested. During a hypnotherapy session, Donnie confesses his crimes to Dr. Thurman and says that Frank will soon kill someone.Rose agrees to replace Kitty as chaperone for her daughter Samantha's dance troupe in Los Angeles, so Kitty can testify in Cunningham's defense; with her husband Eddie in New York on business, her older children are home alone.Donnie and Elizabeth take the opportunity to throw a Halloween party to celebrate her acceptance to Harvard. Gretchen arrives, distraught that her mother has disappeared. Realizing that only hours remain before Frank's prophesied end of the world, Donnie takes Gretchen and two friends to seek Roberta Sparrow at her house. They are attacked by two school bullies, Seth and Ricky, who are attempting to rob Sparrow's house, and the fight spills into the street. An oncoming Pontiac Trans Am car swerves to avoid Sparrow, who went for her daily walk to check her mailbox, but runs over Gretchen, killing her. The driver turns out to be Elizabeth's boyfriend Frank Anderson, wearing the same rabbit costume as the Frank of Donnie's visions. Donnie shoots him in his eye with his father's gun.As a vortex forms in dark clouds above his house, Donnie drives into the hills and watches as an airplane descends from above. The plane, carrying Rose and the dance troupe, is wrenched violently as one of its engines detaches and falls into the vortex. Events of the previous 28 days recapitulate in reverse order and action, until Donnie finds himself in bed in the early hours of October 2. As he sits laughing uncontrollably, the jet engine crashes through his room, killing him. Others with whom Donnie had interacted in the 28 days awaken, some looking disturbed. Gretchen rides by Donnie's house and learns of his death from a neighborhood boy, David, but says she did not know him. Gretchen and Rose exchange a glance and wave as if they know one another, but cannot remember from where.","language":"English","Reception":"Donnie Darko had its first screening at the Sundance Film Festival, on January 19, 2001, and debuted in United States theaters on October 26, 2001, to a tepid response. During its opening weekend, it was shown on only 58 screens nationwide, grossing $110,494.[16] This may have been the result of the movie being released shortly after the September 11 attacks.[17] By the time the film's run closed in United States theaters, on April 11, 2002, it had earned just $517,375.[4][16] It ultimately grossed $7.6 million worldwide, just enough to recoup its budget.[4]Despite its poor box office showing, the film began to attract a devoted fan base. It was originally released on VHS and DVD in March 2002. During this time, the Pioneer Theatre in New York City's East Village began midnight screenings of Donnie Darko that continued for 28 consecutive months.[9] In the United Kingdom, Donnie Darko sold 300,000 tickets within the first six weeks of its release, based mostly on word-of-mouth marketing.[18]The film received very positive reviews, with praise towards the acting, writing and atmosphere. Rotten Tomatoes gives the theatrical version of the film an 85% rating, and the director's cut a 91% rating.[6] Metacritic gives the theatrical version of the film a score of 71 out of 100, based on 21 reviews, which indicates \"generally favorable reviews\", whereas the director's cut received a much higher score of 88 out of 100, based on 15 reviews, which indicates \"universal acclaim\".[19]Andrew Johnson cited the film in Us Weekly, as one of the outstanding films at Sundance in 2001, describing it as \"a heady blend of science fiction, spirituality, and teen angst.\"[20] Jean Oppenheimer of New Times (LA) praised the film, saying, \"Like gathering storm clouds, Donnie Darko creates an atmosphere of eerie calm and mounting menace—[and] stands as one of the most exceptional movies of 2001.\"[21] Writing for ABC Australia, Megan Spencer called the movie \"menacing, dreamy, [and] exciting\" and noted that \"it could take you to a deeply emotional place lying dormant in your soul.\"[22] Roger Ebert gave the theatrical version of the film two and a half stars out of four, but later gave the director's cut three stars out of four.[23]","box_office":"$7.3 million[4]","cinematography":"Steven B. Poster","production_company":"Flower Films","directed_by":"Richard Kelly","release_dates":"January 19, 2001 (2001-01-19) (Sundance)|October 26, 2001 (2001-10-26) (United States)||||","Production":"Donnie Darko was filmed in 28 days, on a budget of $4.5 million.[3] It almost went straight to home video, but was theatrically released by Drew Barrymore's production company, Flower Films.[7]Some scenes were shot in Bixby Knolls Virginia Country Club, in Long Beach, California, with many of the school sequences shot at Loyola High School. The \"Carpathian ridge\" scenes were shot on the Angeles Crest Highway.[8]In 2003, the piano-driven cover of Tears for Fears' \"Mad World\" featured in the film, as part of the end sequence, was a hit for composer Michael Andrews and singer Gary Jules, topping the charts in the United Kingdom and Portugal.[9]One continuous sequence involving an introduction of Donnie's high school prominently features the song \"Head over Heels\", by Tears for Fears, Samantha's dance group, \"Sparkle Motion\", performs with the song \"Notorious\", by Duran Duran, and \"Under the Milky Way\", by The Church, is played after Donnie and Gretchen emerge from his room during the party. \"Love Will Tear Us Apart\", by Joy Division, also appears in the film diegetically during the party and shots of Donnie and Gretchen upstairs. The version included was released in 1995, although the film is set in 1988. The opening sequence is set to \"The Killing Moon\" by Echo & the Bunnymen.[10] In the theatrical cut, the song playing during the Halloween party is \"Proud to be Loud\" by Pantera, a track released on their 1988 album, which would coincide with the time setting of the film. However, the band is credited as \"The Dead Green Mummies\".In the re-released Director's cut version of the film, the music in the opening sequence is replaced by \"Never Tear Us Apart\" by INXS; \"Under the Milky Way\" is moved to the scene of Donnie and Eddie driving home from Donnie's meeting with his therapist; and \"The Killing Moon\" is played as Gretchen and Donnie return to the party from Donnie's parents' room.[10]","produced_by":"Sean McKittrick Nancy Juvonen Adam Fields","starring":"Jake Gyllenhaal Jena Malone Drew Barrymore Maggie Gyllenhaal Mary McDonnell Katharine Ross Patrick Swayze Noah Wyle","running_time":"113 minutes[1] 133 minutes (Director's cut)[2]","Sequel":"A 2009 sequel, S. Darko, centers on Sam, Donnie's younger sister. Sam begins to have strange dreams that hint at a major catastrophe. Donnie Darko creator Richard Kelly has stated that he had no involvement in the sequel, as he does not own the rights to the original.[29] Chase and producer Adam Fields were the only creative links between it and the original film. The sequel received extremely negative reviews.[6][30]","music_by":"Michael Andrews","edited_by":"Sam Bauer Eric Strand","Release":"The film had a limited release, opening October 26, the month following the September 11 attacks. It was subsequently held back for almost a year for international release.The Donnie Darko Book, written by Richard Kelly, is a 2003 book about the film. It includes an introduction by Jake Gyllenhaal, the screenplay of the Donnie Darko: The Director's Cut, an in-depth interview with Kelly, facsimile pages from the Philosophy of Time Travel, photos and drawings from the film, and artwork it inspired. NECA released first a six-inch (15 cm) figure of Frank the Bunny and later a foot-tall (30 cm) \"talking version\" of the same figure.The film was originally released on VHS and DVD in March 2002. Strong DVD sales led Newmarket Films to release a \"Director's Cut\" on DVD in 2004. Bob Berney, President of Newmarket Films, has described the film as \"a runaway hit on DVD,\" citing United States sales of more than $10 million.The film was released in the US on Blu-ray on February 10, 2009.The film was released as a 2-disc Blu-ray special edition in the UK on July 19, 2010, by Metrodome Distribution, and featuring both Original and Director's Cut. Also including commentaries from director Kelly and actor Gyllenhaal, Kelly and Kevin Smith, and cast and crew, including Drew Barrymore.Donnie Darko: The Director's Cut was released on May 29, 2004, in Seattle, Washington, at the Seattle International Film Festival, and later in New York City and Los Angeles, on July 23, 2004. This cut includes twenty minutes of extra footage and an altered soundtrack.The director's cut DVD was released on February 15, 2005 in single- and double-disc versions, the latter being available in a standard DVD case or in a limited edition that also featured a lenticular slipcase, whose central image alternates between Donnie and Frank depending on the viewing angle. Most additional features are exclusive to the two-DVD set: the director's commentary assisted by Kevin Smith,[11] excerpts from the storyboard, a 52-minute production diary, \"#1 fan video\", a \"cult following\" video interviewing English fans, and the new director's cut trailer. The single-DVD edition was also released as a giveaway with copies of the British Sunday Times newspaper on February 19, 2006.The DVD of the Director's Cut includes text of the in-universe fictional book, The Philosophy of Time Travel, written by Roberta Sparrow, which Donnie is given and reads in the film.[12] The text expands on the philosophical and scientific concepts much of the film's plot revolves around, and has been seen as a way to understand the film better than from its theatrical release.[13][14][15] As outlined by Salon's Dan Kois from the book's text, much of the film takes place in an unstable Tangent Universe that is connected to the Primary Universe and a duplicate of it, except for an extra metal vessel known as an Artifact — the plane engine. If the Artifact is not sent to the Primary Universe by the chosen Living Receiver (Donnie) within 28 days, the Primary Universe will be destroyed upon collapse of the Tangent. To aid in this task, the Living Receiver is given super-human abilities such as foresight, physical strength and elemental powers, but at the cost of troubling visions and paranoia, while the Manipulated Living (all who live around the Receiver) support him in unnatural ways, setting up a domino-like chain of events encouraging him to return the Artifact. The Manipulated Dead (those who die within the Tangent Universe, like Frank and Gretchen) are more aware than the Living, having the power to travel through time, and will set an Ensurance Trap, a scenario which leaves the Receiver no choice but to save the Primary Universe.[13]","written_by":"Richard Kelly","budget":"$3.8 million[3]"}