{"country":"United States","distributed_by":"Open Road Films Vertigo Films (United Kingdom and Ireland only)","a_haunted_house":"Theatrical release poster","Plot":"In August 2012, a young couple, Malcolm and Kisha, move in together. As Kisha arrives, she accidentally kills Shiloh, Malcolm's dog, by running it over with her car. On the first night, Malcolm is constantly awoken with Kisha farting loudly that eventually drives him out of the room. The next morning, when Kisha notices her keys on the floor, she tells Malcolm they might have a ghost. To prove to her wrong, Malcolm invites over camera men Dan the Security Man and his brother Bobby. Malcolm tries to have sex with the camera on, but Kisha tells him to turn it off. Before they really start, Malcolm turns the camera back on and records everything. In the morning, Malcolm and Kisha watch the video and notice the door moved. Malcolm suggests it was caused by his lovemaking.The next night, Malcolm notices the paranormal activity and tries to move out of the house and leave Kisha. Since he can't sell his house in the current market, they hire Chip, a psychic, to investigate; Chip immediately falls in love with Malcolm. Before Chip can leave, after finding nothing wrong, Kisha confesses to making a deal with the devil for a pair of shoes. Chip tells Kisha she is screwed and invites Malcolm to a wrestling match. After Chip leaves, Kisha shows Malcolm a video of her eighth birthday, in which she began to experience paranormal activity by her imaginary friend, Tony. The next night, Kisha awakens in the middle of the night, stands by the bed for several hours, and begins to dance. Malcolm wakes up and follows Kisha to the kitchen, where he catches her eating uncooked food and drinking old milk. She screams crazily when Malcolm restrains her. In the morning, Kisha remembers nothing.On another night, Kisha urges Malcolm to investigate a noise, but it turns out to be Rosa, his Hispanic housekeeper. Rosa quits, and Malcolm and Kisha smoke marijuana with the ghost to relieve their pain. The next day, Malcolm's friend Steve and his girlfriend Jenny bring a ouija board to communicate with the ghost. When it misspells ghost as \"gost\", they all laugh at it, and it throws the ouija board across the room, scaring Jenny and Steve out of the house. That night, the ghost drags Malcolm out of the room and has sex with Kisha. When Malcolm finds out, he calls his cousin Ray Ray, who immediately flees when he sees the ghost's powers. That same night, Kisha waits for the ghost until it gets late and leaves. After Kisha leaves, the ghost rapes Malcolm.Malcolm and Kisha anger the ghost by not getting scared, so it attacks Kisha in the night while Malcolm listens to music on his computer. In the morning, Malcolm notices something is wrong with Kisha and calls Father Doug to do an exorcism. When it does not work (the ghost gives out clues of its plan), Malcolm calls Dan and Bobby to help. Chip also rushes into the house to help. During the exorcism, Kisha escapes into the living room. Before Malcolm and Doug find her, Doug accidentally shoots and kills Rosa, who had come to pick up her last check. When they all meet in the living room, Kisha behaves very strangely and flees to the basement. The group follows and finds her crying in a corner. When Malcolm reaches for her, she attacks him, and the whole group beats her up, apparently forcing the ghost out of her body.The next night, Malcolm and Kisha have sex with the camera on for about three hours. In the middle of the night, Kisha wakes up and stands next to the bed for a few hours before walking out of the room and making a big crash and screaming Malcolm's name. When Malcolm comes out of his room, Kisha throws him back, and he hits the camera, knocking him out. When Kisha enters the room her shirt is bloody. She crawls to Malcolm and sniffs his body until he farts in her face. As Kisha lunges at the camera, her face takes on a demonic appearance. A minute later, Malcolm wakes up telling everyone he survived and Kisha is behind him making him scream.","language":"English","Reception":"A Haunted House was panned by critics. On Rotten Tomatoes, the film holds a rating of 10%, based on 51 reviews, with an average rating of 2.6/10.[9] On Metacritic, the film has a score of 20 out of 100, based on 16 critics, indicating \"generally unfavorable reviews\".[10]Nick Swardson was nominated for a Golden Raspberry Award for Worst Supporting Actor for his performance in the film.","box_office":"$60.1 million[2]","cinematography":"Steve Gainer","production_company":"IM Global Octane Baby Way Productions","directed_by":"Michael Tiddes","Home media":"A Haunted House was released on DVD, Blu-ray, Ultraviolet, and digital copy on April 23, 2013.","release_dates":"January 11, 2013 (2013-01-11)|||||","produced_by":"Marlon Wayans Rick Alvarez","starring":"Marlon Wayans Essence Atkins Cedric the Entertainer Nick Swardson David Koechner Dave Sheridan Affion Crockett","running_time":"86 minutes[1]","Sequel":"On April 8, 2013, it was confirmed that Wayans, Open Road, and IM Global Octane will produce a sequel due to the financial success of the first film. The sequel had begun shooting in early July 2013.[11] On April 18, 2014 a sequel titled A Haunted House 2 was released.","edited_by":"Suzanne Hines","written_by":"Marlon Wayans Rick Alvarez","budget":"$2.5 million[2]"}