{"country":"United Kingdom[1][2]","distributed_by":"United Artists","screenplay_by":"Christopher Trumbo|Michael Butler|William P. McGivern|William W. Norton|","story_by":"Christopher Trumbo|Michael Butler|","Plot":"Tough Chicago Police Lieutenant Jim Brannigan (John Wayne) is sent to London to extradite a notorious American gangster, Ben Larkin (John Vernon). Brannigan is assigned a local officer, Jennifer (Judy Geeson), to help while he is in London. But before Brannigan can collect his man, Larkin is kidnapped.Larkin's finger is cut off and mailed to the police to prove how serious the kidnappers are. The mobster's lawyer, Mel Fields (Mel Ferrer), tries to arrange a ransom drop while Brannigan makes his way around London in search of Larkin. Whilst struggling to adapt to the British way of life, and the restrained style of policing, he employs techniques not usually seen in Britain.In the meantime, a contract had already been put out on Brannigan's life by Larkin, so hit man Gorman (Daniel Pilon) tails Brannigan in a black Jaguar, making several attempts to kill him and nearly shooting Jennifer by mistake.Commander Swann (Richard Attenborough), in charge of helping get Larkin to America, is a stuffy, titled, upper class Metropolitan Police commander who's not afraid to get his hands dirty. There is continual conflict between Brannigan and Swann about the American's carrying, and use of, his .38 Colt Diamondback revolver.Permitted to go alone to deliver the ransom payment, Fields personally eliminates the kidnappers. He and Larkin celebrate having pulled off a scheme to get the money, Larkin calling the loss of a finger a small price to pay. Brannigan bursts in to foil their plans. As he and Jennifer walk away, Gorman tries to mow them down with his car, but he is shot by Brannigan, who can now return home to Chicago.","language":"English","Reception":"Roger Ebert gave the film a mixed 2 stars out of a possible 4, writing, \"'Brannigan' isn't great, but it's a wellcrafted [sic] action movie and, besides, it's got John Wayne in it.\"[6]","cinematography":"Gerry Fisher","production_company":"Wellborn Levy-Gardner-Laven (uncredited)","directed_by":"Douglas Hickox","Home media":"On 2 October 2001 Brannigan was released on DVD for the first time.The film is available through Amazon.com in a two-pack with Killer Force, and was released for the first time on Blu-ray through Screen Archives Entertainment on 8 July 2014.","brannigan":"Theatrical release poster by Robert McGinnis","release_dates":"26 March 1975 (1975-03-26) (USA)|||||","Production":"Brannigan was filmed on location in London during 1974. The film's action sequences included a car chase through Battersea's Shaftsbury & Winstanley Estate, Wandsworth and Central London featuring Brannigan jumping a yellow Ford Capri coupe across the half raised Tower Bridge. One sequence features shots of the interior and exterior of London's Royal Automobile Club, which has changed little since the shooting of the film. The Capri's jump was one of the last significant appearances of Tower Bridge without its red, white and blue paint scheme which was applied in 1977 to commemorate the Silver Jubilee of Elizabeth II.Conversely, the film's opening sequence and first several minutes display Chicago roadways, riverside buildings and an early O'Hare Terminal 1 that have all been razed and replaced. For example, the film opens on a squad car making the former turn on Upper Lake Shore Drive where East Wacker Drive now exists and where Field Drive had been planned to intersect; in the background, iron workers can be seen constructing the connecting portion of Upper Wacker. The 300 block of North Canal Street, where Brannigan conducts an investigation using \"enhanced interrogation techniques\", rapidly developed between this film, Doctor Detroit, and Raw Deal, and has further developed through to the present day. As Brannigan approaches O'Hare, the Kennedy Expressway is devoid of both commercial development to the north and south, and the Blue Line tracks in the median.Likewise, West India Quay, immediately north of the Isle of Dogs has become unrecognisable with the development of the Docklands in general and Canary Wharf in particular. The location is seen as a derelict, nearly-abandoned dockside during Brannigan's confrontation with the motor-scooter messenger (Tony Robinson), and has since been radically transformed. When a hole is blown in Brannigan's lavatory wall, he looks out to see the Albert Memorial, its statue still coated in thick black paint rather than gold leaf. At the time of filming, the Trafalgar Square post office occupied not only its current footprint, but extended throughout the adjoining commercial spaces, and was marked by an unusually shaped sign extending out from the corner of the building.It contains a piece of footage of the inside of the Garrick Club, which traditionally does not allow cameras and was only agreed to as Richard Attenborough was a long-term member. In the scene in which Brannigan and Commander Swann are at the bar in the Garrick Club, on the wall behind them are portraits of Laurence Olivier and John Gielgud, both in Garrick Club ties.[5]After a Chicago Police officer was depicted in an unflattering light in an episode of the 1957–60 television series, M Squad, then-Mayor Richard J. Daley thereafter discouraged motion picture and television location filming in the city for the rest of his administration and its aftermath. Brannigan is one of the few films – along with Cooley High, also released in 1975 – to have been approved and granted police assistance during the two-decade era.","produced_by":"Arthur Gardner|Jules Levy|","starring":"John Wayne|Richard Attenborough|Judy Geeson|Mel Ferrer|John Vernon|Ralph Meeker|Daniel Pilon|","running_time":"111 minutes","music_by":"Dominic Frontiere","edited_by":"Malcolm Cooke"}