{"country":"United States","distributed_by":"Columbia Pictures","Plot":"In a Roman Catholic convent near Montreal, Canada, during evening prayers, the nuns hear screams coming from the room of Sister Agnes, a young novice. Agnes is found in her room bleeding profusely, and in a wastepaper basket there is a dead baby with its umbilical cord wrapped around its neck.Sister Agnes is suspected of killing the baby, so psychiatrist Martha Livingston is assigned by a court to determine if she is competent to stand trial. In an interview, Agnes claims she doesn't remember being pregnant or giving birth, and shows a lack of understanding of how babies are conceived. Mother Miriam tells Livingston that Agnes is an \"innocent\" who was kept at home by her mother and knows nothing about the world. She is desperate to keep Agnes naive, and declares that she couldn't have known what pregnancy was or remember the father.Mother Miriam tells Livingston about the time Agnes stopped eating in the belief she was getting fat, and then exhibited stigmata in her hand that healed itself within a day. Agnes takes Livingston to her favorite place, a bell tower at the convent. They argue about Agnes' mother and birth, and how much Agnes knows about sex and pregnancy.Mother Miriam tells Livingston that Agnes must have conceived on January 23rd, because that is the night Agnes burned her bedsheets. While looking around the convent grounds, Livingston comes across a barn full of statues of angels and saints. She and a young monsignor argue about whether her lack of faith will leave her unable to treat Agnes with dignity. Livingston learns that Agnes' mother sexually molested Agnes and that Agnes is Mother Miriam's niece.Livingston receives permission from the court to hypnotize Agnes, but Mother Miriam is strongly against it, believing it will strip her of her innocence. While hypnotized, Agnes admits she gave birth and that another woman in the convent knew she was pregnant, but will not reveal who. Livingston discovers that a secret tunnel connects the convent's chapel with the barn. Mother Miriam tries to have Livingston removed from the case, but she appeals to the police and is retained.Livingston obtains a second court order to put Agnes under hypnosis again. Mother Miriam admits that she knew Agnes was pregnant and put the wastebasket in her room, but denies she killed the baby. Under hypnosis, Agnes reveals that she used the tunnel to go see \"Michael\" in the barn. Under questioning, she appears to describe having an encounter with an \"entity\". Suddenly, Agnes exhibits stigmata in her hands, and begins bleeding profusely. Agnes declares that God raped her, and that she hates God for it. She admits that Mother Miriam was present when the baby was born, and that Agnes killed the child because she believed it was a mistake.Agnes is found not guilty by reason of insanity. She tells the judge that she heard a man singing beneath her bedroom for six nights in a row, and then on the seventh night he lay on top of her.","language":"English","Reception":"Agnes of God was greeted with mixed reviews upon release in 1985 and has 46% on Rotten Tomatoes.[1] Reviewers praised the performances of Tilly and Bancroft, but felt that there were holes in the plot and movement. Gene Siskel said that it played \"with some challenging ideas and some sensationalistic events, but ultimately it fails to earn its right to toy with such subjects.\" Roger Ebert similarly sided, giving it one star and saying that though it \"deals in the basic materials of a criminal investigation (cynical cops, forensic details, courtroom testimony), it has a seriously clouded agenda.\"The film was a modest financial success, as it grossed $25,627,836 domestically.","box_office":"$25,627,836","cinematography":"Sven Nykvist","production_company":"Columbia Pictures","agnes_of_god":"Theatrical release poster","directed_by":"Norman Jewison","release_dates":"August 21, 1985 (1985-08-21)|||||","Filming":"Agnes of God was filmed at the former Rockwood Academy in Rockwood, Ontario, Canada and mainly in Montreal, also in Boucherville on the south shore of Montreal (Ste-Famille church).","produced_by":"Norman Jewison Patrick J. Palmer","starring":"Jane Fonda|Anne Bancroft|Meg Tilly|","running_time":"98 minutes","music_by":"Georges Delerue","edited_by":"Antony Gibbs","written_by":"John Pielmeier","budget":"Unidentified"}