{"country":"United States","distributed_by":"Warner Bros.","DVD release":"This movie is on the Looney Tunes Movie Collection DVD From Warner Home Video.","Plot":"Bugs Bunny and Daffy Duck have to sell books for Rambling House. They go their separate ways and experience many wacky things. For instance, while flying through a winter storm, Daffy ran into a house owned by Porky Pig and briefly stayed there while taking place of a stuffed duck which he merely destroyed. Meanwhile, Bugs burrowed his way to a jungle where he pretended to be a baby ape to an ape couple. One half of the couple wanted to do Bugs in, but manages to divert him after he accidentally dropped a boulder on his wife's head.After a little while, Bugs and Daffy reunite and burrowed their way to a cave at a dry desert. Inside, were treasures consisting of gold, jewels and stuff. The greedy duck tries to take the treasure, but he ran into Hassan the guard and made a mad dash back to Bugs who tricked Hassan into climbing into the clouds. Daffy ran back into the cave in excitement.Later, Bugs comes across Sultan Yosemite Sam's palace in the Arabian desert. Sam needs someone to read a series of stories to his spoiled brat son, Prince Abba-Dabba. When Bugs first meets the tyke and gets mocked, he objects to the idea of reading to him. Then, Sam threatens to make Bugs bathe in boiling oil, at which point Bugs agrees to read to Abba-Dabba. Bugs tries to escape in a variety of ways but to no avail. At one point, Bugs even escaped on a flying carpet from the palace, but Sam catches him.Meanwhile, Daffy tries to make off with the treasure. As he finished with it, he makes a quick check to see if he missed anything. That's when he encountered a magic lamp with a genie inside. Initially he rubbed the lamp thinking that with a little spit and polish, it would bring a few more bucks but it instead releases a genie whom Daffy pushes him back down thinking he was trying to steal the treasure. But the genie does not like what he was doing and chases him out of the cave by casting dangerous spells on him. Daffy then wanders through the desert in a desperate search for water.Back at the palace, Bugs is fed up with reading stories to the prince, so he dumps his book in the fire. As he was being threatened to be dunked in boiling oil, Bugs warns Sam not to throw him in a nearby hole which Sam eventually did. Little did Sam and Abba-Dabba realize that this was Bugs' ticket to freedom. So Bugs luckily escapes and ran into Daffy. Daffy was pleased to see Bugs and soon sees the palace, hoping to sell books there. Bugs tries to warn Daffy about the palace, but he would not listen. He found out the hard way and the two walk off into the sunset with Daffy missing all of his feathers.","language":"English","Reception":"Carrie Rickey, reviewer for the Village Voice, remarked that Bugs and Daffy \"used to be burrowers, explorers; now they're traveling salesmen imprisoned by the nuclear family.\"[2]","bugs_bunny's_3rd_movie:_1001_rabbit_tales":"Theatrical poster","box_office":"$78,350 (domestic)[1]","cinematography":"Nick Vasu","production_company":"Warner Bros. Animation","directed_by":"Friz Freleng Chuck Jones Robert McKimson","release_dates":"November 19, 1982","produced_by":"Friz Freleng","starring":"Mel Blanc|","running_time":"77 minutes","music_by":"Robert J. Walsh Carl Stalling (classic cartoons) Milt Franklyn (classic cartoons) William Lava (classic cartoons)","written_by":"Warren Foster Michael Maltese Tedd Pierce"}