{"country":"United States","distributed_by":"United Artists","Plot":"Robert Stroud (Lancaster) is imprisoned as a young man for committing a murder in Alaska. He is shown as a rebellious inmate, fighting against a rigid prison system: on his way to jail by train he breaks open the window to allow the suffocating inmates to breathe. His rebellious attitude puts him in conflict with Harvey Shoemaker (Malden), the warden of Leavenworth Prison.While in jail, Stroud learns that his mother (Ritter) tried to visit him but was denied and told to return later in the week. Outraged, he attacks a guard over the issue and the man is killed. Stroud is sentenced to death, but his mother runs a successful campaign and it is commuted to life in prison. The terms of the sentence require that he be kept in solitary confinement for the rest of his life.To break the monotony, Stroud adopts an orphaned baby sparrow as a pet. This starts a trend and he and the other convicts acquire birds, such as canaries, as gifts from the outside. Before long, Stroud has built up a collection of birds and cages. When they fall ill, he conducts experiments and comes up with a cure. As the years pass, Stroud becomes an expert on bird diseases and even publishes a book on the subject. His writings are so impressive that a doctor describes him as a \"genius\".Stroud later meets bird-lover Stella Johnson (Field) and agrees to go into business, marketing his bird remedies. He and Stella later marry, but his mother disapproves and this causes a rift between mother and son. He is abruptly transferred to the federal penitentiary at Alcatraz (the \"Rock\"), a new maximum security institution where he is not permitted to keep birds. He is now growing elderly but still shows a rebellious side, writing a history of the U.S. penal system that is suppressed by Shoemaker, now warden of the Rock.Still at odds with authority, Stroud nevertheless manages to help stop a prison rebellion in 1946 by throwing out the guns acquired by the convicts. He then assures the authorities that they can now re-enter the premises without fear of being shot. Although Stroud has been a thorn in his side for decades, Shoemaker acknowledges that he has never lied to him and takes him at his word.Although constantly denied parole, Stroud is eventually transferred to another prison in Missouri after a petition campaign. During the move, he meets several reporters and displays a range of knowledge on more than just birds, such as the technical details of a passing jet aircraft. He even gets to meet Thomas E. Gaddis (Edmond O'Brien), the author of the book based on his life.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 82% of 17 surveyed critics, both contemporaneous and modern, gave the film a positive review; the average rating is 7/10.[8] In discussing the film's prison setting, Variety wrote, \"Birdman reverses the formula and brings a new breadth and depth to the form.\"[9] A. H. Weiler of The New York Times called it \"a thoughtful yet powerful portrait that cleaves to the heart and mind despite its omissions\".[10] According to those who knew him while he was in prison, the mild-mannered characterization of Stroud, as presented in Gaddis' book and the subsequent film, was largely fiction. Former inmate Glenn Williams went so far as to say that Stroud \"was not a sweetheart; he was a vicious killer. I think Burt Lancaster owes us all an apology\".[11] He and another former convict, Jim Quillan, described the real Stroud as a \"jerk\", \"a guy that liked chaos and turmoil and upheaval... Always at somebody else's expense\". They regarded the film as a \"comedy... an excellent comedy\". The film was placed at #76 on the AFI's 100 Years... 100 Cheers.[12]","cinematography":"Burnett Guffey","directed_by":"John Frankenheimer","birdman_of_alcatraz":"original film poster by Saul Bass","release_dates":"July 3, 1962 (1962-07-03)|||||","Production":"This was to have been the American film debut for British director Charles Crichton until he clashed with Lancaster and was replaced by Frankenheimer.[6] According to Strother Martin, \"I had a nice role in Birdman of Alcatraz. They fired the original director, Charles Crichton, and I went out with him. I was replaced by Leo Penn who was eventually cut out of the picture entirely.\"[7]","produced_by":"Harold Hecht Stuart Millar Guy Trosper","starring":"Burt Lancaster Karl Malden Thelma Ritter Neville Brand Edmond O'Brien","running_time":"143 minutes","music_by":"Elmer Bernstein","edited_by":"Edward Mann","written_by":"Thomas E. Gaddis (book) Guy Trosper","budget":"$2,650,000[1]"}