{"based_on":"Heaven Can Wait  by Elaine May and Warren Beatty","country":"United States","distributed_by":"Paramount Pictures Roadshow Entertainment (Australia & New Zealand)[1]","Plot":"Lance Barton (Chris Rock) is a struggling comedian who is quite funny and confident in his personality, but is unable to bring his talent across in front of an audience. After being booed off stage one night he hears about an opportunity from his manager, Whitney Daniels (Frankie Faison), at the Apollo Theater, which is having a goodbye show due to its imminent closing. He is hoping to get a chance to prove himself in front of a real audience, when on his way home riding a bike Lance is distracted by Sontee Jenkins (Regina King). Not paying attention, he is hit by a semi truck and is instantly killed. Because of this, Lance is brought up to Heaven where he meets the angels, King (Chazz Palminteri) and Keyes (Eugene Levy) who reveal that Lance has died before his time, and can help Lance return to Earth.Lance and King then start searching for a body. After sorting through many, they find Charles Wellington III, (Brian Rhodes) an extremely rich businessman freshly drowned in his tub by his wife (Jennifer Coolidge) and assistant, Winston Sklar (Greg Germann). Lance wants nothing to do with the body until he discovers that Sontee, the woman he saw when he was Lance, is protesting Charles by handcuffing herself to a coffee table in his penthouse, demanding Charles' presence. Lance sees this as a chance to get to know her, but he is reluctant to permanently be Charles. Accordingly, he makes a deal with King to loan Charles' body until a more suitable body is found. Soon after, Charles returns from death, but with the witty soul of Lance Barton inside him. Only he and the angels can see him as Lance. Everybody else sees him as the middle-aged, rich, white Charles.Very unpopular in the past, the public and those closest to Charles start to notice a change in his personality. He transforms from a snobbish billionaire into a philanthropist. Despite recent events he continues to follow his comedy dreams through Charles, contacting his old manager Whitney and convincing him that he is Lance reincarnated. Through many \"humorous\" moments and issues, he gets Sontee to fall in love with him.All too soon, Charles' wife and Sklar's plans to murder him succeed as he is shot and killed by a hired assassin. Fulfilling the deal Lance and King set up earlier, King and Keyes then send Lance to return yet again to Earth as Joe Guy, a great comedian and more acceptable candidate who will die in a car accident. Joe returns from this accident unscathed, now with Lance's soul. After pulling off a successful performance at the Apollo and reconnecting with Whitney, King and Keyes re-emerge. They inform him that after their current conversation, he will not remember them, Lance, Charles or Sontee. As said, after the angels leave he no longer remembers the previous events or his previous lives. Even though he has lost his memory of Lance, he still has the characteristics of him. As a result, he reconnects with Whitney again and proceeds in getting Sontee to fall in love with him all over again, after meeting her in the theater for the first time as Joe Guy.","language":"English","Reception":"Down to Earth received negative reviews. On Rotten Tomatoes, the film has a score of 20% based on reviews from 96 critics, with the consensus: \"A toned down Chris Rock fails to bring a limp script to life as the movie moves from one gag to the next.\"[3] At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film received an average score of 34 based on 28 reviews, indicating \"generally unfavorable reviews\".[4]","box_office":"$71,186,502[2]","cinematography":"Richard Crudo","production_company":"Village Roadshow Pictures","directed_by":"Chris Weitz Paul Weitz","Soundtrack":"A soundtrack containing hip hop and R&B music was released on February 20, 2001 by Sony Music Entertainment. It peaked at 71 on the Billboard 200 and 64 on the Top R&B/Hip-Hop Albums.","release_dates":"February 12, 2001 (2001-02-12) (premiere)|February 16, 2001 (2001-02-16) (United States)||||","Box office":"The film grossed $64,186,502 in the USA, plus $7,000,000 outside the USA, for a combined gross of $71,186,502.[2]","produced_by":"Sean Daniel James Jacks Michael Rotenberg","starring":"Chris Rock Regina King Mark Addy Eugene Levy Frankie Faison Greg Germann Jennifer Coolidge Chazz Palminteri","running_time":"87 minutes[2]","music_by":"Jamshied Sharifi","edited_by":"Priscilla Nedd-Friendly","written_by":"Chris Rock Lance Crouther Ali LeRoi Louis C.K.","budget":"$49 million[2]"}