{"based_on":"Love and Other Natural Disasters by Allen Hannay III","country":" United States","distributed_by":"Atlantic Releasing","screenplay_by":"Peter Douglas","Plot":"Bubber Drumm is a Houston high school student. Rose Butts is an alcoholic, more than twice his age, and the mother of his girlfriend, Shirley. Bubber and Rose begin an affair after Bubber fixes Shirley up with his pal, Ransom McKnight.Bubber and Rose carry on their affair under the nose of her daughter until everything comes out in the open at a drive-in movie theater. To get even with Bubber and Rose for \"behaving badly\", Shirley pricks a hole in Rose's diaphragm. Shirley goes on to live with her father and Bubber moves in with Rose along with his pet tiger. The diaphragm incident results in Rose getting pregnant with Bubber's baby. The couple must decide whether to keep the baby and continue their May/December romance or part ways.non score music is by the Textones (Carla Olson, Phil Seymour, Joe Read, George Callins, Tom Jr Morgan)","Critical reception":"Roger Ebert of The Chicago Sun-Times gave the film 2 out of 4 stars although he did like certain aspects of the film:[2]Some movies don't seem to know what they're really about, and A Tiger's Tale is one of them... What does work in the film, however, is the unlikely relationship between Howell and Ann-Margret... The movie is top-heavy with plot, and what's good in it gets lost in the confusion.Janet Maslin of The New York Times:[3]A Tiger's Tale, which opens today at Loews 84th Street Six, is most notable for what it doesn't have: a heavy hand. The material has more than enough potential to become painfully silly, and Mr. Douglas's biggest accomplishment is making sure that doesn't happen.","box_office":"$89,000[1]","cinematography":"Tony Pierce-Roberts","production_company":"Vincent Pictures","a_tiger's_tale":"Theatrical poster","directed_by":"Peter Douglas","release_dates":"12 February 1988","produced_by":"Don Goldman Peter Douglas","starring":"Ann-Margret C. Thomas Howell Charles Durning Kelly Preston","running_time":"97 minutes","music_by":"Lee Holdridge, the Textones","External links":"","edited_by":"David Campling"}