{"Cast":"The MediaThe AdministrationMedicosThe UnionsAndRobbie Coltrane and Patsy Byrne had small bit parts. This was the final film appearance of Arthur Lowe who died shortly after his scenes were filmed.","country":"United Kingdom","Plot":"A new wing at Britannia Hospital is to be opened, and the Queen Mother – referred to as HRH – is due to arrive. The administrator of the hospital, Potter (Leonard Rossiter), is confronted with demonstrators protesting against an African dictator who is a VIP patient, striking ancillary workers (opposed to the exotic gastronomic demands of the hospital's private patients) and a less-than-cooperative Professor Millar (Graham Crowden), the head of the new wing. Rather than cancel the royal visit, Potter decides to go out and reason with the protestors. He strikes a deal with the protest leader — the private patients of Britannia Hospital are to be ejected and, in return, the protestors allow a number of ambulances into the hospital. However, unbeknown to the protestors, these ambulances actually contain the Queen Mother and her entourage.Mick Travis (Malcolm McDowell) is a reporter who is shooting a clandestine documentary about the hospital and its dubious practices. He manages to get inside and starts to investigate Millar's sinister scientific experimentation, including the murder of a patient, Macready (Alan Bates). As mayhem ensues outside, Travis is also murdered and his head used as part of a grim Frankenstein-like experiment which goes hideously wrong.Eventually, the protestors break into the hospital and attempt to disrupt Millar's presentation of his Genesis Project, in which he claims he has perfected mankind. In front of the assembled audience of Royalty and commoners, Genesis is revealed — a brain wired to machinery. Genesis is given a chance to speak and, in a robotic voice, utters the \"What a piece of work is a man\" speech from Hamlet, until it continuously repeats the line \"How like a God\".","language":"English","Reception":"Britannia Hospital was a box-office failure. British critics lambasted the film on release. However, Dilys Powell reviewed it positively, David Robinson listed it among his top ten for the year, and Geoff Daniel chose it as his film of the year.[4] EMI withdrew Britannia Hospital a month after release. Critic Ian Haydn Smith considers Britannia Hospital the \"nadir\" of Anderson's career. \"Replacing satire with broad comedy, the film fails on every level in its attempt to critique the state of the National Health Service\".[5] The film won the \"Audience Jury Award\" at Fantasporto.It has since been widely available on both VHS and DVD.","britannia_hospital":"Theatrical release poster","box_office":"$375,713[2]","cinematography":"Mike Fash","production_company":"EMI Films","directed_by":"Lindsay Anderson","release_dates":"27 May 1982 (1982-05-27)|||||","Production":"Britannia Hospital took a number of years to set up. It was originally called Memorial Hospital, and according to David Sherwin's diaries Going Mad in Hollywood, was going to be financed by 20th Century Fox under Sherry Lansing. The Fox deal fell through but the project was then saved by producer Clive Parsons who managed to set up financing through EMI under Barry Spikings. It was filmed at Shepperton Studios, using Friern Hospital in Barnet as the exterior of the hospital.","produced_by":"Clive Parsons Davina Belling","starring":"Malcolm McDowell Leonard Rossiter John Moffatt Fulton Mackay Joan Plowright Robin Askwith","running_time":"116 minutes","music_by":"Alan Price","edited_by":"Michael Ellis","written_by":"David Sherwin","budget":"$2.5 million[1]"}