{"country":"New Zealand","distributed_by":"Image Entertainment (US)","Release and legacy":"The film sold to many countries after playing in the market at the Cannes Film Festival. It holds a 68% \"Fresh\" rating on aggregate review site Rotten Tomatoes, based on 22 reviews. The sites consensus reads \"Peter Jackson's early low-budget shocker boasts a disgusting premise - aliens harvesting humans for fast food - that gives the budding auteur plenty of room for gross-out visuals and absurd cleverness.\"[3]Despite this wide acclaim the film failed to impress at the 1989 NZ Film and Television Awards, winning no awards. As well as this, a TVNZ executive spoke out the next day about whether or not the film industry needed films like Bad Taste. The film did however still win favour among the country's cult film audiences.[2]The banning of an already cut version of Bad Taste in Queensland, Australia, three weeks into its run, led to the firing and dissolution of the Queensland Film Board of Review in 1990. The film had to be trimmed for release in Australia at the time, as the OFLC felt the gore too excessive. When the film was released on Home Video in Australia, the cover had the words \"BANNED IN QUEENSLAND\" printed onto the top left corner of it.[4] The uncut version was released by Universal Home Entertainment on DVD in 2005.Apart from the uncut version, there is a heavily cut FSK 18-rated and an even more censored FSK 12-rated version in Germany available on DVD. The earlier is cut by approximately 6 minutes, the latter by approximately 10 minutes. The film was finally released theatrically in 2000, thirteen years after its production. The German posters used the advertising tagline \"from the director of the Lord of the Rings\".During his acceptance speech at the 2004 Academy Awards, Jackson mentioned Bad Taste (along with Meet the Feebles), joking that it had been \"wisely overlooked by the Academy.\"[5]On 15 September 2001, the Michael Fowler Center in Wellington, New Zealand hosted Armageddon. One of the main features for the 2001 convention was the cast of Bad Taste attending for a quick question and answer session on the main stage, and a screening of the film.The cast members that attended were; Craig Smith (Giles), Pete O'Herne (Barry), Mike Minett (Frank), Terry Potter (Ozzy), Ken Hammon (Writer, 3rd Class Alien), and Dean Lawrie (Lord Crumb SPFX Double, 3rd Class Alien).","Plot":"The Astro Investigation and Defence Service (AIDS) sends Derek, Frank, Ozzy, and Barry to investigate the disappearance of everyone in the town of Kaihoro, New Zealand. They find the town has been overrun by space aliens disguised as humans in blue shirts. Barry kills one of the aliens and is attacked by others. After Derek notifies Frank and Ozzy, he begins torturing Robert, an alien they caught earlier. Robert's screaming attracts a number of aliens in the area. Derek kills the would-be rescuers, but he is attacked by Robert and falls over a cliff, to his presumed death.Meanwhile, a charity collector named Giles is passing through Kaihoro. He is attacked by Robert, who has been eating the brains of the alien killed earlier by Barry. Giles escapes in his car and stops at a nearby house for help. Another alien answers the door and captures Giles. He later wakes up in a tub of water and is told he is about to be eaten. Derek also wakes up to find that he landed in a seagull's nest. He also finds that his brain is leaking out the back of his head, so he stuffs it back in and uses a hat to hold it in place.That night, Frank, Ozzy, and Barry sneak into the aliens' house and find a room filled with bloody cardboard boxes. They kill an alien by ripping of it´s head and Frank wears its shirt to infiltrate an alien meeting. He finds out that the residents of Kaihoro have been harvested for alien fast food. Robert vomits into a bowl, which the aliens dine on, including the disguised (and disgusted) Frank. He escapes and tells the team members of the plan. They sneak out to save Giles as the aliens sleep.At sunrise, they try to leave but are attacked by the aliens. Derek's hat is shot off, and he starts losing more of his brain, so he uses his belt as a headband. He grabs a chainsaw from the boot of his car and heads for the alien house. As the boys leave with Giles, the alien leader (Lord Crumb) and his followers transform into their true form and follow. Ozzy uses a rocket launcher to blow up Frank's car, which has been overrun by aliens.Frank and Ozzy hunt for Lord Crumb and kill a lot of aliens along the way. Meanwhile, Derek kills an alien with his chainsaw and replaces the missing parts of his brain with alien brain. An alien prepares to shoot Frank and Ozzy, but it is beheaded by Derek after he bursts through the wall behind it. Frank and Ozzy are shocked to see him alive.As they run, Lord Crumb shoots Ozzy in the leg and Frank fires his rocket launcher at the leader, but it misses and almost hits Derek, finally taking out a sheep in a nearby meadow. Derek is knocked out by the alien leader and the house transforms into a giant space ship, which blasts off into space with Derek still aboard.On board, Derek looks out the window to see that he is leaving Earth. Lord Crumb hears a strange, loud noise and investigates. He is killed by Derek, who ambushes him and cuts the alien in half with his chainsaw. Derek proclaims into his phone: \"I'm born again! I'm coming to get you bastards!\" He then puts on the alien leader's skin, laughing maniacally as he rockets towards the alien planet. On Earth, the guys drive away into the sunset in Derek's car.","language":"English","box_office":"$150,000","cinematography":"Peter Jackson","production_company":"WingNut Films New Zealand Film Commission","directed_by":"Peter Jackson","Production notes":"Much of the film was shot in and around Jackson's hometown of Pukerua Bay, north of Wellington, New Zealand using a 25-year-old 16mm camera. Originally begun as a short film, Bad Taste was shot primarily on weekends over the course of four years, at an initial cost of around $25,000. Toward the end of the shoot the New Zealand Film Commission invested around NZ$235,000 into the film to ensure its completion. Heavily influenced by special effects pioneer Tom Savini, Jackson incorporated many absurdly gory special effects.[2]Jackson himself plays at least two acting roles, and his friends and workmates play most of the rest. In one early scene halfway down a cliff, careful editing, utilising shots taken months apart, makes it possible for the two characters, Agent Derek and the alien Robert (both played by Jackson), to fight one another (Robert has a beard, Derek does not).Bad Taste begins Jackson's penchant for using the Morris Minor in his films - Giles drives a Morris Minor. Subsequently, every car in Meet the Feebles is a Morris Minor (including a limousine) and several are seen in Braindead.The firearms used in the film were all fake. They were made using aluminium tubing and the actors had to shake them to simulate the recoil. A flash and sound effect was added later during post production.All the alien masks in the film were baked in Peter Jackson's mother's oven.Kaihoro, the name of the town whose inhabitants are butchered, is a Māori word coined by Jackson and his crew early in the shooting of the film. It has two parts - \"kai\" which means food and \"horo\" which means town or village. Foodtown is also the name of a New Zealand chain of grocery stores. Kai horo in Te Reo Maori means 'greedy' - but is made up of the words Kai (food) and horo (quickly) which, loosely translated, could be said to mean 'fast food', a play on the fate of the villagers.The sheep in the film was to have played a larger role as a running gag, being surprisingly aggressive and chasing \"The Boys\" at various points throughout. This was reduced to the single sheep/rocket launcher moment of the final film.","release_dates":"11 December 1987 (1987-12-11) (New Zealand)|16 June 1989 (1989-06-16) (United States)||||","produced_by":"Peter Jackson","starring":"Terry Potter Pete O'Herne Peter Jackson Mike Minett Craig Smith","running_time":"92 minutes[1]","bad_taste":"Release poster","music_by":"Michelle Scullion","edited_by":"Jamie Selkirk Peter Jackson","written_by":"Ken Hammon Tony Hiles Peter Jackson","budget":"$30,000"}