{"based_on":"Children of a Lesser God by Mark Medoff","country":"United States","distributed_by":"Paramount Pictures","Plot":"Sarah Norman (Marlee Matlin) is a troubled young deaf woman working as a cleaner at a school for the deaf and hard of hearing in New England. An energetic new teacher, James Leeds (William Hurt), arrives at the school and encourages her to set aside her insular life by learning how to speak aloud.As she already uses sign language, Sarah resists James's attempts to get her to talk but she is resistant because of a history of rape. Romantic interest develops between James and Sarah and they are soon living together, though their differences and mutual stubbornness eventually strains their relationship to the breaking point, as he continues to want her to talk, and she feels somewhat stifled in his presence.Sarah leaves James and goes to live with her estranged mother (Piper Laurie) in a nearby city, reconciling with her in the process. However, she and James later find a way to resolve their differences.","Title":"The title of the film comes from the twelfth chapter of Alfred Lord Tennyson's Idylls of the King. The stanza in which the line is contained reads as follows:I found Him in the shining of the stars, I marked Him in the flowering of His fields, But in His ways with men I find Him not. I waged His wars, and now I pass and die. O me! for why is all around us here As if some lesser god had made the world, But had not force to shape it as he would, Till the High God behold it from beyond, And enter it, and make it beautiful? Or else as if the world were wholly fair, But that these eyes of men are dense and dim, And have not power to see it as it is: Perchance, because we see not to the close;— For I, being simple, thought to work His will, And have but stricken with the sword in vain; And all whereon I leaned in wife and friend Is traitor to my peace, and all my realm Reels back into the beast, and is no more. My God, thou hast forgotten me in my death; Nay—God my Christ—I pass but shall not die.[8][9]","language":"English|American Sign Language|","Reaction":"Children of a Lesser God received generally positive reviews. On review aggregation website Rotten Tomatoes, the film received a score of 81%.[11] Particular praise was given to the film's two leads. Richard Schickel of TIME Magazine said of Matlin, \"she has an unusual talent for concentrating her emotions--and an audience's--in her signing. But there is something more here, an ironic intelligence, a fierce but not distancing wit, that the movies, with their famous ability to photograph thought, discover in very few performances.\"[12] Roger Ebert of the Chicago Sun-Times gave the film 3 out of a possible 4 stars, describing the subject matter as \"new and challenging\", saying he was \"interested in everything the movie had to tell me about deafness.\" He continued, \"The performances are strong and wonderful - not only by Hurt, one of the best actors of his generation, but also by Matlin, a deaf actress who is appearing in her first movie. She holds her own against the powerhouse she's acting with, carrying scenes with a passion and almost painful fear of being rejected and hurt, which is really what her rebellion is about.\"[13] Paul Attasanio of the Washington Post said of the film, \"This is romance the way Hollywood used to make it, with both conflict and tenderness, at times capturing the texture of the day-to-day, at times finding the lyrical moments when two lovers find that time stops.\" He goes on to say of Matlin, \"The most obvious challenge of the role is to communicate without speaking, but Matlin rises to it in the same way the stars of the silent era did -- she acts with her eyes, her gestures.\"[14]There was some criticism that the film was told entirely from a hearing perspective, for a hearing audience. The film is not subtitled (neither the spoken dialogue nor the signing); instead, as pointed out by Ebert, the signed dialogue is repeated aloud by Hurt's character, \"as if to himself\".[13]Hurt, Matlin, and Piper Laurie (in her role as Sarah's mother, Mrs. Norman) all went on to receive Academy Award nominations for their performances. Only Matlin won, becoming the first and only deaf performer to win to date, as well as the youngest winner in the Lead Actress category.","box_office":"$31,853,080 (North America)","cinematography":"John Seale","directed_by":"Randa Haines","release_dates":"October 3, 1986 (1986-10-03)|||||","Production":"The movie was shot primarily in and around Saint John, New Brunswick, with the Rothesay Netherwood School serving as the main set. Aside from locations in Saint John and Rothesay Netherwood School, sets were constructed by Saint John local Keith MacDonald.","Box office":"Although budget details are not known, the film opened at number 5 at the North American box office with an opening weekend gross of $1,909,084. The film stayed in the Top 10 for eight weeks and grossed a total of $31,853,080 in North America.[10]","children_of_a_lesser_god":"Theatrical release poster","produced_by":"Burt Sugarman|Patrick J. Palmer|","starring":"Marlee Matlin|William Hurt|Piper Laurie|Philip Bosco|","running_time":"119 minutes","music_by":"Michael Convertino","edited_by":"Lisa Fruchtman","written_by":"Hesper Anderson|Mark Medoff|","budget":"$2 million[1]"}