{"based_on":"Drugstore Cowboy  by James Fogle","country":"United States","distributed_by":"International Video Entertainment Avenue Pictures","Plot":"The story follows Robert \"Bob\" Hughes (Matt Dillon) and his crew of drug addicts as they travel across the U.S. Pacific Northwest in 1971, supporting their habit by robbing pharmacies and hospitals. After a tragedy strikes the group, Bob decides to try to \"go straight\", but finds that there is more to extricating himself from the drug user's lifestyle than just giving up drugs.","language":"English","Reception":"The film was very well received critically, being listed on the Top Ten list of both Gene Siskel and Roger Ebert for films released in 1989. It holds a rare 100% rating at Rotten Tomatoes, with an average score of 8/10 based on 27 reviews.[8] Review aggregator Metacritic assigned the film a weighted average score of 82 based on 15 reviews indicating \"Universal Acclaim\".[9]Drugstore Cowboy won the following awards:","box_office":"$4.7 million[1]","cinematography":"Robert Yeoman","directed_by":"Gus Van Sant","drugstore_cowboy":"Theatrical release poster","Music":"The soundtrack includes songs that are contemporaneous with the film's setting, along with original music by Elliot Goldenthal. It is one of his earliest works; in it he does not use an orchestra but a whole range of instruments treated in a synthesizer.[6] The score and soundtrack were also the first that Goldenthal worked on with Richard Martinez, a music producer whose \"computer expertise and sound production assistance\" became the basis for frequent subsequent collaborations.[7] AllMusic rated this soundtrack three stars out of five.[5]","release_dates":"October 6, 1989 (1989-10-06) (United States)|||||","Production":"Drugstore Cowboy was filmed mainly around Portland, Oregon, including in an area in the Pearl District that used to be a railyard, with a viaduct going over it.[3] The Lovejoy Columns, which formerly held up the viaduct and feature outsider artwork, are featured in the movie.[4]","produced_by":"Karen Murphy Cary Brokaw Nick Wechsler","starring":"Matt Dillon|Kelly Lynch|James Remar|James LeGros|Heather Graham|William Burroughs|","running_time":"102 minutes","music_by":"Elliot Goldenthal","edited_by":"Mary Bauer Curtiss Clayton","written_by":"Gus Van Sant Daniel Yost","budget":"$2.5 million[1]"}