{"distributed_by":"Les films du losange","caché":"Theatrical release poster","Plot":"The quiet life of a Paris family is disturbed when they receive a series of surveillance tapes of the exterior of their residence from an anonymous source. Georges Laurent is the successful host of a French literary television program, living with his wife Anne, a book publisher, and their 12-year-old son Pierrot. Unmarked videocassettes arrive on their doorstep, tapes that show extended observation of their home's exterior from a static street camera that is never noticed. At first passive and harmless, but later accompanied by crude, disturbing crayon drawings, the tapes lead to questions about Georges' early life that disrupt both his work and marriage. But because the tapes do not contain an open threat, the police refuse to help the family.One videotape leads Georges to the modest HLM apartment of Majid, an Algerian man whose parents worked for Georges' family before they were killed in the Paris massacre of 1961. The orphaned Majid remained in the Laurent home, and the parents at one time intended to adopt him. Georges confronts Majid about the tapes, but he denies involvement. However, the encounter intensifies his guilty flashbacks and recurring nightmares of a young Majid spitting blood, cutting off a rooster's head, and menacing him.One day Pierrot does not come home from school and Anne cannot locate him. Georges and Anne suspect that he is kidnapped by Majid. They go to the police, who accompany Georges to Majid's apartment. There they find Majid's son, and father and son both deny knowledge of a kidnapping. The police arrest them but they are released the next morning. Pierrot returns home shortly afterwards; he had spent the night at a friend's house without telling anyone. When Anne scolds Pierrot, he accuses her of adultery because he had witnessed Anne permitting a few ambiguous caresses from a family friend.At Majid's invitation, Georges returns to the apartment, where, after stating that he had nothing to do with the surveillance, says he wanted Georges to be present for what follows: he kills himself by slashing his own throat. Now Anne insists Georges explain the whole story with Majid, and he tells her that they lived together in his parents' household. He was six years old when he tricked Majid into cutting off the head of the family's rooster, then told his parents that Majid did this to scare him. This sufficiently disturbed his parents that they sent Majid away to an orphanage.Majid's son comes to the television studio and finds Georges, who denies responsibility for Majid's unhappiness and death. The younger man denies knowledge of the tapes, saying he only wanted to know how Georges felt about being the cause of his father's death. Georges angrily departs for home, where he takes two sleeping pills and goes to bed.In what then appears to be Georges' dream or just a flashback, a man and woman arrive at Georges' childhood home in a 1960 Peugeot.[5] They enter the house, leave with an Arab boy who protests, who resists getting in the car, and runs away before he's finally caught and overcome by the man. He's forced into the back seat with the woman, and the man drives the car away.Under the credits, Pierrot and Majid's son meet in front of Pierrot's school, though their conversation cannot be heard. Majid's son leaves, as does Pierrot with a couple of his friends soon after.","language":"French","Reception":"Review aggregator Rotten Tomatoes reports an 89% approval rating based on 131 reviews,[13] and Metacritic currently assigns the film an 83/100 (\"universal acclaim\") based on 37 reviews.Deborah Young from Variety stated, \"The tight pacing of Michael Hudecek and Nadine Muse's editing keeps the story fluid and focused but very concise, commanding audience attention from start to finish.\"[14] Kirk Honeycutt at the The Hollywood Reporter stated, \"In unraveling a nearly forgotten secret in the life of a self-satisfied and smug French intellectual, Haneke probes deeply into issues involving guilt, communication and willful amnesia.\"[15] Roger Ebert from Chicago Sun-Times wrote, \"...a perplexing and disturbing film of great effect, showing how comfortable lives are disrupted by the simple fact that someone is watching.\"[16] Ebert later revisited the film as an entry in his \"Great Movies\" series, discussing nuances of the plot and direction (and the implications they might have) in more detail.[17][18] The Guardian's Peter Bradshaw gave the film five out of five stars, describing it as \"one of the great films of this decade\" and \"Haneke's masterpiece\".[12]Andrew Sarris from The New York Observer stated, \"Too much of the plot's machinery turns out to be a metaphorical mechanism by which to pin the tail of colonial guilt on Georges and the rest of us smug bourgeois donkeys.\"[19] Mick LaSalle of the San Francisco Chronicle found the film fraudulent \"in its style, technique and ultimate message,\" and that the director does \"everything he can to bore the audience, and the audience tries not to fall asleep or flee the theater,\" making the film an \"exercise in pain\".[20]Caché premiered at the 2005 Cannes Film Festival and received three prizes. Haneke won for Best Director, while the film was honored by the jury for the critic's award with the FIPRESCI prize,[21] and also with the Prize of the Ecumenical Jury. The film won several awards at the 2005 European Film Awards, including Best European Film, Best European Director (Haneke), Best European Actor (Daniel Auteuil), and Best European Editor (Michael Hudecek and Nadine Muse).[22][23]Hidden was listed 1st in The Times 'best 100 films of the decade' feature,[24] 44th in The Daily Telegraph's equivalent list,[25] and 36th in The Guardian's.[26]The film was ranked #73 in Empire magazine's \"The 100 Best Films Of World Cinema\" in 2010.[27]The film was submitted as Austria's entry for the Academy Award for Best Foreign Language Film at the 78th Academy Awards, but was disqualified as French is not predominantly the language of Austria.[28]","box_office":"$16.2 million[2]","cinematography":"Christian Berger","production_company":"France 3 Cinéma Canal+ Bavaria Film Wega Film","directed_by":"Michael Haneke","release_dates":"5 October 2005 (2005-10-05)|||||","Production":"Caché was produced by Margaret Ménégoz and Veit Heiduschka and received international backing from Films du Losange, Wega-Film, Bavaria-Film and BIM Distribuzione which are respectively based in France, Austria, Germany and Italy.[6][7][8][9][10] It is directed by Michael Haneke, and is the first film he made using high-definition video cameras;[11] it also has no film score.[12]","produced_by":"Veit Heiduschka, Michael Katz, Margaret Menegoz","starring":"Juliette Binoche|Daniel Auteuil|Maurice Bénichou|","running_time":"118 minutes[1]","edited_by":"Michael Hudecek|Nadine Muse|","written_by":"Michael Haneke","budget":"€8 million ($10.5 million)"}