{"country":"United States","distributed_by":"Clarius Entertainment Freestyle Releasing[1]","Plot":"Oren Little (Douglas), a realtor by trade, develops self-absorption, turning his back on his neighbors and shunning the notion of kindness to others, after his wife dies; part of his self-absorption is having no patience for children, not even his own now-adult son, from whom he has been estranged. He has a next-door neighbor, Leah (Keaton), whose own husband has likewise died, never having had any children of her own, which leads her to throw her soul and her tears into reviving a singing career that had stagnated.Then, one day, Oren's estranged son suddenly leaves his father in charge of his own nine-year-old daughter Sarah (Sterling Jerins), a granddaughter whom Oren never knew existed. When Oren's estranged son drops Sarah off at his home, needing his father to take care of her, neither Oren nor Leah, each of whom are lonely souls, have any reason to suspect that Sarah's involvement with their lives would enable them to heal their emotional wounds.","language":"English","Reception":"And So It Goes received mostly negative reviews from critics. It currently holds a 18% rating on Rotten Tomatoes based on 83 reviews with the consensus: \"And So It Goes aims for comedy, but with two talented actors stuck in a half-hearted effort from a once-mighty filmmaker, it ends in unintentional tragedy\".[8] Another review aggregator, Metacritic, which assigns a rating out of 100 top reviews from mainstream critics, calculated a score of 38 based on 31 reviews, indicating \"generally unfavorable reviews\".[9]Film critic Leonard Maltin gave the film a positive review, saying \"Director Rob Reiner's ′And So It Goes,′ offers more than juicy leading roles to stars Michael Douglas and Diane Keaton.\"[10]Film critic Richard Corliss gave the film a negative review, saying \"And So It Goes may touch the frayed heartstrings of some older viewers, but it's pretty bad - the failed attempt to Heimlich a venerable movie genre.\"[11]","box_office":"$25,312,387[3]","cinematography":"Reed Morano","production_company":"Castle Rock Entertainment Foresight Unlimited Envision Entertainment","Marketing":"The first trailer for the film was released on May 9, 2014.[7]","directed_by":"Rob Reiner","and_so_it_goes":"Theatrical release poster","release_dates":"July 25, 2014 (2014-07-25)|||||","Production":"Filming began in June 2013 in Connecticut.[4][5] Shooting also took place in California and Greater Manchester.On December 17, 2013, it was announced that Marc Shaiman had composed the music for the film.[6]","produced_by":"Alan Greisman Mark Damon Rob Reiner","starring":"Michael Douglas Diane Keaton Sterling Jerins Paloma Guzmán Frances Sternhagen Frankie Valli","running_time":"94 minutes","music_by":"Marc Shaiman","External links":"","edited_by":"Dorian Harris","written_by":"Mark Andrus","budget":"$18 million[2]"}