{"based_on":"Best Foot Forward 1943 book  by John Cecil Holm","country":"United States","distributed_by":"Metro Goldwyn Mayer","Plot":"The story centers around Lucille Ball who plays herself against the backdrop of a military academy full of frisky boys. Ball is the reluctant guest of a diminutive cadet, Bud Hooper (Tommy Dix), who wrote her a \"mash note\" and invitation to be his date at a school prom.Ball's publicity man, Jack O'Riley (William Gaxton), seizes upon the situation as a perfect PR stunt and convinces her to travel 3,000 miles to join Hooper at Winsocki Military Academy's dance. When Ball actually shows up, mayhem ensues. Hooper, who never dreamed she would accept, has to disinvite his girlfriend, Helen (Virginia Weidler), and ask Ball to pretend to be Helen, lest the actress herself not pass muster with the institution's screening committee.Helen fights back while Hooper tries to keep Ball from the clutches of other cadets who want to steal her for themselves. Meanwhile, Harry James and his orchestra perform various songs, including \"The Flight of the Bumblebee\". The cast also sing and dance their way through such numbers as \"Buckle Down, Winsocki\" (the tune co-opted in the 1960s for \"Buckle Up for Safety\"), \"Wish I May,\" \"Three Men on a Date\", \"Alive and Kickin'\", \"The Barrelhouse\", \"The Boogie-Woogie and the Blues\", and \"Ev'ry time.\" [The soundtrack CD also includes the cut \"What Do You Think I Am?\"]","language":"English","box_office":"$2,704,000[1]","best_foot_forward":"Original window card","cinematography":"Leonard Smith","directed_by":"Edward Buzzell","release_dates":"October 8, 1943 (1943-10-08)|||||","produced_by":"Arthur Freed","starring":"Lucille Ball William Gaxton Virginia Weidler","running_time":"94 minutes","Box Office":"According to MGM records the film earned $2,051,000 in the US and Canada and $653,000 elsewhere resulting in a profit of $398,000.[1]","music_by":"Lennie Hayton","edited_by":"Blanche Sewell","written_by":"Irving Brecher Fred F. Finklehoffe Dorothy Kingsley","budget":"$1,162,000[1]"}