{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer The Weinstein Company","Plot":"Former military personnel Clay Beresford (Hayden Christensen) is in love with Samantha \"Sam\" Lockwood (Jessica Alba), his mother's personal assistant. Clay requires a heart transplant. Dr. Jack Harper (Terrence Howard) is Clay's heart surgeon and friend. Clay asks Dr. Harper to arrange his elopement with Sam. They marry privately at midnight, then Clay goes to the hospital for the operation. While Sam and Clay's mother, Lilith (Lena Olin), await completion of his surgery, Clay encounters anesthesia awareness.The surgical pain causes Clay to have a clairvoyant experience exposing Dr. Harper's plot to murder Clay, also revealing that Sam worked at the hospital under Dr. Harper and has conspired with him against Clay. Sam's plan was to poison the donor heart (by injecting Adriamycin) to cause its rejection, thus murdering Clay to collect insurance money to pay off Dr. Harper's malpractice lawsuits. The scheme unravels and Lilith, realizing what has happened, sacrifices herself so that Clay can live, who is close to death. She commits suicide so her heart can be switched for the poisoned one, and save Clay. Though Sam tries to get away with what she did, Dr. Harper feels guilty and he holds onto proof so she can be charged too. Another surgical team takes over the operation, as Clay barely clings to life and as the conspirators are running away. The new team takes Lilith's heart and transplant's it into Clay's body, as Clay and Lilith have their final moments together in spirit (out of body experience). The new head surgeon announces that Clay has come back to life, as the new team stitch Clay's wound. Clay, in spirit, is still in the afterlife with Lilith, tries to commit suicide to stay with his mother. Clay makes his new heart stop beating and the surgeons have to use the defibrillator in attempt to revive Clay. As Clay resists being revived, Lilith forces Clay (in the \"afterlife-world\") to revisit a scene from his childhood, when Lilith accidentally killed Clay's abusive father. This scene reveals the truth for Clay and connects his childhood flashbacks. After seeing this scene, Clay gives away to revival, and before the surgeons can shock is body again, Clay allows his new heart to begin beating. As Harper narrates his thoughts ending with \"He is awake\", in the operating room, the surgeons finally remove the eye tapes and Clay opens his eyes.","language":"English Japanese","Reception":"The film was not screened in advance for critics. The film opened at #5 at the U.S. Box office in its first opening weekend. As of July 11, 2008 it had a domestic box office gross of $14,377,198 in the U.S.,[1] and a total of $32,685,679 worldwide.Awake received generally negative reviews upon release. On the review aggregator Rotten Tomatoes, 23% of 61 critics gave the film positive reviews.[2] On Metacritic, the film had an average score of 33 out of 100, based on 17 reviews.[3] Dennis Harvey of Variety said the film \"does have an attention-getting plot hook, but piles on too many narrative gimmicks to maintain suspense or credibility.\"[4] Roger Ebert of the Chicago Sun-Times defended the film, saying, \"I went to a regular theater to see it Friday afternoon, knowing nothing about it except that the buzz was lethal, and sat there completely absorbed. ... I did not anticipate the surprises, did not anticipate them piling on after one another, got very involved in the gory surgical details, and found the supporting soap opera good as such things go\".[5] Frank Lovece of Film Journal International said he appreciated it as, \"A pulp-fiction suspense drama that doesn't imagine it's anything else ... delivering on its paperback promise and not gussying itself up with any pretensions to emotional or psychological insight\".[6] Frank Scheck of The Hollywood Reporter said \"[Harold] succeeds in creating a quietly ominous tone that never lets up, with this being the rare modern horror effort that relies on suspense rather than bloodshed.\"[7]A group representing anesthesiologists in Ontario criticized the film following its release for having its \"science completely wrong.\" Ontario's Anesthesiologists, a section of the Ontario Medical Association, declared numerous scientific and procedural distortions in the film such as the presentation of improper anesthetic techniques. The group disputes the film's claim that anaesthesia awareness occurred as frequently as one in every 700 patients, although this in turn is debated by anesthesia awareness advocate Carol Weihrer.[8][9]The film was nominated for two Razzie Awards including Worst Actress for Jessica Alba and Worst Screen Couple for Alba and Hayden Christensen, but lost to Lindsay Lohan for I Know Who Killed Me.","awake":"Theatrical release poster","box_office":"$32,685,679","Home video":"The Region 1-DVD was released on March 4, 2008. Bonus material included an audio commentary by writer/director Joby Harold, seven deleted scenes with optional audio commentary, a behind the scenes featurette, and storyboard-to-film comparisons.A \"Blockbuster Exclusive\" edition was also available for rental through Blockbuster Video which includes audio commentary, theatrical trailer, as well as outtakes and bloopers. However, it does not include the other extras included with the original DVD release.A Blu-ray version was released on November 18, 2008.","cinematography":"Russell Carpenter","directed_by":"Joby Harold","release_dates":"November 30, 2007 (2007-11-30)","Production":"Portions of Awake were filmed on Fordham University's Lincoln Center campus (Lowenstein Hall is converted to look like a hospital; the statue of \"St. Peter: Fisher of Men\" is visible in the film). In addition, many scenes, including Dr. Jack Harper's office, the cafeteria where Lilith commits suicide, and the elevator bank, were filmed in Bellevue Hospital.","produced_by":"Jason Kliot John Penotti Joana Vicente Fisher Stevens","starring":"Hayden Christensen Jessica Alba Terrence Howard Lena Olin Arliss Howard","running_time":"84 minutes","music_by":"Graeme Revell (Theme) Samuel Sim","edited_by":"Craig McKay","written_by":"Joby Harold","budget":"$8.6 million"}