{"based_on":"Around the World in Eighty Days  by Jules Verne","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"David Titcher David Benullo David Goldstein","Plot":"In the late 19th century, a Chinese man, Lau Xing, robs the Bank of England. To evade the police, Xing becomes the valet for Phileas Fogg, an inventor, taking the pseudonym Passepartout. Phileas, just before Xing arrived, had been trying to break the 50-mph speed barrier, and after succeeding with the help of Passepartout, they head to the Royal Academy of Science. There, Fogg is insulted by the other \"brilliant minds\", in particular Lord Kelvin, who believes that everything worth discovering has already been discovered. After a debate between the scientists about the bank thief, Phileas is pressured into a bet to see whether he can travel around the world in 80 days. If he wins, he will become Minister of Science in Lord Kelvin's place, if not, he will destroy his lab and never invent anything again. Phileas and Xing start their journey around the world, taking a carriage and leaving London after a confrontation with Inspector Fix, a corrupt officer hired by Lord Kelvin to stop them.Xing and Phileas journey to Paris. Pretending to take Phileas to a convention with Thomas Edison, Xing leads him to an art school where Phileas meets Monique La Roche, a would-be impressionist. There, Xing is attacked by disguised warriors, the Black Scorpions, sent by General Fang, a female Chinese warlord who is after the Jade Buddha that he stole. Fang had previously given it to Kelvin in exchange for military assistance in China. When Monique learns of Phileas's ambition, she convinces them to take her with them. They depart in a hot-air balloon, chased by Fang's warriors.Whilst on the Orient Express, Monique learns that Xing is trying to return the Jade Buddha back to his village, and is travelling with Phileas to get there quickly. Monique keeps his secret in exchange for him convincing Phileas to let her travel with him. They travel to Turkey, where the train stops. Guards climb onboard and inform the trio that they are greeted by Prince Habi. During the Prince's banquet, he orders Monique to stay as his seventh wife while the men are ordered to leave. The men blackmail Prince Habi into releasing Monique using a prized but apparently flimsy \"The Thinker\" statue of the Prince. The statue is destroyed, much to Habi's anger, but the trio escape from the guards. Lord Kelvin, learning that Phileas has been abetting a thief's escape, orders the British colonial authorities in India to arrest both. Xing notices this and warns his companions, disguising themselves as Indian women to evade capture and successfully flee to China.Xing leads his friends to his village, Lanzhou, where they are happily greeted. His real identity is revealed and they are held captive by the Black Scorpions. Xing challenges the leader of the group to a fight, during which he is joined by the martial arts masters of the \"Ten Tigers of Canton\", of which Xing is a member. The Tigers drive the Black Scorpions from the village and free the Westerners. The Buddha is returned to the village temple. Phileas, feeling used by Xing and Monique, leaves for San Francisco alone, only to be proven wrong when the latter decide to help him win his bet. In New York City, Fang's disguised minions trick the trio to an ambush site. Fang reveals the nature of their arrangements with Lord Kelvin to take Lanzhou and tap the jade reserves underneath it. A battle against Fang and her minions commences in the workshop where the Statue of Liberty is being constructed, resulting in Phileas missing a boat to help Xing, Fang being knocked out by Monique with a punch (revealing Monique to be the fabled 11th Tiger) and Fang's minions being either killed or knocked out. Phileas feels he has lost, but the other two say they may still make it if they catch the next ship.They board an old ship and Phileas convinces the captain to let him build a plane out of the ship's old wood in exchange for a new ship. Using an altered version of the Wright brothers' plans, Phileas builds the plane while the ship's crew builds a catapult to launch it into the sky. They reach London, where the machine falls apart and they crash in front of the Royal Academy. Lord Kelvin sends police to arrest them for robbing the bank, in order to stop them from making it to the top step of the Academy, and proclaims himself the victor when Big Ben strikes noon, seemingly ending the wager. Monique, Fix and other ministers attest to Kelvin's unfair methods and his bullying nature, but Kelvin scoffs at them. In the process he insults Queen Victoria, who arrives on the scene. She learned that he had sold her arsenal to Fang in exchange for jade mines in China thanks to one of his aides. Kelvin is arrested and sent to prison, and Phileas realizes he is one day early thanks to crossing the international date line. He victoriously ascends the stairs of the Academy and kisses Monique.","language":"English French Mandarin Chinese Hindi","Critical reception":"Around the World in 80 Days was met with mixed reviews. Review aggregator Rotten Tomatoes gives the film a 31% approval rating, based on 127 reviews, with an average score of 4.8 out of 10, with the site's consensus stating: \"Hit-and-miss family fare that bears only the slightest resemblance to Verne's novel.\"[2] Metacritic gives the film a weighted score of 49 out of 100, based on 33 sampled reviews, indicating \"mixed to average reviews.\"[3] While some reviewers[specify] criticized it for having little to no resemblance to the novel it is based on, others such as Roger Ebert praised it for its visual style and for being \"goofy fun\".[4] In 2014, the Los Angeles Times listed the film as one of the most expensive box office flops of all time.[5] The film was nominated for two Razzie Awards - Worst Remake or Sequel and Worst Supporting Actor (Arnold Schwarzenegger).[6]","box_office":"$72.2 million[1]","around_the_world_in_80_days":"Theatrical release poster","cinematography":"Phil Meheux","production_company":"Walt Disney Pictures Walden Media","directed_by":"Frank Coraci","release_dates":"June 13, 2004 (2004-06-13) (Los Angeles, California)|June 16, 2004 (2004-06-16) (United States)||||","produced_by":"Bill Badalato Hal Lieberman","starring":"Jackie Chan|Steve Coogan|Cécile de France|Jim Broadbent|Ian McNeice|Karen Joy Morris|","running_time":"120 minutes[1]","music_by":"Trevor Jones David A. Stewart","edited_by":"Tom Lewis","Release":"Around the World in 80 Days premiered at Los Angeles, California on June 13, 2004 and was released in theaters on June 16, 2004 by Walt Disney Pictures. It was also released on DVD and VHS on November 2, 2004 by Walt Disney Studios Home Entertainment.","budget":"$110 million[1]"}