{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Ann Stanley, who sells real estate in New York City, is on vacation with her mother in Greece when her car breaks down. To her rescue comes a young man on a motorbike, Peter Latham, who has a difficult time persuading Ann to accept a ride. They become better acquainted, drink ouzo, and ultimately consummate the relationship. Ann enjoys his company but still views their relationship as a summer fling.Back home, at a party one night, Ann is stunned when her grown daughter turns up with Peter as her date. Peter was not daughter's date–he picked her up at her home in place of daughter's date. It turns out, however, that Peter's goal is to resume his romantic acquaintance with Ann, having developed feelings for her during the summer. The age difference embarrasses Ann greatly. He is 22 and she is 40. Friends and associates of Ann are somewhat aghast at her behavior as the persistent Peter refuses to take no for an answer. In time, after demonstrating a great deal of reluctance, Ann finally acknowledges that the only thing that matters is true love.","language":"English","box_office":"$2,100,000 (US/Canada rentals)[1]","cinematography":"Charles Lang","production_company":"Frankovich Productions","directed_by":"M.J. Frankovich Milton Katselas","release_dates":"1973 (1973)|||||","Production":"Audrey Hepburn, Elizabeth Taylor, Joanne Woodward, Doris Day, Glenda Jackson, Shirley MacLaine, and Sophia Loren were all considered for the role of Ann Stanley before the original director (William Wyler) bowed out of the production.[citation needed]On the Broadway stage in 1968, the role was originated by Julie Harris, who won a Tony Award for her performance. Actresses such as June Allyson, Joan Fontaine and Zsa Zsa Gabor succeeded her on Broadway in the play, which ran for 780 performances.","starring":"Liv Ullmann Edward Albert Gene Kelly Binnie Barnes","running_time":"110 min.","music_by":"Michel Legrand","External links":"","edited_by":"David E. Blewitt","forty_carats":"Film poster","written_by":"Leonard Gershe"}