{"based_on":"Die Fälschung  by Nicolas Born","country":"West Germany, France, Lebanon","distributed_by":"Kino International","language":"German, English, French","Reception":"The New York Times described it as \"a balanced, thoughtful, extremely moving vision of wartime tragedy.\"[13]","directed_by":"Volker Schlöndorff","Awards":"The film was nominated for the César Award for Best Foreign Film in 1981. Jerzy Skolimowski won the Best Supporting Actor Deutscher Filmpreis in 1982, for his role as the war photographer Hoffmann.","release_dates":"October 15, 1981 (1981-10-15) (Wiesbaden, West Germany)|||||","Production":"The film was shot on location in Beirut.[2] The Lebanese Civil War, which began in 1975, would continue until 1990. The New York Times remarked that it was \"filmed in 1980 under remarkable conditions: with its crew confined to \"safe\" portions of Beirut while the fighting went on elsewhere, but with ubiquitous evidence of real warfare everywhere.\"[13]","produced_by":"Eberhard Junkersdorf Anatole Dauman","starring":"Bruno Ganz Hanna Schygulla Jerzy Skolimowski Gila von Weitershausen","running_time":"110 minutes[1]","Discography":"The original soundtrack music composed by Maurice Jarre for Le Faussaire was released on CD in 2013 by Canadian label Disques Cinemusique. More information here.","music_by":"Maurice Jarre","Story":"Journalist Georg Laschen (Bruno Ganz) is sent to Beirut, where he is supposed to report on the local civil war.[3] His feelings about this mission are influenced by the fact that his marriage to his wife Greta (Gila von Weitershausen) back home is dysfunctional,[3] and the conflict in Lebanon remains incomprehensible to him.[4][5]He feels that his comments and his own problems to understand the situation[6] don't really count[7] because violence sells anyway.[8] Subsequently he feels that his reports aren't real journalism and by pretending to be that they can downright be considered deceit (or in German: Fälschung).After a fling with a local lady named Arianna[9] (Hanna Schygulla) he happens to kill a man.[1] He realises how relatively easily one's moral standards can be corrupted in a violent environment and how hard or even impossible it is to remain unbiased[10] as a journalist.[11][12]"}