{"mandarin":"Hēi jùn mǎ","based_on":"Black Steed  by Zhang Chengzhi","Plot":"A Mongolian Tale tells the story of two childhood sweethearts from their youth into their adulthood as set on the Mongolian steppes. Nai Nai (Dalarsurong), an old Mongolian woman is living with her orphaned granddaughter, Someyer, when she accepts into her home a boy, Beiyinpalica, whose mother has died and father cannot care for. Though raised as a brother and sister, Somiya and Beiyinpalica grow close.As Beiyinpalica (now played by the Mongolian pop singer Tengger) is about to enter adulthood, his father suddenly writes and orders him into the city to study veterinary science. He leaves but promises Someyer that he will marry her when he returns. While in the city, Beiyinpalica also becomes a student of music. When he returns three years later, he discovers that Someyer (now played by Naranhua) has become pregnant by another man. Heartbroken, he leaves once more.Twelve years later, Beiyinpalica has become a celebrated folk singer. Someyer, meanwhile, has born four sons and one daughter, though she is generally neglected by her drunken husband. Back home, Beiyinpalica suddenly finds himself in the position of being a father-figure for the girl.","language":"Mongolian","cinematography":"Fu Jingsheng","production_company":"Beijing Youth Film Studio & Media Asia Films","directed_by":"Xie Fei","traditional":"黑駿馬","simplified":"黑骏马","release_dates":"29 August 1995 (1995-08-29) (Montreal)|||||","International reception":"Though a simple film of love and loss, A Mongolian Tale was praised by Western critics, who saw virtue in the film's simplicity. In an early review, Variety found the film generally \"lightweight\" but nevertheless \"beautifully made.\"[2] Its premiere at the Montreal World Film Festival would also not go unnoticed, with the film garnering Xie Fei a best director award, and Tengger a special award for musical contribution.[3]Upon its general release, A Mongolian Tale generated positive press not only for its performances, but for its setting. One review, from the San Francisco Chronicle noted that the film's setting had a \"grandeur all its own.\"[4] That did not stop the reviewer from finding the film a \"compelling romance in a land whose hard realities never yield to anything so insignificant as human dreams.\"[4] Janet Maslin of The New York Times, while generally positive in her review, singled out the actress Dalarsurong in her role as Nai Nai as \"eas[ing] into the radiant role of this film's endlessly wise foster grandmother.\"[1]","a_mongolian_tale":"Videocassette release cover","produced_by":"Ma Fung-kwok Wellington Fung","starring":"Tengger Naren Hua Dalarsurong","running_time":"103 minutes","music_by":"Tengger","edited_by":"Xie Fei Zhao Xiuqin","written_by":"Zhang Chengzhi"}