{"country":"United States","distributed_by":"Screen Gems","Plot":"Quincy Watson (Jamie Foxx) is unceremoniously dumped by his fiancée Helen, and pens a \"how to\" book on breaking up and becomes a best-selling author on the subject. Not wanting his male friends to suffer the same fate, he gives them advice on dumping their mates including his boss, Phillip, who is trying to break up with his gold-digger girlfriend Rita. After his cousin Evan (Morris Chestnut) reads Quincy's book he starts to question his relationship with his girlfriend Nicky (Gabrielle Union).Evan breaks up with her and goes over to his cousin and tells him to talk to her and convince her that Evan's a good guy. Quincy doesn't know what she looks like, and Evan tells him that she has long black hair. That day, Nicky had cut her hair to a 'Halle Berry' length. Quincy and Nicky end up sitting next to each other at the bar Nicky was supposed to meet Evan. Quincy tells her that he's looking for his cousin's ex-girlfriend whose name is Nicky and has long black hair.Nicky, knowing that Quincy is Evan's cousin, lies and tells Quincy her name is Mary. While Quincy and Nicky were on their date, Rita finds out that Philip is planning to break up with her, and goes to Quincy's house. When she gets there, Evan lies and says that he's Quincy. The two begin an affair. Evan goes to Nickey's house to break up with her. Nicky tells him that she was going to do the same, and that she's been seeing another man.Evans goes to Quincy's job and tells him that he thinks he's in love with Nicky, and that she's been seeing another man. During that conversation, Quincy realizes that 'Mary' is actually Nicky. At the party for Quincy's hot seller book, Helen is back from Paris and wants to get back with Quincy. Evans planned on proposing to Nicky at the party.Evan finds out that Quincy is dating his ex-girlfriend and becomes upset with him and leaves the party to look for Nicky. The next day, Evan talks to Quincy and tells him he's getting married to Rita. Phillip had a heart attack, and at the hospital, Rita finds out that Evan lied to her. Instead of getting mad, she says she fell in love with him. Quincy breaks up with Helen and goes to look for Nicky. When he goes to her door, her neighbor tells him that she's leaving for Portland by train. He goes to look for her. As the train is speeding away he confesses his love for her and they both ride the train to Portland.","language":"English","Reception":"Breakin' All the Rules was received negatively by critics. 33% of critics on Rotten Tomatoes gave the film a positive review; the consensus reading: \"This formulaic screwball comedy is weighed down by a contrived, overly complicated plot.\"[1]The film opened at #5 in its opening weekend at the box office, ultimately grossing $12,544,254 worldwide.[2]","breakin'_all_the_rules":"Theatrical poster","directed_by":"Daniel Taplitz","release_dates":"May 14, 2004 (2004-05-14)","produced_by":"Lisa Tornell","starring":"Jamie Foxx Morris Chestnut Jennifer Esposito Jill Ritchie Bianca Lawson with Peter MacNicol and Gabrielle Union","running_time":"95 minutes","music_by":"Marcus Miller","written_by":"Daniel Taplitz","budget":"$10 million"}