{"based_on":"1939 Novel: Agatha Christie","country":"United States","distributed_by":"Twentieth Century Fox Film Corporation","and_then_there_were_none":"American film poster","Plot":"Eight people, all total strangers to each other, are invited to a small, isolated island off the coast of Devon, England, by a Mr. and Mrs. Owen. They settle in at a mansion tended by two newly hired servants, Thomas and Ethel Rogers, but their hosts are absent. When the guests sit down to dinner, they notice the centerpiece, ten figurines of Indians in a circle. Afterward, Thomas Rogers puts on a gramophone record, from which a voice accuses them all of murder:It turns out that none of the ten knows or has even seen \"U. N. Owen,\" as he signed his instructions to Rogers; they suddenly realize it stands for \"unknown.\" The guests decide to leave, but Rogers informs them that the boat will not return until Monday, and it is only Friday.Starloff admits to running down a couple while speeding. Then he takes a drink and dies from poison. The next morning, the guests learn that Mrs. Rogers has died in her sleep. Quinncannon reports that Rogers found one figurine broken after Starloff's demise. Now another is missing. With two deaths matching the Ten Little Indians nursery rhyme, they search the island for \"Mr. Owen\" without success. After General Mandrake is stabbed in the back, the judge arrives at the only explanation: Owen must be one of them.Another day passes. Everyone votes secretly for whom they suspect. Only Rogers receives two votes, and is sent to spend the night in the woodshed. After locking the dining room, they give Rogers the key. The next morning, however, they find him dead, his head split open with an axe. Vera persuades Brent to reveal that she had her nephew placed in a reformatory, where he hanged himself. Later that day, Brent's body is found with a hypodermic needle nearby. Armstrong discovers that his is missing. Lombard admits he had a revolver, but it is lost as well.At dinner, Quinncannon confesses he sentenced an innocent man to death to ruin the defending counsel's reputation. Armstrong then admits to operating while drunk, with fatal results. Blore grudgingly discloses that he perjured himself to put an innocent man in prison, where he died. Lombard merely states that the accusation against him is true. When it is Vera's turn, she excuses herself to get her coat. The others hear her shriek and rush to her. In the confusion, a single gunshot is heard. They find Vera shaken after being brushed by seaweed hanging from the ceiling. They also spot Lombard's gun, and Quinncannon dead from a shot to the head.Vera insists she is innocent, but Armstrong contends that only a person who had not committed a crime would want to mete out \"justice\", and locks her in her room. Later that night, she wakes to find Lombard outside her window. After he gives her his gun, she lets him inside. He persuades her to admit that it was her sister who killed her own fiancé, and Vera helped her cover up the crime and unofficially took the blame. They hear someone going downstairs. Upon investigation, they realize that Armstrong is missing.The next morning, Blore goes outside to look for Armstrong and is struck by stonework toppled from the floor above. Lombard takes binoculars found beside the body and sees what Blore had—a corpse on the beach. It is Armstrong. Vera pulls out the gun, now certain that Lombard is the killer. He tells her that his real name is Charles Morley, and that the real Lombard was his friend and had committed suicide. Morley has a flash of insight and urges Vera to shoot him.Vera fires and Morley drops. Returning to the mansion, Vera finds a noose hanging in the parlor and discovers who Owen is: Quinncannon, very much alive. The judge tells her that all his life he had searched for perfect justice. After learning that he was terminally ill, he concocted this plan. He persuaded Armstrong to fake his (Quinncannon's) death, supposedly to help catch Owen, then murdered Armstrong. He tells Vera that she can either hang herself or be sent to the gallows (as the only possible perpetrator). He drinks poisoned whiskey, but then sees Morley alive before he succumbs. Vera had missed intentionally.","language":"English","Reception":"And Then There Were None currently holds a 100% approval rating on Rotten Tomatoes.","cinematography":"Lucien N. Andriot","directed_by":"René Clair","Remakes":"Christie's mystery has been filmed a number of times, including as Ten Little Indians (1965), Ten Little Indians (1974), Desyat Negrityat (1987) and Ten Little Indians (1989), with variations to its characters and locale.","release_dates":"October 30, 1945 (1945-10-30)|||||","Differences from the novel":"This adaptation of the novel took, overall, fewer liberties with Christie's plot than some of the other versions. Most of the changes were made in order to comply with the strict censorship of the day, which included changing the backstories behind Miss Brent's and Vera Claythorne's crimes, since a film that would imply such themes as child murder and teenage pregnancy would never be allowed to be viewed by the general public.Some of the other characters' names and crimes were also changed. Judge Francis J Quincannon was known as Justice Lawrence J Wargrave in the book. General Sir John Mandrake was called General John Gordon Macarthur and Prince Nikita Starloff replaced Anthony Marston. In the novel, Marston had killed two children—John and Lucy Combes—while driving recklessly.Only the 1987 soviet film and the 2015 BBC One versions kept to the novel's ending. This film, in line with all the other Western versions, changed the shooting of Philip Lombard (played by Louis Hayward) and the suicide of Vera Claythorne's character (played by June Duprez) in favour of a more upbeat ending. Vera pretends to shoot Lombard so that the real murderer will believe he is dead.This film follows the altered denouement Christie herself had rewritten for her 1943 stage version of the book. There is one major alteration: in the play, Vera thinks she has shot Lombard, after which the murderer appears and attacks her; Lombard, who was only grazed, comes to at the last minute and shoots the murderer as he is about to strangle the terrified girl. The film, however, simply has Vera help Lombard fake his death, then confront the culprit who commits suicide after revealing his motive and murder techniques. The end result is the same; the two major characters are left alive and innocent of the crimes they were accused of. Later remakes in 1965, 1974, and 1989 (all using the title Ten Little Indians) also used one of these two revised finales.One final alteration is the title. Christie's novel was originally titled Ten Little Niggers and then it was changed to Ten Little Indians, the title it is often known by today. In some countries, such as US and Australia, the novel was renamed And Then There Were None.","produced_by":"René Clair Harry M. Popkin","starring":"Barry Fitzgerald Walter Huston Louis Hayward","running_time":"97 minutes","music_by":"Mario Castelnuovo-Tedesco","edited_by":"Harvey Manger","written_by":"Dudley Nichols"}