{"based_on":"Alexander and the Terrible, Horrible, No Good, Very Bad Day  by Judith Viorst Ray Cruz","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Rob Lieber[1]","Plot":"The film follows the exploits of Alexander Cooper (Ed Oxenbould), an ordinary 11-year-old boy, and his \"terrible, horrible, no good, very bad day.\" He is left out by his family; his older brother, Anthony (Dylan Minnette), his older sister, Emily (Kerris Dorsey), his mother, Kelly (Jennifer Garner), his father, Ben (Steve Carell), and his baby brother, Trevor (Elise/Zoey Vargas), living in the Los Angeles metropolitan area of California.The day before Alexander's twelfth birthday, he wakes up and finds gum in his hair and clips it off with a pair of scissors. Anthony is trying to earn his driver's license so he can drive his girlfriend, Celia (Bella Thorne), to the prom, Emily is rehearsing for the title role in her school play of Peter Pan, Kelly is working for a publication company that is publishing a new children's book which will promote her to vice president of the company, and Ben, who has been unemployed for seven months, has landed a job interview as a game designer for a video game company.That same morning, Alexander attends school where he experiences another series of mishaps, as well as finding out that his friends, including his crush, Becky Gibson (Sidney Fullmer), and best friend, Paul (Mekai Curtis), will all be attending the birthday party of Philip Parker (Lincoln Melcher) instead of his, due to Philip's expensive party entertainment and popularity. He tries to tell his family how miserably his day has gone, but none of them even listen to what he says. That evening, Anthony upsets Celia during a phone call, and Emily rehearses her stage lines in Kelly's car while leaving its light on. Alexander makes himself a birthday sundae and wishes his family could experience the disappointments he does every day.The next morning, Alexander wakes up to find his family in disarray and chaos erupts; his parents have overslept, Emily has a cold, and Anthony has found out that he and Celia broke up. The battery in Kelly's car is dead, because Emily left its light on all evening long, so Ben has to take Trevor with him to the interview after dropping Kelly off at work. At school, Paul gives Alexander good news: Philip's birthday party is cancelled as Philip has gotten the chicken pox, so the kids including Becky Gibson and Paul who were originally going to attend Philip's party have now decided they will attend Alexander's party instead, much to Alexander's delight. Alexander calls his father, asking him to plan a party for him. Kelly is informed of an embarrassing typo in the book they are publicizing (\"dump\" instead of \"jump\"), and needs to stop Dick Van Dyke from reading it at a public reading later. Ben takes Trevor along to the office interview and meets Greg (Donald Glover) who seems impressed at his credentials, although they decide to hold another meeting after Trevor ingests a highlighter. Meanwhile, at school, Anthony finds out that Celia has gotten back together with him. Feeling excited about what happened, Anthony accidentally causes two trophy display cases to fall and smash, which leads to him getting suspended.Kelly manages to arrive at Dick Van Dyke's reading, but she is too late in trying to warn him about the book's typo. He reads it with the inappropriate material, humiliating himself and the publishing company. Meanwhile, Ben purchases cough syrup for Emily's symptoms and takes Anthony to the Department of Motor Vehicles, where his driving instructor intentionally distracts him by convincing him to pick up his cell phone, causing him to damage the family minivan, and ultimately fail his driving exam, much to the family's dismay. Alexander confesses that the family's day was jinxed because of his ill wishes the night before, and apologizes, but Ben believes that they can still have some good in it. Afterwards, they all go to Emily's play, which is inadvertently sabotaged by her impaired behavior due to her getting excessively drunk after overdosing on the cough syrup. Afterwards, the game design firm calls Ben and asks him to meet them at Nagamaki, an \"authentic\" Japanese hibachi restaurant, for another meeting. The family, joined by Celia, goes to the restaurant in their badly damaged minivan, where Ben accidentally sets his shirt on fire at the grill, embarrassing him to the employers. The whole family consoles him, admitting that they will overcome whatever else the day has in store for them. Alexander states, \"You just gotta have the bad days so you can love the good days even more\", and Anthony suddenly decides not to go to the prom with Celia, stating that his family is more important, and they break up completely.The family returns home, and discover that Ben had hired a rental animal service to recreate an Australian petting zoo for Alexander's birthday party. A crocodile and kangaroo, however, have escaped from their cage and Ben is kicked by the kangaroo after chasing it for several blocks. They then decide to pitch in to try and salvage the day by helping host it. Ben and Kelly receive good news: he got hired for the game design job, and she has been informed that the celebrity reading went viral and has created publicity for the book. Reunited, Ben then brings out the cake, with Alexander wishing for more days like the one they shared together.","language":"English","Reception":"Alexander and the Terrible, Horrible, No Good, Very Bad Day grossed $66,954,149 in North America, and $33,700,000 in other countries, for a worldwide total of $100,654,149.[4] In North America, the film earned $5.2 million on its opening day and $18.3 million in its opening weekend, placing third behind Gone Girl and Dracula Untold.[25][26][27] In its second weekend, the film dropped to number four, grossing an additional $11.4 million.[28] In its third weekend, the film dropped to number seven, grossing $7.1 million.[29] In its fourth weekend, the film dropped to number eight, grossing $6.5 million.[30]The film received mixed reviews from critics. The review aggregator website Rotten Tomatoes gave the film a rating of 61%, based on 108 reviews, with an average rating of 5.8/10. The website's consensus reads, \"Affably pleasant without ever trying to be anything more, Alexander and the Terrible, Horrible, No Good, Very Bad Day is a fine—albeit forgettable—family diversion.\"[31] Metacritic, which uses a weighted average, assigned a score of 54 out of 100, based on 28 critics, indicating \"mixed or average reviews\".[32]Todd McCarthy of The Hollywood Reporter gave the film a positive review, saying \"Alexander and the Terrible, Horrible, No Good, Very Bad Day could have been a lot more horrible and no good than it is.\"[33] Stephen Whitty of the Newark Star-Ledger gave the film three out of four stars, saying \"It's Arteta's ease with generating that slight sense of social awkwardness that makes \"Alexander\" a cut above the usual live-action family comedy.\"[34] Alonso Duralde of The Wrap gave the film a negative review, saying \"These characters should have to suffer twice as many embarrassments if they want to earn all those adjectives in the title.\"[35] Sherilyn Connelly of The Village Voice gave the film a negative review, saying \"Everything that can go wrong does, and while it has its moments, Miguel Arteta's comedy relies too much on gender-shaming and emasculation jokes.\"[36] Kyle Smith of the New York Post gave the film one and a half stars out of four, saying \"Can a series of irritating events make a movie? Yes, but an irritating one: Alexander and the Terrible, Horrible, No Good, Very Bad Day.\"[37] John Hartl of The Seattle Times gave the film two and a half stars out of four, saying \"The movie is so over-the-top that it makes little narrative sense, but it's often successful in its naked pursuit of belly laughs.\"[38] Katie Rife of The A.V. Club gave the film a B, saying \"Alexander is a watchable, affable, pretty good, well-done kids' movie buoyed by a humorous script and talented cast.\"[39] Bill Goodykoontz of The Arizona Republic gave the film three out of five stars, saying \"It turns out the film is not terrible or horrible or very bad. No good? Not that, either.\"[40]Claudia Puig of USA Today gave the film two and a half stars out of four, saying \"It may have the year's longest title, but Alexander's movie is not terrible, horrible, or even half bad. In fact, Alexander and the Terrible, Horrible, No Good, Very Bad Day is a pleasant, entertaining way to spend just under 90 minutes, particularly if accompanied by children.\"[41] Sandie Angulo Chen of The Washington Post gave the film three out of four stars, saying \"Even the bathroom humor is forgivable when the end result is a crowd-pleasing comedy and a surprisingly entertaining treat for the whole family.\"[42] Rafer Guzman of Newsday gave the film two and a half stars out of four, saying \"Alexander and the Terrible, Horrible, No Good, Very Bad Day, a Disney film, stretches the book thinner than pizza dough and feels about as nutritious. Still, its intentions are good and so is its cast, particularly Ed Oxenbould, a bright-eyed, expressive 13-year-old making his screen debut as Alexander Cooper.\"[43] Bruce Demara of the Toronto Star gave the film three out of four stars, saying \"Director Miguel Arteta, whose previous work is a mixed bag of television and film, gets almost everything right here, including bringing together a solid cast.\"[44] A.O. Scott of The New York Times gave the film a negative review, saying \"'Alexander and the Terrible, Horrible, No Good, Very Bad Day is the latest example of a wonderful children’s book turned into a mediocre movie. This kind of thing happens so frequently — exceptions like Where the Wild Things Are and, arguably, Shrek prove the rule upheld by every recent big-screen Dr. Seuss adaptation — that you could almost believe that there is malice involved.\"[45]Betsy Sharkey of the Los Angeles Times called the film \"Not so terribly horrible. Not so terribly terrific either.\"[46] Tom Russo of The Boston Globe gave the film a positive review, saying \"What the filmmakers come up with is a modestly likable mix of zany and gently warmhearted, even if they overdo both elements at times.\"[47] David Hiltbrand of The Philadelphia Inquirer gave the film two out of four stars, saying \"It's a film where you start chuckling as soon as someone says something like, \"I just want everything to be perfect tonight.\"[48] Adam Graham of The Detroit News gave the film a B-, saying \"Alexander won't change your day, but it's not terrible, horrible, no good or very bad, either.\"[49] Calvin Wilson of the St. Louis Post-Dispatch gave the film a three out of four stars, saying \"Arteta keeps the action speeding along while eliciting spot-on performances. Carell is at his discombobulated best, and Garner anchors the proceedings with aplomb.\"[50] Lindsey Bahr gave the film a B, saying \"Alexander is pleasantly devoid of the vulgarity and too-current pop culture references that are the default mode for many contemporary live-action kids' pics, and its earnest celebration of family gives the movie a comforting throwback vibe.\"[51] Bruce Ingram of the Chicago Sun-Times gave the film two and half stars out of four, saying \"Disney’s bland comedy Alexander and the Terrible, Horrible, No Good, Very Bad Day might have been a little more entertaining if it had been a little more, terrible, horrible, no good and so forth.\"[52] Joe Neumaier of the New York Daily News two out of five stars, saying \"Just another loud, boy-centric comedy aimed at ’tweens. The movie turns a slight children’s book — in this case, Judith Viorst’s 1972 fave, from which it takes mainly the title — into a charmless mishmash.\"[53]","box_office":"$101.4 million[4]","cinematography":"Terry Stacey","production_company":"Walt Disney Pictures 21 Laps Entertainment The Jim Henson Company","directed_by":"Miguel Arteta","alexander_and_the_terrible,_horrible,_no_good,_very_bad_day":"Theatrical release poster","Soundtrack":"On April 1, 2014, Christophe Beck was hired to score the film.[54] Walt Disney Records released the EP soundtrack album on October 7, 2014. The album features songs from the film, and new tracks by various artists, like The Vamps, Kerris and Justine Dorsey, The Narwhals, Charles William and IDK & The Whatevs.[55]","release_dates":"October 6, 2014 (2014-10-06) (El Capitan Theatre)|October 10, 2014 (2014-10-10) (United States)||||","Production":"In 2011, 20th Century Fox had plans to make a live-action film adaptation of the book.[9] Written by Rob Lieber, the film was set to be directed by Lisa Cholodenko (who also made an earlier draft of the screenplay), and produced by Shawn Levy with Dan Levine for Levy's 21 Laps and Lisa Henson from The Jim Henson Company. Steve Carell joined in April 2012, to star as Ben, Alexander's father.[10] In October 2012, the project was picked up by Walt Disney Pictures,[11] after Fox was reportedly \"uncomfortable with the budget.\"[12] By February 2013, Cholodenko had left the project,[13] and a month later, it was reported that Miguel Arteta was in talks with Disney to replace Cholodenko.[14]In April 2013, Jennifer Garner was in talks to play Alexander's mother.[15] In June 2013, Disney set the release date for October 10, 2014, and confirmed that Carell and Garner were cast as Alexander's parents.[16] The same month, Disney announced the casting of Ed Oxenbould as Alexander.[17] In July 2013, Bella Thorne was cast in the film as Alexander's older brother's girlfriend.[18] Joel Johnstone,[5] Megan Mullally and Jennifer Coolidge joined the cast a month later.[7]Principal photography began on August 19, 2013.[19][20] The film was entirely shot in the Los Angeles area, including the cities of Pasadena and Arcadia, the San Fernando Valley, and Melody Ranch in Newhall.[7] Filming lasted through October 2013.[21]","produced_by":"Shawn Levy Dan Levine Lisa Henson","starring":"Steve Carell Jennifer Garner Ed Oxenbould Dylan Minnette Kerris Dorsey Bella Thorne","running_time":"81 minutes[2]","music_by":"Christophe Beck","edited_by":"Pamela Martin","Release":"The film officially premiered at the El Capitan Theatre in Los Angeles on October 6, 2014.[22]Alexander and the Terrible, Horrible, No Good, Very Bad Day was released by Walt Disney Studios Home Entertainment on DVD and Blu-ray on February 10, 2015.[23] The film debuted at the top of the home video chart in its first week.[24]","budget":"$28 million[3]"}