{"brown_sugar":"Theatrical release poster","Cast":"cameo appearances","distributed_by":"Fox Searchlight Pictures","Plot":"Brown sugar is the film that follows the evolving relationship between Sidney (Sanaa Lathan), an attractive young woman who has just been appointed the editor-in-chief of the hip-hop magazine XXL, and Dre (Taye Diggs), an A&R for Millennium Records. They have been bound together since their early childhood. The news that Dre is preparing to be married to Reese (Nicole Ari Parker), a successful entertainment attorney, sends Sidney into a subconscious tizzy.Suddenly, she doesn't seem to know how to behave around Dre anymore, and an impulsive kiss on the eve before his wedding sends fissures of doubt cracking in every direction. Dre gets married and begins to settle into his life when a decision to sign an untalented but commercially viable rap group forces Dre to choose between his love for true Hip Hop and his job. Subsequently he quits his job to start his own record company focused on bringing back the real hip hop that his generation fell in love with. Reese, however, is not understanding and thus not supportive of this venture. Additionally as Sidney draws closer to Dre due to their partnership in the label, jealousy develops over Dre and Sidney's friendship.Sidney, who also has begun to live her life with a budding relationship with Kelby (Boris Kodjoe) receives a proposal from her boyfriend which she accepts. Turmoil ensues when Dre finds out Reese has been having secret liaisons with a man from the gym (who texts Reese to confirm a rendezvous). Dre brings Sid to bust her in the act. This leads to a night of shared passion between Dre and Sid and opens Sid's eyes to the fact she is not prepared to get married to Kelby. She calls off the engagement and while searching for Dre sees Reese and Dre in a parting embrace that she misconstrues as more.While at Hot 97 waiting for Cavi's first single to play on the Angie Martinez show, Dre hears Sid talking about her new book I Used to Love H.I.M. Though based on her love affair with Hip Hop, it really is a chronicled time line of her love affair with Dre. He recognizes this, rushes over to the station to confront his feelings as well. Meanwhile in the production booth, Sid's cousin Francine finally asks Cavi out on a date...something he has been trying for since their first meeting.The film ends with Cavi's song playing in the same park where their love of Hip Hop began...","language":"English","Critical reception":"In the Chicago Sun-Times, Roger Ebert gave Brown Sugar three out of four stars and said it was \"more like a slice of black professional life\" than a rap comedy, a film thoughtful about its characters, whom he said were as deep and complex as those in Terry McMillan novels.[2]2003 NAACP Image Awards (nominations)","box_office":"$28,316,451[1]","directed_by":"Rick Famuyiwa","Soundtrack":"A soundtrack containing hip hop and R&B music was released on September 24, 2002 by MCA Records. It peaked at #16 on the Billboard 200 and #2 on the Top R&B/Hip-Hop Albums.","release_dates":"October 11, 2002 (2002-10-11)","produced_by":"Magic Johnson Peter Heller","starring":"Taye Diggs Sanaa Lathan Mos Def Nicole Ari Parker Boris Kodjoe Queen Latifah","running_time":"109 minutes","written_by":"Michael Elliot (story and screenplay) Rick Famuyiwa (screenplay)","budget":"$8 million[1]"}