{"country":"U.S.A.","distributed_by":"BMG Independents","clockwatchers":"Clockwatchers movie poster","Plot":"Iris (Collette) is a shy young professional who doesn't want to rock the boat at the office where she temps. Margaret (Posey) is the polar opposite, and serves as a catalyst to help Iris become more assertive. Paula (Kudrow) eagerly awaits post-work happy hours and the chance to flirt with attractive men. Jane (Ubach) is engaged to marry a jerk who is already cheating on her. Margaret hopes to become a permanent employee as an assistant to Mr. Lasky (Bob Balaban), but her dreams are thwarted when he suddenly dies. The four temps form a camaraderie which assists them in getting through their boring and tedius days at work.A series of thefts occur in the office and suspicion falls on the temps, particularly Margaret. When Iris finds a plastic monkey inside Margaret's desk that she had thought was stolen, Iris loses faith in Margaret and believes that she is the office thief. Margaret suggests a one-day strike from work due to mistreatment and being under appreciated as temps, and her friends halfheartedly agree to join her, but on the appointed day Margaret is the only one who does not come to work. As a result, the company's officious head of human resources (Debra Jo Rupp) fires Margaret, and management micromanages the remaining three temps. Iris, Paula and Jane's friendship comes to an end as result of the stress, ending the camaraderie among the temporary workers, and eventually they all go their separate ways. Paula is upset when she learns of Jane's wedding from a newspaper announcement, to which she was not invited, and leaves to work in another department.It is later discovered that another employee (a rich girl who was hired as a permanent employee after her first day) was the thief and that Margaret simply had a similar toy in her desk. Iris confronts the thief when her diary disappears; Iris later receives a new diary and note of apology.When Iris is not hired for a permanent job she really wanted, she quits the temp pool. A senior executive agrees to sign a letter of recommendation for Iris. Iris takes advantage of the fact that executives rarely learn the temps names, and she tells the executive that her name is Margaret, so that Margaret can finally receive the recommendation she had been striving for as a temp. Iris then mails the letter of recommendation to Margaret with a note.","language":"English","Reception":"The film received positive reviews. It currently holds an 83% approval rating at Rotten Tomatoes based on 24 reviews (20 positive, 4 negative).[2]","cinematography":"Jim Denault","production_company":"Goldcrest Films","directed_by":"Jill Sprecher","release_dates":"May 15, 1998 (1998-05-15) (U.S.)|||||","produced_by":"Gina Resnick John Flock","starring":"Toni Collette Parker Posey Lisa Kudrow Alanna Ubach","running_time":"96 minutes","music_by":"Joseph L. Altruda Mader","edited_by":"Stephen Mirrione","written_by":"Jill Sprecher Karen Sprecher"}