{"distributed_by":"New Line Cinema1","Plot":"The film opens in 1983, a young Vusi (Thokozani Nkosi) organizes a radical student protest that is soon put down by police, Vusi is captured and forced to leave for the U.S. where he settles down in the Bay Area.14 years later Vusi (Ice Cube) returns to South Africa to attend his father's funeral at the village he grew up in but is unable to bring himself to slaughter a cow as part of the funeral ritual. Vusi's younger brother Ernest, a former soldier, constantly berates him for his choice to run away to America instead of take part in \"the struggle\", this angers Vusi who tells Ernest \"i was in the struggle while you were still pissing in your pants.\" While talking with his mother Vusi wonders why his youngest brother Steven was not at the funeral, his mother admits that they have not seen Steven in a while but provide Vusi with two addresses and send him out to find Steven. The first address Vusi checks is Steven's apartment in Johannesburg, where he meets his brother's neighbor Karen (Elizabeth Hurley) and gives her his contact information if she should hear anything. While driving out of Soweto after checking the second address Vusi is confronted by three armed thugs who take his car, jacket, and shirt as well as break his father's spear he had been given. Later on at his hotel Vusi calls his fiancee to tell her what had happened when he receives a note from Karen telling him to meet her at The Summit Club.At the club Vusi discovers Karen's occupation as a stripper and she tells him that she had been hearing noises coming from Steven's apartment, after the show the pair returns to the apartment complex and decides to check the room. Karen climbs along the outside of the building to Steven's open window where a thug attacks her and flees, knocking over Vusi in his escape, which causes him to wonder what is actually going on with Steven. Karen finally confesses that Steven had borrowed cocaine on \"credit\" from a drug dealer named Muki (Ving Rhames) to sell and make enough money for Karen and him to travel to the U.S. to visit Vusi but instead took the money and drugs for himself, with the truth finally revealed Karen suggests they check out the local clubs to see if they could find any leads. At a hard-rock club Vusi finds out about Karen's crack cocaine addiction after watching her take a hit from a pipe, he confronts her about possibly getting Steven hooked on it as well when they are accosted by white supremacist punks outside the club. Two of thugs pin Vusi to a wall at gunpoint while the leader of the gang hits Karen for associating with a \"kaffir\", Vusi is able to get the upper hand on the punks while Karen grabs the gun and gives it Vusi who holds the leader at gunpoint before knocking him out and pistol-whipping the other punk. Back at the apartment Karen asks Vusi to visit her drug dealer and purchase a gram of crack for her or she won't tell him anything else about Steven, Vusi reluctantly agrees.Karen's drug dealer Sam is suspicious of Vusi but becomes relaxed when Vusi reveals that he knows Karen, prompting Sam to tell Vusi that Muki will not allow him to sell to Karen due to the fact that her and Steven may be working together to hide the money, so Sam charges an extra 50 dollars and tells Vusi to stay in the apartment. While Sam is gone Vusi answers the door to find Steven, who flees from him down an alley, and upon returning to the apartment is confronting by a switchblade-wielding Sam demanding to know why he left. Vusi pulls a gun and forces Sam over to the window, interrogating him on the whereabouts of Muki to which Sam replies \"you don't find Muki, Muki finds you.\" and with that Vusi is given his money back as well as the drugs Karen asked for. Vusi heads back to Karen's where she becomes extremely paranoid upon learning that Vusi told Sam about Steven being his brother, figuring Muki would find out they leave and go to Vusi's hotel room. The next morning after Vusi drops Karen off back at her apartment he is confronted by one of Muki's men in his car, the car is stopped by more of Muki's men and Vusi is captured and put in the trunk of one of the cars. Vusi is taken to meet with Muki at a soccer stadium, where Muki tells Vusi about his brother's massive debt of 45,000 rand, a debt that would be the cost to have the entire Madlazi family killed however if Vusi is able to bring him 15,000 U.S. dollars in two days he will spare Steven's life.Karen tells Vusi that Steven headed for Sun City in order to gamble back the money he needs in order to pay back the debt, so the pair head out for the casino. Finally arriving at the casino after driving through an AWB rally Karen and Vusi split up to search the casino, while playing on a slot machine Karen is approached by Steven who immediately asks her for some cocaine, but becomes sad when Karen tells him about the death of his father. Steven tells her that he only managed to make back 2,000 of the 45 he owes Muki, but still has 5 grams of Muki's product stashed away, so Karen heads up to Steven's room where he shoots up over half a gram of crack into his arm. Vusi finds Steven and becomes angry at Karen for allowing his brother to become an addict, but he calms down and the trio leaves the casino.Vusi is only able to get 14,100 to pay back Muki, but the trio heads off to the hotel to pay him back anyway. Steven yells at Muki for trashing his apartment, but is told to shut up by Vusi, Muki is pleased with the money Vusi was able to bring him and Vusi promises to have the rest to him by the next day. Muki tells Steven that the word is out that people can mess with Muki and that he must send a message despite their deal, so Muki shoots Steven with Vusi's gun that was confiscated on the way in. A man in the apartment, who is revealed to be a detective sergeant, is disgusted at Muki's actions and while Steven's body is moved out Muki takes a large hit from a bong he offered to Steven before shooting him. Steven's corpse is brought back to the village for burial and Vusi recruits Ernest to help him take revenge on Muki, while in the village Vusi's spear is also repaired and he finally is able to slaughter a goat as part of Steven's funeral, and Ernest leads Vusi and Karen to a weapons cache he had buried. With the weapons to take their revenge the trio goes back to Sam's apartment, where under threat of torture, they convince Sam to help them by carrying in a bomb that Ernest had put in a present box.At Muki's, Sam attempts to warn Muki's men of the bomb in the box but it goes off and kills Sam as well as the two men guarding the door. As Vusi and Ernest move through the apartment killing Muki's thugs Vusi is nearly shot by Muki's wife, but is able to see her drawing a gun and kills her. Ernest checks a back room only to be jumped by the drug-crazed Muki who holds him hostage in order to get Vusi to drop his weapons, he drops his gun and sees Karen coming up behind Muki, she lets off a burst with her rifle into the ceiling giving Vusi an opportunity to get close to Muki and stab him with his father's spear. Muki is stabbed three time in the stomach and falls out a window onto a car below, the trio flees the building as police show up to investigate the scene. At the end of the film Vusi convinces his fiancee to come to South Africa and live in his village, she agrees to be on a plane there as soon as possible, and Karen considers checking into a rehab facility for her addiction, but Vusi suggests she come live with them to get some fresh air away from Johannesburg.","language":"English","Reception":"The film was panned by critics and currently holds an 8% \"Rotten\" rating from Rotten Tomatoes.","box_office":"$5,406,74","cinematography":"Paul Gilpin","directed_by":"Darrell Roodt","Soundtrack":"A soundtrack containing hip hop music was released on February 11, 1997 by Jive Records. It peaked at #20 on the Billboard 200 and #3 on the Top R&B/Hip-Hop Albums.","release_dates":"February 12, 1997 (1997-02-12)|||||","produced_by":"Gillian Gorfil Darrell Roodt","starring":"Ice Cube Elizabeth Hurley","running_time":"95 minutes","music_by":"Stanley Clarke","edited_by":"David Heitner","dangerous_ground":"Theatrical Release Poster","written_by":"Greg Latter Darrell Roodt","budget":"$28 million"}