{"based_on":"Animal Farm  by George Orwell","country":"United Kingdom","distributed_by":"Distributors Corporation of America (US)","Critical response":"The film critic C. A. Lejeune wrote at the time: \"I salute Animal Farm as a fine piece of work… [the production team] have made a film for the eye, ear, heart and mind\".[6] Matyas Seiber's score and Maurice Denham's vocal talents have been praised specifically (Denham provided every voice and animal noise in the film). The animation style has been described as \"Disney-turned-serious\".[7] The movie holds a 63% score at Rotten Tomatoes[8] and a 7.2 out of 10 grade at IMDB.[9]Some criticism was levelled at the altered ending, with one paper reporting: \"Orwell would not have liked this one change, with its substitution of commonplace propaganda for his own reticent, melancholy satire\".[7]","Plot":"Manor Farm is a formerly prosperous farm that has fallen on hard times, and suffers under the now-ineffective leadership of its drunken and aggressive owner, Mr. Jones. One night, Old Major, the prize boar and the second-oldest on the farm, calls the animals on the farm for a meeting, where he compares the humans to parasites and encourages the animals to break free from their tyrant's influence, while reminding them that they must hold true to their convictions after they have gained freedom. With that, he teaches the animals a revolutionary song, before collapsing dead mid-song to the animals' horror.The next morning, Jones neglects to feed the animals for breakfast, and they decide to break into the storehouse to help themselves. When Jones wakes up and attempts to intimidate them with his whip, the animals revolt and drive the drunken and irresponsible Mr. Jones from the farm, renaming it \"Animal Farm\". They set to work destroying every trace of Jones' influence, mainly the weapons used against them. The farmers of the surrounding area rally against them, but are beaten back after a fierce fight. A subsequent investigation of the farmhouse leads them to concede against living there, though one of the head pigs, an antagonistic boar named Napoleon, takes interest in the abandoned house, and even more so in a litter of puppies left motherless.The Seven Commandments of Animalism are written on a wall of the barn to illustrate their community's laws. The most important is the seventh, \"All animals are equal.\" All the animals work, but the workhorse, Boxer, and his friend Benjamin, the donkey and the film's protagonist, put in extra work. Snowball attempts to teach the animals reading and writing; food is plentiful, and the farm runs smoothly. The pigs elevate themselves to positions of leadership and set aside special food items ostensibly for their personal health. Napoleon takes the pups and trains them privately.When Snowball announces his idea for a windmill, Napoleon opposes it. Snowball makes a speech in favor of the windmill, whereupon Napoleon has his dogs chase Snowball and kill him. Afterwards, Napoleon declares himself leader with fat pig Squealer as his propagandist, and makes changes. Meetings will no longer be held and instead a committee of pigs will run the farm. The animals work harder with the promise of easier lives with the windmill.During this time, the pigs also decide to start altering their own laws. \"No animal shall sleep in beds\" is changed to \"No animal shall sleep in beds with sheets\" when the pigs are discovered to have been sleeping in the old farmhouse. Before long, Napoleon's greed drives him to negotiate with a local trader named Mr. Whymper for a supply of jellies and jams. The price is all the hens' eggs. When the hens discover this, they attempt to revolt by throwing their eggs at the pigs during an attempted seize by force. To instill fear, Napoleon holds a \"trial\", and a sheep and duck join the hens accused as traitors. They are taken outside and murdered by the dogs, with their blood used to edit a commandment regarding killing to being legal \"with cause\". After the deaths, the revolutionary song is banned because Napoleon claims the dream of Animal Farm has been realized and the revolution is over. He also threatens that the penalty for animals caught singing the song is death.Growing jealous of Whymper's financial success due to his trading with Animal Farm, a hostile group of farmers attack the farm, and Jones, shunned for his failure and drunkenness, uses blasting powder to blow up the windmill, along with himself. Though the animals win the battle, they do so at a great cost of lives, and Boxer is wounded. Boxer continues working until he collapses one night while working on rebuilding the windmill. Napoleon sends for a van to take Boxer away which Benjamin recognizes as the \"death wagon\" from Whymper's glue factory. That night a supply of alcohol is delivered. The next day, Squealer delivers a phony speech, claiming to have been at Boxer's side at his deathbed, and states that his last words were to glorify Napoleon. The upset animals see through the propaganda and recognize how dictatorial Napoleon has become, but are driven away by the snarling dogs before anything can be done.Years pass, and the pigs have now learned to walk upright and wear clothes. The Seven Commandments are reduced to a single phrase: \"All animals are equal, but some animals are more equal than others.\" Napoleon holds a dinner party for a delegation of outside pigs, who congratulate Napoleon on having the hardest-working and lowest-consuming animals in the country. Napoleon gives a toast to a future when pigs own and operate farms everywhere.Benjamin, overhearing the conversation, imagines the faces of all the pigs assuming into the likeness of Mr. Jones, as he realizes the similarity between the two. Realizing that things have become \"worse than ever for ordinary creatures\", all of the animals unite together to overthrow Napoleon. The animals march upon the farmhouse, and with Napoleon's guard dogs drunk, the pigs are left helpless in the face of their infuriated attackers. The film closes with a portrait of Napoleon falling off the wall, symbolizing his downfall as he and his fellow pigs are trampled underfoot, and Benjamin standing in grim triumph as he and his fellow animals retake the farm.","In popular culture":"The Clash used an image from the 1955 animated movie Animal Farm on their 45-RPM single \"English Civil War\".[10]","language":"English","production_company":"Halas and Batchelor","directed_by":"John Halas Joy Batchelor","Home media":"The 'Special Edition' DVD includes a documentary hosted by Tony Robinson.","narrated_by":"Gordon Heath","release_dates":"22 December 1954 (1954-12-22) (New York City)|||||","Production":"The animation historian Brian Sibley doubts that the team responsible was aware of the source of the funding initiating the project, which came from the Central Intelligence Agency to further the creation of anti-communist art.[2][3]The \"financial backers\" influenced the development of the film - the altered ending, and that the message should be that, \"Stalin's regime is not only as bad as Jones's, but worse and more cynical\", and Napoleon \"not only as bad as JONES but vastly worse\". And the \"investors\" were greatly concerned that Snowball (the Trotsky figure) was presented too sympathetically in early script treatments and that Batchelor's script implied Snowball was \"intelligent, dynamic, courageous\". This implication could not be permitted. A memo declared that Snowball must be presented as a \"fanatic intellectual whose plans if carried through would have led to disaster no less complete than under Napoleon.\" de Rochemont accepted this suggestion.[4]Halas and Batchelor were awarded the contract to make the feature in November 1951 and it was completed in April 1954. The production employed about 80 animators.[5]","produced_by":"John Halas Joy Batchelor","starring":"Maurice Denham","running_time":"70 minutes","music_by":"Mátyás Seiber","Release":"Much of the pre-release promotion for the film in the UK focused on it being a British film instead of a product of the Hollywood studios.To coincide with the film's release, a comic strip version was serialised in newspapers, drawn by Harold Whitaker, one of the animators.Scenes from Animal Farm, along with the 1955 TV programme Nineteen Eighty-Four, were featured in \"The Two Winstons\", the final episode of Simon Schama's program A History of Britain.","written_by":"Joy Batchelor John Halas Borden Mace Philip Stapp Lothar Wolff"}