{"country":"United States","distributed_by":"Universal Pictures","Plot":"In 1882, in the town of Old Stump, Arizona, a cowardly sheep farmer named Albert Stark (Seth MacFarlane) is dumped by his beloved girlfriend Louise (Amanda Seyfried) as a result of his withdrawal from a gunfight. He prepares to leave for San Francisco, believing that the frontier holds nothing for him. Meanwhile, infamous outlaw Clinch Leatherwood (Liam Neeson) robs and kills an old prospector (Matt Clark) for a gold nugget. He orders his right-hand man Lewis (Evan Jones) to escort his wife Anna (Charlize Theron) to Old Stump to lie low while he continues his banditry. Lewis and Anna arrive in Old Stump under the guise of two siblings intending to build a farm, but Lewis is arrested after shooting the Pastor's (John Aylward) son (Dylan Kenin) in a saloon. During the ensuing brawl, Albert saves Anna from being crushed to death by two of the brawlers, and the two become good friends. They attend a County Fair where Louise's new boyfriend, the foppish Foy (Neil Patrick Harris), challenges Albert to a shooting contest. Albert is defeated, but Anna steps up and defeats Foy. Foy mocks Albert, who angrily challenges Foy to a duel in a week's time.Anna teaches Albert how to shoot. During a barn dance the night before the duel, Anna slips Foy a Mickey. After leaving the dance, Albert and Anna kiss before heading home. Upon breaking out of jail and murdering the sheriff, Lewis witnesses the kiss and reports it to Clinch. On the day of the duel, Foy arrives late and goes into convulsions from the laxative he had unknowingly imbibed. Albert, who has decided that Louise is not worth the trouble, once again forfeits the duel. He retires to the saloon, but Clinch arrives and demands to know who kissed his wife. When no one comes forward, Clinch shoots a nearby cowboy (Ryan Reynolds). He reveals that Anna is his wife and threatens to continue killing unless his wife's lover duels him at noon the next day. Clinch later forces Anna to reveal Albert's name and then prepares to have sex with her, but she knocks him unconscious and escapes.Anna returns to Albert's farm where he shouts at her. Clinch pursues Anna to the farm; Albert helps her escape, then escapes himself. While fleeing, he is captured by a tribe of Apache Indians, who threaten to burn him alive. The Indians spare him when he reveals that he can speak their language. They give him a bowl of peyote, which sends him flashing back to his birth and through agonizing events of his childhood before making him realize that he loves Anna. Meanwhile, Clinch recaptures Anna in town, in front of Edward's (Giovanni Ribisi) house. Albert returns to Old Stump and confronts Clinch. He wounds Clinch with a bullet poisoned with rattlesnake venom before his own gun is shot out of his hand, but he manages to stall until Clinch fatally succumbs to the poison. Louise attempts to win back Albert, but he rejects her and instead happily enters a relationship with Anna. Albert also receives a bounty for killing Clinch and uses the money to buy more sheep.Later at the Fair, the proprietor of a racially charged shooting game \"Runaway Slave\" asks who would like to take a shot. Django (Jamie Foxx) steps up and shoots the man while commenting that \"people die at the fair\".","language":"English","box_office":"$87.2 million[3]","cinematography":"Michael Barrett","production_company":"Media Rights Capital Fuzzy Door Productions Bluegrass Films","directed_by":"Seth MacFarlane","Soundtrack":"The score was composed by Joel McNeely. The soundtrack was released by Back Lot Music on May 27, 2014.[62] The theme song \"A Million Ways to Die\" is performed by Alan Jackson. It was released as a single on April 29, 2014.[63] A portion of the Back to the Future theme by Alan Silvestri is used during Doc Brown's cameo.[13]All music composed by Joel McNeely, except as noted.","narrated_by":"Rex Linn","a_million_ways_to_die_in_the_west":"Theatrical release poster","release_dates":"May 30, 2014 (2014-05-30)|||||","Production":"A Million Ways to Die in the West originated as an inside joke between MacFarlane and co-writers Sulkin and Wild,[18] while they were watching Hang 'Em High.[19] The joke evolved into \"riffing on the idea of how dull, depressing, and dangerous it must have been to live in the Wild West.\"[18] MacFarlane, a lifelong fan of westerns, began researching the topic, using Jeff Guinn's nonfiction novel, The Last Gunfight: The Real Story of the Shootout at the O.K. Corral — And How It Changed the American West as an \"invaluable resource,\" and basis for many of the ways of dying in the film.[18] Various aspects of the film were inspired by real westerns. The decision to make Albert a sheep herder was inspired by Montana (1950) and his average, non-confrontational demeanor by 3:10 to Yuma (1957).[20] Other westerns that inspired MacFarlane and the crew during writing included Oklahoma! (1955), The Man Who Shot Liberty Valance (1962), and El Dorado (1966).[20]The film was first announced on December 3, 2012, marking MacFarlane's second foray into live-action directing, after 2012's Ted.[21] On January 30, 2013, it was announced that Charlize Theron had joined the film.[22] Theron later revealed that she \"begged\" for her role.[23] On February 11, it was announced Amanda Seyfried had joined the film.[24] On March 6, it was announced Liam Neeson and Giovanni Ribisi had joined the film.[25] On March 18, it was announced that Sarah Silverman was cast to play a prostitute in the film.[26] On May 10, it was announced that the film would be co-financed by Media Rights Capital and Fuzzy Door Productions, along with Bluegrass Films and distributed by Universal Studios.[27] On May 29, 2013, MacFarlane announced that Bill Maher had joined the cast.[16] On February 21, 2014, he announced that Gilbert Gottfried had also joined the cast.[14]Principal photography began on May 6, 2013.[28][29] Filming locations included various areas in and around Albuquerque, New Mexico,[30] also including the Santa Fe Studio in Santa Fe.[31] Principal photography ended on August 9, 2013.[32] The film shoot was difficult, as the cast and crew navigated rough weather: \"everything from hailstorms to blistering heat to arctic winds and torrential rainstorms.\"[18]Neeson, who nearly always suppresses his Irish accent when acting, agreed to play the part of Clinch only on the condition that he could use his Irish accent. Neeson remarked on The Tonight Show Starring Jimmy Fallon that he made this demand because an episode of MacFarlane's Family Guy had previously made a joke out of the juxtaposition of Neeson playing a cowboy with an Irish accent.[33]","produced_by":"Seth MacFarlane|Scott Stuber|Jason Clark|","starring":"Seth MacFarlane|Charlize Theron|Amanda Seyfried|Neil Patrick Harris|Giovanni Ribisi|Sarah Silverman|Liam Neeson|","running_time":"116 minutes[1]","music_by":"Joel McNeely","edited_by":"Jeff Freeman","Release":"On January 27, 2014, MacFarlane announced that he wrote a companion novel based on the film's script, which was released on March 4, 2014.[34][35] An audio-book version was also made available, narrated by Jonathan Frakes.[36] MacFarlane wrote the book on weekends during shooting for the film, partially due to boredom.[18]A Million Ways to Die in the West received mixed reviews from critics.[37][38] Review aggregation website Rotten Tomatoes gave the film a 33% rating based on 188 reviews, with an average score of 4.9/10. The site's consensus states, \"While it offers a few laughs and boasts a talented cast, Seth MacFarlane's overlong, aimless A Million Ways to Die in the West is a disappointingly scattershot affair.\"[39] Another review aggregation website, Metacritic, gave a score of 44 out of 100, based on 43 critics, indicating \"mixed or average reviews\".[37]Claudia Puig's review in USA Today was largely positive, writing, \"A Western with a contemporary sensibility and dialogue that sounds markedly modern, A Million Ways to Die in the West is quintessential MacFarlane, at once silly and witty, juvenile and clever.\"[40] Stephen Holden's review in The New York Times was mainly neutral, calling the film \"a live-action spinoff of [Family Guy], with different characters.\"[41] \"While the whole thing feels weirdly miscalculated to me, A Million Ways to Die in the West tweaks the formula just enough, delivers a few laughs and keeps the guest stars coming,\" wrote Salon columnist Andrew O'Hehir.[42] Rafer Guzman of Newsday found the film amusing, calling it \"another example of MacFarlane's ability to mix poop jokes with romance, foul language with sweet sentiment, offensive humor with boyish charm.\"[43]In a more mixed review, Scott Mendelson of Forbes commended MacFarlane's decision to make an unconventional western comedy, but summarized the film as \"just ambitious enough for that to be genuinely disappointing.\"[44] Michael O'Sullivan at The Washington Post was mixed, deeming the film a \"broad, wildly hit-or-miss satire,\" remarking that he found few of the jokes in the film funny.[45] \"Spiritually, it's closer to a mid-range crowd-pleaser such as City Slickers than Blazing Saddles, too enamoured of genre convention to reach for the comic dynamite,\" wrote Mike McCahill at The Guardian.[46]Much of the film's criticism was directed towards its writing, running time, and MacFarlane's debut live-action performance. Michael Phillips of the Chicago Tribune criticized MacFarlane's acting and direction as: \"A failure of craft. He can't direct action, or even handle scenery well. He can't set up a visual joke properly without resorting to head-butting and bone-crunching, and he doesn't know how, or when, to move his camera. He's not good enough as a romantic lead to anchor a picture.\"[47] Richard Corliss of Time called the film a \"sagebrush comedy whose visual grandeur and appealing actors get polluted by some astonishingly lazy writing.\"[48] Scott Foundas of Variety found the film \"overlong and uninspired,\" criticizing the film's \"lazy writing,\" and MacFarlane's \"surprisingly bland\" comic performance.[49]Rene Rodriguez of the Miami Herald gave the film one star, commenting, \"There are enough laughs scattered throughout A Million Ways to Die in the West that while you're watching it, the movie seems like a passable comedy. By the time you get home, though, you can barely remember the jokes.\"[50] John DeFore of The Hollywood Reporter criticized the film's running time: \"Though the film is hardly laugh-free, its uneven jokes appear to have breezed through a very forgiving editing process.\"[51] Joe Morgenstern of The Wall Street Journal too found the film's length \"exhausting,\" noting, \"Some of it sputters, settling for smiles instead of laughs, and much of it flounders while the slapdash script searches [...] for ever more common denominators in toilet humor.\"[52]Audiences surveyed during the opening weekend gave the film a CinemaScore \"B\" grade. The audience demographics were primarily male (55 percent) and over 25 years of age (72 percent).[53]A Million Ways to Die in the West grossed $43.1 million in North America and $43.3 million in other territories, for a worldwide total of $86.4 million, against its $40 million budget.[3]The film grossed $16.8 million in its opening weekend, finishing in third place at the box office behind fellow newcomer Maleficent and the previous weekend's opener X-Men: Days of Future Past.[3] This was below expectations of $26 million.[54] In its second weekend, the film dropped to number five, grossing an additional $7.3 million.[55] In its third weekend, the film dropped to number eight, grossing $3.2 million.[56] In its fourth weekend, the film dropped to number 11, grossing $1.6 million.[57]A Million Ways to Die in the West was released via DVD and Blu-ray on October 7, 2014.[58] The Blu-ray release contains an unrated version (135 minutes), along with the original theatrical cut (116 minutes).","written_by":"Seth MacFarlane|Alec Sulkin|Wellesley Wild|","budget":"$40 million[2]"}