{"country":"United Kingdom","distributed_by":"Rank Organisation","Plot":"The seaside town of Fircombe is facing a crisis – it's always raining and there's nothing for the tourists to do. Councillor Sidney Fiddler (Sid James) hits on the notion of holding a beauty contest. The mayor, Frederick Bumble (Kenneth Connor), is taken with the idea but feminist councillor Augusta Prodworthy (June Whitfield) is outraged and storms out of the meeting. The motion is carried in Augusta's absence, and Sidney contacts publicist Peter Potter (Bernard Bresslaw) to help with the organization. Sidney's girlfriend, Connie Philpotts (Joan Sims), runs a local hotel and soon her residents—including the eccentric Mrs Dukes (Joan Hickson) and the Admiral (Peter Butterworth)—are outnumbered by putative models, including diminutive biker Hope Springs (Barbara Windsor) and tall, buxom Dawn Brakes (Margaret Nolan). A catfight orchestrated by Hope provides better newspaper copy than bringing a donkey off the beach which, despite the bucket and spade of hotel employee William (Jack Douglas), ruins the plush carpets. Augusta's son, press photographer Larry (Robin Askwith), is hired to document the donkey stunt and snaps the catfight that has the Mayor losing his trousers, then gulps his way through a nude photo shoot with Dawn. The Mayor's wife, Mildred (Patsy Rowlands), joins Prodworthy's bra-burning movement and plots the downfall of the Miss Fircombe contest on the pier. Peter Potter reluctantly becomes a man in a frock for another publicity gimmick for the television show Women's Things, presented by Cecil Gaybody (Jimmy Logan) and produced by Debra (Sally Geeson). Prodworthy and butch feminist Rosemary (Patricia Franklin) call in the police (David Lodge and Billy Cornelius) to investigate the male pageant contestant but Peter's previously prim girlfriend, Paula (Valerie Leon), has a makeover and steps into the breach as the mysterious girl. Prodworthy's gang put \"Operation Spoilsport\" into action, sabotaging the final contest with water, mud and itching powder. With an angry mob after his blood, Sidney makes his escape with Hope on her motorcycle.","language":"English","Certification":"The film marked a slightly more risqué treatment of the topic with more nudity and openly sexual jokes than previous films. Discreet cuts by the BBFC (mainly to saucy dialogue and the hotel fight sequence between bikini-clad contestants played by Barbara Windsor and Margaret Nolan) enabled the film to gain the more commercially acceptable A certificate (open to families) than the more restrictive AA certificate, barring entry to the under-fourteens.","cinematography":"Alan Hume","directed_by":"Gerald Thomas","release_dates":"November 1973","carry_on_girls":"Original UK quad poster","produced_by":"Peter Rogers","starring":"Sid James Barbara Windsor Joan Sims Kenneth Connor Bernard Bresslaw June Whitfield Peter Butterworth Jack Douglas Patsy Rowlands Jimmy Logan","running_time":"88 mins","Filming and locations":"Interiors:Exteriors:","music_by":"Eric Rogers","edited_by":"Alfred Roome","Notes":"Valerie Leon's voice for the film was dubbed by co-star June Whitfield.[1]","written_by":"Talbot Rothwell","budget":"£205,962"}