{"Cast":"In order of appearance:Cast notes:Goring was offered the role of the Conductor, but insisted that he wanted to play Peter instead; however Powell and Pressbrger were set on Niven playing the part, and eventually told Goring that the Conductor was his only choice: if he turned it down, they would approach Peter Ustinov to play the part.[7]Powell and Pressburger went to Hollywood to cast the role of June with no possible actress in mind except, possibly, Betty Field, who was in a play in New York at the time. The suggestion of Kim Hunter came from Alfred Hitchcock, who had recently used her to read lines from behind the camera for Ingrid Bergman's screen test for Spellbound. Hunter had stage experience and had been under contract to David O. Selznick for two years. Powell and Pressburger decided that she was right for the part almost immediately on their first meeting, and arranged with Selznick to use her.[8]","Adaptations":"The film was twice adapted for the American CBS Radio series Lux Radio Theatre, both with the title \"Stairway to Heaven\", starring Ray Milland on 27 October 1947 (episode 587)[27] and featuring David Niven on 12 April 1955 (episode 918).[27]The film was also adapted for the American NBC Radio series Screen Director's Playhouse series as \"Stairway to Heaven\", airing on 26 July 1951 and starring Robert Cummings and Julie Adams.[28]An adaptation titled \"Stairway to Heaven\" aired as a live performance on the American television show Robert Montgomery Presents on 9 April 1951 on NBC, starring Richard Greene.[29]The film was adapted as the musical Stairway to Heaven at the King's Head in Islington in November 1994.[30] It was also made into a play by the Kneehigh Theatre for performances at the National Theatre in London, premiering in May 2007.[31]","country":"United Kingdom","distributed_by":"Eagle-Lion Films (UK)","language":"English","box_office":"$1,750,000 (US)[2]","cinematography":"Jack Cardiff","production_company":"The Archers J. Arthur Rank","directed_by":"Michael Powell Emeric Pressburger","narrated_by":"John Longden","release_dates":"1 November 1946 (UK premiere) 15 December 1946 (UK general)","Production":"A Matter of Life and Death was filmed at D&P Studios and Denham Studios in Denham, Buckinghamshire, England, and on locations in Devon and Surrey. The beach scene was shot at Saunton Sands in Devon, and the village seen in the camera obscura was Shere in Surrey. Production took place from 2 September to 2 December 1945, used 29 sets, and cost an estimated £320,000, equivalent to £12,450,000 in 2015.[9][10]A Matter of Life and Death had an extensive pre-production period due to the complexity of the production: The huge escalator linking this world with the other, called \"Operation Ethel\" by the firm of engineers who constructed it under the aegis of the London Passenger Transport Board, took three months to make and cost £3,000, equivalent to £117,000 in 2015. \"Ethel\" had 106 steps, each 20 feet (6.1 m) wide, and was driven by a 12 hp engine. The full shot was completed by hanging miniatures.[6][page needed] The noise of the machinery prevented recording the soundtrack live — all scenes with the escalator were dubbed in post-production.There was a nine-month wait for film stock and Technicolor cameras because they were being used by the US Army to make training films.[3][page needed] The decision to film the scenes of the \"other world\" in black and white added to the complications. Where the \"other world\" is seen, it was filmed in Three-Strip Technicolor, but the colour was not fully developed, giving a pearly hue to the black and white shots, a process cited in the screen credits as \"Colour and Dye-Monochrome Processed in Technicolor\".[3] (As Conductor 71 remarks during an early transition, \"One is starved for Technicolor up there.\")Other sequences also presented challenges, such as the stopped-action table-tennis game for which Hunter and Livesey were trained by champions Alan Brooke and Viktor Barna;[6] the scene where Carter washes up on the beach, the first scene filmed, where cinematographer Jack Cardiff fogged up the camera lens with his breath to create the look he wanted; and the long, 25-minute trial sequence, which required a set with a 350-foot (110 m) long by 40-foot (12 m) high backcloth.[11]","running_time":"104 minutes","Release":"A Matter of Life and Death was chosen for the first ever Royal Film Performance on 1 November 1946 at the Empire Theatre, in London.[12] The performance was in aid of the Cinematograph Trade Benevolent Fund and £30,000 (£1,122,258 in 2016 pounds[13]) was raised.[12] It then went into general release in the UK on 15 December 1946.[14] The film subsequently had its US release in New York on 25 December 1946 under the name Stairway to Heaven.[15]According to trade papers, the film was a \"notable box office attraction\" at British cinemas in 1947.[16]In 1986 the film was screened out of competition at the Cannes Film Festival.[17]","budget":"£320,000 (est.) or £650,000.[1]","Plot":"On 2 May 1945, Squadron Leader Peter Carter (David Niven) is a British Royal Air Force pilot trying to fly a badly damaged and burning Lancaster bomber back to his base in England after a mission over Germany. He has ordered his crew to bail out, without revealing that his own parachute has been shot up. He manages to contact June (Kim Hunter), an American radio operator based in England and talks with her for a few minutes before jumping without a parachute.Peter should have died at that point, but Conductor 71 (Marius Goring), the guide sent to escort him to the Other World, misses him in the thick fog over the English Channel. The airman wakes up on a beach near June's base. At first, he assumes he is in the afterlife but, when a de Havilland Mosquito flies low overhead, discovers, to his bewilderment, that he is still alive.Peter meets June cycling back to her quarters after her night shift; and they fall in love. Conductor 71 (a French aristocrat guillotined in the Revolution) stops time to explain the situation, urging Peter to accept his death and accompany him to the Other World; but Peter demands an appeal. While Conductor 71 consults his superiors, Peter continues to live his life. Conductor 71 returns and informs him that he has been granted his appeal and has three days to prepare his case. He can choose a defense counsel from among all the people who have ever died, but he has difficulty picking one.Peter's visions are diagnosed by June's fascinated friend Doctor Reeves (Roger Livesey) as a symptom of a brain injury – chronic adhesive arachnoiditis from a slight concussion two years earlier – and he is scheduled for surgery. Reeves is killed in a motorcycle accident while trying to find the ambulance that is to take Peter to the hospital, which allows him to act as Peter's counsel.Reeves argues that, through no fault of his own, his client was given additional time on Earth and that, during that time, he has fallen in love and now has an earthly commitment that should take precedence over the afterlife's claim on him. The matter comes to a head – in parallel with Peter's brain surgery – before a celestial court – the camera zooms out from an amphitheatre to reveal that it is as large as a spiral galaxy. The prosecutor is American Abraham Farlan (Raymond Massey), who hates the British for making him the first casualty of the American Revolutionary War. Reeves challenges the composition of the jury, which is made up of representatives who are prejudiced against the British. In fairness, the jury is replaced by a multicultural mixture of modern Americans whose origins are as varied as those they replace.Reeves and Farlan both cite examples from British and world history to support their positions. In the end, Reeves has June take the stand (Conductor 71 makes her fall asleep in the \"real\" world by so she can testify) and proves that she genuinely loves Peter by telling her that the only way to save his life is to take his place. She steps onto the stairway to the Other World without hesitation and is carried away, leaving Peter behind. Then the stairway comes to an abrupt halt and June rushes back to Peter's open arms. As Reeves triumphantly explains, \"... nothing is stronger than the law in the universe, but on Earth, nothing is stronger than love.\"The jury rules in Peter's favour. The Judge (Abraham Sofaer) shows Reeves and Farlan the new lifespan granted to the defendant; Reeves calls it \"very generous\", and Farlan jokingly complains, then agrees to it. The two then engage in supportive banter with one another, and against the stern Chief Recorder, who protests against the breach of law. The scene then shifts to the operating room, where the surgery is declared a success by the surgeon (Abraham Sofaer).","Critical reception":"Upon its premiere in New York City, Bosley Crowther said \"the delicate charm, the adult humor and visual virtuosity of this Michael Powell—Emeric Pressburger film render it indisputably the best of a batch of Christmas shows...[T]he wit and agility of the producers, who also wrote and directed the job, is given range through the picture in countless delightful ways: in the use, for instance, of Technicolor to photograph the earthly scenes and sepia in which to vision the hygienic regions of the Beyond (so that the heavenly 'messenger', descending, is prompted to remark, 'Ah, how one is starved for Technicolor up there!'.\"[18]","Analysis":"According to Powell in his A Life in Movies, the United States was the only market in which the film's name was changed, except that most European countries used \"A Question of Life and Death\" rather than \"A Matter of Life and Death\". The American title was the idea of Arthur Krim and Robert Benjamin, two lawyers just starting out in the film business, who would be marketing the film in the US, and insisted that no film had ever done well there with the word \"death\" in the title. When Pressburger countered with the hit film Death Takes a Holiday, their response was to point out that it succeeded because the very fact that Death was on holiday meant that there would be no death in the film.[19]While the film never specifically states whether Peter's visions are real, the actor playing the judge also plays the brain surgeon. As is shown in the paper, \"A Matter of Fried Onions\"[20] and subsequent work by Diane Broadbent Friedman, there was a large amount of medical research carried out to ensure that the symptoms shown agreed with a correct medical diagnosis of Peter Carter's condition. However, despite being asked several times within the film, no accepted answer to how Peter could have survived the fall is given.There are two scenes set within \"the other world\" in which Peter is not present (Trubshawe's arrival and just before the start of the trial) which seem to imply the existence of the other world. A minor point regarding a borrowed book (which forms a third \"other world\" experience while Peter is still unconscious following his operation) also seems to hint at the possibility of its existence; however, these could all be explained simply by Peter's mind filling in blanks during times he is unconscious.The producers took pains never to refer to \"the other world\" as heaven, as they felt that was too restrictive and limiting. An introductory title screen – repeated as the Foreword to the 1946 novelisation by Eric Warman[6] – contains an explicit statement: \"This is the story of two worlds, the one we know and another which exists only in the mind of a young airman whose life and imagination have been violently shaped by war\", but goes on to say \"Any resemblance to any other world known or unknown is purely coincidental\".Powell and Pressburger objected to the American distributor's renaming the film Stairway to Heaven, to no avail. The distributor believed that American audiences would not want to see a film with the word \"Death\" in the title, especially just after World War II. When Powell pointed out that the 1934 film Death Takes a Holiday was released without any problems, he was told that the title was acceptable because death was holidaying.[21]The architecture of the other world is noticeably modernist, a vast and open plan, with huge circular observation holes, beneath which the clouds of Earth can be seen. This vision was later the inspiration[22] for the design of St.Paul's Bus Station, Walsall in 2000, by architects Allford Hall Monaghan Morris. The film's amphitheatre court scene was rendered by BT in a TV advertisement c.2002 as a metaphor for communication technology, especially the Internet.[23]Lining the escalator are large statues of historically prominent men. A list of the names of the statues appears in Michael Powell's handwriting on pages 49 and 50 of the script.[24]They are:Many of these have in common a characteristic beyond their prominence in politics, art and philosophy: in 1945 most were believed to have had epilepsy – as did John Bunyan, who is seen in the film serving as the conductor for Dr. Reeves.[25]The film was originally suggested by a British government department to improve relations between the Americans in the UK and the British public, following Powell and Pressburger's contributions to this sphere in A Canterbury Tale two years earlier, though neither film received any government funding nor input on plot or production. There was a degree of public hostility towards American servicemen stationed in the UK prior to the D-Day invasion of Europe. They were viewed by some as latecomers to the war and as \"overpaid, oversexed and over here\" by a public that had suffered three years of bombing and rationing, with many of their own men fighting abroad. The premise of the film is a simple inversion: the British pilot gets the pretty American woman rather than the other way round, and the only national bigotry – against the British – is voiced by the first American casualty of the Revolutionary War. Raymond Massey, portraying an American, was a Canadian national at the time the film was made, but became a naturalised American citizen afterward.[26]","References":"Explanatory notesCitationsBibliography","produced_by":"Michael Powell Emeric Pressburger George Busby","starring":"David Niven Roger Livesey Raymond Massey Kim Hunter Marius Goring","a_matter_of_life_and_death":"UK cinema poster","music_by":"Allan Gray","edited_by":"Reginald Mills","written_by":"Michael Powell Emeric Pressburger"}