{"country":"India","distributed_by":"Eros Labs/Warner Bros.","Plot":"A young boy named Ajay (Shah Rukh Khan) asks a doctor to come see his mother Shobha (Rakhee), who is unconscious due to a particular incident. Ajay promises Shobha that he will get revenge on the people, who are responsible for making Ajay & Shobha cry. The deaths of Ajay's father (Anant Mahadevan) & baby sister have made Shobha fall unconscious.Years later, a young Ajay meets Madan Chopra's (Dalip Tahil) daughter Seema (Shilpa Shetty). Ajay manages to cozy up to Seema, and she falls in love with him. Meanwhile, Ajay pretends to be Vicky Malhotra to create a good impression in the minds of both Chopra and his younger daughter Priya (Kajol). Ajay manages to keep his affair with Seema a secret, under the impression that Seema too doesn't let anybody know she is in love. When Chopra decides to get Seema married, she decides to elope with Ajay. Ajay takes advantage of the opportunity and tricks her into writing a suicide letter. Later, on premise of getting married secretly, Ajay calls Seema to the office for marriages in Bombay. He takes her to the terrace and suddenly pushes her down, using her suicide note to close the case as suicide. Chopra too hastily has the case closed to prevent any further embarrassment. Ajay uses Seema's death to gets close to Priya and Chopra. Priya, however, is suspicious that her sister didn't commit suicide. With help of her college friend and Police Inspector Karan Saxena, she decides to investigate the matter secretly. Ravi, another friend of Seema, who had a crush on her, tells Priya about Seema's secret lover. Ravi finds a photo where Seema and Ajay are together at a birthday party, but is killed by Ajay. Ajay forces Ravi to sign a suicide note, making Priya and Karan believe that Ravi must have been Seema's lover and murderer. Ajay began a double game whilst keeping both the parties in dark. When Ajay puts eye contact lenses on his eyes to use his fake ID Vicky again, it's revealed that Madan is the person responsible for making Ajay & Shobha cry.The next day when Ajay sees Madan's chair at Madan's company, a flashback is shown.When Ajay's father a reputed businessman Vishwanath Sharma discovers that his manager Madan is embezzling money right under his nose, Sharma has Madan thrown in jail. After Madan completes his jail term, he re-approaches Sharma and asks for forgiveness. Vishwanath rebukes him, but his wife Shobha takes pity on Chopra's daughters and pleads to her husband. Chopra is reappointed in the company. However, Chopra has come back to exact revenge on his former boss. Slowly, but surely, Chopra regains the confidence of Sharma. One day, when Sharma has to go for a business tour, he hands over the power of attorney to Chopra so he can run the company in his absence. Chopra, who has been waiting for such chance, usurps Sharma's company and becomes its de facto owner. Sharma learns of this treachery, by which time his family is ejected out of their home after Chopra takes a loan out in there name. More tragedy strikes the Sharma household when his newborn daughter dies of fever and Sharma himself dies of a heart attack while trying to buy medicines for her. Devastated by the turn of events, Shobha goes insane, while Ajay decided to avenge the wrongdoings by making Chopra pay in the same coin.Later, Priya and Vicky coincidentally meet Seema's college friend, Anjali at a jewelry store. Anjali thinks that she recognizes Vicky. When she finds out the photo as well, she calls the Sharma household during Vicky's and Priya's engagement party. Vicky intercepts the phone, impersonates Chopra, and arrives at her place. He strangles her, stuffs her body in a suitcase, and throws it in the river. A man and his dog find the body soon after. Priya and Karan realize that the murderer is still alive. Meanwhile, history repeats itself, with Chopra handing over the power of attorney to \"Vicky\". Ajay decides to hasten up his plans on learning that Priya and Karan are still bent on finding the killer.Ajay's plan hits a glitch when he and Priya run into the real Vicky Malhotra, Ajay's friend whose identity he had taken. Priya becomes suspicious and decides to contact this Vicky. After returning from his business trip, Chopra is shocked to find that the company is run by a Sharma group. Now, Ajay reveals the truth to Chopra and kicks him out of the company after humiliating him.Meanwhile, Priya too learns of Ajay's true identity from Vicky, and rushes to Ajay's home in Panvel. She is shocked to see a poster of Ajay and finds a marriage locket with the photos of him with her sister. Ajay comes home, where she confronts him with his misdeeds. He tells her the whole story, and she is shocked at the revelation of what her father did to Ajay's family. Although Ajay killed innocent Seema, Priya has sympathy for Ajay. Chopra arrives at Vicky's house, with his henchmen to kill Ajay and exact revenge. Ajay goes outside the house to see some cars coming into his house and is shot by Chopra. After seeing Ajay being beaten by Chopra and hearing Chopra's name being repeated, Shobha regains her sanity and runs to her son's defense. Ajay starts bashing Chopra's goons and overpowers Chopra. Despite the circumstances, Karan and Priya sympathize with Ajay. In a standoff with Chopra, Ajay decides to spare Chopra's life, but then Chopra impales Ajay with a long iron bar, and laughs about his victory. Ajay begins to laugh maniacally as well and rams the bar into Chopra's stomach, with both plummeting down from a high wall, killing Chopra, mortally wounding Ajay as well.Ajay makes it back to his mother who finally recognizes her son. Ajay promises her that he's gotten revenge for their family misfortunes and reacquired everything that was meant to be theirs; now wanting only to rest peacefully in her embrace. Priya and Karan watch despondently as Ajay dies in his mother's arms finally at peace.","language":"Hindi","baazigar_बाजीगर":"Realese Poster","cinematography":"Thomas A. Xavier","directed_by":"Abbas-Mustan","Soundtrack":"The music was composed by Anu Malik and won the Filmfare award for best music director. The song \"Yeh Kaali Kaali Aankhein\" was very popular which bagged singer Kumar Sanu his fourth consecutive Filmfare Award for Best Male Playback Singer after Aashiqui, Saajan and Deewana. Other Singers of this album are Asha Bhosle, Pankaj Udhas, Alka Yagnik, Vinod Rathod and Sonali Bajpai. The song titles are listed below. The soundtrack was released by Venus Music. Dr. Alban's song 'Its my life' was also featured in the film.","release_dates":"12 November 1993","Box office":"Baazigar was a commercial success and the fourth highest grossing Hindi film of 1993.[5]","produced_by":"Ganesh Jain","starring":"Shah Rukh Khan Kajol Siddharth Ray Shilpa Shetty Raakhee","running_time":"182 minutes","music_by":"Anu Malik","written_by":"Robin Bhatt Akash Khurana Javed Siddiqui"}