{"based_on":"Amadeus  by Peter Shaffer","country":"United States","distributed_by":"Orion Pictures","screenplay_by":"Peter Shaffer","Plot":"The story begins in 1823 as the elderly Antonio Salieri (F. Murray Abraham) attempts suicide by slitting his throat while loudly begging forgiveness for having killed Wolfgang Amadeus Mozart (Tom Hulce) in 1791. Placed in a lunatic asylum for the act, Salieri is visited by Father Vogler (Richard Frank), a young priest who seeks to hear his confession. Salieri is initially sullen and uninterested, but eventually warms to the priest and launches into a long \"confession\" about his relationship with Mozart.Salieri goes on telling his tale through the night, and into the next day. He reminisces about his youth, particularly about his devotion to God, and his love for music, despite his father's plans for him to go into commerce. He pledged to God to remain celibate as a sacrifice if he could somehow devote his life to music, and perceived his father's subsequent death as divine intervention to make this possible.Years later, Salieri is part of the 18th-century cultural elite in Vienna, the \"city of musicians\". He is respected, financially well-off, and has been appointed court composer for Holy Roman Emperor Joseph II (Jeffrey Jones). He is content, and believes his successes are God’s rewards for his piety.The famous child prodigy Mozart arrives in Vienna, and Salieri goes to a performance hoping to meet him, convinced that Mozart's genius must be a gift from God. Salieri secretly observes Mozart, and is shocked to discover that rather than the paragon of virtue that he has imagined, Mozart is in fact boorish, irreverent, and lewd. Later, when Mozart meets the Emperor, Salieri presents Mozart with a \"March of Welcome,\" which he had toiled to create. After hearing the march only once, Mozart plays it from memory, tactlessly critiques it, and effortlessly improvises a variation, transforming Salieri's \"trifle\" into what later would become the Non più andrai march from his opera The Marriage of Figaro.Salieri reels at the notion of God speaking through the childish, petulant Mozart: nevertheless, he regards his music as miraculous. Gradually, Salieri’s faith is shaken. He believes that God, through Mozart's genius, is cruelly laughing at Salieri's own musical mediocrity. Salieri's struggles with God are intercut with scenes showing Mozart's own trials and tribulations with life in Vienna: pride at the initial reception of his music, anger and disbelief over his subsequent snubbing by the Italians of the Emperor's court, happiness with his wife Constanze (Elizabeth Berridge) and his son Karl, and grief at the death of his father Leopold (Roy Dotrice). Mozart becomes more desperate as the family's expenses increase and his commissions decrease. When Salieri learns of Mozart's financial straits, he sees his chance to avenge himself, using \"God's Beloved\" (the literal meaning of \"Amadeus\") as the instrument.Salieri hatches a complex plot to gain ultimate victory over Mozart and God. He disguises himself in a mask and costume similar to one he saw Leopold wear at a party, and commissions Mozart to write a requiem mass, giving him a down payment and the promise of an enormous sum upon completion. Mozart begins to write the piece, the Requiem in D minor, unaware of the true identity of his mysterious patron and oblivious of his murderous intentions. Glossing over any details of how he might commit the murder, Salieri dwells on the anticipation of the admiration of his peers and the court, when they applaud the magnificent Requiem, and he claims to be the music's composer. Only Salieri and God would know the truth—that Mozart wrote his own requiem mass, and that God could only watch while Salieri finally receives the fame and renown that he deserves.Mozart's financial situation worsens due to his spendthrift lifestyle. This, combined with his heavy drinking, continued grief over the death of his father, and the composing demands of the Requiem and The Magic Flute drive him to the point of exhaustion as he alternates work between the two pieces. After a violent argument, Constanze leaves him and takes their son with her. His health worsens, and he collapses during a performance of The Magic Flute. Salieri takes the stricken Mozart home and convinces him to work on the Requiem. Mozart dictates while Salieri transcribes throughout the night. When Constanze returns in the morning, she tells Salieri to leave. Constanze locks the manuscript away despite Salieri's objections, but as she goes to wake her husband, she finds that Mozart is dead. The Requiem is left unfinished, and Salieri is left powerless as Mozart's body is hauled out of Vienna for burial in a pauper's mass grave.The film ends as Salieri finishes recounting his story to the visibly shaken young priest. Salieri concludes that God killed Mozart rather than allow Salieri to share in even an ounce of his glory, and that he is consigned to be the \"patron saint of mediocrity\". Salieri absolves the priest of his own mediocrity and blesses his fellow patients as he is taken away in his wheelchair. The last sound heard before the credits roll is Mozart's high-pitched laughter.","language":"English","Reception":"In 1985, the film was nominated for eleven Academy Awards, including the double nomination for Best Actor with Hulce and Abraham each being nominated for their portrayals of Mozart and Salieri, respectively. The film won eight Oscars, including Best Picture, Best Actor (Abraham), Best Director (Forman), Costume Design (Theodor Pištěk), Adapted Screenplay (Shaffer), Art Direction (Karel Černý, Patrizia von Brandenstein), Best Makeup, and Best Sound. The film was nominated for but did not win Oscars for Best Cinematography and Best Editing. Amadeus, The English Patient, The Hurt Locker, The Artist, and Birdman are the only Best Picture winners to never enter the weekend box office top 5 after rankings began being recorded in 1982.[5][6][7][8] Amadeus peaked at #6 during its 8th weekend in theaters. Saul Zaentz produced both Amadeus and The English Patient.The film was nominated for six Golden Globes (Hulce and Abraham were nominated together) and won four, including awards to Forman, Abraham, Shaffer, and Golden Globe Award for Best Picture – Drama. Jeffrey Jones was nominated for Golden Globe for Best Supporting Actor – Motion Picture Drama. Forman also received the Directors Guild of America Award for his work.At the end of the Oscar ceremony, Laurence Olivier came on stage to present the Oscar for Best Picture. As Olivier thanked the Academy for inviting him, he was already opening the envelope. Instead of announcing the nominees, he simply read, \"The winner for this is ‘Amadeus’.\" An AMPAS official quickly went onstage to confirm the winner and signaled that all was well, before Olivier then presented the award to producer Saul Zaentz. Olivier (in his 78th year) had been ill for many years, and it was because of mild dementia that he forgot to read the nominees.[9] Zaentz then thanked Olivier, saying it was an honour to receive the award from him,[10] before mentioning the other nominees in his acceptance speech: The Killing Fields, A Passage to India, Places in the Heart and A Soldier's Story. Maurice Jarre won the Oscar for Best Original Music Score for his scoring of A Passage to India. In his acceptance speech for the award, Jarre remarked \"I was lucky Mozart was not eligible this year\".[11]","box_office":"$56 million (North America)[2]","cinematography":"Miroslav Ondříček","production_company":"The Saul Zaentz Company","directed_by":"Miloš Forman","amadeus":"Theatrical release poster by Peter Sís","Music":"Film composer John Strauss won a Grammy Award for producing the soundtrack to the film.[13](all composed by Mozart except as noted)The original soundtrack to Amadeus reached #56 on Billboard's album charts, making it one of the most popular recordings of classical music ever. All of the tracks were composed by Mozart, save an early Hungarian folk tune and the final movement Quando Corpus Morietur et Amen by Giovanni Battista Pergolesi, from his famous Stabat Mater.The film features some music that is not included on the original soundtrack album release. As stated above, except where specified, all tracks were performed by the Academy of St. Martin in the Fields, conducted by Sir Neville Marriner, and all were performed specifically for use in the film. According to the film commentary by Forman and Schaffer, Marriner agreed to score the film if Mozart's music was completely unchanged from Mozart's original scores. Marriner did add some notes to Salieri's music that are noticeable in the beginning of the film, as Salieri begins his confession.Music featured in the film but not included on the soundtrack album (but included in a later extended version):","release_dates":"September 6, 1984 (1984-09-06) (Los Angeles)|September 19, 1984 (1984-09-19) (United States)||||","Production":"In his autobiography Beginning, Kenneth Branagh says that he was one of the finalists for the role of Mozart, but was dropped from consideration when Forman decided to make the film with an American cast.[3] Hulce reportedly used John McEnroe's mood swings as a source of inspiration for his portrayal of Mozart's unpredictable genius.[4]Meg Tilly was cast as Mozart's wife Constanze, but she tore a ligament in her leg the day before shooting started.[4] She was replaced by Elizabeth Berridge. Simon Callow, who played Mozart in the original London stage production of Amadeus, was cast as Emanuel Schikaneder, the librettist of The Magic Flute.The film was shot on location in Prague, Kroměříž and Vienna. Notably, Forman was able to shoot scenes in the Count Nostitz Theatre in Prague, where Don Giovanni and La clemenza di Tito debuted two centuries before. Several other scenes were shot at the Barrandov Studios.Forman collaborated with American choreographer Twyla Tharp.","Alternative versions":"Amadeus premiered in 1984 as a PG-rated movie with a running time of 161 minutes. In 2002, director Miloš Forman introduced an R-rated version with nearly 20 minutes of restored footage. This version was released by the studios as a Director's Cut. In the 1995 supplemental material for Pioneer's deluxe LaserDisc, Miloš Forman had justified why those scenes were cut in the first place. However, in a subsequent 2002 interview with The A.V. Club, the director explains why the scenes were eventually restored:When you finish a film, before the first paying audience sees it, you don't have any idea. You don't know if you made a success or a flop, when it comes to the box office. And in the '80s, with MTV on the scene, we are having a three-hour film about classical music, with long names and wigs and costumes. Don't forget that no major studio wanted to finance the film, for these reasons. So we said, \"Well, we don't want to be pushing the audience's patience too far\". Whatever was not directly connected to the plot, I just cut out. But it was a mutual decision [to limit the running time]. I wanted the best life for the film myself... Well, once we are re-releasing it on DVD, it doesn't matter if it is two hours and 40 minutes long, or three hours long. So why don't we do the version as it was written in the script?[12]","produced_by":"Saul Zaentz","starring":"F. Murray Abraham|Tom Hulce|Elizabeth Berridge|Simon Callow|Roy Dotrice|Christine Ebersole|Jeffrey Jones|Charles Kay|","running_time":"161 minutes[1]","edited_by":"Nena Danevic|Michael Chandler|","budget":"$18 million[2]"}