{"country":"Soviet Occupation Zone","distributed_by":"PROGRESS-Film Verleih","Plot":"At 1884, Guste is born as the illegitimate daughter of a maid. She marries a worker named Paul; her mistress gives her a set of common, checkered mattresses as a wedding gift. During the First World War, Paul is called to the front, and she remains alone with their children and works in a munitions factory. When she realizes how the capital of the great industry magnates had caused the war in the first place, Guste resigns and begins cleaning houses for a living. When the Nazis take over, Paul is fired from his job for being a trade-unionist, and dies. At the Second World War, their children are killed in a bombing. Gusta's granddaughter, Christel, is the only family she has now. After the war, as Christel is about to attend university - the first member of the family to have ever done so - her grandmother sews her a new dress from the old mattresses and tells her to always fight for peace and freedom.","language":"German","Reception":"The film had its premier in East Berlin's Babylon Cinema,[9] and sold 4,175,228 tickets.[10] For their work on the picture, Maetzig, Waterstradt, Spira and cinematographer Friedl Behn-Grund were all awarded the National Prize, 2nd degree, at 25 August 1949.[11] It was also entered into the 1949 Cannes Film Festival.[12]Girls in Gingham received great acclaim in all sectors of Germany.[8][13][14][15] the West German Der Spiegel praised it as one \"made with spirit and wit\" by Maetzig, who also \"employed good actors\". The magazine quoted favourable reviews by the American zone's Die Neue Zeitung, which described the film as \"a great epic\", as well as by the Socialist Unity Party of Germany's Neues Deutschland, the columnist of which \"was absolutely approving of it\".[9]Film scholars Miera and Antonin Liehm considered the ending of Girls in Gingham as \"schematic\", claiming that it foreshadowed the propagandistic style of his next work, The Council of the Gods.[13] Author Nick Hodgin wrote that the film presented one of the earliest examples of a self-assured, female protagonist, which would become a token character in later DEFA films.[15] Sabine Hake noted that while doing so in moderate style, the picture certainly promoted a Socialist message;[16] Michael Geyer argued that it portrayed the Marxist-Leninist interpretation of German history, explaining the great events of the 20th century in this fashion.[14] Still, the SED's cultural establishment later criticized The Beaverskin as lacking sufficient ideological commitment.[17]","cinematography":"Friedl Behn-Grund Karl Plintzner","production_company":"DEFA","directed_by":"Kurt Maetzig","release_dates":"8 July 1949 (1949-07-08)|||||","Production":"The script was adapted by author Berta Waterstradt from her successful radio drama,During the Blackout, which was broadcast in the Berlin Radio.[3] Waterstradt's screenplay was rejected by DEFA at first. Director Kurt Maetzig decided to film her script only after he realized he will not be able to create a picture based on a novel by Eduard Claudius.[4]The work on Girls in Gingham was relatively free from censure. It was created at the time before the Tito-Stalin Split and the founding of the German Democratic Republic forced strict censure on DEFA; according to Maetzig, the Soviet occupation authorities were determined not to force a USSR-style system on their subjects, but to allow them to develop their own model of Socialism.[5] Although the censors did criticize several points in the plot, like presenting the Proletariate worker Paul as rather passive, Maetzig and Waterstradt refused to make any amendments.[6] The director also told he was influenced by Bertolt Brecht's disapproval from his last picture, Marriage in the Shadows, which the latter described as \"utter kitsch\", and wished to avoid making an overly didactic movie.[7] Mark Silbermann claimed that the film was generally made in style reminiscent of Brecht's works during the 1920s.[8]Girls in Gingham was leading actress' Camilla Spira first role on screen since she was banned from working in cinema at 1935.[9]","produced_by":"Karl Schulz","starring":"Camilla Spira","running_time":"100 minutes","edited_by":"Ilse Voigt","written_by":"Kurt Maetzig Berta Waterstradt"}