{"directed_by":"Jonathan Parker","country":"United States","distributed_by":"Samuel Goldwyn Films","release_dates":"October 23, 2009 (2009-10-23)","Plot":"Set in the artsy Chelsea, this satirical film centers on a young bohemian avant-garde composer Adrian (Goldberg), who becomes involved with a trendy New York art gallery owner, Madeleine (Shelton). Adrian is a composer who makes music by breaking glass and kicking metal buckets. In contrast to Adrian is his brother Josh (Bailey), a successful painter who happens to bring Madeline to one of his brother's concerts. Madeleine is immediately drawn to Adrian's work and invites him to perform at her gallery and into her bedroom. Eventually, Josh discovers the secret relationship between Madeleine and Adrian, and the fact that Madeleine has been using Josh's paintings, which have commercial appeal, to keep the gallery running while it features more avant-garde work.","Director":"Jonathan Parker's debut film Bartleby (2001), an updated retelling of the classic Herman Melville tale \"Bartleby, the Scrivener\", was nominated for the Grand Prize at the Deauville Film Festival and was selected to be the opening night film of New York's New Directors/New Films Festival. A musician in his youth, Parker is also a collector of the San Francisco school of abstract expressionism, using many of his experiences in both worlds as a basis for (Untitled).","starring":"Adam Goldberg Marley Shelton Eion Bailey Vinnie Jones","running_time":"96 min.","language":"English","Reception":"The film received generally mixed to positive reviews from critics. The film currently has a 68% 'Fresh' rating on Rotten Tomatoes based on 18 reviews.[3] In another review, Metacritic reported that 58% of critics gave positive reviews, based on 10 reviews.[4] Lisa Schwarzbaum of Entertainment Weekly said \"The whole cast is museum quality, music and the performances are pitch-perfect in their dissonance. Gary Goldstein of Los Angeles Times called the film \"Ace in the best movie satires, there's a solid core of truth Informing director Jonathan Parker's (Untitled), which takes on the New York art and music worlds smart and funny in one swoop.\" New York Times' Stephen Holden says, \"If (Untitled) shrewdly hedges its bets about the value of it all, it is ultimately on the side of experimental music and art and their champions, no matter how eccentric. For that alone this brave little movie deserves an audience.\" The film also received bad reviews like that of Kevin B. Lee Time Out New York which he said \"(Untitled) 's onslaught of self-indulgent bohos and art-vs.-commerce cliches are as ersatz as their objects of scorn.\"The film premiered in the United States on October 23 where it opened in theaters and grossed in its first weekend $18,002.[5]","box_office":"$230,600[1]","written_by":"Catherine DiNapoli Jonathan Parker"}