{"based_on":"Alvin and the Chipmunks  by Ross Bagdasarian|The Chipettes  by Janice Karman|","country":"United States","distributed_by":"20th Century Fox","Plot":"Alvin, Simon, and Theodore, along with The Chipettes - Brittany, Jeanette and Eleanor - set up a surprise birthday bash for Dave that also serves as a good luck party for The Chipettes, who are scheduled to be guest judges on American Idol. Alvin invites and hires many people and celebrities to the dismay of Simon, before Dave returns home in dissatisfaction. Nevertheless, Dave agrees to take them to mini-golf, and meet Samantha, the woman he has been dating for the past few months. While the Chipmunks like Samantha, her son Miles is a bully who physically abuses the trio. Later, the Chipmunks find an engagement ring in a bag Dave brought home and believe that he's going to propose to Samantha. They try to steal the ring but are unsuccessful.Dave has to produce a record for rising pop artist Ashley Grey in Miami and decides to bring Samantha along with him. The Chipmunks and Miles are staying together, but they agree to head to Miami to sabotage the proposal. The Chipmunks drug three squirrels and dress them up in their clothes to fool their hard of seeing neighbor Ms. Price, who was tasked with looking after them. The Chipmunks travel on a plane, but Theodore lets out several animals which cause an emergency landing and brings the ire of unscrupulous air Marshall James Suggs, who resents the Chipmunks because Suggs' girlfriend left him for being so into them at the time. As a result, they are put in the No-Fly list.The Chipmunks head to a bar and perform, but this is interrupted by Suggs and they cause a bar brawl as a diversion. They jump into a cab sitting outside. After the cab driver learns they cannot pay him, he kicks the four out of the cab. The Chipmunks and Miles rest, and he reveals that his dad left him when he was five years old. They raise money to take a bus to New Orleans, and sing \"Uptown Funk\", which gets the attention of Dave when it is broadcast on live television, and allows for the Chipmunks to cause Suggs, who has followed them to New Orleans, to get drunk.Dave and Samantha meet up with Miles and the Chipmunks and proceed to take them to Miami. Because the Chipmunks are now on the No-Fly List, Dave has to drive the boys over. When they get there, Alvin reveals that he stole the ring from the container, thus ruining the proposal. However, Miles had bonded with the Chipmunks and was upset that they were celebrating over this. He crosses the street with his headphones on and is almost hit by a car, but the Chipmunks swing Theodore and push Miles out of the way, saving his life. They agree to give the ring back.During the dinner, Suggs catches up with the Chipmunks, but they trap him in an elevator. Miles and the Chipmunks return the ring to Dave, who reveals he never intended to propose to Samantha, and the ring belonged to his friend Barry. Dave is very disappointed in the kids, so they try to make it up to him by singing a new song to him at the launch party with the help of The Chipettes, Ashley, and Miles. Having forgiven them, Dave returns home with the Chipmunks and takes them to a courthouse where he officially adopts them. Dave says that nothing could ruin his day, but returns home to see the squirrels had destroyed everything. He then screams Alvin's name.In a mid-credits scene, Suggs has escaped the elevator and decides to relax by the pool. Since he is fired as an air marshall for his obsession over the Chipmunks, and since they are no longer wanted criminals, two hotel security guards carry him away.","language":"English","Reception":"As of March 3, 2016[update], Alvin and the Chipmunks: The Road Chip has grossed $84.9 million in North America and $138.8 million in other territories for a worldwide total of $223.6 million, against a budget of $90 million.[3]In the United States and Canada, The Road Chip was released on December 18, 2015 across 3,653 theaters alongside Sisters and Star Wars: The Force Awakens, with box office analysts believing the opening figures could be hurt by the latter.[24] The film grossed $4.1 million on its first day and $14.3 million in its opening weekend, finishing second at the box office behind The Force Awakens ($248 million).[3]On Rotten Tomatoes, the film has a rating of 16%, based on 62 reviews, with an average rating of 3.5/10. The site's critical consensus reads, \"In some respects, Alvin and the Chipmunks: The Road Chip is a marginal improvement over prior installments, although this in no way qualifies as a recommendation\".[6] Metacritic gives the film a score of 33 out of 100, based on 21 critics, indicating \"generally unfavorable reviews\".[25] On CinemaScore, audiences gave the film an average grade of \"A–\" on an A+ to F scale.[26]","box_office":"$234.8 million[3]","cinematography":"Peter Lyons Collister","directed_by":"Walt Becker","Home media":"Alvin and the Chipmunks: The Road Chip was released on DVD and Blu-ray on March 15, 2016.[6]","Soundtrack":"Alvin and the Chipmunks: The Road Chip: Original Motion Picture Soundtrack is the licensed soundtrack based on the film. It was released on December 11, 2015, by Republic Records.[23]","production_companies":"Fox 2000 Pictures Regency Enterprises Bagdasarian Company TSG Entertainment","Music":"Mark Mothersbaugh, who previously scored Alvin and the Chipmunks: Chipwrecked, returned to score The Road Chip.[22]","release_dates":"December 18, 2015 (2015-12-18)|||||","Production":"In June 2013, 20th Century Fox announced that a fourth installment, Alvin and the Chipmunks 4, would be released on December 11, 2015.[17] In August 2014, Randi Mayem Singer signed on to write the fourth installment.[18] On December 18, 2014, it was announced that Walt Becker signed on to direct and that the film would be released on December 23, 2015. The movie was officially released on December 18, 2015. It was also announced that the film would be titled Alvin and the Chipmunks: The Road Chip.[19] In February 2015, Tony Hale joined the cast.[8] On March 10, 2015, Kimberly Williams-Paisley joined the cast.[7] On March 23, 2015, it was confirmed that Bella Thorne had joined the cast.[11] Principal photography began on March 16, 2015, and ended on May 20, 2015.[20][21]","alvin_and_the_chipmunks:_the_road_chip":"Theatrical release poster","produced_by":"Janice Karman|Ross Bagdasarian, Jr.|","starring":"Jason Lee|Tony Hale|Kimberly Williams-Paisley|Josh Green|Justin Long|Matthew Gray Gubler|Jesse McCartney|Kaley Cuoco|Anna Faris|Christina Applegate|","running_time":"92 minutes[1]","music_by":"Mark Mothersbaugh","edited_by":"Ryan Folsey","written_by":"Randi Mayem Singer|Adam Sztykiel|","budget":"$90 million[2]"}