{"based_on":"I'll Never Go Home Any More 1949 novel  by Jerome Weidman","country":"United States","Awards and nominations":"The film won the Academy Award for Best Story for Philip Yordan. Katy Jurado was nominated for Best Supporting Actress. Jurado's role was originally for Dolores del Río. The film also won a Golden Globe Award as Best Film Promoting International Understanding.","distributed_by":"Twentieth Century-Fox","DVD release":"The film was released on DVD on May 24, 2005. Viewers have the option of watching either a \"pan and scan\" full screen version or the original wide screen version. Both versions have stereophonic sound and have been digitally restored.[6] The film has since been released on bluray by Twilight Time in the correct CinemaScope aspect ratio of 2.55:1.","Plot":"Matt Devereaux (Spencer Tracy) is a ranch owner who has tried to raise his sons to carry on the fierce, hard-working Irish settlement spirit that helped make him a success. However, as a consequence, he never learned to show his three sons from his first marriage the affection they yearned for and treats his boys only a little better than the hired help.Joe (Robert Wagner) is Matt's son by the Native American princess, Matt's wife \"Señora\" (Katy Jurado). The town's people call her Señora out of respect for Matt but not out of respect for her. Because of Joe's mixed ethnicity, he is treated prejudicially by his three half-brothers, Ben (Richard Widmark), Mike (Hugh O'Brian), and Denny (Earl Holliman)—all Caucasian sons of Matt's first wife.Joe loves his father and would do nearly anything for him, but his siblings resent Matt's emotional distance. The two middle kids rustle cattle and get two Mexicans killed, then get caught and shot by Matt and two Indians (whom they sacked the year before).Soon after 40 head of cattle die, Matt discovers a copper mine 20 miles away is polluting a stream where he waters his cattle. He becomes furious and leads a raid on the mine. The mine is on Matt's land, but he does not have the mineral rights. The law issues a warrant to arrest whoever was responsible for the attack. To spare his father the agony and humiliation of a stay behind bars, Joe claims responsibility and is sentenced to three years in prison.Ben and his other brothers rebel against their father with such extremity that the old man suffers a fatal stroke. Joe is permitted to leave prison long enough to attend his father's funeral, during which he formally severs his ties with his brothers and proclaims a blood feud.[4]Released from prison several years later, Joe returns to the ranch. Señora, his mother, persuades him to forget revenge and leave the country. Joe decides to take her advice, but when Ben crosses his path the two half-brothers engage in a fight that ends when Two Moons, the ranch foreman, shoots Ben dead. Time passes, and Joe and his wife visit Matt's grave. There, Joe sees the down-turned lance, the Indian symbol for a blood feud, and breaks it in half, thus ending the feud.[5]","language":"English","box_office":"$3.8 million (US rentals)[2][3]","cinematography":"Joseph MacDonald","directed_by":"Edward Dmytryk","release_dates":"1954 (1954)|||||","produced_by":"Sol C. Siegel","starring":"Spencer Tracy Robert Wagner Jean Peters Richard Widmark Katy Jurado","running_time":"96 minutes","broken_lance":"Theatrical release poster","music_by":"Leigh Harline","edited_by":"Dorothy Spencer","written_by":"Philip Yordan (story) Richard Murphy (screenplay)","budget":"$1,685,000[1]"}