{"country":"United States","distributed_by":"Embassy Pictures","Plot":"Adam Johnson is a talented African-American jazz cornetist, plagued by ill health, racism, alcoholism and a short temper, as well as guilt over the deaths years before of his wife and child. The result is a caustic personality that wears even on those who care the most about him, such as his best friend Nelson, and Vincent, a young Caucasian trumpeter whom Adam mentors. Arriving unexpectedly at his New York home drunk after walking out on his jazz quintet, Adam finds prominent Civil Rights worker Claudia Ferguson and her grandfather, Willie, who is himself a well-known jazz trumpeter, in his apartment. The two have been given access to the apartment by Nelson, but despite having authorized this, the drunken Adam is rude to both, that including making a vulgar pass at Claudia.The next day, a sober Adam is apologetic and strikes up a new friendship with the two. This eventually leads to a romance with Claudia, who cautions Adam that from that point on, she will not allow him to be any less than he is. Nelson warns Claudia against it, saying that although he understands what she sees in Adam, he will still ultimately only hurt her. She is not dissuaded, saying that she is determined not to let Adam destroy himself.The relationship has a positive effect on Adam and all is well until an encounter with some racist police officers. Adam tells them off and fights with them when they seek to take him into custody. Claudia is upset that he intentionally antagonized them, while Adam can't understand why she thinks he should submit to being humiliated. They quarrel, leading to Adam drinking more and beginning to lose control of his temper. Manny, Adam's booking agent, says he intends to send Adam on a tour of the South, insisting Adam accept whatever racist treatment he may encounter there. Adam violently threatens Manny and later physically assaults a jealous former girlfriend who had just slapped Claudia.Adam tells Claudia she is too good for him, but when he subsequently takes ill, she moves in with him and their relationship is renewed. He confesses to her his secret that he was driving while intoxicated during the car accident which killed his family, having gotten drunk in response to being demeaned and insulted by a racist police officer. Claudia convinces Adam's old group to reunite with him and things again seem to be looking up for him. However, the police pressure the owner of the club where the group plays to ban him. When he learns of this, Adam lashes out at everyone, including Nelson, Claudia and Vincent.A drunken Adam crawls back to Manny, who sends Adam on the Southern tour. Adam asks to have Vincent come along and they perform well together. On one occasion, Adam and Vincent hug after a particularly well-received number, prompting a violent audience reaction. This time, Adam maintains control of himself and does not respond. The tour continues very successfully, and upon returning home, a cheerful Adam proposes to Claudia.Afterward, Vincent is violently attacked in front of Adam and Claudia. Claudia looks for Adam to do something, but he remains frozen, only watching as a helpless Vincent is pummeled. Finally, Adam just runs away. Claudia reflects that it was her insistence that caused Adam to change from a man who would never accept any slight to the man she had just witnessed. She regrets that she effectively took away his manhood.Eventually, Adam resurfaces at the club, looking \"chewed up and spit out\", as Willie puts it. Adam is relieved to learn that Vincent is not dead. Despite his physical condition, Adam accepts the invitation to join the group on stage. His performance is first brilliant, with Claudia, Willie and Vincent all watching and thoroughly enjoying his resurgence. Soon, though, Adam begins to struggle physically and his playing turns frenetic. Eventually, everyone stops playing, leaving nothing but Adam's fevered trumpeting, which he attempts to continue even while virtually doubling over in agony. Finally, he collapses and dies, leaving his friends to grimly mourn him.","language":"English","Reception":"In its review, the Los Angeles Times was sharply critical of the film's script and pacing, but praised Davis' performance.[1]","cinematography":"Jack Priestley","directed_by":"Leo Penn","release_dates":"1966 (1966)|||||","Production":"A Man Called Adam features several musical numbers, including Louis Armstrong performing \"Back O' Town Blues\", Mel Tormé performing \"All That Jazz\" and Sammy Davis, Jr. performing \"Whisper To One\", the latter two songs composed for the film by Benny Carter. The film's trumpet performances by the Adam Johnson character were dubbed for Davis by Nat Adderley.Johnny Brown, who would later become better known as a comic actor on the television series Laugh-In and Good Times, had a dramatic role in A Man Called Adam as the blind pianist of Johnson's jazz quintet. Brown's future Good Times co-star Ja'Net DuBois also appeared in the film as a girlfriend of Adam Johnson","starring":"Sammy Davis, Jr. Ossie Davis Cicely Tyson","running_time":"103 minutes","a_man_called_adam":"Film poster","music_by":"Benny Carter","edited_by":"Carl Lerner","written_by":"Lester Pine Tina Pine"}