{"based_on":"Aqua Teen Hunger Force by Dave Willis and Matt Maiellaro","country":"United States","distributed_by":"First Look Pictures","Possible sequel":"There has been mention of producing a sequel entitled Death Fighter.[13] In a 2010 interview, staff members of Radical Axis confirmed that a sequel was indeed in production, and mentioned the possibility that the film might be made in 3D. When asked if the film was designed for a theatrical release, a Radical Axis staff member responded yes, but stated: \"We're not sure if we have a distributor yet.\" This was then followed by the statement: \"Adult Swim will never make another movie ever again.\"[14]By 2014, the script had been completed and approved;[15] however, on April 25, 2015, at a C2CE convention panel, Willis indirectly stated that the project was scrapped, soon after announcing the show's cancellation.[16][17] He later mentioned on Reddit that it would cost $3.4 million to produce, and expressed interest in doing a Kickstarter to fund it.[18]","screenplay_by":"Matt Maiellaro|Dave Willis|","Plot":"Before the main feature, a faux theater concession stand advertisement plays. A group of anthropomorphic theater snacks, The Soda Dog Refreshment Band, sings until they are interrupted by another snack band (performed by Mastodon). They proceed to loudly sing their own bizarre theater rules before finishing on a guitar solo.The film properly begins in Egypt, where Master Shake, Frylock, and Meatwad break free from the Sphinx, and are attacked by an oversized Poodle who kills Frylock before Shake defeats it. Shake and Meatwad flee with Frylock's corpse and meet Time Lincoln. He helps revive Frylock; however, when government agents break into his house, Time Lincoln helps the Aqua Teens escape in a wooden rocket ship. Time Lincoln is shot, changing the timeline and resulting in the Confederate States of America's victory in the American Civil War and the government agents being made slaves to a black Kentucky Colonel as punishment for their crimes against the South. All this, however, is an elaborate story concocted by Shake to explain their origin to Meatwad. A triangular slice of watermelon named Walter Melon is flying about in a spaceship made from a hollowed-out watermelon. He begins observing events of the Aqua Teens on Earth, including a backyard concert performed by Meatwad. All unfolding according to his plan. Walter Melon is joined in the ship by Neil Peart from Rush, sitting at his drums.Shake plans to work out on his new exercise machine, the \"Insanoflex\". Frylock notices that the machine isn't assembled properly and the instructions are nowhere to be found. He searches online for them and instead finds a website written in a rare dialect, with a message in English warning not to assemble the machine ever. The site however lists a phone number which Frylock calls. It is revealed to be the number of Emory and Oglethorpe, the Plutonians. Before they even bother to answer the phone, they discover the Cybernetic Ghost of Christmas Past from the Future on board with them. The Cybernetic Ghost explains to the two aliens the story of the Insanoflex: a machine, when assembled, will exercise a man into a super-being, who will attract all the women on Earth leading to massive inbreeding and the eventual extinction of mankind. To prevent this, the Ghost traveled to the past and stolen a single screw that holds the machine together. The Plutonians point out to him that to get it assembled, someone could just buy another screw or shove a pencil in the screw hole. Back on Earth, Frylock finishes re-building the Insanoflex, with a pencil in the screw hole, somehow having obtained instructions. He discovers a missing M-shaped circuit board on the back panel. The trio visit Carl, from whom Shake had stolen the machine, to see if he has the missing piece. After he refuses to tell them, Meatwad finds the address in the Insanoflex's box. Dr. Weird, whose abandoned asylum has been purchased and is being turned into condominiums around them, is visited by Shake, Frylock, and Meatwad. Frylock retrieves the missing circuit board and installs it into the machine upon returning home. Carl insists that as the rightful owner he should be the first to test out the machine. The Insanoflex straps him in and transforms itself into a giant one-eyed robot. The robot plays dance/techno music and heads for downtown Philadelphia, all while Carl's strapped-in form is forced to exercise. Eventually, the robot begins laying metallic spherical eggs, which hatch into smaller versions of the machine.The Aqua Teens, aided by an instructional workout video, find a way to destroy the machine by using music. With little time and a failed encounter with MC Pee Pants (reincarnated as a fly), the Aqua Teens have no choice but to have Shake play his music. Shake poorly plays his original song \"Nude Love\" on acoustic guitar, forcing the Insanoflex to commit suicide. Carl (now bulging with so much muscle that he can barely move) leaves with his newly found date, a female bodybuilder named Linda, and they head back to her condo while the Aqua Teens try to figure out a way to stop the newly hatched Insanoflexes from destroying the city.As they travel to a possible lead back at Dr. Weird's asylum, Frylock begins to tell the origin story of the Aqua Teens: they were created by Dr. Weird, along with a chicken nugget who had gone by the name of Chicken Bittle. In the flashback, Dr. Weird proclaims that the Aqua Teens were created for one purpose: to crash a jet into a brick wall. Realizing the pointlessness of this mission, Frylock diverted the jet and set a course to Africa, where they would try to use their intelligence to solve world hunger. Upon entering Africa, Bittle was attacked and eaten by a lion. The remaining Aqua Teens then tried to help a small village but instead scared them away. After realizing they couldn't be much help, they returned to America and rented out what is now their house in New Jersey. Shake and Meatwad state that they do not remember any of this, but Frylock explains it was because they were too busy playing Game Boy to pay any attention.Meanwhile, Carl and Linda recline in her room, where she reveals \"herself\" to be Dr. Weird in disguise. He cuts off Carl's muscles and grafts them onto his own body. Frylock and Dr. Weird do battle while they argue back and forth about who created whom. Dr. Weird claims that it was Frylock who created him, not the other way around. Dr Weird shows Frylock a teddy bear filled with razor blades. Shake tries to take the teddy bear, but he loses his hand. Dr. Weird then reveals that the blue diamond on Frylock's back hides a VCR, in which a video tape with false memories of Dr. Weird creating Frylock had been playing in Frylock's head. Frylock also admits that he is transsexual lesbian trapped in a man's body. Just then, Walter Melon arrives in his ship. Meatwad mentions he saw the ship earlier. Shake calls him a liar and shoots him with a shotgun. Shake gets concerned when Meatwad doesn't reform like always. Walter tells Neil to play the Drum Solo Of Life to bring Meatwad back to life. Meanwhile, Shake tries to pick up the teddy bear for the 2nd time, but loses his other hand. Shake forgets about his hands and leaves it. Walter Melon explains he created the Aqua Teens and all the other characters, including the Insanoflex. His plan was so that they would all eventually kill each other and Walter would inherit all their real estate in order to create the \"Insano-Gym\". Everyone, however, informs Walter that they all rent and do not own any property, proving Walter's plan and everyone's existence had been useless and pointless. Walter storms off in his ship, threatening to tell their mother. Just then, the Teens see their alleged mother standing before them, revealed to be a 9-layer bean burrito. Shake unknowingly jumps out the window, Meatwad hugs her and Frylock states, \"That's neat.\" In an abrupt end, The Soda Dog Refreshment Gang come onscreen once again and sing the audience out.In a post-credits scene, The Cybernetic Ghost of Christmas Past from the Future is seen humping the TV in the Aqua Teens' living room. Then a female box of fries (presumably Frylock who got a sex change) comes in and says, \"Time for bed, honey...\"","language":"English","Reception":"The film was a box office success, making $5,520,368 domestically against its $750,000 budget.[1]Aqua Teen Hunger Force Colon Movie Film for Theaters received mixed reviews from critics. With 28 reviews compiled, Metacritic reported that Movie Film for Theaters has received \"mixed reviews\" with an average rating of 54.[11] Rotten Tomatoes gave the film a \"Rotten\" rating of 48% and a consensus stating: \"The non sequitur humor of Aqua Teen Hunger Force will surely appeal to its built-in fanbase, but for the uninitiated, the premise wears thin\". Reviews ranged from Glenn Kenny at Premiere magazine, who stated that he was tempted to refer to the movie as \"the most successful full-on surrealist film since Buñuel and Dalí's 1930 L'Âge d'Or\", to Ty Burr of The Boston Globe, who called it \"an act of terrorism against entertainment\". Most critics, who were unfamiliar with the series and were largely unimpressed by the film, cited the Soda Dog Refreshment opening with Mastodon as funny and inspired. The film was given a thumbs down on the television show At the Movies with Ebert & Roeper with Richard Roeper criticizing the film's run time, though he admitted the first 5 minutes of the film were funny.In response to such reviews, a commercial featuring the Mooninites began airing during the Adult Swim block. The two characters spend the entire commercial insulting a supposedly typical reviewer, \"Lionel\" of lionellovesmovies.com (the site merely leads back to the movie page). Other commercials recommend people see the film two or three more times to push the box office numbers up. Adult Swim also mentioned in one of its commercial bumpers that the review situation highlights the generation gap, and that most negative reviews came from much older critics.","box_office":"$5.5 million[1]","Marketing":"The film's poster was illustrated by Julie Bell and Boris Vallejo, and parodies the \"King of the Mountain\" design.[6]On January 31, 2007, police in Boston, Massachusetts received reports of devices resembling bombs in various places around the city. The devices turned out to be electronic signs similar to a Lite-Brite that displayed images of the Mooninites Ignignokt and Err giving the finger, and were designed to promote the Aqua Teen Hunger Force television show as part of a guerrilla marketing campaign authorized by Cartoon Network, the cartoon's parent company. The boards were present in several cities for weeks before the ones in Boston were reported.[7]The Boston City Government sought a reimbursement for the money spent responding to the incident. The amount quoted was $500,000 initially, and then was increased to $750,000.[8]On February 5, it was announced that Turner Broadcasting and the city of Boston have reached an agreement to pay $2 million to offset the cost of removing the devices: $1 million to cover the cost of the agencies involved and an additional $1 million in goodwill funding to homeland security.[9]An episode from season five, entitled \"Boston\", was produced as the series creators' response to the scare, but Adult Swim pulled it to avoid further controversy surrounding the events of the bomb scare.[10]Adult Swim began running advertisements on March 25, 2007, advertising the television premiere of the movie the following Sunday, April 1, 2007. Its only reasoning behind this stunt, as stated in the advertisement, was, \"because we're fucking crazy\". While Adult Swim's TV listings on its website stated the movie would be shown, other TV listings reported the same Sunday block. It was, in actuality, another one of Adult Swim's annual April Fools' pranks: though the first few minutes of the movie were shown normally, the remainder was shown in a small picture-in-picture box in the bottom left-hand corner, with no sound over the normal programming and occasional giant pop-ups alerting viewers of its presence, as well as advertising the actual premiere. The advertising was shown again on one episode of the Family Guy marathon on July 6, 2007. The movie eventually was shown on Sunday, March 30, 2008. The day after the April Fools' joke, Cartoon Network showed another bumper, stating: \"Sorry you will still have to pay to actually see the movie. But thanks for the ratings!\"[citation needed]In yet another promotional stunt, the \"ending\" to the movie was posted in various places including YouTube, KingColon.com (in the Worst Game Ever game), and fansite \"Aqua Teen Central,\" all of which were completely different.Eventually, the Adult Swim website let it be known that none of the \"endings\" were real and presented seven more clips (which were fake as well) throughout the weeks following the film's release.These endings, now called the \"fake.com endings\", are available on the film's \"Extras\" DVD on the 2-Disc Collector's Edition. These endings are parodies of other films. For example, one of the endings spoofs The Terminator, featuring Meatwad as \"The Determinator\".","directed_by":"Matt Maiellaro|Dave Willis|","Home media":"Warner Home Video released Aqua Teen Hunger Force Colon Movie Film for Theaters in a two-disc DVD edition on August 14, 2007. For the DVD release, the studio changed the title of the eighty-seven-minute full-length movie to Aqua Teen Hunger Force Colon Movie Film for Theaters for DVD, just like the film soundtrack's title. The DVD features include the ten fake endings as shown on the internet, a \"making of\" featurette, promos, the \"Deleted Scenes\" episode, a music video, and an eighty-minute animatic (rough cut) of the movie made out of the deleted scenes from the film and scenes from the \"Deleted Scenes\" episode as well as a commentary. Rock and Roll Hall of Fame inductee Patti Smith is featured on the DVD commentary. The scene after the credits was removed from the UK DVD release.The set also features the season four episode \"Deleted Scenes\" (also known as \"Star-Studded Xmas Spectacular\"), which makes heavy references and parallels to the film that originally aired years prior to the film's release on December 18, 2005.The film is also available in HD and SD on the Xbox Live Marketplace.[12]","Soundtrack":"The soundtrack was released on April 10, 2007, under the title Aqua Teen Hunger Force Colon Movie Film for Theaters Colon the Soundtrack. It features many previously unreleased songs, some recorded for the purpose of this album. In addition, the compilation features an intro/outro titled \"Nude Love\" by Aqua Teen character Master Shake, a track from former SPIN.com Artist of the Day MC Chris, skits and sound bites from the movie, and a new version of the Aqua Teen Hunger Force theme by rapper Schoolly D.The album features mix of musical styles ranging from heavy metal, indie rock, and hip-hop; and also features new, original music from Mastodon, Killer Mike and Unearth. Noticeably missing is \"In the Air Tonight\" by Phil Collins, which is prominently featured at the end of the film.Note: Carey Means (Frylock) is absent from the skits, sound bites, and hidden tracks where the other Aqua Teens can be heard. Regardless, Carey Means still portrays Frylock in the film.","production_companies":"Adult Swim Williams Street","aqua_teen_hunger_force_colon_movie_film_for_theaters":"Theatrical release poster by Julie Bell and Boris Vallejo","release_dates":"April 13, 2007 (2007-04-13)|||||","Production":"In an interview at the 2005 San Diego Comic-Con, Dana Snyder and Matt Maiellaro confirmed rumors that there would be a feature-length movie of Aqua Teen Hunger Force. More details were revealed at the 2005 Paley Television Festival,[2] such as a possible cameo by 80s funk group Cameo, and Maiellaro described it as \"an action piece that leads into an origin story that unfolds in a very 'Aqua Teen' way.\"The creators revealed much more information in an interview with Wizard Entertainment. While they dodged many questions, they confirmed that the film would run 80 minutes, produced on a meager $750,000 budget, and features a plot detail about a \"lost Aqua Teen\", who is a large chicken nugget named \"Chicken Bittle\" (voiced by Bruce Campbell).[3] They also confirmed more cameos, with Rush drummer and lyricist Neil Peart, voice actor H. Jon Benjamin and his comedy partner Jon Glaser, and Saturday Night Live's Fred Armisen to make appearances. Heavy metal band Mastodon stated in a Decibel article that they would be performing during the opening, and that the band would be animated as a bucket of popcorn, a soda, a hot dog, and a candy bar. They were actually animated as a pretzel, a pile of nachos, an \"Icecaps\" box, and a gumdrop.[4]Regarding the film's rating, Maiellaro commented that \"I think if [the movie is rated] R, it won't get the audience that watches it. But we don't know yet. We're still waiting to find out.\" Following this, the released trailer advertised the film as rated R. The film is mostly uncensored; when censoring does occur, it is occasionally accompanied by a censoring beep that does not obscure the word. Censoring also occurs once during a flashback. As explained in the production feature, the inconsistency was an editing mistake, but left untouched for comic effect.","produced_by":"Jay Edwards|Matt Maiellaro|Dave Willis|","starring":"Dana Snyder|Carey Means|Dave Willis|Matt Maiellaro|Mike Schatz|Andy Merrill|C. Martin Croker|Bruce Campbell|Neil Peart|Chris Kattan|","running_time":"86 minutes","music_by":"Bill Fulton","edited_by":"John Brestan|Ned Hastings|Phil Samson|","budget":"$750,000[1]"}