{"based_on":"Characters  by Darryl Quarles","country":"United States","distributed_by":"20th Century Fox","Plot":"Malcolm Turner (Martin Lawrence) has been assigned a desk job in public relations as an FBI agent, since he wants to live with his new wife, Sherry Pierce (Nia Long), during her delivery for the couple's new baby boy. Meanwhile, an incident occurs in Orange County, California, where Malcolm's old friend, Doug Hudson (Kirk B.R. Woller), has been killed while he was going undercover. FBI agent Kevin Keneally (Zachary Levi) is doing surveillance on a former U.S. Army military intelligence specialist named Tom Fuller (Mark Moses), who has since retired and is working for a private corporation called National Agenda Software. The FBI has soon discovered that Tom is developing a computer worm which will create backdoors into the databases of all the branches of the U.S. government. Affected by his friend's death, Malcolm asks FBI chief, Crawford (Dan Lauria), to put him on the case, but Crawford refuses and tells him to stay away for safety analysis. By eavesdropping via the webcam, Malcolm finds out that the FBI is sending one of the agents to infiltrate Fuller's house as a nanny. Giving Sherry the pretext of attending a safety conference in Phoenix, Arizona, Malcolm leaves for Orange County and takes the \"Big Momma\" costume with him.Malcolm reprises his disguise as Big Momma from the original film and showing up at Fuller's house as Mrs. Fuller (Emily Procter) is interviewing several other candidates. Big Momma eliminates the three other applicants for the nanny position by pointing out the sexually attractive qualities of the first, the drug use of the second, and the concealed firearm of the third. Big Momma meets the three Fuller children: Molly (Kat Dennings), Carrie (Chloë Grace Moretz), and Andrew. After failing to perform the housekeeping tasks assigned to her, Big Momma is fired, and works all night cleaning up and makes a large breakfast. Upon seeing it the next day, Mrs. Fuller changes her mind when the family awakes to find this. Big Momma is soon accepted within the household and becomes a daily part of their lives. His tasks include accompanying Mrs. Fuller to the spa, taking the family to the beach, watching out for trouble, and simply playing a game of bingo as part of her routine. After Big Momma finds out the password from Tom, Molly calls him who tells her that she needs her at a nightclub. Big Momma goes at once, only to find that Molly was lured by Fuller's bosses, who kidnaps her and Big Momma. Big Momma and Molly are tied up and placed in the back of the van. Big Momma has a switchblade, which Molly reaches for and uses to free them. He sees that they are at the waterfront and witnesses Tom giving a disc to a man who puts it in his laptop and is granted full access to FBI data. Big Momma gets on a jet ski and jumps it onto the dock, sending it into two men, and landing on one himself. Big Momma helps Tom and they attempt to escape, but one of the men shot him. The FBI shows up, and Keneally gave Malcolm the handcuffs to put on Tom, but Malcolm tells the agent in charge that Tom's family was threatened, and that no charges should be filed. Malcolm and Keneally agree, and the case is closed.Sometime later, Big Momma goes to the girls' state cheerleading championships. Their stuntwoman broke her leg, and Big Momma helps them out by doing the routine and winning the competition. He later leaves and gives the family a farewell letter saying he must go on, but to look out, because one day he might be back.","big_momma's_house_2":"Theatrical release poster","language":"English","Reception":"Rotten Tomatoes ranked the film 80th in the 100 worst reviewed films of the first decade of the 21st century, with a rating of 6%, based on 71 reviews. The critical consensus was: \"Unfunny and unoriginal. In other words, a perfect piece of evidence for opponents of pointless movie sequels.\"[2] The film was nominated for a Golden Raspberry Awards in 2006 in the category \"Worst Prequel or Sequel\", but lost the trophy to Basic Instinct 2.Metacritic gives the film a score of 34% based on reviews from 20 critics, indicating \"generally unfavorable reviews\".[3]Its poor reception has been lampooned in The Onion.[4]Big Momma's House 2 grossed $27,736,056 in its opening weekend ranking number one.[5] As of March 3, 2011, the film has grossed a total of $70,165,972 at the United States box office with a worldwide gross of $138,259,062.","box_office":"$138 million[1]","cinematography":"Mark Irwin","production_company":"Regency Enterprises Runteldat Entertainment Deep River Productions","directed_by":"John Whitesell","release_dates":"January 27, 2006 (2006-01-27)|||||","produced_by":"David T. Friendly Michael Green","starring":"Martin Lawrence Nia Long Zachary Levi Mark Moses Emily Procter Kat Dennings Chloë Grace Moretz","running_time":"99 minutes","Sequel":"Big Mommas: Like Father, Like Son was released on February 18, 2011. Brandon T. Jackson was cast in the role of Trent, who was originally played by Jascha Washington. Nia Long also did not reprise her role, which resulted in her character, Sherry, being written out. The film received overwhelmingly negative reviews from film critics as well.","music_by":"George S. Clinton","edited_by":"Priscilla Nedd-Friendly","written_by":"Don Rhymer","budget":"$40 million[1]"}