{"caddyshack":"Theatrical release poster","Caddyshack restaurants":"On June 7, 2001, Bill Murray, Brian Doyle-Murray, and their other four brothers opened a themed restaurant inspired by the movie at the World Golf Village, near St. Augustine, Florida. The restaurant is meant to resemble a stodgy country club, much like the fictional Bushwood Country Club, and serves primarily American cuisine. The brothers are all active partners and make occasional appearances at the restaurant. Three more restaurants opened in Myrtle Beach, South Carolina, Orlando, Florida, and Ponte Vedra Beach, Florida; however, all three have been closed, leaving only the World Golf Village location.[22]","country":"United States","distributed_by":"Warner Bros.","Plot":"Danny Noonan (Michael O'Keefe) works as a caddy at the upscale Bushwood Country Club to raise enough money to go to college. Danny often caddies for Ty Webb (Chevy Chase), an eccentric slacker, talented golfer, and the son of one of Bushwood's co-founders. Danny decides to gain favor with Judge Elihu Smails (Ted Knight), the country club's stodgy co-founder and director of the caddy scholarship program, by caddying for him. Meanwhile, Carl Spackler (Bill Murray), one of the greenskeepers, is entrusted with combatting a potentially disastrous gopher infestation. Throughout the film, Carl tries a variety of methods to kill the gopher (e.g. shooting, drowning) without success.Al Czervik (Rodney Dangerfield), a brash and obnoxious nouveau riche, begins appearing at the club. Smails is heckled by Czervik as he tees off, causing his shot to go badly wrong. Smails eventually throws a putter away in frustration and accidentally injures a member of the club. Danny takes responsibility for the incident, as a ploy to gain Smails' trust. Smails encourages him to apply for the caddy scholarship.At Bushwood's annual Fourth of July banquet, Danny and his girlfriend Maggie work as servers. Czervik continues to irritate Smails, while Danny becomes attracted to Lacey Underall (Cindy Morgan), Smails' promiscuous niece. Danny wins the Caddy Day golf tournament and the scholarship, earning him praise from Smails and an invitation to attend the christening ceremony for his boat. The boat is sunk at the event after a collision with Czervik's larger boat. On returning, Smails discovers Lacey and Danny having a tryst at his house. Expecting to be fired or to have the scholarship revoked, Danny is surprised when Smails only demands that he keep the incident secret.Unable to bear the continued presence of the wisecracking Czervik, Smails confronts him and announces that Czervik will never be granted membership. Czervik counters by announcing that he would never consider being a member: he insults the place and is merely there to evaluate buying Bushwood and developing the land into condominiums. After a brief scuffle and exchange of insults, Ty Webb suggests they discuss a resolution over drinks. After Smails demands satisfaction, Czervik proposes a team golf match with Smails and his regular golfing partner Dr. Beeper against Czervik and Webb. Against club rules, they also agree to a $20,000 wager, quickly doubled to $40,000, on the outcome of the match. That evening, Webb practices for the game against Smails and meets Carl, where the two share a bottle of wine and a spliff.The match is held the following day. Word spreads of the stakes involved and a crowd builds. During the game, Smails and Beeper take the lead, while Czervik, to his dismay, is \"playing the worst game of his life\". He reacts to Smails' taunts by impulsively redoubling the wager to $80,000 per team. When his own ricocheting ball strikes him, Czervik feigns injury in hopes of having the contest declared a draw. Lou, the course official who is acting as an umpire, tells Czervik his team will forfeit unless they find a substitute. When Webb chooses Danny, Smails threatens to revoke his scholarship, but Czervik promises Danny that he will make it \"worth his while\" if he wins. Danny eventually decides he would rather humiliate the selfish, conceited Smails than take the scholarship.By the time they reach the final hole, the score is tied. At the climax of the game, with Danny about to attempt a difficult putt to win, Czervik again redoubles the wager to $160,000 per team ($459,500 today). Danny's putt leaves the ball hanging over the edge of the hole. At that moment, Carl, in his latest attempt to kill the gopher, detonates a series of plastic explosives that he has rigged around the golf course. The explosions shake the ground and cause the ball to drop into the hole, handing Danny, Webb, and Czervik the victory. Smails refuses to pay, so Czervik beckons two hulking men, named Moose and Roco, to \"help the judge find his checkbook.\" As Smails is chased around the course, Czervik leads another wild party attended by all of the onlookers at the match, shouting, \"Hey everybody! We're all gonna get laid!\" The gopher emerges, unharmed by the explosives, and dances to the closing song amid the smoldering ruins of the golf course.","language":"English","Reception":"Caddyshack was released on July 25, 1980, in 656 theaters, where it grossed $3.1 million on its opening weekend. It went on to make $39,846,344 in North America.[11]The film holds a 75% approval rating at popular review aggregator Rotten Tomatoes, based on 48 reviews, with the consensus: \"Though unabashedly crude and juvenile, Caddyshack nevertheless scores with its classic slapstick, unforgettable characters, and endlessly quotable dialogue.\"[12] Christopher Null gave the film four stars out of five, and wrote, \"They don't make 'em like this anymore... The plot wanders around the golf course and involves a half-dozen elements, but if you simply dig the gopher, the caddy, and the Dangerfield, you're not going to be doing half bad.\"[13] The film was met with generally poor reviews upon its original 1980 release. Roger Ebert gave the film two-and-a-half stars out of four and wrote, \"Caddyshack feels more like a movie that was written rather loosely, so that when shooting began there was freedom—too much freedom—for it to wander off in all directions in search of comic inspiration.\"[14] Dave Kehr, in his review for the Chicago Reader, wrote, \"The first-time director, Harold Ramis, can't hold it together: the picture lurches from style to style (including some ill-placed whimsy with a gopher puppet) and collapses somewhere between sitcom and sketch farce.\"[15]Nevertheless, the film slowly gained a massive cult following in the years after its release,[16] including in the golf world. Tiger Woods has said[17] that it is his favorite film, so much so that he played Spackler in an American Express commercial based on the film, and many of the film's quotes have entered the lexicon of pop culture.[18]Ramis notes in the DVD documentary that TV Guide had originally given the film two stars (out of four) when it began showing on cable television in the early 1980s, but over time, the rating had gone up to three stars. He himself said he \"can barely watch it. All I see are a bunch of compromises and things that could have been better\" such as the poor swings of everyone save O'Keefe.[19]In 2007, Taylor Trade Publishing released The Book of Caddyshack, an illustrated paperback retrospective of the movie, with cast and crew Q&A interviews. The book was written by Scott Martin.Denmark was the only place outside the US/Canada where Caddyshack was initially a hit. The distributor had cut 20 minutes from the movie to emphasize Bill Murray's role.[20]","box_office":"$39.8 million","cinematography":"Stevan Larner","production_company":"Orion Pictures","directed_by":"Harold Ramis","Awards":"In 2000, Caddyshack was placed at number 71 on the American Film Institute's (AFI) list of the 100 funniest American films. In 2005, a line from the movie was chosen by AFI for their list of the top 100 movie quotes from U.S. films.This film is also second on Bravo's \"100 Funniest Movies\".[21]In June 2008, the AFI revealed its \"10 Top 10\"—the best ten films in ten \"classic\" American film genres—after polling more than 1,500 people from the creative community. Caddyshack was named the seventh-best film in the sports genre. Also, Murray's famous \"Cinderella story\" line was included in the countdown of greatest quotes.[7]","Soundtrack":"In 1980, CBS Records issued a soundtrack to Caddyshack. It includes 10 songs, four of which were performed by Kenny Loggins.","release_dates":"July 25, 1980 (1980-07-25)|||||","Production":"The movie was inspired by writer and co-star Brian Doyle-Murray's memories working as a caddy at Indian Hill Club in Winnetka, Illinois. His brothers Bill and John Murray (production assistant and a caddy extra), and director Harold Ramis also had worked as caddies when they were teenagers. Many of the characters in the film were based on characters they had encountered through their various experiences at the club, including a young woman upon whom the character of Maggie is based and the Haverkamps, a doddery old couple, John and Ilma, longtime members of the club, who can barely hit the ball out of their shadows. The scene involving a Baby Ruth candy bar being thrown into the swimming pool was based on a real-life incident at Doyle-Murray's high school.[2][not in citation given] The scene in which Al Czervik hits Judge Smails in the genitals with a struck golf ball happened to Ramis on what he said was the second of his two rounds of golf, on a nine-hole public course.[3]Initially, Michael O'Keefe and Scott Colomby's characters were the central characters of the movie. However, the improvisational atmosphere surrounding the other cast members (specifically Dangerfield, Chase, and Murray) led to the Czervik, Webb, and Spackler characters expanding from supporting to starring roles and Colomby's role greatly reduced, much to the annoyance of Colomby and O'Keefe. Ted Knight became similarly fed up with the constant improvisation and script changes.[4]The scene in which swimmers mistake a candy bar floating in the pool for excrement was filmed at Plantation Country Club in Fort Lauderdale, Florida.[citation needed] The dinner and dancing scene was filmed at the Boca Raton Hotel and Club in Boca Raton, Florida.[5]The film was shot over 11 weeks during the autumn of 1979. Golf scenes were filmed at the Rolling Hills Golf Club (now the Grande Oaks Golf Club) in Davie, Florida.[6] According to Ramis, Rolling Hills was chosen because the course did not have any palm trees. He wanted the movie to feel that it was in the Midwest, not Florida. The explosions that take place during the climax of the film were reported at the nearby Fort Lauderdale airport by an incoming pilot, who suspected a plane had crashed.[2] Also, the explosions were not approved by the owners of the club, who were monitoring the production almost constantly, in fear of the crew damaging the course. The movie producers were able to trick the club owners into attending an off-site meeting. While they were gone, the crew set off the explosions.The marina scene involving Al Czervik's boat wreaking havoc upon Judge Smails's \"dinghy\" was filmed in Biscayne Bay in Miami.The scene that begins when Ty Webb's golf ball crashes into Carl Spackler's ramshackle house was not in the original script. It was added by director Harold Ramis after realizing that two of his biggest stars, Chevy Chase and Bill Murray (who previously did not get along due to a feud dating back to their days on Saturday Night Live, but were at least tolerant and professional towards each other while on set), until then, did not appear in a scene together. The three met for lunch and wrote the scene. This is the only film that Chase and Murray have appeared in together.[7]Bill Murray's famous \"Cinderella story\" scene was improvised based on two lines of stage direction. Ramis gave him direction to act as a child announcing his own imaginary golf moment, with Murray then improvising. The flowers were his idea.[7] Murray was with the production only six days, and all of his lines were unscripted.[3] Murray was working on Saturday Night Live at the time, and was not intended to have a large role in the movie. However, he was repeatedly recalled from New York to film additional scenes as production continued.[8]In interviews, Cindy Morgan stated that the scene she shared with Chevy Chase, in which he pours massage oil on her, was completely improvised, and her reaction to Chase dousing her back with the massage oil, where she exclaimed \"You're crazy!\", was genuine.[4] The scene where her character had to dive into the pool was executed by a professional diver, but up to that point in the scene, she had to be led to the diving board by the crew and carefully directed up the ladder since she could not wear her contact lenses near the pool and was legally blind without them.[9]The original rough cut by editor William C. Carruth was about four and a half hours long. Bill Murray's ball-smashing speech scene lasted 30 minutes. Executive in Charge of Production Rusty Lemorande had previously worked for Blake Edwards' agent. In that position, Lemorande became friendly with Edwards' editor, Ralph Winters. Winters agreed, at Lemorande's request, to work for one week, at night, to reshape the film. The result was so improved that Ramis, Peters, Canton, and Kenney agreed a fulltime editor with experience should be hired. David Bretherton was chosen. In addition, extensive reshooting and special effects clearly would be needed. Lemorande along with the business affairs office from Orion negotiated a deal with John Dykstra for an overall package of effects, capped at $500,000.00 This was the first major 'package effects deal' for a Hollywood film. (Such package deals later put several famous CGI companies out of business.)[citation needed]More than editing was required. With scenes between Danny and his Irish girlfriend ending up on the cutting-room floor, the original through-line in the narrative dissolved. Lemorande suggested that the gopher become a complete character. In the original script and cut, the gopher is referred to, and a brief scene has Rodney Dangerfield tussle with the gopher. A fur handpuppet was created by the props department for the scene, with the director's assistant delegated as puppeteer.Director Ramis agreed and suggested that a live animal play the gopher. Lemorande, specifically assigned to supervise post-production, had been a professional puppeteer through his college years and convinced the team that only with that kind of control could the quantity of material be filmed. He searched for a suitable creature builder. Companies such as The Henson Company (which became the premier creature builders in the 1980s) did not yet take outside assignments, so Lemorande contacted friends at Walt Disney Imagineering for help. One of the Disney theme park creature designers, Jeff Burke, was willing to create the character. Lemorande drew a simple sketch, indicating the range of movement the puppet would require, and Burke fleshed out the remainder of the creature's design with further input from Lemorande.The rod and hand puppet was kept in Lemorande's office for weeks. During that time, producers Kenny and Peters and director Ramis would come into the office to play with the creature, all trying to figure out how to integrate it into the film. Simultaneously, an overall deal was made with John Dykstra's[7] effects company for all the necessary visual effects (including lightning, stormy sky effects, flying golf balls, disappearing greens' flags, etc.), so shooting the gopher puppet became part of the intensely negotiated effects package. Dykstra's technicians added extra hydraulic animation to the puppet, including ear movement, and built the tunnels through which he moved. The gopher sounds were the same as used for Flipper the dolphin in the 1960s television show of the same name. This was after principal cinematography had been completed and used higher quality film stock in an indoor soundstage, resulting in the higher picture quality of these scenes.[10]","produced_by":"Douglas Kenney","starring":"Chevy Chase Rodney Dangerfield Ted Knight Michael O'Keefe Bill Murray","running_time":"98 minutes","music_by":"Johnny Mandel","edited_by":"William C. Carruth","written_by":"Douglas Kenney Harold Ramis Brian Doyle-Murray","budget":"$6 million"}