{"country":"United States","distributed_by":"Lions Gate Films","story_by":"Eli Roth","cabin_fever":"Theatrical release poster","Plot":"A hermit walking in the woods comes across his dog. He tries to get the dog's attention, but the dog is dead due to a bloody infection, and the hermit comes into contact with the infected blood.A group of college students, Jeff, Marcy, Paul, Karen, and Burt, take a vacation to a remote cabin in the woods to celebrate the start of spring break. Jeff and Marcy are in a physical relationship, while Paul is trying to get his childhood friend Karen to sleep with him. Burt is the proverbial \"fifth wheel\" of the group. Upon their visit to a local convenience store, they meet an unusual boy named Dennis, who has a tendency to bite people. When the five get to the cabin, Jeff and Marcy have sex while Paul and Karen go for a swim. Meanwhile, Burt goes out to shoot squirrels with his rifle, but ends up shooting the hermit, now disfigured and bloody. The hermit flees, but Burt does not tell anyone about the incident.That night, the friends gather around a campfire, where they are joined by a friendly drifter named Justin, who prefers to be called Grimm, and his angry dog, Dr. Mambo. After they share some marijuana, it starts to rain, so Grimm leaves with his dog to pack up his stuff. While the friends wait for Grimm indoors, the hermit returns, in a much worse state than before and begging for help. Burt shuts the door on the sick hermit, who then tries to steal the group's car, while vomiting blood all over it. When the hermit threatens Marcy and Karen, Paul accidentally sets the hermit on fire while trying to ward him off. The group looks for help the next day. Jeff and Burt find a helpful neighbor, but leave when they find out she's the dead hermit's cousin. To make matters worse, Dr. Mambo begins harassing the group. Paul later gets assistance from police Deputy Winston, who promises to send up a tow truck, but in the meantime encourages Paul to have a good time and party. Paul goes on to comfort Karen, who is upset over the killing of the hermit. After he calms her down, it appears Paul is finally going to have sex with her, but when he goes to touch her, he discovers a massive bloody infection on her thigh. The group isolates her in a shed outside of the cabin.After fixing the truck, Burt begins coughing up blood, revealing he is infected, but does not tell the others. After Karen vomits blood on the truck, Jeff takes the group's remaining beer and leaves. Burt goes back to the convenience store to get help, but incurs the wrath of Dennis's father after inadvertently infecting Dennis with the disease when Dennis bites him. Showing more signs of infection, Burt flees, chased by Dennis's father and two friends. After moving Karen back to the shed, Marcy and Paul return to the cabin and have unprotected sex on a whim. Immediately regretting the affair, Paul leaves while Marcy, who developed infected sores on her back during the sex, takes a bath, crying. When she shaves her legs the flesh begins to peel off and she runs outside in a panic, where she is chased and killed by Dr. Mambo who tears her apart.Meanwhile, Paul discovers the dead body of the hermit floating in a reservoir, revealing the infection has been spreading through the drinking water. After racing back to the cabin, Paul finds Marcy's gory remains and Dr. Mambo feeding on Karen in the shed. After killing Dr. Mambo with Burt's gun, Paul puts Karen out of her misery by beating her to death with a shovel. A dying Burt later returns to the cabin, still pursued by Dennis's father and his two companions. Burt is brutally killed by the posse who shoot him, before Paul kills all three of them. After killing Dennis' father and his friends, Paul sets out to find Jeff. Finding the dismembered body of Grimm and discovering early signs that he is infected, Paul takes the group from the convenience store's truck and hits a deer, covering him in blood. He later reunites with Deputy Winston, who is partying with underage drinkers. After Winston is radioed about several infected people in a cabin going on a killing spree, Paul attacks and infects several of Winston's friends before knocking Winston out. Paul is later picked up by a passing truck and dropped off at a hospital. There, he is interrogated about the virus, but he cannot provide any response. The sheriff tells Winston to \"take care\" of Paul. Paul tries to warn Winston about the drinking water by saying \"water...\" but Winston only responds by dumping him at the edge of a creek.The next day, Jeff, who has been hiding out and drinking in the woods, returns to the cabin. Initially crying after seeing the remains of his friends, he later becomes ecstatic upon realizing he is the only one who made it without being infected. As he raises his arms in victory, he is gunned down and killed by several police officers, who burn his body along with the others. Back at the convenience store, a couple of children sell lemonade, that they have made with water from the creek Paul was dumped in, to the same police officers. In addition, a large truck, filled with bottles of water taken from the creek, can be seen leaving the store.","language":"English","Reception":"Grossing $33,553,394 at the box office worldwide,[1] the film was marked No. 3 and the highest grossing film released by Lions Gate Home Entertainment in 2003.Rotten Tomatoes, which compiles reviews from a wide range of critics, gives the film a score of 63% based on 137 reviews. The consensus is:\"More gory than scary, Cabin Fever is satisfied with paying homage to genre conventions rather than reinventing them.\"[6] Stephen Holden of The New York Times called it \"an unusually potent blend of dread, gore and gallows humor\".[7]The film was the No. 28 on Bravo TV's \"30 Even Scarier Movie Moments\"[citation needed]Cabin Fever has grown to be a cult classic, and Roth was nominated for several Saturn Awards, and an Empire Award for Best Newcomer. It was voted Best Horror Film by readers of the website Bloody Disgusting in 2004.[citation needed]","box_office":"$30.6 million[1]","cinematography":"Scott Kevan","production_company":"Black Sky Entertainment","directed_by":"Eli Roth","Sequel, prequel and remake":"The film spawned a sequel Cabin Fever 2: Spring Fever (2009) and a prequel Cabin Fever: Patient Zero (2014). There was also a remake of the same name, was released in 2016.","release_dates":"September 14, 2002 (2002-09-14) (TIFF)|September 12, 2003 (2003-09-12) (U.S.)||||","Production":"Eli Roth co-wrote Cabin Fever with friend and former NYU roommate Randy Pearlstein in 1995 while Roth was working as a production assistant for Howard Stern's Private Parts.[4] Early attempts to sell the script were unsuccessful because studios felt that the horror genre had become unprofitable.[3] In 1996, the film Scream was released to great success, leading studios to once again become interested in horror properties. Roth still could not sell his script, as studios told him that it should be more like Scream.[3] Many potential financiers also found the film's content to be unsettling, including not only the gore but also the use of the word \"nigger\" early in the film.The auditions for the character of Marcy had been scheduled to take place on September 11, 2001.[3] The scene the producers had chosen for the auditioning actresses was the build-up to Marcy's sex scene with Paul. In the scene, Marcy is convinced that all the students are doomed and despite Paul's reassurances, she describes their situation as \"like being on a plane, when you know it's gonna crash. Everybody around you is screaming 'We're Going Down! We're Going Down!' and all you want to do is grab the person next to you and fuck them, because you know you're going to be dead soon, anyway.\" Eli Roth and the producers tried to cancel the Marcy auditions, but the general chaos caused by the attacks made it impossible for them to reach many of the actresses who were scheduled to try out for the role.Composer Angelo Badalamenti agreed to compose some musical themes for the film out of enthusiasm for the material. However, the bulk of the film's score was composed by Nathan Barr, who has gone on to score both of Eli's Hostel films.Roth originally wanted Cerina Vincent to show her naked buttocks during her sex scene with Rider Strong. Vincent, who had previously played a nude foreign exchange student in Not Another Teen Movie was afraid that exposing too much of herself would lead to being typecast as a nudity actress and vehemently refused to bare her buttocks. At the peak of this stand-off between actress and director, Vincent told Roth that if he wanted the shot so badly, he would need to re-cast the role of Marcy with another actress. But they managed to reach a compromise - Cerina would bare one inch of her buttocks on camera, no more, no less. Eli Roth brought a ruler along to the filming[5] and measured Cerina's buttocks, to be sure he got his one inch. Bedsheets were then taped to Vincent's backside at the designated level and the scene was filmed. Only the second (behind-the-back) shot features this one inch, in the first (over-the-shoulder) shot, the bedsheets cover Cerina's buttocks completely.","produced_by":"Evan Astrowsky|Sam Froelich|Lauren Moews|Eli Roth|","starring":"Rider Strong|Jordan Ladd|James DeBello|Cerina Vincent|Joey Kern|Arie Verveen|Giuseppe Andrews|","running_time":"92 minutes","music_by":"Angelo Badalamenti|Nathan Barr|","edited_by":"Ryan Folsey","written_by":"Randy Pearlstein|Eli Roth|","budget":"$1.5 million[1]"}