{"country":"United States","Tagline":"A red moon - a bloodmoon - is rising and someone is going to die.","Plot":"At a local gym in New York City, heavyweight boxing champion Eddie Cunningham is finishing his workout for the night. He hears a noise and looks around when he turns to the ring. A mysterious man dressed in black sporting a mask tells Eddie he fights well but he lacks the \"killer instinct\". The masked man challenges the boxer to a fight and shows him the moon, which has a faint red color. The man sports boots with the toes and heels encased in steel and uses martial arts to fight Eddie. Initially, the two combatants seemed evenly matched, but Eddie soon finds himself overwhelmed by the man's superior fighting skills. When the man knocks Eddie outside of the ring, he unmasks himself and still pounds on Eddie despite Eddie's pleas of calling off the fight. When Eddie uses a bench to knock down the man, the man uses two steel fingers which goes through the bench and stabs Eddie in the chest. He hoists a dead Eddie in the air and declares victory.The next day, Detective Chuck Baker, a wise cracking cop who has a penchant for magic, is called to investigate Eddie's death. This is the fourth death of a recent wave of a possible connected killing spree in New York City. When Chuck returns to the office, his making fun of Chief Hutchins gets him in hot water with the chief, who tells him that if he doesn't solve the case, he will have him transferred to Poughkeepsie.That night, former toughman champion Dutch is on a date at his bar. His date hears a noise during their makeout session and he tries to calm her down to no avail. However, the masked man appears with the girl and calls Dutch \"Crutch\". He chokes the girl unconscious and he and Dutch fight. At first, Dutch seems to have the upper hand before the masked man reveals his true skills. When he cripples Dutch, he unmasks himself and it seems Dutch knows him, when he responds, \"You?\" Dutch's last ditch attempt to stop the man results in the killer breaking his neck and throwing him out of the bar window.The next day, at an autopsy clinic, Chuck analyzes Dutch's body and Chief Hutchins tells Chuck that he would like for him to meet with a serial killer expert named Ken O'Hara. Ken was one of the best in Chief Hutchins' unit until he was forced into retirement due to a near fatal experience with his last job. Ken, who is separated from his wife, is spending the day with his daughter at the beach. As they are about to leave, Ken accidentally bumps into a big fat guy, causing him to spill his beer on his shirt. Ken apologizes and offers to pay for his shirt and beer. The big guy felt offended and wants to start a fight with Ken. Ken initially refuses to fight, but when the big guy does harm to Ken's daughter by pushing her out of the way despite her pleads for him to not harm Ken, Ken becomes enraged and fights the big guy and his two goons. He ends up knocking all three of them down.Ken shows up at the house where he sees his ex-wife and Chuck. Mistaking Chuck for a lover of his ex's, Chuck tells him that Chief Hutchins sent him and asks for help in the case. At first Ken refuses and even has a flashback of his last job. That night, Chuck finds a fellow police officer watching a \"movie\" on the computer screen. Chuck learns the video is a real-time confrontation between the mysterious killer, now decked out in full kendo gear, and local martial arts master Takaido. Chuck heads towards Takaido's school while the killer and Takaido have a sword fight. When Takaido unmasks the killer, he recognizes him as well through a nod. However, the killer proves to be too much as the killer slices and stabs Takaido. When Chuck arrives, the entrance to the school explodes but Chuck makes it out okay.When Ken learns that Takaido, his martial arts instructor, has been killed, he sneaks into the school late at night but also catches Chuck at the school. After a brief fight, the two look at each other and Chuck is shocked to find Ken. Kelly, Takaido's adopted daughter, finds the two and stops them from fighting. Ken agrees to help Chuck on the case. At first, Chuck is reluctant for Ken's help, but soon finds him a valuable ally due to Ken's connections, including a computer hacker named Justice. However, when Justice attempts to trace the killer's latest call, the killer forces Chuck and Ken to confront and take down a local crime boss and his goons.Ken and Chuck soon learn that Kelly is about to be the killer's next target. When the two arrive at Kelly's apartment, they warn her of the killer's intentions, but Kelly dismisses them, claiming she can take care of herself. As they leave, the killer arrives and Kelly finds him, leading to a confrontation. Ken and Chuck return to retrieve a file Ken accidentally left at the apartment only to find themselves facing the killer, who was overpowering Kelly. Chuck, Ken and Kelly prove to be too much for the killer, who after knocking out Kelly and using his steel fingers to incapacitate Ken, escapes by jumping out of a window onto a garbage truck.Ken and Chuck, along with Kelly, decide to locate the killer, whose targets are clearly champions in various fighting styles. They find a photo of combatants in a tournament known as The Master's Challenge and they narrow the field down to two suspects, Willy and Chad. Chad was believed to have been killed in a car accident, thus making Willy the prime suspect. However, the killer is in fact Chad, who did have an accident, which resulted in him losing two fingers, which he replaced with steel. Kelly discovers the killer amongst a crowd watching the police leave to apprehend Willy and follows him to his home. Kelly confronts the killer only to end up defeated. Chuck and Ken succeed in capturing Willy, but they noticed during the confrontation that something was not right in terms of Willy's appearance, fighting style and skills in comparison to those of the person they fought earlier. Their suspicions are confirmed when Kelly texts them what she'd discovered. They rush to the killer's house, only to arrive too late finding Kelly's lifeless body and the killer nowhere to be found. The killer then phones Ken, revealing that he has kidnapped Ken's wife and daughter in order to challenge Ken to a \"grand championship match\" to the death.Ken and Chuck head to an abandoned construction site where the top of the building has Ken's wife (whom he has reconciled) and daughter strapped to a bomb. As Ken begins to face off against the killer in a showdown, the killer uses the environment to his advantage. When Chuck attempts to help Ken, Chuck is nearly killed for his actions. However, Ken eventually gets the upper hands and on a long scaffold, Ken unleashes a flurry of kicks and blows, knocking the killer off the building and causing him to fall to his death. When Ken reaches his wife and daughter, the bomb goes off but the explosion only consists of confetti. A tape recording reveals the killer saying, \"I'm no child killer. There will be no slaughter of the innocents\". Chuck makes it out, still injured from the killer, while Ken walks away in joy and relief with his wife and daughter.","language":"English","directed_by":"Tony Leung Siu Hung","release_dates":"1997 (1997)|||||","Box office":"Bloodmoon grossed $419,769 at the box office in Australia.[1]","bloodmoon":"DVD cover","produced_by":"Keith W. Strandberg","starring":"Gary Daniels Chuck Jeffreys Frank Gorshin Darren Shahlavi Nina Repeta","music_by":"Richard Yuen","External links":"","edited_by":"Allan Poon","written_by":"Keith W. Strandberg"}