{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Christopher Landon Carl Ellsworth","story_by":"Christopher Landon","Plot":"Kale Brecht (Shia LaBeouf) and his father Daniel (Matt Craven) are on an rare outing, enjoying a fishing trip. On their return home, their vehicle evades another and ends up in a multi-car accident. Kale is injured in the crash but Daniel is killed. One year later, near the end of the school year, Kale is still traumatized by his father's death. The youth is reprimanded about his school work by his Spanish teacher, Señor Gutierrez (Rene Rivera); and when Gutierrez mentions Kale's father, Kale attacks him. For the assault, he is sentenced by a sympathetic judge to three months under house arrest with an ankle monitor and a proximity sensor. Detective Parker (Viola Davis) explains the do's and don'ts of the system to Kale and his mother Julie (Carrie-Ann Moss). The officer (Jose Pablo Cantillo) joyfully monitoring him follows suit by informing him that he is the teacher's cousin. Initially, he satiates his boredom by playing video games but, shortly thereafter, his mother Julie cancels his subscriptions to the iTunes Music Store and Xbox Live and cuts the power cord of his television as punishment.Kale's boredom leads him to watch the neighborhood, including the two boys who occasionally play pranks on Kale; his next-door neighbor Robert Turner (David Morse); and Ashley Carlson (Sarah Roemer), the new girl in town. One night, Kale becomes suspicious of Robert Turner, who returns home in a 1967 Ford Mustang with a dented fender that matches the description given on a news report of an errant serial killer. Kale's best friend Ronnie (Aaron Yoo) visits to spy on Ashley and, when they accidentally alert her to their hijinks, she joins them in spying on Turner. Kale observes a woman Turner had picked up from a nightclub as she escapes the house in a panic, but later appears to leave the home in her car. Ashley throws a party and teases the agitated Kale, knowing he is watching. He plays music loudly to needle her and when Ashley comes over, Kale admits that he has not only watched but has learned fine details about her by doing so. The two make out, distracting each other, while blood is shown splattering on Turner's windows.Later, as Kale and Ashley watch, Turner is seen dragging a heavy bag to his garage, which Ashley claims to have noticed blood. Kale insists that Ronnie assist him in spying on Turner, eventually leading to Ronnie's breaking into Turner's garage with a camera. Though he confirms the bag has blood and hair in it, the garage door closes; and Ronnie flees into the house. Kale leaves to rescue him but alerts the police when he leaves his property; the police search the garage and show Kale the bag contains a roadkilled deer. Kale's mother Julie then goes across the street to talk to Turner, while Ronnie is in her kitchen, and Kale is watching the tape of Ronnie's running through Turner's house. Kale notices a dead body in plastic in a vent on the tape, as Turner knocks out Julie next door and then enters Kale's house, attacking Ronnie and Kale, binding and gagging Kale with duct tape. Turner reveals his plan to frame Kale for the murder of his mother and Ronnie before committing suicide.As Turner has Kale writing a suicide letter to Ashley, she enters the home, and the two fight off Turner and flee the house. Kale trips the bracelet to alert the police, then enters Turner's home; Ashley goes to the police in person. In a hidden room, Kale finds evidence of Turner's previous murders, including their credentials, and a room with surgical tools and freezers of ice. Officer Gutierrez arrives at the scene, but he is killed when Turner breaks his neck. Proceeding to the basement of the house, Kale falls through the floor and finds his mother bound and gagged underneath the foundation. Turner suddenly appears from behind Julie and, in the ensuing confrontation, Kale stabs Turner with a pair of gardening shears.In the aftermath, Kale is shown having his ankle bracelet is removed by the authorities for good behavior, getting back at the two boys from earlier pranks and making out with Ashley on his sofa, neither showing care that Ronnie is video taping them.","language":"English","Reception":"Disturbia was released on April 13 in the United States and opened at #1 in its first week at the box office with $23 million.[6] Despite a 10 million decrease in its second week, it remained on top of the box office.[7] In its third week, it held on with $9.1 million.[8] In its fourth week, it earned $5.7 million and finished second behind the record-breaking Spider-Man 3.[9]Disturbia received generally positive reviews. Review aggregation website Rotten Tomatoes gives the film a rating of 69%, based on 172 reviews, with the site's critical consensus reading, \"Aside from its clichéd resolution, Disturbia is a tense, subtle thriller with a noteworthy performance from Shia LaBeouf.\"[10] On Metacritic, the film has a score of 62 out of 100, based on 28 critics, indicating \"generally favorable reviews\".[11]The film earned a \"two thumbs up\" rating from Richard Roeper and A.O. Scott (filling in for Roger Ebert), with Roeper saying, \"This is a cool little thriller with big scares and fine performances.\"[12]Some criticized the change of atmosphere two-thirds of the way into the film, when the initial pacing and action morphs into that of a \"run-of-the-mill slasher horror film\".[13]David Denby of The New Yorker judged the film \"a travesty\", adding: \"The dopiness of it, however, may be an indication not so much of cinematic ineptitude as of the changes in a movie culture that was once devoted to adults and is now rather haplessly and redundantly devoted to kids.\"[14]The film won 3 Teen Choice Awards including Choice Movie: Horror/Thriller, Choice Movie: Breakout Male (LaBeouf) and Choice Movie Actor: Horror/Thriller (LaBeouf) .The Sheldon Abend Revocable Trust filed a lawsuit against Steven Spielberg, DreamWorks, its parent company Viacom, and Universal Studios on September 5, 2008.[15][16] The suit alleged that Disturbia infringed on the rights to Cornell Woolrich's 1942 short story \"It Had to Be Murder\" (the basis for the classic Alfred Hitchcock film Rear Window), and that DreamWorks never bothered to obtain motion picture rights to the intellectual property and evaded compensating the rights holder for the alleged appropriation. (Ownership of the copyright in Woolrich's original story \"It Had to Be Murder\" and its use as the basis for the movie Rear Window was previously litigated before the United States Supreme Court in Stewart v. Abend, 495 U.S. 207 (1990).) Contrary to some media reports, the claim was based on the original Woolrich short story, not the movie Rear Window.This claim was rejected by the U.S. District Court in Abend v. Spielberg, 748 F.Supp.2d 200 (S.D.N.Y. 2010), on the basis that the original Woolrich short story and Disturbia are only similar at a high level of generality and abstraction. \"Their similarities derive entirely from unprotectible elements and the total look and feel of the works is so distinct that no reasonable trier of fact could find the works substantially similar within the meaning of copyright law.\"[17] Disturbia contained many subplots not in the original short story.[18][19]After the dismissal of the copyright claim in federal court, the Abend Trust filed another lawsuit in California state court against Universal Studios and the Hitchcock Estate on October 28, 2010, for a breach of contract claim based on earlier agreements which allegedly restricted the use of ideas from the original Woolrich short story and the movie Rear Window whether or not the ideas are copyright protectable, that the defendants had entered into with the Abend Trust after the Supreme Court's Stewart v. Abend decision.[20][21]The film was released on DVD and HD DVD on August 7, 2007 and on Blu-ray Disc on March 15, 2008. In the \"Making of Disturbia\" section of the DVD's special features section it is revealed that LaBeouf and Morse did not have much contact off-set, so as to make the fight scenes at the end of the movie as realistic as possible.","disturbia":"Theatrical release poster","box_office":"$117.8 million[1]","cinematography":"Rogier Stoffers","production_company":"DreamWorks Pictures Cold Spring Pictures The Montecito Picture Company","directed_by":"D. J. Caruso","Music":"Disturbia: Original Motion Picture Soundtrack is a soundtrack to the film of the same name, released on March 4, 2007 in the United States by Lakeshore Records.[22]Disturbia: Original Motion Picture Score is a score to the film of the same name. It is composed by Geoff Zanelli, conducted by Bruce Fowler and produced by Skip Williamson. It was released on July 10, 2007 in the United States by Lakeshore Records.[23]","release_dates":"April 13, 2007 (2007-04-13)|||||","Production":"The script was written in the 1990s and was optioned. The original studio let the option expire after hearing about Christopher Reeve's remake of Rear Window. It was not until 2004 that the script was rewritten and sold.Executive Producer Steven Spielberg arranged for LaBeouf to be on the casting shortlist for this film because he was impressed by LaBeouf's work on Holes. Caruso auditioned over a hundred males for the role in five weeks before settling on LaBeouf as he was looking for someone \"who guys would really like and respond to, because he wasn't going to be such a pretty boy\". LaBeouf was attracted to the role because of the director's 2002 film The Salton Sea, which he complimented as one of his favorite films. Before filming started, the two watched the thriller films Rear Window, Straw Dogs, and The Conversation starring Gene Hackman. They also viewed the 1989 romantic film Say Anything... and \"mixed all the movies together.\"[3] LaBeouf says he spoke to people on house arrest and locked himself in a room with the bracelet to feel what the confinement of house arrest is like.[3] He commented in an interview, \"...it's hard. I'm not going to say it's harder than jail, but it's tough. House arrest is hard because everything is available. [...] The temptation sucks. That's the torture of it.\"[3] Caruso gave him the freedom to improvise whenever necessary to make the dialogue appeal to the current generation.Filmed on location in the cities of Whittier, California and Pasadena, California. Filming took place from January 6, 2006 to April 29, 2006. The homes of Kale and Mr. Turner, which were supposed to be across from each other, were actually located in two different cities.[4]During filming, LaBeouf began a program that saw him gain twenty five pounds of muscle in preparation of his future films Transformers and Indiana Jones and the Kingdom of the Crystal Skull.[5]According to LaBeouf, David Morse who plays Mr. Turner, did not speak to LaBeouf or any of the other teens while on set. LaBeouf said, \"When we finished filming, he was very friendly. But he's a method actor, and as long as we were shooting, he wouldn't say a word to us.\"","produced_by":"Joe Medjuck E. Bernett Walsh Jackie Marcus","starring":"Shia LaBeouf David Morse Sarah Roemer Carrie-Anne Moss","running_time":"105 minutes","music_by":"Geoff Zanelli","edited_by":"Jim Page","budget":"$20 million[1]"}