{"country":"Spain","distributed_by":"Universal Pictures International (Spain) Sony Pictures Classics","Plot":"\"Harry Caine\" is a blind writer who shares his life with his agent Judit and her adult son, Diego. Slowly, events in the present begin to bring back memories of the past. Harry hears that millionaire Ernesto Martel has died; a young filmmaker, Ray X, appears and turns out to be Martel's son, Ernesto, Jr. After Diego is hospitalized for an accidental drug overdose in a Madrid nightclub, Harry collects Diego from the hospital and looks after him to avoid worrying his traveling mother. The main storyline is told in flashback as Harry reluctantly tells Diego a tragic tale of fate, jealousy, abuse of power, betrayal, and guilt.The first flashback is to 1992, which introduces Magdalena \"Lena\" Rivero, Martel's beautiful young secretary, an aspiring actress. She becomes close to Martel, a millionaire financier, in order to find the money to help meet her dying father's medical bills. By 1994, she has become Martel's mistress. At this time, Harry is still living under his real name, Mateo Blanco, a well-respected film director. Martel is excessively possessive of Lena, but she is determined to become an actress and manages to win the main role in Blanco's film Chicas y maletas (Girls and Suitcases) by bringing Martel in as financier/producer. (The fictional film is similar to Almodóvar's 1988 release, Women on the Verge of a Nervous Breakdown, except that the Shiite terrorists have been replaced by a cocaine dealer; several of the cast of the previous film appear in the fictional one.) Martel spies on Lena and Mateo by sending his inhibited, effeminate gay son, Ernesto, Jr., to videotape the production of the film, ostensibly for a \"making of\" feature, then hiring a lip-reader to interpret the conversations. Martel, seething with jealousy, screens the videos as the lip-reader narrates the furtive whispers of Lena and Mateo's passionate affair.Furious, Martel confronts Lena, and when she threatens to leave him he pushes her down the stairs. But when she survives the fall, he relents and nurses her back to health. The filming completed, Lena and Blanco escape Martel's hold and go on holiday to Lanzarote. Lena takes a job as a hotel receptionist to pass the time. When she and Blanco read in El País that Chicas y maletas has received a terrible critical reception, likely the end of Blanco's directing career, they determine to start over together far from Madrid. Fate intervenes when Blanco is seriously injured and Lena is killed in a car accident, which ironically is immortalized by Ernesto Jr., who has been trailing them with his camcorder. Mateo loses his sight permanently. Judit, his long-time production assistant, and an 8-year-old Diego arrive to help Blanco pick up the pieces and return to Madrid, where he eventually writes screenplays in braille under the pseudonym Harry Caine, represented by his agent, Judit.The story picks up where it began in 2008: Harry shares his birthday in a bar with Judit and Diego. Judit becomes drunk on gin and, stricken with guilt, confesses to Harry that she sold out to Martel in 1994 because of her fury at Harry for abandoning the film to run away with Lena; she also tells him of her involvement in providing Martel the phone number of the hotel in Lanzarote where Lena and Mateo were hiding. She confirms that Martel sabotaged the release of Chicas y maletas by using the worst take from each scene in order to destroy Mateo's reputation. The next morning she reveals to Diego that Harry is actually his father, a fact both men were unaware of. Having exorcised some of his demons, Harry decides to return to his life as Mateo Blanco. Though believed lost, the original reels of Chicas y maletas and Ernesto Jr.'s camcorder footage are recovered: Judit had ignored Martel's order to destroy them and instead hid them away. Mateo and Diego re-edit the film for its long-delayed release as the director envisioned it.","language":"Spanish English","Reception":"The film has received generally positive reviews by critics; review aggregator website Rotten Tomatoes reported that 82% of critics gave the film a positive rating, based on 146 reviews. Its consensus states \"Pedro Almodóvar's fourth film with Penélope Cruz isn't his finest work, but he brings his signature visual brilliance to this noirish tale, and the cast turns in some first-class performances.\"[7] It currently holds a score of 76 (generally favorable reviews) on Metacritic.[8] Chicago Sun-Times film critic Roger Ebert gave the film four out of four stars, and wrote that \"Broken Embraces is a voluptuary of a film, drunk on primary colors, caressing Penélope Cruz, using the devices of a Hitchcock to distract us with surfaces while the sinister uncoils beneath.\"[9]The film was accepted into the main selection at the 2009 Cannes Film Festival in competition for the prestigious Palme d'Or,[10] Almodóvar's third to do so, and fourth to screen at the festival. Broken Embraces was nominated for the 2010 Golden Globe Award for Best Foreign Language Film, Almodóvar's sixth film to be nominated in this category. It was also nominated for the Satellite Award for Best Foreign Language Film, as well as the Satellite Award for Best Actress for Penélope Cruz's performance.","box_office":"$30,991,660[2]","cinematography":"Rodrigo Prieto","production_company":"El Deseo","directed_by":"Pedro Almodóvar","Soundtrack":"The film includes an original soundtrack album composed entirely by Alberto Iglesias, which was released in Spain on CD format to coincide with the film's release. The film also includes two English tracks from American artists: \"Robot Oeuf\" by Uffie, and a cover of Michael Hurley's \"Werewolf\" by Cat Power.","release_dates":"18 March 2009 (2009-03-18)|||||","produced_by":"Pedro Almodóvar Agustín Almodóvar","starring":"Penélope Cruz Blanca Portillo Lluís Homar Lola Dueñas Ángela Molina Rossy de Palma","running_time":"128 minutes[1]","music_by":"Alberto Iglesias","edited_by":"José Salcedo","broken_embraces":"Original release poster","written_by":"Pedro Almodóvar","budget":"$18 million"}