{"based_on":"A Bronx Tale  by Chazz Palminteri","country":"United States","distributed_by":"Savoy Pictures","Critical response":"The film was a critical success. Rotten Tomatoes retrospectively gave the film a 96% rating based on reviews from 27 critics.[4] Metacritic gave it a weighted average rating of 80//100 based on reviews from 15 critics.[5]Critic Roger Ebert gave the film four stars, calling it \"a very funny movie sometimes, and very touching at other times. It is filled with life and colorful characters and great lines of dialogue, and De Niro, in his debut as a director, finds the right notes as he moves from laughter to anger to tears. What's important about the film is that it's about values.\"[6]A Bronx Tale was nominated for AFI's Top 10 Gangster Films list.[7]","Plot":"In 1960, Lorenzo Anello (Robert De Niro) is raising a family: he lives in the New York City Italian American neighborhood borough of The Bronx with his wife Rosina (Katherine Narducci), and his young son Calogero (Francis Capra), who takes a fascination with the local mobsters led by Sonny LoSpecchio (Chazz Palminteri). One day Calogero witnesses a murder committed by Sonny in defense of an assaulted friend in his neighborhood. When Calogero chooses to keep quiet when questioned by NYPD detectives, Sonny takes a liking to him and gives him the nickname \"C\". Sonny's men offer Lorenzo a better paying job. Lorenzo, preferring a law-abiding life as an MTA bus driver, politely declines. Sonny befriends Calogero and introduces him to his crew. Calogero earns tips amounting to $600 working in the Mafia bar and throwing dice, and is admonished harshly by Lorenzo when he discovers it. Lorenzo speaks severely to Sonny, returns the money, and angrily warns him to keep away from Calogero.Eight years later in 1968, Calogero (now played by Lillo Brancato, Jr.) has grown into a young man who has secretly been visiting Sonny regularly without his father's knowledge. Calogero is also part of a gang of local Italian American boys, which concerns Sonny, who warns Calogero to keep away from them and focus more on his schoolwork. Later on, Calogero meets an African American girl named Jane Williams (Taral Hicks), and is smitten with her. Despite the high level of racial tension and dislike between Italian Americans and African Americans, Calogero arranges a date with Jane. He asks for advice from both his father and Sonny, with the latter lending Calogero his car. Later, Calogero's friends beat up the black cyclists who ride through their neighbourhood, despite Calegero's attempts to defend them. One of the cyclists is revealed to be Jane's brother, Willie. Willie mistakes Calogero for one of the assailants. He then accuses \"C\" of beating him up when Calogero and Jane meet for their date. Calogero loses his temper over the accusation and Willie's lack of gratitude, responding by accidentally addressing him with a racial slur. He instantly regrets it, but it's too late. Heartbroken, Jane walks back to the car with Willie and leaves Calogero.At home, Calogero is confronted by his father who just saw him driving Sonny's car. An argument ensues and Calogero storms out. Shortly thereafter, Calogero is confronted by Sonny and his crew, who found a bomb in Sonny's car and suspected Calogero of planning to assassinate him. Calogero tearfully proclaims his love for and dedication to Sonny. Sonny recognizes Calogero's innocence and allows him to leave. Lorenzo emerges to defend his son, but is held back by Sonny's men. The African American boys egg the Italian American boys' usual spot in retaliation for the previous beating, and Calogero's friends make a plan to strike back using Molotov cocktails. They try to force Calogero to participate, but Sonny stops the car and orders Calogero out. Calogero catches up with Jane, who tells him that Willie had since admitted that the boy who beat him up wasn't Calogero. Jane and Calogero make amends, but Calogero suddenly remembers his friends' plans to attack Jane's neighborhood, and the two rush to stop them. Calogero and Jane arrive to find the Italian American boys' car in flames. During the attack, someone threw one of the Molotov cocktails back into the car window, igniting the remaining bottles. The resulting crash and explosion killed everyone in the vehicle.Calogero rushes into the crowded bar to thank Sonny for saving his life, but an unnamed assailant shoots Sonny in the back of the head before Calogero can warn him. Calogero later learns that the assailant was the son of the man who Sonny killed in the beginning in the film. A funeral is then held for Sonny, where countless people come to pay their respects. When the crowd disperses, Carmine (Joe Pesci) visits the funeral, claiming that Sonny once saved his life as well. Calogero does not recognize Carmine, but realizes who he is when he sees a scar on his forehead. The murder Sonny had committed outside Calogero's home eight years previously had been in a defense of Carmine, who was being beaten with a baseball bat. Carmine tells Calogero that he will be taking care of the neighborhood for the time being, and promises Calogero help should he ever need anything. Carmine leaves just as Calogero's father unexpectedly arrives to pay his respects to Sonny, thanking him for saving his son's life. Lorenzo later says that he had never hated Sonny, but merely resented him for making Calogero grow up so quickly. Calogero makes peace with his father, and the two walk home as Calogero narrates the life lessons that he learned from the two men.","language":"English","box_office":"$17,287,898[2]","cinematography":"Reynaldo Villalobos","production_company":"TriBeCa Productions","directed_by":"Robert De Niro","a_bronx_tale":"Theatrical release poster","release_dates":"September 14, 1993 (1993-09-14) (Toronto Film Festival)|September 29, 1993 (1993-09-29) (U.S.)||||","Production":"A Bronx Tale was filmed in three New York City neighborhoods. Though set entirely in the Bronx, only one of these locations was actually in that borough. The Fordham neighborhood in which Calogero lives was filmed in Astoria, Queens; the black neighborhood said to be on and around Webster Avenue was filmed at East 15th Street and Gravesend Neck Road in Sheepshead Bay, Brooklyn; finally, the scene set on the Bronx's City Island was filmed in that location.The film features music from the 1950s and 1960s includingPalminteri adapted the screenplay from his one-man show of the same name. Several characters' names are based on himself: his real name is Calogero Lorenzo Palminteri. The show had successful runs in Los Angeles and Off-Broadway. Palminteri would not sell the rights to his story unless he could write the screenplay and was guaranteed the role of Sonny. At one point he was offered one million dollars, but refused because his conditions were not met. Later, De Niro saw the show and approached Palminteri. He said he knew about Palminteri's refusing to sell the rights. For the rights, he told Palminteri he would act in the film and meet Palminteri's conditions if De Niro could direct. De Niro said he was good to his word with only a handshake from Palminteri.[3]","produced_by":"Jane Rosenthal","starring":"Robert De Niro Chazz Palminteri","running_time":"120 minutes","edited_by":"David Ray Robert Q. Lovett","Release":"Sometime after the film's theatrical run, HBO released the movie on VHS, CD and in 1998 on DVD. The DVD is out of print, but in January 2010, Focus Features released an Amazon.com exclusive DVD copy of the film.","written_by":"Chazz Palminteri","budget":"$10 million[1]"}