{"based_on":"\"Pimpernel\" Smith (novel)  by A.G. Macdonell The Scarlet Pimpernel (novel)  by Baroness Emmuska Orczy","country":"United Kingdom","distributed_by":"Anglo-American Film Corporation (UK) United Artists (US)","screenplay_by":"Anatole de Grunwald Ian Dalrymple (uncredited)","story_by":"A.G. Macdonell Wolfgang Wilhelm","Plot":"Eccentric Cambridge archaeologist Horatio Smith (Leslie Howard) takes a group of British and American archaeology students to pre-war Nazi Germany to help in his excavations. His research is supported by the Nazis, since he professes to be looking for evidence of the Aryan origins of German civilisation.However, he has a secret agenda: to free inmates of the concentration camps. During one such daring rescue, he hides disguised as a scarecrow in a field and is inadvertently shot by a German soldier idly engaging in a bit of target practice. Wounded, he still manages to free a famous pianist from a work gang. Later, his students guess his secret when they see his injury and connect it to a story about the latter-day Scarlet Pimpernel in a newspaper. They enthusiastically volunteer to assist him.German Gestapo General von Graum (Francis Sullivan) is determined to find out the identity of the \"Pimpernel\" and eliminate him. Von Graum forces Ludmilla Koslowska (Mary Morris) to help him by threatening the life of her father, a leading Polish democrat held prisoner by the Nazis. When Smith finds out, he promises her he will free Koslowski.Smith and his students, masquerading as American journalists, visit the camp in which Koslowski is being held. They overpower their escort, put on their uniforms, and leave with Koslowski and some other inmates. By now, von Graum is sure Smith is the man he is after, so he stops the train transporting the professor and various packing crates out of the country. However, when he has the crates opened, he is disappointed to find only ancient artefacts from Smith's excavations.Von Graum still has Ludmilla, so Smith comes back for her. The general catches the couple at a border crossing. In return for Ludmilla's freedom, Smith agrees to give himself up. Smith tells Graum that the artefacts he has discovered disprove Nazi claims about the Aryan origins of the Germans. He predicts the Nazis will destroy themselves. In the end, Smith manages to distract his adversary and escape into the fog, but promises to come back.","language":"English","Reception":"Released in the United States as Mister V, the film review in the New York Times noted: \"It is all absurd derring-do, of course, and it follows a routine pattern. It lacks the headlong course of the top-notch British thrillers. But \"Mister V\" becomes a tense excursion because of Mr. Howard's casual direction, and even more because of the consummate ease and the quiet irony of his performance.\"[7]During the Second World War, films shown at Chequers were the only recreational activity available to Winston Churchill, who felt that \"the cinema is a wonderful form of entertainment, and takes the mind away from other things.\"[8] Pimpernel Smith was the film which he chose to be shown in the wardroom of the battleship HMS Prince of Wales on 9 August 1941 to share with the ship's officers, as he travelled across the Atlantic for a secret conference with US President Franklin D. Roosevelt at Argentia in Newfoundland.[9]The film was the third most popular movie at the British box office in 1941.[10]","\"pimpernel\"_smith":"Original theatrical poster","cinematography":"Mutz Greenbaum","production_company":"British National Films","directed_by":"Leslie Howard","Inspiration for Raoul Wallenberg":"When Pimpernel Smith reached Sweden in November 1943, the Swedish Film Censorship Board decided to ban it from public viewing, as it was feared that such a critical portrayal of Nazi Germany could harm Sweden's relationship with Germany and thus jeopardise the country's neutrality in the Second World War. Raoul Wallenberg did, however, manage to see it at a private screening, together with his half-sister, Nina Lagergren.[11]She later recalled that on their way home after the screening, \"he told me this was the kind of thing he would like to do.\"[12] Since 1941, Wallenberg had made frequent trips to Hungary, and knew how oppressed the Hungarian Jews were. He travelled as a representative and later joint owner of an export-import company that was trading with central Europe and was owned by a Hungarian Jew.Following the mass deportations that had started in April 1944, Wallenberg was sent to Budapest in August 1944, as First Secretary to the Swedish legation, assigned under secret agreement between the US and Swedish governments to organise a rescue programme for the Jews. By issuing \"protective passports\", which identified the bearer as Swedish, and housing them in 32 buildings that he rented and declared Swedish territory, he managed to rescue tens of thousands from the German death camps.In May 1945, Pimpernel Smith was released in Sweden without any age restrictions.[11]","release_dates":"26 July 1941 (1941-07-26) (UK)|12 February 1942 (1942-02-12) (US)||||","Production":"Leslie Howard had been aware of the Nazi menace in Europe and had developed a film treatment in 1938 based on the rescue of an Austrian anti-Nazi leader.[4] With the A.G. Macdonell story of \"Pimpernel Smith taking the classic The Scarlet Pimpernel novel by Baroness Emmuska Orczy into modern times, Howard took on the project as the first film he directed and co-produced.[5][Note 2] Production on \"Pimpernel\" Smith began in early 1941.[6]","produced_by":"Leslie Howard Harold Huth (associate)","starring":"Leslie Howard Francis L. Sullivan Mary Morris","running_time":"120 minutes","music_by":"John Greenwood","edited_by":"Sidney Cole","written_by":"A.G. Macdonell"}