{"Cast":"Harold Ramis' wife Anne Ramis also cameos as a travel agent.","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Harold Ramis|Brian Doyle-Murray|","story_by":"Ed Roboto|Tom Leopold|Chris Miller|David Standish|","Plot":"Jack Moniker (Robin Williams) is a Chicago firefighter who becomes injured on the job. Using his disability money, he decides to retire and live the good life in a small Caribbean island called Saint Nicholas. He buys a small amount of property there and lives among other washed-up personalities such as Anthony Croyden Hayes (Peter O'Toole). Appointed by the British crown as governor of St. Nicholas, Hayes is more concerned with vacationing than governing. Miss Phillipa Lloyd (Twiggy), who is visiting St. Nicholas with some sailor friends of hers, decides to stay permanently and becomes Jack's girlfriend in the process. He playfully refers to her as \"Miss Philadelphia\".Jack befriends financially troubled reggae musician Ernest Reed (Jimmy Cliff), and they together form \"Club Paradise,\" which they market as a Club Med-style resort complete with a brochure that features photographs of Jack in various disguises on every page. This attracts a handful of tourists, including Barry and Barry (Rick Moranis and Eugene Levy) who are there for the pot and the women. Much of the film involves the tourists' comic misadventures adjusting to island life and the low-rent facilities of Club Paradise. Also travelling to the island is New York Times travel writer Terry Hamlin (Joanna Cassidy) who ends up spending most of her time in the company of Governor Hayes. Adding to the fun is suburban housewife Linda White (Andrea Martin), who is vacationing with her plastic surgeon husband Randy (Steven Kampmann). She tries her hand at just about everything the island has to offer, including cliff diving lessons from two handsome instructors, Christopher and Helmut.Voit Zerbe (Brian Doyle-Murray) plays a key role, as a developer who wants to run Jack and Ernest off their property so he can build a massive high-end casino on the beach as part of a deal he's making with two business partners - one Swiss, the other Arab. To do that, he uses the help of the local prime minister Solomon Gundy (Adolph Caesar) and the prime minister's men to cause trouble and get Club Paradise to close \"legally.\" Jack and Ernest go so far as to sneak aboard Zerbe's yacht to provide some \"useful intelligence\" for Governor Hayes by finding out what is going to happen to the future of Saint Nicholas. They skin dive to the yacht (not before Jack brings a helium tank instead of an oxygen tank) where they are captured by local police and thrown in jail. When Prime Minister Gundy's strong arm tactics don't work, he orders a military takeover of the island. Ernest builds up a resistance force, and St. Nicholas is soon threatened with the possibility of civil war, which is averted at the last minute with assistance from Jack and Governor Hayes. When Gundy's takeover fails, Zerbe and his partners leave Saint Nicholas and head for the Cayman Islands. Jack is then inspired to create a new tagline for the club: \"Club Paradise: Your Hot Spot for Fun With Guns in the Sun.\"[1]","language":"English","Reception":"The film was given mostly negative reviews from critics with Rotten Tomatoes maintaining Club Paradise an 11% rating based on 27 reviews. Peter O'Toole's performance in the film earned him a Razzie Award nomination for Worst Supporting Actor, but lost to Jerome Benton for Under the Cherry Moon.","box_office":"$12,308,521 (domestic)","cinematography":"Peter Hannan","directed_by":"Harold Ramis Assistant Rachel Friedman","club_paradise":"Theatrical poster","release_dates":"July 11, 1986 (1986-07-11)","Production":"Harold Ramis replaced John Landis (Animal House,The Blues Brothers) as director.[citation needed]Shooting for Club Paradise took place from April[2] to July 1985.[3] Production company Warner Bros. planned to release it in early 1986,[4] but held it back until July.During development, Bill Murray turned down the film's lead role eventually given to Robin Williams; his brother, Brian Doyle-Murray, ended up in the cast instead.[5] John Cleese was also slated to star, but immediately dropped out before Peter O'Toole signed on to replace him.[6]\"Ed Roboto\" is a pseudonym for Harry Shearer, who was asked to do a rewrite with Tom Leopold. Only two words of what they wrote ended up in the film (the title) and Shearer was \"so appalled by the movie\" that he removed his name from the credits.[7]Adolph Caesar died of a heart attack four months before the film's release.[4] It was his last completed role.Although there is an extended sequence involving Robin Williams' character, in correspondence to the lyrics, \"taking off his clothes and living in the jungle\", the song \"Apeman\" by The Kinks was not included on the official soundtrack.","produced_by":"Michael Shamberg","starring":"Robin Williams|Peter O'Toole|Rick Moranis|Jimmy Cliff|Twiggy|Adolph Caesar|Eugene Levy|Joanna Cassidy|Andrea Martin|Brian Doyle-Murray|","running_time":"95 minutes","music_by":"David Mansfield|Van Dyke Parks|","edited_by":"Marion Rothman","budget":"$15 million"}