{"country":"Hong Kong","Awards and nominations":"16th Hong Kong Film AwardsNominationsGolden Horse Film Awards","comrades:_almost_a_love_story_甜蜜蜜":"Film poster of Comrades: Almost a Love Story","Plot":"The film, spanning years, centers on two Chinese mainlanders who migrate to Hong Kong to make a living, but end up falling in love. Leon Lai plays a naive Northerner, Li Xiao-Jun (T: 黎小軍, S: 黎小军), and Maggie Cheung plays an opportunist/entrepreneur and Cantonese speaker from Guangzhou, Li Qiao (T: 李 翹, S: 李 翘), who takes advantage of mainlanders like herself for financial gains. The loneliness of living in the big city inevitably brings the two into a passionate love affair. But their different ambitions (Li Xiao-Jun wants to bring his fiance to Hong Kong; Li Qiao wants to get rich) mean that they are unable to be together. Eventually, Li Xiao-Jun marries his fiancée, Fang Xiaoting (方小婷) (Yang) in Hong Kong and Li Qiao winds up in a relationship with a mob boss named Ouyang Pao (T: 歐陽豹, S: 欧阳豹, P: Ōuyáng Bào) (Tsang). Li Qiao also becomes a successful entrepreneur, achieving her Hong Kong dream. Despite their seemingly separate lives, however, they are still in love and they have one final tryst in the room they used to share before they are separated again.Burdened by guilt and his love for Li Qiao, Xiao-Jun confesses to his wife that he has not been faithful. He then leaves Hong Kong, and becomes a cook in the United States. Pao, chased by the Hong Kong police, escapes with Li Qiao to the U.S. as illegal immigrants. After almost 10 years, Xiao-Jun and Li Qiao meet again as lonely immigrants in the U.S. (after the latter gets her green card). By then, both of them have already been freed from their previous partners - Xiao-Jun left his wife, and Pao is killed in a mugging in the U.S. The film ends with Xiao-Jun and Li Qiao fatefully meeting each other in front of an electronic store that has a display Television playing a music video by Teresa Teng, after news of the singer's death had broken.","language":"Cantonese, also available in Mandarin","Reception":"The film was very well received in Hong Kong and Taiwan, winning best picture, director, and actress for the Hong Kong Film Awards, among other wins. Maggie Cheung's performance also won general acclaim. The movie was voted #11 of the Greatest Chinese Films of all time by the Chinese Movie Database[4] and #28 of the 100 Greatest Chinese Films by the Hong Kong Film Awards. It is also listed in the 100 Greatest Chinese Films of the 20th Century by Asia Weekly Magazine.In 2011, the Taipei Golden Horse Film Festival listed Comrades: Almost a Love Story at number 16 in their list of \"100 Greatest Chinese-Language Films\".[5] The majority of the voters originated from Taiwan, and included film scholars, festival programmers, film directors, actors and producers.[5]","cinematography":"Jingle Ma","directed_by":"Peter Chan","release_dates":"2 November 1996 (1996-11-02)|||||","Production":"The Chinese title of the film, 'Tian Mi Mi', comes from a song of the same name by Teresa Teng, which is famous both in mainland China and among the overseas Chinese community. The movie displays love of the famous singer who died a year before the film was released; the film is considered a love poem in memory of Teresa Teng. Her music is featured prominently throughout the film, and Teresa Teng herself is an important subplot for the movie. Leon Lai sings the title song for the ending credits. In a cameo performance, Christopher Doyle, the internationally-known cinematographer famous for his collaboration with Wong Kar-wai, plays an English teacher.","produced_by":"Peter Chan","starring":"Maggie Cheung Leon Lai","music_by":"Chiu Jun-Fun Chiu Tsang-Hei","edited_by":"Chan Ki-hop Kwong Chi-Leung","Release":"Comrades: Almost a Love Story was released in Hong Kong on 2 November 1996.[1] The film grossed a total of HK$15,557,580 on its initial theatrical run in Hong Kong.[1]The film has been screened theatrically for the first time in nearly a decade at the Hong Kong International Film Festival in 2012 with a new 35 mm print supervised by director Peter Chan.[2] The film will be shown at the 70th Venice International Film Festival in 2013.[2]Initially the Mainland Chinese government put restrictions on the film, but they were lifted in 2015. As part of the Mainland Chinese release Luhan recorded a new version of \"Tian Mi Mi.\" Hua Hsu of The New Yorker states that the reasons why the film was restricted were \"slight, couched in minor differences of speech and habit\" and that \"Even the most ideological viewer would be hard pressed to interpret this as an aggressively political film.\"[3]","written_by":"Ivy Ho"}