{"Cast":"Uncredited:","country":"95 minutes","distributed_by":"Star Cinema","Plot":"Ina Montecillo (Ai-Ai de las Alas) meets Tony (Edu Manzano), whom she considers \"the man of her dreams\". They both have four children, but Tony dies shortly after falling from a stool. After finding a replacement father for her children, she meets Alfredo (Tonton Gutierrez), and they have four more children. Alfredo dies after falling from a pedestrian overpass, and Ina meets Kiko (Jestoni Alarcon), who fathers her other four children. On their wedding day, Kiko gets electrocuted and Ina decides to stop finding another husband.One morning, Ina wakes up finding her children Juan (Marvin Agustin), Tudis (Nikki Valdez), Tri (Carlo Aquino), Por (Heart Evangelista), Pip (Alwyn Uytingco), Six (Marc Acueza), Seven (Shaina Magdayao), Cate (Serena Dalrymple), Shammy (Jiro Manio), Ten-Ten (Yuuki Kadooka), Connie and Sweet either troubled, problematic, panicking, fighting, or confused. Later on, she finds out that her family might go poor, and so works several jobs from construction to selling bootleg DVDs just to make ends meet.She is reminded by Por of her début, while Juan begs her permission to let him find work. Ina agrees, but finds Juan's chores at home very confusing. Ina is told by her ex-driver Bruno, who reveals he is gay, that she can earn ₱2,000 a night at a stripper club. Meanwhile, Juan meets his high school girlfriend Jenny (Kaye Abad) working at an amusement park, where he decides to apply. Tudis quits her job and tries to pursue her desired career as an artist. Tri tries to impress his girlfriend Gretchen (Angelica Panganiban) and her parents (Pinky Amador and Mandy Ochoa) with his intelligence. Por tries to convince her crush, Jeffrey (John Prats), to be escort her at her début. Pip, who is a closeted homosexual, spies on his crush doing his exercise routine. Six invites their mother to a mass treat while Seven was assigned to lead a school programme on Bakit Natatangi Ang Aking Ina (\"Why My Mother Is Unique\"). Shammy becomes a victim of bullying by the Nhel's brother due to his being uncircumcised and tries to protect reputation. Pip prevents them from fighting and when Nhel arrives, he accidentally mentions that Shammy is uncircumcised, causing Shammy to hate him.Things take a turn for the worse as Ina causes more problems for her kids: she prevents Juan from marrying Jenny, while Tudis refuses to help her in job-seeking. She exposes her life as a stripper to Tri, Gretchen, and Gretchen's parents, which causes Tri and Gretchen to split. She unsuccessfully fulfils Por's million-peso début and also learns that Pip is gay, then ruins Six's \"mass treat\" after thinking it was a \"trick or treat\" event. Seven hasn't told her of the programme yet because she doesn't want to be humiliated. Cate reveals that Ten-Ten is deaf and Shammy has a high fever after having himself circumcised by an unlicensed doctor. Finally, Ten-Ten goes missing. Ina rushes in a taxi to Shammy in hospital while still in her stripper outfit, causing her cabbie Eddie (Dennis Padilla) to fall in love with her. During their subsequent family meeting, she emotionally explains to the children that she took on several jobs not because it was her obligation, but because she loves them. Her complicated speech has the opposite effect, with Juan deciding to run away with Jenny. Rowena (Eugene Domingo) comforts the careworn Ina, who thinks of how to solve everything.After quitting her job at the club, Ina takes a bus ride where she sees a suicide bomber in front her, alerts the passengers and tells them to evacuate while she fights the bomber. Gaining the upper hand, she is able to jump out of the bus just in time as the bomb detonates, killing only the bomber and giving her minor injuries upon landing. As news of the incident flashes on television, her family arrives at the hospital and mourns a corpse under a sheet thinking it was Ina, who emerges a few moments later in a wheelchair. She eventually fixes everything: she permits Juan, who returned, to date Jenny but not wed her; she convinces Tudis to get her job back and Gretchen to reunite with Tri; she accepts Pip's sexuality while Six forgives her; Seven finishes her programme; she forgives Shammy, who recovers from his infection, while she finds the still-deaf Ten-Ten in a local church.Por meanwhile finally celebrates her début, and as Eddie snaps a photo of the Montecillos, the rocket in his back pocket ignites and sends him into the sky. Ina's voiceover explains that Eddie survived the explosion and they eventually married but they couldn't have anymore children after the rocket exploded in his trousers. In the end credits, the family is shown teaching Ten-Ten sign language together, so that he can communicate with the family.","language":"Philippines","box_office":"Filipino Tagalog","Synopsis":"With three dead husbands and twelve children to take care of, what is the modern day working mother supposed to do? Ina Montecillo (Ai-Ai de las Alas) is completely clueless on how to be an income provider and a homemaker at the same time given her dwindling finances of her household. As she desperately hides from her children her efforts to make all ends meet, her children grow resentful of her as she becomes a part of their own problems, but it seems that her best is never good enough. Funnily yet, Ina rallies her cause with all the courage she can muster to be the best mother she knows how.","cinematography":"Jesse Lasaten","production_company":"Vito Cajili","directed_by":"Ang Tanging Ina DVD Cover","release_dates":"Star Cinema","produced_by":"Wenn Deramas","starring":"Mel Mendoza del Rosario Keiko Aquino","running_time":"May 28, 2003 (2003-05-28)","Sequel":"In 2008, the Star Cinema brought the second installment of Ang Tanging Ina film series which still starred Ai-Ai de las Alas, Eugene Domingo, and several others. The film revolves around Ina (Ai-Ai de las Alas) who lately became the President of the Philippines and overturns the Philippines by ruling it into a whole new dimension of enjoyment which eventually causes her a lots of serious problem about the country and with her family as well.","music_by":"Ai-Ai de las Alas Marvin Agustin Carlo Aquino Nikki Valdez Heart Evangelista-Escudero Eugene Domingo Alwyn Uytingco Shaina Magdayao Serena Dalrymple Jiro Manio Kaye Abad Angelica Panganiban John Prats Janelle Calma Bianca Calma","Ang Tanging Ina (TV series)":"After the hit blockbuster movie, it also became a hit TV sitcom (2003–2005). In the TV series, They change the last name of the cast from Montecillo to Macaspac, Inspired from the Character of Kristine Hermosa from the Iconic Teleserye Pangako Sa'yo.Alwyn Uytingco originally played the role of \"Pip\" in the movie, but in the Ang Tanging Ina (TV series) he was replaced by Ketchup Eusebio.","edited_by":"Sherman So","written_by":"Elma Madua"}