{"country":"United States","distributed_by":"20th Century Fox","language":"English","Reception":"In his review for the Globe and Mail, Jay Scott criticized the performances of the child actors: \"The brood is composed of the most appalling set of exhibitionistic child actors this side of Eight is Enough\", and felt \"that this comedy is not funny is bad enough; that it is resolutely and maliciously anti-female is unforgivable.\"[5] Newsweek magazine's Jack Kroll wrote, \"there's nothing sadder than a movie that tries to be adorable and isn't. Author! Author! tries so hard that the screen seems to sweat.\"[6] In his review for The Washington Post, Gary Arnold criticized Pacino's performance: \"Pacino's maddening articulation would seem to argue against further flings at comedy. Line after line is obscured by his whispery mumble, and this mangled speech seems particularly inappropriate in a character who's supposed to be a playwright.\"[7] The film was nominated for a Razzie Awards for Worst Original Song for \"Comin' Home to You\".[8] Critic Leonard Maltin, however, did give the film a warm review, awarding it 3 out of 4 stars, calling is a \"slight but winning comedy\", and Pacino received a Golden Globe nomination for his performance.","author!_author!":"Theatrical release poster","box_office":"$13.1 million (US)[1]","Synopsis":"Playwright Ivan Travalian (Al Pacino) has a new Broadway play (English with Tears) in rehearsal and the backers want rewrites. His wife Gloria (Tuesday Weld) is leaving him. Gloria has moved out, leaving him with custody of their five children: four from her previous marriages and his own son. And his lead actress Alice Detroit (Dyan Cannon) wants to move in with him but isn't used to kids.","cinematography":"Victor J. Kemper","directed_by":"Arthur Hiller","release_dates":"June 18, 1982 (1982-06-18)|||||","Production":"Screenwriter Israel Horovitz first worked with actor Al Pacino in 1968, when Pacino starred in his play The Indian Wants the Bronx, for which they both received Obie Awards.[2] They remained friends over the years and jumped at the chance to work again on Author! Author! The film was based on Horovitz's own personal experiences as a divorced father responsible for looking after two of his three children. \"I felt there was a lot of room to explore the ease with which people get married in this country, the way kids come along in huge bunches and the irresponsibility of parents in taking care of those children.\"[2] He also talked to his three children for inspiration. He said, \"The film had to be written in a comic mode, because otherwise it's too painful to deal with.\"[3] Horovitz made the protagonist Armenian American to give him a strong ethnic identity parallel to his own Jewish background. Director Arthur Hiller was drawn to the project because it was about an extended family and that it showed \"that love is what makes a family strong, not necessarily who's the natural parent.\"[2]Dyan Cannon was originally asked to play Gloria, but turned it down because she found the character \"bitchy\" and had played that kind of role before.[2] She was then asked to play Alice and agreed because she loved the character. Cannon enjoyed making the film and compared the experience to \"being on a cruise\".[2] Alan King also enjoyed filming and said that his character was a cross between Hal Prince and Zero Mostel.[2]During filming, Pacino did not get along with Hiller. The actor said, \"sometimes people who are not really meant to be together get together in this business for a short time. It's very unfortunate for all parties concerned.\"[4] Pacino has said that he made Author! Author! because he thought he would enjoy making a film \"about a guy with his kids, dealing with New York and show business. I thought it would be fun.\"[4] Nevertheless, Pacino said he enjoyed working with the actors who played his children.[4]","produced_by":"Irwin Winkler","starring":"Al Pacino|Dyan Cannon|Tuesday Weld|Bob Dishy|Alan King|","running_time":"110 minutes","music_by":"Johnny Mandel","written_by":"Israel Horovitz"}