{"original_language(s)":"English","audio_format":"Monaural","Broadcast history":"Car 54, Where Are You? originally aired Sunday at 8:30–9:00 p.m. on NBC, following Walt Disney's Wonderful World of Color and preceding BONANZA.","no._of_episodes":"60 (list of episodes)","cinematography":"J. Burgi Contner George Stoetzel","directed_by":"Al De Caprio Nat Hiken Stanley Prager","Home media":"In the early 1990s, Republic Home Video releases some episodes on VHS.[citation needed] Shanachie Entertainment said in 2010 it was releasing the first season on DVD in Region 1 on February 22, 2011.[6] The second and final season was released on April 24, 2012.[7]","original_release":"September 17, 1961 (1961-09-17) – April 14, 1963 (1963-04-14)","picture_format":"Black-and-white","theme_music_composer":"Nat Hiken John Strauss","opening_theme":"\"Car 54, Where Are You?\"","Production":"Many of the scripts were written by Nat Hiken. In 1962, Hiken won an Outstanding Directorial Achievement in Comedy Emmy Award for his work on the series. Hiken had previously produced The Phil Silvers Show, which featured Joe E. Ross and Beatrice Pons as a married couple.The series was originally sponsored by Procter & Gamble.The TV show's police cars on location shots were actually bright red and white, which appeared as the proper shade of gray for an NYPD car on black-and-white film. NYPD cars of that era were black and green with a white roof and trunk.[3] Two Plymouth Savoys were used as the title vehicle during the series – a 1961 Savoy during the first season and a 1963 Savoy during the second.During the closing credits of episodes in the second season, a \"futuristic\" police car was seen driving on the streets of New York City. The car was modified and, most likely, it was some type of Chrysler made vehicle that looked similar to late 1960s Dodge and Plymouth models.The theme song's lyrics were written by series creator, writer, and director Nat Hiken, with music by John Strauss.[4]There's a holdup in the Bronx, Brooklyn's broken out in fights; There's a traffic jam in Harlem That's backed up to Jackson Heights; There's a scout troop short a child, Khrushchev's due at Idlewild! Car 54, Where Are You??The line \"Khrushchev's due at Idlewild\" referred to Soviet leader Nikita Khrushchev arriving in September 1960 at New York's Idlewild Airport (now John F. Kennedy International Airport), to attend the United Nations General Assembly.The theme song was parodied in a commercial for Mario Bros. on the Atari 5200.[5]","genre":"Sitcom","running_time":"30 minutes","composer(s)":"John Strauss","no._of_seasons":"2","also_known_as":"Car 54","camera_setup":"Single-camera","production_company(s)":"Eupolis Productions","Guest stars":"Several celebrities, including Hugh Downs, Mitch Miller, Jan Murray, and Sugar Ray Robinson, appeared as themselves. Among others cast in various episodes are:","country_of_origin":"United States","original_network":"NBC","created_by":"Nat Hiken","distributor":"NBC Films (1963–1973) National Telefilm Associates (1973–1986) Republic Pictures (1986–1997) Worldvision Enterprises (1997–1999) Paramount Domestic Television (1999–2006) CBS Paramount Domestic Television (2006–2007) CBS Television Distribution (2007–present)","Synopsis":"The series follows the adventures of New York Police Department officers Gunther Toody (badge #1432) (Joe E. Ross) and Francis Muldoon (badge #723) (Fred Gwynne), assigned to Patrol Car 54 in the fictional 53rd precinct of The Bronx. Toody was short, stocky, nosy, and not very bright and lived with his loud, domineering wife, Lucille (Beatrice Pons). Muldoon was very tall, quiet, and more intelligent. He was a shy bachelor who lived with his mother and two younger sisters, who often eschewed the notion of being married.Comedic themes were often drawn from the pair's incurable warm-heartedness, and their futile attempts to subjugate this and \"get tough\", as seemed to be required in order to execute their police assignments. The story would resolve with a passive solution which left all parties happy. Other themes focused on Toody's simpleness combined with much enthusiasm and sometimes stubbornness which created comedic conflict.","1994 film":"Car 54, Where Are You? was made into a 1994 film, filmed mainly in Toronto, starring John C. McGinley as Muldoon, David Johansen as Toody, and Rosie O'Donnell. The film was made in 1990 but not released until 1994 due to the bankruptcy of Orion Pictures.[citation needed] It was a box office bomb when it was first released and was panned by critics.Original cast members Lewis and Russell appeared in the film.","car_54,_where_are_you?":"Opening title sequence","References":"Notes","Primetime Emmy Awards":"Car 54, Where Are You? was nominated for four Primetime Emmy Awards, earning one.","starring":"Joe E. Ross Fred Gwynne","Syndication":"Car 54, Where Are You? first entered into syndication in January 1964. It began airing on the cable channel Nick at Nite in 1987 and ran on the network until 1990. It was seen for less than one year on the short-lived Ha! Channel in 1990-91 and also aired on another Viacom-owned cable channel, Comedy Central, in the early 1990s. The show currently airs in the early morning hours of Sundays on Me-TV, and on the CBS piggy-backed channel - DECADES.","producer(s)":"Nat Hiken Billy Friedberg"}