{"country":"United States","distributed_by":"Focus Features","Plot":"Verona De Tessant (Maya Rudolph) and Burt Farlander (John Krasinski) are in their early thirties and struggling to meet daily needs and build fulfilling lives. When they learn they will soon become parents, they are confronted with the challenge of how – and where – to raise a child and build a happy family.Six months into Verona's pregnancy, the couple visit their only family in the area, Burt's parents, Gloria and Jerry (Catherine O'Hara and Jeff Daniels), only to find that Gloria and Jerry have decided to move to Antwerp, Belgium, a month before the baby is due. They also announce that they will be gone for two years and they have already rented the place out to another couple, despite Burt's and Verona's situation. Frustrated with Gloria and Jerry's selfishness and careless attitude, Burt and Verona decide this is an opportunity to find somewhere else to raise their family, since they are both employed in situations where they can work from home and live wherever they choose.They first visit Phoenix, Arizona, meeting up with Verona's old boss, Lily (Allison Janney), her husband, Lowell (Jim Gaffigan), and their two children. Burt in particular is disturbed by Lily and Lowell's crass and mean-spirited behavior toward one another and their children.Burt and Verona next visit Verona's sister, Grace (Carmen Ejogo), in Tucson, Arizona. At Verona's request, Burt tries to persuade Grace to stay with her boring boyfriend. When Burt takes a call and displays his trademark humor, Grace tells Verona that she is lucky to have him and Verona agrees.They next visit Burt's childhood friend and pseudo-cousin in Madison, Wisconsin, \"LN\" (pronounced \"ellen\") (Maggie Gyllenhaal), a college professor with inherited money and radical views about parenting. Burt and Verona bring a stroller as a gift, greatly angering LN as she and her husband Roderick (Josh Hamilton) are a \"continuum home.\"[3] When Roderick's condescension and LN's backhanded compliments to Verona get to be too much for Burt, he tells them they are horrible people and he and Verona leave but not before taking their son on a wild stroller ride through the house (which he enjoys).Burt and Verona then visit old college friends in Montreal, Tom (Chris Messina) and his wife, Munch Garnett (Melanie Lynskey), and their diverse family of adopted children. Verona and Burt are happy to have found a loving family and a nice town and decide to move to Montreal. After dinner, Tom confesses to Burt that Munch has recently suffered her fifth miscarriage and that they seem unable to have biological children.In the morning, Burt receives an emergency call from his brother, Courtney (Paul Schneider), in Miami, whose wife has left him. Burt and Verona fly to Miami, where Courtney worries about his young daughter and the potential effects of a divorce on her. Burt tries to comfort Courtney while Verona spends time with his daughter. Burt and Verona spend the night outside on a trampoline, promising to love each other and their daughter and have a happy home.The next day, Verona tells Burt a story about her childhood house and her parents (who were both killed when she was 23). Moved by her memory, they decide to settle in Verona's old family home. Realizing it is the place for them, they sit together happily, overlooking the water.","away_we_go":"Theatrical film poster","language":"English","box_office":"$14,899,417[1]","cinematography":"Ellen Kuras","production_company":"Big Beach Neal Street Productions","directed_by":"Sam Mendes","Soundtrack":"The soundtrack of Away We Go was released on June 2, 2009, and primarily features songs from Scottish singer/songwriter Alexi Murdoch, instead of an original film score.(All songs by Alexi Murdoch except where noted)\"All My Days\" was featured in the film's trailer.","Critical reviews":"The film received a positive rating of 67% based on 173 film critics at the aggregate site Rotten Tomatoes.[4] A.O. Scott of The New York Times described the two main characters as self-righteous people \"aware of their special status as uniquely sensitive, caring, smart and cool beings on a planet full of cretins and failures\".[5] Metacritic reported the film had an average score of 58 out of 100, based on 33 reviews.[6]","release_dates":"June 5, 2009 (2009-06-05)|||||","produced_by":"Edward Saxon Marc Turtletaub Vincent Landay","starring":"John Krasinski Maya Rudolph Jeff Daniels Carmen Ejogo Jim Gaffigan Maggie Gyllenhaal Josh Hamilton Allison Janney Melanie Lynskey Chris Messina Catherine O'Hara Paul Schneider","running_time":"98 minutes","music_by":"Alexi Murdoch (Songs)","edited_by":"Sarah Flack","written_by":"Dave Eggers Vendela Vida","budget":"$17 million[1]"}