{"based_on":"Between a Rock and a Hard Place  by Aron Ralston","Cast":"Aron Ralston, and his wife and son make cameo appearances at the end of the film.","country":"United Kingdom United States","distributed_by":"Fox Searchlight Pictures Pathé International Warner Bros. Pictures","screenplay_by":"Danny Boyle Simon Beaufoy","Plot":"Mountaineer and adventurer Aron Ralston (James Franco) drives to Utah's Canyonlands National Park for a day of hiking. On foot, he befriends hikers Kristi (Kate Mara) and Megan (Amber Tamblyn), and shows them an underground pool. After swimming, Aron parts ways with the hikers, and continues his hike through a slot canyon in Blue John Canyon. While climbing down, he slips and falls, knocking loose a boulder which pins his arm against the wall. Unable to move the boulder, he tries calling for help but realizes that he is alone. He begins recording a video diary to maintain morale, and uses his pocket knife to chip away parts of the boulder in order to free his trapped arm. He rations his food and water, in order to survive the ordeal.After many hours of chipping away at the boulder, he realizes he is not getting any closer to freeing himself. He sets up a pulley system using his climbing rope to try and lift the boulder, to futile attempt.Days after being trapped, he considers using his pocket knife to cut himself free, but finds the dull blade unable to cut bone. With no water, he is forced to drink his own urine. His vlogs then become desperate and depressing. He hallucinates about escape, relationships, and past experiences, including a former lover (Clémence Poésy), family (Lizzy Caplan, Treat Williams, Kate Burton), and the hikers. He then reflects that the boulder was his destiny.Ralston realizes that by his knowledge of applying torque, he can break the radius and ulna, letting him amputate his arm in order to escape. He fashions a crude tourniquet out of CamelBak tube insulation, uses a carabiner to tighten it, and cuts tissue soon to his success. He wraps the stump of his arm to prevent exsanguination and takes a picture of the boulder. He then rappels down a 65-foot rockface using his other arm, and drinks rainwater from a small pond in the hot midday sun. He meets a family on a day hike, who alert the authorities to Ralston's presence, and a Utah Highway Patrol helicopter is dispatched. Ralston is taken to a hospital where he recovers, and is fitted with a prosthesis, and continues his hobbies of climbing canyons and mountains, along with starting a family of his own.","language":"English","box_office":"$60.7 million[1]","cinematography":"Anthony Dod Mantle Enrique Chediak","production_company":"Everest Entertainment Film4 Productions HandMade Films","directed_by":"Danny Boyle","Authenticity":"The scenes early in the film of Ralston's encounter with the two hikers were altered to portray Ralston showing them a hidden pool, when in reality he just showed them some basic climbing moves. Despite these changes, with which he was initially uncomfortable, Ralston says the rest of the film is \"so factually accurate it is as close to a documentary as you can get and still be a drama\".[2]Other changes from the book include omissions of descriptions of Ralston's efforts after freeing himself: he had to decide where to seek the fastest medical attention; he took a photo of himself at the small brown pool from which he really did drink; he had his first bowel movement of the week; he abandoned a lot of the items he had kept throughout his confinement; he got lost in a side canyon; and he met a family from the Netherlands (not an American family), Eric, Monique, and Andy Meijer, who already knew that he was probably lost in the area, thanks to the searches of his parents and the authorities. (The actor who plays Eric Meijer, Pieter Jan Brugge, is Dutch.)Franco is never shown uttering even an \"Ow\"; Ralston wrote that this is accurate.[3]Ralston did send Monique and Andy to run ahead to get help, and Ralston did walk seven miles before the helicopter came,[4] although this trek is shown in the film's alternate ending.[citation needed]","127_hours":"North American release poster","release_dates":"4 September 2010 (2010-09-04) (Telluride Film Festival)|5 November 2010 (2010-11-05) (United States)|7 January 2011 (2011-01-07) (United Kingdom)|||","Production":"Danny Boyle had been wanting to make a film about Ralston's ordeal for four years;[5] he wrote a film treatment and Simon Beaufoy wrote the screenplay.[6] Boyle describes 127 Hours as \"an action movie with a guy who can't move\".[7] He also expressed an interest for a more intimate film than his previous film, Slumdog Millionaire (2008): \"I remember thinking, I must do a film where I follow an actor the way Darren Aronofsky did with The Wrestler. So 127 Hours is my version of that.\"[8]Boyle and Fox Searchlight announced plans to create 127 Hours in November 2009,[9] and News of the World reported that month that Cillian Murphy was Boyle's top choice to play Ralston.[10] In January 2010, James Franco was cast as Ralston.[11] In March 2010, filming began in Utah;[12] Boyle intended to shoot the first part of the film with no dialogue.[5] By 17 June 2010, the film was in post-production.[13]Boyle made the very unusual move of hiring two cinematographers to work first unit, Anthony Dod Mantle and Enrique Chediak, each of whom shot 50 percent of the film by trading off with each other. This allowed Boyle and Franco to work long days without wearing out the crew.[14]Boyle enlisted makeup effects designer Tony Gardner and his effects company, Alterian, Inc., to re-create the character's amputation of his own arm. Boyle stressed that the realism of the arm as well as the process itself were key to the audience's investing in the character's experience, and that the makeup effects' success would impact the film's success. The false arm rigs were created in layers, from fiberglass and steel bone, through silicone and fibrous muscle and tendon, to functional veins and arteries, and finally skinned with a translucent silicone layer of skin with a thin layer of subcutaneous silicone fat. Gardner states that the effects work was extremely stressful, as he wanted to do justice to the story; he credits James Franco equally with the success of the effects work.[citation needed] Three prosthetics were used in all, with two designed to show the innards of the arm and another to emulate the outside of it. [15]Franco would later note that seeing blood on the arm was difficult for him and his reactions in those scenes were genuine. [15]Franco admitted that shooting the film was physically hard on him: \"There was a lot of physical pain, and Danny knew that it was going to cause a lot of pain. And I asked him after we did the movie, 'How did you know how far you could push it?' ... I had plenty of scars... Not only am I feeling physical pain, but I'm getting exhausted. It became less of a façade I put on and more of an experience that I went through.\"[16]","produced_by":"Danny Boyle Christian Colson John Smithson","starring":"James Franco Amber Tamblyn Kate Mara","running_time":"93 minutes","music_by":"A. R. Rahman","edited_by":"Jon Harris","Release":"127 Hours was screened at the Toronto International Film Festival on 12 September 2010, following its premiere at the 2010 Telluride Film Festival.[17] The film was selected to close the 2010 London Film Festival on 28 October 2010.[18] It was given a limited release in the United States on 5 November 2010.[19] It was released in the United Kingdom on 7 January 2011, and in India on 26 January 2011.[20][21]There were many published reports (not all confirmed) that the trailer and film made audience members ill. The Huffington Post, in November 2010, wrote that it \"has gotten audiences fainting, vomiting and worse in numbers unseen since The Exorcist – and the movie has not even hit theaters yet.\"[22] During the screenings at Telluride Film Festival, two people required medical attention. At the first screening, an audience member suffered from lightheadedness and was taken out of the screening on a gurney. During a subsequent screening, another viewer suffered a panic attack.[23] Similar reactions were reported at the Toronto International Film Festival[24] and a special screening hosted by Pixar and Lee Unkrich, director of Toy Story 3 (2010).[25] The website Movieline published \"Armed and Dangerous: A Comprehensive Timeline of Everyone Who's Fainted (Or Worse) at 127 Hours.\"[26]127 Hours received universal acclaim from critics, with widespread praise directed towards Franco's performance. Review aggregation website Rotten Tomatoes reports that 93% of 216 professional critics have given the film a positive review, with a rating average of 8.3 out of 10.[27] The site's consensus is: \"As gut-wrenching as it is inspirational, 127 Hours unites one of Danny Boyle's most beautifully exuberant directorial efforts with a terrific performance from James Franco.\"[27]On Metacritic, which assigns a weighted mean rating out of 100 reviews from film critics, the film has a rating score of 82% based on 38 reviews.[28] Writing for DVD Talk, Casey Burchby concluded that: \"127 Hours will stay with you not necessarily as a story of survival, but as a story of a harrowing interior experience\".[29] Richard Roeper of The Chicago Sun-Times gave the film four stars, said he believed Franco deserved an Oscar nomination for his performance, and called the film \"one of the best of the decade\". Roger Ebert also awarded the film four stars and said, \"127 Hours is like an exercise in conquering the unfilmable\".[30] Gazelle Emami wrote for The Huffington Post: \"Franco is mesmerizing as he steers his character from one who acts with reckless disregard to an introspective, remorseful soul, all the while maintaining his playful spark. To accomplish this range in a role that mostly consists of him speaking aloud to himself is incredible.\"[31]127 Hours was nominated for three Golden Globe Awards, including Best Actor, Best Screenplay and Best Original Score.[32]The film was nominated for nine British Academy Film Awards, including Outstanding British Film, Best Direction, Best Actor in a Leading Role, Best Adapted Screenplay, Best Cinematography, Best Editing, and Best Film Music.[33]The film got six nominations at the 83rd Academy Awards, including Best Picture, Best Actor, Best Adapted Screenplay, Best Original Score, Best Original Song, and Best Film Editing.[34]It was also nominated for eight Broadcast Film Critics Association, including Best Film, Best Director, Best Actor, Best Adapted Screenplay, Best Cinematography, Best Editing, Best Song, and Best Sound.[35] Its main theme song \"If I Rise\" won the Critics Choice award for Best Song.[36]James Franco was awarded Best Actor by New York Film Critics Online.[citation needed]","budget":"$18 million[1]"}