{"all_night_long":"Original film poster","country":"United States","distributed_by":"Universal Pictures","Plot":"George Dupler (Gene Hackman), a married man nearing middle age, is demoted after a temper tantrum at work (throwing a chair out of his boss's window) and reduced to working as the midnight-shift manager of an all-night pharmacy/convenience store.George's adult son, Freddie (Dennis Quaid), is having an affair with an older, married woman, who also happens to be Freddie's fourth cousin. George advises Freddie to stop the affair before it leads to any trouble, but Freddie declares that he might love her. One night at the store, George finally meets the woman, Cheryl (Barbra Streisand), an untalented singer-songwriter married to a volatile firefighter, Bobby (Kevin Dobson), and she begins to show an interest in him. After a while, the interest is mutual.George goes to Cheryl's house to return her cigarette lighter. She offers to show George the paint job Freddie has done in her bedroom. George and Cheryl are about to get intimate, when Freddie comes over to see Cheryl for another tryst. George escapes before Freddie could see him, but Cheryl decides to tell Freddie about the affair she is having with his dad. The next day, when George is trying to sleep, and his wife, Helen (Diane Ladd), is having a French class, Freddie confronts his father, trying to fight him. Helen hears about the affair and George leaves. When she demands a divorce, George agrees.George ends up quitting his job and buying a loft where he can pursue his dream of being an inventor. George goes to an anniversary party where everybody he knows is there, including his family, plus Cheryl and Bobby. He realizes Bobby is aware of the affair with his wife. George takes Cheryl away from the party and her husband. Even though Cheryl loves him, she thinks he is too good for her.Cheryl goes to the fire station where Bobby works to talk to him. Bobby ends up yelling at her and is about to hit her when the fire alarm goes off. He and all of the firemen leave, whereupon we see that it was George who reported the nonexistent fire.Cheryl moves into George's place. Freddie has accepted the situation and helps her move in, showing that he and his dad have reconciled.","language":"English","Reception":"Streisand was nominated for a 1981 Golden Raspberry Award for her performance. The film received negative reviews,[3] though some critics cited Streisand's performance as one of her best. Stephen Holden, in Rolling Stone magazine, gave the film a positive review, adding that Streisand's performance suggested Marilyn Monroe. Pauline Kael in The New Yorker was full of praise: \"The director, Jean-Claude Tramont, a Belgian who has worked in American television, is a sophisticated jokester. There may be a suggestion of Lubitsch and of Max Ophüls in his approach, and there is more than a suggestion of Jacques Tati. Gene Hackman, whose specialty has been believable, lived-in characters, gives one of his most likable performances.\"[4] Gary Arnold of The Washington Post also praised Hackman's performance, calling it \"the most endearing of his career, an impression of frustrated but resilient middle-class masculinity that should evoke as much recognition and rooting interest among men as women seemed to derive from Ellen Burstyn's role in 'Alice Doesn't Live Here Anymore.'\"[5]","box_office":"$4,454,295","cinematography":"Philip H. Lathrop","directed_by":"Jean-Claude Tramont","release_dates":"March 6, 1981 (1981-03-06)|||||","Production":"The film was originally planned as a low-budget release, with Hackman and Lisa Eichhorn. Streisand's then-agent, Sue Mengers, who was married to the film's director, Jean-Claude Tramont, suggested Barbra for the part instead of Eichhorn, even though filming already was under way. Several biographies suggest that because of the film's subsequent failure at the box office, Streisand fired Mengers.","Box office":"Although generally seen as a flop, the film opened at #1 on the American film charts with an opening weekend of $1,391,000, and grossed around $10,000,000 worldwide. Adjusting for inflation, this is around $25.6 million in 2013 dollars.[6] The Independent Movie Data Base website lists the film's total U.S. gross as less than $4.5 million.","produced_by":"Associate producers: Terence A. Donnelly Fran Roy Producers: Leonard Goldberg Jerry Weintraub","starring":"Barbra Streisand Gene Hackman Diane Ladd Dennis Quaid Kevin Dobson William Daniels Hamilton Camp Terry Kiser Charles Siebert Vernee Watson Raleigh Bond Annie Girardot","running_time":"88 minutes","music_by":"Richard Hazard Ira Newborn José Padilla","edited_by":"Rachel Igel Marion Rothman","written_by":"W. D. Richter"}