{"based_on":"Black Beauty 1877 novel  by Anna Sewell","country":"United States","distributed_by":"20th Century Fox","Plot summary":"The story picks up in 1880s England, when Duchess, the mare of a widower, a country squire, called Wendon (Charles Evans) is about to foal. He has forbidden his adolescent daughter Anne (Mona Freeman) to watch, but the girl sneaks into the stables and watches anyway.Anne gets the colt on her birthday and because of its colour she names it Black Beauty. Anne grows very affectionate towards the horse as they grow up together during the years.One day a young man from America, Bill Dixon (Richard Denning), comes to visit the neighbors on the next farm, and he notices Black Beauty. He can't stay for tea because he is leaving for America, but two years later he sends Anne a gift and a letter from Bill, saying that he will be back soon. Anne then starts riding her horse and teaching him to jump. But just as she has learned to appreciate taking care of her horse, her father wants to send her away to a boarding school to learn how to be a woman.Bill soon returns to England, after graduating from an Ivy League college. Anne falls in love with the handsome young man, but he still regards her as a child. When they ate out riding together, Bill brings the neighbors' daughter, Evelyn Carrington (Evelyn Ankers), and Anne gets jealous. She decides to prove herself as a horsewoman and rides side-saddle like the grown women do, to try to catch Bill's interest.After Evelyn's horse is injured, she borrows Black Beauty to go riding with Bill. Anne decides to follow them afterwards, and borrows another horse from her father, called Ginger - but she falls off when jumping recklessly in front of Bill Dixon, attempting to show off. She is knocked unconscious by the fall and Bill has to fetch Doctor White (John Burton)on Black Beauty.The horse is exhausted from the hard riding, and in need of rest and treatment for a leg injury. Unfortunately the groom, Joe, fails to stop the horse drinking a large amount of cold water, which is bad for horses when they're hot. Overnight, Black Beauty becomes very sick.When Anne wakes up again she discovers that Black Beauty is ill, and that Joe has left his employment, blaming himself for the horse's condition. But the horse begins to get well again, and Bill and Evelyn come to visit Anne.Anne hasn't overcome her jealousy, and the visit prompts her to go off to boarding school as her father has suggested. One of Wendon's employees, John (J. M. Kerrigan), promises Anne he will take care of her horse while she is gone. But it turns out that Black Beauty is more ill than expected.It is decided the horse is to be put down, but John only pretends to carry out the deed, firing his gun once out of sight, deliberately missing the horse. He hides the horse from his employer. When Anne comes back from school she hears the good news from John.But then Black Beauty is sold on an auction by the man who was supposed to be hiding him. Black Beauty is now owned by a local baker who does not treat him well, and Anne and John go looking for him, followed by Bill, who has begun to take a romantic interest in Anne.In their search they bump into Joe, who knows that the horse is being kept nearby.They get there as the stable catches fire. Anne tries to save Black Beauty from the flames, but she and the horse both need rescuing by Bill, who arrives just in time to get them out.The story ends with Anne and Bill kissing and Black Beauty the proud father of a new colt.[1]","screenplay_by":"Lillie Hayward Agnes Christine Johnson","language":"English","cinematography":"Roy Hunt","directed_by":"Max Nosseck","release_dates":"August 29, 1946 (1946-08-29)|||||","produced_by":"Edward L. Alperson","starring":"Mona Freeman Richard Denning Highland Dale","running_time":"74 minutes","music_by":"Dimitri Tiomkin","edited_by":"Martin Cole"}