{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Born without an immune system, Jimmy Livingston is forced to live in a sterilized dome in his bedroom, earning him the title \"Bubble Boy\" by his neighbors. Jimmy's overbearing and devout Christian mother only exposes him to Highlights magazine and the Land of the Lost for entertainment. When he is a teenager, a girl named Chloe moves in next door. Jimmy is immediately taken with her, and eventually befriends her despite his mother's discouragement.Chloe visits Jimmy and tells him that she is leaving for Niagara Falls to marry her boyfriend, Mark, in three days. Jimmy realizes that Chloe cares for him. Realizing how much he cares for her, Jimmy builds a mobile bubble suit and runs away from home, determined to stop the wedding.On the first day of his journey, he's unable to afford a bus ride to Niagara Falls, but is picked up by an overly enthusiastic cult on a pilgrimage towards enlightenment. By this time, Jimmy's mother has discovered her son missing, so she and her husband set off to find Jimmy.While traveling through the desert, Jimmy meets Slim, a biker with a flat tire. Jimmy offers to fix the flat with some patches and the two become friends. Elsewhere, Gil, the leader of the cult Jimmy met, has revealed their messiah is \"the round one,\" and that whoever rejects him will suffer. The group who abandoned Jimmy set off to find him. Jimmy and Slim have traveled to Las Vegas for traveling money. However, Slim gets caught up in the Vegas life so Jimmy goes on without him. The cult runs into Slim in Vegas while asking for directions. Slim recognizes them from Jimmy's story and threatens them, only to have his bike destroyed by the cult bus.Jimmy then wanders into a restaurant where an Indian man is being antagonized by the ignorant townspeople. When Jimmy tries to defend him, the townspeople begin to probe him about his suit, but panic and evacuate the restaurant when they misunderstand his illness. Pushpop thanks Jimmy for his earlier kindness and agrees to take him to Niagara Falls. Meanwhile, Jimmy's parents have met up with Dr. Phreak, whom Jimmy's mother mistakes for a child and brings along with them. Elsewhere in Niagara Falls, Chloe is apprehensive about marrying Mark and can't stop thinking of Jimmy.To earn the money Jimmy goes into a Chinese casino nearby and enters a mud wrestling competition for a prize of $500. Having won the prize, Jimmy is spotted and picked up by the cult bus as he heads back to the taxi. Luckily, the freaks have followed Jimmy and realizing he's in danger, disguise themselves as members of the cult and trick them into believing they're mutating for their earlier crimes against Jimmy.On the last day of his journey, Pappy and Jimmy have now arrived in New York, but Pappy is unresponsive, having apparently died behind the wheel overnight, forcing Jimmy to abandon the moving taxi before it crashes. Jimmy tries to call Chloe to tell her of his success, only to reach her fiance Mark, who rudely convinces him that Chloe doesn't really love him. Jimmy becomes depressed at this assumed rejection and calls Dr. Phreak, ready to assume his role as a freak like the others.When his parents pick him up, Jimmy and his father are sitting alone in the car. His father regrets that Jimmy is giving up when he is so close. Jimmy's father then looks the other way while Jimmy escapes to finish his mission. With the help of Pappy's brother Pippy, Jimmy flies to the wedding. His mother tries to stop him from taking off, but Slim stops her and its revealed that they knew each other in the past as she's the \"Wildfire\" he kept mentioning. Like Pappy, Pippy apparently dies at the wheel and Jimmy ends up falling out of the plane and over Niagara Falls, but he survives.Jimmy manages to escape the water and arrives just in time to stop the wedding. He then removes his bubble suit, allowing him to touch the girl he loves for the first time. Jimmy's mother then confesses that Jimmy had developed an immune system when he was four, revealing that he is not actually dead at all and Jimmy's perfectly fine.Finally, Jimmy and Chloe are married with all of Jimmy's new friends in attendance. Jimmy's mom rides off with Slim and Jimmy's father. Pushpop has become the new leader of the former cult who are apparently now followers of Hinduism. Dr. Phreak has befriended his band of freaks and Jimmy's mother has reunited with Slim and embraced a more rebellious lifestyle. Pippy and Pappy drive off with Jimmy and Chloe to their honeymoon.","language":"English","Reception":"The film opened at #13 at the U.S. Box office, taking in $2,038,349 USD in its opening weekend, being a box office bomb. The film also received mixed reviews from critics, and as of December 22, 2014, has a 29% \"rotten\" rating on Rotten Tomatoes, based on 82 reviews (24 \"fresh\", 58 \"rotten\"); the site's consensus states that \"Bubble Boy bounces along with lame, offensive jokes that are more tasteless than funny.\" In recent years, the film has achieved the status of a \"cult comedy.\"[3]","box_office":"$5 million","cinematography":"Jerzy Zielinski","production_company":"Touchstone Pictures","directed_by":"Blair Hayes","release_dates":"August 24, 2001 (2001-08-24) (United States)|||||","bubble_boy":"Theatrical release poster","produced_by":"Beau Flynn","starring":"Jake Gyllenhaal Swoosie Kurtz Marley Shelton Danny Trejo John Carroll Lynch","running_time":"85 minutes","music_by":"John Ottman","edited_by":"Pamela Martin","written_by":"Cinco Paul Ken Daurio","budget":"$13 million"}