{"country":"United Kingdom","distributed_by":"Tigon British Film Productions (UK Release) Paramount Pictures (USA Release)","Plot":"Black Beauty is a stallion who, as a foal in England c 1856, is befriended by a boy named Joe (the film was actually made in Ireland). He is stolen by a brutal squire, who also takes over Joe's family farm. After the squire is killed, he is acquired by gypsies, who then sell him to a Spanish circus.In the circus, he learns many tricks before being given to Sir William, an arrogant British military man; and then is passed to Sir William's daughter and her fiance, Gervais, whom Sir William accuses of being a coward and unworthy of his daughter's hand.Black Beauty then travels to India (scenes were shot in Spain) with Gervais to fight for Britain. Gervais wants to prove his worth to his future father in law. Gervais is killed in a rather confusing and unexplained battle (possibly based on the Russian presence in India and Afghanistan c1860), and the horse becomes known as a war horse through his bravery and willingness to charge.Because of his bravery he is shipped back to England, but is then sold by a penniless army officer. The horse is used for hauling coal by another heartless owner, but acquires pneumonia. At his most sick, he is rescued by a friendly old woman who runs a farm for retired horses and her employee, some time after 1870. The employee turns out to be the boy named Joe whom Black Beauty knew when he was a foal, while the woman was Anna Sewell (author of the original Black Beauty book).","language":"English","Reception":"Roger Ebert was overall complimentary of the film, and believed the re-telling of the book remained true to the original aims of the author, although changing the actual biography of the horse. According to Ebert, James Hill's version of Black Beauty is \"more than just an animal movie\". Ebert was also generally complimentary of the human actors in the movie, although he panned the performance of Mark Lester as Joe. He gave the film three out of four stars.[1] A review in the New York Times also commented on the major plot changes, but called the movie \"uncommonly interesting, handsome and sometimes quite marvelously inventive\". The review praised the atmosphere of the movie and the performances of several actors in secondary roles, but called the performances of Mark Lester and Walter Slezak \"utterly pedestrian\".[2]","cinematography":"Chris Menges","directed_by":"James Hill","black_beauty":"Theatrical release poster","release_dates":"April 1971 (1971-04)","Filming":"It was shot on location in Ireland and Spain.[1]","produced_by":"Peter L. Andrews Artur Brauner Malcolm B. Heyworth Executive producer: Peter Hahne Tony Tenser Harry Alan Towers (uncredited)","starring":"Walter Slezak Mark Lester Patrick Mower John Nettleton","running_time":"106 minutes","music_by":"Lionel Bart John Cameron","edited_by":"Ann Chegwidden Pablo González del Amo","written_by":"Anna Sewell (novel) Wolf Mankowitz (screenplay) James Hill (additional dialogue)"}