{"Cast":"This film has an almost all-female cast featuring many of Almodóvar's favorite leading ladies: Julieta Serrano, Carmen Maura, Marisa Paredes and Chus Lampreave. It also has a very brief appearance by Cecilia Roth as Mercedes a former redeemer and lover of the Mother Superior.","country":"Spain","distributed_by":"Tesauro","dark_habits":"Original poster by Iván Zulueta","DVD release":"Dark Habits was released on DVD in the USA on 9 September 2003. The film is in Spanish with English subtitles. It is the earliest of Almodóvar's films available on DVD in the United States.","Plot":"Yolanda, a cabaret singer, brings heroin to her lover who drops dead of an overdose. To escape from the police, the singer looks for refuge in a local convent. The Mother Superior, a fan of Yolanda, rapturously greets her. The mission of the order, called the Humiliated Redeemers (Redentoras humilladas), is to offer shelter and redemption to fallen women. The convent once was a bustling haven for prostitutes, drug addicts and murderers, but it is now in disrepair. The order is facing serious financial hardships as their prime financial supporter, the vain and greedy Marchioness (La Marquesa) has decided to discontinue the convent's annuity under the pretense of economizing. She feels less affinity with the sisters than did her recently deceased husband, who set up a fund in gratitude. The convent had taken in their wayward daughter, Virginia, who subsequently became a nun and ran off to Africa, only to be eaten by cannibals.Six religious members of the community live at the convent: the mother Superior, four other nuns and the chaplain. To reinforce their vows of humility, the Mother Superior has given the other nuns repulsive new names: Sister Manure, Sister Damned, Sister Snake and Sister Sewer Rat. With few opportunities for spiritual ministry, the nuns have begun to indulge in their own idiosyncratic pursuits in order to pass the time. The nurturing Sister Damned compulsively cleans the convent and coddles all the animals under her care, including an overgrown pet tiger that she treats like a son, playing the bongos for him. The ascetic Sister Manure is consumed by thoughts of penitence and corporal self-sacrifice and cooks between LSD hallucinations. She murdered somebody and as the mother superior lied under oath to save her from jail, she is very devoted to her. The overcurious Sister Sewer Rat gardens and secretly, under the pen name Concha Torres, writes lurid novels about the wayward souls who visit the convent. She smuggles the novels out of the convent through her sister's periodic visits. The unassuming Sister Snake, with the help of the priest, tailors seasonal fashion collections for dressing the statues of the Virgin Mary. Her piety is a cover up for her romantic love for the chain-smoking chaplain. The mother Superior is a heavy drug user and a lesbian, whose charitable work is a means of meeting needy young women. She admits, “From admiring them so much I have become one of them”.At the convent, Yolanda mingles with the nuns and spends her time reading the diary of her deceased boyfriend finding out how their relationship really was. The Mother Superior soon falls passionately in love with her. Together, they consume coke and heroin until Yolanda decides both should come off the drugs. Withdrawal for Yolanda is like a painful catharsis, but for the Mother Superior it confirms her very sinful nature. Yolanda keeps the Mother Superior at arm’s length and strikes a friendship with Sister Rat.The Mother Superior has to face both Yolanda’s rejection and the threats of closure. She fails to blackmail the Marquise with a letter revealing information about Virginia. Undiscouraged, she then prepares to resort to drug trafficking to maintain the independence of her convent. In spite of these trials, the Sisters decide to celebrate the Mother Superior's birthday. The Marquise and nuns from other convents come to the party. During the celebrations, Yolanda, accompanied by the sisters, sings in honor of the Mother Superior. The Marquise manages to get a letter that coming from Africa has informed her about a long lost grandson that has been raised by the Apes. Because Yolanda and Sister Rat helped her to obtain the letter, she is very grateful to them. At the end of the party, the new Mother General, the highest authority in their order, announces the dissolution of the convent. Sister Damned decides to return to her native village and leaves her tiger to Sister Snake and the Priest. They are in love and want to start a family with the tiger as their son. Sister Rat and Yolanda go to live with the Marquise. Only Sister Manure is left to console the Mother Superior from the terrible heartbreak Yolanda’s desertion has caused.","language":"Spanish","Reception":"Dark Habits, Almodóvar’s third film, was produced by Tesauro and appeared in 1983.[5] It was rejected by the Cannes Film Festival on account of its apparently sacrilegious treatment of religion, and although it had its premiere on 9 September at the Venice Film Festival,[5] some of the organizing committee considered it blasphemous and anti-Catholic and it was not shown in the official section.[5]The Italian critics were divided in their opinions.[5] The film critic of the Venetian Il Gazzetino described the film as scandalous, but his counterpart in Corriere Della Sera saw Almodóvar as a true heir of the acclaimed Italian film director Pier Paolo Pasolini and applauded his attack on the repressive nature of formal religion.[5] When a month later, Dark Habits opened in Madrid, the Spanish critics reacted in a similar fashion.[6]Dark Habits was a modest success, and cemented Almodóvar’s reputation as the enfant terrible of the Spanish cinema.","Quotes":"Marchioness: And anyway, I have no money. You may not have heard here about the economic crisis.Mother Superior: You're a millionaire!Marchioness: To survive today, one needs to be. And I don't want just to survive, I want to live life.","box_office":"ESP 259,429 (Spain)","cinematography":"Ángel Luis Fernández","directed_by":"Pedro Almodóvar","Analysis":"Comparing Dark Habits with his first two films, Almodóvar has suggested there is a change of tone and that the emotions are expressed more clearly and the characters are driven by them.[6]” In short, it is a deeper and more serious film; but he has denied that it is antireligious.[7][8] The nuns, he has pointed out, have moved away from God and now direct their energies towards those people who live in misery- fallen women and the like.[7] This, he implies, is true religion: to be able to love the sinner and, indeed, to become like the sinner, for only then can one appreciate the nature of sin.[7] The implication of the film is that men and women have to be loved and accepted in all their imperfections – a view which links Almodóvar to Luis Buñuel, particularly in Viridiana, where the eponymous nun finds that, for all her idealistic intentions, she cannot change the nature of mankind.[7]Dark Habits has a variety of cinematic influences.[7] The Franco regime, strongly supportive of the Catholic Church, had promoted sentimental films, such as Sister San Sulpicio and Marcelino, Bread and Wine, in which goodhearted priests and the like figured prominently. Together with musicals and light comedy in which nuns appeared, they were part of a propaganda attempt to make Spanish cinema feel good and new. The film was also influenced by the melodramas of Douglas Sirk.[7] The romantic and often sentimental qualities of his films are evident in Dark Habits. The film also owes something to the Hammer horror films of the 1960s and the 1970s, though Almodóvar has said he was influenced less by their subject matter than by their dramatic colors and their unsettling baroque atmosphere.[7] He has also made the point that, for him, melodrama is a form in which love and passion are the driving force which oblige individuals to do the most extraordinary things, whether they be appalling or wonderful.[7]Music, as in all Almodóvar’s major films, also has a significant role. The bolero, regarded by him as expressive of great emotions, is used at key moments to underpin both the mother’s superior feelings for Yolanda and Yolanda’s feelings for her. They sing along with Lucho Gatica’s bolero: Encadenados (Chained together).[9]Reminiscent of Robert Bresson's Les Anges du Péché, Almodóvar's idiosyncratic fusion of highly formalized, often surreal visual imagery (saturated primary colors, muted and diffused lighting, kitschy interiors) and comedic melodrama serves as a thematic foil in order to explore crisis of faith and the innate hypocrisy and encroachment of secularism in institutional religion: the ironic reunion between the successful call girls and the destitute nuns selling an odd assortment of goods (cakes, flowers, and peppers) at the market; the melancholic and sentimental ballad of unrequited love and loss that covertly expresses the Mother Superior's spiritual crisis; the convent's crumbling structure that figuratively manifests the nuns' moral decay; Yolanda's facial imprint on a handkerchief that serves as a tawdry surrogate relic for the Shroud of Turin.[10] Through the convent's bizarre and misguided attempts to spiritually reconnect through escapism, distraction, and illusion, Dark Habits reflects the inherent incongruence and corruption of seeking redemption and existential purpose in an increasingly chaotic, amoral, and hedonistic world.","release_dates":"10 March 1983 (1983-03-10) (Spain)|6 May 1988 (1988-05-06) (U.S.)||||","Production":"After making Labyrinth of Passion Almodóvar was approached by Hervé Hachuel, a multimillionaire who wanted to start a production company to make films starring, his then girlfriend, Cristina Sánchez Pascual.[3] He set up Tesauro Production and asked Almodóvar to write a film with her in mind.[3] The idea behind the commission became the concept for the style of the film. Almodóvar explains:\" I came up with the story of a girl who drives both men and women wild, a girl who sings, drinks, takes drugs, occasionally goes through periods of abstinence and has the extraordinary experiences one would never have were one live a hundred years[3]...while writing I had in mind Marlene Dietrich’s work with Josef von Sternberg, especially Blonde Venus (1932), where she plays a house wife who becomes a singer, spy and prostitute, who travels the world living a life of never ending adventure\".[4] This was the film Almodóvar intended to make, but Cristina Sánchez Pascual had limited acting skills, because of this, Almodóvar rewrote the film giving a more prominent role to the nuns of the convent where the singer hides.","produced_by":"Luis Calvo","starring":"Cristina Sánchez Pascual Julieta Serrano Marisa Paredes Carmen Maura Chus Lampreave","running_time":"114 Min","edited_by":"José Salcedo","written_by":"Pedro Almodóvar"}