{"directed_by":"Charles Sturridge","country":"United Kingdom","distributed_by":"BBC","release_dates":"12 September 1993 (1993-09-12)[1][2]|||||","Plot":"Cyril (McKern) and Waldo (Randolph), who are British and American, respectively, have both returned to France in search of the same woman (Moreau) with whom they each had a rendezvous in 1944 (unknown to the other). Cyril is accompanied by fellow veteran Amos (Guinness), while Waldo has his petty daughter Beverly (Chaplin) and her henpecked husband (Herrmann) in tow. Amos is childlike and carries an empty jam jar as if it is a favored toy. The two groups encounter one another, and after some conflict find common ground in old sorrows. Along the way they meet the recently widowed Lisa (Bacall), who has come in search of her brother's grave.[5]Eventually it is revealed that Amos saved Cyril's life during the battle of Normandy in 1944 but sustained a severe head-wound in the process. The wound has left Amos permanently brain-damaged and Cyril has been his carer ever since. Cyril also confides in the others that Amos does not have long left to live and this will be the last chance for the two men to come to Normandy to pay their respects to their close friend Briggs who was killed in action. Waldo has come to France for a similar reason, to visit the grave of a close buddy who was killed on D-Day. The trip helps put Beverly's problems into perspective and gives a new lease of life to her marriage. And it is revealed that Lisa's brother was in fact a German soldier but instead of showing hostility, the veterans instead pay their respects at his grave, in tribute to the bravery of the German forces who took part in the battle. The frame is completed via Amos' jam jar with the final image of the jar holding a handful of wildflowers and placed in front of Briggs' gravestone on Omaha Beach.The film's theme of the universal soldier is nicely tied together with the song that was popular among both the British and Germans, about the girl they leave behind when they go off to fight, \"Lili Marlene.\" What makes this film truly timeless is the concept of survivor guilt, why one solder was killed and the one next to him was left unscathed, at least physically.","Production":"The film was shot entirely around the department of Calvados, in France.","produced_by":"Martyn Auty Richard Broke Steve Lanning","starring":"Alec Guinness Leo McKern Edward Herrmann John Randolph Geraldine Chaplin Lauren Bacall Jeanne Moreau","running_time":"95 min","language":"English","written_by":"Roy Clarke","cinematography":"Richard Greatrex"}