{"Cast":"Meimei - Cut Mini Theo Nino - Surya Saputra Sakti - Tora Sudiro Andien - Aida Nurmala Lita - Rachel Maryam Sayidina Grace - Lili Harahap Fanny - Aurora Yahya Nuri - Wilza Lubis Ical - Nico Siahaan Masseur - Tika Panggabean Psychiatrist - Jajang C. Noer Yayuk Asmara - Ria Irawan Rama - Indra Birowo","country":"Indonesia","distributed_by":"Kalyana Shira Film","Plot":"The story is based in Jakarta in Indonesia. It revolves around three main characters, Memey, Andien and Sakti, who struggle to maintain their facade of perfection in front of their arisan friends. An arisan is a meeting fraternity of upscale female socialites in Jakarta who meet regularly to share gossip and draw lots to see who takes home the money they all contribute.The main character is Meimei (Cut Mini Theo), an interior designer with a business of her own. Her husband has left her for an actress, and also finds out that she cannot get pregnant. When she finally finds a new love interest, Nino (Surya Saputra), it turns out that Nino is more interested in her best friend, Sakti (Tora Sudiro). While another friend Andien (Aida Nurmala), is a betrayed wife.Sakti is the gay character who, at the start, is in denial of his homosexual identity, and afraid of what his family and friends will think of him. Then he enters a relationship with another man (Nino), and must learn to face new challenges. The relationship between the two was complicated, but they're trying to keep it strong.","language":"Indonesian","Trivia":"Arisan is a common term for a monthly social gathering between friends and relatives who chip in money to be won in turns through a lucky draw. From villagers in far-flung areas to urban professionals in big cities, arisan - initially born as a type of support network for ethnic Chinese merchants - is hugely popular among Indonesia's 210 million people, especially housewives. But some arisan in Jakarta have grown into an exhibit of wealth featuring a who's who of high society.[1]","directed_by":"Nia Dinata","release_dates":"10 December 2003","produced_by":"Nia Dinata","starring":"Cut Mini Theo Tora Sudiro Surya Saputra Aida Nurmala","running_time":"129 minutes","arisan!":"Arisan! film poster","written_by":"Joko Anwar Nia Di Nata","budget":"~ 2,000,000,000 rupiah"}