{"country":"United States","distributed_by":"Universal-International","bedtime_for_bonzo":"Original 1951 film poster","In popular culture":"The film was later referenced in connection with Reagan in the 1986 Ramones song \"My Brain Is Hanging Upside Down (Bonzo Goes to Bitburg)\", in the Dead Kennedys' 1986 song \"Rambozo the Clown\", and in a track on a 1984 Jerry Harrison record, sampling Reagan and credited to \"Bonzo Goes to Washington\". A song unflattering to Reagan entitled \"Bad Time for Bonzo\" is featured on The Damned's fourth studio album, Strawberries. It was also referenced in a Calvin and Hobbes comic strip,[5] Bloom County comic strip (October 11, 1981), as well as in the Strontium Dog comic story \"Bitch\", published in 2000 AD, which featured President Ronald Reagan being kidnapped out of his own era and taken into the far flung future setting of the comic. Other notable references include the 1966 Stan Freberg comedy album Freberg Underground, and the 1986 video of the British band Genesis's song \"Land of Confusion\". In the 1980s satirical British TV show Spitting Image, Reagan was shown as having appointed a dead taxidermied Bonzo as vice president.The movie is referenced in the MMORPG video game DC Universe Online. Following the two-player duo \"Gorilla Grodd's Lab\", the Flash quips at Gorilla Grodd \"It's bedtime for Bonzo\".A rap song released by Nickelodeon for the 2004 presidential elections had a line mention that Reagan \"acted with a chimp when he was a movie star\".[6]","language":"English","box_office":"$1,225,000 (US rentals)[1]","cinematography":"Carl E. Guthrie","directed_by":"Fred de Cordova","release_dates":"April 5, 1951","produced_by":"Michael Kraike","starring":"Ronald Reagan Diana Lynn Walter Slezak Jesse White Ann Tyrrell Brad Johnson Peggy as \"Bonzo\" Lucille Barkley","running_time":"83 min","music_by":"Frank Skinner","edited_by":"Ted Kent","written_by":"screenplay by Lou Breslow & Val Burton story by Ted Berkman & Raphael Blau"}