{"country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Don Jakoby Wesley Strick","story_by":"Don Jakoby Al Williams","arachnophobia":"Theatrical release poster by John Alvin","Plot":"Entomologist James Atherton (Julian Sands) searches the Amazon rainforest with the hope of discovering new species of insects and arachnids. Descending into an enormous sinkhole, his team sets up collectors on the ground below a large tree, then blow smoke up into the canopy of the tree. A large number of bugs fall into the collector, including a very aggressive new species of spider. The spider is captured and chloroformed for research; and is later revealed to be lacking sex organs, thus making it a drone, or soldier, highly unusual in an arachnid species. A nature photographer, Jerry Manley (Mark L. Taylor), who has been suffering a fever while traveling with the team, unknowingly has a fertile (non-drone) male spider of the same species jump into his backpack, that night sneaking into his sleeping bag and biting him. Manley has a massive seizure from the venom and dies. The remainder of the scientists takes his body back to the United States, blaming Manley's death on the preexisting fever. The spider crawls into the box and is sealed in with the corpse.Manley's body arrives at the funeral home in his small town of Canaima, California, and mortician Irv Kendall (Roy Brocksmith) does not notice the spider inside the coffin when he opens it. The spider makes it outside and is picked up by a crow, but before the crow gets back to its nest, the crow is bitten by the spider and it falls dead to the ground in front of the barn of the Jennings family. Ross Jennings (Jeff Daniels) is a family physician who had moved to the town from San Francisco and who faces a lack of patients due to elderly rival Sam Metcalf (Henry Jones), who was supposed to retire and shift his patients to Ross, but decided to maintain his practice.The Amazonian spider mates with a female domestic house spider and makes a nest in Jennings' barn, producing hundreds of infertile drone offspring, all of which have their father's lethal bite. Ross, along with his son Tommy, has arachnophobia, making them targets of ridicule to wife Molly (Harley Jane Kozak) and daughter Shelly (Marlene Katz).Ross' first patient, Margaret Hollins (Mary Carver), dies after being bitten. The town's residents believe that she died from a heart attack, despite Ross' suspicions that something else was at work since her body appeared to have had a seizure instead. After a spider also kills a football player, a death that is attributed to a football injury, Ross is known to the town as \"Dr. Death\", having all his patients dying after having seen him. When Doc Metcalf is bitten and dies, Ross suspects that deadly arachnids could be infesting the town.Ross and county coroner Milton Briggs (James Handy) perform an autopsy on the victims and confirm Ross' suspicion that the deaths were caused by spider bites. Atherton arrives in town with his assistant Chris Collins (Brian McNamara), joining Briggs, Sheriff Lloyd Parsons (Stuart Pankin) and exterminator Delbert McClintock (John Goodman) in the spider investigation. They discover that the killer spiders have a short life expectancy due to being a mixed breed. Atherton tells them that the spiders are soldiers, sent out to eliminate potential threats for the general male spider. He also learns that the general spider produced a queen, which it likely mated with to produce a second nest someplace, guarded by the queen, which could produce fertile offspring. Atherton elaborates that, unlike the sinkhole of the spider's original habitat, which limited its territory, the transplanted spiders can progressively expand their territory, possibly culminating in their worldwide dispersal. The group sets out to destroy both nests and kill the queen and general, but Atherton plans to capture the general alive for his agenda after discovering where the first nest is located. Atherton plucks at the web to lure the general out, but gets caught by surprise as the general leaps from its hiding place and fatally bites Atherton.Ross, Chris, and Delbert eventually discover that the nest is in Ross's barn, and Ross sends Delbert to destroy it, where the exterminator finds Atherton dead before destroying the nest. Chris gets the Jennings family out of their infested house, but Ross falls through the floor into his wine cellar, which turns out to be the spiders' second nest, containing fertile offspring. After electrocuting the queen, Ross battles the general while also attempting to burn the second egg sac. He becomes trapped underneath fallen debris, with the general about to deliver the killing strike when Ross flings the general into the fire.As the egg sac hatches, the general jumps out of the fire. Ross shoots it with a nail gun and the projectile sends the burning spider into the egg sac, destroying the nest with fire and ending the plague.Having enough of the countryside along with the near-death experience, the Jennings family immediately moves back to San Francisco, appreciating city life once more, despite minor earthquakes disrupting them.","language":"English","Release and reception":"Arachnophobia was the first film released by Hollywood Pictures.[2] Advertisers were uncertain as to whether they should market the film as a thriller or a comedy. Therefore, television spots promoting the film billed it as a \"thrill-omedy\".[7]Arachnophobia debuted at #3 behind Ghost and Die Hard 2 with $8 million in its first weekend. The film was a financial success,[8] grossing $53,208,180 domestically[9] and going on to gross an additional $30,000,000 in video rentals. This allowed Spielberg to be the fourth wealthiest entertainer of the year, having previously been the second wealthiest.[8]In his book, critic Leonard Maltin calls the film a \"slick comic thriller\" and approves of the acting, warning, \"Not recommended for anyone who's ever covered their eyes during a movie.\"[1] Newsweek associated the film with B movies \"about the small town threatened by alien invaders\", and said it was well made but \"oddly unresonant.\"[10] Roger Ebert said it made audiences \"squirm out of enjoyment, not terror\", and listed details in the film that he felt were typical of such films, including \"the bright young doctor, whose warnings are ignored\" and \"the loyal wife and kids\", as well as \"the usual cats and dogs, necessary for the obligatory scene in which they can sense something even when the humans can't.\" He gave the film three stars.[11]On the review website Rotten Tomatoes, 91% of critics gave the film positive reviews, based on 35 reviews, and an average rating of 6.8/10,[12] with the consensus \"Arachnophobia may not deliver genuine chills, but it's an affectionate, solidly built tribute to Hollywood's classic creature features.\"The film drew protests from some people interested in spiders, as they believed the film tarnished the public image of spiders.[13]The film won a Saturn Award from The American Academy of Science Fiction, Fantasy & Horror Films for Best Horror Film and Best Actor (Jeff Daniels). Young actress Marlene Katz was nominated for a best actress award from the Young Artist Awards.The film was first released on VHS in 1991. It was then released as a bare bones DVD in 1999. The film was released on Blu-ray on September 25, 2012.VHS and DVD releases by Hollywood/Buena Vista Home Video curiously omit the original poster art's spider from their cover design, however the Blu-ray now reinstates it.","Merchandising":"A soundtrack album for the film, also called Arachnophobia, was released in 1990. It included Trevor Jones's instrumental music from the film as well as dialogue excerpts and songs such as \"Blue Eyes Are Sensitive to the Light\" by Sara Hickman, \"Caught in Your Web (Swear to Your Heart)\" by Russell Hitchcock, and \"I Left My Heart in San Francisco\" by Tony Bennett. The European version of the album has the same cover art, but more score tracks, fewer songs and no dialogue. The two versions share 10 of the same tracks, but these are also not without their differences: several tracks are noticeably shorter on the European version like \"Canaima Nightmare\", which is nearly three minutes shorter; and another track has two different titles (\"Cellar Theme\" in America and \"The Cellar\" in Europe).US release:European release:Songs in the film that were not included on the soundtrack are:Unusually, the video game version of Arachnophobia was also released in 1991, for Amiga, Amstrad CPC, Commodore 64 and DOS.[14]There is also a novelization of Arachnophobia written by author Nicholas Edwards.[15]","box_office":"$53.2 million","cinematography":"Mikael Salomon","production_company":"Hollywood Pictures Amblin Entertainment","directed_by":"Frank Marshall","release_dates":"July 18, 1990 (1990-07-18)|||||","Production":"Filmmaker Steven Spielberg was involved with Arachnophobia, with one of his earlier producers Frank Marshall directing for the first time. Spielberg and Marshall are both the executive producers of the film.[1] Amblin Entertainment also helped produce it.[2]Marshall meant for the film to be like Alfred Hitchcock's The Birds, and added, \"People like to be scared but laughing, like a roller coaster. No one wants to be terrified.\"[3] The film also has similarities with the 1977 film Kingdom of the Spiders.[4]Jamie Hyneman, of MythBusters fame, stated in Popular Mechanics[5] that Arachnophobia was one of the first movies he worked on and that he often relied on simple magnets for several of the effects.The film made use of 374 Avondale spiders, from New Zealand, which were picked for their large size, unusually social lifestyle, and because they are essentially harmless to humans. They were guided around the set by the use of heat and cold, but the large \"general\" and \"queen\" were articulated models.The movie was actually filmed in Southern Venezuela for the intro sequence and the jungle scenes, as well as Cambria, California. All the school scenes were filmed at Coast Union High School. Students and staff were used in the football scenes and group events. The locker room and players were the actual students and players from CUHS.To create the sound effects of spiders being stepped on or squished, Foley artists stepped on mustard packs or squashed potato chips.[6]","produced_by":"Kathleen Kennedy Richard Vane","starring":"Jeff Daniels|Julian Sands|Harley Jane Kozak|John Goodman|","running_time":"110 minutes","music_by":"Trevor Jones","edited_by":"Michael Kahn","budget":"$31 million"}