{"country":"United States","distributed_by":"United Artists","across_110th_street":"Theatrical poster","Plot":"This film is set in Harlem, of which 110th Street is an informal boundary line. By-the-book African-American Lieutenant William Pope (Kotto) has to work with crude, racist but streetwise Italian-American Captain Frank Mattelli (Quinn) in the NYPD's 27th precinct. They are looking for three black men who slaughtered seven men—three black gangsters and two Italian gangsters, as well as two patrol officers—in the robbery of $300,000 from a Mafia-owned Harlem policy bank. Mafia lieutenant Nick D'Salvio (Franciosa) and his two henchmen are also after the hoods. In one of many violent scenes, D'Salvio finds getaway driver Henry J. Jackson (Antonio Fargas) and brutalizes him in a Harlem whorehouse.","language":"English","box_office":"$10,000,000[1]","directed_by":"Barry Shear","Soundtrack":"The critically praised title song, written by Bobby Womack and J.J. Johnson, was a No. 19 hit on the Billboard Hot Black Singles chart in 1973, and was later featured in Quentin Tarantino's 1997 blaxploitation homage Jackie Brown. It is also heard in Ridley Scott's 2007 film American Gangster,[4] and as a background song for the video game True Crime: New York City. The title song was also used as the theme song to the television show 'Michigan Replay.'[5] All songs were written and performed by Bobby Womack; the score was composed and conducted by J.J. Johnson","release_dates":"December 19, 1972 (1972-12-19)|||||","Production":"The movie was filmed on location in Harlem, New York. The film is also notable as being the first feature film to use a self-blimped camera (the Arriflex 35BL) for sync sound; the much-reduced size of the camera allowed the production to not only use more hand-held shots and smaller locations than normal, but also record usable sound at the same time - an endeavor not previously possible under those circumstances.","produced_by":"Anthony Quinn Fouad Said Barry Shear","starring":"Anthony Quinn Yaphet Kotto Anthony Franciosa","running_time":"102 minutes","music_by":"Bobby Womack J. J. Johnson","Release":"The film earned an estimated $3.4 million in North American rentals in 1973.[3]","written_by":"Novel: Wally Ferris Screenplay: Luther Davis"}