{"based_on":"Unlikely Angel  by Ashley Smith","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Brian Bird","Plot":"On March 11, 2005, Brian Nichols (David Oyelowo) escapes from the Fulton County courthouse in Atlanta, during his trial involving a rape case. In the process of the escape he murders the judge presiding over his trial, Rowland Barnes, as well as court reporter Julie Brandau. He also shoots Sergeant Hoyt Teasley while escaping from the courthouse, and then later kills ICE Special Agent David G. Wilhelm, who was off-duty at his home. Nichols becomes the subject of a citywide manhunt. His frantic escape brings him to the apartment of Ashley Smith (Kate Mara), a single mother and recovering methamphetamine addict, whom he holds hostage. Smith gets through this time inspired by Rick Warren's best-selling book The Purpose Driven Life, while Nichols searches for redemption. As she reads aloud, Smith and her would-be killer come to a crossroads.","language":"English","Reception":"Captive has received generally negative reviews from critics, although praise was given towards the lead actors' chemistry. On Rotten Tomatoes, the film holds a rating of 26%, based on 47 reviews, with an average rating of 4.4/10. The site's consensus reads, \"Captive undermines committed performances from Kate Mara and David Oyelowo – and the real-life story they're dramatizing – with a thin script doubling as an ad for a self-help book.\"[9] On Metacritic the film has a score of 37 out of 100, based on 19 critics, indicating \"generally unfavorable reviews\".[10]","box_office":"$2.8 million[3]","cinematography":"Luis David Sansans","directed_by":"Jerry Jameson","production_companies":"BN Films Brightside Entertainment 1019 Entertainment Yoruba Saxon Productions Itaca Films","release_dates":"September 18, 2015 (2015-09-18) (United States)|||||","Production":"On October 15, 2013, David Oyelowo and Kate Mara joined the thriller Captive based on the true story of Brian Nichols, who escapes from the courthouse in Atlanta on March 11, 2005, murdering the judge, a court reporter, and a sheriff's deputy.[4] Later, he takes Ashley Smith hostage at her own house.[4] BN Films set Jerry Jameson to direct the film, which was adapted by Brian Bird and Reinhard Denke, based on the Smith's non-fiction Unlikely Angel.[4] Alex Garcia, Lucas Akoskin, Terry Botwick, Oyelowo and Ken Wales would be producing the film through Brightside Entertainment, 1019 Entertainment and Yoruba Saxon Productions.[4] Oyelowo was set to play Nichols, Mara to play Smith, while Leonor Varela and Mimi Rogers were also in the cast.[4] Michael K. Williams joined the film's cast on October 24, 2013 to play Detective John Chestnut.[5] Jessica Oyelowo's involvement was confirmed on March 16, 2015, along with Jameson and Katrina Wolfe as producers.[6]Principal photography on the film began in October 2013 in North Carolina.[7]","captive":"Theatrical release poster","produced_by":"Lucas Akoskin|Terry Botwick|Alex Garcia|David Oyelowo|Ken Wales|Katrina Wolfe|","starring":"David Oyelowo|Kate Mara|Leonor Varela|Jessica Oyelowo|Mimi Rogers|Michael K. Williams|","running_time":"97 minutes[1]","music_by":"Lorne Balfe","edited_by":"Melissa Kent","Release":"On March 16, 2015, Paramount Pictures acquired the worldwide distribution rights to the film and set the film for a September 18, 2015 release date.[6] On June 16, 2015, the first trailer for the film was released.[8]","budget":"$2 million[2]"}