{"country":"United States","american_gigolo":"Theatrical release poster","distributed_by":"Paramount Pictures","Plot":"Julian Kaye (Richard Gere) is a male escort in Los Angeles whose job supports his expensive taste in cars and clothes, and his plush Westwood apartment. He is blatantly materialistic, narcissistic and superficial; however, he claims to take some pleasure in his work from being able to sexually satisfy women.Julian's procuress, Anne (Nina Van Pallandt), sends him on an assignment with a wealthy old widow, Mrs. Dobrun (Carole Cook), who is visiting town. Afterwards, he goes to the hotel bar and meets Michelle Stratton (Lauren Hutton), the beautiful but unhappy wife of a senator, who becomes interested in him. Meanwhile, Julian's other pimp, Leon (Bill Duke), sends him to Palm Springs on an assignment to the house of Mr. Rheiman (Tom Stewart), a wealthy financier. Rheiman asks Julian to have rough, sado-masochistic sex with his wife Judy (Patricia Carr) while he watches them. The next day, Julian berates Leon for sending him to a \"rough trick\" and makes it clear he doesn't do kinky or gay assignments.As Julian begins to get to know Michelle, he learns that Judy Rheiman has been murdered. Los Angeles Police Department Detective Sunday (Hector Elizondo) investigates Julian as a primary suspect. Though he was with another client, Lisa Williams (K Callan), on the night of the murder, she refuses to give Julian an alibi in order to protect her and her husband's reputations.As Julian's relationship with Michelle deepens, evidence connecting him with the murder mounts. He soon realizes that he is being framed (finding jewels from the Rheiman house planted in his car) and grows increasingly desperate. His mounting anguish is visually represented by a degeneration in style; his clothes become dirty and rumpled, he goes unshaven, and he goes incognito in a cheap rental car, after discovering that someone is hiring people to follow him.Julian finally concludes that Leon and Rheiman himself are the ones trying to frame him, and that one of Leon's other gigolos is the real murderer. He goes to confront Leon, telling him he knows everything, but Leon refuses to help him. Julian pleads with Leon to clear his name, even offering to work exclusively for him and do kink and gay assignments, but Leon remains implacable. During a brief scuffle, Julian accidentally pushes Leon over the apartment balcony and he falls to his death.With no one to help him, Julian ends up in jail, awaiting trial for the Rheiman murder. However, when all seems lost, Michelle risks her reputation and her marriage to provide Julian with the alibi that can save him from prison.","language":"English","Reception":"The film received mixed to positive reviews from critics, as the film holds a 67% rating on Rotten Tomatoes based on 21 reviews.","box_office":"$22,743,674[1] (domestic)","TV Show":"In October 2014, Jerry Bruckheimer announced plans to adapt the movie into a television series.[20] However, the series has yet to go into production.","cinematography":"John Bailey","directed_by":"Paul Schrader","Soundtrack":"The film's soundtrack was composed by Giorgio Moroder. The main theme song of the film is \"Call Me\" performed by Blondie. The song was written by Moroder and Blondie vocalist Debbie Harry, and became a huge worldwide hit in 1980. It peaked at number one in various countries including the US and the UK, and became the highest selling single of 1980 in the United States.","release_dates":"February 8, 1980","Production":"Christopher Reeve reportedly turned down the part of Julian Kaye despite being offered a million-dollar fee,[3] before Richard Gere became attached to the role. Gere said in 2012 that he was drawn to the role because of its gay subtext. \"I read it and I thought, 'This is a character I don't know very well. I don't own a suit. He speaks languages; I don't speak any languages. There's kind of a gay thing that's flirting through it and I didn't know the gay community at all.' I wanted to immerse myself in all of that and I had literally two weeks. So I just dove in.\"[4]John Travolta became interested in the part and briefly acted in it before getting \"cold feet\" and being replaced by Gere.[5][6] This is not the only role that Travolta has turned down only to be taken by Gere: it had previously happened with Days of Heaven (1978)[7] and occurred again when Travolta was offered the lead in both An Officer and a Gentleman (1982) and Chicago (2002).[8] Gere's very brief nude scenes marked the first time a major Hollywood actor was frontally nude in a film.[9][10] According to Gere, the nudity was not in the original script. \"It was just in the natural process of making the movie. I certainly felt vulnerable, but I think it's different for men than women.\"[4]Julie Christie was originally cast in the role of Michelle Stratton but her departure was precipitated by Gere's replacement of Travolta.[6] By the time Gere had returned to the project, Lauren Hutton had already been hired. Meryl Streep was also offered the part of Michelle but declined because she didn't like the tone of the film.[11]Schrader acknowledges that Pickpocket (1959) by the French director Robert Bresson was a direct influence on the film;[12][13] the composition of the final shot draws heavily from the film,[14][15] as does the final dialogue.[16] Schrader later provided an introduction to the Criterion Collection DVD of Pickpocket. Schrader re-visited many of the themes of American Gigolo in his 2007 film, The Walker,[17] and says the idea for that film came about while wondering what would have become of the Julian Kaye character.[18]The film is widely credited to have established Giorgio Armani in Hollywood, since the Italian designer's clothes are featured prominently in Julian Kaye's wardrobe. When John Travolta agreed to star in the film, Armani provided him with many outfits to wear as Julian Kay. When Travolta walked off the project, Schrader hired Richard Gere; Travolta was a svelte six-footer, whereas Gere was much shorter and more muscular, so Armani's wardrobe did not fit Gere. The designer's team had to make new clothing for the smaller actor.[19]","produced_by":"Jerry Bruckheimer","starring":"Richard Gere|Lauren Hutton|Hector Elizondo|Nina Van Pallandt|Bill Duke|","running_time":"117 minutes","music_by":"Giorgio Moroder","edited_by":"Richard Halsey","written_by":"Paul Schrader","budget":"$4,800,000[citation needed]"}