{"country":"United States","distributed_by":"20th Century Fox","behind_enemy_lines":"Theatrical release poster","screenplay_by":"David Veloz Zak Penn","story_by":"Jim Thomas John Thomas","Plot":"In the final stages of the Bosnian War in December 1995, United States Navy flight officer Lieutenant Chris Burnett and pilot Lieutenant Jeremy Stackhouse, who are stationed on an aircraft carrier in the Adriatic Sea, are assigned a reconnaissance mission by their commanding officer, Admiral Reigart. The mission goes smoothly until they spot suspicious activity in the demilitarized zone where NATO aircraft and the warring factions are prohibited from engaging in military activity. Burnett persuades Stackhouse to fly their F/A-18 Hornet off-course to get a close look and photograph the target. They are unaware that they photographed mass graves, and Serb soldiers see the jet. The local Bosnian Serb paramilitary commander, General Miroslav Lokar, is conducting a secret genocidal campaign against the local Bosniak population. Not wanting the mass graves to be discovered, Lokar orders the jet be shot down.Despite trying to outmaneuver the missiles fired at them, their jet is hit and both men are forced to eject. Shortly after touching ground, a Serb patrol finds an injured Stackhouse and interrogate him. Stackhouse is then executed by Sasha, one of Lokar's right-hand men. Burnett, who was observing the Serbs' interrogation of Stackhouse from a hill, flees the area, but exposes his location. Wanting Burnett dead as well, Lokar orders both his deputy, Colonel Bazda, and Sasha to find him. After Burnett contacts Admiral Reigart for help, he orders Burnett to move to a certain location in order to be extracted. However, Reigart is forced to stand down after Admiral Piquet, the commander of NATO naval forces in the region, warns him that rescuing Burnett in the demilitarized zone risks derailing the peace process. When Burnett reaches the extraction point, Reigart informs him that he must move to another location miles outside of the demilitarized zone in order to be rescued.Immediately after being informed, Burnett sees a Serb patrol, led by Bazda, looking for him. Running from them, he falls into the mass grave that he and Stackhouse had photographed and hides under a dead body. When the patrol is out of sight, he continues to run. On his way to the new extraction point, Burnett encounters a group of Bosniak guerrillas in a pickup truck who offer him a ride. The guerrillas inform Burnett that they are heading to Hač, which is supposedly a safe haven but turns out to be a war zone. During the battle, Serb troops believe that they have found Burnett's body, but Sasha realizes that Burnett had switched uniforms with a dead Serb soldier and escaped Hač.The Serbs turn the situation to their advantage, presenting the corpse wearing Burnett's uniform to the media, and saying he was killed by guerrillas. The ruse works and a mission to rescue Burnett is aborted. However, Burnett notices an angel statue near where his ejection seat landed. He returns to his seat and activates the rescue beacon. Though the carrier group notices his signal and positively identifies him, Burnett has also alerted the Serbs to his location.Knowing he risks being relieved of command, Reigart prepares a task force to rescue Burnett in open defiance of Piquet's orders. Meanwhile, Bazda and Sasha are ordered by Lokar to find Burnett and kill him, but on their way, Bazda steps on a landmine and Sasha abandons him to his fate. The mine eventually explodes, alerting Burnett that someone is following him. After Sasha finds the ejection seat, Burnett ambushes him and the two men engage in hand-to-hand combat until Burnett stabs Sasha. Immediately after Sasha is killed, Lokar arrives with armored vehicles and infantry who open fire on Burnett. After retrieving the hard drive containing the photos of the mass graves, Burnett escapes with the task force.The conclusion reveals that the footage Burnett retrieved leads to the arrest and conviction of Lokar for war crimes including genocide, while Reigart's actions result in him being relieved of command and his eventual retirement. Burnett continues his career in the Navy.","language":"English","Reception":"The film made $18.7 million in its opening week in the U.S., landing at the #2 spot and was held off the top spot by Harry Potter and the Sorcerer's Stone. Behind Enemy Lines eventually grossed $92 million worldwide, of which $59 million was from North America. The budget was estimated to be $40 million.[1]Behind Enemy Lines received generally negative reviews from critics. Review aggregator website Rotten Tomatoes gives the film a score of 37% based on reviews from 130 critics, with a weighted average of 4.8/10 and the site's consensus stating \"The plot for Behind Enemy Lines is more jingoistic than credible, and the overload of flashy visual tricks makes the action sequences resemble a video game.\"[6] Metacritic has assigned the film an average score of 49 out of 100 based on 29 reviews from mainstream critics, indicating \"mixed or average reviews.\"[7]Roger Ebert gave the film 1½ stars out of four, likening it to a comedy: \"Its hero is so reckless and its villains so incompetent that it's a showdown between a man begging to be shot, and an enemy that can't hit the side of a Bosnian barn.\"[8]","box_office":"$92 million[1]","cinematography":"Brendan Galvin","production_company":"Davis Entertainment","Historical inspiration":"At the beginning of the film, the \"Cincinnati Accords\" ended the war in Bosnia. This fictional treaty is loosely based on the Dayton Agreement that actually ended the war in Bosnia in late 1995. The 'Cincinnati Accords' in the film require NATO forces to withdraw from Bosnia, while the actual Dayton Agreement allowed a large NATO-led \"Implementation Force\" (IFOR) to be sent to Bosnia to ensure the peace deal.The film bears some resemblance to the experiences of former U.S. Air Force Captain Scott O'Grady, who was shot down over Bosnia on June 2, 1995. He managed to survive for six days before being rescued by U.S. Marines. He filed suit against the film's producers for defamation of character (the film's pilot \"disobeys orders and swears\"),[4] as well as making a film about his ordeal without his permission.[2] The film's characters and events differ from O'Grady's experience; he never entered populated areas, nor did he interact with civilians, and did not engage in direct combat with enemy soldiers. Also, O'Grady never flew an F/A-18F but rather an F-16 Fighting Falcon.[2] The case was settled out of court.[5]","directed_by":"John Moore","release_dates":"November 30, 2001 (2001-11-30)|||||","Production":"Filming was done in Slovakia, not in Bosnia and Herzegovina. None of the actors playing Serbians were actually Serbian; the producers said that they hired Croats as interns and instructors to instruct the actors in Serbian language, because they couldn't find any Serbs willing to work on the film, due to perceived anti-Serb sentiment shown in the film. Vladimir Mashkov, the actor who played the Serbian sniper, Sasha, is Russian and Olek Krupa, the actor who played the Serbian General, Miroslav Lokar, is Polish. Some Slovaks also participated in the film, such as Marko Igonda, who plays Colonel Bazda, and Kamil Kollarik, who plays a guerrilla who aids Burnett in Hač. The city of Hač is not an actual city in Bosnia and Herzegovina. The scene showing Hač on a map is actually the location of the city of Vlasenica. The statue in the film was a 46' tall replica. It was placed on the hillside by helicopter.The USS Carl Vinson (CVN-70) was the aircraft carrier featured in the film. Exterior naval footage was filmed on board the carrier. Interiors were filmed on the Carl Vinson, on the USS Constellation (CV-64), and on a film set.[3]The main aircraft involved is the twin-seat version of the US Navy Boeing F/A-18F Super Hornet. This aircraft did not enter service until 1999, but it is visually very similar to its 1983 predecessor, the McDonnell Douglas F/A-18 Hornet, which was used in Operation Deny Flight over Bosnia during 1993-5.The SAM missile system shown in the film is the 9K35 Strela-10 (NATO codename SA13 'Gopher'), firing the 9M37M missile. This uses electro-optical guidance, laser proximity fusing and a triple channel guidance system. However, its range is only 5km and it can only intercept up to 3,500 metres (10,600 feet). Its tracked launcher and other vehicles shown in the forest carry crudely painted markings reading 'добровољачка гарда' ('Dobrovoljačka Garda': \"Volunteer Guard\"), and showing a version of the Serb Volunteer Guard badges used by Arkan's 'Tigers'.The rescue helicopters include a Russian Mil Mi-8 in French markings, (similar to the Aérospatiale SA 330 Puma), and at the end a group of Bell UH-1N Twin Huey US Marine helicopters.","produced_by":"John Davis","starring":"Owen Wilson Gene Hackman Joaquim de Almeida David Keith Olek Krupa Gabriel Macht","running_time":"106 minutes","Sequels":"Behind Enemy Lines was followed by three direct-to-video sequels, none of which feature the cast and crew of the original, nor follow its plot. Behind Enemy Lines II: Axis of Evil was released in 2006, Behind Enemy Lines: Colombia was released in 2009 (this film was co-produced by WWE Studios) and SEAL Team 8: Behind Enemy Lines was released in 2014.","music_by":"Don Davis","edited_by":"Ayre","budget":"$40 million[1]"}