{"country":"United Kingdom United States","distributed_by":"MGM/UA Communications Co. (US)|United International Pictures (UK)|","screenplay_by":"John Cleese","story_by":"John Cleese|Charles Crichton|","Plot":"London-based gangster George Thomason and his right-hand man, Ken Pile, an animal lover with a bad stutter, plan a jewel heist. They bring in two Americans to help: con artist Wanda Gershwitz and \"weapons man\" Otto West, a loud-mouthed Anglophobe who fancies himself an intellectual and hates being (correctly) called stupid. Wanda and Otto are lovers, but they hide this from George and Ken, pretending to be brother and sister, so Wanda can work her charms on them. The robbery goes well, and the thieves get away with a large sum in diamonds. However, they are briefly spotted during their getaway by Mrs. Coady, an elderly lady walking her three dogs. The group then hide the loot in a safe in an old workshop. Soon after, Wanda and Otto betray George to the police and he is arrested. They return to collect the loot, with Wanda planning to double-cross Otto as well, only to find that George has moved it. Wanda decides to seduce George's barrister, Archie Leach, so that he can persuade George to plead guilty and give up the location of the diamonds. Unhappily married, Leach is brow-beaten by his vindictive wife, Wendy, and spoiled daughter, Portia, and he quickly comes under the spell of Wanda's charms.Otto is insanely jealous, and his interference, combined with instances of bad luck, causes Wanda and Archie's attempted liaisons at his friend's flat to go disastrously wrong. Wanda reveals that she likes Archie but would stay only with a rich man. Archie eventually calls off their attempted affair when a family walk into the flat, having agreed a new tenancy without his knowledge. Meanwhile, George gives Ken the task of killing Mrs. Coady, the Crown's only eyewitness. During his various attempts to murder her, Ken accidentally kills off her three Yorkshire Terriers one by one. This causes him great grief, as well as suffering bodily harm as each attempt goes wrong. When he kills the last of her dogs, Mrs. Coady suffers a fatal heart attack, and finally Ken is successful in his mission. Wanda and Otto want George to remain in jail; but, with no witness, he now seems set to get off. At his trial, defence witness Wanda gives evidence that will lead to a conviction rather than an acquittal. Archie, stunned by her unexpected testimony, flubs his cross-examination and inadvertently calls her \"darling.\" Enraged, George starts a brawl that leads to everyone fleeing the courtroom. Archie is confronted by Wendy, who is now convinced he has had an (unconsummated) affair and decides to divorce him.With his career and his marriage in ruins, Archie resolves to cut his losses, steal the loot himself, and flee to South America. Promised less jail time, George tells Archie that Ken knows where the diamonds are. Archie sees Wanda fleeing the courthouse, pulls her into his car, and races to Ken's apartment. They review what has happened, and he asks why he should take her to South America with him. She counters that she has the key to the safe deposit box where the loot has been moved. While the court drama is unfolding, Otto has been trying to get Ken to reveal the location of the diamonds. He torments Ken by eating the fish in his aquarium one by one, leaving the fish called Wanda until the end. Ken gives away the location of the diamonds, at a hotel near Heathrow Airport. Otto is leaving just as Archie runs into the building. Otto steals Archie's car, taking Wanda with him. Ken tells Archie, as quickly as he can – given his stutter – where they are going, and the two give chase. The protagonists all end up at Heathrow. Otto and Wanda recover the diamonds, but Wanda quickly double-crosses Otto and leaves him unconscious in a locked cupboard.Otto shoots his way out of the cupboard and is briefly captured by Archie, only to turn the tables. As Otto is about to kill his love-rival, Archie manages to stall by taunting Otto about his nation's failures, such as the Vietnam War. Before Otto can shoot, he is distracted by the arrival of Ken driving a steamroller, seeking vengeance for the demise of his fish. Otto accidentally stands in wet cement (which has partially dried) and is soon run over after he runs out of bullets. Archie joins Wanda on board the plane, which taxis for takeoff. Through the plane window, Otto, who has survived the steamroller attack, curses them until he is blown off as the plane takes off.A closing text explains what happens to the gang members after the events of the movie. Archie and Wanda move to Rio de Janeiro, have 17 children, and start a leper colony. Ken, his stutter lost, becomes the Master of Ceremonies at London's Sea World. The immoral Otto moves to South Africa and becomes Minister of Justice (at the time of filming, South Africa was still ruled under apartheid).","Sequels and adaptations":"The principal cast reunited in 1997 for Fierce Creatures (dubbed an \"equal\" rather than a sequel or prequel, by Kline), playing different roles. Fierce Creatures was not as well received by critics or audiences as A Fish Called Wanda was.[19]The novelization of Fierce Creatures, written by Iain Johnstone, who co-wrote the film, begins with a letter from Archie to his brother Rollo (John Cleese's character in the film). According to the letter:In 2008, it was reported that John Cleese and his daughter, Cynthia (who played his screen daughter, Portia), had started to work on a stage musical version of the film.[20]","language":"English","Reception":"On Rotten Tomatoes, the film holds a 93% approval rating, based on 59 reviews, with an average rating of 8/10. The site's critical consensus reads, \"Smartly written, smoothly directed, and solidly cast, A Fish Called Wanda offers a classic example of a brainy comedy with widespread appeal.\"[7] On Metacritic, the film holds a score of 80 out of 100, based on 17 critics, indicating \"generally favorable reviews.\"[8]Kline won an Academy Award for Best Supporting Actor for his performance.[9][10] Cleese and Crichton received an Academy Award nomination for Best Original Screenplay.[9] Crichton was also nominated for Best Director,[9] Cleese won a BAFTA for Best Actor in a Leading Role and Curtis received nominations for Leading Actress at the Golden Globes[11][12] and BAFTA awards.[13] Michael Palin won a BAFTA for Best Supporting Role[14] and Maria Aitken received a BAFTA nomination for Best Supporting Actress[15]In 2000, the American Film Institute ranked the film 21st on AFI's 100 Years...100 Laughs, its list of the 100 funniest movies ever made.[16] The film is number 27 on Bravo's \"100 Funniest Movies\".[17] It is also included in the Reader's Digest \"100 Funniest Films\" list.[18]","box_office":"$62.5 million[1]","cinematography":"Alan Hume","production_company":"Metro-Goldwyn-Mayer Prominent Features","Ole Bentzen":"A Danish audiologist named Ole Bentzen died of laughing whilst watching the famous scene with Kevin Kline and Michael Palin, as Palin's character has chips put into his nose. As he laughed, his heart was believed to have been beating 250–500 times a minute before going into cardiac arrest.[21]","directed_by":"Charles Crichton|John Cleese (uncredited)|","release_dates":"July 15, 1988 (1988-07-15) (US & CAN)|October 14, 1988 (1988-10-14) (UK)||||","Production":"Cleese and Crichton had previously attempted to make a film together back in 1969.[3] Although the project never entered the development stages, Cleese and Crichton promised each other that they would eventually collaborate with each other on a film.[4] In June 1983 Cleese and Crichton began writing the script for Wanda, and for the next two and half years, they met three times a month working on the script.[4] According to Crichton, \"We had a week of rehearsals and then a gap of two weeks in which to incorporate any new ideas which had been thrown up and to polish the script.\"[5]Cleese, despite admitting in press interviews that he had no knowledge of how to direct a film, served as a co-director since the studio executives at MGM were worried about Crichton's age—he was 78 years old at the time.[3][4][6] On the set, Crichton wore a t-shirt presented to him by Cleese and inscribed \"Age and treachery will always overcome youth and skill\".[6]The film was shot in London during the summer of 1987.[4]","a_fish_called_wanda":"US theatrical release poster","produced_by":"Michael Shamberg","starring":"John Cleese|Jamie Lee Curtis|Kevin Kline|Michael Palin|","running_time":"109 minutes","music_by":"John Du Prez","edited_by":"John Jympson"}