{"based_on":"A Christmas Carol by Charles Dickens","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Robert Zemeckis","Plot":"On Christmas Eve in 19th-century London, Ebenezer Scrooge, a miserly old money-lender at a London counting house, does not share the merriment of Christmas. He declines his cheerful nephew Fred's invitation to a Christmas dinner party. His loyal employee Bob Cratchit offers Scrooge to have Christmas Day off, since there will be no business for Scrooge during the day. Scrooge agrees and leaves. In his house, Scrooge encounters the ghost of his deceased business partner Jacob Marley, who warns him to repent his wicked ways or he will condemned in the afterlife, carrying heavy chains forged for his own greedy ways. He informs Scrooge that that three spirits will visit him during the night to guide him.Scrooge is visited by the candle-like Ghost of Christmas Past, who takes him back in time to his early life. They visit Scrooge's boarding school and Scrooge sees his sister Fan, who died after giving birth to Fred. Scrooge later begins a successful career in business and money lending as an employee under Fezziwig, and he becomes engaged to a woman named Belle. However, the Ghost shows Scrooge how Belle left him when he chose his wealth over her. A devastated Scrooge extinguishes the spirit with its candle snuffer cap as he returns to the present.Scrooge meets the merry Ghost of Christmas Present, which shows Scrooge the joys and wonder of Christmas Day. Scrooge and the Ghost visit Bob’s house, learning his family is content with their small dinner, Scrooge taking pity on Bob’s ill son Tiny Tim. The Ghost abruptly ages, commenting that Tiny Tim will likely not survive until next Christmas. Before dying, the spirit warns Scrooge about the evils of \"Ignorance\" and \"Want\", Big Ben begins tolling the hour, as \"Ignorance\" and \"Want\" manifest themselves before Scrooge as two wretched children who grow into violent, insane individuals, leaving the spirit fading into dust as Big Ben finishes its hour toll, in front of Scrooge.The Ghost of Christmas Yet to Come arrives, appearing as a silent, cloaked figure, and takes Scrooge into the future. A group of businessmen discuss the death of an unnamed colleague, but do not mourn him; he discovers that his possessions are stolen and sold by his maid and a young couple who owed Scrooge money are relieved he is dead, as they have more time to pay off their debt. The spirit transports Scrooge to Bob's residence where he learns Tiny Tim had died. The Ghost escorts Scrooge to the cemetery, where the Ghost points out his own grave, revealing Scrooge was the man who died and was unmourned. Scrooge decides to change his ways just as the Ghost forces Scrooge to fall into his empty coffin sitting in a deep grave atop the fires of Hell.Awakening in his bedroom on Christmas Day, Scrooge decides to surprise Bob’s family with a turkey dinner, and ventures out with the charity workers and the citizens of London to spread happiness in the city. The following day, he gives Cratchit a raise and becomes like \"a second father\" to Tiny Tim, who escaped death. A changed man, Scrooge now treats everyone with kindness, generosity, and compassion; he now embodies the spirit of Christmas.","language":"English","Reception":"The film opened at #1 in 3,683 theaters, grossing $30,051,075 its opening weekend, with an average of $8,159 per theater.[3] The film has come to gross an estimated $137,481,366 in the United States and Canada and $181,000,000 in other territories, for a worldwide total of $318,481,366.[4] In the UK, A Christmas Carol topped the box office on two separate occasions; the first was when it opened, the second was 5 weeks later when it leapfrogged box office chart toppers 2012, The Twilight Saga: New Moon and Paranormal Activity despite family competition from Nativity!, another Christmas-themed movie.The film received mixed reviews from American film critics. In his review, Roger Ebert of the Chicago Sun-Times gave the film four stars (out of four), calling it \"an exhilarating visual experience\".[13] Owen Gleiberman of Entertainment Weekly gave the film an A, applauding the film as \"a marvelous and touching yuletide toy of a movie\".[14] Joe Neumaier of the New York Daily News gave the film 3/5 stars and stated the film \"is well-crafted but artless, detailed but lacking soul.\"[15] Mary Elizabeth Williams of Salon.com gave the film a mixed review claiming the movie \"is a triumph of something — but it's certainly not the Christmas spirit.\"[16] Joe Morgenstern of the Wall Street Journal wrote in his review that the film's \"tone is joyless, despite an extended passage of bizarre laughter, several dazzling flights of digital fancy, a succession of striking images and Jim Carrey's voicing of Scrooge plus half a dozen other roles.\"[17] The Daily Telegraph reviewer Tim Robey wrote, \"How much is gained by the half-real visual style for this story is open to question – the early scenes are laborious and never quite alive, and the explosion of jollity at the end lacks the virtue of being funny.\"[18] Peter Bradshaw in The Guardian also criticized the technology: \"The hi-tech sheen is impressive, but in an unexciting way. I wanted to see real human faces convey real human emotions.\"[19] Time Out London praised the film for sticking to Dickens' original dialogue but also questioned the technology by saying, \"To an extent, this 'Christmas Carol' is a case of style – and stylisation – overwhelming substance.\"[20]Review aggregator Rotten Tomatoes reports that 54% of 186 critics have given the film a positive review, with a rating average of 5.9 out of 10. The site's consensus is: \"Robert Zemeckis' 3-D animated take on the Dickens classic tries hard, but its dazzling special effects distract from an array of fine performances from Jim Carrey and Gary Oldman.\"[21] Metacritic, which assigns a normalized rating out of 100 to reviews from film critics, has a rating score of 55 based on 32 reviews.[22]","box_office":"$325.3 million[4]","cinematography":"Robert Presley","production_company":"Walt Disney Pictures ImageMovers Digital","directed_by":"Robert Zemeckis","release_dates":"November 3, 2009 (2009-11-03) (London)|November 6, 2009 (2009-11-06) (United States)||||","Production":"Robert Zemeckis has stated previously that A Christmas Carol is one of his favorite stories dealing with time travel.[9] Carrey has described the film as \"a classical version of A Christmas Carol [...] There are a lot of vocal things, a lot of physical things, I have to do. Not to mention doing the accents properly, the English, Irish accents [...] I want it to fly in the UK. I want it to be good and I want them to go, 'Yeah, that's for real.' We were very true to the book. It's beautiful. It's an incredible film.\"[10] Also, the Scrooge puppet seen in The Polar Express, which was also directed by Robert Zemeckis served as the basis for Ebeneezer Scrooge in this movie.","produced_by":"Jack Rapke Steve Starkey Robert Zemeckis","starring":"Jim Carrey Gary Oldman Colin Firth Bob Hoskins Robin Wright Penn Cary Elwes","running_time":"95 minutes[1]","a_christmas_carol":"Theatrical release poster","music_by":"Alan Silvestri","edited_by":"Jeremiah O'Driscoll","Release":"A Christmas Carol premiered at London on November 3, 2009 and was theatrically released on November 6, 2009 in the United States by Walt Disney Pictures.Disney released the film on November 16, 2010[11] in a single-disc DVD, two-disc 2D Blu-ray/DVD combo and in a four-disc combo pack that includes a Blu-ray 3D, a Blu-ray 2D, a DVD and a digital copy. This marked the first time that a film was available in Blu-ray 3D the same day as a standard Blu-ray 2D,[citation needed] as well as Disney's first in the Blu-ray 3D market.[12] The DVD contains deleted scenes and two featurettes called \"On Set with Sammi\" and \"Capturing A Christmas Carol\". The Blu-ray 2D also has a \"Digital Advent Calendar\" and the featurette \"Behind the Carol: The Full Motion Capture Experience\". The Blu-ray 3D has an exclusive 3D game called \"Mr. Scrooge's Wild Ride\".","budget":"$175-200 million[2][3]"}