{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Nicole Oakley, the out-of-control daughter of congressman Tom Oakley, meets a working class Mexican-American straight-A student, Carlos Nuñez. Nicole's mother committed suicide when she was very young, and feels unwanted by her father, who is now married to another woman and has another young daughter with his new wife. Carlos, on the other hand, is from a poor background and working hard towards becoming a Navy pilot.They fall in love, and Carlos spends so much time with her that he stops performing well in school. Carlos is applying to the U.S. Naval Academy and Nicole's father suggests Carlos talk to him about gaining his Congressional sponsorship to the Academy. During their meeting, Nicole's father tells Carlos that he needs to end his relationship with Nicole, or she will destroy his life. Carlos breaks up with her, which leads Nicole into depression and back into wild, drunken partying. One night, Carlos calls her and finds out she is getting drunk at a high school party. He saves Nicole from a boy trying to take advantage of her. Carlos drives her home, but they get stopped by the police.As a result of this incident, Nicole's father and stepmother decide that she needs to go to a boarding school far away from home; Carlos rescues her and they run away together. While they are away, Nicole realizes she is getting in the way of Carlos' dreams, so she decides to sober up. They go back home and she makes up with her father. Her father thanks Carlos for not listening to his advice to abandon Nicole. In the end credits, we see that Carlos has become a pilot with the Navy.","language":"English","Reception":"Crazy/Beautiful opened at #9 at the U.S. Box office taking in $4,715,060 USD during its opening weekend. The film eventually grossed a worldwide total of $19,937,988 on a $13 million budget.[2]","box_office":"$19.9 million[2]","cinematography":"Shane Hurlbut","production_company":"Touchstone Pictures Ulfland Productions","directed_by":"John Stockwell","crazy/beautiful":"Theatrical release poster","Soundtrack":"The soundtrack album was released by Hollywood Records on June 6, 2001; Seven Mary Three's \"Wait\" served as the album's English lead single; La Ley's \"Siempre (Every Time)\" was its Spanish lead single. \"Wait\" charted considerably well and its music video, directed by the film's director Stockwell, featured Dunst and Hernandez.[3] Amazon.com editorialist Rickey Wright gave a mixed review of the soundtrack, citing groups like The Dandy Warhols, Mellow Man Ace, and Delinquent Habits as \"evocative\" while also stating that it \"hardly makes a good argument for the continuing validity of guitar rock.\"[4]","release_dates":"June 29, 2001 (2001-06-29)|||||","produced_by":"Rachel Pfeffer Harry J. Ufland Mary Jane Ufland","starring":"Kirsten Dunst Jay Hernandez Bruce Davison","running_time":"99 minutes[1] 135 minutes (Director's cut)","music_by":"Paul Haslinger","edited_by":"Melissa Kent","written_by":"Phil Hay Matt Manfredi","budget":"$13 million[2]"}