{"based_on":"Carrie  by Stephen King","original_language(s)":"English","production_company(s)":"Trilogy Entertainment Group","carrie":"Promotional release poster","Plot":"Several people are being interviewed in a police station, including a high school student, Sue Snell (Kandyse McClure) and gym teacher Miss Desjarden (Rena Sofer). Detective John Mulcahey (David Keith) is investigating the disappearance of high school student Carrie White (Angela Bettis). These interviews are interspersed with flashbacks to previous events.The film then features a flashback to two weeks before the prom at Ewen High School. Carrie is a shy and withdrawn girl tormented by the popular girls; Christine \"Chris\" Hargensen (Emilie De Ravin) and Tina Blake (Katharine Isabelle) are especially vicious. After gym class, Carrie has her first period in the shower, and she panics. The other girls swarm the shower and taunt her. Hearing the commotion, Ms. Desjarden comes into the shower, and comforts Carrie as a light bulb shatters above them. Later, Principal Morton (Laurie Murdoch) decides to send Carrie home, but calls Carrie the wrong name. Carrie corrects him repeatedly, finally yelling as his desk suddenly moves several inches. As Carrie gathers her belongings to leave, she is the victim of a practical joke at her locker. On her way home, Carrie is accosted by a boy on a bicycle, whose joke goes wrong when he seemingly flies off his bike and crashes into a tree. When she reaches home, Carrie has a flashback to her own childhood before entering the house. Carrie's fanatically religious mother, Margaret White (Patricia Clarkson), who considers menstruation a sign of sexual sin, locks Carrie in her \"prayer closet\" as punishment.The next day, Ms. Desjarden gives the girls a week's detention for their bullying. If they skip the detention, they face suspension and refusal of their prom tickets. Chris storms out in protest. After Chris' father John Hargensen, a lawyer, unsuccessfully attempts to get her prom ban rescinded, Chris enlists her boyfriend Billy Nolan to get revenge on Carrie. Meanwhile, Carrie discovers she has telekinesis, the ability to move or control objects with her mind. Carrie has a telekinetic episode in class and, when she goes home, practices her rediscovered talent. Sue, trying to atone for tormenting Carrie, asks her boyfriend, Tommy Ross (Tobias Mehler), to take Carrie to the prom. After some hesitation, Carrie agrees. When Carrie tells her mother about the prom invitation, Margaret forbids her to go; Carrie uses her powers to finally confront her mother, and Margaret seemingly gives in.As prom night approaches, Chris and Billy prepare their revenge on Carrie when they find out that Carrie is on the Prom Queen ballot. On the day of the prom, Tina switches the ballots, and Carrie and Tommy are declared the Prom King and Queen winners. As Tommy and Carrie take their place onstage, Chris, who has been hiding with Billy in the rafters, pulls a rope to tip a bucket, sending a wave of blood onto Carrie. Chris and Billy run; when Chris releases the rope, the bucket falls on Tommy's head, killing him. Carrie goes into a shock-induced trance and telekinetic mayhem ensues. She locks everyone inside the gym and sets fire to it. She kills Tina by crushing her, and then electrocutes most of the remaining students, including Roy and Helen, killing everyone except for a few students, including Norma, who escape through a vent with Ms. Desjarden. Carrie then leaves the burning gym, unleashing a wave of destruction in town. Chris and Billy see her walking in the road. Billy tries to run her down but Carrie tosses their truck into a pole, thus killing them.When Carrie arrives home, she gets into a bathtub, where she finally snaps back to herself but cannot remember what happened. Margaret comes into the bathroom and drowns Carrie in the tub. With her last ounce of strength Carrie stops her mother's heart. Sue finds Carrie near death and manages to revive Carrie with artificial respiration. At Sue's suggestion, Carrie fakes her death and Sue sneaks Carrie out of town to Florida. As the two drive off, Carrie has a nightmarish vision of her mother. When Carrie wakes, she looks at Sue and hallucinates Chris lunging at her. Noticing this, Sue asks her if she wants to stop for a moment. Carrie sighs and Sue keeps driving.","country_of_origin":"United States","original_network":"NBC","distributor":"Metro-Goldwyn-Mayer","cinematography":"Victor Goss","Fight songs":"The fight songs played during the prom scene are those of Dartmouth College, as performed by the Dartmouth College Marching Band. Executive producer Mark Stern, an alumnus of Dartmouth, requested a recording of the Dartmouth songs from faculty director Max Culpepper for use in the movie. After finding the Dartmouth Wind Symphony recording of the songs to be too professional-sounding, he requested a recording that was more \"wild and enthusiastic\". The marching band then recorded the songs at the loudest volume possible, in order to distort tone and intonation and sound more like a high school band.[4]","directed_by":"David Carson","original_release":"November 4, 2002 (2002-11-04)","theme_music_composer":"Laura Karpman","editor(s)":"Jeremy Presner","starring":"Angela Bettis|Patricia Clarkson|Rena Sofer|Kandyse McClure|Emilie de Ravin|","running_time":"132 minutes","producer(s)":"David Carson|Bryan Fuller|","written_by":"Bryan Fuller"}