{"country":"Spain[2]","distributed_by":"Lionsgate","Plot":"On October 23, 2006, Paul Conroy, an American civilian truck driver working in Iraq, wakes up and finds himself buried alive in a wooden coffin, bound and gagged, with only a Zippo lighter and a BlackBerry phone at hand. Although he initially has no idea how he got there, he starts to piece together what has happened to him. He remembers that his and several other trucks were ambushed by terrorists, who killed his colleagues; he was hit by a rock and passed out. He receives a call from his kidnapper, Jabir, demanding that he pay a ransom of $5 million by 9PM or he will be left in the coffin to die.Conroy calls the State Department, which tells him that due to the government policy of not negotiating with terrorists, it will not pay the ransom but will try to rescue him. They connect him with Dan Brenner, head of the Hostage Working Group, who tells Conroy they are doing their best to find him.His kidnapper calls Conroy and demands he make a ransom video, threatening to execute one of his colleagues who survived the attack. Conroy insists that no one will pay $5 million, so the kidnapper drops the amount to $1 million. Despite his compliance in making a video, the kidnappers execute his colleague and send him the recording of it, which he watches in horror. Shortly afterwards, distant explosions shake the area, damaging his coffin, which begins to slowly fill with sand. Conroy continues sporadic phone calls with Brenner, skeptical of the man's promises of help. To reaffirm his wholehearted intentions, Brenner tells Conroy about a 26-year-old named Mark White who was rescued from a similar situation three weeks previously, telling him that the kid is home with his family and likely happy.Later on, Conroy receives a phone call from his employers, who inform him that he was fired from his job due to an alleged prohibited relationship with a colleague (the one who was executed), and thus he and his family will not be entitled to any benefits or pension he earned during his time with the company. Brenner calls back and explains that the explosions that had damaged his coffin earlier were in fact several F-16 bombings, and that his kidnappers may have been killed. Conroy begins to lose all hope and does a last will and testament in video form, giving his son all of his clothes and his wife his personal savings. Jabir calls back demanding that Conroy video record himself cutting his finger off, threatening Conroy's family back home in Michigan if he refuses, saying that he lost all of his children. Conroy records himself cutting off one of his fingers and sends the video.Shortly after making the video, the cell phone rings, Paul begins to hear shovels and distorted voices. The voices come clearer, saying to open the coffin, and the coffin opens. But abruptly, it becomes obvious he hallucinated the encounter.After some minutes, Brenner calls, notifying Conroy that they have found his location and are driving out to find him. Then Conroy's wife Linda calls him, so Conroy hangs up on Brenner. She cries with him and begs him to promise her that he will come home. He promises, but hangs up due to another call from Brenner. Brenner reports that they have found the site. The group starts to dig up a coffin, but Conroy cannot hear anyone near the coffin. When they open it, the coffin turns out to be Mark White's, not Conroy's, indicating that White was never saved. Paul starts to cry as he realizes he is not going to be saved. The sand fills his coffin and he suffocates. The last thing he hears is Brenner, repeating, \"I'm sorry, Paul. I'm so sorry.\" as the screen goes black.","buried":"Theatrical release poster","language":"English","Reception":"Buried received mostly positive reviews from critics, with Reynolds' performance receiving widespread praise. Review aggregation website Rotten Tomatoes gives the film a score of 87% based on reviews from 151 critics, with an average score of 7.3 out of 10. The site's consensus says: \"Wringing a seemingly impossible amount of gripping drama out of its claustrophobic premise, Buried is a nerve-wracking showcase for Ryan Reynolds's talent.\"[10]Film critic Roger Ebert awarded the film 3.5 out of 4 stars and wrote that \"Rodrigo Cortés, the Spanish filmmaker behind this diabolical, Hitchcock-influenced narrative stunt, makes merry mischief with camera angles and lighting\".[11] Scott Mantz of Access Hollywood called it \"a brilliantly twisted suspense thriller that would have made Alfred Hitchcock proud.\"[12] Chris Tilly at IGN gave the film a perfect 10 out of 10.[13] Peter Travers of Rolling Stone awarded the film 2 out of 4 stars, commenting: \"Ninety minutes of being buried alive with Ryan Reynolds: Didn't we all suffer that in The Proposal?\"[14]","box_office":"$19.2 million[4]","cinematography":"Eduard Grau","production_company":"The Safran Company Versus Entertainment Dark Trick Films[1]","directed_by":"Rodrigo Cortés","release_dates":"September 24, 2010 (2010-09-24)|||||","Production":"The film was produced by Barcelona-based Versus Entertainment in association with The Safran Company and Dark Trick Films, with the support of Instituto de Crédito Oficial with the participation of Studio 37/Kinology and Icon Film Distribution.It was shot in a time period of over 16 days in Barcelona.[7] One of director Rodrigo Cortés' inspirations was the film Rope directed by Alfred Hitchcock.[7]The date of events in the film is stated as October 23, 2006, Ryan Reynolds' 30th birthday.","produced_by":"Adrián Guerra|Peter Safran|","starring":"Ryan Reynolds","running_time":"95 minutes","music_by":"Víctor Reyes","edited_by":"Rodrigo Cortés","Release":"Buried premiered at the Sundance Film Festival on January 23, 2010. Lionsgate purchased the theatrical rights to the film and gave the film a limited theatrical release on September 24, 2010 and a wider release two weeks later on October 8, 2010. The film's first trailer premiered with A Nightmare on Elm Street. The second trailer premiered at the 2010 San Diego Comic-Con International, and was attached with select prints of Dinner for Schmucks, Resident Evil: Afterlife, The Expendables and The Last Exorcism.The film won the best European feature film of the year award at the Strasbourg European Fantastic Film Festival in September 2010.[8]The film was presented at the Deauville American Film Festival, in competition, and the Toronto International Film Festival,[9] out of competition, in September 2010.","written_by":"Chris Sparling","budget":"$2 million[3]"}