{"coogan's_bluff":"film poster","country":"United States","distributed_by":"Universal Pictures","Plot":"Arizona deputy sheriff Walt Coogan is sent to New York City to extradite escaped killer James Ringerman. Detective Lieutenant McElroy informs him that Ringerman is recovering from an overdose of LSD, cannot be moved until the doctors release him, and that Coogan needs to get extradition papers from the New York State Supreme Court.Coogan flirts with probation officer Julie Roth, then bluffs his way to Ringerman, tricks the attendants into turning him over, and sets out to catch a plane for Arizona. Before he can get to the airport, Ringerman's girlfriend Linny and a tavern owner named Pushie ambush Coogan and enable Ringerman to escape. Detective McElroy is furious. Coogan learns Linny's name and obtains her address from the Julie Roth's home filesHe tracks Linny to a nightclub and after some time she offers to lead him to Ringerman. Instead she takes Coogan to a pool hall where he is attacked by Pushie and a dozen men in a bloody battle. Coogan holds his own for a while but is eventually overpowered. After hearing sirens the men take off, but not before the beaten Coogan kills Pushie and two others. Detective McElroy finds the bar in pieces and a cowboy hat on the floor.Coogan finds Linny and threatens to kill her if she does not lead him to Ringerman. She takes him to Ringerman, who is armed with a gun stolen from Coogan. Ringerman gets away on his motorcycle and Coogan commandeers a motorcycle of his own. Coogan gives chase through Fort Tryon Park[4] eventually captures Ringerman.He hands the fugitive over to McElroy, who once again tells him to go to the DA's office and to let \"the system handle this\". Some time later Coogan, with Ringerman in cuffs, prepares to leave for the airport via helicopter. Inside the helicopter, Coogan lights a cigarette, and seeing that Ringerman wants a smoke, lights one up for him too. Coogan's last view is Julie Roth waving goodbye from the helipad.","language":"English","Reception":"Coogan's Bluff was released in the United States in October 1968, where it grossed over $3.1 million.[10] The film was controversial for its portrayal of violence, but it had launched a collaboration between Eastwood and Siegel that lasted more than ten years, and set the prototype for the macho hero that Eastwood would play in the Dirty Harry films. The script of the film foreshadows the McCloud television series that starred Dennis Weaver.","box_office":"$3,110,000[2]","cinematography":"Bud Thackery","directed_by":"Don Siegel","release_dates":"October 2, 1968 (1968-10-02)|||||","Production":"Before Hang 'Em High had been released, Eastwood had set to work on Coogan's Bluff, a project which saw him reunite with Universal Studios after an offer of $1 million, more than doubling his previous salary.[5][6] Jennings Lang was responsible for the deal. Lang was a former agent of Don Siegel, a Universal contract director who was invited to direct Eastwood's second major American film. Eastwood was not familiar with Siegel's work but Lang arranged for them to meet at Clint's residence in Carmel. Eastwood had seen three of Siegel's earlier films, was impressed with his directing and the two became friends, forming a close partnership in the years that followed.[7]The idea for Coogan's Bluff originated in early 1967 as a TV series and the first draft was drawn up by Herman Miller and Jack Laird, screenwriters for Rawhide.[8] It is about a character named Sheriff Walt Coogan, a lonely deputy sheriff working in New York City.After Siegel and Eastwood had agreed to work together, Howard Rodman and three other writers were hired to devise a new script as the new team scouted for locations including New York and the Mojave desert.[7] However, Eastwood surprised the team one day by calling an abrupt meeting and professed to strongly dislike the script, which by now had gone through seven drafts, preferring Herman Miller's original concept.[7] This experience would also shape Eastwood's distaste for redrafting scripts in his later career.[7]Eastwood and Siegel hired a new writer, Dean Riesner, who had written for Siegel in the Henry Fonda TV film Stranger on the Run. Eastwood did not communicate with the screenwriter until one day Riesner criticized a scene Eastwood had liked which involved Coogan having sex with Linny Raven in the hope that she would take him to her \"boyfriend.\" According to Riesner, Eastwood's \"face went white and gave me one of those Clint looks\".[9]The two soon reconciled their differences and worked on a script in which Eastwood had considerable input. Don Stroud was cast as the psychopathic criminal Coogan is chasing, Lee J. Cobb as the disagreeable New York City Police Department lieutenant, Susan Clark as a probation officer who falls for Coogan and Tisha Sterling as the drug-using lover of Stroud's character.[9] Filming began in November 1967 even before the full script had been finalized.[9]","Home media releases":"The DVD version of Coogan's Bluff is edited by approximately three minutes in all regions for unknown reasons. The missing scenes include Coogan receiving his assignment to return Ringerman from New York, a short scene in a hospital, and a scene in which Julie talks about Coogan's Bluff, a lookout point over the ocean near New York (the real Coogan's Bluff is a site on Manhattan Island between Washington Heights and Harlem), tying the location into the film's title. The earlier video release did not have these edits, and was released uncut.","produced_by":"Don Siegel","starring":"Clint Eastwood Lee J. Cobb Susan Clark Don Stroud","running_time":"93 min.","music_by":"Lalo Schifrin","edited_by":"Sam E. Waxman","written_by":"Herman Miller","budget":"$1.5 million[1]"}