{"based_on":"A Man for All Seasons 1960 play  by Robert Bolt","country":"United Kingdom","distributed_by":"Columbia Pictures","screenplay_by":"Robert Bolt","Plot":"Cardinal Wolsey, the Lord Chancellor of England, summons Sir Thomas More to Hampton Court, one of the principal royal palaces in the vicinity of London, for a private, late-night meeting. As both men know, King Henry VIII wishes to divorce his wife and marry Anne Boleyn. Saying that England needs a male heir to prevent another period of dynastic wars like the Wars of the Roses and that Henry's present queen cannot provide one, Wolsey chastises More for being the only member of the Privy Council to oppose Wolsey's policies to obtain a divorce from the Vatican. More states that it is appropriate to try to persuade the Pope to grant a divorce by argument, but that he can never go along with Wolsey's suggestion that they apply \"pressure\" on Church property and revenue in England to force the issue. To Wolsey's fury, More responds, \"No, Your Grace. I am not going to help you.\" Unknown to More, the conversation is overheard by Wolsey's aide, Thomas Cromwell.Returning by a River Thames ferry to his home at Chelsea at dawn, More finds Richard Rich, a young acquaintance from Cambridge, waiting by the dock for his return. An ambitious young man who is drawn to political power, Rich pleads with More for a position at Court. More, citing the many corruptions there, refuses and urges Rich to become a teacher at Cambridge instead.More enters his house to find his daughter Meg chatting with a brilliant young lawyer named William Roper, who announces his desire to marry her. The devoutly Catholic More states that he respects Roper but that his answer will remain, \"No,\" as long as Roper remains a Lutheran.When Wolsey's measures to obtain a divorce from the Pope fail, he is deprived of his office and banished from Court by the King. The King proposes to imprison Wolsey and try him for treason, but before that can happen Wolsey dies. King Henry appoints More as Lord Chancellor of England.Soon after, the King makes an \"impromptu\" visit to the More estate to inquire about his divorce. Sir Thomas, not wishing to admit that his conscience forbids him to use unethical means to get the results the King demands, remains unmoved as Henry alternates between threats, tantrums, and promises of unbounded Royal favour. More finally refers to Catherine of Aragon as \"the Queen,\" and the King screams that those who call her that are liars and traitors. Enraged, King Henry returns to his barge and orders the oarsmen to cast off. At the embankment, Rich is asked by Cromwell whether he has information that could damage More's reputation. In exchange, Cromwell promises him a position at Court.Roper, learning of More's quarrel with the King, reveals that his religious opinions have altered considerably. He declares that by attacking the Church, the King has become \"the Devil's minister.\" A horrified More admonishes him to be more guarded as Rich arrives, pleading again for a position at Court. When More again refuses, Rich denounces More's steward as a spy for Cromwell. An unmoved More responds, \"Of course, that's one of my servants.\"Humiliated, Rich joins Cromwell in attempting to bring down More. Meanwhile, the King tires of Papal refusals and has Parliament declare him \"Supreme Head of the Church of England.\" He demands that both the bishops and Parliament renounce all allegiance to the Pope. More quietly resigns as Lord Chancellor rather than accept the new order. As he does so, his close friend, Thomas Howard, 3rd Duke of Norfolk, attempts to draw his opinions out as part of a friendly chat with no witnesses present. More, however, knows that the time for speaking openly of such matters is over.Cromwell, in a meeting with Norfolk, implies that More's troubles would be alleviated were he to attend the King's wedding to Anne Boleyn. When More declines to appear, he is summoned again to Hampton Court, now occupied by Cromwell. More is interrogated on his opinions but refuses to answer. Infuriated, Cromwell declares that the King views him as a traitor, but allows him to return home.Upon returning home, Meg informs her father that a new oath is being circulated and that all must take it or face charges of high treason. Initially, More says he would be willing to take the oath, provided it refers only to the King's marriage to Anne Boleyn. Upon learning that it names the King as Supreme Head of the Church, More refuses to take it and is subsequently imprisoned in the Tower of London.Despite the coercive tactics of Cromwell, the subtle manipulations of Archbishop Thomas Cranmer, and the pleadings of both the Duke of Norfolk and his own family, More remains steadfast in his refusal to take the Oath. He refuses to explain his objections, knowing that he cannot be convicted without a stated reason. A request for new books to read backfires, resulting in confiscation of the books he has, and Richard Rich removes them from More's cell.More is finally brought to trial, but refuses to speak about the marriage or why he will not take the Oath, and cites his silence in defense. Rich then testifies that when he came to take away More's books, More told him he would not take the Oath because the King could not be Head of the Church, thus committing treason by contradicting the Act of Supremacy. More is convicted of treason on the perjured testimony of Rich, who has been made Attorney General for Wales as a reward.Now having nothing left to lose, More denounces the King's actions as illegal. As grounds, he cites the Biblical basis for the authority of the Papacy over Christendom. He further declares that the Church's immunity to State interference is guaranteed both in Magna Carta and in the King's own Coronation Oath. As the audience screams in protest, More is condemned to death by beheading. Before his execution on Tower Hill, More pardons the executioner, and says, \"I die His Majesty's good servant, but God's first.\"A narrator (voiced by Colin Blakely, who also played the part of More's servant Matthew) intones the epilogue:","Title":"The title reflects playwright Bolt's portrayal of More as the ultimate man of conscience and as remaining true to his principles and religion under all circumstances and at all times. Bolt borrowed the title from Robert Whittington, a contemporary of More, who in 1520 wrote of him:More is a man of an angel's wit and singular learning. I know not his fellow. For where is the man of that gentleness, lowliness and affability? And, as time requireth, a man of marvelous mirth and pastimes, and sometime of as sad gravity. A man for all seasons.[4][5]","language":"English","Reception":"The film was a box office success, making $28,350,000 in the US alone,[2] making it the fifth highest grossing film of 1966.It has received positive reviews from modern film critics, with an 86% approval rating in review aggregator Rotten Tomatoes and the site's consensus being: \"Solid cinematography and enjoyable performances from Paul Scofield and Robert Shaw add a spark to this deliberately paced adaptation of the Robert Bolt play.\"[6] It's also ranked number 43 on the British Film Institute's list of the top 100 British films.Scofield's performance was particularly acclaimed and he won the Best Actor Oscar. The film dominated the 39th Academy Awards and won additionally for Best Adapted Screenplay, Best Cinematography, Best Costume Design, Best Director, and Best Picture. It was also nominated for Best Supporting Actor for Shaw and Best Supporting Actress for Hiller. The film also helped launch the career of the then-unknown Hurt. The film's win for Best Picture Oscar defeated another heavy nominee Who's Afraid of Virginia Woolf? which earned 13 nominations, almost twice the winning picture's total nominations alone. For Zinnemann, he won a second time as Best Director and earned a second Best Picture award after his winning both awards for the first time for From Here to Eternity.The film won five BAFTA Awards for Best Film from any Source, Best British Film, Best Photography (Ted Moore), Best Production design (John Box) and Best Actor (Scofield). The film was also entered into the 5th Moscow International Film Festival where Scofield won the award for Best Actor.[7]","a_man_for_all_seasons":"Original film poster by Howard Terpning","Premise":"Sir Thomas More was the 16th-century Lord Chancellor of England who refused to sign a letter asking Pope Clement VII to annul King Henry VIII of England's marriage to Catherine of Aragon and resigned rather than take an Oath of Supremacy declaring Henry VIII Supreme Head of the Church of England. Both the play and the film portray More as a tragic hero, motivated by his devout Roman Catholic faith and envied by rivals, such as Thomas Cromwell. He is also deeply loved by his family and respected by the common people. The film's story is set between 1529 and 1535, at the high point of the reign of Henry VIII of England.","box_office":"$28.4 million[2]","cinematography":"Ted Moore","production_company":"Highland Films","directed_by":"Fred Zinnemann","release_dates":"12 December 1966 (USA) March 1967 (UK)","Production":"The producers initially feared that Scofield was not a big enough name to draw in audiences, so the producers approached Richard Burton, who turned down the part. Laurence Olivier was also considered, but director Zinnemann demanded that Scofield be cast. He played More both in London's West End and on Broadway; the latter appearance led to a Tony Award.Alec Guinness was the studio's first choice to play Cardinal Wolsey, and Peter O'Toole was the first choice to play Henry VIII. Richard Harris was also considered. Bolt wanted film director John Huston to play Norfolk, but he refused. Vanessa Redgrave was originally to have played Margaret, but she had a theatre commitment. She agreed to a cameo as Anne Boleyn on the condition that she not be billed in the part or mentioned in the previews.To keep the budget at under $2 million, the actors all took salary cuts. Only Scofield, York, and Welles were paid salaries exceeding £10,000. For playing Rich, his first major film role, John Hurt was paid £3,000. Vanessa Redgrave appeared simply for the fun of it and refused to accept any money.Leo McKern had played the Common Man in the original West End production of the show, but had been shifted to Cromwell for the Broadway production. He and Scofield are the only members of the cast to appear in both the stage and screen versions of the story. Vanessa Redgrave did appear as Alice in a 1988 remake.","produced_by":"Fred Zinnemann","starring":"Paul Scofield|Wendy Hiller|Leo McKern|Orson Welles|Robert Shaw|Susannah York|","running_time":"120 minutes[1]","music_by":"Georges Delerue","edited_by":"Ralph Kemplen","budget":"$2 million","Adaptation":"Robert Bolt adapted the screenplay himself. The running commentary of The Common Man was deleted and the character was divided into the roles of the Thames boatman, More's steward, an innkeeper, the jailer from the Tower, the jury foreman and the executioner. The subplot involving the imperial ambassador, Eustace Chapuys, was also excised. A few minor scenes were added to the play, for instance Wolsey's death, More's investiture as Chancellor, and the King's wedding to Anne Boleyn, to cover narrative gaps left by the exclusion of the Common Man.For obvious reasons, the Brechtian staging of the final courtroom scene (which depicted the Jury as consisting of the Common Man and several sticks bearing the hats of the various characters he has played) is changed to a more realistic setting. Also, while the Duke of Norfolk was the judge both historically and in the play's depiction of the trial, the character of the Chief Justice (Jack Gwillim) was created for the film. Norfolk is still present, but plays little role in the proceedings."}