{"based_on":"Baggage Claim  by David E. Talbert","country":"United States","distributed_by":"Fox Searchlight Pictures","Plot":"Pathologically single, 30-something, flight attendant, Montana Moore (Paula Patton) is on a mission to get her overbearing, frequently married, mother (Jenifer Lewis) to stop pressuring her to get married. After being jilted by her only prospect (Boris Kodjoe) just as her younger sister, Sheree (Lauren London), becomes engaged, Montana and her friends (Adam Brody and Jill Scott) devise a plan to help her find a potential husband before Sheree's wedding. Over the course of 30 days, Montana flies all over the country (with the help of a colorful team of coworkers) hoping to reconnect with a litany of ex-boyfriends that include a misogynistic politician (Taye Diggs), an irresponsible entertainer (Trey Songz) and a commitment shy multi-billionaire (Djimon Hounsou).Though her quest to find a husband proves to be a disaster, Montana is oblivious to the developing romance with her longtime best friend (Derek Luke). Once Montana realizes that she doesn't need a husband to live a fulfilling life, she finally stands up to her mother and gets her proposal from \"Mr. Wright.\"","language":"English","Reception":"Baggage Claim received generally negative reviews from critics. Rotten Tomatoes gives the film a rating of 14%, based on 78 reviews, with an average rating of 4.8/10. The site's critical consensus reads, \"Baggage Claim hits the same notes as a number of successful romantic comedies without establishing much personality of its own.\"[4] On Metacritic, the film holds a score of 34 out of 100, based on 27 critics, indicating \"generally unfavorable reviews\".[5]Audiences surveyed by CinemaScore gave Baggage Claim an A- grade.[6][7]","box_office":"$22,456,509[2]","cinematography":"Anastas N. Michos","production_company":"260 Degrees Sneak Preview Productions","directed_by":"David E. Talbert","release_dates":"September 27, 2013 (2013-09-27)|||||","produced_by":"David E. Talbert Steven J. Wolfe","starring":"Paula Patton|Adam Brody|Sweeny|Djimon Hounsou|Trey Songz|Christina Milian|Derek Luke|Tia Mowry-Hardrict|La La Anthony|","running_time":"96 minutes[1]","baggage_claim":"Theatrical release poster","music_by":"Aaron Zigman","edited_by":"Troy Takaki","written_by":"David E. Talbert","budget":"$8.5 million[citation needed]"}