{"Adaptations":"A stage adaptation of the film was directed by Carrie Cracknell in 2009 for Hush Productions and the National Theatre of Scotland.[5]","country":"Japan","distributed_by":"Shochiku","Plot":"The film features three primary sets of characters, each within their own distinct story:These stories do have some incidental visual cross-over with each other in the film, but are mostly separate. The first story is the one on which the film centers. The film leads into it by opening with a performance of Bunraku theatre, and closes with a shot of dolls from the same. The performance is that of \"The Courier for Hell\" by Chikamatsu Monzaemon, and it alludes to themes that reappear later in the film. Because the rest of the film itself (as Kitano himself has said) can be treated as Bunraku in film form, the film is quite symbolic. In some cases, it is not clear whether a particular scene is meant to be taken literally. The film is also not in strict chronological order, but there is a strong visual emphasis on the changing of the seasons and the bonds of love over the progression of time (Matsumoto and Sawako spend most of the film physically connected by a red rope).","language":"Japanese","Themes":"The film and each of its vignettes revolve closely around the theme of death. It was Kitano's intent to show death as neither good nor bad but a relative event. In an interview, Kitano stated, \"The reason why modern Japanese and Westerners loathe the notion of death so much is beyond me. There really is no reason to loathe death,\" adding, \"How you perceive this film can considerably differ depending on the position where you stand.\"[2]","Reception":"The film has positive scores in review aggregator websites. Rotten Tomatoes gives the film 75%, with 36 reviews.[3] Metacritic gives it 71 out of 100, with 16 reviews.[4]","box_office":"$5,405,725[1]","cinematography":"Katsumi Yanagishima","production_company":"Office Kitano","directed_by":"Takeshi Kitano","Soundtrack":"All compositions by Joe Hisaishi.","release_dates":"Template:Film date07","produced_by":"Masayuki Mori Takio Yoshida","starring":"Miho Kanno Hidetoshi Nishijima Tatsuya Mihashi Chieko Matsubara Kyoko Fukada Tsutomu Takeshige","running_time":"114 minutes","music_by":"Joe Hisaishi","edited_by":"Takeshi Kitano","written_by":"Takeshi Kitano"}