{"country":"United States","Awards and nominations":"The film was nominated for three Academy Awards.[2]Bobby Darin won the French Film Critics Award for best actor at the Cannes Film Festival.","distributed_by":"Universal Pictures","Plot":"In 1944, Captain Josiah Newman (Peck) is head of the neuro-psychiatric Ward 7 at the Colfax Army Air Field military hospital, located in the Arizona desert. As he explains to a visiting VIP who wanders in: \"We're short of beds, doctors, orderlies, nurses, everything ... except patients.\" He will use unconventional tactics to treat his patients and to recruit much needed personnel, as when he hijacks a new and very reluctant orderly, Corporal Jackson Leibowitz (Curtis), a wheeler-dealer from New Jersey. Leibowitz promptly has the entire ward participating in a sing-along of \"Old MacDonald Had a Farm.\"Newman also takes great pains to court nurse Lieutenant Francie Corum (Dickinson) on what she thinks is a date... until he asks her to transfer to Ward 7. Their 'date/fight' is cut short by a phone call: Colonel Bliss (Albert) has forced his way into Ward 7 looking for Dr. Newman with a 6-inch knife, because Newman blocked his return to active duty after witnessing Bliss' erratic behavior. After watching Newman's handling of this situation and other patients on the ward, Corum transfers in.As Newman treats tragically shell-shocked, schizophrenic and catatonic patients, particularly the traumatized Corporal Jim Tompkins, an Eighth Air Force air gunner who symbolizes all of the post-traumatic stress disorder patients on the NP ward, he is hilariously bedeviled by Colfax AAF's \"old-school\" base commander, Colonel Pyser (Gregory), who ultimately saddles him with a complement of injured Italian POWs because his is the only secure ward in the hospital. In addition, a flock of constantly straying sheep (kept for the medical lab) that find their way to the airfield and a set of wise-ass, feuding orderlies keeps life interesting right up to Christmas 1944.","language":"English","captain_newman,_m.d.":"Theatrical poster","box_office":"$4.25 million (rentals)[1]","cinematography":"Russell Metty","directed_by":"David Miller","release_dates":"December 23, 1963 (1963-12-23)|||||","produced_by":"Robert Arthur","starring":"Gregory Peck Tony Curtis Angie Dickinson Robert Duvall Eddie Albert Bobby Darin","running_time":"126 minutes","music_by":"Russell Garcia Frank Skinner (composer)","edited_by":"Alma Macrorie","written_by":"Richard L. Breen Henry Ephron Phoebe Ephron"}