{"Cast":"The film features a cameo by Wallace Shawn as a waiter in a restaurant; Malle's next film was My Dinner with Andre, where Shawn is waited on as a customer.","country":"Canada France","distributed_by":"Paramount Pictures","Plot":"Sally (Susan Sarandon) is a young waitress in an Atlantic City casino who has dreams of becoming a blackjack dealer in Monte Carlo. Sally's estranged husband Dave (Robert Joy) returns to her one day with the intention of selling a large amount of cocaine that he had stolen in Philadelphia and meets Lou (Burt Lancaster), an aging former gangster who lives in Sally's apartment building and runs numbers in poor areas of the city; he also acts as a caretaker for Grace (Kate Reid), an elderly invalid. Dave convinces Lou to sell the cocaine for him, but as Lou sells the first batch, Dave is attacked and killed by the mobsters from whom he had stolen the drugs.Lou is left with the remaining cocaine and continues to sell to impress Sally, whom he has long pined for, with money. Sally and Lou make love one day, but she returns to her apartment to find it trashed; she has been tracked down by Dave's killers, who beat her to find out if she has the drugs. They leave, but Lou laments not being able to protect her. Sally is fired from the casino when her late husband's criminal record is discovered. Lou sells the remainder of the cocaine, while both Sally and the mobsters discover Lou's affiliation with Dave. The mobsters corner them one night, but are killed when Lou produces a gun and shoots them. He and Sally then steal their car and leave the city. That night, from a hotel outside Atlantic City, they watch the TV news reporting on the killing. A police sketch of the suspect is shown. It looks nothing like Lou. Lou is overjoyed with relief and pride. He confesses to Sally that this was the first time he had ever killed anyone.At a motel during the night, Lou takes the phone to the bathroom to call Grace and brag about the killings. Sally also wakes and steals the money with the intention of sneaking off; Lou witnesses this, allowing her to leave and giving her the car keys so she can escape to France, rather than go to Miami with Lou. Lou returns to Atlantic City to be with Grace and continue selling a portion of the cocaine that he had stashed away.","atlantic_city":"Theatrical release poster","language":"English French","box_office":"$12,729,675[1]","cinematography":"Richard Ciupka","production_company":"Selta Films","directed_by":"Louis Malle","Awards":"The film won the Golden Lion at the Venice Film Festival in 1980 in a tie with John Cassavetes' Gloria.Atlantic City was nominated for Academy Awards for Best Actor in a Leading Role (Burt Lancaster), Best Actress in a Leading Role (Susan Sarandon), Best Director, Best Picture and Best Writing, Screenplay Written Directly for the Screen. Genie Awards – Foreign Actress (Sarandon), Supporting Actress (Reid), Art Direction; BAFTA – Director, Actor (Lancaster); Los Angeles Film Critics Association – Picture, Screenplay, Actor (Lancaster); National Society of Film Critics – Film, Director, Screenplay, Actor (Lancaster); New York Film Critics Circle – Screenplay, Actor (Lancaster).In 2003, Atlantic City was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".American Film Institute Lists","release_dates":"September 3, 1980 (1980-09-03) (France)|December 19, 1980 (1980-12-19) (Canada)||||","Production":"Atlantic City was filmed on location in and around Atlantic City and South Jersey, Philadelphia, and New York. Although filmed in the United States, the film was a co-production between companies based in France and Canada. Aside from Burt Lancaster, Susan Sarandon, and local extras, most of the cast originated from Canada or France. The film allowed Canadian actors such as Kate Reid and Al Waxman to successfully transition into American film and television roles.The production companies allotted Louis Malle the money to make a film with the stipulation that it be made before the year 1979 ended. Malle had a difficult time finding the right script to direct and with time running out his then girlfriend Susan Sarandon suggested using a story written by her friend John Guare, a playwright most notable for his plays House of Blue Leaves and Six Degrees of Separation. Guare suggested that the story take place in Atlantic City, which was still for the most part suffering from the urban deterioration that prompted the legalization of gambling as a solution to save the city. The three met over dinner in early 1979 to work out quirks in the script and began shooting within a few months.Principal photography commenced on October 31, 1979 and moved swiftly along finishing by December 30, 1979 just in time for the end of the year (a few exterior and location shots were filmed until January 5, 1980). Malle filmed at an opportune time in that he was able to capture old Atlantic City: gambling was still in its early stages there, with only two casino hotels open (Resorts and Caesars; Bally's Park Place would open on December 30, toward the end of the principal photography). Most of the city's old resorts and entertainment piers were still standing, albeit in a severe state of disrepair. Within a couple of years of the filming, most of these old hotels would fall victim to the wrecking ball as they were replaced with new casinos. To frame the picture, Malle foreshadows the great transition of the famous resort town in the opening credits by featuring footage of the implosion of the once-grand and historic Traymore Hotel on the Atlantic City Boardwalk.Louis Malle hired composer Michel Legrand to write a score for the film, which he did. In the end, however, Malle decided against using a score for the film, and opted for all the music in the film to be ambient: the only music used is that which exists in the world of the characters (i.e. radios, musical instruments, etc.). The music that Susan Sarandon's character plays from her tape player is the aria \"Casta Diva\" from Vincenzo Bellini's opera Norma.The opening shot of the old Traymore Hotel being demolished is shown to convey the notion that the city's old hotels were being demolished to make way for the new casinos. However, the Traymore was in fact demolished in 1972,[2] years before the gambling referendum passed in New Jersey. The referendum passed in 1976 and the first hotel to open up was Resorts, formerly the Chafonte-Haddon Hall, in 1978.When Dave and Chrissie are seen hitchhiking into Atlantic City from Philadelphia, they pass a large model elephant on their way into town. The elephant, named Lucy, was a tourist attraction built in 1881 to lure potential land buyers to South Atlantic City (now called Margate), a small town south of Atlantic City. Left to deteriorate over the years, and on the brink of demolition in 1971, the residents of Margate raised the money to have it restored. Today, Lucy still stands in Margate and is on the National Register of Historic Places.The club where Dave and Lou meet was the famed Club Harlem which opened in 1935 on Kentucky Avenue, and was the premier nightclub for black tourists visiting Atlantic City. The club would open and close frequently from 1968 on, and eventually closed for good by the end of the eighties. It was torn down in 1992. Scenes were also shot in the Knife and Fork Restaurant and White House Subs, both famous Atlantic City landmarks.","produced_by":"Denis Héroux John Kemeny","starring":"Burt Lancaster Susan Sarandon Kate Reid Robert Joy Hollis McLaren Michel Piccoli Al Waxman","running_time":"104 minutes","music_by":"Michel Legrand","edited_by":"Suzanne Baron","written_by":"John Guare","budget":"$7.2 million"}