{"country":"United States Canada (Filming locations)","distributed_by":"PolyGram Filmed Entertainment","screenplay_by":"Stephen White","story_by":"Stephen White Sheryl Leach Dennis DeShazer","Plot":"Cody (Trevor Morgan), his sister Abby (Diana Rice), their best friend Marcella (Kyla Pratt), and their baby brother Fig are dropped off by their parents for a visit at their grandparents' farm. As Cody is believing that there may be nothing to do at the farm, Abby and Marcella rub a Barney doll in his face. Cody loses his patience and starts a game of \"keep-away\" by taking the Barney doll and running off with it. The two girls go after Cody, who hides the Barney doll in the shower in the bathroom. The girls catch up with Cody, who tells them to use their imagination and laughs when he thinks that nothing happened. However, the doll comes to life as Barney the Dinosaur takes the girls to play in the barn. Cody refuses to believe in Barney at first, claiming that imagination is just for kids and that real dinosaurs neither talk, nor laugh.That night, Cody takes advice from Barney and wishes for a real adventure for that summer, and to do something no one has ever done before. A shooting star deposits a large colorful egg in the barn which Cody discovers in the morning. Barney and the kids go to tell the grandparents about this, but Barney is distracted by Fig's crying. Grandma suggests to Abby and Marcella that they go see Mrs. Goldfinch. Cody finds Barney who has just changed Fig's wet diaper and takes him to see his grandparents. However, Abby and Marcella take Cody and Barney to see Mrs. Goldfinch, who tells them that the egg is a dream maker. Cody accidentally knocks the egg off the table which lands on a birdseed truck. Barney and the others try to recover it through a parade as the egg narrowly avoids being stomped or cracked by the parade's participants as the egg's five colors begin to reveal itself, one color at a time. Barney's friend B.J. catches it when it almost lands on the ground, but accidentally tosses it away. Barney and the gang chase the egg throughout a French restaurant, a circus, and fly through the sky on an airplane to continue their pursuit of the egg which is in a hot air balloon. All the while, Baby Bop is looking for her yellow \"blankie.\" B.J. and Baby Bop arrive just in time to see the egg hatch.After they return the egg to the barn, it finally hatches into a koala-like being named Twinken who shows everyone Abby's dream and then Barney's. Cody apologizes to Barney for being mean and admits that he thinks he's cool. Barney accepts his apology and tells Cody that he thinks he's cool too and the two share a hug. Twinken shows everyone a magical fireworks display which lands in Barney's arms. Barney begins to sing \"I Love You\", and everyone else sings with him. Baby Bop gets sleepy, which prompts B.J. to decide that they are ready to go home. The film ends with Twinken sitting right next to Barney, who has reverted to his doll form.","language":"English French","box_office":"$12,218,638","cinematography":"Sandi Sissel","production_company":"Lyons Partnership Lyrick Studios","directed_by":"Steve Gomer","release_dates":"April 3, 1998 (1998-04-03)|||||","produced_by":"Sheryl Leach","starring":"George Hearn Shirley Douglas Trevor Morgan Kyla Pratt Diana Rice Jeff Ayers Jeff Brooks Julie Johnson David Joyner Bob West Patty Wirtz","running_time":"76 minutes","music_by":"Van Dyke Parks (Credited only in trailer)","edited_by":"Richard Halsey","Release":"The film received overwhelmingly negative reviews from film critics. On Rotten Tomatoes, the film currently has a \"Rotten\" score of 26%, based on 23 reviews with only 6 fresh reviews, and a rating of a 4.2 out of 10.[2] It was nominated for two awards at the 19th Golden Raspberry Awards: \"Worst New Star\" and \"Worst Original Song\", but lost to An Alan Smithee Film: Burn Hollywood Burn, though the former award was tied with Ringmaster.In its limited release weekend, the film grossed $2,203,865 and ranked #11.[3] A week later, in wide release, it grossed $1,382,373 and ranked #15.[4] By the end of its run, the film grossed $12,218,638 in the domestic box office, almost returning its $15 million budget.[5]The movie was released on both VHS & DVD in late 1998.","barney's_great_adventure":"Theatrical release poster","budget":"$15 million"}