{"directed_by":"Nino Manfredi","country":"Italy","distributed_by":"Cineriz","release_dates":"May 18, 1972 (1972-05-18)","Plot":"A qualified surgeon is urgently called by a party in a small and inadequate private hospital to operate a man in critical condition because of a suicide attempt. This is the protagonist of the film, Benedict Parisi, whose first name seems prophetic of his story. In the waiting room is the companion Joan Micheli, pregnant with him, which—Benedict being alone in the world—gives consent to the risky operation. Her mother, Immaculate, however, hovers in the wings like a vulture, hoping he will die, because she aspires to marry Giovanna off to a lawyer friend of the family, as a better social and economic proposition. The narrative is interwoven with flashbacks to the early life of Benedict. He is an orphan, a lively lad growing up in village in Ciociaria, under the tutelage of a maiden aunt who is filled with religious scruples, though given to libertine assignations, with which she indoctrinates him. The child is sleepless at night, because of noises from his aunt's room, which is visited by local men: his aunt instead tells him that the noises are a matter of remorse for his bad habits, and he is overcome by guilty feelings resulting from his repressive environment. When the day of his first communion nears, for which he prepares with accentuated religious devotion, he, with the other communicants, is given an effigy of \"celestial friends,\" saints who are expected to assist them until they embrace Jesus. Benedict receives the effigy of Saint Eusebius. On that very night the boy is awoken by noises - one of the aunt's lovers, Giovanni, happens to be visiting. He runs to his aunt's room, and she hides the man in her closet. But the intruder's presence is soon revealed, and the aunt papers over his presence in her room by claiming that in fact Giovanni is St Eusebius. Benedict is told not to inform the priest of what happened, -to do so would only offend the \"celestial friends\" by what would be a sin of pride. The next morning, while he is affixing a picture of St Eusebius in her wardrobe to commemorate the occasion, he has a glimpse of his aunt, who returns from the bath, in a state of nakedness. She discovers him, and warns him not to say anything to the priest, even in the confession which will be the prelude to his first communion. This prohibition leads to him refraining from telling all of his 'sins' in confession to Father Quirino, and, ashamed by a sense that he has committed a sacrilege, during the first communion he feels that the host has stuck in his throat, and in a panic at incipient suffocation, runs away, only to slip from a wall and fall into a ravine Despite local fears that he has come to a sorry end, he emerges unharmed, and the people proclaim that he has been the beneficiary of a miracle. The boy is dressed up like the saint, and carried in procession, as though he were a veritable icon. The aunt exploits the opportunity this concatenation of coincidences affords her, by ridding herself of this troublesome burden, by sending him to the Franciscan monastery, where he then grows up to maturity.Among the friars, who take to admiring him for his simplicity and naivety, he works as a labourer. The brotherhood await for some 'sign' that will indicate his vocation in life. During a visit by a travelling salesman, Uncle Checco, h catches a glimpse in the car, of a photo of a nude woman, and the vision, together with his fantasies of being at the wheel of a vehicle that travels daily throughout the wider world of the countryside below, disturbs him. It provokes his desire, and also his fears of leaving the security of the monastery. While working in the fields one day, a schoolteacher is bitten by a snake, and pleads with him to save her. He kills the snake (symbol of the primal temptation) and, when he explains to her that the venom must be sucked out through an incision, proceeds to suck her upper calf, spitting the poison out, yet massaging her legs in a frenzy of barely disguised ardour. He has, he tells the friar in a drunken moment, found the sign they were all waiting for. He joins Uncle Checco and travels about seeling cloth and undergarments.It then becomes vendor of clothing, especially undergarments. The activity \"little debonair\" does it again collide with the ministers of God, in the same bed in which those women, attracted by new fashions, visit his truck. But Benedict, blocked by his scruples, unable to take advantage of easy opportunities that come his way as well as meeting and chatting with a beautiful village girl who had come to him at night to buy panties French and willing to pay in kind . Until, during a sleepless night, he met a pharmacist atheist, Oreste Micheli, who sympathizes with him and tries to pull him away from religious scruples and the faith itself. It also leads to a prostitute but Benedict does not consume the relationship because the woman is married. In love, loved by the beautiful daughter of the pharmacist Joan Benedict believes he has given peace to his existence. Orestes has never married the mother of Joan, Immaculate, a woman on the contrary very observant if not bigoted, that continues to threaten want to report the alleged sexual abuse that gave rise to daughter. Giovanna, as Benedict is a virgin, is rather close to the ideas of his father, and leads the young man to overcome his resistance and finally get rid of her sexual inhibitions. But he is torn between the desire to marry, a decision welcomed by the mother, and the sympathy for the ideas of Orestes. When you finally decide to get married at the crucial moment Benedict hesitate to assent to the formula Giovanna bed and is in its place no answers. The two young men, by mutual agreement, give birth to live together as husband and wife for six years. Shortly after the discovery of the pregnancy of Joan, Orestes has a heart attack. In the absence of Benedict, Immaculate Conception, the mother of Joan, torpor of takes advantage of the imminent death of Orestes to give him the last rites. The pharmacist atheist, dying, without gloss, kiss the crucifix which the priest approaches the lips. Benedict arrives in time to witness the scene and shocked by the alleged conversion of his beloved \"father\" runs away and tries to commit suicide by jumping off a cliff over the sea. Conducted in the hospital, will be saved, then abruptly ridestandosi the words of the professor-surgeon who says the evidence of success of the operation: \"It was a miracle!\"","produced_by":"Angelo Rizzoli","starring":"Nino Manfredi Mariangela Melato","running_time":"122 minutes","language":"Italian","music_by":"Guido De Angelis","written_by":"Nino Manfredi Piero De Bernardi Leonardo Benvenuti Luigi Magni","cinematography":"Armando Nannuzzi"}