{"based_on":"Deadline at Dawn 1944 novel  by Cornell Woolrich","deadline_at_dawn":"Theatrical release poster","country":"United States","distributed_by":"RKO Pictures","screenplay_by":"Clifford Odets","DVD release":"Warner Bros. released the film on DVD on July 13, 2010, in its Film Noir Classic Collection, Vol. 5.[3]","Plot":"U.S. Navy sailor Alex Winkley (Bill Williams) wakes up from a night of drinking in New York City and finds he has a wad of cash. His memory is hazy, but he knows he got it from a woman he had visited earlier in the evening, Edna Bartelli (Lola Lane).With the help of dance hall girl June Goth (Susan Hayward), he attempts to return the money, only to find out that the woman is dead. The sailor isn't sure if he's the killer or not. Alex and June, along with a philosophical cabbie (Paul Lukas), stay up all night, attempting to solve the murder mystery before the sailor has to catch a bus to the naval base in Norfolk, Virginia, in the morning. Their deadline is at dawn.During the film, there are many false leads and red herrings involving a blind piano player named Sleepy Parsons (Marvin Miller) and a young couple. Bartelli had been in the business of blackmailing men with whom she had had affairs, so there are many possible suspects. The woman's brother Val (Joseph Calleia) adds a touch of menace to the plot. The surprise ending resolves all issues, including the relationship between Alex and June.","language":"English","Reception":"Film critic Dennis Schwartz somewhat liked the film, writing, \"Broadway's Harold Clurman takes his only stab at film directing, after the breakup of his Group Theatre, in this odd psychological thriller noted for its flowery dialogue and muddled story line ... It's penned by playwright Clifford Odets from a story by Cornell Woolrich. Though enjoyable by virtue of its distorted mise-en-scène, affection for NYC characters and its misplaced chatter, this is not art but run-of-the-mill film noir. Set in Manhattan, yet Deadline used no location shots but was filmed entirely in the studio's back lots. Cinematographer Nick Musuraca does a fine job creating an atmospheric scene of NYC's downtrodden and unhappy souls roaming the dark streets.\"[2]","cinematography":"Nicholas Musuraca","directed_by":"Harold Clurman","release_dates":"March 18, 1946 (1946-03-18)|||||","Production":"The dialogue contains Odets' trademark New York wisecracks. For example, while dancing at club early in the movie, the Hayward character likens the dance hall to a post office, filled with second-class matter. Edna Bartelli greets her ex-husband by saying, \"Aren't you dead yet?\"There are many \"slice of life\" characterizations of big city people in small roles, such as a tired banana salesman, an angry building superintendent, a refugee with a skin condition who has a crush on June, and a wisecracking sidewalk pitchman.Odets' Group Theatre colleague Roman Bohnen appears in a bit part, as a grief-stricken man with a dying cat.","produced_by":"Adrian Scott","starring":"Susan Hayward Paul Lukas Bill Williams","running_time":"83 minutes","music_by":"Hanns Eisler C. Bakaleinikoff","edited_by":"Roland Gross"}