{"country":"United States","distributed_by":"United Artists","screenplay_by":"Abraham Polonsky","Plot":"Charley Davis, against the wishes of his mother, becomes a boxer. As he becomes more successful the fighter becomes surrounded by shady characters, including an unethical promoter named Roberts, who tempt the man with a number of vices. Charley finds himself faced with increasingly difficult choices.","language":"English","Reception":"When the film was released, critic Bosley Crowther, praised the film, writing, \"\"Body and Soul has up and done it, with interest and excitement to spare, and we heartily recommend it in its present exhibition at the Globe ... Still [Abraham Polonsky has] written his story with such flavor and such slashing fidelity to the cold and greedy nature of the fight game, and Robert Rossen has directed it with such an honest regard for human feelings and with such a searching and seeing camera, that any possible resemblance to other fight yarns, living or dead, may be gratefully allowed.\"[4]Film critic Dennis Schwartz discussed that the film had a definite sociopolitical point of view and praised Garfield's work. He, wrote, \"Robert Rossen's Body and Soul becomes more than a boxing and film noir tale, as screenwriter Abraham Polonsky makes this into a socialist morality drama where the pursuit of money becomes the focus that derails the common man in his quest for success ... Garfield is seen as a victim of the ruthless capitalistic system that fixes everything including athletic events, as the little guy is always at the mercy of the big operator. It's the kind of liberalism that was common in the dramas made in the 1930s. It's more a film about corruption and the presence of violence everywhere in America rather than a straight boxing film ... Body and Soul viewed at this late date lacks much relevancy and now only seems gripping because of Garfield's gritty performance, and not because of the intense script that once made waves in powerful circles.[5]TV Guide's review notes \"The fight sequences, in particular, brought a kind of realism to the genre that had never before existed (James Wong Howe wore skates and rolled around the ring shooting the fight scenes with a hand-held camera). A knockout on all levels.\"[6]Francis Lyon and Robert Parrish won the Academy Award for Best Film Editing. John Garfield was nominated for Best Actor in a Leading Role, and Abraham Polonsky was nominated for Best Writing, Original Screenplay. The film was voted as the Greatest Boxing Movie Ever in 2014 by the Houston Boxing Hall Of Fame.","body_and_soul":"Theatrical release poster","box_office":"$3,250,000 (US rentals)[2] $4,700,000 (total)[1]","cinematography":"James Wong Howe","production_company":"The Enterprise Studios","directed_by":"Robert Rossen","release_dates":"August 22, 1947 (1947-08-22) (premiere-United States)|||||","produced_by":"Bob Roberts","starring":"John Garfield Lilli Palmer Hazel Brooks Anne Revere William Conrad","running_time":"104 minutes","music_by":"Hugo Friedhofer","edited_by":"Francis Lyon (sup) Robert Parrish","budget":"$1,800,000[1]"}