{"based_on":"Characters  by Robin Harris","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Reginald Hudlin","Background":"In the original act, Robin's prospective girlfriend, Jamika, asks him to take her and her son to Disneyland, but when he agrees she shows up with four kids, three of whom are the children of her friend, Bébé, whom Jamika refuses to judge.Bébé's kids are rambunctious, misbehaved, and violent troublemakers. They terrorize park staff, cut off Donald Duck's feet, try to steal Robin's 8-track/radio while he's listening to it, and make a general menace of themselves, literally destroying the park. Their reputation is so bad that even the police refuse to mess with them. In the second act, Robin is picked up from a bar by his girlfriend and the kids, who make him take them to Las Vegas. Pee-Wee pulls out a power cord and the city's power goes out.[3]The film made a few changes to the original story, reducing the number of Bébé's kids from four to three (with the fourth depicted as Jamika's son instead) and moving the location from Disneyland to a generic amusement park named \"Fun World,\" which is completely demolished by the kids' antics. Also, the film was heavily toned down in content to make it more appropriate for family viewing, although it still got a PG-13 rating for mild language and rude humor.","Plot":"The film is based on a stand-up routine by Robin Harris that is shown in a brief live-action segment at the beginning of the film.The story begins with an animated version of Harris woefully recounting his troubles to a blind bartender. He traces his problems all the way back to Jamika, an attractive woman he met at a funeral. Outside the premises, Robin approaches Jamika and asks her out. Jamika picks up her mild-mannered son, Leon, from the babysitter and invites Robin to come along with her to an amusement park named Fun World, to which Robin agrees. The next day, Jamika introduces Robin to Kahlil, LaShawn, and Pee-Wee, the neglected truant children of her absentee hedonistic friend, Bébé, for whom Jamika serves as an obliviously politically correct enabler. All six travel to Fun World, but are confronted by security before they can enter, and warned they are being watched. Upon entering the park, the kids are set loose and promptly wreak havoc. Robin's disastrous outing is further disrupted by a chance encounter with his ex-wife, Dorthea.After going on a couple of rides with the kids, Robin and Jamika let the kids go off on their own again as they attempt to enjoy a ride through the Tunnel of Love, where Jamika commends Robin for his endurance. While Robin and Jamika spend time together on their own, Leon tries to fit in with Bébé's kids but is unsuccessful. The kids then resume their trouble until they are caught by security. However, they escape from the security's trap and convince a bunch of other kids to spread the chaos. Meanwhile, Dorthea and her friend Vivian attempt to sabotage the growing relationship between Robin and Jamika but are thwarted by Robin.Elsewhere, in an abandoned building, Leon and Bébé's kids are captured by robot versions of the Terminator, Abraham Lincoln, a bear, and Richard Nixon, and are put on trial. The \"Terminator\" acts as the judge who decides whether the kids are worth sending to the electric chair, while \"Lincoln\" acts as the kids' defense attorney and \"Nixon\" as the prosecutor. The kids win their freedom through the power of rap, then celebrate their victory by stealing a pirate ship and crashing it into an ocean liner, tying up the crew and passengers.Robin and Jamika finally leave Fun World with the kids who have destroyed the park. When a cop drives by, Robin tries to get his attention, but the kids glare at the cop threateningly and he flees after yelling, \"Uh oh, those are Bébé's Kids!\" (a line spoken by several other characters).Robin drops the kids off at their apartment, where he sees how they really live. Bébé is not home and has left a note on the empty refrigerator, expecting Jamika to feed the kids. Back at the bar, Robin has a change of heart and goes back to the apartment to hang out with the kids a little while longer. Later, the kids force him to take them all to Las Vegas, where the kids are recognized, and everyone runs away screaming. Pee-Wee pulls a plug out of a socket, causing a blackout.","language":"English","Reception":"The film received generally negative reviews from critics but was well received by audiences.[4][5][6] It currently holds a 25% \"Rotten\" rating on Rotten Tomatoes.[7]Bébé's Kids did not perform well theatrically.[8]From an unknown, but most likely small, budget, Bébé's Kids earned a total $8,442,162 in North America.[9] The film opened at #7 with $3,010,987 in its opening weekend (7/31–8/2), behind Death Becomes Her, Honey, I Blew Up the Kid, Mo' Money, A League of Their Own, Buffy the Vampire Slayer, and Sister Act.[10][11][12]","box_office":"$8.4 million","production_company":"Hyperion Pictures Collingswood O' Hare Entertainment Character Builders Wang Film Productions[1]","directed_by":"Bruce W. Smith","Home media":"Bébé's Kids was released on DVD on October 5, 2004. The original theatrical and home video release were preceded by the short, Itsy Bitsy Spider.[13] This title (including the Itsy Bitsy Spider short) was also released on Laserdisc in March 1993.","Video game":"The film was later adapted into a poorly reviewed[14] video game for the Super NES in 1994.","bébé's_kids":"Theatrical release poster","narrated_by":"Faizon Love","release_dates":"July 31, 1992 (1992-07-31)|||||","produced_by":"Reginald Hudlin Willard Carroll Thomas L. Wilhite","starring":"Faizon Love|Nell Carter|Myra J.|Vanessa Bell Calloway|Tone Lōc|Wayne Collins|Jonell Green|Marques Houston|","running_time":"72 minutes","music_by":"John Barnes","edited_by":"Tim Ryder (Documentary segment) Lynne Southerland"}