{"country":"Argentina United States","distributed_by":"New World Pictures","Legacy":"The film is noteworthy for launching the career of Lana Clarkson, who became a recognizable cult celebrity in the genre. Clarkson would go on to work with executive producer Roger Corman on the films Barbarian Queen and Barbarian Queen II: The Empress Strikes Back, and guest star in an episode of the television show Black Scorpion.The video version of the film became a staple during the fledgling days of cable television and video rentals.","Plot":"The warrior Deathstalker is sent by a witch on a quest to find a chalice, an amulet, and a sword, two of which are held by the wicked sorcerer Munkar (Bernard Erhard). Deathstalker finds the sword almost immediately, which has been hidden by the witch in a cave guarded by an ogre and an imp. The imp Salmaron reveals himself to be a thief cursed by the witch and aids Deathstalker in defeating the ogre. Deathstalker removes the curse from Salmaron and the thief agrees to accompany Deathstalker on his journey. Sword in hand, Deathstalker sets out to Munkar's castle to gain the remaining objects of power.On his journey, Deathstalker learns of a tournament from Oghris (Richard Brooker), a charming warrior in midriff-baring armor. Munkar has invited warriors across the land to participate in contests until a winner is determined - the winner will inherit Munkar's kingdom. One night along the way to the tournament, the pair meet Kaira, a defiant female warrior (Lana Clarkson) who wears only a G-string and a cloak to conceal her large breasts. Later that night Deathstalker forcibly removes Kaira's skimpy outfit and has passionate sex with her. Salmaron looks on with amusement as Kaira's moans of pleasure echo through the night. Kaira joins the group on their journey the next morning.Munkar reveals to his assistant that his true agenda is for the warriors to fight each other to the death until only a weakened survivor remains for Munkar to kill. This would remove all threats to his rule. Arriving at Munkar's castle, Deathstalker and the other participants gather in Munkar's banquet room the night before the tournament. The warriors are invited to get drunk and rape Munkar's harem slaves, including Princess Codille (Barbi Benton). Oghris connects with one slave girl while Kaira keeps Deathstalker to herself. Deathstalker rescues Princess Codille, briefly, but Munkar takes her back. Munkar transforms his assistant into the likeness of the Princess and sends him to kill the hero; when Deathstalker attempts to rape Codille, he discovers that the woman is not all \"woman\" and sends her away. Kaira finds the assassin; assuming she is the real Codille, she is tragically killed by the assassin in a sword fight after Munkar's disguise spell wears off.The night after the first day of the tournament, Oghris is taken by Munkar's men to a prison cell while Salmaron is attacked by prison guards. The thief is knocked into a well that leads to Munkar's harem. It is revealed that Oghris brought Deathstalker to the tournament expressly for Munkar and he is ordered to kill him. Reluctant to kill his friend, Oghris warns Deathstalker and asks the hero to just leave the tournament but Deathstalker refuses and attacks him. During the brawl, Oghris has the chance to draw the sword and kill Deathstalker but chooses to fight fairly and ultimately loses. Deathstalker says goodbye to the fighter and kills him.The last day of the tournament arrives and there are only two competitors left - Deathstalker and an ogre. After a long fight, Deathstalker kills the ogre and moves to claim his prize. He is attacked by Munkar's men but makes his way to the amulet. Salmaron is discovered in the harem room but frees the women and helps them slay the guards. Deathstalker defeats the holder of the amulet and faces Munkar; he is able to defeat the sorcerer's illusions and claims the third object of power. Deathstalker declares he has no interest in Munkar's power or kingdom - he destroys the three objects of power and throws Munkar to a crowd of slaves who tear him apart.","language":"English","Reception":"Deathstalker was a modest hit at the box office, and its success was mostly due to its release at a time when Conan the Barbarian was creating a market for sword and sorcery films. Nevertheless, because the film was made on a tight budget, it proved to be a commercial success in the main, and encouraged Roger Corman and Argentinian producer/director Hector Olivera to collaborate again to produce Barbarian Queen, with Lana Clarkson in the title role.","box_office":"$11,919,250 (USA)[1][2]","deathstalker":"Promotional film poster","cinematography":"Leonardo Rodríguez Solís","production_company":"Aries Cinematográfica Argentina Palo Alto","directed_by":"James Sbardellati (as John Watson)","release_dates":"September 2, 1983","produced_by":"Roger Corman (executive producer) James Sbardellati (producer)","starring":"Richard Hill|Barbi Benton|Richard Brooker|Lana Clarkson|","running_time":"80 min.","Sequels":"Three sequels were released. They are Deathstalker II, Deathstalker and the Warriors from Hell, and Deathstalker IV: Match of Titans.","music_by":"Óscar Cardozo Ocampo","edited_by":"John K. Adams Silvia Ripoll","written_by":"Howard R. Cohen","budget":"$457,000 (estimated)"}