{"country":"United States","distributed_by":"Image Entertainment","Plot":"Vaughn Ely is a beloved native of a small Texas town with a dark secret. Formerly the star quarterback, now he's the local mortician. When Ely discovers that his wife Rosemary is cheating on him with the high school English teacher's husband, David Moore, he makes sure they can't do it again. First, he kills Rosemary, but he does not bury her body. Instead, he hides it in his house and dances with the body each night, as though she's still alive. Second, he chases down her lover while he's out jogging at night and buries him alive in Rosemary's empty grave.Two years later, four high school kids, Travis, Danny, Brian and his girlfriend Abby think they see a ghost in Ely's window when they see Ely dance with his wife's body. They assume since Ely's van is gone, that he is not home. They sneak inside and see what is going on. Enraged, Ely chases them down the stairs and grabs Danny before he can get away. Travis rushes back inside just in time to see Ely shove Danny down the stairs. Ely taunts Travis as he breaks Danny's neck. Ely declines to press charges against the teens, and the police do not believe Travis' accusations.Travis and Abby become determined to find proof to support that they are telling the truth, that Ely is crazy, and that he killed Danny. When they break into Ely's house a second time, Ely captures Abby and hides her unconscious body in a casket buried in his backyard. As Travis escapes, Ely shoots and wounds him. At the hospital, the doctor notifies the police, and they keep Travis under guard. Travis recruits Brian to help him escape, and while the police chase after Brian, who they think to be Travis, Travis returns to confront Ely and free Abby.Ely captures Travis and takes both teens to the cemetery, where he intends to bury them alive. On the way, Travis urges Abby to save herself and promises to catch up with her. While Ely forces Travis to dig his own grave, Abby frees herself and flees, only to return to rescue Travis. Abby dresses in Rosemary's clothes and berates Ely for his part in killing her. Ely's grip on his sanity, already tenuous, falters. While Ely argues with Abby-as-Rosemary, Travis sneak attacks him and Abby knocks him out before they bury him alive. The two then walk back to town to get the Sheriff. Ely is rescued from the grave but ends up in an insane asylum. Inside his cell, he proclaims that love sucks while looking into the camera, thus breaking the fourth wall.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 5% of 22 surveyed critics gave the film a positive review; the average rating is 3.4/10.[5] John DeFore of The Hollywood Reporter wrote, \"Beneath the Darkness is a teens-in-trouble thriller with barely enough momentum to make it to the end credits\" and that \"it's clear nobody in the production has any interest [in making a pulpy fun movie]\" and \"the screenplay is too proud of its going-nowhere literary allusions\".[6] Lou Lumenick of the New York Post wrote, \"Even Dennis Quaid's uncharacteristic hamming as a mad mortician in a small Texas town can't save this silly, scare-free horror film briefly haunting theaters en route to entombment on home video.\"[7] John Anderson of Variety described it as \"a malformed, would-be horror shocker with a deliriously deranged performance by Dennis Quaid, who unfortunately seems to be the only one onboard who thinks he's in a comedy.\"[8] Neil Genzlinger of The New York Times wrote, \"There is not an original thought in this story\".[9]","box_office":"$9,600[1]","cinematography":"Massimo Zeri","production_company":"Sunset Pictures","directed_by":"Martin Guigui","release_dates":"October 22, 2011 (2011-10-22) (AFF)|January 6, 2012 (2012-01-06) (United States)||||","Production":"Shooting took place in Smithville, Texas, over a period of 20 days.[3] Local schools were used as locations, and the filming included a local festival.[4]","produced_by":"Ronnie Clemmer","starring":"Dennis Quaid|Tony Oller|Aimee Teegarden|","running_time":"92 minutes","beneath_the_darkness":"Film poster","music_by":"Geoff Zanelli","edited_by":"Eric Potter","Release":"The film had a limited theatrical release starting January 6, 2012. The film was released on DVD February 28, 2012.[1]","written_by":"Bruce Wilkinson","budget":"$7 million[citation needed]"}