{"country":"Australia","distributed_by":"First Look Pictures","screenplay_by":"Andrew Dominik","story_by":"Mark \"Chopper\" Read","chopper":"Theatrical release poster","Plot":"In and out of jail since he was 16, Melbourne standover man Mark Brandon \"Chopper\" Read (Eric Bana) is serving a 16-year sentence for kidnapping a supreme court judge to get his childhood friend, Jimmy Loughnan (Simon Lyndon), out of the notorious H Division of maximum security Pentridge Prison. To become leader of the division, he ignites a power struggle which gains him more enemies than admirers. Eventually, even his gang turn their backs on him and Loughnan stabs him several times in a failed assassination attempt. Chopper voluntarily has his ears cut off by a fellow inmate in order to be transferred out of the H Division; this also gains him recognition in and out of the prison.He is released in 1986, revisiting enemies and friends whom he cannot differentiate anymore. He reunites with his former girlfriend Tanya (Kate Beahan), but suspects that she is involved with one of his old victims, Neville Bartos (Vince Colosimo). He tracks Bartos down, shoots him and takes him to the hospital, unabashedly claiming that he has a \"green light\" courtesy of the Police \"to exterminate scum\". When Chopper learns that he is now the target of a death-contract, he goes after his old friend Jimmy, only to find him worn out and poverty stricken by drugs with a daughter and a junkie fiancée who is pregnant with another child.He kills a criminal known as Siam \"Sammy the Turk\" Ozerkam at a bar, but gets away with it by claiming it was self-defence. He eventually ends up back in prison where he writes a book about his experiences in the Melbourne underworld. The book becomes a best-seller and Chopper becomes a criminal legend.The film ends with Chopper in his prison cell in 1992, watching himself being interviewed on television. He is proud of the interview among those watching with him, but when they leave he goes quiet and the film ends with him sitting in his cell alone.","language":"English","Reception":"Chopper was received with positive reviews. Review-based rating site Rotten Tomatoes gave the film a 71% \"Fresh\" rating.[1] Roger Ebert of the Chicago Sun-Times gave the film 3 stars out of 4, praising Eric Bana for his performance, saying, \"He has a quality no acting school can teach and few actors can match.\"[2]Margaret Pomeranz for SBS gave the film four-and-a-half stars out of five, commenting that what director Andrew Dominik \"achieved is extraordinary.\" David Stratton, in the same review, remarked \"there's no doubting the intelligence of Andrew Dominik's direction\" and declared Eric Bana's performance as \"astonishing.\" [3]Read himself suggested that Bana play him, after seeing the actor in the sketch comedy series Full Frontal. Bana spent two days living with Read to help him practise for the role. Read later praised Bana's performance on the 20 to 1 episode Great Aussie Films, where Chopper came 17th. Several of Bana's meetings with Read can be viewed in the DVD Special Features.","cinematography":"Geoffrey Hall Kevin Hayward","production_company":"Australian Film Finance Corporation Mushroom Pictures Pariah Entertainment Group","directed_by":"Andrew Dominik","release_dates":"3 August 2000","Production":"The biggest production difficulty was being allowed to use the Pentridge Prison in Coburg, Victoria for the shooting. The prison was being closed down and while the negotiations were underway, the funding for production was delayed. This put off the starting of the shoot.To show the sterility of the prison and to contrast it with the world that Chopper encounters after leaving prison 16 years later, the production was split into two. The first part, filmed at the H Division of Pentridge Prison, one of the actual prisons that Chopper frequented, was as plain and sterile as could be and all the scenes in the second part, taking place in 1986 were overly coloured, to achieve a paranoid and agoraphobic atmosphere, called \"visual overload\" by the director Andrew Dominik. This was attained by lighting, choice of film stock used and colours chosen for set decoration. Part one of the production ran from 3 May until 26 May with part two continuing from 28 June until 21 July 2000.Some extras were hired from former inmates and tattoo parlors. Bana spent two days with Chopper to gain an insight into the role he was to play and many of Chopper's friends, enemies and old associates were interviewed.","produced_by":"Michele Bennett","starring":"Eric Bana Vince Colosimo Simon Lyndon Kate Beahan David Field","running_time":"94 minutes","music_by":"Mick Harvey","edited_by":"Ken Sallows"}