{"country":"United States","distributed_by":"American International Pictures","Plot":"Nurse \"Coffy\" Coffin (Pam Grier) seeks revenge for her younger sister's getting hooked on drugs and having to live in a rehabilitation home, a product of the drug underworld, mob bosses, and a chain of violence that exists in her city. The film opens with Coffy showing her vigilante nature by killing a drug supplier and dealer. She does this without getting caught by using her sexuality as an attractive and athletic woman willing to do anything for a drug fix.She lures the men to their residence, which gives her the privacy to kill both. After the killings, Coffy returns to her job at a local hospital operating room, but is asked to leave when she is too jumpy when handing tools to the surgeon.The film introduces Coffy’s police friend Carter (William Elliott), who used to date Coffy in their younger years. Carter is portrayed as a straight-shooting officer who is not willing to bend the law for the mob or thugs who have been bribing many officers at his precinct. Coffy doesn't believe his strong moral resolve until two hooded men break into Carter's house while she's there and beat Carter severely, temporarily crippling him. This enrages Coffy, giving her further provocation to continue her work as a vigilante, killing those responsible for harming Carter and her sister.Coffy's boyfriend Howard Brunswick (Booker Bradshaw) is a city councilman who appears to be deeply in love with Coffy at the beginning of the film. Coffy admires Brunswick for his body as well as his use of law to solve societal problems. She is very happy when he announces his plan to run for Congress, and his purchase of a night club. The two share a passionate love scene in the first part of the film.Coffy's next targets are a pimp named King George (Robert DoQui), who is supposedly one of the largest providers of prostitutes and illegal substances in the city, and Mafia boss Arturo Vitroni (Allan Arbus).Coffy questions and abuses a former patient of hers who was a known drug user to gain insight into the type of woman King George likes and where he keeps his stash of drugs. This is the first scene where Coffy brutalizes another woman and shows no remorse because the former patient is using drugs again and thus a societal deviant. Coffy quickly goes to a resort posing as a Jamaican woman looking to work for King George.George is quickly interested in her exotic nature and asks her to come with him back to his house to experience Coffy himself first. One of the prostitutes returns from a far away job and gets disgruntled and jealous when seeing George taking such a liking to Coffy. At a party later that day Coffy and the other prostitutes get into a massive brawl, which entices mob boss Vitroni and he demands that he have her tonight.Coffy prepares herself to murder Vitroni and just when she is about to shoot, is overtaken by his men. She lies and tells Vitroni that King George ordered her to kill him, which makes Vitroni order George to be murdered. Vitroni's men kill George by dragging him through the streets by a noose.Coffy then discovers her clean-cut boyfriend is actually corrupt when she's shown to him at a meeting of the mob and several police officials. He denies knowing her other than as a prostitute and Coffy is sent to her death. Once again, Coffy uses her sexuality to seduce her would-be killers. They try injecting her with drugs to sedate her, but she had switched these out for sugar earlier. Faking a high, she kills her unsuspecting hitmen with a pointed metal wire she fashioned herself and hid in her hair.Running to avoid capture, Coffy carjacks a vehicle to escape. Coffy drives to Vitroni's house, murders him, and then goes to Brunswick's to do the same. He pleads for forgiveness and just as she is about to accept, a naked white woman comes out of the bedroom. At this, Coffy shoots Brunswick in the groin. The film then closes with Coffy being satisfied at having avenged her sister and Carter.","language":"English","Reception":"The movie received a mixed reception.[6] Karen Ross wrote that it \"let black audiences enjoy the sight of heroes kicking the white system and winning even while condemning the violence and recognized the implausibility. It allowed blacks the ultimate escape to cheer on the heroine that fought corruption and crime and then leave the theatre to be blighted by the racism in society.\"[7] In contrast, critic Roger Ebert praised the film for its believable female lead and noted that Grier was an actress of \"beautiful face and astonishing form\" and that she possessed a kind of \"physical life\" missing from many other attractive actresses.[8] Grier subsequently played similar characters in the AIP films Foxy Brown (1974), Friday Foster, and Sheba, Baby (both 1975).The film is a favourite of Quentin Tarantino, and he ranks it high among his top 20 best films.[9] He later hired Grier for Jackie Brown in 1997, a film with clear inspiration from films like Coffy and Foxy Brown. Tarantino said of the film poster: \"Not only is it a great image of Pam Grier, it's got great type — it's the epitome of a great exploitation poster...and every version of it in foreign countries rocked\".[9]By 1976 Variety estimated the film had earned $4 million in rentals.[10]","box_office":"$2 million (rentals)[2][3]","directed_by":"Jack Hill","release_dates":"June 13, 1973 (1973-06-13)|||||","Production":"According to writer/director Hill, the project began when American International Pictures' head of production, Larry Gordon, lost the rights to the film Cleopatra Jones after making a handshake deal with the producers. Gordon subsequently approached Hill to quickly make a movie about an African American woman's revenge and beat Cleopatra Jones to market. Hill wanted to work with Pam Grier, whom he had worked with on The Big Doll House (1971). The film ended up earning more money than Cleopatra Jones and established Grier as an icon of the genre.[citation needed]Coffy is notable in its depiction of a strong female lead (a capable nurse), something rare in the genre at the time, and also in its then-unfashionable anti-drug message. It was remade with an all-white cast as Lovely But Deadly (1981).[citation needed]","produced_by":"Robert Papazian","starring":"Pam Grier Booker Bradshaw Robert DoQui William Elliott Allan Arbus Sid Haig","running_time":"91 min.","music_by":"Roy Ayers","written_by":"Jack Hill","budget":"$500,000[1]"}