{"country":"United Kingdom","distributed_by":"Anglo-EMI Film Distributors Ltd./MGM-EMI (UK)","Plot":"The film begins by recapping the events of the previous film, following Dr. Anton Phibes' murderous quest for vengeance against the doctors he blamed for the death of his wife, Victoria. Phibes eluded capture by placing himself in suspended animation in a sarcophagus he shares with the body of his wife, where he would lay in darkness until the moon had entered into proper alignment with the planets, which had not occurred in over two thousand years. Three years later, the conjunction occurs, and Phibes rises from his sarcophagus. Summoning his silent assistant Vulnavia (Valli Kemp, replacing Virginia North), Phibes prepares to take Victoria to Egypt; there, in a hidden tomb, flows the River of Life, promising resurrection for Victoria and eternal life for the two of them. Rising from his basement, Phibes is shocked to discover that his house has been demolished, and a safe containing a papyrus scroll, showing the way to the River of Life, is now empty.Phibes knows of only one person who could be seeking the same goal: Darius Biederbeck (Robert Quarry), a man who has lived for centuries through the use of a special elixir. After translating the papyrus, Biederbeck prepares to travel to Egypt to find the River of Life for himself and his lover Diana (Fiona Lewis). Phibes and Vulnavia enter Biederbeck's house, kill his manservant and reclaim the papyrus, then they leave for Southampton to sail to Egypt. Biederbeck travels with Diana and his assistant Ambrose (Hugh Griffith) on the same boat; Ambrose is killed by Phibes when he finds Victoria's body in the hold, and his body is stuffed in a giant bottle and thrown overboard. Inspector Trout (Peter Jeffrey) discovers Ambrose's body when the bottle washes ashore near Southampton. He and Superintendent Waverley (John Cater) question the shipping agent for the boat; upon hearing the descriptions of the tall woman (Vulnavia) and a clockwork band being brought aboard, they realize that Phibes has returned.Trout and Waverley pursue him. They catch up to Biederbeck's archaeological party near the mountain location of the hidden temple. Phibes, having set up residence inside the temple, hides Victoria's body in the hidden compartment of an empty sarcophagus. He also finds the silver key that opens the gates to the river. Phibes kills each of Biederbeck's men using methods inspired by Egyptian mythology: one man is killed by a hawk, another is stung to death by live scorpions. Biederbeck's team eventually breaks into the temple and takes the sarcophagus, and Biederbeck discovers the key. Phibes uses a giant fan to simulate a wind storm, while Vulnavia enters the tent with the sarcophagus and crushes the man watching over it in a giant screw press. Though the sarcophagus is retaken and Victoria's body is safe, Phibes discovers the key is gone.Biederbeck is unmoved by the murders of his men, and insists on finding the River of Life. He sends Diana with the last remaining team member, Hackett (Gerald Sim), back to England. Hackett leaves his truck to investigate a battalion of British troops, but finds they are really more of Phibes' clockwork men. When he returns to the truck, Diana is gone. As he restarts the engine, Hackett is sand-blasted to death and his truck crashes into Biederbeck's tent. Realizing Phibes must have taken Diana, Biederbeck confronts Phibes. Phibes demands the key in exchange for Diana's life. Unable to break Diana free of Phibes' trap, Biederbeck surrenders the key. Phibes spares Diana's life. He unlocks the gates to the river, takes Victoria's coffin through, and locks the gates behind him. Biederbeck begs Phibes to take him along as he begins to age rapidly. Phibes ignores his pleas and sings \"Over the Rainbow\" as he fades from sight.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 50% of 10 surveyed critics gave the film a positive review; the average rating is 5.7/10.[3] In Horror Movies of the 1970s, writer John Kenneth Muir described it as \"no better or worse than its predecessor\".[4]","dr._phibes_rises_again!":"Theatrical release poster","cinematography":"Alex Thomson","production_company":"American International Pictures","directed_by":"Robert Fuest","Soundtrack":"The film score by John Gale was released on Perseverance Records 20 March 2003.","release_dates":"July 1972 (1972-07)|||||","Production":"Producer Heyward brought in Blees, as he felt Blees' sense of humour would work well with a Phibes film. Heyward said that writers Blees and Fuest did not agree on how to write the film, which forced Heyward to mediate. The ensuing debates between Blees and Fuest resulted in what Heyward said was \"a very good script\" that could be used for teaching purposes. AIP was grooming Quarry as Price's replacement,[1] and the two were rumoured to not get along well;[2] however, Heyward said he was aware of no tension between the actors on-set.[1] Vulnavia was not initially intended to return, but AIP insisted on it. Since Virginia North was pregnant at the time, Valli Kemp was cast instead.[2] The desert scenes were shot in Ibiza, Spain.[1]","produced_by":"Louis M. Heyward","starring":"Vincent Price|Robert Quarry|Peter Jeffrey|Valli Kemp|Fiona Lewis|","running_time":"88 minutes","music_by":"John Gale","edited_by":"Tristam V. Cones","Release":"AIP solicited scripts for a third film, but Heyward said they never found a suitable one.[1] Proposed titles include Phibes Resurrectus, The Brides of Dr. Phibes, and The Seven Fates of Dr. Phibes.[2]","written_by":"Robert Blees|Robert Fuest|"}