{"based_on":"Appaloosa  by Robert B. Parker","Cast":"Bob Harris, Ed Harris's father, has a small role as Judge Elias Callison.","country":"United States","distributed_by":"New Line Cinema","Plot":"In 1882, the small town of Appaloosa, New Mexico, is being terrorized by local rancher Randall Bragg (Jeremy Irons), who killed the town's marshal, Jack Bell, and two deputies when they came to Bragg's ranch to arrest two men. The town hires lawman and peacekeeper Virgil Cole (Ed Harris) and his deputy Everett Hitch (Viggo Mortensen) to protect and regain control of the town. The pair agree on one condition: that the town follow Cole's law and essentially cede control to him. The lawmen begin by confronting four of Bragg's men who are causing a disturbance in the saloon. Three men refuse to allow themselves to be arrested, forcing Cole and Hitch to kill them. The fourth man surrenders and leaves the saloon. Bragg has a meeting with Cole and Hitch, initiating a standoff.Cole meets a new arrival to the town, the recently widowed Allie French (Renée Zellweger), who has traveled west to find a new life. The two start a romantic relationship, and soon buy a house together. However, Allie is revealed to be promiscuous and attempts to seduce Hitch when they are alone. Despite having shown previous interest in her, Hitch refuses her advances out of loyalty to Cole.When one of Bragg's men tells Cole and Hitch he will testify that he witnessed Bragg gun down the marshal, Bragg is tried, convicted and sentenced to hang. Following the trial, Cole and Hitch, along with several deputies, transport Bragg via train. As the train is stopped for refueling over a bridge, hired guns Ring and Mackie Shelton (Lance Henriksen and Adam Nelson), old acquaintances of Cole, appear with Allie at gunpoint, forcing Cole to release Bragg to them.Cole and Hitch catch up with the outlaws and discover that Allie is not a hostage when they see Allie and Ring Shelton frolicking naked together in a stream. When the outlaws are attacked by Chiricahua Apache, Cole and his men force the Indians away. They then turn Bragg over to the sheriff of Beauville; unbeknownst to Cole, the sheriff is a cousin of the Shelton brothers. Knowing that Cole is determined to bring Bragg to the gallows, the Sheltons and the sheriff free Bragg and engage Cole and Hitch in a gunfight. Cole and Hitch are wounded but manage to kill Ring, Mackie and the sheriff. Bragg escapes on horseback and Cole and Hitch return to Appaloosa with Allie.Some time later, Bragg is granted a full pardon by President Chester Arthur (whom he previously claimed to have known) and returns to Appaloosa in an attempt to publicly reform himself. He buys the hotel and ingratiates himself with the locals. Privately, Bragg threatens Cole and Hitch if they should pose further problems. Hitch discovers that Allie is in a secret relationship with Bragg, and he quits his job as deputy to challenge Bragg to a duel outside. Cole attempts to stop him, but Hitch remains steadfast and asks Cole to permit the gunfight to occur. Hitch manages to fire first just before Bragg fires but Bragg's shot misses, and Hitch hits Bragg in the throat, killing him. Hitch then leaves town; his parting thoughts express his hope that Cole can find happiness with Allie.","language":"English","Reception":"On Rotten Tomatoes, Appaloosa is \"Certified Fresh\" with a rating of 77%, based on 158 reviews.[10] The consensus reads, \"A traditional genre western, Appaloosa sets itself apart with smart psychology, an intriguing love triangle, and good chemistry between the leads.\"Early reviews of Appaloosa from the 2008 Toronto International Film Festival were lukewarm. Brad Frenette of the National Post said \"the film feels double its 114-minute running time, but Appaloosa redeems itself through unexpected moments of levity, Harris's steady direction and the god amongst men, Lance Henriksen.\"[11] Frenette also said Renee Zellweger is \"mostly a bust\"[11] and Viggo Mortensen \"oozes cool.\"[11] Popjournalism reviewer Sarah Gopaul said Harris and Mortensen spend too much time talking and discussing their feelings, which she said made the film too light for the gritty Western genre. Gopaul said Ed Harris and Viggo Mortensen delivered decent performances and that Renee Zellweger's character has more depth than the traditional romantic interest in a Western.[12] The New Yorker’s David Denby called it “a well-made, satisfying, traditionalist Western with some odd quirks and turns.”[13]The film appeared on some critics' top ten lists of the best films of 2008. Ray Bennett of The Hollywood Reporter named it the 8th best film of 2008,[14] and Mike Russell of The Oregonian named it the 10th best film of 2008.[14]","appaloosa":"Theatrical release poster","box_office":"$27,665,851[1]","cinematography":"Dean Semler","directed_by":"Ed Harris","Soundtrack":"The soundtrack to Appaloosa was released on September 30, 2008.","release_dates":"September 19, 2008 (2008-09-19)|||||","Production":"Appaloosa marks Ed Harris's second outing as director, following the 2000 biopic Pollock, which he also starred in; Harris co-wrote and co-produced Appaloosa with Robert Knott.[2] The budget for Appaloosa was $20 million[3] and filming took place from October 1, 2007 to November 24, 2007 around Albuquerque and Santa Fe, New Mexico, and Austin, Texas.[4] Harris was drawn to Robert B. Parker's bestselling novel because it was constructed like a classic Western, but included crime themes still relevant to contemporary society. He purchased the rights to the novel and hired Parker to adapt his book into a screenplay.[5] Harris, who also stars as Virgil Cole, wanted to make the film in the old-fashioned style of such films as 3:10 to Yuma, My Darling Clementine and The Man Who Shot Liberty Valance, rather than a revisionist approach. Harris also acknowledged the challenge of making a successful Western movie, saying, \"You can count on one hand, or maybe half a hand, the number of Westerns that were box office successes in the recent past.\"[6] Production of Appaloosa slowed when New Line Cinema and producers became concerned with the box office prospects of a Western during a season with such anticipated blockbusters as The Dark Knight. Diane Lane originally signed on to play Allie French, but left the project when the film stalled. The movie got back on track due to the success of the Deadwood series on HBO and the film remake of 3:10 to Yuma. Renée Zellweger was signed to replace Lane.[5]Harris enjoyed working with Viggo Mortensen in A History of Violence and had him in mind for the part of Everett Hitch. While publicizing A History of Violence at the Toronto Film Festival, Harris handed Mortensen a copy of the novel and asked him to read it and consider playing the part. Harris said it was \"a totally awkward proposition, handing another actor a book like that,\"[6] but Mortensen agreed to take the part after responding well to the character and the relationship dynamic between the two characters.[6] Harris said he wanted to make the film because he was drawn to the \"unspoken comradeship\"[6] of Virgil Cole and Everett Hitch. \"Though they've been hanging out for years, they're not too intimate, but they know each other. Aside from in sports, or being a cop, I can't think of any other situation where a friendship like that is called for.\"[6] Mortensen felt similarly, saying, \"I like to ride horses, and I like Westerns, but there are a lot of bad ones. What set this one apart is just how the characters are a little more guarded.\"[6] Mortensen studied Frederic Remington drawings and other images of the American Old West to get into character and master the proper way to stand during a gunfight.[7]The DVD includes a number of bonus extra featurettes, including \"Dean Semler's Return to the Western.\" Although cinematographer Semler has been a pioneer in shooting digital movies, he was glad for this special opportunity to shoot a traditional old-fashioned Western using classic film stock technology.[8]","produced_by":"Ed Harris Robert Knott","starring":"Ed Harris Viggo Mortensen Renée Zellweger Jeremy Irons Lance Henriksen","running_time":"115 minutes","music_by":"Jeff Beal","edited_by":"Kathryn Himoff","written_by":"Ed Harris Robert Knott","budget":"$20 million"}