{"country":"United States","distributed_by":"Universal Pictures","Plot":"Three young friends and aspiring rappers, Albert (Chris Rock), Euripides (Allen Payne), and Otis (Deezer D) want to make their big break. The trio have talent, but no marketable image. In order to get their name heard, they appeal to local crime kingpin and nightclub owner Gusto (Charlie Murphy) along with his sidekick and henchman 40 Dog (Ty Granderson Jones) to ask for a spot on the bill at his club, but during a failed meeting the police rush in and throw Gusto in jail.Gusto believes that the trio set him up, swearing revenge when he is released from prison. While Gusto is locked up, Albert steals his criminal background and identity to become \"MC Gusto\", rechristening Euripides and Otis as \"Dead Mike\" and \"Stab Master Arson\" respectively. Together they form the hardcore gangsta rap group CB4 (Cell Block 4) and successfully sign with Trustus Jones, a local music mogul. CB4 becomes the hottest band on the charts with controversial hits like \"Sweat From My Balls\" and \"Straight Outta Locash,\" and their rise to fame is documented by an aspiring director (Chris Elliott) and his cameraman. However, an ambitious politician (Phil Hartman) seeks to shut them down for obscenity charges, tensions between the group arise over one member's gold-digging groupie girlfriend Sissy (Khandi Alexander) and the strain of the charade takes its toll on Albert's family life and relationship with his wholesome girlfriend Daliha (Rachel True). To compound this, the real Gusto escapes from prison and sets out to get revenge by making Albert take part in a record store robbery, exposing his face to the CCTV cameras and then taking the tape as a tool for blackmail. The group breaks up and reunites after Trustus Jones's death at the hands of Gusto. Eventually, the group set up their own sting operation with Sissy to capture Gusto and he is sent to prison for life. Albert gives up the pretense of being a gangsta, emceeing under his real name, and the group embarks on a reunion tour.","language":"English","Reception":"The movie had a mixed reception from critics, as Los Angeles Times wrote that despite CB4 having been \"one of the more adventurous of the recent African-American comedies, it still gets bogged down in those movie-movie formulas, those phony recipes for success.\"[2] The New York Times' Janet Maslin wrote that the film \"promises sharper satire than it actually delivers. Pandering a shade too avidly to the real rap audience, the film sometimes tries to use the same sexist, mean-spirited ethos it makes fun of.\"[3]The film ranked #2 at the box office with an opening weeks gross of $6,500,000 across 1,205 theatres.[4] At the end of its domestic run it had grossed a total of $17,953,778.[5]","box_office":"$17,953,778","directed_by":"Tamra Davis","Soundtrack":"A soundtrack containing hip hop music was released on March 2, 1993 by MCA Records. It peaked at #41 on the Billboard 200 and #13 on the Top R&B/Hip-Hop Albums.","release_dates":"March 12, 1993 (1993-03-12)|||||","produced_by":"Nelson George","starring":"Chris Rock Allen Payne Deezer D Khandi Alexander Phil Hartman Chris Elliott Charlie Murphy","running_time":"89 minutes","written_by":"Chris Rock Nelson George Robert LoCash"}