{"country":"United Kingdom","screenplay_by":"Ant Neely","Plot":"The film follows Stephen, a brilliant young scientist who lives in Cambridge, England, in what appears to be the 1920s. His world is turned upside down upon meeting a charismatic and inspirational professor at a garden party, who demonstrates to Stephen and his friends what life would be like if they were one-, or two-dimensional beings. He then proceeds to explain that by manipulating other dimensions, time travel may actually be possible.Soon after the professor's visit, Stephan,his cousin, Conrad, and his neighbor, Victoria, were fooling around by a well. Conrad throws Victoria's skipping rope down the well. The nanny catches the boys rolling around fighting and drags them in the house by the ears leaving Victoria alone to play outside by herself. After some time, she decides to climb down the well to get her skipping rope. She never climbs out of the well and her body is never found.As Stephen’s life unfolds, events lead him to dedicate himself to turning the Professor’s theories of time travel into reality. Jealousy, love, obsession, temptation and greed surround him, influencing his fragile mind and the direction of his work.","language":"English","cinematography":"Simon Dennis","production_company":"Sculptures of Dazzling Complexity Ltd","directed_by":"Sloane U’Ren","Music":"The original score was composed by Neely and recorded at British Grove Studios with the London Metropolitan Orchestra.","release_dates":"21 September 2011 (2011-09-21) (Cambridge Film Festival)|||||","Production":"Sloane U'Ren and Ant Neely have worked in the film industry for many years on large Hollywood films and television productions,[6] U'Ren as art director and designer with Neely as a composer and musician.[7] The couple wanted to make their own film for many years and rather than wait for a large studio to invest decided to produce the film independently, Neely said, \"We could wait for someone to come knock on our door and get old waiting, or we could just go and do it.\"[8]U'Ren and Neely sold their house to help finance the production, a move that caused some media attention in the UK.[9][10]Principal photography started on 26 July 2010 and ended on 21 August 2010.[11] Dimensions joins a small but growing list of feature films shot entirely using DSLR cameras, at times the film used three Canon 5D Mk II and a Canon 7D.The film was shot entirely in and around Cambridge, England including Downing College, Cambridge University. Sloane U'Ren and Ant Neely, along with almost all of the cast, attended the world premiere: they introduced themselves before the screening, and answered questions about the project and how it was completed afterwards.","produced_by":"Sloane U’Ren Ant Neely","starring":"Henry Lloyd-Hughes Camilla Rutherford Patrick Godfrey Olivia Llewellyn Sean Heart","running_time":"99 minutes","music_by":"Ant Neely","edited_by":"Adam Garstone","dimensions":"Title Art"}