{"based_on":"Coraline  by Neil Gaiman","country":"United States","distributed_by":"Focus Features","screenplay_by":"Henry Selick","Plot":"In the opening credits, hands made of needles are seen recreating a button-eyed doll to resemble an 11-year-old before sending it out into a void. Coraline Jones, an adventurous 11-year old, and her family move from Pontiac, Michigan, to Ashland, Oregon, into the Pink Palace Apartments, a divided mansion. The other residents include retired actresses Ms. Spink and Forcible and eccentric Russian acrobat Mr. Bobinsky. Coraline finds her new home boring, and her parents hardly pay any attention to her adventures.Coraline meets Wybourne \"Wybie\" Lovat, the grandson of the apartments' landlady, Mrs. Lovat, who has a missing twin sister. Coraline also meets a black cat that follows Wybie around. While exploring, she is given a doll that looks like her by Wybie and finds a small brick-sealed door which can only be unlocked by a small black key with a button for a handle. That night, Coraline follows a mouse through the door, where she discovers the bricks have been replaced by a long corridor. Coraline goes through it and finds herself in the Other World, which is another, smaller world. Its inhabitants have buttons instead of eyes. Her Other Mother and Other Father are more warm and attentive than her real parents, and they have dinner together before tucking her in in her Other Bedroom. To her dismay, Coraline wakes up in her real bedroom and is unable to convince her parents that she has actually visited the Other World.Despite warnings from her neighbours, Coraline frequents the Other World. During her visits, she meets the Other Wybie, who is mute; the Other Mr. Bobinsky, who ringmasters a jumping mouse circus; and the Other Miss Spink and Forcible, who perform theatrical acts. The Cat also goes into the Other World and is able to disappear and appear behind objects and can talk.On the third visit, the Other Mother invites Coraline to stay in the Other World forever, on condition that she have buttons sewn over her eyes like everyone else. Horrified, Coraline tries to escape. The Cat tells her about the true nature of the Other Mother, as well as the Other World, and \"how she wishes something to eat\". Coraline demands the Other Mother let her return to the real world, but she imprisons Coraline behind a mirror. There, she meets three ghost children, one of them Mrs. Lovat's missing twin sister; victims of the Other Mother, whom they refer to as the Beldam. They tell Coraline that the doll was sent to them to show the Other Mother what was wrong with their lives, then lured them away and tricked them into having buttons sewn over their eyes, eventually eating up their lives behind the mirror. In order to escape, they need their real eyes, which the Other Mother has hidden. Coraline promises to find their eyes moments before the Other Wybie grabs her. She finds out that his mouth has been stitched shut into a horrific grin by the Other Mother, but he helps her escape back to the real world. However, the Cat tells her that her parents have been kidnapped by the Other Mother. Coraline burns the doll.Coraline returns to the Other World to play a \"game\" with the Other Mother: to find her parents and the children's eyes. If she cannot, she will stay forever. Coraline manages to retrieve the children's eyes from the various \"wonders\" and the twisted inhabitants that the Other Mother made for her. She then confronts the Other Mother, who has turned into an arachnoid witch with needle hands. One of the ghost children warns her that the Other Mother will never let her go, even if she wins. Coraline finds and frees her real parents from a snow globe and manages to trick the Other Mother and escape, blinding her and severing her right hand. Coraline's parents return with no memory of being kidnapped.The ghosts appear to Coraline in a dream to warn her that she is still in danger and that she must get rid of the key, or the Other Mother will find it. As Coraline prepares to drop the key into a well, she is attacked by the Other Mother's severed hand, but is saved by Wybie, who crushes it with a rock. Coraline throws the key and the pieces of the hand down the well. The next day, Coraline hosts a garden party for her neighbors and prepares to tell Mrs. Lovat about her adventures.","language":"English","Reception":"According to Paul Dergarabedian, a film business analyst with Media by Numbers, for the film to succeed it needed a box office comparable to Wallace and Gromit: The Curse of the Were-Rabbit, which grossed $16 million its opening weekend and ended up making more than $192 million worldwide; prior to the film's release, Dergarabedian thought Laika \"should be really pleased\" if it made close to $10 million on its opening weekend.[12] In its US opening weekend, the film made $16.85 million, ranking third at the box office.[6] It made $15 million on its second weekend, bringing its U.S. total up to $35.6 million, $25.5 million of which coming from 3D presentations.[20] As of November 2009, the film had grossed $75,286,229 in the United States and Canada and $49,310,169 in other territories, making a total of $123,106,072 worldwide.[3]Coraline received critical acclaim. As of April 2012, the film has a 90% \"Certified Fresh\" rating at Rotten Tomatoes,[5] and an 80 out of 100 at Metacritic, indicating \"generally favorable reviews.\"[21] David Edelstein said the film is \"a bona fide fairy tale\" that needed a \"touch less entrancement and a touch more ... story.\"[22] A. O. Scott of The New York Times called the film \"exquisitely realized\" with a \"slower pace and a more contemplative tone than the novel. It is certainly exciting, but rather than race through ever noisier set pieces toward a hectic climax in the manner of so much animation aimed at kids, Coraline lingers in an atmosphere that is creepy, wonderfully strange and full of feeling.\"[23]","box_office":"$124.6 million[3]","cinematography":"Pete Kozachik","production_company":"Laika Pandemonium","directed_by":"Henry Selick","coraline":"Theatrical release poster","release_dates":"February 5, 2009 (2009-02-05) (Portland International Film Festival)[1]|February 6, 2009 (2009-02-06) (United States)||||","Production":"\"Coraline [was] a huge risk. But these days in animation, the safest bet is to take a risk.\"Director Henry Selick met author Neil Gaiman just as he was finishing the novel Coraline, and given that Gaiman was a fan of Selick's The Nightmare Before Christmas, he invited him to a possible adaptation of the film. As Selick thought a direct adaptation would lead to \"maybe a 47-minute movie\", his screenplay had some expansions, such as the creation of Wybie. When looking for a design away from the style seen in most animation, Selick discovered the work of Japanese illustrator Tadahiro Uesugi and invited him to become the concept artist. One of Uesugi's biggest influences was on the color palette, which was muted in reality and more colorful in the Other World.[9] Uesugi declared that \"at the beginning, it was supposed to be a small project over a few weeks to simply create characters; however, I ended up working on the project for over a year, eventually designing sets and backgrounds, on top of drawing the basic images for the story to be built upon.\"[11]Coraline was staged in a 140,000-square-foot (13,000 m2) warehouse in Hillsboro, Oregon.[10][12] The stage was divided into 50 lots,[13] which played host to nearly 150 sets.[10] Among the sets were three miniature Victorian mansions, a 42-foot (12.8 m) apple orchard, and a model of Ashland, Oregon including tiny details such as banners for the Oregon Shakespeare Festival.[12] More than 28 animators would be working at any one time on rehearsing or shooting scenes, producing 90–100 seconds of finished animation each week.[14] To add the stereoscopy for the 3D release, the animators would shoot each frame from two slightly apart camera positions.[9]Every object on screen was specifically made for the film.[9] The crew used three 3D printing systems from Objet in the development and production of the film. Thousands of high-quality 3D models, ranging from facial expressions to doorknobs were printed in 3D using the Polyjet matrix systems, which enable the fast transformation of CAD (computer-aided design) drawings into high-quality 3D models.[15] The puppets had separate parts for the upper and lower parts of the head, that could be exchanged for different facial expressions.[9] The characters of Coraline could potentially exhibit over 208,000 facial expressions.[15] Computer artists would composite separatedly shot elements together, or add some elements of their own which had to look handcrafted instead of computer-generated – for instance, the flames were done with traditional animation and painted digitally, and the fog was dry ice.[9]At its peak, the film involved the efforts of 450 people,[10] including from 30[12] to 35[10] animators and digital designers in the Digital Design Group (DDG) directed by Dan Casey and more than 250 technicians and designers.[12] One crew member, Althea Crome, was hired specifically to knit miniature sweaters and other clothing for the puppet characters, sometimes using knitting needles as thin as human hair.[10] The clothes would also simulate wear using paint and a file.[9] Several students from The Art Institute of Portland were also involved in making the film.The soundtrack for Coraline features songs composed by French composer Bruno Coulais with one, \"Other Father Song\", by They Might Be Giants. The Other Father's singing voice is provided by John Linnell, one of the singers from the band. They wrote 10 songs for the film; when a melancholy tone was decided, all but one were cut. Coulais' score was performed by the Hungarian Symphony Orchestra and features choral pieces sung by the Children's Choir of Nice in a nonsense language.[16] Selick mentions that the main soloist, \"a young girl you hear singing in several parts of the film\" is coincidentally named Coraline.[16] Coraline won Coulais the 2009 Annie Award for best score for an animated feature.","produced_by":"Henry Selick Claire Jennings","starring":"Dakota Fanning Teri Hatcher Jennifer Saunders Dawn French John Hodgman Ian McShane","running_time":"100 minutes[2]","music_by":"Bruno Coulais","edited_by":"Christopher Murrie","Release":"The film was released in the United States on DVD and Blu-ray on July 21, 2009 by Universal Studios Home Entertainment. A 3-D version comes with four sets of 3-D glasses—specifically the green-magenta anaglyph image. Coraline was released in the United Kingdom on DVD and Blu-ray on October 12, 2009. A 3-D version of the film was also released on a 2-Disc Collector's Edition. The DVD opened to first week sales of 1,036,845 and over $19 million in revenue. Total sales stand at over 2.6 million units and over $45 million in revenue.[17] A two-disc Blu-ray 3D set which includes a stereoscopic 3D on the first disc and an anaglyph 3D image was released in 2011.The website for Coraline involves an interactive exploration game where the player can scroll through Coraline's world. It won the 2009 Webby Award for \"Best Use of Animation or Motion Graphics,\" both by the people and the Webby organization. It was also nominated for the Webby \"Movie and Film\" category.[18] On June 16, 2008, D3 Publisher announced the release of a video game based on the film. It was developed by Papaya Studio for the Wii and PlayStation 2 and by Art Co. for Nintendo DS. It was released on January 27, 2009, close to the film's theatrical release.[19] The soundtrack was released digitally February 3, 2009 by E1 Music, and in stores on February 24, 2009.","budget":"$60 million[3]"}