{"based_on":"Simon Says  by Jonathan Hensleigh Characters by Roderick Thorp","country":"United States","distributed_by":"20th Century Fox (North America and Japan) Buena Vista Pictures (International)","screenplay_by":"Jonathan Hensleigh","Plot":"In New York City, the Bonwit Teller department store is destroyed by a bomb during the morning commute. The New York City Police Department receive a call from \"Simon\" ordering them that suspended police officer Lt. John McClane be dropped in Harlem wearing a sandwich board that says \"I hate niggers\" and threatening to detonate another bomb if they don't comply. They collect McClane and follow Simon's instructions; McClane is saved from a potential attack by young men by Zeus Carver, a nearby shop owner. McClane and Carver escape and return to headquarters, where Simon calls again and threatens to detonate more bombs if McClane and Carver do not follow his instructions.Simon sends the two on a series of children's riddles. He tells them to reach Wall Street station 90 blocks south, within 30 minutes to stop a bomb planted on a Brooklyn-bound 3 train. McClane boards the subway while Carver drives. McClane locates the bomb and throws it off the train, it still detonates, derailing the train and sending it through the station with minimal injuries due to Carver's warnings. As McClane and Carver regroup with the police, they are met by FBI agents, who reveal Simon is Peter Krieg, a former Colonel in the East German People's Army and a mercenary-for-hire. Krieg is after McClane as Krieg's birth name is Simon Peter Gruber, the brother of Hans Gruber whom McClane had previously killed in Nakatomi Towers. Simon calls the police, knowing the FBI is there, that he has planted a bomb in a public school and rigged with a radio detonator triggered by the police band. Simon tells them that he will get McClane and Carver the school's location if they continue to play his game. While McClane and Carver set off on Simon's next task, the police organize all the city's public works to begin searching schools, using 9-1-1 to coordinate activities.As McClane solves Simon's riddles, he recognizes that Simon is using the school bomb distraction to draw the police away from Wall Street. They arrive too late to find that Simon and his agents used the destruction of the subway station to dig into the Federal Reserve Bank of New York and steal $140 billion of gold bullion in dump trucks. They follow the trucks to aqueduct in the New York City Water Tunnel No. 3, and McClane has Carver continue on Simon's games. Within the tunnel he kills some of Simon's men, discovering they have a roll of quarters on them. Simon destroys a cofferdam, flooding the tunnel, but McClane escapes through a vent, ending up near Carver. They recognize the roll of quarters would pay for a toll road, and follow the trucks to a tanker vessel in the Long Island Sound. They sneak aboard, but realize too late it is a trap. They are tied to the real bomb and Simon says he will destroy the tanker, redistributing the bullion across the Sound, which would severely destroy the economies of the world. McClane convinces Simon to give him a bottle of aspirin. McClane is able to free them from the bomb before it explodes, sinking the tanker.As McClane and Carver are debriefed by the police, McClane says he knows Simon and reports that none of the bullion was on the tanker. McClane finds the bottle of aspirin came from a hotel just inside the Quebec border. McClane, Carver, and the police launch an attack on a warehouse near the hotel where Simon and his men are in the process of distributing the wealth and planning their escape. The rest of the men are captured, while Simon and his girlfriend attempt escape in a helicopter, firing upon McClane. McClane shoots an overhead power line so that it falls onto the helicopter, crashing it and killing all aboard. With the bullion located, Carver convinces McClane to call his wife.","language":"English","Reception":"Die Hard with a Vengeance received mixed reviews from critics. On Rotten Tomatoes, the film has a 51% \"Rotten\" rating based on 45 reviews, with an average rating on 5.7/10, with the critical consensus reading, \"Die Hard 3: With a Vengeance gets off to a fast start and benefits from Bruce Willis and Samuel L. Jackson's barbed interplay, but clatters to a bombastic finish in a vain effort to cover for an overall lack of fresh ideas\". Owen Gleiberman of Entertainment Weekly stated that while \"McTiernan stages individual sequences with great finesse... they don't add up to a taut, dread-ridden whole.\"[2] James Berardinelli thought that the explosions and fights were \"filmed with consummate skill, and are thrilling in their own right.\"[3] Samuel L. Jackson's performance in the film was also praised by critics. Desson Howe of The Washington Post thought that \"the best thing about the movie is the relationship between McClane and Zeus,\" saying that Jackson was \"almost as good as he was in Pulp Fiction.\"[4] Roger Ebert gave the film a positive review, praising the action sequences and the performances of Willis, Jackson, and Irons, concluding: \"Die Hard with a Vengeance is basically a wind-up action toy, cleverly made, and delivered with high energy. It delivers just what it advertises, with a vengeance.\"[5] Empire Magazine's Ian Nathan applauded the film with a 3/5 star review stating that \"Die Hard With A Vengeance is better than Die Hard 2, but not as good as the peerless original. Though it's breathless fun, the film runs out of steam in the last act. And Jeremy Irons' villain isn't fit to tie Alan Rickman's shoelaces.\"[6]Die Hard With A Vengeance was released on Laserdisc in 17 January 1996, on VHS in 14 May 1996 and on DVD in March 1999, a special edition on 10 July 2001 then again in February 2005 and 2007 also on Blu-ray in 2007 and 2013.The film earned $100,012,499 in North America (i.e. USA & Canada), while it earned $266,089,167 in other markets, giving it a total world-wide gross of $366,101,666 and making it the highest-grossing film of 1995.[1] Despite this success, the next film in the series would not be released for another 12 years.","box_office":"$366.1 million[1]","cinematography":"Peter Menzies Jr.","production_company":"Cinergi Pictures","directed_by":"John McTiernan","Alternate endings":"An alternate ending to the one shown in the final movie was filmed with Jeremy Irons and Bruce Willis, set some time after the events in New York. It can be found on the Special Edition DVD. In this version it is presumed that the robbery succeeds, and that McClane was used as the scapegoat for everything that went wrong. He is fired from the NYPD after more than 20 years on the force and the FBI has even taken away his pension. Nevertheless, he still manages to track Simon using the batch number on the bottle of aspirins and they meet in a cafe in Hungary.In this version, Simon has double-crossed most of his accomplices, gotten the loot to a safe hiding place somewhere in Europe, and has the gold turned into statuettes of the Empire State Building in order to smuggle it out of the country; but he is still tracked down to his foreign hideaway (this version is very similar to Alec Guinness's situation in the British heist film The Lavender Hill Mob made some 45 years earlier in which the stolen gold was turned into Eiffel Tower paperweights).McClane is keen to take his problems out on Simon whom he invites to play a game called \"McClane Says\". This involves a form of Russian roulette with a small Chinese rocket launcher that has had the sights removed, meaning it is impossible to determine which end is which. McClane then asks Simon some riddles similar to the ones he played in New York. When Simon gets a riddle wrong, McClane forces him at gunpoint to fire the launcher, which fires the rocket through Simon, killing him. McClane had been wearing a flak jacket (which was the answer to the final riddle: \"What could he have brought to the meeting to save his life?\"), so even if Simon had pointed the launcher the right way, it is likely that the relatively low-velocity rocket would not have caused McClane enough injury to prevent him from shooting Simon.In the DVD audio commentary, screenwriter Jonathan Hensleigh claims that this version was dropped because the studio thought it showed a more cruel and menacing side to McClane, a man who killed for revenge rather than in self-defense. The studio was also displeased with the lack of action in the scene, feeling that it didn't fit as a \"climax\" and therefore chose to reshoot the finale as an action sequence at a significant monetary cost. Hensleigh's intention was to show that the events in New York and the subsequent repercussions had tilted McClane psychologically. This alternative ending, set some time after the film's main events, would have marked a serious break from the Die Hard formula, in which the plot unfolds over a period of roughly 12 hours.According to the DVD audio commentary, a second alternate ending had McClane and Carver floating back to shore on a makeshift raft after the explosion at sea. Carver says it is a shame the bad guys are going to get away; McClane tells him not to be so sure. The scene then shifts to the plane where the terrorists find the briefcase bomb they left in the park and which Carver gave back to them (in this version it was not used to blow up the dam). The film would end on a darkly comic note as Simon asks if anyone has a 4-gallon jug. This draft of the script was rejected early on, so it was never actually filmed. The rocket-launcher sequence was the only alternate ending to be filmed.","die_hard_with_a_vengeance":"Theatrical release poster","Soundtrack":"Michael Kamen returned to score the third film, again incorporating other material into his score (most notably \"When Johnny Comes Marching Home\", not included on the soundtrack album), but excerpts from his score for Die Hard 2 were tracked into the new film. The soundtrack was released by RCA Victor.In 2012, La-La Land Records released a limited edition two-disc soundtrack containing the Kamen score.[citation needed]A novelization by Deborah Chiel was first published on May 28, 1995. The novel is written in Third Person Omniscient and has a somewhat darker tone in comparison to the final film.The novel provides a deeper exploration into McClane's psyche and see how angry and broken he has become since leaving Holly and becoming an alcoholic. McClane's introduction is also different. In the film, McClane is first seen in the police van to Harlem while being briefed on what is going on. The novel includes a scene before this where Connie and Joe find McClane in his messy apartment.Simon's henchwoman Katya appears much later into the story than she does in the film. She isn't involved in the Federal Reserve robbery and instead appears just before Simon and Targo take off in one of the dump trucks. Like the final film, she ends up killing Targo for Simon.The original placement of the \"Yippee-Ki-Yay\" line is included. Instead of being used at the end, McClane uses the line when talking to Simon over the radios while in the aqueducts. This was meant to be in the same vein as the original use of the line in the first movie.Zeus' original backstory is presented in the novel, explaining why he's looking after his nephews and why he hates white people. During the car chase, Zeus explains that his brother was killed during a drug raid. When McClane suggests that it was his brother's own fault, Zeus explains that his brother was never involved in drugs and the only reason he was there was to bring Zeus home.The novel also uses the \"McClane Says\" ending rather than the film's version of the finale.","release_dates":"May 19, 1995 (1995-05-19) (US)|May 25, 1995 (1995-05-25) (AUS)|August 18, 1995 (1995-08-18) (UK & IRL)|||","produced_by":"John McTiernan Michael Tadross","starring":"Bruce Willis|Jeremy Irons|Samuel L. Jackson|Graham Greene|Colleen Camp|Larry Bryggman|Sam Phillips|","running_time":"129 minutes","music_by":"Michael Kamen","edited_by":"John Wright","budget":"$90 million[1]"}