{"country":"United States","distributed_by":"Cannon Films","Plot":"A woman in a parking garage has trouble starting her car. Three thugs appear, force her out, and begin to rape her when Paul Kersey appears out of nowhere. He shoots the first two to death and wounds the third. Kersey blocks the exit, where the third mugger pleads for his life. Paul shoots him and then rolls the criminal over with his foot and reveals him to be himself. The assault turns out to be just a bad dream Kersey was having.A young teenager woman enters Paul's architectural office. She is Erica Sheldon (Dana Barron), whose mother, Karen Sheldon (Kay Lenz), is Paul's current girlfriend. Erica later goes with boyfriend Randy Viscovich (Jesse Dabson) to an arcade to meet up with a man named JoJo Ross (Héctor Mercado) and another buddy, Jesse Winters (Tim Russ). JoJo offers her crack cocaine, and Erica dies from an overdose.Having seen Erica accept a cigarette from Randy while in his car the previous night (since she did not smoke), Kersey is certain Randy was involved with Erica's death so he follows him to the arcade. Randy confronts JoJo and threatens to go to the police. JoJo murders Randy to prevent this. Kersey promptly shoots JoJo, who falls onto the electrified roof of the bumper-car ride to his death.At home, Paul receives a call from publisher and secretive tabloid owner Nathan White (John P. Ryan). Nathan explains that after his wife died, his daughter became his whole life. Then she became addicted to drugs and eventually died of an overdose. Nathan wants to hire Kersey to wipe out the drug trade in LA — in particularly, there are 2 major drug gangs rivaling between themselves for the main local drug supply: one is led by Ed Zacharias (Perry Lopez), while the other is under brothers Jack and Tony Romero (Mike Moroff and Dan Ferro respectively). Kersey accepts and Nathan supplies him with weapons and information. All the while two LA detectives, Sid Reiner and Phil Nozaki (George Dickerson and Soon-Tek Oh respectively), begin to investigate the arcade deaths.Kersey infiltrates Zacharias's manor, where he is throwing an elaborate birthday party. As he bugs a phone, he witnesses Zacharias murder a colleague, Vince Montono (James Purcell), who stole a big deal of cocaine from the cartel's South American connection. Zacharias discovers and captures Paul (under the fake name \"Leo\") and orders him to help carry out the dead body. A hired hitman, Al Arroyo (Daniel Sabia) helps Paul hide the corpse in the trunk of a car. Knowing that he is about to be killed, Paul kills Arroyo with the car's trunk cover in self-defense.Paul proceeds to kill three of Ed Zacharias' favored hitmen at an Italian restaurant - Danny Moreno (Michael Russo), Art Sanella (Danny Trejo) and Jack Steiner - with a wine bottle containing a bomb (he offered the explosive bottle to the three criminals under the fake name \"Jack Kimble\" and saying himself to be a representative of a newly-open wine manufacturer); later he starts attacking the Romeros' side: first, he kills drug dealer Max Green (Tom Everett), leader of Romeros' streetdealers, disguised as a sex video trader, and his two cronies; later, he goes after the Romeros's top hitman Frank Bauggs (David Wolos-Fonteno) in order to find out more about their cartel, but a fight ensues and Bauggs falls off his apartment to his death. A few days later, White instructs Kersey to go to San Pedro, Los Angeles, where a local fisherman wharf acts as a front for Zacharias's drug operations. Upon breaking in there, Kersey kills eight more criminals and blows up the drug processing room with a bomb. Detective Nozaki reveals himself to be a representative working for Zacharias. He threatens to kill Kersey, unless Kersey tells Nozaki who he works for. Kersey refuses and kills him. Reiner knows Kersey killed Nozaki, and will do anything to bring him in. Kersey lures Zacharias and the Romero brothers into a trap, leading to an epic shootout in an oil field in which both cartels are completely destroyed, and Kersey personally kills Zacharias with a high-powered rifle. White congratulates Kersey on a job well done, but sets him up with a car bomb (which he barely escapes from). Enraged, Kersey returns to the White manor only to find another completely different man who claims to be the real Nathan White; simply put, Kersey realizes that the tabloid owner who hired him was actually a third drug lord who used him to dispose of the rival cartels. Kersey is then approached by two cops who arrest him, but he recognises them as fakes, causes their car to flip over and quickly escapes.The fake Nathan White is furious that Kersey is still alive. In a last attempt to get rid of Paul, he kidnaps and uses Karen as a bait to lure him into a trap. Kersey knocks out Detective Reiner (who was awaiting inside Kersey's apartment), then pulls a M16 rifle, with an incorporated M203 grenade launcher, from a gun rack hidden behind his freezer. Earlier, Reiner refused to believe that his partner Nozaki was working for Zacaharias, until Kersey receives a phone call from White demanding that Kersey gives himself up to help free Karen.Kersey arrives at the meeting place - the parking lot of White's luxurious commercial building. The car rolls forward as White orders his men to open fire. They spray the car with bullets before realizing Paul's not in it. Kersey fires a grenade, killing three bandits as their van explodes, then fires another grenade to kill Jesse as he betrays his crew and tries to drive away. Kersey follows White into a roller rink, resulting in the deaths of six more criminals.White escapes through a back door holding Karen hostage. Karen attempts to escape, but White shoots from behind and kills her (she becomes the third of Paul's love interests in the series to be murdered by criminals). Distraught by Karen's death and realizing that White has run out of bullets, Kersey fires a last grenade that finishes him off, literally blasting him to death. Reiner arrives and orders him to surrender, threatening to shoot as Kersey walks away. Kersey simply replies: \"Do whatever you have to\", and Reiner lets him go. Reiner understands that Kersey gives justice to those that have none.","language":"English","Reception":"The film was met with mixed reviews.[3][4] Critics however praised the film's plot lines compared to the previous film's plots and action sequences. Death Wish IV currently holds two and a half stars (5.2/10) on IMDb.[5] It has a 14% rating on Rotten Tomatoes.[6]In the UK film magazine Film Review, critic James Cameron Wilson praised director J. Lee Thompson's vision saying that \"it's flashy without being distracting and more or less gets on with the job of storytelling.\" He also criticised the script, noting it needed to be smartened up, but preferred Thompson's direction over the original director Michael Winner.[7]The film debuted at No. 6, it was a box office disappointment bringing a profit of nearly $2 million dollars out of the other $5 million it grossed (the equivalent of $14,550,159 in 2016 dollars).[8]","death_wish_4:_the_crackdown":"Theatrical release poster","box_office":"$6,880,310 ($14,550,159 in 2016 dollars)[1]","cinematography":"Gideon Porath","directed_by":"J. Lee Thompson","release_dates":"November 6, 1987 (1987-11-06) (U.S.)|||||","Production":"Cannon Films announced the creation of a new sequel of Death Wish in 1986, estimating that it would be ready for release by Spring 1987. [2] However, the film company was by this point facing financial problems. Its greatest box office hit was still Missing in Action (1984) with 38 million dollars domestic gross. Cannon had lost money through box office flops such as Pirates (1986). Consequently, they tightened the budgets of upcoming films to under 5 million dollars per film. [2]For Death Wish 4, Cannon reached an agreement with independent producer Pancho Kohner, son of Paul Kohner. The senior Kohner was the agent of Charles Bronson. Pancho himself had produced (or co-produced) seven previous Bronson films, including St. Ives (1976), The White Buffalo (1977), Love and Bullets (1979), 10 to Midnight (1983), The Evil That Men Do (1984), Murphy's Law (1986), and Assassination (1987).[2]Death Wish 4 was the first film in the series not to be directed by Michael Winner, who was preoccupied with filming Appointment with Death (1988). Reportedly Winner expressed no interest in directing Death Wish 4 because Bronson was displeased with their previous co-operation in Death Wish 3 (1985). [2] Reportedly both Bronson and Kohner had in mind assigning directorial duties to J. Lee Thompson. Thompson had worked with them in several previous films, and he had also had a good working relationship with the producers of Cannon Films. [2]When it came to a screenplay for the film, there were several available. Writing duties were finally assigned to Gail Morgan Hickman, who had previously contributed rejected scripts for Death Wish 3 and the script of Murphy's Law.[2] He wrote three different script for the film. The first featured Paul Kersey struggling with a crisis of conscience and trying to reconnect with Geri Nichols (Jill Ireland) from Death Wish II. It was rejected because Ireland faced her own struggle with breast cancer and was unwilling to reprise her role. [2] The second had Kersey going after an international terrorist, and was rejected due to another upcoming film, Wanted: Dead or Alive (1987). [2] The final script had the premise of Kersey playing two gangs against each other. Hickman was influenced by the use of this premise in the films Yojimbo (1961) and A Fistful of Dollars (1964). [2]Hickman also came up with the idea of a millionaire benefactor for Kersey, with both of them having lost a daughter (surrogate in Kersey's case) to the deadly effects of the illegal drug trade. Kohner found this an interesting idea in need of a plot twist. Hickman came up with the idea of the millionaire being a drug lord who is using Kersey to eliminate his competition. [2] According to Hickman, he also understood that Cannon producers Menahem Golan and Yoram Globus \"wanted a mindless movie with nonstop action\", so he came up with \"cartoonish\" action scenes. [2] Hickman revised his screenplay through February and March 1987. He recalled writing from 9 a.m. to 9 p.m. on a daily basis. [2]Hickman toyed with the idea of giving Kersey a surrogate son called Eric, to avoid repetition in having the character lose another daughter. He changed his mind and turned Eric to Erica, because he felt that the death of a girl would be a stronger echo to the original loss in Kersey's life. Hickman was also the father of a daughter and could better understand the trauma of losing a girl.[2] The previous three films of the series featured youthful street punks as villains. The fourth film covered new ground featuring adult representatives of organized crime. [2] During the filming, Bronson requested further rewrites of certain items of dialogue and action scenes. Hickman recalled going through several rewrites on a daily basis. [2]","produced_by":"Pancho Kohner","starring":"Charles Bronson|Kay Lenz|John P. Ryan|Perry Lopez|Soon-Tek Oh|George Dickerson|","running_time":"99 mins.","music_by":"John Bisharat Paul McCallum Valentine McCallum","edited_by":"Peter Lee-Thompson","Release":"Media Home Entertainment released the film on video in April 1988, having agreed with Cannon to a 2 million dollars advance. Over 100,000 cassettes were sold to rental stores. It was the best selling entry of the series in the video market. [2]","written_by":"Brian Garfield (characters) Gail Morgan Hickman (screenplay)","budget":"$5 million"}