{"based_on":"Car 54, Where Are You?  by Nat Hiken","country":"United States","distributed_by":"Orion Pictures","screenplay_by":"Erik Tarloff|Ebbe Roe Smith|Peter McCarthy|Peter Crabbe|","Plot":"Partnered in Car 54 are the amiable, unreliable Gunther Toody and the prim, proper Francis Muldoon, who wants to know, among other things, if Toody has been helping himself to free kebab from the neighborhood food vendors.As everyone gets on their case, including Dave Anderson, their captain, an assignment comes their way. Toody and Muldoon are told to protect citizen Herbert Hortz, who apparently has incurred the wrath of the local crime godfather, the claustrophobic Don Motti. And while the cops from Car 54 ineptly do their jobs, Toody gets an earful from his wife, Lucille, and is hot and bothered by a woman all their colleagues seem to have already frisked or handcuffed, the vixen Velma Velour.","language":"English","Reception":"The film received universally negative reviews and currently has a 0% rating on Rotten Tomatoes based on 14 reviews.[3]The film won an Golden Raspberry Award for Worst Supporting Actress (Rosie O'Donnell), along with Exit to Eden and The Flintstones;[4] and won a Stinkers Bad Movie Awards for Worst Resurrection of a TV Show and was nominated for Worst Picture and Worst Actress (O'Donnell), along with Exit to Eden and The Flintstones.[5]","box_office":"$1,238,080","cinematography":"Rodney Charters","car_54,_where_are_you?":"Theatrical release poster","directed_by":"Bill Fishman","release_dates":"January 28, 1994 (1994-01-28)|||||","Production":"Though the film was shot in 1990, it was edited several times and as a result wasn't released until 1994. It was originally filmed as a musical, but most of the musical numbers were cut from the released film. The film is considered a reboot of the television series even though Nipsey Russell and Al Lewis appear as older versions of their roles from the original series.","produced_by":"Robert H. Solo","starring":"David Johansen|John McGinley|Fran Drescher|Nipsey Russell|Rosie O'Donnell|Al Lewis|","running_time":"89 minutes","music_by":"Pray for Rain|Bernie Worrell|","edited_by":"Alan Balsam|Earl Watson|","budget":"$10.7 million"}