{"country":"United States","distributed_by":"Columbia Pictures","Critical response":"The film was praised for its acting, direction, action sequences and technical qualities, but Green's improbable storyline and dialogue came in for criticism.[5][12][13]","chain_gang":"Titular screenshot","Plot":"After a state senator's bill to abolish chain gangs is rejected by the Senate, newspaper reporter Cliff Roberts (Kennedy)[6] persuades his boss Pop O'Donnel (Harry Cheshire) at the liberal Capitol City Evening Standard to arrange for him to go undercover in a chain gang prison. Equipped with false employment records and a tiny microfilm camera disguised as a cigarette lighter, he tells everyone -- including girlfriend Rita McKelvey (Marjorie Lord), a reporter for a rival newspaper[7] -- that he is going on a fishing trip, but actually heads for Cloverdale Prison Farm in the deep south, scene of recent incidents which left three inmates dead.The prison's Captain Duncan (Emory Parnell) supplies labour in the form of chain gangs, which are ostensibly for state construction projects but in reality are being exploited by Rita's stepfather, local entrepreneur John McKelvey (Thurston Hall), for his construction projects. Working as a guard, Roberts secretly photographs prison conditions, arriving in time to witness the recapturing of an escaped inmate who is sent for an overnight stay in the sweatbox as punishment. Roberts is supplied with a bullwhip and is required to use it when a convict - Snead (William Phillips) - is caught covering up for another inmate who can't work well enough at the construction site. Under Captain Duncan's orders, Roberts reluctantly flogs Snead at the whipping post. Later he visits Snead in solitary confinement to apologise for the whipping and gains the inmate's trust.Roberts' secret photographs are published in the newspaper, much to McKelvey's consternation.[8] A foreman on the construction project (who knows Roberts as Jack Granger) sees his photograph in McKelvey house. His cover blown, Roberts uses the confusion of fellow prisoner Snead's escape to make a run for it.[9] The two men try to outrun the guards and their dogs across wilderness and through woodland. Roberts is shot and left for dead by Captain Duncan,[10] who later pins the blame on Snead. Roberts eventually makes it to safety and is reunited with Rita. Snead is killed while on the run and McKelvey is charged with the exploitation of convict labor for personal gain.","language":"English","cinematography":"Ira H. Morgan","directed_by":"Lew Landers","release_dates":"November 1950","Production":"Chain Gang was produced by Sam Katzman at Columbia Pictures and filmed in black and white by Ira H. Morgan.[4] It was reissued on DVD in 2012 as part of the Sony Choice Collection.[5]Filming started 16 May 1950.[11]","produced_by":"Sam Katzman","starring":"Douglas Kennedy Marjorie Lord","running_time":"70 minutes","written_by":"Howard J. Green"}