{"directed_by":"Tammy Davis","country":"New Zealand","Soundtrack":"The official soundtrack for the film was released on 18 September 2015 through Sony Music Records. New Zealand DJ and Producer, P-Money curated the tracks synonymous with kiwi culture. Included on the album are songs from David Dallas, Sid Diamond, Scribe and lead single “Start Again” by Stan Walker and Samantha Jade.[7] On 2 October, the soundtrack reached number 38 on the New Zealand Albums Chart.[8]","release_dates":"11 September 2015 (2015-09-11) (TIFF)|24 September 2015 (2015-09-24) (New Zealand)|5 November 2015 (2015-11-05) (Australia)|||","Plot":"Coming of age tale told through the eyes of 'Tu', an ambitious young man from Auckland who dreams of being a professional hip-hop dancer. His unwillingness to adhere to a university education or that of a productive member of society coupled with his lack of ambition for a cognitive challenge has his father give him the ultimatum of a conclusive answer or Army-enlisting.","Production":"In October 2014, it was announced that production on the film commenced in Auckland. It was also announced that film newcomer Tia Maipi would play the lead role of ‘Tu’ alongside Kherington Payne (who had starred in So You Think You Can Dance and Katy Perry’s California Dreams Tour) and Australian Idol winner Stan Walker. Eight-time world hip hop champion Parris Goebel served as choreographer on the film.[3]","starring":"Tia Maipi, Stan Walker, Parris Goebel, Kherington Payne, John Tui","language":"English","Reception":"Graeme Tuckett of Stuff.co.nz rated Born to Dance four out of five stars and praise the dancing ability of the actors, especially considering the lack of \"wires, stunt doubles or even much camera trickery\".[9] The New Zealand Herald's Francesca Rudkin and 3 News' Kate Rodger praised P-Money's work on the soundtrack.[10][11]The film script was criticised by Alice Harbourne from Metro.[12]","box_office":"$828,304[1]","Release":"The official trailer was released on 21 July 2015.[4] The poster was released on 28 July 2015.[5] The film was released in New Zealand on 24 September 2015.The film was released in Australia on 5 November 2015. [6]","written_by":"Steve Barr, Hone Kouka, Casey Whelan"}