{"directed_by":"Lamont Johnson","distributed_by":"Universal Pictures","release_dates":"April 24, 1981 (1981-04-24)|||||","Plot":"The outlaws the girls find are the demoralised remnants of the Doolin-Dalton gang, led by an historically inaccurate aged Bill Doolin (Burt Lancaster at sixty-seven). Anna Emmaline McDoulet, or Cattle Annie (Amanda Plummer), shames, and inspires the men, to become what she had imagined them to be. The younger sister (but historically not a relative), Jennie Stevens or Little Britches (Diane Lane), finds a father figure in Doolin, who in the story line coined her nickname \"Little Britches\". Doolin's efforts to live up to the girls' vision of him lead him to be carted off in a cage to an Oklahoma jail where he waits to be hanged. With the help of the girls, and the gang, Doolin escapes and rides off to safety with his men. The girls are triumphant, but they cannot escape Marshal Bill Tilghman (Rod Steiger), and are sent back East to the reformatory in Framingham, Massachusetts.","starring":"Burt Lancaster John Savage Rod Steiger Diane Lane Amanda Plummer Scott Glenn Buck Taylor","Reaction":"The film was favorably reviewed by the critic Pauline Kael in The New Yorker. \" The cinematography [by Larry Pizer] is vivid..the colors are strikingly crisp and intense. The dialogue and most of the incidents have a neat, dry humor. It's a wonderful, partly true story...there are some wonderful performances. As Bill Doolin, Lancaster (who made the film before Atlantic City), is a gent surrounded by louts - a charmer. When he talks to his gang he uses the lithe movements and the rhythmic, courtly delivery that his Crimson Pirate had when he told his boys to gather round. In his scenes with Diane Lane, the child actor who appeared in New York in several of Andrei Serban's stage productions, and who single handedly made the film A Little Romance almost worth seeing, Lancaster has an easy tenderness that is never overdone. Lancaster looks happy in the movie and still looks tough: it's an unbeatable combination. Young Amanda Plummer gives a scarily brilliant performance.\"[2]","music_by":"Sahn Berti Tom Slocum","written_by":"David Eyre and Robert Ward from the book by Robert Ward","cinematography":"Larry Pizer"}