{"based_on":"Barbarians at the Gate: The Fall of RJR Nabisco  by Bryan Burrough John Helyar","original_language(s)":"English","production_company(s)":"Columbia Pictures Television HBO Rastar Pictures","Plot":"Self-made multimillionaire F. Ross Johnson decides to take the tobacco and food conglomerate RJR Nabisco private in 1988 after receiving advance news of the likely market failure of the company's smokeless cigarette called Premier, the development of which had been intended to finally boost the company's stock price.[1]The free-spending Johnson's bid for the company is opposed by two of the pioneers of the leveraged buyout, Henry Kravis and his cousin. Kravis feels betrayed when, after Johnson initially discusses doing the LBO with Kravis, he takes the potentially enormous deal to another firm, the Shearson Lehman Hutton division of American Express.Other bidders emerge, including Ted Forstmann and his company, Forstmann Little, after Kravis and Johnson are unable to reconcile their differences. The bidding goes to unprecedented heights, and when executive Charles Hugel becomes aware of how much Johnson stands to profit in a transaction that will put thousands of Nabisco employees out of work, he quips, \"Now I know what the 'F' in F. Ross Johnson stands for.\" The greed was so evident, Kravis's final bid is declared the winner, even though Johnson's was higher.The title of the book and movie comes from a statement by Forstmann in which he calls that Kravis' money \"phoney junk bond crap\" and how he and his brother are \"real people with real money,\" and that to stop raiders like Kravis: \"We need to push the barbarians back from the city gates.\"","country_of_origin":"United States","original_network":"HBO","distributor":"HBO","directed_by":"Glenn Jordan","barbarians_at_the_gate":"DVD cover","original_release":"March 20, 1993","theme_music_composer":"Richard Gibbs","editor(s)":"Patrick Kennedy","starring":"James Garner Jonathan Pryce","running_time":"107 minutes","producer(s)":"Ray Stark","In Popular Culture":"In the podcast Comedy Bang Bang, comedian Paul Rust refers to the film in the prologue to his popular segment \"New No-Nos\", while discussing a run-in with Nabisco concerning Chex Mix.[2]"}