{"country":"France","distributed_by":"Films du Losange","céline_and_julie_go_boating:_phantom_ladies_over_paris":"Film poster","Plot":"The film begins with Julie sitting on a park bench reading a book of magic spells when a woman (Céline) walks past, and begins dropping (à la Lewis Carroll's White Rabbit) various possessions. Julie begins picking them up, and tries to follow Céline around Paris, sometimes at a great pace (for instance, sprinting up Montmartre to keep pace with Céline's tram). After adventures following Céline around the Parisian streets — at one point it looks as if they have gone their separate ways, never to meet up again — Céline finally decides to move in with Julie. There are incidents of identity swapping, with Céline pretending to be Julie to meet the latter's childhood sweetheart, for example, and Julie attempting to fill in for Céline at a cabaret audition.The second half of the film centers around the duo's individual visits to 7 bis, rue du Nadir-aux-Pommes, the address of a mansion in a quiet, walled off grounds in Paris. While seemingly empty and closed in the present day, the house is yet where Céline realizes she knows as the place where she works as a nanny for a family — two jealous sisters, one widower, and a sickly child. Soon, a repetitive pattern emerges: Céline or Julie enters the house, disappears for a time, and then is suddenly ejected by unseen hands back to present day Paris later that same day. Each time either Céline or Julie is exhausted, having forgotten everything that has happened during their time in the house. However, each time upon returning via a taxi the women discover a candy mysteriously lodged in their mouth. It seems to be important, so each makes sure to carefully save the candy. At one point, they realize that the candy is a key to the other place and time; sucking on the sweet transports them back to the house's alternate reality (in this case a double reference to both Lewis Carroll and to Marcel Proust's madeleine) of the day's events.The remainder of the film consists of the two women attempting to solve the central mystery of the house: amidst the jealous conniving of women of the house over the attentions of the widower, a young child is mysteriously murdered. But this narrative is one that repeats like a stage play, with exact phrases they soon learn well enough to start joking about. Each time they repeat eating the candy, they remember more of the day's events. Just as if reading a favorite novel, or again watching a beloved movie, they find that they can enter the narrative itself, with each twist and turn memorized. Far from being the passive viewers/readers that they were at first — and most movie viewers always are — the women come to realize that they can seize hold of the story, changing it as they wish.Now, even as the plot continues to unfold in its clockwork fashion, the women begin to take control, making it \"interactive\" by adding alterations to their dialogues and inserting different actions into the events unreeling in the house. Finally, in a true act of authorship, they change the ending, and rescue the young girl who was originally murdered. Both realities are fully conjoined when, after their rescue of the girl from the House of Fiction, the two not only discover themselves transported back in Julie's apartment, but this time it isn't another \"waking dream\" for the young girl, Madlyn, has joined them, safely back in 1970s Paris.To relax, Céline, Julie, and Madlyn take a rowboat on a placid river, rowing and gliding happily along. But something isn't quite right. They go silent upon seeing another boat quickly coming to pass them on the water. On that boat we see the three main protagonists from the house-of-another-time: that alternate reality has followed them back to their world. But Céline, Julie, and Madlyn see them as the antique props they are, frozen in place.The film ends as we watch Céline this time, half nodding off on a park bench, who catches sight of Julie hurrying past her, who in her White Rabbit way, drops her magic book. Picking it up, she calls and runs after Julie.","language":"French","Themes":"Magic is one of the themes of the film. Céline, the stage magician, does her magic tricks in a nightclub performance. Magic seems to come too from Julie's Tarot card readings. Finally, \"real\" magic comes from the design of a potion, which enables both women to enter the house and take charge of the narrative.At the start, the two women are leading relatively conventional lives, each having jobs (Julie, a librarian, is more conservative and sensible than Céline, a stage magician, with her bohemian lifestyle). As the film develops, Céline and Julie separate from the world by leaving their jobs, moving in together, and gradually becoming obsessed with the mysterious and magical events in the old house.In one scene, according to critic Irina Janakievska, Julie is playing Tarot cards, with one of the cards interpreted as signifying that Julie's future is behind her — exactly when we see Céline, wearing a disguise, observing Julie from one of the library desks. As Céline draws an outline of her hand in one of the books, Julie echoes that as she plays with a red ink pad.[2]Another noticeable aspect of the film is its use of puns. For instance, the title of the film, Céline et Julie vont en bateau, has other meanings from that of taking a boat ride: \"aller en bateau\" also means \"to get caught up in a story that someone is telling you\", or, in English, getting taken up in a \"shaggy dog story\".","Reception":"Celine and Julie Go Boating is among Rivette's most acclaimed works. The film received 15 total votes – including one from the revered critic David Thomson – in the British Film Institute's 2012 Sight & Sound polls,[5] and the aggregation site They Shoot Pictures, Don't They has found it to be the 202nd most celebrated movie ever made.[6] Rotten Tomatoes also reports 95% approval among 22 critics, with an average rating of 8/10.[7]","cinematography":"Jacques Renard","References to film and literature":"The film references Lewis Carroll's Alice's Adventures in Wonderland, Henry James' \"The Romance of Certain Old Clothes, Bioy Casares's \"La invención de Morel\",[3][4] \" and Louis Feuillade's Les Vampires (Gaumont, 1915).","directed_by":"Jacques Rivette","release_dates":"September 1974 (1974-09) (France)|October 7, 1974 (1974-10-07) (NYFF)||||","Production":"Luc Béraud was assistant director on the movie.","produced_by":"Barbet Schroeder","starring":"Dominique Labourier Juliet Berto Marie-France Pisier","running_time":"192 minutes","music_by":"Jean-Marie Senia","edited_by":"Nicole Lubtchansky","written_by":"Jacques Rivette Dominique Labourier Juliet Berto Eduardo de Gregorio Bulle Ogier Marie-France Pisier, including sections based on original stories by Henry James."}