{"country":"United Kingdom United States Slovakia","distributed_by":"Universal Pictures","screenplay_by":"Charles Edward Pogue","story_by":"Charles Edward Pogue Patrick Read Johnson","Legacy":"In the years following its release and strong home media sales, Dragonheart gained a following and is now considered a cult classic.[14][15] The character of Draco also gained popularity, often being ranked as one of the most memorable dragons ever portrayed on film, with fans noting him as ILM's best work on the heels of Jurassic Park and praising Sean Connery's vocal performance.[16] In 2006, Draco was ranked no. 6 on a top 10 list of movie dragons by Karl Heitmueller for MTV Movie News.[17] In 2013, WatchMojo.com ranked Draco no. 8 on their list of \"Top 10 Dragons from Movies and TV\" and listed him as an Honorable Mention on their list of \"Another Top 10 Movie Characters We Didn't Want to Die\" in 2015.[18][19]On various days throughout the year in Toronto, a fully restored \"20th anniversary edition\" of Dragonheart with never-before-seen footage, enhanced visual effects, and a digitally remastered soundtrack is screened at the AMC Yonge & Dundas 24 theatre.[20] On May 31 2016, in celebration of the film's 20th anniversary, a retrospective article was published on the making of DragonHeart featuring Scott Squires and Phil Tippett among others who worked on the film.[21]","Plot":"An English knight, Bowen (Dennis Quaid), mentors a Saxon prince, Einon (Lee Oakes), in the Old Code, the ideals of chivalry in the hope that he will become a better king than his tyrannical father Freyne (Peter Hric). When the king is killed while suppressing a peasant rebellion, Einon is mortally wounded by the peasant girl Kara (Sandra Kovacikova). Einon's mother, Queen Aislinn (Julie Christie), has him taken before a dragon whom she implores to save the boy's life. The dragon replaces Einon's wounded heart with half of its own on the promise that Einon will rule with justice and virtue. However, Einon soon becomes more tyrannical than his father, enslaving the former rebels and forcing them to rebuild a Roman castle. Bowen believes that the dragon's heart has twisted Einon, and swears vengeance on all dragons.Twelve years later, an adult Einon (David Thewlis) has his castle rebuilt. Kara (Dina Meyer) asks the king for pardoning her father after years of slavery, but Einon instead kills him in order to \"free\" him. As for Bowen, he has become a very skilled dragonslayer. Brother Gilbert (Pete Postlethwaite), a monk and aspiring poet, observes Bowen slaying a dragon and follows him to record his exploits. Bowen stalks another dragon to its cave, however the confrontation ends in a stalemate. The dragon states that he is the last of his kind, and thus if Bowen kills him, he will be out of a job. The two form a partnership to defraud local villagers with staged dragonslayings. Bowen calls the dragon Draco, after the constellation. Unknown to Bowen, Draco is the dragon who shared his heart with Einon, and through this connection, any pain inflicted upon one is also felt by the other.Meanwhile, Kara, seeking revenge on Einon for murdering her father, is imprisoned after a failed assassination attempt. Einon recognizes her as the one responsible for his near-death and attempts to seduce her and make her his queen. Disgusted by what her son has become, Aislinn helps Kara escape. Kara tries to rally the villagers against Einon, however they instead offer her as a sacrifice to Draco, who takes her to his lair. Einon arrives to recapture her and fights Bowen, declaring that he never believed in the Old Code and only told Bowen what he wanted to hear so he would teach him how to fight. Draco intervenes and Einon flees. Kara asks Bowen to help overthrow Einon, however the disillusioned knight refuses.Bowen and Draco's next staged dragonslaying goes poorly and their con is exposed. Draco takes Bowen, Kara, and Gilbert to Avalon, where they take shelter among the tombs of the Knights of the Round Table. Draco reveals the connection between himself and Einon, stating that he hoped giving the prince a piece of his heart would change Einon's nature and reunite the races of Man and Dragon. Through this action Draco hoped to earn a place in the stars, where dragons who prove their worth go after they die. He fears that his failure will cost him his soul, and agrees to help Kara and Gilbert against Einon. After experiencing a vision of King Arthur (voiced by John Gielgud) that reminds him of his knightly code, Bowen agrees to help as well.With Bowen and Draco on their side, the villagers are organized into a formidable fighting force. Aislinn presents Einon with a group of dragonslayers, secretly knowing that killing Draco will cause Einon to die as well. The villagers are on the verge of victory against Einon's cavalry when Gilbert strikes Einon in the heart with an arrow. Draco falls from the sky and is captured. Einon realizes that he is effectively immortal as long as Draco remains alive, and determines to keep the dragon imprisoned. Aislinn attempts to kill Draco during the night, but Einon stops and kills her instead.The rebels invade Einon's castle to rescue Draco as Bowen battles Einon. Draco begs Bowen to kill him as it is the only way to end Einon's reign, but Bowen can't bring himself to kill his friend. Einon charges at Bowen with a dagger, but Bowen reluctantly throws an axe into Draco's exposed half-heart. Einon and Draco both die, and Draco's body dissipates as his soul becomes a new star in the constellation. Bowen and Kara go on to lead the kingdom into an era of justice and brotherhood.","language":"English","Reception":"Based on reviews from 30 critics compiled retrospectively, Rotten Tomatoes gives the film a score of 50% with an average rating of 5.7 out of 10.[7] Critics praised the premise, visual effects, and character development but panned the script as confusing and clichéd.Roger Ebert gave the film 3 stars out of 4, saying \"While no reasonable person over the age of 12 would presumably be able to take it seriously, it nevertheless has a lighthearted joy, a cheerfulness, an insouciance, that recalls the days when movies were content to be fun. Add that to the impressive technical achievement that went into creating the dragon, and you have something to acknowledge here. It isn't great cinema, but I'm glad I saw it.\"[8] Jami Bernard of The New York Daily News described the film as \"a movie for people young enough to keep dragons in the menageries of their imaginations\", and went on to say that \"the dragon is the most believable part of the whole movie.\"[9] Ken Tucker of Entertainment Weekly gave the movie a positive review, but criticized the fact that Sean Connery provided the voice for Draco, saying that \"If only Sean Connery didn't have such a wonderfully distinctive voice, Draco might live and breathe as his own creature.\"[10]","Prequel and sequel":"A direct-to-video sequel to the film called Dragonheart: A New Beginning was released in 2000 and a prequel called Dragonheart 3: The Sorcerer's Curse was released in 2015. According to Matthew Feitshans, screenwriter of Dragonheart 3, a Dragonheart 4 is currently in the works.[13]","box_office":"$115,267,375[1]","cinematography":"David Eggby","dragonheart":"Theatrical release poster","directed_by":"Rob Cohen","release_dates":"May 31, 1996 (1996-05-31) (North America)|||||","Production":"Patrick Read Johnson, who wrote the story for Dragonheart, first proposed the idea for the film to producer Raffaella de Laurentiis. Johnson describes it as \"The Skin Game with a dragon in it...or Butch Cassidy and the Sundance Dragon\", and that he wanted \"the idea of a dragon and a knight conning villages for money\" because he thought that the concept was \"not only funny, but kind of sweet\". Johnson went on to pitch the idea to screenplay writer Charles Edward Pogue, and he agreed to work on the film. De Laurentiis originally intended for John Badham, Rob Cohen's then-partner, to work on Dragonheart. According to Cohen, Badham \"didn't respond\" to the material, so Johnson was then asked to direct the film.[2]To be able to stay within the budget that Universal Studios was willing to shell out with Johnson directing, the developers approached Jim Henson's Creature Shop to create the dragon through traditional means. The dragon model was done within eight weeks time, and the crew then went to Shepperton Studios in England to begin shooting the film, starting with the campfire scene. The crew faced difficulties in keeping within the budget.[2]After working with de Laurentiis on Dragon: The Bruce Lee Story in 1993, Rob Cohen agreed to take over as director for the film. He approached Universal Studios with his new ideas, including the addition of computer-generated imagery (CGI) to animate the dragons similar to how the dinosaurs were created for Jurassic Park.[2]The principal cast members of Dragonheart were:Phil Tippett, a visual effects producer specializing in creature design and character animation, and Industrial Light & Magic (ILM) were hired to work on animating Draco for Dragonheart. Tippett states that the responsibilities that his studio had for Dragonheart differed from what they did for Jurassic Park in that they were mostly responsible for the actual look and design of the dragon as well as the storyboards, blocking, and the timing of action sequences.[2]Tippett worked closely with sculptor Pete Konig in designing Draco. Konig crafted several maquettes that they showed to Cohen, and they worked on improving the ones that Cohen said \"[felt] right\". Cohen's ideas for Draco's design stemmed from the traditional Chinese guardian lion, which Cohen describes as having \"a lion-like elegance, a fierceness\", and that it is \"ultimately a proud...visually powerful creature\". He also drew ideas from nature, such as the boa constrictor's jaw structure and the musculature of horses. Tippett also took into consideration how the scenes with Draco in it would be framed, the size difference between Draco and the human actors, and what he would actually be doing throughout the film.[2] Draco's hide and wings were originally going to have an iridescent quality and his eyes were to be more detailed such as being able to dilate, but those design elements were dropped due to software issues and running out of time.[3][4]Tippett and his crew created a five-foot model of Draco for lighting reference, and an articulated model that could be used for as a reference for Draco's poses. Because Draco would have more screen time than the CGI dinosaurs in Jurassic Park (23 minutes for Draco, as opposed to six and a half for the dinosaurs), visual effects producer Julie Weaver and her team did a screen test for Dragonheart six to eight months before actual storyboarding, using a \"stretched out\" version of the Tyrannosaurus rex from Jurassic Park.[2]The film is notably the first to use ILM's Caricature software, as it was developed to help lip-sync Draco's animation to Sean Connery's voiceover work.[5] Draco is often seen as the first fully CGI main character in film, when in reality, that distinction belongs to A knight from the 1985 film young Sherlock Holmes.Draco is however noted as the first computer generated dragon in film.Actual filming began in July 1994 in Slovakia. During sequences with Draco and Bowen in them, visual effects supervisor Scott Squires and his teams used what they called a \"monster stick\"—a pole with a bar and two red circles at the top—as an indicator for where Draco's eyes would be for Quaid's reference. They also set up speakers through which Cohen would read Draco's lines for Quaid, which Quaid said \"helped [him] out a lot.\"[2]While filming the scenes involving Draco in flight, the crew used a microlight as reference, and then edited the footage to \"put Draco over the top of that and remove any traces of the aircraft.\"[2]Although Draco is fully rendered in CGI, full-sized models of some of Draco's body parts were used for some of the scenes. One of them was Draco's foot, which was used to pin Bowen to the ground, and the other was Draco's jaw during the scene where Bowen gets trapped inside it. While the foot was a non-moving prop, the jaw had moving parts and was operated by a puppeteer.[2]According to Cohen, they spent an additional thirteen months working on the film after making the final cut of the film. He was in Rome to shoot Daylight on-location during this period, and had to review animation sequences with ILM and give them his comments and instructions through a satellite hookup.[2]The score was composed by Randy Edelman. The main theme song, \"The World of the Heart\" and \"To the Stars\", were used in film trailers as Two Brothers, Mulan, and Seven Years in Tibet, clip montages at the Academy Awards, numerous other film trailers, and the closing credits of the U.S. broadcasts of the Olympic Games, making it a well known film score.[6] MCA Records released the film's soundtrack album on May 28, 1996, which contains 15 music tracks.","produced_by":"Raffaella De Laurentiis","starring":"Dennis Quaid Sean Connery David Thewlis Pete Postlethwaite Dina Meyer Jason Isaacs Brian Thompson Julie Christie","running_time":"103 minutes","Other media":"After its release, Dragonheart spawned a spin-off 2D hack and slash game for the PlayStation and Saturn called Dragonheart: Fire & Steel, made by Acclaim Entertainment, which was met with mostly negative reviews due to bad gameplay, poor quality graphics, and a generally unimaginative design. In late 1996, Acclaim ported a PC version of the game, which received similar criticism.[12] There was also an original Game Boy game based on the film.","music_by":"Randy Edelman","Release":"The film was released in the US and Canada on May 31, 1996, and earned $15,027,150 during its opening weekend.[1]Dragonheart was released on VHS on April 8, 1997, and on DVD as a \"Collector's Edition\" on March 31, 1998. The film was later released on HD DVD on May 29, 2007. Dragonheart and Dragonheart: A New Beginning were released together on a one-disc print known as \"2 Legendary Tales\" on March 2, 2004. Dragonheart was released on Blu-ray Disc on March 27, 2012.Charles Edward Pogue wrote a novelization of DragonHeart based on his screenplay, which was published in June 1996. It has been released in several languages and in five editions in the U.S. to critical acclaim, with readers praising Pogue's writing, how the book develops the story, setting, and characters more than the film, also noting its darker and more serious tone compared to that of the film. In 1999, the film was adapted as a junior novelization by Adriana Gabriel.","budget":"$57 million"}