{"Cast":"In credits order:[1]There are several cameo appearances in D2: The Mighty Ducks from famous athletes.Mighty Duck players that were in the first film but not this one:","distributed_by":"Buena Vista Pictures","Plot":"Former peewee ice hockey coach Gordon Bombay is a star in the minor leagues and is expected to make it to the National Hockey League soon. However, after a career-ending knee injury, he returns to Minneapolis. Bombay is then offered a chance to coach a team representing the United States in the Junior Goodwill Games. Team USA consists of many of the old Ducks, in addition to five new players with special talents.The lure of celebrity becomes a distraction to Bombay, who begins to neglect the team in exchange for a luxurious lifestyle. Fortunately, easy victories come over Trinidad and Tobago and Italy in the double-elimination tournament. During this time, Fulton Reed and Dean Portman gain recognition for their enforcer skills, becoming known as the \"Bash Brothers\". Backup goaltender Julie asks Bombay for a chance to play, but he tells her to wait, as current goalie Greg Goldberg is on a hot streak.Reality sets in when the team suffers an embarrassing 12-1 defeat at the hands of Team Iceland, coached by ex-NHL player Wolf \"The Dentist\" Stansson, who is known for his tough reputation. Team USA plays badly, with Julie and Portman ejected from the game. Star center Adam Banks manages to score a goal but gets slashed in the wrist moments later. Frustrated, Bombay drives his players even harder, but they begin to suffer, completely exhausted. His practice sessions become brutal and long. Realizing the children are too tired to complete their school work or even stay awake in class, the team's tutor, Michelle McKay, intervenes. She cancels the practice and confronts Bombay. Now better rested, the players come across a street hockey team who teaches them how to play like \"the real Team USA\".However, Bombay continues to suffer until Jan, the brother of Bombay's mentor Hans, personally visits him, and reminds him of how he used to love the game. During a match against Team Germany, Bombay fails to arrive on time, forcing Charlie to tell the referee that Michelle is actually the team's assistant coach. The team is struggling, entering the third period tied, until Bombay shows up and apologizes for his behavior. Inspired by their coach's \"return\", the players come back to win the game with the \"Flying V\" move, and advance to the next round. The renewed Bombay finally realizes Adam's wrist injury, benching him despite his complaints. To fill the open roster spot, Charlie recruits local street hockey player, Russ Tyler, whose unique \"knucklepuck\" (which rotates end over end toward its target as opposed to spinning about its centerline) secures USA's victory over Russia (who defeated Iceland earlier in the tournament), advancing USA to the championship game for a rematch against Iceland. Before the game, Adam's injury is healed and returns to Team USA's locker room, only to find they already have a full roster. Charlie gives up his spot on the roster so Adam can play, cementing his position as the true team captain.At first, Iceland appears to be out to dominate Team USA again, but they manage to score one goal. Unfortunately, the Ducks take penalties: Ken picks a fight with an Iceland player (\"stick, gloves, shirt\") after scoring the team's first goal, the Bash brothers celebrate this by fighting with the entire Iceland bench and Dwayne lassoes an opposing player, about to check Connie. Bombay is annoyed because \"this isn't a hockey game, it's a circus.\"After a motivational locker room speech from Bombay and new Duck jerseys from Jan, the team emerges rejuvenated. The Ducks manage to tie the game with a score from Connie, Banks, Luis, and finally when Russ outsmarts Team Iceland by disguising himself as Goldberg, so as to prevent himself from being covered and pulling off a successful \"knucklepuck\". The game is forced to go to a five-shot shootout. With a 4-3 score in favor of the Ducks, Gunnar Stahl (the tournament's leading scorer) is Team Iceland's final shooter. Bombay knows Gunnar favors shooting the glove side after a triple deke, and replaces Goldberg with Julie, who has a faster glove. Gunnar advances on Julie and fires a hard slapshot. Although Julie falls to the ice, she slowly turns to look at her glove while the entire stadium (and presumably the home audience of millions) waits in breathless anticipation. She then opens her glove and drops the puck, signifying the game-winning save. With this, the Ducks triumph over Iceland to win the tournament. Despite Wolf's disappointment, he congratulates Bombay and Gunnar, being the gentleman he is congratulates Charlie stating \"Good work, Captain Duck\".The film concludes with the team returning to Minnesota on a plane and sitting around a campfire singing Queen's \"We Are the Champions\" as the credits roll.","language":"English Icelandic","Reaction":"The film received negative reviews. It has received a 21% rating on Rotten Tomatoes (actually making it the most well received entry of the series on the site).[2]Desson Howe of The Washington Post wrote: \"D2: The Mighty Ducks reaches an extraordinary low – even for a Disney sequel. This unctuous barrage of flag-waving, message-mongering, counterfeit morality, which contains the stalest kiddie-team heroics in recent memory, makes the original, innocuous 'Ducks' look like one of the Great Works.\"[3]In its opening weekend, the film grossed $10,356,748 domestically.[4][5] It was a financial success, with a final domestic box office total of $45,610,410.","box_office":"$45.6 million","cinematography":"Mark Irwin","production_company":"Walt Disney Pictures The Kerner Entertainment Company Avnet–Kerner Productions","directed_by":"Sam Weisman","d2:_the_mighty_ducks":"Theatrical release poster","release_dates":"March 25, 1994 (1994-03-25)|||||","produced_by":"Jon Avnet Jordan Kerner","starring":"Emilio Estevez Joshua Jackson Michael Tucker Jan Rubes Kathryn Erbe","running_time":"106 minutes","music_by":"J. A. C. Redford","edited_by":"John F. Link Eric Sears","written_by":"Steven Brill"}