{"distributed_by":"Screen Gems Sony Pictures Entertainment","DVD release":"The DVD was officially released in the US on January 22, 2008, and has also been released on iTunes. In the United Kingdom and Ireland the film was released direct to DVD in June 2010.","blonde_ambition":"DVD cover","Plot":"When Katie Gregerstitch visits her boyfriend Billy in New York, she finds him in bed with another woman. Thus, Billy breaks up with Katie, who then leaves to stay with her close friend Haley. She convinces Katie to start an independent life of her own, instead of sitting around doing nothing. One day, when Haley has to go to an audition, Katie takes over her job as a messenger and eventually has to deliver a shipment to a large building construction company.The deputy director of that company, Debra, preys on the job of Richard and has come up with a plan to frame Richard for sabotage, in order to take over the company. To help herself with that, she makes sure that Richard’s secretary gets dismissed and that the naive Katie takes her place. Katie meanwhile meets Ben, who works as a postman in the building, and befriends him.After losing a contract, by Debra’s doing, Katie gets fired, but by using her charms, she manages to get a second chance from Richard. When she manages to get the interest of a group of Norwegian investors, Richard shares an important confidential project with her. Debra manages to get the confidential information out of Katie and thereby make sure that the Board of Directors fires Richard.Meanwhile, Katie has discovered that Ben is actually Richard’s son. Together with him, she devises a ruse to outsmart Debra. When Debra proposes the project to the investors, she sends out Haley and some friends, who pose as the investors. At the same time, she presents her own proposal to the real investors, who satisfyingly take it. When Debra discovers the deception, she goes ballistic and thus gets fired.","language":"English","box_office":"$1,530,479[1]","directed_by":"Scott Marshall","release_dates":"December 21, 2007","Box office":"It was released into eight theatres in Texas, the home state for stars Simpson and Wilson, on December 22, 2007 before a DVD release date on January 22, 2008.[3] Blonde Ambition averaged $48 per screen on December 22, 2007 for a total box office of $384 . This meant, based on an $8 ticket price, that only 6 people paid to see the movie at each of those eight theatres and only 48 people in total went to see the movie.[4]Opening weekend, the film finished 54th at the North American box office with a three-day gross of $1,332 and a per-theatre-average of $165.[5][6] In Ukraine, however, the film opened at #1 in its first weekend (February 16–17, 2008), earning $253,008.[7] In Russia, Blonde Ambition opened up at #7 at box office and has grossed $399,854 to date, and in the Philippines it opened at #5 and has grossed $16,538 to date.[8]Blonde Ambition, despite being a box office disappointment, impressively grossed $2.7 million in the first five days of DVD release ranking #23 on the DVD sales chart. This is possibly due to Jessica Simpson's fanbase supporting her.[9] Since the movie's DVD release date it has grossed $11.56 million in the United States.[10]","produced_by":"Justin Berfield Jason Felts","starring":"Jessica Simpson Luke Wilson Drew Fuller Paul Vogt Willie Nelson Rachael Leigh Cook","running_time":"93 minutes","written_by":"Matthew Flanagan David McHugh","budget":"$40,000,000"}