{"country":"United States","distributed_by":"20th Century Fox","dreamscape":"Theatrical release poster","screenplay_by":"David Loughery Chuck Russell Joseph Ruben","story_by":"David Loughery Roger Zelazny","Plot":"Alex Gardner (Dennis Quaid) is a psychic who has been using his talents solely for personal gain, which lately consists mainly of gambling and womanizing. When he was 19 years old, Alex had been the prime subject of a scientific research project documenting his psychic ability, but in the midst of the study, he disappeared. After running afoul of a local gangster/extortionist named Snead (Redmond Gleeson), Gardner evades two of Snead's thugs by allowing himself to be taken by two men, Finch (Peter Jason) and Babcock (Chris Mulkey), who identify themselves as being from an academic institution.At the institution, Alex is reunited with his former mentor Dr. Paul Novotny (Max von Sydow) who is now involved in government-funded psychic research. Novotny, aided by fellow scientist Dr. Jane DeVries (Kate Capshaw), has developed a technique that allows psychics to voluntarily link with the minds of others by projecting themselves into the subconscious during REM sleep (in other words, while they are dreaming). Novotny equates the original idea for the dreamscape project to the practice of the Senoi natives of Malaysia, who believe the dream world is just as real as reality.The project was intended for clinical use to diagnose and treat sleep disorders, particularly nightmares, but it has been hijacked by Bob Blair (Christopher Plummer), a powerful government agent. Novotny convinces Alex to join the program in order to investigate Blair's intentions. Alex gains experience with the technique by helping a man worried about his wife’s infidelity, and by treating a young boy named Buddy (Cory Yothers) who is plagued with nightmares so terrible that a previous psychic lost his sanity trying to help him. Buddy's nightmare involves a large sinister \"snakeman\".A subplot involving Alex and Jane’s growing infatuation culminates with him sneaking into Jane's dream to have sex with her. He does this without technological aid, something no one else has been able to achieve. With the help of novelist Charlie Prince (George Wendt), who has been covertly investigating the project for a new book, Alex learns that Blair intends to use the dream-linking technique for assassination.Blair murders Prince and Novotny to silence them. The President of the United States (Eddie Albert) is admitted as a patient; Blair assigns Tommy Ray Glatman (David Patrick Kelly), a psychopath who murdered his own father, to enter the President's nightmare and assassinate the President. Blair considers the President's nightmares about nuclear holocaust a sign of political weakness, a liability in the upcoming negotiations for nuclear disarmament.Alex and Jane manage to get close enough to the President’s room for Alex to project himself into the President's dream and save him. After a fight in which Glatman rips out a police officer's heart, attempts to incite a mob to attack the President, and battles Alex in the form of the snake-monster from Buddy's dream, Alex assumes the appearance of Glatman's murdered father (Eric Gold) in order to distract him, allowing the President to impale Glatman with a spear. The President is grateful to Alex but reluctant to confront Blair, who wields considerable political power. To protect himself and Jane, Alex enters Blair’s dream and murders him before Blair can retaliate.The film ends with Jane and Alex boarding a train to Louisville, Kentucky, intent on making their previous dream encounter a reality. They are surprised to meet the ticket collector from Jane's dream.","language":"English","Release and reception":"Dreamscape was released on August 15, 1984. This was the second film released to movie theaters that was rated PG-13 under then new MPAA ratings guidelines following Red Dawn, which had come out five days prior.Dreamscape has a 75% 'Fresh' rating on review aggregator Rotten Tomatoes from 28 critics. The RT consensus is \"Dreamscape mixes several genres — horror, sci-fi, action — and always maintains a sense of adventure and humor.\"[4] The film is ranked #93 on Rotten Tomatoes' Journey Through Sci-Fi (100 Best-Reviewed Sci-Fi Movies).[5]","box_office":"$12,145,169[2]","cinematography":"Brian Tufano","production_company":"Zupnik-Curtis Enterprises","directed_by":"Joseph Ruben","release_dates":"August 15, 1984 (1984-08-15)|||||","Production":"According to author Roger Zelazny, the film developed from an initial outline that he wrote in 1981, based in part upon his novella, \"He Who Shapes\", and novel, The Dream Master. He was not involved in the project after 20th Century Fox bought his outline. Because he did not write the film treatment or the script, his name does not appear in the credits; assertions that he removed his name from the credits are unfounded.[3]","produced_by":"Chuck Russell Bruce Cohn Curtis","starring":"Dennis Quaid|Max von Sydow|Christopher Plummer|Eddie Albert|Kate Capshaw|David Patrick Kelly|","running_time":"99 minutes","music_by":"Maurice Jarre","edited_by":"Lorenzo DeStefano Richard Halsey","budget":"$6 million[1]"}