{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Leigh Whannell","story_by":"James Wan Leigh Whannell","Plot":"Jamie Ashen (Ryan Kwanten) and his wife, Lisa (Laura Regan), receive an anonymous ventriloquist doll called \"Billy\". While Lisa is playing with Billy, a figure approaches her, causing her to scream. Jamie finds her dead with her tongue cut out. After Jamie is released from custody by Detective Jim Lipton (Donnie Wahlberg) due to lack of evidence, he spots inside Billy's box a mysterious message about \"Mary Shaw\", a ventriloquist from his hometown, Raven's Fair.At Raven's Fair, Jamie visits his estranged, wealthy and wheelchair-bound father, Edward (Bob Gunton), and his much-younger wife, Ella (Amber Valletta), for information regarding Mary Shaw. Dismissing them as superstitions, Jamie arranges for Lisa's funeral with the help of a local mortician, Henry Walker (Michael Fairman). Jamie meets Henry's senile wife, Marion, who tells him of the danger of Mary and her puppet, Billy. After burying Billy, Jamie is confronted by Detective Lipton, the latter still doubting Jamie, and forces him to dig up Billy.Henry tells Jamie about Shaw: Shaw (Judith Roberts) was a famous ventriloquist who was publicly humiliated when a boy, Michael, pointed to her moving mouth. Michael disappeared the next day, and his family blamed it on Shaw, whose last wish was to have her body turned into a dummy and buried with her 101 dolls. Henry, then the young son (Keir Gilchrist) of the local mortician, saw Shaw, having been executed by Michael's family, rise up, but Henry was spared thanks to his having kept his mouth shut. This is because Shaw only takes her revenge by killing those who scream. Jamie finds out that Michael, the first victim, was his great uncle; the Ashen family were the ones who killed Shaw by cutting out her tongue, and she has been seeking revenge against their entire bloodline by killing them the same way.Henry is killed by Shaw. Detective Lipton discovers that all of Shaw's dolls have been dug up. He informs Jamie, who receives a call from \"Henry,\" asking him to go to Shaw's theater. There, the duo discover 100 of the dolls lined up with Michael's body, which has been turned into a marionette. Through a doll, Shaw reveals to Jamie that she killed his wife because she was pregnant with his son, thus killing any potential newborn of the Ashen family. Jamie and Lipton burn the theater and all of Shaw's dolls, though in the process, Shaw successfully makes Detective Lipton scream and kills him.Back at his father's residence, Jamie is confronted by Mary Shaw but he repels her by throwing Billy, the 101st and last of the remaining dummies, into the fireplace. He is horrified to learn that his father had already died a long time ago; the current \"Edward\" is the corpse converted into a doll controlled by Ella, who is the \"perfect doll\" for Shaw, created just before her death. He screams as Ella, possessed by Mary Shaw, goes after him to take his tongue.The film ends with Jamie reciting a nursery rhyme about Shaw. We see a photo album showing the human puppets: Jamie's wife Lisa, Henry, Detective Lipton, his father Edward, Ella, and Jamie himself.","language":"English","box_office":"$22 million[1]","cinematography":"John R. Leonetti","production_company":"Twisted Pictures","directed_by":"James Wan","Soundtrack":"Lakeshore Records released the soundtrack of Dead Silence on March 20, 2007. The CD contains 31 tracks, the first track being the song \"We Sleep Forever\" performed by American rock band Aiden (despite not actually being featured within the film itself). The rest of the CD is taken up by Charlie Clouser's film's score. Clouser has worked on many film scores such as the Saw series and Resident Evil: Extinction.","Post-release commentary":"In his personal blog, screenwriter Whannell reveals the origins of the film within the context of the \"Hollywood\" film industry. In a candid post entitled \"Dud Silence: The Hellish Experience of Making a Bad Horror Film\", Whannell explains that the film was conceived following the advice of his agent at the time and that a \"script doctor\" was eventually employed by the production studio. Whannell concludes the post with a description of the key lessons that were learned following the Dead Silence experience:After everything is said and done, I'm almost glad Dead Silence happened, because it gave me an extreme, coal-face lesson in what not to do. It was like learning to swim by leaping off Niagara Falls. I only write scripts on spec now, which means that I write them in my own time without getting paid and then take them out into the world to see if anyone's interested. Never again will I enter the arranged marriage of selling a pitch. I have also become very gun-shy about working with studios. In the world of independent film, what you write ends up on screen. Plus, they don't have the money to bring in script doctors! Works fine for me. Who knows, maybe one day I will work with a studio again...[9]","release_dates":"March 16, 2007 (2007-03-16)|||||","produced_by":"Mark Burg Oren Koules Gregg Hoffman","starring":"Ryan Kwanten Amber Valletta Donnie Wahlberg Michael Fairman Joan Heney Bob Gunton Judith Roberts Laura Regan","running_time":"89 minutes 92 minutes (Unrated cut)","Alternate footage":"Many alternate scenes were released on the unrated DVD and HD DVD and are listed below:","music_by":"Charlie Clouser","dead_silence":"Theatrical release poster","edited_by":"Michael Knue","Release":"Dead Silence was released in the United States on March 16, 2007,[3] with an \"R\" rating.In the United States, as of April 16, 2007, the film's total gross has been worth US$16.5 million (according to Box Office Mojo), and screenings of Dead Silence were ceased in most theaters sixteen days following its release; the film's estimated production budget was US$20 million. As of April 1, 2009, US$5,408,331 has been generated globally.[4] Tentative plans for a sequel were abandoned.[citation needed]The film received generally negative reviews; Rotten Tomatoes rated the film with a 21% \"Rotten\" based on 76 reviews with a consensus of \"More tasteful than recent slasher flicks, but Dead Silence is undone by boring characters, bland dialogue, and an unnecessary and obvious twist ending.\"[5]The film was released on DVD on June 26, 2007 with an \"unrated\" version was released, and the same occurred for the HD DVD product. The film has since grossed US$17,304,718 in overall DVD sales.[6]Dead Silence was released on Blu-ray Disc in the United Kingdom on October 25, 2010.[7] In May 2015, it was announced that Universal Studios would be releasing the film to Blu-ray Disc in the U.S., set for release on August 11, 2015.[8]","budget":"$20 million[1]"}