{"Cast":"Also appearing in the film were Jon Dalk, Claire Hagen, Paul Gregory White, Robert Lockhart, Karen Anders, Randy Proctor, Lenny Geer, Ivan Nagy, Suzanne Kent, Rose Barton, Richard Lockmiller, Noel De Souza, Leo Rousseau, and Warhol \"superstar\" Ultra Violet.[12]","Tagline":"The film's advertising tagline was \"The most desperate gang of all...ALMOST!\"","distributed_by":"International Cinema Corp.","Production info":"Bad Charleston Charlie was directed by Hungarian still photographer Ivan Nagy and produced by Ross Hagen.[2][5][8] The independent film was produced through a joint venture between Triforum Inc., a company wholly owned by Hagen and Nagy, and Studio 9 Productions.[10][13] The production encountered financing problems when, in May 1972, the U.S. Securities and Exchange Commission filed a complaint against Studio 9 Productions, Bad Charleston Charlie Associates, and others for \"violations of the registration and anti-fraud provisions of the Federal securities laws in connection with the offer and sale of Studio 9 Productions common stock and Bad Charleston limited partnership interests.\"[14] On June 5, 1972, Bad Charleston Charlie Associates and Studio 9 Productions \"consented to a finding\" (without admitting guilt) that they had violated Federal law and they accepted a final judgment of permanent injunction against future such sales.[15]The screenplay was written by Ross Hagen, Ivan Nagy, and actor Stan Kamber from a story by Hagen and Nagy.[8][12] The director of photography was Michael Neyman. The film was edited by Walter A. Thompson and Richard Garritt. The film's music was composed by Luchi DeJesus with sound by William Oliver.[9] Raymond Markham served as art director and Eric Lidberg was the assistant director. The movie was filmed in Eastmancolor and released with a PG (parental guidance suggested) rating from the Motion Picture Association of America.[8][10]","Plot":"Set during the 1920s in the Midwestern United States, the movie revolves around two coal miners, Charlie Jacobs (Ross Hagen) and Thad (Kelly Thordsen), who decide to follow a life a crime like their role model, Al Capone.[5] Jacobs adopts the gangster persona \"Bad Charleston Charlie\", an anachronistic reference to the 1962 song \"Charleston Charlie\". The duo has to deal with forming a gang, learn to handle \"wild women\", bribe corrupt officials, and battle rival gangs plus the Ku Klux Klan.[6] They find that they are no better at being gangsters than they were at mining coal.[7] The film features a cameo from legendary actor John Carradine as a drunken reporter.[6]","language":"English","Reception":"The film was scheduled to make its world premiere with a benefit screening on April 13, 1973.[18] This debut was delayed until Tuesday, May 8, 1973, when the film finally debuted at a charity event hosted by actress Angie Dickinson.[19] This premiere took place at the Avco Center Theater (now the \"AMC Avco Center 4\") in the Westwood neighborhood of Los Angeles. The event raised money for the Oakhill School for Emotionally Handicapped Children and the Reiss-Davis Clinic.[19] The film began playing in the greater Los Angeles area soon after with a national rollout in June 1973.[10]Reviewing the film in May 1973 on its initial release, Kevin Thomas of the Los Angeles Times wrote, \"Bad Charleston Charlie is not merely bad but terrible.\"[3] The filmmakers quoted another part of Thomas' review in their advertising, attempting to spin the negative into a positive: \"Spoofery in nonsensical shenanigans are meant to be the order of the day.\"[4] Modern critics have been no kinder. VideoHound's Golden Movie Retriever gave the film its lowest-possible \"Woof!\" rating and asked in its review of the film, \"Dud of a gangster comedy with terrible acting. A comedy?\"[20] The Motion Picture Guide gives the film a zero-star rating, calling it a \"rancid period-piece\" with a \"cast of no-names\".[21] TV Guide rates the film at zero-stars citing \"incompetent\" direction and noting that Bad Charleston Charlie \"is said to have been [John Carradine's] 401st movie\" but that he \"should have quit at 400\".\"[5]Largely forgotten today, even by most cult movie fans, the film remains unrated at Rotten Tomatoes where they have failed to tally a single review for it.[22] However, several consumer products associated with the film are currently commercially available, including reproductions of the original movie poster,[23] a life-sized standee of the title character,[24] and a women's party costume sold by major retailers including Meijer and Sears.[25][26] The costume includes a \"20's inspired evening dress with beaded hip drape and circle sleeves\", a cloche hat \"with contrasting pleated band and accented with feathers, sequins, and a flower\", plus a \"single-strand beaded necklace\".[25]Bad Charleston Charlie was first released on home video on September 16, 1987, by Home Cinema Corporation. The movie was made available in both the VHS and Betamax videocassette formats.[6]In July 2001, LSI Communications Inc., a company then best known for releasing the Karl Malone's Body Shop series of workout videos, acquired the rights to Bad Charleston Charlie (along with Gregorio and His Angel starring Broderick Crawford and The Caged Man) from Cinevision Inc. The terms of the deal were not disclosed.[27] LSI Communications merged with Peregrine Inc. using a reverse stock swap in February 2002 and shed a number of assets in the ensuing reorganization.[28] In late 2008, the Los Angeles Times reported that this \"lousy 1970s movie\" was available on videotape but not on DVD.[4]Current rights holder Troma Entertainment notes that Bad Charleston Charlie is \"Currently unavailable on video\".[29] As of December 2010[update], the film has yet to be released on DVD or Blu-ray disc. Selected clips from the film can be seen as part of the Ross Hagen-directed 1985 compilation horror movie Reel Horror, available on DVD from Peacock Films.[30]","cinematography":"Michael Neyman","directed_by":"Ivan Nagy[1]","bad_charleston_charlie":"Style A US movie poster","release_dates":"1973","produced_by":"Ross Hagen[2]","starring":"Ross Hagen Kelly Thordsen Hoke Howell Dal Jenkins Carmen Zapata John Carradine","running_time":"90 minutes","music_by":"Luchi De Jesus","edited_by":"Richard Garritt Walter A. Thompson","written_by":"Ross Hagen Ivan Nagy","The Real Charlie":"The film is a highly stylized and fictionalized version of the life and exploits of real-life coal miner turned gangster Shachna Itzik \"Charlie\" Birger.[16] Born in 1881, Birger served in the United States Army from 1901 to 1904. After his honorable discharge he became a cowboy, a coal miner, then later a saloon keeper. In 1920, after the passage of the Eighteenth Amendment to the United States Constitution began the era of Prohibition when the \"manufacture, sale, or transportation of intoxicating liquors\" was made illegal, Birger became a bootlegger. He was at war with the Shelton Brothers Gang for control of (illegal) alcohol sales across Southern Illinois until the Ku Klux Klan began to take over Williamson County. The rival gangs worked together to violently purge the KKK from the area, gunning down its local leaders in 1925 and 1926. With the Klan gone by late 1926, Birger returned to his fight with the Shelton Brothers. When he discovered that Joe Adams, the mayor of West City, Illinois, was assisting the Sheltons, Birger threatened Adams and ultimately ordered his murder. Birger was arrested in June 1927, convicted, and hanged in April 1928. He was to be the last man executed by public hanging in the state of Illinois.[16][17] (Another Illinois convict, Charles Shader, was executed by hanging in October 1928 but that execution was not open to the public.)[16]"}