{"based_on":"novel Beau Geste by P.C. Wren","beau_geste":"film poster by Frank McCarthy","country":"United States","distributed_by":"Universal Pictures","Plot":"A column of the French Foreign Legion arrives at the remote Fort Zinderneuf, having been assigned to relieve the legionnaires who had been defending the fort. Upon their arrival, they find that the fort has been ravaged by Tuareg attacks and American Beau Graves (Guy Stockwell) is the only survivor. After his badly injured arm is amputated, he is asked what has happened and his story is revealed in flashback.Beau's column had been serving under Lieutenant De Ruse (Leslie Nielsen) and Sergeant Major Dagineau (Telly Savalas), the latter of whom is notorious for his harsh treatment of the men under his command. He is especially tortuous on Beau's class of recruits, hoping this will get them to reveal to him which of the men is the author of an anonymous letter Dagineau has received threatening his life. Although he has no proof, he suspects Beau, which earns Beau particularly brutal treatment. To ferret out more information, Dagineau uses the serves of the slimy toady Boldini, who has reenlisted in the Legion promoting him to Corporal as reward for his spying on the men.Beau's background leads De Ruse to nickname him Beau \"Geste\". Specifically, Beau had run away and joined the Legion after having falsely confessed to an embezzlement actually committed by his business partner. Beau had taken the blame for the sake of his partner's wife, whom Beau also loved. His noble gesture (French: beau geste) had proven futile, however, as the partner confessed and committed suicide just a few months later. That development prompts the suggestion that Beau might reclaim his lost love upon returning home. But he deems it unfair to ask her to wait for him, as he is now committed to a five-year enlistment, with no guarantee he'll survive it. Over brandy, De Ruse informs Beau of Dagineau's background as a former St. Cyr educated officer who was broken to the ranks when his entire command deserted from his leadership.De Ruse and his men are assigned to relieve Fort Zinderneuf, but on the way there the Legion detachment is attacked by the Tuaregs where De Ruse is mortally wounded and is infirmed upon the group's arrival. With Dagineau back in charge, the brutality returns and it isn't long before the legionnaires mutiny, with everyone except Beau and his brother John (Doug McClure) set upon executing the sergeant. Just as they are about to do so, the Tuareg attack. Despite their personal hatred for Dagineau, no one doubts his excellence as a battle commander, so Beau convinces the men to release him that he may lead them in defending the fort.As legionnaires are killed in relentless waves of Tuareg attacks, Dagineau props up the bodies of the dead men on the fort's ramparts with their rifles pointing at their attackers. Between attacks, De Ruse speaks privately with Beau and confesses to being the author of the letter. He had hoped to frighten Dagineau into showing more humanity toward his troops. As he dies, De Ruse laments that in fact, it only caused Dagineau to treat the men even more harshly.The legionnaires try to hold out against the attacks, with Dagineau confidently proclaiming that relief is on the way to them. But eventually, the only ones left alive are Dagineau and Beau, who has a seriously wounded arm. When the predicted relief column arrives, Dagineau delays their entry so he can settle things with Beau once and for all. He tells Beau that the Legion is need of heroes, and that all of the dead men around them can be presented as those heroes, so long as no one ever knows that they had mutinied. Therefore, he cannot leave Beau alive to reveal the truth of what had occurred at Fort Zinderneuf. Beau and Dagineau fight, with Beau finally gaining the upper hand and shooting and killing Dagineau.Beau's flashback ends to reveal that he has not actually been relating this story to the relief commander who had questioned him about what happened at the fort. Still awaiting Beau's response, the commander repeats his query, and Beau tells him only that the men laid down their lives protecting the fort. With no mention of Dagineau's brutality, nor of the mutiny, Beau presents the entire group as heroes — just as Dagineau had wanted.The commander informs Beau that the Legion's high command has decided that Fort Zinderneuf is no longer worth protecting and they will now abandon it. Having lost his arm, Beau will be discharged, and the commander offers his hope that Beau has someone to whom to return. Beau smiles pensively and replies that he indeed does.","language":"English","cinematography":"Bud Thackery","directed_by":"Douglas Heyes","release_dates":"September 7, 1966 (1966-09-07)","Production":"Gene Kelly was originally set to produce and direct under his contract with Universal. He called the book \"a minor 20th century classic... we're not updating it.\"[2] When he left Universal to make a movie at 20th Century Fox the film was produced by Walter Seltzer under his deal with Universal.[3] Seltzer wanted to make the movie because it had \"a pre-sold title and essentially contains those elements of romance and adventure which originally were what movies were all about... escapism... What struck me were the vitality of the characters and an adventure where you could be outrageous. By this I mean a time and a place so far away as to permit high adventure without the necessity of spoofing it.\"[1]Seltzer said the budget would be $4 million, $2.5 million for production, the rest for prints and advertising:Unlike the two before, we have no stars as such. We're betting on unknowns. Well, that's a misnomer; they're known but they're not stars. Certainly not superannuated ones... [Because we want] To attract the young audience - who constitute roughly 80% of the moviegoing public.[1]Among the changes from earlier versions included:It was written and directed by Douglas Heyes who Selzter said \"is very visual minded.\"[1] The star, Guy Stockwell, was under contract to Universal and had just made The War Lover with Seltzer.[4] Stockwell said that Heyes \"just tried to write a screenplay that would work. He had to keep telling himsself that previous versions were really bad.\"[4]As a publicity gimmick, Seltzer tried to track down a number of foreign legion veterans, asking to see if they were interested in appearing in the film.[5] They received over 500 enquiries and 188 applicants, eventually casting 25, eight of whom lived near Los Angeles.[6]Filming started November 1965. It was shot near Yuma with interiors at Universal studios.[7]The film was the last credited work of Donald Robert Overall Hatswell (born July 3, 1898 in Norwood, Surrey, died: June 29, 1976). Hatswell was a former World War One Royal Navy Officer whose collection of over 720,000 picture postcards of uniforms and medals led him to be a Hollywood movie technical advisor[8][9] Joseph Kane acted as the film's second unit director.","produced_by":"Walter Seltzer","starring":"Guy Stockwell Doug McClure Leslie Nielsen Telly Savalas","running_time":"103 minutes","music_by":"Hans J. Salter Hal Hopper (Beau Geste March)","edited_by":"Russell F. Schoengarth","written_by":"Douglas Heyes","budget":"$2.5 million[1]"}