{"original_language(s)":"English","production_company(s)":"New Line Cinema Chanticleer Films","Plot":"Barry Thomas is bored with his job and moons over high-profile scientist Lisa Fredericks. On the way home, Barry sees Lisa fatally shot and takes it very hard. While at home at midnight, he receives a strong electrical shock. The next morning the events of the previous day are repeating themselves and Barry is the only one who realizes that the world is stuck in a time loop. During several repetitions, Barry figures out how to save Lisa and get closer to her. His actions also get him fired and arrested for knowing too much about events. Barry and Lisa eventually learn that her boss, Dr. Thadius Moxley, is conducting illegal and unethical experiments with faster-than-light particle acceleration that have caused the time loop. In fact, it was Lisa's partial knowledge of Dr. Moxley’s illegal activities that resulted in her murder by his henchmen. After getting involved with an undercover government agent, they must stop her boss from starting his experiment at the end of a loop or the world will be trapped forever repeating the same day.Expanding on the original's premise of a one-hour time loop, this version saw the main character reliving the same 24-hour period, which would restart at one minute past midnight (rather than midday as in the other versions). It also contains a pseudo-happy ending, as the protagonist ultimately finds a way to correct the time loop over the course of the film’s 92-minute running time.","country_of_origin":"United States","original_network":"Fox Network","cinematography":"Anghel Decca","12:01":"US DVD Cover","directed_by":"Jack Sholder","original_release":"July 5, 1993 (1993-07-05)|||||","theme_music_composer":"Peter Rodgers Melnick","Legal action":"The film Groundhog Day, which has a similar time loop premise, was also released in 1993. The writers and producers of 12:01 believed their work was stolen by Groundhog Day.According to Richard Lupoff:","editor(s)":"Michael N. Knue","starring":"Jonathan Silverman Helen Slater Jeremy Piven Martin Landau","running_time":"92 minutes","producer(s)":"Robert John Degus Jonathan Heap Cindy Hornickel Aaron Meyerson","Release":"The movie was released on DVD in the United States on November 28, 2006.","written_by":"Richard Lupoff Jonathan Heap Philip Morton"}