{"based_on":"Characters  by Peter Farrelly Bobby Farrelly Bennett Yellin","country":"United States","dumb_and_dumberer:_when_harry_met_lloyd":"Theatrical release poster","distributed_by":"New Line Cinema1","screenplay_by":"Troy Miller Robert Brener","story_by":"Robert Brener","Plot":"In 1986, Harry Dunne (Derek Richardson) finally gets his chance to go to regular school. At the same time, Lloyd Christmas (Eric Christian Olsen) has been adopted and exchanged several times until he is finally accepted by the school janitor, Ray (Luis Guzmán). Harry bumps into Lloyd on the way to school, in search for a treasure his mother (Mimi Rogers) asked him to find, and as if it were destiny, the two instantly became the best of friends. Lloyd introduces Harry to his \"friend\", Turk (Elden Henson), the school bully whose main function in life appears to be making Lloyd's life miserable. After putting Lloyd in a trash can, he hoists the two friends up a flagpole. Meanwhile, the corrupt Principal Collins (Eugene Levy) is searching for a way to get a large amount of money to get a condominium in Waikiki, Hawaii for him and his girlfriend, Ms. Heller (Cheri Oteri), the school's cafeteria lady. Seeing Harry and Lloyd getting hoisted on a flagpole, Principal Collins establishes a fake \"special needs\" class to swindle $100,000 from a former Special Needs student named Richard Moffit. Obviously, Harry and Lloyd are more than thrilled to help, unaware of the real reason, and thus find themselves signing up people who are \"special\" for the class. These include a reluctant Turk; a teen named Toby (Josh Braaten) who broke his leg and arm in a skateboarding accident—and whom Lloyd believes is a \"little crippled boy\"; Toby's gorgeous girlfriend, Terri (Teal Redmann); geeky Lewis (Shia LaBeouf), whom Harry and Lloyd believe is a centaur after seeing him half-dressed in his horse mascot uniform; Cindy (Michelle Krusiec), also known as \"Ching-Chong,\" a Chinese exchange student who later becomes Turk's girlfriend; and Carl (William Lee Scott), a badly injured football player obsessed with his sport. Ms. Heller becomes the teacher of the fake class and holds it in Ray's tool shed.Jessica Matthews (Rachel Nichols), a headstrong student and reporter for the school paper, is suspicious of Principal Collins' sudden contribution. Jessica invites Harry over to her house for dinner and asks Harry for information. Harry, who thinks that she is flirting with him, turns to Lloyd for courtship tips. A repulsive disaster involving Jessica's bathroom and a melted chocolate bar that looks like feces makes her father (Bob Saget) freak out, inadvertently directing her attention to Lloyd. Soon, Harry and Lloyd get into a fight over Jessica, without her knowing it. Inevitably, the two make amends when Harry and Lloyd realize that they were nothing without each other. They find Principal Collins' chest in his office which contains evidence of every scam he and Ms. Heller ever pulled. The next day, Principal Collins finds his evidence chest missing, and falsely accuses Jessica of taking it. It so happens that the Special Needs class was asked to build a float for President's Day at that time; instead of building a float with George Washington as the main attraction, they change it to look like Principal Collins as a pirate with repeated recordings of his evidence. Before bringing out the float, they call the police. During the parade, the superintendent of the school district has a police detective pose as Richard Moffit, so Principal Collins would fall for it. Eventually, the Special Needs class brings out their float to prove Principal Collins and Ms. Heller as thieves, exposing their plot. Principal Collins and Ms. Heller are arrested before they could get away with the money, and Jessica is grateful for Harry and Lloyd and regards them as heroes. However, just like in the original film, the duo's advances to Jessica were in vain, since it turned out that she had a boyfriend. As the couple rode off, Harry and Lloyd vowed never to fight and risk their friendship over a woman, again; that vow was repeatedly broken. As the guys head home, they are approached by Fraida Felcher (Julia Costello) and her twin sister, Rita (Chandra Costello) in a Ferrari, who offer to take them to a huge girls' party. Harry and Lloyd turn them down, and Harry gets covered in mud. Jessica's father accidentally hits him with his Mercedes, with Harry getting his windshield and hood covered with mud, leaving her father to think he got his car covered in feces, just like when Harry made a mess of Jessica's bathroom.","language":"English","Reception":"Dumb and Dumberer: When Harry Met Lloyd was panned by critics. It holds a 10% rating on the review aggregate website Rotten Tomatoes with an average score of 2.8/10. The critic consensus state: \"This lame prequel induces more groans than laughs. Rent the original instead.\"[3]","box_office":"$39.3 million[1]","cinematography":"Anthony B. Richmond","production_company":"Burg/Koules Productions Dakota Pictures Avery Pix","directed_by":"Troy Miller","release_dates":"June 13, 2003 (2003-06-13)|||||","Production":"Much of the film was filmed in Atlanta. Many of the school scenes were filmed at Walton High School in Marietta and at the Atlanta International School in Fulton County.[citation needed] The Farrelly brothers, who co-wrote and directed the original Dumb and Dumber, had no involvement in this film whatsoever, nor did Jim Carrey or Jeff Daniels, who played Lloyd and Harry in the original film. Although Peter Farrelly has never seen the prequel, he went on record as saying that he holds no ill-will against the movie and wished the filmmakers well on it. This marked the first time that a sequel or prequel had been made to a Carrey film for which he declined to reprise his role. Others to follow were Son of the Mask, Evan Almighty, and Ace Ventura, Jr.: Pet Detective.[2]","produced_by":"Troy Miller Brad Krevoy Mark Burg Oren Koules Toby Emmerich","starring":"Derek Richardson Eric Christian Olsen","running_time":"85 minutes","music_by":"Eban Schletter","edited_by":"Lawrence Jordan","budget":"$19 million"}