{"breakheart_pass":"Theatrical poster, artwork by Mort Künstler","country":"United States","distributed_by":"United Artists","Plot":"In the 1870s, residents of the garrison at the Fort Humboldt Army outpost are reported to be suffering from a diphtheria epidemic. A train is heading towards the fort filled with reinforcements and medical supplies. There are also civilian passengers on the train – Nevada Governor Fairchild (Richard Crenna) and his fiancée Marica (Jill Ireland), the daughter of the fort's commander.The train stops briefly in Myrtle, where it takes on board local lawman Sheriff Pearce (Ben Johnson) and his prisoner, John Deakin (Charles Bronson), a notorious outlaw who was identified via a picture in a newspaper article. But as the journey goes on, several train passengers, including most of the train's soldier escort, are mysteriously killed or go missing. Deakin, who is actually a Secret Service agent, discovers en route that the \"epidemic\" at the outpost is actually a conspiracy between a group of killers led by the notorious outlaw Levi Calhoun (Robert Tessier), and a tribe of Indians under Chief White Hand (Eddie Little Sky). Instead of medical supplies, the train transports a large secret shipment of weapons, ammunition and dynamite stolen from U.S. manufacturers for sale to the Indians, in return for allowing Calhoun and his men to mine and smuggle gold from their lands. Most of the people on the train, including Governor Fairchild and Sheriff Pearce, are Calhoun's partners in crime, and those innocents who discover the evidence for his sinister plot are quickly silenced. Eventually, Deakin narrows his list of allies down to Marica and Army Major Claremont (Ed Lauter), who agree to assist Deakin in his efforts to prevent the arms delivery.At Breakheart Pass, all hell breaks loose as Indians attack the train to take the weapons they were promised, and Calhoun and his men ride out to take the train in order to find out what's going on. Deakin and Claremont use dynamite to ground the train before it reaches the fort, and while Deakin runs interference, Claremont rushes to Fort Humbolt to free the soldiers imprisoned by Calhoun's gang. A gunfight breaks out when the freed soldiers clash with the Indians and bandits at the train; Calhoun is killed by Fairchild when he threatens Marica, but the governor is then in turn cut down by Claremont. At the end of the battle, Deakin interceps Pearce and shoots him when the corrupt Sheriff decides to go down fighting.","language":"English","Reception":"The Los Angeles Times called it \"a fun if familiar picture but is played so broadly on such an elementary level that it can hope to satisfy only the most undemanding of viewer.\"[14]The film was a box office disappointment in the US.[15]","cinematography":"Lucien Ballard","directed_by":"Tom Gries","Home media":"Kino Video released \"Breakhart Pass\" for the first time on Blu-ray on August 12, 2014.","Soundtrack":"A limited edition (3,000 run) CD soundtrack of Breakheart Pass, highlighting the original music of Jerry Goldsmith, was released by La-La Land Records. It is out of print.[16]","release_dates":"December 25, 1975 (premiere in Finland)[1]","Production":"Producers Elliott Kastner and Jerry Gershwin had filmed a number of Alistair MacLean novels previously, including Where Eagles Dare and When Eight Bells Toll.Charles Bronson was paid $1 million plus 10% of the gross for his role.[9]Portions of the movie were filmed in Pierce and Reubens in northern Idaho.[6][10]Railroad scenes were filmed on the Camas Prairie Railroad (based in Lewiston),[6][8][11] using Great Western Railway steam locomotive #75.[12]The film production company spent $500,000 hiring the train tracks and carriages.[9]Alternating shots of clear and overcast skies are present in the final climactic scenes.Veteran stuntman Yakima Canutt,[4] age 79, performed second unit direction for the film and his son Joe was one of the stuntmen.[13]Lewiston realtor Irv Falling, a retired Army colonel, played Jill Ireland's father in the final scene, an army colonel. He had helped the Bronsons find a home to rent in the area.[4][6]","produced_by":"Jerry Gershwin Elliott Kastner","starring":"Charles Bronson Ben Johnson Richard Crenna Jill Ireland","running_time":"95 min.","music_by":"Jerry Goldsmith","edited_by":"Byron Brandt","written_by":"Alistair MacLean","budget":"$6 million[2]"}