{"country":"United States","distributed_by":"HBO Documentary","The film":"The film covered the events in Birmingham, Alabama in 1963 related to civil rights demonstrations and the movement to end racial discrimination in local stores and facilities. In 1963 Rev. Dr. Martin Luther King arrived in the town to help with their strategy. People of the community met at the 16th Street Baptist Church while organizing their events. The demonstrations were covered by national media, and the use by police of police dogs and pressured water from hoses on young people shocked the nation. So many demonstrators were arrested that the jail was filled.A local chapter of the Ku Klux Klan placed bombs at the Baptist Church and set them off on Sunday morning 15 September 1963. Four young girls were killed in the explosion. The deaths provoked national outrage, and that summer the US Congress passed the Civil Rights Act of 1964, which was signed by President Lyndon B. Johnson.The film ends with trial and conviction of Robert Edward Chambliss [also known as Dynamite Bob] in 1977 as the main person responsible for bombing. The film also delves into black churches being set on fire in Birmingham in 1993, giving the impression that while progress has been made, there are some aspects that still haven’t changed.","language":"English","Reception":"The film was nominated for an Academy Award for \"Best Documentary\".[1]The film was planned to air first on HBO but, after seeing the final product, the production team decided it was important to release the film in theatres before running it on television.[2] 4 Little Girls opened in American theaters on July 9, 1997 and closed on October 2, 1997. It grossed $130,146 from a total of four theaters. In its opening weekend, it earned $13,528 from a single theater, which was 10.4% of its total gross.[5] It cost approximately $1 million to make, funded by Home Box Office (HBO).[3]","box_office":"$130,146 (U.S. sub-total)","cinematography":"Ellen Kuras","directed_by":"Spike Lee","release_dates":"July 9, 1997 (U.S.) September 6, 1997 (Canada)","Production":"Lee first became interested in making a film about the Birmingham bombing as a student at New York University in 1983. After reading a New York Times Magazine article about the incident, he was moved to write to Chris McNair, the father of Denise, one of the victims, asking for permission to tell her story on film. McNair turned down the young, aspiring filmmaker's offer.[3] \"I was entering my first semester at N.Y.U. So my skills as a filmmaker were nonexistent, and at that time, Chris McNair was still hesitant to talk about it,\" Lee said in a 1997 interview with Industry Central's The Director's Chair. \"I believe timing is everything. So it took ten years of Chris thinking about this and ten years of myself making movies for this to come together.\"[citation needed]According to McNair, he changed his mind about supporting Lee's film idea due to learning about the depth and precision of Lee's research. McNair said, \"[I]t's very important that this be done accurately and correctly. In all his research, he [Lee] showed that he was objective and seeking a broad section of opinion. I'm a stickler for the facts.\"[2]Lee had first intended to create a dramatic reproduction of the incident, but decided that would not be the best approach. He shifted to a documentary.[3] Once he secured funding, Lee went to Birmingham with a small skeleton film crew. He wanted to have the families be as comfortable as possible. Ellen Kuras was the Director of Photography and Sam Pollard the producer/editor. (Lee developed a relationship with Ellen Kuras on an HBO project called Subway Stories, an anthology of short films compiled by Jonathan Demme. Lee's film never made the final cut due in part to conflict between Lee and Demme, however, the working partnership between Lee and Kuras was born.)[4]Kuras said of her desire to shoot 4 Little Girls, \"I was really interested because my background is in political documentaries ... I always felt that one of the reasons that I had got into filmmaking was that I wanted to use my craft to be able to say something about the human condition, however I could, in my own humble way. For me this was an opportunity to make a small contribution.\"[4]Lee's partnership with Sam Pollard began on Mo' Better Blues. Pollard was recommended to Spike as a replacement for his longtime collaborator Barry Brown, who was directing his own film. Busy working on his segments of Eyes on the Prize, Pollard originally refused Lee's overture, but then agreed to work with him. He has since become one of Lee's most prolific collaborators. Their first few films working together were fiction, but Pollard's background was in documentary.He was key to guiding the structure of 4 Little Girls.\"Basically it was to help with the conception of the structure, to edit it ... We spent a lot of time screening dailies together. We could come to 40 Acres at 7a.m., and we would spend three hours a day screening dailies for two weeks straight ... We talked, selected all the material that we liked, and I started working on the structure in the editing room. Spike was asking if he needed narration and what the structure should be. I basically said the structure should be that there are parallels-the family, the history of the community—and then they come together on the explosion.\"[4]","produced_by":"Spike Lee Samuel D. Pollard","running_time":"102 minutes","4_little_girls":"DVD release cover","music_by":"Terence Blanchard","edited_by":"Samuel D. Pollard"}