{"distributed_by":"Miramax Films","Plot":"Specialist Ray Elwood Pee Pee (Joaquin Phoenix) is a U.S. Army soldier stationed in Stuttgart, West Germany, in 1989. Bored with the lack of a war, he instead devotes his attention to black market deals, as well as cooking heroin for a gang of drug-dealing Military Police led by Sergeant Saad. As a supply specialist, Elwood poses as a model soldier and friendly confidant to his incompetent commanding officer, Colonel Berman (Ed Harris), who gives Elwood the opportunity to turn Army protocol to his advantage. Berman has no idea what supplies his subordinate is requisitioning or that Elwood is sleeping with his wife (Elizabeth McGovern).Elwood's company then gets a new First Sergeant, Robert E. Lee (Scott Glenn). This new Top is both menacing and savvy, quickly assessing that soldiers like Elwood are engaged in graft. Meanwhile a tank crew, under the influence of Elwood's heroin, unintentionally kill two soldiers in charge of a weapons convoy by crashing through a gas station. Elwood happens upon the cache and steals it, hiding the trucks in a missile base.Lee confronts Elwood about his abuses, and when Elwood tries to bribe him, Lee revokes all of Elwood's privileges, destroys much of his property, and makes him share his room with a new, naive and deeply honest soldier, Pfc. Knoll (Gabriel Mann), who doesn't fit well with Elwood's lifestyle.To get back at Lee, Elwood pursues the first sergeant's daughter, Robyn (Anna Paquin), taking her out for the night and then deliberately having sex with her in his car outside her house, which Lee sees from his window. Though thinking he has won, the next morning Elwood finds his squad are doing weapons training, with Elwood's car used as target practice. Lee then leaves a hand grenade trap in a locker some soldiers have been using to hide heroin. The grenade explodes and kills Stoney, one of Elwood's friends.Elwood sells his hidden cache of weapons to a Turkish dealer nicknamed \"The Turk\" (Haluk Bilginer) who will only exchange them for a massive amount of opium. Elwood reluctantly accepts and plans to cook it into heroin. However, a fight between Saad and Knoll occurs, and Elwood is forced to save Knoll and recruit the pair as assistants into his plan to cook the opium. In order to have time to trade the weapons from the missile base and collect the drugs, Elwood sells out Col. Berman, who is on an army exercise against another regiment. His unit's failure as part of the test ultimately leads to the colonel's dismissal. Berman, unaware that he has been betrayed, reflects ironically on this turn of events with Elwood.On the night of the Fall of The Berlin Wall, Elwood sneaks to the base swimming pool to meet Robyn while the opium is being cooked. Knoll then appears with 1st Sgt. Lee. Here it is revealed Knoll is actually a 2nd Lieutenant from the Inspector General's Office disguised as a junior soldier in order to investigate Elwood. Knoll puts Robyn in a car while Lee beats up Elwood. However, Robyn tells Knoll that her dad is going to kill Elwood, something Knoll – as an honest officer – cannot allow. Meanwhile commandos reporting to Knoll attempt to arrest Elwood's partners, but Saad, intoxicated by opium fumes, provokes a bloody gunfight that kills many of the fighters. Lee attempts to kill Elwood by throwing him out of a window but Knoll holds him at gunpoint. The building explodes from a gas explosion in the basement, caused by burning morphine and the firefight. Elwood wraps his handcuffs around Lee's neck and draws him out the window as Knoll is engulfed in flames. Elwood survives by landing on Lee.The film concludes with heavy irony. The US Army decorates Elwood with medals (Lee receives a posthumous Silver Star) and transfers him to Hawaii, where his new CO is just as naive as Col. Berman. Elwood states that Robyn remains his sweetheart and that she will be visiting soon. The film ends with Elwood requesting excessive supplies, implying that he plans to sell them on the black market again.","language":"English","Critical reception":"Buffalo Soldiers has a rating of 73% on Rotten Tomatoes based on 114 reviews with an average score of 6.5 out of 10. The consensus states \"Overall, this caustic comedy hits more of its targets than it misses.\"[5] The film also has a score of 56 out of 100 on Metacritic based on 35 reviews.[6]","buffalo_soldiers":"Buffalo Soldiers film poster","box_office":"$2,300,684[3]","cinematography":"Oliver Stapleton","production_company":"FilmFour Good Machine Grosvenor Park Productions","directed_by":"Gregor Jordan","release_dates":"July 25, 2003","produced_by":"Rainer Grupe Ariane Moody","starring":"Joaquin Phoenix Ed Harris Anna Paquin Scott Glenn Haluk Bilginer","running_time":"98 minutes[1]","edited_by":"Lee Smith","written_by":"Robert O'Connor Eric Weiss Nora Maccoby Gregor Jordan","budget":"$15 million[2]"}