{"country":"United States","distributed_by":"New Line Cinema","austin_powers :_international_man_of_mystery":"Theatrical release poster","Legacy":"On their official website, the UK Ministry of Justice revealed that every week they have one person who wants to change their middle name to 'Danger' – inspired by the line in Man of Mystery, \"Danger is my middle name!\".[19]","Plot":"In 1967, British spy Austin Powers (Mike Myers) thwarts an assassination attempt by his nemesis Dr. Evil (also played by Mike Myers) in a London nightclub. Dr. Evil escapes in a space rocket disguised as a Big Boy statue, and cryogenically freezes himself. Powers volunteers to be placed into cryostasis in case Dr. Evil returns in the future.Thirty years later, in 1997, Dr. Evil returns to discover his henchman Number 2 (Robert Wagner) has developed Virtucon, the legitimate front of Evil's empire, into a multibillion-dollar enterprise. Uninterested by genuine business, Dr. Evil conspires to steal nuclear weapons and hold the world hostage for $100 billion. Evil also learns that during his absence his associates have artificially created his son, Scott Evil (Seth Green), using his frozen semen. Now a Generation X teenager, Scott is resentful of his father’s absence, and resists Dr. Evil's attempts to get closer to him.Having learned of Dr. Evil's return, the British Ministry of Defence unfreezes Powers, acclimatizing him to the 1990s with the help of agent Vanessa Kensington (Elizabeth Hurley), the daughter of his sidekick in the 1960s, Mrs. Kensington (Mimi Rogers). Posing as a married couple, Powers and Kensington track Number 2 to Las Vegas and meet his Italian secretary, Alotta Fagina (Fabiana Udenio). Later, Powers infiltrates Fagina's penthouse suite for reconnaissance and discovers plans for Dr. Evil's \"Project Vulcan\", which involves drilling a nuclear warhead into the Earth's molten core and triggering volcanic eruptions worldwide. Fagina discovers Powers in her suite and seduces him into revealing his true identity. Learning that Powers is back, Dr. Evil and his entourage conspire to defeat the spy by creating a series of fembots; beautiful female androids equipped with automatic guns concealed in their breasts.Powers and Kensington attempt to infiltrate the Virtucon headquarters, but are soon apprehended by Dr. Evil's henchman, Random Task (Joe Son). Meanwhile, the United Nations concede to the demands of Dr. Evil, who decides to proceed with Project Vulcan regardless. Powers and Kensington are placed in a death trap by Dr. Evil, but the pair easily escape and Kensington is sent for help. While searching for Dr. Evil, Powers is confronted by the fembots, who he defeats by performing a striptease. Led by Kensington, British forces raid the underground lair, while Powers finds the doomsday device and deactivates it. Powers confronts Dr. Evil, but Fagina arrives holding Kensington hostage. They are interrupted by Number 2, who attempts to betray Dr. Evil by making a deal with Powers. Dr. Evil uses a trap door to eliminate Number 2, then activates the base’s self-destruct mechanism and escapes. Powers and Kensington escape just as the lair is destroyed in a nuclear explosion.Powers and Kensington are later married, and during their honeymoon Powers is attacked by Random Task. Powers subdues the assassin using a penis pump, allowing Kensington to knock him out using a bottle of champagne. Afterwards, the couple adjourn to their balcony. Among the stars, Powers spots the cryogenic chamber of Dr. Evil, who vows revenge on Powers.","Home video releases":"Austin Powers: International Man of Mystery was released to region 1 single disc \"flipper disc\" DVD with widescreen and full screen versions on opposing sides of the disc. The widescreen transfer is unusual in that it is a modified version of the theatrical ratio: despite being filmed in 2.35:1 aspect ratio, on DVD it is presented as 2:1 ratio, \"as specified by the director\" according to the disc packaging. The film was featured in the correct theatrical aspect ratio for the first time when it was released on Blu-ray, in the Austin Powers Collection.All versions of the film released on home video (including VHS) have two alternate endings and a set of deleted scenes. The DVD and Blu-ray versions feature a commentary, as well. However, all US versions of the films are the PG-13 cut, with edits to sexual humor/language.[18] International versions are uncut.The film's distribution rights were transferred to Warner Bros. in 2008.","language":"English","Reception":"Austin Powers: International Man of Mystery received positive reviews. The film received a 70% approval rating on Rotten Tomatoes, based on 60 reviews, with an average rating on 6.4/10. The site's critical consensus read, \"A light and goofy comedy which provides laughs, largely due to performances and screenwriting by Myers\".[20] The movie debuted at No.2 at the box office with US$9.5 million.[21][22][23]American Film Institute recognition:","box_office":"$67.7 million","cinematography":"Peter Deming","production_company":"Capella International KC Medien Moving Pictures Eric's Boy","directed_by":"Jay Roach","Soundtrack":"There are two notable omissions: \"Secret Agent Man\", which is played during the attack on Dr. Evil's compound, and \"These Boots Are Made for Walkin'\", which plays during the Fembot presentation.Another CD featuring George S. Clinton's scores to the film and its sequel was later released in 2000.[17]","release_dates":"May 2, 1997 (1997-05-02) (United States)|September 5, 1997 (1997-09-05) (United Kingdom)||||","Production":"Myers created the character of Austin Powers for the faux 1960s rock band Ming Tea that Myers started with Matthew Sweet and Susanna Hoffs following his Saturday Night Live stint in the early 1990s.[6][7] Mike Myers stated[citation needed] that he was inspired to create the character after hearing the song \"The Look of Love\" on the radio, which was the theme song of Ursula Andress' character, Vesper Lynd, in the 1967 version of Casino Royale. Myers' then wife Robin Ruzan encouraged him to write a film based on the character.[7] Dana Carvey felt that Myers copied Carvey's impression of Lorne Michaels for the Dr. Evil character.[8][9]Myers sought out Jim Carrey to play Dr. Evil, as his initial plan was not to play multiple characters in the series. Carrey was interested in the part, but had to turn the role down due to scheduling conflicts with Liar Liar.[10]The film adopts the late '60s psychedelic pop culture stylings and adapts / parodies many characters, lines, set pieces, and plot points of the James Bond films from that era. Elements from all of the early Bond movies are used for inspiration, including:Additionally, Mike Myers has stated that Austin's thick chest hair is based on Sean Connery's.The film also drew inspiration and elements from other movies and television shows of the late 1960s, including:Myers estimated that about 30-40% of film was improvised.[14]The film was shot at the following locations:The international release differs from the North American release, as it includes these additional scenes:The UK release deleted the Princess Diana joke from the theatrical release as the film was released on the week of her death. The joke was subsequently restored in the VHS and DVD releases, as well as its TV broadcast on UK's Channel 4.In addition, many scenes cut from the theatrical release are found on the DVD:","produced_by":"Jan Blenkin|Eric McLeod|Demi Moore|Mike Myers|Claire Rudnick Polstein|","starring":"Mike Myers|Elizabeth Hurley|Michael York|Mimi Rogers|","running_time":"94 minutes","music_by":"George S. Clinton","edited_by":"Debra Neil-Fisher|Dawn Hoggatt|","written_by":"Mike Myers","budget":"$16.5 million"}