{"country":"United States","Awards and nominations":"The film won the Golden Globe Award for Best Motion Picture – Musical or Comedy. It was nominated for the BAFTA Award for Best Film from any Source but lost to Richard III.Dorothy Dandridge was nominated for the Academy Award for Best Actress, the first African American to be honored in the category, but lost to Grace Kelly in The Country Girl, and the BAFTA Award for Best Foreign Actress, but lost to Betsy Blair in Marty.At the 5th Berlin International Film Festival and the film won the Bronze Berlin Bear award.[27] The film also won the Golden Leopard at the Locarno International Film Festival.[28]Herschel Burke Gilbert was nominated for the Academy Award for Best Scoring of a Musical Picture but lost to Adolph Deutsch and Saul Chaplin for Seven Brides for Seven Brothers.Harry Kleiner was nominated for the Writers Guild of America Award for Best Written American Musical.","distributed_by":"20th Century Fox","carmen_jones":"Theatrical release poster by Saul Bass","DVD release":"20th Century Fox Home Entertainment released the film on DVD on January 22, 2002. It is in anamorphic widescreen format with an audio track in English and subtitles in English and Spanish.","Plot":"Set during World War II, the story focuses on Carmen Jones, a vixen who works in a parachute factory in North Carolina. When she is arrested for fighting with a co-worker who reported her for arriving late for work, foreman Sgt. Brown assigns young soldier Joe to deliver her to the authorities, much to the dismay of Joe's fiancée Cindy Lou, who had agreed to marry him during his leave.While en route, Carmen suggests she and Joe stop for a meal and a little romance, and his refusal intensifies her determination to seduce him. When their army jeep ends up in the river, she suggests they spend the night at her grandmother's house nearby and continue their journey by train the following day, and that night Joe succumbs to Carmen's advances. The next morning he awakens to find a note in which she says although she loves him she is unable to deal with time in jail and is running away.Joe is locked in the stockade for allowing his prisoner to escape, and Cindy Lou arrives just as a rose from Carmen is delivered to him, prompting her to leave abruptly. Having found work in a Louisiana nightclub, Carmen awaits his release. One night champion prizefighter Husky Miller enters with an entourage and introduces himself to Carmen, who expresses no interest in him. Husky orders his manager Rum Daniels to offer her jewelry, furs, and an expensive hotel suite if she and her friends Frankie and Myrt accompany him to Chicago, but she declines the offer. Just then, Joe arrives and announces he must report to flying school immediately. Angered, Carmen decides to leave with Sgt. Brown, who also has appeared on the scene, and Joe severely beats him. Realizing he will be sentenced to a long prison term for hitting his superior, Joe flees to Chicago with Carmen.While Joe remains hidden in a shabby rented room, Carmen secretly visits Husky's gym to ask Frankie for a loan, but she insists she has no money of her own. Carmen returns to the boarding house with a bag of groceries, and Joe questions how she paid for them. The two argue, and she goes to Husky's hotel suite to play cards with her friends. When she draws the nine of spades, she interprets it as a premonition of impending doom and descends into a quagmire of drink and debauchery.Cindy Lou arrives at Husky's gym in search of Carmen just before Joe appears. Ignoring his former sweetheart, he orders Carmen to leave with him and threatens Husky with a knife when he tries to intervene. Carmen helps Joe escape the military police, but during Husky's big fight, after he wins the match, Joe finds Carmen in the crowd and pulls her into a storage room, where he begs her to return to him. When she rebuffs him, Joe strangles Carmen to death just before the military police arrive to apprehend him for desertion.","language":"English","Critical reception":"Bosley Crowther of the New York Times called the film \"a big musical shenanigan and theatrical tour-de-force\" and added, \"In essence, it is a poignant story. It was in the opera of Bizet, and it is in the rich nostalgic folklore of the American Negro in the South. But here it is not so much poignant as it is lurid and lightly farcical, with the Negro characters presented by Mr. Preminger as serio-comic devotees of sex . . . The incongruity is pointed when these people break into song to the wholly surprising and unnatural aria airs from Bizet's opera. The tempos are alien to their spirits, the melodies are foreign to their moods, but they have at those classical numbers as though they were cutting rugs. And whatever illusions and exaltations the musical eloquence might remotely inspire are doused by the realistic settings in which Mr. Preminger has played his film . . . There is nothing wrong with the music — except that it does not fit the people or the words. But that did not seem to make much difference to Mr. Hammerstein or Mr. Preminger. They were carried away by their precocity. The present consequence is a crazy mixed-up film.\"[22]Variety said Preminger transferred the play from stage to screen \"with taste and imagination in an opulent production\" and directed \"with a deft touch, blending the comedy and tragedy easily and building his scenes to some suspenseful heights. He gets fine performances from the cast toppers, notably Dorothy Dandridge, a sultry Carmen whose performance maintains the right hedonistic note throughout.\"[23]Looking back at the film in a 2007 review in The Guardian, Andrew Pulver rated it three out of five stars and observed, \"Underneath its obvious charms - slinky Dorothy Dandridge, brawny Harry Belafonte and a handful of memorable numbers relocated from Bizet's original - the 1954 film version of Oscar Hammerstein's all-black Broadway musical now feels like a relic from the gruesome social straitjacket that was segregation; every frame, you feel, is freighted with the tension imposed by the never-appearing white folks. It was, however, laudable in its desire to showcase the talents of African-American performers who were denied opportunities in Hollywood.\"[24]TV Guide rated the film three out of four stars, calling it \"intermittently successful\" and \"saved by a terrific cast\" despite \"Preminger's heavy-handed\" direction.[25]Channel 4 called it \"a truly dreadful film. Preminger can't be faulted for ambition, but for once, his execution is sorely lacking . . . Dandridge's tough, hip-swinging, steely eyed Carmen goes some way to redeeming things, but the part is too fractured by the imposition of another singing voice, bad dubbing, and the alien tone of the songs.\"[26]","box_office":"$9.8 million","cinematography":"Sam Leavitt","directed_by":"Otto Preminger","Song list":"Note: After the intro of the \"Gypsy Song\", there is a drum solo played by a drummer named Max and as the crowd hears it, they yell, \"Go, Max!\" The drummer is jazz percussionist Max Roach.","release_dates":"October 28, 1954 (1954-10-28)|||||","Production":"The Broadway production of Carmen Jones by Billy Rose opened on December 2, 1943 and ran for 503 performances.[1] When he saw it, Otto Preminger dismissed it as a series of \"skits loosely based on the opera\" with a score \"simplified and changed so that the performers who had no operatic training could sing it.\" In adapting it for the screen, he wanted to make \"a dramatic film with music rather than a conventional film musical,\" [2] so he decided to return to the original source material - the Prosper Mérimée novella - and hired Harry Kleiner, whom he had taught at Yale University, to expand the story beyond the limitations imposed upon it by the Bizet opera and Hammerstein's interpretation of it.[3]Preminger realized no major studio would be interested in financing an operatic film with an all-black cast, so he decided to produce it independently. He anticipated United Artist executives Arthur B. Krim and Robert S. Benjamin, who had supported him in his censorship battles with The Moon Is Blue, would be willing to invest in the project, but the two felt it was not economically viable and declined.[4] Following the completion of his previous film, River of No Return, Preminger had paid 20th Century Fox $150,000 to cancel the remainder of his contract,[5][6] so he was surprised when Fox head Darryl F. Zanuck contacted him and offered to finance the film while allowing him to operate as a fully independent filmmaker. In December 1953, he accepted $750,000 and began what became a prolonged preproduction period. He hired cinematographer Sam Leavitt as director of photography, Herschel Burke Gilbert as musical director, and Herbert Ross as choreographer and began to scout locations.[7]On April 14, 1954, six weeks before principal photography was scheduled to begin, Preminger was contacted by Joseph Breen, who was in the final months of his leadership of the office of the Motion Picture Production Code. Breen had clashed with Preminger over The Moon Is Blue and still resented the director's success in releasing that film without a seal of approval. He cited the \"over-emphasis on lustfulness\" in Carmen Jones and was outraged by the screenplay's failure to include \"any voice of morality properly condemning Carmen's complete lack of morals.\" [8] Preminger agreed to make some minor adjustments to the script and even filmed two versions of scenes Breen found objectionable, although he included the more controversial ones in the final film.[9]Because he himself was sensitive to the issue of racial representation in the film, Preminger had no objections when Zanuck urged him to submit the script to Walter Francis White, executive secretary of the NAACP, who had no objection to it.[10]Preminger began to assemble his cast. Harry Belafonte, a folk singer who recently had introduced Calypso music to a mainstream audience, had only one film to his credit, but he had just won the Tony Award and Theatre World Award for his performance in John Murray Anderson's Almanac, and Preminger cast him as Joe. Pearl Bailey's sole screen credit was the 1948 film Isn't It Romantic?, but she had achieved success as a band singer and was familiar to television audiences from her appearances on Your Show of Shows, so she was assigned the role of Frankie. Joe Adams was a Los Angeles disc jockey with no acting experience, but Preminger felt he had the right look for Husky.[11] Diahann Carroll auditioned for the title role, but she was so terrified of the director she could barely focus on the scene,[12] and Preminger cast her in the small supporting role of Myrt instead. Finally, every black actress from Eartha Kitt to Joyce Bryant was tested for the role of Carmen.Preminger was familiar with Dorothy Dandridge but felt she was incapable of exuding the sultry sex appeal the role of Carmen demanded, particularly after having seen Dandridge's performance as a demure schoolteacher opposite Belafonte in 1953's Bright Road.[13] Her agent's office was in the same building where Preminger's brother Ingo worked, and he asked Ingo to intercede on his client's behalf. At his first meeting with Dandridge, Preminger told her she was \"lovely\" and looked like a \"model\" or \"a beautiful butterfly,\" but not Carmen,[14] and suggested she audition for the role of Cindy Lou. Dandridge took the script and left, and when she returned she was dressed and behaved exactly as Preminger envisioned Carmen. The director was impressed enough to schedule a screen test for mid-May, after Dandridge completed a singing engagement in St. Louis. In the interim he cast Juilliard School graduate Olga James as Cindy Lou.[15]On May 21, Preminger announced Dandridge had been cast as Carmen. Initially thrilled by the prospect of playing one of the best film roles ever offered an African American female, Dandridge quickly began to doubt her ability to do it justice. After several days, she told her agent to advise Preminger she was backing out of the project. The director drove to her apartment to reassure her and assuage her fears, and the two unexpectedly began a passionate affair.[16][17]Although Dandridge and Belafonte were singers, neither was capable of singing the operatic score, so Marilyn Horne and LeVern Hutcherson were hired to record their vocals, and soundtrack recording began on June 18. Horne later recalled, \"Even though I was at that time a very light lyric soprano, I did everything I possibly could to imitate the voice of Dorothy Dandridge. I spent many hours with her. In fact, one of the reasons I was chosen to do this dubbing was that I was able to imitate her voice had she been able to sing in the proper register.\" [18]Following three weeks of rehearsal, filming in CinemaScope began on June 30. Preminger had opted to remain in California for the shoot, with El Monte doubling for the Southern exteriors and the Chicago interiors being filmed at the Culver Studios. Principal photography was completed in early August, and Preminger and the Fox publicity studio began promoting both the film and its star. Dandridge was featured in Ebony and photographed for the cover of Life and appeared on a live television broadcast on October 24, four days prior to the opening, to sing two songs from the film.[19]The opening title sequence is the first film title sequence created by Saul Bass, and marked the beginning of Bass's long professional relationship with Preminger.The film had its world premiere at the Rivoli Theatre in New York City on October 28, 1954. The following February, it opened in London and Berlin, and in both cities it played for more than a year in exclusive first-run engagements. Because of a technicality in French copyright laws, the film was unable to have a theatrical release in France, although it was permitted to open the 1955 Cannes Film Festival, where for the first time Preminger and Dandridge openly flaunted their relationship. Soon after Cannes, Dandridge was offered the role of Tuptim in the screen adaptation of The King and I, but Preminger, acting as both lover and mentor, urged her not to accept a supporting role after proving her worth as a star. Dandridge complied but later regretted her decision, certain it had been instrumental in starting the slow but steady decline of her career.[20][21]","produced_by":"Otto Preminger","starring":"Harry Belafonte Dorothy Dandridge Pearl Bailey Olga James Joe Adams","running_time":"105 minutes","music_by":"Georges Bizet","edited_by":"Louis R. Loeffler","written_by":"Harry Kleiner Based on a libretto by Oscar Hammerstein II"}