{"Cast":"Several of the characters are fictional versions of specific real-life counterparts:[9][10]","country":"United States","distributed_by":"Columbia Pictures","Plot":"The opening screen says: \"Some of this actually happened.\"In 1978, con artists Irving Rosenfeld (Christian Bale) and Sydney Prosser (Amy Adams) have started a relationship and are working together. Sydney has improved Rosenfeld's scams, posing as English aristocrat \"Lady Edith Greensly\". Irving loves Sydney, though is hesitant to leave his unstable and histrionic[8] wife Rosalyn (Jennifer Lawrence), fearing he will lose contact with her son Danny, whom Irving has adopted. Rosalyn has also threatened to report Irving to the police if he leaves her.FBI agent Richie DiMaso (Bradley Cooper) catches Irving and Sydney in a loan scam, but offers to release them if Irving can line up four additional arrests. Sydney opposes the agreement. Richie believes Sydney is English but has proof that her claim of aristocracy is fraudulent. Sydney tells Irving she will manipulate Richie, distancing herself from Irving.Irving has a friend pretending to be a wealthy Arab sheikh looking for potential investments in America. An associate of Irving's suggests the sheikh do business with Mayor Carmine Polito (Jeremy Renner) of Camden, New Jersey, who is campaigning to revitalize gambling in Atlantic City, New Jersey, but has struggled in fundraising. Carmine seems to have a genuine desire to help the area's economy and his constituents.Richie devises a plan to make mayor Polito the target of a sting operation, despite the objections of Irving and of Richie's boss, Stoddard Thorsen (Louis C.K.). Sydney helps Richie manipulate an FBI secretary into making an unauthorized wire transfer of $2,000,000. When Stoddard's boss, Anthony Amado (Alessandro Nivola), hears of the operation, he praises Richie's initiative, pressuring Stoddard to continue.Carmine leaves their meeting when Richie presses him to accept a cash bribe. Irving convinces Carmine the sheikh is legitimate, expressing his dislike of Richie, and the two become friends. Richie arranges for Carmine to meet the sheikh, and without consulting the others, has Mexican-American FBI agent Paco Hernandez (Michael Peña) play the sheikh, which displeases Irving.Carmine brings the sheikh to a casino party, explaining mobsters are there and it is a necessary part of doing business. Irving is surprised to hear that Mafia overlord Victor Tellegio (Robert De Niro), right-hand man to Meyer Lansky, is present, and that he wants to meet the sheikh. Mafia man Tellegio explains that the business needs the sheikh to become an American citizen and that Carmine will need to expedite the process. Tellegio also requires a $10,000,000 wire transfer to prove the sheikh's legitimacy. Richie agrees, eager to bring down Tellegio, while Irving realizes the operation is out of control.Richie confesses his strong attraction to Sydney but becomes confused and aggressive when she drops her English accent and admits to being from Albuquerque, New Mexico. Irving arrives to protect Sydney and tries to stop their deal with Richie, but Richie says if they back out, Tellegio will learn of the scam and will murder them all, including Rosalyn and Danny.Rosalyn starts an affair with a mobster, Pete Musane (Jack Huston), whom she met at the party. She mentions her belief that Irving is working with the Internal Revenue Service, causing Pete to threaten Irving, who promises to prove the sheikh's investment is real. Irving later confronts Rosalyn, who admits she told Pete. She agrees to keep quiet but wants a divorce.With Carmine's help, Richie and Irving videotape members of Congress receiving bribes. Richie assaults Stoddard in a fight over the money and later convinces Amado that he needs the US$10,000,000 to get Tellegio, but gets only US$2,000,000. A meeting is arranged at the offices of Tellegio's lawyer, Alfonse Simone (Paul Herman), but Tellegio does not appear. Richie records Simone's admission of criminal activities.Irving visits mayor and friend Carmine and admits to the scam, but says he has a plan to help him. Carmine throws Irving out and the loss of their friendship hits Irving hard. Irving and Sydney meet with Amado, Stoddard and Richie. The feds inform Irving that their US$2,000,000 is missing, and that they have received an anonymous offer to return the money in exchange for Irving and Sydney's immunity and a reduced sentence for Carmine. Richie accuses the duo of theft. Irving suggests Richie either has the money or is incompetent for losing it. In fact, he reveals, they never met with Tellegio's lawyer. Instead, Irving had a friend, Edward Malone (the host of the party where he met Sydney) pose as Simone to con Richie. Amado accepts the deal and Stoddard removes Richie from the case, which effectively ends his career, dropping him back into obscurity.Irving and Sydney move in together and open a legitimate art gallery, while Rosalyn lives with Pete and shares custody of Danny with Irving.","language":"English","Reception":"American Hustle received critical acclaim, and the cast received praise for their performances, notably Christian Bale, Bradley Cooper, Amy Adams and Jennifer Lawrence.[citation needed] Review aggregation website Rotten Tomatoes gives the film a 93% rating, based on 249 reviews, with an average score of 8.2/10. The site's critical consensus reads, \"Riotously funny and impeccably cast, American Hustle compensates for its flaws with unbridled energy and some of David O. Russell's most irrepressibly vibrant direction.\"[25] Metacritic gives a score of 90 out of 100, based on 47 critics, indicating \"universal acclaim\".[26]Christy Lemire awarded the film four out of four stars, praising David O. Russell's directing and the relationship between Irving and Sydney, as well as Jennifer Lawrence's portrayal of Rosalyn. She writes: \"For all its brashness and big personality, American Hustle is a character study at its core—an exploration of dissatisfaction and drive, and the lengths to which we're willing to go for that elusive thing known as a better life.\"[27] Richard Roeper of the Chicago Sun-Times gave the film an A+, especially complimenting Bradley Cooper's performance and stating that American Hustle was \"the best time I've had at the movies all year.\" He later named it the year's best film.[28] Time magazine's Richard Corliss wrote, \"American Hustle is an urban eruption of flat-out fun — the sharpest, most exhilarating comedy in years. Anyone who says otherwise must be conning you.\"[29]Peter Debruge of Variety was critical of the film, calling it \"a sloppy sprawl of a movie\" and complaining that the improvisational performances overwhelm instead of adding to a coherent plot. He also went on to write that it \"makes your brain hurt — and worse, overwhelms the already overcomplicated Abscam retelling at the center of the film.\"[30]American Hustle was listed on many critics' top ten lists.[31]Variety estimated the production budget at $40 million. When producer Charles Roven was asked if the budget was in the $40 to $50 million area, he responded “I’d say that’s a good zone.”[2][3]As of April 9, 2014[update] the film has earned $150,117,807 at the North American domestic box office and an additional $101,054,000 in international markets for a total worldwide box office of $251,171,807.[3][32]American Hustle received seven Golden Globe Award nominations; it won for Best Motion Picture – Musical or Comedy, with Amy Adams and Jennifer Lawrence winning Best Actress – Motion Picture Musical or Comedy and Best Supporting Actress – Motion Picture respectively.[33][34]The film received 10 Academy Award nominations, including Best Picture, Best Director, Best Original Screenplay, and all four acting categories,[7] but did not win in any category. The film has the second most nominations without a win, a distinction it shares with True Grit and Gangs of New York, after the 11 for 1977’s The Turning Point and 1985’s The Color Purple. It was the 15th film ever to be nominated in the four acting categories, and only the second since 1981, after 2012's Silver Linings Playbook, which Russell also directed.[35] Of the fifteen such films, it joins only 1936's My Man Godfrey and 1950's Sunset Boulevard to not win any acting awards.[citation needed]The film took top honors at the 20th Screen Actors Guild Awards, winning for Outstanding Cast in a Motion Picture.[36]The film was nominated for 10 British Academy Film Awards, with Jennifer Lawrence winning for Actress in a Supporting Role, and David O. Russell and Eric Warren Singer winning for Best Original Screenplay.[37][38]In October 2014, science writer Paul Brodeur filed a lawsuit against Columbia Pictures based on a line in the film in which Rosalyn tells Irving that microwave ovens take the nutrition out of food, stating that she read so in an article by Brodeur. In real life, Brodeur has written books including The Zapping of America about the dangers of microwave radiation, but claims that he has never stated that the process removes a food's nutrition.[39][40]","box_office":"$251.1 million[3]","Historical accuracy":"American Hustle does not attempt to directly document the events of Abscam. The names are changed, and the film begins with the on-screen message, \"Some of this actually happened\".[10] Major departures from reality include:","cinematography":"Linus Sandgren","directed_by":"David O. Russell","production_companies":"Atlas Entertainment Annapurna Pictures","american_hustle":"Theatrical release poster","release_dates":"December 8, 2013 (2013-12-08) (Ziegfeld Theatre)|December 13, 2013 (2013-12-13) (United States)||||","Production":"The film began as an Eric Warren Singer screenplay titled American Bullshit. It was listed at #8 on the 2010 Black List of unproduced screenplays. The production was set up at Columbia Pictures with Charles Roven and Richard Suckle producing through Atlas Entertainment, who initially considered Ben Affleck to direct before David O. Russell ultimately signed on to helm the film.[14] Russell re-wrote Singer's screenplay, replacing the characters with caricatures of their respective real-life figures.[15]Principal photography started on March 8, 2013 and wrapped in May 2013.[16][17] The film was shot in and around Boston, Massachusetts (such as in Worcester), and in New York City.[18][19] Filming was put on hold in the aftermath of the Boston Marathon bombings with the city in lockdown. After lockdown was lifted, the film wrapped its Boston shoot and spent its final few days of production in New York City.[20]","produced_by":"Charles Roven Richard Suckle Megan Ellison Jonathan Gordon","starring":"Christian Bale Bradley Cooper Amy Adams Jeremy Renner Jennifer Lawrence Louis C.K. Michael Peña Alessandro Nivola","running_time":"138 minutes[1]","music_by":"Danny Elfman","edited_by":"Jay Cassidy Crispin Struthers Alan Baumgarten","Release":"Director David O. Russell released the teaser trailer for the film on July 31, 2013,[21] and a theatrical trailer was released on October 9, 2013.[22] The film received nationwide US release on 13 December 2013.[23]American Hustle was released on DVD and Blu-ray on March 18, 2014.[24]","written_by":"Eric Warren Singer David O. Russell","budget":"$40 million[2]"}