{"based_on":"Brooklyn  by Colm Tóibín","country":"Canada|Ireland|United Kingdom|United States|","distributed_by":"Fox Searchlight Pictures (United States)|20th Century Fox (International)|Lionsgate (United Kingdom)|","screenplay_by":"Nick Hornby","Plot":"In 1951, Eilis Lacey is a young woman from Enniscorthy, County Wexford, a small town in southeast Ireland, where she lives with her mother and sister Rose. She is unable to find employment, other than working weekends at a shop run by the spiteful Miss Kelly, nicknamed \"Nettles Kelly\", and is not interested in the local young men. Her sister writes to an Irish priest (Father Flood) in Brooklyn who arranges for her to go to the US to find a better future. She leaves but suffers from seasickness on the voyage and ends up being locked out of the toilet by her cabin neighbours. The woman in the bunk below her, an experienced traveler, helps her, giving her advice and support.Eilis lives at a Brooklyn boarding house where she dines each night with the landlady and her fellow residents, all young women. She has a job at a department store but is shy and quiet when interacting with customers, garnering some criticism from Miss Fortini, her supervisor. Her letters from her sister make her homesick. She is visited by Father Flood, and he tries to help by enrolling her in bookkeeping classes. At a dance she meets Tony Fiorello, who becomes her boyfriend. She begins to feel more comfortable in New York, and she and Tony become more and more involved romantically.Father Flood informs Eilis that Rose has died suddenly of an undisclosed illness. After a trans-Atlantic phone call reveals her mother is struggling to cope, Eilis returns home for a visit. Tony insists that they must get married first without telling family or friends. In Ireland, everybody seems to be conspiring to keep Eilis from leaving. Her best friend is getting married a week after her scheduled return journey, and her mother has already accepted the invitation on her behalf. She fills in part-time at her late sister's old bookkeeping job, which leads to the possibility of a full-time job. She goes on dates with an eligible and well-off bachelor, Jim Farrell, who she starts having a connection with. Eilis starts to feel that she now has a future in Ireland that did not exist when she left and stops opening the letters she receives from Tony.Miss Kelly, her former employer, meets with Eilis and relates that she has learned of Eilis' marriage in New York. Eilis is reminded of what life is like in such a small town. She informs her mother of her marriage and that she is leaving for Brooklyn the next day. On the crossing, she offers guidance to a young woman making her own first trip to Brooklyn. The film ends with Eilis and Tony reuniting and happily embracing.","language":"English","Reception":"Brooklyn received a standing ovation at its Sundance Film Festival premiere.[15] On the review aggregator Rotten Tomatoes the film holds an approval rating of 97%, based on 222 reviews, with an average rating of 8.5/10. The site's critical consensus reads, \"Brooklyn buttresses outstanding performances from Saoirse Ronan and Emory Cohen with a rich period drama that tugs at the heartstrings as deftly as it satisfies the mind.\"[16] On Metacritic, the film has a weighted average score of 87 out of 100, based on 42 critics, indicating \"universal acclaim\".[17] On its Oscar nominations, one critic said that \"It deserves its place.\"[18]As of 13 April 2016[update], Brooklyn has grossed $38.2 million in North America and $21.7 million in other territories, for a worldwide total of $60 million, against a budget of $11 million.[19][20] As of early February 2016, Brooklyn's box office gross in Canada alone exceeded C$4-million, giving it the highest cumulative domestic gross of any Canadian film released in 2015.[21][22] The film had the biggest opening of any Irish film in Ireland since 1996 earning over $650,000 from 87 cinemas, making it the strongest drama debut since Michael Collins opened to $662,000 in November 1996.[23]Brooklyn has received many nominations for industry and critics awards including three nominations for the 88th Academy Awards for Best Picture, Best Adapted Screenplay and Best Actress. Ronan's performance in particular was praised and has garnered her Oscar, BAFTA,[24] Critics' Choice,[25] Golden Globe,[26] and SAG nominations for best actress.[27] She has also won the BIFA Award for Best Performance by an Actress in a British Independent Film.[28] Julie Walters was also nominated for Best Supporting Actress at the BAFTAs.[24] The film won the Audience Favorite Gold Award in World Cinema at the Mill Valley Film Festival, the Rogers People's Choice Award at the Vancouver International Film Festival and the Audience Award for Best Narrative Feature at the Virginia Film Festival. Cohen was named Breakthrough Performer at the Hamptons International Film Festival.[29] It won 2 Canadian Screen Awards for Best Cinematography and Best Musical Score and 2 18th Quebec Cinema Awards (formerly known as the Prix Jutra), for Best Cinematography and Best Art Direction.[citation needed]Brooklyn was also named one of the best films of 2015, featuring on over 120 Top 10 Critics' Lists.[30] It is ranked fourth on Rotten Tomatoes and fifth on Metacritic's best reviewed films of 2015.[31][32][33]","box_office":"$62.1 million[3]","cinematography":"Yves Bélanger","production_company":"BFI BBC Films HanWay Films TSG Entertainment Wildgaze Films","directed_by":"John Crowley","brooklyn":"Theatrical release poster","release_dates":"26 January 2015 (2015-01-26) (Sundance)|4 November 2015 (2015-11-04) (US)||||","Production":"Principal photography began on 1 April 2014 in Ireland, and was shot for three weeks at different locations including Enniscorthy, Wexford, and Dublin.[7][8][9] On the first day of shooting, Ronan was spotted in period costume on the set in Enniscorthy.[10][11] After finishing production in Ireland, it then moved to Montreal, Quebec for a four weeks further.[8] Two days were spent shooting in New York at Coney Island.[12]","produced_by":"Amanda Posey|Finola Dwyer|Thorsten Schumacher|Beth Pattinson|","starring":"Saoirse Ronan|Emory Cohen|Domhnall Gleeson|Jim Broadbent|Julie Walters|","running_time":"112 minutes[1]","music_by":"Michael Brook","edited_by":"Jake Roberts","Release":"Brooklyn premiered at the Sundance Film Festival on 26 January 2015. After it premiered, a bidding war began between The Weinstein Company, Focus Features and Fox Searchlight Pictures. Fox Searchlight Pictures prevailed, acquiring the distribution rights for U.S. and other multiple territories for $9 million. The deal was one of the biggest to ever come out of Sundance.[4] It was selected to be shown in the Special Presentations section of the 2015 Toronto International Film Festival.[13] The film opened in a limited release in the United States on 4 November 2015, before opening in a wide release on 25 November 2015.[14]","budget":"$11 million[2]"}