{"based_on":"Diamonds Are Forever  by Ian Fleming","country":"United Kingdom","distributed_by":"United Artists","screenplay_by":"Richard Maibaum Tom Mankiewicz","Plot":"James Bond—agent 007—pursues Ernst Stavro Blofeld and eventually finds him at a facility where Blofeld look-alikes are being created through surgery. Bond kills a test subject, and later the \"real\" Blofeld, by drowning him in a pool of superheated mud.While assassins Mr. Wint and Mr. Kidd systematically kill several diamond smugglers, M suspects that South African diamonds are being stockpiled to depress prices by dumping, and orders Bond to uncover the smuggling ring. Disguised as professional smuggler and assassin Peter Franks, Bond travels to Amsterdam to meet contact Tiffany Case. The real Franks shows up on the way, but Bond intercepts and kills him, then switches IDs to make it seem like Franks is Bond. Case and Bond then go to Los Angeles, smuggling the diamonds inside Franks' corpse.At the airport Bond meets his CIA ally Felix Leiter, then travels to Las Vegas. At a funeral home, Franks' body is cremated and the diamonds are passed on to another smuggler, Shady Tree. Bond is nearly killed by Wint and Kidd when they put him into a coffin and send to a cremation oven, but Tree stops the process when he discovers that the diamonds in Franks' body were fakes planted by Bond and the CIA.Bond tells Leiter to ship him the real diamonds. Bond then goes to the Whyte House, a casino-hotel owned by the reclusive billionaire Willard Whyte, where Tree works as a stand-up comedian. Bond discovers there that Tree has been killed by Wint and Kidd, who did not know that the diamonds were fake.At the craps table Bond meets the opportunistic Plenty O'Toole, and after gambling, brings her to his room. Gang members ambush them, throwing O'Toole out the window and into the pool. Bond spends the rest of the night with Tiffany Case, instructing her to retrieve the real diamonds at the Circus Circus casino.Tiffany reneges on her deal to meet back with Bond and instead flees, passing off the diamonds to the next smuggler. However, seeing that O'Toole was killed after being mistaken for her, Tiffany changes her mind. She drives Bond to the airport, where the diamonds are given to Whyte's casino manager, Bert Saxby, who is followed to a remote facility. Bond enters the apparent destination of the diamonds; a research laboratory owned by Whyte, where a satellite is being built by Professor Metz, a laser refraction specialist. When Bond's cover is blown, he escapes by stealing a moon buggy and reunites with Tiffany.Bond scales the walls to the Whyte House's top floor to confront Whyte. He is instead met by two identical Blofelds, who use an electronic device to sound like Whyte. Bond kills one of the Blofelds, which turns out to be a look-alike. He is then knocked out by gas, picked up by Wint and Kidd, and taken out to Las Vegas Valley, where he is placed in a pipeline and left to die.Bond escapes, then calls Blofeld, using a similar electronic device to pose as Saxby. He finds out Whyte's location and rescues him, Saxby being killed in the gunfight. In the meantime, Blofeld abducts Case. With the help of Whyte, Bond raids the lab and uncovers Blofeld's plot to create a laser satellite using the diamonds, which by now has already been sent into orbit. With the satellite, Blofeld destroys nuclear weapons in China, the Soviet Union and the United States, then proposes an international auction for global nuclear supremacy.Whyte identifies an oil platform off the coast of Baja California as Blofeld's likely base of operations. After Bond's attempt to change the cassette containing the satellite control codes fails due to a mistake by Tiffany, a helicopter attack on the oil rig is launched by Leiter and the CIA.Blofeld tries to escape in a midget submarine, but Bond gains control of the submarine's launch crane and crashes the sub into the control room, causing both the satellite control and the base to be destroyed. Bond and Tiffany then head for Britain on a cruise ship, where Wint and Kidd pose as room-service stewards and attempt to kill them with a hidden bomb. Bond turns the tables on them, causing Kidd to hurl himself overboard after being set aflame and Wint to detonate with the bomb after being thrown overboard. Tiffany then asks James Bond a sensitive question: \"How the hell do we get those diamonds down again?\"","language":"English","Release and reception":"Diamonds are Forever premiered at the Odeon Leicester Square. It was released on 14 December 1971. It grossed $116 million worldwide,[25] of which $43 million was from the United States.[26]Reviews were mixed, and the camp tone had a mostly negative reaction. The film currently has a 67% \"fresh\" rating on Rotten Tomatoes.[27] Connery was applauded by Kevin A. Ranson of MovieCrypt and Michael A. Smith of Nolan's Pop Culture. Critic Roger Ebert criticised the complexity of the plot and \"moments of silliness\" such as Bond finding himself driving a moon buggy with antennae revolving and robot arms flapping. He praised the Las Vegas car chase scene, particularly the segment when Bond drives the Mustang on two wheels.[28] Twenty-five years after its release, James Berardinelli criticised the concept of a laser-shooting satellite and the performances of Jill St. John, Norman Burton and Jimmy Dean.[29] Christopher Null called St. John \"one of the least effective Bond girls – beautiful, but shrill and helpless\".[30] Steve Rhodes said, \"looking and acting like a couple of pseudo-country bumpkins, they (Putter Smith and Bruce Glover) seem to have wandered by accident from the adjoining sound stage into the filming of this movie.\" But he also extolled the car chase as \"classic\".[31] According to Danny Peary, Diamonds are Forever is \"one of the most forgettable movies of the entire Bond series\" and that \"until Blofeld's reappearance we must watch what is no better than a mundane diamond-smuggling melodrama, without the spectacle we associate with James Bond: the Las Vegas setting isn't exotic enough, there's little humour, assassins Mr. Kidd and Mr. Wint are similar to characters you'd find on The Avengers, but not nearly as amusing – and the trouble Bond gets into, even Maxwell Smart could escape.\"[32] IGN chose it as the third worst James Bond film, behind only The Man with the Golden Gun and Die Another Day.[33] Total Film listed Mr. Wint and Mr. Kidd, and Bambi and Thumper, as the first and second worst villains in the Bond series (respectively).[34] The film was more positively received by Xan Brooks of the Guardian who said it was \"oddly brilliant, the best of the bunch: the perfect bleary Bond film for an imperfect bleary western world.\"[35]The film was nominated for an Academy Award for Best Sound for Gordon McCallum, John W. Mitchell and Al Overton.[36] It lost to Fiddler on the Roof.[37]","box_office":"$116 million","cinematography":"Ted Moore","production_company":"Eon Productions","directed_by":"Guy Hamilton","diamonds_are_forever":"British cinema poster for Diamonds Are Forever, designed by Robert McGinnis","release_dates":"14 December 1971 (1971-12-14) (West Germany)|30 December 1971 (1971-12-30) (UK, premiere)||||","Production":"The producers originally intended to have Diamonds Are Forever re-create commercially successful aspects of Goldfinger, including hiring its director, Guy Hamilton.[1] Peter R. Hunt, who had directed On Her Majesty's Secret Service and worked in all previous Bond films as editor, was invited before Hamilton, but due to involvement with another project could only work on the film if the production date was postponed, which the producers declined to do.[2]While On Her Majesty's Secret Service was within its post-production stages, Richard Maibaum wrote initial treatments and a script for Diamonds Are Forever as a revenge-themed sequel with Irma Bunt and Marc-Ange Draco returning, and Bond mourning his deceased wife Tracy while Louis Armstrong's \"We Have All the Time in the World\" played in the background. When George Lazenby departed from the role prior to the film's release, a complete rewrite was requested, in addition to Maibaum's script failing to impress Albert R. Broccoli and Harry Saltzman.[3] Following this, an original plot had as a villain Auric Goldfinger's twin, seeking revenge for the death of his brother. The plot was later changed after Albert R. Broccoli had a dream, where his close friend Howard Hughes was replaced by an imposter. So the character of Willard Whyte was created, and Tom Mankiewicz was chosen to rework the script.[4] Mankiewicz says he was hired because Cubby Broccoli wanted an American writer to work on the script, since so much of it was set in Las Vegas \"and the Brits write really lousy American gangsters\" — but it had to be someone who also understood the British idiom, since it had British characters.[5] David Picker from United Artists had seen the stage musical Georgy! written by Mankiewicz, and recommended him; he who was hired on a two week trial and kept on for the rest of the movie. Mankiewicz later estimated the novel provided around 45 minutes of the film's final running time.[6]The adaptation eliminated the main villains from the source Ian Fleming novel, mobsters called Jack and Seraffimo Spang, but used the henchmen Shady Tree, Mr. Wint and Mr. Kidd.[4]Richard Maibaum's original idea for the ending was a giant boat chase across Lake Mead with Blofeld being pursued by Bond and all the Las Vegas casino owners who would be sailing in their private yachts. Bond would rouse the allies into action with a spoof of Lord Nelson's famous cry, \"Las Vegas expects every man to do his duty.\" Maibaum was misinformed; there were no Roman galleys or Chinese junks in Las Vegas, and the idea was too expensive to replicate, so it was dropped.[7]Maibaum may have thought the eventual oil rig finale a poor substitute, but it was originally intended to be much more spectacular. Armed frogmen would jump from the helicopters into the sea and attach limpet mines to the rig's legs (this explains why frogmen appear on the movie's poster). Blofeld would have escaped in his BathoSub and Bond would have pursued him hanging from a weather balloon.[8] The chase would have then continued across a salt mine with the two mortal enemies scrambling over the pure white hills of salt before Blofeld would fall to his death in a salt granulator. Permission was not granted by the owners of the salt mine. It also made the sequence too long. Further problems followed when the explosives set up for the finale were set off too early; fortunately, a handful of cameras were ready and able to capture the footage.[7]George Lazenby originally was offered a contract for seven Bond films, but declined and left after just one, On Her Majesty's Secret Service, on the advice of his agent.[9] Producers contemplated replacing him with John Gavin (though Batman star Adam West was also considered),[1] as well as Michael Gambon, who rejected the offer telling Broccoli that he was \"in terrible shape.\"[10] United Artists' chief David Picker was unhappy with this decision and made it clear that Connery was to be enticed back to the role and that money was no object. When approached about resuming the role of Bond, Connery demanded the fee of £1.25 million and to entice the actor to play Bond one more time United Artists offered to back two films of his choice.[11] After both sides agreed to the deal, Connery used the fee to establish the Scottish International Education Trust, where Scottish artists could apply for funding without having to leave their country to pursue their careers. Since John Gavin was no longer in the running for the role, his contract was paid in full by United Artists. The first film made under Connery's deal was The Offence directed by his friend Sidney Lumet.[1] The second was to be an adaptation of Macbeth by William Shakespeare using only Scottish actors and in which Connery himself would play the title role. This project was abandoned because another production of Macbeth (the Roman Polanski version) was already in production.Charles Gray was cast as villain Ernst Stavro Blofeld, after playing a Bond ally named Dikko Henderson in You Only Live Twice (1967).[1] David Bauer, who plays Morton Slumber, previously appeared uncredited as an American diplomat also in You Only Live Twice.Jazz musician Putter Smith was invited by Harry Saltzman to play Mr. Kidd after a Thelonious Monk Band show. Musician Paul Williams was originally cast as Mr. Wint. When he couldn't agree with the producers on compensation, Bruce Glover replaced him. Glover said he was surprised at being chosen, because at first producers said he was too normal and that they wanted a deformed, Peter Lorre-like actor.[1]Film star Bruce Cabot, who played the part of Bert Saxby, died the following year and this turned out to be his final film role. Jimmy Dean was cast as Willard Whyte after Saltzman saw a presentation of him. Dean was very worried about playing a Howard Hughes pastiche, because he was an employee of Hughes at the Desert Inn.[1]Actresses considered for the role of Tiffany Case included: Raquel Welch, Jane Fonda and Faye Dunaway. Jill St. John had originally been offered the part of Plenty O'Toole but landed the female lead after Sidney Korshak who assisted the producers in filming in Las Vegas locations recommended his client St. John,[12] who became the first American Bond girl.[13] Lana Wood was cast as Plenty O'Toole following a suggestion of screenwriter Tom Mankiewicz.[1] The woman in the bikini named \"Marie\", who in the beginning of the film is convinced by Bond to give up the location of Blofeld, was Denise Perrier, Miss World 1953.[4]A cameo appearance by Sammy Davis, Jr. playing on the roulette table was filmed, but his scene was eventually deleted.[14]Filming began on 5 April 1971, with the South African scenes actually shot in the desert near Las Vegas, and finished on 13 August 1971.[1] The film was shot primarily in the US, with locations including the Los Angeles International Airport,[15] Universal City Studios and eight hotels of Las Vegas.[16] Besides the Pinewood Studios in Buckinghamshire, other places in England were Dover and Southampton. The climactic oil rig sequence was shot off the shore of Oceanside, California. Other filming locations included Cap D'Antibes in France for the opening scenes, Amsterdam and Lufthansa's hangar at Frankfurt Airport, Germany.[17]Filming in Las Vegas took place mostly in hotels owned by Howard Hughes, since he was a friend of Cubby Broccoli.[13] Getting the streets empty to shoot was achieved through the collaboration of Hughes, the Las Vegas police and shopkeepers association.[7] The Las Vegas Hilton doubled for the Whyte House, and since the owner of the Circus Circus was a Bond fan, he allowed the Circus to be used on film and even made a cameo.[4][7] The cinematographers said filming in Las Vegas at night had an advantage: no additional illumination was required due to the high number of neon lights.[18] Sean Connery made the most of his time on location in Las Vegas. \"I didn't get any sleep at all. We shot every night, I caught all the shows and played golf all day. On the weekend I collapsed – boy, did I collapse. Like a skull with legs.\" He also played the slot machines, and once delayed a scene because he was collecting his winnings.[19]The site used for the Willard Whyte Space Labs (where Bond gets away in the Moon Buggy) was actually, at that time, a Johns-Manville gypsum plant located just outside Las Vegas. The home of Kirk Douglas was used for the scene in Tiffany's house, while the Elrod House in Palm Springs, designed by John Lautner, became Willard Whyte's house.[20] The exterior shots of the Slumber mortuary were of the Palm Mortuary in Henderson, NV. The interiors were a set constructed at Pinewood Studios, where Ken Adam imitated the real building's lozenge-shaped stained glass window in its nave. During location filming, Adam visited several funeral homes in the Las Vegas area, the inspiration behind the gaudy design of the Slumber mortuary (the use of tasteless Art Nouveau furniture and Tiffany lamps) came from these experiences.[17] Production wrapped with the crematorium sequence, on 13 August 1971.[4]Since the car chase in Las Vegas would have many car crashes, the filmmakers had an arrangement with Ford to use their vehicles. Ford's only demand was that Sean Connery had to drive the 1971 Mustang Mach 1 which serves as Tiffany Case's car.[7] The Moon Buggy was inspired by the actual NASA vehicle, but with additions such as flailing arms since the producers didn't find the design \"outrageous\" enough. Built by custom car fabricator Dean Jeffries on a rear-engined Corvair chassis, it was capable of road speeds. The fibreglass tires had to be replaced during the chase sequence because the heat and irregular desert soil ruined them.[21]Hamilton had the idea of making a fight scene inside a lift, which was choreographed and done by Sean Connery and stuntman Joe Robinson.[22] The car chase where the red Mustang comes outside of the narrow street on the opposite side in which it was rolled, was filmed over three nights on Fremont Street in Las Vegas. The alleyway car roll sequence is actually filmed in two locations. The entrance was at the car park at Universal Studios and the exit was at Fremont Street, Las Vegas. It eventually inspired a continuity mistake, as the car enters the alley on the right side tires and exits the street driving on the left side.[1][23] While filming the scene of finding Plenty O'Toole drowned in Tiffany's swimming pool, Lana Wood actually had her feet loosely tied to a cement block on the bottom. Film crew members held a rope across the pool for her, with which she could lift her face out of the water to breathe between takes. The pool's sloping bottom made the block slip into deeper water with each take. Eventually, Wood was submerged but was noticed by on-lookers and rescued before actually drowning. Wood, being a certified diver, took some water but remained calm during the ordeal, although she later admitted to a few \"very uncomfortable moments and quite some struggling until they pulled me out.\"[24]\"Diamonds Are Forever\", the title song, was the second James Bond theme to be performed by Shirley Bassey, after \"Goldfinger\" in 1964. Producer Harry Saltzman reportedly hated the song, and only the insistence of co-producer Cubby Broccoli kept it in the film. Saltzman's major objection was to the sexual innuendo of the lyrics. Indeed, in an interview for the television programme James Bond's Greatest Hits composer John Barry revealed that he told Bassey to imagine she was singing about a penis. Bassey would later return for a third performance for 1979's Moonraker.The original soundtrack was once again composed by John Barry, his sixth time composing for a Bond film.With Connery back in the lead role, the \"James Bond Theme\" was played by an electric guitar in the somewhat unusual, blued gunbarrel sequence accompanied with prismatic ripples of light, and pre-credits sequence, and in a full orchestral version during a hovercraft sequence in Amsterdam.","produced_by":"Harry Saltzman Albert R. Broccoli","starring":"Sean Connery Jill St. John Charles Gray Lana Wood Jimmy Dean Bruce Cabot","running_time":"120 minutes","music_by":"John Barry","edited_by":"Bert Bates John Holmes","budget":"$7.2 million"}