{"based_on":"Donnie Brasco: My Undercover Life in the Mafia  by Joseph D. Pistone Richard Woodley","country":"United States","distributed_by":"TriStar Pictures","screenplay_by":"Paul Attanasio","Plot":"Aging gangster Benjamin \"Lefty\" Ruggiero is introduced to a jewel thief named Donnie Brasco. Donnie impresses Lefty by threatening a diamond dealer whom Donnie suspects of selling Lefty a fake ring. Lefty teaches Donnie the rules of the Mafia and introduces him to several \"made men\" including Dominick \"Sonny Black\" Napolitano, and Nicholas Santora, as well as caporegime Alphonse “Sonny Red” Indelicato to whom Lefty owes money and is disliked by Sonny Black.Donnie Brasco is actually Joseph D. Pistone, an undercover FBI agent. His wife hates his job, and the couple have heated arguments throughout the film. At home, Joseph's behavior becomes more and more like the criminal he pretends to be.After the Bonanno family's street boss is killed, Sonny Red assumes the new position. Sonny Black is promoted to captain, angering Lefty, as he provided for Sonny Black's family while the latter was in prison. As the crew runs a series of successful shakedowns and hijackings in Brooklyn, Donnie collects more information for the FBI.Due to Joseph's success at infiltrating the Mafia, a man from Washington, Dean Blanford, takes an interest in the case. He asks Joseph to incorporate a Miami-based FBI agent, Richard \"Richie\" Gazzo, into the operation. Joseph is reluctant but convinces Sonny Black and crew to meet Richie in Miami.In Miami, Donnie and Lefty plan to run Richie's club on their own and attempt to impress Florida mob boss Santo Trafficante Jr. with a yacht trip. However, Sonny Black reaches out to Trafficante first, angering Lefty, especially when Sonny Black tells Donnie to work for him and run the club as an unofficial made man. Donnie reconciles with Lefty when Lefty's son nearly dies of a drug overdose. On its opening day, Sonny Black's club is raided by Miami police on orders from Trafficante himself, who was in allegiance with Sonny Red. Suspecting the latter is responsible, the crew, without Donnie, kill Sonny Red and two rival gangsters, as well as Nicky Santora (who, Sonny Black suspects, tipped off Sonny Red about the club). With Sonny Black the new street boss, Donnie is tasked with finding and killing Sonny Red's son, Bruno.One last dispute between Donnie and his wife becomes physical. Joseph hits his wife and is then remorseful: \"I am not becoming like them, Maggie, I am them.\"Knowing he will have to end his case and make arrests, Donnie tries convincing Lefty to escape his criminal life. Lefty confronts Donnie about working with the FBI. If Donnie does not kill Bruno, Lefty will kill Donnie. Before either murder can be committed, FBI agents rush in to arrest both potential killers. FBI agents reveal Donnie's true identity to Sonny Black and the crew. Lefty walks off to his implied death for letting Donnie infiltrate the gang, and Joseph is awarded with a $500 check and medal for his work.","language":"English","Reception":"Donnie Brasco has received critical acclaim. Review aggregate Rotten Tomatoes reports that 87 percent of critics have given the film a positive review based on 55 reviews, with an average score of 7.8 out of 10, making the film a \"Certified Fresh\" on the website's rating system.[4] At Metacritic, which assigns a weighted mean rating out of 100 to reviews from mainstream critics, the film received an average score of 76, based on 21 reviews, which indicates \"Generally favorable reviews\".[5]Entertainment Weekly called it a \"wonderfully dense, clever, and moving gangland thriller,\" and gave it an A–, also praising Paul Attanasio's screenplay as \"a rich, satisfying gumbo of back stabbing, shady business maneuvers, and mayhem.\"[6] Roger Ebert from the Chicago Sun-Times gave it three and a half stars out of four.[7] Siskel and Ebert gave Donnie Brasco \"two thumbs up.\"[8] Peter Travers of Rolling Stone praised the film, saying that \"Donnie Brasco is one terrific movie.\"[9] Mick LaSalle from the San Francisco Chronicle gave the film a positive review and said that Donnie Brasco was \"a first class Mafia thriller.\"[10]Critics praised Depp's performance especially: a Salon.com review hailed Depp's performance as \"sensational.\"[11] New York Magazine called him \"graceful\" and found his acting highly believable: \"We can believe that the mob might take him for a tough, ambitious young hood—he has the wariness and the self-confidence that creates an aura.\"[12]According to Charles Taylor in his review for Salon.com, both Pacino and Depp are \"in top form\"; in remarking on Pacino's frequent collaborations with younger actors (Sean Penn, John Cusack), Taylor called Donnie Brasco \"the best in this series of duets\" and singled out Pacino's skills: \"His final scene is all the more heartbreaking for the economy of gesture and feeling he brings it. It's an exit that does justice to both the actor and the role, and it leaves an ache in the movie.\"[11] Entertainment Weekly reserved its highest praise for Pacino: \"If Donnie Brasco belongs to any actor, though, it's Al Pacino.\"[6]American Film Institute Lists","box_office":"$124.9 million[1]","cinematography":"Peter Sova","directed_by":"Mike Newell","Historical Accuracy":"In his subsequent novel \"Unfinished Business: Operation Donnie Brasco\" Special Agent Pistone described the movie as 90 percent accurate. As for the remaining 10 percent, he points in which scenes the filmmakers took some artistic license:","production_companies":"Mandalay Entertainment Baltimore Pictures Mark Johnson Productions","donnie_brasco":"Theatrical release poster","release_dates":"February 28, 1997 (1997-02-28)|||||","Production":"Louis DiGiaimo, who worked as a casting director for Barry Levinson, was a childhood acquaintance of Joseph D. Pistone, and served as a consultant for his book Donnie Brasco: My Undercover Life in the Mafia. Once the book came out, Levinson's company, Baltimore Pictures, purchased the rights, with screenwriter Paul Attanasio set to write the script. Stephen Frears would direct and Tom Cruise would play Pistone/Brasco. In 1991, the film was postponed due to the release of Goodfellas, as the producers felt there was not enough room for two hyperrealistic Mafia films. When the project was resurrected in 1996, Frears was replaced with Mike Newell, and Johnny Depp was cast as Pistone/Brasco. Al Pacino was the only actor kept from the first attempt to make the film. Pistone was hired as a consultant, helping Depp and Pacino develop their characters.[3]","Box office":"The movie grossed $41,909,762 in the US and an estimated $83,000,000 internationally.[1]","produced_by":"Mark Johnson|Barry Levinson|Louis DiGiaimo|Gail Mutrux|","starring":"Al Pacino|Johnny Depp|Michael Madsen|Bruno Kirby|James Russo|Anne Heche|","running_time":"126 minutes","music_by":"Patrick Doyle","edited_by":"Jon Gregory","budget":"$35 million","Academy Award nomination":"The film was nominated for an Academy Award in the category of Best Adapted Screenplay.[15]"}