{"country":"United States","distributed_by":"Gravitas Ventures","language":"English","Reception":"In a mixed review, Crave Online wrote that it \"is full of gleeful raunchiness and a registered sex offender or two, but not much actual comedy.\"[8] The Austin Chronicle wrote, \"This heavy comedy, scripted by Karey Dornetto, delivers its expected yield of snappy and emotionally charged levity from a charismatic cast that also features Fred Armisen, Molly Shannon, and Aubrey Plaza in supporting roles. But as the story's centerpiece, Greer's character ultimately gives the audience too little to root for. Insufferable and unrepentant until far too late, we don't feel conflicted like we should when her lone true ally finally says 'enough is enough.' And although it's hard to pry our eyes away from such a cool cast, by that time the feeling is mutual.\"[9] Variety was also mixed in their opinion, as they felt that the work would likely not gather the cult following that Babbit's 1999 film But I’m a Cheerleader received and that Fresno was overall \"a mean-spirited farce whose strenuous bad taste seldom translates into actual laughs.\"[10] Slant Magazine wrote, \"Brightly lit and cheerfully acted, Jamie Babbit's Fresno pushes its not-so-funny premise almost to the breaking point, sacrificing character development on the altar of comedy along the way.\"[11] Aaron Hillis of The Village Voice called the film \"Consistently frickin' hilarious. Perfect cast.\"[12] The Epoch Times described the film as an \"absurdly sweet, kooky, and dark sister comedy...the film female ensemble you root for.\"[this quote needs a citation] Flavorwire wrote, \"As a performer's showcase, it's hard to beat. Judy Greer and Natasha Lyonne anchor it with a priceless good sister/bad sister dynamic; Lyonne is atypically sunny (and typically delightful) while Greer, as a bitter burnout, puts a sharp little spin on every line, turning each into a little dagger. Aubrey Plaza also shines in a brief but juicy bit as a would-be love interest for Lyonne.\"[13]","Synopsis":"Martha (Natasha Lyonne) is an overly optimistic housekeeper working at a local hotel in Fresno, California. Her sister Shannon (Judy Greer) is a sex addict that was recently forced to go into rehab after her addiction caused her to lose her job. As she now needs gainful employment, Shannon allows Martha to talk her into working at the hotel as well. However soon after she begins work Shannon accidentally kills one of the hotel's guests and convinces Martha to help her dispose of the body. This is easier said than done, as their attempts result in pet cemetery owners Ruby (Allison Tolman) and Gerald (Fred Armisen) blackmailing them for hush money. Without any other options, Martha and Shannon must now commit a series of robberies to come up with the money.","cinematography":"Jeffrey Waldron","directed_by":"Jamie Babbit","production_companies":"Gamechanger Films Leeden Media Lakeview Productions TALU Productions Andrea Sperling Productions","release_dates":"March 14, 2015 (2015-03-14) (SXSW)|October 2, 2015 (2015-10-02) (United States)||||","Production":"While writing the script Karey Dornetto partially drew upon her own past relationship with her sister, wondering, \"What if I still lived in my same hometown and we were in this sort of a meshed relationship, like a co-dependent relationship?\".[4] From there she began to add the film's fictional elements such as Shannon's sex addiction.[4] Filming was initially intended to take place in Cleveland, but due to budget issues Dornetto and Babbit had to shift the film's setting to Fresno, a location they chose because it seemed like it was a city people wanted to get away from. The film was workshopped as part of the \"Made in Cleveland\" project, an anthology of 11 short films. Shot in Cleveland in 2012 and released in theaters in 2013, the short film that would later become \"Addicted to Fresno\" was originally called \"Fucking Cleveland\" and starred Busy Philipps and Gillian Jacobs in the lead roles. \"Made in Cleveland\" was shot on a low budget of $50,000, a considerable amount of which was spent on Babbit's portion of the film. [4] In August 2014, it was announced that Greer and Lyonne would portray the two central characters of Fresno, marking the second time Lyonne has worked with Babbit.[5] The two actresses stated that part of the reason that they chose to act in the film was because their characters were atypical to how they were traditionally cast, as Lyonne is usually cast as a \"trainwreck\" while Greer was usually the \"levelheaded\" character.[6] The actors were encouraged to engage in improvisation, though they stayed close to the script. Influences included Welcome to the Dollhouse, Bottle Rocket, and Bridesmaids.[4] Shooting took place in Los Angeles.[7]","produced_by":"Andrea Sperling|Stephanie Meurer|","starring":"Judy Greer|Natasha Lyonne|Aubrey Plaza|Malcolm Barrett|Allison Tolman|Fred Armisen|","running_time":"85 minutes","addicted_to_fresno":"Theatrical release poster","music_by":"Nathan Matthew David","edited_by":"Suzanne Spangler","Release":"The film had its world premiere at the SXSW Film Festival on March 14, 2015.[14] The film premiered at the Toronto LGBT Film Festival on May 23, 2015, and premiered at the Frameline Film Festival on June 26, 2015.[15] The film also premiered in the United Kingdom on June 27, 2015 at the Edinburgh International Film Festival.[16] On May 28, 2015 the films distribution rights were acquired by Gravitas Ventures with a planned fall 2015 release.[2] The film was released on September 1, 2015, through video on demand, prior to being released on October 2, 2015, in a limited release.[17]","written_by":"Karey Dornetto"}