{"based_on":"Chicago  by Bob Fosse Fred Ebb Chicago  by Maurine Dallas Watkins","country":"United States","distributed_by":"Miramax Films","screenplay_by":"Bill Condon","Plot":"In 1924, Roxie Hart sees star Velma Kelly perform (\"All That Jazz\") at a Chicago theater. Wanting stardom for herself, she begins an affair with Fred Casely, who claims to know the manager. After the show, Velma is arrested for killing her husband Charlie and sister Veronica, who were in bed together. A month later, Casely admits to Roxie that he has no showbiz connections and just wanted her body. Enraged, she shoots him dead. She convinces her husband, Amos, to take the blame, telling him she killed a burglar in self-defense. As Amos confesses to the detective, Roxie fantasizes that she is singing a song devoted to her husband (\"Funny Honey\"). However, when the detective brings up evidence that Roxie and Casely were having an affair, Amos recants; Roxie furiously admits what really happened and is arrested. Ambitious District Attorney Harrison announces he will seek the death penalty.At Cook County Jail, Roxie is sent to Murderer's Row, under the care of the corrupt matron \"Mama\" Morton (\"When You're Good to Mama\"). Roxie meets her idol Velma, but her friendship is rudely rebuffed. She learns the backstories of the other women there, including Velma Kelly (\"Cell Block Tango\"). On Morton's advice, Roxie engages Velma's lawyer, the brilliant Billy Flynn (\"All I Care About\"). Flynn and Roxie manipulate the press, reinventing Roxie's identity as an originally virtuous woman turned bad by the fast life of the city; she claims she had the affair with Casely because Amos was always working, but repented and dumped him for Amos, and Casely jealously attacked her (\"We Both Reached for the Gun\"). The press believe the story; praised by the public as a tragic heroine, Roxie becomes an overnight sensation (\"Roxie\"). Velma, unhappy at losing the public's attention, tries to convince Roxie to join her act, replacing the sister that she murdered (\"I Can't Do It Alone\"), but Roxie, now the more popular of the two rivals, snubs her just as Velma originally did.Meanwhile, Kitty Baxter, a wealthy heiress, is arrested for murdering her husband and his two lovers, and the press and Flynn pay more attention to her. To Velma's surprise, Roxie quickly steals back the fame by claiming to be pregnant. Amos is ignored by the press (\"Mister Cellophane\"), and Flynn, to create more sympathy for Roxie, convinces him that the child is Casely's, and that he should divorce Roxie in the middle of her predicament. Roxie over-confidently fires Flynn, believing she can now win on her own. However, when Katalin Helinszki, a Hungarian woman from Murderess' Row is hanged, she realizes the gravity of the situation and re-hires Flynn.Roxie's trial begins, and Billy turns it into a media spectacle (\"Razzle Dazzle\") with the help of the sensationalist newspaper reporters and radio personality Mary Sunshine. Billy discredits witnesses, manipulates evidence, and even stages a public reconciliation between Amos and Roxie when she says the child is his. The trial seems to be going Roxie's way until Velma appears with Roxie's diary: she reads incriminating entries in exchange for amnesty in her own case. Billy discredits the diary, implying that Harrison was the one who planted the evidence (\"A Tap Dance\"). Roxie is acquitted, but her fame dies moments later when a woman shoots her husband just outside the court. Flynn tells her to accept it, and admits that he tampered with her diary himself, in order to incriminate the district attorney and also free two clients at once. Amos remains loyal and excited to be a father, but Roxie cruelly rejects him, revealing that she is not pregnant, and he finally leaves her.Roxie does become a vaudeville performer, but is very unsuccessful (\"Nowadays\"). Velma is just as unsuccessful, and again approaches Roxie to suggest performing together: a double act consisting of two murderers. Roxie initially refuses, but later accepts when Velma points out that they can perform together despite their resentment for each other. The two stage a spectacular performance that earns them the love of the audience and the press (\"Nowadays / Hot Honey Rag\"). The film concludes with Roxie and Velma receiving a standing ovation from an enthusiastic audience, and proclaiming that, \"We couldn't have done it without you\".","language":"English","box_office":"$306.8 million","cinematography":"Dion Beebe","production_company":"Producer Circle Co. Zadan/Meron Productions","directed_by":"Rob Marshall","release_dates":"December 10, 2002 (2002-12-10) (Samuel Goldwyn Theater)|December 27, 2002 (2002-12-27) (United States)||||","Production and development":"The film is based on the 1975 Broadway musical, which ran for 936 performances but was not well received by audiences, primarily due to the show's cynical tone. A film version of Chicago was to have been the next project for Bob Fosse,[4] who had directed and choreographed the original 1975 Broadway production and had won an Oscar for his direction of the film version of Cabaret (1972). Although he died before realizing his version, Fosse's distinctive jazz choreography style is evident throughout the 2002 film, and he is thanked in the credits. The minimalist 1996 revival of the musical proved far more successful, having played more than 7,800 performances (as of August 2015), holding records for longest-running musical revival, longest-running American musical on Broadway, and third longest-running show in Broadway history. Its runaway success sparked a greater appreciation of the 1975 original production and renewed stalled interest in a long-anticipated film adaptation, which incorporates the influences of both productions.[5] The original production's musical numbers were staged as vaudeville acts; the film respects this but presents them as cutaway scenes in the mind of the Roxie character, while scenes in \"real life\" are filmed with a hard-edged grittiness. (This construct is the reason given by director Marshall why \"Class,\" performed by Velma & Mama, was cut from the film.)[6] The musical itself was based on a 1926 Broadway play by Maurine Watkins about two real-life Jazz-era murderers Beulah Annan (Roxie Hart) and Belva Gaertner (Velma Kelly). The George Abbott-directed production, starring Francine Larrimore and Juliette Crosby, ran for 172 performances at the Music Box Theatre, and within a year was adapted to a film in which Gaertner herself had a cameo. Chicago was produced by American companies Miramax Films and The Producers Circle in association with the German company Kallis Productions. Chicago was filmed in Toronto, Ontario, Canada. The courthouse scene was shot in Osgoode Hall. Other scenes were filmed at Queen's Park, former Gooderham and Worts Distillery, Casa Loma, the Elgin Theatre, Union Station, the Canada Life Building, the Danforth Music Hall, and at the Old City Hall.[citation needed] All vocal coaching for the film was led by Toronto-based Elaine Overholt, whom Richard Gere thanked personally during his Golden Globe acceptance speech.","produced_by":"Martin Richards","starring":"Renée Zellweger Catherine Zeta-Jones Richard Gere Queen Latifah John C. Reilly Colm Feore Lucy Liu Dominic West Christine Baranski","running_time":"113 minutes[1]","chicago":"Theatrical release poster","music_by":"John Kander","edited_by":"Martin Walsh","Release":"On the review aggregate website Rotten Tomatoes, the film holds an 87% approval rating; the general consensus states: \"A rousing and energetic adaptation of the Broadway musical, Chicago succeeds on the level of pure spectacle, but provides a surprising level of depth and humor as well.\"[7] On Metacritic, the film averaged a critical score of 82 (indicating \"universal acclaim\").[8] The cast received widespread universal acclaim for their performances. Tim Robey, writer for The Daily Telegraph in the United Kingdom, labeled Chicago as \"The best screen musical for 30 years.\" He also stated that it has taken a \"three-step tango for us to welcome back the movie musical as a form.\" Robey said \"This particular Chicago makes the most prolific use it possibly can out of one specific advantage the cinema has over the stage when it comes to song and dance: it's a sustained celebration of parallel montage.\" [9] Roger Ebert called it \"Big, brassy fun\".[10] However, other reviews claimed that there were issues with the film being too streamlined, and minor complaints were made toward Marshall's directing influences. AMC critic Sean O'Connell explains in his review of the film that \"All That Jazz\", \"Funny Honey\", and \"Cell Block Tango\" play out much like you'd expect them to on stage, with little enhancement (or subsequent interference) from the camera. But by the time \"Razzle Dazzle\" comes around, all of these concerns are diminished.[11]The film grossed $170,687,518 in the United States and Canada, as well $136,089,214 in other territories.[12] Combined, the film grossed $306,776,732 worldwide, which was, at the time, the highest gross of any film never to reach #1 or #2 in the weekly box office charts in the North American markets (Canada and United States—where it peaked at #3). This record has since been outdone by Alvin and the Chipmunks: The Squeakquel.[13] Worldwide, Chicago was the highest grossing live action musical with $306 million, a record that was then broken by Mamma Mia!.Chicago along with an earlier musical Moulin Rouge! and the Hip hop centred film 8 Mile, is widely considered to be responsible for the re-emergence of the musical film genre in the 21st century. Following the success of Chicago many musical films have been released in cinemas including Phantom of the Opera, The Producers, Rent, Dreamgirls (also written by Bill Condon), Hairspray (which also had Queen Latifah), Enchanted, Sweeney Todd: The Demon Barber of Fleet Street (which also had costumes by Coleen Atwood), Mamma Mia! (which also had Christine Baranski), Les Misérables, Rock of Ages (which also had Catherine Zeta Jones), Sunshine on Leith, and Into The Woods (also directed by Rob Marshall and also featuring Baranski and costumes by Atwood), all of these, bar Enchanted and Sunshine on Leith, were adaptations of Broadway/West End stage shows (Enchanted was an original property while Sunshine on Leith was an adaptation of a Dundee Reps production).Chicago was released on DVD in Region 1 (USA, Canada, and US territories) on August 19, 2003. It was released in Full Screen and Widescreen. In addition to this release, a two-disc \"Razzle Dazzle\" Edition was released over two years later on December 20, 2005, and later, on Blu-ray format, in January 2007 and, in an updated release, in May 2011. Miramax was the label responsible for the production of the DVDs and the discs themselves provide a feature-length audio commentary track with director Marshall and screenwriter Condon. There is also a deleted musical number called \"Class\", performed by Zeta-Jones and Queen Latifah.","budget":"$45 million[2]"}