{"Cast":"Roger Behr cameos as a comedian. Shirley MacLaine has a cameo appearance as the holographic host of the \"Past Lives Pavilion\" (a reference to her publicly known belief in reincarnation). Glen Chin has a cameo role as a sumo wrestler.","country":"United States","distributed_by":"Warner Bros. (Time Warner)","Plot":"Daniel Miller (Albert Brooks), a 40-year-old Los Angeles advertising executive, dies in a car accident on his birthday and is sent to the afterlife. He arrives in Judgment City, a Purgatory-like waiting area populated by the recently deceased of the western half of the United States, where he is to undergo the process of having his life on earth judged. Daniel and the rest of the recently deceased are offered many Earth-like amenities and activities in the city while they undergo their judgment processes—from all-you-can-eat restaurants (which cause no weight gain and serve the best food), to bowling alleys and comedy clubs.As his defense attorney, Bob Diamond (Rip Torn), explains to Daniel that people from Earth use so little of their brains (only three to five percent) that they spend most of their lives functioning on the basis of their fears. \"When you use more than five percent of your brain, you don't want to be on Earth, believe me,\" says Diamond. If the court determines that Daniel has conquered his fears, he will be sent on to the next phase of existence, where he will be able to use more of his brain and thus be able to experience more of what the universe has to offer. Otherwise, his soul will be reincarnated on Earth to live another life in another attempt at moving past his fears.Daniel's judgment process is presided over by two judges (played by Lillian Lehman and George D. Wallace). Diamond argues that Daniel should move onto the next phase. His formidable opponent is Lena Foster (Lee Grant). Diamond informs Daniel that she is known as \"the Dragon Lady.\" Each utilizes video-like footage from select days in the defendants' lives, shown to the judges to illustrate their case.During the procedure, Daniel meets and falls in love with Julia (Meryl Streep), a woman who lived a seemingly perfect life of courage and generosity, especially compared to his. The proceedings do not go well for Daniel. Foster shows a series of episodes in which Daniel did not overcome his fears, as well as various other bad decisions and mishaps. The final nail in his coffin, it seems, is when Foster, on the last day of arguments, plays footage of his previous night with Julia, in which he declines to sleep with her, for what Foster believes is his same fear and lack of courage. It is ruled that Daniel will return to Earth. Meanwhile, Julia is judged worthy to move on. Before saying goodbye Diamond comforts Daniel with the knowledge that the court is not infallible and just because Foster won it doesn't mean she's right. Daniel remains disappointed.Daniel finds himself strapped to a seat on a tram poised to return to Earth, when he spots Julia on a different tram. On impulse, he unstraps himself, escapes from the moving tram, and risks electrocution and injury to get to Julia. Although he cannot enter her tram at first, the entire event is being monitored by Foster and Diamond, who convinces the judges that this last-minute display of courage has earned Daniel the right to move on. The judges agree and open the doors on Julia’s tram, allowing Daniel in, reuniting him with Julia and allowing them to move on to the next phase of existence together.","language":"English","Reception":"Variety called it an \"inventive and mild bit of whimsy\" in which Brooks has a \"little fun with the Liliom idea of being judged in a fanciful afterlife, but he doesn't carry his conceit nearly far enough.\"[1] Roger Ebert called it \"funny in a warm, fuzzy way\" and a film with a \"splendidly satisfactory ending, which is unusual for an Albert Brooks film.\"[2] The New York Times called it \"the most perceptive and convincing among a recent spate of carpe diem films\"— a reference to films such as Dead Poets Society (1989), Field of Dreams (1989), and Ghost (1990).[3] Richard Schickel wrote:[4]Defending Your Life is better developed as a situation than it is as a comedy (though there are some nice bits, the stand-up comedian asking Daniel how he died- \"on stage, like you\" and a hotel lobby sign that reads, WELCOME KIWANIS DEAD). But Brooks has always been more of a muser than a tummler, and perhaps more depressive than he is manic. He asks us to banish the cha-cha-cha beat of conventional comedy from mind and bend to a slower rhythm. His pace is not that of a comic standing up at a microphone barking one-liners, but of an intelligent man sitting down by the fire mulling things over. And in this case offering us a large slice of angel food for thought.The film received mostly positive reviews from critics and holds a 96 percent rating on review aggregator Rotten Tomatoes (based on 26 reviews).[5]The film was not a box office success, grossing about $16 million in the United States. It received three Saturn Award nominations, for Best Actress (Meryl Streep), Best Fantasy Film, and Best Writing (Albert Brooks).[6]American Film Institute recognition:Regarding the response from fans, Brooks has said[when?], \"I've gotten thousands and thousands of letters of people who had relatives that were dying, or they were dying themselves, and the movie made them feel better. I guess it's because it presents some possibility that doesn't involve clouds and ghostly images.\"[8]","box_office":"$16,371,128","cinematography":"Allen Daviau","production_company":"Geffen Pictures","directed_by":"Albert Brooks","defending_your_life":"Defending Your Life poster","release_dates":"March 22, 1991 (1991-03-22)|||||","produced_by":"Robert Grand Michael Grillo Herb Nanas","starring":"Albert Brooks|Meryl Streep|Rip Torn|Lee Grant|Buck Henry|","running_time":"112 minutes","Video releases":"Defending Your Life was released on VHS and Laserdisc in early 1992. Warner Bros. Home Video released the film on DVD on April 3, 2001, in a cardboard snap case. It features 1.85:1 anamorphic widescreen formatting, subtitles in English, French, Spanish, and Portuguese, cast and crew information, and the film's theatrical trailer. Warner re-released the film in 2008 in a two-pack DVD set with Brooks' Looking for Comedy in the Muslim World.","music_by":"Erroll Garner Michael Gore","edited_by":"David Finfer","written_by":"Albert Brooks"}