{"country":"United States","Awards and nominations":"The film won four Academy Awards and was nominated for a further five:[15]","distributed_by":"20th Century Fox Columbia Pictures","Plot":"Joe Gideon is a theater director and choreographer trying to balance work on his latest Broadway musical with editing a Hollywood film he has directed. He is a workaholic who chain-smokes cigarettes, and without a daily dose of Vivaldi, Visine, Alka-Seltzer, Dexedrine, and sex, he wouldn't have the energy to keep up the biggest \"show\" of all — his life. His girlfriend Katie Jagger, his ex-wife Audrey Paris, and daughter Michelle try to pull him back from the brink, but it is too late for his exhausted body and stress-ravaged heart. In his imagination, he flirts with an angel of death named Angelique.Gideon's condition gets progressively worse. He is rushed to a hospital after experiencing chest pains during a particularly stressful table read (with the penny-pinching backers in attendance) and admitted with severe attacks of angina. Joe brushes off his symptoms, and attempts to leave to go back to rehearsal, but he collapses in the doctor's office and is ordered to stay in the hospital for three to four weeks to rest his heart and recover from his exhaustion. The show is postponed, but Gideon continues his antics from the hospital bed, in brazen denial of his mortality. Champagne flows, endless strings of women frolic around his hospital room and the cigarettes are always lit. Cardiogram readings don't show any improvement as Gideon dances with death. As the negative reviews for his feature film (which has been released without him) come in, Gideon has a massive coronary and is taken straight to coronary artery bypass surgery.The backers for the show must then decide whether it's time to pack up or replace Gideon as the director. Their matter-of-fact money-oriented negotiations with the insurers are juxtaposed with graphic scenes of (presumably Joe's) open heart surgery. The producers realize that the best way to recoup their money and make a profit is to bet on Gideon dying — which would bring in a profit of over USD$500,000. Meanwhile, elements from Gideon's past life are staged in dazzling dream sequences of musical numbers he directs from his hospital bed while on life support. Realizing his death is imminent, his mortality unconquerable, Gideon has another heart attack. In the glittery finale, he goes through the five stages of grief — anger, denial, bargaining, depression and acceptance - featured in the stand-up routine he has been editing. As death closes in on Gideon, the fantasy episodes become more hallucinatory and extravagant, and in a final epilogue that is set up as a truly monumental live variety show featuring everyone from his past, Gideon himself takes center stage.","language":"English","Critical reception":"Reviews have been largely positive: All That Jazz scores an 87% \"Fresh\" (or \"good\") rating on review aggregation site Rotten Tomatoes.[9]In his review in The New York Times, Vincent Canby called the film \"an uproarious display of brilliance, nerve, dance, maudlin confessions, inside jokes and, especially, ego\" and \"an essentially funny movie that seeks to operate on too many levels at the same time... some of it makes you wince, but a lot of it is great fun... A key to the success of the production is the performance of Roy Scheider as Joe Gideon... With an actor of less weight and intensity, All That Jazz might have evaporated as we watched it. Mr. Scheider's is a presence to reckon with.\"[10]Variety described it as \"a self-important, egomaniacal, wonderfully choreographed, often compelling film\" and added, \"Roy Scheider gives a superb performance as Gideon, creating a character filled with nervous energy... The film's major flaw lies in its lack of real explanation of what, beyond ego, really motivates [him].\"[11]TV Guide said, \"The dancing is frenzied, the dialogue piercing, the photography superb, and the acting first-rate, with non-showman Scheider an illustrious example of casting against type . . . All That Jazz is great-looking but not easy to watch. Fosse's indulgent vision at times approaches sour self-loathing.\"[12]Film critic Leonard Maltin gave the film two-and-a-half stars (out of four) in his 2009 movie guide; he said that the film was \"self-indulgent and largely negative,\" and that \"great show biz moments and wonderful dancing are eventually buried in pretensions\"; he also called the ending \"an interminable finale which leaves a bad taste for the whole film.\"[7]Time Out London states, \"As translated onto screen, [Fosse's] story is wretched: the jokes are relentlessly crass and objectionable; the song 'n' dance routines have been created in the cutting-room and have lost any sense of fun; Fellini-esque moments add little but pretension; and scenes of a real open-heart operation, alternating with footage of a symbolic Angel of Death in veil and white gloves, fail even in terms of the surreal.\"[13]Upon release in 1979, master director Stanley Kubrick (who is referenced in the movie) reportedly believed it to be the \"best film I think I have ever seen\".[14] In 2001, All That Jazz was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in the National Film Registry. In 2006, the film ranked #14 on the American Film Institute's Greatest Movie Musicals list.The film would be the last musical nominated for the Academy Award for Best Picture until Disney's Beauty and the Beast (1991) and the last live-action musical nominated until Baz Luhrmann's Moulin Rouge! (2001).","box_office":"$37,823,676[3]","cinematography":"Giuseppe Rotunno","directed_by":"Bob Fosse","Home media":"Fox released a \"Special Music Edition\" DVD in 2007, with an audio commentary by the film's Oscar-winning editor, Alan Heim. The DVD issued in 2003 features scene-specific commentary by Roy Scheider and interviews with Scheider and Bob Fosse. A Blu-Ray and DVD edition were released in August 2014 with new supplements through the Criterion Collection brand.[17]","release_dates":"December 20, 1979 (1979-12-20)|||||","Production":"The film's structure is often compared to Federico Fellini's 8½, another thinly-veiled autobiographical film with fantastical elements.[5][6][7]The part of 'Audrey Paris', Joe's ex-wife and continuing mentor, played by Leland Palmer, closely reflects that of Fosse's wife, dancer and actress Gwen Verdon, who continued to work with him on projects including Chicago and All That Jazz itself.Gideon's rough handling of chorus girl Victoria Porter closely resembles Fosse's own treatment of Jennifer Nairn-Smith during rehearsals for Pippin.[8] Nairn-Smith herself appears in the film as Jennifer, one of the NY/LA dancers.Ann Reinking was one of Bob Fosse's partners at the time, and was more or less playing herself in the film, but nonetheless she was required to audition for the role as Gideon's girlfriend, 'Kate Jagger'.Cliff Gorman was cast in the titular role of The Stand-Up, the film-within-a-film version of Lenny after having played the role of Lenny Bruce in the original theatrical production of the show (culminating in a Tony Award for his acting), but was passed over for the film role in favor of Dustin Hoffman.Fosse himself died from a heart attack on September 23, 1987, at George Washington University Hospital, while a revival of Sweet Charity was opening at the nearby National Theatre (Washington, D.C.).","produced_by":"Robert Alan Aurthur Daniel Melnick Wolfgang Glattes Kenneth Utt","starring":"Roy Scheider Jessica Lange Leland Palmer Ann Reinking","running_time":"123 minutes[1]","all_that_jazz":"Theatrical release poster","music_by":"Ralph Burns","edited_by":"Alan Heim","written_by":"Robert Alan Aurthur Bob Fosse","budget":"$12 million[2]"}