{"arthur":"Theatrical release poster","based_on":"Arthur  by Steve Gordon","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Peter Baynham","story_by":"Steve Gordon","Plot":"Boozy Arthur Bach (Russell Brand) and his chauffeur, Bitterman (Luis Guzmán), dress up in Batman and Robin costumes for a formal dinner hosted by Arthur's mother, Vivienne (Geraldine James). The dinner is intended to announce Arthur as the new chairman of her corporation, Bach Worldwide. Driving to the dinner in a Batmobile, an intoxicated Arthur is chased by police, arrested and released the next day.Vivienne forms a plan to have her shrewd assistant Susan Johnson (Jennifer Garner) marry Arthur to ensure stable leadership and help Arthur's reputation. Arthur initially refuses (citing that he and Susan have nothing in common for a loveless relationship), but is told that he will be cut off from his $950 million inheritance if he does not marry Susan. He reluctantly agrees and asks Susan's father, Burt Johnson (Nick Nolte), for permission to marry. Burt agrees, after forcing Arthur against a table saw and warning him not to embarrass Susan. The next day, Arthur meets Naomi Quinn (Greta Gerwig), an illegal tour guide to whom he becomes attracted because of her free-spirited nature. He arranges his wedding while sneaking around on dates with Naomi. Arthur's nanny, Lillian Hobson (Helen Mirren) – who normally dislikes all of Arthur's choices in women – gets to know and like Naomi. Arthur learns that Naomi would like to have her children's book about the Statue of Liberty published. He attempts to find employment and other options so that he will be able to keep seeing Naomi and not need the inheritance, but to no avail. Hobson takes Arthur to an Alcoholics Anonymous meeting, where Arthur complains that it is depressing and makes him want to drink. He proclaims he is going to drink, unintentionally brags about his wealth, and turns to leave the meeting. Hobson stands up and takes the bullet, giving Arthur’s humiliating introduction in his place. Arthur, touched, states that if only she would do his drinking for him as well, he would be set.Arthur goes to see Naomi at her house and tells her the truth – that he is engaged to Susan. Naomi then tells him to leave. Back home, Arthur calls for Hobson, only for Bitterman to come and tell him that she is in bed with a headache. Later, Hobson goes to Naomi and asks her to give Arthur another chance, but she again falls ill and is taken to a hospital. Naomi calls Arthur to tell him what has happened. He comes to the hospital, meets Naomi and is about to make up with her, but Susan arrives and tells Naomi that Arthur has bought the company that is handling the publication of her book. Upset, Naomi leaves the hospital. Hobson comes home and Arthur takes care of her. The two begin to get along better. However, a few days later, Hobson dies in her sleep and Arthur reverts to alcoholism to numb the pain of her death, losing Naomi, and being married to Susan.At his wedding, Arthur gets drunk and finds Hobson's last letter to him in which she advises him to follow his heart. Arthur decides, during the vows, not to proceed with the marriage. Susan and her father become belligerent and begin punching him, which makes Vivienne realize that the ambitious and conniving Susan is only after her company. Vivienne stops the ruckus, but reminds Arthur of the agreed upon disinheritance if he pursues Naomi. Arthur strips nearly naked to emphasise that he wants no kind of dependency on his mother's money and runs to Naomi's apartment. He tells her that he just lost his mum (meaning Hobson, not Vivienne) but Naomi, still upset with him, says she can't replace Hobson and refuses any prospect of their getting back together.Six months later, Arthur is now sober. He has got back his inheritance because he is managing the company's charity, and his mother becomes proud of him to finally take something seriously (possibly indicating his love for Naomi). He goes to a bookshop to buy Naomi's book – which she has dedicated to him – and sees an advertisement for a book-reading she will be giving at a library. Arthur goes to the library and, this time, Naomi takes him back. The two leave the library and Bitterman drives them through the city in the Batmobile with the police following in pursuit.","language":"English","box_office":"$45,735,397[2]","cinematography":"Uta Briesewitz","production_company":"MBST Entertainment BenderSpink Langley Park Productions","directed_by":"Jason Winer","release_dates":"April 8, 2011 (2011-04-08)|||||","Production":"In December 2008, Warner Bros. announced they were developing a remake of the 1981 film with Russell Brand to play the title character.[4] In February 2009 it was announced that Peter Baynham, the writer of Borat, was working on a script.[5]In March 2010 it was announced that Jason Winer, best known for directing episodes of Modern Family, was chosen as director, making it his first feature film.[6] Helen Mirren, who had previously worked with Brand in The Tempest (2010), joined the cast in April.[7] Greta Gerwig was cast as Arthur's love interest in May,[8] with Nick Nolte and Jennifer Garner joining the following month.[9]Filming took place in the spring and summer of 2010 at locations in and around New York City including St. Bartholomew's Church on Park Avenue, a location used in the original 1981 version of the film. Re-shoots took place in the winter months of 2011. The Daily News Building at 220 East 42nd Street was used as the headquarters of Bach Industries. The scenes in which Arthur first meets Naomi while she is conducting a tour as well as their first date were filmed at Grand Central Terminal.[10] The scenes of Arthur working in a candy store were filmed at Dylan's Candy Bar, a New York City candy store founded by New Yorker Dylan Lauren, the daughter of Ralph Lauren.The character Arthur's excessive drinking was central to the film's plot, but Brand – a recovering drug addict and alcoholic – said this was not an issue for him during production. Brand said that before scenes he would sniff alcohol to remind him of what it was like to be drunk.[11]Russell Brand's clothing in the film was inspired by Lapo Elkann.[12]","produced_by":"Larry Brezner Kevin McCormick Chris Bender Michael Tadross","starring":"Russell Brand Helen Mirren Jennifer Garner Luis Guzmán Greta Gerwig Nick Nolte","running_time":"107 minutes","music_by":"Theodore Shapiro Mark Ronson","edited_by":"Brent White","Release":"Arthur was a box office failure. It finished third in the U.S. box office following its first week of release with an intake of $12,222,756 from 3,276 screens, opening in third place. It had its UK premiere at the O2 in London on 19 April.[13] At the end of its 28-day release, the film earned $32,854,846 in the United States and $12,700,000 in other markets, for a worldwide total of $45,735,397.[14] It was released at the same time as Hop, which also featured Russell Brand.[15]The movie received generally negative reviews. Review aggregation website Rotten Tomatoes gave the movie a score of 26% based on 181 reviews with an average score of 4.4/10, with the consensus describing it as \"An irritating, unnecessary remake that demonstrates the libertine charm Russell Brand exudes in supporting roles turn against him when he's star of the show.\"[16] It received a 36 out of 100 rating on metacritic, which gave it the description of 'generally unfavorable'.[17] The Houston Chronicle wrote a scathing review of Brand's performance, stating \"Make no mistake, people are going to hate Brand in this.\"[18] However, Thelma Adams of Us Weekly called it \"a laugh-out-loud romp – and [Russell Brand's] best screen role to date.\"[19] Cinemablend stated that \"despite all the odds against him [Russell Brand's] proved himself as a winning movie presence\".[20] Roger Ebert gave the film 3 out of 4 stars, stating that the film \"is a fairly close remake of the great 1981 Dudley Moore movie, with pleasures of its own.\"[21] Richard Roeper also enjoyed the film, giving it a \"B\", and although he thought parts of the film were difficult to understand, said, \"The new Arthur is a likable comedy with a good heart.\"[22] Brand later admitted that his choice to appear in the movie was \"a mistake.\"[23]","budget":"$40 million[1]"}