{"based_on":"The Magic Bed-Knob & Bonfires and Broomsticks  by Mary Norton","Cast":"Leslie Caron, Lynn Redgrave, Judy Carne, and Julie Andrews were all considered for the role of Eglantine Price before the Disney studio decided on Angela Lansbury.[4] David Tomlinson replaced Ron Moody as Emelius Brown due to Moody's busy schedule.","country":"United Kingdom United States","Awards and nominations":"The film received five Academy Award nominations and won one.[8]","distributed_by":"Buena Vista Distribution","language":"English","box_office":"$17.9 million[1]","cinematography":"Frank Phillips","production_company":"Walt Disney Productions","directed_by":"Robert Stevenson","release_dates":"October 7, 1971 (1971-10-07) (United Kingdom)|December 13, 1971 (1971-12-13) (United States)||||","Production":"Filming took place at the Walt Disney Studios in Burbank, California. The castle scenes were shot on location at Corfe Castle, Dorset, England.[5]The armor used for the climactic battle against the Nazis had been assembled in Spain for the movie El Cid and was later shipped to Burbank for use in the movie Camelot before being rented for this film.","Home media releases":"The film has been released for home several times on VHS and DVD. Upon rediscovering the removed song \"A Step in the Right Direction\" on the original soundtrack album, Disney decided to reconstruct the film's original running length. Most of the film material was found, but some segments of \"Portobello Road\" had to be reconstructed from work prints with digital re-coloration to match the film quality of the main content. The footage for \"A Step in the Right Direction\" was never located. As of 2009, it remains lost, and it is believed[by whom?] that the footage was possibly destroyed. A reconstruction of \"A Step in the Right Direction\", using the original music track linked up to existing production stills, was included on the DVD as an extra to convey an idea of what the lost sequence would have looked like. The edit included several newly discovered songs, including \"Nobody's Problems\", performed by Lansbury. The number had been cut before the premiere of the film. Lansbury had only made a demo recording, singing with a solo piano because the orchestrations would have been added when the picture was scored. When the song was cut, the orchestrations had not yet been added; therefore, it was finally orchestrated and put together when it was placed back into the film.The soundtrack for some of the spoken tracks was unrecoverable. Therefore, Lansbury and McDowall re-dubbed their parts, while other actors made ADR dubs for those who were unavailable. Even though David Tomlinson was still alive when the film was being reconstructed, he was in ill-health, and unavailable to provide ADR for Emelius Browne.Some of the alternate actors who re-dubbed the newly inserted scenes had questionable likenesses to that of the original voices (the postmistress, for example, had a British regional accented voice that changed from Welsh to Scottish and back again on the reconstructed scenes). Elements of the underscoring were either moved or extended when it was necessary to benefit the new material. The extended version of the film was released on VHS and DVD on March 20, 2001, to commemorate the 30th anniversary of the film. The reconstruction additionally marks the first time the film was presented in stereophonic sound. A new edition called Bedknobs and Broomsticks: Enchanted Musical Edition was released on DVD on September 8, 2009. This new single-disc edition is an identical transfer to the 30th Anniversary Edition, dropping the Scrapbook and Film Facts to make room for a Wizards of Waverly Place Special Effects featurette and a The Suite Life of Zack & Cody Blu-ray infomercial. The Sherman Brothers Featurette, the lost song \"A Step in the Right Direction\" and most of the other bonus features are retained from the previous edition.[7]The movie was released on Special Edition Blu-ray, DVD, and Digital HD on August 12, 2014, in its 117-minute General Release Version, with the deleted scenes used in the previous reconstructed version presented in a separate section on the Blu-ray disc. Many fans are disappointed that the 30th anniversary version has not been transferred onto Blu-ray as an option, (e.g. a Blu-ray set containing both the 117 -min and 140-min versions), as despite the ADR dubbing, many still prefer the longer uncut version.","running_time":"117 minutes (1971 original version) 96 minutes (1979 reissue version) 139 minutes (2001 reconstruction version)","budget":"$20 million","screenplay_by":"Bill Walsh Don DaGradi","Plot":"During The Blitz, the three Rawlins children, Charlie, Carrie, and Paul are evacuated from London to the remote village of Pepperinge Eye. They are placed in the reluctant care of Miss Eglantine Price, a reclusive woman who agrees to the arrangement temporarily. The children attempt to run back to London, but change their minds after observing Miss Price attempting to fly on a broomstick. Miss Price reveals she is learning witchcraft through a correspondence school with hopes of using her spells in the British war effort, and offers the children a transportation spell in exchange for their silence. Miss Price casts the spell on a knob that the youngest child, Paul, has removed from the bed in the children’s shared bedroom, and she adds that only Paul can work the spell.Later, Miss Price receives a letter from her school announcing its closure, thus preventing her from learning the final spell. She convinces Paul to use the enchanted bed to return the group to London and locate the headmaster of the college, Professor Emilius Browne. They discover that Browne is actually a charismatic showman who created the course from an old book he found and is surprised to learn that the spells actually work for Miss Price. He gives the book to Miss Price, but she is distraught to discover the final spell is missing. The group travels to Portobello Road to locate the rest of the book. They are approached by the spiv Swinburne. He takes them to his employer, a mysterious man known as the Bookman who possesses the remainder of the book. They exchange their pieces, but they learn only that the spell was inscribed on a medallion, the Star of Astaroth, that belonged to a sorcerer of that name. The Bookman reveals that the medallion may have been taken by a pack of wild animals, given anthropomorphism by Astaroth, to a remote island called Naboombu.The Bookman doesn't believe the island exists until Paul confirms its existence via a storybook he found at Mr. Browne's residence. The group fly on the bed and land in the island’s lagoon. They are brought before King Leonidas, the hot-tempered lion who rules the island. Leonidas is wearing the Star of Astaroth. Leonidas invites Mr. Browne to act as a referee in a soccer match. The chaotic match ends in Leonidas’ self-proclaimed victory, but Mr. Browne cleverly swaps the medallion with his referee whistle as he leaves. Upon examining the Star, Miss Price finds the missing spell, “Substitutiary Locomotion”. When he discovers the theft, Leonidas pursues the travelers, but Miss Price transforms him into a rabbit and they escape.Back home, Miss Price prepares to try out the spell, but the Star has vanished back into the fantasy world of Naboombu. Paul reveals that the spell \"Substitutiary Locomotion\" was actually in his storybook the whole time. Miss Price tries the spell on Mr. Browne’s shoes; while the spell works and imbues the shoes with life, she finds it difficult to control them. Mrs. Hobday, the local supervisor for the children’s refuge, informs Miss Price that the children can be relocated with another family, but Miss Price wants them to stay. Mr. Browne is leery of commitment, and when the children refer to him as a father figure, he returns to London.A platoon of Nazi commandos land on the coast and invade Miss Price’s house, imprisoning her and the children in the local museum. Mr. Browne comes to the rescue after observing more Nazis disabling phone lines, inspiring Miss Price to use \"Substitutiary Locomotion\" to enchant the museum’s exhibits into an army. The army of knights' armour and military uniforms chase the Nazis away, but not before they destroy Miss Price’s workshop, ending her career as a witch. Though disappointed her career is over, she is happy she played a small part in the war effort. Mr. Browne enlists in the army and departs with the local Home Guard escorting him, while Paul reveals he still has the enchanted bedknob, hinting that they can continue on with their adventures.","bedknobs_and_broomsticks":"Theatrical poster","Theatre releases":"Bedknobs and Broomsticks was originally intended to be a large-scale epic holiday release similar to Mary Poppins, but after its premiere, it was shortened from its two and a half-hour length (while the liner notes on the soundtrack reissue in 2002 claims it was closer to three hours) to a more manageable (to movie theatres) two hours. Along with a minor subplot involving Roddy McDowall's character, three songs were removed entirely, and the central dance number \"Portobello Road\" was shortened by more than six minutes.Although the musical score was recorded in stereo, and the soundtrack album was presented that way, the film was released in mono sound.By 1976 the film had earned rentals of $8.5 million in North America.[6]The movie was reissued theatrically in 1979, with a lower time of 96 minutes, with all songs, excluding \"Portobello Road\" and \"Beautiful Briny Sea\", being muted out.[dubious – discuss]","Soundtrack":"Although the film is in mono sound recording, the songs for the film were recorded in stereo. These songs include:It was also released on CD in 2002.","Cast reunion":"The three child stars of the film shared their recollections on an edition of The One Show broadcast on BBC One on 3 May 2016 and Angela Lansbury recorded a short filmed tribute to them.[9] The two boys did not go any further with their film careers; Ian Weighill who played the older boy Charlie reportedly became a train driver and Roy Snart who played the younger boy Paul is the head of a software company.[10]","produced_by":"Bill Walsh","starring":"Angela Lansbury David Tomlinson John Ericson Ian Weighill Cindy O'Callaghan Roy Snart","music_by":"Songs: Richard M. Sherman Robert B. Sherman Score: Irwin Kostal","edited_by":"Cotton Warburton","Critical reaction":"The film received mixed to positive reviews from critics. As of January 2016, the film scored 63% on Rotten Tomatoes."}