{"based_on":"Barbarella  by Jean-Claude Forest","country":"France Italy","distributed_by":"Paramount Pictures","screenplay_by":"Terry Southern|Roger Vadim|Claude Brulé|Vittorio Bonicelli|Clement Biddle Wood|Brian Degas|Tudor Gates|Jean-Claude Forest|","Legacy":"The Los Angeles Times wrote that although the film may seem \"quaint\" to modern audiences, its \"imagery has echoed for years in pop culture\".[28] The New York Times called Barbarella \"the most iconic sex goddess of the 60's.\"[18] The film popularized the comic book character, influenced the design of other comic book heroines, and helped to launch Fonda's career. The fashions influenced Jean-Paul Gaultier's designs in The Fifth Element.[29] The rock band Duran Duran named themselves after Dr. Durand Durand.[30] Kylie Minogue referenced the film's opening scene in the video for her 1994 song \"Put Yourself in My Place\", Prince has cited the film as an inspiration for \"Endorphin Machine\",[25] and Big John Bates has stated the lyrics for \"Take It Off\"[31] are based on the Barbarella character.Despite an initially negative reception, in the years since its initial release, Barbarella has become a cult film.[25][32]Plans for a sequel were announced in 1968, with Robert Evans, head of Paramount, saying the title would be Barbarella Goes Down.[33]Plans for a sequel with Fonda fell through in the mid to late 1970s.Terry Southern says he was contacted by Dino De Laurentiis in 1990 to write a sequel \"on the cheap... but with plenty of action and plenty of sex\" which could possibly star Fonda's daughter.[13] The sequel was never written.Roger Vadim said that he would be open to making a sequel with actresses Sherilyn Fenn or Drew Barrymore in the title role, but nothing came of it.[34]There were also discussions of a possible remake.The most serious planning of this began in early 2008. This remake would have been produced and released by Universal Studios, with one-time James Bond screenwriters Neal Purvis and Robert Wade penning the script, and Dino and Martha De Laurentiis heading as producers.[35]Sin City director Robert Rodriguez was soon after announced as the slated director for the remake.[36] Early candidates for the role of Barbarella were actresses Erica Durance of the WB's Smallville, Sienna Miller, and Rodriguez's Grindhouse star Rose McGowan. Later news articles confirmed that McGowan had been cast as the title role.[37] Universal Studios eventually backed out of the movie with some news sources speculating that it was due to studio executives doubting McGowan's ability to carry a big budget movie and that the studio had slashed the budget after learning of McGowan winning the role. Rodriguez denied this, stating, \"Universal had initially signed on for $60 million, but then when we were done with the script it wound up at closer to $82 million.\"[38][unreliable source]Due to Universal insisting on lowering the cost of the film and on recasting the role of Barbarella, Rodriguez shopped the remake to other studios in the hopes of gaining a larger budget allowance and retaining McGowan as Barbarella. Rodriguez has stated that the large budget needs stem from the fact that the majority of the movie takes place in outer space, and that \"we don’t want the movie to look like the original.\"[39] Rodriguez said he abandoned the project in May 2009 after he turned down a $70 million budget that required shooting in Germany. Expressing regret for the undone film, he thought he could not be away from his five children for as long as it would take if shot in Germany.[40]Although later news articles would attach director Robert Luketic to the project,[41] the film had not met its projected release date of summer 2010 and there are no active plans to produce the film.In January 2014, Gaumont International Television announced a TV show based on the film for Amazon Studios. The pilot will be written by Neal Purvis and Robert Wade, and produced by Valhalla Rising director Nicolas Winding Refn, who had been attached to direct.[42]","Plot":"In an unspecified future, Barbarella is assigned by the President of Earth to retrieve Doctor Durand Durand from the Tau Ceti region. Durand Durand is the inventor of the Positronic Ray, a weapon that Earth leaders fear will fall into the wrong hands. Barbarella crashes on the 16th planet of Tau Ceti and is soon knocked unconscious by two mysterious girls, who take Barbarella to the wreckage of a spaceship. Inside the wreckage, she is tied up and several children emerge from within the ship. They set out several dolls which have razor-sharp teeth. As the dolls begin to bite her, Barbarella faints but is rescued by Mark Hand, the Catchman, who patrols the ice looking for errant children. While Hand takes her back to her ship, Barbarella offers to reward Mark and he suggests sex. She says that people on Earth no longer have penetrative intercourse but consume exaltation-transference pills and press their palms together when their \"psychocardiograms are in perfect harmony\". Hand prefers the bed, and Barbarella agrees. Hand's vessel makes long loops around Barbarella's crashed vessel while the two have sex, and when it finally comes to a stop, Barbarella is blissfully humming. After Hand repairs her ship, Barbarella departs and promises to return, agreeing that doing things the old-fashioned way is occasionally best.Barbarella's ship burrows through the planet and comes out next to a vast labyrinth. Upon emerging from her ship, she is knocked unconscious by a rockslide. She is found by a blind angel named Pygar, who states he is the last of the ornithanthropes and has lost the will to fly. Barbarella discovers the labyrinth is a prison for people cast out of Sogo, the City of Night. Pygar introduces her to Professor Ping, who offers to repair her ship. Ping also notes that Pygar is capable of flight but merely lacks the will. After Pygar rescues her from the Black Guards, Barbarella has sex with him, and he regains his will to fly. Pygar flies Barbarella to Sogo and uses the weaponry she brought with her to destroy the city's guards. Sogo is a decadent city ruled over by the Great Tyrant and powered by a liquid essence of evil called the Mathmos. Barbarella is briefly separated from Pygar, and meets a one-eyed wench who saves her from being assaulted by two of Sogo's residents. Barbarella soon reunites with Pygar and the two are taken by the Concierge to meet the Great Tyrant, who was really the one-eyed wench in disguise. Pygar is left to become the Great Tyrant's plaything while Barbarella is placed in a cage to be pecked to death by birds.Barbarella is rescued by Dildano, leader of the resistance. Barbarella eagerly offers to reward him, but he says he wants to experience sex the Earthling way. Dildano offers to help Barbarella find Durand Durand in exchange for her help in deposing the Great Tyrant. Dildano gives Barbarella an invisible key to the Great Tyrant's Chamber of Dreams.Soon Barbarella is captured by the Concierge and placed inside the Excessive Machine (called the Orgasmostron in the french version), which the Concierge says will cause her to die of pleasure. Barbarella writhes in ecstasy, and the machine overloads, unable to keep up with her. Barbarella then discovers the Concierge is none other than Durand Durand, aged thirty years due to the Mathmos.Barbarella enters the Chamber of Dreams and Durand Durand grabs the Queen's key and traps Barbarella and the Great Tyrant in the Chamber.Durand Durand prepares to crown himself lord of Sogo, but Dildano launches his revolution. Durand Durand uses his Positronic Ray to decimate the rebels. The Great Tyrant then releases the Mathmos, which consumes all of Sogo and Durand Durand with it. Barbarella and the Great Tyrant are protected from the Mathmos by Barbarella's innate goodness. They emerge from the Mathmos to find Pygar. Pygar flies Barbarella and the Tyrant away from the Mathmos. When asked by Barbarella why he saved the Tyrant after everything she had done to him, Pygar responds, \"An angel has no memory.\"","language":"French English","Reception":"The film was both a box office and critical failure in the US on its release.[25] Variety's review stated that \"Despite a certain amount of production dash and polish and a few silly-funny lines of dialogue, Barbarella isn't very much of a film. Based on what has been called an adult comic strip, the Dino De Laurentiis production is flawed with a cast that is not particularly adept at comedy, a flat script, and direction which can't get this beached whale afloat.\"[26] Rotten Tomatoes, a review aggregator, reports that 73% of 44 surveyed critics gave the film a positive review; the average rating is 6.3/10. The site's consensus reads: \"Unevenly paced and thoroughly cheesy, Barbarella is nonetheless full of humor, entertaining visuals, and Jane Fonda's sex appeal.\"[27]","barbarella":"French theatrical poster","box_office":"$5.5 million (North American rentals)[5] 878,015 admissions (France)[6]","cinematography":"Claude Renoir","production_company":"Marianne Productions Dino de Laurentiis Cinematografica","directed_by":"Roger Vadim","release_dates":"10 October 1968 (1968-10-10)[2]|||||","Production":"Producer Dino De Laurentiis invited Fonda to the project after Sophia Loren and Brigitte Bardot turned down the starring role. Though Fonda also declined, Vadim convinced her to change her mind.Vadim was a fan of American comic strips such as Popeye and Peanuts. \"I like the wild humour and impossible exaggeration of the comic strips,\" said Vadim. \"I want to do something in that myself in my next film.\"[8]\"It is absolutely camp, sophisticated camp, the wildest of them all,\" said Fonda.[9]\"In science fiction, technology is everything,\" said Vadim. \"The characters are so boring—they have no psychology. I want to do this film as though I had arrived on a strange planet with my camera directly on my shoulder—as though I was a reporter doing a newsreel.\"[10]\"What interests me is the chance to escape totally from the morals of the 20th century and depict a new, futuristic morality,\" added Vadim. \"It's a very romantic story, really. Barbarella has no sense of guilt about her body. I want to make something beautiful out of eroticism.\"[11]\"Vadim loves science fiction and he's gotten me interested,\" said Fonda. \"In a way, cinema is the natural medium for it, but up to now the technical gimmicks have been treated as the raison d'etre of the science fiction film. As an actress, I'm more concerned about the story, and the character.\"[11]Vadim later elaborated:I can tell you all the things she won't be. She won't be a science fiction character, nor will she play Barbarella tongue in cheek. She is just a lovely, average girl with a terrific space record and a lovely body. I am not going to intellectualise her. Although there is going to be a bit of satire about our morals and our ethics, the picture is going to be more of a spectacle than a cerebral exercise for a few way out intellectuals. She is going to be an uninhibited girl, not being weighed down by thousands and thousands of years of Puritan education.[12]Fonda explained how she saw the character:The main thing about this role is to keep her innocent. You see, Barbarella is not a vamp and her sexuality is not measured by the rules of our society. She is not being promiscuous, but she follows the natural reaction of another type of upbringing. She is not a so-called 'sexually liberated woman' either. That would mean rebellion against something. She is different. She was born free.[12]Her father, Henry Fonda, was the original choice for the President of Earth.A large number of writers worked on the script, including Terry Southern. Southern later claimed \"Vadim wasn't particularly interested in the script, but he was a lot of fun, with a discerning eye for the erotic, grotesque, and the absurd. And Jane Fonda was super in all regards.\"[13]Charles B. Griffith worked on the script uncredited; he said \"they hired fourteen other writers\" after Terry Southern \"before they got to me. I didn't get credit because I was the last one.\"[14] He says he became involved because he was a friend of John Phillip Law's:I guess I rewrote about a quarter of the film that was shot, then reshot, and I added the concept that there had been thousands of years since violence existed, so that Barbarella was very clumsy all through the picture. She shoots herself in the foot and everything. It was pretty ludicrous. The stuff with Claude Dauphin and the suicide room were also part of my contribution to the film.[14]Production began in Rome on 15 April 1967.[15][16]Fashion designer Paco Rabanne was responsible for Fonda's costumes.[17] Rabanne was influenced by the women's liberation movement and designed outfits in the style of metal armor, drawing influences from an Indian philosophy that posited an age of iron.[18]Marcel Marceau had his first speaking role in the film, as Professor Ping. Marceau:Prof Ping has a little bit of Bip and some Harpo Marx, some Einstein, some Chagall the French painter and some Marceau. The voice part is the most interesting. I don't forget the lines, but I have trouble organising them. It's a different way of making what's inside come out. It goes from the brain to the vocal chords, and not directly to the body.[19]Vadim said during filming that \"Paramount has left me completely free, and so has De Laurentiis, who is known as a tyrant.\"[10]Filming was postponed when Fonda fell ill with a fever and had to be subjected to some tests.[20]","produced_by":"Dino De Laurentiis","starring":"Jane Fonda|Ugo Tognazzi|Anita Pallenberg|Milo O'Shea|Marcel Marceau|Claude Dauphin|David Hemmings|John Phillip Law|","running_time":"98 minutes","music_by":"Maurice Jarre[1]","edited_by":"Victoria Mercanton","Release":"Barbarella was released 10 October 1968,[2] and it earned $2.5 million in North American theatre rentals in 1968.[21] The film was the second most popular film in general release in the UK in 1968.[22]In 1977, the film was re-released in theaters as Barbarella: Queen of the Galaxy in an edited version that removed some nudity.[23] This edited version was released for the home video market on VHS, Betamax, CED disc, and Laserdisc. Later video release versions on VHS, Laserdisc (Widescreen version), DVD, and Blu-ray disc use the 1977 artwork, the Queen of the Galaxy name, and the PG rating on the packaging, but the film in those releases is the original 1968 version.[citation needed]The Blu-ray was released in July 2012 and features the 1968 theatrical trailer as the disc's only bonus feature.[24]","budget":"$9 million[3] or $4 million[4]"}