{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Cheech Marin","Plot":"Rudy Robles (Marin) is told by his mother to pick up his cousin Javier (Paul Rodriguez) at a factory before she leaves for Fresno. Robles arrives shortly before immigration officials raid the factory looking for undocumented workers. Because he is carrying no identification, and his mother and sister are not available to verify he is a US citizen, Robles is deported with the undocumented workers to Mexico.Ironically, Robles cannot speak more than very simple Spanglish, though he is fluent in German from having served in Germany in the United States Army.In Tijuana, Robles becomes friends with a guy named Jimmy (Daniel Stern) and a waitress named Dolores (Kamala Lopez-Dawson). Unable to contact his mother, Robles makes repeated attempts to cross the border, all ending in failure.Jimmy offers to get him back home for a price. Having left home without his wallet, Robles works for Jimmy as doorman at a strip club, earning extra money selling oranges and teaching five would be undocumented immigrants, two Central Americans and three Asians, to walk and talk like East Los Angeles natives. They become called the \"Waas Sappening Boys\" or \"What's Happening Boys\".Robles falls in love with Dolores and finally raises the money needed to be smuggled across the border. He goes on a date with Dolores and the next day, Robles bids farewell to Jimmy, receives a last kiss goodbye from Dolores and climbs into the coyote's truck. He sees a woman pleading to also be taken as her husband is already in the truck and their family is in the United States, but she lacks the money to pay for her to be smuggled. Robles gives the woman his place.Robles stands for the last time on the hill of the Mexico – United States border while two Immigration Officers sit in their truck watching in laughter. The song \"America\" by Neil Diamond is heard as Robles raises his arms and hundreds of people appear and race forward to reach the American Dream. The Immigration Officers hide in their truck. Rudy, Dolores, and their \"Waas Up\" friends walk with their heads up high into the United States.Rudy and Dolores are kidnapped by coyotes and held for ransom, coincidentally, across the street from Rudy's home. He calls his cousin Javier from across the street to bring him his wallet, which he does to pay off the kidnappers. Then la migra storms in, headed by the man in the sunglasses and cowboy hat who had deported Rudy in the beginning.Rudy shows his identification this time to the immigration officer, who says he's going to send Dolores back to El Salvador. Rudy and Dolores make a dash and escape during the East Los Angeles Cinco de Mayo parade. Not knowing where to turn, Rudy and Dolores hop onto the float with a priest; Rudy asks if he can marry them. Rudy and Dolores both look at each other in happiness as they are wed.The immigration officer arrives to place Dolores under arrest. Rudy then explains that they've just been married, making Dolores a legal resident. The crowd, witnessing everything, cheers.At the end, as the credits roll, the song version of \"Born in East L.A.\" plays.","born_in_east_l.a.":"Theatrical release poster","language":"English","Reception":"The movie debuted well in its first week but dropped by 40% in its second week at the box office.[2]The film was popular, but was panned by the critics. Film critic Richard Harrington of The Washington Post wrote:The filming is often flat, as is much of the acting. In fact, the short musical video of \"Born in East L.A.\" is far superior to the film.[3]Caryn James, film critic for The New York Times, wrote:Born in East L.A. is enormously good-natured—exactly the wrong tone for a comedy that needs all the rambunctious lunacy it can get. Instead, this story of an American mistakenly deported to Mexico as an illegal alien is amiable and plodding, the very last things you'd expect from Cheech, with or without Chong.[4]Wins","box_office":"$17,355,263 (US)[1]","cinematography":"Alex Phillips Jr.","production_company":"Clear Type","directed_by":"Cheech Marin","Home Media":"The movie was released in VHS and DVD format.[5]The re-release of the movie on VHS and later on DVD is missing the entire hostage sequence. We see Rudy, Dolores and friends walking down the hill and next we see them coming out of a manhole to the Cinco De Mayo parade and getting married.","release_dates":"August 21, 1987 (1987-08-21) (United States)|||||","produced_by":"Peter MacGregor Scott","starring":"Cheech Marin|Daniel Stern|Paul Rodriguez|Jan Michael Vincent|Kamala Lopez|Tony Plana|","running_time":"85 minutes","music_by":"Lee Holdridge","edited_by":"Don Brochu Stephen Lovejoy David Newhouse Mike Sheridan"}