{"country":"India","ek_tha_tiger":"Theatrical release poster","story_by":"Aditya Chopra","language":"Hindi","box_office":"₹3.20 billion (equivalent to ₹4.2 billion or US$63 million in 2016)[3]","cinematography":"Aseem Mishra","production_company":"Yash Raj Films","Marketing":"The first-look poster was released in August 2011,[31] and the first teaser was released on 10 May 2012 along with the film Ishaqzaade.[32][33] The theatrical trailer received more than 1 million views within 2 days of its release, making it the most-viewed trailer for a Bollywood film.[34] Promotional tours visited New Delhi, Ahmedabad,[35] and Lucknow.[36] The makers secured a marketing deal with soft drink company Thumbs up and engaged in a consumer promotion in New Delhi, Mumbai, Hyderabad, Ahmedabad, Lucknow, Kanpur, Allahabad, Agra, Meerut and Ghaziabad.[37]As part of the promotion, a series of comic books based on the film, and also using characters from the film Hum Tum, were launched in July 2012 and continued until the Diwali festival.[38] The first book was titled 'Ek Tha Tiger – Mahasagar Ki Suraksha'. Post release, the comics failed to generate a positive word-of-mouth. Joginder Tuteja of Bollywood Hungama commended the comics' design but said that the main story failed to meet his expectations of a deeper plot, exciting narrative and a tighter script.[39]","directed_by":"Kabir Khan","Home media":"Ek Tha Tiger was released on DVD in all regions on 25 September 2012,[85] and on Blu-ray Disc – which features Dolby TrueHD 96k upsampling and Dolby Surround 7.1 with English and Arabic subtitles – on 9 October 2012.[86][87] The film's director Kabir Khan said, \"Ek Tha Tiger is the first movie to be mastered with Dolby's advanced 96k upsampling technology on a Blu-ray disc\".[88]","narrated_by":"Ranvir Shorey","release_dates":"15 August 2012 (2012-08-15)|||||","Production":"Initially, Kabir Khan was announced to be the director,[9] but after finalising the story, Kabir approached Shah Rukh Khan with the script. Although initially liking the script, Khan didn't agree to the movie due to date issues.[10] The film's script had been completed by November 2010,[11] and underwent changes in February 2012.[12] In May 2011, reports said that Salman Khan and Katrina Kaif would work together on a film titled Ek Tha Tiger.[9] It was Khan's first venture with Yash Raj Films and his fourth opposite Kaif.[9] Before starting the film, Khan postponed a project titled Sher Khan by his brother Sohail Khan.[13] His fee for the venture was ₹320 million (US$4.8 million).[14] The film was also one of Katrina's first in the action genre.[15] Ranvir Shorey was signed for a supporting role.[16] On 3 May, a photograph shoot was held with the lead actors.[11] Later, Punjabi actor Gavie Chahal signed to play a character named Abrar in Ek Tha Tiger; his Bollywood debut.[17]Initial reports said that principal photography would start by 5 July 2011, but Yash Raj Films' spokesperson Rafiq Gangjee said that the film had been delayed because of production requirements.The first scheduled shooting began on 10 August in Dublin.[18] After a postponement when Khan went to the US for surgery for Trigeminal neuralgia, shooting resumed on 10 September 2011.[19] Filming took place at Dublin's Trinity College. Stunt directors of The Bourne Identity were hired for the action sequences.[20] Some action sequences were also shot in the city.[21] During filming in Dublin, the Irish film crew held a demonstration about filming conditions and payment, which halted the shooting temporarily .[22] The second round on filming took place in Istanbul and lasted two months.[23] In February 2012, the film's cast and crew went to Havana to shoot for a month.[24] There, Khan shot a cameo scene for a local tourism company. The sets used in the film were featured in the advertisement.[25] Problems with the script caused the postponement of the film's planned shoot in Hong Kong.[26] Afterwards, a three-day filming schedule was completed in Delhi.[27] Filming ended in June 2012 after the last schedule was shot in Bangkok.[28] Khan had to undergo a fitness program titled 'Dirty Running' over 30 days for his action sequences.[29] Kaif played her role without makeup.[30]","running_time":"133 minutes[1]","Release":"Ek Tha Tiger was released worldwide on 15 August 2012 – Indian Independence day. It was screened in 3300 screens nationally, which at that time was the most ever for a Bollywood film until Dabangg 2 was released in 3700 screens.[40] Ek Tha Tiger was released in 550 screens overseas.[41] Around 60 percent of the first weekend's sales had been booked in advance before the release.[42] Some multiplexes increased their ticket prices for the film.[43] Ek Tha Tiger was not released in Pakistan – a major market for Bollywood films – because the Pakistani censors decided that it shows the country in negative light.[44] Director Kabir Khan had earlier said that it was not an anti-Pakistan film.[45] After its worldwide success, the film was released in Japan on 7 March 2013 by Japan's Nikkatsu Corporation, with a grand premiere in Tokyo. 30 prints were released in Japan, which will increase to 70, making it the widest Japanese release for a Hindi film.[46][47]","budget":"₹750 million (equivalent to ₹990 million or US$15 million in 2016)[2]","screenplay_by":"Kabir Khan Neelesh Misra","Plot":"An agent code-named \"Tiger\" (Salman Khan) – India's top spy and an officer of the Research and Analysis Wing (RAW) – is conducting a mission in northern Iraq. Tiger is forced to kill one of his own men who has defected to Pakistan's spy agency Inter-Services Intelligence (ISI). He subsequently kills many ISI agents in his escape from Iraq. Tiger returns to India and reports to his boss, Shenoy (Girish Karnad), in New Delhi. He is immediately sent on a mission to Dublin to observe a scientist of Indian origin, Professor Anwar Jamaal Kidwai (Roshan Seth), who teaches at Trinity College and is suspected of sharing his findings with the Pakistan defence establishment. Fellow RAW agent Gopi (Ranvir Shorey) accompanies Tiger on this mission. Tiger meets the scientist but fails to spend enough time for his observance and instead begins to spend time with the scientist's caretaker Zoya (Katrina Kaif), who is studying at a local dance academy. He tries to befriend Zoya to extract information, but begins to discover his human side as he grows closer to her. Tiger is attacked and robbed at his residence by a person suspected to be an ISI agent. Gopi repeatedly warns Tiger not to fall in love with Zoya, but his love cannot be stopped. Tiger asks Zoya for a date and there they both came to know about their feelings for each other. Before telling her his feelings, during a visit to dance academy, Tiger discovers that Zoya is an ISI agent and refuses to commit treason on Pakistan when he asks. Instead of killing Zoya, Tiger lets her go.Some time later, Tiger and Zoya meet again at a UN Foreign Minister's Meeting in Istanbul when Zoya signals to him using a cryptic message. They decide to leave everything for their love and fool their respective agencies by taking a flight to Cuba, having told their agencies that they are in Kazakhstan. Some years later, their agencies trace Zoya and Tiger due to a CCTV recording. They track them down in Havana, Cuba, and the ISI agents catch Zoya. Tiger meets Gopi, who is searching for him for RAW, and having lied to Gopi that both Tiger and Zoya intend to return to India and cooperate with RAW, convinces Gopi to save Zoya from the ISI agents. Instead of returning to India, the pair trick Gopi and escape aboarding an aeroplane. Tiger calls Shenoy, who tells him that RAW will find both spies. Tiger tells Shenoy that they will only return when Pakistan and India no longer need ISI and RAW. In the epilogue, several images of Tiger and Zoya in cities including Venice, Cape Town, Zurich and London are shown, where sightings of them have been reported. But neither agencies could catch them.","Critical reception":"Ek Tha Tiger received mixed reviews from Indian critics.Rajeev Masand of CNN-IBN gave the film 2.5 stars out of 5, and wrote, \"[d]espite its obvious flaws, 'Ek Tha Tiger' is extremely far from unwatchable. At best, it's a good, satisfying watch. Just don't go in with very high expectations.\"[48] Jahanavi Samant of Mid Day gave the film 3 stars out of 5 and said, \"Ek Tha Tiger is unable to decide whether it is a spy action film or a love saga.\"[49]Outside India, the film received a positive to mixed reception. Ronnie Scheib of Variety wrote, \"Kaif displays some impressive moves in her action-heroine debut, while Salman Khan's thinking-on-his-feet immediacy adds depth to his usual macho muscle. Local [audiences] will no doubt derive a special thrill from the onscreen reunion of stars Khan and Kaif, once an offscreen item. Slickly produced 'Tiger' profits greatly from Aseem Mishra's gorgeous location lensing.\"[50] Tuhin of Gulf News said, \"The camerawork is outright bad, with the body doubles' faces very visible during the action scenes. Kaif, who has tried her hand at the stunts, is, however, fairly convincing. Though the pace could have been faster, it is a delight to watch Khan and Kaif together, resulting in a great Eid offering for [Salman Khan] fans\".[51] The New York Times gave a mixed review, praising the action scenes but criticising the characters' romance, saying, \"Tiger and Zoya both make good kung fu street fighters, but as spies they're unconvincing, and as lovers they're cookie-cutter bland. Their loyalty to each other is never really in question and only tepidly tested, so the theme of my enemy, myself, remains unexplored.\"[52] According to French journalist Marjolaine Gout, the movie is \"a roaring fairy tale where the damsel in distress fights back with fists and thighs\" and called it a \"visual and comic feast\". She gave it 3.5 stars out of 5.[53]","Soundtrack":"All songs except one, are composed by Sohail Sen. The film score was composed by Julius Packiam. Initially, Pritam was signed to compose the songs for Ek Tha Tiger and the film's first digital poster credited him as such.[71] However, he opted out of the film because of date clashes with another Yash Raj project, Dhoom 3.[72] Neelesh Misra wrote the lyrics.[73] A song titled Jaaniyan, which had vocals by Pakistani singer Bilawal Baloch, was reported to have been leaked from the film's soundtrack. Yash Raj Films officials denied the news, and said that the album was in no danger of being leaked.[74] \"Mashallah\", sung by Wajid Ali and Shreya Ghoshal, was released as a single on 12 July 2012.[75]The soundtrack album of Ek Tha Tiger received unanimously positive reviews. Satyajit of Glamsham gave the album 4/5, saying, \"Ek Tha Tiger roars with multi-cultured international musical feel, a musician delight that primarily targets classy listeners. Unlike massy tracks of Dabangg, Wanted, Ready or Bodyguard, it has more classy appeal attached to it and all credits goes to composer's skillfulness in catching every aura, genre and format.\"[76] Indo-Asian News Service posting on CNN-IBN gave the album 4/5 and said that it \"offers the listener the romantic and action flavour of the movie. This one's definitely an entertaining affair with an array of sounds for music lovers.\"[77] Purva Desai of The Times of India also gave the album 4/5 and said that it was \"[a] good effort by Sohail Sen and Sajid-Wajid because the album is fresh and sounds new, where the music composers have made an attempt to incorporate world sounds. The music is so different from Kabir Khan's earlier films like Kabul Express and New York which makes the music of Ek Tha Tiger a welcome surprise!\"[78] Devesh Sharma of Filmfare gave the soundtrack 4/5, stating that \"[w]e are used to pulsating music in Salman Khan starrers, so this album is a tad disappointing in that sense.\" and also that \"The songs have a situational feel and let's hope they look better on screen than they sound.\"[79] Joginder Tuteja of Bollywood Hungama gave the album 3.5/5 and wrote, \"[t]he music of Ek Tha Tiger is good though one expected it to have gone all the way further up.\" and that \"In case of Ek Tha Tiger, there isn't any composition that puts you off. In fact what is noticeable is the fact that the overall sound of the album remains more or less consistent.\"[80]","Box office":"It became the highest grossing Bollywood film of 2012 and the third highest of all time.[54]Ek Tha Tiger opened with 100% occupancy at multiplexes and single-screen cinemas and it broke records with capacity audiences, the widest release ever. It collected around ₹335 million (US$5.0 million), on its first day of release; a 40% increase on the previous record, which was ₹210 million (US$3.1 million) nett approx set by Agneepath (2011).[55][56][57] On its second day in the single screens across India it collected around ₹145 million (US$2.2 million).[58] and on its third day it collected around ₹121 million (US$1.8 million), taking its total collections in its first three days to ₹579 million (US$8.6 million), a new record for the weekend.[59] The film's collections grew on Saturday and Sunday, and it collected ₹941 million (US$14 million) in its extended five-day weekend.[60] Ek Tha Tiger collected ₹1,433 million (US$21 million) in its extended first week of nine days, and ₹295 million (US$4.4 million) nett in its second week to make a 16-day total of ₹1.79 billion (US$27 million).[61][62] During its third week, the film collected ₹95.0 million (US$1.4 million), ₹30 million (US$450,000) in its fourth week and ₹09.5 million (US$140,000) in fifth to make a total of ₹1.99 billion (US$30 million) in eight weeks.[63] Its final distributor share of ₹1.06 billion (US$16 million) is the highest ever in Bollywood as of 29 November 2012.[64][65]Ek Tha Tiger had strong collections in overseas markets despite not being released in Pakistan. The movie collected around ₹363 million (US$5.4 million) in five days.[66] It has collected around US$10.50 million near the end of its run overseas.[67][68][69] Ek Tha Tiger is one of the highest-grossing Bollywood films in overseas markets.After its release, Ek Tha Tiger broke several records. After its box office opening it collected ₹32 crore (US$4.8 million) in the first day and became the highest opening collection in the history of Indian cinema and the biggest single-day collection ever.[57] The film also broke the record for opening weekend net gross (first 3 days of release), opening week net gross (first 5 days of release) and entered the '100 Crore Club; the fastest in 5 days of release, breaking Salman Khan's own record set by Bodyguard in 7 Days.[70] After collecting ₹3.35 billion (US$50 million) worldwide, the film became the third highest-grossing Bollywood film of all time and the second Bollywood film to gross over ₹3 billion (US$45 million) worldwide, exceeded only by 3 Idiots and Dhoom 3.[3]","produced_by":"Aditya Chopra","starring":"Salman Khan Katrina Kaif Ranvir Shorey Girish Karnad","music_by":"Original songs : Sohail Sen Guest Composers : Sajid-Wajid Background Score : Julius Packiam","edited_by":"Rameshwar S. Bhagat"}