{"country":"United States","distributed_by":"20th Century Fox","broadcast_news":"Theatrical release poster","Plot":"The film revolves around three characters who work in television news. Jane Craig (Hunter) is a talented, neurotic producer whose life revolves around her work. Jane's best friend and frequent collaborator, Aaron Altman (Brooks), is a gifted writer and reporter ambitious for on-camera exposure who is secretly in love with Jane. Tom Grunick (Hurt), a local news anchorman who until recently was a sports anchorman, is likeable and telegenic, but lacks news experience and knows that he was only hired for his good looks and charm. He is attracted to Jane, although he is also intimidated by her skills and intensity.All three work out of the Washington, D.C., office of a national television network. Craig is drawn to Grunick, but resents his lack of qualifications for his new position as news anchor. Altman also is appalled by Grunick's lack of experience and knowledge, but accepts his advice when finally getting an opportunity to anchor a newscast himself. Unfortunately, he lacks Grunick's poise and composure in that seat, his debut as anchor a resounding failure.Altman acknowledges to Craig that he is in love with her while trying to dissuade her from pursuing a romantic relationship with Grunick. As a massive layoff hits the network, resulting in many colleagues losing their jobs, Altman tenders his resignation while tipping off Craig to a breach of ethics on Grunick's part. She decides she cannot in good conscience get personally involved with Grunick and she no longer has either man in her personal or professional life, at least until the three of them reunite several years later.","language":"English","Reception":"Broadcast News was given a limited release on December 16, 1987 in seven theaters, and managed to gross USD $197,542 on its opening weekend.[3] It went into wide release on December 25, 1987 in 677 theaters, grossing $5.5 million on its opening weekend. The film went on to make $51.3 million in North America and $16.1 million in the rest of the world for a worldwide total of $67.3 million.[4]Film critic Roger Ebert gave the film four out of four stars and praised the film for being as \"knowledgeable about the TV news-gathering process as any movie ever made, but it also has insights into the more personal matter of how people use high-pressure jobs as a way of avoiding time alone with themselves\".[5] In his review for The New York Times, Vincent Canby wrote, \"As the fast-talking Aaron, Albert Brooks comes very close to stealing Broadcast News. Mr. Brooks ... is more or less the conscience of Broadcast News\".[6] Jonathan Rosenbaum, in his review for the Chicago Reader, praised Holly Hunter's performance as \"something of a revelation: her short, feisty, socially gauche, aggressive-compulsive character may be the most intricately layered portrait of a career woman that contemporary Hollywood has given us\".[7]Hal Hinson, in his review for The Washington Post, wrote, \"[James] Brooks is excellent at taking us inside the world of television, but not terribly good at analyzing it. He has a facile, too-pat approach to dealing with issues; there's still too much of the sitcom mentality at work\".[8] In his review for Time, Richard Corliss praised William Hurt's performance: \"Hurt is neat too, never standing safely outside his character, always allowing Tom to find the humor in his too-rapid success, locating a dimness behind his eyes when Tom is asked a tough question -- and for Tom, poor soulless sensation-to-be, all questions are tough ones\".[9] The magazine also ranked Broadcast News as one of the best films of the year.[10] The film garnered a 98% rating at Rotten Tomatoes[11] and an 84 metascore at Metacritic.[12]The film was nominated for seven Academy Awards at the 60th Academy Awards including Best Picture, Best Actor (William Hurt), Best Actress (Holly Hunter), Best Supporting Actor (Albert Brooks), Best Original Screenplay (James L. Brooks), Best Film Editing (Richard Marks) and Best Cinematography (Michael Ballhaus).American Film Institute38th Berlin International Film Festival","box_office":"$67,331,309","cinematography":"Michael Ballhaus","production_company":"Gracie Films","directed_by":"James L. Brooks","Home media":"A digitally restored version of the film was released on DVD and Blu-ray by The Criterion Collection. The release includes new audio commentary featuring Brooks and Marks, James L. Brooks—A Singular Voice, a new documentary on Brooks’s career in television and film, featuring actresses Marilu Henner and Julie Kavner, among other collaborators, an alternative ending and deleted scenes, with commentary by Brooks, new video interviews with veteran CBS news producer Susan Zirinsky, one of the models for Holly Hunter’s character and an associate producer on the film, and a featurette containing on-set footage and interviews with Brooks, Hunter, and actor Albert Brooks. There is also a booklet featuring an essay by film critic Carrie Rickey.[14]","release_dates":"December 16, 1987 (1987-12-16)|||||","Production":"The score was by Bill Conti. Emmy Award-winning composers Glen Roven and Marc Shaiman make cameo appearances as a dorky musician team who have composed a theme for the news program in the film.The female lead was originally written for Debra Winger, who worked with James L. Brooks in Terms of Endearment. However, Winger was replaced by Holly Hunter at the last minute because of her pregnancy.[2]","produced_by":"James L. Brooks","starring":"William Hurt|Albert Brooks|Holly Hunter|","running_time":"133 minutes","music_by":"Bill Conti","edited_by":"Richard Marks","written_by":"James L. Brooks","budget":"$15 million[1]"}