{"country":"United Kingdom","distributed_by":"BFI Trimark Pictures Channel Four Films","beautiful_people":"Theatrical release poster","Plot":"In London, during October 1993, England are playing the Netherlands in the World Cup qualifiers. The Bosnian War is at its height, and refugees from former Yugoslavia are arriving. Football rivals and political adversaries from the Balkans all precipitate conflict and amusing situations. Meanwhile, the lives of four English families are affected in different ways by an encounter with the refugees; one of the families improbably becomes involved with a Balkan refugee through the England vs Netherlands match.","language":"English","Reception":"The film was selected as an Un Certain Regard entry at the 1999 Cannes Film Festival.[3]Roger Ebert gave the film (three stars out of four), and made several comparisons: Beautiful People \"loops and doubles back among several stories and characters, like Robert Altman's Short Cuts and Paul Thomas Anderson's Magnolia\"; \"it is fairly lighthearted, under the circumstances; like Catch-22, it enjoys the paradoxes that occur when you try to apply logic to war.\"[4] James Berardinelli gave it the same rating and made most of the same comparisons; according to Berardinelli, \"Dizdar has accomplished what few filmmakers are capable of—taking a serious subject and crafting an effective comedy from it that is defined by rich characters, genuine laughs, and an unpredictable plot.\" He concluded:[1]\"After appearing as an 'Un Certain Regard entry in the 1999 Cannes Film Festival, Beautiful People received international acclaim through film festival screenings and during its regular U.K. release (the screenplay was nominated for a British Independent Film Award). However, the most impressive thing about this film is not the recognition it has received, but the accessibility of the humor. While Beautiful People is best described as a black comedy,... it is funny, not merely grimly amusing. This makes Beautiful People one of the most intriguing and thought-provoking comedies to reach U.S. theaters in early 2000.\"Unlike those made by Ebert and Berardinelli, the comparisons made by the Boston Phoenix are more precise: the film \"combines British social realism with the bitter, jagged humor of Balkan directors like Emir Kusturica (Underground) and Srdjan Dragojevic (Pretty Village, Pretty Flame).\"[5]According to Scott Tobias of the A.V. Club, \"Though its title seems ironic at first, Beautiful People is boundless in its optimism, growing increasingly contrived as it progresses, steering the messy lives of about 25 interconnected characters in the same hopeful direction....[Dizdar] displays a gift for light absurdist comedy... but as lively and skillfully orchestrated as it is on the whole, Beautiful People adds up to curiously little, limited in large part by Dizdar's narrow view of humanity. In his enthusiasm to resolve the cultural differences between his former and present home, his disparate characters are all tossed into the same flavorless, homogenous soup.\"[6]","cinematography":"Barry Ackroyd","directed_by":"Jasmin Dizdar","release_dates":"18 May 1999 (1999-05-18) (Cannes)|||||","produced_by":"Ben Gibson Roger Shannon Ben Woolford","starring":"Rosalind Ayres Julian Firth Charles Kay","running_time":"107 minutes","music_by":"Garry Bell Ghostland Jasmin Dizdar","edited_by":"Justin Krish","written_by":"Jasmin Dizdar"}