{"based_on":"Four Steps in the Clouds  by Piero Tellini, Cesare Zavattini, and Vittorio de Benedetti","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Robert Mark Kamen|Mark Miller|Harvey Weitzman|","a_walk_in_the_clouds":"Theatrical release poster","Plot":"In 1945, United States Army Sgt. Paul Sutton returns to San Francisco to reunite with his wife, Betty, whom he married, following a whirlwind courtship, the day before he departed for the Pacific. The war has left him with emotional scars, and he experiences flashbacks on a regular basis.Paul's reunion with Betty is strained, especially after he discovers that, although he has written her \"almost every day\", she stopped reading them after the first few, and keeps the hundreds of unopened letters in a footlocker. He is determined to make a go of the marriage, however, and hopes to establish a new career for himself. She insists he continue to sell chocolates door-to-door, and he sets off to Sacramento. En route, he meets fellow train passenger Victoria Aragon, a graduate student whose Mexican-American family owns a vineyard in the Napa Valley. When he learns she is pregnant by her professor, Paul offers to introduce himself to her very traditionalist family as her husband.Victoria's father, Alberto, is infuriated, not only that she married a man below her social standing, but without his permission as well. Paul's initial plan to quietly slip away and continue on his journey, leaving her family to believe he abandoned her, is derailed when her grandfather, Don Pedro, encourages him to stay and help with the harvest. During the harvest, Paul (an orphan) grows closer to the family and learns the joys that come with their tradition, roots, and way of life. He and Victoria try to ignore their growing attraction and feelings for each other, but with little success. However, his honor prompts him to attempt to salvage his marriage and return home, but when he does he discovers Betty is involved with another man. She has applied for an annulment, to which he happily agrees, and he returns to the Aragon estate to ask Victoria to marry him.When Paul returns, an argument with an angry and drunk Alberto leads to a disastrous fire which destroys the vineyard. However, Paul remembers one plant that may still have its roots intact, races off to retrieve them, and bring them back to the family. The disaster (as well as Paul's bravery and dedication during it) has brought Alberto to realize his errors, so when Paul returns with the plant, he accepts him, telling him that this is \"his family\" and \"his roots\". They set out to replant and rebuild with the help of their newest member.","language":"English","box_office":"$50 million[1][2]","cinematography":"Emmanuel Lubezki","production_company":"Zucker Brothers Productions","directed_by":"Alfonso Arau","release_dates":"May 27, 1995 (1995-05-27) (Japan)|August 11, 1995 (1995-08-11) (USA)||||","Production":"The screenplay for the film was written by Robert Mark Kamen, Mark Miller, and Harvey Weitzman. It was based on the 1942 Italian film Four Steps in the Clouds, written by Piero Tellini, Cesare Zavattini, and Vittorio de Benedetti.[3]Principal photography took place on location among the wineries of Napa Valley and in the towns of Napa, St. Helena, and Sonoma. The Napa wineries included Mayacamas Vineyards and Mount Veeder Winery. The St. Helena wineries included Beringer Vineyards, the Redwood Cellar of the Charles Krug Winery, and the Duckhorn Vineyards. In Sonoma, the Haywood Vineyards was also used.[4]Additional filming outside the Napa Valley region took place in San Pedro, the harbor to the south of Los Angeles. The wine festival scene was actually staged in the Large Courtyard of Pasadena City Hall in Pasadena, east of Los Angeles.[4]The film score was written by Maurice Jarre, and included four songs:","produced_by":"Gil Netter|David Zucker|Jerry Zucker|","starring":"Keanu Reeves|Aitana Sánchez-Gijón|Giancarlo Giannini|Anthony Quinn|Angélica Aragón|Evangelina Elizondo|Freddy Rodriguez|Debra Messing|","running_time":"102 minutes","music_by":"Maurice Jarre","edited_by":"Don Zimmerman","Release":"Starting with a budget of $20 million, the film earned $50,008,143 in gross revenue in the United States.[1][2]Roger Ebert of the Chicago Sun-Times gave the film four out of four stars, his highest rating, writing:A Walk in the Clouds is a glorious romantic fantasy, aflame with passion and bittersweet longing. One needs perhaps to have a little of these qualities in one's soul to respond fully to the film, which to a jaundiced eye might look like overworked melodrama, but that to me sang with innocence and trust...At a time when movies seem obligated to be cynical, when it is easier to snicker than to sigh, what a relief this film is![6]Mick LaSalle of the San Francisco Chronicle wrote:A couple of turns of plot—including the histrionic ending—seem less magical than overwrought, but A Walk in the Clouds is for the most part a beautiful, well-acted and emotionally rich picture...In this very warm-hearted film, Reeves' face is the movie's focus of kindness and decency—and he stands up to scrutiny. There's not just sweetness there but depth.[7]Hal Hinson of the Washington Post called it \"a phenomenally atrocious movie—so bad, in fact, that you might actually manage to squeeze a few laughs out of it...The film has the syrupy, Kodak magic-moment look of a Bo Derek movie, and pretty much the same level of substance.\"[8]Variety described the film as \"a glossy, fairy-tale romance that's longer on wishfulness than believability\" and \"a modest but sharply mounted comedy/melodrama.\"[9]Maurice Jarre won the Golden Globe Award for Best Original Score. Reeves's performance in the film earned him a Golden Raspberry Award nomination for Worst Actor.","budget":"$20 million"}