{"country":"United States","distributed_by":"Avco Embassy Pictures","screenplay_by":"Ronald Shusett|Dan O'Bannon|","story_by":"Alex Stern|Jeff Millar|","Plot":"James Farentino stars as Dan Gillis, sheriff of the small New England coastal town of Potter's Bluff. In the film's opening scene, a mob of townspeople attempt to kill a visiting photographer. He is beaten, tied to a post then set on fire. He survives and is taken to a hospital, where he is murdered just out of sight of the sheriff and the doctor.More visitors are murdered by the townspeople. Sheriff Gillis, assisted by Dobbs, the local coroner-mortician (Jack Albertson), works hard to discover the motive for the killings. Gillis becomes increasingly disconcerted as a grisly death occurs every day. In each case, the killers photograph the victims as they are murdered.Gillis accidentally hits someone with his squad car following an attack. On the grill of his car, Gillis finds the twitching severed arm of the accident victim, who attacks him and flees with the arm. After the attack, Gillis scrapes some flesh from the vehicle and takes it to the local doctor, who tells him that the tissue sample has been dead approximately four months. Gillis grows suspicious of Dobbs and conducts a background check. He discovers that Dobbs was formerly the chief pathologist in Providence, Rhode Island, until he was dismissed 10 years ago for conducting unauthorized autopsies in the county morgue.It is revealed that Dobbs has developed a secret technique for reanimating the dead, and all of the townspeople are reanimated corpses under his control. Dobbs considers himself an \"artist\" who uses his zombies to murder the living in order to create more corpses on which to practice his reanimation technique. The Sheriff is unaware that he is also one of the living dead, having been murdered some time ago by his undead wife under Dobbs' orders. Gillis notices his hands decomposing, and Dobbs asks to examine them.","language":"English","Critical reception":"Rotten Tomatoes reports that 73% of critics gave the film a positive review, based on 11 reviews.[2]Zombiemania: 80 Movies to Die For author Arnold T. Blumberg wrote that Dead & Buried \"is another fine homage to the EC Comics style of horror, with a story that also echoes the structure of a classic Rod Serling Twilight Zone episode,\" adding that the film is \"a late-night treat that works best with the lights off and no foreknowledge of what's to come.\"[3] AllMovie wrote, \"it's easy to see why Dead and Buried never found a big audience. It is too plot-heavy for those viewers in search of a shock machine yet too visceral for the viewers who appreciate subtle horror\",[4] but complimented its \"blend of creepy atmosphere and gruesome shocks.\"[4] Writing in The Zombie Movie Encyclopedia, academic Peter Dendle said that the film \"builds suspense effective and plays its genuine twists well, so long as you don't ask too many questions of the everyone-is-in-on-it-but-one-person plot.\"[5] Glenn Kay, who wrote Zombie Movies: The Ultimate Guide, called it a \"solidly entertaining picture\" and praised the special effects work by Stan Winston.[6]","box_office":"$216,166[1]","cinematography":"Steven Poster","directed_by":"Gary Sherman","release_dates":"May 29, 1981 (1981-05-29)|||||","Production":"The opening shot depicting the central street scene in Potters Bluff was filmed along Lansing Street in Mendocino, California.[citation needed]","produced_by":"Robert Fentress|Richard R. St. Johns|Ronald Shusett|","starring":"James Farentino Melody Anderson Jack Albertson Dennis Redfield Nancy Locke Robert Englund","running_time":"92 minutes","music_by":"Joe Renzetti","edited_by":"Alan Balsam"}