{"based_on":"Characters  by Bill Parker C. C. Beck","country":"United States","distributed_by":"Republic Pictures","screenplay_by":"Ronald Davidson Norman S. Hall Arch B. Heath Joseph Poland Sol Shor","Plot":"During an archaeological expedition to Siam's volcanic Valley of the Tombs to find the lost secret of the Scorpion Kingdom, a device of great power, the Golden Scorpion, is discovered hidden inside a sealed crypt. While examining it, the device's quartz lenses are aligned and powerful energy beam erupts, causing an explosion, resealing the crypt. This allows young radio broadcaster and expedition member Billy Batson, who obeyed the warning on the crypt's seal not to enter, to be chosen by the ancient wizard Shazam. The wizard grants Billy the powers of Captain Marvel whenever he repeats the wizard's name. Captain Marvel's powers can only be used to protect those in danger from the curse of the Golden Scorpion. The crypt's entrance is quickly cleared, then Captain Marvel utters \"Shazam\"! and quickly resumes his Billy Batson alter ego.The Golden Scorpion's power lenses are divided among the scientists of the Malcolm Archaeological Expedition so that its power can only be used by agreement of the entire group, who then return to the U. S. after their discovery. An all-black-garbed-and-hooded criminal mastermind, calling himself the Scorpion, steals the ancient device after their return and sets about acquiring the distributed lenses. Several expedition members are killed in the Scorpion's quest, despite Captain Marvel's continual efforts to thwart his plan. Deducing that the Scorpion always seems to know what happens during the scientists' meetings, Billy later confides to his friends, Betty Wallace and Whitey Murphy, his suspicion that the Scorpion may be one of the Malcolm archaeological team.Discovering that one of the Golden Scorpion's power lenses was purposely left behind, cleverly hidden in the very crypt where it was first discovered, Billy Batson and the surviving scientists agree it must be retrieved. They return by cargo ship to Siam where, near landfall, they barely survive a typhoon before finally being rescued by Captain Marvel. They eventually retrieve the hidden lens, but it is stolen by the Scorpion. By accident, from a distance, the Scorpion observes Captain Marvel transforming back into Billy Batson. Capturing Billy and gagging him, the Scorpion interrogates him about his secret. Billy's tape gag is removed when he agrees to talk. \"Shazam\"! is his only response, and he transforms in a flash of light and smoke into Captain Marvel. The Scorpion's identity is then revealed to be one of the last surviving scientists, who is killed by a Siamese native who turns the idol's ray on him, vaporizing him.Captain Marvel tosses the Golden Scorpion and its power lenses into a volcano's molten lava to prevent them from ever being used for evil. Upon its destruction, Captain Marvel is instantly transformed back into Billy Batson forever, the danger from the device's curse having now been eliminated.","language":"English","Critical reception":"Authors Jim Harmon and Donald F. Glut claim that Adventures of Captain Marvel is \"unquestionably one of the finest movie serials ever made, possibly the best with the exception of the three Flash Gordon epics.\"[7] Author William C. Cline describes this as one of the most outstanding of all serials[12] and Republic's \"masterpiece.\"[8] He writes that Tyler's \"striking performance...remains in thousands of minds as the most memorable serial hero of all time - bar none.\"[13]","cinematography":"William Nobles","directed_by":"William Witney John English","The powers of Shazam":"When Billy Batson receives the ability to become Captain Marvel from the wizard Shazam, he does so by speaking the wizard's name, conferring upon him these powers:","release_dates":"March 28, 1941 (1941-03-28)|||||","Production":"Adventures of Captain Marvel was budgeted at $135,553, although the final negative cost was $145,588 (a $10,035, or 7.4%, overspend).[1] It was filmed between December 23, 1940 and January 30, 1941 under the working title Captain Marvel.[1] The serial's production number was 1098.[1]The serial was the outgrowth of Republic's failed attempt at successfully adapting National Periodical Publications' (DC Comics today) Superman character. After some changes, that script became Republic's Mysterious Doctor Satan serial. The studio then approached Fawcett Comics about filming their most popular superhero, and they agreed. Director William Witney, however, was skeptical about trying to adapt Captain Marvel after the problems encountered with Superman.[3] In spite of this, Adventures of Captain Marvel became the first superhero film adaptation of a comic book character.[4][5]National then attempted legal action to prevent the project, citing Republic's failure at adapting a similar Superman serial. Their attempt was unsuccessful, however, and Captain Marvel went into production. Writing in his autobiography of the period, William Witney revealed that in his deposition he had claimed that both Superman and Captain Marvel were derivatives of Popeye.[3] About a decade later, following an on-going legal battle with National and a declining comics market, Fawcett ceased publication of all its comic book titles; it sold them to competitor Charlton Comics during 1954-1955. In the 1970s the dormant Captain Marvel family of characters was licensed and revived by DC Comics, which they ultimately wound up purchasing, adding a final chapter to the Fawcett/DC saga.The opening military scenes in the serial were reused footage lifted from Republic's 1938 film Storm Over Bengal.Republic cast Frank Coghlan as Billy Batson due to his physical resemblance to the character.[6] There was, however, some criticism that Tom Tyler did not sufficiently resemble the \"beefy, baby-faced Captain Marvel\".[6] At the time, Tyler was a weightlifting champion and the serial costume matched Captain Marvel's original comic book appearance, right down to his being slender. By the time of the serial's release, the appearance of Captain Marvel had changed due to Fawcett comics artist C. C. Beck having taken over drawing the character.[7]Tyler was described as clumsy, knocking over props with his \"lanky arms\". Punches in fight scenes would sometimes connect.[7]Due to his convincing performance in King of the Royal Mounted, actor Robert Strange (as John Malcolm) was the obvious choice to be the identity of the Scorpion, but by the end of the serial he was just a diversion and not actually the villain.[8]Republic's flying effects, under the direction of Howard and Theodore Lydecker, were performed using a dummy that was slightly larger than life (at 7 feet tall) and made of paper mâché so that it weighed only 15 lbs. The uniform was made of thin silk and cotton jersey.[7] Four pulleys were connected to each shoulder and leg calf, which were then strung on two wires so the dummy moved along them by its own weight. The wires were attached to two opposite objects running across the camera's field of view, and the dummy then slid from one to the other, giving the illusion of flight. This system was originally intended for use in their Superman serial; a prototype dummy was even built but later discarded.[7] The flying pose used for the dummy (arms outstretched and back arched) was based upon a Captain Marvel drawing by comics artist Mac Raboy.[7] If the dummy needed to be seen flying upwards, the cape was convincingly weighted and the dummy was then slid backwards. The film sequence was then optically printed in reverse, completing the flying illusion.[7]Stuntman Dave Sharpe was the human part of the effect. Dressed as Captain Marvel, he would leap from a high point with his body straight, as if able to fly, then roll to land at the last second. The combination of flying effects and stunts produced the overall illusion of a flying person. Sharpe also performed other stunts as Captain Marvel, such as back flipping and knocking down attacking Siamese tribesmen in the first chapter.[7] Some shots of Captain Marvel flying were filmed with Tim Tyler posed against rear-projected clouds. Some of these scenes, however, show the suspension wires used to hold him up.[7]According to author Raymond William Stedman, the flight scenes were \"the most successful illusion of such aerobatics ever put upon the screen, in serial or feature.\"[9]The technique had been developed in the earlier serial Darkest Africa (1936) and was later used again in the \"Rocket Man\" serials (King of the Rocket Men, Radar Men from the Moon, Zombies of the Stratosphere, and Commando Cody: Sky Marshal of the Universe) released during 1949-1953.By contrast, the lower-budget Columbia Pictures Superman serials, which eventually appeared in the late 1940s, used unconvincing animated cartoon sequences to represent various actions, most frequently Superman's flights. The animated scenes of Superman in flight were vastly inferior to those of Republic's live-action sequences in Captain Marvel. Columbia produced the cheapest serials of the era, and producer Sam Katzman was notorious for cutting costs to the bone.One of the tunics later appeared as the costume of a member of the Kryptonian science counsel in the first episode of The Adventures of Superman television series, filmed in 1951.[10] The lightning bolt on the tunic is partially concealed by means of an oversize collar around the actor's neck.After the usage in the Superman TV series, two Captain Marvel tunics were worn by actors in early episodes of the pioneering U. S. science fiction TV series Space Patrol. Very early into the series, those Marvel tunics were replaced by custom made shirts.At the Science Fiction Museum and Hall of Fame in Seattle, WA, one of the remaining Captain Marvel tunics is on public display.[11]","produced_by":"Hiram S. Brown, Jr.","starring":"Tom Tyler Frank Coghlan, Jr. William Benedict Louise Currie Robert Strange Harry Worth Bryant Washburn John Davidson","running_time":"12 chapters / 216 minutes[1]","Influence":"The characters of Betty Wallace, Whitey Murphy, and John Malcolm all appeared in the Fawcett comics in the 1940s, beginning with \"Capt. Marvel And The Temple Of Itzalotahui\" (Whiz Comics #22, Oct. 3, 1941) featuring Murphy and Malcolm;[14] Murphy made several appearances in the 1970s DC Comics incarnation of Captain Marvel.[15]Fawcett also published a sequel to the 1941 serial. Titled The Return of the Scorpion, it was one of the four releases in its Dime Action Books series, which imitated the format of the popular Big Little Books. The book is notable for reusing several characters from the serial and for being Otto Binder's first writing assignment at Fawcett; he went on to be a prolific comics writer for the company.In 1994 comic book writer/artist Jerry Ordway wrote and painted a graphic novel, The Power of Shazam!, and an ongoing comic book series spin-off, which ran from 1995 to 1999. Ordway used the Republic serial as his initial inspiration in his handling of the Captain Marvel characters.[16]","Chapters":"Source:[1][2]","music_by":"Cy Feuer","Release":"Adventures of Captain Marvel's official release date was March 28, 1941, although this is actually the date the sixth chapter was made available to film exchanges.[1] The serial was re-released on April 15, 1953 under the title Return of Captain Marvel, between the first runs of Jungle Drums of Africa and Canadian Mounties vs. Atomic Invaders.[1] Due to the superhero nostalgia craze in the U. S. during the spring of 1966, resulting from the hit Batman television series, the serial was quickly re-released again, this time as a complete, nearly 4-hour long, feature film. All 12 chapters were strung together, each opening with the prior chapter's ending scenes and a plot synopsis. Audiences were forced to sit through what they had just watched in the previous chapter.Republic Pictures released the serial as a two-tape VHS set in 1995 and then again in 2003 on DVD as a two-disc set.","adventures_of_captain_marvel":"Theatrical release poster for Chapter 10: \"Doom Ship\"","budget":"$135,553 (negative cost: $119,343)[1]"}