{"distributed_by":"MGM/UA Entertainment Co.","screenplay_by":"Philip Frank Messina Robert Stitzel","story_by":"Bruce Joel Rubin","brainstorm":"Film poster","Plot":"A team of scientists invent a brain/computer interface that allows sensations to be recorded from a person's brain and converted to tape so that others may experience them. The team includes estranged husband and wife Michael and Karen Brace, as well as Michael's colleague Lillian Reynolds. At CEO Alex Terson's instruction, the team demonstrates the device to investors in order to gain financing.One team member, Gordo Forbes, has sexual intercourse while wearing the recorder, and he shares the tape with colleagues, including Hal Abramson. Hal splices one section of the tape into a continuous orgasm, which results in sensory overload, leading to his forced retirement. Tensions increase as the possibilities for abuse become clear.Karen dons the recorder while working with Michael and Lillian. When Michael plays the tape back, the group realizes that emotional experiences are also recorded. Michael tapes his memories of times with Karen, which he shares with her, and it leads to their reconciliation.Lillian is pressured by backers to admit a former colleague, Landon Marks, whom she sees as part of the military-industrial complex. She disagrees with their plan to have the invention developed for military use. Already suffering from heart problems and a constant cigarette smoker, Lillian suffers a heart attack while working alone. Realizing that she is about to die, Lillian records her experience.Following her funeral, Michael decides to experience Lillian's recording, but he nearly dies when the playback causes his body to simulate the sensations and effects of a heart attack. Michael modifies his console to censor the physical output, and he replays the tape. Viewing Lillian's death experience, he sees \"memory bubbles\" — moments from Lillian's life. Michael experiences Lillian's memories of a humorous exchange with Michael as he plays with an industrial robot, a surprise birthday party, and being devastated when Alex tells her that an earlier project has been cancelled.A team of scientists wanting to discover the machine's military capabilities is monitoring the equipment as Michael plays Lillian's final tape. They have Gordo also experience the tape, but they neglect to modify the machine as Michael did; Gordo is killed when he experiences the unfiltered tape.Michael's playback is cut short by Hal, but having witnessed a digital near-death experience makes Michael curious to see the entire tape. Alex has the recording locked away and tells Michael he will not be allowed to view it. When he returns to work, Michael walks in on Landon Marks and a team of outsider technicians going through his research records and protests to Alex who responds by firing Michael and Karen.Michael attempts to hack into the lab's computers. Hal advises him to look under \"Project Brainstorm\", a program the military has created to re-develop their invention for torture and brainwashing. Michael and Karen's son Chris, wanting to experience the special device, is inadvertently exposed to one such tape, causing him to have a psychotic experience which results in his hospitalization.Rather than see his creation perverted, Michael vows to destroy his work and enlists the help of Karen and Hal. Michael and Karen head to the Pinehurst Resort and, realizing they are under surveillance, stage a fight that results in Karen leaving for Hal's house. As the two feign reconciliation over the phone, Michael accesses the Brainstorm computer via another phone line, while Karen hacks into the system and sabotages the robots that manufacture the interface terminals.Karen shuts down the security system, locking the staff outside and enabling Michael to load Lillian's tape and experience it uninterrupted. With the plant in chaos, Robert Jenkins orders Michael's arrest. Michael escapes their agents and drives to a phone booth at the Wright Brothers National Memorial. He reconnects with the computers and accesses the final part of the tape, beyond the point of Lillian's physical death.Karen leaves the house to meet with Michael. Hal and his wife, Wendy, send the last of Karen's commands to the company computers, shutting down the plant.Karen arrives at the Wright Brothers Memorial while the tape is playing. Michael bears witness to the Afterlife, experiencing a brief vision of Hell before traveling away from Earth and through the universe, even after the tape ends, ultimately witnessing visions of angels and departed souls flying into a great cosmic Light. Michael then collapses. Karen sobs, believing him dead. She pleads for Michael to stay alive. Awakening from the experience, he weeps with joy and embraces Karen.","language":"English","Reception and aftermath":"Brainstorm was finally released on September 30, 1983, almost two years after Wood's death. However, it opened on a small number of screens and with little publicity, despite being trumpeted unofficially as \"Natalie Wood's last movie\". Rotten Tomatoes reports that 63% of 16 critics have given the film a positive review.[6] Janet Maslin of the New York Times gave particular credit to Louise Fletcher's \"superb performance\".[7]The film was not a commercial success, with a production budget of $18 million[8] and grossing only $10 million in ticket sales in North America.[9]Because of the immensely troubled production and disagreements with MGM, Trumbull opted never to direct a Hollywood film again. In 1983 he stated \"I have no interest...in doing another Hollywood feature film...Absolutely none. The movie business is so totally screwed-up that I just don't have the energy to invest three or four years in a feature film. Moviemaking is like waging war. It destroys your personal life, too. The people who can survive the process of making films have largely given up their personal lives in order to do that, just because it's such a battle to make a movie. And in doing that, they've isolated themselves from the very audience that they're trying to reach.\"[1]","box_office":"$10,219,460","cinematography":"Richard Yuricich","production_company":"Metro-Goldwyn-Mayer","directed_by":"Douglas Trumbull","release_dates":"September 30, 1983","Production":"To prepare for the film, Trumbull took most of the key cast and crew up to the Esalen Institute, an experimental research facility in Northern California known for its new-age classes and workshops. In September 1981 the cast and crew traveled to North Carolina to begin six weeks of location shooting, before moving back to the Metro-Goldwyn-Mayer Studios in Culver City, California in November to film interior scenes.[1]The film was nearly scuttled by Natalie Wood's death during a production break in November 1981. By this time, Wood had already completed all of her major scenes,[2] but due to mounting financial problems, MGM took Wood's death as an opportunity to shut down the already troubled production. \"When she died,\" said Trumbull, \"all the sets were locked and frozen on all the stages. No one could get in or out without special permission while all the negotiations took place.\"[1]Trumbull believed that the financially strapped MGM simply got cold feet about putting up the rest of the money to complete Brainstorm. \"MGM's problem was that insurance institution Lloyd's of London, when it took depositions from me and other people, realized that the film could be finished. Why should they pay an insurance claim for something that really wasn't damaged goods?\" When MGM refused to pay for the film to be completed, Lloyd's of London provided $2.75 million for Trumbull to complete principal photography and an additional $3.5 million towards post-production. Meanwhile, other studios showed interest in buying Brainstorm from MGM to release as their own production. \"MGM decided to allow Lloyd's of London to offer the film to many of the major studios in town,\" said Trumbull. \"Several of them made bids to MGM. And the studio suddenly realized that a lot of other people in this town were excited about Brainstorm, and were ready to put up millions of dollars. MGM figured they'd look like jerks if they let it go and it turned out to be a big success. So they finally decided to work out this deal where Lloyd's of London would put up the remaining money and become a profit participant.\"[1]Trumbull proceeded to complete the film by rewriting the script and using Natalie Wood's younger sister for Wood's few remaining scenes.[3]The film carries the dedication credit \"To Natalie.\"[1]The film was conceived as an introduction to Trumbull's Showscan 60 frames-per-second 70mm film process. \"In movies people often do flashbacks and point-of-view shots as a gauzy, mysterious, distant kind of image,\" Trumbull recalled, \"And I wanted to do just the opposite, which was to make the material of the mind even more real and high-impact than 'reality'\".However, MGM backed out of plans to release the experimental picture in the new format. Trumbull instead shot the virtual reality sequences in 24 frames-per-second Super Panavision 70 with an aspect ratio of 2.2:1. The rest of the film was shot in conventional 35mm with an aspect ratio of approximately 1.7 to 1.[4]The score to Brainstorm was composed and conducted by James Horner, it won him the Saturn Award for Best Music in 1983. The Varèse Sarabande album/CD release is a re-recording with the London Symphony Orchestra, produced shortly before the original theatrical release.[5]","produced_by":"Douglas Trumbull","starring":"Christopher Walken|Natalie Wood|Louise Fletcher|Cliff Robertson|","running_time":"106 minutes","music_by":"James Horner","edited_by":"Dennis Freeman Edward Warschilka","budget":"$18 million"}