{"country":"United States","distributed_by":"Columbia Pictures (USA & Canada) 20th Century Fox (International)","screenplay_by":"Sheldon Lettich Jean-Claude Van Damme","story_by":"Sheldon Lettich Jean-Claude Van Damme Steve Meerson Peter Krikes","Plot":"The story begins with the opening of the Hong Kong Victoria Harbour tunnel by business partners Paul Wagner and Nigel Griffith (Alan Scarfe). Paul attends with his wife, and their twin infant sons, Chad and Alex. However, after the celebrations, the family is followed home by a Triad hit squad on orders from Griffith and crime lord Raymond Zhang (Philip Chan). A shootout ensues, in which Paul and his wife are killed by Moon (Bolo Yeung), Griffith's henchman. Chad is rescued by the family bodyguard, Frank Avery (Geoffrey Lewis), and raised abroad. Alex is dropped off on the doorstep of a Hong Kong orphanage.In the present day, Chad (Jean-Claude Van Damme) and Frank are running a successful martial arts business in Los Angeles when Frank reveals a new \"business\" for the two of them in Hong Kong. Soon after arrival, they find Chad's long-lost twin brother Alex (Jean-Claude Van Damme) and Frank explains their shared past. It is revealed that Alex is immersed in the Hong Kong crime world ruled by Zhang, and has a girlfriend who works for Griffith’s company, Danielle Wilde (Alonna Shaw). After escaping the Hong Kong Marine Police for trying to sell foreign cars with electronics inside, Chad (mistaken for Alex) is taken in by the Triads to discuss the incident. During the interrogation, Chad learns about a drug lab in Causeway Bay.Alex and Chad arrange to destroy the lab by planting C4 in the complex one night, but Chad's clumsiness triggers a massive gunfight. The lab is destroyed, but Alex loses any respect for Chad. Later, Danielle and Alex talk on a ferry and discuss a meeting that will take place soon in a night club in Hong Kong, with Zhang and other bosses in attendance. Alex, Chad and Frank endure their third mission to take down Zhang using Cognac boxes with C4 encased in them.Zhang discovers that both Chad and Alex are not only twins, but the twins from 25 years ago. Danielle locates the document she had been sent to recover, but is stopped and sexually harassed by Kara (Cory Everson), Griffith's assassin. She reports her findings to Chad, who goes to meet her alone. He brings her to one of Alex's hideouts in a bar, but they are forced to flee when the Triad comes looking for them. Due to an incomplete phone call, Alex suspects Chad of having an affair with his girlfriend and starts drinking heavily as he dreams of Danielle and Chad having sex. He attacks and fights Chad in a drunken rage upon his return, after which the brothers angrily part ways.After a massive hangover, a sober Alex returns to the house to find it being raided by armed soldiers working for Griffith and Zhang, who capture Frank and Danielle. They are taken hostage on the Golden Glory ship's furnace room where they are tortured. Despite the ongoing tension between them, Alex and Chad join forces to infiltrate the ship and rescue Frank and Danielle. The duo, well-armed, arrived at the ship where they fight their way through Griffith and Zhang's henchmen, while Chad fights and kills Moon, Alex saves Danielle but not Frank, following his escape. After a climactic showdown, Chad and Danielle are confronted by Griffith who tried to kill Chad with a big vheichele, Chad fakes his death by jumping to the sea, and then, he kills Griffith after getting into the vheichle. Alex kills Zhang by making him fall to his death, and Frank came out alive, the duo are reunited as they are decide to put their rivalry aside.","language":"English","Critical and box office reception":"Double Impact opened on August 9, 1991 to negative critical response where most critics cited it as yet another mindless action movie that only had the gimmick of two Jean-Claude Van Dammes.[9][10] Roger Ebert gave the film recognition for slick production values.[11] Despite the negative reaction, the film was a commercial hit and spotted at No.2. at the US box office.[12]","double_impact":"Theatrical release poster","box_office":"$80,500,000[4]","cinematography":"Richard H. Kline","production_company":"Stone Group Pictures Vision International","directed_by":"Sheldon Lettich","Soundtrack":"The score by Kempel was released as the Double Impact Original Soundtrack Recordings on 1993 by Silva America. The soundtrack was released on CD contained twelve tracks with a runtime of 40 minutes.[13]All music composed by Arthur Kempel.","release_dates":"August 9, 1991 (1991-08-09)|||||","Production":"Van Damme wanted to play twins to help change his image. \"One of them is violent and the other is not, so the audience can see the contrast in my work,\" he said. \"This picture has comedy, romance, a love story. So it is not all action and fighting. When I fight on screen, I blend dancing and fighting. Grace plus power is very nice.[6]Van Damme said his real life personality was closer to Chad than Alex. \"In real life I am not this cold, quiet guy who goes around kicking butt.\"[7]Director Sheldon Lettich later recalled the concept of Van Damme playing twins \"was so successful that other producers wanted him to repeat it (Timecop, Maximum Risk, Replicant). Even though it meant a lot more work for Jean-Claude, changing costumes, hair, and makeup numerous times over the course of a shooting day, he enjoyed the challenge of playing two distinctly different characters, showcasing a dark side and a more light-hearted side in the same movie.\"[8]","produced_by":"Jean-Claude Van Damme Paul Michael Glaser Ashok Amritraj","starring":"Jean-Claude Van Damme|Geoffrey Lewis|Alan Scarfe|","running_time":"107 min.","Sequel":"In 2010, Jean-Claude Van Damme and Bolo Yeung were giving a martial art demonstration and Van Damme said hopefully one day he and Yeung will put a project together \"Double Impact 2\" and maybe Yeung will play a friend and not any enemy.[14]In a 2012 interview promoting The Expendables 2, Van Damme mentioned that he would like to make another Double Impact movie with a more serious tone.[14] During the interview, he also gave a rough idea of the plot: \"Two twins one is coming back from Asia to LA to help his brother who is a con-artist and pretend to be a big Hollywood producer and he's in trouble with the mob\".[14]A Double Impact 2 script has been written by Van Damme and Sheldon Lettich (who co-wrote Bloodsport and Double Impact). Van Damme said \"Hopefully, somebody smart enough, like an agent or a producer, can put that back together...I'm excited about it, you know?\"[15]Chad is a film producer, making movies for a big company. Alex is going on holiday but has some problems with the Triads, because when Chad was in Hong Kong, he got a loan of money using Alex's face. Alex then goes to Los Angeles to find Chad and discovers he has gotten a girl pregnant, and that she is the sister of a big boss from South Central.[15]","music_by":"Arthur Kempel","edited_by":"Mark Conte","budget":"$15,000,000 (U. S.)[1][2] or $18 million[3]"}