{"country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"James \"Jimmy\" Monroe and Paul Hodges (Bruce Willis and Tracy Morgan) are NYPD detectives. After failing to capture suspect Juan Diaz (Cory Fernandez) and endangering civilians, Jimmy and Paul are suspended without pay. Jimmy's daughter Ava (Michelle Trachtenberg) is getting married, and the cost of the wedding is close to fifty thousand dollars. Though his ex-wife Pam's arrogant second husband Roy (Jason Lee) offers to pay for the wedding, Jimmy is determined to find a way to come up with the money. Meanwhile, Paul is worried that his wife Debbie (Rashida Jones) is cheating on him, so he sets up a hidden camera. While Jimmy is selling a 1952 Andy Pafko baseball card to pay for the wedding, the card shop is robbed by Dave (Seann William Scott), who steals Jimmy's card and Paul's favorite gun. They find out that Dave is going to rob a house that night so they stake out the house to retrieve the card and the gun. Jimmy and Paul arrest Dave, but he has already sold the card and the gun for drugs.Jimmy and Paul go to the drug dealer, Poh Boy (Guillermo Díaz), who tells them they may have the card if they retrieve a stolen car. When they find the car, they discover a woman named Gabriela (Ana de la Reguera) in the trunk. Gabriela reveals that she is the mistress of a drug lord who was kidnapped and murdered by Poh Boy's gang. Jimmy previews the tape from Paul's hidden camera and finds what looks to be Debbie and another man, but he tells Paul there is nothing on it. Paul then sees the tape and is heartbroken when he sees that Jimmy has lied. Gabriela does not want to get Jimmy and Paul hurt, so she flees, leaving them a flashdrive concealed in a crucifix, which contains all the dealer's contacts. Jimmy and Paul bail out Dave so he can retrieve the card and the gun from Poh Boy, but he falls out of a tree and dies. Jimmy breaks into the house to retrieve the card but is surrounded by the gang. At the same time, Paul learns that Debbie played a trick on him for not trusting her. After killing most of the gang, Jimmy and Paul find Poh Boy holding Gabriela at gunpoint. They shoot him dead, but Paul's bullet goes through Jimmy's baseball card, in Poh Boy's shirt pocket. Pleased with the duo's investigation and assisting two colleagues (Adam Brody and Kevin Pollak) who were caught in the shootout, the precinct chief (Sean Cullen) restores Jimmy and Paul to active duty and gives them commendations.Crestfallen at the destruction of his prized card, Jimmy lets Roy pay for the wedding. Pam asks Jimmy and Roy to give away Ava together. Jimmy says nothing about it. Paul discreetly points his pistol at Roy and orders him to sit down at the moment the priest calls out for the father who would give away Ava. A bonus scene during the closing credits reveals that Dave did not die in the fall when he pulls a prank on the coroner opening the body bag by doing one of his knock-knock jokes resulting in her fleeing in horror while Dave exits the body bag in laughter.","language":"English","box_office":"$55.6 million[3]","cinematography":"Dave Klein","production_company":"Marc Platt Productions","Marketing":"The first trailer for the film was released on December 23, 2009, and then attached to Sherlock Holmes.[18] A red band trailer was also released on February 5, 2010. The film was also advertised extensively in the United States during NBC's coverage of the 2010 Winter Olympic Games.","directed_by":"Kevin Smith","release_dates":"February 26, 2010 (2010-02-26)|||||","Production":"In March 2009, it was announced that Kevin Smith signed on to direct a buddy-cop comedy starring Bruce Willis and Tracy Morgan titled A Couple of Dicks and written by the Cullen Brothers. It was the first feature film Smith directed but did not write.[4][5] Prior to principal photography, Variety reported[6] that the title had been changed to A Couple of Cops due to controversy surrounding the original one.[7] After negative reaction to the change, Warner Bros. recanted the story and reverted to the original title,[8] though Smith denies that the original change was requested by the studio.[6] In December 2009, the studio changed the title from A Couple of Cops to Cop Out.[9] According to Smith, this title was inspired by his offhandedly complaining to a producer that calling the film A Couple of Cops would be a \"cop out\"; he embraced this title as it was both reminiscent of titles of 1980s buddy cop films (such as Lethal Weapon) and alluded to his frustration over the name change.[10] While promoting the film on the Late Show with David Letterman, Willis joked that, in addition to A Couple of Dicks, the movie had at one point gone by the also-rejected title of Cop Suckers. During marketing, a theatrically released trailer ran with the name Detectives in Charge.On December 9, 2009, Kevin Smith announced via his Twitter page that the film would indeed go by the new title.[11][12] He also stated that the first trailer for this film would be attached to every copy of Sherlock Holmes when it hits theaters on Christmas day.[13] At the time, Smith acknowledged that the film is \"not MY movie, [it's] a movie I was hired to direct.\"[14][15]The studio requested Smith to storyboard the entire film; Smith agreed, and he and Dave Klein, the director of photography, reviewed the results with Warner Bros. two months in advance.[6] Filming began on June 2, 2009 in New York City and finished on August 14, 2009,[16] for a February 26, 2010 release.In a 2011 interview with comedian/podcast host Marc Maron, Kevin Smith described working with Bruce Willis as \"soul crushing\".[17]Ultimately, Cop Out cost Warner studios $37 million to produce.[2]","produced_by":"Marc E. Platt Polly Johnsen Michael Tadross","starring":"Bruce Willis Tracy Morgan Kevin Pollak Seann William Scott","running_time":"107 minutes[1]","cop_out":"Theatrical release poster","music_by":"Harold Faltermeyer","edited_by":"Kevin Smith","Release":"The film opened #2 behind Shutter Island,[19] earning $18,211,126 on its opening weekend.[3] As of May 20, 2010 Cop Out has earned $44,875,481 at the domestic box office and $7,338,581 overseas giving it a worldwide total of $55,439,786.[3]Cop Out was met with negative reviews by critics. Review aggregator Rotten Tomatoes labeled the film \"rotten\", reporting that only 19% of critics nationwide have given the film a positive review based on 154 reviews, with an average score of 3.8/10.[20] The critical consensus reads, \"Cop Out is a cliched buddy action/comedy that suffers from stale gags and slack pacing\".[20] Review aggregate Metacritic gave the film an average score of 31 out of 100 based on 34 reviews.[21]The film was brought up numerous times in reviews for The Other Guys, a buddy cop comedy film which was released the same year and was more well received by critics, with Richard Roeper stating, \"Note to Kevin Smith: THIS is how you do a spoof of the buddy-cop genre,\"[22] and Stephen Whitty of The Star-Ledger said in his mixed review, \"Measured against this year’s other police farce – remember Cop Out? – it looks absolutely heroic.\"[23]On the January 17, 2011 episode of WTF with Marc Maron, Smith discussed his disappointment with working with Bruce Willis and his satisfaction with working with Tracy Morgan during the making of Cop Out. Smith stated that one of the reasons that he agreed to direct the film was because he wanted to work with Willis, but that Willis \"wouldn't even sit for a fucking poster shoot\" and that \"were it not for Tracy, I might have killed either myself or someone else in the making of fucking Cop Out.\"[24]A talent rep associated with the production of the film reported conflicts on set between Smith and Willis, saying of Smith, \"He smokes way too much pot. He sat behind his monitor. He didn't interact with the actors. The actors felt they were on their own.\"[25] Smith defended his use of marijuana while working, claiming \"I dealt with every actor who wanted to be dealt with on that set\" and pointed to the number of projects he worked on while making Cop Out to counter claims he was unproductive because of marijuana.[26] Smith admitted in an interview that heavy marijuana-smoking had become an integral part of his work ethic after claiming that he watched actor Seth Rogen on the set of Zack and Miri Make a Porno use marijuana as a tool to become a more creative and productive worker, saying \"The moment I start smoking, I start working.... That way, no one could ever take it away from you.\"[27]In response to the critical drubbing his 2010 film Cop Out received, Smith lashed out at the community of film critics on his Twitter account saying, \"Writing a nasty review for Cop Out is akin to bullying a retarded kid. All you’ve done is make fun of something that wasn't doing you any harm and wanted only to give some cats some fun laughs.\"[29][30] Smith also implied on Twitter that he may charge critics for advance screenings of his films, a service which has typically been provided free; this subsequently ignited a strong response from some critics condemning his stance as \"dishonest\" and \"disingenuous\".[29]In May 2010, DVD and Blu-ray Disc editions of the film were announced for release on July 20, 2010.[31] In July of that year, Cop Out was the #1 selling DVD in the US.[32]","written_by":"Mark Cullen Robb Cullen","budget":"$37 million[2]"}