{"based_on":"Daredevil characters  by Stan Lee Bill Everett Daredevil: The Man Without Fear by Frank Miller","Cast":"Stan Lee, Frank Miller, and Kevin Smith, each notable for their work on the Daredevil comics, also have cameo roles throughout the film.[10] Mark Margolis has an uncredited role as Fallon, a mobster who once employed Fisk as a hitman. The director's cut version also features Jude Ciccolella and Coolio in a sub-plot removed from the theatrical version. Tanoai Reed appears uncredited as a thug in Josie's Bar.","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Mark Steven Johnson","Plot":"Matt Murdock is a blind lawyer in New York City's Hell's Kitchen neighborhood, where he runs a firm with best friend Franklin \"Foggy\" Nelson. As a child, Matt was blinded by a toxic waste spill. The accident enhanced Matt's other senses and gave him sonar to \"see\" via sonic vibrations. Matt's father, boxer Jack \"The Devil\", was killed after refusing to turn in a fixed fight for the mobster who had employed him earlier. After his father's death, Matt promised to stop all crime that controlled Hell's Kitchen, New York as the vigilante crime-fighter \"Daredevil\".Matt meets Elektra Natchios, daughter of Nikolas Natchios, a businessman who has dealings with Wilson Fisk, a rich executive who is also the criminal leader known as the Kingpin. When Nikolas tries to end his relationship with Fisk, the mobster hires the Irish hitman Bullseye, who has preternatural aim, to kill him. Matt tries to stop Bullseye, but Bullseye ultimately succeeds in killing Nikolas and framing Matt in the process. Elektra vows to exact revenge, while reporter Ben Urich discovers his secret identity. Believing Matt to have done good things for Hell's Kitchen, Urich tells Matt that Bullseye is going after Elektra next.Matt tracks Bullseye, but is attacked by Elektra, who plans to use her own training in martial arts to avenge her father's death. She defeats and injures Matt; when she manages to remove his mask, she discovers Matt's secret identity and innocence. Forced to fight Bullseye alone, Elektra is overpowered and killed by the hitman. A wounded Matt makes his way to a church, where he is looked after by his confidante, Father Everett, who knows his secret identity. After recovering slightly, Matt fights Bullseye, who had followed him to the church. Bullseye discovers that loud noise is Matt's weakness and prepares to kill him with a spiked piece of wood after incapacitating him. Matt blocks the attack and hears an FBI sniper stationed on the neighboring building preparing to fire. As the bullet is fired, Matt moves out of the bullet's path and pulls Bullseye's hands into it. When Bullseye pleads for mercy, Matt throws him from the church's steeple. Bullseye lands on the hood of Urich's car, severely injured but alive.Upon discovering Fisk is the Kingpin and Bullseye's employer, Matt makes his way to Fisk's office. There, Matt and Fisk begin a fierce fight; however, Fisk proves to be a surprisingly powerful combatant due to his size and brute strength, and he dominates Matt for most of the fight. Lying on the floor, Matt questions Fisk as to why he killed the people Murdock loved, including Jack Murdock years before: Fisk replies it was just business, for he had worked under Fallon at the time he killed Jack, and Elektra was \"at the wrong place at the wrong time.\" Angered, Matt regains his strength and breaks Fisk's legs, but refrains from killing him, instead allowing him to be arrested by the police, who have discovered his criminal connections. Before being taken away, Fisk — who had also discovered Matt's secret identity after overpowering him — swears revenge on Matt, who points out that Fisk cannot reveal Matt's secret identity because the humiliation of having been beaten by a blind man will cause him to be perceived as weak by other prison inmates. Having gained closure over his father's murder, Matt returns to his day-to-day routine, and meets Urich one last time, in which Urich assures him he will not publish his article about Matt's true identity.In a mid-credits scene, Bullseye, having been moved to a prison hospital and severely bandaged after his confrontation with Matt, is shown to still have his perfect aim after he impales a fly with a syringe needle and says \"Bullseye.\"","language":"English","box_office":"$179.2 million[2]","cinematography":"Ericson Core","Reboot":"Feige has stated \"there are many more stories to be told with old Hornhead and we'd love to tell them someday.\"[56] Avi Arad has also said that a sequel will begin development once the rights go from 20th Century Fox to Marvel Studios.[62] Director Mark Steven Johnson showed interest in returning to direct with the Born Again storyline, as well as suggesting Mr. Fear as a possible villain.[63]During 2004, Ben Affleck shot a cameo role for the spin-off film, Elektra, at the request of Daredevil co-star Jennifer Garner.[64] In October 2004, Affleck stated he would only return in the lead role if Fox would renegotiate to tell the darker stories of Daredevil, and showed interest in a Kevin Smith graphic novel which included Mysterio, as well as the Born Again storyline.[65] However, in November 2006, Affleck stated that he would never reprise the role, having felt \"by playing a superhero in Daredevil, I have inoculated myself from ever playing another superhero... Wearing a costume was a source of humiliation for me and something I wouldn't want to do again soon.\"[66] Despite this, Affleck would later sign on to portray another superhero, Bruce Wayne/Batman, in Batman v Superman: Dawn of Justice.[67]In July 2006, Michael Clarke Duncan showed interest in returning for the role of the Kingpin, but stated that he would not be willing to gain weight as he felt \"comfortable\" being down to 270 pounds. However, he jokingly showed willingness to change his mind if he was offered $20 million. Duncan suggested that the character is portrayed to have been training a lot in jail in order to become faster in combat against Daredevil, also working as a way to fit his weight loss into the story.[68] Duncan would later go on to reprise his role as the Kingpin in an episode of the animated series: Spider-Man: The New Animated Series.In July 2008, Jason Statham expressed interest in appearing as Daredevil in the future. Statham requested \"just give me the chance, I would love to be Daredevil.\" Frank Miller commented in agreement \"I think he should be Daredevil too.\"[69] In October 2008, 20th Century Fox executive Tom Rothman said \"a Daredevil reboot is something we are thinking very seriously about.\" Rothman added that \"what it really needs is, it needs a visionary at the level that Chris Nolan was. It needs someone, it needs a director, honestly, who has a genuine vision.\"[70] By February 2010, announced 20th Century Fox and New Regency were looking to develop the reboot with News Corp., with Peter Chernin producing and David Scarpa writing the script.[71] On March 15, 2011, it was announced that filmmaker David Slade would be directing the reboot,[72] but he later had to drop out due to other obligations. Fringe writer and producer Brad Caleb Kane was hired to pen the Slade-directed film.[73] On September 3, 2012, Duncan died, precluding him from reprising his role as Kingpin.[74][75]Later, it was announced that should a sequel or reboot not start filming by October 10, 2012, the rights to the Daredevil franchise would revert from Fox back to Marvel. In early August 2012, Fox scrambled to find a replacement for David Slade, who dropped out of the director's chair due to scheduling conflicts. The studio briefly met with Joe Carnahan, for the job—however, Carnahan said on Twitter that his pitch, described as a hard-boiled '70s thriller, had gone up in smoke. Several sources commented that Fox had given up on the reboot, and were prepared to let the rights revert to Marvel and their parent company, The Walt Disney Company.[76] On April 23, 2013, Kevin Feige confirmed that the rights for Daredevil returned to Marvel Studios and Disney, opening the possibility of including the character into the Marvel Cinematic Universe.[77] That speculation was confirmed with the announcement of an original Netflix Daredevil television series, which premiered on the streaming service in April 2015, with English actor Charlie Cox in the title role.[78]","directed_by":"Mark Steven Johnson","narrated_by":"Ben Affleck","production_companies":"Regency Enterprises Marvel Enterprises Horseshoe Bay Productions","daredevil":"Theatrical release poster","release_dates":"February 14, 2003 (2003-02-14)|||||","Production":"In 1997, 20th Century Fox optioned the rights from Marvel Enterprises, and Chris Columbus was chosen to direct the film. In 1998, Marvel was facing bankruptcy. During this time 20th Century Fox allowed the option to expire, so Disney began negotiations in order to acquire the rights. In 1999, the negotiations failed to work out so Marvel set the project up with Sony's Columbia Pictures.[20] During this time, Chris Columbus and Carlo Carlei co-wrote a script together,[21] before Mark Steven Johnson got signed to write the screenplay. By 2000, Sony decided to cancel the project,[20] as the two companies reportedly could not come to an agreement over Internet rights.[22]New Regency entered negotiations with a more satisfying offer, attaining the character rights from Marvel in 2000 to produce the film, with 20th Century Fox handling the distribution.[23] Mark Steven Johnson was rehired and his script was turned in during 2001, which was praised by Ain't It Cool News' Harry Knowles.[20][24] Prior to shooting, producer Gary Foster said that in comparison to other comic book-based films before it, this film would be \"more character-driven ... darker ... edgier,\"[25] while Marvel Studios executive Kevin Feige felt the script was one of the strongest comic scripts Marvel had received.[26]Fox wanted to start filming in Canada in order to save money. This plan was contended by Johnson, and the film's cinematographer, Ericson Core, after they found a preferred area for shooting around downtown Los Angeles' Arcade Building. Core noted that the appeal came from the \"beautiful, old brick buildings and great rooftops,\" which they felt was perfect for a depiction of Hell's Kitchen, Manhattan, in comparison to the studio's choice where the filming would be done in Montreal or Vancouver. Due to their insistence, coupled with Ben Affleck's disinterest in filming in Canada (after having filmed there for his previous film, The Sum of All Fears) they were able to change the studio's mind.[27]When the look of the film was being decided, Mark Steven Johnson opted to use direct scenes from the Daredevil comics. Joe Quesada's artistic take in Guardian Devil (Daredevil vol. 2, #1-#8) was an influence on the film, with Johnson noting that they would \"literally take out a scene from the comic book that Joe did […] Here's Daredevil on the cross, you know, it's that scene from 'Guardian Devil'. You just shoot that.\"[7] Throughout the film, Ben Affleck had to wear \"cataract milky-blue\" contacts, which would effectively make him blind. This was considered great by Johnson, as it would aid his performance.[28]The sound plays an integral part in the film, as the superhero relies on it in order to form his 'sonar sense'. Post-production sound was done by supervising sound editor John Larsen and sound designer Steve Boeddeker and is heard taking place immediately after Matt's optic nerve is seen mutating. The mutating of the nerve was done by Rhythm and Hues Studios, who also worked on the sonar-sense which became referred to as the \"shadow world\". Shadow world was made using just CGI except in a scene where Elektra and Matt Murdock are in the rain, which was done using CGI over film.[28]The score to Daredevil was written by Graeme Revell, and released on March 4, 2003.[29] He was attracted to the focus of \"human-ness\" on Daredevil, torn emotionally and physically by his superhero status. Avi Arad asked Revell to concentrate more on the emotions of Daredevil and Elektra, while Mark Steven Johnson wanted to stay clear from any gothic and action movie clichés. Revell tried to avoid too much individual motifs but some characters would have an identifiable sound, like Bullseye would have guitar undertones, while Kingpin would have bass beats. Guitarist Mike Einziger of Incubus collaborated with Revell for any additional rock elements. Revell thoroughly enjoyed working with Johnson, describing the director as \"positive\" and \"responsive\" when it came to experimenting (as opposed to feeling \"locked in a box of preconceptions\") which he felt lead to \"cool stuff\". Varèse Sarabande put together the score record.[30]","produced_by":"Avi Arad|Gary Foster|Arnon Milchan|","starring":"Ben Affleck|Jennifer Garner|Michael Clarke Duncan|Colin Farrell|Joe Pantoliano|Jon Favreau|David Keith|","running_time":"103 minutes[1]","music_by":"Graeme Revell","edited_by":"Armen Minasian|Dennis Virkler|","Release":"Aside from expected TV commercials during such TV hits as Friends and Law & Order, as well as one in the second quarter of the Super Bowl, there was also a tie-in with Kraft, an in-store promotion at Wal-Mart, a marketing campaign with Hamilton Watch Company, who designed the watch Matt wears in the film,[31] and a weeklong Daredevil segment on Entertainment Tonight.[32] As part of an online form of marketing, a viral e-mail drive was started, where participants would be entered in a contest where they could win prizes such as Daredevil T-shirts, Game Boy Advance games, and cufflinks. To enter the drawing, the user had to book tickets for the film online, then pass an e-mail on to someone else. The idea was to encourage online ticket booking, which at the time was seen as a growing trend.[33] The Game Boy Advance game was released on February 14, 2003, and was created by Encore, a subsidiary of Navarre Corporation.[34] The soundtrack to the film, Daredevil: The Album, was released in February 2003.[35]Due to the film's violent scenes, the Film Censorship Board of Malaysia banned Daredevil in that country. 20th Century Fox unsuccessfully appealed to Malaysia's censorship board to change its decision, hoping to release the film in Malaysia on February 27, 2003. The deputy prime minister told the press films were banned if containing what the board felt was \"excessive violence and sexual material or elements which can create chaos in the community\".[36]The film opened theatrically on February 14, 2003, on 3,471 screens in North America[20] and took first place in its opening weekend, grossing $45,033,454. At the time, it became the second biggest February release, behind Hannibal.[37] By the second weekend the film saw a 55.1% decline in takings but managed to maintain the number one spot, beating new release Old School by $639,093.[38] By the third weekend release, Daredevil saw a further 38.5% drop in sales, and so fell to third place at the box office.[39] The film grossed over $102 million in North America, and over $76 million in the rest of the world, totalling the film's worldwide takings at just over $179 million, grossing over double its budget of $78 million.[2] Avi Arad addressed the top spot success by saying \"we are five for five with record-breaking box office successes [with Blade, X-Men, Blade II then Spider-Man] and have two more Marvel releases slated for this summer [which are X2: X-Men United and Hulk]. It's a testament to the broad appeal of these characters before mainstream audiences outside of the core comic fans. These super heroes have been successful within the Marvel pantheon for decades; it only makes sense that their translations to the big screen are just as fruitful.\"[40]Daredevil received mixed reviews from critics. The review-aggregation website Rotten Tomatoes reported that 44% of critics gave the film positive feedback, based on 221 reviews, with the critical consensus reading, \"While Ben Affleck fits the role and the story is sporadically interesting, Daredevil is ultimately a dull, brooding origin story that fails to bring anything new to the genre.\"[41] On the website Metacritic the film has an average score of 42 out of 100, based on 35 critics, indicating \"mixed or average reviews\".[42]Film critic Roger Ebert of the Chicago Sun-Times gave the film 3 out of a possible 4 stars and called the film good, despite noting the almost typical superhero background. Of the actors, he stated that Ben Affleck and Jennifer Garner were suitable for their roles, while Michael Clarke Duncan's presence alone was menacing. He said, \"I am getting a little worn out describing the origin stories and powers of superheroes […] Some of their movies, like this one, are better than others.\"[43] The Houston Chronicle's Bruce Westbrook considered it \"the best Marvel movie to date, it's as well-written and character-driven as some of today's Oscar contenders, and its story doesn't stall with hollow flamboyance.\"[44] The Austin Chronicle's Kimberly Jones praised the film, the actors, and felt that though an unproven director, \"Johnson has just signed his meal ticket with this marriage of big brains, big brawn, and–most happily–big heart.\"[45]Empire's Kim Newman gave the film 3 out of 5 stars, and felt people \"will like the characters more than the film,\" before adding that there are enough strong moments to guarantee a good viewing.[46] The Guardian's Peter Bradshaw stated that the film held \"unconvincing touches\" but was more enjoyable than Spider-Man and as dark as Tim Burton's Batman.[47] BBC film critic Nev Pierce believed the film had spectacular set-pieces, but felt there was no strong narrative arc to keep the viewer interested.[48] The Wall Street Journal's Joe Morgenstern considered the film to be neither original nor great but felt it maintained \"many grace notes and interesting oddities.\"[49] The Globe and Mail's Rick Groen said the film was \"not woeful, not wonderful, merely watchable.\"[42] The Philadelphia Inquirer's Steven Rea thought the film brought a variance of humor and violence, but felt it didn't work as well as it could have.[42] James Berardinelli felt it was merely a satisfactory superhero film.[42] TV Guide's Frank Lovece said Daredevil \"makes clear that superhero films are the next evolutionary generation of action movies: Now that Schwarzenegger-styled heroes have upped the action ante as far as the human body can go and remain even marginally believable, it's up to superheroes ...to take it further.\" He also felt it was \"a movie for grown-ups, not kids.\"[50]Particularly negative reviews included that of The New York Times' Elvis Mitchell, who said the film was \"second-rate and ordinary,\"[41] while Variety's Todd McCarthy considered it \"a pretender in the realm of bona fide superheroes.\"[51] Entertainment Weekly's Owen Gleiberman gave the film a \"C-\", criticizing the story as \"sloppy\" and \"slipshod\", saying, \"Daredevil is the sort of half-assed, visually lackadaisical potboiler that makes you rue the day that comic-book franchises ever took over Hollywood.\"[52] Time Out's Trevor Johnston praised Ben Affleck, feeling he \"persuades us of the pain of sightlessness and supersensitive hearing,\" but also felt writer/director Johnson's construction fails all involved in the film.[53] Slate's David Edelstein believed Johnson copied a lot of Batman, and concluded by saying \"that's not so bad: The movie looks best when it looks like other, better movies.\"[54] The Chicago Tribune's Michael Wilmington thought the film grabs the attention, but felt it does not reward it.[42] The New York Post's Lou Lumenick panned the film, describing it as a \"mind-numbing, would-be comic-book franchise, which often seems as blind as its hero -- not to mention deaf and dumb.\"[42] Character co-creator Stan Lee himself felt, \"[T]hey just wrote the whole thing wrong. They made him too tragic.\"[55] Ben Affleck won the Golden Raspberry Award for Worst Actor for his work in the movie, as well as for Gigli and Paycheck.A director's cut of the film was announced for a spring 2004 DVD release. This version contained new additions like previously unseen footage and a removed subplot, and was to be a bit darker with an R rating. The film, released in 2.35:1 widescreen format, was released with DTS and Dolby Digital sound. The new version of the film has newly recorded commentary to accompany it, featuring Mark Steven Johnson and Avi Arad. A \"Making of Director's Cut\" featurette also accompanied the film. The release date of the DVD was later pushed back to November 30, 2004.[56][57] On September 30, 2008 the director's cut was released on Blu-ray.[58] The DVD release of the director's cut removed the bonus material included on the theatrical cut's DVD release, but that content was restored for the Blu-ray release (although the Blu-ray release only contains the director's cut).One of the biggest changes to the film was the addition of a subplot involving a drug addict played by Coolio. While this subplot was missing from the theatrical version of the film, it is present in the novelization by Greg Cox, published in 2003.[59]Producer Kevin Feige commented on this version of the film, believing \"the people who had other opinions [of Daredevil] will be won over by this new version.\"[56] Reviewers like Empire's Danny Graydon seemed to reaffirm this opinion by considering this version a \"considerable improvement on the original version,\" notably preferring the more violent undertones, a lesser focus on the romance, and the equal focus of Daredevil and his lawyer alias Matt Murdock and the subplot involving Coolio. Some critics continued to feel Affleck was unsuitable as Daredevil and that Duncan portrayed the Kingpin in an over-the-top manner.[60] IGN's Jeff Otto and Andy Patrizio also deemed this version an improvement over the original. They felt this version was more loyal to the Frank Miller feel of the Daredevil world, with more focus on themes such as Murdock's struggle with his Catholic upbringing. On the whole they felt the film would be far more pleasing to the fans, and overall better than the theatrical release.[61]","budget":"$78 million[2]"}