{"country":"United States","distributed_by":"Paramount Pictures","Plot":"The film opens with a pre-taped sketch depicting a scene from Murphy's childhood. At a family Thanksgiving in 1968, the children take turns showing their talents to the assembled relatives (including one played by Murphy himself). Young Eddie (Deon Richmond) shocks the family with a rude joke about a monkey and a lion.After emerging on stage for the live show, Murphy begins by discussing the angry reactions of celebrities parodied in his previous stand-up show, Delirious, specifically Mr. T and Michael Jackson, as well as homosexual viewers offended by his jokes about \"faggots.\" Murphy then narrates a phone call he received from Bill Cosby chastising him for using profanity on stage. Angered by Cosby's assumption that his entire act was nothing but \"filth flarn filth,\" Murphy calls Richard Pryor for advice. Pryor declares that his only concerns should be making audiences laugh and getting paid, and recommends that he tell Cosby to \"Have a Coke and a smile and shut the fuck up.\" Murphy elaborates on his admiration for the \"raw\" comedy of Pryor, running through a routine from his own teenage years about defecation, in Pryor's voice. He then goes on to talk about how people who don't speak English only pick up the curse words in his act, and shout them at him on the street.Next comes a lengthy routine about dating and relationships. Murphy explains that the rise of deadly sexually transmitted infections has motivated him to seek marriage, but the divorce of Johnny Carson and Joanna Holland (in which she sought 50% of his assets) has left him paranoid about the financial risk of marriage, concluding that \"no pussy is worth $150 million.\" He mocks the aggression and materialism of American women (compared to the meekness of Japanese women), referring to the popularity of Janet Jackson's song \"What Have You Done for Me Lately.\" He jokes that he intends to go deep into Africa to find a \"bush bitch\" who has no concept of Western culture... at least until American women convince her to stand up for herself and demand \"HALF!\" This develops into a broader warning to men to avoid \"the pussy trap,\" and a warning to women that men never remain faithful — once a man has evoked a powerful orgasm from a woman (\"ooohhhh!\") she will tolerate all kinds of misbehavior, although she may pursue infidelity of her own.The next segment narrates a childhood memory of his mother promising to cook him a hamburger \"better than McDonald's,\" only to produce a disgusting \"welfare burger,\" a lump of beef filled with onion and green peppers on Wonder Bread (while the neighborhood children show off their McDonald's hamburgers in a callback to the ice cream segment of Delirious).Murphy then talks about white people out on the town, criticizing their embarrassing dance moves and building to a bit about fighting in a discotheque with an Italian-American man who had just watched a Rocky film, eventually starting a large-scale brawl after which \"everybody sued me\" for millions of dollars.After the fight, Murphy calls his parents, leading to a long impression of his drunken stepfather (another callback to a popular bit from Delirious). This final segment runs for over 10 minutes and incorporates his stepfather's habit of misquoting Motown songs (including \"Ain't Too Proud to Beg\", which opened the film).","language":"English","Reception":"The film was met with critical acclaim, with critics praising Eddie Murphy's stand-up routine.[4][5]","box_office":"$50,504,655[2]","eddie_murphy_raw":"Theatrical release poster","cinematography":"Ernest Dickerson","production_company":"Eddie Murphy Productions","directed_by":"Robert Townsend","release_dates":"November 25, 1987 (1987-11-25) (United Kingdom)|December 18, 1987 (1987-12-18) (United States)||||","produced_by":"Robert D. Wachs Keenen Ivory Wayans","starring":"Eddie Murphy|","running_time":"93 minutes","Records":"The film contained the word \"fuck\" 223 times,[3] setting the record for highest \"fuck count\" ever in a feature-length, theatrically-released film at the time (surpassing Scarface). Raw held the record until 1990 before being surpassed by Goodfellas.","edited_by":"Lisa Day","written_by":"Eddie Murphy (Stand-Up) Eddie Murphy Keenen Ivory Wayans (Opening Sketch)","budget":"$8 million[1]"}