{"directed_by":"Ian Coughlan","country":"Australia","Plot summary":"The story starts in sequence with 16-year-old Alison Findlay (Samuel) and her two friends playing a seemingly innocent ouija board game. Upon contacting a spirit, who is later revealed to be Alison's dead father (she never knew her actual parents), the girls discover that Alison is in danger. The spirit then possesses one of the girls and warns her not to return home for her 19th birthday. The girl is immediately killed after a bookcase collapses onto her.Less than three years later, Alison and her boyfriend Pete (Brown) return to her homeplace to celebrate her 19th birthday with her Uncle Dean (Bluthal) and Aunt Jenny (Brooke)- who raised her after her parents died in car crash when she was just a newborn baby. Her homecoming, quite franky, is not exactly what she expected as she makes a strange discovery in their backwoods and has disturbing nightmares. Even stranger, is her Grandmother Thorn- who she meets for the first time. Her relatives soon take a disliking to Pete, and attempt to prevent him from seeing Alison. However, he is persistent and simply will not stop coming to see their niece. In a desperate attempt to keep Alison away from him, they regularly drug her and she becomes \"ill\". In order to get Pete to believe them, they have a false doctor(Ball) come over and pretend to diagnose her. He prescribes that Alison stay at home and avoid leaving. Later that night, Pete breaks into their house and tries to rescue her. However, as they are leaving, the doctor and her Uncle Dean and subdue and drug the both of them. As a side effect to the drug, they are able to convince Alison into lying and informing the police that Pete (a pestering, frightening ex-boyfriend) will not leave her alone. He is then arrested and charged with attempted-kidnapping and breaking of an entry. Yet, the next morning he is released on bail. After researching several newspaper clippings and briefly studying Celtic occult, he determines that her aunt and uncle (along with the doctor and other relatives) plan to forcibly sacrifice Alison for a demonic female spirit called \"Mirna.\" Mirna's soul is in manifested in Grandmother Thorn's body. As Ms. Thorn is aging quickly and Alison is in her youth, they plan to switch bodies between the two. It is revealed that this ritual has been practised for over 200 years.When it is time for Alison's birthday party, Pete desperately tries to save Alison. But upon arrival, he discovers that he is too late and that Mirna has possessed Alison. Mirna shoots Pete, killing him instantly. When Alison wakes up, she realizes what has transpired and the films ends with her screaming.","release_dates":"1981 (1981)|||||","Production":"The film was shot over three weeks in January and February 1979.[1]","starring":"Joanne Samuel","language":"English","Reception":"The film generally received \"fair\" reviews. However, some critics cited the project as being \"cheap and horrid\", and that \"anyone attempting to see a good horror flick should avoid this film.\" However, the film was nominated for various Australian movie awards- including one for \"Best Performance For a Male\" for Vincent Ball.","written_by":"Ian Coughlan","cinematography":"Kevin Lind","budget":"AU$300,000[1]"}