{"based_on":"Billy Bathgate  by E.L. Doctorow","country":"United States","distributed_by":"Buena Vista Pictures","Plot summary":"Billy Behan is a poor teenage boy from the Bronx. One day he catches the attention of gangster Dutch Schultz. Changing his last name to Bathgate, after a local street, he goes to work for Schultz's organization, serving mostly as a gopher for Schultz. Billy is present when Schultz murders his former partner Bo Weinberg, who Schultz believes betrayed him. Schultz then begins a relationship with Weinberg's beautiful, married, girlfriend, Drew Preston.Facing legal charges in a court in upstate New York, Schultz brings Billy and Drew along. He successfully charms the locals, presenting himself as charming and good natured. While his boss Dutch stands trial, Billy's job is to watch over Drew. His loyalties to Schultz are tested as he begins falling in love with the flirtatious Drew. Realizing that Drew is about to be killed, Billy calls her husband, who hurries to town and takes her home before Schultz's men can make their move.Having beaten the rap in court, Dutch is indicted again on federal tax evasion charges. He wants to have federal prosecutor Thomas Dewey murdered, but his request is rejected by the Mafia Commission. Schultz sends Billy to another gangster with some bribe money, but the effort is rejected. When Billy returns with the bad news, he and Schultz have a falling out and Billy is fired by Schult'z associate Otto, who lets him keep the bribe money as a severance package. As Billy leaves, he is abducted and beaten by gangsters working for Lucky Luciano. The men storm Dutch's hideout and kill everyone inside. Billy is taken before Luciano, who warns him that he knows where Billy's family lives, before letting him go.","screenplay_by":"Tom Stoppard","language":"English","Reception":"The movie received mixed reviews.[1][2][3] It has a \"Rotten\" rating of 47% on Rotten Tomatoes.[4]The movie debuted at No. 4[5] and underperformed against its $48 million budget.The film received a nomination for the Golden Globe Award for Best Supporting Actress – Motion Picture (Nicole Kidman).","box_office":"$15,565,363","cinematography":"Néstor Almendros","production_company":"Touchstone Pictures","directed_by":"Robert Benton","billy_bathgate":"Original Theatrical Poster","release_dates":"November 1, 1991","Production":"The film was shot in Hamlet, North Carolina and Saratoga Springs, New York.","starring":"Dustin Hoffman|Nicole Kidman|Steven Hill|Loren Dean|Bruce Willis|","running_time":"106 minutes","music_by":"Mark Isham","edited_by":"Alan Heim David Ray Robert M. Reitano","budget":"$48 million"}