{"based_on":"Black Christmas  by A. Roy Moore","country":"Canada|United States|","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Glen Morgan","Plot":"William Edward \"Billy\" Lenz, a boy born with severe jaundice due to a liver disease, is constantly abused by his hateful mother. After murdering Billy's father and burying his body in the underground crawlspace with the help of her boyfriend, Mrs. Lenz locks Billy in the attic to prevent him from talking. Years later, she attempts to conceive a new baby but realizes that her new man is impotent. She goes up to the attic and rapes 12-year-old Billy. Nine months later, a daughter named Agnes is born and treated like a princess by Mrs. Lenz. When Agnes is eight and Christmas comes around, Billy escapes from the attic and disfigures Agnes by gouging out her eye and taunts his mother, saying \"she's my family now.\" Billy then gruesomely kills his mother and her lover. He is caught by the police eating cookies made out of his mother's flesh, and is sent to a mental asylum.15 years later, on Christmas Eve, Billy, now 35, escapes from his cell and heads off to his former home, now a sorority house. At the Delta Alpha Kappa, Clair (Leela Savasta) is killed in her bedroom. Meanwhile, Megan (Jessica Harmon) begins to hear noises and goes up to the attic to investigate. Upon finding Clair's body in a rocking chair, Megan is attacked and killed. In the living room, the other sorority girls receive a call from a rambling man, who ends the call threatening to kill them.Clair's half-sister Leigh (Kristen Cloke) soon arrives searching for her. When the lights suddenly go out, Dana (Lacey Chabert) goes to check the powers under the house, but encounters the figure and is killed with a gardening tool. The girls in the house receive a call from Dana, and hear a scream. They leave the house to find her, only for Kelli (Katie Cassidy) and Melissa (Michelle Trachtenberg) to discover blood splatters under the house, while Heather (Mary Elizabeth Winstead) and Leigh find Eve (Kathleen Kole) decapitated in her car.Heather and housemother Mrs. Mac (Andrea Martin) immediately flee, but Heather is subsequently killed while inside the car, and Mrs. Mac is stabbed through the head by a falling icicle. When Kelli and Leigh descend to the garage to investigate, Melissa is attacked and killed. Kelli and Leigh then find Lauren (Crystal Lowe) with her eyes gouged out in bed. Kelli's boyfriend Kyle (Oliver Hudson) then arrives, claiming he is not the killer. The three climb to the attic, where Kyle is dragged and stabbed in the head. The killer is revealed to be Agnes, now an adult. Billy, revealed to be a second killer, also makes his way into the attic and both killers close in on Kelli and Leigh, starting a fire. Kelli and Leigh manage to escape and leave Billy and Agnes to burn in the fire.Later, Kelli and Leigh recover at the hospital. While Kelli goes for an X-ray, Agnes appears in the hospital unharmed and kills Leigh by snapping her neck. When Kelli returns to her room, Agnes enters through the ceiling and attacks her as well but Kelli uses the defibrillator and kills Agnes. Moments later, however, Billy immediately enters through the ceiling as well and chases Kelli to the stair-rail, where Kelli ends up pushing Billy off the stair-rail where he is impaled on the tip of a Christmas tree, finally killing him, and Kelli is left to look in shock.","language":"English","Critical reception":"The film holds a 14% approval rating on Rotten Tomatoes, labeled \"rotten\" based on 55 reviews. The site's critical consensus reads: \"A gratuitous remake of the 1974 slasher, Black Christmas pumps out the gore and blood with zero creativity, humor, or visual flair.\"[10] On Metacritic, the film was given an average rating of 22, based on 17 reviews.[11]Sam Adams of the Los Angeles Times wrote, \"Like an ugly tie or a pair of slipper socks, Black Christmas is destined to be forgotten the instant it's unwrapped, gathering dust until the season rolls around again\".[12] Jim Ridley of The Village Voice inputs, \"The product itself isn't so much afterthought as afterbirth – a bloody mess to be dumped discreetly.\"[13] When compared to the original, Desson Thomson of the Washington Post calls it \"a drab, unimaginative remake. [...] The remake neither pays perceptive tribute to the original nor updates it in anything but hackneyed form.\"[14] Joe Leydon of Variety goes on to say, \"[...] there can be no argument regarding the scant merits of its slapdash, soporifically routine remake, suitable only for the least discriminating of gore hounds.\"[15] Jason Anderson of The Globe and Mail wrote, \"Lazy, perfunctory and free of tension, the new version will satisfy neither the admirers of the original nor anyone looking for a gory respite from seasonal good cheer\".[16]Marc Savlov of The Austin Chronicle, however, said, \"This film is an evocative, effective entry into the holiday blood-spray subgenre in its own right. And if it doesn't make your skin crawl ... you probably ate too much Christmas dinner.\"[17] Thompson also praised the acting of several of the lead performers, in particular Katie Cassidy playing Kelli, Michelle Trachtenberg playing Melissa, Mary Elizabeth Winstead playing Heather, Lacey Chabert playing Dana, and Crystal Lowe playing Lauren.[14] Winstead was later nominated for a Scream Award for her portrayal of Heather Lee-Fitzgerald.Horror review website Bloody Disgusting gave the film three out of five stars and wrote that the film should not be compared to the original. The site concluded that the film is \"a pretty good modern slasher\".[18] The Radio Times also gave the film a positive review, giving the film three stars out of five and calling the film a \"cheeky but no less brutal remake.\"[19]","black_christmas":"Theatrical release poster","box_office":"$21.5 million[3]","cinematography":"Robert McLachlan","production_company":"Dimension Films 2929 Productions Adelstein-Parouse Productions Hard Eight Pictures Hoban Segal Productions","directed_by":"Glen Morgan","release_dates":"December 25, 2006 (2006-12-25)|||||","produced_by":"Marty Adelstein|Steve Hoban|Glen Morgan|Dawn Parouse|Victor Solnicki|James Wong|","starring":"Katie Cassidy|Michelle Trachtenberg|Mary Elizabeth Winstead|Oliver Hudson|Lacey Chabert|Kristen Cloke|Andrea Martin|","running_time":"84 minutes[1] 92 minutes (Unrated cut)","Controversy":"The film drew backlash from Christian groups because of the studio's decision to release the film on Christmas Day. Several groups, including Liberty Counsel and Operation \"Just Say Merry Christmas\", called the film \"offensive, ill-founded and insensitive\".[6] L.A. Weekly columnist Nikki Finke also questioned the filmmakers' decision to release the film on Christmas.[7] Dimension Films defended the timing, saying, \"There is a long tradition of releasing horror movies during the holiday season as counter-programing to the more regular yuletide fare.\"[8] Film historian Michael Gurnow, of The Horror Review, countered Liberty Counsel's complaint, writing, \"such crimes occur throughout the year, including Christmas (as recently as a year prior--in McLean and Great Falls, Virginia to be exact).\"[9]","music_by":"Shirley Walker","edited_by":"Chris Willingham","Release":"The film was released on Monday, December 25 (Christmas Day), 2006 in the United States and grossed $3,723,364 on its opening weekend.The film went on to gross a total of $16,273,581 domestically and $21,510,851 worldwide.[3] With its $16 million in domestic box office, Black Christmas is the lowest-grossing film among the recent slasher remakes, which consist of When a Stranger Calls (2006), Halloween (2007), Prom Night (2008), My Bloody Valentine 3D (2009), and A Nightmare On Elm Street (2010), led by Friday the 13th (2009) with $65 million.The film was released on DVD and HD DVD on April 15, 2007 by Genius Products. Two versions of the film were released: the R-rated theatrical cut, and the \"unrated\" cut, which featured extended and deleted scenes. Special features include two documentaries \"What Have You Done? The Remaking of Black Christmas\" and \"May All Your Christmases Be Black\" along with deleted scenes and 3 alternate endings (one of which is the UK ending used in its theatrical release). Although the film has yet to be released on Blu-ray in the U.S. it has received one in Canada and Germany. The film had a short-print run in Canada and only contains the theatrical cut while the German release has both cuts of the film and is region-free.The UK DVD release of the film contains an alternate death scene for Melissa Kitt along with the aforementioned alternate ending from the plot synopsis.The film has made more money from its DVD sales than it did at the box office with a total DVD gross of $29,436,341.[5]","budget":"$9 million[2]"}