{"country":"India","distributed_by":"Shemaroo Video Pvt. Ltd.","screenplay_by":"Nagesh Kukunoor","story_by":"Nagesh Kukunoor","Plot":"Three men are on death row. Jaggu (Jackie Shroff), a lawyer and a poet, is serving a sentence for murdering his wife because she was cheating on him with another man. Nagya (Nagesh Kukunoor), a man angry with the whole world, is arrested for murdering his wife too, but he claims that it was an accident where she falls off the sidewalk while they were in the middle of a heated argument. Ishaan (Naseeruddin Shah), a happy-go-lucky man, is also arrested for murder that he commits while in the act of robbery. The prison's custodian is Mohan (Gulshan Grover), who attempts several methods to reform the prison's inmates. A documentary filmmaker, Chandrika (Juhi Chawla) comes to the jail to set a film about these three men. In the process, she finds redemption to her troubled marriage.","language":"Hindi","Reception":"Noted critic Taran Adarsh found the depiction of the lives of prisoners to be realistic. He speaks high about the well-written script that were enacted and executed well in the film. Adarsh highlights the scene where Chandrika (played by Chawla) confronts her husband to be the best cinematic sequences of that time. While applauding Kukunoor for treating the subject with care, Adarsh felt that the film would only attract intelligent audiences who would choose to watch it on a DVD. In his review, he gives a special mention to Ajayan Vincent's cinematography by saying that the settings looked real.[13] The Hindu, in its review, said:A story that is nevertheless unusual and gripping. But you may not really agree with the way it ends. Touches of irony, in an otherwise grim situation, give this film its element of faint chuckles.[14]The review adds that if the film succeeds commercially, then it is a true triumph for Indian cinema.[14] The review by Rediff.com spoke highly about Kukunoor's strength in dealing with a genre that is not often dealt by Bollywood filmmakers. Vincent's cinematography and the background score of Salim-Sulaiman were regarded highly. The review also appreciates the performance of Naseeruddin Shah by calling him a \"scene-stealer.\"[5] American entertainment weekly, Variety, said in its review that Kukunoor's story, with its twists, would impress an American filmmaking fan of Indian cinema. However the reviewer, Robert Koehler, felt that the climax of the film was \"a desperate, showbiz move to dazzle audiences regardless of how much sense it makes.\"[15] Koehler speaks high about Shah's \"fascinating portrait of the classic trickster archetype.\"[15] His review also highlights Vincent's cinematography to be a distinguishable asset to Kukunoor's fine filmmaking abilities.[15]","box_office":"INR 4,703,000 (India) (15 August 2003) (sub-total)","cinematography":"Ajayan Vincent","directed_by":"Nagesh Kukunoor","release_dates":"1 August 2003 (2003-08-01)|||||","Production":"During the film's premiere at the Kolkata Film Festival, writer-director Nagesh Kukunoor explained his thoughts behind the film's story:I was intrigued by the feelings of a person locked up somewhere. Momentary excitement can ruin you and confine you to a prison for the rest of your life. In my film, the convicts tell their stories to the film-maker, played by Juhi (Chawla). And, at the end, each story links with the others.[4]In another interview before the film's release, Kukunoor spoke about his inspiration from a documentary film on prisoners at the Yerwada Central Jail. After watching this film, he spoke to two ex-convicts who were featured in it. After hearing to their stories, Kukunoor was interested with the premise that a normal person could become a convict so easily.[5] However it took him three years to start writing the script.[6]Kukunoor wrote the script in English initially and named it as Three Walls. But the producer felt that English title would take away potential audience, who would, otherwise, have watched the film.[5]The film was made on a budget of ₹21 million (US$310,000).[7] The budget for this film was comparatively higher than his previous films. Kukunoor reasoned it to cover the cost of three established actors, shooting in a real jail. The post-production was also relatively expensive because of the usage of digital effects and special treatment in shooting prison scenes. Kukunoor also felt that it was important for them to make the film as per international standards because it will reach the crossover audiences.[5] On a certain occasion, Kukunoor said that he has had problems finding funds for making his films. He attributes this problem to sticking out of the stereotype.[6]Unlike in Kukunoor's previous films,[7] this film contains 75% of its dialogues in Hindi because the script demanded it. Since the convicts couldn’t possibly speak in English, it was imperative for the dialogues to be written in Hindi.[5]The film has a background score alone. Unlike other Bollywood films which contain songs that are lip-synced by the actors, Kukunoor felt that songs can interfere with the narrative of the film. Although he chose to use songs in Rockford (1999) and Bollywood Calling (2001), he went against using them in this film.[5]Apart from Bollywood Calling, which featured veteran actor Om Puri, Kukunoor's previous films such as Hyderabad Blues (1998) and Rockford did not feature mainstream actors. In this film, Kukunoor felt it exciting to cast and work with several established actors such as Jackie Shroff, Naseeruddin Shah and Juhi Chawla. While writing the script for the film, Kukunoor kept Chawla in mind for the character of Chandrika. He did so because he wanted Chawla's \"naive honesty\" to be fashioned into the character. Though Chawla was typecast in light-hearted roles in her acting career, Kukunoor chose to go against the norm by casting her in a serious role.[5]The rest of the characters were cast after the completion of the script. Kukunoor did not have to convince the actors for agreeing to be cast in this film. He only depended on his script.[6] Although the character of Ishaan was initially written to be that of a man in his thirties, he could not find a suitable actor during the casting stage.[5]During the filmmaking, Kukunoor's experienced contrasting working styles of the actors. While Shroff preferred specific instructions from him, Shah came to him with very specific ideas. Kukunoor was full of praise for Chawla because of her suggestions during the shooting.[6]Because the script demanded prison setting, the production team spent several days in search of a right prison. Luckily for them, they found a defunct Musheerabad Jail in Hyderabad which was soon to be demolished. After obtaining a local court's order to stay the demolition for 36 days, the crew worked hard to complete the shoot within two days of the allotted time.[5] Shortly thereafter, the prison area was demolished and in a few months a newly constructed hospital was opened for public access.[8][9]Because of shooting in the prisons, different sections in the film were given separate color treatment.[5] Kukunoor explains this by highlighting the fact that \"in prisons, the only source available to them in the nights is the moonlight. One or two lone bulbs burn here and there.\"[6] To ensure appropriateness of this scene, Kukunoor used shades of grey and blue deliberately.[6]","produced_by":"Metalight Productions (Elahe Hiptoola Sanjay Sharma)","starring":"Juhi Chawla Nagesh Kukunoor Naseeruddin Shah Jackie Shroff Gulshan Grover Ranganath","running_time":"115 min","music_by":"Salim-Sulaiman","edited_by":"Sanjib Datta","Release":"In November 2002, the film premiered at the Kolkata Film Festival.[2] After having been screened at the Indian Film Festival of Los Angeles, where it was well received, the film was screened at the Commonwealth Festival at Manchester, where it was the gala presentation and it was nominated as one of top five films the festival's audience loved. At a special screening in Mumbai's Sterling Cinema a few days before its commercial release, 800 attendees gave the film a standing ovation. A similar response was seen at a New Delhi theatre while the film was being screened as a part of the CineMaya Film Fest. The response from the initial screening prompted the organizers to include an additional screening to the festival itinerary.[10]The film was to have its commercial release immediately after the screenings at different film festivals in November 2002. However it got delayed because the producers took time in trying to coordinate a simultaneous release in Indian and the international markets.[5]A few days prior to its commercial release, the film was promoted using brochures. Though a relatively expensive approach when compared to press releases or calendars, publicity was conducted through brochures. The film competed at the box office with Mumbai Se Aaya Mera Dost, Koi... Mil Gaya, Gangaajal and Pinjar.[11] When compared to other films, this film had little publicity prior to its release.[12]","written_by":"Nagesh Kukunoor","budget":"₹21 million (US$310,000)"}