{"country":"United States","distributed_by":"Paramount Vantage","Plot":"The film centers on two main characters: Lazarus Redd (Samuel L. Jackson), a deeply religious farmer and former blues guitarist, and Rae Doole (Christina Ricci), a young sex addict. Lazarus' wife and his brother were having an affair, which has left him bitter and angry. Rae's boyfriend Ronnie Morgan (Justin Timberlake) leaves for deployment with the 196th Field Artillery Brigade, Tennessee National Guard, and in his absence, she indulges in bouts of promiscuity and drug use. During one of Rae's binges, Ronnie's friend Gill Morton (Michael Raymond-James) tries to take advantage of her. She laughs at his advances, comparing him unfavorably with another man, and he severely beats her. Believing she's dead, Gill dumps Rae and leaves her for dead in only a shirt and panties by the side of the road and drives away.Lazarus discovers Rae unconscious in the road the next morning and brings her home to nurse her back to health. Lazarus goes to see Tehronne (David Banner) - the man who Lazarus thought had beaten her - and learns of her promiscuity. Over the course of several days, Rae, delirious with fever, occasionally wakes up and tries to flee from Lazarus. He chains her to the radiator to keep her from running away. After Rae regains her wits, Lazarus announces that it is his spiritual duty to heal her of her sinful ways and refuses to release her until he does so. Rae makes several attempts to escape, and even briefly has sex with a teenage boy who helps out on Lazarus' farm.She eventually comes to tolerate her position. Lazarus buys her a conservative dress to wear, plays the guitar for her, and feeds her home-cooked meals. Lazarus' pastor and close friend, R.L. (John Cothran, Jr.), visits Lazarus at his house and discovers that Lazarus is imprisoning Rae. The pastor tries to reason with Lazarus and the group shares a meal.Meanwhile, Ronnie returns to town after being discharged from the National Guard due to his severe anxiety disorder. While searching for Rae, who has disappeared, he meets Gill, who informs him that Rae cheats on him whenever he is out of town. Ronnie attacks Gill, steals his truck, and continues searching for Rae.In the morning, Lazarus frees Rae, having decided that he has no authority to pass judgment on her. Rae chooses to stay with Lazarus of her own will. Later, Rae and Lazarus take a trip into town, where Rae confronts her mother (Kim Richards) about the sexual abuse she suffered at the hands of her mother's partner. Meanwhile, Lazarus has formed a budding romance with the local pharmacist, Angela (S. Epatha Merkerson). He plays a blues concert at a local bar, which Rae attends. Ronnie spots Rae and follows her to Lazarus' house. He confronts the pair with a pistol, but Lazarus talks him down and summons the pastor. Ronnie and Rae decide they are stronger together than apart and get married. While driving away, Ronnie suffers from a panic attack again and Rae begins to have one of her spells, but then they pull themselves together, and resolve to take care of each other.","language":"English","Reception":"Reviews for the film were mixed.[9] As of August 18, 2011, Rotten Tomatoes reported a 66% \"Fresh\" rating based on 157 reviews, with an average rating of 6.4 out of 10[10] while Metacritic awarded the film an average rating of 52 out of 100 based on 34 reviews.[9]On the television program Ebert & Roeper, filmmaker Kevin Smith, filling in for Roger Ebert, described the film as the best of the year thus far. Smith praised Ricci and Jackson, saying this was Ricci's best performance and Jackson's best performance since Pulp Fiction (1994). Richard Roeper also gave the film a \"thumb up\" rating. Matt Glasby of Film4, however, awarded the film only 1 star out of 5, calling it a \"pressure-cooked mess\" that was \"bad enough to make gums bleed\".[11]The film was also criticized by feminist activists for its portrayal of sexualized violence.[12]Peter Travers of Rolling Stone declared the film the year's Worst Soft-Core Sex on his list of the Worst Movies of 2007.[13]During its March 2–4, 2007 opening weekend in the US the film earned $4 million, putting it in eighth place behind films including other new releases Wild Hogs and Zodiac.[2][14]","box_office":"$10,903,846[2]","cinematography":"Amy Vincent","production_company":"New Deal Productions Southern Cross the Dog Productions","Marketing":"In April 2008, Ricci commented on the promotional poster for the film, criticizing it as exploitative of women:","directed_by":"Craig Brewer","Soundtrack":"Black Snake Moan was released January 30, 2007 by New West Records featuring various artists including four tracks performed by Jackson himself. The 17 tracks cover classic to modern blues.Glenn Gaslin at Moving Pictures Magazine briefly reviewed and praised the album: \"It should make anyone who loves the blues, er, happy.\"[16] Chad Grischow at IGN reviewed the album at length, concluding with, \"The album does an excellent job at capturing the sweaty underbelly of the southern blues scene, and is a recommended listen, even if not for the reasons you originally picked it up.\"[17] Samuel Flancher, writer of the extensive text Make My Snake Moan: 200 Haikus in Appreciation of Black Snake Moan, wrote: \"I love this movie/It has it all, and much more/Oh Ricci my muse.\"On February 16, 2007, Sarah Linn of Sound the Sirens Magazine wrote in her final paragraph,[18]James B. Eldred at Bullz-Eye.com concluded his favorable review with,[19]As of May 20, 2008, Amazon.com ranked the album #8,894 in its music category. When considered within the blues subcategories, it was #91 in Regional Blues and #13 in Delta Blues.[20]","References":"General sources:","release_dates":"December 9, 2006 (2006-12-09) (Butt-Numb-A-Thon)|March 2, 2007 (2007-03-02) (United States)||||","Production":"For the film, Jackson spent six or seven hours a day for half a year learning how to play the blues guitar for several songs he plays throughout the film,[3][4] all of which derive from the repertoire of R. L. Burnside.[5] Ricci wore an actual 40-pound (18 kg) chain during filming[6] and ate only foods of no nutritional value to achieve a sickly appearance.[7] She told Entertainment Weekly that she remained scantily clad even when the cameras were not rolling: \"Sam [Jackson] would be like, 'Put some clothes on!' I was like, 'No, you don't understand. I'm doing something important.'\"[8]","produced_by":"Stephanie Allain|John Singleton|","starring":"Samuel L. Jackson|Christina Ricci|Justin Timberlake|","running_time":"116 minutes[1]","black_snake_moan":"Theatrical release poster","music_by":"Scott Bomar","edited_by":"Billy Fox","Notes":"","written_by":"Craig Brewer","budget":"$15 million[2]"}