{"Cast":"The film also features cameos by Tony Martin, Josh Lawson, Ed Kavalee, Akmal Saleh, James Mathison and Ella Hooper.","country":"Australia","distributed_by":"Roadshow Films","Plot":"BoyTown, the greatest boyband of the eighties and the group that started the boyband phenomenon leave their terrible & bad-paying lives for one last crack at the big time. They return to the stage with slightly older fans and slightly larger pants to complete some unfinished business. These days they spend less time singing about tears, eternity, angels and their 'baby' and more time singing about divorce, shopping and picking up the kids from school & working the nearby Coles, construction site or the nearest radio station in Melbourne (with dinner).As their triumphant tour draws to a conclusion all the personal issues that have been safely buried away for twenty years come bubbling to the surface with explosive consequences. Suddenly the band has to deal with: allegations of infidelity; paternity tests; a miming fiasco; a band member 'outing' himself live on stage; an awards night disaster; solo albums; a mysterious disappearance and a plane journey that will cement the BoyTown legend forever & make them music legends with expert music help.The official BoyTown website features clips from a mockumentary BoyTown Confidential, hosted by Tony Martin as \"Kenny Larkin\", his character from the movie.The mockumentary was supposed to be included in its entirety on the DVD release of BoyTown, but was not included. Mick Molloy's Molloy Boy Productions has commented that it was left out due to lack of post-production funding, however Tony Martin said that he would have paid the estimated $5000 post-production cost as he believed it was one of his finest works. Speculation persists that Molloy thought the mockumentary would upstage the film itself. This has led to an ongoing rift between longtime collaborators Martin and Molloy.[2]","language":"English","box_office":"A$3.1 million","cinematography":"Mark Wareham","directed_by":"Kevin Carlin","Soundtrack":"The soundtrack was released in Australia by Liberation Music on 30 September, featuring vocal performances by Joel Silbersher, Bram Presser, Simon Cleary, Christian Argenti and Julian Argenti as \"BoyTown\", with music by Gareth Skinner, and lyrics by Mick Molloy & Richard Molloy.Track listing:","release_dates":"19 October 2006","Box office":"BoyTown grossed $3,135,972 at the box office in Australia.[3]","produced_by":"Greg Sitch Mick Molloy","starring":"Glenn Robbins Mick Molloy Bob Franklin Wayne Hope Gary Eck Lachy Hulme Sally Phillips Lois Ramsey","music_by":"Gareth Skinner","edited_by":"Angie Higgins","written_by":"Mick Molloy Richard Molloy"}