{"country":"United States","Awards and nominations":"American Film Institute Lists","distributed_by":"Paramount Pictures","screenplay_by":"Daniel Petrie, Jr.","story_by":"Danilo Bach|Daniel Petrie, Jr.|","Legacy":"The film spawned two sequels, both starring Eddie Murphy, in 1987 and 1994. Judge Reinhold also reprised his role of Billy Rosewood for the sequels. The second film met with mixed reviews but was a box office success while the third film was less successful critically and commercially. Faltermeyer's \"Axel F\" was used in both sequels.In 2013, a television series was reported to be in the works for CBS.[24] The pilot was written by Shawn Ryan and directed by Barry Sonnenfeld. Brandon T. Jackson was cast as Axel Foley's son.[25] The series was not picked up, but Ryan reported that it tested well enough for Paramount to put a fourth film into production.[26]","Plot":"Axel Foley is a young, reckless Detroit police detective. His latest unauthorized sting operation goes sour when two uniformed officers intervene, resulting in a high-speed chase through the city which causes widespread damage. This earns him the anger of his boss, Inspector Douglas Todd, who promises to fire Axel if another such incident happens again.Axel arrives at his apartment to find it's been broken into by his childhood friend, Mikey Tandino. Mikey did time in prison, but ended up working as a security guard in Beverly Hills, thanks to a mutual friend, Jenny Summers. Mikey shows Axel some German bearer bonds and Axel wonders how he got them, but chooses not to question him about it. After going out to a bar, they return to Axel's apartment, where two men knock Axel unconscious and then confront Mikey about the bearer bonds. Having beaten Mikey up, they shoot him in the back of the head, killing him.Axel asks to investigate Mikey's murder, but Inspector Todd refuses to allow it because of his close ties to Mikey. Axel uses the guise of taking vacation time to head to Beverly Hills to solve the crime. He finds Jenny working in an art gallery and learns about Mikey's ties to Victor Maitland, the gallery's owner. Axel, posing as a flower deliverer, goes to Maitland's office and tries to question him about Mikey, but is thrown through a window by Maitland's bodyguards and arrested. At the police station he meets Beverly Hills police officers Sergeant John Taggart, Detective Billy Rosewood, and Lieutenant Andrew Bogomil. Bogomil assigns Rosewood and Taggart to follow Axel, and after a series of encounters, including the trio's foiling of a robbery in a striptease bar, the three develop a mutual respect.On the trail of Mikey's killers, Axel sneaks into one of Maitland's warehouses, where he finds coffee grounds, which he suspects were used to pack drugs. He also discovers that many of Maitland's crates have not gone through customs. After Axel is arrested again, this time after a scuffle at Maitland's country club, Bogomil demands to know why Axel is bothering Maitland. Axel finally admits that he suspects Maitland to be a smuggler, but is unsure of what exactly he is smuggling. Bogomil seems to believe Foley's story, but cannot authorize a search because of a lack of hard evidence. In addition, Police Chief Hubbard, who has learned of Axel's ill-advised investigative actions, orders that Axel be escorted out of town. However, Axel convinces Rosewood to pick up Jenny instead and take her with them to Maitland's warehouse, where a shipment is due to arrive that day.Axel and Jenny break into the warehouse and discover several bags of cocaine inside a crate. Before Axel can get this new found evidence to Rosewood, Maitland and his associates arrive. Maitland takes Jenny and leaves Axel to be killed, but after some hesitation, Rosewood enters the warehouse and rescues Foley. Taggart got a hold of Rosewood and Foley on the phone about the warehouse, he orders Foster and McCabe to to check out Maitland's warehouse where the drugs are stored at. Taggart tracks Axel and Rosewood to Maitland's estate, where he joins the two in their efforts to rescue Jenny and bring Maitland to justice. When Bogomil hears reports of shots fired at Maitland's residence, he calls for backup at the location and heads out to join the others. After a firefight that kills most of Maitland's men, Axel kills Maitland's right-hand man Zack, who had killed Mikey. Maitland shoots and injures Axel, then uses Jenny as a shield. Bogomil's arrival distracts Maitland long enough to allow Jenny to break free; Bogomil and Axel then shoot and kill Maitland.Chief Hubbard arrives and Bogomil fabricates a story that covers for all the participants without discrediting the Beverly Hills Police force. Realizing that he will probably be out of a job in Detroit, Axel asks Bogomil to speak to Inspector Todd and smooth things over for him. Bogomil is reluctant, but relents after Axel talks about staying in Beverly Hills.Taggart and Rosewood meet Axel as he checks out of his hotel, and pay his bill. Axel invites them to join him for a farewell drink, and they accept.","language":"English","Reception":"Beverly Hills Cop received critical acclaim upon its release, and is considered by many as one of the best films of 1984.[8][9][unreliable source?] Janet Maslin of The New York Times wrote \"Beverly Hills Cop finds Eddie Murphy doing what he does best: playing the shrewdest, hippest, fastest-talking underdog in a rich man's world. Eddie Murphy knows exactly what he's doing, and he wins at every turn\".[10] Richard Schickel of Time magazine wrote that \"Eddie Murphy exuded the kind of cheeky, cocky charm that has been missing from the screen since Cagney was a pup, snarling his way out of the ghetto\".[11] Axel Foley became Murphy's signature role and was ranked No. 78 on Empire magazine's list of The 100 Greatest Movie Characters of All Time.[12] Also, Entertainment Weekly magazine ranked Beverly Hills Cop as the third best comedy film of the last 25 years. According to Christopher Hitchens, the British novelist and poet Kingsley Amis considered the film \"a flawless masterpiece.\"[13]Review aggregation website Rotten Tomatoes retrospectively collected reviews from 41 critics to give the film a score of 83%, with an average score of 7.2 out of 10.[14] In 2003, the film was picked as one of the 1000 Best Movies Ever Made by The New York Times.[15]The film was released on December 5, 1984, and played in 2,006 theaters.[3] It debuted first at box office, making $15,214,805 in its first five days of release. Thanks to word of mouth, the film generated higher revenue in the weeks following the first week, with the highest one being in its fourth week of release, when it grossed $20,064,790 in five days. It stayed #1 for 14 non-consecutive weeks and tied Tootsie for the films with the second most weeks at #1 (the first is Titanic).[16] The film earned approximately $234,760,478 domestically and became the highest-grossing film of 1984.[17] It also became the highest-grossing R rated film of all-time, a rank it would hold until The Matrix Reloaded in 2003 (adjusted for inflation, Beverly Hills Cop is the third highest-grossing R rated film of all-time behind The Exorcist and The Godfather).[18] The film was also the second highest-grossing film worldwide in 1984, behind Indiana Jones and the Temple of Doom.[citation needed] Box Office Mojo estimates that the film sold over 67 million tickets in the US.[19]","box_office":"$316.4 million[3]","cinematography":"Bruce Surtees","directed_by":"Martin Brest","Soundtrack":"The soundtrack for Beverly Hills Cop won a Grammy Award for Best Score Soundtrack for Visual Media (1986). The instrumental-only title tune, \"Axel F\", is a cultural touchstone and has since been covered by numerous artists. The soundtrack was mastered by Greg Fulginiti, and featured different artists plus electronic style music.The soundtrack was released on MCA Records, successor-in-interest to Paramount's old record division, the Famous Music Group (specifically Paramount Records).","beverly_hills_cop":"Theatrical release poster","production_companies":"Don Simpson/Jerry Bruckheimer Productions The Murphy Company","release_dates":"December 5, 1984 (1984-12-05)|||||","Production":"In 1977, Paramount executive Don Simpson came up with a movie idea about a cop from East Los Angeles who transferred to Beverly Hills.[4] Screenwriter Danilo Bach was called in to write the screenplay. Bach pitched his idea to Simpson and Paramount in 1981 under the name Beverly Drive, about a cop from Pittsburgh named Elly Axel.[4] However, his script was a straight action film and Bach was forced to make changes to the script, but after a few attempts the project went stale.[4] With the success of Flashdance (1983), Simpson saw the Beverly Hills film as his next big project.[4] Daniel Petrie, Jr. was brought in to rewrite the script and Paramount loved Petrie's humorous approach to the project, with the lead character now called Axel Elly, from Detroit.[4] Producer Jerry Bruckheimer claimed that the role of Axel Foley was first offered to Mickey Rourke, who signed a $400,000 holding contract to do the film. When revisions and other preparations took longer than expected, Rourke left the project after his contract expired, to do another film.The script was then sent to Sylvester Stallone, who gave the script a dramatic rewrite and made it into a straight action film.[4] In one of the previous drafts written for Stallone, the character of Billy Rosewood was called \"Siddons\" and was killed off half-way through the script during one of the action scenes.[5] Stallone had renamed the lead character to Axel Cobretti with the character of Michael Tandino (James Russo) being his brother and Jenny Summers (Lisa Eilbacher) playing his love interest. Stallone has said that his script for Beverly Hills Cop would have \"looked like the opening scene from Saving Private Ryan on the beaches of Normandy. Believe it or not, the finale was me in a stolen Lamborghini playing chicken with an oncoming freight train being driven by the ultra-slimy bad guy.\"[4] However, Stallone's ideas were deemed \"too expensive\" for Paramount to produce and Stallone ultimately pulled out two weeks before filming was to start. Two days later, the film's producers, Simpson and Bruckheimer, were able to convince Eddie Murphy to replace Stallone in the film, prompting massive rewrites.[6] Besides Stallone and Rourke, other actors who were considered for the role of Axel Foley included Richard Pryor, Al Pacino, and James Caan.[7]","produced_by":"Don Simpson|Jerry Bruckheimer|","starring":"Eddie Murphy","running_time":"105 minutes[1]","music_by":"Harold Faltermeyer","edited_by":"Arthur Coburn|Billy Weber|","budget":"$15 million[2]"}