{"country":"Argentina","language":"Spanish","Reception":"The approach of hiring well known performers ensured that devotees of popular theater and of radionovelas would form a ready audience for sound films. Luis Sandrini, who played \"the poor kid from the barrio, immature and insecure,\" became the first Argentine film star.[13] However, ¡Tango! had poor sound quality, which made it less successful than it should have been given its star-studded cast.[12][b]","Synopsis":"¡Tango! follows a formula established by Carlos Gardel with films such as Luces de Buenos Aires (The Lights of Buenos Aires, 1931) in which a melodramatic story is interspersed with tango songs.[1] However, the film had less dialog and more music, making it more like a musical revue. This format would be copied by many subsequent films.[2]The plot is derived from tango songs.[3] Many of these songs tell of the seduction of an innocent slum girl by a rich man who promises her a glamorous life, but who abandons her when her looks fade.[4] The stylized and sentimental plot of ¡Tango! revolves around a young man who is abandoned by his girlfriend for an older rich man and is heartbroken. The film follows his misfortunes.[5] The final scene has the hero, dressed as a typical compadrito, singing Milonga del 900.[6] The song, by Carlos Gardel, ends:I love her because I love her and therefore I forgive her. There is nothing worse than rancor to live in bitterness.[7]","cinematography":"Alberto Etchebehere","production_company":"Argentina Sono Film","directed_by":"Luis Moglia Barth","References":"NotesCitationsSources","release_dates":"April 27, 1933 (1933-04-27)|||||","Production":"The 80-minute black and white film was directed by Luis Moglia Barth, who co-wrote the script with Carlos de la Pua.[8] It was Argentina Sono Film's first production.[9] The film showed strong Hollywood influence in its cinematic techniques.[10] It was the first optical sound feature film to be produced in Argentina, at Argentina Sono Film's new optical sound studio.[11][a]The stars included the singer and actress Libertad Lamarque, the stage actor Pepe Arias, the singer Azucena Maizani and the comedian Tita Merello, all well-known theatre or tango performers.[13] The film featured the tango orchestras of Juan de Dios Filiberto, Osvaldo Fresedo and Pedro Maffia.[9] ¡Tango! was released in Argentina on 27 April 1933.[8]","starring":"Libertad Lamarque, Pepe Arias and Tita Merello","music_by":"Roberto Firpo, Homero Manzi, Sebastián Piana, Rodolfo Sciammarella and Freddy Scorticati","¡tango!":"Poster for the film","written_by":"Luis Moglia Barth and Carlos de la Pua"}