{"based_on":"Characters  by Danilo Bach and Daniel Petrie, Jr.","country":"United States","distributed_by":"Paramount Pictures","Critical response":"In an interview in 1994, Eddie Murphy said that Beverly Hills Cop III is \"different from the trilogy's first installment because Axel is more mature and no longer the wisecracking rookie cop.\"[10]In a 2005 interview, Landis claimed that Murphy worked against the comedy of Beverly Hills Cop III. Landis said that the film \"was a very strange experience\" [11]In an interview with The A.V. Club in 2009, Bronson Pinchot claimed that Eddie Murphy \"was really depressed\" at the time Beverly Hills Cop III was being filmed. Claiming that Eddie Murphy was low-spirited and had a low energy level.[12]Murphy said he thought \"Beverly Hills Cop III was infinitely better than Beverly Hills Cop II.\"[10] He then later claimed during an interview in 2006 on Inside the Actors Studio that he felt the third film was \"atrocious\" and such a disgrace that \"the character was kind of banished for a while [from Hollywood].\" He said he felt the third film did not reveal enough of the \"edginess\" of Axel that was present in the first two films. He also said he hopes to return the edgy qualities to the character when he reprises the role next time, and is going to pay more attention to the development of the project and its quality.The film was criticized harshly. Based on the criticism, the film was nominated for two Golden Raspberry Awards, for Landis as Worst Director and the film as Worst Remake or Sequel. Beverly Hills Cop III currently holds a 10% rating on Rotten Tomatoes based on 49 reviews.[13] Metacritic, which assigns a normalized score, rated it 16/100 based on 15 reviews.[14] Richard Natale of Variety called it \"a return to form by Eddie Murphy\" that \"runs out of steam before the end\".[15] Caryn James of The New York Times wrote that the film is designed to be a foolproof and safe money-maker, but Murphy plays Foley too straight.[16] Owen Gleiberman of Entertainment Weekly rated it D- and called Murphy's performance joyless and depressing.[17]","Plot":"One night in Detroit, Axel Foley plans to arrest a gang of car thieves who run a local chop shop. Unbeknownst to his boss, Inspector G. Douglas Todd, Axel has canceled the SWAT team, intending to raid the shop using only his team. Meanwhile, a group of men arrive at the chop shop to pick up a cube van that the car thieves had hijacked. The leader of the group confirms that the vehicle still contains its cargo, which consists of crates labelled as property of the U.S. government, then has his men execute the car thieves.As the murderers are about to leave, Axel, unaware of what has happened inside, proceeds with his plan to enter the shop and quickly finds his team outgunned. Todd, arriving moments later, is fatally shot by the group's leader. As the perpetrators escapes in the cube van, an angry Foley gives chase in one of the partially disassembled cars from the shop, but is prevented from continuing the chase by Secret Service Agent Steve Fulbright. Fulbright informs Foley that the killer must remain on the loose because the federal government is pursuing a larger scheme in which he is involved.After Todd's funeral, Axel learns that several clues left behind by the killers point to Wonder World, a theme park in Beverly Hills, California owned by \"Uncle\" Dave Thorton. Axel arrives in Beverly Hills and reunites with his friend Billy Rosewood, who has been promoted to \"Deputy Director of Operations for Joint Systems Interdepartmental Operational Command\" (DDO-JSIOC), and meets Billy's new partner, Jon Flint. It is revealed that John Taggart is now retired and is living in Phoenix Arizona. Axel asks Flint to call his friend Ellis DeWald, the head of Wonder World's park security, to let him know that he's coming to the park for his investigation.Axel meets and befriends Janice Perkins (Theresa Randle) whilst touring the park's behind-the-scenes facilities. Later, he is spotted by security, shot at and attacked hand-to-hand. Foley retreats to the surface where he cuts in line to enter the Spider Ferris wheel ride. The guards accidentally jam the ride, placing two little kids' lives in danger. Axel rescues them and is subsequently taken to park manager Orrin Sanderson. When DeWald is called in to contest the claim that Axel was attacked by the security men without prior challenge, Axel immediately recognizes DeWald as Todd's killer, but Rosewood and Flint refuse to believe that claim because DeWald is keeping an impeccable public reputation.However, Axel is later visited by Uncle Dave and Janice, who inform him that the Wonder World park's designer and Dave's close friend, Roger Fry, has mysteriously disappeared while inspecting the grounds two weeks ago, leaving only a letter with a cryptic message. He tries to heckle DeWald into revealing his criminal involvements, despite continued admonishments by Agent Fulbright, but DeWald proves too smooth to be caught in a mistake. When Axel later digs deeper into a closed-off section of the park, he finds out that DeWald and Sanderson run a counterfeiting ring that uses Wonder World as a front, and DeWald was at the chop shop in Detroit to get his hands on blank printing paper used for American currency. Axel later meets with Uncle Dave to ask him about further details to find a piece of viable evidence, and thereby discovers that Fry's warning letter is actually written on a sheet of the stolen mint paper. Before he can make use of that evidence, however, Uncle Dave is shot by DeWald, and Axel is framed for his shooting.After getting away from DeWald and bringing Uncle Dave to the next hospital, Axel sets out to prove his innocence by storming the park, calling Rosewood and Flint to assist him. The resulting shootout kills DeWald's henchmen, and after a hand-to-hand fight Axel shoots and kills DeWald. Agent Fulbright appears to explain that he was wrong, but Axel realizes his actual involvement with the counterfeiter and shoots him during a brief struggle. Uncle Dave makes a full recovery, and he thanks Axel for his assistance by creating a new character for Wonder World in his honor, Axel Fox.","language":"English","box_office":"$119.2 million[2]","cinematography":"Mac Ahlberg","production_company":"Eddie Murphy Productions","directed_by":"John Landis","Soundtrack":"A soundtrack containing mostly R&B music was released on May 10, 1994 by MCA Records. It peaked at 158 on the Billboard 200 and 66 on the Top R&B/Hip-Hop Albums. While Harold Faltermeyer did not return to score this film, his co-producer from the previous franchise entries, Keith Forsey, did produce and co-write a new song entitled \"Keep The Peace\", performed by INXS. However, Rodgers covered Faltermeyer's Axel F in a Breakbeat Hardcore version.This is the only film in the series not to feature a song performed by The Pointer Sisters. Beverly Hills Cop had their song \"Neutron Dance\", while Beverly Hills Cop II had their song \"Be There.\" Although \"Neutron Dance\" can be heard in the film's trailer.","release_dates":"May 25, 1994 (1994-05-25)|||||","Production":"During the script's early drafts, the film's plot concerned Foley, Rosewood, and Taggart going to London to rescue Captain Bogomil (Ronny Cox), who was being held hostage by terrorists during an International Police Convention. However, numerous problems such as scripting issues and budgeting caused pre-production to drag out to the point where both John Ashton and Ronny Cox had to drop out due to obligations to other pending film projects. Ashton's part was re-written as John Flint (Héctor Elizondo) and dialogue was inserted to explain that Taggart had retired and moved to Phoenix. Cox's character's absence is never addressed in this film, nor is he mentioned at any point. Both Ashton and Cox have subtle cameos in this film in the form of a picture on Rosewood's desk of Foley, Taggart, Rosewood, and Bogomil on a fishing trip. This is the same picture which also appeared in Beverly Hills Cop II on Bogomil's and Foley's desks.[citation needed] In an interview in 2012, Ronny Cox said, \"They wanted me to be in Beverly Hills Cop III, but...I read the script.\"[4]Among the rejected ideas for Beverly Hills Cop III included a Robert Towne screenplay idea (one in which Foley has to deal with his celebrity cop status), a scenario teaming Murphy with Sean Connery as a Scotland Yard detective, and another Axel-in-London idea where his Scotland Yard counterpart would have been played by John Cleese. The last story would have involved British gangsters loosely based on the real-life Kray brothers, who were captured in Detroit and transported to London by Jeffrey, and Axel would have gone overseas after the gangsters' henchmen broke him out of custody and murdered Jeffrey. This concept was scrapped because producers Don Simpson and Jerry Bruckheimer decided it was too close to the storyline of Michael Douglas' 1989 film Black Rain.[citation needed]When writer Steven E. de Souza was brought in, he originally wrote the story as more \"Die Hard in a theme park\". He was told that each of the rides he had designed would cost about $10 million to build and the whole film would cost about $70 million. When box office results for The Distinguished Gentleman came in, Paramount ordered the budget to be cut to $55 million. Paramount had earlier told Simpson and Bruckheimer that they would only outlay $25 million for a proposed version to be set in New York City, one of the main reasons that the producing team parted ways with the studio. Joel Silver was set to take over producing duties from Simpson and Bruckheimer; however, negotiations on a large budget resulted in production delays leading to Silver quitting production. It was at this time that producers Mace Neufeld and Robert Rehme took on the project. Consequently, the film became more about the investigation and less about the action.[5][6][7][8]Production was temporarily shut down to allow the Paramount top brass the chance to get to grips with the film's spiraling budget. Originally estimated at $55 million, it was soon in excess of $70 million. Of that budget, $15 million was Murphy's paycheck.[9]The theme park featured in the film is California's Great America. However, some modifications were made to the Columbia Carousel and Vortex roller coaster. The park is in Santa Clara, California and not Encino, California as portrayed in the film. Most of the Sky Whirl stunts were filmed in a studio. In this scene, George Lucas has a small part as the man Axel cuts in front of to get on the ride. The tunnels that supposedly ran under the park are a myth as well. Many of the rides seen in the film, including Triple Play and the Sky Whirl, have since been removed. Also, the carousel at the back of the park (a single story one, not the Columbia Carousel) was altered. The single story one was removed for Drop Tower. The ride featured in the rescue scene at the park was Triple Wheel (formerly known as Sky Whirl). Since the film was made, the ride has been demolished and scrapped.The Alien Attack ride featured in the Wonder World theme park was in fact the Earthquake: The Big One portion of the famous back lot tram tour at Universal Studios Hollywood in California. The \"aliens\" featured in the ride are suited actors (and not animatronic as suggested in the film), which closely resemble the Cylons from the original Battlestar Galactica.Director Landis hired the Sherman Brothers to write the \"Wonder World Song\" which appears throughout the film's second half. The song is a comedic take on their own signature song, \"It's a Small World\".Barbet Schroeder made a short appearance as a Porsche driver. Robert B. Sherman also makes a cameo in the film. In the film, he sits next to Arthur Hiller and Ray Harryhausen in a bar when they hear that \"Uncle Dave\" has been shot, a character played by Alan Young and modeled loosely after Walt Disney, the Sherman Brothers' mentor. Richard Sherman was filmed in a cameo as a band leader, but it was cut from the film's final version.","beverly_hills_cop_iii":"Theatrical release poster","produced_by":"Mace Neufeld|Robert Rehme|","starring":"Eddie Murphy|Judge Reinhold|Héctor Elizondo|Theresa Randle|","running_time":"104 minutes[1]","Sequel":"A fourth entry in the series was initially announced for release in the mid-1990s, under the production of Eddie Murphy's own production company \"Eddie Murphy Productions\", though production later fizzled out.[18] It was re-announced in 2006, when producer Jerry Bruckheimer announced his intention to resurrect the film series, though he eventually gave up his option to produce the film, instead passing production duties to Lorenzo di Bonaventura.[19][20] In September 2006 a script, an amalgamation of several earlier drafts, was presented to Murphy who was reported to be \"very happy\" with the outline which was described as an attempt to recapture the \"feel of the original\".[21][22] Murphy admitted one of his motivations for making a fourth Beverly Hills Cop film was to make up for the fact that the third film was \"horrible\" and that \"he didn't want to leave (the series) like that\".[23][24]In May 2008, Rush Hour director Brett Ratner was officially named director, who promised the film would return under the series' standard \"R\" rating, rather than as a rumored watered down PG-13.[25][26] Michael Brandt and Derek Haas were hired as screenwriters to improve on the existing script in July 2008[27] and completed a new script, under the working title Beverly Hills Cop 2009, which would see Foley return to Beverly Hills to investigate the murder of his friend Billy Rosewood.[18] The script was eventually rejected, leaving Ratner to work on a new idea. In an interview with Empire magazine, Ratner stated \"I'm working very hard on the fourth. It's very difficult, especially since there were three before. We're trying to figure out some important things, like where do we start? Is Axel retired? Is he in Beverly Hills? Is he on vacation? Does Judge Reinhold return as the loveable Billy Rosewood? Many questions to figure out, but I'm hoping to have a script before film disappears from our existence.\"[18] Although Murphy himself committed to the project, it was unconfirmed whether the series' other principal actors, Judge Reinhold, John Ashton, Ronny Cox or Bronson Pinchot would also return,[28] though Ratner stated in late 2009 that he was trying to convince Reinhold and Ashton to reprise their roles.[29] Harold Faltermeyer's \"Axel F\", however, would definitely be returning for the proposed fourth installment, with Ratner quoted as saying \"It'll be back but it'll be a whole new interpretation.\"[30] On November 15, 2010, Ratner stated in an interview with MTV that there was still a possibility that they will make a fourth film, but that it wouldn't be \"anytime soon.\"[31]In October 2011, Murphy discussed a possible fourth film, stating, \"They're not doing it. What I'm trying to do now is produce a TV show starring Axel Foley's son, and Axel is the chief of police now in Detroit. I'd do the pilot, show up here and there. None of the movie scripts were right; it was trying to force the premise. If you have to force something, you shouldn't be doing it. It was always a rehash of the old thing. It was always wrong.\"[32]During late Summer 2013, after CBS decided to pass on the TV series, Paramount decided to move forward with the fourth film. On September 13, 2013, Jerry Bruckheimer, stated he was in talks to produce. On December 6, 2013, it was announced that Eddie Murphy will again reprise the role of Axel Foley and Brett Ratner will direct.[33] On May 2, 2014, Deadline announced that screenwriters Josh Appelbaum and Andre Nemec would be penning the screenplay.[34]On June 27, 2014, in an interview with Rolling Stone, Murphy discussed returning to the edgier type character of Axel Foley after years of making family friendly films. \"I haven't done a street guy, working class, blue-collar character in ages so maybe it's like, 'Oh, wow, I didn't remember he was able to do that'\" Murphy said. According to studio reports on the film's plot, Foley will return to Detroit after leaving his job in Beverly Hills and he will be faced with the coldest winter on record to navigate the new rules and old enemies of one of America's most tenacious cities. The state of Michigan approved $13.5 million in film incentives, based on an estimated $56.6 million of filmmaker spending in the state. The film will be shot in and around Detroit and is estimated to provide jobs for 352 workers. The film was originally scheduled for a March 25, 2016 release,[35] but on May 6, 2015, Paramount Pictures pulled Beverly Hills Cop IV from its release schedule, due to script concerns.[36][37]","music_by":"Nile Rodgers","edited_by":"Dale Beldin","written_by":"Steven E. de Souza","budget":"$50 million[2]"}