{"country":"United States","Awards and nominations":"Writer/Director Peter Sattler earned a nomination for a Humanitas Prize in the Sundance category.[31] Casting director Richard Hicks earned an Artios Awards nomination for Outstanding Achievement in Casting — Low Budget Feature — Drama.[32] The Women Film Critics Circle also nominated Kristen Stewart for Best Actress and the film for \"Best Movie about Women.\"[33]","distributed_by":"IFC Films","Promotion and marketing":"The film moved to post-production in late summer 2013. The special effects were edited by Comen VFX.[12] On December 5, 2013, it was announced that the film would premiere on January 17 at the Sundance Film Festival in the US Dramatic Competition category.[1] On July 3, 2014, ten new stills from the film were released.[13] IFC Films released the official trailer on August 8, 2014 on its YouTube channel.[14]Camp X-Ray is rated R by the MPAA for language and brief nude images.[15] The film became available in select theaters and through video on demand services including iTunes Movies and Amazon.com Video starting October 17, 2014.[16] The film was also a selection for the Atlantic Film Festival, Deauville American Film Festival, BFI London Film Festival, Abu Dhabi Film Festival, Leiden International Film Festival, Hof International Film Festival, and the Stockholm International Film Festival.[17]Camp X-Ray premiered with a special screening on October 6, 2014 in New York City.[18]","Plot":"The film begins with the September 11 attacks shown on television when Ali Amir (Peyman Moaadi), a Tunisian living in Bremen, arrives home and begins to perform salah when he is kidnapped and taken to Guantanamo Bay detention camp, specifically Camp Delta.Eight years later, Army Private first-class Amy Cole (Kristen Stewart) is placed as a guard at Guantanamo. Upon arrival, she volunteers to the IRS and is cold towards the detainees, despite her contempt for the facilities handling of detainees. During her stay in the camp, Ali immediately notices Amy. Amy is annoyed by his questioning and ignores his advances, to which he angrily throws his feces at her one day. One night, Amy almost has sex with Corporal Randy Ransdell, who also takes an interest to Amy, but leaves after he is too aggressive.The next day, Amy notices pamphlets to prevent suicide in Ali's cell while he is disciplined for his previous actions. She finds Ali's file and discovers that he has a history of self-harm and discipline, becoming more and more violent as time passed. She begins to interact more with Ali and a relationship forms.Eight months later, Ransdell lies to Amy and orders her to watch Ali shower, violating SOP and Arabic social norms. Upon discovering that Ransdell lied, Amy files a report to her commanding officer, Colonel James Drummond. Drummond talks to Ransdell who makes (unspecified) counter-accusations and both enlisted must attend boards of inquiry (not shown nor later referred to). One night, near the end of Amy's tour at Guantanamo, Ali takes a blade hidden in his Quran and tries to commit suicide, but is talked down by Amy, who tells him her name and where she's from (violations of SOP). At this point, it is clear that her feelings towards the detainee have softened as she is distressed by the possibility of him dying. As Amy leaves Guantanamo teary-eyed, Ali discovers the Harry Potter book he had been hoping for for over two years, finding she had written a note inside.","language":"English Arabic","Reception":"Camp X-Ray premiered at Sundance Film Festival with generally positive reviews, with specific praise of Stewart and Moaadi's performances.[20][21] The review aggregator website Rotten Tomatoes indicates that 75% of 59 film critics gave the film a positive review, with an average rating 6.4 out of 10. The critics consensus states: \"Camp X-Ray's treatment of its subject verges on the shallow, but benefits greatly from a pair of impressive performances from Kristen Stewart and Peyman Moaadi.\"[22]David Rooney of The Hollywood Reporter gave a positive review to the film, calling it \"A somber but cogent drama that uses its setting as a provocative backdrop rather than a debate point\" and praising the lead actors by saying that \"Stewart, delivering perhaps her best screen work to date as an inexperienced military guard, against an equally compelling characterization from Maadi as the long-term detainee who pierces her shell.\"[23] Marlow Stern of The Daily Beast wrote, \"by the end of Camp X-Ray, you're won over by Stewart's layered turn as Cole, and Maadi's as the defiant Ali. It's a role perfectly suited to her strengths—vulnerability and hidden courage—and few young actresses, with the exception of Jennifer Lawrence, can hold a close-up like Stewart.\"[24] Rob Nelson in his review of the film for Variety said that \"Camp X-Ray is most commendable for believably depicting the U.S. military from a female's point of view\" and that \"The two leads (Stewart and Maadi) are excellent and play off each other deftly.\"[25] Scott Mendelson of Forbes wrote, \"Kristen Stewart is engaging and Peyman Moaadi avoids the “noble savage” cliché with ease. The performances are stronger than the film which contains them, but since the picture is mostly a two-hander that’s not entirely a fatal flaw.\"[26] Matt Zoller Seitz of RogerEbert.com gave the film three stars and praised Peter Sattler's direction, as well as Stewart and Maadi. Seitz wrote of Stewart that: \"There are silent film-quality close-ups where you can read every fluctuation in her mood even though she’s barely moving a muscle. This is a true movie star performance.\" Seitz remarked that, \"The relationship between Amy, a strong-silent type, and Ali, a chatterbox provocateur, has a ‘70s-movie feel.\"[27]Xan Brooks of The Guardian gave the film two out of five stars, echoing praise for the acting, saying \"Moaadi (so good as the shifty dad in the A Separation) is suitably anguished as Ali, while Stewart copes well as his pensive prison guard, constantly trying to act more tough than she is. It's a role that reminds us what a fine performer she was in the likes of Into the Wild and Adventureland\", but criticized the film in general, saying \"the supporting players are little more than equal opportunity stereotypes (frothing Islamists; brutish grunts), while the dialogue is a clatter of cookie-cutter exposition, intent on telling us everything but explaining very little\".[28] Eric Kohn of Indiewire criticized the screenplay and direction by saying that \"Sattler's frustratingly on-the-nose screenplay\" and \"It's a powerful assertion about the prospects of being trapped by misguided intentions, which sadly applies to Camp X-Ray itself\" but ultimately praised Stewart's performance.[29] Owen Gleiberman of Entertainment Weekly gave the film a negative review by saying that \"it’s also a flatly made movie\" and said that Stewart was miscast in the role as \"she has no toughness, no moxie, no callouses on her hide.\"[30]","camp_x-ray":"Theatrical film poster","box_office":"$60,581[2]","cinematography":"James Laxton","production_company":"GNK Productions Gotham Group Rough House Pictures The Young Gang","directed_by":"Peter Sattler","Soundtrack":"The soundtrack for Camp X-Ray includes \"Kettering\" by The Antlers from Hospice.[citation needed]. The song \"You There\" by Aquilo is featured in the trailer released by IFC Films.[citation needed]Jess Stroup's original score for the film soundtrack released through iTunes by Lakeshore Records on October 14, 2014.[19]","release_dates":"January 17, 2014 (2014-01-17) (Sundance Film Festival)|October 17, 2014 (2014-10-17) (USA)||||","Production":"On February 6, 2014, IFC Films announced their acquisition of the North American rights to the film.[6] Shooting Stars LLC acquired the rights to distribute the film in the United Arab Emirates. EDGE Entertainment will distribute Camp X-Ray in Denmark, Finland, Norway, and Sweden.[7] The film was distributed in Lebanon and Iraq with an October 30, 2014 release date.Production for Camp X-Ray took place in Los Angeles and Whittier, California.[8] Principal photography began on July 17, 2013 and ended in mid-August.[9][10] The location used for filming the prison scenes was the abandoned Fred C. Nelles Youth Correctional Facility in Whittier, California.[11]","Box office":"The film opened on October 17, showing in one theater in New York City. The film grossed $1,316. The film expanded to three screens in its second week and posted an increase of 134% of $3,480. As of November 9, the film has grossed $9,837.[2] The film also debuted on video on demand and rose to #12 in overall releases on iTunes. Camp X-Ray grossed $50,744 in the United Arab Emirates.[34]","produced_by":"Gina Kwon","starring":"Kristen Stewart|Peyman Moaadi|John Carroll Lynch|Lane Garrison|Joseph Julian Soria|Cory Michael Smith|","running_time":"117 minutes[1]","music_by":"Jess Stroup","edited_by":"Geraud Brisson","written_by":"Peter Sattler","budget":"$1 million[2]"}