{"country":"United States","Awards and nominations":"Cat Chaser was nominated for the Best Film award at Mystfest in 1989.","distributed_by":"Vestron Pictures","Plot":"George Moran is a former American paratrooper and veteran of the Dominican Republic intervention who now runs a small beachfront motel in Miami. While searching for a Dominican woman named Luci Palma who saved his life in 1965 (and gave him the nickname \"Cat Chaser\"), he begins a relationship with Mary DeBoya, the wealthy, unhappy wife of a sadistic former Dominican general. Moran gets involved in a plot by fellow military veteran Nolen Tyner and a former New York policeman, Jiggs Scully, to rip off the general. Moran must elude a number of double-crosses as he and Mary attempt to gain her freedom plus $2 million of the general's money.","cat_chaser":"DVD cover","language":"English","Critical evaluation":"The film received mixed reviews. Variety said: \"Despite a fine cast and atmospheric direction by Abel Ferrara, the pic doesn't quite make the grade, though it certainly is worth a look.\"[4] Entertainment Weekly called the film \"baroquely sleazy\" and said that it failed to make sense.[5] The Roanoke Times described the film: \"Despite some serious flaws, 'Cat Chaser' is one of the better screen adaptations of an Elmore Leonard novel\".[6] Weller was criticized for his \"stiff performance\" by Mick Martin and Marsha Porter in The Video Movie Guide 1995.[7]","cinematography":"Anthony B. Richmond","directed_by":"Abel Ferrara","narrated_by":"Reni Santoni","release_dates":"December 8, 1989 (1989-12-08)|||||","Production":"The film was shot in Old San Juan and Miami and Coral Gables, Florida, as the crew decided shooting on location in Santo Domingo would be too dangerous and costly after scouting there. [1]Filming was not a happy experience for McGillis, who didn't make another major film afterwards for almost a decade. She said in 2001: \"It was the most hateful experience of my life, and I said, if this is what acting is going to be, I will not do it. On the last day of shooting, I said to Abel, 'Are you done with me?' He said, 'Yeah.' I walked in my trailer and shaved my head. I said, 'Screw you, I never want to act again.'\"[2][3]In a 2015 oral history of the making of \"Cat Chaser,\" written by Sam Weisberg of Hidden Films, Peter Weller and various crew members acknowledged that Weller and McGillis openly clashed during filming, though Weller maintained that he never found out the reason for it. Several crew members confirmed that McGillis stormed off the set after shooting a love scene with Weller, though they differed on the exact cause of her outburst. [1]","produced_by":"Peter S. Davis William N. Panzer","starring":"Peter Weller Kelly McGillis","running_time":"90 min.","Home video release":"The film was released on VHS tape in the United States in 1991 by Vestron Video and the UK in 1994 by 4 Front and for the first time on DVD in 2003 by Lion's Gate/Artisan, and issued in the UK in 2004 by Arrow Films. The Lion's Gate DVD featured Weller and McGillis on the cover with the text \"Passion. Greed. Murder. Tonight They Pay,\" with the story marketed as an erotic thriller.","music_by":"Chick Corea","edited_by":"Anthony Redman","written_by":"Elmore Leonard James Borelli"}