{"based_on":"Darby's Rangers: An Illustrated Portrayal of the Original Rangers","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"The US Army has decided to form an elite strike force similar to the British Commandos. Major William Darby (James Garner), a staff officer, gets command of the 1st Ranger Battalion, to be formed entirely from volunteers.On June 19, 1942 the 1st Ranger Battalion was sanctioned, recruited, and began training in Carrickfergus, Northern Ireland. Darby and Master Sergeant Saul Rosen (Jack Warden), who also narrates the film, select a variety of men for training in Scotland by British Commando veterans. Darby tells his men that the Commandos are the best soldiers in the world, but in time they (the Rangers) will be. The Americans are quartered in Scottish homes and several of the Rangers pair off with local lassies: Rollo Burns (Peter Brown) with Peggy McTavish (Venetia Stevenson), the daughter of the fearsome but humorous Scottish Commando instructor, Sergeant McTavish (Torin Thatcher), and vagabond Hank Bishop (Stuart Whitman) with the proper Wendy Hollister (Joan Elan).[3]The Rangers prove their worth in Operation Torch (the invasion of French North Africa), and two more Ranger battalions are formed, with Darby promoted to colonel. Joining the Rangers is Second Lieutenant Arnold Dittmann (Edd Byrnes), a by-the-book West Pointer. The Rangers fight successfully in Sicily. There are several action scenes in a bombed-out Italian village where the men face a sniper, and a running firefight with the Germans. Lt. Dittmann is humanized by his encounter with Angelina De Lotta (Etchika Choureau).Darby confides to Rosen a recurring dream of being run over by an oncoming train, foreshadowing the tragic climax. During the Battle of Anzio, the 1st and 3rd Ranger Battalions are sent on a dangerous mission; they are ambushed and wiped out by the Germans in the Battle of Cisterna. Of the 767 men who go in, only seven come back, the majority being captured. Burns is among the dead. Darby leads his 4th Ranger Battalion in an unsuccessful rescue attempt.After the heavy losses at Cisterna, the Ranger units are disbanded. Brief vignettes show Bishop on leave with Wendy and her family, and Dittman with Angelina. Darby leaves the Anzio beachhead to report to Army HQ, taking salutes from newly arrived troops as he walks alone down the beach to board a landing craft.","language":"English","Promotion":"The premiere showing in several major US cities was preceded by a banquet where James Garner and the highest-ranking Darby Ranger in that city still in the service sat side by side at the head table. In Philadelphia, that Darby Ranger was Captain Edward Haywood, US Army retired, 1941 to 1961, deceased 1990.","darby's_rangers":"Original film poster","cinematography":"William H. Clothier","directed_by":"William Wellman","narrated_by":"Jack Warden","release_dates":"February 12, 1958 (1958-02-12)|||||","Production":"Warner Brothers had had a financial and critical hit in Battle Cry, and wanted to repeat the success with Major James Altieri's biographical account of Darby's Rangers, The Spearheaders. Altieri was known to Warner Brothers, as he had been technical advisor on Force of Arms (1951). Director William Wellman's reputation for superb war films lay in The Story of G.I. Joe and Battleground. He was hired on condition that Warner Brothers finance his dream project, Lafayette Escadrille, about his (Wellman's) own World War I Foreign Legion air squadron. Warner Brothers emphasised the romantic pairings of most of the leads, as a feature of the film, to emulate the success of Battle Cry; problems arose.Another problem was with the Army. The Marine Corps had enthusiastically lent bases, Marine extras, and film of its campaigns to Hollywood films to boost its public image (see The United States Marine Corps on film). But the Army was not so keen on this project. The Army felt that Ranger operations led to heavy losses of excellent soldiers that the Army thought would be better employed leading regular infantry units. By the 1950s, rather than the separate Ranger units shown in the movie, the Army preferred training individual officers and NCOs at the Ranger School, who then returned to their parent units and trained them in Ranger tactics and military values. Thus, the U.S. Army's co-operation was limited to training the actors and providing black-and-white stock footage.Originally, Charlton Heston was cast as William O. Darby. He was enthusiastic about portraying a recent historical figure; he could interview people who knew Darby in creating his characterization. However, he asked for five percent of the profits. Jack L. Warner thought he was joking, until just before filming.[4] (Heston later sued Warner Bros for $250,000 - $100,000 fee, $50,000 further earnings, and $100,000 damage to his career.[5])Warner looked to his studio's contracted actors, and, fortuitously, replaced Heston with thirty-year-old James Garner who was already going to be in the film. Garner had the proper appearance and age to play William O. Darby, who died at age thirty-four. Garner, a Korean War veteran, had just broken through as a leading man with the Maverick television series. Garner's first leading film role demonstrated the thespian range that made him believable as a Ranger infantry officer. Garner's original role in the film was taken by Stuart Whitman.[6] (Garner too would later sue Warner Brothers).Originally, Tab Hunter was to play Lt. Dittmann, but quit before filming; Edd Byrnes replaced him.[7] Garner's interpretation of Ranger commander Darby is earnest and sensitive; Byrnes' character is heartless and over-serious, the ultimate \"square\". These are the opposites of the two stars' portrayals of their best-known TV characters: cynical, easy-going Bret Maverick and hip \"Kookie\" of 77 Sunset Strip.Darby's Rangers was filmed, economically, on the studio backlot. The supporting cast includes: Murray Hamilton, Adam Williams, Corey Allen, and William Wellman Jr. French actress Etchika Choureau (née Jeannine Paulette Verret) made her Hollywood début in this film, and acted in Lafayette Escadrille, then returned to Europe. Francis De Sales had an uncredited role as a captain. The film emphasizes romantic subplots, as Darby counsels his soldiers about their personal problems. William H. Clothier's black and white cinematography blends with the stock footage, and renders the sets believable.","produced_by":"Martin Rackin","starring":"James Garner Jack Warden Stuart Whitman","running_time":"121 min.","music_by":"Max Steiner","External links":"","edited_by":"Owen Marks","written_by":"Guy Trosper"}