{"country":"India","distributed_by":"Suresh Productions","Plot":"Krishna Murthy (Rajendra Prasad) is son of industrialist Satyanarayana (Nutan Prasad). Satyanarayana is worried about Krishna Murthy's marriage, so much so that he imagines every young woman who happened to be seen by him as his daughter-in-law. Krishna Murthy meets Padma (Rajani) in his friend's marriage and cupid strikes them. Krishna Murthy is afraid of revealing his love for Padma to his father directly as he fears his father may reject it out rightly. His initial attempts to reveal his love life to his father through letters are thwarted by his butler in fear for Satyanarayana's life. Desperate to reveal the love matter to Satyanarayana, Krishnamurthy then tries various gimmicks and at last is successful. A panicked Satyanarayana inquires about the family background of Padma and finds out that she is the daughter of Lakshmipathy (Kota Srinivasa Rao), a noted miser in his village. Aware of his father's concerns, Krishnamurthy reassures Satyanarayana and lands in Lakshmipathy's house posing as a miser. Krishnamurthy's pretense and pranks beget intended effect in Lakshmipathy and brings him closer to Padma. A marriage proposal from Sudhakar (Subhaleka Sudhakar), who is accompanied by his two glutton brothers much to the chagrin of Lakshmipathy, for Padma ends in Lakshmipathy favoring Krishnamurthy. Elated with the turn of events, Krishnamurthy prepares for marriage with Padma and invites Satyanarayana. However, his plans turn soar as Lakshmipathy, in his greed for money, abuses Krishnamurthy assuming that he is from poor family, before Satyanarayana confronts Lakshmipathy. A dejected Krishnamurthy requests Satyanarayana to give him one more chance to teach Lakshmipathy a lesson. Krishnamurthy, along with 'aragundu' Brahmanandam (Brahmanandam), a disgruntled butler of Lakshmipathy set about to transform Lakshmipathy. Krishnamurthy tacitly arranges for three different marriage proposals, starting with Sudhakar, with each proposer agreeing to offer more bride price than the earlier proposer. Overcome with greed for money, Lakshmipathy agrees to get his daughter married with each one of them. At the time of marriage with the bridegroom who offered the highest bride price, the other two bridegrooms also appear at the same time and question Lakshmipathy. An embarrassed Lakshmipathy is censured by Padma for his greed. Lakshmipathy realizes his mistake and redeems himself by getting Padma married to Krishnamurthy","language":"Telugu","Release and reception":"It was released on 27 November 1987. Since then it has developed a cult following among its fans. It was both critically and commercially well received.","Specialities":"Jandhyala is the first director in Telugu to introduce funny characteristic traits to the characters in the film. Later on many directors followed this trend. In this movie those traits became very popular. Especially the miser character became a trend setter and the actor himself repeated the role in many other movies. In this movie Nutan Prasad gives a long lecture about his family to every person who says that he don't know him. Ara gundu always murmers when ever he becomes disgusted with his master's greediness. Laksmipathy's brother in law behaves madly whenever he comes up with his stupid ways to save money. Thus these characters became very successful and made the movie a classic.","directed_by":"Jandhyala","release_dates":"27 November 1987 (1987-11-27)|||||","produced_by":"D. Ramanaidu","starring":"Rajendra Prasad Rajani Nutan Prasad Kota Srinivasa Rao Brahmanandam","Box Office":"Made at a budget of ₹18lakhs,collected more than ₹100lakhs.","music_by":"Ramesh Naidu","edited_by":"K.A. Marthand","written_by":"Adivishnu"}