{"based_on":"Big Hero 6  by Man of Action","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Jordan Roberts|Dan Gerson|Robert L. Baird|","big_hero_6":"Theatrical release poster","Plot":"Hiro Hamada is a 14-year-old robotics genius in the futuristic fictional city of San Fransokyo. Raised by his aunt Cass and older brother Tadashi after the death of his parents, he spends his time participating in illegal robot fights. To redirect Hiro, Tadashi takes him to his robotics lab at the San Fransokyo Institute of Technology, where Hiro meets Tadashi's friends/co-workers, GoGo, Wasabi, Honey Lemon, and Fred, as well as Baymax, the inflatable healthcare companion robot Tadashi created. Hiro also meets Professor Callaghan, Tadashi's advisor and the head of the university's robotics program. After Hiro learns that Callaghan was the creator of the very robot technology Hiro uses to easily win all of his robot battles, Callaghan challenges Hiro by suggesting that robot battling would be too easy compared to the research he and his students do, and invites Hiro to apply for the university. To enroll, Hiro signs up for the school's science fair and presents microbots, swarms of tiny robots that can link together in any arrangement imaginable using only mental thought. Professor Callaghan is impressed, and immediately grants Hiro entrance to the university. Alistair Krei, renowned entrepreneur and president of Krei Tech, offers to buy the microbots, but Hiro follows Callaghan's advice and declines. Shortly after the fair, a fire breaks out at the university, and Tadashi rushes in to rescue Callaghan. However, a backdraft explosion apparently kills both Tadashi and Callaghan.Weeks later, a depressed Hiro inadvertently activates Baymax again, who follows Hiro's only remaining microbot to an abandoned warehouse. There, the two discover that someone has been mass-producing the microbots, and are attacked by a man wearing a Kabuki mask controlling the bots. After they escape, Hiro equips Baymax with armor and a battle chip containing various karate moves, and they track the masked man to the docks. GoGo, Wasabi, Honey Lemon, and Fred arrive, having been previously contacted by Baymax to help Hiro overcome his depression. The masked man then attacks the group. The six escape to Fred's mansion, where they begin to form a superhero team, with Hiro creating armor for his friends to complement each one's area of scientific expertise.The group tracks the masked man, who they suspect to be Krei, to an abandoned secret Krei Tech laboratory, which they find was researching teleportation technology until a test pilot was lost in an accident. The masked man attacks, but the group manages to knock off his mask, revealing him to be Professor Callaghan, who had stolen Hiro's microbots to shield himself from the explosion. Realizing that Tadashi had died for nothing, the enraged Hiro removes Baymax's personality/healthcare chip, leaving only the battle chip, and orders him to kill Callaghan. GoGo, Wasabi, and Fred attempt to stop Baymax, but are quickly overpowered, and Honey re-installs the healthcare chip at the last second, preventing Baymax from carrying out the kill order. Callaghan escapes, and Hiro, furious at his friends' intervention, flies off with Baymax. Back home, Hiro makes repairs then tries to remove the healthcare chip again, but Baymax prevents him, stating that vengeance is not what Tadashi would have wanted. To comfort him, Baymax shows Hiro videos of Tadashi running numerous tests non-stop during Baymax's development, demonstrating the former's strong desire to help those in need. A remorseful Hiro apologizes to his friends, who forgive him since they understand his pain, and the team reunites to stop Callaghan.After combing through the video files of the teleportation accident, the group discovers that Krei's test pilot was Callaghan's daughter Abigail, and that Callaghan is seeking revenge on Krei. Callaghan interrupts a public Krei event and attempts to destroy his headquarters using the same unstable teleportation portal that took his daughter away. The team destroys Callaghan's microbots and saves Krei, but the portal remains active. Baymax detects Abigail inside, alive but in hyper-sleep, and leaps into the portal with Hiro to rescue her. They find Abigail's pod, but Baymax is damaged by debris, leaving them adrift inside the portal. Knowing that the portal will collapse soon, Baymax uses his armor's rocket fist to propel Hiro and Abigail back through the portal, forcing them to leave him behind. They make it back and Callaghan is arrested. Sometime later, Hiro discovers Baymax's personality chip clenched in the rocket fist. He rebuilds Baymax and the six friends continue their exploits through the city, fulfilling Tadashi's dream of helping those in need.During the end credits, it is shown through newspaper headlines that Hiro has been awarded a grant from the university, where a building has been dedicated to Tadashi. In a post-credits scene, Fred accidentally opens a secret door in his family mansion and finds superhero gear inside. His father, a retired superhero, arrives stating \"We have a lot to talk about\" as they embrace each other.","Projected sequel":"On February 18, 2015, the film's directors, Don Hall and Chris Williams, said a sequel was possible, and that they were interested, but that it was too soon to make that decision. However, Hall added, \"Having said that, of course, we love these characters, and the thought of working with them again some day definitely has its appeal.\"[152] In March 2015, Génesis Rodríguez told MTV that a sequel was being considered, saying, \"...There's nothing definitive. There's talks of something happening. We just don't know what yet.\"[153] In April 2015, former Marvel editor Stan Lee mentioned a projected sequel as one of several that he understood were in Marvel's plans for upcoming films.[154]","language":"English","Reception":"Big Hero 6 earned $222.5 million in North America, and $435.3 million in other territories, for a worldwide estimated total of $657.8 million.[4] Calculating in all expenses, Deadline estimated that the film made a profit of $187.34 million.[82] Worldwide, it is the highest-grossing animated film of 2014,[9] the third highest-grossing non-Pixar animated film from Disney,[83] and the 16th highest-grossing animated film of all time. By grossing over $500 million worldwide, it became the fourth Disney release of 2014 to do so; the other titles being Guardians of the Galaxy, Maleficent, and Captain America: The Winter Soldier.[84]In the U.S. and Canada, the film is the second highest-grossing science fiction animated film (behind WALL-E),[85] the second highest-grossing animated superhero comedy film (behind The Incredibles),[86] and the second highest-grossing Disney animated film (behind Frozen).[87] The film earned $1.4 million from Thursday late night showings which is higher than the previews earned by Frozen ($1.2 million) and The Lego Movie ($400,000).[88][89] In its opening day on November 7, it earned $15.8 million, debuting at number two behind Interstellar ($16.9 million).[90][91] Big Hero 6 topped the box office in its opening weekend, earning $56.2 million from 3,761 theaters ahead of Interstellar ($47.5 million);[92][93] it is Walt Disney Animation Studios' second best opening behind Frozen ($67.4 million), both adjusted and unadjusted.[94][95][96][97]On February 15, 2015, Big Hero 6 became the third-highest grossing Disney animated film in the U.S. and Canada, behind The Lion King and Frozen.[98][99]Two weeks ahead of its North American release, Big Hero 6 was released in Russia (earned $4.8 million) and Ukraine (earned $0.2 million) in two days (October 25–26).[100] The main reason behind the early release was in order to take advantage of the two weeks of school holidays in Russia. Jeff Bock, box office analyst for Exhibitor Relations, said: \"For a two-day gross, that's huge. It's a giant number in Russia.\"[101] In its second weekend, the film added $4.8 million (up 1%) bringing its total nine days cumulative audience to $10.3 million in Russia and $10.9 including its revenue from Ukraine.[102]In its opening weekend, the film earned $7.6 million from seventeen markets for a first weekend worldwide total of $79.2 million, which was behind Interstellar ($132.2 million).[103] It went to number one in the Philippines, Vietnam and Indonesia.[104] Mexico opened with $4.8 million.[105][106] In Japan, where the film is locally known as Baymax, it opened at second place behind Yo-Kai Watch: Tanjō no Himitsu da Nyan!, with $5.3 million, which is the second biggest Disney opening in Japan behind Frozen.[107][108] and topped the box office for six consecutive weekends.[109] In the U.K., the film opened in second place with $6 million ($6.8 million including previews), which is 15 percent lower than Frozen.[110] In China, it opened at No. 1 with $14.8 million which is the biggest opening for a Disney and Pixar animated film (breaking Frozen's record)[111] and topped the box office for three consecutive weekends.[112]The film became the highest-grossing Disney animated film in Vietnam,[105] and in China (surpassed by Zootopia[113]),[9] the second highest-grossing Disney animated film of all time in Russia[104] in the Philippines (behind Toy Story 3),[105] and in Japan (behind Frozen).[9] In addition to being the second-highest grossing Disney animated film, it is also the fifth highest-grossing animated film of all time in China.[114] In total earnings, its biggest markets outside of the United States and Canada are China ($83.5 million) and Japan ($76 million).[115]The review aggregation website Rotten Tomatoes reports that 89% of critics gave the film a positive review based on 193 reviews, with an average score of 7.4/10. The site's consensus states: \"Agreeably entertaining and brilliantly animated, Big Hero 6 is briskly-paced, action-packed, and often touching.\"[116] Metacritic, which assigns a normalized rating out of 100 from top reviews from mainstream critics, calculated a score of 74 based on 38 reviews, indicating \"generally favorable reviews.\"[117]Michael O'Sullivan of Washington Post gave the film 3.5/4 stars, writing that \"The real appeal of Big Hero 6 isn't its action. It's the central character's heart.\"[118] Maricar Estrella of Fort Worth Star-Telegram gave the film 5 stars, saying it \"offers something for everyone: action, camaraderie, superheroes and villains. But mostly, Baymax offers a compassionate and healing voice for those suffering, and a hug that can be felt through the screen.\"[119] Peter Travers of Rolling Stone gave the film 3 out of 4 stars, stating, \"The breakthrough star of the season is here. His name is Baymax and he's impossible not to love. The 3-D animated Big Hero 6 would be a ton less fun without this irresistible blob of roly-poly, robot charisma.\"[120] Kofi Outlaw of Screen Rant gave the film 4/5 stars or \"excellent,\" explaining that \"Big Hero 6 combines Disney wonder and charm with Marvel awe and action to deliver a film that exhibits the best of both studios.\"[121] Alonso Duralde of The Wrap gave the film a positive review, calling it \"sweet and sharp and exciting and hilarious\" and says that the film \"comes to the rescue of what's become a dreaded movie trope — the origin story — and launches the superhero tale to pleasurable new heights.\"[122] Calvin Wilson of St. Louis Post-Dispatch gave the film 3.5 of 4 stars, writing that \"the storytelling is solid, propelled by characters that you come to care about. And that should make Big Hero 6 a big hit.\"[123]Bill Goodykoontz of Arizona Republic gave the film a positive review, writing, \"Directors Don Hall and Chris Williams have made a terrific movie about a boy (Ryan Potter) and his robot friend, who seek answers to a deadly tragedy,\" calling it an \"unexpectedly good treat.\"[124] Soren Anderson of The Seattle Times gave the film 3.5 out of 4 stars, saying that \"Clever, colorful, fast on its feet, frequently very funny and sweet (but not excessively so), Big Hero 6 mixes its myriad influences into a final product that, while in no way original, is immensely entertaining.\"[125] Michael Rechtshaffen of Hollywood Reporter gave the film a positive review, saying that \"the funny and heartwarming story about the bond between a teen tech geek and a gentle robot represents another can't-miss proposition by Walt Disney Animation Studios.\"[126] Jon Niccum of Kansas City Star gave the film 3.5 out of four stars, writing that while it \"may hit a few familiar beats inherent to any superhero \"origin story,\"\" it is still \"the best animated film of the year, supplying The Incredibles-size adventure with a level of emotional bonding not seen since The Iron Giant,\" and that it \"never runs low on battery power.\"[127] Elizabeth Weitzman of The Daily News gave the film 4 out of 5 stars, calling it a \"charming animated adventure,\" saying that with \"appealing 3D animation\" and a smart and \"sharp story and script,\" it is \"one of the rare family films that can fairly boast of having it all: humor, heart and huggability.\"[128] Rafer Guzmán from Newsday gave the film 3 out of 4 stars, saying that \"Marvel plus Disney plus John Lasseter equals an enjoyable jumble of kid-approved action,\" with \"rich, vivid colors and filled with clever details.\"[129]","box_office":"$657.8 million[4]","cinematography":"Rob Dressel|Adolph Lusinsky|","production_company":"Walt Disney Pictures Walt Disney Animation Studios","directed_by":"Don Hall|Chris Williams|","Soundtrack":"Henry Jackman composed the score for the film.[67] The soundtrack features an original song titled \"Immortals\" written and recorded by American rock band Fall Out Boy, which was released by Walt Disney Records on October 14, 2014.[68][69] The soundtrack album was digitally released by Walt Disney Records on November 4, 2014, and had a CD release on November 24.[70] While not part of the soundtrack, a brief instrumental section of \"Eye of the Tiger\" plays in the film.[71]All music composed by Henry Jackman (except \"Immortals\").","release_dates":"October 23, 2014 (2014-10-23) (Tokyo International Film Festival)|November 7, 2014 (2014-11-07) (United States)||||","Production":"After Disney's acquisition of Marvel Entertainment in 2009, CEO Bob Iger encouraged the company's divisions to explore Marvel's properties for adaptation concepts.[26] By deliberately picking an obscure title, it would give them the freedom to come up with their own version.[27] While co-directing Winnie the Pooh, director Don Hall was scrolling through a Marvel database when he stumbled upon Big Hero 6, a comic he had never heard of before. \"I just liked the title,\" he said. He pitched the concept to John Lasseter in 2011, as one of five ideas[28] for possible productions for Walt Disney Animation Studios, and this particular idea \"struck a chord\" with Lasseter, Hall, and Chris Williams.[29][30][31] In June 2012, Disney confirmed that Walt Disney Animation Studios was adapting Marvel Comics' series and that the film had been commissioned into early stages of development.[32][33] Because they wanted the concept to feel new and fresh, head of story Paul Briggs (who also voiced Yama in the film[34]) only read a few issues of the comic, while screenwriter Robert Baird admitted he had not read the comic at all.[35]Big Hero 6 was produced solely by Walt Disney Animation Studios,[36] although several members of Marvel's creative team were involved in the film's production including Joe Quesada, Marvel's chief creative officer, and Jeph Loeb, head of Marvel Television.[37][38] According to an interview with Axel Alonso by CBR,[39] Marvel did not have any plans to publish a tie-in comic.[40] Disney planned to reprint the Marvel version of Big Hero 6 themselves, but reportedly Marvel disagreed. They eventually came to agreement that Yen Press would publish the Japanese manga version of Big Hero 6 for Disney.[41] Conversely, Lasseter dismissed the idea of a rift between the two companies, and producer Roy Conli stated that Marvel allowed Disney \"complete freedom in structuring the story.\"[42][43] Disney Animation Studio President Andrew Millstein stated \"Hero is one example of what we've learned over the years and our embracing some of the Pixar DNA.\"[44] Regarding the film's story, Quesada stated, \"The relationship between Hiro and his robot has a very Disney flavor to it...but it's combined with these Marvel heroic arcs.\"[29] The production team decided early on not to connect the film to the Marvel Cinematic Universe and set it in a stand-alone universe instead.[45]With respect to the design of Baymax, Hall mentioned in an interview, \"I wanted a robot that we had never seen before and something to be wholly original. That's a tough thing to do, we've got a lot of robots in pop culture, everything from The Terminator to WALL-E to C-3PO on down the line and not to mention Japanese robots, I won't go into that. So I wanted to do something original.\" Even if they did not yet know what the robot should look like, artist Lisa Keene came up with the idea that it should be a huggable robot.[46] Early on in the development process, Hall and the design team took a research trip to Carnegie Mellon University's Robotics Institute, where they met a team of DARPA-funded[47] researchers who were pioneering the new field of 'soft robotics' using inflatable vinyl,[48][49] which ultimately inspired Baymax's inflatable, vinyl, truly huggable design.[50][51][52] Hall stated that \"I met a researcher who was working on soft robots. ... It was an inflatable vinyl arm and the practical app would be in the health care industry as a nurse or doctor's assistant. He had me at vinyl. This particular researcher went into this long pitch but the minute he showed me that inflatable arm, I knew we had our huggable robot.\"[53] Hall stated that the technology \"will have potential probably in the medical industry in the future, making robots that are very pliable and gentle and not going to hurt people when they pick them up.\" Hall mentioned that achieving a unique look for the mechanical armor took some time and \"just trying to get something that felt like the personality of the character.\" Co-director Williams stated, \"A big part of the design challenge is when he puts on the armor you want to feel that he's a very powerful intimidating presence...at the same time, design-wise he has to relate to the really adorable simple vinyl robot underneath.\"[54] Baymax's face design was inspired by a copper suzu bell that Hall noticed while at a Shinto shrine.[55] According to Conli, Lasseter initially disliked Baymax's description (while low on battery power) of Hiro's cat as a \"hairy baby,\" but Williams kept the line in anyway, and at the film's first test screening, Lasseter admitted that Williams was correct.[56] According to Williams, Baymax was originally going to be introduced rather late in the film, but then story artist John Ripa conceived of a way for Baymax to meet Hiro much earlier.[57] The entire film became much stronger by establishing the relationship between Hiro and Baymax early on, but the filmmakers ended up having to reconstruct \"a fair amount of the first act\" in order to make that idea work.[57]About ninety animators worked on the film at one point or another; some worked on the project for as long as two years.[58] In terms of the film's animation style and settings, the film combines Eastern world culture (predominantly Japanese) with Western world culture (predominantly California).[59] In May 2013, Disney released concept art and rendered footage of San Fransokyo from the film.[60] San Fransokyo, the futuristic mashup of San Francisco and Tokyo, was described by Hall as \"an alternate version of San Francisco. Most of the technology is advanced, but much of it feels retro ... Where Hiro lives, it feels like the Haight. I love the Painted ladies. We gave them a Japanese makeover; we put a cafe on the bottom of one. They live above a coffee shop.\" According to production designer Paul Felix, \"The topography is exaggerated because what we do is caricature, I think the hills are 1½ times exaggerated. I don't think you could really walk up them ... When you get to the downtown area, that's when you get the most Tokyo-fied, that pure, layered, dense kind of feeling of the commercial district there. When you get out of there, it becomes more San Francisco with the Japanese aesthetic. ... (It's a bit like) Blade Runner, but contained to a few square blocks. You see the skyscrapers contrasted with the hills.\"[61] The reason why Disney wanted to merge Tokyo (which is where the comic book version takes place) with San Francisco was partly because San Francisco had not been used by Marvel before, partly because of all the city's iconic aspects, and partly because they felt its aesthetics would blend well with Tokyo.[35] The filmmakers' idea was that San Fransokyo is based on an alternate history in which San Francisco was largely rebuilt by Japanese immigrants in the aftermath of the 1906 earthquake, although this premise is never stated in the film.[62] To create San Fransokyo as a detailed digital simulation of an entire city, Disney purchased the actual assessor data for the entire city and county of San Francisco.[58] The final city contains over 83,000 buildings and 100,000 vehicles.[58]A software program called Denizen was used to create over 700 distinctive characters[58] that populate the city.[63] Another one named Bonzai was responsible for the creation of the city's 250,000 trees,[64] while a new rendering system called Hyperion offered new illumination possibilities, like light shining through a translucent object (e.g. Baymax's vinyl covering).[65] Development on Hyperion started in 2011 and was based upon research into multi-bounce complex global illumination originally conducted at Disney Research in Zürich.[58] Disney in turn had to assemble a new supercomputing cluster just to handle Hyperion's immense processing demands, which consists of over 2,300 Linux workstations distributed across four data centers (three in Los Angeles and one in San Francisco).[58] Each workstation, as of 2014, included a pair of 2.4 GHz Intel Xeon processors, 256 GB of memory, and a pair of 300 GB solid-state drives configured as a RAID Level 0 array (i.e., to operate as a single 600 GB drive).[58] This was all backed by a central storage system with a capacity of five petabytes, which holds all digital assets as well as archival copies of all 54 Disney Animation films.[58] Pixar's RenderMan was considered as a \"Plan B\" for the film's rendering, if Hyperion was not able to meet production deadlines.[8]The post-credits scene was only added to the film in August 2014, late in production, after co-director Don Hall and his crew went to see Marvel Studios' Guardians of the Galaxy. He stated that \"[i]t horrified us, that people were sat waiting for an end credits thing, because of the Marvel DNA. We didn't want people to leave the movie disappointed.\"[66]","produced_by":"Kristina Reed|Roy Conli|","starring":"Scott Adsit|Ryan Potter|Daniel Henney|T. J. Miller|Jamie Chung|Damon Wayans, Jr.|Génesis Rodríguez|Alan Tudyk|James Cromwell|Maya Rudolph|","running_time":"102 minutes[1][2]","Other media":"A Japanese manga adaptation of Big Hero 6 (which is titled Baymax (ベイマックス, Beimakkusu?) in Japan), illustrated by Haruki Ueno, began serialization in Kodansha's Magazine Special from August 20, 2014. A prologue chapter was published in Weekly Shōnen Magazine on August 6, 2014.[137] According to the film's official Japanese website, the manga revealed plot details in Japan before anywhere else in the world.[138] The website also quoted the film's co-director Don Hall, to whom it referred as a manga fan, as saying that the film was Japanese-inspired.[138] Yen Press publishes the series in English.[139]A video game based on the film titled Big Hero 6: Battle in the Bay was released on October 28, 2014 for the Nintendo 3DS and Nintendo DS.[140] Hiro and Baymax from the film are also available in Disney Infinity: Marvel Super Heroes as playable Disney Originals characters in the Toy Box. There is also an app based on the film titled Big Hero 6: Bot Fight.[141][142]A world based on Big Hero 6 will make its debut appearance in Kingdom Hearts III. The world will continue the story from the events at the end of the film, with the villains taking control of the original Baymax body left behind in the portal space, turning it into a monstrous Heartless that the second Baymax and Sora fights.[143][144][145]Vinyl toy company Funko released the first images of the toy figures via their Big Hero 6 Funko.[146] The POP Vinyl series collection features Hiro Hamada, GoGo Tomago, Wasabi, Honey Lemon, Fred, and a 6-inch Baymax.Bandai released a number of action figures related to the film; these toys including a number of different Baymax figures. One is a soft plastic 10-inch version that includes a series of projected stills from the film on his stomach, which can be changed when the figure's arm is moved, and which emits accompanying sounds. Deluxe Flying Baymax, which retails for $39.99, depicts the armored version of the character and features lights and sounds that activate at the push of a button. Placing the Hiro figurine on his back changes the sounds into speech and when the figure is tilted, the sounds are those of flying. The Armor-Up Baymax (original retail cost $19.99) comes with 20 pieces of armor that can be assembled onto the robot by the owner. The other characters from the film, including the other members of team and Professor Callaghan (who is called Yokai) are issued in 4-inch action figures, each of which have eight points of articulation.[147]In March 2016, Disney announced that a Big Hero 6 television series is in development and will premiere on Disney XD in 2017. The series takes place immediately after the events of the film,[148] and is created by Kim Possible's Mark McCorkle and Bob Schooley, and executive produced by McCorkle, Schooley and Nick Filippi.[149][150] Jamie Chung her role as GoGo respectively.[151]","music_by":"Henry Jackman","edited_by":"Tim Mertens","Release":"Big Hero 6 premiered on October 23, 2014 as the opening film at the Tokyo International Film Festival.[72] The world premiere of Big Hero 6 in 3D took place at the Abu Dhabi Film Festival on October 31, 2014.[73] It was theatrically released in the United States on November 7, 2014[74] with limited IMAX international showings.[75] Theatrically, the film was accompanied by the Walt Disney Animation Studios short, Feast.[76]For the South Korean release of the film, it was retitled Big Hero, to avoid the impression of being a sequel, and edited to remove indications of the characters' Japanese origin. This is owing to the tense relations between Korea and Japan. For instance, the protagonist's name, Hiro Hamada, was changed to \"Hero Armada,\" and Japanese-language signage onscreen was changed to English. Nonetheless, the film caused some online controversy in South Korea, because of small images resembling the Rising Sun Flag in the protagonist's room.[77]The film was released in China on February 28, 2015.[78]Big Hero 6 was released in the United States by Walt Disney Studios Home Entertainment on Blu-ray and DVD on February 24, 2015. Blu-ray bonus features include the theatrical short Feast, the featurettes \"The Origin Story of Big Hero 6: Hiro's Journey\", \"Big Hero Secrets\" and \"Big Animator 6: The Characters Behind the Characters\", deleted scenes, and the theatrical trailer.[79][80] Writer Steven T. Seagle, who co-created the comic book Big Hero 6, criticized the Blu-ray featurette documenting the origins of the group, for not mentioning him or co-creator Duncan Rouleau. Seagle also criticized the book Art of Big Hero 6 for the same omission.[81]","budget":"$165 million[3][4]"}