{"based_on":"Death on the Nile  by Agatha Christie","country":"United Kingdom","Awards and nominations":"Academy Awards (US)BAFTA AwardsEdgar Allan Poe Awards (U.S)Evening Standard British Film AwardsGolden Globes (US)National Board of Review (US)","distributed_by":"EMI Films (UK) Paramount Pictures (US)","screenplay_by":"Anthony Shaffer","Plot":"The film begins with a meeting between wealthy heiress Linnet Ridgeway (Lois Chiles) and her close friend Jacqueline de Bellefort (Mia Farrow). Jacquie wants her fiancé, Simon Doyle (Simon MacCorkindale), to work for Linnet, but he and Linnet have a whirlwind affair and end up marrying. While honeymooning in Egypt, they are continually hounded by the jilted Jacquie. In an attempt to get away, the Doyles pretend to go to the Cairo Railway Station before backtracking to board their booked cruise on a Nile paddle steamer, the S.S. Karnak.When the passengers venture on-shore to examine a nearby temple, a large stone is pushed off a pillar and narrowly misses Simon and Linnet. They again encounter Jacquie, who boards the ship and ignores the warnings of detective Hercule Poirot (Peter Ustinov) to stay away, revealing that she carries a small pistol. After a late-night game of cards in the ship's lounge, Jacquie confronts Simon. In a drunken rage she fires and shoots him in the leg. The next morning, Linnet Ridgeway is discovered murdered in her cabin, shot in the head by a similar weapon. A \"J\" is written in blood on the wall from Linnet's finger, appearing to implicate Jacquie. Also, Jacquie's pistol is missing.Jacquie is a natural suspect but has a perfect alibi, having been given morphine and observed by Miss Bowers all night (Alcohol and Morphine would, in Nurse Bowers's words, sink the Titanic). Simon Doyle was also unable to commit the crime due to his leg wound. Poirot is convinced someone on deck overheard the argument, removed the gun and used it to kill Linnet. Poirot confronts each guest aboard the Karnak in turn and explains how each had a reason to want to kill the heiress.Soon a bundle is found in the Nile. The missing pistol is wrapped in Mrs. van Schuyler's stole, which had a small bullet hole in it. A handkerchief was also included, stained with blood.While Poirot and Race conduct their investigation, the maid Louise is murdered. Her throat has been cut with one of Dr. Bessner's scalpels and a fragment of a banknote is found in her hand. Poirot realises she probably saw the murderer coming out of Linnet's cabin and attempted to extort money in return for her silence. Salome Otterbourne claims to have seen Louise's murderer and is about to tell Poirot when she is shot in the head through an open cabin door with Pennington's revolver, too large to have been used on Linnet.With several suspects eliminated, Poirot gathers everyone in the saloon, where he reveals the solution – Simon Doyle murdered his wife, with Jacqueline as his accomplice. Poirot reveals that Simon and Jacquie were still lovers, and his marriage to Linnet had been cleverly plotted to gain her money. They faked Simon's shooting, leaving him free to murder Linnet while the doctor was being fetched by Ferguson and as Jacqueline was attended to by Miss Bowers. Simon was left alone long enough to run to Linnet's room, shoot her in the head, return to the lounge and shoot himself in the leg through the stole – a third shot of which no one was aware. Jacquie covered up. She stole the knife then killed the maid. She stole the revolver and killed Salome Otterbourne. Simon and Jacquie point out that Poirot has no proof, so Poirot convinces Simon that his hands could be tested for grains of gunpowder removed with wax. When they realise that they have been found out, they confess, and in a final love embrace, Jacquie covertly takes back her pistol and shoots Simon, then herself.Later Poirot says goodbye to the remaining guests, reveals that the test was made-up, and Rosalie and Ferguson announce that they are engaged.","language":"English","Reception":"The Times' film critic David Robinson had mixed feelings about the film. Although entertaining, and following the formula of the Murder on the Orient Express film four years earlier, he found it a bit too long and not quite as good. He concluded that screenwriter Anthony Shaffer and director John Guillermin were not quite as suitable to handle Agatha Christie's rich material as Paul Dehn and Sidney Lumet had been when they worked on Murder on the Orient Express.[10]The film was expected to be popular with audiences following on the heels of Murder on the Orient Express, the most successful British film up to that point. However, the box office return was $14.5 million in the United States,[2] lower than the $25 million high for Orient Express.[citation needed]Death on the Nile has received generally positive reviews by contemporary film critics more than 30 years later, with an 80% fresh rating on Rotten Tomatoes.[11]","box_office":"$14,560,084 (US)[2]","cinematography":"Jack Cardiff","production_company":"Mersham Productions","directed_by":"John Guillermin","death_on_the_nile":"UK original film poster","Ustinov as Poirot":"Death on the Nile was Peter Ustinov's first portrayal of Christie's Belgian detective Hercule Poirot, the role having been played by Albert Finney in Murder on the Orient Express four years earlier. He was to continue as Poirot in a further five films:","release_dates":"29 September 1978 (1978-09-29) (US)|23 October 1978 (1978-10-23) (UK)||||","Production":"The movie was made during a period of expansion for EMI Films under Michael Deeley and Barry Spikings, who were increasingly aiming at the international market.[4]This was Jane Birkin's first British movie in a decade.[5]The film shot seven weeks on location in Egypt, four on the steamer Karnak (the historic ship SS Memnon) and the rest at places such as Aswan, Abu Simbel, Luxor, and Cairo. Desert filming required makeup call at 4 a.m. and shooting at 6 a.m. to accommodate a two-hour delay around noon when temperatures hovered near 130 °F (54 °C). Bette Davis wryly commented, \"In the older days, they'd have built the Nile for you. Nowadays, films have become travelogues and actors, stuntmen.\"[6][7]John Guillermin commented that the Egyptian government were supportive of the film because there were so many Agatha Christie fans in the country, and the story \"was unpolitical\".[8]During the shoot, troubles arose as no hotel reservations had been made for the crew. They were subsequently shifted from hotel to hotel, sometimes on a daily basis. Director Guillermin was never allowed to see the rushes. By order of the producers, footage was sent directly to them in London. A lighter moment occurred during a love scene between Chiles and MacCorkindale, when a hostile desert fly landed on Chiles's teeth. The actors carried on as best they could, but the crew burst out laughing when Guillermin thankfully called \"cut\" and ordered another take.[6]Guillermin found the shoot logistically tricky because of the heat and the boat, which sometimes ran aground. But he enjoyed the cast:The more experienced people created a very generous atmosphere. They were not impatient at all. I have never worked with Bette Davis before and was told she was professional but not communicative. Well, she was an absolute bastion of support and enthusiasm. During the breaks, the cast would often sit to one side engaged in terrific conversation. There was Ustinov's great wit and Niven's dry humour. Jack Warden is a very funny man and Mia Farrow is a very funny woman. This was a bunch of people who could relax.[8]\"Poirot can be a cold fish, but here we made him more humanistic and warm, interested in young people for instance,\" said the director. \"Peter Ustinov was able to bring that out.\"[8] Costume designer Anthony Powell won an Oscar for Best Costume design, his second. Among his touches were shoes for Chiles that featured diamond studded heels that came from a millionaire's collection and shoes worn by Davis made from the scales of twenty-six pythons.[6]","produced_by":"John Brabourne Richard B. Goodwin","starring":"Peter Ustinov Simon MacCorkindale Lois Chiles Mia Farrow Bette Davis George Kennedy Maggie Smith Angela Lansbury Olivia Hussey David Niven Jon Finch Jack Warden Jane Birkin I. S. Johar","running_time":"140 minutes","music_by":"Nino Rota","edited_by":"Malcolm Cooke","Release":"Although it was a British film, Death on the Nile first premiered in New York, on 29 September 1978, to coincide with the sale of tickets for the Metropolitan Museum of Art's opening on 15 December 1978 of the travelling exhibition The Treasures of Tutankhamun, which had piqued interest in Egyptian artefacts. For the US market, artist Richard Amsel was commissioned to change the original British poster art by including the profile of King Tutankhamun with ceremonial knife (and modern revolver), surrounded by the cast.[6]In London, there was a Royal Charity Premiere at the ABC Shaftesbury Avenue on 23 October 1978, attended by the Queen, Prince Philip and Earl Mountbatten.[9]","budget":"$7.92 million[1]"}