{"based_on":"Alfie  by Bill Naughton","country":"United Kingdom","distributed_by":"Paramount Pictures","screenplay_by":"Bill Naughton","Legacy":"The 1966 film was followed by Alfie Darling (1975), with Alan Price replacing Caine. An updated 2004 remake starred Jude Law in the title role.","Plot":"Handsome Cockney chauffeur Alfie Elkins (Michael Caine) enjoys the favours of women, while avoiding any commitment. He ends an affair with a married woman, Siddie (Millicent Martin), just as he gets his submissive single girlfriend, Gilda (Julia Foster), pregnant. Although Alfie refuses to marry Gilda and cheats on her constantly, Gilda decides to have the child, a boy named Malcolm, and keep him rather than give him up for adoption. Over time, Alfie becomes attached to his son, but his unwillingness to commit to Gilda causes her to break up with him and instead marry Humphrey (Graham Stark), a kindly bus conductor who loves her and is willing to accept Malcolm as his own son. She also bars Alfie from any further contact with Malcolm, forcing Alfie to watch from a distance as Humphrey steps into his fatherly role. When a health check reveals Alfie has tubercular shadows on his lungs, the diagnosis, combined with his separation from his son, leads him to have a brief mental breakdown.Alfie spends time in a convalescent home, where he befriends a fellow patient named Harry (Alfie Bass), a family man devoted to his frumpy wife Lily (Vivien Merchant). When Alfie flippantly suggests that Lily might be cheating on Harry, Harry confronts Alfie about his attitudes and behaviour. Alfie is released from the home and meets Ruby (Shelley Winters), an older, voluptuous, affluent and promiscuous American, while freelancing taking holiday photos of tourists near the Tower of London. Alfie returns to the convalescent home to visit Harry, who asks him to give Lily a ride home. Neither Alfie nor Lily initially want to spend time together, but they agree to please Harry, and the ride home turns into a one-night stand.Later, Alfie picks up a young hitchhiker, Annie from Sheffield (Jane Asher) who is looking to make a fresh start in London and moves in with him. She proves preoccupied with a love left behind, scrubbing Alfie's floor, doing his laundry, and preparing his meals to compensate. He grows resentful of the relationship and drives her out with an angry outburst, later regretting it. Around the same time, Lily informs him that she is pregnant from their one encounter, and the two plan for her to have an illegal abortion to keep Harry from finding out. The abortion proves traumatic for both Lily and Alfie, with Alfie breaking down in tears upon seeing the aborted fetus.The stress of the situations with Annie and Lily makes Alfie decide to change his non-committal ways and settle down with the rich Ruby. However, upon visiting Ruby, he finds a younger man in her bed. He encounters Siddie again, but she has lost interest in him and returned to her husband. At the film's end, Alfie is left lonely and wondering, \"What's it all about? You know what I mean.\"","language":"English","Reception":"Alfie garnered critical acclaim, currently holding a 100% \"fresh\" rating on review aggregator Rotten Tomatoes.[9]","box_office":"$18,871,300[3]","cinematography":"Otto Heller","directed_by":"Lewis Gilbert","Music":"The original film soundtrack featured jazz saxophonist Sonny Rollins with local musicians from London including Stan Tracey on piano, who improvised \"Little Malcolm Loves His Dad\" (although never credited), Rick Laird on bass, Phil Seamen on drums, Ronnie Scott on tenor sax. The released soundtrack album, recorded in the United States with orchestration by Oliver Nelson, featured Rollins with J.J. Johnson – trombone (tracks 1 & 2), Jimmy Cleveland – trombone (tracks 3-6), Phil Woods – alto saxophone, Bob Ashton – tenor saxophone, Danny Bank – baritone saxophone, Roger Kellaway – piano, Kenny Burrell – guitar, Walter Booker – bass and Frankie Dunlop – drumsThe title song, \"Alfie\", written by Burt Bacharach and Hal David, was sung by Cher over the film's closing credits in the US release.[8] It became a hit for British singer Cilla Black (whose version was used for the original British soundtrack), and for Madeline Eastman and Dionne Warwick. Numerous jazz musicians have covered it and it has become a jazz standard.","release_dates":"24 March 1966 (1966-03-24) (UK)|24 August 1966 (1966-08-24) (US)||||","Production":"The film is unusual in that it has no opening credits and the end credits feature photos of the principal actors, as well as of the main technical crew, including director Gilbert and cameraman Otto Heller. It was shot at Twickenham Studios with scenes shot at several locations in London;[5] including Waterloo Bridge which is seen at the beginning and end of the film where the title character walks into the distance accompanied by a stray dog[6] and Tower Bridge which is the backdrop for the photography scene with Shelley Winters.[7]Several well-known actors, including Richard Harris, Laurence Harvey, James Booth and Anthony Newley turned down the title role due to the then-taboo subject matter. Despite having played \"Alfie\" on Broadway, Terence Stamp categorically declined to reprise the role on film, so he and casting agents approached his good friend and then roommate Michael Caine: not one to then snub a role about a common man, Caine agreed to do it. He won huge acclaim for the breakthrough role of his career and continued to land better parts.","produced_by":"Lewis Gilbert","starring":"Michael Caine Shelley Winters Millicent Martin Vivien Merchant Jane Asher Julia Foster","running_time":"113 minutes[1]","music_by":"Sonny Rollins","Awards and recognition":"Alfie won the Special Jury Prize at the 1966 Cannes Film Festival.[10] It was also nominated for several Academy Awards including Best Actor in a Leading Role (Michael Caine), Best Actress in a Supporting Role (Vivien Merchant), Best Song (Burt Bacharach and Hal David for \"Alfie\") (a UK hit record for Cilla Black, but performed by Millicent Martin in the original UK release and Cher in the American release), Best Picture and Best Writing (Screenplay Based on Material from Another Medium).In 1967, the film won a Golden Globe for Best English-Language Foreign Film. For her performance as \"Lily\", Vivien Merchant also received the BAFTA Award for Most Promising Newcomer to Leading Film Roles.It was the second-most popular film at the British box office in 1966, after Thunderball.[11]In 2004, Total Film magazine named it the 48th greatest British film of all time.[12]","alfie":"Original release poster","edited_by":"Thelma Connell","budget":"$800,000[2]"}