{"country":"United Kingdom[1][2]|United States[4][5][6][contradictory]|","distributed_by":"20th Century Fox","screenplay_by":"Dan O'Bannon","story_by":"Dan O'Bannon|Ronald Shusett|","Legacy":"The success of Alien led 20th Century Fox to finance three direct sequels over the next eighteen years, each by different writers and directors. Sigourney Weaver remained the only recurring actor through all four films, and the story of her character Ripley's encounters with the Aliens became the thematic thread running through the series.[18] James Cameron's Aliens (1986) focused more on action and involved Ripley returning to the planetoid accompanied by marines to confront hordes of Aliens.[66] David Fincher's Alien 3 (1992) had nihilistic tones[51] and found her on a prison planet battling another Alien, ultimately sacrificing herself to prevent her employers from acquiring the creatures.[98] Jean-Pierre Jeunet's Alien: Resurrection (1997) saw Ripley resurrected through cloning to battle more Aliens even further in the future.[99]The success of the film series resulted in the creation of a media franchise with numerous novels, comic books, video games, toys, and other media and merchandise appearing over the years. A number of these began appearing under the Alien vs. Predator crossover imprint, which brought the Alien creatures together with the titular Predators of the Predator franchise. The film series eventually followed suit, with Paul W. S. Anderson's Alien vs. Predator (2004) and Colin and Greg Strause's Aliens vs. Predator: Requiem (2007). These stories are set in the 2000s.[100][101][102]Sigourney Weaver has expressed interest in reuniting with Ridley Scott to revive her character for another Alien film. In the 2003 commentary track for the Alien DVD included in the Alien Quadrilogy set, she and Scott both speculated on the possibility, with Weaver stating: \"There is an appetite for a fifth one, which is something I never expected...it's really hard to come up with a fifth story that's new and fresh...but I have wanted to go back into space...I think outer space adventure is a good thing for us right now, 'cause Earth is so grim...so we've been talking about it, but very generally.\"[26] Scott remarked that, if the series were to continue, the most logical course would be to explore the origins of the space jockey and the Aliens.[103] Weaver supported this idea, stating that \"I think it would be great to go back, because I'm asked that question so many times: 'Where did the Alien come from?' People really want to know in a very visceral way.\"[26] David Giler stated that he, Walter Hill, and Gordon Carroll, the producers of the first four films in the series, would not be willing to produce another unless it was about the Aliens' homeworld and Weaver was on board (although they were among the producers of Aliens vs. Predator and its sequel). Weaver, in turn, indicated that she would only return to the franchise if either Scott or James Cameron were directing.[104] Cameron had been working on a story for a fifth Alien film which would explore the origins of the creatures, but ceased work on it when he learned that Fox was pursuing Alien vs. Predator, which he felt would \"kill the validity of the franchise\".[105][106] Weaver has continued to express interest in another installment, stating in 2008 that \"I would definitely do another if I had a director like Ridley Scott and we had a good idea. Ridley is enthusiastic about it.\"[107]In July 2009, 20th Century Fox announced that Jon Spaihts had been hired to write a prequel to Alien, with Scott attached to direct.[108] The script was subsequently re-worked by Scott and Damon Lindelof. Titled Prometheus, it went into production in May 2011, and was subsequently released in 2012. Scott released a statement: \"While Alien was indeed the jumping-off point for this project, out of the creative process evolved a new, grand mythology and universe in which this original story takes place. The keen fan will recognize strands of Alien's DNA, so to speak, but the ideas tackled in this film are unique, large and provocative.\"[109]Variety reported on February 18, 2015 that a new Alien film will be directed by Neill Blomkamp.[110] On February 25, it was confirmed that Sigourney Weaver would have a role in the film.[111]\"The 1979 Alien is a much more cerebral movie than its sequels, with the characters (and the audience) genuinely engaged in curiosity about this weirdest of lifeforms...Unfortunately, the films it influenced studied its thrills but not its thinking.\"[18]Alien had both an immediate and long-term impact on the science fiction and horror genres. Shortly after its debut, Dan O'Bannon was sued by another writer named Jack Hammer for allegedly plagiarising a script entitled Black Space. However, O'Bannon was able to prove that he had written his Alien script first.[112] In the wake of Alien's success a number of other filmmakers imitated or adapted some of its elements, sometimes by copying its title. One of the first was The Alien Dead (1979), which was titled at the last minute to cash in on Alien's popularity.[113] Contamination (1980) was initially going to be titled Alien 2 until 20th Century Fox's lawyers contacted writer/director Luigi Cozzi and made him change it, and it built on press coverage of Alien's chestburster scene by having many similar creatures, which originated from large, slimy eggs, bursting from characters' chests.[113] An unauthorized sequel to Alien, titled Alien Terror (later Alien 2: On Earth), was released in 1980 and included alien creatures which incubate inside human hosts. Other science fiction films of the time that borrowed elements from Alien include Galaxy of Terror (1981), Inseminoid (1981), Forbidden World (1982), Xtro (1982), and Dead Space (1991).[113]The film studio The Asylum has produced two mockbuster based on the Alien franchise: AVH: Alien vs. Hunter (based on the crossover Alien vs. Predator: Requiem) and Alien Origin (based on Prometheus).Critics have analyzed Alien's sexual overtones. Following Barbara Creed's analysis of the Alien creature as a representation of the \"monstrous-feminine as archaic mother,\"[114] Ximena Gallardo C. and C. Jason Smith compared the facehugger's attack on Kane to a male rape and the chestburster scene to a form of violent birth, noting that the Alien's phallic head and method of killing the crew members add to the sexual imagery.[115][116] Dan O'Bannon has argued that the scene is a metaphor for the male fear of penetration, and that the \"oral invasion\" of Kane by the facehugger functions as \"payback\" for the many horror films in which sexually vulnerable women are attacked by male monsters.[117] McIntee claims that \"Alien is a rape movie as much as Straw Dogs (1971) or I Spit on Your Grave (1978), or The Accused (1988). On one level it's about an intriguing alien threat. On one level it's about parasitism and disease. And on the level that was most important to the writers and director, it's about sex, and reproduction by non-consensual means. And it's about this happening to a man.\"[118] He notes how the film plays on men's fear and misunderstanding of pregnancy and childbirth, while also giving women a glimpse into these fears.[119] Film analyst Lina Badley has written that the Alien's design, with strong Freudian sexual undertones, multiple phallic symbols, and overall feminine figure, provides an androgynous image conforming to archetypal mappings and imageries in horror films that often redraw gender lines.[120] O'Bannon himself later described the sexual imagery in Alien as overt and intentional: \"One thing that people are all disturbed about is sex... I said 'That's how I'm going to attack the audience; I'm going to attack them sexually. And I'm not going to go after the women in the audience, I'm going to attack the men. I am going to put in every image I can think of to make the men in the audience cross their legs. Homosexual oral rape, birth. The thing lays its eggs down your throat, the whole number.'\"[121]In the decades since its original release critics have analyzed and acknowledged Alien's roots in earlier works of fiction. It has been noted as sharing thematic similarities with earlier science fiction films such as The Thing from Another World (1951)[18][123] and It! The Terror from Beyond Space (1958)[38][80] as well as a kinship with other 1970s horror films such as Jaws (1975) and Halloween (1978).[18] Literary connections have also been suggested, including thematic comparisons to And Then There Were None (1939).[123] Many critics have also suggested that the film derives in part from A. E. van Vogt's The Voyage of the Space Beagle (1950), particularly the stories \"The Black Destroyer\", in which a cat-like alien infiltrates the ship and hunts the crew, and \"Discord in Scarlet\", in which an alien implants parasitic eggs inside crew members which then hatch and eat their way out.[124] O'Bannon, however, denies that this was a source of his inspiration for Alien's story.[33] Van Vogt initiated a lawsuit against 20th Century Fox over the similarities, but Fox settled out of court.[125] Rick Sanchez of IGN noted the \"striking resemblance\"[126] to Mario Bava's cult classic Planet of the Vampires (1965), especially in a celebrated sequence in which the crew discovers a ruin containing the skeletal remains of long dead giant beings, and in the design and shots of the ship itself, similar to the derelict spacecraft in Alien.[127] Despite the visual similarities, both O'Bannon and director Ridley Scott claimed in a 1979 interview that they had not seen Planet of the Vampires.[128]Writer David McIntee has also noted similarities to the Doctor Who episode \"The Ark in Space\" (1975), in which an insectoid queen alien lays larvae inside humans which later eat their way out, a life cycle inspired by that of the ichneumon wasp.[33] He has also noted similarities between the first half of the film, particularly in early versions of the script, to H.P. Lovecraft's At the Mountains of Madness, \"not in storyline, but in dread-building mystery\",[129] and calls the finished film \"the best Lovecraftian movie ever made, without being a Lovecraft adaptation\", due to its similarities in tone and atmosphere to Lovecraft's works.[51] In 2009, Dan O'Bannon said the film was \"strongly influenced, tone-wise, by Lovecraft, and one of the things it proved is that you can't adapt Lovecraft effectively without an extremely strong visual style ... What you need is a cinematic equivalent of Lovecraft's prose.\"[130] Regarding O'Bannon's initial Alien storyline, H. R. Giger stated, \"I liked it particularly because I found it was in the vein of Lovecraft, one of my greatest sources of inspiration.\"[131]Alien has continued to receive critical acclaim over the years, particularly for its realism and unique environment.[80] It has a 97% approval rating at the online review aggregator Rotten Tomatoes based on 89 reviews,[132] while Metacritic gives an 83% approval rating based on 22 reviews.[133] Critical interest in the film was re-ignited in part by the theatrical release of the \"Director's Cut\" in 2003. Despite having criticized Alien in 1980, Roger Ebert included it in his \"Great Movies\" column in 2003, ranking it among \"the most influential of modern action pictures\" and praising its pacing, atmosphere, and settings:One of the great strengths of Alien is its pacing. It takes its time. It waits. It allows silences (the majestic opening shots are underscored by Jerry Goldsmith with scarcely audible, far-off metallic chatterings). It suggests the enormity of the crew's discovery by building up to it with small steps: The interception of a signal (is it a warning or an SOS?). The descent to the extraterrestrial surface. The bitching by Brett and Parker, who are concerned only about collecting their shares. The masterstroke of the surface murk through which the crew members move, their helmet lights hardly penetrating the soup. The shadowy outline of the alien ship. The sight of the alien pilot, frozen in his command chair. The enormity of the discovery inside the ship (\"It's full of ... leathery eggs ...\").[18]McIntee praises Alien as \"possibly the definitive combination of horror thriller with science fiction trappings.\"[51] He notes, however, that it is a horror film first and a science fiction film second, since science fiction normally explores issues of how humanity will develop under other circumstances. Alien, on the other hand, focuses on the plight of people being attacked by a monster: \"It's set on a spaceship in the future, but it's about people trying not to get eaten by a drooling monstrous animal. Worse, it's about them trying not to get raped by said drooling monstrous animal.\"[51] Along with Halloween and Friday the 13th (1980), he describes it as a prototype for the slasher film genre: \"The reason it's such a good movie, and wowed both the critics, who normally frown on the genre, and the casual cinema-goer, is that it is a distillation of everything that scares us in the movies.\"[51] He also describes how the film appeals to a variety of audiences: \"Fans of Hitchcockian thrillers like it because it's moody and dark. Gorehounds like it for the chest-burster. Science fiction fans love the hard science fiction trappings and hardware. Men love the battle-for-survival element, and women love not being cast as the helpless victim.\"[134]David Edelstein wrote, \"Alien remains the key text in the 'body horror' subgenre that flowered (or, depending on your viewpoint, festered) in the seventies, and Giger’s designs covered all possible avenues of anxiety. Men traveled through vulva-like openings, got forcibly impregnated, and died giving birth to rampaging gooey vaginas dentate — how’s that for future shock? This was truly what David Cronenberg would call 'the new flesh,' a dissolution of the boundaries between man and machine, machine and alien, and man and alien, with a psychosexual invasiveness that has never, thank God, been equaled.\"[135]In 2002, Alien was deemed \"culturally, historically or aesthetically significant\" by the National Film Preservation Board of the United States,[15] and was inducted into the National Film Registry of the Library of Congress for historical preservation alongside other films of 1979 including All That Jazz, Apocalypse Now, The Black Stallion, and Manhattan.[14] In 2008 the American Film Institute ranked Alien as the seventh-best film in the science fiction genre as part of AFI's 10 Top 10, a CBS television special ranking the ten greatest movies in ten classic American film genres. The ranks were based on a poll of over 1,500 film artists, critics, and historians, with Alien ranking just above Terminator 2: Judgment Day (1991) and just below Ridley Scott's other science fiction film Blade Runner (1982).[16] The same year, Empire magazine ranked it thirty-third on its list of the five hundred greatest movies of all time, based on a poll of 10,200 readers, critics, and members of the film industry.[17]","Plot":"The commercial spacecraft Nostromo is on a return trip to Earth with a seven-member crew in stasis: Captain Dallas, Executive Officer Kane, Navigator Lambert, Science Officer Ash, Warrant Officer Ripley, and Engineers Parker and Brett. Detecting a mysterious transmission, possibly a distress signal, from a nearby planetoid, the ship's computer, MOTHER, awakens the crew. Following standard company policy for such situations, the Nostromo lands on the planetoid and Dallas, Kane, and Lambert head out to investigate, damaging their ship upon landing in dust. They discover the signal is coming from a derelict alien spacecraft. Inside, they find the remains of a large alien creature whose ribcage appears to have exploded from the inside.On the Nostromo, Ripley determines that the transmission is not a distress signal but a warning. In the alien ship, Kane discovers a chamber containing hundreds of eggs. As he inspects one, a creature springs out, spits acid through his space helmet and attaches itself to his face. Dallas and Lambert carry the unconscious Kane back to the Nostromo. As acting senior officer, Ripley refuses to let them aboard, citing quarantine regulations, but Ash violates protocol by overriding Ripley's lock and letting them in. The crew are unable to remove the creature from Kane's face, as its grip is strong and its blood is an extremely corrosive acid. It eventually lets go, crawls away, and dies.The crew repair and lift off. Kane awakens and seems healthy, but during the crew's final meal before re-entering stasis, he chokes and convulses in pain before a small alien creature bursts from his chest, killing him, and escapes into the depths of the ship. Since attacking the creature with conventional weapons could result in its corrosive blood breaching the ship's hull, the crew attempts to locate and capture it with motion trackers, nets, electric prods, and flamethrowers.Brett is sent to look for the crew's cat, Jones, and the now fully grown alien attacks him and disappears with his body into the air shafts. After a heated discussion, the group devises a plan to jettison the creature out of the ship. Dallas enters the Nostromo's labyrinthine ventilation shafts, intending to force the alien into an airlock, but it ambushes him. Lambert, realizing the alien is killing the crew one by one, implores the others to escape in the ship's shuttle. Now in command, Ripley explains that the shuttle will not support four people, and recommends that they continue with Dallas' plan of flushing the alien out.Accessing MOTHER, Ripley discovers that Ash has secretly been ordered to return the alien to the crew's employers, who consider the crew expendable. When Ripley confronts Ash, he tries to choke her to death. Parker intervenes and knocks off Ash's head, revealing him to be an android. Parker reanimates Ash's head, and Ripley interrogates him. They learn he was assigned to the Nostromo to convince the crew to capture the creature and return it for analysis, even at the expense of the human personnel. Ash taunts them about their chances of survival against the \"perfect organism.\" Parker turns a flamethrower on Ash.Ripley, Lambert and Parker agree to set the Nostromo to self-destruct and escape in the shuttle. However, Parker and Lambert are ambushed and killed by the alien while gathering life-support supplies. Ripley initiates the self-destruct sequence and heads for the shuttle with Jones, but the alien blocks her path. She retreats and unsuccessfully attempts to abort the self-destruct sequence, then returns to retrieve Jones, finding the alien gone. She narrowly escapes in the shuttle as the Nostromo explodes.As she prepares to enter stasis, Ripley discovers the Alien is aboard the shuttle. She dons a spacesuit and opens the shuttle's airlock, causing explosive decompression which forces the Alien into the shuttle's open doorway. She propels it into space by shooting it with a grappling hook, but the gun catches in the closing door, tethering the alien to the shuttle. Ripley activates the engines, blasting the alien into space. After recording the ship's final log entry, she places herself and Jones into stasis for the voyage home.","language":"English","box_office":"$104.9–203.6 million[7][8]","alien":"Theatrical release poster by Bill Gold","cinematography":"Derek Vanlint","Marketing":"Around and shortly after Alien's release in theaters, a number of merchandise items and media were released and sold to coincide with the film. These included a novelization by Alan Dean Foster, in both adult and \"junior\" versions, which was adapted from the film's shooting script.[58] Heavy Metal magazine published a comic strip adaptation of the film entitled Alien: The Illustrated Story, as well as a 1980 Alien calendar.[58] Two behind-the-scenes books were released in 1979 to accompany the film: The Book of Alien contained many production photographs and details on the making of the film, while Giger's Alien contained much of H. R. Giger's concept artwork for the movie.[58] A soundtrack album was released as an LP featuring selections of Goldsmith's score, and a single of the main theme was released in 1980.[61] A twelve-inch tall model kit of the Alien was released by the Model Products Corporation in the United States and by Airfix in the United Kingdom.[81] Kenner also produced a larger-scale Alien action figure, as well as a board game in which players raced to be first to reach the shuttle pod while Aliens roamed the Nostromo's corridors and air shafts.[81] Official Halloween costumes of the Alien were released for October 1979.[81] Several computer games based on the film were released, but not until several years after its theatrical run.[81]","directed_by":"Ridley Scott","Design":"O'Bannon brought in artists Ron Cobb and Chris Foss (with whom he had worked on Dark Star and Dune, respectively) to work on designs for the human aspects of the film such as the spaceship and space suits.[44][62] Cobb created hundreds of preliminary sketches of the interiors and exteriors of the ship, which went through many design concepts and possible names such as Leviathan and Snark as the script continued to develop. The final name of the ship was derived from the title of Joseph Conrad's 1904 novel Nostromo, while the escape shuttle, called Narcissus in the script, was named after Conrad's 1897 novella The Nigger of the 'Narcissus'.[63] The production team particularly praised Cobb's ability to depict the interior settings of the ship in a realistic and believable manner. Under Ridley Scott's direction the design of the Nostromo shifted towards an 800-foot-long (240 m) tug towing a refining platform 2 miles (3.2 km) long and 1.5 miles (2.4 km) wide.[30] Cobb also created some conceptual drawings of the Alien, but these were not used.[44][62] Moebius was attached to the project for a few days as well, and his costume renderings served as the basis for the final space suits created by costume designer John Mollo.[30][62]The sets of the Nostromo's three decks were each created almost entirely in one piece, with each deck occupying a separate stage and the various rooms connected via corridors. To move around the sets the actors had to navigate through the hallways of the ship, adding to the film's sense of claustrophobia and realism.[30][50][64] The sets used large transistors and low-resolution computer screens to give the ship a \"used\", industrial look and make it appear as though it was constructed of \"retrofitted old technology\".[53] Ron Cobb created industrial-style symbols and color-coded signs for various areas and aspects of the ship.[53] The company that owns the Nostromo is not named in the film, and is referred to by the characters as \"the company\". However, the name and logo of \"Weylan-Yutani\" appears on several set pieces and props such as computer monitors and beer cans.[63] Cobb created the name to imply a business alliance between Britain and Japan, deriving \"Weylan\" from the British Leyland Motor Corporation and \"Yutani\" from the name of his Japanese neighbor.[62][65] The 1986 sequel Aliens named the company as \"Weyland-Yutani\",[62][66] and it has remained a central aspect of the film franchise.Art Director Roger Christian used scrap metal and parts to create set pieces and props to save money, a technique he employed while working on Star Wars.[53][67] Some of the Nostromo's corridors were created from portions of scrapped bomber aircraft, and a mirror was used to create the illusion of longer corridors in the below-deck area.[53] Special effects supervisors Brian Johnson and Nick Allder made many of the set pieces and props function, including moving chairs, computer monitors, motion trackers, and flamethrowers.[25][30]H. R. Giger designed and worked on all of the alien aspects of the film, which he designed to appear organic and biomechanical in contrast to the industrial look of the Nostromo and its human elements.[30][53] For the interior of the derelict spacecraft and egg chamber he used dried bones together with plaster to sculpt much of the scenery and elements.[30][53] Veronica Cartwright described Giger's sets as \"so erotic...it's big vaginas and penises...the whole thing is like you're going inside of some sort of womb or whatever...it's sort of visceral\".[53] The set with the deceased alien creature, which the production team nicknamed the \"space jockey\", proved problematic as 20th Century Fox did not want to spend the money for such an expensive set that would only be used for one scene. Ridley Scott described the set as the cockpit or driving deck of the mysterious ship, and the production team was able to convince the studio that the scene was important to impress the audience and make them aware that this was not a B movie.[53][68] To save money only one wall of the set was created, and the \"space jockey\" sat atop a disc that could be rotated to facilitate shots from different angles in relation to the actors.[30][68] Giger airbrushed the entire set and the \"space jockey\" by hand.[53][68]The origin of the jockey creature was not explored in the film, but Scott later theorized that it might have been the ship's pilot, and that the ship might have been a weapons carrier capable of dropping Alien eggs onto a planet so that the Aliens could use the local lifeforms as hosts.[26] In early versions of the script the eggs were to be located in a separate pyramid structure which would be found later by the Nostromo crew and would contain statues and hieroglyphs depicting the Alien reproductive cycle, offering a contrast of the human, Alien, and space jockey cultures.[34] Cobb, Foss, and Giger each created concept artwork for these sequences, but they were eventually discarded due to budgetary concerns and the need to trim the length of the film.[30] Instead the egg chamber was set inside the derelict ship and was filmed on the same set as the space jockey scene; the entire disc piece supporting the jockey and its chair were removed and the set was redressed to create the egg chamber.[30] Light effects in the egg chamber were created by lasers borrowed from English rock band The Who. The band was testing the lasers for use in their stage show in the sound stage next door.[69]I resent films that are so shallow they rely entirely on their visual effects, and of course science fiction films are notorious for this. I've always felt that there's another way to do it: a lot of effort should be expended toward rendering the environment of the spaceship, or space travel, whatever the fantastic setting of your story should be–as convincingly as possible, but always in the background. That way the story and the characters emerge and they become more real.The spaceships and planets for the film were shot using models and miniatures. These included models of the Nostromo, its attached mineral refinery, the escape shuttle Narcissus, the alien planetoid, and the exterior and interior of the derelict spacecraft. Visual Effects Supervisor Brian Johnson, supervising modelmaker Martin Bower, and their team worked at Bray Studios, roughly 25 miles (40 km) from Shepperton Studios where principal filming was taking place.[70][71] The designs of the Nostromo and its attachments were based on combinations of Ridley Scott's storyboards and Ron Cobb's conceptual drawings.[70] The basic outlines of the models were made of wood and plastic, and most of the fine details were added from model kits of warships, tanks, and World War II bombers. Three models of the Nostromo were made: a 12-inch (30 cm) version for medium and long shots, a 4-foot (1.2 m) version for rear shots, and a 12-foot (3.7 m), 7-short-ton (6.4 t) rig for the undocking and planetoid surface sequences.[30][71] Scott insisted on numerous changes to the models even as filming was taking place, leading to conflicts with the modeling and filming teams. The Nostromo was originally yellow, and the team filmed shots of the models for six weeks before Johnson left to work on The Empire Strikes Back. Scott then ordered it changed to gray, and the team had to begin shooting again from scratch.[70][71] He ordered more and more pieces added to the model until the final large version with the refinery required a metal framework so that it could be lifted by a forklift. He also used a hammer and chisel on sections of the refinery, knocking off many of its spires which Bower had spent weeks creating. Scott also had disagreements with miniature effects cinematographer Dennis Ayling over how to light the models.[70]A separate model, approximately 40 feet (12 m) long, was created for the Nostromo's underside from which the Narcissus would detach and from which Kane's body would be launched during the funeral scene. Bower carved Kane's burial shroud out of wood and it was launched through the hatch using a small catapult and filmed at high speed, then slowed down in editing.[70][72] Only one shot was filmed using blue screen compositing: that of the shuttle racing past the Nostromo. The other shots were simply filmed against black backdrops, with stars added via double exposure.[71] Though motion control photography technology was available at the time, the film's budget would not allow for it. The team therefore used a camera with wide-angle lenses mounted on a drive mechanism to make slow passes over and around the models filming at 2½ frames per second,[30] giving them the appearance of motion. Scott added smoke and wind effects to enhance the illusion.[70] For the scene in which the Nostromo detaches from the refinery, a 30-foot (9.1 m) docking arm was created using pieces from model railway kits. The Nostromo was pushed away from the refinery by the forklift, which was covered in black velvet, causing the arm to extend out from the refinery. This created the illusion that the arm was pushing the ship forward.[70][71] Shots from outside the ship in which the characters are seen through windows moving around inside were filmed using larger models which contained projection screens showing pre-recorded footage.[70]A separate model was created for the exterior of the derelict alien spacecraft. Matte paintings were used to fill in areas of the ship's interior as well as exterior shots of the planetoid's surface.[70] The surface as seen from space during the landing sequence was created by painting a globe white, then mixing chemicals and dyes onto transparencies and projecting them onto it.[30][71] The planetoid was not named in the film, but some drafts of the script gave it the name Acheron[22] after the river which in Greek mythology is described as the \"stream of woe\", a branch of the river Styx, and which forms the border of Hell in Dante's Inferno. The 1986 sequel Aliens named the planetoid as \"LV-426\",[66] and both names have been used for it in subsequent expanded universe media such as comic books and video games.The scene of Kane inspecting the egg was shot during post-production. A fiberglass egg was used so that actor John Hurt could shine his light on it and see movement inside, which was provided by Ridley Scott fluttering his hands inside the egg while wearing rubber gloves.[68] The top of the egg opened via hydraulics, and the innards were made of a cow's stomach and tripe.[28][68] Initial test shots of the eggs were filmed using hen's eggs, and this footage was used in early teaser trailers. For this reason a hen's egg was used as the primary image for the film's advertising poster, and became a lasting image for the series as a whole rather than the Alien egg that actually appears in the film.[68]The \"facehugger\" and its proboscis, which was made of a sheep's intestine, were shot out of the egg using high-pressure air hoses. The shot was acted out and filmed in reverse, then reversed and slowed down in editing to prolong the effect and show more detail.[28][68] The facehugger itself was the first creature that Giger designed for the film, going through several versions in different sizes before deciding on a small creature with humanlike fingers and a long tail.[28][64] Dan O'Bannon drew his own version based on Giger's design, with help from Ron Cobb, which became the final version.[26][64] Cobb came up with the idea that the creature could have a powerful acid for blood, a characteristic that would carry over to the adult Alien and would make it impossible for the crew to kill it by conventional means such as guns or explosives, since the acid would burn through the ship's hull.[26][34] For the scene in which the dead facehugger is examined, Scott used pieces of fish and shellfish to create its viscera.[28][68]The design of the \"chestburster\" was inspired by Francis Bacon's 1944 painting Three Studies for Figures at the Base of a Crucifixion.[28] Giger's original design resembled a plucked chicken, which was redesigned and refined into the final version seen onscreen.[28] Screenwriter Dan O'Bannon credits his experiences with Crohn's disease for inspiring the chest-busting scene.[73]For the filming of the chestburster scene the cast members knew that the creature would be bursting out of Hurt, and had seen the chestburster puppet, but they had not been told that fake blood would also be bursting out in every direction from high-pressure pumps and squibs.[25][74] The scene was shot in one take using an artificial torso filled with blood and viscera, with Hurt's head and arms coming up from underneath the table. The chestburster was shoved up through the torso by a puppeteer who held it on a stick. When the creature burst through the chest a stream of blood shot directly at Veronica Cartwright, shocking her enough that she fell over and went into hysterics.[25][28][30] According to Tom Skerritt: \"What you saw on camera was the real response. She had no idea what the hell happened. All of a sudden this thing just came up.\"[28] The creature then runs off-camera, an effect accomplished by cutting a slit in the table for the puppeteer's stick to go through and passing an air hose through the puppet's tail to make it whip about.[28]The real-life surprise of the actors gave the scene an intense sense of realism and made it one of the film's most memorable moments. During preview screenings the crew noticed that some viewers would move towards the back of the theater so as not to be too close to the screen during the sequence.[56] In subsequent years the chestburster scene has often been voted as one of the most memorable moments in film.[75] In 2007, the British film magazine Empire named it as the greatest 18-rated moment in film as part of its \"18th birthday\" issue, ranking it above the decapitation scene in The Omen (1976) and the transformation sequence in An American Werewolf in London (1981).[76]For the scene in which Ash is revealed to be an android and has his head knocked off, a puppet was created of the character's torso and upper body which was operated from underneath by a small puppeteer.[50] During a preview screening of the film this scene caused an usher to faint.[56][77] In the following scene Ash's head is placed on a table and re-activated; for portions of this scene an animatronic head was made using a face cast of actor Ian Holm.[54] However, the latex of the head shrank while curing and the result was not entirely convincing.[50] For the bulk of the scene Holm knelt under the table with his head coming up through a hole and milk, caviar, pasta, fiber optics, and glass marbles were used to show the android's inner workings and fluids.[50][54]Giger made several conceptual paintings of the adult Alien before crafting the final version. He sculpted the creature's body using plasticine, incorporating pieces such as vertebrae from snakes and cooling tubes from a Rolls-Royce.[22][28] The creature's head was manufactured separately by Carlo Rambaldi, who had worked on the aliens in Close Encounters of the Third Kind.[72] Rambaldi followed Giger's designs closely, making some modifications in order to incorporate the moving parts which would animate the jaw and inner mouth.[28] A system of hinges and cables was used to operate the creature's rigid tongue, which protruded from the main mouth and had a second mouth at the tip of it with its own set of movable teeth.[28] The final head had about nine hundred moving parts and points of articulation.[28] Part of a human skull was used as the \"face\", and was hidden under the smooth, translucent cover of the head.[22] Rambaldi's original Alien jaw is now on display in the Smithsonian Institution,[54] while in April 2007 the original Alien suit was sold at auction.[78] Copious amounts of K-Y Jelly were used to simulate saliva and to give the Alien an overall slimy appearance.[28][64] The creature's vocalizations were provided by Percy Edwards, a voice artist famous for providing bird sounds for British television throughout the 1960s and 1970s as well as the whale sounds for Orca: Killer Whale (1977).[58][79]For most of the film's scenes the Alien was portrayed by Bolaji Badejo. A latex costume was specifically made to fit Badejo's 6-foot-10-inch (208 cm) slender frame, made by taking a full-body plaster cast of him.[28][30] Scott later commented that \"It's a man in a suit, but then it would be, wouldn't it? It takes on elements of the host – in this case, a man.\"[46] Badejo attended t'ai chi and mime classes in order to create convincing movements for the Alien.[22][28] For some scenes, such as when the Alien lowers itself from the ceiling to kill Brett, the creature was portrayed by stuntmen Eddie Powell and Roy Scammell;[30][31] in that scene a costumed Powell was suspended on wires and then lowered in an unfurling motion.[28][68]\"I've never liked horror films before, because in the end it's always been a man in a rubber suit. Well, there's one way to deal with that. The most important thing in a film of this type is not what you see, but the effect of what you think you saw.\"[30]Scott chose not to show the Alien in full through most of the film, showing only pieces of it while keeping most of its body in shadow in order to heighten the sense of terror and suspense. The audience could thus project their own fears into imagining what the rest of the creature might look like:[28] \"Every movement is going to be very slow, very graceful, and the Alien will alter shape so you never really know exactly what he looks like.\"[30] The Alien has been referred to as \"one of the most iconic movie monsters in film history\" in the decades since the film's release, being noted for its biomechanical appearance and sexual overtones.[80] Roger Ebert has remarked that \"Alien uses a tricky device to keep the alien fresh throughout the movie: It evolves the nature and appearance of the creature, so we never know quite what it looks like or what it can do...The first time we get a good look at the alien, as it bursts from the chest of poor Kane (John Hurt). It is unmistakably phallic in shape, and the critic Tim Dirks mentions its 'open, dripping vaginal mouth.'\"[18]","production_companies":"20th Century-Fox (London) Brandywine-Ronald Shushett production[1][2]","release_dates":"May 25, 1979 (1979-05-25) (United States)|September 6, 1979 (1979-09-06) (United Kingdom)||||","Production":"While studying cinema at the University of Southern California, Dan O'Bannon had made a science fiction comedy film with director John Carpenter and concept artist Ron Cobb entitled Dark Star.[32] The film included an alien which had been created using a spray-painted beach ball, and the experience left O'Bannon \"really wanting to do an alien that looked real.\"[32][33] A few years later he began working on a similar story that would focus more on horror: \"I knew I wanted to do a scary movie on a spaceship with a small number of astronauts\", he later recalled, \"Dark Star as a horror movie instead of a comedy.\"[32] Ronald Shusett, meanwhile, was working on an early version of what would eventually become Total Recall.[32][33] Impressed by Dark Star, he contacted O'Bannon and the two agreed to collaborate on their projects, choosing to work on O'Bannon's film first as they believed it would be less costly to produce.[32][33] O'Bannon had written twenty-nine pages of a script titled Memory comprising what would become the film's opening scenes: a crew of astronauts awaken to find that their voyage has been interrupted because they are receiving a signal from a mysterious planetoid. They investigate and their ship breaks down on the surface.[30][33] He did not yet, however, have a clear idea as to what the alien antagonist of the story would be.[32]O'Bannon soon accepted an offer to work on Alejandro Jodorowsky's film adaptation of Dune, a project which took him to Paris for six months.[32][34] Though the project ultimately fell through, it introduced him to several artists whose works gave him ideas for his science-fiction story including Chris Foss, H. R. Giger, and Jean \"Moebius\" Giraud.[30] O'Bannon was impressed by Foss's covers for science fiction books, while he found Giger's work \"disturbing\":[32] \"His paintings had a profound effect on me. I had never seen anything that was quite as horrible and at the same time as beautiful as his work. And so I ended up writing a script about a Giger monster.\"[30] After the Dune project collapsed O'Bannon returned to Los Angeles to live with Shusett and the two revived his Memory script. Shusett suggested that O'Bannon use one of his other film ideas, about gremlins infiltrating a B-17 bomber during World War II, and set it on the spaceship as the second half of the story.[30][34] The working title of the project was now Star Beast, but O'Bannon disliked this and changed it to Alien after noting the number of times that the word appeared in the script. He and Shusett liked the new title's simplicity and its double meaning as both a noun and adjective.[30][32][35] Shusett came up with the idea that one of the crew members could be implanted with an alien embryo that would later burst out of him, feeling that this was an interesting plot device by which the alien creature could get aboard the ship.[32][34]Dan [O'Bannon] put his finger on the problem: what has to happen next is the creature has to get on the ship in an interesting way. I have no idea how, but if we could solve that, if it can't be that it just snuck in, then I think the whole movie will come into place. In the middle of the night, I woke up and I said, \"Dan I think I have an idea: the alien screws one of them [...] it jumps on his face and plants its seed!\" And Dan says, oh my god, we've got it, we've got the whole movie.In writing the script, O'Bannon drew inspiration from many previous works of science fiction and horror. He later stated that \"I didn't steal Alien from anybody. I stole it from everybody!\"[38] The Thing from Another World (1951) inspired the idea of professional men being pursued by a deadly alien creature through a claustrophobic environment.[38] Forbidden Planet (1956) gave O'Bannon the idea of a ship being warned not to land, and then the crew being killed one by one by a mysterious creature when they defy the warning.[38] Planet of the Vampires (1965) contains a scene in which the heroes discover a giant alien skeleton; this influenced the Nostromo crew's discovery of the alien creature in the derelict spacecraft.[38] O'Bannon has also noted the influence of \"Junkyard\" (1953), a short story by Clifford D. Simak in which a crew lands on an asteroid and discovers a chamber full of eggs.[33] He has also cited as influences Strange Relations by Philip José Farmer (1960), which covers alien reproduction, and various EC Comics horror titles carrying stories in which monsters eat their way out of people.[33]With roughly eighty-five percent of the plot completed, Shusett and O'Bannon presented their initial script to several studios,[32] pitching it as \"Jaws in space.\"[39] They were on the verge of signing a deal with Roger Corman's studio when a friend offered to find them a better deal and passed the script on to Gordon Carroll, David Giler, and Walter Hill, who had formed a production company called Brandywine with ties to 20th Century Fox.[32][40] O'Bannon and Shusett signed a deal with Brandywine, but Hill and Giler were not satisfied with the script and made numerous rewrites and revisions to it.[32][41] This caused tension with O'Bannon and Shusett, since Hill and Giler had very little experience with science fiction and according to Shusett: \"They weren't good at making it better, or in fact at not making it even worse.\"[32] O'Bannon believed that they were attempting to justify taking his name off of the script and claiming it as their own.[32] Hill and Giler did add some substantial elements to the story, however, including the android character Ash which O'Bannon felt was an unnecessary subplot,[26] but which Shusett later described as \"one of the best things in the movie...That whole idea and scenario was theirs.\"[32] In total Hill and Giler went through eight different drafts of the script, mostly concentrating on the Ash subplot but also making the dialogue more natural and trimming some sequences set on the alien planetoid.[42]Despite the multiple rewrites, 20th Century Fox did not express confidence in financing a science-fiction film. However, after the success of Star Wars in 1977 the studio's interest in the genre rose substantially. According to Carroll: \"When Star Wars came out and was the extraordinary hit that it was, suddenly science fiction became the hot genre.\" O'Bannon recalled that \"They wanted to follow through on Star Wars, and they wanted to follow through fast, and the only spaceship script they had sitting on their desk was Alien\".[32] Alien was greenlit by 20th Century Fox at an initial budget of $4.2 million.[32][42] Alien was funded by American dollars, but made by Twentieth Century-Fox's British production subsidiary.[43]O'Bannon had originally assumed that he would direct Alien, but 20th Century Fox instead asked Hill to direct.[42][44] Hill declined due to other film commitments as well as not being comfortable with the level of visual effects that would be required.[45] Peter Yates, Jack Clayton, and Robert Aldrich were considered for the task, but O'Bannon, Shusett, and the Brandywine team felt that these directors would not take the film seriously and would instead treat it as a B monster movie.[44][46] Giler, Hill, and Carroll had been impressed by Ridley Scott's debut feature film The Duellists (1977) and made an offer to him to direct Alien, which Scott quickly accepted.[30][46] Scott created detailed storyboards for the film in London, which impressed 20th Century Fox enough to double the film's budget from $4.2 million to $8.4 million.[20][44] His storyboards included designs for the spaceship and space suits, drawing influences from films such as 2001: A Space Odyssey and Star Wars.[20] However, he was keen on emphasizing horror in Alien rather than fantasy, describing the film as \"The Texas Chain Saw Massacre of science fiction\".[44][46]O'Bannon introduced Scott to the artwork of H. R. Giger; both of them felt that his painting Necronom IV was the type of representation they wanted for the film's antagonist and began asking the studio to hire him as a designer.[44][46] 20th Century Fox initially believed Giger's work was too ghastly for audiences, but the Brandywine team were persistent and eventually won out.[46] According to Gordon Carroll: \"The first second that Ridley saw Giger's work, he knew that the biggest single design problem, maybe the biggest problem in the film, had been solved.\"[44] Scott flew to Zürich to meet Giger and recruited him to work on all aspects of the Alien and its environment including the surface of the planetoid, the derelict spacecraft, and all four forms of the Alien from the egg to the adult.[44][46]Casting calls and auditions for Alien were held in both New York and London.[20] With only seven human characters in the story, Scott sought to hire strong actors so he could focus most of his energy on the film's visual style.[20] He employed casting director Mary Selway, who had worked with him on The Duellists, to head the casting in the United Kingdom, while Mary Goldberg handled casting in the United States.[21][47] In developing the story O'Bannon had focused on writing the Alien first, putting off developing the characters for a later draft.[44] He and Shusett had therefore written all of the roles as generic male ones with a note in the script explicitly stating \"The crew is unisex and all parts are interchangeable for men or women.\"[21][48] This left Scott, Selway, and Goldberg free to interpret the characters as they liked and to cast accordingly. They wanted the Nostromo's crew to resemble working astronauts in a realistic environment, a concept summed up as \"truckers in space\".[20][21] According to Scott, this concept was inspired partly by Star Wars, which deviated from the pristine future often depicted in science fiction films of the time.[49]To assist the actors in preparing for their roles, Ridley Scott wrote several pages of backstory for each character explaining their histories.[42][50] He filmed many of their rehearsals in order to capture spontaneity and improvisation, and tensions between some of the cast members, particularly towards the less-experienced Weaver, translated convincingly on film as tension between their respective characters.[50]Film critic Roger Ebert notes that the actors in Alien were older than was typical in thriller films at the time, which helped make the characters more convincing:None of them were particularly young. Tom Skerritt, the captain, was 46, Hurt was 39 but looked older, Holm was 48, Harry Dean Stanton was 53, Yaphet Kotto was 42, and only Veronica Cartwright at 30 and Weaver at 29 were in the age range of the usual thriller cast. Many recent action pictures have improbably young actors cast as key roles or sidekicks, but by skewing older, Alien achieves a certain texture without even making a point of it: These are not adventurers but workers, hired by a company to return 20 million tons of ore to Earth.[18]David McIntee, author of Beautiful Monsters: The Unofficial and Unauthorised Guide to the Alien and Predator Films, asserts that part of the film's effectiveness in frightening viewers \"comes from the fact that the audience can all identify with the characters...Everyone aboard the Nostromo is a normal, everyday, working Joe just like the rest of us. They just happen to live and work in the future.\"[51]Alien was filmed over fourteen weeks from July 5 to October 21, 1978. Principal photography took place at Shepperton Studios near London, while model and miniature filming was done at Bray Studios in Water Oakley, Berkshire.[47] Production time was short due to the film's low budget and pressure from 20th Century Fox to finish on schedule.[50] A crew of over 200 workmen and technicians constructed the three principal sets: The surface of the alien planetoid and the interiors of the Nostromo and derelict spacecraft.[30] Art Director Les Dilley created 1/24th scale miniatures of the planetoid's surface and derelict spacecraft based on Giger's designs, then made moulds and casts and scaled them up as diagrams for the wood and fiberglass forms of the sets.[20] Tons of sand, plaster, fiberglass, rock, and gravel were shipped into the studio to sculpt a desert landscape for the planetoid's surface, which the actors would walk across wearing space suit costumes.[30] The suits themselves were thick, bulky, and lined with nylon, had no cooling systems and, initially, no venting for their exhaled carbon dioxide to escape.[52] Combined with a heat wave, these conditions nearly caused the actors to pass out and nurses had to be kept on-hand with oxygen tanks.[50][52] For scenes showing the exterior of the Nostromo, a 58-foot (18 m) landing leg was constructed to give a sense of the ship's size. Ridley Scott still did not think that it looked large enough, so he had his two sons and the son of one of the cameramen stand in for the regular actors, wearing smaller space suits to make the set pieces seem larger.[52][53] The same technique was used for the scene in which the crew members encounter the dead alien creature in the derelict spacecraft. The children nearly collapsed due to the heat of the suits, and eventually oxygen systems were added to assist the actors in breathing.[50][52] Four identical cats were used to portray Jones, the Nostromo crew's pet.[47] During filming Sigourney Weaver discovered that she was allergic to the combination of cat hair and the glycerin placed on the actors' skin to make them appear sweaty. By removing the glycerin she was able to continue working with the cats.[25][50]Alien originally was to conclude with the destruction of the Nostromo while Ripley escapes in the shuttle Narcissus. However, Ridley Scott conceived of a \"fourth act\" to the film in which the Alien appears on the shuttle and Ripley is forced to confront it. He pitched the idea to 20th Century Fox and negotiated an increase in the budget to film the scene over several extra days.[26][54] Scott had wanted the Alien to bite off Ripley's head and then make the final log entry in her voice, but the producers vetoed this idea as they believed that the Alien had to die at the end of the film.[54]Editing and post-production work on Alien took roughly twenty weeks to complete.[55] Terry Rawlings served as Editor, having previously worked with Scott on editing sound for The Duellists.[55] Scott and Rawlings edited much of the film to have a slow pace to build suspense for the more tense and frightening moments. According to Rawlings: \"I think the way we did get it right was by keeping it slow, funny enough, which is completely different from what they do today. And I think the slowness of it made the moments that you wanted people to be sort of scared...then we could go as fast as we liked because you've sucked people into a corner and then attacked them, so to speak. And I think that's how it worked.\"[55] The first cut of the film was over three hours long; further editing trimmed the final version to just under two hours.[55][56]One scene that was cut from the film occurred during Ripley's final escape from the Nostromo: she encounters Dallas and Brett who have been partially cocooned by the Alien. O'Bannon had intended the scene to indicate that Brett was becoming an Alien egg while Dallas was held nearby to be implanted by the resulting facehugger.[40] Production Designer Michael Seymour later suggested that Dallas had \"become sort of food for the alien creature\",[53] while Ivor Powell suggested that \"Dallas is found in the ship as an egg, still alive.\"[55] Scott remarked that \"they're morphing, metamorphosing, they are changing into...being consumed, I guess, by whatever the Alien's organism is...into an egg.\"[26] The scene was cut partly because it did not look realistic enough and partly because it slowed the pace of the escape sequence.[40][54] Tom Skerritt remarked that \"The picture had to have that pace. Her trying to get the hell out of there, we're all rooting for her to get out of there, and for her to slow up and have a conversation with Dallas was not appropriate.\"[55] The footage was included amongst other deleted scenes as a special feature on the Laserdisc release of Alien, and a shortened version of it was re-inserted into the 2003 \"Director's Cut\" which was re-released in theaters and on DVD.[40][57]The musical score for Alien was composed by Jerry Goldsmith, conducted by Lionel Newman, and performed by the National Philharmonic Orchestra. Ridley Scott had originally wanted the film to be scored by Isao Tomita, but 20th Century Fox wanted a more familiar composer and Goldsmith was recommended by then-President of Fox Alan Ladd, Jr.[58] Goldsmith wanted to create a sense of romanticism and lyrical mystery in the film's opening scenes, which would build throughout the film to suspense and fear.[55] Scott did not like Goldsmith's original main title piece, however, so Goldsmith rewrote it as \"the obvious thing: weird and strange, and which everybody loved.\"[55][58] Another source of tension was editor Terry Rawlings' choice to use pieces of Goldsmith's music from previous films, including a piece from Freud: The Secret Passion, and to use an excerpt from Howard Hanson's Symphony No. 2 (\"Romantic\") for the end credits.[55][58][59][60]Scott and Rawlings had also become attached to several of the musical cues they had used for the temporary score while editing the film, and re-edited some of Goldsmith's cues and re-scored several sequences to match these cues and even left the temporary score in place in some parts of the finished film.[55] Goldsmith later remarked that \"you can see that I was sort of like going at opposite ends of the pole with the filmmakers of the picture.\"[55] Nevertheless, Scott praised Goldsmith's score as \"full of dark beauty\"[58] and \"seriously threatening, but beautiful.\"[55] It was nominated for a Golden Globe Award for Best Original Score, a Grammy Award for Best Soundtrack Album, and a BAFTA Award for Best Film Music.[13] The score has been released as a soundtrack album in several versions with different tracks and sequences.[61]","produced_by":"Gordon Carroll|David Giler|Walter Hill|","starring":"Tom Skerritt|Sigourney Weaver|Veronica Cartwright|Harry Dean Stanton|John Hurt|Ian Holm|Yaphet Kotto|","running_time":"117 minutes[3]","music_by":"Jerry Goldsmith","edited_by":"Terry Rawlings|Peter Weatherley|","Release":"\"It was the most incredible preview I've ever been in. I mean, people were screaming and running out of the theater.\"[77]An initial screening of Alien for 20th Century Fox representatives in St. Louis suffered from poor sound in the theater. A subsequent screening in a newer theater in Dallas went significantly better, eliciting genuine fright from the audience.[77] Two theatrical trailers were shown to the public. The first consisted of rapidly changing still images set to some of Jerry Goldsmith's electronic music from Logan's Run. The second used test footage of a hen's egg set to part of Goldsmith's Alien score.[56] The film was previewed in various American cities in the spring of 1979[56] and was promoted by the tagline \"In space no one can hear you scream.\"[77][82]Alien was rated \"R\" in the United States, \"X\" in the United Kingdom, and \"M\" in Australia.[47] In the UK, the British Board of Film Classification almost passed the film as an \"AA\" (for ages 14 and over), although there were concerns over the prevalent sexual imagery. 20th Century Fox eventually relented in pushing for an AA certificate after deciding that an X rating would be a better choice commercially for selling a horror film.[83]Alien opened in American theaters on May 25, 1979.[82] The film had no formal premiere, yet moviegoers lined up for blocks to see it at Grauman's Egyptian Theatre in Hollywood where a number of models, sets, and props were displayed outside to promote it during its first run.[56][77] Religious zealots set fire to the model of the space jockey, believing it to be the work of the devil.[56] In the United Kingdom, Alien premiered at a gala performance at the Edinburgh Film Festival on September 1, 1979,[84][85] before starting an exclusive run at the Odeon Leicester Square in London on September 6, 1979, but it did not open widely in Britain until January 13, 1980.[56]Critical reaction to the film was initially mixed. Some critics who were not usually favorable towards science fiction, such as Barry Norman of the BBC's Film series, were positive about the film's merits.[56] Others, however, were not: Reviews by Variety, Sight and Sound, Vincent Canby and Leonard Maltin were mixed or negative.[86] (Maltin, however, reassessed the film upon the release of the Director's Cut and gave Alien a positive review.[87]) A review by Time Out said the film was an \"empty bag of tricks whose production values and expensive trickery cannot disguise imaginative poverty\".[88] In a 1980 episode of Sneak Previews discussing science fiction films of the 1950s and 1970s, critics Gene Siskel and Roger Ebert were critical of Alien. Ebert called it \"basically just an intergalactic haunted house thriller set inside a spaceship\" and one of several science fiction pictures that were \"real disappointments\" compared to Star Wars, Close Encounters of the Third Kind, and 2001: A Space Odyssey, though he did compliment the early scene of the Nostromo's crew exploring the alien planet as showing \"real imagination\".[89] However, the film later made it onto Ebert's Great Movies list, giving it four stars and stating, \"Ridley Scott's 1979 movie is a great original.\"[90]The film was a commercial success, making $78,900,000 in the United States and £7,886,000 in the United Kingdom during its first run.[56] It ultimately grossed $80,931,801 in the United States, though international box office figures have varied from $24,000,000 to $122,700,000. Its total worldwide gross has been listed within the range of $104,931,801[8] to $203,630,630.[7]According to 20th Century Fox accounts, however, by April 1980 when the film had earned a reported $100 million at the box office, after advertising, distribution fees, penalties and other costs were deducted, it was still recorded as having made a loss to the studio of $2.4 million. This was seen as an example of Hollywood creative accounting and was much criticised.[91] By August 1980 Fox was saying the film was $4 million in profit.[92]Alien won the 1979 Academy Award for Visual Effects and was also nominated for Best Art Direction (for Michael Seymour, Leslie Dilley, Roger Christian, and Ian Whittaker).[10][13] It won Saturn Awards for Best Science Fiction Film, Best Direction for Ridley Scott, and Best Supporting Actress for Veronica Cartwright,[12] and was also nominated in the categories of Best Actress for Sigourney Weaver, Best Make-up for Pat Hay, Best Special Effects for Brian Johnson and Nick Allder, and Best Writing for Dan O'Bannon.[13] It was also nominated for British Academy of Film and Television Arts (BAFTA) awards for Best Costume Design for John Mollo, Best Editing for Terry Rawlings, Best Supporting Actor for John Hurt, and Most Promising Newcomer to Leading Film Role for Sigourney Weaver.[13] It also won a Hugo Award for Best Dramatic Presentation and was nominated for a British Society of Cinematographers award for Best Cinematography for Derek Vanlint, as well as a Silver Seashell award for Best Cinematography and Special Effects at the San Sebastián International Film Festival.[13] Jerry Goldsmith's score received nominations for the Golden Globe Award for Best Original Score, the Grammy Award for Best Soundtrack Album, and a BAFTA Award for Best Film Music.[13]Alien has been released in many home video formats and packages over the years. The first of these was a seventeen-minute Super-8 version for home projectionists.[81] It was also released on both VHS and Betamax for rental, which grossed it an additional $40,300,000 in the United States alone.[56] Several VHS releases were subsequently sold both singly and as boxed sets. LaserDisc and Videodisc versions followed, including deleted scenes and director commentary as bonus features.[81][93] A VHS box set containing Alien and its sequels Aliens and Alien 3 was released in facehugger-shaped boxes, and included some of the deleted scenes from the Laserdisc editions.[93] When Alien: Resurrection premiered in theaters, another set of the first three films was released including a Making of Alien: Resurrection tape. A few months later the set was re-released with the full version of Alien: Resurrection taking the place of the making-of video.[93] Alien was released on DVD in 1999, both singly and, as The Alien Legacy, packaged with Aliens, Alien 3 and Alien: Resurrection.[94] This set, which was also released in a VHS version, included a commentary track by Ridley Scott.[81][93] The first three films of the series have also been packaged as the Alien Triple Pack.\"The traditional definition of the term 'Director's Cut' suggests the restoration of a director's original vision, free of any creative limitations. It suggests that the filmmaker has finally overcome the interference of heavy-handed studio executives, and that the film has been restored to its original, untampered form. Such is not the case with Alien: The Director's Cut. It's a completely different beast.\"[95]In 2003 20th Century Fox was preparing the Alien Quadrilogy DVD box set, which would include Alien and its three sequels. In addition, the set would also include alternate versions of all four films in the form of \"special editions\" and \"director's cuts\". Fox approached Ridley Scott to digitally restore and remaster Alien, and to restore several scenes which had been cut during the editing process for inclusion in an expanded version of the film.[95] Upon viewing the expanded version, Scott felt that it was too long and chose to recut it into a more streamlined alternate version:Upon viewing the proposed expanded version of the film, I felt that the cut was simply too long and the pacing completely thrown off. After all, I cut those scenes out for a reason back in 1979. However, in the interest of giving the fans a new experience with Alien, I figured there had to be an appropriate middle ground. I chose to go in and recut that proposed long version into a more streamlined and polished alternate version of the film. For marketing purposes, this version is being called \"The Director's Cut.\"[95]The \"Director's Cut\" restored roughly four minutes of deleted footage while cutting about five minutes of other material, leaving it about a minute shorter than the theatrical cut.[56] Many of the changes were minor, such as altered sound effects, while the restored footage included the scene in which Ripley discovers the cocooned Dallas and Brett during her escape of the Nostromo. Fox decided to release the Director's Cut in theaters, and it premiered on October 31, 2003.[56] The Alien Quadrilogy box set was released December 2, 2003, with both versions of the film included along with a new commentary track featuring many of the film's actors, writers, and production staff, as well as other special features and a documentary entitled The Beast Within: The Making of Alien. Each film was also released separately as a DVD with both versions of the film included. Scott noted that he was very pleased with the original theatrical cut of Alien, saying that \"For all intents and purposes, I felt that the original cut of Alien was perfect. I still feel that way\", and that the original 1979 theatrical version \"remains my version of choice\".[95] He has since stated that he considers both versions \"director's cuts\", as he feels that the 1979 version was the best he could possibly have made it at the time.[95]The Alien Quadrilogy set earned Alien a number of new awards and nominations. It won DVDX Exclusive Awards for Best Audio Commentary and Best Overall DVD, Classic Movie, and was also nominated for Best Behind-the-Scenes Program and Best Menu Design.[13] It also won a Sierra Award for Best DVD, and was nominated for a Saturn Award for Best DVD Collection and Golden Satellite Awards for Best DVD Extras and Best Overall DVD.[13] In 2010 both the theatrical version and Director's Cut of Alien were released on Blu-ray Disc, as a stand-alone release and as part of the Alien Anthology set.[96]In 2014, to mark the film's 35th anniversary, a special re-release box set named Alien: 35th Anniversary Edition, containing the film on Blu-ray, a digital copy, a reprint of Alien: The Illustrated Story, and a series of collectible art cards containing artwork by H.R. Giger related to the film, was released.[97] The disk itself is the same as the respective disk on the 2010 Anthology Blu-ray release, and contains MU-TH-UR mode, despite the lack of the required bonus disk.[jargon] A reprint of the novel by Alan Dean Foster was also released.","budget":"$9–11 million[7][8][9]"}