{"mandarin":"Yīng Xióng Běn Sè","country":"Hong Kong","distributed_by":"Cinema City & Films Co.","screenplay_by":"John Woo|Chan Hing-kai|Leung Suk-wah|","Plot":"Sung Tse-Ho (Ti Lung) works for the Triad, whose principal operation is printing and distributing counterfeit US bank notes. Ho is a respected member of the organization and is entrusted the most important transactions. Mark Lee (Chow Yun-Fat), another high-ranking member of the group,[3] is his best friend and partner in crime.Ho is close to his younger brother, Kit (Leslie Cheung), who is training to become a police officer. Ho keeps his criminal life secret from his brother and encourages Kit's career choice. Ho's father is aware of Ho's criminal activities and appeals to him to go straight. Ho agrees, deciding that his next deal in Taiwan will be his last one before leaving the Triad. Shing (Waise Lee), a new member, is sent along as an apprentice. The deal turns out to be a trap by the Taiwanese gang. A shootout ensues in which Ho and Shing flee, pursued by local law enforcement.Meanwhile, a gang member attempts to kidnap Ho's father to ensure Ho's silence if he is caught by police; in the ensuing fight also involving Kit and his girlfriend, Ho's father is killed. Just before dying, he pleads with Kit to forgive his brother. Ho eventually surrenders to the police in order to buy time for Shing to escape. After learning of Ho's capture, Mark finds and kills the Taiwanese gang leader and his bodyguards. However, Mark's leg is shot in the gunfight, leaving him crippled.Ho is released from prison three years later. Remorseful and determined to start a new life, he finds work as a driver for a taxi company, run by another ex-con. Ho spots Mark during one of his shifts; in contrast to Mark's letters, he realizes that Mark has been reduced to an errand boy for Shing (who is the new leader of the Triad). During an emotional reunion, Mark asks Ho to take revenge on Shing and reclaim their positions in the organization, but Ho refuses.Ho seeks Kit out and attempts to reconcile with his brother (who is now a police officer), but is disowned by Kit, who sees Ho as a criminal who is responsible for their father's death. Additionally, Kit is resentful that his familial tie to Ho is preventing him from advancement in the department. In an effort to prove himself to his superiors and further distance himself from his brother's criminal past, Kit becomes obsessed with bringing down Shing's criminal group, despite Ho's warnings to stay away from the dangerous case.Shing finds Ho and presses him to come back to his organization, offering to reinstate Mark if he returns. Ho flatly refuses. Consequently, Shing begins harassing Ho in order to get him to return, including luring Kit into a trap and injuring Kit, attacking Ho's co-workers, and having Mark beaten severely. Ho is dismayed but is still hesitant to take action, but an impassioned speech by Mark finally convinces Ho to join Mark in taking revenge on Shing.Mark steals incriminating evidence from the counterfeiting business and wins a shootout with gang members, with Ho arriving to aid Mark's escape. The film then reveals that it was Shing who betrayed Ho three years ago in Taiwan. Ho and Mark use the evidence to ransom Shing in exchange for money and an escape boat. However, Ho ensures that the evidence is passed to Kit to hand to the police. Using Shing as a hostage, Ho and Mark take the money to a pier, where Shing's men await. There, Ho persuades Mark to escape by himself in the boat.After Mark leaves, Kit arrives on the scene intending to make an arrest where he is captured by Shing's men. A deal is made to exchange Shing with Kit, but the trade explodes into a wild shootout. Ho and Kit are wounded, but Mark returns with guns blazing out of loyalty to Ho. After Ho, Kit and Mark kill many of Shing's men, Mark berates Kit, telling him that Ho's actions had atoned for whatever wrongdoings he had done in the past. Mark is in turn killed by Shing.As the police approach, Shing mocks Ho (who has run out of ammunition), stating that he will surrender, but his money and power will ensure his swift release. Kit, finally seeing eye to eye with his brother, hands Ho a revolver, with which Ho kills Shing. Immediately afterwards, Ho handcuffs himself to Kit, expressing his desire for redemption and his admiration that Kit always walked the right path. The film ends with the reconciled brothers walking together towards the gathered crowd of police.","language":"Cantonese","a_better_tomorrow":"Theatrical release poster","cantonese":"Jing1 hung4 bun2 sik1","box_office":"HK$34.7 million","cinematography":"Wong Wing-hang","directed_by":"John Woo","traditional":"英雄本色","simplified":"英雄本色","production_companies":"Cinema City Company Limited Film Workshop","release_dates":"2 August 1986 (1986-08-02)|||||","Box office":"A Better Tomorrow grossed $34,651,324 HKD at the Hong Kong box office, ensuring that sequels and imitators would not be far behind.[4]","produced_by":"Tsui Hark","starring":"Ti Lung|Leslie Cheung|Chow Yun-fat|Emily Chu|Waise Lee|Kenneth Tsang|Shi Yanzi|Tien Feng|John Woo|Kam Hing-yin|Leung Ming|Shing Fui-On|Wang Hsieh|","running_time":"95 minutes","Theme song":"The film's theme song is \"In the Sentimental Past\" (當年情), performed by lead Leslie Cheung, composed and arranged by Joseph Koo and written by Wong Jim.","music_by":"Joseph Koo","edited_by":"Kam Ma"}