{"country":"Canada","distributed_by":"Jensen Farley Pictures","curtains":"Official 1983 one-sheet poster","Plot":"Samantha Sherwood, a beautiful actress and muse for director Jonathan Stryker, has herself committed to a mental institution as method preparation for the titular role of a mentally unstable woman in a film called Audra. Once finding out Stryker is letting a new group of girls audition for the role of Audra, she escapes the asylum for revenge.One of the girls invited to audition, fledgling actress Amanda Teuther, has a dream that while driving to the audition, she is stopped by a large porcelain doll standing in the middle of the road; when she leaves her car to move it, she is run over. She awakens from her dream, only to be stabbed to death in her apartment.The next day, we are introduced to the five other women auditioning for the part of Audra who have all been invited to Stryker's mansion. They are comedian Patti O'Connor, veteran actress Brooke Parsons, dancer Laurian Summers, musician Tara DeMillo, and professional ice-skater Christie Burns. A caretaker named Matthew is also introduced. Samantha appears at the house uninvited during dinner. The girls spend their first night in the mansion getting acquainted; Tara has sex with Matthew in a jacuzzi and Christie reluctantly is seduced by Stryker.The next morning, Christie goes to a nearby pond to ice skate. She notices a small hand protruding out of the snow at the edge of the pond, and uncovers a porcelain doll. She is then attacked and decapitated with a sickle by someone in a grotesque hag mask.Later that day, after the killer watches a drunk Matthew ride away on a snowmobile, Patti is given an impromptu audition with Stryker and nearly bombs, due to nerves. While Tara and Laurian are auditioning, Brooke discovers Christie's severed head in a toilet bowl. She frantically informs Stryker of what she's seen, but when they go back to the bathroom, the toilet is empty. Exploiting Brooke's vulnerability, Stryker seduces the frightened actress. Meanwhile, Tara and Patti ponder Brooke's reason for claiming that Christie is dead, Tara suspecting foul play. At the same time, Laurian is stabbed to death while dancing in a room upstairs.After having sex, Brooke and Stryker are both shot to death by a figure in a robe. The gunshot victims fall from a second story window, Stryker's body crashing through a window downstairs. Terrified at the sight of the corpse, Tara flees the mansion. Running past Matthew's corpse, Tara is chased by the hag through an expansive prop and costume warehouse on the property. After escaping the killer three times and discovering Laurian's corpse among a group of hanging mannequins, she is dragged into a ventilation shaft and killed.A short time later, Samantha and Patti discuss Audra's insanity in the kitchen, over champagne. Samantha tells Patti about how Stryker left her in the asylum and eventually confesses to shooting Stryker and Brooke. Startled by the news of Stryker's death, Patti reveals that she murdered the others to win the part of Audra and stabs Samantha to death.The epilogue consists of Patti (now committed in mental institution) performing a monologue from Audra to other patients in the mental institution.","language":"English","cinematography":"Robert Paynter","directed_by":"Richard Ciupka|(as Jonathan Stryker)|","release_dates":"March 4, 1983 (1983-03-04) (U.S.)|September 14, 1984 (1984-09-14) (Canada)||||","Production":"Producer Peter Simpson signed onto the picture, and stated that the film was \"aimed for an adult audience,\" because he had feared of the \"failure of teenybopper horror films such as Terror Train.\"[4]Principal photography for Curtains began November 10, 1980 on location in Muskoka, Ontario, Canada and Toronto, Ontario, Canada. The film suffered a troubled production, ultimately leading to the film being shelved for a year, during which there were rewrites, reshoots, and one major recasting done. As a result, two sets of credits grace the ending of \"Curtains\", namely \"Act I\" and \"Act II\", denoting the two different, protracted production periods.[5] Eventually, numerous crew members had to be re-hired to shoot the footage to complete the film.[6]Curtains' troubled production stemmed from a clash between the film's director and Simcom producer Peter Simpson. The former envisioned the vehicle as more of an arthouse thriller, whereas Simpson wanted a more commercial slasher of the type that was en vogue at the time. According to actress Linda Thorson, at one point the tension between the two became so intense, it caused many of the actors to feel uncertain whether the production would even move forward at all.[7] Veteran actress Samantha Eggar has stated she thought the characters in the film were \"vaguely drawn\" and the end result \"awful,\" but took the role chiefly for the work and salary.[8]In preparation for the film's ice-skating sequence, actress Lesleh Donaldson was sent for skating practice by the film's producers. She had very little prior training in the field and even had fellow actress Anne Ditchburn help with her choreography; nevertheless, when filming for that scene commenced, Donaldson tripped on the uneven ice and injured herself, resulting in a stand-in double being used for her long shots.[9]Director Ciupka left the film after disagreements with producer Simpson over stylistics and tone.[6] At the time Ciupka abandoned the project, only forty-five minutes of the film had been shot, which resulted in Simpson having to take over the shoot.[6] The final chase scene in the prop house was filmed over a year after the initial production by Simpson, as well as the ending murder scene between Samantha Eggar and Lynne Griffin.[6] Writer Robert Guza Jr. returned to the project for rewrites under Simpson's supervision. This resulted in various additional scenes being shot, many of which never made it into the final picture.[6]Deleted scenes included a backstory sequence where, prior to arriving at Stryker's retreat, Christie is emotionally rejected by her skating coach. This scene was intended to show the character's vulnerability when she is rejected again, this time by Stryker.[5] The scene was shot two years after the initial production on a college campus, but never made it into the final cut.[6]Actors Michael Wincott and Anne Ditchburn also originally had more dialogue, but most of their lines were cut from the final version of the film. Wincott's death was also originally filmed with him being killed on a snowmobile and then crashing into the library, scaring Sandee Currie's character. This scene was later cut out of the film, and he is instead killed off-screen in a hot tub.[5]Actress Lynne Griffin recalls filming an alternate ending in Toronto. In this scene, her character Patti O'Connor delivers a monologue on a theater stage surrounded by her dead victims. This alternate ending was not used in the final cut of the film.[6][10] According to Michael MacLaverty, film editor for \"Curtains, the alternate theater ending was ultimately discarded because Alana Simpson, then wife of producer Peter Simpson, felt it was \"too improbable.\" \"[Alana] couldn’t really accept the fact that all these corpses were somehow dragged together [by the killer] and put on a stage somewhere,\" recalls MacLaverty.[11]","produced_by":"Peter R. Simpson","starring":"John Vernon|Linda Thorson|Samantha Eggar|Anne Ditchburn|Lynne Griffin|Lesleh Donaldson|Sandee Currie|","running_time":"89 minutes[1]","music_by":"Paul Zaza","edited_by":"Michael Laverty|Uncredited:|Henry Richardson|","Release":"After the film was completed in 1982, director Ciupka detached his name from the final cut, and the film's director is credited as \"Jonathan Stryker\", the name of John Vernon's character.[12] With a production spanning nearly three years, Curtains was released theatrically in the United States on March 4, 1983 and in Canada in 1984. There was no official premiere for the film, though star Lynne Griffin recalled going to see the film on its opening night at a theater on the Lower East Side in Manhattan.[6] The film was released in Italy as The Mask of Terror and as Death Count to Seven in Norway.The New York Times gave Curtains a middling review, saying: \"This derivative Canadian thriller plays like a distaff version of Samuel Fuller's cult classic Shock Corridor fused rather crudely to a standard mad-slasher plot.\"[12]Although it was largely ignored by the press, it has gained a cult following over the years,[13] and garnered a series of positive reviews when it was released for the first time on Blu-ray in July 2014. Brian Orndorf of Blu-ray.com noted the film's haphazard construction, but praised the its visuals, saying:Curtains isn't a single film, it's a handful of subplots and ideas competing for screentime under the guise of a traditional '80s-style slasher endeavor. Bizarre seems too mild a description when discussing this movie, which is actually stitched together from two production periods spread out over three years, with the original director, Richard Ciupka, taking his name off the effort when producer Peter R. Simpson elected to jazz up the rough cut with customary slicing and dicing. The fascinating backstory on Curtains is evident throughout the presentation, leaving the picture half-realized, shooing away substance to plow ahead with violence. It's a mess, but an entertaining one thanks to Ciupka's visual ambition and ensemble work from the oddball cast, who deliver the proper level of hysteria to assist what little suspense remains.[14]Dustin Putman of The Film File gave the film three out of four stars, saying: \"the picture doesn't always play by conventional slasher rules and its more surrealistic aspects render it all the more fascinatingly esoteric.\"[15] Paul Chambers of the film website Movie Chambers gave the film a mixed review, praising Eggar and Vernon's performances as well as the oft-remembered ice-skating sequence, while also noting the film as \"[so] directionless and improbable, that no payoff is worth it.\"[16]Curtains was first released on VHS by Vestron Video in 1984.Throughout the early 2000s, a DVD release for the film never manifested, leading fans to start an online petition for a DVD release.[17]The film was eventually released on DVD on October 5, 2010 by Echo Bridge Home Entertainment as part of the Midnight Horror Collection: Bloody Slashers DVD collection which also includes Secrets of the Clown, Hoboken Hollow, and Room 33, three direct-to-video B-movies from the 2000s.[18] This release featured generic cover art and a poor transfer from VHS source material.On July 29, 2014, \"Curtains\" was released on Blu-ray and DVD by Synapse Films, featuring a new 2K transfer from the original prints as well as a 5.1 surround sound audio remastering.[13] It features a retrospective \"Making of\" documentary as well as vintage documentary footage, an audio commentary, and the film's original theatrical trailer.","written_by":"Robert Guza, Jr.","budget":"$3.7 million"}