{"Cast":"The tribal people were acted by members of the Rosebud Sioux tribe of South Dakota.","country":"United States","distributed_by":"National General Pictures (1970, original) Paramount Pictures (2003, DVD, and 2011, Blu-ray DVD)","Representation of cultures":"The film notably treats both sides dispassionately, from the view of neither the white man nor the American Indian nations, but encompassing both cultures.[citation needed] However, some Indian activists criticized the film harshly. Buffy Sainte Marie said, \"Even the so-called authentic movies like A Man Called Horse—that's the whitest of movies I've ever seen.\"[3] Vine Deloria, Jr. said, \"As we learned from movies like A Man Called Horse, the more 'accurate' and 'authentic' a film is said to be, the more extravagant it is likely to be in at least some aspects of its misrepresentation of Indians.\"[4] It was the first American Western to attempt to portray the Sioux as the protagonists and eulogize their culture, but fell short with Native American audiences because it still had leading white actors as the main characters for the film to appeal to white audiences.[5]","Plot":"Initially enslaved and mocked by being treated as an animal, John Morgan comes to respect his captors' culture and gain their respect. He is aided in understanding the Sioux by a captive, Baptiste, the tribe's half-breed fool, who had tried to escape and was hamstrung behind both knees.Determining that his only chance of freedom is to gain the respect of the tribe, he overcomes his repugnance and kills two warriors from the neighboring (enemy) Shoshone tribe, which allows him to claim warrior status. After his victory, he proposes marriage to one of the women with the horses taken in battle as bride-price and undergoes painful initiation rites, taking the native name \"Shunkawakan\" (or \"Horse\") as his Sioux name.When one of the warriors takes a vow never to retreat in battle, Morgan's changing perspective is shown, as he turns angrily on the uncomprehending Baptiste, telling him \"Five years you've lived here, and you've learned nothing about these people – all his death is to you is a means of escape.\"After successfully helping to fend off an attack by the enemy tribe, he becomes a respected member of the tribe and ultimately their leader.","language":"English","box_office":"$6 million (US/ Canada rentals)[1]","cinematography":"Robert Hauser Gabriel Torres","production_company":"Cinema Center Films","directed_by":"Elliot Silverstein","DVD":"A Man Called Horse was released to DVD by Paramount Home Entertainment on April 29, 2003 as a Region 1 widescreen DVD and on May 31, 2011 as a Region 1 widescreen Blu-ray DVD.","release_dates":"April 28, 1970 (1970-04-28)|||||","Production":"For the crucial Native American initiation ceremony, wherein actor Richard Harris is hung on pins in his chest, make-up artist John Chambers created a prosthetic chest.[2]","produced_by":"Frank Brill Sandy Howard","starring":"Richard Harris Judith Anderson","running_time":"114 minutes","Sequels":"Two sequels to the original movie were made, both with Harris reprising his role:","music_by":"Leonard Rosenman Lloyd One Star","a_man_called_horse":"Theatrical release poster design by Tom Jung","edited_by":"Philip W. Anderson","written_by":"Jack DeWitt Dorothy M. Johnson"}