{"country":"Australia United States[3]","distributed_by":"Paramount Pictures (North America) 20th Century Fox (International)","screenplay_by":"John Cornell Ken Shadie Paul Hogan","story_by":"Paul Hogan","\"crocodile\"_dundee":"Theatrical release poster by Dan Gouzee","Plot":"Sue Charlton is a feature writer for Newsday (which her father owns) and is dating her editor, Richard Mason. She travels to Walkabout Creek, a small hamlet in the Northern Territory of Australia, to meet Michael J. \"Crocodile\" Dundee, a bushman reported to have lost half a leg to a saltwater crocodile before crawling hundreds of miles to safety. On arrival in Walkabout Creek (by helicopter due to its remote location), she cannot locate Dundee, but she is entertained at the local pub by Dundee's business partner Walter \"Wally\" Reilly, who does his best to explain the town and some of its inhabitants, including the towering hulk Donk, who wins money by placing a glass of beer on his head and challenging people to try and spill the beer by punching him in the stomach. When Dundee arrives that night, Sue finds his leg is not missing, but he has a large scar which he refers to as a \"love bite\". While Sue dances with Dundee, a group of city kangaroo shooters make fun of Dundee's status as a crocodile hunter, causing him to knock the leader out with one punch. Feeling lucky, he then challenges Donk and makes him spill the entire glass by kissing him on the lips and startling him into dropping the tankard.At first, Sue finds Dundee less \"legendary\" than she had been led to believe, being unimpressed by his pleasant-mannered but uncouth behaviour and clumsy advances towards her; however, she is later amazed, when in the Outback, she witnesses \"Mick\" (as Dundee is called) subduing a water buffalo, taking part in an aboriginal tribal dance ceremony, killing a snake with his bare hands, and scaring away the kangaroo shooters from the pub from their cruel sport of shooting kangaroos. Mick shoots at their truck using a dead kangaroo as cover, making them think the kangaroo is shooting at them, which in their drunken state causes them to flee. The next morning, offended by Mick's assertion that as a \"sheila\" (Aussie slang for a female) she is incapable of surviving the Outback alone, Sue goes out alone to prove him wrong but takes his rifle with her at his request. Mick follows her to make sure she is OK, but when she stops at a billabong to refill her canteen, she is attacked by a large crocodile and is rescued by Mick. Overcome with gratitude, Sue finds herself becoming attracted to him.Sue invites Mick to return with her to New York City on the pretext of continuing the feature story. At first Wally scoffs at her suggestion, but he changes his mind when she tells him the newspaper would cover all expenses. Once in New York, Mick is perplexed by local behaviour and customs but overcomes problematic situations including two encounters with a pimp and two attempted robberies. After this Sue realizes her true feelings for him, and they kiss.At a society dinner at her father's home in honour of Sue's safe return and of Mick's visit, Richard proposes marriage to Sue, and in a haze of confused emotions, she initially accepts in spite of Richard having recently revealed his self-centered and insensitive \"true colours\" during a period of intoxication. Mick, disheartened at Sue's engagement, decides to go 'walkabout' around the USA, but Sue has a change of heart and, deciding not to marry Richard, follows Mick to a subway station. There, she cannot reach him through the crowd on the platform, but has members of the crowd relay her message to him, whereupon he climbs up to the rafters and walks to Sue on the heads and raised hands of the onlookers and kisses her.","language":"English","Reception":"The film has a rating of 89% on Rotten Tomatoes.[11][12]James Berardinelli of Reelviews.net gave the film three stars out of four stating, \"What the storyline lacks in ambition, it makes up for in sheer, unfettered likability.\"[13]Crocodile Dundee debuted at #1,[14] and was a worldwide box office hit.[15] The film grossed $47,707,045 at the box office in Australia,[16] which is equivalent to $118,305,664 in 2014 dollars.The film was released theatrically in the United States by Paramount Pictures in September 1986. It grossed $174,803,506 at the U.S. box office.[17] It was the second highest-grossing film that year (after Top Gun) for both the studio and the United States box office.[18]","box_office":"$328 million [5]","cinematography":"Russell Boyd","production_company":"Rimfire Films","directed_by":"Peter Faiman","release_dates":"24 April 1986 (1986-04-24) (Australia)|26 September 1986 (1986-09-26) (United States)||||","Production":"The idea to make the film came to Paul Hogan when he was in New York. He wondered what it would be like if a Northern Territory bushman arrived in town. Paul Hogan:There's a lot about Dundee that we all think we're like; but we're not, because we live in Sydney. He's a mythical outback Australian who does exist in part—the frontiersman who walks through the bush, picking up snakes and throwing them aside, living off the land who can ride horses and chop down trees and has that simple, friendly, laid-back philosophy. It's like the image the Americans have of us, so why not give them one?... We've always been desperately short of folk heroes in this country. Ned Kelly is pathetic. So are the bushrangers.[8]The film's budget was raised through the 10BA tax concessions via Morgan Sharebrokers. Paul Hogan used his regular collaborators from TV, including John Cornell, Peter Faiman and Ken Shadie. Linda Kozlowski was imported to play the American reporter; Actors' Equity Australia objected to this but eventually relented.[8]Six weeks of filming were spent working out of Jaja, an abandoned uranium mining camp in Kakadu National Park in the Northern Territory with an additional week in Cloncurry. There was a further six weeks filming in New York.[4] Filming finished on 11 October 1985.[9]A number of minor changes were made to the film for its US release.[4]When the film finished Hogan said he expected it would make millions of dollars around the world. Hogan also said of the film, \"I'm planning for it to be Australia's first proper movie. I don't think we've had one yet—not a real, general public, successful, entertaining movie.\"[10]","produced_by":"John Cornell","starring":"Paul Hogan|Linda Kozlowski|Mark Blum|David Gulpilil|Michael Lombard|John Meillon|","running_time":"104 minutes (Australia)[1] 97 minutes (international)[2]","music_by":"Peter Best","edited_by":"David Stiven","budget":"$8.8 million[4]"}