{"bad_dreams":"Theatrical release poster","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Andrew Fleming Michael Dick P.J. Pettiette Steven E. de Souza","story_by":"Yuri Zeltser","Plot":"In 1975, a sinister hippie cult called Unity Fields commits mass suicide in a horrific manner - by fire - at the behest of its psychopathic leader, Franklin Harris (Richard Lynch). Only one young woman named Cynthia (Jennifer Rubin) survives to tell the tale, though she lies in a coma for thirteen years. After she wakes, Cynthia has grim reminders of the mass suicide, as people around her begin to die one at a time.First, Cynthia's brother Edgar and his wife Hettie are hacked to bits. Cynthia flees the house. She is then forced to stay with her niece Connie at her fraternity, much to the chagrin of Connie's fellow sisters - Lana, Gilda, and Miriam. At the college, she meets Professor Alex Karmen, as well as Dean Ralph Pesco. Eventually, Cynthia goes on a date with Ralph, much to the chagrin of Alex. Cynthia thinks that she is safe, however, the person who killed Edgar and Hettie catches up to her. One night, he beheads Miriam and her boyfriend Ed. After this, Lana and Gilda force Connie to kick out Cynthia. She then goes to live with Ralph. After Cynthia leaves, the killer stabs Gilda.Alex tells another professor, James Berriford, that he is in love with Cynthia and fears for her life. That night, Cynthia pays a visit to Connie, frustrating Connie's boyfriend Billy. Meanwhile, the killer slits Lana's throat and bludgeons her boyfriend Victor. While Cynthia is lying down, the murderer strangles Billy and kills Connie. When Cynthia finds the bodies, she is confronted by the killer - Franklin Harris. He explains that he died, but returned as a ghost to clam his \"love child\", Cynthia. Meanwhile, Alex and James have arrived at the house so that Alex can tell Cynthia how he feels. However, Alex is too scared to knock on the door, so James does. Franklin forces Cynthia at gunpoint to open the door. She does so, but when she reaches for a knife, Franklin fires a gun at her. The bullet misses Cynthia and hits James in the head, killing him.Cynthia flees out of the house. Alex tries to help her, but Franklin shoots him in the chest. Alex lives and chases after Franklin and Cynthia. Cynthia is found by Ralph in his car. However, when Ralph hears the gunshots, he drives away, leaving Cynthia behind. He then runs over tire spikes, rendering his car unusable. Ralph flees into the woods, where he is gutted by Franklin. Shortly after, Cynthia finds his dead body and is attacked by Franklin. She ends up at the same place where the ritual occurred. There, Franklin returns to his physical form. Alex takes the opportunity to attack Franklin, but Franklin crushes his head with a rock. Cynthia then finally rebels and stabs Franklin to death before cutting off his head, putting him to rest and ending Cynthia's nightmare.","language":"English","box_office":"$9,797,098 (USA)","cinematography":"Alexander Gruszynski","directed_by":"Andrew Fleming","release_dates":"April 8, 1988 (1988-04-08) (U.S.)|||||","produced_by":"Gale Anne Hurd","starring":"Jennifer Rubin|Bruce Abbott|Richard Lynch|Dean Cameron|Harris Yulin|","running_time":"84 minutes (Australia: 80 minutes)","music_by":"Jay Ferguson","edited_by":"Jeff Freeman","Release":"The film was released theatrically in the United States by 20th Century Fox on April 8, 1988. It grossed $9,797,098 at the U.S. box office.[1]The film was released on DVD in the United States by Anchor Bay Entertainment in 2006.[2] This version is currently out of print.The film was released by Shout Factory along with Visiting Hours as a double feature DVD on September 13, 2011.","budget":"$4,000,000 (Estimated)"}