{"based_on":"Alfie  by Bill Naughton","country":"United Kingdom|United States|","distributed_by":"Paramount Pictures","Plot":"The film opens up by introducing Alfie (Jude Law), a self-confident, mischievous, womanizing, Vespa-riding Cockney who resides in Manhattan. An immaculately dapper boy in his early thirties, Alfie funds his hedonistic lifestyle by working as a driver for the local limousine service. Meeting, romancing, and seducing women comes as second nature to Alfie. In addition to maintaining a casual relationship with a single mother named Julie (Marisa Tomei) that he refers to as his \"semi-regular-quasi-sort-of-girlfriend thing\", he also sleeps with various girls on the side, such as the married-yet-neglected-by-her-husband blonde named Dorie (Jane Krakowski) whom he regularly meets for sex after work in the back of his limo. At the first inkling Dorie may desire their liaison to grow into something more, he decides to block all contact. Alfie ultimately views women as expendable, cutting them loose as soon as he feels they're starting to cramp his style.Alfie's best friend, Marlon (Omar Epps), is also a limo driver in the same company. In addition to their friendship, the two are working on a plan that would eventually see them start their own business. However, for the moment, Marlon is preoccupied with trying to win back his ex-girlfriend, Lonette (Nia Long), who dumped him after he hesitated to commit, and is now, despite his desperate efforts, stubbornly dismissive to his reconciliation attempts. At a loss for ideas, Marlon eventually turns to Alfie for help by having him put in a good word with Lonette. This takes place late one night following a closing shift in a bar where Lonette is waitressing. As the staff is closing up, Alfie is trying to persuade her to take Marlon back, however, the conversation soon goes in a different direction and eventually after a few drinks, they end up having passionate sex on the pool table. Alfie is so terrified about facing his friend in the event he ever gets the word of what happened, but is amazed and relieved to be told by jubilant Marlon that Lonette got back with him the very next day after her \"conversation\" with Alfie.Around the same time, as he arrives to Julie's place looking for another booty call, Alfie is informed she no longer wants to see him since she found the proof of his infidelity (Dorie's red panties). He seems to take it all in stride with a smile on his face as he disappears down her street. Alfie soon gets another unpleasant piece of news, this time from Lonette: she is pregnant with his child. Without telling Marlon, the two of them visit a clinic in order for her to have an abortion. Soon afterwards, Marlon and Lonette unexpectedly move upstate without even saying goodbye to Alfie.Alfie is then faced with an erectile problem that causes him plenty of embarrassment in front of his next few female conquests. Following repeated failures to achieve an erection with various women, he visits a doctor who performs an examination and reassures him there's nothing wrong physically that would stand in his way of achieving one, thus writing his erectile problems off to \"probably stress\". However, it's not all good news as the same doctor locates a lump, indicating a possibility of testicular cancer. Alfie immediately has a test run at the clinic and spends a few anxious days awaiting the results. During one of his trips to the hospital, Alfie meets an older gentleman named Joe (Dick Latessa) in the clinic bathroom. After a brief conversation during which he reveals he's a widower, Joe imparts some life advice to the depressed Alfie: \"Find somebody to love, and live every day like it's your last\". This is followed by him offering his card to Alfie \"in case he wants someone to talk to\". Soon afterwards, Alfie finds out he doesn't have cancer.Alfie takes the whole erection controversy followed by a mortal health scare to heart and decides that \"aiming higher\" in his love life will be his new resolution. To that end, he picks up a beautiful young woman named Nikki (Sienna Miller) before Christmas, and they quickly embark on a passionate but turbulent relationship against the winter holidays backdrop. Soon after moving in together, Alfie is not happy about having to endure Nikki's unpredictable mood swings and impulsive behavior that occur as a result of her decision to go off her medication. While beginning to distance himself emotionally from Nikki, he sets his sights on an older woman, Liz (Susan Sarandon), a sultry cosmetics mogul whom he meets in the company of an older man while driving them around. Although Alfie is clearly quite taken with her endearing flair and high society ways, she, unlike many of the women in Alfie's life, seemingly displays no intent to move their relationship past the physical stage. Unsurprisingly, his infatuation with Liz serves as the final catalyst that leads to the end of his interest in Nikki, who soon moves out of his life.Not long afterwards, a chance meeting with his ex Julie in a coffee shop renews his feelings for her. To his dismay, she's now happily involved with someone else, filling Alfie with feelings of regret over his years of thoughtless womanizing. A trip upstate to visit Marlon and his now-wife, Lonette, reveals that she never actually went through with the abortion opting instead to give birth to Alfie's child. Alfie also learns that Marlon accepted the baby and cares for it now as though it's his biological child, all of which leaves Alfie feeling terrible. Crestfallen and sullen, Alfie digs up the number given to him by Joe and calls him up. Walking along the beach together, Joe imparts some words of encouragement to Alfie. He then turns to Liz for reassurance and comfort, but is crushed to discover that she has a new man in her life. Shocked, Alfie insists on knowing what her new boyfriend has that he doesn't, to which she, after some initial hesitation, simply states: \"he's younger than you\".Horrified and pained by one blow after another, Alfie happens to run into Dorie. She walks by the docks late one night, but at this point he is more interested in emotional support rather than sex. She, however, informs him she's moved on, and, though friendly and calm, generally lets him know she wants no part of him anymore. The film ends with Alfie's monologue in which he begins to question his fickle self-indulgent lifestyle.","language":"English","box_office":"$35.2 million[2]","cinematography":"Ashley Rowe","directed_by":"Charles Shyer","Music":"The music score was composed by Mick Jagger, Dave Stewart [3] and John Powell, featuring 13 original songs and a remake of the original 1966 title song. Further songs are by Wyclef Jean and The Isley Brothers.For the song \"Old Habits Die Hard\" Mick Jagger and David A. Stewart won the BFCA Award, the Golden Globe, a Sierra Award and the World Soundtrack Award.","release_dates":"November 5, 2004 (2004-11-05)|||||","Production":"The film was shot throughout England, mostly locations doubling for New York City, along with on-set shooting in Manhattan.","produced_by":"Elaine Pope|Charles Shyer|","starring":"Jude Law|Marisa Tomei|Susan Sarandon|","running_time":"105 minutes[1]","music_by":"Mick Jagger|John Powell|Dave Stewart|","alfie":"Theatrical release poster","edited_by":"Padraic McKinley","Release":"Alfie grossed $13,399,812 domestically and $21,750,734 overseas for a worldwide total of $35,150,546 on a $60 million budget. The film opened on November 5, 2004 in the United States and grossed $2,206,738 on the first day.[4] That weekend, the film was #5 in the box office with $6,218,335 behind The Incredibles' opening weekend, Ray's second, The Grudge's third, and Saw's second.[5] When compared to its $60 million budget, Alfie was a box office bomb.[6]The film received mixed reviews. Based on 150 reviews collected by the film review aggregator Rotten Tomatoes, 49% of critics gave Alfie a positive review, with an average rating of 5.6/10.[7] Most critics were impressed with Jude Law's performance, especially in the shadow of Michael Caine's iconic interpretation. The direction and style were also praised.Todd McCarthy from Variety describes the film as \"a breezy, sexy romp with a conscience that reflects in obvious but interesting ways on societal changes over the intervening 38 years.\"[8]Roger Ebert enjoyed the film, praising Law's performance and saying that \"on its own terms, it's funny at times and finally sad and sweet.\"[9]Entertainment Weekly gave the film a \"B-\", praising the actresses and Law, but also noting \"Jude Law would appear to have all the attributes of a movie star: looks, humor, rogue charm. Yet there's one he could use more of — an anger that might ignite his smooth presence.\"[10]Manohla Dargis of The New York Times states:Unlike the 1966 British film on which it is based, with its abrasive star-making turn from Michael Caine, the new Alfie doesn't chase social significance - it just wants us to have a good time. The story's observations about male behavior aren't earth shattering...but what gives it its kick is how Alfie takes the film audience into his confidence. In both films, the character talks directly into the camera, a disarming strategy that brings us closer to this serial seducer than we might want. Playing narrator turns Alfie into a tour guide and something of his own defense attorney; it also means he has to enrapture the audience along with his conquests.[11]","written_by":"Elaine Pope|Charles Shyer|","budget":"$60 million[2]"}