{"based_on":"The Game of X  by Robert Sheckley","country":"United States","distributed_by":"Buena Vista Distribution","Plot":"Woodrow \"Woody\" Wilkins is an imaginative, yet eccentric, comic book writer and illustrator who demands a sense of realism for his comic book hero \"Condorman\", to the point where he crafts a Condorman flying suit of his own and launches himself off the Eiffel Tower. The test flight fails as his right wing breaks, sending him crashing into the Seine River. Later after the incident, Woody is asked by his friend, CIA file clerk Harry, to perform what appears to be a civilian paper swap in Istanbul. Upon arriving in Istanbul, he meets a beautiful Soviet named Natalia Rambova, who poses as the Soviet civilian with whom the exchange is supposed to take place, but it is later revealed that she is in fact a KGB spy. Woody does not tell Natalia his real name, and instead fabricates his identity to her as a top American agent code-named \"Condorman\". During the encounter, Woody fends off a group of would-be assassins and saves her life by sheer luck before accomplishing the paper trade. Impressed by Woody, and disgusted by how she was treated by her lover/boss Krokov when she returns to Moscow, Natalia decides to defect and asks the CIA to have \"Condorman\" be the agent that helps her.Back in Paris, Woody's encounter with Natalia inspires him to create a super heroine patterned after her named \"Laser Lady\". He is then notified by Harry and his boss Russ that he is to escort a defecting Soviet agent known as \"The Bear\". Woody refuses to do the job, but when Russ reveals that \"The Bear\" is Natalia, he agrees to do it on the condition that the CIA provides him with gadgetry based on his designs.Woody meets up with Natalia in Yugoslavia and protects her from Krokov's henchmen led by the homicidal, glass-eyed assassin Morovich. After joining Harry in Italy, the trio venture to Switzerland, where Natalia discovers the truth about Woody when a group of children recognize her from his comic books. Their journey back to France is compromised when Morovich puts Woody and Harry out of commission and Krokov's men recover Natalia before retreating to their headquarters in Monte Carlo. Woody is told that the mission is a failure and he and Harry are ordered to return to Paris, but he asks for two more days to conduct an operation to rescue Natalia.Disguising themselves as Arab sheiks, Woody and Harry create a diversion at the Monte Carlo Casino to recover Natalia from Krokov and his men. As Harry drives away in a Rolls-Royce, Woody uses an improved version of his Condorman suit to fly himself and Natalia out of the casino and onto the pier, where the trio make their getaway aboard the Condorboat. They manage to destroy Krokov's speedboats following them, but Krokov and Morovich pursue them in their own speedboat. The Condorboat reaches its pick-up point, but Morovich shows his intent on ramming it. When Morovich ignores his commander's orders to return to base, Krokov abandons ship. The Condorboat is lifted by the CIA helicopter in time to prevent a collision, causing Morovich to crash on an island rock.Days later, Woody, Natalia and Harry are at Dodger Stadium in Los Angeles, where they see the Goodyear Blimp flash a sign welcoming Natalia to the U.S. Aboard the blimp, Russ contacts Harry and has him ask Woody if he is interested in taking Condorman to another assignment.","Media":"Condorman was first released on home video in the early 1980s, on VHS, Laserdisc, and Betamax. It was re-released on VHS, and made its Region 1 DVD debut on May 18, 1999, when it was released by Anchor Bay Entertainment.[7] A Region 2 version was released on August 21, 2006.[8] The film was re-released in Region 1 exclusively for members of the Disney Movie Club in May 2008.[9]The film's complete musical score composed by Henry Mancini was released on CD by Intrada Records on November 13, 2012.[10] The album contained twenty tracks from the film and eight bonus tracks totaling just over 60 minutes, and was designated as Intrada Special Collection Volume 219. It was part of a special collaboration with The Walt Disney Company resulting in the release of several rare Disney scores on CD.A comic book adaptation of Condorman was published by Whitman Comics at the time of the film's release.[11] A notable change in the illustrations was that Russ, the CIA boss, became an African-American. An original comic adventure sequel was also published, taking place in the U.S. itself. Woody is engaged to Natalia, and his Condorman machines are being built by a toy company — a cover for a CIA unit. Krokov and Morovich again appear, attempting to take Natalia back to the USSR by force, and Russ is again a black character.Following Disney's acquisition of Marvel Comics in 2009, The Amazing Spider-Man editor Stephen Wacker lobbied to have Condorman brought into the Marvel Universe.[12]In the Pixar short film Toy Story Toons: Small Fry, a Condorman toy (voiced by Bob Bergen) appears at a support group meeting for discarded kids' meal toys.[13]","language":"English","Reception":"The film was heavily panned by critics, and has retrospectively scored an approval rating of 25% on Rotten Tomatoes.[2] On their television show At the Movies, critics Gene Siskel and Roger Ebert featured the film in their round-up of the year's worst films, pointing out the less-than-special effects such as the visible harness and cable used to suspend Condorman in the air and the obvious bluescreen effect. On the other hand, John Corry of The New York Times wrote a favorable review of the film, calling it \"painless and chaste, and it has a lot of beautiful scenery and beautiful clothes. There are worse things to watch while you eat popcorn.\"[3]The film also did poorly at the box office. However, despite the film's failure, this film has over time gained a cult following among Disney fans.[4][5][6]","cinematography":"Charles F. Wheeler","production_company":"Walt Disney Productions","directed_by":"Charles Jarrott","release_dates":"August 7, 1981 (1981-08-07)|||||","Production":"Condorman was filmed in Paris, Monte Carlo and Zermatt, Switzerland. The Condormobile was a modified Nova Sterling kit car.[1]","produced_by":"Jan Williams","starring":"Michael Crawford|Oliver Reed|Barbara Carrera|James Hampton|Jean-Pierre Kalfon|Dana Elcar|","running_time":"90 minutes","music_by":"Henry Mancini","written_by":"Mickey Rose Marc Stirdivant"}