{"country":" United States","distributed_by":"American International Pictures","bunny_o'hare":"Theatrical release poster","Plot":"The title character, a widow whose savings have been depleted by her selfish, middle-aged children, Lulu and Ad, finds herself homeless when the bank forecloses on her mortgage. She becomes friendly with Bill Green, an aging itinerant salvaging the house's plumbing, who she soon discovers is really fugitive bank robber William Gruenwald. Hoping to recoup her losses from the bank that took her home, Bunny blackmails Bill into teaching her how to rob the institution in exchange for keeping his identity a secret. She wears a long blonde wig, over-sized hat, and sunglasses, while he dons a fake beard, leather vest, and bell-bottom pants, and the two pull off the caper and escape on a 250cc Triumph TRW Trophy motorcycle. Buoyed by their success, Bunny convinces Bill to join her in more heists, and the different modus operandi they use - setting free a canary to distract the guard, setting off smoke bombs - make it difficult for police lieutenant Horace Greeley and criminologist R.J. Hart to profile their suspects.","language":"English","Reception":"Bette Davis was unhappy with the final film and sued AIP for $3.3 million in damages.[3]","Critical reception":"In his review in the New York Times, Vincent Canby described the film as \"a silly, foolishly entertaining movie . . . nonsense of a quite acceptable order, filled with absurd chases and stock characters who have been conceived and played with affection.\" Of its star he observed, \"Miss Davis . . . gives a performance that may be one of the funniest and most legitimate of her career.\"[4] In the Cleveland Press, Toni Mastroianni said, \"Bette Davis and Ernest Borgnine play a Bonnie and Clyde of the Geritol set and the result is about as satisfying as a bad television show.\"[5] Time Out London called it an \"embarrassingly unfunny caper\".[6] According to TV Guide, \"This clever script is ineptly directed by Oswald, who has no idea of how to embellish the comedy with pace, movement, or wit. Davis and Borgnine are excellent, though, showing that years of training and professionalism can overcome just about anything.\"[7]","cinematography":"Loyal Griggs John M. Stephens","directed_by":"Gerd Oswald","Soundtrack":"The soundtrack includes the following vocals:","release_dates":"October 18, 1971 (1971-10-18)","Production":"The working titles for the film were Bunny and Claude, Bunny, Betty and Claude, and Bunny and Billy.[citation needed] The film marked the second on-screen pairing of Bette Davis and Ernest Borgnine, who co-starred in The Catered Affair in 1956.[citation needed] The American International Pictures release was filmed partially on location in Albuquerque. New Mexico Governor David F. Cargo made a cameo appearance as a state trooper.[citation needed] The film led to two lawsuits for American International Pictures. Davis, who had script approval, was upset with changes made in editing, and she sued the company for loss of income and damage to her career for changing the film into a \"slapstick\" production instead of the \"humorous social commentary\" for which she had signed. The suit eventually was dropped. Writer Cherry sued for $13,400, the balance of his fee, and also asked for 5% of the film's net profits. The outcome is unknown.[2]","produced_by":"Samuel Z. Arkoff James H. Nicholson","starring":"Bette Davis Ernest Borgnine Jack Cassidy Joan Delaney John Astin","running_time":"91 min","music_by":"Billy Strange","edited_by":"Fred R. Feitshans Jr.","written_by":"Stanley Z. Cherry Coslough Johnson","budget":"$900,000[1]"}