{"based_on":"Circle of Friends by Maeve Binchy","country":"Ireland","distributed_by":"Savoy Pictures Cineplex Odeon Films (Canada) Rank Organisation (UK)","Plot":"Set in 1950s Ireland, the film focuses on the experiences of Bernadette \"Benny\" Hogan and her two friends, Eve Malone and Nan Mahon. They are characterised early on in childhood, during their First Communion: Benny is the beloved and well-fed only child, Eve the orphan raised by nuns and Nan is destined to be defined by her beauty. The three girls grow up in the small town of Knockglen. Skip to eight years later: Nan has moved on to Dublin years earlier, and Benny and Eve have graduated from the local convent school and are heading to Dublin to attend university.Eve's education is financed by the local wealthy Westward Protestant family, her father's employers until his death. The family has also willed to her a cottage on their property. Eve boards at a convent in Dublin, while Benny must commute daily between home and Dublin, her parents being loath to let her go. They would prefer she marry the loathsome and creepy Sean Walsh, her father's faithful employee at his tailor shop.Once in Dublin the two girls reconnect with a mature and sophisticated Nan who is quite aware of her bewitching effect on the opposite sex. Benny eventually falls in love with Jack Foley, a handsome rugby player and doctor's son, studying medicine and expected to follow in his father's footsteps, though he is not quite convinced that this is the career for him. After the College Ball, Benny and Jack begin a relationship, Eve starts to date Aidan, a friend of Jack's, and Nan becomes involved with the much older Simon Westward, who the group ran into as they entered the dance and whom Nan \"accidentally\" arranged to run into at a lunch. While Benny is able to resist a physical relationship with Jack, Nan is not and believes that Simon truly loves her.When Benny's father dies suddenly, she is forced to suspend her university studies to take care of her mother who is devastated by her husband's passing, and to run the family shop. Sean Walsh attempts to woo her into marriage. Benny notices the accounts of the prosperous Hogan business are missing significant funds, creating a mystery over double entry bookkeeping. She suspects Sean has something to do with it but has no proof.Eve's cottage, in an isolated sector of the Westward estate, serves as a party location for the three young women and their friends. Nan and Simon visit it secretly for their trysts. Sean, who has been spying on the cottage since the first party to watch Benny, witnesses Nan and Simon's sexual relationship, having hinted at it to Eve during Benny's father's funeral. Nan becomes pregnant and reveals the news to Simon, sure he will marry her. Instead, Simon ends their relationship, stating he must marry for money, not love, to maintain the family fortune. He attempts to pay her off with a large cheque to get an abortion in England.A desperate Nan goes out to find Eve's boyfriend Aidan, but runs into a depressed and drunk Jack, who has not seen Benny since her father's funeral. She convinces him to take her as his date to a rugby team party and lures him into having sex with her. She later pretends that he is the one who got her pregnant. Jack does what he believes is the honourable thing and asks Nan to marry him. He tells Benny about the baby and the engagement and she is devastated. Eve grows suspicious of someone using the cottage after finding a half-burned newspaper in the fireplace. The nuns from her old convent told her they had seen lights on at the cottage and smoke coming from the chimney. Nan suggests that perhaps the cottage is haunted to cover up her and Simon's secret meetings there.Eve throws another party which a still devastated Benny attends alone. Nan, oblivious to the pain she's caused by her deception, convinces Jack they should attend the party, though he feels uneasy about going to Eve's. As he speaks to a sad Benny, Nan seeks out Eve, bringing her flowers and a present of a vase, acting as if nothing has changed and she and Eve are still the best of friends. An enraged Eve, having figured out the truth of what Nan has done and that Simon, not Jack, is the father of Nan's baby, confronts her, threatening to tell Jack the truth and screaming at Nan that she had broken Benny's heart. Eve, enraged at Nan for not realizing how much damage and hurt she has caused her friends, comes towards her waving a knife she was using to cut bread. As Nan backs away, she falls into a glass door which shatters, cutting her in the arm and severing an artery causing her to bleed profusely. Jack comes to Nan's aid, tending to the bleeding that Eve has been trying to stop. Benny, seeing Eve and Jack attending to Nan, leaves the party.Jack tries to contact Benny but she refuses to answer the phone. Though he has learned the truth of Nan's deception, Jack escorts Nan to the train station despite her protests that it has nothing to do with him now. She asks that he and Benny forgive her for her desperate actions. Nan heads to England to have her baby (or to have an illegal abortion).Curiosity over the missing money from the family store finally gets the best of Benny, and she snoops around Sean's living area above the tailor shop. She finds several pornographic pictures of larger women during her search. Sean finds Benny in his room and attempts to sexually assault her. She fights him off, and in the process finds the money that he has embezzled from her family for the duration of his employment. She demands that he leave or she will call the Garda (police). He tells her that he would have married her but now he wouldn't touch her. As he leaves, she throws his clothes at him, hitting him in the face with his coat.After Jack sees Nan off, he goes to visit Benny to try to win her back. He explains to Benny that helping stop Nan's bleeding made his hesitations over becoming a doctor disappear and he knows it is what he wants to do for the rest of his life. Jack also tells Benny that he loves her and if she'll have him back, he wants to marry her and that she is the one. He never loved Nan. Benny, unwilling to let him off so easily, tells him his actions have changed both her and their relationship, and it will take quite a bit of time for him to gain her trust again. She tells him they will have to get to know each other as they are now and they will just have to see where it takes them.Benny's voiceover states that Jack threw himself into his medical studies, as well as his pursuit of Benny. He demonstrates his patience and humility, devoting himself to his studies as well as Benny. Benny states that she moved to Dublin at the start of the new school year to share a flat with Eve. A paper Benny writes causes a stir at the university and sets her on course to her future career as a writer. With time, Benny falls in love with Jack again. The final scene shows Benny taking Jack to Eve's cottage. As he follows her inside, Benny says \"Bless me father, I have sinned\" implying the pair have finally consummated their relationship.","language":"English","Reception":"Circle of Friends was positively received by critics, as the film holds a 78% rating on Rotten Tomatoes based on 36 reviews.","box_office":"$23,397,365 (USA) £2,120,050 (UK)","directed_by":"Pat O'Connor","References":"","release_dates":"March 17, 1995","Differences from the novel":"There are several differences between the film script and the novel it is based on, the most notable being that Benny and Jack do not reunite at the end of the book. Other key differences include:","starring":"Chris O'Donnell Minnie Driver Saffron Burrows Alan Cumming Colin Firth","running_time":"103 minutes","circle_of_friends":"Theatrical release poster","edited_by":"John Jympson","written_by":"Andrew Davies"}