{"based_on":"A Long Way Down  by Nick Hornby","country":"United Kingdom Germany","distributed_by":"Lionsgate (UK)","Plot":"Martin Sharp (Pierce Brosnan) is contemplating suicide on New Year's Eve on the roof of the Toppers Building, high above London's streets. He is interrupted by a woman, Maureen (Toni Collette), who has the same fate in mind. She shyly offers to wait her turn, until two other strangers, a young woman named Jess (Imogen Poots) and a pizza deliverer called J.J. (Aaron Paul), also turn up.Martin is recognized by the others, having been a popular television personality before going to prison for a relationship with a girl who turned out to be 15. After talking things over, the four strangers form a pact, vowing to wait at least until Valentine's Day before taking their lives.Maureen has a disabled son she adores, but little life beyond that herself. Jess is the daughter of a politician (Sam Neill) and their relationship is strained. J.J. is an American who once played in a band, but while his three new acquaintances are suicidally depressed, he is terminally ill with cancer. Or so he says.To profit from misfortune, Martin hatches a scheme that makes them the talk of London, claiming their mass suicide was interrupted by a vision. They end up on his old TV chat show, where Martin's former co-host Penny (Rosamund Pike) makes her guests feel humiliated and even more depressed.The four go off to a vacation resort to get away from London's attention. They enjoy each other's company, at least until a confession by one of them and the intervention of a reporter named Kathy drives them apart. Matty, Maureen's son, has a heart attack but recovers. Jess and Martin visit Maureen in the hospital but J.J. can't be contacted. They realise it's Valentine's Day and that their pact has ended. All four end up back in London on the very same rooftop with the other three coaxing J.J. off the edge successfully.On the New Year's Eve of that year, they video call each other. Martin is looking after his daughter, Maureen is enjoying herself at a New Year's party, and J.J. and Jess are in a happy relationship.","language":"English","Reception":"A Long Way Down received negative reviews from critics. Rotten Tomatoes gives the film a score of 21% based on reviews from 39 critics, with a rating average of 3.9 out of 10.[5]","box_office":"$7.1 million[2]","cinematography":"Ben Davis","production_company":"BBC Films HanWay Films","directed_by":"Pascal Chaumeil","a_long_way_down":"Theatrical release poster","release_dates":"10 February 2014 (2014-02-10) (Berlin)|21 March 2014 (2014-03-21) (UK)||||","Production":"Brosnan has stated that TV presenter Richard Madeley was an inspiration to him in playing the role. While reading the script for the film in the Colombe D'Or restaurant in Saint-Paul-de-Vence, Brosnan stated that he saw Madeley and his wife Judy Finnigan and later said \"I think it's his sheer ebullience and enthusiasm. You have to be almost shamanic to do it, really, and really believe in yourself. And it's a thin line between being affable and being really annoying. So it takes a brave soul, really.\"[3]","produced_by":"Finola Dwyer Amanda Posey","starring":"Pierce Brosnan|Toni Collette|Imogen Poots|Aaron Paul|","running_time":"96 minutes","music_by":"Dario Marianelli","edited_by":"Chris Gill Barney Pilling","Release":"The film premiered at the 64th Berlin International Film Festival on 10 February 2014.[4]","written_by":"Jack Thorne","budget":"$22.7 million[1]"}