{"country":"United States","distributed_by":"20th Century Fox","Plot":"Dutch Dooley (Ed O'Neill) attends a ritzy party with his girlfriend, Natalie Standish (JoBeth Williams). He stands out terribly among the upper-class aristocrats – wearing a cheap suit and telling boorish anecdotes. Natalie's relaxed, less rigid personality also does not fit with the rest of the patrons. Dutch also meets Natalie's snobbish, wealthy ex-husband Reed (Christopher McDonald), who tells Natalie that he will have to break his Thanksgiving plans with their son Doyle (Ethan Embry) for an unexpected business trip to London. He also threatens to strip Natalie's custody of Doyle if she gives Reed a hard time. Dutch overhears the conversation and threatens Reed with bodily harm should he hurt Natalie.Natalie calls Doyle at his private school in Georgia and invites him home for Thanksgiving, but Doyle rudely refuses the offer and expresses his disdain for his mother, solely blaming her for the divorce. Despite this, Dutch sees an opportunity to get to know Doyle and further his relationship with Natalie, so he offers to go to Georgia and bring Doyle back to Chicago for the holidays.Upon arriving in Georgia, Dutch finds Doyle to be much like his father: snobbish, selfish and elitist. He welcomes Dutch by throwing a book at his face and shooting him in the groin with a BB gun, to which Dutch promises revenge. Dutch ultimately hogties Doyle to a hockey stick and carries him to the car to start on the drive back home.The trip entails several mishaps: A fireworks show Dutch gives Doyle in an attempt to make Doyle warm up to him goes awry when one lit rocket lands in the bag and sets off all the fireworks at once. Later, Dutch throws Doyle out of the car and makes him walk to the next motel by himself (Doyle eventually gets even by parking Dutch's car in the path of an oncoming semi truck, which totals the car and endangers the truck driver). They also hitch a ride with two prostitutes (E.G. Daily and Ari Meyers) who steal their luggage and leave them stranded with no money.Doyle calls his father, whom he discovers has lied about his trip to London; he instead spent the holidays with a girlfriend. Stunned by his father's betrayal, and wounded by Dutch's accusation that he \"hates his mother\", Doyle begins to regret his callous attitude. Dutch initially gives up and wants to call Natalie for assistance, but Doyle refuses and insists on getting home on their own. They sneak a ride on the back of a semi truck and are assaulted by security guards at a cargo storage station; Doyle feigns insanity and pretends that voices in his head are telling him to kill the guards (They make the guards think his BB gun is a bullet-loaded firearm.), which frightens the guards enough to allow them to escape.The two enter a restaurant, where they meet a married couple who takes them to a homeless shelter in Hammond, Indiana for the night. At the shelter, Doyle grows fond of a young girl and her family. While getting to know them, he finally realizes that he has been neglecting his mother and indeed wants to be with her for the holidays. The next day, the family drives Dutch and Doyle to Natalie's home, where Reed is waiting. Doyle shares an emotional embrace with his mother and reveals to Reed that he knows the truth about his trip to London. Doyle decides to stay with his mother instead of going with Reed for Thanksgiving. An angry Reed gives Natalie only a few days to pack and leave the house, which he owns. Dutch follows Reed outside as he departs and makes good on his promise to hurt Reed, putting a dent in his forehead with his pinky ring. He then demands that Reed show more respect to Natalie and become a better father to Doyle, to which a dazed Reed agrees.The film ends with Natalie, Dutch and Doyle at the dinner table about to begin the Thanksgiving feast. Before they commence, Dutch asks Doyle to retrieve Dutch's coat, as it contains a very special gift for Natalie. As Doyle turns to walk away, Dutch pulls the BB gun Doyle originally shot him with and finally gets his revenge on Doyle by shooting him in the buttocks.","language":"English","Reception":"Dutch received extremely poor reviews from critics, where it has a 14% approval rating on Rotten Tomatoes with an average score of 3.7 out of 10 from 21 reviews.[2] It was also a flop at the box office, grossing less than $5 million compared to its $17 million budget.The film was released on Blu-ray on January 17, 2012.","box_office":"$4.6 million[1]","production_company":"Hughes Entertainment","dutch":"Theatrical release poster","directed_by":"Peter Faiman","release_dates":"July 19, 1991 (1991-07-19)|||||","produced_by":"Robert Weissman","starring":"Ed O'Neill|Ethan Randall|JoBeth Williams|","running_time":"107 minutes","music_by":"Alan Silvestri","written_by":"John Hughes","budget":"$17 million"}