{"based_on":"Aladdin and the magic lamp from One Thousand and One Nights","country":"United States","distributed_by":"Buena Vista Pictures","Plot":"A peddler sets up shop in the fictional sultanate of Agrabah, offering to tell the audience about the story of an oil lamp in his possession. Jafar, the Grand Vizier of the Sultan, and his parrot Iago, seek the lamp hidden within the Cave of Wonders but is told that only a “diamond in the rough” may enter. Jafar identifies a street urchin named Aladdin as worthy. Aladdin and his pet monkey Abu cross paths with Princess Jasmine, who has run away from the palace, unwilling to be married off to another snobbish suitor. Aladdin and Jasmine become friends and fall in love, but Jafar has Aladdin apprehended, tricking Jasmine into thinking that he was decapitated.Disguised as an old man, Jafar frees Aladdin and Abu, taking them to the Cave and promises to reward them if they retrieve the lamp. Inside, Aladdin befriends a magic carpet. Abu greedily tries to steal a jewel, despite the Cave’s request, and it collapses. Trapped underground, Aladdin rubs the lamp, releasing the Genie trapped inside, who explains Aladdin has become his master and will grant him three wishes. Aladdin tricks the Genie into freeing them from the Cave without wasting a wish, and then uses his first to become a prince to be near Jasmine. Jafar, on Iago’s suggestion, plots to become Sultan by marrying Jasmine, but Aladdin parades into the city as “Prince Ali of Ababwa”. However, Jasmine is unimpressed with Aladdin’s bravado.Despite his friends advising him to tell Jasmine the truth, Aladdin refuses, believing she would never fall “for some street rat”. He takes Jasmine on a worldwide flight on the carpet, where she deduces his identity, though Aladdin says that he dresses as a peasant to escape the stresses of royal life, which convinces her. Aladdin returns Jasmine home, only to be attacked by the palace guards on Jafar’s orders and nearly drowned, until the Genie rescues him using his second wish. Jafar tries to hypnotise the Sultan into agreeing to his marriage to Jasmine, only for Aladdin to appear and expose Jafar’s schemes. Jafar flees, but notices Aladdin has the lamp, realising who he is.Learning he will become Sultan, Aladdin has second thoughts about freeing the Genie, believing that without him, he would not be able to keep up appearances. Iago steals the lamp, and Jafar becomes the Genie’s new master. He uses his first two wishes to usurp the Sultan and become the world’s most powerful sorcerer, exposing Aladdin’s lies and exiles him, Abu, and the carpet to a frozen wasteland, though they escape death and return to the palace. Jafar orders the Genie to brainwash Jasmine into falling in love with him, but the Genie reveals he is unable to grant the wish. Jasmine feigns interest to distract Jafar and allow Aladdin to get the lamp, but he is caught.Jafar transforms himself into a giant cobra and ensnares Aladdin, saying he is the most powerful being in the world. However, Aladdin points out the Genie is more powerful, inspiring Jafar to use his last wish to become a genie, only to be sucked into his own lamp as part of the genie’s nature, dragging Iago in with him. The Genie chucks Jafar’s lamp into the Cave of Wonders, and asks Aladdin to use his third wish to regain his royal title. However, Aladdin decides to free the Genie. Learning of Aladdin and Jasmine’s love, the Sultan alters the law to allow his daughter to marry whom she chooses. The Genie leaves to explore the world, while Aladdin and Jasmine celebrate their engagement.","Live-action prequel":"On July 15, 2015, the studio started developing a live-action comedy adventure prequel called Genies that is being written by Damian Shannon and Mark Swift, while Tripp Vinson is on board to produce via his Vinson Films banner. The film is planned to lead for a live-action Aladdin movie.[92] On November 8, Disney revealed it had originally planned to use Robin Williams' unused lines from the 1991–2 recording sessions for the film, but his will prohibited the studio from using his likeness for twenty-five years after his death.[93]","language":"English","Themes":"\"The original story was sort of a winning the lottery kind of thing. When we got into it, particularly coming in at the end of 1980s, it seemed like an Eighties 'greed is good' movie ... Like having anything you could wish for would be the greatest thing in the world and having it taken away from you is bad, but having it back is great. We didn't really want that to be the message of the movie\"The filmmakers thought the moral message of the original tale was not appropriate, and decided to \"put a spin on it\", by making the fulfillment of wishes seem like a great thing, but eventually becoming a problem.[32] Another major theme was avoiding an attempt to be what the person is not – both Aladdin and Jasmine get into trouble faking to be different people,[8] and the Prince Ali persona fails to impress Jasmine, who only falls for Aladdin when she finds out who he truly is.[42] Being \"imprisoned\" is also discussed, a fate that occurs to most of the characters – Aladdin and Jasmine are stuck to their lifestyles, Genie is attached to his lamp and Jafar, to the Sultan – and is represented visually by the prison-like walls and bars of the Agrabah palace, and the scene involving caged birds which Jasmine later frees.[8] Jasmine is also depicted as a different Disney Princess, being rebellious to the royal life and the social structure,[43] and trying to make her own way, unlike the princesses who just wait for rescue.[32]","Release and reception":"A large promotion campaign preceded Aladdin's debut in theaters, with the film's trailer being attached to most Disney VHS releases, and numerous tie-ins and licensees being released.[44] After a limited release on November 13, 1992,[45] Aladdin debuted in 1,131 theaters on November 25, 1992, grossing $19.2 million in its opening weekend – number two at the box office, behind Home Alone 2: Lost in New York.[46] It took eight weeks for the film to reach number one at the US box office, breaking the record for the week between Christmas and New Year's Eve with $32.2 million.[47] The film held the top spot five times during its 22-week run.[48] Aladdin was the most successful film of 1992 grossing $217 million in the United States and over $504 million worldwide.[1] It was the biggest gross for an animated film until The Lion King two years later.[49] As of January 2014, it is the thirtieth highest grossing animated film and the third highest grossing traditionally animated feature worldwide, behind The Lion King and The Simpsons Movie.[50] It sold an estimated 52,442,300 tickets in the US.[51]The review aggregator website Rotten Tomatoes reported that 94% of critics gave the film a positive review based on a sample of 68 reviews, with an average score of 8.1/10.[52]Most critics' praise went to Robin Williams' performance as Genie,[52] with Janet Maslin of The New York Times declaring that children \"needn't know precisely what Mr. Williams is evoking to understand how funny he is\".[53] Warner Bros. Cartoons director Chuck Jones even called the film \"the funniest feature ever made.\"[16] Furthermore, English-Irish comedian Spike Milligan considered it to be the greatest film of all time.[54] James Berardinelli gave it 3.5 out of 4 stars, praising the \"crisp visuals and wonderful song-and-dance numbers\".[55] Peter Travers of Rolling Stone said the comedy made the film accessible to both children and adults,[56] a vision shared with Desson Howe of The Washington Post, who also said \"kids are still going to be entranced by the magic and adventure.\"[57] Brian Lowry of Variety praised the cast of characters, describing the expressive magic carpet as \"its most remarkable accomplishment\" and considered that \"Aladdin overcomes most story flaws thanks to sheer technical virtuosity\".[58]Some aspects of the film were widely criticized. Ed Gonzalez of Slant Magazine wrote a negative review, describing the film as racist, ridiculous, and a \"narcissistic circus act\" from Robin Williams.[59] Roger Ebert, who generally praised the film in his review, considered the music inferior to its predecessors The Little Mermaid and Beauty and the Beast, and claimed Aladdin and Jasmine were \"pale and routine\".[60]Aladdin also received many award nominations, mostly for its music. It won two Academy Awards, Best Music, Original Score and Best Music, Original Song for \"A Whole New World\" and receiving nominations for Best Song (\"Friend Like Me\"), Best Sound Editing (Mark A. Mangini), and Best Sound (Terry Porter, Mel Metcalfe, David J. Hudson and Doc Kane).[61] At the Golden Globes, Aladdin won Best Original Song (\"A Whole New World\") and Best Original Score, as well as a Special Achievement Award for Robin Williams, with a nomination for Best Motion Picture – Musical or Comedy.[62] Other awards included the Annie Award for Best Animated Feature,[63] a MTV Movie Award for Best Comedic Performance to Robin Williams,[64] Saturn Awards for Best Fantasy Film, Performance by a Younger Actor to Scott Weinger and Supporting Actor to Robin Williams,[65] the Best Animated Feature by the Los Angeles Film Critics Association,[66] and four Grammy Awards, Best Soundtrack Album, and Song of the Year, Best Pop Performance by a Duo or Group with Vocal and Best Song Written for a Motion Picture, Television or Other Visual Media for \"A Whole New World\".[67]The film was first released in VHS on October 1, 1993, as part of the \"Walt Disney Classics\" line. In its first week of availability, Aladdin sold over 10.6 million copies,[68] and went on to sell over 25 million in total (a record only broken by the later release of The Lion King).[69] It entered moratorium on April 30, 1994.[70]On October 5, 2004, Aladdin was released on DVD, as part of Disney's Platinum Edition line. The DVD release featured retouched and cleaned-up animation, prepared for Aladdin's planned but ultimately cancelled IMAX reissue in 2003,[71] and a second disc with bonus features. Accompanied by a $19 million marketing campaign,[72] the DVD sold about 3 million units in its first month, but it was less than the number of copies, sold in that amount of time, by any other Platinum Edition released before it.[73] The film's soundtrack was available in its original Dolby 5.1 track or in a new Disney Enhanced Home Theater Mix.[40] The DVD went into moratorium in January 2008, along with its sequels.[74]According to an insert in the Lady and the Tramp Diamond Edition release case, Aladdin was going to be released on Blu-ray Disc as a Diamond Edition in Spring 2013.[75] Instead, Peter Pan was released on Blu-ray as a Diamond Edition on February 5, 2013 to celebrate its 60th anniversary.[76][77] A non-Diamond Edition Blu-ray was released in a few select European countries in March 2013. The Belgian edition (released without advertisements, commercials or any kind of fanfare) comes as a 1-disc version with its extras ported over from the Platinum Edition DVD). The same disc was released in the United Kingdom on April 14, 2013.[78] Walt Disney Studios Home Entertainment released the film on a Diamond Edition Blu-ray on October 13, 2015. The film was released on Digital HD on September 29, 2015.[79][80][81] Upon its first week of release on home media in the U.S., the film topped the Blu-ray Disc sales chart and debuted at number 2 at the Nielsen VideoScan First Alert chart, which tracks overall disc sales behind the disaster film San Andreas.[82]One of the verses of the opening song \"Arabian Nights\" was altered following protests from the American-Arab Anti-Discrimination Committee (ADC). The lyrics were changed in July 1993 from \"Where they cut off your ear if they don't like your face,\" in the original release to \"Where it's flat and immense and the heat is intense.\" The change first appeared on the 1993 video release.[83] The original lyric was intact on the initial CD soundtrack release, but the re-release uses the edited lyric. The rerecording has the original voice on all other lines and then a noticeably deeper voice says the edited line. The Broadway adaptation also uses the edited line.[84] Entertainment Weekly ranked Aladdin in a list of the most controversial films in history, due to this incident.[85] The ADC also complained about the portrayal of the lead characters Aladdin and Jasmine. They criticized the characters' Anglicized features and Anglo-American accents, in contrast to the other characters in the film, which are dark-skinned, have foreign accents and grotesque facial features, and appear villainous or greedy.[83]Protests were also raised to another scene. When Aladdin is attacked by the tiger Rajah on the palace balcony, Aladdin quietly says a line that some people reported hearing as \"Good teenagers, take off your clothes,\"[86] which they considered a subliminal reference to promiscuity. However, according to the director's commentary on the 2004 DVD, while Musker and Clements did admit Scott Weinger ad-libbed during the scene, they claimed \"we did not record that, we would not record that.\" and said the line was \"Good tiger, take off and go...\" and the word \"tiger\" is overlapped by Rajah's snarl.[87] After the word tiger, a second voice can be heard which has been suggested was accidentally grafted onto the soundtrack. Because of the controversy, Disney removed the line on the DVD release.[88]Animation enthusiasts have noticed similarities between Aladdin and Richard Williams' unfinished film The Thief and the Cobbler (also known as Arabian Knight under Miramax Films and The Princess and the Cobbler under Majestic Films International). These similarities include a similar plot, similar characters, scenes and background designs, and the antagonist Zig-Zag's resemblance in character design and mannerisms to Genie and Jafar.[89][90] Though Aladdin was released prior to The Thief and the Cobbler, The Thief and the Cobbler was started much earlier in the 1960s, its production being mired in difficulties including financial problems, copyright issues, and late production times caused by separate studios trying to finish the film after Richard Williams was fired from the project for lack of finished work.[91] The late release, coupled with Miramax purchasing and re-editing the film, has sometimes resulted in The Thief and the Cobbler being labeled a copy of Aladdin.[90]","box_office":"$504.1 million[1]","production_company":"Walt Disney Pictures Walt Disney Feature Animation","directed_by":"Ron Clements John Musker","aladdin":"Theatrical release poster; art by John Alvin","release_dates":"November 25, 1992 (1992-11-25)|||||","Production":"In 1988, lyricist Howard Ashman pitched the idea of an animated musical adaptation of Aladdin. Ashman had written a 40-page film treatment remaining faithful to the plot and characters of the original story, but envisioned as a campy 1930s-style musical with a Cab Calloway/Fats Waller-like Genie.[14] Along with partner Alan Menken, Ashman conceived several songs and added Aladdin's friends named Babkak, Omar, and Kasim to the story.[15][16] However, the studio were dismissive of Ashman's treatment and removed the project from development in which Ashman and Menken were later recruited to compose songs for Beauty and the Beast.[17] Linda Woolverton, who had also worked on Beauty and the Beast, used their treatment and developed a draft with inspired elements from The Thief of Bagdad such as a villain named Jaf'far, an aged sidekick retired human thief named Abu, and a human handmaiden for the princess.[18][19] Then, directors John Musker and Ron Clements joined the production, picking Aladdin out of three projects offered, which also included an adaptation of Swan Lake and King of the Jungle – that eventually became The Lion King.[20] Before Ashman's death in March 1991, Ashman and Menken had composed \"Prince Ali\" and his last song, \"Humiliate the Boy\".[21]Musker and Clements wrote a draft of the screenplay, and then delivered a story reel to studio chief Jeffrey Katzenberg in April 1991.[16] Katzenberg thought the script \"didn't engage\", and on a day known by the staff as \"Black Friday,\" demanded that the entire story to be rewritten without rescheduling the film's November 25, 1992 release date.[22] Among the changes Katzenberg requested from Clements and Musker were to not be dependent on Ashman's vision,[15] and the removal of Aladdin's mother, remarking, \"Eighty-six the mother. The mom's a zero.\"[23] Screenwriting duo Ted Elliott and Terry Rossio were brought in to rework the story,[16] and the changes they made included the removal of Aladdin's mother, the strengthening of the character of Princess Jasmine, and the deletion of several of the Ashman-Menken songs.[24] Aladdin's personality was rewritten to be \"a little rougher, like a young Harrison Ford,\"[16][25] and the parrot Iago, originally conceived as an uptight British archetype, was reworked into a comic role after the filmmakers saw Gilbert Gottfried in Beverly Hills Cop II. Gottfried was cast to provide Iago's voice.[26] By October 1991, Katzenberg was satisfied with the new version of Aladdin.[14] As with Woolverton's screenplay, several characters and plot elements are based on the 1940 version of The Thief of Bagdad,[27][28] the location of the film was changed from Baghdad, Iraq to the fictional Arabian city of Agrabah.[29]One of the first issues that the animators faced during production of Aladdin was the depiction of Aladdin himself.[31] Director and producer John Musker explains:He was initially going to be as young as 13, but that eventually changed to eighteen.[31] Aladdin was designed by a team led by supervising animator Glen Keane, and was originally made to resemble actor Michael J. Fox. During production, it was decided that the design was too boyish and wasn't \"appealing enough,\" so the character was redesigned to add elements derived from actor Tom Cruise and Calvin Klein models.[7]The design for most characters was based on the work of caricaturist Al Hirschfeld,[10] which production designer Richard Vander Wende also considered appropriate to the theme, due to similarities to the swooping lines of Persian miniatures and Arabic calligraphy.[32] Jafar's design was not based on Hirschfeld's work because Jafar's supervising animator, Andreas Deja, wanted the character to be contrasting.[33] Each character was animated alone, with the animators consulting each other to make scenes with interrelating characters. Since Aladdin's animator Glen Keane was working in the California branch of Walt Disney Feature Animation, and Jasmine's animator Mark Henn was in the Florida one at Disney-MGM Studios, they had to frequently phone, fax or send designs and discs to each other.[32] The Magic Carpet is a sentient carpet who is able to fly. Animator Randy Cartwright described working on the Carpet as challenging, since it is only a rectangular shape, who expresses himself through pantomime – \"It's sort of like acting by origami\".[32] Cartwright kept folding a piece of cloth while animating to see how to position the Carpet.[32] After the character animation was done, the carpet's surface design was applied digitally.[10]For the scenery design, layout supervisor Rasoul Azadani took many pictures of his hometown of Isfahan, Iran for guidance.[8] Other inspirations for design were Disney's animated films from the 1940s and 50s and the 1940 film The Thief of Bagdad.[32] The coloring was done with the computerized CAPS process, and the color motifs were chosen according to the personality – the protagonists use light colors such as blue, the antagonists darker ones such as red and black, and Agrabah and its palace use the neutral color yellow.[8][10] Computer animation was used for some elements of the film, such as the tiger entrance of the Cave of Wonders and the scene where Aladdin tries to escape the collapsing cave.[10]Musker and Clements created the Genie with Robin Williams in mind; even though Katzenberg suggested actors such as John Candy, Steve Martin, and Eddie Murphy, Williams was approached and eventually accepted the role. Williams came for voice recording sessions during breaks in the shooting of two other films he was starring in at the time, Hook and Toys. Unusually for an animated film, much of Williams' dialogue was ad-libbed: for some scenes, Williams was given topics and dialogue suggestions, but allowed to improvise his lines.[10] It was estimated that Williams improvised 52 characters.[34] Eric Goldberg, the supervising animator for the Genie, then reviewed Williams' recorded dialogue and selected the best gags and lines that his crew would create character animation to match.[10]The producers added many in-jokes and references to Disney's previous works in the film, such as a \"cameo appearance\" from directors Clements and Musker and drawing some characters based on Disney workers.[13] Beast, Sebastian from The Little Mermaid, and Pinocchio make brief appearances,[8] and the wardrobe of the Genie at the end of the film—Goofy hat, Hawaiian shirt, and sandals—are a reference to a short film that Robin Williams did for the Disney-MGM Studios tour in the late 1980s.[13]In gratitude for his success with Touchstone Pictures' Good Morning, Vietnam, Robin Williams voiced the Genie for SAG scale pay ($75,000), on condition that his name or image not be used for marketing, and his (supporting) character not take more than 25% of space on advertising artwork, since Williams' film Toys was scheduled for release one month after Aladdin's debut. For financial reasons, the studio went back on the deal on both counts, especially in poster art by having the Genie in 25% of the image, but having other major and supporting characters portrayed considerably smaller. The Disney Hyperion book Aladdin: The Making of an Animated Film listed both of Williams' characters \"The Peddler\" and \"The Genie\" ahead of main characters, but was forced to refer to him only as \"the actor signed to play the Genie\".[7][35][36]Composer Alan Menken and songwriters Howard Ashman and Tim Rice were praised for creating a soundtrack that is \"consistently good, rivaling the best of Disney's other animated musicals from the '90s.\"[37] Menken and Ashman began work on the film together, with Rice taking over as lyricist after Ashman died of AIDS-related complications in early 1991.[38] Although fourteen songs were written for Aladdin, only six are featured in the movie, three by each lyricist.[39] The DVD Special Edition released in 2004 includes four songs in early animations tests, and a music video of one, \"Proud of Your Boy\", performed by Clay Aiken,[40] which also appears on the album DisneyMania 3.[41]","produced_by":"Ron Clements John Musker","starring":"Scott Weinger Robin Williams Linda Larkin Jonathan Freeman Frank Welker Gilbert Gottfried Douglas Seale","running_time":"90 minutes","music_by":"Alan Menken","edited_by":"Mark A. Hester H. Lee Peterson","written_by":"Ron Clements John Musker Ted Elliott Terry Rossio","budget":"$28 million[1]"}