{"Cast":"The nude body in the opening scene, taking place in a shower, was not that of Angie Dickinson, but of 1977 Penthouse Pet of the Year model Victoria Lynn Johnson.[4]","country":"United States","distributed_by":"Filmways Pictures","Plot":"Kate Miller (Angie Dickinson) is a sexually frustrated housewife who is in therapy with New York City psychiatrist Dr. Robert Elliott (Michael Caine). During an appointment, Kate attempts to seduce him, but Elliott rejects her advances.Kate goes to the Metropolitan Museum. In a ten-minute sequence entirely without dialogue, she has an unexpected flirtation with a mysterious stranger. Kate and the stranger \"stalk\" each other through the museum until they finally wind up outside, where Kate joins him in a taxi. They begin to have sex and continue at his apartment, unaware that Kate has left her underwear on the floor of the cab.Hours later, Kate awakens and, thoroughly satisfied with her evening, decides to discreetly leave while the man, Warren Lockman (Ken Baker), is asleep. Kate sits at his desk to leave Warren a note and finds a document indicating that he has contracted a sexually transmitted disease. Mortified, she leaves the apartment. In her haste, she has left her wedding ring on the nightstand, so she returns to retrieve it.The elevator doors open on the figure of a tall, blond woman in dark sunglasses wielding a straight razor; and Kate is slashed to death in the elevator (a murder scene De Palma has called the best he has ever done).[3] A high-priced call girl, Liz Blake (Nancy Allen), happens upon the body. She catches a glimpse of the killer, therefore becoming both the prime suspect and the killer's next target.Dr. Elliott receives a bizarre message on his answering machine from \"Bobbi\" (voice of William Finley), a transgender patient. Bobbi taunts the psychiatrist for breaking off their therapy sessions, apparently because Elliott refuses to sign the necessary papers for Bobbi to get a sex change operation. Elliott tries to convince Dr. Levy (David Margulies), the patient's new doctor, that Bobbi is a danger to herself and others.Police Detective Marino (Dennis Franz) is skeptical about Liz's story, partly because of her profession, so Liz joins forces with Kate's revenge-minded son Peter (Keith Gordon) to find the killer. Peter, an inventor, uses a series of homemade listening devices and time-lapse cameras to track patients leaving Elliott's office. They catch Bobbi on camera, and soon Liz is being stalked by a tall blonde in sunglasses. Several attempts are subsequently made on Liz's life. One, in the New York City Subway, is thwarted by Peter, who sprays Bobbi with homemade mace.Liz and Peter scheme to learn Bobbi's real name by getting inside Dr. Elliott's office. Liz baits the therapist by stripping to lingerie and coming on to him, distracting him long enough to make a brief exit and leaf through his appointment book. Peter is watching through the window when a blonde pulls him away. When Liz returns, a blonde with a razor confronts her; the blonde outside shoots and wounds the blonde inside, the wig falls off, and it is Dr. Elliott, revealing that he is also Bobbi. The blonde who shot Bobbi is actually a female police officer, revealing herself to be the blonde who has been trailing Liz.Elliott is arrested and placed in an insane asylum. Dr. Levy explains that Elliott wanted to be a woman, but his \"male\" side would not allow him to go through with the operation. Whenever a woman sexually aroused Elliott, \"Bobbi\", representing the female side of the doctor's personality, became threatened.In a final sequence, Elliott escapes from the asylum and slashes Liz's throat in a bloody act of vengeance. She wakes up screaming, Peter rushing to her side, realizing that it was just a dream.","language":"English","Reception":"Dressed to Kill currently holds an 83% \"fresh\" rating on Rotten Tomatoes based on 42 reviews for an average rating of 6.5 out of 10.[5] Roger Ebert awarded the film three stars out of four, stating \"the museum sequence is brilliant\" and adding: \"Dressed to Kill is an exercise in style, not narrative; it would rather look and feel like a thriller than make sense, but DePalma has so much fun with the conventions of the thriller that we forgive him and go along.\"[6] In his movie guide, Leonard Maltin gave the film 3 1/2 stars out of four, calling it a \"High-tension melodrama\", and stating \"De Palma works on viewers' emotions, not logic, and maintains a fever pitch from start to finish.\" He also praised Pino Donaggio's \"chilling music score.\"[7] \"The performers are excellent, especially Miss Dickinson,\" wrote Vincent Canby in his July 25, 1980 The New York Times review. When Alfred Hitchcock was told that Brian De Palma intended Dressed to Kill as an homage to his movies, he responded “You mean fromage.”[8]Two versions of the film exist in North America, an R-rated version and an unrated version. The unrated version is around 30 seconds longer and shows more pubic hair in the shower scene, more blood in the elevator scene (including a close-up shot of the killer slitting Kate's throat), and some sexier dialogue from Liz during the scene in Elliott's office. These scenes were trimmed when the MPAA originally gave the film an \"X\" rating.Allen earned a Golden Globe nomination for Best New Star, but a Razzie nomination, as well. Filmmaker Quentin Tarantino, a fan of De Palma, was influenced to write True Romance because of this film, pointing to Nancy Allen's performance as the inspiration for the film's leading woman.[citation needed]","box_office":"$31.9 million[2]","cinematography":"Ralf D. Bode","production_company":"Cinema 77/Film Group","directed_by":"Brian De Palma","release_dates":"July 25, 1980 (1980-07-25)|||||","produced_by":"George Litto","starring":"Michael Caine|Angie Dickinson|Nancy Allen|Keith Gordon|","running_time":"104 minutes[1]","dressed_to_kill":"Theatrical release poster","music_by":"Pino Donaggio","edited_by":"Gerald B. Greenberg","written_by":"Brian De Palma","budget":"$6.5 million[2]"}