{"Cast":"Among the special celebrity guest stars who made periodic appearances over the series' run included:[citation needed]","Popular culture":"Rock musician Frank Zappa wrote a composition named \"Mr. Green Genes\" on his album Uncle Meat and a sequel, \"Son of Mr. Green Genes\" on his album Hot Rats. This led to the urban legend that Zappa was the son of Hugh Brannum, who played Mr. Green Jeans, a myth Zappa officially dispelled in his 1989 autobiography, The Real Frank Zappa Book, as did Keeshan in his 1996 autobiography, Good Morning, Captain.[14]Many popular songs make reference to Captain Kangaroo, including the Statler Brothers' 1965 hit song \"Flowers on the Wall\", the \"Weird Al\" Yankovic song \"The Brady Bunch\", the Bloodhound Gang's \"Your Only Friends Are Make Believe\".In the 1975 TV series The Shari Show, hosted by puppeteer and ventriloquist Shari Lewis, one of the puppets is a kangaroo named \"Captain Person\", who is the host of a children's TV show.[15]The character of \"Captain Kangaroo\" himself was given a brief cameo in the 2009 action comedy Black Dynamite, a parody of 1970s Blaxploitation films.[16]","Schwinn marketing":"From the late 1950s, the Schwinn Bicycle Company made use of children's television programming to expand its dominance of the child and youth bicycle markets. The company was an early sponsor (from 1958) of Captain Kangaroo. The Captain himself was enlisted to sell Schwinn-brand bicycles to the show's audience, typically six years old and under.[12] At the end of each live Schwinn marketing promotion, Bob Keeshan would intone, \"Prices slightly higher in the South and in the West\". The on-air marketing program was deemed successful by Schwinn, and the company increased its market share of child and youth bicycles throughout the 1960s.[13]The marketing program continued through the 1971 season, when the Federal Trade Commission's Staff Report, Guidelines on Advertising to Children, recommended against Schwinn's on-air marketing practices using the show's host. In response, Schwinn and the show's writers altered the format in 1972. The Captain no longer insisted that his viewers purchase a Schwinn, but instead made regular on-air consultations of a new character, Mr. Schwinn Dealer.[12] A 1973 internal company news article concluded that the show's child audience had difficulty separating Schwinn's sales pitch from that of the show.[12]","country_of_origin":"United States","original_network":"CBS","created_by":"Bob Keeshan","Schedule history":"While Captain Kangaroo was still in planning stages, CBS executives had the idea of hiring Al Lewis, a kids' show host in Cincinnati (ABC was running Lewis's show at that time), to host their show, but Lewis's managers refused to release him from his contract. Lewis's local kids show went off the air in Cincinnati a year after Captain Kangaroo left CBS.For the first three months, Captain Kangaroo was only seen on weekday mornings. From then until 1968, the show was also seen on Saturday mornings, except in the 1964-1965 season, when it was replaced by a Keeshan vehicle called Mr. Mayor. After 1968, the show was again seen only on weekdays. Except for pre-emption by news or special events, notably the three-day continuous coverage which followed the 1963 assassination of John F. Kennedy , and a few shows that were 45 minutes, the show aired a full 60 minutes on weekday mornings until 1981. It was broadcast in color from September 9, 1966 onward. The time slot for the show was 8:00 a.m. to 9:00 a.m. EST, after which CBS would allow most affiliate stations to air local programming or blocks of sitcom reruns, game shows, or talk shows until time for the network's soap opera time slots.The audience of children could never compete in the ratings with such entertainment/news shows as The Today Show, although Captain Kangaroo won Emmy Awards three times as Outstanding Children's entertainment series in 1978–1979, 1982–1983 and 1983–1984. But in the fall of 1981, to make more room for the expansion of CBS Morning News, the Captain was moved to an earlier time slot of 7 a.m. and cut to 30 minutes, sporting the new title Wake Up with the Captain. The show was moved again in the spring of 1982 to 6:30 a.m.; a time when few children (or adults) were awake. In the fall of 1982, it returned to an hour format, but was moved to Saturday mornings at 7 a.m. Eastern Time and 6 a.m. in other time zones. Reruns from the previous season were offered to CBS affiliates to run Sunday morning in place of the cartoon reruns offered before, but most declined. One-third of affiliates no longer ran the show at all after 1982, and it was again reduced to a half-hour in the fall of 1984. Angered over the reduction of his program for the second time, Keeshan chose to step down at the end of 1984, after his contract with CBS expired.Just over a year later, in October 13, 1986, Captain Kangaroo returned in reruns on PBS television stations, with funding from public television stations, School Zone Publishing Company and from the John D. and Catherine T. MacArthur Foundation. American Public Television, then known as the \"Interregional Program Service\", distributed the show, along with Britder Associates (Keeshan's production company), and the Riehl Company, owned by former WPBT station manager Dale Riehl.The show was on the air for 29 years, making it one of the longest-running network children's program series. Sesame Street, which still airs, holds the record at 46 years. Several of the original Sesame Street writers and producers were hired from the Captain Kangaroo staff to help produce and direct the new program when it went on the air in 1969.The original director of the program was Peter Birch, who helmed the program for its first 25 years. Producer Jim Hirschfeld took over as director following Birch's heart attack in 1980 and continued directing, as well as producing throughout the rest of the show's run, including the new segments inserted into the PBS reruns, until it went off the air in 1993.The cast of Captain Kangaroo also hosted the CBS coverage of the Macy's Thanksgiving Day Parade for several years in the 1960s.","original_release":"October 3, 1955 (1955-10-03) – December 8, 1984 (1984-12-08)","Format":"The show did not have a strict format, other than the entire program taking place in and around the Treasure House (known in later years as \"The Captain's Place\"), where the Captain would interact with puppets, guests or other members of the cast. Even the opening sequence could change. The show would generally begin with the theme music starting up, then the Captain would unlock and open the doors of the Treasure House from the inside, and viewers would catch their first glimpse of him. Then he would put the Treasure House keys on a nail, and the music would stop. However, sometimes the Captain could not get the keys to stay on the nail, and when they fell off, the theme music would begin playing again.One never knew exactly what would happen from one episode to the next, although at certain times of the year, such as the Christmas season, paper cutout versions of such stories as The Littlest Snowman would be shown.Several cartoon shorts were featured over the course of the series' run, including:A cartoon starring a funnel-capped shape-shifting boy named Tom Terrific was part of the show in the 1950s and 1960s. Tom had a sidekick named Mighty Manfred the Wonder Dog, and a nemesis, Crabby Appleton. Other cartoons included Lariat Sam, which was developed by veteran game show announcer Gene Wood, then a show staffer (who also sang the cartoon's theme song).The British cartoon Simon in the Land of Chalk Drawings appeared in the 1970s, featuring a child with magic chalk who could create all sorts of short-lived creations in short adventures (the original version featured a British narrator, but Keeshan's voice was dubbed onto the cartoons for their U.S. airing).Another British-produced cartoon, Ludwig, about a magical egg-shaped robot, was also included around the same time as Simon. The cartoon's musical score consisted of selections from the works of Beethoven.Also appearing in the 1970s was The Most Important Person, a short series of five-minute segments on the importance of life; and The Kingdom of Could Be You, a short series of five-minute segments on the importance of careers and the work world.There was also a cartoon series called The Toothbrush Family. Based on an extended family of hygiene utensils as the name suggests, they would embark on adventures based in the bathroom, like water skiing in the tub, or rescuing friends caught in the drain. Episodes were generally a couple of minutes each and basically revolved around teaching children the importance of dental care.A silent cartoon in the 1970s named Crystal Tipps featured the adventures of a young girl. Later reruns were narrated by the voice of Mr. Moose. Another British favorite, The Wombles was also featured.The Red & Blue shorts from Italy were also shown.The Undersea Adventures of Captain Nemo, featuring a family of sea explorers, was featured as well.Beginning in 1974 and continuing throughout the rest of the 1970s and into the 1980s, the show would open with different people wishing the Captain \"good morning\". Many of the openings featured non-celebrities, but some featured stars from TV shows, most of which broadcast over CBS, such as The Bob Newhart Show and One Day at a Time, as well as other characters with a connection to another network, including William Shatner and Leonard Nimoy, dressed as Captain Kirk and Mr. Spock; characters from the Peanuts cartoons; and Fred Rogers from Mister Rogers' Neighborhood. The montage of \"good mornings\" would always end with the Captain himself returning the greeting before the opening credits ran.Other regular features included The Magic Drawing Board and the Captain's \"Reading Stories\" sessions, which introduced kids to stories such as Curious George, Make Way for Ducklings, Stone Soup, Caps for Sale and Mike Mulligan and His Steam Shovel.[9] The Sweet Pickles books were also featured.Songs included Captain Kangaroo, The Captain's Place, Little Mary Make Believe, Dennis Anyone, Guess Who I Am, Little Black Frog, How Does the Jelly Get in the Donut, There's a Hole in the Bottom of the Sea, Erie Canal, Horse in Striped Pajamas, The Littlest Snowman, Daniel the Cocker Spaniel, You can Grow Up to Be President, Spend Some Time With Your Child, and many more. Carmino Ravosa was a songwriter on the show from 1975 to 1977.[10] On the first show of every month the Captain would have a birthday cake for all of the children with birthdays that month.Keeshan also had a recurring role as \"The Town Clown\", a pantomime piece that took place in and around the exposed wagon home of a tramp-like circus clown. Like the character of Clarabelle that he played on Howdy Doody, the Town Clown never spoke.Favorites on the show were Grandfather Clock (voiced by Cosmo Allegretti), Rollo the Hippo and Dancing Bear.Dancing Bear was mute and only appeared in short subject features. He often danced waltzes to background music.One of the show's long-running gags was the \"Ping Pong Ball Drop\", instigated by the telling of a joke (usually a Knock-Knock joke) by Mr. Moose in which the punchline would include the words \"ping pong balls\". At the mention of those three words, a shower of ping pong balls would be released from above on the Captain.The show would very often have simple black light theatre segments utilizing paper or cardboard cutouts. A notable recording of a popular song, such as Judy Garland's Decca recording of Over the Rainbow (from The Wizard of Oz), Mary Martin singing Never Never Land (from the original cast recording of the musical Peter Pan), or Danny Kaye singing Inchworm (from the Decca recording of the songs from Hans Christian Andersen) would be heard while the cutouts played on the screen, animated by a concealed puppeteer. On other occasions, full-fledged hand puppets would \"perform\" to the song being played (as in the case when a hand puppet dressed in Spanish clothing performed to a recording of tenor Allan Jones singing The Donkey Serenade).Familiar props included a mockup of a talking cathedral-style radio that Keeshan simply called \"Radio\". Keeshan would turn the large knobs on \"Radio\" to get a conversation going. Reminiscent of the old Atwater Kent cathedrals, \"Radio\" had a rather interesting conversation with a smaller transistor radio in one show. Also featured was a huge Colgate toothpaste box with a large windup or clockwork key on the side. Keeshan turned the key to play a jingle (\"Colgate Fluoride M-F-P/Helps Prevent the Cavity/And it Tastes Great, Naturally!\") for the show's sponsor, Colgate Toothpaste.At the end of each episode, the Captain always encouraged parents watching the show to spend some quality time with their children every day, and he would often demonstrate various creative ways in which to do so.","Revival":"In 1997–1998, a sequel revival series titled The All New Captain Kangaroo was created by Saban Entertainment. John McDonough played the Captain on this version, which was shot in Tampa, Florida. Keeshan was invited to appear as a special guest called \"The Admiral\", but after seeing sample episodes, he declined to appear or have any association with the new incarnation.[citation needed] It ran for one season in syndication and inspired a spin-off show, Mister Moose's Fun Time; it served as the centerpiece for a programming block on the then newly launched Fox Family Channel (half-owned by Saban), dubbed Captain Kangaroo's Treasure House, from 1998 to 2000; the block also featured reruns of Shining Time Station and Magic Adventures of Mumfie.In 2011, the trademark for \"Captain Kangaroo\" was acquired by The Cashin Comedy Co.[17] In a blog, the Captain is portrayed by Pat Cashin.[18]","captain_kangaroo":"Captain Kangaroo (Bob Keeshan), left, with Nipsey Russell, 1976.","opening_theme":"\"Puffin' Billy (The Captain Kangaroo Theme)\" [1]","starring":"Bob Keeshan Hugh Brannum","running_time":"60 minutes / 30 minutes","Theme song":"The original theme song to Captain Kangaroo (titled \"Puffin' Billy\") was used from 1955 to 1974. It was an instrumental, written by Edward G. White. The track was from a British stock music production library known as the Chappell Recorded Music Library which was sold through a New York agency called Emil Ascher. The tune's original title referred to a British steam locomotive. This tune was used on other programs on both sides of the Atlantic. For example, two years before Captain Kangaroo, it served as the wrap-up music for an episode of the radio program Rocky Fortune called \"Murder Among the Statues\". In its native United Kingdom, it became famous as the theme to the weekly BBC radio program Children's Favourites from 1952 to 1966, and is still widely recognised by the post-war generation. It was later used in the Enid Blyton parody Five Go Mad in Dorset and in a number of British TV adverts, including a Captain Sensible spot. The \"Puffin' Billy\" theme played as the opening of each episode, with the music continuing until the Captain hung his large ring of keys on a nail (which seemed to act as a switch to turn off the music). If the Captain's keys ever slipped off the nail, the music would begin playing again.In 1957, lyricist Mary Rogers penned lyrics to the tune, creating a newly titled Captain Kangaroo song.In 1974, a new theme song titled \"Good Morning, Captain\" was composed for Captain Kangaroo, written by Robert L. Brush. As the new theme used similar melodic elements from the original theme, Edward G. White's name was added to the song credits. However, due to copyright issues, the song was later re-recorded without the portion of \"Puffin' Billy\" featured in the first version.During the brief Wake Up With the Captain era, a theme titled \"Wake Up\" was used.For the show's final two seasons and the later PBS run, Schoolhouse Rock mainstay Lynn Ahrens (who composed and performed a few Captain Kangaroo songs herself) wrote a new theme, entitled \"Here Comes Captain Kangaroo\".The theme song for All New Captain Kangaroo used the opening notes and part of the melody of the original theme as its introduction.Bob Keeshan also recorded music for both Columbia Records and Golden Records aimed at introducing all kinds of music to children.[11]","written_by":"Howard Friedlander","no._of_seasons":"38"}