{"based_on":"Battle Royale  by Koushun Takami","country":"Japan","distributed_by":"Toei Company","screenplay_by":"Kenta Fukasaku","battle_royale":"Japanese poster","Legacy":"In 2009, Quentin Tarantino listed Battle Royale as his favorite film released since he began directing in 1992.[59] That same year, Moviefone included it in the top five of its \"50 Best Movies of the Decade\" list.[60] Jon Condit of Dread Central called it \"one of the best movies [he's] ever seen.\"[61] Bloody Disgusting ranked the film fifteenth in its list of the \"Top-20 Horror Film of the Decade\", with the article calling the film \"a go-for-broke extravaganza: fun, provocative, ultra-violent, and bound to arouse controversy (which it did)...the film [is] more than just an empty provocation – it builds character through action, a method all good filmmakers should seek to emulate.\"[62] In 2010, Empire ranked Battle Royale #235 and #82 on their lists of \"The 500 Greatest Movies of All Time\" and \"The 100 Best Films of World Cinema\" respectively.[63][64] Time magazine included the film in its list of Top 10 Ridiculously Violent Movies.[65] In 2012, The Independent included it in its \"10 best sports movies ever made\" list.[66] Complex magazine ranked it #47 in its list of The 50 Best Action Movies of All Time.[67]Since its release, the film has had an influence on filmmakers such as Quentin Tarantino,[68] most notably his Kill Bill films;[49] the character Gogo Yubari, played by Chiaki Kuriyama, resembles the character she plays in Battle Royale, Takako Chigusa.[69] Battle Royale has also been referenced in the 2004 zombie comedy film Shaun of the Dead, where Edgar Wright and Simon Pegg made sure a big Battle Royale poster is prominently displayed in Shaun’s living room.[70] Despite not being officially released in the United States for a long time, Battle Royale has often been referenced in American pop culture, ranging from Tarantino's films to the rock band The Flaming Lips' use of footage from the film as a backdrop for its Yoshimi Battles The Pink Robots tour,[71] along with references in Hollywood films such as Jason Reitman's Thank You for Smoking (2005) and Juno (2007) and American television shows such as Lost and Community.[70]Maggie Lee of Reuters describes Battle Royale as the \"film that pioneered the concept of the teen death game\", citing its influence on films such as Kaiji (2009) and Hideo Nakata's The Incite Mill (2010), both of which starred Tatsuya Fujiwara (who played Battle Royale's protagonist Shuya Nanahara) in the leading roles.[72] V.A. Musetto of the New York Post compared it to The Condemned (2007), which the critic called \"a bad rip-off\" of Battle Royale as well as The Most Dangerous Game.[73]Critics have also noted the influence of Battle Royale on other films, such as the 2006 release Smokin' Aces, 2008's Kill Theory,[74] the 2009 film The Tournament,[75] and the 2012 blockbuster The Hunger Games.[76][77] Battle Royale has also drawn comparisons to works such as the Gantz franchise of manga (2000), anime (2004) and films (2011),[78] the 2007 video game The World Ends with You,[79] the 2009 film Gamer,[80] the 2010 video game Dangan Ronpa[81] and the 2010 film Kick-Ass.[82]The film has also influenced the creation of the Marvel Comics series Avengers Arena, starring X-23, Nico Minoru of the Runaways, Darkhawk, Reptil, Hazmat, Mettle, and other former Avengers Academy students, as well as several other characters in a duel to the death forced into being by the villain, Arcade.[citation needed] The series' logo also mirrors that of the logo used in the Battle Royale movie.Kinji Fukasaku, who directed the first film, began work on a sequel, entitled Requiem, but died of prostate cancer on January 12, 2003, after shooting only one scene with Takeshi Kitano. His son Kenta, who wrote the screenplay for both films, directed the rest of the film, which was released on May 18, 2003.Unlike the first film, the sequel is not adapted from a novel, but was based on an original screenplay written by Kenta Fukasaku. The plot revolves around the survivor Shuya Nanahara leading a terrorist rebellion, but was controversial for its provocative anti-American sentiments and criticised for being inferior to the original.[83]In June 2006, Variety reported that New Line Cinema, with producers Neil Moritz and Roy Lee, intended to produce a new adaptation of Battle Royale.[84] Several Web sites echoed the news, including Ain't It Cool News, which claimed the remake would be \"an extremely Hard R – serious-minded Americanisation of BATTLE ROYALE.\"[85] New Line tentatively set a release date of 2008.The next month, The New York Times reported on an Internet backlash against the remake. Through the article, Lee assured fans of his respect for the original work, claiming, \"This is the one I'm going to be the most careful with.\" He stated that, despite earlier concerns, the film would not be toned down to PG or PG-13, the characters would remain young teenagers, and that it would draw elements equally from the novel, the original film, and the manga. The reporter noted \"the hubbub...was at least slightly premature [as] New Line hasn't yet purchased the remake rights.\"[86]Following the Virginia Tech massacre in April 2007, Lee claimed that prospects for the remake had been \"seriously shaken\". While he remained willing to proceed, he stated, \"we might be a little more sensitive to some of the issues.\" The reporting article noted that New Line still had not secured remake rights – its spokeswoman claimed \"no news\" when asked about progress on any deal.[87]Maclean's pointed out that the 2008 novel The Hunger Games, and its subsequent 2012 film adaptation, have similar themes.[88] Although Hunger Games author Suzanne Collins maintains that she \"had never heard of that book until [her] book was turned in\", The New York Times reports that \"the parallels are striking enough that Collins's work has been savaged on the blogosphere as a baldfaced ripoff\", but argues that \"there are enough possible sources for the plot line that the two authors might well have hit on the same basic setup independently.\"[89] The 2012 film adaptation has also faced similar criticisms for similarities to Battle Royale.[76][77]In March 2012, Roy Lee reported that a remake of Battle Royale would no longer be possible due to the release of The Hunger Games, stating, \"Audiences would see it as just a copy of Games – most of them wouldn't know that ‘Battle Royale’ came first. It's unfair, but that's reality.\" However, he stated that he might return to the film in ten years to \"develop a ‘Battle Royale movie for the next generation.\"[77]During the summer of 2012, The CW Television Network had been in discussion with the Hollywood representatives about the possibility of turning Battle Royale into an American television show. According to a spokesperson, the talks were only preliminary, but if a deal could be reached, the network would acquire rights to Koushun Takami's underlying novel, then unpack and expand on it for an hour-long dramatic series. Joyce Jun, a Hollywood attorney representing U.S. rights to the title, states that \"there is no deal in place\". A CW spokesman confirmed only there had been some discussion but declined to comment further.[90]","Plot":"Japanese middle school student Shuya Nanahara copes with life after his father's suicide. Meanwhile, schoolmate Noriko Nakagawa is the only student attending class 3-B. Their teacher, Kitano, resigns after being impulsively attacked by a student.One year later, class 3-B takes a field trip, but they are gassed, fitted with electronic collars, and sent to a \"briefing room\" on a remote island. Kitano explains that the class has been chosen to participate in the annual Battle Royale as a result of the BR Act, which was passed after 800,000 students walked out of school. A cheerful orientation video instructs the class they have three days to kill each other until only one remains. The explosive collars will kill any uncooperative students or those within daily \"danger zones\". Kitano kills two students, Fumiyo Fujiyoshi and Yoshitoki Kuninobu (Shuya's best friend), for misbehavior during the video. Each student is provided a bag of food and water, map of the island, compass, and a weapon ranging in efficiency from firearms to a paper fan.The program's first six hours see twelve deaths, four by suicide. Mitsuko Souma and mute transfer student Kazuo Kiriyama soon become the most dangerous players, while another transfer student, Shogo Kawada, seems somewhat more merciful. Shinji Mimura plots to hack into the military's computer system. Amid shifting loyalties and violent confrontations, Shuya promises to keep Noriko safe, because his friend secretly loved her. Shuya carries Noriko to a clinic after she collapses, where they encounter Kawada, who reveals that he won a previous Battle Royale at the cost of his girlfriend, whose death he seeks to avenge. When Kiriyama attacks, Shuya entrusts Kawada to protect Noriko and runs off as a distraction. Although saved by Hiroki Sugimura, he is wounded.Shuya awakens in the island's lighthouse, bandaged by female class representative Yukie Utsumi, who has a crush on him. Five other girls from her clique have also been hiding out in the building, including Yuko Sakaki, who attempts to poison Shuya only for Yuka Nakagawa to accidentally eat the food. Yuko is the only survivor of the resulting shootout; despondent, she apologises to Shuya and commits suicide. Shuya returns to Noriko and Kawada, and they set out to find Mimura. Of the seven students remaining, all except Kiriyama are attempting or willing to subvert the game. Mimura and two others, Yutaka Seto and Keita Iijima, infiltrate the military's computer system, but Kiriyama finds and kills them. When Kawada, Noriko and Shuya arrive at the hackers' burning base, Kawada confronts and kills Kiriyama, who had been blinded by an explosion rigged by Mimura as he was killed.On the morning of the final day, Kawada, aware of the collars' internal microphones, takes Shuya and Noriko aside and fakes their deaths. Suspicious, Kitano ends the game and dismisses the troops, intent on personally killing the supposed victor. Kitano realizes that Kawada had hacked into the game's system months beforehand, and has now disabled Shuya and Noriko's tracking devices. The three survivors confront Kitano in the headquarters, and he unveils a disturbing homemade painting of the massacred class that depicts Noriko as sole survivor. He reveals that he was unable to bear the hatred between him and his students, having been rejected by his daughter. He confesses that he always thought of Noriko as a daughter and asks her to kill him, but Shuya shoots Kitano after he threatens Noriko with a gun. As he falls, Kitano shoots, revealing that it is a water gun. As he dies, Kitano angrily takes a call from his daughter and rebukes her.Shuya, Noriko and Kawada leave the island on a boat, but Kawada dies from injuries sustained in his gunfight with Kiriyama – \"glad\" that in the end, he \"found true friends.\" Shuya and Noriko are declared fugitive murderers, and are last seen on the run in the direction of Tokyo's Shibuya train station. Noriko gives Shuya a Seto Dragon Claw balisong butterfly knife before they run off together.","language":"Japanese","Reception":"The film was highly acclaimed by critics in the Western world, with an 86% rating at Rotten Tomatoes, based on 43 reviews. The site's consensus was \"Battle Royale is a controversial and violent parable of adolescence, heightening teenage melodrama with life-or-death stakes.\"[35] Robert Koehler of Variety commented, \"Given the most basic characters to work with, the mostly teen cast attacks the material with frightening gusto, and Fujiwara dutifully invokes the voice of inner moral conflict. Production is exceedingly handsome and vigorous, offering no sign that Fukasaku is slowing down.\" He stated that, \"returning to his roots as Japan's maestro of mayhem, Kinji Fukasaku has delivered\" one of \"his most outrageous and timely films\", comparing it to \"the outrage over youth violence\" that Stanley Kubrick's A Clockwork Orange \"generated in early-'70s Britain\" and featuring some of \"the most startling scenes of mayhem since the movies of the wild and bloody '70s.\"[11] Jason Korsner of BBC News gave Battle Royale four out of five stars, stating that it is \"a heart-stopping action film, teaching us the worthy lessons of discipline, teamwork, and determination, but wrapping them up in a deliberately provocative, shockingly violent package.\" BBC users gave the film five out of five stars.[36] Almar Haflidason of BBC also gave the film five out of five stars.[37] In a review for Empire, critic Kim Newman gave the film four stars out of five. He compared it to Lord of the Flies in how it makes audiences \"wonder what they would do in the same situation\", but wrote that Battle Royale gives \"even harder choices for its school-uniformed characters.\" He concluded that, \"Some will be uncomfortable or appalled, and the mix of humour and horror is uneasy, but this isn't a film you'll forget easily. And, seriously, what would you do?\"[38]The Guardian critic Peter Bradshaw gave the film four stars in September 2001, choosing it as the best film of the week. He praised Takeshi Kitano's performance as the teacher and some of the scenes as \"a stunningly proficient piece of action film-making, plunging us into a world of delirium and fear.\" He notes that, among \"the hail of bullets and the queasy gouts of blood, troubling narratives of yearning and sadness are played out. It is as if the violence of Battle Royale is not a satire of society at all, but simply a metaphor for the anguish of adolescent existence.\" He concluded that, while some \"will find the explicit violence of this movie repulsive\", it \"is a film put together with remarkable confidence and flair. Its steely candour, and weird, passionate urgency make it compelling.\"[39] Bryant Frazer of Deep Focus gave it a B+ rating and called it \"a vicious take-off on reality TV that turns a high-school milieu dominated by cliques and childish relationships into a war zone.\"[40] British critic Jonathan Ross stated that \"if you want to catch a wildly original and super-cool slice of entertainment before it gets remade and ruined by the Americans, then I suggest you try hard not to miss it\" and concluded that \"it's a wildly imaginative example of just what can be achieved in a teen movie.\"[41] In 2009, filmmaker Quentin Tarantino praised Battle Royale as the best film he had seen in the past two decades, stating that, \"If there’s any movie that’s been made since I’ve been making movies that I wish I had made, it’s that one.\"[42]There has been renewed interest in the film following its 2012 Blu-ray release in the United States. Chris Nashawaty of Entertainment Weekly rates the film as \"A\" grade, positing that examination of the students' different motives for survival or subversion of the Program is a \"sick blast\".[43] A.O. Scott of The New York Times gave the film a positive review, stating \"[the] expertly choreographed scenes of mayhem are at once comical and appalling, and [Fukasaku's] young cast embraces the melodramatic extremity of the story with impressive conviction\", adding that Battle Royale \"is in many ways a better movie [than The Hunger Games] and in any case a fascinating companion, drawn from a parallel cultural universe. It is a lot uglier and also, perversely, a lot more fun.\"[44] Entertainment critic for the Miami Herald Cary Darling describes Battle Royale as \"tense, tragic and timely... a modern-day horror story imbued with an electric sense of drama and dread.\"[45] Alexandra Cavallo of the Boston Phoenix writes, \"Battle Royale is The Hunger Games not diluted for young audiences\" while giving the film three stars out of four.[46] Jeffrey M. Anderson of Combustible Celluloid gave the film 4 out of 4 stars, calling it a \"gloriously sick and twisted story\" and claiming that it is \"endlessly entertaining, by turns gory and hilarious, disturbing and exciting.\"[47] In the Chicago Sun-Times, Roger Ebert's Australia correspondent Michael Mirasol praised Battle Royale for its \"thoughtful characterisation\" that is \"lavished upon all the students\" and concluded that it is an \"intensely violent fable aimed at a young audience, but with true feeling, intelligence, and respect.\"[48] Jake Mulligan of The Suffolk Voice gave it five out of five stars, stating that \"the influence of “Royale” on works as disparate as \"Kill Bill\" and \"The Hunger Games\" cannot be measured\" and describing Battle Royale as \"Provocative, funny, violent, and aided by a script that somehow gives equal attention to most of the students while also displaying the well-thought out minutia behind the narrative.\"[49][unreliable source?]R.L. Shaffer of IGN gave the film a score of 8 out of 10, taking \"a moment to thank The Hunger Games for reminding us how awesome Battle Royale really is\" and concluding that Battle Royale is \"a masterpiece of mayhem, violence and unfettered teen melodrama.\"[50] J. Hurtado of Twitch Film noted that many \"reviews of Battle Royale focus on the violence, which is extreme to be sure, and not so much on the humanity of the film.\" He stated that \"cranking up that already elevated hormonal level of emotional hysteria by throwing these students into a real life-or-death situation is incredibly effective\" and that \"the story of Battle Royale is the story of those teenage years and just how wrong we all were about the extent of our emotional turmoil.\"[51] DVD Talk gave the original theatrical cut of the film 4.5 out of 5 stars and 4 out of 5 for the Director's Cut, concluding that it gives \"a glimpse into what might very well happen should the rules of society, such as they are, ever do crumble to the point where it's everyone for themselves. There's enough black humor here and enough tense action that the film never quite feels bleak or depressing (though it does come close) – but most importantly it makes you think.\"[52] Devon Ashby of CraveOnline gave the film a score of 8.5 out of 10, referring to it as \"Japanese legend Kinji Fukasaku’s adolescent shooting spree opus\" and \"a compassionate and technically accomplished masterpiece.\"[53] Brent McKnight of PopMatters gave the film a score of 9 out of 10, describing it as \"savage, sharp, satirical, and brutally funny\" and \"a bleak commentary on humanity and society.\"[54]While some viewers[who?] have expressed the opinion that the film is a maximalist satire of modern education systems and students' transitions into competitive and exploitative employment markets, if not simply the trials and tribulations of youth,[citation needed] others[who?] have found the story more subtly symbolic of the various longer-term consequences in maintaining nationalistic, insular, and zero-sum diplomatic and socio-political policies, particularly pertaining to Japanese imperialism, censorship, and militarism in the mid-20th century.[55]At the 2001 Japanese Academy Awards, Battle Royale was nominated for nine awards, including Picture of the Year and won three of them.[56] The film also received multiple awards from international film festivals.[57][58]","box_office":"JP¥3.11 billion (US$25,000,000+) (Japan)","cinematography":"Katsumi Yanagishima","production_company":"AM Associates Kobi Nippon Shuppan Hanbai MF Pictures WOWOW Gaga Communications","directed_by":"Kinji Fukasaku","Home media":"The creators of the sequel postponed the release of the DVD (originally scheduled for June 9, 2004) to later that year because of the Sasebo slashing, in which the killer had read Battle Royale.[31]Arrow Video released the film on Blu-ray and DVD in a Limited Edition version in the United Kingdom on December 13, 2010 as a three-disc collector's edition set, featuring both cuts of the film. The DVD version was limited to 5,000 copies. The Blu-ray version was initially being released as limited to 5,000 copies but due to the large volume of pre-orders was increased to 10,000 copies. The Limited Edition Blu-ray is region-free, meaning it can play on Blu-ray players worldwide.[32] The DVD is also region-free.[33]Bootleg copies of the film imported from China and South Korea have widespread availability in North America. A Special Edition DVD of the film was carried to a limited extent by retailers such as HMV and Starstruck Entertainment in Canada and Tower Records in the United States; the legal status of this edition is not clear. Also, the film's UK distributor, Tartan Films, released an all-region NTSC DVD version of the film that is available in North America from specialty outlets. One widely available Hong Kong import is a special edition without English subtitles that contains both films. Battle Royale and its sequel are available on Netflix, a major home-entertainment distributor in the United States.An official DVD and Blu-ray edition of the film (and its sequel) was released in North America on March 20, 2012 by Anchor Bay Entertainment.[34] The film is available in a standard edition featuring the two films and a 4-disc Complete Collection that features both the Special Edition (labelled the Director's Cut) and the theatrical version of the first film, the sequel, and a disc of behind-the-scenes material.","Theatrical release":"Fukasaku originally opposed the R15 rating given by the Eiga Rinri Kanri Iinkai (Eirin) because of Fukasaku's experiences as a teenager, the novel's use of 15-year-olds, and the fact that many of the actors were around fifteen years of age. After he submitted an appeal and before Eiga Rinri Kanri Iinkai could rule on the appeal, members of the Diet of Japan said that the film harmed teenagers; the Diet members also criticised the film industry ratings, which were a part of self-regulation by the Japanese film industry. Fukasaku dropped the appeal to appease the Japanese Diet in hopes they would not pursue increasing film regulation further.[5][7]The film was labeled \"crude and tasteless\" by members of Japanese parliament and other government officials after the film was screened for them before its general release.[9] The film created a debate over government action on media violence. At one point, director Kinji Fukasaku allegedly gave a press statement directed at the age group of the film's characters, saying \"you can sneak in, and I encourage you to do so.\"[10] Many conservative politicians used the film to blame popular culture for a youth crime wave. Ilya Garger of TIME magazine said that Battle Royale received \"free publicity\" and received \"box-office success usually reserved for cartoons and TV-drama spin-offs.\"[3] The Japanese reaction to the film in the early 2000s has been compared to the British outrage over A Clockwork Orange in the early 1970s.[11] Critics note the relation of Battle Royale to the increasingly extreme trend in Asian cinema and its similarity to reality television.[12]For eleven years, the film was never officially released in the United States or Canada, except for screenings at various film festivals.[citation needed] The film was screened to a test audience in the U.S. during the early 2000s, not long after the Columbine High School massacre, resulting in a negative reaction to the film's content.[13] According to the book Japanese Horror Cinema, \"Conscious of the Columbine syndrome, which also influenced the reception of The Matrix (1999), much of the test audience for Battle Royale condemned the film for its 'mindless' and gratuitous violence in terms very reminiscent of the British attitude towards Sam Peckinpah's Straw Dogs (1971) on its initial release.\"[14]No North American distribution agreement for the film had ever been reached due to myriad corporate and legal concerns on the parts of both the Japanese Toei Company and prospective North American studios, despite mutual interest.[15] It was said in 2005 by a representative of a prospective U.S. distributor that Japanese executives from the Toei Company were advised by American lawyers who attended test screenings in the early 2000s that \"they'd go to jail\" had the film been mass-released in the USA at the time.[13][16] In the company's best interests, Toei attached prohibitive rules, costs, and legal criteria to any possible North American distribution deal. Toei representative Hideyuki Baba stated that the reason for \"withholding distribution\" in North America was \"due to the picture's contents and theme.\" A representative for a prospective US distributor criticised Toei for expecting a wide release like Crouching Tiger, Hidden Dragon rather than a limited art house run, noting that \"in the US it will never get past the MPAA ratings board, and the major theater chains will never play it un-rated. If you cut it enough to get an R rating there'd be nothing left.\"[17]In April 2013, the District Court (Amtsgericht) in Fulda, Germany, decided after some turns in the legal system that Battle Royale violates §131 of the Criminal Code, making it guilty of glorification of violence.[18] The film was confiscated and banned in Germany, but subsequently the ban was lifted following an objection by the German distributor Capelight Pictures.[19]Battle Royale was released on December 16, 2000, in Japan, grossing ¥3.11 billion domestically (over $25 million US).[3][20] Over the next two years, the film was distributed to cinemas throughout Asia, Australia, Europe, and South America (in addition to Mexico), gaining early cult film followings in France, the United Kingdom, Germany, Spain, and the Philippines.[citation needed]The first showing in the US was at the Pacific Film Archive in Berkeley, California, in 2002.[21]The original 113-minute version of the film began its first North American theatrical run at the Cinefamily Theater in Los Angeles on December 24, 2011 – 11 years after its original Japanese release.[22] The planned 9-day run was extended another 6 days due to popular demand.[23] Beginning in early 2012, the film has been publicly exhibited at screenings in many American universities, including those in Wisconsin, Oklahoma, Texas and Massachusetts, with a New York City run at the IFC Center that began on May 25, 2012. As of June 2012, it has been regularly showing at the Projection Booth Theatre, site of the former Gerrard Cinema in Toronto, Canada.[24][25][26] The Cleveland Cinematheque also held a screening of the film on April 3, 2012.[27]A special edition of the film was released after the original which has eight extra minutes of running time. Unusually, the extra material includes scenes newly filmed after the release of the original. Inserted scenes include (but are not limited to):The film was released to theaters in 3D in Japan on November 20, 2010. Fukasaku's son and the film's screenwriter, Kenta Fukasaku, oversaw the conversion.[28] The 3D version was also screened at the Glasgow Film Festival on 24 February 2011.[29] Anchor Bay Entertainment planned to release the 3D version in the United States sometime in 2011,[30] but the release was cancelled.[22]","release_dates":"December 16, 2000 (2000-12-16)|||||","Production":"Kinji Fukasaku stated that he decided to direct the film because the novel it was adapted from reminded him of his time as a 15-year-old munitions factory worker during World War II. At that time, his class was made to work in a munitions factory. In July 1945, the factory came under artillery fire. The children could not escape so they dived under each other for cover. The surviving members of the class had to dispose of the corpses. At that point, Fukasaku realised that the Japanese government was lying about World War II, and he developed a burning hatred of adults in general that he maintained for a long time afterwards.[5]Beat Takeshi told a documentary crew during filming that he believes \"an actor's job is to satisfy the director... I move the way I'm told to. I try to look the way I'm told to. I don't know much about the emotional side\", before adding, \"Mr. Fukasaku told me to play myself. I did not really understand, but he told me to play myself, as I ordinarily would be! I'm just trying to do what he tells me.\"[6]When asked in an interview with The Midnight Eye if the film is \"a warning or advice to the young\", Kinji Fukasaku responded by describing the words \"warning\" and \"advice\" as \"sounding very strong to me\" as if they were actions which one tries to accomplish; therefore the film would not be \"particularly a warning or advice.\" Fukasaku explained that the film, which he describes as \"a fable\", includes themes, such as crime by young people, which in Japan \"are very much real modern issues.\" Fukasaku said that he did not have a lack of concern or a lack of interest; he used the themes as part of his fable. When the interviewer told Fukasaku that he asked the question specifically because of the word \"run\" in the concluding text, which the interviewer described as \"very positive\", Fukasaku explained that he developed the concept throughout the film. Fukasaku interpreted the interviewer's question as having \"a stronger meaning\" than \"a simple message.\" He further explained that the film simply contains his \"words to the next generation\", so the viewer should decide whether to take the words as advice or as a warning.[5][7]The film score of Battle Royale was composed, arranged and conducted by Masamichi Amano, performed by the Warsaw Philharmonic Orchestra and features several pieces of Western classical music along with Amano's original compositions. The choral movement used in the film's overture and original trailer is the \"Dies Irae\" from Giuseppe Verdi’s Requiem.The song used during the end credits, \"Shizuka na Hibi no Kaidan o\" by the rap rock band Dragon Ash, is not included in either the Japanese or French edition of the soundtrack.[8]","produced_by":"Masao Sato Masumi Okada Teruo Kamaya Tetsu Kayama","starring":"Tatsuya Fujiwara Aki Maeda Taro Yamamoto Masanobu Ando Kou Shibasaki Chiaki Kuriyama Takeshi Kitano","running_time":"113 minutes[1] (Original release) 121 minutes[2] (Extended cut)","music_by":"Masamichi Amano","edited_by":"Hirohide Abe","budget":"US$4.5 million"}