{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","Critical reception and box office":"The film received generally negative reviews. As of September 28, 2011, Rotten Tomatoes reported that 25% of critics gave positive reviews based on 108 reviews.[4] Metacritic gave the film a 33/100 approval rating based on 26 reviews.[5] Slashfilm predicted that Bedtime Stories would open #1 during the December 25–28, 2008 Christmas weekend due to its family appeal and the box office draw of Adam Sandler,[6] but it came at #3 grossing $38 million behind Marley & Me and The Curious Case of Benjamin Button. However, during the standard 3-day weekend, it jumped ahead of The Curious Case of Benjamin Button ranking #2 behind Marley & Me with $27.5 million.[7] As of February 2009, the film had grossed $110,101,975 in the United States and Canada and $102,772,467 in other countries, totaling $212,874,442 worldwide.","Plot":"Skeeter Bronson (Adam Sandler) is a hotel handyman who was promised by his father, Marty Bronson (Jonathan Pryce), to be the manager of the family hotel. A mysophobe named Barry Nottingham (Richard Griffiths) agreed to keep that promise when the Bronson family sold their hotel to him—then built a new hotel instead. Thirty years later, when the story begins, Skeeter is the hotel's handyman while management is held by Kendall (Guy Pearce). Barry's new hotel, the Sunny Vista Nottingham Hotel, is a hit, but he's got plans to build an even more elaborate hotel, one designed around a theme that he's keeping secret.Skeeter's sister and principal of Webster Elementary School, Wendy (Courteney Cox), asks Skeeter to watch her kids, Bobbi (Laura Ann Kesling) and Patrick (Jonathan Morgan Heit), while she goes out of town. Skeeter does not know his niece and nephew very well, but agrees. Helping him during the day is Wendy's friend, Jill Hastings (Keri Russell), a teacher who works at the same school as Wendy. That night, putting Bobbi and Patrick to bed, Skeeter tells them a story, one inspired by his own life as an \"underappreciated\" handyman: a downtrodden squire \"Sir Fixalot\" rivals the pompous \"Sir Buttikiss\" in competition for a new job. The kids add their own details such as the king giving Sir Fixalot a chance to prove himself, a mermaid based on Jill, and a downpour of gumballs when Fixalot prevails.The following day, while fixing Barry's television, Skeeter learns that the new hotel's surprise theme will be rock and roll. He shocks Barry by telling him of the Hard Rock Hotel. Barry offers Skeeter a chance to compete with Kendall for a better theme. While driving, Skeeter is suddenly greeted with a shower of gumballs caused by a crashed candy delivery truck he doesn't see, so he concludes that the story had come true and quickly develops a plan.His next story, a Western in which he is given a horse named \"Ferrari\" by a Native American horse trader (Rob Schneider). The children have him save a damsel in distress and, deserving a reward kiss, gets kicked by a dwarf instead. That night, out in search of his Ferrari, he meets a man (also played by Rob Schneider), who steals his wallet. He rescues Barry's daughter, Violet Nottingham (Teresa Palmer), from the paparazzi, and, just as he is about to kiss her, he is kicked by a dwarf. At this point, with no Ferrari to be found, he determines that only the children's story changes come true.The following night's story is about a Greek gladiator, Skeeticus, who, after impressing the emperor and a stadium of onlookers, attracts the attention of the most beautiful maiden. After a meal in which all the girls who used to pick on him in high school were so impressed by the beautiful maiden he is with, they start randomly singing the \"Hokey Pokey.\" After Skeeticus saves a man's life, a rainstorm sends him and the maiden into a magical cave which has Abraham Lincoln in it. Skeeter loses his patience with the story and upsets the children, telling them that their stories have nothing to do with real life. Unable to get them to continue, the story ends.The next day, Skeeter learns Violet will not be meeting with him per the story design, but unexpectedly runs into Jill at the beach who invites him to lunch. Recognizing girls at the restaurant from his high school days, Skeeter asks Jill to pretend to be his girlfriend. The girls are plainly impressed and then inexplicably break into the \"Hokey Pokey.\" Walking on the beach with Jill, Skeeter casually saves the life of a man before a sudden rainstorm sends them under the dock. Skeeter realizes that the girl in the stories is Jill, not Violet, and that he is falling in love with her. As they are about to kiss, Skeeter remembers that Abe Lincoln is supposed to appear and moves away. Instead, an American penny (with Lincoln's face on it) falls from through the cracks of the dock, completing the story.For Skeeter and the kids' final night together, a space-themed story begins with Skeeter's character who battles Kendall's character in anti-gravity. Skeeter's character, who speaks in alien gibberish, wins and Skeeter quickly ends the story. Patrick interjects that the story is too predictable and—remembering Skeeter's argument against whimsically happy endings—pointless. Instead, Skeeter's character is incinerated by a fireball and there ends the story.Panicking, Skeeter sees/hears signs of fire everywhere. At Barry's luau-themed birthday party, while dodging many fiery hazards, Skeeter's tongue is stung by a bee, making him as hard to understand as his character was in the last of the stories. Luckily, Skeeter's best friend, Mickey (Russell Brand), can still understand him and offers to translate for him. Kendall's idea is for a hotel with a theme celebrating Broadway musicals—an idea that impresses no one. Barry much prefers Skeeter's approach—simply reminding them of how much fun children have when staying at a classy hotel. After winning the competition, Skeeter thinks he's found his happy ending. Instead, Kendall reveals to Skeeter that the new hotel is replacing Jill, Patrick and Bobbi's school, which is to be demolished the next day. Stunned at that, Skeeter then panics when he sees Barry's oversized birthday cake. Skeeter douses the candle and Barry with a fire extinguisher. Barry immediately tells Skeeter that he's fired.Afterwards, Jill, Patrick, and Bobbi discover that the school where they all work and attend is to be knocked down to make way for the new hotel, and they are all upset with Skeeter, refusing to believe that he didn't know about the location. Wendy believes him, but is upset because he taught her children not to believe in happy endings. She confesses that she had always been jealous of his and their father's ability to believe in made up stories and have fun the way she never did and had secretly hoped that, by leaving her children with him, his fun loving nature would rub off on them. When they attend the demolition to protest, Skeeter is inspired to prevent the school from being demolished—Donna Hynde (Aisha Tyler), one of the girls from his high school days, is a zoning commissioner, and helps find Barry Nottingham an alternative location on the beach in Santa Monica. Skeeter takes Jill on a wild motorcycle ride (during which Skeeter steals back his wallet from the thief (Rob Schneider) who stole it) which ends at the school and manages to stop the countdown of the demolition. As a reward, Skeeter asks Jill for a kiss and she gladly complies.Sometime later, Skeeter opens Marty's Motel (named after his late father) while Kendall and his scheming partner, Aspen (Lucy Lawless), are demoted to Skeeter's motel wait staff. In the film's conclusion, Marty Bronson narrates that Barry Nottingham overcame his fear of germs to the degree that he left the hotel business to become a school nurse at Webster Elementary School. His daughter, Violet Nottingham, became the new owner of her father's hotel business and married Mickey, while Skeeter and Jill got married as well and live happily ever after.","language":"English","box_office":"$212.9 million[1]","cinematography":"Michael Barrett","production_company":"Walt Disney Pictures Happy Madison Productions Gunn Films Offspring Entertainment Conman & Izzy Productions","directed_by":"Adam Shankman","Home media release":"The film was released on Blu-ray Disc and DVD on April 7, 2009. The DVD was released as a single disc or a two-disc edition including behind-the-scenes featurette. Commercials advertising the discs feature background music recycled from the film Back to the Future Part III. As of November 1, 2009 the DVD has sold 2,835,662 copies generating $49,409,944 in sales revenue.[8]","narrated_by":"Jonathan Pryce","Theatrical release":"The film was released in the United States on December 25, 2008, in Poland on January 23, 2009 and in Sweden on February 20, 2009.","Music":"The score to Bedtime Stories was composed by Rupert Gregson-Williams, who recorded his score with the Hollywood Studio Symphony at the Newman Scoring Stage at 20th Century Fox.[3] The Journey song \"Don't Stop Believin'\" is played during the film and during the end credits.","release_dates":"December 25, 2008 (2008-12-25)|||||","Production":"Director Adam Shankman describes Adam Sandler's character as \"a sort of 'Cinderfella' character\" and adds that \"'He's like Han Solo ...'\"[2]","produced_by":"Adam Sandler Andrew Gunn Jack Giarraputo","starring":"Adam Sandler Keri Russell Guy Pearce Russell Brand Richard Griffiths Jonathan Pryce Courteney Cox Lucy Lawless Teresa Palmer","running_time":"99 minutes","bedtime_stories":"Theatrical release poster","music_by":"Rupert Gregson-Williams","edited_by":"Tom Costain","written_by":"Matt Lopez Tim Herlihy","budget":"$80 million"}