{"country":"Argentina Netherlands","Background":"The film is based on the aftermath of the real political events that took place in Argentina after Jorge Rafael Videla's reactionary military junta assumed power on March 24, 1976. During the junta's rule: the parliament was suspended, unions, political parties and provincial governments were banned, and in what became known as the Dirty War between 9,000 and 30,000 people deemed left-wing \"subversives\" disappeared from society.[2]","Plot":"Opening Title Graphic: As the film begins a message appears and reminds the audience that approximately 30,000 people died during the Dirty War due to the military dictatorship's reign during the late 1970s and early 1980s.The story is then dedicated to the surviving children of the murdered. Two such children, now adults are the main characters. One, Daniela (Vera Fogwill), now has her degree in film and is having trouble finding work. She's hired by an older couple, living in recluse, to film Buenos Aires for them. She goes out and documents the city. Yet, her customers are upset as they don't remember the Buenos Aires Daniela has filmed. She then shoots a reel of tourist-type shots. The other, Damián, played by Nicolás Pauls, works in a low-rent motel who discovers the real story about his parents during the dictatorship.The story is largely episodic, mashing together more than 6 different story lines.","language":"Spanish","Critical reception":"Film critic Karen Jaehne praised the film, and wrote, \"The film tells you enough about each character to raise your sympathy and not enough to let us see any possible resolution of the dilemma of loneliness. It's an intelligent film that observes mannerisms and social behavior in a way that makes you nod and say, yes, that's how it is...It builds toward a very powerful ending that reminds us of all urban disaster, but the problem that has made Buenos Aires a metropolitan orphanage is undeniable. Buenos Aires - Vice Versa is a wise film - worth watching and will undoubtedly make it to a festival near you.\"[4]","cinematography":"Ramiro Civita","directed_by":"Alejandro Agresti","Awards":"WinsNominations","release_dates":"November 1996 (1996-11) (Mar del Plata Film Festival)|||||","Distribution":"The film was first presented at the Mar del Plata Film Festival in November 1996. It opened wide in Argentina on September 18, 1997.The film was screened at various film festivals, including: the 1996 Cannes Film Festival,[3] France; the Contemporary Latin American Film Series at UCLA, Los Angeles; the Oslo Film Festival, Norway; the Havana Film Festival, Cuba; and others.","buenos_aires_vice_versa":"Theatrical release poster","produced_by":"Alejandro Agresti Axel Harding","starring":"Vera Fogwill Nicolás Pauls Fernán Mirás","running_time":"122 minutes","music_by":"Alejandro Agresti Paul M. van Brugge","edited_by":"Alejandro Agresti Alejandro Brodersohn","written_by":"Alejandro Agresti"}