{"based_on":"2 States  by Chetan Bhagat","country":"India","distributed_by":"UTV Motion Pictures","screenplay_by":"Abhishek Varman|Hussain Dalal (dialogue)|","story_by":"Chetan Bhagat","Plot":"Krish Malhotra (Arjun Kapoor), a student from Delhi, is pursuing his MBA at the IIM Ahmedabad. Krish comes from a family very proud of their Punjabi heritage. He meets Ananya Swaminathan (Alia Bhatt) in his college who comes from a conservative Tamil Brahmin family. Krish and Ananya become friends and start studying together. Soon they begin dating, and stay together for their two years on the IIM campus. Krish confides in Ananya that his real passion is writing, which he wants to pursue a career in.When they complete their graduation, Krish and Ananya decide to get married. They introduce their parents to each other at the convocation ceremony. To their dismay, Krish's loud Punjabi mother Kavita (Amrita Singh) does not get along with Ananya's reserved Tamilian parents Radha (Revathy) and Swaminathan (Shiv Kumar Subramaniam). After graduation, Ananya begins her marketing job in her hometown Chennai and Krish goes back to his own hometown Delhi. Krish's brash family urges him to stay in Delhi and try to discourage him from his interest in writing. They also criticize his relationship with Ananya, and tell him to get an arranged marriage with a Punjabi girl. It is also evident that there is tension between Krish and his alcoholic father Vikram (Ronit Roy).Krish leaves his dysfunctional family and starts a banking job in Chennai. During this time, he tries very hard to win over Ananya's family. He tutors her younger brother, gets her mother an opportunity to sing at an event for his workplace, and helps her father create his first PowerPoint presentation. After all his effort, Ananya's family agrees to the marriage with Krish. Krish and Ananya then travel to Delhi to win over Krish's family. Initially, Kavita and her family are hostile towards Ananya but come to like her after she saves Krish's cousin's wedding from being cancelled due to a dispute over dowry.Krish and Ananya decide to take a vacation with their families before the wedding. The vacation does not go as planned when Kavita makes continuous snide remarks about Tamilian culture. Furthermore, Ananya and her parents overhear Krish falsely assuring his mother that she can treat Ananya however she wants after they are married. Having had enough of the insults, Ananya calls off the wedding and both return to their respective hometowns.Krish and Ananya find it hard to live without each other. Sometime later, he gets a call from Ananya, who reveals that Krish's father had come down to Chennai to speak to her parents, apologizing for his wife's shallow behavior. This allows for Krish and Ananya to finally get happily married, they become parents to twin boys and Krish publishes his book 2 States based on his and Ananya's life.","language":"Hindi","box_office":"₹1.50 billion (US$22 million)[2]","cinematography":"Binod Pradhan","production_company":"Dharma Productions Nadiadwala Grandson Entertainment","directed_by":"Abhishek Varman","Soundtrack":"The soundtrack is composed by Shankar-Ehsaan-Loy, while the lyrics are penned by Amitabh Bhattacharya. The first song, Offo, sung by Aditi Singh Sharma and Amitabh Bhattacharya, released on March 7, 2014. The second song, Locha-E-Ulfat, sung by Benny Dayal, released on March 13, 2014. The soundtrack of the film released on March 14, 2014.[20] The medley song \"Isaiyin Alai\" at the Concert was sung by Mahalaxmi Iyer. Shankar-Ehsaan-Loy won the filmfare and iifa awards 2015 for this film.","2_states":"Theatrical release poster","release_dates":"18 April 2014 (2014-04-18)|||||","Production":"The first choice for the lead pair in the film had been Saif Ali Khan and Priyanka Chopra and the film was to be directed by Siddharth Anand.[10] Later, it was announced that Shah Rukh Khan and Asin Thottumkal would play lead roles and the film was to be directed by Vishal Bhardwaj.[11] The role of Krish Malhotra was also offered to Imran Khan who instead chose to work on Matru Ki Bijlee Ka Mandola.[12] Finally, Arjun Kapoor was cast as the lead.[13] Actress Alia Bhatt was paired opposite him. Amrita Singh and Ronit Roy were cast as Arjun Kapoor's parents and Revathy and Shiv Kumar Subramaniam were cast as Alia Bhatt's parents.Principal photography commenced on 29 January 2013 with the shooting of a song.[14] Parts of the film were shot at Chennai, Delhi, IIM-A and Gol Limda Bhajiya House near Astodia Darwaza, Ahmedabad Railway Station to Police commissioner office in Ahmedabad in August 2013.[15][16] Alia would be sporting an Indian Fusion look in the film and her costumes have been designed by Manish Malhotra.[17] Speaking about her character, Alia said that she is a City Girl who speaks Tamil only with her parents.[18] It was given an U/A certificate.The song \"Offo\" was choreographed and conceptualized by Remo D'Souza as a celebration of several Indian festivals in a time lapse of almost one year. It was shot over four days at IIM Ahmedabad campus and Filmistan Studio in Mumbai.[19]","produced_by":"Karan Johar|Sajid Nadiadwala|","starring":"Arjun Kapoor|Alia Bhatt|Ronit Roy|Amrita Singh|Revathi|Shiv Kumar Subramaniam|","running_time":"149 minutes[1]","music_by":"Shankar-Ehsaan-Loy","edited_by":"Namrata Rao","Release":"According to Box Office India, 2 States had \"excellent\" first day figures of ₹120 million (US$1.8 million).[21][22] The collections for second day were around ₹117.5 million (US$1.7 million) taking its two-day total to ₹237.5 million (US$3.5 million), receiving a \"fantastic\" response in circuits like Mumbai, Mysore, Delhi-UP, CP Berar, CI, Nizam and Rajasthan.[22][23] The film was declared a \"Super Hit\" by Box Office India in light of its first two days' performance.[22] With a very good run in multiplexes and single screens alike, it managed a three-day nett of ₹370 million (US$5.5 million).[24] 2 States had a final domestic nett of ₹1.01 billion (US$15 million).[25]According to Box Office India, 2 States grossed US$5.85 million internationally, and was the second highest overseas grosser of 2014 in Bollywood after Jai Ho at that point.[26][27]Taran Adarsh of Bollywood Hungama awarded the film 4.5 out of 5 stars, and noted, \"On the whole, 2 States is one of the finest movies to come out of the Hindi film industry of late. This is one of those rare Hindi movies that commands a repeat viewing. Strongly recommended!\"[28] Critic Saurabh Dwiwedi, writing for India Today, gave the film 4 out of 5 stars, and published, \"2 States can be a good mirror for parents to understand their children. So take along your parents and enjoy the film.\"[29] Meena Iyer of The Times of India gave the film 3.5 out of 5 stars, and wrote, \"What makes 2 States work is the simple narrative told humorously. Adapted as it is, from one of author Chetan Bhagat's best-selling works, the film, just like the book before it, is light-hearted. Chetan's funny one-liners and life-view are studiously borrowed by the director for his screen outing. And though there is a sense of deja-vu, for those who have read the book, the movie still manages to charm and surprise.\"[30] Paloma Sharma of Rediff.com gave the movie 3.5/5 stars and opined, \"There's nothing that should keep you from watching 2 States\".[31] Mohar Basu of Koimoi gave the film 3 out of 5 stars, and wrote, \"2 States is barely unwatchable but misses the magic of Chetan Bhagat’s novel. As a stand alone, it is endearingly done with Alia and Arjun’s scorching chemistry coming off as adorable. The Bhagat fan in me is disappointed but the cinegoer isn’t.\"[32] DNA posted, the first half of the film is light and breezy and the second dramatic and emotional, perhaps a better balance would have helped the post interval portion which seems heavy.[33]Hindustan Times' Anupama Chopra gave the film 2.5 stars out of 5, and said, \"In 2 States, the story is the weakest link. The film is bolstered by talented actors, gorgeous songs by Shankar-Ehsaan-Loy, nice styling, sumptuous production design and a few sparkling moments. But in the second half, 2 States falls apart. At almost two-and-a-half hours, it’s also stretched so thin that by the time Krish and Ananya walk into the sunset, you are long past caring\". Concerning Kapoor and Bhatt, she said, \"Arjun, departing from his earlier violent roles, makes a nicely goofy and later subdued lover boy, but it’s Alia who lights up the screen.\"[34] Saibal Chatterjee of NDTV gave the film 2.5 out of 5 stars, and wrote, \"2 States is a cross-culture love story that strives to be sweet, funny and emotionally wrenching all at once. It is occasionally funny and sweet in parts all right, but the family drama at the film’s core has a severely stultified feel. The trouble is that the impending wedding remains impending far too long to sustain interest... it sets out to be a slice-of-life drama about a real couple grappling with the politics of inter-community marriage, but it fails to generate enough energy and warmth to draw the audience into a tight clinch\".[35] Shubra Gupta of The Indian Express gave the film 2.5 out of 5 stars, and said, \"2 States... sets out to be a solid, emotionally satisfying rom com, and goes well for a bit but then turns into a too-stretched-out ‘jhagda’ between the two sets of North-South parents. The smooth, engaging first half descends, post-interval, into mopey melodrama, and I got impatient waiting for the inevitable resolution.\" She praised Bhatt's performance, saying, \"...Alia Bhatt is a surprise. She leaves behind her earlier films, and gets into her character: she may not be an authentic ‘Southie’ in terms of body language, but she is all girl, easy and fresh and natural\".[36]","budget":"₹350 million (US$5.2 million)[citation needed]"}