{"country":"United States","distributed_by":"The Samuel Goldwyn Company","Plot":"The story begins with a narration by Alejandro Lopez as he retells the events of his father's life, Juan Lopez (Paul Rodriguez), and how by selling oranges he changed their lives.Juan was born on a strawberry field in Bakersfield, California, but due to hardship, his mother decided to relocate to Mexico. Now Juan is an undocumented citizen, due to no proof of US citizenship, of Los Angeles, struggling not only to get a green card, but to solely care for Alejandro, after his wife's death.Yet, he has no documentation to attest to his U.S. citizenship and lives as an undocumented worker in Los Angeles selling oranges near the freeway. He lives with two roommates and tries to make ends meet so he can take care of his little son. He is stressed as he battles landlords and immigration.A stranger (Edward James Olmos) in a fancy limousine hands over $1,000,000 dollar check to Juan, but under the condition that he must give back all the money in one month.Juan is suspicious and takes the check to his immigration worker (Polly Draper) who encourages him to follow the directions given him.At first he uses the check to get credit extended at posh clothing stores, a car dealership, and more. He also meets a woman in a dead-end relationship with a bossy businessman.Then the fun begins for good-natured Juan Lopez, who has to avoid temptations and the greedy people that suddenly pop-up in his life.Juan comes to realize that the true meaning of life is love, family, and happiness, and that money isn't the answer.","a_million_to_juan":"VHS Artwork","language":"English","Reception":"The staff at Variety magazine gave the film a mixed review, writing, \"The odds of A Million to Juan breaking out of its inherent niche-market appeal can be summed up in its title. This gentle rags-to-riches tale set in the Los Angeles barrio is a good-natured parable that, unfortunately, doesn't pack much commercial punch. Its positive intentions aren't enough to cross over into the mainstream...While Rodriguez adheres to the movie dictum of happy endings, his mix of message/mirth is too soft and mushy to reach a contemporary crowd.\"[1]Film critic Marc Savlov also gave the film a mixed review, writing, \"...comedian Paul Rodriguez has taken a laudable step in the right direction with his directorial debut. Unfortunately, it's no masterpiece...Rodriguez's comic sensibilities are usually razor-keen, but here, blunted by a cliché-riddled storyline and scattershot direction, they seem nonexistent.[2]The film opened on May 15, 1994 in the United States on a limited release.After one week the film went to video. Box-office sales the only week in circulation were $381,457 in 181 theatres.[3] However, IMDb reports $1,221,832 in box-office receipts.","cinematography":"Bruce Douglas Johnson","production_company":"Prism Entertainment Corp.","directed_by":"Paul Rodriguez","Soundtrack":"A Latino-themed original soundtrack was released on June 14, 1994 on the RMM Records & Video label, an independent Latin music record company based in New York City. The CD contained fourteen tracks. Performers include: Celia Cruz, Marc Anthony, Aramis Camilo, Marcos Loya, Carla De Leon, John Pena, and others.","release_dates":"May 15, 1994 (1994-05-15) (United States)|||||","produced_by":"Executive Producer: Mark Amin Gary Binkow Producers: Barry L. Collier Steven Paul","starring":"Paul Rodriguez Tony Plana Cheech Marin","running_time":"98 minutes","music_by":"Jeffrey Johnson Steven Jae Johnson","edited_by":"Michael Ripps Jack Tucker","written_by":"Screenplay: Robert Grasmere Francisca Matos Story: Mark Twain"}