{"country":"United Kingdom","distributed_by":"Rank Organisation (UK) World-Northal Corporation (USA)","Legacy":"The film's title was used by musician Jim O'Rourke for his album Bad Timing, the first in a trilogy of albums which O'Rourke named after films Nicolas Roeg had made during the nineteen-eighties – the other two being Eureka (taken from Eureka) and Insignificance (taken from Insignificance).[7] The film was also a partial inspiration for The Glove's 1983 album Blue Sunshine, a side project of The Cure's Robert Smith and Siouxsie & the Banshees' Steve Severin. Also, according to Smith, the song \"Piggy in the Mirror\" from The Cure's 1984 album The Top was also inspired by the film.On 20 September 2005 the film was released on special edition DVD by The Criterion Collection, becoming an addition to its continuing series \"dedicated to gathering the greatest films from around the world and publishing them in editions of the highest technical quality\".[8][9] While it has also become available through Criterion for digital purchase and rental on iTunes,[10] It was released on Blu-ray Disc by Network in January 2015. It is one of four films by Roeg to have received the honour.[11]","Plot":"In Cold War Vienna, Milena (Russell), a young American woman in her twenties, is rushed to the emergency room after apparently overdosing. With her is Alex Linden (Garfunkel), an American psychiatrist who lives in the city as a teacher. Through myriad fragmented flashbacks, the narrative depicts the story of their romance, which ultimately amounts to an unhealthy sexual obsession on the part of Alex. Through these developments, Milena is revealed to suffer from depression while still being married to a much older man (Elliott), whom she occasionally crosses the border to see during the course of her affair with Alex. Though Linden initially enjoys her free-spirited ways, he grows tired of, and embittered at, her lifestyle, which includes impulsive promiscuity and heavy drinking. Through spying on Milena, Alex becomes emotionally strained, and eventually tries to control her – leading to horrifying results, due in large part to very bad timing. Throughout, at the hospital where medics fight to save Milena's life, an investigator (Keitel) comes to realise that there may be more to her case than a simple suicide attempt. He probes, and once the truth lies brutally clear, tries to corner Alex into a confession of the possible crimes involved with Milena's accident.Finally it is revealed that,because of the rage developed due to the promiscuous sex behaviour of Milena.Alex raped her when she was unconscious.Later,Stefan arrives and reveals that Milena has survived and is out of danger. Alex returns to America where, some time later, he sees Milena getting out of a taxi. He shouts to her but she ignores him.","language":"English","cinematography":"Anthony B. Richmond","production_company":"Recorded Picture Company","directed_by":"Nicolas Roeg","release_dates":"12 September 1980 (1980-09-12) (TIFF)|22 September 1980 (1980-09-22) (NY)|25 October 1980 (1980-10-25) (USA)|||","Production":"The film was one of the series of movies greenlit by Tony Williams at the Rank Organisation, who were increasing their production output. Rank made eight films over two years, being mostly conservative choices such as the remake of The Thirty-Nine Steps. Bad Timing was the most unusual of the slate of films. Whilst Art Garfunkel was filming the film, his girlfriend committed suicide.","bad_timing":"Criterion Collection DVD art","produced_by":"Jeremy Thomas","starring":"Art Garfunkel Theresa Russell Harvey Keitel Denholm Elliott Daniel Massey","running_time":"122 Minutes (uncut restored version)","music_by":"Richard Hartley","edited_by":"Tony Lawson","Release":"Bad Timing premiered at the Toronto International Film Festival on 12 September 1980, and was screened in New York City on 22 September; the film was given a theatrical release in the United States on 25 October 1980.[3]The film received mixed reviews. Some found it brilliant; others, tasteless. Its UK distributor, Rank, were appalled by what they saw; one executive called it \"a sick film made by sick people for sick people\".[4] In response, they removed the Rank logo from all UK prints of the film. John Coleman in the New Statesman gave it a very bad review: \"[it has] an overall style which plays merry hell with chronology\".[5]On review aggregate Rotten Tomatoes, the film holds a score of 60% from a total of five critical submissions, with an average rating of 6.9 out of 10, indicating a \"fresh\" score on the site's Tomatometer.[6] The site's audience poll holds a score of 77% from a total of 3,823 ratings at an average of 3.7 out of 5, indicating that general audiences have \"liked it\".The film received the Toronto Film Festival's highest honour, the People's Choice Award, in 1980, as well as the London Film Critics Circle Award for Best Director.","written_by":"Yale Udoff"}