{"Cast":"The film's fellow calendar girls include Georgie Glen, Angela Curran, Rosalind March, Lesley Staples and Janet Howd as Kathy, May, Truday, Julia and Jenny respectively.[8] Calendar Girls also cast Graham Crowden as Jesse's husband Richard, Belinda Everett as Cora's daughter Maya, Marc Pickering as Jem Harper's friend Gaz and Harriet Thorpe as WI president Brenda Mooney.[8] Gillian Wright appears as Eddie Reynoldson's lover, while John Sharian plays an American commercial director named Danny. In addition actors and actresses Richard Braine, Ted Robbins, Arthur Kelly, Alison Pargeter, Angus Barnett, John Sparkes, Elizabeth Bennett, Christa Ackroyd, Matt Malloy, Patton Oswalt and John Fortune appear in short roles.[8]American television host Jay Leno appears as himself in the film during the ladies' visit to California;[8] they also encounter the American heavy metal band Anthrax while relaxing by the pool. Anne Reid was offered a major role in Calendar Girls, but choose to do Roger Michell's The Mother (2003) instead.[9]","country":"United Kingdom","distributed_by":"Buena Vista Pictures","calendar_girls":"Theatrical release poster","Plot":"When Annie Clarke's husband John dies from leukaemia at an early age, her close friend Chris Harper, anxious to purchase a comfortable sofa for the visitors' lounge in the hospital where he was treated, hits upon the idea of printing a calendar featuring some of the members of the Knapely branch of the Women's Institute discreetly posing nude while engaged in traditional WI activities, such as baking and knitting, in order to raise funds. Her proposal initially is met with great scepticism, but she eventually convinces ten women to participate in the project with her. They enlist one of the hospital workers, an amateur photographer named Lawrence, to help them with the concept.The head of the local Women's Institute branch refuses to sanction the calendar, and Chris and Annie go to a national congress of the Women's Institute in London to plead their case. They are told the final decision rests with the local leader, who grudgingly agrees to the calendar's sale. The initial printing quickly sells out, and before long the tiny village is bombarded with members of the international media anxious to report the feel-good story.The women are invited to appear on The Tonight Show with Jay Leno in Los Angeles. While there, tensions arise between Chris and Annie. All the publicity surrounding the calendar has taken a toll on their personal lives, and they lash out at each other in angry frustration. Annie accuses Chris of ignoring her husband and son and the demands of the family business in favour of her newfound celebrity, while Chris believes Annie welcomes the Mother Teresa-like status to which she's been elevated that allows her to cater to the ill and bereaved who have bombarded her with fan mail. All is resolved eventually, and the women return home to resume life as it was before they removed their clothing.","language":"English","Reception":"In his review in the New York Times, Elvis Mitchell called \"minty-cool\" Helen Mirren and \"deft\" Julie Walters \"a graceful pair of troupers\" and \"a sunny, amusing team\" and described the film as \"yet another professionally acted and staged wry-crisp comedy about British modesty ... that gets its laughs, but seems increasingly out of date ... When the biggest compliment you can pay a picture is that it is professional and not smug, there's a little something missing, like invention.\"[13]Roger Ebert of the Chicago Sun-Times said, \"It's the kind of sweet, good-humored comedy that used to star Margaret Rutherford, although Helen Mirren and Julie Walters, its daring top-liners, would have curled Dame Margaret's eyebrows ... That the movie works, and it does, is mostly because of the charm of Mirren and Walters, who show their characters having so much fun that it becomes infectious.\"[14]In the San Francisco Chronicle, Ruthe Stein said it is \"A charming movie ... [that] should appeal to fans of The Full Monty and Waking Ned Devine — and not just because they also featured nudity that made you smile instead of smirk. The films share a wonderfully British wry humor. They're not laugh-out-loud funny, but there's quite a bit to amuse you when thinking about the scenes later.\"[15]Manohla Dargis of the Los Angeles Times said the film \"is closer in texture and consistency to individually wrapped American cheese than good, tangy English Cheddar. But even humble plastic-wrapped cheese has its virtues and so does this film, which for its first hour hums along principally by virtue of many, many shots of the verdant Yorkshire Dales and the professional good graces of its cast. Chief among those graces are Helen Mirren and Julie Walters, two well-matched and criminally underused actresses who ... tend to make you regret the movie that could have been, even as they felicitously help pass the time ... Although they have little to do but grin and bare it, Mirren and Walters are delightful company.\"[16]In Entertainment Weekly, Lisa Schwarzbaum graded the film B+ and commented, \"[It] is the first export from the light-comedy-steamroller division of the British film industry that avoids, for the most part, the kind of queasy class condescension such hell-bent charmers have relied on since unemployed steel-mill workers shook their groove thangs in The Full Monty. Once again, British people do things that British people are not expected to do; the ladies are related to the coal miner's son who pirouetted in Billy Elliot and the tweedy widow who harvested dynamite weed in Saving Grace.\"[17]Variety critic Derek Elley said the film \"delivers very likable, if sometimes dramatically wobbly, results ... Though the film is never dull, and playing by the cast is spirited, it's actually a surprisingly gentle movie, with no big Full Monty-like finale to send auds buzzing into the street. The humor has a typically British, offhanded flavor, and the essentially simple story plays more as a multi-character rondo on a single idea. For every laugh-out-loud moment, or eccentric touch, there are equal moments of reflection and pause ... Despite an uncertain start in establishing a consistent comic tone, pic builds into an engaging, light character comedy, played somewhere between the Ealing tradition and contempo regional comedy. The challenge from the halfway point is to turn these mild English stereotypes into more substantial characters an audience will empathize with; it's a challenge only half met by scripters Towhidi and Firth.\"[18]In The Guardian, Peter Bradshaw rated the film three out of a possible five stars and added, \"This genial comedy, directed by Nigel Cole, with an excellent, tightly constructed script by Tim Firth and Juliette Towhidi, accentuates the positive. There's lots of wit and pluck and not much heartbreak,\"[19] and Mark Kermode of The Observer said, \"When the film succeeds, as it does magnificently in the first two-thirds, one can only marvel at the miracle of a world in which such plotlines could literally land on a producer's doorstep with the morning papers. When it fails, it is the film's acknowledgment of its own big-screen inevitability that is to blame. The result is half a great British screen comedy, twice as much as one usually expects from the genre nowadays ... Ultimately, however, this remains an immensely likeable and often impressive romp.\"[19]The BBC sit-com Jam & Jerusalem, which aired from 2006 to 2009, was developed by writers by Jennifer Saunders and Abigail Wilson with characters loosely based on those in the film. The series starts with the death of the husband of one of the main characters, at which point her best friend convinces her to join the Women's Guild.","Stage adaptation":"A stage play based on the film opened in 2008 as part of the Chichester Theatre Festival. It subsequently transferred to the West End.","box_office":"$96.5 million[1]","cinematography":"Ashley Rowe","production_company":"Touchstone Pictures","directed_by":"Nigel Cole","release_dates":"2 September 2003 (2003-09-02)|||||","Production":"Six of the eleven women who were pictured in the original calendar sold the rights to their stories. They were Angela Baker, Tricia Stewart, Beryl Bamforth, Lynda Logan, Christine Clancy and Ros Fawcett. In addition to the calendars, they also posed for a postcard known as \"Baker's Half Dozen.\"Filming took place in the summer of 2002. Whereas the actual Calendar Girls were members of the Rylstone Women's Institute, much of the film was shot in and around the village of Kettlewell in North Yorkshire, some ten miles away. Additional locations include Buckden, Burnsall, Coniston, Ilkley, Settle, Linton, Malham, Skipton, Westminster and Ealing in London, and the beach in Santa Monica. The penultimate shot of Chris and Annie walking down a street was filmed in Turville. Interiors were filmed in the Shepperton Studios.The pictures in the film-version calendar were taken by professional stills photographer Jaap Buitendijk.The film's soundtrack includes \"You Upset Me Baby\" performed by B.B. King, \"Sloop John B\" by the Beach Boys, \"The Way You Do the Things You Do\" by the Temptations, and \"Comin' Home Baby\" by Roland Kirk and Quincy Jones.The film premiered at the Locarno Film Festival. It was later shown at Filmfest Hamburg, the Dinard Festival of British Cinema in France, the Warsaw Film Festival, the Tokyo International Film Festival and the UK Film Festival in Hong Kong.The fundraising phenomenon of the Calendar Girls was inspired by the death of Angela Baker's husband John Richard Baker, an Assistant National Park Officer for the Yorkshire Dales National Park Authority, who died from non-Hodgkin's lymphoma at the age of 54 in 1998. During his illness Angela's friends began to raise money, initially with the aim of purchasing a sofa for the visitors' lounge in the hospital where John was treated. Nothing could have prepared them for the way their original calendar took off. To date they have raised over £3 million for Leukaemia & Lymphoma Research, the UK's leading blood cancer charity. [10] The photos for the 2000 Alternative WI Calendar, as it was named, were taken by Terry Logan, a former professional photographer who was married to one of the models. It was released on 12 April 1999 and became a runaway success, selling out in the first week. 10,000 additional copies were printed, all of which were sold within three weeks. Nine months after its launch, the calendar had sold 88,000 copies.[11] It then was adapted for an American version covering June 2000 - December 2001. The ladies were invited to appear with Jay Leno and Rosie O'Donnell on their respective talk shows. That year the calendar sold 202,000 copies.Proceeds from the 2000 calendar were used to fund lymphoma and leukaemia research in new laboratories at the University of Leeds. A plaque dedicated to John Baker reads, \"The work in this laboratory is dedicated to the memory of John Baker in recognition of the exceptional fundraising achievements of the 'Calendar Girls' of the Rylstone & District Women's Institute.\"[11]Since 2000, the Calendar Girls have produced calendars for 2004, 2005, 2007 and a recipe calendar for 2008 with their favourite Yorkshire recipes on the back of each month.Ten years on, the Calendar Girls launched a 2010 calendar with a new set of full colour images and the aim of raising £2 million for Leukaemia & Lymphoma Research.The Calendar Girls are still strong supporters of Leukaemia Research and have a range of merchandise in aid of the charity including calendars, greetings cards a range of three jams made by Brackenhill Fine Foods, York, and chocolates produced by Yorkshire chocolatier Whitaker's, twelve squares with the original calendar images on the wrappers. They are available online and in selected outlets.Of the project, Angela Baker has said, \"We are constantly amazed at the response we had, and still get, to our calendar. I cannot believe that we were able to raise so much money and I am delighted that it is being spent on such worthwhile research. I know that John would be tremendously honoured to know that we have achieved so much in his name.\"[11]","produced_by":"Nick Barton","starring":"Helen Mirren Julie Walters Linda Bassett Annette Crosbie Celia Imrie Penelope Wilton","running_time":"108 minutes","music_by":"Patrick Doyle","edited_by":"Michael Parker","written_by":"Tim Firth Juliette Towhidi","budget":"$10 million[1]"}