{"based_on":"Characters  by Helen Fielding","country":"United Kingdom|","distributed_by":"Universal Pictures Miramax","screenplay_by":"Helen Fielding Emma Thompson Dan Mazer","Plot":"After breaking up with Mark Darcy, Bridget Jones’s “happily ever after” hasn’t quite gone according to plan. Now in her forties and single again, she decides to focus on her career as a news producer and surround herself with her friends, old and new. For once, Bridget has everything under control. Then, her love life takes a turn and she meets a dashing American named Jack Qwant, the suitor who is everything that Mr. Darcy is not. In an unlikely twist, Bridget finds herself pregnant, but with one hitch: she can only be fifty percent sure of who the baby’s father is.","language":"English","bridget_jones's_baby":"Teaser poster","cinematography":"Andrew Dunn","directed_by":"Sharon Maguire","production_companies":"StudioCanal Working Title","release_dates":"16 September 2016 (2016-09-16)|||||","Production":"In July 2009, Variety announced that a third installation of the Bridget Jones films was in the early stages of development. Working Title Films confirmed that it would not be based on Helen Fielding's third Bridget Jones novel, but instead would be based on the columns she wrote for The Independent in 2005.[9][10] On 1 March 2011, it was reported that both Renée Zellweger and Colin Firth were interested in reprising their roles.[11] In July 2011, Paul Feig was in final talks to direct the film based on the script by author Fielding.[12] On 11 August 2011, Universal Studios and Working Title greenlit the third film.[13] On 4 October 2011, Deadline reported that Feig had exited the project due to creative differences with Working Title, and Feig had also worked on the recent draft of the script.[14][15] Production was slated to begin in January 2012 with the returning cast including Zellweger, Firth, and Hugh Grant.[14] On 30 November 2011, Peter Cattaneo came on board to direct the sequel, newly titled \"Bridget Jones's Baby\" from a script by Fielding, Feig, and David Nicholls.[16] Producers on board were Tim Bevan and Eric Fellner of Working Title, along with Jonathan Cavendish of Little Bird.[16] On 3 February 2012, The Hollywood Reporter confirmed that the production had been delayed due to creative differences between the script of the film and actors, especially Grant as he disliked the script and reportedly exited the project, though this was denied by producer Bevan.[15] However, the producer confirmed that they were working on the script and the film would be made as planned.[15]In April 2013, Firth spoke to the Chicago Sun-Times, stating \"unfortunately, it might be a bit of a long wait,\" and he said he \"wouldn't say that it's completely dead in the water, but the way it's going, you might be seeing Bridget Jones' granddaughter's story being told by the time we get there.\"[17] In an interview on 10 October 2014, Grant mentioned an existing script for a sequel, though he also expressed his dislike for it, and stated that he would not star in the third film.[18][19][20] Later in the next week, producers hired Emma Thompson to rewrite the original script written by Fielding and Nicholls.[21]On 25 June 2015, it was reported that final negotiations for the film were going on and Sharon Maguire, director of the first film would return to direct the third film.[19] Gemma Jones and Jim Broadbent were also in talks to return for the third film to join the cast.[19][22] On 9 September 2015, Patrick Dempsey joined the cast of the film.[2]Filming for a short period began in July 2015 in Dublin, where the first scenes for the film were shot at Ed Sheeran's concert at Croke Park.[23][24] Official principal photography with the actual cast began on 2 October 2015 in London.[2][25]On 13 October 2015, shooting was taking place at Borough Market.,[26] and later in October in Windsor Great Park, at Rosy Bottom.[27] On 26 October 2015, filming took place at a church in Oxfordshire.[28]Filming wrapped up on 27 November, 2015.[29]Reshoots started on 8 January. [1]","produced_by":"Tim Bevan Eric Fellner Debra Hayward","starring":"Renée Zellweger Colin Firth Patrick Dempsey Jim Broadbent Gemma Jones Emma Thompson","edited_by":"Melanie Ann Oliver","Release":"As of October 2015[update], Bridget Jones's Baby is set for a 16 September 2016 release.[30][31] On March 23 the first trailer was released. [2] Like the previous two, the movie received an R rating. [3]","budget":"$35 million[1]"}