{"Cast":"I was about 7 years old when I started reading comics called 'Amar Chitra Katha' that are published in India. They're not about a superhero, but they encompass all the stories of India, the folklore, the mythology, everything. But most of these stories are about Indian historical figures. I was fascinated by the forts, the battles, the kings, I not only used to read those stories but I kept telling those stories to my friends in my own way.","country":"India","distributed_by":"Arka Media Works UV Creations Sri Thenandal Films Dharma Productions AA Films Global United Media","story_by":"K. V. Vijayendra Prasad","language":"Telugu|Tamil|","box_office":"est.₹600 crore (US$89 million)[4]","cinematography":"K. K. Senthil Kumar","production_company":"Arka Media Works","directed_by":"S. S. Rajamouli","baahubali:_the_beginning":"Theatrical release poster","release_dates":"10 July 2015 (2015-07-10)|||||","Production":"Baahubali: The Beginning was produced in Tollywood, the center of Telugu language films in India, which is based out of Hyderabad. The film series is touted to be the most expensive in India till date.In February 2011, S. S. Rajamouli announced that he would star Prabhas in his upcoming movie.[24] In January 2013, he announced that the working title as Baahubali and the actual film production started at Rock Gardens in Kurnool on 6 July 2013. The waterfall scenes in the film were shot at Athirappilly Falls in Kerala, huge sets for the Mahishmati kingdom were constructed at Ramoji Film City in Hyderabad and the snow episodes in the film were shot in Bulgaria. The screen writer, K. V. Vijayendra Prasad who wrote stories for most of Rajamouli's films once again penned the story for Baahubali. The film boasts of one year pre production work where in 15,000 story board sketches for the film were created which is highest for any Indian Film till date. More than 90 percent of the film had visually enhanced shots and according to the producer, more than 600 VFX artists worked for the film from 18 facilities around the world led by Makuta VFX and Firefly in Hyderabad, Prasad Studios in Hyderabad and Chennai, Annapurna Studios in Hyderabad, Tau Films in Malaysia, and Dancing Digital Animation and Macrograph in South Korea. Makuta VFX which had prior experience of working with S.S.Rajamouli was chosen as principal visual effects studio. The cinematography of the movie was done by KK Senthil Kumar for 380 days using Arri Alexa XT camera with Master Prime lens marking Rajamouli's first film using digital camera. Most of the film was shot in ARRIRAW format in 4:3 aspect ratio while ARRIRAW 16.9 was used for slow motion shots at 120 fps. Open Gate format, which can utilise the full 3.4K sensor in the camera to produce frames larger than the standard ARRIRAW format was tapped in to get the maximum image quality in VFX shots.[25] For the first time in Indian movies, 4K movie print was rendered with an aspect ratio of 1:1.88 as compared to Cinemascope at 1:2.35 to get the best cinematic experience in screens that support the 4K projection claimed the Producer.[26] Sabu Cyril, production designer for the film created 10,000 different kinds of weaponry ranging from swords, helmets and armors required for the soldiers. To make the swords light weight Carbon-fibre was used instead of steel, the same material used in manufacture of Helicopter blades claimed the art director.[27] 3D printing technology was used to create the head of 100 foot Bhallala Deva's character in the movie and flexi foam was used to create amours to make them light weight and to have the look of leather.[28] V. Srinivas Mohan was chosen as visual effects supervisor and Kotagiri Venkateswara Rao was the Editor. PM Satheesh was the sound designer and Peter Hein was responsible for the action sequences. The costume designers were Rama Rajamouli and Prasanth Tripuraneni. The line producer was M. M. Srivalli.National Award Winner V. Srinivas Mohan was roped in as Visual effects supervisor for Baahubali. The film boasts of 90% CGI work which accounts for 2500 VFX shots. Makuta VFX which is based out of Hyderabad was chosen as principal visual effects studio and was responsible for more than 50% of the Computer-generated imagery in the film.[29][30] Majority of work done by Makuta involved in bringing the 1500 feet mystical water fall to life, creating enormous mountains and huge landscapes including the kingdom of Mahishmati, with its massive temples and courtyards.[31] Creating the mammoth water fall took nearly 2 years as Makuta has to deal with a lot of complexity in Fluid dynamics and Simulations. Each frame involving the water fall sequence was treated as creating a new set and employed a different set of methodology claims Makuta.[30]Firefly Creative Studio which is also based out of Hyderabad worked primarily on the Avalanche and the Epic War sequences which accounts for nearly 25mins in the film. It is also involved in creating under water VFX shots and in establishing backstories for Kalakeya characters. Tau Films from Malaysia was responsible for creating the bison entirely on CGI where as Prasad EFX from Hyderabad was responsible for some shots in pre and post battle episodes involving digital multiplication. It is also responsible for creating a 3D image of Kattapa and mapping his head on to duplicate actor in one of the scenes.[32]Srushti VFX from Hyderabad was involved in digitally creating some of the shots in war sequence along with Firefly studios.[33] Annapurna Studios from Hyderabad was chosen as Digital intermediate partner for the film which is responsible for generating the digital feed with the best color and audio for editing. For the first time in Indian Movies, Academy Color Encoding System workflows were implemented along with Infinitely Scalable Information Storage keeping in mind the mammoth scale of digitally enhanced shots in the film.[34] Arka Media Works, production company of Baahubali have teamed up with AMD to utilise the state of the art FirePro GPUs W9100 and W8100 during the post production of the film which are capable of rendering 4K content in real time and are considered the best in Industry till date.[35]Reacting to media reports on the same VFX team for Baahubali and Jurassic World, Producer Shobu Yarlagadda outrightly denied any such collaboration stating it as an Internet rumor.[36] In an Interview to quartz, the co-founder of Makuta VFX stated, \"Most of Baahubali was developed in Hyderabad ,home to Tollywood and used local talent. It was principally a homegrown feature produced by homegrown talent.\"[37]","running_time":"158 minutes[1] (Telugu)|159 minutes[2] (Tamil)|","Controversy":"The Tamil version of the film faced a controversy relating to a word used in the film. On 22 July 2015, activists of a dalit outfit-Puratchi Pulikal Iyakkam hurled petrol bombs outside 'Tamil, Jaya' multiplex in Madurai screening the Tamil version of the film. Dalit group Puratchi Pulikal Iyakkam protested against the movie featuring a line Pagadaikku Pirandhavan considered derogatory against a dalits as it is hateful word used by caste Hindus to address Arunthathiyar Dalit sub-caste. Dialogue Writer of Tamil version, Madhan Karky issued an apology for hurting sentiments of Dalits.[95]","Sequel":"The sequel, Baahubali: The Conclusion, is scheduled for a worldwide release on 14 April 2017 and will serve as the conclusion of the story.[96]","Release":"The film released on 10 July 2015 in 4,000 screens worldwide in Telugu, Tamil, Hindi and Malayalam languages. A record number of 1600 screens in Telugu, 1500 screens in Hindi, 350 in Tamil and 225 screens in Malayalam were booked for the release.[39][40] The film was released in USA a day earlier by BlueSky Cinemas in 135 screens.[41] A premier show was also held on 9 July at Prasads IMAX Hyderabad. The film's release in Kerala was hindered amidst a close down by a section of theatres over the piracy issue of Malayalm film Premam [42] and released only in few theatres. The Telugu version of the film was presented by K. Raghavendra Rao, Tamil version by K.E. Gnanavel Raja and UV Creations , Karan Johar presented the Hindi version and Global United Media presented the Malayalam theatrical version. International version of the film which is 20 mins shorter than the original one, done by Vincent Tabaillon was screened at Busan International Film Festival . Producers of the film have planned to release the film in China in over 5000 screens in November 2015 by E Stars Films.[43] Baahubali will be the biggest release in China for an Indian film, beating PK which was released on 22 May 2015.[44] The film is also set to release in Japan.Twin Co which is a leading distributor for international films in Japan has acquired the rights for screening of the film.[45] The producer Shobu Yarlagadda who struck the deal at Busan Asian Film Market also revealed his plans to release the movie in Latin America, Germany and European countries.[46] MVP Entertainment is set to release the movie in Thailand, Vietnam, Laos, Cambodia, Myanmar, and Timor-Leste countries.[47] Sun Distribution acquired the distribution rights of the movie in Latin American countries while Creative Century Entertainment got the rights for Taiwan. In Korea, the movie is scheduled to be released via Entermode Corp.[48] Arka International, which is the sales arm for International release has made arrangements to release the movie in Germany and 70 other territories.[49] The satellite rights of film's Telugu version was bought by MAA TV for ₹25 crore (US$3.7 million) which is highest for any Telugu film till date while the Hindi version was sold to Sony MAX for more than ₹20 crore (US$3.0 million).Marketing of the film started 2 years before the shoot by S. S. Rajamouli with the audition campaign in Facebook and YouTube. A number of short promotional Making-of videos were released on ArkaMediaworks YouTube channel and the team unveiled first look posters and videos featuring the film's lead stars on the occasions of their birthdays. The film used an augmented reality application to play the trailer on smart phones and tablets.[50] The crown used by the character of Baahubali in the film was exhibited at Comic Con, Hyderabad as a part of the film's promotion. A cosplay event was held in which chosen winners were given a chance to visit the sets of the film.[51] The film's unit also launched a WhatsApp messenger to give regular updates about the film to the subscribers.[52] On 22 July 2015, Guinness World Records approved the poster created during the audio launch of Baahubali in Kochi on 27 June 2015 as the world's largest poster.[53] The poster has an area of 4,793.65 m² (51,598.21 ft²) and it was achieved by Global United Media Company Pvt Ltd.[54] (This record has since been broken with a 5,969.61 m² poster for the film MSG-2 The Messenger.[55]) A special skit was performed by the Baahubali team for the event named Memu Saitham to help the victims affected by Cyclone Hudhud. After the film's release, an interactive quiz was conducted by marketing team on storygag allowing users to find out which Baahubali movie character they were. Producers are also has planning to create a film museum at Ramoji Film City in Hyderabad which will showcase the weapons, armours and costumes used by actors in the film which is first of its kind for any Indian movie till date. Museum is expected to be ready before or right after the release of Baahubali: The Conclusion.[36] The film's website hosts merchandise which includes apparels, accessories and film's collectibles.[56]It is also one of the films featured in BBC's documentary on 100 Years of Indian cinema directed by Sanjeev Bhaskar.[57]In early July 2014, the film first part's Karnataka and Ceded (Rayalaseema) region distribution rights were sold to a prominent distributor for ₹23 crore (US$3.4 million) out of which the Ceded region, which included Kadapa, Kurnool, Anantapur, Chittoor and Bellary areas, the rights alone fetched ₹14 crore (US$2.1 million)[58] At the same time, the film's Nizam region theatrical distribution rights were purchased by Dil Raju for an amount of ₹25 crore (US$3.7 million). only for the first part.[59] Though he did not confirm the price, Dil Raju said in an interview to Deccan Chronicle that he purchased the first part's Nizam region rights and added that he would acquire the rights of the second part also for this region.[60] BlueSky Cinemas, Inc. acquired the theatrical screening and distribution rights in United States and Canada.[61]","budget":"₹120 crore (US$18 million)[3]","screenplay_by":"S. S. Rajamouli","Plot":"In the ancient Kingdom of Mahishmati in India, Sivagami, the queen (Ramya Krishnan), emerges from a cave adjoining a big waterfall, carrying a baby. She kills the soldiers pursuing her and sacrifices herself to save the baby. Local villagers spot the queen carrying the baby while almost drowning in the river and rescue the infant. The queen drowns after pointing towards the mountain above the waterfall.  Sanga (Rohini) and  her husband name the infant Shiva and raise him as their own son.Shiva (Prabhas) grows up to be a well-built young man aspiring to hike the mountain and makes many unsuccessful attempts at it. He then finds a mask of a girl which falls from the waterfall. Driven to find out the identity of the girl, he climbs the mountain again and succeeds this time.On top of the waterfall, Shiva discovers that the mask belongs to Avanthika (Tamannaah), a rebellious warrior whose group has indulged in a guerilla warfare against king Bhallala Deva / Pallvalathevan (Rana Daggubati) of the Mahishmati Kingdom. The group intends to rescue their former queen Devasena (Anushka Shetty) who has been chained in the kingdom for the past 25 years. Avanthika is given the opportunity to rescue the queen.Avanthika falls in love with Shiva after she finds out that he has climbed the waterfall for her. Shiva pledges to help her in her mission and sneaks into Mahishmati to rescue Devasena. Shiva rescues her and flees along with her but is chased down by the king's Royal slave Kattappa (Sathyaraj), known for his great warrior abilities. After Shiva beheads Bhadra (Adivi Sesh), Bhallala Deva's son, Kattappa drops his weapons on realising that Shiva is Mahendra Baahubali, the son of late king Amarendra Baahubali.A flashback reveals Amarendra Bahubali's past. Amarendra's mother died while giving him birth, while his father had died much before that. Sivagami takes charge of running the kingdom with Kattapa's assistance until a new king is elected. Amarendra Bahubali and Bhallala Deva are brought up together, trained in all areas including arts, science, disguise, politics and warfare, but both of them have different approaches towards kingship. Amarendra Baahubali is liberal to everyone but Bhallala Deva is violent and achieves his goals with any means possible, even trying to kill Baahubali.When a war is forced upon Mahishmati by the Kalakeyas, Sivagami promises that the new king will be the one who beheads the Kalakeya king and orders that the war resources be distributed equally between the two cousins. Bijjala Deva (Nassar), Bhallala Deva's father, uses his cunningness to make sure Bhallala deva gets the maximum resources. When it seems that Mahishmati would end up being defeated, Amarendra inspires his soldiers to fight to the death and they end up crushing the enemy. Despite Bhallala Deva being the one to kill the Kalakeya king, Sivagami announces Amarendra Baahubali as the new emperor because of his nobility and leadership in the war.After the flashback, when asked about Amarendra's current whereabouts, a tearful Katappa reveals that the King is dead, and that Katappa himself is the one responsible for his death.","Critical reception":"Lisa Tsering based on The Hollywood Reporter wrote, \"The story has been told many times before — a child is born destined for greatness and as a man vanquishes the forces of evil — but in the confident hands of accomplished South Indian director S.S. Rajamouli the tale gets potent new life in Baahubali: The Beginning.\"[62] Allan Hunter, writing for Screen Daily noted that \"The broad brushstrokes storytelling and the director's over-fondness for slow-motion sequences are among the film's failings but this is still a rousing film, easily accessible epic. There's rarely a dull moment in Baahubali: The Beginning, part one of a gung-ho, crowd-pleasing Telugu-language epic that has been shattering box-office records throughout India.\"[63] Mike McCahill of The Guardian rated the film four stars out of five, praising the film, \"Rajamouli defers on the latter for now, but his skilful choreography of these elements shucks off any cynicism one might carry into Screen 1: wide-eyed and wondrous, his film could be a blockbuster reboot, or the first blockbuster ever made, a reinvigoration of archetypes that is always entertaining, and often thrilling, to behold.\"[64] Suprateek Chatterjee of The Huffington Post wrote, \"However, all said and done, Baahubali: The Beginning is a remarkable achievement. What Rajamouli has pulled off here, despite its flaws, is nothing short of a miracle, especially when you take into account India's notoriously risk-averse filmmaking environment and when the film ends on a tantalising cliffhanger (paving the way for Baahubali: The Conclusion, due to release next year), one can't help but applaud his singularly brave vision. As the cliché goes, a journey of a thousand miles must begin with a single step, but it doesn't really matter if that first step is shaky as long as it lands firmly and confidently.\"[65]Deepanjana Pal of Firstpost wrote, \"This battle is Rajamouli's tour de force. It's elaborate, well-choreographed and has some breathtaking moments. Prabhas and Dagubatti are both in their elements as the warriors who approach warfare in two distinctive styles. The outcome of the battle is no surprise, but there are enough clever tactics and twists to keep the audience hooked. The biggest surprise, however, lies in the film's final shot, which gives you a glimpse into the sequel that will come out next year. And it's good enough to make you wish 2016 was here already.\"[66] Saibal Chatterjee of NDTV India rated the film with three stars out of five and stated, \"The spectacular universe that the film conjures up is filled with magic, but the larger-than-life characters that populate its extraordinary expanse do not belong to any known mythic landscape. To that extent, Baahubali, driven by the titular superhero who pulls off mind-boggling feats both in love and in war, throws up many a surprise that isn't altogether meaningless.\"[67] Shubhra Gupta of The Indian Express praised the film: \"Right from its opening frames, 'Baahubali' holds out many promises: of adventure and romance, love and betrayal, valour and weakness. And it delivers magnificently on each of them. This is full-tilt ,fully-assured filmmaking of a very high order. 'Baahubali' is simply spectacular.\"[68] IN her review for The Hindu, Sangeetha Devi Dundoo wrote, \"The war formations that form a chunk of the latter portions of the film are the best we've seen in Indian cinema so far. These portions are spectacular and show the technical finesse of the cinematographer (K.K. Senthil Kumar) and the visual effects teams. The waterfall, the mystical forests and water bodies above the cliffs and the lead pair escaping an avalanche all add to the spectacle. Give into its magic, without drawing comparisons to Hollywood flicks.\"[69]Sukanya Varma of Rediff gave the film four out of five stars, calling it 'mega, ingenious and envelope pushing!'.[70] Critic Archita Kashyap based at Koimoi also gave the same ratings, \"Be it the war sequences, or sword fighting; or a visual spectacle, or pure entertainment it is worth a watch. Kudos to the dedication of S S Rajamouli and his leading men, Prabhas & Rana, for spending years putting this film together. Actually, in its imagination & Indianness, Baahubali might just be a whole new start.\"[71] Rachit Gupta of Filmfare gave the film four stars (out of 5) and summarised, \"Baahubali is truly an epic experience. Had the story not been so jaded, this would've gone into the history books as an all-time classic. But that's not the case. It has its set of storytelling flaws, but even those are overshadowed by Rajamouli's ideas and execution. This is definitely worthy of being India's most expensive film. It's a definite movie watching experience.\"[72] Suparna Sharma of Deccan Chronicle praised the second half of the film, writing, \"Rajamouli has reserved all the grander and grandstanding for later, after interval. That's when the film stands up and begins to strut like an epic.\"[73] Suhani Singh of India Today pointed out that the film is best enjoyed keeping logic at bay. She added, \"SS Rajamouli and his team put up a fascinating wild, wild east adventure. It takes pluck to conceive a world like the one seen in Baahubali and to pull it off on a level which is on par with the international standards. The almost 45-minute long battle sequence at the end is not just one of the biggest climaxes, but also the action spectacle rarely seen in Indian cinema. And if Rajamouli can present another one like that in part 2, then he is on course to register his name in cinema's history books. We can't wait to revisit Mahishmati kingdom.\"[74] Critical reception penned by Shubha Shetty Saha for Mid Day rates the film with four stars out of film, exclaiming, \"While watching 'Baahubali', you might have to periodically pick up your jaw off the floor. Because this is not merely a movie, it is an unbelievably thrilling fantasy ride.\" The review extends praising the aspects, \"It is to the director's credit that every aspect of the film – action, mind-boggling set design and choreography – lives up to this epic film of gigantic scale. The choreography in the song that has Shiva disrobing Avantika to get her in touch with her feminine side, is an absolute gem.\"[75]","Music":"Rajamouli's cousin M. M. Keeravani composed the music for this film and the sound supervision is done by Kalyan Koduri.[38]","Box office":"Baahubali: The Beginning on the first day of its release collected ₹60 crore (US$8.9 million) worldwide which is the highest opening ever for an Indian film. The film collected ₹15 crore (US$2.2 million) alone from United States on its first day.[76] First weekend collections stood around around ₹162 crore (US$24 million) worldwide from all its versions, the third biggest ever for an Indian film.[77] The film grossed around ₹255 crore (US$38 million) worldwide in the first week of its release.[78] It became the first South Indian film to gross ₹300 crore (US$45 million) worldwide, reaching there in 9 days, and [79] subsequently grossed ₹401 crore (US$60 million) worldwide in 15 days.[80] And has successfully crossed ₹500 crore (US$74 million) mark in 24 days.[81] By the end of 50 days, the film grossed an approximate ₹595 crore worldwide, based on estimates from International Business Times.[82] Overall collections of the film stood at ₹600 crore (US$89 million) as of today.[when?] Baahubali: The Beginning grossed more than ₹500 crore (US$74 million) in India alone and became the highest grossing movie in India surpassing the gross of PK (2015) of ₹440 crore (US$65 million) from India.[83]Baahubali: The Beginning opened to 100 percent occupancy in Andhra Pradesh and Telangana and close to 70 percent occupancy in Tamil Nadu, Kerala and Karnataka. It grossed around ₹50 crore (US$7.4 million) on its first day of release in India from all four versions (Telugu, Tamil, Malayalam and Hindi).[84] The Hindi version earned around ₹5 crore (US$740,000) nett which was the highest opening for any film dubbed into Hindi.[85] The Hindi version grossed around ₹19.50 crore (US$2.9 million) nett in the first weekend.[86]The Telugu version alone earned around ₹65 crore (US$9.7 million) nett in first weekend in India. The film, from all its versions, earned almost ₹100 crore (US$15 million) nett in its first weekend. It had the fourth biggest opening weekend ever in India.[86] The Hindi version collected around ₹40 crore (US$5.9 million) nett in its first week.[87] Baahubali: The Beginning grossed more than ₹178 crore (US$26 million) nett from all its versions in India in the first week. It added a further ₹45 crore (US$6.7 million) nett in its second weekend to take its total to around ₹224 crore (US$33 million) nett in ten days.[88] The Hindi version grossed over ₹40 crore (US$5.9 million) nett in the Mumbai circuit.[89] Baahubali grossed over ₹118.7 crore (US$18 million) from the Hindi version.[90]The film collected around ₹20 crore (US$3.0 million) in its first day from the international markets.[91] The film opened on the ninth spot for its weekend, collecting around US$3.5 million with a per-screen average of $15,148.[92] The film debuted in the ninth position for the US and Canadian box office collecting $4,630,000 for three days and $3,250,000 for the weekend of 10–12 July 2015 [93] Baahubali: The Beginning grossed £66,659 from its Telugu version in United Kingdom and Ireland and A$194,405 from its Tamil version in Australia in till its second weekend (17 – 19 July 2015). The film also grossed MYR 663,869 in Malaysia from its Tamil version.[94]","produced_by":"Shobu Yarlagadda|Prasad Devineni|","starring":"Prabhas|Rana Daggubati|Anushka Shetty|Tamannaah|","music_by":"M. M. Keeravani","edited_by":"Kotagiri Venkateswara Rao Vincent Tabaillon (International Version)"}