{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Russ Duritz works as a successful but impolite image consultant and has a strained relationship with his father. One of his clients is a stadium manager who is reneging on a previous promise to fund a baseball camp for disadvantaged children. When Russ makes a pie throwing video to fabricate an explanation, his coworker Amy urges him to reconsider.When Russ returns home to find a toy plane on his porch, he assumes it is a gift from his father. However, inside he finds a strange boy, and chases him through the streets. After seeing the boy enter Skyway Diner, Russ runs in and finds no sign of him. Believing the experience to be a hallucination, Russ frantically sees a psychiatrist for medication the next day, but finds the same boy on his couch eating popcorn when he returns home. The boy says his name is Rusty, that he was just searching for his toy plane, but came across the popcorn. Starting to see a resemblance, Russ begins comparing memories and birthmarks with Rusty, and figures out that the boy is actually himself as a kid. After a series of probing questions about Russ's life, Rusty tells him, \"I grow up to be a loser.\"Amy finds out about the boy the next day and starts to think that Russ and Rusty are father and son. After she accuses Russ of being a dead-beat dad, Rusty assures her he is not Russ's son. Rusty implores Russ to tell Amy the truth about their identities, but Russ thinks she'd never believe them. Amy discovers the truth on her own while watching the two argue; Russ, and Rusty are nearly identical in style, and intensity.When Amy finds out that Russ lied about airing the stadium manager's tape, she gets mad at him and leaves disappointed.Russ cancels his appointments the following day, and spends the time walking with Rusty, and driving around the city trying to figure out why Rusty is there, and what from the past needs to be fixed to get Rusty back home. As they drive through a tunnel, Russ recalls a fight he lost with some neighborhood bullies who were abusing a three-legged dog named Tripod. They emerge from the tunnel to find themselves reliving Rusty's eighth birthday in 1968. Russ helps Rusty win the fight and save Tripod, but suddenly remembers that because of the fight, his sick mother also came to school for him that day. When they get home, Rusty's father angrily shakes and scolds him for getting into trouble and causing his mother more stress. Rusty cries, and his father tells him to grow up rubbing Rusty's tears away harshly, causing a lifelong facial tic. Russ tells Rusty that his mother will die before his next birthday, then comforts him. Tearfully, Russ tells Rusty that his father's outburst was because his dad was scared that he didn't know how to raise him alone, and also assures Rusty that he was not responsible for his mother's death.The two go to Skyway Diner, and celebrate their birthday. When a dog named Chester greets Rusty, they find out that his owner is an older version of Russ who owns planes, and has a family with a woman who clearly resembles Amy. Realizing that Rusty's appearance was meant to change his ways rather than the other way around, Russ returns to his time, arranges plans to see his dad, buys his assistant tickets to Hawaii, and, with a puppy, returns to Amy, who invites him into her home.","language":"English","box_office":"$110.3 million[2]","cinematography":"Peter Menzies Jr.","production_company":"Walt Disney Pictures","directed_by":"Jon Turteltaub","release_dates":"July 7, 2000 (2000-07-07)|||||","produced_by":"Hunt Lowry|Arnold Rifkin|Christina Steinberg|Jon Turteltaub|David Willis|","starring":"Bruce Willis|Spencer Breslin|Emily Mortimer|Lily Tomlin|Chi McBride|","running_time":"104 minutes[1]","music_by":"Marc Shaiman|Jason White|","the_kid":"Theatrical release poster","edited_by":"Peter Honess|David Rennie|","Release":"Disney's The Kid opened at #4 at the North American box office, making $12,687,726 USD in its opening weekend, behind The Patriot, The Perfect Storm, and Scary Movie. The film eventually ended its run by grossing $69,691,949 in North America and $40,625,631 elsewhere, thus bringing its worldwide total to $110,317,580. Based on a $65 million budget, Disney's The Kid was a financial success.[2]Upon its release, the film received mixed reviews from critics. Review aggregator website Rotten Tomatoes calculated a 49% overall approval rating based on 97 reviews, with the consensus being, \"Critics find The Kid to be too sweet and the movie's message to be annoyingly simplistic.\"[3] On Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the film has received an average score of 45, based on 32 reviews, which represents \"mixed or average reviews\".[4]Film critic Roger Ebert of the Chicago Sun-Times gave the movie 3 stars out of 4, observing that \"Disney's The Kid is warm-hearted and effective, a sweet little parable that involves a man and a boy who help each other become a better boy, and a better man. It's a sweet film, unexpectedly involving, and shows again that Willis, so easily identified with action movies, is gifted in the areas of comedy and pathos: This is a cornball plot, and he lends it credibility just by being in it.\"[5]The Kid was nominated for three awards, winning one.[6]","written_by":"Audrey Wells","budget":"$65 million[2]"}