{"country":"United States","Awards and nominations":"The film was nominated for the Golden Globe Award for Best Motion Picture - Musical or Comedy but lost to Hannah and Her Sisters.Sissy Spacek was nominated for the Academy Award for Best Actress, won the Golden Globe Award for Best Actress - Motion Picture Musical or Comedy, and was named Best Actress by the Kansas City Film Critics Circle and the New York Film Critics Circle.Tess Harper was nominated for the Academy Award for Best Supporting Actress, and Beth Henley was nominated for the Academy Award for Best Adapted Screenplay.","distributed_by":"De Laurentiis Entertainment Group","Plot":"The story focuses on the Magrath sisters—Lenny, Meg, and Babe—who reunite at the family home in Hazlehurst, Mississippi, after Babe shoots her abusive husband. The three were raised by Old Granddaddy after their mother hanged herself and the family cat and have been eccentric ever since. Lenny is a wallflower who bemoans her shriveled ovary. Egocentric Meg is a singer whose Hollywood career ended abruptly when she suffered a nervous breakdown. Unruly and impulsive Babe shocks her sisters with stories about her affair with a teenaged black boy. Past resentments bubble to the surface as the women are forced to deal with assorted relatives and previous relationships while coping with the latest incident that has disrupted their dysfunctional lives.","language":"English","Critical reception":"Crimes of the Heart received positive review among critics. Roger Ebert of the Chicago Sun-Times called the film \"that most delicate of undertakings: a comedy about serious matters. It exists somewhere between parody and melodrama, between the tragic and the goofy. There are moments when the movie doesn't seem to know where it's going, but for once that's a good thing because the uncertainty almost always ends with some kind of a delightful, weird surprise ... The underlying tone ... is a deep, abiding comic affection, a love for these characters who survive in the middle of a thicket of Southern Gothic clichés and archetypes.\" [3]Rita Kempley of the Washington Post described it as \"Hannah and Her Sisters with a southern accent, a lilting gingerbread gothic with Diane Keaton, Sissy Spacek and Jessica Lange ding-a-linging harmoniously as Dixieland belles\" and added, \"Playwright Beth Henley has no dire message for us, but her adaptation is nicely restructured, glib as all get-out and character-wise ... The powerhouse performances are directed by Bruce Beresford, who maintains balance among the actresses and keeps a lovely tone and smooth pace. As with his critically acclaimed Tender Mercies, the Australian director again looks at American types with a fresh eye.\" [4]","box_office":"$22,905,522","cinematography":"Dante Spinotti","directed_by":"Bruce Beresford","release_dates":"December 12, 1986 (1986-12-12)|||||","Production":"The film was shot in various North Carolina locations, including Caswell Beach, Southport, Wilmington, and Winnabow.The film opened on 246 screens in the US and earned $1,402,921 on its opening weekend. It eventually grossed $22,905,522 in the United States and Canada.[2]","produced_by":"Freddie Fields","starring":"Diane Keaton|Jessica Lange|Sissy Spacek|Sam Shepard|Tess Harper|David Carpenter|Hurd Hatfield|","running_time":"105 minutes","crimes_of_the_heart":"Theatrical release poster","music_by":"Georges Delerue","edited_by":"Anne Goursaud","written_by":"Beth Henley","budget":"$20 million[1]"}