{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","Possible sequel":"Scottish publication The Scotsman asked director Mark Andrews about the possibility of a sequel. Andrews said, \"I don't know if there will be another one. We never make a film at Pixar to have a sequel. It is always nice when you do and we kind of have a philosophy that if we find the right story then we will. Surely the marketing and success of Brave says that you can have one and they will come.\"[88]","screenplay_by":"Mark Andrews Steve Purcell Brenda Chapman Irene Mecchi","story_by":"Brenda Chapman","Plot":"In Medieval Scotland, Merida, a young princess of the clan Dunbroch, is given a bow and arrows by her father, King Fergus, for her birthday. Her mother, Queen Elinor, is dismayed. While venturing into the woods to fetch a stray arrow, Merida encounters a will-o'-the-wisp. Soon afterwards, Mor'du, a huge demon-bear, attacks the family. Merida flees on horseback with Elinor, while Fergus fights off Mor'du at the cost of his left leg.Ten years later, Merida, now a free-spirited young woman, discovers that she is to be betrothed to the son of one of her father's allies, much to her dismay. Reminding Merida of a legend of a prince whose pride and refusal to follow his father's wishes destroyed his kingdom, Elinor warns her that failure to consent to the betrothal could harm Dunbroch.The allied clan chieftains arrive with their first-born sons to compete in the Highland games for Merida's hand in marriage. Merida twists the rules, announcing that she is eligible to compete for her own hand as the first-born of Clan Dunbroch. She defeats each of her suitors in an archery contest, shaming the other clans and leading to an argument with Elinor. When Merida leaves, she follows the wisps to the hut of an elderly witch. Merida bargains with the witch, and receives an enchanted cake that will change her fate.When Merida gives the cake to Elinor, it causes Elinor to transform into a black bear. Merida returns to the witch's cottage with Elinor, who still retains most of her human personality. The witch has abandoned the cottage but left a message: unless Merida is able to \"mend the bond torn by pride\" before the second sunrise, the spell will become permanent. Merida and Elinor are led by the wisps to ancient ruins, where they encounter Mor'du. Merida discovers that he was the prince in the legend, transformed by a similar spell. Merida vows to her mother that she will not let her become a wild animal like Mor'du. She believes that she can reverse the spell by repairing a tapestry she damaged during their argument.The clans are on the verge of war. Having learned the importance of responsibility from her experience with her mother, Merida intends to declare herself ready to choose a suitor as tradition demands. However, with silent encouragement from Elinor, she instead insists that the first-born should be allowed to marry in their own time to whomever they choose. The clans agree, breaking tradition but renewing and strengthening their alliance. Merida sneaks into the tapestry room with Elinor. Elinor, who is losing her humanity, attacks Fergus, but suddenly regains her composure and flees the castle. Mistaking the queen for Mor'du, Fergus pursues the bear with the other clans. With the help of her younger triplet brothers, who have been transformed by the enchanted cake into bear cubs, Merida repairs the torn tapestry while riding after her father. The clans and Fergus capture Elinor, but Merida intervenes before Mor'du attacks. Mor'du scatters the clan warriors and targets Merida. Elinor intercedes, using her bear strength to hold off Mor'du until he is crushed by a falling menhir. This releases the spirit of the prince, who silently thanks Merida for freeing him. As the sun rises for the second time, Merida realizes the mistakes she has made and reconciles with Elinor, causing the queen and the triplets to turn back into humans.Later, Merida and Elinor work together on a new tapestry when they are called to the docks to bid farewell to the other clans.","language":"English","Reception":"Brave earned $237,283,207 in North America, and $301,700,000 in other countries, for a worldwide total of $538,983,207.[3] It was the 13th highest-grossing film of 2012,[48] the eighth highest-grossing Pixar film,[49] and the third highest-grossing animated film that year behind Ice Age: Continental Drift ($875.3 million) and Madagascar 3: Europe's Most Wanted ($746.9 million).In North America, pre-release tracking suggested the film would open between $55 million to $65 million in North America,[50][51] which is slightly below average for a Pixar film,[45] as trackers initially suggested that, as a \"princess story\", the film might not appeal as much to male audiences.[45]It opened on June 22, 2012, with $24.6 million and finished its opening weekend with $66.3 million (the same amount as Cars 2, Pixar's previous film), at the upper end of the numbers analysts predicted.[52] This was the seventh largest opening weekend in June,[53] and the sixth largest for a Pixar film.[54] Despite pre-release tracking indications, the audience was estimated to be 43% male and 57% female.[55] In North America, it is the ninth highest-grossing Pixar film,[49] the highest-grossing 2012 animated film,[56] and the eighth highest-grossing film of 2012.[57]Outside North America, the film earned $14 million from 10 markets on its opening weekend, finishing in third place behind Madagascar 3: Europe's Most Wanted and Snow White and the Huntsman.[58] Overall, its largest openings occurred in France and the Maghreb region ($6.5 million), Mexico ($5.53 million), and Russia and the CIS ($5.37 million). In total earnings, its highest-grossing countries were the U.K., Ireland and Malta ($34.9 million), France and the Maghreb region ($26.8 million), and Mexico ($21.6 million).[59]Brave received a 78% approval rating on the review aggregator website Rotten Tomatoes based on 228 reviews, with an average rating of 7/10. The site's critical consensus reads: \"Brave offers young audiences and fairy tale fans a rousing, funny fantasy adventure with a distaff twist and surprising depth.\"[60] Another review aggregator, Metacritic, which assigns a normalized rating out of 100 top reviews from mainstream critics, calculated a score of 69 based on 37 reviews, or \"generally favorable\".[61] The film was well-received among American audiences, earning an \"A\" CinemaScore.[55]Roger Ebert of the Chicago Sun-Times gave the film 3 out of 4 stars. He wrote, \"The good news is that the kids will probably love it, and the bad news is that parents will be disappointed if they're hoping for another Pixar groundbreaker. Unlike such brightly original films as Toy Story, Finding Nemo, WALL-E, and Up, this one finds Pixar poaching on traditional territory of Disney.\" He said that the film did have an uplifting message about improving communication between mothers and daughters, \"although transforming your mother into a bear is a rather extreme first step\".[62] Peter Debruge of Variety gave a positive review of the film, writing that the film \"offers a tougher, more self-reliant heroine for an era in which princes aren't so charming, set in a sumptuously detailed Scottish environment, where her spirit blazes bright as her fiery red hair\". Debruge said that \"adding a female director, Brenda Chapman, to its creative boys' club, the studio Pixar has fashioned a resonant tribute to mother-daughter relationships that packs a level of poignancy on par with such beloved male-bonding classics as Finding Nemo\".[63]Conversely, Todd McCarthy of The Hollywood Reporter gave it a negative review, stating that the film \"diminishes into a rather wee thing as it chugs along, with climactic drama that is both too conveniently wrapped up and hinges on magical elements that are somewhat confusing to boot\".[64] Leonard Maltin on IndieWire said, \"I'll give it points for originality, but that story twist is so bizarre that it knocked me for a loop. The movie tries to make up for this detour with a heart-tugging, emotional finale, but the buildup to that moment has been undermined, so it doesn’t have the impact it should.\"[65]Some reviewers saw the Merida character as a novel break from the traditional line of Disney princesses. There was some dissonance and criticism among viewers and organized feminists when her character was scheduled to be \"crowned\" a Disney princess, only for artists to render her thinner, with less frizzly hair, and rounder eyes, more like the other princesses from previous Disney movies. This inspired girl-empowerment website A Mighty Girl to file a petition that Disney not alter their character.[66][67] One of the 262,196 signatories was Brenda Chapman, the director of the film, who felt that Disney had \"betrayed the essence of what we were trying to do with Merida — give young girls and women a better, stronger role model\",[68] and that the makeover was \"a blatantly sexist marketing move based on money\".[69] The online petition was considered a success, as shortly after it appeared Disney removed the redesigned image from their official website, in favor of Merida's original film appearance.[70] Disney later clarified the situation, assuring that Merida would remain in her original form.[71][72]","box_office":"$539 million[3]","production_company":"Walt Disney Pictures Pixar Animation Studios","directed_by":"Mark Andrews Brenda Chapman","Video game":"A video game based on the film was published by Disney Interactive Studios on June 19, 2012,[84] for the PlayStation 3, Xbox 360, Wii, PC, and Nintendo DS.[85] A mobile video game, Temple Run: Brave (a Brave variation of Temple Run), was released on June 14, 2012, for iOS and Android,[86] and on June 7, 2013, for Windows Phone.[87]","release_dates":"June 10, 2012 (2012-06-10) (SIFF)|June 22, 2012 (2012-06-22) (United States)||||","Production":"Announced in April 2008 as The Bear and the Bow,[17] Brave is Pixar's first fairy tale.[18][19][20] Writer and director Brenda Chapman considers it a fairy tale in the tradition of Hans Christian Andersen and the Brothers Grimm.[21] She also drew inspiration from her relationship with her daughter.[22] Chapman conceived the project and was announced as the film's director, making her Pixar's first female director,[23] but in October 2010, she was replaced by Mark Andrews after creative disagreements.[24] Chapman found the news of her replacement \"devastating,\" but later stated that her \"vision came through in the film\" and that she remained \"very proud of the movie, and that I ultimately stood up for myself.\"[22][25] Brave is the first Pixar film starring a female protagonist.[4] Merida was originally to be voiced by Reese Witherspoon,[26] who declined due to scheduling issues. Instead, the character was voiced by Scottish actress Kelly Macdonald.[4]The end credits include a special tribute to Pixar co-founder and CEO Steve Jobs, who died in 2011.[27]The score for Brave was composed by Patrick Doyle and performed by the London Symphony Orchestra. The orchestra was conducted by James Shearman. To bring some of Scotland's native flavour to the music, Doyle used traditional Celtic instruments such as bagpipes, a solo fiddle, Celtic harps, flutes and the bodhrán, with an electronically treated dulcimer and cimbalom to give it a more contemporary feel. \"I employed many classic Scottish dance rhythms such as reels, jigs, and strathspeys, which not only serve the action but keep it authentic,\" said Doyle.[28] As part of his research he spent time in the Hebrides studying \"unaccompanied Gaelic psalm singing.\"[29]Doyle also composed several songs for the film. The lullaby duet between characters Princess Merida and Queen Elinor entitled \"A Mhaighdean Bhan Uasal (Noble Maiden Fair)\" appears on three occasions in different variations within the fabric of the score, and uniquely includes Gaelic vocals by Emma Thompson and Peigi Barker, the first Disney film with music featuring the language.[citation needed] The drinking song \"Song of Mor'du\" (lyrics by Doyle and Steve Purcell) sung by Billy Connolly, Scott Davies, Patrick Doyle, Gordon Neville, Alex Norton and Carey Wilson, features a rich variety of words, sung authentically, from the Scottish language, which is distinct from Scottish Gaelic.[citation needed]In addition to Doyle's music, the film features three other original songs; \"Learn Me Right\" written by Mumford & Sons and performed with Birdy, \"Touch the Sky\" (music by Alex Mandel, lyrics by Mark Andrews & Mandel) and \"Into the Open Air\" (music and lyrics by Alex Mandel). Both \"Touch the Sky\" and “Into the Open Air” were performed by Julie Fowlis. These two tracks were produced by composer and arranger Jim Sutherland, who is also featured as a performer.Along with introducing Doyle to a number of specialist Celtic musicians who feature in the score, Sutherland was responsible for discovering the young Gaelic singer Peigi Barker; the voice of Young Merida.Walt Disney Records released the soundtrack on both CD album and digital download on June 19, 2012.[30]Pixar created three original tartan patterns for the film for three of the four clans – DunBroch, Dingwall, and MacGuffin. (Clan Macintosh wears a red tartan similar to the nonfictional Clan Mackintosh.)The Walt Disney Company registered the Clan DunBroch tartan with the official Scottish Register of Tartans upon release of the film. The tartan consists of ocean blue for the North Sea, subdued scarlet for blood shed during the clan wars, deep green for the Scottish Highlands, navy blue for the eventual unity of the four clans, and grey for the Scottish people. In selecting the color scheme, Pixar took historical considerations, stating that \"[t]here was a concerted effort to use hues that were indicative of the less saturated dyeing techniques [used] during the ancient period in which the fantasy film is set.\"[31]The registration was celebrated at the film's British premier in Edinburgh, where Scottish First Minister Alex Salmond presented a certificate to director Mark Andrews. However, Member of the Scottish Parliament Alex Johnstone criticized the registration (as well as other fiction-based entries such as one for Peter Rabbit) as \"shallow and irreverent.\" Mr Johnstone contended that the 2008 legislation that created The Scottish Register of Tartans was intended to prevent such entries and protect Scotland's heritage.[32]The registration was not the first for Disney; the company also registered a tartan pattern for the Clan McDuck in 1942.[33]","produced_by":"Katherine Sarafian","starring":"Kelly Macdonald Billy Connolly Emma Thompson Julie Walters Robbie Coltrane Kevin McKidd Craig Ferguson","running_time":"93 minutes[1]","brave":"Theatrical release poster","music_by":"Patrick Doyle","edited_by":"Nicholas C. Smith","Release":"The film was initially set for release on June 15, 2012, but the date was later changed to June 22, 2012.[34] On April 3, 2012, Pixar screened the film's first 30 minutes, which received a positive reaction by its screeners.[35] The film premiered on the last day of the Seattle International Film Festival on June 10, 2012.[36] It had its Australian premiere on June 11, 2012, at the Sydney Film Festival,[37] its domestic premiere on June 18, 2012, at Hollywood's Dolby Theatre as part of the Los Angeles Film Festival,[38] its European premiere at the Taormina Film Festival in Sicily on June 23, 2012, and its British premiere at the Edinburgh International Film Festival on June 30, 2012, with Kelly Macdonald, Robbie Coltrane, Craig Ferguson, Brian Cox, Kevin McKidd, Ewen Bremner, Kate Dickie, Julie Fowlis, Patrick Doyle, Daniela Nardini and Alex Salmond in attendance.[39][40][41]In the United States and Canada, Brave is the first feature-length film to use the Dolby Atmos sound format.[42] Almost half of the 14 theaters set up to show the film in Atmos are in California (Burbank, Century City, Fremont, Hollywood, San Francisco, and Sherman Oaks), with the others located in seven other states (Lake Buena Vista, Florida; Kansas City, Missouri; Paramus, New Jersey; Las Vegas, Nevada; Chicago; West Plano, Texas; Vancouver, Washington) and Toronto, Ontario.[43] It was released in other theaters with Dolby Surround 7.1. In total, it was released in 4,164 theaters, a record-high for Pixar. The previous record was held by Cars 2 (4,115 theaters).[44] 2,790 of the theaters included 3D shows.[45]Brave was released on Blu-ray, Blu-ray 3D, DVD, and digital download on November 13, 2012. It includes La Luna and a new short film The Legend of Mor'du.[46] Exploring the history of Mor’du, the direct-to-video short will give fans the chance to delve deeper into the legend behind Mor'du, as told by the eccentric witch who transformed him.[47] The DVD contains commentary by director Mark Andrews, writer Steve Purcell, story supervisor Brian Larsen, and editor Nick Smith.","budget":"$185 million[2]"}