{"based_on":"Satyanweshi and Arthamanartham by Sharadindu Bandyopadhyay","detective_byomkesh_bakshy!":"Theatrical release poster","country":"India","Marketing and promotion":"Banerjee says he changed the 'i' at the end of the protagonist's surname Bakshi to 'y' for \"typographical balance\", stating that the 'i' felt \"too thin\" and that 'y' was a \"stronger alphabet\".[32]The teaser was released on 21 October 2014 attached to the film Happy New Year[33] and features the tagline, \"Expect the Unexpected\".[34] The teaser was released on Vine and marks the first film to do so.[35]The first motion poster of the film was released on 20 December, in Kolkata.[36] The official trailer of Detective Byomkesh Bakshy! released online on 21 January 2015. The production team made a special documentary to celebrate the birthday of Howrah Bridge and did a flash mob on the bridge to the song \"Calcutta Kiss\" on that day.[37]Detective Byomkesh Bakshy! team promoted the film in Mumbai College, where a fashion show is inspired by it.[38] A second trailer was released on 10 March 2015.[39][40] Sushant Singh Rajput promoted the film in India Poochega Sabse Shaana Kaun? and Comedy Nights with Kapil.[41][42] Rajput also promoted the film in the TV series C.I.D. on 30 March 2015, where he appeared as Byomkesh with Anand Tiwari as Ajit.[43]A mobile version game named Detective Byomkesh Bakshy!: The Game, has been launched by Games2win (G2W), which is currently available on the Google Play Store. It is a hidden objects game.[44]The game, launched with Yash Raj Films Licensing (YRFL), the licensing division of Yash Raj Films, is based on the film, which features Sushant Singh Rajput in the lead. On completing all the levels, a 'Detective Certificate' is awarded to the players, who can post it on social media.An apparel line titled NOIR 43 was launched at the Amazon India Fashion Week (AIFW), New Delhi, on 26 March. Since Detective Byomkesh Bakshy! is set against the backdrop of Kolkata during World War II in 1943, elements from the film have influenced the fashion line of contemporary clothing. The collection will be exclusively available on Amazon.in.[45]Before the film's release, Dibakar Banerjee expressed interest to make Byomkesh Bakshy as a franchise, if the first film does well.[39][46][47][48] After its release, Banerjee stated that he had the sequel ready and was hoping to start soon.[49][50] Banerjee said that Byomkesh's adventures will continue with the upcoming instalments of the series exploring his relationship with his sidekick Ajit, his love interest Satyawati and his nemesis.[51][52]","distributed_by":"Yash Raj Films","screenplay_by":"Dibakar Banerjee Urmi Juvekar","Plot":"In a contemporary interpretation of war-torn Calcutta during 1942, the story follows the first adventure of Byomkesh (Sushant Singh Rajput), fresh out of college, as he pits himself against a mastermind criminal.When Ajit Banerjee's genius chemist father disappears without a trace, he hires a young private detective Byomkesh Bakshi to find him. Bakshi uncovers clues that Banerjee might have been blackmailing veteran political leader Gajanan Sikdar. After Banerjee's corpse is found inside Sikdar's factory, the case seems closed until Sikdar is poisoned and killed as well. Ultimately, Bakshi stumbles onto a heroin smuggling ring run by a criminal mastermind known by several names and guises and who might be playing an extremely dangerous game that goes beyond the confines of mere crime and progresses to treason against the state.","language":"Hindi","Reception":"Detective Byomkesh Bakshy! received generally positive response from critics.[53][54]Hindustan Times Rohit Vats gave it four stars out of five and stated \"The action in the film starts taking place from a distance and the director slowly involves the audience into it. Pre-independence Calcutta serves as the backdrop in the opening scenes, but it soon turns into a character. The attention to detail is obvious in almost every frame.\"[55]Koimoi Surabhi Redkar, gave it four stars out of five and said: \"Detective Byomkesh Bakshy is a delicious thriller filled with elements that make you rack your brains too. This mystery is the one even you would want to solve. Watch it for an amazing story and its even better execution. Crime mysteries just got better in Bollywood! I am going for 4/5 here!\"[56]Mid-Day Surabhi Redkar, gave four stars and said: \"Don't miss it. Even if just to go back to the magical world of nostalgia created so beautifully and earnestly by Banerjee and cinematographer Nikos Andritsakis.\"[57] Kusumita Das from Deccan Chronicle rated the movie 3.5 stars out of five and noted \"The film follows the core structure of whodunit --- the chase, the red herrings, the slow cooked suspense leading up to a grand reveal. There's a generous spray of blood too, that underlines just how violent those times were.\"[58]Srijana Mitra Das of The Times of India reviewed and gave 3.5 stars out of five and wrote \"Byomkesh Bakshy is an iconic Bengali character brought to life by Sushant Singh Rajput with great elan – Sushant pulls off a role full of wry liveliness (a Sardarji cabbie nervously noting, 'Ye babu ka nut dheela hai,'), fitting the character, from flowery dhoti folds to furrowed-forehead frowns, beautifully. He's matched by dramatic Neeraj Kabi and calm Anand Tiwari who, after a Chinese gang leaves a courtyard strewn with corpses, tells caretaker Putiram (shakily precise Pradipto Kumar Chakrabarty), 'Khoon rehne de...bas chai bana de.\"[59]Indian Express, Shubhra Gupta gave it three stars out of five and mentioned \"When it switches to explicatory mode, it flattens. The tension, which is on a slow-burn, leaches out, and the film ends as less than it could have been. And that's a disappointment. But by then, you have seen a film, a real, bonafide film, not bits and pieces of nonsense masquerading as one.\"[60]IBN Live gave it three stars out of five and mentioned \"It's the snail-paced plotting, and the surprising lack of urgency and imminent danger that cripples the film. Story strands and characters are abandoned arbitrarily, only to be revisited later. The big reveal isn't too hard to guess – stick with your gut, don't let the red herrings distract you, and lo, you've figured it out. The climax too is a mess of hammy acting.\"[61] Deepanjana Pal of Firstpost gave it eight out of ten.[62]Revenue could hardly cross its budget on box office. On its first day Detective Byomkesh Bakshym! collected ₹4.2 crore (US$620,000) nett in India.[4] On its second and third day the film collected ₹4.5 crore (US$670,000) and ₹5.36 crore (US$800,000) respectively, and made a total weekend collection of ₹14.1 crore (US$2.1 million) in India.[5] As of 3 May, the film collected ₹27.05 crore (US$4.0 million) in India.[4]As of 12 April, the film collected ₹8.12 crore (US$1.2 million) from international markets.[3][4]","box_office":"₹36 crore (US$5.3 million)[3][4][5]","cinematography":"Nikos Andritsakis","production_company":"Yash Raj Films Dibakar Banerjee Productions","directed_by":"Dibakar Banerjee","Music":"Early in 2014, Banerjee and his production team set out to find artists whose music would fit into the story, shortlisting about 200 songs from non-Bollywood artists across the country. From the seven tracks on the OST, four tracks are remakes of previously written material – PCRC's \"Pariquel\" off their 2011 debut album Sinema, now has Hindi lyrics by frontman Suryakant Sawhney, BLEK's 2012 song \"Fog + Strobe\" includes thumri vocals by playback singer Usri Banerjee, Madboy/Mink's \"Taste Your Kiss\" includes verses in Hindi from vocalist Saba Azad and Joint Family's \"Life's A Bitch,\" stays true to its original 2007 version from their album Hot Box.Amongst the artists in the album, Sneha Khanwalkar is the only musician who had composed for a soundtrack before this.[29] The track used in the teaser, titled \"Life's a Bitch\", is composed by the New Delhi band Joint Family. The full song of \"Bach Ke Bakshy\" was published in a music video featuring Sushant, dancing in a parking lot, on 16 March 2015 in the official YRF YouTube channel.[30] The next day, YRF uploaded all the songs in an audio jukebox format.[31]","release_dates":"3 April 2015 (2015-04-03)[1]|||||","Production":"After Khosla Ka Ghosla, Dibakar Banerjee wanted to make this film and he approached Aamir Khan to play the villain. Eventually the deal was cancelled because Aamir chose Dhoom 3 over it.[15] Sushant Singh Rajput was roped in to play the role of Byomkesh Bakshi in mid-2013.[16] Earlier reports suggested that fashion designer Sabyasachi's assistant, Divya Menon, would be making her debut as an actress in this film as Rajput's character's wife.[8]Initially Rani Mukherjee was considered to play the female lead. However, Rani refused the role since the heroine's character had a few bold scenes.[17] The role was later offered to Bengali actress Swastika Mukherjee. On 6 November 2014, Banerjee stated that Mukherjee's role is sketched along the lines of Mata Hari.[10] In March 2014, reports suggested that Meiyang Chang would be seen in the film in an important role.[13] In May 2014, it was revealed that Neeraj Kabi is also part of the film.[12]Dibakar Banerjee expressed his desire to make a film on Byomkesh Bakshi so that India will get its own detective. On 28 June 2013, the co-production venture of YRF and Dibakar Banerjee Productions officially announces its first directorial outing with Banerjee titled Detective Byomkesh Bakshy![18] In July 2013, Banerjee revealed that YRF had bought the rights of \"31 of Byomkesh novels in all languages outside Bangla\".[19]Before shooting, workshops were held for the cast.[20] In an interview Rajput said, \"I have taken leave for two to three months for Detective Byomkesh Bakshy! after the release of Shuddh Desi Romance. A lot has to be done for the film like the look of the 1940s' hairstyle, body, accent, but all after this film\".[21] The costume was designed by the designer Manish Malhotra.[22]The sets were designed by Vandana Kataria and, accordingly, the set up will showcase the lifestyle of the people who were living during the turbulent times of World War II.[23] To give the look of 1943, the heritage zone of B. B. D. Bagh was transported back to the pre-Independence era with vintage cars and old trams back on the streets.[24] As reports suggest, a lot of VFX will be used to reflect old world charm.[23]Shooting for the film began in early 2014,[25] and ended on 12 May 2014.[26] A part of the movie has been shot in Kolkata and Mumbai. Some scenes were shot in an abandoned mill in Mumbai's Byculla region.[12] Shooting locations in Kolkata were finalised in February 2012.[27] Shooting took place in Lalbazar, Presidency University, Coffee House and Bow Barracks.[28] The cast was reportedly seen shooting for the film in Agarpara in January 2014.[24]","produced_by":"Aditya Chopra Dibakar Banerjee","starring":"Sushant Singh Rajput Anand Tiwari Swastika Mukherjee","running_time":"139 minutes[2]","music_by":"Various Artists","edited_by":"Manas Mittal Namrata Rao","written_by":"Sharadindu Bandyopadhyay Dibakar Banerjee","budget":"₹35 crore (US$5.2 million)[3]"}