{"country":"United States","distributed_by":"TriStar Pictures","language":"English","Reception":"The film received the Grand Prize of the Jury at the 1985 Cannes Film Festival.[1] Roger Ebert gave the film four stars (out of four),[2] and at Rotten Tomatoes currently (2011) it has a rating of 88% based on 25 reviews. Halliwell's Film Guide claimed the film \"somewhat lacks plot advancement\" and is \"too self-indulgent even to earn marks for trying.\"[3] allmovie.com's review states that the movie \"maintains its focus on the humanity of central characters\",[4] as well as giving credit to the lead actors, stating that \"Modine delivers a stirring performance as the title character, and Cage's blend of intensity and vulnerability is perfect for the role of Birdy's concerned friend\".[5]","box_office":"$1,455,045","Synopsis":"Two teens, Birdy (Modine) and Al (Cage), become friends at school and serve in Vietnam. Birdy has long been disturbingly fixated with birds and his Vietnam experiences push him over the edge: returning from the war, he is hospitalized for a psychiatric assessment and Al tries to reach him before he'll be separated from Birdy, leaving him alone and lost. As the story develops, flashback scenes show their lives as teens in a working-class neighborhood of Philadelphia in the 1960s, and their developing friendship and viewpoints.","cinematography":"Michael Seresin","directed_by":"Alan Parker","Soundtrack":"The film's soundtrack was written and performed by Peter Gabriel. The music includes adaptations of tracks on Gabriel's third and fourth albums. The music makes heavy use of the Fairlight CMI IIx music computer, an early sampling system. Peter Gabriel was one of the first buyers of the Fairlight CMI IIx.","birdy":"Theatrical release poster","release_dates":"December 21, 1984","produced_by":"Ned Kopp David Manson Alan Marshall","starring":"Matthew Modine|Nicolas Cage|","running_time":"120 minutes","music_by":"Peter Gabriel","edited_by":"Gerry Hambling","written_by":"Sandy Kroopf Jack Behr William Wharton (novel)","budget":"$7.5 million"}