{"country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Gregory Nava Anna Thomas","Plot":"Soldiers Martin (William Hurt) and Jack (Timothy Hutton) are very good friends during World War II. While their friendship grows, they do not realize they are brothers-in-law. Martin eventually learns that Jack is married to his sister Josie (Melissa Leo).When Jack and Josie elope, Jorge (Francisco Rabal), her Basque immigrant father, tracks them down and abducts his daughter in order to dominate her with his \"old-world\" notions of marriage. However, when Jorge Larraneta drowns in a lake after an auto accident, Martin (the black-sheep of the family) returns home and learns of his father's death. He vows revenge after he learns his buddy Jack has become his sworn enemy. Martin gets himself assigned to Jack's infantry platoon in Italy in order to seek vengeance.","language":"English","Reception":"Roger Ebert, film critic for the Chicago Sun-Times, liked the film but questioned the complex screenplay. Yet, Ebert was appreciative of the acting and wrote, \"You see what I mean when I call the movie operatic. It glories in brooding vengeance, fatal flaws of character, coincidence and deep morality. Its plot is so labyrinthine that it constitutes the movie's major weakness; can we follow this convoluted emotional journey? Its passions are so large that they are a challenge to actors trained in a realistic tradition, but Hurt, who has the most difficult passages, rises to the occasion with one of the strangest and most effective performances he has given.\"[5] His television partner Gene Siskel hated the film and put it on his worst of 1988 list.[6]Vincent Canby was not so kind to the filmmakers or the actors. He wrote in his review for The New York Times, \"The movie includes some big, unimpressive battle scenes, a number of orangey sunsets, a lot of comic-strip dialogue ('I'm going to get revenge!' 'He's dead - he'll never forgive me now') and one memorable moment in which the silhouette of a gentle, southern California mountain range fades into the silhouette of a man lying on his death bed. The performances are not good.\"[7]The Washington Post was just as tough on Nava and Thomas. Film critic Rita Kempley said, \"Hurt's role as a vengeful psycho churns up this laughable purple potboiler, but even the perennial Oscar nominee can't save it from itself.\"[8]","box_office":"$1,212,487","cinematography":"James Glennon","directed_by":"Gregory Nava","Filming locations":"Filming locations included: Istria Peninsula, Croatia; País Vasco, Spain; and San Diego, California.","Soundtrack":"An original motion picture soundtrack was released on September 19, 1988 by Virgin Records. The CD, which has eighteen tracks, features original music composed for the film by Ennio Morricone. The recording includes orchestral sounds and several selections of Edda Dell'Orso's vocals.","release_dates":"April 22, 1988 (1988-04-22) (United States)|||||","Distribution":"The film was released in a limited basis on April 22, 1988. The box office opening weekend was $509,397 (216 screens).Box office sales were disappointing. Total sales for the domestic run were $1,212,487 and in its widest release the film was shown in 220 screens. The film closed on June 23, 1988.[3][4]","produced_by":"Anna Thomas","starring":"William Hurt|Timothy Hutton|Melissa Leo|Stockard Channing|","running_time":"118 minutes","music_by":"Music score: Ennio Morricone Featured music: Giuseppe Verdi","a_time_of_destiny":"Theatrical release poster","edited_by":"Betsy Blankett Milicevic","budget":"$8,500,000[1]"}