{"Cast":" ","country":"Italy","distributed_by":"Ente Nazionale Industrie Cinematografiche Joseph Burstyn & Arthur Mayer (US)","bicycle_thieves":"Italian theatrical release poster","screenplay_by":"Vittorio De Sica Cesare Zavattini Suso Cecchi d'Amico Gerardo Guerrieri Oreste Biancoli Adolfo Franci","story_by":"Luigi Bartolini","Legacy":"The film was a major influence on film directors of the Iranian New Wave, such as Jafar Panahi[18] and Dariush Mehrjui.[19] Other directors that called it an influence are Satyajit Ray,[20] Ken Loach,[21] Giorgio Mangiamele,[22] Bimal Roy,[23] Anurag Kashyap,[24] Balu Mahendra,[25] Basu Chatterjee[26] and Isao Takahata.The film was used as source material for the 1985 cult classic Pee-Wee's Big Adventure.[27]The film was parodied in the 1989 film The Icicle Thief.Bicycle Thieves was featured in Robert Altman's 1992 film The Player.","Plot":"In the post-World War II Val Melaina neighbourhood of Rome, Antonio Ricci (Lamberto Maggiorani) is desperate for work to support his wife Maria (Lianella Carell), his son Bruno (Enzo Staiola), and his small baby. He is offered a position posting advertising bills, but tells Maria that he cannot accept because the job requires a bicycle. Maria resolutely strips the bed of her dowry bedsheets—​​prized possessions for a poor family—​​and takes them to the pawn shop, where they bring enough to redeem Antonio's pawned Fides brand bicycle. (A memorable shot shows the sheets being added to a mountain of bedding pawned by other families.) They cycle home—​​Maria on the crossbar—​​rejoicing in their good fortune. Along the way, Maria insists that she has to visit someone. Antonio discovers that it is a seer who had prophesied that Antonio would find work and that Maria owes her money. Antonio is derisive of Maria's faith in the seer, and teases her about spending money on such foolishness.On his first day of work Antonio is atop a ladder when a young man (Vittorio Antonucci) snatches the bicycle. Antonio gives chase but is thrown off the trail by the thief's confederates. The police take a report but warn that there is little they can do. Advised that stolen goods often surface at the Piazza Vittorio market, Antonio goes there with several friends and his small son Bruno. Finding a bike that might be Antonio's they summon an officer, but the serial numbers do not match.At the Porta Portese market Antonio and Bruno spot the thief with an old man. They pursue the thief but he eludes them. They then accost the old man demanding disclosure of the thief's identity, but the old man feigns ignorance. They follow him into a church where, after disrupting the service, he slips away from them. Bruno, after this latest defeat, appears dismayed before his father who upon seeing this slaps his son, greatly upsetting the boy. Antonio has Bruno wait by a bridge while Antonio searches for the old man. Suddenly there are cries that a boy is drowning. Rushing toward the commotion Antonio is relieved to see that the drowning boy is not Bruno. Antonio treats Bruno to lunch in a restaurant, where they momentarily forget their troubles, but on seeing a rich family enjoying a fine meal, Antonio is again seized by his calamity and tortures himself by reckoning his lost earnings.Desperate, Antonio consults the seer, who tells him, \"You'll find the bike today, or not at all.\" Leaving the seer's house they encounter the thief; Antonio pursues him into what turns out to be a brothel, the denizens of which quickly eject them. In the street hostile neighbors gather as Antonio accuses the thief, who conveniently falls into a fit for which the crowd blames Antonio. During this commotion Bruno fetches a policeman, who searches the thief's apartment without result. The policeman tells Antonio the case is weak—​​Antonio has no witnesses and the neighbors are certain to provide the thief with an alibi. Antonio and Bruno walk off in despair amid jeers and threats from the crowd.On their way home, they near Stadio Nazionale PNF football stadium. Inside a game is underway, while outside, rows of bicycles await their owners. Antonio sees an unattended bicycle near a doorway. He paces distractedly, then sits with Bruno on the curb, his hat in his hands. He looks as a stream of bicycles rush past—​​the world seems full of other people's bicycles. He resumes pacing, anguished and agitated, then gives Bruno some money, telling him to take the streetcar and wait at Monte Sacro.Antonio circles the unattended bicycle, summons his courage, and jumps on it. The hue and cry is instantly raised, and Bruno, who has missed the streetcar, is stunned to see his father surrounded, pulled from the bike, slapped and insulted—​​his hat knocked off. As Antonio is being muscled toward the police station, the bicycle's owner notices Bruno, who is carrying Antonio's hat; in a moment of compassion he tells the others to release Antonio.Antonio and Bruno walk off slowly amid a buffeting crowd. Bruno hands his father the hat, crying as Antonio stares dazedly ahead, unreacting even as a truck brushes his shoulder. They look briefly at each other. Antonio fights back tears; Bruno takes his hand. The camera watches from behind as they disappear into the crowd.","language":"Italian","Critical reception":"When Bicycle Thieves was released in Italy, it was viewed with hostility and as portraying Italians in a negative way. Italian critic Guido Aristarco praised it, but also complained that \"sentimentality might at times take the place of artistic emotion.\" Fellow Italian neorealist film director Luchino Visconti criticized the film, saying that it was a mistake to use a professional actor to dub over Lamberto Maggiorani's dialogue.[10] Luigi Bartolini, the author of the novel from which de Sica drew his title, was highly critical of the film, feeling that the spirit of his book had been thoroughly betrayed, since his protagonist was a middle-class intellectual and his theme was the breakdown of civil order in the face of anarchic communism.[14]Bicycle Thieves has received acclaim from critics ever since its release, with the film-review aggregator Rotten Tomatoes reporting 98% positive reviews from 54 reviews, with an average 9.1 out of 10 rating.[15] The picture is also in the Vatican's Best Films List for portraying humanistic values.[16]Bosley Crowther, film critic for The New York Times, lauded the film and its message in his review. He wrote, \"Again the Italians have sent us a brilliant and devastating film in Vittorio De Sica's rueful drama of modern city life, The Bicycle Thief. Widely and fervently heralded by those who had seen it abroad (where it already has won several prizes at various film festivals), this heart-tearing picture of frustration, which came to [the World Theater] yesterday, bids fair to fulfill all the forecasts of its absolute triumph over here. For once more the talented De Sica, who gave us the shattering Shoeshine, that desperately tragic demonstration of juvenile corruption in post-war Rome, has laid hold upon and sharply imaged in simple and realistic terms a major—indeed, a fundamental and universal—dramatic theme. It is the isolation and loneliness of the little man in this complex social world that is ironically blessed with institutions to comfort and protect mankind\".[17] Pierre Leprohon wrote in Cinéma D'Aujourd that \"what must not be ignored on the social level is that the character is shown not at the beginning of a crisis but at its outcome. One need only to look at his face, his uncertain gait, his hesitant or fearful attitudes to understand that Ricci is already a victim, a diminished man who has lost his confidence.\" Lotte Eisner called it the best Italian film since World War II and Robert Winnington called it \"the most successful record of any foreign film in British cinema.\"[10]When the film was re-released in the late 1990s Bob Graham, staff film critic for the San Francisco Chronicle, gave the drama a positive review: \"The roles are played by non-actors, Lamberto Maggiorani as the father and Enzo Staiola as the solemn boy, who sometimes appears to be a miniature man. They bring a grave dignity to De Sica's unblinking view of post-war Italy. The wheel of life turns and grinds people down; the man who was riding high in the morning is brought low by nightfall. It is impossible to imagine this story in any other form than De Sica's. The new black-and-white print has an extraordinary range of grey tones that get darker as life closes in\".[13]","box_office":"$371,111 (domestic gross)[2]","cinematography":"Carlo Montuori","directed_by":"Vittorio De Sica","Translated title":"The original Italian title literally translates into English as Bicycle Thieves, biciclette and ladri being plural, but the film has usually been released in the United States as The Bicycle Thief. According to critic Philip French of The Observer (UK), this alternative title is misleading, \"because the desperate hero eventually becomes himself a bicycle thief\".[11] The film is released in the UK as the more accurate Bicycle Thieves, and the recent Criterion Collection release in North America uses the plural title.[12]When the film was re-released in the late 1990s Bob Graham, staff film critic for the San Francisco Chronicle, was quoted as saying that he preferred the title The Bicycle Thief, stating, \"Purists have criticized the English title of the film as a poor translation of the Italian ladri, which is plural. What blindness! The Bicycle Thief is one of those wonderful titles whose power does not sink in until the film is over\".[13]De Sica changed many aspects of Bartolini's novel, but retained the title, which used the plural form and referred, in the book, to a post-war culture of rampant thievery and disrespect for civil order countered only by an inept police force and indifferent allied occupiers.[14]","release_dates":"24 November 1948 (1948-11-24) (Italy)|||||","Production":"Bicycle Thieves is the best-known work of Italian neorealism, the movement (begun by Roberto Rossellini's 1945 Rome, Open City) which attempted to give cinema a new degree of realism.[6] De Sica had just made the controversial film Shoeshine and was unable to get financial backing from any major studio for the film, so he raised the money himself from friends. Wanting to portray the poverty and unemployment of post-war Italy,[7] he co-wrote a script with Cesare Zavattini and others using only the title and few plot devices of a little-known novel of the time by poet/artist Luigi Bartolini.[8] Following the precepts of neorealism, De Sica shot only on location (that is, no studio sets) and cast only untrained nonactors. (Lamberto Maggiorani, for example, was a factory worker.) That some actors' roles paralleled their lives off screen added realism to the film.[9] De Sica cast Maggiorani when he had brought his young son to an audition for the film. He later cast the 8-year-old Enzo Staiola when he noticed the young boy watching the film's production on a street while helping his father sell flowers. The film's final shot of Antonio and Bruno walking away from the camera into the distance is an homage to many Charlie Chaplin films, who was De Sica's favourite filmmaker.[10]Uncovering the drama in everyday life, the wonderful in the daily news.","produced_by":"P.D.S.: Produzioni De Sica (with finance from Ercole Graziadei, Sergio Bernardi, Count Cicogna)[1]","starring":"Lamberto Maggiorani Enzo Staiola Lianella Carell Vittorio Antonucci","running_time":"93 minutes","music_by":"Alessandro Cicognini","edited_by":"Eraldo Da Roma","budget":"$81,000 or $133,000[citation needed]"}