{"based_on":"Characters  by Mike Myers","country":"United States","distributed_by":"New Line Cinema1","screenplay_by":"Mike Myers|Michael McCullers|","Plot":"Dr. Evil plans to travel back in time to 1975 and bring back Johan van der Smut, aka \"Goldmember\", who developed a cold fusion unit for a tractor beam which Dr. Evil names \"Preparation H\". He intends to use the tractor beam to pull a meteor into the Earth, striking the polar ice caps and causing a global flood. Moments after this plan is revealed, Austin Powers and the British Secret Service attack the base and arrest Dr. Evil. Austin is knighted for his services, but is disappointed when his father, the famous super-spy Nigel Powers, does not attend the event. Basil Exposition later informs Austin that Nigel has been kidnapped, and the only clue is that the crew of his yacht have had their genitalia painted gold.Austin visits the imprisoned Dr. Evil, who tells him that Goldmember is behind the abduction. Time-travelling to 1975, Austin infiltrates Goldmember's roller disco club and is reunited with his former lover, FBI agent Foxxy Cleopatra, who is undercover as a disco singer. With Foxxy's help, Austin locates his father, but is unable to rescue him. Goldmember takes Nigel through Dr. Evil's time machine into the present day. Foxxy wants revenge on Goldmember for murdering her partner, and accompanies Austin in his pursuit. In the present, Dr. Evil and Mini-Me instigate a riot in their prison, allowing them to escape. A British Intelligence mole named Number 3 informs Austin that Dr. Evil has moved to a new lair near Tokyo. Austin and Foxxy travel to Tokyo and confront Fat Bastard, who is now a sumo wrestler, but still does work for Dr. Evil. Fat Bastard explains that a Japanese business man, Mr. Roboto, is working on a device for Dr. Evil and Goldmember.Austin and Foxxy later meet with Mr. Roboto, who pleads ignorance about Nigel's whereabouts. Unconvinced, Austin and Foxxy infiltrate Roboto's factory where the command unit for the tractor beam is being loaded in Goldmember's car, and Roboto hands Goldmember a golden key needed to activate the beam. Foxxy confronts Goldmember while Austin attempts to free Nigel, but Goldmember escapes with the command unit and flees to Dr. Evil's sub. Unable to settle their differences, Nigel and Austin part ways when they disagree on how to deal with the situation. Meanwhile, Dr. Evil's son, Scott Evil, has become increasingly evil in an attempt to prove himself to his father, to the point that he too is going bald. Scott presents his father with sharks with laser beams attached to their heads, a request that had gone unfulfilled in the first film. Dr. Evil replaces Mini-Me with Scott as his favored son; the rejected Mini-Me defects and joins Austin.Austin, Foxxy and Mini-Me infiltrate the sub, but Austin is captured. Dr. Evil prepares to activate the tractor beam, but Foxxy has stolen the key and frees Austin. Austin prepares to shoot Dr. Evil, when Nigel appears and reveals Dr. Evil and Austin are brothers, separated when they were toddlers when an assassination attempt killed their mother, and Dr. Evil was found and raised by Belgians. Dr. Evil and Austin embrace, enraging Scott, who flees to pursue his own vengeance, whilst Goldmember commandeers the tractor beam's controls, unzipping his pants to reveal his gold-covered genitals to be a spare key. Goldmember activates the tractor beam, but Austin and Dr. Evil work together to reverse its polarity, destroying the meteor and saving the world. The heroes arrest Goldmember, who turns to the camera to reveal the entire string of events was adapted into a film by Steven Spielberg, starring Tom Cruise as Austin, Kevin Spacey as Dr. Evil, Danny DeVito as Mini-Me, and John Travolta as Goldmember. Austin, Foxxy, Dr. Evil, Mini-Me and Nigel are in the audience of a Hollywood theater watching the film. Upon exiting the theater they run into Fat Bastard, now thinner but flabby, thanks to the Subway diet. As Austin and Foxxy kiss, in Dr. Evil's Hollywood lair, Scott – now completely bald, dressed like and laughing in a manner similar to his father—declares he will get his revenge on Austin and begins dancing like Michael Jackson.","language":"English","box_office":"$296.7 million","cinematography":"Peter Deming","production_company":"Gratitude International Team Todd Moving Pictures","directed_by":"Jay Roach","Soundtrack":"The song \"Hey Goldmember\" interpolates and is a parody of four '70s disco songs formed into a medley; \"Sing a Song\" by Earth, Wind & Fire, \"Get Down Tonight\", \"(Shake, Shake, Shake) Shake Your Booty\", and \"That's the Way (I Like It)\", all by KC and the Sunshine Band.\"Sing a Song\" is not listed in the credits but is sung by Beyoncé at the beginning.","release_dates":"July 26, 2002 (2002-07-26)|||||","Production":"The title of the film, Goldmember, led to legal action being taken by MGM, the distributors of the James Bond film franchise, that briefly led to the film's title being removed from promotional material and trailers. The dispute was quickly resolved and the film title remained unchanged on the provision that the film would include trailers in its cinema releases for the then-upcoming James Bond film, Die Another Day, and The Lord of the Rings: The Two Towers.[3]Austin Powers (Myers), having conquered the '90s and the '60s, travels back to the 1970s and teams up with his nemesis Dr. Evil (also played by Myers) to thwart a new villain, Goldmember (Myers once again). Myers also plays Fat Bastard for the second time, this time parodying the kind of \"wire fight\" seen in Crouching Tiger, Hidden Dragon. The film also stars Beyoncé Knowles as Foxxy Cleopatra (parodying blaxploitation heroines, primarily Foxy Brown and Cleopatra Jones, as well as Christie Love when she says, \"You're under arrest, sugah!\" ), Michael York, reprising the role of Basil Exposition, and Verne Troyer in his second appearance as Mini-Me. The film also introduced a new character named Number 3 (a.k.a. the Mole), who is portrayed by former child star Fred Savage. Clint Howard plays a radar operator in all three films. Michael Caine guest stars as Austin's father, Nigel; this role was inspired by The Ipcress File, a 1965 film starring Caine.[4]Four actors who appeared in the earlier films play different characters in Goldmember. Rob Lowe, who played the friend of a dead guard in International Man of Mystery, reprises his role as a younger Number 2 from The Spy Who Shagged Me, while Neil Mullarkey (quartermaster clerk in International Man of Mystery) and Eric Winzenried (army private soldier in The Spy Who Shagged Me) appear as the Physician and Henchman Sailor in the Sick Bay. Michael McDonald (the Virtucon guard who got run over by a steamroller in \"International Man of Mystery\" and a NATO soldier in \"The Spy Who Shagged Me\") appears as the royal guard.Johan van der Smut, better known as Goldmember, is a fictional villain played by Myers (John Travolta played the character in a cameo at the end of the film). The name was inspired by the James Bond villain Auric Goldfinger. Goldmember's Dutch origins and character traits were, according to Myers, inspired by an episode of the HBO TV series Real Sex featuring a Dutchman who operated a \"sex barn\" north of Rotterdam. The man's distinct forms of expression caught Myers' attention while he was writing.[5]","produced_by":"Jan Blenkin|John S. Lyons|Eric McLeod|Demi Moore|Mike Myers|","starring":"Mike Myers|Beyoncé Knowles|Seth Green|Michael York|Robert Wagner|Mindy Sterling|Verne Troyer|Michael Caine|","running_time":"98 minutes","austin_powers_in_goldmember":"Theatrical release poster","music_by":"George S. Clinton","edited_by":"Greg Hayden|Jon Poll|","Release":"Austin Powers in Goldmember took in £5,585,978 in the United Kingdom on its opening weekend. In the United States, it broke the opening weekend record for a spoof movie, surpassing the previous Austin Powers film. The film grossed US$73 million on its opening weekend, and grossed a total of $213 million in the United States, according to Box Office Mojo.Austin Powers in Goldmember was released on video and DVD on December 3, 2002.On Rotten Tomatoes, the film received a rating of 54%, based on 195 reviews, with the site's critical consensus reading, \"While the narrative structure is messy and doesn't make much sense, the third installment of the Austin Powers franchise contains enough inspired bits to entertain\".[6] On Metacritic, the film has a score of 62 out of 100, based on 34 critics, indicating \"generally favorable reviews\".Myers was nominated for the MTV Movie Award for Best Villain for the third time, but lost against Daveigh Chase for her role as Samara Morgan in The Ring, making it the first time Myers lost the award. However, he did win the award for Best Comedic Performance, making it the first time he won the award, having previously lost twice for the first two films.","budget":"$63 million"}