{"based_on":"Dolores Claiborne  by Stephen King","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Tony Gilroy","Themes and interpretations":"Though typically classified as a drama and psychological thriller, some critics, such as Roger Ebert, have classified Dolores Claiborne as a horror film,[6] while it has also been identified as a Gothic romance.[2]Film theorist Kirsten Thompson identifies the film as a melodrama, \"produced by the repression of specific traumas, [in this case] domestic violence and incest.\"[7] According to Martha McCaughey and Neal King, the film's use of flashbacks suggest a specific narrative point of view when considering the film's themes of abuse and incest between Dolores, as well as Selena and Joe: \"That all the flashbacks save one belong to Dolores tells us that not only are we watching her story; it also tells us of the unavailability of the past to Selena, and of the displacement and repression forced into play by the girl's experience of incest.\"[8]The flashback scene in which Selena recalls her father's forcing her to masturbate him on the ferry has been particularly noted by critics: \"Here, Selena and the viewer alike come finally to see Joe's transgressions and, by implication, to understand the truth of Dolores' tale. Throughout this scene the perspective offered by the camera remains firmly focused on the reactions of the victim of the sexual crime.\"[9]Dolores Claiborne has been cited as a \"self-consciously feminist\" film that \"combines the melodramatic impulse with the investigative structure of a noir crime thriller and a contemporary feminist consciousness.\"[10] The film has also been read as an example of a maternal melodrama that features an \"idealized mother-figure\" who sacrifices the needs of her own for others.[10] In the book Screening Genders, it is noted that one scholar considered Dolores Claiborne and Stage Door (1937) to be the only \"truly feminist\" films made in Hollywood, in that they \"don't cop out at the end.\"[11]","dolores_claiborne":"Theatrical release poster","Plot":"Dolores Claiborne (Bates) works as a domestic servant on a Maine island. The film opens with Dolores having a struggle with her elderly, paralyzed employer Vera Donovan (Judy Parfitt) in her mansion, after which Vera falls down the staircase. Dolores ransacks the kitchen and is then caught by a mailman as she stands over Vera with a rolling pin, apparently intending to kill her. Vera dies and the police begin a murder investigation.Dolores' daughter, Selena St. George (Leigh), a successful New York City journalist, arrives in town to support her mother, despite her own doubts about Dolores' innocence. Dolores insists that she did not kill her employer, but finds little sympathy as the entire town believes she murdered her husband, Joe St. George (David Strathairn) almost twenty years earlier. Some of the town's inhabitants harass her by vandalizing her home, taunting her in the street, and driving by her house screaming at her. Detective John Mackey (Christopher Plummer), who was the chief detective in her husband's murder case, is determined to put Dolores away for life.Selena also believes that Dolores killed her father, and has not spoken to her mother in over a decade. As the film develops, it is revealed that Joe was an abusive alcoholic, and that one night Dolores had threatened to kill him if he ever harmed her again. Dolores went to work as a housemaid for millionaire Vera Donovan in order to raise enough money to pay for Selena's education, and had gone to the bank to withdraw her money so she and Selena could flee Joe's abuse. The plan backfired, however, when the bank notified Dolores that Joe stole the money from Selena's savings account.In the present, Dolores says that Vera had thrown herself down the staircase and begged Dolores to put her out of her misery. Mackey refuses to believe her, and reveals that Vera has left her entire fortune to Dolores. Mackey informs them that the will is eight years old, which nearly convinces Selena that her mother is guilty. Dolores decides that it is time to reveal the truth to Selena: she did in fact kill Joe, and it was actually Vera who suggested the plan to her. Dolores says that she had been pushed to the breaking point upon realizing that Joe had been molesting Selena, which Selena furiously denies both in the past and present. After a fierce argument Selena storms out, leaving her mother to fend for herself.In a flashback to a scene some 20 years before, Dolores breaks down and confesses of her troubled home life to Vera. An unusually sympathetic Vera implies that she had killed her late, unfaithful husband Jack, and engineered it to look like an accident. Vera's confession forms a bond between the two women and allows Dolores to take control of her situation. As a total solar eclipse approaches, Dolores and the young Selena have an argument about Dolores' suspicions regarding Joe's sexual abuse. Selena flees home for the weekend to work at a hotel, where guests have flocked for the eclipse. Joe soon returns from working on a fishing boat, and as a treat, Dolores offers him a bottle of Scotch. After Joe gets drunk, Dolores reveals that she knows that he has stolen from Selena's account and molested his own daughter. Dolores provokes him into attacking her and falling down an old well, leaving him to die as he plunges to the stone bottom.In the present, Selena hears the story on a tape left for her by Dolores, who had foreseen her departure. While on the ferry, Selena suddenly uncovers a repressed memory of her father forcing her to give him a handjob. Realizing that her mother was telling the truth all along, Selena rushes back to Dolores as she is attending the coroner's inquest. Mackey makes a case to be sent to a grand jury in an attempt to indict Dolores for murder. Selena tells Mackey that he has no admissible evidence, and that despite an often-stormy relationship, Vera and Dolores loved each other. Realizing he has no case, Mackey reluctantly drops the charges. The film ends with Dolores and Selena reconciling on the ferry wharf before Selena returns to New York.","language":"English","Reception":"Dolores Claiborne received mostly positive reviews from critics; it currently holds an 82% rating on Rotten Tomatoes based on 34 reviews with an average rating of 6.6.[12] The film also has a rating of 62 on metacritic citing generally favorable reviews.Janet Maslin of The New York Times called it \"a vivid film that revolves around Ms. Bates's powerhouse of a performance... Only after the film has carefully laid the groundwork for a story of old wounds and violent mishaps does the anticlimactic truth become apparent.\"[13] Roger Ebert gave the film three out of four stars and praised the performances of Bates and Leigh, saying: \"This is a horror story, all right, but not a supernatural one; all of the elements come out of such everyday horrors as alcoholism, wife beating, child abuse and the sin of pride.\"[6]Entertainment Weekly, however, gave the film a negative review, awarding it a D+ rating and saying: \"This solemnly ludicrous ”psychological” thriller is like one of Hollywood’s old-hag gothics turned into a therapeutic grouse-a-thon – it’s Hush… Hush, Sweet Charlotte for the Age of Oprah.\"[14]The movie debuted at number three for the week of March 26, 1995 with $5,721,920. It went on to make $24,361,867 domestically. It ranks as the 15th highest grossing film based on a Stephen King novel.[15] It ranks as the 17th highest on the same list adjusted for inflation.[16]Kathy Bates and Jennifer Jason Leigh were nominated for the best actress and best supporting actress award at the 22nd Saturn Awards.[17] Ellen Muth also won the Tokyo International Film Festival Award for Best Supporting Actress","box_office":"$24,361,867","cinematography":"Gabriel Beristain","production_company":"Castle Rock Entertainment","directed_by":"Taylor Hackford","release_dates":"March 24, 1995 (1995-03-24) (U.S.)|September 8, 1995 (1995-09-08) (UK)||||","Production":"Dolores Claiborne was filmed in Nova Scotia, Canada.[5]","produced_by":"Charles Mulvehill Taylor Hackford","starring":"Kathy Bates Jennifer Jason Leigh David Strathairn Judy Parfitt John C. Reilly Christopher Plummer","running_time":"131 minutes[1]","music_by":"Danny Elfman Hendrik Meurkens","edited_by":"Mark Warner"}