{"country":"United States","distributed_by":"Universal Pictures","Plot":"Young photographer Yaniv \"Nev\" Schulman lives with his brother Ariel in New York City. Abby Pierce, an 8-year-old child prodigy artist in rural Ishpeming, Michigan, sends Nev a painting of one of her photos. They become Facebook friends, which broadens to include Abby's family: including her mother, Angela (Wesselman); Angela's husband Vince (she uses a photo of Stephen Fogarty); and Abby's attractive older half-sister Megan, who lives in Gladstone, Michigan.For a documentary, Ariel and Henry Joost film Nev as he begins an online relationship with Megan. She sends him MP3s of song covers she performs for him, but Nev discovers that they are all taken from performances on YouTube. He later finds evidence that Angela and Abby have lied about other details of Abby's art career. Ariel urges Nev to continue the relationship for the documentary, although Nev seems reluctant to continue. The siblings decide to travel to Michigan in order to make an impromptu appearance at the Pierces' house and confront Megan directly. As they arrive at the house, Angela takes some time to answer the door, but is welcoming and seems happy to finally meet Nev in person. She also tells him that she has recently begun chemotherapy for uterine cancer. After leaving multiple messages while trying to call Megan, she drives Nev and Ariel to see Abby herself. While talking with Abby and her friend alone, Nev learns that Abby never sees her sister and rarely paints.The next morning, Nev wakes up to a text message from Megan saying that she has had a long-standing alcohol problem, and has decided to check into rehab and cannot meet him, which is confirmed by one of Megan's Facebook friends, but Nev realizes that this is likely another lie from Angela. After meeting with the family back at their house, Angela admits that the pictures of Megan were of a family friend, that her daughter Megan really is in rehab downstate and that Angela had really painted each of the paintings that she had sent to Nev. Nev thus realizes that while believing he was talking to Megan, it was really Angela posing as her with an alternate Facebook account and mobile phone. As he sits for a drawing, Angela confesses that the various Facebook profiles were all maintained by her, but that through her friendship with Nev she had reconnected with the world of painting, which had been her passion before she sacrificed her career to marry Vince—who has two severely mentally disabled children who require constant care. Through a conversation with Vince himself, the siblings learn that Angela had told him (falsely) that Nev was paying for her paintings, and that he had encouraged her to seize the opportunity to have him as a patron.Vince, talking with Nev, tells the story about how live cod were shipped along with catfish in the same tanks to keep the cod active, and thus ensure the quality of the fish. And explain this as a metaphor on how there are people in everyone's lives who keep us alert, active, always on our toes and always thinking. It is implied that he believes Angela to be such a person.Some time after, Nev receives a package labeled as being from Angela herself; it is the completed drawing that she labored over during their meeting, although Nev seems ambivalent in his feelings about it.On-screen text then informs the viewer that Angela did not have cancer, there was no Megan at Dawn Farms, and she doesn't know the girl in the pictures. Over the course of their nine-month correspondence, Angela and Nev exchanged more than 1,500 messages. It was revealed later on that the girl in the pictures was Aimee Gonzales, a professional model and photographer, who lives in Vancouver, Washington with her husband and two children. In October 2008, two years subsequent to the events, Ronald, one of Vince's twin sons, has died. Angela deactivated her 15 other profiles and changed her Facebook profile to a picture of herself, and now has a website to promote herself as an artist. Nev is still on Facebook and has more than 732 friends, including Angela.","Title":"In the film, the husband of the \"catfish\", Vince, relays a story of how when live cod were shipped to Asia from North America, the fish's inactivity in their tanks resulted in only mushy flesh reaching the destination. However, fishermen found that putting catfish in the tanks with the cod kept them active, and thus ensured the quality of the fish. Vince made an analogy of how there are people in everyone's lives who keep each other active, always on their toes and always thinking, suggesting that people should always be alert while socializing through the Internet.","language":"English","Reception":"The film was well received by critics; it holds an 80% rating on Rotten Tomatoes, the site's consensus being \"Catfish may tread the line between real-life drama and crass exploitation a little too unsteadily for some viewers' tastes, but its timely premise and tightly wound mystery make for a gripping documentary\".[17]Time magazine did a full-page article, written by Mary Pols in a September 2010 issue, saying \"as you watch Catfish, squirming in anticipation of the trouble that must lie ahead―why else would this be a movie?―you're likely to think this is the real face of social networking.\"[18]At the 2010 Sundance Film Festival, Alison Willmore of IFC described it as a \"sad, unusual love story.\"[19] John DeFore of The Hollywood Reporter called Catfish \"jaw-dropping\" and \"crowd-pleasing\" but said that it \"will require clever marketing in order to preserve the surprises at its core.\"[20] Kyle Buchanan of Movieline asked if \"easily the most buzzed-about documentary\" at Sundance had \"a truth problem\", and reported that an audience member questioned whether it was a documentary at all.[6] Roger Ebert of the Chicago Sun-Times referred to these questions as a \"severe cross-examination\" and states that \"everyone in the film is exactly as the film portrays them.\"[21]Total Film described the film as: \"Funny, unsettling and thoroughly engrossing... the end result is a compulsive, propulsive study of relationships virtual and real\".[22]Very Aware said of the film: \"All of the above information doesn't prove that the film is entirely fake. What it does prove is that much of the film has been recreated, and its possible that they did it in such a way to create a story where there might not have been one to begin with\".[23]Ariel Schulman and Henry Joost became co-directors for the horror film Paranormal Activity 3 after Catfish received attention from film festivals. The two also co-directed the fourth installment.","box_office":"$3,479,614[2]","catfish":"Theatrical release poster","cinematography":"Henry Joost Ariel Schulman Nev Schulman","production_company":"Relativity Media Rogue Pictures","directed_by":"Henry Joost Ariel Schulman","Authenticity":"In an interview, Schulman related that some viewers believe Catfish to be a fake documentary or a hoax.Kyle Buchanan at Movieline questions why the filmmakers would begin obsessively documenting Nev's online relationship so early on, and argues that it is highly improbable that media-savvy professionals like the Schulmans and Joost would not use the Internet to research Megan and her family before meeting them.[6] Others have also questioned the trio's decision to begin filming, as well as the seemingly improbable coincidence of them catching everything of importance to the story on film as it happens. It has also been pointed out that the group's supposed movements in Catfish are not documented in their public blog postings at the time.[7]Since the movie's release, Angela has been interviewed by ABC's 20/20[8] and the Los Angeles Times has spoken with neighbors familiar with her family.[9] In the summer of 2011, The Mining Journal ran a two-part profile[10] of Angela in connection with the North of the 45th Parallel 2011 exhibition at the DeVos Art Museum on the campus of Northern Michigan University.[11]","MTV series":"The Schulmans teamed up with MTV to produce a reality television series similar to the idea of the documentary but which focuses on the lives of others who have been entangled in an online relationship with another person.[15] It premiered on November 12, 2012.[16]","Lawsuits":"The film itself has been the subject of two lawsuits. Relativity Media has concluded that due to these lawsuits, the film will never be profitable.[24] Both of these lawsuits have to do with songs used within the film not being attributed to their creators.","release_dates":"January 22, 2010 (2010-01-22) (Sundance)|September 17, 2010 (2010-09-17) (United States)||||","Production":"To portray Megan and her family, Angela used pictures that Gonzales had posted on Facebook. The documentary's filmmakers compensated Gonzales for her involuntary appearance in Catfish, and she participated in publicity for the film.[4] A photograph Angela described as a son, Alex, is that of rapper Joshua Paul Liimatta, also known as \"The Sisu Kid\".[5]","produced_by":"Andrew Jarecki Marc Smerling Henry Joost Ariel Schulman","starring":"Nev Schulman Henry Joost Ariel Schulman","running_time":"87 minutes[1]","edited_by":"Zachary Stuart-Pontier","Release":"The film had a limited release[12] on September 17, 2010.[13] The Rogue Pictures unit of Relativity Media acquired Catfish in a bidding war with Paramount Pictures, after Brett Ratner endorsed the film.[14] Catfish was released on Blu-ray and DVD on January 4, 2011.[citation needed]"}