{"celebrity":"Theatrical release poster","country":"United States","distributed_by":"Miramax Films","Plot":"Lee Simon (Kenneth Branagh) is an unsuccessful novelist turned travel writer who immerses himself in celebrity journalism following a midlife crisis and subsequent divorce from his insecure wife, Robin (Judy Davis), a former English teacher, after sixteen years of marriage.As he stumbles his way through both professional encounters and sexual escapades with performers, models, and other players in the world of entertainment, Lee increasingly questions his purpose in life. He ruins numerous opportunities due to his fame-seeking, insecurities and neuroses.Meanwhile, Robin trades her many neuroses for a makeover and a job with television producer Tony Gardella (Joe Mantegna) that leads to her own celebrity interview program. She takes advantage of numerous opportunities and ends up happy and successful.","language":"English","Critical reception":"Janet Maslin of the New York Times observed, \"Lee Simon is one of the filmmaker's wearier creations, in ways that deny Celebrity the bracing audacity of recent, better Allen films like Deconstructing Harry and Everyone Says I Love You. And even with Branagh as his younger alter ego, Allen finds no way to revitalize the character's predictable worries about advancing his career and chasing beautiful women . . . Though Celebrity is filled with beautiful and famous faces, it has plenty of opportunity to bog down between star turns, and some of the episodes about the Simons are astonishingly flat.\"[2]Roger Ebert of the Chicago Sun-Times said the film \"plays oddly like the loose ends and unused inspirations of other Woody Allen movies; it's sort of a revue format in which a lot of famous people appear onscreen, perform in the sketch Woody devises for them and disappear. Some of the moments are very funny. More are only smile material, and a few don't work at all. Like all of Allen's films, it's smart and quirky enough that we're not bored, but we're not much delighted, either . . . Branagh has all the Allen vocal mannerisms and the body language of comic uncertainty. He does Allen so carefully, indeed, that you wonder why Allen didn't just play the character himself.\"[3]Peter Travers of Rolling Stone felt the film \"suffers from lulls and lapses and one lulu of a casting gaffe, but this keenly observant spoof of the fame game is hardly the work of a burnout. At sixty-two, the Woodman can still mine caustic laughter from the darkest corners of his psyche. In Celebrity, he cracks his ringmaster's whip on a circus of rude, cathartic fun . . . Branagh, whether by his choice or his director's, plays Lee like a Woody impressionist, down to the nervous gestures and the stuttering whine . . . Lee should emerge as flawed but real in a world of gorgeous poseurs. Instead, Branagh's party-trick performance keeps audiences at a distance. What saves the day is the steady march of scintillating cameos from actors who bring out the best in Allen's barbed dialogue.\"[4]Edward Guthmann of the San Francisco Chronicle stated, \"Branagh stammers, bobs his head and runs the gamut of other established Woody tics and mannerisms - delivering nervous shtick where a performance would have sufficed. His novelty act belongs in the same bin with his hammy histrionics in Mary Shelley's Frankenstein . . . The irony of Celebrity is that so much of it is admirably acted, written and directed. Despite his one-note obsessions, Allen is a fine director whose stories clip along, whose dialogue sparkles and whose actors look grateful for the luxury of his words.\"[5]Todd McCarthy of Variety called the film \"a once-over-lightly rehash of mostly stale Allen themes and motifs\" and added, \"The spectacle of Kenneth Branagh and Judy Davis doing over-the-top Woody Allen impersonations creates a neurotic energy meltdown . . . Branagh is simply embarrassing as he flails, stammers and gesticulates in a manner that suggests a direct imitation of Allen himself . . . For her part, Davis was brilliant in Husbands and Wives and has appeared effectively in other Allen films, but she not only overdoes the neurotic posturing this time but is essentially miscast . . . Annoyingly mannered in performance as well as tiresomely familiar in the way it trots out its angst-ridden urban characters' problems, [the picture] has a hastily conceived, patchwork feel that is occasionally leavened by some lively supporting turns and the presence of so many attractive people onscreen.\"[6]Neil Norman of London Evening Standard noted that \"many scenes, and indeed personalities, lack the credence of similar shots in Annie Hall, Manhattan or even Stardust Memories. Judy Davis's doorstepping television interviews in the Jean-Georges restaurant where she encounters several well-heeled New Yorkers, including Donald Trump (who is planning to buy St Patrick's Cathedral and knock it down) are frankly risible; a rehearsal scene in the Ziegfield Theatre where [Winona Ryder]is being coached in the art of seducing a woman (gasp!) smacks of old-fashioned prurience. Fashion designer Isaac Mizrahi's turn as a lionised New York artist complaining at his opening at the Serge Sorokko Gallery in SoHo that fame will ruin him, is simply banal. Even the opening shot, of a film crew on the streets attempting to catch a reaction shot of Melanie Griffith' walking from a limo, is peopled with a veteran film-maker's notion of what young hip film-makers are like (shavenheaded, natch) rather than an identifiable reality.\"[7]Lisa Schwarzbaum of Entertainment Weekly graded the film B- and called it a \"big, muddled, contemporary variation on La Dolce Vita. She added, \"[I]n every minute of DiCaprio's participation ... he juices Celebrity with a power surge that subsides as soon as he exits.\"[8]Review aggregate website Rotten Tomatoes currently scores the film with a 41% 'Rotten' rating; consensus adding \"Entertaining, but too scattered.\"[9]","box_office":"$5,078,660","cinematography":"Sven Nykvist","production_company":"Sweetland Films Magnolia Productions","directed_by":"Woody Allen","release_dates":"November 20, 1998 (1998-11-20)|||||","Production":"The film was shot in black-and-white on location in New York City by cinematographer Sven Nykvist. Celebrity was the last of four films shot by Nykvist for Allen. It also marks the end of Allen's long collaboration with editor Susan E. Morse, who had edited the previous twenty of Allen's films beginning with Manhattan (1979).The film premiered at the Venice Film Festival and was shown at the New York Film Festival before going into general release in the US on November 20, 1998. It opened on 493 screens, grossing $1,588,013 and ranking #10 on its opening weekend. It eventually earned $5,078,660 in the US.[1]","produced_by":"Letty Aronson Richard Brick J.E. Beaucaire Jean Doumanian Charles H. Joffe Jack Rollins","starring":"Hank Azaria Kenneth Branagh Judy Davis Leonardo DiCaprio Winona Ryder Melanie Griffith Famke Janssen Michael Lerner Joe Mantegna Bebe Neuwirth Charlize Theron","running_time":"113 minutes","edited_by":"Susan E. Morse","written_by":"Woody Allen","budget":"$12 million"}