{"country":"United States","distributed_by":"Associated Film Distribution","Critical response":"Can't Stop the Music has received very negative reviews from critics. It currently holds an 8% \"rotten\" score on Rotten Tomatoes.[12] The New York Times gave the film a scathing review, calling it \"thoroughly homogenized.\"[13] Variety magazine felt likewise, writing \"The Village People, along with ex-Olympic decathlon champion Bruce Jenner, have a long way to go in the acting stakes.\"[14] Nell Minow of Yahoo! Movies called the film \"an absolute trainwreck of a movie\", but that it had \"some hilariously campy moments.\"[15] Gene Siskel and Roger Ebert selected the film as one of their \"dogs of the year\" in a 1980 episode of Sneak Previews.[16]The film is listed in Golden Raspberry Award founder John Wilson's book The Official Razzie Movie Guide as one of \"The 100 Most Enjoyably Bad Movies Ever Made\".[17]","Plot":"Songwriter Jack Morell (Steve Guttenberg)-a reference to Village People creator Jacques Morali-gets a break DJing at local disco Saddle Tramps. His roommate Sam Simpson (Valerie Perrine), a supermodel newly retired at the peak of her success, sees the response to a song he wrote for her (\"Samantha\") and agrees to use her connections to get him a record deal. Her connection, ex-boyfriend Steve Waits (Paul Sand), president of Marrakech Records (a reference to Village People record label Casablanca Records), is more interested in getting back with her than in Jack's music (and more interested in taking business calls than in wooing Samantha), but agrees to listen to a demo.Sam decides Jack's vocals won't do, and recruits neighbor and Saddle Tramps waiter/go-go boy Felipe Rose (the Indian), fellow model David \"Scar\" Hodo (the construction worker, who daydreams of stardom in the solo number \"I Love You to Death\"), and finds Randy Jones (the cowboy) on the streets of Greenwich Village, offering dinner in return for their participation. Meanwhile, Sam's former agent Sydney Channing (Tammy Grimes) orders Girl Friday Lulu Brecht (Marilyn Sokol) to attend, hoping to lure the star back. Ron White (Bruce Jenner), a lawyer from St. Louis, is mugged by an elderly woman on his way to deliver a cake Sam's sister sent, and shows up on edge. Brecht gets Jack high, which unnerves him when her friend Alicia Edwards brings singing cop Ray Simpson, but Jack records the quartet on \"Magic Night\". Ron, pawed all night by the man-hungry Brecht, is overwhelmed by the culture shock of it all and walks out.The next day, Sam runs into Ron, who apologizes, proffers the excuse that he's a Gemini, and follows her home. Spilling leftover lasagna on himself, Sam and Jack help him off with his trousers before Jack leaves and Sam and Ron spend the night. Newly interested in helping, Ron offers his Wall Street office to hold auditions. There, Glenn M. Hughes, the leatherman climbs atop a piano for a rendition of \"Danny Boy\", and he and Alex Briley, the G.I. join up. Now a sextet, they get their name from an offhand remark by Ron's socialite mother Norma. Ron's boss, Richard Montgomery (Russell Nype), overwhelmed by the carnival atmosphere, insists the firm not represent the group, and Ron quits.Ron's new idea for rehearsal space is the YMCA (the ensuing production number \"YMCA\" features its athletic denizens in various states of undress—along with The Simpsons Movie, the film is one of the few non R-rated offerings to feature full-frontal male nudity). The group cut a demo (\"Liberation\") for Marrakech, but Steve sees limited appeal and Sam refuses his paltry contract. Reluctant to use her savings, they decide to self-finance by throwing a pay-party.To bankroll the party, Sam acquiesces to Channing's plea to return for a TV ad campaign for milk, on the condition the Village People are featured. The lavish number \"Milkshake\" begins as Sam pours milk for six little boys in the archetypal costumes with the promise they'll grow up to be the Village People. The advertisers want nothing to do with such a concept, and refuse to air the spot. Norma then steps in to invite the group to debut at her charity fundraiser in San Francisco. Sam lures Steve by promising a romantic weekend but Ron is taken aback by the inference that she'd go through with the seduction, and Sam breaks up with him. On his private jet, Steve prepares for a tryst, but it's Jack and his former chorine mother Helen (June Havoc) who show up, to hash out a contract. Initially reluctant, Helen seduces Steve with her kreplach and before long they're negotiating the T-shirt merchandising for the Japanese market.In the dressing room before the show, Ron, relieved to learn Sam didn't travel with Steve, proposes to her. At one point, Montgomery shows up to rehire Ron as a junior partner representing the group. Following a set by The Ritchie Family (\"Give Me a Break\"), the Village People make a triumphant debut (\"Can't Stop the Music\").","can't_stop_the_music":"Theatrical release poster","language":"English","box_office":"$2 million","cinematography":"Bill Butler","production_company":"EMI Films","directed_by":"Nancy Walker","Home media":"Can't Stop the Music was released on Region 1 DVD on April 16, 2002.","release_dates":"June 20, 1980 (1980-06-20)|||||","Production":"The film's director, Nancy Walker, a theater, film, and television star since the 1940s, had been nominated for two Tonys, four Golden Globes,[3] and eight Emmys.[4]Walker guest starred as Rhoda's mother Ida Morgenstern in several episodes of The Mary Tyler Moore Show and continued that role in its spin-off Rhoda. After establishing the character, Walker directed some episodes of both series, along with episodes of other situation comedy series. Can't Stop the Music was her lone effort at film direction, as after it, Walker turned her attention back to acting in television.Can't Stop the Music was Bruce Jenner's film debut after becoming famous for three world record-setting performances in the Decathlon, and a Gold medal win at the 1976 Olympic Games. Jenner's record stood from 1975 until shortly before this film's 1980 release. Jenner did not appear in another film until Adam Sandler's Jack and Jill (2011), which, like Can't Stop the Music won the Golden Raspberry Award for Worst Picture.The film's supporting cast includes two two-time Tony Award winners, Tammy Grimes and Russell Nype, June Havoc (sister of stripper Gypsy Rose Lee), Altovise Davis (wife of Sammy Davis, Jr.), character actor Jack Weston, and Emmy-winner Leigh Taylor-Young. The Village People auditioners included Blackie Lawless (a member of the glam-punk group New York Dolls and heavy metal group W.A.S.P.) and James Marcel (who would later find greater success with the name James Wilder). Background dancers included Perri Lister, girlfriend of Billy Idol and mother to his son, and Peter Tramm, who would go on to appear in dozens of music videos and double for Kevin Bacon in Footloose.Ray Simpson's role was originally intended for Victor Willis, the original lead singer of the Village People who quit the group during pre-production of this film.[5] Wanting to assert his heterosexuality amongst the gay-themed group, Willis had insisted his then-wife, Phylicia Ayers-Allen, be written into the film as his girlfriend.[5] When he quit the group, Ayers-Allen was fired and replaced by Altovise Davis.[5]Tensions between Walker and Valerie Perrine rose on the set to the point that Walker would not be present for scenes featuring Perrine, leaving director of cinematography Bill Butler to direct in her place.[5]Producer Allan Carr was coming off a massive worldwide hit with the pop musical Grease when shooting began in May 1979 at the height of the disco craze. Carr took a hands-on role with the production, and personally directed and cast the male athlete extras for the \"YMCA\" musical sequence.[5] He had attempted to cast Grease star Olivia Newton-John in this film as Samantha, but after discussions between her producer, John Farrar, and Morali over who would write Newton-John's numbers, Newton-John instead signed on to play the lead in Xanadu.[5]The band's silver and white costumes in the \"Milkshake\" sequence and red costumes in the finale sequences were designed by Tony- and Oscar-winning[6] designer Theoni V. Aldredge.Two of the band's three biggest hits—\"In the Navy\" and \"Macho Man\"—do not appear in the film, though in reference to the latter, Perrine wears a T-shirt emblazoned with the words \"Macho Woman\" as she jogs through the men's locker room at the YMCA.Another reference to one of the band's songs, \"San Francisco (You've Got Me)\" appears in the opening credits as Jack passes a group of three women with the words 'San Francisco' printed on their T-shirts.Shooting took place at MGM Studios in Culver City, California, with location shooting in New York City and San Francisco. Location shooting in New York was somewhat complicated by adjacent protests by gay activists over the William Friedkin film Cruising (starring Al Pacino), which was filming on location nearby.[5] The two productions were mistaken for each other more than once, with protestors disrupting the Can't Stop the Music location shoots when they intended to halt production of Cruising.[5] A few weeks prior to release, Jenner and Perrine hosted a TV special, Allan Carr's Magic Night, to promote the film.Jack's song \"Samantha\" is credited in the film as being sung by David London, a pseudonym for rock singer Dennis \"Fergie\" Frederiksen, who was the lead singer for several popular rock bands during the 1980s. London/Frederiksen also sings a second song on the soundtrack, \"The Sound of the City\".[7]","produced_by":"Allan Carr|Henri Belolo|Jacques Morali|","starring":"Village People|Valerie Perrine|Bruce Jenner|Steve Guttenberg|Paul Sand|Tammy Grimes|","running_time":"124 minutes[1]","music_by":"Jacques Morali","edited_by":"John F. Burnett","Release":"By the time of the film's release during the summer of 1980, the disco genre had not only peaked in the United States but also was experiencing a backlash there. (During the production, Carr, suspecting that something like that might happen, as it did, had already changed the film's title from the original Discoland--Where The Music Never Ends! The eventual title of Can't Stop The Music was an homage to Jacques Morali's Can't Stop Productions.) The film received scathing reviews and audiences stayed away. The soundtrack album was better received, going top 10 in the UK. The film did well in Australia, where the world premiere preview was shown at the Paramount Theatre, Sydney on June 1, 1980. The after party was held at Maxy's. At a cost estimated at $20 million, the film was a colossal failure financially, bringing in only a tenth of that in gross revenue,[8] and is considered one of the reasons for the downfall of AFD.\"Our timing was wrong, and in this business, timing is everything,\" wrote Lew Grade who invested in the movie.[9]Carr's next film, Grease 2, brought in more than twice as much on its opening weekend as this film grossed in its entire run. Even though it was considered a failure, Grease 2 nearly made back its investment in the U.S. gross alone.[10]Since its initial failure, the film has gained something of a cult status as a camp film. Released on DVD in 2002, the film has been screened at gay film festivals, including the 2008 London Lesbian and Gay Film Festival, and is an annual New Year's tradition on Australian television.[11]Baskin-Robbins Ice Cream sold a flavor called \"Can't Stop the Nuts\" as part of the promotion of the film.[5]","written_by":"Allan Carr|Bronté Woodard|","budget":"$20 million"}