{"country":"United Kingdom|United States|","distributed_by":"United Artists","Plot":"King Acrisius of Argos (Donald Houston) imprisons his daughter Danaë (Vida Taylor), jealous of her beauty. When the god Zeus (Laurence Olivier) impregnates her, Acrisius sends his daughter and his newborn grandson Perseus to sea in a wooden chest. In retribution, Zeus kills Acrisius and orders Poseidon (Jack Gwillim) to release the last of the Titans, a gigantic sea monster called the Kraken, to destroy Argos. Meanwhile, Danaë and Perseus safely float to the island of Seriphos, where Perseus grows to adulthood.Calibos (Neil McCarthy), son of the sea goddess Thetis (Maggie Smith), is a young man engaged to marry Princess Andromeda (Judi Bowker), the daughter of Queen Cassiopeia (Siân Phillips) and heir to the rich city of Joppa; but for committing several atrocities against Zeus, including hunting and destroying Zeus's sacred flying horses (excepting only Pegasus), Zeus transforms Calibos into a monstrous satyr and he is exiled by his people. In revenge, Thetis transports an adult Perseus (Harry Hamlin) from Seriphos to an abandoned amphitheatre in Joppa, where he is befriended by an elderly poet named Ammon (Burgess Meredith) and learns that Andromeda is under a curse and cannot marry unless her suitor successfully answers a riddle, whose failures are burned at the stake. In order to aid his son, Zeus sends Perseus a god-crafted helmet from Athena (Susan Fleetwood) which makes its wearer invisible, a magical sword from Aphrodite (Ursula Andress), and a shield from Hera (Claire Bloom). Perseus, wearing the helmet, captures Pegasus and follows Andromeda to learn the next riddle. Perseus is nearly killed by Calibos but manages to sever Calibos' hands, losing his helmet in the process.Perseus befriends Thallo (Tim Pigott-Smith) and presents himself as suitor and correctly answers the riddle, presenting the severed hand of Calibos. Perseus wins Andromeda's hand in marriage. Calibos, finding that Thetis cannot act against Perseus, instead demands that she take vengeance on Joppa. At the wedding, Queen Cassiopeia compares Andromeda's beauty to that of Thetis herself, whereupon Thetis demands Andromeda be sacrificed to the Kraken on pain of Joppa's destruction.Perseus seeks a way to defeat the Kraken, while Pegasus is captured by Calibos and his men. Zeus commands Athena to give Perseus her owl Bubo; but she orders Hephaestus (Pat Roach) to build a golden replica of Bubo instead, who leads Perseus to the Stygian Witches (Flora Robson, Anna Manahan, and Freda Jackson). By taking their magic eye Perseus forces them to reveal that the only way to defeat the Kraken is by using the head of Medusa the Gorgon, who lives on an island in the River Styx at the edge of the Underworld. The next day, the group continues on their journey without Andromeda and Ammon, who return to Joppa.On the Gorgon's island with three soldiers by his side, Perseus fights Medusa's guardian, a two-headed dog named Dioskilos, who kills one of his companions but Perseus intervenes in the nick of time and kills the beast. Perseus leads his two remaining allies into the Gorgon's lair. His two other companions die on encounter with Medusa herself; she shoots one of the soldiers with an arrow and turns the other to stone. Perseus uses the reflective underside of his shield to deceive Medusa, decapitates her, and collects her head; but the shield is dissolved by her caustic blood. As Perseus and his party set to return, Calibos enters their camp and punctures the cloak carrying Medusa's head, causing her blood to spill and produce three giant scorpions called Scorpiochs. The scorpions attack and Thallo is able to kill one of them, but he is killed by Calibos himself. Perseus slays the other two scorpions and thereafter kills Calibos and grieves Thallo's death.Weakened by his struggle, Perseus sends Bubo to rescue Pegasus, who is being held prisoner by Calibos' henchmen. Bubo succeeds in his task and manages to destroy Calibos' camp as well. Perseus reaches the amphitheatre in Joppa, but collapses unconscious from exhaustion. Andromeda is shackled to the sea cliffs outside Joppa, and the Kraken itself is summoned. Bubo diverts the Kraken's attention until Perseus, whose strength was secretly re-restored by Zeus before the Kraken was released, appears on Pegasus. In the subsequent battle, Perseus petrifies the Kraken with Medusa's head, causing it to crumble to pieces. He then tosses the head into the sea, frees Andromeda, and marries her.The gods predict that Perseus and Andromeda will live happily, rule wisely, and produce children, and Zeus forbids the other gods to pursue vengeance against them. The constellations of Perseus, Andromeda, Pegasus, and Cassiopeia are created in their honor.","Locations":"The karst area in El Torcal de Antequera, Spain appears in the visit to the Stygian witches.The Azure Window in Gozo, Malta, appears in the battle against the Kraken.Other locations include:","language":"English","Reception":"Clash of the Titans was released on June 12, 1981. By the time it finished its theatrical run, it had grossed $41,000,000 in North America.[5] The film has a 66% \"fresh\" rating on Rotten Tomatoes.[6] In a book published in 2000, Stephen R. Wilk suggested that \"most people today who are aware of the story of Perseus and Medusa owe their knowledge to the 1981 film Clash of the Titans.\"[7]The film's distribution rights were transferred to Warner Bros. in 1996.","box_office":"$41 million (North America)","clash_of_the_titans":"Film poster by Brothers Hildebrandt","Remake":"Warner Bros., the current rights holder of this film (which sister company Turner Entertainment acquired from MGM as part of their pre-1986 film library in 1986), produced a remake that was released in 3-D on 2 April 2010.[3][4] Directed by Louis Leterrier, it stars Sam Worthington as Perseus, Alexa Davalos as Andromeda, and Liam Neeson as Zeus.[10][11][12]Bubo, Athena's mechanical owl in the original film, makes a cameo appearance in the 2010 remake and its 2012 sequel, Wrath of the Titans.Starting in 2007, comic publisher Bluewater Productions has released follow-up sequels to Clash of the Titans, authorized by Ray Harryhausen, entitled Wrath of the Titans.","cinematography":"Ted Moore","production_company":"Metro-Goldwyn-Mayer","directed_by":"Desmond Davis","release_dates":"June 12, 1981 (1981-06-12)|||||","Production":"In 1978, Andor Films submitted a copy of the script to the British Board of Film Classification, seeking advice on how to secure either a \"U\" or an \"A\" certificate. The draft script included scenes which the BBFC considered would not be acceptable under those certificates, including the Kraken tearing Pegasus to pieces and Andromeda being naked during the climax of the film. Changes to the script and, on submission, some cuts to Perseus' final battle with Calibos were made and the film secured the \"A\" certificate: \"Those aged 5 and older admitted, but not recommended for children under 14 years of age\".[8]Ray Harryhausen used the special effects technique of stop motion animation to create the various creatures in Clash of the Titans. Harryhausen was also co-producer of the film, and retired from filmmaking shortly after the movie was released, making this his last main feature film. Despite the mechanical owl Bubo's similarities to the droid R2-D2 of the 1977 film Star Wars, Harryhausen claimed that Bubo was created before Star Wars was released.[9] The BBFC, reviewing the film for certification in 1981, said that Harryhausen's effects were well done and would give entertainment to audiences of all ages, but might appear a little \"old hat\" to those familiar with Star Wars and Superman.[8]Stars Harry Hamlin and Ursula Andress were romantically involved at the time of production. Their son, Dimitri, was born in 1980 after filming was completed, and their relationship ended in 1982.Jack Gwillim, who appeared as Poseidon, had earlier played the role of King Aeëtes in the original Jason and the Argonauts in 1963.The film's screenwriter, Beverley Cross, was married to Maggie Smith, who played Thetis, until his death in 1998. Cross worked with producer Charles H. Schneer before, writing the screenplay for Schneer's production of Jason and the Argonauts.","produced_by":"Ray Harryhausen|Charles H. Schneer|","starring":"Harry Hamlin|Laurence Olivier|Judi Bowker|Maggie Smith|Burgess Meredith|","running_time":"118 minutes","music_by":"Laurence Rosenthal","edited_by":"Timothy Gee","written_by":"Beverley Cross","budget":"$15 million"}