{"country":"France Austria Brazil United Kingdom","distributed_by":"Magnolia Pictures","screenplay_by":"Peter Morgan","Plot":"360 centers on the stories of a group of people from different social backgrounds through their intertwining relationships.Anna (Gabriela Marcinková) accompanies her sister to a photo-shoot, where her older sister Mirka (Lucia Siposová) is photographed nude by Rocco (Johannes Krisch), for an escort services website. Anna is hesitant about what Mirka is doing but goes along with it. There is a voiceover talking about how choices bring one to their current place in life. Rocco persuades Mirka to change her name into a more professional one, to which she chooses Blanca. While taking photos, Rocco tells Mirka how one of the girls got rich just the other day when she found out a client had lots of money with him and called Rocco. Rocco came and took the money, killing the client and splitting the cash with the girl. Mirka asks Rocco when her picture will be up on the site and he tells her there are lots of girls and that it could happen sooner. Mirka looks at Anna and tells her to wait downstairs. Unhappily, Anna complies. Later, Mirka comes down and they silently walk to the bus terminal. They return home on a bus to Bratislava where Anna comments on how Mirka should work more on her English. Rocco calls Mirka and tells her she will meet a client named Michael Daly (Jude Law) in Vienna the next day. She goes to Vienna, in the company of Anna and enters the restaurant of a hotel to meet her client. However, one of Michael's business associates looks on his phone to find out if she is a prostitute and start debating loudly whether she has been stood up by her client. Michael pretends to not know her and leaves. He goes to a small restaurant and calls his wife, leaving her multiple affectionate voice messages. Back in his hotel room, he receives a call from his business associate, who informs him that he talked to Blanca, and found out about Michael having ordered her, and blackmails him into accepting a business deal.An Algerian man (Jamel Debbouze) spies on a woman wearing a red beret since leaving her home and on her way to the airport. It is clear that he has feelings for the mysterious woman but can't express how he feels. The next scene shows him talking to an imam about his feelings for the woman, and he further pursues her despite knowing that she is already married. He then goes to his mosque and also to a therapist and asks for advice on what to do about his life.Rose (Rachel Weisz) strolls around the streets, unaware that a seemingly distraught woman is taking pictures of her. It turns out that Rose is headed to a hotel and meets up with a man named Rui (Juliano Cazarre) she is having an affair with. Although she tells him they must end the affair, Rose is still affected by his charm and they end up having sex. After the encounter, they part ways. Rui goes home to find his girlfriend Laura (Maria Flor), but he is rocked when he finds out she has left him. He opens the computer and watches a video she made for him; it turns out the woman who took pictures of Rose earlier is his girlfriend. Meanwhile, at Rose's house, we learn that she is married to Michael Daly, who had planned the liaison in Vienna. He's come home, and both of them then head out to their daughter's school play that night and tend to her after she forgets her lines. Later in bed, Rose then recalls Michael's voice messages the previous night, saying that he misses her and that he wished she could be there with him. He tells her that his next trip will probably be to Berlin. Rose exclaims that she has never been to Berlin and would love to go.Sex offender Tyler (Ben Foster) is being released after being imprisoned for six years, and is afraid he's not ready to face life in the outside world due to his temptations. Meanwhile, Laura boards a flight back to Brazil and gets to know an elderly man sitting next to her named John (Anthony Hopkins) who is searching for his missing daughter who ran away many years ago. They are both stranded in Denver due to bad weather. Meanwhile, Tyler speaks on the phone with the social worker about his stressful situation outside and how he could not control himself from his attraction. He and Laura bump into each other when Laura inadvertently sits at his table in a restaurant at the airport. However, they start a conversation when the drinks she has ordered for her and John are served. Laura seems attracted to Tyler and ends up offering him to stay with her in her hotel room. The intoxicated Laura then makes sexual advances toward him and asks him to kiss her. Instead Tyler controls himself and rebuffs her, locking himself in the bathroom.The next day, John finds Laura who is about to board her connecting flight. They both tell how it was a pleasure meeting one another. Laura hugs John in a daughterly manner, which affects him. John arrives in Phoenix to examine in the morgue the unidentified remains which could be his daughter, but it turns out to be someone else. John later says in an AA meeting how he can finally accept his daughter's fate, whatever that might have been, and is willing to move on and let go. Next, a foreign woman named Valentina (Dinara Drukarova), just visiting Phoenix, shares her own story, where we learn that she was the same woman the Algerian man spied on back in Paris (unbeknownst to her). She speaks about her husband, Sergei, who is too consumed with his job working for a crooked Russian businessman, to love her anymore. She says that she will plan to divorce him. She has feelings for another, her boss, and she is secretly in love with.Valentina goes back home to her career-driven Russian husband named Sergei (Vladimir Vdovichenkov) where she informs him she wants a divorce and how she is interested in someone else, but Sergei ignores her complaint and leaves. He drives away towards Vienna while Valentina prepares herself to look attractive, then goes to work in a dental clinic. Her boss, the Algerian man, is the dentist. He is quite nervous around her, making clumsy mistakes and errors. It's clear they both have feelings for each other, but they repress them. He then talks to her privately and, without telling her why, he suggests it would be better if she looked for another job. Valentina is confused and sad, but leaves nonetheless and is seen walking away, without the red beret this time, her boss watching her from the window.Sergei fetches his boss from the airport and is treated harshly by him. His boss reprimands him when he learns he is learning English and states that it's irrelevant. Mirka and Anna are also riding a bus going to Vienna for another client of Mirka. Sergei stops Mirka on the street in front of the hotel and tells her she is here for his boss. He searches her and then tells her to go to the boss' hotel room. While lingering outside, Anna comes across Sergei, and they chat a bit. When it starts to rain he lets her into his boss's car. They start to develop a friendly relationship from their mutual love for books and learning English. Anna then persuades the ill-treated Sergei to drive around the city.Back at the hotel, Mirka lets the boss know his time is up. She offers to stay for more money and he shows her a briefcase full of cash. Remembering Rocco's story from the photo shoot, Mirka texts Rocco while ordering from room service. While having Mirka perform fellatio, Sergei's boss reads Mirka's phone and discovers she has texted someone. Realizing she is involved in robbing him, he knocks Mirka unconscious and calls Sergei. When Sergei picks up his call, his boss tells him to come protect him in the hotel. Rocco and Sergei are in the elevator together and Sergei holds back watching Rocco go to his boss' door. The boss calls Sergei and Sergei tricks his boss into thinking he's at the door when in fact it's Rocco. The boss opens the door and a fight ensues. Sergei then leaves the hotel and picks Anna up and they drive away together, she reading to him. At no time is she aware Sergei was acting as 'enforcer' for his boss. Mirka regains consciousness after the attack, sees both the boss and Rocco on the floor, empties the briefcase of the money, and leaves the hotel. In voiceover, you hear Anna reading a goodbye letter to her sister using the same phrasing as at the beginning of the film.","language":"English German Arabic French Portuguese Russian Slovak","Reception":"360 has received generally negative reviews from critics, as it currently holds a 21% on Rotten Tomatoes based on 73 reviews. Philip French in The Observer (London) concluded \"360 has a gleaming surface and a knowing air, but essentially it reflects the lives of people who spend too much time in planes\".[3] Manohla Dargis in The New York Times says \"There are moments in \"360\" that show what the movie might have been... But the overshooting and overediting here suggest Mr. Meirelles, or maybe the producers, were trying to work around this story, instead of with it.\"[4]","360":"Theatrical release poster","box_office":"$1.7 million[2]","cinematography":"Adriano Goldman","production_company":"BBC Films The UK Film Council ORF Unison Films Gravity Pictures Hero Entertainment Prescience EOS Pictures Wild Bunch Film Location Austria Austrian Film Institute Vienna Film Fund Revolution Dor Film Fidélité Films O2 Filmes Muse Productions","directed_by":"Fernando Meirelles","release_dates":"12 September 2011 (2011-09-12) (TIFF)|25 July 2012 (2012-07-25) (France)|3 August 2012 (2012-08-03) (U.S.)|10 August 2012 (2012-08-10) (UK)||","Production":"The film reunited Weisz and director Meirelles, who worked together on The Constant Gardener (2005).The film follows the stories of couples and their sexual encounters, and was written by Frost/Nixon screenwriter Peter Morgan. It is a loose adaptation of La Ronde.","produced_by":"Andrew Eaton David Linde Emanuel Michael Danny Krausz Chris Hanley Olivier Delbosc Marc Missonnier","starring":"Lucia Siposova Gabriela Marcinkova Johannes Krisch Jude Law Moritz Bleibtreu Jamel Debbouze Dinara Drukarova Vladimir Vdovichenkov Rachel Weisz Juliano Cazarre Maria Flor Ben Foster Marianne Jean-Baptiste Anthony Hopkins Mark Ivanir","running_time":"110 minutes[1]","Ending":"The closing scenes have Michael Daly walking on a Berlin street with his business associate, as he professes his love for his wife, whom they meet. After an affectionate kiss, Michael and his wife head to the airport arm in arm . As the couple walk away, the associate then notices a very attractive woman walk by and go into a building. She is meeting up with Rocco for a photo shoot.","edited_by":"Daniel Rezende"}