{"based_on":"The Bell Witch: An American Haunting  by Brent Monahan","country":"United Kingdom Canada Romania United States","distributed_by":"Redbus Film Distribution (UK) Odeon Films (Canada) Freestyle Releasing (US)","screenplay_by":"Courtney Solomon","Plot":"It is modern day and a young girl is running through the forest and runs into her house, trying to get away from something. It turns out it was just a dream that the young girl was having. Her mother comes in to remind her that she is going to go and stay with her father for the weekend.Later, the divorced mother finds an old binder of letters from the 19th century. The letters are from a previous occupant of the house. The film switches to the early 19th century, focusing on a village that used to stand around the house, and the story of the Bell Witch is told.John Bell is taken to church court, guilty of stealing a woman's land. The church lets him go because the loss of his honor is good enough. The offended woman, Kate Batts, who is infamous in the village over claims of witchcraft, hints that she means ill to him and his daughter, Betsy.Soon, strange things start happening and John believes that Batts has cursed him. Betsy starts to look very sick and the haunting gets worse. She falls asleep in school, and her attitude towards people changes and she becomes very irritable. Her young teacher, Richard Powell notices the changes in her behavior. When the Bell family tells him of the events going on and that they are being caused by a spirit, he goes on to try to prove to them that that cannot be the case, as spirits are not real. Richard stays in the Bell's home, observing Betsy's behavior to try to prove to them that it is not supernatural. He is proved wrong, when he witnesses Betsy dangling off of the floor, as if someone is holding her up by her hair. Through the movie, it is implied that Richard is in love with Betsy.Later, Betsy is raped by the spirit. John begins to get sick and sees ghosts as well. He goes insane and asks Batts to kill him but she refuses, telling him he cursed himself. John attempts suicide unsuccessfully.Betsy finally has a revelation: the attacks on her and her father are caused by a supernatural being who was born out of her innocence and the reason for them are so she can \"remember\". She needed to remember that the true cause of her pain was that her father has sexually abused her. Lucy, Betsy's mother, has the same revelation, as she had witnessed the assault herself. Both had apparently repressed the incident. Betsy poisons her sick bed-ridden father with medicine while her mother watches. Betsy is then seen at her father's grave, and the narrator says that Betsy was never haunted from that point forward.The story then returns to present day, where the mother has been reading the journal. Her daughter comes, saying that her father has come to take her for a weekend stay with him. She sends her daughter to her ex-husband, who is waiting outside. Betsy's apparition suddenly appears and cries \"Help her!\" The mother suddenly realizes that Betsy is trying to warn her that something is amiss between her daughter and her ex-husband.She runs out of her house, only to catch a glimpse of her daughter's worried face out of the passenger side window of the car as she and her father drive away; it is implied that the father has already started sexually abusing her. The film ends with the mother running after the father's car.","language":"English","an_american_haunting":"Theatrical release poster","Critical reception":"An American Haunting was panned by critics, holding a 38/100 rating on Metacritic, indicating \"generally unfavorable reviews\".[3] Rotten Tomatoes reports a 12% rating from 68 reviews; the consensus states: \"Well, it looks good. But wasn't it supposed to be scary?\"[4]","box_office":"$29,612,137[2]","cinematography":"Adrian Biddle","production_company":"After Dark Films Remstar Productions MediaPro Studios","directed_by":"Courtney Solomon","release_dates":"November 5, 2005 (2005-11-05) (AFI Film Festival)|April 14, 2006 (2006-04-14) (United Kingdom)|May 5, 2006 (2006-05-05) (United States)|||","produced_by":"Courtney Solomon Christopher Milburn André Rouleau Executive: Maxime Rémillard Allan Zeman","starring":"Donald Sutherland Sissy Spacek James D'Arcy Rachel Hurd-Wood","running_time":"90 minutes[1]","music_by":"Caine Davidson","edited_by":"Richard Comeau","budget":"$14 million"}