{"country":"United States","distributed_by":"Columbia Pictures","Plot":"A year after the events of the first film, Mitch Robbins (Billy Crystal) is a much happier and livelier man, having moved out of the city and become station manager at the radio station where he works, where he has employed his best friend, Phil Berquist (Daniel Stern). However, he is being plagued with nightmares about his deceased friend, Curly, and comes to believe that he may still be alive. On his 40th birthday, Mitch sees a man resembling Curly on the train, which does nothing to placate his worries, and later finds a treasure map belonging to Lincoln Washburn hidden in Curly's old hat, albeit with a missing corner. He and Phil investigate the contents of the map in the library and learn that Lincoln Washburn, Curly's father, was a train robber in the Old West and in 1908 infamously stole and hid one million dollars in gold bullion in the deserts near Las Vegas. With an impending trip to there for a convention, Mitch decides to venture out to find the gold (which would now be worth twenty million) along with Phil and his estranged younger brother, Glen (Jon Lovitz).Several mishaps ensue, such as Glen accidentally burning a hole in the map with a magnifying glass, Mitch almost falling off a cliff while retrieving it and Phil believing he was bitten by a rattlesnake while he actually sat on a cactus. They are ambushed by the two cowboys who they bought their supplies from, who demand the map, since Phil recklessly told them all about the gold. Just as they are poised to kill them, a man appears and fights them off. He introduces himself as Duke (Jack Palance), Curly's identical twin brother, and explains that long ago, his father had plans to find the gold with his sons once he was no longer being monitored, but he died before. On her death bed, their mother gave Curly the map, and he contacted Duke to find him so that they could find the gold together, but he died on the cattle drive. Duke learned from Cookie that Mitch had Curly's belongings, and so sought him out, though he believed he was Curly. Though Duke is prepared to take the map and find the gold by himself, Mitch chastises him for his attitude, reasoning that Curly would not approve. Out of respect for Curly, Duke relents and allows the others to accompany him and share the gold.A reckless act by Mitch causes a stampede in which the map and almost all their supplies are lost. Thanks to Glen's memory, they are able to press on and find the location of the cave where the gold is hidden. They eventually find it, but are confronted by two armed cowboys also seeking it. In the ensuing fight, Glen is shot and apparently killed, but Duke discovers the bullets to be blanks with red paint. At that moment, Clay Stone (Noble Willingham), the organizer of the cattle drive, appears along with some of their old friends, such as Ira and Barry Shalowitz. Clay explains that the cowboys are his sons and he has been looking for Duke for some time. Having left the cattle business, he is now making a living taking men on a trip to find the gold, which is revealed to be lead painted with that color. Though Mitch, Phil, and Glen feel lost, Duke remains convinced that the gold is out there somewhere, and stays behind as the others return to Las Vegas.However, Mitch is visited by Duke in his hotel room, who reveals that the entire time, he knew where the gold truly was and intended to keep it all for himself, but couldn't bring himself to do so. He also reveals to Mitch that the one thing he had to find out for himself is honesty. Through Mitch's skepticism, Duke reveals that he had the missing corner of the map, which points to where Lincoln reburied the gold in 1909, and presents a bar of it to Mitch as a gift. He tries to scratch the gold off with a knife, and screams in joy upon realizing that it is real after all.","city_slickers_ii:_the_legend_of_curly's_gold":"Theatrical release poster","language":"English","Reception":"The film gained a negative reception[3][4][5] and debuted at No. 3.[6]","box_office":"$43,622,150","cinematography":"Adrian Biddle","production_company":"Castle Rock Entertainment","directed_by":"Paul Weiland","release_dates":"June 10, 1994 (1994-06-10)|||||","produced_by":"Billy Crystal","starring":"Billy Crystal Daniel Stern Jon Lovitz Jack Palance Patricia Wettig","running_time":"116 minutes","music_by":"Marc Shaiman","edited_by":"William M. Anderson Armen Minasian","written_by":"Billy Crystal Lowell Ganz Babaloo Mandel","budget":"$40 million[1]"}