{"distributed_by":"Warner Bros.","Plot":"Amy Post (Field) is a $20-a-trick hooker in Mobile, Alabama. One night she entertains Elmore Pratt (Jones), an ex-boxer who has just been fired from his job at a car wash. He cannot pay her for services rendered.Pratt punches a plainclothes police officer. He and the prostitute drive away together, intending to head for California, bickering along the way.","back_roads":"DVD release cover","language":"English","Reception":"In his March 13, 1981 New York Times review, critic Vincent Canby wrote that there \"seems to be a real rapport\" between the two actors. Canby described the film as \"extremely appealing and occasionally gutsy and very funny.\"[3] Other reviewers were less kind. Roger Ebert of the Chicago Sun-Times considered the movie formulaic and \"heavily laden with schtick\", giving the film two stars on a scale of four, although he did comment that Field \"gives a performance that cannot be faulted.\"[4] He considered Back Roads a \"less-than-successful\" effort by director Ritt.[5]David Keith, Michael V. Gazzo and Barbara Babcock were also in the cast.","box_office":"$11.8 million[1]","cinematography":"John A. Alonzo","production_company":"CBS Theatrical Films","directed_by":"Martin Ritt","release_dates":"March 13, 1981 (1981-03-13)","Production":"Field and Jones disliked one another intensely during filming.[2] Ritt said that he regretted not being able to make this film work, blaming its failure on both the script and the stars' inability to get along.[citation needed] In her January 29, 2013 appearance on The Ellen DeGeneres Show, Field said that she and Jones reconciled many years later when he approached her at an event and apologized for the on-set clashes. They then went on to co-star in the 2012 film, Lincoln, for which they both received Academy Award nominations for their supporting roles.","produced_by":"Ronald Shedlo","starring":"Sally Field Tommy Lee Jones","running_time":"90 minutes","music_by":"Henry Mancini","External links":"","edited_by":"Sidney Levin","written_by":"Gary Devore"}