{"country":"United States","distributed_by":"Cannon Films (Original Distributor) CBS/Paramount Television (Television Distributor) Metro-Goldwyn-Mayer (Current U.S. Distributor/VHS and DVD Releases)","Plot":"Paul Kersey (Charles Bronson) has come back to East New York after being banned since the events of the first film to visit his Korean War buddy Charley, who is attacked by a gang in his apartment. The neighbors hear commotion and call the police. Paul arrives as Charley collapses dead in his arms. The police mistakenly arrest Paul for the murder. At the police station, Inspector Richard Shriker (Ed Lauter) recognizes Paul as \"Mr. Vigilante\". Shriker lays down the law before Paul is taken to a holding cell. In the same cell is Manny Fraker (Gavan O'Herlihy), leader of the gang who attacked and killed Charley. He and Paul fight. When he is released, Manny threatens Paul. Manny arrives on his “gang turf” and slashes fellow gang member Hector (David Crean), possibly for betrayal. The police receive daily reports about the increased rate of crime. Shriker offers a deal to Paul—to kill all the punks he wants, as long as he informs Shriker of any gang activity he hears about so the police can get a bust and make news.Paul moves into Charley's apartment in a gang-turf war zone. The building is populated by elderly tenants terrified of Manny's gang. They include Bennett Cross (Martin Balsam), a World War II veteran and Charley’s good buddy, plus Mr. and Mrs. Kaprov, an elderly Jewish couple, and a young Hispanic couple, Rodriguez (Joseph Gonzalez) and his wife Maria (Marina Sirtis). After a few violent muggings, Kersey goes into action. He buys a used car as bait. When two gang members try to break into the car, Kersey shoots them with a .38 Colt Cobra revolver. Kersey twice protects Maria from the gang, but is unable to save her a third time. She is assaulted and raped, later dying in hospital from her injuries.Kersey orders a new gun, a .475 Wildey Magnum. He spends the afternoon with Bennett handloading ammunition for it. He then tests the gun when The Giggler (Kirk Taylor) steals his camera. Paul is applauded by the neighborhood as Shriker and the police take the credit. Kersey also throws a gang member off a roof. A possible love interest develops with public defender Kathryn Davis (Deborah Raffin). She is moving out of the city and Kersey offers to take her to dinner. While waiting in his car, Kathryn is knocked unconscious by Manny and the car is pushed into oncoming traffic. It slams into another car and explodes, killing Kathryn. (After a slight variation in Death Wish II, this re-establishes the murder of Kersey's love interest by gang members as a firm series tradition).Shriker places Kersey under protective custody, fearing he is in too deep. Bennett takes matters into his hands with a German MG-42. After his taxi shop is blown up, he tries to get even but his gun jams. The gang cripples Bennett. Kersey is taken by Shriker to the hospital, where he escapes after Bennett tells him where to find a .30 Browning M1919 machine gun. Kersey and Rodriguez collect weapons. They proceed to mow down many of the criminals before running out of ammo. Other neighbors begin fighting back as Manny sends in more reinforcements.Shriker decides to help and he and Kersey take down much of the gang together. Kersey goes back to the apartment to collect more ammo, but Manny finds him there. Shriker arrives just in time and shoots Manny, who falls to the floor, apparently dead. Shriker is wounded in the arm (but his life is saved by a bulletproof vest). As Kersey calls for an ambulance, Manny rises (he was also wearing a bulletproof vest) and turns his gun on the two men. As Shriker distracts him, Kersey uses a mail-ordered M72 LAW rocket launcher to obliterate Manny. As Manny's girlfriend screams in horror, what remains of the gang rush to the scene and see Manny's smoldering remains. One of the other gang members attempts to retaliate, but Manny's girlfriend stops him. Surrounded by the angry crowds of neighbors ready to fight back even more, the gang realizes they've lost and flee the scene. As the neighbors cheer in celebration and with police sirens in the distance, Shriker gives Kersey a head start. Kersey gives a look of appreciation and takes off.In his introduction to the Audible audio-book of \"The Saint Intervenes\", Brad Mengel states that the plot of Death Wish 3 is entirely based on \"The Saint in New York\", both by Lesley Charteris.","language":"English","death_wish_3":"Theatrical release poster","box_office":"$16,116,878 (US)[3]","cinematography":"John Stanier","directed_by":"Michael Winner","release_dates":"November 1, 1985","Production":"Following the success of Death Wish II, Cannon Films had proceeded in signing film contracts with prestigious actors and directors. Financially, their most reliable product were formulaic action films starring Charles Bronson, Chuck Norris, and other stars of the genre. [4] The new sequel to Death Wish was announced at the 1984 Cannes Film Festival. [4] Bronson was paid $1.5 million out of the $10 million budget.[2]The concept of Paul Kersey facing a street gang which terrorizes elderly citizens was developed by screenwriter Don Jakoby. Jakoby specialized in science fiction films, having developed scripts for other upcoming films such as Lifeforce (1985) and Invaders from Mars (1986). His screenplay reportedly turned Kersey into an urban version of John Rambo, displeasing Bronson in the process. [4] The producers then tasked Gail Morgan Hickman to write other potential versions of the script. Hickman came up with three different script samples and submitted them for approval. He learned weeks later that they were all rejected in favor of keeping Jakoby's version. He considered the whole process a waste of time. [4]Once again, director Michael Winner was recruited for the film project. His latest films, The Wicked Lady (1983) and Scream for Help (1984), were box office flops and Winner was in need of a \"surefire hit\". [4] He decided against retaining the grim tone of the previous two Death Wish films, in favor of going gung-ho for the third film. [4]Bronson said the film was \"nearly the same as the first two Death Wishes that came before except this time he's not alone... It is a very violent picture but it all falls within the category of the story.\" Bronson did add however that \"there are men on motorbikes, an element that's threatening - throwing bottles and that sort of thing - and I machine gun them. That to me is excessive violence and is unnecessary.\"[5]Filming started on April 19, 1985 in a \"crime-infested\" area of Brooklyn. Other New York locations used for the film included the Queensboro Bridge, the bus terminal of Manhattan's Port Authority, and Long Island. [4] In early May, the production team moved to London. Winner found it useful that both cities had a lot of Victorian buildings. The police station scenes were filmed at St Thomas' Hospital in Lambeth. The neighborhood used for the gang war of the film was in Brixton, a district which was infested with real-life gangs. [4] Cinematographer John Stanier was previously director of photography in Oxford Blues (1984) and The Dirty Dozen: Next Mission (1985). He would subsequently film Rambo III (1988). [4]The film includes a scene involving punks attempting to rape a black, topless woman. She was the only black rape victim in the film series. The role was played by Sandy Grizzle, the then-lover of the director. She would subsequently report of this relationship in the tabloids Daily Star and News of the World. She claimed that Winner whipped her and used her as a sex slave. [4]The screenplay included a male-on-male prison rape in its early scenes. It was rejected and never filmed, but a similar scene was later included in another Bronson film, Kinjite: Forbidden Subjects (1989).[4] There were several other cut scenes. Don Jakoby objected to extensive rewrites of his script and asked for his name to be removed from the credits. The film used the false name \"Michael Edmonds\" to credit its screenwriter. [4]The film incorporated two elements of the Death Wish (1972) by Brian Garfield. The first was the concept of a giggling Puerto Rican thug, the second was the deliberate use of a car as bait for thieves. [4] A scheduled novelization of the film was cancelled, since Garfield retained the exclusive right to write sequel novels. [4]According to the book 'Bronson's Loose' by Paul Talbot, the original working title \"Death Wish III\" was changed to \"Death Wish 3\" because the Cannon Group conducted a survey and found that nearly half of the U.S. population could not read Roman numerals.[6]Even though Death Wish 3 takes place in New York City, some parts of the film were shot in London to make the production less expensive.[2]As a result, some of the extras (both police and gang members) were British. When filming was complete, Michael Winner solicited the help of U.S. Air Force military personnel stationed at High Wycombe Air Station in the UK to provide dubbing with their New York accents for the accents of the British extras. Of the British actors who appeared, Marina Sirtis, had previously worked for Michael Winner on The Wicked Lady (1983). She followed her appearance in this film with landing the role of Deanna Troi on the TV show Star Trek: The Next Generation in 1987.[4]Weapons used in the film include a Wildey .475 caliber handgun, a .38 caliber snubnose revolver, a German WWII MG-42, a Browning .30 machine gun and an anti-tank rocket launcher.Unusually, the end credits don't mention any work done in Britain (although several crew members have the word \"USA\" in brackets next to their titles).Mike Cannon decided to release the film prior to the major holiday movie season. The opening was scheduled for November 2, 1985. The film had a publicity campaign which included advertisements in newspaper and television, and release of poster art. [4] The film earned 16.1 million dollars in a seven-week run. Profits from foreign release, video, and television were sufficient to make this a lucrative release for Cannon films.[4]After its release in theaters, Death Wish 3 received primarily negative reviews, particularly from critics such as Gene Siskel and Roger Ebert. Some lambasted the film for sadistic over-violent content and the fact that a 64-year-old Charles Bronson was thrown into a Rambo-like situation. Leonard Maltin panned the film: \"Same old stuff; Bronson's 'ordinary guy' character is no longer convincing, since his entire immediate family was wiped out by the end of Part 2.[7]In recent years, it has gathered a cult following, possibly due to its over-the-top nature, including lengthy action scenes (particularly the shoot 'em up finale), stylized violence, cheesy dialogue, and memorable one-liners. Its unreality has, in some film cult circles, been seen as \"so bad it's good\", including the inexplicable extra armed only with a plunger[8] While it currently holds an average rating of 5.9 at IMDB,[9] [10] it has a 6% rating on Rotten Tomatoes.[11]","produced_by":"Menahem Golan Yoram Globus","starring":"Charles Bronson|Deborah Raffin|Ed Lauter|Martin Balsam|","running_time":"92 minutes","music_by":"Mike Moran (Electric guitars and synthesizers played by Jimmy Page.)","edited_by":"Arnold Crust","written_by":"Brian Garfield (characters) Don Jakoby as \"Michael Edmonds\" (screenplay)","budget":"$9–10 million[1][2]"}