{"based_on":"The Bad News Bears  by Bill Lancaster","country":"United States","distributed_by":"Paramount Pictures","Critical response":"Bad News Bears received mixed reviews from critics. Review aggregation website Rotten Tomatoes gives the film a score of 48% based on reviews from 158 critics, with an average rating of 5.6/10. The site's critical consensus states, \"This too-faithful remake aims low for laughs, turning off the easily offendable; despite another lovably irascible contribution by Thornton, it lacks the ensemble strength and originality of the 1976 version.\"[4] Metacritic gives the film a score of 65% based on reviews from 35 critics, indicating \"generally favorable reviews\".[5]Roger Ebert of the Chicago Sun-Times gave the film three stars out of four, praising Thornton's performance in particular, saying: \"The movie is like a merger of [Thornton's] ugly drunk in Bad Santa and his football coach in Friday Night Lights, yet [he] doesn't recycle from either movie; he modulates the manic anger of the Santa and the intensity of the coach and produces a morose loser who we like better than he likes himself.\"[6] James Berardinelli of ReelViews also gave Bad News Bears three stars out of four, calling it \"an entertaining motion picture\" that \"won't make fans forget the original, but it's not so feeble that it disappears into the earlier movie's shadow.\"[7]Giving the film two stars out of five, Don R. Lewis of Film Threat said that it has \"a few laughs\" but that it \"just trudges on, going through the motions of the original with no spark\" and that it \"suffer[s] from the unbearable, crushing weight of political correctness.\"[8] Paula Nechak of the Seattle Post-Intelligencer called the film \"simply another in a long line of utterly unnecessary remakes that, having nothing new to say, clutch at crassness and dumbness,\"[9] while Mick LaSalle of the San Francisco Chronicle said that while \"the screenplay [...] makes the most of Thornton's dry, skewed humor, [...] nothing happens here that would distinguish this film from other sports movies.\"[10]","screenplay_by":"Glenn Ficarra|John Requa|","Legacy":"In a case of life imitating art, in 2012, a Los Angeles-area little league in financial difficulty received a donation from the owner of a local strip club in order to continue operating.[11] Comparisons were immediately made to a scene in Bad News Bears in which the team received a donation from \"Bo-Peeps Gentlemen's Club\" and is required to put the logo of the strip club on their uniforms.[12] The real-life club didn't require similar stipulations, preferring to donate in anonymity, however local civic leaders encouraged that the club in question be made public so that they could get the proper recognition they deserved.","Plot":"Morris Buttermaker (Billy Bob Thornton) is a washed-up alcoholic baseball player who was a pitcher for the Seattle Mariners before getting kicked out of professional baseball for attacking an umpire. He works as an exterminator and is a crude womanizer. He coaches the Bears, a children's baseball team with poor playing skills. They play their first game and do not even make an out before he forfeits the game. The entire team decides to quit after but Buttermaker forces them out of quitting and promises to be a better coach.Amanda Whurlitzer (Sammi Kane Kraft), a skilled pitcher, is the 12-year-old daughter of one of his ex-girlfriends. After a couple requests, she decides to join the team. Kelly Leak, a local troublemaker but solid hitter, also joins the team, and the Bears start winning games. The Bears eventually make it to the championship game. In the middle of that game, the Bears and Yankees fight after Amanda is shoved during a play at the plate. A few innings later the Yankees coach Ray Bullock (Greg Kinnear) has his son Joey intentionally walk Mike Engleberg, one of the Bears' best hitters. Instead of walking him, he almost hits Engleberg, causing Ray to push Joey to the ground in anger. As revenge, Joey throws Engleberg an easy pitch which he smacks for a home run and would leave the game with his mother. Later, Buttermaker changes the lineup, putting the benchwarmers in and taking out some of the good players which causes the Bears to fall behind heading into the last half of the inning. With two outs, one of the Bears players, Garo, drives in two runs and tries to score to tie the game but is thrown out at the plate on a close call, causing the Bears to lose the championship 8–7.After the game, Buttermaker gives them non-alcoholic beer, and they spray it all over each other. Although they did not win the championship, they have the satisfaction of trying, knowing that winning is not so important.","bad_news_bears":"Theatrical release poster","language":"English Spanish","box_office":"$34,252,847[2]","cinematography":"Rogier Stoffers","directed_by":"Richard Linklater","release_dates":"July 22, 2005 (2005-07-22)|||||","produced_by":"Richard Linklater|J. Geyer Kosinski|","starring":"Billy Bob Thornton|Greg Kinnear|Marcia Gay Harden|","running_time":"113 minutes[1]","music_by":"Ed Shearmur","edited_by":"Sandra Adair","Release":"Bad News Bears opened on July 22, 2005 and ranked #5 at the North American domestic box office with $11,382,472.[3] The film ultimately earned $32,868,349 in North America and $1,384,498 internationally for a worldwide total of $34,252,847, becoming a box office bomb.[2]","budget":"$35 million[2]"}