{"based_on":"Cendrillon  by Charles Perrault","country":"United States","distributed_by":"RKO Radio Pictures, Inc.","Plot":"Cinderella is the beloved child of a widowed gentleman, a kind and devoted father who feels as though his daughter needs a mother's care. He marries Lady Tremaine, a widow with two daughters of her own: Drizella and Anastasia. After Cinderella's father dies unexpectedly, Lady Tremaine is revealed to be a cruel and selfish woman, only interested in her daughters. Cinderella is humiliated and mistreated by her stepfamily, who take over the estate and ultimately reduce her to being a scullery maid in her own home. Despite this, Cinderella grows into a kind and gentle young woman, befriending the mice and birds who live around the chateau.One day, while Cinderella is preparing breakfast, Lady Tremaine's cat Lucifer chases Gus, one of the mice, into the kitchen. Cinderella delivers breakfast to her stepmother and stepsisters, unaware that Gus is hiding under Anastasia's teacup. This makes Anastasia so angry that she tells her mother of the apparent prank, and Cinderella is punished with extra chores.Meanwhile, at the royal palace, the King discusses with the Grand Duke his desire for his son the Prince to settle down and have children. They organize a ball in an effort to find a suitable wife for the Prince. Cinderella asks her stepmother if she can attend, as the invitation says \"every eligible maiden\" is to attend. Lady Tremaine agrees, provided that Cinderella finishes her chores and finds a nice dress to wear. Cinderella's animal friends, led by Jaq, Gus and the other mice, fix up a gown that belonged to Cinderella's mother using beads and a sash thrown out by Drizella and Anastasia, respectively. When Cinderella comes down wearing her new dress, Lady Tremaine compliments the gown, pointing out the beads and the sash. Angered by the apparent theft of their discarded items, the two stepsisters tear the dress to shreds.Just as Cinderella is about to give up hope, her Fairy Godmother appears and turns the remains of Cinderella's dress with her magic wand into a white ball gown with glass slippers. She also transforms a pumpkin into a carriage, the mice into horses, her horse Major into a coachman, and her dog Bruno into a footman. The Fairy Godmother warns her the spell will break at the stroke of midnight. At the ball, the Prince rejects every girl until he sees Cinderella. The two fall in love and dance alone throughout the castle grounds until the clock starts to chime midnight. Cinderella flees to her coach and away from the castle, losing one of her glass slippers in the process. After her gown turns back into rags, the mice point out that the other slipper is still on her foot. The Grand Duke informs the King of Cinderella's escape and presents the slipper as their only piece of evidence. The King orders the Grand Duke to visit every house in the kingdom to find Cinderella, issuing a royal proclamation that she will then marry the Prince.When news reaches Cinderella's household, her stepfamily prepare for the Duke's arrival. Overhearing this, Cinderella dreamingly hums the waltz played at the ball. Realizing Cinderella was the girl who danced with the Prince, Lady Tremaine locks her in the attic. When the Duke arrives, Jaq and Gus steal the key to Cinderella's room, but Lucifer ambushes them before they can free her. With the help of the other animals and Bruno, they chase him out of the house and Cinderella is freed. As the Duke prepares to leave after the stepsisters have tried to force their enormous feet into the slipper, Cinderella appears and requests to try it on. Knowing the slipper will fit, Lady Tremaine trips the footman, causing him to drop the slipper, which shatters on the floor. Cinderella then produces the other glass slipper, much to her stepmother's horror. A delighted Duke slides the slipper onto her foot, and it fits perfectly.Cinderella and the Prince celebrate their wedding and live happily ever after.","language":"English","box_office":"$263.6 million[5]","production_company":"Walt Disney Productions","directed_by":"Clyde Geronimi|Hamilton Luske|Wilfred Jackson|","narrated_by":"Betty Lou Gerson","release_dates":"February 15, 1950 (1950-02-15) (Boston)[3]|March 4, 1950 (1950-03-04) (US)[3]||||","Production":"Made on the cusp between the classic \"golden age\" Disney animations of the 1930s and 1940s and the less critically acclaimed productions of the 1950s, Cinderella is representative of both eras.Cinderella was the first full-bodied feature produced by the studio since Bambi in 1942; World War II and low box office returns had forced Walt Disney to produce a series of inexpensive package films such as Make Mine Music and Fun and Fancy Free for the 1940s. Live action reference was used extensively to keep animation costs down. According to Laryn Dowel, one of the directing animators of the film, roughly 90% of the film was done in live action model before animation, using basic sets as references for actors and animators alike.Both Helene Stanley (Cinderella's live action model) and Ilene Woods (Cinderella's voice actress, selected from 400 other candidates) heavily influenced Cinderella's styling and mannerisms. Stanley was the live-action model for Anastasia Tremaine as well.[7] She would be so again for Princess Aurora in Sleeping Beauty and Anita Radcliffe in One Hundred and One Dalmatians.[8] Animators modeled Prince Charming on actor Jeffrey Stone, who also provided some additional voices for the film.[9] Mike Douglas was the Prince's singing voice while William Phipps recorded the prince's dialogue (or speaking voice).In earlier drafts of the screenplay, the Prince originally played a larger role and had more character development than what he ultimately received in the final version of the film. In one abandoned opening, the Prince was shown hunting a deer, but at the end of the sequence, it was to be revealed that the Prince and the deer were actually friends playing a game. In an abandoned alternate ending, after the Duke discovered Cinderella's identity, she was shown being brought to the castle to be reintroduced to the Prince, who is surprised to learn that Cinderella was actually a modest servant girl instead of the princess he thought she was, but the Prince's feelings for her were too strong to be bothered by this and he embraced her; the Fairy Godmother was to reappear and restore Cinderella's ball gown for the closing shot. Walt Disney himself reportedly cut the alternate ending because he felt it was overlong and did not give the audience its \"pay off\", but the scene would later be incorporated in the video game, Kingdom Hearts: Birth by Sleep.Other deleted material included an abandoned song that was tentatively titled the \"Cinderella Work Song\", which was part of a fantasy sequence that was set to take place after Lady Tremaine tells Cinderella that she can go to the ball if she finishes all of her chores and has a nice dress to wear. In this abandoned sequence, Cinderella imagines herself being cloned into an army to divide up the work while pondering what the ball itself will be like. The sequence was cut, but the title was applied to the song the mice sing when they work on Cinderella's dress. Additionally, there was a scene that took place after the ball in which Cinderella was seen returning to her home and eavesdropped on her stepfamily, who were ranting about the mystery girl at the ball, and Cinderella was shown to be amused by this because they were talking about her without realizing it. Walt Disney reportedly cut the scene because he thought it made Cinderella look \"spiteful\" and felt the audience would lose sympathy for her.For the first time, Walt turned to Tin Pan Alley songwriters to write the songs. The music of Tin Pan Alley would later become a recurring theme in Disney animation. Cinderella was the first Disney film to have its songs published and copyrighted by the newly created Walt Disney Music Company. Before movie soundtracks became marketable, movie songs had little residual value to the film studio that owned them and were often sold off to established music companies for sheet music publication.The song \"Bibbidi-Bobbidi-Boo\" became a hit single on four occasions, including a cover version recorded by Perry Como and the Fontane Sisters. Woods beat exactly 309 girls for the part of Cinderella, after some demo recordings of her singing a few of the film's songs were presented to Walt Disney. However, she had no idea she was auditioning for the part until Disney contacted her; she initially made the recordings for a few friends who sent them to Disney without her knowledge. Reportedly, Disney thought Woods had the right \"fairy tale\" tone to her voice.Interestingly, almost 30 years before he made \"Cinderella\" into a feature-length animated film, Walt Disney already made a short film of it as the last of the Laugh-O-Gram series, as a Roaring 20's version. This short is included as an extra on the Cinderella Platinum Edition DVD.During production, Walt Disney pioneered the use of overdubbed vocals for the song \"Sing Sweet Nightingale\", before it had been used by artists in studio recordings such as the Beatles. When Ilene Woods had completed the days recording of \"Sing Sweet Nightingale\", Walt listened and asked her if she could sing harmony with herself. She was apprehensive about the idea as it was unheard of; though she ended up singing the double recording, including second and third part harmonies. Ilene Woods reveals the innovation in an interview.[10]The clothes also received considerable attention. A scholar has demonstrated that Salvador Dalí, with whom Disney worked on the short Destino a few months before starting Cinderella, inspired the dress that Cinderella's stepsisters tear apart and that the magic new gown worn by Cinderella at the ball references French haute couture and, more precisely, the style of Christian Dior, who traveled through the U.S. in 1947.[11]On Classic Disney: 60 Years of Musical Magic, this includes \"The Work Song\" and \"A Dream Is a Wish Your Heart Makes\" on the first disc, \"Bibbidi-Bobbidi-Boo\" and \"So This Is Love\" on the second, and \"Oh, Sing Sweet Nightingale\" on the fourth. On Disney's Greatest Hits, \"Bibbidi-Bobbidi-Boo\" is included on the first volume and \"A Dream Is a Wish Your Heart Makes\" on the second volume.The soundtrack for Cinderella was re-released by Walt Disney Records on CD on February 4, 1997 and included a bonus demo.[12] On October 4, 2005 Disney released a special edition of the soundtrack album of Cinderella, for the Platinum Edition DVD release, which includes several demo songs cut from the final film, a new song, and a cover version of \"A Dream is a Wish Your Heart Makes\".[13] The soundtrack was released again on October 2, 2012 and consisted of several lost chords and new recordings of them.[14] A Walmart exclusive limited edition \"Music Box Set\" consisting of the soundtrack without the lost chords or bonus demos, the Song and Story: Cinderella CD and a bonus DVD of Tangled Ever After was released on the same day.[15]All songs written and composed by Mack David, Jerry Livingston, Al Hoffman. All songs written and composed by Mack David, Jerry Livingston, Al Hoffman, except track 12 written and composed by Larry Morey, Charles Wolcott and track 13 written and composed by Jim Brickman, Jack Kugell, Jamie Jones. All songs written and composed by Mack David, Jerry Livingston, Al Hoffman. All songs written and composed by Mack David, Jerry Livingston, Al Hoffman. ","produced_by":"Walt Disney","starring":"Ilene Woods|Eleanor Audley|Verna Felton|Rhoda Williams|James MacDonald|Luis van Rooten|Don Barclay|Mike Douglas|Lucille Bliss|","running_time":"75 minutes[4]","cinderella":"Original theatrical release poster","music_by":"Oliver Wallace (score) Paul J. Smith (score) Mack David (music-words-songs) Jerry Livingston (music-words-songs) Al Hoffman (music-words-songs)","edited_by":"Donald Halliday","Release":"The film was originally released in theaters on February 15, 1950 in Boston, Massachusetts,[3] followed by theatrical re-releases in 1957, 1965, 1973, 1981, and 1987.[16][better source needed] Cinderella also played a limited engagement in select Cinemark Theatres from February 16–18, 2013.[17]It was released on VHS video and laserdisc in 1988 as part of the Walt Disney Classics collection. The release had a promotion with a free lithograph reproduction for those who pre-ordered the video before its release date. In 1995, the film received a Walt Disney Masterpiece Collection video issue, it went back to moritorium in 1996 but later got a DVD release in 1997. Disney then restored and remastered the movie for its October 4, 2005 release as the sixth installment of the Walt Disney Platinum Editions series. According to Studio Briefing, Disney sold 3.2 million copies in its first week and earned over $64 million in sales.[18] The Platinum Edition DVD of the original movie along with its sequels went on moratorium on January 31, 2008. In the United Kingdom and Ireland, a \"Royal Edition\" of Cinderella was released on DVD on April 4, 2011 to celebrate the UK Royal Wedding of Prince William and Catherine Middleton. This release had a unique limited edition number on every slip case and an exclusive art card.[19] Disney released a Diamond Edition in October 2, 2012 in a 3-disc Blu-ray/DVD/Digital Copy Combo, a 2-disc Blu-ray/DVD combo and in a 6-disc \"Jewelry Box Set\" that includes the first film alongside its two sequels. A 1-disc DVD edition was released on November 20, 2012.[20]Cinderella currently has a score of 97% on Rotten Tomatoes. The overview of the film is, \"The rich colors, sweet songs, adorable mice and endearing (if suffering) heroine make Cinderella a nostalgically lovely charmer\".The profits from the film's release, with the additional profits from record sales, music publishing, publications and other merchandise gave Disney the cash flow to finance a slate of productions (animated and live action), establish his own distribution company, enter television production and begin building Disneyland during the decade.Disney had not had a major hit since Snow White and the Seven Dwarfs. The production of this film was regarded as a major gamble on his part. At a cost of nearly $3 million, Disney insiders claimed that if Cinderella failed at the box office, then the Disney studio would have closed (given that the studio was already heavily in debt).[21] The film was a box office success and allowed Disney to carry on producing films throughout the 1950s.[22] It was the 5th most popular movie at the British box office in 1951.[23]The film received three Academy Award nominations for Best Sound (C. O. Slyfield) lost to All About Eve, Best Original Score (Oliver Wallace and Paul J. Smith) lost to Annie Get Your Gun and Best Song for \"Bibbidi-Bobbidi-Boo\" (Mack David, Jerry Livingston, and Al Hoffman) lost to Captain Carey, U.S.A..[24] At the 1st Berlin International Film Festival it won the Golden Bear (Music Film) award and the Big Bronze Plate award.[25]In June 2008, the American Film Institute revealed its \"10 Top 10\"— the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. Cinderella was acknowledged as the 9th greatest film in the animation genre.[26][27]American Film Institute recognition:","written_by":"Ken Anderson|Perce Pearce|Homer Brightman|Winston Hibler|Bill Peet|Erdman Penner|Harry Reeves|Joe Rinaldi|Ted Sears|Maurice Rapf (uncredited)[1][2]|","budget":"$2.9 million[5]"}