{"country":"United States","distributed_by":"Lionsgate","screenplay_by":"Susan Estelle Jansen","story_by":"Adam de la Peña David Eilenberg","Plot":"Four teenage friends named Cloe, Yasmin, Sasha and Jade are about to start high school. Self-centered Meredith Baxter Dimly wants everyone to belong to a clique, and goes about organizing students. She does not like the independent spirit of the four girls and plots to destroy their friendship and make them conform to her pre-fabricated cliques. Cloe is an amazing soccer player. She meets Cameron and is instantly smitten. Sasha is recruited as a cheerleader. Jade joins the science club, meets Dexter and designs great outfits. Yasmin joins journalism, even though her real passion is singing even though she hasn't realized yet. She also feels lonely as her friends are busy with their own cliques. She also meets Dylan who is deaf but can lip read. The friends begin to drift apart as they are compelled to stay within their cliques.Two years later, when an accidental food fight causes them to get detention, they realize that they miss being BFF's and decide to be friends again. They also try to get the other schoolmates to socialize outside their cliques but their attempts fail when Meredith's 2nd Super Sweet 16 party (which ends disastrously) has them seated with their original cliques.The upcoming talent show and its prize of a scholarship gives them the idea to bring all the cliques together again with an act, but the chances are slim with Meredith's constant attempts to steal the spotlight. In the end, there is a tie. Meredith gets the trophy, but the girls get the scholarship, which they later give to Cloe.","language":"English Spanish","Reception":"Bratz was panned by critics and fans alike. On Rotten Tomatoes, gives the film a rating of 9%, based on 77 reviews, with an average rating 3/10. The site's critical consensus, \"Full of mixed messages and dubious role-models, Bratz is too shallow even for its intended audience.\"[5] On Metacritic, the film has a score of 21 out of 100, based on 18 critics, indicating \"generally unfavorable reviews\".[6]It was nominated for 5 Golden Raspberry Awards in 2007, but \"won\" none.Bratz grossed $10 million in North America and $16 million in other territories for a total gross of $26 million.[2]In its opening weekend, the film grossed $4.2 million, finishing in 10th at the box office.","bratz":"Theatrical release poster","box_office":"$26 million[2]","cinematography":"Christian Sebaldt","directed_by":"Sean McNamara","Home media":"The film was released on DVD on November 27, 2007.","Video game":"A video game adaptation of the film entitled Bratz 4 Real was released to the Nintendo DS and Microsoft Windows on November 5, 2007. The game was developed by Barking Lizard Technologies and was published by THQ.The game's plot mirrored that of the film and players are tasked with completing goals and errands in order to progress the story along. The DC version of the game also allowed users to design their own clothes patterns, care for a digital pet, and play various mini-games. The PC edition also utilized mini-games, but excluded the option for players to design clothing or raise a digital pet. In both games users could play as one of the four main characters and view clips from the film.Pocket Gamer heavily criticized the game and stated that it felt that it was released too early and that \"There are some nice ideas at play, in particular where it attempts to break down the social barriers that beset children in secondary education, but as a game it's far too vacuous to recommend.\"[10] IGN shared similar sentiments, writing that \"Bratz 4 Real does some work to recast the shallow, self-absorbed Bratz girls in a more redeeming light, using them and their friendship to tell a tale of unity and breaking down social barriers. But whereas that premise and the game's compelling customization options prove to be solid positive points for this package, Bratz 4 Real is still a game brought down by a variety of other oddities.\"[11]","Soundtrack":"A film soundtrack entitled Bratz: Motion Picture Soundtrack was released on July 31, 2007 through Geffen Records. The soundtrack featured music from artists such as Ashlee Simpson, Dropping Daylight, and the Black Eyed Peas. Three singles were released prior to the album's release, \"Rainy Day\" by Janel Parrish, \"Rockstar\" by Prima J, and \"Fearless\" by Daechelle. The soundtrack was released in the United States and the United Kingdom, as well as Australia, where it featured an additional musical track by the Australian singer and actress Stephanie McIntosh.Sales for the soundtrack were good and the album remained on the Billboard 200 charts for three weeks, peaking during its second week at position 83.[7] Common Sense Media gave the soundtrack three stars, writing that \"With heavy-hitting help from the Black Eyed Peas, The Slumber Party Girls, Ashlee Simpson, Dropping Daylight, and Lifehouse, these young performers gamely negotiate some very ordinary-sounding, preachy material and make the songs sparkle anyway.\"[8]","production_companies":"Crystal Sky Pictures MGA Entertainment Arad Productions","release_dates":"August 3, 2007 (2007-08-03)|||||","Production":"Paula Abdul was dropped from the production before completion. She was originally enlisted to provide wardrobe designs, choreograph the film, executive produce, as well as hold a role in the film. This was revealed on Hey Paula, her reality show on her personal life.The film was shot from February to March 2007 at Santee Education Complex in South Los Angeles, California, while in session.[4]","produced_by":"Isaac Larian Avi Arad Steven Paul","starring":"Nathalia Ramos Skyler Shaye Logan Browning Janel Parrish Chelsea Kane","running_time":"102 minutes[1]","music_by":"John Coda","edited_by":"Jeff Canavan"}