{"country":"United States","distributed_by":"Screen Gems","Plot":"Rich Bower (Power) is a mover and shaker in the world of rap music (he's involved with a number of other licit and illicit business ventures as well), and his apartment is a favored meeting place for musicians, hangers-on, and hipsters who want to seem cool, including a clique of white kids who want to be on the inside of what they consider the coolest scene of the day. Sam (Shields), a filmmaker, is making a documentary about Rich and his circle, with the help of her husband Terry (Downey), a closeted homosexual who doesn't feel at home in this milieu.Dean (Houston) is Rich's friend since childhood and a talented college basketball player. He is offered a deal by a bookmaker, Mark (Stiller) to throw a few games for a price. Dean takes the money against his better judgment, and he soon realizes how much of a mistake he made when Mark turns out to be a cop hoping to dig up dirt on Rich. Rich in turn discovers that Dean might be forced to tell what he knows to stay out of jail, and he decides that Dean has to be killed; however, rather than murder his friend himself, Rich asks one of the white kids who hangs out with him, who seems especially eager to prove himself, to do it for him. The kid, however, is actually the son of the District Attorney.","language":"English","Reception":"Review aggregate Rotten Tomatoes reports that 39% of critics have given the film a positive review based on 80 reviews; the critical consensus states, \"The atmosphere is affecting, and the story, at times, is compelling, but with a lean script and limp direction, Black and White doesn't add up to much.\"[1] Metacritic, which assigns a weighted mean rating out of 100 based on reviews from film critics, the film has a rating score of 47%, aggregating 27 reviews.[2] Roger Ebert gave the film three out of four stars.[3]In the United States, Black and White grossed $5,241,315 in its four week release.[4]","box_office":"$5,541,431","cinematography":"David Ferrara","production_company":"Palm Pictures","directed_by":"James Toback","release_dates":"September 4, 1999 (1999-09-04) (Telluride)|April 5, 2000 (2000-04-05) (United States)||||","Production":"Most of the script was improvised by the cast.[citation needed] Only Claudia Schiffer's part was fully scripted.Because she had not had them done previously, Claudia Schiffer had to have her ears pierced especially for the large hoop earrings worn by her character. In addition to sporting fake dreadlocks, Brooke Shields also wore a nose ring for this film, for which she had her nose temporarily pierced.","black_and_white":"Theatrical release poster","produced_by":"Daniel Bigel Michael Mailer Ron Rotholz","starring":"Robert Downey, Jr. Gaby Hoffmann Allan Houston Jared Leto Method Man Joe Pantoliano Bijou Phillips Oli \"Power\" Grant Raekwon Claudia Schiffer Brooke Shields Scott Caan Mike Tyson Elijah Wood and Ben Stiller","running_time":"98 minutes","music_by":"American Cream Team","edited_by":"Myron Kerstein","written_by":"James Toback","budget":"$12 million"}