{"country":"Hong Kong","distributed_by":"Ocean Shores Video (HK) Miramax Films Rolling Thunder Pictures (US)","Plot":"The film comprises two different stories, told one after the other, each about a romance involving a policeman. Except for a brief moment when the first story ends and the second begins, the two stories do not interconnect. However, the three main characters from the second story each momentarily appear during the first.The first story concerns Taiwan-born cop He Qiwu, also known as Cop 223. Qiwu's girlfriend May broke up with him on 1 April (April Fool's Day). His birthday is 1 May and he chooses to wait for May for a month before moving on. Every day he buys a tin of pineapple with an expiration date of 1 May. By the end of this time, he feels that he will either be rejoined with his love or that it will have expired forever. Meanwhile, a mysterious woman in a blonde wig (played by Brigitte Lin) tries to survive in the drug underworld after a smuggling operation goes sour.On 1 May, Qiwu, looking for romance, approaches the woman in the blonde wig at a bar (the Bottoms Up Club). However, she is exhausted and falls asleep in a hotel room, leaving him to watch old movies alone all night and order take-out food. He shines her shoes before he leaves her sleeping on the bed. She leaves in the morning and shoots the drug baron (played by Thom Baker) who had set her up. Qiwu goes jogging and receives a message from her on his pager wishing him a happy birthday. He then visits his usual snack food store where he collides with a new staff member, Faye. At this point, a new story begins.In the second story, the unnamed Cop 663 is similarly dealing with a breakup, this time with a flight attendant. He meets Faye, the new girl at the snack bar. She secretly falls for him. The flight attendant waits for the cop around the snack bar, and finds out he is on his day off. She leaves a letter for the snack bar owner to give to the cop. Everyone in the snack bar reads the letter, which is assumed to be the flight attendant's way of telling the cop that their relationship is over. The envelope also has a spare set of keys to the cop's apartment.Faye uses the keys to frequently break into his apartment by day to redecorate and \"improve\" his living situation. She finally tells him of the letter but he keeps delaying taking it or even reading it. Gradually, her ploys help him to cheer up, and he eventually realizes that Faye likes him and arranges a date at the restaurant \"California\" (an actual place in Lan Kwai Fong at the time).[4] Faye, however, never shows up for the date, and the snack bar's owner, who is her cousin, goes to the restaurant to tell the cop that Faye left for California. Standing the cop up after a last-minute decision to see the world before settling down, she leaves him a boarding pass drawn on a paper napkin postdated one year later.In the last scene, Faye, now a flight attendant, returns to Hong Kong. She finds that the cop has bought the snack bar and is converting it into a restaurant. He asks her to stay for the grand opening in a couple of days, but she says she does not know if she can. 663 then asks if she can send him a postcard if she leaves, but she says he wouldn't read it anyway. As Faye's about to leave, he gets the boarding pass she gave him a year ago, wrinkled and water-stained, and asks if anyone will accept it. She doubts it and writes him up a new one. Faye asks him where he wants to go with the boarding pass, and 663 says he'll go wherever she wants to take him. Their future remains ambiguous.","language":"Cantonese Mandarin English Japanese Hindi","Reception":"Chungking Express earned HK $7,678,549 during its Hong Kong run.[1] In the USA, opening on four screens, it grossed $32,779 ($8,194 per screen) in its opening weekend. Playing at 20 theatres at its widest point, it went on to gross $600,200 total.During its release in North America, Chungking Express drew generally positive, sometimes ecstatic reviews from critics. On the website Rotten Tomatoes, which collects film reviews, it currently holds a 90% approval rating out of 51 reviews.[9]Influential film critic Roger Ebert gave the film a positive review, but was measured in his praise:[10]\"If you are attentive to the style, if you think about what Wong is doing, Chungking Express works. If you're trying to follow the plot, you may feel frustrated ... When Godard was hot, in the 1960s and early 1970s, there was an audience for this style, but in those days, there were still film societies and repertory theaters to build and nourish such audiences. Many of today's younger filmgoers, fed only by the narrow selections at video stores, are not as curious or knowledgeable and may simply be puzzled by Chungking Express instead of challenged. It needs to be said, in any event, that a film like this is largely a cerebral experience: You enjoy it because of what you know about film, not because of what it knows about life.\"Prolific web reviewer James Berardinelli awarded the film three-and-one-half stars out of a possible four:[11]\"Like John Woo, Tsui Hark, and other directors who learned their craft in Hong Kong, Wong infuses his films with style and energy. His hand-held camera is restless, always moving and shifting. The action sequences are punctuated with unusual shots and stop-motion jumps. By filming Chungking Express in such rich, vibrant manner, the director uses visual images to underscore his themes. Once the viewer gets past bouts of confusion (the film demands more than one viewing), the result is a uniquely memorable look at the ties that bind all people, as presented through two deceptively simple stories.\"In a 2002 poll published by Sight and Sound (the monthly magazine of the British Film Institute) asking fifty leading UK film critics to choose the ten best films from the previous 25 years, Chungking Express was placed at number eight.[12] In the magazine's 2012 poll to find the most acclaimed films of all time, Chungking Express ranked 144.[13]","cantonese":"Cung4 Hing3 Sam1 Lam4","box_office":"$600,200 (US)[2] HK$7,678,549 (HK)[1]","cinematography":"Christopher Doyle Lau Wai-Keung (Andrew Lau)","production_company":"Jet Tone Production","Marketing":"The film is marketed with the tagline \"If my memory of her has an expiration date, let it be 10,000 years...\". Historically, the number \"10,000\" was used to represent the concept of \"forever\" in China and many other Asian countries (see Ten thousand years).The film's marketing posters were designed by artist Stanley Wong, under his pseudonym \"Another Mountain Man\".[8]","directed_by":"Wong Kar-wai","Soundtrack":"The song \"Baroque\", composed by Michael Galasso, can be heard twice during the first part of the movie: during the opening and when Brigitte Lin's character takes the gun in the closer. This track does not appear on the soundtrack album, although three other tracks are similar to it: \"Fornication in Space\" (track 3), \"Heartbreak\" (track 8) and \"Sweet Farewell\" (track 9), played respectively on synth, guitar and piano. The first story also features \"Things in Life\" by the Jamaican reggae singer Dennis Brown, which plays in the American bar where the drug baron is located.The second story features Faye Wong's Cantonese cover version of \"Dreams\" by The Cranberries, which is also played over the end credits. (Titled \"Mung Zung Yan\", it's also included in her 1994 album Random Thoughts. Her next album, Sky, includes a Mandarin cover.) \"California Dreamin'\" by The Mamas & the Papas, is played numerous times as it is the favourite song of Faye Wong's character. \"What a Diff'rence a Day Made\", performed by Dinah Washington, is played during a scene between Tony Leung and Valerie Chow's characters, as well as an encounter between Tony Leung and Faye Wong's characters later in the film.Tracklist:","release_dates":"14 July 1994 (1994-07-14) (Hong Kong)[1]|||||","Production":"Wong Kar-wai made the film during a two-month break from the editing of his wuxia film Ashes of Time. He has said, \"While I had nothing to do, I decided to make Chungking Express following my instincts.\",[5] and that \"After the very heavy stuff, heavily emphasized in Ashes of Time, I wanted to make a very light, contemporary movie, but where the characters had the same problems.\" Originally, Wong envisioned the two stories as similar but with contrasting settings: \"One would be located in Hong Kong [that is, Hong Kong Island] and the other in Kowloon; the action of the first would happen in daylight, the other at night. And despite the difference, they are the same stories.\"[5]On the screenplay, Wong has saidHe kept on writing and developed a third story. However, after filming the first two, he found that the film was getting too long so he relocated the third segment, about a love-sick hitman, to an entirely different film titled Fallen Angels (1995).[5]Wong had specific locations in mind where he wanted to set the action of the film. In an interview, he has said: \"One: Tsim Sha Tsui. I grew up in that area and I have a lot of feelings about it. It's an area where the Chinese literally brush shoulders with westerners, and is uniquely Hong Kong. Inside Chungking Mansion you can run into people of all races and nationalities: Chinese, white people, black people, Indian.\"[5] This is the setting for much of the first story. As Wong explains, Chungking Mansion is famous forThe second half was shot in Central, including Lan Kwai Fong, near a popular fast food shop called Midnight Express (which was later turned into a 7–11).[6] \"In this area, there are a lot of bars, a lot of foreign executives would hang out there after work,\" Wong remembers. The fast food shop is forever immortalized as the spot where Tony Leung and Faye Wong's characters met and became attracted to one another. Wong was also drawn to \"the escalator from Central to the mid-levels. That interests me because no one has made a movie there. When we were scouting for locations we found the light there entirely appropriate.\"[5] The apartment of Tony Leung's character was cinematographer's Christopher Doyle's apartment at the time of filming.[7]Nathan Road facade of the Chungking Mansions.Corridor lined with shops inside Chungking MansionsDeparture terminal of the former Kai Tak Airport.Central–Mid-levels escalators.","Distribution":"On 8 March 1996, the film began a limited theatrical run in North America through Quentin Tarantino's Rolling Thunder distribution company under Miramax. The Region 1 DVD is distributed by Rolling Thunder. Tarantino is an admirer of Wong Kar-wai, and the DVD features lengthy bookended remarks by him.Chungking Express was later released by The Criterion Collection on DVD and Blu-ray Disc, although both versions are now out of print. Chungking Express was re-released on DVD and Blu-ray in the UK on 26 January 2009.","produced_by":"Chan Yi-kan","starring":"Brigitte Lin Tony Leung Chiu-Wai Faye Wong Takeshi Kaneshiro Valerie Chow","running_time":"98 minutes","chungking_express":"Theatrical release poster","music_by":"Frankie Chan Roel. A Garcia","edited_by":"William Chang Kai Kit-wai Kwong Chi-Leung","written_by":"Wong Kar-wai"}