{"Cast":"Cast notes:","country":"United States","distributed_by":"Astor Pictures","Plot":"Miss Carol (Diana Durrell) is an idealistic teacher in a remote one-room schoolhouse. A native of the Ozarks herself, she is determined to stop the practice of child marriage, in which older men marry teen or preteen girls. Her campaign raises the ire of some local men, led by Jake Bolby (Warner Richmond), who one night drag her into the woods and tie her to a tree, with the intention of tarring and feathering her. Before they can do this, however, Angelo the dwarf (Angelo Rossitto) and Mr. Colton (George Humphreys) arrive with a shotgun to save the day.Following this, Jake Bolby comes across young Jennie Colton (Shirley Mills) swimming naked. When her father dies, Bolby decides to take advantage of the opportunity to blackmail her mother into letting him marry the girl, threatening that otherwise he will see her hanged for murder. After he \"courts\" Jennie by giving her a doll, the two are married. It later turns out that this ceremony was illegal, as child marriage had been banned several days prior, but this point quickly becomes moot. Before Bolby can consummate the union, he is gunned down by Angelo. Jennie leaves his house with Freddie Nulty (Bob Bollinger).","The nude swim scene":"The movie is perhaps best known for the topless and lengthy nude swim scene by 12-year-old Jennie, which begins with Jennie and Freddie, her closest friend, sneaking slyly to a secluded pond in the woods, where they had swum naked many times in the past. Freddie tells Jennie that he will \"beat [her] undressed,\" but Jennie tells him that they can no longer swim naked together. Freddie asks her why, and Jennie replies \"because we're not what we used to be\" because she is now grown up. She repeats what she has been told by her teacher, Miss Carol.[5]Freddie asks how they are different, pointing out that he had seen her many times in the nude, and Jennie turns to answer him, briefly exposing her breasts and nipples to the camera. The film then cuts to a lengthy long shot showing Jennie and Freddie, both topless and separated by a stand of trees, as they discuss how these changes will affect their relationship. Freddie asks if he can still kiss Jennie; she replies that he can but only when she is wearing her clothes.Jennie then removes her dress entirely, runs naked through the woods and dives into the water. The next two minutes consist of shots of Jennie swimming nude and frolicking with her dog. Jake Bolby appears on a ridge above the pond, and watches the naked girl. An old woman sees what Bolby is doing, and says to him, \"Purty, ain't she?\" Freddie hears this and alerts Jennie to the fact that someone is watching her, and she swims for cover. She asks Freddie to bring her clothes to her, without looking at her. He uses a long stick to pass her the dress. She pulls the dress on, unseen to the camera, and climbs out of the water.Some prints and screenings of the film have cut out the topless scene, leaving only the long shot nude swim sequence.","child_bride":"theatrical poster","language":"English","cinematography":"Marcel Le Picard","production_company":"Astor Pictures","directed_by":"Harry Revier","Home media":"Alpha Video's DVD release presents the film in its uncensored form, while Mill Creek Entertainment included a censored version of the film in its 20 Movie Pack Cult Classics collection. The film is now in the public domain.","release_dates":"January 1943[1]","Production":"Child Bride was the first film produced by noted exploitation film producer and promoter Kroger Babb, who marketed it as an educational film and who would reissue it under various titles, including Child Brides, Child Bride of the Ozarks and Dust to Dust. The movie is perhaps best known for the lengthy nude child swimming scene, which Allmovie described as \"completely gratuitous\" and \"obviously Child Bride's main selling point and the reason for its longevity on the exploitation circuit.\"[6]The film had been submitted to the Production Code Administration for a certificate of approval, but was denied because of its subject matter, which was said to be \"a sexually abhorrent abnormality which violates all moral principles,\" and because of the onscreen child nudity. The censors also objected to the murderer never being punished for his deeds.[7]","produced_by":"Raymond L. Friedgen","starring":"Shirley Mills Angelo Rossitto Warner Richmond","running_time":"62 minutes","music_by":"Felix Mills","edited_by":"Helen Turner","written_by":"Harry Revier","budget":"$24,000 (est.)"}