{"Cast":"Peyton Reed cameos as a mime.","country":"United States","distributed_by":"Universal Pictures","Plot":"Torrance Shipman (Kirsten Dunst), a student at Rancho Carne High School in San Diego, anxiously dreams about her first day of senior year. Her boyfriend, Aaron has left for college, and her cheerleading squad, the Toros, is aiming for a sixth consecutive national title. Torrance is elected to replace the team captain, \"Big Red\" (Lindsay Sloane) who is graduating. Soon, however, teammate Carver (Bianca Kajlich) is injured and can no longer compete with her broken leg. Torrance holds an audition for Carver's replacement and gains Missy Pantone (Eliza Dushku), a gymnast who recently transferred to the school with her brother Cliff (Jesse Bradford), with whom Torrance develops a flirtatious friendship. While watching the Toros practice, Missy recognizes their routines from a rival squad that her previous high school used to compete against. After accusing Torrance of being a liar and stealing (and upon seeing Torrance's angry reaction, thus realizing Torrance was completely unaware) she drives Torrance to Los Angeles, where they watch the East Compton Clovers perform routines that are virtually identical to their own team's. Isis (Gabrielle Union), the Clovers' team captain, angrily confronts the two. Torrance learns that \"Big Red\" regularly attended the Clovers' practices to videotape and steal their routines. In the meantime, Missy is seen as a threat by the other female members of the squad (because of her outstanding gymnastic abilities), but she ends up becoming Torrance's best friend and de facto co-captainIsis informs Torrance of her plans to defeat the Toros at the regional and national championships, which the team has never attended due to their economic hardship. When Torrance tells the Toros about the routines, the team still votes in favor of using the current routine to win; Torrance reluctantly agrees. At the Toros' next home game, Isis and her teammates show up and perform the Toros' routine in front of the whole school, humiliating them. The Toros realize that they have no choice but to learn a different routine. In desperation, they employ a professional choreographer named Sparky Polastri (Ian Roberts) to provide one, as suggested by Aaron (Richard Hillman). But at the Regionals, the team scheduled immediately ahead of the Toros performs the exact routine they had been practicing. The Toros have no choice but to perform the very same routine. After the debacle that ensues, Torrance speaks to a competition official and is told Polastri provided the routine to several other teams in California. As the defending champions, the Toros are nevertheless granted their place in the Finals, but Torrance is warned that a new routine will be expected. Torrance, crushed by her failure to lead the team successfully, considers quitting.Cliff encourages and supports her, intensifying their growing attraction. Aaron, however, suggests that she is not leadership material and recommends that she step down from her position, selling her out in the process to Courtney (Clare Kramer) and Whitney (Nicole Bilderback) who have set themselves up as Torrance's rivals. When Cliff sees Torrance and Aaron together, he angrily severs his friendship with Torrance, to her distress. But her confidence is renewed by Cliff's encouragement and she convinces her unhappy team to create an innovative, new routine instead. She breaks up with Aaron, realizing his infidelity and his inability to be supportive, but Cliff still refuses to forgive her. Meanwhile, the Clovers are initially unable to compete at Nationals due to financial problems. This prompts Torrance to get her dad's company to sponsor the Clovers, but Isis rejects the money and gets her team to Nationals by appealing to a talk show host who grew up in their area. In the finals, the Toros place second, while the Clovers win. However, at the end of the movie, Torrance and Isis find respect in each other, and Cliff and Torrance share a romantic kiss.During the credits, bloopers are seen as the characters dance and lip-sync to B*Witched's version of Mickey.","bring_it_on":"Theatrical release poster","language":"English","Reception":"Bring It On was released in North America on August 25, 2000. The film grossed $17,362,105 in 2,380 theaters during its opening weekend, ranking first at the North American box office.[5] Although it experienced an 18% decline in gross earnings, the film held the top position for a second consecutive week, and later on a third.[5] The film went on to gross $68,379,000 in North America and an additional $22,070,929 overseas for a total gross of $90,449,929.[1]The film received a 63% rating on Rotten Tomatoes, based on a total of 117 compiled reviews; the site's consensus reads: \"Despite the formulaic, fluffy storyline, this movie is surprisingly fun to watch, mostly due to its high energy and how it humorously spoofs cheerleading instead of taking itself too seriously.\"[6] In comparison, Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, gave the film an average score of 52 based on 31 reviews, indicating \"Mixed or average reviews\".[7]A. O. Scott from The New York Times commended the film for being able to \"gesture toward serious matters of race and economic inequality\", as well as for its \"occasional snarl of genuine satire\".[8] Kevin Thomas of The Los Angeles Times also favored the film, calling it a \"Smart and sassy high school movie that's fun for all ages.\"[7] Steven Rae from The Philadelphia Inquirer found it to be a \"likable, low-budget high school comedy.\"[7] Meanwhile, Kim Morgan of The Oregonian dubbed it the \"newest, and probably first, true cheerleading movie.\"[7]However, some reviewers criticized the plot of the film. Although David Sterritt of The Christian Science Monitor gave praise for the writing, he likened the storyline's simplicity to that of \"the average football cheer\".[7] Kim Edwards from the Chicago Tribune, in a negative review, found the film \"Absurdly unrealistic at times.\"[7] The Seattle Post-Intelligencer's Paula Nechak concluded that the film was \"predictable and surprisingly confusing in its ultimate message. \"[7]Many critics reserved praise for Kirsten Dunst's performance. In his review, A. O. Scott called her \"a terrific comic actress, largely because of her great expressive range, and the nimbleness with which she can shift from anxiety to aggression to genuine hurt.\"[8] Charles Taylor of Salon noted that \"among contemporary teenage actresses, Dunst has become the sunniest imaginable parodist.\"[9] Jessica Winter from The Village Voice shared this sentiment, commenting that \"[Dunst] provides the only major element of Bring It On that plays as tweaking parody rather than slick, strident, body-slam churlishness.\"[10] Peter Stack of the San Francisco Chronicle, despite giving the film an unfavorable review, commended Dunst for her willingness \"to be as silly and cloyingly agreeable as it takes to get through a slapdash film.\"[11]Cultural historian Maud Lavin says that despite Bring It On's predictable plot, its depiction of aggressive and competitive women, the differences shown between class and race, and the playful way it deals with homophobia gives it deeper cultural clout and meaning. In particular, Lavin says that the film suggests race relations could be \"smoothed and transcended through level-playing-field sports competitiveness.\"[12]The film ranked #30 on Entertainment Weekly's list of the 50 Best High School Movies.[13] Initially unimpressed with the film, Roger Ebert later referred to it as the \"Citizen Kane of cheerleader movies.\"[14]","box_office":"$90.4 million[1]","cinematography":"Shawn Maurer","production_company":"Beacon Pictures Stu Segall Productions","directed_by":"Peyton Reed","release_dates":"August 25, 2000 (2000-08-25)|||||","Production":"Bring It On was produced by Marc Abraham & Thomas Bliss. It was the debut film of director Peyton Reed. His major concern with the film was pushing the sexual aspects of cheerleading without losing a PG-13 rating.[2] Roger Ebert from the Chicago Sun-Times argued that this agenda followed a trend of films at the time that watered down material in order to avoid an R rating and increase box office gross.[3]Prior to auditioning for the film, actors were expected to have a cheer prepared.[4] In order to avoid the use of stunt doubles, Reed required all the actors to undergo a four-week cheerleading camp.[4] Reed and Gabrielle Union met numerous times to discuss the best way to approach her character.[4] \"I think she was able to find what was cool about that character that in a way I doubt other actresses could have,\" Reed explained in an interview, \"Whenever she's on the screen she has this charisma.\"[4] When editing the film, Reed and editor Larry Bock watched cheerleading exploitation films from the 1970s.[2]The film included a short glimpse of actual national champions Bishop Blanchet High School Saints (from Seattle) in the scenes at the regional competition and at the nationals.","produced_by":"Marc Abraham Thomas Bliss","starring":"Kirsten Dunst Eliza Dushku Jesse Bradford Gabrielle Union","running_time":"98 minutes","Cultural impact":"Several of cast members from the Bring It On film franchise have gone on to greater fame or notoriety. Kirsten Dunst, Eliza Dushku, Gabrielle Union, Jesse Bradford, Clare Kramer, Lindsay Sloane, and several others from the original film were already notable entertainers and television actors or have grown into such roles since their participation in the original film. Ryan Drummond also voiced Sonic the Hedgehog (character) from 1999 through 2004, Bethany Joy Galeotti and Hayden Panettiere, who appeared in Bring It On Again and Bring It On: All or Nothing, also went on to find sizable television audiences due to their roles on the television programs One Tree Hill and Heroes, respectively. Galeotti also appeared with Michael Copon (who co-starred in In It to Win It) during One Tree Hill's second season. Michael Copon also starred in Power Rangers Time Force. The R&B/Pop trio Blaque have a recurring role in Bring It On. Noteworthy R&B singer and film actress Christina Milian also appears as the main character in Fight to the Finish. Brittany Anne Pirtle (who appeared in Bring It On: Fight to the Finish) went on to star as the Yellow Power Ranger in Nickelodeon's Power Rangers Samurai. Holland Roden, who also starred in Bring It On: Fight to the Finish, would go on to star as one of the leads in the hit MTV supernatural-drama Teen Wolf.Bring It On has so far spawned a total of four direct-to-video sequels:The only sequel to feature any of the original crew from Bring It On was 2004's Bring It On Again, which shared the film's same producers. These producers did not return for the subsequent sequels, and none of the films share recurring cast members. Original star Eliza Dushku has even been quoted in interviews as never even having been invited to participate in the sequels. Steve Rash also directed two of the sequels. Otherwise, none of the films in the Bring It On franchise share any personnel whatsoever.The four films that follow Bring It On share only tenuous links with one another. The plot of each film typically follows that of the one originally laid out in the first film - a competitive cheerleading team who has to change routines or other elements they have grown accustomed to in order to win.A stage version of the film premiered at the Alliance Theatre, Atlanta, Georgia on January 16, 2011. The musical has music by Lin-Manuel Miranda and Tom Kitt, lyrics by Amanda Green, and a book by Jeff Whitty.[15][16][17] The director and choreographer is Andy Blankenbuehler, with a cast that includes Amanda LaVergne as Campbell, Adrienne Warren as Danielle, and Nick Blaemire as Randall and \"award-winning competitive cheerleaders from across the country\".[15]The Alliance Theatre production was nominated for eight Suzi Bass Awards, winning awards for Choreography (Andy Blankenbuehler), Sound Design (Brian Ronan) and World Premiere Play or Musical.[18] Additionally, the production was nominated for ten Atlanta Theater Fan Awards from www.AtlantaTheaterFans.com, more than any other production in 2011.[19] The production won for Best Musical and Best Choreography (Andy Blankenbuehler).[20]A national tour of the musical started at the Ahmanson Theatre, Los Angeles, in November 2011 through December 10, 2011 and then travels to San Francisco, Denver, Houston, and Toronto. The national tour stars Taylor Louderman as Campbell and Jason Gotay as Randall.[21][22] The cast took part in a special celebration kicking off the national tour of the musical on October 22, 2011, which featured performances from the show.[23]The New York Times reviewer wrote of the Ahmanson Theatre production: \"After an opening number that truly dazzles as it reveals the cast’s impressive gymnastic prowess, the score hits its stride only when Campbell transfers to Jackson High. Driven by surging R&B grooves and churning lyrics that suggest the fingerprints of Mr. Miranda ... the dance numbers for the Jackson crowd kick the musical into high gear for most of the first act.... Like most entertainments about the trials and triumphs of the teenage years, 'Bring It On' has as much sap as it does pep in its DNA. It’s distinguished primarily by the electrifying dance routines and the elaborate cheer-squad performances.\"[21]The musical is expected to open on Broadway at the St. James Theatre, in a limited run, starting on July 12, 2012 in previews, officially on August 1 through December 30, 2012.[24][25][26]","music_by":"Christophe Beck","edited_by":"Larry Bock","written_by":"Jessica Bendinger","budget":"$28 million"}