{"billy_rose's_jumbo":"Theatrical release poster","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"The Wonder Circus comes to a town in the Midwest with its featured attraction, Jumbo the elephant. Pop Wonder owns the circus, but his continued gambling losses in crap games leaves him (and the circus) with an ever-growing number of IOUs.His daughter, Kitty Wonder, hires a newcomer, Sam Rawlins, as both a performer and tent hand. She is unaware that Sam is the son of circus mogul John Noble, whose ambition is to buy the Wonder Circus for himself. Noble has been quietly buying up the IOUs with Sam's help and abruptly takes control of the family's business, leaving the Wonders without a show.Kitty, Pop and his longtime fiancee Lulu go off on their own, forming a traveling carnival, but it isn't quite the same. Sam, however, has fallen in love with Kitty and has a guilty conscience about what he has done. Sam splits from his father and rejoins the Wonders, bringing with him an old friend of theirs, Jumbo.","language":"English","Reception":"According to MGM accounts, the film earned $2.5 million in the US and Canada and $1.5 million overseas, but because of its high cost recorded a loss of $3,956,000. It was the last film producer Joe Pasternak made at MGM.[1]","box_office":"$ 4 million[1]","cinematography":"William H. Daniels","directed_by":"Charles Walters","Soundtrack":"A soundtrack album Billy Rose's Jumbo of the film was issued by Columbia Records in 1962.","DVD":"Billy Rose's Jumbo was released to DVD in a Region 1 DVD by Warner Bros. on April 26, 2005, and also as part of Volumes 1 and 2 of The Doris Day Collection on April 10, 2007.","release_dates":"December 6, 1962 (1962-12-06)","Production":"MGM bought the rights to the musical soon after it reached the stage. In 1947 Charles Waters requested he make the film of the musical as his first assignment; the studio agreed. In 1950 it was announced Arthur Freed would produce and Howard Keel abd Jimmy Durate would star.[2] Production was held up due to litigation. Years later MGM made the movie.[3]","produced_by":"Martin Melcher Joe Pasternak","starring":"Doris Day Stephen Boyd Jimmy Durante Martha Raye","running_time":"127 minutes","music_by":"Richard Rodgers & Lorenz Hart","edited_by":"Richard W. Farrell","written_by":"Ben Hecht Charles MacArthur Sidney Sheldon","budget":"$5,256,000[1]"}