{"all_about_my_mother":"Original poster by Oscar Mariné","country":"Spain","distributed_by":"Warner Sogefilms (Spain) Pathé (France) Sony Pictures Classics","Critical reception in the United States":"Janet Maslin of the New York Times called it Almodóvar's \"best film by far,\" noting he \"presents this womanly melodrama with an empathy to recall George Cukor's and an eye-dampening intensity to out-Sirk Douglas Sirk.\" She added, \"It's the crossover moment in the career of a born four-hankie storyteller of ever-increasing stature. Look out, Hollywood, here he comes.\"[3]Roger Ebert of the Chicago Sun-Times observed, \"You don't know where to position yourself while you're watching a film like All About My Mother, and that's part of the appeal: Do you take it seriously, like the characters do, or do you notice the bright colors and flashy art decoration, the cheerful homages to Tennessee Williams and All About Eve, and see it as a parody? . . . Almodovar's earlier films sometimes seemed to be manipulating the characters as an exercise. Here the plot does handstands in its eagerness to use coincidence, surprise and melodrama. But the characters have a weight and reality, as if Almodovar has finally taken pity on them – has seen that although their plights may seem ludicrous, they are real enough to hurt.\"[4]Bob Graham of the San Francisco Chronicle said, \"No one else makes movies like this Spanish director\" and added, \"In other hands, these characters might be candidates for confessions – and brawls – on The Jerry Springer Show, but here they are handled with utmost sympathy. None of these goings-on is presented as sordid or seedy. The presentation is as bright, glossy and seductive as a fashion magazine . . . The tone of All About My Mother has the heart-on-the-sleeve emotions of soap opera, but it is completely sincere and by no means camp.\"[5]Wesley Morris of the San Francisco Examiner called the film \"a romantically labyrinthine tribute that piles layers of inter-textual shout-outs to All About Eve, Tennessee Williams, Truman Capote, Federico García Lorca and Alfred Hitchcock, and beautifully assesses the nature of facades . . . Almodovar imbues his Harlequin-novel-meets-Marvel-comic-book melodramas with something more than a wink and a smile, and it is beguiling. His expressionism and his screenwriting have always had fun together, but now there is a kind of faith and spirituality that sexcapades like Law of Desire and Kika only laughed at . . . [I]t contains a host of superlative firsts: a handful of the only truly moving scenes he has filmed, the most gorgeous dialogue he has composed, his most dimensional performances of his most dimensional characters and perhaps his most dynamic photography and elaborate production design.\"[6]Jonathan Holland of Variety called the film \"emotionally satisfying and brilliantly played\" and commented, \"The emotional tone is predominantly dark and confrontational . . . But thanks to a sweetly paced and genuinely witty script, pic doesn't become depressing as it focuses on the characters' stoic resilience and good humor.\"[7]","Plot":"The film centers on Manuela, an Argentine nurse who oversees donor organ transplants in Ramón y Cajal Hospital in Madrid and single mother to Esteban, a teenager who wants to be a writer.On his seventeenth birthday, Esteban is hit by a car and killed while chasing after actress Huma Rojo for her autograph following a performance of A Streetcar Named Desire, in which she portrays Blanche DuBois. Manuela has to agree with her colleagues at work that her son's heart be transplanted to a man in A Coruña. After traveling after her son's heart, Manuela quits her job and journeys to Barcelona, where she hopes to find her son's father, Lola, a transvestite she kept secret from her son, just as she never told Lola they had a son.In Barcelona, Manuela reunites with her old friend Agrado, a warm and witty transsexual prostitute. She also meets and becomes deeply involved with several characters: Rosa, a young nun who works in a shelter for battered prostitutes, but is pregnant by Lola and is HIV positive; Huma Rojo, the actress her son had admired; and the drug-addicted Nina Cruz, Huma's co-star and lover. Her life becomes entwined with theirs as she cares for Rosa during her pregnancy and works for Huma as her personal assistant and even acts in the play as an understudy for Nina during one of her drug abuse crises.On her way to the hospital, Rosa asks the taxi to stop at a park where she spots her father's dog, Sapic, and then her own father, who suffers from Alzheimer's; he does not recognize Rosa and asks for her age and height, but Sapic is cleverer and knows Rosa. Rosa dies giving birth to her son, and Lola and Manuela finally reunite at Rosa's funeral. Lola (whose name used to be Esteban), who is dying from AIDS, talks about how she always wanted a son, and Manuela tells her about her own Esteban and how he died in a car accident. Manuela then adopts Esteban, Rosa's child, and stays with him at Rosa's parents' house. The father does not understand who Manuela is, and Rosa's mother says it's the new cook, who is living here with her son. Rosa's father then asks Manuela her age and height.Manuela introduces Esteban (Rosa's son) to Lola and gives her a picture of their own Esteban. Rosa's mother spots them from the street and then confronts Manuela about letting strangers see the baby. Manuela tells her that Lola is Esteban's father; Rosa's mother is appalled and says: \"That is the monster that killed my daughter?!\"Manuela flees back to Madrid with Esteban; she cannot take living at Rosa's house any longer, since the grandmother is afraid that she will contract AIDS from the baby. She writes a letter to Huma and Agrado saying that she is leaving and once again is sorry for not saying goodbye, like she did years before. Two years later, Manuela returns with Esteban to an AIDS convention, telling Huma and Agrado, who now run a stage show together, that Esteban had been a miracle by not inheriting the virus. She then says she is returning to stay with Esteban's grandparents. When Manuela asks Huma about Nina, Huma becomes melancholic and leaves. Agrado tells Manuela that Nina went back to her town, got married, and had a fat, ugly baby boy.","language":"Spanish Catalan English","Stage adaptation":"A stage adaptation of the film by playwright Samuel Adamson received its world première at the Old Vic in London's West End on 4 September 2007. This production marked the first English language adaptation of any of Almodóvar's works and had his support and approval.[9] Music by the film's composer, Alberto Iglesias, was incorporated into the stage production, with additional music by Max and Ben Ringham. It starred Colin Morgan, Diana Rigg, Lesley Manville, Mark Gatiss, Joanne Froggatt, and Charlotte Randle. It opened to generally good reviews, with some critics stating it improved upon the film.[10][11]","Selected awards and nominations":"Academy AwardsBAFTA AwardsGolden Globe AwardsGoya Awards","box_office":"$67,872,296","cinematography":"Affonso Beato","directed_by":"Pedro Almodóvar","release_dates":"16 April 1999 (1999-04-16) (Spain)|19 May 1999 (1999-05-19) (France)||||","Production":"Almodóvar dedicates his film \"To all actresses who have played actresses. To all women who act. To men who act and become women. To all the people who want to be mothers. To my mother.\"Almodovar recreates the accident scene from John Cassavetes' Opening Night as the epicenter of the dramatic conflict.The film was mainly shot on location in Barcelona.The soundtrack includes \"Gorrión\" and \"Coral para mi pequeño y lejano pueblo,\" written by Dino Saluzzi and performed by Saluzzi, Marc Johnson, and José Saluzzi, and \"Tajabone,\" written and performed by Ismaël Lô.[citation needed]","produced_by":"Agustín Almodóvar Michel Ruben","starring":"Cecilia Roth Marisa Paredes Antonia San Juan Penélope Cruz Candela Peña","running_time":"104 minutes 101 minutes[1] (US cut)","music_by":"Alberto Iglesias","edited_by":"José Salcedo","Release":"The film premiered in Spain on 8 April 1999 and went into general theatrical release on 16 April. It was shown at the Cannes Film Festival, the Karlovy Vary Film Festival, the Auckland Film Festival, the Austin Film Festival, the Thessaloniki International Film Festival, and the New York Film Festival before going into limited release in the US. It eventually grossed €9,962,047 in Spain ($12,595,016), $8,272,296 in the US and $59,600,000 in foreign markets for a worldwide box office total of $67,872,296.[2]","written_by":"Pedro Almodóvar","budget":"600 million pesetas ($4,989,091)"}