{"based_on":"Chéri by Colette","country":"France United Kingdom","distributed_by":"Miramax Films (USA) Pathé (France)","Plot":"Set in 1900s Belle Époque Paris, Chéri tells the story of the affair between an aging retired courtesan, Léa, and a flamboyant young man, Fred, nicknamed \"Chéri\" (\"Dear\" or \"Darling\").Although Léa plans on keeping Chéri around for a short while, their affair turns into a six-year ordeal, in which Léa has begun paying for Chéri's expenses, and Chéri wears Léa's silk pajamas and pearls. The two believe their affair to be casual, and Léa learns Chéri's mother, Charlotte, has arranged for Chéri to marry the daughter of another courtesan, a barely eighteen-year-old named Edmée. Although Chéri does not wish to marry Edmée, it is made clear that he has no choice in the matter. Léa kicks him out of her home, but makes Chéri promise to always be gentle and kind with Edmée, and to try to give her a good life. After Chéri agrees, the two part ways. Léa does not attend the wedding, and Chéri and Edmée leave for their honeymoon. It is only after Chéri is on the train to Italy for his honeymoon that both he and Léa realise they are in love with each other. Chéri rapes Edmée and, while taking her virginity, realises that while sex with Edmée is strained and painful, sex with Léa was easy and fun. Léa visits Charlotte one last time before running off on vacation, making up a story in which she is involved in with another suitor, when in fact the only man Léa beds while on vacation is a young bodybuilder whom she has no feelings for and regards as a one-night stand.Meanwhile, Edmée accuses Chéri of not caring about her, and says all he ever does is think of Léa. While out on the town with a friend, Chéri tries opium and cocaine, and on his way back he notices that Léa's apartment is no longer empty, and she has returned home. Comforted by the fact that Léa has returned, Chéri runs home to Edmée where he makes love to her properly and kindly, thinking that he can now live in peace with Edmée. He sends Charlotte the next day to inspect Léa's home, whereupon Léa says she is madly in love with her new \"suitor\", and learns (falsely) from Charlotte that Chéri and Edmée are crazily in love and happier than ever. That night, after hearing from Charlotte that Léa is in love with her suitor, Chéri breaks into her home and admits he loves her. The two spend one more night together and plan on running away. In the morning, however, Léa apologizes to Chéri for \"ruining him\" and making life too easy on him when they first begun their affair. Léa tells Chéri to go back to Edmée, for their age difference would always prevent a true relationship blossoming between them. Tentatively, Chéri leaves. Léa stares into her mirror at her aging face, and the narrator reveals she is angry for being born two decades before Chéri. The narrator also reveals that, after a while, Chéri realises that Léa was the only woman he could ever love, and he commits suicide.","language":"English","Reception":"Chéri selected Berlin Film Festival official competition.[3]The movie got mixed reviews: The Times of London reviewed the film favourably, describing Hampton's screenplay as a \"steady flow of dry quips and acerbic one-liners\" and Pfeiffer's performance as \"magnetic and subtle, her worldly nonchalance a mask for vulnerability and heartache.\"[4]Roger Ebert in the Chicago Sun-Times wrote that it was \"fascinating to observe how Pfeiffer controls her face and voice during times of painful hurt.\"[5]Kenneth Turan in the Los Angeles Times praised the \"wordless scenes that catch Léa unawares, with the camera alone seeing the despair and regret that she hides from the world. It's the kind of refined, delicate acting Pfeiffer does so well, and it's a further reminder of how much we've missed her since she's been away.\"[6]At Rotten Tomatoes it has a 54% or 'Rotten' rating. Much of the criticism centres on its weak script and poorly executed romance scenes.[7]At Metacritic, it received \"generally favorable reviews\" based on 27 critic reviews.[8]","box_office":"$9,366,227[1]","cinematography":"Darius Khondji","production_company":"UK Film Council","directed_by":"Stephen Frears","narrated_by":"Stephen Frears","release_dates":"10 February 2009 (2009-02-10) (Berlinale)|8 April 2009 (2009-04-08) (France)|8 May 2009 (2009-05-08) (United Kingdom)|||","produced_by":"Bill Kenwright Thom Mount","starring":"Michelle Pfeiffer Rupert Friend Felicity Jones Kathy Bates","running_time":"92 minutes","music_by":"Alexandre Desplat","chéri":"Promotional film poster","edited_by":"Lucia Zucchetti","written_by":"Christopher Hampton","budget":"$23 million"}