{"country":"United Kingdom","distributed_by":"Universal Pictures","clockwise":"theatrical release poster by Tom Jung","Plot":"Brian Stimpson (Cleese), headmaster of Thomas Tompion Comprehensive School, has been elected to chair the annual Headmasters' Conference. Habitually disorganised as a young man, Stimpson is now fastidiously organized and punctual, and his school runs \"like clockwork\". He is the first headmaster of a comprehensive school to chair the Headmasters' Conference, that honour usually being reserved for heads of the more prestigious private schools.Despite meticulous rehearsal of his speech and preparations for the journey to the conference, his ordered world unwinds as a series of misfortunes befalls him en route. His troubles begin as he inadvertently misses his train and loses the text of his speech. As he cannot find any other transportation, he commandeers the car of one of his pupils, Laura Wisely (Sharon Maiden), to make the rest of the journey. As further unfortunate events unfold, Stimpson and Wisely severely damage and ultimately lose the car. Now desperate to reach the conference on time, they resort to stealing the sports car being driven by a used car salesman, belonging to a client.Stimpson finally arrives at the conference in the ripped suit of the car salesman and gives an improvised, nonsensical speech to the confused headmasters. Finally, he directs all of the headmasters to stand and sing the hymn \"To Be a Pilgrim\", as he often would to his own pupils. He is then accosted by his disgruntled wife, Laura's worried parents and several other parties he had offended over the course of his journey. The film ends as he is led away by several policemen.","language":"English","box_office":"$1,476,356[1]","cinematography":"John Coquillon","production_company":"Thorn EMI Screen Entertainment","directed_by":"Christopher Morahan","References":"Notes","release_dates":"March 1986","produced_by":"Michael Codron","starring":"John Cleese","running_time":"96 minutes","music_by":"George Fenton","edited_by":"Peter Boyle","written_by":"Michael Frayn"}