{"country":"India","distributed_by":"Sree Mahalakshmi Combines","screenplay_by":"K. S. Ravikumar Kamal Haasan","story_by":"Crazy Mohan","avvai_shanmughi_manjunath":"அவ்வை சண்முகி","Plot":"The film starts in a courtroom where a Brahmin woman Janaki (Meena) is fighting for divorce from her husband Pandian (Kamal Haasan). She offers various reasons for wanting a divorce. She has married Pandian against the wishes of her rich father Vishwanathan Iyer (Gemini Ganesan). But she isn't able to come to terms with living in Pandian's small house without amenities. Pandian is an assistant dance director with a modest income and is not able to spend much time with the family. All this accumulates and Janaki decides to apply for divorce, which is granted. The court orders that Pandian can meet his daughter Barathi, once a week and this is his only solace. His daughter, however, loves him a lot and doesn't like the arrangement. Basha (Nassar), Pandian's Muslim friend who works in a hotel as a chef, advises him to steal his daughter from Janaki. Pandian goes about trying to do as his friend suggests. In doing so, he is discovered; and now he cannot meet her at all. Then Pandian finds out that Vishwanathan Iyer has advertised for a woman to look after his granddaughter. Joseph (Nagesh) is a makeup man in films. In conversation with him, Pandian gets the idea of playing an old woman, so that he can be with his child and ex-wife without them knowing. Joseph agrees to this plan and the transformation is done from Pandian to 'Avvai Shanmugi'-- a dignified, elderly Iyer woman who is hired to take care of the little girl.Rathna (Heera Rajgopal) is a girl who is in love with Pandian but is constantly rebuffed. Basha takes up the role of a mute Iyer cook and is admitted into Vishwanathan Iyer house on the recommendation of Avvai Shanmugi. However, Basha is caught later while doing his namaz, thereby shattering both lies—that he is mute and an Iyer. Hilarious circumstances follow and slowly Avvai Shanmugi manages to convince the household of her sincerity. So much so that Janaki's widowed father begins to develop a liking for Avvai and in fact proposes to her too. Around the same time, Mudaliyar (Manivannan), the house-owner of the place where Pandian lives, sympathizing her for being a window (widow actually), happens to bump into Avvai Shanmugi. This happens many times and Mudaliyar, too, begins to develop a liking for her.Meanwhile, Pandian slowly begins to realize that Janaki hasn't totally forgotten him. Avvai rebuffs Vishwanathan's proposals by saying that her husband is alive. Adding to the chaos, she tells Vishwanathan that Joseph is her husband; while Pandian tells Sethurama (Delhi Ganesh), Vishwanathan's secretary, that Mudaliyar is Avvai's husband. There is much confusion after this, but it is resolved at last. Avvai Shanmugi convinces Vishwanathan that Janaki's right place is by her husband. While Janaki's father goes off to talk to his estranged son-in-law, Avvai Shanmugi reveals her true self as Pandian to Basha by removing her blouse. This is seen by Janaki, who misunderstands the scene and believes Avvai to be an immoral woman. Janaki goes to Pandian's house to reclaim him, but upon seeing Rathna waiting there, and Avvai's clothes lying around, thinks that her husband, too, is promiscuous. Janaki leaves and attempts suicide by trying to jump into a river, but Avvai Shanmugi stops her. Avvai reveals her identity as Pandian. Janaki and Pandian reconcile, while Pandian kills off Avvai Shanmugi by attributing her death to drowning while attempting to save Janaki from committing suicide.","language":"Tamil","cinematography":"S. Murthy","production_company":"Sree Mahalakshmi Combines","directed_by":"K. S. Ravikumar","Soundtrack":"The music composed by Deva and the lyrics were penned by Vaali. The song \"Rukku Rukku\" is based on Sahana Raga.[12]","release_dates":"10 November 1996","Production":"Kamal Haasan began production on the film after his project with director Balachandra Menon' s Kandaen Seethayae failed to get completed. The team initially approached Sivaji Ganesan to play the lead actress's father in the film, but his ill health meant that the film was launched with Meena and Gemini Ganesan as part of the cast and schedules were held in Kerala and Goa. A debutant Sri Durga was roped in to play second heroine in the film and Sanghavi was also considered, but was ultimately replaced by Heera Rajgopal.[2] Ann was introduced as the girl who played Kamalhasan's little daughter.[3] Stunt master Kanal Kannan appeared in a small role of a street rogue.[4]Kamal dedicated this film to his mentor stage actor Avvai T. K. Shanmugham who was known for playing female roles in stage plays.[5]The make-up artist Michael Westmore provided advice for the film alongside K.M. Sarathkumar. The padding and foundation used gave Kamal Hasan an allergic reaction beneath his eyes, hence for the Hindi remake they ensured that scenes of the male role was shot first. The make-up took five hours to put on and lasts for only five more hours.[6] Kamal wore a nine yards saree in the film for the female character.[7]","produced_by":"R. Ravindran K. P. Hari","starring":"Kamal Haasan Meena Gemini Ganesan Nagesh Manivannan Nassar Heera","running_time":"161 minutes","music_by":"Deva","edited_by":"K. Thanikachalam","Release":"The film won positive reviews and performed well at the box office. The Hindu praised the film claiming \"turns out to be entertainer, mouthful from start to finish\". The source praises Kamal Haasan's portrayal of a woman by claiming that \"few peers to Kamal Hassan who can do the female role with such perfection\".[8][9] The film won two Tamil Nadu State Film Awards with K. M. Sarathkumar winning Best Make-up Artist and Ann Anra winning Best Child actor.[10]The movie was dubbed into Telugu as Bhamane Satyabhamane. In 1998, Kamal Haasan made his directorial debut by remaking the film in Hindi as Chachi 420 with Tabu, Amrish Puri, Om Puri and himself in the leading roles.[11]","written_by":"Crazy Mohan"}