{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"After her boyfriend Mike unexpectedly cancels their anniversary date, Chris Parker invites her friend, Brenda, over to her Oak Park house to cheer her up, but is eventually convinced by her mother to babysit the Andersons' daughter, 8-year-old Sara, while they attend a party in Chicago. Fifteen-year-old Brad is originally supposed to go to his friend Daryl Coopersmith's house to spend the night, but he changes his mind when Chris comes over to visit. After receiving a frantic phone call from Brenda, who ran away to the bus station downtown, using all of her money for the cab ride, Chris plans to go alone to pick her up, but is coerced by Brad, Sarah and Daryl to take them with her. On the freeway, the Buick Electra station wagon suffers a flat tire and they are picked up by a kind tow truck driver, \"Handsome\" John Pruitt, who offers to pay for the tire when Chris realizes she left her purse at the Andersons'. En route, Pruitt gets a call from his boss Dawson with evidence that his wife is cheating on him, and he rushes to his house to confront the infidelity, and Chris's mother's car is damaged when Pruitt accidentally shoots the windshield with a revolver while aiming to kill the man his wife had the affair with. Chris and the kids hide in a Cadillac, which is then car-jacked by a thief named Joe Gipp.Reaching their hideout, Joe is confronted for bringing witnesses to their car theft operation and second-in-command Graydon ignores them when they say they won't go to the police. They are detained in an upstairs office and escape through the ceiling, they make their way across the rafters and out onto the roof. They are chased by the thieves and enter a blues club where the band on stage won't let them leave until they sing the blues. Chris, Brad, Sara and Daryl recount their events so far that night to the cheers of the audience and are allowed to leave, successfully losing Greydon and his leader Bleak. Meanwhile, Brenda is having trouble of her own; after her glasses are stolen and she doesn't have money for a hot dog, she mistakes a sewer rat for a kitten and is appalled when pest control points it out.Brad tells Chris about his feelings toward her, but find they are not reciprocated because Brad is two years younger than she is. After sparing Daryl from a streetwalker who is a runaway, Chris is reminded of Brenda. They are then found and chased again by Greydon and Bleak, but manage to escape on the Chicago 'L' train and wind up in the middle of a gang fight in which Brad is injured when one of the gang leaders throws a switchblade down onto his foot. They take Brad to the hospital, where he receives a stitch to his toe while the rest are led to believe he had died. They run into Pruitt, who is on the lam for his earlier attacks and tells the kids he replaced the window to the car, but they need to find $50 to pay Dawson for the tire. The kids come across a fraternity house party and Chris meets and becomes attracted to Dan Lynch, who manages to get them $45. He takes them to Dawson's Garage and drops them off. When they find Dawson, his blond hair and holding a sledge hammer leads Sara to believe he is her hero Thor. He coldly denies them their car for the $5 shortage, but when Sara offers him her toy Thor helmet, her generosity changes his mind and he lets them go. Meanwhile, Joe Gipp told Bleak about their troubles and are waiting to follow them. The kids find the restaurant where Mike was supposed to take Chris to and discover he is there with another girl. Sara slips away on her own to view a toy store while Chris yells at Mike. Brad stands up for his friend while Daryl kicks Mike over a food cart, ruining the dinner. Meanwhile, Sara is spotted by Bleak and Graydon chases her to an office building where she goes into hiding on a renovated floor; the others note her disappearance and follow close behind, accidentally coming across the Andersons' party. After Sara climbs out one of the open windows and slides down the building, Chris spots her and they run upstairs to help her.After pulling Sara from outside the window, Joe and Bleak confront them, but Joe knocks his boss out, giving him a Playboy Magazine that Daryl had stolen to replace one he had lost earlier, which had important notes that the criminals wanted. The kids hurriedly pick up Brenda from the bus station and rush home, narrowly avoiding the Andersons on the way. Once back home, the kids go upstairs while Chris dismisses Brenda and cleans up the mess left earlier, settling in place just as the Andersons return. Everything back to normal, Chris tells Sara that the night was her last babysitting gig, but all of them agree that it was the best night of their lives (so far) and that Brad and Chris are comfortable just remaining close friends. After Chris leaves, Dan arrives with one of Sara's missing skates, he says he needs a babysitter and is disappointed when Chris said she's retired, he then confesses that the babysitter was for him. Chris decides that retirement can wait and gladly agrees to babysit Dan. Chris and Dan smile. With Sara's encouragement from the bedroom window, Chris and Dan laugh and kiss as Brad closes the blinds.In a scene after the closing credits, Graydon is seen still stuck on the building ledge.","Unsold Pilot":"The film was adapted into an unsold TV pilot[10] of the same name for CBS in 1989. It starred Jennifer Guthrie (who would later co-star on Parker Lewis Can't Lose with Maia Brewton) as Chris, Joey Lawrence as Brad, Courtney Peldon as Sara, Brian Austin Green as Daryl, and Ariana Mohit as Brenda. It wasn't picked up as a series.","language":"English","Reception":"The film has received positive reviews, and it currently earns a \"fresh\" 76% approval rating on Rotten Tomatoes based on 24 reviews.[8]The film was a box office success, earning more than $34 million on its $7 million budget.[9]","box_office":"$34.3 million","Remake":"A remake was reportedly planned for release in 2012.[11] Raven-Symoné was going to star in the remake, currently titled Further Adventures in Babysitting,[11] but decided to withdraw due to other projects. Miley Cyrus was also rumored to be attached to the project, but later denied involvement.[12]According to Variety, Tiffany Paulsen was writing the script.[11] It was presumed that the remake was scrapped due to years of inactivity. However, on January 9, 2015, Disney Channel announced that the remake would go forward, with Sabrina Carpenter and Sofia Carson starring as competing babysitters.[13]","cinematography":"Ric Waite","production_company":"Touchstone Pictures Silver Screen Partners III","adventures_in_babysitting":"Theatrical release poster by Drew Struzan","directed_by":"Chris Columbus","release_dates":"July 3, 1987 (1987-07-03)[1]|||||","Production":"This was the eighth PG-13-rated film released by a Disney film division, and also the directorial debut of screenwriter Chris Columbus. It was released as A Night on the Town in the United Kingdom. In the bus station scene with Brenda, the actor who portrayed the hot dog salesman originally improvised his line as \"then I don't have a freaking wiener!\" Columbus loved the line, but executives at Disney wanted to keep the picture more family-friendly, so the line was removed (although it is used once in the final cut[2]). This scene was added to stretch out the bus station segments. It was not in the original script.Bradley Whitford, who played high school senior Mike Todwell in the film, was actually 26 years old at the time of filming in 1986. He was uncomfortable with the age difference of his role, but Columbus put him at ease by allowing him to use his own Camaro in the movie. The car is later seen with Whitford's actual license plate \"SO COOL.\"Valerie Bertinelli was one of the actresses who auditioned for the role of Chris Parker.[3]","produced_by":"Debra Hill Lynda Obst","starring":"Elisabeth Shue|Keith Coogan|Anthony Rapp|Maia Brewton|","running_time":"102 minutes","music_by":"Michael Kamen","edited_by":"Fredric Steinkamp William Steinkamp","Release":"The film has been released on VHS, LaserDisc, DVD and Blu-ray formats. In the United States, it received a VHS release by Touchstone Home Video on July 14, 1992.[4] It was released on DVD for the first time on January 18, 2000 by Touchstone Home Video.[5] A 25th anniversary edition Blu-ray was released August 7, 2012.Although it may still be referred to as A Night on the Town on television airings in the United Kingdom, the film has now been released in its original title. The VHS was released on October 21, 2002 in the United Kingdom by Cinema Club, it received a 15 certificate by the BBFC[6] for strong language and sexual references, it was previously released in an edited PG certificate for family viewing. It was released on DVD in the United Kingdom on May 31, 2004, again uncut like the 15 certificate VHS, it has been reduced to a 12 certificate.[7]In 2015 Intrada Records released an album from the film, featuring the score by Michael Kamen, including unused music and several of the songs heard in the film.","written_by":"David Simkins","budget":"$7 million"}