{"country":"United States","distributed_by":"New Line Cinema|Fine Line Features|","a_dirty_shame":"Original release poster","Plot":"The people of Harford Road are firmly divided into two camps; neuters, the puritanical residents who despise anything even remotely carnal, and the perverts, a group of sex addicts whose unique fetishes have all been brought to the fore by accidental concussions.Repressed Sylvia Stickles finds herself firmly entrenched in the former camp until one day when, after leaving her promiscuous daughter Caprice — nicknamed Ursula Udders because of her gargantuan breasts and penchant for indecent exposure — under house arrest \"for her own good\", she is smacked on the head by a passing car and meets Ray-Ray Perkins, a local mechanic and self-styled \"sex saint\" who opens her mind to a whole new world of sensual pleasure, as he and his followers search for the newest, ultimate sex act.Eventually, through a series of bizarre head knockings, everyone in town becomes a sex addict, as Ray-Ray shoots semen out of his head, onto the camera and Sylvia unveils the newest carnal act.","language":"English","Critical reception":"A Dirty Shame received a mixed response from critics, half of whom have lauded its unashamed vulgarity, while the other half have lampooned it for much the same reason. On Rotten Tomatoes, the film is listed as having a 53% critical approval rating.[8]One of the more positive reviews came from Kevin Thomas of the Los Angeles Times, who wrote:\"A gross-out pioneer, Waters has always had more on his mind than delirious, sex-crazed silliness. By allowing people to speak freely about their sexual urges and practices with a bluntness that is jaw-droppingly hilarious, Waters has drawn deeply upon comedy's liberating power. The more the sex addicts talk about their hang-ups the more comically harmless they seem, and thus it's all the more absurd for the puritanical to try to punish them for their various pursuits of pleasure. Waters has always harnessed poor taste to lampoon attempts to limit freedom of expression. This raucously gritty and high-spirited film could scarcely be bluer in terms of the language, but from Waters it comes as a gust of fresh air.\"[1]Also enthusiastic was Peter Travers of Rolling Stone:\"A Dirty Shame is Waters unleashed, and wicked, kinky fun for anyone except the twits who rated it NC-17...You may even shed a tear when Sylvia bonds with her daughter by confessing, \"I'm a cunnilingus bottom.\" OK, the jokes are hit-and-miss and the plot is nonexistent, but the Waters spirit stays consistently and sweetly twisted. When the cast takes to the streets singing, \"Let's go sexin',\" you want to cheer them on.\"[9]On the other end of the spectrum was Roger Ebert, who gave the film one star out of a possible four:\"There is in show biz something known as \"a bad laugh.\" That's the laugh you don't want to get, because it indicates not amusement but incredulity, nervousness or disapproval. John Waters' A Dirty Shame is the only comedy I can think of that gets more bad laughs than good ones...We go to a Waters film expecting bad taste, but we also expect to laugh, and A Dirty Shame is monotonous, repetitive and sometimes wildly wrong in what it hopes is funny.\"[10]A Dirty Shame opened on September 17, 2004 on one Baltimore screen to $29,384. The next weekend, it expanded to 133 venues, where it grossed $448,914 ($3,375 per screen). It ended its North American run with $1,339,668 (as of November 7, 2004).[3]Overseas, the film earned an additional $574,498 (as of July 14, 2005), making its global box office total come to $1,914,166.[3]","box_office":"$1.9 million[3]","cinematography":"Steve Gainer","production_company":"Killer Films City Lights Pictures This Is That","directed_by":"John Waters","Home media":"There is both a full uncensored version and an edited, R-rated cut sold through Blockbuster, Wal-Mart, and Best Buy as well as Target dubbed \"The Neuter Version\". The R-rated version is heavily censored and removes most of the profanities including altered dialogue such as \"sex toy\". Additionally, a scene in which two characters stand naked in their doorway is replaced by one in which the characters are clothed. In an interview, Waters stated that this version is \"essentially for brainless people and 'really weird collectors'.\"[11]Netflix proclaims to stream the NC-17 version of the film, but for a time, it was actually the censored version. They have since replaced it with the uncensored cut. The censored version airs on LOGO, a cable channel for gay interest.Despite several internet sites and even the spine of the DVD stating that it is \"The Neuter Version\", the Australian release of the film is the fully uncut NC-17 version[12] with all profanity and nudity intact. It is rated R18+ for \"sexual references and adult themes\".","release_dates":"September 24, 2004 (2004-09-24)|||||","Production":"John Waters decided to make the film after discovering several sexual slang terms and branches existed on the internet, explaining the groups and terminology found in the film.[5]According to Waters, when he asked the MPAA what he would need to cut in order for them to give his film an R rating, they replied that \"after a while, we just stopped taking notes\", and if everything they objected to was cut, only ten minutes could be distributed.[6] They decided to simply release it with an NC-17 rating.It was shot entirely on-location in Baltimore on Harford Road which is prominently featured in the film.In a featurette that accompanied the film's DVD release, veteran stage actress Suzanne Shepherd recalled that when she was cast as Big Ethel, she was completely unfamiliar with Waters' work, and she had no idea what to expect when she showed up for the first script review. Horrified by what she was reading, she became so distraught that she began to cry. She tried to quit the project, but Waters and her cast mates managed to persuade her to stay.[7]","produced_by":"Christine Vachon|Ted Hope|Mark Ordesky|Mark Kaufman|Pat Moran|","starring":"Tracey Ullman|Johnny Knoxville|Selma Blair|Chris Isaak|Suzanne Shepherd|Mink Stole|","running_time":"89 minutes[1]","music_by":"George S. Clinton","edited_by":"Jeffrey Wolf","written_by":"John Waters","budget":"$15 million[2]"}