{"based_on":"Bubba Ho-Tep  by Joe R. Lansdale","country":"United States","distributed_by":"Vitagraph Films","screenplay_by":"Don Coscarelli","Plot":"An elderly man at The Shady Rest Retirement Home in East Texas is known to the staff as Sebastian Haff, but claims to be Elvis. He explains that during the 1970s, Elvis Presley (Bruce Campbell) grew tired of the demands of his fame and switched places with an Elvis impersonator named Sebastian Haff (also Campbell). He claims it was Haff who eventually died in 1977, while he, the real Elvis, lived in quiet, happy anonymity and made a living pretending to be himself. After a propane explosion destroyed documentation which was the only proof that he was actually Elvis, he was unable to return to his old lifestyle.A hip injury during a performance causes him to get an infection and slip into a coma. Twenty years later and living at the retirement home as the film opens, he is contemplating his age, frailty, loss of dignity, impotence, and \"A growth on [his] pecker\". Elvis's only friend is a black man named Jack (Ossie Davis) who insists he is President John F. Kennedy, claiming to have been dyed black after an assassination attempt, and abandoned by Lyndon Johnson in a nursing home. Initially skeptical of Jack's story, Elvis does spot a mysterious scar on the back of Jack's head. It could be from the head wound seen in the Zapruder film, but then it might not be.Eventually, Elvis and Jack face off against a re-animated ancient Egyptian mummy that was stolen during a U.S. museum tour, and then lost during a severe storm in East Texas when the thieves' bus veered into a river near the nursing home. The mummy strangely takes on the garb of a cowboy and feeds on the souls of the residents of the home. It is dubbed 'Bubba Ho-Tep' by Elvis, who is given a telepathic flashback of the mummy's life and death when he looks into its eyes. The slow, plodding mummy is a real and credible threat, as instead of going against young adults who could potentially outrun or overpower it, the mummy gives chase to the elderly. Jack and Elvis lack mobility and need a motorized wheelchair and a walker to get around the grounds.Elvis and Jack create an elaborate plan to destroy the mummy. Destruction of the mummy would release the trapped souls of their dead friends, and they would be able to go to their final resting place. Elvis and Jack battle the mummy in the middle of the night, with Jack in an electric wheelchair and Elvis wielding a makeshift flamethrower. Jack is knocked out of his wheelchair by the mummy and is about to have his soul sucked. Elvis hops in the wheelchair, zooms into the mummy to save Jack, and damages the flamethrower, getting a large gash in his abdomen in the process. Jack dies from a heart attack. Elvis becomes committed to getting rid of the mummy, and he throws the gasoline on him and then throws matches at him, killing the mummy.Elvis lies on a hill near the river bank, dying from the blood loss from the gash and broken ribs. He talks in his mind about how he doesn't fear death, knowing that he still had his soul and that he saved all of the fellow people at the Shady Rest Retirement Home. As he reflects upon this, the stars align into a message for Elvis, saying: \"all is well\". With a dying \"Thank you, thank you very much\", Elvis passes away.","bubba_ho-tep":"Teaser film poster","language":"English","Critical reception":"The film has received generally positive reviews from film critics; review aggregator Rotten Tomatoes reports a \"Certified Fresh\" rating of 78% (based on 100 critical reviews).[3] The site's general consensus was a tongue-in-cheek statement, \"The best movie to star both the King and JFK.\"[3] Metacritic, which assigns a weighted score out of 1–100 reviews from film critics, has a rating of 56 based on 29 reviews.[4]Peter Travers of Rolling Stone gave the film three out of four stars saying, \"This absurdly clever caper is elevated by Bruce Campbell's pensive Elvis into a moving meditation on the diminutions of age and the vagaries of fame.\"[5] Todd McCarthy of Variety gave a negative review stating, \"[The] introduction of the mummy plot basically derails the film at about the 45-minute point, and the silly climax...is so rote and generic that it could have come out of any ordinary horror film.\", although McCarthy does admit, \"Campbell's Elvis stands as one of the very best screen interpretations of the King seen thus far, even if he's arguably not even playing the real thing.\"[6]Roger Ebert of the Chicago Sun-Times gave the film three out of four stars and highlighted the film's \"delightful wackiness\" and stating, \"It has the damnedest ingratiating way of making us sit there and grin at its harebrained audacity, laugh at its outhouse humor, and be somewhat moved (not deeply, but somewhat) at the poignancy of these two old men and their situation.\"[7]","box_office":"$1.2 million[1]","cinematography":"Adam Janeiro","production_company":"Silver Sphere Corporation","directed_by":"Don Coscarelli","Proposed sequel":"Initially Coscarelli never intended to create a sequel to Bubba Ho-Tep, as the end credits announcement of a second film entitled Bubba Nosferatu: Curse of the She-Vampires was meant to be seen as a joke.[8] He eventually changed his mind about this after seeing the positive reception for the first film and after several people inquired about when the sequel would release.[8] The sequel would center around the production of a 'lost' Elvis movie from the 1950s or 1960s, and would bring in Paul Giamatti as Colonel Tom Parker.In 2007 Bruce Campbell reported that he was no longer involved in the sequel, as he and Coscarelli had \"a few points [developing the screenplay] that we couldn't reconcile\" and that he parted ways with the project as a way of keeping his friendship with the director.[9] The project was briefly reported as \"dead\" by Joe Lansdale in February 2008,[10] but later that same year Giamatti asserted that the film was still alive and that Ron Perlman was interested in taking over the role of Elvis.[11] Due to the amount of time that had passed since the release of Bubba Ho-Tep, Coscarelli and Giamatti had trouble raising funding for the film and the movie went back into development hell.[12] However Giamatti reported that they were still trying to get the film made and that they had plans to create a franchise that would include plot lines such as Elvis battling aliens.[12][13] As of 2013 Giamatti has confirmed that a script has been written and that it was \"really great\", and that he hoped that they would be able to eventually make the film.[14]","release_dates":"June 9, 2002 (2002-06-09)","Production":"Many of Bubba Ho-tep's crew also worked on the films in Coscarelli's Phantasm series. Several actors from the series also have small roles including Heidi Marnhout, Bob Ivy, and Reggie Bannister. Coscarelli kept much of the original short story's exposition, but had some difficulty trying to \"integrate Elvis' voice\".[2]","produced_by":"Don Coscarelli Jason R. Savage","starring":"Bruce Campbell Ossie Davis Ella Joyce Heidi Marnhout Bob Ivy","running_time":"92 minutes","music_by":"Brian Tyler","edited_by":"Scott J. Gill Donald Milne","budget":"$1 million"}