{"country":"United Kingdom","distributed_by":"Palace Films (United Kingdom) Miramax Films (United States)","Plot":"Rosanna Arquette stars as Martha Travis, a medium who hosts a touring clairvoyant show with her alcoholic father Walter (Jason Robards) where she helps members of the audience make contact with deceased relatives. At one meeting, she foretells the violent death of a local factory employee (Olek Krupa), a whistleblower who was set to reveal corporate malpractice at the plant, and soon becomes the target of the killer herself. At a subsequent meeting in the town, she appears to identify several other individuals who are set to die or be killed. A sceptical local journalist investigating the death, Gary Wallace (Tom Hulce), begins following the couple and the story. The story is told in flashback, with the opening scenes showing Wallace searching for the reclusive Martha many years after the events depicted in the main body of the film.","Release and reception":"Although the film received some critical support and is often described as Hodges's best film since Get Carter,[1] it did not get a full release in the UK and US. At the time, the production companies that distributed film, Palace Films in the United Kingdom and Miramax in the United States, were suffering financially so the film only had a token release. It was shown at theatres overseas as well as at various film festivals. The film was finally released on videocassette on 9 January 1992 by Media Home Entertainment through Fox Video. In 2005, Trinity Home Entertainment released the film on DVD, but in full screen and without any bonus material. In the UK, Anchor Bay released the film in widescreen and also with a Mike Hodges commentary and snippets of the making of Black Rainbow with the cast and crew.","cinematography":"Gerry Fisher","production_company":"Goldcrest Films","directed_by":"Mike Hodges","release_dates":"1989 (1989)|||||","produced_by":"Geoffrey Helman John Quested","starring":"Rosanna Arquette Jason Robards Jr. Tom Hulce Mark Joy Ron Rosenthal John Bennes","running_time":"103 min.","music_by":"John Scott","edited_by":"Malcolm Cooke","written_by":"Mike Hodges"}