{"based_on":"Bridget Jones's Diary  by Helen Fielding","Cast":"Also, Salman Rushdie and Jeffrey Archer[1] have cameos in the film, which pokes fun at Archer's hack writer reputation. Honor Blackman also has a cameo[2] as a party guest. Christopher Kouros also made an appearance as the singing Greek chef in the restaurant fight scene.Andrew Davies, screenwriter of the 1995 television adaptation of Pride and Prejudice, collaborated on the screenplays for the 2001 and 2004 Bridget Jones films, in which Crispin Bonham-Carter (Mr. Bingley) and Lucy Robinson (Mrs. Hurst) appeared in minor roles. The self-referential in-joke between the projects convinced Colin Firth to accept the role of Mark Darcy,[3] as it gave him an opportunity to ridicule and liberate himself from his Pride and Prejudice character.[4]","country":"United Kingdom, France, USA","Awards and nominations":"Renée Zellweger was nominated for the Academy Award for Best Actress, the BAFTA Award for Best Actress in a Leading Role, the Broadcast Film Critics Association Award for Best Actress, the Empire Award for Best Actress, the Golden Globe Award for Best Actress – Motion Picture Musical or Comedy, the MTV Movie Award for Best Kiss (shared with Colin Firth), the Satellite Award for Best Actress – Motion Picture Musical or Comedy, the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role, the Teen Choice Award for Choice Chemistry (shared with Hugh Grant), the Teen Choice Award for Choice Liplock (shared with Grant), and the Dallas–Fort Worth Film Critics Association Award for Best Actress. Firth won the European Film Awards Audience Award for Best Actor and the European Film Award – Jameson People's Choice Award – Best Actor and was nominated for the BAFTA Award for Best Actor in a Supporting Role and the Satellite Award for Best Actor – Motion Picture Musical or Comedy. Grant won the Evening Standard British Film Awards' Peter Sellers Award for Comedy and was nominated for the Empire Award for Best British Actor, the Satellite Award for Best Supporting Actor – Motion Picture Musical or Comedy, and the European Film Award – Jameson People's Choice Award – Best Actor. Richard Curtis, Andrew Davies, and Helen Fielding were nominated for the BAFTA Award for Best Adapted Screenplay. The film was nominated for the BAFTA Award for Best British Film, the Golden Globe Award for Best Motion Picture – Musical or Comedy, and the Satellite Award for Best Film – Musical or Comedy.","distributed_by":"Miramax Films (United States) Universal Pictures (International)","language":"English","box_office":"$281,929,795","cinematography":"Stuart Dryburgh","production_company":"StudioCanal Working Title Films Little Bird","directed_by":"Sharon Maguire","DVD and VHS release":"The VHS was released in 2001 containing over 35 minutes of bonus material which includes: Deleted Scenes, Exclusive Interviews, Bridget’s Guide to “Getting It Right”. There was also a VHS of \"The Making of Bridget Jones\". In 2001 the film was released on DVD containing brand new bonus material and in 2011 a Blu-ray version of the film was released. A Collective Edition of the film was released in 2004 with new bonus material including; The Bridget Phenomenon, The Young And The Mateless, Portrait Of The Makeup Artist, Domestic and International TV Spots, Bridget Jones: The Edge Of Reason Theatrical Trailer, Bridget Jones's Diary Reviews and A Guide to Bridget Britishism.","Musical adaptation":"The film version is currently being adapted into a musical, set to hit London's West End, although no date has been set. British musician Lily Allen has written the score and lyrics, and Stephen Daldry, best known for his Tony award-winning work on the West End and Broadway productions of Billy Elliot, will be directing, joined by his co-worker Peter Darling, who will serve as choreographer.An official cast for the production has not yet been announced, but workshops for the show have already begun with television actress and current star of Legally Blonde, Sheridan Smith, in the title role.[41]","release_dates":"4 April 2001 (2001-04-04) (UK premiere)|13 April 2001 (2001-04-13) (UK/US)|10 October 2001 (2001-10-10) (France)|||","Production":"Working Title Films acquired the film rights of the novel in 1997 before it became a best-seller.[5]Actresses who were considered for the role of Bridget Jones were Helena Bonham Carter,[6] Cate Blanchett,[6] Emily Watson,[7] Rachel Weisz[8] and Cameron Diaz.[9] Toni Collette declined the role because she was on Broadway starring in The Wild Party at the time.[10] Kate Winslet[6] was also considered, but the producers decided she was too young. Zellweger's participation to the film was announced in late February 2000 which concluded a two-year search. Producer Eric Fellner explained that she \"brings enormous character and conviction to the part\".[11] Maguire said of Zellweger, \"I saw in Renee a gift few people have, that she was able to straddle comedy and emotion.\"[6] Zellweger worked on her accent with Barbara Berkery, who had helped Gwyneth Paltrow for Shakespeare in Love.[6] She also gained 20 pounds for the part.[12] To prepare for the role, Zellweger worked at the producers' request at London book publishers Picador as a trainee in the publicity department.[5] Before the film was released, a considerable amount of controversy surrounded the casting of the American Zellweger as what some saw as a quintessentially British heroine.[13][14] However, her performance, including her south-eastern English accent, is widely considered to be of a high standard.[15][16][17] In April 2000, the leading male roles were given to Colin Firth and Hugh Grant.[18] The director of the film, Sharon Maguire, is one of Fielding's friends, on whom the character of Shazza (or Shazzer, short for Sharon[19]) was reportedly based. In the film, Shazza is played by Sally Phillips.Principal photography began on 16 May 2000 and concluded on 8 August 2000. The crew spent six weeks shooting in and around London.[5] Locations used included Shad Thames where Bridget and Daniel have their first date, the Royal Courts of Justice, St Pancras railway station and Tower Bridge.[5] Scenes were filmed at Stoke Park in Buckinghamshire where Bridget and Daniel ventured to for their mini-break.[20] Wrotham Park in Hertfordshire served as the Darcys' home.[5] Stansted Airport doubled as JFK Airport in New York, while Syon House in Brentford featured as the venue for the anniversary party. The crew filmed for four days at Snowshill in Gloucestershire which featured as the home of Bridget Jones's family.[5][21] After six weeks of shooting on location, the crew moved to Shepperton Studios in Surrey.[5]","running_time":"97 minutes","bridget_jones's_diary":"Theatrical release poster","budget":"$26 million","screenplay_by":"Andrew Davies Richard Curtis Helen Fielding","Plot":"Bridget Jones (Renée Zellweger) is in her early thirties, single, very accident-prone and worried about her weight. She works in publicity at a book publishing company in London where her main focus is fantasising about her boss, Daniel Cleaver (Hugh Grant). At a New Year party hosted by her parents, she re-encounters Mark Darcy (Colin Firth), the barrister son of her parents' friends. They had known each other as children. After their initial encounter, Mark thinks that Bridget is a fool and vulgar and Bridget thinks that he is arrogant and rude, and is disgusted by his novelty Christmas jumper. After overhearing Mark grumble to his mother about her attempts to set him up with \"a verbally incontinent spinster who smokes like a chimney, drinks like a fish and dresses like her mother\", she decides to turn her life around. She starts her own diary, which covers all her attempts to stop smoking, lose weight and find her Mr. Right.Bridget and Daniel begin to flirt heavily at work, first over email, ahead of an important book launch, at which Bridget bumps into Mark and his glamorous but haughty colleague Natasha (Embeth Davidtz). Bridget leaves with Daniel and they have dinner, despite the fact that he is a notorious womaniser with a questionable personality, of which Bridget is aware. Bridget learns from Daniel that he and Mark have a history and, as a result, hate each other. Daniel informs Bridget of their falling-out, telling her that Mark broke their friendship by sleeping with his fiancée.Bridget is invited to a family party, and she takes Daniel along as her 'plus one'. They spend the day before the party at a country house hotel, where Mark and Natasha are also staying. Daniel makes an excuse about not being able to attend, and sends Bridget to the party alone. His dubious character becomes clearer to Bridget and she eventually breaks off their relationship when she catches him with another woman, a colleague of his, Lara (Lisa Barbuscia). Bridget begins to search for a new job and after landing a job in television, quits her role at the publishing house without giving notice. Daniel makes a desperate attempt to convince Bridget to stay, only for her to retort that \"I'd rather have a job wiping Saddam Hussein's arse\".Bridget has a long-standing invitation to a friend's dinner party, where she is the only single person and distraught to see Mark and Natasha seated at the table. During the party, Mark privately confesses to Bridget that, despite her faults, he likes her \"just the way she is\". He later helps Bridget to achieve an exclusive TV interview in a landmark legal case.Bridget begins to develop feelings for Mark, and he comes to her rescue at her birthday dinner party at her flat in Borough, which she is disastrously attempting to cater for herself. Daniel drunkenly visits, temporarily claiming Bridget's attention. Mark leaves the party, but returns to face Daniel. Mark punches Daniel and the two fight. They end up in a nearby restaurant and finally smash through the window, landing on the street. Mark wins the battle and knocks Daniel out. Bridget chides Mark for being mean and he leaves, but after an insensitive appeal by Daniel, she also rejects him emphatically.In the meantime, Bridget's mother, Pamela (Gemma Jones) temporarily leaves Bridget's father, Colin (Jim Broadbent) and begins an affair with a perma-tanned shopping channel presenter named Julian. After the affair is over and she has reconciled with Colin, she returns to the Jones family home and unintentionally reveals a truth: that Mark and Daniel's falling-out resulted from Daniel (who was Mark's best friend at Cambridge University) seducing Mark's wife, not the other way around, as Daniel had led Bridget to believe.At the Darcys' ruby wedding anniversary party the same day, Bridget confesses her feelings for Mark, only to find out that he and Natasha are both leaving to accept jobs in New York. Bridget interrupts the toast to their pending engagement with a stuttering but moving speech about England losing one of its finest men. Her words clearly have an effect on Mark, but he still flies to New York, though with obvious misgivings. Bridget's friends rally to repair her broken heart with a surprise trip to Paris, and just as they are about to leave, Mark appears at Bridget's flat.When they are about to kiss for the first time, Bridget goes to her bedroom to change into sexier underwear. While Bridget is changing, Mark peeks at her diary, in which she has written many insults about him. Bridget returns to find that he has left. Realising that he had read her diary and that she might potentially lose him again, Bridget runs outside after him in the snow with a thin sweater and tiger skin-print underwear. Unable to find him, she is disheartened and is about to return home when Mark appears having bought a new diary for Bridget in order \"to make a fresh start\". They kiss in the snow-covered streets. Bridget then notes that \"nice boys don't kiss like that\", to which Mark, contrary to his uptight nature, retorts \"Oh yes they fucking do.\"","Reception":"The film holds a 81% approval rating on aggregate review site Rotten Tomatoes with an average score of 6.9/10, based on 154 reviews. The site's critical consensus reads: \"Though there was controversy over the choice of casting, Zellweger's Bridget Jones is a sympathetic, likable, funny character, giving this romantic comedy a lot of charm.\"[22] Another review aggregator, Metacritic, which assigns a weighted mean rating out of 100 to reviews from mainstream critics, calculated an average score of 66, based on 33 reviews, considered to be \"generally favorable reviews\".[23] Critic Roger Ebert gave the film 3.5 out of 4 possible stars.[24]","Soundtrack":"The film's soundtrack was composed by Patrick Doyle.It also features two hit songs that were released as singles, \"Out of Reach\" by Gabrielle and \"It's Raining Men\" by Geri Halliwell.Worldwide edition","produced_by":"Tim Bevan Eric Fellner Jonathan Cavendish","starring":"Renée Zellweger Hugh Grant Colin Firth Jim Broadbent Embeth Davidtz Gemma Jones","Connection to Pride and Prejudice":"Fielding has stated in many interviews that her novel was based upon both Jane Austen's work Pride and Prejudice and its popular 1995 BBC adaptation. This was also reflected in the decision to cast Colin Firth as Darcy, since he played the 'real' Mr. Darcy in the BBC adaptation of Pride and Prejudice. This is not the film's only connection to that serial – the screenplay was co-written by Andrew Davies, who had written the adaptation of Austen's novel for the BBC.[40]","music_by":"Patrick Doyle","edited_by":"Martin Walsh"}