{"country":"France","distributed_by":"Gaumont Film Company","Plot":"After the establishing shot of Montluc prison, but before the opening credits, the camera rests on a plaque commemorating the 7,000 prisoners who died at the hands of the Nazis.On the way to jail, Fontaine (François Leterrier), a member of the French Resistance, seizes an opportunity to escape his German captors when the car carrying him is forced to stop, but he is soon apprehended, beaten for his attempt, handcuffed and taken to the jail. At first he is incarcerated in a cell on the first floor of the prison, and he is able to talk to three French men who are exercising in the courtyard. The men obtain a safety pin for Fontaine, which gives him the ability to unlock his handcuffs. This turns out to be needless because he gives his parole to not escape and is moved to a cell on the top floor without handcuffs.Once in the new cell, Fontaine begins inspecting the door and discovers that the boards are joined together with low quality wood. Using an iron spoon he deliberately neglects to return after a meal, he begins to chip away at the wood. After weeks of work, he is able to remove three boards from the door, roam the hallway, get back in his cell and restore the appearance of the door.Fontaine is not the only prisoner trying to escape. Orsini (Jacques Ertaud) makes an attempt, but fails to get very far because his rope broke at the second wall. Orsini is tossed back in his cell, beaten up by the guards, and executed a few days later. Fontaine is not deterred from his plan. He makes hooks from the light fitting in his cell, fashions himself ropes from clothing and bedding and fastens the hooks to the rope with wires taken from his bed. The other prisoners grow somewhat skeptical of his escape plans, saying he is taking too long.After being taken to Gestapo headquarters to be informed that he is sentenced to execution, Fontaine is taken back to jail and put in the same cell. Soon he gets a cellmate, François Jost (Charles Le Clainche), a sixteen-year-old who had joined the German army. Fontaine is not sure whether he can trust Jost (whom he sees speaking on friendly terms with a German guard) and realizes he'll either have to kill him or take him with him in the escape. In the end, after Jost admits he too wants to escape, he chooses to trust the boy and tells him the plan. One night, they escape by gaining access to the roof of the building, roping down to the courtyard, killing the German guard there, climbing the next wall and then roping to the outside wall. They drop down into the street undetected and walk away.","language":"French, German","DVD and Blu-ray release":"New Yorker Video released the film on Region 1 DVD in 2004; it is currently out of print. Artificial Eye brought out a Region 2 version in the UK in April 2008. This disc contains a superior audio/video presentation and contains a Dutch documentary, The Road to Bresson, as an extra. Madman Entertainment released a Region 4 Australian DVD in July 2009. This release contains a scholarly audio commentary by Professor Ross Gibson of the Sydney College of the Arts, University of Sydney.Gaumont released a Blu-ray Disc in France on November 2, 2010.[4]","cinematography":"Léonce-Henri Burel","production_company":"Gaumont Film Company","a_man_escaped":"Poster","directed_by":"Robert Bresson","release_dates":"11 November 1956 (1956-11-11)|||||","Production":"The film is based on the memoirs of André Devigny, who escaped from the Montluc prison in Lyon in 1943, during World War II.[3]","produced_by":"Alain Poiré Jean Thuillier","starring":"François Leterrier Charles Le Clainche Maurice Beerblock Roland Monod","running_time":"99 minutes","music_by":"Wolfgang Amadeus Mozart","Scholarly and critical reception":"The film is sometimes considered Bresson's masterpiece.[5][6][7][8]","edited_by":"Raymond Lamy","written_by":"Robert Bresson"}