{"big_jake":"The second version of the theatrical release poster.","country":"United States","distributed_by":"Cinema Center Films through National General Pictures (1971, original) Paramount Pictures (2003, DVD, and 2011, Blu-Ray DVD)","screenplay_by":"Harry Julian Fink Rita M. Fink","Plot":"In 1909, there is a raid on the McCandles family ranch by a gang of ruthless outlaws led by John Fain. They massacre the ranch hands and kidnap Little Jake, the grandson, leaving a ransom note and heading back for Mexico, where they have been hiding out. Martha, the head of the family, is offered the help of both the army and the Texas Rangers in hunting the gang. She replies that this will be \"a harsh and unpleasant kind of business and will require an extremely harsh and unpleasant kind of person to see it through.\" In consequence, she sends for her estranged husband, the aging Jacob \"Big Jake\" McCandles, a near-legendary gunfighter who wanders the west with his Rough Collie, simply named Dog.When Jake arrives by train, he and Martha discuss a plan to take the ransom to the kidnappers, a million dollars in a big red strongbox, although Jake warns that, \"Pay or not, we run the risk of never seeing the boy again\". Then his son Michael rides up on a motorcycle, bringing word that he has seen the kidnappers in the Chilicothe Canyon. The Texas Ranger captain is present and offers the services of his men, equipped with three REO touring cars. They, however, are ambushed and their cars put out of action. Jake, preferring the old ways, has followed on horseback, accompanied by an old Apache associate, Sam Sharpnose. He is now joined by his sons, Michael and James, with whom his relations are tense because of his desertion of the family ten years before.That night, Fain rides into their camp to make arrangements for the handover, telling Jake that they will “send the boy's body back in a basket\" if anything should go wrong. Both men deny any personal stake in the business, each claiming to be \"just a messenger boy\". The family party crosses into Mexico the next day and checks into a hotel. Knowing that they have been followed by another gang intent on stealing the strongbox, Jake sets a trap for them and they are all killed. During the attack, the chest is blasted open, revealing clipped bundles of newspaper instead of money. Michael and James become suspicious of Jake and the three slug it out, but Jake assures them that it was both his and Martha's idea. James fears for Little Jake's life, but Jake tells them they'll have to go in anyway.A thunderstorm breaks and Pop Dawson, one of the outlaws, arrives to give them the details of the exchange. He warns them that a sniper will have a gun trained on the boy in case of a double-cross. Jake arranges for Michael to follow after them to take care of the sharp shooter and convinces Dawson that he had been killed in the fight. At the hideout, Jake is led in alone to where Fain and four other gang members are waiting, one of them holding a shotgun on the boy. Jake tosses the key of the chest to Fain, who opens it up to discover that he has been tricked.Fain orders his brother Will to kill the boy but he is shot by Jake. Dog is wounded by the sniper and Jake is wounded in the leg before Michael kills him. Jake tells the boy to escape but Little Jake is hunted by the machete wielding John Goodfellow, who has already hacked Sam to death. Dog comes to the rescue and is himself killed before Big Jake arrives and impales Goodfellow on a pitchfork. Fain rides up and is preparing to finish off the two of them when Michael arrives from where he had been waiting in ambush and blasts him off his horse. Before he dies, Fain asks, \"Who are you?\" When Jake answers, \"Jacob McCandles,\" Fain says, \"I thought you was dead,\" as have other characters during the course of the film. “Not hardly,\" Jake replies.With Little Jake rescued, and the broken family bonded, they prepare to head home.","language":"English","Reception":"Big Jake received generally favorable reviews from critics.[6] The film however was not a big box office success. Compared to its $4.8 million budget it earned $7,500,000 in the United States, making it the 26th highest grossing film of 1971.","box_office":"$7,500,000 (North American rentals)[1][2]","cinematography":"William H. Clothier","production_company":"Batjac Productions","directed_by":"George Sherman","DVD":"Big Jake was released to DVD by Paramount Home Entertainment on April 29, 2003 as a Region 1 widescreen DVD and on May 31, 2011 as a Region 1 widescreen Blu-ray DVD.","narrated_by":"George Fenneman","release_dates":"May 26, 1971 (1971-05-26)|||||","Production":"Written as The Million Dollar Kidnapping, which was used as the shooting title, it was filmed from early October to early December, 1970, in the Mexican states of Durango and Zacatecas,[4] including scenes shot at the El Saltito waterfall and Sierra De Organos (in the municipality of Sombrerete, Zacatecas).[5]John Wayne's real-life son, Patrick Wayne, portrays James McCandles in the film, while Robert Mitchum's son, Christopher Mitchum plays Michael McCandles. Wayne's youngest son Ethan Wayne is seen as his grandson, Little Jake, in the movie.Two collies, trained by Bob and Ruddy Weatherwax, played Dog, John Wayne's faithful companion: Silver and Laddie (Lassie Jr) for the stunts. Eventually Laddie won a PATSY award for his performance in Big Jake in 1971. The wooden base with a tile and a small brass placard read \"Award of Excellence - 1971 / Laddie (Dog) / Bobby Weatherwax, Owner-Trainer / Big Jake\". \"Streaks and tip\" from an aerosol can were used to make their coats darker.The couple who wrote the screenplay for the film, Harry Julian Fink and Rita M. Fink, also wrote the original script for Dirty Harry, which was also released in 1971. They also wrote Wayne's later film, Cahill US Marshal.This was the last of five films in which John Wayne and Maureen O'Hara appeared together. The previous four wereTheme music was composed by famed composer Elmer Bernstein.Director George Sherman and John Wayne were friends from their days in the 1930s when Sherman directed him in several westerns at Republic Pictures. Sherman was 63 years old at the time this film was shot and not in the best of health. Parts of the picture were shot in remote locations in Mexico, and when Sherman's health prevented him from going on location, Wayne directed the shooting himself. However, although he did direct enough of the picture to be listed as co-director, Wayne insisted that only Sherman's name be listed in the credits as director.","produced_by":"Michael Wayne","starring":"John Wayne Richard Boone Maureen O'Hara Patrick Wayne Christopher Mitchum Héctor Veira","running_time":"110 min.","music_by":"Elmer Bernstein","edited_by":"Harry Gerstad","budget":"$4.8 million"}