{"based_on":"Characters  by Brian Doyle-Murray Harold Ramis Douglas Kenney","country":"United States","The Gopher":"As in the first film, an animatronic gopher was used in Caddyshack II. This time, instead of tittering, the gopher was able to speak. His voice was provided by Frank Welker. Because of Bill Murray's involvement in the creation of the gopher for the first film, Murray sued producers of the film during post-production. Murray and the producers settled out of court for an undisclosed sum.Industrial Light and Magic supplied the visual effects for these scenes.","distributed_by":"Warner Bros.","screenplay_by":"Harold Ramis|Peter Torokvei|","Plot":"Kate Hartounian (Jessica Lundy) is the daughter of a wealthy and widowed real estate developer of Armenian and Jewish descent.[2] Eager to improve her lot in life, she makes friends with Miffy Young (Chynna Phillips), a snooty WASP girl, who encourages her and her father to join their country club.Kate and her father, Jack (Jackie Mason), apply for membership at Bushwood, the club from the first movie. Jack is a self-made millionaire, yet remains salt-of-the-earth, humble and good-hearted despite his wealth. His unpolished personality foils him on many occasions.When the current members meet Jack, who builds low-income housing in more upscale neighborhoods, his application to join is rejected. The rejection is borne out of his boorish personality and an earlier confrontation with Bushwood President (and Miffy's father) Chandler Young's (Robert Stack) wife. Cynthia Young (Dina Merrill) had tried unsuccessfully to persuade Jack to build his housing complex away from her neighborhood, but her less-than-subtle snobbery leads Jack to chase Cynthia with a bulldozer. It's actions like these that build a divide between Jack and Kate.Ty Webb (Chevy Chase) returns, this time as the club's majority owner, and while he likes Jack, he prefers to stay out of the way of the club's day-to-day operations.The elitist members of Bushwood reject Jack's membership application and pull strings to suspend his housing operation. In retaliation, Jack buys the majority stock to Bushwood from Ty and turns it into an amusement park. Chandler, incensed at the thought of a mere \"nouveau-riche\" individual getting the better of him, hires Captain Tom Everett (Dan Aykroyd) (who code-names Chandler “Mrs. Esterhaus”), a shell-shocked mercenary operating out of a lunch wagon, to \"discourage\" Jack from building any more structures on Bushwood property. The bumbling Everett decides to use explosive golf balls to do this.Meanwhile, Chandler uses his lawyers and connections to shut down Jack's housing construction site. Webb suggests that the dispute should be resolved like gentlemen, by facing each other in a golf match. If Chandler wins, Jack loses his construction site and the country club, and if Jack wins, he keeps the Bushwood and the housing project. Despite Jack's poor performance early in the match, with luck he ties the match before the final hole. However, during the hole, Jack is faced with a 50-foot putt, while Chandler faces a simple 2 foot putt. Using advice given to him by Webb before the match, Jack manages to use spiritual chanting and the adage \"be the ball\" to sink the nearly impossible putt. Chandler needs to sink the easy 2 foot putt to tie the match. Meanwhile, Everett, who foolishly shoots himself in the buttocks with a poison dart, fails to eliminate Jack as a gopher steals his explosive ball. The mischievous gopher replaces Chandler's ball with the explosive ball, and as his family encouragingly crowds around him as he taps in his final swing, the ball bursts and Jack wins the match.Though Kate is embarrassed by her father's actions, she is still loyal to him, as evidenced when she commiserates to Miffy, who suggests that she change her last name from Hartounian to Hart. Bewildered at the thought of turning her back on her family name, Kate turns her back on Miffy and makes up with her father.","language":"English","Reception":"The film grossed $11,798,302 compared to the original’s $39 million gross at the box office.[6] Rotten Tomatoes gives the film a score of 4% based on 23 reviews. The site's consensus reads: \"Handicapped by a family friendly PG rating, even the talents of Caddyshack II's all-star comic cast can't save it from its lazy, laughless script and uninspired direction.\"[7]The film also received four Golden Raspberry Award nominations; it won two. It was nominated for Worst Picture and Worst Actor (Jackie Mason), and won for Worst Supporting Actor (Dan Aykroyd) and Worst Original Song (\"Jack Fresh\").","box_office":"$11.8 million[1]","cinematography":"Harry Stradling, Jr.","directed_by":"Allan Arkush","caddyshack_ii":"Theatrical release poster","release_dates":"July 22, 1988 (1988-07-22)|||||","Production":"Harold Ramis, who co-wrote the original Caddyshack with Brian Doyle-Murray and Douglas Kenney, described Caddyshack II, which he co-wrote with Peter Torokvei, as \"terrible.\"[3] In an interview with The A.V. Club in 1999, Ramis said that, \"with Caddyshack II, the studio begged me. They said, \"Hey, we've got a great idea: 'The Shack is Back!'\" And I said \"No, I don't think so.\" But they said that Rodney [Dangerfield] really wanted to do it, and we could build it around Rodney. Rodney said, \"Come on, do it.\" Then the classic argument came up which says that if you don't do it, someone will, and it will be really bad. So I worked on a script with my partner Peter Torokvei, consulting with Rodney all the time. Then Rodney got into a fight with the studio and backed out. We had some success with Back to School, which I produced and wrote, and we were working with the same director, Alan Metter. When Rodney pulled out, I pulled out, and then they fired Alan and got someone else [Allan Arkush]. I got a call from [co-producer] Jon Peters saying, \"Come with us to New York; we're going to see Jackie Mason!\" I said, \"Ooh, don't do this. Why don't we let it die?\" And he said, \"No, it'll be great.\" But I didn't go, and they got other writers to finish it. I tried to take my name off that one, but they said if I took my name off, it would come out in the trades and I would hurt the film.\"[3]Ramis was later quoted as saying that Dangerfield was the only one who expressed any interest in doing a sequel in the first place. Ted Knight had died two years earlier, Bill Murray was not interested in reprising his role as Carl the greens keeper, and he said Chevy Chase had \"already moved on\", although Chase would be the only original cast member to appear in Caddyshack II. Dangerfield, after insisting on a number of script rewrites, said that he backed out of the film because he felt it would not be successful.[4]Chevy Chase was the only cast member from the original movie to reprise his role (and would publicly announce later that he regretted doing so). Although playing new characters in the sequel, Jackie Mason, Robert Stack, Dan Aykroyd and Jonathan Silverman play roles which are analogous to those played by Rodney Dangerfield, Ted Knight, Bill Murray, and Michael O'Keefe in the first movie. Cast reception was generally negative. At one point, Chase murmured to the film’s director Allan Arkush during post-production, \"Call me when you’ve dubbed the laugh-track,\" before walking away in disgust. Rodney Dangerfield was sued by Warner Bros. for refusing to appear in the film,[5] although Dangerfield was little-affected by this.The theme song for Caddyshack II is \"Nobody's Fool\", performed by Kenny Loggins, whose hit song \"I'm Alright\" was featured in the first film. Another song off of the soundtrack, \"Go For Yours\", became an R&B hit for Lisa Lisa and Cult Jam. Also included is \"Turn On (The Beat Box)\" from Earth, Wind & Fire. The soundtrack was released on Columbia Records.","produced_by":"Neil Canton|Peter Guber|Jon Peters|","starring":"Jackie Mason|Robert Stack|Dyan Cannon|Dina Merrill|Jonathan Silverman|Brian McNamara|Marsha Warfield|Paul Bartel|Randy Quaid|Chevy Chase|Dan Aykroyd|","running_time":"98 minutes","music_by":"Ira Newborn","edited_by":"Bernard Gribble","budget":"$20 million[citation needed]"}