{"Cast":"The cast consisted mainly of the Broadway cast, with the addition of Kevin McCarthy from the original London Cast. However, Fredric March replaced Broadway actor Lee J. Cobb after concerns with Cobb's alleged past left-wing political associations arose.[2]","country":"United States","Awards and nominations":"1952 Golden Globe Awards1952 Venice Film FestivalNew York Times Critics' Pick1952 Academy Awards1952 Directors Guild of America Awards1952 British Academy Film Awards1952 Venice Film Festival1952 Writers Guild of America Award","screenplay_by":"Stanley Roberts","story_by":"Arthur Miller (playwright)","Digital restoration":"In 2013 digital restoration of the film was done by Sony. The digital pictures were frame by frame digitally restored at Prasad Corporation to remove dirt, tears, scratches and other artifacts. The film was restored to its original look. This was part of the Stanley Kramer 100 year celebration, he would have been 100 years old on Sept. 29, 2013.[8]","Plot":"Willy Loman has led a life consisting of sixty years of failure. Loman's wife supports him, but he soon begins to lose his grip on reality and slips between the past and the present, frantically trying to find where he went wrong.[2]","language":"English","Career of a Salesman":"Just before the film was about to come out, Arthur Miller threatened to sue Columbia Studios over the short which was to appear before Death of a Salesman.[5] This short film, Career of a Salesman, showed what the producers believed was a more typical American salesman, and was an attempt to defuse possible accusations that Death of a Salesman was an anti-American film.[5] Eventually, Columbia agreed to remove the ten-minute short from the film's theatrical run.[5]Miller saw Career of a Salesman as an attack upon his work, proclaiming \"Why the hell did you make the picture if you're so ashamed of it? Why should anybody not get up and walk out of the theatre if Death of a Salesman is so outmoded and pointless?\"[5] He argued against the portrayal of the salesman profession as \"a wonderful profession, that people thrived on it, and there were no problems at all\".[6] Eventually, the very attitude that led Columbia to commission the intro led to the failure of Death of a Salesman: people and businessmen in a 1950s political climate tried to distance themselves from a film depicting American failure in the 1950s.[2][5]","Reception":"Though the film won over many film critics and received nominations for many awards, it was a box office failure. The subject matter, the failure of the American dream, did not appeal to many of the era's moviegoers.[2] Miller himself denounced the adaptation of his play, claiming the actors all sounded like \"Willy Loman with a diploma, fat with their success\".[5] He also claimed that, though he wrote the play cinematically, Benedek managed to \"chop off almost every climax of the play as though with a lawnmower\" and portray Loman as a lunatic, rather than a victim.[5][6]As of September 2011, the film has never been commercially released in any home-viewing format, primarily because Columbia lost the rights when they were sold for the television remake with Dustin Hoffman.[citation needed] However, the film was preserved in 2013 by Columbia and The Film Foundation, which would suggest that the rights problem may have at last been resolved.","box_office":"$1.2 million (US rental)[3]","death_of_a_salesman":"Theatrical release poster","cinematography":"Franz Planer","production_company":"Columbia Pictures[1]","directed_by":"László Benedek","release_dates":"December 20, 1951 (1951-12-20)|||||","Production":"Benedek took great care in making the film a close transcription of the play.[1] In many places, the film uses Miller's lines verbatim, sometimes leaving out only small lines of dialogue.[1] However, the playwright claimed the movie was ruined by the truncation of key scenes.[7] In fact, the playwright had no involvement with or control over the movie.[6] Benedek also stressed the dreary, middle class setting of the film, using small rooms and gray shots.[1] The movie was filmed primarily in Brooklyn.[1]","produced_by":"Stanley Kramer","starring":"Fredric March Mildred Dunnock Kevin McCarthy Cameron Mitchell","running_time":"115 minutes[2]","music_by":"Alex North"}