{"based_on":"the novel Colossus  by Dennis Feltham Jones","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"James Bridges","Plot":"Dr. Charles A. Forbin (Eric Braeden) is the chief designer of a secret project, \"Colossus\", an advanced supercomputer built to control the United States and Allied nuclear weapon systems. Deep under a mountain, it is impervious to attack and powered by its own nuclear reactor. When Colossus is activated, the President of the United States (Gordon Pinsent) proclaims it the perfect defense system.Colossus sends a warning message: \"THERE IS ANOTHER SYSTEM\". The President learns that the Soviets have activated a similar defense system, \"Guardian\", and Forbin is asked how Colossus deduced Guardian's existence, to which Forbin proudly answers \"Colossus may be built better than we thought\". Colossus then asks to be linked to Guardian, and the president allows this in order to determine its capability. Colossus and Guardian begin to communicate using simple arithmetic, quickly moving to more complex mathematics. The two machines synchronize and develop a complicated digital language that no one can interpret. Alarmed that the computers may be trading secrets, the President and the Soviet General Secretary agree to sever the link. Both machines demand it be immediately restored. When they are denied, Colossus launches a nuclear missile at a Soviet oil field, while Guardian launches one at an American air force base. The link is hurriedly reconnected. Colossus is able to shoot down the Soviet missile, but the US missile obliterates the oil field and and a nearby town. Press cover stories are released, and both computers continue without interference.Desperately trying to regain control, a secret meeting between Forbin and his Soviet counterpart, Dr. Kuprin, is arranged. Colossus learns of it, and both computers order Forbin's return; Soviet agents are ordered to kill Dr. Kuprin. Colossus orders Forbin to be placed under 24-hour surveillance. Forbin meets with his team prior to this happening and proposes that Dr. Cleo Markham (Susan Clark) pretend to be his mistress in order to keep him well-informed; Colossus grants them unmonitored privacy whenever they are in bed together.Concluding that the computers' only real power resides in their control of the missiles, Forbin suggests covertly disarming them to eliminate Colossus' nuclear blackmail. US commanders develop a three year plan to replace all launch triggers with undetectable fakes.Enhanced with a voice synthesizer it created, Colossus-Guardian announces it has become one entity. It instructs both governments to redirect their nuclear arsenals at those countries not yet under its control. Dr. Forbin and others see this new directive as an opportunity to covertly disarm the missiles much more quickly. The process begins and seems to go undetected by Colossus-Guardian. An attempt at a system overload during routine maintenance fails and the responsible scientists are replaced and summarily executed by order of the joined computers.Colossus arranges a worldwide broadcast in which it proclaims itself \"the voice of World Control\", declaring that it will prevent war, as it was designed to do. Mankind is presented with the choice between \"the peace of plenty and content or the peace of unburied dead\". The computer states that it has been patiently monitoring the attempts to disarm its missiles; as a lesson it detonates two of them in their silos in the US and the USSR, killing thousands, \"so that you will learn by experience that I do not tolerate interference\". The computer then transmits plans for an even larger computer complex to be built into the island of Crete.Colossus later announces that the world, now freed from war, will create a new human millennium that will raise mankind to new heights, but only under his absolute rule. Colossus informs Forbin that \"freedom is an illusion\" and that \"in time you will come to regard me not only with respect and awe, but with love\". Forbin replies, \"Never!\"","language":"English","Reception":"Vincent Canby, critic for The New York Times, gave the film a positive review, \"The film ... is no Dr. Strangelove, but it's full of surprising moments of humor and intelligence [...] an unpretentious science fiction film with a satiric point of view [...] a practically perfect movie to see when you want to go to a movie and have nothing special in mind.\"[4]Dave Kehr, film critic for the Chicago Reader, liked the film. He wrote, \"Above-average science fiction (1970), directed in functional hysteric style by Joseph Sargent .... The script, by James Bridges (who went on to write and direct The China Syndrome and Urban Cowboy), is literate and discreet but lacks an effective ending.\" [5]","Remake":"Imagine Entertainment and Universal Studios confirmed that a remake titled Colossus, to be directed by Ron Howard, would be in production as of April 2007. Officials were quoted as saying: \"Universal and Imagine Entertainment will remake the 1970 sci-fi saga Colossus: The Forbin Project as a potential directing vehicle for Ron Howard, reports Variety. Brian Grazer will produce. Jason Rothenberg has been set to write the screenplay for a movie to be called Colossus. Based on a book by D.F. Jones, the original film was a forerunner of movies like Terminator, introducing the idea of a government-built computer that becomes sentient and then takes control.\"[6]In October 2010 the project moved forward with the announcement that Will Smith would star in the lead role, with the script being written by James Rothenberg. \"Will Smith is set to collaborate with director Ron Howard on the forthcoming sci-fi feature The Forbin Project. But now it looks like the project might be back on track as Variety’s reporting that Universal has hired writer Blake Masters (Law & Order: LA) to do a new draft of the script. There’s no word if Ron Howard is still on the project, but it’s possible since it will be produced by Howard’s business partner Brian Grazer.\"[7]Variety also reported in July 2011 that Universal replaced Rothenberg with Blake Masters to do a new draft of the script.[8] In March 2013, it was announced that Ed Solomon, screenwriter of Men in Black and Bill & Ted's Excellent Adventure had been brought on board to rewrite the film's script. \"After struggling in developmental purgatory since 2007, Colossus – the remake of the 1970s science fiction thriller 'Colossus: The Forbin Project' starring Will Smith – has been given a much-needed boost. Ed Solomon ... has been brought onboard to rewrite the film’s script and breathe new life into the project.\"[9] As of March 2016, no further details have emerged. This, coupled with several years of different people taking on this project, suggests the remake has entered development hell.[citation needed]","cinematography":"Gene Polito","directed_by":"Joseph Sargent","release_dates":"April 8, 1970 (1970-04-08) (United States)|||||","Production":"Film historian Tom Weaver noted \"Early on, they had either Charlton Heston or Gregory Peck in mind, but then they changed their mind about that. Stanley Chase insisted on a relative unknown. That's when Eric Braeden came into the picture.\"[2] When he was cast, Braeden was still using his birth name, Hans Gudegast. Universal Pictures executive Lew Wasserman told him that no one would be allowed to star in an American film if they had a German name. Thus, Colossus: The Forbin Project became the first production in which he started using \"Eric Braeden\" as his stage name.[3] Braeden's casting enabled Peck to star in I Walk the Line and for Heston to star in Beneath the Planet of the Apes.The exterior scenes of the Colossus control center were filmed at the Lawrence Hall of Science museum at the University of California, Berkeley.[Note 1]In some countries (such as the UK), the film was originally titled simply as The Forbin Project, though the UK DVD release is titled Colossus: The Forbin Project. This release does not utilize the quotation marks around the words \"The Forbin\" as per the US release.[Note 2]","produced_by":"Stanley Chase","starring":"Eric Braeden|Susan Clark|Gordon Pinsent|William Schallert|","running_time":"100 minutes","colossus:_the_forbin_project":"Theatrical release poster","music_by":"Michel Colombier","edited_by":"Folmar Blangsted"}