{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Every year, Samuel, Jeffrey, and Michael Douglas visit their Japanese grandfather, Mori Tanaka at his cabin. Mori trains his grandchildren in the art of Ninjutsu of which he is a master. As the summer comes to an end, Mori gives each of them a new \"ninja\" name based on their personalities: Samuel, the oldest who is solid and cool under pressure is named 'Rocky'. Free spirited and wild, he gives Jeffrey the name 'Colt' based off the animal. The youngest Michael earns the name 'Tum-Tum' due to his energy beginning and ending with his tummy.Meanwhile; their father, Sam Douglas, is an FBI agent who stages a sting operation to entrap Hugo Snyder in the sale of warheads. Snyder escapes the trap with the use of his own ninja henchmen. Checking out his money he received, he finds it was all blank cut sizes of paper shaped like money. Sam Douglas catches Snyder on the roof but a helicopter appears out of nowhere piloted by ninjas and start firing at him and Snyder escapes on a rope ladder. On the second-to-last day of his grandsons' visit, Snyder decides to test Mori's fighting skill. The boys ignore Mori's orders to stay in the house and aid by defeating two ninjas on their own. Snyder threatens Mori's family if he doesn't get Douglas off his back and Mori chides the boys briefly for interfering in his personal affairs. When they return home, they find their father with his partner Jerry and he is unenthusiastic to see what they had learned during their visit and more annoyed at their new names. He leaves in a hurry and their mother comforts them. Emily, a friend of Rocky's, compliments his new name and agrees to ride with them to school the next day. Snyder develops a plan to kidnap the boys to use them as leverage to get Douglas to back off. Since the FBI watches them, his assistant Brown contacts his nephew Fester and his buddies Hammer and Marcus, in the midst of a convenience store robbery, to kidnap the boys and they agree. Due to Douglas and his FBI crew's presence, they are unable to capture them.The next day, Fester and his friends attempt to follow the boys to school, but are side-tracked by a fender bender with a police car. Emily becomes separated from the boys and encounters a group of bullies who steal her bike. Emily becomes upset with Rocky for showing off and walks to school alone. At recess, the boys challenge the bullies to a two-on-two basketball game and they spot the bullies nine out of ten points before effortlessly humiliating and defeating them, winning back Emily's favor. That night, Colt learns that Snyder, who they assumed was a friend of Mori's, is actually the criminal their father is after and they begin to suspect Mori is involved in crime. They are left with a babysitter when Jessica leaves to pick up Sam, and Fester and his friends break into the house with a fake pizza order, subduing the babysitter. A series of intricate household traps keep the bumbling would-be kidnappers off of them and they use a device in Rocky's bedroom to call Emily over and use her as a hostage. Due to an earlier trap, Hammer and Marcus run to the bathrooms sick to their stomach as they have diarrhea and the boys (and mainly Emily) defeat the alone Fester. Hammer and Marcus are subsequently defeated. After freeing the babysitter though, they are overpowered by Brown and Snyder's bodyguard Rushmore, who were prompted to back up Fester and the others. Emily gives Jessica a note from Snyder claiming responsibility. Mori offers to sneak in alone to find the boys as not to raise the alarm to Snyder. The boys escape their captivity and after a series of fights through the ship, they come across Rushmore. Using a lesson they got on their last day and inspired by their grandfather who came to rescue them, they manage to subdue Rushmore and are reunited with Mori.Snyder confronts Mori and challenges him to a fight for the boys' freedom, but due to his youth and speed, Snyder almost proves too much for Mori, until he remembers a handful of Tum-Tum's jelly beans which Tum-Tum had given him for luck and uses them to gag Snyder. Mori gains the upperhand and knocks Snyder to the floor. Refusing defeat, Snyder grabs a gun from one of his subordinates, but is suddenly shot and subdued by Douglas who had arrived just in time. Snyder and his men are arrested. Sam later apologizes to Mori for underestimating him and gives him a hug before being advised from a pained Mori that a bow would work just fine. Sam then tells his partner Jerry to complete the paperwork of the night's events on his own as he has a whole family of heroes to take out for pizza which Mori detests, as he hates pizza.The international cut of the film features a number of small parts of scenes that were cut from the movie for its American release, most likely to ensure a PG rating. Amongst the cut scenes are [not all-inclusive]: Extra footage of Snyder's escape in which he confronts two FBI agents who he promptly defeats, A scene in which the robbers fire a gun in the convenience store and tie up the clerk behind the counter, a scene in which the robbers get the Douglas family address from Brown, additional footage of Grandpa trailing Snyder to his ship hideout, numerous small portions of the scene where the robbers invade the Douglas household, including Colt beating the robbers after getting them under a tarp in the room being renovated and a scene of Fester, the leader of the robbers asking his uncle (Brown) if he can be paid, extra sarcastic dialogue while the boys are locked up in Snyder's ship, an extended scene in which the boys are reunited with Grandpa, footage of Brown knocking himself unconscious on a pipe and subsequently complaining about his pain when being taken away by the Feds. Additionally, in the international version the boys lose the basketball challenge and their bikes, so a scene ends the international version of the film in which they fight the bullies to get them back.","3_ninjas":"Theatrical release poster","language":"English","Reception":"The film was received negatively by critics. It currently holds a 29% \"Rotten\" rating on Rotten Tomatoes, based on 21 reviews.[2][3] However, it did well at the box-office, received a cult status for its camp factor and spawned three less successful sequels 3 Ninjas Kick Back, 3 Ninjas Knuckle Up, and 3 Ninjas: High Noon at Mega Mountain.The movie opened at the box office in the #4 position, and by the end of its 6-week run in theaters grossed $29,000,301 USD domestically.[4][5] Considering that the film was budgeted at $2.5 million, it was a huge financial success, and turned out to be the most profitable film of the year in terms of cost-to-gross ratio.[6]","box_office":"$29 million","cinematography":"Richard Michalak","production_company":"Touchstone Pictures","directed_by":"Jon Turteltaub[1]","release_dates":"August 7, 1992 (1992-08-07) (North America)|||||","produced_by":"Martha Chang Shunji Hirano James Kang Jason Ing Yuriko Matsubara","starring":"Victor Wong|Michael Treanor|Max Elliott Slade|Chad Power|","running_time":"84 minutes","music_by":"Richard Marvin","edited_by":"David Rennie","written_by":"Kenny Kim Edward Emanuel","budget":"$2.5 million"}