{"country":"United Kingdom Netherlands","distributed_by":"Artificial Eye (UK) Skouras Pictures (US)","Plot":"Twin zoologists Oswald and Oliver Deuce (Brian Deacon and Eric Deacon) are at work studying the behaviour of animals at a zoo, when their wives are killed in a car accident involving a large swan. The woman who was driving the car, Alba Bewick (Andréa Ferréol), is not killed, but has a leg amputated.Venus de Milo (Frances Barber), a woman associated with the zoo, attempts to forge a relationship with the twins, ostensibly to help them recover from their loss. Meanwhile, Oswald and Oliver gradually become obsessed with images of growth and decay, watching videos on the origins of life and creating time-lapse video of decomposing life forms. They begin this latter task with a green apple, bitten into and rotting before their camera lens.The twins' descent sees them become romantically involved with Alba, and increasingly attached to one another. Venus de Milo remains involved with them enough to observe their obsessions grow: they take to video-taping the decomposition of prawns, and they take a personal interest in Alba's childhood, going so far as to ask her to show them a field seen in a photograph on her bedside table. They become obsessed with snails, and they take advantage of their contacts at the zoo to create decomposition videos of more and more complex animals, moving gradually up the food chain. Excerpts from Sir David Attenborough's TV series Life on Earth, including his narration, are featured in the film.[2]Alba becomes a subject for the experiments of her surgeon, who eventually amputates her other leg, claiming it is putting stress on her spine. His true motive is to fashion Alba into a subject of his recreations of Johannes Vermeer paintings; Venus de Milo participates in this process, as well.Ultimately, the Deuce brothers' obsession with decay leads them to the top of the food chain, and to a complex life-and-death negotiation with Alba herself. The brothers' project seems the only possible emotional investment for either of them, so Alba offers herself as the final specimen to be photographed in its decay. However her family intervenes before the brothers can claim her, so they are forced to find another way to create their final time-lapse video. They do so by returning to the field of Alba's childhood and setting up the necessary equipment to facilitate and capture their own decomposition. However a huge infestation of snails covers the equipment and bodies, and finally shorts out the electrical system, halting their grand project.","a_zed_&_two_noughts":"DVD cover","language":"English","Reception":"The film gained a mixed reaction.[3][4]","cinematography":"Sacha Vierny","directed_by":"Peter Greenaway","Soundtrack":"Elements of Michael Nyman's score invoke the \"Dies Irae\" section from Heinrich Ignaz Franz Biber's Requiem ex F con terza minore. The \"Angelfish Decay\"/\"Swan Rot\"/\"L'Escargot\" theme was originally written for Childs Play, a dance work commissioned by Lucinda Childs. Performance of the soundtrack is credited to Nyman, Alexander Balanescu, Elisabeth Perry, Sarah Leonard and \"The Zoo Orchestra\". While the score is in the Michael Nyman Band's repertoire, particularly \"Time Lapse\" and \"Prawn Watching\", they do not perform on the soundtrack.The album was issued on compact disc in the United States on 4 June 1991, with a new cover featuring Ferreol in-between the Deacons in bed, and the title spelled A Zed And Two Noughts. The original LP cover showed a zebra in a cage, as does the UK CD. A digitally remastered edition was released in the United States with the 1991 cover on 29 March 2004.","release_dates":"4 October 1985","produced_by":"Kees Kasander Peter Sainsbury","starring":"Andréa Ferréol Brian Deacon Eric Deacon Frances Barber Joss Ackland","running_time":"115 minutes","music_by":"Michael Nyman","written_by":"Peter Greenaway"}