{"a_place_for_lovers":"Theatrical release poster","country":"Italy France","distributed_by":"Metro-Goldwyn-Mayer","Plot":"The rich fashion designer Julia is tired of living because she knows she is suffering from a malignant cancer. When the woman leaves for her last holiday in Cortina d'Ampezzo, she meets the young and vital Valerio. The two fall in love instantly, but Julia does not reveal her secret to Valerio. When Valerio finds out that she is sick and dying, he decides to pretend to know nothing, continuing his love affair with Julia to the end.","language":"Italian, English","Reception":"The film opened to generally negative reviews. Roger Ebert of the Chicago Sun-Times called it the \"most godawful piece of pseudo-romantic slop I've ever seen!\", and Charles Champlin of the Los Angeles Times referred to it as \"the worst movie I have seen all year and possibly since 1926.\"[3] Mark Deming wrote in the New York Times that Dunaway and Mastroianni were romantically involved during the filming of Amanti but that little of their personal chemistry can be seen in the movie.[2] A Place for Lovers is widely considered to be one of the worst films of all time, and was listed in the 1978 book The Fifty Worst Films of All Time.","cinematography":"Pasqualino De Santis","production_company":"Compagnia Cinematografica Champion Les Films Concordia","directed_by":"Vittorio De Sica","Soundtrack":"Ella Fitzgerald provides two songs, the title song and Lonely is (\"What lonely is, is me!\"). Both songs can be heard on the Verve release Jukebox Ella: The Complete Verve Singles, Vol. 1.","release_dates":"19 December 1968 (1968-12-19) (Italy)|17 September 1969 (1969-09-17) (France)||||","produced_by":"Arthur Cohn Herschell Gordon Lewis Carlo Ponti","starring":"Faye Dunaway Marcello Mastroianni","running_time":"88 minutes[1]","music_by":"Manuel De Sica Lee Konitz","edited_by":"Adriana Novelli","written_by":"Brunello Rondi Julian Zimet Peter Baldwin Ennio De Concini Tonino Guerra Cesare Zavattini"}