{"based_on":"Knight and Day by James Mangold","country":"India","distributed_by":"Fox Star Studios/20th Century Fox International Productions","screenplay_by":"Original Screenplay:-Patrick O'Neill Adapted Screenplay:- Sujoy Ghosh Suresh Nair","story_by":"Patrick O'Neill","Plot":"The film opens in UK where Colonel Viren Nanda (Jimmy Shergill) goes to meet a wanted terrorist Omar Zafar (Danny Denzongpa) in his holding cell. As Viren informs Zaffar that he will be extradited back to India for his crimes, Zafar's men enter his holding cell, led by Hamid Gul (Jaaved Jaffrey), murdering all guards around them, with Zaffar then murdering Viren by shooting him and then burning him. As Zaffar escapes in a helicopter waiting on the roof, he puts a $5 million reward for someone to steal the Koh-i-Noor diamond from the Tower of London, but with one condition – the thief must be Indian, to hold up a new extradition treaty between India and UK. Soon after, a man named Rajveer Nanda (Hrithik Roshan) steals it, and when Zaffar's men are informed of the theft, they travel to Rajveer for the deal. Although they initially travel with the $5 million reward, Rajveer informs them that he now wants $20 million for the deal. Following the disdain of the comment made by Rajveer, a fight breaks out between Rajveer and Zaffar's men after which Rajveer flies away. After Rajveer escapes, a CCTV footage of him is captured, showing that he is in Shimla. Following Rajveer's escape, he sees Harleen (Katrina Kaif) sitting in a restaurant, who is there waiting for her internet date, \"Vickie\", to show up. Rajveer enters the restaurant posing as \"Vickie\" and woos her over. He convinces Harleen to use the bathroom and while she is in there, Rajveer fights the remaining men and leaves the restaurant, much to the dismay of Harleen. As she drives home, Harleen accidentally runs over Rajveer, who asks her to stitch up a gunshot wound sustained during the fight. Rajveer then gives Harleen drugged water, with her complying with what he says about the government officials, informing her about where to find guns underneath car seats and what they will say about him.The next day, the government officials with Zorawar (Pawan Malhotra) visit Harleen at her bank and threaten her to come with them. They tell her that if she does not accompany them, then they will reveal everything to her colleagues. Harleen decides to go with them to the police station. In the car, Zorawar tells her that they are not going to the station but they are taking her to a safe place instead. Harleen remembers about the gun that Rajveer had told her of. She engages the other official in small talk and finds the gun. She threatens both the officers to stop the car and let her go. At the same time, Rajveer appears on a bike and a chase sequence ensues. Both Rajveer and Harleen find a car and escape. When Rajveer goes out to shoot the goons, Harleen escapes and then bumps into her boss, Karan. She tells him about Rajveer and how random people are firing at her. Rajveer follows her. Karan tries to protect Harleen from Rajveer. He annoys Rajveer and gets shot by him in the leg. Harleen is exasperated but leaves with Rajveer again lest he shoots any more people.In the car, Harleen and Rajveer get into an argument. Harleen states that she wants to go home and that she did a huge mistake by trusting him. Rajveer angrily decides to let Harleen go and hands over the car keys to her. He tells her that he has no other motive than protecting her. She feels guilty and decides to stick to him. They begin to drive again in silence. Rajveer checks a location on his phone which Harleen notices. He then tells her that he has not killed an innocent person before this and does not want her to die. He tries to convince her to come with him for dinner.They go to Pizza Hut where Rajveer realises that he has no money to buy food. They get into an argument about it. He teases Harleen about her internet dating and she slaps him. He threatens to shoot the server (Aditya Prakash)and she eventually pays for the pizza. Harleen asks him about the crime that he has committed and Rajveer shows her the Koh-i-Noor much to her surprise. She has a hard time believing that he is indeed a thief. As she comes to know about Rajveer, they realise that they were followed by Zorawar who says he has the restaurant surrounded with his men and will not be afraid to shoot Rajveer if needed to. As the officials convince Harleen to go with them, Rajveer tells Harleen that he cannot let her go with them. He shoots her with a tranquiliser dart and they both jump out of a window and escape.Harleen slips in and out of consciousness as Rajveer continues to take her to safety. She wakes up in a beach shack wearing a bikini top and hot pants. She angrily asks Rajveer as to who changed her clothes and he confesses that he did it. She is irked beyond words. She beats him and bites his hand. Harleen then takes Rajveer's phone to call her grandmother, unbeknownst to her it allows the Government officials to track their position. After a shootout occurs between Rajveer and the Government officials, he escapes with Harleen with a help of a sea bob and a fly board.Harleen wakes up the next morning in Prague. As Rajveer was able to successfully lead the escape of them both, Harleen now entrusts Rajveer, subsequently falling in love with him. When Rajveer goes out of his hotel with Harleen, he sees that they are wanted by Interpol. Some policemen come at the moment and Rajveer ends up kissing Harleen passionately. Rajveer tracks Hamid Gul at a casino. Although he was to go alone, Harleen insists to take her along, to which he agrees. Staging a ploy for Gul's attention, Harleen and Gul meet in the hallway, who tells her that a romantic candlelit champagne drink is waiting for her on the roof of the casino. Following this, Rajveer visits Gul at the top of the casino, a fight ensues regarding the whereabouts of Zaffar and he ultimately kills Gul. In the meantime, Harleen is caught by Zorawar and is taken to the Indian Embassy in Prague, where Zorawar says that Rajveer actually came to Prague to find Gul. Harleen is asked to get the Koh-i-Noor back. That night, the two meet on a bridge, where Harleen says that the trust between them is broken. Rajveer activates the tracking device himself, allowing the officials to surround them. Rajveer gives the Koh-i-Noor to Harleen and jumps from the bridge and is assumed dead.Harleen then returns home and remembers an address that Rajveer had listed on his phone. At the address, Harleen meets Rajveer's father (Kanwaljit Singh) and his mother (Deepti Naval). At the house, Harleen sees photos of Rajveer (Jai) and Viren, who are later revealed to be brothers and Rajveer's mother revealing their back stories. Although it is confirmed that Viren was murdered, Rajveer's father says that he does not believe the story the Army told him, saying that Rajveer had drowned despite being a swimming champion in his youth, he was the only student who was able to cross the lake in only one breath. On her way home, Harleen is kidnapped by Zaffar, who knows that the diamond was a fake. Zorawar is then revealed to be Zaffar's right-hand man, and gives Harleen a truth-revealing drug to reveal the location of the real diamond. Harleen tells that Rajveer would have survived and is coming to kill Zaffar. Rajveer, silently kills every guard posted outside and places time bombs in every corner and enters the room. Zaffar then orders his men to beat Rajveer but before Zaffar is able to kill him Rajveer informs that the Koh-i-Noor was not stolen at all and it was a joint operation between MI6 and the Indian Secret Service to get Zaffar. The time bombs go off and destroys the castle. But Zaffar manages to escape and captures Harleen again,after making Rajveer crash. As they escape with her, Rajveer follows them with a F1 car and catches up to them. Zaffar enters a flight with Harleen. Killing the rest of Zaffar's men including Zorawar, Rajveer shoots at the flight blades evidently grounding the plane. Rajveer soon boards the plane and a final bout takes place between him and Zafar. After throwing him to the flames, Rajveer frees Harleen. When they are escaping from the aircraft, Zaffar emerges from the flames again and shoots Rajveer. Rajveer pushes Harleen out of the aircraft and a second bullet hits him. He then grabs the axe and charges towards Zaffar and kills him. When the aircraft is about to explode, he jumps out.He loses consciousness and is about to drown when Harleen grabs his hand. The authorities air lift an injured and unconscious Rajveer and Harleen.Rajveer then wakes up in hospital, where his boss Narayan (Vikram Gokhale) is sitting across him waiting for him to wake up. He congratulates Rajveer for successfully completing the mission. He rues about the fact that his brother was murdered and that his parents will never get to see him again. Also, he informs Rajveer that Harleen has been sent back to her home and he has to forget about her because she can become a threat to his life and also his weakness. Rajveer is also told that he will be shifted to a safe facility the next day. After the chief leaves, a nurse arrives and gives Rajveer a medicine to drink. As soon as Rajveer gulps down the medicine, he feels giddy and asks the nurse about it. The nurse turns around and removes her mask revealing that she is actually Harleen and the medicine was a sedative meant to knock Rajveer out. A surprised Rajveer tries to say her name but Harleen asks him to keep quiet. Rajveer faints and Harleen escapes from the hospital along with him. He continues to slip in and out of consciousness until the next morning. He wakes up and Harleen tells him that his one-day has arrived. Rajveer realises that she has brought him to his house. He silently thanks her, and they both meet his parents.","language":"Hindi[1]","Critical reception":"The film released worldwide on 2 October 2014 with early screenings in Dubai on 1 October.[citation needed]Domestically, Bang Bang! received mixed reviews from critics. The film was praised for its action sequences and performances while it was criticised by some for its story and screenplay.[70][71] Nandhini Srinivasan from \"FILMIBEAT\" gave 3 out of 5 stars and recommended this total action-packed fun entertainer for the long weekend holiday.[72]Paloma Sharma from Rediff, giving 2.5/5 rating to the movie called it \"A pointless official remake of an already bad original\",[73] while Raja sen, again from Rediff, also gave 2/5 stars and wrote that the film is \"a stupid, stupid film trying to be slick, a B-grade film made on an A-list budget.\".[74] Rajeev Masand on ibnlive gave the movie 2/5 stars commenting that The film then isn't unwatchable, but at 2 hours and 35 minutes, it certainly tests your patience.[75]The Indian Express rated it 1.5/5, calling Hrithik as\" the eye candy of the film\"[76]","box_office":"₹1.81 billion[2]","cinematography":"Sunil Patel","production_company":"Fox Star Studios","directed_by":"Siddharth Anand","Soundtrack":"The songs of the film are being composed by Vishal-Shekhar; whilst the background score has been composed by Salim-Sulaiman.[55] The digital album rights of the film were acquired by Zee Music Company.[56][57]The first look of the song \"Tu Meri\" was revealed on 20 August 2014 featuring Hrithik Roshan and Katrina Kaif.[58] On 21 August 2014 video of the same song was released. The song was written and sung by Vishal Dadlani.[59][60] Second song of the film \"Meherbaan\" featuring Hrithik Roshan and Katrina Kaif was released on 3 September 2014. This song was written by Anvita Dutt Guptan and sung by Ash King, Shilpa Rao and Shekhar Ravjiani.[61][62] The teaser of the title song was released on 16 September 2014 featuring Hrithik Roshan and Katrina Kaif.[63] On 17 September 2014 full video of the same song was released. The title track was written by Vishal Dadlani and sung by Benny Dayal and Neeti Mohan. It was choreographed by Bosco-Caesar. The song experience was \"fun\" for Hrithik, who said, \"It's my ode to the inspiration he (Michael Jackson) has been.\" While Katrina described her experience as \"Dancing with Hrithik was the biggest challenge. His flexibility is incredible. It is at a different level altogether. You have to be really good to match up to his energy. He has natural energy when he dances. It comes to him so effortlessly\".[64][65][66][67] All the songs were well received by audience with the positive response.[68][69]","release_dates":"2 October 2014 (2014-10-02)|||||","Production":"Earlier reports had suggested that Siddharth Anand, who made Salaam Namaste, Ta Ra Rum Pum, Bachna Ae Haseeno and Anjaana Anjaani in the past, planned to make his next film with Shahid Kapoor, but Shahid wanted to avoid comparisons with Hollywood star Tom Cruise and also had no dates for the film as he had opted Haider already. Soon news that Anand was planning a film with Hrithik Roshan. In September 2012, Hrithik was confirmed to play the lead role, with Katrina Kaif confirmed to play the female lead in the movie.[6][7][8] Hrithik started working on the film immediately after wrapping up Krrish 3, and charged a ₹300 million (US$4.5 million) fee for his performance in the film, which until then was the most any actor in Bollywood had charged up front.[9] The movie was soon revealed to be the official Bollywood remake of Knight and Day, starring Tom Cruise and Cameron Diaz.In December 2012, it was confirmed that the official remake of Knight and Day would be titled Bang Bang.[10] In March 2013, the movie's Kashmir schedule was cancelled.[11] Shooting for the film began on 1 May 2013, with the film scheduled to release on 1 May 2014.[12] Unique water action sequences were shot in Thailand and Greece. In an interview with Mumbai Mirror, Hrithik spoke about the action sequences in the film stating, \"I have pushed myself to the extreme for this stunt. This sequence called for mental and physical tenacity. The rush that I experienced while training and executing the sequence was out of the world. I was hooked to a sea plane while I did the stunt. I had trained non-stop to even attempt the sequence\". Hrithik refused to use any body double to perform the stunts.[13]Talking about another water action sequences, the film's director Siddharth Raj Anand revealed, \"We can control the action we shoot on land, but while shooting at sea, you're at the mercy of the tide. Three days before the shoot, Hrithik started practicing the stunts for five-six hours daily. It took us eight days to shoot the sequences in water. For another water action sequence, Hrithik trained for four days, before the shooting. He learnt to jetski with a speed boat pulling him along first. Then, an antiquated plane was brought in with an experienced pilot at the controls, so that it could be slowed down and speeded up at will.\"[14][15][16]In July 2013, one of the songs of the film, \"Meherbaan\" was shot in the city of Santorini in Greece and choreographed by Ahmed Khan.[17][18][19] In Phuket, Hrithik Roshan performed a stunt where he had to use a water jetpack called a Flyboard and go 45 feet high in the sky and then dive down in the water. It was for the first time that something like this was used in Bollywood or Hollywood and Hrithik became the first actor to do a flyboarding stunt in a film.[20][21] Hrithik was injured during this schedule and subsequently had to undergo a brain surgery for removal of a blood clot from his brain (Subdural haematoma).[22] Also, the Kashmir schedule of the film was delayed because of unrest in the valley.[23]The delays caused the film's release date to be postponed to 2 October 2014.[24] There were reports that the film had overshot its budget to ₹1.3 billion (US$19 million) from a planned budget of around 80–90 crore.[25] But film's director Siddharth Anand denied such reports, \"It's funny! Yes, Bang Bang! is a big-ticket film but its budget is as per the scale of the film. There's no question of exceeding it.\"[26] The shooting resumed in January 2014, in Shimla,[27] Manali, Mumbai, Abu Dhabi, Delhi[28] and Prague.[29] The shooting schedule in Shimla went on for straight six weeks.[30] The Manali bridge where the majority of scenes were shot, has become a grand tourist attraction and it was renamed as Bang Bang Point.[31][32] Just before Abu Dhabi segment of film, a song shoot was completed at an open-cafeteria in Film City, Mumbai on 19 April 2014. Shimla was created in Film City, Mumbai to can a song and few action sequence for the film. The film was shot for 20 days in Film City with the lead pair of Hrithik Roshan and Katrina Kaif. After wrapping up the Mumbai schedule, filming team left for Abu Dhabi.[33]The Abu Dhabi schedule of shooting was an intense action-packed schedule. In Abu Dhabi, filming started early May, and took place at various locations in Abu Dhabi including the Corniche, Liwa oasis, Hyatt Capital Gate Hotel, Qasr al Sarab, Emirates Palace and Yas Island. In one of the chase sequences in the film, 120 cars were involved. The film also had used Formula 1 cars.[34][35] Even after the brain surgery, all the stunts were performed by Hrithik himself. The stunts were designed by Andy Armstrong[36][37][37][38] and shot in Abu Dhabi.[39] The Abu Dhabi segment of shooting was completed on 20 May in collaboration with twofour54.[40][41] It is the first Bollywood film to be shot and co-produced in Abu Dhabi.[40] Last leg of the film was scheduled in Prague. One of the stunts where Hrithik was on water skies being pulled along by a sky plane was shot in a lake in Prague. Hrithik trained for four days to shoot this scene.[42] Shooting wrapped on 15 July 2014.[43][44]On the lines of the popular Ice Bucket Challenge – one of the biggest trends of the year, the dare on social media, Roshan came up with the dare-to-do game to Bollywood co-stars Aamir Khan, Shah Rukh Khan, Salman Khan, Nargis Fakhri, Sonam Kapoor, Ranveer Singh, Farhan Akhtar, Priyanka Chopra, Dino Morea, Uday Chopra and Dabboo Ratnani on Twitter asking them to post videos of themselves doing a particular task and adding the hashtag #bangbangdare to it. Hrithik even dared the smokers asking them not to smoke for 3 days.[45][46][47][48][49][50] One of the companies challenged Hrithik himself, and when he was asked to buy bed sheets from their store and if he did, ₹500,000 would be donated to city hospitals. He took the dare sportingly.[51] While most stars take to television shows to generate buzz about their films, Hrithik refrained from promoting his movie through reality TV shows.[52][53]To protect the movie from piracy, makers of film approached the Court of Piracy with the plea that the film should not be viewed on any device or broadcast on any platform through the Internet without their permission and submitted a list of 90 websites. The Court responded positively on that and restrained them all from making the movie available on the Internet.[54]","Box office":"Bang Bang! had a very good first day grossing around ₹248 million (US$3.7 million) nett in (Hindi) and around ₹12.5 million (US$190,000) nett in Tamil and Telugu according to Box Office India. The first day figures are the best ever for a Hrithik Roshan starrer.[77] Bang Bang! (Hindi) grossed ₹205 million (US$3.0 million) nett on day two (Friday). The film dropped around 17% from day one and the collections of the regional version fell more.[78] The film grossed ₹170 million (US$2.5 million) nett on its third day (Saturday) from its Hindi version and had a good weekend of ₹623 million (US$9.3 million) nett[79] but considering the period with day one being a national holiday and the next two days being holidays for Dussehra the film should have grossed higher. Bang Bang! (Hindi) had a good four-day weeeknd of around ₹803 million (US$12 million) nett as it grossed around ₹180 million (US$2.7 million) nett on its fourth day (Sunday).[80]Bang Bang! (Hindi) had a decent Monday and collected ₹133 million (US$2.0 million) nett due to holiday for Bakri Eid.[81] It held up fairly well on Tuesday and grossed around ₹82.5 million (US$1.2 million) nett.[82] Bang Bang! (Hindi) had the seventh highest first week collections ever as it grossed around ₹1,095 million (US$16 million) nett.[83] The collections were less than Hrithik Roshan's last film Krrish 3 despite it having a more favourable release date. The first week is well short of the top grossers despite the first week being a holiday or part holiday practically very day. Bang Bang! (Hindi) grossed good ₹1.13 billion (US$17 million) nett in the extended week run of 8 days.[84] The Tamil and Telugu versions of the film grossed ₹12.0 million (US$180,000) nett and ₹32.5 million (US$480,000) nett respectively.[85]Bang Bang! (Hindi) had a poor second weekend grossing around ₹138 million (US$2.1 million) nett.[86] The collections of the film had dropped badly in the second weekend. The film in Hindi grossed ₹210 million (US$3.1 million) nett approx in week two to take its two-week business to ₹1.34 billion (US$20 million) nett.[87] Bang Bang! (Hindi) grossed around ₹47.5 million (US$710,000) nett in its third weekend[88] and netted around ₹1,398 million (US$21 million) in three weeks.[89] Bang Bang! (Hindi) had a theatrical run for 5 weeks with a final domestic nett of around ₹1.81 billion (US$27 million).[90][91] The Tamil and Telugu versions of the film grossed around ₹60 million (US$890,000) nett.[92]Bang Bang! earned $4.89 million overseas in its opening weekend. The biggest debut came from the UAE ($1.8 million), North America ($1.35 million), United Kingdom ($922,000).[93] At the end of its theatrical run in overseas, the film earned $11.97 million. The highest revenue came from Gulf ($4.46 million), US/Canada ($2.62 million), UK (£1.165 million) and Australia (Aus $457,000).[94]","produced_by":"Fox Star Studios","starring":"Hrithik Roshan Katrina Kaif Danny Denzongpa Javed Jaffrey Jimmy Shergill","running_time":"156 minutes","Sequel":"Siddharth Anand in an interview with Deccan Chronicle suggested there could be a sequel to Bang Bang! with Siddharth Malhotra as the male lead.[95][96][97]","music_by":"Original Songs: Vishal-Shekhar Background Score: Salim-Sulaiman","edited_by":"Akiv Ali","written_by":"Abbas Tyrewala (Dialogue)"}