{"country":"United States","distributed_by":"Overture Films","capitalism:_a_love_story":"Theatrical release poster","language":"English|Russian|Spanish|","box_office":"$17.4 million[2]","cinematography":"Daniel Marracino|Jayme Roy|","directed_by":"Michael Moore","production_companies":"Dog Eat Dog Films The Weinstein Company","Awards and honors":"At the Venice Film Festival, Moore won the \"Leoncino d'Oro\" (\"Little Golden Lion\") award for his documentary, and he also received the festival's Open Prize.[22] The documentary was also nominated for the festival's Golden Lion award,[23] but lost to Lebanon.[24]","release_dates":"September 6, 2009 (2009-09-06) (VIFF)|October 2, 2009 (2009-10-02) (United States)||||","Production":"During the Cannes Film Festival in 2008, Overture Films and Paramount Vantage announced an upcoming project by director Michael Moore, though at the time they were vague about the project's theme. Originally thought to be a follow-up to the 2004 film Fahrenheit 9/11, it was revealed that Moore's film was to be a documentary about the financial crisis of 2007–2010. In February 2009, he issued an appeal to people who worked for Wall Street or in the financial industry to share firsthand information, requesting, \"Be a hero and help me expose the biggest swindle in American history.\"[5]Prior to the film's release, Moore partnered with web development company Concentric Sky to develop a companion website for the film.[6]","produced_by":"Anne Moore|Michael Moore|","running_time":"127 minutes[1]","music_by":"Jeff Gibbs","edited_by":"Jessica Brunetto|Alex Meiller|Tanya Meiller|Conor O'Neill|Pablo Proenza|T. Woody Richman|John Walter|","Release":"Capitalism: A Love Story premiered at the 66th Venice International Film Festival on September 6, 2009.[7] The film also screened at the Toronto International Film Festival on September 13 and at the New York Film Festival on September 21. On September 23, the film had a limited release at two theaters in New York City and two theaters in Los Angeles,[8] grossing $37,832 in its first day for a $9,458 per theater average.[9] The theater average was considered strong, though it did not beat the record opening of Moore's Fahrenheit 9/11, which grossed $83,922 at two theaters in one day.[8] Over the weekend of September 25, Capitalism grossed $231,964 in the four theaters.[10]The film had a wide release in 995 theaters in the United States and Canada on October 2, 2009,[2] about a year after the enacting of the Emergency Economic Stabilization Act of 2008, which approved a $700 billion bailout of Wall Street.[5] The film opened in eighth place at the box office on the first weekend of its wide release, grossing $4,447,378.[11] The final domestic total was $14,363,397,[2] making it the 16th highest grossing documentary in history (2014).[12]The review aggregate website Rotten Tomatoes reported that 75% out of 141 critics gave the film a positive review, with an average score of 6.7 out of 10.[13] Similar website Metacritic, which assigns a normalized rating out of 100 to mainstream critics' reviews, reported that the film has received an average score of 61 out of 100 based on 35 reviews.[14]Deborah Young, writing for the trade paper The Hollywood Reporter, wrote of Capitalism: A Love Story, \"Although it's less focused than Sicko or Fahrenheit 9/11... because its subject is more abstract, this is a typical Moore oeuvre: funny, often over the top and of dubious documentation, but with strongly made points that leave viewers much to ponder and debate after they walk out of the theater.\" Young acknowledged Moore's simplification of the topic and added, \"But here his talent is evident in creating two hours of engrossing cinema by contrasting a fast-moving montage of '50s archive images extolling free enterprise with the economic disaster of the present.\" The critic noted whom the documentary targeted: \"Though it blames all political parties, including the Democrats, for caving in with the bailout, the film is careful to spare President Barack Obama, who remains a symbol of hope for justice.\"[15]Leslie Felperin of the trade paper Variety wrote, \"Pic's target is less capitalism qua capitalism than the banking industry, which Moore skewers ruthlessly, explaining last year's economic meltdown in terms a sixth-grader could understand. That said, there's still plenty here to annoy right-wingers, as well as those who, however much they agree with Moore's politics, just can't stomach his oversimplification, on-the-nose sentimentality and goofball japery.\" Felperin said that the documentary was similarly structured to Moore's previous documentaries, \"Capitalism skips around considerably, laying down a mix of reportage, interviews and polemic.\" Felperin observed Moore's prominent role in his own documentary, believing it to be justified with relevance to crises in the automobile industry that Moore's family personally encountered. The critic complained that Moore strove \"to manipulate viewers' emotions with shots of crying children and tearjerking musical choices\", believing that the documentary worked better when the director let the topic unfold through various accounts.[16]Upon the film's February 2010 UK release, The Times said the film \"showcases Moore at his undeniably powerful best and his exploitative, manipulative worst\":[17]The film is brilliantly researched, both with regard to the labyrinthine web of connections between the world of finance and the corridors of power and the wittily used archive footage. Interviews with Senate insiders and financial experts are informative, and there’s an amusing sequence in which he quizzes a selection of priests and bishops who opine that capitalism is “evil” and was not, in fact, the preferred economic model of Our Lord. Then Moore goes and spoils it all by hauling out his trusty bullhorn for a series of lame stunts. Like the complacent clown prince of agitprop, Moore hectors Wall Street doormen and security guards, while the company bosses remain in their fortress made of money, blissfully unaware of the fat man making a scene on the street far below....But for all his cheap tactics, Moore mounts a persuasive case that something is rotten in the current economic system.The Associated Press's national business columnist Rachel Beck reviewed the accuracy of three points made in Capitalism:The Association of Advanced Life Underwriting issued a statement that Moore \"mischaracterized\" corporate owned life insurance, stating that the issues were addressed by Congress in the 1990s and again in 2006. The AALU further states that corporate-owned life insurance is taken out only on highly compensated employees, only with their knowledge and consent and that COLI finances employee benefits and protects jobs and that employees pay nothing for COLI but receive substantial benefits.[19]Upon the film's February 2010 theatrical release in the United Kingdom, film critic Mark Kermode, appearing on The Culture Show, asked the BBC's business editor Robert Peston whether Moore's \"crusading\" had been based on a misrepresentation of American capitalism. Canada's Centre for Research on Globalisation characterized the response: \"Peston cannot fault the facts of the movie, though he appears a little uncomfortable having to say so.\"[20]Religion expert Anthony Stevens-Arroyo stated that the film should be considered \"a special kind of Catholic achievement\" and asked whether Michael Moore should be named \"Catholic of the Year\" for raising the serious issues in the context of Catholic social teaching, and for presenting \"Catholic currents of social justice\" in the film.[21]","written_by":"Michael Moore","budget":"$20 million"}