{"country":"United States","distributed_by":"Buena Vista Pictures","story_by":"Lynn Siefert Michael Ritchie","Differences between real life and film":"Cool Runnings was loosely based on real life events surrounding the formation of the Jamaican bobsled team. Some of the incidents that occurred in the film were real, such as the favorites to win the four-man event being the Swiss team (which they did), and the crash that eliminated the Jamaicans from further competition. However, there were several creative liberties taken by the filmmakers in order to complete the story.The bobsledders portrayed in the film are fictional, although the people who conceived the idea of a Jamaican bobsled team were inspired by pushcart racers and tried to recruit top track sprinters. However, they did not find any elite sprinters interested in competing and instead recruited four sprinters from the Air Force for the team.Irving \"Irv\" Blitzer is a fictional character; the real team had several trainers, none of whom were connected to any cheating scandal. At the time of the movie's release, the United States had not won a gold medal in bobsleigh at the Winter Olympics in the four man event since 1948. They would not win the gold again until 2010.In the film, the team is formed by Jamaican sprinters after failing to qualify for the 1988 Summer Olympics. The Jamaican Summer Olympic Trials would have occurred following the Winter Olympics in Calgary.A fictional all-encompassing winter sports governing body, the \"International Alliance of Winter Sports\", appears in the film. In reality, each Winter Olympic Sport has its own governing body, and bobsledding falls under the jurisdiction of the International Bobsleigh & Skeleton Federation (or FIBT, the initials of its French name).One of the most fictionalized parts of Cool Runnings was the competition itself. The bobsled competition in the film consists of three individual runs held on three consecutive days, whereas in reality the Olympic bobsled competition consists of four runs - two runs a day held over two consecutive days. In the film, the Jamaicans are regarded as unwelcome outsiders to the Games by other countries (particularly East Germany) and ridiculed. In reality, the Jamaicans were treated as equals and there was no real animosity between the team and their competitors; in fact, the Jamaicans were aided by another team who lent them one of their backup sleds so they could qualify, so they did not have to buy another team's spare sled.While the Jamaicans did crash their bobsled on their fourth and final run, the film implied the team was a medal contender, having run a world record pace prior to the crash. In reality, they were in 24th place (out of 26) after their first run was completed in 58.04. Their second run was completed in 59.37, which was the next-to-worst time (25th). On the third run, they had the worst time (1:03.19, good for 26th place), which was almost five seconds behind the 25th fastest run. Of the 103 runs that were completed in the four-man competition, nobody else posted a time over one minute. So going into the final run, the Jamaicans were in 26th (last) place with a cumulative time of 3:00.60 after three runs. This placed them 3.23 seconds behind Portugal for 25th place, and 10.19 seconds behind the USSR team that was in third-place heading into the final run. They would have had to complete a world-record shattering time under 48.00 seconds to bring home a medal.[16]In the film, the crash happens on the third run and is depicted to have been caused by a mechanical failure in the front left blade of the sled. As the driver steers, a nut and bolt on the control column work loose, eventually causing a loss of control as the bobsleigh comes out of a turn and subsequently crashes.In reality, the crash happened in the fourth and final run, and it was deemed that driver inexperience, excess speed and regressing the turn too high caused the sled to become unstable and top heavy seconds prior to it toppling onto its left side. Real TV footage of the actual crash was used in the film but was heavily edited to fit in with the film's version of the crash. Both the run and the high speed crash were disorienting: team member Nelson Chris Stokes \"felt a bump\" when they tipped but did not realize they had turned over until he started to smell his helmet (which was fiberglass) friction-burning on the ice, \"which is something that stays with you for many years afterwards.\"[17]After the crash, the film depicted the Jamaicans carrying their sled on their shoulders to the finish to a slow-building standing ovation. In reality, they did not carry the sled but walked next to it. When the sled tipped, they were doing 80 miles per hour (130 km per hour), and their helmets scraped against the wall for 600 meters until they came to a stop.[18] They also received somewhat sporadic applause, less than the crescendo response in the movie,[19] but the real bobsled driver Dudley Stokes cites the spectator applause as the reason the run turned from tragedy to triumph for him.[18]The film also gives the impression that the Jamaicans were the only team from the Caribbean. This was the case in the four-man sled competition, which the movie focuses on. However, in the two-man competition there was also a bobsled team from the Netherlands Antilles which finished 29th (one place ahead of Jamaica's two-man sled team) and two teams from the United States Virgin Islands which finished 35th and 38th.The film focuses entirely on the four-man bobsled team, which crashed their sled and finished last out of the 26 teams, as all 25 other teams were able to complete all four runs. However, it ignores the fact that two members of the team (Dudley Stokes and Michael White) also competed in the two-man sled competition and successfully completed all four runs, finishing in 30th place out of 38 teams that finished all runs, with three other teams which did not finish. The remaining members of the four man sled team were Devon Harris and Chris Stokes (Dudley's younger brother).[20]","Legacy":"On January 18, 2014 the Jamaican bobsled team qualified for the 2 man bobsled at the 2014 Winter Olympics in Sochi, Russia. They have described themselves as \"Cool Runnings, The Second Generation.\" [21] In light of the team's qualification for the 2014 Olympics, Dudley Stokes, one of the original 1988 team and now general secretary of the Jamaica Bobsleigh Federation, said \"I don't think the support for the team, like we've seen over the last three days, would have been sustainable without the ongoing appeal of the movie\".[22] The team received funding from many sources, including one donation campaign held by the online community for the cryptocurrency Dogecoin.[23]","Plot":"Derice Bannock, a top 100m runner, fails to qualify at the Olympic Trial for the 1988 Summer Olympics when fellow runner Junior Bevil trips and falls, taking Derice and another runner, Yul Brenner, with him.To compete in the Olympics, he and his best friend, Sanka Coffie, a champion push cart racer, seek out Irv Blitzer, an old friend of Derice's father Ben who tried to recruit sprinters to the bobsled team years ago. Irving is an American bobsled two time Gold Medalist at the 1968 Winter Olympics who finished first in two events again during the 1972 Winter Olympics but was disqualified from the latter for cheating and retired in disgrace to Jamaica, where he leads an impoverished life as a bookie. Derice's persistence eventually convinces Irving to be their coach and return to the life he left behind. They eventually recruit Junior and Yul, though Yul is still upset over Junior's mistake at the Olympic Trial.The four try to find various ways to earn money to get in the Olympics but no sponsor takes the idea seriously and their various enterprises, from singing on the street to arm wrestling, and holding a kissing booth, all fail. Junior comes through for them when he sells his car, which gets the team the money that they need. Later on in a hotel room, Junior reprimands Sanka for hurting Yul's feelings over his ambitions. Junior tells the team about his own father's struggle and how he became rich with hard work. He encourages Yul not to give up on achieving all of his goals and the two begin to show a mutual respect for one another.In Calgary, Irving manages to acquire an old practice sled, as the Jamaicans have never been in an actual bobsled. The Jamaicans are looked down upon by other countries, in particular the East German team whose arrogant leader, Josef, tells them to go home, resulting in a bar fight. At the hotel room, Derice and Irv reprimand Sanka, Yul and Junior and remind them what is at stake for the team. The team resolves to view the contest more seriously, continuing to train and improve their technique. They qualify for the finals, but are subsequently disqualified due to a technicality which the Olympic committee trotted out as retribution for Irving's prior cheating scandal. A frustrated Irving storms the committee meeting and confronts his former coach from the 1972 Olympic Winter Games Kurt Hemphill, now a primary judge of the 1988 Olympic Winter Games. He takes responsibility for embarrassing his country with the scandal and implores the committee just punish him for his mistake, not the Jamaican team. Irv reminds them that the Jamaicans deserve to represent their country by competing in the Winter Games as contenders. That night at their hotel, the team gets a phone call informing them that the committee has reversed its decision and allows the Jamaicans to once again compete.The Jamaicans' first day on the track results in more embarrassment and a last place finish. Sanka identifies the problem as Derice trying to copy the Swiss team which he idolizes and convinces him that the best they can do is bobsled Jamaican. Once the team develops their own style and tradition, the second day improves; the Jamaican team finishes with a fast time which puts them in eighth position. Derice asks Irving about why he decided to cheat despite his gold medals and prestige; Irving tells Derice, \"A gold medal is a wonderful thing, but if you're not enough without it, you'll never be enough with it,\" and convinces him to think of himself as a champion even if he fails to win the gold.For the first half of the final day's race it looks as though the team will break the world bobsled speed record, until tragedy strikes: due to the sled being old, it cannot handle the high speed and eventually one of the sled's blades comes loose, causing it to flip onto its side as it comes out of a turn, leaving the team meters short of the finish line. Determined to finish the race, the team lift the sled over their shoulders and walk across the finish line to rousing applause from spectators, including Josef, Hempill, and Junior's father. The team, at the end, feel accomplished enough to return in four years to the next winter Olympics. A brief epilogue states the team returned to Jamaica as heroes and upon their return to the Winter Olympics four years later, they were treated as equals.","language":"English","Reception":"The film received positive reviews.[13] Cool Runnings has received a rating of 74% on Rotten Tomatoes based on 31 reviews, with 23 positive and 8 negative. The site's consensus states \"Cool Runnings rises above its formulaic sports-movie themes with charming performances, light humor, and uplifting tone.\"[14]The film debuted at #3.[15] The film had total domestic earnings of $68,856,263 in the United States and Canada, and $86,000,000 internationally (with $416,771 earned in Jamaica), for a total of $154,856,263 worldwide.","box_office":"$154.9 million","cinematography":"Phedon Papamichael","production_company":"Walt Disney Pictures","directed_by":"Jon Turteltaub","Home media":"On November 11, 1994, the film was released on VHS by Walt Disney Home Video in the United States. On August 24, 1999, the film was released on DVD by Walt Disney Home Video in the United States in Region 1. On September 1, 2000, the film was released on VHS by Walt Disney Studios in the United Kingdom. On January 22, 2001, the film was released on DVD by Walt Disney Studios in the United Kingdom in Region 2.","Music":"A soundtrack album with 11 tracks was released by Sony in 1993 on compact disc (Columbia Chaos OK 57553).In some European countries the soundtrack album was released by Sony with a 12th (bonus) track being Rise Above It performed by Lock Stock and Barrel (Columbia 474840 2). Songs from the sound track also featured in a little known musical \"Rasta in the Snow\", which was based on events of the real Jamaican sled team.","release_dates":"October 1, 1993 (1993-10-01)|||||","Production":"Jeff Sagansky, then president of TriStar Pictures, bought the rights to the Jamaican bobsledders' story in 1989. Producer Dawn Steel got involved with the project when it shifted from TriStar to Columbia Pictures. Michael Ritchie, who received a story credit, was originally interested in producing the film with Fran Rubel Kuzui as director. After leaving Columbia, Steel managed to convince Walt Disney Pictures to greenlight the project after the script was rewritten, the budget shortened, and Kuzui replaced by another director.[1][3][4] According to Leon Robinson, \"...there were script problems. It wasn't funny enough, the key elements were lacking, and it just wasn't working. It was meant to happen when it happened.\"[3] Leon, Doug E. Doug and Malik Yoba have all confirmed in their interview with Empire that it was originally meant to have been a serious sports drama film.[5][6][7] The film's working title was Blue Maaga.[8] Before Jon Turteltaub was officially hired, Jeremiah S. Chechik was slated to direct until he moved on to do Benny & Joon (1993) instead. Brian Gibson was also considered to direct, but he dropped out to do What's Love Got to Do with It (1993) instead.[1] Turteltaub used actual NBC sports footage from the 1988 Olympics and incorporated it into the film.[8] Rawle D. Lewis stated in an interview that the bobsled the characters used in the film was an actual bobsled whereas Sanka's egg was made of rubber.[9]According to Leon, \"The script has been following me around for 3 1/2 years.\" Leon signed on when Gibson was then the director at the time. Leon told The Seattle Times, \"I was signed more than a year before we actually started.\"[3][5] Doug got involved with the film in 1990: \"I found Cool Runnings three years ago, when my agent had it on his desk. I knew about the actual event it's based on, the Jamaican bobsled team that went to the '88 Olympics, and even though it's based pretty loosely I thought it made a great yarn.\"[10] At the time of Doug's audition, Chechik was attached as the director.[6] Doug told The Baltimore Sun \"...I got the offer to play Sanka, the guy I'd wanted to play from the very beginning.\"[10] Lewis had very little experience and was not even allowed to audition at first. He told The Seattle Times, \"I was hired to read lines to auditioning actors for just one day. That turned into three weeks. At first they told me they were looking for names, big stars, so I wouldn't be considered, but then they asked me to do a screen test.\"[3] He also told The Baltimore Sun, \"I came in to this film at first to coach the players in the authentic accents.\"[10] Lewis was officially hired in November 1992.[3] When asked by Empire how he got involved with the film, Yoba was introduced to the casting director, Jackie Brown, by \"a gentleman by the name of Jamal Joseph.\" At the time of Yoba's official casting, Gibson was still slated to direct.[7] Yoba later told Entertainment Weekly that he wrote the Jamaican bobsled song for his audition.[8] Lewis claimed that the executives at Disney wanted Kurt Russell for the role of Coach Blitzer. However, John Candy personally insisted on portraying the coach and agreed to take a pay cut to do the movie.[9][11][12] According to Yoba, Scott Glenn was also considered for the role.[7] Cuba Gooding, Jr., Jeffrey Wright and Eriq La Salle were each considered for a role as one of the four Jamaican bobsledders.[8][11]The film was shot in Calgary and Jamaica in February and March of 1993. The cast and crew filmed in Calgary first, to take advantage of the snow. Then they filmed at the Jamaican resorts of Montego Bay and Ocho Rios.[1] Dawn Steel was on the set every day in Calgary and Jamaica. According to Leon, \"(Steel) worked on the second unit for a while, and she said `Never again. I never want to direct.'\"[3]","produced_by":"Dawn Steel|Susan B. Landau|Chris Meledandri|Jeffrey Bydalek|","starring":"Leon|Doug E. Doug|Rawle D. Lewis|Malik Yoba|John Candy|","running_time":"98 minutes","cool_runnings":"Theatrical release poster","music_by":"Hans Zimmer","edited_by":"Bruce Green","written_by":"Lynn Siefert|Tommy Swerdlow|Michael Goldberg|","budget":"$14 million"}