{"country":"United States","distributed_by":"Allied Artists","Plot":"A U.S. Cavalry patrol including prisoner Wade Cooper (Dale Robertson) is ambushed as they are crossing the territory of Arizona by the Coyotero, a savage Indian tribe of the Apache nation. All are killed except Cooper who is left for dead. He wanders across the wasteland and is found near collapse by Nancy Mailer (Martha Hyer) who brings him to the Trading Post run by her husband, Clint Mailer (Wendell Corey). Mailer recognized Cooper as a hunted man with a price on his head, and refuses to assist in his recovery from wounds until his wife convinces him that he will die unless given medical attention. Mailer who has discovered a rich vein of gold and is resolved to go to any length to protect his find, is now blind with suspicion, both over the gold and jealousy of his wife, with Cooper at the Post.As the tensions mount amongst the three, a Coyotero raid traps them and takes Mailers son, Tim (Dandy Curran) and holds him as hostage with the understanding that Mailer will deliver hundreds of rifles within seven days to the Indians for their continued warfare against the white man. Clint Mailer leaves to get the rifles and in the interim, Cooper and Nancy Mailer are drawn closer together with the revelation that Tim is not the son of Mailer. Mailer returns without rifles. Cooper then executes a plan involving the stealing of the rifles from the army post, placing them in the gold mine carefully leaving the mine booby trapped. The mine is blown up as the Indians approach it, Tim is rescued, Cooper and Nancy escape and set out to start a new life with Tim.","language":"English","cinematography":"Kenneth Peach","directed_by":"Sidney Salkow","release_dates":"October 11, 1964 (1964-10-11)|||||","produced_by":"Sam Firks","starring":"Dale Robertson Martha Hyer Wendell Corey Dandy Curran","running_time":"91 mins","music_by":"Richard LaSalle André Previn","edited_by":"William Austin","written_by":"Mark Hanna (story) Robert E. Kent (screenplay)"}