{"country":"United States","distributed_by":"Aries Films","Plot":"After dropping off his two sons at Catholic school, the Lieutenant takes a few bumps of cocaine and drives to the scene of a double murder in The Bronx. Wandering away, the Lieutenant finds a drug dealer and gives him a bag of drugs from a crime scene, smoking crack during the exchange; the dealer promises to give him the money he makes from selling the drugs in a few days. At an apartment, the Lieutenant gets drunk and engages in a threesome with two women. Meanwhile, a nun is raped inside a church by two young hoodlums.The next morning, the Lieutenant learns that he has lost a bet on a National League Championship Series game between the New York Mets and the L.A. Dodgers. He tries to win back his money by doubling his wager on the Dodgers in the next game. At another crime scene, the Lieutenant rifles through the car and finds some drugs which he stashes in his suit jacket. However, he is too impaired to secure the drugs, and they fall out onto the street in front of his colleagues. The Lieutenant tries to play it off by instructing them to enter the drugs into evidence.At the hospital, the Lieutenant spies on the nun's examination, and learns that she was penetrated with a crucifix. Later that evening, he pulls over two teenage girls who are using their father's car without his knowledge to go to a club. As they have no driving license, the Lieutenant tells one of the girls to bend over and pull up her skirt, and the other to simulate fellatio while he masturbates. The following day, he listens in on the nun's deposition, where she refuses to identify her assailants.While drinking in his car, the Lieutenant listens to the final moments of the Dodgers game and shoots out his car stereo when they lose. Despite being unable to pay the $30,000 wager, he doubles his bet for the next game. Eavesdropping on the nun's confession, he hears her state that she has no animosity toward her attackers, and sees the attack as an opportunity for God's grace to be bestowed on them. The Lieutenant drinks in a bar when the Dodgers lose again. After scoring cocaine in a nightclub, he tries to double his bet yet again. His friend refuses to make the wager, insisting that the bookie would kill him.Continuing his drug use, the Lieutenant picks up his $30,000 share from the drug dealer and calls the bookie personally to place his bet. He then visits a woman (Zoë Tamerlis Lund) and does heroin with her. At the church, he tells the nun that he will kill her attackers, but she repeats that she has forgiven them and leaves. In the resulting emotional breakdown, the Lieutenant sees the crucified Christ and tearfully curses him before begging forgiveness for his crimes. The figure is revealed to be a woman holding a gold chalice, which turns out to have been pawned at her husband's shop.The Lieutenant tracks down the two rapists and cuffs them together. He holds them at gunpoint and smokes crack with them as the Mets win the pennant. Instead of booking the two rapists, he takes them to the Port Authority Bus Terminal and puts them on a bus with a cigar box containing the $30,000. He insists that they take the bus and never come back to New York. After he leaves the terminal, he parks on the street in front of Penn Station. Another car drives up beside him, and a voice yells, \"Hey, cop!\" before two shots ring out. The film closes as bystanders gather around the car, realizing that the Lieutenant has been murdered.","language":"English Spanish","Reception":"Bad Lieutenant has a 77% rating on Rotten Tomatoes, with 30 positive reviews out of 39. Writing in the New York Times, Janet Maslin praised Ferrara's talent for making \"gleefully down-and-dirty films\", continuing, \"He has come up with his own brand of supersleaze, in a film that would seem outrageously, unforgivably lurid if it were not also somehow perfectly sincere.\"[10] Desson Howe called the Lieutenant \"a notch nicer than Satan\" in the Washington Post, and he cites Keitel's work as the film's saving grace, \"It is only the strength of Keitel's performance that gives his personality human dimension.\".[11]Mark Kermode has mentioned that the film was praised as \"a powerful tale of redemptive Catholicism\".[12] Roger Ebert stated that \"in the Bad Lieutenant, Keitel has given us one of the great screen performances in recent years\".[13] Martin Scorsese named this movie as the fifth best movie of the 1990s.[14]","box_office":"$2 million","cinematography":"Ken Kelsch","bad_lieutenant":"Theatrical release poster","directed_by":"Abel Ferrara","Alternate versions":"Originally rated NC-17 and one of the few films to be rated such with drug use and violence cited as one of the main reasons (the only other film being Comfortably Numb), the unedited cut was described for \"sexual violence, strong sexual situations and dialogue, graphic drug use\".Blockbuster and Hollywood Video, the largest video rental companies in the United States, had a policy prohibiting the purchase and rental of NC-17 films. An R-rated cut was created specifically so that Blockbuster and the other retailers would rent and purchase out the film. The R-rated cut was described with \"drug use, language, violence, and nudity\". The scene in which LT pulls over two young girls from New Jersey is almost completely absent from the Blockbuster version.","release_dates":"November 20, 1992 (1992-11-20)|||||","Production":"According to Lund, \"There was a lot of rewriting done on the set. Two other characters were cut, and my character modulated and took on more and more. A lot of things had to be changed and improvised. The vampire speech — which is crucial to the Lieutenant — was written two minutes before it was shot. I memorized it and did it in one take. The speech is important because she is acute in knowing the journey the Lieutenant makes. She shoots him up, sends him off, knowing of his passion, she lets him go.\"[3]Lund admitted in an interview that she \"co-directed\" several scenes in the film.[4] Lund also claimed that she wrote the screenplay of Bad Lieutenant alone and believed that Ferrara did not put much effort in his contributions in the film.[5][6]According to Jonas Mekas, Lund's ex-boyfriend Edouard de Laurot was reported to have written most of the film's script.[6] David Scott Milton later vouched this claim.[7] Mekas even claims he has \"scribbles and notes to prove it.\"[8]Ferrara admitted in a 2012 interview that he was using drugs during the making of the film: \"The director of that film needed to be using, the director and the writer—not the actors.\"[9] The Special Edition DVD from Lion's Gate has a special feature about the pre-, during, and post-production of the film, in which Ferrara explains the screenplay's genesis, its authorship, and its original brevity.","produced_by":"Edward R. Pressman","starring":"Harvey Keitel Frankie Thorn Zoe Lund","running_time":"96 minutes[1]","Sequel":"An unrelated follow-up, Bad Lieutenant: Port of Call New Orleans, was released in 2009, seventeen years after the first film's release. The film was directed by Werner Herzog and described as being \"neither a sequel nor a remake.\"[15] Both films were produced by Edward R. Pressman.","music_by":"Joe Delia","edited_by":"Anthony Redman","written_by":"Zoë Lund Paul Calderon Abel Ferrara","budget":"$1 million"}