{"country":"United States","distributed_by":"United Artists","screenplay_by":"Gerry Wilson","Plot":"The film opens as the half-Apache Chato orders a drink at a bar. The bartender ignores him and serves the local sheriff who has arrived after Chato. The sheriff calls Chato a \"redskin\" and tells him the bar is for whites only. He moves behind Chato while hurling a stream of abuse at him. The sheriff's taunts escalate, and he draws his gun while saying that he is going to kill Chato. Chato whirls around and shoots the sheriff in the gut, killing him. He rides out of town on his Appaloosa.Former Confederate officer, Capt. Quincey Whitmore, gathers a posse to hunt down Chato. As Whitmore rides across the country, the posse grows in number at each stop. It includes local ranchers and townspeople, along with a Mexican who is used as a scout and tracker.Chato calmly watches the posse's progress, staying one step ahead of them. From a hilltop, he fires on them, drawing them into an ill-advised ascent. As the posse struggles to climb the hill, Chato descends the other side and scatters their horses. He seems generally nonplussed by their presence. At one point, he kills a rattlesnake, chops off its rattle, and wraps the rattle in the snake's skin. He puts the bundle in his coat pocket without explanation.The posse's motivations are diverse. Some are motivated by a basic sense of justice, while a disturbing contingent seems to merely want to kill someone. As they continue to be outwitted by Chato, their divisions become more pronounced. When they come across a set of empty wickiups, the overtly racist members of the posse gleefully burn them.In a valley, Chato spies a woman filling a water jug. As they smile at each other, it becomes clear that she is his wife. He greets his son and gives him the rattlesnake toy from his pocket. They enter Chato's hogan, happy to be reunited. Chato resumes his normal life, busying himself with breaking horses during the day.The posse eventually discovers his home and brutally gang rape Chato's wife. They hogtie her naked outside the hogan. Chato's friend creates a diversion which allows Chato to rescue his wife. During the confusion, Chato's friend is shot and wounded. The sadistic members of the posse hang him upside down and set him on fire while he is still alive. Disgusted by such barbarity, Whitmore shoots the burning man through the head, putting him out of his misery.As he prepares to avenge his dead friend and his violated wife, Chato abandons his European dress and dons his native moccasins and loin cloth. He lures the posse members into individual traps, killing them one at a time. The posse grows more fractious until the more sadistic members murder Whitmore and the peaceful holdouts. Chato picks off the rest, right down to the last remaining man.","language":"English","Reception":"When released Vincent Canby panned the film calling it a \"...long, idiotic revenge Western...It was directed by Michael Winner in some lovely landscapes near Almeria, Spain. Just about everybody gets shot or knifed, and one man dies after Chato lassos him with a live rattlesnake.\"[2]TV Guide, echoing Canby, wrote, \"A great cast is primarily wasted in this gory, below-average, and overlong film. The script could have been written for a silent film to fit with Bronson's traditional man-of-few-words image (in fact, more grunts and squint than words)...As usual Bronson must rely upon the conviction that there are viewers who find silence eloquent.\"[3]A more recent Film4 review was more positive observing that Chato's Land \"...though no masterpiece, is an effective and frequently disturbing piece of filmmaking. A tough, cynical western with well-paced direction and a fine performance from Charles Bronson and the cast of vagabonds out to get him. A quality film from Michael Winner.\"[4]Film critic Graeme Clark discussed an often discussed contemporary political theme of the film when it was released in the early 1970s, writing, \"There are those who view this film as an allegory of the United States' presence in Vietnam, which was contemporary to this storyline, but perhaps that is giving the filmmakers too much credit. Granted, there is the theme of the white men intruding on a land where they are frequently under fire, and ending up humiliated as a result, but when this was made it was not entirely clear that America would be on the losing side as the conflict may have been winding down, but was by no means over.\"[5]Film4, is more assertive in their review, \"The cruelty of the posse is well conveyed by an able (and supremely ugly) group of actors headed up by Jack Palance and Simon Oakland. Some of their acts, such as the brutal rape of Chato's squaw and the burning of an Indian village, have an unpleasant edge which Winner does not shy away from. Parallels with the contemporary situation in Vietnam can't have been lost on the original audience.[6]","cinematography":"Robert Paynter","production_company":"Scimitar Films","directed_by":"Michael Winner","Media Releases":"It was released on Region One DVD in 2001[7] and on Region Two in 2004.[8]","Soundtrack":"A CD of the film's soundtrack was released on January 15, 2008 by Intrada Records (Intrada Special Collection Vol. 58).[9]","chato's_land":"Theatrical release poster","release_dates":"May 25, 1972 (1972-05-25) (United States)|||||","produced_by":"Michael Winner","starring":"Charles Bronson Jack Palance","running_time":"110 minutes","music_by":"Jerry Fielding","edited_by":"Michael Winner"}