{"based_on":"Characters  by H. P. Lovecraft","country":"United States","distributed_by":"50th Street Films","screenplay_by":"Rick Fry|Woody Keith|Brian Yuzna|","bride_of_re-animator":"Film poster","Plot":"Eight months after the events of Re-Animator, Doctors Herbert West and Dan Cain are working as medics in the middle of a bloody Peruvian civil war. In the chaos of battle and with plenty of casualties to work on, they are free to experiment with West's re-animation reagent. When their medical tent is stormed by the enemy troops, West and Cain return home to Arkham, Massachusetts. There, they resume their former jobs as doctors at Miskatonic University Hospital, and West returns to the basement laboratory of Cain's house to continue his research.Using parts pilfered from both the hospital's morgue and from the cemetery conveniently located next door, West discovers that his reagent can re-animate body parts by themselves. He becomes determined to create an entire living person from disparate body parts. West discovers the heart of Megan Halsey, Cain's fiancée, in the hospital morgue. With the promise to use her heart to re-animate a new Megan, West convinces Cain to help him with his project. Also stored in the morgue is the rest of the evidence from the previous \"Miskatonic Massacre\". Inside, pathologist Dr. Wilbur Graves discovers a vial of West's reagent and the severed head of Dr. Carl Hill. Using the reagent, he re-animates Hill's head.Meanwhile, police officer Lt. Leslie Chapham begins investigating West and Cain. He bears a grudge against the pair, as they were the only unaffected survivors of the Miskatonic Massacre; the dead body of Chapham's wife was re-animated into a crazed zombie during the incident. Chapham suspects West and Cain were responsible. When he stops by their house to question them, he discovers West's corpse-filled lab and the two get into an ugly confrontation. A fight ensues and West ends up killing Chapham by means of cloth treated with a chemical which causes cardiac arrest when inhaled (a product of West's research into obtaining the freshest possible corpses for his experiments). West then re-animates the police officer with the intention of covering up his crime. Chapham violently wanders out of the house and into the cemetery next door.Hill also bears a grudge against West, as West was responsible for his decapitation; the destruction of his body; taking away Megan, with whom he was obsessed; and having better theories about reanimation than himself. Using hypnotic powers, Hill commands Chapham to force Dr. Graves to stitch bat wings onto his neck, giving him back his mobility. He also extends his mental control to all of the zombie survivors of the Miskatonic Massacre.When one of Cain's patients, the beautiful Gloria, dies, West collects the last piece he needs for his creation: her head. With a complete body stitched and wired together, West and Cain inject the re-animation reagent into Meg's heart. While waiting for the reagent to take effect, a package is delivered to their house. West retrieves and opens it. From inside, Hill's winged head flies out. Simultaneously, all of the zombies he controls break into the house. West retreats back to the basement lab, where his creation, the Bride, has awoken.A catfight breaks out between the Bride and Cain's current girlfriend, Italian journalist Francesca Danelli, whom he met in Peru. Cain rejects the Bride's love and sides with Francesca. Heart-broken, the Bride rips Megan's heart out of her own chest and then literally falls to pieces. West diagnoses this as tissue rejection.Hill and his zombies force West, Cain and Francesca to retreat through the wall of the lab and into a crypt in the neighboring cemetery. Inside, all of West's prior test subjects arise and make their way towards him, stopping only when Herbert commands them to. The unstable crypt begins to collapse, trapping Hill, West and the zombies. Cain and Francesca manage to escape the debris and claw their way to the surface of the cemetery together. Hill, stuck in the debris, laughs manically, while Megan's heart, still in the hand of the bride, stops beating.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 47% of fifteen surveyed critics gave the film a positive review; the average rating was 5.2/10.[4] Allmovie wrote, \"Stuart Gordon's cult classic Re-Animator was a tough act to follow, but Brian Yuzna does an admirable job of keeping with the splattery spirit of the original\".[5] In their book Lurker in the Lobby: A Guide to the Cinema of H. P. Lovecraft, Andrew Migliore and John Strysik write: \"Bride of Re-Animator is a silly film that is fun solely for the fevered performance of Jeffrey Combs. Unlike the original Re-Animator, Bride's script really suffers from a lack of cohesiveness and undeterminable character motivation.\"[6] Variety recommended it to fans of the first film but said that mainstream audiences would dislike it.[7] Vincent Canby of The New York Times wrote, \"Bride of Re-Animator is less a sequel to the critically praised 1985 horror film Re-Animator than a rehash based on the same H. P. Lovecraft stories.\"[8] Ty Burr of Entertainment Weekly rated it C+ and called it \"an anemic shadow of the first film\".[9] Writing in The Zombie Movie Encyclopedia, academic Peter Dendle called it \"a pointless and forgettable sequel\".[10]Bride of Re-Animator was nominated for two awards by the Academy of Science Fiction, Fantasy & Horror Films in 1991. It was nominated for the Saturn Award for Best Horror Film and Jeffrey Combs was nominated for Saturn Award for Best Supporting Actor.","cinematography":"Rick Fichter","production_company":"Wild Street Pictures","directed_by":"Brian Yuzna","release_dates":"September 8, 1990 (1990-09-08) (TIFF)|February 22, 1991 (1991-02-22)||||","Production":"Actress Barbara Crampton did not come back for the sequel. She said in an interview that her agent convinced her not to take a cameo appearance, as he felt that it was beneath her to have such a small role.[2] The film was originally going to feature Herbert West in the White House. This concept was recycled in a later unmade sequel.[3]","produced_by":"Brian Yuzna","starring":"Jeffrey Combs|Bruce Abbott|Fabiana Udenio|Kathleen Kinmont|","running_time":"96 minutes[1]","Sequels":"The film was followed by Beyond Re-Animator.","music_by":"Richard Band","edited_by":"Peter Teschner"}