{"Cast":"Former minor league player Jasha Balcom served as a stuntman for Boseman in some of the film's scenes.[7]","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"The film tells the story of Jackie Robinson and, under the guidance of team executive Branch Rickey, Robinson's signing with the Brooklyn Dodgers to become the first African-American player to break the baseball color barrier. The story focuses mostly on the 1947 Brooklyn Dodgers season and somewhat on Robinson's 1946 season with the Montreal Royals, which emphasize his battles with racism.In 1945, Robinson and his team, the Kansas City Monarchs, stop by a gas station. When the attendant refuses Robinson entry to the washroom, Robinson says they will find another station at which to fill up the team bus, and the attendant relents. As Robinson steps out, a scout for the Dodgers approaches him and sends him to Brooklyn. He is offered a $600 per month contract and a $3,500 signing bonus, which Robinson accepts after being warned he must control his temper if he wants to play. Robinson proposes to his girlfriend, Rachel, by phone and she accepts.During spring training, Robinson makes it to the franchise farm team in Montreal. After a great season there and spring training in Panama, he advances to the Dodgers. Most of the team soon signs a petition, stating they refuse to play with Robinson, but manager Leo Durocher insists Robinson will play with the main team. When Durocher is suspended (for actions in his personal life), leaving the Dodgers without a manager to start the regular season, Burt Shotton agrees to manage the team.In a game against the Philadelphia Phillies, manager Ben Chapman taunts Robinson, causing him to go back to the dugout and smash his bat out of frustration. With encouragement from Rickey, Robinson then returns to the field and hits a single, steals second base and advances to third on a throwing error, and scores the winning run. When Chapman's behavior toward Robinson generates bad press for the team, the Phillies' owner requires him to pose with Robinson for newspapers and magazine photos.Later, Robinson's teammate, Pee Wee Reese, comes to understand what kind of pressure Robinson is facing, and makes a public show of solidarity, standing with his arm around Robinson's shoulders before a hostile crowd in Cincinnati, silencing them.In a game against the St. Louis Cardinals, Enos Slaughter \"accidentally\" spikes Robinson on the back of the leg with his cleats while running the bases.Robinson's home run against Pittsburgh Pirates pitcher Fritz Ostermueller, who had earlier hit him in the head, helps clinch the National League pennant for the Dodgers, sending them to the World Series, which they would lose to the New York Yankees. A concluding postscript describes how Rickey, Robinson, and many of his teammates went on to have distinguished careers, including inductions into the Baseball Hall of Fame, besides Chapman, who was fired and forbidden to join an MLB team forever due to his racism. The notes also describe the entrance of other African Americans into the Major Leagues, beginning with the season after Robinson's debut.","language":"English","Reception":"42 received generally positive reviews from critics. On Rotten Tomatoes, the film has a rating of 83%, based on 177 reviews, with an average rating of 6.8/10. The site's critical consensus reads, \"42 is an earnest, inspirational, and respectfully told biography of an influential American sports icon, though it might be a little too safe and old-fashioned for some.\" On Metacritic, the film holds a score of 62 out of 100, based on 39 critics, indicating \"generally favorable reviews\".Richard Roeper stated, \"This is a competent but mostly unexceptional film about a most extraordinary man.\"[15] Lisa Kennedy, of the Denver Post, lauded the film, saying \"This story inspires and entertains with a vital chapter in this nation's history.\"[16][17] Conversely, Peter Rainer, of The Christian Science Monitor, criticized the film as \"TV-movie-of-the-week dull and Robinson's ordeal is hammered home to the exclusion of virtually everything else in his life.\"[18]Jackie Robinson's widow, Rachel Robinson, was involved in the production of the film and has praised the end result, saying, \"It was important to me because I wanted it to be an authentic piece. I wanted to get it right. I didn’t want them to make him an angry black man or some stereotype, so it was important for me to be in there . . . I love the movie. I’m pleased with it. It’s authentic and it’s also very powerful.\"[19]The film earned $27.3 million for its opening weekend, the best premiere for a baseball-themed film in Hollywood history. Only released in the US and Canada, the film went on to gross a total of $95,020,213.[20]","box_office":"$117.4 million[2]","cinematography":"Don Burgess","production_company":"Legendary Pictures","directed_by":"Brian Helgeland","Home media":"42 was released on DVD and Blu-ray on July 16, 2013 in America, and on Feb. 3rd, 2014 in the U.K.[21]","Historical inaccuracies":"Robinson and Rachel Isum became engaged in 1943, while he was still in the United States Army and before he began his professional baseball career, unlike in the film where he proposes after signing the contract with the Dodgers.Chronologically the games are depicted out of order for dramatic effect, as the Cincinnati game where Reese, who was in real life never at all hesitant in accepting Jackie, put his arm around Robinson happened before the Chapman incident.Enos Slaughter's spiking was most likely but not directly stated to be intentional. Slaughter was a southerner nicknamed \"Country\" who was vehemently against integration, although it is not known if he meant to hurt Robinson at this point since public opinion had largely shifted in his favor, or at least was sympathetic to Robinson over the abuse he was getting.The Brooklyn Dodgers held their 1947 Spring Training in Havana, Cuba, not Panama City, Panama, as depicted in the movie.The scene of Robinson breaking his bat in the dugout tunnel is not based in fact. Both Rachel Robinson and Ralph Branca, film consultant and Dodger pitcher in the dugout that day, say it did not happen. Director Helgeland concurs, explaining that his justification for including the scene was that he felt \"there was no way Robinson could have withstood all that abuse without cracking at least once, even if it was in private.\"[22]Red Barber would not have broadcast Dodger away games from the opposing team's ballpark in Philadelphia and Cincinnati, as shown in the film. Radio broadcasts of away games in this era were recreated back at the studio from a pitch by pitch summary transmitted over telegraph wire from the stadium where the game was being played.[23][24]Wendell Smith is said to have been the first black member of the Baseball Writers Association of America; Sam Lacy was the first, having joined in 1948.[25]Pirates pitcher Fritz Ostermueller threw left-handed, not right-handed as in the film. His first inning pitch hit Robinson on the left wrist, not his head, and he claimed it was a routine brushback pitch without racist intent. There was no fight on the mound afterwards.[26] The climactic scene in which Robinson hit a home run to clinch the National League pennant for the Dodgers came in the top of the fourth inning of the game, did not clinch the victory (it made the score 1–0, and the Dodgers eventually won 4–2), and did not clinch the pennant; the Dodgers clinched at least a tie for the pennant on that day before clinching the pennant the next day.[27]While Dodger manager Leo Durocher did have an affair with actress Laraine Day, the official reason for his suspension by commissioner Happy Chandler during Robinson's rookie year was allegations of gambling and not his relationship with Day.Toward the end of the film, Barber states Robinson's stats at that point in the 1947 season, saying he had stolen 27 bases without being caught on the season. In reality, caught stealing was not an official statistic at the time and would not become one until 1951.In the film, four umpires were present on opening day of the 1946 Jersey City Giants' season. At the time, and to this day, the International League uses only three umpires per game.","release_dates":"April 12, 2013 (2013-04-12) (United States)|||||","Production":"Spike Lee planned to write and direct a film based on the life of Jackie Robinson and had it set up at Turner Pictures under his 40 Acres and a Mule Filmworks in 1995. The studio wanted to release it in 1997 to coincide with the 50th anniversary of Robinson's breaking of the color barrier, and courted Denzel Washington to star,[8] but the project fell apart in 1996 over creative differences. In March 1997 Lee found favor with Columbia Pictures, who signed him to a three-year first-look deal. Columbia President Amy Pascal reflected that it would bring \"enormous potential for Spike to reach audiences that are not traditionally associated with Spike Lee movies.\"[9] The project eventually fell apart, but in 2004 Robert Redford set up a Jackie Robinson biopic as producer with Deep River Productions, as well as his own production company, Wildwood Productions. Redford also intended to co-star as Branch Rickey,[10] and Howard Baldwin joined as producer the following year.[11] In June 2011 it was announced the Legendary Pictures would develop and produce a Jackie Robinson biopic with Brian Helgeland on board to write and direct, under a distribution deal with Warner Bros. Legendary collaborated with Robinson’s widow, Rachel Robinson, to ensure the authenticity of her husband’s story. She had previously been involved with Redford's project.[12]42 was filmed primarily in Macon, Georgia, Birmingham, Alabama, and Chattanooga, Tennessee. Some interior scenes were shot at Atlanta Film Studios Paulding County in Hiram, Georgia.[13]Most of the interior stadium shots were filmed at Engel Stadium in Chattanooga, Tennessee. Utilizing old photographs and stadium blueprints, Ebbets Field, Shibe Park, The Polo Grounds, Crosley Field, and Forbes Field were recreated for the film using digital imagery.[14]","produced_by":"Thomas Tull","starring":"Chadwick Boseman|Harrison Ford|Nicole Beharie|Christopher Meloni|Andre Holland|Lucas Black|Hamish Linklater|Ryan Merriman|","running_time":"128 minutes[1]","music_by":"Mark Isham","42":"Theatrical release poster","edited_by":"Kevin Stitt|Peter McNulty|","written_by":"Brian Helgeland","budget":"$40 million[2]"}