{"based_on":"Barb Wire  by Dark Horse Comics","Cast":"In the film, Anderson's waist was laced down to 17 inches (43 cm). She did some of her own stunts, although the corset and the heels she wore made fight scenes very challenging.[4][5]","country":"United States","distributed_by":"Gramercy Pictures","screenplay_by":"Chuck Pfarrer Ilene Chaiken","story_by":"Ilene Chaiken","Plot":"The plot of the film is loosely based on the plot of Casablanca. Barb Wire is set in 2017 during the \"Second American Civil War,\" rather than World War II. Many of the roles had their gender switched.[3]Barb Wire (Pamela Anderson) owns the Hammerhead, a nightclub in Steel Harbor — \"the last free city\" in a United States ravaged by the civil war — and she brings in extra cash working as a mercenary and bounty hunter. Chief of Police Willis (Xander Berkeley) raids her club. Willis's target is fugitive Dr. Corrina \"Cora D\" Devonshire (Victoria Rowell), a former government scientist with information about a bioweapon being developed by her former superior, Colonel Pryzer (Steve Railsback) of the Congressional Directorate. Dr. Devonshire hopes to escape to Canada in order to make this information public.Devonshire later turns up at the Hammerhead. She is accompanied by Axel Hood (Temuera Morrison), a \"freedom fighter\" whom Barb had known and loved at the outbreak of the war, but the two were separated during the conflict. Axel is trying to help Cora get to Canada. They are trying to find a contraband pair of contact lenses that will allow Cora to evade the retinal scan at the Steel Harbor airport. The lenses pass through the hands of several lowlifes before also ending up at Barb's nightclub.Rather than give the lenses to Cora and Axel, Barb makes a deal with \"Big Fatso\" (Andre Rosey Brown), the leader of a junkyard gang: Fatso wants the lenses, which are worth a fortune on the black market, and Barb wants a million dollars and an armed escort to the airport, where she plans to get on the plane to Canada. But Fatso double-crosses Barb; when Barb, Axel, and Cora show up at the junkyard to make the swap, Colonel Pryzer and his storm troopers are also there, along with Chief of Police Willis. Willis makes a show of arresting Barb and Cora, but instead of putting handcuffs on Barb, he slips her a hand grenade. Barb uses the grenade to kill Fatso and cause enough confusion to allow Barb, Axel, Cora, and Willis to pile into Barb's armored van and lead the Congressionals on a car chase, culminating in a hand-to-hand fight between Barb and Colonel Pryzer on a forklift suspended by crane above the harbor. Pryzer falls to his death while Barb escapes.In the end, the party makes it to the airport, where Barb reveals that she still has the contact lenses. She gives them to Cora, and Cora and Axel get on the plane to Canada while Willis and Barb remain on the rainswept tarmac.","language":"English French German","Reception":"Barb Wire was poorly received by critics and was a box office disappointment. It holds a 28% approval rating on Rotten Tomatoes based on 36 reviews (10 positive, 26 negative), with the consensus stating that \"Barb Wire could've been fun camp, but Pamela Anderson can't deliver her lines with any dramatic or comedic impact\".[6] Roger Ebert pointed out that the film's plot was identical to that of Casablanca.[7]The film was a box office failure, only grossing $3,794,000 in the United States.[8]","barb_wire":"Theatrical release poster","box_office":"$3.8 million[2]","cinematography":"Rick Bota","production_company":"PolyGram Filmed Entertainment Propaganda Films Dark Horse Entertainment","directed_by":"David Hogan","Soundtrack":"An official soundtrack was released in 1996.[9]","release_dates":"May 3, 1996 (1996-05-03)|||||","produced_by":"Todd Moyer Mike Richardson Brad Wyman","starring":"Pamela Anderson Temuera Morrison Victoria Rowell Jack Noseworthy Xander Berkeley Udo Kier Steve Railsback","running_time":"98 minutes","music_by":"Michel Colombier","edited_by":"Peter Schink","written_by":"Chris Warner (comics)","budget":"$9 million[1]"}