{"country":"United States","distributed_by":"PSO International TriStar Pictures","Plot":"An alcoholic Los Angeles Sheriff's Deputy, Matt Scudder (Bridges), takes part in a drug bust that results in his fatal shooting of a small-time dealer in front of the man's wife and kids. Scudder ends up in a drunk ward, suffering from booze and blackouts, ending his career, his marriage, and jeopardizing his relationship with his daughter.After an Alcoholics Anonymous meeting, a woman hands Scudder a note, which invites him to a private gambling club on a hill, accessible only by a funicular, owned by Chance Walker (Randy Brooks). At the club, Scudder is greeted by a call girl named Sunny (Alexandra Paul) who pretends that he is her boyfriend. He also meets Angel Moldonado (Garcia), who places large wagers with Chance and is infatuated with another call girl there, Sarah (Arquette).Bewildered by Sunny's behavior, Scudder ends up back at his place, where after a failed attempt to seduce him, Sunny explains that she is frightened and needs help. After she pays him $5,000, Scudder offers Chance $2,500 to allow Sunny to quit prostitution. An insulted Chance insists that all he does is run the club, paying the girls a flat salary to attend his parties. Any prostitution they do is up to them.Sunny is kidnapped in front of Scudder and, during a chase, is murdered and thrown off a bridge. Scudder goes on a binge and wakes up in a drunk ward several days later. It transpires that he gave statements to detectives before getting drunk that have implicated himself and Chance in the murder. At the club, Moldonado wears a ring with an emerald that matched the missing jewel in a necklace that Sunny owned. Convinced now that Moldonado is her killer, Scudder persuades Sarah to leave the club with him, as a jealous Moldonado looks on. Sarah fails to get Scudder to drink with her, then tries to initiate sex but is too drunk and vomits on his bed.Scudder pieces together that Moldonado is running a drug ring through Chance's legitimate businesses. Setting up a meeting where he pretends to set up a drug buy, Scudder has a confrontation with Moldonado, who forces Sarah to leave with him. Chance is furious that Moldonado has been using him and that he killed Sunny, but Scudder convinces him to go along with the drug deal, in order to trap Moldonado.At Moldonado's house, a unique one designed by Antoni Gaudí, a suspicious Moldonado puts off any talk of drugs. He taunts Scudder about Sunny's death and carefully implies she was killed to scare off others who would cross him. Moldonado knows that Scudder is or was a cop, so is wary of being trapped in a sting. Scudder notices a package from a supermarket Chance owns. Deducing that the drugs were stashed there, Scudder and Chance go to the grocery store and find the hidden cocaine. Scudder offers to return them in exchange for Sarah.At an empty warehouse, Moldonado arrives with Sarah duct-taped to a shotgun that one of his underlings is holding. Scudder in turn has booby-trapped the drugs and threatens to destroy them if Sarah is harmed. After seeing some of his cocaine burned, Moldonado agrees to cut Sarah loose, but before he can secure his drugs, a shootout erupts between Moldonado's men and undercover drug agents who have accompanied Scudder to the scene. Moldonado manages to escape in the chaos, but Chance is killed.Sarah and Scudder head back to Chance's club, and as they ride the funicular up to the house, they see Moldonado standing at the top, waiting for them. Scudder manages to kill him in a tense gunfight. Scudder is later seen attending an AA meeting, then strolling happily with Sarah on a beach.","language":"English","Reception":"8 Million Ways to Die received negative reviews from critics: the review aggregator Rotten Tomatoes sampled seven reviews, and gave the film a \"0%\" positive rating.[3]","box_office":"$1,305,114[2]","cinematography":"Stephen H. Burum","directed_by":"Hal Ashby","8_million_ways_to_die":"Theatrical release poster","release_dates":"April 25, 1986 (1986-04-25)|||||","produced_by":"Stephen J. Roth","starring":"Jeff Bridges|Rosanna Arquette|Alexandra Paul|Andy Garcia|","running_time":"115 min.","music_by":"James Newton Howard","edited_by":"Robert Lawrence Stuart H. Pappé","written_by":"Lawrence Block (novel) Oliver Stone R. Lance Hill Robert Towne (uncredited) (screenplay)","budget":"$18 million[1]"}