{"country":"United States","distributed_by":"Open Road Films","Plot":"Malcolm Adekanbi (Shameik Moore) is a high school senior. He and his best friends, Jib (Tony Revolori) and Diggy (Kiersey Clemons), are described as \"geeks\". They live in a neighborhood of Inglewood, California called \"The Bottoms,\" where crime is frequent. Malcolm is confident he will be admitted to his dream school, Harvard University, on his academic ability, but his school counselor calls Malcolm arrogant for thinking that Harvard would find his grades impressive, since their school is in a run-down L.A. suburb. He suggests Malcolm take the college application process more seriously, starting with his upcoming interview with businessman Austin Jacoby (Roger Guenveur Smith), a Harvard alumnus.While biking home, Malcolm is stopped by a drug dealer named Dom (A$AP Rocky) who instructs Malcolm to invite a girl named Nakia (Zoë Kravitz) to his party. Finding him charming, Nakia tells Malcolm to tell Dom that she will only accept his invitation if Malcolm can come. Despite his initial reluctance, Jib and Diggy talk Malcolm into going to the party and go with him.During the party, Dom and his crew meet in a back room to buy high-grade, powdered molly. The transaction is interrupted by a rival gang. Dom hides behind the bar where he finds Malcolm's backpack, which he fills with the drugs and a gun. He finds Malcolm, gives him the pack, and shoos him away from the club as the police sweep in.Nakia drives Malcolm home when Malcolm offers to help her study for her GED test. The next day at school, Malcolm discovers the drugs, gun, and an iPhone and deduces that Dom slipped them into his bag during the shootout. Immediately, an unknown man calls the iPhone. The man reveals that he knows Malcom's identity, and instructs Malcolm to turn over the drugs that day. After school, Malcolm begins to undertake the hand-off, but is interrupted by another call, this time from Dom, who is in custody. Dom warns Malcolm that he's being lured into a trap, and advises him to flee. He texts Malcolm an address and tells him to ask for AJ.Malcolm, Jib, and Diggy flee to the address that Dom sent them. They find themselves at the doors of a mansion, greeted by young man named Jaleel (Quincy Brown) and his sister Lily (Chanel Iman). Since their father, AJ, isn't home, Jaleel invites the three inside. Jaleel takes Jib and Diggy out to get food while Malcolm stays with Lily, who seduces him. Lily finds the drugs in his backpack and takes a heavy dose. Meanwhile, Malcolm gets a phone call reminding him of his alumni interview. Lily drives him there but she is high, and passes out at a stop sign. As Malcolm desperately tries to wake her, Lily springs up, runs out of the car and publicly urinates on a bush while bystanders record the incident. Malcolm takes her car and drives to the meeting himself.Malcolm arrives at the office of Austin Jacoby for his interview. While waiting for Jacoby, he notices photos of Dom, Lily, and Jaleel in the man's office. Realizing Austin Jacoby is AJ, Malcolm relays Dom's instructions to deliver the drugs, but Jacoby denies any knowledge. Jacoby implies that since Dom can no longer sell the drugs, it is now Malcolm's responsibility. Jacoby also implies that if Malcolm succeeds, he will make Malcolm \"a Man of Harvard.\" He then reschedules the interview, and if Malcolm has not sold the drugs by then, Harvard will be the least of his worries.Low on options, Malcolm, Jib, and Diggy seek help from a college student, Will Sherwood (Blake Anderson), they met at band camp years ago, a stoner and a hacker. Will helps the three set up a black-market online store to sell the drugs through bitcoin transactions, which are untraceable. Before long, Will's marketing campaign has turned the trio's website into the go-to drug source for L.A. college students.Malcolm helps Nakia study and she opens up to him. Malcolm pushes her away, accusing her of being sent there by Dom to gather info on the drugs. Offended, Nakia leaves. The next day, Malcolm asks Will to extract cash from the bitcoins, and he tells Malcolm that he will arrange a meeting with a money-laundering gangster named Fidel (Kap-G). The meeting goes as planned, and Malcolm leaves with a bag full of cash.While returning with the bag of cash, Malcolm is assaulted by the school bully and his crew who quickly overpowers him and takes the bag. Malcolm, desperate, defends himself by pulling a gun, gets the money back, and earns the bully's respect.Malcolm returns to AJ's office for his interview, where he tells Jacoby that he has sold the drugs and left a trail leading to Jacoby. Unless Jacoby makes him a Harvard Man, Malcolm will transfer the bitcoins to Jacoby's checking account, which will get Jacoby arrested.Malcolm types his college application essay. He describes two students – Student A is a music geek that plays in a punk band and gets straight As, while Student B suffers in the hood and makes money in immoral ways. He asks, \"Which student do you think I am?\"Malcolm waits for Nakia at prom, but she does not show. Nakia meets Malcolm at his home and thanks him for helping her pass her GED, gives him a pass to Six Flags, and kisses him on the cheek.Malcolm enters his room to find an envelope from Harvard on his bed. He opens it and looks at the audience before smiling.","language":"English","Reception":"Dope grossed $6.1 million in its opening weekend, finishing 5th at the box office behind Jurassic World ($106.6 million), Inside Out ($90.4 million), Spy ($11.2 million) and San Andreas ($8.7 million).[16] At the end of its theatrical run, the film grossed just shy of $18 million worldwide.Dope received positive reviews from critics. On Rotten Tomatoes, the film holds a rating of 88%, based on 132 reviews, with an average rating of 7.4/10. The site's critical consensus reads, \"Featuring a starmaking performance from Shameik Moore and a refreshingly original point of view from writer-director Rick Famuyiwa, Dope is smart, insightful entertainment.\"[17] On Metacritic, the film has a score of 72 out of 100, based on 37 critics, indicating \"generally favorable reviews\".[18] According to CinemaScore, audiences gave the film an \"A−\" grade.[19]The Guardian gave the film five stars out of five, describing the entire cast as \"revolutionary\".[20] IGN awarded it 7 out of 10, saying \"Comedy, romance, drama and crime rub shoulders in entertaining coming-of-age flick.\"[21]","box_office":"$18 million[2]","dope":"Theatrical release poster","cinematography":"Rachel Morrison","directed_by":"Rick Famuyiwa","Soundtrack":"The soundtrack to the film, Dope (Music from the Motion Picture), was released by i am OTHER Entertainment and Columbia Records on June 16, 2015.[8][9][10]","production_companies":"Significant Productions i am OTHER Revolt Films","release_dates":"January 24, 2015 (2015-01-24) (Sundance)|June 19, 2015 (2015-06-19) (United States)||||","produced_by":"Forest Whitaker|Nina Yang Bongiovi|","starring":"Shameik Moore|Tony Revolori|Kiersey Clemons|Kimberly Elise|Chanel Iman|Tyga|Blake Anderson|Zoë Kravitz|A$AP Rocky|","running_time":"103 minutes[1]","music_by":"Germaine Franco","edited_by":"Lee Haugen","Release":"Dope debuted in the U.S. Dramatic Competition category at the 2015 Sundance Film Festival, which started on January 22, 2015 in Park City, Utah.[5][6] At the festival, the film received offers from at least six production companies and film studios before its rights were sold to Open Road Films (who will distribute the film domestically) and Sony (who will distribute the film internationally) for a reported $7 million plus $20 million for marketing and promotion.[11][12] It was selected to close the Directors' Fortnight section at the 2015 Cannes Film Festival.[13] In September 2015, the film competed in the 2015 Deauville American Film Festival where it won the Prix du Public (Audience Award).[14][15]","written_by":"Rick Famuyiwa","budget":"$7 million[2]"}