{"country":"Greece","Plot":"Marina, a sexually inexperienced 23-year-old woman, lives with her terminally-ill architect father, Spyros, in an industrial Greek town by the sea.Unable to relate to her fellow humans, she lives her life through the wildlife documentaries of Sir David Attenborough, the songs of Suicide and the sex education lessons given to her by her friend Bella.Despite her sexual inexperience, Marina's relationships show warmth and thought. Spyros, contemplative as he approaches death, shares with her how he believes, \"Man has designed ruins with mathematical accuracy...\" referring to the destiny of most architecture, eventually. But then cynically, he reflects that \" We (Greece) went from sheep to bulldozers...'When a stranger comes to town, Marina has her first sexual relationship with him. She is secretive. Telling first Spyros and later Bella. Spyros asks of course, \"If you do not want me to meet him, why are you telling me about him?\"As Spyros come closer to death, Marina asks Bella to sleep with her father, as a favor for a dying man, whom she duly obliges. Meanwhile, Marina begins a sexual relationship with the stranger.The film reaches its conclusion after Spyros's passing, where the last scenes are of Bella and Marina scattering his ashes in the sea.","language":"Greek","Reception":"Quentin Tarantino, who was head of the Jury for the 67th Venice International Film Festival, said that the film \"grew on us the most, and showed another Greece\".[3][4] Journalist Shane Danielsen called the film \"an intellectually rigorous, quietly wrenching Greek drama\".[9] Peter Bradshaw characterised the film as \"an angular, complex, absorbing and obscurely troubling movie\".[10]","Promotion":"A promotional picture for the film, where the tongues of two women meet, was censored on Facebook,[11] but Facebook now hosts a profile for the film in which the picture is allowed.[12]","cinematography":"Thimios Bakatatakis","directed_by":"Athina Rachel Tsangari","release_dates":"8 September 2010 (2010-09-08) (Venice)|9 December 2010 (2010-12-09) (Greece)||||","produced_by":"Maria Hatzakou Yorgos Lanthimos Iraklis Mavroidis Athina Rachel Tsangari Angelos Venetis","starring":"Ariane Labed Vangelis Mourikis Evangelia Randou Yorgos Lanthimos","running_time":"93 minutes","attenberg":"Film poster","edited_by":"Matt Johnson Sandrine Cheyrol","written_by":"Athina Rachel Tsangari"}