{"country":"United States","distributed_by":"TriStar Pictures (US)","Background":"Leonard Chess was the co-founder of the 1950s American record label Chess Records, located in Chicago, Illinois. He ran the legendary company with his brother, Phil, through the 1950s and '60s.[2] The label started selling records from the back of Chess' Cadillac,[3] and launched the careers of legendary musical personalities such as blues singers and harmonica and guitar players Little Walter and Muddy Waters, Howlin' Wolf, soul legend Etta James[4] and guitarist singer-songwriters Chuck Berry and Willie Dixon.[5]","Plot":"Leonard Chess, a Polish immigrant of Jewish descent, starts the record label Chess Records in Chicago in 1950. It opens its doors for black musicians and attracts people such as Muddy Waters, Chuck Berry, Little Walter and Etta James.","language":"English","Release and reception":"The film had its world premiere on November 24, 2008 at the Egyptian Theatre in Los Angeles.[15] On December 5, 2008, it was released nationally in the United States of America. On its opening weekend, the film opened at Number 9, grossing $3.4 million in 686 cinemas with an $5,023 average.[16] When the film left cinemas in January 2009, it had yet to recoup its $12 million budget; it ended its run with a worldwide box office gross of $8,880,045.[1]The film received mostly positive reviews. Rotten Tomatoes gives a score of 68% based on reviews from 120 critics. Its consensus state that \"What Cadillac Records may lack in originality, it more than makes up for in strong performances and soul-stirring music.\"[17] Another review aggretator, Metacritic, gave the film a 65% approval rating based on 30 reviews classifying that the film has \"generally favorable reviews\".[18]Roger Ebert of the Chicago Sun Times gave the film 3 stars and stated in his review that \"The film is a fascinating record of the evolution of a black musical style, and the tangled motives of the white men who had an instinct for it.\"[19] Elizabeth Weitzman of the Daily News awarded the film with 3 stars and wrote in her review, \"Writer-director Darnell Martin clearly respects the fact that the history of Chess Records is a worthy subject.\"[20] Most critics praised the film for its music, but complained about its script. Jim Harrington of the San Jose Mercury News praised Knowles' vocal performance and wrote in his review that, \"Beyoncé Knowles' captivating voice and the film's other pluses can't outweigh the glaring omissions from the story line for this critic\" and \"Chess Records deserves, and will hopefully someday get, a better spin than the one delivered by Cadillac Records.\"[21]David Edelstein of New York magazine named it the 4th best film of 2008,[22] Stephanie Zacharek of Salon named it the 4th best film of 2008,[22] and A. O. Scott of The New York Times named it the 10th best film of 2008.[22] During the 2009 award season, Knowles received a Satellite Award nomination for her portrayal of Etta James.[23] Knowles, Amanda Ghost, Scott McFarmon, Ian Dench, James Dring and Jody Street received a Golden Globe nomination, Best Original Song, for writing \"Once in a Lifetime\"; a song Knowles recorded for the film's soundtrack.[24][25] The film also garnered seven NAACP Image Award nominations, which included Outstanding Motion Picture, Outstanding Actor in a Motion Picture (Jeffrey Wright), Outstanding Supporting Actor in a Motion Picture (Cedric the Entertainer, Columbus Short and Mos Def), and Outstanding Supporting Actress in a Motion Picture (Beyoncé Knowles).[26]The film was released on DVD and Blu-ray on March 10, 2009, and sold over 130,000 copies in its first week.[27] To date it has made an estimate of $11,916,737 in sales,[27] which coupled with its box office gross helped the film pay back its $12 million budget (total gross: $20,796,782).","box_office":"$8,880,045[1]","cinematography":"Anastas Michos","production_company":"Sony Music Film Parkwood Entertainment","directed_by":"Darnell Martin","cadillac_records":"Theatrical release poster","narrated_by":"Cedric the Entertainer","release_dates":"December 5, 2008 (2008-12-05) (US)|||||","Production":"The screenplay was written by director Darnell Martin.[3] The filming of Cadillac Records started in February 2008.[6] Filming locations included Louisiana, Mississippi, and New Jersey.[7] Martin directed the film,[2][4] financed by Sony BMG Film.[5] Cadillac Records was produced by Andrew Lack and Sofia Sondervan,[8] and co-executive produced by Beyoncé Knowles.[2]Originally, Matt Dillon was slated to play the role of Chess,[5] but the role was ultimately given to Academy Award-winner Adrien Brody due to scheduling conflicts with Dillon.[9] Early announcements of the cast also included Columbus Short as Little Walter, Golden Globe winner Jeffrey Wright as Muddy Waters,[2] and multi-Grammy Award winner Beyoncé Knowles as Etta James. According to director Martin, the role of James was written with Knowles in mind.[10]As production increased, the roster grew to include Canadian actress Emmanuelle Chriqui as Revetta Chess, Tammy Blanchard as Isabelle Allen, English actor Eamonn Walker as Howlin' Wolf, and comedian Cedric the Entertainer as Willie Dixon.[3][6][8] Final line ups of the cast also grew to include rapper Mos Def as Chuck Berry, and Gabrielle Union in the role of Geneva Wade, Muddy Waters' common law wife.[11]The American multi-instrumentalist, songwriter, and record producer Steve Jordan produced the soundtrack to the film. He also picked a group of blues musicians, including Billy Flynn (guitar), Larry Taylor (bass), Eddie Taylor Jr. (guitar), Barrelhouse Chuck (piano), Kim Wilson (harmonica), Danny Kortchmar (guitar), Hubert Sumlin (guitar), and Bill Sims (guitar) who, along with Jordan on drums, recorded all of the blues songs used in the film.[12]Knowles recorded five songs for the soundtrack, including a cover version of Etta James' \"At Last\" which was released on December 2, 2008 as its lead single.[13] Mos Def, Jeffrey Wright, Columbus Short, and Eamonn Walker recorded songs for the soundtrack, and Raphael Saadiq, Knowles' sister Solange, Mary Mary, Nas, Buddy Guy, and Elvis Presley also appear on the album. The soundtrack was released in single and double-disc editions.[13]The month after the film was released, Beyoncé performed \"At Last\" at the inauguration ball of Barack Obama, as he and wife Michelle danced together for the first time as president and first lady.[14]The soundtrack spent 48 weeks at number one of the Top Blues Albums.The soundtrack was nominated for three 2010 Grammy Awards in the following categories: 'Best Compilation Soundtrack Album For Motion Picture, Television Or Other Visual Media', Beyoncé's \"Once in a Lifetime\" for 'Best Song Written For Motion Picture, Television Or Other Visual Media' and Beyoncé's \"At Last\" for 'Best Traditional R&B Vocal Performance'.","produced_by":"Sofia Sondervan Andrew Lack","starring":"Adrien Brody Beyoncé Knowles Jeffrey Wright","running_time":"109 minutes","music_by":"Terrence Blanchard Steve Jordan","edited_by":"Peter C. Frank","written_by":"Darnell Martin","budget":"$12 million"}