{"Cast":"Richard Petty, Rusty Wallace, Neil Bonnett, Harry Gant, and Dr. Jerry Punch all appear in cameo roles as themselves. Bob Jenkins had a voice-over role as public address announcer.","country":"United States","distributed_by":"Paramount Pictures","story_by":"Robert Towne Tom Cruise","Real-life references":"While the movie was neither based on a true story, nor a biographical film, the main character Cole Trickle was very loosely based on the career of Tim Richmond,[15][16] and several scenes reenacted or referenced real-life stories and personalities from NASCAR history.[15]The scene where Big John tells Cole and Rowdy they will drive to dinner together is based on an actual meeting Bill France, Sr. had in the 1980s between Dale Earnhardt and Geoff Bodine.[15] One scene in which Cole deliberately blows his engine by over-revving it reflects upon an incident in which Tim Richmond was said to have done so at Michigan in 1987.[17]In another scene, Trickle is told he can not pit because the crew is too busy eating ice cream. This incident actually occurred at the 1987 Southern 500 involving the Hendrick Motorsports #35 team with crew chief Harry Hyde and Richmond's replacement driver Benny Parsons.[18]The scene where Cole and Rowdy destroy a pair of rental cars by racing them through the city streets loosely referenced early 1950s NASCAR superstars Joe Weatherly and Curtis Turner, each of whom were known to rent cars, race, and crash them with abandon.[19][20]","In popular culture":"In the 2013 Subway Firecracker 250 driver Kurt Busch had his #1 Phoenix Racing Chevy painted identical to Cole Trickle's #46 City Chevy car.[25]The fictional Mello Yello sponsorship depicted on Trickle's car during film was followed by a real-life sponsorship arrangement the following year. The car of Kyle Petty at SABCO Racing carried the livery from 1991-1994. Mello Yello also sponsored the fall race at Charlotte from 1990-1994.The 2015 Southern 500 at Darlingotn saw this livery again with Kyle Larson piloting the now throwback scheme.","language":"English","box_office":"$157.9 million","cinematography":"Ward Russell","production_company":"Don Simpson/Jerry Bruckheimer Productions","directed_by":"Tony Scott","days_of_thunder":"Theatrical release poster","release_dates":"June 27, 1990 (1990-06-27)|||||","Production":"Principal photography took place in early 1990 in and around Charlotte and Daytona. It was plagued with delays due to frequent arguments on set between Simpson and Bruckheimer, Scott, and sometimes Towne over how to set up a shot. Crew members sat idle for long hours; some later said they had accumulated enough overtime pay to go on vacation for a full four months after filming was completed. The completion date was pushed back many times, with filming being completed in early May,[5] three months later than it had originally been scheduled. At one point, following the third revision of the shooting schedule in a single day, the unit production manager, who represents the studio on the set or location, confronted Simpson and Bruckheimer and was told bluntly that the schedule no longer mattered.[6]In Daytona, Simpson and Bruckheimer spent $400,000 to have a vacant storefront in their hotel converted into their private gym, with a large neon sign reading \"Days of Thunder.\" Simpson also kept a closet full of Donna Karan dresses to offer the attractive women his assistants found on the beach, and held private parties with friends like rapper Tone Lōc.[7] Towne also played a role in the film's increasing cost by scrapping more barn scenes when he didn't like either of two barns built to his specifications. The film's original budget of $35 million ($63.4 million in modern dollars[8]) nearly doubled; at that level it would have had to make at least $100 million, a rare gross at that time, to break even.[6] In addition, when Tom Cruise failed to win the Oscar for Born on the Fourth of July, some additional budget was cut.[9] Despite the budget overruns and delays, reportedly it was only after shooting was finished that the filmmakers discovered they had neglected to film Cole Trickle's car crossing the finish line at Daytona.[7]The cars used as those of Cole Trickle, Rowdy Burns, and Russ Wheeler were provided by Hendrick Motorsports, with racers Greg Sacks, Bobby Hamilton, and Hut Stricklin as the stand-in drivers. In order to provide authentic race footage involving the cars, these cars were actually raced on three occasions. In late 1989, Hamilton and Sacks raced at Phoenix.[10] Hamilton officially qualified 5th and led a lap before his engine blew. In 1990, the cars were raced again at Daytona and Darlington. Sacks drove a car during the Busch Clash, while Sacks and Hamilton drove unscored entries in the Daytona 500.[11] At Darlington, Stricklin and Sacks drove two of the cars, but both were pulled from the race early after Sacks broke a crankshaft.Cole's first car in the film is sponsored by City Chevrolet, a real-life car dealership in Charlotte, North Carolina, owned by Rick Hendrick.[12]The score for Days of Thunder was composed by Hans Zimmer, with Jeff Beck making a guest appearance on guitar. This was the first of an ongoing list of films in which Zimmer would compose the score for a Jerry Bruckheimer production. An official score album was not released until 2013, by La-La Land Records.[13]The song film's theme song \"Last Note of Freedom\" was sung by David Coverdale of the band Whitesnake at the request of Tom Cruise himself. Coverdale's vocal parts were recorded in 1990 in Los Angeles during a day off of the Whitesnake Slip of the Tongue Liquor and Poker world tour.[14]","running_time":"108 minutes","Release":"Days of Thunder was released on Wednesday, June 27, 1990.[5] The film was a financial success grossing $157,920,733.[21][22]The film was more successful on home video.[23] It grossed $40,000,000 in rentals.[24]","budget":"$60 million[1]","screenplay_by":"Robert Towne","Plot":"Cole Trickle is a young racer from Eagle Rock, California, with years of experience in open-wheel racing winning championships in the United States Auto Club (USAC). His goal was to win the Indianapolis 500 but realises that \"You can't win at Indy without a great car and my name isn't Andretti or Unser\". He is recruited by Chevrolet dealership tycoon Tim Daland to race for his team in the NASCAR Winston Cup Series. Daland also convinces former crew chief and car builder Harry Hogge to come out of retirement and lead Cole's pit crew. After Trickle sets a fast time in a private test at Charlotte, Hogge builds him a new Chevrolet Lumina to drive in the Winston Cup, though the season has already started.During his first few races, Cole has difficulty adjusting to the larger NASCAR stock cars and communicating with his crew while being intimidated on the track by Winston Cup Champion Rowdy Burns; this results in Cole not finishing the races, mostly due to crashes or blown engines. After discovering that Cole does not understand the common terminology used by NASCAR teams, Harry puts him through rigorous training. This pays off at the Darlington race, when Cole uses a slingshot maneuver from the outside line to overtake Rowdy and win his first race.The rivalry between Cole and Rowdy intensifies throughout the season until tragedy strikes. At the Firecracker 400 in Daytona, both drivers are seriously injured after their cars are destroyed in a multi-car wreck. While recovering from his injuries in Daytona Beach, Cole develops a romantic relationship with Dr. Claire Lewicki, a neurosurgeon at Halifax Hospital who was senior doctor on duty when he was brought in after his crash and who was attending to his health. At the same time, NASCAR president Big John, brings Rowdy and Cole together in a meeting and warns them that he and his sport will no longer tolerate any hanky-panky from the two rivals. Afterwards, Cole and Rowdy go out to lunch together by Big John's persuasion, and settle their differences. Cole and Rowdy change from bitter rivals to close friends.As Cole is still undergoing therapy, Daland hires hot-shot rookie Russ Wheeler to take over his spot. Weeks later, Cole returns to active duty, with Daland now fielding two teams – the second car driven by Russ. Though Cole shows signs of his old self, he finds himself intimidated by his own teammate. Then, at North Wilkesboro, Russ gets dirty on pit road and spins Cole out to win the race. In retaliation, Cole crashes his car into Russ's car following the race, resulting in Cole and Harry's team being fired by Daland.When Rowdy discovers that he has to undergo brain surgery to fix a broken blood vessel, he asks Cole to drive his car at the Daytona 500 so his sponsors will pay for the year. Cole reluctantly agrees and convinces Harry to be his crew chief again. Hours prior to the race, Harry discovers metal in the oil pan, a sign of engine failure, so he manages to have Daland provide him a new engine. During the race, Cole's car suffers a malfunctioning transmission after being spun out by Russ, but the combined efforts of his pit crew, as well as those working for Daland, manage to fix the problem and get him back on the lead lap. This sets the tone for a final showdown between Cole and Russ. On the final lap, Russ predicts that Cole will attempt his signature slingshot maneuver from outside, but Cole tricks him with a crossover, overtaking him from the inside to win his first Daytona 500.Cole drives into victory lane, where he and Claire kiss passionately while they celebrate with his pit-crew. As he looks around to see where Harry is, he spots him sitting alone on a concrete barrier near the teams pit stall. Cole walks up to Harry and challenges him to a foot race to victory lane.","Reception":"The film received mixed reviews from critics who mostly shrugged off the sometimes over-the-top special effects and plot in many ways resembling the earlier Bruckheimer, Simpson, Scott and Cruise vehicle Top Gun (some calling it \"Top Gun on wheels\" or \"Top Gun in Race Cars!\"), which had been a huge success four years earlier.[26][27] Halliwell's Film Guide dismissed Days of Thunder as \"An over familiar story rendered no more interestingly than usual\",[28] while the Monthly Film Bulletin described it as \"simply a flashy, noisy star vehicle for Tom Cruise, one which - like the stock car he drives - goes around in circles getting nowhere\".[28]The film currently holds a rating of 38% on Rotten Tomatoes based on 58 reviews with the consensus: \"Days of Thunder has Tom Cruise and plenty of flash going for it, but they aren't enough to compensate for the stock plot, two-dimensional characters, and poorly written dialogue.\"[29]In a positive review, film critic Roger Ebert noted:In an 1990 Siskel and Ebert special on Cruise, Ebert added one more ingredient to the formula, the \"Dying Friend\", referencing how in almost all the Cruise formula films, his friend/colleague had almost ended up sick or dying in the course of the film to present an emotional challenge for the Cruise character.[31]The film was nominated for the Academy Award for Best Sound (Charles M. Wilborn, Donald O. Mitchell, Rick Kline and Kevin O'Connell).[32]Following Scott's death in 2012, film critic Stephen Metcalf argued that the film marked an important turning point in the history of the American film industry. \"The best film he made may well have been Crimson Tide,\" he wrote in Slate, \"but the most important film he made was Days of Thunder.\" The excesses of its production and its failure to equal Top Gun's magnitude of box-office success, he argues, helped end the era that had followed the failure of Heaven's Gate ten years earlier. The studio's willingness to indulge director Michael Cimino on that film, as other studios had been doing up to that point, led to a backlash where studios favored producers like Simpson and Bruckheimer whose films bore far more of their imprint than any director who worked for them. Crimson Tide, made several years after Days of Thunder, was the critical and commercial success it was, Metcalf says, because after similar excesses on the producers' part like those that occurred on Thunder directors were allowed to reassert themselves.[7]Quentin Tarantino said the film was his favorite big budget racing movie:Yeah, yeah, you laugh but seriously I’m a big fan. To me Days of Thunder is the movie Grand Prix and Le Mans should have been. Sure, it had a big budget, big stars and a big director in Tony Scott, but it had the fun of those early AIP movies. I just don’t think it works if you take the whole thing too seriously.[33]","Video games":"In 1990, Mindscape released a video game adaptation of the film for multiple platforms such as the PC, NES and Amiga. A Game Boy version was released in 1992. The game is currently available for the PlayStation Network and iOS.Paramount Digital Entertainment releases a new video game based on the film for the iOS, PlayStation 3, Xbox 360 and PlayStation Portable. iOS version was released in 2009 and other versions were released in 2011. The game will include 12 NASCAR sanctioned tracks—including Daytona International Speedway and Talladega Superspeedway—and the film characters Cole Trickle, Rowdy Burns, and Russ Wheeler. The PS3 version, labeled Days of Thunder: NASCAR Edition will have more than 12 select NASCAR Sprint Cup drivers, including Denny Hamlin, Ryan Newman and Tony Stewart.","produced_by":"Don Simpson Jerry Bruckheimer","starring":"Tom Cruise|Robert Duvall|Randy Quaid|Nicole Kidman|Cary Elwes|","music_by":"Hans Zimmer","edited_by":"Billy Weber Chris Lebenzon"}