{"country":"United States United Kingdom","distributed_by":"Samuel Goldwyn Films (United States)","language":"English","Premise":"A straitlaced pharmacist, Doug Varney (Sam Rockwell), who is stuck in an unhappy marriage, has just bought the pharmacy from his father-in-law. Doug's wife Kara, (Michelle Monaghan) is a highly competitive cyclist who no longer has sex or any respect for her husband. The couple have a 12 year old son with behavioral issues at school and at home.Doug's uneventful life spirals out of control after he makes a home delivery of prescriptions to Elizabeth, a beautiful yet bored and unhappy trophy wife (Olivia Wilde). It's not long before Doug and Elizabeth bond because of similar miserable lives. They commit adultery on their respective partners, take advantage of Doug's medicinal knowledge and inventory, and plot murder. Ray Liotta is Elizabeth's unsuspecting older husband and the target for demise.","box_office":"$75,143[1]","cinematography":"Tim Suhrstedt","production_company":"Occupant Entertainment Occupant Films","directed_by":"David Posamentier|Geoff Moore|","better_living_through_chemistry":"Theatrical release poster","release_dates":"March 14, 2014 (2014-03-14) (United States)|||||","Production":"On February 25, 2010, The Hollywood Reporter reported that Posamentier and Moore would collaborate on their directorial debut, with their own screenplay of Better Living Through Chemistry, for Occupant Films.[2] On January 7, 2014, Samuel Goldwyn Films has acquired all the United States distribution rights to the film for a spring 2014 release.[9]In April 2010, Paul Rudd was expected to join the cast as a lead actor to play Douglas Varney.[10] However, on September 15, 2010, Jennifer Garner and Jeremy Renner joined the cast to play the lead roles in the film, with Renner to play Douglas Varney and Garner to play Elizabeth Roberts.[11] On February 11, 2011, Judi Dench and Michelle Monaghan joined the cast of the film.[5][12]Then, on July 15, 2011, Sam Rockwell continued negotiations with Occupant Films to replace Renner, who left the project due to a hectic filming schedule.[3][13] In August 2011, Garner was pregnant and expecting her third child with Ben Affleck,[14] resulting in the actress' departure from the project. Olivia Wilde replaced Garner[15] and was cast opposite the confirmed Rockwell.[4] Ray Liotta also joined the cast on March 27, 2012 to play the husband of Elizabeth Roberts.[6] On May 16, 2012, Jane Fonda joined the cast of the film as Narrator, as well as a cameo as a customer of a pharmacy run by Douglas Varney.[7]The filming of Better Living Through Chemistry began in May 2012 in Annapolis, Maryland.[16] The duration of filming was five weeks and it occurred in different locations, including Baltimore, Anne Arundel County and Eastern Shore of Maryland.[17] On May 10, 2012, the filming crew was shooting footage at Maryland State House.[18]","produced_by":"Felipe Marino|Joe Neurauter|","starring":"Sam Rockwell|Olivia Wilde|Michelle Monaghan|Ben Schwartz|Ken Howard|Ray Liotta|Jane Fonda|","music_by":"Andrew Feltenstein|John Nau|","edited_by":"Jonathan Alberts","written_by":"David Posamentier|Geoff Moore|"}