{"country":"USA","distributed_by":"Warner Bros.","Background":"Cleopatra Jones was made by Warner Brothers following the success of the Shaft series and AIP’s films. It opened at a time when the Black Power Movement, Black Arts Movement, second-wave feminism, and an increasingly growing black feminism were all prevalent.[4] From this social context emerged the desire for a black heroine who appealed to women through a combination of alluring femininity, female strength, and combat skill. The film depicts the harsh reality of the black ghetto, but also portrays a united community whose members help and support one another. The film's final scene, where Jones, Reuben, and the other B&S members join together to defeat Mommy, reflects the Black Arts Movement's emphasis upon the need for the black community to work together to defeat white supremacy.[4]Although Cleopatra Jones contains themes relating specifically to the Black Power and feminist movements, it appeals to the general public and is said to be the “first blaxploitation film to use martial arts as part of its promotion.”[5] It appeals to audiences who enjoy action movies (such as the James Bond series) and has invited comparisons between Jones and Bond. One critic noted “On the surface, Cleopatra Jones is about a black distaff James Bond who drives a fancy car equipped with a submachine gun in the door, wears smart clothes, is a karate expert, and travels all over the world as a United States secret agent, destroying the poppy wherever it is found.”[2] Another critic, Chris Norton, even suggested, “Like Bond, Cleo is not a stealthy character who tries to infiltrate the underworld by losing her identity… Bond seldom tried to hide his identity, often using his real name during introductions, and all Bond films rely on his being recognized as 007.”[2] Likewise, Jones is rarely undercover, and is flashy and flamboyant on the job. Norton continues by saying “Cleo’s outrageous outfits are also analogous with Bond’s dinner jackets and playboy wardrobe. Her three-foot hat brims and flowing fur robes are treated with respect and awe within the film, just as Bond’s refinements are looked upon as the height of good taste… [However,] Cleo is not simply a black James Bond. While the Cleopatra Jones films have co-opted Bond, they avoid a total fusion of her character of Bond.”However, the film is also extremely—and deliberately—funny, with over-the-top villains and crackling one-liners. These were presumably the work of co-writer Sheldon Keller, a veteran TV comedy specialist whose numerous credits include The Dick Van Dyke Show and Caesar's Hour.Max Julien originally wrote the part of Jones for his then-girlfriend Vonetta McGee, but the part was eventually given to Dobson,[2] a fashion model whose height inspired the film's tag line: “6 feet 2 inches of dynamite.”[4] Although blaxploitation films generally used sex to attract an audience, Cleopatra Jones was comparatively modest, containing no nudity or explicit sex.[5]Just as her character Cleopatra Jones came from a poor, high-crime neighborhood, Dobson came from humble, working-class roots. She grew up in Baltimore’s inner city; her mother owned a beauty salon and her father worked at a railroad station. After earning a degree from the Baltimore Institute of Art, Dobson moved to New York City to become a model. Her race proved an obstacle until she caught the attention of movie producers searching for a black heroine.[2]","cleopatra_jones":"Original film poster.","Plot":"Cleopatra \"Cleo\" Jones (Dobson) is an undercover special agent for the United States Government. Overseas modeling is only a cover for her real job. Cleo is a Bond-like heroine with power and influence, her silver and black `73 Corvette Stingray (equipped with automatic weapons), and her martial arts ability. While she evokes the glory of a funk goddess, she remains loyal to her drug-ravaged community and her lover, Reuben Masters (Bernie Casey), who runs B&S House (a community home for recovering drug addicts).[2]The film opens with Cleo overseeing the destruction of a poppy field in Turkey belonging to the evil drug lord, Mommy (Shelley Winters).[2] Mommy employs an all-male crew and a bevy of beautiful young women catering to her many wants. When she hears about her poppies' demise, she plots revenge, ordering a corrupt policeman to raid the B&S House.[2]When Cleo returns to LA to arrest the police responsible for the raid, she continues to take apart Mommy’s underworld drug business, thwarting her minions along the way.[2] Cleo and Mommy face off in a showdown, in which she is trapped by Mommy in a car crusher but is saved by her friends from the B&S House. In the final showdown, Cleo chases Mommy to the top of a magnetic crane where the two women fight. Mommy proves to be no match for Cleo, who hurls Mommy over the side of the crane to her death, while Cleo's friends defeat her henchmen. At the end of the film, as Reuben and the members of the community celebrate victory, Cleo departs the scene. She sets off to complete her mission of stemming the tide of drugs that flow into her community.[2]","language":"English","Reception":"The film opened to a favorable critical reception. Says Los Angeles film critic Kevin Thomas, Cleopatra Jones is “an exceptionally well-made black action picture…From start to finish this fast-moving Warner’s release is shrewdly calculated and affirms the gifts of its director Jack in bringing style and meaning to the exploitation picture. In her first starring role Miss Dobson more than makes up for her lack of acting experience by her dazzling looks, sultry personality, and unwavering poise.”[2]Tapping into the Black Pride movement, the irony of using the name Cleopatra to convey a character who was strong physically, but equally feminine and independent, appealed to the urban public. As the queen of Egypt, Cleopatra’s role as a leader allowed African American women to identify with Dobson’s character and finally call a heroine their own.[2]On the other hand, critics of the blaxploitation industry complained that they were “dismayed by Tamara’s image as a karate-chopping, pistol popping terror.” In response Dobson replied “You go through phases until you find the right situation where a character works for you. A lot of tits and ass movies were made, ballbuster films, exploitation pictures. But I don’t care what anybody calls it. Doing Cleopatra Jones gave me a chance to work. I loved Cleo. She was not only gracious, but strong, clever, intelligent and sexy.”[7]The film was a box office success, grossing more than $100,000 in its first week of release, climbing to $400,000 by the fifth week.[2]","cinematography":"David M. Walsh","directed_by":"Jack Starrett","Feminism and sexuality":"Cleopatra Jones illustrates the film industry’s progress toward gender equality. While Jones is both feminine and fashionable, at the same time she is talented in combat and driving, even more so than the men in the film.[2] She is seen as a strong, assertive and combative woman who is able to both appeal to men and defeat them physically. On one hand, Jones competitively combats with Mommy’s male henchmen but on the other, she maintains a loving relationship with Reuben. Cleopatra and Reuben’s relationship can be considered a more progressive look at black male and black female relations at the time.[4] Reuben is a strong black man who also cares for recovering kids at the B&S House. However he is also willing to fight as he comes to Jones’s aid and they fight alongside one another.[4] Their relationship emphasizes the equality and mutual respect in a relationship that has both strong female and male counterparts.Although Jones’ character and relationships are in keeping with feminist principles, the portrayal of Mommy is less groundbreaking. She is presented as a hypersexual lesbian; her character displays many negative traits, such as her constant lust and obsession with sex.[2] Mommy exerts tyrannical control over her henchmen and physically and verbally abuses her young female attendants.Thus, the film’s homophobic treatment of Mommy hints at the film’s anti-feminism in the white feminist sense. During this period, feminism was “often seen as a white woman’s movement; some have seen it as anti-black.”[2] Even Dobson stated that a message she would have liked the film to portray would have been a more centered approach towards racial equality rather than gender. She stated in an interview, “We’re trying to free our men. I believe in equal pay… I don’t want to talk about it, because I don’t think of Cleopatra Jones as being a women’s libber. I see her as a very positive, strong lady who knows what she has to do.”[2]Therefore, this film indicates a clear distinction between what is seen as white feminism and black feminism. While white feminism is shunned by the community and is mocked through the character Mommy, black feminism is seen as more approachable and harmless, seen in the loving yet equal relationship between Jones and Reuben, as well as Jones’ heroine status. Contrasted together, Mommy’s whiteness, lesbianism, and phallic power highlight Cleopatra Jones’ heterosexual appeal, blackness, and phallic power. Jones’ sophistication emphasizes Mommy’s low-class corruption while Jones’ feminine masculinity highlights Mommy’s “butch” lesbianism.[4]Cleopatra Jones differs from other blaxploitation films which depict a “phallic heroine.\"[4] Dobson herself refused to do nude scenes, striving to separate herself from the hypersexuality of other black heroines of the time.[5] Her opinion that “sex is more interesting when you don’t show everything at once” is clearly indicated by her modesty throughout the film. During a love scene between Jones and Reuben, the two share a long, intimate kiss rather than passionately making love. The scene illustrates love and intimacy rather than the lust often depicted in other popular blaxploitation films.[5] Jones flaunts her sexuality through her appearance, managing to remain an autonomous and strong female protagonist.","Soundtrack":"Cleopatra Jones is accompanied by a rhythm-and-blues soundtrack featuring Joe Simon singing “Theme from Cleopatra Jones” and Millie Jackson singing “Love Doctor” and “It Hurts So Good.” Instrumentals on the soundtrack include “Goin’ to the Chase,” \"Wrecking Yard\" and “Go Chase Cleo.” \"Oriental-style\" music combined with jazz, bass and strings creates an exotic tone. At the same time, the bluesy rhythm alludes to black jazz culture, appropriate for an action-hero movie taking place in the African-American community.[4] The song “Theme from Cleopatra Jones” emphasizes the fantasy of erotic pleasure for men: “You’re so sweet and strong…/Touch me like the desert wind.” In the theme song, the lyrics depict the threat and thrill of her exotic beauty: “You take my pride and you throw it up against the wall/You take me in your arms, baby, and bounce me like a rubber ball…/ Dontcha know that it hurts so good.”[4] The soundtrack was a popular success, selling well over 500,000 copies.[2]","release_dates":"July 13, 1973","Race":"Dobson’s role was an example of the potential of a new black female presence in popular action cinema. In the earlier 1970s, the Hollywood-supported black urban ghetto action films followed one of a few plot lines: the black pimp or drug hustler on a mission for material wealth and autonomy from “the Man,” the lone hero from the ghetto with white institutional power, or the legitimate hero whose mission is to stop drug activity within the black community. The last narrative, albeit more rare than the others, can be seen in Cleopatra Jones.[4]While Jones works for “the Man”, a white, all-powerful leader (the American government), the film also indicates a move toward racial equality. Jones works for an unnamed agency and wears a badge that reads “Special Agent to the President.”[6] Ironically, though she works for the white government, Jones is clearly better at policing black neighborhoods than are white cops.[6] Cleopatra Jones replaces the traditional white male action hero with a powerful and assertive black heroine.[2] Also, her mission is directly related to improving the black community.[2]Some symbolism of the racist movement is contained with the bigoted police officer Purdy (Bill McKinney). His disdain for blacks is shown at the raid on the B&S house where he attempts to shoot a recovering addict in the back.[2] Another instance displaying the stereotypical white police officer racism is seen when Jones asks him who was responsible for raid on B&S house and Purdy replies, “I wouldn’t lift a finger to help you or any of your kind.”[2]Another theme within the film is the Black Power generated “Black is Beautiful” consciousness seen in Jones’s appearance. Although she is seen as a center of attraction and sexuality, she still wears an Afro which signified black affirmation.[4] Jones’s obscured hair underscores racial difference and departure from the traditional long hair as a sign of white, feminine sexual beauty.[4] Also, her colorful and flashy outfits were a departure from the more modest, classy appeal of the James Bond hero. These emphasized a departure from the traditional white male hero. Dobson herself believed that her role enabled black beauty to be more visible in mainstream media. She stated, “It’s true there are very few black models. You won’t see them smiling out at you from the covers of major magazines. Editors blame this on the market… but I say forget the market- we’re talking about a pretty girl. I’ve seen oooogly white girls on magazine covers. But black girls must be safe. They must have straight hair, or hair that can be pressed, and they must have Caucasian features.”[4] Dobson’s role created an entertaining, “safe” ground for black women to retain their ethnic appearances while still being portrayed as strikingly beautiful and powerful.Critic Francesca T. Royster states, “Tamara Dobson is a lost African queen, dripping in furs and silk robes. She is a hybrid of an exotic queen from the past, a homegirl who knows her way around her old neighborhood of Watts and a special agent for the CIA. In the film, we see a double act of appropriation made possible by the ambiguity of the Cleopatra icon.” [4] Shots of Dobson emphasize her exotic beauty especially when imaged through the male gaze. As Cleopatra strolls down the street, men of every race and age are dazzled by her black beauty.Jones indicates at every turn that the unique, exotic beauty of the African culture is even more striking than traditionally white signifiers of beauty. Even her wardrobe signifies departure from standard, classy apparel yet remains aesthetically pleasing. She appears in rich reds and yellows, tailored pantsuits, clinging silk shirts, voluptuous fur jackets, turbans, silk headdresses, and hooded capes. These outfits create the glamorous identity that is beautiful, black, female, and endowed with unusual social empowerment. Critic Annette Kuhn explains that “a glamorous/glamourised image then is one manipulated, falsified perhaps, in order to heighten or even to idealize. A glamorous image of a woman (or an image of a glamorous woman) is peculiarly powerful in that it plays on the desire of the spectator in a particularly pristine way: beauty or sexuality is desirable exactly to the extent that it is idealized and unattainable.”[4]On the other hand, critics may view the emphasis on Jones’s exoticism to be racially stereotypical rather than glorifying black beauty. Parts of Dobson’s physicality reverbate with notions of black animalistic imagery. Jones appears in elaborate fur coverings and dramatic makeup, especially around the eyes. Lisa Anderson describes such imagery: “The animal metaphors resurface; the jezebel is represented as a tiger, a puma, a panther, or other large, sleek cat who slinks up and pounces on her prey. She is a frightening apparition in the white imagination.”[4]","produced_by":"William \"Bill\" Tennant Max Julien","starring":"Tamara Dobson Bernie Casey Shelley Winters Antonio Fargas","running_time":"89 minutes","Sequel":"A sequel, Cleopatra Jones and the Casino of Gold appeared in 1975, with Dobson reprising the title role.[3] Jones travels to Hong Kong to free government agents Matthew and Melvin Johnson who have been captured by the Dragon Lady (Stella Stevens). Jones pairs up with Tanny (Ni Tien) and ends up in the Dragon Lady’s casino, headquarters for her underground drug empire. Jones and Tanny use their combat skills to battle the Dragon Lady’s henchmen and defeat the Dragon Lady herself.[2]The sequel’s lack of popularity was due not only to its poor reviews but also to the decline of blaxploitation films in general.","music_by":"J. J. Johnson","edited_by":"Allan Jacobs","written_by":"Max Julien Sheldon Keller","budget":"$3,250,000 (US/ Canada rentals)[1]"}