{"country":"United States New Zealand","distributed_by":"Screen Gems Universal Studios Ghost House Pictures Rose & Ruby (NZ)","screenplay_by":"Eric Kripke Juliet Snowden Stiles White","story_by":"Eric Kripke","Plot":"During his childhood, Tim Jensen witnesses his father be taken by the Boogeyman, an evil creature which lives in all closets worldwide. Since then, he has taken precautions to ensure that the Boogeyman cannot get to him, such as sleeping on a mattress on the floor, and removing all closets from his home and keeping all his clothes in a dresser drawer.After a Thanksgiving trip with Jessica to her parents' house, Tim has a premonition in which his mother tells him to return to the family home. When he phones the hospital, he discovers his mother has died. Upon returning to the psychiatric ward where he grew up after his father died, he discovers that one of the patients, a young girl, is being threatened by the Boogeyman, which this time lives in the ceiling of her room.Upon a suggestion by his psychiatrist that returning to his family home to spend the night in that house would be a good idea, Tim returns to his old Victorian style house in the open country, where he relives memories of his mother telling his father that the Boogeyman does not exist and therefore cannot possibly harm Tim. Tim is briefly attacked by the Boogeyman when he enters the downstairs closet. Tim meets a young girl in his woodshed, named Franny, who wants to know that if it's true that the Boogeyman murdered Tim's father. Searching the woodshed he discovers a disturbing file of Missing Person lists and documents left by Franny, and upon flicking through them, he discovers a collection of missing children whom were all taken by the Boogeyman.Tim panics and attempts to leave but Jessica, his girlfriend, abruptly shows up takes Tim out of the house for a night in a quiet motel, where she is murdered by the Boogeyman, dragging her into the bath.Tim returns from getting ice and preparing drinks and enters the bathroom, where he finds that Jessica is missing. He realizes what has occurred, and stumbles blindly into a closet, and then walks out into his family home, just as Kate, his friend, has returned to his home and, upon hearing noises from the closets, was about to open the door herself. Tim drags Kate back to the hotel, where they find the empty bath; this time with blood on the side. Kate begins thinking that Tim might've harmed Jessica; but Tim angrily denies it. Frustrated at Tim's refusal to tell her what is really wrong with him, Kate claims that the person Tim saw in her house was in fact her deaf father. Kate calls Tim's Uncle Mike to have him check on Tim.Tim returns to his house and meets Franny once more, who leads him to a house full of proclamations describing the Boogeyman. There is a chair in the middle of the room facing a closet. Tim remembers this room as being the home of a doctor whom everyone thought was insane. Franny then reveals herself to be one of the dead kids whom the Boogeyman murdered and disappears, telling Tim he'd best go to the place where it all started. The Boogeyman pulls time through various portals in time through the closet, eventually depositing Tim in his childhood room, where he smashes various toys the Boogeyman uses to give itself form, before eventually defeating it, and being returned to the present.With the Boogeyman gone, Tim hopes that his and Kate's lives will be safer. Morning dawns and Tim already feels better and the credits roll. However, a post-credits scene reveals a young girl being tormented by the monster, revealing that the Boogeyman has resurfaced out of the closet.","language":"English","Reception":"In its opening weekend, the film ranked at #1 grossing $19,020,655 nearly equaling its production budget. Domestically the film grossed $46,752,382 and $20,440,477 internationally grossing a worldwide total of $67,192,859.[1]Boogeyman received largely negative reviews from film critics. The review aggregator website Rotten Tomatoes reports that 13% of 87 critics gave the film a positive review, with an average rating of 3.4/10. The site's consensus states: \"The plot is been-there done-that generic, and none of the shock effects can do anything to build up suspense\".[2] Metacritic gave the film a 32 out of 100 rating, indicating \"generally unfavorable reviews.\"[3]Anita Gates from the New York Times gave the film a negative review, writing, \"The filmmakers are smart enough to keep the monster out of sight for a long time and then to show only glimpses, but a similar tactic of providing only glimpses of plot and character is disastrous. Moviegoers never learn who or what the boogeyman is, what his particular beef with Tim is, what his powers are and what has stirred up his wrath after all these years\". Summarizing, \"The house is very creaky, but then so is the movie\".[4] Marc Savlov from the Austin Chronicle awarded the film a very negative 1 out of 5 stars, panning the film's pacing, under-lite sets, computer generated effects, and overuse of horror clichés.[5] Frank Wilkins from Reel Talk gave the film a negative review stating, \"Although Boogeyman starts out with a stylishly depicted premise that promises a nightmarish ride into terror, after about twenty minutes the movie falls flat with its cheap terror tactics, its abysmal dialogue and its shamelessly tawdry script\".[6] Tom Meek from the Boston Phoenix gave the film 1 1/2 out of 4 stars saying, \" Director Stephen T. Kay knows how to get under your skin, and Watson nails the internal-turmoil bit, but it’s still just a one-trick pony that comes up lame long before the insipid climax\".[7] Jeremy Wheeler from AllMovie complimented Barry Watson and Emily Deschanel's performances, and promising start. But criticized the design of the film's title monster, and the finale which he called \"ridiculous\" and \"downright embarrassing\".[8] Film critic Leonard Maltin awarded the film a mixed 2 out of 4 stars, writing, \"Despite it's predictable blueprint there are a couple of pretty decent scares to be had here.\" But also stated, \"You might consider chapter-skipping on your DVD to get to the good stuff.\"[9]","box_office":"$67 million[1]","cinematography":"Bobby Bukowski","production_company":"Senator International Pacific Renaissance Pictures Ltd.","directed_by":"Stephen T. Kay","Home media":"The film was released on VHS and DVD, the latter of which released both on UMD and Special Edition by Columbia TriStar on May 31, 2005.[10][11] Universal Pictures later released the film on DVD later that same year. It was later released by Sony Pictures both as a double feature in 2006 and 2010, with the first release featuring it with When A Stranger Calls and the second release being paired with The Fog. It debuted on Blue-Ray on August 21, 2012 where it was released by Ais.[10]","boogeyman":"Theatrical release poster","release_dates":"February 4, 2005","produced_by":"Sam Raimi Rob Tapert Joe Drake Steve Hein Gary Bryman","starring":"Barry Watson Emily Deschanel Skye McCole Bartusiak Lucy Lawless","running_time":"89 minutes","music_by":"Joseph LoDuca","edited_by":"John Axelrad","budget":"$20 million[1]"}