{"Cast":"Steve Rossi claimed he was offered the Lou Canova role but Allen reneged when he was told that the film would be known as an Allen and Rossi film.[2] Robert De Niro and Sylvester Stallone both turned down the role.[3]","country":"United States","distributed_by":"Orion Pictures Corporation","Plot":"A hapless talent manager named Danny Rose, by helping a client, gets dragged into a love triangle involving the mob. His story is told in flashback, an anecdote shared amongst a group of comedians over lunch at New York's Carnegie Deli.Rose's one-man talent agency represents countless untalented entertainers, including washed-up lounge singer Lou Canova (Nick Apollo Forte), whose career is on the rebound.Lou, who has a wife and three kids, is having an affair with a woman, Tina (Mia Farrow), who had previously dated a gangster. Lou wants her to accompany him to his big gig at the Waldorf Astoria, where he will perform in front of Milton Berle, who could potentially hire him for even bigger things.At the singer's insistence, Danny Rose acts as a \"beard,\" masquerading as Tina's boyfriend to divert attention from the affair. Tina's ex-boyfriend is extremely jealous, and believing Tina's relationship with Danny to be real, he orders a hit on Danny, who finds himself in danger of losing both his client and his life.Danny and Tina narrowly escape, as Danny at gunpoint says Tina's real boyfriend is one of Danny's clients who Danny believes is on a cruise for a few weeks. Danny and Tina escape and show up at the Waldorf to find Lou drunk and unprepared to perform. Danny sobers Lou with a unique concoction that he has come up with over the years; Lou sobers up, and gives a command performance. With a new prestigious talent manager in attendance at the performance, Lou, in front of Tina (and with her encouragement), fires Danny and hires the new manager. Danny, feeling cheated, goes to the Carnegie Deli where he hears that the client he ratted on to save himself was beaten up by the hit men and is now in the hospital. Danny goes to the hospital to console his client and pays his hospital bills.Lou, who has left his wife and kids to marry Tina, becomes a success. Tina, feeling guilty for not sticking up for Danny, is depressed and they eventually split up. It is now Thanksgiving and Danny is hosting a party with all of his clients there. Tina shows up to the door and apologizes, asking Danny to remember his uncle Sidney's motto, \"acceptance, forgiveness, and love.\" At first Danny turns Tina away, but later catches up with her and they appear to make up. During this closing shot, the voiceover of the group of comedians talking about the story is heard. They praise Danny, and say that he was eventually awarded Broadway's highest honor: a sandwich at Broadway's best-known deli was named after him.","language":"English","Reception":"Broadway Danny Rose opened on January 27, 1984 on 109 North American screens, grossing $953,794 ($8,750 per screen) in its opening weekend. When it expanded to 613 theatres on February 17, its results were less impressive - $2,083,455 on the weekend ($3,398 per screen). Its total domestic gross was $10,600,497, off an $8 million budget.[4]Broadway Danny Rose received a very positive reception from critics. It holds a 100% positive \"Fresh\" rating from critics on Rotten Tomatoes with the consensus, \"Woody Allen's hard-working, uphill-climbing Broadway talent agent is rendered memorably with equal parts absurdity and affection.\"[5]Roger Ebert of the Chicago Sun-Times awarded the film three and a half stars out of four, praising the performances of Allen, Forte, and Farrow, whom he described as \"the real treasure among the performances.\"[6] Janet Maslin of The New York Times described the character of Danny Rose as \"one of the funniest and most touching characters Mr. Allen has yet created\" and added, \"Broadway Danny Rose [...] proceeds so sweetly and so illogically that it seems to have been spun, not constructed.\"[7] Time Out praised the combination of style and substance, stating \"The jokes are firmly embedded in plot and characterisation, and the film, shot by Gordon Willis in harsh black-and-white, looks terrific; but what makes it work so well is the unsentimental warmth pervading every frame.\"[8]In October 2013, the film was voted by the Guardian readers as the fifth best film directed by Woody Allen.[9]","box_office":"$10,600,497","cinematography":"Gordon Willis","directed_by":"Woody Allen","release_dates":"January 27, 1984 (1984-01-27) (U.S.)|||||","produced_by":"Robert Greenhut","starring":"Woody Allen|Mia Farrow|Nick Apollo Forte|","running_time":"84 minutes","edited_by":"Susan E. Morse","Release":"Broadway Danny Rose was released through MGM Home Entertainment on DVD November 6, 2001. A limited edition Blu-ray of 3,000 units was later released by Twilight Time April 8, 2014.[10]","written_by":"Woody Allen","budget":"$8 million"}