{"country":"United States","distributed_by":"New Line Cinema","Plot":"The film opens to a young George Jung (Jesse James) and his parents Fred (Ray Liotta) and Ermine (Rachel Griffiths) of Weymouth, Massachusetts. When George is ten years old, Fred files for bankruptcy and loses everything, but tries to make George realize that money is not important.As an adult, George (Johnny Depp) moves to Los Angeles with his friend \"Tuna\" (Ethan Suplee); they meet Barbara (Franka Potente), an airline stewardess, who introduces them to Derek Foreal (Paul Reubens), a marijuana dealer. With Derek's help, George and Tuna make a lot of money. Kevin Dulli (Max Perlich), a college student back in Boston, visits them and tells them of the enormous market—and demand—for pot in Boston. With Barbara's help, they start bringing the drugs to Boston.As the demand grows, they decide to start buying the drugs directly from Mexico with the help of Santiago Sanchez (Tony Amendola), a Mexican drug lord. But two years later, George is caught in Chicago trying to import 660 pounds of marijuana and is sentenced to two years. After unsuccessfully trying to plead his innocence (by reciting the lyrics of Bob Dylan's \"It Ain't Me Babe\" and insisting that he did no more than \"cross an imaginary line with a bunch of plants\"), George skips bail to take care of Barbara, who is suffering from, and eventually succumbs to, cancer. Her death marks the disbanding of the group of friends; even his friend, Tuna, flees their vacation home in Mexico and is never seen again.While hiding from the authorities, George visits his parents back in New England. While he is having a heart-to-heart talk with his father, George's mother calls the police, who come and arrest him.George is now sentenced to 26 months in a federal prison in Danbury, Connecticut. His cellmate Diego Delgado (Jordi Molla) has contacts in the Medellín cocaine cartel and convinces George to help him go into business. Upon his release from prison, George violates his parole conditions and heads down to Cartagena, Colombia to meet up with Diego. They meet with cartel officer Cesar Rosa to negotiate the terms for smuggling 15 kilograms (33 lb) to establish \"good faith\". As the smuggling operation grows, Diego gets arrested, leaving George to find a way to sell 50 kg (110 lb) and get the money in time. George reconnects with Derek in California, and the two successfully sell all 50 kg in 36 hours, amassing a $1.35 million profit. George is then whisked off to Medellín, Colombia, where he finally meets the group's leader, Pablo Escobar (Cliff Curtis), who agrees to go into business with them. With the help of main middleman Derek, the pair becomes Escobar's top US importer. At Diego's wedding, George meets Cesar's fiancée Mirtha (Penélope Cruz) and marries her. However, Diego resents George for keeping Derek's identity secret and pressures George to reveal his connection. George eventually discovers that Diego has betrayed him by cutting him out of the connection with Derek. Inspired by the birth of his daughter and chastened by a subsequent drug-related heart attack, George severs his relationship with the cartel and vows to leave the drug business forever.All goes well with George's newfound civilian life for five years, until Mirtha organizes a 38th birthday party for him. Many of his former drug associates attend, including Derek, who reveals that Diego eventually cut him out as well. The FBI and DEA raids the party and arrest George. Following George's conviction, he becomes a fugitive. Meanwhile, his bank account—heretofore under Manuel Noriega's protection in Panama—is seized. One night, he and Mirtha get into a fight while driving. They are pulled over by police and Mirtha tells them Jung is a fugitive and has stashed a kilogram of cocaine in his trunk. He is sent to jail for three years, during which time Mirtha divorces him and takes custody of their nine-year-old daughter, Kristina \"Sunshine\" Jung (Emma Roberts). Upon his release, George finds himself struggling to keep his relationship with his daughter on good terms.George promises Kristina a vacation in California and seeks one last deal to garner enough money for the trip. George completes a deal with former accomplices but learns too late that the deal had been set up by the FBI and DEA, with Dulli and Derek having leaked the nature and location of the action in exchange for pardons for their involvement in his prior action. George is sentenced to 60 years at Otisville Correctional Facility in upstate New York. He explains in the end that neither the sentence nor the betrayal bothered him, but that he can never forgive himself for having to break a promise to his daughter.While in prison, George requests a furlough to see his dying father, Fred. His unforgiving mother denies the request, saying a visit would only upset Fred. George is given a tape recorder to record a final message to his father. In the message, George recounts his memories of working with his father, his run-ins with the law, and finally, too late, his understanding of what Fred meant when he said that money is not \"real\".The film closes with George as an old man in prison, imagining that his daughter (Jaime King) finally comes to visit him. She slowly fades away as a guard calls for George. The film concludes with notes indicating that Jung's sentence will not expire until 2015, and that his daughter has yet to visit him. The film's final image is a photograph of the actual George Jung.","language":"English","Reception":"Blow was a minor box office success. With a budget of roughly $53 million, it managed to rake in just under $53 million domestically, but raised just over $30 million internationally for a worldwide total of $83,282,296.[1] Reviews for Blow were decidedly mixed. The film holds an approval rating of 55% at Rotten Tomatoes based on 136 reviews (75 positive, 61 negative), where the consensus is: \"With elements that seem borrowed from movies like Goodfellas and Boogie Nights, Blow is pretty much been-there-done-that despite another excellent performance from Johnny Depp. It also becomes too sentimental at the end.\"[3] Penélope Cruz was nominated for the Golden Raspberry Award for Worst Actress for her performances in Blow as well as Captain Corelli's Mandolin and Vanilla Sky.Rob Gonsalves from eFilmCritic.com gave the film 4 out of 5 stars stating: \"Blow isn't really a classic, but it's a sobering story well-told.\"[4] Roger Ebert gave the film 2½ out of 4 stars, but questioned the value about making Jung the subject of this film, stating: \"That's the thing about George [Jung]. He thinks it's all about him. His life, his story, his success, his fortune, his lost fortune, his good luck, his bad luck. Actually, all he did was operate a toll gate between suppliers and addicts. You wonder, but you never find out, if the reality of those destroyed lives ever occurred to him.\"[5] David Nusair of Reel Films also questioned making a film about Jung, stating \"The biggest problem with Blow is that Jung is such a complete moron.\" Nusair concludes that while it \"is not a bad film ... the central character of George Jung just doesn't seem worthy to be the center of attention.\"[6] Christopher Smith from Bangor Daily News gave the film a \"D+\", stating \"Blow is ultimately more about charisma than it is about truth, more about Depp's smooth strut and tousled hair than it is about George Jung's fatal flaws—his stupidity, desperation, ego and small-town greed.\"[7]","box_office":"$83.3 million[1]","cinematography":"Ellen Kuras","directed_by":"Ted Demme","Soundtrack":"Blow's soundtrack is a compilation of songs and artists from the 1970s, such as: \"Can't You Hear Me Knocking\" by The Rolling Stones, \"All the Tired Horses\" by Bob Dylan, \"Rumble\" by Link Wray, \"Glad and Sorry\" by Faces, \"Strange Brew\" by Cream, \"Black Betty\" by Ram Jam, \"Blinded By the Light\" by Manfred Mann's Earth Band, \"Let's Boogaloo\" by Willie Rosario, \"Keep It Comin' Love\" by KC & the Sunshine Band, \"That Smell\" by Lynyrd Skynyrd, \"Can't You See\" by The Marshall Tucker Band, and \"Push & Pull\" by Nikka Costa.Graeme Revell also composed the original score for the film. However, his work was not released in the soundtrack CD. For example, the music in the scene where George and Mirtha have sex, a track titled \"Little Ditty\", written and performed by Paul Wagner, is missing in the soundtrack album.","release_dates":"April 6, 2001 (2001-04-06)","produced_by":"Ted Demme Denis Leary Joel Stillerman","starring":"Johnny Depp Jordi Mollà Penélope Cruz Ray Liotta Paul Reubens Franka Potente Rachel Griffiths","running_time":"124 minutes[1]","music_by":"Graeme Revell","edited_by":"Kevin Tent","written_by":"Nick Cassavetes David McKenna","budget":"$53 million[1]"}