{"country":"United States","distributed_by":"Associated Film Distribution Universal Pictures (USA)","Plot":"In 1928 in New York State, aspiring author Marjorie Kinnan Rawlings (Steenburgen) advises her husband that her last book was rejected by a publisher, and she has bought an orange grove in Florida and is leaving him to go there. She drives to the nearest town alone, and arrives in time for her car to die. Local resident Norton Baskin (Peter Coyote) takes her the rest of the distance to a dilapidated and overgrown cabin attached to an even more overgrown orange grove. Despite Baskin's (and her own) doubts, she stays and begins to fix up the property.The local residents of \"the Creek\" begin to interact with her. Marsh Turner (Rip Torn) comes around with his daughter Ellie (Dana Hill), a teenage girl who keeps a deer fawn as a pet she has named Flag. A black woman, Geechee (Alfre Woodard), arrives and offers to work for her, despite the fact that Rawlings insists she cannot pay her much. The grove languishes below her expectations and Rawlings writes another novel, hoping to get it published. A very young married couple arrives to inhabit a cabin on Rawlings' property. The woman is very pregnant and they both reject Rawlings' attempts to help them.Rawlings employs the assistance of a few of the Creek residents, Geechee and Baskin, to unblock a vital irrigation vein for her grove, and it begins to improve. The young couple has their child. Ellie's deer grows older and escapes her pen, and Marsh foretells that the deer will have to be killed for eating all their food. Geechee's husband comes to stay with her after being released from prison, and Rawlings offers him a place to work in her grove, but he refuses and Rawlings asks him to leave.Even though her husband drinks and gambles, Geechee goes to leave with him, and Rawlings admits she will be sad to see Geechee leave, after Geechee demands to know why Rawlings would allow a friend to make such a mistake. Geechee decides to stay after all after telling Rawlings that she should learn how to treat her friends better.Rawlings submits her novel, a gothic romance, to Max Perkins, and it is rejected again. He writes her in return to tell her to write him stories about the people she describes so well in her letters, instead of the popular English governess stories she has been writing. She does so immediately, beginning with telling the story of the young married couple (eventually becoming \"Jacob's Ladder,\" published in Scribner's Magazine in 1931).During a visit to the Turner's home on Ellie's 14th birthday, Flag escapes his pen once more and Marsh is forced to shoot him after he has eaten the family's vegetables. Ellie screams at him in hatred, and Marsh goes on a bender, goes into town and attracts the attention of the sheriff. The sheriff finds Marsh drinking moonshine with a shotgun across his lap, and demands the gun. When Marsh offers it to him, the sheriff shoots him (the story eventually becoming the basis for The Yearling).Max Perkins (Malcolm McDowell) visits and accepts her story (Jacob's Ladder) upon reading it. Baskin asks Rawlings to marry him, which she accepts after much hesitation about her independence. Rawlings realizes her profound attachment to the land at Cross Creek.","language":"English","cinematography":"John A. Alonzo","directed_by":"Martin Ritt","Awards":"The film received four Academy Award nominations:It was also entered into the 1983 Cannes Film Festival.[1]","production_companies":"Thorn EMI Screen Entertainment Universal Pictures","cross_creek":"Promotional movie poster for Cross Creek","release_dates":"May 1983 (1983-05) (Cannes)|September 21, 1983 (1983-09-21) (United States)||||","produced_by":"Robert B. Radnitz Martin Ritt Terence Nelson","starring":"Mary Steenburgen Rip Torn Peter Coyote Alfre Woodard Dana Hill","running_time":"127 minutes","music_by":"Leonard Rosenman","edited_by":"Sidney Levin","written_by":"Dalene Young"}