{"based_on":"Diary of a Wimpy Kid: Rodrick Rules  by Jeff Kinney","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Jeff Judah Gabe Sachs","diary_of_a_wimpy_kid:_rodrick_rules":"Theatrical release poster","Plot":"The Heffley family attend a party at a roller rink, where Greg (Zachary Gordon) reunites with Rowley (Robert Capron), meets a new girl at school named Holly Hills (Peyton List) who Greg instantly has a crush on, and reveals he passed on the Cheese Touch. Rodrick interferes with the party, embarrassing Greg and causing Greg to try and tackle him and he lands in Taylor Pringle's cake. Then she and her friends proceed to beat up Greg as the intro starts. Then he describes his summer and the flaw between him and his two brothers. Susan Heffley makes an effort to have Rodrick and Greg bond by going in their bedroom and doing some things together, but it makes things worse. One day, a school talent show is advertised on TV; in which Rowley sees it as an opportunity to perform magic, and Rodrick sees it as the band's big break. However, Greg rejects the idea of doing the magic. One day at church, Greg and Rodrick are grounded after a scuffle; after which they are forbidden to go to Rock n' Rapids Water Park, nor inviting people over, and told that they must bond. However, Rodrick does the opposite, and throws a party.The next morning, Susan calls and says that they will be home early; in which Rodrick and Greg erase all the evidence, but they find that one of the doors is painted on, therefore; they replace doors, but Greg finds out that the replacement door doesn't have a lock like the last door. Rodrick convinces Greg to deny everything as their parents arrive. Susan however, discovers the difference and questions Greg, in which he nearly reveals the truth but keeps it secret. Rodrick and Greg then become friends, like showing Greg tricks to an easy life. One night they are finally exposed when Frank Heffley comes across photos of the party. They are both grounded, which includes Rodrick not being permitted to participate in the school talent show. Their punishment is to stay at the Leisure Towers with their Grandpa (Terrence Kelly) in which Rodrick finds out that Holly is staying and retrieves Greg's Diary, but Greg steals it and runs around with only undergarments on, inadvertently hiding in the women's restroom. Rodrick tapes the whole incident.At the talent show a few nights later, Rodrick finds out that he has been booted from the band by Bill Walter, a band member who recently joined; and Rowley isn't able to perform his magic tricks due to his partner having stage fright. Greg with a change of heart helps Rowley and Rodrick out by participating in Rowley's magic act in return for allowing Rodrick to perform his band act. The magic act was praised by Holly and the crowd, but people were unimpressed by Rodrick's music act until Susan starts dancing, then the crowd joins in. Frank taped the entire footage of Susan dancing, agreeing to Greg to keep it a secret. Rodrick kicks Bill out of the band, and he gives Greg the tape from the retirement home in return for allowing him to participate.In a mid-credits scene, Greg and Rowley upload the footage of Susan dancing to Rodrick's music onto YouTube and the video goes viral. Rodrick is heard saying that Greg is \"so dead\".","language":"English","Reception":"The film made $7,300,000 on its opening day, ranking #2 behind Sucker Punch. The film managed to rank #1 in the weekend box office.[6] In the UK, the film debuted at #3 in the weekend box office behind Pirates of the Caribbean: On Stranger Tides and The Hangover Part II.Like its predecessor, Rodrick Rules received mixed reviews; it currently holds a 47% \"Rotten\" rating on Rotten Tomatoes from 93 reviews, with an average rating of 5.3/10.[7] It holds a score of 53 on Metacritic, indicating \"mixed or average reviews\". Robert Abele of the Los Angeles Times gave the film a positive review saying, \"Director David Bowers keeps things peppy and brightly lighted, but the movie's swiftest pleasures come from moment-seizing cast members.\" Richard Roeper of the Chicago Sun-Times gave it a positive review saying, \"A little less wimpy, gives value lessons to the watchers from the cast, and still pretty funny\" and a B rating. Pete Hammond of Boxoffice magazine gave it a mixed review stating \"Even better than the first edition, in its own sitcom-ish ways.\" However, Michael O'Sullivan of The Washington Post gave it a negative review (38 on Metacritic), stating \"You can't fault the filmmakers for reshaping a diary into a cohesive film. You can however, fault them for taking one of the great antiheroes in preteen literature and turning him into, well, an even wimpier kid.\"","box_office":"$72.4 million[2]","cinematography":"Jack N. Green","production_company":"Color Force Dune Entertainment","directed_by":"David Bowers","narrated_by":"Zachary Gordon","release_dates":"March 17, 2011 (2011-03-17) (Singapore)|March 25, 2011 (2011-03-25) (United States)||||","Production":"Brad Simpson stated he anticipated a sequel movie if the first film is a success. \"Our writing staff are writing a sequel right now, \"Rodrick Rules,\" which would be based on the second book\" ... \"And, you know, we hope that the people to see a second movie, so that we are in position of going again right away and making another film. I certainly know that the fans would like to see all the books made into movies.\" Fox 2000 greenlit the sequel and Zachary Gordon returned as Greg Heffley. Steve Zahn (Frank Heffley) and Rachael Harris (Susan Heffley) will also return. The film was directed by David Bowers and the screenplay was written by Gabe Sachs and Jeff Judah. Principal photography began in Vancouver August 2010. A few new characters appeared in the film, including Peyton List as Holly Hills. The trailer was seen with Gulliver's Travels. The website created for the first was updated for the sequel featuring pictures of the cast and a short synopsis of the film. The film was released on March 25, 2011. Talks of a sequel were announced after the release of the first, but was not officially announced until May 12, 2010, announcing that it would be released March 25, 2011.[3] Filming took place in Vancouver, British Columbia and New Westminster, British Columbia from August 23 to October 27, 2010.[4] The mall scene was filmed at Park Royal Mall in West Vancouver. Director Thor Freudenthal was replaced by director David Bowers (Flushed Away and Astro Boy).","Distribution":"The film's trailer was shown with Gulliver's Travels on December 25, 2010. It was later online on January 3, 2011. A poster was released there after on January 14, 2011. In February 2011, an exclusive online-only trailer was released on the \"Wimpy Kid Movie\" YouTube channel, officialwimpmovie. Due to the success of the first film in Singapore, the film was released there eight days before the US release on March 17, 2011. The film was released in Brazil on September 16, 2011.[5] A TV spot of the movie was released in March 2011.Diary of a Wimpy Kid: Rodrick Rules was released on a stand-alone DVD, a special edition double DVD pack, and a Blu-ray/DVD/digital copy combo pack on June 21, 2011. One of the bonus shorts was shown during iParty with Victorious on Nickelodeon at 8:00 PM on June 11, 2011.","produced_by":"Nina Jacobson Brad Simpson Ethan Smith","starring":"Zachary Gordon Devon Bostick Rachael Harris Robert Capron Peyton List Steve Zahn","running_time":"101 minutes","music_by":"Edward Shearmur","edited_by":"Troy Takaki","budget":"$21 million[1]"}