{"country":"United States","distributed_by":"Universal Studios","Plot":"A introverted geek, Clifford Skridlow (Dan Aykroyd), is a professor of comparative literature at the financially strapped (fictional) Monroe College in Chicago.Smooth Walker (Howard Hesseman), a pimp, owes $80,000 to \"Mom\" (Kate Murtagh), a gruff Chicago mob boss. Attempting to weasel out of his debt, Smooth invents a fictitious mobster, the flamboyant \"Doctor Detroit,\" who purportedly is overrunning his turf. Aykroyd meets Smooth and his girls (Donna Dixon, Lydia Lei, Fran Drescher, and Lynn Whitfield) and has the best night of his life partying with them. After finding out about their troubles with Mom, Skridlow agrees to assume the role of Doctor Detroit in an effort to help them.Meanwhile, Monroe College awaits its anticipated corporate endowment, a check to be delivered by one of the executives, Harmon Rousehorn (Andrew Duggan). The film alternates between Skridlow's straight life and his life as the Doctor: Skridlow teaches literature and helps his nervous father (George Furth) secure money for the destitute college, while Dr. Detroit battles Mom, boogies with James Brown, and helps out four prostitutes previously subject to Smooth.The film was shot on location in Chicago during the summer of 1982.","language":"English","box_office":"$10,375,893[1]","cinematography":"King Baggot","production_company":"Brillstein Company","directed_by":"Michael Pressman","doctor_detroit":"Theatrical release poster","Soundtrack":"A soundtrack album for the film was released on the labels Backstreet, MCA, and WEA.","release_dates":"May 6, 1983 (1983-05-06)","produced_by":"Robert K. Weiss","starring":"Dan Aykroyd|Howard Hesseman|George Furth|James Brown|T. K. Carter|Donna Dixon|Fran Drescher|Lydia Lei|Lynn Whitfield|","running_time":"89 minutes","music_by":"James Brown (song, \"Get Up Offa That Thing/Dr. Detroit\")|Lalo Schifrin|","Reaction and sequel":"In her autobiography, Enter Whining, Fran Drescher commented that this film was expected to be a major hit for the summer of 1983, but that it fell short of that expectation; by the time the film ended its run in theaters, it had only managed to make US$10.8 million, on a budget of US$8 million.The end titles promised the release of Doctor Detroit II: The Wrath of Mom, meant as a gag based on Star Trek II: The Wrath of Khan, released eleven months previously. Aykroyd was said to have been writing the script; however, the project went unfulfilled due to poor box office results.[2][better source needed]","edited_by":"Christopher Greenbury","written_by":"Bruce Jay Friedman|Carl Gottlieb|Robert Boris|","budget":"$8 million[citation needed]"}