{"all_the_pretty_horses":"Theatrical release poster","based_on":"All the Pretty Horses by Cormac McCarthy","country":"United States","distributed_by":"Columbia Pictures (USA & Canada) Miramax Films (International)","Critical response":"Reviews of the film were generally negative, criticizing it as a poor adaptation of the novel and a dramatically un-involving film. It currently holds a 32% rating on Rotten Tomatoes based on 99 reviews.[4]Entertainment Weekly critic Lisa Schwarzbaum said: \"Faced with a choice of blunt instruments with which to beat a good book into a bad movie, director Billy Bob Thornton chooses heavy, random, arty imagery and a leaden pace.\"[5] The New York Times reviewer A. O. Scott thought the film \"as slick and superficial as a Marlboro advertisement\".[6]Roger Ebert disagreed, awarding the film three-and-a-half out of a possible four.[7]","screenplay_by":"Ted Tally","Plot":"In 1949, young cowboy John Grady Cole's maternal grandfather dies. John had grown up on his grandfather's ranch, but it was put up for sale when the old man died. His mother has no ties to it anymore, and would rather have the money. With no home, John asks his best friend Lacey Rawlins to leave his family ranch in San Angelo, Texas and join him to travel on horseback to cross the border 150 miles south, to seek work in Mexico. They encounter a peculiar 13-year-old boy named Jimmy Blevins on the trail to Mexico, whom they befriend but from whom they then separate. Later on they meet a young aristocrat's daughter, Alejandra Villarreal, with whom Cole falls in love.Cole and Rawlins become hired hands for Alejandra's father, who likes their work, but Cole's romantic interest in Alejandra is not welcomed by her wealthy aunt. After Alejandra's father takes her away, Cole and Rawlins are arrested by Mexican police and taken to jail, where they again encounter Blevins, who has been accused of stealing a horse and of murder, and is killed by a corrupt police captain. Cole and Rawlins are sent to a Mexican prison for abetting Blevins' crimes, where they must defend themselves against dangerous inmates. The pair are both nearly killed.Alejandra's aunt frees Cole and Rawlins, on the condition that she never sees them again. While Rawlins returns to his parents' ranch in Texas, Cole attempts to reunite with Alejandra over her family's objections. Her aunt is confident that Alejandra will keep her word and not get back together with Cole - so much so that she even gives Cole her niece's phone number. Cole urges Alejandra to come to Texas with him. She, however, decides she must keep her word and though she loves him, she will not go with him.Cole then sets out to get revenge on the captain who took the Blevins boy's life, as well as to get back his, Lacey's and Blevins' horses. After making the captain his prisoner, he turns him over to Mexican men, including one with whom Cole had previously shared a cell when they were imprisoned by the captain. Cole is spared the decision to kill the captain, but it is implied the men whom the captain was turned over to will do that.Reentering the USA and riding through a small town in Texas, towing two horses behind the one he is riding, he stops to inquire what day it is (it is Thanksgiving Day). He asks a couple of men if they would be interested in buying a rifle, as he needs the money. One is a sheriff's deputy and arrests him because all three horses have different brands, and they suspect Cole is a horse thief.In court, Cole tells the judge his story from the beginning. The judge believes him and orders Cole freed and the horses returned to him. Later that evening, Cole shows up at the judge's home, troubled. The judge had said good things about him in court, but Cole feels guilty that Blevins was killed - and while there was nothing he could have done to prevent the killing, he never even spoke up at the time and is upset with himself for that. The judge tells him he is being too hard on himself and it could not have been helped; he must go on and live his life.Coming towards the end of the film, Cole rides up to Lacey Rawlins on Rawlins' family's ranch and asks if he wants his horse back.","language":"English","box_office":"$18,133,495[1]","cinematography":"Barry Markowitz","directed_by":"Billy Bob Thornton","release_dates":"December 25, 2000 (2000-12-25)|||||","Production":"All the Pretty Horses was filmed on location in New Mexico and Texas.[citation needed]The version that Thornton presented to Miramax was over three hours long. Harvey Weinstein demanded that the film be cut down to under two hours and also put aside the original musical score by Daniel Lanois having Marty Stuart replace it.[2]Peter Biskind suggests in his book Down and Dirty Pictures (2004)[3] that the demand to cut the length of the film was at least partially done as payback for Thornton's refusal to cut Sling Blade (1996).[citation needed]Thornton's cut had an effect on the storytelling. Matt Damon publicly criticized Weinstein's decision, saying to Entertainment Weekly, \"You can't cut 35% of the movie and expect it to be the same movie.\"[citation needed]In an interview with Playboy Magazine Matt Damon expressed his displeasure with the changes saying \"Everybody who worked on All the Pretty Horses took so much time and cared so much. As you know, the Cormac McCarthy book is set in 1949 and is about a guy trying to hold on to his old way of life. The electric guitar became popular in 1949, and the composer Daniel Lanois got an old 1949 guitar and wrote this spare, haunting score. We did the movie listening to his score. It informed everything we did. We made this very dark, spare movie, but the studio wanted an epic with big emotions and violins. They saw the cast, the director, Billy Bob Thornton, and the fact that we spent $50 million, and they never released our movie—though the cut still exists. Billy had a heart problem at that time, and it was because his heart fucking broke from fighting for that film. It really fucked him up. It still bothers me to this day.\"[2]The idea of releasing the Thorton cut of the film is complicated by the fact that Lanois still owns the rights to his score for the film and has so far refused to license it.[2]Some attempts have been made to release a director's cut DVD, but arrangements cannot be reached with the composer of the film's music, Daniel Lanois. As part of the re-cut, Weinstein scrapped the original score and hired Marty Stuart. Lanois felt insulted, and has steadfastly refused to license his score (which, unusually, he owns) to any release of the film.[citation needed]","produced_by":"Robert Salerno Billy Bob Thornton","starring":"Matt Damon Penélope Cruz Henry Thomas Lucas Black","running_time":"116 minutes","music_by":"Marty Stuart Kristin Wilkinson Larry Paxton","edited_by":"Sally Menke","budget":"$57 million[1]"}