{"Cast":"The six members of the starring troupe have been announced as playing 40 total roles, in the manner of the Monty Python films.[4][6] Confirmed named roles[7] are listed below:It was subsequently confirmed at the 2014 Cannes film festival that Homeland star Damian Lewis would be joining the cast as Sir Richard Hawkins.[8][9] Other supporting actors include:","country":"United Kingdom","distributed_by":"Vertigo Films (UK) Koch Media (Germany, Scandinavia) Independent (other international sales)","screenplay_by":"Laurence Rickard Ben Willbond","story_by":"Laurence Rickard Ben Willbond","Plot":"Bill is set during Shakespeare's \"lost years\"—the crucial period, long a mystery to scholars, covering his rise from obscurity in Stratford-upon-Avon to fame as a playwright in London. According to the official synopsis, the film will tell the \"real story\" of what happens when \"hopeless lute player Bill Shakespeare leaves his family and home to follow his dream. It’s a tale of murderous kings, spies, lost loves, and a plot to blow up Queen Elizabeth I.\" [4] Writer Rickard further explained that this \"very different\" version of the future Bard has already tried \"everything from contemporary dance to playing lute in a band. He's never found his calling.\"[5]","bill":"UK theatrical release poster","language":"English","Reception":"Bill has received mostly positive reviews. Elliott Noble said 'the gags keep coming in a madcap tale that's Bard to the bone.' Alys Keys said 'Those who are unaware of their previous work will find just as much to enjoy in this iconoclastic approach to the bard as the most dedicated fans. No matter what your age or fan-status may be, it is simply a joy to watch.'[21] It currently has 94% on Rotten Tomatoes[22] Comedian Chris Addison has called it 'proper funny'.[21]","box_office":"$968,534[2]","cinematography":"Laurie Rose","production_company":"BBC Films Punk Cinema Cowboy Films","directed_by":"Richard Bracewell","release_dates":"18 September 2015 (2015-09-18)|||||","Production":"BBC Films announced Bill on 13 May 2013, as a co-production with fellow UK production companies Punk Cinema and Cowboy Films. Head of BBC Films Christine Langan said that \"we’re thrilled [to be] making the first film starring this team of incredibly talented and popular British comedy writers and performers.\"[4] In November of the same year ScreenDaily.com reported that the BFI (British Film Institute) Film Fund had invested £1 million in the production, with further undisclosed amounts coming from BBC Films, LipSync and Screen Yorkshire, through its Yorkshire Content Fund.[6]Principal filming began on 10 February 2014 at locations around Yorkshire, including York Minster, Skipton Castle, Marske-by-the-Sea, Bolton Castle and Selby Abbey. Other filming locations included Stowe School, Caroline Gardens Chapel in Peckham, London, and Weald and Downland Open Air Museum in West Sussex. The closing scenes were filmed at Shakespeare's Globe, a modern recreation of the theatre where many of Shakespeare's plays were first performed.[14][15][16]Former Horrible Histories co-stars Rickard and Willbond are credited with the Bill screenplay, and are also the top-billed performers along with the four other members of the HH starring cast (Baynton, Howe-Douglas, Farnaby and Howick).[4] Despite this connection, and sharing a similar subject matter, the film has no official affiliation with the earlier TV series. It is the second project (after Yonderland) created by the sextet as a means to continue working together as a troupe after Horrible Histories ceased production in 2012, while maintaining the familiar character-and-costume driven comedy style.[17] Making the move to film was \"a bit scary,\" Willbond said, \"but we cooked up a really nice plot.\"[16] Rickard described the overall tone of the new project as \"a hundred different brands of idiocy, really... We staunchly defend the idiocy.\"[5]In contrast to the conscientious grounding in accuracy that was the trademark of Horrible Histories, Bill is by design a purely imaginary tale. In the initial press release for the film, the co-writers noted that \"We're playing with history, just as Shakespeare did, for the entertainment of the audience.\"[4] Commenting on the choice of subject, Rickard added that in fact \"the joy of the \"lost years\" is we can tell a fun story without trampling on the facts—it gives us licence to take William Shakespeare on a truly ridiculous caper, yet end with him becoming the man the world knows.\"[14]The first full-length trailer for the film was released in December 2014, at which point the film's theatrical release date – originally scheduled for late February 2015 – was confirmed to have been delayed until 27 March the same year.[18] This was subsequently revised again – with no official explanation – to 21 August.[3]Vertigo Films announced on 12 August 2015 that it would be releasing Bill in the UK after previous distributor Koch Media had closed its UK film distribution business. Vertigo Films co-owner Rupert Preston told Screen International that “The film is really good fun and plays well with both adults and kids. It’s clever, bright and great British entertainment.” [19]","produced_by":"Richard Bracewell Tony Bracewell Alasdair Flind Charles Steel","starring":"Mathew Baynton Simon Farnaby Martha Howe-Douglas Jim Howick Laurence Rickard Ben Willbond","running_time":"94 minutes[1]","music_by":"Andrew Hewitt","edited_by":"Gary Dollner David Freeman Billy Sneddon","Release":"Bill was released in the UK on 18 September 2015 by Vertigo Films.[3] It was released on DVD in the UK on 15 February 2016.[20] It was shown on a one-time basis in the United States on April 11, 2016 through Fathom Events."}