{"country":"United States","distributed_by":"Orion Pictures","Plot":"The story follows two main characters: Judah Rosenthal (Martin Landau), a successful ophthalmologist, and Clifford Stern (Woody Allen), a small-time documentary filmmaker.Judah, a respectable family man, is having an affair with flight attendant Dolores Paley (Anjelica Huston). After it becomes clear to her that Judah will not end his marriage, Dolores, scorned, threatens to inform his wife of their affair. Dolores's letter to Miriam is intercepted and destroyed by Judah, but she sustains the pressure on him with threats of revelation. She is also aware of some questionable financial deals Judah has made, which adds to his stress. He confides in a patient, Ben (Sam Waterston), a rabbi who is rapidly losing his eyesight. Ben advises openness and honesty between Judah and his wife, but Judah does not wish to imperil his marriage. Desperate, Judah turns to his brother, Jack, who hires a hitman to kill Dolores. Before her corpse is discovered, Judah retrieves letters and other items from her apartment (where he sees her bloody corpse) in order to cover his tracks. Stricken with guilt, Judah turns to the religious teachings he had rejected, believing for the first time that a just God is watching him and passing judgment.Cliff, meanwhile, has been hired by his pompous brother-in-law, Lester (Alan Alda), a successful television producer, to make a documentary celebrating Lester's life and work. Cliff grows to despise him. While filming and mocking the subject, Cliff falls in love with Lester's associate producer, Halley Reed (Mia Farrow). Despondent over his failing marriage to Lester's sister Wendy (Joanna Gleason), he woos Halley, showing her footage from his ongoing documentary about Prof. Louis Levy (psychologist Martin S. Bergmann[3]), a renowned philosopher. He makes sure Halley is aware that he is shooting Lester's documentary merely for the money so he can finish his more meaningful project with Levy.Cliff's dislike for Lester becomes evident during the first screening of the film. It juxtaposes footage of Lester with clownish poses of Benito Mussolini addressing a throng of supporters from a balcony. It also shows Lester yelling at his employees and clumsily making a pass at an attractive young actress. Cliff learns that Professor Levy, whom he had been profiling on the strength of his celebration of life, has committed suicide, leaving a curt note, \"I've gone out the window.\" When Halley visits to comfort him, he makes a pass at her, which she gently rebuffs, telling him she isn't ready for another romance.Adding to Cliff's burdens, Halley leaves for London, where Lester is offering her a producing job; when she returns several months later, Cliff is astounded to discover that she and Lester are engaged. Hearing that Lester sent Halley white roses \"round the clock, for days\" while they were in London, Cliff is crestfallen as he realizes he is incapable of that kind of ostentatious display. His last romantic gesture to Halley had been a love letter which, he admits with humor, he had mostly plagiarized from James Joyce.In the final scene, Judah and Cliff meet by happenstance at the wedding of the daughter of rabbi Ben, who is Cliff's brother-in-law and Judah's patient. Once deeply anguished by the murder he arranged, Judah has worked through his guilt and is enjoying life once more; the murder had been blamed on a drifter with a criminal record. He draws Cliff into a supposedly hypothetical discussion that draws upon his moral quandary. Judah says that with time, any crisis will pass; but Cliff morosely claims instead that one is forever fated to bear one's burdens for \"crimes and misdemeanors\". Judah cheerfully leaves the wedding party with his wife, and Cliff is left sitting alone, dejected. Ben the rabbi, who has become blind by that time, shares a dance with his daughter while the last words of Prof. Levy are heard, pondering on how the Universe is a dark and meaningless place to which human beings fill with love, in the hope that this and other actions give the void around them a meaning.","language":"English","Reception":"The film grossed a domestic total of $18,254,702.[2]Crimes and Misdemeanors received mostly positive reviews. It currently holds a 93% \"Certified Fresh\" rating on review aggregator Rotten Tomatoes and a 77/100 weighted average score on Metacritic, which translates to \"generally favorable reviews\".[6]Vincent Canby of The New York Times lauded the film, remarking:The wonder of Crimes and Misdemeanors is the facility with which Mr. Allen deals with so many interlocking stories of so many differing tones and voices. The film cuts back and forth between parallel incidents and between present and past with the effortlessness of a hip, contemporary Aesop. The movie's secret strength - its structure, really - comes from the truth of the dozens and dozens of particular details through which it arrives at its own very hesitant, not especially comforting, very moving generality.\"[7]Roger Ebert of the Chicago Sun-Times gave the film four out of four stars, writing:The movie generates the best kind of suspense, because it's not about what will happen to people - it's about what decisions they will reach. We have the same information they have. What would we do? How far would we go to protect our happiness and reputation? How selfish would we be? Is our comfort worth more than another person's life? Allen does not evade this question, and his answer seems to be, yes, for some people, it would be.[8]Though normally an ardent critic of Allen's work, John Simon of the National Review declared the film to be \"Allen's first successful blending of drama and comedy, plot and subplot\" and wrote, \"The chief strength of the movie is its courage in confronting grave and painful questions of the kind the American cinema has been doing its damnedest to avoid.\"[9] Variety gave the film a more mixed review, however, writing, \"Woody Allen ambitiously mixes his two favoured strains of cinema, melodrama and comedy, with mixed results in Crimes and Misdemeanours.\"[10]In a poll of Empire magazine's poll of the 500 greatest movies of all time, the film was ranked number 267.[11] In 2010, it was the first film to win the 20/20 Award for Best Picture, Best Original Screenplay (Woody Allen), and Best Supporting Actor (Martin Landau). It also received three additional nominations for Best Director (Woody Allen), Best Supporting Actor (Jerry Orbach) and Best Supporting Actress (Anjelica Huston). In October 2013, the film was voted by the The Guardian readers as the third best film directed by Woody Allen.[12]","box_office":"$18,254,702[2]","cinematography":"Sven Nykvist","production_company":"Jack Rollins & Charles H. Joffe Productions","directed_by":"Woody Allen","release_dates":"October 13, 1989 (1989-10-13) (United States)|||||","Production":"After viewing the first cut of the film, Allen decided to throw out the first act, call back actors for reshoots, and focus on what turned out to be the central story.[4][clarification needed]Allen makes use of classical and jazz music in many of the film's scenes. The soundtrack includes Franz Schubert's String Quartet No. 15 (a recording by the Juilliard Quartet), which is used in the scenes leading up to Dolores' death, and Judah discovering her body.The outline of Judah's moral dilemma - whether a person can continue everyday life with the knowledge of having committed murder - evokes [5] the pivotal idea of the Russian novelist Fyodor Dostoyevsky's Crime and Punishment (1866), despite suggesting a resolution nearly opposite to that of the novel. The theme would be revisited by Allen in his films Match Point and Cassandra's Dream. The character of both Judah and his gangster brother were said to be influenced by a Jewish medical student who attended NYU with one of Marshall Brickman's relatives.","produced_by":"Robert Greenhut","starring":"Caroline Aaron|Alan Alda|Woody Allen|Claire Bloom|Mia Farrow|Joanna Gleason|Anjelica Huston|Martin Landau|Jenny Nichols|Jerry Orbach|Sam Waterston|","running_time":"104 minutes[1]","crimes_and_misdemeanors":"Theatrical release poster","music_by":"Franz Schubert","edited_by":"Susan E. Morse","Release":"Crimes and Misdemeanors was released through MGM Home Entertainment on DVD June 5, 2001. A limited edition Blu-ray of 3,000 units was later released by Twilight Time on February 11, 2014.[13]","written_by":"Woody Allen","budget":"$19 million"}