{"based_on":"Twelve Years a Slave  by Solomon Northup","Cast":"Stars of Beasts of the Southern Wild, Quvenzhané Wallis and Dwight Henry, have small roles as Margaret Northup[8] and Uncle Abram,[9] respectively.","country":"United States|United Kingdom|","distributed_by":"Fox Searchlight Pictures|(United States)|Entertainment One and Summit Entertainment|(United Kingdom)|","screenplay_by":"John Ridley","Plot":"In 1841, Solomon Northup is a free African-American man working as a violinist, living with his wife and two children in Saratoga Springs, New York. Two men, Brown and Hamilton, offer him short-term employment as a musician if he will travel with them to Washington, D.C. However, once they arrive, the duo drug Northup and conspire to deliver him to a slave pen. Northup is later shipped to New Orleans along with others who have been detained against their will. A slave trader named Freeman gives Northup the identity of \"Platt\", a runaway slave from Georgia, and sells him to plantation owner William Ford. Due to tension between Northup and another plantation worker, Ford sells him to another slave owner named Edwin Epps. In the process, Northup attempts to explain that he is actually a free man, but to no avail.Some time later, an outbreak of cotton worm befalls Epps' plantation. Unable to work his fields, Epps leases his slaves to a neighboring plantation for the season. While there, Northup gains the favor of the plantation's owner, Judge Turner, who allows him to play the fiddle at a neighbor's wedding anniversary celebration, and to keep his earnings. When Northup returns to Epps, he attempts to use the money to pay a white field hand and former overseer, Armsby, to mail a letter to his friends in New York state. Armsby agrees to deliver the letter, and accepts Northup's saved money in return, but later betrays him to Epps. Northup is narrowly able to convince Epps that Armsby is lying and avoids punishment.Northup begins working on the construction of a gazebo with a Canadian laborer named Samuel Bass. Bass is unsettled by the brutal way that Epps treats his slaves and expresses his opposition to slavery, earning Epps's enmity. Northup confides his kidnapping to Bass. Once again, Northup asks for help in getting a letter to Saratoga Springs. Bass, risking his life, agrees to send it. One day, Northup is called over by the local sheriff, who arrives in a carriage with another man. The sheriff asks Northup a series of questions to confirm his answers match the facts of his life in New York. Northup recognizes the sheriff's companion as Mr. Parker, a shopkeeper he knew in Saratoga. Parker has come to free him, and the two embrace, though an enraged Epps furiously protests the circumstances and tries to prevent him from leaving.After being enslaved for 12 years, Northup is restored to freedom and returned to his family. As he walks into his home, he sees his wife with their son and daughter and her husband, who present him with his grandson and namesake, Solomon Northup Staunton. The film's epilogue displays a series of graphics recounting Northup's unsuccessful suits against Brown, Hamilton and Burch, the 1853 publication of Northup's slave narrative memoir, Twelve Years a Slave, his role in the abolitionist movement, and the mystery surrounding details of his death and burial.","language":"English","Reception":"12 Years a Slave earned $187.7 million, including $56.7 million in the United States.[3] During its opening limited release in the United States, 12 Years a Slave debuted with a weekend total of $923,715 on 19 screens for a $48,617 per-screen average.[73] The following weekend, the film entered the top ten after expanding to 123 theatres and grossing an additional $2.1 million.[74] It continued to improve into its third weekend, grossing $4.6 million at 410 locations. The film release was expanded to over 1,100 locations on November 8, 2013.[3][75] In 2014, 12 Years a Slave was the 10th most-illegally downloaded movie, with 23.653 million such downloads, according to Variety.[76]12 Years a Slave received near-universal acclaim by critics and audiences, for its acting (particularly Ejiofor, Fassbender and Nyong'o), Steve McQueen's direction, John Ridley's screenplay, its production values, and its faithfulness to Solomon Northup's account. Film review aggregator Rotten Tomatoes reports that 96% of critics gave the film a \"Certified Fresh\" rating, based on 300 reviews with an average score of 9/10, with the site's consensus stating, \"It's far from comfortable viewing, but 12 Years a Slave's unflinchingly brutal look at American slavery is also brilliant—and quite possibly essential—cinema.\"[77] Metacritic, another review aggregator, assigned the film a weighted average score of 97 (out of 100) based on 48 reviews from mainstream critics, considered to be \"universal acclaim\". It is currently one of the site's highest-rated films as well as the best reviewed film of 2013.[78] CinemaScore reported that audiences gave the film an \"A\" grade.[79]Richard Corliss of TIME heralded the film and its director, Steve McQueen, by stating: \"Indeed, McQueen's film is closer in its storytelling particulars to such 1970s exploitation-exposés of slavery as Mandingo and Goodbye, Uncle Tom. Except that McQueen is not a schlockmeister sensationalist but a remorseless artist.\" Corliss draws parallels with Nazi Germany, saying, \"McQueen shows that racism, aside from its barbarous inhumanity, is insanely inefficient. It can be argued that Nazi Germany lost the war both because it diverted so much manpower to the killing of Jews and because it did not exploit the brilliance of Jewish scientists in building smarter weapons. So the slave owners dilute the energy of their slaves by whipping them for sadistic sport and, as Epps does, waking them at night to dance for his wife's cruel pleasure.\"[80] Gregory Ellwood of HitFix gave the film an \"A-\" rating, stating, \"12 Years is a powerful drama driven by McQueen's bold direction and the finest performance of Chiwetel Ejiofor's career.\" He continued by praising the performances of Fassbender and Nyong'o, citing Nyong'o as \"the film's breakthrough performance [that] may find Nyong'o making her way to the Dolby Theater next March.\" He also admired the film's \"gorgeous\" cinematography and the musical score, as \"one of Hans Zimmer's more moving scores in some time.\"[81] Paul MacInnes of The Guardian scored the film five out of five stars, writing, \"Stark, visceral and unrelenting, 12 Years a Slave is not just a great film but a necessary one.\"[82]Owen Gleiberman of Entertainment Weekly praised it as \"a new movie landmark of cruelty and transcendence\" and as \"a movie about a life that gets taken away, and that's why it lets us touch what life is.\" He also commented very positively about Ejiofor's performance, while further stating, \"12 Years a Slave lets us stare at the primal sin of America with open eyes, and at moments it is hard to watch, yet it's a movie of such humanity and grace that at every moment, you feel you're seeing something essential. It is Chiwetel Ejiofor's extraordinary performance that holds the movie together, and that allows us to watch it without blinking. He plays Solomon with a powerful inner strength, yet he never soft-pedals the silent nightmare that is Solomon's daily existence.\"[83] Peter Travers of Rolling Stone, gave the film a four-star rating and said: \"you won't be able to tuck this powder keg in the corner of your mind and forget it. What we have here is a blistering, brilliant, straight-up classic.\" He later named the film the best movie of 2013.[84]Manohla Dargis wrote, in her review for The New York Times, \"the genius of 12 Years a Slave is its insistence on banal evil, and on terror, that seeped into souls, bound bodies and reaped an enduring, terrible price.\"[85] The Daily Telegraph's Tim Robey granted the film a maximum score of five stars, stating that \"it's the nobility of this remarkable film that pierces the soul,\" while praising Ejiofor and Nyong'o's performances.[86] Tina Hassannia of Slant Magazine said that \"using his signature visual composition and deafening sound design, Steve McQueen portrays the harrowing realism of Northup's experience and the complicated relationships between master and slave, master and master, slave and slave, and so on.\"[87] David Simon, the creator of the TV series The Wire, highly praised the movie, commenting that \"it marks the first time in history that our entertainment industry, albeit with international creative input, has managed to stare directly at slavery and maintain that gaze\".[88]The film, however, was not without its criticisms. Stephanie Zacharek of The Village Voice was more critical of the film. While praising Ejiofor's work, she stated: \"It's a picture that stays more than a few safe steps away from anything so dangerous as raw feeling. Even when it depicts inhuman cruelty, as it often does, it never compromises its aesthetic purity.\"[89] Peter Malamud Smith of Slate criticized the story, saying, \"12 Years a Slave is constructed as a story of a man trying to return to his family, offering every viewer a way into empathizing with its protagonist. Maybe we need a story framed on that individual scale in order to understand it. But it has a distorting effect all the same. We're more invested in one hero than in millions of victims; if we're forced to imagine ourselves enslaved, we want to imagine ourselves as Northup, a special person who miraculously escaped the system that attempted to crush him.\" Describing this as \"the hero problem\", Malamud Smith concluded his review explaining, \"We can handle 12 Years a Slave. But don't expect 60 Years a Slave any time soon. And 200 Years, Millions of Slaves? Forget about it.\"[90] Ignatiy Vishnevetsky of The A.V. Club opined that McQueen is \"essentially tone-deaf when it comes to performance, and skirts by on casting.\" The film \"lacks a necessary emotional continuity. I don’t think it’s something the movie is denying in the way it intentionally denies so many other conventions; it’s still structured around an ending that’s supposed to function as a release, but because it can’t organize that sense of catharsis it so badly needs, it just feels as though McQueen is scurrying for an exit. Also: The cast is wildly uneven.\"[91] At The Guardian, black Canadian author Orville Lloyd Douglas said he would not be seeing 12 Years a Slave, explaining: \"I'm convinced these black race films are created for a white, liberal film audience to engender white guilt and make them feel bad about themselves. Regardless of your race, these films are unlikely to teach you anything you don't already know.\"[92]12 Years a Slave has received numerous awards and nominations. It earned three Academy Awards, including Best Picture.[93] It won the Golden Globe Award for Best Motion Picture – Drama.[94] The film also won the BAFTA Award for Best Film, while Ejiofor received the Best Actor award.[7] In addition, the motion picture has been named as one of the best films of 2013 by various ongoing critics, appearing on 100 critics' top-ten lists in which 25 had the film in their number-one spot. This is both the most of any film released in its production year.[95]","box_office":"$187.7 million[3]","Historical accuracy":"African-American history and culture scholar Henry Louis Gates Jr. was a consultant on the film, and researcher David Fiske, co-author of Solomon Northup: The Complete Story of the Author of Twelve Years a Slave, provided some material used to market the film.[45] Nevertheless, news and magazine articles around the time of the film's release described a scholar alleging some license that Northup could have taken with his book, and liberties that McQueen definitely took with Northup's original, for dramatic, modernizing, or other reasons.Scott Feinberg wrote in the The Hollywood Reporter about a September 22 New York Times article that \"dredged up and highlighted a 1985 essay by another scholar, James Olney, that questioned the 'literal truth' of specific incidents in Northup's account and suggested that David Wilson, the white amanuensis to whom Northup had dictated his story, had taken the liberty of sprucing it up to make it even more effective at rallying public opinion against slavery.\"[46] According to Olney, when abolitionists invited an ex-slave to share his experience in slavery at an antislavery convention, and when they subsequently funded the appearance of that story in print, \"they had certain clear expectations, well understood by themselves and well understood by the ex-slave, too.\"[45]Noah Berlatsky wrote in the The Atlantic about a scene in McQueen's adaptation. Shortly after Northup's kidnapping, he is sent on a slave ship. One of the sailors attempts to rape a female slave, but is stopped by a male slave. \"The sailor unhesitatingly stabs and kills [the male slave],\" he wrote, stating that \"this seems unlikely on its face—slaves are valuable, and the sailor is not the owner. And, sure enough, the scene is not in the book.\"[47]Forrest Wickman of Slate wrote of Northup's book giving a more favorable account of the author's onetime master, William Ford, than the McQueen film. In Northup's own words, \"There never was a more kind, noble, candid, Christian man than William Ford,\" adding that Ford's circumstances \"blinded [Ford] to the inherent wrong at the bottom of the system of Slavery.\" The movie, however, according to Wickham, \"frequently undermines Ford.\"[48] McQueen undercuts Christianity itself as well, in an effort to update the ethical lessons from Northup's story for the 21st century, by holding the institutions of Christianity up to the light for their ability to justify slavery at the time.[49] Northup was a Christian of his time, writing of his former master being \"blinded\" by \"circumstances\"[48] that in retrospect meant a racist acceptance of slavery despite being a Christian, a position untenable to some Christians now[50] and to Christian abolitionists of the 19th century but not contradictory to Northup himself. Valerie Elverton Dixon in The Washington Post characterized the Christianity depicted in the movie as \"broken\".[49]Emily West, an associate professor of history at the University of Reading who specializes in the history of slavery in the U.S., said she had \"never seen a film represent slavery so accurately\".[51] Reviewing the film for History Extra, the website of BBC History Magazine, she said: \"The film starkly and powerfully unveiled the sights and sounds of enslavement – from slaves picking cotton as they sang in the fields, to the crack of the lash down people’s backs. We also heard a lot about the ideology behind enslavement. Masters such as William Ford and Edwin Epps, although very different characters, both used an interpretation of Christianity to justify their ownership of slaves. They believed the Bible sanctioned slavery, and that it was their ‘Christian duty’ to preach the scriptures to their slaves.\"[51]","cinematography":"Sean Bobbitt","directed_by":"Steve McQueen","12_years_a_slave":"Theatrical release poster","production_companies":"Regency Enterprises River Road Entertainment Plan B Entertainment New Regency Film4 Productions","release_dates":"August 30, 2013 (2013-08-30) (Telluride Film Festival)|November 8, 2013 (2013-11-08) (United States)|January 10, 2014 (2014-01-10) (United Kingdom)|||","Production":"After meeting screenwriter John Ridley at a Creative Artists Agency screening of Hunger in 2008, director Steve McQueen got in touch with Ridley about his interest in making a film about \"the slave era in America\" with \"a character that was not obvious in terms of their trade in slavery.\"[10] Developing the idea back and forth, the two did not strike a chord until McQueen's partner, Bianca Stigter, found Solomon Northup's 1853 memoir Twelve Years a Slave. McQueen later told an interviewer:I read this book, and I was totally stunned. At the same time I was pretty upset with myself that I didn't know this book. I live in Amsterdam where Anne Frank is a national hero, and for me this book read like Anne Frank's diary but written 97 years before – a firsthand account of slavery. I basically made it my passion to make this book into a film.[11]After a lengthy development process, during which Brad Pitt's production company Plan B Entertainment backed the project, which eventually helped get some financing from various film studios, the film was officially announced in August 2011 with McQueen to direct and Chiwetel Ejiofor to star as Solomon Northup, a free African-American who was kidnapped and sold into slavery in the Deep South.[12] McQueen compared Ejiofor's conduct \"of class and dignity\" to that of Sidney Poitier and Harry Belafonte.[13] In October 2011, Michael Fassbender (who starred in McQueen's previous films Hunger and Shame) joined the cast.[14] In early 2012, the rest of the roles were cast, and filming was scheduled to begin at the end of June 2012.[15][16]To capture the language and dialects of the era and regions in which the film takes place, dialect coach Michael Buster assisted the cast in altering their speech. The language has a literary quality related to the style of writing of the day and the strong influence of the King James Bible.[17] Buster explained:We don't know what slaves sounded like in the 1840s, so I just used rural samples from Mississippi and Louisiana [for actors Ejiofor and Fassbender]. Then for Benedict [Cumberbatch], I found some real upper-class New Orleanians from the '30s. And then I also worked with Lupita Nyong'o, who is Kenyan but she did her training at Yale. So she really shifted her speech so she could do American speech.[18]After both won Oscars at the 86th Academy Awards, it was reported that McQueen and Ridley had been in an ongoing feud over screenplay credit. McQueen reportedly had asked Ridley for shared credit, which he declined. McQueen appealed to Fox Searchlight, which sided with Ridley. Neither thanked the other during their respective acceptance speeches at the event.[19] Since the event, Ridley has noted his regret for not mentioning McQueen[20][21] and denied the feud.[22][23] He spoke favorably of working with McQueen, and explained that his sole screenplay credit was due to the rules of the Writers Guild of America.[24] McQueen has not commented on the alleged feud.[19][21][22][23]With a production budget of $22 million,[25] principal photography began in New Orleans, Louisiana, on June 27, 2012. After seven weeks,[26] filming concluded on August 13, 2012.[27] As a way to keep down production costs, a bulk of the filming took place around the greater New Orleans area – mostly south of the Red River country in the north of the state, where the historic Northup was enslaved.[28] Among locations used were four historic antebellum plantations: Felicity, Bocage, Destrehan, and Magnolia.[29] Magnolia, a plantation in Schriever, Louisiana, is just a few miles from one of the historic sites where Northup was held. \"To know that we were right there in the place where these things occurred was so powerful and emotional,\" said actor Chiwetel Ejiofor. \"That feeling of dancing with ghosts – it's palpable.\"[30] Filming also took place at the Columns Hotel and Madame John's Legacy in the French Quarter of New Orleans.[31]Cinematographer Sean Bobbitt, the film's primary camera operator,[32] shot 12 Years a Slave on 35 mm film with a 2.35:1 widescreen aspect ratio using both an Arricam LT and ST. \"Particularly for a period piece, film gives the audience a definite sense of period and quality,\" said Bobbitt. \"And because of the story's epic nature, widescreen clearly made the most sense. Widescreen means a big film, an epic tale – in this case an epic tale of human endurance.\"[33]The filmmakers avoided the desaturated visual style that is typical of a more gritty documentary aesthetic.[34] Deliberately drawing visual comparisons in the filming to the works of Spanish painter Francisco Goya, McQueen explained:When you think about Goya, who painted the most horrendous pictures of violence and torture and so forth, and they're amazing, exquisite paintings, one of the reasons they're such wonderful paintings is because what he's saying is, 'Look – look at this.' So if you paint it badly or put it in the sort of wrong perspective, you draw more attention to what's wrong with the image rather than looking at the image.[35]To accurately depict the time period of the film, the filmmakers conducted extensive research that included studying artwork from the era.[36] With eight weeks to create the wardrobe, costume designer Patricia Norris collaborated with Western Costume to compile costumes that would illustrate the passage of time while also being historically accurate.[37] Using an earth tone color palette, Norris created nearly 1,000 costumes for the film. \"She [Norris] took earth samples from all three of the plantations to match the clothes,\" McQueen said, \"and she had the conversation with Sean [Bobbitt] to deal with the character temperature on each plantation, there was a lot of that minute detail.\"[38] The filmmakers also used some pieces of clothing discovered on set that were worn by slaves.[39]The musical score to 12 Years a Slave was composed by Hans Zimmer, with original on-screen violin music written and arranged by Nicholas Britell and performed by Tim Fain.[40] The film also features a few pieces of western classical and American folk music such as Franz Schubert's \"Trio in B-flat, D471\" and John and Alan Lomax's arrangement of \"Run, Nigger, Run\".[41] A soundtrack album, Music from and Inspired by 12 Years a Slave, was released digitally on November 5 and received a physical format release on November 11, 2013 by Columbia Records.[42] In addition to Zimmer's score, the album features music inspired by the film by artists such as John Legend, Laura Mvula, Alicia Keys, Chris Cornell, and Alabama Shakes.[43] Legend's cover of \"Roll, Jordan, Roll\" debuted online three weeks prior to the soundtrack's release.[44]","produced_by":"Brad Pitt|Dede Gardner|Jeremy Kleiner|Bill Pohlad|Steve McQueen|Arnon Milchan|Anthony Katagas|","starring":"Chiwetel Ejiofor|Michael Fassbender|Benedict Cumberbatch|Paul Dano|Paul Giamatti|Lupita Nyong'o|Sarah Paulson|Brad Pitt|Alfre Woodard|","running_time":"134 minutes[1]","music_by":"Hans Zimmer","edited_by":"Joe Walker","Release":"12 Years a Slave premiered at the Telluride Film Festival on August 30, 2013;[52] it was later screened at the 2013 Toronto International Film Festival on September 6,[53] the New York Film Festival on October 8,[54] the New Orleans Film Festival on October 10,[55] and the Philadelphia Film Festival on October 19.[56] On November 15, 2011, Summit Entertainment announced it had secured a deal to distribute 12 Years a Slave to international markets.[57] In April 2012, a few weeks before principal photography, New Regency Productions agreed to co-finance the film.[58] Because of a distribution pact between 20th Century Fox and New Regency, Fox Searchlight Pictures acquired the film's United States distribution rights.[59] However, instead of paying for the distribution rights, Fox Searchlight made a deal in which it would share box-office proceeds with the financiers of the independently financed film.[60] 12 Years a Slave was commercially released on October 18, 2013 in the United States for a limited release of 19 theaters, with a wide release in subsequent weeks.[61] The film was initially scheduled to be released in late December 2013, but \"some exuberant test screenings\" led to the decision to move up the release date.[62] The film was distributed by Entertainment One in the United Kingdom.[63]Due to both the film's explicit nature and award contender status, 12 Years a Slave's financial success was being watched closely. Many analysts compared the film's content to other drama films of a similar vein such as Schindler's List (1993) and The Passion of the Christ (2004), which became box office successes despite their respective subject matters.[30][60] \"It may be a tough subject matter, but when handled well ... films that are tough to sit through can still be commercially successful,\" said Phil Contrino of Boxoffice Magazine.[64] Despite its content, the film's critical success has assisted its domestic distribution by Fox Searchlight that began with a limited released aimed primarily towards art house and African-American patrons.[65] The film's release was gradually widened in subsequent weeks, similarly to how the studio had successfully done in years prior with films such as Black Swan and The Descendants.[66] International release dates for 12 Years a Slave were largely delayed to early 2014 in order to take advantage of the attention created by awards seasons.[67]During its marketing campaign, 12 Years a Slave received unpaid endorsements by celebrities such as Kanye West and Sean Combs.[68] In a video posted by Revolt, Combs urged viewers to see 12 Years a Slave by stating: \"This movie is very painful but very honest, and is a part of the healing process. I beg all of you to take your kids, everybody to see it. ... You have to see this so you can understand, so you can just start to understand.\"[69]Following its cinematic release in theaters, the Region 1 Code widescreen edition of the film was released on DVD in the United States on March 4, 2014. Special features for the DVD include; a Closed Caption option, The Team - Meet the creative minds assembled by Director Steve McQueen and bring Solomon Northup's journey to life bonus selection, and The Score - Follow film Composer Hans Zimmer creating his dramatic score feature.[70] In supplemental fashion, a widescreen hi-definition Blu-ray Disc version of the film was also released on the same day. Special features include; a historical portrait from Director Steve McQueen's documentary feature, cast and crew interviews, The Team special feature, and The Score selection.[71] An additional viewing option for the film in the media format of Video on demand has been made available as well.[72]","budget":"$22 million[2]"}