{"dirty_mary,_crazy_larry":"Theatrical release poster","based_on":"Pursuit  by Richard Unekis","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Leigh Chapman|Antonio Santean|","Plot":"Two NASCAR hopefuls, driver Larry Rayder and his mechanic Deke Sommers, successfully execute a supermarket heist to finance their jump into big-time auto racing. They extort $150,000 in cash from a supermarket manager by holding his wife and daughter hostage.In making their escape, they are confronted by Larry's one-night stand, Mary Coombs. She coerces them to take her along for the ride in their souped-up 1966 Chevrolet Impala. The unorthodox sheriff, Captain Everett Franklin, obsessively pursues the trio in a dragnet, only to find his outmoded patrol cars unable to catch Larry, Mary, and Deke after they ditch the Impala for a 1969 Dodge Charger R/T 440 at a flea market.As part of the escape plan, Larry's vehicle enters an expansive walnut grove, where the trees provide significant cover from aerial tracking, and the many intersecting roads (\"with sixty distinct and separate exits\") making road blocks ineffective. The trio evades several Dodge Polara patrol cars, a specially-prepared high-performance police interceptor, and even Captain Franklin himself in a Bell JetRanger helicopter. Believing they've finally beaten the police, Larry and company meet their doom when they randomly collide with a freight train pulled by an Alco S1 locomotive.","language":"English","box_office":"$28.4 million[3]","cinematography":"Michael D. Margulies","production_company":"Academy Pictures","directed_by":"John Hough","Home media":"On April 12, 2011, the film was released on DVD through Shout! Factory, packaged as a double feature with another Peter Fonda film, Race with the Devil.","release_dates":"May 17, 1974 (1974-05-17)|||||","Production":"Dirty Mary, Crazy Larry is based on the novel originally titled The Chase (later renamed Pursuit) by Richard Unekis, and published in 1963. The story incorporated a phenomenon that was relatively new in 1963: major auto manufacturers were putting powerful V-8 engines into mid-sized cars (the dawn of the \"muscle car\" era), and young thieves behind the wheel of these cars were now able to outrun the economy 6-cylinder sedans driven by police in many jurisdictions. The protagonists of The Chase used such a vehicle, a Chevrolet, and made use of the checkerboard of roads in the farm country of Illinois to outrun the police.According to Unekis' son, the rights to the book were originally bought for very little money by director Howard Hawks, who had Steve McQueen in mind for the title role of a future film project. Hawks commissioned three scripts, all of which followed the book very closely (and consequently were out of date with the automobile technology of the 1970s), but Hawks elected to opt out of the project when he was offered US$50,000 for the film rights by two wealthy English industrialist partners, Sir James Hanson and Sir Gordon White. White and Hanson (who, at the time, owned Eveready Batteries and Ball Park Franks), had purchased the book to read on their plane while flying to the U.S. They both felt The Chase would make an entertaining film, and presented the idea to personal friend Michael Pearson, who had produced an earlier successful car chase cult movie, Vanishing Point.After pitching their project to their movie mogul friends, who not only included Pearson but Albert R. Broccoli, Harold Robbins, and Sam Spiegel, they soon discovered the movie business was not as easy as they had suspected. In addition, they were saddled with an out of date book - and no screenplay - for which they grossly overpaid. With no interest from anyone in picking up the project, Sir James and Sir Gordon soon lost interest in making movies.Over dinner one evening at Hanson's estate in Palm Springs, California they told their plight to friend and neighbor Jimmy Boyd. Boyd read the book and agreed with Hanson and White that it would make a great car chase. Boyd, a race car enthusiast, had successfully built and raced cars along with his friend Lance Reventlow, and had come very close to pursuing race car driving as a career. He guaranteed Hanson and White their fifty thousand dollars in return for the rights to the book. Boyd wrote the screenplay himself along the lines of Butch Cassidy and the Sundance Kid, updating the dialogue and humor for an early 1970s audience. He also changed the two main characters from the escaped convicts in the book, into a slightly larcenous - but likable - NASCAR dreamer and his Mechanic, nicknamed Fast Floyd and Dirty Deke. Boyd then incorporated the one-night stand female stowaway, and the added dimension of a NASCAR-engined getaway car capable of 165 miles per hour (266 km/h). Except for the tires and wheels, it was a stock-appearing Ford built by the famous race car builders Traco Engineering. However, three relatively stock Dodge Chargers (two 1969 models and one 1968 model) were used in the movie after Boyd's departure. None of the three cars were originally \"R/T\" models and none of them had a big-block engine, though two were re-badged as R/Ts (one remained badged as a base model) and all three were given custom \"440\" callouts on the rear quarter panels.Boyd's script also added the critical plot twist of the police captain in the helicopter making up units that didn't exist on the scanner to trap the thieves, and the version of the wreck at the end of the movie (from a semi-truck on the highway to the surprise collision with a freight train).On the strength of his script, Boyd had raised $2 million for the budget (a big budget at the time). Boyd had two young, then-unknown actors, David Soul and Sam Elliott, in mind for the lead roles, when he got a phone call from James Nicholson, president and partner of Sam Arkoff at American International Pictures, a major producer of \"B Movies\". Nicholson was leaving AIP to form his own company, Academy Pictures, in partnership with 20th Century Fox: Fox would finance and distribute his films and give him complete control. Nicholson told Boyd he had read his script for Pursuit, and wanted it to be his first film for Academy Pictures. It was very risky making an \"Indie\" film in the 1970s without a distribution deal. Important film festivals like Sundance Film Festival did not exist. Boyd decided to enter into a partnership with Nicholson's Academy Pictures.Fox got Peter Fonda interested in the project, and Nicholson hired English director John Hough. Hough had directed a horror film for Nicholson at AIP, and could bring English actress Susan George into the mix, providing one of the male leads would be rewritten for her. It became quickly apparent that Nicholson and Boyd had two completely different philosophies of how the film should be made. Boyd wanted to make a realistic, exciting, humorous, helicopter-versus-car chase. Nicholson wasn't so much interested in the content of the film, as he was in attaching recognizable names and catchy titles to market it. After a long series of legal battles over control and Nicholson's rewrites of the film, Boyd accepted a settlement offer and left the project.The film was shot in and around Stockton, California in late 1973, mostly in the walnut groves near the small town of Linden, California. The supermarket scenes were filmed in Sonora, California, the drawbridge jump was filmed in Tracy, California, the swap meet scene in Clements, California and the climactic train crash was filmed on the Stockton Terminal and Eastern Railroad in Linden, California, near the intersection of Ketcham Lane and Archerdale Road. The Bell JetRanger used in the climactic chase was flown by veteran film pilot James W. Gavin (who played the character of the pilot as well), and was actually flown between rows of trees and under powerlines as seen in the film.","produced_by":"Norman T. Herman","starring":"Peter Fonda|Susan George|Adam Roarke|Vic Morrow|","running_time":"92 minutes[1]","music_by":"Jimmie Haskell (Main theme)","edited_by":"Christopher Holmes","Release":"Dirty Mary, Crazy Larry was a very popular release of Fox's in the spring of 1974, earning North American rentals of $12.1 million.[4] By 1977, it earned an estimated $14.7 million in theatrical rentals.[5]The film received mixed reviews from critics. On Rotten Tomatoes, the film has a 50% rating based on 14 reviews, with an average rating of 4.7/10.[6]","budget":"$1.14 million[2]"}