{"country":"United States United Kingdom","distributed_by":"Paramount Pictures (USA & Canada) Columbia Pictures (International)","Plot":"\"Daryl\" (whose name is an acronym for \"Data-Analysing Robotic Youth Lifeform\") (Barret Oliver) is an experiment in Artificial Intelligence, created by the government. Although physically indistinguishable from an ordinary ten-year-old boy, his brain is actually a supersophisticated microcomputer with several unique capabilities. These include exceptional reflexes, superhuman multitasking ability, and the ability to \"hack\" other computer systems. The D.A.R.Y.L. experiment was funded by the military, with the intention of producing a \"super-soldier\". One of the original scientists has misgivings about the experiment and decides to free Daryl, but is killed in the process.Daryl is found by an elderly couple and taken to an orphanage. He does not remember who or what he is. Though a normal pre-adolescent boy in most aspects, Daryl begins to exhibit extraordinary talents after he goes to live with foster parents Joyce (Mary Beth Hurt) and Andy Richardson (Michael McKean), including uncanny abilities at baseball, interaction with an ATM, and in playing Pole Position. He is also introduced to the neighbors of the Richardsons: Howie (Steve Ryan) and Elaine Fox (Colleen Camp) and their children Sherie (Amy Linker) and Turtle (Danny Corkill). As Daryl was raised in isolation, his social skills are quite limited. His friend Turtle, an unusually vulgar and obnoxious ten-year-old, helps him develop social skills.However, just as the Richardsons have truly begun to form a bond with Daryl, their new-found happiness is shattered when the Government finds and returns him to the facility where he was created. Once there, his memory is restored and he is debriefed on the lessons he learned during his time with the Richardsons. Notable lessons include his decision to strike out at a baseball game, because \"under certain conditions [relating with others], error was more efficient than maximum performance.\", and his subjective preference for chocolate over vanilla ice cream. Because Daryl has revealed a capacity for human emotions (including fear), the D.A.R.Y.L. experiment is considered a failure by the military and the decision is made that the project be \"terminated\". Dr. Stewart (Josef Sommer), one of Daryl's designers, decides to free Daryl so he can return to the Richardson family. Unfortunately, despite the cooperation of Dr. Lamb (Kathryn Walker) in the escape, who was originally skeptical about Daryl's humanity and had alerted the military to Daryl's continued existence, they do not get away cleanly. When asked by the military to justify her complicity, Dr. Lamb offers a reformulation of the Turing Test: \"General, a machine becomes human ... when you can't tell the difference anymore.\", implying that she is no longer certain that Daryl is not human.Daryl and Dr. Stewart escape the first wave of pursuers, thanks to Daryl's advanced driving skills, apparently acquired through playing the F1 Pole Position video game and watching a driving stuntman on television. However, when passing two police roadblocks, Dr. Stewart is mortally wounded by a police officer. With his dying words, he assures Daryl that he is indeed a real person. Continuing his escape, Daryl steals an SR-71 Blackbird from a nearby airbase. After being told that plane will be blown up mid-flight by the U.S.A.F. using a self-destruct mechanism (as their missiles cannot intercept it), Daryl ejects at the last moment, faking his own destruction. The ejection knocks him unconscious and his parachute falls into a lake, causing him to drown and show no signs of life. In the hospital, Dr. Lamb finds him and reactivates his electronic brain, restoring him to life. Officially dead, Daryl is free to run back to his foster family, and he is reunited with the Richardsons and the Foxes.","language":"English","Reception":"D.A.R.Y.L. failed to make it into the box office top five, and has received mainly mixed reviews. The film currently holds a \"rotten\" 53% positive critics' score on Rotten Tomatoes based on 15 reviews.[2] A 1985 reviewer for The New York Times wrote, \"The best that can be said about D.A.R.Y.L.... is that it's inoffensive.\"[3] In his review for Entertainment Tonight, Leonard Maltin said, \"This is one of the blandest movies I've seen all year. No punch. No surprises. No juice, especially in the way it's directed.\"[4] On their show At the Movies, Gene Siskel gave D.A.R.Y.L. a \"thumbs down\" for being predictable and formulaic, while Roger Ebert recommended the movie, praising its ending and comparing its theme to that of the 1968 film Charly.[5]DVD Verdict cites \"wooden\" acting and a \"preposterous\" plot, but ultimately concludes that the film is \"a formulaic slice of family entertainment that doesn't do much new, but follows the blueprint well enough to warrant a look.\"[6] Many positive modern reviews cite 1980s nostalgia (in particular, a scene in which Daryl plays Atari) as a basis for more positive ratings.","box_office":"$25,000,000","cinematography":"Frank Watts","directed_by":"Simon Wincer","release_dates":"June 14, 1985 June 9, 1990 (Russian Federation)","produced_by":"John Heyman Burtt Harris Gabrielle Kelly","starring":"Mary Beth Hurt|Michael McKean|Kathryn Walker|Colleen Camp|Josef Sommer|Barret Oliver|","running_time":"99 min.","music_by":"Marvin Hamlisch","edited_by":"Adrian Carr","d.a.r.y.l.":"Theatrical release poster","written_by":"David Ambrose Allan Scott Jeffrey Ellis","budget":"$12 million"}