{"country":"United States","distributed_by":"United Film Distribution Company","Plot":"Cannibalistic zombies have overrun the entire world. The remaining fragments of the U.S. government and military hide out in fortified military bases and colonies, attempting to find a solution to the zombie pandemic. Sarah, Private Miguel Salazar, radio operator William \"Bill\" McDermott, and helicopter pilot John fly from their base to Fort Myers, Florida, in an attempt to locate additional survivors. They encounter a large horde of the undead, and return to their army base in the Everglades, where a small group of scientists, supported by a skeleton crew of soldiers, is searching for a way to stop or reverse the re-animation process.Dr. Logan, the lead scientist – also known as \"Frankenstein\" due to his grisly surgical dissections of zombies  – believes that the zombies can be trained to become docile, and accordingly has amassed a collection of test subjects, which are kept in a large underground corral in the compound, in spite of the objections of base-commander Captain Henry Rhodes. The tension between soldiers and scientists worsens in the face of dwindling supplies, loss of communication with other survivors, and slow progress in research. During a meeting between the scientists and the soldiers, Rhodes announces that he is taking command of the base, that the scientists henceforth will work under his orders, and that anyone who objects will be instantly killed. Dr. Logan hopes to secure Rhodes' cooperation by showing him the results of his research. He is especially proud of \"Bub\", a docile zombie who remembers some parts of his past life and engages in rudimentary human behavior: listening to music, aiming a pistol, and saluting Captain Rhodes. Rhodes is not impressed.During a zombie roundup mission, two of the soldiers, Miller and Johnson, are killed after a zombie escapes its harness; whereupon Miguel attempts to kill the creature, but is bitten on the arm. Sarah amputates the arm and cauterizes it to stop the spreading infection. Rhodes then calls off the experiments and demands that all captive zombies be destroyed. Sarah and Bill later discover a crude form of Dr. Logan's experimentation involving the bodies of Miller and Johnson and an audio tape in which a crazed Logan talks to his \"Father\" and \"Mother\"; horrified, both Sarah and Bill plan to leave in the helicopter immediately before someone else does.Conditions worsen when Rhodes finds out that Logan has been feeding the flesh of his dead soldiers to Bub as a reward for his docility and positive behavior. Enraged, Rhodes kills Logan and his assistant Dr. Fisher. He then locks Sarah and Bill inside the zombie corral and then attempts to force John to fly him and his men away from the base, which John refuses to do.Bub manages to escape from his chain and finds Dr. Logan's corpse. In a display of human emotion, he expresses sadness and then becomes enraged. He finds a pistol discarded on the floor and goes in search of revenge. Meanwhile, Miguel, who has become suicidal, opens the gates to the compound, allowing the horde of zombies lurking outside to enter onto the elevator, devouring him. While Miguel is doing this, John overcomes his captors, knocking both Rhodes and Torrez out before stealing their weapons and going into the zombie corral to rescue Sarah and Bill. The zombies rapidly enter the complex; Pvt Rickles and Pvt Torrez are torn apart by the horde. Pvt Steele attempts to shoot Bub through a covered window, but gets bitten by another zombie and chooses to kill himself. Rhodes attempts to escape, but is shot and wounded by Bub and violently torn to pieces by a crowd of zombies.John reunites with Sarah and McDermott inside the zombie corral. They escape together to the surface, board the helicopter, and fly to a deserted island with no dead people or zombies on it. The film ends with Sarah crossing off a day on her calendar which counts the days since their escape from the compound.","day_of_the_dead":"Theatrical release poster","language":"English","Release and reception":"Subsequent to its theatrical release, the film has grossed over 30 million dollars worldwide.[8] Day of the Dead would earn most of its gross revenue when the film was released internationally on VHS format, and later DVD and Blu-ray. This is in contrast to the film's poor box-office reception when it was released in cinemas.[9]Based on 34 reviews collected retrospectively by Rotten Tomatoes, Day of the Dead had a high approval rating, with 28 critics rating it positive and only 6 rating it negative. As of December 2013 it has received an 82 percent approval rating.[10] That rating is the lowest of the initial 3 films in Romero's Dead series[11][12] with Night of the Living Dead having a 96 percent approval rating and Dawn of the Dead with a 92 percent approval rating.[11][12]Day of the Dead was given a limited release on July 3, 1985 and a wide release on July 19, 1985.[13] It opened to mixed reviews, with some critics complaining that the film was too dark, depressing, and slow. Roger Ebert, who reacted favorably to other films of Romero's Dead Series,[14][15][16] gave Day of the Dead one and a half stars.[17] BBC reviewer Almar Haflidason stated \"It benefits from a far larger budget than its predecessors, but suffers from a story as malnourished as the zombies that are chewing it up,\" Haflidason would go on to give the film three out of five stars.[18] As noted by the New York Times reviewer Janet Maslin \"Yes, there are enough spilled guts and severed limbs to satisfy the bloodthirstiest fan. But these moments tend to be clustered together, and a lot of the film is devoted to windy argument.\"[19] Allmovie reviewer Keith Phipps stated that: \"The last, to date at least, of George Romero's living dead films is in many respects the least interesting, although it's not for a lack of ambition.\"[20] Variety wrote that the film was the most unsatisfying of the original three films and that \"The acting here is generally unimpressive and in the case of Sarah's romantic partner, Miguel (Antone DiLeo Jr), unintentionally risible.\"[21]Day of the Dead would peak at 23 on the Billboard chart Top VHS Sales in 1986 a year after its initial release.[22]The film grossed $5.8 million domestically.[4] It fared much better internationally, grossing $28.2 million outside of the United States.[8] Day of the Dead's total gross is a little over $34 million.[8] The film is also noted for its special effects work, notably Tom Savini's make-up, he was honored with his second Saturn Award in 1985 for Best Make-Up, the first time being with Dawn of the Dead in 1980.[23] Romero himself cites Day of the Dead as his personal favorite of his original trilogy of zombie films.[24] On May 9, 2012, the film headlined the 12 Hour Film Festival Hudson Horror Show V.[25]The film was released on DVD on November 24, 1998 in the United States and on March 5, 2001 in the United Kingdom.[18][26] Both the theatrical and an unrated director's cut were released as a special editions containing identical bonus features, the DVD was released in the United Kingdom in a region 2 DVD.[18] The Blu-ray version of Day of the Dead was released October 2, 2007.[27] This edition includes many special features, including two audio commentary tracks with writer-director George A. Romero, Tom Savini, production designer Cletus Anderson, and lead actress Lori Cardille.[27] There is also a second commentary with fellow filmmaker and self-proclaimed Romero fan, Roger Avary.[27] It also includes two documentaries, the first one is entitled The Many Days of 'Day of the Dead', which focuses on the original script and the budget, it also included information about shooting in the Gateway Commerce Center.[27] What is also mentioned is the casting details. The second documentary entitled Day of the Dead: Behind the Scenes, focuses mostly on make-up effects.[27] On March 29, 2010 Arrow Video released a 25th Anniversary Edition on Blu-ray exclusive to the UK.[28]Shout Factory! released the film under its Scream Factory label on September 17, 2013. The release is Collector's Edition Blu-ray/DVD Combo Pack with all-new artwork and special features.Near the end of Resident Evil, the protagonist Alice walks outside of her quarantine into a ravaged city street jammed with traffic. The camera pans past a newspaper blowing in the wind stating \"The Dead Walk!\", a direct homage to George Romero's work on Day of the Dead. Another homage is one episode of Stroker & Hoop featured the characters battling zombies using guns made by Double-Wide. They turn out to fire only sunlight, which he claims is because of zombies' vulnerability to sunlight, hinted at by the film being called Night of the Dead and not Day of the Dead. Coroner Rick yells at him \"That was the sequel!\"The song \"M1 A1\", from the self-titled 2001 Gorillaz album samples the pulsing synthesizers and cries of \"Hello! Is anyone there?\" from the opening of the film.[29] The song \"Hip Albatross\", also by Gorillaz, features a clip of Terry Alexander's dialogue.[30] Furthermore, the artwork for the song \"November has Come\" off of the Gorillaz' 2005 album Demon Days has a picture of a calendar pinned to a brick wall set to the month of October with all the dates marked off in red Xs (reminiscent of the opening scene in Day of the Dead).[29]The song \"Battlefield\", from the This Is My Battlefield 2004 Panzer AG album samples Captain Rhodes asking Sarah in reference to Miguel's zombie bite: \"You think he wants to walk around after he's dead? You think he wants to be one of these things?\"The band Through the Eyes of the Dead sampled a clip at the beginning of the song \"Between the Gardens that Bathe in Blood\", released on the Scars of Ages EP.The Ministry song \"Burning Inside\" (from the album The Mind Is a Terrible Thing To Taste) features an audio sample of the military station's warning horn and a few notes of composer John Harrison's synthesized score.The song \"Confessions of a Knife (theme part 2),\" from the 1990 album Confessions of a Knife... by My Life With The Thrill Kill Kult samples dialogue between Sarah and Captain Rhodes: Captain Rhodes: \"I'll have you shot.\" Sarah: \"Are you out of your mind?\" Captain Rhodes: \"No, ma'am. Are you?\" Along with dialogue from private Steele and laughter from private Rickles that repeats later throughout the song. Steele: \"Bang! You're dead!\" followed by Rickles' laughter.The song \"The Only Good God Is a Dead God,\" from the 1992 album Psychological Warfare Technology Systems by Terror Against Terror, samples Captain Rhodes' final screams \"Choke on them... choke on them,\" with the sounds of the zombies eating him.American punk band the Misfits recorded a song about the film entitled \"Day of the Dead\" for their 1997 album American Psycho.Bub the Zombie makes a cameo appearance in The Walking Dead season 4 episode \"Us\", as one of the walkers encountered by the characters Glenn and Tara in a railroad tunnel, an homage to not only the character but also to the underground setting of \"Day of the Dead\". In the same season, a zombie rolls out of bed and has its guts fall out, resembling a scene from the movie.Seattle-based musical duo Little Black Bottles composed \"Letter to Miguel\", a tribute song to character Miguel Salazar, for their album Let Them Eat Red Velvet Cake.","box_office":"$34 million[1]","cinematography":"Michael Gornick","production_company":"Dead Films Inc. Laurel Entertainment Inc. Laurel-Day Inc.","directed_by":"George A. Romero","Soundtrack":"The soundtrack was released on LP and cassette in the same year as the film (1985) by Saturn Records; it contained 6 tracks, all of which was composed and performed by John Harrison.[31] The vocals came from Sputzy Sparacino who was the lead singer of Modern Man and Gospel Singer, Delilah on the tracks \"If Tomorrow Comes\" and \"The World Inside Your Eyes\".[31] The album was re-issued in 2002 by Numenorean Records as a limited edition CD. The new edition was limited to 3000 copies and contained the original album plus five additional tracks from the music and effects reel (the only surviving recording of the film score). It also included a 12-page booklet with information from Harrison and Romero regarding the score.[31]","release_dates":"July 19, 1985 (1985-07-19)|||||","Production":"Romero originally intended the film to be \"the Gone with the Wind of zombie films\".[4] Following budget disputes and the artistic need to release the film unrated, the budget of the film was cut in half, dropping from $7 million to a scant $3.5 million.[4] This forced Romero to scale back his story, rewriting the script and adjusting his original vision to fit the smaller budget.A total of five scripts were written as Romero wrestled with the film's concepts and the budgetary constraints. The first draft was over 200 pages, which he later condensed to 122 pages. This is the true original script, and to date copies of it have not come to light. This version was likely rejected because UFDC felt it was too expensive for them to produce even with an R rating. Romero subsequently scaled down the scope of this script into a 165-page draft (often erroneously referred to as the original version), then condensed it again to a 104-page draft labeled the 'second version, second draft' in an unsuccessful final attempt to get the story within budget parameters. When this failed, he drastically altered the original story concept and ultimately produced a shooting draft that numbered only 88 pages.Filming took place in the fall of 1984 at locations in Pennsylvania and Florida. All above-ground scenes were filmed at several locations around Florida, where Romero was living at the time. The opening scene was filmed in Fort Myers, Florida.[5] The fenced in compound with the helicopter landing pad was shot at a location called Bowman's Beach Helistop in Sanibel. Underground scenes were filmed in a former mine shaft located near Wampum, Pennsylvania, converted into a long-term storage facility for important documents. Though the mine maintained a constant temperature of about 50 degrees Fahrenheit, its high humidity played havoc with the crew's equipment and props. Mechanical and electrical failures were a constant problem throughout filming, and caused several of special effects leader Tom Savini's props to fail during the filming. Despite these failures, Savini was nominated and won the 1985 Saturn Award for best makeup effects. The remote location also complicated the transportation of crew members and equipment. Cast and crew would often sleep in the mine overnight to avoid the time-consuming travel to and from the shooting location. \"Zombie\" extras were recruited from among the citizens of Pittsburgh, with preference given to those who had worked on previous Romero films. Extras were paid $1.00 for their services, and given a hat that read \"I was a Zombie in Day of the Dead\".The film was given a very limited release.[4] This is chronicled in the documentary \"The Many Days of Day of the Dead\" on the two-disc Anchor Bay special edition DVD of the film.[4] Some of the original concepts and characters remain, but the film differs greatly from Romero's original script,[6] as stated by actress Lori Cardille:He could've made me this sexy little twit bouncing around with a gun:- much more the sexual element. But he made her intelligent and strong. In fact, whenever I would try and make her a little more emotional, he would not allow me to do that.[4]Joseph Pilato was cast as Rhodes, the film's antagonist. As stated by Pilato \"He pretty much just gave it to me. I don't know if he auditioned other people, but it was very quick. I came in and it was like, \"You got it!.\"[7] Pilato had acted in two prior films directed by Romero, the first being Pilato's debut Dawn of the Dead and the second being Knightriders, in between those films he played his first lead role in a film entitled Effects.[7] In an interview Pilato was asked if Romero \"had him in mind\", Pilato stated that one of the reasons why he got the role was because of the budget being scaled down from 7 to 3.5 million.[7]","produced_by":"Richard P. Rubinstein","starring":"Lori Cardille|Terry Alexander|Joe Pilato|Richard Liberty|","running_time":"100 minutes","Sequel and remakes":"A half prequel, half sequel was released in 2005, entitled Day of the Dead 2: Contagium. Although it is, by definition, an official sequel as Taurus Entertainment Company holds the rights to the original film, no one from the original Day of the Dead had any involvement in the film.[32]A loose remake of the film, Day of the Dead, was released straight to DVD on April 8, 2008.[33] Little of the original plot exists, with only a few basic elements remaining; notably the underground army base near the end of the movie, and some of the characters' names.[34][34] This marks the second time that Ving Rhames makes an appearance in a remake of a George A. Romero zombie film, following Dawn of the Dead.On July 10, 2013 it was announced that there would be another remake of Day of the Dead. Christa Campbell and Lati Grobman, two of the producers behind Texas Chainsaw 3D have obtained the rights. Campbell, who had a small role in the first remake said \"We want to keep it as close to the Romero version as possible. To make sure that his fans are happy. These are not going to be zombies climbing walls and doing back flips like in World War Z.\" Campbell and Grobman are currently holding meetings with possible writers to figure out the best way to adapt the story.[35] As of 2016, this proposed remake has not come into fruition.In 2014, Sherman Howard's zombie character Bub appeared in a cameo in the fifteenth episode of Season 4 of the AMC series The Walking Dead.[36]","music_by":"John Harrison","edited_by":"Pasquale Buba","written_by":"George A. Romero","budget":"$3.5 million[1]","Comic":"Stef Hutchinson wrote the 24-page comic Day of the Dead: Desertion, which was exclusively released to celebrate the movie's 25th anniversary and shows the origins of Bub, before becoming a Zombie.[37]"}