{"based_on":"Robinson Crusoe  by Daniel Defoe","country":"United Kingdom","distributed_by":"Eagle Pictures","Critical response":"Reviews for the film were mixed. Roger Ebert of the Chicago Sun-Times gave the film three and a half out of four stars, saying \"It is a big, bold production, with the width of vision that sometimes develops when the director has a background in cinematography. Caleb Deschanel, who made it, needs few spoken words to tell his story, and probably could have done with less.\"[2] Film4 said that although \"the film is stronger on visuals than actual substance\" it was \"still a brave interpretation of an oft-told tale, with Quinn as a convincingly unpleasant Crusoe.\"[3] Rita Kempley of The Washington Post gave the film a negative review saying \"Crusoe makes a pretty, fairly tame voyage from an antiquated, salty yarn to a modern-day repudiation of slavery. It's lost its rhythms along the way, as well as its personality.\"[4] The New Yorker's Pauline Kael said \"[Deschanel] has an instinct for image magic, his emotionality and his feeling for atmosphere can carry a viewer along. Aidan Quinn's Crusoe is a hippie Christ figure - a young man finding the way to be gentle. He's the right actor for Deschanel's conception. The Robinson Crusoe story has been reimagined so that it's not a wilderness test of survival - it's a stripped down search for values.\"[5]","screenplay_by":"Walon Green Christopher Logue","Plot":"Tidewater, Virginia 1808. The story begins at sea with the main protagonist, Crusoe (Aidan Quinn), en route to Africa to retrieve slaves. His ship runs into a powerful storm, and the entire crew perishes except for Crusoe. He eventually makes his way to a tropical island, where he is alone and stranded until he discovers that a dog and a small flock of geese have also survived. He befriends the dog, and gains a close ally. He initially encounters many challenges, but eventually manages to make himself at ease on the island. Later he finds a rifle inside the shipwreck, and, weapon in hand and dog by his side, begins exploring the island. After spending more time on the island, Crusoe stumbles upon a group of tribesmen who are indigenous to the area but not the island. He finds, to his horror, that they are cannibals.Following this discovery, Crusoe begins chopping down trees in an attempt to build a boat and escape. His plans do not immediately succeed, and he fashions a cavern into a homestead. Subsequently his dog gets sick, and his attempts to cure him fail. Crusoe finds him dead the following morning. This starts a period of intense loneliness for Crusoe. Through his grief he fails to notice several small boats approaching the island. The natives have come to this island to perform the ritual cremation of their chief along with the sacrifice of three of their fellow tribesmen. The chief lies dead on a great branch armchair, which is set ablaze. At the same moment, the throats of two of the tribesmen are cut, but just before the last killing, Crusoe shoots his rifle, distracting the would-be assassins. The man who was to be sacrificed (Hepburn Graham) escapes; as does Crusoe. The two meet by chance in the forest and Crusoe, fearing for his life, threatens the man with his gun. The tribesman, however, doesn't perceive this as a threat. They both return to the beach thinking the cannibalistic tribesmen have left in their boats.From this moment the tribesman, named Lucky, starts to trust Crusoe. Crusoe takes him back to his cave but still doesn't allow Lucky to sleep in the cave with him. He leaves him chained by the ankle outside the cave. The following morning Crusoe finds Lucky gone. He sees smoke coming from the place of the sacrifices and investigates. There he discovers the head of Lucky. Crusoe ends up in the trap of another tribesman (Ade Sapara) who ties him to a tree near his cave. The following day, Crusoe attempts to take revenge on the tribesman. A pursuit follows, and Crusoe tries to shoot the tribesman which surprises him. During their struggle they stumble into some quicksand. The cannibal is able to escape the shifting sands, leaving Crusoe to sink. As Crusoe is about to perish he is granted clemency from the cannibal who decides to help by lowering him a tree branch. Soon, the two attempt to collaborate in the native language of the cannibal. In time, Crusoe is able to understand the intentions of the cannibal. These intentions are to manufacture a small boat to return home with the help of Crusoe. After completing construction on the boat, Crusoe decides to build a second boat. A strange shot however, announces the arrival of another ship, this one full of European sailors. Crusoe runs to high ground and attempts to catch their attention. Little does he know that they have come to the island to capture his new friend.Crusoe has other concerns, however, like returning home. He stows away on their ship, hoping to catch a ride. While hiding onboard he discovers that among the crew is a scientist, Dr. Martin (Michael Higgins), who has studied cannibals and plans to bring his friend back to London. Crusoe, who does not agree with this plan, attempts to free his friend without being seen by the crew. Crusoe eventually escapes the island which helps him to realize that liberty and life are precious.","language":"English","box_office":"$315,421[1]","crusoe":"Film poster","cinematography":"Tomislav Pinter","directed_by":"Caleb Deschanel","release_dates":"1989 (1989)|||||","produced_by":"Andrew Braunsberg","starring":"Aidan Quinn|Adé Sapara|","running_time":"91 minutes","music_by":"Michael Kamen"}