{"country":"India","distributed_by":"Red Chillies Entertainment","Plot":"The movie begins in Goa, where Raj leaves his auto repair shop to confront Mani for stealing a man’s cell phone. Mani tells Raj that he is stealing it for his younger brother, whom he must care for after both of their parents died. While out driving, Veer sees a woman, Ishita, hitchhiking but refuses to pick her up. However, after he stops the car to urinate, she catches up with him, and he agrees to take her where she needs to go, damaging the car in his rush to get there. For penance, Raj forces Veer to work in the shop day and night. Veer’s friend Siddhu provides him with coffee so he can stay awake to fix the car. However, he falls asleep anyway and awakes to find that the car’s sound system has been stolen. Siddhu takes it to a pawn shop to sell it, having stolen the sound system while Veer was asleep.The men of the local gang leader, King, try to sell drugs at a crab shack. Veer beats them up after they threaten Ishita. They then come back later to exact revenge on Veer, but Raj breaks up the fight. Raj’s men find him at the hospital where Veer is staying and tell him they know where to find King’s men. Raj goes to King's hideout, incapacitates the gang members, and burns their drug stash. Raj tells King’s men his gangster name, Kaali. King stops by Raj’s shop the next day to present a deal where Raj will fix all of King’s cars in exchange for protection.The film then flashes back to Bulgaria. Raj is in a car chase with a rival gang, trying to make off with a container of gold, when he accidentally runs over a woman, Meera. When he gets out to help her, the rival gang catches up with him, and he has to leave. Later, Raj runs into Meera again, who works as a sketch artist. He reveals to her that he is a gangster, and that he is the son of Randhir Bakshi, the leader of the gang. Veer attends a boarding school where Raj only comes to visit once a month. Randhir and Raj talk about how Raj was adopted. Raj meets with Meera again, and she asks him to take care of some guys who are troubling her. She also asks him to celebrate her birthday with her the next day. He promises to take care of a job early and then meet her in the evening. The next day, Raj is engaged in a car chase. His car gets blown up and rolls over, trapping him inside. He is confronted by Meera, who he finds out is the daughter of the rival gang’s leader, Malik. She reveals that their entire relationship so far was designed so that Malik’s gang could have a chance to kill him. She holds a gun to his head, but she chooses to spare his life this time. Later, Raj gets a new car and engages in a car chase with Meera, eventually pushing her car to the edge of a cliff. He saves Meera from falling off the cliff, then tells her that the next time he sees her, he will kill her. Despite this warning, she later comes to his home and tells him that she loves him. At first he refuses to listen to her, but then he admits that he loves her, too. They make plans to tell their parents about their relationship.The film quickly flashes back to Goa, where Veer discovers that Siddhu has been putting sleeping pills in Veer’s coffee so that he fell asleep on his shift, allowing Siddhu to steal items from the shop. Veer is upset, but Siddhu explains it is for his girlfriend, Jenny. They agree to help each other secure girlfriends. As a consequence, Veer reveals his feelings to Ishita. Upon finding out about their relationship, Raj wants to meet Ishita’s family. When Raj visits Ishita’s house, he discovers that Meera is Ishita’s older sister.The film then quickly flashes back to Bulgaria, where Malik agrees to meet Randhir, but, secretly, he plans to kill him. The meeting breaks into a shootout, during which Malik shoots Randhir. Randhir then shoots Malik, and both men die. Raj holds Randhir and takes the gun out of his hand. Meera finds Raj and believes that he killed her father, for which she shoots Raj; however, he survives the gunshot. Both Meera and Raj decide to move far away from Bulgaria and start a new life.The film is again in Goa, where Veer and Ishita come up with several plots to bring Meera and Raj together. As a side plot, Mani steals King’s car and brings it to the shop, where Veer discovers drugs in the trunk and decides to burn them. Ishita tells Raj that Meera has not forgotten her first love. King comes to Meera’s house one night, but Raj, as Kaali, shows up and stops them from causing her any harm. King asks Meera later if she knows Kaali, but she refuses to acknowledge their relationship.Meera issues an ultimatum that in order to marry Ishita, Veer must move in with Meera. Meera also tells him that Raj is adopted and not his blood brother. Veer says that he loves Ishita, but he cannot abandon his brother. Raghav, one of Malik’s men, decides to tell Meera that Raj did not kill Malik, but that Malik had shot Randhir, who had shot Malik in return. Upon learning this, Meera tells Veer that he can marry Ishita and stay with Raj.Siddhu and Jenny get married. King shows up at the wedding, having tracked down his stolen car, which is now being used as the bride and groom’s getaway car. King starts to cause a disturbance, but Raj beats him up. King then tries to shoot Raj, but accidentally shoots Meera. The gunshot doesn't turn out to be fatal.","language":"Hindi","Critical reception":"Taran Adarsh from Bollywood Hungama gave the film 4/5 stars, saying, \"On the whole, Dilwale is akin to a mouthwatering meal that satiates the craving of those who relish masalathons, besides being an absolute treat for SRK-Kajol fans. An unadulterated crowd-pleaser, Dilwale delivers what you expect from a Rohit Shetty film: King-sized entertainment. Go for it!\".[29] Komal Nahta in his review of the film said, \"Dilwale is a masala entertainer from the start till the end.\"[30] Rachit Gupta from Filmfare gave it 4/5 stars and added, \"Dilwale is the quintessential popcorn flick. It’s colorful, bright and entertaining. It smartly keeps its play on the SRK-Kajol chemistry (watch out for the brilliant ending). It has fantastic music. Decent laughs too. Definitely worth a dekho.\"[31] Sarita A Tanwar of DNA gave the film 3/5 stars, saying \"Dilwale is flawed, but it's right for those who believe that love does conquer it all, actually.\"[32]Ananya Bhattacharya of India Today also rated the film 3/5 and concluded, \"Dilwale is immensely enjoyable despite an oh-my-god-this-is-so-predictable story. Keep your brains out of the picture, and you have an out-and-out entertainer which fits perfectly in the mould of a guilty pleasure. Go indulge!\"[33] Shubha Shetty-Saha of Mid Day gave the film 3 stars as well and said, \"Watch this for the chemistry between SRK and Kajol which refuses to simmer down even after all these years.\"[34] Meena Iyer from The Times of India gave the film 3/5 stars, criticizing the plot, and stated, \"Dilwale leans heavily on Shah Rukh's mega-stardom, Varun's effervescence, breathtaking locales (Iceland and Bulgaria), orchestrated car chases and over-the-top situations, which have you chuckling.\"[35]NDTV felt that the film's plot \"went in circles\" and that while Kajol was great, the film overall failed to appeal.[36] The Economic Times gave the film 2.5/5 stars and felt that it \"lacked soul and freshness\" and stated that it would only appeal to fans of Khan and Kajol.[37] Rajeev Masand of IBN Live gave the film 2 out of 5 and said, \"The real problem with Dilwale is the sheer artificiality of the enterprise. From the rainbow-hued sets and the touched-up landscapes in the Gerua song, to many moments of comedic and emotional payoff, so much of it just feels fake.\"[38] Namrata Joshi of The Hindu commented, \"With Dilwale, Rohit Shetty goes hopelessly wrong despite much that he had at his disposal, including a power-packed cast and producer\". Joshi also felt that the attempt to repackage Khan and Kajol had backfired.[39] Rohit Vats of Hindustan Times gave the film a 1.5/5 rating and called the plot \"highly predictable\".[40]","box_office":"est. ₹394 crore (US$59 million)[3]","dilwale":"Theatrical release poster","cinematography":"Dudley","directed_by":"Rohit Shetty","Soundtrack":"Dilwale's songs are composed by Pritam and lyrics are written by Amitabh Bhattacharya. Amar Mohile has composed the film score.Dilwale, the film's soundtrack album, was composed by Pritam. A track titled \"Gerua\" was released on November 18, 2015 as the first single prior to the soundtrack album's release.[63][64] The second single to be released was \"Manma Emotion Jaage\".[65] The album features seven tracks, and was released on 4 December 2015.[66] Sony Music India acquired the music rights of the film for a record ₹19 crore (US$2.8 million).[28]The song \"Gerua\" also had different versions. An Arabic version called \"Telagena\" was released on 11 December 2015[67] while a Malay version entitled \"Warna Cinta\" featuring vocals from Aliff Aziz and Kilafairy was released later on 18 December 2015.[68]All lyrics are penned by Amitabh Bhattacharya.","production_companies":"Red Chillies Entertainment Rohit Shetty Productions","release_dates":"18 December 2015 (2015-12-18)|||||","Production":"In January 2015, Rohit Shetty announced a project with Shah Rukh Khan in the lead which would be their second collaboration after the 2013 film Chennai Express. Shetty stated that he would start filming in March 2015.[15][16] Shetty paired actress Kajol with Khan, making it the seventh time they were cast opposite each other. He also signed actor Varun Dhawan who was reportedly playing Khan's brother while actress Kriti Sanon was signed opposite him.[17]Principal photography began on 20 March 2015 with Dhawan in Goa.[18][19] Khan and Kajol first joined the crew for filming in Bulgaria from June 2015.[20] Later that month, the first song from the film was shot on Dhawan and Kriti Sanon, in Bulgaria.[21] The schedule there was wrapped up by late July.[22] In August 2015, a romantic song featuring the lead pair was shot in Iceland.[23] The entire team then left for Hyderabad in early September to shoot what was touted to be the final schedule of filming.[24] However, the work in Hyderabad was completed by late October, and filming officially came to an end with a brief schedule in Goa, the same location where it was started.[25] In December, after the promotions had commenced, another song was shot in haste. It featured all four lead actors and had to be played simultaneously with the end-credits.[26]","Box office":"Dilwale made around ₹150 crore (US$22 million) worldwide in its opening weekend, the third highest of the year.[41]IndiaThe film, releasing alongside Bajirao Mastani, opened number one at the box office, and collected ₹21 crore (US$3.1 million) nett in India on its opening day, the third highest of the year after Prem Ratan Dhan Payo and Bajrangi Bhaijaan.[42] The film showed little drop on its second day, and earned nearly ₹20 crore (US$3.0 million) nett.[43] On its first Sunday, Dilwale took in approximately ₹23 crore (US$3.4 million) nett, bringing the three-day nett to an estimated ₹64 crore (US$9.5 million).[44] Dilwale had a first week of ₹97 crore (US$14 million) nett in the domestic market.[45]The film earned around ₹21 crore (US$3.1 million) nett in its second weekend.[46] It grossed little over ₹31 crore (US$4.6 million) nett in week two, taking its business to ₹127 crore (US$19 million) nett.[47] The film made around ₹11 crore (US$1.6 million) nett more in the third week,[48] and finished with a total of ₹140 crore (US$21 million) nett in India.[49]OverseasDilwale had the highest opening of 2015 abroad and the second highest ever, with a weekend gross of around $8.5 million. The film also set an all-time record opening in the Gulf.[50] In Pakistan, the film earned ₹6.5 crore (US$970,000) in its first three days.[51] The film went on to earn over $13 million overseas in the first week, again the highest of the year.[52]Dilwale grossed another $3.75 million in the second weekend, for an overall $16.75 million in ten days.[53] After two weeks, the film's earnings abroad were more than $20.5 million.[54] The film had grossed around $23.3 million outside India as of 12 January 2016 to become the highest-grossing film starring Shah Rukh Khan in overseas markets.[55]Dilwale had expanded its business abroad to higher than $25 million following release in new markets like Germany, Netherlands and Indonesia.[49][56][57] At the end of its theatrical run in overseas, the film has earned approximately $26.1 million (INR 175.65 crore).[58]","produced_by":"Gauri Khan|Rohit Shetty|","starring":"Shah Rukh Khan|Kajol|Varun Dhawan|Kriti Sanon|","running_time":"154 minutes[1]","music_by":"Songs:|Pritam Chakraborty|Background score:|Amar Mohile|","edited_by":"Bunty Nagi","Release":"Dilwale was released in the United Arab Emirates a day before its worldwide release on 18 December 2015. The film was released in around 3100 screens in India.[27]The satellite rights of the film were sold to Sony Pictures Networks as part of a deal worth ₹220 crore (US$33 million), along with the next two or three Red Chillies Entertainment productions. The valuation of Dilwale alone was approximately ₹60 crore (US$8.9 million).[28]On 14 December 2015, in the United Kingdom, the film received a 12A classification from the British Board of Film Classification for \"moderate violence\". The film's UK distributor chose to remove thirteen seconds in order to obtain this rating (the excised material being scenes involving stronger violence than possible for a 12A rating). An uncut 15-rated version is available.[1]","written_by":"Yunus Sajawal|Dialogue:|Sajid-Farhad|","budget":"₹100 crore (US$15 million)[2]"}