{"country":"United States","distributed_by":"TriStar Pictures","Plot":"San Francisco police officer Frank Conner is in a frantic search for a compatible bone marrow donor for his son, Matt, who has leukemia. In desperation, he breaks into FBI headquarters and finds a perfect match. Unfortunately, it is Peter McCabe, a sociopath who is serving life in prison for several murders. During his time in prison, the brutal, cunning McCabe has attempted escape and killed several guards and fellow prisoners, and must be kept in multiple restraints when out of his isolation cell.At first McCabe shows little interest in helping Conner, but later finds an opportunity to turn the situation to his advantage and devises a plot to escape. Biding his time, McCabe plays chess against a computer, easily defeating the program, and expresses the need for a challenge akin to Garry Kasparov or Deep Blue. Meanwhile, Conner, along with police captain Cassidy and Matt's doctor, Dr. Hawkins, prepare for McCabe to be transferred to the hospital for the transplant.At the hospital, McCabe is given a sedative. With the aid of a counteracting drug he had obtained from a fellow inmate, McCabe slips out of his restraints, attacks the guards and attempts to escape.Conner and a fellow officer corner him, but McCabe holds a scalpel to Hawkins' throat. Conner drops his gun. The other officer gets the drop on him, but Hawkins warns the police that if McCabe dies, his bone marrow becomes useless. Conner stands in the way of the other officer; McCabe takes his gun and shoots the officer.After hearing what happened, Cassidy immediately orders Conner off the case and removed from the scene. Conner breaks free to search the hospital for McCabe on his own.McCabe causes an explosion with propane tanks and runs off. He seizes control of the hospital's adjacent wing, holding guards hostage and ordering a lockdown of the building.Conner and Hawkins make their way to him and convince McCabe to let them inside so the doctor can attend to Matt. As McCabe watches Conner on the security cameras, he realizes that his nemesis is a truly devoted father, and develops a grudging respect for him. (McCabe had earlier related that his own father had abused him.)Conner intervenes when McCabe is about to ambush Cassidy and his SWAT team. Cassidy is furious that Conner continues to aid an escaped convict and asks, \"How many people have to die tonight so that son of yours can live?\" McCabe is also angry at Conner for having foiled his plan, and so kidnaps Matt and descends to the sublevels of the building.Matt tries to wound McCabe to give his father a better chance; impressed, McCabe spares Matt and leaves him at the hospital for Conner to find. McCabe then escapes into San Francisco, where he steals a car.Conner chases McCabe to a bridge, still needing him captured alive. Cassidy and his men arrive in a helicopter and a sniper opens fire. Conner again shields McCabe and is wounded in the arm. McCabe attempts to flee, but Conner is determined not to let him go. Conner wounds McCabe, sending him off the bridge and into the bay. Conner then dives in and saves him.Back in the hospital, a wounded McCabe agrees to the transplant, which saves Matt's life. Even though his career is clearly over, Conner is overjoyed that his son will live.McCabe is informed by a guard that the surgery went well. As the bed reclines upwards and McCabe looks at the guard menacingly, the guard suddenly realizes that his gun is gone. McCabe holds it over the guard and asks, \"What kind of car do you have?\".","language":"English","Reception":"As of 2014, the film has received a 17% \"rotten\" rating on Rotten Tomatoes.[2]Lisa Schwarzbaum of Entertainment Weekly wrote, \"By the time Desperate Measures degenerates into an old-fashioned car chase, you may wish you were watching General Hospital. Although I suspect there is plenty of bone-marrow-and leukemia-related preposterousness here, my limited medical education precludes me from informed eyeball rolling. I may not be a doctor, but I know a movie with iron-poor blood when I see one.\"[3] Online film critic James Berardinelli stated, \"when you consider how many contrivances the characters have to endure to reach the ending, you may think that the title has more to do with the film makers' approach than with anything that happens on screen.\"[4]","box_office":"$13,806,137","cinematography":"Luciano Tovoli","production_company":"Mandalay Entertainment","directed_by":"Barbet Schroeder","Awards":"ALMA Awards (1999)","release_dates":"January 30, 1998 (1998-01-30)|||||","produced_by":"Gary Foster Barbet Schroeder Lee Rich Susan Hoffman","starring":"Michael Keaton Andy García Brian Cox Marcia Gay Harden Erik King Efrain Figueroa Joseph Cross","running_time":"100 minutes","desperate_measures":"Theatrical release poster","In other media":"This film was remade in Hindi by the title Jung starring Sanjay Dutt.","music_by":"Trevor Jones","edited_by":"Lee Percy","written_by":"David Klass (based on his novel)","budget":"$50 million"}