{"based_on":"Closer  by Patrick Marber","country":"United States","distributed_by":"Columbia Pictures","Plot":"In the opening scene, twenty-four-year-old Alice Ayres and Dan Woolf see each other for the first time from opposite sides of a street as they are walking toward each other among many other rush hour pedestrians. Alice is a young American stripper who just arrived in London, and Dan is an unsuccessful British author who is on his way to work where he writes obituaries for a newspaper. Alice looks in the wrong direction as she crosses the street and is hit by a taxi cab right in front of Dan's eyes. After he rushes to her side she smiles to him and says, \"Hello, stranger.\" He takes her to the hospital where Alice is treated and released. Afterward, on the way to his office, they stop by Postman's Park, the same park that he and his father visited after his mother's death. Pausing in front of the office before he leaves her and goes to work, he reminds her that traffic in England tends to come on from the right, and on impulse, he asks her for her name. They soon become lovers.A year later, though the two are in a relationship, Dan is straying. He has written a novel based on Alice's life and while being photographed to publicize it, he flirts with the American photographer Anna Cameron. Anna shares a kiss with Dan before finding out that Dan and Alice are in a relationship. Alice arrives and borrows Anna's bathroom, leaving Anna and Dan alone again. Dan takes the chance to try to persuade Anna into having an affair with him but is cut short by Alice's return. Alice asks Anna if she can have her portrait taken as well. Anna agrees and Alice asks Dan to leave them alone during the photo shoot. While being photographed, she reveals to Anna that she overheard them, and she is photographed while still weeping over it. Alice does not reveal what she overheard to Dan, even as he spends a year stalking Anna.Another year later, Dan enters a cybersex chat room and randomly meets Larry Gray, a British dermatologist. With Anna still on his mind, Dan pretends to be her, and using the pretense that they will be having sex, Dan convinces Larry to meet at the aquarium (where Anna told Dan she often went). Larry goes to the rendezvous and has his rude awakening there. Anna tells Larry that a man who had pursued her, Dan, was most likely to blame for the setup. Soon, Anna and Larry become a couple and they refer to Dan as \"Cupid\" from then on.Four months later, at Anna's photo exhibition,[3] Larry meets Alice, whom he recognizes from the tearful photograph that is one of many being exhibited. Larry knows that Alice and Dan are a couple, from talking to Anna. Meanwhile, Dan convinces Anna to become involved with him. They begin cheating on their respective lovers for a year, even though Anna and Larry become married halfway through the year. Eventually Anna and Dan each confess the affair to their respective partners, leaving their relationships for one another.Alice goes back to being a stripper, heartbroken by her loss. One day, Larry runs into her accidentally at the strip club and he (heart-broken himself) is convinced that she is the girl he met before. He asks her if her name is Alice, but no matter how much money he gives her, she keeps telling him her name is \"Jane Jones.\" He asks her to have a one-night stand with him but she refuses. The line of questioning becomes pornographic, albeit without any explicit nudity.Eventually, Larry convinces Anna to see him one last time; she agrees to sleep with him so that he will sign the divorce papers and leave her alone. Dan guesses and Anna confesses it to Dan, who takes it badly. Anna returns to Larry. Distraught, Dan confronts Larry to try to get Anna back. Instead, Larry tells him Alice's whereabouts, and suggests that he go back to her. Suddenly, however, out of a sheer malicious impulse, he also tells him that he had a one-night stand with her.Alice takes Dan back. When Dan asks her whether she had a one-night stand with Larry, she initially denies it. But when he insists on the truth, she suddenly tells him that she doesn't love him anymore and goes on to say that she did sleep with Larry. Dan then reveals that Larry had already told him about the one-night stand but that he's already forgiven her. She insists that it's over and tells him to leave. The argument culminates in Dan slapping Alice.In the end, Alice returns to New York. Passing through the immigration checkpoint on her way back into the United States, it is revealed through a shot of her passport that her real name is indeed Jane Rachel Jones and that she had lied about her name for the duration of her four-year relationship with Dan.Back in London, Dan returns to Postman's Park, and to his surprise, notices the name \"Alice Ayres\" on a memorial that is dedicated to a young woman, \"who by intrepid conduct\", and at the cost of her young life, rescued three children from a fire. The final scene shows Alice/Jane walking on Broadway towards West 47th Street with male passers-by staring at her beauty. This completes the visual symmetry within the film as it echoes the opening scene where Alice/Jane and Dan are staring at each other on the sidewalks of London.","language":"English","Reception":"The review summary site Rotten Tomatoes shows 68% positive ratings among 203 reviews.[5] Another review aggregator, Metacritic shows a weighted average score of 65 out of 100, based on 42 reviews.[6] Roger Ebert, writing for the Chicago Sun-Times, said of the people involved with the film, \"[t]hey are all so very articulate, which is refreshing in a time when literate and evocative speech has been devalued in the movies.\"[7] Peter Travers, writing for Rolling Stone, said, \"Mike Nichols' haunting, hypnotic Closer vibrates with eroticism, bruising laughs and dynamite performances from four attractive actors doing decidedly unattractive things.\"[8] Kenneth Turan of the Los Angeles Times wrote, \"[d]espite involved acting and Nichols' impeccable professionalism as a director, the end result is, to quote one of the characters, 'a bunch of sad strangers photographed beautifully'.\"[9] The New York Times' A.O. Scott wrote, \"[u]nlike most movie love stories, Closer does have the virtue of unpredictability. The problem is that, while parts are provocative and forceful, the film as a whole collapses into a welter of misplaced intensity.\"[10]The film was released on December 3, 2004 in North America. Closer opened in 476 theaters, but the theater count was increased after the film was released. The film was domestically a moderate financial success, grossing $33,987,757.[1] Huge success followed in the international market, where the film grossed an additional $81,517,270, accounting for over 70% of its worldwide gross, which turned to $115,505,027. The film was produced on a budget of US$27 million.[1]The film won the following awards:The film was nominated for the following awards:","box_office":"$115,505,027","closer":"Theatrical release poster","cinematography":"Stephen Goldblatt","directed_by":"Mike Nichols","Home media":"Closer was released on DVD in 2005 and Blu-ray on May 22, 2007.","release_dates":"December 3, 2004 (2004-12-03)|||||","Production":"Closer was filmed at Elstree Film and Television Studios and on location in London.The main theme of the film follows Mozart's opera Così fan tutte, with references to that opera in both the plot and the soundtrack.[4] One of the pivotal scenes develops to the background of the ouverture to Rossini's opera \"La scala di seta\" (\"The Silken Ladder\"). The soundtrack also contains songs from Jem, Damien Rice and Lisa Hannigan, Bebel Gilberto, The Devlins, The Prodigy and The Smiths.The music of Irish folk singer Damien Rice is featured in the film, most notably the song \"The Blower's Daughter,\" whose lyrics drew many parallels with the themes present in the film. The opening notes from Rice's song \"Cold Water\" are also used repeatedly, notably in the memorial park scenes. Rice wrote a song titled \"Closer\" which was intended for use in the film but was not completed in time.[citation needed]","produced_by":"Mike Nichols Cary Brokaw John Calley","starring":"Julia Roberts Jude Law Natalie Portman Clive Owen","running_time":"104 minutes","music_by":"Suzana Peric","edited_by":"John Bloom Antonia Van Drimmelen","written_by":"Patrick Marber","budget":"$27 million[1]"}