{"country":"United States","distributed_by":"Universal Pictures (North America) Buena Vista International (International)","screenplay_by":"Steve Koren|Mark O'Keefe|Steve Oedekerk|","story_by":"Steve Koren|Mark O'Keefe|","Plot":"Bruce Nolan (Jim Carrey) is a television field reporter for Eyewitness News at WKBW-TV in Buffalo, New York, but desires to be the news anchorman. He is in a healthy relationship with his girlfriend Grace Connelly (Jennifer Aniston), but also has a mild crush on his co-worker, Susan Ortega (Catherine Bell), who barely seems to notice him. Bruce, however, suffers from constant bad luck, and reaches breaking point when he is passed over for promotion by his rival, Evan Baxter (Steve Carell), who then steals dialogue from Bruce's segment while accepting the promotion on-air. Furious, Bruce aggressively and profanely criticizes the station during his first live report, and is promptly fired. Following a series of other misfortunes, Bruce takes out his frustration on God (Morgan Freeman), blaming Him and claiming that He is \"the one who should be fired.\"Bruce later receives a message on his pager directing him to an empty warehouse, where he meets God. God offers to give Bruce His powers, to prove that He is doing His job correctly. God gives Bruce two rules that he must follow: firstly, Bruce cannot tell anyone else that he has God's powers; and secondly, Bruce cannot use the powers to interfere with free will. Bruce ignores God and is initially jubilant with the powers, using them for personal gain such as potty-training his dog, exposing a woman by blowing up her dress, transforming his beat-up car into a Saleen S7, and sexually impressing Grace. Bruce also finds ways of using the powers to cause miraculous events to occur at otherwise mundane events that he covers, such as discovering Jimmy Hoffa's body or causing a meteor to harmlessly land near a cook-off, earning him his job back. Bruce then uses his powers to cause Evan to humiliate himself on-air, causing Evan to be fired in favor of Bruce as the new anchor.After taking Grace to a fancy dinner and telling her he made anchor (angering her, as she thought he was going to propose), Bruce begins to hear voices in his head. He re-encounters God, who confronts Bruce about his selfish use of his powers. He explains that the voices are prayers to God, and that Bruce must deal with them. Bruce creates a computerized system to receive the prayers and respond, but finds that the influx is far too great for him to handle — even though God had stated that he is only receiving prayers from the Buffalo area — and sets the program to automatically answer Yes to every prayer.During a party to celebrate Bruce's promotion, Susan seduces and kisses him. When Grace arrives and sees this, she storms out; Bruce follows her, but she is heartbroken and will not listen to him. He tries to use his powers to convince Grace to stay, but cannot influence her free will. As Bruce looks around, he realizes that automatically granting everyone's prayers has plunged the city into chaos. Bruce returns to God, who explains that despite how chaotic things seem, there is always a way to make things right, and that Bruce must figure out a way to solve it himself. Bruce then begins to solve his problems in life practically, such as helping a man whose car has broken down, training his dog normally, and allowing Evan to have his job back.Bruce returns to his computer system, having briefly unplugged it, and goes about answering prayers manually as best he can. As he reads through them, he finds a prayer from Grace, wishing for Bruce's success and well-being. As he reads it, another prayer from Grace arrives, this one wishing not to be in love with Bruce anymore. A despondent Bruce walks alone on a highway, asking God to take back His powers and letting his fate be in His hands. Bruce is suddenly struck by a truck and regains consciousness in a white void. God appears and asks Bruce what he really wants; Bruce admits that he only wants to make sure Grace finds a man that would make her happy. God agrees and Bruce finds himself in the hospital, shortly after being revived — near miraculously — by the doctors. Grace arrives and the two rekindle their relationship, later becoming engaged. After his recovery, Bruce returns to his field reporting but takes more pleasure in the simple stories. Bruce and Grace announce their engagement on live TV. The film ends with the doomsayer Bruce previously ran into on various occasions finally revealing himself to be God.","language":"English","Reception":"Bruce Almighty received mixed reviews from critics. The film has a score of 48% on Rotten Tomatoes, based on 184 reviews, with an average rating of 5.6/10. The site's critical consensus reads, \"Carrey is hilarious in the slapstick scenes, but Bruce Almighty gets bogged down in treacle\".[4] The film also has a score of 46 out of 100 on Metacritic, based on 35 critics, indicating \"mixed or average reviews\".[5]The film was banned in Egypt due to pressure from Muslims who objected to the portrayal of God as a visually ordinary man. Bans in both Malaysia and Egypt were eventually lifted after the censorship boards in respective countries gave it the highest rating (18-PL in case of Malaysia).[6][7]Since God contacts Bruce using an actual phone number rather than a number in the standard fictional 555 telephone exchange, several people and groups sharing this number subsequently received hundreds of phone calls from people wanting to talk to God including a church in North Carolina and a Pastor in Northern Wisconsin. The producers noted that the number (776-2323) was not in use in the area code (716, which was never specified on screen) in the film's story but did not check anywhere else. The home video and television versions changed it to the fictional 555-0123.[8][9]A spin-off/sequel, entitled Evan Almighty, was released on June 22, 2007, with Steve Carell reprising his role as Evan Baxter and Morgan Freeman returning to his role as God. Although Shadyac returned to direct the sequel, neither Carrey nor Aniston were involved with the film, though Carrey's character, Bruce, is mentioned in the film's teaser trailer. The sequel was not as well received as its predecessor, with a 23% rating on Rotten Tomatoes and a 37/100 score on Metacritic.","box_office":"$484.6 million[2]","bruce_almighty":"Theatrical release poster","cinematography":"Dean Semler","production_company":"Spyglass Entertainment Shady Acres Pit Bull","directed_by":"Tom Shadyac","Soundtrack":"The soundtrack was released on June 3, 2003 by Varèse Sarabande. Tracks 8-13 are from the score composed by John Debney, performed by the Hollywood Studio Symphony (conducted by Pete Anthony) with Brad Dechter and Sandy De Crescent.","release_dates":"May 23, 2003 (2003-05-23)|||||","produced_by":"Tom Shadyac|Jim Carrey|James D. Brubaker|Michael Bostick|Steve Koren|Mark O'Keefe|","starring":"Jim Carrey|Morgan Freeman|Jennifer Aniston|Philip Baker Hall|","running_time":"101 minutes[1]","music_by":"John Debney","edited_by":"Scott Hill","budget":"$81 million[2]"}