{"country":"United Kingdom","distributed_by":"Hemdale Film Corporation","Plot summary":"Following a crash of a nuclear bomber at an American Air Force base in the English countryside, Dennis Markham (Ian Bannen), a prominent Member of Parliament and opponent of the American nuclear presence in the United Kingdom, is reported by a London paper to have been seen leaving a woman's home. When the woman is found to also be familiar with a dignitary from East Germany, Markham's loyalty to his country is questioned. He is hounded by the media and is forced to resign.The author of the newspaper exposé, Nick Mullen (Gabriel Byrne), continues his work with colleague Vernon Bayliss (Denholm Elliott) who suspects that Markham is being framed for his views. When Bayliss dies from a mysterious 'heart attack', Mullen suspects something deeper at work and finds evidence of a cover-up concerning a near-nuclear accident and a secret US Air Force base. With the help of Markham's secretary, Nina Beckman (Greta Scacchi), Mullen continues to investigate the affair despite the attempts of the British Government to stop him. In the end, Mullen and Beckman are seemingly killed in an explosion, but Mullen's story about the cover-up is published.","language":"English","Reception":"Halliwell's Film Guide described it as an \"efficient political melodrama, basically too old-fashioned to start a cult.\"[2] Denholm Elliott's performance has been singled out for particular praise. Roger Ebert wrote: \"The acting is strong throughout, but Elliott is especially effective. What is it about this actor, who has been in so many different kinds of movies and seems to make each role special? Here he is needed to suggest integrity and scruples, and does it almost simply by the way he looks...Defense of the Realm ends on a bleak and cynical note - unless you count the somewhat contrived epilogue - and gets there with intelligence and a sharp, bitter edge.\"[3] Radio Times gives the film four stars out of five, claiming: \"The role of the sozzled veteran reporter who for once finds himself involved in a meaningful story is brought wonderfully to life by Denholm Elliott...Gabriel Byrne, as Elliott's ambitious young colleague, is less effective, but the film has plenty of tension and co-star Greta Scacchi proves a worthy accomplice.\"[4]","defence_of_the_realm":"Theatrical release poster","cinematography":"Roger Deakins","directed_by":"David Drury","release_dates":"1 January 1986 (1986-01-01)|||||","produced_by":"Robin Douet Lynda Myles","starring":"Gabriel Byrne|Greta Scacchi|Denholm Elliott|Ian Bannen|Bill Paterson|Fulton Mackay|","running_time":"96 min.","music_by":"Richard Harvey","edited_by":"Michael Bradsell","written_by":"Martin Stellman","budget":"$750,000[1]"}