{"based_on":"Dracula  by Bram Stoker","country":"United States","distributed_by":"Columbia Pictures","Plot summary":"In 1462, Vlad Dracula, a member of the Order of the Dragon, returns from a victory against the Turks to find his wife, Elisabeta, has committed suicide after receiving a false report of his death. Enraged that his wife is now damned for committing suicide, Dracula desecrates his chapel and renounces God, declaring that he will rise from the grave to avenge Elisabeta with all the powers of darkness. In a fit of rage, he stabs the chapel's stone cross with his sword and drinks the blood which pours out of it.In 1897, newly qualified solicitor Jonathan Harker takes the Transylvanian Count Dracula as a client from his colleague R. M. Renfield, who has gone insane. Jonathan travels to Transylvania to arrange Dracula's real estate acquisition in London, including Carfax Abbey. Jonathan meets Dracula, who discovers a picture of Harker's fiancée, Mina and believes that she is the reincarnation of Elisabeta. Dracula leaves Jonathan to be raped and fed upon by his brides and sails to England with boxes of his native soil, taking up residence at Carfax Abbey. His arrival is foretold by the ravings of Renfield, now an inmate in Dr Jack Seward's neighboring insane asylum.In London, Dracula emerges as a wolf-like creature amid a fierce thunderstorm and hypnotically seduces, then rapes and bites Lucy Westenra, with whom Mina is staying while Jonathan is in Transylvania. Lucy's deteriorating health and behavioral changes prompts Lucy's former suitors Quincey Morris and Dr Seward, along with her fiancé, Arthur Holmwood, to summon Dr Abraham Van Helsing, who recognizes Lucy as the victim of a vampire. Dracula, appearing young and handsome during daylight, meets and charms Mina. When Mina receives word from Jonathan, who has escaped the castle and recovered at a convent, she travels to Romania to marry him. In his fury, Dracula transforms Lucy into a vampire. Van Helsing, Holmwood, Seward and Morris kill Lucy out of mercy the following night.After Jonathan and Mina return to London, Jonathan and Van Helsing lead the others to Carfax Abbey, where they destroy the Count's boxes of soil. Dracula enters the asylum, where he kills Renfield for warning Mina of his presence. He visits Mina, who is staying in Seward's quarters while the others hunt Dracula, and confesses that he murdered Lucy and has been terrorizing Mina's friends. A confused and angry Mina admits that she still loves him and remembers her previous life as Elisabeta. At her insistence, Dracula begins transforming her into a vampire. The hunters burst into the bedroom, and Dracula claims Mina as his bride before escaping. As Mina changes, Van Helsing hypnotizes her and learns via her connection with Dracula that he is sailing home in his last remaining box. The hunters depart for Varna to intercept him, but Dracula reads Mina's mind and evades them. The hunters split up; Van Helsing and Mina travel to the Borgo Pass and the castle, while the others try to stop the gypsies transporting the Count.At night, Van Helsing and Mina are approached by Dracula's brides. They frighten Mina at first, but she gives in to their chanting and attempts to seduce Van Helsing. Before Mina can feed on his blood, Van Helsing places a communion wafer upon her forehead, leaving a mark. He surrounds them with a ring of fire to protect them from the brides, then infiltrates the castle and decapitates them the following morning. As sunset approaches, Dracula's carriage arrives at the castle, pursued by the hunters. A fight between the hunters and gypsies ensues. Morris is stabbed in the back during the fight and at sunset Dracula bursts from his coffin. Harker slits his throat while a wounded Morris stabs him in the heart with a Bowie knife. As Dracula staggers, Mina rushes to his defense. Holmwood tries to attack but Van Helsing and Harker allow her to retreat with the Count. Morris dies, surrounded by his friends.In the chapel where he renounced God, Dracula lies dying in an ancient demonic form. They share a kiss as the candles adorning the chapel light up and the cross repairs itself. Dracula turns back to his younger self and asks Mina to give him peace. Mina shoves the knife through his heart and as he finally dies, the mark on her forehead disappears as Dracula's curse is lifted. Tearfully, she decapitates him and gazes up at the fresco of Vlad and Elisabeta ascending to Heaven together, reunited at long last.","screenplay_by":"James V. Hart","bram_stoker's_dracula":"Theatrical release poster","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 79% of 48 surveyed critics gave the film a positive review; the average rating is 6.6/10. The site's consensus is: \"Overblown in the best sense of the word, Francis Ford Coppola's vision of Bram Stoker's Dracula rescues the character from decades of campy interpretations — and features some terrific performances to boot.\"[14] Vincent Canby described the film as having been created with the \"enthusiasm of a precocious film student who has magically acquired a master's command of his craft.\"[15] Richard Corliss said, \"Coppola brings the old spook story alive...Everyone knows that Dracula has a heart; Coppola knows that it is more than an organ to drive a stake into. To the director, the count is a restless spirit who has been condemned for too many years to interment in cruddy movies. This luscious film restores the creature's nobility and gives him peace.\"[16] Alan Jones in the Radio Times said, \"Eerie, romantic and operatic, this exquisitely mounted revamp of the undead legend is a supreme artistic achievement...as the tired count who has overdosed on immortality, Gary Oldman's towering performance holds centre stage and burns itself into the memory.\"[17]Roger Ebert awarded the film 3/4 stars, writing, \"I enjoyed the movie simply for the way it looked and felt. Production designers Dante Ferretti and Thomas Sanders have outdone themselves. The cinematographer, Michael Ballhaus, gets into the spirit so completely he always seems to light with shadows.\" Ebert did, however, voice criticisms over the film's \"narrative confusions and dead ends\".[18] Jonathan Rosenbaum said the film suffered from a \"somewhat dispersed and overcrowded story line\" but that it \"remains fascinating and often affecting thanks to all its visual and conceptual energy.\"[19] Tom Hibbert of Empire was unimpressed. Awarding the film 2/5 stars, he said, \"Has a film ever promised so much yet delivered so little?...all we're left with is an overly long bloated adaptation, instead of what might have been a gothic masterpiece.\"[20] Geoffrey O'Brien of the New York Review of Books also had reservations: \"[T]he romantic make-over of Dracula registers as little more than a marketing device designed to exploit the attractiveness of the movie's youthful cast...[it] rolls on a patina of the 'feel-good' uplift endemic in recent Hollywood movies.\"[21]Empire's Tom Hibbert criticized Keanu Reeves's casting[20] and was not the only critic to consider the resultant performance to be weak. In a career retrospective compiled by Entertainment Weekly, Reeves was described as having been \"out of his depth\" and \"frequently blasted off the screen by Gary Oldman\".[22] Total Film writer Nathan Ditum included Reeves in his 2010 countdown of \"The 29 Worst Movie Miscastings\", describing him as \"a dreary, milky nothing...a black hole of sex and drama\".[23] Josh Winning, also of Total Film, said that Reeves's turn spoiled the motion picture. He mentioned it in a 2011 list of the \"50 Performances That Ruined Movies\", and wrote: \"You can visibly see Keanu attempting not to end every one of his lines with 'dude'. The result? A performance that looks like the young actor's perpetually constipated. Painful for all parties.\"[24] A feature by AskMen, called \"Acting Miscasts That Ruined Movies\", expressed a similar sentiment: \"It's one thing to cast Keanu Reeves as an esteemed British lawyer, but it's quite another to ask him to act alongside Gary Oldman and Anthony Hopkins. The two Oscar nominees ran circles around the poor Canuck, exposing his lack of range, shoddy accent and abysmal instincts for all to see.\"[25]Reeves's attempt at London vernacular has been cited as one of, if not the, worst accents in the history of recorded film.[a] Virgin Media journalist Limara Salt, in listing the \"Top 10 worst movie accents\", wrote: \"Keanu Reeves is consistently terrible at delivering any accent apart from Californian surfer dude but it's his English effort in Dracula that tops the lot. Overly posh and entirely ridiculous, Reeves's performance is as painful as it is hilarious.\"[31] Salt said that Winona Ryder is \"equally rubbish\",[31] an opinion echoed by Glen Levy in Time.[30] In his \"Top 10 Worst Fake British Accents\", he said that both actors \"come up short in the accent (and, some might argue, acting) department\", and that their London dialect made for \"a literal horror show\".[30] Conversely, Marc Savlov, writing for the Austin Chronicle, opined that Ryder was more impressive than Reeves and suited the role: \"Ryder, seemingly the perfect choice for Dracula's obscure object of desire, Mina Harker, is better by far than Reeves\".[34]The film opened at #1 at the box office with $30,521,679.[35][36] It dropped off in subsequent weeks, losing 50.8% of its audience after its first weekend in release[37] and exiting the top five after 3 weeks. It became a box office hit, grossing $82,522,790 in North America and becoming the 15th highest grossing film of the year.[38] Outside North America, the film grossed another $133,339,902 for a total worldwide gross of $215,862,692,[3] making it the 9th highest grossing film of the year worldwide.[39]American Film Institute lists","box_office":"$215.9 million[3]","cinematography":"Michael Ballhaus","directed_by":"Francis Ford Coppola","Home video releases and merchandise":"In 1993, a special boxed set was released of Dracula, in the shape of a coffin. The box contained the film on VHS, which included a behind-the-scenes documentary, and the original Dracula novel by Bram Stoker in paperback. Grey, gothic statue heads (as seen on the original film poster) adorned the front cover of the book against a grey stone background.Dracula was first released to DVD in 1999[43] and again as a Superbit DVD in 2001.[44] Neither release contained any extra features. A two-disc \"Collector's Edition\" DVD[45] and Blu-ray[46] was released in 2007. The \"Collector's Edition\" special features include an introduction and audio commentary by director Francis Ford Coppola, deleted and extended scenes, teaser and full-length trailers, and the documentaries \"The Blood Is the Life: The Making of Dracula\", \"The Costumes Are the Sets: The Design of Eiko Ishioka\", \"In Camera: The Naïve Visual Effects of Dracula\", and \"Method and Madness: Visualizing Dracula\".Other merchandising for the film included a board game,[47] a pinball game[48] that was re-released as downloadable content for The Pinball Arcade, and video game adaptations for various platforms. A four-issue comic book adaptation and 100 collectible cards based on the movie were released by the Topps company with art provided by Mike Mignola and a full script provided by Roy Thomas, using dialogue derived almost entirely from the film's script.[49][50]Various action figures and model sets were also produced. In addition to these items, accurate licensed replicas of Dracula's sword and Quincey's bowie knife were available from Factory X.[51] A novelization of the film was published, written by Fred Saberhagen.[52]","Soundtrack":"All music composed by Wojciech Kilar.","production_companies":"American Zoetrope Osiris Films","release_dates":"November 13, 1992 (1992-11-13)|||||","Production":"Ryder initially brought the script (written by James V. Hart) to the attention of Coppola. The director had agreed to meet with her so the two could clear the air after her late withdrawal from The Godfather Part III caused production delays on that film and led her to believe Coppola disliked her.[8] Coppola was attracted to the sensual elements of the screenplay and said that he wanted portions of the picture to resemble an \"erotic dream\".[9] In the months leading up to its release, Hollywood insiders who had seen the movie felt Coppola's film was too odd, violent, and strange to succeed at the box office and dubbed it \"Bonfire of the Vampires\" after the notorious 1990 box office bomb The Bonfire of the Vanities.[9][10] Due to delays and cost overruns on some of Coppola's previous projects such as Apocalypse Now and One from the Heart, Coppola was determined to bring the film in on time and on budget. To accomplish this he filmed on sound stages to avoid potential troubles caused by inclement weather.[8][9]Coppola chose to invest a significant amount of the budget into costumes in order to showcase the actors, whom he considered the \"jewels\" of the feature.[8][9] He had an artist storyboard the entire film in advance to carefully illustrate each planned shot, a process which created around a thousand images.[8] He turned the drawings into a choppy animated film and added music, then spliced in scenes from the French version of Beauty and the Beast that Jean Cocteau directed in 1946 along with paintings by Gustav Klimt and other symbolist artists.[8] He showed the animated film to his designers to give them an idea of the mood and theme he was aiming for. Coppola also asked the set costume designers to simply bring him designs which were \"weird\". \"'Weird' became a code word for 'Let's not do formula,'\" he later recalled. \"'Give me something that either comes from the research or that comes from your own nightmares.' I gave them paintings, and I gave them drawings, and I talked to them about how I thought the imagery could work.\"[8]Coppola brought in acting coach Greta Seacat to coach Frost and Ryder for their erotic scenes as he felt uncomfortable discussing sexuality with the young actresses.[8] However he did ask Oldman to speak seductively off camera to Frost while they were filming a scene in which she writhed alone in her bed in ecstasy. She later classified the things Oldman said to her as \"very unrepeatable\".[8][11]Francis Ford Coppola was insistent that he did not want to use any kind of contemporary special effects techniques such as computer-generated imagery when making the movie, instead wishing to use antiquated effects techniques from the early history of cinema, which he felt would be more appropriate given the film's period setting coincides with the origin of film. He initially hired a standard visual effects team, but when they told him that the things he wanted to achieve were impossible without using modern digital technology, Coppola disagreed and fired them, replacing them with his son Roman Coppola. As a result, all of the visual effects seen in the film were achieved without the use of optical or computer generated effects, but were created using on-set and in-camera methods. For example, any sequences that would have typically required the use of compositing, were instead achieved by either rear projection with actors placed in front of a screen with an image projected behind them, or through multiple exposure by shooting a background slate then rewinding the film though the camera and shooting the foreground slate on the same piece of film, all the while using matting techniques to ensure that only the desired areas of film were exposed. Forced perspectives were often employed to combine miniature effects or matte paintings with full sized elements, or create distorted views of reality, such as holding the camera upside down or at odd angles to create the effect of objects defying the laws of physics.[12]Coppola said of his casting choice: \"We tried to get some kind of matinée idol for the part of Jonathan, because it isn't such a great part. If we all were to go to the airport...Keanu is the one that the girls would just besiege.\"[13]","produced_by":"Francis Ford Coppola|Fred Fuchs|Charles Mulvehill|","starring":"Gary Oldman|Winona Ryder|Anthony Hopkins|Keanu Reeves|","running_time":"128 minutes","music_by":"Wojciech Kilar","edited_by":"Nicholas C. Smith|Glen Scantlebury|Anne Goursaud|","budget":"$40 million[1][2]"}