{"Cast":"The film also contains brief appearances by Ray Santilli, Todd Sherry and Gary Shoefield.","country":"United Kingdom","distributed_by":"Warner Bros. Pictures","Plot":"In 1995, Ray Santilli and his friend Gary Shoefield go to America to find Elvis memorabilia to sell on the market stall Ray runs in London. Harvey, a former US Army cameraman, sells them a silent black and white film of Elvis performing live, but later returns with an intriguing offer. Harvey takes Ray to Miami, Florida to see a film from 1947 showing the autopsy of an alien supposedly killed in a UFO crash in Roswell, New Mexico. Harvey wants $30,000 for the film. Gary and Ray return to England to look for an investor to give them the money.A Hungarian art dealer, Laszlo Voros, who is obsessed with crop circles, gives Ray the $30,000 after Ray convinces Voros that he is telling the truth. Harvey gets the money and gives the film to Ray and Gary. However, in the interim, the film has \"eaten itself\" (i.e. degraded from humidity and heat) and is now completely unwatchable, so the duo decide to film their own \"remake\" of the movie in order to remain on the good side of Voros. Based on Ray's memories of the content of the original, and with the help of some friends, Ray and Gary remake the autopsy film. The film is made using a convincing replica of the dead alien fashioned from a mannequin and meat products from a friend's butcher shop, and filmed on a Bell and Howell spring-wound camera, turning the living room of Gary's sister Doreen's home into a movie set in the process. Once finished, Ray gives a copy of the new film to Voros, who believes it to be real. But when Voros hears that the film is going on air worldwide, he claims that he never gave his permission for Santilli to distribute the film and demands that they stop the international airings. Good fortune intervenes, however, when Voros is knocked down and killed by a green Land Rover (supposedly driven by a CIA agent) whilst standing naked in the middle of a crop circle.Amber Fuentes, a newswoman, eventually tracks down Harvey, who demands from Ray and Gary that they help him keep his anonymity. They produce an interview with a homeless man (who coincidentally had been an actor 40 years previously) posing as Harvey, making the newswoman believe she is onto the wrong man. The now restored original 1947 film is ultimately returned, which Ray had left in the hands of film restoration experts in the hope that the footage could somehow be recovered. Some sections of the film had been repaired and were now watchable. After viewing the film, Ray and Gary bury it, telling each other that they can't go through with it all over again.Ten years later in 2005, Ray and Gary retell this event to a documentary maker named Morgan Banner.","language":"English","Reception":"The film received mainly positive reviews earning an 71% \"fresh\" rating on Rotten Tomatoes.[3]","box_office":"£2,467,565[2]","production_company":"Ealing Studios Fragile Films","directed_by":"Jonny Campbell","Releases":"The film was released as a Region 2 DVD by Warner Home Video on 3 July 2006. In America, the film was released as a Region 1 DVD by Warner Home Video on 21 September 2010.","release_dates":"7 April 2006 (2006-04-07)|||||","produced_by":"William Davies Barnaby Thompson","starring":"Ant McPartlin Declan Donnelly Bill Pullman Harry Dean Stanton Omid Djalili Jimmy Carr","running_time":"95 minutes","music_by":"Murray Gold","written_by":"William Davies","budget":"£5 million[1]"}