{"mandarin":"Zhōng Àn Zǔ","country":"Hong Kong","distributed_by":"Golden Harvest Media Asia","U.S. version":"The version was released on video and DVD on 18 July 2000 in the United States by Miramax was dubbed in English and released in Theaters on 30 August 1996, although unlike most releases, it contained the original musical score. Chan's character had the name \"Eddie\" replaced with \"Jackie\" in the dub.[5] There were four cuts made from the Miramax version:The Dragon Dynasty (DD) version has the original Cantonese track and the cuts made from the Miramax version were restored in the DD version. The DD version was released in 2007 and was about 107 minutes long. It also contains other deleted scenes not seen in either version. After the success of Rumble In The Bronx, Miramax wanted to release Crime Story next in theaters, until Jackie Chan advised against it, Miramax released next Police Story 3: Supercop (1992) Instead.","Plot":"Inspector Eddie Chan of the Organised Crime and Triad Bureau, who suffers from emotional stress after shooting several men in self-defense, is assigned to track down the kidnapped businessman Wong Yat-fei. The search takes him from Hong Kong to Taiwan, causing him to cross paths with some powerful mobsters. What complicates matters is that one of the kidnappers is operating within the police force, determined to stop Chan from succeeding. The relentlessly driven Chan finds himself fighting his personal demons at the same time he battles the seemingly unending wave of crime in the city.","language":"Cantonese","Reception":"Crime Story received positive reviews, which cited the sharp change in tone from Jackie Chan's previous films and his performance in a dramatic role.[2][3][4] The film currently holds a 94% approval rating on Rotten Tomatoes.","cantonese":"Cung5 On3 Zo2","box_office":"HK$27,439,331","cinematography":"Arny Lam Arthur Wong","directed_by":"Kirk Wong Jackie Chan (action) Bruce Law (action)","Home media":"DVD was released in Region 1 in the United States on 18 July 2000, it was distributed by Dimension Films. On 24 March 2003, DVD was released by Hong Kong Legends in the United Kingdom in Region 2.DVD was released in Region 1 in the United States on 7 August 2007, it was distributed by Dragon Dynasty. On 15 January 2013, DVD and Blu-ray was released by Shout! Factory as part of a double feature along with The Protector.[6]","traditional":"重案組","simplified":"重案组","release_dates":"24 June 1993 (1993-06-24)|||||","Production":"According to the book I Am Jackie Chan: My Life in Action, written by Jackie Chan, Chan's legs were crushed after getting caught between two cars while filming the opening action scene.[1]It is set and filmed at Hong Kong and Taiwan in 42 days from 9 July to 20 August 1992. The climactic scene, in which a building is decimated by explosions, was filmed in the deserted Kowloon Walled City, which was scheduled for destruction at that time.Jet Li was originally considered for the role of Inspector Eddie Chan. However, Li turned down the role to do Tai-Chi Master. The role of Inspector Eddie Chan went to Jackie Chan.","Box office":"Crime Story grossed HK$27,457,147 at the Hong Kong box office, slightly lower than the average take for a Jackie Chan film at that time.","produced_by":"Leonard Ho Chua Lam","starring":"Jackie Chan Kent Cheng Law Kar-ying Blackie Ko Ken Lo","running_time":"107 minutes","crime_story":"Film poster","music_by":"Mark Lui James Wong","edited_by":"Peter Cheung","written_by":"Teddy Chan Cheung Chi-sing"}