{"country":"Ireland United Kingdom United States","all_dogs_go_to_heaven":"theatrical release poster","distributed_by":"United Artists (US/Canada) Rank Organisation (UK) Hoyts (Australia)","screenplay_by":"David N. Weiss","story_by":"Don Bluth Ken Cromar Gary Goldman Larry Leker Linda Miller Monica Parker John Pomeroy Guy Shulman David J. Steinberg David N. Weiss","Plot":"In 1939 New Orleans, a roguish German Shepherd named Charlie B. Barkin escapes from a dog pound with the help of his friend, a dachshund named Itchy Itchiford. They return to a casino riverboat on the bayou, formerly run by Charlie and his bulldog partner, Carface Caruthers. Not wanting to share the profits with Charlie, Carface persuades him to leave town with 50% of the venture, all the while intending to take him out for a drink later and murder him. Charlie goes to Heaven, where he meets a whippet angel named Annabelle (named in the sequel), who tells him that a gold watch representing his life has stopped. He steals and winds it, sending him back to life, but is told that if he dies again, he cannot return to Heaven. Charlie reunites with Itchy and they discover that Carface is holding an orphan girl named Anne-Marie hostage (presumably kidnapped from the orphanage) because she has the ability to talk to animals and gain information on animal betting sports beforehand, allowing Carface to rig the odds on the rat races and become rich. Charlie and Itchy rescue her, intending to use her abilities to get revenge on Carface, although Charlie tells her that they plan to give their winnings to the poor and help her find parents.The next day at the race track, Charlie secretly steals a wallet from a couple as they talk to Anne-Marie and become concerned for her ragged appearance. Charlie and Itchy use their winnings to build a successful casino in the junkyard where they live in. Upon discovering that she had been used, Anne-Marie intends to leave them. However, Charlie appeases her by taking pizza and a cake to a family of poor puppies and their foster mother, Flo. While there, Anne-Marie discovers the wallet Charlie had stolen and becomes upset, rushing away where she dreams of living with the couple in its photo. After a nightmare in which he is sent to Hell, meets a hellhound and is attacked by its minions, Charlie awakens to discover that Anne-Marie has gone to return the wallet. The couple, Harold and Kate, whom Anne-Marie met at the race track, welcome her into their home and serve her waffles. While they privately discuss about letting her stay, Charlie arrives outside the house and pretends to wish her good luck at her new home while feigning an illness, and she decides to leave with him. While walking home, Charlie is shot by Carface and his henchman Killer, but the gold watch is unharmed and protects him. He escapes with Anne-Marie and hide in an abandoned building, but the floor breaks and they fall into the underground lair of a massive alligator named King Gator. He and Charlie strike a chord as kindred spirits and he lets them go, but Anne-Marie catches pneumonia.Meanwhile, Carface and his thugs, looking for Anne-Marie, attack Itchy as he runs their new casino. He escapes, but Carface destroys the casino with his scepter. Itchy confronts Charlie, claiming he cares about Anne-Marie more than him and their business. Charlie accidentally and angrily declares that he uses her and will \"dump her in an orphanage\" as soon as they are done with her. Anne-Marie overhears the conversation and sadly runs away, but is soon kidnapped by Carface. Flo sends Itchy to get help from Kate and Harold, and he rouses the dogs of the city by his side, carrying Anne-Marie's stuffed bunny. Charlie returns to the casino, where he is attacked by Carface and his thugs. He fights them off but inadvertently sets an oil fire that immediately engulfs the boat. King Gator arrives after hearing Charlie's cries, saves him from drowning and eats Carface. As the watch falls into the water, Charlie has to choose between saving it or Anne-Marie. He chooses her instead and sets her adrift towards the shore before diving back into the water, but he fails to retrieve the watch that fills with water and causes Charlie to die again. Meanwhile, Killer pushes Anne-Marie to shore, where Harold, Kate and the authorities arrive, as the boat sinks into the water.Sometime later, Harold and Kate have adopted Anne-Marie and Itchy. Charlie returns in his ghost form and sadly apologizes to Anne-Marie about his behavior. The whippet angel appears and tells him that because he gave up his life for Anne-Marie, he has regained his place in Heaven again. Anne-Marie awakens and forgives Charlie as he says goodbye and asks her to look after Itchy. She falls back asleep, and Charlie returns to Heaven. During the credits, Carface, angrily realizing that King Gator killed him, vows revenge and attempts to wind his clock of life, before being chased by Annabelle, while Charlie assures the audience that he will return.","language":"English","Reception":"All Dogs Go to Heaven received many mixed reviews from critics,[7] maintaining a 50% approval rating on Rotten Tomatoes based on 10 reviews,[3] and a 50 out of 100 score from Metacritic.[11] Reviewers often drew unfavorable comparisons to Disney's offering, criticizing the disjointed narrative, the quality of the animation, and the songs by Charlie Strouse and T.J. Kuenster.[12] The film received a \"thumbs down\" from Gene Siskel, and a \"thumbs up\" from Roger Ebert on a 1989 episode of their television program At the Movies. While Siskel found it to be \"surprisingly weak\" given director Don Bluth's previous works, due largely to its \"confusing story\" and \"needlessly violent\" scenes, Ebert was a fan of the movie's \"rubbery and kind of flexible\" animation, stating he felt it was a good film despite not being an \"animated classic.\"[13]Some also found the darker subject material objectionable in a family film,[14][15] featuring as it does depictions of death, violence, drinking, smoking, gambling, murder, demons and images of Hell. But other reviews were mostly positive, with critics praising the film's emotional qualities, humor and vibrant color palette.[16][17] Roger Ebert, who was unimpressed with Bluth's previous film An American Tail, gave it three out of four stars, remarking that the animation \"permits such a voluptuous use of color that the movie is an invigorating bath for the eyes,\" and that although he preferred The Little Mermaid, which opened on the same day, he still found Dogs to be \"bright and inventive.\"[16] More recent reviews of the film have generally been less harsh, with Box Office Mojo awarding it a B- rating. However, film critic Leonard Maltin gave it one-and-a-half out of four stars, due to \"unappealing characters, confusing storytelling, and forgettable songs.\"[18]Dissatisfied with the terms imposed by Universal Studios, which had distributed their previous two films, the studio found an alternative distributor in United Artists. Somewhat unusually, production investors Goldcrest Films covered the cost of the release prints and the promotional campaign, in return for a greatly reduced distribution fee from UA. This was similar to the arrangement with United Artists when they distributed Bluth's first feature film, The Secret of NIMH. Goldcrest Films invested $15 million in printing and promoting the film. Due to contractual issues, very little tie-in merchandise accompanied the film's theatrical release;[7] a computer game adaptation for the Commodore Amiga's DOS system (with a free software package) was released, and restaurant chain Wendy's offered toys with their Kids' Meals or regular fries.[19]The film opened in North America on November 17, 1989, the same day as Walt Disney Pictures' full-length animated motion picture The Little Mermaid; once again, Sullivan Bluth Studios' latest feature would be vying for box office receipts with Disney's, just as their last two films (An American Tail and The Land Before Time) had. On its theatrical release, while still making its budget of $13.8 million back, the film's performance fell short of Sullivan Bluth Studios' previous box office successes, grossing US$27m in North America alone, just over half of what An American Tail and The Land Before Time each took.[20]","Sequels and spin-off":"The success of the film, particularly its performance on home video, prompted several follow-up productions. A theatrical sequel, All Dogs Go to Heaven 2; a television series, All Dogs Go to Heaven: The Series; and An All Dogs Christmas Carol, a Christmas television movie based on Charles Dickens' A Christmas Carol, were made. Don Bluth and his studio had no involvement with any of them, Burt Reynolds did not reprise his role as Charlie in any of them, and Dom DeLuise and Charles Nelson Reilly reprised their roles as Itchy and Killer in all of them, only Reilly did not return in the second film.","box_office":"$27.1 million (US)[2]","production_company":"Sullivan Bluth Studios Goldcrest Films","directed_by":"Don Bluth","Home media":"All Dogs Go to Heaven was released on VHS, S-VHS, 8mm video and LaserDisc in both regular[23] and special CAV standard play editions[24] by MGM/UA Home Video on August 29, 1990.[25] The film became a sleeper hit thanks to its home video release; a strong promotional campaign helped it become one of the top-selling VHS releases of all time, selling over 3 million copies in its first month.[26]A DVD version was made available for the first time on March 6, 2001 under the MGM Kids label,[27] and was later released as a double feature with All Dogs Go to Heaven 2 on March 14, 2006.[28] On March 29, 2011, the film made its debut on Blu-ray,[29] which was later included as a bundle with its sequel on October 7, 2014,[30] along with a re-release of the compilation on DVD.[31] The Blu-ray version was also packaged with another Don Bluth film, The Pebble and the Penguin, on October 8, 2013,[32] and again with eight other MGM films as part of the company's 90th anniversary \"Best of Family Collection\" on February 4, 2014.[33]","Soundtrack":"The music for All Dogs Go to Heaven was composed by Ralph Burns with lyrics by Charles Strouse, T.J. Kuenster, Joel Hirschhorn, and Al Kasha.[10] An official soundtrack was released on July 1, 1989 by Curb Records on audio cassette and CD featuring 13 tracks, including 7 vocal songs performed by various cast members.[9] The end credits theme \"Love Survives\" was dedicated to Anne-Marie's voice actress Judith Barsi, who passed away before the film's release.Track listing","Awards and honors":"All Dogs Go to Heaven received a nomination for \"Best Family Motion Picture: Adventure or Cartoon\" at the 11th annual Youth in Film Awards ceremony, being beaten by Disney's The Little Mermaid.[21] The home video release received an Award of Excellence from the Film Advisory Board.[22]","References":"NotesBibliography","release_dates":"November 17, 1989 (1989-11-17) (US)|December 26, 1989 (1989-12-26) (Australia)|February 1, 1990 (1990-02-01) (UK)|||","Production":"The earliest idea for the film was conceived by Don Bluth after finishing work on The Secret of NIMH. The treatment was originally about a canine private eye, and one of three short stories making up an anthology film. The character of a shaggy German Shepherd was designed specifically with Burt Reynolds in mind for the role. However, Bluth's first studio, Don Bluth Productions, was going through a period of financial difficulty, ultimately having to declare bankruptcy, and the idea never made it beyond rough storyboards. The concept was revived by Bluth, John Pomeroy and Gary Goldman, and rewritten by David N. Weiss, collaborating with the producers from October through December 1987. They built around the title All Dogs Go to Heaven, and drew inspiration from films such as It's a Wonderful Life, Little Miss Marker and A Guy Named Joe. The film's title came from a book read to Bluth's fourth grade class in school, and he resisted suggestions to change it, stating he liked how \"provocative\" it sounded, and how people reacted to the title alone.During the production of their previous feature film, Sullivan Bluth Studios had moved from Van Nuys, California to a state-of-the-art studio facility in Dublin, Ireland, and the film was their first to begin production wholly at the Irish studio. It was also their first to be funded from sources outside of Hollywood, the previous two feature films, An American Tail and The Land Before Time, had been backed by Amblin Entertainment and Universal Pictures, and executive producers Steven Spielberg and George Lucas (for The Land Before Time only) exercised a degree of control over the content of the films, a situation Bluth found disagreeable.[4][5] The studio found investment from UK-based Goldcrest Films in a US$70m deal to produce three animated feature films (though only two, it and Rock-a-Doodle, would be completed under the deal).[6] The three founding members of the studio, Bluth, Pomeroy and Goldman, had all moved to Ireland to set up the new facility, but during the film's production, John Pomeroy returned to the U.S. to head up a satellite studio which provided some of the animation for the film. Pomeroy also used his presence in the U.S. to generate early publicity for the film, including a presentation at the 1987 San Diego Comic-Con.[7]The film's lead voices, Burt Reynolds and Dom DeLuise, had previously appeared together in five films. For this one, they requested them to record their parts in the studio together (in American animation it is more common for each actor to record their part solo). Bluth agreed and allowed Reynolds and DeLuise to ad-lib extensively, Bluth later commented \"their ad-libs were often better than the original script\".[8] However, Reynolds was more complimentary of the draft, warmly quipping, \"Great script, kid\", as he left the studio. Another pair of voices, those of Carface and Killer (Vic Tayback and Charles Nelson Reilly, respectively), also recorded together. Loni Anderson, who voices Flo, was Reynolds' then-wife.[7] Child actress Judith Barsi, who voiced Ducky in Bluth's previous film The Land Before Time, was selected to voice Anne-Marie; she was killed in an apparent murder-suicide over a year before All Dogs Go to Heaven was released.[7]As production neared completion, the studio held test screenings and decided that some of the scenes were too intense for younger viewers. Writer and producer John Pomeroy decided to shorten Charlie's nightmare about being condemned. Co-director Gary Goldman also agreed to the cut, recognizing that the concession needed to be made in the name of commercial appeal. Don Bluth owned a private 35mm print of the uncut version, and planned to convince Goldcrest Films on releasing a director's cut of the film in the mid-1990s after returning from Ireland. But the print was stolen from Bluth's locked storage room, diminishing hopes of releasing this version on home video.[1]","produced_by":"Don Bluth Gary Goldman John Pomeroy","starring":"Loni Anderson|Judith Barsi|Dom DeLuise|Melba Moore|Charles Nelson Reilly|Burt Reynolds|Vic Tayback|","running_time":"85 minutes","music_by":"Score: Ralph Burns Songs: Charles Strouse T. J. Kuenster","edited_by":"John K. Carr","budget":"$13.8 million[1]"}