{"country":"United States","distributed_by":"Warner Bros.","crossing_delancey":"DVD cover","Plot":"Isabelle Grossman works for a New York bookstore which supports authors through public readings. When author Anton Maes (Jeroen Krabbé), comes to the bookstore to give a reading, he shows an interest in Isabelle, who is enamored with the intellectual world that is very different from her traditional Jewish upbringing.Isabelle pays frequent visits to her Bubbie (grandmother), Ida (played by Yiddish theatre star Reizl Bozyk in her only film role), who lives in the lower east side of Manhattan. Anxious for her granddaughter to settle down, Ida turns to the local marriage broker (Sylvia Miles). Although shocked and annoyed, Isabelle allows the matchmaker to introduce her to Sam Posner (Peter Riegert), who owns the pickle shop.At first Isabelle is not interested in Sam, believing that he is too working-class for her. Instead, she sets her sights on Anton and the New York intelligentsia. But she also feels guilty for how rude she was to Sam, so she tries to make it up to him by setting him up with her girlfriend Marilyn. In the process, she learns that he did not hire a matchmaker out of desperation and in fact has admired Isabelle from afar for several years. She is deeply touched and begins to like him, but it seems Sam has given up on her and starts dating Marilyn.One day at a book reading Sam shows up. Anton arrives as well. Isabelle leaves with Sam, and later agrees to meet him the next day at her grandmother's house.After work, however, she is sidelined by Anton and, believing that he is romantically interested in her, goes to his apartment. She discovers instead that Anton wants the convenience of an assistant, not a true partner. Finally seeing through him, the disgusted Isabelle races to her grandmother's apartment, finding it empty with Ida sleeping on the couch. Heartbroken, she believes she has ruined her chances with the honest and caring Sam. As she cries, Sam enters from the balcony. The two finally are united and Ida feigns confusion, but is gleeful that her plan has succeeded.","language":"English","Reception":"The movie received positive reviews.[2][3][4] It currently holds a 90% rating on Rotten Tomatoes.The movie was a modest arthouse success.[1]","box_office":"$16,262,415 (USA)[1]","cinematography":"Theo Van de Sande","directed_by":"Joan Micklin Silver","release_dates":"August 24, 1988 (1988-08-24)|||||","produced_by":"Michael Nozik","starring":"Amy Irving|Peter Riegert|Jeroen Krabbé|Sylvia Miles|","running_time":"97 minutes","music_by":"Paul Chihara The Roches (songs) Sergei Prokofiev (from \"Kije's Wedding\")","edited_by":"Rick Shaine","written_by":"Susan Sandler (based on her play)","budget":"$4 million"}