{"country":"Japan","distributed_by":"Groove Corporation","screenplay_by":"Yasushi Hirano","story_by":"Yasushi Akimoto","Background":"Production began in 2000 with an original release expectation for January 2001. Character design was by Hiromi Kato and mechanical design was by Makoto Kobayashi. There are 6 chapters of uneven duration, originally released on the Internet as separate episodes, and the total running time is 100 minutes.[1]","language":"Japanese","Critical reception":"T.H.E.M. Anime Reviews felt that director Kobayashi Makoto and scriptwriter Akimoto Yasushi failed in their efforts to create a viewable film. Among the film's attributes that were panned were the background music sounding \"eerily similar to the background of the Care Bears Movie, ethereal and fluffy and jarring and likely the result of a five-year-old banging on a synthesizer,\" the casting of Mamiya Kurumi as the mecha mascot, Link, who reminding the reviewer of Jar Jar Binks \"but with a squeaky Japanese woman's voice,\" and otherwise talented actresses playing the voices of the Guard of Rose being \"uniformly mediocre and less interesting than the girls of the Gall Force\", and character designs being bad and characterizations worse.[1] The reviewer ended his enumeration of multiple flaws by stating (sic) \"This really IS the worst anime I've ever seen. 6 Angels has all the elements that could have made a great movie, except for the greatness.\"[1]","Synopsis":"The movie is set in the near-future in a large underground prison at a former nuclear test site in Utah known as Neo Purgatory, where the characters of Maki (Fumiko Orikasa), Naomi (Michiko Neya), Doris (Akemi Okamura), Marilyn (Mayumi Asano), and Katherine (Yuri Shiratori) make up an all-female mercenary outfit called the \"Guard of Rose\" and acting as a guard patrol. The prisoners, many of whom are mutated by the ambient radiation, are left to their own devices, but a criminal known as Donn Canyon (Takeshi Watabe) and his family take control of the prison and declare war upon the world by gaining control of the American orbital nuclear missile platform and vowing the \"purify the world with radiation\" in a nuclear holocaust. After an abortive attempt by the United States and Soviet militaries to assault the prison, the Guard of Rose is tasked with infiltrating and defeating the Canyon family to preserve global peace.","cinematography":"Yoshito Kuwa","production_company":"Eighty One Entertainment Jpec Syst Co., Ltd.","directed_by":"Makoto Kobayashi","release_dates":"July 6, 2002 (2002-07-06)|||||","produced_by":"Hiromi Chiba Yasushi Akimoto","starring":"Takeshi Watabe Akemi Okamura Akira Ishida Banjou Ginga Daisuke Sakaguchi Fumiko Orikasa","running_time":"100 minutes","music_by":"Masamichi Amano","edited_by":"Yumiko Fuse"}