{"based_on":"Alice's Adventures in Wonderland and Through the Looking-Glass  by Lewis Carroll","original_language(s)":"English","screenplay_by":"Peter Barnes","production_company(s)":"Hallmark Entertainment","Plot":"The film follows the storyline of the book closely, save for adding some scenes from Through the Looking-Glass. It also changes the opening real world scene from Alice and her sister sitting at a riverbank to Alice in her bedroom, reluctantly practicing the song \"Cherry Ripe\", which she is expected to perform at a garden party. (The party guests are played by the same actors as the Wonderland characters, and are shown as resembling them in appearance and personality, in a similar manner to the MGM version of The Wizard of Oz. The toys in Alice's room also reflect the residents of Wonderland). Thanks to stage fright, and constant nagging from her confident governess (Dilys Laye), Alice runs out of the house and hides herself in the woods nearby until the party has ended. However, an apple floats down from the tree and seems to hover in Alice's face. She is suddenly distracted by a human-sized White Rabbit (voiced by Richard Coombs) rushing by. Curious, Alice follows the White Rabbit, falling down his rabbit hole and ending up in Wonderland.Alice travels throughout Wonderland, meeting a large number of bizarre people and challenges. Alice first has problems keeping her size the same while attempting to go through a small door leading to a beautiful garden, eventually she grows massively tall and floods the room she is in with her tears before shrinking to the size of a mouse. She then meets Mr. Mouse (Ken Dodd) and his avian friends who participate in a Caucus Race, where everyone wins. Alice encounters the White Rabbit again who directs her to his house. There, Alice comes across a bottle of liquid that makes her enormous and trapped in the house. The White Rabbit and his gardeners Pat (played by Irish comedian Jason Byrne) and Bill attempt to remove Alice by going down the chimney, but Alice shrinks again. Wandering in a forest, she encounters Major Caterpillar (Ben Kingsley) who advices her to not be afraid before transforming into a butterfly. Alice grows back to normal size by eating part of a mushroom. She ventures to a nearby manorhouse where she meets the musical Duchess (Elizabeth Spriggs), her baby, her pepper-obsessed plate-throwing cook (Sheila Hancock), and the Cheshire Cat (Whoopi Goldberg). The baby is left in Alice's care but it turns into a pig and is released. The Cheshire Cat advices Alice to visit the Mad Hatter and his friends the March Hare and the Dormouse.Meeting the trio at a tea party, Alice is given rather odd advice on how to avoid stagefright, the Mad Hatter (Martin Short) leaping onto the table to do his performance he previously did at a concert of the Queen of Hearts. Alice eventually leaves when the Mad Hatter and March Hare begin smashing cups and plates. They also try stuffing the Dormouse into a teapot. She comes across the small door and using her intelligence, succeeds in getting through it into the garden which is actually the labyrinth maze belonging to the Queen. The Queen of Hearts (Miranda Richardson) invites her to a bizarre game of croquet, but her love for decapitating people annoys Alice. The Cheshire Cat's head appears in the sky and is ordered to be executed, but reasoning from Alice stops the Queen. The Duchess arrives to answer the King's question of who the Cat's owner is, but the Cat has vanished. Alice leaves the croquet game, meeting the Gryphon (voiced by Donald Sinden) and the Mock Turtle (Gene Wilder). The two sing with Alice, teaching her the Lobster Quadrille and encouraging her. Alice then wanders into a darker area of Wonderland, meeting a White Knight (Christopher Lloyd) who encourages her to be brave and also shows her his newest invention.Alice meets some talking flowers: a Tiger-Lily (voiced by Joanna Lumley) who is the most sensible out of all of them, some Roses which are not too bothered about Alice being lost, and some Daisies who are rascals. Having the flowers helping her, Alice walks off. Alice then meets Tweedledum (Robbie Coltrane) and Tweedledee (George Wendt) who have some antics with her before getting into a fight over a dropped rattle. Alice is then taken to the royal court where the Knave of Hearts (Jason Flemyng) is put on trial for apparently stealing the Queen's jam tarts. The Mad Hatter and his companions appear as witnesses but he is accused of stealing someone else's hat and is recognized by the Queen for singing at her concert, prompting him to sing his Twinkle Song. Alice is then called to the stand but she uses some mushroom pieces to grow to great heights. She sees the jam tarts have been untouched and the trial is pointless. She openly criticizes the Queen, the King and Wonderland. The White Rabbit, who is present at the court, reveals he deliberately lured Alice into Wonderland to conquer her fears. He does so by first asking her if she is self-confident. Upon Alice answering yes, he simply states, \"then you don't need us anymore.\" He then sends her back home using the same hovering apple that brought her there in the first place.Awakening back home, Alice courageously sings in front of her parents and their guests, but instead of singing Cherry Ripe, she sings the Lobster Quadrille which she finds much more interesting. The audience enjoy her performance and applaud. Alice spots the Cheshire Cat in the audience who smiles at her in a term of congratulations. The film ends with the lobster quadrille, beautiful soup and some back ground music all during the end credits.","country_of_origin":"United Kingdom United States","original_network":"NBC","Reception":"The original NBC airing averaged a 14.8 household rating and a 22 percent audience share, and was watched by 25.34 million viewers, ranking as the 6th highest rated program that week in terms of households and the most watched program that week in terms of total viewers.[1][2][3][4]","cinematography":"Stefan Lange Giles Nuttgens","directed_by":"Nick Willing","original_release":"February 28, 1999 (1999-02-28)|||||","Awards":"Primetime Emmy Awards","theme_music_composer":"Richard Hartley","editor(s)":"Alex Mackie","starring":"Tina Majorino Miranda Richardson Martin Short Whoopi Goldberg Simon Russell Beale Robbie Coltrane Ken Dodd Heathcote Williams Gene Wilder George Wendt Christopher Lloyd Peter Ustinov Ben Kingsley Elizabeth Spriggs Pete Postlethwaite","running_time":"129 minutes","producer(s)":"Dyson Lovell","Special effects":"This movie was a mix of puppetry and live-action. The puppet designs were created by Jim Henson's Creature Shop. They are the Cheshire Cat, the Gryphon, the March Hare, the Dormouse, the pig baby, the flamingos, the hedgehogs, and the White Rabbit.In all, 875 special digital effects were created for the film. An example is Martin Short's head; it was enlarged to three times its size to resemble the Hatter in Tenniel's illustrations. Another one is the large books. Both of these examples were done by computer effects and Jim Henson's Creature Shop.","budget":"$21 million"}