{"2_fast_2_furious":"Theatrical release poster","based_on":"Characters  by Gary Scott Thompson","Cast":"Producer Neal H. Moritz makes a cameo appearance as a police officer during the freeway chase scene prior to Brian and Roman secretly sneaking off in the two muscle cars.","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Michael Brandt|Derek Haas|","story_by":"Michael Brandt|Derek Haas|Gary Scott Thompson|","Plot":"After allowing fugitive Dominic Toretto (Vin Diesel) to evade arrest, former LAPD officer Brian O'Conner (Paul Walker) finds himself on the run from the FBI for his actions. He flees Los Angeles to start a new life, traveling across the U.S. in a red Mitsubishi GTO. At each stop along the way he enters drag races, winning large amounts of money, and staying one step ahead of the FBI, who issue a country-wide manhunt against him. The police eventually locate Brian and repossess his car, forcing him to flee on foot. A young woman (Minka Kelly) picks him up hitchhiking, and drops him off at a local car lot, where he buys a 1999 Nissan Skyline GT-R R34 with his various winnings. After winning several more races, Brian decides to settle in Miami.While in Miami, he meets Tej Parker (Ludacris), an ex-street racer who runs a top racing garage. Tej's crew includes Jimmy (Jin Auyeung), a well-known car tuner, and Suki (Devon Aoki), another street racer, and lives in a small cot near Tej's garage. After taking his Skyline to the streets of Miami and winning in races organized by Tej, he establishes himself as one of Miami's top drivers, earning the nickname \"Bullitt\" (a reference to the well-known 1968 Steve McQueen movie).After settling in Miami, Brian makes a living by racing for money. Tej organizes a local street race, involving Suki, Orange Julius (Amaury Nolasco) and Slap Jack (Michael Ealy), and calls Brian, who agrees to be the fourth driver for the race. Brian wins, giving a few thousand of his winnings to Tej to show his gratitude. The police arrive on the scene, forcing all the racers to flee.Watched by undercover United States Customs Service Agent Monica Fuentes (Eva Mendes), Brian is caught by U.S. Customs agents after his car is disabled by a grappling hook-like electronic disruption device. Brian is given a deal by his former boss, F.B.I. agent Bilkins, and Custom Agent Markham (James Remar) to go undercover and try to bring down drug lord Carter Verone (Cole Hauser) in exchange for the erasure of his criminal record. Brian agrees but only if he is given permission to choose his partner, refusing to partner with the agent assigned to watch him. Brian heads home to Barstow, California, where he recruits Roman Pearce (Tyrese Gibson), a childhood friend of Brian who had served jail time and is under house arrest, to help him. Pearce agrees, but only for the same deal Brian was offered, and with the help of Monica, Brian and Roman work together to take down Verone. After acquiring confiscated vehicles and being hired by Verone as his drivers, the duo return to a Customs/FBI hideout, where Roman confronts Markham over the latter's interference with the mission. After the situation is cooled down, Brian tells Bilkins and Markham that Verone plans to smuggle the money into his private jet and fly off, but also suspects something wrong with Monica's role in the mission.Later, Brian and Roman race two of Verone's drivers for their cars and begin to devise a personal backup plan if the operation goes awry. The team challenges a pair of muscle car drivers they raced earlier for pink slips. Despite engine and power output handicaps, Brian and Roman manage to win the race and the other two cars. Meanwhile, Roman confronts Brian about his attraction to Monica and the constant threat of Verone's men. However, the two men patch up their differences.After witnessing Verone torture Detective Whitworth (Mark Boone, Jr.) of the Miami Police Department into giving them a window of opportunity to make their getaway, Brian and Roman are warned by Monica that they will be killed once the drop is made. Despite this information, Markham refuses to call off the job, claiming this is their one chance to catch Verone; he threatens Brian and Roman with jail if they refuse to follow through with the plan.On the day of the mission, Brian and Roman begin transporting duffel bags of Verone's money, with two of Verone's men Enrique (Mo Gallini) and Roberto (Roberto Sanchez) riding along to watch Brian and Roman. Before the 15-minute window is set, the detective in charge, Whitworth decides to call in the police to move in for the arrest, resulting in a high-speed chase across the city. The duo lead the police to a warehouse, where a \"scramble\" by dozens of street racers disorient the police. Following the scramble, police manage to pull over the Evo and the Eclipse, only to find out that they were driven by Tej and Suki.As Brian approaches the destination point in a Yenko Camaro, Enrique tells him to make a detour away from the airfield to the Tarpon Point Marina exit. Meanwhile, Roman gets rid of Roberto by using an improvised ejector seat in his (orange) Dodge Challenger powered by nitrous oxide. At the airfield, Customs Agents have Verone's plane and convoy surrounded, only to discover they have been duped into a decoy maneuver while Verone is at a boatyard several miles away. As he knew Monica was an undercover agent, he gave her the wrong information on the destination point and plans to use her as leverage. When Brian arrives at the intended drop-off point, Enrique prepares to kill him when Roman suddenly appears and the both of them dispatch Enrique. Verone makes his escape aboard his private yacht, but Brian and Roman use the Yenko Camaro and drive off a ramp, crashing on top of the yacht. The duo manage to apprehend Verone and save Monica.With their crimes pardoned, Brian and Roman ponder on what to do next other than to settle in Miami when the former mentions starting a garage. Roman asks how they would afford that and Brian reveals that he took some of the money, as Roman also reveals that his pockets aren't empty, having taken money for himself.","language":"English","Reception":"On Rotten Tomatoes, the film received a 36% rating based on reviews from 159 critics; the average rating is 4.7/10. The site's consensus reads: \"Beautiful people and beautiful cars in a movie that won't tax the brain cells\".[3] On Metacritic, the film gained a metascore of 38 out of 100 based on reviews from 35 critics,.[4]Roger Ebert of the Chicago Sun-Times, however, gave the film a positive review, remarking: \"It doesn't have a brain in its head, but it's made with skill and style and, boy, it is fast and furious.\"[5]The movie received two Razzie Award nominations including Worst Remake or Sequel and Worst Excuse for an Actual Movie (All Concept/No Content).2 Fast 2 Furious earned $50,472,480 in its U.S. opening in 3,408 theaters, ranking first for the weekend. In its 133 days in release, the film reached a peak release of 3,418 theaters in the U.S. and earned $127,154,901 domestically. The film had the 15th largest domestic gross of 2003 and the 16th largest worldwide gross of 2003; combined with the foreign gross of $109,195,760, the film earned $236,350,661 worldwide.[1]","box_office":"$236.3 million[1]","cinematography":"Matthew F. Leonetti","production_company":"Mikona Productions GmbH & Co. KG Original Film","directed_by":"John Singleton","Music":"The musical score was composed by David Arnold. The hip-hop-oriented soundtrack was released on May 20, 2003 on the Def Jam record label.","release_dates":"June 6, 2003 (2003-06-06)|||||","Production":"Neither Vin Diesel nor director Rob Cohen returned for this film, as they were working on xXx at the time. Ja Rule, who also appeared in the first film, turned down this film to pursue other projects. Originally, Tej was to be played by Redman, however, because of scheduling conflicts, the part was given to Ludacris.The Skyline GT-R driven by Brian was actually Paul Walker's personal car, which he personally customized for the film. It sustained a ruptured oil pan and severe damage to all four rims from the bridge jump, but in a matter of hours, the car was in good running condition with the parts replaced.[citation needed] Walker personally chose all the racing cars used in the film. The stunt when Brian power slides toward the crowd after winning the first race was actually performed by Paul Walker after several days of practice and after convincing the producers that he could do the stunt himself.Actor Tyrese Gibson (Roman Pearce) personally designed from scratch the Mitsubishi Eclipse Spyder he drives in the film, after seeing the original intended design (a Barney the Dinosaur-purple paint job with black spider webs on the sides and a bright yellow suede interior, among other features).[citation needed]Some of the cars in the film were re-used from the first film, most notably Slap Jack's Toyota Supra and Orange Julius' Mazda RX-7 (the latter was seen again in Rob Cohen's The Last Ride), which were repainted versions of the first film's cars fitted with new body kits. For Slap Jack's Supra, the hood was fitted with a Lexan panel to show the engine underneath. To cut down on costs, stunt doubles of the car had photographs of the engine pasted under the Lexan panels of their hoods.For the bridge jump, all of the cars except Suki's Honda S2000 were fitted with roll cages. As the S2000 is a convertible, it was fitted with a remote control and a dummy in the driver's seat.[citation needed]As the Mitsubishi Lancer Evolution VII was not available in the U.S. at the time (the VII was not sold in the U.S. until February 2003), the stunt doubles of the car consisted of regular Mitsubishi Lancers fitted with EVO body kits and engines, while the original production car was shipped to the U.S from Japan.The yellow Dodge Viper SRT-10 seen during the audition race was originally painted red and was among the first batch of that generation of Vipers produced. Four were lent to the production crew on condition that they mustn't crash. They were repainted back to red before they were returned to the factory.The Saleen Mustang that crashed during the audition race scene under a semi was actually a Ford Mustang V6 fitted with a Saleen body kit (because the Saleen version cost over $60,000). The subsequent crash involving the dark-grey Chevrolet Corvette C5 was not originally planned in the script.The house in Miami used as Verone's personal mansion was owned by Sylvester Stallone at the time, and was just used for exterior and the interior shots, as the mansion was borrowed for only two days.Devon Aoki did not have a driver's license (just a driver's permit) or any driving experience prior to the film's production (except driving a golf cart), so she took driving lessons during filming from professional instructors. First she learning pure driving, then stunt driving.[2]The scene in which the Camaro was launched on the yacht was pre-recorded. The yacht was rented, and because the boat's value was over $5 million, they replaced many parts with plastic duplicates. For the shot of the jump, the car was filled with foam and launched from an improvised pad into the lake, and the actors were filmed on green screen.","produced_by":"Neal H. Moritz","starring":"Paul Walker|Tyrese Gibson|Eva Mendes|Cole Hauser|Chris \"Ludacris\" Bridges|James Remar|Michael Ealy|","running_time":"107 minutes","music_by":"David Arnold","edited_by":"Bruce Cannon|Dallas Puett|","budget":"$76 million[1]"}