{"based_on":"book by Tom Murton Joe Hyams","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"W. D. Richter","story_by":"W. D. Richter Arthur Ross","brubaker":"Theatrical poster","Plot":"In 1969 a mysterious man (Robert Redford) arrives at Wakefield State Prison in Arkansas. As an inmate, he immediately witnesses rampant abuse and corruption, including open and endemic sexual assault, torture, worm-ridden diseased food, insurance fraud and a doctor charging inmates for care. Brubaker eventually reveals himself—during a dramatic standoff involving Walter (Morgan Freeman), a deranged prisoner who was being held in solitary confinement—to be the new prison warden, to the amazement of both prisoners and officials alike.With ideals and vision, he attempts to reform the prison, with an eye towards prisoner rehabilitation and human rights. He recruits several long-time prisoners, including trustees Larry Lee Bullen (David Keith) and Richard \"Dickie\" Coombes (Yaphet Kotto), to assist him with the reform. Their combined efforts slowly improve the prison conditions, but his stance enrages several corrupt officials on the prison board who have profited from graft for decades.When Brubaker discovers multiple unmarked graves on prison property, he attempts to unravel the mystery, leading to political scandal. A trustee decides to make a run for it when he realizes that he might be held accountable for killing an inmate. The resulting gunfight, in which Bullen is killed, proves to be the clincher that the prison board needs (acting with the tacit approval of the governor) to fire Brubaker.A statement before the credits explains that two years after Brubaker was fired, 24 inmates, led by Coombes, sued the prison. The court ruled that the treatment of the prisoners was unconstitutional and the prison system was ultimately reformed. Meanwhile, the governor was not re-elected.","language":"English","Reception":"Brubaker was a critical and commercial success. Produced on a budget of $9 million, the film grossed $37,121,708[2] in North America, earning $19.3 million in theatrical rentals,[7] making it the 19th highest grossing film of 1980.[8] The movie was also well received by critics,[4] holding a 75% \"Fresh\" rating on the review aggregate website Rotten Tomatoes.[9]Roger Ebert of the Chicago Sun-Times said, \"...The movie (refuses) to permit its characters more human dimensions. We want to know these people better, but the screenplay throws up a wall; they act according to the ideological positions assigned to them in the screenplay, and that's that. ... Half of Redford's speeches could have come out of newspaper editorials, but we never find out much about him, What's his background? Was he ever married? Is this his first prison job? What's his relationship with the Jane Alexander character, who seems to have gotten him this job? (Alexander has one almost subliminal moment when she fans her neck and looks at Redford and, seems to be thinking unpolitical thoughts, but the movie hurries on.) Brubaker is a well-crafted film that does a harrowingly effective job of portraying the details of its prison, but then it populates it with positions rather than people.\"[10]","box_office":"$37,121,708[2]","cinematography":"Bruno Nuytten","directed_by":"Stuart Rosenberg","Awards":"WinsNominations","release_dates":"June 20, 1980 (1980-06-20)|||||","Production":"The film is based on the real-life experiences of warden Thomas Murton, co-author with Joe Hyams of the 1969 book, Accomplices to the Crime: The Arkansas Prison Scandal.[3][4] In 1967, he was hired by Governor Winthrop Rockefeller to reform Arkansas' Tucker State and Cummins State Prison Farms, but Murton was dismissed less than a year into the job because his work was creating too much bad publicity for the state's penal system. In particular, the discovery of numerous graves belonging to prisoners who had been killed in these prisons.[5] Much of the squalid conditions, violence and corruption depicted in the film was the subject of a 1970 federal court case, Holt v. Sarver, in which the federal court ruled that Arkansas' prison system violated inmates' constitutional rights, and ordered reform.Rosenberg replaced Bob Rafelson, who was removed as director early in production. This would become Rosenberg's second prison film after directing Cool Hand Luke in 1967.Most exteriors were filmed at the then-recently closed Junction City Prison in Junction City, southeast of Columbus in central Ohio.[6] Additional locations included Bremen, New Lexington, and the Fairfield County Fairgrounds in Lancaster. The opening scenes of the prison bus departure show the skyline and a view up South Front Street in Columbus.","produced_by":"Ron Silverman Ted Mann (executive)","starring":"Robert Redford Yaphet Kotto Jane Alexander Murray Hamilton David Keith Tim McIntire","running_time":"132 minutes","music_by":"Lalo Schifrin","edited_by":"Robert Brown","budget":"$9 million[1]"}