{"country":"United Kingdom","distributed_by":"First Look International Columbia TriStar Home Video","screenplay_by":"Meera Syal","story_by":"Meera Syal Gurinder Chadha","bhaji_on_the_beach_भाजी_ऑन_द_बीच":"Video cover","Plot":"A community group of British women (mostly Punjabis of various faiths) of all generations from Great Britain, take a group day out to the Blackpool Illuminations. The tensions of the generation gap torn between tradition and modernism as well as the personal upsets and issues of the women and girls come to boiling point as they spend the day out.Simi, the head of the group, has modern social beliefs about feminism that the older clubwomen object to, however she manages to be the caring, in-control figure who holds the day together despite tensions. Ginder is escaping from her abusive criminal husband with her young son and fighting with the stigmatization of single motherhood and her son's pleas to have both a mother and father again. Two boy-crazy teenage girls meet with the disapproval of the conservative older ladies. Hashida is a high flying student who is about to start medical school, yet would prefer to be studying painting. She has hidden her Afro-Caribbean boyfriend Oliver from her family for a year, but now she's pregnant by him and now they must make decisions about the child and their relationship: would it stand the strain of social disapproval. Aasha, a devout Hindu and Bollywood-cinema fan, is stuck with a humdrum life in her convenience shop and finds excitement and a sense of fulfilling missed opportunities in life with a charming, eccentric, artistic English actor in Blackpool, yet feels she must stay in her marriage.In the end, most of the characters have their stories left open. We do not see what happens to Aasha or with Oliver and Hashida and the final scenes of these characters seem quite content but open-ended. Ginder and her son escape the violence of her husband and the most conservative characters receive a humorous treatment in a strip club.","language":"English Hindi Punjabi","Reception":"Sight & Sound said it 'offered some trenchant observations about prevalent prejudices and what the younger, British-born generation of Asians had to offer. In Bhaji on the beach, her feature film debut, Chadha has tried to adhere to this code of Buzurgh loyalty (the age span ranges from 6 to the late 60's), while trying to encompass the more awkward and raw elements thrown up by contemporary Asian women's lives.[1] Rotten Tomatoes retrospective collected reviews from 8 critics to give the film a score of 88%.[2][3][4][5][6][7]","box_office":"$735,192(United States)","cinematography":"John Kenway","production_company":"Channel Four Films Umbi Films","directed_by":"Gurinder Chadha","References":"","release_dates":"11 September 1993 (1993-09-11) (Toronto Film Festival)|||||","produced_by":"Nadine Marsh-Edwards","starring":"Kim Vithana Jimmi Harkishin Sarita Khajuria","running_time":"101 minutes","music_by":"John Altman Craig Pruess","edited_by":"Oral Norrie Ottey"}