{"country":"United States","distributed_by":"RKO Radio Pictures","Plot":"As a yacht sails into an island chain in the South Pacific, a large number of natives in pontoon boats sail out to greet them. The natives dive for the trinkets the yacht's crew throws them. A shark arrives, scaring most of the natives away. Attempting to catch a shark by throwing it bait that has been tied to a harpoon-sized hook, Johnny Baker (Joel McCrea) accidentally steps into a loop that tightens around his ankle. The shark takes the bait, and the rope grows tighter, causing the rope to yank the young man overboard. Luana (Dolores del Río), the daughter of the chief, saves his life by leaping into the water and cutting the rope.It is not long before they meet in the middle of the night. Swiftly falling in love, they discover she has been promised by her father to another man – a prince on a neighboring island. An arranged wedding with an elaborate dance sequence then follows. Johnny appears at the nick of time, runs into a circle of burning fire, rescues her as the natives kneel to the fire.They travel to another island where they hope to live out the rest of their lives. He builds her a house with a roof of thatched grass. However, their idyll is smashed when the local volcano on her home island begins to erupt. She confesses to her lover that she alone can appease the mountain. Her people take her back. When Johnny goes after her, he is wounded in the shoulder by a spear and tied up. The people decide to sacrifice both of them to the volcano, but on the way, the couple are rescued by Johnny's friends and taken aboard the yacht.Johnny's wound is tended to, but his friends wonder what will become of the lovers. Luana does not fit into Johnny's world. When Johnny is sleeping, Luana's father demands her back. She goes willingly, believing that only she can save her people by voluntarily throwing herself into the volcano's mouth.","language":"English","Reception":"Bird of Paradise created a scandal when released due to a scene featuring Dolores del Río swimming naked. This film was made before the Production Code was strictly enforced, so nudity in American movies was still fairly common.[4] The film featured a nude swimming scene with Dolores del Río. Orson Welles said del Río represented the highest erotic ideal with her performance in the film.[5]The film lost an estimated $250,000 at the box office.[1]","bird_of_paradise":"Film poster","box_office":"$753,000[1]","cinematography":"Lucien Andriot Edward Cronjager Clyde De Vinna","production_company":"RKO Radio Pictures","directed_by":"King Vidor Fred Fleck (assistant)","release_dates":"August 12, 1932 (1932-08-12)|||||","Production":"In the past, due to the unavailability of many early sound films, this film was erroneously believed to have been one of the first talkies to have an orchestral film score. A full musical score was featured in the first all-talking movie, Lights of New York (1928).The native huts in this film were reused one year later in RKO's King Kong.[3]","produced_by":"David O. Selznick King Vidor","starring":"Dolores del Río Joel McCrea","running_time":"80 minutes","music_by":"Max Steiner","edited_by":"Archie Marshek","written_by":"Wells Root Wanda Tuchock Leonard Praskins","budget":"$752,000[1]"}