{"based_on":"Chocolat  by Joanne Harris","country":"United States|United Kingdom|","distributed_by":"Miramax Films","screenplay_by":"Robert Nelson Jacobs","chocolat":"Theatrical release poster","Plot":"Vianne Rocher (Juliette Binoche), an expert chocolatier, drifts across Europe with her daughter Anouk (Victoire Thivisol), following the north wind. In the beginning of the Lenten season in 1959, \"fifteen years after the War,\" they travel to a quiet French village that closely adheres to tradition, as led by the village mayor, the Comte de Reynaud (Alfred Molina). Just as the villagers begin observing the forty days of Lent, Vianne opens a chocolate shop, much to Reynaud's displeasure.Vianne wears more colorful clothing than the village women, is an atheist, and has an illegitimate child. She does not fit in well with the townspeople, but is nevertheless optimistic about her business. Her friendly and alluring nature begins to win the villagers over one by one, causing Reynaud to openly speak against her for tempting the people during a time of abstinence and self-denial. The Comte will not admit that his wife has left him; he is romantically interested in Caroline, but he does not pursue her.One of the first to fall under the spell of Vianne and her confections is Armande (Judi Dench), her elderly, eccentric landlady. Armande is unhappy that her cold, devoutly pious daughter Caroline (Carrie-Anne Moss) will not let Armande see her grandson Luc because Caroline thinks Armande is a \"bad influence\". Vianne arranges for Luc and his grandmother to see each other in the chocolaterie, where they develop a close bond. Caroline later reveals to Vianne that her mother is a diabetic, though Armande continues to eat the chocolate despite her condition. Having lost her husband, Caroline is overly protective of Luc and does not even want her son to play.Vianne also develops a friendship with a troubled woman, Josephine (Lena Olin), who is a victim of brutal beatings by her abusive husband Serge (Peter Stormare). After a particularly violent blow to the head, Josephine leaves her husband and moves in with Vianne and Anouk. As she begins to work at the chocolate shop and Vianne teaches her her craft, Josephine becomes a self-confident, changed woman. At the same time, under the instruction of Reynaud, Serge, having seemingly changed into a better man, asks Josephine to come back to him. Finally happy and fulfilled on her own, Josephine declines his request. A drunken Serge breaks into the chocolaterie later that night and attempts to attack both women, before Josephine, in a moment of empowerment, knocks him out with a skillet.As the rivalry between Vianne and Reynaud intensifies, a band of river gypsies camp out on the outskirts of the village. While most of the town objects to their presence, Vianne embraces them, developing a mutual attraction to the Traveller Roux (Johnny Depp). Together they hold a birthday party for Armande with other village members and gypsies on Roux's boat. When Caroline sees Luc, who sneaked out to the party, dancing with his grandmother, she begins to see how strict she has been with her son and that his grandmother's influence in his life may after all be beneficial. After the party, Josephine and Anouk fall asleep on a boat, while Roux and Vianne make love. Late that night, Serge sets the boat, where Josephine and Anouk are sleeping, on fire. Both escape unharmed, but Vianne's faith in the village is shaken.[citation needed]. Luc helps Armande home from the party; her death soon after devastates both him and his mother. After the fire, Roux packs up and leaves with his group, much to Vianne's sadness.Serge later sees Reynaud in his home to confess to his causing the fire, which Reynaud initially thought as divine intervention and becomes horrified at the thought of people almost getting killed as a result. Realizing that Serge is beyond help or fearing that people would blame him as well for the arson, Reynaud evicts Serge from the village.With the return of the north wind, Vianne decides that she cannot win against Reynaud or the strict traditions of the town.[citation needed] She decides to move elsewhere. Anouk refuses to go and during a scuffle, Vianne's mother's urn falls and shatters. After a moment, Vianne goes into her kitchen to see a group of townspeople, who have come to love her and the way she has changed their lives, making chocolate for the festival Vianne had planned on Easter Sunday. Realizing that she has brought change to the town, she decides to stay.[citation needed]Despite the shifting sentiment in the town, Reynaud remains staunch in his abstinence from pleasures such as chocolate. On the Saturday evening before Easter, he sees Caroline leave the chocolatier, which devastates him. Convinced now that chocolate will make people stray from their faith, he sneaks into Vianne's house in order to ruin Vianne's preparations for the Easter festival.[citation needed] After accidentally tasting a bit of chocolate that fell on his lips, he finally yields to temptation and devours much of the chocolate in the window display before collapsing into tears and eventually falling asleep. The next day, Vianne awakens the chastened mayor, and a mutual respect between them is established. Both the Easter Sunday sermon and the festival are a success. Josephine takes over running Serge's café which she renames Café Armande. Also Vianne throws her mothers ashes out the window and the north wind leaves,Roux returns in the summer to be with her, and despite her constant need for change, Vianne resolves to stay, having found a home for herself and her daughter in the village.[citation needed]","language":"English|French|","Reception":"Review aggregator Rotten Tomatoes reports that 63% of critics gave the film a positive review, with the site consensus stating that \"Chocolat is a charmingly light-hearted fable with a lovely performance by Binoche\".[2]The film grossed some US$152,699,946 worldwide, on a production budget of US$25 million.[3]The film was nominated for many awards, including 5 Academy Awards including Best Picture. Among significant awards won for work on this picture were the Art Directors Guild award, 2001, for Excellence in Production Design, the Bogey Award given by the German journal \"Blickpunkt: Film\", based on audience numbers in a certain time, the Audience Award, 2001, of the European Film Awards, for Juliette Binoche, and the Screen Actors Guild award 2001, to Judi Dench for Outstanding Performance by a Female Actor in a Supporting Role. The film also attracted numerous BAFTA nominations and Rachel Portman's score was nominated for a Grammy Award.","box_office":"$152,699,946","cinematography":"Roger Pratt","directed_by":"Lasse Hallström","Soundtrack":"The soundtrack was nominated for the Academy Award, the Golden Globe Award for Best Original Score and the Grammy Award for Best Score Soundtrack Album For A Motion Picture, Television Or Other Visual Media.All songs written by Rachel Portman, except where noted.[4]","release_dates":"December 15, 2000 (2000-12-15)|||||","produced_by":"David Brown|Kit Golden|Leslie Holleran|","starring":"Juliette Binoche|Judi Dench|Alfred Molina|Lena Olin|Johnny Depp|Carrie-Anne Moss|Hugh O'Conor|John Wood|Peter Stormare|Leslie Caron|","running_time":"121 minutes","music_by":"Rachel Portman","edited_by":"Andrew Mondshein","budget":"$25 million"}