{"country":"United States","screenplay_by":"Stirling Silliphant Stanley Mann","story_by":"Bruce Lee James Coburn Stirling Silliphant","Plot":"The movie begins with a martial arts tournament, in which fighters are competing for the right to begin a quest to challenge Zetan (Christopher Lee), a famous wizard who possesses a special book of enlightenment that is supposed to contain all the world's wisdom. Arrogant brawler Cord (Jeff Cooper) defeats every opponent, but is disqualified for fighting dishonorably. Cord decides to follow the eventual winner Morthond (Anthony de Longis), hoping that he can lead him to Zetan.While the two fighters are resting, a blind flutist (David Carradine) walks by them and into a nearby building. Cord follows the blind man and sees him easily dispatch a gang of thugs who attacked him. Impressed by his fighting skills, Cord asks the blind man to be his teacher. The blind man refuses; Cord follows him anyway, but gets frustrated with the way the blind man teaches his lessons in riddles and they soon part ways.Cord finds Morthond wounded from the first trial. Morthond asks Cord to help him end his suffering and pursue his quest to find Zetan. Cord does, and faces a tribe of monkey men whose leader (David Carradine) is a great fighter. Cord challenges and eventually overcomes the Monkeyman, who then tells him how to find his second trial.On the way, Cord encounters a man in a large cauldron of oil (Eli Wallach), who is attempting to dissolve the lower half of his body. The man is hoping to end his sexual urges to find enlightenment, and invites Cord to join him, but Cord immediately leaves.On his journey, Cord has a vision of Death (Carradine), but dispels the spirit by demonstrating his lack of fear.Cord then comes upon a band of travellers holding a festival. Cord meets with their leader, Chang-Sha (Carradine), who offers to let Cord sleep with one of his wives, Tara (Erica Creer). Cord declines due to his vow of celibacy and instead challenges Chang-Sha to combat. The contest is set for the following day; during the night, Cord is joined in his tent by Tara. They make love, and Cord asks Tara to stay with him forever. The next morning when Cord awakes, he finds that the entire band has left, and that Tara has been crucified.While trying to find Chang-Sha, Cord comes to an oasis where he again meets the blind man. Cord again asks him to be his teacher; the blind man agrees and they travel together. Encounters with a poor ferryman, a band of raiders and a spoiled child become opportunities for the blind man to teach an exasperated Cord a few life lessons before they go their separate ways once again.Cord finally finds Chang-Sha and his band. While Cord holds himself, not Chang-Sha, responsible for Tara's death, he still insists on fighting Chang-Sha to learn the location of Zetan. The fight ends in a draw, but Chang-Sha still tells Cord how to find Zetan.Cord reaches the island where Zetan lives, and encounters the sect that protects the book of enlightenment. Cord expects to have to fight, but Zetan explains that Cord has passed the trials and is entitled to read the book. He even asks Cord to replace him as the new keeper of the book. Opening it, Cord finds that the book's pages are simply mirrors; Zetan explains that there is no book of wisdom, and that enlightenment is found only in oneself. Cord walks off laughing, declining to take Zetan's place, and leaves the island. He rejoins with the blind man who gives Cord his flute, passing on his role of teacher to Cord.","circle_of_iron":"Circle of Iron film poster","language":"English","Reception":"The movie gained a mostly negative reception citing poor acting and martial arts but has gained a cult following. It currently holds a 43% \"rotten\" rating on review aggregate website Rotten Tomatoes.","cinematography":"Ronnie Taylor","directed_by":"Richard Moore","release_dates":"25 July 1978 (1978-07-25)","produced_by":"Sandy Howard Paul Maslansky","starring":"David Carradine Christopher Lee Jeff Cooper Roddy McDowall Eli Wallach Anthony De Longis Earl Maynard Erica Creer","running_time":"102 minutes","Bruce Lee's inspiration":"Bruce Lee envisioned his film as an entertaining introduction to Eastern philosophy, as well as martial arts. As he wrote in a preface to the script:The story illustrates a great difference between Oriental and Western thinking. This average Westerner would be intrigued by someone’s ability to catch flies with chopsticks, and would probably say that has nothing to do with how good he is in combat. But the Oriental would realize that a man who has attained such complete mastery of an art reveals his presence of mind in every action...True mastery transcends any particular art.After Lee abandoned the project, the original script was rewritten, replacing some violent scenes with comedic themes.[1]","music_by":"Bruce Smeaton","edited_by":"Ernest Walter"}