{"based_on":"Skipping Christmas  by John Grisham","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Chris Columbus","Plot":"After Riverside, Illinois couple Luther (Tim Allen) and Nora Krank (Jamie Lee Curtis) see their daughter, Blair (Julie Gonzalo), depart for a Peace Corps assignment in Peru on the Sunday following Thanksgiving, empty nest syndrome sets in. Luther calculates the couple spent $6,132 during the previous year's holiday season and, not looking forward to celebrating Christmas without their daughter, he suggests they invest the money usually spent on decorations, gifts, and entertainment and treat themselves to a ten-day Caribbean cruise instead. Skeptical at first, Nora finally agrees under the condition that they still give a donation to the church and Children's Hospital. Luther tries to refuse but finally agrees and they begin planning the trip.The Kranks are amazed to discover they are considered pariahs as a result of their decision. Luther's co-workers think he has become Ebenezer Scrooge when he gives all his employees letters that state about his Christmas boycott, local stationer Aubie is distressed to lose the couple's order for their engraved greeting cards and Christmas Eve party invitations, the Boy Scout troop is upset and angered when the Kranks refuse to purchase one of their Christmas trees to help the scouts make enough money for a camporee, and the police are stunned to discover they won't be buying this year's calendar from them. Most vocal in their objections are neighbors Vic Frohmeyer (Dan Aykroyd) and Walt Scheel (M. Emmet Walsh). Vic, who's the unelected leader of the street, organizes a campaign to force the Kranks to decorate their home so Hemlock Street won't lose the coveted award for best decorations. Vic has political and bureaucratic connections in Chicago. Walt doesn't seem to like Luther, so his efforts are primarily personal. However, it is revealed that Walt's wife Bev is suffering from cancer, perhaps dampening his holiday spirits. Children picket, led by Vic's son Spike (Erik Per Sullivan), neighbors constantly call, and Christmas carolers try to revive the Kranks' holiday spirit by singing on their lawn which Luther stops by freezing his front lawn. Even the newspaper gets into the act by publishing a front page story complete with a photograph of the unlit Krank house and states that the Kranks' street has lost the prize and won sixth place because of how Luther and Nora refused to decorate their house. Still, Luther and Nora continue to stand their ground.The two are in the process of packing on Christmas Eve morning when they receive a call from Blair, who announces she's at Miami International Airport, en route home with her Peruvian fiancé as a surprise for her parents. She's anxious to introduce Enrique to her family's holiday traditions, and when she asks if they're having their usual party that night, a panicked Nora says yes. Comic chaos ensues as the couple finds themselves trying to decorate the house and coordinate a party with only twelve hours to spare before their daughter and future son-in-law arrive.While Nora scrambles to find food, especially Blair's favorite honey glazed ham, Luther goes to buy a tree from the Boy Scouts but they only have one worthless non-green tree left since their sales went big and rapid. Luther decides to give a donation by giving them money but taking the tree in the process; he then rejects it by throwing it in his backyard. While Spike leads a picket at the Kranks', Luther arranges to borrow the tree of neighbor Wes Trogdon who is going away for a week with his kids and wife to close relatives being given the warning that he is not to break one ornament or damage it. Luther and Spike try to transport it across the street on Spike's Radio Flyer wagon, only for the neighbors to confuse this to be Luther stealing the family's Christmas tree and end up being called for the police to arrest him for theft. Spike comes to Luther's rescue by showing the neighbors and officers that Luther has Trogdon's keys and thus was given permission to borrow the tree. Nora comes home enraged at Luther for making the borrowed Christmas tree a \"Disaster\" and how she had to buy \"Smoked Trout\" to replace the honey ham. Once it is established why Luther is trying frantically to decorate his home, the neighbors, led by Vic, come out full force to help him and Nora ready it for Blair. Blair calls to say she landed from Miami; despite this, she is sent by a police transport to their house thus leaving her still unaware of the chaos.After subtly giving everybody, including Blair and Enrique, an un-thankful and non-friendly toast, Luther tries to convince Nora to accept the cruise when she confronts him for the toast, but she refuses, disgusted that he isn't happy Blair is home. Having a change of heart, Luther sadly slips out of the house and goes across the street to the Scheel home. Bev's cancer, once in remission, has returned and, knowing this may be their last holiday together, Luther insists they take the cruise in place of him and Nora, going so far as to offer to take care of their hated cat, Muffles, so they can go. At first they decline, but ultimately accept his generosity and Luther, whose holiday spirit has been renewed, realizes skipping Christmas wasn't as good an idea as he had originally thought.","language":"English","Critical reception":"The film received negative reviews from critics. On Rotten Tomatoes, the film has a rating of 5% based on 123 reviews, with the site's critical consensus reading, \"A mirthless movie as fresh as last year's fruit cake, Christmas with the Kranks is a coarse, garish comedy that promotes conformity.\"[3] On Metacritic the film has a score of 22 out of 100, based on 33 critics, indicating \"generally unfavorable reviews\".[4]","box_office":"$96.6 million[1]","cinematography":"Don Burgess","production_company":"Revolution Studios 1492 Pictures","directed_by":"Joe Roth","Home media":"Christmas with the Kranks was released on DVD and VHS on November 8, 2005.","christmas_with_the_kranks":"Theatrical release poster","release_dates":"November 24, 2004 (2004-11-24)|||||","Production":"Joe Roth knew about John Grisham's Skipping Christmas before it was even published in 2001. He was asked by Grisham to read the book in galley form, assuming he could direct a movie based on it. Roth recalls: \"It turns out he was right. Even while I was reading it, all I could think was that this would make a great Christmas movie. It had humor, it had wonderful characters and it had heart.\" It was a huge change for him as he, who previously directed thrillers, would now do work for a film lighter in tone and style. With the rights of the book received and the May 2000 founding of Revolution Studios, he stated that \"as a start-up company, there was a great deal of work to do in order to get up and running.\"[2]Later, filmmaker Chris Columbus, who also bought the rights to Skipping Christmas and had written a screenplay, called Roth about directing the adaption. As Roth explains: \"Naturally, I thought he was going to direct it. But he said, 'No, you should direct it.' It turns out I was getting ready to direct another project. But when I read Chris's script, I knew I had to at least try to direct it. I promised myself that if I could get the right cast in place, I would do it.\" Producer Michael Barnathan said, \"Joe read the script on a Sunday, bought it on Monday, decided he wanted to direct it on Tuesday and by Friday had cast Tim [Allen] and Jamie Lee [Curtis]. The following Monday morning we started pre-production.\"[2]Christmas with the Kranks takes place mostly in the Kranks's neighborhood of Hemlock Street in Riverside, a suburb of Chicago, Illinois, over the course of four weeks from Thanksgiving to Christmas Eve. Production designer Garreth Stover originally looked for locations with the right weather conditions and suburban ambience for Hemlock Street, as described specifically in Columbus's script of the film. He was scouting from the metropolitan area of Chicago to Minnesota, but due to the extreme conditions of this part of the United States at the time, the filmmakers felt it was better to set up the neighborhood in an empty location instead of finding one.[2]When looking for a place to build the set 15 weeks before filming began, Stover chose a parking lot of a former Boeing aircraft factory in Downey, California, about 15 miles away from downtown Los Angeles and in the midst of Downey Studios. The rest of the first three weeks were spent on designing the houses with assistance from construction coordinator David Elliott. In the next 12 weeks, hundreds of carpenters, plasterers and painters working built had built what would become the largest exterior set ever for a movie, being more than 700 feet long and including 16 houses. What Stover called \"the core five\" were the houses of the Kranks, the Frohmeyers, the Scheels, the Beckers and Trogdons, which he claimed had \"full ground floors that are dressed and you can see into.\" He also said that the second floor of the Kranks' was built on a soundstage. Producer Michael Barnathan claimed that the set would later be available for other movies, TV series and commercials to use.[2]Susie DeSanto handled the costume design of Christmas with the Kranks. According to DeSanto, \"I was looking for a project that was really textural, and maybe a bit nostalgic. I saw Christmas With the Kranks like a Christmas card, a beautiful Christmas memory of how we wish the holiday to be. So a lot of the fabrics I chose were not so much high-tech bright colors, but wools, plaids and mixing patterns. Joe [Roth] was specific about what he wanted, but within that, he allowed me a great deal of freedom to express myself.”[2]DeSanto viewed that all the characters in Christmas with the Kranks would wear dresses that are supposed to serve as their \"accents\" rather than overtly defining them. Luther Krank is seen wearing the same-colored shirt and suit at work all the time, and according to DeSanto, this \"tells that Luther’s a punch-the-clock kind of guy, so the whole idea of skipping Christmas and going off on a tropical vacation is completely averse to anything he’s ever done.\" She described Nora as \"tasteful and kind of folksy, a middle-American woman approaching middle age. In our first meeting, Jamie Lee Curtis was totally prepared. She wanted to look like a real Midwestern woman who lives in the suburbs of Chicago and is as obsessed with Christmas as everyone around her. Nora dresses for the seasons and I found out by speaking to people at Marshall Field’s in Chicago that the Christmas sweater is a big deal. And Jamie wears it so well.” As for Vic Frohmeyer, she saw him as \"a sort of commander-in-chief of the neighborhood, so I wanted something with a bit of a military flair. Since he’s also a college professor, we cut the pattern from a general’s jacket and made it professorial by using a vintage tweed mixed with corduroy.”[2]The soundtrack features many holiday standards, including \"Jingle Bell Rock\" by Brenda Lee; \"Rudolph the Red-Nosed Reindeer\" by Billy May & His Orchestra with vocal by Alvin Stoller; \"I Saw Mommy Kissing Santa Claus\" by Eddie Dunstedter; \"White Christmas\" by Dean Martin; \"Frosty the Snowman\" by Steve Van Zandt; \"Blue Christmas\" by Elvis Presley; and \"The Christmas Song\" by Ella Fitzgerald.","Box office":"The film was a box office success. On its opening weekend, it earned $21,570,867 on 3,393 screens, ranking #3 behind National Treasure and The Incredibles. It eventually grossed $96,572,480 worldwide.[1]","produced_by":"Michael Barnathan|Chris Columbus|Mark Radcliffe|","starring":"Tim Allen|Jamie Lee Curtis|Dan Aykroyd|Erik Per Sullivan|Cheech Marin|Jake Busey|M. Emmet Walsh|","running_time":"98 minutes","music_by":"John Debney","edited_by":"Nick Moore","budget":"$60 million[1]"}