{"distributed_by":"Buena Vista Pictures","screenplay_by":"Judd Apatow","story_by":"Judd Apatow Colin Quinn","celtic_pride":"Theatrical release poster","Plot":"Best friends for life, gym teacher Mike O'Hara (Daniel Stern) and plumber Jimmy Flaherty (Dan Aykroyd) are united by their love of Boston and its sports teams, especially the Boston Celtics, who are playing their last season in the old Boston Garden. When the Celtics drop Game 6 of the NBA Finals to the Utah Jazz, setting up a deciding Game 7 in Boston, Mike and Jimmy find themselves depressed and hopeless. On top of all this, Mike has moved back in with Jimmy after his wife Carol, fed up with his unhealthy obsession with the Celtics, left him and took their son Tommy with her. Jimmy and Mike stumble upon the Jazz's selfish, one-man-show shooting guard Lewis Scott (Damon Wayans) at a Boston nightclub. Hoping at first to get him drunk enough so he'll be hungover for Game 7, Mike and Jimmy pose as Utah fans. This however leads to them running into their idol Larry Bird (as himself), who scolds them for being what he thinks are \"fair weather\" fans. However, the pair get more than they bargained for when the next morning they end up kidnapping Scott after he wakes up at Jimmy's apartment. The two decide to hold Scott until after the game, reasoning that if they are going to prison, they might as well help the Celtics win in the meantime.Scott's streetwise, arrogant ways contrast with Jimmy and Mike's bumbling blue-collar lifestyle. He derides them for being washed-up losers, and insinuates Mike is only after him because he is jealous of Scott's fame and ability. Mike, on the other hand, berates Scott for his behavior on and off the court, including starring in a campy Oscar Mayer hot dog commercial and skipping practices. Scott attempts to turn Jimmy against Mike, and, when this fails, escapes, only to be foiled by an antagonistic cabbie and a local cop, Kevin (Paul Guilfoyle), both fellow Celtics fans.Ultimately, Mike challenges Scott to a game of one-on-one and the pair is incapacitated well before the final game is set to begin. Before he runs off, Scott presents the pair with a dilemma, they must root for him and hope the Jazz win, otherwise he will turn them both in to the police. Mike reconciles with his wife and son, knowing he might be going to prison, and Jimmy says goodbye to his grandmother. At the game, the two convince the other Celtics fans they are only pretending to root for the Jazz, and the first half ends with the Celtics leading. Mike, who knows the Jazz are losing because Scott refuses to pass the ball, gives him a pep talk from the stands, and Utah closes the gap to one point with a little over 7 seconds remaining. With one play left and the Jazz with the ball, Mike and Jimmy choose life over the Celtics, rooting for Utah and rushing the court after they win. Approached by Kevin who earlier ignored his cries for help, Lewis denies Mike and Jimmy committed the kidnapping, saving them from prison.A few months later, Mike has promised his wife he would never interfere with an NBA Finals game again. But now it's football season. He and Jimmy sneak into the hotel room of Deion Sanders at 3:00 a.m.","language":"English","Reception":"The film was not a major success despite its star power, grossing less than $10 million domestically, and received very poor reviews, with a rotten rating of 9% on review aggregate Rotten Tomatoes.[1]Hal Hinson of The Washington Post wrote, \"Celtic Pride\" is clearly intended as a spoof on the contemporary mania for athletics. But not only is the picture woefully short on laughs, it's also coarse, overbearing and, in places, downright insulting[2] while TV Guide said \"Celtic Pride supplies predictably lowbrow yocks for jocks, and its rather disturbing racial implications go entirely unacknowledged,\" and awarded it 1 and half stars out of five.[3]However, in a rare, more positive review, Joe Leydon of Variety said \"Not quite a three-pointer, but definitely more than an airball, \"Celtic Pride\" is an uneven but largely likable basketball-themed comedy that should lay up decent B.O. numbers and perform even better in the homevid arena.\"[4]","box_office":"$9,255,027 (domestic)","cinematography":"Oliver Wood","production_company":"Hollywood Pictures Caravan Pictures","directed_by":"Tom DeCerchio","release_dates":"April 19, 1996","produced_by":"Roger Birnbaum Judd Apatow","starring":"Damon Wayans Daniel Stern Dan Aykroyd","running_time":"90 mins.","music_by":"Basil Poledouris","edited_by":"Hubert De La Bouillerie"}