{"mandarin":"yǐn shí nán nǚ","country":"Taiwan","distributed_by":"The Samuel Goldwyn Company","Plot":"The setting is 1990s contemporary Taipei, Taiwan. Mr. Chu (C: 老朱, P: Lǎo Zhū \"Old Chu\"; Sihung Lung), a widower who is a master Chinese chef, has three unmarried daughters, each of whom challenges any narrow definition of traditional Chinese culture:Each Sunday Mr. Chu makes a glorious banquet for his daughters, but the dinner table is also the family forum, or perhaps “torture chamber,” to which each daughter brings “announcements” as they negotiate the transition from traditional “father knows best” style to a new tradition which encompasses old values in new forms.Other characters include:As the film progresses, each daughter encounters new men. When these new relationships blossom, their roles are broken and the living situation within the family changes. The father eventually brings the greatest surprise to the audience at the end of the story.","language":"Mandarin","Reception":"In her review in The New York Times, Janet Maslin praised Ang Lee as \"a warmly engaging storyteller.\" She wrote, \"Wonderfully seductive, and nicely knowing about all of its characters' appetites, Eat Drink Man Woman makes for an uncomplicatedly pleasant experience.\"[11]In his review in the Washington Post, Hal Hinson called the film a \"beautiful balance of elements ... mellow, harmonious and poignantly funny.\" Hinson concluded:As the relationships evolve and deepen, there seems to be a surprise around every corner—for both the characters and the audience. But what is most surprising, perhaps, is how involved we become with these people. As satisfying as food can be, the fullness we feel at the end here is far richer and more complex than that offered by the most extravagant meal. “ Eat Drink Man Woman” is a delicacy but also something more—something like food for the heart.[12]On the aggregate reviewer web site Rotten Tomatoes, the film received a 94% positive rating from top film critics based on 31 reviews, and a 91% positive audience rating based on 13,132 reviews.[2]Tortilla Soup, a 2001 American comedy-drama film directed by Maria Ripoll, is based on Eat Drink Man Woman.","box_office":"$7.2 million","cinematography":"Jong Lin","directed_by":"Ang Lee","eat_drink_man_woman":"DVD cover","traditional":"飲食男女","simplified":"饮食男女","release_dates":"August 3, 1994 (1994-08-03)|||||","Development":"Ang Lee, James Schamus, and Hui-Ling Wang wrote the script.[7]","produced_by":"Hsu Li Kong Hsu Kong","starring":"Sihung Lung[N 1] Yu-wen Wang Chien-lien Wu Kuei-mei Yang","running_time":"123 minutes","music_by":"Mader","edited_by":"Ang Lee Tim Squyres","written_by":"Ang Lee James Schamus Hui-Ling Wang"}