{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"James Lee|S.S. Schweitzer|Eric Bercovici|","story_by":"John Joseph|Richard Morris|","Plot":"Dr. John Carpenter is a physician in a ghetto clinic who falls for a co-worker, Michelle Gallagher, unaware that she is a nun.Elvis stars as a professional man for the first and only time in his career. Dr. Carpenter heads a clinic serving an underprivileged community in a major metropolis. He is surprised to be offered assistance by three women. Unknown to him, the three are nuns in street clothing who want to aid the community but are afraid the local residents might be reluctant to seek help if their true identities were known. The nuns are also facing opposition from the rude and arrogant priest from the local parish.Carpenter falls for Sister Michelle Gallagher, played by wholesome Mary Tyler Moore, but Sister Michelle's true vocation remains unknown to Dr. Carpenter. She also has feelings for the doctor but is reluctant to leave the order. The film concludes with Sister Michelle and Sister Irene entering a church where Dr. Carpenter is singing to pray for guidance to make her choice.","change_of_habit":"Theatrical release poster","language":"English","cinematography":"Russell Metty","production_company":"NBC Productions","directed_by":"William A. Graham","Soundtrack":"When Presley entered Decca Universal Studio on March 5, 1969, for two days to record his final dramatic motion picture soundtrack, what would come to be known as the comeback television special had already been broadcast, its attendant album had been his first top ten LP in four years, and he had just finished the sessions at American Sound Studio yielding From Elvis in Memphis and the top ten singles \"In the Ghetto\" and \"Suspicious Minds\" that would cement his resurgence as a force in American popular music.[5] He had a month-long engagement at the International Hotel in Paradise, Nevada lined up in August, his first live performances in eight years, and clearly now had turned his career around.[6]A song recorded at American, \"Rubberneckin'\", would be used in the film and subsequently issued as the b-side of RCA single 47-9768 \"Don't Cry Daddy\" in conjunction with the movie premiere.[7] Four songs would be recorded at the soundtrack sessions, of which \"Let's Be Friends\" would not be used in the film. The four songs would be released commercially on budget albums, \"Let's Be Friends,\" the title track \"Change of Habit,\" and \"Have A Happy\" on Let's Be Friends the following year, with \"Let Us Pray\" issued on the 1971 album You'll Never Walk Alone.[8]Some reference sources erroneously list an outtake from the earlier Presley film, Charro!, \"Let's Forget About the Stars\" (a song also released on the Let's Be Friends album), as being a song recorded for Change of Habit.[9]","release_dates":"November 10, 1969 (1969-11-10) (USA)|||||","Production":"By 1969, Presley's future in Hollywood was under threat. Although still financially successful, mainly due to the \"make 'em quick, make 'em cheap\" attitude of Presley's manager Colonel Tom Parker, Presley's films had been making less profit in recent years.[1] When Parker had struggled to find any studio willing to pay Presley's usual $1 million fee, he struck a deal with NBC to produce one feature film, and a TV Special entitled 'Elvis'. NBC would pay Presley $1.25 million for both features, and Parker was happy in the knowledge that he was still able to earn $1 million for his client.[2]The film Change of Habit had been announced in 1967, with Mary Tyler Moore signing up in October 1968.[3] It was considered a Moore vehicle until January 1969 when Presley signed on to take the lead role.[3]Although set in New York City, the film was shot in the Los Angeles area and at the Universal Studios lot during March and April 1969. It was released nationwide in the United States on November 10, 1969 and spent four weeks on the Variety Box Office Survey, peaking at #17.[3]Mary Tyler Moore and Edward Asner would soon become co-stars of her self-named The Mary Tyler Moore Show, one of television's enduring hits from 1970-77. In Change of Habit, however, they shared no scenes.[4]","produced_by":"Joe Connelly","starring":"Elvis Presley|Mary Tyler Moore|","running_time":"93 minutes","music_by":"Billy Goldenberg|Buddy Kaye|Ben Weisman|","edited_by":"Douglas Stewart"}