{"country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Stephen Carpenter","story_by":"Michael Berry John Blumenthal","Plot":"Jewel thief Miles Logan participates in a $17 million diamond heist in Los Angeles. One of his accomplices, Deacon, turns on Miles and kills another member of the team before attempting to take the stone from Miles. The police arrive and Miles is forced to hide the diamond in the ductwork of a building being constructed. Deacon flees and Miles is arrested. Two years later, Miles is released from prison and attempts to reconnect with his girlfriend. She dumps him for lying to her about his criminal life, and Miles decides to go retrieve the diamond. He is dismayed to find that the building he hid the diamond in is now an LAPD police station. He goes inside and discovers that the stone is hidden in what is now the Robbery/Homicide detective bureau, which requires a key card to access.Miles returns later on disguised as an eccentric pizza deliveryman. While unable to gain access to the ducts, he does manage to steal an access card. Miles visits his forger Uncle Lou, who creates a fake badge and transfer papers that allow Miles to enter the building posing as Detective Malone. While trying to access the ducts, Miles inadvertently foils a prisoner escape and is teamed up with Detective Carlson. The pair are sent out on a call, where Miles quickly solves an apparent robbery. On the ride back they stumble upon a robbery being committed by Miles' getaway driver Tulley. Miles intervenes and arrests Tulley before the police can shoot him, but Tulley demands $50,000 to keep quiet about who Miles really is. Miles makes another attempt to locate the diamond but is interrupted by Carlson, who has discovered that Miles isn't who he claims to be. Miles convinces Carlson that he is from Internal Affairs. Miles tries to get back to searching for the diamond but he and Carlson are sent out on another call. While out, they capture a truckload of heroin belonging to a major dealer. Miles locates the diamond in the vent inside the evidence locker and finally retrieves it, but accidentally drops it into the load of heroin they seized. The FBI arrives and demands the heroin be turned over to them for testing.A panicked Miles suggests the FBI and his police unit use the heroin as bait in a sting. He arranges to be with the heroin in the delivery truck, but is soon joined by Tulley and Deacon. During the drug deal, Deacon tries to expose Miles as a cop to the drug runners. While everyone is distracted the police and FBI raid the deal. Deacon escapes with the diamond in an armored truck and the police and FBI follow as he approaches the border with Mexico. The police and FBI are forced to halt their pursuit at the border, but Miles steals a patrol car and continues after Deacon. Miles forces Deacon to wreck the truck and then offers him a deal: Deacon gives Miles the diamond and allows Miles to arrest him and in exchange Miles takes him back to the USA and cuts him back in on the diamond. Deacon agrees, and Miles immediately double-crosses him by handcuffing him to the wrecked truck for the Federales to find. Deacon draws a gun to shoot Miles but Miles turns and shoots him first, killing him.Miles walks back the US side of the border where the FBI demands he explain his actions. The police also want to know who he's working for as his fake credentials didn't check out. Miles tells them he's a Federales and has to get back to Mexico to explain everything to his fellow Federales. Miles gets a few inches over the border when Carlson stops him and reveals that he knows who Miles really is. Carlson refuses to arrest him since he's across the border, and the two shake hands before Miles heads off into Mexico with the diamond.","blue_streak":"Theatrical release poster","language":"English","Reception":"The film opened at #1 with a weekend gross of $19,208,806 from 2,735 theaters for a per venue average of $7,023.[3] It ended its run with $68,518,533 in North America, and $49,239,967 internationally for a total of $117,758,500 worldwide.[2]The film received mixed reviews. Rotten Tomatoes gives the film a score of 36% based on reviews from 69 critics.[4] [5][6]Roger Ebert praised the film giving it 3 stars out of 4.[7]","box_office":"$117.7 million[2]","cinematography":"David Eggby","directed_by":"Les Mayfield","release_dates":"September 17, 1999 (1999-09-17)|||||","produced_by":"Neal H. Moritz Toby Jaffe","starring":"Martin Lawrence Luke Wilson Dave Chappelle Peter Greene Nicole Parker William Forsythe","running_time":"93 minutes","Sequel":"There were plans for a sequel, but never materialized.[8][9][10][11] The screenplay was re-purposed and turned into the film Bad Company. [12]","music_by":"Edward Shearmur","edited_by":"Michael Tronick","budget":"$36 million[1]"}