{"country":"Mexico","distributed_by":"Nu Vision","Plot":"The film is constructed from three distinct stories linked by a car accident that brings the characters briefly together.The first segment stars Gael García Bernal and Vanessa Bauche as the title characters. Susana is Octavio's sister-in-law; however, Octavio is in love with her and does not like the way his brother, Ramiro, treats her. Octavio tries to persuade her to run away with him to get out from under Ramiro's abuse. Jarocho, a local thug, is happy after winning in a dog fight, so he decides to let his dog loose on some strays, but is stopped when a vagrant pulls out a machete from his junk cart; eventually, Jarocho sees Octavio's rottweiler, Cofi, wandering the streets, and lets his dog loose on it, but Cofi kills Jarocho's dog. Aware of this by his friend Jorge and needing to make money so that he and Susana can escape and start a life of their own, Octavio decides to become involved in the business of dog fighting, organized by Mauricio, owner of El Sabadaba, where the fights take place. Every time there is a fight, Jarocho enters a new dog, and everytime, Cofi kills it. After more than fifteen fights, Octavio makes enough money to run away with Susana, even paying Mauricio to get Ramiro beaten up. In revenge, Ramiro steals the money and leaves with his wife. Struggling financially, Octavio accepts a challenge by Jarocho to participate in a private fight, with no outside bets. Octavio's dog wins, but Jarocho shoots Cofi. In revenge, Octavio stabs Jarocho in the stomach. Pursued by Jarocho's thugs, Octavio finds himself in a car chase with Jorge, and the wounded dog. A collision follows; Jorge dies and Octavio is badly injured.The next segment stars Álvaro Guerrero and Goya Toledo. Daniel is a successful magazine publisher who leaves his family to live with his lover, Spanish supermodel Valeria. On the day they move together, Valeria's leg is severely broken in the accident with Octavio's car and she may be unable to continue working as a model. Valeria is using a wheelchair while she recuperates in the apartment she shares with Daniel. One day, her dog Richie disappears under a broken floorboard and stays there for days. The missing dog triggers serious tension for the couple, causing numerous fights which lead to doubts about their relationship on both sides. Trying to help the dog, Valeria re-injures her leg; Daniel finds her hours later, resulting in severe internal bleeding and eventually gangrene. Her doctor is forced to amputate the leg, removing any chance she might have had at returning to her modeling career. Once her leg is gone, Valeria realizes that her life is most likely ruined, since her sense of purpose, modeling, has been taken from her. Later, we see Daniel calling his estranged wife to hear her voice and then hanging up without speaking, suggesting either that he regrets his disloyalty to her, that he realizes that his attraction to Valeria was based only on her now lost beauty, or perhaps both.The final segment stars Emilio Echevarría and Lourdes Echevarría. The story follows the bedraggled vagrant that appears several times in the previous segments, pushing a junk cart accompanied by several mongrel dogs for whom he cares. Though he appears to live in perpetual squalor in an abandoned warehouse, he is in fact a professional hitman, known as El Chivo (The Goat). As revealed by Leonardo (a corrupt police commander), El Chivo is a former private school teacher who, embracing idealistic notions and goals, became involved in guerrilla movements, committing several terrorist attacks that landed him in prison for 20 years. When he got out, Leonardo started getting him jobs as a hitman. At times throughout the story, El Chivo tries to make contact with his daughter, Maru, whom he abandoned when she was a two-year-old child when he began his guerrilla involvement. Following El Chivo's wishes, Maru's mother told Maru that her father had died, instead of telling Maru the truth about her father's abandonment and prison sentence.As the story progress, El Chivo is hired by a businessman to kill his partner. El Chivo is about to make the kill when the film's central car crash interrupts him. During the chaos at the crash scene, El Chivo steals Octavio's money and takes his wounded dog Cofi to his home to nurture it. While El Chivo is away from the warehouse one day, following his target, Cofi, due to his proclivity for dog fighting, kills all of the other dogs in El Chivo's house. El Chivo is intensely upset and prepares to kill Cofi, but El Chivo forgives Cofi, figuring that Cofi does not know any better, and seeing Cofi's violence as a reflection of his own life as a hitman.Meanwhile, Ramiro and an accomplice are attempting to rob a bank when Ramiro is shot and killed by Leonardo's plain-clothes bodyguard. At the funeral, Octavio, seriously injured from the car accident, sees Susana for the first time since she and Ramiro fled with his money. Despite having been wronged, Octavio tries again to get Susana to run away with him, but she becomes angry with the fact that Octavio is willing to run away with her after she has just lost somebody she loves; he tells her that he is still going on with his plan to leave for Ciudad Juárez. A few days later, Octavio is shown waiting at the bus station for Susana. She never shows, and Octavio does not get onto the bus.Still grieving for his beloved dogs, El Chivo captures his intended victim, and, after learning that the victim is the client's half-brother, also captures his client. After shaving his unkempt beard and grooming his hair he leaves both men alive and chained to separate walls with a pistol within reach between them, their fate left undetermined. El Chivo then breaks into his daughter's house while she is away and leaves her a large bundle of money along with a message on her answering machine explaining what happened to him and why the family was split. Just before El Chivo was to tell his daughter Maru that he loves her, the answering machine stops recording. El Chivo then goes to an autoshop, where he sells the client's SUV. The mechanic asks him the dog's name, and El Chivo calls him \"Negro\" (Spanish for \"Black\"). After El Chivo receives the money for the car, Chivo and Negro walk away, disappearing into the horizon.","language":"Spanish","Themes":"The three overlapping stories all take place in Mexico City, but because of class division, there is severe segregation of economic classes with El Chivo squatting on the outskirts of town, Octavio living in a working-class settlement/neighborhood, and Valeria living in a luxury high-rise apartment.[5] If not for the car accident, these three characters would never interact. The upperclass is victimized in Amores perros even when they are the ones perpetuating crime, for instance, El Chivo is hired to kill a man’s business partner and eventually decides to leave both men to fight it out themselves. Although Ramiro works at a grocery store, he also participates in the underground economy by committing robberies. Octavio and El Chivo participate in the underground Mexican economy as well, in order to secure untaxed income and bring stability to their lives.[6]Amores perros contains domestic violence, gun violence, and animal cruelty.[7]Dogfighting is banned in most Latin American countries and exists as an element of the underground economy in some working class societies. Although violent, dogfighting provides an opportunity for Octavio to make money. This is true to life in the sense that participating in the underground economy gives people in the lower class the ability to make money and experience mobility. González Iñárritu was heavily criticized for his inclusion of dogfighting in the film but has said himself that although it is horrible, dogfighting is one of the harsh realities of Mexico City.[8]","box_office":"$20.9 million[3]","cinematography":"Rodrigo Prieto","production_company":"Zeta Entertainment Alta Vista Films","directed_by":"Alejandro González Iñárritu","Awards":"The film was met with very positive reviews from critics and received many nominations and awards. Review aggregate Rotten Tomatoes reports that 92% of critics have given the film a positive review based on 111 reviews, with an average score of 7.8/10, making the film a \"Certified Fresh\" on the website's rating system.","release_dates":"14 May 2000 (2000-05-14) (Cannes)|16 June 2000 (2000-06-16) (Mexico)||||","Production":"Produced by Zeta Film and AltaVista Films, production began on 12 April 1999.The DVD of Amores perros has a commentary track, by the director and the screenplay writer. A controversial aspect of the film is the dog fighting sequences. González Iñárritu explains that no dogs were harmed during the making of Amores perros. In the scenes where dogs are apparently attacking each other, they were actually playing. Their muzzles were covered with fine fishing line, so that they were unable to bite another dog. In the shots where dogs are apparently dead or dying, they were sedated (under supervision of the Mexican SPCA). The grittiness of the scenes is amplified by quick cuts and sound effects. Another unusual aspect of the production of Amores perros was the danger to the cast and film crew while filming in the poor parts of Mexico City. The director and some of the crew were actually robbed by street gangs.","produced_by":"Alejandro González Iñárritu","starring":"Emilio Echevarría Gael García Bernal Goya Toledo Álvaro Guerrero Vanessa Bauche Jorge Salinas Adriana Barraza","running_time":"153 minutes[1]","amores_perros":"US release poster","music_by":"Gustavo Santaolalla","edited_by":"Alejandro González Iñárritu Luis Carballar Fernando Pérez Unda","written_by":"Guillermo Arriaga","budget":"$2.4 million[2]"}