{"based_on":"Mr. Blandings Builds His Dream House  by Melvin Frank Norman Panama Characters  by Steven Gary Banks Claudia Grazioso","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Hank Nelken","story_by":"Hank Nelken (screen story)","Plot":"Two years later after the events of Are We There Yet?, Nick Persons (Ice Cube) has married Suzanne (Nia Long) and moved in with her, Kevin (Philip Daniel Bolden), and Lindsey (Aleisha Allen) into his apartment, also purchasing a 2007 Cadillac Escalade (after the destruction of his Lincoln Navigator SUV). He has also sold his sports memorabilia store to his best friend, Marty (played by Jay Mohr in the first film). While getting ready for an interview with Magic Johnson, Suzanne tells Nick that she is pregnant and they later find out that there will be twins.For more space, Suzanne and Nick go check out a house although Lindsey and Kevin - mainly the former - are against it. They meet Chuck Mitchell Jr. (John C. McGinley) there, and after some talking Nick decides to take the house. But he didn't get it inspected first and they find mold in the house, so Nick is angry with Chuck as he almost destroys their house. Meanwhile, Lindsey sneaks out to go to a party and when Nick finds out, he grounds her. He finally decides to fire Chuck, which causes Suzanne to take the kids and move to the guest house, with the parting shot You're the one who's tearing this family apart! After taking some time to think, Nick decides to fix the house on his own and also to apologize to Chuck. Chuck responds by bringing his friends to help, including Lindsey and Kevin.When Suzanne goes into labor with the hospital half an hour away, Nick, Kevin and Lindsey have to deliver the babies. Chuck tries to get there, but his truck breaks down and he power walks down to the house. While she's still in labor, Nick gets a call from Magic. After Suzanne gives birth to twins, the movie ends six months later with a big barbecue in their backyard at which Nick debuts his new magazine.","language":"English","box_office":"$58.4 million[1]","are_we_done_yet?":"Theatrical release poster","cinematography":"Jack Green","production_company":"Revolution Studios RKO Pictures Cube Vision","directed_by":"Steve Carr","release_dates":"April 4, 2007 (2007-04-04)|||||","produced_by":"Ted Hartley Ice Cube Matt Alvarez Todd Garner","starring":"Ice Cube Nia Long John C. McGinley Aleisha Allen Philip Daniel Bolden","running_time":"92 minutes","music_by":"Teddy Castellucci","edited_by":"Craig Herring","Release":"Despite being panned by the critics, the film has made $58,388,068 worldwide.[1]The film holds an 8% approval rating on aggregate review site Rotten Tomatoes, based on 93 collected reviews, with an average score of 3.3 out of 10. The sites consensus reads: \"Are We Done Yet? plays it way too safe with generic slapstick and uninspired domestic foibles.\"[3] Metacritic gave the film a weighted average score of 36 out of 100, based on 21 sampled reviews, indicating \"generally unfavorable reviews.\"[4] The film was nominated for a Golden Raspberry Award for Worst Prequel, Remake, Rip-off or Sequel (lost to I Know Who Killed Me).[citation needed]The Are We Done Yet? Blu-ray Disc, DVD, and UMD was released on August 7, 2007. Special features include:","budget":"$28 million"}