{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Emily Eden (Griffith), a hardened New York City homicide detective, goes undercover to investigate the murder of a Hasidic diamond-cutter. To do so, she lives with the family of the Hasidic rebbe, an elderly Holocaust survivor who is revered for his wisdom and compassion toward his fellow Jews. He says to her, \"You and I have something in common: We are both intimately familiar with evil. It does something to your soul.\"While living with the rebbe's family, she takes a liking to his son, Ariel (Eric Thal), a young man who works as a diamond-cutter but teaches in the yeshiva and is expected to follow his father as the next rebbe. In addition to keeping all 613 Mitzvot, he is waiting for his intended, or basherte, the daughter of a Paris rebbe whom he has not yet actually met. They are the subjects of an arranged marriage, but he believes that she is his soul mate, chosen by God. He is also studying the Kabbalah, which is regarded as rather daring for a man under 40. Its discussion of sexual intimacy is restrained but specific, as well as a metaphor for the relationship between Man and God.The crisis of the film is when Emily finds out that the \"inside man\" in the murder plot is the rebbe's adopted daughter Mara (Tracy Pollan), who had been living a disorderly life until the future murder victim, Yaakov Klausman (Jake Weber), introduced her to the rebbe. Afterwards, she joined the community as a repentant baalat tshuva, \"one who has returned,\" until a person from her past approached her and she let him into the Diamond Center to steal diamonds worth about $750,000 and kill Yaakov.This is all Emily needs to solve the case and arrest Mara as an accessory to murder (or for the crime of felony murder); but when Emily returns to the rebbe's home with Ariel, she finds that Mara has taken the rebbe's daughter hostage. After Emily attempts to negotiate, Mara knocks her out; and Ariel shoots Mara with Emily's gun. Ariel comments that sometimes an evil deed has a partially good result. (The filming of the shootout took place at the Eldridge Street Synagogue on the Lower East Side of Manhattan.)The film ends with the wedding of Ariel and his basherte, Shayna Singer, which Emily watches from a distance.","language":"English","Reception":"A Stranger Among Us received negative reviews from critics. It currently holds a 23% rating on Rotten Tomatoes based on 39 reviews.[2] Some of the criticism of A Stranger Among Us is based on comparisons with the Academy Award-winning film Witness, which has a superficially similar plot. Similarly, Lumet's earlier film Fail-Safe was unfavorably compared to Dr. Strangelove, but in that case both films have subsequently achieved cult status. Griffith's performance in the lead role has also been heavily criticized, for which her role won her the Razzie Award for Worst Actress (also for the year's Worst Picture, Shining Through), while Tracy Pollan was nominated for Worst Supporting Actress.","box_office":"$12,282,994","cinematography":"Andrzej Bartkowiak","production_company":"Hollywood Pictures","directed_by":"Sidney Lumet","release_dates":"July 17, 1992 (1992-07-17)|||||","produced_by":"Steve Golin Howard Rosenman Sigurjón Sighvatsson","starring":"Melanie Griffith|","running_time":"109 minutes","music_by":"Jerry Bock","edited_by":"Andrew Mondshein","a_stranger_among_us":"Theatrical Release Poster","written_by":"Robert J. Avrech","budget":"$33,000,000"}