{"based_on":"Captain Corelli's Mandolin  by Louis de Bernières","country":"France United Kingdom United States","distributed_by":"North America Universal Studios International Miramax Films","screenplay_by":"Shawn Slovo","Plot":"Greece's Ionian Islands are invaded by the Italian army when it brings a large garrison and a few Germans to the tranquil island of Cephalonia, whose inhabitants surrender immediately. Captain Antonio Corelli, an officer of the Italian 33rd Acqui Infantry Division, has a jovial personality and a passion for the mandolin, and trains his battery of men, (who have never fired a shot), to choral sing. Initially he alienates a number of villagers, including Pelagia, the daughter of the village doctor. She is an educated and strong-willed woman. At first offended by the Italian soldier's behaviour, she slowly warms to Corelli's charm, and mandolin playing, as they are forced to share her father's home after the doctor agrees to put him up in exchange for medical supplies.When Pelagia's fiance, Mandras, a local fisherman, heads off to war on the mainland, the friendship between Antonio and Pelagia grows. Her beauty and intelligence have captured Corelli's heart, and his fondness for the village's vibrant community has caused him to question his reasons for fighting. Corelli, and his battery of musical troops, becomes a part of the villagers' lives; but the moment is fleeting. As the war grows closer, Antonio and Pelagia are forced to choose between their allegiances and the love they feel for one another.The Italian government surrenders to the Allies, and the Italian troops happily prepare to return home. However, their erstwhile allies, the Germans, insist on disarming them, intemperately and violently. The Greeks are also exposed to the brutality of the incoming Germans, and arrange with the Italians to use their arms in a brief but futile resistance. For this, the German High Command has thousands of the Italian troops shot as traitors. Corelli survives when one of his soldiers shields him from the fusillade of the German executioners' bullets with his body, and falls dead on top of him. Mandras finds Corelli, still alive among the pile of massacred soldiers, and takes him to Pelagia and the doctor for treatment and recovery, and then to a boat to escape the island. As a result of Pelagia's questioning, Mandras admits that he rescued Corelli from the heap of dead soldiers because he wanted to re-kindle their love. But it does no good and the couple part. Earlier, on one of Mandras's return visits to Cephallonia, he advises Pelagia that the reason he never replied to her many love letters is because he is illiterate.In 1947, Pelagia receives a parcel from Italy containing a record of the tune Corelli wrote for her, but no note. An earthquake destroys much of the village including the doctor's house; but island life continues, and, soon after, Corelli returns to Pelagia.","captain_corelli's_mandolin":"Theatrical release poster","language":"English Greek German Italian","box_office":"$62,112,895[2]","cinematography":"John Toll","production_company":"StudioCanal Working Title Films","directed_by":"John Madden","release_dates":"4 May 2001 (2001-05-04) (UK)|20 June 2001 (2001-06-20) (France)|17 August 2001 (2001-08-17) (US)|||","produced_by":"Tim Bevan Eric Fellner Mark Huffam Kevin Loader","starring":"Nicolas Cage Penélope Cruz John Hurt Christian Bale","running_time":"129 minutes[1]","music_by":"Stephen Warbeck","edited_by":"Mick Audsley","Release":"The film opened at number six at the US box office, taking on $7,209,345 in its opening weekend. It brought in only $25,543,895 domestically, but brought in an additional $36,569,000 overseas for a total of $62,112,895 worldwide. The movie cost $57 million to produce.[2]The film's plot deviated somewhat from the novel's, with many of the book's tragic episodes softened. It maintains a 29% rating according to Rotten Tomatoes with the consensus: \"The cinematography is gorgeous, but the movie plays it fast and loose with history and the novel it was adapted from. Mostly, the movie fails because the romance between the leads strains credulity and the story is largely uninvolving.\"[3]Roger Ebert gave the film a poor review, two stars out of four, saying: \"What we get is kind of a condensed version of some of the sights and sounds of the novel, without the heart, the spirit and the juicy detail.\"[4]Peter Bradshaw, writing in The Guardian, said: \"What a droopy, disappointing film this is. It has some of the unhappiest casting to be seen and dodgiest accents to be heard in the cinema, the worst offender being the barrel-chested, horse-faced Nicolas Cage as a captain in the Italian army...\".[5]Cruz's performance earned her a Golden Raspberry Award nomination for Worst Actress (also for Blow and Vanilla Sky).[6]","budget":"$57 million[2]"}