{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Jane Richards (Dorothy Dandridge) is a new teacher, beginning her career at a rural African-American elementary school in Alabama. One of the students in her fourth-grade class is C.T. Young (Philip Hepburn), who, although bright and generally not a troublemaker, is nonetheless markedly uninterested in school and has become accustomed to taking two years to advance through each grade level. Miss Richards becomes determined to get through to C.T. and have her class be the first that does not take him two years to complete, though the school's other teachers have given up on him as \"a backward child\". The school's principal (Harry Belafonte) also harbors his doubts about C.T., but he admires Miss Richards' enthusiasm and endorses her efforts.Miss Richards' efforts with C.T. begin to pay dividends and his grades improve somewhat, but all of her progress with him seems to be undone when Tanya (Barbara Ann Sanders), another student in the class and C.T.'s closest friend, dies after being stricken with a viral pneumonia. Devastated at the loss, C.T. runs away from school for a time, and even upon his return, immediately starts a schoolyard fight. Insistence that he apologize for his actions causes him only to completely withdraw and isolate himself from his teacher and classmates. Frustrated and saddened, Miss Richards' must return to giving C.T. the failing marks that had been his previous pattern.One day, however, she overhears C.T. helping another student with arithmetic, revealing to her that despite his stubborn refusal to participate in class since returning to school, he has actually been continuing to learn. Seeing this demonstration of knowledge, she is heartened and quietly changes his most recent failing grade to an 'A'. C.T.'s reintegration into the class is completed when he calmly handles a situation in which a swarm of bees invades the classroom, following the queen bee which had flown in. As the other students, and even Miss Richards, panic and swat at the bees, C.T. calmly collects the queen and carries it outside with the swarm following him.The school year ends with the Miss Richards' class observing a caterpillar emerge from its cocoon transformed into a butterfly. Miss Richards notes that it is reborn, \"just as you and I will be born again someday, and everyone we've ever known or loved\", and that witnessing the butterfly's first flight represents \"a wonderful promise of things to come.\" As he leaves to begin his summer vacation, C.T. offers Miss Richards a final validation of the time she had invested in him by stopping to tell her that he loves her.","language":"English","Reception":"Bright Road was not commercially successful[3] and was criticized for having \"dealt too timidly with racial and economic questions.\"[4] Dandridge, however, had been specifically attracted to the lack of racial conflict in Bright Road's story. She wrote that she was \"profoundly fond of ... a theme which showed that beneath any color skin, people were simply people. I had a feeling that themes like this might do more real good than the more hard-hitting protest pictures. I wanted any white girl in the audience to look at me performing in this film and be able to say to herself, 'Why, this schoolteacher could be me.'\"[5]","box_office":"$252,000[1]","cinematography":"Alfred Gilks","directed_by":"Gerald Mayer","release_dates":"April 17, 1953 (1953-04-17)|||||","Production":"\"See How They Run\" was Mary Elizabeth Vroman's first published short story, written while she herself was a schoolteacher in rural Alabama. First published in Ladies' Home Journal in 1951, it also appeared in Ebony magazine in 1952. When Metro-Goldwyn-Mayer purchased the rights to adapt the story to film, Vroman helped write the screenplay, in so doing, becoming the first black member of the Screen Writers Guild.[2]Belafonte and Dandridge were both known to audiences for their singing talents and Bright Road showcases each of them in that light. Early in the film, Belafonte gives the debut performance of his song \"Suzanne (Every Night When The Sun Goes Down)\". Later, Dandridge briefly sings words from the Alfred Tennyson poem \"The Princess: Sweet And Low\" to the tune of a lullaby. Belafonte and Dandridge would go on to co-star again the following year in the film Carmen Jones.","starring":"Dorothy Dandridge Philip Hepburn Harry Belafonte Barbara Ann Sanders","running_time":"69 minutes","Box Office":"According to MGM records, the film only earned $179,000 in the US and Canada and $73,000 elsewhere, resulting in a loss of $263,000.[1]","music_by":"David Rose","edited_by":"Joseph Dervin","written_by":"Emmet Lavery Mary Elizabeth Vroman","budget":"$377,000[1]"}