{"country":"United States","distributed_by":"Warner Bros.","Plot":"Years ago, a mob boss named Lucio Malatesta (George Touliatos) pinned the murder of rival Sammy Carboni (Gino Marrocco) on another rival named Angelo Allieghieri (Anthony Quinn), which led to Sammy's son Gianni vowing revenge.Frankie Delano (Sylvester Stallone) has spent his life safeguarding Angelo as well as Angelo's daughter, Jennifer Barrett (Madeleine Stowe), whose unsavory husband Kip Barrett (Harry Van Gorkum) has had their young son Rawley (Ezra Perlman) placed in a boarding school against Jennifer's wishes.Jennifer was raised by her adoptive parents Whitney Towers (John Gilbert) and Peggy Towers (Dawn Greenhalgh) and is not aware that Angelo is her father.After Angelo is killed in a restaurant by a hit man named Bruno (Billy Gardell), Frankie introduces himself, tells Jennifer who he is and what he has been doing.A neurotic mess, Jennifer can barely handle the news that Kip is a philanderer, let alone the revelation that she is a gangster's daughter. But a DVD prepared by Angelo in the case of just such an event convinces Jennifer that it's the truth.Jennifer certainly doesn't want a full-time bodyguard, even Frankie. She ditches Kip and then falls for Italian romance novelist Marcello (Raoul Bova), who lectures at her book club. Frankie has suspicions about Marcello, but his job is to stay on the sidelines.Frankie rescues Jennifer from a string of attacks. With many of Angelo's enemies, including Lucio Malatesta, terminated, Frankie allows her to visit Italy with Marcello. But it turns out that Marcello is actually Gianni Carboni, who had Angelo killed. And now Gianni plans to kill Jennifer.It's up to Frankie to protect her one more time.","avenging_angelo":"Theatrical release poster","language":"English","box_office":"$824,597[1]","directed_by":"Martyn Burke","release_dates":"August 30, 2002 (2002-08-30) (Italy)|||||","produced_by":"Tarak Ben Ammar Elie Samaha Stanley Wilson","starring":"Sylvester Stallone Madeleine Stowe Anthony Quinn Raoul Bova Harry van Gorkum","running_time":"96 minutes","music_by":"Bill Conti","Release":"The movie was met with mostly negative reviews by most critics. Scott Weinberg for eFILMCRITICS.com wrote that \"Sly - despite his seemingly unquenchable desire to prove me otherwise - deserves better than this\".[4]Rotten Tomatoes gives it a 13% freshness rating, based on 8 reviews.[5]","written_by":"Will Aldis Steve Mackall","budget":"$17 million"}