{"based_on":"Cheaper by the Dozen 1948 novel  by Ernestine Gilbreth Carey Frank Bunker Gilbreth, Jr.","country":"United States","distributed_by":"20th Century Fox","Comparison to real life":"The birth order in which Cheaper by the Dozen portrays some of the children is not the same order in which the real Gilbreth children were born. For example, Robert (who was actually born in 1920) is shown as being born in 1922, as the last child after Jane (who was actually born in 1922). This is reversed in the movie's sequel.In real life, Mary, who was the second child, died in 1912, aged 5. However, in the film Cheaper by the Dozen, Mary is placed as the third child after Ernestine, and has few or no lines.[2]Both Frank and Lillian Gilbreth were important figures in real life. The voice-over at the end of the film informs the audience that Lillian went on to become the world's leading efficiency expert and the TIME magazine Woman of the Year in 1948. Additionally, in 1984, her image was put on a US postal stamp.","screenplay_by":"Lamar Trotti","Plot":"The parents are the time and motion study and efficiency experts Frank Bunker Gilbreth, Sr. (Clifton Webb) and psychologist Lillian Moller Gilbreth (Myrna Loy). The title comes from one of Gilbreth's favorite jokes, which played out in the movie, that when he and his family were out driving and stopped at a red light, a pedestrian would ask: \"Hey, Mister! How come you got so many kids?\" Gilbreth would pretend to ponder the question carefully, and then, just as the light turned green, would say: \"Well, they come cheaper by the dozen, you know\", and drive off.The story opens with typical days in the lives of a family in the 1920s, with 12 children and an efficiency engineer as the parent. This includes scenes where Frank employs his unorthodox teaching methods on his children, and classic clashes between conservative parents and their children's desire for more freedom (flashier clothing, make up, etc.). Frank takes every opportunity to study motion and increase efficiency, and even films his children's tonsillectomies to see if there are ways to streamline the operation.After Frank's death, the family agrees that Lillian will continue with her husband's work; this enables the family to remain in their house (rather than move to their grandmother's in California), although, with a widowed working mother and one income, the children will have to assume much greater responsibilities.","language":"English","box_office":"$4,425,000 (US)[1]","cinematography":"Leon Shamroy","production_company":"Twentieth Century Fox Film Corporation","directed_by":"Walter Lang","narrated_by":"Jeanne Crain","release_dates":"April 17, 1950 (1950-04-17)|||||","cheaper_by_the_dozen":"Theatrical release poster","produced_by":"Lamar Trotti","starring":"Clifton Webb Myrna Loy Jeanne Crain Betty Lynn","running_time":"85 min.","Sequel":"Because of the success of Cheaper by the Dozen, Gilbreth and Carey wrote a follow-up to their book, entitled Belles on Their Toes (1950), which was made into a 1952 movie by 20th Century Fox.","music_by":"Cyril J. Mockridge","edited_by":"James Watson Webb, Jr."}