{"Cast":"Alex Proyas based The Strangers on Richard O'Brien's character in The Rocky Horror Show, Riff Raff. Proyas said, \"I had Richard in mind physically when I wrote the character, because I had these strange, bald-looking men with an ethereal, androgynous quality.\" When Proyas visited London to cast for the film, he met with O'Brien and found him suitable for the role.[7]Kiefer Sutherland's character Daniel P. Schreber is named after Daniel Paul Schreber, a German judge who suffered from narcissistic, paranoid psychosis and possibly schizophrenia and whose autobiographical Memoirs of My Nervous Illness (Denkwürdigkeiten eines Nervenkranken) the film's plot alludes to at various instances.[8][9][10] Hurt was originally asked to play Dr. Schreber.[7]","country":"United States","distributed_by":"New Line Cinema","story_by":"Alex Proyas","dark_city":"Theatrical release poster","language":"English","box_office":"$27.2 million[2]","cinematography":"Dariusz Wolski","production_company":"Mystery Clock Cinema","directed_by":"Alex Proyas","Home media":"The film was released in VHS video format on March 2, 1999.[68] The Region 1 Code widescreen edition of the film was released on DVD in the United States on July 29, 1998. Special features for the DVD include two audio commentary tracks, one with film critic Roger Ebert, and one with director Alex Proyas, writers Lem Dobbs and David Goyer, and production designer Patrick Tatopoulos. The DVD also includes biographies, filmographies, comparisons to Fritz Lang's Metropolis, set designs, and the theatrical trailer.[69]A director's cut of Dark City was also officially released on DVD and Blu-ray Disc on July 29, 2008. The director's cut removes the opening narration, which Proyas felt explained too much of the plot, and restores it to its original location in the film. It also includes 15 minutes of additional footage, mostly consisting of extended scenes with additional establishing shots and dialogue.[70] Expanded audio commentaries by Ebert, Proyas, Dobbs and Goyer are included, along with several new documentaries. The Blu-ray disc additionally includes the original theatrical cut and the special features from the 1998 DVD release.","release_dates":"February 27, 1998 (1998-02-27)|||||","Production":"Proyas referenced film noir of the 1940s and the 1950s (such as The Maltese Falcon) an influence for the film.[15] It has additionally been described as Kafkaesque, and Proyas cited the TV series The Twilight Zone as a conscious influence.[16] Proyas wanted the film, though nominally science fiction, to have an element of horror to unsettle the audience.[7]Proyas co-wrote the screenplay with Lem Dobbs and David S. Goyer. Goyer had written The Crow: City of Angels, the sequel to Proyas's 1994 film The Crow; Proyas invited Goyer to co-write the screenplay for Dark City after reading Goyer's screenplay for Blade, which had yet to be released. Writers Guild of America initially protested at crediting more than two screenwriters for a film, but it eventually relented and credited all three writers.[17] Proyas originally conceived a story about a 1940s detective who is obsessed with facts and cannot solve a case where the facts do not make sense. \"He slowly starts to go insane through the story,\" says Proyas. \"He can't put the facts together because they don't add up to anything rational.\"[18] In the process of creating the fictional world for the character of the detective, Proyas created other characters, shifting the focus of the film from the detective (Bumstead) to the person pursued by the detective (Murdoch). Proyas envisioned a robust narrative where the audience could examine the film from the perspective of multiple characters and focus on the plot.[15]When Proyas finished his preceding film The Crow in 1994, he approached production designer Patrick Tatopoulos to draw concepts for the world in which Dark City takes place.[19] The city where the story takes place was entirely constructed on a set; no practical locations were used in the film.[18] Tatopoulos described the city:[20]The movie takes place everywhere, and it takes place nowhere. It's a city built of pieces of cities. A corner from one place, another from some place else. So, you don't really know where you are. A piece will look like a street in London, but a portion of the architecture looks like New York, but the bottom of the architecture looks again like a European city. You're there, but you don't know where you are. It's like every time you travel, you'll be lost.The production design included themes of darkness, spirals, and clocks. There appears to be no sun in the city's world, and spiral designs that shrink when approached were used in the film. A major clock in the film shows no hours; Tatopoulos said, \"But in a magical moment it becomes something more than just a clock.\"[20] The production designer created the city architecture to have an organic presence with the structural elements.[21]The Strangers are energy beings who reside in dead human bodies. When design first started, the filmmakers considered having the Strangers be bugs underneath but decided that the bug appearance was overused. Tatopoulos said Proyas wanted to make the Strangers energy beings, \"Alex called me and said he wanted something like an energy that kept re-powering itself, re-creating itself, re-shaping itself, sitting inside a dry piece of human shape.\"[22] The Strangers reside in a large underground amphitheater for their lair, where a human bust hides a large clock and a spiraling device changes the layout of the city above. The set for the lair was fifty feet in height, where an average set is thirty-six feet. The lair set was built on a fairground in Sydney, Australia. The film's budget was $30–40 million,[23] so the crew used inexpensive techniques to design the set, such as stretching canvas onto welded metal frames. The lair also had a rail conveyance that appeared expensive. Tatopoulos said, \"We had, obviously, a car built, but we had just one built. We laid some rail for it to ride on. We made a section of corridor that we kept driving through all the time, and you end up believing this thing is running along forever.\" Proyas originally wanted the rail car to roll by various rooms, which was not feasible for the budget, so Tatopoulos and the crew used \"replaceable elements and strong design textures\" to mimic the impression of various rooms.[24]The film soundtrack was released on February 24, 1998 by TVT Records label.[25] It features music from the original score by Trevor Jones, and versions of the songs \"Sway\" and \"The Night Has a Thousand Eyes\" performed by singer Anita Kelsey. It also includes music by Hughes Hall from the trailer,[26] a song by Echo & the Bunnymen that played over the final credits, as well as songs by Gary Numan and Course of Empire that did not appear in the film. The music for the film was edited by Simon Leadley and Jim Harrison.[27]","Similarities to other works":"The film's style is often compared to that of the works of Terry Gilliam (especially Brazil).[28][29][30][31][32][33][34] Some stylistic similarities have also been noted to Jean-Pierre Jeunet and Marc Caro's 1995 film The City of Lost Children,[35][36] another film inspired particularly by Gilliam (Gilliam had presented Jeunet's & Caro's previous film Delicatessen in North America,[37][38] another film by Jeunet & Caro that was a deliberate homage to Gilliam's style).The Matrix was released one year after Dark City and was also filmed at Fox Studios in Sydney using some of the same sets.[39] Comparisons have been made between scenes from the movies, making note of similarities in both cinematography and atmosphere, as well as the plot.[40]Fritz Lang's 1927 movie Metropolis was a major influence on the film, showing through the architecture, concepts of the baseness of humans within a metropolis, and general tone.[41] In one of the documentary shorts featured on the director's cut, the influence of the early German films M and Nosferatu are mentioned.One of the last scenes of the movie, in which buildings \"restore\" themselves, is strikingly similar to the last panel of the Akira manga. Proyas called the end battle a \"homage to Otomo's Akira\".[42]When Christopher Nolan first started thinking about writing the script for Inception, he was influenced by \"that era of movies where you had The Matrix, you had Dark City, you had The Thirteenth Floor and, to a certain extent, you had Memento, too. They were based in the principles that the world around you might not be real\".[43]The film bears similarities to the Russian novel The Doomed City by Russian sci-fi writers Arkady and Boris Strugatsky. The novel involves an artificial city surrounded by obstacles (wall, dump, desert) with an artificial sun where people from different time periods and countries are put together in one place as an experiment, with their professions changing constantly.The film also has numerous similarities both in style and plot development to the short story \"The Tunnel under the World\".","running_time":"100 minutes (theatrical cut) 111 minutes (director's cut)","Release":"Dark City was titled Dark World and Dark Empire leading up to the film's release. Warner Bros. wanted the filmmakers to consider the alternate titles due to the release of similarly titled Mad City in the same time frame, but Dark City was ultimately kept as the final title.[15] The film was originally scheduled to be released in theaters on October 17, 1997,[17] and it was later scheduled for January 9, 1998.[15] The film would premiere in theaters nationwide in the United States on February 27, 1998, screening at 1,754 cinemas.[2]","budget":"$27 million[1]","screenplay_by":"Alex Proyas Lem Dobbs David S. Goyer","Plot":"John Murdoch (Rufus Sewell) awakens in a hotel bathtub, suffering from amnesia. He receives a phone call from Dr. Daniel Schreber (Kiefer Sutherland), who urges him to flee the hotel to evade a group of men who are after him. During the phone talk, Murdoch discovers the corpse of a brutalized, ritualistically murdered woman, along with a bloody knife. He flees the scene, just as the group of men (known as the Strangers) show up to investigate the room.Eventually Murdoch learns his own name, and finds he has a wife named Emma (Jennifer Connelly). He is also sought by police inspector Frank Bumstead (William Hurt) as a suspect in a series of murders committed around the city, though he cannot remember killing anybody. While being pursued by the Strangers, Murdoch discovers that he has mind powers–which the Strangers also possess, and refer to as \"tuning\"—and he manages to use these powers to escape from them.Murdoch explores the city, where nobody realizes that it is always nighttime. At midnight, he watches as everyone except himself falls asleep as the Strangers stop time and physically rearrange the city as well as changing people's identities and memories. Murdoch learns that he comes from a coastal town called Shell Beach, a town familiar to everyone, though nobody knows how to leave the city to travel there, and all of his attempts to do so are unsuccessful for varying reasons. Meanwhile, the Strangers inject one of their men, Mr. Hand (Richard O'Brien), with memories intended for Murdoch in an attempt to predict his movements and track him down.Murdoch is eventually caught by inspector Bumstead, who acknowledges he is innocent, and by then has his own misgivings about the nature of the city. They confront Dr. Schreber, who explains that the Strangers are endangered extraterrestrial parasites who use corpses as their hosts. Having a hive mind, the Strangers have been experimenting with humans to analyze their individuality in the hopes that some insight might be revealed that would help their race survive.Schreber reveals that Murdoch is an anomaly who inadvertently awoke during one midnight process, when Schreber was in the middle of imprinting his latest identity as a murderer. The three embark to find Shell Beach, but it exists only as a billboard on a wall at the edge of the city. Frustrated, Murdoch and Bumstead break through the wall, revealing outer space on the other side. The men are confronted by the Strangers, including Mr. Hand, who holds Emma hostage. In the ensuing fight Bumstead and one of the Strangers fall through the hole, revealing the city as an enormous space habitat surrounded by a force field.The Strangers bring Murdoch to their home beneath the city and force Dr. Schreber to imprint Murdoch with their collective memory, believing Murdoch to be the final result of their experiments. Schreber betrays them by inserting false memories in Murdoch which artificially reestablish his childhood as years spent training and honing his psychokinetic skills and learning about the Strangers and their machines. Murdoch awakens, fully realizing his skills, frees himself and battles with the Strangers, defeating their leader Mr. Book (Ian Richardson) in a psychokinetic fight high above the city.After learning from Dr. Schreber that Emma's personality is gone and cannot be restored, Murdoch exercises his new-found powers, amplified by the Strangers' machine, to create an actual Shell Beach by flooding the area within the force field with water and forming mountains and beaches. On his way to Shell Beach, Murdoch encounters Mr. Hand and informs him that the Strangers have been searching in the wrong place—the mind—to understand humanity. Murdoch turns the habitat toward the star it had been turned away from, and the city experiences sunlight for the first time.He opens the door leading out of the city, and steps out to view the sunrise. Beyond him is a pier, where he finds the woman he knew as Emma, now with new memories and a new identity as Anna. Murdoch reintroduces himself as they walk to Shell Beach, beginning their relationship anew.","Setting":"The film is set in a 1940s era metropolitan city placed on an enormous flat-shaped space habitat, which has its own force field and an artificial atmosphere to provide air. It is located close to an unnamed star, but since The Strangers cannot stand light, the city is turned away from it in order to keep it in perpetual nighttime. However, due to this eternal darkness, every citizen has to be put to sleep every night at midnight, and the clocks must be stopped and restarted in order to keep the appearance that no time has passed. All of the residents are completely unaware of the city's true nature and believe that they are still on Earth, although the Earth has not been directly referenced. Due to the 1940s era clothing, vehicles, buildings, and culture, one can assume that the Strangers have committed mass abductions on Earth during the 1940s and brought them to the habitat.A frequently mentioned location in the city is Shell Beach, of which Murdoch has memories growing up. However, Shell Beach is actually non-existent, existing on city maps and frequently mentioned by citizens; however, nobody knows how to actually go to Shell Beach. In many scenes of the film, Murdoch is seen frequently attempting to arrive at Shell Beach, but always ultimately failing (the train that runs to Shell Beach doesn't stop at any station, no other trains run there, the buses don't drive there, etc.). Eventually, Schreber reveals that Shell Beach is just a poster on an edge of the city. In the end, Murdoch uses his powers to create an actual Shell Beach on the outer side of the habitat, providing access to it.The Strangers, as noted by Schreber, are endangered extraterrestrial parasites. They use corpses of previous citizens as their hosts, their real form being bio-luminiscent creatures shaped like spiders. If their body dies, the creature will venture out of the corpse from the top of the head and seek another body to host. In their human form, all strangers are pale, bald men, and only one Stranger was seen taking the form of a child.The Strangers are dying in numbers, and the ones on the habitat are the last of their race. They have a group mind to share, and they have abducted humans a few years before the story started. They have been trying to understand the individuality of a human mind, believing that it holds the key to ensure their survival. However, as noted by Murdoch itself, they have been trying to understand the human mind, which he believes that \"it is the wrong place to search\" in order to understand humanity, and stating that the human soul is the key to the individuality of a human being.The Strangers are sensitive to light, which explains perpetual nighttime, and they are sensitive to chlorine and water in general, which is why Schreber spends his free time in a public pool, knowing that they would try to avoid it. However, one Stranger visited him in a public pool without any effect, although his facial expression shows him being revolted at the smell. All the Strangers are dressed in black overcoats and wear hats.The Strangers have the powers to alter entire structures at will, raising buildings and tearing down others in mere seconds. They are also able to expand or narrow a room and alter its general appearance (replacing furniture, wallpaper, etc.). They are able to freeze every human being they control, during which they alter memories of several citizens to completely different personalities, also altering their living space. They do this every few hours, where they also alter the time back in order to keep the idea of citizens still living in a single day. They must be careful to change the identities of every citizen often, otherwise they will suspect their surroundings and grow paranoid (as shown when Murdoch is confronted by a man who hasn't been altered in a while, and who committed suicide). Schreber is their human contact, a former Earth psychiatrist, who is aware of their existence and their plans but is forced to co-operate and alter minds for them in exchange for his life.","Themes":"One of the things that we're exploring in this film, is what it is that makes us who we are. And, when you strip an individual of his identity, is there some spark, some essence there that keeps them being human, gives them some sort of identity?Theologian Gerard Loughlin interprets Dark City as a retelling of Plato's Allegory of the Cave. For Loughlin, the city dwellers are prisoners who do not realize they are in a prison. John Murdoch's escape from the prison parallels the escape from the cave in the allegory. He is assisted by Dr. Schreber, who explains the city's mechanism as Socrates explains to Glaucon how the shadows in the cave are cast. Murdoch however becomes more than Glaucon; Loughlin writes, \"He is a Glaucon who comes to realize that Socrates' tale of an upper, more real world, is itself a shadow, a forgery.\"[12]Murdoch defeats the Strangers who control the inhabitants and remakes the world based on childhood memories, which were themselves illusions arranged by the Strangers. Loughlin writes of the lack of background, \"The origin of the city is off–stage, unknown and unknowable.\" Murdoch now casts new shadows for the city inhabitants, who must trust his judgment. Unlike Plato, Murdoch \"is disabused of any hope of an outside\" and becomes the demiurge for the cave, the only environment he knows.[12]The city in Dark City is described by Higley as a \"murky, nightmarish German expressionist film noir depiction of urban repression and mechanism\". The city has a World War II dreariness reminiscent of Edward Hopper's works and has details from different eras and architectures that are changed by the Strangers; \"buildings collapse as others emerge and battle with one another at the end\". The round window in Dark City is concave like a fishbowl and is a frequently seen element throughout the city. The inhabitants do not live at the top of the city; the main characters' homes are dwarfed by the bricolage of buildings.[13]The film also contains motifs from Greek mythology, in which gods manipulate humans in a higher agenda. Proyas said, \"I do like Greek mythology and have read a little of it, so maybe some of it has crept into the work, though I don't completely agree with that point of view.\"[14]","Reception":"Among mainstream critics in the U.S., the film received generally positive reviews.[44] Review aggregator Rotten Tomatoes reports that 74% of 81 sampled critics gave the film a positive review, with an average score of 6.9 out of 10 and the critical consensus stating: \"Stylishly gloomy, Dark City offers a polarizing whirl of arresting visuals and noirish action\".[45] At Metacritic, which assigns a weighted average out of 100 to critics' reviews, the film received a score of 66 based on 23 reviews.[44]Roger Ebert writing in the Chicago Sun-Times called it a \"great visionary achievement,\" while also exclaiming that it was \"a film so original and exciting, it stirred my imagination like Metropolis and 2001: A Space Odyssey.\"[47] In the San Francisco Chronicle, Peter Stack wrote that the film was \"among the most memorable cinematic ventures in recent years\", and that \"maybe there's nothing wrong with a movie that is simply sensational to look at.\" He felt the film's \"twisting of reality and its daring look — layered and off-kilter grays, greens and blacks — make it click.\"[48] In a mixed review, Walter Addiego of The San Francisco Examiner thought \"as a story, Dark City doesn't amount to much.\" He believed Dark City contained a \"complicated plot\" while also having important themes that were \"no more than window dressing\". But on a positive front, he wrote, \"what counts here is the show, the creation of a strange world by a filmmaker who clearly knows science fiction and fantasy, past and present, and wants to share his love for it.\"[49]Left unimpressed, Marc Savlov of The Austin Chronicle wrote, \"You really have to feel for Alex Proyas. This guy wears bad luck like the grimy trenchcoats of his protagonists, only his zipper's stuck and he can't seem to shake the damn thing off.\" In expressing his negativity, he believed \"Dark City looks like a million bucks (or rather, a million bucks gone to compost), but at its dark heart it's a tedious, bewildering affair, lovely to look at but with all the substance of a dissipating dream.\"[50] Left equally disappointed was John Anderson of the Los Angeles Times. Commenting on the directing, he thought \"If you had to guess, you might say that Proyas came out of the world of comic art himself, rather than music videos and advertising. Dark City is constructed like panels in a Batman book, each picture striving for maximum dread.\" He went on to say, Proyas was \"trying simultaneously to create a pure thriller and sci-fi nightmare along with his tongue-in-cheek critique of artifice. And this doesn't work out quite so well.\"[51] Author TCh of Time Out, felt the development of the Murdoch character was \"surprisingly engrossing\" and thought production wise, the \"art direction is always striking, and unlike most contemporary sci-fi, the movie does risk a cerebral approach, tapping a vein of postmodern paranoia.\"[52]Writing for TIME, Richard Corliss said the film was \"as cool and distant as the planet the Strangers come from. But, Lord, is Dark City a wonder to see.\"[53] James Berardinelli writing for ReelViews, remarked that \"Visually, this film isn't just impressive, it's a tour de force.\" and noted that \"Dark City opens by immersing the audience in the midst of a fractured, nightmarish narrative.\"[46] Berardinelli also said \"Dark City appears to be New York during the first half of this century, but, using a style that is part science fiction, part noir thriller, and part gothic horror, he has embellished it to create a surreal place unlike no other.\"[46] Describing some pitfalls, Jeff Vice of the Deseret News said that \"when critics talk about films being 'style over substance,' they're definitely talking about movies like Dark City, which looks good but leaves an unpleasant aftertaste.\"[54] Vice however was quick to admit, \"The special effects and set designs are dazzling\", but ultimately believed \"Proyas makes a crucial error in treating the subject even more seriously than The Crow, and the dialogue (co-written by Proyas and The Crow: City of Angels scriptwriter David S. Goyer) is unintentionally funny at times and often just plain dumb.\"[54]\"What they have done is taken a few second-hand ideas from noir and speculative fiction and mixed them in occasionally striking ways, even if, in the end, the result isn't all that much fun.\"—Todd McCarthy, writing in Variety[55]Andrea Basora of Newsweek, stated that director Proyas flooded the screen with \"cinematic and literary references ranging from Murnau and Lang to Kafka and Orwell, creating a unique yet utterly convincing world\".[56] Similarly, David Sterritt wrote in the Christian Science Monitor that \"The story is dark and often violent, but it's told with a remarkable sense of visual energy and imagination.\"[57] Additionally, Marshall Fine of USA Today, found the film to be \"Fascinating, visionary filmmaking.\" and \"With its amber-tinged palette and its distinctively dystopian view of life, it may be the most unique-looking film we've seen in ages...[but] defies logic and makes frightening and unexpected leaps.\"[58] Critic Stephen Holden of The New York Times wrote that the \"plot that Dark City builds on John's predicament is a confused affair\" and that the film's premise is \"unsettling enough to make you wonder if it could actually derail a seriously drug-addled mind.\"[59]Steve Biodrowski of Cinefantastique found the production design and the cinematography overwhelming, but he considered the narrative engagement of Sewell's amnesiac character to be ultimately successful. Biodrowski writes, \"As the story progresses, the pieces of the puzzle fall into place, and we gradually realize that the film is not a murky muddle of visuals propping up a weak story. All the questions lead to answers, and the answers make sense within the fantasy framework.\" The reviewer compared Dark City to the director's preceding film The Crow in style but found Dark City to introduce new themes and to be a \"more thoroughly consistent\" film.[60] Biodrowski concluded, \"Dark City may not provide profound answers, but it deals seriously with a profound idea, and does it in a way that is cathartic and even uplifting, without being contrived or condescending. As a technical achievement, it is superb, and that technique is put in the service of telling a story that would be difficult to realize any other way.\"[61]The film won and was nominated for several awards in 1998. Film critic Roger Ebert cited it as the best film of 1998.[62][63] In 2005, he included it on his \"Great Movies\" list.[39] Ebert used it in his teaching, and also appears on a commentary track for the original DVD and the 2006 Director's Cut.[39] The film was screened out of competition at the 1998 Cannes Film Festival.[64]Dark City premiered in cinemas on February 27, 1998 in wide release on 1,754 screens in the U.S., and grossed $5,576,953 on its opening weekend, placing 4th,[2] far behind Titanic in 1st place with $19,633,056.[65] The film's revenue dropped by 49.1% in its second week of release, earning $2,837,941, dropping to 9th, while Titanic remained in first place with $17,605,849.[66] The film went on to earn $14,378,331 domestically in total ticket sales through a 4-week theatrical run. Internationally, the film took in an additional $12,821,985 in box office business for a combined worldwide total of $27,200,316.[2] The film's cumulative gross ranked 105th for 1998.[67]","produced_by":"Andrew Mason Alex Proyas","starring":"Rufus Sewell Kiefer Sutherland Jennifer Connelly Richard O'Brien Ian Richardson William Hurt","music_by":"Trevor Jones","edited_by":"Dov Hoenig"}