{"country":"United States","distributed_by":"Cannon Film Distributors","Plot":"Private Joe Armstrong (Michael Dudikoff) is conscripted into the U.S. Army by a judge, as an alternative to prison. Joe ends up fighting off the Black Star Order of ninjas while stationed in the Philippines. He saves Patricia Hickock (Judie Aronson) — daughter of Colonel William Hickock, Joe's commanding officer — from a kidnapping attempt. Although the rest of Joe's platoon is wiped out by the Black Star ninjas, Joe's popularity with his fellow GIs takes a nosedive, even as he is targeted for revenge by the Black Star Master ninja (Tadashi Yamashita).While performing chores on the base, Corporal Curtis Jackson (Steve James) goads Joe into a fight. Jackson proves no match for Joe's ninjitsu expertise, which greatly impresses their fellow soldiers to boot. Shortly thereafter, Jackson discovers that Joe is an amnesiac; he remembers very little of his past, other than running with various street gangs and mastering a number of exotic martial arts. The grateful Patricia organizes a date for herself with Joe. Jackson and a third soldier, Charley Madison (Phil Brock), sneak Joe off the base. They are caught during dinner by Sergeant Rinaldo, who is in the middle of a business meeting with black marketeer Victor Ortega (whose payroll the sergeant is on). To get Joe out of the way, Rinaldo leads him to an abandoned warehouse - ostensibly for the purpose of dropping off supplies. Black Star ninjas ambush Joe, who defeats all of them. Then Joe's truck is stolen and he gives chase using a motorcycle. The truck driver runs Joe off the road, wiping out the bike; thinking Joe dead, the driver brings the truck to Ortega. Joe, however, hides under the truck and is brought to the heart of Ortega's operation - which encompasses the Black Star ninja training camp.Ortega is paying the Black Star Order for weapons stolen from the Army, which he then resells to the highest bidder. Joe is discovered by the ninjas-for-hire, but escapes with the aid of Ortega's servant Shinyuki (John Fujioka). Joe returns to the base, where he is promptly arrested by military police who think he is fencing the arms. Jackson realizes that Joe has been set up, but his protests are wasted on Rinaldo. The Black Star Master infiltrates the stockade that night, slaughters the on-duty MPs and then tries to slaughter Joe as well. But Joe's would-be-assassin is thwarted by the sudden arrival of MP reinforcements, none of whom see the Black Star Master fleeing the scene. One of the dead MPs is found with a throwing star lodged in his head, which further implicates Joe in the bizarre goings-on.Only Jackson, Charlie, and Patricia believe that Joe is innocent of the charges he now faces. They tell her father everything they know about the hijacking and murders, but he just scoffs at their story. After briskly dismissing them, Colonel Hickock meets Rinaldo in private - revealing that the Colonel himself is on Ortega's payroll. Colonel Hickock orders Rinaldo to finish off Joe. Then the Black Star Master steals into the Colonel's residence and kidnaps Patricia, since her father is becoming a less-than-reliable partner. Rinaldo attempts to run Joe off the road, only to be killed himself. Joe returns to Ortega's mansion and the Black Star training camp, where he is reunited with Shinyuki.It is revealed that Shinyuki adopted Joe at birth after the boy's parents died. He trained Joe in the ways of ninjitsu, until the two were separated by a bomb blast; each has believed the other to be dead for years. Now Shinyuki completes Joe's training and they launch a surprise attack on the Black Star camp. Shinyuki sacrifices his life to help Joe defeat the Black Star Master; meanwhile, Colonel Hickock leads his own assault on the Ortega manor, both to rescue his daughter and to tie up loose ends - in other words, wipe out anything that might connect the Colonel to Ortega's weapon-jacking. Ortega flees by helicopter with Patricia as his hostage, after gunning down her father. Joe, however, infiltrates Ortega's chopper; he and Patricia jump to safety just before Jackson shoots down the helicopter, killing Ortega.","language":"English","Reception":"American Ninja received a mixed reception with critics.[1][2][3]","American Ninja series":"Others","box_office":"$10,499,694 (Domestic)","cinematography":"Hanania Baer","production_company":"Cannon Group Golan-Globus Productions","directed_by":"Sam Firstenberg","release_dates":"August 30, 1985","Production":"The film was originally called American Warrior and was released in UK cinemas under that title, but was changed to American Ninja for all other releases. The trailer (included on the DVD) contains the original title. In Germany, however, the film was released under the title American Fighter. It was also the first of three films pairing Michael Dudikoff and Steve James, the other two being American Ninja 2: The Confrontation and Avenging Force.[citation needed]","american_ninja":"Theatrical release poster","produced_by":"Yoram Globus Menahem Golan","starring":"Michael Dudikoff|Guich Koock|Judie Aronson|","running_time":"95 min.","music_by":"Michael Linn","edited_by":"Andy Horvitch Peter Lee-Thompson Marcus Manton Marcel Mindlin Daniel Wetherbee","written_by":"Paul De Mielche (screenplay) Gideon Amir (story) Avi Kleinberger (story) James R. Silke (uncredited)","budget":"$1,000,000 (Estimated)"}