{"based_on":"\"Bell, Book and Candle\" 1950 play  by John Van Druten","country":"United States","distributed_by":"Columbia Pictures","Plot":"During the Christmas holiday season, Greenwich Village witch Gillian Holroyd (Kim Novak), a free spirit with a penchant for going barefoot, has been unlucky in love and restless in life. She admires from afar her neighbor, publisher Shep Henderson (James Stewart), who one day walks into her gallery of African art to use the telephone (after Gillian's aunt Elsa Lanchester put a spell on his phone). When she learns he is about to marry an old college enemy of hers, Merle Kittridge (Janice Rule), Gillian takes revenge by casting a love spell on Shep, and she eventually falls for him herself. She must make a choice, as witches who fall in love lose their supernatural powers. When she decides to love Shep, Gillian's cat and familiar, Pyewacket, becomes agitated and leaves.Sidney Redlitch (Ernie Kovacs), the author of the best-selling book Magic in Mexico, arrives in Shep's office (thanks to a little magic) after Gillian discovers Shep's interest in meeting him. Redlitch is researching a book on witches in New York, and he acquires an \"inside\" collaborator when Gillian's warlock brother Nicky (Jack Lemmon) volunteers his services in exchange for a portion of the proceeds.Gillian uses her magic to make Shep lose interest in Nicky and Redlitch's book, and then confesses her identity as a witch to Shep. Shep becomes angry, believing she enchanted him just to spite Merle, and the two quarrel. Gillian threatens to cast various spells on Merle, such as making her fall in love with the first man who walks into her apartment, but she finds that she has lost her powers because of her love for Shep. Meanwhile, Shep finds he literally cannot leave Gillian, because of the spell. To escape, he turns to another witch, Bianca De Pass (Hermione Gingold), who breaks the spell. Shep confronts Gillian and leaves her heartbroken. He then tries unsuccessfully to explain to Merle that Gillian is a witch. Months later, Shep returns and discovers Gillian has lost her magic powers because of her love for him. When he realizes her love is true, the two reconcile.","language":"English","Release and reception":"Bell Book and Candle was considered a \"blockbuster\" by Columbia and prior to its release it was promoted accordingly.[16] Novak appeared with Pyewacket on the November 25 cover of Life, along with a write-up that highlighted a tie-in with Life photographer Eliot Elisofon who was the color consultant on the film.[17] There were favorable write-ups in other major magazines and a production number on The Steve Allen Show featured the theme music.[18][c]On November 11, 1958, the movie made its world premiere in Los Angeles at the Warner Beverly Theatre. It played an exclusive engagement there until its New York premiere on December 25.[20]Bell, Book and Candle received Academy Award nominations in two categories: Best Art Direction (Cary Odell and Louis Diage); and Best Costume Design (Jean Louis). It also received a Golden Globes nomination for Best Motion Picture – Comedy.[21]","box_office":"$2.5 million (estimated US/ Canada rentals)[1]","bell,_book_and_candle":"Promotional film poster","cinematography":"James Wong Howe","production_company":"Phoenix Productions, Inc.","directed_by":"Richard Quine","release_dates":"December 25, 1958 (1958-12-25)","Production":"David O. Selznick purchased the rights to Van Druten's play in 1953,[a] planning to cast his wife, Jennifer Jones, in the part of Gil. At the urging of Daniel Taradesh and Julian Blaustein,[3][4] Columbia purchased the property from Selznick in 1956.[5]Taradash, who had adapted From Here to Eternity (1953) for Columbia with great success, augmented the story slightly by incorporating characters who are only names in the play (notably Mrs. De Pass, and Shep's fiancee Merle) and expanding the action to locations beyond Gil's apartment.[6]For the lead roles, Taradash and Blaustein hoped to get Rex Harrison and Lilli Palmer, who had starred in the play, but Columbia chief Harry Cohn decided on Kim Novak for the female lead.[7] Novak was on loan to Paramount making Vertigo and the scheduling conflict put Harrison out of consideration as well.[3] Taradash and Blaustein also suggested Cary Grant and Grace Kelly as the leads and Alexander Mackendrick to direct; Kelly got married, however, and there were creative differences between the studio and both Grant and Mackendrick.[3] Since the arrangement with Paramount for Novak's appearance in Vertigo included reciprocity, Cohn advanced James Stewart for the role of Shep.[4] Bell, Book and Candle is generally recognized as Stewart's final romantic leading role.[8]Early in 1957 producers also launched a somewhat promotional search for Siamese cats to play Pyewacket.[9] According to one release, as many as 12 cats were needed to perform the number of stunts in the film.[10]Production began February 3, 1958, and was completed April 7.[11]The movie was scored by George Duning, another Columbia veteran who earned praise for his work on From Here to Eternity. The main theme melds bongos and violins, evoking elements of the plot;[12] heard during the opening credits, a few staves of \"Jingle Bells\" are incorporated to set the Christmas tone of the initial action. Each witch, including Pyewacket the cat, is identified by a musical signature. Duning used creative means such as recording sounds and replaying them at high speed to achieve an eerie background effect for the score.[12]The soundtrack was released in January 1959 by Colpix (CT-506).[13][b] Most of the recording took place in Munich with Duning conducting the Graunke Symphony Orchestra. The segments featuring the Brothers Candoli, who appear in the film playing at the Zodiac Club, were recorded in Hollywood at Columbia; on these tracks, John Williams can be heard on piano.[15]Philippe Clay makes a cameo appearance in the film performing \"Le Noyé Assassiné\" at the Zodiac Club, but this performance is not included on the soundtrack album.","produced_by":"Julian Blaustein","starring":"James Stewart|Kim Novak|Jack Lemmon|Ernie Kovacs|Hermione Gingold|Elsa Lanchester|Janice Rule|","running_time":"106 minutes","Influence":"Bewitched creator Sol Saks admitted that he drew on Bell as well as the earlier witch-themed I Married a Witch (1942).[22]In 1976 Bell, Book and Candle was pitched as a comedy series for television. A pilot episode starring Yvette Mimieux and Michael Murphy aired on NBC, but the show was not picked up.[14]","music_by":"George Duning","edited_by":"Charles Nelson","written_by":"Daniel Taradash"}