{"directed_by":"Juan López Moctezuma","country":"Mexico","distributed_by":"Yuma Films, Films 75","release_dates":"January 26, 1978 (1978-01-26) (Mexico)|||||","starring":"Tina Romero Claudio Brook Susana Kamini David Silva","running_time":"85 minutes","language":"English","Themes":"Alucarda is notorious for its extreme subject matter and themes, which includes that of Satanism, murder, demonic possession, exorcism, orgies, and lesbianism, among other things, within a religious setting. All of these things made the film controversial, especially for the time it was made. Because of its extreme violence, scenes of sacrilege, and perversely defiled religious imagery, it has gained notoriety among fans of the horror genre. Although the film continues to be situated in this genre, it is undergirded by anti-government and anticlerical sentiments that are manifest in the exaggerated idolatry, representations of clerics as tyrants and persecutors, and overt iconoclasm.[2]The film has been often compared to Ken Russell's 1971 horror film The Devils and William Friedkin's 1973 film classic The Exorcist because Alucarda was released within five years of both of them and shares similar plot themes.","Reception":"After the film's release in January 1978 in Mexico, it never received much attention from critics nor audiences, but over the years became something of an underground film and a B-movie cult classic. While it is not widely known by horror fans, many fans who have seen it consider it an unrecognized gem.Columnist Michael Weldon of the Psychotronic Video Guide said the film was \"The strongest, most imaginative, and visual witch movie since Ken Russell's \"The Devils\".\"[3] Well-known Mexican filmmaker Guillermo del Toro has also expressed his appreciation for the film and other works from director Juan López Moctezuma.[4]","Plot outline":"The film takes place in a Mexican convent that houses nuns and is also an orphanage. Alucarda, a fifteen-year-old orphaned girl, has lived at the convent her entire life. Justine, another orphan girl of similar age, arrives at the convent. She and Alucarda become very close friends and form a relationship that borders on being sexual.While playing in the nearby forest, the girls stumble upon a band of mysterious gypsies and subsequently unleash a demonic force after opening a casket at a nearby burial site. A bloody chain of events follows after both Alucarda and Justine become possessed by the Satanic entity and wreak havoc on the convent and its inhabitants.","alucarda":"original poster for Alucarda","written_by":"Alexis Arroyo Juan López Moctezuma"}