{"country":"India","distributed_by":"Red Chillies Entertainment","screenplay_by":"Manisha Korde Mushtaq Sheikh","story_by":"Sreenivasan","Plot":"Billu (Irrfan Khan) is a poor barber who lives with his wife Bindiya (Lara Dutta) and their two children, Gunja (Mitali Mayakar) and Ronak (Pratik Dalvi) in the village of Budbuda. He also spends time with his close friends Budbudiya (Rajpal Yadav) and Naubat Chacha (Asrani). Though struggling, Billu lives an uneventful life until Bollywood superstar Sahir Khan (Shah Rukh Khan) comes to the village for a film shoot.Billu has mentioned to his family that he knows Sahir from the past but has never elaborated how he knows the star. When his children talk about their father's friendship with the star, word spreads throughout the village. Virtually overnight, Billu, who had previously been scorned by most due to his lowly state, becomes the center of attention. People who had spurned him only the week before now call him a close friend so that he will introduce them to Sahir. Billu refuses and downplays the friendship. Even so, the powerful businessman Sahukaar Daamchand (Om Puri) demands to see Sahir and offers Billu expensive gifts in order to gain such a meeting. When Billu consistently fails to introduce the people of the village to Sahir, his situation changes once again. He is accused of lying about his friendship and everyone – including his wife and children – begin to doubt his character and integrity. Rather than defend himself, Billu remains quiet about the nature of his and Sahir's friendship.On Sahir's last day in the village, the star speaks at a local school. He tells the children about his own impoverished childhood when he had nothing but a special friendship with another young boy, named Billu. It was Billu who had taken care of Sahir and eventually helped him travel to Mumbai City where Sahir became a star. Billu, who is standing at the back of the event, leaves during the talk without revealing to Sahir that he is there. But the townspeople, realising their error, take Sahir to Billu's house. Billu's children come home and apologise to their father. Then, Sahir appears in his car and is reunited with Billu. In the end, Sahir must leave for another shoot but promises that his and Billu's friendship is reignited and will remain friends.","language":"Hindi","box_office":"₹55 crore (equivalent to ₹97 crore or US$14 million in 2016)[1]","cinematography":"V. Manikandan","directed_by":"Priyadarshan","Soundtrack":"Released on 5 January 2009, the soundtrack for Billu has music by Pritam with lyrics from Gulzar, Neeraj Shridhar, Sayeed Quadri, Ashish Pandit and Mayur Puri. The song \"Khudaya Khair\" was recorded by playback singer Abhijeet Bhattacharya who has rendered his voice for Shahrukh Khan in many movies. However, due to the ongoing controversy between Abhijeet and SRK, the song was withdrawn. The song \"Love Mera Hit Hit\" was sampled by Serbian pop singer Anabela in her song \"Igra Istine\", by Serbian singer Dejan Stanković in his song \"Kaligula\" and by Macedonian singer Boki 13 in his song \"Kaligula\".","release_dates":"13 February 2009 (2009-02-13)|||||","Production":"Director Priyadarshan cast Shahrukh Khan and Lara Dutta in pivotal roles in the film. While these roles were initially offered to Akshay Kumar and Tabu, Kumar eventually opted out of the project[8] as did Tabu.[9] The director then offered Kumar's and Tabu's role to Shahrukh Khan and Amisha Patel respectively, and both of them agreed to do the film.[10] Patel also opted out of the film[11] and sources have indicated that Juhi Chawla was signed on for the role.[12]In April 2008, the director announced that he had cast Lara Dutta as Billu's wife.[13] The cast began filming for the project on 8 April 2008[14] and according to Shahrukh Khan, \"the film is a sweet story of friendship...quite similar to the bond shared between Krishna and Sudama\".[4] The film also features Kareena Kapoor, Priyanka Chopra and Deepika Padukone in item numbers with Shahrukh Khan.[15] This is the second film which actress Deepika Padukone worked together with director Priyadarshan after the Tamil film Snegithiye which Deepika Padukone did a small role.","billu":"Promotional Poster","produced_by":"Gauri Khan","starring":"Irrfan Khan Lara Dutta Shah Rukh Khan guest appearance Om Puri Rajpal Yadav Asrani","running_time":"138 minutes","Controversy":"The film was originally titled Billu Barber, but salon and beauty parlour associations raised objections by finding the word \"Barber\" derogatory.[20] As head of the film's production company, Shah Rukh Khan eventually removed the word from the movie title and promotions,[21] renaming the film Billu. He also invited 'The Hairdressers' Association of Mumbai members to the premier of the movie in order to assuage their protests.[22]","music_by":"Pritam","Story":"The film is based upon the friendship of two boys, Sahir Khan (Shah Rukh Khan), is a poor Muslim boy who ends up becoming a Bollywood superstar because of his friend Billu (Irrfan Khan), who thereafter falls in love with Bindiya (Lara Dutta) and escapes to Budbuda village. Years Later, Sahir happens to arrive in Budbuda for a shooting schedule, and how he reunites with Billu, now a poor village barber, forms the crux of the story.","edited_by":"Arun Kumar","Release":"Billu had a good opening in India and by the end of its theatrical run, the movie was declared a 'Semi Hit'.Billu opened to good reviews. In reviewing the film, Derek Elley of Variety stated: \"Bigtime Bollywood meets small-town India with quietly entertaining, finally moving results in Billu Barber. Simple tale of friendship cleverly manages to bring together superstar Shah Rukh Khan, in full-on pin-up mode, with Irfan Khan, who's developed into one of the industry's best character actors, in a movie that straddles both mainstream Hindi cinema and more specialty fare. Mid-February release, produced by Khan's own company, Red Chillies, won't approach the grosses of his last starrer, Rab Ne Bana Di Jodi, but is way more engaging on an emotional level\".[16] Lisa Tsering of The Hollywood Reporter states that Billu is a \"Bollywood comedy about an unlikely friendship [that] is full of unexpected pleasures\".[2] Frank Lovece of Film Journal International describes the film as a \"delight\" and states, \"What makes it work ... is that neither Billu nor his situation is played for laughs—his hardscrabble poverty isn't glossed over, and neither is his wife's longing for acceptance in the class-conscious village. And a climactic speech by Khan at a school gathering works fully well emotionally, despite a huge potential for hokiness—and incidentally provides concrete reason why real-life Khan, who's often starred in glowering action-hero roles, is a genuinely top-notch actor in addition to being a popular star\".[3] The Times of India gave the film three stars and describes it as \"a moving ode to friendship and ordinariness\".[17] While CNN-IBN's Rajeev Masand gave the film two out of five stars, he stated that it \"works smoothly as a simple, moral tale, its charm interrupted every time the director goes for broader, more 'commercial' appeal. But it's enjoyable and heart-felt too, and for that reason deserves to be watched\".[18] Shashi Baliga of the Hindustan Times said that, \"Though the film has its share of stock characters, maudlin and over-the-top moments and sags in the latter half, there’s also good story-telling, some great acting, and a healthy dose of masala in the item numbers\".[19]","budget":"₹23 crore (equivalent to ₹40 crore or US$6.0 million in 2016)"}