{"country":"Germany|United Kingdom|United States|","distributed_by":"20th Century Fox (USA)|Lionsgate (UK)|","Plot":"In 1973, ten-year-old Eddie Edwards dreams of Olympic glory, practising various Olympic events and failing miserably. His mother unconditionally supports him, while his father constantly discourages him. As a young teen, he gives up his dream of participating in the Summer Games in favour of skiing in the Winter Games. Although successful at the sport, he is rejected by British Olympic officials for being uncouth. Realizing he could make the team as a ski jumper (a sport in which the United Kingdom had not participated in six decades), he decamps to a training facility in Garmisch-Partenkirchen, Germany. The more seasoned jumpers, specifically those on the Norwegian team, belittle him.He self-trains, and after successfully completing the 15-metre (49 ft) hill on his first try, he injures himself on his first try from a 40-metre (130 ft) hill. Drunken snow groomer Bronson Peary (Hugh Jackman) encourages Eddie to give up, but Eddie's tenacious spirit and shared feelings of ostracisation from the other jumpers there convince him to train Eddie. Peary is a former champion American ski jumper who left the sport in his 20s after a conflict with his mentor, famous ski jumper Warren Sharp (Christopher Walken), which Eddie learns from Petra (Iris Berben), the kindly owner of a nearby tavern. With very little time to qualify for the 1988 Winter Olympics in Calgary, Alberta, Eddie and Bronson employ various unorthodox methods to condition and refine Eddie's form, and he successfully completes the 40m hill.Due to the long-unedited rules of the British Olympic division regarding ski jumping, Eddie only needs to complete a 70-metre (230 ft) jump in order to qualify for the Winter Olympics. Not long after, he is able to successfully land a 38-metre (125 ft) jump, thus winning a place on the British Olympic Team. However, the officials, in an effort to keep Eddie from sullying the Winter Games with his amateurish skillset, decide to change the rules and demand that he jump at least 61 metres (200 ft). Though discouraged, Eddie decides to continue training and performs on a circuit, his jumps increasing in length each time, but unable to meet the Olympic requirements. During a practice jump at the final event before the cutoff date for qualification, he lands a 61m jump exactly, but on his official jump, he falls and is disqualified. Eddie is devastated and resolves to return home to work with his father as a plasterer, but he receives a letter claiming that his qualifying practice jump is valid, and he happily tells Bronson that he's eligible to compete in the Winter Olympics. Bronson tries to dissuade him, promising that he will make a complete fool of himself and his country if he goes, but Eddie is undeterred, noting that competing in the Olympics was always enough for him.Upon arriving in Calgary, he receives instant scorn from the other British athletes, who get him drunk and nearly provoke him into fighting after he is subsequently absent from the opening ceremonies. Despite finishing last in the 70m jump with 60.5 metres (198 ft), Eddie sets a British record. His triumphant celebrations win the audience over, and the media embrace him as Eddie \"The Eagle\". Over the phone, Bronson criticises Edwards for not taking the sport seriously. Edwards publicly apologizes to the press for his antics, and wanting to ensure he does not leave the games as little more than a novelty, he enters the 90-metre (300 ft) jump, which he had never attempted before. Bronson decides to travel to the games and support him. After an encouraging conversation with his idol Matti \"The Flying Finn\" Nykänen on the lift to the top of the hill, Eddie barely manages to land a 73-metre (240 ft) jump. Once again, he scores last in the event, but is nonetheless cheered by the audience as well as millions around the world, which includes a playful salute in the closing speech of the President of the Organising Committee for the Olympic Games, Frank King. British Olympic officials grudgingly accept him.Warren Sharp reconciles with Bronson, who was present, and Edwards returns home a national hero to the cheers of his fans at the airport, his mother rushes to him embracing him. And as Eddie looks to his father, he reveals a jumper declaring his support before then embracing Eddie as well.","language":"English","Reception":"Eddie the Eagle grossed a worldwide total of $46.1 million.In the UK, it grossed $12.8m making it the highest grossing British film released in the UK in 2016 so far. [3]On Rotten Tomatoes, the film has a rating of 80%, based on 166 reviews, with an average rating of 6.5/10. The site's consensus reads, \"Eddie the Eagle's amiable sweetness can't disguise its story's many inspirational clichés – but for many viewers, it will be more than enough to make up for them.\"[23] On Metacritic the film has a score of 54 out of 100, based on 34 critics, indicating \"mixed or average reviews\".[24] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.[25]Alonso Duralde of TheWrap wrote, \"Eddie the Eagle is designed for audiences who will throw their weight behind the film’s schmaltz and sentimentality. Anyone unwilling to commit to the movie’s shamelessness will feel like they’ve hit the ground headfirst.\"[26] KenyaBuzz called it a must-watch saying it is \"positively impetuous and unbearably affectionate.\"[27] A sportswriter who attended the events in which the real Eddie competed, wrote \"three generations of my family loved this film. You can't believe most of it, but you can believe in it. That's a subtle but important difference.\"[28]","box_office":"$46.1 million[3]","cinematography":"George Richmond","production_company":"Marv Films Studio Babelsberg Saville Productions","directed_by":"Dexter Fletcher","Soundtrack":"A soundtrack album, created by Gary Barlow, was announced, with new songs from Tony Hadley, Marc Almond, Holly Johnson, Paul Young, Kim Wilde, Andy Bell, Midge Ure, Nik Kershaw, ABC, Go West, Howard Jones, Thin Lizzy and Heaven 17. A track co-written by Barlow and OMD's Andy McCluskey will also be featured.[22]","release_dates":"26 January 2016 (2016-01-26) (Sundance Film Festival)|26 February 2016 (2016-02-26) (United States)|28 March 2016 (2016-03-28) (United Kingdom)|||","Production":"Eddie the Eagle is a British-German-American co-production of Marv Films (UK), Studio Babelsberg (Germany) and Saville Productions (US).[8][9][10] In March 2015, it was announced that 20th Century Fox had acquired the film, with Taron Egerton[11] and Hugh Jackman starring and Dexter Fletcher directing, from a screenplay by Sean Macaulay and Simon Kelton.[12] [13][14]Egerton would portray Eddie \"The Eagle\" Edwards, while Jackman would portray Bronson Peary, his coach; Jackman's character was confirmed as fictional by Eddie Edwards.[15][16] It was also announced that Matthew Vaughn, who produced Kingsman: The Secret Service, would reunite with the studio, serving as a producer on the film, while Adam Bohling, David Reid, Rupert Maconick and Valerie Van Galde would also serve as producers.[12] That same month, it was announced that Christopher Walken had joined the film, portraying the role of Jackman's character's mentor.[6] The film received funds of €2.2 million, from the German Federal Film Fund (DFFF).[17]Principal photography took place in Oberstdorf and Garmisch-Partenkirchen in Bavaria, in Seefeld in Tirol, at the Pinewood Studios and in London from March 9 to May 3, 2015.[18]","produced_by":"Adam Bohling|David Reid|Rupert Maconick|Valerie Van Galder|Matthew Vaughn|","starring":"Taron Egerton|Hugh Jackman|Christopher Walken|Iris Berben|Jim Broadbent|","running_time":"105 minutes[1]","eddie_the_eagle":"Theatrical release poster","music_by":"Matthew Margeson","edited_by":"Martin Walsh","Release":"In March 2015, it was announced 20th Century Fox would distribute the film in the United States. The studio set 29 April 2016 for the release of the film.[12] That same month, it was announced that Lionsgate had acquired United Kingdom distribution rights to the film, with a spring 2016 release planned.[19] In October 2015, Lionsgate set a release date for the film for 1 April 2016.[20] The date was then moved forward to 28 March 2016. The same month, it was announced that the film had delayed to 26 February in the United States.[21] The film had its world premiere at the 2016 Sundance Film Festival as a \"Surprise Screening\" on 26 January 2016.[4]","written_by":"Sean Macaulay|Simon Kelton|","budget":"$23 million[2]"}