{"Cast":"(Partial uncredited cast)","country":"Italy","Plot":"In New York City, during a séance held in the apartment of medium Theresa, Mary Woodhouse (Catriona MacColl) experiences a traumatic vision of a priest, Father Thomas (Fabrizio Jovine), hanging himself from a tree branch in a cemetery of the remote village of Dunwich. When the images overwhelm her, Mary breaks the circle, goes into convulsions, and falls to the floor as if dead. The police, led by Sergeant Clay, interrogate Theresa, but fail to heed her warnings of an imminent evil. Outside the apartment building, Peter Bell (Christopher George), a local journalist, tries to gain entry to the premises but is turned away. The following day, Mary is buried in a local cemetery on Long Island overlooking Manhattan and Peter visits her grave site. The gravediggers (Perry Pirkanen and Michael Gaunt) leave Mary's half-covered coffin at the end of their work shift and leave. As Peter begins to leave, he hears muffled screams. Using a pickaxe, he frees Mary from her premature burial, the pickaxe coming dangerously close to her head as it smashes through the casket lid.Peter and Mary visit Theresa who warns them that according to the ancient book of Enoch, the events Mary witnessed in her visions presage the eruption of the living dead into our world. The death of Father Thomas, a marked priest, has somehow opened a door through which the living dead can enter and the invasion will commence on All Saints Day, just a few days away.In Dunwich, Bob (Giovanni Lombardo Radice), a lonely youth with a bad reputation, wanders into an abandoned house, finding a rubber doll which inflates itself. Before he can use it, the sight of a rotting baby's corpse scares him away. At Junie's Lounge, the barman talks with two local men, Mr. Ross (Venantino Venanini) and Mike, about recent strange events for which Mr. Ross is inclined to blame Bob. When a mirror shatters and the wall cracks inexplicably, the men leave, despite the bartender's offer of free drinks. Across town, Gerry (Carlo De Mejo), a psychiatrist, is in consultation with Sandra (Janet Agren), a neurotic patient, when Emily Robbins (Antonella Interlenghi), his 19-year-old girlfriend and personal assistant, arrives. She tells Gerry that she's on her way to meet Bob, whom she has been trying to help. After Emily leaves, Sandra's pet cat, whom she has been holding through her session, suddenly scratches her badly on her hand, and huddles in a corner. That evening, Emily visits Bob at a disused garage, but unearthly groans scare him away. Emily is left alone when she faces the supernatural apparition of Father Thomas who smothers her with a maggot-covered hand.A short distance away, Rose Kelvin (Daniela Doria) and Tommy Fisher (Michele Soavi), a teenage couple, are making out in Tommy's jeep when they too see the ghostly image of Father Thomas outside the jeep. With a powerful, mesmerizing stare, Father Thomas makes Rose's eyeballs bleed and she meets a ghastly fate by vomiting her entire guts out while Tommy watches, and he is immediately killed by getting his head ripped open by an unseen ghoul. The next morning, there is no sign of Rose or Tommy, while Emily's body is found at the garage. The local pathologist Dr. Joe Thompson (director Lucio Fulci), cannot make a clear assumption to how Emily died except from a heart attack caused by sheer fright. After Dr. Thompson leaves the scene, Sheriff Russell finds a small puddle of black, worm-infested fluid nearby. Mr. Robbins tells the sheriff and Gerry of his suspicions about Bob. Meanwhile, Peter and Mary leave New York and embark upon their search for the town of Dunwich, as seen in Mary's vision.As All Saints Day approaches, the people of Dunwich suffer further ghostly visitation in advance of the Hellish outpouring. That evening, Bob sees Father Thomas hanging in the deserted house he frequents. At the local morgue, a mortician is bitten on his hand by the cadaver of elderly Jane Holden while trying to steal her jewelry. The apparition of the dead Emily pays a nocturnal visit to her little brother John-John (Luca Paisner). At Sandra's house, the corpse of Mrs. Holden appears without explanation on her kitchen floor. Sandra calls Gerry for help, and he tries to cling onto the possibility of a rational explanation. But as soon as Gerry arrives, the body has disappeared. Investigating noises upstairs in Sandra's house, the doctor and patient witness broken glass fly from a shattered window into the wall opposite. The wall bleeds before their eyes, forcing them to flee the house. Meanwhile, Bob has taken refuge at the Ross household in the garage. When Mr. Ross's teenage daughter finds him and tries to comfort him after he tries to explain what's going on outside, the rabid patriarch enters, and mistakenly assumes that Bob is trying to seduce his daughter. The vicious Mr. Ross kills Bob in by impaling his head on a drilling lathe.The following morning, Peter and Mary follow a blind village priest's directions to the shunned village of Dunwich. Arriving at the graveyard, they begin searching for Father Thomas' tomb. Gerry and Sandra also arrive after following a trail there, and the two couples exchange stories about their recent events. They begin to become acquainted at Gerry's office when a sudden violent storm blasts through the window, showering the four with maggots. When it's over, Gerry receives a distressing phone call from John-John Robbins. The little boy says that his dead sister has returned from the grave during the night and killed his parents. The four rush over the Robbins' house and find that John-John's story is true. Sandra offers to take the boy to her apartment while, Peter, Mary, and Gerry try to find the sheriff. Upon arriving to her apartment building, Sandra is killed by the malevolent zombie/ghost of Emily, who rips Sandra's scalp off. John-John runs through the fog-shrouded streets of the town, evading more zombies of the townspeople, when he is saved by Gerry who hands the boy over to the police.At Junie's Lounge, Mr. Ross, Mike, and the barman are attacked and finally killed by the marauding ghouls as a state-of-emergency is declared over the radio. Mary, Peter, and Gerry arrive back at the graveyard as All Saints Day begins. They descend into Father Thomas' family tomb, discovering an underground grotto of skeletal remains and cobwebbed putrescences. Sandra suddenly appears as a zombie and kills Peter by ripping his brains out. Gerry impales her to a cave wall with a pitchfork through her chest before she can kill Mary. Mary and Gerry continue on until they reach a weird, stained-glass chamber coated in musk and dust. There, they face Father Thomas who has re-entered corporeal existence with his supernatural powers intact. Mary and Gerry look on as all of the dead begin to emerge from their tombs and surround them. Father Thomas once again begins to use his powerful and mesmerizing stare making Mary's eyeballs bleed. Before his stare can turn Mary inside out, Gerry grabs a large, rotting, wooden cross and disembowels Father Thomas. The evil priest's decayed guts are punctured, and he and the massing zombies burst into flames and return to dust. The Gates of Hell have been closed just before the dead fully rise. Mary and Gerry struggle from the subterranean catacombs of the night and emerge back out of Father Thomas' tomb into the graveyard at morning to see John-John and the police. Mary and Gerry's relief turns to shock as the realisation of the past events becomes all too clear. Mary begins to scream as John-John is running towards them before the film crumbles to black.","language":"English Italian","Critical reception":"On review aggregator website Rotten Tomatoes, City of the Living Dead currently has an approval rating of 55%, and is certified \"rotten\".[3] Allmovie wrote that while the film \"suffers from the same shortcomings present in much of Fulci's other horror films\", \"City of the Living Dead benefits from Fulci's ability to create and sustain an intensely creepy atmosphere\", though ultimately calling the film \"a dry run for the blend of graphic shocks and surrealism atmosphere that Lucio Fulci would perfect with The Beyond.\"[4] Time Out called the film \"laughably awful\", though \"with its nonsensical 'plot' randomly constructed according to the illogic of fear, and its grotesque emphasis on physical mutability, fragmentation and decay, it could just conceivably be the sort of disreputable movie the surrealists would have loved.\"[5]","cinematography":"Sergio Salvati","production_company":"Dania Film Medusa Distribuzione National Cinematografica","directed_by":"Lucio Fulci","release_dates":"11 August 1980","Production":"The exteriors for the film were shot partially in the United States in both New York City, New York and Savannah, Georgia which stood in for the fictitious town of Dunwich. Manhattan exterior locations were filmed mostly in the Upper West Side, including the Gothic apartment house which stood in for the character Madame Theresa's apartment which was located at the northwest corner of West 76th Street and West End Avenue. The cemetery where the character Peter Bell rescues Mary Woodhouse from her sealed coffin was filmed in an area of Calvary Cemetery overlooking Manhattan. Bonaventure Cemetery features prominently as the Dunwich Cemetery location in which Father Thomas hangs himself and where the protagonists must go to battle his entombed corpse. All of the interiors were filmed in Rome, Italy at Dear Studios.During filming, actress Daniela Doria actually vomited sheep entrails during the intestine purging scene.[1]The character Mary Woodhouse shares a last name with Rosemary Woodhouse, the main character in Rosemary's Baby.","Distribution":"City of the Living Dead was released to U.S. screens in May 1983 as The Gates of Hell through Motion Picture Marketing, a now defunct small American independent distributor. After the film was screened in Los Angeles, California with Fulci present for a Q&A, he was met with heaving booing from the very angry remaining audience.On 25 May 2010, Blue Underground released a Blu-ray of the film, which includes the documentary Making of City of the Living Dead. A Special Edition DVD (region 1) was also released the same day, with the making-of documentary on it as well. Austin based El Rey Network screened the film in his series El Rey Network Presents: The Director’s Chair on February 14, 2015.[2]In the early 1980s, this film was passed by the BBFC for cinema exhibition with only the infamous \"head drilling\" scene cut. The same X version was released on video around the same time. Post-Video Recordings Act, it was submitted to the BBFC for official video release and received further cuts to the vomiting scene and the brain crushing scenes. In 2001, it was re-submitted and passed uncut.On 24 May 2010, Arrow Video released the definitive one-disc edition on Blu-ray and two-disc DVD.The film was initially released uncut in Germany under the title Ein Zombie hing am Glockenseil but was banned shortly afterwards. Since then, the film has been re-released several times under various titles (Ein Toter hing am Glockenseil, Eine Leiche hing am Glockenseil, and various other international titles) in cut and uncut form. All of these releases have subsequently been banned. The only exception is a version named Ein Kadaver hing am Glockenseil which is missing nine minutes of footage and has been rated 16 by the FSK.","city_of_the_living_dead":"Italian theatrical release poster by Enzo Sciotti","produced_by":"Lucio Fulci Giovanni Masini Robert E. Warner","starring":"Christopher George Catriona MacColl (as Katriona MacColl) Carlo De Mejo Antonella Interlenghi Giovanni Lombardo Radice","running_time":"93 min.","music_by":"Fabio Frizzi","edited_by":"Vincenzo Tomassi","written_by":"Lucio Fulci Dardano Sacchetti"}