{"country":"United States","distributed_by":"HBO Films","Plot":"In 1998, the family of the late Roger Maris goes to Busch Stadium to witness Mark McGwire of the St. Louis Cardinals break their father's record with a 62nd home run. Maris' widow, Pat, is hospitalized due to complications from arrhythmia and watches the game on television from a hospital bed.Decades earlier in 1961, Maris is presented with the Most Valuable Player award for the 1960 baseball season, but Mickey Mantle remains the New York Yankees' superstar. Mantle starts off hot while Maris struggles. Maris suspects he may be traded, but new manager Ralph Houk has Mantle and Maris switch places in the Yankees' batting order to see if it helps. It does, and Maris begins to hit home runs at a record pace. Mantle keeps pace and it becomes clear that both \"M&M Boys\" will make a run at Babe Ruth's record of 60 homers in one season.Mickey's life off the field is taking a toll on his playing. He drinks, enjoys the Manhattan nightlife and arrives at the ballpark hung over. More than once, pitcher Whitey Ford has to bail him out or sober him up. To keep Mantle out of trouble, Maris and teammate/roommate Bob Cerv invite him to move in with them in a modest home in Queens, with one condition: no women.New York's fans and media pull for the popular and personable Mantle, a long-time Yankee. The quieter Maris is viewed as an outsider, aloof and unworthy. As the two men close in on the record, MLB Commissioner Ford Frick, who also happened to be Babe Ruth's admirer and ghostwriter, makes a decision: unless the record is broken in 154 games (the same number Ruth played in 1927), the new record would be listed separately from Ruth's record, because MLB has just begun using a new 162-game season. Contrary to popular belief, and the movie's title, there was never any \"asterisk\" involved or mentioned in real life.It appears Mantle is not going to make it; his health deteriorates and he plays in constant pain. Maris, meanwhile, is unaccustomed to such a high level of public scrutiny and is uncomfortable interacting with the media, who dissect and distort everything he says or does. The fans heckle Maris and even throw objects at him on the field. Soon he begins receiving hate mail and death threats. His wife lives far from New York, usually available only by phone. The stress becomes so intense that Maris' hair begins to fall out in clumps. The Yankees owner also tries to favor Mantle by asking Houk to switch Mantle and Maris in the batting order, but Houk refuses, because the redesigned lineup has been winning a higher percentage of games.Chronic injury and alcohol abuse catch up with Mantle, and an ill-advised injection by a doctor infects his hip and lands him in a hospital bed. With Mantle gone from the lineup, the stage becomes set for Maris. He fails to break the record in the 154th game of the season, but he does finally hit the record-breaking 61st home run during the final game of the 162-game season.According to a voiceover (by long-time Yankee Stadium public address announcer Bob Sheppard), during the end credits, no asterisk was ever officially placed next to Roger's feat, due to separate records being created for the 154 and 162 game seasons. It is revealed that in 1991, six years after Roger's death, baseball's then-Commissioner Fay Vincent decided that a season is a season and separate records would no longer be kept, leaving Maris as the lone record-holder.","language":"English","Critical reception":"The film received positive reviews from critics. Review aggregator Rotten Tomatoes reports that 80% out of 15 professional critics gave the film a positive review, with an average rating of 6.7/10.[1] Film critic Richard Roeper named 61* one of his top five all-time favorite baseball movies[citation needed].","directed_by":"Billy Crystal","Errors":"In the beginning of the movie, Bob Cerv was seen with the Yankees on Opening Day. In reality, Cerv was a member of the Los Angeles Angels until May and then was traded to the Yankees.Also on opening day, the broadcast announcer refers to the opposing Minnesota Twins pitcher as Camilo Pascual. In fact, the Twins' pitcher that day was Pedro Ramos, who would later distinguish himself as a reliever for the Yankees. As the Twins are warming up, two players, wearing numbers 2 (Zoilo Versalles) and 7 (Lenny Green) are seen. In the film, number 7 for the Twins throws right-handed and appears to be Caucasian. In fact, Green, who started in center field opening day for the Twins, is an African-American who batted and threw left-handed.In his 2013 memoir, Still Foolin' 'Em, Billy Crystal tells how before it aired on HBO, the film was shown at the White House for a small audience that included President George W. Bush, who once owned baseball's Texas Rangers. A home run in the film, depicted as being hit off pitcher Frank Lary, was actually hit off Hank Aguirre, a left-hander, the President pointed out to Crystal ... correctly, as it turned out. Lary gave up Maris' 52nd and 57th homers of that 1961 season, but the one in question (his 53rd) did indeed come against Aguirre.","Filming locations":"Most of the baseball action scenes, including those set at Yankee Stadium, were actually filmed at Tiger Stadium in Detroit, Michigan. A combination of strategic photographing and post-production effects were used to enhance the illusion of the \"classic\" layout of Yankee Stadium. Tiger Stadium was credited as \"playing\" Yankee Stadium in the closing credits. Tiger Stadium also \"played itself\" as the home of the Tigers when the Yankees played them in Detroit.The shots depicting Fenway Park and Baltimore's Memorial Stadium were shot at the Los Angeles Memorial Coliseum.","release_dates":"April 28, 2001","produced_by":"Robert F. Colesberry","starring":"Thomas Jane Barry Pepper","running_time":"129 minutes","music_by":"Marc Shaiman","written_by":"Hank Steinberg"}