{"Cast":"Source:[2]","country":"United States","distributed_by":"Warner Brothers","screenplay_by":"Frank Wead","china_clipper":"theatrical film poster","Plot":"In the mid-1930s, Dave Logan (Pat O'Brien) is obsessed and struggling to build and fly a new ocean-going flying boat airline with the prospects of reaching China from San Francisco. His wife, Jean (Beverly Roberts) and his boss, Jim Horn (Joseph Crehan), try to discourage him but he enlists war buddies \"Dad\" Brunn (Henry B. Walthall), to design his aircraft and pilot Tom Collins (Ross Alexander) to start an airline between Philadelphia and Washington, D.C.Undeterred when the airline fails, the group start a second airline in Key West, Florida, to deliver mail throughout the Caribbean. Another pilot friend, Hap Stuart (Humphrey Bogart), signs up and as the airline begins to prosper, Logan becomes more obsessed, making life difficult for all around him including his wife and best friends. Jean and Hap quit but come back on the eve of an important proving flight.The new \"China Clipper\" is the last project for Dad, who succumbs to a heart attack shortly after the takeoff. When the China Clipper encounters a severe storm off the China coast, Logan decides to cancel the flight, but Hap brings the flight in safely, with a few minutes to spare, securing a contract.","language":"English","Reception":"Despite Warner Bros.' typical casting and plot, China Clipper was well received as its packaging did not detract from the timely account of a transpacific flight. Frank S. Nugent in his review for The New York Times, commented, \"A fascinating and surprisingly literal dramatization of the China Clipper's transpacific flight of last November, the picture deserves a respectful accolade both for its technical accuracy and for its rather astonishing refusal to describe the flying boat's journey in the stock terms of aerial melodrama.\"[6]","cinematography":"Arthur Edeson","production_company":"First National Pictures","directed_by":"Ray Enright","References":"NotesBibliography","release_dates":"August 22, 1936","Production":"The screenwriter of China Clipper, Frank \"Spig\" Wead, based the film on a thinly disguised bio of the life of Juan Trippe, in particular, his life just prior to, during and after the founding of Pan American Airways.[3] Filmed with the cooperation of Pan Am, actual newsreel and production footage of the Martin M-130 is used throughout the film to emphasize the story just as it was happening for Trippe in real life.[4]The flying sequences were the highlight of the film with famed Hollywood stunt pilot Paul Mantz working with veterans Elmer Dyer and H. F. Koenekamp to create realistic aerial photography.[1] There are scenes of the aircraft flying over the incomplete Golden Gate Bridge while it was still under construction. The film is a rare example of a new technology and mode of travel put before the Hollywood cameras just as it was developing.[5]","produced_by":"Samuel Bischoff","starring":"Pat O'Brien Ross Alexander Beverly Roberts","running_time":"85 minutes","music_by":"Bernhard Kaun Heinz Roemheld","External links":"","edited_by":"Owen Marks","written_by":"Norman Reilly Raine (add'l dialogue, uncredited)"}