{"country":"United States","distributed_by":"20th Century Fox","Plot":"Outspoken and overconfident Rick Monroe is a jock and a popular guy in college in Titusville, Florida. At the end of his final report for his class, Rick cracks a joke and his prim and proper speech professor, Faye Hanlon, is not amused. After chiding him for his joke, she decides to fail him and make him take the course over again.Faye is going through a slump in her marriage to Whitney Hanlon, a rocket scientist who has just been laid off. Faye's free-spirited sister Patsy, visiting from Chicago, takes her to a strip club to cheer her up. The show features a performer called \"Ricky the Rocket\", who is none other than Faye's student Rick. When he notices Faye in the crowd, he gives her a very special lap dance, kissing her in the process.The next day, Faye and Rick run into each other at a school function. Initially, Rick is interested only in convincing Faye to allow him another chance at his final and is rebuffed. He realizes that she is attracted to him and begins flirting. Faye arranges to meet Patsy near her hotel, only to discover that she has been tricked into seeing another performance by \"Ricky the Rocket\".Since Patsy has to return home a day early, she turns over use of her hotel room to Faye, who calls Whitney and lies that she and Patsy are staying at Patsy's hotel together. Coincidentally, Rick's mother works in the same hotel, and while visiting his mother, Rick runs into Faye again; they return to Faye's room and have sex. Faye must leave and in her absence, Rick invites his girlfriend Slick to the room where she has sex with him as well. Faye catches them in the shower and, humiliated, flees; she realizes that she has been deceived.Whitney, returning home from an unsuccessful job interview, discovers that Patsy has gone home. Whitney travels to the hotel, where he catches Rick as the latter is exiting. He kidnaps Rick at gunpoint, takes Rick to a boat at a small dock, and forces him to strip. Rick, sobbing, complies. Whitney threatens Rick repeatedly, but ultimately only shoots holes in the boat, leaving a naked Rick aboard as it sinks.Faye returns home to find Whitney waiting for her; she apologizes and he forgives her. At the end, the couple talk about their problems and resolve them.","a_night_in_heaven":"Theatrical release poster","language":"English","Reception":"Most critics were hostile to A Night in Heaven, Roger Ebert found it a \"very confusing movie\" that \"introduces several themes and relationships, and asks some big questions\", but \"doesn't pay off on any of them\".[3] Vincent Canby of The New York Times dismissed the film, writing, \"all boredom breaks loose\".[4]Audiences were as hostile to A Night in Heaven as critics had been. The film was a box office bomb, grossing only a little over $5 million on a $6 million budget.Atkins won the 1983 Golden Raspberry Award for Worst Actor.","box_office":"$5,563,663 (US)","cinematography":"David L. Qualye","directed_by":"John G. Avildsen","Soundtrack":"The original music score is composed by Jan Hammer, and the soundtrack features two songs that would later be huge pop hits. \"Heaven\", co-written and performed by Bryan Adams, would become Adams's first American number one song when it was re-released in 1985. An early version of the song \"Obsession\", performed on the soundtrack by its co-writers, Holly Knight and Michael Des Barres, would be re-recorded and released as a single by the band Animotion. The film also featured the song \"Dirty Creature\" by New Zealand/Australian group Split Enz.[2]","release_dates":"November 18, 1983 (1983-11-18)|||||","produced_by":"Gene Kirkwood (executive) Hawk Koch","starring":"Christopher Atkins|Lesley Ann Warren|Robert Logan|","running_time":"83 minutes","music_by":"Jan Hammer Bryan Adams (theme song)","edited_by":"John G. Avildsen","written_by":"Joan Tewkesbury","budget":"$6,000,000[1]"}