{"directed_by":"Sutape Tunnirut","country":"Thailand","angulimala":"The Thai movie poster.","distributed_by":"Film Bangkok","release_dates":"11 April 2003 (2003-04-11)|||||","Plot":"Born a Brahmin, Ahimsaka is studying under a guru when he sees a woman named Nantha attempting to commit suicide by jumping off a cliff. He saves her, but later learns that Nantha was intended to be the bride of his teacher.The teacher, angered by Ahimsaka's attention to his wife-to-be, tells his student that the only way he will attain enlightenment is to kill 1,000 people. This sets Ahimsaka off on a life as a highwayman, and at first he seeks to kill only bandits and other evildoers. To keep track of his victims, he takes a finger from the right hand of each, and wears the fingers around his neck, thus earning him the name Angulimala, \"the wearer of a garland of fingers.\" He struggles to find 1,000 victims, so he resorts to killing all who cross his path. Nantha, wanting to stop the killing, tries to kill Ahimsaka, but only succeeds in killing herself.Eventually, he meets the Buddha himself, who tells Ahimsaka of his wrongful ways and convinces the killer that he can redeem himself by becoming a Buddhist monk.","produced_by":"Adirek Watleela","starring":"Peter Noppachai Jayanama Stella Malucchi","running_time":"105 minutes","language":"Thai","Reception":"Religious leaders and Buddhists called for the film to be banned, voicing concerns that it distorted Buddhist teachings, showed them in bad light and glorified violence.[3] The film was initially blocked from release by government censors, who demanded the film be re-edited for the concerns of the public in Thailand most of which are Buddhist and not Christians.[2][4]Some violent scenes were removed and the film's tagline was changed. It was then viewed by revered monk Phra Phisan Dhammavadhi, who had earlier called for the film to be banned, and found acceptable.[5][6]The film had poor box-office reception in Thailand, which critics blamed on the poor show and violent and negative depiction of the film.[7][8]Nonetheless, Angulimala won at the Thailand National Film Association Awards for best costumes, best visual effects and best supporting actress for Alisa Kajornchaiyakul. It was screened at the 26th Moscow International Film Festival in 2004, where it was in competition for a Golden St. George.[9] It also screened at the Asian Film Festival of Paris in 2004.[10]","written_by":"Sutape Tunnirut"}