{"country":"United States Germany","distributed_by":"Gramercy Pictures","Plot":"Clay Bidwell is a young man in a small town who witnesses his friend, Earl, kill himself because of the ongoing affair that Clay was having with the man's wife, Amanda. Feeling guilty, Clay now resists the widow when she presses him to continue with their affair as if nothing has happened.Clay's problems worsen when he inadvertently befriends a serial killer named Lester Long, who murders the nagging widow in an attempt to \"help\" his \"fishing buddy\". Clay is horrified, but does not go to the police for fear of his role in his friend's suicide coming to light. But that doesn't matter for the police, as well as for savvy female FBI agent Dale Shelby and her partner Reynard, who see Clay as their prime suspect. Yet Clay doesn't tell them of his \"friend,\" who has confessed his crimes to him.","language":"English","Reception":"The film received mixed to positive reviews, holding a 63% \"fresh\" rating on Rotten Tomatoes,[6] and a 49/100 score on Metacritic, indicating \"mixed or average reviews\".[7]","box_office":"$1.8 million[3]","cinematography":"Eric Alan Edwards","production_company":"Scott Free Productions","directed_by":"David Dobkin","clay_pigeons":"Theatrical release poster","release_dates":"September 25, 1998 (1998-09-25) (United States)|July 22, 1999 (1999-07-22) (Germany)||||","Production":"Clay Pigeons was developed under filmmakers Ridley and Tony Scott's company, Scott Free Productions.Vaughn has described his character, Lester, as \"a guy who isn’t necessarily from the West — that’s just an image he’s created of himself. Whatever his reality is — being badly hurt by women or whatever — he’s made it over, taking bits and pieces of things he’s seen in movies. He sees his life as a strange Western movie, with himself as the hero. He thinks he’s a sane person in an insane world.\"[4]Dobkin said of the characters, \"I wanted everyone to be different than what they appear to be — the FBI agent who smokes pot, the small town sheriff who seems slow but is the one who figures [the murders] out in the end.\"[5]","produced_by":"Ridley Scott Tony Scott Chris Zarpas","starring":"Joaquin Phoenix Vince Vaughn Janeane Garofalo","running_time":"104 minutes [1]","music_by":"John Lurie","edited_by":"Stan Salfas","written_by":"Matt Healy","budget":"$8 million[2]"}