{"Cast":"The cast also includes: Frankie Faison[9] as Mr. Townsend, Akeem and Semmi's landlord in Queens; Vanessa Bell as Imani Izzi, Akeem's arranged wife, and Calvin Lockhart as Colonel Izzi, her father; Louie Anderson as Maurice, a McDowell's employee; Allison Dean as Patrice McDowell, Cleo's youngest daughter and Lisa's sister; Samuel L. Jackson as a robber; Vondie Curtis-Hall as the Basketball game vendor; Garcelle Beauvais as a rose bearer; Victoria Dillard as one of Akeem's Zamundan attendants, and Clint Smith as Sweets. Cuba Gooding, Jr. made his film debut as a barber shop customer (he was credited as Boy Getting Haircut). Don Ameche and Ralph Bellamy reprise their roles as, respectively, Mortimer and Randolph Duke from Landis' 1983 Murphy-starring comedy film Trading Places.[10] A segment of the Trading Places score can be heard during their scene. The Dukes' limo driver from that film also cameos as the driver of Akeem and Semmi's limo.[citation needed]Coming to America features Murphy and Hall in several different roles, which, following the success of this film, became a Murphy staple.[11] Hall plays Reverend Brown, who introduces Randy Watson (Murphy).[12] Murphy and Hall play elderly barbers Clarence and Morris respectively, who engage in debate with Saul, the old Jewish man (Murphy). Hall also plays a woman (credited as Extremely Ugly Girl) who flirts with Akeem and Semmi.James Earl Jones and Madge Sinclair would again play a royal couple in The Lion King, voicing the characters of King Mufasa and Queen Sarabi.","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"David Sheffield|Barry W. Blaustein|","story_by":"Eddie Murphy","Legacy":"A television pilot of a weekly sitcom version of the film was produced for CBS, following the film's success, starring Tommy Davidson as Prince Tariq, and Paul Bates reprising his role as Oha. The pilot went unsold, but was televised on July 4, 1989 as part of the CBS Summer Playhouse pilot anthology series.[28]A Tamil movie, My Dear Marthandan, was produced based on the plot of Coming to America.The melody heard in the bathroom scene, where Prince Akeem is being washed by female servants, was sampled in Snoop Dogg's 2006 song \"That's That\" featuring R. Kelly. A remix of the song featuring rapper Nas also features a woman's voice saying \"the royal penis is clean your highness\", a line taken from the same scene.","Plot":"Akeem Joffer, the heir to the throne of Zamunda (a fictional African kingdom), lives a pampered lifestyle with every daily task performed by servants. Akeem has become fed up with this and wishes to do more for himself. The final straw comes when his parents, King Jaffe and Queen Aeoleon, present him with an arranged bride-to-be named Imani Izzi, whom he has never met and who has been trained to obey Akeem's every command. Akeem concocts a plan to travel to the United States to find an intelligent, independent-minded woman he can both love and respect, and who will love Akeem for who he is and not for his wealth and social status as a prince. Akeem and his best friend/personal aide, Semmi, flip a coin to decide between going to either Los Angeles or New York City, and end up going to New York City. They end up in the borough of Queens and rent a run-down apartment in the neighborhood of Long Island City, passing themselves off as poor foreign students. They begin working at a local fast food restaurant called McDowell's—an obvious ripoff of McDonald's—owned by widower Cleo McDowell and his two daughters, Lisa and Patrice.Akeem soon falls in love with Lisa, who possesses all the qualities that the prince is looking for in a woman, as first seen by Akeem at a rally where she makes a strong plea to renovate a playground. The rest of the film centers on Akeem's attempts to win Lisa's hand in marriage, which is complicated by Lisa's lazy and obnoxious boyfriend, Darryl Jenks (Eriq La Salle), whose father owns \"Soul Glo\" (a Jheri Curl–like hairstyling aid). Lisa eventually breaks up with Darryl after he announces their engagement (without Lisa having given her consent) to their families, and starts dating Akeem. Although Akeem thrives on hard work and learning how commoners live, Semmi is not comfortable with living the life of a poor man. When Akeem randomly donates their travel money to the homeless Randolph and Mortimer Duke (characters in the previous Eddie Murphy film Trading Places), Semmi transmits a plea to the King of Zamunda for financial help. This causes Akeem's parents to travel to Queens and expose Akeem's identity as a prince to the McDowells.Mr. McDowell, initially disapproving of the match as he did not want to see his daughter with a man of poor means, is ecstatic that she has in fact attracted the interest of an extremely wealthy prince, but Lisa becomes angry and confused as to why Akeem lied to her about his identity, as he had told her before that he was actually a Zamundan goat herder. Still hurt and angry that Akeem lied to her, she refuses to marry him, even after he offers to renounce his throne, and he returns home with a broken heart, resigned to marry the woman chosen for him by his parents. On the way to the airport, King Jaffe remarks that Akeem can't marry Lisa anyway because of \"tradition,\" and tries defending himself by saying \"Who am I to change it?\", with Queen Aeoleon curtly responding, \"I thought you were the King\".At the final scene's wedding procession, Akeem, still heartbroken, waits dejectedly at the altar as his soon-to-be consort makes her way down the aisle. However, when Akeem lifts the veil to kiss her, he finds Lisa instead of Imani. Akeem and Lisa are married, and they ride happily in a carriage after the ceremony to the cheers of Zamundans. Witnessing such splendor, Lisa is both surprised and touched by the fact that Akeem would have given it up just for her. Akeem offers to formally abdicate if she doesn't want a life like this, but Lisa playfully declines and decides to become royalty instead.","language":"English","box_office":"$288,752,301[1]","cinematography":"Sol Negrin Woody Omens","production_company":"Eddie Murphy Productions","directed_by":"John Landis","Soundtrack":"The soundtrack to the film was released on LP, cassette and CD. The songs \"Coming to America\" by The System, \"Better Late Than Never\" by The Cover Girls and \"Come into My Life\" by Laura Branigan and Joe Esposito were released as singles from the album. \"That's The Way It Is\" by Mel & Kim had been released as a single in the UK, prior to the film's release, in February 1988, and became a top ten hit. It was released as a single in the USA at the time of the film's release.","coming_to_america":"Theatrical release poster illustrated by Drew Struzan.","release_dates":"June 29, 1988 (1988-06-29)|||||","Production":"Coming to America reunited star Eddie Murphy with director John Landis. The two had previously worked together on the comedy hit Trading Places (1983); however, Landis later recalled the differences in working with Murphy on the two movies: \"The guy on Trading Places was young and full of energy and curious and funny and fresh and great. The guy on Coming to America was the pig of the world... But I still think he's wonderful in the movie.\"[13]\"We had a tussling confrontation… We didn't come to blows. Personalities didn't mesh. I grabbed him, and he thought I was playing. So he tried to grab my balls and I pushed him away. But I wasn't kidding. He was doing some silly shit that made me mad. He directed me in Trading Places when I was just starting out as a kid, but he was still treating me like a kid five years later during Coming to America. And I hired him to direct the movie! I was gonna direct Coming to America myself, but I knew that Landis had just done three fucked-up pictures in a row and that his career was hanging by a thread after the Twilight Zone trial. I figured the guy was nice to me when I did Trading Places, so I'd give him a shot… I was going out of my way to help this guy, and he fucked me over. Now he's got a hit picture on his resumé, a movie that made over $200 million, as opposed to him coming off a couple of fucked-up movies – which is where I'd rather see him be right now (laughs).\" – Eddie Murphy[14]Despite the experience, Landis and Murphy collaborated again six years later on Beverly Hills Cop III.South African chorus Ladysmith Black Mambazo sings Mbube during the opening sequence (the song also known as The Lion Sleeps Tonight). The group has gone on to record several different versions of Mbube; however, the version heard in Coming to America had not been released on its soundtrack or on CD as of 2006.Landis's calling card/easter egg, \"See You Next Wednesday\", appears on a science-fiction movie poster in the subway station after Lisa storms off the train.A promotional song for the film, also titled \"Coming to America\", was written and performed by The System.","produced_by":"George Folsey, Jr. Robert D. Wachs","starring":"Eddie Murphy|Arsenio Hall|James Earl Jones|John Amos|Madge Sinclair|Shari Headley|","running_time":"117 minutes","music_by":"Nile Rodgers","edited_by":"Malcolm Campbell George Folsey, Jr.","Release":"Paramount cancelled press screenings of the film, after initial negative reactions to a press screening in New York.[15]Released on June 29, 1988, by Paramount Pictures in the United States, it was a commercial box-office success, both domestically and worldwide.[16][17] The film debuted at number one with $21,404,420 from 2,064 screens, for a five-day total of $28,409,497. The film made $128,152,301 in the United States and ended up with a worldwide total of $288,752,301.[18] It was the highest earning film that year for the studio and the third-highest grossing film at the United States box office.[19]It opened a month later in the UK and earned $7,712,622 during its seven-week run. It opened on September 2 in West Germany, where it debuted at number one with $3,715,791 from 297 screens. It ended its run after 13 weeks with $15,743,447.Review-aggregation website Rotten Tomatoes gives the film a score of 68%, based on reviews from 37 critics.[20]Sheila Benson in the Los Angeles Times called it a \"hollow and wearying Eddie Murphy fairy tale\" and bemoans, \"That an Eddie Murphy movie would come to this.\"[21] Vincent Canby in The New York Times was also critical of the writing, calling it a \"possibly funny idea\" but suggesting the screenplay had escaped before it was ready. Canby viewed the film as essentially a romantic comedy but said the romantic elements fell flat, and the film instead goes for broad slapstick.[22] Siskel & Ebert had mixed opinions on the film. Siskel enjoyed the acting from Murphy and Hall but Ebert was disappointed that Murphy did not bring his usual more lively performance, and Ebert was also critical of the unoriginal script.[23]The film was nominated for two Oscars: Best Costume Design by Deborah Nadoolman Landis and Best Makeup by Rick Baker, who designed the makeup effects for both Murphy's and Arsenio Hall's multiple supporting characters.[citation needed]The film was the subject of the Buchwald v. Paramount civil suit, which the humorist Art Buchwald filed in 1990 against the film's producers on the grounds that the film's idea was stolen from his 1982 script treatment about a rich, despotic African potentate who comes to America for a state visit. Paramount had optioned the treatment from Buchwald, and John Landis was attached as director and Eddie Murphy as the lead, but after two years of development hell Paramount abandoned the project in March 1985. In 1987, Paramount began working on Coming to America based on a story by Eddie Murphy.[24][25] Buchwald won the breach of contract action and the court ordered monetary damages. The parties later settled the case out-of-court prior to an appeal going to trial.[26]Landis said Buchwald's case was \"without merit,\" going on to state:I preface this by saying that I don't know Art Buchwald, and I have nothing against him. I should point out that for all of the media attention to that case, no one ever mentions Barry Blaustein and David Sheffield, the men who actually wrote the script! Every movie I have been involved with that was a big hit had people suing the studio saying it was their idea. We live in a very litigious society. You can sue anybody for anything here. ... [It received much press attention] because it was Art Buchwald! He is an old East Coast media darling. The other lawsuits came from less famous people. I remember on Animal House, there were four or five lawsuits. And Universal just settled them, as that was cheaper than fighting and even prevailing! Art Buchwald is not only East Coast, he's also a newspaperman. The press is going to take his side. The irony of that case is that the only people that [sic] his lawsuit benefited were Eddie Murphy and me because it forced Paramount to open their books.[27]","budget":"$39 million"}