{"country":"United Kingdom","distributed_by":"Warner-Pathé Distributors (UK) 20th Century Fox (US)","screenplay_by":"Jimmy Sangster","story_by":"Anthony Hinds","Plot":"A prologue replays the final scenes from Dracula, in which Dr. Van Helsing (Peter Cushing) destroys Dracula (Christopher Lee) by driving him into the sunlight. These scenes are accompanied by voice-over narration that describes how Van Helsing, a scholar of vampirism, was able to end Dracula's century-long reign of terror and destroy his cult; only the memory of Dracula's evil remains.The main story begins as Father Sandor prevents local authorities from disposing of a woman's corpse as if it were a vampire. Sandor chastises the presiding priest for perpetuating the fear of vampirism, and reminds him that Dracula was destroyed 10 years previously. Sandor visits an inn and warns four English tourists – the Kents – not to visit Karlsbad; they ignore his advice.As night approaches, the Kents find themselves abandoned by their fear-stricken coach driver two kilometres from Karlsbad, in view of a castle. A driverless carriage takes them to the castle, where they find a dining table set for four people and their bags unpacked in the bedrooms. A servant named Klove explains that his master, the late Count Dracula, ordered that the castle should always be ready to welcome strangers. After dinner the Kents settle in their rooms.Later that night, Alan investigates a noise and follows Klove to the crypt, where Klove kills him and mixes his blood with Dracula's ashes, reviving the Count. Klove entices Helen to the crypt, where she becomes Dracula's first victim.The next morning Charles and Diana can find no trace of Alan, Helen or Klove. Charles takes Diana to a woodsman’s hut and then he returns to the castle to search for Alan and Helen. Klove tricks Diana into returning to the castle. Charles finds Alan’s dismembered body in a trunk in the crypt. It is now dark and Dracula rises. Diana meets Helen, but Helen has become one of the undead and she attacks her. Dracula enters and warns Helen away from Diana. Charles struggles with Dracula until Diana realises her crucifix is an effective weapon against vampires. Charles improvises a larger cross and drives Dracula away. They escape from the castle in a carriage, but lose control on the steep roads. The carriage crashes and Diana is knocked unconscious. Charles carries her for several hours through the woods until they are rescued by Father Sandor, who takes them to his abbey.Klove arrives at the monastery in a wagon carrying two coffins bearing Dracula and Helen, but is denied admission by the monks. Ludwig, a patient at the abbey, is in thrall to Dracula and invites the Count inside. Helen convinces Diana to open the window and let her in, claiming to have escaped from Dracula. Diana does, and Helen bites her arm. Dracula drags Helen off, as he wants Diana for himself. Charles bursts into the room and drives the vampires out. Sandor sterilizes the bite with the heat from an oil lamp.Sandor puts silver crucifixes in the two coffins to prevent the vampires from coming back. He then captures Helen and drives a stake through her heart, killing her. Ludwig then lures Diana into Dracula’s presence, where the Count hypnotizes her into removing her crucifix. Dracula coerces her to drink his blood from his bare chest, but Charles returns in time to prevent it, forcing Dracula to flee with the unconscious Diana.Charles and Sandor arm themselves and follow on horseback. A shortcut allows them to get in front of Dracula's wagon and stop it. Charles shoots Klove, but the horses gallop off to the castle. Diana is rescued, while Dracula's coffin is thrown onto the icy moat. Charles attempts to kill the vampire, but Dracula springs out of his coffin and attacks him. Diana and Sandor shoot and break the ice, and Dracula sinks into the freezing waters.","language":"English","box_office":"$364,937 (North American)[1] 854,197 admissions (France)[2]","cinematography":"Michael Reed","production_company":"Hammer Film Productions (UK) Seven Arts (US)","directed_by":"Terence Fisher","Production notes":"Dracula does not speak in the film, save for a few hisses. According to Christopher Lee: \"I didn’t speak in that picture. The reason was very simple. I read the script and saw the dialogue! I said to Hammer, if you think I’m going to say any of these lines, you’re very much mistaken.\"[3] Screenwriter Jimmy Sangster disputed that account in his memoir Inside Hammer, writing that \"Vampires don't chat. So I didn't write him any dialogue. Christopher Lee has claimed that he refused to speak the lines he was given ... So you can take your pick as to why Christopher Lee didn't have any dialogue in the picture. Or you can take my word for it. I didn't write any.\"The film was written into a novel by John Burke as part of his 1967 book The Second Hammer Horror Film Omnibus.The film was made back-to-back with Rasputin, the Mad Monk, using many of the same sets and cast, including Lee, Shelley, Matthews and Farmer. Shelley later remembered accidentally swallowing one of her fangs in one scene, and having to drink salt water to bring it back up again because of the tight shooting schedule, as well as there being no spare set of fangs.The film was released in some markets on a double feature with The Plague of the Zombies. Plastic vampire fangs and cardboard \"zombie eyes\" glasses were distributed to audience members as a gimmick.","release_dates":"9 January 1966 (UK) 12 January 1966 (US)","produced_by":"Anthony Nelson Keys","starring":"Christopher Lee Barbara Shelley","running_time":"90 min.","dracula:_prince_of_darkness":"Theatrical release poster","music_by":"James Bernard","edited_by":"Chris Barnes","Release":"Dracula: Prince of Darkness has been well received by critics, and currently holds an 83% approval rating on movie review aggregator website Rotten Tomatoes based on twelve reviews.[4]The Hammer Story: The Authorised History of Hammer Films called it \"perhaps the quintessential Hammer horror\", but \"contains little that audiences hadn't seen before.\"[5]On 19 January 2012, Hammer Films announced on their restoration blog that StudioCanal UK would release a Region B Blu-ray Disc version of the film on 5 March of that year. The announcement stated it would be \"the chilling DRACULA PRINCE OF DARKNESS, restored at Pinewood from 2-perf cut negative, scanned and restored in 2k. DRACULA PRINCE OF DARKNESS will be presented in all its Techniscope glory, in the original aspect ratio of 2.35:1.\"[6] The Flicker Club in London screened the restored film on 24 February 2012 at a venue in the Old Vic Tunnels. The screening was preceded by a guest introduction by Marcus Hearn and a guest reading from Bram Stoker's original novel Dracula by actor Stephen Tompkinson.Millennium Entertainment (now Alchemy) released the film as part of their \"Hammer Horror Collection\" in a two-disc, three-film set, along with The Legend of the 7 Golden Vampires and Frankenstein Created Woman.","budget":"₤100,000 (approx)[1]"}