{"butch_cassidy_and_the_sundance_kid":"Theatrical release poster by Tom Beauvais","country":"United States","distributed_by":"20th Century Fox","Legacy":"Also in 1969, the Spaghetti Western titled Sundance Cassidy and Butch the Kid was released, starring Giuliano Gemma and Nino Benvenuti.The film inspired the television series Alias Smith and Jones, starring Pete Duel and Ben Murphy as outlaws trying to earn an amnesty.[16]In 1979, a prequel, Butch and Sundance: The Early Days, was released by 20th Century Fox and was directed by Richard Lester. The film received mixed reviews and was a box office flop, but was nominated for an Academy Award for Best Costume Design.A parody titled \"Botch Casually and the Somedunce Kid\" was published in MAD. It was illustrated by Mort Drucker and written by Arnie Kogen in issue No. 136, July 1970.[17]","Plot":"In late 1890s Wyoming, Butch Cassidy (Paul Newman) is the affable, clever, talkative leader of the outlaw Hole in the Wall Gang. His closest companion is the laconic dead-shot \"Sundance Kid\" (Robert Redford). The two return to their hideout at Hole-in-the-Wall (Wyoming) to discover that the rest of the gang, irked at Butch's long absences, have selected Harvey Logan (Ted Cassidy) as their new leader. Harvey challenges Butch to a knife fight over the gang's leadership. Butch defeats him using trickery, but embraces Harvey's idea to rob the Union Pacific Overland Flyer train on both its eastward and westward runs, agreeing that the second robbery would be unexpected and likely reap even more money than the first.The first robbery goes well. To celebrate, Butch and Sundance visit a favorite brothel in a nearby town and watch, amused, as the town sheriff (Kenneth Mars) unsuccessfully attempts to organize a posse to track down the gang. They then visit Sundance's lover, schoolteacher Etta Place (Katharine Ross). On the second train robbery, Butch uses too much dynamite to blow open the safe, blowing up the baggage car. As the gang scrambles to gather up the money, a second train arrives carrying a six-man team of lawmen pursuing Butch and Sundance, who unsuccessfully try to hide out in the brothel and to seek amnesty from the friendly Sheriff Bledsoe (Jeff Corey). As the posse remains in pursuit despite all attempts to elude them, Butch and Sundance determine that the group includes renowned Indian tracker \"Lord Baltimore\" and relentless lawman Joe Lefors, recognizable by his white skimmer. Butch and Sundance finally elude their pursuers by jumping from a cliff into a river far below. They learn from Etta that the posse has been paid by Union Pacific head E. H. Harriman to remain on their trail until Butch and Sundance are both killed.Butch convinces Sundance and Etta that the three should escape to Bolivia, which Butch envisions as a robber's paradise. On their arrival there, Sundance is dismayed by the living conditions and regards the country with contempt, but Butch remains optimistic. They discover that they know too little Spanish to pull off a bank robbery, so Etta attempts to teach them the language. With her as an accomplice, they become successful bank robbers known as Los Bandidos Yanquis. However, their confidence drops when they see a man wearing a white hat (the signature of determined lawman Lefors) and fear that Harriman's posse is still after them.Butch suggests \"going straight\", and he and Sundance land their first honest job as payroll guards for a mining company. However, they are ambushed by local bandits on their first run and their boss, Percy Garris (Strother Martin), is killed. Butch and Sundance ambush and kill the bandits, the first time Butch has ever shot someone. Etta recommends farming or ranching as other lines of work, but they conclude the straight life isn't for them. Sensing they will be killed if they return to robbery, Etta decides to go back to the United States.Butch and Sundance steal a payroll and the mules carrying it, and arrive in a small town. A boy recognizes the mules' brand and alerts the local police, leading to a gunfight with the outlaws. They take cover in a building but are both seriously wounded, after Butch makes a futile attempt to run to the mules in order to bring more ammunition, while Sundance provides cover fire. As dozens of Bolivian soldiers surround the area, Butch suggests the duo's next destination should be Australia. The film ends with a freeze frame shot on the pair charging out of the building, guns blazing, before the Bolivian forces riddle them with bullets.","language":"English","Reception":"The world premiere of the movie was in September 1969, at the Roger Sherman Theater, in New Haven, Connecticut. The premiere was attended by Paul Newman, his wife Joanne Woodward, Robert Redford, George Roy Hill, William Goldman, and John Foreman, among others.[8]The response of major American movie reviewers was widely favorable. Rotten Tomatoes, a film review aggregator counted 89% of critical reviews as favorable.[9] Newman and Redford's chemistry was praised as was the film's charm and humor.Time magazine said the film's two male stars are \"afflicted with cinematic schizophrenia. One moment they are sinewy, battered remnants of a discarded tradition. The next they are low comedians whose chaffing relationship—and dialogue—could have been lifted from a Batman and Robin episode.\"[10] Time also criticized the film's score as absurd and anachronistic.Roger Ebert's review of the movie was a mixed 2.5 out of 4 stars. \"The movie starts promisingly... a scene where Butch puts down a rebellion in his gang [is] one of the best things in the movie... And then we meet Sundance's girlfriend, played by Katharine Ross, and the scenes with the three of them have you thinking you've wandered into a really first-rate film.\" But after Harriman hires his posse, Ebert thought the movie's quality declined: \"Hill apparently spent a lot of money to take his company on location for these scenes, and I guess when he got back to Hollywood he couldn't bear to edit them out of the final version. So the Super-posse chases our heroes unceasingly, until we've long since forgotten how well the movie started.\" The dialogue in the final scenes is \"so bad we can't believe a word anyone says. And then the violent, bloody ending is also a mistake; apparently it was a misguided attempt to copy \"Bonnie and Clyde....\" we don't believe it, and we walk out of the theater wondering what happened to that great movie we were seeing until an hour ago.\"[11]The Writers Guild of America ranked the screenplay #11 on its list of 101 Greatest Screenplays ever written.[12]The film earned $15 million in rentals in North America during its first year of release.[13]With US box office of over US$100 million,[14] it was the top grossing film of the year. Adjusted for inflation, Butch Cassidy and the Sundance Kid ranks as the 34th top-grossing film of all time and the top 10 for its decade, due in part to subsequent re-releases.The film won four Academy Awards: Best Cinematography; Best Original Score for a Motion Picture (not a Musical); Best Music, Song (Burt Bacharach and Hal David for \"Raindrops Keep Fallin' on My Head\"); and Best Writing, Story and Screenplay Based on Material Not Previously Published or Produced. It was also nominated for Best Director, Best Picture, and Best Sound (William Edmondson and David Dockendorf).[15]Butch Cassidy and the Sundance Kid also won numerous British Academy Film Awards, including Best Film, Best Direction, Best Screenplay, Best Cinematography, Best Actor (won by Redford though Newman was also nominated), and Best Actress for Katharine Ross, among others.William Goldman won the Writers Guild of America Award for Best Original Screenplay.In 2003, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".","box_office":"$102.3 million (North America)[3]","cinematography":"Conrad Hall","directed_by":"George Roy Hill","release_dates":"October 24, 1969 (1969-10-24)|||||","Production":"William Goldman first came across the story of Butch Cassidy in the late 1950s and researched it on and off for eight years before sitting down to write the screenplay.[4] Goldman later stated:The whole reason I wrote the... thing, there is that famous line that Scott Fitzgerald wrote, who was one of my heroes, 'There are no second acts in American lives.' When I read about Cassidy and Longbaugh and the superposse coming after them - that's phenomenal material. They ran to South America and lived there for eight years and that was what thrilled me: they had a second act. They were more legendary in South America than they had been in the old West... It's a great story. Those two guys and that pretty girl going down to South America and all that stuff. It just seems to me it's a wonderful piece of material.[5]Goldman says he wrote the story as an original screenplay because he did not want to do the research to make it authentic as a novel.[5]According to Goldman, when he first wrote the script and sent it out for consideration, only one studio wanted to buy it—and that was with the proviso that the two lead characters did not flee to South America. When Goldman protested that that was what had happened, the studio head responded, \"I don't give a shit. All I know is John Wayne don't run away.\"[6]Goldman rewrote the script, \"didn't change it more than a few pages, and subsequently found that every studio wanted it.\"[6]According to the supplemental material on the Blu-ray disc release, Richard Zanuck at 20th Century Fox purchased the script, originally called The Sundance Kid and Butch Cassidy, for $400,000, double the price the studio's board of directors had authorized.[citation needed]The role of Sundance was offered to Jack Lemmon, whose production company, JML, had produced the film Cool Hand Luke (1967) starring Newman. Lemmon, however, turned down the role; he did not like riding horses, and he felt he had already played too many aspects of the Sundance Kid's character before.[7] Other actors considered for the role of Sundance were Steve McQueen and Warren Beatty, who both turned it down, with Beatty claiming that the film was too similar to Bonnie and Clyde. According to Goldman, McQueen and Newman both read the scripts at the same time and agreed to do the film. McQueen eventually backed out of the film due to biling disagreements with Newman. The two actors would eventually team up in the 1974 disaster film The Towering Inferno.Newman was eventually cast for the role of Cassidy. Marlon Brando was seriously considered to team with Newman for one of the roles. He turned it down due to his commitment to Burn. He also felt that it was too similar to his role in One-Eyed Jacks (1961).Joanna Pettet was first offered the role of Etta Place but was forced to turn down the role due to her pregnancy. Katharine Ross was eventually cast for the role of Etta. Sam Elliott made his debut in this film as a card player. He and Ross married in 1984.In addition to some studio interiors and exteriors, the film was shot on location in various parts of Colorado, Utah, New Mexico and for the Bolivia scenes, Cuernavaca and Taxco, Mexico. The cast and crew enjoyed the location work. Redford said: \"We had the best locations possible, to my mind. We had Zion National Park [Utah]; Durango, Colorado. … You rode through that, it was a joy.\"On the first day of shooting, Katharine Ross came to the set to watch the train robbery scenes being filmed. There were five cameras and there were only four operators, so director of photography Conrad Hall (whom she was dating at the time, according to his DVD commentary) put her on the extra camera, showing her how to operate it, and how to move it to get her shot. Director George Roy Hill was furious about this and banned her from the set. The silent bicycle scene was her favorite scene to film because it was shot by the crew's second unit rather than the first unit, directed by George Roy Hill.During the scenes in Bolivia which were shot in Mexico, almost the entire crew and cast suffered from severe diarrhea due to drinking polluted water. Newman, Redford and Ross were exception to this because they preferred drinking soda and alcohol. Redford didn't agree with Newman on the need for rehearsal, feeling that it lessens the spontaneity, but he conceded out of respect for his co-star.Redford wanted to do all his own stunts. Newman was especially upset about Redford's desire to jump onto the train roof and run along the tops of the cars as it moved. Redford said that Newman told him, \"I don't want any heroics around here. … I don't want to lose a co-star.\"Newman did his own bicycle stunts, after his stunt man was unable to stay on the bike, except for the scene where Butch crashes backwards into the fence, which was performed by the director of photography.The only major conflict between Newman and George Roy Hill occurred over what became known as \"the Bledsoe scene,\" a break in the extended superposse chase when Butch and Sundance go to visit an old sheriff hoping to get his help enlisting them in the Army to fight in the Spanish–American War. Newman felt the scene should come at the end of the chase and be the motivation for their flight to South America. Hill disagreed strongly. Every day, Newman came on the set with fresh arguments for why it should be done his way and with increasing passion for his opinion. \"Paul was becoming almost anal about it,\" noted Redford, who at one point jokingly suggested they rename the film \"The Bledsoe Scene.\" Ultimately, Hill won the argument.Lula Parker Betenson, sister of the real Butch Cassidy, often visited the set, and her presence was welcome to the cast and crew. During lulls in shooting she would tell stories about her famous brother's escapades, and was amazed at how accurately the script and Paul Newman portrayed him. Before the film was released, the studio found out about her visits and tried to convince her to endorse the movie in a series of ads to be shown in theatres across the country. She said that she would, but only if she saw the film first and truly stood behind it. The studio refused, saying that allowing her to see the film before its release could harm its reputation. Finally, at Robert Redford's suggestion, she agreed to do the endorsements—for a small \"fee.\"A scene that was cut from the film had Cassidy, the Kid, and Etta in a Bolivian cinema and seeing a screen re-enactment of their gang, depicting Butch and Sundance as ruthless killers gunned down by the law. As the two men watch incredulously, shouting at the screen that it didn't happen that way, Etta walks off to the station to catch the train that would begin her journey back to America. George Roy Hill thought that the scene was somewhat heavy-handed and unnecessary.","produced_by":"John Foreman","starring":"Paul Newman|Robert Redford|Katharine Ross|Strother Martin|Jeff Corey|Henry Jones|","running_time":"110 minutes[1]","music_by":"Burt Bacharach","edited_by":"John C. Howard|Richard C. Meyer|","written_by":"William Goldman","budget":"$6 million[2]"}