{"based_on":"Anthony Adverse  by Hervey Allen","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Sheridan Gibney Milton Krims","anthony_adverse":"Theatrical release poster","In culture":"The initial theme of the second movement of Erich Wolfgang Korngold's violin concerto was drawn from the music he composed for this film. English singer Julia Gilbert adopted the name of the film's main character when recording for the London-based él record label in the late 1980s.Screen legend Tony Curtis (1925–2010), who was born Bernard Schwartz, named himself for the titular character; the novel from which this film was adapted was the actor's favorite. Curtis, who soared to fame with his role in Houdini as the legendary illusionist, was buried with a Stetson hat, an Armani scarf, driving gloves, an iPhone and a copy of his favorite novel, Anthony Adverse.Jack Benny parodied Anthony Adverse on the October 11 and 18 episodes of his \"Jell-o Show\" in 1936.[11]In the 1934 short comedy What, No Men!, when their plane lands in \"Indian Country\" and Gus (El Brendel) is told to throw out the anchor, he tosses out a rope attached to a huge book titled Anthony Adverse.The novel Anthony Adverse, by Hervey Allan, was included in Life Magazine's list of the 100 outstanding books of 1924-1944.[12]","Plot":"In 1773, young English beauty Maria Bonnyfeather (Anita Louise) is the new bride of the cruel and devious middle-aged Spanish nobleman Marquis Don Luis (Claude Rains). However, she is pregnant by Denis Moore (Louis Hayward), the man she loved before being forced to marry Don Luis. After the marquis learns of his wife's affair, Don Luis takes her across Europe but Denis tracks them down at an inn, where Don Luis treacherously kills him in a sword fight.Months later Maria dies giving birth to her son at a chalet in the Alps in northern Italy. Don Luis leaves the infant in the foundling wheel of a convent near the port city of Leghorn (Livorno), Italy, where the nuns christen him Anthony, as he was found on January 17th, the feast day of St. Anthony the Great. Don Luis lies to Maria's father, wealthy Leghorn-based merchant John Bonnyfeather (Edmund Gwenn), telling him that the infant is also dead. Ten years later, completely by coincidence, Anthony (Billy Mauch) is apprenticed to Bonnyfeather, his real grandfather, who discovers his relationship to the boy but keeps it a secret from him. He gives the boy the surname Adverse in acknowledgement of the difficult life he has led.As an adult, Anthony (Fredric March) falls in love with Angela Giuseppe (Olivia de Havilland), the cook's daughter, and the couple wed. Soon after the ceremony, Anthony departs for Havana to save Bonnyfeather's fortune from a laggard debtor, the merchant trading firm Gallego & Sons. The note Angela leaves Anthony is blown away and he is unaware that she has gone to another city. Assuming he has abandoned her, she departs and pursues a career as an opera singer. Learning that Gallego has quit Havana, Anthony leaves to take control of Gallego & Sons only remaining asset—a slave trading post in Africa. Three years in the slave trade (so he can recover Bonnyfeather's debt) corrupts him, taking slave girl Neleta into his bed as he believes Angela has abandoned him. Anthony is eventually redeemed by his friendship with Brother François (Pedro de Córdoba). After the Brother is crucified and killed by the natives, Anthony returns to Italy to find Bonnyfeather has died and his housekeeper, Faith Paleologus (Gale Sondergaard) (Don Luis' longtime co-conspirator, and now wife), has inherited Bonnyfeather's fortune, but Anthony reaches Paris to rectify the situation and claim his inheritance.In Paris, Anthony is reunited with his friend, prominent banker Vincent Nolte (Donald Woods), whom he saves from bankruptcy by giving him his fortune, having learned from Brother François that \"there's something besides money and power\". Through the intercession of impresario Debrulle (Ralph Morgan), Anthony finds Angela and discovers she bore him a son. His wife fails to reveal she is now Mademoiselle Georges, a famous opera star and the mistress of Napoleon Bonaparte. When Anthony learns her secret, she sends him their son, stating that he is better suited to raise the boy. Anthony departs for America with his son, Anthony Jr. (Scotty Beckett), in search of a better life.","language":"English","Reception":"In his review in The New York Times, Frank S. Nugent described the film as \"a bulky, rambling and indecisive photoplay which has not merely taken liberties with the letter of the original but with its spirit . . . For all its sprawling length, [the novel] was cohesive and well rounded. Most of its picaresque quality has been lost in the screen version; its philosophy is vague, its characterization blurred and its story so loosely knit and episodic that its telling seems interminable.\"[5] Variety described it as \"a bit choppy\" and \"a bit long-winded\", but called Fredric March \"an ace choice, playing the role to the hilt.\"[6] Film Daily wrote that it \"easily ranks among the leading pictures of the talking screen\" and called the acting \"flawless\".[7] \"I don't think Mr. March has done any better piece of work than this\", wrote John Mosher in a positive review for the The New Yorker.[8] The film was named one of the National Board of Review's Top Ten pictures of the year and ranked eighth in the Film Daily annual critics' poll.[9]","box_office":"$793,000 (USA)[2]","cinematography":"Tony Gaudio","production_company":"Warner Bros. Pictures","directed_by":"Mervyn LeRoy","release_dates":"July 29, 1936 (1936-07-29)|||||","Production":"Original choices for the lead role include Robert Donat, Leslie Howard and George Brent.[3]Errol Flynn was meant to support Fredric March but proved so popular when Captain Blood was released he was instead given the lead in The Charge of the Light Brigade.[4]","produced_by":"Hal B. Wallis Jack L. Warner","starring":"Fredric March Olivia de Havilland Gale Sondergaard","running_time":"141 minutes","music_by":"Erich Wolfgang Korngold","edited_by":"Ralph Dawson"}