{"based_on":"Zatoichi Challenged written by Ryôzô Kasahara","country":"United States","distributed_by":"TriStar Pictures","screenplay_by":"Charles Robert Carner","story_by":"Charles Robert Carner","Plot":"Nick Parker (Rutger Hauer), an American soldier serving in the Vietnam War, is blinded by a mortar explosion, and soon after rescued by local villagers, who help him recover his health. Although he remains blind, as a part of his recovery, he is taught by the local master to be an expert swordsman, and to train his other senses.Years later, having returned to the United States, he visits old army-buddy Frank Deveraux (Terry O'Quinn), only to find that Deveraux is missing. Parker then rescues Frank's son Billy (Brandon Call) from an attack in which Billy's mother (Meg Foster) is shot and killed by the henchmen of Frank's evil boss, MacCready (Noble Willingham). These men apparently want to kidnap Billy in order to use him as leverage over Frank.Parker and Billy, chased by MacCready's men and lead villain (Randall \"Tex\" Cobb), make their way to Reno, Nevada, where Deveraux is being forced to make designer drugs, which MacCready plans to sell at his casino. Along the way, the two grow fond of each other after a rough start, and numerous attacks by the bad guys are foiled by Nick and his skills.Impressed by Parker's martial-arts skill, MacCready hires a Japanese assassin (Sho Kosugi) to defeat Parker once and for all. This leads to an epic sword-fight between the two in MacCready's penthouse, in which Nick eventually wins by knocking the assassin into a hot tub with electricity running through it. With MacCready and his men dead, Billy is reunited with his father. A tearful Frank confesses to Parker that he has long blamed himself for the accident in Vietnam, and Frank is now able to forgive himself. Although now considered \"Uncle Nick\" to the young Billy, Parker decides to leave Frank and Billy to travel on his own.","language":"English","box_office":"$2,692,037 (domestic)[1]","cinematography":"Don Burgess","production_company":"Interscope Communications","directed_by":"Phillip Noyce","blind_fury":"Blind Fury film poster","release_dates":"August 17, 1989 (1989-08-17) (West Germany)|March 16, 1990 (1990-03-16) (U.S.)||||","Production":"Blind Fury marked the producing debut of actor Tim Matheson. Matheson produced the film having been a fan of the Zatoichi film series.[3] Matheson and co-producer Daniel Grodnik, spent seven years trying to find a distributor for the film. In 1986, the producers landed a deal with film distributor Tri-Star Pictures. According to Grodnik, various writers and directors were attached to the project before Phillip Noyce was hired as the film's director.Hauer calls Blind Fury one of his \"most difficult jobs\" because of the combination of swordplay with playing a blind man; and Hauer spent a month training with Lynn Manning whose first words to him were \"I don't get confused about what I see ...\".[4]Filming took place around the Midwestern United States, where the cast and crew underwent humid weather conditions. Of the intense weather conditions, Matheson stated, \"We shot in the Midwest and West, and it was incredibly hot. Everything was burning up. We ended up buying a three-foot pool for the cast and crew to wade through to cope with the heat.\"[3] After principal photography was completed, a sequel to the film was planned, but never materialized.[3]","produced_by":"Tim Matheson Daniel Grodnik","starring":"Rutger Hauer|Terrance O'Quinn|Lisa Blount|Randall \"Tex\" Cobb|Noble Willingham|","running_time":"86 min.","music_by":"J. Peter Robinson","edited_by":"David A. Simmons","Release":"On their syndicated television program Siskel and Ebert and the Movies, film critics Roger Ebert and Gene Siskel gave the film \"Two thumbs up\".[5]Reviewer Ian Jane of DVD Talk wrote, \"Hauer does a commendable job in the lead and is reasonably convincing as a blind man. Like its Japanese predecessors, there is some humor interjected into the storyline that is handled well without becoming overbearing or taking over the action sequences.\"[6]Based on only 12 reviews, review aggregator Rotten Tomatoes reports that Blind Fury currently holds a 58% \"Rotten\" rating, with a rating average of 4.7 out of 10.[7]The UK version was trimmed when it was released on VHS. The dialogue \"Gasoline mixed with detergent...\" was taken out due to the BBFC's worries of imitations from audiences.[citation needed]"}