{"based_on":"Ben-Hur: A Tale of the Christ  by Lew Wallace","Cast":"Crowd extras during chariot race","country":"United States","distributed_by":"Loew's Inc.[nb 1]","ben-hur":"Theatrical release poster","DVD release":"Ben-Hur was released on DVD, complete with the Technicolor segments, in the four-disc collector's edition of the 1959 version starring Charlton Heston, as well as in the 2011 \"Fiftieth Anniversary Edition\" Blu-ray Collector's Edition three-disc box set.","Plot":"Ben-Hur is a wealthy Jew and boyhood friend of the powerful Roman Tribune, Messala. When an accident leads to Ben-Hur's arrest, Messala, who has become corrupt and arrogant, makes sure Ben-Hur and his family are jailed and separated.Ben-Hur is sentenced to slave labor in a Roman war galley. Along the way, he unknowingly encounters Jesus, the carpenter's son who offers him water. Once aboard ship, his attitude of defiance and strength impresses a Roman admiral, Quintus Arrius, who allows him to remain unchained. This actually works in the Admiral's favor because when his ship is attacked and sunk by pirates, Ben-Hur saves him from drowning.Arrius then treats Ben-Hur as a son, and over the years the young man grows strong and becomes a victorious chariot racer. This eventually leads to a climactic showdown with Messala in a chariot race, in which Ben-Hur is the victor. However, Messala does not die, as he does in the more famous 1959 remake of the film.Ben-Hur is eventually reunited with his mother and sister, who are suffering from leprosy but are miraculously cured by Jesus.[4]","language":"Silent (English intertitles)","Reception":"The studio's publicity department was relentless in promoting the film, advertising it with lines like: \"The Picture Every Christian Ought to See!\" and \"The Supreme Motion Picture Masterpiece of All Time\". Although audiences flocked to Ben-Hur after its premiere in 1925 and the picture grossed $9 million worldwide, its huge expenses and the deal with Erlanger made it a net financial loss for MGM. It recorded an overall loss of $698,000.[3]In terms of publicity and prestige however, it was a great success. \"The screen has yet to reveal anything more exquisitely moving than the scenes at Bethlehem, the blazing of the star in the heavens, the shepherds and the Wise Men watching. The gentle, radiant Madonna of Betty Bronson's is a masterpiece,\" wrote a reviewer for Photoplay. \"No one,\" they concluded, \"no matter what his age or religion, should miss it. And take the children.\"[11] It helped establish the new MGM as a major studio.[12][13]The film was re-released in 1931 with an added musical score, by the original composers William Axt and David Mendoza, and sound effects. As the decades passed, the original two-color Technicolor segments were replaced by alternate black-and-white takes. Ben-Hur earned $1,352,000 during its re-release and made a profit of $779,000 meaning it had an overall profit of $81,000.[3] It remains one of the few films at Rotten Tomatoes to maintain a 100% freshness rating.[14]","box_office":"$10,738,000[2][3]","cinematography":"Rene Guissart Percy Hilburn Karl Struss Clyde DeVinna","production_company":"Metro-Goldwyn-Mayer","directed_by":"Fred Niblo Charles Brabin (uncredited)","Restoration":"The Technicolor scenes were considered lost until the 1980s when Turner Entertainment (who by then had acquired the rights to the film) found the crucial sequences in a Czechoslovakia film archive. Current prints of the 1925 version are from the Turner-supervised restoration which includes the color tints and Technicolor sections set to resemble the original theatrical release. There is an addition of a newly recorded stereo orchestral soundtrack by Carl Davis with the London Philharmonic Orchestra which was originally recorded for a Thames Television screening of the movie.","References":"Explanatory notesCitations","release_dates":"December 30, 1925 (1925-12-30) (US)|||||","Production":"Ben-Hur: A Tale of The Christ had been a great success as a novel, and was adapted into a stage play which ran for twenty-five years. In 1922, two years after the play's last tour, the Goldwyn company purchased the film rights to Ben-Hur. The play's producer, Abraham Erlanger, put a heavy price on the screen rights. Erlanger was persuaded to accept a generous profit participation deal and total approval over every detail of the production.Choosing the title role was difficult for June Mathis. Rudolph Valentino and dancer Paul Swan were considered until George Walsh was settled on. When asked why she chose him, she answered it was because of his eyes and his body. Gertrude Olmstead was cast as Esther.[5][6] While on location in Italy, he was fired and replaced by Ramon Novarro. The role of Esther went to May McAvoy.Shooting began in Rome, Italy in October 1923 under the direction of Charles Brabin who was replaced shortly after filming began. Additional recastings (including Ramon Novarro as Ben-Hur) and a change of director caused the production's budget to skyrocket. After two years of difficulties and accidents, the production was eventually moved back to Metro-Goldwyn-Mayer in Culver City, California and production resumed in the spring of 1925. B. Reeves Eason and Christy Cabanne directed the second unit footage.[7]Costs eventually rose to $3.9 million,[8] making Ben-Hur the most expensive film of the silent era.[citation needed]A total of 60,960 m (200,000 ft) of film was shot for the chariot race scene, which was eventually edited down to 229 m (750 ft).[9] Film critic Kevin Brownlow has called the chariot race sequence as creative and influential a piece of cinema as the famous Odessa Steps sequence in Sergei Eisenstein's The Battleship Potemkin, which introduced modern concepts of film editing and montage to cinema.[10] This scene has been much imitated. It was re-created virtually shot for shot in the 1959 remake, copied in the 1998 animated film The Prince of Egypt, and more recently imitated in the pod race scene in the 1999 film Star Wars: Episode I – The Phantom Menace which was made almost 75 years later.[citation needed]\"Chariot Race\" painting by Alexander von Wagner as basis of the chariot set design/cinematography.Some scenes in the film were in two-color Technicolor, most notably the sequences involving Jesus. One of the assistant directors for this sequence was a very young William Wyler, who would direct the 1959 remake. The black-and-white footage was color tinted and toned in the film's original release print.[7]","produced_by":"Louis B. Mayer (uncredited) Samuel Goldwyn (uncredited) Irving Thalberg (uncredited)","starring":"Ramon Novarro Francis X. Bushman May McAvoy Betty Bronson","running_time":"143 minutes","music_by":"William Axt David Mendoza","edited_by":"Lloyd Nosler","written_by":"June Mathis (adaptation) Carey Wilson (scenario) Carey Wilson (continuity) Bess Meredyth (continuity) Katharine Hilliker (titles) H. H. Caldwell (titles)","budget":"$3,967,000[2][3]"}