{"country":"United States Germany","distributed_by":"Artisan Entertainment Nordisk Film Motion Picture Corporation of America","Plot":"Jerry and Nick are two best buddies whose love lives have hit rock bottom. After Nick runs into a friend who is getting married to a beautiful, younger girl he met on a singles cruise, he decides to take a similar cruise with Jerry. Things do not go as planned though, after a vengeful travel agent books them on a cruise for gay men.During their trip, they come to learn that gay men are less objectionable than they first assumed and Nick especially sheds his homophobia. However, Jerry falls in love with the cruise's dance instructor Gabriella and in order to win her over, he pretends to be gay so he can get closer to her. Meanwhile, Nick blossoms a romance with a bikini model named Inga. After an accidental affair with her mean, sex-obsessed coach Sonya, Nick must fend her off, after she has fallen in love with him as well.In the end, Jerry wins Gabriella while Nick loses out on Inga but sees a potential relationship with her sister instead. However, he is then unwittingly (and unwillingly) reunited with Sonya; much to his disgust and her instant arousal upon seeing him.","language":"English","Reception":"This film was universally critically panned by the critics on its initial release and performed poorly in theaters.[4] Rotten Tomatoes, a review aggregator, reports that 7% of 88 surveyed critics gave it a positive review; the average rating was 2.6/10. The site's consensus reads: \"Boat Trip is a lame, juvenile farce that's heavy on stereotypes and desperate antics but short on brains and laughs.\"[5] Metacritic rated it 18/100 based on 28 reviews.[6] indicating overwhelming dislike by critics.Chris Rock made jokes about Gooding during the 2005 Oscars telecast for starring in this movie after receiving an Academy Award.[7] Many viewed the film as homophobic although a reviewer for The Advocate wrote that the film was too terrible to protest.[8] On the show Ebert and Roeper, Roger Ebert said the film \"was so bad in so many different ways, not only does it offend gays, it offends everyone else.\" His co-host Richard Roeper said, \"If the ship hit an iceberg, I would have been rooting for the iceberg.\"[episode needed]Overall, it was nominated for two Razzie Awards for Gooding as Worst Actor and for Mort Nathan as Worst Director, but lost to Gigli.[9]","box_office":"$15 million[1]","cinematography":"Shawn Maurer","boat_trip":"Film poster","directed_by":"Mort Nathan","release_dates":"October 4, 2002 (2002-10-04) (United Kingdom)|March 21, 2003 (2003-03-21) (United States)||||","produced_by":"Sabine Müller Frank Hübner Brad Krevoy Gerhard Schmidt Andrew Sugerman","starring":"Cuba Gooding, Jr. Horatio Sanz Roselyn Sánchez Vivica A. Fox Maurice Godin","running_time":"94 minutes","music_by":"Robert Folk","edited_by":"John Axness","Release":"Boat Trip was released in the UK on October 4, 2002,[2] and in the US and Canada on March 21, 2003, where the film opened at #10 and grossed $3,815,075 in 1715 theatres. In total, it had a worldwide gross of $15,020,293.[1] It was released on DVD in the US on September 30, 2003.[3]","written_by":"Mort Nathan William Bigelow","budget":"$20 million[1]"}