{"country":"United States","distributed_by":"Roadside Attractions","Plot":"Best friends Joe Bill \"Rack\" Racklin (Toby Keith) and Lonnie Freeman (Rodney Carrington) are deputy sheriffs in the small town of Mangum, Oklahoma that enjoy pig hunting and drinking at the local bar the Thirsty Monkey. After his girlfriend Cammie (Gina Gershon) leaves him, Rack finds out that his old flame Annie Streets (Claire Forlani) has returned home from Chicago to care for her sick mother. Rack, Lonnie, and their friend and fellow deputy Skunk Tarver (Ted Nugent) arrest three local criminals and a Mexican drug lord Tito Garza (Greg Serano) for stealing fertilizer that is intended to make methamphetamine. Garza is scheduled to be turned over to the FBI for federal charges when Annie mysteriously disappears, after a date with Rack, who discovers that Annie has been kidnapped by Tito's older brother Manuel Garza (Carlos Sanz), who runs a large Mexican drug cartel. Manuel demands his brother be returned to him in Santa Luna, Mexico or he will kill Annie. Despite being taken off the case Rack, Lonnie, and Skunk take Tito to Mexico. Along the way they are helped by a group of circus entertainers led by Charlie (Willie Nelson), who gives them a jug of homemade whiskey known as \"circus jolly\". Once in Mexico they engage in a gunfight with Garza's men and it's revealed that Annie's rich and powerful stepfather Buck Baker (Barry Corbin) is Garza's partner and his United Farm Enterprises is the base for the largest methamphetamine operation in Oklahoma. Baker reveals that the local district attorney is corrupt and that he has been giving Annie's mother \"goofy juice\" to make her appear to have Alzheimer's disease. Rack, with the help of an undercover FBI agent, kills Buck and rescues Annie. Rack, Lonnie, and Skunk turn Manuel and Tito over to the FBI in Oklahoma City and return to Mangum where they are cheered by the local crows at the Thirsty Monkey and berated by Sheriff Landry for disobeying orders but does not arrest them and everyone toasts \"whiskey for my men, beer for my horses\".","language":"English","Reception":"The movie was panned by critics, being labeled a bland, boring, stupid, confusing, failed attempt to be a comedy. Other critics said it was made by stoners, for stoners, about stoners, and stars stoners. The movie received a 0% rating on Rotten Tomatoes. Although several critics praised the film's comedic timing and the character's chemistry, most critics thought it was a failed attempt for slapstick comedy, in fact Roger Ebert stated, \"Toby Keith is living with the illusion that anyone can act, something that isn't true, because Broken Bridges was Keith's attempt for the Academy Award for Best Actor, and Beer For My Horses was his attempt for critically acclaimed comedy and the Golden Globe For Best Comedy or Musical, and he failed both times, yet he wasn't recognized by the Razzies, go figure.\"<The film was released to 450 theatres in 2008, and made $235,000 in its opening weekend, and stayed in theatres for four weeks, it made a total of $895,000.[2]","box_office":"$7,587,334","beer_for_my_horses":"Theatrical release poster","cinematography":"Paul Elliott","production_company":"CMT Films Show Dog Productions","directed_by":"Michael Salomon","release_dates":"August 8, 2008 (2008-08-08)|||||","produced_by":"Toby Keith Donald Zuckerman","starring":"Toby Keith Rodney Carrington Willie Nelson Ted Nugent Brit Morgan Tracy Morgan Greg Serano","Box Office":"The film made $800,000 in its limited domestic release, with a possible worldwide gross of $1,500,000.The film is available on DVD and Blu-Ray, and has made $27.5 million in DVD sales, and $14 million in Blu-Ray, for a total of $42.5 million in home video sales.","music_by":"Jeff Cardoni","edited_by":"Paul Trejo","written_by":"Rodney Carrington Toby Keith W.T. Scrags","budget":"$24 million"}