{"cocoon:_the_return":"Promotional poster; Art by John Alvin","country":"United States","distributed_by":"20th Century Fox","Plot":"Five years after they left, the Antareans return to Earth to rescue the cocoons that were left behind. Before they can be retrieved, one of the cocoons is discovered by a science research team and taken to a secure laboratory for testing. The aliens and their human allies must find a way to retrieve the cocoon in time for their rendezvous with the rescue ship, while the humans travelling with them must decide whether to return to Antarea or stay on Earth and become mortal again.Joe learns that his leukemia has returned, but he knows it will be cured again as soon as he and Alma leave Earth. When Alma is hit by a car while saving a child, Joe gives up the last of his lifeforce, saving her life but sacrificing his. Before dying, he tells Alma to take the job and that he loves her. Art and Bess learn that Bess is pregnant, and decide to raise the child on Anterea so they will live long enough to see him grow up. Ben and Mary reconnect with their family and friends, including Bernie who is shown to have found love with Ruby, alleviating his suicidal depression over Rose's death. And although a lovelorn Jack once again attempts to woo Kitty, she instead grants him a vision of his future, showing him children and a wife with a small heart-shaped birthmark on her neck.The next night, before Ben, Mary, Art and Bess leave to meet the Antareans, Alma tells them she is staying on Earth to work at the preschool. Art, Kitty, Ben and his grandson David then rescue the Antarean from the Oceanographic Institute. Sara, one of the scientists working at the institute becomes aware of the company's plans to hand the alien over to the military. Unhappy about this, when she discovers the rescuers she allows them to escape.After the four get the Antarean on Jack's boat out at sea, Ben makes it known to everyone that he and Mary were going to stay on Earth as well, since family was more important than living forever and that they should not outlive their children. When the space ship arrives, they are met by Walter before the Antareans, Art, Bess, and the cocoons left behind from the previous trip are brought aboard the space ship which departs for their homeworld.Back at port after he has said his goodbyes to Ben, Mary and David, Jack is approached by Sara asking if he knows of a place where she could get some gas. They walk and talk for a bit, where Sara tells him she just quit her job. He eventually notices the small heart-shaped birthmark on her neck.","language":"English","Reception":"The film had a generally negative reception.[5] Roger Ebert of the Chicago Sun-Times gave the film two and a half out of four stars saying \"Yes, the performances are wonderful, and, yes, it's great to see these characters back again. But that's about it. For someone who has seen Cocoon, the sequel gives you the opportunity to see everybody saying goodbye for the second time.\"[6] Rotten Tomatoes gave at the film 36% positive reviews based on 36 reviews.The film brought $25 million worldwide, far less than the first film's $85 million worldwide gross.","box_office":"$25 million","cinematography":"Tak Fujimoto","directed_by":"Daniel Petrie","Soundtrack":"The score to Cocoon: The Return was composed and conducted by James Horner who had scored Cocoon. The score mostly consisted of recycled themes and material from the first film. The soundtrack was released on 23 November 1988 through Varèse Sarabande and features nine tracks of score at a running time of just over fifty-three minutes.[4]","release_dates":"November 23, 1988 (1988-11-23)|||||","produced_by":"Richard D. Zanuck","starring":"Don Ameche|Wilford Brimley|Courteney Cox|Hume Cronyn|Jack Gilford|Steve Guttenberg|Barret Oliver|Maureen Stapleton|Elaine Stritch|Jessica Tandy|Gwen Verdon|Tahnee Welch|","running_time":"116 minutes[1]","music_by":"James Horner","edited_by":"Mark Warner","written_by":"Stephen McPherson","budget":"$17.5 million[2]"}