{"based_on":"Dad's Army  by David Croft and Jimmy Perry","country":"United Kingdom","distributed_by":"Universal Pictures|","screenplay_by":"Hamish McColl","Plot":"It's 1944: the end of the Second World War is in sight. In Walmington-on-Sea, Captain Mainwaring's Home Guard suffers from a lack of confidence and usefulness and from low motivation. This is until a glamorous journalist, Rose Winters (Catherine Zeta-Jones) arrives to cover a report on the platoon's exploits and activities. All the men are riled up with her presence, especially Captain Mainwaring and Sergeant Wilson, causing a stir with the townsfolk, especially the platoon's wives. Meanwhile, MI5 have discovered a radio signal transmitted from Walmington towards Berlin, apparently the work of a Nazi spy. MI5's Major Cunningham (Mark Tandy (actor)) and Captain Meeks (Andrew Havill) find Captain Mainwaring and inform him of the enemy presence, stating that \"it could be anyone\". This news gives the Home Guard a chance to make a real presence in the war. The troop tries to catch the spy, until Rose informs the troop that Sergeant Wilson is the spy. Captain Mainwaring believes her and arrests him. Meanwhile, Private Godfrey's sisters (Julia Foster and Annette Crosbie) speculate from their investigative evidence that Rose is the foreign agent among them. Winters records the information that the base set at Dover is a dummy one for German Planes. The troop and their army wives rally to stop Winters and they engage in cross-fire with a German U-boat and a bunch of Wehrmacht soldiers helping Winters to escape. The U-boat flees without Winters boarding. Mainwaring arrests Winters and hands her over to MI5. The troop then parade through Walmington, having fought off the Nazis, and are congratulated by Colonel Theakes. Mainwaring and Wilson explain that they \"had their suspicions\" about Rose, although they never actually did. Theakes then congratulates them further by telling them that they have played a massive part in the war effort, which they had.Ian Lavender makes a cameo as Brigadier Pritchard, providing a link with the original series,[3] Frank Williams reprises his role as the Vicar.[4] The regular series character of the Verger Maurice Yeatman was not recreated for the film.[citation needed] Mrs. Mainwaring, who was a completely unseen character for the whole of the original series, now has a prominently visible role in the film, where she is portrayed as a Chief Volunteer of the local Auxiliary Territorial Service, and is even more pompous, domineering and vociferous than her husband.[citation needed]","dad's_army_(2016_film)":"Theatrical release poster for Dad's Army","language":"English","Reception":"Dad's Army has received mixed reviews from critics. The film currently has a 33% rating on Rotten Tomatoes, based on 28 reviews, with an average rating of 4.9[8] On Metacritic, it has a score of 38 out of 100, based on 7 critics. The film is highly rated by others, and has been likened to the original Dad's Army series.[9]Sean O'Grady, of The Independent, gave the film a five star review, remarking that rather than threatening the series' legacy, it \"surpasses the original\", calling it a \"well-crafted reproduction\" containing all the elements that made the original so clever, durable and loveable.[10]Peter Bradshaw of The Guardian was slightly less convinced, giving it two stars, stating that \"it’s hard to escape the sinking feeling that this is a waste of talent – that this is a good-natured, well-meaning but pointless kind of Brit-comedy ancestor worship; paying elaborate homage to a T.V show that got it right the first time.\" [11]","box_office":"$12.8 million[2]","cinematography":"Christopher Ross","production_company":"DJ Films","directed_by":"Oliver Parker","release_dates":"5 February 2016 (2016-02-05) (United Kingdom)|||||","Production":"Filming began in Yorkshire in October 2014.[5][6] Principal photography took place at North Landing, Flamborough Head and Bridlington. The East Riding Theatre in Beverley was used for Church Hall/Parade room and Captain Mainwaring's office. Sections of the film were also captured in Leeds and Pickering.[7] Jones' van from the original television series, on loan from the Dad's Army Museum, was used in the film.","produced_by":"Damian Jones","starring":"Toby Jones|Bill Nighy|Catherine Zeta-Jones|Tom Courtenay|Michael Gambon|Blake Harrison|Daniel Mays|Bill Paterson|Mark Tandy (actor)|","running_time":"100 minutes[1]","music_by":"Charlie Mole","edited_by":"Guy Bensley"}