{"based_on":"Cimarron 1929 novel  by Edna Ferber","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Arnold Schulman","Plot":"Sabra Cravat's (Maria Schell) wealthy Kansas City parents try to dissuade her from participating in a land run in the Oklahoma territory with her new husband Yancey (Glenn Ford), but she is adamant. During the journey, Sabra's knowledge of her husband's character deepens, and when he lends one of his covered wagons to Tom (Arthur O'Connell) and Sarah Wyatt (Mercedes McCambridge) and their large, destitute family, she experiences his generosity.Upon arriving in Oklahoma and meeting many of Yancey's friends, including a lady of the evening named Dixie Lee (Anne Baxter), she discovers that he is something of an adventurer. Sabra has her first disagreement with Yancey, however, when he staunchly defends an American Indian family whose wagon has been overturned by a group of angry men. Even though a Cavalry officer states that Ben and Arita Red Feather have the right to participate in the land run, Sabra, a French American, wonders aloud whether Yancey should have risked injury just to help some Indians.At high noon on 22 April 1889, thousands of settlers, who hope to claim 160 acres each of free land, race wildly on horseback, wagon, bicycle, and stagecoach across the prairie. Tom is pushed off the stagecoach, whereupon a frantic Sarah plants a stake into the arid dirt near the starting line. Sam Pegler (Robert Keith), an idealistic newspaper owner from Osage, is killed during the run, and Ben is lassoed to the ground by a bigoted roughneck named Bob Yountis (Charles McGraw). After Dixie, angry at Yancey for having married another woman, vengefully claims the land that Yancey had wanted, he decides to forget about ranching and take over Sam's newspaper. The printer, Jesse Rickey (Harry Morgan), remains in Osage with the paper, the Oklahoma Wigwam, while Sam's widow Mavis (Aline MacMahon) sadly returns home.Some time later, Yountis and William Hardy (Russ Tamblyn), a young troublemaker known as the \"Cherokee Kid, \" terrorize a Jewish peddler named Sol Levy (David Opatoshu). Yancey rescues Sol, but the Kid, whose father had been Yancey's friend, refuses to listen to the older man's advice and rides away with his rowdy companions. One night, Yountis, leading a band of Indian-hating townspeople, lynches Ben and destroys his home. Outraged, Yancey shoots Yountis and then brings Arita and her baby to the Cravat house. When the three arrive home, they discover that Sabra has given birth to a baby boy, whom they named Cimarron.Several years pass, and the Kid, now a feared outlaw, reluctantly joins cohorts in robbing the Osage bank. Cornered, the robbers take refuge in the schoolhouse, but when his buddy, Wes Jennings (Vic Morrow) tries to make a child their hostage, the Kid intervenes and is shot. Yancey shoots Wes, thereby earning a large reward, but when he remorsefully tears up the checks, Sabra accuses him of cheating Cim of his future. Dixie confesses that she still loves Yancey, and when he gently rejects her, she sells her farm and opens a \"social club\". Meanwhile, Arita's little daughter Ruby is ejected from the schoolhouse. Yancey files a protest, but the townspeople refuse to allow an Indian to attend school. Yancey charges that they are keeping their children's blood pure, but their heads empty.Soon afterward, Yancey leaves town to participate in another land rush, to the bitter disappointment of his wife. During his five-year absence, Sabra obtains a loan from Sol, who has fallen in love with her. Sabra learns from Dixie that Yancey, who spent several years in Alaska, is now a Rough Rider in Cuba. Dixie also confesses that it is Sabra, not her, whom Yancey loves. That year, Yancey returns, promising to make amends for his absence. Sabra and Cim accept him, and the years pass.One day Yancey excitedly reports that oil has been discovered on the Indian reservation. Tom, whose own oil-rich land has made him wealthy, laughs and says that it is he, not the Indians, who owns the oil rights. Yancey writes in his paper that Tom has swindled the Indians, and the story is reported all over the country. Sabra, meanwhile, worries that Cim is becoming serious about Ruby, whom she considers unfit for her son, but when Yancey tells her that he has been nominated for governor of the territory, she beams. In Washington, she ecstatically dresses for a party, but Yancey learns Tom and his powerful friends will name him governor only if he agrees to cooperate with them. Yancey rejects the post, whereupon Sabra orders him to leave her. Later, Sol, now a successful merchant, lends Sabra a large sum, and she builds the paper into a major enterprise. When Cim informs her that he has married Ruby and is on his way to Oregon, Sabra bitterly complains that he is throwing his life away and then dismisses him from the house.Ten years later, in 1914, Sabra sits at a desk composing an editorial for the newspaper's 25th anniversary. Sol and Tom want her to be the model for a sculpture exemplifying the pioneer spirit, but Sabra protests that the man who ran away from her was the true pioneer. At a surprise anniversary party, Sabra is reunited with her son and his family. She pays tribute to her husband, claiming that she still hopes for his return, but that day, war is declared.In December, Sabra rereads the letter she has received from Yancey, in which he again apologizes for being a disappointment to her. On the table is an open telegram stating that her husband has been killed in action.","language":"English","Reception":"According to MGM records the film earned $2,325,000 in the US and Canada and $2,500,000 overseas, resulting in an overall loss of $3,618,000.[1]In 1961 the film was nominated for Best Art Direction (George W. Davis, Addison Hehr, Henry Grace, Hugh Hunt, and Otto Siegel) and Best Sound (Franklin Milton),[9][10] but failed to win either. While the 1931 adaptation is arguably the better and more successful of the two, the 1960 remake receives more attention and is still broadcast on television.","box_office":"$4,825,000[1]","cinematography":"Robert Surtees","directed_by":"Anthony Mann","release_dates":"February 16, 1961, New York, NY","Production":"MGM bought the remake rights from RKO in 1941 for $100,000.[2]In 1947 it was announced they would make a operetta version starring Kathryn Grayson and produced by Arthur Freed.[3] However this did not happen.MGM announced further plans to make it in February 1958.[4] Glenn Ford soon became attached as star.[5]King Vidor turned down the chance to direct.[6] Arnold Schulman was signed to write the screenplay.[7]The climax was shot in Arizona.[8]","produced_by":"Edmund Grainger","starring":"Glenn Ford Maria Schell Anne Baxter Harry Morgan","running_time":"147 minutes","music_by":"Franz Waxman","edited_by":"John D. Dunning","budget":"$5,421,000[1]"}