{"based_on":"\"The Forbidden\"  by Clive Barker","country":"United States","distributed_by":"TriStar Pictures|PolyGram Filmed Entertainment|","screenplay_by":"Bernard Rose","Legacy":"The film also came in at number 75 on Bravo's 100 Scariest Movie Moments.[17]The character Candyman came in at number 8 on Bloody Disgusting's \"The Top 13 Slashers in Horror Movie History\"[18] and ranked the same on Ugo's \"Top Eleven Slashers\".[19] The actor who played Candyman, Tony Todd, made #53 on Retrocrush's \"The 100 Greatest Horror Movie Performances\" for his role.[20]The film appears in two sections of Filmsite.org's \"Greatest Scariest Movie Moments and Scenes\"[21] and \"Greatest Movie Twists, Spoilers and Surprise Endings\".[22]The film was nominated for AFI's 100 Years...100 Thrills.[23]","Plot":"Helen Lyle, a Chicago graduate student who is researching urban legends, hears of a local legend known as the Candyman. The legend claims that Candyman can be summoned by saying his name five times while facing a mirror, whereupon he will murder the summoner with a hook jammed in the bloody stump of his right arm. She later runs into two cleaning ladies who tell her about the murder of a woman named Ruthie Jean who called the Candyman in her bathroom mirror and was murdered with a hook by Candyman. Helen then finds out that 25 other murders in the area are related to Ruthie Jean. Later that evening, Helen and her friend Bernadette Walsh, skeptical of Candyman's existence, call Candyman's name into the mirror in Helen's bathroom. Nothing happens.Helen learns from Professor Philip Purcell that Candyman was the son of a slave who became prosperous after developing a system for mass-producing shoes during the Civil War. He grew up in polite society and became a well-known artist, sought after for his talent in producing portraits. After falling in love with, and fathering a child with a white woman, Candyman was set upon by a lynch mob hired by his lover's father; they cut off his painting hand and replaced it with a hook. He was smeared with honey stolen from an apiary, prompting the locals to chant \"Candyman\" as bees stung him to death. His corpse was burned and his ashes were scattered across the area where the notorious gang-ridden Cabrini-Green housing project now stands.Helen and Bernadette enter Cabrini-Green, the site of the recent unsolved murder of Ruthie Jean linked to Candyman. There, they meet Anne-Marie McCoy, one of the residents, and a young boy named Jake, who tells her the disturbing story of a child who was castrated in a public restroom by Candyman. They learn that in total 26 residents have been murdered and that the police haven't done anything about them. While Helen explores the run-down restroom, she is attacked by a gang leader that carries a hook and has taken the Candyman moniker as his own in order to enhance his \"street cred\". Helen survives the assault, and is able to identify her attacker to the police, who believe that he is the Candyman serial killer.Helen later faces the real Candyman in a parking garage, who explains that since Helen has been telling people he is just a legend, he must prove he exists. Helen blacks out and wakes up in Anne-Marie's apartment, covered in blood. Anne-Marie, whose Rottweiler has been decapitated and who had found her baby Anthony missing, attacks Helen; in the midst of defending herself, the police arrest Helen. Trevor, Helen's husband, bails her out of jail, but Candyman appears to Helen again and cuts her neck, causing her to bleed to the point of unconsciousness. Bernadette appears at the apartment and is murdered by Candyman, who frames Helen for the murder. Helen is sedated and placed in a psychiatric hospital.After a month's stay at the hospital, a psychologist named Dr. Burke interviews Helen in preparation for her upcoming trial for the murder of Bernadette. While restrained, Helen attempts to prove her innocence by calling Candyman. Candyman appears and murders Dr. Burke, and allows Helen to escape. She briefly confronts Trevor, who is now living with Stacey, one of his female undergraduate students. Helen then flees to Cabrini–Green to confront Candyman and locate Anne-Marie's still-missing infant. In the building's attic, she finds a message implying that she is the reincarnation of Candyman's lover. She finds Candyman, who opens his coat to reveal a ribcage wreathed in bees.Candyman promises to release the baby if Helen helps him incite fear among the residents. However, in order to feed his own legend, Candyman reneges and attempts to immolate them all in a community bonfire when it is lit by Cabrini-Green's residents. Helen rescues Anthony while Candyman is destroyed in the fire, but is fatally burned. The residents, including Anne-Marie and Jake, pay their respects at her funeral, with Jake tossing Candyman's hook into her grave. Afterwards, Trevor stands before a mirror in the bathroom of their former apartment, where he chants Helen's name five times in grief. As a result, Helen's vengeful spirit is summoned and kills Trevor with Candyman's hook, leaving his new lover Stacey screaming when she finds his bloody corpse. In Cabrini-Green, a painting of Helen with her hair ablaze on a wall shows that she has now entered folklore.","candyman":"Theatrical release poster","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 71% of 41 surveyed critics gave the film a positive review; the average rating was 6.2/10. The site's critical consensus reads: \"Though it ultimately sacrifices some mystery in the name of gory thrills, Candyman is a nuanced, effectively chilling tale that benefits from an interesting premise and some fine performances.\"[11] Allmovie praised the film, calling it \"haunting, intelligent and poetic\" and \"the finest Barker adaptation ever committed to film\".[12] Roger Ebert of the Chicago Sun-Times wrote, \"Elements of the plot may not hold up in the clear light of day, but that didn't bother me much. What I liked was a horror movie that was scaring me with ideas and gore, instead of simply with gore.\"[13] Janet Maslin of The New York Times compared it to \"an elaborate campfire story\" with an \"unusually high interest in social issues\".[14] Kevin Thomas of the Los Angeles Times called the film Clive Barker's \"worst to date\"—an ambitious but pretentious film that \"quickly becomes as repellent as it is preposterous.\"[15] Variety called it \"an upper-register horror item that delivers the requisite shocks and gore but doesn't cheat or cop out.\"[16]","box_office":"$25.7 million (US)[1]","cinematography":"Anthony B. Richmond","production_company":"Propaganda Pictures Candyman Films","directed_by":"Bernard Rose","release_dates":"September 11, 1992 (1992-09-11) (Toronto International Film Festival)|October 16, 1992 (1992-10-16) (US)|March 19, 1993 (1993-03-19) (UK)|||","Production":"Although Barker's short story is set in his native Liverpool, Rose decided \"that the film would be much better done in the U.S.\" Assisted by members of the Illinois Film Commission, Rose scouted locations in Chicago and found Cabrini Green \"an incredible arena for a horror movie because it was a place of such palpable fear.\"[2] Rose once said in an interview with The Independent that he found filming in Chicago easier than filming in England.[3]Eddie Murphy was the original choice for the role of Candyman, but the filmmakers could not afford him.[4] According to Todd, \"I met with Bernard Rose, who's a brilliant mind and a great director, and I wanted to say it was a hire. But I just... - People kept telling me, 'Oh you'll never be able to shake this,' and I said, 'You know, I'm gonna do the best I can and go away from that.' I knew when I read it, and I saw the bees and the stuff, I knew things like that haven't been filmed before, so that was interesting. And I've always wanted to find my own personal Phantom of the Opera.\"[5]There was some controversy that the film was depicting racism and racial stereotypes. According to Rose, \"I had to go and have a whole set of meetings with the NAACP, because the producers were so worried, and what they said to me when they'd read the script was 'Why are we even having this meeting? You know, this is just good fun.' Their argument was 'Why shouldn't a black actor be a ghost? Why shouldn't a black actor play Freddy Krueger or Hannibal Lector? If you're saying that they can't be, it's really perverse. This is a horror movie. . .'\"[3] According to Madsen, \"`I was and am now worried about how people will respond. I don`t think Spike Lee will like this film.\"[6]The film's score was composed by Philip Glass. According to Glass, \"It has become a classic, so I still make money from that score, get checks every year.\"[7] Tony Todd confirmed in an interview with IGN that a limited edition featuring 7500 copies of the film's soundtrack was released in February 2015.[5]","produced_by":"Clive Barker|Steve Golin|","starring":"Virginia Madsen|Tony Todd|Xander Berkeley|Vanessa A. Williams|Kasi Lemmons|","running_time":"99 minutes","music_by":"Philip Glass","edited_by":"Dan Rae","Release":"Candyman had its world premiere at the 1992 Toronto Film Festival, playing as part of its Midnight Madness line-up.[8] It was released on October 16, 1992, in the United States, where it made $25.7 million.[1] It was released on home video in February 1993 by Columbia Tri-Star Home Video.[9] A special edition DVD was released in August 2004.[10]","budget":"$8 million[citation needed]"}