{"based_on":"Hounds of Dracula  by Ken Johnson","country":"United States[1]","distributed_by":"Crown International Pictures","Plot":"A Russian road crew accidentally blasts open a subterranean crypt, and the captain of the road crew, fearing looters and criminals, stations a guard near the site. Late in the night, an earthquake shakes loose one of the coffins, which slides down and lands at the feet of the confused guard. Curious as to what has fallen before him, the guard opens the coffin and discovers the body of a dog, impaled by a stake. He removes the stake, which revives the vampiric hound Zoltan.After slaying the guard, Zoltan opens another coffin shaken loose from the crypt, this one holding the body of an innkeeper, Nalder, who once owned the crypt. Zoltan removes the stake from the innkeeper's chest, reanimating the innkeeper. The movie cuts to a flashback of a village in Russia 200 years prior.The dog of an innkeeper saves a woman from being bitten by a bat, Dracula in disguise. Furious over losing his meal to a dog, Dracula bites the woman's savior, turning the dog into a vampire. Now a vampire, the dog turns on its owner, turning the innkeeper into a vampire as well.Back in the present, it appears that Dracula has only one surviving descendant, Michael Drake, a mild-mannered psychiatrist, played by Michael Pataki, who decides to take his wife and children (who are, technically, also Dracula's descendants) on a vacation in his Winnebago, hoping to spend some quality time with his family out in the national forest.Still loyal to the Dracula family, the two vampires travel to the United States, shipping themselves via boat to California. Eventually, Zoltan and company find themselves in the same forest as Michael and his family.Other campers, vacationing with their dogs, discover that their pets are being killed by a strange beast. The deceased animals soon reanimate into vampiric dogs, the minions of Zoltan. Zoltan is killed in the final scene, but a vampire puppy escapes destruction.","language":"English","Reception":"Rotten Tomatoes reports 0% of five surveyed critics gave the film a positive review; the average rating is 3.2/10.[5] Michael Wilmington of the Los Angeles Times called it the nadir of vampire films.[6] TV Guide rated it 1/5 stars and called the film's premise \"ludicrous\".[7] Adam Tyner of DVD Talk rated it 2/5 stars and wrote that the film is too inept to be scary, though it is fun to mock.[4] Writing in The Encyclopedia of Fantasy, John Clute and John Grant call it \"surprising dull\" but complimented the dogs.[8] Welch Everman wrote in Cult Horror Movies that the film \"could have been a pretty effective and frightening movie\" but failed to live up to its potential.[3]","cinematography":"Bruce Logan","directed_by":"Albert Band","dracula's_dog_aka:_zoltan,_hound_of_dracula":"Film poster","release_dates":"June 1978 (1978-06) (North America)|||||","Production":"The film was based on Hounds of Dracula (1977) by Ken Johnson.[2]","produced_by":"Philip Collins","starring":"José Ferrer|Michael Pataki|Arlene Martel|","running_time":"90 minutes","music_by":"Andrew Belling","edited_by":"Harry Keramidas","Release":"Thorn EMI/HBO and United Home Video released it on home video.[3] Anchor Bay released it on DVD on August 20, 2002.[4]","written_by":"Frank Ray Perilli"}