{"based_on":"Cape Fear  by James R. Webb The Executioners  by John D. MacDonald","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Wesley Strick","Plot":"Sam Bowden (Nick Nolte) is a lawyer in the quiet town of New Essex, North Carolina. Max Cady (Robert De Niro) is a former client whom Bowden defended 14 years earlier when he was working as a public defender in Atlanta. Cady was being tried for the violent rape and battery of a young woman. Bowden, appalled by Cady's crime, buried evidence that might have lightened Cady's sentence or even secured his acquittal. After his release from prison, Cady tracks down Bowden. The former convict studied law in prison and assumed his own defense, unsuccessfully appealing his conviction several times. Cady hints strongly that he has learned about Bowden burying the report.Several incidents involving Cady impact the Bowden family, which consists of Bowden's wife Leigh (Jessica Lange) and their teenage daughter Danielle (Juliette Lewis). The family dog, Ben, is poisoned. Bowden attempts to have Cady arrested, but local police lieutenant Elgart (Robert Mitchum), says that there is no evidence Cady has committed any crime. At a bar, Cady meets Lori Davis (Illeana Douglas), a colleague of Bowden with whom the latter may or may not be having a love affair. Later at her house, Cady cuffs her hands behind her back, breaks her arm, and rapes her. Lori refuses to press charges against Cady, fearful that her philandering and possible infidelity will be revealed. Bowden hires private investigator Claude Kersek (Joe Don Baker) to follow Cady. Cady next approaches Danielle at her school by impersonating her new drama teacher and kisses her.Bowden approaches Cady and warns him to leave his family and him alone or suffer the consequences. Cady secretly tapes the conversation with a hidden recorder. Kersek persuades Bowden to hire three men to beat Cady in an effort to intimidate him, but as Bowden watches from a hiding place, Cady turns the tide on his attackers and viciously beats them. Cady hears Bowden from behind his hiding spot and approaches him, intimidating him, but decides to leave. Cady uses the recording of Bowden's threat and an exaggerated display of his own injuries to file for a restraining order against Bowden. Cady's new lawyer, Lee Heller (Gregory Peck), also files a complaint with the North Carolina State Bar, vowing to have Bowden disbarred.Kersek reasons that Cady may try to enter the Bowden house during Bowden's appearance at a bar hearing out of town. They fake Bowden's departure and hide in the house, hoping that Cady will break in so that he can be shot in self-defense. However, Cady attacks and kills Kersek before escaping. Bowden, Leigh, and Danielle discover his body, as well as that of their maid. Horrified, they flee to their house-boat, which is docked upstate along Cape Fear. Cady follows them by tying himself to the chassis of the Bowdens' car. That night, he attacks the family on the boat, beating and tying up Bowden, and prepares to rape Leigh and Danielle while Bowden watches. Danielle sprays Cady with lighter fluid while he lights a cigar, engulfing him in flames and causing him to jump off the boat to extinguish the fire. However, Cady clings to a rope tied to the boat and pulls himself back on board.As the boat is rocked by a violent thunderstorm, a badly burned Cady confronts Bowden with a mock trial. Cady prepares to kill Bowden, but the storm knocks him off his feet, allowing Bowden to gain the upper hand once the women make it to shore. Bowden uses Cady's handcuffs to shackle Cady to the boat. When the boat hits a rock and is destroyed, the fight continues on shore. A raging tide carries Cady away, and he drowns. Bowden then performs a cathartic washing of his blood from his hands before rejoining Leigh and Danielle further up the riverbank.","language":"English","Reception":"The film was a box office success, making $182,291,969 worldwide[5] on a $35 million budget.The film received generally positive reviews by critics, getting praise for its performances, direction, cinematography and editing. It currently has a 76% \"Certified Fresh\" rating on the film aggregator website Rotten Tomatoes based on 46 reviews, with an average score of 7.1 out of 10. The consensus reads, \"Smart and stylish, Cape Fear is a gleefully mainstream shocker from Martin Scorsese, with a terrifying Robert De Niro peformance.\"[6] On Metacritic, the film holds a score of 73 out of 100 based on 9 reviews, indicating \"generally favorable reviews.\"[7]Roger Ebert gave the film three stars, commenting: \"Cape Fear is impressive moviemaking, showing Scorsese as a master of a traditional Hollywood genre who is able to mold it to his own themes and obsessions. But as I look at this $35 million movie with big stars, special effects and production values, I wonder whether it represents a good omen from the finest director now at work.\"[8]American Film Institute recognition:","box_office":"$182.3 million","Cultural references":"The film was parodied in the 1993 Simpsons episode \"Cape Feare\", with Sideshow Bob in the role of Cady. They also pay homage to another Robert Mitchum film The Night of the Hunter in which Sideshow Bob's knuckles (scaled down for a cartoon character with one fewer finger on each hand) say \"Love\" (Luv) and \"Hate\" (Hāt, with the diacritical mark providing the long vowel).In 1995, professional wrestler Waylon Mercy made his WWE (then WWF) debut, with his gimmick based on De Niro's portrayal of Max Cady. However, he only lasted a few months with the company due to a buildup of previous injuries, and the character was abandoned. In 2013, WWE debuted Bray Wyatt, another character partly based on De Niro's portrayal.[11]In the Seinfeld episode \"The Red Dot\", as Elaine's boyfriend rampages through her office to get revenge on Jerry for making him lose his job, Elaine makes a reference to the film.In the Rick and Morty episode \"Ricksy Business\", Lucy (the deranged maid who tries to rape Jerry) is shown clinging to the underside chassis of their car as they drive home, maniacally shouting \"Ha, I'm doing like the movie Cape Fear!\"","cinematography":"Freddie Francis","production_company":"Amblin Entertainment Cappa Films Tribeca Productions","directed_by":"Martin Scorsese","release_dates":"November 13, 1991 (1991-11-13)|||||","Production":"The film was adapted by Wesley Strick from the original screenplay by James R. Webb, which was an adaptation from the novel The Executioners by John D. MacDonald.It was originally developed by Steven Spielberg, who eventually decided it was too violent and traded it to Scorsese to get back Schindler's List, which Scorsese had decided not to make. Spielberg stayed on as a producer, through his Amblin Entertainment, but chose not to be credited personally on the finished film.[1]It was nominated for Academy Awards for Best Actor in a Leading Role (Robert De Niro, who lost to Anthony Hopkins for The Silence of the Lambs) and Best Actress in a Supporting Role (Juliette Lewis, who lost to Mercedes Ruehl for The Fisher King).Nick Nolte is taller than Robert De Niro, but for the movie, Nolte lost weight and De Niro developed muscles until De Niro appeared to be the stronger man. De Niro reportedly took his body fat down to four percent.[2] De Niro also paid a doctor $20,000 to grind down his teeth for the role to give the character a more menacing look.[3]Although a remake of the original Cape Fear, Scorsese's update is also greatly influenced by another Mitchum-starring film, The Night of the Hunter,[citation needed] in which a religiously fanatical criminal has tattoos on his hands reading \"Love and Hate\"; Cady's body is tattooed with various biblical verses such as \"vengeance is mine saith the Lord\", and he tells Sam to read the Book of Job (in which the sins of the father will be visited upon the wife and daughter) and so on. Mirroring the long journey downriver in The Night of the Hunter as Mitchum follows the children is the voyage down Cape Fear River in the houseboat in Cape Fear.The work of Alfred Hitchcock was also influential on the style of Cape Fear. As with the 1962 film version, where director J. Lee Thompson specifically acknowledged Hitchcock's influence, strove to use Hitchcock's style, and had Bernard Hermann write the score, Scorsese made his version in the Hitchcock manner, especially through the use of unusual camera angles, lighting and editing techniques. Additionally, Scorsese's version has opening credits designed by regular Hitchcock collaborator Saul Bass and the link to Hitchcock is cemented by the reuse of the original score by Bernard Herrmann, albeit reworked by Elmer Bernstein.[4] The scene where Cady murders with the piano wire while dressed as the maid Graciella also recalls Hitchcock, specifically the psychosexual crossdressing in female clothing which forms a core theme of Hitchcock's Psycho (although here Cady merely uses the woman's clothing as a deceptive disguise).Cady's character has educated himself while in prison regarding not just legal procedures, but also literature. In the scene where he lures Danielle to the drama theatre, he references Henry Miller's trilogy Nexus, Sexus, and Plexus, and later gives her a copy of one of these novels, which for Cady represent his point of view that the daughter is being controlled by her parents and should liberate herself. Danielle is reading Thomas Wolfe's Look Homeward Angel and Cady is able to show his familiarity with its themes. Furthermore, during the scene in which Cady is beaten by three men hired by Kersek on Sam's behalf to put Cady in the hospital, he quotes a 17th-century writer, and in the final scenes on the house boat, Cady frequently refers to the Ninth Circle of Hell, representing Treachery - a concept derived from Dante's Divine Comedy, specifically from Dante's Inferno.This is also the first film Scorsese shot in the wider 2.39:1 aspect ratio,[citation needed] as opposed to the smaller 1.85:1 ratio in which he had filmed all his previous works (excluding New York, New York, which was shot in 1.66:1).Gregory Peck, Martin Balsam, and Robert Mitchum appear in supporting roles, Peck as Cady's lawyer, Balsam as the judge, and Mitchum as the police lieutenant who suggests to Bowden the possibility of using \"alternative\" means to stop Cady.","produced_by":"Barbara De Fina","starring":"Robert De Niro|Nick Nolte|Jessica Lange|Joe Don Baker|Robert Mitchum|Gregory Peck|","running_time":"127 minutes","cape_fear":"Theatrical release poster by John Alvin.","music_by":"Elmer Bernstein","edited_by":"Thelma Schoonmaker","budget":"$35 million"}