{"country":"United States","Awards and nominations":"For her portrayal of an Oscar nominee, Maggie Smith won the Academy Award for Best Supporting Actress, the Evening Standard British Film Award for Best Actress, the Kansas City Film Critics Circle Award for Best Supporting Actress, and tied with Ellen Burstyn in Same Time, Next Year for the Golden Globe Award for Best Actress – Motion Picture Musical or Comedy. She was nominated for the BAFTA Award for Best Actress in a Leading Role but lost to Jane Fonda in The China Syndrome.Neil Simon was nominated for the Academy Award for Best Adapted Screenplay but lost to Oliver Stone for Midnight Express. He also was nominated for the Writers Guild of America Award for Best Adapted Screenplay.Albert Brenner and Marvin March were nominated for the Academy Award for Best Art Direction but lost to Paul Sylbert, Edwin O'Donovan, and George Gaines for Heaven Can Wait.Jane Fonda received the Los Angeles Film Critics Association Award for Best Actress in honour of her performances in California Suite, Comes a Horseman, and Coming Home.","distributed_by":"Columbia Pictures","DVD release":"The film was released on DVD on Region 1 DVD on January 2, 2002. It is in anamorphic widescreen format with audio tracks in English and French and subtitles in English, French, Spanish, Portuguese, Chinese, Korean, and Thai. There are no bonus features.","Plot":"In Visitors from New York, Hannah Warren is a Manhattan workaholic who flies to Los Angeles to retrieve her teenaged daughter Jenny (played by Dana Plato) after she leaves home to live with her successful screenwriter father Bill. The bickering divorced couple is forced to decide what living arrangements are best for the girl.In Visitors from London, Diana Barrie is a British actress and a first-time nominee for the Academy Award for Best Actress, an honour that could jumpstart her faltering career, although she knows she doesn't have a chance of winning. She is in deep denial about the true nature of her marriage of convenience to Sidney Cochran, a once-closeted antique dealer who has become increasingly indiscreet about his sexual preference. As she prepares for her moment in the spotlight, her mood fluctuates from hope to panic to despair.In Visitors from Philadelphia, conservative middle-aged businessman Marvin Michaels awakens to discover a prostitute named Bunny - an unexpected gift from his brother Harry - unconscious in his bed. With his wife Millie on her way up to the suite, he must find a way to conceal all traces of his uncharacteristic indiscretion.In Visitors from Chicago, Dr. Chauncey Gump and his wife Lola and Dr. Willis Panama and his wife Bettina are taking a much-needed vacation together. Things begin to unravel quickly when everything seems to go wrong and the two men decide to settle their differences by engaging in a very competitive mixed doubles tennis match.","language":"English","Critical reception":"Vincent Canby of the New York Times called it \"the most agreeably realised Simon film in years\" and added, \"Here is Mr. Simon in top form, under the direction of Herbert Ross, one of the few directors . . . who can cope with the particular demands of material that simultaneously means to be touching and so nonstop clever one sometimes wants to gag him. It all works in California Suite, not only because the material is superior Simon, but also because the writer and the director have assembled a dream cast.\"[2]Variety observed, \"Neil Simon and Herbert Ross have gambled in radically altering the successful format of California Suite as it appeared on stage. Instead of four separate playlets, there is now one semi-cohesive narrative revolving around visitors to the Beverly Hills Hotel . . . The technique is less than successful, veering from poignant emotionalism to broad slapstick in sudden shifts.\"[3]Time Out New York described the film as \"quick and varied comedy, highly suited to Neil Simon's machine-gun gag-writing\" and added, \"Fonda provides the film with its centre, giving another performance of unnerving sureness. Also on the credit side is a bedroom farce of epic proportions from Matthau and May. The other vignettes are a bit glum.\"[4]Channel 4 said, \"It's an expertly crafted slick movie that sets up each of its coconuts and knocks them over with a sure eye, but ultimately it's emotional sushi rather than satisfying catharsis.\"[5]","box_office":"$42,913,571[1]","cinematography":"David M. Walsh","production_company":"Rastar","directed_by":"Herbert Ross","california_suite":"Original poster by Nick Cardy","release_dates":"December 15, 1978 (1978-12-15)|||||","Production":"The film was shot on location at The Beverly Hills Hotel, the Dorothy Chandler Pavilion at the Los Angeles Music Center, and along Rodeo Drive.Diana and Sidney's arrival at the Academy Awards was actually shot during the arrivals for the 50th Academy Awards in April, 1978. This may explain the muted response from a real-life crowd unfamiliar with the names \"Diana Barrie\" and \"Sidney Cochran.\"The California-themed paintings seen in the opening credits are by pop artist David Hockney.While the play featured two actors and two actresses each playing several roles, the film features a different actor for each role.","produced_by":"Ray Stark","starring":"Maggie Smith Alan Alda Jane Fonda Walter Matthau Bill Cosby Richard Pryor Elaine May Michael Caine","running_time":"103 minutes","music_by":"Claude Bolling","edited_by":"Michael A. Stevenson","written_by":"Neil Simon"}