{"based_on":"characters created by Brian Garfield","country":"United States","distributed_by":"21st Century Film Corporation","screenplay_by":"Allan A. Goldstein","story_by":"Michael Colleary Allan A. Goldstein","Plot":"Paul Kersey (Charles Bronson) returns to New York City under the name Paul Stewart. He is invited by girlfriend Olivia Regent (Lesley-Anne Down) to a fashion show. Backstage, mobster Tommy O’Shea (Michael Parks) and his goons muscle in on the action. Tommy then threatens Olivia, who is his ex-wife and mother to their daughter Chelsea (Erica Lancaster).Olivia later informs Paul of her ex-husband's behaviour after he finds bruises on her hand. Paul proceeds to confront him, but Tommy points a gun at Paul's face. The confrontation ends with the arrival of Chelsea.NYPD officers Tony Hoyle (Saul Rubinek) and Hector Vasquez (Miguel Sandoval) visit Stewart's home. Paul Stewart is revealed to be Paul Kersey in the Witness Protection Programme. He informs them about Tommy O’Shea. Hoyle says they have been trying to nab Tommy for years, and he wants Olivia to testify.That night at a restaurant, Paul proposes to Olivia, who accepts. Olivia excuses herself to go to the ladies room and is attacked by Tommy’s associate, Freddie \"Flakes\" Garrity (Robert Joy), who in an attempt to prevent her testimony bashes her head on a mirror, causing permanent disfigurement to her face.Freddie escapes, although Paul gets a look at him. At the hospital, where Paul is told Olivia will need reconstructive surgery, he talks with Lt. Mickey King (Kenneth Welsh), who has been working on the O’Shea case for 16 years. Paul is angry but is warned by King not to pick up his old habits and to let the police handle it, but Paul tells him that the law works and that it sometimes doesn't.Tommy escalates the violence, killing several people including female police officer Janice Omori (Lisa Inouye). Paul and Olivia are attacked by Freddie and his friends, who end up shooting Olivia in the back and killing her as the couple tries to escape. She becomes the fourth of Paul's five love interests in the series to be murdered by gang members. Paul jumps from the roof of his apartment, where he lands in a dumpster, and is retrieved by the police.Tommy is \"cleared\" of involvement in his ex-wife’s death and seeks custody of their daughter. This sets the stage for a fight between Paul and Tommy, one that leaves Paul unconscious when he assaults Tommy. He decides to return to his vigilante ways and is later assisted by Hoyle, who learns his department has been corrupted by Tommy. Paul poisons one of Tommy's men, Chuck, with a cannoli. He then kills Freddie by blowing him up with a remote-controlled soccer ball. Tommy finds out from an informant that Paul is the vigilante and will be going after him for killing Olivia. The informant, Hector Vasquez of the NYPD, tries to kill Kersey himself, but Paul gets the upper hand and kills him. Fellow officer Hoyle arrives and finds out Tommy wants both him and Kersey dead. Hoyle comments on Paul's style - \"No judge. No jury. No appeals. No deals.\" - and tells Kersey he must never see him again, and Paul agrees.Tommy hires three thugs, Frankie (Scott Spidel), Mickey (Tim MacMenamin), and Angel (Sandro Limotta), to take care of Paul, using Chelsea as bait. Paul rescues her. Lt. King is wounded by Tommy. Paul kills Sal, one of Tommy's men, by shooting him into a large wood chipper, cutting him into pieces. Paul picks up an empty beer bottle, smashes it, and cuts Tommy's face in retaliation for what he did to Olivia. Armed with a shotgun, Paul corners Tommy.Tommy tries to persuade Paul to spare him by saying \"Whatever you want, whatever you need.\" Paul quickly responds with \"I don't need anything, but you... you need a bath.\" Paul then finally manages to kill Tommy by knocking him into the pool of acid, where he disintegrates until there's nothing left of him. King thanks Paul for saving his life. Paul goes to rejoin Chelsea, calling out to the injured King, \"Hey Lieutenant, if you need any help, give me a call\" while Paul walks toward the 'lighted' hallway.","language":"English","Reception":"Death Wish V was a box office disaster. The film was partially financed through an advanced payment by Trimark Pictures, in exchange for domestic theatrical and home video rights. Trimark released the film on January 16, 1994 to 248 movie theaters. It made $503,936 on its opening weekend, making the seventh most successful box office entry on a national level.[2] Its release in Los Angeles was negatively affected by the 1994 Northridge earthquake (January 17, 1994).[2] The final box office gross of the film in the United States market was estimated at just over $1.7 million. It was released for the home video market later in 1994. Rental records pointed to a solid presence of the film in the video market, but it was not as lucrative as Death Wish 4: The Crackdown (1987).[2]Many fans of the previous four Death Wish films considered this sequel the poorest of the series.[3][4] The film currently holds a two star rating (4.2/10) on IMDb. Death Wish V holds a 0% rating on Rotten Tomatoes.","box_office":"$1,702,394","cinematography":"Curtis Petersen","directed_by":"Allan A. Goldstein","death_wish_v:_the_face_of_death":"Theatrical release poster","release_dates":"January 14, 1994 (1994-01-14) (U.S.)|||||","Production":"The three previous films in the Death Wish series were produced by Cannon Films. In 1989, Cannon faced Chapter 11 bankruptcy and its financial records came under investigation by the U.S. Securities and Exchange Commission. Co-owners Menahem Golan and Yoram Globus also had a personal falling out during the collapse of their company.[1] Golan soon launched his own company, 21st Century Film Corporation.[1] The films of the new company tended to have small budgets and performed poorly at the box office. Meanwhile, the Death Wish films continued to enjoy popularity in the video and television market. Golan came up with the idea of a fifth Death Wish film to serve as a much-needed hit for the company.[2]Financing to start the film production was secured through a loan from the Lewis Horwitz Organization. Golan still owned an unused screenplay for a Death Wish film, submitted in the late 1980s by J. Lee Thompson and Gail Morgan Hickman.[1][2] He decided against using it, since it would be too costly to produce. Instead, he hired Michael Colleary to write a new script.[2]Golan initially reserved directorial duties for himself. His preoccupation with directing Crime and Punishment reportedly prevented him from doing so. Michael Winner was available to direct, but was never asked to do so. According to Winner, his lack of interest in directing Death Wish 4: The Crackdown (1987) may have led Golan to count him out.[2] Golan then hired Steve Carver for the job, an experienced director in the action film genre. Carver recalled discussing with Bronson over the depiction of Paul Kersey. Bronson wanted the character to become more sympathetic and less violent. Carver and screenwriter Stephen Peters started co-operating in revising the script.[2]Carver worked on pre-production for two months before Golan decided to replace him. His replacement was Allan A. Goldstein, who held dual citizenship as a Canadian and American. Carver believes that it was Goldstein's Canadian ties which influenced the decision. Goldstein himself was surprised, since he specialized in drama films. Death Wish V was his first action film.[2] He tried familiarizing himself with the film series by watching the previous entries for the first time.[2] He soon started revising the script. He attempted to insert humor and black comedy elements.[2]The film was shot in Toronto. For tax purposes, several of the roles had to be filled with Canadian actors. Among them were Robert Joy, Saul Rubinek, Kenneth Welsh, and teenager Erica Lancaster.[2] The previous films of the series were mostly shot on location, but the fifth film was mainly shot in a studio. All the scenes involving the dress factory were shot in a studio.[2]Charles Bronson and producer Menahem Golan were not on speaking terms during the filming, only communicating by using director Allan A. Goldstein as an intermediary. Goldstein himself was uncertain of the reasons behind this adversarial relationship.[2] Golan was not present for most of the shooting, preoccupied with filming Crime and Punishment (2002) in Russia.[2]Ami Artzi is credited as the executive producer of the film. He was the president of the 21st Century Film Corporation, working directly under Golan.[2] Damian Lee functioned as the line producer of the film.[2]The film was the first screen credit for screenwriter Michael Colleary. His subsequent credits included the blockbusters Face/Off (1997) and Lara Croft: Tomb Raider (2001).[2]The film was the only one in its series which did not include a rape scene. Flashes of bare breasts in a non-violent context were its only instances of nudity.[2]","Cancelled sequel":"Golan planned to continue the film series without Bronson and announced the upcoming film Death Wish 6: The New Vigilante. But 21st Century Film Corporation went bankrupt and the film project was cancelled.[2] Bronson subsequently appeared in the television film A Family of Cops (1995) and its two sequels.[2]","produced_by":"Damian Lee","starring":"Charles Bronson Lesley-Anne Down Michael Parks Robert Joy Saul Rubinek","running_time":"95 minutes","music_by":"Terry Plumeri","edited_by":"Patrick Rand","budget":"$5 million"}