{"directed_by":"Robert M. Young","country":"United States","distributed_by":"Orion Pictures","release_dates":"December 23, 1988 (1988-12-23)","Plot":"Dominick \"Nicky\" (Hulce) and Eugene \"Gino\" (Liotta) Luciano are twin brothers living together in Pittsburgh, Pennsylvania. Nicky has a learning disability, and Gino cares for him. Gino, who is studying to become a doctor at a local hospital, receives an offer to complete his education at Stanford University but fears that Nicky will not be able to take care of himself. Nicky is a trash collector, a job which finances Gino's education. He and his best friend, Larry (Todd Graff), work for Mr. Johnson (Bill Cobbs). Larry tells Nicky that Gino will leave him for a better life.Gino helps Jennifer (Curtis), a nurse at his hospital, to study for her exams and becomes fond of her. Nicky mentions this to Larry, who tells him that they may get married and abandon him. Although Jennifer is from an affluent family, she is charmed by the brothers' relationship and their humble surroundings. A drug dealer pays the unknowing Nicky ten dollars to deliver an illegal drug, wrapped in newspaper, to a drug user in a rough neighborhood. Nicky forgets the delivery but tells his brother, who worries about his naivete and gullibility.The night of his and Nicky's birthday, Gino must work late at the hospital and calls a disappointed Nicky to tell him. Nicky wants to take Larry to a Wrestlemania event he and Eugene were going to see, but Larry brings him to visit Mrs. Vincent (with whom Larry occasionally has sex). Nicky goes outside while Larry and Mrs. Vincent are busy, and is surprised to see Mikey Chernak (Mrs. Vincent's neighbour and Nicky's acquaintance) with bruises on his face. When Nicky asks where the bruises are from, Mikey says that he fell. Not knowing that Mikey's father Martin (David Strathairn) abuses him, Nicky believes him.Larry and Nicky get drunk, and Larry taunts Nicky about Gino's relationship with Jennifer. Nicky goes home, finds Jennifer and Gino talking and tells Gino he knows he is \"screwing\" Jennifer. Eugene, angry, shoves Nicky before sending him to bed and an embarrassed Jennifer leaves.Nicky, his dog Fred, Gino, Jennifer and next-door neighbor Mrs. Gianelli go on a picnic and Fred is hit by a car. Several days later, Nicky is collecting trash at Mikey's house and sees Martin hitting Mikey and shoving him down a flight of stairs. Martin calls 911, saying that Mikey fell. He sees Nicky, who is inconsolable at what he has seen. An ambulance takes Mikey to the hospital and Nicky runs after it, leaving his co-workers.At the hospital, Martin tells Nicky that Mikey is dead and threatens to kill him if he tells anybody that he pushed the boy; Nicky flees. He takes a gun from Mr. Johnson's truck and returns to Martin's house, where family and friends are grieving. Nicky takes Mikey's baby brother, Joey, from Martin and his wife Theresa at gunpoint, believing that he is protecting Joey from Martin, and is cornered by a SWAT Team in an empty building.Gino, Jennifer, Martin and Theresa race to the building, and Gino is sent in to retrieve Nicky and Joey. He confronts Nicky, whose sight of Mikey's abuse had triggered memories that their father had beaten him about the head. Gino breaks down, admitting that Nicky is right; he had protected Gino from their father, taking blows meant for his twin. Sobbing, he tells Nicky that he is sometimes afraid of his anger at him and does not want to become violent like their father. Nicky comforts Gino, telling him he is not like their father and he loves him.They leave the building and give Joey to Theresa; Eugene protests when the Pittsburgh police handcuff Nicky. Martin pulls a gun aimed at Nicky. Gino and two police officers subdue him, and Nicky tells everyone that Martin killed Mikey. Theresa is horrified; Nicky is released, and Martin is arrested.Gino kisses Jennifer when he leaves for Stanford Medical School, and she promises to give Nicky her phone number. The twins embrace, and Gino leaves. As the credits roll, Nicky is on his garbage route with a new understanding of himself.","dominick_and_eugene":"Theatrical release poster","produced_by":"Mike Farrell Marvin Minoff","starring":"Tom Hulce|Ray Liotta|Jamie Lee Curtis|","running_time":"111 minutes","language":"English","Reception":"The film received positive reviews, holding a 100% rating on the film-review aggregator Rotten Tomatoes based on nine reviews. Hulce received a Golden Globe nomination for his performance (Best Actor – Motion Picture Drama).[1]","box_office":"$3,076,031"}