{"country":"United States","distributed_by":"Relativity Media","language":"English","Reception":"On Rotten Tomatoes, the film has a rating of 33% based on 9 reviews; the average rating is 5/10.[16]","box_office":"$3.4 million[2]","Synopsis":"Jessie (Kate Bosworth) and Mark (Thomas Jane) Hobson adopt a new foster child, Cody (Jacob Tremblay) after their son Sean dies. They soon find out that Cody's dreams become reality, but his nightmares are deadly. Jessie and Mark must figure out what to do before one of his nightmares kills.","before_i_wake":"Theatrical release poster","cinematography":"Michael Fimognari","production_company":"Intrepid Pictures Demarest Films MICA Entertainment","directed_by":"Mike Flanagan","release_dates":"September 9, 2016 (2016-09-09) (United States)|||||","Production":"On September 7, 2013, it was announced that Oculus director Mike Flanagan was set to direct a horror film called Somnia he co-wrote with Jeff Howard for Intrepid Pictures; the producers will be Trevor Macy and William D. Johnson. Demarest Films' Sam Englebardt will co-produce and co-finance the film with MICA Entertainment headed by Dale Armin Johnson.[3] Focus Features International initially handled international sales of the film.[3] On November 7, 2013, it was announced that Sierra/Affinity would now handle all international rights which were previously held by FFI.[5] On April 4, 2014, Relativity Media acquired the US distribution rights to the film.[7] In March 2015, the title was changed to Before I Wake.On November 7, 2013, Kate Bosworth and Thomas Jane joined the lead cast of the film as the child's parents, and Jacob Tremblay is set to play as Cody.[5] On November 18, 2013, Annabeth Gish joined the cast of the film; she will play Natalie, the case worker assigned to young Cody.[6]Filming commenced on November 11, 2013, in Fairhope, Alabama.[8][9][10] On December 12, 2013, the crew filmed scenes at Barton Academy.[11] Filming completed on December 16, 2013.[8][9] The music will be composed by Danny Elfman and the Newton Brothers.[12]","produced_by":"Sam Englebardt|William D. Johnson|Trevor Macy|","starring":"Kate Bosworth|Thomas Jane|Jacob Tremblay|Annabeth Gish|Dash Mihok|","running_time":"97 minutes[1]","music_by":"Danny Elfman|The Newton Brothers|","edited_by":"Mike Flanagan","Release":"On April 4, 2014, Relativity Media acquired the US distribution rights to the film.[7] The film was originally scheduled to be released on May 8, 2015, but was pushed back to September 25, 2015, and was pulled from the scheduled due to the company filing for bankruptcy.[13] The film was re-scheduled to April 8, 2016.[14] The film was then re-scheduled to September 9, 2016.[4]In June 2016, it was announced that the film would screen at the Fantasia International Film Festival in July. [15]","written_by":"Mike Flanagan|Jeff Howard|"}