{"Cast":"Several actors who later had notable film or television careers appeared as uncredited extras, including John Malkovich (in one of his first film appearances), Gary Sinise, Laurie Metcalf and George Wendt.","country":"United States","Awards and nominations":"Carol Burnett was nominated for a Golden Globe Award for Best Supporting Actress in a Motion Picture.","distributed_by":"20th Century Fox","Plot":"Dino Corelli (Desi Arnaz Jr.) marries Muffin Brenner (Amy Stryker) in a lavish Episcopalian church wedding presided over by a doddering, forgetful bishop. After the ceremony, the wedding party and guests drive back to the Corelli mansion for the reception. Meanwhile, the elderly, bedridden matriarch Nettie Sloan (Lillian Gish), mother of Regina Sloan Corelli (Nina Van Pallandt) and grandmother of the groom Dino, is being tended in her upstairs bedroom at the mansion by drunk, lecherous Dr. Jules Meecham (Howard Duff). Nettie is lying in her bed speaking with wedding planner Rita Billingsley (Geraldine Chaplin) when Nettie suddenly dies peacefully. Dr. Meecham informs Dino's father and head of household Luigi Corelli (Vittorio Gassman) of Nettie's death, but leaves it to him to tell his wife Regina, which Luigi is unable to do because Regina is high on drugs and mentally unstable. Nettie's corpse remains lying in bed, appearing to be asleep, throughout the reception, while various attendees are quietly told about her death or in some cases visit her in her room without realizing she's actually dead. By the time her bossy daughter Toni (Dina Merrill) finds out and calls a family meeting to make a dramatic announcement, the other family members are mostly not surprised or even too upset.The Brenners are a nouveau riche family from Louisville, Kentucky, where Muffin's father, \"Snooks\" Brenner (Paul Dooley), made millions in the trucking industry. Muffin and Dino met because his military academy was located next to the Brenner's estate. By contrast, the Corellis are an old money North Shore Chicago family via Regina's and Nettie's Sloan lineage. Luigi is a seemingly wealthy Italian immigrant who is rumored to have mob connections. Due to the family's questionable past, more than a hundred guests sent their regrets, and only one guest (other than family members and the wedding party) attends. Nevertheless, the imperious and very proper Rita is determined to run the reception by the book, setting up a lengthy receiving line for the one guest and then asking family members and staff to also go down the line so it won't look so empty.During the reception, a series of disasters unfold, including the display of an embarrassing nude life-size portrait of the bride (a gift from the groom's bohemian Great-aunt Bea); the caterer Ingrid Hellstrom (Viveca Lindfors) becoming ill, then getting high and causing a disturbance after Dr. Meecham gives her a pill; and a tornado blowing up just as the cake is about to be cut, forcing everyone to rush to shelter in the cellar. Two more guests arrive late, Tracy Farrell (Pam Dawber) and Wilson Briggs (Gavan O'Herlihy), the exes of the groom and bride respectively. Wilson was also Dino's roommate and was supposed to be his best man, but stood him up, allegedly because he spent the night in jail, but possibly out of sour grapes because Dino stole Muffin from him. Tracy and Wilson bond over their mutual anger at having been thrown over by Dino and Muffin.The unsavory secrets of each family are revealed. Regina Corelli is a drug addict who needs regular injections just to stay functional for the day. Regina and Luigi's marriage was arranged by Nettie after he met Regina while working as a waiter in Italy. As a condition of the marriage, Luigi was forced to change his name, hide his true background and be estranged from his Italian family for 22 years. Luigi's Italian-speaking brother unexpectedly shows up, making passes at all the women in attendance, and Luigi at first begins to yell at him and throw him off the estate, but when Dr. Meecham reminds Luigi that Nettie is dead and can't impose the marriage conditions anymore, Luigi is thrilled to see his long-lost brother again. Regina's sister Clarice has an ongoing scandalous romance with Randolph, the African-American family butler; her other sister Toni is married to Mack Goddard (Pat McCormick), who falls in love at first sight with Tulip Brenner (Carol Burnett), the mother of the bride. Mack spends the entire reception trying to secretly woo Tulip into agreeing to meet him after the wedding in Tallahassee for a tryst. At first Tulip is horrified, but as the day goes on and he persists in expressing his love, she begins to return his feelings.Snooks Brenner is mean to his wife Tulip but has a borderline incestuous attachment to his nearly mute daughter Buffy (Mia Farrow), the maid of honor, who speaks in the film only once, to tell Dino she's pregnant and he is the father. Buffy behaves seductively towards almost all men including her father, and is jealous of the attention being paid to her sister Muffin, the bride. When video is being taken of the wedding gifts, Buffy, not wanting to be upstaged, disrobes and poses topless in front of the nude portrait of Muffin. Dino confides in Wilson about Buffy's pregnancy, and Wilson tells Tracy, who vindictively spreads the rumor during the reception. When the Brenners hear the rumor that Buffy is pregnant by Dino, Snooks angrily calls a family meeting to confront Dino, who admits sleeping with Buffy but says she also slept with just about every member of his military school barracks, a fact Buffy confirms. Meanwhile, Snooks' much-married sister Marge Spar from New Jersey starts a new romance with the Corellis' gardener, and bridesmaid Rosie Bean tries to build the confidence of her shy friend Shelby Munker, not knowing that Shelby is actually having a secret affair with Rosie's handsome husband Russell.Muffin and Dino prepare to leave for their honeymoon in their new car, provided by the Corellis as a wedding present. While dressing to go away, the naive Muffin is rattled when Rita makes an unexpected pass at her. She then finds Dino in the shower with his groomsman Captain Reedley Roots, seemingly engaged in a gay romantic encounter. Although Roots is a closet gay who likely has feelings for Dino, he actually took Dino into the shower to sober him up since Dino was too drunk to drive. The newlyweds' car is seen driving away and the families assume that Dino and Muffin left without saying goodbye. Snooks, still angry about the Buffy situation, gathers his family (minus Buffy, whom he angrily leaves behind) to drive back to their hotel. On the way the Brenners see Dino's car in a wreck on the highway, totaled and in flames, and rush back to the ongoing party at the Corelli mansion to share the awful news. The families, assuming Muffin and Dino are dead, are grieving wildly when suddenly Muffin and Dino appear from upstairs, having never left the mansion due to Dino's passing out drunk. It turns out Tracy and Wilson, lacking their own car and out for revenge, swiped the newlyweds' car and crashed it, dying in the wreck. The families rejoice that Muffin and Dino are unharmed. Tulip decides that this incident was God punishing her for her sinful thoughts of having an affair with Mack, and now that God has returned Muffin to her and given her a second chance, she can't go through with it and tells Mack goodbye forever.Luigi pays his respects to the dead Nettie and talks to her corpse. He says that he has kept his side of their bargain as an obedient servant for 22 years, and no one there knows who he really is, but now that Nettie's family is stable, his children are grown and Dino is married, there is nothing left for him to do and he will take his leave. He finds his brother in the bushes, making love with Buffy. Luigi and his brother happily drive away as a half-dressed Buffy emerges from the bushes waving goodbye.","language":"English","Reception":"Roger Ebert gave A Wedding three-and-a-half out of four stars, writing: \"It begins in comedy, it moves into realms of social observation, it descends into personal revelations that are sometimes tragic, sometimes comic, and then it ends in a way that turns everything back upon itself. The more you think about what Altman's done, the more impressive his accomplishment becomes.\"[5] Rotten Tomatoes reports a 78% approval rating among critics, based on nine reviews.","box_office":"$3.6 million (US/ Canada)[1]","cinematography":"Charles Rosher","production_company":"Lion's Gate Films, Inc.","directed_by":"Robert Altman","release_dates":"August 29, 1978 (1978-08-29)|||||","Production":"The film was inspired by a remark Altman made while doing publicity for his previous film, 3 Women. Upon being asked what his next movie would be, Altman jokingly replied that he was going to shoot a wedding next. Later, Altman and his production assistant decided to follow through on the idea and began planning the film.[2]The role of \"Bishop Martin\" was the final film appearance by longtime actor and director John Cromwell, who died Sept. 26, 1979 at age 91.[3] Cromwell's wife of 33 years, Ruth Nelson, appeared as \"Aunt Beatrice Sloan Cory.\"A Wedding was the 100th film in which Lillian Gish appeared.[4]","produced_by":"Robert Altman","starring":"Desi Arnaz Jr. Carol Burnett Geraldine Chaplin Howard Duff Mia Farrow Lillian Gish","running_time":"125 minutes","a_wedding":"Theatrical release poster","edited_by":"Tony Lombardo","written_by":"John Considine Allan F. Nicholls Patricia Resnick Robert Altman"}