{"country":"Canada United States","distributed_by":"American International Pictures","Plot":"Ezra Cobb lives with his mother in an unidentified region of the Midwest. His mother, a religious fanatic, has indoctrinated him since childhood to hate women. Upon her death, Ezra digs her up again, believing that she is still alive.Ever more deluded each passing day, Ezra digs up various bodies, restoring them from their decomposition and even using them as home decor. Soon, Ezra's obsessions go beyond the dead themselves, and he becomes a serial killer. Luring women into his grasp, he soon finds various other \"creative\" ways in which to decorate his home.","language":"English","Reception":"Deranged received mixed reviews from critics as it holds a 60% rating on Rotten Tomatoes.","DVD releases":"In 2002, MGM released Deranged as part of its \"Midnite Movies\" collection of double feature DVDs. It was released along with the 1980 feature film Motel Hell.[2] A second release of the film was also made available in the United States on DVD from Desert Island Classics on March 5, 2014.[3]In 2007, Germany released a 30th Anniversary Collector's Edition. The U.S. DVD received a cut R rating, the German version is unrated and uncut, with a brain scooping scene which is cut from the U.S. version, it is also in 1.85:1 anamorphic widescreen, with both an English and German (dubbed) audio track and optional English and German subtitles. The Extras include: Deranged Chronicles - The Making of Deranged, The Ed Gein Story - Documentary, Ed Gein: American Maniac - Documentary, The Making of: Tim Ritter's Creep (an unofficial sequel to Deranged), Original Trailer, Unrated Version Trailer, Teaser Trailer and a 24-page booklet.[4]Deranged was released on Blu-ray format in the United Kingdom via Arrow Films on August 19, 2013, which contains both a Blu-ray and DVD of the film.[5] The film is set to be released on Blu-ray in the United States on July 7, 2015 by Kino Lorber distribution.[6]","cinematography":"Jack McGowan","directed_by":"Alan Ormsby and Jeff Gillen","Filming locations":"The Canukr Film Studios in Mitchell's Corners, Ontario was the main studio in which all the indoor scenes were shot.[1] The masks were produced here too. The Enniskillen General Store is where Sally worked and where Ezra shot her, grazing her head. The chase scene between Ezra and Sally took place just south of the studio on Pebblestone Road beside Farewell Creek. The actual Cobb farm was located on the Oak Ridges Moraine north of Elizabethville, Ontario at Oak Hill.","deranged":"US theatrical poster","release_dates":"February 1974 (1974-02)|||||","produced_by":"Tom Karr Bob Clark (uncredited)","starring":"Roberts Blossom Cosette Lee Leslie Carlson Robert Warner","running_time":"82 minutes","music_by":"Carl Zittrer","written_by":"Alan Ormsby"}