{"country":"United States","distributed_by":"Orion Pictures","Plot":"In 1916, the notorious bandit El Guapo and his gang of thugs are collecting protection money from the small Mexican village of Santo Poco. Carmen, daughter of the village leader, searches for someone who can come to the rescue of her townspeople. While visiting a small village church, she watches a silent film featuring \"The Three Amigos\" and, believing them to be real heroes, sends a telegram to Hollywood asking them to come and stop El Guapo and offering a substantial payment she cannot afford, believing that they will refuse it and say \"Our reward is that justice has been done\", as happened in the film she saw. However, the telegraph operator heavily edits her message since she has very little money to pay for it, rendering it ambiguous.Meanwhile, Lucky Day, Dusty Bottoms, and little Ned Nederlander are Hollywood silent film actors who portray the heroic Amigos on screen. When they demand a salary increase, studio boss Harry Flugleman fires them and evicts them from their studio-owned housing. Shortly afterward, they receive Carmen's telegram and its offer of generous payment, but misinterpret it as an invitation to make a movie with El Guapo instead of a plea for assistance. The trio agrees to go after realizing they have lost everything they had in Hollywood.After breaking into the studio to retrieve their costumes, the Amigos head for Mexico. Stopping at a cantina near Santo Poco, they are mistaken for associates of a fast-shooting German pilot, who is also looking for El Guapo and who had arrived just before they did. The Amigos perform a show at the cantina, singing \"My Little Buttercup\", and leave the locals confused. The German's real associates then arrive at the cantina, proving themselves adept with their pistols. A relieved Carmen picks up the Amigos and takes them to the village, where they are put up in the best house in town and treated very well.The next morning, when three of El Guapo's men come to raid the village, The Amigos, thinking they are shooting a movie, do a Hollywood-style stunt show. The Amigos then discuss payment as they are to believe the movie shoot is over and their job is done. The bandits ride off, making everyone think that the Amigos have defeated the enemy. In reality, the men inform El Guapo of what has happened, and he decides to return in full force the next day and kill the Amigos.The village throws a boisterous celebration for the Amigos and their (supposed) victory. The next morning, El Guapo and his gang come to Santo Poco and call out the Amigos. The Amigos, once again thinking they are shooting a movie, perform another Hollywood style stunt show to try to scare El Guapo out of town. Lucky confesses that they have only been acting and are too scared to confront him after he gets shot in the arm by El Guapo's right hand man Jefe. El Guapo allows the Amigos to leave the town as his men loot the village and kidnap Carmen, and the Amigos leave Santo Poco, humiliated.With nothing waiting for them back home, Ned persuades Lucky and Dusty to become real-life heroes and go after El Guapo. Their first attempt to find his hideout fails when the Amigos arrive at the Singing Bush and Dusty accidentally kills the Invisible Swordsman, whom they are trying to summon. Nevertheless, they spot an airplane and follow it to El Guapo. The plane is flown by the German, who has brought a shipment of rifles for the gang with his associates' help. Preparations are underway for El Guapo's 40th birthday party, and he plans to make Carmen his bride. The Amigos try to sneak into the hideout with mixed results: Lucky is captured and chained up in a dungeon, Dusty crashes through a window into Carmen's room, and Ned gets his spurs stuck in a piñata hanging overhead.As Lucky frees himself and Dusty sneaks out only to be caught, Ned falls loose and is also captured. The German, having idolized Ned's quick-draw and gunspinning pistol skills since childhood, challenges him to a shootout. Ned wins, killing the German, and Lucky holds El Guapo at gunpoint long enough for Carmen and the Amigos to escape—first on horseback, then in the German's plane.Returning to Santo Poco with El Guapo's entire army in pursuit, the Amigos rally the villagers to stand up for themselves and plan a defense. The bandits arrive in the seemingly empty village, only to find themselves suddenly being shot at by Amigos from all sides and falling into hidden water-filled trenches dug by the villagers. Eventually all of El Guapo's men either desert him or die in the gunfire, and he also receives a fatal wound. As he lies dying, the villagers, all armed and wearing replicas of the Amigos' costumes, step out to confront him. El Guapo congratulates them on their victory, then shoots Lucky in the foot and dies laughing.The villagers offer to give the Amigos all the money they have, but the Amigos refuse it, saying (as in their movies) \"Our reward is that justice has been done\". The Amigos give the villagers the \"Amigo Salute\" and then ride off into the sunset.","language":"English","Reception":"With an estimated budget of $25 million, ¡Three Amigos! had a domestic gross of $39,246,734.[3]¡Three Amigos! received generally mixed reviews from critics. Review aggregator Rotten Tomatoes reports that 44% of 34 film critics gave the film a positive review, with a rating average of 5 out of 10.[10] Film critic Roger Ebert awarded the film one out of four stars and said, \"The ideas to make Three Amigos into a good comedy are here, but the madness is missing.\"[11] Janet Maslin of The New York Times gave the film a mixed review, writing that it was \"likable\" but lacked a \"distinctive style\", and then certain jokes are crafted with \"enjoyable sophistication\".[12] Caroline Wetsbrook of Empire awarded the film three out of five stars and wrote that it was \"good-natured enough to sustain its ultimately thin premise\".[13]Despite this, the film has since been reviewed more favorably and has become a cult classic. Neil McNally of the website Den of Geek noted that the film was \"unfairly overlooked\" when first released, and praised the performances of Martin, Chase, and Short; the comedic scriptwriting of Landis; and the \"sweeping, majestic\" score by Bernstein.[14] The film was ranked #79 on Bravo's list of the \"100 Funniest Movies\".[15]","box_office":"$39.2 million[3]","cinematography":"Ronald W. Browne","production_company":"HBO Films","directed_by":"John Landis","three_amigos":"Theatrical release poster","Music":"Elmer Bernstein wrote the score for ¡Three Amigos! and Randy Newman wrote the songs.","release_dates":"December 12, 1986 (1986-12-12)|||||","Production":"The film was written by Martin, Michaels, and Randy Newman. Newman contributed three original songs: \"The Ballad of the Three Amigos\", \"My Little Buttercup\", and \"Blue Shadows\", while the musical score was composed by Elmer Bernstein. It was shot in Simi Valley, California, Coronado National Forest, Old Tucson Studios, and Hollywood.[citation needed]John Landis was on trial over the Twilight Zone tragedy during the editing of ¡Three Amigos!, and the studio heavily edited the film down after he submitted his final cut.[5]Since he is a co-screenwriter, Martin had been attached to the project since 1980 and he, Dan Aykroyd, and John Belushi were originally going to play the Three Amigos. At one point, Steven Spielberg was slated to direct; he wanted Martin, Bill Murray, and Robin Williams to portray Lucky, Dusty, and Ned respectively.[6] Landis has said that Rick Moranis would have been cast as Ned had Short been unavailable.[7]Martin developed tinnitus after filming a pistol-shooting scene for the film.[8]Several deleted scenes were included in the Blu-ray release.[9] An alternate opening featured the peaceful village of Santa Poco being rampaged upon by El Guapo and his men, prompting Carmen's search for help. Extended sequences of the Three Amigos at the studio mansion and backlot lead-in to another deleted subplot involving an up-and-coming rival actress at the studio, Miss Rene (Fran Drescher).[7]A deleted scene featuring Sam Kinison as a mountain man was lost,[7] as were most of Drescher's other scenes[9]","produced_by":"George Folsey, Jr.|Lorne Michaels|","starring":"Steve Martin|Chevy Chase|Martin Short|","running_time":"103 minutes[1]","music_by":"Elmer Bernstein|Songs:|Randy Newman|","edited_by":"Malcolm Campbell","written_by":"Steve Martin|Lorne Michaels|Randy Newman|","budget":"$25 million[2]"}