{"country":"United Kingdom United States","distributed_by":"PolyGram Filmed Entertainment (UK) Gramercy Pictures (USA)","Plot":"Mr. Bean (Rowan Atkinson) is a well meaning, but hopelessly clumsy and destructive security guard, at the Royal National Gallery in London. His reputation for sleeping on the job compels the board of directors to attempt to fire him, but they are thwarted by the chairman (Sir John Mills) who is sympathetic to him. In order to get rid of Bean, the board send him to Los Angeles to represent them at the unveiling of the portrait Whistler's Mother. The famous painting has been purchased for $50 million by the Grierson Art Gallery with a grant from General Newton (Burt Reynolds).Bean's visit is arranged by the gallery's curator, David Langley (Peter MacNicol), who, impressed with the National Gallery's false profile of \"Dr. Bean\", agrees to accommodate Bean in his house for two months, much to the chagrin of his wife Alison (Pamela Reed), son Kevin (Andrew Lawrence) and daughter Jennifer (Tricia Vessey), who subsequently leave for Alison's mother's house.After some initial mishaps with the airport police and leaving the gallery's owner, Mr. Grierson (Harris Yulin) slightly doubtful about Bean's intelligence after meeting him in person, David begins to question his decision, and his worst fears are realised when Bean accidentally ruins the painting shortly after it arrives. Fearing that he will lose his job and possibly face criminal charges for the damage, David becomes despondent and gets drunk, even though his family returns out of pity.Bean, however, comes up with a plan to save David's career by sneaking into the gallery at night and replacing the damaged painting with a poster that he alters to make it resemble a genuine painting with egg whites and Alison's nail varnish. The plan works and the painting is a success, but Bean is unexpectedly called to give a speech about the painting with General Newton, countless journalists and reporters watching. Bean, however, manages to improvise a sentimental and deep monologue about the painting and wins the crowd's praise and approval.Just then, however, David is visited by Lieutenant Brutus (whom Bean had crossed more than once earlier on) and is initially perplexed with the police presence, assuming that the police might have discovered the issue with the priceless painting. Brutus however tells David that his daughter Jennifer has been in a motorcycle accident.They rush to the hospital, but Brutus and the police stop prematurely to deal with a mugging, in which Brutus is shot. David shares an uneasy reunion with Alison beside the unconscious Jennifer's bed, while Bean is mistaken for a medical doctor and forced into a surgery room to help remove the bullet from Brutus's chest, which he manages to do unorthodoxly. While still in the doctor's garments, Bean comes across David, who asks him to help awaken Jennifer.Once alone with Jennifer, Bean begins fooling around the defibrillator and zaps himself, accidentally causing him to wake Jennifer. Bean uneasily reveals himself to David and Alison and asks that he be allowed to stay with them another week, which they gladly accept. Bean goes on to spend quality time with David and his family until he leaves.Eventually, David takes Bean to the airport for his flight home, where they part ways as friends. Once at home in London, Bean takes one last look at his room, which he has decorated with photographs with the Langleys and the original Whistler's Mother that was damaged and then stowed away, before going to bed.","language":"English","Reception":"The film was criticised for breaking with the program's tradition of having Mr. Bean as the centre of attention, and for the alleged Americanisation required to sell it overseas (Bean also speaks intelligibly, albeit with apparent difficulty, as opposed to his frequent mumbling in the television show).[2] However, the movie grossed over USD$250 million globally on a budget estimated at $18 million.[1] In 2007, it was followed by a sequel, called Mr. Bean's Holiday.[3]The film holds a 42% approval rating on Rotten Tomatoes with an average score of 5.3/10 based on 31 reviews.[4] The film holds a score of 52 on Metacritic based on 20 reviews.[5]","box_office":"$251.2 million[1]","cinematography":"Francis Kenny","production_company":"Working Title Films Tiger Aspect Films","directed_by":"Mel Smith","Soundtrack":"The film's original score was by Howard Goodall, who had also written the music for the television series, although the original Mr. Bean theme was not used. Other non-original songs were also featured, in particular The Beatles' \"Yesterday\" (sung by Wet Wet Wet).The CD soundtrack features the OMC cover of I Love L.A. despite the original by Randy Newman being the version in the film. The album also features a song not used in the film, a cover of the Alice Cooper song \"Elected\" (from the Billion Dollar Babies album) performed by famed Iron Maiden lead singer and Heavy metal icon Bruce Dickinson which features sound dubs of Mr. Bean making campaign promises. This had been used for Comic Relief in 1992.Boyzone also released a song for the film, entitled \"Picture of You\".","release_dates":"2 August 1997 (1997-08-02) (United Kingdom)|7 November 1997 (1997-11-07) (United States)||||","produced_by":"Rowan Atkinson Peter Bennet-Jones Tim Bevan Richard Curtis Eric Fellner Rebecca O'Brien","starring":"Rowan Atkinson Peter MacNicol John Mills Burt Reynolds Pamela Reed Richard Gant","running_time":"90 min.","music_by":"Howard Goodall","bean":"Theatrical release poster","edited_by":"Christopher Blunden","written_by":"Richard Curtis Robin Driscoll","budget":"$18 million"}