{"based_on":"Curious George  by Margret Rey and H.A. Rey","country":"United States","distributed_by":"Universal Studios","screenplay_by":"Ken Kaufman","story_by":"Ken Kaufman|Mike Werb|","Legacy":"The film has been adapted into a PBS Kids animated television series, also called Curious George and narrated by William H. Macy (Season 1) and Rino Romano (from Season 2 onwards).A sneak peek for the sequel, Curious George 2: Follow That Monkey! was included in the special features for The Tale of Despereaux. The sequel was released on March 2, 2010. The plot for the sequel centers around George becoming friends with a young elephant named Kayla. George tries to help Kayla travel across the country to be reunited with her family. A second sequel, Curious George 3: Back to the Jungle was released on June 23, 2015.","Plot":"The introduction of the movie is a cartoon short where we are introduced to a happy, artistic, and mischievous but lonely little monkey somewhere in the jungle. Ted (Will Ferrell) is an employed guide at the Bloomsberry Museum. We are introduced to teacher Ms. Maggie Dunlop (Drew Barrymore) and her students who come to the museum often but they are the only regular visitors. Mr. Bloomsberry (Dick Van Dyke) heartbreakingly informs Ted that the museum will have to close, because it is no longer making any money. Bloomsberry's son, Junior (David Cross), wants to tear down the museum, and replace it with a parking garage. Ted is convinced to volunteer to go to Africa in place of Mr. Bloomsberry and bring back a mystical, forty-foot-tall idol known as \"Lost Shrine of Zagawa\" in the hopes that it will attract customers, much to Junior's envy. Ted is outfitted with a hideous yellow suit (which causes people to laugh at him), and boards a cargo ship to Africa despite his embarrassment.With the help of a tour guide and tour group, Ted finds the \"Lost Shrine of Zagawa\", but discovers it to be only three inches tall, much to his disappointment. Ted also encounters the little monkey on his expedition to Africa, and gives the monkey his yellow hat. The monkey, who quickly grows fond of Ted, follows him and boards the cargo ship, unknown to Ted. Ted returns home, and enters his apartment, only to receive a call from Bloomsberry telling him to report to the museum, so Ted can do an interview on the news. The monkey follows Ted to his apartment, the monkey is discovered busily repainting a posh apartment in full scale African animals and due to the strict \"no pets allowed policy\", Ted is evicted by grumpy doorman Ivan (Ed O'Ross). Ted returns to the museum, and reveals to Bloomsberry the idol's size. Ted is kicked out of the museum by Junior, after the monkey accidentally destroys an Apatosaurus skeleton.Ted and the monkey sleep outside in the park, and the next morning, Ted follows the monkey into the zoo, where Maggie and her young students name the monkey \"George\". George gets into trouble and begins dangerously floating away on balloons high up over the city, Ted takes flight as well. George's balloons are popped by spikes on a building and Ted saves him from certain death.Ted and George make their way to the home of an inventor named Clovis (Eugene Levy), where George uses an overhead projector to increase the idol's size making it appear 40 feet tall. Ted and George head to the museum to show Bloomsberry the invention. Junior tries to convince his father that it would not be honest to fool the public, but the elder Bloomsberry sees it as the only way to save the museum. Determined to get his parking garage, Junior foils Ted's plan by pouring hot coffee on the machine and framing George. Believing his life to be ruined, Ted allows animal control to take away George.Ted speaks with Ms. Maggie who helps Ted \"see\" what is really important in his life. Ted regrets the decision to give George to animal control, and boards George's cargo ship to get him back. Ted tells George that nothing else matters besides their \"buddyship\". In the hold of the ship, George discovers that when reflected in light, the idol reveals a pictogram with the message \"turn your eye to the light, go from blindness to sight\". It turns out that when held up to the sun, the small idol is actually a map to the real idol. They sail the ship back to Africa and George helps him find the real idol which is, indeed, forty feet tall.The idol is put in the museum, and the museum goes back in business, and becomes more successful than ever when it becomes more hands-on because of the addition of Clovis's inventions, the interaction with Ms. Dunlop and her young students and, of course, George. Junior finally gets his parking garage, but is upset that Ted is still working at the museum. Ivan invites Ted to move back to his apartment because he likes George, and Ted and Maggie almost start a romance, but George causes more trouble by starting up a rocket ship, forcing Ted to follow him.","language":"English","Reception":"The film has a 69% approval rating at Rotten Tomatoes based on 103 review; the average rating is 6.1/10. The site's consensus reads: \"Curious George is a bright, sweet, faithful adaptation of the beloved children's books.\"[6] Roger Ebert praised the design of the film and its faithfulness to the \"spirit and innocence of the books.\"[7] Since he himself didn't particularly enjoy the film, Ebert made an exception in this case in recommending it for young children based on its better qualities, a point on which he said he disagreed somewhat with his TV show co-host Richard Roeper.[7] Owen Gleiberman of Entertainment Weekly was \"pleasantly surprised\" by the film's calm tone, which he found to be against modern trends, but said that George was perhaps a bit too sweet and that the \"movie comes close to denying he's any sort of troublemaker\".[8] He noted somewhat negatively the few modern anachronisms in the film.[8] Brian Lowry of Variety was negative about the film, criticizing the quality of the animation, the music, and other aspects.[9] Lowry states that there are some updates to the story, such as that \"The Man in the Yellow Hat\" from the books is finally given a name.[9] He also notes that David Cross' animated character bears a strong resemblance to the actor himself.[9] Colin Covert of the Minneapolis Star Tribune noted that the film's use of \"traditional cell [sic] painting and digital effects\" compliments the original watercolor illustrations, and thought the film entertaining and yet still quite simple.[10] He considered the difficulties in adapting the original stories (in which George basically causes trouble and the Man in the Yellow Hat fixes it all up) into a film, and how some conflict and a slight romantic subplot were added.[10]","box_office":"$69.8 million[1]","production_company":"Universal Animation Studios Imagine Entertainment A. Film A/S","directed_by":"Matthew O'Callaghan","Soundtrack":"Sing-A-Longs and Lullabies for the Film Curious George is the soundtrack to the film, featuring songs by Jack Johnson and Sally Williams. In its first week on Billboard 200 albums chart, the soundtrack made it to number one, making it Jack Johnson's first number one album (In Between Dreams peaked at two, On and On peaked at three) and making it the first soundtrack to reach number one since the Bad Boys II soundtrack in August 2003 and the first soundtrack to an animated film to top the Billboard 200 since Pocahontas reigned for one week in July 1995.","curious_george":"Theatrical release poster","release_dates":"February 10, 2006 (2006-02-10)|||||","Production":"In various points during its development, it was proposed that the film be entirely CG or live-action mixed with CG, before the decision was finally made to use traditional animation to bring the titular character to life.[2] As of 2001, Brad Bird had written a script for the film.[3] Director Matthew O'Callaghan greatly appreciated having Dick Van Dyke voice one of the characters. \"I was surprised when I actually finally met him that he had never done an animated voice before, with his association with Disney for all those years. I was just blown away so I'm going, 'This is great,' because as an animation director you always want to use people who are fresh, who haven't done animated voices – at least I do.\" he said.[4] CG Supervisor Thanh John Nguyen states that they tried to duplicate the look of the cars in the book, which Executive Producer Ken Tsumura describes as bearing the look of the 1940s and 1950s; According to Production Designer Yarrow Cheney, the filmmakers also partnered with Volkswagen to design the red car that Ted drives, simplifying it a bit and rounding the edges.[5] Cheney also said that prior to this they had based some of the models on Volkswagens due to their suitability.[5]","produced_by":"Ron Howard|David Kirschner|Jon Shapiro|","starring":"Will Ferrell|Drew Barrymore|David Cross|Eugene Levy|Joan Plowright|Dick Van Dyke|","running_time":"86 minutes","music_by":"Heitor Pereira (score)|Jack Johnson (songs)|","edited_by":"Julie Rogers","Release":"The film was released to 2,566 theaters on February 10, 2006 and opened at #3 with a total opening weekend gross of $14.7 million averaging $5,730 per theater. The film grossed $58.4 million in the United States and $11.5 million overseas, totaling $69.8 million worldwide.[1]","budget":"$50 million[1]"}