{"country":"United States","distributed_by":"Columbia Pictures","Illusion-O":"As with several of his more famous productions, Castle used a gimmick to promote the movie. For 13 Ghosts, audience members were given a choice: the \"brave\" ones could watch the film and see the ghosts, while the apprehensive among them would be able to opt out of the horror and watch without the stress of having to see the ghosts. The choice came via the special viewer, supposedly \"left by Dr. Zorba.\"In the theatres, most scenes were black and white, but scenes involving ghosts were shown in a \"process\" dubbed Illusion-O: the filmed elements of the actors and the sets — everything except the ghosts — had a blue filter applied to the footage, while the ghost elements had a red filter and were superimposed over the frame. Audiences received viewers with red and blue cellophane filters. Unlike early 3D glasses where one eye is red and the other is cyan or blue, the Illusion-O viewer required people to look through a single color with both eyes. Choosing to look through the red filter intensified the images of the ghosts, while the blue filter \"removed\" them. Despite Castle's claims to the contrary, not many heart attacks or nervous breakdowns were averted by the Illusion-O process; although the blue filter did screen out the ghostly images, the ghosts were visible with the naked eye, without the red filter.Because the ghosts were indeed viewable by the naked eye, the movie ran for years on television with no viewer needed to see the ghosts. DVD editions have varied in their preservation of the Illusion-O effect, with the latest DVD release including versions with and without the ghost outlines and a set of special viewers.","Plot":"When occultist uncle Dr. Plato Zorba wills a huge ramshackle house to his nephew Cyrus and his impoverished family, they are shocked to find the house is haunted. Their new furnished residence comes complete with Dr. Plato Zorba's housekeeper, Elaine Zacharides, plus a fortune in buried treasure and 12 horrifying ghosts.His family soon discovers that these spirits include a wailing lady, clutching hands, a floating head, a fiery skeleton, an Italian chef murdering his wife and her lover in the kitchen, a hanging lady, an executioner and severed head, a fully grown lion with its headless tamer, as well as Dr. Zorba himself, all held captive in the eerie house looking for an unlucky thirteenth ghost to free them. Dr. Zorba leaves a set of special goggles, the only way of seeing the ghosts.However, there is someone in the house who is also looking for the money and is willing to kill for it. The villain turns out to be the lawyer Benjamin Rush. He attempts to kill Cyrus' son, Buck, using the falling bed canopy he used to kill Dr. Plato Zorba, but Dr. Zorba's ghost catches him in the act, driving the terrified Rush to his death in the bed just as Buck escapes. Rush becomes the 13th ghost, and the ghosts disappear. The next morning, Cyrus and his family count the discovered money, Buck keeps the mask used by Benjamen Rush to scare Buck's big sister Medea Zorba, and they decide to stay.","language":"English","box_office":"$1,500,000 (US/ Canada)[1]","Remake":"It was remade in 2001 under the title of Thirteen Ghosts, directed by Steve Beck. Like the original film, it was distributed by Columbia Pictures (except in the USA and Canada, where it was distributed by Warner Bros. Pictures).[3]","directed_by":"William Castle","release_dates":"July 10, 1960 (1960-07-10)|||||","produced_by":"William Castle","starring":"Charles Herbert Jo Morrow Rosemary DeCamp Martin Milner Donald Woods","running_time":"85 min / 82 min (black-and-white version)","music_by":"Von Dexter","written_by":"Robb White"}