{"con_air":"Theatrical release poster","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","Plot":"Former Army Ranger Cameron Poe (Nicolas Cage) is sentenced to 10 years in prison for manslaughter for using excessive force on a drunk man while trying to protect his pregnant wife Tricia (Monica Potter). Poe is paroled eight years later, and is to be released after being flown to Alabama on the Jailbird, a C-123K transport prison aircraft. Along with Poe are several other prisoners including his diabetic cellmate and friend Mike \"Baby-O\" O'Dell, who is being transferred (but not yet paroled) with Poe. The transfer is being overseen by U.S. Marshal Vince Larkin (John Cusack), as the transfer includes notorious criminal mastermind Cyrus \"Cyrus The Virus\" Grissom (John Malkovich), gangster and Black Guerrilla member Nathan \"Diamond Dog\" Jones (Ving Rhames) and mass murderer William \"Billy Bedlam\" Bedford (Nick Chinlund) for their transfer to a new Supermax prison. Larkin is approached at the last minute by DEA agents Duncan Malloy (Colm Meaney) and Willie Sims (Jose Zuniga), who ask for Sims to be brought aboard disguised as a prisoner so that he can extract more information from drug lord Francisco Cindino (Jesse Borrego), a prisoner that is to be picked up at Carson City, Nevada en route. Larkin agrees, unaware that Malloy has hidden a gun on Sims' body.As the Jailbird takes off, another prisoner Joe \"Pinball\" Parker (Dave Chappelle) incites a riot, allowing him to set free Diamond Dog and Grissom. Cyrus quickly rushes to the cockpit, killing the co-pilot and forcing the pilot to continue to fly the aircraft. Cyrus then announces the prisoners' takeover of the Jailbird and takes the prison guards hostage. Sims attempts to control the situation with his weapon, but Cyrus shoots him first. Poe feigns cooperation with the other prisoners as they prepare to offload guards disguised as prisoners at Carson City; Poe is able to sneak a recording device Sims had onto one of the now tied up guards. The transfer proceeds, among the new prisoners are Cindino, pilot \"Swamp Thing\" Williams (M. C. Gainey), and serial killer Garland Greene (Steve Buscemi), whose murders make \"The Manson family look like the Partridge family\". Pinball takes the aircraft's transponder and plants it on a small sightseeing aircraft. Jailbird takes off before the recording device can be found, but soon afterward Larkin and Malloy are alerted to the situation, after other prison guards recognize the tied up guards.Malloy berates Larkin for assigning incompetent guards to the transport aircraft and then chases off after the transponder, while Larkin discovers information in Grissom's cell that indicates this escape attempt has been planned with Cindino. On the Jailbird, Grissom reveals that they will be going to the small Lerner Airfield where Cindino has arranged passage for them all to a non-extradition country. Poe finds Pinball's body stuck in the landing gear, the convict not having made it back in time, and secretly writes a message to Larkin about Lerner Airfield before pushing it out of the aircraft. The body lands in the middle of Fresno, California, and Larkin is alerted, ordering the National Guard there while he drives there himself in Malloy's sports car.Billy Bedlam discovers Poe's true identity after going through his personal possessions, identifying him as a parolee and former Ranger, and Poe is forced to kill Bedlam when he charges at Poe. At Lerner, the aircraft overruns the small runway. There is no immediate sign of Cindino's aircraft and Grissom orders the prisoners to start to dig out the Jailbird. Poe uses the time to locate insulin shots for Baby-O, and happens upon Larkin. The two quickly brief each other on the situation as Poe has to return before suspicion is raised. Larkin encounters Cindino with his agents preparing a small jet for departure and is able to sabotage it on takeoff. Grissom realizes Cindino had tricked him by planning on leaving the prisoners behind and kills him by burning him with the aircraft as it explodes.Meanwhile, one of the convicts, assigned to watch for trouble, spots the approaching National Guard and alerts the others. The prisoners equip themselves with assault rifles in the aircraft that were originally intended for corrections officers and prepare to massacre the troops in an aircraft graveyard. However, Larkin is able to save most of the troops using a bulldozer as a bullet shield, forcing the prisoners to retreat to the Jailbird and prepare for take off. Poe, after giving Baby-O his shots, tries to escape with him and a female guard who had been protecting herself from serial rapist Johnny \"Johnny 23\" Baca (Danny Trejo) aboard, but the aircraft has taken off by the time they are ready.Poe's identity and true intent is revealed to the prisoners when Diamond Dog discovers Billy Bedlam's corpse and Poe's possessions. As Grissom wounds Baby-O and is about to kill Poe, Malloy arrives with Bell AH-1 Cobra assault helicopters and fire upon the Jailbird, damaging its engines and draining its fuel tank. Malloy nearly shoots the Jailbird down, but after being persuaded by Poe, decides to hold fire. Swamp Thing is forced to crash-land the aircraft in the only open paved surface nearby, the Las Vegas Strip. The aircraft causes a great deal of destruction as it skids to a stop in front of a casino. The ensuing chaos allows Grissom, Diamond Dog, and Swamp Thing to escape on a fire truck while Las Vegas police secure the area and apprehend the other prisoners. Poe and Larkin team up to chase down the three, eventually killing all three after a high-speed chase (Diamond Dog dies after a motorcycle crashes into him, Swamp Thing is hurled through the fire truck's windshield, and Grissom is crushed by a rock pounder). Poe thanks Larkin and tells him he is now someone whom he can trust, and then goes to reunite with Tricia and his daughter whom he has never met.Garland Greene's fate after the crash is revealed: now a free man, he was seen gambling and drinking while on a winning streak at a casino, although it is not known whether the police later apprehend him.","language":"English","Reception":"The film was a box office hit, grossed $224,012,234 worldwide, of which $101,117,573 was in North America.[17]The film holds a 54% approval rating on Rotten Tomatoes and an average rating of 5.7/10 based on 63 reviews.[18] On Metacritic, the film holds a score of 52 out of 100, sampled from 22 reviews, indicating \"mixed or average reviews.\"[19] Roger Ebert awarded the film three out of four stars, saying it \"moves smoothly and with visual style and verbal wit.\"[20] Janet Maslin, reviewer for The New York Times considered Con Air an exemplar of the \"thrill ride genre.\" [21] In contrast, Rolling Stone reviewer Peter Travers decried the \"flip, hip\" and ultimately, \"depressing ... pandering\" present in the treatment.[22] Andrew Johnston (critic), reviewer for Time Out New York stated: \"Leaving The Rock last summer, I thought it seemed physically impossible for a more over-the-top action movie to be made. That was pretty short-sighted of me, since it was only a matter of time until producer Jerry Bruckheimer topped himself as he does with the wildly entertaining Con Air.\"[23]As acknowledged by repeated requests for West to stage a sequel, Con Air has become a cult classic with an action movie audience.[24][not in citation given]Con Air was nominated for Best Original Song (for \"How Do I Live\") and Best Sound Mixing (Kevin O'Connell, Greg P. Russell and Art Rochester) at the 70th Academy Awards, losing to Titanic in both categories.[25]Conversely, the film won the Golden Raspberry Award for \"Worst Reckless Disregard for Human Life and Public Property\" at the 18th Golden Raspberry Awards. \"How Do I Live\" was nominated for both the Academy Award for Best Original Song and the Razzie Award Worst Original Song, but won neither.[26]","box_office":"$224 million[1]","cinematography":"David Tattersall","production_company":"Touchstone Pictures Jerry Bruckheimer Films","directed_by":"Simon West","Home media":"An unrated extended edition of the film was released on DVD on May 15, 2006. Jason Morgan of Cinemablend.com gave the film 1 star out of 5, claiming the added scenes slowed down the film, and criticizing the high price of the DVD as it featured no bonus content.[27]","Soundtrack":"The film featured the hit single \"How Do I Live\", performed by Trisha Yearwood for the movie but originally recorded by LeAnn Rimes.[15][Note 3]The Con Air soundtrack album omits two songs featured in the film: \"How Do I Live\", written by Diane Warren and performed by Trisha Yearwood and \"Sweet Home Alabama\" by Lynyrd Skynyrd. Although a key element of the film, Mick LaSalle of the San Francisco Chronicle noted, \"The soundtrack kicks into loud, obtrusive gear ... (and) remains so loud throughout the picture that it practically functions as a distancing device.\"[16]","References":"NotesCitationsBibliography","release_dates":"June 6, 1997 (1997-06-06)|||||","Production":"With second-unit work beginning on June 24, 1996, principal photography began shortly after at Salt Lake City, on July 1, 1996 and continued until October 29, 1996, at a number of locations.[2] While most of the interiors of the Fairchild C-123 Provider transport aircraft were filmed in Hollywood Center Studios soundstage #7, Wendover Airport in Utah, as the stand in for the fictional Lerner Airfield, was used for the C-123 flying and taxi scenes.[3] Director Simon West chose the barren and remote Wendover area \"because it looked like the surface of the moon ... My idea was that it was perfect for the convicts who had been locked up for 10, 20, 30 years in little cells.\"[4] The old wartime bomber base was also used for the aircraft boneyard scenes while the original swimming pool at the base was used in a scene where Garland Greene was talking to a young girl.[5]On August 29, 1996, Phillip Swartz, a welder employed by Special Effects Unlimited, a Los Angeles-based firm, was crushed to death at Wendover when a static model of the C-123 used in the film, fell on him. The film credits end with \"In Memory of Phil Swartz\".[6] After filming, the filmmakers donated the Jailbird movie model used for the taxi scenes to the Historic Wendover Airfield Foundation and is currently on display at the ramp as an attraction for visitors.[5]Other filming locations included Ogden Airport where the exchange of prisoners is seen. The scene where the aircraft's left wing hits the Fender Stratocaster sign of Hard Rock Hotel and Casino, the place where its premiere was held, was filmed using a remodeled guitar of the hotel and a Jailbird miniature model. The crash site was filmed in the Sands Hotel before its demolition on November 26, 1996. Producer Jerry Bruckheimer found the right spot for the climactic finale, originally planned for a crash at the White House, but Las Vegas was more in keeping with the dichotomy of convicts \"cashing in.\" \"We got very lucky ... The Sands was going to be demolished anyway. They blew up the tower on their own. We arranged to blow up the front of the building.\" The 2nd Street Tunnel in Los Angeles was also used for the tunnel chase scene near the end of the film.[4]The Jailbird movie model used during flight scenes in the film had a series of both military and private owners. In December 2003 it was sold to All West Freight Inc. in Delta Junction, Alaska.[7] On August 1, 2010, the C-123 was destroyed when it crashed into Mount Healy within Denali National Park in Alaska.[8] The three member flight crew was killed during the crash.[9][10][11]On the DVD commentary of Chappelle's Show, and later, on Inside the Actors Studio, Dave Chappelle recounted that he improvised most of his lines in Con Air.[12]","Aircraft used in the film":"Along with using several highly detailed models at 1/15th scale, and a multitude of military and private aircraft assembled for the desert boneyard scene,[Note 1] the following aircraft were prominently featured in Con Air:","produced_by":"Jerry Bruckheimer","starring":"Nicolas Cage John Cusack John Malkovich","running_time":"115 minutes (original) 122 minutes (extended)","music_by":"Mark Mancina Trevor Rabin","edited_by":"Chris Lebenzon Steve Mirkovich Glen Scantlebury","written_by":"Scott Rosenberg","budget":"$75 million[1]"}