{"country":"Hong Kong","Plot":"Yan is a prostitute from the mainland in Hong Kong, living near Fan and her family, who is staying in the area illegally. Yan meets Fan in a laneway behind Portland Street and become friends after Yan's pimp is assaulted in front of Fan by an assailant wielding a durian fruit.Yan services dozens of clients per day and showers compulsively.[2] After her 3-month-stay in Hong Kong, Yan returns to her family and her ex-fiance in Northeast China to invest what she has earned.[3] Yan remains in contact with Fan, receiving a durian from her as a gift.","language":"Cantonese Mandarin","Reception":"In addition to numerous awards, the film has received critical acclaim. Reviews have praised director Fruit Chan and actresses Qin Hailu and Mak Wai-Fan, and emphasise themes of contrast, urban squalor, youthful optimism, and alienation.[3][7] The film as been called \"deliberate and brooding\".[8]","box_office":"HK$523,015.00[1]","cinematography":"Lam Wah-Chuen","directed_by":"Fruit Chan","Awards":"At the 20th Hong Kong Film Awards in 2001, Durian Durian was nominated for the Best Film, Best Director (Fruit Chan), Best Screenplay (Fruit Chan), Best Actress (Qin Hailu), Best New Performer (Qin Hailu) and Best Art Direction (Tin Muk) awards. It won the awards for Best Film and Best New Performer.[5] It was awarded Best Film at the 2001 Hong Kong Film Critics Society Awards. The film also won the Best Picture award at the 38th Golden Horse Awards, with Qin winning the Best Actress and Best New Performer awards.[6]","References":"Zhang, Yingjin (2004). Chinese National Cinema. Routledge. ISBN 0-415-17289-6. ","release_dates":"2000-11-16","durian_durian_榴槤飄飄":"Movie poster for Durian Durian","produced_by":"Carrie Wong","starring":"Mak Wai Fan, Qin Hailu","running_time":"116 minutes","music_by":"Chu Hing-Cheung, Lam Wah-Chuen","edited_by":"Tin Sam-Fat","Connection to Fruit Chan's other work":"Fan was featured in Little Cheung, a film which also deals with poverty and life as an immigrant. This film also centres upon Portland Street in Kowloon.[4]","written_by":"Fruit Chan, Chan Wai-Keung, Zhi Min Sheng"}