{"country":"United States","distributed_by":"Paramount Pictures","best_defense":"Theatrical release poster by Steven Chorney","Plot":"The movie takes place as two parallel plots separated by couple years: In 1982, Wylie Cooper (Moore), is an engineer developing a targeting system on a tank for the United States Army. In 1984, Murphy is US Army Lt. Landry, an American tank commander sent to Kuwait to demonstrate \"XM-10 Annihilator\", America's latest main battle tank, which is equipped with Cooper's system. Because of the tank's poor design and shoddy construction, Landry and his crew are barely able to control or navigate the XM-10 before it leaves the proving grounds and wanders into a combat zone during Iraq's invasion of Kuwait (an unintentional foreshadowing of the Gulf War that occurred six years after the release of the film).Cooper and Landry never directly interact during the film, but the plot shows how the decisions made by Cooper affect Landry's tank. (A cut scene showed both Dudley Moore and Eddie Murphy together, but was edited out from the final film.)Cooper, an engineer for a troubled defense contractor, is in charge of designing the \"DYP-gyro\", a gyroscope for the army's new tank. The company's future hinges on the success of the project. Cooper's gyro fails a crucial test, dooming the company. Downtrodden, Cooper later crosses paths with another engineer who has also designed a DYP-gyro. When the other engineer dies, Wylie takes the plans. A co-worker claims later puts Wylie's name on the plans, and when the \"new\" gyro works, Wylie is hailed for saving the company.In 1984, Landry's tank comes under fire from Iraqi jets, leading Landry to plead that he doesn't belong in this war, shouting \"I'm from Cleveland!\" at the attacking planes.Back in 1982, Wylie is contacted by Jeff, a deep-cover KGB agent who tries to obtain the DYP plans. The FBI, knowing that Wylie took credit for somebody else's work, forces him to act as bait for Jeff in a set-up operation. The set-up nearly fails - Jeff is killed during a gun battle, and Wylie himself is shot. Realizing his mortality while being put on an ambulance, Wylie confesses to Clair, an attractive co-worker, that he stole the DYP. This triggers an angry response from Clair and also from his wife who, arriving on the scene, realizes that Wylie has been cheating on him. Surviving the bullet, Wylie receives even worse news from a co-worker: the DYP-gyro he claimed credit for won't work, because it will cause overheating in the WAM, another critical component, crippling the tank's fire control and, in a combat situation, dooming the tank.The film reaches its climax in a sequence weaving between 1982 when a more conscientious Wylie, having recovered, confronts his employers about the flaws in the DYP, while in 1984, Landry attempts to fire the main gun while under attack by an Iraqi gunship. As had been predicted, the DYP causes failure in the WAM (\"The WAM's overheating! The WAM's overheating! What the hell is a WAM!?!\"), suggesting that Wylie's protest was ignored.Instead, the camera cuts to the innards and shows that the DYP has been redesigned according to an idea that Wylie had in 1982 while fixing one of his son's toys. The redesign works, enabling the tank's air defense rockets to launch and destroy Iraqi gunship. The film ends with Moore and Murphy as heroes in their respective jobs.","language":"English","Reception":"The movie received negative reviews from critics. It opened strong at #2 behind Ghostbusters with $7.8 million but quickly lost steam, mostly due to poor word-of-mouth, and grossed a disappointing $19.2 million. It was nominated for a Stinkers Bad Movie Awards for Worst Picture, losing to Dune.[5]","box_office":"$19,265,302 (domestic) [1]","cinematography":"Donald Peterman","production_company":"Cinema Group Ventures Eddie Murphy Productions","directed_by":"Willard Huyck","release_dates":"July 20, 1984 (1984-07-20) (U.S.)|||||","Production":"As originally filmed, the film did not feature Eddie Murphy's character, and was solely a Dudley Moore film.[3] The film's preview screenings were received poorly, and the studio suggested filming a role for Eddie Murphy, who was at the peak of his popularity. Murphy's part was almost unconnected with the rest of the film and his character never even came into contact with the main cast.[3][4] There had been a scene filmed during the reshoots which featured Moore and Murphy's characters meeting, but it was cut from the film.","produced_by":"Gloria Katz","starring":"Dudley Moore|Eddie Murphy|Kate Capshaw|","running_time":"94 minutes","music_by":"Patrick Williams","edited_by":"Sidney Wolinsky","written_by":"Robert Grossbach (novel Easy and Hard Ways Out) Willard Huyck Gloria Katz (screenplay)","budget":"US$18,000,000 (est)"}