{"country":"United Kingdom","distributed_by":"Miramax Films","aria":"Theatrical release poster","language":"Italian German French","cinematography":"Christopher Hughes","directed_by":"Robert Altman|Bruce Beresford|Bill Bryden|Jean-Luc Godard|Derek Jarman|Franc Roddam|Nicolas Roeg|Ken Russell|Charles Sturridge|Julien Temple|","release_dates":"15 September 1987 (1987-09-15)|||||","produced_by":"Don Boyd","starring":"Theresa Russell|Buck Henry|Beverly D'Angelo|John Hurt|Anita Morris|Bridget Fonda|","running_time":"90 minutes","Summary":"A fictionalised account of a 1931 assassination attempt on King Zog I of Albania, notable for his shooting back at his would-be assassins and surviving. (In the actual attempt, King Zog was leaving a performance of Pagliacci.)Two London teenage girls and a young boy steal a car.Two nude women try to attract the attention of oblivious bodybuilders.A bedroom farce set in San Luis Obispo's famous Madonna Inn, in which a movie producer cheats on his wife unaware that she, too, is there with a clandestine lover of her own.A look at the seemingly-dead city of Bruges, Belgium. Scenic footage of the empty streets and cemeteries is intercut with a duet of two lovers, providing counter-pointed to the dead city.A re-creation of opening night at Paris's Théâtre Le Ranelagh (fr) in 1734. The audience is filled with a raffish assortment of inmates from an asylum.Two young lovers arrive in Las Vegas. After driving down Fremont Street, they check into a cheap hotel room where they unsuccessfully try to commit suicide following the consummation of their relationship.After a car crash, a lovely young girl imagines her body is being adorned by jewels mirroring her injuries, in a tribal ritual parallel to the procedures of the surgical team treating her, until she wakes up in the operating room after resuscitation.A veteran opera singer gives her final performance, intercut by 8mm home movies of an early love affair.A virtuoso remembers his career while arriving at an opera house, visiting the dressing room to put on his clown makeup, and performing the aria for his audience of one. (This story provides a vague framing narrative to link together the other segments.)","music_by":"Giuseppe Verdi|Gustave Charpentier|Giacomo Puccini|Erich Wolfgang Korngold|","edited_by":"Neil Abrahamson","written_by":"Robert Altman|Bruce Beresford|Don Boyd|Bill Bryden|Louis de Cahusac|Derek Jarman|Philippe Quinault|Franc Roddam|Nicolas Roeg|Ken Russell|Charles Sturridge|Julien Temple|"}