{"country":"United States","capricorn_one":"Theatrical release poster","distributed_by":"Warner Bros.","Plot":"Capricorn One—the first manned mission to Mars—is on the launch pad. The bewildered crew of Brubaker (James Brolin), Willis (Sam Waterston), and Walker (O. J. Simpson) are removed from Capricorn One and flown to an abandoned desert base. The launch proceeds on schedule, and the public is unaware that the spacecraft is empty. At the base, the astronauts are informed by NASA official Kelloway (Hal Holbrook) that a faulty life-support system would have killed the astronauts during the flight, and they must help counterfeit the television footage during the flight to and from Mars. Initially they refuse, but Kelloway threatens their families if they do not cooperate.The astronauts remain in captivity during the flight and are filmed landing on Mars within a studio located at the base. The conspiracy is known to only a few officials, until alert technician Elliot Whitter (Robert Walden) notices that ground control receives the crew's television transmissions before the spacecraft telemetry arrives. Whitter mysteriously disappears before he can finish sharing his concerns with journalist friend Robert Caulfield (Elliott Gould). Caulfield discovers that all evidence of his friend's life has been erased and begins investigating the mission, surviving several attacks.Upon returning to Earth, the empty spacecraft burns up due to a faulty heat shield during re-entry. The captive astronauts board a plane to be placed in the spacecraft, but the plane unexpectedly turns around and returns to the airfield. They realize that something has gone wrong with the re-entry process and that officials can never release them because doing so would automatically expose the hoax. They break out of their confinement and escape in a plane, which runs out of fuel soon after take-off. Forced to crash-land and stranded in the desert, they attempt to return to civilization while being pursued by two helicopters. They start walking in three directions. Brubaker is the only one to avoid capture.Caulfield's investigation leads him to the desert, where he finds the military base and the hangar abandoned. Looking around, he finds a necklace given to Brubaker by his wife and concludes that the astronauts were in the hangar. With the help of crop-dusting pilot Albain (Telly Savalas), he searches the desert and rescues Brubaker from the men in the helicopters. The helicopters chase their plane but are destroyed after being blinded with crop spray. Ultimately, Caulfield and Brubaker arrive at the astronauts' memorial service, exposing the conspiracy.","language":"English","Reception":"Vincent Canby of The New York Times called the film \"an expensive stylistically bankrupt suspense melodrama\" and criticized the screenplay's \"humorless comic-strip stuff about a conspiracy so widespread that you finally realize that the only people in the country who don't know about it are the three astronauts, a minor space employee, one unreliable television reporter, an eccentric crop-duster, owner of the lovable biplane, and the members of their immediate families.\"[6] Variety similarly referred to the screenplay as \"a script of conveniences\" and wrote:Capricorn One begins with a workable, if cynical cinematic premise: the first manned space flight to Mars was a hoax and the American public was fooled through Hollywood gimmickry into believing that the phony landing happened. But after establishing the concept, Peter Hyams' script asks another audience – the one in the theatre – to accept something far more illogical, the uncovering of the hoax by reporter Elliott Gould.[7]The film received a 61% positive \"Fresh\" rating on the review aggregator Rotten Tomatoes.[8]","cinematography":"Bill Butler","production_company":"ITC Entertainment","directed_by":"Peter Hyams","release_dates":"17 December 1977 (1977-12-17) (Japan)|||||","Production":"Peter Hyams began thinking about a film of a space hoax while working on broadcasts of the Apollo missions for CBS. He later reflected regarding the Apollo 11 moon landing, “There was one event of really enormous importance that had almost no witnesses. And the only verification we have . . . came from a TV camera.”[1]He later elaborated:Whenever there was something on the news about a space shuttle, they would cut to a studio in St. Louis where there was a simulation of what was going on. I grew up in the generation where my parents basically believed if it was in the newspaper it was true. That turned out to be bullshit. My generation was brought up to believe television was true, and that was bullshit too. So I was watching these simulations and I wondered what would happen if someone faked a whole story.[2]Hyams went on to become a successful television writer and director and began writing the script for Capricorn One in the mid-1970s. The failure of Peeper jeopardized his career, but Hyams and his friend, producer Paul Lazarus, were able to obtain the support of Lew Grade, head of production company ITC Entertainment, who agreed to a $4.8 million budget.[3][4] The Watergate scandal from the early and mid-1970s also made the premise more plausible.[1]To stay within the budget, NASA's co-operation was needed. Lazarus had a good relationship with the space agency from Futureworld. The filmmakers were thus able to obtain government equipment as props despite the negative portrayal of the space agency, including a prototype lunar module.Hyams later joked, \"O. J. Simpson was in it, and Robert Blake was in (Hyams' first feature) Busting. I’ve said many times: some people have AFI Lifetime Achievement awards; some people have multiple Oscars; my bit of trivia is that I’ve made films with two leading men who were subsequently tried for the first degree murder of their wives.\"[2]","produced_by":"Paul N. Lazarus III","starring":"Elliott Gould James Brolin Brenda Vaccaro Sam Waterston O. J. Simpson Hal Holbrook Karen Black Telly Savalas David Huddleston David Doyle James Karen","running_time":"124 minutes","Other media":"Two novelizations of the film were written and published by separate authors. The first was written by Ken Follett (under the pseudonym Bernard L. Ross) and published in the United Kingdom; the other was written by Ron Goulart and published in the United States.[9]The Follett novel is notable for giving Robert Caulfield more development than the movie does, including giving him something of a relationship with CBS reporter Judy Drinkwater (who has more time in the book than in the movie) and ending the book with him and Judy. The story saves his career and results in his being employed by CBS.Clips from the faked Mars landing scenes have been used for illustration purposes in various moon landing hoax conspiracy documentaries, notably the Fox TV show Conspiracy Theory: Did We Land On The Moon and Bart Sibrel's film A Funny Thing Happened on the Way to the Moon (2001). The latter also features a still shot from the hoax scene on the DVD's front cover.[citation needed]","music_by":"Jerry Goldsmith","edited_by":"James Mitchell","Release":"The film was originally scheduled to debut in the US in February 1978, but good preview screenings and delays in Superman caused it to move to June. Capricorn One became the year's most-successful independent film.[3]Hyams later said:Audiences just stood up and cheered at one point in the film. It wasn't because it was such a great movie, it's just that certain movies strike certain chords with people. In a successful movie, the audience, almost before they see it, know they're going to like it. I remember standing in the back of the theater and crying because I knew that something had changed in my life. Sitting on the film cans outside the screening room, I felt my cheeks were wet with tears. A bright man, [studio executive] David Picker came over to me and said, 'You're going to have a lot of new best friends tomorrow. You better know how to handle it.'[5]","written_by":"Peter Hyams","budget":"US$5,000,000 (estimated)"}