{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"In a small Mississippi town, deputy Jim Price is elected sheriff over John Little, the incumbent. Racial tensions exist in the community and Price gets little assistance from Little, leaving office, or from Mayor Parks, who insists he be consulted on any decision the new sheriff makes.A white man, John Braddock, is arrested on a manslaughter charge after his drunken driving causes the death of a young girl. Braddock's father carries considerable influence and demands his son be freed. Price's deputy, Bradford Wilkes, is beaten by Little's former deputy, Bengy Springer.Another arrest is made, this time of a black man, George Harley, accused of rape. The townspeople's mood turns uglier by the minute, particularly when Braddock's father threatens to spring his son by force if necessary.Little's conscience gets the better of him. He agrees to become Price's new deputy. Together they try in vain to persuade other men in town to side with them against Braddock's vigilantes and to convince the Mayor to call in the National Guard for help. Alone against the mob, Price and LIttle form a barricade and prepare for the worst when their fellow townsmen suddenly join them in the street.","language":"English","Promotion":"A radio ad for the film summarized the story simply: \"tick...tick...tick is the sound of time...running out.\"","...tick...tick...tick...":"1970 movie poster","box_office":"$2,144,000 (US/ Canada rentals)[1]","cinematography":"Loyal Griggs","directed_by":"Ralph Nelson","release_dates":"January 9, 1970 (1970-01-09)|||||","Production":"The movie was also released the same year as Nelson's Soldier Blue.The movie can be viewed as something of a counter-narrative to In the Heat of the Night, which featured Poitier as a Philadelphia detective sent to help investigate a murder in a small town in Mississippi and aided, at first reluctantly, by the white chief of police played by Rod Steiger. Poitier's character comes to earn the respect of Steiger's, but he remains an outsider, able to navigate the complexities of being black in a small southern town because of the unfamiliarity of his style. In contrast, ...tick...tick...tick... places a local African-American fully in charge of the police, aided somewhat by the former white sheriff.The lead was played by Jim Brown, who had only recently retired as a professional football player.The movie has a somewhat low-budget feeling, and the use of Brown in the lead role has led its being often mentioned in the context of the blaxploitation genre.[citation needed]The movie was filmed in and around the town of Colusa, California, whose central courthouse square was modeled on similar squares found in the American South. The same courthouse was also used for exterior shots in the 1962 classic To Kill a Mockingbird....tick...tick...tick... was the penultimate film appearance of screen legend Fredric March.","produced_by":"James Lee Barrett Ralph Nelson","starring":"Jim Brown George Kennedy Fredric March","running_time":"100 min.","music_by":"Jerry Styner","edited_by":"Alex Beaton","Release":"The film was released theatrically in the United States by Metro-Goldwyn-Mayer in January 1970.[5]The film was never given an official VHS release in the United States. It was released on DVD in 2012 via the Warner Archive on demand service. This release is anamorphic in 2.40:1 aspect ratio.[6]","written_by":"James Lee Barrett"}