{"based_on":"Admission  by Jean Hanff Korelitz","country":"United States","distributed_by":"Focus Features","screenplay_by":"Karen Croner","Plot":"Straight-laced Princeton University Admissions Officer Portia Nathan (Tina Fey) is caught off guard when she makes a recruiting visit to an alternative high school overseen by a former college classmate, the free-wheeling John Pressman (Paul Rudd). With vast experience in the coaching, consoling, and criticism involving Princeton's admission, she pays a visit to the Quest School, where John teaches while raising an adopted son. After exposing Portia to outspoken Quest students' impressions of college, he takes her to meet the rather unconventional Jeremiah Balakian, a child prodigy.Back on campus, Portia's longtime boyfriend Mark breaks up with her after impregnating a \"Virginia Woolf scholar\" named Helen. After an awkward romantic attraction to Pressman, she arranges for Jeremiah to visit Princeton, where she and a colleague, Corinne, are rivals to succeed the soon-to-retire Dean of Admissions.Portia long ago had a secret pregnancy, putting the baby up for adoption, and is shown apparent proof by Pressman that Jeremiah is her son. Although he is brilliant, Jeremiah's miserable transcript results in his being deemed unfit to attend the University. Portia, in an act that greatly endangers her position, schemes to gain Jeremiah entrance into the school, knowing that Princeton cannot reveal such a scandal.Her resignation is demanded. Later, when revealing to Jeremiah that she is his biological mother, she finds out that there was a photocopy mistake on his birth certificate and that the boy has already located his actual biological mother. Portia appears at the Adoption Agency, trying to locate her son, where she describes her life with a different perspective. When asked how would she feel to meet her actual child, she replies that she would feel \"nervous, but lucky.\"In the end, now dating Pressman, she receives a letter about her son, which says he is not ready to meet her yet. Pressman points out to her that she is on the waitlist \"... and that's not so bad.\"","language":"English","Reception":"Admission received mixed reviews from critics. Rotten Tomatoes gave the film a 38% rating based on 143 reviews, with the site's consensus: \"Admission has a pair of immensely likable leads in Tina Fey and Paul Rudd, but it wastes them on a contrived (and clumsily directed) screenplay\".[10] Metacritic gives an average score of 48% based on 39 reviews, indicating \"mixed or average reviews.\"[11]","admission":"Theatrical release poster","box_office":"$18,637,201[3]","cinematography":"Declan Quinn","production_company":"Depth of Field","directed_by":"Paul Weitz","release_dates":"March 22, 2013 (2013-03-22)|||||","Production":"The film was directed by Paul Weitz, known for his work on About a Boy, and was based on the novel of the same name by Jean Hanff Korelitz. The film was shot both at the Princeton University campus and at Manhattanville College in Purchase, New York.[8] A trailer for the film was released on November 20, 2012.[9] The film was released on March 22, 2013. Admission was the first major motion picture to use RushTera for post production collaboration.","produced_by":"Paul Weitz Kerry Kohansky-Roberts Andrew Miano","starring":"Tina Fey|Paul Rudd|","running_time":"108 minutes[1]","music_by":"Stephen Trask","edited_by":"Joan Sobel","budget":"$13 million[2]"}