{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"In the spring of 1969, Anthony Curtis (Larenz Tate) is about to graduate from high school, and decides to enlist in the U.S. Marine Corps rather than go to college. He is sent to Vietnam, leaving behind his middle-class family, his pregnant girlfriend Juanita (Rose Jackson), and small time crook Kirby (Keith David), who is like a second father. Anthony's close friend, Skip (Chris Tucker), later joins Curtis' squad after flunking out of college, and his other friend, Jose (Freddy Rodriguez), is drafted into the Army. Once in the Marines, Curtis and his squad lose several fellow marines during combat, and commit several atrocities of their own, such as executing enemy prisoners and beheading corpses for war trophies.When Anthony returns to the Bronx in 1973, after four years of service, he finds returning to \"normal\" life is impossible. He finds Skip is now a heroin addict, Jose is a pyromaniac, and Cleon (Bokeem Woodbine), a religious yet deadly staff sergeant that was in his squad, is now a devoted minister. After being laid off from his job at a butcher shop, Anthony finds himself unable to support Juanita (who had an affair while he was on duty) or his daughter. After an argument with Juanita, Anthony meets his girlfriend's sister, Delilah (N'Bushe Wright), who is now a member of the \"Nat Turner Cadre\", a revolutionary militant group. Anthony, Kirby, Skip, Jose, Delilah, and Cleon devise a plan to rob an armored car making a stop at the Noble Street Federal Reserve Bank of the Bronx.The next day, the group strategically position themselves around the street, armed with weapons and disguised with face paint, ready to ambush the truck. The plan goes awry after Anthony and Jose are spotted by the driver, causing a large shootout with the security guards. Jose (a demolition expert in the army) plants an explosive device on the escaping truck to blow off the door, but instead, destroys the whole vehicle. Delilah saves Anthony's life as he is about to be shot by a guard, and gets killed instead, devastating Anthony. As the group collects what cash they can from the burning wreckage, they split up to escape the police, and Jose gets crushed against a wall by a squad car after he shoots the driver.Not long after the heist, Kirby hears that Cleon has been giving out $100 bills and has bought himself a new Cadillac that he can barely afford. Anthony drives over to Cleon's church to speak to him, only to find him being led out the front door in handcuffs by two detectives; Cleon gives up the other thieves as part of a plea bargain. NYPD officers storm Skip's apartment only to find that he has died of a heroin overdose. As Kirby and Anthony prepare to flee to Mexico, police raid the bar, surrounding and arresting the pair. Anthony is sentenced to 15 years to life in prison by the judge, himself a WWII veteran. Anthony, furious at his sentence in spite of his years of service for his country, throws a chair at the judge before being escorted away. The films ends with Anthony looking out the window of his prison bus and reflecting on what could've been.","language":"English","Themes":"The film depicts the struggle of returning war veterans who are neglected by the US government. Many veterans of the Vietnam War were denied benefits, compensation, and recognition for their efforts in serving their country.[3]","Reception":"Dead Presidents received mixed reviews from critics. Film review aggregator Rotten Tomatoes reports that 45% of critics gave the film a \"fresh\" rating, based on 31 reviews with an average score of 5.7/10.[4]Todd McCarthy of Variety gave the film a positive review stating, \"In all respects an extremely ambitious follow-up to their crackling debut, Menace II Society, the Hughes Brothers' mordant Dead Presidents may eventually box itself into a narrative dead end, but its muscular engagement of weighty themes and explosive situations makes it a powerful drama.\"[5] Kenneth Turan of the Los Angeles Times called the film \"both expected and surprising, familiar and yet somehow different. Made with fluid skill and a passion for storytelling, its tale of how the Vietnam War and American society affect a black Marine remains accessible while confounding expectations.\"[6]Caryn James of The New York Times felt the film \"takes on much more than it can handle.\" Comparing the film with the Hughes Brother's previous film James said, \"The Hugheses obviously knew the world and generation of Menace II Society better than the past of Dead Presidents, but that is only part of the problem. In Menace they trusted the audience more, immersing them in a violent world the film explained without condoning.\"[7] Similarly, Roger Ebert of the Chicago Sun-Times explained that the directing duo \"have a sure sense of the camera, of actors, of the life within a scene. But they are not as sure when it comes to story and meaning, and here is a film that feels incomplete, as if its last step is into thin air. Scene by scene you feel its skill, but you leave the theater wondering about the meaning of it all.\"[8]","box_office":"$24,147,179 (domestically)[1]","cinematography":"Lisa Rinzler","production_company":"Hollywood Pictures Caravan Pictures Underworld Entertainment","directed_by":"Albert Hughes Allen Hughes","dead_presidents":"Theatrical release poster","release_dates":"October 6, 1995 (1995-10-06)|||||","produced_by":"Albert Hughes Allen Hughes","starring":"Larenz Tate Keith David Chris Tucker N'Bushe Wright Freddy Rodriguez Bokeem Woodbine","running_time":"119 minutes","music_by":"Danny Elfman","edited_by":"Dan Lebental","written_by":"Hughes brothers Michael Henry Brown","budget":"$10 million"}