{"Impact":"During the filming of Return of the Jedi, in which Ian McDiarmid, who portrays minor character Brother Jacopus in this film, stars as the film's main antagonist, Emperor Palpatine, the ILM crew jokingly placed a model of one of the dragons from Dragonslayer in the arms of the Rancor model and took a picture. The picture was included in the book Star Wars: Chronicles. A creature based on the appearance of this dragon appears in one of Jabba the Hutt's creature pens in Inside the Worlds of Star Wars Trilogy.Guillermo del Toro has stated that along with Maleficent in Sleeping Beauty, Vermithrax is his favourite cinematic Disney dragon.[10] He further stated that \"One of the best and one of the strongest landmarks [of dragon movies] that almost nobody can overcome is Dragonslayer. The design of the Vermithrax Pejorative is perhaps one of the most perfect creature designs ever made.\"[11] Author George R. R. Martin once ranked the film the fifth best fantasy movie of all time, and called Vermithrax \"the best dragon ever put on film\", and the one with \"the coolest dragon name as well\".[12] Vermithrax is mentioned in the fourth episode of the television adaptation to Martin's A Song of Ice and Fire book series.[13] Fantasy author Alex Bledsoe stated that \"everyone has a 'first dragon', the one that awoke their sense of wonder about the creatures. For many it's Anne McCaffrey's elaborate world of Pern, where genetically-engineered intelligent dragons bond with their riders; for others it's Smaug in The Hobbit, guarding his hoard deep in a cave. But for me, it was the awesome Vermithrax from the 1981 film, Dragonslayer.\"[14]","country":"United States","Box office and reception":"Dragonslayer is a compelling and often brilliant fantasy film; it is also, however, a movie which is at odds with the normal internal structure of the typical \"hero myth\". It first tries hard to evoke a certain time and place and then tries just as hard to reject the necessary, and expected, limitations its particular setting and historical era impose. To put it bluntly, Dragonslayer is not content to conform to the strictures of the genre and to tell a rousing good story; it seeks, as well, to impose modern sensibilities on its medieval characters and plot- twentieth-century political, sociological, and religious sensibilities which only serve to dilute its particular strengths.The film grossed just over $14 million in the US[7] with an estimated budget of USD$18 million. Despite its mediocre box office performance, it later became a cult classic on home video.[citation needed] Rotten Tomatoes gives the film a 6.7 out of 10 rating, with 86% positive reviews; its consensus reads: \"An atypically dark Disney adventure, Dragonslayer puts a realistic spin -- and some impressive special effects -- on a familiar tale.\"[8]Kevin Thomas of the Los Angeles Times called Vermithrax \"the greatest dragon yet\", and praised the film for its effective evocation of the Dark Ages.[9]David Denby of New York praised Dragonslayer's special effects and lauded the film as being much better than Excalibur and Raiders of the Lost Ark.[9]David Sterritt of The Christian Science Monitor, although praising the sets and pacing of the film, criticised it for lack of originality, stressing that McNicol's and Richardson's characters bore too many similarities to the heroes of Star Wars. A similar critique was given by John Coleman of the New Statesman, who called the film a \"turgid sword-and-sorcery fable, with Ralph Richardson in a backdated kind of Star Wars of Alec Guinness role...\".[9]Tim Pulleine of the Monthly Film Bulletin criticised the film's lack of narrative drive and clarity to supplement the special effects.[9]Alex Keneas of Newsday criticised the film for being too focused on superstition, and for being \"bereft of any sense of medieval time, place and society...\".[9]","distributed_by":"Paramount Pictures (North America) Buena Vista Distribution (International)","Plot":"A sixth-century post-Roman kingdom called Urland[2] is being terrorized by a 400-year-old dragon named Vermithrax Pejorative.[2] To appease the dragon, King Casiodorus (Peter Eyre) offers it virgin girls selected by lottery twice a year. An expedition led by a young man called Valerian (Clarke) seeks the last sorcerer, Ulrich of Craggenmoor (Richardson), for help. A brutish soldier from Urland named Tyrian (Hallam), who has followed the expedition, intimidates the wizard. Ulrich invites Tyrian to stab him to prove his magical powers. Tyrian does so and Ulrich dies instantly, to the horror of his young apprentice Galen Bradwarden (MacNicol) and his elderly servant Hodge (Sydney Bromley). Hodge cremates Ulrich's body and places the ashes in a leather pouch, informing Galen that Ulrich wanted his ashes spread over a lake of burning water.Galen inherits the wizard's magical amulet, and takes it upon himself to journey to Urland. On the way, he discovers Valerian is really a young woman, who disguised herself to avoid being selected in the lottery. In an effort to discourage the expedition, Tyrian kills Hodge; before dying, he hands Galen the pouch and dies with the words \"Burning water...\" on his lips.Arriving in Urland, Galen inspects the dragon's lair and attempts to seal its entrance by causing rocks to fall from the cliff. Tyrian apprehends Galen and takes him to the court of King Casiodorus. King Casiodorus guesses that Galen is not a real wizard and complains that his attack may have angered the dragon instead of killing it, as his own brother and predecessor once did. The king confiscates the amulet and imprisons Galen. His daughter Elspeth (Chloe Salaman) comes to taunt Galen, but is shocked when he informs her of rumours that the lottery is rigged to exclude her name and those who are rich enough to pay to have their children' names removed. Casiodorus is unable to lie convincingly when she confronts him regarding this.Meanwhile, the dragon frees itself from its prison and causes an earthquake. Galen narrowly escapes, but without the amulet. The village priest, Brother Jacopus (Ian McDiarmid), leads his congregation to confront the dragon, denouncing it as the Devil, but the dragon incinerates him and then heads for the village, burning all in its path.When the lottery begins anew, Princess Elspeth rigs the draw so that only her name can be chosen. The King returns the amulet to Galen so that he might save Elspeth. Galen uses the amulet to enchant a heavy spear that had been forged by Valerian's father (which he had dubbed Sicarius Dracorum, or \"Dragonslayer\") with the ability to pierce the dragon's armored hide. Meanwhile, Valerian gathers some molted dragon scales and uses them to make Galen a shield, and the two realize they have romantic feelings for each other. As Galen attempts to rescue Princess Elspeth, he fights and kills Tyrian. The Princess, determined to make amends for all the girls whose names had been chosen in the past, descends into the dragon's cave and to her death. Galen follows her and finds a brood of young dragons feasting on her corpse. He kills them and finds Vermithrax nesting by an underground lake of fire. He manages to wound the monster but the spear is broken. Only Valerian's shield saves him from incineration.After his failure to kill Vermithrax, Valerian convinces Galen to leave the village with her. As the two lovers prepare to leave, the amulet gives Galen a vision that explains his teacher's final wishes. Ulrich had asked that his ashes be spread over \"burning water\", and Galen realizes that the wizard had planned his own death and cremation after realizing he was not physically able to make the journey by himself. He used Galen to deliver him to Urland. Galen returns to the cave. When the ashes are spread over the lake, the wizard is resurrected within the flames. Ulrich reveals that his time is short and that Galen must destroy the amulet when the time is right. The wizard then transports himself to the mountaintop and confronts the dragon. After a brief battle, the monster grabs the old man and flies away with him. Galen crushes the amulet with a rock, causing the wizard to explode and kill the dragon, whose corpse falls out of the sky.Inspecting the wreckage, the villagers credit God with the victory. The king arrives and drives a sword into the dragon's broken carcass to claim the glory for himself. As Galen and Valerian leave Urland together, he confesses that he misses both Ulrich and the amulet. He says \"I just wish we had a horse,\" and a white horse appears to take the incredulous lovers away.","language":"English","box_office":"$14,110,013","cinematography":"Derek Vanlint","production_company":"Paramount Pictures Walt Disney Productions","directed_by":"Matthew Robbins","dragonslayer":"Original 1981 theatrical poster by Jeff Jones","release_dates":"June 26, 1981","Production":"According to Hal Barwood, he and Matthew Robins got the inspiration for Dragonslayer from The Sorcerer's Apprentice sequence in Fantasia, and later came up with a story after researching St. George and the Dragon. Barwood and Robins rejected the traditional conceptions of the medieval world in order to give the film more realism: \"our film has no knights in shining armour, no pennants streaming in the breeze, no delicate ladies with diaphonous veils waving from turreted castles, no courtly love, no holy grail. Instead we set out to create a very strange world with a lot of weird values and customs, steeped in superstition, where the clothes and manners of the people were rough, their homes and villages primitive and their countryside almost primeval, so that the idea of magic would be a natural part of their existence.\" For this reason, they chose to set the film after the Roman departure from Britain, prior to the arrival of Christianity. Barwood and Robins began to hastily work on the story outline of the film on June 25, 1979 and finished it in early August. They received numerous refusals from various film studios, due to their inexperience in budget negotiations. The screenplay was eventually accepted by Paramount Pictures and Walt Disney Productions, becoming the two studios' second joint effort after the 1980 film Popeye.[2]Twenty-five percent of the film's budget went into the special effects to bring the dragon to life. Graphic artist David Bunnet was assigned to design the look of the dragon, and was fed ideas on the mechanics on how the dragon would move, and then rendered the concepts on paper. It was decided early on in production that as the film's most important sequence would have been the final battle, it was deemed necessary to design a dragon with an emphasis on its flying abilities. Bunnet also designed the dragon to have a degree of personality, deliberately trying to avoid creating something like the titular creature from Alien, which he believed was \"too hideous to look at\".[2]After Bunnet handed his storyboard panels to the film crew, it was decided that the dragon would have to be realized with a wide variety of techniques: the resulting dragon on film is a composite of several different models. Phil Tippett of ILM finalized the dragon's design, and sculpted a reference model which Danny Lee of Disney Studios closely followed in constructing the larger dragon props for closeup shots. Two months later, Lee's team finished building a sixteen-foot head and neck assembly, a twenty-foot tail, thighs and legs, claws capable of grabbing a man, and a 30-foot-wide (9.1 m) wing section. The parts were flown to Pinewood Studios outside London in the cargo hold of a Boeing 747.[2]Brian Johnson was hired to supervise the special effects, and began planning both on and off-set effects with various special effects specialists. Dennis Muren, the effects cameraman, stated, \"We knew the dragon had a lot more importance to this film than some of the incidental things that appeared in only a few shots in Star Wars or The Empire Strikes Back. The dragon had to be presented in a way that the audience would be absolutely stunned.\"[2]After the completion of principal shooting, a special effects team of eighty people at ILM studios in northern California worked eight months in producing 160 composite shots of the dragon. Chris Walas sculpted and operated the dragon head used for close-up shots. The model was animated by a combination of radio controls, cable controls, air bladders, levers and by hand, thus giving the illusion of a fully coordinated face with a wide range of expression.[2]Phil Tippett built a model for the scenes in which the dragon would be required to walk. Tippett did not want to use standard stop motion animation techniques, and had his team build a dragon model which would move during each exposure rather than in between as was once the standard. This process, named \"go motion\" by Tippett, recorded the creature's movements in motion as a real animal would move, and removed the jerkiness common in prior stop motion films.[2]Ken Ralston was assigned to the flying scenes. He built a model with an articulated aluminium skeleton in order to give it a wide range of motion. Ralston shot films of birds flying in order to incorporate their movements into the model. As with the walking dragon, the flying model was filmed using go-motion techniques. The camera was programmed to tilt and move at various angles in order to convey the sensation of flight.[2]Peter MacNicol first met Matthew Robins while waiting to audition for the pilot film of Breaking Away, and agreed to take part in Dragonslayer, despite having a dislike for performing magic tricks. McNicol had to learn horse riding, both English style and bareback for the role. McNicol found this difficult, saying that \"They took away my stirrups, they took away my reins and whipped the horse, and then they told me to windmill my arms and turn a complete circle in the saddle. Then they took away the saddle!\" He later took on vocal coaching in order to disguise his Texas accent, and took magic lessons from British prestidigitator Harold Taylor, who had previously performed for the British royal family.[2]Caitlin Clarke was initially hesitant to involve herself in the film, as she was preparing to audition for a play in Chicago. Her agent insisted, though, and after doing an audition tape, was called back for more tests. Clarke failed them, but managed to pass after doing another test at the insistence of Matthew Robins. She got on well with Ralph Richardson, and stated that he taught her more in one rehearsal than in years of acting classes.[2]Elliot Scott was hired to design the sets of the film's sixth-century world. He temporarily converted the 13th-century Dolwyddelan Castle into Ulrich's ramshackle sixth-century fortress, much to the surprise of the locals. Next, Scott built the entire village of Swanscombe on a farmside outside London. Although Scott extensively researched medieval architecture in the British Museum and his own library, he took some artistic liberties in creating the thatched roof houses, the granary, Simon's house and smithy and Casiodorus' castle, as he was unable to find enough information on how they would look exactly. Scott then built the interior of the dragon's lair, using 25,000 cubic feet (710 m3) of polystyrene and 40 tons of Welsh slate and shale. The shots of the Welsh and Scottish landscapes were extended through the use of over three dozen matte paintings.[2]Nearly all of the outdoor scenes were shot in North Wales. The final scene was shot in Skye, Scotland.The costumes were designed by Anthony Mendelson, who consulted the British Museum, the London Library and his own reference files in order to make the clothing evoke the designs of the early Middle Ages. Mendelson designed the costumes to be roughly stitched and the utilised colours were ones which would have only been possible with the vegetable dyes then in use. The costumes of Casiodorus and his court were designed to be finely silked, as opposed to the coarsely woven clothes of the Urlanders.[2]The film's Academy Award-nominated score was composed by Alex North. The score's linear conception was developed through transparently layered, polyphonic orchestral texture dominated by a medieval-style modal harmony. The score was largely based on five major thematic concepts: 1) the suffering of the Urlanders; 2) a \"magic\" motif; 3) the amulet; 4) the sacrificial virgins; 5) the relationship between Galen and Valerian. North's score—which he had six weeks to compose [4]—featured music from his rejected score for Stanley Kubrick's 2001: A Space Odyssey. (The opening sequence of \"Dragonslayer\" features a reworking of North's music for the opening of the Dawn of Man sequence—which in the final film was played without music—and a waltz representing the dragon in flight was a variation of the cue Space Station Docking, which in the final cut of 2001 was replaced by The Blue Danube).[5] North was disappointed by the resulting dragon scenes, as they did not use the entirety of the pieces he composed for them. He later stated that he had written \"a very lovely waltz for when the dragon first appears, with just a slight indication that this may not be a bad dragon\". The waltz was scrapped in favour of tracks used earlier in the movie. Despite this, the score was widely praised. In an article of the New Yorker, Pauline Kael wrote that the score was a \"beauty\", and that \"at times, the music and the fiery dragon seem one\". Royal S. Brown of the Fanfare magazine praised the soundtrack as \"one of the best scores of 1981\".[6]","produced_by":"Hal Barwood Howard W. Koch","starring":"Peter MacNicol Caitlin Clarke Ralph Richardson John Hallam Peter Eyre Sydney Bromley Chloe Salaman Ian McDiarmid","running_time":"109 min.","music_by":"Alex North","edited_by":"Tony Lawson","written_by":"Hal Barwood Matthew Robbins","budget":"$18 million","Related media":"A novelization was written by Wayland Drew that delves deeper into the background of many of the characters. Expansions upon the film's plot include details such as these:Marvel Comics published a comic book adaptation of the film by writer Dennis O'Neil and artists Marie Severin and John Tartaglione in Marvel Super Special #20.[15]Simulations Publications, Inc. produced a board game designed by Brad Hessel and Redmond A. Simonsen which was based on the movie.[16]Australian label Southern Cross initially released an unauthorized soundtrack album in 1983 on LP (a boxed audiophile pressing, at 45 rpm), and in 1990 on CD. That album also appeared on iTunes for a limited time. The first official and improved CD release came in 2010 by U.S. label La-La Land Records. The new album featured newly mastered audio from the original LCR(Left-Center-Right)-mix and included previously unreleased source music and alternate takes."}