{"Cast":"Chloë Grace Moretz and Isabelle Fuhrman were considered for the part of Lillith.","country":"United States Canada","distributed_by":"Paramount Pictures","case_39":"Theatrical film poster","Plot":"Emily Jenkins (Renée Zellweger) is a social worker living in Oregon, who is assigned to investigate the family of ten-year-old Lillith Sullivan (Jodelle Ferland), as her grades have declined and an emotional rift with her parents has emerged. Emily suspects that the parents have been mistreating Lillith. Emily's fears are confirmed when Lillith's parents try to kill her by gassing her in the oven at home. Emily saves Lillith with the help of Detective Mike Barron (Ian McShane). Lillith is originally sent to a children's home, but she begs Emily to look after her instead. With the agreement of the board, Emily is assigned to take care of Lillith until a suitable foster family comes along. In the meantime, Lillith's parents, Edward and Margaret (Callum Keith Rennie and Kerry O'Malley) are placed in a mental institution.Not too long after Lillith moves in, strange things begin to happen around Emily. Two weeks later, another of Emily's cases, a boy named Diego (Alexander Conti), suddenly murders his parents, and Barron informs Emily that somebody phoned Diego from her house the night before the crime. As she is suspected of involvement in the incident, Lillith undergoes a psychiatric evaluation by Emily's best friend, Douglas J. Ames (Bradley Cooper). During the session, however, Lillith turns the evaluation around, asking Douglas what his fears are and subtly threatening him. That night after receiving a strange phone call, Douglas is panicked by a mass of hornets coming out of his body in hysteria and kills himself in his bathroom.Emily gradually becomes fearful of Lillith, so she heads to the mental asylum for answers from Lillith's parents. They tell her that, far from being truly human, Lillith is actually a demon like-Succubus who feeds on emotion, and that they had tried to kill her in an attempt to save themselves. Lillith's father tells Emily that the only way to kill Lillith is to get her to sleep. Shortly after Emily leaves the asylum, Lillith's mother hallucinates being on fire, and her father is stabbed in the eye after attacking a fellow inmate through whom the voice of Lillith spoke. Barron initially thinks Emily should seek psychiatric help, but is later convinced when he receives a strange phone call in his home from Lillith. He arms himself to help Emily. However, he inadvertently shoots himself in the head with a shotgun, killing himself as a result, when Lilith makes him imagine he is being attacked by dogs.After realizing that her closest colleagues have been eliminated, and that the rest of her cases will be next, Emily serves Lillith tea spiked with sedative. While Lillith is asleep, Emily sets fire to her house, hoping to get rid of her. However, the girl apparently escapes unharmed (from this point on, the audience may wonder whether Lilith is really present or Emily is hallucinating her presence). A police officer escorts Emily and Lillith to a temporary place to sleep. As Emily is following the police cars, she suddenly takes a different route and drives her car at a high speed, hoping to bring fear to Lillith. Instead, Lillith forces Emily to relive her childhood memory of her mother driving fast in a rainstorm. Emily fights through the memory, telling herself that it is not real. The image fades, and Lillith appears scared by the fact that Emily was able to fight through her illusion.Emily drives the car off a pier. As the car sinks, Emily struggles to lock Lillith (now in her demonic true form) in the trunk. Emily then attempts to swim to the surface. However, the demon grabs Emily's foot to stop her from swimming away. Emily struggles and eventually breaks free as a trapped Lillith sinks to the bottom. Emily climbs atop the pier and tries to recover from the ordeal.","language":"English","box_office":"$28.2 million[2]","cinematography":"Hagen Bodanski","production_company":"Paramount Vantage","directed_by":"Christian Alvart","release_dates":"August 13, 2009 (2009-08-13) (New Zealand)|October 1, 2010 (2010-10-01) (United States)||||","Production":"On October 31, 2006, a fire started on the film's set in Vancouver. None of the cast were on the set at the time and nobody was seriously injured, though the set and studio were destroyed.[3]","produced_by":"Lisa Bruce Steve Golin Alix Madigan Kevin Misher","starring":"Renée Zellweger Jodelle Ferland Ian McShane Bradley Cooper","running_time":"109 minutes","Alternate ending":"On the DVD as a deleted scene in the Special Features section, Emily careens through the harbor gate and drives the car off the pier into the bay just as in the theatrical ending. The car sinks to the bottom and fills with water. Suddenly, a man swims down to the car, opens Lillith's door, and carries her to the surface, leaving Emily behind. Emily tries unsuccessfully to open her door but begins to pass out. Suddenly, the man reappears and frees her, too. As the ambulance carries Emily away, a news broadcast details the event. The witnesses are suspicious. Margaret Sullivan can be seen watching it. In the final scenes, Emily can be seen in handcuffs, frantically pleading with her lawyer to tell her where Lillith is, while Lillith arrives at the home of her new foster family and turns to wink at the camera sadistically.","music_by":"Michl Britsch","edited_by":"Mark Goldblatt","Release":"The film had many planned release dates, since it first began production back in 2006. Its initial planned US release was February 8, 2008, which was changed to February 22, 2008.[4] It was then moved to August 22, 2008,[5] and then moved again to April 10, 2009. Then it got pushed back to a January 1, 2010, and even further when the official US release date was confirmed to be October 1, 2010.[6]Its release date was also pushed back in Australia and Mexico.[7][8]In the UK, the film was originally scheduled for release in April 2009,[9] before being rescheduled to September 4,[10] then September 25,[11][12][13] 2009, and then December 11, 2009, where it was trailed in cinemas as part of the multi-film distributors' 'Autumn Cinema'[14][15] advertising campaign. It was finally released on March 5, 2010.Case 39 was released to New Zealand cinemas on August 13, 2009 and in its opening weekend was ranked #12 with NZ$35,056.[16] Averaging NZ$1,845 at the 19 cinemas it was released, the film failed to garner attendance. The film opened at a small wide release in Australia, being shown on 85 screens. The film ranked #12 in its opening weekend with a screen average of AU$2,077 for a gross of AU$176,526. Extremely negative local reviews and a poor opening were followed by a 70% second weekend decrease. The film grossed a total of AU$332,956. The film grossed a total of US$14,926,149 from its international run ahead of its U.S. release.[17]In its debut weekend in the United States, the film opened at #7 with an estimated US$5,350,000 in 2,211 theaters, averaging US$2,420 per cinema.[18]Case 39 received mostly negative reviews from critics. On Rotten Tomatoes, the film holds a 23% rating, based on 69 reviews, with the consensus stating, \"Director Christian Alvert has a certain stylish flair, but it's wasted on Case 39's frightless, unoriginal plot.\"[19] On Metacritic, the film has a score of 25 out of 100, based on 15 critics, indicating \"generally unfavorable reviews\".[20]Gareth Jones of Dread Central gave the film 2 out of 5 knives, saying, \"I'm sure it will do decent business among the undemanding weekend-horror crowd and Zellweger fans when it eventually sees the light of day. Nobody else need apply.\"[21] Margaret Pomeranz of the Australian version of At the Movies gave the film one out of 5 stars, calling it \"one of the least scary, dumbest movies I’ve seen in a long time\". Co-host David Stratton gave it 1½ out of 5, commenting that \"once it sort of kicks into the plot – once it really gets down to the nitty gritty, like so many horror films it just becomes really ridiculous and silly\".[22]","written_by":"Ray Wright","budget":"$26 million[1]"}