{"based_on":"A Seal Called Andre  by Harry Goodridge & Lew Dietz","country":"United States","distributed_by":"Paramount Pictures (USA) Turner Pictures (internationally; these rights are now owned by Warner Bros.)","screenplay_by":"Dana Baratta","Plot":"In 1962 Toni Whitney (Tina Majorino), a nine-year-old girl, and her Rockport, Maine family adopt an orphaned baby seal, naming it Andre. He is manageable when he is young but as he gets older and starts getting into mischief, he antagonizes some of the local fishermen. Toni forms an inseparable bond with him, but their relationship becomes threatened when the fishermen do not want to deal with his antics any longer. The Whitney family is based on the Goodridge family.","language":"English","box_office":"$16,820,893","cinematography":"Thomas Burstyn","production_company":"The Kushner-Locke Company","directed_by":"George Miller","Score":"Original Motion Picture Score. All tracks composed by Bruce Rowland","narrated_by":"Annette O'Toole","release_dates":"August 19, 1994 (1994-08-19)|||||","Production":"The film is based on the book A Seal Called Andre, co-written by the seal's owner, Harry Goodridge, and Lew Dietz, which describes the true story of Andre.[1] During the closing credits, shots from original 16mm films of the real Andre are shown. He, who resided in later years at the New England Aquarium in Boston, entertained tourists at Rockport, Maine every summer until his death in the spring of 1986.[2][3]In the film, Andre is not played by an actual seal, but rather by a sea lion named Tory. Two others named Kalika and PJ were also featured in it.It features the Vancouver Aquarium in Stanley Park.The theme song from the film \"Thanks to You\", sung by Tyler Collins, was a top 20 hit on the Billboard Adult Contemporary charts upon its release.The film debuted at No. 10.[4]","produced_by":"Donald Kushner Peter Locke","starring":"Tina Majorino Keith Carradine Keith Szarabajka Chelsea Field","running_time":"95 minutes","music_by":"Spencer Proffer Bruce Rowland","edited_by":"Harry Hitner","budget":"$8 million"}