{"country":"United States","distributed_by":"Screen Gems","screenplay_by":"John Claflin|Daniel Zelman|Michael Miner|Edward Neumeier|","story_by":"Hans Bauer|Jim Cash|Jack Epps, Jr.|","Plot":"A team of researchers funded by a New York pharmaceutical firm Wexel Hall, including Dr. Jack Byron, Gordon Mitchell, Sam Rogers, Gail Stern, Cole Burris, and Dr. Ben Douglas leave for a jungle in Borneo to search for a \"blood orchid\", a flower they believe can be used as a type of fountain of youth. Though their guide Captain Bill Johnson and his partner Tran Wu has misgivings about which path to take, Jack bribes him to take an unsafe path. The team goes over a waterfall and has to wade through the river. A giant anaconda emerges from the water and swallows Ben whole, but the rest of the team escapes the river. Bill assures them that it was the largest snake he has ever seen and that it should take weeks for it to grow hungry again; however, most of the team demands that the expedition be called off. They travel to Bill's friend, John Livingston, who lives on the river to see if Johnson can borrow his boat; however, they find Livingston dead and his boat crashed.They find themselves in a small native village consisting of thatched huts where a disemboweled anaconda with a pair of human legs hanging out of the snake's abdomen is displayed. The team realizes that the snakes are unusually large in size because their lives have been extended through the orchids, which are a part of the local food chain. Jack says that since they must be close to the orchids, they should press on. However the others contend that there is no evidence that the orchids will have the same effect on humans. Wanting to leave, they start building an escape raft.Gordon discovers Livington's radio and gun and realizes he could have called for help long ago. Jack is unable to convince him to allow the expedition to continue, so he paralyzes him using a poisonous spider. As Jack joins the others at the raft, Sam discovers Mitchell and the spider bite. An anaconda drops down from the rafters and swallows Gordon alive soon after she leaves the building. The others arrive just as it finishes, so Bill sets the building on fire. Jack uses the commotion to steal the raft.With no more material to make another raft, they bushwack through the jungle to beat Jack to the orchids and retrieve their raft. On the way they fall into a cave trying to escape an anaconda. Cole gets lost and panics after finding a skeleton. He runs into Bill's partner, Tran, and as they return to the others, Tran is eaten by an anaconda underwater. The terrified Cole escapes the caves behind the group seconds ahead of the snake. It follows him through the hole and gets stuck. Sam uses a machete to behead the snake, but another snake captures Cole. The team follows and find him being constricted but still alive. Bill throws his knife and impales the snake through the head, killing it and freeing Cole.The group finds the raft just as Jack finds the blood orchids, hanging precariously above a pit in which a ball of male anacondas are mating with the queen. Byron shoots Johnson in the arm and forces the party to accompany him to the orchids. He has Sam cross the pit via a thin log to fill a backpack with orchids. As she returns, the log cracks. Jack orders her to throw him the backpack, but Sam threatens to drop the flowers into the pit unless he drops the gun. The log breaks, and she falls, landing halfway down the pit. As the others help her climb out, Jack attempts to retrieve the backpack. The spider he used to paralyze Gordon escapes its jar and bites him. Jack falls into the pit and is devoured as Sam and the others escape.The female anaconda notices them, but Gail tricks it into biting their fuel container. Bill tries to shoot the snake, but the gun is empty. Cole shoots it with a flare, causing a chain reaction that kills the snakes and destroys the blood orchids. Bill, Sam, Cole, and Gail make it back to the raft and leave.","language":"English","Reception":"The film received negative reviews from critics. The review aggregate site Rotten Tomatoes reported that the film received 26% positive reviews, based on 117 reviews.[2] Metacritic reported the film had an average score of 40 out of 100, based on 28 reviews.[3] The film was mainly criticized for the film's heavy use of \"unrealistic\" CGI, but the fact that Anacondas are not native to Borneo was not much appreciated by reviewers either.[4] Roger Ebert awarded the film two out of four stars, a rating less than that he gave the original film. Ebert however praised the acting of Matthew Marsden as being \"suitably treacherous\".[5]Anacondas: The Hunt for the Blood Orchid was nominated for a Razzie Award for Worst Remake or Sequel, but lost the trophy to Scooby-Doo 2: Monsters Unleashed.[citation needed]","box_office":"$71 million[1]","cinematography":"Stephen F. Windon","directed_by":"Dwight H. Little","release_dates":"August 27, 2004 (2004-08-27)|||||","anacondas:_the_hunt_for_the_blood_orchid":"Theatrical release poster","produced_by":"Verna Harrah","starring":"Johnny Messner|KaDee Strickland|Matthew Marsden|Eugene Byrd|Salli Richardson|Karl Yune|Nicholas Gonzalez|Morris Chestnut|","running_time":"97 minutes","music_by":"Nerida Tyson-Chew","edited_by":"Marcus D'Arcy|Mark Warner|","Release":"The film debuted in second place at the box office and grossed $70,992,898, behind the predecessor's $136 million worldwide.","budget":"$20 million[1]"}