{"country":"United States","distributed_by":"Universal Pictures","death_becomes_her":"Theatrical release poster","Plot":"In 1978, narcissistic, manipulative Madeline Ashton performs in a musical on Broadway. Madeline invites long-time rival Helen Sharp, an aspiring writer, backstage along with her fiancé, plastic surgeon Ernest Menville. Ernest is smitten with Madeline, soon breaking off his engagement with Helen to marry her. Seven years later, Helen is in a psychiatric hospital after fixating upon Madeline. Obese and depressed, Helen feigns rehabilitation and is released, plotting revenge on Madeline.After an additional seven years, Madeline lives well in Beverly Hills with Ernest, but they are miserable together. Madeline's career has faded, and Ernest is an alcoholic reduced to working as a reconstructive mortician. Receiving an invitation to a party celebrating Helen's new book, Madeline rushes to a spa where she regularly receives extensive facial treatments. Understanding Madeline's situation, the spa owner gives her the business card of Lisle von Rhoman, a woman who specializes in youth rejuvenation. Madeline dismisses the spa owner's advice.Madeline and Ernest attend the party for Helen's novel Forever Young and discover Helen is thin and youthful. Dumbfounded and depressed by Helen's appearance, Madeline goes to see her young lover but discovers he is with a woman his own age. Dejected, Madeline drives to Lisle's home. Lisle is a mysterious, wealthy socialite who claims to be 71, but appears much younger, and reveals to Madeline the secret of her beauty: a potion that promises eternal life and an ever-lasting youthful appearance. Madeline purchases and drinks the potion and is rejuvenated. As a condition of purchase, Madeline must disappear from public life after ten years to keep the existence of the potion secret. Lisle warns Madeline to take good care of her body.Helen has seduced Ernest and convinced him to kill Madeline. When Madeline returns home, she and Ernest argue, during which Madeline falls down the stairs and breaks her neck. Believing Madeline dead, Ernest phones Helen for advice, not seeing Madeline stand and approach him with her head twisted backwards. Ernest assumes she has a dislocated neck and drives her to the emergency room. Madeline is told she is technically dead and faints. She is taken to the morgue due to her body having no pulse and a temperature below 80°F. After rescuing Madeline, Ernest takes the sign of her \"resurrection\" as a miracle, returns home with Madeline and uses his skills to repair her body.Helen arrives home, demanding information about Madeline's situation. Overhearing Helen and Ernest discussing their plot to stage Madeline's death, Madeline shoots Helen with a double-barreled shotgun. Although the blast causes a gaping hole in her stomach, Helen survives, revealing that she drank the same potion. Fed up with the pair, Ernest prepares to leave but Helen and Madeline convince him to do one last repair on their bodies. They realize their bodies will need constant maintenance and scheme to have Ernest drink the potion to ensure he will always be available.After bringing Ernest to Lisle, she offers to give him the potion free of charge. Ernest refuses; he would rather live a normal life than spend an eternity with Madeline and Helen. He pockets the potion and flees, but becomes trapped on the roof. Helen and Madeline implore Ernest to drink the potion to survive an impending fall. Ernest refuses and drops the potion to the ground several stories below, but after falling he lands in Lisle's pool and escapes. After Lisle banishes Madeline and Helen from her group, the pair realize they must rely on each other for companionship and maintenance.Thirty-seven years later, Madeline and Helen attend Ernest's funeral, where he is eulogized as having lived an adventurous and fulfilling life. The two bicker as they leave Ernest's funeral. They are parodies of their former selves, with cracked, peeling paint and putty covering most of their grey and rotting flesh. Helen trips and teeters at the top of a staircase. After Madeline hesitates to help her, Helen grabs Madeline and the two tumble down the stairs, breaking to pieces. As their disembodied heads roll and totter together, Helen sardonically asks Madeline, \"Do you remember where you parked the car?\"","language":"English","Reception":"The film received mixed reviews.[4][5] It currently holds a 45% rating at Rotten Tomatoes based on 22 reviews.[6] Gene Siskel and Roger Ebert both gave the film a 'thumbs down', commenting that while the film had great special effects, it lacked any real substance or character depth.[7]","box_office":"$149 million[1]","cinematography":"Dean Cundey","directed_by":"Robert Zemeckis","Soundtrack":"The score was composed by American film composer Alan Silvestri, who also composed scores of other films directed by Zemeckis.[3]","release_dates":"July 31, 1992 (1992-07-31)|||||","Production":"Death Becomes Her was a technically complex movie to make, and the production had a fair number of mishaps. For example, in a scene where Helen Sharp and Madeline Ashton are battling with shovels, Meryl Streep accidentally cut Goldie Hawn's face, leaving a faint scar. Streep admitted that she disliked working on a project that focused so heavily on special effects, saying:My first, my last, my only. I think it's tedious. Whatever concentration you can apply to that kind of comedy is just shredded. You stand there like a piece of machinery—they should get machinery to do it. I loved how it turned out. But it's not fun to act to a lampstand. \"Pretend this is Goldie, right here! Uh, no, I'm sorry, Bob, she went off the mark by five centimeters, and now her head won't match her neck!\" It was like being at the dentist.[2]Computer generated imagery (CGI) by Industrial Light and Magic was used to create the skin effects, such as Madeline's twisted neck and stretching skin, and the shotgun hole through Helen's abdomen.","Box office":"The film opened at #1 at the box office with $12,110,355 on the same weekend as and ahead of Buffy the Vampire Slayer and Bebe's Kids.[8] It went on to earn over $149 million worldwide.","produced_by":"Robert Zemeckis Steve Starkey","starring":"Goldie Hawn|Bruce Willis|Meryl Streep|Isabella Rossellini|","running_time":"104 minutes","music_by":"Alan Silvestri","edited_by":"Arthur Schmidt","written_by":"Martin Donovan David Koepp","budget":"$55 million"}