{"country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Coffin Ed Johnson & Gravedigger Jones are confounded by a string of strange murders in the neighborhood of Harlem, New York. The murders themselves aren't nearly as bizarre as the calling card left by the murderer: a blue steel straight razor. Legend has it that this was the calling card of Charleston Blue, a vigilante who tried to rid the neighborhood of all criminal elements using a straight razor. Blue, having disappeared years ago after he went after Dutch Schultz (with his trusty straight razor) was considered dead by all except his girlfriend, who kept his razors locked away until his \"come back.\"Soon after the murders start it is discovered that the razors were missing and all evidence points to Joe Painter, a local photographer, who has begun dating Carol, the beloved niece of mafia errand boy, Caspar Brown. Joe and Brown are at odds over Caspar's refusal to help Joe kick the mafia out of the neighborhood, so Joe enlists the help of a group of brothers and the spirit of Charleston Blue. However, Coffin Ed Johnson & Gravedigger Jones discover that Joe's plan doesn't seem to be exactly what he claimed it was.","language":"English","Reception":"This film was a sequel to the film Cotton Comes to Harlem: appearing two years later, it opened to mixed reviews, with critics feeling it was decent, but not riotous like the original 1970 film. In April 1972, less than three months before the film's release, Time magazine called the film \"part of a new Hollywood wave of eminently commercial movies by blacks about the black experience,\" a wave that included Sweet Sweetback's Baadasssss Song, Shaft, Shaft's Big Score, Cool Breeze, Buck and the Preacher, The Legend of Nigger Charley, Super Fly, and Blacula.[2]A. H. Weiler, reviewing the film for The New York Times, called it \"only occasionally funny or incisive\" with a \"convoluted plot and dialogue that is often too 'in' for the uninitiated.\"[1]","cinematography":"Richard C. Kratina","directed_by":"Mark Warren","Soundtrack":"All tracks written by Donny Hathaway except \"Little Ghetto Boy\" (Earl DuRouen / Edward Howard) and \"Come Back Charleston Blue\" (Donny Hathaway / Al Cleveland / Quincy Jones).[3]In November 2007, Rhino Records released a remastered version of the soundtrack album, which included two new tracks, an alternate version and a live version of \"Little Ghetto Boy.\"[4]","release_dates":"June 29, 1972 (1972-06-29)|||||","Production":"The film was shot in Harlem,[1] which required producer Samuel Goldwyn Jr. to negotiate with CORE and other groups over their demands for \"money, jobs and control.\"[2]","produced_by":"Samuel Goldwyn Jr.","starring":"Godfrey Cambridge Raymond St. Jacques","running_time":"100 minutes[1]","music_by":"Donny Hathaway","come_back,_charleston_blue":"Theatrical release poster","edited_by":"George Bowers Gerald B. Greenberg","written_by":"Peggy Elliott Bontche Schweig Chester Himes (novel The Heat's On)"}