{"country":"United States","distributed_by":"Miramax Films","Plot":"In the fictional town of Garrison, New Jersey, located across the Hudson River from New York City, a number of residents are NYPD officers. Local Sheriff Freddy Heflin (Sylvester Stallone) is secretly in love with Liz Randone (Annabella Sciorra), whose life he once saved after a car accident. Her rescue cost him the hearing in one ear which made him ineligible to become a New York City cop, as so many of his peers did, including Liz's abusive and unfaithful husband Joey Randone (Peter Berg).One night, Murray \"Superboy\" Babitch (Michael Rapaport), nephew of Lt. Ray Donlan (Harvey Keitel), is driving across the George Washington Bridge when his car is side-swiped by a couple of African-American teens. Babitch attempts to force them to pull over. The passenger points what Babitch thinks is a weapon just before (Babitch's) front tire \"blows out\". Believing they have fired at him, Babitch shoots back. In an ensuing accident, the teens are killed. Jack Rucker (Robert Patrick) removes the steering-wheel lock that Babitch mistook for a weapon from the hands of one of the dead teens and is caught trying to plant a sub-machine-gun in their vehicle to justify the shooting. Worried about the repercussions to his career, Babitch is persuaded by Donlan to fake his own suicide; with help from several other cops, Donlan pretends that Babitch has jumped off the bridge.Other corrupt police officers, including Detective Leo Crasky (John Spencer) and Frank Lagonda (Arthur Nascarella), fear that Babitch will resurface and testify about their corruption to Internal Affairs. Internal Affairs investigator Lt. Moe Tilden (Robert De Niro) asks if Heflin will provide information on the corrupt cops who live in Garrison. Heflin is intimidated by the New York City cops and is reluctant to betray them, derailing Tilden's investigation. Superiors in the department, related to the corrupt cops, order Tilden to shut down the investigation.Although the Babitch cover-up appears to be initially successful, Donlan is told by Patrolmen's Defense Association President Vincent Lassaro (Frank Vincent) that without a body, the case will not stay cold. Donlan reluctantly decides that his nephew must be killed. Babitch is tipped off by his aunt Rose (Cathy Moriarty) and escapes. He goes to Heflin's house looking for help, but when he sees Heflin's friend (and fellow NYPD cop) Gary \"Figgsy\" Figgis (Ray Liotta), he flees.During the same evening, Joey Randone gets into a fight with a suspect and is thrown off a rooftop. While he is clinging to an aerial and calling for help, Donlan sees him but fails to help, in revenge for Randone's affair with Donlan's wife. By the time the cops get to the roof, Randone has fallen to his death.When Heflin realizes his mistake, he visits Tilden and is angrily told that the case was blown by his failure to co-operate sooner. As he leaves, Heflin sees a number of NYPD case files on the corrupt cops and steals them. He studies the files and realizes the extent of his friends' corruption. Deputy Cindy Betts (Janeane Garofalo) decides to leave Garrison, frustrated by the New York City cops having turned the town into their own personal fiefdom.Heflin returns home to find Figgsy packing to leave, not wanting to be further involved. Heflin finds out that Figgsy burned down his own house for the insurance money, accidentally killing his crack-addicted girlfriend Monica (Mel Gorham). Heflin manages to convince Rose to reveal where Babitch is hiding, then takes him to Garrison's jail. Heflin permits Deputy Bill Geisler (Noah Emmerich), who is nervous about protecting Babitch, to go home and take care of his pregnant wife.Heflin attempts to bring Babitch to New York City to turn over to Tilden there, but Lagonda, Donlan and Rucker ambush him. Rucker fires a gun next to Heflin's good ear, deafening and disabling him. Babitch is taken, presumably to be killed.On foot and almost totally deaf, Heflin follows them to Donlan's house, where a shootout commences. Heflin kills both Rucker and Lagonda. Heflin is then shot in the shoulder by Crasky, but is saved by the arrival of Figgsy, who kills Crasky. In the house, Babitch is trying to escape through a window. Donlan sneaks up behind Heflin, but before he can fire, Figgsy shoots. Barely hearing the shot, Heflin turns and shoots, fatally wounding Donlan. As he lies dying on the floor, Donlan mutters obscenities, to which Heflin replies simply: \"I can't hear you, Ray.\"Figgsy and Heflin personally take Babitch to New York City to Internal Affairs, refusing to allow any other cop to intervene. Tilden takes Babitch into custody. After the scandal has been investigated and indictments handed down, Heflin, who has recovered hearing in his good ear, surveys the New York City skyline from across the Hudson River. Deputy Geisler notifies him about a jack-knifed truck requiring assistance, and Heflin goes back to work.","language":"English","Reception":"Cop Land had its world premiere at the Ziegfeld Theater in New York City on August 6, 1997. Some of the film's cast members attended, including Stallone, Keitel, Liotta, Sciorra, Moriarty and Rapaport.[3]Stallone's understated performance was praised by critics and he received the Best Actor award at the Stockholm International Film Festival. Cop Land was also screened at the 54th Venice Film Festival in the Midnight line-up.[4] Earlier in May 1997, the film was accepted into the main competition at the Cannes Film Festival, but Miramax declined the invitation due to re-shoots that were needed for the film, including footage of Stallone 40 pounds heavier.[5]Critical reaction was generally positive. Based on 62 reviews collected from notable publications by review aggregator Rotten Tomatoes, the film holds an overall approval rating of 73%.[6] Roger Ebert gave the film two out of four stars and wrote, \"There is a rough balance between how long a movie is, how deep it goes and how much it can achieve. That balance is not found in Cop Land and the result is too much movie for the running time\".[7] On the other hand, Gene Siskel praised the movie, especially the screenplay, \"One to be savored.\"In her review for The New York Times, Janet Maslin felt that, \"the strength of Cop Land is in its hard-edged, novelistic portraits, which pile up furiously during the film's dynamic opening scenes... Yet if the price of Mangold's casting ambitions is a story that can't, finally, match its marquee value, that value is still inordinately strong. Everywhere the camera turns in this tense and volatile drama, it finds enough interest for a truckload of conventional Hollywood fare. Whatever its limitations, Cop Land has talent to burn\".[8]Entertainment Weekly gave the film a \"B-\" rating and Owen Gleiberman wrote, \"Stallone does a solid, occasionally winning job of going through the motions of shedding his stardom, but the wattage of his personality is turned way down—at times, it's turned down to neutral. And that pretty much describes Cop Land, too. Dense, meandering, ambitious yet jarringly pulpy, this tale of big-city corruption in small-town America has competence without mood or power—a design but not a vision\".[9] In her review for the Washington Post, Rita Kempley wrote, \"With its redundancy of supporting characters, snarled subplots and poky pace, Cop Land really might have been better off trading the director for a traffic cop\".[10] Rolling Stone magazine's Peter Travers praised Stallone's performance: \"His performance builds slowly but achieves a stunning payoff when Freddy decides to clean up his town ... Freddy awakes to his own potential, and it's exhilarating to watch the character and the actor revive in unison. Nearly down for the count in the movie ring, Stallone isn't just back in the fight. He's a winner\".[11] In his review for the San Francisco Chronicle, Mick LaSalle also liked Stallone's work: \"His transformation is more than a matter of weight. He looks spiritually beaten and terribly sad. He looks like a real person, not a cult-of-the-body film star, and he uses the opportunity to deliver his best performance in years\".[12]Unlike 1991's Oscar and 1992's Stop! Or My Mom Will Shoot, Stallone's previous high-profile attempts at branching out of one-dimensional action star roles, both of which ultimately ended up commercially unsuccessful, critically panned, and often ridiculed, Cop Land, with its star-studded heavyweight ensemble cast, was met with high expectations[by whom?] as a multifaceted story based around corruption on the New York City police force. Additionally, it was to show Stallone in a completely different light, both physically (his 40 lb weight gain got a lot of press coverage)[citation needed], as well as artistically, by letting him showcase his acting skills. While the film posted a solid box-office intake ($44.8 million domestically), got good reviews, and Stallone received positive critical notices for his performance as a demure small-town sheriff, in 2008 the actor stated on the Opie and Anthony Show that Cop Land \"hurt\" his career and that he had trouble getting roles for eight years, due to the film's failure to reach the high expectations set for it and the mix of views on whether he was leaving action movies for more character-driven content. Stallone has described this as \"the beginning of the end, for about eight years\".[13]In 2011, for Cop Land's release on Blu-ray, the film's writer and director James Mangold commented on the film's reception: \"The movie was under so much pressure to be America's next Pulp Fiction. But it's such a dark and sad tale, less jazzy and more of a kind of morality tale. It ends in a dark place. The star value got so high, and Miramax wanted the grosses to be so high. When it came out, a lot of daggers were out for Sly. He had made a bunch of shittier moves, he’s the first to admit, that weren't aimed for the highest result each time out\".[14]","box_office":"$44,862,187[1]","Home video":"Cop Land: Director's Cut was released to DVD in June 2004. Features include the original 118-minute cut, restoration of deleted scenes and scenes extended, addition of Blue Öyster Cult's \"Burnin' for You\" to the soundtrack, and a new audio commentary with James Mangold, Sylvester Stallone, Robert Patrick, and producer Cathy Konrad. Also included are a \"Shootout Storyboard Sequence\" and \"The Making of an Urban Western\" documentary.On the DVD, there are two deleted scenes that primarily show the racism in the town of Garrison. One scene involves all the resident police officers chasing down a pair of black motorists, and the other shows Heflin's deputy pointing out that the majority of the tickets issued in Garrison go to black motorists on charges that suggest racial profiling.","cinematography":"Eric Alan Edwards","production_company":"Woods Entertainment","directed_by":"James Mangold","cop_land":"Cop Land promotional poster","Soundtrack":"The film's soundtrack features two songs from Bruce Springsteen's 1980 album The River: \"Drive All Night\" and \"Stolen Car\", songs by other artists, and an original score from Howard Shore.The score by Howard Shore was performed by The London Philharmonic Orchestra and released as Cop Land: Music From The Miramax Motion Picture in 1997. The soundtrack released on CD contained twelve tracks, with a runtime of 40:11 minutes.[15][16]All music composed by Howard Shore.","release_dates":"August 15, 1997 (1997-08-15)|||||","Production":"All of the actors worked for scale due to the film's modest budget.[citation needed]The movie is based on Mangold's hometown Washingtonville, New York. He grew up in a development called Worley Heights, where many of the residents were NYPD police officers.[citation needed] However, Edgewater, New Jersey was the principal shooting location.[2]Garrison, New Jersey is a fictional town. There are no \"municipal sheriff\" departments in New Jersey. The only sheriff's departments in New Jersey are county sheriff's departments.[citation needed]","produced_by":"Cathy Konrad Ezra Swerdlow Cary Woods","starring":"Sylvester Stallone Harvey Keitel Ray Liotta Robert De Niro Peter Berg Janeane Garofalo Robert Patrick Michael Rapaport Annabella Sciorra","running_time":"104 minutes","music_by":"Howard Shore","edited_by":"Craig McKay","written_by":"James Mangold","budget":"$15 million[1]"}