{"based_on":"Don't Say a Word  by Andrew Klavan","country":"United States Australia","distributed_by":"20th Century Fox","screenplay_by":"Anthony Peckham Patrick Smith Kelly","Plot":"In 1991, a gang of thieves steal a rare $10-million gem, but, in the process, two of the gang double-cross their leader, Patrick Koster (Sean Bean) and take off with the precious stone.Ten years later, on the day before Thanksgiving, prominent private practice Manhattan child psychiatrist, Dr. Nathan R. Conrad (Michael Douglas), is invited by his friend and former colleague, Dr. Louis Sachs (Oliver Platt), to examine a disturbed young lady named Elisabeth Burrows (Brittany Murphy) at the state sanatorium.Having been released from prison on November 4, Patrick and the remaining gang members break into an apartment which overlooks Nathan's apartment, where he lives with his wife Aggie (Famke Janssen) and daughter Jessie (Skye McCole Bartusiak). That evening, Patrick kidnaps the psychiatrist's daughter as a means of forcing him to acquire a six-digit number from Elisabeth's memory.As Nathan visits Elisabeth, she is reluctant at first, but he gains her trust later—especially when he reveals that his daughter has been kidnapped and will be killed if he doesn't get the number they want. Dr. Sachs admits to Nathan that the gang who kidnapped Jessie also kidnapped his girlfriend to force him to acquire the number from Elisabeth. Sachs is then visited by Detective Sandra Cassidy (Jennifer Esposito) who reveals to him that his girlfriend has been found dead.Meanwhile, Aggie hears Jessie's voice and realizes the kidnappers reside in the apartment nearby. The kidnappers send one of them to kill Aggie while the others escape with Jessie, but Aggie sets an ambush and kills him.After Nathan takes Elisabeth out of the sanatorium, she remembers certain events regarding the gang. It is revealed that Elisabeth's dad was a member of the gang that committed the robbery ten years prior and that he double-crossed them and took the stolen gem. However, other members of the gang later found him and ordered him to reveal where he had hidden the gem, subsequently pushing him in front of a subway train. The gang members were arrested immediately, and Elisabeth escaped with her doll in which the gem was hidden. She also remembers that the required number, 815508, is the number of her father's grave at Hart Island and that her doll is placed beside him in the coffin. She explains that she had stowed away on a boat that was taking her father's coffin for burial in Potter's field on Hart Island, where the gravediggers put the doll, named Mischka, inside.Nathan and Elisabeth steal a boat to reach Hart Island. The gang members track them down and demand that Nathan give them the number they want. Elisabeth reveals the number and Patrick orders his companion to exhume her father's coffin. He finds the doll and the gem hidden inside it. He then decides to kill Nathan and Elisabeth, but Detective Cassidy arrives before he can shoot them. Patrick's companion is shot by Cassidy, but Patrick manages to wound her. Taking advantage of the confusion, Nathan takes the gem from Patrick and throws it to a nearby excavation machine. Patrick goes to recover the gem, but Nathan triggers the mechanism which covers Patrick with earth, burying him alive. Nathan is then reunited with his wife and daughter, and it is implied that Elisabeth goes on to live with the Conrads.","language":"English Italian","Reception":"Don't Say a Word received poor reviews from critics. Rotten Tomatoes gives the film a score of 24% based on 113 reviews.[3] Metacritic gives the film a generally unfavorable review with a score of 38% based on 32 reviews.[4]Despite poor reception by critics, the film was a box office success. It earned over $100 million worldwide against a budget of $50 million.[5]","don't_say_a_word":"Theatrical release poster","box_office":"$100 million","cinematography":"Amir Mokri","production_company":"Regency Enterprises Village Roadshow Pictures NPV Entertainment Kopelson Entertainment New Regency Further Films Epsilon Motion Pictures (uncredited)","directed_by":"Gary Fleder","Soundtrack":"The film's musical score was composed by Mark Isham. The soundtrack contains eight songs from various scenes, including the Heist, the Kidnapping and the horrific events at the Subway.[2]Some of the music in the film includes the following songs and performers:","release_dates":"28 September 2001 (2001-09-28)","produced_by":"Arnon Milchan Arnold Kopelson Anne Kopelson","starring":"Michael Douglas Sean Bean Brittany Murphy Guy Torry Jennifer Esposito Famke Janssen Oliver Platt","running_time":"113 minutes","music_by":"Mark Isham","edited_by":"Armen Minasian William Steinkamp","budget":"$50 million"}