{"distributed_by":"DreamWorks Studios","Plot":"In the world of underground motorcycle racing, the undefeated racer known as Smoke (Laurence Fishburne) is the undisputed \"King of Cali.\" But Smoke's dominance of the set is about to be threatened by a young motorcycle racing prodigy called Kid (Derek Luke), who is determined to win Smoke's helmet and earn the coveted title. Kid says that the difference between men and boys are the lessons they learn- and that his father, Slick Will, taught him plenty.The film starts with Kid, a novice rider and motorcycle club \"prospect,\" assisting his father, Slick Will, as they prepare Smoke's bike for the evening's drag races. A biker issues a challenge to Smoke, who accepts, and the race begins. In the midst of the race, the biker loses control from mechanical issues, his bike flies from under him into a row of parked bikes sending one into Slick Will throwing him through a store window and killing him instantly. At the funeral, dozens of bikers from the \"Black Knights\" (to whom Slick Will was a mechanic) show up with Smoke, who drops a rose and a Black Knights flag to his grave.6 months later, Kid is now a familiar racer with his custom-powered bike, and he shows up at the events. His first \"race\" was when he interfered with Stuntman's race with Donny. As he interrupts the race, he pulls off several stunts, notably standing on top of the motorcycle while it is still moving. He wins the race and the crowd seem to like his stunts, much to the dissatisfaction of Smoke. Kid demands to race with Smoke but Smoke says he is too inexperienced and should get experience first. It is later revealed that Kid and Stuntman were hustling in that race.Kid then goes to a diner where he meets fellow hustler Stuntman. Fellow biker Primo tells them to create a bike club, and after a bit of persuasion they agree, and Kid goes to the biker jury consisting of 8 leaders of most powerful biker gangs, and Smoke is on the lead. He apologizes for his disrespect towards Smoke and they all agree to verify the club, calling themselves the \"Biker Boyz.\"Kid is set to race Motherland to prove he is good enough to race Smoke. However he has showed up late to \"make an entrance\" after Smoke has already beaten Dogg, who is after Smoke's crown (his helmet). Kid is arrested when racing Motherland, and the rest of the bikers manage to escape. Anita confronts Kid, saying that if he ever races again, she will kick him out of the house. Kid agrees.One night at a Black Knights dance, Kid is \"called out\" to race Dogg and in fury, he accepts. Having said that, Anita finds Smoke before the race, and demands that he stop the race. Angry, Smoke confronts her and demands a reason, and she tells him that Kid is actually his son, not Slick Will's. Smoke successfully stops the race by punching out Kid and stealing his keys. This however only leads to a fight between the two, from which Kid comes off considerably worse than Smoke. Smoke then tells him that he is his son, to which Kid angrily goes home. He confronts Anita about this, who confesses that it's the truth. In a rage, he leaves home and heads to Tina, his girlfriend.Kid decides to turn renegade and after gaining quite a few more followers for his club, announces that \"we're gonna win more lids than any crew on the set and we're gonna out hustle every crew off the set\" and indicates that from that point on, \"Biker Boyz set their own rules.\" At this point the Biker Boyz get their own hangout and begin hustling several races, but when they go to the wrong part of town and Stuntman successfully hustles the nephew of a respected biker, Stuntman and Primo are ambushed at the next party. Kid comes to the rescue but is quickly over-powered as the leader of the other club pulls a gun on him.Smoke and some of the other Black Knights intervene and convince the other bikers to stand down. Smoke takes Kid inside and sits down to give him a stern talking-to, but Kid shrugs it off angrily. It is at this point that Smoke agrees to race Kid. However, whoever loses will never race again. But first Kid has to race Dogg, but this time, they agree to race at the track.On the race track, everybody shows up, including the Black Knights. At the race, Dogg and Kid race down, and Kid is going to win, but Dogg plays dirty and causes him to crash. Kid is alright, but his bike has been wrecked. Later that day, Smoke talks to Kid, and informs him that the authorities are going to close the track, due to many crashes, but he managed to rent a local farm outside of town to race on it. Kid agrees to arrive the next day.Later that night, Kid, with Primo and Stuntman, are trying to fix his bike, but fail to do it. Suddenly, Dogg and his crew arrive at the motel, and Dogg's mechanic arrives and checks out the engine, and informs Dogg that not even he can fix it by tomorrow. Dogg informs Kid; \"There are only 2 bikes as strong and fast as Smoke's, yours, and mine.\" Dogg offers Kid his bike, but only if Kid promises him that he will beat Smoke tomorrow.On the day of the race, both the crew of the Black Knights and the Biker Boyz arrive. Smoke wants it to be a fair race, with no N20 system, and Kid wants Tina to start the race. Smoke and Kid are racing on a farm with open fields. With the finish line in sight, it is obvious that Smoke will win. However filled with emotions, he decides to slow down and let his son win the race, becoming the new \"King of Cali.\" Kid tells Smoke to hang onto his crown for a while, and that he'll come and get it someday.Kid rides off, repeating his sentiment that the difference between men and boys are the lessons they learn, and that his father taught him plenty.","Reception":"The movie received generally negative reviews. Rotten Tomatoes gives the film a score of 23% based on reviews from 91 critics.[4] Metacritic gives the film a score of 36% based on reviews from 27 critics.[5]The film earned a worldwide total of $23.5 million.[1]","box_office":"$23,510,601","biker_boyz":"Theatrical release poster","cinematography":"Greg Gardiner","directed_by":"Reggie Rock Bythewood","Home media":"The film was released on DVD & VHS on June 10, 2003 in North America, and on DVD in the United Kingdom on August 21, 2004.","Soundtrack":"A soundtrack containing hip hop, rock and R&B music was released on January 23, 2003 by DreamWorks Records. It peaked at #98 on the Top R&B/Hip-Hop Albums.","release_dates":"January 31, 2003","Development":"Biker Boyz is based loosely on Manuel \"Pokey\" Galloway the president of Valiant Riders of Pasadena, Ca.Laurence Fishburne, Derek Luke, Orlando Jones, Djimon Hounsou and Nicholas Sheriff, Lisa Bonet, Breadan Fehr, Larenz Tate, Terrence Howard, Kid Rock, Rick Gonzalez, Meagan Good are all avid bikers in real life.[3]The real \"King Of Cali\" made a cameo appearance in the film, in the scene where Kid is in a meeting with the set.[3]Slick Will really doesn't blink as the bike hits him, as Soul Train states.Actual motorcycle clubs were on the set as technical advisors, and performed some of the tricks, stunts, and racing. They include Valiant Riders, The Mighty Black Sabbath Motorcycle Club Nation, G-Zer Tribe, Ruff Ryders, Soul Brothers, Total Package, Chosen Few, Rare Breed, Brothers of the Sun, Sisters of the Sun, Deuces, and Black Sabbath New Breed.[3]The Biker Boyz Jackets were in part inspired by Nexxunlimited Entertainment (as shown in the End credits).","produced_by":"Stephanie Allain Gina Prince-Bythewood Erwin Stoff","starring":"Laurence Fishburne Derek Luke Orlando Jones Djimon Hounsou Lisa Bonet Brendan Fehr Larenz Tate and Kid Rock","running_time":"111 minutes","music_by":"Camara Kambon","edited_by":"Caroline Ross Terilyn A. Shropshire","written_by":"Craig Fernandez Reggie Rock Bythewood","budget":"$24 million[1]"}