{"based_on":"Dragon Ball  by Akira Toriyama","Cast":"There is a second English dub, produced and released exclusively in Malaysia by Speedy Video, which features an unknown cast.","country":"Japan","distributed_by":"Toei Company","Plot summary":"In a prologue, in an age where darkness still roams the Earth, a mysterious castle called the 'Devil's Hand' stands among the \"five mountains\". As the legend happened, the beautiful \"Sleeping Princess\" is lying within the confines of the castle walls guarded by the blackest and most sinister master of the underworld.Years later, twelve-year-old Goku arrives at Kame House to seek training with Master Roshi, and to learn the secret skills of martial arts. He finds Roshi watching the exercise program featuring the girls (which the Turtle Hermit likes) and gets his attention. But while discussing their training plans over lunch, Goku and Roshi noticed a little monk approaching the island on a rowboat. After jumping off his boat and landing on Roshi's island, the monk identify himself as Krillin and also beg Roshi to train him. When Roshi refused, Krillin succeeded to make him change his mind by giving him porno magazines as a bribe. Krillin also meets Goku, who couldn't tell the difference of how men shaved their heads and made themselves balded. After telling the boys the origin of the Sleeping Princess who is apparently held captive in the Devil's Hand by an evil count named Lucifer, Roshi sends them on a quest far to the west to retrieve her with one rule: whoever brings back the Sleeping Princess will become Master Roshi's student. Meanwhile, a mean blonde-haired girl named Launch also discovered the information of the Sleeping Princess and planned to take her. The boys continued on their way to the Devil's Hand, as Krillin uses all the standard tricks to prevent Goku from catching up, but he outsmarts them without giving up. A little later, Bulma, Oolong, Yamcha, and Puar — who are on summer vacation — also meet Roshi and ask where Goku is. Roshi says that he and Krillin have gone far to the Devil's Hand (pretending it as an amusement park or a tourist attraction), so the gang fly in Bulma's Capsule jet to the castle. At sunset, Goku and Krillin finally approached the Devil's Hand itself and went inside. What they didn't know was that Launch also entered, willing to steal the Sleeping Princess away for herself.When the gang near the castle as night falls in, the jet is attacked by orges causing it to crash down, and Bulma is taken to the Devil's Hand. After waking up in a bedroom, Bulma meets Lucifer himself and his butler Igor who seemingly treat her as a guest and show her to the orge convention of the Sleeping Princess. Lucifer then revealed his true dark nature to Bulma and have her tied to a chair she sat on with vines, intending Igor to drain her of her blood through a giant syringe in order to awake the Sleeping Princess. Hearing Bulma's screams for help, Yamcha, Oolong and Puar went to the Sleeping Princess' convention, and (in disguise as orges through Oolong and Puar's shape-shifting) wait for their opportunity to rescue Bulma. Goku and Krillin ran into and fight the orges and monsters, including a giant devil called Ghastel who is then eaten by a swamp monster while attacking them, until they drop in on the bedchamber of the Sleeping Princess which they only find as a giant jewel, disrupting the convention. Then Launch arrives on her motorcycle, takes the Sleeping Princess and drives away. As Goku and Krillin chase Launch without noticing Bulma and the others, Oolong's shape-shifting wear out after five minutes, making Puar change back to herself after she sees in shock that Oolong is back to his normal self. Their disguise failed, Yamcha, Oolong and Puar are then captured. As Launch blast her way through the orges by firing her machine gun at them, her hair tickles her nose and she sneezes. Changed into a nice blue-haired version of herself, Launch fell off her motorcycle and landed on the ground, confused of what she is doing. Goku recovered the Sleeping Princess, but Lucifer appeared with the orges, holding Krillin. After being given a warning with a result of Krillin's death, Goku returns the Sleeping Princess to Lucifer and demands his release, but gets a beating from the ogres after a pink little devil paralyzed him by biting his tail (his only weak point) much to Krillin's sorrow over him.Later, Lucifer uses the light of the full moon to power up the Sleeping Princess, successfully awakening her. Outside the Devil's Hand, the gang including a now-battered and bruised Goku is encased in a giant wall of rock. Unexpectedly, Goku looked at the moon and transformed into a Great Ape, smashing the wall and releasing the gang. But the rampaging Goku chases the gang, picking up Launch and attempting to eat her. Yamcha and Krillin grabbed hold of Goku's tail, weakening the Great Ape and allowing Puar to change into a pair of scissors and cut it off. Goku changes back to his normal self, but is confused at his nudity. He also panics when he finds his tail gone, but forgets about it. Inside the castle, Lucifer inserted the Sleeping Princess in a laser cannon and prepared it to destroy the rising sun, despite Bulma's pleas. Suddenly, Goku (wearing Oolong's overall pants), Krillin and Yamcha came to the rescue. While the boys fight Lucifer, Yamcha kills Igor and frees Bulma. Just as Lucifer activates the laser cannon, Goku uses the Kamehameha wave to damage it, causing the castle to collapse. While the gang made a run for it, the falling cannon kills Lucifer, the Sleeping Princess disappeared and the Devil's Hand is half-destroyed. After the sun is up, The gang is saved and Krillin acts contrite, but doesn't actually apologize to Goku for his behavior. The gang then posed for peace as the unseen camera photographed them and the demolished Devil's Hand. The two boys return to Kame House with Launch, and Roshi is very pleased. Thinking the boys have passed the test on Launch as if she were a Sleeping Princess, he takes them both on as students while he brought Launch with him to his house. At one moment, Goku and Krillin were happy with their time for training, but it then began wrong when Launch turns into her bad self with a sneeze and drives Roshi out of his house while he tries to take advantage of her. She fires at Roshi, Goku, Krillin and Turtle until a passing fly makes her sneeze again, turning her back to her good self. Launch apologized for her actions, as the surprised group then walked back from her a little bit.","screenplay_by":"Kenji Terui","English Release":"The English rights to Sleeping Princess in Devil's Castle were granted to Harmony Gold USA originally in conjunction with their rights to the TV series in 1989. They edited the other two movies into a special, but never actually did anything with this film other than use bits of footage in their opening theme. FUNimation acquired the film in 1995, along with the Dragon Ball series, and the rest of the movies.The English dub of Sleeping Princess in Devil's Castle produced by FUNimation was released to VHS in North America in 1998, a few years after FUNimation canceled their original short-lived dub of the series with BLT Productions. The movie was dubbed as a video special and was a testing ground to see how a release with an in-house voice production would do (a few of the voices, such as Goku, Bulma, and Launch's, would be replaced in future media). However, while the film was dubbed uncut, the opening and closing sequences were altered/replaced. However, unlike the previous dub of the series and first movie, the original musical score was used except for the aforementioned opening and closing. The VHS was released in two formats, \"Edited\" and \"Unedited\". In December 2005, the film was released on a bilingual Region 1 DVD individually and as part of Dragon Ball Movie Box Set with Mystical Adventure and The Path to Power. This set was re-released in a thinpack on February 12, 2008.[2] The film was distributed to VHS and Region 4 DVD in Australia by Madman Entertainment. The film was re-released to Region 1 DVD again in a remastered 4-disc Movie pack release with the other Dragon Ball films on February 8, 2011[3] containing Funimation's existing English dub,[4] but restored the opening/ending.An alternative English dub was produced in France by AB Groupe and released in English speaking markets in Europe. It featured an uncredited voice cast.","Timeline placement":"The movie takes place at the start of Goku and Krillin's training under Master Roshi during the series' Tournament Saga.","box_office":"¥1.33 billion (US$8.9 million)","dragon_ball:_sleeping_princess_in_devil's_castle":"Australian DVD Release","cinematography":"Motoaki Ikegami","production_company":"Toei Animation","directed_by":"Daisuke Nishio","japanese":"ドラゴンボール 魔神城のねむり姫","Music":"The initial version of Funimation's English dub had the above songs replaced by the theme song composed by Peter Berring with lyricist Brian Griffith. This theme song was later removed on the remastered DVD.","release_dates":"July 18, 1987 (1987-07-18) (Japan)|||||","hepburn":"Doragon Bōru Majin-jō no nemuri hime","produced_by":"Keizō Shichijō[ja]","starring":"see below","running_time":"45 minutes","music_by":"Shunsuke Kikuchi","edited_by":"Shinichi Fukumitsu"}