{"based_on":"Blithe Spirit  by Noël Coward","country":"United Kingdom","Awards and nominations":"Tom Howard won the 1947 Academy Award for Best Visual Effects. It was nominated for the Hugo Award for Best Dramatic Presentation but lost to The Picture of Dorian Gray.","distributed_by":"General Film Distributors (United Kingdom)","screenplay_by":"David Lean Ronald Neame Anthony Havelock-Allan","blithe_spirit":"UK film quad poster","Plot":"Seeking background material for a mystery he is working on, novelist Charles Condomine (Harrison) invites eccentric medium Madame Arcati (Rutherford) to his home in Lympne, Kent, to conduct a séance. As Charles, his wife Ruth (Cummings), and their guests the Bradmans barely restrain themselves from laughing, Madame Arcati performs peculiar rituals and finally goes into a trance. Charles then hears the voice of his dead first wife, Elvira (Hammond). When he discovers that the others cannot hear her, he passes off his odd behaviour as a joke. When Arcati recovers, she is certain that something extraordinary has occurred, but everyone denies it.After Madame Arcati and the Bradmans have left, Charles is unable to convince Ruth that he was not joking. After Ruth retires for the night, Elvira becomes visible, but only to Charles. He becomes both dismayed and amused by the situation. Relations between Charles and Ruth become strained until he persuades Elvira to act as a poltergeist and transport a vase and a chair in front of his current wife.Ruth seeks Madame Arcati's help in sending Elvira back where she came from, but the medium professes that she does not know how. Ruth warns her disbelieving husband that Elvira is seeking to be reunited with him by arranging his demise. However, the spirit miscalculates; Ruth, not Charles, drives off in the car she has tampered with and ends up dead. A vengeful Ruth, now in spirit form, harasses Elvira to the point that she wants to leave.In desperation, Charles seeks Madame Arcati's help. Various incantations fail, until Arcati realises that it was the Condomines' maid Edith who summoned Elvira. Arcati appears to succeed in sending the spirits away, but it soon becomes clear that both have remained. Acting on Madame Arcati's suggestion, Charles sets out on a long vacation. However, he has a fatal accident as he is driving away, and he joins Elvira and Ruth as a spirit.","language":"English","DVD and Blu-ray release":"On 7 September 2004, MGM released the film on DVD in the US as one of eight titles included in the David Lean Collection. Playable in all regions, it is in fullscreen format with subtitles in English, Spanish, and French.In 2012, Criterion in the US, released a Blu-ray box set \"David Lean Directs Noël Coward\" which contained Blithe Spirit. This release contains a new high-definition digital transfer of the BFI National Archive’s 2008 restoration, with uncompressed monaural soundtrack. The set is region coded to Region A.In 2013, a Spanish Blu-ray, entitled \"Un Espíritu Burlón\" was released.In the UK, the rights are owned by ITV and the film has been released three times on DVD, with the last release containing a newly restored film and audio, but as of yet no Blu-ray.","Critical reception":"Although it received positive critical reviews, the film was a box office failure on both sides of the Atlantic, but it is now widely regarded as a classic.[9]Variety observed, \"Inasmuch as this is largely a photographed copy of the stage play . . . the camerawork is outstandingly good and helps to put across the credibility of the ghost story more effectively than the flesh and blood performance does. Acting honours go to Margaret Rutherford as Mme Arcati, a trance medium who makes you believe she's on the level. There is nothing ethereal about this 200-pounder. Her dynamic personality has all the slapdash of Fairbanks Sr in his prime.\"[11]Daniel Etherington of Channel 4 rated it 3½ stars out of five stars and commented, \"Like a quintessentially English, supernatural take on the contemporaneous American screwball comedy, Blithe Spirit is a joy, sharing with its US counterparts fast, witty dialogue that has its origins in stage performance. Although the theatricality arguably hampers the film . . . the verve of the performances, in tandem with the striking Technicolor cinematography Oscar-winning special effects, elevates it . . . Rutherford almost steals the show, playing the kind of charismatically eccentric grand dame that would define her career.\"[12]","cinematography":"Ronald Neame","production_company":"Two Cities Films","directed_by":"David Lean","release_dates":"14 May 1945 (UK)","Production":"Coward had turned down offers from Hollywood to sell the film rights, stating that previous American versions of his plays had been \"vulgarized, distorted and ruined\".[4] The rights were instead sold to Cineguild, one of the independent companies supported by the Rank Organization. The film was shot in Technicolor and marked Lean's first attempt at directing comedy after working on two straight films In Which We Serve and This Happy Breed, both also written by Noël Coward. The film was shot at Denham Studios in the spring of 1944.[5]The play had been a major success, and Coward advised Lean not to jeopardise this with the adaptation, telling him \"Just photograph it, dear boy\".[6] In spite of this, Lean made a number of changes such as adding exterior scenes, whereas the play had been set entirely in a single room, showing scenes like the car journey to Folkestone which had only been referred to in the play.[7] Perhaps most importantly, the final scene, in which Charles dies and joins his two wives as a spirit, does not occur in the play, which ends with his leaving his house after taunting his former wives, of whom he is now free. Coward objected strenuously to this change, charging Cineguild with having ruined the best play he ever wrote.[8]As with most of Coward's work, Blithe Spirit is renowned for its dialogue. During an argument with Ruth, Charles declares, \"If you're trying to compile an inventory of my sex life, I feel it only fair to warn you that you've omitted several episodes. I shall consult my diary and give you a complete list after lunch.\" The line, considered extremely risqué by censors, was deleted from the US release.[9]","Box office":"According to Kinematograph Weekly the film performed well at the British box office in 1945.[10]","produced_by":"Noël Coward","starring":"Rex Harrison Constance Cummings Kay Hammond Margaret Rutherford","running_time":"96 minutes","music_by":"Richard Addinsell","edited_by":"Jack Harris[1]"}