{"country":"France West Germany","Awards and nominations":"The film won the Golden Lion award at the 1987 Venice Film Festival. At the 1988 César Awards, it won in seven categories, including Best Director, Best Film and Best Writing. It was nominated for two Academy Awards: Best Foreign Language Film and Best Original Screenplay at the 60th Academy Awards.[8] It was also nominated for Best Foreign Language Film at the 1988 Golden Globe Awards.","distributed_by":"MK2 Diffusion (France)","Plot":"During the winter of 1943-44, Julien Quentin, a student at a Carmelite boarding school in occupied France, is returning to school from vacation. He acts tough to the students at the school, but he is actually a pampered mother's boy who still wets his bed. Saddened to be returning to the tedium of boarding school, Julien's classes seem uneventful until Père Jean, the headmaster, introduces three new pupils. One of them, Jean Bonnet, is the same age as Julien. Like the other students, Julien at first despises Bonnet, a socially awkward boy with a talent for arithmetic and playing the piano.One night, Julien wakes up and discovers that Bonnet is wearing a kippah and is praying in Hebrew. After digging through his new friend's locker, Julien learns the truth. His new friend's name is not Bonnet, but Jean Kippelstein. Père Jean, a compassionate, sacrificing priest of the old school, had agreed to grant a secret asylum to hunted Jews. After a game of treasure hunt, however, Julien and Jean bond and a close friendship develops between them.When Julien's mother visits on Parents' Day, Julien asks his mother if Bonnet, whose parents could not come, could accompany them to lunch at a gourmet restaurant. As they sit around the table, the talk turns to Julien's father, a factory owner. When Julien's brother asks if he is still for Marshal Pétain, Madame Quentin responds, \"No one is anymore.\" However, the Milice arrive and attempt to expel a Jewish diner. When Julien's brother calls them \"Collabos,\" the Milice commander is enraged and tells Madam Quentin, \"We serve France, madam. He insulted us.\" However, when a Wehrmacht officer coldly orders them to leave, the Milice officers grudgingly obey. Julien's mother comments that the Jewish diner appears to be a very distinguished gentleman. She insists that she has nothing against Jews, but would not object if the socialist politician Léon Blum were hanged.Shortly thereafter, Joseph, the school's assistant cook, is exposed for selling the school's food supplies on the black market. He implicates several students as accomplices, including Julien and his brother, François. Although Père Jean is visibly distressed by the injustice, he fires Joseph but does not expel the students for fear of offending their wealthy and influential parents.On a cold morning in January 1944, the Gestapo raid the school. As his classroom is being searched, Julien unintentionally gives away Bonnet by looking in his direction. As the other two Jewish boys are hunted down, Julien encounters the person who denounced them, Joseph the kitchen hand. Trying to justify his betrayal in the face of Julien's mute disbelief, Joseph tells him, \"Don't act so pious. There's a war on, kid.\" Disgusted, Julien runs off. Jean and Julien exchange books, a shared hobby of theirs, as they pack away their belongings due to the closure of the school.As the students are lined up in the school courtyard, a Gestapo officer denounces the illegal nature of Père Jean's actions. He further accuses all French people of being weak and undisciplined. Meanwhile, Père Jean and the three Jewish students are led away by the officers. Père Jean shouts: \"Au revoir, les enfants! À bientôt!\" to the children and they respond: \"Au revoir, mon père!\" As they leave the grounds, Jean glances over towards Julien briefly, and he waves in return.The film ends with an older Julien providing a voiceover epilogue:\"Bonnet, Negus and Dupre died at Auschwitz; Father Jean at Mauthausen. The school reopened its doors in October. More than 40 years have passed, but I'll remember every second of that January morning until the day I die.\"","language":"French German","Reception":"The film was extremely well received by critics and has a 96% positive rating at the critics-aggregate site Rotten Tomatoes.[2][3][4][5][6]The film was also a box office success having 3,488,460 admissions in France and grossing $4,542,825 in North America.[7]","box_office":"$4.5 million","Actual events":"The film is based on events in the childhood of the director, Louis Malle, who at age 11 was attending a Roman Catholic boarding school near Fontainebleau. One day, he witnessed a Gestapo raid in which three Jewish students and a Jewish teacher were rounded up and deported to Auschwitz. The school's headmaster, Père Jacques, was arrested for harboring them and sent to the concentration camp at Mauthausen. He died shortly after the camp was liberated by the U.S. Army, having refused to leave until the last French prisoner was repatriated. Forty years later Yad Vashem, Israel's official memorial to the victims of the Holocaust, granted Père Jacques the title of Righteous Among the Nations.","cinematography":"Renato Berta","au_revoir_les_enfants":"Film poster","directed_by":"Louis Malle","release_dates":"29 August 1987 (1987-08-29) (Venice)|7 October 1987 (1987-10-07) (France)||||","produced_by":"Louis Malle","starring":"Gaspard Manesse Raphael Fejtö Philippe Morier-Genoud Francine Racette","running_time":"104 minutes","music_by":"Schubert Saint-Saëns","edited_by":"Emmanuelle Castro","written_by":"Louis Malle"}