{"country":"France","distributed_by":"Gaumont","Plot":"Zorg (Jean-Hugues Anglade) is a 34-year-old failed writer, now making a living as a handyman for a community of beach houses at Gruissan. He meets Betty (Béatrice Dalle), a volatile and impulsive young woman, and the two begin a passionate affair, living in his shack on the beach. After a row with him, she finds the manuscript of a novel he once wrote and decides he is a genius. However, after another argument with his boss, she empties the shack and burns it down. The two decamp to the outskirts of Paris, where her friend Lisa (Consuelo de Haviland) has a small hotel. There they find work in the pizzeria of Lisa's friend Eddy (Gérard Darmon), but a fight erupts in which Betty stabs a customer with a fork. Back at the hotel, she laboriously types out Zorg's novel and submits it to various publishers. Though Zorg hides the rejection letters she finds one and, going to the publisher's house, slashes his face. Zorg induces him to drop charges.Eddy's mother dies and the friends go to the funeral in Marvejols. There, Eddy asks Zorg and Betty if they will live in the dead woman's house and look after her piano shop. Zorg enjoys the quiet provincial life and makes friends with the grocer Bob (Jacques Mathou) and his sex-starved wife Annie (Clémentine Célarié), but Betty is unhappy. One day Zorg finds a collection of pills she is taking and, during a row, she punches out a window. Happiness seems on the horizon when a home test suggests Betty is pregnant, but a lab test is negative and she sinks into depression.One day Zorg comes home to find blood all over the place and Betty gone. Bob tells him she has gouged out an eye and is in hospital. Rushing there, Zorg finds her under heavy sedation and a doctor tells him she will need prolonged treatment. Going home, he discovers an acceptance letter from a publisher. On his next visit to the hospital, he finds Betty restrained: he becomes agitated, and is thrown out. Returning in disguise, he whispers his farewells and, to save her further agony, smothers her with a pillow. Going home, he sits down to start his next book.","language":"French","box_office":"$29.2 million [1]","cinematography":"Jean-François Robin","directed_by":"Jean-Jacques Beineix","release_dates":"7 November 1986 (1986-11-07)|||||","betty_blue":"Simulation of the Italian-language film poster","produced_by":"Jean-Jacques Beineix","starring":"Jean-Hugues Anglade|Béatrice Dalle|Gérard Darmon|Consuelo de Haviland|Jacques Mathou|Clémentine Célarié|Vincent Lindon|","running_time":"120 minutes (185 minutes - Director's cut 2004)","music_by":"Gabriel Yared","edited_by":"Monique Prim","written_by":"Jean-Jacques Beineix Philippe Djian (novel)"}