{"country":"Canada","dracula:_pages_from_a_virgin's_diary":"Region 1 DVD cover","Plot":"In 1897, a visitor from the East, Count Dracula, arrives in London and is inadvertently invited into the home of Lucy Westenra. She is bitten by Dracula, and taken by his curse. Lucy's behavior becomes more erratic leading her to bite her fiancé. Lucy is immediately put under the care of Dr. Van Helsing. Van Helsing does blood tests on Lucy and declares \"Vampyre!\" as the source of the problem, and puts Lucy to bed adorned with garlic.That night, Renfield, a mental patient who lives in the asylum next to Lucy's home, escapes from confinement and Lucy's house is broken into by demons. Lucy's mother awakens in the commotion. Panicked by the demons, Lucy's mother opens the door and inadvertently re-invites Dracula into the house. Both Lucy and her mother are killed in this incident and a funeral procession takes place. The next day, Renfield is recaptured and placed back into the mental hospital. Bizarre incidents begin to occur around the city with newspapers headlines proclaiming a \"Bloofer Lady\" who has been murdering infants. Renfield is interrogated and confesses that Dracula has brought Lucy back from the dead committing these deeds and the solution to the problem lies in the graveyard.Van Helsing and Lucy's suitors go there and spy Dracula and the undead Lucy in a full romantic embrace. After Dracula leaves, Van Helsing declares, \"We must destroy the false Lucy so the real one may live forever\". When Van Helsing opens the Lucy's coffin, Lucy rises out and attacks the men. Lucy is eventually subdued by a piercing stab from Jonathan's long wooden stakes and a decapitation with a shovel by Van Helsing who then declares they must find and defeat the vampyre. Van Helsing and his men go to interrogate Renfield finding out that Dracula's next plan is to attack Lucy's best friend Mina.Mina, who is in a convent, aids her injured fiancé, Jonathon Harker. Harker had journeyed to Castle Dracula, where he had intended to finalize a land sale. Upon arriving, Harker was ravaged by three Brides of Dracula, who overpowered him. Harker eventually finalized the land deal for Dracula, and was imprisoned in the Castle. Harker escaped to the convent. In the convent, Mina finds Jonathon's diary and learns of his pleasures with the Brides of Dracula. With what she has discovered about Harker, Mina becomes progressively more sexually aggressive, which makes Harker nervous. He flees with the diary. Mina attempts to follow Harker but comes face to face with Dracula, who kidnaps her and takes her to Castle Dracula.In Castle Dracula, Dracula woos Mina, tempting her with offers of riches and eventually biting her on the neck, solidifying his curse. Harker, along with Van Helsing and his men, break into Dracula's castle and dispatch the Brides of Dracula with long wooden stakes. The men eventually stumble upon Mina and find the mark of Dracula's bite upon her. Attempting to root out Dracula, the men smash coffins and place Christian crosses in them. Dracula attacks the men.After the battle, Dracula and Mina are the only two left conscious. Mina scurries to a window with a cross and pulls it open to stun Dracula with the sunlight. The men regain consciousness, surround Dracula, and stab him with their stakes. The castle is demolished by Van Helsing's men and everyone departs. Dracula is left hanging motionless, impaled on a giant stake.","language":"Silent","Critical reception":"The film had a limited theatrical release, but received critical acclaim, holding a score of 84[7] based on 19 reviews at Metacritic, and an 87% approval rating based on 60 reviews at Rotten Tomatoes.[8] Variety noted that \"the camerawork shows the film's will to reinvent rather than blindly adopt silent film conventions\"[9] and Film Threat wrote that \"Maddin's exceptional achievement should inspire others to take risks and challenge their audiences – if only more would have the courage to let the Art rather than the balance sheet lead their work.\"[10]Roger Ebert gave the film 3½ stars out of 4, calling Maddin \"Canada's poet laureate of cinematic weirdness\" and noted that \"So many films are more or less alike that it's jolting to see a film that deals with a familiar story, but looks like no other.[11] Jonathan Rosenbaum took the film as the opportunity to praise Maddin's oeuvre in general, stating that \"Winnipeg filmmaker Guy Maddin's work testifies to the notion that the past knows more than the present and that silent cinema is a richer, dreamier, sexier, and more resonant medium than what we’re accustomed to seeing in the multiplexes ... he belongs in the tradition of such obsessional, poetic tale spinners and studio craftsmen as Erich von Stroheim, F.W. Murnau, Josef von Sternberg, Jacques Tourneur, and Michael Powell, who bend public materials towards private ends, taking us along for a feverish theme-park ride.\"[12]The film was also well-received as a Dracula adaptation. Matt Brunson wrote that \"Not since Francis Coppola's sharp take on Bram Stoker's Dracula has there been a vampire flick as deliriously off the wall as Guy Maddin's\"[13] and Horror.com's Staci Layne wrote that \"This is a fresh and surreally beautiful balletic interpretation of Bram Stoker's immortal novel, like nothing I've ever seen (and I've seen a lot of Dracula movies!).\"[14] Rosenbaum noted thateven though [Maddin claims] he was bored by the Stoker novel, he was intrigued by the elements involving male problems with sexuality — including jealousy, rivalry, and paranoia, especially in relation to race, nationality, and ethnicity. This is apparent at the outset of the film, when graphic images of blood spilling across Europe are accompanied by such intertitles as \"East Coast of England 1897,\" \"Immigrants!\" \"Others!\" \"From Other Lands,\" \"From the East!\" and \"From the Sea!\" Maddin makes this theme even more nuanced by having Dracula played by a Chinese-Canadian, Zhang Wei-qiang, who periodically evokes the late French-Italian New Wave actor Pierre Clementi. This reading of the novel may, as critic Mark Peranson has suggested, be more faithful than any other we've had to date.\"[15]","cinematography":"Paul Suderman","directed_by":"Guy Maddin","release_dates":"Canada: February 28, 2002 United States: May 14, 2003 United Kingdom: December 12, 2003","produced_by":"Vonnie Von Helmolt","starring":"Zhang Wei-Qiang Tara Birtwhistle David Moroni CindyMarie Small Johnny Wright Brent Neale","running_time":"75 minutes","music_by":"Original by: Gustav Mahler Arranged by: Russ Dyck Bruce Little","edited_by":"Deco Dawson","Release":"Originally a television feature, Dracula: Pages from a Virgin's Diary was released theatrically in 2003 due to outstanding critical reception.[4] Dracula: Pages from a Virgin's Diary was released on home video by Zeitgeist in 2004, with an audio commentary by Maddin.[5] The film is also included on the DVD boxed set The Quintessential Guy Maddin: 5 Films from the Heart of Winnipeg released by Zeitgeist Video, alongside Archangel, Careful, Twilight of the Ice Nymphs, and Cowards Bend the Knee.[6]","written_by":"Original novel: Bram Stoker Ballet: Mark Godden","budget":"CAD $1.7 million"}