{"based_on":"Chanel and Her World by Edmonde Charles-Roux","country":"France Belgium","distributed_by":"Warner Bros. Pictures (France) Sony Pictures Classics (United States)","Plot":"Several years after leaving the orphanage where her father abandoned her, a young Gabrielle Chanel finds herself working in a provincial bar. She is both a seamstress for the performers and a singer, earning the nickname 'Coco' from the song she sings nightly with her sister. A liaison with the charismatic Baron Balsan (Belgian actor Benoît Poelvoorde) gives her an entry into French high society, and a chance to develop her gift for designing increasingly popular hats.Coco falls in love with English businessman Arthur Capel (American Alessandro Nivola, who learnt French especially for the film), unaware that he is betrothed to a woman in England. Capel believes in Coco's talent making hats and her refusal to follow the whims of fashion; as he says to Coco, \"There's no one else like you\". As Coco's business flourishes and life is going well, Capel dies in a car accident; she is devastated. However, Coco still has the business that Capel helped her start as a reminder of their love.","coco_before_chanel":"French theatrical release poster","language":"French English","box_office":"$50,813,834[1]","cinematography":"Christophe Beaucarne","production_company":"Haut et Court Ciné@ France 2 Cinéma","directed_by":"Anne Fontaine","Response":"Roger Ebert praised the film for its unsentimental approach to Chanel's early years.[5] English critic Philip French found the film handsomely designed, tasteful, reserved, and rather dull.[6] One hundred twenty-six critics on website Rotten Tomatoes gave the film an average rating of 63%.[7] The film's average on Metacritic from reviewers was 65% as of 6 December 2012, with a 69% rating from general users of the website.","release_dates":"22 April 2009 (2009-04-22)|||||","produced_by":"Simon Arnal Caroline Benjo Philippe Carcassonne Carole Scotta","starring":"Audrey Tautou Benoît Poelvoorde Alessandro Nivola Marie Gillain Emmanuelle Devos","running_time":"105 minutes","music_by":"Alexandre Desplat","edited_by":"Luc Barnier","written_by":"Anne Fontaine Camille Fontaine","budget":"$19,430,000"}