{"based_on":"Edge of Darkness  by Troy Kennedy Martin","country":"United Kingdom|United States|","distributed_by":"Warner Bros. Pictures","Plot":"By moonlight, three bodies float to the surface of the Western Massachusetts stretch of the Connecticut River. At South Station, Boston, police homicide detective Thomas Craven (Mel Gibson) picks up his daughter, Emma (Bojana Novakovic), coming home to visit. She vomits while getting into the car. At home, as Craven prepares dinner, Emma's nose starts to bleed, she vomits again, and becomes frantic, saying that she needs to see a doctor and tell Craven something.On their home's porch, as they hurriedly leave to go to the hospital, a masked gunman below yells \"Craven!\" and then fires simultaneous shotgun blasts at Emma before escaping. She dies in her father's arms.After identifying the body at the medical examiner's office, he takes a sample of Emma's hair as a memento.Then, though everyone assumes Craven was the gunman's target, when he finds Emma had a .45 pistol in her night stand, he starts to suspect that possibly Emma was the intended target. At the police station, he checks the gun's ownership and finds that it belongs to her boyfriend David (Shawn Roberts).David is living in fear of a company called Northmoor, where Emma worked. She discovered that Northmoor, a research and development facility under contract to the U.S. government, was secretly manufacturing nuclear weapons using foreign material and foreign specifications. The weapons were intended to be traced to foreign nations if they were used as dirty bombs.Craven incidentally discovers Emma's hair sample is radioactive. (It is later shown that following the failed break-in at Northmoor by the activists seen dead at the opening, Emma was poisoned with thallium through a bottle of organic milk).Burning her clothing in his backyard, Craven encounters Jedburgh (Ray Winstone), a British \"consultant\" tasked with preventing the disclosure of Emma's information, dealing with Craven however he sees fit. Jedburgh takes a liking to Craven, leaving him to investigate. Craven repeatedly imagines he hears and sees his daughter, even having short conversations and interactions with her (typically as the happy young child he remembers and loves).Craven has several encounters with Northmoor agents. He eventually discovers through one of Emma's friends, an activist who is nearly killed by another of Northmoor's agents, that Jack Bennett (Danny Huston), head of Northmoor, ordered the murder of Craven's daughter, as well as the activists Emma was working with to steal evidence of the illegal nuclear weapons. Northmoor personnel kill a hitman marked as a fall guy after he is set up for killing Emma.Craven confronts lawyer and Massachusetts U.S. Senator Jim Pine (Damian Young), contacted earlier by Emma, revealing that Craven knows almost everything that happened. After examining his fridge with a Geiger counter Craven discovers that his milk has been contaminated, most likely with the poison used on his daughter. His fellow detective and friend, Bill (Jay O. Sanders), comes to Craven's home while the Northmoor agents break into the house. Craven realizes that Bill set him up. The agents taser and kidnap Craven. He wakes up handcuffed to a gurney in the Northmoor facility, but manages to escape.His health deteriorating rapidly from the poison, Craven goes to Bennett's house. He kills the Northmoor agents, first ordering one at gunpoint to scream the name \"Craven\", identifying him as Emma's killer. Craven is then shot by Bennett, but Craven also wounds Bennett with a shot, then manages to force some of the radioactive milk down Bennett's throat. A gagging Bennett frantically runs to his kitchen cabinet to get pills to counteract the radioactivity, but Craven drags himself to the kitchen and fatally shoots Bennett.Craven is hospitalized for the gunshot wounds and radiation poisoning. Jedburgh, suffering from an unrelated terminal illness, meets with the Senator and two political advisers who had hired him to handle Craven. They want to spin the Northmoor incident in a positive light. Jedburgh suggests an assassination attempt on the Senator could be an angle to drive Bennett's death out of the headlines. They are pleased with this idea until Jedburgh abruptly pulls out a gun and shoots both advisers and the senator dead.A young Massachusetts State Police officer nervously enters the Senator's home. Jedburgh points his gun at the officer, but asks if he has a family and kids. When the officer says yes, Jedburgh lowers his gun to face an honorable death. He is immediately shot dead by the officer.As Craven lies dying in the hospital, a young reporter for the local FOX TV station WFXT, who spoke to Craven a few nights earlier at his home, opens a letter from him with DVDs (recorded by Emma) revealing the conspiracy, with Craven's \"good luck\" wishes, ensuring Northmoor's end. As Craven dies, Emma, in spirit form, comforts him. The father and daughter are shown leaving the hospital together, walking down the corridor and toward a bright, white light.","language":"English","Reception":"The film received mixed reviews from critics, and holds a 56% approval rating on aggregate review site Rotten Tomatoes, based on 203 reviews[17] The site's consensus reads: For better and for worse, Edge of Darkness offers vintage Mel Gibson, working within the familiar framework of a bloody revenge thriller.[18] On review aggretator, Metacritic, which assigns a weighted average score out of 1–100 reviews from film critics, has a rating score of 55 based on 34 reviews.[19] Film critic Richard Roeper of Richard Roeper & the Movies gave the film a B stating \"Gibson excels in this entertaining conspiracy thriller\" in his review for the film.[20] Michael Rechtshaffen, a critic for The Hollywood Reporter, wrote in his review that \"An intense Mel Gibson performance anchors this brutally effective crime thriller\".[21] Some critics such as A.O. Scott of The New York Times have noted the movie's similarity to Taken.[22] However, some critics described Ray Winstone's character in the movie as \"intriguing\" such as Chicago Sun-Times film critic Roger Ebert,[23] Chicago Tribune film critic Michael Phillips,[24] and New Orleans Times-Picayune film critic Mike Scott.[25]On its first weekend, the film opened number two, grossing $17.1 million behind Avatar.[26] As of 8 April 2010, according to Box Office Mojo, the film grossed $43,313,890 in the United States and Canada and $37,670,000 in other countries for a worldwide total of $80,990,000.","edge_of_darkness":"The original theatrical poster.","box_office":"$101 million[2]","cinematography":"Phil Meheux","production_company":"GK Films BBC Films Icon Productions","directed_by":"Martin Campbell","Home media":"The film was released by Warner Home Video on 11 May 2010, on DVD and Blu-ray.[27][28]","release_dates":"28 January 2010 (2010-01-28) (Worldwide)|29 January 2010 (2010-01-29) (United Kingdom & United States)||||","Production":"In 2002, Martin Campbell announced that he was planning to adapt Edge of Darkness for the cinema.[11] Active development began in early 2007 when Campbell met with producer Graham King, who first enlisted Australian playwright Andrew Bovell to write, and then William Monahan (fresh from winning an Academy Award for King's The Departed) to re-write the screenplay.[12] Michael Wearing and BBC Films also co-produced the film.[4][7] Filming began on 18 August 2008 in Boston, Massachusetts.[5] A scene where Craven scatters his daughter's ashes at a beach was filmed at Rockport on 25 and 26 September.[13] They shot some scenes in Merrimac, Massachusetts from 15 September 2008 to 18 September 2008. Additional scenes were shot in Malden, Massachusetts in the old Malden hospital. Some of the final scenes were shot at a home in Manchester-by-the-Sea, Massachusetts. Additionally, Gibson and his crew set up shop for filming in western Massachusetts, with 180 staff staying in Northampton hotels. They shot in various locations in the Pioneer Valley, including Tully O'Reilly's Pub, the Northampton Athletic Club, and an older part of the Hampshire County Courthouse, all in Northampton. Also, Sugarloaf Mountain was shut down for a few days while they rented it out.[14] They also filmed at the Notch Visitor Center, Rt. 116, Amherst. The film takes place in America, unlike the television series, which was based in England. \"The idea was to transfer the story to a different time and place rather than just repeat what we did in England,\" Campbell said. \"Boston seemed like the perfect location because it does have a whole English, Irish signature on it.\"[15] Jack Bennett disembarks from a helicopter in one scene. The FAA registration number, N401LH, is visible on the fuselage. This helicopter later collided with a Piper PA-32 on 8 August 2009, over the Hudson River, resulting in nine deaths. The helicopter was owned by Liberty Helicopters, which offers sight-seeing tours around Manhattan.[16] The film was originally scored by classical composer John Corigliano. However, the decision was made during postproduction (after Corigliano's score had been recorded and dubbed) to replace his score with a new one by Howard Shore.","produced_by":"Graham King|Timothy Headington|Michael Wearing|","starring":"Mel Gibson|Ray Winstone|Danny Huston|Bojana Novakovic|","running_time":"117 minutes","music_by":"Howard Shore","edited_by":"Stuart Baird","written_by":"William Monahan|Andrew Bovell|","budget":"$80 million[1]"}