{"based_on":"Killing a Mouse on Sunday 1961 novel  by Emeric Pressburger","country":"United States","distributed_by":"Columbia Pictures","Plot":"The movie opens with shots from the Spanish Civil War, and a line of Spanish refugees crossing the border into France after defeat by the Francoists, Manuel Artiguez (Gregory Peck) turns away from the border and back towards Spain. His friends stop him, saying \"Manuel, the war is over!\".The story returns twenty years later, to a young boy named Paco (Carlo Angeletti), who asks a man named Pedro (Paolo Stoppa) why Artiguez has stopped his guerrilla raids against the Francoists in Spain. Pedro sends Paco into France to find his uncle and Artiguez. When Paco finds Artiguez, he tells him he wants him to kill Viñolas (Anthony Quinn), a Guardia Civil officer, for killing his father. Paco lets Artiguez know that his father was killed because he wouldn't tell the police where to find Artiguez.Meanwhile, Viñolas has learned that Artiguez's mother (Mildred Dunnock) is dying, and sets a trap at the hospital in San Martín to capture Artiguez, presuming that he will come to see his mother. In return for information about the layout of the hospital and surrounding area, Paco tells Artiguez to \"bump into Viñolas\" for him.After Viñolas has laid his trap, Artiguez's mother dies (after asking a priest to warn her son not to come), but Viñolas sends a spy to convince Artiguez otherwise, and to come visit her. When the priest appears at Artiguez's house, he's gone, so the priest tells Paco to pass on the message that his mother is dead, and not to go to San Martín.For selfish reasons, Paco rips up the letter and doesn't pass on the message. Afterwards, Paco recognizes the man (Carlos) in Artiguez's house as an informer, and tells Artiguez about the priest's message. Trying to clear up the mess, Artiguez takes Paco and Carlos to Lourdes to find the priest, but he's not there, and they let Carlos go. On the way back, however, they see the priest, and take him to Artiguez's house.When Carlos returns for his rucksack, Artiguez asks the priest to come out. Carlos, knowing he is exposed, fights Artiguez and escapes.After much internal debate, Artiguez then decides to go to San Martín anyway, presumably with the mission of killing Viñolas. Once in San Martín, Artiguez encounters a Francoist sniper on the roof of the hospital and attacks him, sending him to his death. Once inside the hospital, he kills a few officers, but is finally shot.Soldiers and officers congratulate Viñolas on at last killing his enemy, but he asks one of his lieutenants, knowing his mother was already dead and a trap would be waiting for him, why did Artiguez come back?The final shot is of the morgue, with the soldiers Artiguez killed and Artiguez himself (and his dead mother), wheeled in on gurneys and arranged in a row, dead.","language":"English","box_office":"est. $3,000,000 (US/ Canada)[1]","cinematography":"Jean Badal","directed_by":"Fred Zinnemann","behold_a_pale_horse":"Original theatrical poster","Reception and release history":"Despite promotional tours by Peck (in the U.S.) and Zinnemann (London and Paris),[7] the film did not have a large reception (the box-office receipts not being enough even to recoup the costs of production). According to Zinnemann, this was because the Spanish Civil War had slipped from the memories of its audience.[8] The New York Times gave it a mixed review,[9] being disappointed with the execution of the film, though impressed with its sets and actors, while Variety was generally impressed, calling it \"among the better\" of Peck's career.[7]The reaction to that was a disappointment, but it was justified. The point simply did not get over. I took too much for granted. I thought the Spanish Civil War was still with us, but apparently it is dead, in spite of all those refugees. There were other troubles too - with the Franco government. I was to blame for playing the Spanish Civil Guard as 'heavies.' They are sacred cows. Columbia suffered heavily through the Franco ban on their films because of 'Pale Horse' but they were wonderfully good about it.Incensed by scenes showing Viñolas with a mistress, and taking bribes,[7] the government of Francisco Franco denied filming as well as distribution in Spain, causing problems for its distributor, Columbia Pictures, who had all of their films refused distribution in Spain,[3] and were compelled to sell their distribution arm in Spain.[2] Columbia Pictures remained closed in Spain for several years, until agreeing to release several Spanish films outside of Spain.[10] Months prior to the release of the film, Columbia Vice President M. J. Frankovich estimated that the studio had lost \"millions\" in the year since they had decided to go ahead with production against the wishes of the Franco government.[11]According to Allmovie, the film was scheduled to be shown on national television in the United States, but was canceled at the request of the Spanish government.[12]Often compared to the previous year's Lawrence of Arabia, as it has two of the same lead actors, Zinnemann countered the comparison with “I don’t feel any obligation to be successful, success can be dangerous--you feel you know it all. I’ve learned a great deal from my failures.”[13]One of the film's stars, Omar Sharif, referred to it as a \"bad film\" by a \"good director\".[14]TIME said about the film in its review: \"Pale Horse is a white elephant.\"[15]Behold a Pale Horse was first released on video in VHS form by Columbia Pictures as part of their \"Columbia Classics\" series on August 6, 1996. It was then released on DVD on February 22, 2005. The DVD release features subtitles in English, Korean, and Spanish, and widescreen (enhanced) viewing option at 1:85, or the anamorphic 16:9 option. The DVD has since been released in France as \"Et vint le jour de la vengeance\", Spain as \"Y llegó el dia de la venganza\", Italy as \"...E venne il giorno della vendetta\", Germany as \"Deine Zeit ist um\", and Greece as \"Η μερα της εκδικησης\".[citation needed]","release_dates":"1964 (1964)|||||","Production":"Behold a Pale Horse was co-produced by Columbia Pictures, along with Zinnemann (Highland Productions) and Peck (Brentwood Productions). With a budget of $3.9 million, the production hit a snag when the Franco government refused permission to film in Spain.[citation needed] The production resorted to filming exterior shots across the border in France: Biarritz on la Côte Basque, and locations in Béarn such as Pau, Oloron, Gotein-Libarrenx, La Brèche de Roland, and the basilica at Lourdes, as well as Studio St. Maurice in Vincennes.Originally, Anthony Quinn had requested the role of Artiguez, but Zinnemann felt it would be type-casting him, and gave him the opposing role of the villain Viñolas.[2] As well, several Spanish refugees were used to play the parts of Franco's Guardia Civil officers.[2] The American leftist political activist Allard K. Lowenstein played a part in making contact between the filmmakers and anti-Franco Spanish exiles in France.[3] Zinnemann felt it would be good for Peck to be able to meet actual political refugees living in France.[2]Filming began on June 13, 1963, and continued for a little over 100 days, running nearly a month over schedule. After Columbia previewed the film for US audiences, they decided that an intro was needed to provide background relating to the Spanish Civil War, so clips from the documentary about the war To Die in Madrid were interspersed with dialogue explaining the conflict.[4]The score for Behold a Pale Horse was composed and conducted by Maurice Jarre. The instrumentation consists mainly of Spanish-style guitar, woodwind instruments, harpsichord, and the harp.[5]The score was originally released by Colpix Records as an LP (Colpix Records SCP 519) in the United States, and a two track EP in France. In April 2007 Film Score Monthly re-released the score on a CD (including the two unique tracks from the EP) accompanied by the score to Damn the Defiant (catalog number FSM1004).[6]The main theme from the score also featured on the CD Maurice Jarre at Abbey Road released in 1992 by Milan Records, with Jarre conducting the Royal Philharmonic Orchestra.","produced_by":"Fred Zinnemann Gregory Peck","starring":"Gregory Peck Anthony Quinn Omar Sharif","running_time":"118 min.","music_by":"Maurice Jarre","edited_by":"Walter Thompson","written_by":"JP Miller Emeric Pressburger (novel)","budget":"$3.9 million"}