{"badlapur":"Theatrical release poster","country":"India","distributed_by":"Eros International","screenplay_by":"Sriram Raghavan Arijit Biswas Pooja Ladha Surti","story_by":"Massimo Carlotto","Plot":"Misha (Yami Gautam) and her son Robin become the victims of a bank robbery getaway during a shopping trip. Liak (Nawazuddin Siddiqui) and his friend Harman (Vinay Pathak) are on the run after robbing a bank and use Misha's car to flee. Robin falls out of the moving vehicle during the struggle, while Misha is shot by Liak. Both mother and son later died from their injuries in the hospital. Harman jumps out of the car to protect the money while Liak is arrested.Raghu (Varun Dhawan), shattered from the loss of both his wife and his son, immerses himself in seeking revenge on both culprits. Liak is sentenced to 20 years in prison, but refuses to reveal the identity of his partner in crime. Raghu tries his best to get the name of this partner, who he believes killed his wife and child, but fails. He hires a detective and learns about Jhimli (Huma Qureshi), a prostitiute who is Liak's girlfriend, and visits her to inquire about the missing partner. After Liak's sentence, Raghu exiles himself to a reclusive life at a chance station where he gets down from a train and unsuccessfully attempts to commit suicide – Badlapur.15 years later, a cancer-ridden and terminally ill Liak is paroled from prison on compassionate grounds. Unknown to Liak, Raghu has facilitated the release by providing a letter of pardon for Liak to the court, in exchange for being told the elusive partner's name by Liak's mother. Bent on vengeance, Raghu starts for Pune and finds Harman, who now runs a well-established restaurant in Pune and is a respected member of society.After his parole, Liak is kept under watch by police as they believe he will lead them to the unknown partner. Liak nevertheless manages to contact Harman, and arranges to meet him and take his share of the money. However, Raghu has already met and interrogated Harman along with Harman's wife Kanchan (Radhika Apte). Harman pleads with Raghu not to reveal his name to the cops. He tells Raghu that while he was involved in the robbery, it was Liak and not him who shot and killed his son and wife. Raghu, however, does not seem convinced. Harman promises to give Raghu Liak's share of the money. Raghu takes the money but kills both Harman and his wife brutally, with a hammer. Raghu meets Shobha (Divya Dutta), the NGO worker who was instrumental in arranging Liak's parole, to create an alibi. He pretends to be in love with Shobha and dupes her in believing the same . Later he returns and buries the bodies of Harman and Kanchan on a lonely hilltop.Police now turn suspicious and start investigating Harman, who seems to have disappeared with his wife.A despondent Liak learns from his mother that Raghu came to know Harman's name from her. Liak breaks into Raghu's house in search of the money and gets into a rough fight with Raghu. But Raghu soon overpowers Liak and beats him senseless. When Liak regains consciousness, Raghu tells him in detail how he killed Harman and his wife and disposed of their bodies and also tell him that Herman's wife was also ready to sleep with him. Liak tells Raghu that it was him, and not Harman, who killed Raghu's wife and child, but he did it in a moment of panic, unlike Raghu who, Liak points out, planned his murders with a cool mind and without any certain knowledge of guilt. Liak tells Raghu that there is no difference between them, and that Raghu has become mad and should go for treatment.Liak meets his former girlfriend Jhimli for one last time. Jhimli, who is now a keep of a local businessman, breaks down knowing that Liak is now near death.The police inspector investigating the case now has circumstantial evidence that Raghu murdered Harman and his wife. He meets Raghu and offers a deal, the money which Raghu got from Harman for removing the evidence.Liak returns home in a distraught state knowing he has caused misery and possibly his friend's death too. He finds that his mother does not have a single good word to tell about his father and realizes that soon he will also be spoken of in the same manner by people – a complete no-gooder without a single good deed to speak of.Raghu refuses the policeman and prepares for a final showdown. Liak walks into the police station and confesses to killing Harman and his wife and also reveals where to find the dead bodies. Liak takes Raghu's blame, giving Raghu a second chance to live his life, and also doing one good thing in his own life before dying.After seven months, Liak succumbs to cancer in jail. Raghu finally did away with the Liak's share by dumping it in a drum and sending it away. Jhimli meets Raghu and tells him that he has a second chance thanks to Liak, that very few get such chances – Liak never did – and that he should not waste it. She also asks Raghu that, now that his revenge is complete and all the guilty are dead, what good it did for him. Raghu is silent as Jhimli drives away with Patil, leaving him standing in the rain.","language":"Hindi","Critical reception":"Raja Sen from Rediff.com rated it 4 out of 5 and said \"Badlapur is a dark, unflinching, fantastic film.\"[7] Sudhish Kamath from The Hindu wrote that the film was \"darkly ambitious and very well made.\"[8] Rachit Gupta from Filmfare stated that it had \"exhilarating performances, stellar storytelling.\"[9]Saibal Chatterjee of NDTV noted the pervasive contemptful treatment of women in the film, writing, \"If one can ignore the overt misogyny on show all through the film, Badlapur throws up enough surprises to hold the viewer's interest right until the bitter end.\"[10]Mohar Basu of The Times of India rated Badlapur 4 out of 5.[11] Shubhra Gupta of The Indian Express rated the movie 2.5 stars out of 5, describing it as riveting, but also noting that the film \"comes off too contrived in many places, and leaves us hanging in others.\"[12] Rajeev Masand of CNN-IBN rated it 3.5 out of 5 and wrote: \"The pace slackens post-intermission, plot contrivances are many, and you might say the film is misogynistic in its treatment of women ... [However], the film keeps you on your toes, curious to see where its twists and turns will lead.\"[13]In December 2015, Badlapur got 15 nominations for Stardust Awards, having the maximum number of award nominations from one film for the year. Both Varun Dhawan and Nawazuddin Siddiqui were nominated for Best Actor Category. The Film was nominated for awards in Story (2), Screenplay (2), Direction, Lyrics (2), Best Playback Singer (Male), Best Choreographer, Music Direction (2), Best Actor (2), Best Supporting Actor (Female)(2).[14]","box_office":"est. ₹77 crore (US$11 million)[2]","cinematography":"Anil Mehta","production_company":"Maddock Films","directed_by":"Sriram Raghavan","Soundtrack":"The soundtrack is composed entirely by Sachin-Jigar, while the lyrics were written by Dinesh Vijan and Priya Saraiya. The first song, \"Jee Karda\", was released as a single on 9 December 2014. The song \"Jeena Jeena\" was released on 14 February 2015. Jeena Jeena reached number one on the Indian iTunes charts,[20] Radio Mirchi charts,[21] and Bollywood Planet charts[22] for several weeks.","release_dates":"20 February 2015 (2015-02-20)|||||","Production":"The film began shooting in May 2014.[4][5][6]","Box office":"According to Koimoi, the film collected ₹32 crore (US$4.8 million) in five days at the domestic box-office, with ₹7 crore (US$1.0 million) on the first day.[15][16] By the end of the third weekend, Badlapur grossed ₹48.3 crore (US$7.2 million).[17] By the end of its third week run, the movie grossed ₹50 crore (US$7.4 million) nett at India box offices,[18] leading Koimoi to estimate the film has taken in double its expenses.[19] Box Office India reported that Badlapur grossed approximately ₹77 crore (US$11 million) worldwide.[2]","produced_by":"Dinesh Vijan Sunil Lulla","starring":"Varun Dhawan|Nawazuddin Siddiqui|Huma Qureshi|Yami Gautam|Divya Dutta|","running_time":"145 minutes","music_by":"Sachin-Jigar","edited_by":"Pooja Ladha Surti","budget":"₹25 crore (US$3.7 million)[1]"}