{"country":"United Kingdom","distributed_by":"The Weinstein Company","Plot":"Andrew Garfield portrays Eric Wilson, Boy A. The film commences when Eric is released from either a secure unit or prison under the name Jack Burridge. His past is told through flashbacks.Eric Wilson befriends Philip Craig, who is a troublemaker and rescues him from a group of bullies. It is later disclosed that Philip is the victim of rape perpetrated by his older brother. Philip gets into an argument with a girl from their school who comes across the two boys loitering in a park. She criticizes them and refers to them as \"scum\" when she witnesses Philip vandalising a park sign with a Stanley knife. Philip approaches her and starts slashing at her forearms with the knife. He grabs the girl and drags her under a bridge. When Philip drops the knife, Eric picks it up, and follows them under the bridge. The girl is killed, although the film shows neither who kills her nor how.Eric (dubbed as Boy A during the trial) and Philip are remanded into custody at secure units. Philip ends up dead, assumed to be suicide, but Eric believes that he may have been killed by youth offenders. Eric is later released and is guided by rehabilitation worker Terry (Peter Mullan). Eric, shy and eager to be a good citizen again, builds up a new life under the name Jack Burridge. He finds a job, befriends his colleague Chris (Shaun Evans), falls in love with the office girl, Michelle (Katie Lyons), and rescues a little girl who would otherwise have died after a car crash. An article in a local newspaper portrays him as a hero and includes a picture of both boys in the story. Eric wants to be honest with Michelle and reveal his past, but Terry urges him not to do so because it is too dangerous. Terry is afraid that people may attack Eric because there is a reward of £20,000 for finding him. Terry argues that it is not dishonest because \"Eric is history and Jack is a new person\".The rehabilitation worker is less satisfied with his own son. The son discovers Eric's true identity from newspaper articles about him being released, his new role as the hero and information he looks up without permission on his father's computer. Out of jealousy, he reveals this to the public and as a result, Eric loses his job and his best friend Chris distances himself from him. Michelle goes missing, and people suspect that Eric is somehow involved, though it is later revealed she has sequestered herself at home, devastated about the revelation that Jack is actually Eric.Eric repeatedly tries to phone Terry but gets his voicemail. He flees from his home to avoid reporters and travels to Blackpool. There he meets Michelle, who tells him she was not the one who revealed his past and would have eventually understood if he told her the truth, and then leaves. After saying farewell messages in voicemails to Terry and Chris, the film concludes with Eric standing over the edge of a pier.","language":"English","Reception":"Boy A received a limited release in North America in 10 theaters and earned £72,490. It also earned £693,086 internationally for a total of £765,577.[5]Boy A received highly positive reviews from critics and has a \"certified fresh\" score of 88% on Rotten Tomatoes based on 59 reviews with an average rating of 7.4 out of 10. The critical consensus states, \"Small in scale but large in impact, Boy A's career making performances (particularly that by star Andrew Garfield) and carefully crafted characters defy judgement and aggressively provoke debate.\"[6] The film also has a score of 75 out of 100 on Metacritic based on 22 critics indicating 'Generally favorable reviews.'[7]","box_office":"£765,577[2]","cinematography":"Rob Hardy","production_company":"ABC Distribution Channel Four Film4 Cuba Pictures","directed_by":"John Crowley","boy_a":"Theatrical release poster","release_dates":"26 November 2007 (2007-11-26)","produced_by":"Lynn Horsford","starring":"Andrew Garfield Alfie Owen Katie Lyons Peter Mullan","running_time":"106 minutes[1]","music_by":"Paddy Cunneen","edited_by":"Lucia Zucchetti","written_by":"Mark O'Rowe Jonathan Trigell (novel)"}