{"country":"United States","distributed_by":"Warner Bros.","screenplay_by":"David Atkins Emir Kusturica","story_by":"Emir Kusturica","Plot":"Axel (Johnny Depp) has a dream about an Eskimo who catches a rare halibut and brings it back to his family in an igloo. Axel's cousin Paul (Vincent Gallo) coaxes Axel from his job tagging fish in New York City to Arizona to attend his uncle Leo's (Jerry Lewis) trophy wedding to a much younger woman (Paulina Porizkova). His uncle tries to persuade him to stay permanently and take over the family business of selling Cadillacs. Axel resists at first, but he decides to give it a try.Axel encounters two strange women: Elaine (Faye Dunaway), a woman who always had a dream of building a flying machine, and her stepdaughter Grace (Lili Taylor), who is jealous of Elaine and dreams of killing herself and being reincarnated as a turtle. Axel starts lusting after Elaine and decides to help make her dreams come true. As he and Elaine build the machine day by day, Grace starts destroying the contraption. Axel then rebuilds. Leo and Paul arrive at Elaine and Grace's house to encourage Axel to come back, but Elaine threatens them with a shotgun. Axel and Elaine complete the machine and test it, but it crashes in a tree.Axel then decides to put both Elaine and Grace out of their misery, but can not go through with it. Grace has the idea to play Russian Roulette with him. Axel is scared at first, but at his second turn he pulls the trigger multiple times. The gun does not fire. Axel, Elaine, and Grace come to Paul's talent show. He decides to play Cary Grant's role from North by Northwest with the famous crop duster scene. Paul receives the score of 1. Leo's fiancee then approaches them to say that there is something wrong with Leo. Axel realizes that Leo is dying and calls an ambulance but Leo passes away.The day before Elaine's birthday a few months later, Axel and Paul finally come back to Elaine and Grace's house. Elaine is mad at Axel for not contacting her but forgives him. The next day on Elaine's birthday, Elaine is given an airplane as a present. The four celebrate Elaine's birthday by beating a piñata, but are interrupted by a storm. As the others dry off inside, Grace remains outside to free her turtles, telling them to \"Go play,\" Axel goes upstairs with Grace to wrap the presents where she gives Axel a globe, telling him that she wants him to have the world. Axel tells Grace that Elaine has changed and that he is not in love with her any more. He makes a promise to Grace to go to Alaska.Axel, Elaine, Grace, and Paul talk about the manners in which they want to die. Grace says that she is going to sleep and walks upstairs, dressing herself in a white shift and a hat with a veil. As she walks outside, Axel and Elaine see her through the window and run outside in an attempt to stop her. Grace shoots herself, and a lightning bolt destroys Elaine's airplane. Sometime after Grace's death Axel breaks into Uncle Leo's abandoned Cadillac store at night and goes to sleep on top of a Cadillac with a cat that has just had her litter. The film ends with Axel and Uncle Leo as Eskimos in Axel's dream. They catch the halibut and discuss it. It flies from their hands into the sunrise.","language":"English","box_office":"$112,547 (USA)[1]","arizona_dream":"DVD cover for Arizona Dream","cinematography":"Vilko Filač","production_company":"Canal Plus","directed_by":"Emir Kusturica","Home media":"Warner Archives released the film on made to order DVD in the United States on March 16, 2010.[7] Studio Canal has released the film in Europe on DVD,[8] HD DVD and Bluray.","Awards and honors":"The film won the Silver Bear - Special Jury Prize at the 43rd Berlin International Film Festival.[6]","Alternate versions":"Although shown theatrically in the U.S. at its full length, the TV prints and home release versions run 119 minutes.","release_dates":"January 6, 1993 (1993-01-06) (France)|September 9, 1994 (1994-09-09) (US)||||","Production":"Many of the Arizona scenes were filmed in Douglas, Arizona and Patagonia, ArizonaMusic video for the 1991 Tom Petty song, \"Into the Great Wide Open\", was shot during the filming of the movie.","Reception and Box office":"Arizona Dream received a generally positive response from critics, garnering an 86% rating on Rotten Tomatoes based on 14 reviews with an average score of 6.9/10.[2]Janet Maslin of The New York Times liked the film, praising it as \"enjoyably adrift, a wildly off-the-wall reverie\" and opining that its best feature is \"its lunacy, which is so liberating\".[3]Referring to Arizona Dream as \"the quintessential Nuart movie\", Los Angeles Times' Kevin Thomas sees it as \"a dazzling, daring slice of cockamamie tragicomic Americana envisioned with magic realism by a major, distinctive European filmmaker\".[4]In his affirmative review Chicago Sun-Times' Roger Ebert called Arizona Dream \"goofier than hell\" while adding that \"you can't stop watching it because nobody in the audience, and possibly nobody on the screen, has any idea what's going to happen next\" and referring to Kusturica as \"a filmmaker who has his own peculiar vision of the world that does not correspond to the weary write-by-numbers formulas of standard screenplays\".[5]Although filmed in 1991 and released throughout Europe in 1993, Arizona Dream was not theatrically released in the U.S. until September 9, 1994. Its total U.S. gross, in three theaters, was $112,547 in limited release.[1]","produced_by":"Claudie Ossard Yves Marmion","starring":"Johnny Depp Jerry Lewis Faye Dunaway Vincent Gallo Lili Taylor","running_time":"142 minutes","music_by":"Goran Bregović Iggy Pop","edited_by":"Andrija Zafranović"}