{"country":"United States Egypt Italy","distributed_by":"Harmony Gold USA Goldfrab Distribution","Plot":"A photographer and a group of American models travel to Egypt for a fashion shoot. While shooting in an ancient tomb, their hot lights accidentally revive a mummy and his followers, a band of flesh-eating zombies.","language":"English","Reception":"The film has received mixed to negative reviews from critics.John Stanley awarded the film 2 / 4 stars stating, \"Hashish smokers in a Cairo square are as exciting as it gets in this tale\".[5] Popcorn Pictures.com gave the film 6/10 stating, \"It is an arduous struggle to get past the first half of Dawn of the Mummy but stick with it and you’ll be rewarded with one of the more entertaining zombie flicks of its period: a guilty pleasure of trashy exploitation at its finest. If the entire film had been as enjoyable as the last half, you’d be looking at a bonafide classic right here\".[6]It was awarded a score of 0 / 4 by VideoHound's Golden Movie Retriever which panned the film's plot and acting.[7]","Remake":"Anthony Hickox wrote 2012 the script of the remake Prisoners of the Sun, which directed by Roger Christian and stars Joss Ackland, Carmen Chaplin, Nick Moran and John Rhys-Davies.[8] The film will release in April 2015 in the United Kingdom on DVD and Blu-ray.[9]","cinematography":"Larry Revene Sergio Rubini","dawn_of_the_mummy":"Original poster","directed_by":"Frank Agrama","release_dates":"December 11, 1981","Production":"Dawn of the Mummy was filmed in Egypt[1] with a mostly Italian crew leading many to mistake it as an Italian film.[2]Unlike traditional interpretations of mummies in cinema, the film's portrayal of the undead is quite unique. In the film the mummies are portrayed as ravenous flesh eaters, similar to the popular portrayal of zombies in which both share many similarities.[3]Due to the film's surprisingly graphic content the film was subject to several cuts in the UK in order to trim down the film's more graphic scenes, approximately 1 minute and 43 seconds were cut from the film from 12 different scenes in the film. Some scenes included The Mummy ramming a machete into the character Tarak's head, a man being gutted by the mummy, and scenes where the mummy's undead servants feast on several characters.[4]","produced_by":"Frank Agrama","starring":"Brenda King Barry Sattels George Peck John Salvo Ibrahim Khan Joan Levy Ellen Faison Dianne Beatty","running_time":"93 minutes","music_by":"Shuki Levy","edited_by":"Jonathon Braun","Release":"Dawn of the Mummy has been released on VHS and DVD format. The film was released on region 1 by Madacy Entertainment, as a VHS transfer. The packaging is said to list the film's Theatrical Trailer and other Theatrical Trailers, although there is only one on the disc, it is not for the main feature, it is of a 1997 film, Road Ends. It does however feature an audio commentary track by director Frank Agrama. Brian Lindsey\"Dawn of the Mummy review\". eccrentic-cinema.com. Retrieved 10 November 2010. The film was released uncut in the UK by Anchor Bay Entertainment. It features an anamorphic widescreen 1.77:1 transfer, plus the 4:3 full screen transfer, DTS Digital Surround, Dolby Digital 2.0 & 5.1 Surround. The extras include Director's Audio Commentary, Stills Gallery, Production Notes and Trailer.\"Dawn of the Mummy DVD\". hkflix.com. Retrieved 10 November 2010. ","written_by":"Frank Agrama Ronald Dobrin Daria Price","budget":"$500,000"}