{"country":"Ireland|United Kingdom[3]|","distributed_by":"Fox Searchlight Pictures Momentum Pictures","Plot":"In a confessional, an unseen parishioner talks to Father James about his horrific childhood sexual abuse by a priest. He says he will kill James at the beach the next Sunday, because James is a good man and it would be worse and more disconcerting for the Catholic Church than killing a bad priest; in any case, the offender has already died. He gives James a week in order to settle all of his affairs at the parish. James later tells Bishop Garret Montgomery what happened and that he knows the parishoner. Bishop Montgomery comments that there was no confession since there was no formal prayer and the man was not repentant. He leaves it up to James whether or not he should go to the police.James' daughter Fiona comes to visit from London after a failed suicide attempt. She had felt abandoned by her mother and James ever since he became a priest when her mother died. Fiona and James know they love each other, and try to repair their relationship.James hears that local butcher Jack Brennan has hit his wife Veronica, who's having an affair, and James confronts Jack. Jack denies having hit her, and blames Veronica's Ivorian lover, Simon. James then visits several people, including an elderly American writer and Inspector Stanton, whose houseguest is apparently a male prostitute named Leo who makes lewd advances on James before leaving. James obtains a gun from the Inspector at the request of the writer, who had explained he would rather take his own life than get old and feeble.James is also visited at the church by a socially awkward young man, Milo, who is trying to decide between committing suicide or joining the army, as he feels a lot of rage and anger that he hasn't yet had sex. Milo and James discuss whether killing, and learning to kill, are immoral, as James attempts to talk Milo out of both joining the army and committing suicide.A lonely and unpleasant millionaire, Michael Fitzgerald, asks James to visit him in his large house outside of town. He tells James that most of his money is illegal and he wants to donate some of it to the church; however, James does not believe that Fitzgerald actually feels guilt. Before James leaves, Michael drunkenly urinates on the painting The Ambassadors, to show his contempt for his wealth, and since he made pursuit of wealth his life's purpose, his contempt for himself.James is then called to the hospital where he is asked to perform the last rites for a Frenchman who was critically wounded in a car accident. After performing the rites, James comforts Teresa, the wife of the dead man who accepts her husband's death and says that death is unfair to people who haven't felt love. The two then pray together. On his way out, James is teased by the atheist doctor Frank Harte, who has an extremely blase view towards death.James also visits a convict, Freddie Joyce, who, it is suggested, killed several women and ate them; James tries to persuade him to tell him the location of an (uneaten) body buried in the woods but Freddie cannot remember. Although he asks for forgiveness, James accuses him of not truly feeling guilt and that God can't understand him.Later at the pub, James sees Veronica and Harte doing cocaine but doesn't admonish them. While in the pub, the townsfolk see the local church burning down. However, when they go outside many of them do not seem especially concerned or even told James of the fire before they noticed. Later, Michael donates money to assuage his conscience.While walking with his daughter, James tells her he loves her and promises to never abandon her. Later that night, James finds that his dog has had his throat cut. Crying over this loss, he buries his dog in the back garden. The next day, his daughter leaves. While walking in the countryside afterwards, James strikes up conversation with a young girl. However, when her father sees them he orders his daughter to get in the car and yells at James, believing him to be a paedophile.At the pub, James talks to Frank Harte, the atheist doctor, who relates how a 3-year-old child was made permanently deaf, mute, paralyzed and blind after botched anesthesia; Harte seems to take pleasure in the pain of the situation. James is offended and angered by Harte's story and almost attacks him. When Harte has left James has several more drinks. When he refuses to leave at closing time and is pressured by Brendan Lynch, the barman, James pulls out the gun he got for the writer. Brendan does not believe he will kill him, so James shoots several times at the bar and then, when out of ammunition, aims at Brendan. In response, Brendan pulls out and wields a baseball bat.A battered James returns home where he lashes out at Father Leary, calling him naive. Father Leary is so offended he decides to leave the next morning. James decides to leave as well, packs a suitcase, and goes to the airport. While there he meets Teresa and they talk. Seeing her husband's coffin by the aircraft on the tarmac convinces James to return home.On Sunday, James heads to the beach. On the way he meets his writer friend, who has just finished his book; James tells him he is a very good writer. He then calls Fiona, telling her that people look too much at sins and not enough on virtues. He believes that forgiveness is the most important virtue, which he sees as constantly underrated. Fiona agrees and they make their peace with each other.At the beach, James throws away the gun, waits, and briefly talks to Michael, who admits to feeling detached from life. A surprised James comforts him and promises to come and visit him later. Michael leaves and James waits on the beach, whereupon Jack appears with a gun approaching James.Jack confesses to burning down the church, and to hitting Veronica; however, he denies having killed James's dog. Jack asks if James cried for the dog, and James says he did, and Jack then asks whether James cried for the children whom priests abused. When James admits he didn't, that he felt simply detached from the whole matter, an angry Jack shoots James in the stomach. The altar boy who is painting a scene of the beach runs toward them; Jack points his gun at the boy, and James shouts out to the boy to run away. James tells Jack it is not too late to stop, but Jack says it is. When Jack tells him to say his prayers, James replies that he already had. Jack then shoots James point blank in the head, and walks away. The parishoners are then seen going about their daily lives: the writer is seen by the river eating an ice cream bar, Veronica and Simon in bed together, Inspector Stanton examining bank notes, Michael drinking and contemplating, Dr. Harte puting out his cigarette on a human organ, a pensive Leo sitting on one side of the bed after his latest tryst, the bruised Brendan drinking, Father Leary reading The God Delusion by Richard Dawkins, and Milo signing up to join the army. Teresa is then seen on a plane, making the sign of the cross.Later, Fiona visits Jack in prison. As Fiona and Jack, separated by a glass panel, pick up their intercom phones, the film ends.","language":"English","Reception":"Calvary had its world premiere at the 2014 Sundance Film Festival.[6] Fox Searchlight secured distribution rights for the US and select international territories.[14] Calvary made its European premiere at the 64th Berlin International Film Festival[7] and its Irish premiere as the gala opening of the Jameson Dublin International Film Festival on February 13, 2014.[15] The film earned $16.9 million worldwide.[4]Calvary received positive reviews from critics and has a \"certified fresh\" score of 89% on Rotten tomatoes based on 144 reviews with an average rating of 7.6 out of 10. The critical consensus states \"Led by a brilliant performance from Brendan Gleeson, Calvary tackles weighty issues with humour, intelligence, and sensitivity.\"[16] On Metacritic, the film has a score of 77 out of 100, based on 42 critics, indicating \"generally favourable reviews\".[17]Justin Chang of Variety magazine praised Gleeson for his soulful performance, called the film a \"masterful follow-up to The Guard\", and predicted near-certain critical plaudits into a distinguished arthouse reception for the film.[18] Tim Griersen of Screen International also praised Gleeson for his performance and the film, calling it \"A rich character drama that's equally eloquent and despairing,Calvary carries a weary resignation that feels lived-in and deeply considered.\" He cautions that the film might prove to be a hard sell as it examines religious faith and does not fit in an easily marketable genre.[1] Xan Brooks of the Guardian comments on the self-referential nature of the film, and also calls the film \"terrific (at least until the denouement, when it rather strains for grandeur)\". Brooks gives the film 4/5.[19]Praising Calvary for its treatment of its weighty thematic elements, Lauren Ely for First Things wrote: \"Is it possible for a film to capture the horror of the sexual abuse scandal in the Catholic Church while at the same time presenting a case for the necessity of the institutional priesthood? Against all odds, this is exactly what Irish director John Michael McDonagh's Calvary manages to do.\"[20]In his review, cultural commentator Fr. Robert Barron writes that the film \"shows, with extraordinary vividness, what authentic spiritual shepherding looks like and how it feels for a priest to have a shepherd's heart.\"[21]","box_office":"$16.9 million[4]","cinematography":"Larry Smith","directed_by":"John Michael McDonagh","production_companies":"Reprisal Films Octagon Films Bord Scannan na hEireann/Irish Film Board BFI Lipsync Productions","release_dates":"19 January 2014 (2014-01-19) (Sundance)|11 April 2014 (2014-04-11)||||","Production":"McDonagh conceived the idea for Calvary and wrote the screenplay while filming The Guard with Gleeson in late 2009. McDonagh explained the intentions he had for the film: \"There are probably films in development about priests which involve abuse. My remit is to do the opposite of what other people do, and I wanted to make a film about a good priest.\" He elaborates that it is tonally \"in the same darkly comedic vein as The Guard, but with a much more serious and dramatic narrative.\"[13] Gleeson's casting was announced in October 2011.[13] The casting of Chris O'Dowd, Kelly Reilly and Aidan Gillen was announced in February 2012,[9] while further casting was announced in August 2012.[11]Filming began on 24 September 2012.[10] The production spent three weeks shooting in and around County Sligo primarily in the town of Easkey where the film is set and also on the Streedagh beach in north county Sligo, with some shooting in Ardgillan Castle Balbriggan Dublin followed by two weeks of filming in Rush, Dublin.[11]","calvary":"Movie poster","produced_by":"Chris Clark|Flora Fernandez-Marengo|James Flynn|","starring":"Brendan Gleeson|Chris O'Dowd|Kelly Reilly|Aidan Gillen|Dylan Moran|Isaach de Bankolé|M. Emmet Walsh|Marie-Josée Croze|Domhnall Gleeson|","running_time":"101 minutes[1][2]","music_by":"Patrick Cassidy","edited_by":"Chris Gill","written_by":"John Michael McDonagh"}