{"country":"United States","distributed_by":"Columbia Pictures","Plot":"A small-town manchild with big buck-teeth, Bucky Larson (Nick Swardson), stumbles upon a family secret: His quiet and reserved parents (Edward Herrmann and Miriam Flynn) were famous porn stars in the 1970s. This motivates him to leave northern Iowa for Hollywood, hoping to follow in their footsteps and fulfill his destiny as the biggest adult-film star in the world. Unfortunately, he has no idea how to become a porn star like his parents, and his penis is incredibly small.Through a series of misunderstandings, he gets a job as a porn actor with fading director Miles Deep (Don Johnson). He makes several films, and achieves a certain fame when his small penis makes women appreciate their partner's endowment. Along the way he meets and falls in love with Kathy (Christina Ricci), a kindhearted waitress. After becoming incredibly famous, Bucky learns he just wants to be with Kathy; she rejects him without explanation, however, leaving him brokenhearted. During a film shoot, Miles confesses that he had told Kathy to leave Bucky so he could have his prize star all to himself. Bucky forgives Miles and goes after Kathy, who is on a horrible date with another porn star, the well-endowed Dick Shadow (Stephen Dorff). Bucky declares his love, and the two get married. After one year, Bucky opens his own famous steakhouse. One night, his former roommate (Kevin Nealon) comes into the restaurant and yells at him for owing him rent money, and tells Bucky he is \"just like John Mayer\".","language":"English","Reception":"Initially not pre-screened for critics,[3] the film was panned by critics on its opening weekend. Review aggregator Rotten Tomatoes reports that a total amount of 35 critics who reviewed the film gave the film negative reviews, bringing the film's rating to a rare 0%, with a rating average of 1.6 out of 10, the consensus calling it a \"severely misguided and inept comedy incapable of even telling its single joke properly\".[4] On Metacritic, the film received a weighted average score of 9% based on reviews from 13 critics,[5] making it the worst-reviewed wide release of 2011.[6] It was also given the Moldy Tomato award for the worst-reviewed film of 2011 by Rotten Tomatoes.[7]Orlando Sentinel critic Roger Moore stated \"the concept, and the movie that comes from it aren't funny. And second, Swardson wasn't any more born to be a star than his character\".[8] New York Times critic A.O. Scott stated in his review that Bucky Larson: Born to Be a Star was so bad that it \"may have been made ... to console every actor who has ever been in a movie that is a little less bad than this one. Let me put the matter another way: this may be the worst movie Pauly Shore has ever been in. Think about that. If you dare, go on Netflix and test the hypothesis.\"[9] Critic Nathan Rabin gave the film a D−[10] in his initial review, then noted that \"Bucky Larson was panned so viciously that my D− ranked on the generous side of critical appraisals\" when revisiting the film a second time for his My Year of Flops column, where he cited it as an example of a \"shitty miracle, [a film where] everything goes awry. It's not a matter of one sorry element dragging the rest down; it's every terrible component amplifying the awfulness of everything else\", later calling it \"one of the ugliest, most misguided comedies in recent memory.\"[11]The film earned six nominations at the 32nd Golden Raspberry Awards including Worst Picture, Worst Actor (Nick Swardson), Worst Director, Worst Screenplay, Worst Screen Ensemble, and Worst Prequel, Remake, Rip-off or Sequel (rip-off of Boogie Nights and A Star Is Born). It lost in all six categories to Jack and Jill, another poorly received film in which Adam Sandler and Nick Swardson had involvement.[12]Bucky Larson was a box office flop, earning only $1.4 million to land at #15 for its opening weekend, thus making Bucky Larson the least successful Happy Madison film to date, both critically and commercially. After two weeks of release, the film had earned a total of $2.5 million, after which it was pulled from theatres.[13]The film's budget was $9 million.[1]Swardson defended Bucky Larson in an October 2011 interview, in which he blamed its poor financial showing on the difficulties of advertising the material: \"To promote an R-rated movie, with commercials, with this character, it was just really, really hard. It was hard to get the movie across to people. The trailer in theaters was really tame because we couldn't show any of the insanity, and even if we did it, it wouldn't hit because it had no context. It was just really frustrating.\" He predicted the film would find more appreciation on DVD.[14]Swardson also dismissed the negative reviews. \"I knew the critics were going to bury us because of the acting, how it was written and directed ... None of those reviewers was psyched to see Bucky Larson and laugh. They go in with the mentality 'fuck these guys for making another movie.' They go in there to kind of headhunt. It makes me laugh because it's just so embarrassing. It makes them look like such morons.\"[14]","box_office":"$2.5 million[2]","cinematography":"Michael Barrett","production_company":"Happy Madison Productions Miles Deep Productions","directed_by":"Tom Brady","release_dates":"September 9, 2011 (2011-09-09)|||||","produced_by":"Adam Sandler Jack Giarraputo Allen Covert Nick Swardson David Dorfman","starring":"Nick Swardson Christina Ricci Stephen Dorff Don Johnson","running_time":"97 minutes","music_by":"Waddy Wachtel","edited_by":"Jason Gourson","bucky_larson:_born_to_be_a_star":"Theatrical release poster","written_by":"Adam Sandler Allen Covert Nick Swardson","budget":"$9 million[1]"}