{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Newspapers detail the 1949 murder of Margaret Strauss (Emma Thompson), who was stabbed during a robbery; her anklet is missing. Her husband, composer Roman Strauss (Kenneth Branagh), is found guilty of the crime and condemned to death. Before his execution, Roman is visited by reporter Gray Baker (Andy Garcia). Asked if he killed Margaret, Roman whispers in Gray’s ear; Baker does not disclose Roman's answer.Forty years later, private detective Mike Church (Branagh) investigates the identity of a woman who has appeared at the orphanage where he grew up. She has amnesia, cannot speak and has nightmares.Mike takes her in and asks his friend, Pete Dugan (Wayne Knight), to publish her picture and his contact information. Antiques dealer and hypnotist Franklyn Madson (Derek Jacobi) approaches Church, suggesting that hypnosis may help her recover her memory. When the session is unsuccessful, Madson suggests that they experiment with past life regression. Mike is skeptical but the woman details Margaret and Roman's lives in third person, from courtship to their wedding. When the session ends, she can speak but has amnesia. Madson shows them copies of Life from the murder; Mike and the woman bear a striking resemblance to Roman and Margaret. Mike visits disgraced psychiatrist Cozy Carlisle (Robin Williams), who insists that they continue to see Madson; delving into the problems between Margaret and Roman may resolve her amnesia.Mike nicknames the woman \"Grace\", and falls in love with her. Doug (Campbell Scott) appears and claims that Grace is his fiancée Katherine, but Mike discovers he is lying.Hypnotized, Grace remembers that Roman (unable to finish his opera) is frustrated and indebted. He believes that Margaret is flirting with Gray Baker, whom she met on their wedding day. Margaret cannot convince Roman that she is faithful and catches Frankie, the son of their housekeeper Inga, looking through her jewelry box. She asks Roman to dismiss them but Roman refuses, saying that they saved his life in Germany.Grace sees Mike standing over Margaret with scissors, and is convinced he intends to kill her. Mike insists he is not Roman and would never hurt her. When he accidentally calls her \"Margaret\", he agrees to let Madson regress him.Mike discovers he was Margaret, and Grace was Roman. When he explains this to Madson and Grace, but Pete Dugan interrupts to say that someone has identified Grace as artist Amanda. Amanda, still afraid of Mike, accompanies Pete and Madson to her apartment; her artwork focuses on scissors. Madson gives her a gun to protect herself from Mike.Mike visits Gray Baker in a nursing home and asks him about Roman's 1950 secret but Baker insists that Roman said nothing to him. Gray is convinced that Roman did not kill his wife and urges Mike to find Inga, who would know what happened. Mike realizes that Madson is Frankie; he questions Inga, who explains that shortly before the murder she declared her love for Roman (who insisted that he loved Margaret). Inga tries to explain her sorrow to Frankie, who blames Margaret for his mother's unhappiness; he kills her with scissors, stealing her anklet. Roman stumbles in, and is found covered in his wife's blood and holding the murder weapon.After Roman's execution, Inga brings Frankie to London; he learns about hypnotherapy and past-life regression. After returning to Los Angeles, Frankie is convinced that Margaret’s spirit would seek revenge. When he sees Amanda’s picture in the paper, he knows she has returned. He hires Doug (an actor) to separate Mike and Amanda and distract Amanda while he waits to kill her. Inga apologizes for her past, refuses to protect Frankie and gives Mike the anklet. Mike leaves to find Amanda, and Madson smothers Inga with a pillow.Mike tells Amanda the truth; terrified, she shoots him. Madson arrives, revealing his true identity; Amanda tries to shoot him, but the gun jams and he knocks her out. He puts the scissors he used to kill Margaret in Mike's hand and tries to make it look like Amanda committed suicide with the gun. As he bends to pull the trigger, Mike stabs him in the leg with the scissors. Madson is impaled on a scissors sculpture.","language":"English","Reception":"Dead Again was well received by most critics. It currently holds an 82% \"Fresh\" rating on Rotten Tomatoes.[2]Roger Ebert, noted critic of the Chicago Sun-Times, gave the film a glowing four star review, drawing comparisons to the works of Orson Welles and Alfred Hitchcock, stating, \"Dead Again is Kenneth Branagh once again demonstrating that he has a natural flair for bold theatrical gesture. If Henry V, the first film he directed and starred in, caused people to compare him to Olivier, Dead Again will inspire comparisons to Welles and Hitchcock - and the Olivier of Hitchcock's Rebecca. I do not suggest Branagh is already as great a director as Welles and Hitchcock, although he has a good start in that direction. What I mean is that his spirit, his daring, is in the same league. He is not interested in making timid movies.\"[5] Noted online critic James Berardinelli also gave the film a four star review, praising Branagh's direction and all levels of the production from the screenplay by Scott Frank to Patrick Doyle's score, stating, \"... Branagh has combined all of these cinematic elements into an achievement that rivals Hitchcock's best work and stands out as one of the most intriguing and memorable thrillers of the 1990s.\"[6]Conversely, Peter Travers of Rolling Stone viewed the film negatively, praising some elements of Branagh's direction while criticizing neglect of the romance, saying, \"In his efforts to crowd the screen with character and incident, Branagh cheats on the one element that might have given resonance to the mystery: the love story. Branagh and Thompson (married in real life) are sublime actors, but they never develop a convincing ardor as either couple. How could they when the director is so busy playing tricks? Dead Again isn't a disaster, merely a miscalculation from a prodigious talent who has forgotten that you squeeze the life out of romance when you don't give it space to breathe.\"[7]Vincent Canby of The New York Times gave the film a luke-warm review, calling it \"a big, convoluted, entertainingly dizzy romantic mystery melodrama\" and concluding, \"Dead Again is eventually a lot simpler than it pretends to be. The explanation of the mystery is a rather commonplace letdown, but probably nothing short of mass murder could successfully top the baroque buildup. In this way, too, the film is faithful to its antecedents, while still being a lot of fun.\"[8]Dead Again opened #1 at the U.S. box office, earning $3,479,395 during its opening weekend playing on 450 screens. It remained #1 at the U.S. box office for three weeks and grossed over $38 million by the end of its theatrical run.[1]","box_office":"$38,016,380 (US)[1]","cinematography":"Matthew F. Leonetti","directed_by":"Kenneth Branagh","dead_again":"Theatrical release poster","release_dates":"August 30, 1991 (1991-08-30) (United States)|||||","Production":"The movie was filmed entirely in color. After test screenings, it was decided to use black and white for the \"past\" sequences to help clear up audience confusion. The final frame, once the mystery is solved, fades from black and white to color. The negative of the final frame was flipped to match the present day lovers to the doomed 1940s newlyweds they embodied; i.e., Margaret dissolves into Mike, and Roman dissolves into Grace.When the audience first meets Mike Church, he's seated in his car, which is parked on the wrong side of the street. While it may seem that this is because Branagh is from the United Kingdom (where cars are driven on the left-hand side of the road), it is actually because behind him are a number of skyscrapers that he, as the director, wanted included in the background.In addition to the dual roles played by Branagh and Thompson, actress Jo Anderson and the film's composer Patrick Doyle both play small dual parts, appearing in the present-day and 1940s sequences.Branagh has said that at the time he made this film (and still, to some extent) he was very interested in the technique of uninterrupted takes, and several can be seen throughout the movie. Also note sequences such as the first hypnosis sequence at the Laughing Duke, which features an extremely complicated camera shot in 360 degrees, which involved a great deal of precise timing and technical faculty. Branagh noted that this relatively short scene was shot perhaps fifteen times, taking all day.According to the director's commentary on the DVD edition of the movie, the film has numerous in-jokes. For instance, a date seen in one of the newspaper clippings is actually Branagh's birthday, and Roman Strauss' prisoner number is the date of the Battle of Agincourt. (Branagh's previous film, which launched his career, was Henry V in 1989.)","produced_by":"Lindsay Doran","starring":"Kenneth Branagh|Andy Garcia|Derek Jacobi|Hanna Schygulla|Emma Thompson|","running_time":"107 minutes","music_by":"Patrick Doyle","edited_by":"Peter E. Berger","Release":"Dead Again was released on August 30, 1991, in the United States and October 25, 1991, in the United Kingdom. It was later entered into the 42nd Berlin International Film Festival in February 1992.[3]The film was released on DVD on June 27, 2000 through Paramount Home Entertainment. The DVD Special Features include two audio commentaries and a theatrical trailer.[4]","written_by":"Scott Frank","budget":"$15 million"}