{"based_on":"Twins  by Bari Wood Jack Geasland","country":"Canada United States","distributed_by":"20th Century Fox","Plot":"Elliot and Beverly Mantle are identical twins and gynecologists who jointly operate a highly successful clinical practice in Toronto that specializes in the treatment of female fertility problems. Elliot, the more confident and cynical of the two, seduces women who come to the Mantle Clinic. When he tires of them, the women are passed on to the shy and passive Beverly, while the women remain unaware of the substitution.An actress, Claire Niveau, comes to the clinic for her infertility. It turns out that Claire has a \"trifurcated cervix\", which means she probably will not be able to have children. Elliot seduces Claire and then urges Beverly to sleep with her. However, Beverly becomes emotionally attached to Claire, and this upsets the equilibrium between the twins. Beverly also begins sharing Claire's abuse of prescription drugs, which he abets through his doctor's authority. When Claire learns that Elliot has been taking sexual advantage of her by impersonating Beverly, she is angry and confronts them both in a bar, but later decides to continue a relationship with Beverly exclusively.Eventually, Claire leaves town to work on another film. This sends Beverly into clinical depression, more prescription drug abuse, and paranoid delusions about \"mutant women\" with abnormal genitalia. Beverly seeks out metallurgical artist Anders Wolleck and commissions a set of bizarre \"gynecological instruments\" for operating on these mutant women. After Beverly assaults a patient during surgery with one of Wolleck's tools, both brothers are immediately suspended from practice and put on administrative leave by the hospital board.With their medical career now ruined, Elliot locks Beverly into the clinic and tries to clean him up, taking pills himself in order to \"synchronize\" their bloodstreams. When Claire returns, Beverly leaves the clinic to be with her. After recovering his sobriety, he is concerned about his brother, and goes back to the clinic. There he finds the clinic in a shambles and Elliot despondent and intoxicated. Their positions are reversed as Beverly cares for Elliot. Drugged and despairing, they celebrate their mock birthday and Elliot volunteers to be killed, \"to separate the Siamese twins\". Beverly disembowels Elliot on an examination couch with the same claw-like instrument of Wolleck's that he had used to assault his patient in the operating room.Shortly after, Beverly pulls himself together, leaves the clinic and calls Claire on a payphone. When she asks, \"Who is this?\", Beverly leaves the payphone, walks back into the clinic and dies in Elliot's dead arms.","language":"English","Reception":"Dead Ringers won the Genie Award for Best Canadian Film of 1988, also Best Director, Adapted Screenplay, Actor (Irons), Art Direction, Cinematography, Editing, Musical Score and Sound.Irons' performance was highly acclaimed and won Best Actor awards from the Chicago Film Critics Association and the New York Film Critics Circle. Los Angeles Film Critics Association named Cronenberg Best Director and Bujold Best Supporting Actor. When Irons won the Academy Award for Best Actor in 1991 for Reversal of Fortune, he thanked Cronenberg in his acceptance speech.[7] The film was nominated for the Grand Prix of the Belgian Syndicate of Cinema Critics.It is the favorite Cronenberg film of Korean director Chan-wook Park[8] and was voted for in the 2002 Sight & Sound poll by Lalitha Gopalan.[9] In 1999, Rolling Stone listed Dead Ringers as 95th on their list of \"100 Maverick Movies\".[10] Total Film placed Dead Ringers 35th on their list of the \"50 Greatest Horror Movies of All Time\"[11] while Entertainment Weekly placed it 20th on their list of \"The 25 scariest movies of all time\".[12] In 2004, the Toronto International Film Festival Group named Dead Ringers the 6th best Canadian film ever made.[13] It was named one of \"The Top 10 'True-Story' Horror Movies of All-time!\" by Bloody Disgusting.[14]Although Dead Ringers closely follows the case of Stewart and Cyril Marcus, director Peter Greenaway notes that Cronenberg queried him about his film A Zed & Two Noughts for two hours before going on to make Dead Ringers eight months later.[15] The film has a positive rating of 83% on Rotten Tomatoes.","box_office":"$8 million[3]","cinematography":"Peter Suschitzky","production_company":"Morgan Creek Productions Telefilm Canada Mantle Clinic II","directed_by":"David Cronenberg","dead_ringers":"theatrical release poster","release_dates":"September 8, 1988 (1988-09-08) (TIFF)|September 23, 1988 (1988-09-23) (United States)||||","Production":"In his DVD commentary, Irons mentions that Robert De Niro passed on the role because he was not comfortable with the idea of playing gynecologists and William Hurt turned it down because “it is hard enough to play one role” and the script eventually landed on his desk.[5] This movie marked the screen debut of actress Jill Hennessy: both she and her real life twin sister Jacqueline play prostitutes in one scene of the film. Jill later followed this up by her signature role as Claire Kincaid on the TV show Law & Order.Initially, Irons had two separate dressing rooms and two separate wardrobes which he would use depending on which character he was playing at the time. Soon, he realized that “the whole point of the story is you should sometimes be confused as to which is which,” after which he moved to a single dressing room and mixed the wardrobes together, and found an “internal way” to play each character differently, using the Alexander technique to give them “different energy points,” which gave them slightly different appearances.[5]A second dream scene was also shot which featured a parasitic twin emerging from Beverly’s stomach but this sequence was not used in the final cut.[6]","produced_by":"Marc Boyman David Cronenberg","starring":"Jeremy Irons|Geneviève Bujold|","running_time":"115 minutes[1]","music_by":"Howard Shore","edited_by":"Ronald Sanders","written_by":"David Cronenberg Norman Snider","budget":"$13 million[2]"}