{"country":"United States","distributed_by":"Allied Artists Pictures Corporation","Plot":"A television announcer reports sightings of a red fireball around the world. Facetiously, he calculates its path will lead it to California. Nancy Archer (Allison Hayes), a wealthy but highly troubled woman with a history of emotional instability and immoderate drinking, is driving on a road in an American desert that night. A glowing sphere settles on the deserted highway in front of her, causing her to veer off the road. When she gets out to investigate, a huge creature exits the object and reaches for her (the viewer sees only an enormous hand falling upon the screaming woman). Nancy escapes and runs back to town, but nobody believes her story due to her known drinking problem and recent stay in a sanatorium. Her philandering husband, Harry Archer (William Hudson), is more interested in his latest girlfriend, town floozy Honey Parker (Yvette Vickers), but pretends to be the good husband in the hope that Nancy will \"snap\" and return to the \"booby hatch\", leaving him in control of her $50 million.Nancy bargains with Harry, asking him to search the desert with her for the \"flying satellite,\" agreeing to a voluntary return to the sanatorium if they find no evidence. As night falls, they find the spacecraft. The alien creature, now seen as an enormous male humanoid, emerges. Harry fires his pistol at it, but the gunfire has no effect on the creature. Harry flees, leaving Nancy behind.Nancy is later discovered on the roof of her pool house, but is delirious and must be sedated by her family physician, Dr. Cushing (Roy Gordon). The doctor comments on some scratches he finds on Nancy's neck, and theorizes that she was exposed to radiation. Harry, egged on by his mistress Honey, plans to inject Nancy with a lethal dose of her sedative, but when he sneaks up to her room, he discovers that she has grown into a giant. (In a scene paralleling that of Nancy's first encounter with the alien, the viewer sees only an enormous prop hand as the film characters react in horror.) Cushing and Dr. Von Loeb, a specialist he has called in, are at a loss how to treat their patient. They keep her in a coma with morphine and restrain her with chains while waiting for the authorities. The sheriff and Jess (Ken Terrell), Nancy's faithful butler, track enormous footprints leading away from the estate to the alien sphere. Inside the sphere, they find Nancy's diamond necklace (containing the largest diamond in the world) and other large diamonds, each in a clear orb. They speculate that the jewels are being used as a power source for the alien ship. The huge alien reappears, and the sheriff and Jess flee.Meanwhile, the gigantic Nancy awakens and breaks free of her restraints. She tears off the roof of her mansion and, clothed in a bikini-like arrangement of bed linens, makes her way to town, to avenge herself on her unfaithful husband. When she rips the roof off the bar to get at Harry, she spots Honey. She drops a ceiling beam on her rival, killing her. Harry panics, grabs Deputy Charlie's gun, and begins shooting, but she picks Harry up and walks away. Gunshots have no apparent effect on her. The sheriff fires a riot gun, which causes a nearby power line transformer to blow up, killing Nancy. The doctors find Harry lying dead in her hand.","attack_of_the_50_foot_woman":"Theatrical release poster by Reynold Brown","language":"English","Critical reception":"The film review aggregator website Rotten Tomatoes gives the film a score of 75%, based on 12 reviews from critics. It reports the critical consensus as \"Attack of the 50 Foot Woman may well be one of the worst science-fiction films of all time, but that's not to say that it isn't thoroughly enjoyable\".[6]","box_office":"$480,000 (USA)[2]","cinematography":"Jacques R. Marquette","directed_by":"Nathan H. Juran","Home media":"The original Attack of the 50 Foot Woman was released on DVD by Warner Bros. on June 26, 2007. It was also available in a Warner Bros. three-disc box set titled Cult Camp Classics 1: Sci-Fi Thrillers, which included the films The Giant Behemoth and Queen of Outer Space. The DVD includes an audio commentary with co-star Yvette Vickers and interviewer Tom Weaver. The DVDs are officially out-of-print. On September 20, 2011, Warner Bros. added it to the Warner Archive collection; the content is the same as the previous DVD release. Warner Bros. has yet to release a Blu-ray of the film.","Remakes and sequels":"With its low budget of around $88,000, Attack of the 50 Foot Woman made enough money to prompt discussion of a sequel. According to executive producer and cinematographer Jacques Marquette, the sequel was to be produced at a higher budget and in color. A script was written, but the project never advanced beyond the discussion phase.[7]In the mid-1980s filmmaker Jim Wynorski was considering a remake of the 1958 movie, with Sybil Danning in the title role.[8] Wynorski made it as far as a shooting a photo session with Danning dressed as the 50 foot woman,[9] but again, the project never materialized, as Wynorski opted to film the 1988 remake of Not of This Earth instead.[10]The film was finally remade in a 1993 HBO movie, Attack of the 50 Ft. Woman. It was directed by Christopher Guest with a script by Thirtysomething scribe Joseph Dougherty, starred Daryl Hannah in the title role, who also produced the film.In 1995 Fred Olen Ray produced a parody entitled Attack of the 60 Foot Centerfold, starring J. J. North and Tammy Parks. Beyond the basic premise, the plot had little in common with the original film, being concerned with the side effects of a beauty-enhancing formula on two ambitious female models. The film was deliberately farcical and made on an extremely low budget. The illusion of size difference was achieved using forced perspective, unlike the earlier films which used composite imaging.In late 2011 Roger Corman and his New Horizon company produced a 3D film called Attack of the 50 Foot Cheerleader; it was released on August 25, 2012. The film was written by Mike MacLean (who also penned Sharktopus for Corman) and directed by Kevin O'Neill. The film stars Jena Sims, a former Miss Georgia Teen USA, in the title role, Cassie Stratford, and Olivia Alexander as Sims's rival Brittany Andrews. Both Alexander and Sims had hinted that a sequel was underway, but as of May 2016 nothing more has materialized.","release_dates":"May 19, 1958 (1958-05-19)|||||","Production":"According to star Yvette Vickers, the estate used as the Fowler Mansion in Attack was actually a pre-World War One estate in the Hollywood Hills that had been used in other feature films; it was also rented out for parties.[5]","produced_by":"Bernard Woolner","starring":"Allison Hayes William Hudson Yvette Vickers","running_time":"65 minutes","music_by":"Ronald Stein","edited_by":"Edward Mann","written_by":"Mark Hanna","budget":"$89,000[1]"}