{"based_on":"Characters  by Sylvester Stallone","Cast":"Liev Schreiber voices an HBO 24/7 announcer, while Michael Buffer cameos as himself serving as ring announcer. Other sports media personalities who appear include ESPN's Tony Kornheiser and Michael Wilbon (Pardon the Interruption), Hannah Storm (SportsCenter), HBO Sports boxing announcer Jim Lampley and Max Kellerman of HBO Sports (HBO Boxing) and ESPN (SportsNation/Max and Marcellus).","country":"United States","distributed_by":"Warner Bros. Pictures|","screenplay_by":"Ryan Coogler|Aaron Covington|","story_by":"Ryan Coogler","Plot":"In 1998, Adonis \"Donnie\" Johnson, the son of an extramarital lover of former heavyweight champion Apollo Creed, is serving time in a Los Angeles youth facility when Creed's widow, Mary Anne, pays him a visit and offers to take him in.Seventeen years later, Donnie walks away from his job at a securities firm to pursue his dream of becoming a professional boxer. Mary Anne vehemently opposes this, remembering how her husband was killed in the ring 30 years earlier against Ivan Drago. He tries to get a slot at Los Angeles' elite Delphi Boxing Academy, but is turned down. Undaunted, Donnie travels to Philadelphia in hopes of getting in touch with his father's old friend and rival, former heavyweight champion Rocky Balboa.Donnie tracks down Rocky at Rocky's Italian restaurant, Adrian's, named in honor of his deceased wife, and asks Rocky to become his trainer. Rocky is reluctant to get back into boxing, having already made a one-off comeback at a very advanced age despite having suffered brain trauma during his career as a fighter. However, he eventually agrees. Donnie trains at the Front Street Gym, with several of Rocky's longtime friends as cornermen, and also finds a love interest in Bianca, an up-and-coming singer and songwriter.Donnie, now known as \"Hollywood Donnie,\" defeats a local fighter, and word gets out that he is Creed's illegitimate son. Rocky gets a call from the handlers of world light heavyweight champion \"Pretty\" Ricky Conlan, who is due to be forced into retirement by an impending prison term. He offers to make Donnie his final challenger—provided that he change his name to Adonis \"Hollywood Donnie\" Creed. Donnie balks at first, wanting to forge his own legacy. However, he eventually agrees.While helping Donnie train, Rocky learns he has non-Hodgkin's lymphoma. He is unwilling to undergo chemotherapy, remembering that it was not enough to save Adrian when she had ovarian cancer. His diagnosis and the fact that his best friend and brother-in-law Paulie Pennino—Adrian's brother—has now passed away in addition to Adrian, Apollo and his old trainer Mickey Goldmill further force him to confront his own mortality. Seeing Rocky shaken, Donnie urges him to seek treatment.Donnie fights Conlan at Goodison Park in Conlan's hometown of Liverpool, and many parallels emerge between the bout that ensues and Apollo and Rocky's first fight 40 years earlier. First, before going into the ring, Donnie receives a present from Mary Anne — new American flag trunks similar to the ones Apollo and later Rocky wore. Additionally, to the surprise of nearly everyone, Donnie goes the distance after giving Conlan all he can handle and survives being knocked down to knock Conlan down for the first time in his career. Conlan wins on a split decision (just as Apollo retained his title by split decision against Rocky), but Donnie has won the respect of Conlan and the crowd. As Max Kellerman puts it while calling the fight for HBO, \"Conlan won the fight, but Creed won the night.\" Conlan tells Donnie that he is the future of the light heavyweight division.The film ends with Donnie and a frail but improving Rocky climbing the \"Rocky Steps\" at the entrance of the Philadelphia Museum of Art.","language":"English","Reception":"Creed grossed $109.8 million in North America and $63.8 million in other territories for a worldwide total of $173.6 million, against a budget of $35 million.[4]In North America, Creed opened on Wednesday, November 25, 2015, alongside The Good Dinosaur and Victor Frankenstein, as well as the expanding wide releases of Brooklyn, Spotlight and Trumbo. The film was originally projected to gross $35 million from 3,404 theaters in its first five days, including $20 million in its opening weekend.[36] However, after grossing $1.4 million from its Tuesday night previews (a record for a Thanksgiving week release) and $6 million on its opening day, five-day projections were increased to $39–42 million. The film ended up grossing $42.6 million in its first five days, including $30.1 million in its opening weekend, finishing third at the box office.[37]Creed has received critical acclaim.[38] Review aggregator Rotten Tomatoes, gave the film a rating of 94%, based on 242 reviews, with an average rating of 7.9/10. The site's consensus reads, \"Creed brings the Rocky franchise off the mat for a surprisingly effective seventh round that extends the boxer's saga in interesting new directions while staying true to its classic predecessors' roots.\"[39] On Metacritic, the film has a score of 82 out of 100, based on 42 critics, indicating \"universal acclaim\".[40] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.[37]A.V. Wire's Herman Dhaliwal gave the film a very positive review, writing, \"I will say the film was everything I could have ever wanted and then some. It’s a film that could have gone so wrong in so many ways so easily, but the results show something that is genuine and inspired. It takes the smartest possible routes with the story it wants to tell and delivers in basically every way it needed to. Ryan Coogler cements himself as one of the best rising filmmakers working today, as he crafts an emotional, funny, compelling and uplifting film that is full of strong performances.\"[41] Andrew Barker of Variety stated that the film lives up to the expectation of its predecessors, while forging its own unique path. He also appreciated the performances of Stallone and Jordan, saying that Stallone deserves credit for taking a chance on young director Coogler, and that his trust has paid off. He concluded that the director \"offered a smart, kinetic, exhilaratingly well-crafted piece of mainstream filmmaking\".[42] IGN reviewer John Lasser gave the film an 8.5 out of 10, saying, \"Creed is a mirror of Rocky's story and we have all been watching that unfold on the big screen for decades. Coogler's film does nothing to break the mold. Rather, it shows that the mold exists for a reason. Jordan delivers a knockout performance, and Stallone does as well. In the end, we can all only hope that we'll get to see Adonis on screen for just as long as we've seen Rocky.\"[43]","box_office":"$173.6 million[4]","cinematography":"Maryse Alberti","production_company":"Metro-Goldwyn-Mayer Pictures New Line Cinema Chartoff Winkler Production[1]","directed_by":"Ryan Coogler","release_dates":"November 19, 2015 (2015-11-19) (Regency Village Theater)|November 25, 2015 (2015-11-25) (United States)||||","Production":"On July 24, 2013, it was announced that MGM had signed on with Fruitvale Station director Ryan Coogler to direct a spin-off of Rocky, a seventh film in the Rocky series, which Coogler would also co-write with Aaron Covington.[17] Sylvester Stallone also has been working on the screenplay for the seventh film.[18][19][20] The film would focus on a man following in the footsteps of his late father, Apollo Creed, and getting a mentor in the now-retired Rocky Balboa. Michael B. Jordan was set for the role of Creed's son, Adonis Creed,[21] and Stallone was set to reprise his character of Rocky.[17] Original producers Irwin Winkler and Robert Chartoff would produce, along with Stallone and Kevin King-Templeton.[17] On April 25, 2014, while talking to THR, Coogler stated that he had sent his latest draft to the studio, and confirmed the involvement of Jordan and Stallone.[8]On November 10, real-life boxers Tony Bellew and Andre Ward joined the film, with Bellew to play a fighter, \"Pretty\" Ricky Conlan, the main opponent for Creed. Shooting was set to begin in January 2015, in Las Vegas and Philadelphia.[12] On December 16, Tessa Thompson was added to the cast as the female lead.[9] On January 8, 2015, Phylicia Rashad reportedly joined the film to play Mary Anne Creed, Apollo's widow.[11] On January 21, Graham McTavish tweeted about his involvement in the film.[13]Principal photography began on January 19, 2015 in England, with the first scene shot taking place during a Barclays Premier League football match between Everton (of which Stallone and native Evertonian Bellew are fans) and West Bromwich Albion at Goodison Park in Liverpool.[22][23] Goodison would later host both the climactic film fight between Donnie and Conlan and also Bellew's real-life title fight against Ilunga Makabu in May 2016, which was the first outdoor boxing match in Liverpool since 1949.Filming also took place in Philadelphia.[24][25] In early February, an empty store in Philadelphia was converted into a boxing gym, where some training scenes were shot.[26][27]On February 13, the crew was spotted filming in The Victor Cafe.[28] The cafe was transformed into the Adrian's Restaurant, and crew were again spotted filming there on February 16.[29] Stallone and Jordan were also spotted on the set of the film on February 18.[30] From February 24–27 and then on March 3, filming took place at Sun Center Studios in Aston Township.[31]The musical score for Creed was written by Swedish composer Ludwig Göransson, who is only the third composer in the history of the Rocky series, following Bill Conti (Rocky I, II, III, V, and Balboa) and Vince DiCola (Rocky IV). Creed also features a soundtrack that consists mostly of music new to the series, including hip hop tracks by artists such as Future, Meek Mill, and White Dave.[32] Both a score and a soundtrack album were released on November 20, 2015 by WaterTower Music and Atlantic Records, respectively.[33] One tribute to Conti's original soundtrack is included - the track \"You're a Creed\" uses both \"Gonna Fly Now\" and \"Going The Distance\".","produced_by":"Irwin Winkler|Robert Chartoff|Charles Winkler|William Chartoff|David Winkler|Kevin King-Templeton|Sylvester Stallone|","starring":"Michael B. Jordan|Sylvester Stallone|Tessa Thompson|Phylicia Rashad|Anthony Bellew|","running_time":"133 minutes[2]","Sequel":"In January 2016, Sylvester Stallone and MGM CEO Gary Barber confirmed that a sequel to Creed is in development.[64] On January 11, 2016, it was reported that Creed 2's release date is tentatively set for November 2017.[65][66][67][68]","creed":"Theatrical release poster","music_by":"Ludwig Göransson","edited_by":"Michael P. Shawver|Claudia Castello|","Release":"On February 3, 2015, Warner Bros. slated the film to be released domestically on November 25, 2015. This date coincides with the 40th anniversary of the opening scene in the original film, where Rocky fights Spider Rico.[34]On December 20, 2015, screener copies of numerous Oscar contenders were leaked. The FBI has linked the case to co-CEO Andrew Kosove of Alcon Entertainment. Kosove claimed that he had \"never seen this DVD\", and that \"it never touched his hands.\" [35]","budget":"$40 million[3]"}