{"country":"United States","distributed_by":"New World Pictures","screenplay_by":"Parnell Hall","story_by":"Shepard Abbott","Legacy":"A sequel, C.H.U.D. II: Bud the C.H.U.D., was released in 1989. Although C.H.U.D. was negatively received during its initial release, it attracted a cult following over the years, inspired the name of a film website (which changed the acronym's meaning to Cinematic Happenings Under Development), and references to it have appeared in The Simpsons, The Flash, Aqua Teen Hunger Force, Castle, and Archer. It was also the subject of an April Fool's hoax announcement by The Criterion Collection.[13] In 2007, Rob Zombie was rumored to be considering a remake,[14] and, in 2008, a different remake was rumored to be in production.[15] In 2014, an original, collectible poster for the film was released.[16] C.H.U.D appears in the 2003 video game Tony Hawk's Underground under the name T.H.U.D.","Plot":"The film opens with a woman walking her dog down an empty, darkened city street. As she passes by a manhole, she is attacked by a creature, and the dog is pulled in after her.George Cooper (John Heard) lives with his girlfriend Lauren (Kim Greist). George, a once-prominent fashion photographer, has since forgone the fame and fortune. His current project is photographing New York City's homeless population, specifically those known as \"undergrounders\", or people who reside within the bowels of the city.A police captain named Bosch (Christopher Curry) is introduced. Bosch has a personal interest in the recent flood of missing persons (most of whom are homeless) being reported to his precinct. Bosch interviews A.J. \"The Reverend\" Shepherd (Daniel Stern), who runs the local homeless shelter. Shepherd believes recent events to be a part of a massive government cover-up and has the evidence to prove it. Bosch's superiors know more than they are letting on and seem to be taking their cues from an overly glib, weasely type named Wilson (George Martin), who works for the Nuclear Regulatory Commission.It turns out there are monsters lurking beneath the streets; beings that were once human, but have been mutated by radioactive, chemical toxic waste into hideous, flesh-eating creatures that prey on the homeless who live in the underground. Given the recent drop in the underground transient population, the creatures have resorted to coming to the surface through sewer manholes in order to feed. Through a series of events, both George and A.J. find themselves trapped in the sewers, a reporter gets involved (and eaten), and Lauren has a problem with both a clogged shower drain and an unexpected visitor that comes up through the sewer access point that she unfortunately decides to open in the basement of her apartment building. Then, through the dangerous investigative efforts of both A.J. and George, the absolute horror is revealed: The Nuclear Regulatory Commission is directly involved in the slaughter that has been going on.Although the political bureaucracy has forbidden the NRC to transport the toxic wastes through New York because of the large-scale danger to the public, it has secretly been hiding the waste by-products (marked as \"Contamination Hazard Urban Disposal\") beneath Manhattan in abandoned subway tunnels. Unfortunately, the underground homeless population has been coming into contact with these by-products, turning them into the mutated creatures. It is this secret that Wilson guards to the extent of having a mysterious and threatening lackey disrupt A.J. from making phone calls to the press. This thug then locks A.J. in an underground access tunnel either to suffocate from the gas to be used to asphyxiate the C.H.U.D.s, or to leave him to become their prey. Wilson is clearly willing to kill to protect his employer's secrets—even a cop. Later that evening at a diner, two police officers enter and while the waitress and the two are discussing, the monsters return and attack the diner inhabitants.Captain Bosch argues with Wilson over how to deal with the threat: Wilson wants to seal the sewers, open up some gas lines, and asphyxiate the C.H.U.D.s despite the inherent danger to the city.Wilson, after being overwhelmed by Bosch (it's implied in dialogue that Bosch's wife was the woman taken by the C.H.U.D. at the beginning of the movie) shoots him and drives the truck in reverse aiming for George and AJ, but they escape from the manhole just in time as Wilson pass them over. AJ finds Bosch's gun and shoots and kills Wilson before he runs over them, then the truck explodes as it falls on the manhole, Bosch is still alive and George, Lauren, and AJ are saved.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 17% of twelve surveyed critics gave the film a positive review; the average rating was 3.6/10.[6] Lawrence Van Gelder from The New York Times stated in his review for the film, \"C.H.U.D. makes no pretension toward serious thesis about government or the environment. It is meant to be light commercial entertainment, and in the category of horror films it stands as a praiseworthy effort\".[7] Keith Phipps of The A.V. Club wrote, \"Perfect for bleary-eyed late-night viewing and pretty much unwatchable at any other hour, it does make for an oddly appropriate refresher course for life under a Republican president.\"[8] Patrick Naugle of DVD Verdict called it a fun film that focuses more on entertainment than deeper issues.[9] Joshua Rothkopf of Time Out New York included it Time Out's list of best New York-set films, calling it \"more funny than scary\".[10] Bloody Disgusting rated it 4.5/5 stars and called it \"definitely one of b-movies best kept secrets\".[11]It won Best Fantasy Film at Brussels International Festival of Fantasy Film in 1985.[citation needed]","box_office":"$4.65 million","cinematography":"Peter Stein","directed_by":"Douglas Cheek","release_dates":"August 31, 1984 (1984-08-31)|||||","produced_by":"Andrew Bonime","starring":"John Heard|Daniel Stern|Christopher Curry|","running_time":"88 minutes","Controversy":"According to the commentary on the Anchor Bay DVD, stars Daniel Stern and Christopher Curry were displeased with Parnell Hall's rewritten script, and rewrote it extensively, adding the character of The Reverend and the alternate C.H.U.D. acronym. They claim that about 50% of the finished film is their rewrite and chose to remain uncredited. The claim of authorship of the alternate C.H.U.D. acronym is disputed by the film's producer, Andrew Bonime, who credits screenwriter Parnell Hall.[12]","c.h.u.d.":"Theatrical release poster","music_by":"Martin Cooper|David A. Hughes|","edited_by":"Claire Simpson","Release":"The film was given a limited release theatrically by New World Pictures beginning in August 1984. It grossed $4,654,423 at the domestic box office.[2] The film has been released twice by Anchor Bay Entertainment in 2001[3] and 2008.[4] Image Entertainment released it on DVD in 2011.[5]","budget":"$1.25 million[1]"}