{"country":"Australia","distributed_by":"Cowboy Booking(USA) Dendy Films(Australia) Southern Star Group Film(International)","Plot":"Following a passion for country music, Ralph leaves his father’s sheep farm in a remote Australian town, armed with a guitar and a plane ticket to Nashville, Tennessee. He hopes to hitchhike to Sydney Airport where his take-off into a successful country/western singing career will hopefully begin. However, fate and his naivety find him hitchhiking with a psychotic drug thief named Boyd, and Boyd's mesmerising girlfriend, Patsy. The plot then splits into a series of parallels, flash forwards and flashbacks. One depicts Ralph’s imprisonment after being framed for drug trafficking. The other follows the dramatic ascent of his career to hype status and the pairing between the dynamic Patsy and himself. Both paths eventually lead him home, with Ralph consequently being more mature and adjusted, and with a bag full of experiences. At the end of the film, it is stated that Patsy dies in a plane crash.","language":"English","Reception":"Doing Time for Patsy Cline grossed $671,639 at the box office in Australia,[2] which is equivalent to $940,295 in 2009 dollars.The film received generally positive reviews.[3] The New York Times criticized the film's editing and \"jarring leaps in time\", but praised the film's performances, especially that of Roxburgh.[4]The film received many award nominations including ten AFI Award nominations for 1997. It won an Australian Writer's Guild Award for Best Original Screenplay. The film won four Australian Film Institute Awards including Best Actor, Best Cinematography, Best Original Music Score, and Best Costume Design.[5] It also won an award of distinction for production design. It won three Australian Film Critics' Awards, including Best Actor, Best Musical Score and Best Cinematography.[6] It also won a San Diego Film Festival Award for Best Original Script[7] and a Melbourne International Film Festival Award for Most Popular Australian Film.[8][9]","box_office":"$831[1]","directed_by":"Chris Kennedy","release_dates":"5 September 1997 (premiere at Toronto Film Festival, Canada) 25 September 1997(AUS) 19 April 1998 (Singapore International Film Festival, Singapore) 28 August 1998 (Italy) 4 September 1998 (Poland)","produced_by":"Chris Kennedy John Winter","starring":"Miranda Otto Richard Roxburgh Matt Day","running_time":"95 minutes","music_by":"Peter Best","edited_by":"Ken Sallows"}