{"based_on":"I'm Giving Them Up for Good  by Margaret and Neil Rau","country":"United States","distributed_by":"United Artists","Plot":"As part of a public relations and marketing strategy to compare the empathy of Big Tobacco to the nobility of the Nobel Peace Prize, advertising executive Merwin Wren (Bob Newhart) convinces the Valiant Tobacco Company to propose a challenge: a tax-free check for $25,000,000 (equal to $161,320,327 today) to any city or town in America that can stop smoking, or go cold turkey, for thirty days.According to Wren, the offer will generate Valiant worldwide free publicity and praise as a humanitarian gesture, but no town in America would ever be able to claim the prize, cigarette smoking being too addictive to stop.The Reverend Clayton Brooks (Dick Van Dyke), a kindly but fearsome minister of the Eagle Rock Community Church, takes up the challenge as a spiritual call. He urges the economically depressed fictional community of Eagle Rock (population 4,006), Iowa, to go for the prize.The town council has been trying to woo back the military ever since it closed a base a few years back, hoping its return would help the local cash flow. Families have been moving out almost on a monthly basis and the town center is almost deserted.Reverend Brooks recruits every smoker in the town to sign up. Needled for not smoking himself (he used to, but had quit), he begins smoking to find solidarity with his \"flock.\"As the deadline to start the thirty day clock approaches, only a very few of the town's residents haven't signed the no smoking pledge. One of them is alcoholic Edgar Stopworth (Tom Poston), who Reverend Brooks decides to pay a house call on, to convince him to take the pledge. But Edgar knows himself pretty well and in desperation tells the Reverend \"My drinking is directly connected to my smoking. Now, when I say \"directly\", I mean there's a thing - a physical thing - that is directly connected from my liquor buds to the smoke pouch in my lungs. If you want me to quit smoking, you would have to cut - I mean, you'd have to physically cut that thing! And when you do, my head's gonna fall off! Do you understand, reverman? The booze bone's connected to the smoke bone. And the smoke bone's connected to the head bone. and that's the word of the lord!\" The Reverend looks defeated but comes up with the idea of Edgar leaving town for a thirty day vacation, which Edgar immediately departs on. Problem solved.At midnight, the challenge begins. For the next thirty days, no smoking is permitted, Eagle Rock being the only city in America that got all of its smokers to pledge.One of the film's recurring gags is that once the no smoking ban begins, Reverend Brooks himself gets extremely frustrated with not being able to smoke. So frustrated in fact he decides to take out his frustration by having frequent sex with his wife Natalie. At one point she barely gets finished making the bed and straightening up from the preceding episode before the Reverend is back home again for more. Natalie's reaction is priceless.The tobacco company sends Merwin to report the progress of the townspeople's commitment. The company needs just one person to fail. Among the weakest: the elderly Doctor Proctor (Barnard Hughes), who must always have a cigarette before surgery, and the anxiety-ridden wife of the mayor, Mrs. Wappler (Jean Stapleton), who counts the small gherkin pickles she eats as the hours pass. However, a group of 29 non-smoking residents, all members of the ultra-conservative Christopher Mott Society (based on the John Birch Society) have been asked by Brooks to police all traffic entering Eagle Rock to ensure no tobacco products enter. Another running gag ensues when elderly Odie Turman (Judith Lowry) keeps needling leader Amos Bush (Graham Jarvis) about his pistol, which she later steals.Eventually, the attention of the nation's leading newscasters at the time (all played by the comedy duo Bob and Ray), turns the small community's efforts into a matter of highly publicized failure or success. Soon the community is invaded by buxom \"massage therapists,\" beer vendors, souvenir shops and more. Rev. Brooks appears on a Time magazine cover, which leads him to another epiphany: if he can save the town, he will be a hero.Merwin is told by Valiant's board members to undermine the town's efforts at all costs, doing whatever he can to get someone to smoke before the thirty days are up, leading to hilarious results as the clock ticks down.Ultimately Eagle Rock succeeds and wins the $25 million prize. To cash in on the publicity, The President Of The United States (as seen from the side and back, then President Richard M. Nixon) arrives in a motorcade and makes an announcement that Eagle Rock will be the home of the new missile plant. As the film ends, it shows the huge smokestacks of the new plant spewing volumes of black smoke into the air around Eagle Rock.","Home video releases":"In 1993 Cold Turkey was released on VHS and LaserDisc, in the pan-and-scan format. In 2010, the film was released on DVD through Amazon.com with manufacturing on demand.[5]","language":"English","Reception":"The film earned $5.5 million in theatrical rentals at the North American box office.[3]Arthur Krim of United Artists later did an assessment of the film as part of an evaluation of the company's inventory:An old commitment to Dick Van Dyke, and what seemed to be a good idea for the American market, became an overpriced film with a has-been personality by the time of it's [ sic ] release. Albeit funny, the picture is way overpriced for its value, which is strictly for the American market - mainly for mid America. The producer and director went over a million dollars over budget on the film to deliver a minor American comedy with no overseas value. This film would be programmed today only if it could be made at one-half the cost.[4]Upon its release, Roger Ebert gave it four stars and praised several aspects of the production before concluding \"Even if you don't smoke, you'll find Cold Turkey funny.\"[citation needed]Vincent Canby, of The New York Times, wrote \"It is, within its limitations, a very engaging, very funny movie.\"[citation needed]","cold_turkey":"1971 movie poster by Sandy Kossin","box_office":"$11,000,000[1]","cinematography":"Charles F. Wheeler","production_company":"Tandem Productions","directed_by":"Norman Lear","Filming locations":"Most of the film, which is set in the fictional small town of \"Eagle Rock, Iowa\", was shot in and around Greenfield, Iowa, and many local people were used as extras. Some neighborhood scenes were shot in Winterset, Iowa. The Methodist church in Orient, Iowa, and the bank in Macksburg, Iowa, were used as well. The Grayson Mansion scenes were filmed at Terrace Hill, located in Des Moines, Iowa. Some were also shot in the town of Columbia in south central Kentucky.","Soundtrack":"Cold Turkey features original music by Randy Newman, including \"He Gives Us All His Love\", a ballad with a gospel influence that serves as the film's theme song. This was Newman's first film soundtrack.In 2007 the Percepto Records label issued a limited-edition soundtrack CD for the film.[2]","release_dates":"February 19, 1971","produced_by":"Norman Lear","starring":"Dick Van Dyke Bob Newhart Pippa Scott Tom Poston Edward Everett Horton Bob and Ray","running_time":"101 minutes","music_by":"Randy Newman","edited_by":"John C. Horger","written_by":"Norman Lear William Price Fox, Jr."}