{"country":"United Kingdom","distributed_by":"Anglo-EMI Film Distributors Ltd. MGM-EMI (UK) American International Pictures (USA)","Plot":"An expedition led by British archeologist Professor Fuchs (Keir) attempts to locate the cursed tomb of an evil Egyptian princess. Her body is found perfectly preserved. Fuchs becomes obsessed by Princess Tera's beauty and takes the body and sarcophagus back to London, building a secret shrine in his basement. Not long after, his daughter Margaret (Leon), who bears an uncanny resemblance to the princess, starts to experience strange dreams. A sinister man, whom only she seems to notice, watches her from the derelict house across the road. Wondering if she's going mad, Margaret starts experiencing wild personality changes.Soon the evil will of Tera, reaching up through the house, begins to periodically take over Margaret's mind and body. The strange man is revealed as Corbeck (Villiers), one of the expedition members, who is working to restore Tera to life and create a new reign of terror, and with his help Margaret kills the other desecrators of Tera's tomb, and everyone that stands in her way. Corbeck, Margaret and her increasingly unhinged father start the ritual to awaken the princess. Professor Fuchs finally realizes the truth and convinces her to stop the ritual; together they overpower and kill Corbeck. Tera awakens, and in an attempt to stop Tera, the Professor is killed. After a struggle Margaret stabs Tera in the heart, but Tera continues to struggle. Both appear to be unconscious when the tomb-like shrine collapses, as if by earthquake.Later, in the hospital, we see a woman wrapped in bandages. We are told that the woman is the only survivor, with all of the others crushed beyond recognition. In the end, we see the woman open her eyes, and appear to struggle to speak. We are left unsure whether the woman is Margaret or Tera.","language":"English","Critical reception":"AllMovie's review of the film was favourable, commending its \"glamorous style\" and \"creepy atmosphere\".[4] Blood from the Mummy's Tomb currently holds an average three star rating (5.8/10) on IMDb.","blood_from_the_mummy's_tomb":"Theatrical release poster","cinematography":"Arthur Grant","production_company":"EMI-Elstree Hammer Film Productions","directed_by":"Seth Holt Michael Carreras (uncredited)","release_dates":"14 October 1971","Production":"Besides providing a rare leading role for Valerie Leon, the film is notable for its troubled production. Peter Cushing was cast in the film and completed one day's filming before leaving the production after his wife was diagnosed with emphysema. Cushing was replaced by Andrew Keir.[2] The R1 DVD of the film released in the United States by Anchor Bay Entertainment contains still photographs of Cushing's day on the production. Director Seth Holt died of a heart attack five weeks into the six week shoot, collapsing into cast member Aubrey Morris's arms and dying on set.[2] Michael Carreras directed the final week's filming.According to the book Hammer, House of Horror: Behind the Screams by Howard Maxford, the budget for the film was £200,000.[3]The film was shot at Elstree Studios in Hertfordshire.","produced_by":"Howard Brandy","starring":"Valerie Leon Andrew Keir Mark Edwards James Villiers Hugh Burden Aubrey Morris","running_time":"94 min.","music_by":"Tristram Cary","edited_by":"Peter Weatherly","written_by":"Christopher Wicking","budget":"£200,000"}