{"country":"India","distributed_by":"Excel Entertainment","screenplay_by":"Farhan Akhtar Kassim Jagmagia","Plot":"The movie is about three childhood friends, Akash Malhotra (Aamir Khan), Sameer Mulchandani (Saif Ali Khan), and Siddharth \"Sid\" Sinha (Akshaye Khanna) who fall in love. Akash does not believe in the concept of love and does not engage in relationships lasting more than two weeks. Sameer is a genial, well-meaning, desperately romantic, but confused guy who is prone to romantic infatuations and believes to have found true love whenever he gets attracted to a girl. Sid, an artist by profession and the most mature of the three, is not interested in trivial romances and is dedicated to his work.Akash, who is a cad in his personal life, proposes to a girl named Shalini (Preity Zinta) in jest, without being aware that she is engaged to Rohit. He also engineers a breakup between Sameer and his then girlfriend Priya (Suchitra Pillai).The three friends then go to Goa for a vacation. There Sameer falls in love with a foreign lady and while Akash and Sid return, Sameer stays with the lady. However, she turns out to be a cheat and she, along with another man, rob Sameer of his belongings and Sameer is forced to return by lorry. Akash and Sid have a good laugh at his plight.Later, Sameer finds his parents have arranged a meeting with a potential marriage prospect. He resists at first as he does not want an arranged marriage, but the moment he sees the girl, Pooja (Sonali Kulkarni), he realizes that she is \"the one\". Unfortunately, she is in a relationship and Sameer has to be content with just being her friend.Sid befriends and eventually falls in love with Tara Jaiswal (Dimple Kapadia), an older divorcee and alcoholic, who has moved into his neighbourhood and shares his love for art. He decides to keep it from her, suppressing all hopes of a relationship as he knows that she, like most other people in society, would consider this scandalous. When his family and friends start finding out, everything goes wrong. Sid's mother is horrified and wrongly accuses Tara of having led Sid on. Akash makes fun of Sid's true intentions and his offensive remarks create a rift in their friendship. Tara hears that Sid has quarreled with friends and family because of her and feeling that she has ruined his life, refuses to see him.Meanwhile, Pooja breaks up with her boyfriend. Sameer and Pooja finally start going out after she breaks up with her boyfriend, and Sameer eventually proposes to her.When his parents send him to Sydney, Australia to work for the family business, Akash finds he is coincidentally seated next to Shalini. He apologises for his earlier prank and asks her to show him around the new city. Though Shalini is engaged, she agrees and soon finds herself enjoying his company. She tries to find out how he feels, but he holds back. Eventually, she then leaves for India to marry Rohit. Akash tries to let her go, but then realises that he is unable to. He returns to India and proposes to her on the eve of her wedding. She accepts with her family's blessing.Tara has been hospitalized with liver cirrhosis and dies with Sid at her bedside. Sid and Akash finally reconcile. Six months later the three friends go to Goa to rekindle fond memories along with Shalini and Pooja. There, Sid meets an unknown girl (Mandala Tayde), who is also vacationing in Goa with her two friends. They share a smile, implying that Sid is finally moving on from Tara.","language":"Hindi","Reception":"The film received praise from critics for portraying contemporary Indian youth as cosmopolitan and urban. The characters are depicted as upper-class with lavish houses and designer clothes. They attend art exhibitions and performances of Western opera, and travel overseas as a matter of course. Some critics opined that Dil Chahta Hai did not perform well in the non-urban areas because the lifestyle depicted was too city-oriented.[2]Beth Watkins of The Wall Street Journal wrote, \"The mix of humour, emotion, sincerity and wisdom makes “Dil Chahta Hai” a truly enduring film.\"[6] Sita Menon of Rediff.com concluded that the film was \"Slick and witty\".[7]Dil Chahta Hai was screened at the International Film Festival of India, the Palm Springs International Film Festival and the Austin Film Festival.[8][9][10]","box_office":"₹27 crore (equivalent to ₹75 crore or US$11 million in 2016)[1]","cinematography":"Ravi K. Chandran","directed_by":"Farhan Akhtar","release_dates":"10 August 2001","Production":"The movie is partially based on writer-director Farhan Akhtar's diaries on his trips to Las Vegas, his 1996 month-and-a-half long stay at New York, and a storyline narrated to him by a friend.[3] Farhan Akhtar began work on the script in 1998; the relationship of the characters Akash and Shalini was based on a similar experience of one of Akhtar's friends.[4] Other parts of Dil Chahta Hai were adapted from Shakespeare's Much Ado About Nothing.[5]Aamir Khan was initially offered the role of Sid, but he elected to play the role of Akash, for which he grew a soul patch. Abhishek Bachchan was also offered the role of Sid. After he turned it down, Akshaye Khanna accepted the part. Akhtar convinced actress Dimple Kapadia to come out of retirement to play the role of divorcée Tara Jaiswal. After 15 months of extensive pre-production, the film was shot over a four-month period in Mumbai, India and Sydney, Australia.[4]Dil Chahta Hai's style extended to the music and its picturisation. One song sequence recapitulates and, to some extent, parodies Bollywood song-and-dance history. Other songs drop the usual dance accompaniment — one depicts an argument between two protagonists through the song's lyrics, another establishes the character's state of mind through a moody photo collage, while yet another imagines the beautiful and idealised world of an artist in love through a song inside a painting. There is an extended opera sequence at the Sydney Opera House, which was exclusively commissioned for the film.[4]","produced_by":"Ritesh Sidhwani","starring":"Aamir Khan Saif Ali Khan Akshaye Khanna Preity Zinta Sonali Kulkarni Dimple Kapadia","running_time":"184 minutes","music_by":"Shankar–Ehsaan–Loy","edited_by":"A. Sreekar Prasad","budget":"₹14 crore (equivalent to ₹39 crore or US$5.8 million in 2016)[1]"}