{"country":"United States","distributed_by":"TriStar Pictures","Plot":"As law enforcement officers, Adam Mitchell, Nathan Hayes, and their partners are confident and focused. They willingly stand up to the worst the world can offer. Yet when they take off their badges at the end of the day, they face a challenge that none of them are truly prepared to tackle: fatherhood. While they consistently give their best on the job, good enough seems to be all they can muster as dads. But they're quickly discovering that their standard is missing the mark. They know that God desires to turn the hearts of fathers to their children, but their children are beginning to drift further and further away from them. Will they be able to find a way to serve and protect those that are most dear to them? When tragedy hits home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Can a newfound urgency help these dads draw closer to God ... and to their children? Courageous is the fourth release of Sherwood Pictures, the moviemaking ministry of Sherwood Church in Albany, Georgia. Their first release since FIREPROOF, the No. 1 independent film of 2008, Courageous joins Facing the Giants and Flywheel in touching and impacting lives through heartfelt stories of faith and hope. Moviegoers will again find themselves crying, laughing, and cheering-sometimes simultaneously as they are inspired by everyday heroes who long to be the kinds of dads that make a lifelong impact on their children. Protecting the streets is second nature to these law enforcement officers. Raising their children? That will take courage. Courageous ... honor begins at home.","language":"English","box_office":"$34,522,221[2]","cinematography":"Bob Scott","production_company":"Affirm Films Provident Films Sherwood Pictures","directed_by":"Alex Kendrick","Awards":"2012 San Antonio Independent Christian Film Festival2012 Epiphany Prize2012 Grace Award2013 GMA Dove Award","courageous":"Theatrical release poster","release_dates":"August 26, 2011 (2011-08-26) (Atlanta premiere)|September 30, 2011 (2011-09-30) (United States)||||","Production":"The title and plot of Courageous were announced on November 15, 2009 by Alex Kendrick, Michael Catt, Jim McBride and Stephen Kendrick.[4] Sherwood Pictures stated that \"After much prayer, creative brainstorming, more prayer, wise counsel, and still more prayer, Sherwood Pictures is ready to move ahead with their fourth motion picture.\"[5] Before the announcement, the filmmakers launched TheNextSherwoodMovie.com, which contained teasers for Courageous.[6] At the time of the announcement, the Kendrick brothers stated that they had completed \"about 80 percent of the plot\", and they had planned to finish the script by the end of 2009.[7][8]In preceding Sherwood Pictures films, almost all of the cast and crew were composed of members of Sherwood Baptist Church, with Kirk Cameron being the notable exception with his lead role in Fireproof. For Courageous the producers expanded their search for acting talent. Roughly half of the cast are volunteers from the church, but the other half were through invitation-only audition sessions. The lead roles in the film are played by Alex Kendrick and Ken Bevel, both of whom have appeared in past Sherwood productions. Kevin Downes, who has appeared in various other films, played the role of Shane Fuller. Ben Davies, a student athlete at Samford University, played the role of David Thomson. Tony Stallings, former running back and winner of Animal Planet's King of the Jungle reality show, made his film debut.[9]The actors were still volunteers. The film would likely have cost several times more if they had used professional assistance. Director Kendrick said, \"With volunteers no one is watching the clock and we're all in it together.\"[10]Principal photography of Courageous began on April 26, 2010 and concluded on June 25, 2010. The majority of the film was shot in Albany and the Dougherty County, Georgia area. Some scenes were shot in the Dougherty County Jail.[11] More than 170 media outlets, such as Inside Edition, visited the set.[12] The Duggar family from TLC's 19 Kids and Counting were extras during a father-son 5K race. Jim Bob Duggar and seven of his ten sons joined hundreds of other fathers and sons in filming the scene.[13] Their involvement in the film was shown on 19 Kids and Counting[14] in \"Duggars go Hollywood\". The Duggar daughters acted as extras in a funeral scene at Sherwood Baptist Church that involved several police officers in uniform.In order to enhance the quality of the film, the production crew is using a new camera technology, \"Red One\", by the Red Digital Cinema Camera Company. Kendrick estimated the production budget would exceed $1 million — double that of Fireproof.[15] The final budget has been reported at $2 million.[1]","produced_by":"Stephen Kendrick","starring":"Alex Kendrick|Ken Bevel|Kevin Downes|Ben Davies|Robert Amaya|Renee Jewell|Elanor Brown|Taylor Hutcherson|Angelita Nelson|Donald Howze|Tony 'T.C.' Stallings|","running_time":"130 minutes","music_by":"Mark Willard","edited_by":"Alex Kendrick","Release":"In December 2010, the Motion Picture Association of America rated the film PG-13 for \"some violence and drug content\".[2] That rating was surrendered a few days later, but was later reinstated. Courageous is the first film by Sherwood Pictures to receive a PG-13 rating.The contemporary Christian band Casting Crowns released a song titled \"Courageous\" to promote the film with a video featuring scenes from it.Tony Dungy, a Super Bowl-winning football coach, mentioned the film in an article he wrote about fatherhood for USA Today. He said, \"As men, we could all take a lesson from [the fathers in Courageous] and ask ourselves, 'What can I do today to be a more involved dad?'\"[16]Courageous was released on September 30, 2011 to 1,161 theaters,[10] grossing $3.1 million on its opening day and debuting in fourth place with an actual gross of $9,063,147 for the opening weekend,[17] the best opening of all new films released that weekend.[17] It sold over $2 million in pre-sale tickets,[18] the most of the weekend on Fandango, beating out The Lion King 3D, Moneyball, Dolphin Tale, and Drive.[19]After its opening weekend, Entertainment Weekly wrote, \"...Courageous is the real success story of the weekend...Courageous earned a strong $8.8 million, outdoing the $6.8 million opening of Sherwood's 2008 picture Fireproof, which became the highest-grossing independent film that year with $33.5 million total. Shown in 1,161 theaters (yet, notably, just one theater in Manhattan), Courageous earned the best per theater average of any wide release with a robust $7,580.\"[1] Courageous beat out all three Hollywood movies which opened on the same weekend: 50/50, What's Your Number?, and Dream House, which were produced with budgets of $8 million, $20 million, and $50 million, respectively.[1] According to Box Office Mojo, its opening weekend ranks fifth all-time among Christian movies, behind The Passion of the Christ and the three Chronicles of Narnia films.[3]As of December 11, 2011, the film has grossed $33,333,639, over 16 times its budget.[2]After the Kendrick brothers' previous films were released to DVD following the theatrical run, the film started an international theatrical roll-out which began November 10 in Argentina, Australia, and New Zealand. The film debuted at #18 in Argentina, #16 in Australia and #21 in New Zealand, with weekend opening grosses of $19,536, $107,781, and $10,529 respectively. The film opened in Mexico on December 2, ranking 31st with a total of $6,911 from 15 screens. As of December 4, the international gross for the movie is $219,977.The film received mixed reviews from critics, but has received a rare \"A+\" rating in audience polls conducted by CinemaScore.[3] Review aggregation website Rotten Tomatoes gives the film a score of 30% based on reviews from 20.[20] On Metacritic, the film holds a score of 42/100 based on 10 reviews.[21]Roger Moore of the Orlando Sentinel, gave the film a mediocre review, saying \"the film travels far beyond its dramatic climax, aiming for an altar call finale.\"[22] Kam Williams of NewsBlaze gave the film four stars, saying the film was a \"moving, modern parable not to be missed by anyone who's always wondering why they don't make wholesome movies with uplifting messages anymore.\"[23] Frank Scheck of The Hollywood Reporter said Courageous demonstrated the Kendrick brothers' \"growing expertise as filmmakers with its skillful blending of moving drama, subtle comedy and several impressive action sequences, including a well-staged foot chase and a harrowing shootout between the cops and bad guys.\"[24] Hannah Goodwyn of the Christian Broadcasting Network rated Courageous 3 out of 5, saying \"Courageous' biblical message is clear and good. Unfortunately, its delivery is weakened by some rookie acting and excessive dialogue.\"[25] Adam R. Holz of Focus on the Family Plugged In Online said Courageous has \"A compelling story line with plenty of action and just the right amount of humor. The Film underscores the importance of fatherhood...plus I like how it creatively weaves in the Gospel. I am happily giving Courageous 4.5 shiny badges out of 5 for family friendliness.\"[26]Alex Kendrick and Robert Amaya were nominated at the 20th Annual Movie Guide Awards under the category of Most Inspiring Performance in Movies in 2011, with Kendrick winning and the film was named the Most Inspiring Movie of 2011.[27]The film was released on DVD and Blu-ray on January 17, 2012 as an \"Exclusive Collector's Edition\" and was #1 in disc sales in the US the week ending January 22, 2012 according to The Hollywood Reporter.[28] According to the www.the-numbers.com DVD and Blu-ray sales as of May 2015 totaled over $23,000,000.","written_by":"Alex Kendrick Stephen Kendrick","budget":"$2 million[1]","Related media":"Two film tie-in books were written for Courageous; \"The Resolution for Men\" by Stephen and Alex Kendrick, and \"The Resolution for Women\" by Priscilla Shirer.[29] \"Courageous Living\" by Michael Catt, \"Rite of Passage\" by Jim McBride, and a film novelization by Randy Alcorn were also released."}