{"based_on":"Doctor Strange  by Steve Ditko","Cast":"Additionally, Benedict Wong portrays Wong,[26] who the actor described as \"one of the masters of sorcery\" and \"more of a drill sergeant to Kamar-Taj\", rather than \"the tea-making manservant\" to Strange that he is depicted as in the comics.[27] Amy Landecker and Scott Adkins have been cast in undisclosed roles.[28][29]","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Jon Spaihts|Scott Derrickson|C. Robert Cargill|","doctor_strange":"Teaser poster","language":"English","Premise":"After Stephen Strange, the world's top neurosurgeon, is injured in a car accident that ruins his career, he sets out on a journey of healing, where he encounters the Ancient One, who later becomes Strange's mentor in the mystic arts.[3][4]","cinematography":"Ben Davis","production_company":"Marvel Studios","directed_by":"Scott Derrickson","Music":"In May 2016, Michael Giacchino revealed that he would score the film.[105]","release_dates":"November 4, 2016 (2016-11-04) (North America)|||||","Production":"I think when you consider the work that I've done it makes sense that he'd be my favorite comic book character, at least in the Marvel universe. Probably the only comic character in that mainstream world that I'm suited to. I feel such an affinity for the character and the story and the ambition of those comics, especially the original Stan Lee and Steve Ditko Strange Tales – I think those are my favorite of all of them. The entire history of the comics is extraordinary.Doctor Strange was initially listed as being in pre-production in 1986, with a script by Bob Gale.[31] For unknown reasons Gale's film never went further into production,[32] and by 1989, Alex Cox had co-written a script with Stan Lee. The script had Doctor Strange traveling to the Fourth Dimension, before ending up on Easter Island, where he would face Dormammu. Cox and Lee's script was almost made by Regency, but at the time, Regency Films were distributed by Warner Bros., who was in a dispute with Marvel over merchandising, so the film did not proceed further.[33] By December 1992, Wes Craven signed to write and direct, with Savoy Pictures distributing,[34] and a release set for either 1994 or 1995.[35] David S. Goyer had completed a script in 1995 for the film.[36] By April 1997, Columbia Pictures had purchased the film rights and Jeff Welch was working on a new screenplay, with Bernie Brillstein and Brad Grey producing.[37]By April 2000, Columbia dropped Doctor Strange, which then had Michael France attached to write a script and interest from Chuck Russell and Stephen Norrington to direct.[38] By June 2001, Dimension Films acquired the film rights, with Goyer back on board as writer and director. Goyer hinted scheduling conflicts might ensue with a film adaptation of Murder Mysteries,[39] and promised not to be highly dependent on computer-generated imagery.[36] However, by August 2001, Miramax Films acquired the film rights from Dimension,[40] and by March 2002, Goyer had dropped out of the project.[41] A 2005 release date was announced the next March,[42] while in June 2004, a script still had yet to be written. Marvel Studios CEO Avi Arad stated, \"We are nowhere with that. That's a tough one to write, but we are working on it. We are trying to find the real Jerry Garcia of the writing community.\"[43] In April 2005, Paramount Pictures acquired Doctor Strange from Miramax, as part of Marvel Studios' attempt to independently produce their own films. At the time, the film was projected to have a budget of no more than $165 million.[44]In March 2009, Marvel hired writers to help come up with creative ways to launch its lesser-known properties, such as Black Panther, Cable, Doctor Strange, Iron Fist, Nighthawk and Vision.[45] In June 2010, Marvel Studios hired Thomas Dean Donnelly and Joshua Oppenheimer to write Doctor Strange.[46] While promoting for Transformers: Dark of the Moon in April 2011, actor Patrick Dempsey indicated he was lobbying to play the title character.[47] In January 2013, Marvel Studios president Kevin Feige confirmed that Doctor Strange would appear in some capacity as part of \"Phase Three\" of the Marvel Cinematic Universe.[48] Feige reiterated that a Doctor Strange feature film was in development at Marvel Studios that May,[49][50] and again in November.[51]In February 2014, The Hollywood Reporter reported that Marvel was considering Mark Andrews, Jonathan Levine, Nikolaj Arcel and Dean Israelite to direct the film, and was considering Jonathan Aibel and Glenn Berger to rewrite the film's script.[52] Feige confirmed that Marvel was considering prospective candidates, but stated \"That article [from The Hollywood Reporter] was not true about who we're meeting or what level anybody is.\"[53] By March the list of directors that Marvel was considering included Andrews, Levine, and Scott Derrickson.[54] Feige also described how magic would be represented in the film, saying, \"You don't get into it in Harry Potter, but if a scientist went to Hogwarts he'd find out how some of that stuff is happening! We're not going to spend a lot of time on that, but there will be some of that. And particularly for a character like Strange, who goes from a man of science to a man of faith and who traverses both worlds.\" Feige added that \"Doctor Strange needs to be a Ditko/Kubrick/Miyazaki/The Matrix mind-trip.\"[55]In April 2014, Feige stated that Doctor Strange would be the \"doorway\" into the supernatural side of the Marvel Cinematic Universe.[56] He expanded on this in July 2014, saying, \"Now, what is the definition of \"supernatural\"? It varies. We like the idea of playing with alternate dimensions. [Doctor] Strange, in a very [Steve] Ditko, crazy astro-trip way, traveling through dimensions and traveling through other realms is something we think is very cool. And playing with perceptions of reality...We’re [also] going to play a lot with the notion of [physics and quantum mechanics] as an explanation for how the sorcerers do what they do.\"[57] Feige later revealed that the Dark Dimension would be seen in the film.[58][59]In June 2014, Derrickson was chosen to direct the film,[60] Marvel had been looking at Tom Hardy, Benedict Cumberbatch, and Jared Leto as leads in the film,[61][62] and Jon Spaihts entered negotiations to rewrite the script.[62] In confirming the hiring of Derrickson, Feige stated that casting would begin in July or August and added that production was expected to begin in early 2015, saying, \"Strange is very, very important, not just because it's an amazing character study, and a journey of a man who's gone from this very arrogant surgeon to somebody who is quite zen and literally keeps all of reality together on a daily basis, but it also is going to open up a whole other side of storytelling for our movies.\"[63] Later in the month, Édgar Ramírez, who worked with Derrickson in 2014's Deliver Us from Evil, stated that he had conversations with the director about a role in Doctor Strange.[64]In July, Feige stated that the announcement of the lead role would happen \"relatively quickly\",[65] and by the end of the month Joaquin Phoenix entered talks to play the character.[66][67] By September 2014, Marvel Studios was in negotiations to shoot Doctor Strange at Pinewood-Shepperton in the UK, with crews being assembled for a move into Shepperton Studios in late 2014/early 2015 to begin filming in May 2015.[68] Negotiations with Phoenix ended in October 2014,[69] with Phoenix stating that one of the reasons he declined the role was that blockbuster films would never be \"fulfilling\", with \"too many requirements that went against [his] instincts for character.\"[70] Marvel placed Cumberbatch, Leto, Ethan Hawke, Oscar Isaac, Ewan McGregor, Matthew McConaughey, Jake Gyllenhaal, Colin Farrell, and Keanu Reeves on their shortlist for Doctor Strange,[71][72] though Reeves was not approached about the role,[73] while Ryan Gosling had discussions to play the character.[74]By the end of October, Cumberbatch entered negotiations to play the character,[75] and in December was officially cast in the role,[5] despite having previously stated at the 2014 San Diego Comic-Con International that he would have been unable to accept the role if offered due to commitments with other projects.[76] Spaihts was also confirmed to be writing the screenplay.[5] On casting Cumberbatch, Feige said, \"He was someone that we were very interested in for a very long time\", but his conflicts presented a challenge. After looking at other actors, Marvel kept returning to Cumberbatch and decided to shift the production schedule to fit within Cumberbatch's commitments.[77] With the shifting production schedule, Derrickson brought his Sinister co-writer C. Robert Cargill onto the film to work with him on the script;[25] Cargill revealed his involvement on the project a year later.[78] Cargill stated that both he and Derrickson were initially approached to work on the film as writers, along with Derrickson directing, but Marvel realized they would not have been able to reach their intended release date of July 2016 if Derrickson wrote and directed, resulting in them hiring Spaihts, and passing on Cargill, to allow Derrickson to focus on the film's pre-production. Describing the film, Cargill called it both a superhero film and a fantasy film, saying \"it's a very magical fantasy universe, but at the same time it plays by some of the superhero tropes that people enjoy.\"[25]In January 2015, Cumberbatch said Doctor Strange would be different from Marvel's previous films explaining, \"It's an Astral Plane. There's a huge new element to this Marvel universe that's going to be employed in building this story and this character.\"[7] Chiwetel Ejiofor entered into preliminary talks with Marvel for a role in the film,[79] later revealed to be Baron Mordo.[11] In April 2015, Derrickson and members of the production team visited New York City to scout potential locations to shoot for the film, while Feige revealed that filming would begin that November.[80] By May, Tilda Swinton was in talks with Marvel to play the Ancient One.[20] In June 2015, Derrickson announced he was heading to London to begin work on the film,[81] and Feige confirmed that Strange's Sanctum Sanctorum would appear in the film, to be located on Bleecker Street in New York City's Greenwich Village as in the comics.[23] Swinton confirmed she would portray the Ancient One in July,[82] and by the end of the month Rachel McAdams was being considered for the female lead, though she cautioned that \"it's still super-early, and I don't know where that's gonna go, if it's gonna go anywhere at all.\"[83]In August 2015, cinematographer Ben Davis, who also worked on Guardians of the Galaxy and Avengers: Age of Ultron, described the film as \"Marvel's Fantasia\" stating, \"It has a very psychedelic grounding, and it's not your typical Marvel action movie... There's a lot of previsualization, and there's a lot of work which is very hard – you look at it and you see the imagery that they've created for it and you think, 'Well how the hell do we shoot that!?' because it's all sort of Escher stuff.\"[84] Ejiofor was confirmed as Baron Mordo during the 2015 D23 Expo,[12] and by the end of August Mads Mikkelsen entered into early negotiations to play a villain in the film,[85] though Deadline.com noted \"those talks are at a very very preliminary stage\" and Mikkelsen was \"but one of a number of actors being considered for the unspecified villianous role.\"[86] During the 2015 Toronto International Film Festival, McAdams confirmed that she would star in the film.[14]In September 2015, James Gunn, director of Guardians of the Galaxy and its sequel, revealed that many of the crew that worked on the first Guardians film were unable to work on the second because they had committed to Doctor Strange.[87] At the end of the month, Feige stated additional casting announcements would be made \"before the end of the year.\"[88] By early November, Michael Stuhlbarg entered negotiations to appear in the film as Nicodemus West, a rival scientist of Strange.[16]Principal photography began in Nepal on November 4, 2015, under the working title Checkmate,[89][90] with filming in and around the Kathmandu Valley, including: the Pashupatinath and Swayambhunath Temples;[91][92] Thamel and New Road in Kathmandu;[93] and the Patan Durbar Square in Patan.[94][95] Production moved to Longcross Studios in the United Kingdom on November 11,[96] and was scheduled to stay there until March 2016.[97] Also in November, filming took place in New York City's Hell's Kitchen neighborhood,[89] while additional footage was shot at Pinewood-Shepperton and Shepperton Studios in the UK for scenes set in New York City.[68][98] Ben Davis served as cinematographer and used the Arri Alexa 65 on the film.[99]By the end of November, Mikkelsen and Stuhlbarg were confirmed to have been cast,[2] alongside Amy Landecker and Scott Adkins in unspecified roles.[29][28] In January 2016, filming took place at Exeter College in Oxford and Benedict Wong was cast as Wong, Strange's valet.[90][26] In February, scenes were shot on the streets of London to again replicate a New York City setting,[100] before production moved to New York City's Flatiron District in April.[98] Filming was also expected to take place in Hong Kong.[2] Principal photography wrapped in New York City on April 3, 2016.[101]In April 2016, Derrickson revealed that Gunn provided notes on the script, beyond the general conversing the MCU directors have between themselves for their films.[102] Regarding the use of 3D in the film, Feige stated, \"sometimes 3D is a tool... another toy in the sandbox of how [directors] can present [a] movie, then there are times... that it serves the storytelling, that it advances the storytelling. [That's] certainly gonna be the case with Doctor Strange. And hopefully it helps bend people’s minds even more than with just the flat screen.\"[103] Visual effects were provided by Luma Pictures.[104]","produced_by":"Kevin Feige","starring":"Benedict Cumberbatch|Chiwetel Ejiofor|Rachel McAdams|Michael Stuhlbarg|Mads Mikkelsen|Tilda Swinton|","Future":"In April 2016, co-writer Cargill stated that Marvel felt some initial ideas for the film from him and Derrickson highlighted too much of the \"weird stuff\" associated with the character to feature in an origin story, but told the duo to hold onto them for potential future films.[25]","music_by":"Michael Giacchino","edited_by":"Wyatt Smith[1]|Sabrina Plisco[2]|","Release":"Doctor Strange is scheduled to be released in New Zealand on October 20, 2016,[106] followed by a release on October 28 in the United Kingdom,[107] and November 4, in North America in 3D and IMAX 3D.[108][109] It was previously reported to have been scheduled for a July 8, 2016 release,[110] which Cargill later confirmed was the film's intended release date.[25]In August 2015, a concept art trailer narrated by Derrickson was shown at the D23 Expo. The images showed artwork of Cumberbatch in a traditional Doctor Strange outfit from the comics, as well as a rough sequence of the plot, highlighting points such as Strange's accident, his journey for healing, and fighting Ejiofor as Mordo. The trailer was met with \"a very big reaction from the gathered crowd.\"[111] On April 12, 2016, the first teaser trailer for the film debuted on Jimmy Kimmel Live!.[112][113] Clark Collis of Entertainment Weekly noted that the \"series of kaleidoscopic, world-bending scenes\" featured in the trailer were \"reminiscent of Christopher Nolan's Inception.\"[113] Scott Mendelson of Forbes agreed with Collis' note of the similarity to Inception, while also feeling the structure of the trailer \"resemble[d] some of the early Batman Begins marketing.\"[114] The Hollywood Reporter's Graeme McMillian was more critical of the trailer, saying, \"It was hard to shake the feeling that we've seen all of this somewhere before.\" McMillian pointed out how the trailer seemed to borrow elements from Inception, The Matrix, Batman Begins and Cumberbatch's American accent sounding like Hugh Laurie's Gregory House from House. He added, \"None of this is necessarily a real problem, of course... [however] there's nothing there outside the derivative aspects: due to the nature of the trailer, there's no story beyond the 'white man finds enlightenment in Asia' trope and barely any dialogue — nothing from anyone outside of Swinton and Cumberbatch — to let audiences decide that maybe the performances will elevate the material.\" McMillian did enjoy the visual effects and the visual of \"Tilda Swinton literally knock[ing] Benedict Cumberbatch's soul out of his body,\" but concluded, \"as an introduction to not only a brand new franchise for Marvel, but a potential new genre, this feels far less bold and assured\" than the first trailer for Guardians of the Galaxy.[115] In September 2016, behind the scenes footage will be released as a special feature on the Captain America: Civil War BIu-ray.[116]"}