{"country":"Australia","language":"English","Reception":"The Rotten Tomatoes Want-To-See score is currently 79%, but no official approval rating has been announced to this day. Only two film critics have posted reviews on the site, both positive. Urban Cinefile Critics commented \"Displaying about equal amounts of naiveté, passion and talent, Beneath Clouds establishes Sen as a filmmaker of considerable potential\". Andrew Howe of eCritic.com called it \"One of the few feature films to canvass the issues facing the Aboriginal community from an adolescent perspective\".","box_office":"A $548,416 (Australia)","cinematography":"Allan Collins","directed_by":"Ivan Sen","Plot synopsis":"Lena has an absent Irish father she longs to see and an Aboriginal mother she finds disgusting. When she breaks away, she meets up with petty criminal Vaughn who's just escaped from low security prison to reluctantly visit his dying mother. Blonde and light-skinned, Lena remains in denial about her Aboriginal heritage; Vaughn is an angry young man with a grudge against all whites. An uneasy relationship begins to form as they hit the road heading to Sydney, taking them on a journey that's as emotional as it is physical, as revealing as it is desperate.Initially the two reluctant travelling companions are suspicious and wary of each other, but their journey, mostly by foot and the odd lift, builds an understanding between them. The film follows its creator's (Ivan Sen's) own experiences growing up in Inverell, NSW with an Aboriginal mother and a European father who was not around.","release_dates":"2002","Production":"The film was financed by the New South Wales Film Commission and the Australian Film Finance Corporation.","Box office":"Beneath Clouds grossed $548,416 at the box office in Australia.[1]","produced_by":"Teresa-Jayne Hanlon","starring":"Dannielle Hall Damian Pitt","running_time":"90 minutes","beneath_clouds":"DVD cover","music_by":"Ivan Sen Alister Spence","External links":"Beneath Clouds at the Internet Movie DatabaseBeneath Clouds at Anything Oz or New Zealand film and television web site.","edited_by":"Karen Johnson","written_by":"Ivan Sen","budget":"A$2.5 million"}