{"a_walk_on_the_moon":"Theatrical release poster","country":"United States Australia","distributed_by":"Miramax Films","Plot":"Pearl Kantrowitz (Diane Lane) and her husband Marty (Liev Schreiber) are a lower middle class Jewish couple in New York City, where Marty is a television repairman. The movie begins with the couple and their family including their teenage daughter Alison (Anna Paquin) and young son Danny (Bobby Boriello) and Marty's mother Lillian (Tovah Feldshuh) going to their summer camp retreat, Dr. Folger's Bungalows, which they attend each summer.Marty is forced to work away from home and hence, he only visits the family on weekends. This leaves Pearl feeling lonely and isolated. Pearl got pregnant at the age of 17 and she feels she missed enjoying her youth. With the absence of Marty, Pearl is attracted to the new \"Blouse Man\" Walker Jerome (Viggo Mortensen). Meanwhile, Alison is neglected and she experiences her first period, her first date, and her first kiss as she enters a relationship with another boy at the camp, Ross Epstein.Marty is unable to visit the family because he has to repair more TV sets than usual, due to the impending moon landing. While the whole town celebrates the historic moonwalk, Pearl has sex with Walker. Marty's mother Lillian learns of the affair and tries to persuade Pearl to break it off. The affair continues when Marty cannot get up to visit on the weekend because of the traffic jam caused by the Woodstock festival, which is within walking distance of the bungalow colony. Pearl goes to the festival, and unbeknownst to her, Alison goes as well with Ross and her friends despite her mother previously forbidding it. Alison becomes upset after seeing Pearl and Walker carousing while on LSD.Marty learns of the affair and confronts Pearl while Alison confronts her mother in an emotional scene. Pearl is forced to deal with her love of her family and her conflicting yearning for marital freedom.Pearl finally makes her decision to stay with Marty and tells Walker she cannot go away with him. Walker says he understands. The final scene shows Pearl and Marty dancing together, first to Dean Martin's \"When You're Smiling\" and then to Jimi Hendrix's \"Purple Haze\", after Marty changes the station.","Critical reception":"The movie received a generally favorable reception among critics. The Rotten Tomatoes website found that 72% of critics gave the film a positive review. Diane Lane's performance earned her an Independent Spirit Award nomination for Best Female Lead.Entertainment Weekly ranked it #9 on their \"50 Sexiest Movies Ever\" poll,[1] but The Washington Post found it \"a little too perfect and symbolically signposted for its own good\".[2]","box_office":"$4,750,660","cinematography":"Anthony B. Richmond","production_company":"Village Roadshow Pictures","directed_by":"Tony Goldwyn","release_dates":"April 2, 1999","produced_by":"Jay Cohen Tony Goldwyn Lee Gottsegen Dustin Hoffman Neil Koenigsberg Murray Schisgal","starring":"Diane Lane Viggo Mortensen Anna Paquin Liev Schreiber Tovah Feldshuh Star Jasper","running_time":"107 minutes","music_by":"Mason Daring","edited_by":"Dana Congdon","written_by":"Pamela Gray","budget":"$14 million"}