{"Cast":"While many of the actors are unknown to American audiences, Chronicle of a Death Foretold has a cast of international European stars. The film displays the talent of the veterans Irene Papas and Gian Maria Volontè. However, the casting was notable for its use of upcoming young European actors: Ornella Muti, as the beautiful and mysterious Angela Vicario who motivates the drama, Anthony Delon (son of Alain Delon) as the man she falls for, and the then unknown Rupert Everett.","country":"Italy France Colombia","DVD release":"Chronicle of a Death Foretold is available in Region 4 DVD, it can also play in region 1. Audio in Spanish, but no English subtitles.","Plot":"Cristóbal Bedoya, a medical doctor, returns to his hometown, a small Colombian city in the banks of the Magdalena river, after being away for twenty seven years. At the local cemetery, he visits the grave of Santiago Nasar, his best friend, who was murdered almost three decades ago. Still haunted by the past, Cristóbal attempts to revisits the event that lead to his friend's murder talking with those close to Santiago. Their memories take them to the time of the crime.On the day he was eventually killed, Santiago Nasar had a dream about birds that his mother mistakenly took as a good omen of good health. Six months before, a handsome, young foreigner arrives to the town. His name is Bayardo San Román. Little is known about him except that he is very rich and in want of a wife. Bayardo is soon smitten by the extraordinary beauty of a local girl, Angela Vicario. She is uninterested in his advances, but Bayardo does whatever it takes to win her approval by showering her with gifts. The next time Bayardo sees her, she is selling tickets for a raffle at a town event. He buys all of the remaining tickets and wins a music box, which he then has delivered to her house as a gift. Bayardo asks Angela what house she likes best, and she replies that she likes the one that belongs to the widower Xius. The widower insists that the house is not for sale, but Bayardo keeps offering more and more money until Xius gives in.When Angela protests to her parents that she does not love Bayardo, her mother dismissed her argument, telling her that love can be learned. Pressured by her family, she yields and the couple get married with a lavish party. On the wedding night, Bayardo discovers that Angela is not a virgin and returns her to her bewildered family. Angela is beaten by her mother until she is forced to confess who the man who took her virginity was. She says that it was Santiago Nasar. Angela’s brothers (who are twins) are forced by local custom to avenge the honor of the family, by taking Santiago’s life.The murder takes place the day after the wedding, when the town is in turmoil waiting for the visit of the bishop who is crossing the city by the river. The twin brothers, Pablo and Pedro Vicario, are reluctant to commit the crime, but they have no other choice, they must kill the man who took their sister’s honor. They are quite open about their intentions and the rumor about what is about to occur spreads through the town. The twins, with knives wrapped in newspaper, wait for Santiago to appear in Clotilde Armenta's shop, who gives them rum, hoping to make them so drunk that they will be unable to commit the killing. Eventually, many people learn of the murder plan, but nobody does anything to stop the brothers, or warn Santiago. People in the town are divided into three sides. Those who think that the brothers are kidding, people who know what is going to happen and think that the tragedy must be stopped, and local authorities who fail to exercise their duties and prevent the murder from occurring. It seems that people choose to keep Santiago in the dark and allow the tragedy to happen.Flora, Santiago’s girlfriend, is upset and humiliated when she learns the accusation and about the death threats. When Santiago comes to see her, still clueless as to the Vicario's intentions, she is furious. She tells him that she hopes they kill him, and she goes into her room and locks the door. Flora’s father tells him that the Vicarios want to kill him. Santiago leaves the house, and starts to head home. When Santiago appears by the plaza, he is prevented by Clotilde who yells at him to run for his life. Santiago is unarmed, so he tries to find refuge in his house. However, his mother locks the door because she thinks that he is inside. The Vicario twins stab him and kill him in the main square.There is no evidence that Santiago had taken Angela’s virginity. They were never seen together. It is widely believed in town that Angela was protecting the real culprit. However, during the investigation after the murder, and even when she is questioned again 27 years later by Cristóbal, she never changes her story, she still claims that Santiago Nasar was her \"perpetrator\".Angela, who up until her marriage was not in love with Bayardo, falls hopelessly in love with him after the tragic wedding night. From then on and for many years, she writes love letters to him weekly, but she never hears from him. Then, halfway through a day, Bayardo comes back to her unexpectedly. He leaves a trail with the unopened letters she has sent him, Angela follows them and they are reunited.","language":"Spanish","Reception":"The film was released as the opening film at the 1987 Cannes Film Festival[1] which Anthony Delon attended with co-stars Rupert Everett and Ornella Muti. The film was a critical success in Latin America and Europe but was snubbed by critics in France.[citation needed]","cinematography":"Pasqualino De Santis","directed_by":"Francesco Rosi","release_dates":"8 May 1987 (France)","produced_by":"Yves Gasser","starring":"Ornella Muti Rupert Everett Anthony Delon Gian Maria Volontè Sergi Mateu","running_time":"107 minutes","music_by":"Piero Piccioni","edited_by":"Ruggero Mastroianni","chronicle_of_a_death_foretold":"Italian theatrical release poster","written_by":"Tonino Guerra"}