{"country":"United States France","distributed_by":"Hansen Entertainment","Plot":"Alexander Villard is a former fencing champion who runs a highly competitive fencing school. One of his students describes him as \"a freak who thinks he's living in the fourteenth century\".[3]Max Suba is an ex-convict who introduces himself as a fencing instructor. Villard initially gives him a job as a janitor. With time, Suba recovers his lost form and shows that he can fence. Villard has Suba spar with an ambitious student to demonstrate a point. Villard is \"arrogant but not unkind\",[4] and eventually gives Suba a chance to teach, assigning him the beginning students.While Villard takes a ruthless approach, encouraging a student to injure an opponent to win, Suba takes a subtler approach, encouraging students to turn their own weaknesses into strengths. Following this advice, one of Suba's beginning level students scores against Villard's prize fencer during an in-school competition. Flashbacks further develop the conflict by revealing how Suba had killed Villard's father in a fencing duel. The film climaxes in a dramatic duel between Villard and Suba.","language":"English","Cast and crew":"The film's featured stars are Abraham and Roberts as Suba and Villard respectively. Abraham had won an Oscar for his work in Amadeus in 1984, and Roberts had been nominated for Best Supporting Actor in 1985. The film also credits Mia Sara as Erin Clavelli and Christopher Rydell as Jim Trebor, both students at the fencing school. Mia Sara is best known for her role as Ferris Bueller's girlfriend in Ferris Bueller's Day Off.Elaine Kagan plays Rachel, Suba's romantic interest. Brett Cullen, who has appeared in Lost and The West Wing, plays fencing instructor Danny Gallagher. Other students are played by Doug Wert and Stephen Polk. In her second film appearance, Eve Kagan plays Gallagher's daughter. (Her first appearance had been in 1989, in a film also directed by Kagan.)Bill Conti composed the score. Conti had won an 1983 Oscar for the score to The Right Stuff, and is famous for the themes for the movie Rocky and For Your Eyes Only. The score was performed and recorded by classical Guitarist Angel Romero.Jeremy Kagan was a prolific television director. For his work with the Chicago Hope episode Leave of Absence, he won an Emmy Award for Outstanding Directing for a Drama Series in 1996.","Reception":"The film has received nearly opposite reviews. Roger Ebert says \"the movie adds some supporting characters in order to show us things about fencing that we didn't know\",[4] but another reviewer finds the minor characters \"unnecessary\" and \"thinly drawn\", so \"the film suffers whenever the plot focuses on them\".[8]Although Chicago Reader critic Jonathan Rosenbaum says the film \"suffers from overdone, mannerist performances by the two leads\",[1] another reviewer says \"the key to this film resides in the performances by Eric Roberts and F. Murray Abraham\".[8] The film develops Suba's character in particular, revealing a past that \"he seems unable to completely let go of.\"[8] Ebert says of the lead actors: \"they create characters much more interesting and dimensional than this thin screenplay really requires.\"[4]The most consistent point noted in review is poor screenplay and directing. New York Times critic Vincent Canby calls the screenplay \"nonsense\", saying bluntly: \"the screenplay is terrible, full of unfinished subplots and lines that appear to announce its essential aimlessness.\"[2] Regarding one of the more important subplots, a critic wrote: \"Sadly, Kagan a routine television and film director adds nothing to the intriguing notion of a man who's spent half his life in prison returning to the scene of his crime.\"[9]Although one critic calls the many flashbacks \"a further directorial flourish\", they are still at best an \"interesting idea that isn't really successfully pulled off.\"[8] While the action sequences are \"well handled\",[1] Canby says \"the drama is fraught with anticlimax.\"[2] Overall, the plot is full of \"sports clichés\",[8] could \"as well have been about croquet\",[2] and is \"a little too neat and obvious to really carry the material.\"[4] One review says: \"Right down to the painful fencing-to-disco-music routine, this is embarrassingly fab.\"[3]","box_office":"$6,220","cinematography":"Arthur Albert","directed_by":"Jeremy Paul Kagan","by_the_sword":"Promotional Poster","release_dates":"October 7, 1992 (1992-10-07) (France)|May 14, 1993 (1993-05-14) (Chicago)||||","produced_by":"Marlon Staggs Peter E. Strauss","starring":"F. Murray Abraham Eric Roberts","running_time":"91 minutes","music_by":"Bill Conti","edited_by":"David Holden","Release":"By the Sword was shown at the Vancouver International Film Festival in October 1991. It subsequently appeared at the American Film Market in Santa Monica in late October of the same year, and at the Palm Springs International Film Festival in January 1992.[5] It was released in France under the title \"Par l'épée\" on October 7, 1992.[6]In the US, the film opened in Chicago on May 14, 1993; in Los Angeles on September 24, 1993; and in New York City on October 22, 1993.[5] According to Box Office Mojo, in its September run the film was shown in nine theaters and grossed $6,220.[7]The film's cinematic poster was created by John Alvin, who was known for his work on the posters for Blazing Saddles and E.T. the Extra-Terrestrial, among others.The film was released on VHS in 1994 as a Columbia TriStar home video.","written_by":"John McDonald James Donadio"}