{"based_on":"Butterfield 8  by John O'Hara","country":"United States","butterfield_8":"Theatrical release poster by Reynold Brown","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Gloria Wandrous (Elizabeth Taylor) wakes up in the apartment of wealthy executive Weston Liggett (Laurence Harvey) and finds that he has left her $250. Insulted, Gloria, whose dress is torn, takes Liggett's wife Emily's (Dina Merrill) mink coat to cover herself and scrawls \"No Sale\" in lipstick on the mirror. But she orders her telephone answering service, BUtterfield 8, to put Liggett through if he should call.Gloria visits a childhood friend, pianist Steve Carpenter (Eddie Fisher), in his Greenwich Village apartment. He chastises Gloria for wasting her life on one-night stands, but agrees to ask his girlfriend Norma (Susan Oliver) to lend her a dress. Gloria leaves, whereupon Norma jealously gives Steve an ultimatum: he must choose between her and Gloria. While they are arguing, Steve accidentally refers to Norma as Gloria.Liggett takes a train to the countryside where his wife Emily is caring for her mother. A friend, Bingham Smith (Jeffrey Lynn), advises him to end his adulterous relationships and return to Bing's law firm instead of working for the chemical business of Emily's father. Meanwhile, Gloria lies to her doting mother Annie (Mildred Dunnock), claiming to have spent the night at Norma's. A neighbor, Fanny Thurber (Betty Field), insinuates that Gloria spends many nights in \"less than virtuous\" circumstances, though Annie is oblivious to the insults.Liggett returns home. Finding the lipstick and money, he phones Gloria to explain the money was meant for her to buy a new dress, to replace the one that he had torn. While drinking later that night, Liggett advises her to ask a high price for her lovemaking talents, prompting Gloria to jam her stiletto heel into his shoe. She insists she does not take payment from her dates and claims she has been hired as a model to advertise the dress she is wearing at three different bistros that very night. Liggett follows her and watches Gloria flirt with dozens of men at several clubs. He drives her to a run-down motel owned by a middle-aged female ex-vaudevillian called Happy (Kay Medford). After sleeping together, Liggett and Gloria decide to explore their relationship further.Steve invites Norma over to his house, making her assume that he has chosen her over Gloria. However, Norma finds the mink coat hanging in Steve's apartment, and realizes he has not made a choice. He tries to explain that after Gloria's father died, Steve looked after her like a brother. Norma again asserts that she does not want to continue their relationship with \"that tramp\" Gloria in their lives.Liggett disappears with Gloria for five days. He brings her to his birth home to show her that he has middle-class roots and did not come from money. Later, after she gives him a lighter with the initials \"B.U. 8\" on it, he finally admits to Gloria that he is married. Far from being surprised, she thanks Liggett for the respect he showed her, finally calling her by name instead of \"honey or babe or dollface\". He says that because his wife's father owns the chemical company where he works, he's stuck in the relationship.While Emily is alone during this time, her mother instructs her to divorce her \"absentee husband.\" She explains that throughout the 150-year history of their family, there has never been a divorce, but that in this case it is warranted, insinuating that Liggett is either a drunk or a philanderer, or both. Emily refuses her mother's entreaties, and says that Liggett is a good man. Emily feels he is frustrated by the do-nothing, planned life her family has handed him, and insists she will be patient with him.Annie, meanwhile, is very worried that Gloria hasn't phoned for six days. She initially refuses to confide in Mrs. Thurber why she is worried, but Mrs. Thurber tells Annie that everything is fine and she knows all about Gloria's activities. When Gloria returns, she confesses to her mother about having been the \"slut of all time,\" and Annie slaps her. Now that her mother has finally heard the truth, Gloria says she has finally fallen in love with only one man. Gloria visits her psychiatrist, Dr. Tredman (George Voskovec), to insist that her relationship with Liggett has cured her of promiscuity. She rushes exuberantly to Steve's apartment, and realizes that the mink coat is still there and she must return it. As she gets to the apartment building, Liggett's wife enters a few feet ahead of her, and Gloria leaves in shame.Liggett takes up Bing's offer of a job at the law firm, and he has three months to get back to speed. When he returns home, Emily has noticed that her mink is gone and attempts to phone the police. Liggett nervously makes excuses and rushes out to search for Gloria at her regular clubs, but finds instead that he is just one in a \"fraternity\" of Gloria's ex-lovers. \"We meet at Yankee Stadium\", one says.Gloria goes to visit Happy, who relates that her own wild and promiscuous life in her youth brought her nothing but pain and led to a depressing dead end. When Gloria finds Liggett at a bistro the following evening, he launches into a series of drunken insults and taunts her with \"honey, babe, dollface, kid.\" He creates a scene while calling Gloria out, and is punched by another patron. Gloria then drives a drunken Liggett to his apartment building where Emily, spotting them from a window above, watches as her husband throws the coat at Gloria, saying he would never give the tainted object back to his wife.Gloria goes to Steve, saying cynically that she feels she has earned the mink coat she is wearing, every thread and fur pelt. She recounts that when she was 13 years old, Major Hartley, a friend of her widowed mother's, had repeatedly raped her while her mother was away, and she hates herself because she loved it. Norma, meanwhile finds Gloria asleep on Steve's couch, but he calmly asks Norma to marry him.The next day, a defeated Liggett asks Emily for a divorce. He explains he loves Gloria so much that the thought of her deserting him drove him into a rage.Back home, Gloria tells her mother she is going to Boston to begin a new life. She gives the mink to Fanny and leaves in her sports car. Finding out where Gloria went by begging BUtterfield 8, Liggett drives until he spots her car at a roadside café. He tries to apologize to Gloria by asking her to marry him, but Gloria insists that his insults have \"branded\" her. He convinces her to go to Happy's to talk in private, but when Happy greets her sarcastically, Gloria speeds away.Liggett drives after Gloria, trying to catch up to her increasingly fast pace. While turning to see him following her, Gloria misses a sign for road construction and hurtles over an embankment to her death. When he returns to the city, Liggett tells his wife about Gloria's death and announces that he is leaving to \"find my pride,\" and that if Emily is still home when he returns, they will work on their marriage.","Title":"The unconventional title of the novel and film[6] (capitalized \"B\" and \"U\") derives from the pattern of old telephone exchange names in the United States and Canada. Until the early 1970s telephone exchanges were commonly referred to by name instead of by number. BUtterfield 8 was an exchange that provided service to ritzy precincts of Manhattan's Upper East Side. Dialing the letters \"BU\" equates to 28 on the lettered telephone dial, so \"BUtterfield 8\" would equate to 288 as the first three digits of a seven-digit phone number.","language":"English","Reception":"According to MGM records, the film made $6.8 million in the US and Canada and $3.2 million in other countries, resulting in a profit to the studio of $1,857,000 - making it MGM's biggest hit of the year.[1]","box_office":"$10 million[1]","cinematography":"Charles Harten Joseph Ruttenberg","directed_by":"Daniel Mann","release_dates":"November 4, 1960 (1960-11-04) (United States)|||||","Production":"The screenplay was adapted by John Michael Hayes and Charles Schnee from O'Hara's 1935 novel, which in turn was based on the mysterious death of Starr Faithfull in Long Beach, Nassau County, New York, in 1931.[4][5] Faithfull was found dead of drowning on a beach after having apparently been beaten.[7] In O'Hara's novel, Gloria Wandrous, the character based on Faithfull, is killed by falling under the paddle wheel of a steamboat.[5] Aside from optioning the rights to his story, O'Hara was not involved in writing the screenplay for the film, and the film's plot bears only a superficial resemblance to his novel.[4]Location filming was done at City Island, Bronx, Stony Point, New York and West Nyack, New York in then-rural Rockland County. Studio shots were at Chelsea Studios.[8]The café where Liggett finds Gloria as she is going to Boston is today a single-story office building, 54 South Liberty Drive, Stony Point, New York. Happy's Motel where Gloria and Liggett stay is actually the Budget Motor Inn, 87 South Liberty Dr. Stony Point, New York. The motel still looks the same as it did in 1960; another unit was added between the street and the existing motel. Liggett takes Gloria to his boat at the Hudson Water Club, Beach Road, West Haverstraw, New York[citation needed]Elizabeth Taylor and her then-husband Eddie Fisher hated the film, referring to it as \"Butterball Four\".[9] Her now-famous response to the success of the film, made under protest in order to fulfill a contractual obligation to Metro-Goldwyn-Mayer before being allowed to depart to 20th Century Fox to make Cleopatra: \"I still say it stinks\".[10] Elizabeth reportedly hated the film because, at the time of its making, the studio was tying her down to the project, and in response to her \"stealing\" Eddie Fisher away from his previous wife Debbie Reynolds, U.S. fans were referring to Taylor as a \"slut\" and a \"homewrecker\", descriptions which also describe her character, Gloria.[citation needed]","produced_by":"Pandro S. Berman","starring":"Elizabeth Taylor Laurence Harvey","running_time":"109 minutes","music_by":"Bronislau Kaper","edited_by":"Ralph E. Winters","written_by":"John Michael Hayes Charles Schnee","budget":"$2.8 million[1]"}