{"based_on":"Sexual Perversity in Chicago (1974)  by David Mamet;|About Last Night (1986)  by Tim Kazurinsky & Denise DeClue|","Cast":"The film features the following actors:[3]Main castSupporting cast","country":"United States","distributed_by":"Screen Gems","screenplay_by":"Leslye Headland","language":"English","about_last_night":"Theatrical release poster","box_office":"$49 million[1]","Synopsis":"The official synopsis from Sony Pictures says, \"A modern reimagining of the classic romantic comedy, this contemporary version closely follows new love for two couples as they journey from the bar to the bedroom and are eventually put to the test in the real world.\"[2]","cinematography":"Michael Barrett","directed_by":"Steve Pink","Casting":"Hart was cast in June 2012.[4] In the following July, Ealy and Hall joined the cast.[5] Hart, Hall, and Ealy had previously starred together in the romantic comedy Think Like a Man (2012), which About Last Night's producer Will Packer also produced.[6] Joy Bryant was cast in August to round out the four key roles.[7] In addition to McDonald, Rodríguez, Lo Truglio, and Patton making up the supporting cast, American football player Terrell Owens had a cameo appearance in the film.[8]Hart and Hall played the characters that James Belushi and Elizabeth Perkins played in the original film.[6] While the character Joan was not very likable in the original film, Hall said the writers revised the character to be closer to the one depicted in the play. Hall said, \"Instead of making her just snarky, there are a lot of levels that she goes to.\"[9]Ealy and Bryant played characters portrayed by Rob Lowe and Demi Moore in the previous film.[10] Ealy said he chose not to see the play or the original film to avoid repeating any performances. He said of the roles of Danny and Debbie, \"With Bernie and Joan, they are written funny, they act funny, they are funny pretty much non-stop. [Danny and Debbie] bring a bit more gravitas to the entire story, and reality.\"[6] Ealy, who was 40 years old at the time of release, played a 28-year-old character, so he lost 25 pounds to look more youthful.[11] He also compared About Last Night's depiction of \"adult Black people in a sexy, romantic way\" to the film Love Jones (1997).[12]","Soundtrack":"Columbia Records produced a soundtrack featuring various artists. The soundtrack was released digitally on February 11, 2014, and it was released physically on March 4, 2014.[36] John Legend contributed a new song, titled \"A Million\", to the film's soundtrack.[37]","production_companies":"Rainforest Films Olive Bridge Entertainment","See also":"In addition to Ride Along and About Last Night, the following are US theatrical releases in 2014 that feature black actors:[38]","release_dates":"February 11, 2014 (2014-02-11) (Pan African Film Festival)|February 14, 2014 (2014-02-14) (commercial)||||","Production":"About Last Night is produced by Screen Gems, a division of Sony Pictures Entertainment, with the involvement of production companies Rainforest Films and Olive Bridge Entertainment. The film is directed by Steve Pink and written by Leslye Headland. The film is a remake of the 1986 film of the same name; both are based on the 1974 play Sexual Perversity in Chicago by David Mamet. Both films differ from the play by substituting a reconciliation of the couple at the end rather than a break-up.[13]Development of the film began in January 2011 when Screen Gems tasked Will Gluck to produce the film and to hire a director and screenwriter.[14] By June 2012, Leslye Headland was hired to write the adapted screenplay,[4] and in the following August, Steve Pink was hired as director.[15] Pink said he liked Headland's screenplay, and he wanted to direct a romantic comedy-drama.[16] He said the story was not high-concept, \"It's very simple and grounded in that way. The trick there is to keep it moving. It's in Mamet's original play, and the writers of the first one knew that. So structurally the movie moves quickly because you're moving through a pretty big emotional story in a short amount of time without a lot of high-concept devices.\"[6]In contrast to the original film, the remake's starring cast is mostly black. Actor Michael Ealy said the story could be read independently of race and that it did not mean the original film would be called \"predominantly white\".[6] Actor Kevin Hart said, \"I feel that what we're doing is making it a little bit more modern, by incorporating black people. I don't think it's just about us being black, it's just a different take on the relationship feel. Our rants are a little different than a white rant. Our way of arguing is different from a Caucasian couple's fights. It's a little more violent. It gets a little more vulgar. Things are said that you don't expect to be said.\"[17] The Toronto Sun reported that in addition to the all-black cast, the remake would be closer in tone to the source material.[18]The remake is set in Los Angeles, California, where the original film was set in Chicago, Illinois. The production did not qualify for a California film tax credit, but executives intended to film in Los Angeles regardless. The crew filmed in downtown Los Angeles, not traditionally depicted in films as a people-friendly community. The downtown area had been revitalized in recent years, and the crew chose to film most of About Last Night in a 10-block radius around 6th and Main Streets. Most films are filmed in different locations not near each other, so the setup for About Last Night was unconventional but helped minimize transportation costs. Filming locations in the area included Pacific Electric Building, Cole's Pacific Electric Buffet, Santa Fe Lofts, Casey's Irish Pub, and Broadway Bar. The crew's location manager approached the owner of the local businesses to depict their properties as-is and benefit from publicity in exchange for lower rental fees for use of the space. Dodger Stadium was the sole filming location outside of the radius. Filming lasted for seven weeks in late 2012, and production was completed with a budget of $13 million.[19]","produced_by":"Will Packer|Will Gluck|","starring":"Kevin Hart|Michael Ealy|Regina Hall|Joy Bryant|","running_time":"100 minutes","music_by":"Marcus Miller","edited_by":"Tracey Wadmore-Smith|Shelly Westerman|","Release":"About Last Night premiered at the Pan African Film Festival on February 11, 2014 as the festival's centerpiece film.[20] It was released in 2,253 theaters in the United States and Canada on Valentine's Day, February 14, 2014.[21] The film grossed $25.6 million over the opening weekend (not including the holiday Washington's Birthday on Monday).[22] It ranked second after The Lego Movie, which was in its second weekend and grossed $49.8 million. USA Today said About Last Night's performance \"met most analysts' expectations\" and that its success was helped by \"an aggressive marketing campaign\" featuring Kevin Hart.[23] In addition to The Lego Movie, the film faced unconventional competition from two other opening films that were also remakes of 1980s films: RoboCop and Endless Love.[24] Forbes reported that About Last Night's opening weekend audience demographic was 63% female and 58% over 30 years old.[25] According to the polling firm CinemaScore, audiences gave the film an \"A-\" grade.[26]Over the second weekend (February 21–23), About Last Night grossed $7.5 million and ranked sixth at the box office.[27] Variety said the second-weekend performance was \"a steep 71% drop\" from the previous weekend.[28] Overall, About Last Night grossed $48.6 million in the United States and Canada and $365,000 in other territories for a worldwide total of $49 million.[22] In March 2014, Box Office Mojo had forecast that the film would pass $50 million but fall short of the similar film Think Like a Man (2012), which grossed $91.5 million.[29]The Los Angeles Times said the initial reviews for About Last Night were \"largely positive\" and better than those for Hart's film Ride Along, which was released the previous month.[30] It reported that critics found the film \"pretty satisfying, if rather familiar\" and that the reviews, including negative ones, highlighted in particular \"the comic relief of Hart and Hall\".[31]The film review website Metacritic surveyed 30 critics and assessed 20 reviews as positive, 9 as mixed, and 1 as negative. It gave an aggregate score of 62 out of 100, which it said indicated \"generally favorable reviews\".[32] The similar website Rotten Tomatoes surveyed 92 critics and, categorizing the reviews as positive or negative, assessed 63 as positive and 29 as negative. Of the 92 reviews, it determined an average rating of 6 out of 10. It gave the film a score of 68% and summarized the critical consensus, \"About Last Night wanders even further from the David Mamet play that inspired the original, but it benefits from an engaging cast and a screenplay that smartly balances romance and comedy.\"[33] Tim Ryan, writing for Rotten Tomatoes, said critics found the film \"wise about the ups and downs\" of love. Ryan said, \"The pundits say About Last Night doesn't reinvent the romantic comedy wheel, but it's refreshingly honest and insightful, and it provides a fine showcase for Hart's onscreen talents.\"[34]Sony Pictures Home Entertainment released About Last Night on DVD and Blu-ray on May 20, 2014.[35]","budget":"$12.5 million[1]"}