{"country":"India","distributed_by":"Vinay Pictures","screenplay_by":"Rajkumar Santoshi (screenplay & dialogues) Dilip Shukla (dialogues)","story_by":"Yaser Ranjha","Plot":"Amar (Aamir Khan) and Prem (Salman Khan) are two daydreamers with a common aim: getting rich by marrying a rich heiress, Raveena Bajaj (Raveena Tandon), daughter of Ram Gopal Bajaj (Paresh Rawal). The guys run into each other on a bus and soon realise that they have a common goal. The trio fail at various attempts to woo the lady.Finally, they decide to insinuate themselves in her house. Amar pretends to be a guy who has lost his memory after getting hit by Raveena, while Prem pretends to be a doctor. The boys don't know that Raveena's secretary Karishma (Karisma Kapoor) is the real Raveena and Raveena's actual name is Karishma. Raveena switched her identity because she wanted to find a boy who will love her, not her money.Nobody is aware that Ram Gopal has a twin brother called Shyam Gopal Bajaj aka Teja. Teja is a criminal who has taken lots of money from Crime Master Gogo (Shakti Kapoor). Teja hopes to land the riches himself by kidnapping his brother and posing as Ram. He has also planted his cronies Robert (Viju Khote) and Bhalla (Shehzad Khan) in the household.Ram arrives in India & Teja plans to steal Ram's money converted in diamonds. Here, Ram sees through the real nature of Amar, Prem and Raj thus declining Raveena's marriage to either of them. The duo plan to fake a kidnapping where they will heroically \"rescue\" Ram. Unknown to them, Teja has planned to kidnap Ram as well.Teja succeeds in having Ram kidnapped. The boys go to rescue Ram, but Teja makes them believe that he is Ram and finally enters Ram's household. Initially, nobody suspects a thing, but the girls soon smell a rat. The boys have discovered real identities of the girls. Prem has fallen for real Raveena while Amar has fallen for real Karishma.The girls tell their suspicions to the boys. The boys tail Teja and soon find out the truth. Here, Ram tricks Teja and escapes the prison. However, the boys mistake him for Teja, resulting in Ram being imprisoned again – with Amar and Prem. However, Amar and Prem succeed in convincing Robert & Bhalla that Ram is actually Teja.The boys, along with Robert & Bhalla, stop Teja. However, Ram is kidnapped along with Raveena & Karishma. The climax takes place in Gogo's lair, where the boys try to control the situation along with Ram. In a comic standoff, the real motive of each villain is revealed. However, due to the smartness of the boys, police raid Gogo's lair, thus rounding up all the criminals. Ram finally decides to have the girls married to Amar and Prem.","andaz_apna_apna":"Poster","language":"Hindi","Reception":"The film did not do well at box-office; it recovered its cost mainly due to business from big cities, but did not turn out to be a massive hit contrary to everyone's expectations. It earned an excess of ₹5 crore (US$740,000).[3] The lack of publicity and tough competition from other films of that year including Hum Aapke Hain Koun..!, Krantiveer and 1942: A Love Story were reasons for it to fail.[8] All of these films were very strong in their box office presence and Andaz Apna Apna, belonging to a different genre, could not compete well. It was However, in subsequent years, it has achieved a cult classic status among Hindi audiences.[4][5] Each dialogue and character of the movie are immensely likeable and have terrific recall. On the video circuit and TV, it has become one of the most popular Indian movies over the years.Several dialogues from this film like \"Teja main hu. Mark Idhar hai\", \" Crime Master Gogo, Mogambo ka Bhatija\", \" Do dost ek cup me chay piyenge\" etc, are popular.[9][10] It went on to be an inspiration for the plot element of Tamil movie Ullathai Allitha, Telugu movie Veedevadandi Babu and the Kannada movie Galate Aliyandru. It was also reported that the climax of 1973 movie Victoria No. 203, including the set and the action, was shot-to-shot copied in this movie.[11]While reviewing Grand Masti in 2013, critic Khalid Mohamed described Andaz Apna Apna in the \"collection of excellent comedies\" from Hindi cinema.[12] Film critic Raja Sen called it a \"cornball classic\" and \"one of the greatest comedies in recent times.\"[13] In 2014, comedian Aditi Mittal wrote: \"Writing about Andaz Apna Apna, I have realised, is like writing about mother’s love. Everyone has their own version of how it affects them, what lines they remember the most.\"[14]","box_office":"₹21 crore (equivalent to ₹97 crore or US$14 million in 2016)[3]","cinematography":"Ishwar Bidri","directed_by":"Rajkumar Santoshi","Remake and sequel":"The plot elements of the movie was used in many languages as Ullathai Allitha (1996), Veedevadandi Babu (1997) and Galate Aliyandru (2000). Andaz Naya Naya is a Bollywood animated 3D film, which is an official remake of Andaz Apna Apna, but it has been shelved due to some reason.[15] Producer Sidharth Jain began to question if the film would do any good in the box office because Indian animated films do not get good market, so Jain shelved the film after being 35% done.[16]On the completion of 20 years of Andaz Apna Apna, director Rajkumar Santoshi said in an interview that he is considering sequel of Andaz Apna Apna as demand for sequel is unbelievable. He said that bringing Aamir Khan and Salman Khan together may be economically and logistically impossible, so he may take young actors to reprise roles of Amar and Prem.[4] Raveena Tandon, who featured in the film, stated that she does not believe in a sequel, and would prefer a cartoon remake rather than a feature film.[17]","Soundtrack":"The film has four songs composed by Tushar Bhatia with lyrics by Majrooh Sultanpuri.* Song was not included in the movie though appearing on the soundtrack.","Awards":"","release_dates":"11 April 1994[1]","Production":"The films producer Vinay Sinha approached writer-director Rajkumar Santoshi with the idea of making a film with Aamir Khan.[4] Having made two back-to-back serious films like Ghayal (1990) and Damini – Lightning (1993), Santoshi wanted to make a comedy film.[5] It was then decided that he would script a funny film about two warring buddies, the human versions of Tom and Jerry.[4] He then decided to bring Salman Khan to the party followed by then relative newcomers Karishma Kapoor and Raveena Tandon as the female leads along with Paresh Rawal in a double role.[5] Santoshi started writing the script after the casting.[6] Initially Salman Khan wanted more screen space than the other, but later agreed to have the same amount of screen time.[7] Tinnu Anand was offered the role of the villain \"Gogo\", but could not do it because of dates issue.[6] It eventually went to Shakti Kapoor. The Muhurat shot was done by cricketer Sachin Tendulkar.[7] Andaz Apna Apna took three years in making, and several scenes were improvised by the actors on set.[6][7]","produced_by":"Vinay Kumar Sinha","starring":"Aamir Khan Salman Khan Raveena Tandon Karisma Kapoor Paresh Rawal Shakti Kapoor","running_time":"160 minutes","music_by":"Tushar Bhatiah","edited_by":"V. N. Mayekar","budget":"₹7 crore (equivalent to ₹32 crore or US$4.8 million in 2016)[2]"}