{"country":"United States|Netherlands|","dark_blood":"Theatrical release poster","Plot":"The movie begins with Harry (Pryce), an up-and-coming actor, and his wife Buffy (Davis) on their \"second honeymoon\". After staying overnight at a motel, the owner (Black) informs Harry of previous nuclear testing taking place in the town. The following day, their Bentley car eventually breaks down, leading them to run out of water in the middle of the desert. Harry has the idea to stay put with their car rather than to look for help. While Harry sleeps in the back seat, Buffy notices a light in the distance and follows it, leading her to the front door of a barn belonging to a widower named Boy (Phoenix). After mentioning he is 1/8 Hopi Native American, Boy reveals a cave filled with candles and voodoo dolls that he believes have magical powers, which he spends his time making Kachina dolls, waiting for the world to end.During their stay, Buffy and Boy become attracted to each other, angering Harry. Harry tells Boy to leave her alone while on a shooting hunt. The two have an argument and Boy retreats, leaving Harry to find his way back. Boy later attempts to shoot him only to miss. Eventually, the couple become aware that Boy will not let them leave.After a couple of violent outbursts from Boy, including an act of seducing Buffy in his cave, Buffy decides to sleep with Boy to entice him to let the couple leave, an act that proves futile. At one point, Harry is punished by Boy, after hitting him with a crowbar, by means of a kangaroo court; Boy locks Harry in a dark shed where he later witnesses Buffy removing her clothes in the shack. Outraged by these events, Harry attacks Boy with an axe only for Boy to block the axe's blow with his rifle above his head. However, unable to withstand Harry's strength, the axe hits Boy knocking him to the ground. In act of self-defense Harry is forced to fatally wound Boy's dog when it tries to attack him. Boy gets to his feet, telling Harry that he has never wanted to kill a man before, his finger on the trigger of the rifle. Boy then collapses from a bleeding head wound.Later, Harry and Buffy's car is delivered to the shack by a group of Native American mechanics from a nearby town; Harry does not believe Boy when he offers this information. A short time later, Boy dies from his injury. The Native Americans carry Boy and his dead dog into the shack and proceed to burn it down, telling Harry and Buffy to leave.","language":"English","Reception":"On Rotten Tomatoes, the film received four positive reviews and one negative one, for a score of 80%, with an average rating of 6/10.[8]Geoffrey Macnab from The Guardian gave the film 3 out of 5 stars, stating that \"Dark Blood is fragmentary, uneven and downright odd in parts but it also has huge curiosity value. The director's solution for bridging the considerable gaps is to read out descriptions of what is missing. It's a simple but surprisingly effective tactic. His narration ensures that the film is just about coherent.\"[9] Ard Vijn from Twitch says the movie is \"almost polished enough to be regarded as a finished film. Almost. The images, music and actors definitely make watching it a worthwhile exercise.\"[10]","cinematography":"Edward Lachman","production_company":"Scala Productions (1993) Fine Line Features (1993) Sluizer Films (2012)","directed_by":"George Sluizer","release_dates":"September 27, 2012 (2012-09-27) (private audience, NFF)|||||","Production":"Dark Blood consisted of roughly five weeks of on location shooting in Torrey, Utah and was scheduled to complete three weeks of filming interior scenes in Los Angeles, California on a sound stage. Filming was only 80% finished before Phoenix's death on October 31, 1993. Production halted while insurers and financiers tried to determine if the movie could be completed, but with important scenes still needing to be shot the film was abandoned on November 18, 1993.[2] For the 2012 release, roughly four to six missing scenes were replaced with Sluizer providing narration.It was revealed in October 2011 that director George Sluizer had held onto the footage, fearing it would be destroyed, and that he had reedited the material and believed that with some adjustments a completed film could be released in 2012. It was speculated that Sluizer would ask Phoenix's younger brother Joaquin Phoenix to dub River's voice. The Phoenix family made it clear that they would not participate in the project, saying in a statement, \"In regard to releasing River's last film, Joaquin Phoenix and his family have not been in communication with the director nor will they participate in any way.”[3]On May 18, 2012, a trailer for the film and an interview with Sluizer were released on YouTube.[4][5] The film premiered to an invited audience on September 27, 2012, at the Netherlands Film Festival in Utrecht, Netherlands.[6] It had its international premiere out of competition at the 63rd Berlin International Film Festival.[7]","produced_by":"Daniel Lupi|Jeannie Neill|Nik Powell|JoAnne Sellar|Stephen Woolley|","starring":"River Phoenix|Judy Davis|Jonathan Pryce|","running_time":"86 minutes","music_by":"Florencia di Concilio James Michael Taylor","edited_by":"Martin Walsh Michiel Reichwein","written_by":"Jim Barton"}