{"country":"United States","distributed_by":"20th Century Fox","black_widow":"Theatrical release poster","Plot":"The story centers on two women. Catherine (Theresa Russell) is a psychopathic[2] femme fatale whose true name and motivation are never known. She preys on wealthy middle-aged men, seducing them into marriage and then fatally poisoning them. Each death is misdiagnosed as Ondine's curse, a condition by which seemingly healthy middle-aged men die in their sleep. Justice Department agent Alexandra \"Alex\" Barnes (Debra Winger) stumbles onto the first murder while investigating another case. As Alex delves further into the case, she uncovers a pattern which she believes ties the same woman to several similar murders.Using exhaustive research and preparation as well as identity and appearance changes, Catherine weaves her web anew with each murder, killing a publishing magnate, a toy maker (Dennis Hopper), and a museum curator (Nicol Williamson), and is quickly moving on to her next victim: Paul Nuytten (Sami Frey), an international hotel tycoon. Later, she reveals that she has been married six times, and possibly has murdered all her husbands.After the death of the rich, lonely museum curator in Seattle, Alex's boss Bruce (Terry O'Quinn) gives her tacit permission to hunt down the killer, and Alex goes undercover as \"Jessie Bates\" to track down Catherine and identify her next potential victim. The trail leads from Seattle to Hawaii, where Catherine is moving on Paul. With the aid of a private investigator, \"Jessie\" arranges to meet Catherine; the two women become friends and eventually engage in a sexually intense war of wits and wills orchestrated by Catherine.Confident in her ability to win any man, Catherine arranges for them to compete for Paul's affection; he's attracted to \"Jessie,\" but falls for Catherine's charm and her stylishly executed seduction. Catherine marries him and, during the reception, reveals to \"Jessie\" that the \"black widow\" knows about the federal agent. \"Jessie\" tries to warn Paul of Catherine's murderous intentions but he is skeptical, refusing to believe she is after his money, because in the event of either of their deaths, their wills both stipulate that their net worth be left to the Cancer Foundation and not to each other. The private investigator is found dead of a suspicious drug overdose, after Catherine had forced him at gunpoint to inject himself. After Paul's death, Catherine accuses \"Jessie\" of killing him, and \"Jessie\" is arrested when the police find poison in her room. Catherine meets with Paul's attorney, who explains that Paul was a resident of Florida, and according to state law, a spouse has the right to overturn charitable bequests stipulated in their spouse's will. Catherine then tells the attorney that shortly before his death, Paul had expressed \"profound reservations\" about the Cancer Foundation.Catherine visits \"Jessie\" in prison, and while they talk, Catherine is confronted with the sister of one of her victims (the publisher). Then Paul enters the room, clearly not dead, and now aware that Catherine was in fact after his money. Catherine, shocked, realizes that her attempt to double-cross Jessie/Alex has failed. Catherine is arrested, and Alexandra emerges as the hero, leaving as reporters attempt to question her.","language":"English","Reception":"Film4 notes that Black Widow succeeds through Rafelson's \"menacing direction\" and Debra Winger's \"convincing struggle with temptation\", while Theresa Russell \"steals the show as the sexily assured devil sitting on her tracker's shoulder\".[3]Vincent Canby, in the New York Times, writes that while the film promises more than it can deliver, its classy looks make it both soothing and \"redeemingly funny, in part, at least, for not becoming mired in its own darker possibilities\". He praises Winger for \"the gift of seeming always to have hidden reserves of feeling that might erupt in chaos at any minute\", while Russell \"comes into her own\" in the film, and has \"a clear-eyed sweetness that adds unexpected dimension to the homicidal Catharine.\"[4]Roger Ebert gave Black Widow a mixed rating of 2.5 out of 4 stars, praising the solid performances by the main actors yet lamenting that \"The movie makes no effort to keep us in suspense\", by revealing too much too soon about Russell's character.[5]","box_office":"$25,205,460[1]","cinematography":"Conrad L. Hall, ASC","directed_by":"Bob Rafelson","release_dates":"February 6, 1987 (1987-02-06)|||||","produced_by":"Laurence Mark Harold Schneider","starring":"Debra Winger|Theresa Russell|Sami Frey|Dennis Hopper|Nicol Williamson|","running_time":"102 minutes","music_by":"Michael Small","edited_by":"John Bloom","written_by":"Ronald Bass"}