{"based_on":"Mute Witness  by Robert L. Fish","country":"United States","distributed_by":"Warner Bros.-Seven Arts","screenplay_by":"Alan R. Trustman Harry Kleiner","Plot":"Ambitious politician Walter Chalmers (Robert Vaughn) is about to present a surprise star witness in a Senate Subcommittee hearing on organized crime. The witness, Johnny Ross, a defector from the Organization in Chicago, is put under San Francisco Police Department protective custody for the weekend, 40 hours until his Monday morning appearance.To improve his own image, Chalmers requests SFPD Lieutenant Frank Bullitt (Steve McQueen), who is well-liked by the local media. Bullitt and his team, Sergeant Delgetti (Don Gordon) and Inspector Carl Stanton (Carl Reindel), put Ross (Felice Orlandi) under around-the-clock protection in a cheap hotel selected by Chalmers. Late Saturday night, while Bullitt is with his girlfriend Cathy (Jacqueline Bisset), a designer, Stanton is on solo duty when the desk clerk unexpectedly calls to announce that Chalmers wants to come up. While Stanton checks by phone with Bullitt, Ross inexplicably (at the time) unchains the hotel room door. A pair of hitmen (Paul Genge and Bill Hickman) burst in and shoot Stanton and Ross, seriously wounding both.At the hospital, Chalmers holds Bullitt responsible. Later, a second assassination attempt is thwarted by Bullitt, but Ross soon dies of his original injuries. Helped by a sympathetic doctor (Georg Stanford Brown) who had been snubbed by Chalmers, Bullitt delays news of the death by sending the body to the morgue as a John Doe.Bullitt and Delgetti investigate. The cab driver (Robert Duvall) who drove Ross to the hotel remembers stopping to let Ross make a long distance call from a pay phone. A confidential informant reveals that Ross was caught stealing $2 million from the Chicago Mob and fled to San Francisco after escaping an attempted hit in Chicago. Meanwhile, Chalmers serves Bullitt's captain (Simon Oakland) with a writ of habeas corpus to force him to make Bullitt give up Ross, but the lieutenant won't cooperate.While driving his 1968 Ford Mustang GT, Bullitt spots the Ross hitmen tailing him in a 1968 Dodge Charger R/T. He maneuvers to get behind them, they attempt to flee, and a high-speed muscle car chase ensues, through the hilly streets of San Francisco's Russian Hill and out onto the highway, ending when the Mustang forces the Charger off the road and into a gas station, causing a fiery explosion that incinerates the hitmen.Bullitt and Delgetti face their superiors. They reveal that Ross is dead and that their only lead is phone records showing that Ross made a call to a Dorothy Simmons in a hotel in nearby San Mateo. It is Sunday; the detectives are given until Monday to follow up the lead. With his car out of commission, Bullitt gets a ride from Cathy.At the San Mateo hotel, a woman is found strangled to death in Simmons's room. Cathy is horrified by the crime scene, and later confronts Bullitt about his violent world, wondering whether she even really knows him. Back in San Francisco, Bullitt and Delgetti search Simmons's luggage, discovering men's and women's clothing, empty ticket and passport folders, a travel brochure for Rome, and thousands of dollars in travelers' cheques made out to Albert Renick and Dorothy Renick. Bullitt requests passport information for the Renicks and a fingerprint check for the dead Ross.Chalmers again confronts Bullitt, demanding a signed admission that Ross died while in his custody. Bullitt refuses. A facsimile of Albert Renick's passport application arrives, showing the man they thought was Ross was actually Renick, a used car salesman from Chicago with no criminal record. Bullitt realizes that the real Ross had used Chalmers to fake his own death by setting up Renick, then murdered Renick's wife to complete the cover-up. Delgetti discovers reservations for the Renicks on an evening flight to Rome.Bullitt and Delgetti head to the San Francisco airport to look for the real Ross (Pat Renella), who is traveling as Renick. They stake out the Rome flight gate, only to find that Ross has switched to an earlier flight that is taxiing toward takeoff. Chalmers shows up to lay claim to the real Ross even though he is now wanted for murder, and is again rebuffed by Bullitt.The flight is held up, and Ross escapes the plane. A foot chase across the busy runways ends in a tense cat-and-mouse pursuit inside the crowded passenger terminal. When Ross bolts and shoots a security guard, Bullitt shoots and kills Ross. Left behind, empty-handed, is Chalmers, who is driven off in a car with a bumper sticker that reads: \"Support Your Local Police.\"Early the next morning, Bullitt drives home. As he walks up to his apartment, he spots Cathy's car. He looks in and sees her sleeping in his bedroom but he does not wake her. He takes off his gun and balances it on a banister. As he begins to wash up at the bathroom sink, he looks up into his own reflection and contemplates himself for a long moment.","language":"English","box_office":"$42.3 million[1]","cinematography":"William A. Fraker","production_company":"Solar Productions Warner Bros.-Seven Arts","directed_by":"Peter Yates","release_dates":"October 17, 1968 (1968-10-17)|||||","Production":"Bullitt was co-produced by McQueen's Solar Productions and Warner Bros.-Seven Arts, the film pitched to Jack L. Warner as \"doing authority differently.\"[7]Bullitt was director Yates' first American film. He was hired after McQueen saw his 1967 UK feature, Robbery, with its extended car chase.[8] Joe Levine, whose Embassy Pictures had distributed Robbery, did not much like it, but Trustman, who had seen the picture the very week he was writing the Bullitt chase, insisted that McQueen, Relyea and D'Antoni, none of whom had ever heard of Yates, see Robbery and consider Yates for director of Bullitt.[citation needed]McQueen based the character of Frank Bullitt on San Francisco Inspector Dave Toschi, with whom he worked prior to filming.[9][10] McQueen even copied Toschi's unique \"fast draw\" shoulder holster. Toschi later became famous, along with Inspector Bill Armstrong, as the lead San Francisco investigators of the Zodiac Killer murders that began shortly after the release of Bullitt. Toschi is played by Mark Ruffalo in the film Zodiac, in which Paul Avery (Robert Downey, Jr.) mentions that \"McQueen got the idea for the holster from Toschi\".[10][11]Bullitt is notable for its extensive use of actual locations rather than studio sets, and its attention to procedural detail, from police evidence processing to emergency room procedures. Director Yates' use of the new lightweight Arriflex cameras allowed for greater flexibility in location shooting.[12]At the time of the film's release, the car chase scene generated prodigious excitement.[2] Leonard Maltin has called it a \"now-classic car chase, one of the screen's all-time best.\"[3] Emanuel Levy wrote in 2003 that, \"Bullitt contains one of the most exciting car chases in film history, a sequence that revolutionized Hollywood's standards.\"[4] In his obituary for Peter Yates, Bruce Weber wrote, \"Mr. Yates’ reputation probably rests most securely on Bullitt (1968), his first American film – and indeed, on one particular scene, an extended car chase that instantly became a classic.\"[5] The editing of this scene likely won editor Frank P. Keller the Academy Award for Best Editing.[13]The total time of the scene is 10 minutes and 53 seconds, beginning in the Fisherman's Wharf area of San Francisco, at Columbus and Chestnut (although Bullitt first notices the hitmen following his car while driving west on Army, now Cesar Chavez, just after passing under Highway 101), followed by Midtown shooting on Hyde and Laguna Streets, with shots of Coit Tower and locations around and on Filbert and University Streets. The scene ends outside the city at the Guadalupe Canyon Parkway in Brisbane.[14] The route is geographically impossible if it is assumed to take place in real time.[15]Two 1968 390 V8 Ford Mustang GT fastbacks (325 hp) with four-speed manual transmissions were used for the chase scene, both lent by the Ford Motor Company to Warner Bros. as part of a promotional agreement. The Mustangs' engines, brakes and suspensions were heavily modified for the chase by veteran car racer Max Balchowsky. Ford also originally lent two Galaxie sedans for the chase scenes, but the producers found the cars too heavy for the jumps over the hills of San Francisco. They were replaced with two 1968 375 hp 440 Magnum V8-powered Dodge Chargers. The engines in both Chargers were left largely unmodified, but the suspensions were mildly upgraded to cope with the demands of the stunt work.[citation needed]The director called for maximum speeds of about 75–80 miles per hour (121–129 km/h), but the cars (including the chase cars filming) at times reached speeds of over 110 miles per hour (180 km/h). Driver's point-of-view shots were used to give the audience a participant's feel of the chase. Filming took three weeks, resulting in nine minutes and 42 seconds of pursuit, first of Bullitt by the hitmen then the reverse. Multiple takes were spliced into a single end product resulting in discontinuity: heavy damage on the passenger side of Bullitt's car can be seen much earlier than the incident producing it, and the Charger appears to lose five wheel covers, with different ones missing in different shots. Shooting from multiple angles simultaneously and creating a montage from the footage to give the illusion of different streets also resulted in the speeding cars passing the same vehicles at several different times, including, widely noted, a green Volkswagen Beetle.[16] At one point the Charger crashes into the camera in one scene and the damaged front fender is noticeable in later scenes. Local authorities did not allow the car chase to be filmed on the Golden Gate Bridge, but did permit it in Midtown locations including Bernal Heights and the Mission District, and on the outskirts of neighboring Brisbane.[17]McQueen, an accomplished driver, drove in the close-up scenes, while stunt coordinator Carey Loftin, stuntman and motorcycle racer Bud Ekins, and McQueen's usual stunt driver, Loren Janes, drove for the high-speed part of the chase and performed other dangerous stunts.[18] Ekins, who doubled for McQueen in the The Great Escape sequence where McQueen's character jumps over a barbed wire fence on a motorcycle, lays one down in front of a skidding truck during the Bullitt chase. The Mustang’s interior rear view mirror goes up and down depending on who is driving: when the mirror is up, McQueen is visible behind the wheel, when it is down, a stunt man is driving.The black Dodge Charger was driven by veteran stunt driver Bill Hickman, who played one of the hitmen and helped with the chase scene choreography. The other hitman was played by Paul Genge, who played a character who had ridden a Dodge off the road to his death in an episode of Perry Mason (\"The Case of the Sausalito Sunrise\") two years earlier. In a magazine article many years later, one of the drivers involved in the chase sequence remarked that the stock Dodge 440s were so much faster than the Mustang that the drivers had to keep backing off the accelerator to prevent the Dodge from easily pulling away from the Mustang.[17]One of the two Mustangs was scrapped after filming because of damage and liability concerns, while the other was sold to an employee of Warner Bros.[19] The car changed hands several times, with McQueen at one point making an unsuccessful attempt to buy it in late 1977. The current state and location of the surviving Mustang is largely unknown, but it is rumored that the Mustang is kept in a barn somewhere in the Ohio River Valley by an unknown owner.[20]The editing of the car chase by Frank P. Keller likely won Keller the editing Oscar for 1968,[13] and has been included in lists of the \"Best Editing Sequences of All-Time\".[21] Paul Monaco has written, \"The most compelling street footage of 1968, however, appeared in an entirely contrived sequence, with nary a hint of documentary feel about it – the car chase through the streets of San Francisco in Bullitt, created from footage shot over nearly five weeks. Billy Fraker, the cinematographer for the film, attributed the success of the chase sequence primarily to the work of the editor, Frank P. Keller. At the time, Keller was credited with cutting the piece in such a superb manner that he made the city of San Francisco a \"character\" in the film.\"[22] The editing of the scene was not without difficulties; Ralph Rosenblum wrote in 1979 that \"those who care about such things may know that during the filming of the climactic chase scene in Bullitt, an out-of-control car filled with dummies tripped a wire which prematurely sent a costly set up in flames, and that editor Frank Keller salvaged the near-catastrophe with a clever and unusual juxtaposition of images that made the explosion appear to go off on time.\"[23] This chase scene has also been cited by critics as groundbreaking in its realism and originality.[24] In the release print and the print shown for many years, a scene in which the Charger actually hits the camera causing a red flare on screen, which many feel added to the realism, was edited out on DVD prints to the disappointment of many fans.The original score was composed by Lalo Schifrin. The tracks on the soundtrack album are alternative versions of those heard in the film, re-recorded by Schifrin with leading jazz musicians, including Bud Shank (flute), Ray Brown (bass), Howard Roberts (guitar) and Larry Bunker (drums).[25]In 2000, the original arrangements as heard in the movie were recreated by Schifrin in a recording session with the WDR Big Band in Cologne, Germany, and released on the Aleph label.[26] This release also includes re-recordings of the 1968 soundtrack album arrangements for some tracks.In 2009, the never-before-released original recording of the score heard in the movie, recorded by Schifrin on the Warner Bros. scoring stage with engineer Dan Wallin, was made available by Film Score Monthly. Some score passages and cues are virtually identical to the official soundtrack album, while many softer, moodier cues from the film were not chosen or had been rewritten for the soundtrack release. Also included are additional cues that didn't make it into the film. In addition, the two-CD set features the official soundtrack album, newly mixed from the 1\" master tape.[25]In the restaurant scene with McQueen and Bissett, the live band playing in the background is Meridian West, a jazz quartet that McQueen had seen performing at famous San Francisco restaurant, The Trident.[27]","bullitt":"Film poster by Michel Landi","produced_by":"Philip D'Antoni","starring":"Steve McQueen Robert Vaughn Jacqueline Bisset","running_time":"113 minutes","music_by":"Lalo Schifrin","edited_by":"Frank P. Keller","Release":"Bullitt garnered both critical acclaim and box office success.Produced on a $5.5 million budget, the film grossed over $42.3 million in the US,[1] making it the 5th highest grossing film of 1968.Bullitt was well received by critics and is considered by some to be one of the best films of 1968.[28][29][30] At the time, Renata Adler made the film a New York Times Critics' Pick, calling it a \"terrific movie, just right for Steve McQueen –-fast, well acted, written the way people talk.\" According to Adler, \"the ending should satisfy fans from Dragnet to Camus.\"[31]In 2004, the New York Times placed the film on its list of The Best 1,000 Movies Ever Made.[24] In 2011, Time magazine listed it among the \"The 15 Greatest Movie Car Chases of All Time,\" describing it as \"the one, the first, the granddaddy, the chase on the top of almost every list,\" and saying \"Bullitt‘s car chase is a reminder that every great such scene is a triumph of editing as much as it is stunt work. Naturally, it won that year's Academy Award for Best Editing\".[32] Among 21st century critics, it holds a 97% \"Fresh\" rating on Rotten Tomatoes, representing positive reviews from 33 of 34 critics, in a mix of reviews dated from when the film was released to the 2000s, its consensus reading: \"Steve McQueen is cool as ice in this thrilling police procedural that also happens to contain the arguably greatest car chase ever.\"[33]The film was nominated for and won several critical awards.[34] Frank P. Keller won the 1969 Academy Award for Best Film Editing, and it was also nominated for Best Sound.[35] Five nominations at the BAFTA Film Awards for 1969 included Best Director for Peter Yates, Best Supporting Actor for Robert Vaughn, Best Cinematography for William A. Fraker, Best Film Editing for Frank P. Keller, and Best Sound Track. Robert Fish, Harry Kleiner, and Alan Trustman won the 1969 Edgar Award for Best Motion Picture.[36] Keller won the American Cinema Editors Eddie Award for Best Edited Feature Film. The film also received the National Society of Film Critics Award for Best Cinematography (William A. Fraker) and the Golden Reel Award for Best Sound Editing – Feature Film. It was successful at the 1970 Laurel Awards, winning Golden Laurel awards for Best Action Drama, Best Action Performance (Steve McQueen) and Best Female New Face (Jacqueline Bisset). In 2000, the Society of Camera Operators awarded Bullitt its \"Historical Shot\" award to David M. Walsh.The famous car chase was later spoofed in the Clint Eastwood film, The Dead Pool, in the Futurama episode, \"Bendin' in the Wind,\" and in the Archer season six episode, \"The Kanes.\" Bullitt producer Philip D'Antoni went on to film two more car chases, for The French Connection and The Seven-Ups, both set and shot in New York City.The Ford Mustang name has been closely associated with the film. In 2001, the Ford Motor Company released the Bullitt edition Ford Mustang GT.[37] Another version of the Ford Mustang Bullitt, which is closer to resembling the original film Mustang, was released in 2008, to commemorate the 40th anniversary of the film.[38][39] In 2009, Bud Brutsman of Overhaulin' built an authentic-looking replica of the Bullitt Mustang, fully loaded with modern components, for the five-episode 2009 TV series, Celebrity Rides: Hollywood's Speeding Bullitt, hosted by Chad McQueen, son of Steve McQueen.[40][41]Steve McQueen's likeness as Frank Bullitt was used in two Ford commercials. The first was for the Europe-only 1997 Ford Puma, which featured a special effects montage of McQueen (who died in 1980) driving a new Puma around San Francisco before parking it in a studio apartment garage beside the film Mustang and the motorcycle from The Great Escape.[42] In a 2004 commercial for the 2005 Mustang, special effects are again used to create the illusion of McQueen driving the new Mustang, after a man receives a Field of Dreams-style epiphany and constructs a racetrack in the middle of a cornfield.[43]The Mustang is featured in the 2003 video game, Ford Racing 2, in a Drafting challenge, on a course named Port Side. It appears in the Movie Stars category, along with other famous cars like the Ford Torino from Starsky & Hutch and the Ford Mustang Mach 1 from Diamonds Are Forever.[44][45] In the 2011 video game, Driver: San Francisco, the \"Bite the Bullet\" mission is based on the famous chase scene, with licensed versions of the Mustang and Charger from the film.[46]During the only season of the 2012 TV series Alcatraz, Det. Rebecca Madsen (Sarah Jones) drives a green 1968 390 V8 Ford Mustang fastback like Bullitt's. In the series finale, she finds herself in a 2013 Ford Mustang GT, the modern equivalent of the 1968 fastback, giving chase to a black LX Dodge Charger driven by series antagonist Thomas \"Tommy\" Madsen (David Hoflin). The sequence pays homage to Bullitt's car chase, including Madsen buckling the seatbelt in his Charger before starting, and two passes by a green Volkswagen Beetle.The Blue Bloods TV series 2015 episode \"The Bullitt Mustang\" centers around the reported theft of one of the Mustangs used in the film, valued at a half million dollars, a case which detectives Danny Reagan and Maria Baez pick up.Several items of clothing worn by McQueen's Bullitt received a boost in popularity thanks to the film: desert boots, a trench coat, a blue turtleneck sweater and, most famously, a brown tweed jacket with elbow patches.[47]","budget":"$5.5 million"}