{"country":"United States","distributed_by":"Lightning Pictures","Plot":"In the year 1997, violence in high schools has risen to an all-time high in some of the major cities in the United States of America. In 1999 special areas known as \"free fire zones\" have discouraged police from entering out of fear. Seattle's Kennedy High School is in the middle of a free fire zone, thus the Department of Education Defense (D.E.D.), a pilot special government agency, has been notified. Working with MegaTech head Dr. Bob Forrest, an experiment begins where three former military robots have become android educators. Forrest introduces Mr. Bryles, Mr. Hardin, and Ms. Connors to the Board of Education. Impressed with the new teachers, new principal Miles Langford has announced that former delinquents who are imprisoned will be released as part of the new experiment, which would allow new methods of discipline from the new teachers.One such delinquent is Cody Culp, a member of the Blackhearts gang. Out of prison, Cody has decided to lay low and avoid any gang warfare, especially with the rivals Razorheads, led by Hector. After a car chase, Cody and his brothers Sonny and Angel make it to school. Sonny is taken in by the new school guards after he confronts them as they check the car for weapons or drugs. Blackheart member Curt, who thanks to Angel learns Cody no longer wants to be in a gang, informs Cody that if he is not with them, then he is against them. Still, Cody sticks to laying low and attends class. In chemistry class, Ms. Connors attempts calmly talk down Hector and another Razorhead. When the two Razorheads attempt to confront Ms. Connors, she uses fighting skills to take them down and make them sit in their seats. This pleases Forrest and MegaTech, who are in the basement, disguised as a DED control center. When Mr. Hardin's history class is interrupted by a fight between Curt and Razorhead member Flavio, Hardin resorts to using corporal punishment and puts the class in line. Returning home, Cody is shocked to find his brothers and his mother are addicted to the drug known as \"edge\". Upset and angry, he leaves and goes on his motorcycle, returning home later that night.The next day, Flavio attempts to woo Christie, Mr. Langford's daughter, but when she resists his advances, he tries to force himself on her. Cody, witnessing what is happening, fights off Flavio as well as Hector. Mr. Bryles, who sees the incident, puts Cody in a full nelson hold and takes him to the principal's office. While Langford informs Cody that he technically violated his parole with the fight, he lets him off due to the fact that he did save Christie. Cody and Bryles head to physical education class, where Bryles, who is the coach, humiliates Blackheart member Mohawk while doing push-ups. When class is over, Bryles tells Cody to stay behind and begins to viciously beat him. Mohawk goes to his locker and takes some \"edge\" and grabs a gun. Cody, still being beaten, is seriously hurt when Bryles sees Mohawk with the gun. Bryles grabs the gun and breaks Mohawk's neck, killing him instantly. MegaTech technicians Marv and Spence are in total shock when Forrest informs them that it was self-defense with a gun.When Sonny shows up late to Mr. Hardin's class totally high on \"edge\", Hardin takes him to his locker. Hardin grabs the locker door and pulls it out to find vials of \"edge\" in the locker. He proceeds to take the vials and force them in Sonny's mouth and pummeling his head on the lockers. Hardin kills Sonny and upon his return to class, takes Sonny's now bloodied cross and puts it in his pocket. Cody sees the cross as Hardin gives his lecture. When Langford confronts the three teachers about the death of Sonny, it soon becomes a cover-up to say Sonny died of a drug overdose. When Christie tries to convince Cody based on her father's word about Sonny, Cody is angry and is convinced Hardin killed Sonny. Apologizing to Christie the next day, he tries to convince her that Hardin had something to do with Sonny's death and the duo skip school for evidence. Christie and Cody have the teacher directory and learn that Hardin, Bryles, and Connors live in the same apartment. They break in and Cody finds the bloody cross. However, the trio of teachers arrive and catch the duo escaping. A chase ensues and ends up with the trio in the water. Having survived the car crash in the water, the trio decide to start a war between the Razorheads and the Blackhearts.That evening, Cody and Angel once again bond over a game of basketball. When Angel, who has become a Blackheart, decides to stay behind, he is met by Bryles, Hardin, and Connors on his way home later that night. The trio chase down Angel. Bryles lifts up Angel and throws him against a wall and the trio ultimately kill him. Shortly after, Razorhead Noser is coming out of a local pizza place when he sees Connors. She kidnaps him and when the Razorheads are waiting for Noser, Noser is sent through the window of their hangout while on fire. Hector is convinced the Blackhearts did it and decide to start a war. The next morning, Cody goes to the Blackheart hangout, where he finds a dead Angel surrounded by the likes of Curt, Reedy, and Dawn. Dawn finds Angel's basketball with a message written in blood. Cody, seething with revenge, decides he wants back in the gang.That afternoon, a war ensues between the Razorheads and Blackhearts. However, Bryles, Hardin, and Connors intercept at various times, killing members from both gangs. When Cody and Reedy go inside an abandoned building to trap Hector, Hardin grabs Reedy through a wall and splits him in half with his bare hands. When Cody shoots at Hardin, he discovers he is not human. That night, Cody tries to tell the Blackhearts that Hardin was there and that he killed Reedy. Meanwhile, Langford has gotten wind of the situation and decides to have the program terminated. However, Dr. Forrest not only decides not to terminate the program, but tells Langford that the teachers must \"kill the enemy\". Bryles grabs Langford by the throat and with brute force, sticks his fingers in Langford's throat, killing him.Hector receives a call apparently from Cody saying he wants him one-on-one at the school entrance. Connors, kidnapping Christie, pretends to be Hector and calls Cody with the same proposition. When Dawn wonders why Hector would meet him at the school, the Blackhearts are finally convinced that the teachers are responsible. When Hector and Cody show up with both gangs, Cody attempts to tell Hector that it is not him he wants to kill. He tells Hector of the war the teachers have started. To prove he is right, Cody shows Hector Sonny's bloody cross. The Razorheads and the Blackhearts decide to team up and take on the teachers, who are waiting in the school. While they look for Christie and the teachers, they soon learn of the real deal with the teachers. Ms. Connors' arm becomes a flame thrower. Bryles' arm becomes a missile launcher. While many Razorheads and Blackhearts fall victim to the teachers, Curt and Cody find Christie. There, they find Hardin. They attempt to shoot down Hardin. However, Hardin is too powerful as he grabs Cody with one hand and grabs Curt with his other hand, which has become a grip with a drill attached. Curt is killed by the drill. Hardin attempts to do the same to Cody when Cody reaches for a machine gun and shoots Hardin through the mouth numerous times, destroying him instantly.Cody and Christie see Ms. Connors and are chased to the chemistry lab. Cody, noticing that Connors has an exposed area of flammable gas, distracts her in time to grab an axe. When he throws the axe at the exposed area, he and Christie run out of the lab. Connors, unleashing the flame thrower, fatally explodes due to the flame hitting the gas. Hector, the only other survivor alongside Cody and Christie, meet up with the duo and are seen by Bryles. Hector and Christie provide a distraction while Cody grabs a bus and is able to run down Bryles at the school entrance. The bus explodes but all three are safe. When they hear a noise in the school, they go check it out. However, a now half-human, half-robot Bryles escaes from under the bus.Hector, Cody, and Christie find Dr. Forrest who takes Christie hostage. When Cody tells Forrest it is too late, Forrest is convinced that he can somehow continue the project. When Hector attempts to shoot Forrest, he is shot and killed. Forrest then attempts to kill Cody, but Bryles comes up from behind him and rips his heart out, killing him instantly. Cody and Christie are at first overpowered by Bryles until Cody finds a forklift and impales Bryles. Christie grabs the nearest chain and puts it around Bryles' neck with Cody using the forklift to lift the chain, decapitating the robotic Bryles. Cody and Christie, the only survivors, walk out of the badly damaged school in safety.","language":"English","class_of_1999":"Theatrical release poster","box_office":"$2,459,895 (domestic) [1]","cinematography":"Mark Irwin","directed_by":"Mark L. Lester","Filming location(s)":"The film was shot at Lincoln High School (Wallingford neighborhood of Seattle) in 1988. It is visible on Google Streetview. In the introduction of the movie the school is clearly visible as a heavily secured area with two guard towers on top of the stairs leading to the entrance.","Awards":"The film was nominated for Young Artist Award (Joshua John Miller).","release_dates":"May 11, 1990","produced_by":"Mark L. Lester","starring":"Bradley Gregg|Traci Lind|John P. Ryan|Pam Grier|Joshua Miller|Stacy Keach|Malcolm McDowell|","running_time":"99 minutes","music_by":"Michael Hoenig","edited_by":"Scott Conrad","Release":"The film was originally scheduled to be released by Vestron Pictures through their subsidiary Lightning Pictures on October 6, 1989. However, Vestron's financial turmoil resulted in the film being sold to Taurus Entertainment Group in March 1990.[2] Taurus eventually released the film theatrically on May 11, 1990.Class of 1999 was initially released on VHS via Vestron Video in 1991 and was later withdrawn. The film was released on DVD in other territories such as Korea and Australia. Lionsgate released the film on DVD for the first time in the USA on September 16, 2008 and again in 2012 as part of an 8 horror film DVD set.In March 2015 Fangoria Magazine released the film under their banner on Hulu.[3]","written_by":"C. Courtney Joyner","budget":"$5,200,000"}