{"country":"United States","distributed_by":"Columbia Pictures","city_hall":"Theatrical release poster","Plot":"In New York City, Detective Eddie Santos and mob figure Tino Zapatti kill each other in a shootout; a stray bullet also kills a child passerby. In the wake of the tragedy, questions are raised as to why Judge Walter Stern, an old friend of the ambitious Mayor John Pappas, had previously set the criminal responsible free on probation. Pappas' loyal deputy mayor, Kevin Calhoun, decides to dig for answers. Meanwhile, legal aid Marybeth Cogan uncovers a conspiracy to smear Santos.Calhoun's investigation leads to Frank Anselmo, a Brooklyn politician who has connections to Tino's uncle, crime boss Paul Zapatti. Anselmo plants money at Zapatti's behest to order to frame Santos. Calhoun and Cogan continue to seek the truth from a number of sources, including Santos' partner and another Zapatti relative. After the murder of probation officer Larry Schwartz, they ultimately conclude that Judge Stern had to be on the take. Pappas agrees that Stern must resign.The scandal snowballs to the point where Zapatti instructs Anselmo to commit suicide rather than become an informer or go to jail. To protect his family, Anselmo shoots himself. Calhoun uncovers evidence that Pappas put Stern together with Anselmo to receive a bribe and leave the young Zapatti on the street. Calhoun soon tells Pappas there is only one choice—to quit as mayor and leave politics for good. (\"You're gonna take yourself out, John. You're gonna take yourself out.\")","language":"English","Reception":"City Hall received mixed reviews from critics and ranks 54% at Rotten Tomatoes,[2] based on 24 reviews.The movie debuted at number four at the United States box office.[3] According to the website Box Office Mojo, the film grossed an estimated $20 million in the U.S.","box_office":"$20,340,204","cinematography":"Michael Seresin","production_company":"Castle Rock Entertainment","directed_by":"Harold Becker","release_dates":"February 16, 1996 (1996-02-16)|||||","produced_by":"Harold Becker Kenneth Lipper Charles Mulvehill Edward R. Pressman","starring":"John Cusack Al Pacino Bridget Fonda Danny Aiello Richard Schiff David Paymer Martin Landau","running_time":"111 minutes","music_by":"Jerry Goldsmith","edited_by":"David Bretherton Robert C. Jones","written_by":"Kenneth Lipper Paul Schrader Nicholas Pileggi Bo Goldman","budget":"$40 million"}