{"country":"United States Canada United Kingdom Australia","distributed_by":"Columbia Pictures","screenplay_by":"Steven Gary Banks Claudia Grazioso J. David Stem David N. Weiss","story_by":"Steven Gary Banks Claudia Grazioso","Plot":"The film opens up on Christmas night in Portland, Oregon, where a man appears outside of a decorated house with flowers. On his way to the door, however, he falls into several traps and is left a mess. The culprit of these traps are revealed to be a girl and boy named Lindsey and Kevin Kingston (Aleisha Allen and Philip Daniel Bolden), whose mother has divorced their father. The two are determined to keep her single until the two reconcile.The film then introduces Nick Persons (Ice Cube), a 35-year-old child-hating bachelor/businessman, as he purchases an expensive SUV and boasts with his beloved bobble-head of Satchel Paige (voiced by Tracy Morgan), who comes to life at its own will – though only Nick can see/hear him. When he reaches his Fine Sports Collectibles shop, he witnesses the woman of his dreams, Suzanne Kingston (Nia Long). On his way to talk with her, however, he is disgusted to find that she has two kids, Lindsey and Kevin. Later that night, he runs into her on his way home, asking for a jump start as her car had broken down. After receiving an electric shock, he agrees to take her home, and once there, agrees to transport her wherever she needs to go. On New Year's Eve, he brings her to an airport to go to Vancouver for a business meeting, but her ex-husband calls to say he's sick and cannot bring the children to the airport, leaving her to put her trust in Nick.Once at her house, he meets Kevin and Lindsey for the second time and gives them \"gifts\" (a pizza coupon for Lindsey and a corkscrew for Kevin). They go to the airport, when Kevin accidentally damages Nick's car door, where Nick is beaten after Kevin learns that corkscrews are illegal to bring on planes and ditches the item in Nick's jacket pocket. They then decide to use a train, where the two kids jump off the train to collect a missing item from Kevin's doll just as Nick boards. This results in them losing their luggage. They then reluctantly decide to drive. Believing Nick is only a friend to their mother, the kids are tamed, but still misbehave and show Nick little respect. At a truck stop, the two learn from one of Nick's friends that he not only hates the two, but lied about not having feelings about their mother. They then show much less restraint and cause mayhem throughout the trip; hijacking Nick's car, injuring Nick, signaling to truck driver Al Buck (M. C. Gainey) that they have been kidnapped by Nick (resulting in heavy damage to his car startling Nick), and ultimately running away to visit their father.Once they get there, however, they learn that their father has not only moved on, but has made a new family with a baby whose age seems to outmatch their parents divorce. Discovering their father's betrayal and abandonment, they warm up to Nick, as he does with them, when he tells them that he, too, was abandoned by his father. Along the rest of the trip, the three still find themselves in several mishaps, but each setback only strengthens their relationship. However, their bond is ultimately tested when Nick's navigator is set ablaze and explodes. He angrily blames the kids but calms down, reinstates it and apologizes immediately afterwards.The trio try to hitch a ride from Al Buck, but he leaves Nick behind and drives off, still thinking Nick is a kidnapper. To Al's surprise, the kids physically attack him in the van, leading to a chase that ends when in Vancouver, where Nick fights Al, along with several men dressed as snowmen. During the fight, Kevin suddenly gets an asthma attack and collapses. Nick rushes to his aid with the inhaler and is able to revive him. Witnessing the event, Suzanne believes trusting Nick was a mistake. After encouragement from Satchel, Nick goes to Suzanne's hotel to tell her and the kids farewell for good. After Suzanne realizes how much Nick has grown to care for Kevin and Lindsey and vice versa, Suzanne realizes that Nick is the one for her and kiss on New Years during the fireworks at Lindsey's suggestion.","language":"English","Reception":"Are We There Yet? received negative reviews from film critics. The film holds an 11% approval rating on aggregate review site Rotten Tomatoes, based on 155 collected reviews, with an average score of 3.3 out of 10. The sites consensus reads: \"This supposed family comedy starring the usually blameless Ice Cube and Nia Long has provoked most critics to write, \"Is it over yet?\"[3] Metacritic gave the film a weighted average score of 27 out of 100, based on 28 sampled reviews, indicating \"generally unfavorable reviews.\"[1]The film opened at #1 with a gross of $18,575,214 in 2,709 theaters averaging $6,856 per venue. The film's opening weekend made up 22.57% of its final domestic gross. In its second weekend, the film dropped to #2 but lost just 12% of its audience, grossing a further $16,346,395, and raised the 10-day total to $38,458,267. It closed on June 16, 2005, with a final gross of $97,918,663 worldwide ($82,674,398 in North America and $15,244,265 internationally).[4]","Television series":"In 2010, Are We There Yet? premiered on TBS. The show's executive producer and creator is Ice Cube, who created and starred in the film adaptation. All of the roles from the film series are recast. Terry Crews, who previously worked with Cube in Friday After Next and Lottery Ticket, takes over the role of Nick and Essence Atkins, who was in Dance Flick and Smart Guy, takes over Nia Long's role as Suzanne. The only actor from the film series to return for the TV series is Ice Cube, who stars in a recurring role as Suzanne's brother, Terrence.","box_office":"$97.9 million","cinematography":"Thomas Ackerman","production_company":"Revolution Studios Cube Vision","directed_by":"Brian Levant","are_we_there_yet?":"Theatrical release poster","release_dates":"January 21, 2005 (2005-01-21) (United States of America)|February 18, 2005 (2005-02-18) (Finland)||||","Production":"Are We There Yet? was filmed in Campbell River, British Columbia, the Vancouver International Airport (disguised as Portland International Airport), and Portland. Most of the film was shot in Vancouver. The highway by the shoreline on the way to Whistler Mountain is the Sea-to-Sky Highway. The suspension bridge is actually the Lions Gate Bridge, above Stanley Park, and they drive over one of the many bridges that connect downtown with the southern part of the city. When Ice Cube stated on Late Night with Conan O'Brien, he mentioned that this film was originally intended as an Adam Sandler vehicle.The scene at the truck stop and the restaurant (actually called Galileo Coffee) after the kids saw their father in the window was filmed in Britannia Beach. The chase at the end where the truck chase was filmed on the Cambie Street Bridge and Dunsmuir St. between Howe and Burrard Station. The train featured in the film is Via Rail. In reality, Via Rail travels only in Canada. The Amtrak route is the Amtrak Cascades which goes through Seattle. The Pacific Central Station in Vancouver.","produced_by":"Ice Cube Matt Alvarez Dan Kolsrud","starring":"Ice Cube Nia Long Aleisha Allen Philip Daniel Bolden Jay Mohr Tracy Morgan","running_time":"93 minutes","music_by":"David Newman","edited_by":"Lawrence Jordan","budget":"$32 million"}