{"country":"United States","distributed_by":"Buena Vista Pictures (US) Pathé (UK)","screenplay_by":"Billy Ray Matthew Chapman","story_by":"Billy Ray","Plot":"Dr. Bill Capa (Willis), a New York City psychologist, falls into a deep depression after an unstable patient commits suicide in front of him by jumping from his office window. The sight of the bloody body of his patient clad in a bright green dress causes Capa to suffer from psychosomatic color blindness, taking away his ability to see the color red.To restart his life, Capa travels to Los Angeles to stay with a friend, fellow therapist and best-selling author Dr. Bob Moore (Bakula), who invites him to sit in on a group therapy session. But one night Moore is violently murdered in the office and Capa is plunged into the mystery of his friend's death.Moore would gather his patients every Monday for a discussion of their problems. Police detective Lt. Hector Martinez (Blades) considers them, and possibly Capa, suspects in the murder. Capa continues to live in Moore's house and begins an affair with Rose (March), a mysterious girl who comes and goes. He takes over Moore's therapy group and learns of their pasts and obsessions:One of these patients is violently murdered. Capa also becomes the target of several attempts on his life. He discovers that all but one of his patients have been romantically involved with Rose.This leads to a twist ending: \"Richie\" is really Rose, and the murders have been committed by her deranged brother Dale (Andrew Lowery). They once had an actual brother named Richie who was molested by a child psychiatrist named Niedelmeyer. Richie committed suicide and, unable to cope with the loss, Dale forced Rose to play the part of their brother. Dale — who was also one of Niedelmeyer's victims — began abusing Rose until she actually became \"Richie\". When \"Richie\" was arrested for drug possession, \"he\" was forced into therapy. Rose soon started to re-emerge and, under another personality, \"Bonnie\", started relationships with other members of the group. Dale proceeded to kill them, fearing that they would soon link Rose to \"Richie\".Capa confronts them and is overpowered by Dale, who is about to kill him with a nail gun but is instead killed by Rose. Deeply traumatized, she then tries to commit suicide. Capa is able to stop her, bookending the story with two suicide attempts — one at the beginning, resulting in Capa's loss of color vision, and one at the end, thwarted and resulting in his regaining it.","language":"English","Reception":"The film received mostly negative reviews around the time of its release. Rotten Tomatoes retrospectively gave it a score of 22% based on 46 reviews.[7]Referring to the film as \"memorably bizarre,\" Janet Maslin in her August 19, 1994 New York Times review wrote: \"The enthusiastically nutty Color of Night has the single-mindedness of a bad dream and about as much reliance on everyday logic.\" She also cited the revelation of the murderer, \"whose disguise won't fool anyone, anywhere.\"[8] Roger Ebert of the Chicago Sun-Times wrote: \"I was, frankly, stupefied. To call it absurd would be missing the point, since any shred of credibility was obviously the first thing thrown overboard. It's so lurid in its melodrama and so goofy in its plotting that with just a bit more trouble, it could have been a comedy.\"[9] Luke Y. Thompson of The New Times praised March's performance and wrote: \"Minority opinion here, I know, but I found the sex scenes hot and March's performance truly impressive.\" Brian McKay of eFilmCritic.com stated the film was a \"Mediocre L.A. noir thriller made more tolerable by Jane March disrobing frequently.\"[citation needed] Ken Hanke of the Mountain Xpress (Asheville, North Carolina) wrote the film was \"Underrated, but far from great.\"[citation needed]The film is listed in Golden Raspberry Award founder John Wilson's book The Official Razzie Movie Guide as one of The 100 Most Enjoyably Bad Movies Ever Made.[10]The film opened at #4, grossing $6,610,488 its opening weekend playing at a total of 1,740 theaters.[11] The film ended up a box office failure, grossing only $19,750,470—far below its $40 million production budget. The film was also a noteworthy failure internationally, grossing only $1,454,085 in the UK, $565,104 in Sweden, $112,690 in Austria, $4,725,167 in Germany, and $364,939 in Argentina.[12]Color of Night won the Golden Raspberry Award for Worst Picture, and was also nominated in eight other categories including Worst Actor (Bruce Willis also for North), Worst Actress (Jane March), Worst Director (Richard Rush), Worst Screenplay, Worst Original Song (\"The Color of the Night\"), Worst Screen Couple (\"Any combination of two people from the entire cast\"), Worst Supporting Actor (Jane March as Richie) and Worst Supporting Actress (Lesley Ann Warren).[13] The film is the first Worst Picture winner to take that award and not win even one other Razzie.[14]On more positive notes, Color of Night did win a Golden Globe nomination in the category Best Original Song — Motion Picture for its theme song \"The Color of the Night\", performed by Lauren Christy, where it lost to \"Can You Feel the Love Tonight\" from The Lion King.[citation needed] Maxim magazine also praised Color of Night for having the Best Sex Scene in film history.[3]","box_office":"$19,750,470[1]","color_of_night":"Theatrical release poster","cinematography":"Dietrich Lohmann","production_company":"Hollywood Pictures Cinergi Pictures","directed_by":"Richard Rush","Soundtrack":"The soundtrack to Color of Night as composed by Dominic Frontiere, with songs from Lauren Christy, Jud Friedman, Brian McKnight, and Lowen & Navarro was released on August 9, 1994 by Polygram Records.","release_dates":"August 19, 1994 (1994-08-19)|||||","produced_by":"Buzz Feitshans David Matalon Andrew G. Vajna","starring":"Bruce Willis|Jane March|Ruben Blades|Lesley Ann Warren|Brad Dourif|Lance Henriksen|Kevin J. O'Connor|","running_time":"121 minutes 140 minutes (Director's cut)","music_by":"Dominic Frontiere","External links":"","edited_by":"Jack Hofstra Thom Noble (uncredited)","Release":"Richard Rush turned his cut of the film over to producer Andrew Vajna in late 1993. Vajna was concerned about the film's commercial prospects and demanded a recut, something Rush refused. Nonetheless, Vajna mandated he had final cut per contractual obligation, and insisted on testing his own version of the film. After both versions were given a number of test screenings, Vajna determined that his cut would be released and fired Rush in April 1994.This ultimately escalated into a battle between Rush and Vajna that received a sufficient amount of coverage in the Los Angeles trades. Rush commented that his version tested higher than Vajna's cut; his statements were defended in Variety and film critic Bill Arnold, who attended a test screening of Rush's version in Seattle, Washington. The Los Angeles Times, meanwhile, defended Vajna, stating that Rich stubbornly refused any input from the studio. The Director's Guild of America attempted to intervene on the matter.The battle ultimately ended when Rush suffered a near-fatal heart attack and became hospitalized. Months later, after Rush recovered, he compromised with Vajna, that the producer's cut would be released theatrically and that the director's cut would see a video release.[4][5][6]","budget":"$40 million"}