{"bread,_love_and_jealousy":"Belgian poster","country":"Italy","Overview and response":"Pane, amore e gelosia is usually considered one of the most famous examples of Pink neorealism. Tina Pica won the Nastro d'Argento as Best Supporting Actress for this film.","distributed_by":"Titanus (Italy) Distributors Corporation of America (USA)","Plot":"Antonio (V De Sica) was in love with the midwife Annarella (Marisa) knowing that she has a kid son. Both of them were in love to each other, at the time the father of the kid who also serves in military will appear and with the help of the priest Dom Emidio (Virgilio) will take both of them with him.Because of posting for 20 months out side Pietro (Roberto) will go out of the village and will ask the marshal to take care of Maria (Gina). Though she was not happy with captain, but because of poverty and collecting of the dowry, she will go to serve the marshal’s house as his med Caramella (Tina Pica) was not well.The villagers will start spreading non sense about the marshal and Maria, which will reach to Pietro too. One day in a get together to the cousin’s house of Maria, marshal will dance with her, and getting pampered by out sliders both Pietro and Annarella will go there. By seeing them dancing intimately both of them break the relationship with each other. As the relationship gets broken, Maria will leave the house and will join to a dancing group. Her mother will shot help to the marshal saying that she is under aged girl. When the marshal will go for an enquiry the owner of the dance party will manage the mother of Maria with money, while marshal will come to know that she is not under age. Maria will try to seduce the marshal, but will not be success.Finally Pietro and Maria will be united and they will shift the family to the city. Marshal will come to see off them in the station. While going back, he will meet a middle aged bachelor lady joining there as a new midwife.","language":"Italian","cinematography":"Arturo Gallea","directed_by":"Luigi Comencini","release_dates":"6 December 1954 (1954-12-06)|||||","produced_by":"Marcello Girosi","starring":"Vittorio De Sica Gina Lollobrigida","running_time":"97 mins","music_by":"Alessandro Cicognini","edited_by":"Mario Serandrei","written_by":"Luigi Comencini Ettore Margadonna"}