{"country":"Japan","distributed_by":"Uplink Company (Japan) Palm Pictures (U.S.)","Plot":"Yuji Nimura (Joe Odagiri) and Mamoru Arita (Tadanobu Asano) are two factory workers, who are constantly irritated by their boss, Fujiwara (Takashi Sasano). Mamoru entrusts his poisonous jellyfish, which he has been acclimating to fresh water, to Nimura.Nimura goes to Fujiwara's house one night with the intent of hurting Fujiwara, only to find that Mamoru has already done so. Mamoru is convicted of the murder but commits suicide on death row, leaving Nimura a private message to \"go ahead.\"Mamoru's divorced father, Shinichiro (Tatsuya Fuji), takes Nimura in. Nimura helps with Shinichiro's electronics salvage business, but is still a loose cannon. He ultimately realizes he must learn to cope with his place in the world, with his responsibilities and his losses, and with the difference between the bright future he dreamed of and the stark reality he finds himself in.Mamoru's jellyfish escapes its tank and reproduces in the drains of the city (possibly by binary fission, since there is only one). Nimura takes a job at his sister's office and later encounters a gang of youths in Che Guevara T-shirts. He helps the group gain after-hours access to the office, but the police caught all but Nimura.Nimura and Shinichiro see a huge swarm of jellyfish in a man-made river, making their way out to sea. One of jellyfishes stings Shinichiro, rendering him unconscious. The gang of youths, now released from police custody, wonder what became of Nimura while they walk aimlessly down the street.","language":"Japanese","Reception":"Ed Gonzalez of Slant Magazine gave Bright Future 2 and a half stars out of 4.[3] Manohla Dargis of The New York Times gave the film a favorable review, saying: \"One of the pleasures of Mr. Kurosawa's films is how casually he tosses in ideas about contemporary life, the state of the family, the place of technology, all while steadily shredding your nerves.\"[4] Scott Tobias of The A.V. Club felt that the final tracking shot of the film is mesmerizing.[5]","box_office":"$5,166 (US)[1]","cinematography":"Takahide Shibanushi","directed_by":"Kiyoshi Kurosawa","release_dates":"January 18, 2003 (Japan)","produced_by":"Takashi Asai","starring":"Joe Odagiri Tadanobu Asano Tatsuya Fuji","running_time":"115 minutes (Original Version) 92 minutes (International Version)","music_by":"Pacific 231","edited_by":"Kiyoshi Kurosawa","written_by":"Kiyoshi Kurosawa"}