{"based_on":"Cocktail  by Heywood Gould","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Heywood Gould","Plot":"After leaving the United States Army and moving back home to New York City, Brian Flanagan (Tom Cruise) gets a part-time job as a bartender at night while studying for a business degree. Over time, he learns the tricks of the trade, including flairing, from his boss/mentor Doug Coughlin (Bryan Brown). Brian and Doug soon become very close; Doug readily assumes a mentor role over the young and naive Brian, and rains advice and opinions down upon him. His advice takes a familiar structure, as he usually begins most of them with \"Coughlin's Law\".While Brian has high personal aspirations, Doug is leery of the notion of starting their own bar together. Doug intends to call his bar \"Cocktails & Dreams\".Eventually, Brian and Doug's bar-tending act becomes popular and they end up working at a trendy nightclub catering to New York's wealthy and elite. As their popularity rises, Brian becomes the focus of attention from a sultry brunette named Coral (Gina Gershon). Quickly, their friendship becomes sexual. Doug is alarmed that Coral is coming between their work partnership and bets him Coral will leave him by week's end, essentially doubting there is anything special about the seemingly perfect relationship shared between the two. Unknown to Brian, Doug lies to Coral about secrets being shared by Brian about her, tricking her into sleeping with him. He secures his bet by sharing a passionate kiss with Coral while at work in the bar in front of Brian. Coral then tells Brian he should never have discussed their love life with Doug and so he is dumped. Brian is very upset and fights with Doug at work, essentially ending his informal partnership with Doug.The film fast-forwards three years. Brian decides to follow through with his plan and takes a job in Jamaica as a bartender to raise money for his own place. He finds a romantic partner in Jordan Mooney (Elisabeth Shue). Jordan is an aspiring artist and waitress in New York. She and Brian spend romantic times together, playing in the water, before making passionate love on the beach by a campfire. Prior to this, however, Doug has shown up in Jamaica, now married to Kerry (Kelly Lynch), a wealthy woman who openly flirts with other men and wears Tarzan-like bikinis.Doug quickly asserts himself and bets Brian to show how he can 'pick up' a new customer named Bonnie (Lisa Banes), a wealthy older woman. Jordan catches Brian without being seen and devastated,so she takes an overnight plane back home.With Jordan flying back to New York, Brian decides to upstage Doug and return to New York with the cougar-esque Bonnie under the auspices that he will be placed high up in her company due to their romantic attachment. Brian becomes impatient, as the pay-off is too slow. He reluctantly assumes a role of loverboy more than romantic partner and grows bored at doing everyday mundane things for her, such as fetching her morning carrot juice and vitamins or escorting her to social functions where it is clear he is only there as a trophy boyfriend. They have a blow-up during an art exhibition where Brian gets into a fight with the artist. As they cut ties, Brian, displaying wisdom one can only assume has been gleaned from his former mentor, states: \"All things end badly. Otherwise they wouldn't end.\"Brian then seeks out Jordan. Much to his surprise, he learns that she is pregnant with his child. He embarks on a journey to win over the independent Jordan and prove to her that, despite being just a lowly bartender, he would make a worthy father.While pursuing Jordan, Brian also learns that her family is very wealthy, and he goes to her parents' Park Avenue penthouse to speak with Jordan, who is not home at the time. Unhappy with the situation, Jordan's father, Richard Mooney (Laurence Luckinbill), attempts to buy Brian off. Although Brian was seemingly obsessed with becoming wealthy before this point, his feelings for Jordan overcome this and he quickly refuses the money, revealing the bribe to Jordan when she returns home during the confrontation with her father. Jordan refuses his advances and keeps her distance, not wanting to be hurt again.Brian meets up with Doug. Despite the outward appearance of wealth, Doug confides that his wife's money is nearly gone, lost in the commodities market. Doug is despondent, unwilling to confess to his bride the precarious position they are in; Brian is completely shocked. Later on, Kerry makes Brian take her home when Doug is too drunk to do so, and forces him to walk her to her apartment. She tells him that he is the only person Doug respects and wants to discuss with him Doug's problems. However once inside, she attempts to seduce him by kissing him. While he initially kisses her back, Brian abruptly stops it from going any further out of respect for his friendship with Doug. Kerry gets angry at being rejected and reveals that she cannot endure sexual monogamy for the rest of her life. Brian then leaves with Kerry calling him a coward.Brian goes to check on Doug in his yacht, and discovers he has committed suicide by slashing his throat with a broken bottle of Remy Martin Louis XIII / Baccarat crystal glass. After the funeral, Kerry sends Brian a letter left for him by Doug, which is revealed to be Doug's suicide note in which he explains why he did what he did. Brian cries after reading the letter, realizing that Doug killed himself because he realized that his life was a sham.Now reeling from the misfortune of the stiff-arm from Jordan and losing his best friend to suicide, he returns to Jordan's parents' home (where she is staying) and begs her again for forgiveness. He further promises to take good care of her and their unborn child. Brian has a brief scuffle with Mr. Mooney's staff, and then takes the willing Jordan by the hand and heads for the door. They leave together, finally, as a couple and future parents. Mr. Mooney pledges not to lend a dime to the fledgling couple.Brian and Jordan get married and have their wedding reception at his Uncle Pat's bar in Queens. Uncle Pat, who is the other mentor in Brian's life, loans Brian some money to finally achieve his lifelong goal; he opens a neighborhood bar called \"Flanagan's Cocktails & Dreams\". At the Grand Opening of the bar, Jordan is shown visibly pregnant. Just before the credits roll, reveals she is pregnant with twins. Brian offers free drinks to celebrate, much to his Uncle Pat's chagrin.","language":"English","Reception":"Cocktail was a financial success, earning $78.2 million at the North American box office, and $93.3 million globally to a total of $171.5 million worldwide.[2][3]The film received negative reviews from critics. Review aggregator Rotten Tomatoes reports that 5% of 39 film critics have given the film a positive review, with a rating average of 3.9 out of 10.[4] It won two Golden Raspberry Awards for Worst Picture and Worst Screenplay while Tom Cruise was nominated as Worst Actor and Roger Donaldson as Worst Director.[5] The film is listed in Golden Raspberry Award founder John Wilson's book The Official Razzie Movie Guide as one of The 100 Most Enjoyably Bad Movies Ever Made.[6]Vincent Canby of The New York Times gave Cocktail a negative review, calling it \"an upscale, utterly brainless variation on those efficient old B-movies of the 1930s and 40s about the lives, loves and skills of coal miners, sand hogs and telephone linemen, among others.\"[7] Roger Ebert of the Chicago Sun-Times was also critical of the film, explaining that \"the more you think about what really happens in Cocktail, the more you realize how empty and fabricated it really is.\"[8]","box_office":"$171,504,781[2]","cinematography":"Dean Semler","production_company":"Touchstone Pictures Silver Screen Partners III Interscope Communications","directed_by":"Roger Donaldson","Soundtrack":"Additional tracks featured in the film include:","cocktail":"Theatrical release poster","release_dates":"July 29, 1988 (1988-07-29)|||||","produced_by":"Ted Field|Robert W. Cort|","starring":"Tom Cruise|Bryan Brown|Elisabeth Shue|","running_time":"103 minutes","music_by":"J. Peter Robinson","edited_by":"Neil Travis","budget":"$20 million[1]"}