{"based_on":"Characters  by Steve Gordon","country":"United States","distributed_by":"Warner Bros.","Plot":"Arthur Bach (Dudley Moore) is still rich and still drinks too much, but he and Linda (Liza Minnelli) are now happily married. The one thing missing in their life is a child. Seeking revenge, billionaire Burt Johnson (Stephen Elliott), the father of Susan Johnson (Cynthia Sikes), the wealthy woman whom he jilted at the altar, takes control of his inheritance, leaving him broke and homeless. Susan wants him back and is willing to break up his marriage if that's what it takes.Arthur tries to sober up to rise up to the occasion and find a job, knowing his financial plight could ruin any chance he and Linda have of adopting a baby. She assures a representative from the adoption agency that, despite his drinking, he would make a good father. Through an elaborate scheme, he plots to get even with the Johnsons and get his money back. In the end, he not only is able to get his money back and adopt a child, but she discovers she's pregnant.","language":"English","Reception":"The film received generally negative reviews from critics and holds a Rotten Tomatoes rating of 13% based on 23 reviews.[1] The Washington Post opined that \"the result is about as funny as the plight of an alcoholic.\"Liza Minnelli earned the 1988 Golden Raspberry Award for \"Worst Actress\" of the year, by performing in Arthur 2 as well as Rent-a-Cop. Dudley Moore thought of the film as a failure and disowned it.The film was not a box office success; it earned $14.7 million in American ticket sales, compared to the original film's $82 million.[2]","arthur_2:_on_the_rocks":"Theatrical release poster","box_office":"$14,681,192","cinematography":"Stephen H. Burum","production_company":"Havlin--Shapiro Productions","directed_by":"Bud Yorkin","release_dates":"July 8, 1988 (1988-07-08)|||||","produced_by":"Robert Shapiro Dudley Moore","starring":"Dudley Moore|Liza Minnelli|John Gielgud|","running_time":"113 minutes","music_by":"Burt Bacharach","edited_by":"Michael Kahn","written_by":"Andy Breckman"}