{"Availability":"The film was released on VHS on August 27, 1996 but is currently on moratorium. It was later shown in an edited-for-television form on Turner owned cable television stations.On December 17, 2009, Warner Archive released the film as an official DVD.","country":"United States United Kingdom Germany France","distributed_by":"New Line Cinema","Plot":"Angus Bethune (Talbert) is a teenage boy living in Minnesota, who, despite his talents as a football player and in science class, holds deep insecurities about himself. Since kindergarten, he has been regularly harassed by handsome Rick Sanford (Van Der Beek), and his complacent cohorts, for not being \"normal\" due to being overweight and is, in their view, \"named after a cow\". His only friend is Troy Wedberg (Owen), who is also a social outcast like him. He also has feelings for Melissa Lefevre (Richards), though he is fearful of expressing it because she is dating Rick. Eventually, tired of the abuse from Rick, he applies for a magnet school where he hopes to be free of the constant humiliation. However, well aware of his feelings for Melissa, Rick rigs an election so that they will dance together in the upcoming freshman Winter Ball as King and Queen, respectively. While confronting Rick about the stunt, he is ordered by the principal not to lay a hand on Rick or he would be expelled and lose his chance to go to the magnet school.To get ready for the dance, Angus gets help not only from Troy, but also his mother, Meg (Bates), and his narcoleptic grandfather, Ivan (Scott). Ivan tells him about a dance move called the Irish Swoon that he claims is a guaranteed lady-pleaser, but Angus fears that his largeness makes him an inept dancer and would embarrass both him and Melissa. To fix this, Ivan takes him to Madame Rulenska (Moreno), where despite his best efforts, he comes out worse than before (and injures her in the process). Later on, despite his request for a black tuxedo and wanting to be normal, Ivan purchases him a plum one and tells him that he can be normal and an individual at the same time. He tells him that running away to another school will not solve anything and that he needs to stand up against Rick while he still can. He also mentions that he doesn't let anyone tell him that his relationship with April (Anna Thompson) is a mistake because she is 30 years younger than him and they see each other as perfect. One day after football practice, Angus opens his locker and sees that his favorite pair of boxers is missing. He and Troy later learn with their own eyes that Rick hoisted them up the flagpole for the school to see, which then fly squarely onto Melissa's face as she passes by. Angus storms home in anger, but Rick and company quickly kidnap Troy. Outside the school, they ask him for anything that would embarrass Angus at the Winter Ball. He refuses their request and tries to escape, only to break his arm as he trips to the floor while Rick gives him an ultimatum. At home, Meg tells Ivan that having Angus transfer to a magnet school would be for the best. She hates seeing him suffer another day with humiliation and does not think Ivan has the right answers. He tells her that letting Angus run away from his bullies to another school is a mistake and that he needs to stop fearing humiliation by standing up for himself. He admits he never let her run away from her problems and admires how strong she is today.Meanwhile, Angus helps Ivan prepare for his and April's wedding. As Angus waits outside Ivan's room on the day of the wedding, he confides with him about his love for Melissa. Angus admits he is proud of him because he has the strength to not care if everyone else sees his marriage to April wrong since they love each other. When he tries to wake him, Angus quickly discovers that he has died. Distraught, Angus opts to stay home for a few days trying to cope with Ivan's death. By that time, fearful that Rick will hurt him even more, Troy gives him the videotape containing the footage of Angus practicing his dancing with an inflatable doll while confessing his feelings for Melissa.Later that week while cleaning up from the wedding, Angus receives a box from April and opens it, revealing the plum suit that he had earlier rejected when Ivan bought it for him regardless. In that moment, he realizes that Ivan was right all along. Angus needs to stand up for himself and stop fearing Rick or nothing will change. Resolved to grant Ivan's wish to do so, he rejects an interview from the science school he applied to, wears the suit, and marches to the school gymnasium, where the dance is held. Outside, Troy warns him to turn around and return home because Rick has something bad planned for him. Angus rebuffs his request, revealing he is sick of enduring humiliation from Rick so he is taking Ivan's advice by standing up for himself and marches inside anyway. He meets Melissa, and they converse for the first time. He is surprised when she tells him she is nervous because everyone will be staring at them. As they are introduced to the students, Rick plays Troy's videotape on the monitors, and the students laugh. A humiliated Melissa runs out in tears and Angus follows her, very infuriated with Troy for betraying him by helping Rick out to humiliate them both. Outside, he apologizes, but she does not blame him. Surprisingly, she shows her disgust with Rick and reveals to Angus that she is bulimic. She also mentions that Rick is very controlling and also abusive towards her and the other students, making them fear him. Angus learns that Melissa likes him because he is kind and respectful of others. Finding common ground, they go back inside and dance, even as she helps him out with some of the steps. After they receive a mild reception from the students, Rick scolds her, while Angus comes to her defense. Rick begins shoving Angus until his back is against a table. Rick threatens him by telling him it is \"time he broke his nose,\" implying payback for the times he broke Rick's when they were children. Angus starts to egg him on and tells him to take his best shot. Rick surprises Angus with a hard punch to the face, breaking Angus's nose and sending him flying and then crashing through a table. Angus also suffers a concussion. With him down, Rick sarcastically tells him \"welcome to high school\" and adds that he's glad he's leaving the school. Melissa had tried to intervene to stop Rick before the punch, but afterwards she is silent, awestruck by Rick's act of power and violence. In spite of his broken nose, Angus managed to get to his feet fairly quickly. It is here that Angus finally confronts him and petitions him to realize that there are in fact many people that don't fit his idea of \"normal,\" and are unwittingly ostracized for it, and are fed up with the humiliation. However, Rick selfishly refuses his plea by replying \"Whatever I am, it's something you're never gonna be.\" to which Angus replies \"Thank God!\" basically saying that he would rather be an awkward large kid with a kind heart, instead of a malevolent, selfish and vain jerk like him. The students congratulate Angus for taking a stand against Rick. Melissa dances with Angus again and Troy enacts a little revenge on the jock by breaking his nose with his cast and impressing his crush.In the end, Melissa asks Angus if he would walk her home, which Angus does, and they kiss before Melissa retires for the night. Angus rejects the offer to transfer to Jefferson High School to which he first applied after he takes his stand against him. He realizes that his grandfather was right that he doesn't have to run away anymore making him the victor in his battle with Rick and his peers. It is also leaned that Rick has been suspended for his video prank against him during the Winter Ball dance.","language":"English","Themes":"During the film, Angus takes counsel from two people: Troy Wedberg, a small and geeky boy who attempts to turn him into a \"large pathetic virgin with a new look\" by giving him an edgier style and encouraging him to exercise in hopes that he will look more attractive; and Ivan, an assured yet narcoleptic crank who readies himself to marry a woman thirty years his junior, who encourages Angus to go to the ball by ordering him to stop caring about what everyone else will think of him and his pairing with Melissa. Thus we are introduced to two opposing ideals of which he must choose: Adopt a new personality that would give him the long-term acceptance he longs, or overcome his shame and accept himself as a unique individual. The question is exemplified in a scene where he, Ivan, and Troy shop in a tuxedo store, where the only suit available in Angus' size comes in plum. Troy mocks it (\"Put it on a dead guy and bury it.\") while Angus begs Ivan to buy a more \"socially acceptable\" black one even though all of the store's available black ones fit him too tightly. Ivan, however, insists that the suit will benefit Angus by making him even more \"different.\"The film also features a recurring symbolism based around an experiment Angus conducts in hopes of getting into the science school. This is introduced in his science class, where he posits that a foreign element introduced into a homogeneous system will be rejected and destroyed. He puts a drop of a red substance into an environment composed solely of a blue one, and the red one explodes in a puff of smoke. This is later directly related to his own attempts to be himself in the largely homogeneous high school crowd. In one scene, an overhead shot reveals that he is the only person wearing red at a pep rally full of students wearing the school color (blue).At the end of the film, Angus further explains the experiment, in how in some rare situations the red substance is not destroyed by the blue one, but overcomes it and radically alters the base which is symbolized by the plum purple suit he wears during the climax of the film.Noteworthy is the performance of newcomer Charlie Talbert, who was scouted in an Illinois Wendy's,[1] as the title character and the interaction between Angus and Ivan, whose philosophy can be summed up in his recurring line: \"Screw 'em!\"Early in production, the film contained scenes wherein Angus' father was gay, reflecting the original story. Producer Dawn Steel at first approved the idea, but upon seeing a test screening she asked director Johnson to cut it. Hence, it is said early in the film that he died when Angus was born.In addition, deleted and extended scenes are integrated into the cut-for-television version of the film to make up running time.[2]","Reception":"Some critics consider the film as a superficial after-school special for its familiar underdog story and inherent preachiness. As such, it scores a 40% \"rotten\" rating on Rotten Tomatoes.[3] It was released in a wave of other obesity-related films that came out at the time, notably Heavyweights (1995), which went for mostly comedy, and Heavy (1996), which was a strong drama. It straddled the fence between comedy and drama, at points to its detriment to some critics.Some reviewers conclude that it more accurately portrays high school life than similar films about adolescence, since it takes a critical view of obesity, bullying, self-esteem, and high school inclusiveness, while highlighting the importance of assuring oneself in an ideologically competitive world. Reviews of note in this camp is Roger Ebert's 3 star review, starting \"Here it is at last, at long last, after years and years and years: A movie where the smart fat kid gets the girl and humiliates the football hero.\"[4]The film's lead, Charlie Talbert, was also given mixed reviews. Rita Kempley of the Washington Post said \"Charlie Talbert, a 16-year-old discovered in line at an Illinois Wendy's, brings neither experience nor charisma to the title role of this stock tale of petty adolescent cruelties.\"[5] Emanuel Levy,[who?] while giving the film a \"C\", conceded Angus was \"played by newcomer Charles M. Talbert with a certain charm.\"[6] Ebert's review of the film concludes with \"Charlie Talbert is a good casting choice for Angus, because he isn't a \"sort of\" fat kid, like those models in the King Size catalog who look about 12 pounds overweight. He is fat. But he is also smart, likable, resilient and engaging. And he has the gift of deflecting his shortcomings with humor.\"[4]","box_office":"$4.8 million","cinematography":"Alexander Gruszynski","production_company":"BBC Atlas Entertainment Turner Pictures","directed_by":"Patrick Read Johnson","angus":"Theatrical poster released in 1995","Soundtrack":"The film's soundtrack accurately reflects the melodic ideas prevalent in the alternative rock scene at the time. Most of the bands perform songs that closely resonate with its themes while keeping a fast yet upbeat tone, a sharp departure from the age of grunge, which had just reached its twilight. Weezer's initial offering, a song entitled \"Wanda (You're My Only Love)\" (or sometimes just \"Wanda\"), was written specifically for the film but rejected for being \"too much of a strict interpretation of the movie\" and for not sounding enough like what was expected of Weezer at the time. The previously written, more uptempo \"You Gave Your Love to Me Softly\" was used instead, and the rejection of the former song was known to have hurt Weezer's singer and songwriter Rivers Cuomo at the time. Though Weezer never properly recorded \"Wanda\", Cuomo released his 1994 demo of the song (along with the story of the song's submission and rejection) in 2007 on the album Alone: The Home Recordings of Rivers Cuomo.The unique version of \"Am I Wrong\" by Love Spit Love, mixing marching band horns into its original version which interplay well with Richard Butler's raw vocals. Green Day contributed \"J.A.R. (Jason Andrew Relva)\", a song written by bassist Mike Dirnt about his friend who died in a car accident when he was 19. It peaked at number one on the Modern Rock Billboard charts of 1995. It was later released on their 2001 greatest hits album, International Superhits. Meanwhile, Green Day singer Billie Joe Armstrong co-produced \"Back to You\" by the Riverdales with producer Mass Giorgini, which was featured during the dance sequence at the high prom in the film.The music supervisors for the film were Elliot Cahn and Jeff Saltzman, who, at the time, also managed two of the soundtrack's artists: Green Day and The Muffs.","release_dates":"September 15, 1995","Box office":"The film was released theatrically in North America on Friday, September 15, 1995 on 1,154 screens.[7] It debuted in eighth place amidst the crowded box office. It opened against Hackers and Clockers, while To Wong Foo, Thanks for Everything! Julie Newmar, Dangerous Minds, The Usual Suspects, and Braveheart were still having a strong showing in box office numbers.[8] To Wong Foo, Thanks for Everything! Julie Newmar ultimately won the weekend with $6,544,960 as it expanded to 1,448 screens.In its second weekend, Sept 22–24, the film slipped to twelfth place with $1,314,839 from 1,156 screens, its widest release (a percentage drop of 31.3%). Se7en opened on this weekend and won the box office with $13,949,807 from 2,441 screens.[9]","produced_by":"Dawn Steel","starring":"Charlie Talbert George C. Scott Kathy Bates Chris Owen Ariana Richards James Van Der Beek Rita Moreno","running_time":"87 min.","music_by":"David E. Russo","edited_by":"Janice Hampton","written_by":"Jill Gordon","budget":"$1.5 million"}