{"distributed_by":"Ellman Enterprises","bigfoot":"Theatrical release poster","Plot":"Fast-talking Jasper B. Hawks (John Carradine) drives through a forest with his sidekick, Elmer Briggs (John Mitchum), while pilot Joi Landis (Joi Lansing) flies a single engine small aircraft over the same area. Joi’s engine conks out, so she parachutes to safety. Safely on the ground, she encounters a Bigfoot that has emerged from the woods to attack her.Laconic biker Rick (Christopher Mitchum) rolls into the woods with his girlfriend, Chris (Judy Jordan) who stumbles onto a Bigfoot burial ground, and then is also under attack by a Bigfoot.A skeptical Sheriff's department and the ranger's station are notified of the women's disappearance, but to no avail, with respect to the authorities actually making a search for the missing women. Biker Rick seeks help, but only Jasper believes his story; Jasper offers aid because he plans to capture a Bigfoot for freak show exhibition.Meanwhile, Peggy (Joy Wilkerson), is captured and tied up next to Joi. Jasper, Elmer, and Rick trek through the woods until they reach the Bigfoot lair. The creatures, it turns out, who have been guarding the women are just the female versions of a huge male Bigfoot. He shows up and goes on a rampage until finally being blown-up by Rick's dynamite-wielding bikers.","language":"English","Reception":"Bigfoot was a low-budget production saddled with poor production values, including problems in casting as well as acting, but has other characteristics that mark it as a cult classic. Despite not being shown in traditional distribution, the film was reviewed by eminent film critic Roger Ebert, who said: \"The cast alone convinced me. Let me put it as simply as I can: If you have ever wanted to see a movie starring John Carradine, Joi Lansing, Lindsay Crosby, Chris Mitchum, and Ken Maynard, then 'Big Foot' is almost certainly going to be your only chance. Not since Joan Crawford starred in 'Trog!' there been such an opportunity.\" Ebert, however, was very much aware how hopeless Bigfoot was.[4]","cinematography":"Wilson S. Hong","production_company":"Gemini-American Productions","directed_by":"Robert F. Slatzer","release_dates":"January 1970","Production":"Portions of Bigfoot were shot in mountain wilderness locations in northern California where some Sasquatch sightings have been reported over the years. Outdoor scenes were shot at Tehachapi Mountains, California.[1]Casting actor John Carradine as Jasper B. Hawks, legendary mountain man/big-game hunter, is clearly seen to be an arthritic, somewhat emaciated senior citizen oddly dressed in a regular suit and tie. Another actor who is miscast is Christopher Mitchum, the son of screen legend Robert Mitchum. He is supposed to be a rough and tumble tough-guy biker, but comes across as polite and subservient to Hawks. Lindsay Crosby, the son of Bing Crosby also appeared in the film. The female roles are similarly miscast with Joy Wilkerson, Judy Jordan and Joi Lansing, merely seen as curvaceous props. For both Lansing and western star Ken Maynard, Bigfooot marked their last screen roles.[2]Bigfoot was typical of the low-budget features that emerged in the 1970s.[3] In toggling back-and-forth between location shots with the principal actors, and sound stage shots of the same scenes, the production becomes disjointed. The soundtrack, oddly has upbeat honky-tonk music playing over suspense scenes; incongruous surfer-music is heard whenever the bikers are riding around.","produced_by":"Anthony Cardoza","starring":"John Carradine John Mitchum Christopher Mitchum","running_time":"84 minutes","music_by":"Richard A. Podolor","edited_by":"Hugo Grimaldi Bud Hoffman","written_by":"Robert F. Slatzer"}