{"country":"India","distributed_by":"Eros International","screenplay_by":"K. V. Vijayendra Prasad Kabir Khan Parveez Shaikh","story_by":"K. V. Vijayendra Prasad","Plot":"In Sultanpur, a picturesque village in Pakistan administered Kashmir, villagers gather to watch a televised cricket match between India and Pakistan. Among them is a pregnant woman (Meher Vij) who, after giving birth, names her daughter Shahida after Shahid Afridi, the player who wins the game for Pakistan. One afternoon, Shahida (Harshaali Malhotra), now six years old, falls off a cliff and is saved by an overhanging tree. Shahida being mute was not able to call for help. She would have been able to call for help if she was able to speak. Her concerned mother takes her to the shrine of Sufi saint Nizamuddin Auliya in Delhi, with the hope that it will restore Shahida's speech.Returning from Delhi, the train stops for repairs and Shahida gets off to save a lamb. Unbeknownst to Shahida, the train drives off. Shahida boards a freight train, and winds up in Kurukshetra in the state of Haryana. There, she meets Pawan Kumar Chaturvedi alias Bajrangi (Salman Khan), a devout Brahmin and an ardent devotee of the Hindu deity Hanuman. He calls Shahida \"Munni\" and tries in vain to find where she lives.In sequences of flashback, it is revealed that Bajrangi has been a disappointment to his father, because Bajrangi failed his school exams ten times. When Bajrangi finally graduates on his eleventh try, his father dies of shock. Bajrangi, looking for a job, goes to the house of his father's friend and wrestling coach, Dayanand (Sharat Saxena), in Delhi. Having spent time together with his daughter Rasika (Kareena Kapoor Khan), they fall in love with each other and Dayanand promises Rasika's hand in marriage on the condition that Bajrangi get a job and a separate house for himself. In the present, Bajrangi brings Munni to meet Dayanand, who lets Munni stay, believing that with her fair complexion, Munni must be a Brahmin as well. Munni gets accustomed to being part of the household. It is eventually revealed that Munni is a Pakistani Muslim. An enraged Dayanand orders Bajrangi to make arrangements to have her sent to Pakistan through the Pakistan Embassy, where Bajrangi's pleading fails. He is betrayed by a local travel agent who claims to be able to take Munni to Pakistan without a passport but actually takes her to a brothel, causing him to take Munni to her parents in Pakistan, in person and without a passport and visa.Bajrangi and Munni are able to enter Pakistan. Shortly after their arrival, Bajrangi is arrested, suspected of being an Indian spy. He escapes with Munni and meets Chand Nawab (Nawazuddin Siddiqui), a journalist who works for a Pakistani television channel. Nawab has closely been following the developments. Moved by the story, Nawab joins Bajrangi to help him find Munni's parents. They are joined by an Islamic religious scholar (Om Puri), who helps them avoid capture by police. He directs the group to Pakistan occupied Kashmir after Munni recognizes an area similar to her hometown in a photo from a calendar.Nawab documents their journey on video, but no television station agrees to air it. Disappointed, he uploads the video on the Internet. While reviewing the footage, Munni recognizes her mother walking by in the background. With a bus driver's assistance, the trio identify Sultanpur as Munni's hometown. They board a bus to Sultanpur, and are stopped by police who are looking for \"the Indian spy\". Devising a plan to divert their attention, Bajrangi gets off the bus and runs toward the jungle in full view. He gets tracked down, beaten, and shot in the arm. Meanwhile, Nawab and Munni reach Sultanpur, where Munni is finally reunited with her mother.The videos uploaded by Nawab go viral throughout India and Pakistan. A compassionate senior officer, Hamid Khan (Rajesh Sharma), realizes that Bajrangi is innocent, and has him released, defying the order to keep him in jail, which he felt would be petty on the part of Pakistan. Thousands of Pakistanis come to see Bajrangi off and Indians come to receive him. As Bajrangi crosses the border, Shahida, who is also in the crowd, runs toward the fence and cries out for him with her now regained speech. Bajrangi is ecstatic to see her and they run towards each other and embrace.","language":"Hindi","bajrangi_bhaijan":"Theatrical release poster","box_office":"est. ₹626 crore (US$93 million)[3]","cinematography":"Aseem Mishra","production_company":"Salman Khan Films Kabir Khan Films","directed_by":"Kabir Khan","Music":"The soundtrack of the album is composed by Pritam with lyrics written by Mayur Puri, Amitabh Bhattacharya, Neelesh Misra and Kausar Munir. The soundtrack album consists of eleven tracks.[20]The movie includes the qawwali \"Bhardo Jholi Meri Ya Muhammad\" sung by the Sabri Brothers. The qawwali was revamped with the voice of Adnan Sami Khan. EMI Pakistan and Amjad Sabri qawwal, heir to the Sabri brothers, have called for legal action against the producers of the film and the qawwali in separate instances.[21][22]","release_dates":"17 July 2015 (2015-07-17)|||||","Production":"The principal photography began on 3 November 2014 in New Delhi, with Salman Khan and Kareena Kapoor Khan participating. The second filming schedule took place at the ND Studios, Karjat. The third schedule of the film was held in Mandawa, Rajasthan. On 7 January 2015, Khan was seen on the top of castle of Mandawa playing cricket with a young boy.[6] On 10 January 2015, Khan shot with school students in Rajasthan's Jhunjhunu district.[7] Shooting of the film was completed on 20 May. Some scenes of the film were shot at Khan's Panvel farm house.[8] Shooting of Bajrangi Bhaijaan also took place in Kashmir Valley in places like Sonmarg and Zoji La.[9][10][11][12] The film's climax scene was shot at Sonmarg near the Thajiwas glacier (at 10,000 ft above sea level) with around 7,000 people.[13][14][15] Nawazuddin Siddiqui's character Chand Nawab was inspired by a real character Chaand Nawab, who was with Karachi-based Indus News in 2008.[16][17][18][19]","Box office":"Bajrangi Bhaijaan grossed ₹333 crore (US$49 million) worldwide in its first week,[27] beating the previous record of ₹332 crore (US$49 million) worldwide by PK. The film went on to net ₹3.15 billion (US$47 million) and ₹4.26 billion (US$63 million) gross[28] in India [29][30] and grossed ₹1.792 billion (US$27 million) overseas for a worldwide gross of ₹6.03 billion (US$90 million) in 31 days[28][31] and currently is the second highest-grossing Bollywood film of all time in domestic markets and Second highest-grossing Bollywood film of all time in international markets.[32] Bajrangi Bhaijaan became the quickest film to collect ₹1 billion (US$15 million)[33] and ₹2 billion (US$30 million) net domestically beating PK and Dhoom 3.[34] The distributor share of the fim has crossed ₹150 crore (US$22 million) crore which is a record in India being the second film to do so after PK.[30][35] In August 2015, Eros International said in a statement to the Bombay Stock Exchange that Bajrangi Bhaijaan has become fastest Bollywood film to gross ₹500 crore (US$74 million) worldwide, while it crossed the ₹300 crore (US$45 million) at the domestic box office.[36][37]The film is the highest nett grosser ever in Delhi / UP, CP Berar, CI, Bihar, Assam and Orissa, East Punjab, Rajasthan and West Bengal beating the lifetime collections of PK and Dhoom 3. The footfalls of the film crossed 3.52 crores after five weeks which makes it the most watched film since Gadar: Ek Prem Katha in 2001 and beating PK, 3 Idiots, Dhoom 3 and Kabhi Khushi Kabhi Gham.[28][38][39] Bajrangi Bhaijaan grossed ₹626 crore (US$93 million) worldwide at the end of its 7th week run.[3] The Indian gross for the film was ₹424 crore (US$63 million)[40] while overseas gross was US$29 million (₹193.39 crore).[3]Bajrangi Bhaijaan opened to an overwhelming response at the domestic box office and went on to break the first week record of PK and Happy New Year. The film grossed around ₹270 million (US$4.0 million) in India on the first day of release,[41] and further showed incredible growth on its second and third day to net ₹350 million (US$5.2 million) setting new records in several circuits,[42] and ₹385 million (US$5.7 million) on first Sunday to take its first weekend total to ₹1,005 million (US$15 million), which is an all-time first weekend record, becoming the quickest film to collect ₹1 billion (US$15 million) net domestically.[33][43] The film grossed ₹255 million (US$3.8 million) on its first Monday which is highest ever non-holiday Monday and[44][45] ₹21.25 crore (US$3.2 million) its first Tuesday and ₹20 crore (US$3.0 million) on its first Wednesday and on Thursday ₹16 crore (US$2.4 million) to take its first week nett total to ₹183.52 crore (US$27 million) nett to make highest first week total for an Indian film in domestic markets beating previous record holder PK.[46]The film net. grossed ₹13.50 crore (US$2.0 million) on its second Friday.[47][48][49] The film showed further growth and nett. grossed ₹20.05 crore (US$3.0 million) on second Saturday and ₹24.05 crore (US$3.6 million) on second Sunday to make ₹57.50 crore (US$8.5 million), which is the highest 2nd weekend ever for an Indian film and to take its India total to ₹240.72 crore (US$36 million) in ten days and made highest 2nd weekend ever for an Indian film.[50] Bajrangi Bhaijaan grossed around ₹10 crore (US$1.5 million) on second Monday to take its 11 days nett. Bajrangi Bhaijaan grossed around ₹9.3 crore (US$1.4 million) on second Tuesday, ₹9.1 crore (US$1.4 million) on second Wednesday ₹9.3 crore (US$1.4 million) on second Thursday.Bajrangi Bhaijaan grossed ₹87 crore (US$13 million) nett which is the second highest 2nd week collection of all time to take its two-week domestic nett. gross to ₹270.50 crore (US$40 million).[51]Bajrangi Bhaijaan nett. grossed ₹4 crore (US$590,000) on its third Friday. Bajrangi Bhaijaan showed growth and nett. grossed ₹6.08 crore (US$900,000) on its third Saturday. Bajrangi Bhaijaan further showed growth and nett. grossed ₹9.08 crore (US$1.3 million) on its third Sunday to take its third weekend to ₹20 crore (US$3.0 million) which is the second highest 3rd weekend of all time. the film netted around ₹20 crore (US$3.0 million) in its third weekend, reaching ₹292 crore (US$43 million) nett in seventeen days in India to become second highest-grossing Bollywood film of all time in domestic markets beating Dhoom 3.[52] The film went on to gross ₹1.53 billion (US$23 million) overseas for a worldwide gross of ₹540 crore (US$80 million) in just 17 days.[31] Bajrangi Bhaijaan set a new all time lifetime record in India by becoming the highest grosser ever in Bihar as it went to the ₹7.50 crore (US$1.1 million) nett mark after its third weekend.[53] Bajrangi Bhaijaan nett. grossed ₹3.50 crore (US$520,000) on its third Monday, ₹2.50 crore (US$370,000) on second Tuesday and ₹2.43 crore (US$360,000) on second Wednesday to take its 19 days total to ₹300.6 crore (US$45 million) in India and become only the 2nd Indian film to do so.[54] Bajrangi Bhaijaan recorded the third highest third week ever as it grossed ₹2.50 crore (US$370,000) on third Thursday to make its week total to ₹30 crore (US$4.5 million) .[55][56]Bajrangi Bhaijaan grossed ₹7.25 crore (US$1.1 million) in its fourth weekend.[57] The film grossed ₹10.65 crore (US$1.6 million) in its fourth week,₹3.78 crore (US$560,000) in its fifth week,₹1.49 crore (US$220,000) in its sixth week,₹0.65 crore (US$97,000) in its seventh week,₹0.195 crore (US$29,000) in its eighth week. The film collected ₹0.11 crore (US$16,000) in its ninth week becoming it the second film to collect more than 10 lakhs nett in ninth week after Vicky Donor of this decade.The film now entered its tenth week and becoming the only fourth film of this decade to do so,The other films are Vicky Donor , The Dirty Picture and Band Baaja Baaraat which are made up of low budgets.[58] It is a rare record for a film at this scenario where every week multiple movies are releasing.Bajrangi Bhaijaan grossed around $8.1 million in the first weekend in overseas markets, which is the second highest opening weekend for a Hindi film.[59][60] The film has grossed around $2.45 million in its first weekend in US-Canada.[61] Bajrangi Bhaijaan grossed ₨4.5 crore (US$440,000) in Pakistan in first 3 days of its release,[62] and subsequently ₨6 crore (US$590,000) in the first week.[63][64][65] The ten-day overseas gross of Bajrangi Bhaijaan is US$17 million plus.[66][67] At the end of two weeks, Bajrangi Bhaijaan grossed US$20 million in overseas. Bajrangi Bhaijaan grossed around $23.5 million in overseas in 17 days.[68][69] Bajrangi Bhaijaan has set an all-time record in the Gulf with collections of₹47.9 crore (US$7.1 million) till date to become the highest grossing film in the territory beating films like Happy New Year and Dhoom 3.[32] The film is also the biggest Salman Khan film in The Gulf, beating previous best of Kick were around $4.1 million.[32] The film has done excellent across all Overseas market according to Box Office India. In the United Kingdom film cross ₹15.96 crore (US$2.4 million) thus far and ₹44.7 crore (US$6.6 million) has come from the United States.[31] Bajrangi Bhaijaan grossed $27 million in overseas after fourth week (28 days).[70] ×The film tops all 4 major markets by beating the lifetime collection of PK. The film grossed £2,650,000 at United Kingdom,$9,450,000 at gulf and Au $1,701,000 at Australia. The film grossed $8,180,000 after its sixth weekend in US/Canada.[71]","produced_by":"Salman Khan Rockline Venkatesh","starring":"Harshaali Malhotra|Salman Khan|Nawazuddin Siddiqui|Kareena Kapoor|","running_time":"159 minutes[1]","music_by":"Songs: Pritam Background score: Julius Packiam","edited_by":"Rameshwar S. Bhagat","Release":"Bajrangi Bhaijaan was released on 17 July 2015, one day before Eid, on 4,100 and 800 screens in India and overseas respectively.[23][24] The film was also released in 50 countries outside India, on more than 700 screens.[25] Bajrangi Bhaijaan premiered at the 20th Busan International Film Festival (BIFF) on 6 October 2015.[26]","budget":"₹90 crore (US$13 million)[2]"}