{"country":"Spain United States","distributed_by":"Dimension Films","Plot":"Forty years after an unfinished occult ritual resulted in the disappearance of six young children, an American family has moved into a never-before inhabited house in Spain. The mother, Maria (Olin), wants to get the place in order, while the father, Mark (Glen), goes to work, and their children, teenager Regina (Paquin) and her younger brother Paul (Enquist), try to settle into their daily routines.It helps that Mark's doctor-father, Albert Rua (Giannini) has furnished them with their residence and is nearby, especially when Mark begins to suffer from seizures again due to the progression of his Huntington's disease, which also causes him to become increasingly mentally unstable. Regina is not only worried about him, but also Paul who is now scared of the dark for the first time. The young boy has reason for that, however, as there seems to be some sort of supernatural entity beneath his bed. Furthermore, there are instances when ghostly figures of children are seen standing in the shadow and darkness, watching the family.As Paul becomes more scared and their father continues to mentally deteriorate, Regina eventually figures out it must have something to do with their home where the power is lost every day. With the help of her new friend, Carlos (Martinez), the two eventually meet the man, Villalobos (Reixach), who designed the house, and learn that it was built for a supernatural ritual requiring the sacrifice of seven children (each sacrificed by \"hands that love them\") to coincide with an eclipse that only occurs every forty years. With the next one quickly approaching, and now armed with the knowledge that the earlier occult ritual needs one more death to be completed, Regina races to make sure that Paul is not the final victim.Stopping first at her grandfather Albert's house to warn him as well, Regina finds out that her grandfather is, in fact, a member of the cult which has been performing these satanic rituals. Her grandfather explains that in the ritual forty years ago, there actually were seven children in the original ritual, the seventh child being none other than Regina's father, Mark. Albert did not sacrifice his son because at the last minute he realized that he did not love Mark. Waiting 40 years he has brought Mark and his family to the house with the intention of completing the ritual during this eclipse. Regina also discovers the target is not Paul but still Mark, who is to be sacrificed by \"hands that love him.\"Armed with this knowledge, Regina races back to her home to find her father in the midst of another attack, choking on pills as the eclipse begins. Maria tries to perform a tracheotomy on him, but is unable to bring herself to make the cut. Regina does instead, but Mark bleeds out and dies when the supernatural forces within the house hide the tube needed to complete the procedure. Since Regina genuinely loved Mark, the ritual is finally complete. The darkness then takes the form of Regina and Paul, convincing their mother to turn off the lights. The darkness kills Maria, and then takes the form of Regina's friend Carlos, who picks them up in his car; shortly after they leave, the real Carlos arrives at the house, only to be killed. The movie ends as Carlos' doppelgänger drives Regina and Paul into a dark tunnel, implying their doom and meeting their demise.","language":"English","box_office":"$34,409,206","cinematography":"Sylvia Steinbrecht","production_company":"Fantastic Factory","directed_by":"Jaume Balagueró","release_dates":"October 11, 2002 (2002-10-11) (Spain)|||||","produced_by":"Julio Fernández Brian Yuzna","starring":"Anna Paquin Lena Olin Iain Glen Giancarlo Giannini Stephan Enquist","running_time":"102 minutes","darkness":"Promotional poster","music_by":"Carles Cases","Release":"The film premiered in Spain on October 3, 2002, and was then given a wide release on October 11, 2002. It later was released in a number of European countries throughout 2003, and was then sold to Miramax Films, but was shelved for nearly two years.[2] It was eventually released in the United States through Miramax's Dimension Films branch on December 25, 2004.[3] It was given an even later release in the United Kingdom in March 2005.Darkness received extremely negative reviews from both critics and general audiences. It currently holds a 4% rating on Rotten Tomatoes based on 53 reviews. It received an \"F\" CinemaScore, indicating overwhelmingly popular dislike.[4]The New York Times said: \"Darkness, which crept into theaters nationwide on Christmas Day, tries to spook holiday revelers with a guessing game about which member of a handsome American family, relocated to Spain, will kill another. But the real mystery is why such a mangled film was not junked altogether.\"[5] Owen Gleiberman of Entertainment Weekly said the film is \"a horror movie so vague about the nightmare it’s spinning, it seems scared of its own shadows... Darkness was clearly tossed together like salad in the editing room, since it’s little more than the sum of its unshocking shock cuts.\"[6] The Village Voice also gave the film a middling review, saying \"Moments hint at a metaphoric statement on child abuse, but the film proves mainly to be a commentary on poor electrical wiring.\"[7]Variety praised the film's cinematography, but criticized its script: \"Although director Balaguero displays a talent for spooky visuals and creating an atmosphere of quietly simmering tension, his screenplay (co-written by Fernando de Felipe) is a compendium of barely connected scenes that ultimately lapse into incoherence.\"[8]Despite many negative reviews and very little promotion, Darkness still did moderately well at the United States box office.[3] It was released Christmas Day 2004, which was a Saturday. It was the seventh highest earner that weekend with $6.1 million (at $3,625 average per theater), earning over half of its budget over two days.[3] The following week it dropped to tenth highest earner with $4.6 million. Darkness eventually earned $34.4 million worldwide, with a $10.6 million budget.","written_by":"Jaume Balagueró Fernando de Felipe","budget":"$10.6 million"}