{"Cast":"In Body Double is a film within a film sequence with Frankie Goes to Hollywood performing the song \"Relax\"[3] on the set of a porn film,[citation needed] and in which scream queen Brinke Stevens,[4] and adult actresses Cara Lott and Annette Haven appear.[citation needed]Slavitza Jovan, who appeared as Gozer the Gozerian in Ghostbusters the same year, 1984,[5] briefly appears as a saleslady.[4]Actor Rob Paulsen, known for voicing the Teenage Mutant Ninja Turtles also appears in the film.[6]Director Brian De Palma originally considered Annette Haven to play the lead female role that eventually went to Griffith. Before filming he commented, \"I'm already thinking of casting. I don't know if there're any good young porno stars out here, but the older ones - Annette Haven, Seka - some of them can really act. And Annette Haven has a terrific body.\"[7]Cast in the other female leading role, Deborah Shelton[4] had been Miss USA 1970 and runner-up in the Miss Universe pageant.[citation needed]","country":"United States","distributed_by":"Columbia Pictures","Plot":"Jake Scully (Craig Wasson) is a struggling actor who has lost his role as a vampire in a low-budget horror movie after his claustrophobia thwarts shooting. After returning home to discover his girlfriend cheating on him, he is left without a place to stay. At a method acting class he meets Sam (Gregg Henry) who closely monitors Scully's revelation of his fears and the childhood cause of his claustrophobia. They go to a bar where Scully is offered a place to stay; Sam's friend has left town temporarily and needs a house-sitter for his ultra-modern home in the Hollywood Hills.Scully is shown the house that night. Sam is especially ecstatic about one feature: a female neighbor, Gloria Revelle (Deborah Shelton), who erotically dances at a specific time each night. Sam has even set up a telescope which Scully can't resist using voyeuristically to watch her. One night he sees Gloria being abused by a boyfriend. When she goes shopping the next day, Scully decides to follow her. Gloria's behavior seems strange; she makes calls to an unknown person promising to meet them. He also notices a disfigured \"Indian\", a man he had noticed watching Gloria a few days prior. Scully follows her to a seaside motel where apparently Gloria has been stood up by the person she was there to meet. On the beach the Indian suddenly snatches her purse. Scully tries to pursue him but in a nearby tunnel his claustrophobia restrains him and he needs to be \"rescued\" by Gloria who walks him out of it. They begin to impulsively and passionately kiss before she retreats. That night Scully is again watching through the telescope when the Indian returns. The man is seen breaking into Gloria's home. Scully races to save her but is attacked by Gloria's vicious dog. Gloria is brutally murdered by the Indian with a huge handheld drill.Scully is then left to alert the police, who assume it was simply a fumbled robbery. Detective McLean (Guy Boyd), however, becomes suspicious of him after finding a pair of Gloria's panties in his pocket. Although McLean doesn't arrest him, he coldly tells Scully that due to his voyeuristic behavior, as well as not alerting the police sooner, is what helped caused Gloria's murder. Unable to sleep, Scully watches a pornography channel on television when he observes that the actress on screen, Holly Body (Melanie Griffith), dances in exactly the same sensual way that he saw Gloria dance. Now suspicious of Holly, he pretends to be a porn producer hiring for a new film so that he can meet Holly. In the process, he even ends up acting in a hardcore film himself.Scully invites her to the house. During his talk with Holly, he learns she was hired by Sam to impersonate Gloria each night, dancing in the window, with Sam knowing Scully would watch her and later witness the real Gloria's murder. Holly is offended at the suggestion she was involved in a killing. After storming out, she is picked up by the Indian who knocks her unconscious and drives her away. Scully follows them to an aqueduct where the Indian is digging a grave. They fight, at which time he discovers that the Indian is actually Sam in heavy make-up. Scully was a scapegoat providing Sam with an alibi during the murder. (Sam was also Gloria's abusive boyfriend.) Scully is overpowered and is thrown into the grave. However, he overcomes his fear and climbs out as Sam is accidentally knocked into the aqueduct by his own dog (the same dog that attacked Scully during Gloria's murder, which was actually Sam's dog) where both perish.During the end credits Scully is shown having been recast in his previous role as a vampire. Holly is there watching, as an actress doing a nude scene is then replaced by a body double.","Locations":"The film was shot in the Los Angeles area and includes such locations as Tail o' the Pup, the Beverly Center, Barney's Beanery, the Farmer's Market, the Rodeo Collection mall on Rodeo Drive, the Spruce Goose dome in Long Beach, the Hollywood Tower and adjacent Hollywood Freeway, Tower Records, and the Chemosphere.[8]","language":"English","Critical reception":"The movie was largely dismissed by some critics upon release and even denounced outright by others.However, Roger Ebert praised the movie giving it three and a half out of four stars.[9] The film developed a dedicated cult following which remains strong today perhaps due to its directorial and aesthetic indulgences, its early 1980s new wave soundtrack, and the use of iconic Los Angeles locations.[citation needed]Review aggregator Rotten Tomatoes reports that 79% of critics have given the film a positive review based on 28 reviews, with an average rating of 6.6/10.[10]The movie's trailer won a Clio Award in 1984.[11]","box_office":"$8,801,940 (USA)","Remake":"Body Double was remade in 1993 in India as Pehla Nasha. The film was directed by Ashutosh Gowariker in his directorial debut. Deepak Tijori plays the lead role alongside Pooja Bhatt, Raveena Tandon and Paresh Rawal.","cinematography":"Stephen H. Burum","directed_by":"Brian De Palma","release_dates":"October 26, 1984 (1984-10-26)|||||","produced_by":"Brian De Palma","starring":"Craig Wasson|Gregg Henry|Melanie Griffith|Deborah Shelton|","body_double":"Theatrical release poster","Cultural impact":"Body Double is referenced repeatedly throughout the Bret Easton Ellis novel American Psycho as the favorite film of the protagonist serial killer Patrick Bateman.[citation needed] He mentions that he has seen the film 37 times and rents the tape of it from a video store several times in the story. He also repeats scenes from the film to the reader or to other characters.[citation needed]","music_by":"Pino Donaggio","edited_by":"Gerald B. Greenberg Bill Pankow","written_by":"Brian De Palma Robert J. Avrech","budget":"$10,000,000 (estimated)"}