{"based_on":"A Chorus Line  by James Kirkwood, Jr. and Nicholas Dante","a_chorus_line":"Theatrical release poster","country":"United States","distributed_by":"Columbia Pictures MGM (2003 and 2014, DVD and Blu-Ray DVD)","screenplay_by":"Arnold Schulman","Plot":"A group of dancers congregate on the stage of a Broadway theatre to audition for a new musical production directed by Zach (Michael Douglas). After the initial eliminations, sixteen hopefuls remain. Arriving late is former lead dancer Cassie (Alyson Reed) who once had a tempestuous romantic relationship with Zach but left him to take a job in Hollywood. Now she hasn't worked in over a year, and is desperate enough for work to even just be part of the chorus line and audition for him; whether he's willing to let professionalism overcome his personal feelings about their past remains to be seen.As the film unfolds, the backstory of each of the dancers is revealed. Some are funny, some ironic, some heartbreaking. No matter what their background, however, they all have one thing in common: a passion for dance.","language":"English","Critical reception":"The film received mixed reviews from critics. In his review in The New York Times, Vincent Canby observed, \"Though it was generally agreed that Hair would not work as a film, Miloš Forman transformed it into one of the most original pieces of musical cinema of the last 20 years. Then they said that A Chorus Line couldn't be done - and this time they were right . . . Mr. Attenborough has elected to make a more or less straightforward film version that is fatally halfhearted.\"[3]Roger Ebert of the Chicago Sun-Times stated, \"The result may not please purists who want a film record of what they saw on stage, but this is one of the most intelligent and compelling movie musicals in a long time - and the most grown up, since it isn't limited, as so many contemporary musicals are, to the celebration of the survival qualities of geriatric actresses.\"[4]Variety said, \"Chorus often seems static and confined, rarely venturing beyond the immediate. Attenborough merely films the stage show as best he could. Nonetheless, the director and lenser Ronnie Taylor have done an excellent job working within the limitations, using every trick they could think of to keep the picture moving. More importantly, they have a fine cast, good music and a great, popular show to work with. So if all they did was get it on film, that's not so bad.\"[5]Time Out London says, \"The grit and drive of the original have been dissipated into studiously unkempt glitz as empty as plasticised pop . . . It's too corny and unbelievable for words.\"[6]Kelly Bishop, the original stage Sheila, noted, \"It was appalling when director Richard Attenborough went on a talk show and said 'this is a story about kids trying to break into show business.' I almost tossed my TV out the window; I mean what an idiot! It's about veteran dancers looking for one last job before it's too late for them to dance anymore. No wonder the film sucked!\"A Chorus Line currently holds a 38% rating on Rotten Tomatoes.","box_office":"$14,202,899","cinematography":"Ronnie Taylor","production_company":"Embassy Film Associates PolyGram Filmed Entertainment","directed_by":"Richard Attenborough","Awards":"The film was nominated for the following awards:Note: At the Golden Globes, A Chorus Line lost out in both categories to Prizzi's Honor, while at the BAFTA Awards it lost out in both categories to Amadeus.","DVD":"A Chorus Line was released to DVD by MGM Home Entertainment on April 15, 2003 as a Region 1 widescreen DVD, with a re-release in new packaging on January 14, 2014 and a Blu-ray release on the same date.","release_dates":"December 13, 1985 (1985-12-13)|||||","Production":"Following the smash success of the Broadway production, Hollywood producers expressed interest in a motion picture version of the musical. Many directors turned down the project, insisting that not only was A Chorus Line too beloved, but it would not translate well to the screen. Even Michael Bennett, the stage musical's director, declined to participate when his proposal to present the film as an audition to cast the movie version of the stage play, instead of a literal translation of the play, was rejected. When Attenborough accepted the project, there was some apprehension as to the treatment the British director would give the musical's quintessentially American story.In February 1984, according to Sir Richard Attenborough, the singer Madonna auditioned at the Royale Theatre on Broadway for a dance role in his movie using her birth-name of Ciccone. He rejected her.[2]The decision to tamper with the score disappointed fans of the show. \"Hello Twelve, Hello Thirteen, Hello Love,\" \"Sing!,\" and \"The Music and the Mirror\" were deleted and new songs \"Surprise, Surprise\" and \"Let Me Dance For You\" were added. The show's breakout tune, \"What I Did for Love,\" originally was performed as a paean to dancers and their dedication to their craft, but in the film it becomes a wistful love song by Cassie about Zach as she leaves the stage.The stage musical was one of the first to address the subject of homosexual actors within the theatre business, but some overt references to it were eliminated from the film.The dance numbers were choreographed by Jeffrey Hornaday.","produced_by":"Cy Feuer","starring":"Michael Douglas|","running_time":"113 minutes","Musical numbers":"The songs \"And...\", \"Sing!\", and \"The Tap Combination\" from the stage version are eliminated in the film, as well as most of \"The Montage\" (Hello 12, Hello 13, Hello Love)","music_by":"Marvin Hamlisch Edward Kleban","edited_by":"John Bloom","budget":"$25 million[1]"}