{"based_on":"Alvin and the Chipmunks  by Ross Bagdasarian The Chipettes  by Janice Karman","country":"United States","distributed_by":"20th Century Fox","Plot":"During a benefit concert in Paris, France, David Seville is injured from a backstage accident. Having to recuperate there, Dave asks his aunt Jackie to look after the Chipmunks, Alvin, Simon and Theodore. Arrangements are also made for them to go to school at West Eastman High School. After Jackie also causes an accident, the Chipmunks are left in the care of Toby, Jackie's grandson.Meanwhile, Ian Hawke lives in the basement of JETT Records. Three singing female chipmunks, Brittany, Jeanette, and Eleanor, also known as The Chipettes, emerge from a FedEx package and Ian hires them as plot to get back at the Chipmunks and revive his career.While at school, the Chipmunks are ridiculed by jocks, who threaten to kill them for drawing their girls' attention away from them. They chase the Chipmunks around the school and try to drown Simon in a toilet. They visit the principal's office, only to discover that the principal, Dr. Rubin is a huge fan, and enlists their help to raise money for a music program by participating in a contest. Meanwhile, Ian is shocked to find the Chipmunks on the front page of his newspaper. After he reads a story about them, he quickly sends the Chipettes to school.When the Chipmunks meet the Chipettes, a rivalry forms after the former group learns that the latter group are with Ian. Meanwhile, Alvin becomes popular with the jocks and joins the football team, not realizing that the next game is during the concert. At the concert, Theodore and Simon tell the fans that Alvin did not show up and that they cannot perform, leading to a victory for the Chipettes. When Alvin finally shows up after the concert is over, he finds the auditorium empty, Brittany calls him out for lacking responsibility and is ignored by his brothers at home.Soon the Chipettes are hired, but learn that the concert they are to perform as an opening act for a Britney Spears concert at the Staples Center is on the same night as the school contest. Ian convinces them to blow off the battle and perform at the concert, but refuses to give the same credit to Jeanette and Eleanor that he gives Brittany. She demands that they all perform together or not at all, until Ian threatens to send them to a barbecue restaurant unless they perform.Before the Battle Of The Bands, Alvin receives a call from the Chipettes who tell him that Ian has locked them in a cage, so Alvin races off to rescue them while Simon tells Jeanette how to open the cage over the cell phone. Simon and Theodore are on the verge of going out to perform until the others arrive just in time to perform at the contest. The Chipmunks and the Chipettes perform together and receive the money for the music program. Dave, who had left the hospital upon learning that Toby was looking after the Chipmunks, returns during the contest happy to see his boys again. Meanwhile, Ian gets into more trouble at the concert of Staples Center he set up for the girls when he attempts to imitate them only to be taken away by the security guards. After the contest, Dave allows the Chipettes to stay with them.In the mid-credits, Dr. Rubin has the jocks scrape the gum off from under the bleachers in the gymnasium. In the post-credits, Ian is thrown into a dumpster.","language":"English","Reception":"The review aggregator Rotten Tomatoes reports that 21% of 82 critics have given the film a positive review, with a rating average of 3.9 out of 10.[4] The site's general consensus is that, \"This Squeakquel may entertain the kiddies, but it's low on energy and heavily reliant on slapstick humor.\"[5] On Metacritic, which assigns a normalized rating out of 100 to reviews from film critics, has a rating score of 41 based on 20 reviews.[6]Owen Gleiberman of Entertainment Weekly graded the film a C-.[7] Gleiberman wrote in his review with this question: \"Will kids eat up this cutely fractious claptrap? Of course they will. They'll eat up whatever you put in front of them. But that doesn't make The Squeakquel good for them.\"[7] Sue Robinson from Radio Times said that \"even if there's little here for older viewers to enjoy, youngsters will love the slapstick action and catchy soundtrack.\"[8]Some reviews were positive, such as Joe Leydon, writing for Variety, calling it \"a frenetic but undeniably funny follow-up that offers twice the number of singing-and-dancing rodents in another seamless blend of CGI and live-action elements.\"[9] Betsy Sharkey of the Los Angeles Times commented on Betty Thomas' direction, saying that she brings \"a light campy touch as she did in 1995's The Brady Bunch Movie.\"[10]After the film had garnered $112 million worldwide at the box office over its first weekend, some critics were disappointed that it was more popular than other movies in wide release aimed at a family audience.[11][12] Richard Corliss of Time wrote that families \"could have taken the cherubs to The Princess and the Frog or Disney's A Christmas Carol, worthy efforts that, together, took in only about a fifth of the Chipmunks' revenue in the same period\".[13]On its opening Wednesday, the film opened to #1 with $18,801,277, and finished the weekend at #3 behind Avatar and Sherlock Holmes[14] with $48,875,415 and a $75,589,048 5-day total, eclipsing its budget in only five days. Domestically, it is the 9th highest grossing film of 2009, and on March 7, 2010, it outgrossed its predecessor to become the second highest grossing film to never hit #1 behind My Big Fat Greek Wedding.[15] Alvin and the Chipmunks: The Squeakquel ended its run with $219,614,612 domestically and $223,525,393 overseas with a total of $443,140,005 worldwide, which is higher than its predecessor.[2]","box_office":"$443,140,005[2]","cinematography":"Anthony B. Richmond","production_company":"Fox 2000 Pictures Regency Enterprises Bagdasarian Company Dune Entertainment","Marketing":"Alvin and the Chipmunks: The Squeakquel is a video game based on the movie. It was released on December 1, 2009 (the same day as the movie's soundtrack) only for the Wii and Nintendo DS.Alvin and the Chipmunks: The Squeakquel was released on DVD/Blu-ray/Digital Copy on March 30, 2010 in North America, on April 12, 2010 in the United Kingdom and on June 2, 2010 in Australia.","directed_by":"Betty Thomas","alvin_and_the_chipmunks:_the_squeakquel":"Theatrical release poster","Soundtrack":"Alvin and the Chipmunks: The Squeakquel: Original Motion Picture Soundtrack is the soundtrack based on the film. It was released on December 1, 2009. Bands Honor Society and Queensberry, along with Filipino singer Charice, were all featured artists for both the movie and soundtrack.","release_dates":"December 23, 2009 (2009-12-23)|||||","produced_by":"Janice Karman Ross Bagdasarian","starring":"Zachary Levi David Cross Jason Lee Justin Long Matthew Gray Gubler Jesse McCartney Amy Poehler Anna Faris Christina Applegate","running_time":"88 minutes","Sequels":"Shortly after the film's release on DVD and Blu-ray, Fox and Regency had announced that Alvin and the Chipmunks 3D was scheduled to be released on December 16, 2011.[19] The title was then changed to Alvin and the Chipmunks: Chipwrecked.[20] On January 22, 2011, Fox 2000 Pictures started production on the film during a Caribbean cruise on the Carnival Dream ship. Filming took place primarily on the ship's upper, open decks with scenes featuring actor Jason Lee (reprising his role as David Seville) and the antics of The Chipmunks in the Carnival Dream's outdoor recreation areas. Stops on the itinerary included Cozumel, Roatan, Belize and Costa Maya (which provided tropical backdrops for many of the movie's shipboard scenes).[21] A fourth film, Alvin and the Chipmunks: The Road Chip, was released on December 18, 2015.[22]","music_by":"David Newman","edited_by":"Matthew Friedman","written_by":"Jon Vitti Jonathan Aibel Glenn Berger","budget":"$70 million[1]"}