{"country":"India","distributed_by":"UTV Motion Pictures","story_by":"Anurag Basu Tani Basu","language":"Hindi","barfi!":"Theatrical release poster","box_office":"est. ₹248 crore (US$37 million)[3]","cinematography":"Ravi Varman","production_company":"Ishana Movies","directed_by":"Anurag Basu","narrated_by":"Ileana D'Cruz","release_dates":"14 September 2012 (2012-09-14)|||||","Production":"I tried to make the story linear. But it wasn't working See, Barfi is a very simple story. If I had kept the narrative linear then I'd have lost my audience. I think if I had removed the non-linear narrative you wouldn't have enjoyed the film. I know Indian viewers gets disturbed by non-linear narrations. I wrote Barfi straight. But it was boring that way.During the production of his previous directorial venture Kites (2010), the director Anurag Basu wrote a two-page short story which was later developed to the script of Barfi!.[5] The film script that Basu wrote alternated between two time periods, and he retained the nonlinear narrative structure. He said that the script required a 30-year time span for the characters' love to grow and thus set the backdrop of the film in the 1970s.[6]In June 2010, Anurag Basu confirmed that his film would feature three lead roles, a deaf and mute man, a mentally challenged girl, and a narrator.[7] With former titles like Khamoshi or Silence, media reports said the story was grim or dark. However, Basu stated that on the contrary, the film was happy.[8] According to Basu, he paid homage to Buster Keaton and Charlie Chaplin by adding scenes inspired by the era of silent cinema and using physical comedy in the film, involving silent portions.[9]Ranbir Kapoor was the first choice of director Anurag Basu and Katrina Kaif was the first choice for the role of the narrator. In March 2010, The Times of India reported that Ranbir Kapoor and Katrina Kaif were signed to play lead roles in the film, then titled Khamoshi and later Silence, which Basu confirmed.[10] Basu wanted to cast a new girl from Kolkata for the autistic character.[11] Basu's wife, Tani suggested Chopra's name for the role. However, Basu feared that audience would see \"the Priyanka Chopra\" and not the character due to Chopra's stardom.[11] Basu explained \"I had the fear that I would see Priyanka Chopra in the character and Jhilmil wouldn’t work. This has happened in many films where known faces have harmed the character.\"[11] Priyanka Chopra was cast to play the part but, the development was not announced as Basu wanted to workshop first and see how it goes. After three days of workshop, Basu was convinced that Chopra could play the autistic part and reflected that he was glad that he chose Chopra for the role.[11][12] Later, Basu revealed that he did not approach any actress other than Chopra for the autistic part.[6] After Chopra was cast in the film, Kaif left the project for unknown reasons.[13] Media reported that she may have opted out of the film because Chopra had been given a stronger role.[14] Later, media reported that Asin was approached to play the role of the narrator, replacing Kaif.[15] However, Asin was never signed to the project. Media reported that no other actress wanted to sign for the film because according to them, the autistic part was stronger. In July 2010, Mumbai Mirror reported that Chopra was ready to play the role of narrator and leave the autistic role, so that another actress could be cast in the film; Chopra did not want the film to stall.[16] Basu confirmed this development and said, \"It’s true we’ve been unable to cast the other part.\" After facing several casting problems, Basu chose to cast a completely new fresh face to play the second female role.[17] In early December 2010, Ileana D'Cruz from south Indian films, was finalised for the second female lead, featuring as narrator and Kapoor's first love interest in the film.[18]Ranbir Kapoor played the role of a deaf and mute man in the film. According to Kapoor, he took inspiration from screen legends such as the Academy Award winning actor, Roberto Benigni, Charlie Chaplin and his grandfather Raj Kapoor.[19] Due to the protagonist's physical disability, Basu did not want to use any sign-language but, some behavioral patterns in the film.[20] Kapoor described his character as a regular, happy-go-lucky and good hearted guy.[21]Priyanka Chopra played the role of Jhilmil. Basu described Chopra's role as the \"toughest\" in the film.[11] In order to prepare for the role, Chopra visited several mental institutions and spent time with autistic people. She said she had to research a little for the role because in India awareness about autism is very low.[22] Chopra told that she had to let go of every inhibition probably that she had as a Hindi film heroine and play Jhilmil without thinking of it. She explained that she needed two moments to become Jhilmil because she didn't identify with her character due to difference between her thought and behavior.[23]D'cruz, who portrayed the narrator and first love interest of the protagonist said \"Shruti, is such a sensitive role to play as she goes to different phases in the film.\"[24] According to Basu, after Kapoor, Chopra and D'cruz's character Saurabh Shukla's character as Inspector Dutta was the most important. Basu described the role as \"amazing\" character, who makes others cry when he laughs.[25]Principal photography commenced in March 2011.[26][27] Barfi! was shot between June 2011 and February 2012, mostly in Darjeeling.[28] In March 2011, Basu visited Kolkata to finalize the locations within the city. Filming in Mumbai began on 20 March 2011 and continued until May 2011.[29] In June 2011, the cast and crew shot in Darjeeling.[30] In December 2011, some scenes were filmed on the outskirts of Coimbatore, especially Pollachi and Ooty.[31] The scenes in which Kapoor's character is chased by policemen over the roof tops were shot in Kolkata at the end of January 2012.[32] Shooting was completed by April 2012, except for some scenes featuring Chopra. The producers postponed the release from 13 July to 31 August 2012 as the September 2011 shooting schedule was cancelled and was waiting to be shot.[8][33] However, Basu began working on Ileana's dubbing portions by end of April 2012, because D'Cruz was unfamiliar with the Hindi language and wanted to learn it whilst filming.[34]","running_time":"150 minutes[1]","budget":"₹40 crore (US$5.9 million)[2]","screenplay_by":"Anurag Basu","Plot":"Murphy \"Barfi\" Johnson (Ranbir Kapoor) is an optimistic, street-wise, charming young man who was born deaf-mute to a Nepali couple in Darjeeling. His mother died when he was a baby and his father raised him alone, while working as a chauffeur. Barfi is known as a troublemaker – he cuts lampposts, plays practical jokes on innocent people, and is chased by Sudhanshu Dutta (Saurabh Shukla), a local police officer. Barfi meets Shruti Ghosh (Ileana D'Cruz), who has just arrived in Darjeeling; she is engaged to Ranjit Sengupta (Jisshu Sengupta), and is due to get married in three months, and Barfi is immediately smitten with Shruti. She also falls in love with Barfi but her mother dissuades her from pursuing him because he could not take care of her with his disabilities and lack of money. Shruti takes her mother's advice, gets married, and moves to Kolkata, breaking all contact with Barfi.Meanwhile, Barfi's father falls ill and Barfi must somehow raise the money for his treatment. After an unsuccessful attempt to rob a local bank, he tries to kidnap Jhilmil Chatterjee (Priyanka Chopra) – Barfi's autistic childhood friend and wealthy heiress of her grandfather's fortune – for a ransom. Upon arriving, Barfi finds she has already been kidnapped. He sees her in a van, sneaks inside and drives Jhilmil away from the ransom delivery. He hides her in his apartment with the police in pursuit. Barfi collects the ransom but finds that his father has died just as he makes the payment. Dejected, Barfi tries to leave Jhilmil at the village of her caretaker, but she refuses to leave him and they soon move to Kolkata, where Barfi assumes responsibility for Jhilmil and takes care of her.Six years later, Barfi and Shruti meet by chance. Shruti is unhappy with her marriage and she and Barfi rekindle their friendship, much to the chagrin of the lovestruck Jhilmil, who then goes missing. Shruti files a missing person report for Jhilmil. The Darjeeling police learn about the report, resume their pursuit of Barfi and arrest him. As he is being interrogated, another ransom demand for Jhilmil is made and she is apparently killed in the process of the exchange, though her body is never found. In order to conclude the case, the police try to frame Barfi for Jhilmil's murder. Policeman Sudhanshu Dutta, who grew fond of Barfi after investigating him for his nuisances, asks Shruti to take him away, offering him a second chance at life. She agrees and hopes that now Jhilmil is gone, she can finally be with Barfi.Barfi is deeply affected by Jhilmil's loss and finds living with Shruti unfulfilling. He finds the location of Jhilmil's childhood home and takes Shruti to look for her. They find that Jhilmil is still alive, and that both kidnappings were fabricated by her father so he could embezzle money from Jhilmil's trust fund. In the second attempt, second time, they faked her death so that she could return to her special-care home, away from her alcoholic mother. Barfi has a happy reunion with Jhilmil and the two are married, while Shruti spends the rest of her days alone, regretting the loss of her chance to be with Barfi.Several years later, Barfi is shown to be gravely ill in a hospital and is close to death. Jhilmil arrives and lies with Barfi in his hospital bed as Shruti narrates that the two died peacefully together, not wanting to leave each other behind in life or death. The film closes showing the happy days of Barfi and Jhilmil as credits roll.","Reception":"The film received critical acclaim, with critics praising the performances, the direction, the screenplay, the cinematography, the music and the positive portrayal of physically disabled people.[54] Zee News gave the film 5 out of 5 stars and said, \"[a]ll in all, Anurag Basu’s Barfi! is a perfect sweet treat for his audience. Like it has been discussed, those film makers who have been portraying the handicapped as dull and boring in their films must take a lesson from Barfi!.[55] Madhureeta Mukherjee of The Times of India gave the film a 4/5 rating and said, \"Ranbir, in the most challenging performance of his career leaves us 'dumbstruck'. Without use of conventional crutches of cool-catchphrases, dhamaakedar-dialogbaazi, bare-bodies, and other 'items'; he stuns you in every single frame. For Priyanka, there's only one word – Bravo! In a role where she needs to under-emote, she does so brilliantly (delivering an incredible performance).\"[56]Roshni Devi of Koimoi said, \"Barfi! leaves you with that warm, cuddly, magical feeling with a few tears to match. It’s really worth a watch\" and gave it an overall score of 3.5 stars out of 5.[57] Taran Adarsh of Bollywood Hungama gave the film 4 out of 5 stars and said, \"Barfi is akin to a whiff of fresh air. Its foremost triumph is that it leaves you with a powerful emotion: Happiness!\"[58] Indo-Asian News Service gave the film 4 out of 5 stars and said, \"Barfi! comes as close to being a modern masterpiece as cinematically possible. To miss it would be a crime. To embrace it is to serenade the sublime\".[59] Aniruddha Guha of Daily News and Analysis rated the film 4 out of 5 and remarked that movie \"engages you at a personal level\", and further added that, \"Barfi cannot be missed. It demands patience, but the payoff is incredible\".[60]Pratim D. Gupta of The Telegraph said, \"The brilliance of Barfi! is that it’s no story and all storytelling. It’s about a director at the top of his game orchestrating terrific talent into a bravura crescendo. Only someone who has showed death the door can open windows to life like this.\"[61] Filmfare gave the film 4 out of 5 stars and stated, \"Barfi! is that rare film that can make you smile and make you cry in the same scene. Its technical brilliance is only outdone by its emotional complexity and depth. Pritam's music adds a nice silent-era charm to this already fantastic story, making it an occasion when words simply aren’t enough.\"[62] Raja Sen of Rediff.com has given 3.5/5 stars and wrote, \"Barfi! is a well-crafted script with an intriguing back-and-forth narrative but it all goes south towards the end.\"[63]Anupama Chopra writing for Hindustan Times gave it 3 out 5 stars and wrote, \"[t]his is a film made with love, bolstered by wonderfully etched vignettes, Ranbir Kapoor's stupendous performance and a gorgeous soundtrack by Pritam. And yet, for me, Barfi was a singularly frustrating experience there was so much to like, but the film never became more than the sum of its parts\".[64] Rajeev Masand of CNN-IBN gave 3 out of 5 stars and said, \"Barfi had the potential to be great cinema, but as it stands it's a respectable film that's still better than a lot else you're likely to see.\"[65] On the contrary, Namrata Joshi of Outlook felt that \"The flashback within flashback narrative gets way too clumsy and turgid, the thriller twist absolutely pointless [....] appears much too crafted and self-consciously gorgeous, and feels eminently facile and plastic\".[66]The movie received critical acclaim overseas as well. It holds an 83% fresh rating on review aggregation site Rotten Tomatoes.[67] Rachel Saltz of the New York Times said, \"Bollywood isn’t afraid to be mawkish. “Barfi!” is at times, though not noticeably more so than most Hindi movies, despite its premise of special lovers with a special lesson to teach.\"[68] Lisa Tsering The Hollywood Reporter called the movie \"a refreshingly non-commercial exercise\" and added that \"poignant Bollywood romantic comedy\". On the performances of the cast she wrote, \"[...] Basu has guided Kapoor and especially Chopra to turn in exceptionally restrained, organic performances.\"\"[69] Ronnie Scheib of Variety wrote, \"Unlike Michel Hazanavicus’ black-and-white silent homage “The Artist,” Basu’s film bursts with sound and color; only the speaking- and hearing-impaired Basu is condemned to silence.\"[70] Gary Goldstein of the Los Angeles Times was more critical of the film, despite praising aspect including \"the hard-working cast, a lush score, exotic location shooting and scattered warmth\" called it as \"more endurance test than entertainment.\"[71]Barfi! has received various awards and nominations in categories ranging mostly from recognition of the film itself, to its cinematography, direction, screenplay, and music, to the cast's performance. The film was selected as India's official entry for the Best Foreign Language Film nomination for the 85th Academy Awards.[72] The film received thirteen nominations at the 58th Filmfare Awards, winning seven, including Best Film, Best Actor for Kapoor and Best Music Director for Pritam.[73][74] Barfi! received twenty-three nominations on the 19th Screen Awards, winning nine, including Best Actor for Kapoor, Best Director for Basu and Jodi No. 1 (Best Pair) for Kapoor and Chopra.[75][76][77] At the 14th Zee Cine Awards, Barfi! received nine nominations, and swept eight awards, including Best Film, Best Director for Basu and Best Actress for Chopra.[78][79]","Soundtrack":"Pritam composed the music and background score of the film, and Swanand Kirkire, Ashish Pandit, Neelesh Misra and Sayeed Quadri wrote the lyrics. The soundtrack album has six original songs. The soundtrack was influenced by Brazilian Bossa nova.[35] Priyanka Chopra was supposed to sing a track for the film, but her contract with Universal Music prevented her from taking the offer.[36] The soundtrack album also contains a song titled Fatafati, sung by Pritam, which was not be used in the film, but was released as a promotional single on YouTube on 10 September 2012 with a video containing behind-the-scenes footage. Some additional vocals are sung by Ranbir Kapoor. \"Fatafati\" also has some Bengali lyrics written by Amitabh Bhattacharya.[37]Barfi!'s soundtrack received positive reviews by critics. Hindustan Times rated the album 4.5 out of 5 stars and stated, \"[o]verall, the soundtrack is a joyride sans flaws. Pritam has given many hits, but like his tunes in Life in a... Metro, this one will be remembered for breaking the monotony in his sound. There are no foot-tapping numbers or remixes here, but the simplicity that makes this album a winner.\"[38] Koimoi gave the album 4.5 out of 5 stars and stated, \"In simple words, Barfi! is excellent music on all counts. Very rarely does one get to hear an album where you can hear a complete soundtrack without skipping tracks; this is one of them. So, just play, enjoy the music and the world of Barfi!\".[39] Joginder Tuteja of Bollywood Hungama rated the album 3.5 out of 5 stars and stated \"Barfi!'s soundtrack is quite good and is easily one of the best quality creations by Pritam. He has totally reinvented himself with this album which defies Bollywood norms and boasts of a sound of its own.\"[40]","Box office":"Upon its release, Barfi! started strongly at multiplexes throughout India, with around 80-90% occupancy, but had lower opening takings because of a limited release.[80] The film grossed ₹85.6 million (US$1.3 million) on its opening day.[81] Its second day saw an increase of around 35% occupancy and collected ₹115 million (US$1.7 million).[82] In its opening weekend, the film grossed ₹340 million (US$5.1 million).[45] In its first week, Barfi! collected ₹565 million (US$8.4 million) nett,[83] and by its eighth day had earned ₹32.5 million (US$480,000) despite the release of Heroine.[84] Barfi! earned ₹150 million (US$2.2 million) in its second weekend.[85] Barfi! had a good second week where it has collected ₹242 million (US$3.6 million) nett.[86] In the third week, the film's takings rose to ₹158 million (US$2.3 million) nett.[87] and it took ₹61.5 million (US$910,000) in its fourth week.[88] During its cinematic release period, Barfi! earned a gross total of ₹1.06 billion (US$16 million) in India.[89] The all-India distributor share of the film was ₹500 million (US$7.4 million).[90] The film became one of the highest-grossing Bollywood films of 2012 in India, and was declared a \"Super Hit\" after its three-week run by Box Office India.[91] The film went on to gross ₹1.75 billion (US$26 million) worldwide.[3][92] Internationally, Barfi earned around ₹124 million (US$1.8 million) in its opening weekend, slightly exceeding Raajneeti – which had collected ₹116 million (US$1.7 million) – as Ranbir Kapoor's biggest opener overseas .[93] By the end of its run, Barfi! had grossed $6.25 million outside India, and it became one of the highest overseas grossing Bollywood films of 2012.[94]","produced_by":"Ronnie Screwvala Siddharth Roy Kapur","starring":"Ranbir Kapoor|Priyanka Chopra|Ileana D'Cruz|Saurabh Shukla|Ashish Vidyarthi|Jisshu Sengupta|Roopa Ganguly|","music_by":"Pritam","edited_by":"Akiv Ali","Marketing and release":"The official trailer of the film was launched on 2 July 2012 featuring all the actors. It included no dialogue, portraying comedy through gestures and actions, and was well received by critics and audiences.[41] Chopra's character was kept under wraps in the trailers as the makers were not willing to reveal much about her character to increase curiosity among the audiences and was only revealed around the release of the film. Shikha Kapur, the executive director (marketing) of UTV explained \"Priyanka plays a very special character in Barfee, so we want to keep her mystery intact. In the first trailer, Barfi – played by Ranbir – will be unveiled. We don’t plan to reveal Priyanka until the film releases.\"[42]UTV Motion Pictures created a YouTube application called The Flavour of Barfi, designed for the marketing the film. The application features Ranbir Kapoor as his character from the movie and allows users to type actions, which Kapoor acts out. The application features two zones: one asks users to change Barfi's mood and the other gives users the chance to watch him flirt.[43] The film was promoted in various cities across India. While promoting the film at the Phoenix Mall, Bangalore, the crowds broke through the barricades.[44]Barfi! was released on 14 September 2012 on 1300 screens in 700 theatres in India.[45] Reliance Home Entertainment released Barfi! on DVD and Blu-Ray in mid-November 2012 across all regions in a one-disc pack complying with the NTSC format.[46] The DVD and the Blu-Ray discs contained bonus content, including Making of the film, \"Fatafati – Behind The Scenes\" and Deleted Scenes. The Video CD version was released at the same time. The exclusive right to broadcast the film was bought by Zee Network and UTV Movies. The deal includes premiere rights of the film along with the several other UTV productions. The rights are for a period of seven-year, consisting the premiere (for both channels) of the film. Zee Network will have selected runs while UTV Movies will have multiple runs rights. The price of the deal was not revealed by the production company.[47]On 12 September 2012, British manufacturer Murphy Radio claimed that its trademark Murphy baby logo from its 1970s print advertisements has been used in Barfi! without permission.[48] Producer Siddharth Roy Kapur said that he had received a legal notice from Murphy but said that there is nothing wrong in the intention, as the brand in question has been shown in a \"very positive light\".[49]After the film's release, several blogs and users of social media websites Twitter, Facebook and YouTube accused the director of plagiarism.[50] Media further alleged that Basu had not tried to credit the original sources. Several videos were uploaded to YouTube showing side-by-side comparisons with Hollywood films like Cops, The Adventurer, City Lights, Singin' in the Rain, Project A, The Notebook and Benny & Joon. They also accused Barfi!'s music director Pritam of copying the background music from the French film Amélie.[51]Basu defended the film by saying that he was inspired by these works and that Barfi! contains an original plot, screenplay, characters and situations.[52] He said that he was paying homages to Keaton and Chaplin.[9] Barfi!'s Oscar selection for Best Foreign Language Film was criticised because of plagiarism, but Oscar selection committee chief Manju Borah defended the film by saying, \"Barfi! deserves to be sent outside. The selection was a very open process with three to four rounds of severe discussions and came down to the best film of the final three.\"[53]","written_by":"Anurag Basu"}