{"based_on":"Charlie's Angels  by Ivan Goff Ben Roberts","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"John August Cormac Wibberley Marianne Wibberley","story_by":"John August","Plot":"After rescuing U.S. Marshal Ray Carter (Robert Patrick) in Mongolia, the Angels: Natalie Cook (Cameron Diaz), Dylan Sanders (Drew Barrymore), and Alex Munday (Lucy Liu), together with their benefactor, Jimmy Bosley (Bernie Mac), are sent to recover H.A.L.O. (Hidden Alias List Operation) titanium rings stolen from the United States Department of Justice which can display the people listed in the witness protection program. DOJ official William Rose Bailey (Bruce Willis) and a protected witness, Alan Caulfield (Eric Bogosian) are among those killed. At Caulfield's house in San Bernardino, the Angels track his assassin, Randy Emmers (Rodrigo Santoro) to a beach, where they meet with former Angel Madison Lee (Demi Moore). During the Coal Bowl motorcycle race, Emmers targets another witness, Max Petroni (Shia LaBeouf), but is killed by the Thin Man (Crispin Glover). Inside Emmers' pocket, the Angels discover the photos of Caulfield, Max, and, surprisingly, Dylan, under her birth name, Helen Zaas.Dylan reveals that she is a protected witness after sending her former boyfriend, Irish mob leader Seamus O'Grady (Justin Theroux), to prison. O'Grady has since targeted those who wronged him, including Dylan and Max, whose parents O'Grady killed. Max is sent to the home of Bosley's mother (Ja'net Dubois) for his protection. At a monastery, the Angels learn about the Thin Man's past from the Mother Superior (Carrie Fisher). Afterward, the Angels track O'Grady's mob at San Pedro and manage to get the rings, but O'Grady threatens Dylan with the murder of everyone she loves. While Natalie attends her boyfriend, Peter Kominsky (Luke Wilson)'s high school reunion at Hermosa Beach and Alex returns home to find her action star boyfriend-under-timeout, Jason Gibbons (Matt LeBlanc) telling her awestruck father (John Cleese) about her exploits, Dylan leaves the Angels and heads to Mexico. She is, however, convinced to return after seeing an apparition of former Angel Kelly Garrett (Jaclyn Smith).Natalie and Alex deduce that Carter is a part of O'Grady's scheme after seeing him return Bosley's keys. Following him, the two witness him being shot by Madison, the true mastermind behind all of this. Though Dylan arrives to back the group, the Angels are shot by Madison, who take the rings, though they survive by having worn Kevlar vests beforehand. The Angels realize that Madison, with the protection of O'Grady, is going to sell the rings to three mobs at the Hollywood Walk of Fame, where Jason's film's premiere is about to commence. The Angels set the mobs to be arrested by the FBI instead, while they confront Madison and O'Grady. O'Grady kills the Thin Man, but Dylan manages to throw him down to his death. The Angels fight Madison all the way to an abandoned theater, where they kick her to a gas-filling chamber, with her dooming herself by shooting her bullets, exploding it.The Angels attend the premiere where they learn that Mama Bosley is adopting Max. Peter postpones his engagement with Natalie by buying for them a puppy, Spike, while Alex terminates her timeout with Jason. The Angels celebrate their victory together with Bosley.","charlie's_angels:_full_throttle":"Theatrical release poster","language":"English","Reception":"The film had a production budget of $120 million. It grossed $100,830,111 at the United States box office and had to depend on earnings from overseas box office to make profit. By the end of its run, the film had grossed $259,175,788 worldwide, performing worse than its predecessor.Charlie's Angels: Full Throttle received negative reviews and earned a rating of 43% on Rotten Tomatoes based on 178 reviews. At Metacritic, which assigns a normalized rating out of 100 based on reviews from film critics, the film has a rating score of 48, indicating \"mixed or average reviews\".[4]Roger Ebert gave the film 2½ stars out of 4,[5] a higher score than the half star he gave to the first film.[6]The film received seven nominations at the 24th Golden Raspberry Awards including Worst Picture, Worst Actress for both Drew Barrymore and Cameron Diaz, Worst Screenplay, and Worst Excuse for an Actual Movie (All Concept/No Content), winning two trophies for Worst Remake or Sequel and Worst Supporting Actress for Demi Moore.[7]Demi Moore was nominated for the MTV Movie Award for Best Villain, but lost against co-star Lucy Liu for her role as O-Ren Ishii in Quentin Tarantino's Kill Bill: Volume 1.[8]","box_office":"$259.1 million","cinematography":"Russell Carpenter","production_company":"Wonderland Sound and Vision Flower Films Tall Trees","Reboot":"On September 15, 2015, The Hollywood Reporter has reported that Sony are rebooting the film with Elizabeth Banks both producing with her producing partner and husband Max Handelman and the studio are in negotiations with her to direct the film.[9] On April 13, 2016, Sony has confirmed that Banks will direct the reboot.[10]","directed_by":"McG","Soundtrack":"Released June 24, 2003","narrated_by":"John Forsythe","release_dates":"June 27, 2003 (2003-06-27)|||||","Development":"The movie starts up abruptly from the first film. A series of online animated episodes explain how the Angels got there and their mission, concluded by the very introduction of the movie.[2] The Seamus O'Grady prison introduction scene is a direct reference to Robert De Niro's prison-set introduction in Cape Fear.[3]The scene where the Angels go to investigate the body of Agent Caufield dressed as crime-scene professionals is an homage/parody of CSI: Crime Scene Investigation, complete with the theme \"Who Are You\" by The Who.The song \"Feel Good Time\" is the film's main track, and is performed by P!nk. Whenever Seamus O'Grady (Justin Theroux) appears, he is accompanied by Bernard Hermann's theme from Cape Fear.The Thin Man character perhaps pays homage to the Thin Man in 1927 German Expressionist film Metropolis, directed by Fritz Lang. In the film, Thin Man is ordered by Joh Frederson, master of Metropolis, to spy on his son Freder.","produced_by":"Leonard Goldberg Drew Barrymore Nancy Juvonen","starring":"Cameron Diaz Drew Barrymore Lucy Liu Bernie Mac John Forsythe Justin Theroux Demi Moore Rodrigo Santoro Crispin Glover Shia LaBeouf","running_time":"106 minutes","music_by":"Edward Shearmur","edited_by":"Wayne Wahrman","budget":"$120 million"}