{"based_on":"Characters  by Don Mancini David Kirschner (Chucky Doll)","country":"United States","distributed_by":"Universal Pictures","Novelization":"A tie-in novel was later written by Matthew J. Costello. Just like Child's Play 2, this novel had some of the author's own parts. In the beginning, (unlike the film's) in the Play Pals factory, a rat scours for food and chews on Chucky`s remains. Blood then leaks out of the remains and somehow leaks into another doll. Chucky`s death in this book is also different. In the novel, Andy shoots Chucky in the chest and causes his body to fall to the floor and watch his head shatter to blood, metal and plastic.","Plot":"In 1998, eight years after the previous film, The Play Pals (Good Guys) has recovered from bad publicity brought along by Chucky's (voiced by Brad Dourif) murder spree. The company releases a new line of Good Guy dolls and recycles Chucky's remains. However, the soul of serial killer Charles Lee Ray still inhabits the remains, and Chucky is soon revived. Chucky is unwittingly given to Play Pals' CEO Mr. Sullivan, whom Chucky kills. He then uses computer records to relocate Andy Barclay (Justin Whalin).Still troubled by his past encounters with Chucky, 16-year-old Andy Barclay (Justin Whalin) has been sent to Kent Military Academy after having failed to cope in several foster homes. Colonel Cochran (Dakin Matthews), the school's commandant, begrudgingly enrolls Andy, but advises him to forget his \"fantasies\" about the doll. Andy befriends cadets Harold Aubrey Whitehurst (Dean Jacobson), Ronald Tyler (Jeremy Sylvers), and Kristin DeSilva (Perrey Reeves), for whom he develops romantic feelings. He also meets Brett C. Shelton (Travis Fine), a lieutenant colonel who routinely bullies the cadets.Shortly after Andy arrives, Tyler is asked to deliver a package to his room. Tyler realizes that the package contains a new toy and, excited, takes the package to the cellar, which contains Chucky. Once freed, Chucky remembers the rule that he can possess the first person who learns his true nature, and that as he has a new body, the person he possesses doesn't have to be Andy. He tells Tyler his secret, but just as Chucky is about to possess him, they are interrupted by Cochran, who takes the doll away. Cochran throws Chucky into a garbage truck, but Chucky escapes by luring the driver into the truck's compactor and crushing him. That night, Chucky attacks Andy and tells him his plans for taking over Tyler's soul. But before Andy can attack Chucky, Shelton comes in and takes the doll from him. Andy tries to get the doll back by sneaking into Shelton's room, but Shelton catches him in the act. Upon realizing the doll has vanished, Shelton suspects it stolen and forces all the cadets to do exercises in the courtyard as punishment.Andy unsuccessfully tries to warn Tyler about Chucky. At one point, Chucky lures Tyler into playing hide-and-seek in Cochran's office, where he attempts to possess the boy again. However, they are interrupted by De Silva and, moments later, Cochran himself. When the cadets leave, Cochran is confronted by a knife-wielding Chucky. The resulting shock causes Cochran to suffer a fatal heart attack.Despite Cochran's death, Shelton declares that the school's annual war games will proceed as planned, with Andy and Shelton on the same team. However, Chucky secretly replaces the paint bullets of the Red team with live ammunition. When the simulation begins, Chucky accosts Ronald, then threatens the boy when he refuses to take part. Ronald stabs Chucky with a pocket knife and flees, trying to find Andy. Chucky then attacks Kristen and holds her hostage, attempting to lure the teams into fighting each other to save her. Chucky forces Andy to exchange Kristen for Tyler.Suddenly, the Red team descends upon the area and obliviously opens fire with their live rounds. Shelton is killed in the crossfire. Amidst the chaos, Tyler makes a quick getaway, but before giving chase, Chucky tosses a live grenade at the quarreling cadets. Recognizing the danger, Whitehurst bravely leaps on top of the grenade and sacrifices himself to save the others. With no time to mourn his friend, Andy heads off in pursuit of Chucky, with Kristen close behind.Eventually the chase leads the group into a haunted house at a nearby carnival. Ronald tries to get a security guard to help him, but Chucky kills the guard offscreen and kidnaps Ronald. In the ensuing melee, Chucky shoots Kristen in the leg, leaving Andy to fight Chucky alone. When Tyler is inadvertently knocked out, Chucky seizes the opportunity to possess him, but Andy intervenes, shooting him several times. Enraged, Chucky attempts to strangle Andy, but Andy uses Tyler's knife to cut off Chucky's hand, dropping him into a giant fan which slices him to pieces. Afterwards, Andy is taken away by the police for questioning, while Kristen is rushed to the nearby hospital.","Home video releases":"Child's Play 3 was originally released on home video in North America on March 12, 1992,[citation needed] and on DVD in 2003. Child's Play 3 was also released in the Chucky Collection (which also featured Child's Play 2, and Bride of Chucky) on October 7, 2003.[13] On September 19, 2006, it was released as part of Chucky - The Killer DVD Collection (alongside Child's Play 2, Bride of Chucky, and Seed of Chucky).[14] On October 8, 2013, Child's Play 3 was re-released on DVD and Blu-ray as part of Chucky: The Complete Collection (alongside the original Child's Play, Child's Play 2, Bride of Chucky, Seed of Chucky, and Curse of Chucky).[15]","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 23% of 13 surveyed critics gave the film a positive review; the average rating is 3.9/10.[6] Chris Hicks of the Deseret News called it \"perverse\" and criticized the film's plot.[7] Caryn James of The New York Times called the Chucky doll \"an impressive technological achievement\" but said the film \"misses the sharpness and dark humor\" of the original film.[8] Variety called it a \"noisy, mindless sequel\" with good acting.[9] Richard Harrington of The Washington Post wrote, \"Chucky himself is an animatronic delight, but one suspects the film's energies and budget have all been devoted to what is essentially a one-trick pony.\"[10] Stephen Wigle of The Baltimore Sun called it \"fun for any fan of the slasher genre\".[11] Series creator Don Mancini said that this was his least favorite entry in the series, adding that he ran out of ideas after the second film.[12] Mancini would not make another entry in the Chucky series until seven years later, with Bride of Chucky.","James Bulger controversy":"The film also had some controversy because it has been indirectly linked to the brutal murder of James Bulger. The killers, who were 10 years old at the time, were said to have imitated a scene in which one of Chucky's victims is splashed with blue paint. Although these allegations against the film have never been proven, the case has led to some new legislation for video films.[16] Psychologist Guy Cumberbatch has stated, \"The link with a video was that the father of one of the boys – Jon Venables – had rented Child's Play 3: Look Who's Stalking some months earlier.\"[17] However, the police officer who directed the investigation, Albert Kirby, found that the son, Jon, was not living with his father at the time and was unlikely to have seen the film. Moreover, the boy disliked horror films—a point later confirmed by psychiatric reports. Thus the police investigation, which had specifically looked for a video link, concluded there was none.[18]","box_office":"$20.5 million","cinematography":"John R. Leonetti","directed_by":"Jack Bender","child's_play_3":"Theatrical poster","release_dates":"August 30, 1991 (1991-08-30)|||||","produced_by":"Robert Latham Brown","starring":"Justin Whalin|Perrey Reeves|Jeremy Sylvers|","running_time":"90 minutes","Halloween Horror Nights":"In 2009, the climax of Child's Play 3 received its own maze at Universal Studios Halloween Horror Nights, entitled Chucky's Fun House.This is not the first time Chucky has been featured in Halloween Horror Nights. Curse of Chucky has been slated to receive its own scarezone in the 2013 lineup.[19] Since 1992, Chucky has starred in his own shows, Chucky's In-Your-Face Insults and Chucky's Insult Emporium.","Sequel":"Mancini originally intended for this film to be the final installment in the series, however following the success of Scream, five years later; interest in the slasher subgenre was revived and a sequel was then planned and released seven years after the third film in 1998 with the title \"Bride of Chucky\". Unlike its predecessors, Bride of Chucky was a horror-comedy and made Chucky the main character and gave him a girlfriend and changed the plot from trying to take a child's soul to him and his girlfriend going after his amulet which was buried with his corpse. Unlike in the previous three films, the protagonist Andy Barclay made no appearance but was briefly mentioned at the beginning of the film in a newspaper article about Chucky. Bride of Chucky was then followed by two sequels; Seed of Chucky in 2004 and Curse of Chucky in 2013, the latter of which returned to the straightforward horror elements found in the first three films and also brought back Andy Barclay, the protagonist from the first three films for a quick post-credits cameo role. A seventh installment is also planned and scheduled for release sometime in 2016.","music_by":"Cory Lerios|John D'Andrea|","edited_by":"Scott Wallace|Edward A. Warschilka Jr.|","Release":"Child's Play 3 opened in second place behind Dead Again to $5.7 million over the 4-day 1991 Labor Day weekend, which the Los Angeles Times called \"slow numbers\".[4] It finished its theatrical run with $15 million in the US, and a total of $20.5 million worldwide.[5]","written_by":"Don Mancini"}