{"country":"United States","analyze_that":"Theatrical release poster","distributed_by":"Warner Bros.","Background":"Initially, there was no plan to create a sequel to Analyze This, but the critical acclaim and box office success generated by the first film encouraged the producers to consider a sequel and discuss it with the studio and actors.[3] They believed, as said by Crystal, that \"there was an unfinished relationship between Ben Sobel and Paul Vitti from the first film\" and \"there was a good story to tell\", so the sequel was commissioned.[3]The story of the sequel was inspired by an article in The New York Times about the psychotherapy used in the TV show The Sopranos.[3] Ramis said the article \"raised questions about human nature and morality...Can the criminal mind be turned?\" and he became interested in what would happen if \"Paul Vitti got out of jail and committed himself to going straight.\"[3]The production arranged for Dr. Stephen A. Sands, a psychiatrist and faculty member of Columbia University College of Physicians and Surgeons to be a technical adviser for the film, and he remained on set during the filming of scenes that involved psychiatric issues.[3] Sands was very familiar with the details of Vincent \"The Chin\" Gigante's alleged mental illness, after studying the case during his post-doctoral training.[3] Sands also arranged for De Niro to visit Bellevue Hospital's psychiatric unit to meet patients and psychiatrists to discuss the character's symptoms, and De Niro sometimes participated in group therapy sessions during these visits.[3]","Plot":"Near the completion of his sentence in Sing Sing prison, Paul Vitti's life is threatened by assassins and corrupt guards while incarcerated. He starts singing showtunes from West Side Story to get the attention of Ben Sobel, who previously hung up on him while attending his father's funeral. The FBI calls in Ben to see if Vitti is really insane. This appears to be the case, and the FBI approves Ben taking Vitti out of prison, into his own custody, for further therapy. On their way out in Sobel's car, Vitti reveals that he faked it. Needing some therapy himself after his father's death, a grieving Sobel talks Vitti into finding a regular job (as requested by the FBI). Vitti attempts to find a legitimate job (he tries a car dealer, a restaurant, and a jewelry store), but his rude manners and paranoia only complicate things further (which end up in him getting fired each time).At the same time, Vitti is told by de facto boss Patti LoPresti that the Rigazzi family wants him dead. He responds to this by telling the Rigazzis that he is \"out\" and seeking a new line of employment. He eventually finds employment working as a technical advisor on the set of a Sopranos-like mafia TV series. Meanwhile, FBI agents inform Sobel that Vitti has his former crew back together, and may be planning something major. This rouses Sobel's suspicion, and he visits Vitti. Both get caught up in a car chase with Rigazzi hitmen, which ends up with Vitti escaping. The FBI blames Sobel, and gives him 24 hours to locate Vitti.After locating Vitti (through Sobel's son Michael, who is now working as Vitti's chauffeur), Sobel discovers Vitti is planning a big armored car heist with LoPresti as a partner. He attempts to intervene and talk Vitti out of it but Vitti proceeds and Sobel is forced to go along as well. The crew ambushes the armored car with smoke grenades, and lifts it over a fence in the midst of the confusion. They extract $20M worth of gold bullion, but LoPresti's thugs take over, revealing themselves to actually have been working for Rigazzi. Sobel, in a fit of anger, beats one of them and Vitti's men take care of the rest. They use the gold bullion to frame the Rigazzi family, leaving three Rigazzi goons locked in the armored truck suspended from the crane. This leads to the arrest of the entire Rigazzi family, and in turn, prevents a mob war.Sobel meets with Vitti and Jelly near bridges on the New York waterfront, and they part ways again as friends, singing another West Side Story showtune together.","language":"English","Reception":"On Rotten Tomatoes, the film received a 27% \"Rotten\" rating, based on 148 reviews, with an average rating of 4.8/10. The site's consensus reads: \"The one joke premise is stretched a bit thin in this messy sequel, but a few laughs can be had here and there.\"[5] On Metacritic, the film has a score of 37 out of 100, based on 34 critics, indicating \"generally unfavorable reviews.\"[6]","box_office":"$55,003,135[1]","cinematography":"Ellen Kuras","production_company":"Village Roadshow Pictures","directed_by":"Harold Ramis","release_dates":"December 6, 2002 (2002-12-06)|||||","Production":"Filming began in April 2002, and most of the scenes were shot in and around New York City.[4] Producer Jane Rosenthal said they decided to shoot the film there because \"[i]t would have been unpatriotic not to shoot the picture in New York... As a New Yorker it was extremely important for me to get back to work and business as usual after 9/11.\"[4]Filming locations for Vitti's attempts at lawful employment include an Audi dealership on Park Avenue in Manhattan, a jewelry store in the Diamond District on West 47th Street, and Gallagher's Steak House on West 52nd Street.[4] The prison scenes were filmed at the Riker's Island prison in Queens, with the prison release scene shot outside the entrance to Sing Sing Prison in Ossining, New York.[4] The funeral for Ben's father was filmed at Riverside Memorial Chapel on Manhattan's Upper West Side, and the Sobel household scenes shot in Montclair, New Jersey.[4] The dinner at Nogo restaurant was filmed at West 13th Street in a restaurant that had closed down, and been refurbished by the film's art department.[4] The scenes of Patty LoPresti's home were filmed in Ho-Ho-Kus, New Jersey, and the Little Caesar set in Washington Square Park, Manhattan.[4] Car chases were filmed on New Jersey Turnpike service roads in Kearney.[4] The heist-planning scenes were shot in two locations: a derelict building in the meat packing district near West 14th Street, and a club called Exit on West 56th Street.[4] Finally, the majority of the heist scenes were shot in an empty lot in West 57th Street between 11th and 12th Avenues, and below a West Side Highway underpass.[4] While filming part of the heist sequence at the New York State 369th Regiment armory, on 145th Street and Fifth Avenue, the film set was visited by former President Bill Clinton, who was pleased the movie was being filmed in New York. The scene at a drive-through bank where the money flies before the police chase was filmed in Carlstadt, New Jersey.[4]Cinematographer Ellen Kuras said that in shooting the film, the intention was to highlight the contrast between Vitti and Sobel's environments, because the film \"exists in two different worlds... We wanted to evoke the contrast so we made Vitti's world cool, blue and blue-green, whereas Ben's world has a brighter, warmer palette, yellows and oranges that provide a neutral tone.\"[4]","produced_by":"Len Amato Bruce Berman Barry Levinson","starring":"Robert De Niro Billy Crystal Lisa Kudrow Joe Viterelli Cathy Moriarty-Gentile","running_time":"96 minutes","music_by":"David Holmes","edited_by":"Andrew Mondshein","written_by":"Kenneth Lonergan Peter Tolan Peter Steinfeld Harold Ramis","budget":"$60 million[1]"}