{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Gray Wheeler (Jennifer Garner) attends the funeral of her fiancé, Grady, on the day they were supposed to be married. Gray seeks solace in a bathtub, where she is forced to listen to Grady's best friend, Fritz (Timothy Olyphant), having sex with a waitress. Gray visits an attorney to determine what will happen to Grady's estate. As Grady did not have a will and he and Gray were not married, she will not inherit his money. The attorney reveals that Grady had an investment account with a million dollars in it, which Gray knew nothing about. She determines that she can no longer afford to rent the house that they had picked out, and with the help of Grady's friends Dennis (Sam Jaeger) and Sam (Kevin Smith), she puts her things into storage and moves in with them. Fritz also comes to stay, which causes tension between himself and Gray. Gray learns Grady transferred $3,000 every month to an unknown person.Gray finds Grady's cell phone and listens to a string of messages from a woman asking about money. After noting the phone number area code is for Los Angeles, Gray asks Fritz for answers and he reveals that Grady had a son, whose mother depended on the money she received from him. Fritz tells Gray that the boy is eight and that the encounter happened before she and Grady were involved. Meanwhile, Gray is upset further when Grady's mother, Mrs. Douglas (Fiona Shaw), asks for the engagement ring back. She refuses and keeps the ring. The other woman, Maureen (Juliette Lewis), and her son, Mattie, turn up, trying to get answers about Grady and the money. Gray learns that Mattie is actually 4 years old and realises the affair happened while she and Grady were together. Gray confronts Fritz and slaps him, but he pins her arms against the wall and they kiss.Gray does not want anything to do with Maureen, but the guys are reluctant to send her away and they all get to know each other. Sam and Maureen develop a connection, while Gray and Fritz have sex. The group take a day trip to a river, where Sam teaches Mattie to fly fish. Dennis admits that he has feelings for Gray, but she lets him down easy. However, Dennis is upset to learn that Gray and Fritz are an item. Gray tells Dennis that her relationship with Fritz is \"less than nothing\", not realizing that Fritz has overheard. He believes she does not love him and returns to Malibu. Grady's mother insists that the boy takes a DNA test before inheriting Grady's money. The results determine that Grady is not Mattie's father. Maureen is unsure how she will support Mattie, so Gray offers Mrs. Douglas her engagement ring in exchange for Grady's money to give to Maureen, but Mrs. Douglas refuses.The group gathers at the dedication ceremony for the peace garden that Dennis has built to memorialize Grady. Mrs. Douglas gives Maureen a certified check. Gray offers the ring back again, but Mrs. Douglas tells her to keep it, saying she never cared about the ring or the money, she just wanted her son back. Dennis moves out of the house, so Maureen and Mattie move in with Sam. Gray determines that she never fully knew Grady, but she has feelings for the one person that they both could be themselves around: Fritz. Gray goes to Malibu and finds Fritz playing with his dog on the beach. Fritz turns to see her standing there, and they embrace and kiss.","language":"English","Reception":"Box Office Mojo predicted Catch and Release would earn $4.6 million during its opening weekend from 1,622 sites, with Leesmovieinfo.com estimating $5 million. The film edged above these expectations and grossed $7,658,898 in its first three days — with Sony indicating that 75% of the audience was female (with 58% being over 25). The pattern of films that rely heavily on its leading ladies having a dominantly female audience can also be seen in pictures like In Her Shoes, Just Like Heaven and Because I Said So, other medium sized box office successes.The film ended up with a final gross of $15,539,051 in the United States and $456,458 overseas, making it a bomb at the box office.[2]Critical reaction towards the film has been largely negative. The review aggregator website Rotten Tomatoes reported a 21% approval rating with an average rating of 4.5/10 based on 132 reviews. The website's consensus reads, \"A romantic dramedy with boring, stock characters and contrived situations.\"[4] Metacritic gave a score of 43 out of 100 based on 28 reviews, indicating \"mixed or average reviews\".[5] The film did receive \"Two Thumbs Up\" from Richard Roeper and guest critic Govindini Murty on At the Movies with Ebert & Roeper. Even with most of the reviews being negative, a number of critics praised the performance given by Smith.[6]","catch_and_release":"Theatrical release poster","box_office":"$16,158,487[2]","cinematography":"John Lindley","production_company":"Relativity Media","directed_by":"Susannah Grant","Soundtrack":"The original film score is produced by Brian Wayne Transeau (BT) and Tommy Stinson.Songs used in the official trailer for the film included \"Just a Ride\" by Jem and \"Breathe (2 AM)\" by Anna Nalick.Music featured in Catch and Release is performed by:","release_dates":"October 20, 2006 (2006-10-20) (Austin Film Festival)|January 26, 2007 (2007-01-26) (United States)||||","Production":"Catch and Release was filmed in the spring/summer of 2005, in Vancouver, British Columbia, Canada, with a reprise in December 2005. In July 2005, several scenes were filmed in Boulder, Colorado, where the story takes place.Kevin Smith said while filming this movie, he and Lewis went to the set of the Uwe Boll film In the Name of the King because Smith had heard they had Krispy Kreme doughnuts, which were flown in by Burt Reynolds. They took boxes of doughnuts back to the Catch and Release set, and someone on set asked if they had stolen the doughnuts from the set of In the Name.., because Reynolds saw someone running away with them.[3]","produced_by":"Casey Grant Josh Siegel Matthew Tolmach Jenno Topping","starring":"Jennifer Garner Timothy Olyphant Kevin Smith Sam Jaeger Juliette Lewis","running_time":"107 minutes[1]","music_by":"Brian Transeau Tommy Stinson","edited_by":"Anne V. Coates","written_by":"Susannah Grant","budget":"$25 million[2]"}