{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Jonathan Hensleigh|Tony Gilroy|Shane Salerno|J. J. Abrams|","story_by":"Robert Roy Pool|Jonathan Hensleigh|","Plot":"The film opens on depicting the Cretaceous–Paleogene extinction event caused by a collision of an asteroid striking the Earth 65 million years ago, with narration warning that such an event will happen again.In the present day, a massive meteor shower destroys the orbiting Space Shuttle Atlantis and bombards a swath of land from the U.S. East Coast to Europe, particularly in New York City. NASA discovers through the Hubble that the meteors were debris propelled from the asteroid belt by a rogue asteroid roughly the size of Texas. The asteroid will collide with Earth in 18 days, causing another extinction event. NASA scientists, led by Dan Truman, plan to trigger a thermonuclear detonation at least 800 feet (240 m) inside the asteroid to split it in two, driving the pieces apart so both will fly past the Earth. NASA contacts Harry Stamper, considered the best deep-sea oil driller in the world, for assistance. Harry insists he will need his full team to help execute NASA's plan, and they agree to help but only after their list of unusual rewards are met.NASA plans to launch two specialized shuttles, Freedom and Independence, to increase the chances of success; the shuttles will refill with liquid oxygen from a Russian space station before making a slingshot maneuver around the Moon to approach the asteroid from behind. NASA puts Harry and his crew through a short and rigorous astronaut training program, while Harry's team re-outfit the mobile drillers, \"Armadillos\", for the job. During training, Truman and Harry question the abilities of A.J. Frost, a hot-headed drill operator who has also been dating Harry's daughter Grace against Harry's wishes.The destruction of Shanghai by a meteorite forces NASA and the military to reveal the asteroid's existence, as well as their plan. The shuttles are launched and arrive at the space station, where its sole cosmonaut Lev Andropov helps with refueling. A major fire breaks out during the fueling process, forcing the crews, including Lev, to evacuate in the shuttles before the station explodes. The shuttles perform the slingshot around the Moon, but approaching the asteroid, the Independence's engines are destroyed by trailing debris, and it crashes on the asteroid. Grace, aware A.J. was aboard the Independence, is traumatized by this news. Unknown to the others, A.J., Lev, and \"Bear\" (another of Harry's crew) survive the impact and head towards the Freedom target site in their Armadillo.Freedom safely lands on the asteroid, but overshoots the target zone, landing on a much harder metallic field than planned, and their drilling quickly falls behind schedule. The military initiates \"Secondary Protocol\", planning to remotely detonate the weapon at the asteroid's surface, despite Truman and Harry's insistence that it would be ineffective. Truman delays the military, while Harry convinces the shuttle commander Colonel Willie Sharp to disarm the remote trigger. Harry's crew continues to work, but in their haste, they accidentally hit a gas pocket, blowing their Armadillo into space and losing another man. As the world learns of the mission's apparent failure, another meteorite devastates most of Paris.All seems lost until Independence's Armadillo arrives. With A.J. at the controls, they reach the required depth for the bomb. However, flying debris from the asteroid damages the triggering device, requiring someone to stay behind to manually detonate the bomb. The crew draw straws, and A.J. is selected. As he and Harry exit the airlock, Harry rips off A.J.'s air hose and shoves him back inside, telling him that he is the son Harry never had and gives his blessing to marry Grace. Harry contacts Grace to bid his final farewell. After some last minute difficulties involving both the shuttle engines and the detonator, the Freedom moves to a safe distance and Harry triggers the detontation, experiencing flashbacks of happy times in his last moments. The bomb successfully splits the asteroid, avoiding the collision with Earth. Freedom safely returns to Earth, and the surviving crew are treated as heroes. A.J. and Grace get married, with photos of Harry and the other lost crew members present.","armageddon":"Theatrical release poster","language":"English","Reception":"Armageddon was released on July 1, 1998 in 3,127 theaters in the United States and Canada. It ranked first at the box office with an opening weekend gross of $36 million. It grossed $201.6 million in the United States and Canada and $352.1 million in other territories for a worldwide total of $553.7 million.[2]Armageddon received mostly negative reviews from film critics, many of whom took issue with \"the furious pace of its editing\".[12] The film is on the list of Roger Ebert's most hated films.[13] In his original review, Ebert stated, \"The movie is an assault on the eyes, the ears, the brain, common sense and the human desire to be entertained\". On Siskel and Ebert, Ebert gave it a Thumbs Down. However, his co-host Gene Siskel gave it a Thumbs Up. Ebert went on to name Armageddon as the worst film of 1998 (though he was originally considering Spiceworld).[14] Todd McCarthy of Variety also gave the film a negative review, noting Michael Bay's rapid cutting style: \"Much of the confusion, as well as the lack of dramatic rhythm or character development, results directly from Bay's cutting style, which resembles a machine gun stuck in the firing position for 2½ hours.\"[15] The film has a cumulative 39% \"Rotten\" rating on Rotten Tomatoes,[16] while achieving a 42% aggregate score on Metacritic.In April 2013, in a Miami Herald interview to promote Pain & Gain, Bay was quoted as having said:...We had to do the whole movie in 16 weeks. It was a massive undertaking. That was not fair to the movie. I would redo the entire third act if I could. But the studio literally took the movie away from us. It was terrible. My visual effects supervisor had a nervous breakdown, so I had to be in charge of that. I called James Cameron and asked ‘What do you do when you’re doing all the effects yourself?’ But the movie did fine.[17]Some time after the article was published, Bay changed his stance, claiming that his apology only related to the editing of the film, not the whole film,[18] and accused the writer of the article for taking his words out of context. The author of the article, Miami Herald writer Rene Rodriguez claimed: \"NBC asked me for a response, and I played them the tape. I didn’t misquote anyone. All the sites that picked up the story did.\"[19]In an interview with Entertainment Weekly, Bay admitted that the film's central premise \"that [NASA] could actually do something in a situation like this\" was unrealistic. Robert Roy Pool, a contributing screenwriter, stated that his script, in which an anti-gravity device is used to deflect a comet from a collision course with Earth, was \"much more in line with top-secret research.\"[20] Additionally, near the end of the credits, there is a disclaimer stating, \"The National Aeronautics and Space Administration's cooperation and assistance does not reflect an endorsement of the contents of the film or the treatment of the characters depicted therein.\"[21]In 2012, an article titled \"Could Bruce Willis Save the World?\" was published in the Journal of Physics Special Topics, an undergraduate journal used as a teaching tool at the University of Leicester.[22] It found that for Willis' approach to be effective, he would need to be in possession of an H-bomb a billion times stronger than the Soviet Union's \"Tsar Bomba\", the biggest ever detonated on Earth. Using estimates of the asteroid's size, density, speed and distance from Earth based on information in the film, students found that to split the asteroid in two with both pieces clearing Earth, would require 800 zettajoules of energy. In contrast, the total energy output of \"Tsar Bomba\", which was tested by the Soviet Union in 1961, was only 418 petajoules (0.000 418 zettajoules).[23]In the commentary track, Ben Affleck says he “asked Michael why it was easier to train oil drillers to become astronauts than it was to train astronauts to become oil drillers, and he told me to shut the fuck up, so that was the end of that talk.”[24]The film received four Academy Award nominations at the 71st Academy Awards, including; Best Sound (Kevin O'Connell, Greg P. Russell and Keith A. Wester), Best Visual Effects, Best Sound Effects Editing, and Best Original Song (\"I Don't Want to Miss a Thing\" performed by Aerosmith).[25] The film received the Saturn Awards for Best Direction and Best Science Fiction Film (where it tied with Dark City). It was also nominated for seven Razzie Awards[26] including: Worst Actor (Bruce Willis), Worst Picture, Worst Director, Worst Screenplay, Worst Supporting Actress (Liv Tyler), Worst Screen Couple (Tyler and Ben Affleck) and Worst Original Song. Only one Razzie was awarded: Bruce Willis received the Worst Actor award for Armageddon, in addition to his appearances in Mercury Rising and The Siege, both released in the same year as this film.","box_office":"$553.7 million[2]","cinematography":"John Schwartzman","production_company":"Touchstone Pictures Jerry Bruckheimer Films Valhalla Motion Pictures","directed_by":"Michael Bay","narrated_by":"Charlton Heston","release_dates":"July 1, 1998 (1998-07-01)|||||","Production":"In May 1998, Walt Disney Studios chairman Joe Roth expanded the film's budget by $3 million to include additional special effects scenes. This additional footage, incorporated two months prior to the film's release, was specifically added for the television advertising campaign to differentiate the film from Deep Impact which was released a few months before.[5]According to Bruce Joel Rubin, writer of Deep Impact, a production president at Disney took notes on everything the writer said during lunch about his script and initiated Armageddon as a counter film at Disney.[6]Nine writers worked on the script, five of whom are credited. In addition to Robert Roy Pool, Jonathan Hensleigh, Tony Gilroy, Shane Salerno and J.J. Abrams, the writers involved included Paul Attanasio, Ann Biderman, Scott Rosenberg and Robert Towne. Originally, it was Hensleigh’s script, based on Pool’s original, that had been greenlighted by Touchstone. Then-producer, Jerry Bruckheimer, hired the succession of scribes for rewrites and polishes.[7]Two soundtrack albums were released for the film. The first, Armageddon: The Album, was released by Columbia Records on June 23, 1998; it consists mainly of songs from the film, with one score suite.A more complete album of the film score by composers Trevor Rabin and Harry Gregson-Williams was released as Armageddon: Original Motion Picture Score by Sony Classical on November 10, 1998. While not featured on the album, the film also featured additional music by Don L. Harper, Paul Linford, Steve Jablonsky and John Van Tongeren.","Theme park attraction":"Armageddon – Les Effets Speciaux is an attraction based on Armageddon at Walt Disney Studios Park located at Disneyland Paris.[31] The attraction simulates the scene in the movie in which the Russian Space Station is destroyed.[32] Michael Clarke Duncan (\"Bear\" in the film) is featured in the pre-show.[32]","produced_by":"Jerry Bruckheimer|Gale Anne Hurd|Michael Bay|","starring":"Bruce Willis|Ben Affleck|Billy Bob Thornton|Liv Tyler|Will Patton|Steve Buscemi|Peter Stormare|Keith David|","running_time":"150 minutes[1]","music_by":"Trevor Rabin","edited_by":"Mark Goldblatt|Chris Lebenzon|Glen Scantlebury|","Release":"Prior to Armageddon's release, the film was advertised in Super Bowl XXXII at a cost of $2.6 million.[8]Despite a mixed critical reception, a DVD edition of Armageddon was released by The Criterion Collection, a specialist film distributor of primarily arthouse films that markets what it considers to be \"important classic and contemporary films\" and \"cinema at its finest\". In an essay supporting the selection of Armageddon, film scholar Jeanine Basinger, who taught Michael Bay at Wesleyan University, states that the film is \"a work of art by a cutting-edge artist who is a master of movement, light, color, and shape—and also of chaos, razzle-dazzle, and explosion\". She sees it as a celebration of working men: \"This film makes these ordinary men noble, lifting their efforts up into an epic event.\" Further, she states that in the first few moments of the film all the main characters are well established, saying, \"If that isn't screenwriting, I don't know what is\".[9] The film was also released by Touchstone Home Entertainment on standard edition Blu-ray disc in 2010 with only a few special features.[citation needed]Following the 2003 Columbia disaster, some screen captures from the opening scene where Atlantis is destroyed were passed off as satellite images of the disaster in a hoax.[10] Additionally, the American cable network FX, which had intended to broadcast Armageddon that evening, removed the film from its schedule and aired Aliens in its place.[11]","budget":"$140 million[2]"}