{"country":"United States","distributed_by":"Fox Searchlight Pictures","Plot":"Brandon Teena (Hilary Swank) is a young trans man whose birth name was Teena Renae Brandon.[4] When Brandon is discovered to be transgender by a former girlfriend's brother, he receives physical threats. Soon after, he is involved in a bar fight and is evicted from his cousin's trailer. Brandon moves to Falls City, Nebraska, where he befriends ex-convicts John Lotter (Peter Sarsgaard) and Tom Nissen (Brendan Sexton III), and their friends Candace (Alicia Goranson) and Lana Tisdel (Chloë Sevigny). Brandon becomes romantically involved with Lana, who is unaware of his biological sex and troubled past. The two make plans to move to Memphis, where Brandon will manage Lana's karaoke singing career.The police detain Brandon on charges that arose prior to his relocation; they place him in the women's section of the Falls City prison. Lana bails Brandon out and asks why he was placed in a women's prison. Brandon lies to her, saying he was born a hermaphrodite and will soon receive a sex change. Lana declares her love for Brandon, regardless of his sex or gender. Tom and John become suspicious after reading a newspaper article about Brandon that refers to him by his birth name, Teena Brandon. They force Brandon to remove his pants and reveal his genitals. They try to make Lana look, but she shields her eyes and turns away. After this confrontation, Tom and John drag Brandon into John's car and drive to an isolated location, where they beat and rape him. Afterwards, they take Brandon to Tom's house. Though injured, Brandon escapes through a bathroom window. Although his assailants threaten Brandon and warn him not to report the attack to the police, Lana persuades him to do so.Later, John and Tom get drunk and decide to kill Brandon. Lana attempts to stop them, but the pair drive to Candace's remote house where they find Brandon, who has been hiding in a nearby shed. John shoots Brandon under the chin. Tom shoots Candace in the head as Lana fights with them, begging them to stop. Tom stabs Brandon's lifeless body and tries to shoot Lana but John stops him. John and Tom flee the scene while Lana lies with Brandon's body. The next morning, Lana awakens next to Brandon's corpse. Her mother arrives and takes her away from the scene. As Lana leaves Falls City, a letter Brandon wrote to her is heard in a voiceover.","language":"English","box_office":"$11.5 million[2]","cinematography":"Jim Denault","boys_don't_cry":"Theatrical release poster","directed_by":"Kimberly Peirce","production_companies":"Hart-Sharp Entertainment IFC Films Killer Films","References":"NotesFootnotesBibliography","release_dates":"October 8, 1999 (1999-10-08)|||||","Production":"Brandon Teena was a trans man who was raped and murdered by two male acquaintances in December 1993, when he was 21.[nb 1][7][8] Kimberly Peirce, at the time a Columbia University film student, became interested in the case after reading a 1994 Village Voice article by Donna Minkowitz.[9][10] Peirce became engrossed in Brandon's life and death; she said, \"the minute I read about Brandon, I fell in love. With the intensity of his desire to turn himself into a boy, the fact that he did it with no role models. The leap of imagination that this person took was completely overwhelming to me.\"[11] The sensationalist news coverage of the case prolonged her interest.[9] Peirce said she looked beyond the brutality of the case and instead viewed the positive aspects of Brandon's life as part of what eventually causes his death.[12] She admired Brandon's audacity, ability to solve complicated problems, and what she perceived as the sense of fantasy invoked by his personality.[12]Peirce wanted to tell the story from Brandon's perspective. She was familiar with Brandon's desire to wear men's clothing: \"I started looking at all the other coverage and a great deal of it was sensational. People were focusing on the spectacle of a girl who had passed as a boy because that is so unfamiliar to so many people. Where to me, I knew girls who had passed as boys, so Brandon was not some weird person to me. Brandon was a very familiar person.\"[13] Peirce was influenced by the public perception of the case, believing the American public were generally misinformed: she said, \"People were also focusing on the crime without giving it much emotional understanding and I think that's really dangerous, especially with this culture of violence that we live in\".[13] Peirce began working on a concept for the film and gave it the working title Take It Like a Man.[14]The project drew interest from various production companies. Diane Keaton's production company, Blue Relief, showed interest in the screenplay in the mid-1990s. Initially, the film was to be largely based on Aphrodite Jones' 1996 true crime book All She Wanted, which told the story of Brandon's final few weeks.[15] Earlier drafts of the script incorporated scenes featuring Brandon's family background, including his sister Tammy and mother Joann, as well as some of Teena's ex-girlfriends. However, Peirce modified the script to fit her vision to focus on the relationship between Brandon and his 19-year-old girlfriend Lana Tisdel, which Peirce termed a \"great love story\",[9][16] in contrast to All She Wanted, which did not place an emphasis on the relationship.[15] To fund the writing and development of the project, Peirce worked as a paralegal on a midnight shift and as a 35mm film projectionist; she also received a grant from New York Foundation for the Arts.[17] The project attracted the attention of producer Christine Vachon, who had seen a short film Peirce had made for her thesis in 1995.[11] IFC Films, Hart Sharp Entertainment, and Killer Films, Vachon and Eva Kolodner's production company, provided financing for the project. IFC contributed roughly $1 million, but the film's eventual budget remained under $2 million.[18] Peirce co-wrote the screenplay with Andy Bienen. They worked together for 18 months on the final drafts and were careful not to \"mythologize\" Brandon; the aim was to keep him as human as possible.[12] In the editing stage of the script, Peirce sent the draft to Fox Searchlight Pictures, which agreed to produce and distribute the film while giving Peirce artistic license.[18]Prior to filming, Peirce researched the facts by interviewing the people surrounding the case.[19] She immersed herself in the information available about the murder, including trial transcripts. She met Lana Tisdel at a convenience store and interviewed her at Tisdel's home.[9] Tisdel, who began dating Brandon just two weeks before he was murdered, was 19-years-old at the time of the murders and lived in Falls City with her mother.[20] Peirce also interviewed Tisdel's mother and Brandon's friends. However, she was unable to interview Brandon's mother or any of his biological family.[9][13] Much factual information, including Nissen being a convicted arsonist, was incorporated into Boys Don't Cry.[21]The filmmakers retained the names of most of the case's real-life protagonists, but the names of several supporting characters were altered. For example, the character of Candace was named Lisa Lambert in real life.[22] The casting process for Boys Don't Cry lasted almost four years.[23] Drew Barrymore was an early candidate to star in the film.[15] Peirce scouted the LGBT community, looking mainly for masculine, lesbian women for the role of Brandon Teena. Peirce said the LGBT community was very interested in the project because of the publicity surrounding the murder.[9] High-profile actors avoided Peirce's auditions at the request of their agents because of the stigma associated with the role. At one point, the project was nearly abandoned because Peirce was not satisfied with most of the people who auditioned.[24] In 1996, after a hundred female actors had been considered and rejected, the relatively unknown actor Hilary Swank sent a videotape to Peirce and was signed on to the project.[9][25] Swank successfully passed as a boy to the doorman at her audition.[26] During her audition, Swank, who was 22, lied to Peirce about her age. Swank said that like Brandon she was 21 years of age. When Peirce later confronted her about her lie, Swank responded, \"But that's what Brandon would do\".[27] Swank's anonymity as an actor persuaded Peirce to cast her; Peirce said she did not want a \"known actor\" to portray Teena.[28] In addition, Peirce felt that Swank's audition was \"the first time I saw someone who not only blurred the gender lines, but who was this beautiful, androgynous person with this cowboy hat and a sock in her pants, who smiled and loved being Brandon.\"[18]Peirce required that Swank \"make a full transformation\" into a male.[18] Immediately after being cast, Peirce took Swank to a hairdresser, where her lower-back length hair was cut and dyed chestnut brown.[26] When she saw her then-husband, Chad Lowe, again, he barely recognized her.[26] Swank prepared for the role by dressing and living as a man for at least a month, including wrapping her chest in tension bandages and putting socks down the front of her trousers as Brandon Teena had done. Her masquerade was convincing; Swank's neighbors believed the \"young man\" coming and going from her home was Swank's visiting brother. She reduced her body fat to seven percent to accentuate her facial structure and refused to let the cast and crew see her out of costume.[28][29] Swank earned $75 per day for her work on Boys Don't Cry, totaling $3,000.[30][31] Her earnings were so low that she did not qualify for health insurance.[32]For the role of Brandon's girlfriend, Lana Tisdel, Peirce had envisioned a young Jodie Foster.[9] The role was also offered to Reese Witherspoon and Sarah Polley.[33] Peirce ultimately decided to cast Chloë Sevigny based on her performance in The Last Days of Disco (1998).[34][35] Sevigny had auditioned for the role of Brandon,[36][37] but Peirce decided Sevigny would be more suited to playing Lana because she could not picture Sevigny as a man.[35][37]\"There's a moment in The Last Days of Disco when Chloë does this little dance move and flirts with the camera,\" she says. \"She has this mix of attractiveness, flirtation and sophistication that she gives you, but then takes away very quickly so that you want more: you want to reach into the screen and grab her. When I saw that, and her confidence and wit, I thought: if she could flirt with Brandon and the audience in that way, that's exactly what we need for Lana. I said to her, 'Will you please audition to play Lana?' She said, 'No.' And I said, 'OK, you can have the role.'\"[35]Sevigny dyed her hair red for the role to match Lana's strawberry blonde hair. Peirce later said, \"Chloë just surrendered to the part. She watched videos of Lana. She just became her very naturally.\"[37]Peter Sarsgaard played John Lotter, Lana's former boyfriend, who raped and murdered Teena. Sarsgaard was one of the first choices for the role. He later said he wanted his character to be \"likable, sympathetic even\", because he wanted the audience \"to understand why they would hang out with me. If my character wasn't necessarily likable, I wanted him to be charismatic enough that you weren't going to have a dull time if you were with him.\"[38] In another interview, Sarsgaard said he felt \"empowered\" by playing Lotter.[39] In an interview with The Independent, Sarsgaard said, \"I felt very sexy, weirdly, playing John Lotter. I felt like I was just like the sheriff, y'know, and that everyone loved me.\"[40] Sarsgaard recalled watching footage of and reading about Lotter to prepare for the role.[41] Peirce cast Alicia Goranson, known for playing Becky on the sitcom Roseanne, as Candace because of her likeness to Lisa Lambert.[9] Like Sevigny, Goranson had initially auditioned for the lead role.[36]Initially, Boys Don't Cry was scheduled to film for thirty days.[18] However, principal photography for the film lasted from October 19 to November 24, 1998. The small budget dictated some of the filming decisions, including the omission of some incidents to speed up the overall pacing. Timing constraints and Peirce's visions relating to the plot limited what could be achieved with the narrative.[9][42] For example, the film portrays a double murder when in actuality a third person, Phillip DeVine—a black disabled man—was also killed at the scene. At the time, he had been dating Lana Tisdel's sister, Leslie, who was omitted from the story.[43][44] Boys Don't Cry was primarily filmed in Greenville, Texas, a small town about 45 mi (72 km) northeast of Dallas. Most of the incidents in the case took place in Falls City, Nebraska,[45][46] but budget constraints led the filmmakers to choose locations in Texas.[9] Peirce initially wanted to shoot in Falls City, but Vachon told her that filming there would not be possible.[18] Afterwards, the film was going to be shot in Omaha, Nebraska, but Peirce felt that \"none of [the places] looked right.\"[18] In addition, Peirce also scouted filming locations in Kansas and Florida before deciding on Texas.[18] One of Peirce's main goals was for the audience to sympathize with Brandon. On the film's DVD commentary track, Peirce said, \"The work was informing me about how I wanted to represent it. I wanted the audience to enter deeply into this place, this character, so they could entertain these contradictions in Brandon's own mind and would not think he was crazy, would not think he was lying, but would see him as more deeply human\".[9][13]Some scenes in Boys Don't Cry required emotional and physical intensity; these were allocated extended periods of filming. The scene in which Brandon, at the wishes of his friends, bumper-skis on the back of a pickup truck, was delayed when a police officer, just arriving at a shift change, required a large lighting crane to be moved from one side of the road to the other. The scenes took six hours to shoot and were filmed at sunrise, resulting in a blue sky being seen in the background.[9] There were some technical complications: some of the filming equipment got stuck in mud, and radio wires in some of the scenes conflicted with the sound production. Swank required a stunt double for a scene in which she falls off the back of a truck. Teena's rape scene was given an extended filming time; Sexton, who portrayed one of the attackers, walked away in tears afterward.[9] Swank found portraying her character daunting and felt the need to \"keep a distance\" from the reality of the actual event. When scenes became difficult, Swank requested the company of her husband on set.[24] At times, Peirce worked for seventeen hours a day in order to complete more work, but the other crew members told her that this was taking up potential nighttime filming hours.[18]Peirce, who had originally sought a career in photography before moving into filmmaking, applied techniques she had learned into the film.[47] She described the film's mood as \"artificial night\".[9] Director of Photography Jim Denault showed her the work of photographer Jan Staller, whose long-exposure night photography under artificial lighting inspired Denault to avoid using \"moonlight\" effects for most of the film. As a way to further incorporate the sense of artificial night, John Pirozzi, who had been experimenting with time-lapse photography using a non-motion-controlled moving camera, was invited to create the transition shots seen throughout the film.[9]The film's visual style depicts the Midwestern United States in a \"withdrawn\",[48] dark and understated light to give a \"surreal\" effect.[49] Denault shot Boys Don't Cry in flat, spherical format on 35 mm film using Kodak Vision film stock. The film was shot with a Moviecam Compact camera fitted with Carl Zeiss super speed lenses. For the scene in which Brandon is stripped, a hand-held camera was used to give a sense of subjectivity and intimacy.The use of low natural light and heavy artificial light is illustrated early in the film in the opening roller rink scene in which Brandon pursues his first relationship with a young woman. For this scene, Peirce used a three-shot method similar to that used in a scene in The Wizard of Oz (1939) in which Dorothy leaves her house and enters Oz.[9] The scene consists of a three-shot sequence meant to symbolize Brandon's metaphorical \"entrance to manhood\", or Brandon's social transition from a woman to a man. Some scenes were given a prolonged shooting sequence to induce a feeling of hallucination. An example is the sequence in which Brandon and Lana first have sex, followed by a shot of her, Brandon, Candace, and Kate driving in a car against a city skyline backdrop.[9] The scene in which John and Tom strip Brandon was filmed with three cameras due to time constraints, even though Peirce wanted six cameras to film it. The scene took an hour and a half to film in total.[18]Peirce drew inspiration from the filming style of John Cassavetes and the early work of Martin Scorsese, and she incorporated neo-realist techniques into the film.[50] She was also influenced by a second style of work—the \"magical\" films of Michael Powell and Kenji Mizoguchi.[50] The former style is used when Brandon joins the social circle of John, Tom, Lana and her mother, while the latter is used when Brandon and Lana begin to depart from that life.[12] The film was also influenced by Bonnie and Clyde (1967).[50] Peirce incorporated influences from Raging Bull (1980) by opening the film with a shot of Brandon traveling along a highway, as seen from the character's imaginative or dream perspective, similar to the beginning of Raging Bull.[9] When a character expresses a dream or hopeful assertion, Peirce cuts to an \"eerily lit\" dream landscape.[51] The Pawnbroker (1964) inspired the cinematography and editing of Brandon's rape scene, particularly in its use of fast cutting.[50]Because the film is set in the rural Midwestern United States, the Boys Don't Cry soundtrack album features a compilation of country, blues and rock music. Nathan Larson and Nina Persson of The Cardigans composed an instrumental version of Restless Heart's 1988 country-pop song \"The Bluest Eyes in Texas\", a variation of which was used as the film's love theme and score.[9] The song itself is heard during a karaoke scene, sung by Sevigny's character, and at the end of the film. The title of the film is taken from the song of the same name by British rock band The Cure. An American cover of the song, sung by Nathan Larson, plays in the background in the scene in which Lana bails Brandon out of jail and during one of their sex scenes. However, the song is not included on the released soundtrack. Songs by Lynyrd Skynyrd (\"Tuesday's Gone\"), Paisley Underground band Opal (\"She's a Diamond\") and The Charlatans (\"Codine Blues\") also appear in the film, as do cover versions of other songs. The soundtrack was released on November 23, 1999, by Koch Records.[52] \"The Bluest Eyes in Texas\" was played when Hilary Swank went onstage to receive her Academy Award for Best Actress in 2000.[53][54] The song also plays over the film's end credits.[55]","produced_by":"Jeffrey Sharp|Eva Kolodner|Christine Vachon|","starring":"Hilary Swank|Chloë Sevigny|Peter Sarsgaard|Brendan Sexton III|Alicia Goranson|Jeannetta Arnette|Matt McGrath|","running_time":"118 minutes[1]","Themes and analysis":"Unlike most films about mind-numbing tragedy, this one manages to be full of hope.Boys Don't Cry has been widely discussed and analyzed by scholars and others. Roger Ebert described the film as a \"romantic tragedy\" embedded in a working class American setting, calling it \"Romeo and Juliet set in a Nebraska trailer park\".[57] Philosopher Rebecca Hanrahan argued that the question of identity—particularly Brandon's—is alluded to frequently in Boys Don't Cry and that Peirce poses the nature of identification and self as the film's main question.[58] Journalist Janet Maslin said the film is about accepting identity, which in turn means accepting the fate predisposed for that identity.[56] Paula Nechak called the film a \"bold cautionary tale\";[59] she regarded the film as a negative, dismal depiction of Midwestern America, writing that \"[Peirce's film has] captured the mystique and eerie loneliness\" and \"isolation of the Midwest, with its dusty desolation and nowhere-to-go frustration that propels people to violence and despair\".[59]Christine Vachon, the film's executive producer, said, \"It's not just about two stupid thugs who killed somebody. It's about these guys whose world is so tenuous and so fragile that they can't stand to have any of their beliefs shattered\", referring to John and Tom's views of their lives, Brandon's aspirations and his biological sex.[56][60] Along with other turn-of-the-millennium films such as In the Company of Men (1997), American Beauty (1999), Fight Club (1999), and American Psycho (2000), Vincent Hausmann said Boys Don't Cry \"raises the broader, widely explored issue of masculinity in crisis\".[61] Jason Wood said the film, together with Patty Jenkins's Monster (2003), is an exploration of \"social problems\".[62]Several scholars commented on the relationship between Brandon and Lana as well as Brandon's relationship to John and Tom. Carol Siegel regarded the film as a thematically rich love story between two ill-fated lovers, similarly to Romeo and Juliet.[63] Judith Halberstam (or Jack Halberstam) attributed Boys Don't Cry's success to its ostensible argument for tolerance of sexual diversity by depicting a relationship between two unlikely people. This tragic aspect of the love story led Halberstam to compare Brandon and Lana's relationship and subsequent drama to classic and modern romances including Romeo and Juliet, often using the term star-crossed lovers.[64] In the Journal for Creativity in Mental Health, Jinnelle Veronique Aguilar discussed Brandon's ability to create interpersonal relationships in the film. She opined that Brandon wanted to create close relationships, but he could not due to his transgender status until he became close with Lana. \"Although Brandon is able to make a brief but authentic connection with Lana, he continues to experience a sense of aloneness in the world. He consistently faces a sense of fear related to the power-over dynamics that he and others who are transsexual face…Brandon experiences the central relational paradox, in which he yearns for connection; however, due to the real threat he faces, he is unable to make that connection.\"[65]Myra Hird, in the International Feminist Journal of Politics, argued that John and Brandon exemplify two different and contrasting types of masculinity, and that Brandon's version is preferred by the film's female characters, comparing them to Arnold Schwarzenegger and Jimmy Stewart, respectively. \"Throughout the film, John offers the viewer a typified narrative of heteronormative masculinity. […] Against this hegemonic masculinity, Brandon offers a masculinity reminiscent of a by-gone era of chivalry.\" Furthermore, she contended that John was threatened by Brandon's version of masculinity. \"Gender boundaries are taken extremely seriously in Western society, and Boys Don't Cry depicts how intensely threatened John and Tom are by Brandon's superior portrayal of a masculinity 'schedule'. John cannot abide Brandon's desire, and clear ability, to access male privilege, and his reaction is to force Brandon to be female through the act of rape.\"[66]Other commentators discussed the more complex psychological causes of Brandon's murder. Halberstam commented on the complicated causes of the murder, and whether it was due to transphobia or homophobia: \"Ultimately in Boys [Don't Cry], the double vision of the transgender subject gives way to the universal vision of humanism, the transgender man and his lover become lesbians and the murder seems instead to be the outcome of vicious homophobic rage.\"[67] Ebert called the film a \"sad song about a free spirit who tried to fly a little too close to the flame\".[57] In the same journal, Julianne Pidduck commented on the film's rape and murder scenes, \"Effectively, the viewer is asked to experience the rape from the victim's point of view. The film invites political, emotional and corporeal allegiances linked to known and imagined risk, especially for female and/or queer viewers. An allegiance with Brandon's outsider status aligns the viewer with Brandon's initial exhilaration at his transgressive success as a boy, drawing us through to the film's disturbing finale.\"[68]Many scholars addressed the various performances of gender by the characters in the film; Moss and Lynne Zeavin offered a psychoanalytic analysis,[nb 2] calling the film a \"case report\" that \"presents [Brandon's] transsexual inclinations as a series of euphoric conquests\" and \"focuses on a range of anxious reactions to her [sic] transsexuality. […] or a case not for what they might reveal about female hysteria, but for what they might reveal about misogyny\".[69] Elaborating on the themes of the film, they wrote:In her film, Pierce [sic] inserts the unconventional problems of transsexuality into a conventional narrative structure. Throughout the film Brandon is presented as a doomed, though beguiling and beautiful rascal, recognizably located in the lineage of well-known cinematic bad-boys like James Dean, Steve McQueen, and Paul Newman. Like these predecessors, Brandon's heroic stature derives from her [sic] unwillingness to compromise her [sic] identity … Pierce [sic] presents Brandon's struggles against biological determinism as the struggles of a dignified renegade.[70]Brenda Cooper, in Critical Studies in Media Communication, argued that the film \"can be read as a liberatory narrative that queers the centers of heteronormativity and hegemonic masculinity by privileging female masculinity and celebrating its differences from heterosexual norms.\"[71] She argued that the film challenged heteronormativity by criticizing the concept of the American Heartland, by presenting problems with heterosexual masculinity and its internalised aggression, by \"centering female masculinity\", and blurring gender boundaries.[71] Later on in the same essay, she commented that Brandon both embodied and rejected traditional masculinity, providing a new outlook on what it means to be a man which excited and thrilled the women in the film: \"Brandon’s performance of masculinity, however, can be interpreted as operating on two levels in the narratives: When Brandon tries to establish his male identity with his new buddies, he imitates the kind of overly aggressive macho machismo that John and Tom represent. But Lana falls for Brandon because of his version of masculinity, which contradicts and challenges traditional assumptions about what it takes to be a man and to please a woman. Brandon’s articulation of manhood effectively mocks sexist masculine ideals and appropriates the codes of normative masculinity.\"[72] Michele Aaron, in Screen, claimed that the film was primarily centered on \"the spectacle of transvestism\" and that the film as a whole was \"a tale of passing\".[73]Jennifer Esposito wrote that \"We watch onscreen as Brandon binds his breasts, packs a dildo, fixes his hair in a mirror. His masculinity is carefully scripted. John and Tom…are never shown preparing for masculinity. They are already masculine.\"[74] Melissa Rigney argued that the film defied traditional portrayals of transgender characters by not confining Brandon to certain stereotypes. \"On the surface, Boys Don't Cry appears to hold the potential of rendering gender in excess: the figure of Brandon Teena can be read variously as butch, male, lesbian, transgender, transsexual, and heterosexual. […] Although female masculinity comes to the forefront in this film, I argue that the film attempts to subsume the transgressive potential of the gender outlaw within a lesbian framework and narrative, one that reduces and, ultimately, nullifies Brandon's gender and sexual excess.\"[75] In contrast, Annabelle Wilcox opined that the film primarily reinforced the gender binary by showing that \"Brandon's body is branded by such rhetoric and representation, and is assumed to be a site of 'truth' that closes the question that being transgender poses for subjectivity, gender, and sexuality.\" She also went on to note that many film critics either disregarded Brandon's male identity or used female pronouns when referring to him.[76] Rachel Swan, writing for Film Quarterly, wrote that Brandon's masculinity was often contrasted with Lana's femininity as a means of illustrating the two sides of the gender binary. In addition, she regarded John and Tom's rape of Brandon as an attempt to psychologically castrate him.[77]In another piece, Halberstam compared the media portrayal of Brandon to that of Billy Tipton, a jazz musician who no one knew was transgender until the post-mortem discovery that he was assigned female at birth. She wrote, \"On some level Brandon's story, while cleaving to its own specificity, needs to remain an open narrative—not a stable narrative of FTM transsexual identity nor a singular tale of queer bashing, not a cautionary fable about the violence of rural America nor an advertisement for urban organizations of queer community; like the narrative of Billy Tipton, Brandon's story permits a dream of transformation.\"[78] Christine Dando argued that \"masculinity is associated with outside and femininity with interior spaces.\"[55]Lisa Henderson commented on the intersection between social class and gender in the film, particularly Brandon's working-class status: \"My reading of Boys [Don't Cry] through the lens of class representation is not born of a univocal search for so-called positive images, but I do recoil at what appears to me to be a new instalment in a long history of popular images of working-class pathology. […] But that is not the whole story. Within this universe of feeling and reaction structured by lack and tinted blue by country lyrics and a protective and threatening night-time light, characters imbricate gender and class through their longings for love, acceptance and a better life.\"[79] Jennifer Devere Brody commented on the film's exclusion of Philip DeVine, a disabled African-American man who was another victim of the shooting. \"Perhaps one can only speculate about the motivations behind this decision. But the effects are familiar ones in the history of racist representations. The erasure of DeVine from the narrative places the white female bodies as the only true victims of crime; and the film's inability to show DeVine as violated rather than violator perpetuates the myth of the black man as always already a perpetrator of crime.\"[80] Regarding Devine, Halberstam wrote, \"Peirce perhaps thought that her film, already running close to two hours, could not handle another subplot, but the story of Philip DeVine is important and it is a crucial part of the drama of gender, race, sexuality, and class that was enacted in the heartland. Race is not incidental to this narrative of mostly white, Midwestern small towns and by omitting DeVine's story from Boys Don't Cry, Peirce contributes to the detachment of transgender narratives from narratives about race, consigning the memory of DeVine to oblivion.\"[78]Several authors commented on the possible impact that the film's setting of Falls City, Nebraska, located in the Midwestern United States, could have had on the film's plot. Maslin called Boys Don't Cry a tale of a trapped, small town character's search for life beyond the rural existence and the high price he pays for his view of the \"American dream\".[56] Regarding the film's portrayal of Nebraska, Halberstam wrote, \"The landscape of Nebraska then serves as a contested site upon which multiple narratives unfold, narratives indeed which refuse to collapse into simply one story. Some of these narratives are narratives of hate, some of desire; others tell of ignorance and brutality; still others of isolation and fear; some allow violence and ignorant prejudices to become the essence of white poor rural identity; still others provoke questions about the deployment of whiteness and the regulation of violence.\"[78]Christina Dando wrote that the typical portrayal of the Midwest as a \"frontier\" area did not come through in the film until the setting switched from Lincoln to Falls City: \"The flat landscape, the spacious sky, the home, evoke two different Plains time periods familiar to many Americans through historic photographs: the early settlement process…and 1930s Farm Security Administration photographs. It is virtually timeless. There is also a sense of both place and placelessness. While the landscape is distinctively Plains, it could be described as nowhere.\"[55] She went on to argue that the setting is not only conveyed visually, but also through the characters' homes. \"While there is no trailer park in Falls City, Brandon's community there occupies the margin: Candace and Lana's homes appear to be on the outskirts of town, or even outside of town. There are no complete families, only the family that that has been created. The men appear to have no homes, relationally or physically: none are shown to have family.[55] Speaking about the film's cinematography and the relation to its themes:The Plains frontier landscape as it is constructed in Boys Don't Cry is dark, literally and figuratively. Most of the scenes are set at night, utilizing night Plains skies with time-lapse clouds, heightening the isolation. Film frames of placeless and timeless. The community also is dark. It is marginal, just managing to get along, and in the end deadly. While the classic Western dichotomy of men associated with exteriors and women with interiors is apparent, so too is Brandon's border-crossing. He appears to be able to easily handle both landscapes, yet belong to neither.[55]Dando compared the film to other tragic books and films that have been set on the Great Plains, including My Ántonia, Giants in the Earth, The Grapes of Wrath, In Cold Blood, and Badlands, writing that unlike the other works, \"Brandon is [a] character who truly crosses frontiers.\"[55]","music_by":"Nathan Larson","edited_by":"Tracy Granger","Release":"Boys Don't Cry aired in Canada at the Toronto International Film Festival (TIFF) in September 1999.[81] It premiered in the U.S. at the New York Film Festival on October 8, 1999, to critical acclaim.[56] It was shown at the Reel Affirmations International Gay and Lesbian Film Festival in early October, where it won further praise and appeared at the Venice International Film Festival.[82][83] Boys Don't Cry was given a special screening in snippets at the Sundance Film Festival. At that time, the film was still called Take It Like a Man.[84] The film received a limited release theatrically on October 22, 1999, in the U.S.,[85] where it was distributed by Fox Searchlight Pictures, a subsidiary of Twentieth Century Fox that specializes in independent films.[86] Initially, many viewers complained via email to Peirce that the film was not being shown near them, as the film was only being shown on 25 screens across the country. However, this number increased to nearly 200 by March 2000.[87] The film grossed $73,720 in its opening week. By December 5, the film had grossed in excess of $2 million. By May 2000, it had a U.S. total gross of $11,540,607—more than three times its production budget.[2] Internationally, the film was released on March 2, 2000 in Australia[88] and on April 9, 2000, in the United Kingdom.[89]There may not be a better acted film this year. Every inch of the character exudes a male sensibility so powerfully, and at times so vulnerably, that Swank's performance crosses into a realm of veracity rare in any film acting.Critics lauded Boys Don't Cry in 1999, with many calling it one of the best films of the year.[48][91][92][93][94] Review aggregator Rotten Tomatoes reports 88% of 75 professional critics gave the film a positive review; the site consensus is that \"Hilary Swank's acclaimed performance pays fitting tribute to the tragic life of Brandon Teena\".[59] Another review aggregator, Metacritic, gave the film an 86 of 100, indicating \"universal acclaim\".[95] One reviewer said the film was a \"critical knockout\".[12]Swank and Sevigny give performances that burn in the memory. Boys Don't Cry means to shake you, and does.Critics often praised the performances by Swank and Sevigny; Peter Travers said the pair \"give performances that burn in the memory\",[96] and The Film Stage termed Swank's performance \"one of the greatest\" Best Actress Oscar-winning performances.[97] Peter Stack of the San Francisco Chronicle lauded the lead acting performances of Swank, Sevigny, Saarsgard, and Sexton III, writing, \"It may be the best-acted film of the year\".[90] Online film reviewer James Berardinelli gave the film three and a half stars out of four; he highlighted the performances of Swank and Sevigny as the film's greatest success and likened the film's intensity to that of a train wreck. Berardinelli wrote that Swank \"gives the performance of her career\" and that \"Sevigny's performance is more conventional than Swank's, but no less effective. She provides the counterbalance to the tide of hatred that drowns the last act of the film.\"[22] Emanuel Levy of Variety Magazine called the acting \"flawless\" and concluded that the \"stunningly accomplished\" and \"candid\" film could be \"seen as a Rebel Without a Cause for these culturally diverse and complex times, with the two misfits enacting a version of the James Dean—Natalie Wood romance with utmost conviction, searching, like their '50s counterparts, for love, self-worth and a place to call home\".[3] Stephen Hunter of The Washington Post said the performances are of such \"luminous humanity that they break your heart\".[98] Premiere listed Swank's performance as one of the \"100 Greatest Performances of All Time\".[99] Owen Gleiberman of Entertainment Weekly called Swank a \"revelation\" and wrote, \"by the end, her Brandon/Teena is beyond male or female. It's as if we were simply glimpsing the character's soul, in all its yearning and conflicted beauty.\"[100]Other reviewers were positive towards the way Boys Don't Cry portrayed its subject matter. and Roger Ebert of the Chicago Sun-Times listed Boys Don't Cry as one of the five best films of 1999, saying, \"this could have been a clinical movie of the week, but instead it's a sad song about a free spirit who tried to fly a little too close to the flame\".[57] Janet Maslin of The New York Times said the film was \"stunning\" and gave it four stars out of four stars. Maslin said, \"unlike most films about mind-numbing tragedy, this one manages to be full of hope\".[56] Kenneth Turan of The Los Angeles Times praised the lack of romanticization and dramatization of the characters, and wrote, \"Peirce and Bienen and the expert cast engage us in the actuality of these rootless, hopeless, stoned-out lives without sentimentalizing or romanticizing them\" and that \"Boys Don't Cry is an exceptional—and exceptionally disturbing film\".[101] Mike Clarke of USA Today commended Peirce's depth of knowledge of the case and the subject matter, writing, \"Peirce seems to have researched her subject with grad-school-thesis intensity\".[59]Jay Carr of The Boston Globe wrote, \"Boys Don't Cry not only revisits the crime, but convinces us we're being taken inside it\".[59] Stephanie Zacharek of Salon gave a positive review, singling out the directing and acting. She wrote, \"Peirce ... covers an extraordinary amount of territory, not just in terms of dealing with Brandon’s sexual-identity and self-fulfillment issues, but also in trying to understand the lives of those around him\". Zacharek described Swank's performance as \"a continual revelation\" and Sevigny's performance as \"transformative\". She said, \"When Brandon dies, \"Boys Don’t Cry\" reaches an emotional intensity that’s almost operatic. The saddest thing, though, is seeing Sevigny’s Lana crumpled over his corpse—the way she plays it, you know that when Brandon went, he took a part of her with him, too\".[51] David Edelstein of Slate was also very positive towards the film, calling it \"a meditation on the irrelevance of gender.\" He went on to praise Swank, Sevigny, and Sarsgaard in their roles, especially Sevigny, writing that she \"keeps the movie tantalizing\".[102]The film was not without detractors, who focused on the film's portrayal of Brandon and his actions. Richard Corliss of Time magazine was one of the film's negative reviewers; he wrote, \"the film lets down the material. It's too cool: all attitude, no sizzle\".[59] Peter Rainer of New York Magazine compared the film unfavorably with Rebel Without a Cause (1954), calling it a \"transgendered\" version, elaborating that the film \"could have used a tougher and more exploratory spirit; for Peirce, there was no cruelty, no derangement in Brandon's impostures toward the unsuspecting.\"[103] In 2007, Premiere ranked the film on its list of the \"The 25 Most Dangerous Movies\".[104]The film was generally well-received by the LGBT community. Boys Don't Cry's release came a year after the murder of a homosexual teenager, Matthew Shepard,[105] which occurred October 12, 1998. The murder sparked additional public interest in hate crime legislation in America and in Brandon Teena, and increased public interest in Boys Don't Cry.[106] Cooper wrote that Boys Don't Cry \"is perhaps the only film addressing the issue of female masculinity by a self-described queer filmmaker to reach mainstream audiences and to receive critical acclaim and prestigious awards.\"[107] However, Noelle Howey, writing for Mother Jones, wrote that despite the critical acclaim, relatively few critics understood what she perceived as the main point of the film—Brandon being a victim of trans bashing. Howey said, \"Even a cursory glance at reviews of \"Boys Don't Cry\" reveals that while most critics admired the film, few absorbed its main point: that Brandon Teena was a biological girl who felt innately that she was a man. Most of the media instead cast Teena as a Yentl for the new millennium, rather than a victim of anti-transgender bigotry.\"[8]The accuracy of Boys Don't Cry was disputed by real-life people involved in the murder. The real Lana Tisdel declared her dislike for the film; she said Brandon never proposed to her and that when she discovered the truth about Brandon's sex, she ended the relationship and left him. Tisdel disliked the way she was portrayed in the film, and called the film the \"second murder of Brandon Teena\".[108] Before the film's theatrical release, Lana Tisdel sued the film's producers, claiming that the film depicted her as \"lazy, white trash and a skanky snake\"[109] and that her family and friends had come to see her as \"a lesbian who did nothing to stop a murder\".[110] Tisdel said the film falsely portrayed her continuing her relationship with Teena after she discovered he was transgender. Tisdel settled her lawsuit against Fox Searchlight for an undisclosed sum.[109][111] Sarah Nissen, cousin of perpetrator Marvin Nissen, was also critical of the film, saying, \"There's none of it that's right. It was just weird.\"[112] Leslie Tisdel, Lana's sister, called the film \"a lie of a movie\".[110] Leslie was not included in the film, and her ties with the third victim. Phillip DeVine, was omitted due to storyline constraints.Lana Tisdel's potential involvement in the rape and murder of Brandon Teena was also highlighted. Various people involved in the case, particularly Brandon's family, have alleged that Tisdel was somehow involved with the murders, or had at least set them up in an act of vengeance. Perhaps the most notable admission about Tisdel's motives came from Tom Nissen, who infamously confessed that Tisdel was present at the time of the murders in the car and had even tried knocking on the door of the farmhouse where Brandon, Lambert and DeVine were staying.[113] When nobody answered the door, Nissen alleges that Lotter broke in while Tisdel waited in the vehicle while the murders were carried out. Tisdel denied this and a lack of evidence meant that it could not be vigorously pursued in the proceeding court case–the residing judge considered most of Nissen's claims as nothing more than hearsay. Not only did Tisdel vehemently deny any involvement in Brandon's murder, she denied ever being present at Lisa Lambert's farmhouse on the night Brandon was murdered. Unlike Tisdel's own evidence and the admissions presented in court, Boys Don't Cry took the liberty of placing Tisdel at the crime scene, albeit without any intention of setting Brandon up.The film won a variety of awards, most of which went to Swank for her performance. Swank won a Best Actress Oscar while Sevigny received a nomination in the category of Best Supporting Actress.[114] From the Hollywood Foreign Press, the film received two Golden Globe nominations in the same two categories (Best Actress, Best Supporting Actress) for Swank and Sevigny, winning Best Actress. Swank and Sevigny both received Best Actress Awards from the New York Film Critics Circle, the Chicago Film Critics Association Awards and an Independent Spirit Award. The film won three awards at the Boston Society of Film Critics Awards; Best Actress (Swank), Best Supporting Actress (Sevigny) and Best Director (Peirce). Swank and Sevigny won Satellite Awards for their performances, and the film was nominated in two categories; Best Picture (Drama) and Best Director. It was named one of the best films of the year by the National Board of Review of Motion Pictures.[91]The family of Brandon Teena criticized Swank for her repeated use of the male gender pronoun \"he\" in her Oscar acceptance speech. Teena's mother JoAnn Brandon said her child's transgenderism was a defense mechanism that was developed in response to childhood sexual abuse, rather than being an expression of Teena's gendered sense of self. She said, \"She pretended she was a man so no other man could touch her\".[115][116] Despite the criticism, Kevin Okeefe, writing for Out, defended Swank's acceptance speech; he said, \"Swank deserves a place in the great acceptance speech canon for being bold, not only as an actress, but as an award winner\".[117]Boys Don't Cry garnered significant attention for its graphic rape scene.[118] The film was initially assigned an NC-17 rating from the MPAA; the content was toned down for the U.S. release, where it was rated R. Peirce was interviewed for a 2005 documentary titled This Film Is Not Yet Rated, which discussed the film's problems with the MPAA, particularly the censoring of the sex scenes.[119] The portrayal of a double rape caused significant problems with the MPAA and had to be trimmed to avoid the NC-17 rating.[120] Both the Australian and European version are more explicit, particularly the first rape. Peirce was angry because the MPAA wanted the sex scene between Brandon and Lana removed but was satisfied with the level of brutality in the murder scene.[119]Boys Don't Cry was first released on home video by Fox Searchlight Pictures in September 2000 apart of a \"Premiere Series\", preceded by a DVD release in April 2000 in the United States and Canada.[121] The DVD's special features included a commentary by Kimberly Peirce and a behind-the-scenes featurette containing interviews with Peirce, Swank and Sevigny; there was also a theatrical trailer and three television trailers.[121][122] This same edition was re-released in 2009 with different cover art.[123] The film was released on Blu-ray on February 16, 2011, by 20th Century Fox Entertainment in conjunction with Fox Pathé Europa.[124]","written_by":"Andy Bienen|Kimberly Peirce|","budget":"$2 million"}