{"Cast":"You may move your hands to better express yourself on stage or in front of the camera, but in a voice booth, you only have your voice as a communication tool to express yourself. Plus, there is the additional pressure of maintaining that character and ensuring there’s a level of normalcy.","country":"Pakistan","distributed_by":"ARY Films","story_by":"Kamran Khan","Plot":"The story starts off in a lively neighbourhood called and a festival was going on. A little while later, a little girl was kidnapped by a thug named Mangu. A brave man ran after him, knocked the thug over and rescued the girl. Mangu ran away to a cave and met a hideous creature named Babou Balam who gave him evil powers and told him to protect the key of evil. One night, Mangu emerged from the tower clock and ordered the people of Roshan Nagar that he is now their king. To this, the man who rescued the girl, went forward scolded him. Consequently, used his powers to strangle the man and raised him up to the tower, killing him. Soon, Mangu's thugs pread fear all over the small town and it became known as Andher Basti. Three friends, Saadi, Amna and Kamil want to find out about the tower and want to defeat the thugs even though Saadi's mother orders him not to pay attention to it. The three enter the tower and are granted powers by unknown creatures. Amna has been granted super speed, Kamil was granted super hearing and Saadi was granted intelligence and the ability to comprehend things cleverly. The next night, they enter the tower again and defeat Mangu's thugs and while Mangu is attacking them himself, they are shielded by the unknown creatures and are brought to an unknown place. There they get to know that their local security guard, Deenu Chacha is the guardian of the key which preserves all the good powers. There, the three kids are granted more powers. Kamil has the ability to fly and jump up high, Amna has the power to create shields and Saadi has the power to create black holes. Mangu tells Saadi about his father's death and recalls that the brave man was Saadi's father who tried to stop him 10 years ago. Saadi then become very frustrated and angry after knowing this. They use all there powers to defeat Mangu by throwing the evil key into a powerful black hole that Saadi created with all his power. As the key is destroyed, Mangu's powers have finished too and the 3 Bahadur succeed in returning peace to their land.","language":"Urdu","Reception":"The movie opened better on Friday with day one collecting ₨3 million (US$29,000).[39] Movie grew around 10% on Day two collecting ₨4 million (US$39,000)[39] surpassing Good Morning Karachi and became second-highest-grossing Pakistani film of 2015 after Jalaibee. The movie collected ₨6 million (US$59,000) on Sunday taking the three-day weekend to ₨12.5 million (US$120,000).[40] The film collected ₨2 million (US$20,000) on Monday, ₨1.9 million (US$19,000) on Tuesday, ₨1.8 million (US$18,000) on Wednesday and ₨1.6 million (US$16,000) on Thursday[41] At the end of week one, the film did business of ₨3.5 million (US$34,000) comparative to previous days, taking its one-week total to ₨23.8 million (US$230,000).[42] The film added ₨20 million (US$200,000) at the end of the second week to the total of ₨46.3 million (US$450,000)[43] and became highest grossing Pakistani animated film breaking the previous record of Rio 2 which collected ₨45 million (US$440,000).[10] The film surpassed Main Hoon Shahid Afridi after collecting ₨1.38 crore (US$140,000) in third week of its release, taking 21 days total to ₨5.41 crore (US$530,000).[44] The fourth week business was ₨6 million (US$59,000).[45]Film got effected by Ramadan in 5th and 6th week as film collected ₨2.5 million (US$25,000) in these two weeks combined taking 6 Weeks total to ₨65 million (US$640,000).[46] The film completed its 50-day run in theaters with total collection reaching ₨6.63 crore (US$650,000)[1]Rafay Mahmood of The Express Tribune rated the film 3 out of 5 stars and given the verdict as, \"3 Bahadur has funny and frightening moments for children. The use of Urdu language may be the only saviour if they enter expecting something similar to Madagascar or Rio.\"[47] Mehreen Hasan of DAWN.com wrote \"3 Bahadur did half the job in setting the stage for deeper exploration of evil, but barely addresses its root causes or the possibility of reform. Maybe the sequel will address these angles, but it's a lesson delayed.\"[48] Zeeshan Mahmood of Galaxy Lollywood rated 4/5 stars and verdicts as \"3 Bahadur is a brave, intelligent and sincere effort by Waadi Animations, ARY Films and Sharmeen Obaid Chinoy and it will, hopefully, set a trend of making animated films and especially films for the kids in Pakistan. Being first animated feature film for kids, it deserves all the credit and praise ignoring its shortfalls. 3 Bahadur is a gift for the kids and it is expected from the parents to take them to the cinemas and enjoy it with them.\"[49] Faizan Ahmed or brandsynario rated it 7/10 stars and gave the verdict, \"Being the first Pakistani animated feature film, 3 Bahadur had a lot to prove. It was quite a burden, expectations were high and the film delivers what was expected. The effort of introducing a Pakistani animated film should be applauded and cherished. Children can easily relate to the main characters. Overall it is a commendable effort and for the kids, a must watch.\"[50] Hala Syed of hip reviewed the film & verdicts as \"Sneakily perceptive 3 Bahadur has a charm and delicacy that will appeal to everyone. Children will find something to relate to and adults will be reminded of what it is like to be a kid.\"[51]","box_office":"₨6.75 crore (US$660,000)[1]","cinematography":"Kamran Khan","production_company":"Waadi Animations SOC Films ARY Films","directed_by":"Sharmeen Obaid Chinoy","release_dates":"May 22, 2015 (2015-05-22) (Pakistan)|November 13, 2015 (2015-11-13) (Worldwide)||||","Production":"On 11 September 2014, ARY Films and SOC Films announced a joint venture company by the name of Waadi Animations. Their intention was to produce animated content, including feature films, and announced that their debut project was 3 Bahadur. Sharmeen Obaid Chinoy, CEO Waadi Animation said, \"This partnership will allow us to create animated super heroes and heroines that will make us laugh and cry and, most importantly, entertain. We all have an inner child and we will attempt to nurture the imagination of that child at Waadi Animations.\"[13] At the first look event of the film in Nueplex Cinemas Karachi, the creative director Sharmeen Obaid Chinoy revealed that \"[A]lmost three years ago, I had an intense desire to create an animated feature in Pakistan, which would appeal to both children and adults alike. I have to admit, venturing into the realm of animation was unchartered territory for my team and I, but everyone quickly warmed up to the idea and we began learning the ropes and assembling a team of some of the best animators in the country to work with us. We are proud to announce and share the fruit of our hard work and efforts; Pakistan’s first animated feature film.”[14][15] Sharmeen Obaid stated that \"3 Bahadur is not just a movie. It is a movement. The message we’re sending with this film is that ‘We shall overcome.’ Like these three kids (film main characters), we can face the challenges that come our way. You don’t need to be a superhero. You are a superhero.”[16] The film is produced enteriely in Pakistan, based in a fictional town named Roshan Basti (town of light).[8]On 12 September 2014, it was announced that Zuhab Khan would play the lead role in the film, while Muneeba Yaseen and Hanzala Shahid were in early talks to join the cast. On 22 September 2014, Behroze Sabzwari, Alyy Khan, Abu Rashid Khan, Kulsoom Aftab Ahmed, Farhan Qureshi, Mustafa Changazi, Badar Qureshi, Nadir Siddiqui, Wasif Arshad and Khalid Ahmed were also in final talks to join the film, Bassam Shazali was added to the cast, playing Pateeli and Chapta and on 26 September 2014, Hammad Siddiqui and Joel Frenzer joined the cast of the film, playing Gutka, Shikra and Gabru.3 Bahadur's sound was designed by Dan Golden and mixed by John Bowen. The original score was composed by John Angier with additional vocals by Jacqueline Angier. The foley artist was Soundsquare. The film's soundtrack is composed, sung and produced by Shiraz Uppal at SU Studios, Lahore.[17] The video of theme song directed by Nadir Siddiqui, Husain Qaizar and produced by Wasif Arshad was released on April 20, 2015.[18] Lyrics of title track are penned by Shakeel Sohail.[19] 3bahadurmThe movie was done in 3D computer animation. Waadi Animations has engineers on its staff who understand the physics of sound and light and how these elements will affect movement in characters.","produced_by":"Sharmeen Obaid Chinoy Salman Iqbal Jerjees Seja","starring":"Muneeba Yaseen Hanzala Shahid Zuhab Khan","running_time":"94 minutes","Sequel":"As per report, after success of 3 Bahadur at box office the filmmakers intend to release a sequel by December 2016.[10] In November 2015, it was officially announced by director that 3 Bahadur will return with a sequel in 2016.[52] Director said: \"3 Bahadur was a very special project for me because it inculcated a sense of pride and ownership in Pakistani children. Now, with 3 Bahadur Part 2, I want to make sure that Saadi, Kamil and Amna inspire bravery and fearlessness in every child across the country.\"[53] The first look of sequel was unveiled in February 2016, under the title 3 Bahadur: The Revenge of Baba Balaam, the film cast included Fahad Mustafa, Sarwat Gilani, Ahmed Ali Butt, Zeba Shahnaz and Ali Gul Pir.[54]","3_bahadur":"Theatrical release poster","music_by":"John Angier","edited_by":"Husain Qaizar","Release":"3 Bahadur was premiered in Karachi on May 19, 2015.[20] The film was released nationwide by ARY Films on May 22, 2015.[9]The first look teaser trailer of film was revealed by Salman Iqbal (CEO ARY) and Sharmeen Obaid Chinoy in a special screening at 1st ARY Film Awards.[21] On 23 December, the film trailer was also premiered at a press event held at Nueplex Cinemas Karachi[22][23][24] where the Director of Waadi Animations, Salman Iqbal stated that \"We are proud to be bringing the first animated feature film 3 Bahadur under the banner of Waadi Animations, aimed at bringing quality entertainment to our little cinema fans. 3 Bahadur will definitely set a culture of making inspirational movies for children in Pakistan\" The Film Director, Sharmeen Obaid Chinoy commented \"I believe that 3 Bahadur is going to be groundbreaking because it provides quality entertainment for the whole family.\"[25] On March 27, 2015 full-length theatrical trailer was revealed on ARY Digital Network by Waadi Animations.[26][27] The trailer was also screened on several cinema screens from April onwards.[28] Waadi Animations (joint venture by SOC Films and ARY Films), announced their core partners and synergies for the film to be released by ARY Films.[29][30][31] English Biscuit Manufacturers (EBM) Peek Freans is the lead sponsor of the film. Other sponsors are Safeguard and McDonald's.[32] EBM will also be introducing various activities around the movie; for instance, film branded packaging for Gluco (biscuit) and a themed web based interactive activity by RIO (biscuit).[33] Head of marketing at EBM, Zulfiqar A. Ansari said \"We are proud to be associated with this project. The movie brings out a powerful message for children, that, each one of them has unique abilities and strengths through which they can make positive contribution to the society and that EBM’s brands communicate as well.\"[14] 3 Bahadur started a promotional campaign on January 19, 2015 by publishing comics every Saturday in DAWN's Young World section. An official website was launched in April 2015 website featuring exclusive content including character sketches, BTS videos, images and weekly comic strips.[34][35]A video game based on the film with same title, developed by Pi Labs in collaboration with Artboard, was released on April 30, 2015 for Android and later for iOS.[36][37][38]","written_by":"Kamran Khan","budget":"₨1.50 crore (US$150,000)"}