{"country":"United States Canada","distributed_by":"Columbia Pictures (Sony Pictures Entertainment)","Plot":"Aboard their boat, a yellow bear and a purple horse look after the baby animals known as the Care Bear Cubs and Care Bear Cousin Cubs[nb 2]. On the way, a red sea serpent threatens them—one of the many forms of Dark Heart, an evil spirit. They escape by following a rainbow up to the sky, while the boat transforms into the Cloud Clipper.[nb 3] There, the Great Wishing Star gives the group their \"tummy symbols\", pictures that indicate each creature's role or specialty. True Heart Bear and Noble Heart Horse, as the characters are named, become founders of the Kingdom of Caring, a land which comprises Care-a-Lot and the Forest of Feelings.For the Bears' first Caring Mission, True Heart and stowaway Swift Heart Rabbit (one of the Cousins) travel to Earth and visit a summer camp. There, they meet three of its participants: a girl named Christy, and her friends, the twins John and Dawn. A boastful boy nicknamed the \"Camp Champ\" always defeats them in competitions, and assigns them to trash duty. Christy is unsatisfied at this; she and her friends run away, only to get lost in the woods. True Heart soon finds John and Dawn, and brings them to the Kingdom of Caring. After they arrive, the children hear a bell toll from the Caring Meter, which tells the Bears how much caring is taking place on Earth. Noble Heart and True Heart tell them to babysit the Cubs, before they leave to search for Dark Heart and Christy.Meanwhile, in the woods, Christy meets Dark Heart (as a human boy) for the first time, and asks him to make her the new Camp Champ. He grants her that wish, telling her she must pay him back with one favor, and heads away while she rejoins her friends. Aware of Dark Heart's potential, True Heart and Noble Heart move the Bear Cubs to Care-a-Lot, and the Cousin Cubs to the Forest of Feelings. Both sets quickly grow up to become the Care Bear Family.Later, while the Bears prepare a party for the Kingdom's founders, Dark Heart enters Care-a-Lot in disguise so that he can capture the whole Family. A cluster of Star Buddies, assistants to the Bears and Great Wishing Star, drives him off; he then morphs into a raging red cloud. The Bears shoot light at him from their bellies, forming their \"Care Bear Stare\"; the Cousins also help by using their \"Care Cousin Call\". Afterward, True Heart and Noble Heart decide to search for him, and leave the Bears to handle missions all by themselves.During their patrol, Wish Bear spots Christy stranded in a canoe within a lake; the other Bears and Cousins set out to rescue her. Dark Heart fires lightning bolts before the team, and captures many of them with his magic bag— the favor he wanted Christy to do all along. The few Family members at hand determine that she has teamed up with him. This prompts Tenderheart Bear to hold a conference at the Hall of Hearts; Friend Bear, Secret Bear and Christy's friends later join them.That night, Dark Heart's influence causes the other children to wreck the camp. The Bears and Cousins search for the Family members, before Dark Heart imprisons them—first in cages, then inside big rubies hanging from a chandelier. Meanwhile, John and Dawn tell Christy of their conviction to rescue the Family from the villain. Feeling guilty, she finally pays him back by admitting what she has done. Despite this, her bargain with Dark Heart is over.True Heart, Noble Heart, John and Dawn enter Dark Heart's lair amid his impending deed; Christy asks him to free the others. While True Heart and Noble Heart enact their Stare, lightning from his cloud strikes Christy, who screams in fear and gets strucked and wounded. With little energy left in her, she crashes down the chandelier with a marble. The Family members, finally free from the rubies, help True Heart and Noble Heart out.At the sight of a dead Christy, Dark Heart becomes remorseful for his actions. He asks the Care Bears to bring her back to life, but is disappointed that their kindness is not even enough. So he, the Family, John and Dawn chant \"We care!\" enough times to bring her back to life. Soon after, the group quickly leaves the cave as it transforms into an outhouse.Dark Heart becomes a real boy, and everyone is overjoyed. After a swim in the lake, the campers say goodbye to the Bears and Cousins; the former Dark Heart promises to be a better person at camp. The film ends with a message from its narrator, the Great Wishing Star, and flashbacks of the Care Bear Family's childhood.","language":"English","Reception":"\"The second movie just made a mockery of the first. I wasn't impressed with it at all.\"The film received mostly negative reviews, in part because of their theory that Care Bears Movie II: A New Generation was part of the franchise's marketing scheme at the time of release. This led The New York Times' Vincent Canby to begin his review by proclaiming, \"Product merchandising marches on.\"[38] Another reviewer claimed to have seen almost every collectible within the film's first twenty minutes.[5] The film was produced to serve as the franchise introduction of the Care Bear Cubs and the Care Bear Cousin Cubs,[22] who also had their own line of toys[44] from Kenner.[75] The plushes, measuring 11\" in height, consisted of Bedtime Cub, Cheer Cub, Funshine Cub and Share Cub; the line of Care Bear Cousin Cubs included Li'l Bright Heart Raccoon, Li'l Proud Heart Cat and Li'l Swift Heart Rabbit.[76] Kenner announced the introduction of the Cubs in 1985, shortly before the film opened,[77] and showcased them at the American International Toy Fair in February 1986.[78]In The Motion Picture Guide 1987 Annual, Jay Robert Nash wrote that its title \"refers to the new featured characters who, more than coincidentally, have ended up on the toy shelves of stores everywhere.\"[79] A critic from the Omaha World-Herald, however, found it misleading and complained that the Cubs \"are not 'a new generation' at all\".[80] Several critics considered the film a prequel to the original: the Omaha World Herald reviewer;[80] Edward Jones of Virginia's The Free Lance-Star;[81] Charles Solomon of the Los Angeles Times;[33] and Bill Cosford of The Miami Herald.[82] According to Michael H. Price of the Fort Worth Star-Telegram, \"Care Bears Movie II is what the film industry calls a 'requel,'[nb 13] tracing the origin of the Care Bear family and relatives of other species.\"[84]In his Animated Movie Guide, animation expert Jerry Beck gave Care Bears Movie II a half-star (½) out of four, and offered this consensus:Unfortunately not many critics cared for the television standard limited animation, bland songs, and blatent [sic] product placement in this film. Strictly for toddlers over age six, [it] tries too hard to cram new characters into the plotline. The characters are obviously introduced to create toy lines.This is the weakest of the Care Bear movies. Avoid at all costs.[12]:48John Stanley expressed his views likewise in his 1988 film guide, Revenge of the Creature Features:[This] inferior sequel [is] rather charmless. This is strictly Saturday Morning at the Cartoons, a blatant commercial for Care Bear toys and related products ... [T]he bulbs are out as far as ideas are concerned.[85]\"Care Bears Movie II is a sort of pre-sequel that, I suspect, requires its audiences to have some prior knowledge of Care Bears,\" Vincent Canby said in his New York Times review. \"Very young kids may love this, but anybody over the age of 4 might find it too spooky.\"[38] Hal Lipper of the St. Petersburg Times remarked that it \"is an enormously engaging cartoon—quite a feat when you consider the saccharine psychobabble passing for dialogue\".[34] The Miami Herald's Bill Cosford gave it two and a half stars out of four,[82] the same rating he had applied to its predecessor.[86] Edward Jones commented that \"The animation can't compare with the best of Disney. Take a look at Sleeping Beauty [...] and you'll see the difference.\"[81] Likewise, Italian critic Paolo Mereghetti complained, \"[This is an] ugly sequel with awkward animation, and not even the small fry will find it fun.\"[62]Charles Solomon said, \"The new Care Bears film...is even more sloppily made and hawks its goods even more shamelessly. [...] The film makers seem more concerned with showcasing the toys than providing entertainment; shared profits obviously count for more than shared feelings. If someone started selling 'Hate Bears,' there undoubtedly would be a film about them.\"[33] Gene Siskel awarded the film zero stars out of four [87] (along with \"Thumbs Down\" on At the Movies—the Siskel & Ebert TV show having not been introduced yet[nb 14]), while Leonard Maltin gave it a \"BOMB\" rating in his Movie Guide, and added: \"Your kids deserve better entertainment than this treacly stuff about the Kingdom of Caring. Prefab animation from the era of toy merchandising tie-ins.\"[88] The Gale Group publication, VideoHound's Golden Movie Retriever, gave it one bone out of four in its 1992 edition,[89] but revised it to two later on.[90][nb 15] In 2001, the Los Angeles-based Hastings Bad Cinema Society picked A New Generation as one of The 100 Worst Movies of the 20th Century. \"Even suffering through a Barney video would be preferable to sitting through this,\" said compiler Michael Lancaster.[92]The film received some positive reviews, however. Writing for The Advocate of Baton Rouge, Louisiana, Norma Dyess Michaud deemed it \"a must-see for preschoolers, especially those who are in the throes of the current Care Bear mania\".[93] Richard Martin praised the script and climax, along with the performances of the orphan Cubs. \"Their pastel, birthday-cake-and-whipped-cream world has never looked sweeter,\" he stated.[52] The Philadelphia Daily News commented that it was \"even better than the first one, which was good\".[23]Care Bears Movie II was released on VHS and Betamax[94] by RCA/Columbia Pictures Home Video on August 21, 1986,[95] and debuted in 12th place on Billboard's Top Kid Video Sales chart on September 27 that same year.[96] The film aired during 1987 on the Disney Channel, a premium television station,[97] and was broadcast in later years on CBS,[98] HBO,[99] Showtime[100] and The Movie Channel.[101] It returned on VHS as part of the Columbia TriStar Family Collection on August 13, 1996.[102] Columbia TriStar Home Entertainment premiered it on DVD on April 8, 2003;[103] the only special features in this edition were trailers for several of the company's family-oriented titles.[104] This was the last animated feature to be released by Columbia Pictures until Final Fantasy: The Spirits Within in 2001.[12]:xv–xx","box_office":"North America: US$8,540,346 (adjusted by inflation$:18436673)[3] Worldwide: US$12,000,000 (adjusted by inflation$:25905282)[4]","production_company":"LBS Communications Nelvana Limited","directed_by":"Dale Schott","care_bears_movie_ii:_a_new_generation":"Theatrical release poster","release_dates":"North America: March 7, 1986 (limited)[1] March 21, 1986 (wide)[1][nb 1]","Production":"The Care Bears franchise was created in 1981[11] by Those Characters from Cleveland, a division of the greeting card company American Greetings.[12]:47–48 Early in their tenure, the characters appeared as toys from the Kenner company,[13] and also in greeting cards by Elena Kucharik.[14] They starred in two syndicated television specials from a Canadian animation studio, Atkinson Film-Arts of Ottawa: The Care Bears in the Land Without Feelings (1983)[15]:58–60 and The Care Bears Battle the Freeze Machine (1984).[15]:57–58 After the specials, Toronto's Nelvana studio produced the first Care Bears Movie in less than eight months.[16] It was distributed in the United States by The Samuel Goldwyn Company, an independent outfit, and grossed US$22.9 million at the North American box-office,[17] the largest amount for a non-Disney animated film at the time.[16] This success guaranteed production of a second film,[18] which was in consideration by May 1985.[19] As with the original, production took place at Nelvana's facilities[20] and Taiwan's Wang Film Productions;[21] the Canadian studio also hired South Korean personnel to handle inking and painting.[22] This time, over one hundred Nelvana animators worked on the film over a seven-month period[20] that lasted until February 1986;[10] the company itself received credit for the story development.[18][23] American Greetings and Kenner commissioned Nelvana to make the sequel[22] on contract;[24] television syndicator LBS Communications, a co-financier of the first one,[25] became the producer and presenter.[26]Care Bears Movie II was Nelvana's third animated feature film, after 1983's Rock & Rule and The Care Bears Movie.[27] It marked the directorial debut of Dale Schott, a Nelvana staff member who served as assistant director on the first Care Bears Movie, as well as the Nelvana/Lucasfilm TV series Ewoks.[12]:47–48 Several other crewmembers from the first film returned to the fold; Nelvana's founders (Michael Hirsh, Patrick Loubert and Clive A. Smith) served as producers, while Peter Sauder wrote the screenplay[28] and Charles Bonifacio handled animation duties.[29]:341 Jack Chojnacki, the co-president of American Greetings' licensing division Those Characters from Cleveland,[30] served once again as an executive producer.[7] A roster of Toronto voice actors—among them Cree Summer, Sunny Besen Thrasher, Dan Hennessey and Hadley Kay—appeared in this follow-up.[20] Mickey Rooney and Georgia Engel, who appeared in the first film, did not return.[20][31]At one point, The Samuel Goldwyn Company was about to release A New Generation, but lost the distribution rights after turning down demands from the producers.[32] Eventually, Nelvana went into negotiations with the Hollywood studio Columbia Pictures, which acquired worldwide theatrical rights in early 1986.[26][32][nb 5] This led founder Samuel Goldwyn, Jr. to remark: \"The fact that Columbia is distributing the Care Bears sequel is typical of the greed of the big studios. Someone else has to go in and prove something works, then a studio will charge in.\"[32] By contrast, Goldwyn acquired the rights to the original film after major U.S. studios passed on it; they did not see the financial potential in a movie aimed strictly for children.[25]According to Richard Freedman of the Newhouse News Service, \"This must be the first version of the Faust myth in which not only does Faust (or Faustina [Christy], here) manage to weasel out of the pact with the Devil, but succeeds in regenerating him, as well.\"[36] Elliot Krieger of Rhode Island's Providence Journal also took note of such a theme, headlining his review \"Faust goes to summer camp\".[37] In regards to continuity issues, a reviewer in The Scarecrow Movie Guide observed a \"montage showing the Care Bears and their Cousins growing up together from infancy to full Care Bear maturation—nullifying everything that happened in the first movie\".[35][nb 6][nb 7] Mike McLane of Florida's Gainesville Sun gave a few suggestions of the storyline's possible religious subtext. He compared the Great Wishing Star to God, the Bears' \"beautiful cloud kingdom\" of Care-a-Lot to Heaven, and Dark Heart to Satan; he also hinted that the Bears protected humankind like angels did.[6]Charles Solomon pointed out that the film's climax, in which the Bears help revive Christy, \"borrows...flagrantly from Peter Pan\".[33] The Scarecrow contributor took note of this aspect, writing, \"There's an excruciating scene where the Care Bears turn to the audience and plead for help in the form of excessive and focused caring.\"[35] In his critique, Hal Lipper called it the \"Tinker Bell Principle\", whereupon the audience must come together to save a dying character.[34] In Vincent Canby's opinion, the Great Wishing Star \"looks like Tinker Bell if she were a star-shaped beanbag\".[38]As with the original film,[40] Patricia Cullen composed the score for Care Bears Movie II.[38] The soundtrack album was released in LP format by Kid Stuff Records.[41] Los Angeles musicians Dean and Carol Parks were credited as producers, writers and performers of the film's six songs,[7] which were included on the album.[41] Stephen Bishop, performer of the Oscar-nominated \"It Might Be You\" from Tootsie, and Debbie Allen from the TV series Fame, were on hand as vocalists.[28] John Braden arranged and edited the album.[39]The Parks recorded their contributions to the project at their home.[28] At the time of production, they shared their experiences of working on the soundtrack:Our children helped us tremendously with their feedback as real Care Bear fans. When we took on this project, we made up our mind not to write down to children. There's a huge library of over-simplistic music available to children, but kids love music and they have very sophisticated tastes. When Debbie came over to the house to record 'Care Bears Cheer Song,' she brought her baby and nanny and manager and everyone had a great time.[28]The songs are particularly important because they forward the movement and reflect the action and feelings of the story. We try to make it so that everyone can relate to the music.[28]Paul Attanasio of The Washington Post gave a mixed response to the film's music. \"The songs are dopey,\" he said, \"but the score [...], which is mostly seven kinds of sprightly, has its occasional moments.\"[42] Vincent Canby wrote in his review, \"[There are] unseen loudspeakers [that] pour out a nonstop Hit Parade of songs to be interred by, including 'I Care for You,' 'Our Beginning' and 'Forever Young.'\"[38] But Joe Fox of The Windsor Star recommended it, adding, \"[W]henever things start to drag a snappy tune comes along to get everyone interested.\"[43]","produced_by":"Michael Hirsh|Patrick Loubert|Clive A. Smith|","starring":"Maxine Miller|Pam Hyatt|Cree Summer|Hadley Kay|Alyson Court|Billie Mae Richards|Chris Wiggins|","running_time":"76 minutes","Sequel":"In 1987, Nelvana followed A New Generation with The Care Bears Adventure in Wonderland or The Care Bears Movie. In this third film, the Bears and Cousins travel to Wonderland and save its Princess from a wizard; Alice, a girl from the real world, takes her place.[105] Self-financed by Nelvana[4] and released by Cineplex Odeon Films, it was the last Care Bears movie of the 1980s to go into theatres.[106] It grossed US$2.6 million in the North American market,[107] and US$6 million worldwide by February 1988.[4] The Bears would not appear in another feature production until 2004's direct-to-video effort, Care Bears: Journey to Joke-a-lot.[108]","music_by":"Patricia Cullen","edited_by":"Evan Landis","Release":"Initially intended for a mid-year release,[45] Care Bears Movie II opened on March 7, 1986, in the U.S. and Canada,[1][46] grossing US$243,161 from 55 theatres,[46] and US$449,649 by its first few days.[47] At this stage, it managed to rank above a reissue of Disney's 1959 production Sleeping Beauty, which also premiered that same weekend.[48] However, when the final weekend box office results were announced Sleeping Beauty outgrossed Care Bears II by $59,000.[49] Its wide-release opening on March 21 brought in $2.5 million from 1,446 theatres, placing seventh on the box office chart.[49] Over the next two weekends it earned little more than $1 million in 12th place.[50][51] During release, it faced competition from another toy-based film, Atlantic Releasing's GoBots: Battle of the Rock Lords.[47] At the time A New Generation opened, Richard Martin of the Ottawa Citizen commented: \"... The first Care Bears movie has become the most successful non-Disney animated feature ever. This second movie from Nelvana could very well surpass that record, since it held the attention of all but the youngest members of the first-night audience and even has something to offer adults.\"[52] Ultimately, this installment earned US$8,540,346[nb 9] in North America—about a third of what the previous one earned;[3][17] over US$1 million of this total came from Canada.[54] By 1988, it made over US$12 million worldwide.[4][nb 10]Care Bears Movie II made its debut in the United Kingdom, via Columbia-EMI-Warner Distributors,[55] on July 25, 1986;[56][57] it later appeared on home video in that country under the RCA/Columbia Pictures and Video Collection International labels.[55] Warner-Columbia Film of France[58] released it on April 8, 1987[59] as Les Bisounours II—Une nouvelle génération;[60] publishing rights were held by Hachette Livre.[59] It was released in the Netherlands on April 9, 1987, as De Troetelbeertjes Deel 2: Nieuwe Avonturen Van De Troetelbeertjes.[61] The film is also known as Gli orsetti del cuore II in Italy,[62] and Krambjörnarna: på nya äventyr in Sweden.[63]The Warner-Columbia branch in West Germany released it under the title Glücks-Bärchis, Teil 2—Jetzt im Abenteuerland (Care Bears lucky, Part 2 Now in Adventureland)[64] on December 11, 1986.[65] It sold 174,550 tickets and ranked 84th place among the year's releases in that market (excluding re-issues),[66] grossing approximately €665,000 (the equivalent of DM1,300,000, or US$824,000).[66][67][nb 11] By comparison, Filmwelt's release of the first film that same year placed 47th with 538,487 tickets.[68][nb 12] On October 13, 1987, RCA/Columbia Pictures released the local version of Care Bears Movie II on video.[65]The film was released in Mexico on December 25, 1986, as Los Ositos Cariñositos II,[69] and in April 1987 in the Philippines.[70] By the early 1990s, it was marketed as Ursinhos Carinhosos II in Brazil.[71] In China, it is known under the title of Baby Love Bears (Chinese: 爱心熊宝宝; pinyin: Àixīn xióng bǎobǎo).[72] In the Russia movie was distributed under several names, such as Wonder Bears: The New Generation (Russian: Чудо-мишки. Новое поколение), in a more corresponding translation to the original (Russian: Заботливые Мишки 2: Новое поколение)[73] and other.","written_by":"Peter Sauder"}