{"country":"United States Austria Switzerland","Inspiration":"The story of Jesse and Céline was inspired by an evening that Richard Linklater spent with a young woman named Amy Lehrhaupt, whom he met during a day he spent in Philadelphia traveling from New York to Austin.[14] Not until 2010 was Linklater informed that Lehrhaupt had actually died in a motorcycle accident prior to the release of Before Sunrise.","distributed_by":"Columbia Pictures","Plot":"The film starts on June 16, 1994 with Jesse meeting Céline on a train from Budapest and striking up a conversation with her. Jesse is going to Vienna to catch a flight back to the United States, whereas Céline is returning to university in Paris after visiting her grandmother. When they reach Vienna, Jesse convinces Céline to disembark with him, saying that 10 or 20 years down the road, she might not be happy with her marriage and might wonder how her life would have been different if she had picked another guy, and this is a chance to realize that he himself is not that different from the rest; in his words, he is \"the same boring, unmotivated guy.\" Jesse has to catch a flight early in the morning and does not have enough money to rent a room for the night, so they decide to roam around in Vienna.After visiting a few landmarks in Vienna, they share a kiss at the top of the Wiener Riesenrad at sunset and start to feel a romantic connection. As they continue to roam around the city, they begin to talk more openly with each other, with conversations ranging from topics about love, life, religion, and their observations of the city. Céline tells Jesse that her last boyfriend broke up with her six months ago, claiming that she \"loved him too much\". When questioned, Jesse reveals he had initially come to Europe to spend time with his girlfriend who was studying in Madrid, but they had broken up when she was avoiding him while he was there. He decided to take a cheap flight home, via Vienna, but it did not leave for two weeks so he bought a Eurail pass and traveled around Europe.When they are walking alongside the Donaukanal (Danube canal) they are approached by a man who, instead of begging, offers to write them a poem with a word of their choice in it. Jesse and Céline decide on the word \"milkshake\", and are soon presented with the poem Delusion Angel (written for the film by the poet David Jewell). In a traditional Viennese café, Jesse and Céline stage fake phone conversations with each other, playing each other's friends they pretend to call. Céline reveals that she was ready to get off the train with Jesse before he convinced her. Jesse reveals that after he broke up with his girlfriend, he bought a flight that really was not much cheaper, and all he really wanted was an escape from his life.They admit their attraction to each other and how the night has made them feel, though they understand that they probably will not see each other again when they leave. They simply decide to make the best of what time they have left, ending the night with the implication of a sexual encounter between them. At that point, Jesse explains that if given the choice, he would marry her instead of never seeing her again. The film ends the next day at the train station, where, just as Céline's train is about to leave, the couple decides not to exchange any contact information but instead to meet at the same place in six months.","language":"English German French","Themes":"Before Sunrise revolves largely around the twin themes of self-fulfillment and self-discovery through a significant other, charging the concept through the introduction of a twelve-hour time constraint in which the goals implicit to the two themes have to be realized. They are underlined by the poem \"Delusion Angel\", which evokes a longing for complete and unifying, possibly even redeeming, understanding between two partners in a world which is itself unknowable, and over which one can exercise no control.An important role is played by the theme of spontaneous and uninhibited response to one's environment. It is reflected by the actions of Jesse and Céline, whose joint stream of consciousness, initiated by a previously unmeditated decision to leave the train together, allows them to temporarily detach themselves from the world, and enter a realm where only the other's company is of importance. It is worth noting that when the morning arrives Jesse remarks that he and Céline have again entered \"real time\".[10]It could be argued that Before Sunrise subsumes its main themes under that of life. In one scene, Céline and Jesse visit the Friedhof der Namenlosen, the Cemetery of the Nameless in Simmering. The people buried in the cemetery have found anonymity in death; by learning to know and understand one another, Céline and Jesse experience and embrace life, suspending their own mortality.[11]The film leaves audience members to decide for themselves whether Jesse and Céline will actually meet again in six months. Critic Robin Wood has written that after he published an essay on the film (in a 1996 issue of CineAction), Linklater wrote him to say that \"neither he nor the two actors ever doubted that the date would be kept.\"[12]The film takes place on June 16, Bloomsday.[13]","box_office":"$5,535,405[3]","cinematography":"Lee Daniel","production_company":"Castle Rock Entertainment","before_sunrise":"Theatrical release poster","directed_by":"Richard Linklater","release_dates":"January 27, 1995 (1995-01-27)|||||","Production":"Before Sunrise was inspired by a woman whom writer/director Richard Linklater met in a toy shop in Philadelphia in 1989.[4] They walked around the city together, conversing deep into the night. Originally, in the screenplay, who the two people were and the city they spend time in was vague. Linklater realized that because the film is so much a dialogue between a man and a woman, it was important to have a strong woman co-writer. He chose Kim Krizan, who had small roles in his two previous films Slacker and Dazed and Confused.[4] According to Linklater, he \"loved the way her mind worked – a constant stream of confident and intelligent ideas\".[5]Linklater and Krizan talked about the concept of the film and the characters for a long time.[5] He wanted to explore the \"relationship side of life and discover two people who had complete anonymity and try to find out who they really were\".[6] He decided to put Jesse and Céline in a foreign country because \"when you're traveling, you're much more open to experiences outside your usual realm\".[6] He and Krizan worked on an outline. They wrote the actual screenplay in 11 days.[5]Linklater spent nine months casting the film because he saw so many people but had trouble finding the right actors for the roles of Jesse and Céline.[7] When Linklater first considered casting Hawke, he thought that the actor was too young for the part.[8] Linklater saw Hawke at a play in New York City and reconsidered after talking to the actor. For Céline, Linklater met Julie Delpy and liked her personality. After they did a final reading, Linklater knew that Delpy and Hawke were right for the roles.[8] Once Delpy and Hawke agreed to do the film, they went to Austin and talked with Linklater and Krizan for a few days.[5] In 2016, Delpy told Creative Screenwriting, \"Ethan and I basically re-wrote all of it. There was an original screenplay, but it wasn’t very romantic, believe it or not. It was just a lot of talking, rather than romance. Richard hired us because he knew we were writing and he wanted us to bring that romance to the film. We brought those romantic ideas and that’s how I wrote something that actually got made, without really getting credit for it. But, if I had written Before Sunrise and been credited, then I doubt it would have been financed.\".[9] Though Delpy and Hawke were not credited with writing this film, they received credit for co-writing the sequels.","produced_by":"Anne Walker-McBay","starring":"Ethan Hawke Julie Delpy","running_time":"101 minutes[2]","Sequels":"Before Sunset was released in 2004 with Linklater, Hawke, and Delpy to equally positive reviews, with the review-gathering site Rotten Tomatoes logging a 95% \"Fresh\" rating.[28] A second sequel, Before Midnight, was released in 2013, again to rave reviews.Jesse and Céline also had a very short scene together in Linklater's 2001 animated film, Waking Life. In this scene, the two are together in bed talking, though since the film is all about lucid dreaming, and from the plot points established in Before Sunset, the thought is that this scene never existed in reality.","music_by":"Fred Frith[1]","edited_by":"Sandra Adair","Release":"Before Sunrise had its world premiere at the 1995 Sundance Film Festival.[4] It was released in the United States on January 27, 1995.The film was entered into the 45th Berlin International Film Festival where Linklater won the Silver Bear for Best Director.[15]The film received high critical praise at the time of its release and currently has a rare 100% rating on Rotten Tomatoes and a 77 metascore on Metacritic. Film critic Roger Ebert gave Before Sunrise three out of four stars and described Julie Delpy as \"ravishingly beautiful and, more important, warm and matter-of-fact, speaking English so well the screenplay has to explain it (she spent some time in the States)\".[16] In her review for The New York Times, Janet Maslin wrote, \"Before Sunrise is as uneven as any marathon conversation might be, combining colorful, disarming insights with periodic lulls. The film maker clearly wants things this way, with both these young characters trying on ideas and attitudes as if they were new clothes\".[17] Hal Hinson, in his review for The Washington Post wrote, \"Before Sunrise is not a big movie, or one with big ideas, but it is a cut above the banal twentysomething love stories you usually see at the movies. This one, at least, treats young people as real people\".[18]In his review for the Los Angeles Times, Peter Rainer wrote, \"It's an attempt to make a mainstream youth movie with a bit more feeling and mysteriousness than most, and, in this, it succeeds\".[19] Marjorie Baumgarten, in her review for The Austin Chronicle, wrote, \"Before Sunrise represents a maturation of Linklater's work in terms of its themes and choice of characters\".[20] In his review for The New Yorker, Anthony Lane wrote, \"Just once, for a single day, Jesse and Céline have given life the sort of shape and charge that until now they have found only in fiction, and may never find again\".[21] Entertainment Weekly gave the film an \"A-\" rating and Owen Gleiberman wrote, \"Small movies can be as daring as big ones, and Linklater, in his offhand way, is working without a net here. Before Sunrise may be the closest an American has come to the discursive talk gamesmanship of Eric Rohmer\".[22]Online film critic James Berardinelli has cited the film as \"the best romance of all time\".[23] Entertainment Weekly rated Before Sunrise #25 on their Top 25 Modern Romances list.[24] In a 2008 Empire poll, Before Sunrise was ranked as the 200th greatest movie of all time.[25] In 2010 British newspaper The Guardian ranked Before Sunrise/Before Sunset #3 on their critics' list of 25 best romantic films of all time, and #2 in an online readers' poll.[26][27]The film grossed $1.4 million in 363 theaters on its opening weekend, and went on to make $5.5 million, more than double its $2.5 million budget.[3]","written_by":"Richard Linklater Kim Krizan","budget":"$2.5 million[3]"}