{"Plot":"The film opens with a Star Wars style text scroll, which tells the main situation: In year 80 AM Anno Mickey Mouse, the mice of Planet X are threatened by humiliation and total apocalypse. The well-organized, fully equipped gangs of evil cats are aiming to wipe out the mouse civilization totally, not caring for the old conventions between mice and cats. But in the last moment, when the mouse leaders are beginning to consider leaving the planet, a new hope rises...The film is a parody of several famous feature films, mainly the James Bond series. The main plot is about a special spy who is sent to the city of \"Pokyo\" to get the secret plan of a machine which could save the mouse civilization. Of course, the cats don't want this to happen, and send some rat gangsters to stop him, who don't always prove as efficient as their presentation showed.","language":"Hungarian","cinematography":"Mária Neményi Csaba Nagy György Varga","In the USSR":"In the Soviet Union this cartoon enjoyed a big success in the box office in 1988 and got a truly cult status among kids after being shown multiple times on TV, dubbed in Russian by Soyuzmultfilm studio. The Russian title is \"Ловушка для кошек (Lovushka dlia koshek)\" (literally: Cat Trap). In spite of the Russian version being completely dubbed, the songs were left in their original Hungarian version with brief voiceover translations of the first few lines.","directed_by":"Béla Ternovszky","In the USA":"In United States and Canada the movie was distributed on VHS by Sefel Pictures in 1987 under the name Cat City. The names of almost all characters were changed to avoid any associations with countries of Socialist bloc. The songs were recorded also in different arrangement, and the song of \"Four Gangsters\" (which was written to Jimmy Giuffre's Four Brothers melody) was replaced completely.","release_dates":"2 October 1986 (1986-10-02)|||||","produced_by":"Kunz Román","starring":"László Sinkó Miklós Benedek Péter Haumann","running_time":"92 minutes","music_by":"Tamás Deák Jimmy Giuffre","Sequel: Cat City 2: The Cat of Satan":"The movie was made on a limited budget of about 3 million USD, with the characters drawn and animated by hand, while objects and backgrounds were derived from 3D models and computer simulation. The visual world of the movie is said to be influenced by the first Matrix trilogy movie and Sin City, but softened for a younger audience. The former working title of Cat City 2 was retained as the final subtitle: \"Cat of Satan\", which would be translated literally as \"The Tabby of the Baskervilles\" if translated into English in its original context. The project was led by the original Nepp and Ternovszky duo, who directed the first film.The story of Cat City 2 centers around an investigative journalist named Stanley Mouse, who wants to find out about the legend of an ancient \"cat tribe\" lost in Africa. He finds them and much more, once again threatening the continued existence of mouse civilization. Special Agent Grabowsky will act to save the day, however. The events are supposed to take place at least 10, possibly 20 years after the first episode, as one of the already leaked cells shows the titular Cat-Catcher mecha rusting away in a shelter.Premiering on December 20, 2007, by January 2008 it had made the Hungarian Box Office Top Ten for 6 consecutive weeks, topping the chart at 6th place. International release was restricted to DVD due to a lack of distribution partners.","edited_by":"Magda Hap","written_by":"József Nepp"}