{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"In mid-December 1944 Pvt. Jim Layton (Marshall Thompson) and his buddy Pvt. William J. Hooper (Scotty Beckett) are fresh replacements assigned to separate companies in the 327th Glider Infantry Regiment, 101st Airborne Division. As a newcomer Layton receives a chilly welcome from his squad. PFC Holley (Van Johnson) returns to the company after recuperating from a wound sustained from fighting in Holland.Instead of going on leave in Paris, the squad is trucked back to the front to help stop a surprise German breakthrough in the Ardennes. They stop that night in the town of Bastogne. The platoon is put up for the night in the apartment of a local young woman, Denise (Denise Darcel), with whom Holley hopes to fraternize. Jarvess (John Hodiak) is informed by Denise that she is taking care of two orphaned French girls. Jarvess later goes on guard in the village, where he runs into a group of battle weary soldiers. The soldiers inform Jarvess that they are making a \"strategic withdrawal\". The next morning, led by Platoon Sgt. Kinnie (James Whitmore), the men are ordered to dig in on the outskirts of town. Just as they are nearly done, they are ordered to a new location and have to dig in again.Holley, Layton and Kippton (Douglas Fowley) stand guard that night at a roadblock. A patrol of German soldiers, disguised as American G.I.s, infiltrates their position and later blows up a nearby bridge. In the morning the squad awakes to a heavy winter storm. Roderigues (Ricardo Montalbán), a Latino from Los Angeles, is delighted by the novelty of snow, but his foxhole mate Pop Stazak (George Murphy), awaiting a \"dependency discharge\" that will send him home, is unimpressed. Layton goes over to see his friend Hooper, only to find that he had been killed hours before, and that no one in his company knew his name.Kinnie informs the squad about the infiltration and sends out a patrol—Holley, Roderigues and Jarvess to move through the woods. Just before they start out, the platoon is shelled by German artillery, causing Bettis (Richard Jaeckel) to panic and desert. During the barrage Layton reminds his squad leader, Sgt. Wolowicz (Bruce Cowling), of his name and finds for the first time that he has been accepted as a part of the squad. Holley's patrol briefly skirmishes with the infiltrators. Roderigues is wounded by machine-gun fire from an enemy tank. He is unable to walk, so Holley hastily conceals him under a disabled jeep half-buried in snow, promising to return for him. Unfortunately, by the time they can get back to him, Roderigues has died due to the exposure of the elements (freezing to death).Wolowicz, who has been wounded by shellfire, and a sick Cpl. Standiferd (Don Taylor) are sent back to a field hospital. Not too long after, Doc (Thomas E. Breen) informs the 3rd Squad that the field hospital had been captured. Holley is appointed the new squad leader, and partnered with Layton, while Pop Stazak is paired with Hansan (Herbert Anderson). When Pop's discharge comes in they find out from Kippton that the 101st is surrounded forcing Pop to stay with the men.Moved again and again, 3rd Platoon is attacked at dawn. Garby (James Arness) is killed by machine gun fire. Hansan demonstrates bravery by crawling out of his foxhole and being the first to fire on the Germans. Just when it appears that the platoon will be overrun, Hansan is wounded and Holley loses his nerve and runs away. Layton follows Holley. Ashamed of his cowardice, Holley leads a flanking counterattack that defeats the German attack. The platoon leader, Lt. Teiss (Brett King), announces that he will recommend Hansan for a Silver Star. Jarvess's foxhole partner, country boy Abner Spudler (Jerome Courtland), is killed while trying to put on his wet boots.After they get Hanson to the aid station, the squad runs into Bettis, who is doing K.P. duty in the rear and gives them a hot meal. Holley discovers that Layton is a quick learner, finding him being entertained by Denise. Later, while on guard duty, they encounter a party of Germans who have come under a flag of truce to offer Brig. Gen. McAuliffe surrender terms, resulting in his famous reply of \"Nuts!\" to the puzzled Germans.[4]In the bitter, foggy weather, the squad is short of supplies – supply transport aircraft are grounded. Several men attend impromptu outdoor Christmas services held by a chaplain (Leon Ames). That night the Luftwaffe bombs Bastogne. Denise is killed. Bettis, slowed by his fear of going back to the lines, is killed by a collapsing house. The \"walking wounded\", including Hansan and an unknowledgeable mess sergeant (George Chandler), are recalled up to duty for a last-ditch defense of the town.As the platoon is down to its last few rounds of ammunition, the weather clears, allowing the Allied fighters to attack the Germans and C-47 transports to drop supplies, enabling the 101st to hold. Afterward, the siege lifted, Lt. Teiss receives a battlefield commission. Kinnie leads the survivors of the platoon toward the rear for a well-earned rest. As they move out, they spot a relief column of clean, well-equipped soldiers marching toward Bastogne. Kinnie begins calling \"Jody cadence\" and the veterans pull themselves together, proudly chanting the refrain as they pass the other GIs.","language":"English","box_office":"$6,269,000[1]","cinematography":"Paul Vogel","directed_by":"William Wellman","Response":"Battleground was MGM's largest grossing film in five years.[6] According to studio records it earned $4,722,000 in the US and Canada and $1,547,000 elsewhere resulting in a profit of $2,388,000, making it the studio's most profitable picture of the year.[1] It was rated by Photoplay as the best picture of the year.[6]MGM released a similar film in 1951, Go for Broke!, also starring Van Johnson and directed by Pirosh.[6]","Accuracy":"Although the film is a fictionalized version of the siege of Bastogne, it is highly accurate with one major exception. There were no Germans disguised as Americans around Bastogne. Operation Greif, as it was known, only operated in front of the 6th SS Panzer Army, many miles to the north.A minor inaccuracy is that, at the time of the Battle of Bastogne, the 327th Glider Infantry Regiment did not have an Item Company. When the airborne divisions were conceived early in World War II, the Army's senior commanders decided that the glider regiments would have only two battalions each. The first battalion would be made up of Able, Baker, Charlie, and Dog Companies, while the second would have Easy, Fox, George, and How Companies. When by 1944 it became evident that these two-battalion regiments were not suited to combat operations, certain glider regiments were broken up and their battalions attached to others. The 327th was assigned the First Battalion of the 401st Glider Infantry Regiment, getting \"doubles\" on Able, Baker, Charlie, and Dog Companies. Thus \"the 2nd Squad, 3rd Platoon of Item Company, 327th Glider Infantry Regiment, 101st Airborne Division,\" did not exist at the time of the Ardennes campaign. The producers did not want to have someone complain that he was in Item Company during the fighting around Bastogne, and that no such thing happened.[citation needed]","Awards and honors":"Battleground won two Academy Awards: for Best Cinematography, Black-and-White (Paul C. Vogel) and for Best Writing, Story and Screenplay (Robert Pirosh). It was also nominated for Best Picture, Best Director (William A. Wellman), Best Film Editing (John D. Dunning), and Best Actor in a Supporting Role (James Whitmore). James Whitmore won a 1950 Golden Globe Award as Best Supporting Actor, and Robert Pirosh's script won Best Screenplay. Pirosh was also nominated for a Writers Guild Award for Best Written American Drama.[11]","release_dates":"November 9, 1949","Production":"Battleground was originally an RKO property, which was called \"Prelude to Love\" to hide its subject matter,[5] but was shelved when production head Dore Schary resigned, despite $100,000 having been put into the property to that point. When Schary went to MGM, he purchased the rights to the script from RKO, over the objections of Louis B. Mayer, who believed that the public was tired of war films. At MGM, Robert Taylor and Keenan Wynn were reported to be penciled in for the film, along with Van Johnson and John Hodiak, and the project was budgeted at $2 million.[6] Wellman put the cast through some military training with Robert Taylor, a former navy officer dropping out for not feeling the role was right for him. He was replaced by Van Johnson.[7]Robert Pirosh had based the script on his own experiences during the Battle of the Bulge,[8] although he did not serve with the 101st Airborne. Many of the incidents in the film were based on actual events, including the rejection of a German demand for surrender on December 22, 1944, with the one word response \"Nuts!\" by Brig. Gen. Anthony McAuliffe.[9] Twenty veterans of the 101st were hired to train the actors and appeared in the film as extras. Lt Col Harry Kinnard, who had been the 101st's deputy divisional commander at Bastogne, was the film's technical advisor.The film was in production from April 5 to June 3, 1949,[10] with location shooting in northern California, Oregon and Washington state. Fort Lewis, Washington was used for the tank sequence showing the relief of the 101st Airborne by Patton's Third Army. Shooting took 20 days less than was scheduled, due in part to innovative measures taken by Schary such as processing film as it was shot, then dubbing and cutting it so that scenes could be previewed within two days of being shot.[6] The film came in almost $100,000 under budget.[5]Battleground received a number of premieres before its general release. A private showing for President Harry S. Truman was arranged[5] even before the premiere in Washington D.C. on November 9, 1949, which was attended[6] by McAuliffe, who commanded the 101st during the siege. Two days later, the film premiered in New York City, and then on December 1 in Los Angeles. The film's general American release was on January 20, 1950.","produced_by":"Dore Schary Robert Pirosh","starring":"Van Johnson John Hodiak Ricardo Montalbán George Murphy","running_time":"118 minutes","battleground":"Theatrical poster","music_by":"Lennie Hayton","External links":"","edited_by":"John D. Dunning","written_by":"Robert Pirosh","budget":"$1,631,000[1][2]"}