{"country":"Sweden","distributed_by":"New World Pictures","Plot":"Cries and Whispers takes place in a lavish mansion in the 19th century, filled with red carpets and white statuary. It depicts the final days of Agnes (Harriet Andersson), who is near death due to cancer. Her sisters Maria (Liv Ullmann) and Karin (Ingrid Thulin) have returned to the family home to be with her. However the two women remain distant and awkward, struggling to comfort their sister while dealing with the shock and the fear of mortality Agnes' death may bring. The deeply religious maid Anna (Kari Sylwan), whose own daughter died at an early age, is the only person in the house able to comfort the dying woman. At length Agnes dies and during her wake the priest (Anders Ek) declares Agnes' faith was stronger than his own. In a dream-like sequence that follows Agnes seemingly returns to life for a short moment and asks her sisters one last time for the love and care denied her during her lifetime. For a moment Karin, Maria and Agnes grow closer to each other, but this is short-lived when the two sisters realize that Agnes is actually dead, with Karin declaring such acts \"morbid\" and \"disgusting.\" Once again only Anna is able to embrace and comfort Agnes.The film is characterized by flashbacks that visit the characters' lives and their memories, tracing each woman's personality to the childhood they spent together. Maria remembers her affair with a handsome doctor juxtaposed with her failed marriage to her ineffectual husband; Agnes remembers her unrequited devotion to their distant mother; and Karin struggles with self-harm, self-mutilating her sexual organs to drive her husband away. The last flashback, from the deceased Agnes' point of view, is narrated via her diary and shows her sisters descending upon the house clad in white, like angels. The last words are Agnes whispering, \"Come what may, this is happiness. I cannot wish for anything better. Now, for a few minutes, I can experience perfection. And I feel profoundly grateful to my life, which gives me so much...\"","language":"Swedish","Reception":"Cries and Whispers was extremely well received by critics. The New York Times' Vincent Canby called it a \"magnificent, moving, and very mysterious new film\".[7] Writing about the film in his series on \"Great Movies\", film critic Roger Ebert says, \"To see it is to touch the extremes of human feeling. It is so personal, so penetrating of privacy, we almost want to look away.\"[5] François Truffaut made a theatrical comparison, saying that it \"begins like Chekhov's Three Sisters and ends like The Cherry Orchard and in between it's more like Strindberg\".[2]US rights were bought by Roger Corman at New World Pictures who paid Bergman $75,000 for it and made $1 million in profit. Corman claimed it was Bergman's biggest success in America.[1]Cries and Whispers was shown out of competition at the 1973 Cannes Film Festival, where Bergman received an overwhelming emotional response by the audience.[3] and where it won the Vulcain Prize of the Technical Artist.[8] To qualify for the 46th Academy Awards, the film was rushed to a premiere in Los Angeles County, preceding by a few months the official Swedish premiere.[3] There; it was nominated for five awards: Best Director, Best Original Screenplay, Best Cinematography, Best Costume Design (for Marik Vos), and Best Picture.[9] In the end Sven Nykvist won the cinematography award for his work as director of photography.[10]Cries and Whispers was nominated and won several other awards on festivals and from critics' associations. At the 27th British Academy Film Awards Sven Nykvist was nominated for Best Cinematography and Ingrid Thulin for Best Supporting Actress,[11] at the 30th Golden Globe Awards the film was nominated for Best Foreign Language Film.[12] and at the David di Donatello ceremony Ingmar Bergman won in the category Best Foreign Director and Andersson, Sylwan, Thulin and Ullmann won the Special David award.[13]In Scandinavia at the 9th Guldbagge Awards the film won the award for Best Film, Harriet Andersson for Best Actress and Sven Nykvist the Special Jury Prize.[14] It also won the Jussi Award for Best Foreign Director and the Bodil Awards for Best European Film. The film also won several awards from critics' associations, including the New York Film Critics Circle Awards, National Board of Review awards and National Society of Film Critics awards.[15]","box_office":"SEK 2,130,705 (Sweden) $1.5 million (US)[1]","cinematography":"Sven Nykvist","production_company":"Svensk Filmindustri","directed_by":"Ingmar Bergman","narrated_by":"Ingmar Bergman","References":"The Stand, 1994, mentioned by Harold Lauder","release_dates":"21 December 1972 (1972-12-21) (United States)|5 March 1973 (1973-03-05) (Sweden)||||","Production":"Bergman's films were difficult to market commercially and thus foreign capital was not available to finance the film. Bergman then decided to shoot the film in Swedish and not in English (like his previous film The Touch), and to finance Cries and Whispers through his own production company, Cinematograph. Although he used personal savings of 750,000 SEK and loans of 200,000 SEK, he also had to ask the Swedish Film Institute for support with the 1.5 million SEK budget, to some criticism.[2] To save costs, the main actresses and Nykvist gave their salary as a loan and were nominally co-producers.[3]In his book Images, Bergman wrote: \"Today I feel that in Persona—and later in Cries and Whispers—I had gone as far as I could go. And that in these two instances when working in total freedom, I touched wordless secrets that only the cinema can discover.\"[4] In an essay with the DVD, the critic Peter Cowie also quotes the director: \"All of my films can be thought of in terms of black and white, except Cries and Whispers.\"[5]","cries_and_whispers":"Swedish theatrical release poster","produced_by":"Lars-Owe Carlberg","starring":"Harriet Andersson Kari Sylwan Ingrid Thulin Liv Ullmann Inga Gill Erland Josephson","running_time":"91 minutes","music_by":"Johann Sebastian Bach Frédéric Chopin","edited_by":"Siv Lundgren","written_by":"Ingmar Bergman","budget":"$400,000"}