{"based_on":"The Racer  by Ib Melchior","country":"United States","distributed_by":"New World Pictures","screenplay_by":"Robert Thom Charles Griffith","death_race_2000":"Theatrical release poster","Legacy":"A sequel comic book titled Death Race 2020 was published in 1995 by Roger Corman's short-lived Cosmic Comics imprint. It was written by Pat Mills of 2000 AD fame, with art by Kevin O'Neill. The pair had already worked together on several comics including Marshal Law. The comic book, as the title indicates, took place 20 years after the film and dealt with Frankenstein's return to the race. New racer characters introduced included Von Dutch, The Alcoholic, Happy the Clown, Steppenwolf, Rick Rhesus, and Harry Carrie.The comic book series lasted eight issues.Paul W. S. Anderson directed a remake entitled Death Race, which was released August 22, 2008, starring Jason Statham. The remake began production in late August 2007.[9] Besides Statham, this new version also stars Ian McShane, Joan Allen, and Tyrese Gibson.[10] It also includes a cameo (by voice-over) of David Carradine reprising his role as Frankenstein. Two direct-to-DVD prequels titled Death Race 2 (2011) and Death Race 3: Inferno (2013) starring Luke Goss, Ving Rhames, Tanit Phoenix and Danny Trejo. In early 2016 a second remake titled Death Race 2050 was announced.[11] The film will be produced by Roger Corman.","Plot":"In the late 1970s, the United States collapsed, resulting in massive civil unrest and economic collapse. The government restructed into a totalitarian regime under martial law. To pacify the population, the government has organized the Transcontinental Death Race, where a group of drivers is driving across the country in their high-powered cars, infamous for lots of violence, gore, and innocent pedestrians struck for bonus points.The five drivers in the 20th annual race, who all adhere to professional wrestling-style personas and drive appropriately themed cars, include Frankenstein, the mysterious black-garbed champion and national hero; Machine Gun Joe, a Chicago tough-guy gangster; Calamity Jane, a cowgirl; Matilda The Hun, a neo-Nazi; and Nero The Hero, a Roman gladiator. Each drives with a navigator of the opposite sex, who also implicitly functions as a love interest. The race is covered on national TV by a news team headed by the boisterous and comical Junior Bruce, seductive matron Grace Pander, and laconic commentator Harold (a parody of Howard Cosell).A resistance group led by Thomasina Paine (Harriet Medin), a descendant of 1770s American Revolutionary Thomas Paine, plans to rebel against Mr. President's regime by sabotaging the race, killing most of the drivers, and taking Frankenstein hostage as leverage against the President. The group is assisted by Paine's great granddaughter Annie (Simone Griffeth), Frankenstein's latest navigator. She plans to lure him into an ambush to be replaced by a double. Despite a pirated national broadcast made by Ms. Paine herself, the resistance's disruption of the race is covered up by the government and instead blamed on the French, who are also blamed for ruining the country's economy and telephone system. The game has sadistic rules, where killing a baby and physically challenged people will give the player extra points. Machine Gun Joe (Sylvester Stallone) is the main opposition to Frankenstein.At first, the Resistance's plan works. Nero is killed when he runs over a booby-trapped doll planted by the Resistance, which he mistakes for a real baby and proceeds to run it over to gain points. Matilda drives off a cliff while following a fake detour set up by the Resistance. Calamity Jane inadvertently drives over a land mine. This leaves only Frankenstein and Machine Gun Joe in the race.As Frankenstein nonchalantly survives every attempt made on his life during the race, Annie comes to discover that the Frankenstein she knows is anything but a willing government stooge, nor is he the original man. The current Frankenstein is, in fact, one of a number of random wards of the state trained exclusively to race in the identity. \"When one is used up, they bring in another,\" he tells Annie. The current Frankenstein also reveals that he has his own plans: when he wins the race and shakes hands with Mr. President, he will detonate a grenade which has been implanted in his prosthetic right hand (he calls it his \"hand grenade\"), which he has kept concealed by keeping his glove on at all times (even while undressed). His plan goes awry, however, when Machine Gun Joe attacks and Annie kills him using Frankenstein's \"hand\" grenade.Having successfully outmaneuvered both the rival drivers and the Resistance, Frankenstein is declared the winner, although he is wounded and unable to carry out his original grenade attack plan. Annie instead dons Frankenstein's disguise and plans to stab Mr. President while standing in for him on the podium. As the president congratulates \"Frankenstein\" for his victory, in the process declaring war on the French and appointing Frankenstein leader of the war, Annie is mistakenly shot and wounded by her own grandmother, who is desperate for revenge against Frankenstein for having supposedly killed her during the race (he'd actually just drugged her). The real Frankenstein takes advantage of the confusion and rams the President's stage with his car, finally fulfilling his lifelong desire to kill him.In the epilogue, Annie and Frankenstein marry. Frankenstein, now President, abolishes the race and plans to rebuild the country. However, Junior Bruce starts to protest against it. When unable to find a moral reason to continue the race, he starts shouting that it is a way of life, to keep America satisfied, to entertain and give the people what they want, now desperate to have the race perpetuate. Frankenstein, annoyed, runs him over with his car and drives off with Annie to the cheers and applause of the crowd.","language":"English","Reception":"According to Variety the film earned $4.8 million in rentals in North America.[5]Roger Ebert gave the film zero stars in his review, deriding its violence and lamenting its appeal to small children.[6] However, during a review of The Fast and the Furious on At the Movies, Ebert named Death Race 2000 among movies that make a \"great tradition of summer drive-in movies\" that expose a \"summer exploitation mentality in a clever way\".[citation needed]The film has garnered critical acclaim over the years, having a score of \"85%\" Fresh on the film critics site, Rotten Tomatoes, deeming it fresh.The film has long been regarded as a cult hit,[4] and was often viewed as superior to Rollerball, made in the same year; another dystopian science-fiction sports film, similarly focusing on the use of dangerous sports as an \"opiate\".[4]","box_office":"$5,000,000[2] or $8 million[3]","cinematography":"Tak Fujimoto","directed_by":"Paul Bartel","Home media":"Shout! Factory released a Deluxe Edition DVD and Blu-ray on June 22, 2010 in region 1/A.[7]Previous editions were released on DVD and VHS by Buena Vista Home Entertainment and New Concorde, among others.[8]","release_dates":"April 27, 1975 (1975-04-27)|||||","Production":"Roger Corman wanted to make a futuristic action sports film to take advantage of the advance publicity of Rollerball (1975). He optioned a short story by Ib Melchior and hired Robert Thom to adapt it. Director Paul Bartel felt this was unshootable, so Charles B. Griffith rewrote it. Corman wanted Peter Fonda to play the lead, but he was unavailable, so David Carradine was cast instead. Carradine was paid 10% of the film's gross — he and Ron Howard were the only stars of Roger Corman Productions to ever get a percentage of the gross.[2]Bartel later recalled \"We had terrible script problems; David had to finish his 'Kung Fu' series before starting and we had bad weather. We all worked under terrible pressure. Roger and I had an essential disagreement over comedy. He took out a lot of the comedy scenes. He may have been right and was probably more objective.\"[3]","produced_by":"Roger Corman Jim Weatherill","starring":"David Carradine Simone Griffeth Sylvester Stallone Sandy McCallum Louisa Moritz Don Steele","running_time":"80 minutes","music_by":"Paul Chihara","edited_by":"Tina Hirsch","budget":"$300,000[1][2] or $530,000[3]"}