{"based_on":"Brokeback Mountain  by Annie Proulx","country":"United States Canada","distributed_by":"Focus Features","Accolades":"Brokeback Mountain won 71 awards and had an additional 52 nominations.[83] It won three Academy Awards, for Best Director, Best Adapted Screenplay, and Best Score, as well as four Golden Globe Awards, for Best Motion Picture-Drama, Best Director, Best Song, and Best Screenplay, and four BAFTA Awards, for Best Film, Best Director, Best Adapted Screenplay and Best Supporting Actor (Jake Gyllenhaal). The film also received four Screen Actors Guild nominations for Best Actor, Best Supporting Actor, Best Supporting Actress and Best Ensemble, more than any other film released in 2005.The film is one of several highly acclaimed LGBT-related films of 2005 to be nominated for critical awards; others include Breakfast on Pluto, Capote, Rent, and Transamerica. It was voted the top film involving homosexual relationships by readers at Thebacklot.com.[84]","language":"English","box_office":"$178.1 million[1]","cinematography":"Rodrigo Prieto","production_company":"River Road Entertainment","directed_by":"Ang Lee","Home media":"This film is the first to be released the same day as both a DVD and a download available via the Internet.[87]It was released in the United States on April 4, 2006. The film moved more than 1.5 million copies on its first day of release[88] and was the third biggest seller of the week behind Disney's The Chronicles of Narnia: The Lion, the Witch and the Wardrobe and King Kong.[89] Though the ranking fluctuated daily, by late March and early April 2006, Brokeback Mountain had been the top-selling DVD on Amazon.com several days running.[90] The Region 2 (Europe) DVD was released on April 24, 2006, though at first only in the UK. Other release dates are much later: France on July 19, 2006, and Poland in September, a considerable time after the theater release in both countries. The Region 4 (Australia/New Zealand/South America) DVD was released on July 19, 2006.[citation needed] Brokeback Mountain was re-released in a collector's edition on January 23, 2007. On that same day, Brokeback Mountain was also released as a Combo Format HD DVD/DVD.[91] Brokeback Mountain was released on Blu-ray Disc on August 13, 2007, but only in the UK.[92] Brokeback Mountain was released on Blu-ray Disc in the United States on March 10, 2009.[93]","Influence and legacy":"The film is credited with acting as a stepping stone for queer cinema into the mainstream. In Out at the Movies, Steven Paul Davies explains that as a result of the film's success, \"most major film studios have been clamouring to get behind new, gay-themed projects... thanks to Brokeback, film financiers will continue to back scripts that don't simply rely on gay stereotypes...and that will certainly be progress.\" Davies cites Milk, Transamerica, and I Love You Phillip Morris as examples of such films.[94]The pair of shirts featured in the film were sold on eBay on February 20, 2006, for US$101,100.51. The shirts were sold to benefit the children's charity Variety, long associated with the film industry.[95] The buyer was Tom Gregory, a film historian and collector. He described the shirts as \"the ruby slippers of our time,\" referring to an artifact from The Wizard of Oz film.[96] In 2009 Gregory loaned the shirts from the film to the Autry National Center in Los Angeles for its series, Out West, which explored the history of homosexual, bisexual and transgender people in the Old West. The series included a gallery tour, panel discussions, lectures and performances, with events held in four installments over the course of 12 months. According to the Autry, the series was the \"first of its kind\" for a western heritage museum.[97]Beyond Brokeback: The Impact of a Film (2007) is a book of personal stories of how people were influenced by the short story and film, compiled from accounts written by members of the Ultimate Brokeback Forum. In an associated Out West series program, the Autry screened Brokeback Mountain in December 2010 to commemorate the film's fifth anniversary and held a staged reading of Beyond Brokeback in a presentation adapted by independent historian Gregory Hinton from the 2007 book. (He had also conceived and organized the Out West series for the museum.) Beyond Brokeback has been presented as a staged reading at other venues, such as Roosevelt University in Chicago, on November 13, 2011, together with a panel discussion and screening of the film.[98]Brokeback Mountain is an American opera composed by Charles Wuorinen with a libretto by Annie Proulx, based on her 1997 short story by the same name. Written in English, it premiered at the Teatro Real in Madrid on January 28, 2014. It was championed by impresario Gerard Mortier, who had commissioned it.[99][100]Annie Proulx, author of the original 1997 short story, said a few years after the film's release, \"I wish I'd never written it,\" because she has been sent too much fan fiction presenting alternative plots:[101][The film] is the source of constant irritation in my private life. There are countless people out there who think the story is open range to explore their fantasies and to correct what they see as an unbearably disappointing story.[102]She said the authors, mostly men who claim to \"understand men better than I do\",[101] often send her their works:[102]They constantly send ghastly manuscripts and pornish rewrites of the story to me, expecting me to reply with praise and applause for \"fixing\" the story. They certainly don't get the message that if you can't fix it you've got to stand it. Most of these \"fix-it\" tales have the character Ennis finding a husky boyfriend and living happily ever after, or discovering the character Jack is not really dead after all, or having the two men's children meet and marry, etc., etc.\"[102]","Controversies":"On January 6, 2006, Utah Jazz owner Larry H. Miller pulled the film from his Jordan Commons entertainment complex in Sandy, Utah, a suburb of Salt Lake City. Miller made the decision at the last minute, after having contracted for the release and advertising for the film. He pulled it after learning that the plot concerned a same-sex romance. Miller said the film got away from \"traditional families\", which he believes is \"dangerous\".[59][60] Focus Features threatened to sue him and announced it would no longer do business with him. The company stated, \"You can't do business with people who break their word.\"[60]Several conservative political pundits, including commentators Bill O'Reilly, John Gibson, and Cal Thomas, accused Hollywood of pushing a gay agenda with the film. On December 23, 2005, the Fox network reported that Brokeback Mountain was facing \"Brokeback Burnout\", citing a fall in revenues from Sunday, December 18, 2005, to Monday, as well as subsequent falls during the week.[61] Most films have smaller returns during the week compared to weekends.Gibson made jokes about the film on his Fox News Radio program for months after the film's release. After actor Heath Ledger died in January 2008 from a drug overdose, Gibson was widely criticized for mocking the deceased actor hours after the news broke. He later apologized.[62]Conservative radio figure Rush Limbaugh has referred to the film as \"Bareback Mountain\" and \"Humpback Mountain\".[63] Don Imus referred to the film as \"Fudgepack Mountain\".[64]Gene Shalit, the film critic for The Today Show, described the character of Jack Twist as a \"sexual predator\" who \"tracks Ennis down and coaxes him into sporadic trysts.\"[65] Some viewers complained about this. The gay media watchdog group GLAAD said that Shalit's characterization of Twist was like calling Leonardo DiCaprio in Titanic a sexual predator for his romantic pursuit of the character played by Kate Winslet.[65][66]Peter Shalit, the critic's openly gay son, wrote an open letter to GLAAD, saying of his father: \"He may have had an unpopular opinion of a movie that is important to the gay community, but he defamed no one, and he is not a homophobe.\" He said that GLAAD had defamed his father by \"falsely accusing him of a repellent form of bigotry\".[67] However, Gene Shalit later apologized for his review. \"I did not intend to use a word that many in the gay community consider incendiary...I certainly had no intention of casting aspersions on anyone in the gay community or on the community itself. I regret any emotional hurt that may have resulted from my review of Brokeback Mountain.\"[66]Several conservative Christian groups, such as Concerned Women for America and Focus on the Family, strongly criticized the film, based on its subject matter, before its release. Following wins by Brokeback Mountain, Capote, and Transamerica at the 2006 Golden Globes, Janice Crouse, a Concerned Women for America member, cited these films as examples of how \"the media elites are proving that their pet projects are more important than profit\" and suggested that they were not popular enough to merit so much critical acclaim.[68]Some commentators suggested that the film's producers reduced or hid its homosexual aspects in advertising and in public events, such as press conferences and award ceremonies. Journalists, including New York Daily News writer Wayman Wong, Dave Cullen and Daniel Mendelsohn, complained that the film's director, lead actors, and publicity team avoided using the word gay to describe the story, and noted that the film's trailer did not show a kiss between the two male leads but did show a heterosexual love scene.[69][70]Daniel Mendelsohn argued in the New York Review of Books that Focus Features was going to de-fang the film and turn it heterosexual. He claimed that the press kit had sought to conceal the theme of homosexuality in the advertising campaign tagline, “Love is a force of nature”, arguing that this was a betrayal of queerness. James Schamus, who assumed a leadership position at Focus Features, responded that “it is true that many reviewers contextualize their investment in the gay aspects of the romance by claiming that the characters’ homosexuality is incidental to the film’s achievements.”[71]On March 23, 2006, actor Randy Quaid, who played Joe Aguirre (Ennis and Jack's boss), filed a lawsuit against Focus Features (LLC), Del Mar Productions (LLC), James Schamus, David Linde, and Does 1–10 alleging that they intentionally and negligently misrepresented Brokeback Mountain as \"a low-budget, art house film with no prospect of making any money\" in order to secure Quaid's professional acting services at below-market rates. The film had grossed more than $160 million as of the date of his lawsuit, which sought $10 million plus punitive damages.[72] On May 5, Quaid dropped his lawsuit. Quaid's publicist said he decided to drop the lawsuit after Focus Features agreed to pay him a bonus. Focus Features denies making such a settlement.[73]The American Humane Association raised concerns that animals were treated improperly during filming, alleging that sheep were handled roughly and that an elk appeared to have been \"shot on cue.\" It suggested that the animal was anesthetized for this purpose, violating standard guidelines for animal handling in the film industry.[74]Supporters of the film engendered considerable discussion after the film Crash won the Academy Award for Best Picture. Some critics accused the Academy of homophobia for failing to award the Oscar for Best Picture to Brokeback Mountain. Michael Jensen noted that prior to the Oscar ceremony, Brokeback Mountain became \"the most honored movie in cinematic history\",[75] winning more Best Picture and Director awards than previous Oscar winners Schindler's List and Titanic combined. He noted that, prior to Brokeback, no film that had won the Writer's Guild, Director's Guild, and Producer's Guild awards failed to win the Academy Award for Best Picture, and that only four times in the previous twenty-five years had the Best Picture winner not also been the film with the most nominations. He also noted that only once before had a film that failed to be nominated for the Golden Globe's Best Picture (Crash) won the Academy Award.[76][77][78] Brokeback Mountain ranks 13th among the highest-grossing romance films of all time.[79]Some critics, notably Roger Ebert, defended the decision to award Crash Best Picture, arguing that the better film won.[80] Ebert questioned why many critics were not acknowledging other nominees and appeared to be bashing Crash only because it won over their preferred film.[81]In 2015, The Hollywood Reporter polled Academy members on controversial past decisions, in which Brokeback Mountain won the revote for Best Picture.[82]","release_dates":"September 2, 2005 (2005-09-02) (Venice International Film Festival)|December 9, 2005 (2005-12-09) (United States)|December 23, 2005 (2005-12-23) (Canada)|||","Production":"Gus Van Sant attempted to adapt Proulx's story as a film, hoping to cast Matt Damon as Ennis and Joaquin Phoenix as Jack. Damon, who previously worked with Van Sant on Good Will Hunting, told the director, \"Gus, I did a gay movie (The Talented Mr. Ripley), then a cowboy movie (All the Pretty Horses). I can't follow it up with a gay-cowboy movie!\"[3] Van Sant went on to make the biographical film Milk, based on the life of gay rights activist and politician Harvey Milk. Joel Schumacher was also linked with the project prior to Lee's involvement.[4]When Ang Lee first heard of the story and screenplay, he attempted to get the film made as an independent producer.[4] However, this did not work out and before Lee would take a break after finishing Hulk he got into contact with co-screenwriter and CEO of Focus Features, James Schamus to ask if the film was ever made.[5] Ang Lee was considering retirement after Hulk. In an interview with OUT Magazine he described himself \"wrecked\" after filming both Crouching Tiger, Hidden Dragon and Hulk. Brokeback Mountain \"nurtured\" him back into filmmaking\".[6]Mark Wahlberg reportedly declined the starring role, saying he refused the opportunity because he was \"a little creeped out\" by the homosexual themes and sex scene.[7] The casting of Heath Ledger and Jake Gyllenhaal was announced in 2003.[8] Anne Hathaway stated that during her audition, she lied to Ang Lee about her knowledge of horse riding so that he would cast her.[9] Subsequently, she took horse-riding lessons for two months.[10]While the film is set in Wyoming (like the original story), it was filmed almost entirely in the Canadian Rockies in southern Alberta. Lee was given a tour of the locations in the story in Wyoming by Proulx but chose to shoot in Canada due to financial reasons.[5] The fictional \"Brokeback Mountain\" was named to suggest a physical feature, after a term used for a swaybacked horse or mule.[11] The mountain featured in the film is a composite of Mount Lougheed south of the town of Canmore and Fortress and Moose Mountain in Kananaskis Country.[12]The campsites were filmed at Goat Creek, Upper Kananaskis Lake, Elbow Falls and Canyon Creek, also in Alberta. Other scenes were filmed in Cowley, Fort Macleod,[13] and Calgary. The film was shot during the summer of 2004.[14]Proulx has praised the faithfulness of the adaptation of her story as a feature film. Before the movie was made, she described McMurtry and Ossana's adaptation as \"an exceptionally fine screenplay.\" Later, she praised the film as \"huge and powerful,\" writing that she was \"knocked for a loop\" when she first saw it.[15]","International distribution and reception":"The film has been given different titles in other languages. It is entitled The Secret(s) of Brokeback Mountain (in French, Italian, Portuguese and Polish). In Canadian French, the title is Souvenirs de Brokeback Mountain (Memories of Brokeback Mountain). In Spanish the film had two titles: in Spain, the tile was El terreno vedado (The forbidden terrain) while in Latin America the titles was \"Secreto en la montaña\" (Secret in the mountain). In Hungarian, the title was Túl a barátságon (Beyond friendship). The Region 1 DVD has English, Spanish (Latin American), French (Canadian), and on some DVDs, German audio tracks.[citation needed]The film met with mixed reactions in other nations, particularly China and Islamic nations of western Asia. According to news reports, the film has not been shown in theaters in China, although it was freely available in bootleg DVD and video. The state said it did not distribute the film because the anticipated audience was too small to justify it. The foreign media suggested this was a cover for government opposition to a portrayal of homosexuality.[50][51]The film opened in theaters in Lee's native Taiwan on January 20, 2006, and Hong Kong on February 23, 2006.[52] A CNN interviewer said to Ang Lee,\"Brokeback Mountain has never been shown in China, but when you won Best Director in 2005 for that film, the Chinese media said, and I quote: \"You are the pride of the Chinese people all over the world.\" Do you find that a little hypocritical, the fact that you are feted by China, yet your film is not allowed to be shown there?\"[49]Lee responded,\"It was, I wouldn't say hypocritical. I think they are genuinely happy to see a Chinese director win an Academy Award with good artistic value. I think that pride is genuine, so I would not think that's hypocritical at all. Not only in my judgment, I literally meet people who are genuinely happy. No, no, I don't think so, it's just like they don't want homosexual movie shown in the movies, it's hard to put American logic... It's just something else. I don't know how to describe it, it's just something else. So what can I say?\"[49]The word \"brokeback\" (Chinese: 斷背; pinyin: duànbèi) has entered the Chinese lexicon as a slang word for homosexuality.[53] As well as this, the film, upon its release was dubbed by the press \"the gay cowboy movie\" which is a term that was propelled into the American vernacular.[8]In the Middle East, distribution of the film became a political issue. Homosexuality is legally a serious crime in most Islamic nations and is a taboo subject even in the few nations where it is legal. Lebanon was the only Arab country to show the film, and it released a censored format. The film was also released in Turkey.[54] The film was officially banned from screenings in the United Arab Emirates; however, the DVD of the film was permitted to be rented from stores such as Blockbuster Video.[55][56]On December 8, 2008, the Italian state-owned television channel Rai Due aired a censored version of the film, removing all the scenes with homoerotic references. Viewers protested, saying the deletions made the plot impossible to follow. The Arcigay organisation protested the deletions as homophobic censorship.[57] The state-owned television network RAI said the Italian film distributor had mistakenly censored the film. RAI showed an uncensored version of the film on March 17, 2009.[58]","running_time":"134 minutes","brokeback_mountain":"Theatrical release poster","budget":"$14 million[1]","screenplay_by":"Larry McMurtry Diana Ossana","Plot":"In 1963, Ennis Del Mar (Heath Ledger) and Jack Twist (Jake Gyllenhaal) are hired by Joe Aguirre (Randy Quaid) to herd his sheep through the summer in the Wyoming mountains. After a night of heavy drinking, Jack makes a pass at Ennis, who is initially hesitant but eventually responds to Jack's advances. Though he informs Jack that it was a one-time incident, they develop a sexual and emotional relationship. Shortly after discovering their summer together is being cut short, they briefly fight and each is bloodied.After Jack and Ennis part ways, Ennis marries his longtime fiancée Alma Beers (Michelle Williams) and has two daughters with her. Jack returns the next summer seeking work, but Aguirre, who observed Jack and Ennis on the mountain, refuses to rehire him.Jack moves to Texas, where he meets, marries, and has a son with rodeo rider Lureen Newsome (Anne Hathaway). After four years, Jack visits Ennis. Upon meeting, the two kiss passionately, which Alma accidentally observes. Jack broaches the subject of creating a life together on a small ranch, but Ennis, haunted by a childhood memory of the torture and murder of a man suspected of homosexual behavior, refuses. He is also unwilling to abandon his family. Ennis and Jack continue to meet for infrequent fishing trips.The marriages of both men deteriorate. Lureen abandons the rodeo, going into business with her father and expecting Jack to work in sales. Alma and Ennis eventually divorce in 1975.Hearing about Ennis' divorce, Jack drives to Wyoming. He suggests again that they should live together, but Ennis refuses to move away from his children. Jack finds solace with male prostitutes in Mexico. Ennis sees his family regularly until Alma finally confronts him about her knowing the true nature of his relationship with Jack. This results in a violent argument, causing Ennis to abandon his connections with Alma. Ennis meets and has a brief romantic relationship with Cassie Cartwright (Linda Cardellini), a waitress.Jack and Lureen meet and befriend another couple, Randall and Lashawn Malone. Jack begins an affair with Randall, although he later tells Ennis he had an relationship with Lashawn.At the end of a regular fishing trip with Jack, Ennis tries to delay their next meeting. Jack's frustration erupts into argument, and Ennis blames Jack for being the cause of his own conflicted actions. Ennis begins to cry. Jack tries to hold him and there is a brief struggle, but they end up locked in an embrace. Jack watches Ennis drive away.Some time later, Ennis receives a postcard he had sent to Jack, stamped \"Deceased\". He calls Lureen, who says that Jack died in an accident, when a tire he was changing exploded. As she speaks, Ennis imagines that Jack was actually beaten to death by a gang of thugs, the very same fate that Ennis feared. Lureen tells Ennis that Jack wanted to have his ashes scattered on Brokeback Mountain, but she does not know where it is.Ennis travels to meet with Jack's mother and father (Roberta Maxwell and Peter McRobbie), and offers to take Jack's ashes to the mountain. The father refuses, preferring to have them interred in a family plot. Permitted by Jack's mother to see his childhood bedroom, Ennis finds the bloodstained shirt he thought he had lost on Brokeback Mountain. He realizes Jack kept it hanging with his own stained shirt from that summer fight. Ennis holds both shirts up to his face, silently weeping. Jack's mother lets him keep the shirts.Later, 19-year-old Alma Jr. (Kate Mara) arrives at Ennis' trailer to tell her father she is engaged. She asks for his blessing and invites him to the wedding. Ennis asks her if her fiancé really loves her and she replies \"yes\". After Alma leaves, Ennis goes to his closet, where his and Jack's shirts hang together, with a postcard of Brokeback Mountain tacked above. He stares at the ensemble for a moment, tears in his eyes, and murmurs, \"Jack, I swear...\"","Reception":"Professional film critics have praised Brokeback Mountain.[21] The film won four Golden Globe Awards, including Best Motion Picture – Drama, and was nominated for seven, leading all other films in the 2005 awards. It won the Golden Lion at the Venice Film Festival, as well as the title Best Picture from the Boston Society of Film Critics, the Dallas–Fort Worth Film Critics Association, the Florida Film Critics Circle, the Los Angeles Film Critics Association, the New York Film Critics Circle, the San Francisco Film Critics Circle, and the British Academy of Film and Television Arts (BAFTAs).Brokeback Mountain received 87% positive reviews the aggregator on Rotten Tomatoes, based on 223 reviews, with the consensus that \"a beautifully epic Western, Brokeback Mountain's gay love story is imbued with heartbreaking universality, helped by the moving performances of Ledger and Gyllenhaal.\"[21] It also received an 87 out of 100 score on Metacritic based on 41 reviews, indicating \"universal acclaim.\"[22] The film was given a \"two thumbs up\" rating by Roger Ebert and Richard Roeper, the former giving a four-star review in the Chicago Sun-Times. The film received positive reviews from Christianity Today.[23] Conservative radio host Michael Medved gave the film three and a half stars, stating that while the film's \"agenda\" is blatant, it is an artistic work.[24]Universal (the studio of which Focus Features is the specialty division) announced on January 3, 2006, that Brokeback Mountain was the most honored film of 2005. The independent website criticstop10.com backed that assertion, reporting that Brokeback Mountain was the most frequently selected film on reviewers' year-end Top Ten lists of 2005.[25] The film was picked as one of the 400 nominated films for the American Film Institute list AFI's 100 Years...100 Movies (10th Anniversary Edition).[26] Entertainment Weekly put it on its end-of-the-decade, best-of list.[27]On March 9, 2006, a press release was sent to more than 400 media outlets announcing that nearly $26,000 had been raised for an ad to be posted in the Daily Variety the following day.[28] The money had been raised by just over 600 fans through an online donations site, affiliated with a non-studio-sponsored online forum which is devoted to the film and the book.[29] The story was quickly picked up by several outlets including Yahoo!, The Advocate, and The New York Times.[30][31] The ad served as a simple show of fan support despite its losing the Best Picture Oscar.The film's significance has been attributed to its portrayal of a same-sex relationship on its own terms, focused on the characters. It does not refer to the history of the LGBT social movements.[32] It emphasizes the tragic love story aspect, and many commentators have compared Ennis and Jack's drama to classic and modern romances such as Romeo and Juliet or Titanic, often using the term star-crossed lovers.[33][34][35] The poster for the film was inspired by that of James Cameron's Titanic, after Ang Lee's collaborator James Schamus looked at the posters of \"the 50 most romantic movies ever made\".[36]","Box office success":"Brokeback Mountain cost about US$14 million to produce, excluding its reported advertising budget of $5 million. According to interviews with the filmmakers, Focus Features was able to recoup its production costs early on by selling overseas rights to the film.The film saw limited release in the United States on December 9, 2005 (in New York City, Los Angeles, and San Francisco), taking $547,425 in five theaters its first weekend.Over the Christmas weekend, Brokeback Mountain posted the highest per-theater gross of any film and was considered a box office success not only in urban centers such as New York City and Los Angeles, but also in suburban theaters near Portland, Houston, Chicago, Dallas, Denver, and Atlanta. On January 6, 2006, the film expanded into 483 theaters, and on January 13, 2006, Focus Features, the film's distributor, opened Brokeback in nearly 700 North American cinemas as part of its ongoing expansion strategy for the film. On January 20, the film opened in 1,194 theaters in North America; it opened in 1,652 theaters on January 27 and in 2,089 theaters on February 3, its widest release.The film's theatrical run lasted for 133 days and grossed $83,043,761 in North America and $95,018,998 abroad, adding up to a worldwide gross of $178,062,759. It is the top-grossing release of Focus Features, it ranks fifth among the highest-grossing westerns (since 1979), and eighth among the highest-grossing romantic dramas (1980 – present).Brokeback Mountain was released in London on December 30, 2005,[16] in only one cinema, and was widely released in the rest of the United Kingdom on January 6, 2006. On January 11, Time Out London magazine reported that Brokeback was the number one film in the city, a position it held for three weeks.[citation needed]The film was released in France on January 18, 2006, in 155 cinemas (expanding into 258 cinemas in the second week and into 290 in the third week). In its first week of release, Brokeback Mountain was in third place at the French box office, with 277,000 people viewing the film, or an average of 1,787 people by cinema per week, the highest such figure for any film in France that week. One month later, it reached more than one million viewers (more than 1,250,000 on March 18), with still 168 cinemas (in the 10th week). Released in Italy on January 20, the film grossed more than 890,000 euros in only three days, and was the fourth highest-grossing film in the country in its first week of release.Brokeback was released in Australia on January 26, 2006, where it landed in fourth place at the box office and earned an average per-screen gross three times higher than its nearest competitor during its first weekend despite being released in only 48 cinemas nationwide. Most of the Australian critics praised the film.[17] Brokeback was released in many other countries during the first three months of 2006.[18]During its first week of release, Brokeback was in first place in Hong Kong's box office, with more than US$473,868 ($22,565 per cinema).[19]Brokeback Mountain was the highest-grossing film in the U.S. from January 17 through January 19, 2006, perhaps due primarily to its wins at the Golden Globes on January 16. Indeed, the film was one of the top five highest-grossing films in the U.S. every day from January 17 until January 28, including over the weekend (when more people go to the films and big-budget films usually crowd out independent films from the top-grossing list) of January 20–22.[20] On January 28, the film fell out of the top five and into sixth place at the box office during that weekend before entering the top five again on January 30 and remaining there until February 10.The film was released on January 20, 2006, in Taiwan, where director Ang Lee was born, and it ran there until April 20.","produced_by":"Diana Ossana James Schamus","starring":"Heath Ledger Jake Gyllenhaal Anne Hathaway Michelle Williams","Discussions about sexuality of characters":"Reviewers, critics, and the cast and crew disagreed as to whether the film's two protagonists were homosexual, bisexual, heterosexual, or should be free of any sexual classification. The film was frequently referred to in the media as the \"gay cowboy movie\", but a number of reviewers noted that both Jack and Ennis were bisexual.[37][38][39] Sex researcher Fritz Klein said that the film was \"a nice film with two main characters who were bisexual\" and suggested that the character of Jack is more \"toward the gay side of bisexuality\" and Ennis is \"a bit more toward the straight side of being bisexual\".[40]Gyllenhaal concluded that Ennis and Jack were heterosexual men who \"develop this love, this bond,\" saying in a Details interview: \"I approached the story believing that these are actually two straight guys who fall in love.\"[40] Ledger was quoted in TIME magazine: \"I don't think Ennis could be labeled as gay. Without Jack Twist, I don't know that he ever would have come out.... I think the whole point was that it was two souls that fell in love with each other.\"Others said they felt the characters' sexuality to be simply ambiguous. Clarence Patton and Christopher Murray said in New York's Gay City News that Ennis and Jack's experiences were metaphors for \"many men who do not identify as gay or even queer, but who nevertheless have sex with other men\".[41] It was written in Entertainment Weekly \"everyone called it 'The Gay Cowboy Movie.' Until they saw it. In the end, Ang Lee's 2005 love story wasn't gay or straight, just human.\"[27] A reviewer at Filmcritic.com wrote: \"We later see Jack eagerly engage Lureen sexually, with no explanation as to whether he is bisexual, so in need of physical intimacy that anyone, regardless of gender, will do, or merely very adept at faking it.\"[42]LGBT non-fiction author Eric Marcus dismissed \"talk of Ennis and Jack being anything but gay as box office-influenced political correctness intended to steer straight audiences to the film\". Roger Ebert concluded that both characters were gay, but doubted it themselves: \"Jack is able to accept a little more willingly that he is inescapably gay.\"[43] The film's producer, James Schamus, said, \"I suppose movies can be Rorschach tests for all of us, but damn if these characters aren't gay to me.\"[40] Annie Proulx, whose story is the basis of the film, said \"how different readers take the story is a reflection of their own personal values, attitudes, hang-ups.\"[44][45]When Ledger and Gyllenhaal were asked about any fear of being cast in such controversial roles, Ledger responded that he was not afraid of the role, but rather he was concerned that he would not be mature enough as an actor to do the story justice. Gyllenhaal has stated that he is extremely proud of the film and his role, regardless of what the reactions would be. He regards rumors of him being bisexual as flattering, stating: \"I'm open to whatever people want to call me. I've never really been attracted to men sexually, but I don't think I would be afraid of it if it happened.\"[46] Both have stated that the sex scenes in the beginning were difficult to do. Lee found the first scene difficult to film and has stated he has great respect for the two main actors for their \"courage\". Ledger's performance was described by Luke Davies as a difficult and empowering portrayal given the environment of the film: \"In Brokeback Mountain the vulnerability, the potential for danger, is so great – a world so masculine it might destroy you for any aberration – that [Ledger's] real brilliance was to bring to the screen a character, Ennis Del Mar, so fundamentally shut down that he is like a bible of unrequited desires, stifled yearnings, lost potential.\"[47]The campaign to depoliticize the film, which was successful in some ways, failed to avert the backlash resulting from the film's subverting “the myth of the American West and its iconic heroes.” [48] Brokeback Mountain challenges the iconic image of the white, male, all American cowboy and allows it to engage with same-sex relationships. Author Jim Kitses states \"What drives the emotional attack of the film is the inadequacy of its characters to articulate and understand, let alone control, the experience that strikes them like a storm. American cowboys—of all people—have no business falling in love with each other. Practical and conservative types of a rough and ready manhood are by no means ready for man-love.\" [48]","music_by":"Gustavo Santaolalla","edited_by":"Geraldine Peroni Dylan Tichenor"}