{"country":"United Kingdom","distributed_by":"Anglo-Amalgamated","Plot":"The film opens during Caesar's invasions of Britain, with Mark Antony (Sid James) struggling to lead his armies through miserable weather. At a nearby village, cavemen Horsa (Jim Dale) and Hengist Pod (Kenneth Connor) attempt to alert Boudica of the invasion, but are captured by the Romans.Once in Rome, Horsa is sold by the slave-trading firm Marcus et Spencius, and Hengist is destined to be thrown to the lions when none agree to buy him. Horsa and Hengist escape and take refuge in the Temple of Vesta. Whilst hiding there, Julius Caesar (Kenneth Williams) arrives to consult the Vestal Virgins, but an attempt is made on his life by his bodyguard, Bilius (David Davenport). In the melee, Horsa kills Bilius and escapes, leaving Hengist to take the credit for saving Caesar's life and to be made Caesar's new bodyguard.When a power struggle emerges in Egypt, Mark Antony is sent to force Cleopatra (Amanda Barrie) to abdicate in favour of Ptolemy. However, Mark Antony becomes besotted with her, and instead kills Ptolemy off-screen to win her favour. Cleopatra convinces Mark Antony to kill Caesar and become ruler of Rome himself so that they may rule a powerful Roman-Egyptian alliance together. After seducing one another, Mark Antony agrees, and plots to kill Caesar.Caesar and Hengist travel to Egypt on a galley, along with Agrippa (Francis de Wolff), whom Mark Antony has convinced to kill Caesar. However, Horsa has been re-captured and is now a slave on Caesar's galley. After killing the galley-master (Peter Gilmore), Horsa and the galley slaves kill Agrippa and his fellow assassins and swim to Egypt. Hengist, who had been sent out to fight Agrippa and was unaware of Horsa's presence on board, again takes the credit.Once at Cleopatra's palace, an Egyptian soothsayer (Jon Pertwee) warns Caesar of the plot to kill him, but Mark Anthony convinces Caesar from fleeing. Instead, Caesar convinces Hengist to change places with him, since Cleopatra and Caesar have never met. On meeting, Cleopatra lures Hengist, who accidentally exposes both Cleopatra and Mark Anthony as would-be assassins. He and Caesar then ally with Horsa, and after defeating Cleopatra's bodyguard Sosages (Tom Clegg) in combat, Hengist and the party flee Egypt. Caesar is returned to Rome, only to be assassinated on the Ides of March. Horsa and Hengist return to Britain, and Mark Antony is left in Egypt to live \"one long Saturday night\" with Cleopatra.","language":"English","Reception":"The film was one of the 12 most popular movies at the British box office in 1965.[8]Colin McCabe, Professor of English at the University of Exeter, labelled this film (together with Carry On Up The Khyber) as one of the best films of all time.[9]In 2007, the pun \"Infamy, infamy, they've all got it in for me\", spoken by Kenneth Williams, was voted the funniest one-line joke in film history.[10][11][12]","Background notes":"The costumes and sets used in the film were originally intended for Cleopatra (1963) before that production moved to Rome and rebuilt new sets there.[4] Carry On Cleo was filmed between 13 July and 28 August 1964.[citation needed]The original poster and publicity artwork by Tom Chantrell were withdrawn from circulation after Fox successfully brought a copyright infringement case against distributor Anglo Amalgamated, which found the design was based on a painting by Howard Terpning for which Fox owned the copyright and was used to promote the Cleopatra film.[5][6][7]","carry_on_cleo":"Original UK quad poster","cinematography":"Alan Hume","directed_by":"Gerald Thomas","narrated_by":"E. V. H. Emmett","release_dates":"November 1964 (1964-11)|||||","produced_by":"Peter Rogers","starring":"Sid James Kenneth Williams Kenneth Connor Charles Hawtrey Jim Dale Joan Sims Amanda Barrie","running_time":"92 minutes","Filming and locations":"Interiors:","music_by":"Eric Rogers","edited_by":"Archie Ludski","written_by":"Talbot Rothwell","budget":"£165,802[1]"}