{"country":"United States","distributed_by":"20th Century Fox","Plot":"A sting operation to capture arms dealer Miles Jackson goes awry when the FBI's inside man double crosses them. Miles rendezvouses with his girlfriend Erica Kessen, who has a getaway car. Officers Danny Fisher and Hank Carver are dispatched to help the FBI. They look at Jackson's record and see a surveillance video of him dancing with Kessen. An encounter with them at a traffic light leads to her death and Miles being taken away. Miles swears vengeance on Fisher.One year later, Fisher gets a phone call from Jackson, who has escaped from prison. Fisher runs outside the house looking for Jackson, and Fisher's car and house explode, throwing him to the ground. After he recovers, Jackson says he is launching a game of revenge called \"12 Rounds.\" The house, the car, and Phil, the plumber who came to fix a pipe were \"Round 1.\" Molly Porter, Fisher’s girlfriend is kidnapped by Jackson for \"Round 2.\" For \"Round 3,\" Fisher and Carver must follow a series of clues to locate the cell phone that Jackson calls, and for \"Round 4\" Fisher has to get to New Orleans Savings and Loan where a fire has broken out and extract two security deposit boxes within 20 minutes.Carver has a lead on the man who helped kidnap Molly Porter and volunteers to look into that while Fisher continues with the game. FBI Special Agents George Aiken and Ray Santiago work with them to get Porter back.For \"Round 5\" one of the security boxes is a bomb and the other contains a clue to the next round. Fisher is discovers and disposes of the bomb.The other box contains a hotel room key. The room is raided and found empty. For \"Round 6,\" Fisher follows a series of clues to a bus where he finds Porter on board, wearing a bomb underneath her jacket. He is handcuffed to a bar and is given an envelope with a phone number as the clue to the next round. The Feds try to get Jackson but he escapes with Porter. When Fisher is freed, he tells the Feds about the bomb. Carver shows up and tells Fisher he has located Jackson's henchman, Anthony Deluso.In \"Round 7\" Fisher has to find the correct cell phone number that disarms bombs placed in different locations. Jackson answers and tells him that his call disabled Streetcar 907's brakes. Fisher and Santiago slam their car into the transformer, shutting off electricity for the whole neighborhood. They run along the streetcar, clearing people out of the way until it can slow to a halt.A mine planted by Jackson kills Carver and Deluso. Jackson says that Porter's bomb can only be disarmed by Fisher's fingerprint. He tells Fisher to pay a visit to Erica Kessen, so Fisher, Santiago, and Aiken start for the cemetery. Another detective, Chuck Jansen calls Fisher to tell him that the numbers in the envelope were rigged to the streetcar. Jackson had cameras monitoring the elevator shaft and set off the bomb five seconds early. Fisher realizes that Willie's death in the elevator episode was orchestrated by Jackson.. Santiago does a check on Willie and finds he had a second job as a Homeland Security guard. They figure out that Jackson was leading them to take out the power because Homeland Security comes in to move the unprotected cash. Jackson's grudge against Fisher was only a cover for in his scheme to steal this money.Aiken tells Santiago to lock down the Mint, while he and Fisher go after Porter. Fisher realizes that \"Round 12\" is a wild-goose chase, since Jackson needs Porter, a nurse, to help him escape. Jackson, dressed as a security guard, steals the cash. He uses Porter's ID card to get to a Medevac chopper on a hospital roof, transporting the money inside a body bag. Fisher and Aiken race to the hospital roof, where Aiken is wounded. Fisher activates the touch phone-bomb and throws the switch away. Porter and Fisher jump into a pool, while Jackson is left in the exploding helicopter.","language":"English","Reception":"The filmed opened at number seven at the box office, gaining an estimate of $1.75 million in its opening day and $5.3 million in its opening weekend. A further $12,097,848 in other countries helped take its worldwide total to $29,671,049.12 Rounds has received mostly negative reviews from critics. Some critics have noted the film's similarities to the 1995 movie Die Hard with a Vengeance.[8] The film ranking website Rotten Tomatoes reported that 29% of critics had given the film positive reviews, based upon a sample of 69.[9] At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the film has received an average score of 38, based on 13 reviews.[10]","box_office":"$29,671,049[2]","Home media and unrated version":"12 Rounds was released on DVD, Blu-ray Disc, and UMD with an unrated \"Extreme Cut\" of the film on June 30, 2009.[11] In the first week, 12 Rounds opened at #1 at the DVD sales chart, selling 208,936 DVD units translating to revenue of $3.1m.[12] As of July 2011, 581,834 DVD units have been sold, bringing in $8,884,292 in revenue. This does not include Blu-ray Disc sales/DVD rentals.The DVD is a one-disc set that includes:[citation needed]","cinematography":"David Boyd","production_company":"WWE Studios Fox Atomic","directed_by":"Renny Harlin","Music":"The score of 12 Rounds was composed by Trevor Rabin, who had previously worked with director Renny Harlin on Deep Blue Sea and Exorcist: The Beginning. He recorded his score with the Hollywood Studio Symphony at the Eastwood Scoring Stage at Warner Bros. Studios.[7]","release_dates":"March 19, 2009 (2009-03-19) (Australia)|March 27, 2009 (2009-03-27) (United States)||||","produced_by":"Becki Cross Trujillo Mark Gordon Renny Harlin Mike Lake Josh McLaughlin Vince McMahon","starring":"John Cena Aidan Gillen Steve Harris Ashley Scott Brian J. White Taylor Cole Vincent Flood Gonzalo Menendez Travis Davis Billy Slaughter","running_time":"109 minutes","Sequels":"Randy Orton stars in a stand-alone sequel titled 12 Rounds 2: Reloaded.[13] The sequel was released in 2013. It was announced in 2014 that Dean Ambrose was going to star in the third film in the franchise called 12 Rounds 3: Lockdown.[14]","music_by":"Trevor Rabin","edited_by":"Brian Berdan","written_by":"Daniel Kunka","budget":"$22 million[1]"}