{"country":"United States","distributed_by":"Vision International|(through Metro-Goldwyn-Mayer)|","Plot":"The story follows Casey, a normal boy whose life is constantly influenced by his intense fear of clowns. His two older brothers, Geoffrey and Randy, are mostly disobliging. One night, the three boys are left alone when their mother visits relatives, so they decide to visit a local circus for a night of amusement, despite Casey's uncontrollable coulrophobia. Meanwhile, the local state insane asylum has sent a majority of the hospital's inmates to the carnival for therapy, but three psychotic mental patients break away from the group and kill three clowns, taking their makeup and costumes. While at the circus, Casey innocently visits a fortune teller despite Randy's better judgment. The fortune teller reveals to Casey that his life line has been cut short, and says to him:Beware, beware, in the darkest of dark /though the flesh is young and the hearts are strong /precious life cannot be long /when darkest death has left its mark.As the boys return from the circus, a shaken Casey thinks his nightmare is over, but it has only just begun. The three patients move from house to house, sadistically killing their residents while mimicking their dying motions with clown-like jest. When the clowns target their home, Casey is forced to face his fears once and for all. Casey and his brothers are locked inside their isolated farmhouse and the power is turned off. Casey attempts to call the police, but because Casey says that the \"clowns from the circus are trying to get him\", the police officers assume that Casey's fear of clowns caused him to have a realistic nightmare. The officers tell Casey that everything will be fine if he goes back to sleep, and hang up. The three boys are forced to band together in a desperate fight for survival during a deadly game of cat and mouse where they try to outwit the killers, who are stalking them around the property. Randy mockingly dresses up as a clown, disbelieving of Casey's claims that clowns are inside the house. His plan to jump out at Geoffrey and Casey is cut short after he is stabbed by one of the clowns. Geoffrey manages to kill the first clown by hitting him with a wooden plank, knocking him down a flight of stairs and breaking his neck. Later on, after tricking the clown, Casey and Geoffrey push another clown out a window to his death. Casey and Geoffrey find Randy unconscious in a closet and drag him into another room. The film ends with Geoffrey being attacked and presumably killed by the final clown, who chases Casey into the upstairs game room. Casey manages to hide for the time being, but after the clown leaves, Casey accidentally steps on a noise-making toy, alerting the clown of his presence. The enraged clown attempts to strangle Casey to death, but he is then killed by Geoffrey (who survived the clown's attack), slamming a hatchet into the killer's back, and the two exhausted and traumatized brothers hug each other as the police finally arrive to help them.The film ends with this narration:No man can hide from his fears; as they are a part of him, they will always know where he is hiding.","language":"English","Production controversy":"In 1988, Salva was charged with the sexual abuse of Nathan Forrest Winters, the lead actor who played Casey, during production. Salva served 15 months of a 3-year-prison term, and was released on parole. Winters came forward again in 1995, when Salva's film Powder was released.[2][3][4]Salva became noticeable again in the film industry in 2001 with the release of his sleeper hit Jeepers Creepers, followed by its 2003 sequel Jeepers Creepers II.[5][6][7]","Reception":"Clownhouse has received mixed reviews from film critics. On review aggregator website Rotten Tomatoes, the film currently has a 40% approval score based on 5 reviews, with an average rating of 5.7/10.[8]","cinematography":"Robin Mortarotti","production_company":"Commercial Pictures","directed_by":"Victor Salva","Home media":"Mainly due to the controversy during its production, Clownhouse became a sleeper hit, but soon fell into obscurity. The film was released on VHS and Laserdisc in 1990, and on DVD in 2004, the latter of which is now out of print.","clownhouse":"DVD cover","release_dates":"January 1989 (1989-01)|||||","produced_by":"Michael Danty|Robin Mortarotti|Victor Salva|","starring":"Nathan Forrest Winters|Brian McHugh|Sam Rockwell|","running_time":"81 minutes","music_by":"Michael Becker|Thomas Richardson|","edited_by":"Roy Anthony Cox|Sabrina Plisco-Morris|","written_by":"Victor Salva","budget":"$200,000 (estimated)[1]"}