{"based_on":"the novel At Play in the Fields of the Lord  by Peter Matthiessen","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Hector Babenco Jean-Claude Carrière Vincent Patrick","Background":"Producer Saul Zaentz first tried to make this film in 1965. He discovered that MGM owned the rights to Peter Matthiessen's novel. Zaentz continued to try to buy the property every time there was a top executive change at MGM until 1989, when the new studio heads Jay Kanter and Alan Ladd, Jr. decided that MGM would not make the film. Zaentz then paid $1.4 million for the rights.[3]The picture was filmed in Belém, Pará, Brazil. It was released to theaters in the U.S. on December 6, 1991. While the film has been released to VHS and Laserdisc, the film was never released on DVD nor Blu-ray anywhere (except for a 2013 DVD release in Spain). This is due to a rights issue with Universal Pictures (the distributor of the film) and Warner Bros. (current distributors of the Saul Zaentz library).","Plot":"A pair of explorers, Lewis Moon and Wolf, become stranded in Mãe de Deus (Portuguese: Mother of God), an outpost in the deep Brazilian Amazon River basin, after their plane runs out of fuel.The local police commander wants the Niaruna tribe, living upriver, to move their village so they won't be killed by gold miners moving into the area and cause trouble for him with the provincial government. The commander cuts a deal with Moon: if he and his fellow mercenary would bomb the Niaruna village from the air and drive them away, they will be given enough gasoline for their airplane to be allowed to leave.Born-again Christian evangelist (and missionary) Martin Quarrier and his wife Hazel arrive with their son Billy, here to spread the Christian gospel to the primitive Niaruna indigenous natives. They arrive in Mãe de Deus to meet fellow missionaries Leslie and Andy Huben, who live with a Niaruna helper. In town, they meet a Catholic priest who wants to re-establish a mission to the Niarunas, as the former missionary was killed by them.Moon and Wolf leave in their plane to attack the Niaruna. But upon seeing the community with his own eyes as well as an Indian firing an arrow at the plane, Moon has second thoughts. The plane returns to Mãe de Deus.That night, after a discussion with Wolf, Quarrier and the priest, Moon takes an Indian drug and becomes hallucinatory. He takes off alone in his plane and parachutes into the Niaruna village. Moon, a half-Native American Cheyenne, aligns himself with the Niarunas. He is accepted as \"Kisu-Mu\", one of the Niaruna gods, and begins to adapt to Niaruna life and culture.The four evangelists travel upriver to establish their mission. Indians originally converted by the Catholics turn up, awaiting the arrival of the Niaruna. Eventually they do come and accept the gifts that the Quarriers offer, not staying long.Young Billy dies of blackwater fever (a serious complication of malaria), causing Hazel to lose her sanity. She is returned to Mãe de Deus. Martin becomes despondent, arguing with Leslie and gradually losing his faith.Meanwhile, Moon encounters Andy swimming nude. After they kiss, Moon catches her cold. He returns to the Niaruna camp and inadvertently infects everyone there. Much of the tribe becomes sick. Moon and the tribe's leaders go to the missionary Leslie to beg for drugs.Leslie refuses, but Martin agrees to provide the drugs. He travels to the Niaruna village with the missionaries' young helper. In the village, after Martin speaks with Moon, helicopters arrive to begin bombing. Martin survives the bombing, but is killed by his helper soon thereafter. Moon is exposed not as a god but as a man. He runs, ending up alone.","language":"English","Critical reception":"The review aggregator Rotten Tomatoes reported that 50% of critics gave the film a positive review, based on six major reviews.[4] Noted Chicago Sun Times critic Roger Ebert had read the novel and believed the film is true to its themes. Ebert makes the case that producer Saul Zaentz has a history of producing \"unfilmable\" source material. He wrote, \"Watching it, we are looking at a morality play about a world in which sincere people create unwitting mischief so that evil people can have their way. The movie essentially argues that all peoples have a right to worship their own gods without interference, but it goes further to observe that if your god lives in the land and the trees, then if we destroy your land, we kill your god. These messages are buried in the very fabric of the film, in the way it was shot, in its use of locations, and we are not told them, we absorb them.\"[5]Vincent Canby, the film critic for the New York Times, had mixed feelings about the film but did like the acting and the screenplay, and wrote, \"At Play in the Fields of the Lord doesn't play smoothly, but it often plays well ... Mr. Lithgow and Miss Hannah, who grows more secure as an actress with every film, are fine in complex roles that are exceptionally well written ... Though the film features a spectacular penultimate sequence, it seems not to know how to end. It sort of drifts away, perhaps trying to soften its own well-earned pessimism.\"[6]On the other hand, critic Jeffrey Westhoff disliked the film and stated: \"Some books should remain books.\" [7]WinsNominations","box_office":"$1,342,903 (USA)","cinematography":"Lauro Escorel","directed_by":"Héctor Babenco","at_play_in_the_fields_of_the_lord":"Theatrical release poster","release_dates":"December 6, 1991 (1991-12-06) (United States)|||||","produced_by":"Saul Zaentz","starring":"Tom Berenger|John Lithgow|Daryl Hannah|Aidan Quinn|Tom Waits|Kathy Bates|","running_time":"189 minutes","music_by":"Zbigniew Preisner","edited_by":"William M. Anderson Armen Minasian","budget":"$36,000,000"}