{"based_on":"Lost Moon  by Jim Lovell Jeffrey Kluger","Cast":"The real Jim Lovell appears as captain of the recovery ship USS Iwo Jima; Howard had intended to make him an admiral, but Lovell himself, having retired as a captain, chose to appear in his actual rank. Horror film director Roger Corman, a mentor of Howard, appears as a congressman being given a VIP tour by Lovell of the Vehicle Assembly Building, as it had become something of a tradition for Corman to make a cameo appearance in his protégés' films.[8][9] The real Marilyn Lovell appeared among the spectators during the launch sequence.[5] CBS News anchor Walter Cronkite appears in archive news footage and can be heard in newly recorded announcements, some of which he edited himself to sound more authentic.[5]In addition to his brother, Clint Howard, several other members of Ron Howard's family appear in the movie:Brad Pitt was offered a role in the film, but turned it down to star in Se7en.[10] Reportedly, the real Pete Conrad expressed interest in appearing in the film.[5]Jeffrey Kluger appears as a television reporter.[9]","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"William Broyles, Jr. Al Reinert","apollo_13":"Theatrical release poster","Plot":"On July 20, 1969, astronaut Jim Lovell hosts a house party where guests watch on television as Neil Armstrong takes his first steps on the Moon. After the party, Lovell, who had orbited the Moon on Apollo 8, tells his wife Marilyn that he intends to return to the Moon and walk on its surface.On October 30, 1969, as Lovell conducts a VIP tour of NASA's Vehicle Assembly Building, his boss Deke Slayton informs him that he and his crew will fly the Apollo 13 mission instead of Apollo 14. Lovell, Ken Mattingly, and Fred Haise train for their new mission. Days before launch, Mattingly is discovered to have been exposed to rubella, and the flight surgeon demands his replacement with Mattingly's backup, Jack Swigert, as a safety precaution. Lovell initially resists breaking up his team, but relents when Slayton threatens to bump his crew to a later mission. As the launch date approaches, Marilyn has a nightmare about her husband's safety, but goes to the Kennedy Space Center the night before launch to see him off.On April 11, 1970, Apollo 13 Flight Director Gene Kranz gives the go-ahead from Houston's Mission Control Center for launch. As the Saturn V rocket climbs into the sky, an engine on the second stage cuts off prematurely, but the craft reaches its Earth parking orbit. After the third stage re-fires, sending Apollo 13 to the Moon, Swigert docks the Command/Service Module Odyssey with the Lunar Module Aquarius and pulls it away from the spent stage.Three days into the mission, the crew sends a live television transmission from Odyssey, which the networks decline to broadcast live. After Swigert performs a standard housekeeping procedure, one of two liquid oxygen tanks explodes, emptying its contents into space and sending the craft tumbling. The other tank is soon found to be leaking. Mission Control aborts the Moon landing, Lovell and Haise hurriedly power up Aquarius as a \"lifeboat\" for the return home, and Swigert shuts down Odyssey before its battery power runs out. In Houston, Kranz rallies his team to come up with a plan to bring the astronauts home safely, declaring \"failure is not an option\". Controller John Aaron recruits Mattingly to help restart Odyssey for the final return.As Swigert and Haise watch the Moon pass beneath them, Lovell laments his lost chance of walking on its surface, then turns their attention to the business of getting home. With Aquarius running on minimum electrical power, the crew suffers freezing conditions. Swigert suspects Mission Control is unable to get them home and is withholding this from them. In a fit of rage, Haise blames Swigert's inexperience for the accident; Lovell quickly squelches the ensuing argument. When carbon dioxide approaches dangerous levels, an engineering team quickly invents a way to make the Command Module's square filters work in the Lunar Module's round receptacles. With the guidance systems on Aquarius shut down, and despite Haise's fever and the miserable living conditions, the crew succeeds in making a difficult but vital course correction by manually igniting the Lunar Module's engine.Mattingly and Aaron struggle to find a way to power up the Command Module with its limited available power, but finally succeed and transmit the procedures to Swigert, who restarts Odyssey by transferring extra power from Aquarius. Jettisoning the Service Module, the crew finally sees the extent of the damage. They prepare for re-entry, unsure whether Odyssey's heat shield is intact (if it is not, they will be incinerated). They release Aquarius and re-enter the Earth's atmosphere in Odyssey. After a tense, longer-than-normal period of radio silence due to ionization blackout, the astronauts report all is well and splash down in the Pacific Ocean. Recovery helicopters bring the three men aboard the amphibious assault ship USS Iwo Jima.As the astronauts receive a hero's welcome on deck, Lovell's voice-over describes the events that follow their return from space—including the investigation into the explosion, and the subsequent careers and lives of Haise, Swigert, Mattingly, and Kranz—and ends with him wondering when mankind will return to the Moon.","language":"English","box_office":"$355.2 million[2]","cinematography":"Dean Cundey","production_company":"Imagine Entertainment","directed_by":"Ron Howard","Soundtrack":"The score to Apollo 13 was composed and conducted by James Horner. The soundtrack was released in 1995 by MCA Records and has seven tracks of score, eight period songs used in the film, and seven tracks of dialogue by the actors at a running time of nearly seventy-eight minutes. The music also features solos by vocalist Annie Lennox and Tim Morrison on the trumpet. The score was a critical success and garnered Horner an Academy Award nomination for Best Original Score.[18]All music composed by James Horner, except where noted.","References":" This article incorporates public domain material from websites or documents of the National Aeronautics and Space Administration.","release_dates":"June 30, 1995 (1995-06-30) (United States)|||||","Production":"While planning the film, director Ron Howard decided that every shot of the film would be original and that no mission footage would be used.[11] The spacecraft interiors were constructed by the Kansas Cosmosphere and Space Center's Space Works, which also restored the Apollo 13 Command Module. Two individual Lunar Modules and two Command Modules were constructed for filming. While each was a replica, composed of some of the original Apollo materials, they were built so that different sections were removable, which enabled filming to take place inside the capsules. Space Works also built modified Command and Lunar Modules for filming inside a Boeing KC-135 reduced-gravity aircraft, and the pressure suits worn by the actors, which are exact reproductions of those worn by the Apollo astronauts, right down to the detail of being airtight. When the actors put the suits on with their helmets locked in place, air was pumped into the suits to cool them down and allow them to breathe, exactly as in launch preparations for the real Apollo missions.[12]The real Mission Control Center consisted of two control rooms located on the second and third floors of Building 30 at the Johnson Space Center in Houston, Texas. NASA offered the use of the control room for filming, but Howard declined, opting instead to make his own replica from scratch.[5][11] Production designer Michael Corenblith and set decorator Merideth Boswell were in charge of the construction of the Mission Control set at Universal Studios. The set was equipped with giant rear-screen projection capabilities and a complex set of computers with individual video feeds to all the flight controller stations. The actors playing the flight controllers were able to communicate with each other on a private audio loop.[12] The Mission Control room built for the film was on the ground floor.[11] One NASA employee, who was a consultant for the film, said that the set was so realistic that he would leave at the end of the day and look for the elevator before remembering he was not in Mission Control.[5] By the time the film was made, the USS Iwo Jima had been scrapped, so her sister ship, the USS New Orleans, was used as the recovery ship, instead.[11]\"For actors, being able to actually shoot in zero gravity as opposed to being in incredibly painful and uncomfortable harnesses for special effects shots was all the difference between what would have been a horrible moviemaking experience as opposed to the completely glorious one that it actually was.\"Howard anticipated difficulty in portraying weightlessness in a realistic manner. He discussed this with Steven Spielberg, who suggested using a KC-135 airplane, which can be flown in such a way as to create about 23 seconds of weightlessness, a method NASA has always used to train its astronauts for space flight. Howard obtained NASA's permission and assistance in filming in the realistic conditions aboard multiple KC-135 flights.[13]To prepare for their roles in the film, Hanks, Paxton, and Bacon all attended the U.S. Space Camp in Huntsville, Alabama. While there, astronauts Jim Lovell and David Scott, commander of Apollo 15, did actual training exercises with the actors inside a simulated Command Module and Lunar Module. The actors were also taught about each of the 500 buttons, toggles, and switches used to operate the spacecraft.[citation needed]The actors then traveled to Johnson Space Center in Houston, where they flew in NASA's KC-135 reduced-gravity aircraft to simulate weightlessness in outer space. While in the KC-135, filming took place in bursts of 25 seconds, the length of each period of weightlessness that the plane could produce. The filmmakers eventually flew 612 parabolas which added up to a total of three hours and 54 minutes of weightlessness. Parts of the Command Module, Lunar Module, and the tunnel that connected them were built by production designer Michael Corenblith, art directors David J. Bomba and Bruce Alan Miller, and their crew to fit inside the KC-135. Filming in such an environment, while never done before for a film, was a tremendous time saver. In the KC-135, the actors moved wherever they wanted, surrounded by floating props; the camera and cameraman were weightless, so filming could take place on any axis from which a shot could be set up.[citation needed]In Los Angeles, Ed Harris and all the actors portraying flight controllers enrolled in a Flight Controller School led by Gerry Griffin, an Apollo 13 flight director, and flight controller Jerry Bostick. The actors studied audiotapes from the mission, reviewed hundreds of pages of NASA transcripts, and attended a crash course in physics.[11][12] Astronaut Dave Scott was impressed with their efforts, stating that each actor was determined to make every scene technically correct, word for word.[4]","produced_by":"Brian Grazer","starring":"Tom Hanks Kevin Bacon Bill Paxton Gary Sinise Ed Harris","running_time":"140 minutes","music_by":"James Horner","edited_by":"Daniel P. Hanley Mike Hill","Release":"The film was released on 30 June 1995 in North America and on 22 September 1995 in the UK.In September 2002 the film was re-released in IMAX. It was the first film to be digitally remastered using IMAX DMR technology.[19]The film was a box-office success, bringing in $355,237,933 worldwide.[2] The film's widest release was 2,347 theaters.[2] The film's opening weekend and the following two weeks placed it at #1 with a US gross of $25,353,380, which made up 14.7% of the total US gross.[2]Review aggregator Rotten Tomatoes reports that the film has an overall approval rating of 95% based on 85 reviews, with a weighted average score of 8.2/10.[20] At Metacritic, which assigns a normalized 0–100 rating to reviews from mainstream critics, calculated an average score of 77 based on 22 reviews.[21]Roger Ebert of the Chicago Sun-Times praised the film in his review saying: \"A powerful story, one of the year's best films, told with great clarity and remarkable technical detail, and acted without pumped-up histrionics.\"[22] Richard Corliss from Time highly praised the film, saying: \"From lift-off to splashdown, Apollo 13 gives one hell of a ride.\"[23] Edward Guthmann of San Francisco Chronicle gave a mixed review and wrote: \"I just wish that Apollo 13 worked better as a movie, and that Howard's threshold for corn, mush and twinkly sentiment weren't so darn wide.\"[24] Peter Travers from Rolling Stone praised the film and wrote: \"Howard lays off the manipulation to tell the true story of the near-fatal 1970 Apollo 13 mission in painstaking and lively detail. It's easily Howard's best film.\"[25] Movie Room Reviews said \"This film is arguably one of the most dramatic and horrendous spaceflight stories ever told.\"[26]Janet Maslin made the film an NYT Critics' Pick, calling it an \"absolutely thrilling\" film that \"unfolds with perfect immediacy, drawing viewers into the nail-biting suspense of a spellbinding true story.\" According to Maslin, \"like Quiz Show, Apollo 13 beautifully evokes recent history in ways that resonate strongly today. Cleverly nostalgic in its visual style (Rita Ryack's costumes are especially right), it harks back to movie making without phony heroics and to the strong spirit of community that enveloped the astronauts and their families. Amazingly, this film manages to seem refreshingly honest while still conforming to the three-act dramatic format of a standard Hollywood hit. It is far and away the best thing Mr. Howard has done (and Far and Away was one of the other kind).\"[27] The academic critic Raymond Malewitz focuses on the DIY aspects of the \"mailbox\" filtration system to illustrate the emergence of an unlikely hero in late 20th-century American culture—\"the creative, improvisational, but restrained thinker—who replaces the older prodigal cowboy heroes of American mythology and provides the country a better, more frugal example of an appropriate 'husband'.\"[28]Ron Howard stated that, after the first test preview of the film, one of the comment cards indicated \"total disdain\"; the audience member had written that it was a \"typical Hollywood\" ending and that the crew would never have survived.[29] Marilyn Lovell praised Quinlan's portrayal of her, stating she felt she could feel what Quinlan's character was going through, and remembered how she felt in her mind.[4]A 10th-anniversary DVD of the film was released in 2005; it included both the theatrical version and the IMAX version, along with several extras.[30] The IMAX version has a 1.66:1 aspect ratio.[31]In 2006, Apollo 13 was released on HD DVD; on 13 April 2010, it was released on Blu-ray disc as the 15th-anniversary edition, on the 40th anniversary of the Apollo 13 accident.[30]","budget":"$52 million[1]","Technical and historical accuracy":"The film depicts the crew hearing a bang quickly after Swigert followed directions from mission control to stir the oxygen and hydrogen tanks. In reality, the crew heard the bang 93 seconds later.[34]The film portrays the Saturn V launch vehicle being rolled out to the launch pad two days before launch. In reality, the launch vehicle was rolled out on the mobile launch platform using the crawler-transporter weeks before the launch date.The movie depicts Swigert and Haise arguing about who was at fault. The show The Real Story: Apollo 13 broadcast on the Smithsonian Channel includes Haise stating that no such argument took place and that there was no way anyone could have foreseen that stirring the tank would cause problems.[35]The dialogue between ground control and the astronauts was taken nearly verbatim from transcripts and recordings, with the exception of one of the taglines of the film, \"Houston, we have a problem.\" (This quote was voted #50 on the list \"AFI's 100 Years... 100 Movie Quotes\".) According to the mission transcript, the actual words uttered by Jack Swigert were \"Hey, we've got a problem here\" (talking over Haise, who had started \"Okay, Houston\"). Ground control responded by saying \"This is Houston, say again please.\" Jim Lovell then repeated, \"Houston, we've had a problem.\"[36]One other incorrect dialogue is after the re-entry blackout. In the movie, Tom Hanks (as Lovell) says \"Hello Houston... this is Odyssey... it's good to see you again.\" In the actual re-entry, the Command Module's transmission was finally acquired by a Sikorsky SH-3D Sea King recovery aircraft which then relayed communications to Mission Control. CAPCOM and fellow astronaut Joe Kerwin (not Mattingly, who serves as CAPCOM in this scene in the movie) then made a call to the spacecraft \"Odyssey, Houston standing by. Over.\" Jack Swigert, not Lovell, replied \"Okay, Joe,\" and unlike in the movie, this was well before the parachutes deployed; the celebrations depicted at Mission Control were triggered by visual confirmation of their deployment.[37]The tagline \"Failure is not an option\", stated in the film by Gene Kranz, also became very popular, but was not taken from the historical transcripts. The following story relates the origin of the phrase, from an e-mail by Apollo 13 Flight Dynamics Officer Jerry Bostick:A DVD commentary track, recorded by Jim and Marilyn Lovell and included with both DVD versions,[30] mentions several inaccuracies included in the film, all done for reasons of artistic license:\"We were working and watching the controls during that time. Because we came in shallow, it took us longer coming through the atmosphere where we had ionization. And the other thing was that we were just slow in answering.\""}