{"country":"United States","dude,_where's_my_car?":"Theatrical release poster","distributed_by":"20th Century Fox","Legacy":"Dude, Where's My Car? is referenced widely in many different situations. Some examples are listed below.Author and filmmaker Michael Moore published a book titled Dude, Where's My Country?, criticizing the United States' response to 9/11.In 2012, the Pittsburgh Pirates started using the \"Zoltan\" hand signal from the film as a way for players to congratulate their teammates after an accomplishment such as a home run or a double play. The habit started after the Pirates (in particular Neil Walker) were watching Dude, Where's My Car? in the visiting clubhouse at Turner Field in Atlanta during an April 2012 weekend series against the Atlanta Braves.[10] After a Twitter campaign to encourage the \"real\" Zoltan to appear at a game, Hal Sparks flew to Pittsburgh on July 25, 2012 to throw out the ceremonial first pitch, and was on hand to see the Pirates win 3–2 over his hometown team, the Chicago Cubs. Also there to support the team was Hal's girlfriend, Summer Soltis, whose family is from the area and are Pirates fans themselves.[11] Despite picking up a cult following in Pittsburgh[12] and helping the team contend in the playoff race well into September, the Pirates finished with a 79–83 record, extending their major North American professional sports record to 20 consecutive losing seasons.","Plot":"Jesse and Chester awaken with hangovers and no memory of the previous night. The television is on, showing an Animal Planet program about how animals use twigs and rocks as tools to get food. Their refrigerator is filled with containers of chocolate pudding, and the answering machine contains an angry message from their twin girlfriends Wilma and Wanda as to their whereabouts. They emerge from their home to find Jesse's car missing, and with it their girlfriends' one-year anniversary presents. This prompts Jesse to ask the film's titular question: \"Dude, where's my car?\"Because the girls have promised them a \"special treat\", which Jesse and Chester take to mean sex, the men are desperate to retrieve their car. The duo begins retracing their steps in an attempt to discover where they left the car. Along the way, they encounter a transgender stripper, a belligerent speaker box operator at a Chinese restaurants drive-through, discover two appropriately-worded tattoos on each other's backs, run into UFO cultists led by Zoltan, a Cantonese-speaking Chinese tailor, the Zen-minded Nelson and his cannabis-loving dog, the aggressive jock Tommy and his friends, a couple of hard-nosed police detectives, and a reclusive French ostrich farmer. They also meet two groups of aliens, one group being five gorgeous women, the other being two Norwegian men, searching for the \"Continuum Transfunctioner\"; a mysterious and powerful device, capable of destroying the universe, that the boys accidentally picked up last night.In an arcade, they discover that the Continuum Transfunctioner was a Rubik's Cube that Chester has been working hard to solve, and eventually does (thus activating it). They are warned that once the five lights stop flashing, the universe will be destroyed.Jesse and Chester must determine which of two sets of aliens is entitled to the device. One of the groups is there to protect the universe, the other is there to destroy it. Both claim to be the protectors of the universe, stating that they were with Jesse and Chester the previous night (which Jesse and Chester still cannot remember) and ask for the Transfunctioner. The two correctly choose the men, because when the men were asked what they did the night before, they correctly respond that they got a hole in one at the 18th hole at a miniature golf park, and won a life time supply of pudding. At the last second, they deactivate the Transfunctioner, saving the universe.Balked, the five alien women merge to become a giantess (Jodi Ann Paterson) who swallows Tommy alive. The giantess then crawls out of the amusement centre and chases Jesse and Chester. The cultists tell them to activate the Photon Accelerator Annihilation Beam on the Transfunctioner. However, the button that activates it is too far in to reach. At the last second, Chester remembers the nature show with the tool-using chimps and uses a straw to push the recessed button, thus destroying the alien. The protectors erase everyone's minds concerning the events and time is reversed to the beginning of the film. The duo recover the car, a Renault Le Car, which turned out to be behind a Mail Truck the whole time, and salvage their relationships and discover the special treat from the girls turns out to be matching knitted caps and scarves. The protectors leave a gift for their girlfriends (and, for the two men): Breast Enhancement Necklaces.","language":"English","box_office":"$73.2 million[2]","cinematography":"Robert M. Stevens","production_company":"Alcon Entertainment","directed_by":"Danny Leiner","release_dates":"December 15, 2000 (2000-12-15)|||||","Cancelled sequel":"A sequel titled Seriously Dude, Where's My Car? was in development for years, but never came to be. The first movie was a breakthrough role for Ashton Kutcher, allowing him to transition from That '70s Show to movie stardom. The sequel was scheduled to begin filming in 2003. Seann was interested in the sequel, but Kutcher shot the idea down before filming could begin.","produced_by":"Gil Netter","starring":"Ashton Kutcher Seann William Scott Jennifer Garner Marla Sokoloff Kristy Swanson Hal Sparks","running_time":"82 minutes","music_by":"David Kitay","edited_by":"Kimberly Ray","Release":"Dude, Where's My Car? received negative reviews from critics. Rotten Tomatoes reports that 18% of critics gave the film a positive review, based on 55 reviews, with the consensus stating, \"The movie isn't funny, the plot is too thin, and the production values feel more like a TV sitcom than a movie.\"[3] The review aggregator Metacritic gave the film a score of 30, based on 17 reviews.[4] The BBC Film review gave it 1 star, calling the film \"a lame-brained travesty\" and \"intensely irritating\" and Kutcher and Scott's routines \"painfully unamusing\".[5] The Austin Chronicle concluded, \"Dude, Your Movie Sucks\". USA Today said: \"Any civilization that can produce a movie this stupid probably deserves to be hit by famine and pestilence.\" The Chicago Tribune said: \"At the end of 83 unmerciful minutes, audiences will be exclaiming, 'Dude, I can't believe I sat through that movie!?'\" and the New York Post said that it was: \"An almost chuckle-free mess, so amateurish and lame that the cast often has that embarrassed look you see on dogs given ridiculous haircuts.\"[4] However, the New York News did praise the \"surprisingly sweet-natured pairing\" of Kutcher and Scott.[6]Despite the negative reviews, the film opened at #2 at the North American box office making US$13.8 million in its opening weekend behind What Women Want, which opened at the top spot with US$33 million.[7] It's overall gross came to US$46 million off of an estimated US$13 million budget. [8]The DVD was released on June 26, 2001 with 7 deleted and extended scenes, an audio commentary with Kutcher, Scott, and Leiner, a behind-the-scenes featurette, the music video for Grand Theft Audio's \"Stoopid Ass\", TV spots, and the theatrical trailer.On TV in the USA, when Jesse and Chester first see Christie Boner, they say her name, but when they get to \"Bon-\", the words are cut and the shot moves to Christie.[9]","written_by":"Philip Stark","budget":"$13 million[1]"}