{"a_dark_truth":"Theatrical release poster","country":"Canada|United States|","distributed_by":"Magnolia Pictures","Plot":"The film begins with Francisco Francis (Forest Whitaker) running in the jungle with his family while soldiers are shooting and killing people around them. The scene changes to an office building where Tony Green (Steven Bauer) is speaking to Bruce (Kim Coates) in Clearbec corporate offices telling him that Francisco had broken into the local offices and stolen their files. As he converses with Bruce, he orders Renaldo (Devon Bostick), a young aide in his office, to hurry. Renaldo and Tony leave the local offices amid gunfire and chaos, but pause when a woman shouts at Renaldo. She is his mother; she is shot and killed by soldiers as Renaldo looks on. Tony shows his corporate ID to the soldiers and pulls Renaldo into his car. As they attempt to leave the city, they stop at a road block and watch soldiers gun down an unarmed man. Renaldo jumps out of the car and escapes the carnage.The scene changes to Jack Begosian (Andy García) speaking to call-ins on his radio program in Toronto, Canada, discussing his pessimism about the government and his faith in the goodness of humankind. He points out that water is not a commodity to be bought or sold and is questioned about his former service in the CIA.As Jack drives to his home in the remote Canadian forest, Morgan (Deborah Kara Unger) sits shivering in her tub. Later, she goes to a hospital ribbon cutting ceremony where Renaldo confronts her as she gets into her limo, accusing Clearbec of murder and telling her his message is in the car. He shoots himself. Stunned and traumatized, she listens to a tape he left for her recording the gunshots and screams. He tells her that Francisco stole papers proving that Clearbec was involved in a typhus outbreak. The scene switches to Francisco and his family hiding in the jungle as General Aguilla hunts for them. He and his wife, Mia (Eva Longoria) argue briefly about leaving the dead behind. Francisco kills a soldier who pursues them. Renaldo reports that the soldiers got sick and began to execute everyone. Mia hands Francisco a gun and takes a rifle, using it shortly after to shoot another pursuing soldier. (Cuts away briefly to Jack explaining to a caller that he quit the CIA because he stopped believing the lies).At corporate headquarters, Tony and Bruce argue about General Aguilla's murder of civilians and Bruce orders Tony to do damage control and keep the carnage a secret. Morgan questions her brother, Bruce about what happened in Ecuador. He tells her that Renaldo was an anti-government reporter and nutcase. She tells him about the tape and asks again about what happened. He dismisses her concerns and tells her to go to lunch and do fund raisers and bad marriages. He tells her to go home. Doug, an assistant, enters the office and tells Bruce that the secret will be kept but that Morgan is a problem.","language":"English","Reception":"The film received negative reviews. On Rotten Tomatoes, A Dark Truth holds a rating of 8%, based on thirteen reviews.[4] Metacritic gave the film the 31%, sampled from six critics.[5]A Dark Truth grossed $5,750 in North America.[1]","box_office":"$5,750 (US)[1]","cinematography":"Bobby Shore","production_company":"Vortex Words Pictures","directed_by":"Damian Lee","release_dates":"September 19, 2012 (2012-09-19) (Boston Film Festival)|January 4, 2013 (2013-01-04) (United States)||||","Production":"Filming started in October 2011 and took place on location in Canada, shooting in North Bay, Ontario, Sudbury and Toronto. The film was also shot in the Dominican Republic.[2][3]","produced_by":"Gary Howsam|Bill Marks|","starring":"Andy García|Kim Coates|Deborah Kara Unger|Eva Longoria|Forest Whitaker|","running_time":"106 minutes","music_by":"Jonathan Goldsmith","edited_by":"William Steinkamp","written_by":"Damian Lee"}