{"country":"United States","Awards and nominations":"Howard Shoup was nominated for the Academy Award for Best Costume Design, Black and White but lost to Julie Harris for Darling.","distributed_by":"United Artists","Plot":"The sexual helplessness of newspaper heiress Grace Caldwell (Suzanne Pleshette) threatens to destroy the reputation of her staid, wealthy Pennsylvania family. As a precocious teenager, she is assaulted in her room in her own house, and violated by her older brother Brock's friend Charlie Jay (Mark Goddard). This initiates a compulsion to agree unconditionally to the advances of men. She nearly never makes the first step herself.After a series of meaningless dalliances with strange men in cheap motel rooms, she meets San Francisco real estate broker Sidney Tate (Bradford Dillman) at a Christmas party. The two fall in love and he proposes marriage, prompting Grace to confess about her past. Despite being taken aback by her candid revelations, Sidney still wants to marry her, and she commits herself to a monogamous relationship, a pledge she keeps for the first few years of their union, which produces a son and a seemingly idyllic life on a farm.Problems ensue when lusty contractor Roger Bannon (Ben Gazzara), the son of one of her mother's former servants, arrives to repair their barn and seduces Grace. When she eventually tries to end the affair, he becomes enraged, gets drunk, and accidentally crashes his truck, killing himself. Reports of his death include details about his tryst with Grace, prompting her husband to wonder if she is also involved with newspaper editor Jack Hollister (Peter Graves). The suspicion is shared by Jack's wife Amy (Bethel Leslie). She starts a scene with Grace, who tries to bring her in a more private room to talk. Amy refuses, and brandishes a gun. She confronts Grace publicly at the charity event, and attempts suicide. Finally she breaks down and Sidney is once more convinced that his wife has lied to him. Sidney tells her that he will take his son and leave her. Grace runs after him, swearing that she had nothing with Jack Hollister, and that she had already told Banner that it was over. Still, Sidney departs, leaving her alone.","language":"English","Critical reception":"Variety said, \"In this banal transfer from tome to film, the characters in John O'Hara's A Rage to Live have retained their two-dimensional unreality . . . Nympho heroine goes from man to man amidst corny dialog and inept direction which combine to smother all thesps.\" [1]TV Guide rates it 1½ out of a possible four stars and adds, \"In the transfer from novel to screen, O'Hara's characters have been transformed from vital, living personalities into stiff, unmotivated soap opera fodder.\" [2]","a_rage_to_live":"Original poster","cinematography":"Charles Lawton, Jr.","directed_by":"Walter Grauman","release_dates":"1965 (1965)|||||","produced_by":"Lewis J. Rachmil","starring":"Suzanne Pleshette Bradford Dillman Ben Gazzara","running_time":"101 minutes","music_by":"Nelson Riddle","written_by":"John O'Hara (novel) John T. Kelley"}