{"absolutely_anything":"UK theatrical release poster","country":"United Kingdom[2]","distributed_by":"Lionsgate UK","Plot":"Decades after being launched into space, a space probe containing information about the human race and a map to earth is found by four aliens that make up the 'Galactic council'. They debate on whether to destroy the earth or make humanity a member of the council, instead relying on 'Standard galactic protocol' to decide. They will give one Human (Chosen at random) the ability to do absolutely anything they want. After ten days, if the powers have been used for good, the Aliens will spare earth and make humanity a member of the council. If the powers are used for evil, the earth will be destroyed for the moral improvement for the galaxy.The human is chosen and revealed to be Neil Clarke (Simon Pegg) a secondary school teacher who is both struggling with his jobsworth headmaster, Mr Robinson (Eddie Izzard) and with his lack of a girlfriend, although he has a crush on author agency employee, Catherine West (Kate Beckinsale), who lives underneath him in the apartment block. At first, oblivious to the powers he has, Neil accidentally causes an alien spaceship to destroy a classroom within the school, killing the entire class in the process. The galactic council scolds the alien that blew up the classroom, who responds by saying that out of the millions of species the council has evaluated, none have ever passed and have all been destroyed.Perplexed and anxious, Neil goes home and slowly realises he can do anything after causing his dog, Dennis' waste to clean itself up, and causing spilt whisky to flow out of the drain and back into the bottle. He asks that \"everyone who died come back to life\" and unknowingly causes everyone who has ever died ever to be resurrected, resulting in a zombie apocalypse, he reverses this and asks that the explosion never happened, sending himself back in time to the previous day. He then confirms his suspicions by causing the PE teacher Miss Pringle (Emma Pierson) to worship his friend, Ray (Sanjeev Bhaskar) whereas before, she was repulsed by him.Over the coming days, Neil uses his power for personal gain by giving himself a more muscular body, increasing his penis size, making Mr Robinson be nice to him and giving Dennis the ability to speak (Voice of Robin Williams). One night, The galactic power the aliens possess fails momentarily, meaning Neil cannot do anything, this happens just as Neil asks that Catherine be madly in love with him, and coincidently a drunk Catherine knocks at his door at that moment, after being encouraged to sleep with Neil by a friend. They spend the night together as a result and are seen by Colonel Grant (Rob Riggle), an American military soldier who has been stalking Catherine.The next day, Catherine goes to Neil's apartment to speak to him, Dennis shouts from the Kitchen that he loves Neil and he should \"Shag the Bitch!\", disgusted and now thinking that Neil is gay, Catherine storms out with Neil chasing after her. Ray appears and states that Miss Pringle doesn't worship him romantically, she actually thinks he is a god and has formed a religion based on him. That night, Catherine returns home to find Colonel Grant waiting in her apartment for her, and she locks him in. Neil appears and offers to cook dinner for her, which she accepts. Grant crashes the meal and Catherine storms out due to the two fighting, Neil incapacitates Grant by breaking then fixing his arm and then convinces Grant that he has powers. Grant knocks Neil unconscious and kidnaps him and Dennis, when Neil wakes up, Grant forces him to grant a list of selfish and pointless wishes, threatening to shoot Dennis if Neil refuses.Catherine and Ray track Neil down to the apartment Grant is renting and rescue Neil, but not before Neil makes Catherine fall madly in love with Grant. When free, Neil reverses all of the wishes he granted Grant and also stops Miss Pringle from worshipping Ray. Upon getting home, Catherine angrily tells Neil that she could never love anyone who could make her do whatever they wanted, whenever they wanted to do it. Disheartened, Neil decides to use his powers to solve the world's problems, he gives everyone in the world as much food as they want, he gives everyone in the world their own dream house, and removes any reason for anyone to go to war.However, this soon backfires when worldwide obesity rates rise, every piece of uninhabited land in the world is developed on, and several countries declare war on each other for no reason at all. Disillusioned, Neil goes to the London Bridge with the intention of committing suicide, but as he jumps into the River Thames, Dennis jumps in after him and Neil is forced to swim them both out of the river. Sitting on a bench on Hampstead Heath overlooking London, Dennis says that Neil should give the power to him, as he never thinks of anything selfish and he loves taking orders, which Neil happily does.Meanwhile, the aliens finish their evaluation and decide that the earth is not worthy, revealing that they view greedy and evil acts as strong and thoughtful acts as weak. They therefore decide to destroy the earth, but just before they can, Dennis asks that the source of the power be destroyed. Causing a laser beam shooting towards earth to bounce back to the alien's ship, killing them all and destroying the galactic power. Full of confidence and excitement for not having the powers any more, he asks Catherine out, which she agrees to.","language":"English|French|","Reception":"On Rotten Tomatoes, the film received a 13% rating based on 31 reviews; the average rating is 3.3/10.[19] At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film received an average score of 34 based on six reviews, indicating \"generally unfavorable reviews\".[20] Peter Bradshaw, writing in The Guardian awarded the film 1/5 star, and said \"cheap and cheerless sci-fi comedy. There’s a blue-chip cast here, and it’s directed by Terry Jones; the Pythons have cameos, as creepy alien creatures. But this low-budget Brit film is just depressing, a sub-Douglas Adams sci-fi comedy which looks like mediocre kids’ TV with a dismal script and cheap’n’cheerless production values. A huge amount of talent here. Sadly it goes nowhere.\"[21] James Mottram, writing for The List, also awarded the film 1 star, and said \"Simon Pegg and Kate Beckinsale head up an awful sci-fi comedy from Terry Jones. It’d be very sad if this is the last Python collaboration to hit screens.\"[22]","box_office":"$3.8 million[3]","cinematography":"Peter Hannan","directed_by":"Terry Jones","production_companies":"Bill and Ben Productions GFM Films Premiere Picture","Music":"Australian singer Kylie Minogue recorded and released a promotional single, \"Absolutely Anything and Anything At All\", for the soundtrack. A music video was released on Minogue's official YouTube channel.[17]","release_dates":"14 August 2015 (2015-08-14)|||||","Production":"In a March 2014, interview with Empire, Terry Jones spoke about the plot of the film. He described it as being about Neil, a teacher in a failing secondary school, who is given the ability to make anything happen by asking it to. He only realizes he has this after saying \"I'd make an alien spaceship hit class 10C and vaporize them\" to a colleague, only to hear an explosion elsewhere in the school and find 10C's classroom destroyed.[8]Jones credited the film's idea to the H. G. Wells story \"The Man Who Could Work Miracles\", but said that it \"just changed out of all recognition from that\".[8] He also explained that the script for the film has been around for 20 years, saying: \"I just think it's my own baby really. But I wrote it with Gavin Scott, and we've been writing it for 20 years, then Mike Medavoy rang up in 2010 or so and asked what scripts I had hidden in my bottom desk drawer. So I pulled out Absolutely Everything – not literally, of course – and here we are.\"[8] He also spoke about the character Dennis the Dog, saying: \"I think he's going to steal the show. We've got a real dog, Mojo, who is very obedient, and a wonderful dog, a mongrel, but CGI work will be done. Simon Pegg is a big dog fan, and him and Mojo get on very well. Before Douglas Adams died, he looked over the script and he said that Dennis the Dog's scenes were the funniest scenes...\"[8] He also spoke about the designs of the alien characters, saying: \"James Acheson is doing the costumes, and he has already got a wonderful array of aliens of different sizes and shapes. The story behind the aliens is they intercept the Voyager space craft as it leaves the solar system [and] comes into intergalactic space – well, it isn't really intergalactic space, but we pretend it is, anyway – and they say they have to assess one Earthling at random by giving them these powers. They pick Neil.\"[8]On 14 September 2010, the film was first announced, and it was also announced that John Oliver, Robin Williams, John Cleese, Michael Palin, and Terry Gilliam were cast in the film,[9] with Eric Idle announced as joining his fellow Pythons on 20 February 2014.[7] In January 2012, it was announced that film would begin filming in spring 2012.[10] On 11 December 2013, Simon Pegg was cast as the lead character Neil Clarke.[11] On 26 February 2014, Kate Beckinsale was cast in the film.[12] On 19 March 2014, Rob Riggle was cast in the film.[13]Principal photography and production began on 24 March 2014, and ended on 12 May 2014.[14][15] Director Jones said \"It was 6 weeks shoot [sic] and it was shot in London. We took over a disused school in Hornsey Lane, which is not far from my house. We built the studios in there and used it as a base. Then, we shot the interiors of the flats in Earl’s Court.\"[16] On 28 March 2014, it was announced that Lionsgate UK would distribute the film in the United Kingdom.[6]","produced_by":"Bill Jones|Ben Timlett|","starring":"Simon Pegg|Kate Beckinsale|Sanjeev Bhaskar|Rob Riggle|Eddie Izzard|Joanna Lumley|Terry Jones|John Cleese|Terry Gilliam|Michael Palin|Eric Idle|Robin Williams|","running_time":"85 minutes[1]","music_by":"George Fenton","edited_by":"Julian Rodd","Release":"The film was released in the United Kingdom on 14 August 2015, by Lionsgate UK.[18]","written_by":"Terry Jones|Gavin Scott|"}