{"country":"United States","distributed_by":"New Line Cinema","screenplay_by":"Hugh Wilson Bill Kelly","story_by":"Hugh Wilson","Plot":"In 1962, Dr. Calvin Webber (Christopher Walken), an eccentric scientist who, like so many people at the time, thinks that a nuclear war between the U.S. and the Soviet Union is imminent, has built a large, fully functional fallout shelter in his backyard deep underground. During the Cuban Missile Crisis, thinking the conflict could escalate, Calvin takes his pregnant wife Helen (Sissy Spacek) into the fallout shelter as a precaution. When a fighter jet flying over loses control, the pilot bails out and the plane crashes into their house, causing intense heat; Calvin, thinking the worst has happened, sets and activates the shelter's locks (designed not to open for 35 years). Everyone assumes the entire family was killed in the accident, as no one knew of Calvin's secret fallout shelter.Calvin's wife Helen gives birth to a boy, whom they name Adam (Brendan Frasier). Adam grows up being taught and exposed to all culture up to 1962, such as watching reruns of The Honeymooners and listening to Perry Como and Dean Martin. When the locks open in 1999, Calvin is so shocked to see how the world has changed (believing it to be a post-apocalyptic wasteland populated by irradiated mutants), he decides the family must stay underground. However, their supplies are running out, so Adam must venture onto the surface to procure more.Adam meets Eve Rustikoff (Alicia Silverstone) when he tries to sell his father's classic baseball cards at a hobby shop. She stops the store owner from trying to buy the cards for much less than their collectible value and is immediately fired. Adam asks Eve to drive him to a Holiday Inn in exchange for a baseball card; she takes the card and leaves, but returns the next morning to return it. When Eve mentions that she must find a new job, Adam asks her to help him purchase supplies and, unaware of the value of money, immediately agrees to her request for $1,000 a week. He also asks Eve to help him find a wife from Pasadena, California (per his mother's advice), who is \"not a mutant\"; he uses the term literally, but she mistakes it for the modern slang usage. Adam meets Eve's gay housemate and best friend, Troy (Dave Foley), who is amused by Adam's naiveté but offers advice and gives Adam a fashion makeover.Eve and Troy take Adam to a swing-style nightclub to find him a wife. Adam immediately attracts the attention of several women, including Eve's flirtatious rival, Sophie (Carmen Moré). Eve becomes jealous and reconnects with her ex-boyfriend Cliff (Nathan Fillion), but leaves after Cliff goads Adam into an altercation. Troy later returns home alone, and explains to Eve that Adam went home with Sophie. Adam returns later, explaining that he politely rejected Sophie's advances. He and Eve kiss, but when Adam tells her the truth about his past and states that he wants to take her to be his wife \"underground\", she asks him to leave. When he returns the next day, Eve is waiting with a team of mental health professionals to have him committed. He sadly cooperates at first, but escapes as they leave the house, asking that Eve and Troy collect his things for him and pay his hotel bill. Troy and Eve find toiletries and clothing manufactured in the early 1960s, as well as absurdly valuable stocks in companies like IBM, and realize that Adam was telling the truth. They track him down and reunite.Adam tells his parents that he and Eve can't stay in the shelter. He asks them to set the lock timer for two months, during which time he and Eve use the money from selling the stocks to build his parents a new home in the country, identical to the home that was destroyed. When they are settled in, Adam lets Calvin know that the truth about the airplane crash; Calvin takes the news stoically, telling Adam not to mention this to Helen, and after Adam walks away he mutters \"Commies...\" to himself and begins measuring the space in the backyard, beginning work on a new fallout shelter.","language":"English","Reception":"The film received mixed reviews from critics. On Rotten Tomatoes, the film had an overall score of 58% of the comments positive based on 78 reviews.[1] On Metacritic has a score of 48%. Roger Ebert gave the film 3 out of 4 stars saying \"the movie is funny and entertaining in all the usual ways, yes, but I was grateful that it tried for more: that it was actually about something, that it had an original premise, that it used satire and irony and had sly undercurrents.\"[2]Blast from the Past opened in North American theaters on February 12, 1999 and took in $7,771,066 earning it 5th place at the box office for the weekend.","box_office":"$40,263,020","cinematography":"José Luis Alcaine","directed_by":"Hugh Wilson","blast_from_the_past":"Theatrical release poster.","release_dates":"February 12, 1999 (1999-02-12)|||||","produced_by":"Hugh Wilson Amanda Stern Renny Harlin","starring":"Brendan Fraser Alicia Silverstone Christopher Walken Sissy Spacek Dave Foley","running_time":"112 minutes","music_by":"Steve Dorff","edited_by":"Don Brochu","budget":"$35 million"}