{"country":"Pakistan","bin_roye":"Theatrical release poster","Plot":"The film starts by introducing Saba Shafiq (Mahira Khan) and Irtaza’s (Humayun Saeed) relationship, who are cousins. Saba is hopelessly in love with Irtaza, but he treats her like his best friend, not a love interest. Irtaza then leaves for the US for two years, where he meets Saman Shafiq (Armeena Khan), who is his cousin and falls in love with her. Saman is Saba’s elder sister, and she was given to her uncle and aunt as a child. Saman’s foster parents die in a plane crash which was headed to Germany, and Irtaza brings her back to Pakistan. Upon learning she has an elder sister, Saba is at first overjoyed, but her happiness quickly turns to disdain when she finds out that Irtaza and Saman are in love and are to be married.Later, Irtaza and Saman come to Karachi with their son Maaz. On Maaz's birthday, Saman plans to get a birthday cake and some flowers for her mother. However, tragedy occurs as Saman is hit by a car in front of Saba (who once prayed to God that Saman should die, because she wanted to marry her cousin, Irtaza and hated the fact, her sister is getting married to him). Irtaza calls the ambulance, and they take her to the hospital, however, Saman dies in the ambulance. Before dying, she whispers in Saba's ears that both Irtaza and Maaz are now hers. Meanwhile, as Maaz is a child in need of a mother's love, Saba's grandmother suggests to her parents that she should marry her cousin, Irtaza. Saba doesn't agree, and says yes to marrying someone else. On her wedding day Irtaza finds out that Saba's family is unaware that the man she's marrying is already married and has a son. Irtaza gets very angry and confronts Saba, who cries and tells him that it's too late to stop the wedding now since they are actually at the wedding. However, Irtaza drags her to their family and tells them the truth. Their family is shocked and they decide Saba should not marry that guy. Then, to the surprise of everyone present, Irtaza announces that he will marry his cousin, Saba. Saba has a difficult time accepting her marriage and was in trauma that she might be the cause of saman's death, but after a dramatic turn of events finally Irtaza came to know the whole story and recognized the love of saba, and declares his love for her. The movie ends with Irtaza and Saba finally together, and finally happy.","language":"Urdu","Reception":"Mike McCahill of The Guardian termed the film a soppy vortex and gave Bin Roye 2 stars.[35] Ujala Ali Khan of The National gave Bin Roye 4 stars and praised the film.[36] Bindu Rai of Emirates 24/7 praised Mahira Khan's performance but termed 'Bin Roye' as a sob fest.[37] Nadia Lewis of Gulf News also praised the film.[38] Maliha Rehman of The Dawn also praised the film.[39] Amna Omer of The Nation praised Bin Roye despite its flaws and gave it 3.5 stars.[40] Sidra Rizvi of Aaj News also praised the film.[41] Maliha Rehman of DAWN.com reviewed film as \"Bin Roye as a desi version of a chick flick. But it’s a good one and interesting enough for even men to sit through it.\"[42]Sameeksha Dandriyal of IBN Live praised Mahira Khan for her intense acting but termed Bin roye an average film and gave it 2.5 stars out of 5.[43] Aneela Zeb Babar of Desimartini.com (a Hindustan Times group's website) gave the film 2 stars.[44]Rafay Mahmood of The Express Tribune also praised Bin Roye.[45] Zia of Sabz Irtiqa praised the film for its music and wrote \"it’s the Mahira Khan Show from 1st frame till the end.[46] Anisha Jhaveri of India.com too praised the film terming it as a ray of hope for the Pakistan's film industry.[47]Bin Roye had grossed ₨7 crore (US$690,000) worldwide in first four days. Bin Roye grossed ₨2.3 crore (US$230,000) in first three days in Pakistan.[21][23] Film took a very good opening and collected ₨0.425 crore (US$42,000) on Day One.[48] Film saw big growth on Day Two as film collected ₨0.6 crore (US$59,000) taking two days total to ₨1.03 crore (US$100,000). Film saw houseful shows at Super Cinemas, Cinestar and Conegold as film recorded 90-95 % occupancies at big metros and overall 75+% occupancies which is a very good result.[49] Film shew further growth on Eid Day 3 as film grossed ₨0.72 crore (US$71,000) taking Eid Weekend total to ₨1.75 crore (US$170,000).[50] On Tuesday film benefited from Holiday as film collected ₨0.63 crore (US$62,000) and then on Wednesday film had minimal fall despite working day as film netted ₨0.58 crore (US$57,000) taking 5 Days total to ₨2.96 crore (US$290,000), and [51] subsequently ₨3.56 crore (US$350,000) in the first Eid week.[52][53][54] Film managed big in 2nd Weekend as there was a growth of 15% over Eid Weekend and film collected ₨2 crore (US$200,000) taking grand to ₨5.56 crore (US$550,000).[55] Bin Roye grossed 417k £ (6.67 crore) at U. K. Box Office at the end of its third weekend.[56]","box_office":"Rs30.75 crore($3.0 million) (worldwide)[3]","cinematography":"Farhan Alam","production_company":"MD Films","directed_by":"Momina Duraid Shahzad Kashmiri","Music":"Bin Roye's soundtrack received positive reviews from critics and the public alike. The song \"Balle Balle\" was on the top of the charts on the Bollywood song website \"Saavn\" for a week.","release_dates":"July 18, 2015 (2015-07-18) (Pakistan and internationally)|August 7, 2015 (2015-08-07) (India)||||","Production":"Bin Roye was developed by Hum TV's senior producer Momina Duraid of MD Productions, Duraid choose Shehzaad Kashmiri along with herself to direct the film.[16] Story of film is based on Farhat Ishtiaq's novel, Bin Roye Ansoo. Screenplay is also written by Ishtiaq, while cinematography is done by Farhan Alam. Song composition is done by Shiraz Uppal, Sahir Ali Bagha, Shani Arshad and Waqr Ali. Two songs in the film have been directed by Sarmad Sultan Khoosat, Asim Raza and Haissam Hussain.[17]Producer Momina Duraid choose Mahira Khan,[18] along with Humayun Saeed and Armeena Rana Khan to portray the leading roles, however Zeba Bakhtiar, Javed Sheikh and Azra Mehmood were selected to portray supporting roles.[19] Mahira Khan, after her success in Humsafar, Shehr-e-Zaat and Bol, was selected to portray the role of Saba. Khan continued with her film Raees and managed to work for Bin Roye. Humayun was selected to portray the role of main lead, Irtiza while Armeena Khan, after completing her television series Karb, joined the shoot.Filming of began in 2014 and was completed in the late March 2015. The film premiered in July 2015, after the completion of filming. Teasers were released in late April which were heavily praised for their shooting and cast while music was released in June 2015. Shooting was extensively done in Karachi, with some chunks being shot in parts of California, USA.","TV series":"There would also be a television series titled Bin Roye Ansoo, also starring Mahira Khan and based on the novel of same name by Farhat Ishtiaq.[57]","produced_by":"Momina Duraid","starring":"Mahira Khan|Armeena Khan|Humayun Saeed|","running_time":"120 minutes","music_by":"Mazhar Cheema Shani Arshad Waqar Ali","edited_by":"Tanveer","Release":"Bin Roye, made at a budget of ₨3.5 crore (US$340,000),[1][2] released in more than 400 screens worldwide on Eid-ul-Fitr, 18 July 2015 [20] under the banner of Hum Films in Pakistan[19] and under B4U Films in international markets excluding Pakistan and the Middle-East.[21] Bin Roye released in more than 10 countries including; the United States, the United Kingdom, Canada, Middle East, and United Arab Emirates on 19 July 2015.[22] Bin Roye initially released in 83 screens in Pakistan but later increased to 89 screens after first two days.[23] Bin Roye was initially set to screen on 60 screens in India,[24][25][26] but it was deferred in the state of Maharashtra because of Maharashtra Navnirman Chitrapat Karmachari Sena's protest.[27][28][29] Bin Roye also faced release issue in Kolkata, India.[30] Bin Roye released in India in 81 screens on 7 August 2015,[31] making it biggest release ever for Pakistani film in India.[21][32][33][34]","written_by":"Farhat Ishtiaq","budget":"₨3.5 crore (US$340,000) [1][2]"}