{"based_on":"City of God  by Paulo Lins","Cast":"Many characters are known only by nicknames. The literal translation of these nicknames is given next to their original Portuguese name; the names given in English subtitles are sometimes different.","country":"Brazil","distributed_by":"Miramax Films","screenplay_by":"Bráulio Mantovani","Plot":"Chickens are being prepared for a meal. A chicken escapes, and an armed gang chases after it in a favela called the Cidade de Deus (\"City of God\"). The chicken stops between the gang and a young man named Rocket (Buscapé), who believes the gang wants to kill him. A flashback traces Rocket, the narrator, back to the late 1960s.In the 1960s, the favela is a newly built housing project far from the centre of Rio de Janeiro, with little access to electricity and water. Three impoverished, amateur thieves known as the \"Tender Trio\" – Shaggy, Clipper, and Goose – rob and loot business owners; Goose is Rocket's brother. The thieves split part of the loot with the citizens of the City and are protected by them in return. Several younger boys idolize the trio, and one, Li'l Dice (Dadinho), convinces them to hold up a motel and rob its occupants. The gang resolves not to kill anyone and tells Li'l Dice to serve as lookout. They give him a gun and tell him to fire a warning shot if the police arrive, but an unsatisfied Li'l Dice fires a warning shot mid-robbery and guns down the motel inhabitants once the gang have run off. The massacre brings police attention, forcing the trio to split up: Clipper joins the church, Shaggy is shot by the police while trying to escape the favela, and Goose is shot by Li'l Dice after taking the thieving boy's money while Li'l Dice's friend Benny (Bené) watches.Some years later in the 1970s, the favela has transformed into an urban jungle. Rocket has joined a group of young hippies. He enjoys photography and likes one girl, Angelica, but his attempts to get close to her are ruined by a gang of petty criminal kids known as \"The Runts\". Li'l Dice now calls himself \"Li'l Zé\" (\"Zé Pequeno\"), and along with Benny he has established a drug empire by eliminating all of the competition, except for one dealer named Carrot, and forcing Carrot's manager Blackie (Neguinho) to work for him instead.A relative peace has come over the City of God under the reign of Li'l Zé, who avoids police attention by having an initiate kill a Runt. Zé plans to kill Carrot, but Benny talks him out of it. Benny and his girlfriend decide to leave the City. During the farewell party, Zé is distracted, and Blackie accidentally kills Benny while trying to shoot Li'l Zé. As Benny was the only man holding Zé back from taking over Carrot's business, his death leaves Zé unchecked, and Carrot kills Blackie for endangering his life.Following Benny's death, Zé beats up a peaceful man named Knockout Ned (Mane Galinha) and rapes Ned's girlfriend. After Ned's brother stabs Zé, his gang retaliates by killing his brother and firing on Ned's house and killing his uncle. Ned, looking for revenge, sides with Carrot, and a war breaks out between Carrot and Zé.In the early 1980s, both sides enlist more \"soldiers\". Zé provides weapons for the Runts, and eventually the reason for the war is forgotten. One day, Zé has Rocket take photos of him and his gang. After Rocket leaves his film with a friend who works at a newspaper office downtown, a female reporter publishes one of the prints, a major scoop since nobody can get into the City of God anymore. Rocket believes his life is endangered, as he thinks Ze will kill him if he returns to the favela; the reporter takes him in for the night, and he loses his virginity to her.Rocket agrees to continue taking photographs, not realizing Zé is very pleased with increased notoriety. Rocket returns to the City for more photographs, bringing the film back to the opening scene. Confronted by the gang, Rocket is surprised that Zé asks him to take pictures, but as he prepares to take the photo, the police arrive, and then drive off when Carrot arrives. In the gunfight, Ned is killed by a boy who has infiltrated his gang to avenge his father: a security guard who was killed by Ned during a bank robbery. The police capture Li'l Zé and Carrot, planning to give the media Carrot, whose gang never paid off the police, while they steal Zé's money and let him go. Rocket secretly photographs the scene. Ze is murdered by the Runts who intend to run the criminal enterprise themselves. Rocket photographs Zé's dead body and brings both pictures back to the newspaper.Rocket contemplates whether to publish the photo of the cops, exposing corruption and becoming famous, or the photo of Li'l Zé's body, which will get him an internship at the newspaper. He decides on the latter and the film ends with the Runts walking around the City of God, making a hit list of the dealers they plan to kill to take over the drug business, including the Red Brigade.","language":"Portuguese","Reception":"The film was screened out of competition at the 2002 Cannes Film Festival.[5] In Brazil, City of God garnered the largest audience for a domestic film in 2003, with over 300.1 million tickets sold, and a gross of 180.6 million reais ($103 million).[6] The film grossed over $7.5 million in the U.S. and over $30.5 million worldwide (in U.S. Dollars).[7]City of God gathered 90% favourable reviews on Rotten Tomatoes.[8] Empire chose it as the 177th best film of all time in 2008,[9] and TIME chose it as one of the 100 greatest films of all time.[10] Critic Roger Ebert gave the film a four-star review, writing \"'City of God' churns with furious energy as it plunges into the story of the slum gangs of Rio de Janeiro. Breathtaking and terrifying, urgently involved with its characters, it announces a new director of great gifts and passions: Fernando Meirelles. Remember the name.\".[11]City of God was ranked third in Film4's \"50 Films to See Before You Die\", and ranked No.7 in Empire magazine's \"The 100 Best Films Of World Cinema\" in 2010.[12] It was also ranked No.6 on The Guardian's list of \"the 25 Best Action Movies Ever\".[13] It was ranked 1# in Paste magazine's 50 best movies of the decade of the 2000s.[14]The film appeared on several American critics' top ten lists of the best films of 2003.[15]City of God won fifty-five awards and received another twenty-nine nominations. Among those:","city_of_god":"Original poster","box_office":"$30.6 million[2]","cinematography":"César Charlone","production_company":"O2 Filmes VideoFilmes","directed_by":"Fernando Meirelles|Kátia Lund|","Music":"The score to the film composed by Antonio Pinto and Ed Córtes. It was followed by two remix albums. Songs from the film:","release_dates":"18 May 2002 (2002-05-18) (Cannes)|30 August 2002 (2002-08-30) (Brazil)||||","Production":"On the bonus DVD, it is revealed that the only professional actor with years of filming experience was Matheus Nachtergaele, who played the supporting role of Carrot.[3] Most of the remaining cast were from real-life favelas, and in some cases, even the real-life City of God favela itself. According to Meirelles, amateur actors were used for two reasons: the lack of available professional black actors, and the desire for authenticity. Meirelles explained: \"Today I can open a casting call and have 500 black actors, but just ten years ago this possibility did not exist. In Brazil there were three or four young black actors and at the same time I felt that actors from the middle class could not make the film. I needed authenticity.\"[4] Beginning around 2000, about a hundred children and young people were hand-picked and placed into an \"actors' workshop\" for several months.[3] In contrast to more traditional methods (e.g. studying theatre and rehearsing), it focused on simulating authentic street war scenes, such as a hold-up, a scuffle, a shoot-out etc. A lot came from improvisation, as it was thought better to create an authentic, gritty atmosphere. This way, the inexperienced cast soon learned to move and act naturally.[3]Prior to City of God, Lund and Meirelles filmed the short film Golden Gate as a sort of test run.[3] Only after then was the casting for City of God finalized[citation needed]. He also made a couple other shorts.Appropriately, the film ends eavesdropping on the machinations of the \"Runts\" as they assemble their death list. The real gang \"Caixa Baixa\" (Low Gang) is rumored to have composed such a list. After filming, the crew could not leave the cast to return to their old lives in the favelas. Help groups were set up to help those involved in the production to build more promising futures[citation needed].","produced_by":"Andrea Barata Ribeiro|Mauricio Andrade Ramos|","starring":"Alexandre Rodrigues|Leandro Firmino da Hora|Phellipe Haagensen|Douglas Silva|Jonathan Haagensen|Matheus Nachtergaele|Seu Jorge|","running_time":"130 minutes 135 minutes (TIFF)","music_by":"Antonio Pinto|Ed Côrtes|","edited_by":"Daniel Rezende","budget":"$3.3 million[1]"}