{"Cast":"Cameos","country":"United Kingdom","distributed_by":"Pathé (UK)","Plot":"In 1976 television presenter Tony Wilson sees the Sex Pistols perform at the Manchester Lesser Free Trade Hall for the first time. Inspired, Wilson starts a weekly series of punk rock shows at a Manchester club, where the newly formed Joy Division perform, led by the erratic, brooding Ian Curtis.Wilson founds a record label, Factory Records, and signs Joy Division as the first band; the contract is written in Wilson's blood and gives the Factory artists full control over their music. He hires irascible producer Martin Hannett to record Joy Division, and soon the band and label have a hit record. In 1980, just before Joy Division is to tour the United States, Curtis hangs himself. Joy Division rename themselves New Order and record a hit single, \"Blue Monday\".Wilson opens a nightclub, The Haçienda; business is slow at first, but eventually the club is packed each night. Wilson signs another hit band, Happy Mondays, led by Shaun Ryder, and the ecstasy-fuelled rave culture is born.Despite the apparent success, Factory Records is losing money. Every copy of \"Blue Monday\" sold loses five pence, as the intricately designed packaging by Peter Saville costs more than the single's sale price. Wilson pays for New Order to record a new album in Ibiza, but after two years, they still have not delivered a record. He pays for the Happy Mondays to record their fourth studio album in Barbados, but Ryder spends all the recording money on drugs. When Wilson finally receives the finished album, he finds that Ryder has refused to record vocals, and all the tracks are instrumentals. At the Haçienda, ecstasy use is curbing alcohol sales and attracting gang violence.The Factory partners try to save the business by selling the label to London Records but when Wilson reveals that the label does not hold binding contracts with any of its artists, the deal falls through. While smoking marijuana on the roof of Haçienda after its closing night, Wilson has a vision of God who assures Wilson he has earned a place in history.","language":"English","box_office":"$2.8 million","cinematography":"Robby Müller","production_company":"Film4 Revolution Films Baby Cow Productions UK Film Council The Film Consortium","directed_by":"Michael Winterbottom","Soundtrack":"The soundtrack to 24 Hour Party People features songs by artists closely associated with Factory Records who were depicted in the film. These include Happy Mondays, Joy Division (later to become New Order) and The Durutti Column. Manchester band the Buzzcocks are featured, as are The Clash. The album begins with \"Anarchy in the U.K.\" by the Sex Pistols, the band credited in the film with inspiring Factory Records co-founder Tony Wilson to devote himself to promoting music.New tracks recorded for the album include Joy Division's \"New Dawn Fades\", from a concert performance by New Order with Moby and Billy Corgan.Several songs appear in the film but are not on the soundtrack album, including:","narrated_by":"Steve Coogan","release_dates":"5 April 2002 (2002-04-05)|||||","Reception and awards":"The film holds a Metacritic score of 85/100.[3] Roger Ebert gave it four out of four stars.[4]The film was nominated for the Palme d'Or at the 2002 Cannes Film Festival.","produced_by":"Andrew Eaton","starring":"Steve Coogan Paddy Considine Andy Serkis Paul Popplewell Shirley Henderson Lennie James Sean Harris Peter Kay","running_time":"117 minutes","24_hour_party_people":"UK theatrical poster","edited_by":"Trevor Waite","written_by":"Frank Cottrell Boyce"}