{"country":"United States","distributed_by":"Paramount Pictures","200_cigarettes":"Theatrical release poster","Plot":"The film follows various plot arcs all occurring on New Year's Eve of 1981. Monica (Plimpton) is throwing a big New Year's bash and is desperately afraid no one will attend. Early on the only person to have arrived is her friend Hillary (Catherine Kellner). As she tries to convince Hillary to stay, we learn about various other groupings of individuals who are all on their way.The film follows several characters as they spend New Year's Eve in New York City before eventually showing up at Monica's party. The characters are: Val (Ricci) and Stephie (Hoffmann), teens from Ronkonkoma who get lost in the seedy Alphabet City section of the borough and wander into a punk club where they meet Dave (Diaz) and Tom (Casey Affleck), who have a \"package\" they need to deliver; ditsy and awkward Cindy (Hudson) who is on a dinner date with the paranoid Jack (Mohr); Lucy (Love) and her best friend Kevin (Rudd) who are struggling with the sexual tension between them; Kevin's feminist ex-girlfriend Ellie (Garofalo), who walks in on Kevin and Lucy making out in a restroom stall; a dim-witted and flirtatious bartender (Ben Affleck); competitive friends Bridget (Nicole Ari Parker) and Caitlyn (Featherstone) who attempt to ditch Bridget's boyfriend Eric (Brian McCardie) (who is also Monica's ex-boyfriend); and the eccentric cab driver (Chappelle) who takes them all around town throughout the evening in his disco themed taxi.Eventually, all the characters find their way to the party, although in the meantime Monica has passed out after drowning her sorrows in alcohol. She wakes up the next morning to find many unrecognizable people on her floor, including Stephie who tells her what a big hit her party was. Monica is thrilled (even though she missed it all), especially when she finds out that Elvis Costello showed up. The final montage shows Polaroids of the party, narrated by the disco cabbie, mostly featuring the unlikely romances from the party and the unconscious Monica being propped up by her party guests.","language":"English","box_office":"$6,852,450","production_company":"MTV Films Lakeshore Entertainment","directed_by":"Risa Bramon Garcia","release_dates":"February 26, 1999 (1999-02-26) (U.S.)|May 13, 1999 (1999-05-13) (Australia)||||","produced_by":"Betsy Beers David Gale Van Toffler","starring":"Ben Affleck Casey Affleck Dave Chappelle Guillermo Diaz Angela Featherstone Janeane Garofalo Gaby Hoffmann Kate Hudson Courtney Love Jay Mohr Nicole Ari Parker Martha Plimpton Christina Ricci Paul Rudd","running_time":"101 minutes","music_by":"Bob Mothersbaugh Mark Mothersbaugh","edited_by":"Lisa Zeno Churgin","Release":"The film received generally negative reviews[1] and grossed $6.8 million[2] in the United States before video release.The film currently holds a 33% on Metacritic, incidating \"Generally unfavorable reviews\"[1] and a 28% rating on Rotten Tomatoes based on 60 reviews.[3]","written_by":"Shana Larsen","budget":"$6 million"}