{"based_on":"Flowers for Algernon by Daniel Keyes","country":"United States","distributed_by":"Cinerama (1968, original) MGM (2005, DVD)","screenplay_by":"Stirling Silliphant","Plot":"Charly Gordon (Cliff Robertson), an intellectually disabled man with a strong desire to make himself smarter, has been attending night school for two years where he has been taught by Alice Kinnian (Claire Bloom) to read and write. However, his spelling remains poor and he is even unable to spell his own name.Alice takes Charly to the \"Nemur-Straus\" clinic run by Dr. Richard Nemur and Dr. Anna Straus. Nemur and Straus have been increasing the intelligence of laboratory mice with a new surgical procedure and are looking for a human test subject. As part of a series of tests to ascertain Charly's suitability for the procedure, he is made to race Algernon, one of the laboratory mice. Algernon physically runs through a maze while Charly uses a pencil to trace his way through a diagram of the same maze. Charly is disappointed that he consistently loses the races. Nevertheless, he is given the experimental surgery.After the surgery, Charly is initially angered that he is not immediately smarter than he was before and still loses in races against Algernon. Eventually, however, he beats Algernon in a race and then his intelligence starts increasing rapidly. Alice continues to teach him, but he soon surpasses her. Charly's co-workers also try to tease him by making him work on a machine that they believe he will not be able to work. When Charly shows he can work the machine, his co-workers are not pleased with the fact that he is now intelligent and cannot be teased anymore. They sign a petition against him and he loses his job at the bakery. Charly also starts staring at Alice's bottom and breasts as well as drawing and painting abstract nude figures of her. He also questions whether Alice loves her fiancé. One night, Charly follows Alice back to her apartment and sexually assaults her, pulling her to the floor and kissing her forcefully until she breaks free by slapping him.The film then uses a montage sequence to show Charly – having escaped into the counterculture – wearing a mustache and goatee, riding a motorcycle, kissing a series of different women, smoking and dancing. At the end of the sequence, Charly has returned home and Alice comes to visit him, both having learned during their time apart that they want to be together. A further montage sequence shows Charly and Alice running through woods and kissing under trees accompanied by a voice-over of the two of them talking about marriage.Straus and Nemur present their research to a panel of scientists, including a question-and-answer session with Charly. Charly is aggressive during the session and then reveals that Algernon has just died, causing Charly to believe that his own increased intelligence is only temporary. After suffering visions of his intelligence fading and of his pre-operative self following him, Charly decides to work with Nemur and Straus to see if he can be saved. Charly discovers that there is nothing that can be done to prevent his own intelligence from fading. Alice visits Charly and asks him to marry her, but he refuses and tells her to leave.In the film's final scene, Alice watches Charly playing with children in a playground, having reverted to his former self.","Production history":"The novel had previously been the basis of The Two Worlds of Charlie Gordon, a 1961 television adaptation in which Robertson had also starred for CBS's U. S. Steel Hour.[3] Robertson had starred in a number of TV shows which were turned into films with other actors playing his role, such as Days of Wine and Roses. He bought the rights to the story, hoping to star in the film version as well.[4]He originally hired William Goldman to write the screenplay on the strength of Goldman's novel No Way to Treat a Lady, paying him $30,000 out of his own pocket.[5] Robertson was unhappy with Goldman's work and then hired Stirling Silliphant to do a draft.[6]","language":"English","Critical reception":"Vincent Canby called the film a \"self-conscious contemporary drama, the first ever to exploit mental retardation for...the bittersweet romance of it\"; he called Robertson's performance \"earnest\" but points out that \"we [the audience] are forced into the vaguely unpleasant position of being voyeurs, congratulating ourselves for not being Charly as often as we feel a distant pity for him. \" Canby calls Nelson's direction \"neo-Expo 67\", referring to the use of split screen to \"show simultaneously the reactions of two people facing each other and conversing\" and the use of \"little postage stamp-sized inserts of images within the larger screen frame. \"[7] Time magazine called Charly an \"odd little movie about mental retardation and the dangers of all-conquering science, done with a dash of whimsy.\" While \"the historic sights in and around Charly's Boston setting have never been more lovingly filmed\", \"The impact of [Robertson's] performance...is lessened by Producer-Director Ralph Nelson's determination to prove that he learned how to be new and now at Expo '67: almost every other sequence is done in split screens, multiple images, still shots or slow motion. \"[8] Screenwriter (and Hollywood blacklist target[9]) Maurice Rapf[10] called Robertson's performance \"extraordinary\" and called \"astonishing\" his on-screen \"transformation from one end of the intellectual spectrum to the other\"; Rapf took issue with what he called the \"pyrotechnics of the camera\" and the \"flashy opticals\", calling the effects \"jarringly out of place\" and better suited for a \"no-story mod film like The Knack. \"[11]Roger Ebert gave the film three stars out of four, saying \"The relationship between Charly (Cliff Robertson) and the girl (Claire Bloom) is handled delicately and well. She cares for him, but inadequately understands the problems he's facing. These become more serious when he passes normal IQ and moves into the genius category; his emotional development falls behind. It is this story, involving a personal crisis, which makes Charly a warm and rewarding film. \" By contrast, Ebert pointed out \"the whole scientific hocus-pocus, which causes his crisis, is irrelevant and weakens the movie by distracting us. \"[12]In 2009, Entertainment Weekly listed Charly among its \"25 Best Movie Tearjerkers Ever. \"[13]","box_office":"$8,500,000 (rentals)[2]","cinematography":"Arthur Ornitz","production_company":"ABC Motion Pictures Robertson and Associates Selmur Productions","directed_by":"Ralph Nelson","Awards":"At the 40th National Board of Review Awards, Charly was fourth in their list of \"Top Ten Films\" of 1968, and Cliff Robertson was chosen the year's \"Best Actor.\"[14]At the 41st Academy Awards, Robertson won the Academy Award for Best Actor in a Leading Role, under some controversy: less than two weeks after the ceremony, Time magazine mentioned the Academy's generalized concerns over \"excessive and vulgar solicitation of votes\" and said \"many members agreed that Robertson's award was based more on promotion than on performance. \"[15] The film was nominated for a Hugo Award for Best Dramatic Presentation, losing to 2001: A Space Odyssey.[16]","charly":"1968 Theatrical Poster","Proposed sequel":"In the late 1970s, following a period of extended unemployment that followed an act of whistle-blowing against David Begelman, the then-president of Columbia Pictures, Robertson wrote and attempted to produce Charly II, to no avail.[17]","release_dates":"September 23, 1968 (1968-09-23) (New York City[1])|||||","Box office":"The film was a hit, earning $7.25 million in theatrical rentals during its release in North America, and it earned an additional $1.25 million in theatrical rentals overseas. It is the 16th-highest grossing film of 1968. After all costs were deducted (including $1,325,000 paid to profit share), the film reported a profit of $1,390,000, making it one of the most successful movies ever made by ABC Pictures.[2]","produced_by":"Ralph Nelson","starring":"Cliff Robertson Claire Bloom Leon Janney Lilia Skala Dick Van Patten","running_time":"106 minutes[1]","Home video release":"Charly was released on Region 1 DVD by MGM Home Entertainment on March 31, 2005.[citation needed]","music_by":"Ravi Shankar","edited_by":"Fredric Steinkamp","budget":"$2,225,000[2]"}