{"based_on":"How the Grinch Stole Christmas! by Dr. Seuss","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Jeffrey Price Peter S. Seaman","dr._seuss'_how_the_grinch_stole_christmas":"Theatrical release poster","Plot":"All the Whos down in Whoville enjoy celebrating Christmas with much happiness and joy, except the Grinch (Jim Carrey), who hatefully despises Christmas and the Whos with great wrath and occasionally pulls dangerous and harmful practical jokes on them. As a result, no one likes or cares for him. Meanwhile, six-year-old Cindy Lou (Taylor Momsen) believes everyone is missing the point about Christmas by being more concerned about the gifts and festivities. After having a face-to-face encounter with the Grinch at the Post office, in which he saves her life, Cindy Lou becomes interested in his history; she asks everyone what they know about him, and soon discovers that he has a tragic past.The Grinch actually arrived in Whoville by mistake when he was a baby, and was adopted by two elderly sisters. Although he showed some sadistic tendencies as a child, he was rather timid and not the cruel, selfish person he would become. He was bullied by his classmates (particularly by Augustus May Who (Jeffrey Tambor), the current Mayor of Whoville) because of his appearance, with the exception of Martha May Whovier (Christine Baranski), who was courted by both the Grinch and May Who. One Christmas season, he made a gift for Martha, but attempted to shave his face after being made fun of for having a \"beard\", cutting himself by accident. When his classmates and teacher saw his face covered with shaving tape the next morning, they ridiculed him yet again. He lost his temper, went on a rampage and ran away to live on a mountain to the north of Whoville, Mount Crumpit.Cindy Lou, touched by this story, decides to make the Grinch the main participant of the Whobilation, to the great displeasure of Mayor May Who, who reluctantly agrees after pressure from the townspeople, who have been warmed by Cindy Lou's generous spirit. When Cindy Lou goes to Mount Crumpit and offers an invitation to the Grinch, he turns her down. He gradually changes his mind, however, due to the promise of an award, the presence of Martha at the celebration and the chance to upset the Mayor. Just as the Grinch is enjoying himself and is almost won over, May Who gives him an electric shaver as a present, reminding him of his awful humiliation at school. May Who then asks Martha to marry him, promising her a new car in return. This causes the Grinch to openly berate the Whos and openly criticize Christmas, claiming that the holiday is only about gifts that they will just dispose of later, in the hopes of making them too ashamed to celebrate the holiday. He then goes on to ruin the party by burning the Christmas tree with a makeshift flamethrower (although his actions prove fruitless as the Who's have a spare tree, which the Grinch sees them erect before he leaves).When he discovers that his attack has not removed the Whos' Christmas spirit, the Grinch instead concocts a plan to steal all of their presents while they are sleeping. Creating a Santa suit and sleigh with his own dog, Max, as a \"deer\", the Grinch flies around Whoville, stealing all of the Whos' Christmas gifts. He is almost discovered by Cindy Lou, but lies to her in order to get away. The next day, the Whos discover the Grinch's scheme, and May Who denounces Cindy Lou as the root of this catastrophic disaster. However, her father, Lou Lou Who (Bill Irwin), the Whoville postmaster, finally stands up to him and reminds everyone that they still have Christmas spirit, and that the principal meaning of Christmas is to spend it with family and friends. The people accept his speech and begin to sing. Hoping that the change of mood would inspire the Grinch, Cindy Lou goes to Mount Crumpit to find him.The Grinch reveals that he intends to push the stolen gifts off the top of the mountain after he hears the Whos crying. However, instead of crying, he hears the joyful singing of the Whos. Infuriated over the failure of his plan, the Grinch has an epiphany about what Christmas is really about: not material gifts, but spending time with loved ones, an insight that profoundly touches him and causes his heart to grow to three times its original size. When the sleigh full of stolen gifts begins to go over the edge of the cliff, the Grinch desperately tries to save them to no avail. However, when he realizes Cindy Lou has come to wish him a merry Christmas and is in danger of falling off the cliff with the sleigh, the Grinch finds enough strength to lift the sleigh, the gifts and Cindy Lou to safety. After a long descent down Mount Crumpit, the Grinch returns to Whoville with Cindy and the gifts. He confesses to the burglary, apologizes for his actions towards the Whos and surrender himself to the police as they arrive, but the Whos reconcile with him, much to May Who's dismay. Martha turns down May Who's proposal and decides that she would rather stay with the Grinch instead. The redeemed Grinch starts a new life with the Whos, commemorating the Christmas feast with them in his cave.","language":"English","Reception":"Rotten Tomatoes gave the film with a rating 53%, with the critical consensus reading, \"Jim Carrey shines as the Grinch. Unfortunately, it's not enough to save this movie. You'd be better off watching the TV cartoon.\"[6] On Metacritic, the film has a score of 46 out of 100, based on 29 critics, indicating \"mixed or average reviews\".[7]Roger Ebert gave the film two out of four stars, referring to it as \"a dank, eerie, unusual, weird movie about a sour creature who lives on top of a mountain of garbage, scares children, is mean to his dog, and steals everyone's Christmas presents,\" and saying, \"There should be...a jollier production design and a brighter look overall... It's just not much fun.\" Ebert observed that Carrey \"works as hard as an actor has ever worked in a movie, to small avail. He leaps, he tumbles, he contorts, he sneers, he grimaces, he taunts, he flies through the air and tunnels through the garbage mountain, he gets stuck in chimneys and blown up in explosions,\" but added that Carrey's presence was diminished by his heavy make-up and remarked that \"his Grinch, with his pig-snout nose and Mr. Hyde hairdo, looks more like a perverse wolfman than the hero of a comedy.\" Nevertheless, he decided that \"adults may appreciate Carrey's remarkable performance in an intellectual sort of way and give him points for what was obviously a supreme effort.\"[8]Paul Clinton of CNN declared that Carrey \"was born to play this role\" and noted that \"Carrey carries nearly every scene. In fact, if he's not in the scene, there is no scene.[9] Owen Gleiberman of Entertainment Weekly began his review of the film analyzing the Grinch's \"mischievously divided, now-I'm-calm/ now-I'm-a-raving-sarcastic-PSYCH-o! personality\" and summed up Carrey's Grinch as \"a slobby, self-loathing elitist ruled by the secret fear that he's always being left out of things.\" Gleiberman expressed surprise at \"how affecting Carrey makes the Grinch's ultimate big-hearted turnaround, as Carrey the actor sneaks up on Carrey the wild-man dervish. In whichever mode, he carreys the movie.\"[10]Peter Stack of the San Francisco Chronicle proclaimed that \"Nobody could play the Grinch better than Jim Carrey, whose rubbery antics and maniacal sense of mischief are so well suited to How the Grinch Stole Christmas. Dr. Seuss himself might have turned to Carrey as a model for the classic curmudgeon had the actor been around in 1957.\" However, he wondered why Carrey \"made himself sound like Sean Connery\" and warned that the character's intensity may frighten small children.[11] James Berardinelli of ReelViews wrote that Carrey's \"off-the-wall performance is reminiscent of what he accomplished in The Mask, except that here he never allows the special effects to upstage him. Carrey's Grinch is a combination of Seuss' creation and Carrey's personality, with a voice that sounds far more like a weird amalgamation of Sean Connery and Jim Backus (Bond meets Magoo!) than it does Karloff.\" He concluded that Carrey \"brings animation to the live action, and, surrounded by glittering, fantastical sets and computer-spun special effects, Carrey enables Ron Howard's version of the classic story to come across as more of a welcome endeavor than a pointless re-tread.\"[12]Some reviews were more middling. Stephanie Zacharek of Salon, in a generally negative review of the film, wrote that \"Carrey pulls off an admirable impersonation of an animated figure. Behind those sadistic yellowy eyes and that rangy green fur, he gets the facial tics, and the precise, slippery mannerisms, of Jones’ Grinch just right. It’s fine as mimicry goes — but mimicry isn’t the best playground for comic genius. Shouldn’t we be asking more of a man who’s very likely the most gifted comic actor of his generation? Carrey’s rubbery grace marks him as the most physically gifted comedian since Jerry Lewis, and his dotty free associations, here and in just about every picture he’s done, from The Mask to Dumb and Dumber to Me, Myself & Irene, suggest a mind that’s mosquito-zapper quick.\" She concluded that in spite of \"a few terrific ad-libs [...] his jokes come off as nothing more than a desperate effort to inject some offbeat humor into an otherwise numbingly unhip, nonsensical and just plain dull story.\"[13]Todd McCarthy of Variety wrote that \"Carrey tries out all sorts of intonations, vocal pitches and delivery styles, his tough guy posturing reminding at times of Cagney and his sibilant S's recalling Bogart. His antic gesturing and face-making hit the mark at times, but at other moments seem arbitrary and scattershot. Furthermore, his free-flowing tirades, full of catch-all allusions and references, are pitched for adult appreciation and look destined to sail right over the heads of pre-teens.\"[14]Dr. Seuss' How the Grinch Stole Christmas opened at number-one with a weekend gross of $55,082,230, for an average of $17,615 from 3,127 theaters and staying at #1 for a total of 4 weeks. It closed on April 30, 2001, after five months, with a final gross of $260,044,825 in the United States and Canada and an additional gross of $85,096,578 in other territories, for a total worldwide gross of $345,141,403.[1]The film garnered three Academy Award nominations, including Best Costume Design (Rita Ryack) and Best Art Direction (Michael Corenblith and Merideth Boswell), and nominees Rick Baker and Gail Rowell-Ryan won the Academy Award for Best Makeup. At the Golden Globes, Carrey was nominated for the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, losing the award to George Clooney for O Brother, Where Art Thou?.It also won the Blimp Awards for Favorite Movie and Favorite Movie Actor at the 2001 Kids' Choice Awards. The film won a Saturn Award for Best Music. However, it was also nominated for two 2000 Golden Raspberry Awards for Worst Remake or Sequel and Worst Screenplay, but lost to Book of Shadows: Blair Witch 2 and Battlefield Earth respectively.[citation needed]","box_office":"$345.1 million[1]","Remake":"Universal Pictures and Illumination Entertainment have announced they are working on a computer-animated remake of the film. Peter Candeland and Yarrow Cheney are set to direct, following the remake to The Cat in the Hat, with Illumination CEO Chris Meledandri producing and Audrey Geisel executive producing.[15][16] It was announced that Benedict Cumberbatch will voice the title character[17] while Kaitlyn Maher will voice Cindy Lou Who. Originally scheduled for November 10, 2017,[18] the release was later pushed back to November 9, 2018.[19]","cinematography":"Donald Peterman","production_company":"Imagine Entertainment","directed_by":"Ron Howard","Home media":"The film was released on VHS and DVD on November 20, 2001. A Blu-ray/DVD combo pack was released on October 13, 2009.","Soundtrack":"Legend: *Dialogue + Instrumental ~ Includes Narration and Dialogue ^ Includes \"Welcome Christmas\"","narrated_by":"Anthony Hopkins","release_dates":"November 17, 2000 (2000-11-17)","Production":"The movie was shot between September 1999 and January 2000. Dr. Seuss' wife, Audrey, visited the set in October, 1999.[4]On September 26, 1998, it was announced that Ron Howard would direct and produce a 2000 American fantasy Christmas comedy film titled How the Grinch Stole Christmas or Dr. Seuss' How the Grinch Stole Christmas (promoted theatrically as The Grinch) with Brian Grazer, and also with the budget of $123 million based on the 1957 story of the same name by Dr. Seuss, which would be released in theaters on November 17, 2000.Jeffrey Price and Peter S. Seaman would write the film. It was also announced that the film would star Jim Carrey (who plays the title character), Josh Ryan Evans, Taylor Momsen, Jeffrey Tambor, Ben Bookbinder, Christine Baranski, Landry Allbright, Bill Irwin, Molly Shannon, Frank Welker, Clint Howard, Reid Kirchenbauer, Mindy Sterling, Bryce Dallas Howard, Jim Meskimen, Jeremy Howard, Kelley and T. J. Thyne with narration by Anthony Hopkins. Alec Berg, David Mandel and Jeff Schaffer did an uncredited rewrite of the script.[5]Universal Pictures acquired distribution rights to the film. James Horner would compose the music for the movie. Imagine Entertainment co-produced the film.","produced_by":"Brian Grazer Ron Howard","starring":"Jim Carrey Taylor Momsen Jeffrey Tambor Christine Baranski Bill Irwin Molly Shannon","running_time":"104 minutes 115 minutes (Uncut version)[1]","music_by":"James Horner","edited_by":"Dan Hanley Mike Hill","budget":"$123 million[1]"}