{"country":"United States","distributed_by":"Relativity Media","screenplay_by":"Henry Gayden","story_by":"Henry Gayden Andrew Panay","Plot":"Three neighborhood teens and childhood friends, Alex, Tuck, and Munch, are upset by the fact that their neighborhood, Mulberry Woods, is being demolished for a new highway construction project, and that Alex is moving, due to him being a foster child.While at Tuck's house, their phones start to glitch out, as they pseudonomically name it \"barfing\". They soon find out, through Munch, that it's a map to a desert 17.6 miles away. They decide to go to the desert on their bikes during their \"last night together\", and disguise it as a sleepover.Tuck, Alex, and Munch soon make it to the desert, as they follow the map to a dusty, rusted object under a cable tower. Tuck, confused, decides to abruptly call it off, when the object starts to copy Alex's ringtone. They follow another map to a barn, as the object telekinetically starts to repair itself, and is able to answer questions using a \"Yes\" or \"No\" answer, from which the boys learn that it is from outer space, has crash landed, and was seriously injured.They soon follow another map to a pawn shop, where the object repairs itself again, and reveals itself as an alien, using Alex's phone camera to \"see\" and befriend the three. While in an alley, they decide to name the alien \"Echo\". They again follow another map to a house in which Emma, a Mulberry Woods high school student, lives and finds out about Echo. Emma soon joins the team, as they go to a bar, and then an arcade, as she finds out the object Echo is in is a key to a spaceship hidden in Mulberry Woods.While there, Alex allegedly causes himself to be caught by a security guard, to which Echo scares away and Emma rescues, as Alex is angry towards Tuck for abandoning him on accident. Stopping at a nearby restaurant, the four talk and reconcile, as a construction worker captures both Munch and Echo, to which the four found out that the workers were the ones who shot him down earlier. Tuck, Alex, and Emma then go to Tuck's brother's party, and steal his car to catch up with Munch and Echo, but get caught by the same worker.The four are soon taken to a junkyard, as Echo seemingly dies from experimentation, but revives and complete, as he diverts and traps the workers long enough for the four to drive back home, and find the spaceship, which was buried under Tuck's home the entire time; the only reason the construction project existed. Alex goes, and along with the rest, says goodbye as Echo safely starts up the ship and leaves.After the event, Alex and Munch move, but Tuck stays, due to a change in plans, as the project is abandoned, and more people move in. Sometime later, the four meet up again, as the film ends with Alex holding up his phone towards the sky.In a scene after the credits, Alex addresses his friends as his phone apparently starts to move and glitch out, another sign of Echo returning.","language":"English","box_office":"$45.3 million[4]","cinematography":"Maxime Alexandre","production_company":"Panay Films Walt Disney Pictures (uncredited)[1]","directed_by":"Dave Green","earth_to_echo":"Theatrical release poster","release_dates":"June 14, 2014 (2014-06-14) (Los Angeles Film Festival)|July 2, 2014 (2014-07-02) (United States)||||","Production":"Earth to Echo was commissioned by Sean Bailey, Walt Disney Studios' President of Production, under the working title, Untitled Wolf Adventure, while the studio shifted leadership between Rich Ross and Alan Horn. After Horn's succession as Chairman and viewing a final cut of the film, he decided to put the film into turnaround. After Producer Andrew Panay met with Relativity President Tucker Tooley, Disney eventually sold the film's distribution rights and copyrights to Relativity Media in 2013.[1]","Distribution":"The film was initially scheduled for release on January 10, 2014 and April 25, 2014.[5] After being delayed, Earth to Echo premiered on June 14, 2014 at the Los Angeles Film Festival and opened in theaters across the U.S. on July 2, 2014.The first trailer was released on December 12, 2013.[6]The film was released on DVD and Blu-ray on October 21, 2014.[7]Earth to Echo opened on July 2, 2014 in the United States in 3,179 theaters, ranking at #6, and accumulating $8,364,658 over its 3-day opening weekend (an average of $2,590 per venue) and $13,567,557 since its Wednesday launch. As of 27 December 2014[update], the film had grossed $38.9 million in the U.S. and $6.4 million overseas, for an total of $45.3 million worldwide, against a $13 million budget, making it a moderate box office success.[4]Review aggregation website Rotten Tomatoes summarized the critical response: \"Earth to Echo doesn't do itself any favors by beggaring comparisons to E.T., but for younger viewers, it should prove a reasonably entertaining diversion\". 48% of the reviews collected on the website were positive.[2] The website surveyed 116 critics and, categorizing the reviews as positive or negative, assessed 57 as positive and 60 as negative. Of the 117 reviews, it determined a rating average of 5.4 out of 10. The website had assigned the film a score of 49%.[2] Another aggregator Metacritic surveyed 31 critics and assessed 14 reviews as positive, 15 as mixed, and 2 as negative. Based on the reviews, it gave the film a score of 53 out of 100, which indicate \"mixed or average reviews\".[8]","produced_by":"Ryan Kavanaugh Andrew Panay","starring":"Teo Halm Brian \"Astro\" Bradley Reese C. Hartwig Ella Wahlestedt","running_time":"89 minutes[2]","music_by":"Joseph Trapanese","edited_by":"Carsten Kurpanek Crispin Struthers","budget":"$13 million[3]"}