{"based_on":"Children of Divorce  by Owen Johnson","country":"United States","distributed_by":"Paramount Pictures","story_by":"Adela Rogers St. Johns","Plot":"Jean Waddington (Esther Ralston) and Ted Larrabee (Gary Cooper) grew up together in an affluent society, the children of divorced parents. Most of their friends have cynical attitudes towards love and marriage, but Jean and Ted are more serious. In fact, Jean has fallen in love with Ted, who one day proposes marriage. Knowing, however, that Ted's father was unfaithful to his wife and irresponsible, Jean demands that he prove himself before she accepts his proposal. Soon Ted starts a business and opens up an office in the building where their mutual friend Kitty Flanders (Clara Bow) works. Kitty is also a child of divorce.One evening, Kitty throws a wild party at work, and Ted takes part in the revelry. At the party, Kitty meets Prince Ludovico de Saxe (Einar Hanson) and is immediately attracted to him. The prince return her affection, but the prince's guardian Duke Henri de Goncourt (Norman Trevor) prevents them from seeing each other because she is not of their social class. Raised by a mother who insisted that she marry a wealthy man, Kitty soon sets her sights on Ted—even though she knows that Ted and her close friend Jean love each other. One evening, after going on a drunken spree, Kitty tricks Ted into marrying her, even though she does not love him.Desperately unhappy, Ted assures Jean that he will seek a divorce as soon as possible. Not wanting him to repeat the mistakes of their parents, Jean refuses to marry him if he divorces, and sails off for Europe. The arrival of their baby does little for their marriage, and Ted avoids spending any time with his unwanted wife. Sometime later, Kitty and Ted and their child visit the prince, whom Kitty once loved. Kitty remembers her feelings for the prince and dreams of marrying him someday. When she learns that he can never marry a divorced woman for religious reasons, she poisons herself.","language":"Silent English intertitles","cinematography":"Norbert Brodine|Victor Milner|","production_company":"Famous Players-Lasky","directed_by":"Frank Lloyd|Josef von Sternberg (uncredited)|","release_dates":"April 25, 1927 (1927-04-25) (USA)|||||","Production":"Clara Bow was largely responsible for getting Cooper the lead male role in the film.[2] She assured the young actor, \"We'll go places and do things together. We'll become an item.\"[2] The inexperienced and miscast Cooper, who had mainly appeared in minor roles in Westerns up to that point, was not prepared to play a sophisticated New Yorker in a love story.[2] Cooper's initial party scenes and love scenes were particularly difficult for the young actor from Montana, and after numerous frustrating retakes, Cooper disappeared from the set.[3] The studio replaced him with an actor whose performances were just a bad as Cooper's.[4] A disheveled Cooper was found a few days later and was asked to complete the film.[5]","children_of_divorce":"Theatrical release poster","produced_by":"Jesse L. Lasky|E. Lloyd Sheldon|Adolph Zukor|","starring":"Clara Bow|Esther Ralston|Gary Cooper|Einar Hanson|Norman Trevor|","running_time":"70 minutes","edited_by":"E. Lloyd Sheldon","written_by":"Louis D. Lighton|Hope Loring|Alfred Hustwick (titles)|"}