{"country":"United Kingdom","distributed_by":"Universal Studios","screenplay_by":"Michael Winner Helen Zahavi","story_by":"Helen Zahavi (novel)","dirty_weekend":"Theatrical release poster","language":"English","Synopsis":"Set in the coastal town of Brighton, England, Dirty Weekend follows the story of Bella (Lia Williams), a mild-mannered secretary who works from home in a basement flat. Soon, she finds herself the victim of Tim (Rufus Sewell), a voyeur who watches her through her windows and plagues her with obscene phone calls in which he threatens to assault and rape her. After the police refuse to offer any assistance, Bella visits Nimrod (Ian Richardson), an Iranian clairvoyant who suggests that she take matters into her own hands.That night, Bella breaks into Tim’s flat while he is sleeping and batters him to death with a claw hammer. Empowered, Bella embarks on a dirty weekend in which she slaughters six more men by a variety of methods. Ultimately, she evades capture by the authorities and prepares to carry on her murderous rampage in the large, faceless city of London.","cinematography":"Alan Jones","directed_by":"Michael Winner","release_dates":"29 October 1993 (1993-10-29)|||||","Production":"Filming took place in the Notting Hill and Kensington areas of London and also in Brighton. However, the Internet Movie Database lists other locations. The gun shop scenes were filmed at Park Street Guns near St. Albans, Hertfordshire; the country pub (now demolished) was the Grenville Lodge, East Burnham (Burnham Beeches) Buckinghamshire; and the dentist scenes were shot at a real dental practice in Twickenham, Greater London.Theft of equipment was a problem during filming.[1] While filming in Brighton, all the catering equipment was stolen and in Notting Hill Gate, a mobile kitchen with generator was stolen.","produced_by":"Jim Beach Robert Earl Ron Purdie Michael Winner","starring":"Lia Williams Rufus Sewell Ian Richardson David McCallum Sylvia Syms Christopher Ryan Sean Pertwee","running_time":"102 minutes","Critical Reception":"Halliwell's Film Guide described Dirty Weekend as \"a sleazy little tale of a female vigilante, directed and acted in a perfunctory, over-emphatic manner\".[2] Sheila Johnston's assessment of Dirty Weekend was also negative: \"no window-dressing can hide the fact that an aura of indelible naffness hangs over the movie...the screenplay is hewn out from Helen Zahavi's over-written novel with no concessions to the way people actually speak\".[3] Johnston argued Dirty Weekend was inferior to other female revenge films such as Ms. 45 and Lipstick.[3] Johnston also criticised the making up of the white actor Richardson with \"brownface\" to portray a Middle Easterner.[3] The Observer review claimed Dirty Weekend has \"a certain factitious topicality\", but went on to state \"a work so bad in every way, and mostly risibly so, cannot be the focus of serious controversy\".[4] Brian Case, reviewing the film for Time Out, dismissed Dirty Weekend as \"pretty rotten\", and criticised Winner's direction, stating it resembled \"out-takes from local cinema advertising, which distances the audience from the material and indeed from wakefulness itself\".[5]","music_by":"David Fanshawe","edited_by":"Michael Winner (as Arnold Crust Jr)"}