{"dave":"Theatrical release poster","distributed_by":"Warner Bros.","Plot":"Dave Kovic runs a temporary employment agency in Georgetown, Washington, D.C., and has a side job impersonating President Bill Mitchell. He is requested by Secret Service agent Duane Stevensen to make an appearance as the President at a hotel. Dave assumes it is a matter of security, but it is really to cover up Mitchell's extramarital affair with a White House staffer.Mitchell suffers a severe stroke during the rendezvous, leaving him in a coma. White House Chief of Staff Bob Alexander and Communications Director Alan Reed convince Dave to continue impersonating the President. They tell him that Vice President Gary Nance is mentally unbalanced, but Bob does not want Nance in power because his honesty would get in the way of Bob's lies and corruption. Only Bob, Alan, the Secret Service, and the medical staff know of the switch. First Lady Ellen Mitchell leads a separate life, rarely seeing the President.The public is notified that Mitchell has had a \"minor circulatory problem of the head.\" With Dave established as President, Bob and Alan send Nance on a 12-nation goodwill tour of Africa and implicate him in a savings and loan fraud. Once Nance is forced to resign, Bob plans for Dave to nominate him as Vice President, whereupon Mitchell will have a more serious stroke and Bob will ascend to the Presidency.Dave's enthusiasm revives Mitchell's popularity. He visits a homeless shelter with Ellen, who does not understand why he has taken a sudden interest. Bob forges Mitchell's veto of a funding bill that includes the shelter. Mitchell wanted to veto the bill because of budget issues, while Bob does it out of spite. When Dave is confronted about the veto by Ellen, he confronts Bob, who offhandedly tells him that if he can cut $650 million from the federal budget he can keep the shelter. Dave has his accountant friend Murray Blum help him rewrite the budget so that the project may be reinstated. To make sure that Bob doesn't stop him, Dave does it publicly in front of the press.Suspecting that he is not really her husband, Ellen tricks Dave into revealing the truth. Dave and Duane show her Bill on life support in the White House basement. She and Dave decide to leave the White House. However, after a night out, they realize all the good they could still do and decide to return.Dave blackmails Bob into resigning by threatening to go public with the switch, then announces a plan to find a job for every American who wants work. Nance returns from Africa and confronts Dave about the savings and loan scandal, insisting they both know there is no merit to the allegations. Dave talks to Alan, who reveals the whole plan was Bob's idea. Meanwhile, Bob reveals Mitchell's involvement in the savings and loan scandal while pushing his own candidacy for the presidency. Realizing that he can't go into hiding, Dave decides to take responsibility for Mitchell's actions.The scandal will make the jobs program difficult to pass, but Nance tells Dave that it is a wonderful idea. Dave tells Ellen that Nance is a good man and he would make a great president. Realizing what is planned, Ellen tells him that she does not want to lose him. The next day in a joint session of Congress, Dave admits to Mitchell's role in the scandal, but introduces evidence proving Bob was the mastermind and Nance is innocent. Bob realizes that Alan has betrayed him. Dave fakes a stroke and makes a switch with the real Mitchell in an ambulance en route to the hospital. Nance becomes Acting President under the terms of the 25th Amendment and is sworn in as President five months later when Mitchell passes away. Bob and eight other members of the Mitchell Administration are indicted and arrested on 34 charges of law violations and obstruction of justice two days after Dave's jobs initiative passes.Dave decides to run for city council and Ellen comes to the office to volunteer. As they embrace, Duane stands guard outside the office door.","language":"English","box_office":"$63,270,710[1]","cinematography":"Adam Greenberg","production_company":"Northern Lights Entertainment Lauren Shuler Donner Productions","directed_by":"Ivan Reitman","release_dates":"May 7, 1993 (1993-05-07)|||||","Production":"Producer Lauren Shuler Donner and screenwriter Gary Ross had known each other since taking a Stella Adler class in the 1970s, and in 1988 Ross told Shuler Donner his idea for Dave. She approved it, and after the idea was rejected by the studio she was contracted to, Warner Bros. bought the project. Ross wrote the script while working on the Michael Dukakis presidential campaign. Production waited three years for Shuler Donner to be released from her contract and for director Ivan Reitman to become available.Kevin Kline was hired to play the protagonist, as Reitman considered him to have \"a Presidential look\" and be an actor \"who was both dramatically strong and was light on his feet,\" as Kline would not only be playing a triple role but the film was a comedy that dealt with very serious subject matter. Reitman then called Sigourney Weaver, with whom he had worked in Ghostbusters, for the First Lady role. Ross was present for production, as he was interested in starting a directing career as well.[2][3]The film's Oval Office set was reused more than 25 times, for television shows and films like The Pelican Brief, Hot Shots! Part Deux and Absolute Power.[4]","produced_by":"Ivan Reitman Lauren Shuler Donner","starring":"Kevin Kline Sigourney Weaver","running_time":"110 minutes","music_by":"James Newton Howard","edited_by":"Sheldon Kahn","Release":"Dave was met with critical acclaim and has a 94% rating based on 54 reviews collected at Rotten Tomatoes. The consensus on the site states: \"Ivan Reitman's refreshingly earnest political comedy benefits from an understated, charming script and a breezy performance by Kevin Kline.\"[5]Dave debuted No. 2 at the box office, behind Dragon: The Bruce Lee Story.[6][7] It later jumped to No. 1, in its second weekend. In total, Dave made over $63 million in the domestic box office, making it a financial success.Ross was nominated for an Academy Award for his screenplay. Kline's performance was nominated for a Golden Globe Award. Charles Grodin received the American Comedy Award for Funniest Supporting Actor.Then-President Bill Clinton approved of the film, and gave Ross a framed script which Clinton had autographed, writing that it was a \"funny, often accurate lampooning of politics.\" Clinton also gave Ross a picture of himself holding a Dave mug.[8]American Film Institute recognition:","written_by":"Gary Ross"}