{"based_on":"Cutter and Bone  by Newton Thornburg","country":"United States","distributed_by":"United Artists","screenplay_by":"Jeffrey Alan Fiskin","Plot":"One rainy night, Richard Bone's (Bridges) car breaks down in an alleyway. He spots a large, mysterious car in the distance. A man dumps something into a garbage can. At first, Bone thinks nothing of it and proceeds to meet his friend, Alex Cutter (Heard). The next day, a young girl is found brutally murdered in the same alleyway where Bone abandoned his car. He becomes a suspect. When Bone spots the man he thinks is the murderer in a parade later that day – local tycoon J.J. Cord (Stephen Elliott) – Cutter begins to take an interest in the mystery that unfolds. His interest soon becomes a conspiracy theory that develops into a troublesome investigation with his skeptical friend and the dead girl's sister (Ann Dusenberry) along for the ride.","Production history":"A friend of Jeffrey Alan Fiskin had Fiskin send a screenplay to Paul Gurian, a would-be film producer. Gurian eventually informed Fiskin that he had bought the rights to the novel Cutter and Bone, and wanted to meet with Fiskin in Los Angeles.[1] Fiskin, who had little money, stole a copy of the book to read.[1] In a 1981 interview, he said of the novel, \"The set-up's great, the characters are fine. But the last half of the book is an instant replay of Easy Rider. You cannot make a film out of this.\"[1] Gurian agreed and hired Fiskin to write the screenplay. Gurian arranged for the studio EMI to back the film financially, with Robert Mulligan to direct and Dustin Hoffman to play Alex Cutter.[1] However, a scheduling conflict forced Hoffman to leave the project. This prompted Mulligan to leave as well, and EMI to pull its money.[1] Gurian took the film to United Artists, where the studio's vice president, David Field, became interested in backing it.Gurian gave Fiskin a list of directors; Ivan Passer's name was the only one the screenwriter did not recognize. Fiskin and United Artists executives screened Passer's Intimate Lighting and agreed he was the man to direct Cutter and Bone. Passer was already involved with another film, but chose to do Cutter and Bone instead after reading Fiskin's script.[1]The initial budget was to be $3.3 million, but then Field learned that United Artists would only produce the movie if the budget were reduced to $3 million and that a name star be cast.[1] The studio liked Jeff Bridges' work in the dailies for Michael Cimino's Heaven's Gate and insisted on him for Cutter and Bone.[1] Passer cast John Heard after seeing him in a Joseph Papp Shakespeare in the Park production of Othello. The studio wanted a star, but the director insisted on Heard. Lisa Eichhorn was cast as Mo after she auditioned with Bridges.[citation needed]","language":"English","Reaction":"United Artists did not like the ambiguity in what was then titled Cutter and Bone. When U.A. executives David Field and Claire Townsend, the film's biggest supporters, left for 20th Century Fox, the studio felt that they would get no credit if the film succeeded and no responsibility if it failed and so there was no interest in it.[1] Cutter and Bone became a victim of internal politics. U.A. senior domestic sales and marketing vice president Jerry Esbin saw the film and decided that it did not have any commercial possibilities.[1] Passer did not see his film with a paying audience until the Houston International Film Festival many weeks later. He said in an interview, \"They didn't do any research. I was supposed to have two previews with a paying audience. It was in my contract.\"[1]United Artists spent a meager $63,000 on promotion for the film's release in New York City, New York, in late March 1981. There all three daily papers and the three major network critics gave Cutter and Bone negative reviews.[1] Vincent Canby in The New York Times wrote, \"[I]t's the sort of picture that never wants to concede what it's about. It is, however, enchanted by the sound of its own dialogue, which is vivid without being informative or even amusing on any level.\"[2] The studio was so shocked by the negative reviews that it planned to pull the film after only a week.[1] Unbeknownst to them, the next week Richard Schickel in Time, David Ansen in Newsweek, and New York City's weekly newspapers would write glowing reviews. Ansen wrote, \"Under Passer's sensitive direction, Heard gives his best film performance: he's funny and abrasive and mad, but you see the self-awareness eating him up inside.\"[3]The positive reviews prompted United Artists to give Cutter and Bone to its United Artists Classics division, which changed the film's title to Cutter's Way (thinking that the original title would be mistaken by audiences for a comedy about surgeons) and entered it into a number of film festivals.[1] At Houston, Texas' Third International Film Festival it won Best Picture, Best Director, Best Screenplay, and Best Actor (John Heard). A week later, it was given the closing feature slot at the Seattle International Film Festival. With a new ad campaign, Cutter's Way reopened in the summer of 1981 in Seattle, Washington; Los Angeles, California; Boston, Massachusetts; and New York City, New York. Passer was bitter about the experience, commenting in an interview, \"You can assassinate movies as you can assassinate people. I think UA murdered the film. Or at least they tried to murder it.\"[4]In 1982, Fiskin won an Edgar Award from the Mystery Writers of America for Best Motion Picture Screenplay. In 1983, the film won the prestigious Grand Prix of the Belgian Film Critics Association. Writing in 2011, John Patterson called it \"note-perfect\" and a \"masterpiece\", praising all three of the lead performances, while acknowledging it required multiple viewings to perceive its strengths.[5]","box_office":"$1,729,274 (USA)","cinematography":"Jordan Cronenweth","directed_by":"Ivan Passer","cutter's_way":"Theatrical poster","release_dates":"March 20, 1981 (1981-03-20)|||||","produced_by":"Paul R. Gurian","starring":"Jeff Bridges John Heard Lisa Eichhorn Ann Dusenberry","running_time":"105 minutes","music_by":"Jack Nitzsche","edited_by":"Caroline Biggerstaff","budget":"$3 million"}