{"Cast":"Cast notes","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Al Boasberg Leon Gordon George S. Kaufman Carey Wilson","Plot":"Hugo Z. Hackenbush (Groucho Marx) is a veterinarian who is hired as chief of staff for the Standish Sanitarium, owned by Judy Standish (Maureen O'Sullivan), at the insistence of her most important patient, the rich Mrs. Upjohn, (Margaret Dumont), who insists on being treated only by Dr. Hackenbush. The Sanitarium has fallen on hard times, and banker J.D. Morgan (Douglas Dumbrille) is attempting to gain control of it. Judy hopes that Mrs. Upjohn will make a large donation and stop that from happening.Meanwhile, Judy's boyfriend, singer Gil Stewart (Allan Jones), has taken his life's savings and bought a horse with it, instead of paying for vocal lessons to further his career as a radio singer. His hope is that the horse, Hi-Hat, will win a big race, and the money will save the sanitarium. Unfortunately, he now has no money to pay for the horse's feed, and he and Tony (Chico Marx), who works for the sanitarium, and Stuffy (Harpo Marx), Hi-Hat's jockey, have to resort to trickery to fend off the Sheriff (Robert Middlemass). Tony raises some money by scamming Hackenbush in the \"Tutsi Fruitsy Ice Cream\" scene, in which Tony gives Hackenbush a tip on a horse, but all in code, so that Hackenbush has to buy book after book from Tony to decipher the code.At the Sanitarium, its business manager, Whitmore (Leonard Ceeley) – who is Morgan's stooge – attempts to rattle Mrs. Upjohn's faith in Hackenbush by having her discover him in a compromising situation with a blonde floozie, (Esther Muir). Hackenbush is saved by Stuffy and Tony, who pose as house detectives and then as paperhangers, who first paste the vamp to the wall behind layers of wallpaper and then hide her under the sofa. Next, Whitmore brings in the eminent Dr. Steinberg (Sig Ruman), who exposes Hackenbush as a quack.Hackenbush, Tony, Stuffy and Gil hide out in Hi-Hat's stable, where Judy soon joins them. Morgan finds them and is about to have them arrested when the horse sees him and bolts, jumping several obstacles in the way. Gil realizes that Hi-Hat is a jumper, and enters him into the upcoming steeplechase race. After some difficulty avoiding Morgan, the race begins. Knowing that Hi-Hat is afraid of Morgan, everyone works to make Hi-Hat aware of his presence before reaching the fence.[2][3][4] On the last lap, Hi-Hat and Skee-Ball (Morgan's horse) wipe out; when they reach the finish line, it appears that Skee-Ball won. Stuffy realizes that the mud-covered horses were switched after the accident, and Skee-ball's jockey was riding Hi-Hat in the finish, thus making Hi-Hat the winner.","language":"English","Reception":"Contemporary reviews from critics continued to be positive for the Marx Brothers through their seventh film. John T. McManus of The New York Times called it \"comparatively bad Marx,\" although still deserving of \"a much better than passing grade\" because \"any Marx brothers motion picture is an improvement upon almost any other sustained screen slapstick.\"[9] Variety declared, \"Surefire film fun and up to the usual parity of the madcap Marxes.\"[10] Harrison's Reports wrote, \"Very good! The Marx Brothers are at their best and funniest here.\"[11] John Mosher of The New Yorker was also positive, writing that \"Groucho, Harpo, and Chico are in full blast again,\" and the film \"reaches a fever pitch even beyond earlier records.\"[12] The Chicago Tribune called it a \"ridiculous farce, plummed with unique gags, laugh provoking situations, fast action ... The finale sends audiences away grinning and happy.\"[13]","cinematography":"Joseph Ruttenberg","directed_by":"Sam Wood","Awards and honors":"In 2000, the American Film Institute ranked A Day at the Races as the 59th funniest film of all time in its AFI's 100 Years…100 Laughs.[14][15]","Music":"The songs in the film, by Bronislaw Kaper, Walter Jurmann, and Gus Kahn, are \"On Blue Venetian Waters\", \"Tomorrow Is Another Day,\" and \"All God's Chillun Got Rhythm\" (which features Ivie Anderson from Duke Ellington's orchestra). Two more songs were filmed but cut. One, \"Dr. Hackenbush\", was sung by Groucho about what a great doctor he is (\"No matter what I treat them for they die from something else\"). The other, \"A Message From The Man In The Moon\", sung by Allan Jones, is missing from the film but shows up in the titles, some incidental music, and is \"reprised\" by Groucho during the final scene. The DVD release includes a recently rediscovered audio recording of the song, performed by Allan Jones.The film also features a lindy hop dance sequence set to the tune of \"All God's Chillun Got Rhythm\", and featuring Whitey's Lindy Hoppers, including Willamae Ricker, Snookie Beasley, Ella Gibson, George Greenidge, Dot Miller, Johnny Innis, Norma Miller and Leon James.[8] The dance sequence was nominated for the short-lived Academy Award for Best Dance Direction.","References":"NotesFurther reading","release_dates":"June 11, 1937 (1937-06-11)|||||","Production":"The screenplay went through numerous outlines, treatments and drafts before arriving at its final version. The majority of the screenplay was written by Al Boasberg, but due to a bitter spat with MGM, he was never given any credit for his work. As they had with A Night At The Opera, the Brothers honed the comic material during a Vaudeville tour.Groucho's character was originally named \"Quackenbush\" but was changed to \"Hackenbush\" over fear of a lawsuit by a real Dr. Quackenbush.During production, Irving Thalberg, who had brought the Marx Brothers to MGM, died suddenly of pneumonia at age 37. After Thalberg's death the studio never gave the proper care to the Marx Brothers, and their three later MGM films are considered to be far inferior than the first two as a result.[7]","produced_by":"Sam Wood Irving Thalberg (uncredited) Lawrence Weingarten (uncredited)","starring":"Groucho Marx Harpo Marx Chico Marx Allan Jones Maureen O'Sullivan Margaret Dumont","running_time":"109 minutes","a_day_at_the_races":"theatrical release poster","music_by":"Walter Jermann Bronislau Kaper Franz Waxman","External links":"","edited_by":"Frank E. Hull","written_by":"Robert Pirosh George Seaton George Oppenheimer"}