{"country":"United States|Germany|","bridge_of_spies":"Theatrical release poster","distributed_by":"Walt Disney Studios Motion Pictures (North America)|20th Century Fox (International)|","Plot":"In 1957, Rudolf Abel retrieves a secret message from a bench in Brooklyn before FBI agents forcibly enter and prosecutionally arrests him as a Soviet spy. The FBI offers to drop the charges if Abel cooperates, but he refuses. He goes to a seemingly \"a fair trial\" so that the Soviet Union cannot commercialize it.The bar association asks James B. Donovan to defend Abel, being an insurance lawyer with negotiation experience; he worked on the prosecutions of Nazi war crimes in the Nuremberg trials. Donovan seriously works, although his family, firm, the prosecuting attorneys, and the judge doubt him. As the news spreads, Donovan is treated disdainful in public, but Abel accounts his determination, professionalism, and kindness.At the trial, Abel is found guilty of all charges. Before, Donovan meets the judge and argues that Abel not be sentenced to death, as he could serve as \"insurance\" if a U.S. spy is captured, and predicts a death sentence, foreign policy damage, and Soviets victory. The judge is apparently dismissive but in the end sentences Abel to 30 years imprisonment, outraging the public. Hate directs towards Donovan's office and shots are fired at his home once. Nevertheless, he appeals to the U.S. Supreme Court to overturn the conviction, presenting facts presented by an invalid search warrant, but is denied.Some time later, Francis Gary Powers goes on a Lockheed U-2 sortie over the Soviet Union, where he is shot down, captured, convicted and subjected to interrogation. The USSR sends a backchannel message to Donovan, proposing exchange of Abel for Powers. Determined to settle, Donovan agrees to handle negotiations. As the USSR gives no comment regarding Abel, the exchange is to take place in East Germany.Meanwhile, Frederic Pryor, an American economics graduate student, visits his German girlfriend in East Berlin just as the Berlin Wall is being built. He tries to immigrate her into West Berlin, but is stopped by border guards, arrested and labeled an American spy. Donovan tells his wife that he will be fishing in Scotland, and travels to West Berlin accompanied by CIA agents.Donovan goes alone to the Soviet Embassy in East Berlin, and meets Ivan Schischkin, who claims to be Second Secretary at the Embassy – Donovan's CIA handler explains that he is actually the KGB's chief in Western Europe. Schischkin wants Abel released first, and Powers released several months after, but Donovan insists on a simultaneous release. Donovan also wants Pryor released as well, but Schischkin informs him that Pryor is held by East Germany. Donovan begins to understand that the interests of the USSR and GDR do not overlap: The USSR want Abel, but the GDR wants to be a nation and ally to them – as a result, both want Abel selfishly. Donovan meets Wolfgang Vogel, a GDR lawyer who supposedly represents Abel's family, and arranged the Abel-Pryor exchange.Although the CIA only wants Powers, it allows Donovan to negotiate for Pryor as long as the Abel-Powers deal is not jeopardized. Schischkin informs Donovan that the USSR agrees with him, and sets the exchange on the Glienicke Bridge. However, Vogel pulls out after discovering the deal Donovan made with the Union. Donovan is contacted by Vogel's superior, Harald Ott, East German attorney general, and goes to his office suggesting the 2-for-1 deal albeit the CIA's refusal, but Ott bluntly refuses and sends him out. Donovan sends a message via secretary to him, stating that the U.S. wants both Pryor and Powers for Abel, or the entire deal will void; Abel's talking might also damage alliances. At evening, the GDR calls and accepts the deal.At the Glienicke Bridge, Donovan meets Abel. On the other side, Powers appears, but Pryor is to be released at Checkpoint Charlie instead. Both sides urge to finish, but Donovan wants to wait for Pryor's release. Out of gratitude, Abel waits. Eventually, Pryor is taken to Charlie, and Abel is exchanged for Powers instantly.An exhausted Donovan arrives at home from the \"fishing trip\" and goes upstairs, while the family watches the news mentioning him. They find him sound asleep.","language":"English","Reception":"As of February 25, 2016[update], Bridge of Spies has grossed $72.2 million in North America and $92.1 million in other territories for a worldwide total of $164.3 million, against a budget of $40 million.[5]In the United States and Canada, pre-release tracking predicted Bridge of Spies to open to around $15–20 million from 2,811 theaters.[57][58] The film opened alongside Goosebumps, Crimson Peak, and Woodlawn on October 16, 2015, and also faced competition from The Martian, which was entering its third week.[59] The film made $500,000 from its early Thursday night showings and $5.3 million on its opening day.[60][61] In its opening weekend, the film grossed $15.4 million, finishing third at the box office behind Goosebumps ($23.5 million) and The Martian ($21.5 million).[62]Its biggest international markets have been Australia and South Korea, where it made $1.3 million and $922,936 respectively on its opening weekend.[5]Bridge of Spies received critical acclaim. On Rotten Tomatoes, the film has a rating of 92%, based on 251 reviews, with an average rating of 7.8/10. The site's critical consensus reads, \"Bridge of Spies finds new life in Hollywood's classic Cold War espionage thriller formula, thanks to reliably outstanding work from Steven Spielberg and Tom Hanks\".[63] On Metacritic, the film has a score of 81 out of 100, based on 48 critics, indicating \"universal acclaim\".[64] On CinemaScore, audiences gave the film an average grade of \"A\" on an A+ to F scale.[62]Richard Roeper of the Chicago Sun Times gave the film four out of four stars, and praised Spielberg's direction, saying: \"Spielberg has taken an important but largely forgotten and hardly action-packed slice of the Cold War and turned it into a gripping character study and thriller that feels a bit like a John Le Carre adaptation if Frank Capra were at the controls\".[65] Michael Phillips of the Chicago Tribune called the film a \"a confident, slightly square, highly satisfying example of old-school Hollywood craftsmanship, starring a major movie star brandishing a briefcase, and a handkerchief, rather than a pistol\".[66] The A.V. Club's Ignatiy Vishnevetsky described it as \"one of the most handsome movies of Spielberg's latter-day phase, and possibly the most eloquent [...] Bridge of Spies turns a secret prisoner exchange between the CIA and the KGB into a tense and often disarmingly funny cat-and-mouse game\".[67]On the other hand, Mike Scott of New Orleans Times-Picayune, had a more mixed reaction, saying: \"Bridge of Spies, with its stop-and-go momentum, is also more merely interesting than it is full-on riveting. It's still quite good stuff, but despite its impressive pedigree... it doesn't feel as if it's quite the sum of all of its parts\".[68] Preston Jones of Fort Worth Star-Telegram gave the film 2 and a half stars out of five. Jones wrote that \"For all Spielberg, his star-packed cast, led by Tom Hanks, and his on-screen and off-screen team (Joel and Ethan Coen co-wrote the screenplay) bring to the table, Bridge of Spies is remarkable only for how stuffy and surprisingly inert the film becomes\".[69]","box_office":"$165.5 million[5]","Historical accuracy":"The film is based on the real-life events. The movie, however, departs from the historical record, though reviewers have praised the film and argued that such departures are permissible.[9]Commentators have noted that the shortening of timespans in the film at times gives a misleading impression.[10][11] One key example is the depiction of the Berlin Wall. Donovan did not see Berlin wall escapees being shot; the shootings most similar to the ones depicted were those associated with the killing of Peter Fechter that happened the summer after the Powers/Abel exchange on the Glienicke Bridge.[10][11][12] Similarly, the circumstances of Frederic Pryor's detention were not accurately portrayed – he could not have crossed a partially built wall,[11][12] and further, was convicted of obtaining \"confidential\" material.[10]Apart from the depiction of the Wall, it is notable that Donovan did not suffer quite the extent of violence depicted: he was not shot at in his home,[10][11] and he did not have his overcoat stolen.[10] The film also changed the location of Donovan's suggestion to the judge to spare Abel for the sake of a possible future exchange, which was in fact made in open court.[9][11]Abel, an English-born Soviet intelligence officer (whose real name was William G. Fisher) most likely did his best work for the Soviet Union not as a spy in a dishevelled New York City lair full of radio gear, but before and during World War II, when he trained agents and radio operators for clandestine work in Nazi-occupied regions. This training is thought to have been critical to what his mentor, Pavel Sudoplatov, later called one of the most important radio deception operations of the war.[13] Contrary to what is implied in the closing titles of the film, Abel was in fact greatly honored in the Soviet Union after his return.","cinematography":"Janusz Kamiński","directed_by":"Steven Spielberg","Soundtrack":"Frequent Spielberg collaborator John Williams was originally announced to compose the film's score. However, Williams had to drop out of production due to a health issue.[49] Thomas Newman was then contacted by Spielberg to replace Williams, marking Spielberg's first film without Williams' music since 1985's The Color Purple, which was scored by Quincy Jones.[70] Hollywood Records released the film's soundtrack on October 16, 2015.[71]All music composed by Thomas Newman.","production_companies":"DreamWorks Pictures[1] Fox 2000 Pictures Reliance Entertainment Participant Media TSG Entertainment Afterworks Limited Studio Babelsberg Amblin Entertainment Marc Platt Productions","release_dates":"October 4, 2015 (2015-10-04) (New York Film Festival)|October 16, 2015 (2015-10-16) (United States)||||","Production":"Bridge of Spies is an American-German co-production based on a script written by the Coen Brothers and Matt Charman.[14][15] Studio Babelsberg co-produced and oversaw production services for the film.[16] James Donovan wrote an account of the incident in 1964 under the title Strangers on a Bridge: The Case of Colonel Abel and Francis Gary Powers.[17] The historical background to the U-2 incident and the story of former West Berlin CIA chief William King Harvey and Operation Gold was published in Rory MacLean's Berlin: Portrait of a City Through the Centuries (2014).[18] Soviet intelligence officer Rudolf Abel, who lived and operated in Brooklyn Heights, did dead drops of stolen documents in Prospect Park. His arrest and history were discussed by Truman Capote, another Heights resident at the time, in his book A House on the Heights.Matt Charman became interested in Donovan's story after reading a footnote about him in An Unfinished Life: John F. Kennedy, 1917–1963.[19] After meeting with Donovan's son in New York City, Charman pitched the story to several studios and DreamWorks bought it. Studio co-founder Steven Spielberg became interested in the film and decided to direct.[20] Marc Platt and Kristie Macosko Krieger attached themselves as producers along with Spielberg. Joel Coen and Ethan Coen revised Matt Charman's original script.[21] According to Charman, the brothers \"were able to really punch up the negotiations on the back end of the movie, then they handed the baton back to me to do a pass after they did their pass, to make the movie just sit in a place we all wanted it to. The flavor they brought is so fun and enjoyable. It needed to be entertaining but truthful.\"[19]In June 2014, Fox 2000 Pictures agreed to co-finance the film with DreamWorks and Participant Media, with the film's distribution rights being divided between Disney and Fox.[22] During a March 3, 2015, interview with The Daily Pennsylvanian, Platt revealed the title to be Bridge of Spies; it was shot under the working title of St. James Place.[23]In May 2014, it was announced that Tom Hanks would star as James Donovan, with Mark Rylance co-starring as Abel. Amy Ryan, Alan Alda, Billy Magnussen, and Eve Hewson were reported to star in the film as well.[24][25] Participant Media co-produced the film.[26] Francis Gary Powers, Jr., founder of The Cold War Museum and the pilot's son, was brought on as a technical consultant and has a cameo in the film. The film received funds of €3.7 million, from the German Federal Film Fund (DFFF).[27]Principal photography began on September 8, 2014, in Brooklyn, New York City.[28] On September 14, filming took place in DUMBO, a Brooklyn neighborhood, where crews transformed Anchorage Street to appear as it did in the 1960s.[29][30] On September 15, filming took place in Astoria, between Astoria Park and Ditmars Boulevard. Filming was done on 18 Street and 26 Avenue in Astoria, where Spielberg was spotted transforming the 5 Corners Deli into a 1950s grocery store.[31][32][33] On September 26, filming took place on 44th Street in Manhattan, as evidenced by crews stationed on 44th Street, between Madison and 6th Avenues. On September 27, Hanks was spotted filming scenes on Wall Street among extras wearing 1960s costumes.[34] On September 28, filming of some day and night scenes took place on the corner of Henry Street and Love Lane in the Brooklyn Heights neighborhood of Brooklyn, where the block was set with vintage cars, street signs, rain machines, and spotlights.[35] On September 29, filming took place on Hicks Street and Pineapple Street, where a shop, Perfect Paws, was transformed into a 1960s dress shop named Brooklyn Pearl,[36] and at the NYS Appellate Division courthouse on Monroe Place and Pierrepont Street. On October 6, Hanks and the crew were spotted on the same location on Hicks Street.[37]In early October, after filming wrapped in New York City, further production began at Babelsberg Studios in Berlin and Potsdam, Germany, and would last there through the end of November.[38][39] Filming in Berlin began with shooting at the former Tempelhof Airport in October, for scenes that actually took place there, such as Donovan's descending from an historic C-54 Skymaster.[40] A prisoner exchange scene was filmed on the Glienicke Bridge (the so-called \"Bridge of Spies\"), where the historical exchange actually took place in 1962.[41][42] The bridge spans the Havel narrows between Berlin and Potsdam, and was closed to traffic for filming over the last weekend of November.[43][44] German Chancellor Angela Merkel visited the set to watch the filming of these scenes.[45] Principal photography officially ended on December 4, at Berlin Tempelhof.Shooting also took place in Wrocław, Poland, in the second half of November.[38][46] During mid-December, filming took place at Beale Air Force Base, located near Marysville, California.[47]Glienicke Bridge in Potsdam/Berlin during filmingPeriod vehicles on Monroe Place in Brooklyn Heights during filmingSprinklers during filming in Brooklyn HeightsThe film was shot on 35mm motion picture film, including KODAK VISION3 250D Color Negative Film 5207 and KODAK Vision3 500T Color Negative Film 5219.[48]","produced_by":"Steven Spielberg|Marc Platt|Kristie Macosko Krieger|","starring":"Tom Hanks|Mark Rylance|Amy Ryan|Alan Alda|","running_time":"141 minutes[2][3]","music_by":"Thomas Newman","edited_by":"Michael Kahn","Release":"Bridge of Spies was distributed in North America by Walt Disney Studios Motion Pictures, through its Touchstone Pictures banner.[49][50] Disney held the film's world premiere on October 4, 2015[51] at the 53rd annual New York Film Festival.[52][53] The film went into general theatrical release in the United States on October 16, 2015.[54] 20th Century Fox distributed the film in the remaining international territories.[49]The theatrical poster for the film was released on June 4, 2015,[55] with the first trailer appearing online the following day.[56]The film was released by Touchstone Home Entertainment on Blu-ray, DVD, and digital download in North America on February 2, 2016 and by 20th Century Fox Home Entertainment in other territories.","written_by":"Matt Charman|Joel Coen Ethan Coen|","budget":"$40 million[4]"}