{"Cast":"At the time of production, Iowa-born actor Gary Kroeger was mostly remembered for his work on the late-night comedy and variety TV show Saturday Night Live, where he was a regular from 1982 to 1985.[4] Although Kroeger had starred in a few films prior to and after A Man Called Sarge, this is the only time he played the title role in a feature film.[5] He had previously worked with director Stuart Gillard as the main character in Disney's 1987 television movie The Return of the Shaggy Dog.Marc Singer was a well established TV actor when he enrolled as General Von Kraut, with a career spanning almost 20 years, including the lead role in the highly successful series V.[6] As a feature actor, he was best known for the 1982 film The Beastmaster, which grew a cult film status. A Man Called Sarge marks a return to the big screen and the start of a prolific film career during the 1990s. This was the Canadian-American actor's second collaboration with producer Gene Corman, the first being If You Could See What I Hear, released in 1982. They worked together again on Watchers II, released in the summer of 1990.Canadian actress Gretchen German had an active television career since the mid-'80s when she was cast for the role of Sarge's love interest, Miss Sadie, marking her debut in feature film.[7][8]American actress Natasha Lyonne, who was living in Israel at the time,[9] achieved her first credited feature film role as a young Arab girl who gets punched in the face by General Von Kraut, while trying to defend Miss Sadie, her teacher. She is credited as Natasha Leon.[10] She continued her acting career in the United States and is mainly recognized for her supporting role in the American Pie film series.","country":"United States","distributed_by":"The Cannon Group","language":"English","box_office":"$92,706 (domestic)","cinematography":"David Gurfinkel","directed_by":"Stuart Gillard","Production notes":"A Man Called Sarge was produced by Gene Corman, brother and production partner of Roger Corman,[11] from a 1988 script by director Stuart Gillard.[12] Serving as executive producers were Yoram Globus and Christopher Pearce, heads of Cannon Pictures at the time. This film is part of the early 1990s attempt by Globus, an Israeli veteran producer, to save and rebuild Cannon under new administration, after the departure of his cousin and longtime business partner Menahem Golan and the financial distress in the late 1980s.[13] Eventually, The Cannon Group filed bankruptcy a few years later.Gene Corman had previously produced Tobruk, a 1967 war action film, set during the failed British attempt to capture Tobruk, in September 1942.Although the city of Tobruk is located in Libya, filming was done in Israel. One of the final scenes, the showdown between Sarge and Von Kraut, was shot in the Khan al-Umdan caravanserai, in the historical centre of Acre.","narrated_by":"Don LaFontaine","a_man_called_sarge":"Promotional poster","release_dates":"February 2, 1990 (1990-02-02) (US)|||||","produced_by":"Gene Corman|Executive Producers:|Yoram Globus|Christopher Pearce|Associate Producer:|Itzik Kol|","starring":"Gary Kroeger|Gretchen German|Jennifer Runyon|Marc Singer|Bobby Di Cicco|Andy Bumatai|","running_time":"88 minutes","music_by":"Chuck Cirino","edited_by":"Richard Candib","Release":"A Man Called Sarge had a short-running theatrical release on February 2, 1990, earning $92,706 at the domestic box office.[14] It was released on VHS later the same year and re-released in 2001, as an Amazon.com exclusive.[15] The film received a PG-13 rating from the MPAA, ab 16 from FSK[16] and 15 from the BBFC.On some promotional material, the taglines used were:Like many other low-budget films, A Man Called Sarge has a complex history of copyright ownership and distribution rights. Cannon Releasing, part of The Cannon Group, handled the theatrical distribution rights. Worldwide video distribution was in charge of Cannon Video, in association with several partners, including MGM/UA Home Video and Warner Home Video. Currently, the film's rights are owned by MGM, after the acquisition of The Cannon Group catalogue, almost in its entirety, following bankruptcy in 1993.Although British actor Andy Greenhalgh, who played the role of Major Browning, estimates this to be \"a long-forgotten American feature film\",[17] it occasionally airs on TV channels around the world, mainly through the MGM Channel and its affiliates.[18][19]A home video edition was officially released on DVD in November 2011, as part of the Limited Edition Collection - MGM's On-Demand DVD-R line.[20]","written_by":"Stuart Gillard"}