{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Lieutenant Ted Jackson (Elvis Presley) is a former U.S. Navy frogman who divides his time between twin careers as a deep sea diver and nightclub singer. Ted discovers what he believes could be a fortune in Spanish gold aboard a sunken ship and sets out to rescue it with the help of go-go dancing yoga expert Jo Symington (Dodie Marshall) and friend Judd Whitman (Pat Harrington, Jr.). Gil Carey (Skip Ward), however, is also after the treasure and uses his girlfriend Dina Bishop (Pat Priest) to foil Ted's plans.Elvis sings six songs in the movie: the title song, \"I'll Take Love\", \"Sing You Children\", \"You Gotta Stop\", \"Yoga Is as Yoga Does\" in a duet with Elsa Lanchester, and \"The Love Machine\".","language":"English","easy_come,_easy_go":"Theatrical release poster","box_office":"$1,950,000(US/ Canada)[1][2][3]","cinematography":"William Margulies","production_company":"Paramount Pictures","directed_by":"John Rich","Soundtrack":"Recording sessions took place on September 28 and 29, 1966, at Paramount Studio in Hollywood, California. After the relative freedom of the Nashville sessions in May that yielded How Great Thou Art and other songs more to his taste, Presley was reportedly unhappy with the quality of the songs selected for the film, allegedly referring to the selections as \"shit\" during the recording session.[6] It is often reported[7][8] that Presley recorded \"Leave My Woman Alone\" for the film, but only an instrumental backing was ever recorded; Presley never recorded a vocal for the song.[9][10] Seven selections were recorded for the film; the song \"She's A Machine\" was not used in the movie, but would be released on Elvis Sings Flaming Star the following year.[11]The remaining six appeared on an extended play single released to coincide with the March 1967 premiere of the film. It failed to chart on the Billboard Hot 100, and sold fewer than 30,000 units total.[12] Given that the EP format was no longer a viable marketing medium, and the poor performance of Easy Come, Easy Go, it was the final release of new material by Presley in the EP format.[12] The British issue, however, did top the UK EP charts despite featuring only four of the six tracks on the US edition (\"The Love Machine\" and \"You Gotta Stop\" were omitted).[13]","release_dates":"March 22, 1967 (1967-03-22) (USA)|||||","Production":"Paramount originally intended to make a movie called Easy Come Easy Go starring Jan and Dean with director Barry Shear but it was cancelled when the stars and several crew were injured in a train crash.[5]","produced_by":"Hal B. Wallis","starring":"Elvis Presley|Pat Priest|","running_time":"95 minutes","music_by":"Joseph J. Lilley","edited_by":"Archie Marshek","written_by":"Allan Weiss|Anthony Lawrence|","budget":"$2,000,000"}