{"directed_by":"Humberto Solás","country":"Cuba","release_dates":"May 1982 (1982-05)|||||","Plot":"The film takes place in 19th-century Cuba. Cuban society is split over race, as there are deep divisions between the whites, their black slaves, and the mulattos, people of mixed race, that are caught in between. The story follows Cecilia (Daisy Granados), her experiences with love, and the beginnings of the Cuban slave rebellion.[2]","produced_by":"Humberto Hernández","starring":"Daisy Granados","running_time":"159 minutes","language":"Spanish","Critical reception":"Solás's 1982 megaproduction, the most expensive project undertaken by ICAIC to date, was released simultaneously as a six-hour miniseries for Spanish television, a four-hour motion picture for Cuban audiences, and a two-hour film for international release. According to Michael Chanan, \"no Cuban film ever prodded a raw nerve more insistently that this one, revealing in the process the dangers of interfering with certain types of cultural icons.\" [3] Critics were unanimous in their outrage and disgust at Solás's versión libre of a canonical work and, yet, Solás consistently spoke of Cecilia as a successful film in personal terms until his death in 2008.Solás erased the most shocking element of the novel - that, unbeknownst to them, Cecilia and Leonardo were sister and brother and, thus, incestuous lovers - and inserted, instead, a subtext that emphasizes Santería as the force that shapes the destiny of the characters. While the film shares with the novel an abolitionist stance and an abhorrence of the racist practices that permeated colonial Cuban society, it highlights the importance of religious syncretism and transculturation in a way that Villaverde's work could not.Solás's film is a 20th-century response to a canonical text, grounded in the teachings of Fernando Ortiz, Lydia Cabrera, Natalia Bolívar, Miguel Barnet and other scholars who claim that Afro-Cuban culture is an integral part of Cuban national identity. By bringing Santería into the open and casting Cecilia as a practitioner of it, Solás makes visible that which was invisible in the 19th century novel. He resurrects the belief system of Villaverde's black and mulatto characters, making it central to the plot of his film and drawing clear parallels between it and Catholicism as contentious systems of reference in colonial society. Equally important, the projection of a religious theme on to a 19th-century-storyline allows Solás to look at something suppressed and driven underground in Cuba at the time his film was made: the continued presence of Santería as an undercurrent in contemporary Cuban culture and its power to subvert dominant paradigms. It was this aspect of the film that agitated and inflamed critics like Mario Rodríguez Alemán, who called the ending of the film \"repulsive,\" condemned it for its \"excessive religious charge,\" the predominance of the \"sacred,\" and \"the priority given to myth, oneiricism, mysticism, and folklore,\" which relegated \"the political and social connotations of Villaverde's original to the background.\"[4]","edited_by":"Nelson Rodríguez","written_by":"Jorge Ramos Nelson Rodríguez Humberto Solás Norma Torrado Cirilo Villaverde","cinematography":"Livio Delgado"}