{"country":"UK","distributed_by":"Goldfarb Distribution Nucleus Films Ltd (DVD)","Plot":"The film opens in 1975 at a place called Headstone Manor, which is being used as a \"businessman's weekend retreat and girls' summer camp\". A few minutes into the film, a group of satanic monks enter the house and kill 18 of its occupants.In 1983, Doctor Lucas Mandeville (Kenny Everett) and Doctor Barbara Coyle (Pamela Stephenson) are sent to investigate radioactive readings in the area that have been traced to Headstone Manor, now known by locals as the House of Death.Along with several other scientists, Mandeville and Coyle set up their equipment in the house, while the Sinister Man (Vincent Price), a 700-year-old Satanic priest, prepares a rite in the nearby woods to purge the house of its unwanted guests.During this time, Mandeville reveals that he was once a successful German surgeon named Ludwig Manheim, who was reduced to \"smart-arse paranormal research crap\" after a humiliation in the past. Coyle also encounters a poltergeist, and the two engage in sexual intercourse.Several satanic clones of Mandeville, Coyle and the other scientists enter house, and begin killing off the originals and taking their place. When Coyle is about to be killed, she is rescued by the poltergeist and saved. The satanic monks then take off in a spaceship, revealing that these monks are aliens using the house for their activities on Earth. The film ends with the spaceship soaring into the skies, with an E.T. voice groaning: \"Oh, shit! Not again!\".","bloodbath_at_the_house_of_death":"Kenny Everett on the film poster","language":"English","cinematography":"Dusty Miller, Brian West","directed_by":"Ray Cameron","release_dates":"1984","Production":"Laurence Myers agreed to produce the film when the makers almost lost their financing.[2] The film was shot entirely on location at Potters Bar in Hertfordshire, England.[3] Michael McIntyre (the son of director Ray Cameron) reveals in his autobiography that he was the voice of E.T.[4]Myers recalls that the film did not make sense; he screened the film for censor James Ferman, who enjoyed the film, but believed that the reels were played in the wrong order.[2]","produced_by":"Laurence Myers, John Downes, Ray Cameron","starring":"Kenny Everett, Pamela Stephenson, Vincent Price, Gareth Hunt","running_time":"88 min.","music_by":"Mark London, Mike Moran","edited_by":"Brian Tagg","Release":"The film was released in the United Kingdom by Thorn EMI. It was produced in the aftermath of Kenny Everett's outburst at the Young Conservatives conference in which he called for the bombing of Russia; as a result, the media frequently referenced the film in negative context in relation to the outburst during the production, and film critics reviewed the film harshly.[2] Film critic Martyn Auty wrote: \"Presumably intended as high camp; looks like low-grade Carry On.\"[5] It was given an 18 certificate in the United Kingdom.The film was released on DVD in the United Kingdom in July 2008, with a re-rating to a 15 certificate.[6]A novelization of the film was also published, which named Marcel Wave (one of Kenny Everett's TV characters) as the resident who underwent spontaneous combustion.","written_by":"Ray Cameron, Barry Cryer"}