{"based_on":"Art School Confidential  by Daniel Clowes","art_school_confidential":"Theatrical release poster","country":"United States","distributed_by":"Sony Pictures Classics","screenplay_by":"Daniel Clowes","Plot":"Starting from childhood attempts at illustration, young Jerome pursues his true obsession to art school. Jerome enrolls in Strathmore, an urban college. His roommates are aspiring filmmaker Vince and closeted-gay fashion major Matthew. Jerome looks for love amongst the coeds, but is turned off by them all, before falling in love with the art model, Audrey. In his art classes, he forms a friendship with perennial loser, Bardo, who guides him through the college scene and introduces him to a failed artist, Jimmy, a belligerent drunk.As Jerome learns how the art world really works, he finds that he must adapt his vision to the reality that confronts him. The community has been wracked by a serial killer, the Strathmore Strangler, who has confounded the police. As Jerome slowly loses his idealism at art school, he finds himself in competition with a strange newcomer, Jonah (an undercover detective), both for Audrey's affection and for artistic recognition.In a wild attempt to win a prestigious art competition, Jerome asks for, and gets, Jimmy's paintings, all of which are of the Strangler's victims. Jerome leaves a lit cigarette in Jimmy's apartment by accident, setting a fire and burning up the apartment and Jimmy. The police arrest Jerome as the Strangler (who in fact was Jimmy); Audrey realizes that her true love is Jerome and that she was stupid to be in love with Jonah (who is actually married); and Jerome is sent to prison. Jerome's paintings, especially one of Audrey, become prized by collectors; Vince scores a huge hit with his documentary of the Strangler called My Roommate: The Murderer. In prison, Jerome continues to paint and sells his works at high prices, not caring that people think he is the killer, while all the while Audrey is still in love with him. At the end, Audrey and Jerome share a kiss through the protective glass.","language":"English","Reception":"Art School Confidential received mixed feedback from critics. Review aggregator Rotten Tomatoes reports that 36% of 134 film critics have given the film a positive review, with a rating average of 5.4 out of 10.[2] Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, gives the film a score of 54 based on 42 reviews.[3]","box_office":"$3,306,629","cinematography":"Jamie Anderson","production_company":"United Artists Mr. Mudd Productions","directed_by":"Terry Zwigoff","release_dates":"January 23, 2006 (2006-01-23) (Sundance)|May 5, 2006 (2006-05-05)||||","produced_by":"Daniel Clowes John Malkovich Russell Smith Lianne Halfon","starring":"Max Minghella Sophia Myles John Malkovich Anjelica Huston Jim Broadbent Matt Keeslar Ethan Suplee Joel David Moore","running_time":"102 minutes","music_by":"David Kitay","edited_by":"Robert Hoffman","budget":"$5 million"}