{"Sequels and spin-offs":"The film was followed by seven sequels. Beethoven's 2nd was released to theaters in 1993. The remaining sequels were direct-to-video films: Beethoven's 3rd (2000), Beethoven's 4th (2001), Beethoven's 5th (2003), Beethoven's Big Break (2008), Beethoven's Christmas Adventure (2011), and Beethoven's Treasure Tail (2014).[7] An animated TV series was also created around the films that debuted in 1994. Dean Jones voiced the role of George Newton in this series after playing Dr. Herman Varnick in the film and Nicholle Tom reprised her role, voicing Ryce Newton.","country":"United States","distributed_by":"Universal Pictures","Plot":"A group of puppies are stolen from a pet store by two thieves. The St. Bernard escapes and sneaks into the Newton's home. The workaholic father, George Newton, doesn't want the responsibility of owning a dog, but his wife, Alice, and their children, Ryce, Ted and Emily, convince him. Emily plays a portion of Ludwig van Beethoven's Fifth Symphony, he barks along and they name him Beethoven.Beethoven helps the children overcome their problems: he helps Ryce talk to her crush, scares off the bullies for Ted and saves Emily's life when she falls in the swimming pool of an irresponsible babysitter. George, jealous of the affection Beethoven receives, feels neglected as the family fawns over the dog. Beethoven's antics ruin a barbecue he is hosting for Brad and Brie, venture capitalists looking to invest in and secretly swindle him out of his car freshener firm.The family takes Beethoven to a veterinarian, Dr. Herman Varnick, for a routine medical examination and immunizations. They are unaware that he is involved in unethical and deadly animal experimentation and hired the two thieves. He speaks to George and tells him of a supposed mental instability among St. Bernards making them potentially dangerous to humans and advises him to watch Beethoven closely for any sign of viciousness. He actually requires large-skulled dogs such as St. Bernards for an ammunition test.Dr. Varnick visits the Newton home under the guise of doing a follow-up exam on Beethoven. He puts fake blood on his arm and hits Beethoven until he leaps on him. He tells George that Beethoven has to be euthanized or he will press charges. Emily, who saw Dr. Varnick hit him, protests that the attack was fake, but George, fearing for his family's safety, reluctantly takes him to Dr. Varnick's office. It is on the way there that George discovers his own affections for him: he remembers his father had to take their dog to the vet to be euthanized and he never forgave him for it. He fears that his own family will hate him now for taking Beethoven to be put down. When he returns home with the empty leash and collar, his family leaves the dinner table rather than remain with him.After recognizing the children's sadness and having a conversation with Alice, the family goes to Dr. Varnick's office, but he claims that Beethoven has already been put down. George notices that Dr. Varnick has no bite marks on his arm and punches him. The family follows Dr. Varnick to his warehouse. Beethoven breaks free but is recaptured by Harvey and Vernon, while Alice calls the police. George crashes through the skylight just as Dr. Varnick prepares to shoot Beethoven. Before he can, a captive Jack Russell Terrier bites him in the crotch, causing him to fire a shot in the air. During the fight, Ted drives the car into the building, launching numerous syringes into Varnick, sedating him. As the family frees all the captive dogs, they notice Harvey and Vernon trying to escape and send the dogs after them. They escape into a junkyard, only to be attacked by a pack of Dobermans guarding it.Dr. Varnick, Harvey, and Vernon are arrested for animal abuse. The family is praised as heroes by the news and George takes a new liking to Beethoven. Ryce also gets a phone call from her crush. The family then goes to sleep, saying good night to Beethoven and all of the dogs they rescued, who are all sleeping in the Newtons' bedroom.","language":"English","Reception":"The film grossed $57,114,049 in North America and $90,100,000 in other territories, for a total of $147.2 million worldwide.[1][2][3]The film received mixed reviews from critics. Based on 26 reviews collected by Rotten Tomatoes, it has an overall approval rating from critics of 31%, with an average score of 4.7/10.[4] Roger Ebert of the Chicago Sun Times gave the film two-and-a-half stars out of four, writing in his review, \"this is not the sort of entertainment I scour the movie pages for, hoping desperately for a new film about a cute dog. Nor did I find anything particularly new in \"Beethoven\", although I concede that the filmmakers secured an admirable dog for the title role, and that Charles Grodin, who is almost always amusing, has what fun can be had playing the grumpy dad.\"[5] Despite mixed reviews, the movie became a box-office success.","box_office":"$147.2 million","cinematography":"Victor J. Kemper","production_company":"Northern Lights Entertainment","directed_by":"Brian Levant","Music":"The soundtrack to Beethoven was released on December 15, 1992.","release_dates":"April 3, 1992 (1992-04-03) (US)|July 24, 1992 (1992-07-24) (UK)||||","beethoven":"Theatrical release poster","produced_by":"Joe Medjuck Michael C. Gross Ivan Reitman","starring":"Charles Grodin|Bonnie Hunt|Dean Jones|Oliver Platt|Stanley Tucci|","running_time":"87 minutes","music_by":"Randy Edelman","edited_by":"William D. Gordean Sheldon Kahn","written_by":"Edmond Dantès Amy Holden Jones","budget":"$18 million"}