{"country":"Canada","Plot":"Cowards Bend the Knee is set in a vague time period that is stated in the published script and on the DVD commentary as the 1930s, although certain of the film's events (e.g., the Winnipeg Maroons winning the Allan Cup) did not occur until the 1960s.[6] Guy Maddin (played by Darcy Fehr), star hockey player for the Winnipeg Maroons, is told by his father Maddin Sr (Victor Cowie), the team's announcer, to visit his mother in the hospital since she is gravely ill. Maddin instead takes his girlfriend Veronica (Amy Stewart) to get an illegal abortion at the home/beauty salon/bordello of Liliom (Tara Birtwistle). During the operation, Guy more or less forgets about Veronica and ends up leaving with Liliom's alluring daughter Meta (Melissa Dionisio). Veronica dies as a result of the botched abortion and perhaps despair at her abandonment.Meta reveals that her father, Chas, was murdered by Liliom with help from the police captain Shaky, who also plays hoceky with Guy. Chas's hands, stained blue from hair dye, were severed during the murder and Meta keeps them with her in a jar. She rejects Guy's sexual advances, saying that she won't be his until he murders Liliom and Shaky to revenge Chas. The abortionist/hockey team's doctor, Dr. Fusi (Louis Negin) agrees to sever Guy's hands and suture Chas's hands in their place.However, while Guy is sedated and Meta is gone, Dr. Fusi just throws the hands away and paints Guy's own hands blue. Believing himself possessed by Chas's murderous hands, Guy sets out to kill Liliom but instead ends up trying to seduce her and eventually \"fists\" her in the beauty salon. Veronica's ghost has meanwhile risen and takes a job at the beauty salon, as does Guy. Guy becomes infatuated with Veronica's ghost, not recognizing her as the girlfriend he abandoned to die on the operating table (he has forgotten Veronica completely by this point).Tormented, Guy discovers a wax museum that has been hidden and forgotten in the rafters of the Winnipeg hockey arena. The museum features wax sculptures of famous Winnipeg Maroons, including Chas. Meta continues to coerce Guy to carry out her revenge plans. Guy ends up murdering Shaky during a hockey game, and feeling guilty attempts to confess his crime to the policeman Mo, but Mo refuses to arrest Guy and tries to get him to stop confessing. Guy then strangles Mo to death in the middle of the police station but none of the other officers notice.Veronica's ghost has meanwhile begun dating Guy's father, Maddin Sr. after Guy's mother dies, unvisited. Guy is now involved with both Meta and Liliom (who he's promised Meta he will kill) while in love with the ghost of his ex-girlfriend Veronica, whose death he is somewhat responsible for and who is now involved with his own father. The pressure of the situation, in addition to the delusion that he is possessed by the murderous hands of Chas, drives Guy to finally strangle Liliom when she tries to stop Veronica's ghost from having a second abortion of unknown origin (presumably his father's child and thus his sibling, or perhaps his child needing to be aborted a second time). Meta by this time has soured on Guy and demands that Fusi returns her father's hands to her. Dr. Fusi then chloroforms Guy again and amputates his blue-painted hands.Handless, Guy heads to the hockey arena and suits up for the big game, taping his hockey gloves over his fresh stumps. Guy heads to the urinal pre-game, but finds peeing a difficult tasks with no hands. At the urinal, he encounters his father, Maddin Sr., and sees that his father's penis is exceptionally large (much larger than his own). During the game, Maddin Sr. announces while stroking a block of ice carved into the shape of a woman's breast. Veronica's ghost, aroused by this, walks across the catwalk over the arena's ice towards the radio booth. Guy also climbs to the top of the arena and heads into the wax museum, where tarot cards predict \"a mysterious apocalypse.\" Maddin Sr. and Veronica's ghost enter to announce that Guy's old girlfriend will be his new mother. The anguished Guy invokes the wax heroes of hockey old to aid him, and they in fact do awaken, having revealed themselves not to be wax heroes at all but cowards who have chosen immobility as an escape from life.Guy and the hockey immortals pursue Maddin Sr. and Veronica's ghost out of the room and onto the catwalk. Meta sees her father Chas among the wax immortals and rushes to meet him. She attempts to reenact the childhood game that Chas and Meta used to play — she swooned and he caught her — but since Chas no longer has hands, he cannot catch her and she falls to her death. Guy then joins the wax immortals in the museum, in cowardly retreat.","language":"Silent","Critical reception":"Cowards Bend the Knee received very positive reviews, with review aggregator Rotten Tomatoes reporting a 95% approval rating based on 19 reviews.[13] Metacritic, which assigns a weighted average score out of 100 to reviews from film critics, posts a rating score of 82 based on 10 reviews.[14]Critic J. Hoberman of The Village Voice called the film \"Maddin's masterpiece,\" noting that the film \"not only plays like a dream but feels like one.\"[15]","cinematography":"Guy Maddin","directed_by":"Guy Maddin","release_dates":"February, 2003 (Canada) October 26, 2003 (UK) July 11, 2004 (U.S.)","produced_by":"Philip Monk","starring":"Darcy Fehr Melissa Dionisio Amy Stewart Tara Birtwhistle Louis Negin","running_time":"60 min.","edited_by":"John Gurdebeke","Release":"Cowards Bend the Knee was released to home video on DVD by Zeitgeist Video in 2005.[7] Cowards Bend the Knee is also included on the DVD boxed set The Quintessential Guy Maddin: 5 Films from the Heart of Winnipeg, released by Zeitgeist Video, alongside Archangel, Dracula: Pages from a Virgin's Diary, Twilight of the Ice Nymphs, and Careful.[8]Guy Maddin wrote a lengthy treatment for the feature film Cowards Bend the Knee, which he published as a book through The Power Plant gallery.[9]The book contains a foreword by Wayne Baerwaldt (then-Director of The Power Plant) and an introduction by Philip Monk, who also edited the book and curated Maddin's installation. The main text is followed by an interview with Guy Maddin conducted by Robert Enright. The book also contains stills from the film and a list of credits for the film.[9]Most of the text is Maddin's treatment for the film, which follows the same plot. In the words of Baerwaldt, the story is a fictional \"autobiography [that] features a diabolical plot surrounding a coward on a mission [named Guy Maddin] that resembles a cycle of dark spectacles dressed up as, among other things, lewd seduction, Canadian hockey, murder, amputations, hair design, general mayhem, fetish attractions and heartfelt loss.\"[10]In the interview with Enright, Maddin notes that the book's genesis began with Maddin's intention to clarify the narrative of his films, since \"it is a source of continuing frustration that people would say --- and it was always a compliment --- we really like your films, they're so non-narrative. So I thought, damnit, I'm going to get a story that people are going to recognize, something that has legs. I started reading Greek tragedy, Electra, Medea and stuff like that, and basically I just took some premises from these super-durable stories. The things I end up layering around these rock-solid premises are invariably pure autobiography [. . .] once I slipped away what little remained of Euripides, what was left was some core sample of me.\"[11]Maddin's book treatment is written in a highly literary fashion that is not typical of screen treatments, so that the text reads like a literary work rather than a blueprint for the film: \"It is the night before the [Winnipeg] Maroons' first game against the Soviets. Meta and Guy lie in bed, in the midst of a particularly spectacular recital of what could be called THE LIMBO-DANCE OF SELF-PITY --- a verbal choreography performed by lovers who manipulate each other through complicated displays of insincere self-loathing. Participants enter the Limbo in hopes of restructuring the unspoken terms of their relationship.\"[12]","written_by":"Guy Maddin Adam Gierasch"}