{"country":"United States","distributed_by":"United Artists","language":"English","box_office":"over $2 million[2]","cinematography":"W. Howard Greene","production_company":"Selznick International Pictures","directed_by":"William A. Wellman","Home media":"The film was released on Blu-ray in the U.S. by Kino Lorber Inc. on February 2012, featuring an authorized edition from the estate of David O. Selznick from the collection of George Eastman House.","Remakes":"A Star Is Born has already been remade twice, in 1954 with Judy Garland and James Mason, and in 1976 with Barbra Streisand and Kris Kristofferson. Warner Bros. has plans to finance another remake, with Clint Eastwood possibly directing the film, while singer-actress Beyoncé Knowles is \"in negotiations\" with the studio to play the female lead. On October 11, 2012, it was announced that Knowles had withdrawn from consideration.[21] In March 2015, it was announced that Bradley Cooper entered negotiations to direct and co-produce the remake.[22]","release_dates":"April 20, 1937 (1937-04-20)|||||","Production":"A Star Is Born was filmed from October to December 1936 with an estimated budget of $1,173,639,[3] and premiered in Los Angeles, California on April 20, 1937 at Grauman's Chinese Theatre.[4][5] The film's New York premiere took place two days later at Radio City Music Hall.[6]It is not known how much Dorothy Parker contributed to the finished script. When she first saw the film, Parker was proud of her contribution and boasted about both the script and the film, but in later life she believed that she had contributed nothing of significance.[7]Early in their careers, Budd Schulberg (then a script reader for David O. Selznick) and Ring Lardner, Jr. (who was working in Selznick's publicity department) were assigned to write some additional dialogue for the film, a collaboration which produced Janet Gaynor's (and the film's) final words: \"This is Mrs. Norman Maine.\" The line was used again in the 1954 Warner Bros. musical remake starring Judy Garland and James Mason.[8] George Cukor, who directed the remake, suggested adding the scene in the 1937 film where Menjou offers the fading star a supporting role.","running_time":"111 minutes","Adaptations to other media":"At the time of the release of the film, a 15-minute transcription – a pre-recorded radio show issued on 16-inch disc – promoting the film's release was made. The narrated promotional radio show included sound clips from the film. The show was recorded and released through the World Broadcasting System, with disc matrix number H-1636-2.The film was adapted as a radio play on the September 13, 1937 episode of Lux Radio Theater with Robert Montgomery and Janet Gaynor, the November 17, 1940 episode of The Screen Guild Theater starring Loretta Young and Burgess Meredith, the December 28, 1942 episode of Lux Radio Theater with Judy Garland and Walter Pidgeon, the June 29, 1946 episode of Academy Award Theater, starring Fredric March,[20] the May 23, 1948 episode of the Ford Theatre and the June 16, 1950 episode of Screen Director's Playhouse starring Fredric March.","budget":"$1.2 million[2]","Background":"Some film historians believe that the marriage of Barbara Stanwyck and Frank Fay was the film's real-life inspiration. John Bowers has also been identified as inspiration for the Norman Maine character and the dramatic suicide-by-drowning scene near the end of the film (Bowers drowned in November 1936). The film contains several inside jokes, including Gaynor's brief imitations of Greta Garbo, Katharine Hepburn, and Mae West; the \"Crawford Smear\", referring to Joan Crawford's lipstick; and the revelation that the glamorous Norman Maine's real last name is Hinkle. (Hinkle was the real last name of silent film star Agnes Ayres, and not far removed from Fredric March's real last name, Bickel.)This film also has some similarity to the earlier film What Price Hollywood? (1932), released by RKO Radio Pictures. The 1932 film's original title was The Truth About Hollywood based on a story by Adela Rogers St. Johns. St. Johns loosely based her plot on the experiences of actress Colleen Moore and her husband, alcoholic producer John McCormick (1893–1961), and the life and death of director Tom Forman, who committed suicide following a nervous breakdown.[9]Four years after What Price Hollywood? was released, Selznick approached George Cukor and asked him to direct A Star Is Born. Cukor felt the plot was too similar to What Price Hollywood? so he declined. RKO executives considered filing a plagiarism suit against Selznick International Pictures because of the similarities in the story, but eventually chose not to take legal action. Cukor later directed the 1954 musical remake starring Judy Garland.[10][11]A common Hollywood myth about the film is that Lana Turner appeared as an extra in one of the scenes in the film. Turner often denied the myth over the years, mentioning that she was discovered several months after the picture had finished production.","a_star_is_born":"original theatrical poster","Plot":"North Dakota farmgirl Esther Victoria Blodgett (Janet Gaynor) yearns to become a Hollywood actress. Although her aunt and father discourage such thoughts, Esther's grandmother (May Robson) gives her her savings to follow her dream.Esther goes to Hollywood and tries to land a job as an extra, but so many others have had the same idea that the casting agency has stopped accepting applications. Esther is told that her chances of becoming a star are one in 100,000. She befriends a new resident at her boarding house, assistant director Danny McGuire (Andy Devine), himself out of work. When Danny and Esther go to a concert to take their minds off their troubles, Esther has her first encounter with Norman Maine (Fredric March), an actor she admires greatly. Norman has been a major star for years, but his alcoholism has sent his career into a downward spiral.Danny gets Esther a one-time waitressing job at a fancy Hollywood party. While serving hors d’œuvre, she catches Norman's eye. He gets his longtime producer and good friend, Oliver Niles (Adolphe Menjou), to give her a screen test. Impressed, Oliver gives her a new name (\"Vicki Lester\") and a contract. She practices her few lines for her first tiny role.When the studio has trouble finding a female lead for Norman's current film, entitled The Enchanted Hour, Norman persuades Oliver to cast Esther. The film makes her an overnight success, even as viewers continue to lose interest in Norman.Norman proposes to Vicki; she accepts when he promises to give up drinking. They elope without publicity, much to press agent Matt Libby's (Lionel Stander) disgust, and enjoy a trailer-camping honeymoon in the mountains. When they return, Vicki's popularity continues to skyrocket, while Norman realizes his own career is over, despite Oliver's attempts to help him. Norman stays sober for a while, but his frustration over his situation finally pushes him over the edge. He starts drinking again. When Vicki wins the industry's top award, he interrupts her acceptance speech by drunkenly demanding three awards for the worst acting of the year.A stay at a sanatorium seems to cure Norman's increasingly disruptive alcoholism, but a chance encounter with Libby gives the press agent an opportunity to vent his long-concealed contempt and dislike for Norman. Norman goes on a four-day drinking binge and winds up arrested for drunk driving. In court, the judge sentences him to 90 days of incarceration, but Esther pleads with the judge to put Norman under her care. The judge, who is impressed with Vicki's acting success, suspends Norman's sentence and puts Norman's custody into Vicki's hands. Vicki decides to give up her career in order to devote herself to his rehabilitation. After Norman overhears her discussing her plan with Oliver, he drowns himself in the Pacific Ocean.Shattered, Vicki decides to quit and go home. Soon afterward, her grandmother shows up once she hears Vicki is quitting. Her grandmother tells her of a letter Norman sent her when they got married. The letter stated how proud he was of Vicki, and how much he loved her. Because of her grandmother's words, and the reminder of Norman's deep love, Vicki is convinced to stay in show business. At the premiere of her next film at Grauman's Chinese Theatre, when Vicki is asked to say a few words into the microphone to her many fans listening across the world, she announces, \"Hello everybody. This is Mrs. Norman Maine.\"","Reception":"Contemporary reviews were very positive. Frank S. Nugent of The New York Times called the film \"one of the year's best shows\" as well as \"good entertainment by any standards, including the artistic, and convincing proof that Hollywood need not travel to Ruritania for its plots; there is drama aplenty in its own backyard.\"[12] Variety raved: \"A smash which unquestionably will rate among the half dozen best of the season ... While the story is somewhat reminiscent of other behind-the-scene yarns, the manner of its telling makes it convincing and distinguished.\"[13] Harrison's Reports called it \"a powerful human interest drama\" and \"great entertainment.\"[14] Film Daily said it was \"superbly done in all departments,\"[15] and John Mosher of The New Yorker called it \"a pleasant movie\" with \"many nice touches.\"[16]By the end of 1939 the film had earned a profit of $181,000.[2]","Ownership and copyright status":"Selznick International Pictures sold the film's copyright including film, story, screenplay, and score to Warner Brothers in 1954. Warner that year issued the first movie remake.[23] In 1965, the film entered the public domain (in the USA) due to Warner's failure to renew its copyright registration in the 28th year after publication.[24][25] The original 35mm master elements remain with Warner Bros.","Soundtrack":"\"A Star is Born\", sung by Buddy Clark with the orchestra of Eddy Duchin. The lyrics were written by Dorothy Dick to the music of Max Steiner.","Academy Awards":"At the 10th Academy Awards, A Star is Born was nominated in seven categories, winning in one.[17] Wellman won the award for original story, the only Oscar he was to win during his career.[18] W. Howard Greene received an honorary Academy Award for the film's color photography; this award was recommended by a committee of leading cinematographers after viewing all the color pictures made during the year.[19]","produced_by":"David O. Selznick","starring":"Janet Gaynor|Fredric March|","music_by":"Max Steiner","External links":"","edited_by":"James E. Newcom|Anson Stevenson|","written_by":"William A. Wellman|Robert Carson|Dorothy Parker|Alan Campbell|"}