{"based_on":"Beavis and Butt-Head  by Mike Judge","country":"United States","distributed_by":"Paramount Pictures","Plot":"After a surreal dream of the two of them menacing a city as giants, Beavis and Butt-Head wake up to realize that someone has stolen their television. The pair then embark on a quest to find it. After several mishaps they visit a low-quality motel that advertises \"TVs in every room\". There, they encounter Muddy Grimes, who is waiting for two hired hitmen (later revealed to be the same people who stole Beavis and Butt-head's television) to murder his wife, Dallas. Muddy (who is drunk), thinking that Beavis and Butt-head are the killers he has contacted, says that they must \"do\" (murder) his wife. Thinking that by \"do\" Muddy means \"score with\", Butt-head convinces Beavis that both of them can \"score\" as well as get paid enough to buy a new television. Muddy hands them a photograph of Dallas with instructions on where to find her. He then drives them to the airport to catch a plane to Las Vegas.After arriving in their Vegas casino where they are staying, the boys get arrested by security after being mistaken for trespassers and then they are taken to their rooms. Their room was purchased by Muddy to be adjacent to the room of the hunted woman, Dallas Grimes, and they accidentally burst in. Dallas soon realizes they have no idea what they have been hired for. While Beavis and Butt-Head begin fighting over who will \"do\" Dallas first, the police arrive to arrest her. Thinking quickly, she plants a stolen biological weapon known as the \"X-5 Unit\" in Beavis' pants in order to get rid of it. She then gets them tickets on a bus to Washington, D.C. instructing them that she will be waiting for them in the United States Capitol and will let them \"do her\" there.The stolen biological weapon attracts the attention of the ATF, headed by Agent Flemming who orders a body cavity search on everyone he encounters and in spite of his tough talk, relies on fellow Agent Bork's assistance virtually all the time. Flemming becomes convinced that the duo are criminal masterminds after they accidentally release the water behind the Hoover Dam, cutting the power to Las Vegas. On the tour bus, they visit landmarks including the Grand Canyon and Yellowstone National Park. After becoming stranded in a gift shop at Petrified Forest National Park, they are told Washington is \"about 2,000 miles that way\" and begin to wander through the desert. Then a security guard admits that he let them go because he was afraid of them, and Agent Hurley then gives him a cavity search. Flemming then sends out roadblocks for over 200 miles over every road in the desert. They soon meet two former Mötley Crüe roadies, who are heavily implied to be their fathers, but part ways before they can make the kinship connection. During the trek across the desert, they soon begin to die of dehydration. Delirious from the heat, Beavis unwittingly consumes a peyote cactus, and has a vivid psychedelic experience overnight.The next day, Beavis and Butt-Head are found by Muddy, who plans to kill them after realizing they were not the hit men he hired. However, after hearing that Dallas is going to meet up with the duo in D.C., Muddy decides to take them the rest of the way in his trunk to hunt down Dallas. In the middle of I-81 in Virginia, Butt-Head opens the trunk with a car jack, and they escape by jumping onto the road, causing an 18-wheeler to swerve off the road, resulting in a huge, 400-car pileup. Beavis and Butt-Head casually walk past the scene and get back on the tour bus, stopping at the United States Capitol Building before finally reaching the White House. Before Dallas can meet with Beavis and Butt-Head to recover the weapon, she is confronted in the parking garage by Muddy. Muddy and Dallas then briefly reconcile before they are arrested by the ATF while having sex in Muddy's car. Faced with the possibility of a 60-year jail sentence, Dallas betrays Muddy by saying that he hid the weapon \"in some kid's pants\" but she still gets the sentence.The ATF is dispatched to the White House due to Beavis and Butt-Head being there on the same day as the \"Give Peace a Chance\" conference. Beavis consumes caffeine pills (following a speech about scoring and never getting to score, which ended with a fight with the bus driver), sugar and coffee while on the White House tour, then transforms into Cornholio. He wanders around the White House and picks up the red phone in the Oval Office, causing the military to go to DEFCON 4. Meanwhile, Butt-head wanders around the White House where he runs into Chelsea Clinton; his attempts at hitting on her lead to him being pushed out of a window where he is detained and cavity searched by ATF officers. Beavis leaves the White House and goes inside Mr. Anderson's trailer. Moments later, Anderson catches Beavis \"whacking off\" and angrily throws him out of the trailer. The ATF spots Beavis walking around the camper pants-less and confront him, thinking he has the weapon on him. They are just about to open fire when Anderson opens his camper door, telling Beavis to take his pants with him, which causes the ATF to go after the pants. The pants are ripped open, with the weapon flying out of them. The weapon, landing safely in Butt-Head's hand, is recovered; Butt-head simply hands it to Flemming. Blame for the incident is ultimately pinned on Anderson, who's arrested along with Dallas and Muddy. Agent Flemming informs Beavis and Butt-Head that their adventure will remain top secret. Beavis and Butt-head are shown seeing President Bill Clinton, who then makes Beavis and Butt-head honorary ATF agents. The boys are ecstatic by the news thinking that they're now in the \"Bureau of beer and cigarettes and FIRE!! And maybe some chicks too!!\"Beavis and Butt-Head return to Highland and find their TV in front of the motel. The film ends with them carrying their TV into the sunset while insulting each other, then Beavis suggests going to Anderson's tool shed to masturbate.","language":"English","box_office":"$63.1 million (US)[3]","cinematography":"David J. Miller","directed_by":"Mike Judge","Soundtrack":"Noticeably missing are \"Mucha Muchacha\", the version of \"Lesbian Seagull\" with Mr. Van Driessen singing, and the score tracks, which were released on a separate album.\"Two Cool Guys\", written and performed by soul/funk musician Isaac Hayes, is a semi-parody of Hayes' Academy Award-winning \"Theme from Shaft\". It incorporates the theme from the Beavis and Butt-head television series as a rhythm guitar line, and series creator Mike Judge, who wrote the theme, is given a co-writing credit with Hayes in the soundtrack liner notes. The opening credit sequence which the song features in is a take-off on popular 1970s cop movies and TV shows with Beavis and Butt-Head as hip ace sleuth Lothario detectives.The version of Ozzy Osbourne's \"Walk on Water\" is not the same version included in the film. The film used an earlier demo version, while the soundtrack itself contains a later, revised version. The original demo, which appears in the film, can be found on Osbourne's Prince of Darkness box set. Ozzy and co-writer Jim Vallance both prefer the demo version heard in the film.[13] \"Walk on Water\" was released as a single and peaked at number 28 on Billboard's Mainstream Rock Tracks chart.[14]","production_companies":"Geffen Pictures MTV Productions Uncredited: Judgemental Films Rough Draft Studios Viacom International","beavis_and_butt-head_do_america":"Theatrical release poster","release_dates":"December 20, 1996 (1996-12-20)|||||","Production":"Development for the film began in 1993 as part of a production deal with MTV, David Geffen, and Warner Bros. Geffen believed in the potential of the Beavis and Butt-head TV series that he suggested creating a movie and record album based on the program. After MTV's parent company Viacom purchased Paramount in 1994, the studio became a partner in the film, replacing Warners' interest in the project.[5] Mike Judge has stated production of the film was very ad hoc and had some difficulties with progressing due to most of the staff's television background. Beavis' hallucination sequence's design and animation was based on the works of Rob Zombie. The sequence's director was Chris Prynoski.When the film premiered on MTV on August 7, 1999, an additional deleted scene followed the airing: while visiting the National Archives, Beavis attempts to use the restroom, but cannot because of the lack of toilet paper in the stall. Coincidentally, Butt-head is angry because the urinals lack the automatic flushing mechanisms that had amazed him at Yellowstone National Park. After the rest of their tour group finishes looking at the encased Declaration of Independence, Beavis sneaks out, breaks the glass with the U.S. flag pole, and steals it to use as \"T.P. for his bunghole.\" While Archive guards rush to see what happened, Beavis cleans up, and exits the stall with a piece of the Declaration, containing John Hancock's signature, stuck to his shoe. The scene does not appear on the DVD, although it is mentioned on the disc's commentary track. In the track, Judge noted that the scene did not test well.[citation needed]Another alternate scene was done for when Butt-Head meets Chelsea Clinton in her bedroom, which showed her packing up to leave the White House. This alternate scene was created in the event Bill Clinton lost his 1996 re-election bid to Bob Dole. However, by the spring of 1996, Judge ultimately decided to keep the original scene because he felt that it was looking as if Clinton was going to win his bid for re-election.","produced_by":"Michael Blakey|Mike Judge|Abby Terkuhle|","starring":"Mike Judge|Demi Moore|Bruce Willis|Robert Stack|Cloris Leachman|","running_time":"81 minutes[1]","music_by":"John Frizzell","External links":"","edited_by":"Gunter Glinka|Terry Kelley|Neil Lawrence|","Release":"Beavis and Butt-Head Do America opened in North America on December 20, 1996, and earned $63,118,386 at the domestic box office after opening at #1 with $20,114,233,[6] a strong return for a film that had a $12 million production budget.[2]Beavis and Butt-Head Do America was well-received by critics. As of September 2015, the film held a 72% \"Fresh\" rating on Rotten Tomatoes based on 54 reviews, with the consensus \"Beavis and Butt-Head Do America is unabashedly offensive, unapologetically stupid, and unexpectedly funny.\"[7] On Metacritic, the film has a 64 out of 100 rating based on 16 critics, indicating \"generally favorable reviews\".[8]Roger Ebert of Chicago Sun-Times praised the film as a \"vulgar\" satire on American youth, and compared it favorably to Wayne's World.[9] On the movie review show Siskel and Ebert, Ebert's reviewing partner Gene Siskel described the film as \"brilliant\". The two ultimately awarded it a \"two thumbs up\" rating.[10]The film was released on VHS on June 10, 1997 and on DVD on November 23, 1999, by Paramount Home Entertainment. The bonus features on the disc were a widescreen presentation, and two theatrical trailers. The film was re-released on a Special Edition DVD in 2006 as \"The Edition That Doesn't Suck\". It contained more in the way of bonus features such as audio commentaries, Spanish language tracks, more trailers, \"Making of\" documentaries, and more. It lacks the deleted National Archives scene. In 2013, \"The Edition That Doesn't Suck\" was re-released on DVD exclusively by Warner Home Video, under a deal with Paramount. Oddly enough, Warner Bros. was Geffen's distributor until The Geffen Company went bankrupt. Now, Warner Bros. holds home video distribution rights to all of Geffen Pictures' library.","written_by":"Mike Judge|Joe Stillman|","budget":"$12 million[2]"}