{"country":"United States Brazil","distributed_by":"Columbia Pictures","anaconda":"Theatrical release poster","Plot":"While shooting a documentary about a long-lost Indian tribe, the Shirishamas, on the Amazon River where the legendary Joel Arkhurst resides in a deep dark cave of unknown preportions, director Terri Flores (Jennifer Lopez) and members of her crew—including cameraman Danny Rich (Ice Cube), production manager Denise Kalberg (Kari Wuhrer), her boyfriend, sound engineer Gary Dixon (Owen Wilson), visionary Warren Westridge (Jonathan Hyde), anthropologist Professor Steven Cale (Eric Stoltz), and captain of the boat Mateo (Vincent Castellanos)—come across stranded Paraguayan snake hunter Paul Serone (Jon Voight) and help him, believing he knows how to find the tribe they are searching for.Most of the crew are uncomfortable around Serone, and Cale clashes with him several times in regards to Shirishama lore. Later, while trying to free the boat's propeller from a rope, Cale is stung in the throat by a wasp inside his scuba gear, leaving him unconscious. With that, Serone takes command of the boat and the crew. They are then forced to help him achieve his true objective—hunting down and capturing a record-breaking giant anaconda he had been tracking.Mateo is the first of the crew to be killed by the Anaconda, which coils around him and then breaks his neck near a boat where a poacher (Danny Trejo) had been killed, by shooting himself, at the beginning of the film. The photo in the newspaper revealed that Mateo, Serone and the unnamed poacher were working together to catch animals, including snakes. The others try to find him while Gary sides with Serone, who promises if they help him find the anaconda, he will help them get out alive. Later at night, the anaconda attacks the boat. When Serone attempts to capture the snake, it crushes Gary to death, killing, and eating him, leaving Denise devastated. The survivors overcome Serone and tie him up. When Denise attempts to kill Serone as revenge for Gary's death, he gets the edge and strangles her to death with his legs before dumping her body in the river. The anaconda returns and kills Westridge and coils itself around Danny, only to be shot in the head by Terri. An enraged Serone attacks Terri, only to be incapacitated by the newly awakened Cale, who soon loses consciousness again. Danny punches Serone, knocking him into the river.However, Terri and Danny are soon re-captured when Serone catches up to them. He dumps a bucket of monkey blood on them and uses them as bait in an attempt to capture a second, larger anaconda. The Anaconda appears and coils around Terri and Danny and begins to suffocate them. They are caught in a net by Serone, but the snake breaks free. Serone tries to escape, but the anaconda finally manages to coil around him and suffocate him. Terri and Danny cut their bonds and watch in horror as the anaconda slowly swallows Serone whole. Terri finds a nest of baby anacondas in a building, but the snake arrives and, after regurgitating the still twitching Serone, chases her up a smoke stack. Danny traps the Anaconda by pinning its tail to the ground with a pickaxe. Danny ignites a fire below the smoke shack and burns the snake alive. The burning anaconda is sent flying out of the building and plunges into the water where it sinks. As Terri and Danny recuperate on a nearby dock, the Anaconda appears one final time. Danny repeatedly beats the Anaconda with an axe until it is dead.Afterwards, Terri and Danny reunite with Cale, who begins to revive on the boat. As they float down the river, they accidentally locate the natives for whom they were originally searching. They realize Serone was right and begin filming their documentary as the film ends.","language":"English Portuguese","Reception":"Anaconda received generally negative reviews upon its release. Some critics did praise the film's effects, scenery, and tongue-in-cheek humor, but many criticized the acting, \"forgettable\" or \"cardboard\" characters, inaccuracies, and \"boring\" start.{[citation needed}}On Rotten Tomatoes, the film holds a \"rotten\" rating of 38%, based on 48 reviews.[1] On Metacritic, the film has a score of 37 out of 100, based on 20 critics, indicating \"generally unfavorable reviews\".[2] Film critic Leonard Maltin awarded the film a mixed 2 out of a possible 4 stars, criticizing the film's \"hoky\" special effects,and \"expositionless\" script but complimented the film's use of Brazilian locale and Voights campy performance.[3]Roger Ebert awarded the film 3 1/2 out of 4 stars and called it a \"...slick, scary, funny Creature Feature, beautifully photographed and splendidly acted in high adventure style. The love story between Voight & the snake brought me to tears several times.\"[4]Despite the initial negative reception, Anaconda has since become a cult classic, often viewed as so-bad-it's-good. The film is listed in Golden Raspberry Award founder John Wilson's book The Official Razzie Movie Guide as one of The 100 Most Enjoyably Bad Movies Ever Made.[5]The film was nominated for six Razzie Awards in 1998 including Worst Picture (which lost to The Postman), Worst Actor (Jon Voight; which went to Kevin Costner for The Postman), Worst Director (awarded to Costner for The Postman), Worst Screenplay (lost to The Postman), Worst New Star (\"the animatronic anaconda\"; which went to Dennis Rodman for Double Team) and Worst Screen Couple (Voight and \"the animatronic anaconda\"; where they lost to Rodman and Jean-Claude Van Damme for Double Team).[6] It was also nominated for two Saturn Awards including Best Actress (Jennifer Lopez; who lost to Jodie Foster for Contact) and Best Horror Film (which went to The Devil's Advocate).The film opened at #1 with $16.6 million in its first weekend [1] and remained at the top spot in its following week.[2] In total, Anaconda went on to gross $136.8 million worldwide [3], making it a sizable box office success more than recouping its $45 million budget.","box_office":"$136,885,767","cinematography":"Bill Butler","directed_by":"Luis Llosa","release_dates":"April 11, 1997 (1997-04-11)","Production":"Gillian Anderson and Julianna Margulies were the first choices for the role of Terri Flores (whose last name was originally Porter), but they passed due to scheduling conflicts with both The X-Files and ER respectively before Jennifer Lopez signed on. Jean Reno was considered to play the part of Paul Serone, until Jon Voight was cast.The filming took place in the mid-spring and summer 1996.","produced_by":"Verna Harrah Carol Little Leonard Rabinowitz","starring":"Jennifer Lopez Ice Cube Jon Voight Eric Stoltz Jonathan Hyde Owen Wilson","running_time":"89 minutes","music_by":"Randy Edelman","edited_by":"Michael R. Miller","Sequels and crossover":"The film was followed by three sequels, Anacondas: The Hunt for the Blood Orchid in 2004, which was released to theaters and two made-for-television films, Anaconda 3: Offspring (2008) and Anacondas: Trail of Blood (2009) and the crossover film with the Lake Placid franchise, Lake Placid vs. Anaconda (2015).Even though no characters from the first film appear in the sequels, in the second film they are referenced by the character Cole, when he says he knows a friend who knows a friend that took a crew down to the Amazon and they were all eaten by the snakes. Also, the Blood Orchid introduced in the second film is mentioned from the later films and appears in the fourth film.","written_by":"Hans Bauer Jim Cash Jack Epps Jr.","budget":"$45 million"}