{"country":"United States","distributed_by":"Crown International Pictures","americana":"Poster","screenplay_by":"Richard Carr","story_by":"Richard Carr","Plot":"A down on his luck, former Green Beret captain (Carradine), freshly discharged from the Vietnam War, drifts into Drury, Kansas. There he finds a derelict merry-go-round that he decides to restore. \"The symbolism of a man wanting to build something joyful after being part of the carnage and destruction of war,\" surmised film critic, Charles Champlin.[3] The people of the town have mixed reactions: some support his efforts while others hinder them. Among his supporters are two local business men: a hardware store owner, played by Barbara Hershey's father, Arnold Herzstein, and Mike, a gas station proprietor played by Michael Greene, who had guest-starred on two episodes of Carradine's television series, Kung Fu.[1] Both men supply employment to the veteran as well as parts and tools for his endeavour.Another helpful character is a young local girl, who watches the reconstruction efforts from afar, and scampers off when she is seen. The girl, played by Carradine's real life domestic partner, Barbara Hershey, provides a tool box and some food. Detractors of the veteran's efforts include a band of local teenagers, one of whom is played by John Blyth Barrymore, a personal friend of Carradine's and a frequent guest star on Kung Fu.[1] The protagonist is also harassed by the town's sheriff, played by Carradine's brother, Bruce.[4]When the town's ruffians vandalize the half-restored carousel, the captain redoubles his efforts. By this time he has found, to his displeasure, that Mike's favorite pastime is to officiate the weekly cock fights, and the two have a falling out. Mike refuses to make good on a promise of a much needed part for the carousel, unless the soldier agrees to fight a dog. The veteran reluctantly agrees to the fight during which he kills the dog. After installing the last piece that completes the carousel's restoration, he lays the dog's body inside it, starts it up and walks away, while the townspeople look on.","language":"English","Cast and crew":"In addition to those previously mentioned, the film also featured Dan Haggerty, who starred in the television series, The Life and Times of Grizzly Adams. He provided the fighting dog, played the role of the dog's trainer and worked on the set design and the actual restoration of the carousel.[5]Robert Carradine, David Carradine's younger half-brother, assisted with the camera work. Greg Walker, former Kung Fu stunt coordinator, served as stunt coordinator and played one of the town's ruffians.[1] Fran Ryan, whom Carradine met while they both worked on The Long Riders (1980), played a colonel in a scene that was shot several years after the main body of footage. Claire Townsend, a United Artists (UA) executive who had helped finance the film, played a lieutenant.[6] Rick Van Ness, who had scouted the location, had a role as a Grateful Dead fan who gives the hero a ride. He also served as production manager.[1]Calista Carradine, David's daughter, sang the theme song, \"Around\", during the opening credits. The haunting tune, which was written by David Carradine, was reprised at the end of the movie, with Carradine himself singing.[7] Several members of the Drury, Kansas community appear in the film as themselves.[4] Carradine's own dog, Buffalo, is credited in the film playing a stray dog.[4][8]","cinematography":"Robert E. Collins R. Michael Stringer","directed_by":"David Carradine","release_dates":"October 21, 1983 (1983-10-21)|||||","produced_by":"David Carradine Skip Sherwood","starring":"David Carradine Barbara Hershey Michael Greene","running_time":"91 min.","Inspiration and production":"In 1969, David Carradine and Barbara Hershey met, and began a romantic relationship, on the set of Heaven with a Gun (1969). The movie's writer, Richard Carr, had occasion to tell the couple what he referred to as a \"bedtime story\".[9] Carradine remembered it as \"the merry-go-round\" story.[10] A few years later, after Carradine had experienced financial success with Kung Fu, he decided he wanted to make the story into a movie. He contacted Carr, who secured the rights to the Henry Morton Robinson novel, and began writing the screenplay. He told Carradine that the book contained a much more complicated story than the one he had told him. Carradine responded, \"I want to make the bedtime story.\"[9]Carradine formed an acting company that he called \"'Kansas Flyer', a metaphor for a check that bounces.\"[11] He acquired a broken-down carousel in a junk yard in Los Angeles, and some broken horses in Kansas City. He and his entourage then headed for Drury, Kansas. The original working title of the film was Around. While exploring film title designs for the picture, Carradine came across a style called Americana. \"I was trying to figure out what it would look like if it said Around. Suddenly, I said to myself, 'Why am I doing this, anyway? It's right here in front of me.' I called up the title designer and told him I was changing the title to Americana.\"[12]Carradine provided most of the financing for the project, which cost under 1 million dollars.[13] He stated that the purpose of his other acting jobs was to pay for his independent projects, over which he would have artistic control.[2][14] Carradine said he even sold his Kung Fu residuals to raise money for his own projects,[15] and consequently gone into debt.[16] He also sought advice from directors he had worked with, including Martin Scorsese[5] and Ingmar Bergman.[2] \"'The wonderful thing about working with good directors,' Carradine admitted, 'is it gives me the opportunity to pick their brains for my own films.'\"[13] Using his spare time to edit the film, in 1981, Carradine finally had a finished project to take to film festivals.[14]There were setbacks with distribution, however. United Artists, which had ownership of the movie, changed hands and the new owners had no interest in the movie. Carradine bought the movie back from U.A., and set out to find a distributor.[17] The picture was picked up by Crown International, which specialized in teen exploitation films.[2] Just two weeks before the opening was scheduled, Carradine was still shooting some additional scenes.[18]Another problem arose when a representative from the Motion Picture Association of America set the pictures rating at \"R\" (restricted), explaining that the sound of the fighting dog's spine being broken was too loud. Carradine said that he would change it. A few weeks later he submitted it again and received the \"PG\" (parental guidance suggested) rating he wanted, without having changed a thing.[19]","Reception and release":"The Los Angeles Times film critic, Charles Champlin, explained that the Director's Fortnight at the Cannes Film Festival \"came into being as one of the consequences of the political turmoil that aborted the festival in 1968. It is designed to make the festival a less than totally establishment affair and it offers Third World, independent and frequently angry films on social themes.\"[3] He further explained that Carradine's Americana was \"an ideal selection for the fortnight.\"[3] In fact, the film won the People's Choice Award there in 1981.[2] Film columnist Christopher Hicks stated that Americana was also warmly received at the 1981 United States Film and Video Festival in Park City, Utah. This was the third of such events which would later become known as the Sundance Film Festival.[20] Carradine said of the audience's reaction to the film, \"Well, they laughed in all the right places, and they applauded at the end, so I guess it went alright.\"[14] He also said, \"Americana swept the festival and I came very close to making a distribution deal with Warner Brothers.\"[21] However, the Associated Press described Americana's reception in Utah as \"quiet\".[22]The moment of truth for the film came when it opened in New York City on October 21, 1983. Carradine had discussed Americana with film critic Kirk Honeycutt. Upon hearing of Carradine's death in 2009, Honeycutt recalled the discussion, remembering that he was \"most impressed.\" He explained, \"I got an assignment from The New York Times to do a profile on Carradine the filmmaker\".[2] Honeycutt's profile was planned to coincide with the film's opening at the Embassy 72d Street theater and the East Side Cinema, in New York City. Carradine commented that when he arrvied at the premiere to promote the film, he noticed that the poster and advertisement that he had made for the occasion had been replaced with \"inferior ones\".[19] He also said that the film received standing ovations at both venues.[23]However, negative reviews, like the one from New York Times film critic, Janet Maslin, killed the publication of Honeycutt's piece.[2] Maslin said of the final scene of the movie, \"Anything this moment reveals about Vietnam and about America, not to mention about dogs and merry-go-rounds, has been said better elsewhere.\"[4] Critic Richard Freeman found Barbara Hershey's character \"moronic\", and referred to the film as \"twaddle.\" Freeman said it was \"fraught with symbolism. Or maybe it is just fraught\". He further said of the film, \"Actually, it's about David Carradine, of whom the less said the better\".[7] The Kokomo Tribune called the story \"pointless\".[24] When Carradine read the reviews, he went back to the hotel bathroom and threw up.[2][23] \"'It wasn't just that the critics didn't like the picture; they were angry at me for making it,' Carradine said. 'I'll never figure that out.'\"[2]","music_by":"Craig Huntley","edited_by":"David Carradine David Kern","written_by":"Henry Morton Robinson"}