{"based_on":"Dennis the Menace  by Hank Ketcham","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Dennis Mitchell (Mason Gamble) is a five-year-old boy who lives with his parents. Henry (Robert Stanton) and Alice (Lea Thompson), and is the bane of next door neighbor, George Wilson's (Walter Matthau) existence. One morning Mr. Wilson pretends to be asleep to avoid dealing with Dennis. Dennis enters his bedroom, sees Mr. Wilson asleep surrounded by prescription medication, and assumes he's sick. To make him better, Dennis flings an aspirin into his mouth with a slingshot. This causes him to gag and spit out the aspirin, as Dennis flees home.When Dennis arrives home, his parents learn of the incident, but because they both are working, Alice has to take him to stay at Margaret Wade's house for the day. He isn't happy about this, because she is mean to him. When he arrives, he and Margaret, along with his friend Joey, venture into the woods to an abandoned tree house and intend to fix it up. Later, while getting paint from a high shelf in the garage, Dennis tries to grab his slingshot, which was taken away from him by Henry, and accidentally spills the paint on the ground. He fervently attempts to vacuum it up, but ends up spilling a glob of paint and splinters into Mr. Wilson's barbecue grill, while he's cooking chicken, and he tastes the paint as he eats it. That night, Dennis has a set of babysitters; Polly and her boyfriend, Mickey. He plays doorbell pranks on them and they retaliate by sticking a thumbtack on the doorbell and preparing water and flour to douse on the prankster. However, Mr. Wilson goes over to Dennis's house, against the wishes of his wife, Martha (Joan Plowright), to find out what Dennis knows about the paint in his chicken. But when he rings the doorbell, he pricks his thumb, and gets water and flour dumped on him, much to Martha's amusement. Meanwhile, a burglar named Switchblade Sam (Christopher Lloyd) arrives in town and begins robbing houses, as well as stealing things outdoors and striking fear into the children he meets.Henry and Alice are having increasing difficulty getting people to watch Dennis when they both work. Unfortunately for Mr. Wilson, he and Martha are charged with the task of caring for the troublesome boy, as both of his parents are called away on business trips the same weekend. Martha loves him as if he were her own grandson, as she and George are childless, and she enjoys telling Dennis a bedtime poem that her mother told her. Alternatively, George is further irritated by the boy spilling bath water on the bathroom floor, replacing George's nasal spray with mouthwash, and his mouthwash with toilet cleanser, and even letting Dennis's dog Ruff into the house.Fortunately for Mr. Wilson he has been selected to host the Summer Floraganza. He has been growing a rare night-blooming orchid for forty years especially for it. Despite the investment the flower dies shortly after blooming. Alice’s flight is delayed by a thunderstorm and Dennis remains for the night of the orchid’s blooming. Martha is understanding, but George is deeply dismayed about this. But, at her insistence, he grudgingly lets Dennis stay outside for the party with a firm warning to behave himself. However, he opens the garage door, causing it to knock over the dessert table and make a huge mess. Mr. Wilson angrily sends him inside. He hears Switchblade Sam robbing the house, goes downstairs, and finds Mr. Wilson's gold coins missing. Just as the flower is to bloom, he distracts the viewers to alert Mr. Wilson of the robbery, distracting them long enough to miss the flower's brief blooming span. Furious about his forty year investment gone to waste and everything else, Mr. Wilson severely chastises Dennis, causing him to flee on his bike. He heads into the park, where he eventually bumps into Switchblade Sam, who abducts him, intending to use him as a hostage.Henry and Alice arrive home soon after, and learn of their son's absence and contact the authorities and friends to search for him.Mr. Wilson joins them, as he now feels intense guilt about what he said, especially since he really had been robbed. Dennis unintentionally defeats Switchblade Sam by handcuffing him to a rope. He returns to Mr. Wilson's house the next morning with Switchblade Sam in his wagon, having also recovered Mr. Wilson's gold coins. Switchblade Sam is also taken into police custody by an amused sheriff who advised him to leave town earlier. Dennis and Mr. Wilson make amends, and the Mitchells and Wilsons are also on better terms. That night, Mr. Wilson explains that he's learned some things about children: \"Kids are kids, you have to play by their rules. If you can't do that, you're headed for trouble. You have to roll with the punches. You have to expect the unexpected.\"","language":"English","Reception":"The film was a success at the box office. Against a $35 million budget, it grossed $51.3 million domestically and a further $66 million overseas to a total of $117.3 million worldwide,[2][3] despite generally negative reviews from film critics.[4][5] On Rotten Tomatoes, it has a \"rotten\" rating of 23%, with the consensus saying, \"Walter Matthau does a nice job as Mr. Wilson, but Dennis the Menace follows the Home Alone formula far too closely\".Roger Ebert gave the film two-and-a-half stars out of four and wrote, \"There's a lot to like in Dennis the Menace. But Switchblade Sam prevents me from recommending it.\".[6] Mason Gamble received a Razzie Award nomination for Worst New Star but also won \"Best Youth Actor Leading Role in a Motion Picture: Comedy\" at the 15th Youth in Film Awards.","dennis_the_menace":"One-sheet poster","box_office":"$117,270,765","cinematography":"Thomas E. Ackerman","production_company":"Hughes Entertainment Hank Ketcham Enterprises Warner Bros. Family Entertainment","directed_by":"Nick Castle","Production notes":"Mason Gamble won the role of Dennis Mitchell after beating out a reported 20,000 other children who had auditioned for it.[1] The script was written to use certain references from both Back to the Future (also starring Christopher Lloyd and Lea Thompson) and Home Alone (also written and produced by John Hughes and starring Devin Ratray).The film premiered on 25 June 1993. It is known simply as Dennis in the UK to avoid confusion with an unrelated British comic strip, also called \"Dennis the Menace\", which also debuted in 1951.The film's music was composed by veteran composer Jerry Goldsmith, who was John Hughes' first and only choice to write the music score for it.Additionally, three old-time pop hits were featured in the film: \"Don't Hang Up\" by The Orlons, \"Whatcha Know Joe\" by Jo Stafford (from the 1963 album Getting Sentimental over Tommy Dorsey), and \"A String of Pearls\" by Glenn Miller.","Video game":"The film also spawned a platforming video game for the Amiga, Super NES and Game Boy platforms. The stages for it include Mr. Wilson's house, the great outdoors, and a boiler room among others.","release_dates":"June 25, 1993 (1993-06-25)|||||","produced_by":"John Hughes|Richard Vane|","starring":"Walter Matthau|Mason Gamble|Joan Plowright|Christopher Lloyd|Lea Thompson|","running_time":"95 minutes","music_by":"Jerry Goldsmith","edited_by":"Alan Heim","written_by":"John Hughes","budget":"$35 million"}