{"Cast":"Cameo appearances as themselves:","country":"United States","distributed_by":"Universal Pictures","Plot":"Coop (Trey Parker) and Remer (Matt Stone) are 23 and unemployed. They arrive uninvited at a party hosted by a former high school classmate. After finding that their classmates have matured, Coop and Remer find themselves outside drinking beer and shooting hoops. Two former classmates challenge them to a game. The two see that their opponents are very good at basketball, so they say they will only play a new game they picked up \"in the hood\".Clearly making this new game up as they go, Coop originally proposes the game Horse, but changes it to basketball with baseball rules: shots made from different locations count as singles, doubles, triples, and home runs, and missed shots count as outs. During the challenger's first shot, Coop \"psyches\" him out to make him miss; this is another rule made up on the spot. A \"psyche out\" can be anything said or done that makes the offense lose their concentration and miss their shot. Coop and Remer continue playing their new game, \"BASEketball\", and add a third member to their team, Kenny \"Squeak\" Scolari (Dian Bachar).Six months later, people come from miles around to watch them play the game against other neighborhood teams. Ted Denslow (Ernest Borgnine) shows up to propose creation of the National BASEketball League (NBL), with numerous rules in place to prevent the sport from deteriorating as other sports had done: teams cannot switch cities, players cannot be traded, and individuals cannot make money via corporate sponsorship deals.Five years after creation of the league, the NBL is in full swing with stadiums, teams, fans, and a major championship (the Denslow Cup). They even have a major network television contract (though it is never made clear which network it is) with Al Michaels and Bob Costas as the announcers. During the 1997 championship, Denslow, who is the owner of the Milwaukee Beers (in reference to real-life baseball team, Milwaukee Brewers[2]) for whom Coop and Remer both play, dies. Denslow's will grants Coop ownership of the Beers for one year; if they do not win the next Denslow Cup, ownership reverts to Denslow's widow Yvette (Jenny McCarthy). Meanwhile Coop and Remer meet (and fight over) Jenna Reed (Yasmine Bleeth), who is head of the Dream Come True Foundation.The owner of the Dallas Felons, Baxter Cain (Robert Vaughn), wants to change the rules to allow teams to move cities and players to switch teams, but could not accomplish this while Denslow was alive. Yvette would have complied had she been given ownership of the team, but Coop refuses to accept any changes. Cain and Yvette work to make sure the Beers will lose the next Denslow Cup and Yvette will win ownership of the team.Cain, realising Coop's relationship with Jenna, cuts the funds to her foundation, forcing Coop and Remer to ask Cain for help. Cain suggests creating a clothing line but Coop is entirely against it, but Remer, as part team owner, immediately agrees, and becomes so obsessed with his newfound fame that he alienates Coop. After they win the league semifinals, Cain informs Coop and Remer through photos that their clothing line has been produced through child labor in Calcutta. If the public finds out the team and Jenna's foundation will be ruined. Cain threatens to release the photos unless Coop and Remer lose or skip the Denslow Cup game. Jenna learns about the child labor scandal and breaks it off with Coop. Coop blames Remer for the mess, while Remer blames Coop for saying no to Cain's plan in the first place. They fall out, and Coop goes to Calcutta to resolve the situation.Coop replaces all the child workers in the factory with adults and makes it back just as the fifth annual Denslow Cup begins. The Beers start with an abysmal performance, failing to make one hit in six innings. At the seventh-inning stretch, the Beers are down 16-0, and Coop and Remer continue to blame each other and fight. After a moving speech from Squeak, Coop and Remer reconcile their differences and Yvette breaks off her alliance with Cain. Coop, Remer, and Squeak finally get back into the game and start scoring.In the bottom of the ninth, Remer is on second, Squeak is on third, and Coop is up when his custom-made BASEketball (La-Z-Boy) pops. Joey brings Coop a new custom-made BASEketball made from a Barcalounger. Coop misses, but successfully completes the conversion, which is considered a home run for the win and the Denslow Cup. Coop and Jenna reunite while Remer hooks up with Yvette, as the team happily carries Squeak on the Denslow Cup.After the credits have rolled, Al Michaels and Bob Costas repeat the Coop and Remer \"Dude\" argument from earlier in the film and the movie ends as they draw the curtain and are seemingly about to kiss.","language":"English","Reception":"BASEketball received a 42% approval from 50 critics on review-aggregate website Rotten Tomatoes.[3] It also garnered a score of 38 out of 100 from 18 critics on Metacritic.[4]Yasmine Bleeth and Jenny McCarthy were nominated at the 1998 Golden Raspberry Awards for Worst Actress and Worst Supporting Actress respectively for the movie. Bleeth lost to the Spice Girls for Spice World while McCarthy lost to Maria Pitillo for Godzilla.The film has since gone on to develop a cult following, mostly driven by fans of South Park, which Parker and Stone created.","box_office":"$7 million[1]","cinematography":"Steve Mason","directed_by":"David Zucker","baseketball":"Theatrical release poster","Soundtrack":"The soundtrack featured a bouncy ska cover of Norwegian band a-ha's signature single \"Take on Me\" by Reel Big Fish. The band also appears as the live entertainment at the home stadium of the Milwaukee Beers, playing \"Take on Me\" and several of their other songs.[5]","narrated_by":"Stephen McHattie","release_dates":"July 31, 1998 (1998-07-31) (North America)|||||","produced_by":"Cleve Landsberg Robert LoCash Gil Netter Jeff Wright David Zucker","starring":"Trey Parker Matt Stone Dian Bachar Yasmine Bleeth Jenny McCarthy Robert Vaughn Ernest Borgnine","running_time":"108 minutes","music_by":"Ira Newborn","edited_by":"Jeffrey Reiner","written_by":"David Zucker Robert LoCash Lewis Friedman Jeff Wright"}