{"Aftermath and influence":"The box office success of Blacula sparked a wave of other black-themed horror films.[9][18] A sequel to the film titled Scream Blacula Scream was released in 1973 by American International. The film also stars William Marshall in the title role along with actress Pam Grier.[18] American International were also planning a follow-up titled Blackenstein, but chose to focus on Scream Blacula Scream. Blackenstein was eventually produced by Exclusive International Pictures.[19]","country":"United States","distributed_by":"American International Pictures","Plot":"In 1780, Prince Mamuwalde (William Marshall), the ruler of the Abani African nation, seeks the help of Count Dracula (Charles Macaulay) in suppressing the slave trade. Dracula refuses to help, and transforms Mamuwalde into a vampire, whom he names Blacula and imprisons in a sealed coffin. Mamuwalde's wife, Luva (Vonetta McGee), is also imprisoned and dies in captivity. In 1972, the coffin has been purchased as part of an estate by two interior decorators, Bobby McCoy (Ted Harris) and Billy Schaffer (Rick Metzler) and shipped to Los Angeles. Bobby and Billy open the coffin and become Prince Mamuwalde's first victims. At the funeral home where Bobby McCoy's body is laid, Mamuwalde spies on mourning friends Tina Williams (Vonetta McGee), her sister Michelle (Denise Nicholas), and Michelle's boyfriend, Dr. Gordon Thomas (Thalmus Rasulala), a pathologist for the Los Angeles Police Department. Mamuwalde believes Tina is the reincarnation of his deceased wife, Luva. On close investigation of the corpse at the funeral home, Dr. Thomas notices oddities with Bobby McCoy's death that he later concludes to be consistent with vampire folklore.Prince Mamuwalde continues to kill and transform various people he encounters, as Tina begins to fall in love with him. Thomas, his colleague Lt. Peters (Gordon Pinsent), and Michelle follow the trail of murder victims and begin to believe a vampire is responsible. After Thomas digs up Billy's coffin, Billy's corpse rises as a vampire and attacks Thomas, who fends him off and drives a stake through his heart. After finding a photo taken of Mamuwalde and Tina in which Mamuwalde's body is not visible, Thomas and Peters track Mamuwalde to his hideout, the warehouse where Bobby McCoy and Billy Schaffer were first slain. They defeat several vampires, but Mamuwalde manages to escape. Later, Mamuwalde lures Tina to his new hideout at the nearby waterworks plant, while Thomas and a group of police officers pursue him. Mamuwalde dispatches several officers, but one of them manages to shoot Tina. To save Tina from death, Mamuwalde transforms her into a vampire. After Peters manages to kill the vampire Tina, Mamuwalde believes he cannot live any longer after losing her twice. Mamuwalde leaves for the surface where the morning sunlight rots his flesh quickly and kills him.","language":"English","Reception":"Blacula received mixed reviews on its initial release.[9] Variety gave the film a positive review praising the screenplay, music and acting by William Marshall.[8] The Chicago Reader praised the film, writing that it would leave its audience more satisfied than many other \"post-Lugosi efforts\".[9] A review in the New York Times was negative, stating that anyone who \"goes to a vampire movie expecting sense is in serious trouble, and \"Blacula\" offers less sense than most.\"[11] In Films & Filming, a reviewer referred to the film as \"totally unconvincing on every level\".[9] The Monthly Film Bulletin described the film as \"a disappointing model for what promised to be an exciting new genre, the black horror film.\" and that apart from the introductory scene, \"the film conspicuously fails to pick up on any of its theme's more interesting possibilities–cinematic or philosophical.\"[12] The film was awarded the Best Horror Film title at the first Saturn Awards.[13]Among more recent reviews, Kim Newman of Empire gave the film two stars out of five, finding the film to be \"formulaic and full of holes\".[14] Time Out gave the film a negative review, stating that it \"remains a lifeless reworking of heroes versus vampires with soul music and a couple of good gags.\"[15] Film4 awarded the film three and a half stars out of five, calling it \"essential blaxploitation viewing.\"[16] Allmovie gave the film two and a half stars out of five, noting that Blacula is \"better than its campy title might lead one to believe...the film suffers from the occasional bit of awkward humor (the bits with the two homosexual interior decorators are the most squirm-inducing), but Joan Torres and Raymond Koenig's script keeps things moving at a fast clip and generates some genuine chills.\"[17] The Dissolve gave the film two and a half stars, stating that \"The placement of an old-fashioned, Bela Lugosi-type Dracula—albeit much, much sweatier—in a modern black neighborhood is a great idea, but the amateurish production leaves Marshall as stranded in the film as his Mamuwalde is stranded in the times.\"[10]","blacula":"Original 1972 theatrical poster","cinematography":"John M. Stephens","directed_by":"William Crain","release_dates":"August 25, 1972 (1972-08-25) (United States)|||||","Production":"Many members of the cast and crew of Blacula had worked in television. Director William Crain had directed episodes of The Mod Squad.[2] William H. Marshall's Mamuwalde was the first black vampire to appear in film.[2] Marshall had previously worked in stage productions and in episodes of The Man from U.N.C.L.E., The Nurses, Star Trek and Mannix.[2] Thalmus Rasulala who plays Dr. Gordon Thomas had previously been in episodes of The Twilight Zone, Perry Mason, and Rawhide.[2]Blacula was in production between late January and late March 1972.[3] While Blacula was in its production stages, William Marshall worked with the film producers to make sure his character had some dignity. His character name was changed from Andrew Brown to Mamuwalde and his character received a background story about being an African prince who had succumbed to vampirism.[4]The music for Blacula is unlike that of most horror films as it uses rhythm and blues as opposed to haunting classical music.[5] The film's soundtrack features a score by Gene Page and contributions by the Hues Corporation and 21st Century Ltd.[6]","produced_by":"Samuel Z. Arkoff Joseph T. Naar","starring":"William Marshall Vonetta McGee Denise Nicholas Gordon Pinsent Charles Macaulay Thalmus Rasulala","running_time":"92 minutes","music_by":"Gene Page","edited_by":"Allan Jacobs","Release":"Blacula was released on August 25, 1972.[7] Prior to its release, American International Pictures' marketing department wanted to ensure that black audiences would be interested in Blacula; some posters for the film included references to slavery.[8] American International Pictures also held special promotional showings at two New York theaters; anyone wearing a flowing cape would receive free admission.[8] Blacula was popular in America, debuting at #24 on Variety's list of top films. It eventually grossed over a million dollars, making it one of the highest-grossing films of 1972.[9]Scream Factory released the film on Blu-ray as a double feature with Scream Blacula Scream on March 2, 2015.[10]","written_by":"Raymond Koenig Joan Torres"}