{"directed_by":"Stanislav Govorukhin","country":"Soviet Union","release_dates":"1987 (1987)|||||","Plot":"PART 1Eight complete strangers are brought by boat to spend the weekend in a lonely mansion on an island off the English coast, attended to by a married domestic couple, Mr. and Mrs. Rogers. Once there, they realize that none of them know their unseen host, who has identified himself only as \"A. N. Owen.\" In everyone's room is a copy of the poem, \"Ten Little Nigger Boys.\" hung and framed, and it is shown that one guest, Philip Lombard, had brought a pistol to the island. During dinner, after marvelling at a centerpiece with ten African native figurines, a prerecorded gramophone voiced by Mr. Owen accuses them each of past murders that the law was unable to punish, and promises swift retribution. After the record, Mrs. Rogers faints and is taken to her room, while the guests attempt to decipher the letters that invited them and to deflect the accusations against them. One guest is proven to be a decoy - Mr. Davis - is in fact a private investigator, Mr. Blore. Another two guests admit their guilt, Philip Lombard, and Anthony Marston who admits to have killed two kids when driving. He then chokes on his drink and smashes through glassware, killing him - a victim of poisoning. During the night, a figurine is removed from the centerpiece, and Vera reflects on her former lover, Hugo, who stood to lose his inheritance to Cyril, the boy who would later drown in Vera's care and stood in the way of Hugo and Vera being married. In the morning, Rogers comes to Dr. Armstrong to confirm that Mrs. Rogers died in her sleep, of an apparent overdose. The remaining eight guests split off - Lombard, Blore and Dr. Armstrong search the island for the killer. Emily Brent admits to the story of firing her servant, Beatrice, to Vera. General MacArthur also admits to sending his wife's lover, Arthur Richmond to his death, to Vera. He confides to her that no one is coming for them, and that this is the end. Vera later discovers MacArthur murdered from a blow to the head. Only seven figurines remain in the dining room.PART 2Judge Wargrave leads an inquiry with the other six suspects with the realization that the killer is murdering them according to the old Ten Little Niggers nursery rhyme. When their attempt to locate Mr. Owen by searching the island proved fruitless, they realize that the unknown assailant is in fact one of them, and that all of them had equal opportunity to have killed Marston, Mrs. Rogers and the General. After dinner, Rogers locks the remaining figurines in a cupboard so that no more would go missing. Both Lombard and Emily suffer nightmares of their past victims during the night, Emily seeing a ghost of Beatrice at her bedroom window. In the morning, another figurine is missing, and Rogers is found outside with his head split open from an axe, having been murdered while chopping firewood. Vera breaks down, revealing how another verse of the poem has been fulfilled. Emily and Vera prepare breakfast, while the men remove the corpses of Mr and Mrs. Rogers from the house. At breakfast, Emily faints from dizziness and naps in a chair, where the killer later returns to kill her with a syringe and to remove another figure. A planted bumblebee on her body reveals that the killer adheres to the symbols in the poem and that the mark of the syringe on her neck plants suspicion on Dr. Armstrong, who finds his syringe missing. Lombard's pistol is also missing. During dinner, Vera leaves to return to her bedroom where she is confronted by seaweed planted above her door. Her scream attract the other men - except the Judge who is found in the dining room, dressed in official court robes and wig, shot through the head. The four remaining guests return to their rooms, terrified, that Vera comes to Lombard's room where he rapes her. After this, Vera notices Lombard's gun back in his dresser. In the morning, Blore hears a cry and finds Dr. Armstrong missing. He alerts the others, and they discover that Armstrong is gone, and another figurine broken. Searching the island, and wanting to send for help to save themselves, Blore returns to the house for lunch where a booby trap is sprung above the front door, sending a marble clock with a bear ornament onto his head, crushing Blore's skull. Lombard insists on catching Armstrong, but Vera sees Armstrong's body floating in the sea. Now it only the two of them. Vera tricks Lombard into helping her move Armstrong's body past the water mark, so that she could pick his gun. She succeeds and shoots Lombard twice, killing him. Returning to the house, Vera disposes of two of the figurines and takes the last one to her bedroom where a noose and chair are waiting. Judge Wargrave is revealed to be alive and comes to Vera's room, after she breaks down in despair and hangs herself. His plan succeeded, Wargrave returns to the dining room where he reveals in an internal monologue that Dr. Armstrong helped him fake his murder, tricking Armstrong into thinking it would catch the killer. Later, he threw Armstrong off a cliff. He reveals that it was his goal to seek perfect justice and enforce the relationship between the executioner and the criminal, and how he wanted to enact this role on a grand scale as his masterpiece. He then puts the gun to his head preparing to commit the greatest execution of all - his own. He fires, and the screen cuts to black.","desyat_negrityat":"Film poster for Desyat Negrityat","starring":"Vladimir Zeldin Tatyana Drubich","running_time":"137 min","language":"Russian","music_by":"Nikolai Korndorf","edited_by":"Valentina Olejnik","written_by":"Novel: Agatha Christie Screenplay: Stanislav Govorukhin","cinematography":"Gennadi Engstrem"}