{"based_on":"All Quiet on the Western Front  by Erich Maria Remarque","country":"United States","distributed_by":"Universal Pictures","Plot":"Professor Kantorek gives an impassioned speech about the glory of serving in the Army and \"saving the Fatherland\". On the brink of becoming men, the boys in his class, led by Paul Baumer, are moved to join the army as the new 2nd Company. Their romantic delusions are quickly broken during their brief but rigorous training under the abusive Corporal Himmelstoss, who bluntly informs them, \"You're going to be soldiers—and that's all.\"The new soldiers arrive by train at the combat zone, which is mayhem, with soldiers everywhere, incoming shells, horse-drawn wagons racing about, and prolonged rain. One in the group is killed before the new recruits can reach their post, to the alarm of one of the new soldiers (Behn). The new soldiers are assigned to a unit composed of older soldiers, who are not exactly accommodating. The young soldiers find that there is no food available at the moment. They have not eaten since breakfast, but the men they have joined have not had food for two days. One of them, \"Kat\" Katczinsky, had gone to locate something to eat and he returns with a slaughtered hog he has stolen from a field kitchen. The young soldiers \"pay\" for their dinner with cigarettes.The new recruits' first trip to the trenches with the veterans, to re-string barbed wire, is a harrowing experience, especially when Behn is blinded by shrapnel and runs into machine-gun fire. After spending several days in a bunker under bombardment, they at last move into the trenches and successfully repulse an enemy attack; they then counterattack and take an enemy trench with heavy casualties, but have to abandon it. They are sent back to the field kitchens to get their rations; each man receives double helpings, simply because of the number of dead.The men start out eating greedily, but then settle into a satiated torpor. They hear that they are to return to the front the next day and begin a semi-serious discussion about the causes of the war and of wars in general. They speculate about whether geographical entities offend each other and whether these disagreements involve them. Tjaden speaks familiarly about himself and the Kaiser; Kat jokes that instead of having a war, they should have the leaders of Europe be stripped to their underwear and \"fight it out with clubs\".One day, Corporal Himmelstoss arrives to the front and is immediately spurned because of his bad reputation; he is forced to go over the top with the 2nd Company and is promptly killed. In an attack on a cemetery, Paul stabs a French soldier, but finds himself trapped in a hole with the dying man for an entire night. Throughout the night, he desperately tries to help him, bringing him water, but fails miserably to stop him from dying. He cries bitterly and begs the dead body to speak so he can be forgiven. Later, he returns to the German lines and is comforted by Kat.Going back to the front line, Paul is severely wounded and taken to a Catholic hospital, along with his good friend Albert Kropp. Kropp's leg is amputated, but he does not find out until some time afterwards. Around this time, Paul is taken to the bandaging ward, from which, according to its reputation, nobody has ever returned alive; but he later returns to the normal rooms triumphantly, only to find Kropp in depression.Paul is given a furlough and visits his family at home. He is shocked by how uninformed everyone is about the actual situation of the war; everyone is convinced that a final \"push for Paris\" is soon to occur. When Paul visits the schoolroom where he was originally recruited, he finds Professor Kantorek prattling the same patriotic fervor to a class of even younger students. Disillusioned and angry, Paul returns to the front and is happily greeted by Tjaden. He goes to find Kat, and they discuss the inability of the people to comprehend the futility of the war. Kat's shin is broken by a strafing aircraft, so Paul carries him back to a field hospital- only to find that Kat has been killed by a second strafing. Crushed by the loss of his mentor, Paul leaves.In the final scene, Paul is back on the front lines. He sees a butterfly just beyond his trench. Paul smiles and reaches out towards the butterfly, but becoming too exposed, he is shot and killed by an enemy sniper. The final shot shows the 2nd Company arriving at the front for the first time, fading out to the image of a cemetery.","language":"English","Reception":"The film received tremendous praise in the United States, but controversy would attend the film's subject matter elsewhere, including Europe. Due to its anti-war and perceived anti-German messages, Adolf Hitler and the Nazi Party banned the film from Germany in the 1930s and early 1940s. During its brief run in German cinemas in the early 1930s, Nazi troops under the command of Joseph Goebbels disrupted the viewings by setting off stink bombs, throwing sneezing powder in the air and releasing white mice in the theaters, escalating to attacking audience members perceived to be Jewish and forcing projectors to shut down.[12][13]Subsequent to these Nazi riots, according to Harvard scholar Ben Urwand in his study, The Collaboration: Hollywood's Pact With Hitler (October 2013), producer Carl Laemmle, Jr. agreed to significant cuts in the movie to make it more palatable for the large film audience in Germany.[14]Between the period of 1930 to 1941, this was one of many films to be banned in Australia by the Chief Censor Creswell O'Reilly. The film was also banned in Italy and Austria in 1931, with the prohibition officially raised only in the 1980s, and in France up to 1963.[15] The film was finally re-released in Germany on April 25, 1952, in the Capitol Theatre in West Berlin.","all_quiet_on_the_western_front":"film poster","box_office":"$1.5 million (US)[3] $3,000,000[4] (rentals)","cinematography":"Arthur Edeson","production_company":"Universal Studios","directed_by":"Lewis Milestone","Releases":"A complete cut of the film lasting 152 minutes, silent with synchronised sound,[1] was first shown in Los Angeles on April 21, 1930 and premiered in New York on April 25, 1930.[8] A sound version was released in NYC on April 29, 1930. A 147-minute version was submitted to the British censors, which was cut to 145 minutes[9] before the film premiered in London June 14, 1930.[8] The film went on general release in the US on August 24, 1930.[1] In 1939, it was re-released as a proper sound version, which was cut down to ten reels.[1]On its release, Variety wrote:The League of Nations could make no better investment than to buy up the master-print, reproduce it in every language, to be shown in all the nations until the word \"war\" is taken out of the dictionaries.Some of the credit for the film's success has been ascribed to the direction of Lewis Milestone:Without diluting or denying any... criticisms, it should be said that from World War I to Korea, Milestone could put the viewer into the middle of a battlefield, and make the hellish confusion of it seem all too real to the viewer. Steven Spielberg noted as much when he credited Milestone's work as partial inspiration for Saving Private Ryan ...Lewis Milestone made significant contributions to [the genre of] the war film.[10]Later re-releases were substantially cut and the film's ending scored with new music against the wishes of director Lewis Milestone.[11] Before he died in 1980, Milestone requested that Universal fully restore the film with the removal of the end music cue. Two decades later, Milestone's wishes were finally granted when the United States Library of Congress undertook an exhaustive restoration of the film, which is vastly superior in sound and picture quality to most other extant prints, but because all complete prints of the film were lost and no longer exist, the final \"complete\" version now available is only 133 minutes long.[9]The \"International Sound Version\", restored by the Library of Congress, premiered on Turner Classic Movies on September 28, 2011. This is an international version with intertitles and synchronized music and effects track. A new restoration of the sound version was also done in 2011. Both have now been released on Blu-ray format.","Awards and honors":"1929–30 Academy AwardsIt was the first talkie war film to win Oscars.Other wins:American Film Institute recognition","release_dates":"August 24, 1930 (1930-08-24) (US[1])|||||","Production":"In the film, Paul is shot while reaching for a butterfly. This scene is different from the book, and was inspired by an earlier scene showing a butterfly collection in Paul's home. The scene was shot during the editing phase, so the actors were no longer available and Milestone had to use his own hand as Paul's.Noted comedian Zasu Pitts was originally cast as Paul's mother and completed the film but preview audiences, used to seeing her in comic roles, laughed when she appeared onscreen so Milestone re-shot her scenes with Beryl Mercer before the film was released. The preview audience remains the only one who saw Pitts in the role, although she does appear for about 30 seconds in the film's original preview trailer.The film was shot with two cameras side by side, with one negative edited as a sound film and the other edited as an \"International Sound Version\" for distribution in non-English speaking areas.A great number of German Army veterans were living in Los Angeles at the time of filming and were recruited as bit players and technical advisers. Around 2,000 extras were utilized during production.[7] Among them was future director Fred Zinnemann, who was fired for impudence.See later re-releases information in the release section below.","produced_by":"Carl Laemmle, Jr.","starring":"Lew Ayres Louis Wolheim","running_time":"152 minutes[1] 133 minutes (restored)","music_by":"David Broekman","edited_by":"Edgar Adams","written_by":"Maxwell Anderson (adaptation & dialogue) George Abbott (screenplay) Del Andrews (adaptation) C. Gardner Sullivan (supervising story chief)","budget":"$1.2 million[2]"}