{"can-can":"theatrical release poster","based_on":"Abe Burrows (stage musical)","country":"United States","Awards and nominations":"Academy Awards, 1961:Golden Globe Awards, 1961:Grammy Awards, 1961:","distributed_by":"Twentieth Century-Fox","International controversy":"During the filming, Soviet premier Nikita Khrushchev famously visited the 20th Century Fox studios[3] and was allegedly shocked by the goings-on. He took the opportunity to make propagandistic use of his visit and described the dance, and by extension American culture, as \"depraved\" and \"pornographic.\"[4]","Plot":"In the Montmartre district of Paris, a dance known as the can-can, considered lewd, is performed nightly at the Bal du Paradis, a cabaret where Simone Pistache is both a dancer and the proprietor. On a night when her lawyer and lover, Francois Durnais, brings his good friend, Chief Magistrate Paul Barriere, to the club, a raid is staged by police and the performers, including Simone, are placed under arrest.Paul wishes the charges to be dismissed, but his younger colleague Philippe Forrestier believes the laws against public indecency should be enforced. Visiting the cabaret and pretending to be someone else, Philippe becomes better acquainted with Simone and develops a romantic interest in her, but she is warned by dancer Claudine that he is actually a judge.Despite his attraction to her, Philippe arranges for Simone to be arrested once more. Francois again defends her in court and Philippe is persuaded to drop all the charges. He then shocks Simone by proposing marriage to her. She goes to Francois, warning him that she will accept the proposal if he does not marry her himself. Paul, meanwhile, tries to talk Philippe out of it, believing such an arrangement would end his career.Simone obtains a loan from Francois to stage a ball, insisting he accept a deed to the cabaret as collateral. The police come this time and take Francois away instead of her. Simone writes a letter to Philippe, saying she cannot in good conscience become his bride. A can-can is performed to the approval of all, agreeing that it is not in any way obscene. When the police nonetheless escort Simone to a wagon used for prisoners, she is startled to find Francois inside, and even more surprised when he finally proposes.","language":"English","box_office":"$4.2 million (US/ Canada rentals) [2]","cinematography":"William H. Daniels","directed_by":"Walter Lang","Plot alterations":"The plot of the musical was also revised. In the stage version, the judge was the leading character. In the film, it is the lover (Sinatra) of the nightclub owner (Shirley MacLaine) who is the lead, and the judge (played by Louis Jourdan) forms the other half of a love triangle not found in the play. The character of Paul Barriere, a non-singing supporting part on stage, was plumped up and given two songs for Maurice Chevalier .","References":"Notes","release_dates":"March 9, 1960 (1960-03-09) (US)|||||","produced_by":"Jack Cummings Saul Chaplin","starring":"Frank Sinatra Shirley MacLaine Maurice Chevalier Louis Jourdan","running_time":"131 minutes","music_by":"Cole Porter","edited_by":"Robert L. Simpson","written_by":"Dorothy Kingsley Charles Lederer","budget":"$4,995,000[1]","Musical score":"The film contains what critics now consider some of Cole Porter's most enduring songs, including \"I Love Paris\", \"It's All Right With Me\", and \"C'est Magnifique.\" At the time of the show's premiere in 1953 however, many critics complained that Porter was now turning out material far below his usual standard. Some of the songs from the original Broadway musical were replaced by other, more famous Porter songs, including \"Let's Do It\", \"Just One of Those Things\" and \"You Do Something to Me.\" \"I Love Paris\" is sung by the chorus over the opening credits, instead of being sung in the actual story by MacLaine. A version by Sinatra and Chevalier, however, was featured on the movie soundtrack album.Sinatra and Chevalier filmed the song \"I Love Paris\" but it was cut in previews when the studio realized it slowed the film down. A photo of the sequence can be found in a New York Times Magazine article from Feb 21,1960. The song takes place shortly after Act Two opens in the scene where Chevalier visits Sinatra in a nightclub."}