{"country":"France Germany Austria","distributed_by":"Les Films du Losange (France) X-Verleih (Germany) Filmladen (Austria)","Plot":"After residents of an apartment building complain of a weird smell coming from one of the apartments, the brigade of firemen and police break down the door of the apartment in Paris to find the corpse of Anne (Emmanuelle Riva) lying on a bed, adorned with cut flowers.The film goes back to several months before the opening scene, and Anne and her husband Georges (Jean-Louis Trintignant), both retired piano teachers in their eighties, attend a performance by one of Anne's former pupils, Alexandre. They return home to find that someone has unsuccessfully tried to break in to their apartment. The next morning while they are eating breakfast, Anne silently suffers a stroke. She sits in a catatonic state, not responding to Georges. She comes around as Georges is about to get help, but doesn't remember anything that took place. Georges thinks she was playing a prank on him. Anne is unable to pour herself a drink.Anne undergoes surgery on a blocked carotid artery, but the surgery goes wrong, leaving her paralyzed on her right side and confined to a wheelchair. She makes Georges promise not to send her back to the hospital or into a nursing home. Georges becomes Anne's dutiful, though slightly irritated, caretaker. One day, Anne tells Georges that she doesn't want to go on living.Alexandre, her former pupil whose performance they attended, stops by and Anne gets dressed up and carries on a lively conversation during the visit, giving Georges hope that her condition was temporary. However, she soon suffers a second stroke that leaves her demented and incapable of coherent speech. Georges continues to look after Anne, despite the strain it puts on him.Georges begins employing a nurse three days a week. Their daughter, Eva (Isabelle Huppert), wants her mother to go into care, but Georges says he will not break the promise he made to his wife. He employs a second nurse, but fires her after he discovers she is mistreating his wife.One day, Georges sits next to Anne's bedside and tells her a story of his childhood, which calms her. As he reaches the story's conclusion, he picks up a pillow and smothers her.Georges returns home with bundles of flowers in his hands, which he proceeds to wash and cut. He picks out a dress from Anne's wardrobe and writes a long letter. He tapes the bedroom door shut and catches a pigeon which has flown in from the window. In the letter, Georges explains that he has released the pigeon. Georges imagines that Anne is washing dishes in the kitchen and, speechless, he gazes at her as she cleans up and prepares to leave the house. Anne calls for Georges to bring a coat, and he complies, following her out the door.The film concludes with a continuation of the opening scene, with Eva seated in the living room, after she has wandered around the now-empty home.","Accolades":"Both Sight & Sound film magazine and Peter Bradshaw of The Guardian named Amour the third best film of 2012.[94][95]","amour":"French release poster","language":"French","Critical reception":"Amour was met with widespread acclaim from critics. Review aggregation website Rotten Tomatoes gives the film a score of 93% based on 198 reviews, with an average rating of 8.7/10. The site's critical consensus reads: \"With towering performances and an unflinching script from Michael Haneke, Amour represents an honest, heartwrenching depiction of deep love and responsibility.\"[32] Metacritic gives the film a weighted average rating of 94 out of 100, based on reviews from 44 critics, indicating \"universal acclaim.\"[33]Writing for The Guardian after the Cannes screening, Peter Bradshaw said \"this is film-making at the highest pitch of intelligence and insight\", naming it the best film of 2012.[34] Jamie Graham of Total Film gave Amour 5 stars out of 5, stating \"far from being a cold, scientific study from a filmmaker frequently accused of placing a pane of glass between his work and his viewers, this sensitive film emerges heartfelt and humane.\"[35] Dave Calhoun of Time Out London also gave the film 5 out of 5 stars, stating \"Amour is devastatingly original and unflinching in the way it examines the effect of love on death, and vice versa\".[36] Calling Amour the best film of 2012, critic A. O. Scott of The New York Times said that \"months after its debut at Cannes this film already feels permanent.\"[37] Writing in The Times, critic Manohla Dargis hailed the film as \"a masterpiece about life, death and everything in between.\"[38] The newspaper flagged the film as a critics' pick. The Wall Street Journal's film critic Joe Morgenstern wrote of Amour: \"Mr. Haneke's film, exquisitely photographed by Darius Khondji, has won all sorts of prizes all over the world, and no wonder; the performances alone set it off as a welcoming masterpiece.\"[39]Among the few negative reviews, Calum Marsh of the Slant Magazine gave the film 2 out of 4 stars and indicated that the film \"isn't the work of a newly moral or humanistic filmmaker, but another ruse by the same unscrupulous showman whose funny games have been beguiling us for years\", adding that \"Haneke's gaze, trained from an unbridgeable remove, carries no inflection of empathy; his style is too frigid, his investment too remote, for the world of these characters to open up before us, for their pain to ever feel like something more than functional.\"[40]","box_office":"$29.9 million[3]","cinematography":"Darius Khondji","production_company":"Les Films du Losange X-Filme Creative Pool Wega Film France 3 Cinéma Canal+","directed_by":"Michael Haneke","release_dates":"20 May 2012 (2012-05-20) (Cannes)|20 September 2012 (2012-09-20) (Germany)|24 October 2012 (2012-10-24) (France)|||","Production":"The film was produced for €7,290,000 through France's Les Films du Losange, Germany's X-Filme Creative Pool and Austria's Wega Film.[4][21] It received co-production support from France 3 and €404,000 in support from the Île-de-France region.[4] Further funding was granted by the Medienboard Berlin-Brandenburg in Germany and National Center of Cinematography and the moving image in France.[22] Principal photography took place from 7 February to 1 April 2011.[22]After 14 years, Jean-Louis Trintignant came back on screen for Haneke.[23] Haneke had sent Trintignant the script, which had been written specifically for him.[24] Trintignant said that he chooses which films he works in on the basis of the director, and said of Haneke that \"he has the most complete mastery of the cinematic discipline, from technical aspects like sound and photography to the way he handles actors\".[24]The film is based on an identical situation that happened in Haneke's family.[25][26] The issue that interested him the most was: \"How to manage the suffering of someone you love?\"[26]Haneke called the collaboration with Jean-Louis Trintignant and the subject of the film itself as a motivation to make the film. The starting point for Haneke's reflections was the suicide of his 90-year-old aunt, who had raised him. According to Haneke, she was suffering under heavy rheumatism and lived the last years alone in her apartment, because she did not want to be placed in a nursing home. She had even asked the director unsuccessfully for euthanasia. According to Haneke, the main theme of his script is not old age and death, but \"the question of how to deal with the suffering of a loved one\".[27]Haneke dealt with the matter since 1992.[28] The work on the script was interrupted by a writer's block. Haneke normally wrote out the script exactly before the writing process. This time the end of the story was not clear to him. He began writing in the hope that this would occur to him at work, but this did not happen.[29] \"I have tormented myself terribly with the script and I was left with the impression that I have not succeeded in getting the hang of this topic\", he said. At the same time the director realized that the Swiss-Canadian Léa Pool with La dernière fugue (2010) had created a similar story, about an old man who is taken care of by his wife. Therefore, he let the project in favor of another. He worked only sporadically on it, until his writer's block loosened and he could finish the script quickly. Haneke wrote it specifically for Trintignant, having already written the scripts for The Piano Teacher (2001) and Caché (2005) specifically for actors (Isabelle Huppert and Daniel Auteuil). Haneke prefers this way of working, because in this way one \"writes specifically something that fits to the advantages of each actor and helps to particularly work them out\".[30]","Box office":"The film earned a total of $6,739,492 in the United States.[41] In total, it grossed $25,915,719 worldwide [42] against its $8.9 million budget.","produced_by":"Margaret Ménégoz Stefan Arndt Veit Heiduschka Michael Katz","starring":"Jean-Louis Trintignant Emmanuelle Riva Isabelle Huppert","running_time":"127 minutes[1][2]","edited_by":"Monika Willi Nadine Muse","Release":"Artificial Eye acquired the distribution rights for the United Kingdom.[31]","written_by":"Michael Haneke","budget":"$8.9 million[3]"}