{"country":"United States","distributed_by":"Universal Pictures","Plot":"Kate Holbrook (Tina Fey) is a successful single businesswoman who has always put her career before her personal life. Now in her late thirties, she finally decides to have a child of her own but her plans are dampened when she discovers she has a minuscule chance of becoming pregnant due to her uterus being T-shaped. Also denied the chance to adopt, Kate hires an immature, obnoxious South Philly woman named Angie Ostrowski (Amy Poehler) to become a surrogate mother for her.When Angie becomes pregnant, Kate begins preparing for motherhood in her own typically driven fashion—until her surrogate shows up at her door with no place to live. Their conflicting personalities put them at odds as Kate learns first-hand about balancing motherhood and career and also dates the owner of a local blended juice cafe, Rob Ackerman (Greg Kinnear).Unknown to Kate, the in-vitro fertilization procedure Angie had did not succeed and she is feigning the pregnancy. Hoping to ultimately run off with her payment, Angie begins to regret lying about her not being pregnant but continually puts off confessing. When she gets an ultrasound, she discovers she is pregnant for real. Realizing the baby is her own (with her common-law husband, Carl (Dax Shepard), from whom she is separated), Angie is forced to confess at Kate's baby shower. When Kate explains to Angie that the pregnancy test was supposed to be taken two weeks after the procedure, and that the baby could still belong to her, it drives a wedge between the two women.At a court hearing to determine the maternity of the child, the baby turns out to be Angie's and Angie makes an impassioned apology to Kate. As the two women meet face to face after the proceedings, Angie's water breaks and Kate rushes her to the hospital. During Angie's delivery, Kate passes out. As she wakes up, the doctor supervising Angie's pregnancy tells Kate that she's two months pregnant (the result of her relationship with her new boyfriend). After receiving the news, she goes to visit Angie, who is holding her new baby daughter Stef, named for Gwen Stefani. Kate forgives Angie and the two become best friends, ultimately changing each other for the better.Angie and Kate raise their children and are in a sister-like relationship one year later at Stefani's first birthday party. It is revealed that Kate and Rob are very proud parents of a baby daughter and are engaged. Although he does not get back together with Angie, Carl stays close to his daughter and begins taking parenting classes. The final scene shows Angie and Kate sitting in front of a television set with their children, watching Tom and Jerry cartoons, a reference to an earlier line in the film.","language":"English","Reception":"As of December 2015, the review aggregator Rotten Tomatoes reported that 64% of critics gave the film positive reviews based on 153 reviews, with the consensus that the film is \"a lightweight, predictable comedy that ekes by on the strength of its performers.\"[2] Metacritic reported the film had an average score of 55 out of 100, based on 34 reviews, indicating mixed or average reviews.[3] Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.[4]In a review for RESOLVE: The National Infertility Association, reproductive lawyer Melissa Brisman comments that this movie should be viewed as entertainment rather than as portraying surrogacy in a factual manner.[5]In its opening weekend, Baby Mama grossed $17,407,110 in 2,543 theaters in the United States and Canada, ranking #1 at the box office and averaging $6,845 per theater.[6]Baby Mama grossed a total of $64,163,648,[1] with a production budget of $30 million.Baby Mama was released on September 9, 2008 on both DVD and Blu-ray. Extras included commentary with writer/director Michael McCullers and cast members Tina Fey and Amy Poehler, From Conception to Delivery: The Making of Baby Mama Featurette, an alternate ending, deleted scenes, and Saturday Night Live: Legacy of Laughter.","box_office":"$64.2 million[1]","cinematography":"Daryn Okada","production_company":"Relativity Media","directed_by":"Michael McCullers","release_dates":"April 25, 2008 (2008-04-25)|||||","produced_by":"Lorne Michaels John Goldwyn","starring":"Tina Fey Amy Poehler Greg Kinnear Dax Shepard Sigourney Weaver","running_time":"99 minutes","music_by":"Jeff Richmond","baby_mama":"Theatrical release poster","edited_by":"Bruce Green","written_by":"Michael McCullers","budget":"$30 million[1]"}