{"country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Warren Beatty Jeremy Pikser","story_by":"Warren Beatty","Plot":"Democratic Senator Jay Bulworth is losing his bid for re-election to a fiery young populist. Bulworth's socialist views, formed in the 1960s and 1970s, have lost favor with voters, so he has conceded to more conservative politics and to accepting donations from big corporations. In addition, though he and his wife have been having affairs with each other's knowledge for years, they must still present a happy façade in the interest of maintaining a good public image.Tired of politics, unhappy with his life in general, and planning to commit suicide, Bulworth negotiates a $10 million life insurance policy with his daughter as the beneficiary in exchange for a favorable vote from the insurance industry. Knowing that a suicide will void his daughter's inheritance, he contracts to have himself assassinated within two days' time.Turning up in California for his campaign extremely drunk, Bulworth begins speaking his mind freely at public events and in the presence of the C-SPAN film crew following his campaign. After dancing all night in an underground club and smoking marijuana, he even starts rapping in public. His frank, potentially offensive remarks make him an instant media darling and re-energize his campaign. Along the way he becomes romantically involved with a young black activist named Nina, who tags along with him on his campaign stops. As the movie progresses, he is pursued by the paparazzi, his insurance company, his campaign managers and an increasingly adoring public, all the while fearful of his impending assassination.After a televised debate where Bulworth drinks out of a flask on air and derides insurance companies and the American healthcare system, he decides to hide at Nina's family's home, located in the ghetto of South-Central Los Angeles. While hiding at Nina's he wanders around the neighborhood, where he witnesses a group of kids selling crack, and buys the group ice cream. After saving the group from a racially motivated encounter with a police officer, he finds out they are \"soldiers\" of L.D., a local drug kingpin to whom Nina's brother owes money. Bulworth eventually makes it to a television appearance arranged earlier by his campaign manager, during which he raps and repeats truths Nina and L.D. told him about the lives of poor black people and their opinions of various American institutions, like education and employment. Eventually he offers the solution that \"everybody should fuck everybody\" until everyone is \"all the same color\" stunning the audience and his interviewer.After Bulworth's TV appearance (the end of which one mysterious assassination attempt occurs) he escapes with Nina and goes with her back to her house, where she reveals that she is the assassin he indirectly hired (ostensibly to make the money needed to pay off the debt her brother owes to L.D.) and will now not carry out the job. Relieved, Bulworth falls asleep for the first time in days in Nina's arms. Bulworth sleeps deeply for over 36 hrs (with Nina tenderly watching over him), during which time the media is abuzz about his mysterious absence on election day. During this time, various people are shown reacting to the TV coverage and the impact Bulworth's escapade is making on the political/social conversation in the country (race, poverty, inequity, greed). Bulworth wins the primary election by a landslide.The next morning the press and Bulworth's campaign managers converge on Nina's house, all eager to talk to him. L.D. also comes to Nina's house, and having had a change of heart says he will let Nina's brother work off his debt instead of hurting or killing him. Bulworth emerges from the bedroom looking rested, and as he steps outside he invites Nina to go with him, who eventually joins him after some hesitation. Bulworth and Nina embrace and begin to kiss as people cheer. As Bulworth happily accepts a new campaign for the presidency, he is suddenly shot in front of the crowd of reporters and supporters by an agent of the insurance company lobbyists, who were fearful of Bulworth's recent push for single-payer health care.Bulworth's fate is left ambiguous. The final scene shows an elderly vagrant, whom Bulworth met previously, standing alone outside a hospital. He exhorts Bulworth, who is presumably inside, to not be 'a ghost' but 'a spirit' which, as he had mentioned earlier, can only happen if you have 'a song'. In the final shot of the film, he asks the same of the audience.","language":"English","Reception":"The film generated a great deal of controversy and received a positive reception from film critics.[3][4][5][6][7] It currently holds a 75% approval rating at Rotten Tomatoes.In 2013, The New York Times reported that President Barack Obama had, in private, \"talked longingly of 'going Bulworth,' \" in reference to the film.[8]The Los Angeles Times commented that Bulworth did \"extremely well\" on a limited release.[9][10] The film grossed $29,202,884 worldwide at the box office.","bulworth":"Theatrical release poster","box_office":"$29,202,884[2]","cinematography":"Vittorio Storaro","production_company":"Mulholland Productions","directed_by":"Warren Beatty","Soundtrack":"The soundtrack was released on April 21, 1998 by Interscope Records.","release_dates":"May 15, 1998 (1998-05-15)|||||","Production":"Warren Beatty assembled a team of three writers: Aaron Sorkin, Jeremy Pikser, and James Toback. Due to family issues, Pikser contributed to the writing process remotely, communicating by phone and fax. Beatty also sought guidance from the writer Elaine May, but she was committed to working on the film Primary Colors with her former comedy partner, the director Mike Nichols.Bulworth was made in complete stealth and released by 20th Century Fox only after protracted contractual wrangling, only for a brief period of time, and practically without any publicity. As Peter Swirski reports in his study of this film, \"after 20th Century Fox backed out of producing Dick Tracy, Beatty used the leverage of a lawsuit to wangle unprecedented artistic freedom,\" disclosing only the barest outline of the story and essentially duping 20th Century Fox into bankrolling the project.[citation needed]","produced_by":"Warren Beatty Pieter Jan Brugge","starring":"Sean Astin Warren Beatty Graham Beckel Halle Berry Don Cheadle Nora Dunn Jackie Gayle Ariyan Johnson Joshua Malina Michele Morgan Oliver Platt Richard Sarafian Paul Sorvino Jack Warden Isaiah Washington Amiri Baraka Christine Baranski Laurie Metcalf Wendell Pierce","running_time":"111 minutes[1]","music_by":"Ennio Morricone","edited_by":"Robert C. Jones Billy Weber","budget":"$30 million"}