{"based_on":"Addicted  by Zane","country":"United States","distributed_by":"Lionsgate","screenplay_by":"Christina Welsh Ernie Barbarash","addicted":"Theatrical release poster","Plot":"On the outside Zoe Reynard seems to have the perfect life. She has a perfect marriage to her husband Jason and the couple share two kids. Despite this, Zoe is not happy in her marriage. After sex one night with her husband, Zoe is displeased that Jason was done so she wakes up to watch porn and plays with a dildo. She attends an art show for a possibly new client to sign on with her company and runs into the artist of the show, Quinton Canosa, and the two quickly share some flirtation. Later, Zoe goes over to his apartment for him to sign a contract but Canosa stops her and the two have sex. Despite Zoe trying to maintain her sanity, she could not resist Canosa's charms and the two have sex again when he takes her out to his special spot. The couple breaks up regularly but always inevitably end up getting back together. On one particular occasion, when Zoe goes to get back with Quinton, she finds him having sex with his next door neighbor.Zoe, throughout the story, is telling this as a flashback to her therapist, Dr. Marcella Spencer, who is treating her for sex addiction. After diagnosing her with sex addiction, Dr. Spencer assumes it might have been something from Zoe's past that keeps coming back to hurt her and pressures her to confess. However, each time she asked, Zoe avoided the question and walks out. Her addiction begins to take over her life and she soon begins to sleep with another man, Corey, whom she met at a club. When she comes home from work, she sees Corey at her home talking to her mother. Seeing the danger she had put her family into, Zoe decides that she wants to try to fix her marriage with her husband. She invites both Corey and Quinton to meet her at Quinton's apartment. Saying she does not want to say it twice, she breaks up with the two and through this they realize that she had been sleeping with both of them. Corey becomes angry and lunges at her, but Quinton blocks him. As Corey leaves, Quinton knocks him out with a vase. Zoe becomes afraid of him and tries to calm him down, but Quinton tells her that she is not going to leave him anymore. Frightened that he was walking closer, Zoe shoves a glass artwork between them, smashing it to pieces. Quinton walks straight over them, pulling bits of glass out of his feet. While hiding from Quinton who is chasing after her with a palette knife, Jason suddenly appears and smashes a heart sculpture over Quentin's head and saves Zoe before leaving. Zoe chases after Jason, apologizing profusely but he rejects her, telling her he does not want to be with a 'lying, cheating whore.' Out of desperation, Zoe walks out in front of car, injuring herself. The two splits up and Jason stays in a hotel. Zoe becomes a recluse but soon goes to a group therapy session. It is discovered that the root of Zoe's addiction was a rape committed against her will by three boys earlier in her life. At the session she speaks of her deep love for her husband and Jason walks into the session.[4]","language":"English","Reception":"Addicted received largely negative reviews from critics. On Rotten Tomatoes, the film has a rating of 8%, based on 13 reviews, with an average rating of 3.2/10.[5] On Metacritic, the film has a score of 32 out of 100, based on 9 critics, indicating \"generally unfavorable reviews\".[6]","box_office":"$17.5 million[3]","cinematography":"Joseph White","production_company":"CodeBlack Films[1]","directed_by":"Bille Woodruff","release_dates":"October 10, 2014 (2014-10-10)|||||","Production":"Principal photography began in November 2012 in Atlanta and the surrounding areas.","produced_by":"Paul Hall","starring":"Sharon Leal|Boris Kodjoe|Tyson Beckford|Kat Graham|William Levy|","running_time":"105 minutes[2]","music_by":"Anton Sanko","edited_by":"Bruce Cannon","budget":"$5 million[1]"}