{"domestic_disturbance":"Theatrical release poster","country":"United States","distributed_by":"Paramount Pictures","Plot":"Susan Morrison (Teri Polo), recently divorced from her husband Frank (John Travolta) who is a struggling ship builder, is getting married to a younger and wealthier Rick Barnes (Vince Vaughn). Danny (Matt O'Leary), Susan and Frank's twelve-year-old son, is clearly unhappy that his mother is remarrying. Susan asks Frank to allow Rick to go sailing with him and Danny, to help Danny bond with and accept Rick as a stepfather.After the wedding and a brief improvement in Danny's and Rick's relationship, Danny dislikes Rick once again. During a game of catch between the two, Rick clearly becomes agitated with Danny's ambivalent playing style and starts criticizing him harshly. The revelation that Susan and Rick are having a baby worsens the situation. After finding out about the baby, Danny stows away in Rick's Chevy Suburban, planning to drop off it en route and visit his father. But while Danny is inside, he sees Rick murdering mysterious stranger Ray Coleman (Steve Buscemi), who earlier attended the wedding unannounced, claiming to be an ex-business associate of Rick.Danny reports the murder to his father and to the local police. Rick, however, has managed to dispose of most of the evidence, and is widely considered a pillar of the local community as he invested his money in the area, whereas Danny has a history of lying and misdemeanors. Frank believes his son though, stemming from Rick's notable unease around Coleman at the ceremony and the fact that Danny never lies to him.Frank does some investigating of his own and unearths Rick's criminal past, which now stands to put his son and ex-wife in risk. Frank learns that Rick's real name is Jack Parnell and that he is a criminal who was acquitted while his partners, which included Coleman, were convicted. Jack tries to kill Frank by setting his boathouse on fire, but Frank manages to escape.Susan realizes the truth when she sees a large burn on Jack's arm, having heard about the fire at the boathouse hours earlier. She tries to escape with Danny but Jack knocks her out and takes Danny as a hostage. Frank arrives to confront Jack, as he tries to flee. In the ensuing fight, Jack is killed when a tied-up Danny pushes him to a fuse box, electrocuting him. Susan has no serious physical injury from the conflict, although we learn that she miscarries her child.","language":"English","box_office":"$54,249,294[1]","cinematography":"Michael Seresin","directed_by":"Harold Becker","release_dates":"November 2, 2001 (2001-11-02)|||||","Production":"In April 2001, while shooting the film in Wilmington, North Carolina, actor Steve Buscemi was slashed and badly scarred on his face while intervening in a bar fight between his friend Vince Vaughn, screenwriter Scott Rosenberg and a local man, Timothy Fogerty, who allegedly instigated the brawl.[2][3]","produced_by":"Harold Becker Donald De Line Jonathan D. Krane","starring":"John Travolta Vince Vaughn Teri Polo Matt O'Leary Steve Buscemi","running_time":"89 minutes","music_by":"Mark Mancina","edited_by":"Peter Honess","Release":"Paramount Pictures held the world premiere of Domestic Disturbance at the studio on October 30, 2001. The film's stars were in attendance as well as many other guest celebrities.[4] The film was then officially released on November 2, 2001 in 2,910 theaters throughout the United States. It did not prove to be a financial success, grossing only $45,246,095 domestically. By the end of its run, the film was only able to gross $54 million worldwide from its $75 million budget.[1]The film was received poorly by critics, and gains a 24% rating on Rotten Tomatoes based on 100 reviews, with an average rating of 4/10. The consensus reads: \"Well-made but extremely predictable, Domestic Disturbance is an average thriller that may work better on TV.\"[5] On Metacritic, it holds a score of 29 out of 100, based on reviews from 27 critics, indicating \"generally unfavorable reviews\".[6]Roger Ebert awarded it a meager one-and-a-half stars (out of a possible four),[7] reciting an anecdote about how the Chicago film critics had been shown the wrong last reel. He saw the correct one the following Monday, and scathingly said of it in his review: \"The earlier reel was lacking the final music. Music is the last thing wrong with that reel.\"Matt O'Leary was nominated for a Young Artist Award, for Best Performance in a Feature Film – Supporting Young Actor. However, star John Travolta was nominated for a Razzie for Worst Actor (also for Swordfish). Vaughn and Travolta have also worked in Be Cool together.","written_by":"Lewis Colick William S. Comanor Gary Drucker","budget":"$75 million[1]"}