{"Cast":"The cast features several actors from movies Allen wrote, starred in and directed, including Stone (Stardust Memories), Stallone (Bananas), Hackman (Another Woman), and Walken (Annie Hall). Aykroyd later co-starred in Allen's The Curse of the Jade Scorpion.","country":"United States","distributed_by":"DreamWorks Pictures","story_by":"Tim Johnson (concept)","Plot":"The setting for the story is an ant colony in Central Park in New York City. The protagonist is Z-4195 (Woody Allen), or \"Z\" for short, a neurotic and pessimistic worker ant living in a wholly totalitarian society who longs for the opportunity to truly express himself. His friends include fellow worker Azteca (Jennifer Lopez) and a soldier ant, Weaver (Sylvester Stallone). Z meets Princess Bala (Sharon Stone) at a bar where she goes to escape from her suffocating royal life and falls in love with her.To see Bala again, Z exchanges places with Weaver and joins the army. He marches with the ranks, befriending a staff sergeant named Barbatus (Danny Glover) in the process. He is unaware that the army's leader and Bala's fiancé General Mandible (Gene Hackman) is secretly sending all the soldiers loyal to the Queen Ant (Anne Bancroft) to die so he can begin to build a colony filled with powerful ants. At the base of a tree near nightfall, Z realizes he is actually marching into battle, and all of the soldiers except for Z are killed by acid-shooting termites. Following the battle, all Z can find of Barbatus is his head. Before he dies, Barbatus tells Z to think for himself rather than follow orders all his life, leaving Z saddened and depressed. Z returns home and is hailed as a war hero, even though he did not do anything and was traumatized by the fighting. He is also congratulated by the secretly irate General Mandible, and is brought before the Queen Ant. There he meets Bala, who eventually recognizes him as a worker. When Z finds that he has been cornered, he panics and pretends to take Bala hostage to trick the queen's guards into letting him leave rather than imprison him. They then escape from a magnifying glass and hide. Z begins searching for Insectopia, a legendary insect paradise that a drunken bar patron named Grebs (John Mahoney) told him about.Word of the incident immediately spreads through the colony and Z's act of individuality sparks a revolution in the workers and a few soldier ants as well, grinding productivity to a halt. Seeing an opportunity to gain control, General Mandible publicly portrays Z as a war criminal who only cares about himself. Mandible then promotes the glory of conformity and promises them a better life which he claims to be the reward of completing a \"Mega Tunnel\" planned by himself. However, Colonel Cutter (Christopher Walken), Mandible's second-in-command, slowly begins to have second thoughts about Mandible's plans and develops sympathy for the worker ants.After some misdirection, Z and Princess Bala stop by a picnic blanket, they then have an encounter by the wasps Chip (Dan Aykroyd) and Muffy (Jane Curtin). After a brief and tragic separation, Z and Bala are separated from the bottom of a giant Reebok shoe. Finally, Z and Bala find Insectopia which consists of a human waste-bin overfilled with decaying food. Bala begins to reciprocate Z's feelings.After interrogating Weaver, Mandible learns that Z is looking for Insectopia. Knowing of the place's existence, Mandible sends Cutter to retrieve the Princess and possibly kill Z. Later that night, Z gathers more stuff to burn at the fire as Cutter arrives in Insectopia. After asking for where Bala is from the inhabitants, Cutter forcefully flies Bala back to the colony against her will. Z finds them gone and makes his way to rescue Bala, aided by Chip, who has made himself drunk grieving over the loss of Muffy.Z arrives at the colony where he finds that Bala is being held captive in General Mandible's office. After rescuing her, he learns that General Mandible's \"Mega Tunnel\" leads straight to a body of water (the puddle next to Insectopia) which Mandible will use to drown the Queen Ant and the workers who have gathered at the opening ceremony. Bala goes to warn the workers and her mother at the ceremony, while Z goes to the tunnel exit to prevent the workers from digging any further. He fails, however, and the water leaks in. Z and Bala unify the workers into a single working unit and build a towering ladder of ants towards the surface as the water continues to rise.Meanwhile, General Mandible and his soldiers are gathered at the surface, where he explains to them his vision of a new colony with none of the \"weak elements of the colony\". He is interrupted, however, when the workers successfully claw their way to the surface and break through. Mandible angrily tries to kill Z, but is stopped by Cutter who finally rebels against Mandible and instead tries to help Z and the worker ants out of the hole \"for the good of the colony.\" The enraged Mandible charges toward Cutter, but Z pushes Cutter out of the way at the last minute and is tackled into the flooded colony with Mandible. Mandible is killed when he lands upon a root while Z falls into the water. Taking charge, Cutter orders the other soldier ants to help the workers and the Queen Ant onto the surface while he himself rescues Z from the water.Although it seems that Z is dead, Bala successfully resuscitates him. Z is lauded for his heroism and marries Bala. Together they rebuild the colony, transforming the colony from a conformist military state into a community that values each and every one of its members.","language":"English","Reception":"On review aggregate Rotten Tomatoes, the film has an approval rating of 96% based on 89 reviews and an average rating of 7.7/10. The site's critical consensus reads, \"Featuring a stellar voice cast, technically dazzling animation, and loads of good humor, Antz should delight both children and adults.\"[5] Metacritic gave the film a score of 72 out of 100 based on 26 critics, indicating \"generally favorable reviews\".[30]Roger Ebert praised the film, saying that it is \"sharp and funny\". The variety of themes, interesting visuals, and voice acting were each aspects of the film that were praised.[31] Ebert's partner, Gene Siskel, greatly enjoyed the film and preferred it over A Bug's Life.[32][33] Siskel later ranked it No. 7 on his picks of the Best Films of 1998.[34]","box_office":"$171.8 million[2]","cinematography":"Simon J. Smith","production_company":"DreamWorks Animation Pacific Data Images","directed_by":"Eric Darnell|Tim Johnson|","Soundtrack":"The original music for the film was composed by Harry Gregson-Williams and John Powell. The soundtrack was released on November 3, 1998 by Angel Records.[42][43]Initially, Jeffrey Katzenberg wanted Hans Zimmer to compose the music, but he was too busy with other projects. Instead, Zimmer suggested two composers from his studio — either Harry Gregson-Williams or John Powell — both of whom had already collaborated on the DreamWorks animated film The Prince of Egypt.[44][45]","release_dates":"September 19, 1998 (1998-09-19) (TIFF)|October 2, 1998 (1998-10-02) (United States)||||","Production":"In 1988, Disney was pitched to develop a movie called Army Ants, about a pacifist worker ant teaching lessons of independent thinking to his militaristic colony.[6] Years later, Jeffrey Katzenberg, then chairman of Disney's film division, had left the company in a feud with CEO Michael Eisner over the vacant president position after the death of Frank Wells. Jeffrey formed DreamWorks SKG with Steven Spielberg and David Geffen and planned to rival Disney with the company's new animation division.[7] Katzenberg pursued undeveloped concepts to DreamWorks he suggested or was involved with while he was at Disney, including an animated adaptation of The Ten Commandments, a collaboration with Aardman Animations, and presumably Army Ants.Production began in May 1996 after production commenced on The Prince of Egypt. DreamWorks had contracted Pacific Data Images in Palo Alto, California to begin working on computer-animated films to rival Pixar Animation Studios' features.[8] Much of Woody Allen's trademark humor is present within the film. Allen himself made some uncredited rewrites to the script, to make the dialogue better fit his style of comedic timing. An altered line from one of his early directed films, Everything You Always Wanted to Know About Sex* (*But Were Afraid to Ask) was included – \"I was going to include you in my erotic fantasies...\"After DreamWorks' acquisition of PDI, Pixar director John Lasseter, Steve Jobs, and others at Pixar were dismayed to learn from the trade papers that PDI's first project at DreamWorks would be another ant film, to be called Antz.[9] By this time, Pixar's project, then similarly called Bugs, was well-known within the animation community.[10] In general, both Antz and A Bug's Life center on a young male ant, a drone with oddball tendencies, who struggles to win a princess's hand by saving their society. Lasseter and Jobs believed that the idea was stolen by Katzenberg.[7][11] Katzenberg had stayed in touch with Lasseter after the acrimonious Disney split, often calling to check up. In October 1995, when Lasseter was overseeing postproduction work on Toy Story at the Walt Disney Studios lot, where DreamWorks was also located, Lasseter and Andrew Stanton visited Kaztenberg and they discussed their plans for Bugs in detail.[7][12] Lasseter had high hopes for Toy Story, and he was telling friends throughout the tight-knit computer-animation business to get cracking on their own films. \"If this hits, it's going to be like space movies after Star Wars\" for computer-animation companies, he told various friends.[11] \"I should have been wary,\" Lasseter later recalled. \"Jeffrey kept asking questions about when it would be released.\"[7]When the trades indicated production on Antz, Lasseter, feeling betrayed, called Katzenberg and asked him bluntly if it were true, Katzenberg confirming it.[11] Katzenberg recalled Antz came from a 1991 story pitch by Tim Johnson that was related to Katzenberg in October 1994.[11] Another source gives Nina Jacobson, one of Katzenberg's executives, as the person responsible for the Antz pitch.[10] Lasseter would not believe Katzenberg's story.[13] Lasseter recalled that Katzenberg began explaining that Disney was \"out to get him\" and that he realized that he was just cannon fodder in Katzenberg's fight with Disney.[10][11] Eisner had decided not to pay Katzenberg his contract-required bonus, convincing Disney's board not to give him anything.[10] Lasseter grimly relayed the news of Antz to Pixar employees but kept morale high. Privately, Lasseter told other executives that he and Stanton felt terribly let down.[10]At the time, the current Disney studio executives were starting a bitter competitive rivalry with Jeffrey Katzenberg and his new DreamWorks films. In 1995, Katzenberg announced The Prince of Egypt to debut in November 1998 as DreamWorks' first animated release.[6] A year later, Disney scheduled Bugs to open on the same week, which infuriated Katzenberg. Katzenberg invited Disney executives to DreamWorks to negotiate a release date change for Bugs, to which Disney kept the date unchanged. DreamWorks pushed Prince of Egypt to the Christmas season and the studio planned to not begin full marketing for Antz before their planned first film.[14] Disney afterward announced release dates for films that were going to compete with Egypt. Katzenberg suddenly moved the opening of Antz from March 1999 to October 1998 to compete with Pixar's release.[10][13][15][16]David Price writes in his 2008 book The Pixar Touch that a rumor, \"never confirmed\", was that Katzenberg had given PDI \"rich financial incentives to induce them to whatever it would take to have Antz ready first, despite Pixar's head start\".[10][13] Jobs furiously called Katzenberg, during the call he explained to Katzenberg that there was nothing he could do to convince Disney to change the date.[11][13] Katzenberg said to him that Jobs himself had taught him how to conduct similar business long ago, explaining that Jobs had come to Pixar's rescue from near bankruptcy by making the deal for Toy Story with Disney.[13][17] He suggested that Jobs had enough power with Disney to convince them to change specific plans on their films.[11] Lasseter also claimed Katzenberg had phoned him with a final proposition to delay Antz if Disney and Pixar changed the date of Bug's Life, but Katzenberg denied this later.[18] Jobs believed it was \"a blatant extortion attempt\".As the release dates for both films approached, Disney executives concluded that Pixar should keep quiet on Antz and the feud concerning DreamWorks. Regardless, Lasseter publicly dismissed Antz as a \"schlock version\" of A Bug's Life.[19] Lasseter, who claimed to have never seen Antz, told others that if DreamWorks and PDI had made the film about anything other than insects, he would have closed Pixar for the day so the entire company could go see it.[11][20] Jobs and Katzenberg would not back down and the rivaling ant films provoked a press frenzy. \"The bad guys rarely win,\" Jobs told the Los Angeles Times. In response, DreamWorks’ head of marketing Terry Press suggested, \"Steve Jobs should take a pill.\"[13] Tensions would remain high between Jobs and Katzenberg for many years after the release of both films. According to Jobs, years later Katzenberg came to him after the opening of Shrek. He insisted that he had never heard the pitch for A Bug's Life, reasoning that his settlement with Disney would have given him a share of the profits if that were so.[21] In the end, Pixar and PDI employees kept up the old friendships that had arisen from working in computer animation for years before feature films.[18]The final product of both films are generally perceived to contrast one another in tone and certain plot points. Antz in the end seemed to be more geared towards teenagers and adults, featuring moderate violence and death, mild sexual humor, as well as social and political satire. A Bug's Life was more family-friendly and lighthearted in tone and story. In design they too share noticeable differences, Antz played off real aspects of ants and how they relate to other bugs, like termites and bees, while Bug's Life offered a more fanciful look at insects to better suit its story. PopMatters journalist J.C. Maçek III compared the two films and wrote, \"The feud deepened with both teams making accusations and excuses and a release date war ensued. While Antz beat A Bug's Life to the big screen by two months, the latter film significantly out grossed its predecessor. Rip off or not, Antz's critical response has proven to be almost exactly as positive as what A Bug's Life has enjoyed.\"[22]","produced_by":"Brad Lewis|Aron Warner|Patty Wooton|","starring":"Woody Allen|Gene Hackman|Sharon Stone|Sylvester Stallone|Jennifer Lopez|Christopher Walken|Anne Bancroft|Dan Aykroyd|Danny Glover|","running_time":"83 minutes[1]","music_by":"John Powell|Harry Gregson-Williams|","antz":"Theatrical release poster","edited_by":"Stan Webb","Release":"In late 1997, a teaser trailer for Antz, depicting the opening scene with Z in an ant psychiatrist office, first played in theaters in front of select prints of As Good as It Gets.[23] Anticipation was generally high with adult moviegoers rather than families and children.The film topped the box office in its opening weekend, earning $17,195,160 for a $7,021 average from 2,449 theatres.[2] In its second weekend, the film held the top spot again, with a slippage of only 14% to $14.7 million for a $5,230 average and expanding to 2,813 sites. It held well also in its third weekend, slipping only 24% to $11.2 million and finishing in third place, for a $3,863 average from 2,903 theatres. The film's widest release was 2,929 theatres, and closed on February 18, 1999. The film altogether picked up $90,757,863 domestically, almost recouping its $105 million budget,[2] but failed to outgross the competition with A Bug's Life. The film picked up an additional $81 million overseas for a worldwide total of $171.8 million, making it a moderate box office success.Antz was released to VHS and DIVX on February 9, 1999,[24][25] and to DVD on March 23, 1999,[25][26] becoming the first feature-length CGI-animated film to be available on DVD.[27] However, the DVD release used a 35mm print of the film to create the copies, rather than using the original files to encode the movie directly to video.[28][29]","written_by":"Paul Weitz|Chris Weitz|Todd Alcott|","budget":"$105 million[2]"}