{"Cast":"A mother of the Bartolomes with five young sons. After discovering copies of rebellious pamphlets lying around the house, she accepts Jules' inclination to become an anti-Government winger,.The head of the Bartolome family. He wants all his children to be come successful in life. Being suspicious of Jules' inclination to become an anti-Government winger, he also became convinced when they find copies of rebellious pamphlets lying around the house and supports Jules to rally against corruption in the governmentThe first son of the Bertolomes. After Amanda and Julian discover his inclination to the resistance movement, they confronted their son about them, and he had to admit his decision. At first, conflict ensues in the family. Eventually, the parents learned to accept their son's decision, and eventually became proud of him. Since then, their home became a constant place of recreation for Jules who often brought a friend along with him. Jules was subsequently sent to prison after the said friend betrayed the family by revealing himself to be an undercover government operative.The third child of the Bartolomes who writes illegal exposure and other banned literature. He also heard the news of Jason's death in 1977.The second child of the Bartolomes. Gani becomes the family's hope to raise their social status when he plans to work for the United States Navy despite Jules' objections due to him being patriotic. He, however, quickly became the Bartolomes' figure of shame upon the accidental pregnancy of his girlfriend Evelyn and is forced to marry her. He later fathers the family's first grandchild, Annaliza while working with the U.S. Navy.The fourth child of the Bartolomes who was dating with his girlfriend Bernadette. He was killed and stabbed multiple times by corrupted policemen in 1977, his death was finally heard by his elder brother Emmanuel.The youngest of the children. He remains calm during the 70sThe wife of Jules BartolomeThe wife of Isagani BartolomeJules' best friend and activist. He was killed by torturers in 1972.An unnamed character who only appears in two scenes. After Evelyn is returned to her family's household by the Bartolome couple with Isagani late one night, he does a shotgun wedding to Isagani after hearing of his daughter's stay with the latter.An unnamed character who is shown sobbing after Evelyn's return to the household and is a witness to the shotgun wedding by the unnamed father of Evelyn","country":"Philippines","distributed_by":"Star Cinema","Plot":"A middle-class Manila neighborhood is home to the Bartolome family. Couple Amanda Bartolome (Vilma Santos) and Julián Bartlome Sr. (Christopher de Leon) are parents to sons Julian \"Jules\" Bartolome Jr. (Piolo Pascual), Isagani \"Gani\" Bartolome (Carlos Agassi), Emmanuel \"Em\" Bartolome (Marvin Agustin), Jason Bartolome (Danilo Barrios) and Benjamin \"Bingo\" Bartolome (John Wayne Sace). The story tells about their life during the martial law in the Philippines during the 1970s.In 1965, as a young Gani was fighting with his friend while they were playing a game in the street, their mothers came by to stop the fighting and made them stay away from each other. In the streets of Manila, protests take place when the Philippines enters the Vietnam War.In 1970, Philippine president Ferdinand Marcos wins his re-election bid as president. At dinner time, Jules and Gani speak about the upcoming Junior-Senior Promenade. Amanda was looking for a job but her husband Julián stopped her from finding it. At the prom, Gani and Jules are dancing with their partners, Gani tries to hold her but she accidentally kicks him instead. The Bartolomes get stuck in traffic in the streets on the way home from the event. A protest happened near the Legislative Building and large protests was the major cause when Ferdinand Marcos declared martial law, there were effigies burned by activists during the recent protest.In 1971 another protest took place in the University of the Philippines and Jules with his best friend Willy (Jhong Hilario) became activists that same year. Emmanuel begins to write illegal exposure and other kinds of banned literature. Jules and Wily joined a resistance movement and both of them made pledges. A large number of protesters started to demonstrate outside and they began to sing the Philippine National Anthem, \"Lupang Hinirang\", with raised clenched fists. The soldiers were outnumbered and the protesters were trying to push them away but they couldn't so they retreated back to their places. Just then a furious Julián explain to Jules and Willy and also learns that the writ of habeas corpus was suspended by Marcos himself including the enforced disappearance of the student leader Charlie del Rosario. Gani explains to his father his plans to apply for a job in the US Navy only to be overheard by Jules, who admonishes his actions as lack of patriotism for the Philippines. Gani angrily explains to him that if he works for the US government, he gets a high salary with numerous benefits. Julián accepts the plan. Another protest took place in the streets which was against that United States then one of the activists tied up their own comrades into the cross. Bingo pulls down a flying kite and Amanda discovers that the kite is made out of newspaper which is for activists. Julián also discovers that Jules is an activist and he sneaks up to his room checking his rebellious pamphlets. He convinces that when Marcos was not a president that time when the government signed a treaty between the United States and the Philippines and has no choice to recognize the treaty.In 1972, Marcos declared martial law on nationwide television. He also included curfew at night to round up people from going outside to be imprisoned, interrogated, and tortured to death. Gani accidentally impregnates his girlfriend Evelyn (Dimples Romana) and her sleeping in Gani's room was discovered by Amanda. Two police cars escort the Bartolomes to Evelyn's house. At the house, Evelyn's father speaks to the Bartolome couple before blackmailing Gani into marrying her. They are married but days after the wedding, they make an argument for being the Bartolome's figure of shame. Jason shows his mother the report card but his grades just went down. But despite that, he convinces that during the first period, there was a high value of time. Jules came home late but he later went sad and cried for Willy. Willy was tortured to death when he stayed outside at night, the people who tortured him also stabbed him using their crowbars to kill him and he died some time later. Jules wanted to go to Bicol to join the communist group the NPA for his exposure trip.In 1973, Evelyn gave birth to a baby girl and at the same day, Gani went to the United States after he was enlisted at the US Navy but at the same time, Evelyn went back to her mother. Emmanuel is going to the Bataan for his interview about the Bataan Nuclear Power Plant but Julián went so furious because he thinks that he started to forget the martial law and he might get caught also there were soldiers everywhere in one place. The next day, Emmanuel left for Bataan for his interview and then two days later the Bartolome family went to the beach in the afternoon.In 1974, Jules' friend and was injured while being shot in the knee and the entire family is extracting the bullet out of his knee. A few days later, he began to hangout with Emmanuel and at the following day, Jules left the house again realizing that he cannot stay there for long.In 1975, Bingo celebrates his birthday and they throw a birthday party in his family house until night. And after a couple of months without returning to his house, Jules was revealed to have been married to Mara (Ana Capri) and they both have a baby boy. At night, they were burning rebellious pamphlets to avoid them from being seen by soldiers but instead, there are carolers standing and singing in front of the house.In 1976, a group of soldiers arrive at their house for the search and arrest order led by Jules, who became a political officer. The next day, Amanda and Bingo release two of their own pet birds to fly away for their freedom, but they will know that those birds will come back to them. At night there is a phone call, and Emmanuel is shocked because Jules is subsequently sent to prison after his friend betrays them by revealing himself to be an undercover government operative. He also survived from torture but instead he was also electrified and sleep on the ice box and in front of the electric fan while being naked. At Christmas Day, Jason went home late from caroling and he learns that there was no curfew, but he wants to date with his girlfriend, Bernadette tomorrow but his mother told to him that he can date with her anytime but not during Christmas Day.In 1977, Amanda learns that Jason was missing, she and her husband went to many police stations to look for their missing son all night long. And they learned that Jason was imprisoned for possession of marijuana but he was released for a few moments later and he was still missing. Emmanuel went to his friend and he said that there were three policemen who stabbed a young man to death, tying up his hands and salvage him to the dump. When he came home silently, he made a private talk to his father while a saddened Amanda sits down on the chair. While hearing loud cries, the young man was revealed to be Jason who was stabbed to death and Amanda faints. At his funeral, Gani recently came back from the United States to attend his wake, the three brothers went to his body crying. Bingo was still sad because he thought that he was still mad at him, he said that Bernadette wanted to introduce Jason to her parents during Christmas Day but he died. Julián explains to Amanda that there were thousands of people killed during the martial law. Amanda and her friends went to Jason's grave and she convinces that it is best for her to live without her own children because she thought that her children can die early, she began to cry and she said that Jason wasn't a bad person. Even though that he is a demon, he is not really a bad person. Amanda plans that she and Julián to be separated, she wanted to live alone and also she had a feeling from Jules when he is in prison but she wanted to be proud of herself. Amanda went to Emmanuel and there was a stage rehearsal for activists. A few moments later, Bingo informs to his mother that they will not be separated because Jules was released from prison. At the prison cell, the Bartolomes visited Jules for his release from prison while he was saying goodbye to his fellow inmates.In 1978 during the Batasang Pambansa Elections a group of people are parading on the city street in Manila causing a moderate traffic on the road. The Bartolome family started to join the activist group called the Kilusad group to overthrow the Marcos regime. Emmanuel went on stage to lead his fellow activists to sing the Lupang Hinirang.And then in 1983, the Bartolome family attend the wake of Ninoy Aquino at the Santo Domingo Church in Quezon City after his assassination and Amanda begins to join a large group of activists at the Post Office Building to overthrow the Marcos regime once and for all. The Marcos regime was peacefully overthrown in 1986 when Corazon Aquino was sworn into office as president until 1992.","language":"Filipino (Tagalog) and English","box_office":"₱ 45,112,056.33","cinematography":"Neil Daza","directed_by":"Chito S. Roño","release_dates":"25 December 2002 (2002-12-25)|||||","produced_by":"Tess V. Fuentes","starring":"Vilma Santos Christopher de Leon Piolo Pascual Marvin Agustin Kris Aquino Ana Capri Dimples Romana Jhong Hilario Carlos Agassi Danilo Barrios Carlo Muñoz Tirso Cruz III Orestes Ojeda John Wayne Sace Marianne de la Riva Manjo del Mundo Cacai Bautista","running_time":"131 minutes","music_by":"Nonong Buencamino","edited_by":"Jess Navarro","written_by":"Lualhati Bautista","budget":"P 40 Million"}