{"production_code":"50/LDX071Y/01X[1]","incidental_music_composer":"John Debney John Sponsler Louis Febre","production":"Doctor Paul McGann (Eighth Doctor) Sylvester McCoy (Seventh Doctor)","director":"Geoffrey Sax","Plot":"Following the Master's trial and execution at the hands of the Daleks, the Doctor, currently in his seventh incarnation, is transporting the Master's remains to Gallifrey via his TARDIS. En route, the box with the remains breaks open and an ooze leaks out, infecting the TARDIS. The Doctor is forced to make an emergency materialisation in San Francisco's Chinatown on 30 December 1999.As he exits and locks the TARDIS, the Doctor is shot by a gang chasing down Chang Lee, a young Chinese-American man. Lee calls for an ambulance and escorts the unconscious Doctor to a hospital, unaware the ooze from the TARDIS has gotten aboard. At the hospital, cardiologist Dr Grace Holloway attempts surgery to remove the bullet but is confused by his strange double-heart anatomy, and when the Doctor suddenly wakes during the operation, she accidentally lodges a cardiac probe in his body, apparently killing him. The Doctor's body is taken to the morgue, while Lee is given the Doctor's possessions including the TARDIS key. Meanwhile, the ooze takes over the body of the ambulance driver, Bruce, transforming him into a new body for the Master.Later, the Doctor's body regenerates, and the new Doctor, suffering amnesia, gathers clothes from remnants of a recent party. He recognises Holloway, who has resigned from the hospital after the failed operation, and follows her to her car, proving to her he is the same man by pulling out the cardiac probe. Holloway takes him home to recover. Lee returns to the TARDIS where the Master arrives and puts him under his mind control by claiming the Doctor had stolen his body. The Master convinces Lee to open the TARDIS and then to open the Eye of Harmony within it, which requires a human retinal scan. When the Eye opens, the Doctor is flooded with memories and realises the Master is searching for him, and tries to block the scan. He warns Holloway that while the Eye is opened, the fabric of reality will weaken, and potentially destroy the Earth by midnight on New Year's Eve if they cannot close it. However, he needs an atomic clock to do so, and Holloway finds one on display at the San Francisco Institute of Technological Advancement and Research.Outside, they find the ambulance with the Master and Lee waiting for them, offering them a ride. The Doctor does not immediately recognise the Master, but discovers his true identity en route, and he and Holloway escape, but not before the Master can spit an ooze-like substance on Holloway's wrist. The two continue to the Institute and obtain the clock, returning to the TARDIS. The Doctor installs the clock and successfully closes the Eye, but finds the damage to reality too great and that he must revert time before the Eye was opened to prevent the destruction of Earth. As he connects the proper TARDIS circuits to do this, the Master remotely takes control of Holloway's body, causing her eyes to become inhuman, and she strikes the Doctor unconscious.The Doctor wakes to find himself chained above the Eye, the Master poised to take his remaining regenerations while Lee and Holloway watch. The Doctor is able to break the Master's control on Lee, and Lee refuses to open the Eye for the Master. The Master kills him, and then releases his control on Holloway to return her eyes to normal. He forces her to open the Eye and then begins drawing the Doctor's lifeforce. Holloway, under her own control, is able to complete the final circuits to put the TARDIS into a time-holding pattern, preventing Earth's destruction, and then goes to free the Doctor. The Master kills her, but this has given enough time for the Doctor to free himself and attack the Master. The Doctor gains the upper hand and pushes the Master into the Eye. The Eye closes and time reverts a few minutes, undoing Lee and Holloway's deaths.With no further risk to Earth, the Doctor prepares to leave. Lee returns his possesses, and the Doctor warns him not to be in San Francisco on the next New Year's Eve. The Doctor offers Holloway the opportunity to travel with him, but she politely refuses, and instead kisses him goodbye. The Doctor departs alone in his TARDIS.","length":"85 mins (UK) 89 mins (US)","chronology":"← Preceded by Followed by → Survival (serial) Dimensions in Time (charity special) \"Rose\"","Broadcast and reception":"The movie debuted on the Edmonton, Alberta CITV-TV station on 12 May, two days prior to its Fox Network broadcast.Commercials on the Fox network advertising the film used special effects footage from the 1986 story The Trial of a Time Lord, although this footage was not used in the movie. This marked the first time that footage from the original BBC series had been shown on a major American network. The advertisements also used a different arrangement of the Doctor Who theme music from that heard in the film.The movie received disappointing US ratings. It received 5.6 million viewers, a total 9% share of the audience.[12] However, when shown on BBC One in the United Kingdom on Monday 27 May at 8.30pm, thirteen days after its American broadcast, it received over 9 million viewers in the UK alone. It received a 75% Audience Appreciation score.[20]Third Doctor actor Jon Pertwee died a few days after the US broadcast of the film, and the UK broadcast included an epitaph to the actor. The UK broadcast was also edited for broadcast in a pre-Watershed timeslot, with around 1 minute of cuts made. The scenes where Chang Lee's friends are fired upon was cut because of the BBC's sensitivity about gun violence following the Dunblane massacre three months before.[citation needed] The operating room scene was also extensively cut, in particular shots involving the cardiac probe and the Seventh Doctor's dying scream,[citation needed] and the shot of the Master breaking Chang Lee's neck was also removed.[citation needed]Maureen Paton in the Daily Express praised the movie \"At last we have a grown-up hi-tech Doctor Who in Paul McGann...only a low-tech Luddite would miss the endearing amateurism of the old teatime serial format...the makers would be mad not to pursue the option of a series.\"[21] Matthew Bond of The Times, by contrast stated \"If the series is to return it will need stronger scripts than this simplistic offering, which struggled to fill eighty-five minutes and laboured somewhat in its search for wit\".[21] The letters pages of The Radio Times were divided between viewers who liked and disliked the TVM.[21]The television movie won the 1996 Saturn Award for Best Television Presentation.","156_–_doctor_who":"Doctor Who television movie","executive_producer(s)":"Philip David Segal Alex Beaton Jo Wright (for the BBC)","cast":"1996 promotional poster","originally_broadcast":"12 May 1996 (Canada) 14 May 1996 (USA) 27 May 1996 (UK)","series":"Television movie","Production":"Producer Philip Segal had been trying for some years to launch a new American-produced series of Doctor Who, but the Fox Network — the only American network that showed any interest — was only prepared to commit to a single telemovie. It was hoped that, would the telemovie be successful, Fox might be persuaded to reconsider a series; however, the telemovie's ratings performance in America was not strong enough to hold Fox's interest.The production budget for the movie (as revealed in the book Doctor Who: Regeneration) was US$5 million, with the Fox Network spending $2.5 million, BBC Television contributing $300,000, and the remaining $2.2 million split between BBC Worldwide and Universal Television.Miranda, the wife of Bruce, is played by Eric Roberts' real-life wife, Eliza Roberts.The producers of the television movie compiled several lists of actors to consider for the part of the Doctor. Among early thoughts were Michael Crawford, Tim Curry, Eric Idle, Billy Connolly, Trevor Eve, Michael Palin, Robert Lindsay, and Jonathan Pryce.[citation needed] All were uninterested in the project, or unavailable for the intended filming dates.[citation needed]Casting sessions took place in March 1994; actors who actually auditioned for the role include Liam Cunningham, Mark McGann, Robert Lindsay, Tim McInnerny, Nathaniel Parker, Peter Woodward, John Sessions, Anthony Head, and Tony Slattery. Paul McGann was first considered around the time of these auditions, but did not formally audition for the part until later.[1]Among the actors who were invited to audition for the role of the Doctor but declined the opportunity were Christopher Eccleston[16] and Peter Capaldi.[17] Eccleston and Capaldi would go on to play the Ninth and Twelfth incarnations of the Doctor respectively in the revived series of Doctor Who which began in 2005. Eccleston turned down the offer to audition for the TV Movie because at the time he felt he was not yet an established enough actor and did not want to be associated with a \"brand name\" so early in his career.[16] Capaldi declined because he felt it was unlikely that he would be given the part.[17]Liam Cunningham guest-starred in the Series 7 Episode, \"Cold War\" as Captain Zhukov.[citation needed]The movie was filmed on 35mm film in Vancouver, British Columbia, the first time any Doctor Who story had been filmed in North America (although the 1985 Sixth Doctor story The Two Doctors was originally planned for New Orleans). It is, to date, the only Doctor Who production to be entirely mounted outside of the UK (whereas all other episodes shot on foreign soil included at least some studio taping in the UK). Until the 2011 Eleventh Doctor stories \"The Impossible Astronaut\" and \"Day of the Moon\", the film was the only story to have principal photography in North America, followed by the 2012 story \"The Angels Take Manhattan\".In the 2005 Doctor Who Confidential episode \"Weird Science\", and on the DVD commentary, Sylvester McCoy reveals that during the sequence where he locks the casket with his sonic screwdriver, he held the tool pointing the wrong way around (although in the original series, it is seen being used both ways). The sonic screwdriver was blurred in post-production to conceal the error. This is also the only time the Seventh Doctor was seen using a sonic screwdriver.Writer Matthew Jacobs's father, Anthony Jacobs, played the role of Doc Holliday in the 1966 First Doctor serial The Gunfighters; the young Matthew remembered visiting the studio during production.The opening pre-credits sequence went through a number of modifications, with several different voice-overs recorded. At one stage the voice-over was to be made by the old Master, played by Gordon Tipple; in the end this was not used. Tipple is still credited as \"The Old Master\", though in the final edit his appearance is very brief, stationary, and mute. Had the original pre-titles voice-over been used, it would have been unclear what incarnation of the Doctor Sylvester McCoy portrays in the movie (as he is simply credited as \"The Old Doctor\"). Only the rewritten narration (as read by Paul McGann) makes his number of regenerations clear. The sequence of the TARDIS flying through the time vortex was briefly reused in the opening of Doctor Who and the Curse of Fatal Death, as the Master observes Rowan Atkinson's Doctor.Instead of designing a new Doctor Who logo for this film, it was decided instead to use a modified version of the logo that was used for the Jon Pertwee era of the original series (with the exception of the final season). This logo, being the last logo used on an \"official\" Doctor Who broadcast before the 2005 revival, is to this day used by the BBC for most Doctor Who merchandise relating to the first eight Doctors.John Debney was commissioned to write the score for this film, and intended to replace Ron Grainer's original theme with a new composition. Ultimately Debney did in fact use an arrangement of Grainer's music for the theme, although Grainer goes uncredited.There is some disagreement over exactly what the movie should be called. The production documentation only referred to the project as Doctor Who[citation needed]. Segal suggested the unofficial title Enemy Within as an alternative at Manopticon 5, apparently after being repeatedly asked what the actual title for the movie was[citation needed]. Both DVD releases are labelled Doctor Who: The Movie. The VHS release contains both the name Doctor Who and the phrase, The Sensational Feature Length Film (plausibly read as a subtitle). The most common fan usage appears to refer to it as \"The Television Movie\" or \"TVM\", or variations thereof.Upon translation into French, this film was renamed Le Seigneur du Temps (literal translation: \"The Lord of Time\").\"TVM\" is the production code used in the BBC's online episode guide.[18] The actual code used during production is 50/LDX071Y/01X.[1] Doctor Who Magazine's \"Complete Eighth Doctor Special\" gives the production code as #83705.[19] Big Finish Productions uses the code 8A, and numbers its subsequent Eighth Doctor stories correspondingly.","producer":"Peter V. Ware Matthew Jacobs (co-producer)","writer":"Matthew Jacobs","script_editor":"None","Commercial releases":"The movie was scheduled to be released on home video in the United Kingdom several weeks before broadcast to capitalize on the interest in the series returning. However, the British Board of Film Classification required the video release to have the same one minute of cuts as the broadcast version,[citation needed] and so the release was delayed to a week prior to its debut broadcast on BBC One. Hundreds of fans queued in London at midnight in order to buy a copy at the earliest possible moment, however overall sales were impacted by the now-imminent broadcast[citation needed].A Laserdisc release of the movie was released exclusively in Hong Kong by Universal in 1997.[22]The unedited version was released on DVD in the UK in 2001 titled as Doctor Who: The Movie, and was re-released in 2007 as a limited edition with an alternative cover sleeve (but with no change in content) as part of a series of classic series re-releases aimed at attracting fans of the revived series to the older shows.Both the edited and unedited versions have also been released in countries such as Australia and New Zealand.The 2010 DVD box set Revisitations contains the movie with a new, updated Special Edition DVD features.[23] It included a new commentary with Paul McGann and Sylvester McCoy, an hour-long documentary on the time in between the film and the series' cancellation in 1989, a documentary on the 7 years it took to get the film made, a documentary on the 8th Doctor's comic strip adventures, a documentary on the media reaction the 8th Doctor, a documentary on the ties with Blue Peter and Doctor Who as well as all of the original features including the original commentary with Geoffrey Sax. On 25 August 2010, Dan Hall of 2entertain confirmed that this updated version would be released in North America sometime in the next twelve months following extensive negotiations with Universal Studios.[24] Two months afterward, a North American DVD release date for the 2-disc Doctor Who: The Movie - Special Edition was announced to be 8 February 2011.[25]In 2013 it was released on DVD again as part of the \"Doctor Who: The Doctors Revisited 5-8\" box set, alongside the classic serials Earthshock, Vengeance on Varos, and Remembrance of the Daleks. Alongside a documentary on the Eighth Doctor, it also features an introduction from current show runner Steven Moffat.Music from the movie was on a promotional-only soundtrack album published by the composer, John Debney. Additional music was contributed by John Sponsler and Louis Febre.[26][27] Although the composer of the Doctor Who Theme, Ron Grainer, did not receive screen credit for his composition in the TV movie broadcast, the CD finally attributes the proper credit on its cover. The entire score was re-released with previously unreleased cues as the eighth disc of the eleven disc Doctor Who: The 50th Anniversary Collection on 29 September 2014.All music composed by John Debney, except where noted.The television movie was novelised by Gary Russell and published by BBC Books in May 1996. It was the first novelisation of a televised Doctor Who story to not be published by Target Books (or related companies) since Doctor Who and the Crusaders in 1965.Basing the adaptation on an early draft of the script, Russell adjusted some details to make it more consistent with the original series, and the novelisation also contains elements that were cut from the shooting script for timing reasons.The novelisation was the first Doctor Who novel published by BBC Books. The book was actually published prior to the conclusion of Virgin Books' contract for publishing original Doctor Who fiction, so the next release by BBC Books did not occur for about a year when the Eighth Doctor Adventures series began with The Eight Doctors. The novelisation was released as a standalone work and is not considered part of this series. The Eighth Doctor Adventures series ran until 2005 when it was discontinued.In 1997, the novel was also released as an audio book, read by Paul McGann. This reading was later included on the 2004 MP3 CD Tales from the TARDIS Volume Two."}