{"based_on":"Bright Lights, Big City  by Jay McInerney","country":"United States Japan","distributed_by":"United Artists","screenplay_by":"Jay McInerney","language":"English","Reception":"Bright Lights, Big City was released on April 1, 1988 in 1,196 theaters, and grossed USD $5.1 million during its opening weekend. The film went to make $16.1 million domestically, below its budget of $25 million.[5]The film received mixed reviews from critics and has a 61% rating on Rotten Tomatoes, based on 18 reviews. In his review for Newsweek, David Ansen wrote, \"Bright Lights isn't an embarrassment, like Less Than Zero; it's a smooth, professional job. But when it's over you may shrug your shoulders and ask, \"Is that all?\"[6] Janet Maslin, wrote in her review for the New York Times, \"Mr. Bridges may not have breathed fire into this material, but he has preserved most of its better qualities. He has treated it with intelligence, respect and no undue reverence, assembling a coherent film that resists any hint of exploitation\".[7] In his review for the Washington Post, Hal Hinson criticized Fox's performance, stating that he \"was the wrong actor for the job. Fox, who in The Secret of My Succe$s showed a gift for light comedy, is too stylized a performer for the heavier stuff; he has no natural weight. In addition, Fox shows a reluctance to let the audience see him in an unflattering light\".[8] However, Roger Ebert praised the actor's performance: \"Fox is very good in the central role (he has a long drunken monologue that is the best thing he has ever done in a movie)\".[9] Time magazine's Richard Schickel felt that the film, \"arrives... looking like something that has been kicking around too long in the dead-letter office\".[10]A special edition DVD version of Bright Lights, Big City was released on September 2, 2008. In her review for the The Washington Post, Jen Chaney wrote, \"In the end, that's what is most disappointing about this DVD. What could have become a compelling look at a seminal novel of the 1980s and its rocky path through Hollywood ends up being a rudimentary release with a couple of decent commentary tracks and two forgettable featurettes\".[11]On July, 31, 2010 the story's author stated in an NPR All Things Considered interview that Gossip Girl co-creator Josh Schwartz would remake an updated version of the film.","box_office":"$16,118,077","Synopsis":"Originally from Pennsylvania, 24 year-old Jamie Conway (Michael J. Fox) works as a fact-checker for a major New York magazine, but because he spends his nights partying with his glib best friend Tad (Kiefer Sutherland) and his frequent cocaine abuse, he's on the verge of getting fired by his boss, Clara Tillinghast (Frances Sternhagen). His wife Amanda, a fast-rising model (Phoebe Cates), just left him; he is still reeling from the death of his mother (Dianne Wiest) a year earlier; and he follows a tabloid story about a pregnant woman in a coma. The movie captures some of the glossy chaos and decadence of the New York nightlife during the 1980s, and also looks at a man desperately trying to escape the pain in his life.","cinematography":"Gordon Willis","production_company":"Mirage","directed_by":"James Bridges","bright_lights,_big_city":"Theatrical release poster","release_dates":"April 1, 1988 (1988-04-01) (North America)|||||","Production and development":"In 1984, Robert Lawrence, a vice president at Columbia Pictures, championed Jay McInerney's novel against resistance from older executives.[1] He felt that the book spoke to his generation and described it as \"Graduate, with a little bit of Lost Weekend\".[1] The studio agreed to make the film with Jerry Weintraub producing and Joel Schumacher directing. McInerney wrote a draft of the screenplay and, soon afterward, Schumacher started rewriting it.[1] Actor Emilio Estevez was interested in adapting it into a film.[2] He met with McInerney while he was still working on the screenplay. Tom Cruise was offered first refusal on the script while McInerney and Schumacher were attempting to capture the novel's distinctive voice. McInerney, Cruise and Schumacher scouted locations in New York City and checked out the atmosphere of the club scenes described in the novel.[1] At one point, Judd Nelson, Estevez, and Rob Lowe were all considered for the role of Allagash.[2]In 1985, Weintraub took the property to United Artists when he became chief executive there.[1] The film needed a new producer so Sydney Pollack and Mark Rosenberg took over. They hired writer Julie Hickson to write a script. Cruise and Schumacher grew tired of waiting for a workable script, but before they could be replaced, Weintraub left United Artists.[1] The project became entangled in a complicated settlement with the studio, months being lost before it finally stayed at United Artists. A decision was made to shoot the film in Toronto and cast an unknown in the leading role.[1]Joyce Chopra was hired to co-write the script, with her husband Tom Cole, and also direct it. She had her agent send a copy of McInerney's novel to Michael J. Fox.[1] The actor won the leading role and, at his request, the part of Tad Allagash went to Kiefer Sutherland.[3] Fox's casting increased the budget to $15 million and principal photography was moved to New York City.[3] The producers hired a crew, many of whom had worked with Pollack, while Chopra brought along the cinematographer from her first film, Smooth Talk, James Glennon.[1]Fox had to be back in Los Angeles to start filming his TV series Family Ties by mid-July, giving Chopra only ten weeks to finish the film. It was rumored that she was indecisive, relying too much on consulting with Glennon and Cole, wasting time over a single shot.[1] It was also rumored that she panicked while shooting on the streets of New York as fans of Fox disrupted filming. Chopra has said, \"I kept insisting that we take time each day to give the actors a chance to find their way, in spite of the panic caused all around us by the morning calls from United Artists asking if I had taken my first shot yet. Working collaboratively with my cameraman seemed to drive the producers into a sort of frenzy\".Studio executives did not like what Chopra was shooting and, a week into filming, the studio's chairman and its president of production flew from L.A. to New York to check on the film. Both executives had not read the script and were unaware of how different it was from the novel.[1]McInerney has said that Cole wrote all the drugs out of the script while Cole said that he did this on instructions from Pollack, who was worried that the film would hurt Fox's wholesome image with audiences. Cole recalls, \"There was definitely pressure and concern at that time about how Michael was seen by America.\"[1] The studio announced that \"a more experienced director\" was needed as a result of an impending strike by the Directors Guild of America. On the short list of possible replacements were Ulu Grosbard, Bruce Beresford, and James Bridges.[1] Bridges received a call on a Friday that the film was in trouble, read the novel that night, and flew to New York on Sunday. He saw Chopra's footage and agreed to direct if he could start from scratch and hire Gordon Willis as his cinematographer.[1]Reflecting on her experience in a 2013 interview with Hidden Films, Chopra reiterated Cole's statements that her version reduced the drug-related content because of studio pressures. \"The film was produced right at the time of Nancy Reagan’s ‘Just Say No’ [slogan] and I think the studios were scared shitless. I think the producers had a book they were sorry they were doing. Sydney said he didn’t like the book, he didn’t approve of it. So you get a mess, yeah.” She is still angered by statements made in The New York Times Magazine article. \"What amazed me was, they were boasting that after I left, they were wearing a shirt with a shoe on it! They said that I spent a month doing nothing but filming Michael walking, which was so insane. I was flabbergasted that the producers would print a t-shirt to step on me. What kind of people are these?” [4]According to Chopra, these “shoe leather” scenes were shot in adherence to the studio’s schedule. “It was set up so that we would do all the exterior shots first. There was a concern about the trees. I don’t remember what season it was, but if there were shots of Michael going from A to B, you try to do all his scenes on days with a lot of daylight. [4]In seven days, Bridges wrote a new draft and replaced six actors, casting instead Jason Robards, John Houseman, Swoosie Kurtz, Frances Sternhagen, and Tracy Pollan, while keeping Sutherland and Dianne Wiest.[1] The new cast members read the novel because there was no script at the time. Chopra had worked on the film for only a month, which Fox has described as \"a rehearsal period, though it wasn't meant to be.\"[1] The strike forced the production to shoot in seven weeks and use McInerney's first draft, which Bridges liked the best.[3] Bridges worked on the script on weekends with McInerney, who was enlisted to help with revisions. The two agreed to share screenwriting credit but the Writers Guild of America decided to give it to McInerney only.[1]The cocaine that Fox snorts in the film was a prop called milk sugar.[1] The filmmakers shot two different endings - one where Fox's character decides to start his life all over and an alternate one, to please the studio, where he has finished writing a novel to be called Bright Lights, Big City with a new girlfriend who is proud of what he has written.[1]","produced_by":"Mark Rosenberg Sydney Pollack","starring":"Michael J. Fox|Kiefer Sutherland|Phoebe Cates|Dianne Wiest|","running_time":"107 minutes","music_by":"Donald Fagen","edited_by":"John Bloom","budget":"$25 million"}