{"Cast":"Seventy-year-old Li Jun becomes a youth again after visiting a mysterious photo studio. She joins her family and re-experiences the meaning of love, family and music. When Xiang Qian Jin gets into an accident, only she has the same blood type as him and can save his life. She likes Tan Zhi Ming in the end.The grandson of Li Jun, he is pampered by his grandmother. He aspires to be a singer one day and gets the help of his youthful grandmother who helps fulfil his dreams. Not knowing that Li Jun was his grandmother, he starts developing feelings for her. In the end, he had an accident when only his grandma match his blood type.Zhi Ming is a musical director who sees potential in Qian Jin and his band. He develops feelings with Li Jun after working with her band.Da Hai was Li Jun's lover as a youth. He continues to hold feelings for Li Jun and is the only one who discovers that Li Jun had become 20 again.The son of Meng Li Jun who is a professor at a university. He has a wife in Qin and two children: a son, Qian Jin and a daughter, Xin Ran. He wanted to send his own mother to the Nursing Home.The wife of Guo Bin, mother of Qian Jin and Xin Ran and daughter-in-law of Meng Li Jun.The daughter of Guo Bin and Yang Qin and sister to Qian Jin. The granddaughter of Meng Li Jun who treats her with contempt due to the stress she had put her mother through. It's because of this, Li Jun doesn't get along with Xin Ran and often criticize her for her disrespect.","country":"China[1] Taiwan South Korea","Plot":"Shen Meng Jun (Kuei Ya-lei) is a crotchety prideful 70-year-old widow who frequently finds fault with everyone around her. She takes pride in her ability to raise her son single-handedly, despite the poverty during the Cultural Revolution, to become a professor of a prestigious university. She shows her bias towards her grandson Xiang Qian Jing (Lu Han) because he aspires to become a musician and he represents a dream that Meng Jun cannot achieve herself. However, she had no opportunity to be a singer. Although kind to her grandson, she is very critical towards both her daughter-in-law, Yang Qin (Yijuan Li), and granddaughter, Xin Ran (Yin Hang), who openly treats Li Jun with contempt for the way she treats her mother. This leads to Yang Qin fainting due to the pressure placed on her. After this incident, the family decides it's time for her to go to a nursing home. Feeling forlorn, she wanders the streets and impulsively decides to take a final portrait at a photo studio she happens by. Upon leaving, to her astonishment she realizes that she has been transformed back into her 20-year-old self. Given a magical second chance at youth, she changes her name to Meng Li Jun (Yang Zishan).After Meng Jun's transformation, she decides to keep her new identity a secret. She begins by renting a room from her trusted friend and past servant, Li Dahai (Deshun Wang). Later, while accompanying Dahai to the senior recreation center, she meets her long-time rival, a flirty senior woman. There, they had an epic singing battle, in which Meng Jun wins. Meng Jun captured the crowd's heart with her voice. While singing, a music director enters and offers her a chance of a lifetime.","language":"Mandarin","Reception":"By February 8, 2015, the film had earned over US$59.01 million in China.[3]","box_office":"$59,250,556[2][3]","production_company":"CJ E&M Film Division","directed_by":"Leste Chen","20_once_again":"United States poster","release_dates":"8 January 2015 (2015-01-08) (China)|||||","Production":"Principal photography began in June 2014.","starring":"Yang Zishan Kuei Ya-lei Chen Bolin Lu Han","running_time":"131 minutes"}