{"charlie_wilson's_war":"Theatrical release poster","based_on":"Charlie Wilson's War  by George Crile","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Aaron Sorkin","Plot":"The film opens with a large gathering inside an aircraft hangar. Everyone is attending a private ceremony for Democratic U.S. Representative Charlie Wilson (Tom Hanks), who is receiving a major commendation for supporting the U.S. clandestine services. As everyone looks in admiration upon a clearly moved Wilson, the movie goes back in time.In 1980, Wilson, representing Texas's 2nd congressional district, is more interested in partying than legislating. He is an inveterate drinker and has staffed his congressional office with nubile, young women. A man of limited income, he shrewdly has amassed political favors in exchange for critical votes in the House. Furthermore, he is a prominent member of several highly influential congressional committees related to defense spending and covert espionage operations.Wilson's attention is first drawn to the Soviet armed occupation of Afghanistan when he watches a televised Dan Rather report while hot-tubbing with cocaine-snorting strippers, a centerfold, and an aspiring producer in Las Vegas. He wonders why Rather is wearing a turban and conversing with poorly armed Afghan freedom fighters. Returning to Washington for a vote, Wilson follows up on the Afghan struggles against the Soviet invaders and unceremoniously doubles its current measly $5 million funding for US support.As a consequence of this sudden increase, he receives an unexpected phone call from Joanne Herring (Julia Roberts). Herring is a prominent and influential Texas socialite and former beauty queen and is known for her religious and politically conservative activism. She has aided Wilson in the past, and now she is looking to have a favor returned. She has heard of his expanding the covert Afghan budget and encourages him to do more to help the Afghan people.Making all the necessary arrangements, Herring persuades him to fly out and visit the Pakistani leadership. Pakistani President Zia and two top military aides are skeptical of Wilson's courtesy call. They complain about the inadequate American support in opposing the Soviet Union, with the sad result being that their country is being flooded with Afghans fleeing the warfare. Zia persuades Wilson to visit a major Pakistan-based Afghan refugee camp,where he is deeply moved by the sprawling camp, the endless squalor, the ceaseless misery, the children maimed by land mines, the constant deaths and funerals, the struggle to find food, and, yet, amazingly, the obvious determination by camp inhabitants to fight the Soviets.He leaves the refugee camp a changed man. Immediately meeting with a regional CIA chief, Wilson is frustrated by the official's insistence on a low-key approach against the Soviet occupation of Afghanistan to avoid direct American implication. Wilson returns home to lead an effort to substantially increase funding to the mujahideen.Meanwhile, Wilson's social life eventually brings about a federal investigation into allegations of his cocaine use, conducted by US Attorney Rudy Giuliani, as part of a larger investigation into congressional misconduct. The investigation, though nerve-wracking, results in no charge against Wilson.As part of the US covert effort, he befriends the maverick CIA officer Gust Avrakotos (Philip Seymour Hoffman) and his understaffed Afghanistan group to find a better strategy, especially including a means to counter the Soviets' formidable Mi-24 helicopter gunship. The group was composed in part of members of the CIA's Special Activities Division, including a young paramilitary officer named Michael Vickers (Christopher Denham). As a result, Wilson deft political bargaining for the necessary funding and Avrakotos' group's careful planning using those resources, such as supplying the guerrillas with FIM-92 Stinger missile launchers, turns the Soviet occupation into a deadly quagmire with their heavy fighting vehicles being destroyed at a crippling rate. The CIA's anticommunism budget evolves from $5 million to over $500 million (with the same amount matched by Saudi Arabia), startling several congressmen. This effort ultimately evolves into a major portion of the U.S. foreign policy known as the Reagan Doctrine, under which the US expanded assistance beyond just the mujahideen but also supports other anti-communist resistance movements around the world.Wilson follows Gust's guidance to seek support for post-Soviet occupation Afghanistan but finds almost no enthusiasm in the US government for even the modest measures he proposes. The film ends with a return to the hangar scene in which Wilson finishes receiving a major commendation for supporting the clandestine services.However, his pride is tempered by his fears of what unintended consequences that his secret efforts could yield later and the implications of US disengagement from Afghanistan.","language":"English","Release and reception":"The film was originally set for release on December 25, 2007; but on November 30, the timetable was moved up to December 21. In its opening weekend, the film grossed $9.6 million in 2,575 theaters in the United States and Canada, ranking #4 at the box office.[2] It grossed a total of $119 million worldwide—$66.7 million in the United States and Canada and $52.3 million in other territories.[1]Charlie Wilson's War received generally favorable reviews from critics. The review aggregator Rotten Tomatoes reported that 82% of critics gave the film positive reviews, based on 192 reviews.[3] Metacritic reported the film had an average score of 69 out of 100, based on 39 reviews.[4]Reagan-era officials, including former Under Secretary of Defense Fred Ikle, have criticized some elements of the film. The Washington Times reported that some have claimed that the film wrongly promotes the notion that the CIA-led operation funded Osama bin Laden and ultimately produced the September 11 attacks.[5] Other Reagan-era officials, however, have been more supportive of the film. Michael Johns, the former Heritage Foundation foreign policy analyst and White House speechwriter to President George H. W. Bush, praised the film as \"the first mass-appeal effort to reflect the most important lesson of America's Cold War victory: that the Reagan-led effort to support freedom fighters resisting Soviet oppression led successfully to the first major military defeat of the Soviet Union... Sending the Red Army packing from Afghanistan proved one of the single most important contributing factors in one of history's most profoundly positive and important developments.\"[6]In February 2008, it was revealed that the film would not play in Russian theaters. The rights for the film were bought by Universal Pictures International (UPI) Russia. It was speculated that the film would not appear because of a certain point of view that depicted the Soviet Union unfavorably. UPI Russia head Yevgeny Beginin denied that, saying, \"We simply decided that the film would not make a profit.\" Reaction from Russian bloggers was also negative. One wrote: \"The whole film shows Russians, or rather Soviets, as brutal killers.\"[7][8]","box_office":"$119 million[1]","Historical accuracy":"While the film depicts Wilson as an immediate advocate for supplying the mujahideen with Stinger missiles, a former Reagan administration official recalls that he and Wilson, while advocates for the mujahideen, were actually initially \"lukewarm\" on the idea of supplying these missiles. Their opinion changed when they discovered that rebels were successful in downing Soviet gunships with them.[5] As such, they were actually not supplied until the second Reagan administration term, in 1987, and their provision was advocated mostly by Reagan defense officials and influential conservatives.[9][10][11]The character \"Crystal Lee\", played by Jud Tylor, appears in the \"hot tub\" scene, which took place in Summer 1980. Later on in the movie, in two different telephone conversations, Wilson mentions that \"Crystal Lee\" was on the cover of Playboy, was in Las Vegas with him, and told Rudy Giuliani's investigators that she saw him use cocaine in the Cayman Islands. The way the movie portrays it, the investigation took place just weeks after the Las Vegas hot tub incident. In reality, the hot tub incident took place in 1980. Liz Wickersham, Miss Georgia 1976 and Wilson's then-girlfriend, who was with him in the Las Vegas hot tub, was on the April 1981 Playboy cover, and told investigators in 1986 that she saw Wilson use cocaine in the Caymans.The film's happy ending came about because Tom Hanks, \"just can't deal with this 9/11 thing,\"[clarification needed] according to Melissa Roddy, a Los Angeles film maker with inside information from the production.[12] Citing the original screenplay, which was very different from the final product, in Reel Power: Hollywood Cinema and American Supremacy Matthew Alford wrote that the film gave up \"the chance to produce what at least had the potential to be the Dr. Strangelove of our generation\".[13]","Home release":"The film was released on DVD April 22, 2008; a DVD version and a HD DVD/DVD combo version are available. The extras include a making of featurette and a \"Who is Charlie Wilson?\" featurette, which profiles the real Charlie Wilson and features interviews with him and with Tom Hanks, Joanne Herring, Aaron Sorkin, and Mike Nichols. The HD DVD/DVD combo version also includes additional exclusive content.[18]","cinematography":"Stephen Goldblatt","production_company":"Relativity Media Participant Productions Playtone","directed_by":"Mike Nichols","release_dates":"December 21, 2007 (2007-12-21)|||||","produced_by":"Tom Hanks Gary Goetzman","starring":"Tom Hanks Julia Roberts Philip Seymour Hoffman Amy Adams Ned Beatty Emily Blunt Om Puri Ken Stott John Slattery Denis O'Hare Jud Tylor","running_time":"100 minutes","Aftermath":"The film depicts the concern expressed by Charlie and Gust that Afghanistan was being neglected in the 1990s, following the Soviet withdrawal. In one of the film's final scenes, Gust dampens Charlie's enthusiasm over the Soviet withdrawal from Afghanistan, saying \"I'm about to give you an NIE (National Intelligence Estimate) that shows the crazies are rolling into Kandahar.\"George Crile III, author of the book on which the film is based, wrote that the mujahideen's victory in Afghanistan ultimately opened a power vacuum for bin Laden: \"By the end of 1993, in Afghanistan itself there were no roads, no schools, just a destroyed country—and the United States was washing its hands of any responsibility. It was in this vacuum that the Taliban and Osama bin Laden would emerge as the dominant players. It is ironic that a man who had almost nothing to do with the victory over the Red Army, Osama bin Laden, would come to personify the power of the jihad.\"[14]In 2008, Canadian journalist and politician Arthur Kent sued the makers of the film, claiming that they had used material he produced in the 1980s without obtaining the proper authorization.[15] On September 19, 2008, Kent announced that he had reached a settlement with the film's producers and distributors, and that he was \"very pleased\" with the terms of the settlement, which remain confidential.[16]","music_by":"James Newton Howard","edited_by":"John Bloom Antonia Van Drimmelen","budget":"$75 million"}