{"country":"United States","distributed_by":"Analysis Film Releasing Corporation","Plot":"Duane Bradley arrives in New York City with a locked basket. After he gets a room at a cheap hotel, the contents of the basket are finally revealed: in it lives his deformed Siamese twin brother, Belial. Although conjoined at birth, the twins were surgically separated at an early age against their will, and Belial deeply resents being cut off from his normal-looking brother. As the twins seek revenge against the doctors responsible for their separation, Duane befriends a nurse, Sharon. Jealous, Belial attacks and kills her when he becomes frustrated with his inability to rape her. Enraged at his brother for his actions, Duane attempts to kill Belial, which results in the two brothers falling from a hotel window.","language":"English","Reception":"Rotten Tomatoes reports that 75% of 20 surveyed critics gave the film a positive review; the average rating is 6.2/10.[11] Variety called it \"an ultra-cheap monster film\" with fine acting but criticized the blowup from 16 mm.[12] David Harley of Bloody Disgusting rated it 3.5/5 stars and wrote that \"it's exactly the kind of movie it sets out to be.\"[13] Heather Wixson of Dread Central rated it 3.5/5 stars and called it an \"insane masterpiece that lovingly celebrates the sometimes schlocky and sleazy side of cinema\".[14] G. Noel Gross of DVD Talk rated it 5/5 stars and called it \"an undeniable, unavoidable and unforgettable clasSICK\".[15] Patrick Naugle of DVD Verdict wrote, \"The movie is just pure shock value\" but \"a heck of a lot of fun.\"[16] John Kenneth Muir wrote that it is \"a fine, competent low-budget effort that generates thrills and discomfort not only from its tale of symbiotic (and separated) Siamese twins, but from its authentic sense of place. New York City has never felt more delightfully and dangerously squalid.\" Muir goes on to call it \"oddly compelling, deeply disturbing and inexplicably touching\".[17]Rex Reed's quotation (\"This is the sickest movie ever made!\") used in promotion was not from any printed review. Reed had sought out the film after hearing negative reviews and was asked his opinion after emerging from the cinema. Unknown to Reed, the person who asked him was director Frank Henenlotter. Initially furious that his comment was used to promote the film, Reed eventually relented and granted permission.[18]","directed_by":"Frank Henenlotter","release_dates":"April 1982 (1982-04)|||||","Production":"Basket Case was shot on 16 mm film. Director Henenlotter did not have control over the post-production, and the result was dark, murky, and converted to a different aspect ratio. The film was shot in part on Manhattan's 42nd Street.[3] Henenlotter wrote the film as he walked around Times Square, which he called a \"seedy, wonderful atmosphere.\"[4]The special effects for Belial consist largely of a puppet in some scenes and stop motion in others. When Belial's hand is seen attacking his victims, it is really a glove worn by Henenlotter. The full size Belial puppet is also seen in the scenes where Belial is seen with an actor or where his eyes glow red. The Belial rampage sequence used stop motion animation.[5]","produced_by":"Edgar Ievins","starring":"Kevin Van Hentenryck Terri Susan Smith Beverly Bonner","running_time":"91 minutes","music_by":"Gus Russo","Release":"Basket Case was released theatrically in the United States by Analysis Film Releasing Corporation beginning in April 1982. It played as a midnight movie for several years after this.[6]The film was first released on DVD in the United States by Image Entertainment in 1998.[7] This version is currently out of print. The film was re-released on special edition DVD by Something Weird Video in 2001.[8] It was released on Blu-ray September 27, 2011.[9] Henenlotter supervised the Blu-ray release himself and fixed many of the issues he had with previous releases. This release was based directly on the original prints, which had initially been thought lost.[3][10]","written_by":"Frank Henenlotter","budget":"$35,000[1]"}