{"directed_by":"Ondřej Trojan","country":"Czech Republic Slovakia","distributed_by":"Sony Pictures Classics USA, Falcon Czech Republic","release_dates":"September 4, 2003","Plot":"In 1940s Czechoslovakia, Eliška is a nurse who works alongside her lover, Richard, a respected surgeon. Due to the rising pressure of the Nazis, an underground network has formed to help those in danger of persecution. Richard is one of several doctors taking part in the resistance while Eliška acts as a messenger between contacts.One night, Richard responds to an emergency call involving a patient in need of a risky operation. Because she has the same blood type, Eliška takes part in the transfusion. Days later, she arrives at Richard's apartment to find their friend, Slávek, waiting with disturbing news. The Gestapo have apprehended two of their members putting everyone at risk for discovery. Stunned, Eliška receives word that Richard has emigrated, but has left papers for her to assume a new identity. Slávek tells her that she must leave the city with a man named Joza - the patient who received the transfusion. Seeing no alternative, Eliška - now Hana - leaves for the countryside and is reasonably troubled about her fate.A mountain-dweller, Joza appears uncouth and disheveled, but is kind and considerate to her plight. He provides her with a temporary sojourn in a small village where she quickly becomes an object of curiosity. Some, such as Teacher Tkáč, the schoolmaster, are xenophobic and suspicious. The Nazis have killed anyone harboring an enemy to their cause and Eliška learns that staying as an asylum-seeker is a danger to them all. She attempts to leave, but the village doctor reveals that the Nazis executed Slávek. He tells her that to remain safe, she must marry Joza and live with him in the mountain village of Želary.Initially, Eliška is passive to the idea. Joza takes her to their new home, a small cottage with no electricity, dirt floors and a fly-infested outhouse. On the day of their wedding, Eliška rebels, but relents upon Joza's explanation that the villagers will not accept a strange, single woman into the fold. Realizing that she must blend in, Eliška agrees and the two are married. At the wedding, she meets most of Želary's inhabitants some of whom have their own stories. Helenka is a young girl who lives near Joza and Eliška with her mother, Žeňa. Her best friend is Lipka, a boy whom the villagers cast as a hoodlum, but who is actually homeless due to his step-father, Michal's, dislike of him. He survives through the goodwill of Žeňa, Lucka, the village midwife, and Old Goreik, an elderly gentleman who lives with his daughter-in-law, Marie, a victim of spousal abuse.At first, Eliška seems ill-suited to a country life. She finds the villagers' behavior in times of festivities to be raucous and crude and is particularly repulsed by Michal, the town drunk, who makes unwanted advances. As time passes, however, Joza's patience and Žeňa's gentle guidance help her to assimilate. Despite this, Eliška remains wary of her husband, until one evening when she breaks their only lamp and fears a beating. On the contrary, Joza is comforting and gives her a gift: a stack of books that she may like. One day, he takes her to his mother's grave and Eliška is moved by the love and kindness he feels for those closest to him. Equally touched by her small shows of affection, Joza falls in love with Eliška and she with him, an event that leads to the consummation of their marriage.Years pass and Eliška - called Hanula by the villagers and Hanulka by Joza - bears witness to a number of incidents. The Nazis, though scarce in Želary, make their presence known by killing an entire family for harboring partisans and then murdering an innocent man in front of everyone. Eliška fears that the Gestapo will find her and receives a brutal reminder of her outsider-status when Michal attempts to rape her at the saw mill. Helenka witnesses the attack and alerts Joza, who beats Michal and breaks his arm, rendering him an invalid. As a result, his parents, the Kutinas, force Michal's pregnant wife and Lipka's mother, Aninka, to do all the hard labor which leads to a miscarriage. Lipka comes to the rescue by alerting Eliška, Lucka, and Žeňa, but it is too late. Aninka's death destroys Michal's reputation for good and redeems Lipka in the eyes of the villagers.Later on, in the spring of 1945, Eliška is a nurse again and learns the art of herbal healing from Lucka. The old woman divulges that Marie and her father-in-law, Old Goreik, are expecting a child, circumstances that have ramifications for everyone. Following the birth, soldiers from the Red Army (who fought against the Germans) arrive with news that the war is over. After a night of celebration, Joza reminds Eliška that she is free to leave (since the marriage was between him and \"Hanulka\" and is technically invalid). To his content, Eliška responds that she wishes to stay with him always and falls asleep on the mountain in Joza's arms.Elsewhere, Young Goreik, furious over his father's relationship with his wife, arrives at Old Goreik's home with a drunken soldier whom he convinces to rape Marie. Old Goreik arrives and shoots his son as well as the would-be rapist, but dies immediately when the latter's brother arrives and shoots him. Intoxicated and desensitized from battle, the soldiers interpret the killing as the act of fascists and wreak havoc on the villagers. With the help of Lipka, many escape by traversing a swamp towards an old saw mill where Lucka and Eliška tend to the wounded. Joza races back and forth between the haven and the village and rescues several people - including Michal. Meanwhile, the soldiers kill the village priest and rape Žeňa. Vojta, a farmhand, comes to her aid and Joza goes back to the village to retrieve him. The next morning, they arrive at the saw mill and find soldiers headed in the same direction (Teacher Tkáč having convinced their commanding officer of the misunderstanding). Eliška and the villagers are relieved, but their elation is cut short when Joza collapses (Vojta having shot him earlier after mistaking him for the enemy). Devastated, Eliška kneels beside Joza's lifeless body and weeps.Several years later, Želary is virtually abandoned due to the modernization of the town below. Eliška, now with Richard, returns for a visit to the mountains and the cottage she once shared with Joza. Lucka, aged beyond words, emerges from the ruins and is shocked to see Hanula but remembers that \"nothing disappears off the mountain, there’s always tracks\". Astounded, Eliška asks if it's possible that Lucka is still alive to which Lucka responds, \"I'm none too sure. I'm none too sure at all.\" On the top of the mountain, the women laugh over Eliška having found her way home.","starring":"Anna Geislerová György Cserhalmi","running_time":"150 min.","language":"Czech Russian German English","Reception":"Website Metacritic.com gave the film 66 out of 100 based on 20 critics, which equates to generally favorable reviews.[2] At movie aggregator Rotten Tomatoes, the film gained 6.7 out of 10 with a 73% on the tomatometer from 50 reviews[3]","želary":"U.S. poster","written_by":"Květa Legátová (novel) Petr Jarchovský","Location":"The film was mostly shot on location in the Malá Fatra mountains in the Northwest region of the Slovak Republic."}