{"country":"United States","distributed_by":"TriStar Pictures","Plot":"Rocky, Colt and Tum-Tum are experiencing the pains of growing up prior to a trip to Japan planned with their grandfather Mori Shintaro, who hopes to take them to a martial arts tournament of which he was the victor 50 years ago. Only Tum-Tum seems interested in going, and even then, only out of interest in seeing sumo wrestlers due to how much food they get to eat. He tells the boys he hopes to return a dagger awarded to him at the tournament when he defeated a boy named Koga, so that it may be presented to the incumbent victor. In Japan, a man (later revealed to be Koga) breaks into a museum and steals a sword before escaping via hang glider. Meanwhile, back at Mori's house, a trio of bunglers led by Koga's nephew Glam try to break into the house to steal the dagger. The boys manage to drive them off, counting it as an ordinary robbery attempt.At a baseball game, Rocky seems too focused on a cute girl named Lisa D. Marino to pitch properly. Tum-Tum causes constant breaks due to getting snacks, and Colt's short temper causes a fight with the opposing team that grows so large that the umpire calls off the game until the next week, driving a nail into the boys' plans to travel. Grandpa leaves alone, but the boys' father Sam accidentally gives him Tum-Tum's suitcase by mistake. Once he arrives in Japan, Mori's taxi is rear-ended by Glam and his friends who steal his bag. After hearing from Mori at the hospital, the boys discover their bags had been switched and have the dagger. They arrange a trip with Mori's credit card and meet him in Japan. He instructs the boys to give it to the master of the tournament. Glam and his friends record the conversation and deliver it to Koga, who punishes them for not retrieving the dagger. At the tournament, Colt takes the place of a fallen competitor, but is promptly beaten by a girl named Miyo, wounding his pride. She helps them deliver the dagger to the Grand Master, and allows the boys to stay with her and her mother. She has a love of baseball, but is not very good. The boys offer to train her in baseball if she teaches them some of her martial arts skill.Koga attempts to trap the boys by pretending to be the Grand Master, but the boys and Miyo catch onto his scheme. They face several adversaries before they are finally captured. Meanwhile, Mori is kidnapped from the hospital by Koga's assistant after fleeing Glam and the others. Koga forces Mori to tell him the location of the Cave of Gold; an urban legend which the sword and dagger are the keys to open. Fearing the safety for his grandchildren, Mori agrees to aid Koga. Soon after, the children come up with a plan and escape Koga's compound on hang gliders, arriving at the cave shortly after the adults. Inside, Koga and Mori realize the legend is true after they encounter walls and monuments of gold within. While the two battle each other, the boys and Miyo drop in on them and Koga pulls a gun. Using Mori's lesson on focus, Colt throws a ball bearing into the muzzle of the gun, causing it to backfire and start a cave in. The group flees the cave, and Koga, now realizing the price of his greed, apologizes and leaves the group unharmed. Rocky realizes that they are a day ahead of America and that they can still make it home by the championship game.At the game, the boys overcome their flaws. Down by two in the last inning, one of the opposing team antagonists gets a hit off Rocky's pitch which is almost a home run, until a recent roster add, revealed to be Miyo, catches the ball. In the bottom of the inning, Colt focuses and hits a home run, allowing all three boys to score and win the game. The bullies face them down after the game, and he picks Miyo to assault for ruining his home run. Despite Tum-Tum's warning that \"she's just a girl\", he screams as she readies to attack him and the screen goes dark as he is beaten up soundly.","language":"English","Reception":"The movie had a mostly negative reaction.[3][4][5]The movie opened in the #3 position on opening weekend with a total of $3,556,310 USD.[6][7] By the end of its 4-week run, the movie grossed $11,798,854 domestically.","3_ninjas_kick_back":"Theatrical release poster","box_office":"$11,798,854 (Domestic)","cinematography":"Christopher Faloona","production_company":"Sheen Productions, Inc. Leeds / Ben-Ami Productions, inc.","directed_by":"Charles T. Kanganis","release_dates":"May 6, 1994 (1994-05-06)|||||","produced_by":"Martha Chang James Kang Arthur Leeds","starring":"Victor Wong Max Elliott Slade Sean Fox J. Evan Bonifant Caroline Junko King Dustin Nguyen","running_time":"93 minutes","music_by":"Richard Marvin","edited_by":"Jeffrey Reiner David Rennie","written_by":"Sang-ok Shin Mark Saltzman","budget":"$20 million"}