{"country":"Australia","distributed_by":"Umbrella Entertainment","Plot":"It is just after the end of World War I in an Australia that is beginning to question the value of continuing as an outpost of the British Empire. Jack Dickens' sister had married Alexander Voysey, but died years ago. After the death of his wife, Voysey took off for the bright lights of the city, abandoning his daughter, Sally, who has since been raised by her Uncle Jack and the sharp-tongued maid, Hannah. Jack and Sally have sacrificed all their own hopes and dreams to run the farm while Voysey has been disporting himself in the city, ostensibly making a name for himself as a literary critic and writer in London. However, the truth is that Voysey is a self-centered, self-aggrandizing, pompous windbag who has no visible means of support other than leeching off his brother-in-law's labor on the farm.Voysey's wife, Deborah, has come to regret her marriage. Voysey is both cruel and a womanizer, and so bone-idle that he can't be bothered to pick up a book that he has dropped, but expects his wife to fetch for him at his whim. He is both cruel and a womanizer. He shows his contempt for his wife by making advances to other women right in front of her. While she is much younger than he is, she is not actually young, and she feels this sharply when she considers how she has wasted her life by tying herself to this boorish self-centered pretentious lout of a husband. Both Jack and the town doctor are soon smitten by the unhappy woman. In the meantime, Sally is carrying a torch for the town doctor. As things begin to fall apart, both within the family and in the political arena (as more and more Australians are calling for separation from Britain), the true natures, characters, and hopes and dreams of the family become revealed.","language":"English","box_office":"$360,957 (Australia) $350,354 (USA)","country_life":"DVD cover for the film","cinematography":"Stephen F. Windon","directed_by":"Michael Blakemore","Home media":"Country Life was released on DVD by Umbrella Entertainment in May 2012. The DVD is compatible with all region codes and includes a behind the scenes special feature.[3]","release_dates":"October 27, 1994 (1994-10-27)|||||","Box office":"Country Life grossed $360,957 at the box office in Australia.[2]","produced_by":"Robin Dalton","starring":"Sam Neill Greta Scacchi John Hargreaves Kerry Fox Patricia Kennedy","running_time":"118 minutes","music_by":"Peter Best","edited_by":"Nicholas Beauman","written_by":"Michael Blakemore Anton Chekhov"}