{"based_on":"Being There  by Jerzy Kosiński","country":"United States","distributed_by":"United Artists","screenplay_by":"Jerzy Kosiński Uncredited: Robert C. Jones","Plot":"Chance (Peter Sellers) is a middle-aged man who lives in the townhouse of an old, wealthy man in Washington, D.C. He is simple-minded and has lived there his whole life, tending the garden. Other than gardening, his knowledge is derived entirely from what he sees on television. When his benefactor dies, Chance naively says to the estate attorney that he has no claim against the estate, and is ordered to move out. Thus he discovers the outside world for the first time.Chance wanders aimlessly. He passes by a TV shop and sees himself captured by a camera in the shop window. Entranced, he steps backward off the sidewalk and is struck by a chauffeured car owned by Ben Rand (Melvyn Douglas), an elderly business mogul. In the back seat of the car sits Rand's much younger wife, Eve (Shirley MacLaine).Eve brings Chance to their home to recover. Drinking alcohol for the first time during the car ride home, Chance coughs as he tells Eve his name. Eve mishears \"Chance, the gardener\" as \"Chauncey Gardiner\". Chauncey is wearing expensive tailored clothes from the 1920s and '30s, which his benefactor had allowed him to take from the attic, and his manners are old-fashioned and courtly. When Ben Rand meets him, he assumes from these signs that Chauncey is an upper-class, highly educated businessman. Chauncey's simple words, spoken often due to confusion or to a stating of the obvious, are repeatedly misunderstood as profound; in particular, his simplistic utterances about gardens and the weather are interpreted as allegorical statements about business and the state of the economy. Rand admires him, finding him direct and insightful.Rand is also a confidant and adviser to the President of the United States (Jack Warden), whom he introduces to \"Chauncey\". The President likewise interprets Chauncey's remarks about the \"garden\" as economic and political advice. Chance, as Chauncey Gardiner, quickly rises to national public prominence. After his appearance on a television talk show, he becomes a celebrity and soon rises to the top of Washington society. He remains very mysterious, as the Secret Service is unable to find any background information about him. Public opinion polls start to reflect just how much his \"simple brand of wisdom\" resonates with the jaded American public.Rand, who is dying of aplastic anemia, encourages Eve to become close to Chauncey. She is already attracted to him and makes a sexual advance. Chauncey has no interest in or knowledge of sex, but mimics a kissing scene from the 1968 film The Thomas Crown Affair, which happens to be on the TV at the moment. When the TV scene ends, Chauncey stops suddenly and Eve is confused. She asks what he likes, meaning sexually; he replies \"I like to watch\", meaning television. She is momentarily taken aback, but decides she is willing to masturbate for his voyeuristic pleasure. As she becomes involved in the act, she does not notice that he has turned back to the TV and is watching it, not her.Chauncey is present at Rand's passing, after which he talks briefly with Rand's physician, Dr. Allenby. During their conversation, Allenby realizes the truth – that Chauncey is merely a simpleminded gardener who knows nothing of finance or politics - but does not appear bothered by it. At Rand's funeral, while the President delivers a speech, the pall-bearers hold a whispered discussion over potential replacements for the President in the next term of office. As Rand's coffin is about to be interred in the family mausoleum, they unanimously agree on \"Chauncey Gardiner\".Oblivious to all this, Chauncey wanders through Rand's wintry estate. He straightens out a pine sapling and then walks off across the surface of a small lake. He pauses, dips his umbrella into the deep water under his feet as if testing its depth, turns, and then continues to walk on the water as the President quotes Rand: \"Life is a state of mind.\"","In popular culture":"The Wolfgang Press sampled the final line of the film on the original release version of their song \"Mother Valentine\" from their 1991 album Queer.The 1996 album Being There by the American alternative rock band Wilco was named after the film.[23]","language":"English","Reception":"The film opened to positive reviews and helped revitalize Sellers' comic career; many of his recent films had flopped except for the Pink Panther movies. Film critic Roger Ebert mentions the final scene in his 2005 book The Great Movies II (p. 52),[16] stating that his film students once suggested that Chance may be walking on a submerged pier. Ebert writes, \"The movie presents us with an image, and while you may discuss the meaning of the image, it is not permitted to devise explanations for it. Since Ashby does not show a pier, there is no pier — a movie is exactly what it shows us, and nothing more.\"[17]Sellers won the Golden Globe Award for Best Actor in a Motion Picture – Musical or Comedy for his performance in Being There. He was nominated for the Academy Award for Best Actor as well at the 52nd Academy Awards, but he lost to Dustin Hoffman for Kramer vs. Kramer.Melvyn Douglas won his second Academy Award for Best Supporting Actor and Golden Globe Award for Best Supporting Actor – Motion Picture.[18][19]The credits at the film's end roll over an outtake, known as the \"Rafael outtake\". Sellers was later displeased that the outtake ran because he believed it took away from Chauncey's mystique.[20] He also believed the outtake was what prevented him from winning the Oscar.[6][21]The film is ranked number 26 on the AFI's 100 Years...100 Laughs list, a list released in 2000 by the American Film Institute of the top 100 funniest films in American cinema.[22]","box_office":"$30,177,511[2]","being_there":"Theatrical release poster","cinematography":"Caleb Deschanel","production_company":"Lorimar Film Entertainment","directed_by":"Hal Ashby","Home media":"A 30th anniversary edition was released on DVD and Blu-ray on February 2009.[6]","Music":"Incidental music is used very sparingly. What little original music is used was composed by Johnny Mandel, and primarily features two recurrent piano themes based on \"Gnossiennes\" No. 4 and No. 6 by Erik Satie. The other major piece of music used is the Eumir Deodato jazz/funk arrangement of the opening fanfare from Also Sprach Zarathustra by Richard Strauss.[10]Mandel was also assisted by his late cousin and fellow composer Miles Goodman with the orchestration of the film.[11][12][13][14][15]","release_dates":"December 19, 1979 (1979-12-19)|||||","Filming":"Principal filming occurred at the Biltmore Estate, the largest private home in America, located in Asheville, North Carolina.[5]Melvyn Douglas's granddaughter, Illeana, had a chance to visit the set and got to meet Peter Sellers, whom she considers to be her favorite actor. She has since credited the film for inspiring her to pursue a career in acting. According to Illeana, Sellers and Douglas had known each other since the 1940s when they first met in Burma during World War II. They often reminisced about the war days while on the set.[6]The masturbation scene was the reason Laurence Olivier turned down the role of Ben Rand.[7][8]According to MacLaine, \"(Peter) believed he was Chauncey. He never had lunch with me... He was Chauncey Gardiner the whole shoot, but believing he was having a love affair with me.\"[9]","produced_by":"Andrew Braunsberg","starring":"Peter Sellers Shirley MacLaine Melvyn Douglas Richard Dysart Jack Warden Richard Basehart","running_time":"130 minutes","music_by":"Johnny Mandel","edited_by":"Don Zimmerman","budget":"$7 million[1]"}