{"country":"United States","distributed_by":"Relativity Media[1]","Plot":"Jon Martello is a modern-day Don Juan, with a short list of things he cares about: \"my body, my pad, my ride, my family, my church, my boys, my girls, my porn\". Though he has a very active sex life, he is more sexually satisfied by viewing pornography and masturbating, which enables him to \"lose himself\".On a night out with his two best friends, Bobby and Danny, Jon sees Barbara Sugarman. Although she finds him interesting, she declines his offer for a one-night stand. He tracks her down on Facebook and invites her to lunch. There is mutual attraction, but Barbara insists on a long-term courtship, which proceeds for over a month without sex. She encourages Jon to take night classes to get an office job outside the service industry, and Jon indulges her love for romance movies, which he usually dismisses as unrealistic fantasy. They meet each other's families and Jon's parents love her.The two have sex, but Jon is still dissatisfied. He loves Barbara and considers her body perfect, but still finds pornography more satisfying. While Barbara sleeps, Jon watches pornography. Barbara catches him and is shocked. She prepares to leave Jon, but he denies that he watches pornography and claims it was a joke emailed to him by a friend.Their relationship resumes, with Jon watching pornography primarily outside his apartment, concealing his habit from Barbara. He is caught watching a video on his cell phone before a class by Esther, a middle-aged woman Jon earlier encountered weeping by herself at the college. Jon politely brushes her off. Barbara continues asserting control over him, insisting that cleaning his own apartment, a task Jon finds satisfying, is not something she is comfortable with him doing. Barbara later checks the browser history on Jon's computer, confronts him with proof that he has continued viewing pornography, and ends their relationship.Jon tries to return to his old lifestyle. Esther continues reaching out to Jon, offering him the benefit of her experience. She lends him an erotic video that she believes has a more realistic depiction of sexual relations. He responds by initiating a sexual encounter in her parked car. She persuades Jon to try masturbating without pornography, but he is unable to. She invites him to her home where she reveals that the reason he is more satisfied with watching pornography than with having sex is that pornography is a one-sided affair. If Jon wants to lose himself, he has to be willing to lose himself to another person and they have to be willing to lose themselves to him. Esther counsels Jon about the need for sex to be a mutual experience, and reveals that her husband and son died in a car accident fourteen months previously. With her, Jon forms an emotional sexual connection that does not leave him restless to watch pornography.Jon tells his family about the break-up with Barbara: while they are displeased, his sister Monica states that Barbara never cared about Jon and was just dating him because she knew she could manipulate him to her will. Jon later meets with Barbara and apologizes for lying to her about the pornography. Barbara says she asked one thing of him and he failed. Jon replies she asked many things of him and he could not meet her expectations. She tells him to never contact her again, as he sees how shallow she is and realizes he is better off without her.Jon begins dating Esther. Even though neither has any interest in getting married and Jon denies he is in love, he believes he really understands Esther and that they can get emotionally lost in each other.","language":"English","Reception":"Don Jon received positive reviews from critics, with most giving praise to the lead performances, especially Gordon-Levitt's. Rotten Tomatoes gives the film an 81% approval rating, based on reviews from 182 critics, with a rating average of 6.8 out of 10. The site's consensus states: \"Don Jon proves to be an amiable directing debut for Joseph Gordon-Levitt, and a vivacious showcase for his co-star, Scarlett Johansson\".[10] Metacritic gives a score of 66 out of 100 based on reviews from 41 critics, indicating \"generally favorable\" reviews.[11] Audiences surveyed by CinemaScore on the opening weekend, gave Don Jon a C+ grade.[12][13]Don Jon received very positive reviews at the Sundance Film Festival. Entertainment Weekly managing editor Jess Cagle called the film \"one of the best movies I saw at the fest\" and wrote, \"Funny, touching, smart, and supremely confident, Don Jon is also Gordon-Levitt's feature directorial debut, and it establishes him as one of Hollywood's most exciting new directors.\"[14] William Goss of Film.com praises Levitt for his \"assured style\" as both director and screenwriter.[15] Edward Douglas of ComingSoon.net gave high praise to the screenplay.[16] Consensus of the film when it was played at the Sundance Film Festival, as noted by Odie Henderson, was that Don Jon was a \"more fun version\" of the 2011 film Shame.[17]The supporting actresses Scarlett Johansson and Julianne Moore received praise for their performances.[18][19] Stephanie Zacharek of The Village Voice praised the film, writing: \"There's no dancing in Gordon-Levitt's writing-directing debut, Don Jon, although the movie is so heavily reminiscent—in the good way—of Saturday Night Fever that an arm-swinging paint-can reverie wouldn't be out of place.\"[20]Don Jon grossed $24.5 million in North America and $16.5 million internationally, for a total worldwide gross of $41 million.[4]","box_office":"$41.3 million[4]","cinematography":"Thomas Kloss","production_company":"Voltage Pictures HitRecord Films Ram Bergman Productions","directed_by":"Joseph Gordon-Levitt","Home media":"Don Jon was released on DVD and Blu-ray on December 31, 2013 (New Year's Eve).[22] By June 2014, over two million copies of the Blu-ray were sold.[citation needed]","release_dates":"January 18, 2013 (2013-01-18) (Sundance)|September 27, 2013 (2013-09-27) (United States)||||","Production":"Development for Don Jon began in 2008, when Gordon-Levitt wrote early notes about the film. Rian Johnson gave feedback during the writing process and reviewed several cuts of the film. Christopher Nolan cautioned against both directing and starring in the film due to the extra challenges it would bring.[7]Gordon-Levitt has credited his experience directing short films for HitRecord for teaching him what he needed to know to make Don Jon and has said that he hopes to make films in a more collaborative way in the future.[8]Principal photography for Don Jon began in May 2012.In the United States, the film was originally certified NC-17, due to some explicit porn that Jon watches. Gordon-Levitt decided to remove some of the more graphic scenes to qualify for an \"R\" rating, because he felt the original rating would cause people to think the movie was about porn.[9]","produced_by":"Ram Bergman","starring":"Joseph Gordon-Levitt|Scarlett Johansson|Julianne Moore|Rob Brown|Glenne Headly|Brie Larson|Tony Danza|","running_time":"90 minutes[2]","music_by":"Nathan Johnson","don_jon":"Theatrical release poster","edited_by":"Lauren Zuckerman","written_by":"Joseph Gordon-Levitt","budget":"$3–5.5 million[3][4]"}