{"based_on":"Before Night Falls  by Reynaldo Arenas","country":"United States","distributed_by":"Fine Line Features","screenplay_by":"Cunningham O'Keefe Lázaro Gómez Carriles Julian Schnabel","Plot":"Before Night Falls is based on the autobiography of the same name by Cuban poet and novelist Reinaldo Arenas. In the film, Arenas, who was openly gay, is born in Oriente in 1943 and raised by his single mother and her parents, who soon move the entire family to Holguín. After moving to Havana in the sixties to continue his studies, Reinaldo begins to explore his ambitions, as well as his sexuality. After receiving an honorary mention in a writing contest, Arenas is offered the chance to publish his first work. Through his work and friendships with other openly gay men (such as Pepe Malas and Tomas Diego), Arenas manages to find himself.The political climate in Cuba becomes increasingly dangerous, and in the early seventies Arenas is arrested for allegedly sexually assaulting minors, and for publishing abroad without official consent. In the next decade, Arenas is in and out of prison, attempting and failing to leave the country several times.In 1980, Arenas finally leaves Cuba for the US, starting a new life with his close friend Lazaro Gomez Carriles. A few years later, Arenas is diagnosed with AIDS, and after spending several years suffering he dies in 1990 with the help of Lazaro.","language":"English Spanish Russian French","box_office":"$8,527,517","cinematography":"Xavier Pérez Grobet Guillermo Rosas","production_company":"El Mar Pictures Grandview Pictures","before_night_falls":"Theatrical release poster","directed_by":"Julian Schnabel","release_dates":"September 3, 2000 (2000-09-03) (Venice Film Festival)|January 26, 2001 (2001-01-26) (United States)||||","Production":"Julian Schnabel got the idea of making Before Night Falls immediately after making Basquiat, however it took four years to actually produce the film.[3]Bardem spent one-and-a-half months in New York with Arenas's best friend, Lazaro Gomez Carriles, taking two hours a day to study how Arenas walked and talked.[4]","produced_by":"Jon Kilik","starring":"Javier Bardem Olivier Martinez Johnny Depp Héctor Babenco","running_time":"133 minutes","music_by":"Carter Burwell","edited_by":"Michael Berenbaum"}