{"country":"United Kingdom","distributed_by":"StudioCanal","cuban_fury":"UK theatrical release poster","Plot":"Former teen salsa champion Bruce Garrett is now an engineer. Bruce gave up dancing after he was brutally bullied by older boys. When he finds out that his new boss, Julia, is passionate about salsa dancing, he decides that the only way he can win her over is by re-mastering the art of dance. He seeks out his old teacher Ron, who forces him to confront the reasons he quit dancing in the first place. He struggles with low self-esteem, as well as a bullying coworker and rival, Drew, who constantly dominates Julia's attention, a romantic interest for Bruce but sexually for Drew. With the help of his salsa classmates, teacher, and his former dancing partner, his sister Sam, Bruce gets up the courage to relearn all his 'rusty' dance steps and to recapture his lost \"corazón\" (heart), not only for the dance but for his life. When ready, his friends convince him to enter the local nightclub's salsa dance competition, with the idea that he'll invite Julia to be his dance partner. But when he goes round to hers to ask her out to the dance, he is tricked into believing that he's interrupting an intimate evening she's spending with Drew, so leaves before asking, disillusioned. Julia, meanwhile, discovers what Drew is up to and outright rejects his advances, then kicks him out whilst threatening his position at work. Julia follows Bruce to the nightclub, where he's been doing quite well with Sam and an old routine, and is about to enter the final heat/round of the competition. When he notices Julia had followed him to the club, he's elated and finally plucks up the courage to ask her to dance. They dance the last round of the competition, where Bruce goes on to lose the competition, but regains his true self and finally wins Julia's heart.","language":"English|Persian|Spanish|","box_office":"$5.6 million[3]","cinematography":"Dick Pope","production_company":"Big Talk Productions British Film Institute Film4","directed_by":"James Griffiths","Soundtrack":"Decca Records released the Cuban Fury soundtrack on February 17, 2014.","release_dates":"14 February 2014 (2014-02-14)|||||","produced_by":"James Biddle|Nira Park|","starring":"Nick Frost|Rashida Jones|Chris O'Dowd|Ian McShane|","running_time":"98 minutes[1]","music_by":"Daniel Pemberton","edited_by":"Jonathan Amos","Release":"The film received mixed reviews from critics. On review aggregator website Rotten Tomatoes, it has a 51% score based on 85 reviews, with an average rating of 5.4/10. The site's consensus states: \"Nick Frost and Chris O'Dowd remain as undeniably likable as ever, but Cuban Fury saddles them with a contrived and predictable plot that's far too short on laughs.\"[5] Metacritic reports a 52 out of 100 rating based on 21 critics, indicating \"mixed or average reviews\".[6]","written_by":"Jon Brown","budget":"£1 million[2]"}