{"country":"United States","distributed_by":"Warner Bros. Pictures Summit Entertainment","Plot":"Four years after saving Winter, a CMA dolphin who lost her tail, a now 15-year-old Sawyer gets a chance at a scholarship to attend an elite SEA Semester program which involves three months at sea to do marine mammal research after impressing the council with a show where Bethany Hamilton comes and swims with Winter.Later, Sawyer doesn't want to go because he is concerned about leaving Winter. Winter needs attention and shows signs of stress and loneliness, especially after her older dolphin friend, Panama, dies. George Hatton, a USDA inspector, requires that, for health reasons, Winter must be matched with a new female companion within thirty days or be transferred elsewhere. However, Winter's behavior has become unpredictable, even dangerous: when Sawyer tries to get her out of the tank to prepare to make her a new prosthetic tail, she becomes aggressive and knocks him into the water before Phoebe jumps into the pool and rescues him. Dr. Clay prohibits Sawyer from swimming with Winter until further notice. Winter spends weeks in isolation, and despite people being forbidden to visit her, Sawyer allows Susie, a new volunteer, and her veteran grandfather to see her, causing Clay's daughter Hazel to be slightly jealous, because she has feelings for him.Prior to these events, CMA rescues a severely sunburned and beached dolphin, named Mandy after a little girl who finds her, which Sawyer, Clay, and Hazel hope to be Winter's companion. CMA begins to rehabilitate Mandy, contemplating releasing her soon. Hazel becomes greatly unhappy with her father for treating her like a child and acting as though Winter doesn't really matter anymore, but after consulting Sawyer's mother, Lorraine, and looking at Mandy's medical files, she understands that what's best for Mandy is just as important as what's best for Winter. Clay, Sawyer and Hazel give Mandy three live fish, which she catches and eats effortlessly, so they decide to release her, with Hazel assertively taking charge. Mandy receives a goodbye \"ceremony\" while she swims out to sea.Hazel and Sawyer break the rule and swim with Winter, who seems improved and is no longer aggressive. Dr. Clay catches them and scolds them, but then states that it does not matter, because George issued a transfer order and Winter is to be transferred to a marine park in Texas since CMA has no companion for her. Meanwhile, Sawyer wins the coveted scholarship to attend SEA Semester so his mother and friends throw him a party, which cheers him up a little bit, but he still can't decide whether to go because he is too upset. Dr. McCarthy shows him an old watch which must be tapped to keep ticking. Using this as an example, he encourages Sawyer to \"shake it up now and then\" and try new things in life.During the party, Dr. Clay is informed that another female dolphin has been rescued. This one is so young that she has not yet learned how to hunt, so she cannot return to the wild. Thus she represents another hope of companionship for Winter. They name her \"Hope.\" In addition, Sawyer and Hazel, with Rufus's help, find and rescue a sea turtle from some fishing line. Rufus becomes obsessed with the sea turtle, named Mavis, following her everywhere, even watching her during a CT Scan at the hospital where Lorraine works. As Sawyer, Hazel, and the CMA staff release Mavis, Rufus follows her out to sea.George gives Clay an extension to keep Winter from being transferred, and CMA tries to introduce Hope as her new companion. But Hope panics and circles the pool at high speed, causing Winter to go into a dangerous panic as well. The staff quickly separates the two dolphins. To see what went wrong, the CMA staff analyzes the video recording. They realize that Hope didn't know what to make of Winter because her echolocation sensed Winter had no tail and moved differently from other dolphins. Sawyer thinks a new prosthetic tail could have better results, but some think it could make Hope panic even more. After debate, everyone finally agrees to try it.In her second meeting with Hope, Winter wears the new prosthetic tail, designed by Dr. McCarthy. A huge crowd of people is present, Mandy and her family, Bethany Hamilton, Phil Hordern (the real estate developer from the first movie), and George are among them. Again things get a bit rough, but eventually the two dolphins accept each other. Everyone rejoices that Winter can stay at CMA now that she has a companion. With his uncertainty about Winter resolved, Sawyer decides to go to the SEA Semester program, but he reassures her that he'll be back. Hazel says goodbye to him by releasing helium balloons and holding up a sign, and Sawyer sends her a text message saying \"You're the best\", causing her to blush as she smiles to herself as Rufus returns to the aquarium.Real-life footage shown at the end includes Mandy's release, Hope's rescue, a sea turtle named Mavis and her release, Winter wearing the new prosthetic tail, and amputees interacting with Winter.","language":"English","Reception":"Dolphin Tale 2 received generally positive reviews from critics. On Rotten Tomatoes, the film has a rating of 67%, based on 79 reviews, with an average rating of 5.9/10; the consensus states: \"Much like its predecessor, Dolphin Tale 2 offers animal antics and sweet, old-fashioned drama that the whole family can enjoy.\"[9] On Metacritic, the film has a rating of 58 out of 100, based on 27 critics, indicating \"mixed or average reviews\".[10]Dolphin Tale 2 was released on Blu-ray, DVD and Digital media on December 9, 2014.","box_office":"$57.8 million[3]","cinematography":"Daryn Okada","production_company":"Alcon Entertainment Color Force Boxing Cat Films","directed_by":"Charles Martin Smith","release_dates":"September 12, 2014 (2014-09-12)|||||","Production":"Filming began on October 7, 2013, at Clearwater Marine Aquarium in Clearwater, Florida.[5][6]Although they were filming on the site, Clearwater Marine Aquarium is open on weekends to the public. Cozi Zuehlsdorff tweeted on her Twitter account that she is excited that Bethany Hamilton has joined the \"Dolphin Tale 2 family\".According to Clearwater Marine Aquarium CEO, David Yates, filming ended on January 22, 2014. It was released on September 12, 2014.[citation needed]The film's first teaser trailer was released on April 11, 2014, attached with theatrical screenings of Rio 2.[7] A second trailer was released on June 13, attached with How to Train Your Dragon 2.[8]","produced_by":"Robert Engelman Broderick Johnson Andrew A. Kosove","starring":"Nathan Gamble Harry Connick, Jr. Ashley Judd Kris Kristofferson Cozi Zuehlsdorff Morgan Freeman","running_time":"107 minutes[2]","Sequel":"At a press conference speaking about the possibilities for a new Clearwater Marine Aquarium, David Yates, the CEO of Clearwater Marine Aquarium revealed that discussions have begun towards the development of a third Dolphin Tale movie and a television series.[11] A web series titled Rescue Clearwater premiere on February 1, 2016 on You Tube.","dolphin_tale_2":"Theatrical release poster","music_by":"Rachel Portman[1]","edited_by":"Harvey Rosenstock","written_by":"Charles Martin Smith","budget":"$36 million[3]"}