{"country":"United States","distributed_by":"October Films","cookie's_fortune":"Promotional film poster for the film","Plot":"When a small Mississippi town's wealthy dowager Jewel-Mae \"Cookie\" Orcutt (Neal) tires of her widowed life, she decides to take one of her late-husband Buck's pistols from the gun cabinet and kill herself.She is discovered by her pretentious playwright niece, Camille (Close), and Camille's eccentrically odd and adorably shy younger sister, Cora (Moore), who plot to set the suicide up as a murder to preserve the family's reputation and ensconce themselves in the family mansion. The family of eccentrics is rounded out by Cora's wayward outlaw of a daughter, Emma (Liv Tyler). Emma has a love interest in the inept Sheriff's deputy, Jason (O'Donnell).The key suspect is Willis (Dutton), Cookie's handyman, who happens to have cleaned the guns the night before Cookie's death.What follows is a tale of how a shocking incident casts a ripple among a group of small-town oddballs.","language":"English","Reception":"The film received mostly positive reviews, with a fresh 86% on Rotten Tomatoes.[2]","box_office":"$10.9 million","cinematography":"Toyomichi Kurita","production_company":"New Films International","directed_by":"Robert Altman","Soundtrack":"Music for the film is composed by David A. Stewart. The soundtrack album was released on April 2, 1999.[3] It features appearances by saxophonist Candy Dulfer.All songs composed by Stewart, except \"Cookie\", \"Camilla's Prayer\" and \"Patrol Car Blues\" composed by Dulfer and Stewart.[4]","release_dates":"January 22, 1999 (1999-01-22) (Sundance Film Festival)|April 2, 1999 (1999-04-02) (United States)||||","Production":"The screenplay was written by Anne Rapp and the film was produced by Willi Baer.The film was shot on location in Holly Springs.","produced_by":"Willi Baer","starring":"Glenn Close Julianne Moore Liv Tyler Chris O'Donnell Charles S. Dutton Patricia Neal","running_time":"118 minutes","music_by":"David A. Stewart","edited_by":"Abraham Lim","written_by":"Anne Rapp","budget":"$10 million"}