{"country":"Denmark","Plot":"Bess McNeill is a pretty young Scottish woman with a history of psychological problems. She marries atheist oil rig worker Jan Nyman, despite disapproval from her community and her Free Scottish Presbyterian Calvinist church. Bess is steadfast and pure of heart, but extremely simple and childlike in her beliefs. During her frequent visits to the church, she prays to God and carries on conversations with Him using her own voice, believing that He is responding directly through her.Bess has difficulty living without Jan when he is away on the oil platform. Jan makes occasional phone calls to Bess in which they express their love and sexual desires. Bess grows needy and prays for his immediate return. The next day, Jan is severely injured in an industrial accident and is flown back to the mainland. Bess believes her prayer was the reason the accident occurred, that God was punishing her for her selfishness in asking for him to neglect his job and come back to her. No longer able to perform sexually and mentally affected by the paralysis, Jan asks Bess to find a lover. Bess is devastated and storms out. Jan then attempts to commit suicide and fails. He falls unconscious and is readmitted to hospital.Jan's condition deteriorates. He urges Bess to find another lover and tell him the details, as it will be as if they are together and will revitalize his spirits. Though her sister-in-law Dodo constantly reassures her that nothing she does will affect his recovery, Bess begins to believe these suggestions are the will of God and in accordance with loving Jan wholly. Despite her repulsion and inner turmoil to be with other men, she perseveres in her own sexual debasement as she believes it will cure her husband. Bess throws herself at Jan's doctor, but when he rebuffs her, she takes to picking up men off the street and allowing herself to be brutalized in increasingly cruel sexual encounters. The entire village is scandalized by these doings, and Bess is excommunicated. In the face of being cast out from her church, she proclaims, \"You cannot love words. You cannot be in love with the Word. You can only love a human being.\"Dodo and Jan's doctor agree the only way to keep Bess safe from herself is to have her committed, and as far away from her husband as possible. It is then that Bess decides to make what she thinks is the ultimate sacrifice for Jan: she unflinchingly goes out to a derelict ship full of barbarous sailors, who rape and murder her. The church refuses to give a funeral for her and damns her soul to hell. Jan is later shown burying her in the ocean, in deep grief but fully restored to health. The film ends as church bells ring in the sky.","language":"English","Reception":"During a show where film personalities listed their top movies of the 1990s, Breaking the Waves was named one of the ten best films of the decade by both critic Roger Ebert and director Martin Scorsese.[8]Released on November 13, 1996, the film has grossed just over $4 million in the US.[9]Breaking the Waves won the Grand Prix at the 1996 Cannes Film Festival,[10] the César Award for Best Foreign Film, and three awards at the 1996 European Film Awards, including Film of the Year, International Film Journalists Award, and European Actress of the Year (Watson). Emily Watson was also nominated for the 1996 Academy Award for Best Actress, the 1996 British Academy of Film and Television Arts award and the National Society of Film Critics prize.","box_office":"$3.8 million (USA)[3]","cinematography":"Robby Müller","directed_by":"Lars von Trier","breaking_the_waves":"Theatrical release poster","release_dates":"18 May 1996 (1996-05-18) (Cannes Film Festival)|5 July 1996 (1996-07-05) (Denmark)||||","Production":"Helena Bonham Carter was von Trier's first choice to play the role of Bess, but she dropped out just before shooting was to start, reportedly due to the large amount of nudity and sexuality required by the role.[5] Several other big-name actresses were considered, but none of them were comfortable with the subject matter. Von Trier was eventually won over by Emily Watson's audition, even though she was a complete unknown in the film industry at the time.The exterior scenes were shot in Scotland: the graveyard was built for the film on Isle of Skye; the church is in Lochailort, the harbour in Mallaig, and the beach in Morar.[6] The interiors were shot at Det Danske Filmstudie, Lyngby, Denmark.The helicopter used in the movie, G-BBHM, a Sikorsky S-61-N, was later involved in an emergency landing and fire that destroyed the aircraft but none of the four crew was injured. This occurred at Poole, Dorset on 15 July 2002.[7][verification needed]","produced_by":"Peter Aalbæk Jensen Vibeke Windeløv","starring":"Emily Watson Stellan Skarsgård Katrin Cartlidge Jean-Marc Barr Udo Kier","running_time":"158 minutes[1]","Style":"The film is divided into seven different chapters. Each chapter begins with a different impressionistically filmed panorama title frame featuring early 1970s rock music interludes. Each of these chapters is filmed with a motionless camera, but features movement in the panorama. In the original released film, the epilogue, “Bess' Funeral,” features David Bowie’s “Life on Mars,\" which was replaced by Elton John's \"Your Song\" on early home video releases; the more recent Criterion edition restores the Bowie song. The overall style is heavily influenced by the realist Dogme 95 movement, of which von Trier was a founding member, and its grainy images and hand-held photography give it the superficial aesthetic of a Dogme film. However, the Dogme rules demand the use of real locations, whereas many of the locations in Breaking the Waves were constructed in a studio.[citation needed] In addition, the film is set in the past and contains dubbed music, as well as a brief scene featuring CGI, none of which is permitted by the Dogme rules.The film was made using Panavision equipment. The low-res look of the scenes was obtained by transferring the film to video, and then back to film again. According to von Trier, \"what we did was take a style and lay it like a filter over the story. It’s like decoding a television signal when you pay to see a film. Here we encoded the film, and the audience has to decode it. The raw, documentary style that I imposed on the film, which actually dissolves and contradicts it, means that we can accept the story as it is.[4]","Operatic adaptation":"Composer Missy Mazzoli and librettist Royce Vavrek have been commissioned by Opera Philadelphia to adapt the work into a chamber opera.[11] The first aria, \"His Name is Jan,\" was presented at the Brooklyn Academy of Music as part of the 2013 Next Wave Festival.[12]","edited_by":"Anders Refn","written_by":"Lars von Trier Peter Asmussen","budget":"$7.5 million[2]"}