{"\"The Secret of Esrever\"":"Much like the first Blair Witch, Book of Shadows also featured a marketing gimmick, although this one centered on the film's video release, fully exploiting video technology. The DVD and VHS releases came with a featurette detailing \"The Secret of Esrever\" (\"Esrever\" is the word reverse spelled backwards), a number of near-subliminal messages in the form of hidden words and images that were placed throughout the film. The featurette encouraged viewers to watch certain scenes in reverse and/or frame-by-frame in order to decode the \"secret\", and, through scrambled letters flashed throughout the program, offered five clues to where they could be found: \"door\", \"water\", \"mirror\", \"rug\" and \"grave\".An example of these messages can be seen in a scene early in the film where the main characters are in a graveyard, standing behind a tombstone inscribed with the word \"Treacle\". The shot briefly cuts away and then cuts back, though the same tombstone now reads \"Further\". This is seen for approximately one second until it cuts away again, and the tombstone once again reads \"Treacle\" for the remainder of the scene.When all of the clues were identified, the hidden words, when put in the correct order, spelled out \"seek me no further\", plus an extra hidden word, \"or\". Viewers could then go to the official Blair Witch website and type the words into a special search box: typing \"seek me no further\" would play an extra scene from the movie, and typing \"seek me no further or\" would enable them to add their name to a list of people who had also decoded the message. As of 2008, this function is no longer available.","distributed_by":"Artisan Entertainment","Plot":"In November 1999, a group of young tourists—Stephen and his pregnant wife, Tristen, who are researching the Blair Witch for a book they are writing; Erica, a Wiccan; and Kim, a goth psychic—arrive in Burkittsville, Maryland, after seeing The Blair Witch Project. Jeff, a local man, is their tour guide and a paranormal investigator who says his equipment will capture any supernatural events that happen while they visit the Blair Witch site.They camp for the night in the ruins of Rustin Parr's house, and Jeff places cameras around to capture anything supernatural. As the group gets drunk around a campfire, another tour group arrives and claims to have jurisdiction over the ruins. Jeff and his group convince the others that they saw something horrifying at Coffin Rock earlier, and the other group leaves to investigate. Jeff and his group wake the next morning with no memory of the previous night. Tristen and Stephen's research documents are shredded and strewn about, and Jeff's cameras are destroyed. However, Jeff's tapes are found unharmed in the same spot the Blair Witch Project footage was discovered. Tristen notices that she is bleeding and has miscarried.The group goes to the Burkittsville hospital, where Tristen's miscarriage is confirmed. As she is about to be discharged, Tristen sees a ghostly young girl walking away backwards. Jeff takes the group back to his home, an abandoned broom factory against a steep hill in the woods. It has an elaborate security system, surveillance cameras, and a front door alarm. The group reviews Jeff's tapes and find hours of footage missing. Only one scene remains, which depicts a naked Erica holding onto a tree and swinging around it backward. Erica remembers no such event and runs off to pray, weeping as she does so. Each of the members of the group now begins to have hallucinations of horrible things (like eating a dead owl, murdering someone, or being locked away in an asylum). Kim goes to town to pick up food and alcohol, and has a heated argument with the convenience store cashier. The van she drives is attacked by locals as she leaves, and she crashes the vehicle after seeing ghostly children on the road. Back at Jeff's, she reaches into her shopping bag and pricks herself on a small, bloody nail file stuck among the bottles of beer she purchased.The three tourists decide to leave the next morning, but Erica mysteriously disappears and no one heard the front door \"barking dog\" alarm sound. Kim discovers Erica's clothes, surrounded by a circle of lit candles. They attempt to call Erica's father at his office, but are told by his secretary that he had no children. Jeff discovers his van is wrecked, but Kim says she only dented the fender. The county sheriff calls to say that the other tour group was found disemboweled on Coffin Rock. He demands that Jeff reveal what he knows about the crime, but Jeff denies any involvement and hangs up. Kim decides to call for help, but while looking for a telephone directory discovers dossiers on each of the tourists in Jeff's desk. Tristen (whose mental health is rapidly deteriorating) suddenly claims she can see Erica through a window, naked and swinging around a tree. Stephen runs outside to confront Erica, but the walkway connecting the building to the hill collapses under him when he does so. As he climbs to safety, Stephen sees the same girl Tristen did. The sheriff calls again and says he is at Jeff's front door. The security monitor shows the bridge is now intact. Jeff hears the sheriff shouting at the door, goes downstairs, grabs a shotgun from a closet, and opens the door. But the bridge has returned to its damaged state and the sheriff is not to be seen. Stephen, Kim, and Tristen arrive as Jeff opens the closet to put the gun away, and all three discover Erica's corpse in the closet.Tristen suggests that everything they have experienced is running backwards. They play Jeff's damaged tapes in reverse. The footage now shows Tristen leading the group in satanic worship and a drunken orgy, and their murder of the other tour group. Jeff begins taping Tristen as Stephen demands that she confess. Tristen alternately sneers at the others and asks them for help, luring them to the second floor. Stephen accuses Tristen of deliberately killing their baby. Tristen ties a rope around her own neck, threatening to kill herself. Stephen pushes her over the second-floor banister in a moment of rage, and causes her to hang herself.After a jump cut, the audience sees that Jeff, Stephen, and Kim have been arrested. Each is interrogated separately, with the police showing each person footage of their crimes. Security camera footage shows Kim stabbing the cashier in the neck with the cashier's nail file. Surveillance camera footage shows a naked Jeff killing Erica, arranging her clothes, and putting her dead body in the closet. Jeff's video shows Stephen assaulting Tristen, accusing her of being a witch and pushing her over the banister (but not Tristen putting the rope around her own neck). All three, close to a nervous breakdown, protest they never did any of those things.","language":"English","Release and reception":"Book of Shadows was released throughout the world in 2000–2002. In the United States, it debuted at number 2 with $13,000,000. After 8 weeks, it finished with $26,421,314.[4] Overall, internationally the film made $47,737,094.[5]Critical reaction to Book of Shadows: Blair Witch 2 upon release was overall negative.[6][7] As of January 2015, it holds a 13% \"Rotten\" rating on Rotten Tomatoes, based on 105 reviews.[8] Metacritic reported, based on 34 reviews, an average rating of 15 out of 100, indicating \"overwhelming dislike\".[9] Additionally, Book of Shadows was nominated for five Razzie Awards, including \"Worst Picture\" (which the original 1999 film was nominated for), and won for \"Worst Remake or Sequel\".Roger Ebert, who gave the first film four stars (out of four), gave Book of Shadows two stars, calling it \"a muddled, sometimes-atmospheric effort that could have come from many filmmakers\" and \"not a very lucid piece of filmmaking\".[10] Shawn Levy of the Portland Oregonian gave a mildly positive review, saying: \"There are moments of pleasure, humor, and [...] terror to be had here.\"[11] Luke Y. Thompson of the Dallas Observer said the film \"deserves points for creativity\" but is \"not entirely successful\".[12]Owen Gleiberman of Entertainment Weekly gave the film a C-, calling it \"a flat heebie jeebies thriller\".[13] Chris Kaltenbach of The Baltimore Sun said: \"Gets credit for avoiding the easy path. Too bad the path it chooses doesn't lead us anywhere we want to be taken.\"[14] Jack Mathews of the New York Daily News commented that \"the characters are boring, the violence generic, the suspense nonexistent\".[15] Wesley Morris of The San Francisco Examiner called the film \"throwaway megaplex fodder\".[16] David Edelstein of Slate summed up his thoughts with, \"Lordy, what a stinker.\"[17]","box_office":"$47.7 million","cinematography":"Nancy Schreiber","production_company":"Haxan Films","directed_by":"Joe Berlinger","book_of_shadows:_blair_witch_2":"Theatrical release poster","DVD and Soundtrack releases":"The DVD of Book of Shadows was released on March 2001 on the DVD+CD format. The DVD side included a few special features, including the \"Secret of Esrever\" featurette, audio commentaries by Joe Berlinger and Carter Burwell, production notes and a live video of the band Godhead.The CD side featured three cuts from the official soundtrack (Godhead's \"The Reckoning\", Tony Iommi/Dave Grohl's \"Goodbye Lament\" and Steaknife's \"Tommy (Don't Die)\"), Carter Burwell's entire instrumental score and a live recording of Godhead's \"The Reckoning\".Two soundtracks for Book of Shadows were released: the first was released through Posthuman Records on October 17, 2000. The second, released through Milan Records on October 24, 2000, consisted of Carter Burwell's instrumental score. The soundtrack was re-released in 2001 and bundled with the DVD+CD.The Shadow of the Blair Witch was a mockumentary created for the DVD's special features. It aired on the Sci Fi channel in the U.S and Channel 4 in the U.K. The mockumentary follows the story of Jeff Patterson, a character in the movie but in the mockumentary, he is portrayed as if he was real. The mockumentary follows the murders that he committed which were in the movie.","release_dates":"October 27, 2000 (2000-10-27) (US)|||||","Production":"After the massive success of The Blair Witch Project, Artisan was eager to produce a sequel while the film's popularity was still at its peak. However, Haxan Films, who created the original film, was not ready to begin work on a follow-up, preferring to wait until the initial buzz had died down.[1] Artisan decided to proceed without them, hiring Joe Berlinger, who had previously (and subsequently) only done true documentaries, to direct. Blair Witch directors Daniel Myrick and Eduardo Sánchez served as executive producers on the film, but later stated that they had little influence on production and were unsatisfied with the finished film.[2]The majority of the film was shot in the spring of 2000 on location outside of Baltimore, Maryland.[3] The exposition scenes featuring the characters camping were shot in Gwynns Falls Leakin Park, and the stone ruins of the Rustin Parr house were constructed out of styrofoam.[3] The scene featuring Tristen in the hospital was shot at an abandoned sanitarium in Baltimore. Jeff's loft house in the film is actually the Clipper Mill, located on the edge of Baltimore.[3]The hospital footage featuring Jeff was shot merely weeks before the film's release at the request of Artisan Entertainment, and was shot on location at the Kirby Forensic Psychiatric Center on Randall's Island outside of Manhattan, New York .[3] Additionally, the graphic footage of the main characters murdering the foreign tourists was shot last minute in director Joe Berlinger's backyard.[3]Stylistically, Book of Shadows was the direct opposite of its predecessor: though the film occasionally utilizes the point of view camcorder/pseudo-documentary format used in the first movie, Book of Shadows more closely resembles the glossy, big-budget special effects-laden horror films that Blair Witch was a counter to. Berlinger has stated that he originally made the film with more of an ambiguous tone that focused on the characters' psychological unraveling after their night spent in the Black Hills, but Artisan recut the film and re-shot certain scenes to add more \"traditional\" horror movie elements, thus creating what they saw as a more \"commercial\" film. Namely, the footage of the main characters murdering the foreign tourists was shot weeks prior to the film's release date, and was incorporated in the film to add more visual violence.[3] The original cut of the film also featured Frank Sinatra's \"Witchcraft\" during the opening credits, but was replaced by the studio with \"Disposable Teens\" by Marilyn Manson.[3] Berlinger repeatedly expresses his dislike of the studio's changes throughout the film's DVD commentary.Though Book of Shadows' marketing campaign made no attempt to present the film as a \"true story\", a promotional \"dossier\" for the film, compiled by D.A. Stern, was released, including fabricated police reports and interviews surrounding the events in the film as if they were fact (a similar \"dossier\", also by Stern, was released as a companion piece to the first film). Additionally, similar to the first movie, each of the main characters retain the first names of their respective actors, though their surnames are changed slightly.","produced_by":"Bill Carraro","starring":"Kim Director Jeffrey Donovan Erica Leerhsen Tristine Skyler Stephen Barker Turner","running_time":"90 minutes","Sequel":"On September 2, 2009 Ed Sánchez and Daniel Myrick announced their intent to produce Blair Witch 3.[19][20][21] The film would be a direct sequel to the first film, would potentially contain the actors from the first film in some context, and would not reference any of the events from Book of Shadows.[22] In 2011, Sánchez remarked that further development on a sequel depended on getting Lionsgate to approve the idea and for his and Myrick's schedule to match up.[23] The film went into development hell.[24]As of January 2015, Blair Witch 3 is currently still in talks.[25]","music_by":"Carter Burwell","edited_by":"Sarah Flack","written_by":"Dick Beebe Joe Berlinger Daniel Myrick Eduardo Sánchez","budget":"$15 million"}