{"based_on":"Characters   by Don Bluth and David N. Weiss","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Arne Olsen|Kelly Ward|Mark Young|","story_by":"Kelly Ward|Mark Young|","all_dogs_go_to_heaven_2":"Theatrical release poster","Plot":"Charlie B. Barkin (Charlie Sheen) welcomes his friend, Itchy Itchiford (Dom DeLuise), to Heaven, but confesses himself bored by the afterlife. Carface Caruthers, their old enemy (Ernest Borgnine), steals Gabriel's Horn, attempts to pass through the Pearly gates using the music they perform in order to open it so he can leave Heaven with the horn, but it closes on him to protect it from being stolen. He winds up getting stuck on it when he tries to head to the other side and then pops himself out of it. Before heading to Earth, he tries to take off his uniform, but knocks the horn down to Earth, causing him to dive into the purple cloud hole and catch it before it lands into the ocean, but loses it after getting hit by an airplane and sucked into the engines. Continuing to fall to Earth, he sees that the horn ended up somewhere in San Francisco.The dog angels are alerted of the horn's theft by Anabelle, the head angel (Bebe Neuwirth), who sends Charlie and Itchy to Earth to retrieve it, and gives them one miracle to use. Upon arrival in San Francisco, they discover themselves as ghosts and therefore unable to interact with the physical world. At a tavern where Charlie falls in love with a pretty Irish Setter named Sasha La Fleur (Sheena Easton), Carface appears in a corporeal form granted by a red dog collar created by Red (George Hearn), who gives Charlie and Itchy equivalent collars effective for a single day, in hope of later gaining the horn himself.Charlie and Itchy meet Sasha and the human boy, David (Adam Wylie), who ran away from home to become a street performer, the former leading him to believe that he is his guardian angel. Before leaving for \"Easy Street\", Charlie uses his miracle in the form of a passionate kiss (which Sasha does not take kindly to) to grant Sasha the ability to converse with David. Upon seeing the horn being taken into a police station, they retrieve it, with Carface failing to steal it from them. Reluctant to return to Heaven, Charlie conceals it in a lobster trap. On Easy Street, they entertain an audience with magic tricks, but a rainstorm and David tumbling into a fountain ruins the act. He thereafter reveals his belief that his father and stepmother, who is expecting a new baby, will care less for him once it's born; but is persuaded otherwise by Charlie. As he and Sasha embrace, his collar vanishes, and he and Itchy become ghosts again.Carface then kidnaps David and demands that Charlie bring Gabriel's horn to Alcatraz Island and give it to Red in exchange for David's life. Determined to fulfill his promise to accompany David home, Charlie approaches Red, who presses him to give him the horn. He does so, and Red uses it to capture Heaven's canine angels and send them to Earth in the prison cells, including Anabelle. Charlie, Itchy, Sasha, and David fight Red and recover the horn, which Charlie plays to free the angels and send Red back to Hell. Carface comes out of hiding and attempts to downplay his involvement. However, he does offer a genuine apology, hoping to finally make amends with Charlie. Red drags Carface into Hell after himself, which reveals to everyone that Carface sold his soul to him in exchange for his collar.Charlie gives the horn back to Anabelle in exchange for his life and says goodbye to Itchy, who decides to remain in Heaven. After he reunites with Sasha and David, they head to the latter's house where he returns and reunites with his parents. His stepmother is happy that he is all right and explains she has been worried sick and says just because she is pregnant does not mean she does not love him and that they are a family. They then adopt Charlie and Sasha, before enjoying their new life together.","language":"English","Voice cast":"Burt Reynolds, Vic Tayback, And Melba Moore are replaced by Charlie Sheen, Ernest Borgnine, and Bebe Neuwirth; however, three characters were written out of the sequel. Anne-Marie was written out of the story due to the murder of Judith Barsi in the summer of 1988, while Killer and Flo were written out of the story because Charles Nelson Reilly and Loni Anderson chose not to return to their roles from the first film (although Reilly returned for the third).","box_office":"$8.6 million","directed_by":"Paul Sabella|Co-director:|Larry Leker|","Soundtrack":"A soundtrack album was released on the same day as the film's theatrical release, featuring music composed by Mark Watters. The track listing is as follows.","production_companies":"MGM/UA Family Entertainment (MGM Kids) Metro-Goldwyn-Mayer Animation","release_dates":"March 29, 1996 (1996-03-29)|||||","produced_by":"Jonathan Dern|Paul Sabella|Kelly Ward|Mark Young|","starring":"Charlie Sheen|Sheena Easton|Dom DeLuise|Ernest Borgnine|George Hearn|Bebe Neuwirth|Adam Wylie|","running_time":"84 minutes","music_by":"Mark Watters|Songs:|Barry Mann|Cynthia Weil|","edited_by":"Tony Garber|Supervising editors:|Michael Bradley|Thomas V. Moss|","Release":"The film earned $2,256,118 during its opening weekend and grossed $8,620,678 in its theatrical release.[1][2]Adam Wylie was nominated for a Young Artists' Best Performance in a Voiceover by a Young Artist Award for his work in it but lost to Jonathan Taylor Thomas.[3] Sheena Easton's Sasha and George Hearn's Red in particular have been held up as examples of well-done voice acting carrying an animated film.[4]"}