{"based_on":"Body of Lies  by David Ignatius","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"William Monahan","body_of_lies":"Theatrical release poster","Plot":"Roger Ferris (Leonardo DiCaprio) is a CIA case officer in Iraq, tracking a terrorist called Al-Saleem (Alon Abutbul). He meets Nizar, a member of the terrorist organization who is prepared to offer information in return for asylum in America. Despite his boss Ed Hoffman's (Russell Crowe) objections, Ferris agrees to shelter Nizar. Nizar is used as a pawn to draw out the rest of his cell; when he is captured, Ferris is forced to shoot him to prevent him from exposing Ferris' identity. However, Furious at Hoffman's refusal to act on the information Nizar provided, Ferris and his associate Bassam (Oscar Isaac) go to search a safe house in Balad, Iraq, of which Nizar had told them. There, Ferris observes men burning records and attempts to bluff his way in, but is exposed. In the ensuing shootout and chase, Ferris and Bassam's vehicle is hit by an RPG. Ferris and some salvaged discs are rescued by helicopter but Bassam is killed in the explosion.Meanwhile, unknown terrorists plan to follow up off-screen bus bombings in Sheffield with more attacks in Manchester but blow themselves up when the police arrive at their house. Recovered from his injuries, Ferris is assigned to Jordan to continue searching for Al-Saleem, where he meets with Hani Salaam (Mark Strong), head of the Jordanian General Intelligence Directorate.Hoffman finds an Al-Saleem safe house in Jordan and orders Ferris to watch it. Simultaneously, Hoffman organizes another 'side operation' via a local agency operative named Skip (Vince Colosimo) and that he is to conduct an operation without Ferris' knowledge. Skip employs the use of an agency asset, Ziyad Abishi who blows cover to a terrorist from the safe house, as he flees to inform his colleagues of their exposure, Ferris makes chase and kills him in such a place and manner that one might believe the death to be random. Salaam (via 'back channels') corroborates the acceptance of killing by those whom remain at the safe house; and Ferris accuses Hoffman of running \"side operations\" which interfere and (at least) undermine operational integrity of primary operation and tells Hoffman to stop. While going to the hospital to receive rabies shots for bites suffered during the pursuit and elimination of the terrorist, Ferris meets a nurse named Aisha (Golshifteh Farahani), and he begins developing romantic feelings for her. The bombers strike again in an Amsterdam flower market, and kill at least 75 people.Having recognized one of the men living in the safe house as former small-time criminal Mustaffa Karami (Kais Nashef), Salaam takes Karami into the desert and coerces him into working for Jordanian intelligence, threatening to set him up as a collaborator if he does not co-operate. Hoffman asks Salaam to use Karami, but he refuses, believing a greater return will come later. Unknown to Ferris and Salaam, Hoffman tells Ferris' CIA subordinate (Skip) to follow Karami and kidnap him. Karami escapes and notifies the terrorists in the safe house that it is being watched, and they abandon it. Ferris's partner is caught and Salaam accuses Ferris of having had knowledge of the move on Karami, and blames Ferris's duplicity with him for the destruction of the safe house. He exiles Ferris from Jordan.Ferris returns to Hoffman in Washington, and they devise a new plan to find Al-Saleem. Suspecting he is motivated more by pride than ideology, they stage a fake terrorist attack and set up Omar Sadiki (Ali Suliman), an innocent Jordanian architect, as its instigator, hoping Al Saleem will come out of hiding and attempt to contact him. Al-Saleem sees TV news coverage of the attack and takes the bait.Salaam invites Ferris back to Jordan and shares his suspicions that Omar Sadiki is a terrorist, though Ferris feigns ignorance. Ferris later tries to save Sadiki from being kidnapped by Al-Saleem's henchmen but fails and sees his partner nearly killed in the subsequent car crash. Under interrogation, Sadiki denies any knowledge of the attack though he is later found beaten and killed. Ferris goes back to his apartment and finds out that Aisha has been kidnapped. He desperately asks Salaam for help, admitting he fabricated Omar Sadiki's terrorist cell and the attack. Salaam refuses to help because of Ferris earlier having lied to him.Ferris offers himself in exchange to Aisha's kidnappers, and is brought to the middle of the desert, with Hoffman watching everything via a surveillance drone unmanned aerial vehicle. Ferris is surrounded by a group of SUVs, which circle him to create an obscuring dust cloud before picking him up. The dust cloud blocks Hoffman's view, so that he cannot determine which of the SUVs, now headed in different directions, is carrying Ferris. Ferris is taken across the border to Syria where he is to be interrogated by Al-Saleem. When Ferris asks Al-Saleem about Aisha, he is told that someone has lied to him and that he has been double-crossed. Ferris tells Al-Saleem that there is an infiltrator (Karami) in his organization who works for Ferris, and that, by association, Al-Saleem works for Ferris. Al-Saleem does not believe Ferris, beats him, turns on a video camera and orders his execution. Salaam and his agents arrive at the last moment, saving Ferris' life. Al-Saleem, the leader of this terror group, is shown arrested in his own SUV by Marwan Se-Kia, Hani Salaam's security officer.Salaam visits Ferris in the hospital and reveals he had faked Aisha's abduction, and orchestrated Ferris's capture by Al-Saleem using Karami as a go-between. Having lost the will to fight in this particular 'war', Ferris goes off the grid and goes to see Aisha again.","language":"English|Arabic|","Themes":"Ridley Scott has made a previous film about the conflict between the Western and Arab civilizations, Kingdom of Heaven (2005), set during the Crusades. Body of Lies resumes this theme in the context of modern intelligence operations and terrorism.[1] The film puts two contrasting characters on the same side. Ferris, the CIA man on the ground, is a dedicated Arabist fluent in the language; he relies on trust, local knowledge and human intelligence. Hoffman, his superior, who is detached at home in Washington, D.C., and at the CIA in Virginia, is more machiavellian: he authorizes deceit, double-crossing, and violence by telephone and without scruple. The New Yorker interpreted him as \"an American consumer of advanced technology and vast amounts of food\".[2][3]Early in the film, Hoffman explains to his superiors that the terrorists' retreat to pre-tech age communication methods renders useless the high specification tools the CIA uses, and increases the worth of Ferris's human intelligence methods. They avoid mobile telephones and computers, preferring face-to-face communication and encoded written messages. By contrast, the Americans use sophisticated communication (Hoffman and Ferris regularly speak on the phone) and surveillance (high altitude spy planes offer a different point of view throughout) technology.[4] David Denby of The New Yorker said that this was Scott's suggestion that the CIA has the technology but not the human intelligence to properly fight terrorism in the Middle East.[2] Despite Hoffman's distance, the force and unintended consequences of his schemes are often borne by Ferris. The difference is underlined when Ferris, suffering weakened credibility, injured colleagues and personal risk, is reminded by Hoffman that \"we are a results-driven organization\".[3]","Reception":"Body of Lies received mixed reviews from critics. On Rotten Tomatoes the film has a rating of 54%, based on 203 reviews, with an average rating of 5.8/10. The critical consensus reads, \"Body of Lies relies too heavily on the performances of DiCaprio and Crowe to lift it above a conventional espionage thriller.\"[28] On Metacritic the film has a score of 57 out of 100, based on 37 critics, indicating \"mixed or average reviews\".[29]Roger Ebert, writing in the Chicago Sun-Times, awarded the film three out of four stars. He praised the \"convincing\" acting and \"realistic locations and terse dialogue\" but questioned the verisimilitude of the story and concluded, \"Body of Lies contains enough you can believe, or almost believe, that you wish so much of it weren't sensationally implausible.\"[4] Kenneth Turan reached the same conclusion in the Los Angeles Times, \"The skill of top-flight director Ridley Scott and his veteran production team, not to mention the ability of stars Leonardo DiCaprio and Russell Crowe, ensure that this story of spies and terrorism in the Middle East is always crisp and watchable,\" he writes, \"but as the film's episodic story gradually reveals itself, it ends up too unconvincing and conventional to consistently hold our attention.\"[30] Lou Lumenick in the New York Post writes that, \"There's nothing here we haven't seen in many other movies\"[31] and Lisa Kennedy in the Denver Post summarised: \"Body of Lies is an A-list project with B-game results. The movie might be set in the Age of Jihad. But the rules of trust and mistrust are wholly familiar.\"[32]Critics observed the film's adherence to conventions of the spy thriller genre; Ebert called it \"a James Bond plot\" and David Denby pointed out the \"usual tropes of the genre—surveillance shots from drones, S.U.V.s tearing across the desert, explosions, scenes of torture\" but praised Scott's superior management of space and timing.[2] While Todd McCarthy in Variety praised the initial set-up and conceit of the plot device, he criticised the formulaic approach leading to a \"cornball denouement\".[1] A. O. Scott in The New York Times writes that director Scott's \"professionalism is, as ever, present in every frame and scene, but this time it seems singularly untethered from anything like zeal, conviction or even curiosity.\"[3] Joe Neumaier writes in the New York Daily News that the film \"aims to be up-to-the-moment – yet feels same-old, same-old.\"[33] Kennedy called the love story between DiCaprio and Farahani contrived, saying that while DiCaprio seemed more at home in those scenes, it made the film seem \"foolish\".[32] Ebert thought the cultural context of their relationship was well established, but that it essentially existed as a convenience of the plot, to set up the unlikely conclusion.[4] Scott would have preferred the psychological tensions linking the three leading men were allowed develop further.[3]Mark Strong's performance was mentioned by several critics, with Scott calling it \"a marvel of exotic suavity and cool insinuation\"[3] while Ebert \"particularly admired\" his aura of suave control.[4]Body of Lies earned $12.9 million on its first weekend in theatres in the United States and Canada, 40% less than expected. This placed it as the third highest earning film that weekend, behind Disney's Beverly Hills Chihuahua, which turned out to be No. 1 with a take of $17.5 million in its second week, and Sony/Screen Gems's Quarantine, which earned $14.2 million—about $2 million more than it cost to make. A Warner Bros. executive said he was disappointed with the film's opening and attributed it to its controversial storyline, although Body of Lies fared better than previous pictures about the \"war on terrorism\" such as Rendition, In the Valley of Elah, and Lions for Lambs, which all performed well below studios' expectations. In a fourteen-week theatrical run in the United States and Canada, the film earned $39 million.[34]Outside North America it opened reasonably well. In Australia it was the highest-earning film in its opening weekend of October 9–12, 2008 with $2,104,319, ahead of Pixar Animation's Wall-E, which fell to second place, while Beverly Hills Chihuahua held third.[35] In the United Kingdom, the film's earnings were the second-highest behind Quantum of Solace during November 21–23, its opening weekend. It earned £991,939 from 393 screens.[36] Overall, while the film grossed only $40 million at the North American box office, it has grossed $115,097,286 worldwide. In the United States, contemporary war films have performed relatively poorly. Warner Bros. had hoped the large budget and Scott's direction could better them, but the film performed relatively poorly compared to his others; analysts attributed this to the film's Middle East setting and exploration of terrorism. Brandon Gray pointed out that people read these themes in the news media already, and there is a perception that Hollywood films are biased.[37]","box_office":"$115.1 million","cinematography":"Alexander Witt","production_company":"Scott Free Productions De Line Pictures","directed_by":"Ridley Scott","release_dates":"October 10, 2008 (2008-10-10)|||||","Production":"In March 2006, Warner Bros. hired screenwriter William Monahan to adapt the novel Penetration by David Ignatius into a feature film, which would be directed by Ridley Scott.[6] In April 2007, with the novel re-titled Body of Lies and the film similarly re-titled, actor Leonardo DiCaprio was cast in the lead role.[7] DiCaprio chose to pursue the role because he considered it a throwback to political films in the 1970s such as The Parallax View (1974) and Three Days of the Condor (1975). DiCaprio dyed his hair brown, and wore brown contacts for the role.[8] After DiCaprio was cast, Russell Crowe was courted for a supporting role, to which he formally committed after Monahan's script was revised by Steve Zaillian, who wrote Scott and Crowe's American Gangster.[9] Crowe gained 63 pounds to suit his role.[10] The actor said as a result of the film's exploration of the American government and foreign policy, \"I don't think it will be very popular, but that’s never been part of my project choice process.\"[11] Mark Strong, who plays Hani Salaam, the head of the Jordanian General Intelligence Directorate (GID) ascribed his casting to his performances in the 2005 films Syriana and Oliver Twist.[12] The character Haani Salaam was modelled after the 2000–2005 GID chief Saad Kheir (1953–2009), whose involvement, according to the original author David Ignatius, in sharply handled interrogations without use of torture, an encounter with a jihadist with his mother on the phone and being called the 'fingernail boss' were near accurately featured in the film.[13]Scott sought to film in Dubai in the United Arab Emirates, but the federation's National Media Council denied the director permission due to the script's politically sensitive nature. As a result, scenes set in Jordan were instead filmed in Morocco.[14] The shoot took place over sixty-five days from September to December 2007. It was filmed in the United States and Morocco, where scenes set in ten different countries were filmed.[15][16] Filming began on September 5, 2007 at the Eastern Market, Washington, D.C.[17] Practical locations were used throughout; part of the Capitol Hill neighborhood was converted to resemble a wintry Amsterdam to film a ten- to fifteen-second car bomb explosion.[18] Scenes set in the CIA headquarters in Langley, Virginia were filmed at the National Geographic offices in Gaithersburg, Maryland; both buildings were set in woodland and \"It was eerily similar in terms of architectural style,...\", said Arthur Max, the production designer, \"We were given several empty floors.\"[16][19] Locations in Baltimore also stood in for Manchester, England and Munich, Germany, although the final cut of the movie did not have any scenes that took place in Munich.Production moved to Morocco, where Scott, Max and Alexander Witt, the cinematographer had filmed several times before. Their previous experience meant they \"knew every stone in the desert\" and they were allowed access to many locations, including the Ministry of Finance, which was dressed as Jordan's secret service headquarters, Casablanca airport and a military airfield. The basketball stadium in Rabat was used as the U.S. embassy in Jordan: a CIA office set was built inside the stadium, favoured because its design allowed the cameras to shoot both interior and exterior vistas, thus showing the characters looking out on people and tanks passing in the streets.[16] A nine-week shoot also took place at CLA Studios and in the desert around the city of Ouarzazate.[20][21]Body of Lies was Alexander Witt's first credit as a director of photography; he had collaborated with Ridley Scott on six feature films previously, beginning as a second unit camera operator on Black Rain (1989). He shot the film in the Super 35 format with spherical lenses, and explained that these lenses offer more flexibility for interior and night pictures than the anamorphic alternative. They used Kodak Vision2 500T 5218 instead of Technicolor's OZ process, which did not perform well in tests in the Moroccan desert.[16]Scott is known for his skill at filming with multiple camera set-ups and Body of Lies used a minimum of three simultaneously. Witt explained the benefits, \"Actors like multiple cameras because they’re always on-camera, so they’re always in character and not wasting time off-camera.\" One shot of DiCaprio alone in the desert, for example, still used three cameras: one hand-held above the actor, a second capturing a three-quarter back profile, and the third photographing a close-up through the first cameraman's legs.[16] Richard Cronn, the gaffer, attributed the success of this difficult approach to Scott's filmmaking intelligence, \"Ridley will stand at the monitors and tell you what's he's looking for – he'll look at four monitors and say, 'I'm cutting from this to this to this.' He knows exactly how he will cut it.\"[16]In line with the film's use of practical locations, the photography and design departments worked together to incorporate practical light sources such as \"lots of bare bulbs, lots of primitive fixtures\". In the climactic torture scene, filmed in an ancient, windowless prison cell outside of Rabat, they used only diegetic light: two strong torches carried by the actors playing the torturers. It was filmed with three cameras and bounce cards were used to reflect light onto the actors' faces. Just a little smoke was sprayed in to augment the atmosphere but not dull the contrast.[16]Scott has used many gradations of lens filter in the past, but declined to do so on Body of Lies. One obtains better finesse using the digital intermediate during post-production and does not risk losing light while selecting filters during expensive on-set time. The filmmakers strove for authenticity and realism in the images, and as such little colouration was added after, and the natural contrast of colours between the locations in Washington and Morocco were allowed to show through.[16]In the film, images from unmanned aerial drones show the viewer the point of view of CIA commanders in Washington. These were filmed by John Marzano (Aerial Director Of Photography) using a helicopter mounted with a Wescam 35 on the nose of a helicopter, and Cineflex's V14 surveillance system, hanging from the side. Its 1–40 zoom allowed the filmmakers to fly very high and then zoom out of Ferris strolling through a market-place, creating the film's final shot.[16]The film score was composed by Marc Streitenfeld, who has now composed music for Ridley Scott for three features. He recorded the orchestral portions of his score at the Eastwood Scoring Stage at Warner Brothers Studios.[22] Of note is the presence of a song in the film named \"If the World\", performed by Guns N' Roses, and taken from their long-delayed Chinese Democracy album. The track plays over the beginning of the end credits, but is not included on the official film soundtrack. Streitenfeld also collaborated with Mike Patton and Serj Tankian on the song \"Bird's Eye\", which was written specially for the musical score of the film.[23] It was not included on the soundtrack album but was released separately as a single.The film was commercially released in the United States on October 10, 2008.[24] The film has also been purchased by Turner Broadcasting System to screen on the television networks TBS and Turner Network Television.[25]The film was screened on September 30, 2008 at Michigan Technological University,[26] and October 2, 2008 at Duke University, New York Film Academy, University of Maryland and University of Virginia. It was also pre-screened on October 3 at Worcester Polytechnic Institute, at Michigan State University, at the University of Michigan, the University of Kansas, East Carolina University, and the University of Chicago on October 7 and at Carnegie Mellon University, Cornell University, Rensselaer Polytechnic Institute, The University at Buffalo, Columbia University, James Madison University, Syracuse University, the University of Colorado, the University of Washington, and Georgia Southern University on October 9.Warner Home Video released Body of Lies on DVD on February 17, 2009. The single-disc region one release included surround sound and subtitles in English, French, and Spanish; the two-disc special edition included commentaries by the director, screenwright and original novel author, and a behind the scenes documentary; the Blu-ray edition also included additional commentary on the film's themes.[27]","produced_by":"Ridley Scott|Donald De Line|","starring":"Leonardo DiCaprio|Russell Crowe|Mark Strong|Golshifteh Farahani|Vince Colosimo|Oscar Isaac|Ali Suliman|Alon Aboutboul|","running_time":"128 minutes","music_by":"Marc Streitenfeld","edited_by":"Pietro Scalia","budget":"$70 million"}