{"based_on":"Characters from the DC Comics/Vertigo Hellblazer Graphic Novels","country":"United States|Germany|","distributed_by":"Warner Bros. Pictures","story_by":"Kevin Brodbin","Novelization and video game":"To tie into the film's release, a novelization by John Shirley and a video game adaption of the film was also produced.The novelization further describes Hell's setting in that the buildings are lined with blood instead of mortar, and built with the souls of the damned rather than brick.[32]","constantine":"Theatrical release poster","language":"English","box_office":"$230.9 million[2]","cinematography":"Philippe Rousselot","directed_by":"Francis Lawrence","Home media":"Warner Home Video announced that the film was to be released on HD DVD on March 28, 2006.[31] It would be one of the earliest titles to be released on that media format. However, following delays to the launch of the HD DVD format (which pushed back the release of many of the initially announced titles), Constantine eventually made its debut on HD DVD on June 6, 2006. Warner Home Video released a Blu-ray Disc version of the film on October 14, 2008.[citation needed]","release_dates":"February 17, 2005 (2005-02-17) (Germany)|February 18, 2005 (2005-02-18) (United States)||||","Production":"Producer Lauren Shuler Donner had developed the film as far back as 1997.[5] In 1999, Paul Hunter was attached to direct,[6] followed by Tarsem Singh in 2001.[7] Warner Bros. hoped Singh could begin filming in 2002 with Nicolas Cage attached to star in the lead role[8] but Singh ended up dropping out, a move that inspired dueling lawsuits from Tarsem and Warners. Keanu Reeves became attached in 2002.[9] Alan Moore, original creator of John Constantine, had been disappointed by the previous adaptations of his other comics From Hell and The League of Extraordinary Gentlemen, refused credit for the film and asked that his royalties be distributed among the other creators.Constantine was written using some elements from Garth Ennis’ \"Dangerous Habits\" story arc (issues #41–46)[4] and others—such as the inclusion of Papa Midnite—from the Original Sins trade paperback.[10] However, the film changed several aspects of the source material, including a number of cosmetic changes to the lead character’s appearance: Reeves played the role with his natural accent and hair colour[11] whilst the original character was intentionally drawn to resemble English musician Sting and originally came from Liverpool.[12] The film was also set in Los Angeles, with the director pointing out that the comic book was not exclusively set in London either.[11]Other differences to the character were made, such as giving him the psychic ability to see \"half-breeds\" as they truly are. That ability, in the film, is what caused him to attempt suicide and which led to his damnation[13] rather than his role in summoning a demon that killed a young girl.[14] The resolution of the lung cancer plotline in the film was also amended, with Lucifer saving the redeemed Constantine to give him a second chance at falling rather than being tricked into doing so as was seen in the comic book.[13] Scenes with actress Michelle Monaghan as Constantine's lover, a half-breed demon named Ellie based on the succubus Ellie in the Hellblazer comics, were cut from the film to make Constantine more of a lonely character.[15]The film’s title was changed from Hellblazer to Constantine to avoid confusion with the Clive Barker Hellraiser films.[11] The comics series itself was originally to be titled Hellraiser but was also retitled to avoid confusion with the film, released the previous year.[12]Director Lawrence decided to base the idea of Hell \"on the geography of what's around us now.\"[16] He further explained:That was actually a combination of me and the visual effects supervisor and the production designer sitting down and sort of coming up with the biological growth that’s growing all over the cars and what that looks like and the color palette. And we started to look at the nuclear test films from the 1940s of the nuclear blasts and just decided that it would be great if the landscape was not only violent with these creatures, but also the atmosphere. So we decided that it was kind of an eternal nuclear blast except nothing ever really gets obliterated because it's eternal and it's constantly going.","running_time":"120 minutes[1]","Sequel":"In a 2011 interview with MTV Splash Page, director Lawrence spoke of a potential sequel:It's interesting that over the years, Constantine seems like it's become... like it has this sort of cult following, which has been great. It's been embraced. It would be great to figure out a sequel, and if we did, and we've been trying to figure one out, it would be great to do the really dark, scary version. We got caught in that weird PG-13–R no man's land, and we should do the hard-R scary version, which I would love to do.[33]In November 2012, it was reported that Guillermo del Toro and Warner Bros. were considering a film featuring DC Comics' supernatural characters, which includes John Constantine. It is unconfirmed if it will be connected to the 2005 film or if Reeves will reprise his role.[34]","Release":"The original announced release date was September 17, 2004 before it was pushed back.[18]Constantine opened theatrically on February 18, 2005 in 3,006 venues, earning $29,769,098 in its opening weekend and ranking second behind Hitch's second weekend.[19] The film ended its run on June 16, 2005 and was a box office bomb, having grossed $75,976,178 domestically from a $100 million budget. However, with the international take of $154,908,550, the film's worldwide total of $230,884,728 made the film a success.[2]The film received mixed reviews from critics. At the review aggregation site Rotten Tomatoes, the film holds a normalized rating of 46% based on the reviews of 217 critics with an average rating of 5.5/10. The site's consensus states: \"Despite solid production values and an intriguing premise, Constantine lacks the focus of another spiritual shoot-em-up, The Matrix.\"[20] At Metacritic, an aggregation site which assigns a weighted average, the film holds a rating of 50 out of 100 based on the reviews of 41 critics.[21]Richard Corliss of Time magazine praised the film calling it \"a one-of-a-kind hybrid: a theological noir action film\".[22] In crediting the actors, he specifically cited Keanu Reeves' ability to \"retain his charisma in [a] weird-silly moment\" in addition to the performances of Tilda Swinton whom he referred to as \"immaculately decadent\". He also praised Francis Lawrence's usage of a significant number of camera locations and angles. He was, however, critical of the movie's climax, referring to it as \"irrevocably goofy\".Ella Taylor of L.A. Weekly gave the film positive feedback, stating, \"Constantine, which opts in the end for what I can only describe as a kind of supernatural humanism, is not without its spiritual satisfactions.\"[23] Carina Chocano of the Los Angeles Times wrote, \"Keanu Reeves has no peer when it comes to playing these sort of messianic roles—he infuses them with a Zen blankness and serenity that somehow gets him through even the unlikeliest scenes with a quiet, unassuming dignity.\"[24]Pete Vonder Haar of Film Threat gave the film three stars out of five, stating that \"the film (barely) succeeds, thanks to impressive visuals, the idea of an uncaring God wagering with Satan for souls, and two immensely enjoyable scenes (one with Weisz, one with Stormare) in which Reeves actually plays his character as the cynical asshole he really is.\"[25]Jack Matthews of the New York Daily News gave the film a 2.5 out of 5, stating, \"For all its spiritual angst, Constantine is about as silly as fantasies get.\"[26] Michael Sragow of The Baltimore Sun also gave the film a 2.5 out of 5, stating, \"It all comes off as a case of filmmakers wanting to have their communion wafer and eat it, too.\"[27] Desson Thomson, a writer for The Washington Post, had similar sentiments of the film,[28] specifically panning the film's distancing from the comic book upon which it is based:If you are a fan of the Hellblazer comic book series, on which this movie is based, you'll definitely need a distraction. The relation between Constantine and its source material is, at best, superfluous. The disparity starts with the original John Constantine (Reeves's character) being from Liverpool, England. Reeves from the city of John and Paul? As if.Leonard Maltin's annual publication \"TV Movies\" gives the film a BOMB rating, describing it as \"dreary, to say the least.\"[this quote needs a citation]Film critic Roger Ebert gave the film 1.5 out of 4 stars,[29] panning the depiction of hell (\"a post-nuclear Los Angeles created by animators with a hangover\"), the premise of the film itself (\"You would think that God would be the New England Patriots of this contest, but apparently there is a chance that Satan could win.\"), plot holes, inconsistencies, and general actions depicted throughout the film. He was not particularly critical of the film's acting, only mentioning it by stating, \"Reeves has a deliberately morose energy level in the movie, as befits one who has seen hell, walks among half-demons, and is dying. He keeps on smoking.\" He added it to his list of \"most hated\" films.[30]","budget":"$100 million[2]","screenplay_by":"Kevin Brodbin|Frank Cappello|","Plot":"God and Lucifer are engaged in a war for the souls of humanity; a standing wager for the souls of all mankind. Angels and demons are forbidden to manifest on Earth, but they are allowed to possess and influence humans, and half-breeds are used to peddle influence. Exorcist John Constantine (Keanu Reeves) was born with the power to see angels and demons. At age 15, he committed suicide to escape his visions, but he was revived after spending two minutes in Hell, though John explains that since time moves differently in Hell 2 minutes feels like a full lifetime. Consequently, his soul is bound for Hell when he dies for the sin of taking his own life.John exorcises a girl possessed by a soldier demon trying to break through to Earth, something that should not be possible, as demons cannot take their true physical form on the mortal plane. John seeks an audience with the androgynous half-breed angel Gabriel (Tilda Swinton). He asks Gabriel for a reprieve from his impending death from lung cancer; but Gabriel declines, telling John that his motives for exorcising demons are selfish and will not earn him entry into Heaven. After he leaves Gabriel, John repels an attack by a full demon out in the open. This encounter prompts him to meet with former witch doctor Papa Midnite (Djimon Hounsou) who informs him that all of Hell is waiting for him to die and that he is the one soul Lucifer would come to collect himself. There, John also encounters half-breed demon Balthazar (Gavin Rossdale). Midnite refuses to become involved, wanting to retain the balance between Heaven and Hell. John begins investigating the situation with his associates Beeman (Max Baker), Hennessy (Pruitt Taylor Vince), and Chas Kramer (Shia LaBeouf). Detective Angela Dodson (Rachel Weisz) shows up at Constantine's apartment to ask for his help investigating Isabel (Rachel Weisz), her identical twin's, death. Isabel leapt from the top of a psychiatric hospital, where she was a patient; and, despite camera footage showing it, Angela is convinced that Isabel would never commit suicide. At first, John mocks her and denies her request for help; but, after demons chase after Angela on the street outside, Constantine agrees to help.Later on, John wants to see if Isabel is truly in Hell, he then takes a hold of Angela's cat as a means of teleportation and briefly transports himself into the depths of hell where he finds Isabel. Hennessy's and Beeman's research leads them to conclude that Lucifer's son, Mammon, is plotting to break through to Earth and claim it as his own kingdom. To do so, Mammon requires a powerful psychic and assistance from God. Balthazar kills Hennessy and Beeman, and Angela reveals that she and her sister possessed the same gift as John. Angela rejected her visions and they eventually stopped, but Isabel embraced them and was institutionalized for it. John reawakens Angela's psychic ability through a near death experience, then hunts down and interrogates Balthazar who reveals that Mammon has obtained the Spear of Destiny, which is stained with the blood of Jesus Christ. Afterwards, John proceeds to kill Balthazar and he and Angela then leave. Angela, now possessing the psychic abilities Mammon requires, is abducted by an unseen force and brought to Isabel's hospital. John convinces Midnite that the balance is no longer in force, and asks to use \"The Chair\"; an old electric chair from Sing Sing. The Chair shows John a vision of how the spear was discovered in Mexico and has been brought to Los Angeles. John and Chas head to the hospital and interrupt the ritual, but Chas is beaten to death by an unseen force in the process.Using incantations and sigils tattooed on his arms, John forces the unseen force, revealed to be an invisible Gabriel, to reveal itself. Gabriel subdues John, admits responsibility for the plan to release Mammon, and reveals the details. Gabriel laments God’s favoritism towards humans and believes that bringing Hell to Earth will enable those who survive to become truly worthy of God’s love through suffering, repentance and faith. Gabriel then casts John from the room. As Gabriel moves to stab Angela with the Spear and release Mammon, John slits his wrists and dies. Time stops as Lucifer arrives to personally collect his soul and John tells him about Mammon’s plan to usurp him. Gabriel attempts to smite Lucifer but cannot as God has taken away Gabriel's power, allowing Lucifer to burn Gabriel's wings. Lucifer sends Mammon back to Hell. In return for his help, Lucifer grants John a favor; instead of a longer life, he asks Lucifer to allow Isabel to go to Heaven. Lucifer agrees, but then finds that he is unable to drag John to Hell; John's noble sacrifice having granted him entry to Heaven. Infuriated at losing John Constantine's soul, Lucifer painfully resurrects him and removes his cancer, claiming that John will eventually prove he belongs in Hell. Freed from Mammon's possession, Angela departs with John, leaving behind the now human Gabriel. Some time later, John gifts the Spear to Angela, asking her to hide it somewhere not even he can find it. As she leaves, instead of producing a cigarette, he starts to chew on some nicotine gum.In a post-credits scene, John visits Chas' grave. Chas appears before him as an angel and flies upward to the sky.","Soundtrack":"Constantine: Original Motion Picture Soundtrack is a 2005 soundtrack album from the film of the same name. The soundtrack is an orchestral compilation of songs in the film, performed by the Hollywood Studio Symphony and composed by Brian Tyler, composer for films such as Eagle Eye and Fast & Furious, and Klaus Badelt, composer for Disney's Pirates of the Caribbean film series.The songs \"Passive\" by A Perfect Circle (released in conjunction with the film and heard in the walk through Midnite's bar) and \"Take Five\" by The Dave Brubeck Quartet (heard on a record played by Constantine) were not included. The soundtrack was panned by Allmusic, who referred to it as \"clichéd and religiously formulaic.\"[17]","production_companies":"Village Roadshow Pictures Vertigo Lonely Film Productions GmbH & Co. KG The Donners' Company Batfilm Productions Weed Road Pictures 3 Arts Entertainment","produced_by":"Lauren Shuler Donner|Benjamin Melniker|Michael E. Uslan|Erwin Stoff|Lorenzo di Bonaventura|Akiva Goldsman|","starring":"Keanu Reeves|Rachel Weisz|Shia LaBeouf|Tilda Swinton|Pruitt Taylor Vince|Djimon Hounsou|","music_by":"Brian Tyler|Klaus Badelt|","edited_by":"Wayne Wahrman"}