{"country":"USA","catalina_caper":"Theatrical poster","distributed_by":"Crown International Pictures Warner Bros.","Plot":"An ancient Chinese scroll is stolen from a museum in Los Angeles and teenage Don Pringle (Kirk) arrives on Catalina Island simultaneously. Although approximately half of the film involves swimsuit-clad adolescents dancing on yachts in several different dance montages, Pringle and his friends investigate the scroll's theft and discover that the parents of one of the boys is responsible — also while attempting to woo a mysteriously depressed young woman Katrina Corelli (Ulla Strömstedt) from her vaguely threatening boyfriend Angelo (Lyle Waggoner). After wrestling the scroll away from Angelo and his cohorts, bent on more dangerous results (in an underwater scuba diving action scene), the boys secretly return the scroll to the museum to the relief of the repentant parents.","language":"English","cinematography":"Ted V. Mikels","production_company":"Executive Pictures Corporation","directed_by":"Lee Sholem","Production notes":"Both Never Steal Anything Wet and Scuba Party were titles planned for the film, before the makers decided on Catalina Caper (see Music section below).[2]The movie was made by Executive Pictures Corporation, which had been formed by Bond Blackman and Jack Barlett. It started filming in September 1965.[3] Tommy Kirk was signed to a four-picture contract of which this was to be the first. (However he did not wind up making any of the other films.)[4]Kirk appeared in four other films in the beach party genre: Village of the Giants (1965); two AIP features, Pajama Party (1965) and The Ghost in the Invisible Bikini (1966); and It's a Bikini World (1967). Sue Casey, who plays Anne Duval in this film, was seen earlier as one of the female leads in another beach party film, 1965's The Beach Girls and the Monster.The composer for this film, Jerry Long, also wrote the music for another beach party film, Wild Wild Winter. The two films are his only onscreen credits.Long also wrote two songs for the film, \"Never Steal Anything Wet,\" heard over the opening/closing credits and performed by Mary Wells; and \"Scuba Party,\" performed onscreen by Little Richard, who is also credited as a co-writer on the song.The Cascades perform \"There's a New World,\" written by Ray Davies.Carol Connors performs \"Book of Love,\" which was written by Connors and Roger Christian.","release_dates":"1967","produced_by":"Jack Bartlett Bond Blackman","starring":"Tommy Kirk","running_time":"84 mins.","music_by":"Jerry Long","edited_by":"Herman Freedman","written_by":"Sam Pierce (story) Clyde Ware"}