{"country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Delmer Daves Donald Ogden Stewart Leo McCarey","story_by":"Leo McCarey Mildred Cram","Plot":"Nickie Ferrante (Cary Grant), a well-known playboy and dilettante in the arts, meets Terry McKay (Deborah Kerr) aboard the Transatlantic ocean liner SS Constitution en route from Europe to New York. Each is involved with someone else. After a series of chance meetings aboard the ship, they establish a friendship. When Terry joins Nickie on a brief visit to his grandmother when the ship anchors near her home at Villefranche-sur-Mer on the Mediterranean coast, she sees Nickie with new eyes and their feelings blossom into love. During their visit, it is revealed that Nickie has had a talent for painting, but has dropped said trait due to his critical attitude towards his own art. As the ship returns to New York City, they agree to reunite at the top of the Empire State Building in six months' time, if they have succeeded in ending their relationships and starting new careers.On the day of their rendezvous, Terry, in her haste to reach the Empire State Building, is struck down by a car while crossing a street. Gravely injured, she is rushed to the hospital. Meanwhile, Nickie, waiting for her at the observation deck at the top of the building, is unaware of the accident and, after many hours, finally concedes at midnight that she will not arrive, believing that she has rejected him.After the accident Terry, now unable to walk, refuses to contact Nickie, wanting to conceal her disability. Instead, she finds work as a music teacher. Nickie has pursued his talent as a painter and has his work displayed by an old friend, an art shop owner. Six months after the accident, she sees Nickie with his former fiancée at the ballet, which she herself is attending with her former boyfriend. Nickie does not notice her condition because she is seated and only says hello as he passes her.Nickie finally learns Terry's address and, on Christmas Eve, makes a surprise visit to her. Although he steers the conversation to make her explain her actions, Terry merely dodges the subject, never leaving the couch on which she sits. As he is leaving, Nickie mentions a painting that he had been working on when they originally met, and that it was just given away at the art shop to a woman who liked it but had no money. He is about to say that the woman was in a wheelchair when he pauses, suddenly suspecting why Terry has been sitting unmoving on the couch. He walks into her bedroom and sees his painting hanging on the wall, and a wheelchair concealed there. He now knows why she did not keep their appointment. The film ends with the two in a tight embrace, each realizing that the other's love endures. In closing, Terry says, \"If you can paint, I can walk; anything can happen, don't you think?\"","language":"English","box_office":"$3.8 million (US and Canada)[2]","cinematography":"Milton Krasner","production_company":"Jerry Wald Productions, Inc.","directed_by":"Leo McCarey","Home media":"The film has been released in various formats including VHS, Laserdisc, VCD, DVD, and Blu-ray.","Awards and honors":"The film was nominated for Best Cinematography,Best Costume Design, Best Original Song and Best Original Score at the 30th Academy Awards.","release_dates":"July 2, 1957 (1957-07-02)|||||","Production":"The film was a remake of McCarey's 1939 film Love Affair, starring Irene Dunne and Charles Boyer. An Affair to Remember was almost identical to Love Affair on a scene-to-scene basis.[4] McCarey used the same screenplay as the original film, which was penned by Delmer Daves and Donald Ogden Stewart. Also, the character name \"Terry McKay\" appears in both films.Contributing to the success of the 1957 film is its theme song, \"An Affair to Remember (Our Love Affair)\", composed by Harry Warren and with lyrics by Leo McCarey and Harold Adamson, which has since become a jazz standard. Sung by Vic Damone over opening credits.","produced_by":"Leo McCarey Jerry Wald","starring":"Cary Grant Deborah Kerr Richard Denning","running_time":"119 minutes","music_by":"Hugo Friedhofer","edited_by":"David Bretherton","Critical reaction":"The film currently holds a 64% rating on Rotten Tomatoes based on 28 reviews, despite receiving four Oscar nominations.","budget":"$2,120,000[1]"}