{"based_on":"Asterix and Cleopatra  by René Goscinny Albert Uderzo","country":"France, Italy","distributed_by":"Miramax Films (USA) Pathé (France/UK)","Plot":"Infuriated by belittlements, Queen Cleopatra makes a deal with Julius Caesar: if the Egyptians build a palace larger than Caesar's palace in Rome in three months, he must acknowledge that Egypt was the greatest of nations. To perform this task, Cleopatra hires the architect Numerobis, on pain of death and much to the dismay of Pyradonis, Cleopatra's customary architect. He and his secretary Papyris discuss the druid Getafix (Panoramix in the original French), whose potion empowers its drinkers; and Numerobis goes in search of him.In Gaul, two Roman legionnaires challenge protagonist Asterix, who drinks the potion and defeats one Roman; whereupon Obelix fells the other. They are joined by Numerobis, whom they guide to Getafix. Rather than sell some of the magic potion, Getafix accompanies Numerobis to Alexandria, and Asterix and Obelix accompany him (encountering the pirates along the way). In Alexandria, Numerobis introduces the Gauls to Papyris, and later to Queen Cleopatra herself. While they greet her, Asterix falls in love with Guimieukis, a maidservant. As they observe the workers, Pyradonis starts a riot; but the druid supplies the workers with potion, and they build rapidly. Pyradonis hires Torturis to trap the Gauls in the Great Pyramid; but Dogmatix leads them out. As they return to Alexandria, Caesar is informed of the Gauls' presence, and leads an attack to destroy the unfinished palace. As the Romans charge, Asterix and Obelix fend them off, before Panoramix sends Asterix to Alexandria with a letter to Cleopatra. En route, he drops his vial of potion, and the Roman Criminalis drinks it. Meanwhile, Panoramix gives Numerobis some potion, with which he defeats Criminalis. When Cleopatra receives the letter, she stops Caesar from destroying the palace. Numerobis and the Gauls complete the palace, and Caesar concedes his bet to Cleopatra. In the epilogue, all the characters (except Criminalis) celebrate in a bar.","language":"French","box_office":"$110.9 million[1]","cinematography":"Laurent Dailland","directed_by":"Alain Chabat","asterix_&_obelix:_mission_cleopatra_(astérix_&_obélix :_mission_cléopâtre)":"Theatrical release poster","release_dates":"2002","produced_by":"Claude Berri","starring":"Gérard Depardieu Christian Clavier Jshitamel Debbouze Édouard Baer Monica Bellucci Alain Chabat","running_time":"107 min.","music_by":"Philippe Chany","Translations":"Miramax Films re-edited the film, cutting approximately 21 minutes and dubbing the movie into English using an American cast. The English script added many new jokes for the American audience, including more references to modern popular culture (Edifis continually calls Getafix a \"droid\", for example. This pun was already hinted at in the French version; the actor playing Edifis used his distinctive North-African accent to create a subtle confusion between \"droid\" and \"druid\"), and some changes in characterisation, most notably Obelix who appears far more intelligent than usual. The dubbed dialogue uses some of the original English names, but the rest are either reused from the American English translation of the original album, or newly invented names. This is most notable among minor characters; the pirate crew, for example, are referred to by the names of famous rock and roll musicians (including John, Paul, George and Ringo) just before a cry of \"let's rock and roll!\"The English language subtitles for other markets are a straight translation of the French dialogue, with only the names changed to match the original English translation of the album. The version released on DVD in the Australia by Madman Entertainment contains two discs, one the original French version (with multiple language subtitles) and the other the Miramax edit.","edited_by":"Stéphane Pereira","written_by":"Alain Chabat","budget":"$50.3 million"}