{"distributed_by":"Warner Bros.","Plot":"Alice Sutton (Julia Roberts) is a lawyer working for the U.S. government at the Justice Department. Jerry Fletcher (Mel Gibson), a conspiracy-theorist New York City taxi driver, continually expounds his ideas to her. Alice humors him because he once saved her from a mugging, but does not know he has been spying on her at home. Her own work is to solve the mystery of her father's murder.Seeing suspicious activity everywhere, Jerry identifies some men as CIA workers, follows them into a building, and is captured. He wakes up bound to a wheelchair. A doctor (Patrick Stewart) injects him with LSD, and interrogates him using torture. Jerry experiences terrifying hallucinations and flashbacks, panics, and manages to escape, incapacitating the doctor by biting his nose.Alice visits him in the hospital. Handcuffed to the bed and forced into a drug-induced sleep, he persuades her to switch his chart with that of a criminal in the next bed or else he'll be dead by morning. The next day, when Alice visits, the criminal is dead, allegedly from a mysterious heart attack. The CIA, FBI and other agencies are there, led by a CIA psychiatrist, Dr. Jonas, whose nose is bandaged. Meanwhile, with Alice's help, Jerry fakes a heart attack and escapes again. In Jerry's hospital room, Alice meets an FBI agent named Lowry.The pair go to Alice's apartment and Jerry accidentally reveals he's been watching her. Outside, Jerry confronts Lowry and his partner staking out her place, and he warns them, at gunpoint, not to hurt her. Jerry sees their operatives rappelling down from black helicopters and hides in a theater, escaping by causing a panic.Alice calls each person on the newsletter mail-list and finds that all have recently died, except one. Jerry uses a ruse to get her out of the office, and then immobilizes the operatives watching her. During their escape, he tells her that he loves her, then flees on a subway train when she brushes off his feelings.She goes to see the last surviving person on the subscription list, and finds it is Jonas. He explains that Jerry was brainwashed, during Dr. Jonas' time with Project MKULTRA, to become an assassin, and claims that Jerry killed her father. She agrees to help find Jerry.Jerry sends Alice a message to meet him. They ditch the agents following them and he drives her to her father's private horse stables in Connecticut, but Alice secretly calls her office so that Jonas can track her. At the stables, Jerry remembers that he was sent to kill her father (a judge who was about to expose Jonas' operation) but found he could not. Instead, Jerry promised to watch over Alice before the judge was killed by another assassin. Jonas' men capture Jerry, and a sniper tries to get Alice, but she escapes.Jonas tortures Jerry again. Meanwhile, Alice finds Lowry and forces him at gunpoint to admit that he is not FBI, but from a \"secret agency that watches the other agencies\" and has been using the unwitting Jerry to uncover and stop Jonas. Alice goes to the site of the smokestacks from Jerry's mural and sees a mental hospital next door. There she bribes an attendant to show her an unused wing, breaks in, and finds Jerry. As Jonas catches them, Lowry arrives with his men and attacks Jonas' men. Jerry attempts to drown Jonas, but is shot. Alice shoots Jonas dead. Alice tells Jerry she loves him before he is taken away in an ambulance.Some time later, Alice visits Jerry's grave, leaving a pin he gave her upon it, before returning to horse riding. Jerry and Lowry are watching from a car. Jerry agrees not to contact her until all of Jonas' other subjects are caught, but she joyfully finds the pin attached to her saddle.","language":"English","Reception":"Review aggregation website Rotten Tomatoes gives the film a score of 52% based on reviews from 42 critics.[2]In her review in The New York Times, Janet Maslin said, \"The only sneaky scheme at work here is the one that inflates a hollow plot to fill 2¼ hours while banishing skepticism with endless close-ups of big, beautiful movie-star eyes ... Gibson, delivering one of the hearty, dynamic star turns that have made him the Peter Pan of the blockbuster set, makes Jerry much more boyishly likable than he deserves to be. The man who talks to himself and mails long, delusional screeds to strangers is not usually the dreamboat type ... After the story enjoys creating real intrigue ... it becomes tied up in knots. As with too many high-concept escapades, Conspiracy Theory tacks on a final half-hour of hasty explanations and mock-sincere emotion. The last scene is an outright insult to anyone who took the movie seriously at its start.\"[3]Lisa Schwarzbaum of Entertainment Weekly graded the film B- and commented, \"Richard Donner ... switches the movie from a really interesting, jittery, literate, and witty tone poem about justified contemporary paranoia (and the creatively unhinged dark side of New York City) to an overloaded, meandering iteration of a Lethal Weapon project that bears the not-so-secret stamp of audience testing and tinkering.\"[4]In the San Francisco Chronicle, Mick LaSalle stated, \"If I were paranoid I might suspect a conspiracy at work in the promoting of this movie—to suck in audiences with a catchy hook and then give them something much more clumsy and pedestrian ... Conspiracy Theory can be enjoyed once one gives up hope of its becoming a thinking person's thriller and accepts it as just another diversion ... When all else fails, there are still the stars to look at—Roberts, who actually manages to do some fine acting, and Gibson, whose likability must be a sturdy thing indeed.\"[5]Roger Ebert of the Chicago Sun-Times observed the film \"cries out to be a small film—a quixotic little indie production where the daffy dialogue and weird characters could weave their coils of paranoia into great offbeat humor. Unfortunately, the parts of the movie that are truly good are buried beneath the deadening layers of thriller cliches and an unconvincing love story ... If the movie had stayed at ground level—had been a real story about real people—it might have been a lot better, and funnier. All of the energy is in the basic material, and none of it is in a romance that is grafted on like an unneeded limb or superfluous organ.\"[6]In Rolling Stone, Peter Travers said, \"The strong impact that Gibson makes as damaged goods is diluted by selling Jerry as cute and redeemable. Instead of a scalding brew of mirth and malice, served black, Donner settles up a tepid latte, decaf. What a shame—Conspiracy Theory could have been a contender.\"[7]Todd McCarthy of Variety called the film \"a sporadically amusing but listless thriller that wears its humorous, romantic and political components like mismatched articles of clothing ... This is a film in which all things ... are treated lightly, even glibly ... One can readily sympathize with ... the director's desire to inject the picture with as much humor as possible. But he tries to have it every which way in the end, and the conflicting moods and intentions never mesh comfortably.\"[8]Pauline Kael in an interview said \"the first half of Conspiracy Theory was terrific, then it went to hell\" but that Mel Gibson was \"stunningly good.\"[9]In his 2003 book A Culture of Conspiracy: Apocalyptic Visions in Contemporary America, political scientist Michael Barkun notes that a vast popular audience has been introduced by the film to the notion that the U.S. government is controlled by a secret team in black helicopters — a view once confined to the radical right.[10]Conspiracy Theory was released August 8, 1997 to 2,806 theaters, and had an opening weekend gross of $19,313,566 in the United States. The film opened at number 1 in the U.S., displacing Air Force One. The film eventually grossed $75,982,834 in the U.S. and $61,000,000 internationally, for a worldwide total of $136,982,834. This final gross made Conspiracy Theory the 19th highest grossing film in the U.S. in 1997.[1]","box_office":"$137 million[1]","cinematography":"John Schwartzman","production_company":"Silver Pictures","directed_by":"Richard Donner","conspiracy_theory":"Original poster","Production notes":"Early in the film, Jerry Fletcher expounds on a number of his theories to a succession of taxi passengers. On one of the featurettes included on the DVD release of the film, director Richard Donner reveals these scenes were ad-libbed by Mel Gibson. The extras acting as passengers were not told what Gibson was going to say because Donner wanted their reactions to be as spontaneous and realistic as possible.The film was shot on location in and around New York City. Sites included Times Square, Union Square, Greenwich Village, the Queensboro Bridge, Roosevelt Island, and the Westchester Medical Center in Valhalla, New York.The soundtrack includes \"Just Maintain\" by Xzibit, \"Every Little Thing She Does Is Magic\" by The Police, and two renditions of \"Can't Take My Eyes Off You\", one by Frankie Valli and the other by Lauryn Hill.","release_dates":"August 8, 1997 (1997-08-08) (United States)|August 29, 1997 (1997-08-29) (United Kingdom)||||","produced_by":"Richard Donner Joel Silver","starring":"Mel Gibson|Julia Roberts|Patrick Stewart|","running_time":"135 minutes","music_by":"Carter Burwell","edited_by":"Kevin Stitt Frank J. Urioste","written_by":"Brian Helgeland","budget":"$80 million"}