{"based_on":"Blinky Bill  by Dorothy Wall","country":"Australia United States","distributed_by":"StudioCanal (Australia) Shout! Factory (United States) Enchanted Animation (United Kingdom)","Plot":"This is the town of Greenpatch in Australia, Blinky Bill (Ryan Kwanten) tells the story about his father, Bill Koala (Richard Roxburgh) to rescue the animals, he and his wife Betty Koala (Deborah Mailman) say goodbye when Blinky's dad tells his son he went to the sea of white dragons to look after to his mum and he'll be back soon. Then Blinky and his friends Splodge, Robert, and Marcia see Mayor Cranklepot the Goanna (Barry Otto) with the fruit bombs at the town but Betty warns Blinky worried about Cranklepot to be good and off they go, then Cranklepot tells what he found at Greenpatch and he has the goal to become the new king and rename Greenpatch to \"Goannasburg\", but Blinky caused the disaster of destroying a Statue and Cranklepot chases Blinky who heads to the big rainforest. Then Blinky saw the mark that his dad left but Cranklepot grabs him back to his house to his mother, Cranklepot tells Blinky to return first thing tomorrow where he'll be sealing up his place from the outside world and he turn their tree in this his castle and to start packing, when he came back they better be out, Betty expresses anger at Blinky and made him promise to be good to his friend Marcia, but Blinky tells her to go save his father as Cranky will shut down the valley and they will be cast off at the sea of white dragons but his mom tells her son that his father's not out there in the desert and she has been begging to go. but Blinky feels very sad and crying that he'll never see him again and he never gives up and he ran back to his room, then in his bedroom Betty, knocking the door, she tells him to give him the message but Blinky is not listening to his mom, he's been very upset but he saw him made it of the sea of white dragons painted on the wall. The next day Blinky goes to find his father in the outback, when he arrived at the Koala Joe's Roadhouse to see what to eat those gumnuts, he decides to get some water then he hears banging on the door, he saw the feral cat named Sir Claude (Rufus Sewell) to catch a meat eater koala, but Blinky rides the van on the road.On the van Blinky meets a female little koala on the cage bound to the zoo but he rescues her from the humans but the cage is broken, but the female little koala manages to stop the van but it passes away because of what he did, she bullies him and she sits down on the ground. Blinky knows what to do, take Nutsy (Robin McLeavy) to the zoo in the tunnel but Sir Claude saw the broken cage and he has to follow them. Back at Greenpatch Blinky's friends Splodge, Robert, and Marcia take care of his mother. Blinky and Nutsy when climbing up the top of those rocks they went walking behind these walls and saw the view of the Australian landscape Nutsy tells him he was lost but then they meet the frill-necked lizard named Jacko (David Wenham) to help Nutsy to go the zoo and his dad at the sea of white dragons and he has to hit the trail but Sir Claude arrives complaining about his tail and he smacks Jacko and he saw Blinky with Nutsy and he tries to kill the koalas but Blinky, Nutsy, and Jacko escape on the Rockslide on the other bit of her cage to leave this to walk adventures. Far away across the outback they see that the directions they went are the right way and Blinky goes to the left way and then they were tired and scared by low voice laughter. Back at Greenpatch Betty sees Blinky in his bedroom behind this door, she knows that her son feels upset to go looking for his father and Blinky tells his mother to come here to the door but is not Blinky it's only Blinky's friend Robert when Splodge and Marcia came in they were playing a trick on her who demanded to know where is Blinky.Blinky is having a nightmare, the low voice to take his new friends to his clubhouse his name is Wombo the Wombat (Barry Humphries) to help find his father at the sea of white dragons then the two emus named Beryl and Cheryl (Toni Collette) offer to take a ride on their backs and on the way across the deserts. Back at Greenpatch Betty tells Cranklepot Blinky has gone bushed and she has to find him Cranklepot knows that naughty little koala went across the outback except Blinky's dad and she angrily yelled at him this is it and she went away. At the deserts Blinky, Nutsy, Jacko, Beryl and Cheryl play for such fun for a race. Then Sir Claude tells Wombo about the koalas with the emus and he knocked his hideout. At the waterhole Beryl and Cheryl were asleep with Jacko, Nutsy told Blinky what did, he ran away from home from his mom, Blinky tells Nutsy about his parents, Nutsy tells him her mom and dad live in the trees but the bushfires destroyed them and she headed to the zoo for her, Blinky knows the room for her at Greenpatch. Then they arrived at croc canyon to wave goodbye to their emu friends. Betty arrives at Wombo's Hideout, she can't find her son to rescue his father, Wombo and Betty to have a ride in to old car with the roof tops across the desert. At croc canyon Blinky, Nutsy, and Jacko saw that is his dad had been here but the Saltwater Crocodiles chase them on the rocks but Sir Claude arrives at croc canyon to chase them again but he falls over to the crocs and chased away, Blinky urges to see his dad but his rope on the bag snapped and he saw that his dad on the skeleton he died and Blinky feels like crying, Nutsy and Jacko have to go to sleep by the moon, Blinky did really terribly and he feels sorry to Nutsy and he has to take her to the zoo.The next day Blinky and Jacko take Nutsy to the zoo. Beryl and Cheryl sees Wombo and Betty and know where Kid are. Then they arrive at the zoo, Blinky and Jacko say goodbye to Nutsy to great adventures but she is not scare of heights, she can be in the wild with Blinky and his friends at Greenpatch then Blinky has been koala napped by the zoo keeper but Nutsy and Jacko come to saved him. The zoo keeper brought Blinky in the cage to join the other koalas then he saw the parrot was sleeping, he tries to get out but he hears the stranger in the big cage to zip him off but tells him to zip it and he want to get back to his homeland Greenpatch, the stranger hears what that little guy was saying Blinky hears what the stranger thinks, he is his father, Blinky's dad was alive and he tells his son he went to sea of white dragons, its called croc canyon that his mother was with him but Blinky tells his father Cranklepot is taking over Greenpatch and Blinky feels upset at him to promise his mother to come home, Blinky's dad tries to promise. Then Blinky has an idea to bust out of here to paws in with his father as a team, as they are free Blinky tells his father to meet Blinky's new friends Nutsy and Jacko but then the parrot saw the koalas escape they have to head outside, then Blinky tells Nutsy, and Bill to have a plan to fly just like the plane but Jacko is with the parrot named Jorge to really fly away but Sir Claude arrives at the zoo, he saw Blinky's father is the tail biter and he tries to kill him but Blinky saves his dad and he's being chased but Blinky's dad, Nutsy, Jacko, and Jorge are on the flyer with the helping hands of two emu friends Beryl and Cheryl who arrive at the zoo but they cannot fly to rescue Blinky from that crazy wild cat, Sir Claude smashed Blinky and he tries to kill him but Betty arrives at the zoo to get his paws off her son and she knocks him out, Blinky hugs his mother for saving his life and Nutsy got the rope for them, Blinky tells his mother to meet his new friend Nutsy. But Blinky is grabbed by Sir Claude and his friends try to save him, but he tells him who needs friends and got nine lives but Sir Claude has been eaten by a crocodile. Then Blinky, Betty and Nutsy head back to the flyer with Jacko, Bill, Jorge, Beryl and Cheryl but Blinky's dad tells his wife to promise to never leave home again and got Blinky to starboard on the wheel, he sees his old friend Wombo on the old car to grab the rope on the flyer Blinky, his parents and his friends fly all the way home to save Greenpatch.Back at Greenpatch Cranklepot tells other animals to bow to the new king, But Blinky's dad with his family and Blinky's friends with the fruit bombs arrive, Cranklepot saw Blinky's dad was alive known as William and William tells his son Blinky to ready to smash the fruit bombs to him Blinky smiles at his father and they smash him and Blinky smiles on the happy ending.In the end-credits, Cranklepot swings a bilby but he tries to escape but Jorge tells him \"the kid said higher,\" and the bilbies, birds and joeys say \"my turn,\" and Cranklepot groans. Setting the stages for Blinky Bill 2: Sir Claude's Revenge.","language":"English","Reception":"Blinky Bill: The Movie was critically acclaimed, earning an 80% approval rating on Rotten Tomatoes. Audiences and fans of the original book and the animated series however gave mixed to negative reactions to the film.","box_office":"$258,353[1]","production_company":"Assemblage Entertainment Flying Bark Productions Telegael","directed_by":"Deane Taylor","blinky_bill_the_movie":"Theatrical film poster","release_dates":"17 September 2015 (2015-09-17)|||||","produced_by":"Jim Ballantine Barbara Stephen","starring":"Ryan Kwanten Rufus Sewell Toni Collette David Wenham Deborah Mailman Richard Roxburgh Robin McLeavy Barry Otto Barry Humphries","running_time":"93 minutes","music_by":"Dale Cornelius","edited_by":"Simon Klaebe","written_by":"Fin Edquist"}