{"country":"United Kingdom","distributed_by":"Pathé Pictures International","Plot":"Six years after being jailed for killing Trife, Sam is released from prison. During the course of the film, it is revealed that Sam has changed dramatically and is not the person he was six years ago. He has learnt from his mistakes and is still haunted by his crime. Sam is later on a bus and witnesses two occupants give their seat up to a woman. He also sees another man staring at him. Later, when he visits Trife's grave at Oak Park cemetery, the man he saw earlier sits next to him. He says his name is Jehvon and starts a conversation with him. Later in the conversation, the man brings up the murder and attacks Sam. He turns out to be Trife's cousin, and he wounds Sam. However, Sam is later able to gain control of the fight and beats him into submission. Trife's cousin informs him that he will not survive the day, as many people want him dead – and will stop at nothing, not even harming his family. Sam, troubled by these claims, goes to his house and breaks in. However, no one is home, so Sam bandages up his wound. He then has a flashback to his prison days which reveals he helped a high ranking prison mate escape an attack from Trife's uncle, Curtis.Sam then goes into a room, goes through the drawers and picks up a gun which he discards, then leaves. Sam later visits Claire and asks for information regarding his mother, saying he won't hurt her, however Claire says she hasn't seen his mother in over a year, and also tells him that Mooney is at university, and that that's all she knows. Then Claire's partner Hayden arrives, and attacks Sam when he realises who he is, berating him for all the emotional damage he caused Claire six years ago. Sam then visits Mooney and asks for information regarding anyone who might hurt his family. He says he has changed, however Mooney reveals that he should be wary of Jay as he has changed for the worse. He also tells him that Sam inspired him to study Law, so he can make sure people like him don't go free in 6 years. Sam then speaks to Becky's cousin Lexi, hoping that she might have some information.The scene then shifts to Omen, with Dabs and Henry robbing a car in broad daylight. They take what they have stolen to Ike's house to sell and are given money by Ike, who leaves to sort out some business. It is revealed that his partner is Andreas, whose face was cut in the first film by Trife. Ike tells a customer that even Andreas had to learn the hard way. Andreas remarks that he got what he deserved, as he tested Curtis's patience and suffered the consequences. Then Ike burns his customer's arm and beats him up to teach him a lesson for making money behind his back on his gear. Jay is later seen selling drugs to customers, however when a rich one tests him, Jay robs him and his fiancée and humiliates him. Just then he receives a call from Jehvon informing him that Sam is out, so he lets the rich man and his fiancée go. He goes to Ike's house, seeking help about Sam, so Ike gives him a gun. Then Andreas suggests hiring some of the teenagers to kill Sam. Dabs is called into the room and eventually agrees to do it for £6,000.Jay makes it clear that the others must not see Sam's face when the murder happens. Dabs tells Henry about the plan. Not willing to kill a man, Henry tells Dabs not to go through with it. A scuffle happens and Dabs hits Henry over the head with a brick. Later, Dabs and Blammy meet Omen and tell him about the job. Omen agrees after Dabs lies and says that the target was the one who hurt Henry. Sam and Lexi meet and Sam learns that she was gang raped years ago, which led her into drug addiction because as they are having sex she pushes him away. As he gets up she sees various scars on his back and it is revealed they were given to him by Trife's uncle as revenge and when Lexi touches them he leaves in anger. Jay meets with Mooney and his girlfriend in a café and tells Robert that he could have prevented Trife's death, convincing him to help Jay track down Sam. But shortly afterwards, Robert tells Jay that he needs to move on.Later, the teenage hit-men see Sam walking through a park and tackle him to the ground. With Sam's face to the floor, Dabs tells Omen to stab him, but Omen insists on seeing his face first. It is then revealed that Omen is Sam's brother. He refuses to kill his own brother, and realises that Dabs knew who it was. Sam is about to kill Dabs, but has a flashback to the murder and relents, just punching Dabs and leaving with the two teenagers. Meanwhile, Jay goes round to Lexi's flat and we find out he is her dealer, and that Lexi was setting up Sam by bringing him back to her flat. Sam phones the man he spoke to outside the prison and asks for the favour the man promised him earlier in the film. Sam walks down a street and mugs a couple at gunpoint, but apologises for doing it.He uses the stolen phone to call the police about an armed robbery, telling them the criminal is going into the house he is about to enter. Using the items he stole, he goes into Ike's house pretending to want to sell them. Meanwhile, Sam's contact phones Curtis and tells him where Sam is. While Sam is holding them all at gun point, the armed police show up and arrest Ike, Andreas, and Curtis, but Sam escapes. On the way home, Sam is attacked by Jay. Jay holds him at gunpoint and a fight ensues but during the fight Sam realises that Jay is just like he was six years ago and cannot bring himself to commit murder. Safe in the knowledge that Jay is not really dangerous, he leaves the fight.As all this happens, Sam, having nowhere to go, wanders aimlessly through the streets. He finds that Lexi has left a message on his phone asking him to spend time with her, and makes his way to her flat. He struggles to get there due to all the injuries he received during the past day, though he manages to make it to Lexi's flat, and the two smile as he enters.","language":"English","adulthood":"Theatrical release poster","box_office":"£3,347,811","cinematography":"Brian Tufano","production_company":"Cipher Films Limelight","directed_by":"Noel Clarke","Soundtrack":"Adulthood: Music from the Motion Picture was released on 30 June 2008 by Altered Ego.","release_dates":"20 June 2008 (2008-06-20) (United Kingdom)|||||","produced_by":"Amir Madani","starring":"Noel Clarke Scarlett Alice Johnson Adam Deacon Jacob Anderson Femi Oyeniran Red Madrell Ben Drew Nathan Constance and Danny Dyer","running_time":"99 minutes","Sequel":"A sequel called 'Brotherhood' is currently in production, and to be released in 2016.","music_by":"Chad Hobson","edited_by":"Tom Hemmings","written_by":"Noel Clarke"}