{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Working with his three friends at their new software development company Skullbocks, Stanford graduate Milo Hoffman is contacted by CEO Gary Winston of NURV (Never Underestimate Radical Vision) for a very attractive programming position: a fat paycheck, an almost-unrestrained working environment, and extensive creative control over his work. Accepting Winston's offer, Hoffman and his girlfriend, Alice Poulson, move to NURV headquarters in Portland, Oregon.Despite development of the flagship product (Synapse, a worldwide media distribution network) being well on schedule, Hoffman soon becomes suspicious of the excellent source code Winston personally provides to him, seemingly when needed most, while refusing to divulge the code's origin.After his best friend, Teddy Chin, is murdered, Hoffman discovers that NURV is stealing the code they need from programmers around the world—including Chin—and then killing them to cover their tracks. Hoffman learns that not only does NURV employ an extensive surveillance system to observe and steal code, the company has infiltrated the Justice Department and most of the mainstream media. Even his girlfriend is a plant, an ex-con hired by the company to manipulate him.While searching through a secret NURV database containing surveillance dossiers on employees, he finds that the company has information of a very personal nature about a friend and co-worker, Lisa Calighan. When he reveals to her that the company has this information, she agrees to help him expose NURV's crimes to the world. Coordinating with Brian Bissel, one of Hoffman's friends from his old startup, they plan to use a local public-access television station to hijack Synapse and broadcast their charges against NURV to the world. However, Calighan turns out to be a double agent, foils Hoffman's plan, and turns him over to Winston.Hoffman had already confronted Poulson and convinced her to side with him against Winston and NURV. When it became clear that Hoffman had not succeeded, a backup plan is put into motion by Poulson, the fourth member of Skullbocks, and the incorruptible internal security firm hired by NURV. As Winston prepares to kill Hoffman, the second team successfully usurps one of NURV's own work centers—\"Building 21\"—and transmits the incriminating evidence as well as the Synapse code. Calighan, Winston and his entourage are publicly arrested for their crimes. After parting ways with the redeemed Poulson, Hoffman rejoins Skullbocks.","Allusions":"Roger Ebert found Gary Winston to be a thinly disguised pastiche of Bill Gates; so much so that he was \"surprised [the writers] didn't protect against libel by having the villain wear a name tag saying, 'Hi! I'm not Bill!'\" Similarly, Ebert felt NURV \"seems a whole lot like Microsoft\".[8] Ebert wasn't alone making these observations; parallels between the fictional and real-world software giants were also drawn by Lisa Bowman of ZDNet UK,[9] James Berardinelli of ReelViews,[10] and Rita Kempley of The Washington Post.[11] Microsoft spokesman Jim Cullinan said, \"From the trailers, we couldn't tell if the movie was about [America Online] or Oracle.\"[9]","language":"English","Reception":"Antitrust received mainly negative reviews and has a rotten rating of 24% on Rotten Tomatoes based on 106 reviews with an average rating of 4 out of 10. The consensus states \"Due to its use of cliched and ludicrous plot devices, this thriller is more predictable than suspenseful. Also, the acting is bad.\"[27] The film also has a score of 31 out 100 based on 29 reviews on Metacritic.[28]Roger Ebert of the Chicago sun-times gave the film two stars out of four.[8] Linux.com appreciated the film's open-source message but felt the film overall was lackluster, saying \"'AntiTrust' is probably worth a $7.50 ticket on a night when you've got nothing else planned.\"[29]James Keith La Croix of Detroit's Metro Times gave the film four stars, impressed that \"Antitrust is a thriller that actually thrills.\"[30]The film won both the Golden Goblet for \"Best Feature Film\" and \"Best Director\" for Howitt at the 2001 Shanghai International Film Festival.[31]","box_office":"$18,195,610[3]","cinematography":"John Bailey","production_company":"Industry Entertainment Hyde Park Entertainment","directed_by":"Peter Howitt","Home media":"Antitrust was released as a \"Special Edition\" DVD on May 15, 2001[32] and on VHS on December 26, 2001.[33] The DVD features audio commentary by the director and editor, an exclusive documentary, deleted scenes and alternative opening and closing sequences with director's commentary, the music video for \"When It All Goes Wrong Again\" (which is played over the beginning of the closing credits) by Everclear, and the original theatrical trailer. The DVD was re-released August 1, 2006.[34]","antitrust":"Theatrical release poster","release_dates":"January 12, 2001 (2001-01-12)|||||","Production":"Principal photography for Antitrust took place in Vancouver, British Columbia, and California.[6]Stanley Park in Vancouver served as the grounds for Gary Winston's house, although the gate house at its entrance was faux. The exterior of Winston's house itself was wholly computer-generated; only the paved walkway and body of water in the background are physically present in the park.[12] For later shots of Winston and Hoffman walking along a beach near the house, the CG house was placed in the background of Bowen Island, the shooting location.[13] Catherine Hardwicke designed the interior sets for Winston's house, which featured several different units, or \"pods\", e.g., personal, work, and recreation units. No scenes take place in any of the personal areas, however; only public areas made it to the screen.[14] While the digital paintings in Winston's home were created with green screen technology, the concept was based on technology that was already available in the real world. The characters even refer to Bill Gates' house which, in real life, had such art.[15] The paintings which appeared for Hoffman were of a cartoon character, \"Alien Kitty\", developed by Floyd Hughes specifically for the film.[16][17]Simon Fraser University's Burnaby campus stood in for external shots of NURV headquarters.[18][19]The Chan Centre for the Performing Arts at the University of British Columbia (UBC) was used for several internal locations. The centre's foyer area became the NURV canteen; the set decoration for which was inspired by Apple's canteen, which the producers saw during a visit to their corporate headquarters.[20] The inside of the Chan—used for concerts—served as the shape for \"The Egg\", or \"The NURV Center\", where Hoffman's cubicle is located.[21] Described as \"a big surfboard freak\" by Director Peter Howitt, Production Designer Catherine Hardwicke surrounded \"The Egg\" set with surfboards mounted to the walls; \"The idea was to make NURV a very cool looking place.\"[19][22] Both sets for NURV's Building 21 were also on UBC's campus. The internal set was an art gallery on campus, while the exterior was built for the film on the university's grounds. According to Howitt, UBC students kept attempting to steal the Building 21 set pieces.[23]Hoffman and Poulson's new home—a real house in Vancouver—was a \"very tight\" shooting location and a very rigorous first week for shooting because, as opposed to a set, the crew could not move the walls.[24] The painting in the living room is the product of a young Vancouver artist, and was purchased by Howitt as his first piece of art.[25]The new Skullbocks office was a real loft, also in Vancouver, on Beatty Street.[26]Antitrust's pro–open source story excited industry leaders and professionals with the prospects of expanding the public's awareness and knowledge level of the availability of open-source software. The film heavily features Linux and its community, using screenshots of the Gnome desktop, consulting Linux professionals, as well as cameos by Miguel de Icaza and Scott McNealy (the latter appearing in the film's trailers). Jon Hall, executive director of Linux International and consultant on the film said \"[Antitrust] is a way of bringing the concept of open source and the fact that there is an alternative to the general public, who often don't even know that there is one.\"[9]Despite the film's message about open source computing, MGM did not follow through with their marketing: the official website for Antitrust featured some videotaped interviews which were only available in Apple's proprietary QuickTime format.[9]","produced_by":"David Hoberman Ashok Amritraj C.O. Erickson Julia Chasman[1]","starring":"Ryan Phillippe Tim Robbins Rachael Leigh Cook Claire Forlani","running_time":"109 minutes[2]","music_by":"Don Davis","edited_by":"Zach Staenberg","written_by":"Howard Franklin"}