{"based_on":"Characters by Dick King-Smith","country":"Australia United States","distributed_by":"Universal Pictures","Plot":"Months later, Babe and his master Arthur Hoggett are given a welcome home parade after Babe's success as a \"sheepdog\". One day, Babe inadvertently causes an accident to befall Arthur, who ends up in the hospital. Esme is unsuccessful tending the farm on her own. Soon, two men from the bank arrive to tell Esme, that she and Arthur have not paid their rent on time, and at the end of the month, Esme and Arthur will soon be evicted from their farm. Among the many letters from their fans, Esme locates one saying that if she enters Babe in a sheepdog herding contest, held at a fair far away, she will win a large amount of money. She decides to enter Babe and they leave the farm together.At the airport in the city of Metropolis, a sniffer dog falsely detects that Babe and Esme are accused of carrying illegal substances. Airport security officers interrogate them, causing them to miss their connecting flight. An airport cleaner tells them about a hotel that is suitable for accommodating animals, so Esme and Babe go there. While Esme runs an errand, Babe chases a black and white capuchin monkey named Tug after he steals Esme's suitcase. Fleeing into a hotel room, Babe follows it and meets three clothed chimpanzees named Bob, Zootie and Easy, as well as Thelonius, an orangutan butler for the landlady's elderly uncle Fugly Floom (Mickey Rooney), a clown who kidnaps Babe to use in his act. Babe initially refuses, but accepts when the chimps mention a reward he'll receive after doing the act. When Esme returns, Fugly tricks her into thinking that Babe ran off into the city. Esme leaves to look for Babe, but ends up getting arrested after causing an uproar with some thugs. Fugly performs his clown act in a hospital, but Babe accidentally trips him and he throws a flaming torch into the stage curtains which catch fire, forcing everyone out.The next morning, Fugly goes to the hospital in a food coma escorted by the landlady. Babe is in his room, hungry and waiting for Esme to return. That night, the chimps try to steal food from a store and use Babe to distract two dogs, who chase Babe around the city. Babe falls into a river and swims away, but returns and saves one of the dogs from drowning. The dog becomes friends with Babe, and Babe invites him and the other homeless animals into the hotel. They share the food around and then sing, alerting the duck Ferdinand who was searching for Babe. Zootie gives birth to twins, and the animals celebrate. Animal control officers are called to capture all the animals and take them away, except for Babe, Tug, Ferdinand and Flealick. Esme is released from jail by the judge after explaining her situation. That night, Babe, Tug, Flealick, and Ferdinand sneak into animal control and open their friends' cages. Esme returns to the hotel and reunites with the landlady, who is mourning her uncle's death, and tells Esme that her neighbor Hortense was the one who got the animals taken away. Esme and the landlady confront Hortense to find out where the animals have been sent, then set off to find them.Esme and the landlady track the animals to a charity dinner in the hospital's ballroom, where they battle the chefs and waiters with fire extinguishers. In the epilogue, the landlady sells the hotel and gives the money to Esme so she can save the farm. The landlady and the animals come to stay at the farm, where Arthur has recovered from his injury. Arthur proudly watches Babe saying \"That'll do pig, that'll do.\"","babe:_pig_in_the_city":"Theatrical release poster","language":"English","Reception":"The movie received a 62% \"Fresh\" rating from Rotten Tomatoes.[3] Film critic Gene Siskel named it as his choice for the best movie of 1998, over more adult-oriented films like Saving Private Ryan, Life Is Beautiful and Shakespeare in Love; Siskel also felt it was better than the first Babe film.[4][5] Roger Ebert gave the film four out of four stars and saying it was \"more magical than the original Babe.\"[6]In the decades since Babe: Pig in the City's release, the movie has developed a cult following.[2] Tom Waits expressed appreciation for the film during a 2010 interview with Mojo Magazine.[7] Radio personality/podcaster Jesse Thorn has also praised the film.[8]","box_office":"$69.1 million","cinematography":"Andrew Lesnie","production_company":"Kennedy Miller Productions","directed_by":"George Miller","Awards":"The film was nominated for an Academy Award for Best Original Song in 1998.","Soundtrack":"The musical score for Babe: Pig in the City was composed by Nigel Westlake, who wrote the music for the first film. A soundtrack album was released on 24 November 1998 by Geffen Records featuring Westlake's score as well as sound clips taken from film. The soundtrack also includes source music such as \"Chattanooga Choo Choo\" by Glenn Miller and \"That's Amore\" by Dean Martin. Additional tracks include the Academy Award-nominated theme song \"That'll Do\" and a song sung by Elizabeth Daily, the voice of Babe.","narrated_by":"Roscoe Lee Browne","release_dates":"November 25, 1998 (1998-11-25) (United States of America)|||||","Production":"Christine Cavanaugh, who played Babe in the first movie, was approached to reprise her role, but declined because of personal matters[citation needed] and before her retirement and her death in 2014 and was replaced by her Rugrats co-star Elizabeth Daily, who voiced Tommy Pickles.Prior to the film's theatrical release, it was originally rated PG by the MPAA. The TV spots for the film's theatrical release mentioned this rating, as did a promotional poster. By the time the film was released in theaters it had been re-rated as G (like the first film), based on a final edit that removed most of the dog violence (but retaining a shot that shows the bull terrier pushing down Babe into the river, and a controversial shot of the bull terrier hanging on the chain over water by his neck)[citation needed]. This was Universal's last theatrically-released feature-length film to be rated G by the MPAA until 2006's Curious George. As of 2007, Babe: Pig in the City and Mr. Bean's Holiday are Universal's last two theatrically released live-action films to be rated G by the MPAA. However, when the film aired on Superstation WGN on 18 November 2007 and AMC on 9 December 2007, the shot that shows Ferdinand almost getting shot by humans was cut.[citation needed]Babe: Pig in the City takes place in an imaginative, fantasy-like metropolis. It notably resembles Oz but is in modern-day form. The city has numerous styles of architecture from around the world. It also has a variety of waterways, noticeable by the hotel at which Babe stays. The downtown area appears to be situated on an island not dissimilar to Manhattan Island. The Downtown Skyline features numerous skyscrapers such as the World Trade Center, the Sears Tower, the Chrysler Building, the Empire State Building,the IDS Center, the MetLife Building, the Sydney Opera House, the Hollywood sign, the Golden Gate Bridge, the Fernsehturm Berlin, Big Ben, Red Square, the Statue of Liberty, the Eiffel Tower, the Christ the Redeemer (statue), and many other landmarks.The DVD covers feature a similar but different skyline, keeping the World Trade Center, the Golden Gate Bridge, Big Ben, the Sydney Opera House, and Red Square. Several skyscrapers added include 40 Wall Street (Two of them), the Empire State Building, 500 5th Avenue, the Flatiron Building, the World Financial Center, and several Los Angeles skyscrapers including the U.S. Bank Tower. The river near the hotel is similar to the canals of Venice, Italy, or Amsterdam, Netherlands.","produced_by":"Doug Mitchell George Miller Bill Miller","starring":"Magda Szubanski James Cromwell Mary Stein Elizabeth Daily (voice) Danny Mann (voice) Steven Wright (voice)","running_time":"96 minutes","music_by":"Nigel Westlake Randy Newman (songs)","edited_by":"Jay Friedkin Margaret Sixel","written_by":"George Miller Judy Morris Mark Lamprell","budget":"$90 million[1]"}