{"Commentary":"David and Diana Garland argue that, \"Taking remarkable license with the story, the screen writers changed Bathsheba from the one who is ogled by David into David's stalker.\" They go on to suggest that \"the movie David and Bathsheba, written, directed and produced by males, makes the cinematic Bathsheba conform to male fantasies about women.\"[10]However, in giving Bathsheba a more active role, Adele Reinhartz found that \"it reflects tensions and questions about gender identity in America in the aftermath of World War II, when women had entered the work force in large numbers and experienced a greater degree of independence and economic self-sufficiency. ...[Bathsheba] is not satisfied in the role of neglected wife and decides for herself what to do about it.\"[11] Susan Hayward was later quoted as having asked why the film was not called \"Bathsheba and David\".[12]","country":"United States","distributed_by":"20th Century-Fox","Plot":"King David was the second king of Israel and this film is based on the second Old Testament book of Samuel from the Bible. When the Ark of the Covenant is brought to Jerusalem, a soldier reaches out to steady it and is struck dead. While the prophet Nathan declares this the will of God, a skeptical David pronounces it the result of a combination of heat-stroke and too much wine. The scene is echoed later when a repentant David, seeking relief from a drought affecting his people also reached out to touch the Ark. Screenwriter Dunne said he \"left it to the audience to decide if the blessed rain came as the result of divine intervention or simply of a low-pressure system moving in from the Mediterranean.\"[3]","language":"English","Reception":"The film earned an estimated $7 million at the US box office in 1951, making it the most popular movie of the year.[6]The New York Times described the film as \"a reverential and sometimes majestic treatment of chronicles that have lived three millenia.[7] It praises Dunne's screenplay and Peck's \"authoritative performance\", while noting the part largely overshadows the rest of the cast.The film provoked riots in Singapore over what the Muslim community considered an unflattering portrait of David, considered an important prophet in Islam, as a hedonist susceptible to sexual overtures.[8]Jon Solomon found the film's first half rather slow paced, but gained momentum, and Peck \"convincing as a once-heroic monarch who must face and angry constituency and atone for his sins.\" [9] He noted that this was different from other biblical epics in that the protagonist faced a religious and philosophical issue rather than the overdone military or physical crisis.","box_office":"$7.1 million (est. US/ Canada rentals)[2]","cinematography":"Leon Shamroy","directed_by":"Henry King","Awards":"The film was nominated for five Academy Awards:[13]","david_and_bathsheba":"Original film poster","release_dates":"August 10, 1951 (1951-08-10)|||||","Production":"While Twentieth Century-Fox Film Corp. owned the rights to the 1943 book David written by Duff Cooper, the film is not based on that book. Zanuck also owned the rights to a 1947 Broadway play called \"Bathsheba\". Seeing the success of C. B. DeMille's Samson and Delilah, Zanuck commissioned Philip Dunne to write a script based on King David. Dunne conceived it as a modern-type play exploring the corruption of absolute power. The film is noticeably devoid of the epic battles and panoramas frequently seen in biblical movies.Zanuck opted to use stars already under contract to 20th Century-Fox. The production of the film started on November 24, 1950 and was completed in January 1951 (with some additional material shot in February 1951). The film premiered first in New York City August 14, and later in Los Angeles August 30, before opening wide in September 1951.[4] It was shot entirely in Nogales, Arizona.The musical score was by Alfred Newman, who, for the bucolic scene with the shepherd boy, used a solo oboe in the Lydian mode, drawing on long established conventions linking the solo oboe with pastoral scenes and the shepherd's pipe. To underscore David's guilt-ridden turmoil in the Mount Gilboa scene, Newman resorted to a vibraphone, which Miklós Rózsa used in scoring Peck's popular 1945 Spellbound, in which he played a no less disturbed patient suffering from amnesia.[5]","produced_by":"Darryl F. Zanuck","starring":"Gregory Peck Susan Hayward Raymond Massey Kieron Moore James Robertson Justice","running_time":"123 minutes","music_by":"Alfred Newman Edward Powell","edited_by":"Barbara McLean","written_by":"Philip Dunne","budget":"$2.17 million[1]"}