{"based_on":"Candy  by Terry Southern and Mason Hoffenberg","country":"France Italy United States","Screen debut":"This was the solo film acting debut of then Beatle Ringo Starr; Starr had previously appeared alongside his bandmates John Lennon, Paul McCartney, and George Harrison in A Hard Day's Night (1964), Help! (1965) and Magical Mystery Tour (1967). Starr continued appearing in movie roles through the 1960s, 1970s, and 1980s — including another film based on a Southern novel, The Magic Christian — while he continued his music career.","distributed_by":"Cinerama Releasing","screenplay_by":"Buck Henry","candy":"original film poster","Plot":"High school student Candy (former Miss Teen Sweden Ewa Aulin) seemingly descends to Earth from space. In the relatively simple plot, she naively endures an escalating series of situations in which her oblivious allure[clarification needed] triggers satirical porn-film-like encounters. Roger Ebert wrote, \"Candy caroms from one man to another like a nympho in a pinball machine, and the characters she encounters are improbable enough to establish Terry Southern's boredom with the conventions of pornography.\"[3]In school, her father (John Astin) is also her teacher. At a poetry recital, eccentric poet McPhisto (Richard Burton) offers Candy a ride home in his limousine. At her home, McPhisto drunkenly waxes boisterously poetic, arousing Candy and her gardener Emmanuel (Ringo Starr) into sex. Scandalized, she and her family escape from Emmanuel's three vengeful sisters and head for New York, where she embarks on a psychedelic journey during which she meets a number of strange people, including a sex-starved military general (Walter Matthau), a doctor who performs public operations (James Coburn), a hunchback (Charles Aznavour), an obsessed underground filmmaker (Enrico Maria Salerno) and a fake Indian guru (Marlon Brando). As the film ends, she meets a wise guru in an Indian temple (who turns out to be her brain-damaged father in disguise), revisits some of the characters she met in the film, then wanders off into the desert before returning to outer space.","language":"English","Reception":"Candy was one of many psychedelic movies that appeared as the '60s ended, along with Yellow Submarine, The Trip, Psych-Out, and Head. The film opened to mixed box office, but later became a cult classic from the psychedelic years of film. It was the 18th highest grossing film of 1968.According to Variety the film earned North American rentals of $7.3 million, but because of costs (including over $1 million paid out in participation fees), recorded an overall loss of $25,000.[1] It was the 12th most popular movie at the UK box office in 1969.[4]Reviews were generally positive with a few misgivings: the film rates 80% at the Rotten Tomatoes review aggregator.[5] In a review representative of most professional reviewers at the time, Roger Ebert found it \"a lot better than you might expect\" but missed the \"anarchy, the abandon, of Terry Southern's novel\".[3] Renata Adler decried \"its relentless, crawling, bloody lack of talent\".[6] The film's soundtrack included \"Rock Me\", an original song from Steppenwolf which became a Top 10 hit for the band in the winter of 1969.According to Variety the film earned theatrical rentals of $7,370,000 in North America.[7]","box_office":"$16,408,286[2]","cinematography":"Giuseppe Rotunno","production_company":"ABC Pictures Corona Cinematografica Dear Film Produzione Selmur Productions","directed_by":"Christian Marquand","DVD":"Candy was released to DVD by Starz/Anchor Bay on April 10, 2001 as a Region 1 widescreen DVD.","release_dates":"December 17, 1968 (1968-12-17) (United States)|||||","produced_by":"Robert Haggiag Selig J. Seligman Peter Zoref","starring":"Marlon Brando Ewa Aulin John Astin Charles Aznavour Richard Burton James Coburn John Huston Ringo Starr Elsa Martinelli Enrico Maria Salerno","running_time":"124 minutes","music_by":"Dave Grusin","edited_by":"Giancarlo Cappelli Frank Santillo","budget":"$2.72 million[1]"}