{"based_on":"Viy  by Nikolai Gogol[1]","country":"Italy[1]","distributed_by":"Unidis[1]","screenplay_by":"Ennio De Concini|Mario Serandrei|Uncredited:|Mario Bava|Marcello Coscia|Dino De Palma[1]|","black_sunday":"Original 1960 Italian film poster","Legacy":"According to Tim Lucas, Black Sunday has had an \"almost incalculable influence\" on artists and filmmakers. The film's opening inquisition sequence was a strong inspiration for many similar scenes appearing in such movies as The Brainiac (1961), La cripta el l'incubo (U.S. title: Terror in the Crypt) (1963), Bloody Pit of Horror (1965), and Michael Reeves's The She Beast (1966).[6] Francis Ford Coppola's 1992 film Bram Stoker's Dracula recreates several scenes from Black Sunday nearly exactly as they were filmed, in homage to Bava's film.[27] Roman Coppola has cited Black Sunday as an influence on his father's film.[28]Tim Burton's Sleepy Hollow (1999) \"borrowed\" some of the film's imagery, particularly in a scene in which Lisa Marie's face is punctured by an iron maiden.[6] Burton has explicitly cited Bava's film as an inspiration, noting, \"One of the movies that remain with me probably stronger than anything is Black Sunday..There's a lot of old films – [Bava's] in particular – where the vibe and the feeling is what it's about... [t]he feeling's a mixture of eroticism, of sex, of horror and starkness of image, and to me, that is more real than what most people would consider realism in films...\"[29]In 1989, Bava's son. Lamberto Bava, made a quasi-remake of the film. While the new \"Black Sunday\" has a very similar mask torture sequence to the original, it features a completely different storyline. It was released in the U.S. as \"Demons 5: The Devil's Veil,\" although there is no connection between this and the rest of the Demons series.A number of the film's characters have appeared in Kim Newman's vampire-crossover Anno Dracula series, especially the third novel Dracula Cha Cha Cha, the main plot of which is an arranged marriage between Asa Vajda and Count Dracula.[citation needed]Captain Murphy sampled dialogue from the film's opening scene for the song \"The Ritual\" on his Duality mixtape.[citation needed]","Plot":"In Moldavia, in the year 1630, beautiful witch Asa Vajda (Barbara Steele) and her paramour Javuto (Arturo Dominici) are sentenced to death for sorcery by Asa's brother. Before being burned at the stake, Asa vows revenge and puts a curse on her brother's descendants. A metal mask with sharp spikes on the inside is placed over the witch's face and hammered into her flesh.Two centuries later, Dr. Thomas Kruvajan (Andrea Checchi) and his assistant Dr. Andre Gorobec (John Richardson), are traveling through Moldavia en route to a medical conference when one of the wheels of their carriage is broken, requiring immediate repair. While waiting for their coachman to fix it, the two wander into a nearby ancient crypt and discover Asa's tomb. Observing her death mask through a glass panel, Kruvajan breaks the panel (and the cross above it) by accident while striking a bat. He then removes Asa's death mask revealing a partially preserved corpse that is visible underneath, her face staring out malevolently. He cuts his hand on the broken glass. Some of his blood drips onto Asa's dead face.Returning outside, Kruvajan and Gorobec meet Katia (also played by Steele). She tells them that she lives with her father, Prince Vajda (Garrani), and brother Constantine (Enrico Oliveiri) in a nearby castle that the villagers all believe is haunted. Gorobec is instantly smitten by the beautiful young woman. The two men then leave her and drive to an inn.The witch Asa is brought back to life by Kruvajan's blood. She contacts Javuto telepathically and orders him to rise from his grave. He does so and goes to Prince Vajda's castle, where Vajda holds up a crucifix to ward the reanimated corpse away. However, Vajda is so terrified by the visit that he becomes paralyzed with fear. Katia and Constantin send a servant to fetch Dr. Kruvajan, but the servant is killed before he can reach the inn. It is the evil Javuto who arrives to bring Kruvajan to the castle. Javuto leads Kruvajan to Asa's crypt, and Kruvajan watches in horror as her coffin explodes. From its ruins, the vampire-witch offers him eternal life (and a night of pleasure) and drinks his blood. By Asa's command, Kruvajan enters Vajda's room and murders him.Asa's plan is to drain Katia of her blood, believing that this act will grant her immortality. A little girl who had seen Javuto meet Kruvajan at the inn describes the dead man to Gorobec. A priest recognizes the description as being that of Javuto. The priest and Gorobec go to Javuto's grave and find Kruvajan's body inside the coffin. Realizing that he is a vampire, they kill the fiend immediately by marking him with the sign of the cross and ramming a small piece of wood through one of his eye sockets.Javuto finds Katia and takes her to Asa. Asa attempts to drink her blood but is thwarted by the crucifix around her neck. Gorobec enters the crypt to save Katia but finds Asa instead. Asa pretends to be Katia and tells Gorobec that the now weakened and unconscious Katia is really the vampire. She tells him to kill Katia immediately by staking her. He agrees but at the last possible moment he notices the crucifix she is wearing. He turns to Asa and opens her robe, revealing a fleshless skeletal frame. The priest then arrives with numerous torch-carrying villagers, and they burn Asa to death. Katia awakens from her stupor, her life and beauty restored.","language":"English Italian","Reception":"La maschera del demonio premiered in Rome during August 1960. The film was a modest success, grossing 140 million lire (approximately US $87,000), earning back nearly all of the production cost. It performed much better outside of Italy, and was particularly successful in France and the U.S.[6]Upon its theatrical release in the United States, critics generally responded with enthusiasm to Bava's film, many of whom recognized the director as a potential master of the horror genre. Variety noted, \"There is sufficient cinematography ingenuity and production flair [...] to keep an audience pleasantly unnerved.\"[5] Time said the film was \"a piece of fine Italian handiwork that atones for its ludicrous lapses with brilliant intuitions of the spectral.\"[5] The Motion Picture Herald stated that \"A classic quality permeates this gruesome, shocking, horrifying story of a vengeful, bloodthirsty vampire.\"[5] Castle of Frankenstein described the film as \"one of the best horror thrillers of recent years.\"[14] David Pirie, in The Time Out Film Guide, called the movie, \"A classic horror film [...] The exquisitely realized expressionist images of cruelty and sexual suggestion shocked audiences in the early '60s and occasioned a long-standing ban by the British censor. The visual style still impresses...\"[15] Carlos Clarens felt that \"the quality of the visual narrative was superb—the best black-and-white photography to enhance a horror movie in the past two decades. Bava also showed himself as a director of a certain promise...\"[16] Eugene Archer in The New York Times, however, hated the film, noting that \"Barbara Steele, a blank-eyed manikin with an earthbound figure and a voice from outer space, is appropriately cast as a vampire: not the Theda Bara kind, but the genuine blood-drinking variety. Mario Bava, ostensibly the director of this nonsense, allows this female Bela Lugosi to quench her thirst four times before she burns, screaming, at the stake [...] As a setting for unadulterated horror, it will leave its audiences yearning for that quiet, sunny little motel in Psycho.\"[17] Ivan Butler opined that the film \"appears to offer horror, beauty and the ludicrous in about equal proportions.\"[18]Decades after its original release, Black Sunday has continued to maintain a positive critical reputation. Pauline Kael described it as \"a rich draught of vampire's blood. With its crypts and cobwebs and eerie old castles set in batty, steamy forests, its sumptuous enough to have acquired a considerable reputation.\"[19] In The Penguin Encyclopedia of Horror and the Supernatural (1986), Timothy Sullivan wrote, \"A supremely atmospheric horror film, Black Sunday was Mario Bava's first and best directorial job, and the first of the 1960s cycle of Italian Gothic cinema [...] [The film] remains [Bava's] greatest achievement, without a doubt one of the best horror films ever made.\"[20] Phil Hardy's The Aurum Film Encyclopedia: Horror observed, \"Bava's first (and best) film as a solo director [...] The movie derives its lyrical force and indeed its sense of horror from the knowledge that a woman's sexuality cannot be eliminated and will return, bearing the scars of the violence with which it was repressed, to challenge the order of things.\"[21] Danny Peary, in his Cult Movies book, wrote, \"Black Sunday is as impressive as it is because it reveals Bava's background – almost everything is conveyed visually...It is with his camera that Bava [...] creates an atmosphere where the living and dead coexist (but not harmoniously) [...] Black Sunday convinced many of us that Mario Bava would be a force to be reckoned with in the horror field for many years to come. Unfortunately, he never made another picture half as good.\"[22] Allmovie has noted, \"Generally considered to be the foremost example of Italian gothic horror, this darkly atmospheric black-and-white chiller put director Mario Bava on the international map ... The atmosphere is so heavy and the imagery so dense that the film becomes nearly too rich in texture, but the sheer, ghastly beauty of it all is entrancing.\"[23] Glenn Erickson, in reviewing the Anchor Bay DVD release of the film, wrote, \"Mario Bava's first credited feature is still the number one film of the Italian horror renaissance, startlingly original and genuinely creepy [...] The budget may have been low, but Black Sunday is more atmospheric and cinematically active than any of Hollywood's classic horror films.\"[24] The film has an 84% favorable rating on the \"Critical Tomatometer\" at the Rotten Tomatoes website, out of nineteen internet reviewers surveyed.[25]When released in the U.S. during 1961, the film was a commercial success for AIP,...becoming the distributor's greatest financial success to that time.[6][26] It also brought Barbara Steele to the attention of genre fans and was the first of a series of horror movies she starred in over the next several years. Although she would next star in Roger Corman's The Pit and the Pendulum (1961), she returned to Italy the next year and made all of her subsequent horror titles there. While all of her genre titles have their fans, none of the films have had the same effect as \"Black Sunday.\"","box_office":"₤139 million (Italy)[1]","cinematography":"Mario Bava[1]","directed_by":"Mario Bava","Home media":"The film was released by Image Entertainment on DVD on December 14, 1999, with an aspect ratio of 1.66:1 widescreen (anamorphic), with the following edition details: audio commentary by Tim Lucas, a photo and poster gallery, and filmographies of Bava and Steele. It was re-released on April 3, 2007 by Anchor Bay, with the same features as the earlier release.On September 18, 2012, Kino Lorber released the film in the Blu-ray format, once again repeating the same special features included in the previous DVD issues.","production_companies":"Galatea Film Jolly Film[1]","release_dates":"August 11, 1960 (1960-08-11) (Italy)|||||","Production":"During 1959, Bava had assumed the directorial assignment of The Giant of Marathon from Jacques Tourneur, who left the production before most of the major sequences had been filmed. Bava, who had been that film's cinematographer, completed the film quickly and efficiently. This was not the first time Bava had been able to save a troubled movie for Marathon's production company, Galatea Film. During that same year, Bava had performed a similar salvage job on Caltiki – The Immortal Monster (1959), replacing Riccardo Freda as director after he had abandoned the picture in the middle of production. Even earlier, he had assumed the directorial role for I Vampiri (1957) after the temperamental Freda had also walked off the set of that film after only a few days. Bava did not receive director screen credit for any of his work on the three troubled Galatea films. After Bava completed Marathon, Nello Santi, the head of Galatea Film, subsequently offered him his choice of any property for his first directorial effort.[3]As a lover of Russian fantasy and horror, Bava decided to adapt Nikolai Gogol's 1865 horror story \"Viy\" into a feature film. However, the resultant screenplay (by Bava, Ennio De Concini and Mario Serandrei) in fact owed very little to Gogol at all, and seemed to be more a tribute to the atmospheric black-and-white gothic horror films of the 1930s, especially those produced by Universal Studios.[4] The script takes only the most rudimentary elements from the story—the Russian setting and the idea of a witch coming back to life—and has a completely different narrative.For the role of the evil Asa and her innocent descendant Katia, Bava noted: \"A strange type was needed, and we chose Steele from pictures.\" Bava reportedly found Steele difficult to work with. According to Bava, the actress \"was somewhat irrational, afraid of Italians. One day she refused to come to the set, because somebody told her I was using a special film-stock that made people appear naked.\"[3] Steele recalled: \"Lord alone knows I was difficult enough. I didn't like my fangs – I had them changed three times. I loathed my wig – I changed that four times. I couldn't understand Italian. I certainly didn't want to allow them to tear open my dress and expose my breasts, so they got a double that I didn't like at all, so I ended up doing it myself – drunk, barely over eighteen, embarrassed and not very easy to be around.\"[5]The production of La maschera del demonio began on 28 March 1960 at the studios of Scalera Film. The exteriors, as well as a few interiors, were shot at a rented castle in Arsoli. The final day of production was 7 May.[6]Steele never saw a complete screenplay for the film. Instead, she was simply handed the scenes she would play, and her dialogue, every morning of the production.[7] According to Steele, \"We were given the pages day to day. We had hardly any idea what was going down on that film. We had no idea of the end, or the beginning, either, not at all.\"[8]Both Steele and Dominici were originally fitted to wear sharp vampire fangs, but after only a few days of shooting, the fangs were discarded. The film's Production Manager, Armando Govoni, recalled, \"[W]hen we saw the rushes, especially in the close-ups, they looked too fake so editor Mario Serandrei cut around them.\"[6]The original Italian score by Roberto Nicolosi was issued by Digitmovies AE in 2005, together with another Nicolosi score for The Girl Who Knew Too Much. A suite from Les Baxter's score was originally released on a promotional LP by the composer, whose contents made an authorized CD debut on a 1992 release by Bay Cities. Citadel Records reissued the same material in 1997 and just like the previous release, this CD also contained a suite of music from Baron Blood, another Bava film which also received a new score by Baxter for its American version. Baxter's complete score to Black Sunday was released in 2011 by Kritzerland, whose CD contains the music in chronological order.","produced_by":"Massimo De Rita","starring":"Barbara Steele|John Richardson|Ivo Garrani|Arturo Dominici|","running_time":"87 minutes[1]","music_by":"Roberto Nicolosi[1]","edited_by":"Mario Serandrei[1]","Release":"The film premiered in Italy on 11 August 1960. In 1961 it was distributed in the USA, France, Japan, Mexico, and West Germany. In 1962 it was shown for the first time in Austria and Denmark. The film was then seen in Sweden (1963) and Finland (1964). But it was banned in the UK until June 1968 due to its violent content.[9]Samuel Z. Arkoff and James H. Nicholson, of American International Pictures, screened the Italian-language version of the film when they were visiting Rome in search of viable, inexpensive European made films to act as second features for their double-bills. They immediately recognized the film as a potential hit and bought the U.S. rights for $100,000, reportedly more than the film's budget.In order to make the film more accessible to American audiences, AIP trimmed over three minutes' worth of violence and \"objectionable\" content.[10] Sequences excised or shortened included the burning \"S\" branded into Asa's flesh, the blood spewing from the mask after it was hammered into her face, the moist eyeball impalement of Kruvajan, and the flesh peeling off Vajda's face as he burned to death in the fireplace. In the original version of the film, Asa and Javuto were brother and sister; in the AIP version, Javuto became Asa's servant. In addition, some dialogue was \"softened,\" including Asa's line, \"You, too, can find the joy and happiness of Hades!!\" AIP modified it to \"You, too, can find the joy and happiness of hating!\"[6]Roberto Nicolosi's musical score was replaced by an effective but more generic \"horror\"-sounding one by Les Baxter,[11] and the dialogue was completely redubbed into English. As the entire cast, with the exception of Checchi and Dominici, had spoken their lines in English, this was a relatively easy task. Galatea had provided AIP with their own English-language version, which had been completed by the Language Dubbers Association in Rome. However, Arkoff and Nicholson felt this version was stilted and \"technically unacceptable\", so a newly recorded English version was commissioned and produced by Titra Sound Corporation in New York. (Barbara Steele's own voice was not heard in any version).[6]AIP tested several titles for the film, including Witchcraft, The House of Fright, The Curse, Vengeance and Demoniaque, before finally entitling their shortened version Black Sunday.[6] The film premièred in the United States on 15 February 1961; it was presented as the first half of a double feature that also included Roger Corman's The Little Shop of Horrors.[12][13]Even in its truncated state, '\"Black Sunday\" was considered to contain strong material for its time. In the U.S., the AIP publicity campaign indicated that the film was suitable only for audiences over 12 (although its doubtful that this was enforced). In England, with the title '\"The Mask of Satan,\" the film was officially banned by government censors until 1968,[10] when a distributor submitted the full version under a new title, '\"Revenge of the Vampire.\" The British censor made cuts to most of the scenes of violence, and the film was not released uncut in Britain until 1992.Despite being censored, the film still had moments of very graphic (for its time) scenes of horror and violence. With bloody scenes featuring a wooden stake being rammed into a vampire's eyeball (Bava's variation on the more traditional stake through the heart), a metal mask hammered into a beautiful woman's face, and other mayhem -- the film was \"far more graphic in its depiction of murder and death than audiences had previously seen.\"[5]"}