{"based_on":"Conan the Barbarian  by Robert E. Howard","country":"United States","distributed_by":"Lionsgate","Plot":"Conan is the son of Corin, chief of a barbarian tribe. The youth is a skilled but violent warrior, who his father believes is not ready to wield his own sword. Their village is attacked by Khalar Zym, a warlord who wishes to reunite the pieces of the Mask of Acheron to revive his dead wife and conquer Hyboria. Thousands of years ago, the Mask, crafted by a group of sorcerers and used to subjugate the world, was broken into many pieces, which were scattered among the barbarian tribes. After locating Corin's piece of the mask, and murdering the entire village, Zym leaves. Conan, the only survivor, swears revenge.Years later, Conan has become a pirate but still seeks revenge. He encounters a slave colony and frees it, killing all of the slave handlers in the process. In the city of Messantia, he encounters Ela-Shan, a thief being chased by a man whom Conan recognizes as Lucius, one of Zym's soldiers from years before. He allows himself to be captured alongside Ela-Shan. Conan escapes imprisonment, kills several of the guards, and confronts Lucius, forcing him to reveal that Zym seeks a girl, the pure-blood descendant of the sorcerers of Acheron; sacrificing the descendant and using blood from the body of the girl will unleash the mask's power. Conan helps the rest of the prisoners to escape, and, in gratitude, Ela-Shan tells Conan that, if he ever needs him, Conan will find him at the City of Thieves, Argalon. Lucius is then killed by the prisoners.Zym and his daughter, the sorceress Marique, attack a monastery where they hope to find the pure-blood descendant. Sensing something is wrong, Fassir, an elderly monk, tells one of his students, Tamara, to run away and return to her birthplace. When Fassir refuses to reveal his knowledge of the descendant, Zym kills him. Marique also slays several of the priestesses. Tamara's carriage is chased by Zym's men, but Conan rescues her, kills three of her pursuers, and captures one of Zym's men, Remo. After forcing him to reveal Tamara's importance as the pure-blood, Conan catapults Remo into Zym's nearby camp, killing him.Zym and Marique confront Conan, who pretends to be interested in exchanging Tamara for gold. Conan attacks Zym, but Marique assists her father by invoking soldiers made of sand, and poisons Conan with a poison-laced boomerang sword. Tamara rescues him and they return to Conan's ship, stationed nearby, where his friend Artus helps Conan recover. The boat is attacked by Zym's men, but although they kill several of Conan's men, they are defeated. Conan orders Artus to return to Messantia with Tamara and departs to confront Zym in his kingdom. Artus tells Tamara that Conan left a map behind and she follows him, meeting with him in a cave, where they have sex. The next day, as she is returning to the boat, Zym's men and daughter capture her.Conan learns of Tamara's capture and departs to Argalon, where he asks Ela-Shan to help him break into Zym's castle unnoticed. Zym prepares to drain Tamara's blood, mending the mask. He plans to use the girl's body as a vessel for his wife's soul. After confronting an octopus-like monster that guards the dungeons and killing its handlers, Conan infiltrates Zym's followers, kills a guard, steals his robe, and watches as Zym puts on the empowered mask. Conan releases Tamara, and she escapes as he battles Zym, eventually reclaiming the sword Marique had stolen from his father. Marique attacks Tamara, but Conan hears Tamara's scream and defeats Marique, cutting off her hand. Tamara kicks her into a pit, where she is impaled. Zym swears revenge upon Conan.Conan and Tamara become trapped on an unstable bridge as Zym attacks them. He uses the mask's power to call forth the spirit of his deceased wife, Maliva, a powerful sorceress who was executed by the monks from Tamara's monastery for attempting to unleash occult forces to destroy Hyborea, and Maliva's spirit begins to possess Tamara's body. She begs Conan to let her fall, but he refuses and instead destroys the bridge before jumping to safety with Tamara. The power-hungry ruler falls into the lava below the precipice.Conan and Tamara escape and he returns her to her birthplace, telling her that they'll meet again. He then returns to Corin's village and tells the memory of his father that he has avenged his death and recovered the sword Marique stole from him, restoring his honor.","language":"English","conan_the_barbarian":"Theatrical release poster","box_office":"$48.8 million[3]","cinematography":"Thomas Kloss","production_company":"Nu Image Films Millennium Films Paradox Entertainment","directed_by":"Marcus Nispel","narrated_by":"Morgan Freeman[1]","release_dates":"August 11, 2011 (2011-08-11) (Los Angeles premiere)|August 19, 2011 (2011-08-19) (United States)||||","Production":"There had been talk in the late 1990s of a second Conan sequel following Conan the Destroyer, about an older Conan, set to be titled King Conan: Crown of Iron; however, due to Schwarzenegger's election in 2003 as governor of California, this project came to an end.[8]Warner Bros. spent seven years trying to get the project off the ground, with development attempts made by Larry and Andy Wachowski, John Milius, and Robert Rodriguez who was closest to completing development but left the project for Grindhouse. Boaz Yakin was hired in 2006 to start again, however, in June 2007 the rights reverted to Paradox Entertainment, though all drafts made under Warner remained with them. Paradox's CEO Fredrik Malmberg told Variety \"we have great respect for Warner Bros., but after seven years, we came to the point where we needed to see progress to production.\" Paradox were auctioning the rights after and various groups took interest in producing, including New Line Cinema, Hollywood Gang, and Millennium Films.[9]Due to development-time frustrations felt when the rights were with Warner, Malmberg made deal terms where he was asking for $1 million for a one-year option, with another $1 million for each year's renewal. In August 2007, it was announced that Millennium had acquired the right to the project in an unrevealed seven-figure deal, with Malmberg and Millennium's Avi Lerner, Boaz Davidson, Joe Gatta, and George Furla set to produce. The deal was brokered by Gatta, who originally made the deal between Paradox and Warner in 2002. Production was aimed for a Spring 2006 start, with intention of having stories more faithful to the Robert E. Howard creation.[10]After the partnership on Rambo, Nu Image, Millennium, and Lionsgate partnered on this film due to the strength of that relationship, and the happiness by Millennium producers with the handling of Rambo. Lionsgate were announced to be handling North America's distribution in January 2008. At this point, Thomas Dean Donnelly and Joshua Oppenheimer had been courted to write the script. Nu Image/Millennium founders Lerner and Danny Dimbort were set to fully finance the film at an estimated $100 million.[11] With a brief effort of developing Red Sonja with Rose McGowan as the lead, Robert Rodriguez had mentioned in July 2008 he had been in discussions to produce Conan also.[12] Dirk Blackman and Howard McCain were announced in August to have been hired for a re-write of the script, with the intention of returning to the original source material and in the desire of making an R-rated film.[13]In November 2008, Brett Ratner was prematurely announced to be the director of Conan to The Hollywood Reporter by Lerner, something which displeased him as he pointed out \"I am not doing Conan now. This is totally premature. For now, Conan is only a development deal. I have a deal at Paramount and I'm doing Beverly Hills Cop IV first, no matter what. Avi shouldn't be telling you or anyone else in the press what I'm doing.\"[14][15] However, Gatta revealed in May 2009 that after six months of discussions on developing the film, Ratner was off the project due his busy schedule. Regardless, Gatta was hopeful of still meeting the intention of Millennium to start filming on August 24 in Bulgaria.[16] June 2009 revealed Marcus Nispel would take the reins as director to the film.[17] Sean Hood was announced in February 2010 to be rewriting the script once more for the producers.[18]Early in pre-production, Conan was a temporary title for the film, until it was changed to Conan 3D. Finally, early in December 2010, the title was definitely changed to Conan the Barbarian, as was titled the 1982 film.[19]In January, 2010, Jason Momoa was selected for the role of Conan.[20] Momoa beat Kellan Lutz for the role. He was enrolled in an intense six-week training program at a stunt and martial arts academy in Los Angeles for his part, while still finalising negotiations for the film. Momoa intended to add 10 pounds of muscle to his 215-pound frame, with the help of The Bourne Ultimatum's stunt performer David Leitch, and the martial arts stunt coordinator for The Matrix Reloaded and The Matrix Revolutions, Chad Stahelski.[21]Leo Howard was cast as the younger Conan in the film, as the first 15 minutes focused on Conan's youth.[22]The casting call for Conan's father, Corin, reveals the character to be \"powerfully built, intelligent, graceful, master swordsman, skilled blacksmith, de facto leader of Cimmerians and Conan's father. He resolves to answer the terrible request of his dying wife and cuts Conan out of her so she can see him. He then shoulders the burden of raising Conan, which proves to be daunting given the boy's savage nature. Corin teaches his son the meaning of the sword: a hot blade must be cooled and tempered. When Khalar finally corners him and tortures him to death, he shows no regret nor pain, hiding his concern for his son's safety from the eyes of the enemy.\"[23] Mickey Rourke first entered negotiations. Originally talks had happened before but after a period of no talk, offers were returned to Rourke in February, 2010.[24] Rourke had however left the project for a second time, in apparent favor of the Immortals film. Ron Perlman took on the character in March, 2010.[25][26]Bob Sapp portrays Ukafa, \"a leader of Kushite Tribemen from the savannahs of Kush. Ukafa is Khalar Zym's second in command, jealous that Zym's daughter, Marique, will one day be warlord. He obeys his leader but plots the overthrow of his daughter. He is a mighty warrior and unbeatable in battle—until he meets Conan.\"[27]Rachel Nichols joined the cast as Tamara, described as \"the Queen's servant, bodyguard and best friend. She and many other female bodyguards to the queen have been in hiding most of their lives because of the curse of Acheron, which would take the queen’s life to bring almost immortal power to its king. When Khalar Zym, a powerful warlord with ambitions to become the king of Acheron, storms the monastery and captures all of the novitiates, she is separated from Ilira, the one she must protect. With all of her strength and will, Tamara is determined to find and rescue her. She finds herself in league with Conan because of a mutual need to find Khalar Zym. She is not in the least intimidated by Conan’s size or grim demeanor and their alliance eventually blossoms into something that surprises them both.\"[28]Stephen Lang plays Khalar Zym, described to be \"commanding in size and manner, a warlord and formidable warrior, brilliant, cruel, weathered and tanned by the many campaigns he has waged and won. He is driven in his quest to find the Queen of Acheron and has been building an empire to do so.\"[29]Rose McGowan also stars as \"an evil half-human/half-witch\", as announced by Variety in March, 2010.[30] She plays Marique, the daughter of Khalar Zym (Stephen Lang). Although the part was originally written as a male character called Fariq, McGowan impressed the producers with her take of the role, so her character was rewritten to be female. McGowan attempted to inject an Electra complex for the character, noting: “Initially, that obsession with trying to seduce her father was not scripted; it was something that the writer and I talked about quite a bit. But, unsurprisingly, the studio was freaked out by it. A lot of the dialogue that we’d come up with to support that, and really give it a deviant, complicated feel, had to be taken out. So I just figured, 'OK, then, I’ll just act it and make it as uncomfortable as possible without any dialogue!'”[31] When asked about preparation to play a witch, Mcgowan stated that her costume had significance in her preparation and that makeup for her character took 6 hours.Dolph Lundgren had spoken to the producers in November, 2009 about an unspecified role.[32] This never came to fruition.Principal photography was first hoped to be started in Spring 2008. Nothing was set until Ratner came on board. Filming had a set date for August 24, 2008, in Bulgaria. Ratner, however, departed in May that year, and the start-date for filming was pushed back, with South Africa being revealed as another filming destination.[17] Filming finally began in Bulgaria on March 15, 2010,[30] wrapping on June 15.[33]The Bulgarian shooting locations were Nu Boyana Film Studios, Bolata, Pobiti Kamani, Bistritsa, Sofia, Zlatnite Mostove, Pernik, and Vitosha.[34][35]The film had a 3D conversion in post production.[36]","produced_by":"Fredrik Malmberg Avi Lerner Boaz Davidson Joe Gatta George Furla John Baldecchi Les Weldon","starring":"Jason Momoa Rachel Nichols Stephen Lang Rose McGowan Saïd Taghmaoui Leo Howard Bob Sapp Ron Perlman","running_time":"113 minutes[2]","Future":"In late 2011, it was mistakenly reported that Momoa was penning a sequel to Conan.[44] In an interview with producer Avi Lerner, he claimed that a remake of Red Sonja would be made before a followup to the 2011 film.[45] In October 2012, Universal Studios and Paradox Entertainment announced that the next Conan production will not be a sequel to Nispel's film, and will instead be a direct sequel to the 1982 film,[46] ignoring the events of both 1984's Conan the Destroyer and the reboot.The Legend of Conan will be produced by Fredrik Malmberg with a story by Fast and Furious writer Chris Morgan.[47][48] Arnold Schwarzenegger will once again appear in the titular role.[46] In October 2013, Universal announced that World Trade Center writer Andrea Berloff would assume scripting duties for The Legend of Conan, while Morgan continued his involvement as a producer.[49]","music_by":"Tyler Bates","edited_by":"Ken Blackwell","Release":"Conan the Barbarian was first released on August 17, 2011 in France, Belgium, Iceland, and the Philippines. It was released in Australia, Italy, and Israel on August 18; in the United States, Canada, and Spain on August 19,[37] in Switzerland on August 21,[38] in the United Kingdom on August 26,[39] among others.In its first weekend, Conan made $10,021,215 in 3,015 theaters and opened at #4 in the United States domestic box office. By the end of its run, the film had grossed $21,295,021 domestically and $27,500,000 overseas for a worldwide total of $48,795,021. Based on its $90 million budget, the film was a box office bomb.[3]As of August 30, 2011, the film has received generally negative reviews, attaining a 24% aggregate approval rating based on 137 reviews on the review-aggregate website Rotten Tomatoes.[6] The website provided a consensus that \"while its relentless, gory violence is more faithful to the Robert E. Howard books, Conan the Barbarian forsakes three-dimensional characters, dialogue, and acting in favor of unnecessary 3D effects.\"[6] The film also received a score of 36 out of 100 from review aggregate Metacritic, which indicates \"generally unfavorable\" reviews based on 29 reviews.[40] CinemaScore polls reported that the average grade moviegoers gave the film was a \"B−\" on an A+ to F scale.[41] Internet review show Half in the Bag criticized Conan the Barbarian for having an overly simplistic screenplay and pointless action scenes.[42]However, not all reviews were negative. Betsy Sharkey of the Los Angeles Times wrote that \"it is with a certain amount of guilt that I say it's kind of a wicked blast to watch.\"[43] Scott Weinberg of Twitchfilm.com stated, \"Some action scenes are tighter and more cohesive than others, but there's little denying that Nispel's Conan moves like a shot, tosses a lot of hardcore lunacy at the screen, and shows a decent amount of respect for basic matinée action-fests.\" Although criticizing the stock characters and cliché-ridden script, Variety magazine also gave a mildly positive review, stating \"With all earnestness, Nispel embraces the property's classic roots, placing this new Conan squarely within the tradition of sword-and-sorcery pics.\"Conan the Barbarian was released on DVD, Blu-ray and Blu-ray 3D on November 22, 2011 by Warner Home Video.[citation needed]","written_by":"Thomas Dean Donnelly Joshua Oppenheimer Sean Hood","budget":"$90 million[3]"}