{"based_on":"Pieter Daens  by Louis Paul Boon","country":"Belgium Netherlands France","distributed_by":"Shooting Star Films","daens":"Theatrical release poster","language":"Dutch French Latin","cinematography":"Walther van den Ende","directed_by":"Stijn Coninx","release_dates":"September 1992 (1992-09) (Venice)|23 February 1993 (1993-02-23) (Netherlands)||||","produced_by":"Dirk Impens Jean-Luc Ormières Maria Peters Hans Pos Dave Schram","starring":"Jan Decleir Gérard Desarthe Antje de Boeck Michael Pas","running_time":"138 minutes","music_by":"Dirk Brossé","Story":"It's 1890. Priest Adolf Daens returns to his hometown, the Belgian municipality Aalst, after a dispute with bishop Antoon Stillemans. Daens moves in with his brother Pieter, publisher of the local newspaper \"Land Van Aelst\".Daens is upset when he hears about the bad work conditions in the textile industry. Workmen are abused and exploited by the rich directors only for their own profit. To gain more profit, the companies have just decided to fire all men. They are replaced by women as their wages are much lower. Children need to work day and night, fall asleep and are flattened under the mechanical looms. Industrial accidents happen continuously and the management takes no action.A new catastrophe will soon happen: Stephane Borremans is about to fire 50% of his employees. His action is supported by Charles Woeste, a foreman of the Catholic-Party fraction in the Chamber of Representatives. Daens resists and wants to finish the atrocity. Pieter helps him in his task by publishing the misbehaviours in the textile industry in his newspaper. Daens becomes a pulpit and, later on, also a member of the Chamber of Representatives.Nette Scholliers is the eldest daughter of a Catholic family. She is just 17. As her parents have been made redundant, she is the only one who is earning some money to support her whole family. As soon as she hears about Daens’s plans, she supports him. Daens is even supported by the liberal party and the socialist party. Jan, a socialist, falls in love with Nette and both start a forbidden romance.Daens starts to doubt whether he can really change the bad circumstances. Furthermore, as he chooses the side of the poor people, he gets into a conflict with the rich directors, the Catholic party and even the Catholic church. Father Daens is a thorn in their side as he has become a symbol in the hardline freedom struggle of the workmen.Woeste sets up a plot in which he even involves the Holy See. Daens is summoned by Pope Leo XIII and is put before a dilemma: either he stays a priest or he becomes a politician. Daens just neglects the warnings and continues both of his activities. This leads to his compulsory defrocking.Eventually, Daens convinces the Belgian politicians that work conditions must improve and workmen must have more rights. Thanks to this action, the directors are forced to invest in better work conditions and to assume a greater responsibility in the prevention of accidents.","edited_by":"Ludo Troch","written_by":"François Chevallier Stijn Coninx Addy Weijers"}