{"based_on":"Bambi, a Life in the Woods  by Felix Salten","Cast":"^ Sources differ on whether Sutherland actually voiced Young Adult Bambi.[6]^ This was Otis Harlan's final film role: He died two years prior to the film's release.","country":"United States","distributed_by":"RKO Radio Pictures","story_by":"Story direction Perce Pearce Story adaptation Larry Morey Story development Vernon Stallings Melvin Shaw Carl Fallberg Chuck Couch Ralph Wright","Legacy":"The off-screen villain \"Man\" has been placed No. 20 on AFI's List of Heroes and Villains.[32]Some critics have cited parallels between Frank Churchill's theme music for \"Man\" (which consisted of 3 simple notes) and John Williams's theme music in Jaws (which consists of two notes).[33]Former Beatle Paul McCartney has credited the shooting death of Bambi's mother for his initial interest in animal rights.[34]Soon after the film's release, Walt Disney allowed his characters to appear in fire prevention public service campaigns. However, Bambi was only loaned to the government for a year, so a new symbol was needed, leading to the creation of Smokey Bear.[citation needed] Bambi and his mother also make a cameo appearance in the satirical 1955 Donald Duck short No Hunting: drinking from a forest stream, the deer are startled by a sudden trickle of beer cans and other debris, and Bambi's mother tells him, \"Man is in the forest. Let's dig out.\"In 2006, the Ad Council, in partnership with the United States Forest Service, started a series of Public Service Announcements that feature footage from Bambi and Bambi II for wildfire prevention. During the ads, as the Bambi footage is shown, the screen will momentarily fade into black with the text \"Don't let our forests...become once upon a time\", and usually (but not always) ending the ads with Bambi's line \"Mother, what we gonna do today?\" followed by Smokey Bear saying \"Only you can prevent wildfires\" as the Smokey logo is shown on the screen. The ads air on various television networks, and the Ad Council has also put them on YouTube.[35]In December 2011, Bambi was among the films selected for preservation in the Library of Congress' National Film Registry.[36] In its induction, the Registry said that the film was one of Walt Disney's favorites and that it has been \"recognized for its eloquent message of nature conservation.\"[37]","bambi":"Original theatrical release poster","Plot":"A doe gives birth to a fawn named Bambi, who will one day take over the position of Great Prince of the Forest, a title currently held by Bambi's father, who guards the woodland creatures from the dangers of hunters. The fawn is quickly befriended by an eager, energetic rabbit named Thumper, who helps to teach him to walk and speak. Bambi grows up very attached to his mother, with whom he spends most of his time. He soon makes other friends, including a young skunk named Flower and a female fawn named Faline. Curious and inquisitive, Bambi frequently asks about the world around him and is cautioned about the dangers of life as a forest creature by his loving mother.During Bambi's first winter, his mother is shot and killed by a deer hunter while trying to help her son find food, leaving the little fawn mournful and alone. Taking pity on his abandoned son, the Great Prince leads Bambi home. Years later, Bambi has matured into a young stag, and his childhood friends have entered young adulthood as well. They are warned of \"twitterpation\" by Friend Owl and that they will eventually fall in love, although the trio view the concept of romance with scorn. However, Thumper and Flower soon both encounter their beautiful romantic counterparts and abandon their former thoughts on love. Bambi himself encounters Faline as a beautiful doe. However, their courtship is quickly interrupted and challenged by a belligerent older stag named Ronno, who attempts to force Faline away from Bambi. Bambi successfully manages to defeat Ronno in battle and earn the rights to the doe's affections.Bambi is awakened shortly afterward by the smell of smoke, and is warned of a wildfire by his father. The two flee to safety, although Bambi is separated from Faline in the turmoil and searches for her along the way. He soon finds her cornered by vicious hunting dogs, which he manages to ward off. Bambi, his father, Faline, and the forest animals manage to reach shelter on a riverbank. The following spring, Faline gives birth to twins under Bambi's watchful eye as the new Great Prince of the Forest.","language":"English","Reception":"Bambi lost money at the box office for its first release; out of its $1.7 million budget, it only grossed back $1.64 million.[22][23]The film was released during World War II and lacked access to much of the European market.[24] Roy Disney sent a telegram to his brother Walt after the New York opening of the film that read: \"Fell short of our holdover figure by $4,000. Just came from Music Hall. Unable to make any deal to stay third week ... Night business is our problem.\"[24]At the time of the film's release, Bambi received mixed reviews from the critics, mainly because of the lack of fantasy elements in the film and objection towards a dramatic story of animals and their struggle to survive in the woods and avoid the threat of humans.[25] Hunters spoke out against the movie, and in a 1942 edition of the magazine Outdoor Life, editor Raymond Brown wrote that the film was \"... the worst insult ever offered in any form to American sportsmen.\"[26] The New York Times claimed, \"In the search for perfection, Mr. Disney has come perilously close to tossing away his whole world of cartoon fantasy.\"[25] Film critic Manny Farber called it \"... entirely unpleasant ...\" and agreed with the New York Times statement saying, \"In an effort to trump the realism of flesh and blood movies, he [Disney] has given up fantasy, which was pretty much the magic element.\"[25] Even Disney's daughter Diane complained, saying that Bambi's mother didn't need to die. When Walt claimed that he was only following the book, Diane protested, saying that he had taken other liberties before and that Walt Disney could do whatever he wanted.[25]Today, however, Bambi is viewed as a classic and recouped a considerable amount during the 1947 re-release and subsequent re-issues.[24] The film holds a 91% \"Fresh\" rating from critics on Rotten Tomatoes.[27] Critics Mick Martin and Marsha Porter call the film \"... the crowning achievement of Walt Disney's animation studio.\"[28]English film critic and film historian Leslie Halliwell wrote that Bambi was \"...one of Disney's most memorable and brilliant achievements with a great comic character in Thumper and a climactic forest fire sequence that is genuinely thrilling\". He concluded that it was \"...a triumph of the animator's arts.\"[29]In June 2008, the American Film Institute revealed its \"10 Top 10\" – the best ten films in ten classic American film genres – after polling over 1,500 people from the creative community. Bambi was acknowledged as the third best film in the animation genre.[30] It is also listed in the Top 25 Horror Movies of all Time by Time magazine. Bambi, Time states, \"has a primal shock that still haunts oldsters who saw it 40, 50, 65 years ago.\"[31]","box_office":"$267.4 million[3]","production_company":"Walt Disney Productions","directed_by":"Supervising director David Hand Sequence directors James Algar Samuel Armstrong Graham Heid Bill Roberts Paul Satterfield Norman Wright","Copyrights":"The copyrights for Bambi, A Life in the Woods were inherited by Anna Wyler, Salten's daughter, who renewed them in 1954. After her death, Wyler's husband sold the rights to Twin Books, a publishing company which subsequently filed a lawsuit against Disney, claiming Disney owed it money for the continued licensing for the use of the book. Disney countered by claiming that Salten had published the story in 1923 without a copyright notice, thus it immediately entered into the public domain. Disney also argued that if the claimed 1923 publication date was accurate, then the copyright renewal filed in 1954 had been registered after the deadline and was thus invalid. The courts initially upheld Disney's view; however, in 1996, the Ninth Circuit Court reversed the decision on appeal.[38]","release_dates":"August 9, 1942 (1942-08-09) (World Premiere-London)|August 13, 1942 (1942-08-13) (Premiere-New York City)|August 21, 1942 (1942-08-21) (U.S.)[1]|||","Production":"In 1933, Sidney Franklin, a producer and director at Metro-Goldwyn-Mayer, purchased the film rights to Felix Salten's novel Bambi, A Life in the Woods, intending to adapt it as a live-action film. After years of experimentation, he eventually decided that it would be too difficult to make such a film and he sold the film rights to Walt Disney in April 1937.[7] Disney began work on crafting an animated adaptation immediately, intending it to be the company's second feature-length animated film and their first to be based on a specific, recent work.[7] However, the original novel was written for an adult audience, and was considered too \"grim\" and \"somber\" for a regular light-hearted Disney film.[7] The artists also discovered that it would be challenging to animate deer realistically.[8] These difficulties resulted in Disney putting production on hold while the studio worked on several other projects.[7] In 1938, Disney assigned Perce Pearce and Carl Fallberg to work on the film's storyboards, but attention was soon drawn away as the studio began working on Fantasia.[7] Finally, on August 17, 1939, production on Bambi began in earnest, though progressed slowly owing to changes in the studio personnel, location, and methodology of handling animation at the time.[7]There were many interpretations of the story. As Mel Shaw claimedOriginally the film was intended to have six individual bunny characters, similar to the dwarfs in Snow White. However Perce Pearce suggested that they could instead have five generic rabbits and one rabbit with a different color than the rest, with one tooth, would have a very distinct personality.[9] This character later became known as Thumper.There originally was a brief shot in the scene where Bambi's mother dies of her jumping over a log and getting shot by man. Larry Morey, however, felt the scene was too dramatic, and that it was emotional enough to justify having her death occurring off screen.[8][9] Walt Disney was also eager to show man burned to death by his fire that he inadvertently started, but this was discarded when it was decided not to show man at all.[8] There was also a scene involving two autumn leaves conversing like an old married couple before parting ways and falling to the ground, but Disney found that talking flora didn't work in the context of the film, and instead a visual metaphor of two realistic leaves falling to the ground was used instead.[9] Disney and his story team also developed the characters consisting of a squirrel and a chipmunk that were to be a comic duo reminiscent of Laurel and Hardy. However, after years of experimentation, Walt felt that the story should focus on the three principal characters: Bambi, Thumper and Flower.[9] The squirrel and chipmunk make only brief appearances in the final film.The writing was completed in July 1940, by which time the film's budget had increased to $858,000.[7]Although the animators had animated deer in Snow White, they were animated, in the words of Eric Larson, \"like big flour sacks\".[8] Disney wanted the animals in Bambi to be more realistic and expressive than those in Snow White. He had Rico LeBrun, a painter of animals, come and lecture to the animators on the structure and movement of animals.[10] The animators visited the Los Angeles Zoo and Disney set up a small zoo at the studio with animals such as rabbits, ducks, owls, and skunks, and a pair of fawns named Bambi and Faline so that the artists could see first-hand the movement of these animals.[9][10][11] Rico LeBurn's sketches depicted realistic animals, but as characters they lacked personality. Marc Davis created the final design of Bambi by incorporating LeBurn's realistic study of deer anatomy but exaggerating the character's face by making his proportions baby-like (short snout, big eyes, etc.).[8] Although there were no humans in Bambi, live-action footage of humans was used for one scene: actress Jane Randolph and Ice Capades star Donna Atwood acted as live-action references for the scene where Bambi and Thumper are on the icy pond.[12] The animators learned a lot about animals during the film's production, giving them a broader spectrum of animation styles to use in future projects.[13]The backgrounds for the film were inspired by the Eastern American woodlands. One of the earliest and best-known artists for the Disney studio, Maurice \"Jake\" Day, spent several weeks in the Vermont and Maine forests, sketching and photographing deer, fawns, and the surrounding wilderness areas.[14] However his first sketches were too \"busy\" as the eye did not know where to focus.[8] Tyrus Wong, a Chinese animator, showed Day some of his impressionistic paintings of a forest. Day liked the paintings and appointed him art director of the film.[8] Wong's backgrounds were revolutionary since they had more detail around the center and less around the edges, thus leading a viewer's eye to the characters.[9]Due to World War II, which began in Europe in 1939, Pinocchio and Fantasia failed at the box office. Facing financial difficulty, Disney was forced to cut 12 minutes from the film before final animation to save production costs.[7]","produced_by":"Walt Disney","starring":"see below","running_time":"70 minutes","Sequel":"Set in the middle of Bambi, Bambi II shows the Great Prince of the Forest struggling to raise the motherless Bambi, and Bambi's doubts about his father's love. The film was released direct-to-video on February 7, 2006. While the film was a direct-to-video release in the United States and other countries, including Canada, China, Hong Kong, Japan and Taiwan, it was a theatrical release in some countries, including Australia, Austria, Brazil, Dominican Republic, France, Mexico, the United Kingdom and some other European countries.[citation needed]","music_by":"Frank Churchill Edward H. Plumb","Release":"Bambi was released in theaters in 1942, during World War II, and was Disney's 5th full-length animated film. The film was re-released to theatres in 1947, 1957, 1966, 1975, 1982, and 1988. It was then made available on home video in 1989. Even in home video, it has seen multiple releases, including two VHS releases — in 1989 (Classics Version) and 1997 (Masterpiece Collection Version) — and most recently a digitally-remastered and restored Platinum Edition DVD.[15] The Platinum Edition DVD went on moratorium on January 31, 2007.[16]Bambi was released in Diamond Edition on March 1, 2011,[17] consisting of a Blu-ray and DVD combo pack. According to Cinema Blend, this release is set to include multiple bonus features that were not previously included in Bambi home releases: a documentary entitled Inside Walt’s Story Meetings – Enhanced Edition, two deleted scenes, a deleted song, an image gallery, and a game entitled Disney’s Big Book of Knowledge: Bambi Edition.[18] The release will also mark the first use of \"Disney Second Screen\",[19] a feature which is accessed via a computer or iPad app download that syncs with the Blu-ray disc,[20] allowing the viewer to follow along by interacting with animated flip-books, galleries and trivia while watching the movie.[17] A UK version of Diamond Edition was released on February 7, 2011.[21]","budget":"$858,000[2]"}