{"based_on":"Affliction  by Russell Banks","country":"United States","distributed_by":"Lions Gate Films","screenplay_by":"Paul Schrader","Background":"Affliction was filmed in Quebec, with principal shooting ending in February 1997. Although first presented at the Venice Film Festival on August 28 the same year, Affliction did not see a theatrical release until some time later in most countries. After a limited release in New York in December 1998, it saw its regular US release in January 1999.[2][3]","Plot":"The film begins with a voice-over narration by Rolfe Whitehouse, announcing the story of his brother Wade's \"strange criminal behavior\" and subsequent disappearance.Wade Whitehouse is a small-town policeman in New Hampshire. On Halloween night, Wade meets his daughter Jill from his divorced marriage, but he is late and the evening is overshadowed by disharmony. Jill eventually calls her mother to come and pick her up. When his ex-wife finally arrives, Wade shoves her lover against their car and watches them drive away with Jill. Wade vows to get a lawyer to help gain custody of his daughter.The next day, Wade rushes to the scene of a crime. A hunting guide named Jack claims that the man with whom he was hunting accidentally shot and killed himself. The police believe Jack, but Wade grows suspicious, believing that the man's death was no accident. When he is informed that the victim was scheduled to testify in a lawsuit, his suspicion slowly turns into conviction.A while later, Wade and his girlfriend Margie Fogg arrive at the house of Wade's father, Glen Whitehouse, whose abusive treatment of Wade and Rolfe as children is seen in flashbacks throughout the film. Wade finds his mother lying dead in her bed from hypothermia. Glen Whitehouse reacts to her death with little surprise. At the funeral wake, the father gets drunk and loudly exclaims, \"Not one of you is worth one hair on that woman's head!\", resulting in a confrontation between Wade and him.Rolfe, who has come home for the funeral, suggests at first that Wade's murder theory could be correct, but later renounces himself of this presumption. Nonetheless, Wade becomes obsessed with his conviction. When Wade learns that town Selectman Gordon Lariviere is buying up property all over town with the help from a wealthy land developer, he makes the solving of these incidents his personal mission. Suffering from a painful toothache and becoming increasingly socially detached, he behaves more and more unpredictably. He follows Jack, convinced that Jack is running away from something and is involved in a conspiracy. After a car chase, a nervous Jack finally pulls over, threatens Wade with a rifle, shoots out his tires, and drives off.Finally, Wade is fired from his police job both for his constant harassment of Jack and his trashing of Lariviere's office. He collects Jill from her mother's house, where his ex-wife furiously castigates his plans to sue for full custody. At the local restaurant, he attacks the bartender in front of his daughter after he jokingly insults Wade. Then Wade takes Jill home to find Margie leaving him. Wade grabs Margie and begs her to stay with him, but Jill rushes up and tries to push Wade away. In response, Wade pushes Jill, causing her nose to bleed. She and Margie drive off. Wade is then approached by his father Glen, who congratulates him for finally acting as a \"real man\". The latent aggression between the men culminates in a fight in which Wade accidentally kills his father. He burns the corpse in the barn, sits down at the kitchen table and starts drinking, while the barn can be seen burning down through a window.Rolfe's narration reveals that Wade eventually murdered Jack and left town (possibly to Canada, where Jack's truck was found three days later), never to return. Rolfe relates that the town later became part of a huge ski resort partly organized by Gordon Lariviere. He concludes that someday a vagrant resembling Wade might be found frozen to death, and that will be the end of the story.","language":"English","Critical reception":"The film received mostly positive reviews with an 87% rating on Rotten Tomatoes.Critic Roger Ebert of the Chicago Sun-Times gave the film 4 stars.[4] Janet Maslin, in The New York Times, said \"[Nick Nolte] gives the performance of his career in Paul Schrader's quietly stunning new film […] Like The Sweet Hereafter, a more meditative and elegant but less immediate, volcanic film, Affliction finds the deeper meaning in an all too believable tragedy.\"[5]In a negative review in the Time Out Film Guide, Geoff Andrew called the film a \"sensitive but rather dull adaption of Russell Banks' novel […] the narrative's too unfocused and low-key really to engage the heart or mind.\"[6]","box_office":"$6,330,054[1]","cinematography":"Paul Sarossy","production_company":"Kingsgate Films Largo Entertainment","directed_by":"Paul Schrader","Awards":"James Coburn won the Academy Award for Best Supporting Actor and was nominated for the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role. Nick Nolte was nominated for the Academy Award for Best Actor, the Golden Globe Award for Best Actor – Motion Picture Drama, the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role, the Independent Spirit Award for Best Male Lead, and the Satellite Award for Best Actor – Motion Picture. He was awarded the National Society of Film Critics Award for Best Actor, the New York Film Critics Circle Award for Best Actor, the Sant Jordi Award for Best Foreign Actor, and the Valladolid International Film Festival Award for Best Actor.The film was nominated in six categories at the Independent Spirit Awards.","release_dates":"December 30, 1998 (1998-12-30)|||||","produced_by":"Linda Reisman","starring":"Nick Nolte Sissy Spacek James Coburn Willem Dafoe","running_time":"114 minutes","music_by":"Michael Brook","affliction":"Theatrical film poster","edited_by":"Jay Rabinowitz","budget":"$6 million[1]"}