{"country":"India","distributed_by":"Great India Films (Overseas)[1] Bharath Pictures (Vizag) Hari Venkateswara Films (Guntur) Sri Nikethan Films (Nellore)","screenplay_by":"Sreenu Vaitla","story_by":"Gopimohan Kona Venkat","Plot":"Sadhu Bhai (Kelly Dorji) is a notorious mafia leader who escaped India after various terrorist attacks and conquered the underworld of the entire southeast Asia, and no one dares to challenge Sadhu Bhai. Baadshah (N. T. Rama Rao Jr.) enters the underworld for his father Dhanraj (Mukesh Rishi). In the opening scene, Sadhu Bhai's partner, Crazy Robert (Ashish Vidhyarthi), captures Baadshah and his father as Baadshah revolts against Sadhu Bhai. But Baadshah easily defeats Crazy Robert's goons. However, Baadshah learns that both the Indian police and Hong Kong police are looking for him and tries to find a solution for that.The story cuts to Milan, Italy where Janaki (Kajal Agarwal) is a social worker who has just finished her interior designing course. She lives there with her uncle, Pilli Gopi Krishna Simha (Tanikella Bharani), and cousins, Inky and Pinky. She meets Baadshah alias Rama Rao when he acts as if he is attempting suicide (to get her attention) as his fake, imaginary girlfriend Saira Bhanu dumped him. Janaki, who is not aware of the truth, asks him to spend a day with her, in return she will give him a hope for life. Janaki introduces him to various people who attempted suicide but found hope for life through Janaki's inspiration, one of whom is Dasu (Vennela Kishore). Dasu is a slacker who got laid off. Janaki brought him to her place as she thought he was attempting suicide when he actually went towards a cliff to throw his empty beer bottle. Janaki introduces Rama Rao to Dasu and keeps him in her house. But Rama Rao immediately discovers Dasu's true nature and buys him off to help him in making Janaki fall in love with him.Meanwhile, Baadshah fights off Sadhu Bhai's henchman, Rakhi Rasul (Supreet Reddy), who comes looking for him. But one of Baadshah's right hand men (Shafi) is killed by Crazy Robert when he refuses to give information about Baadshah. This is when Baadshah's past is revealed.Dhanraj (Mukesh Rishi) works for Sadhu Bhai and runs a casino in Macau through which Sadhu Bhai gets half of his income. Although Sadhu Bhai is the most powerful underworld don, he was never able to conquer Hong Kong due to Violent Victor's (Pradeep Rawat) and his son Ruthless Johnny's (Ajaz Khan) control. When Dhanraj attempts to transfer the money from the casino to Sadhu Bhai through Hong Kong, Ruthless Johnny stops Dhanraj's henchmen and tries to steal the money. But Baadshah, Dhanraj's son, fends of Johnny's men. Impressed by his bravery and his fearlessness, Sadhu Bhai asks Baadshah to recover his henchmen Antony, who was kidnapped by Violent Victor. But unknown to Sadhu Bhai, it was Baadshah who kidnapped Antony. Baadshah demands control over Macau in return, to which Sadhu Bhai accepts. Baadshah uses this as an opportunity to attack Ruthless Johnny's place without suspicion from Sadhu Bhai, recover several flood victim children (with whom Ruthless Johnny planned to do illegal organ business), and kill Ruthless Johnny. Baadshah then hands over Antony to Sadhu Bhai as if he recovered him from Violent Victor.But Violent Victor surrenders Hong Kong to Sadhu Bhai to seek his help in avenging his son's death. Although Sadhu Bhai initially disagrees, he accepts the offer when he finds out that Baadshah was behind Antony's kidnap and played a game with him to get Macau. It is then revealed that Baadshah's original intent on entering the mafia world was to defeat Sadhu Bhai and conquer his empire with the help of his uncle Ganesh (Adithya). Sadhu Bhai sends his men to kill Baadshah but his uncle Ganesh is killed in the car instead in the process, due to Sadhu Bhai's men thinking that Baadshah was in the car. Baadshah goes as far as killing Violent Victor and defeats all of his accomplices. Sadhu Bhai then joins forces with Crazy Robert, Violent Victor's brother. Ramchandar (Sayaji Shinde), IG of the Indian Police Service in Andhra Pradesh, finds out that Sadhu Bhai is shipping a container of RDX from Hong Kong to India, and sends a team headed by DIG Balram (Nagendra Babu) and ACP Aadi (Navdeep). In Hong Kong, DIG Balram attacks Sadhu Bhai's gang, but ACP Aadi betrays him, revealing that he works for Sadhu Bhai. Then Aadi kills Balram. The container is successfully transported to India. Baadshah is framed for DIG Balram's death. Crazy Robert then kidnaps Dhanraj and captures Baadshah. This was the opening scene of the movie. Baadshah finds out that he was framed for DIG Balram's death and speaks to Ramchandar. Baadshah tells him that ACP Aadi works for Sadhu Bhai. Ramchandar is convinced but finds it hard to convince the entire police department since Aadi is part of that department. He tells Baadshah that Janaki is engaged to Aadi and that they will be married in a few weeks. Ramchandar tells Baadshah to get close to Janaki, which was why Baadshah met her in Milan and the rest of the story is already known. But in the process Baadshah falls in love with Janaki.Janaki accepts when Baadshah confesses his love. Janaki's uncle agrees to help them when Baadshah reminds him that he cheated Janaki's father by telling him that he is a police officer, when he is actually a film shooting coordinator in Italy. Later, Janaki, Baadshah, Gopi Krishna Simha, Inky, Pinky, and Dasu travel to India.Meanwhile, Sadhu Bhai plans several bomb blasts in all major cities in India with the RDX on the day of the WSIS in Hyderabad.Baadshah enters Janaki's household by posing as a Wedding Planner. Janaki's household is headed by her father Dr. Pilli Jaya Krishna Simha (Nassar), a strict and disciplined Commissioner of the Indian Police Service in Andhra Pradesh. He expects all the men in the family to be disciplined police officers. But Padmanabha Simha (Brahmanandam) is lazy; he becomes an inspector due to Jaya Krishna Simha's influence. Because of his nature, Padmanabha Simha always gets admonished by Jaya Krishna Simha. Padmanabha Simha always waits for a payback opportunity. Rama Rao uses this as an opportunity to trap Aadi and reach Sadhu Bhai.When Rakhi Rasul and Crazy Robert enter the city to carry out the planned bomb blasts, Rama Rao goes with Padmanabha Simha and fights the gang and kills Rakhi Rasul. But he makes it seem like Padmanabha Simha had done the job making Padmanabha Simha a media hero. The RDX is confiscated by the police.But Rama Rao's mother (Suhasini Maniratnam) finds out that Rama Rao is Baadshah while Baadshah is talking to Ramchandar. Although she is initially disgusted she finds out from Ramchandar why Rama Rao became Baadshah. Before Rama Rao entered the mafia, Rama Rao, his adoptive brother Siddhu (Siddharth), and his mother were living happily. But the day Rama Rao was to leave for US, his brother was killed in a bomb blast which Sadhu Bhai planted. Motivated by the intent to kill Sadhu Bhai, who was behind the blast, he applies for a position in the Indian Police Service. But he gets rejected by the whole department because his father Dhanraj (whom Rama Rao thought was dead) was involved with the mafia, and no one with a criminal family history is allowed into the police department. But Ramchandar, impressed by Rama Rao's determination, tells him that his father was a very talented financial advisor. But since he did not get sufficient recognition in the society, he started working for Sadhu Bhai. But when he asks his wife to follow him with Sadhu Bhai when he is about to leave India, she rejects and later creates as if she and Rama Rao died in an accident. She also tells Rama Rao in his childhood that his father is dead. Ramchandar asks Rama Rao to go undercover as Baadshah and infiltrate the mafia to extract information about Sadhu Bhai for the police department under Operation Baadshah, and in return all criminal charges against Rama Rao's father will be dropped. Hence, Rama Rao joins the mafia and turns into Baadshah. His mother apologizes for not trusting him and Rama Rao reunites her with his reformed father.Sadhu Bhai comes to Hyderabad and kills the police informer (Rajiv Kanakala) that notified the police of the RDX and Rakhi Rasul's location. He finds out from the dying informer that Baadshah and Ramchandar are behind Padmanabha Simha and that Padmanabha Simha is just a buffoon. Sadhu Bhai has Aadi kidnap Ramchandar and capture Padmanabha Simha. Padmanabha Simha reveals that Baadshah is Rama Rao and finds out that he had been used.Sadhu Bhai then attempts to leave Hyderabad, but Baadshah intervenes in the process. Ramchandar reveals that Baadshah alias Rama Rao has been appointed as the new Assistant Commissioner of Police (ACP), and that he was hired when he recovered the RDX and proved his worth. Baadshah fights off all of Sadhu Bhai's goons, and finally kills Sadhu Bhai, Aadi and Crazy Robert, thus ending Operation Baadshah.The movie ends on a happy note as he gets engaged to Janaki, and Jaya Krishna Simha is happy that another strong police officer is becoming part of his household.","language":"Telugu","box_office":"₹80 crore (US$12 million)[4]","cinematography":"Jayanan Vincent R. D. Rajasekhar K. V. Guhan","production_company":"Parameswara Art Productions","directed_by":"Sreenu Vaitla","baadshah":"Film poster","Soundtrack":"The Soundtrack of the film was composed by S. Thaman, who previously worked with both Jr. NTR and Srinu Vaitla. Music discussions were held in Ooty.[68] The soundtrack consists of 6 Tracks all composed by S. Thaman with Ramajogayya Sastry penning 3 of them and Krishna Chaitanya, Viswa, Bhaskarabhatla Ravikumar penning each. The audio launch of the film was held at Ramanaidu Studios in Nanakramguda, Hyderabad on 17 March 2013 and the audio was released through Aditya Music label.[69] The audio was a huge success and The Hexa Platinum Disc function of the film was held on 31 March 2013 at Novotel in Hyderabad.[70]","release_dates":"5 April 2013 (2013-04-05)|||||","Production":"While wrapping up the film Dookudu, Srinu Vaitla announced his next film with Jr. NTR which would be produced by Bandla Ganesh on Parameswara Art Productions in July 2011. He further added that would take a gap of 2 months and then would start working for this film. The film was initially titled as Mafia with a tagline Manchi Kutumba Katha Chitram in the same month. But due to unknown reasons the film was officially titled as Baadshah, after considering the title Action in January 2012.[14] It was reported earlier that Jr. NTR allotted the dates from February and the film would be launched in the same month.[15] However, the film was launched on 18 March 2012 in an event held at Ramanaidu Studios in Hyderabad. The event was attended by Telugu actors Ram Charan Teja and Venkatesh.[16] The film also marked the last film of Srinu Vaitla with Kona Venkat as he had differences with him and it was confirmed by the duo that they would never team up again in the future.[17]The Technical team along with the Music Director S. Thaman that delivered Dookudu worked for this film.[18] Jr. NTR gone lean to give a new look for his character in this film.[19] It was also reported that Jr. NTR's character would have multiple shades in the film.[20] Though the makers tried to rope Samantha initially, she couldn't be a part of the film due to her busy schedules. Finally the makers zeroed Kajal Aggarwal to play the lead lady's role in the film which marks her second collaboration with Jr. NTR after Brindavanam.[21] Popular actor Navdeep, who was known for his varied hero roles, was roped in to play one of the antagonists of the film. Another popular Telugu, Tamil Hero Siddharth was roped in to play a crucial cameo role of Jr. NTR's brother.[22] Popular Actress Suhasini Maniratnam was signed in March 2013 to play the role of Jr. NTR's mother in the film.[23] Mahesh Babu was reported to be the Narrator of a part of the film and after much speculation, the makers confirmed the news that Mahesh is providing Voice-over for some crucial scenes in the film.[24] It was also revealed that Brahmanandam would play the role of a Cop in the film and his role was said to be very special in the film.[25] Meenakshi Dixit and Brazilian Model Nicole Amy Madell were roped in to perform item numbers in the film.[26][27]Though initially planned on 15 June 2012,[28] the Principal photography started from 1 July 2012 at Milan in Italy after being shifted from Seoul.[29] First schedule was initially said to be held in Europe. But the unit after shooting key portions at Italy shifted to Europe where two songs and some key scenes were shot.[30][31] After filming for a hectic and long schedule in Europe and Italy, the unit proceeded to Bangkok.[32] It was reported that some key scenes in Mafia Backdrop will be shot there.[33] The film was shot extensively in Bangkok for more than 1 and a half month till 25 September 2012 and it was reported that 60% of the film's shoot was completed by then.[34] The new shooting schedule of the film began in a private house in Hyderabad, where few comedy scenes and other vital scenes will be canned on the lead cast.[35] The Unit returned from Bangkok and the shooting resumed in Hyderabad from the last week of September 2012. The shooting later commenced at Novotel hotel in Hyderabad where scenes on Jr. NTR, Mukesh Rishi and others were canned.[36] The filming resumed in Hyderabad from the second week of October 2012.[37] In the same month, the Introduction fight of Jr. NTR was canned at a huge set erected at the famous Aluminium Factory in Gachibowli under the supervision of Vijayan, which was said to be one of the highlights of the film.[37] After canning few other action sequences, the unit continued its shoot in Hyderabad in November 2012 where some key scenes were shot on the lead pair as well as other actors.[38] In December, the shoot continued at Rajiv Gandhi International Airport at Shamshabad in Hyderabad for 3 Days.[39] In the same month, Navdeep joined the sets of the film.[40] Later the shooting continued at a temple in Kachiguda and Daspalla Hotel in Hyderabad.[41] The Climax of the film was shot at Nagarjuna Sagar in which Jr. NTR, Navdeep, Kelly Dorje and others participated for a week.[42] Then a song on Nicole and Jr. NTR was canned at Annapurna 7 Acres Studio.[43] After completing few patch work activities at Novotel, the shooting finally came to an end on 15 March 2013.[44]","Box office":"Being the biggest outing of NTR after three Colossal flops with, Shakti, Oosaravelli, Dammu, expectations were very high among the audience on this film. This film was opened to great start, collecting ₹33 cr (share) all over the world at the end of 1st week, thus emerging as the highest opening grosser of Jr. NTR's career and got a super hit status. It is also the 7th hit of Srinu Vytla .[56] The film has collected ₹9.3 million (net) in the first week worldwide. The film has collected ₹427.1 million (net) in three weeks worldwide.[57] The film has collected ₹560.2 million (net) in 40 days worldwide and entered into all-time top three in TFI.The film opened to tremendous response in all the Major Cities of India in which it was released and the entire shows in major cities have been sold out for the next three days from the day of release.[58] On the first day, the film has registered 100% occupancy in both single screens and multiplexes. The film had huge amount of advance ticket booking and remaining few tickets were sold out early in the morning.[59] The film has collected ₹560.2 million (net) in 40 days in Andhra pradesh and entered into all-time top three in Tollywood Film Industry. The film has completed 50 days in 60 centres in Andhra pradesh on 24 May 2013.[60] The film has completed 100 days in 5 centres in Andhra pradesh on 13 July 2013.[61]The film was in the list of top 10 grossers at USA box office on 4 April 2013 collecting 234,686 USD's in 108 reported screens across USA, thus emerging as the biggest grosser among Jr. NTR's movies in USA,[62] thus breaking the record set by Seethamma Vakitlo Sirimalle Chettu which held the record of all-time highest grosser Telugu movie in the country.[63] Noted trade analyst Taran Adarsh has reported that the film crossed the US$1 Million mark in the USA, on the third day, which is a phenomenal feat and it is the first Telugu film to achieve this record in the opening weekend itself.[64] The film collected 1.094 Million Dollars, incidentally attaining second position in terms of collections in the first week in USA.[65]The VCD's, DVD's & Blu-ray's of the film were released through the Company BhavaniDVD on 19 July 2013.[66][67]","produced_by":"Bandla Ganesh","starring":"Jr. NTR Kajal Aggarwal Kelly Dorji Navdeep","running_time":"164 minutes[3]","music_by":"S. Thaman","edited_by":"M. R. Varma","Release":"Venkat Garikapati and G. Hari Kumar of Hari Venkateswara Films obtained the distribution rights of this film for Guntur and Nellore rights were acquired by Sri Nikethan Films.[45] Bharath Pictures took the distribution rights of this film for Visakhapatnam at a record price of ₹41.0 million.[46] The film obtained a U/A Certificate from the CBFC and was released on 5 April 2013.[47][48] Benefit show tickets hungama for the film was started from 2 April 2013.[49] The film was released in a record number of theaters in the US.[50]The Times of India gave a review stating \"Baadshah is a treat for Jr. NTR fans. But others can also enjoy this film for its comedy elements and Jr. NTR's powerful presence.\"[51] Idlebrain gave a review of rating 3.25/5 stating \"Baadshah is a film that serves you with Seenu Vytla kind of entertainment using Jr. NTR and Brahmanandam in an effective way. Jr. NTR has got a film with good box office potential after a long gap. It's up to the star power of Jr. NTR and brand value of Seenu Vytla to take it further.\"[52] 123telugu gave a review stating \"Baadshah is a very effective entertainer for the summer holidays. Brilliant performances from Jr. NTR, Kajal, Brahmanandam and M.S.Narayana coupled with a highly entertaining second half are major plus points for the film. Despite similarities to Sreenu Vaitla's past projects, the film makes for a very enjoyable watch. Catch Baadshah this weekend. Entertainment is guaranteed!\"[53] Oneindia Entertainment gave a review of rating 3.5/5 stating \"Baadshah is a good masala entertainer, which has excellent performance by lead actors and sound production values. The movie impresses all kinds of audience. It is a treat for Jr. NTR fans. Don't miss to watch the Young Tiger in action.\"[54] SuperGoodMovies gave a review of rating 4/5 stating \"Jr. NTR, Kajal's Baadshah is a successful entertainer for this summer. Sparkling performances from all the actors with a very much entertaining film. Sreenu Vaitla's proved with almost all projects. Complete Entertainment is assured.\"[55]","budget":"₹55 crore (US$8.2 million)[4]"}