{"based_on":"Arsenic and Old Lace 1941 play  by Joseph Kesselring","Commentary":"The play was written by Joseph Kesselring, son of German immigrants and a former professor at Bethel College, a pacifist Mennonite college. It was written in the antiwar atmosphere of the late 1930s.[8] Capra scholar Matthew C. Gunter argues that the deep theme of the play and film is the conflict in American history between the liberty to do anything (which the Brewsters demand), and America's bloody hidden past.[9]","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Julius J. Epstein Philip G. Epstein","Plot":"The plot revolves around the Brewster family of Brooklyn, New York, descended from the Mayflower and composed of illustrious White Anglo-Saxon Protestant ancestors whose portraits line the walls. The religious theme is repeatedly mentioned, and Elaine is the daughter of the minister who lives next door, with some scenes held in its ancient cemetery. Today the Brewster clan comprises insane murderers.Despite having written several books ridiculing marriage as an \"old-fashioned superstition\", Mortimer Brewster (Cary Grant) falls in love with Elaine Harper (Priscilla Lane), who grew up next door to him in Brooklyn, and, on Halloween day, they marry. Immediately after the wedding, Mortimer visits the eccentric but lovable relatives who raised him and who still live in his old family home: his elderly aunts Abby (Josephine Hull) and Martha (Jean Adair), and his brother Teddy (John Alexander), who believes he is Theodore Roosevelt. Each time Teddy goes upstairs, he yells \"Charge!\" and takes the stairs at a run, imitating Roosevelt's famous charge up San Juan Hill.Mortimer finds a corpse hidden in a window seat and assumes that Teddy has committed murder under some delusion, but his aunts explain that they are responsible (\"It's one of our charities\"). They explain in the most innocent terms that they have developed what Mortimer calls the \"very bad habit\" of ending the presumed suffering of lonely old bachelors by serving them elderberry wine spiked with arsenic, strychnine and \"just a pinch of cyanide\". The bodies are buried in the basement by Teddy, who believes he is digging locks for the Panama Canal and burying yellow fever victims.To complicate matters further, Mortimer's brother Jonathan (Raymond Massey) arrives with his alcoholic accomplice, plastic surgeon Dr. Herman Einstein (Peter Lorre). Jonathan is a murderer trying to escape the police and find a place to dispose of the corpse of his latest victim, a certain Mr. Spenalzo. Jonathan's face, as altered by Einstein while drunk, looks like Boris Karloff's in his makeup as Frankenstein's monster. This resemblance [Note 2] is frequently noted, much to Jonathan's annoyance. Jonathan, upon finding out his aunts' secret, decides to bury Spenalzo in the cellar (to which Abby and Martha object vehemently, because their victims were all nice gentlemen while Mr. Spenalzo is a stranger and a \"foreigner\") and soon declares his intention to kill Mortimer.While Elaine waits at her family home next door for Mortimer to take her on their honeymoon, Mortimer makes increasingly frantic attempts to stay on top of the situation, including multiple efforts to alert the bumbling local cops to the threat Jonathan poses, as well as to get the paperwork filed that will have Teddy declared legally insane and committed to a mental asylum (giving him a safe explanation for the bodies should the cops find them, and preventing his aunts from creating any more victims because they will no longer have any place to bury the bodies). He also worries that he will go insane like the rest of the Brewster family. As he puts it, \"Insanity runs in my family, practically gallops!\" While explaining this to Elaine, he claims they've been crazy since the first Brewsters came to America as pilgrims.But eventually Jonathan is arrested, while Teddy is safely consigned to an asylum and the two aunts insist upon joining him. Finally, Abby and Martha inform Mortimer that he is not biologically related to the Brewsters after all: his real mother was the aunts' cook and his father had been a chef on a steamship. If he is not an upper-class Brewster then he realizes he will not become insane or a murderer. In the film's closing scene, after lustily kissing Elaine and before whisking her away to their honeymoon, he gleefully exclaims \"I'm not a Brewster, I'm a son of a sea cook!\"[7]","In popular culture":"The 1946 Porky Pig cartoon Kitty Kornered features references to Arsenic and Old Lace. A cat drinks wine out of a bottle labeled \"Arsenic and Old Grapes\". Later, the cats run up a flight of stairs while made up to look like Theodore Roosevelt shouting \"Charge!\".","language":"English","Radio adaptations":"Arsenic and Old Lace was adapted as a radio play for the November 25, 1946, broadcast of The Screen Guild Theater with Boris Karloff[15] and Eddie Albert, and the January 25, 1948, broadcast of the Ford Theatre.","cinematography":"Sol Polito","directed_by":"Frank Capra","Reviews":"The contemporary critical reviews were uniformly positive. The New York Times critic summed up the majority view, \"As a whole, Arsenic and Old Lace, the Warner picture which came to the Strand yesterday, is good macabre fun.\"[1] Variety declared, \"Capra's production, not elaborate, captures the color and spirit of the play, while the able writing team of Julius J. and Philip G. Epstein has turned in a very workable, tightly-compressed script. Capra's own intelligent direction rounds out.\"[11] Harrison's Reports wrote: \"An hilarious entertainment, it should turn out to be one of the year's top box-office attractions.\"[12] John Lardner of The New Yorker called the film \"practically as funny in picture form as it did on the stage, and that is very funny indeed.\"[13]Twenty-four years after the film was released, Charles Higham and Joel Greenberg wrote Hollywood in the Forties where they stated that \"Frank Capra provided a rather overstated and strained version of Arsenic and Old Lace\".[14]American Film Institute recognition","References":"Explanatory notesCitationsBibliography","release_dates":"September 1, 1944 (1944-09-01) (New York City)[1]|September 23, 1944 (1944-09-23) (USA)||||","produced_by":"Frank Capra Jack L. Warner","starring":"Cary Grant","running_time":"118 minutes","music_by":"Max Steiner","edited_by":"Daniel Mandell","arsenic_and_old_lace":"theatrical release poster","budget":"$1,120,175 US (est.)"}