{"based_on":"Women Without Men by Kellogg and Schoenfeld","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Virginia Kellogg","Plot":"A married 19-year-old, Marie Allen (Eleanor Parker), is sent to prison after a botched armed robbery attempt with her equally young husband, Tom, who is killed. While receiving her initial prison physical, she finds out that she is two months pregnant.Marie has trouble adjusting to the monotonous and cutthroat world of the women's prison. She meets Kitty Stark (Betty Garde), a murderous shoplifter, who says once Marie gets out, Kitty will get her a job \"boosting,\" or shoplifting. Marie does not want to get involved in crime, but Kitty explains the realities of prison life: \"You get tough or you get killed. You better wise up before it's too late.\"Told she can be paroled after 9 months, Marie witnesses prisoner after prisoner being \"flopped back\" -- granted parole, but then not released from jail because no job has arranged by their parole officers. One flopped-back prisoner, June (Olive Deering), kills herself given the hopeless situation. This saps Marie's hopes of getting out early.Despite the hardships under sadistic matron Evelyn Harper (Hope Emerson), Marie gives birth to a healthy baby and wants to \"temporarily\" grant full custody to her mother. The intent is to get the baby back after she is released. Marie's callous step-father has decided not to allow the baby into his house. Marie's mother uses the excuses that she's \"too old\" and \"hasn't a penny in [her] name\" as reasons why she can't help Marie. Marie is denied a parole. She half-heartedly tries to escape, but is not punished. The prison forces her to permanently give the child up for adoption.The arrival of \"vice queen\" Elvira Powell (Lee Patrick) sets off a rivalry with Kitty. Elvira bribes Harper to put Kitty in solitary confinement, where Kitty is beaten. When a kitten is found in the jail yard, Marie attempts to make it a pet. When Harper tries to take the kitten away, a riot (in which the kitten is accidentally killed) ensues and Marie is put into solitary confinement as well.Before taking Marie to solitary confinement, Harper shaves Marie's head, symbolically stripping her of her innocence. Harper has disagreements with the sympathetic reformist prison superintendent, Ruth Benton (Agnes Moorehead), especially after this latest incident with Marie. However, since Harper is a political appointee, the police commissioner refuses to fire her, and asks for Benton's resignation instead. When Benton declares that she'll request a public hearing, the resignation issue is dropped.Out of solitary after a month, Kitty is distraught and mentally ill. After being picked on by Harper in the cafeteria, Kitty stabs Harper to death as the inmates watch and make no attempt to stop it. After her exposure to hardened criminals and sadistic prison guards, Marie actually urges Kitty on.Up for parole once again, Marie has found a \"cashier's job\" outside—actually just a ruse to join Elvira Powell's shoplifting gang—and leaves prison a hardened woman after 15 months. Benton asks Marie why she is going into crime when she could go back to school. Marie says she got all the education she needed in prison.","caged":"Theatrical release lobby card","In popular culture":"The movie was satirized in a 1977 SCTV skit as 'Broads Behind Bars' with the character of Marie (called 'Cheryl' and played by Catherine O'Hara) now a teenager in the mid-to-late '50's who after having smoked pot, ends up in prison framed for armed robbery and also pregnant months later. Andrea Martin played Kitty, while John Candy (in drag) played the role of matron Harper (here called 'Schultzy'.) The knife fight between Kitty and Harper also happens in this sketch, but with both 'Kitty' and 'Harper' ('Schultzy') dead (Kitty from being stabbed by Schultzy, and Schultzy later killed by Cheryl.) Cheryl/Marie is told that she can be got off for this, but smiles, laughs and decides to stay, echoing 'Kitty's' remark 'No dice!' The skit manages to also be an anti-marijuana film as well, similar to the ones that were made at this time, as well as a satire of 'women in prison' movies like Caged.","language":"English","Critical reception":"Film critic Emanuel Levy praised the film stating: \"master of melodrama, John Cromwell directs in a taut style, coaxing excellent performances from his female-dominated cast...'Caged' walks a fine line between a socially-conscious drama (and wake-up call) and exploitative, borderline campy fare.\"[2]This film has an audience approval score of 85% on Rotten Tomatoes.","cinematography":"Carl E. Guthrie","directed_by":"John Cromwell","release_dates":"May 19, 1950 (1950-05-19) (United States)|||||","produced_by":"Jerry Wald","starring":"Eleanor Parker Agnes Moorehead Ellen Corby Hope Emerson","running_time":"96 minutes","music_by":"Max Steiner","edited_by":"Owen Marks","written_by":"Bernard C. Schoenfeld Virginia Kellogg"}