{"country":"Italy United States","Awards and nominations":"El Cid was nominated for three Academy Awards, for Best Art Direction (Veniero Colasanti, John Moore), Original Music Score for Miklós Rózsa and Best Song.[9]It was also nominated for three Golden Globe Awards for Best Motion Picture - Drama, Best Motion Picture Director (Anthony Mann), and Best Motion Picture Score (Miklós Rózsa). Samuel Bronston won the 1962 Special Merit Award.Robert Krasker won the 1961 Best Cinematography Award by the British Society of Cinematographers. Verna Fields won the 1962 \"Golden Reel Award\" of the Motion Picture Sound Editors.","distributed_by":"Allied Artists (USA) Rank Organization (UK) Dear Film (Italy)","Plot":"General Ibn (pronounced Ben) Yusuf (Herbert Lom) of the Almoravid dynasty has summoned all the Emirs of Al-Andalus to North Africa and chastises them for their complacency in dealing with the infidels and reveals his plan for Islamic world domination.Later, while on the way to meet his bride-to-be Doña Ximena (Sophia Loren), Don Rodrigo, El Cid (Charlton Heston), becomes involved in a battle against a Moorish army. Two of the Emirs, Al-Mu'tamin (Douglas Wilmer) of Zaragoza and Al-Kadir (Frank Thring) of Valencia, are captured, but Rodrigo releases them on condition that they pledge never again to attack King Ferdinand of Castile's (Ralph Truman) lands. The Emirs proclaim him \"El Cid\" (the Castillian Spanish pronunciation of the Arabic for Lord: \"Al Sidi\") and swear allegiance to him.For this act of mercy, Don Rodrigo is accused of treason against the King by Count Ordóñez (Raf Vallone), and later by Ximena's father, Count Gormaz (Andrew Cruickshank). Rodrigo's father, Don Diego (Michael Hordern), angrily calls Count Ordóñez a liar. Ordóñez strikes Don Diego, effectively challenging the old man to a duel.Gormaz, who is the King's Champion, refuses to take back the challenge, and Rodrigo kills him in a duel. Ximena swears revenge upon her father's killer. Rodrigo then takes up the mantle of the King's Champion in single combat for control of the city of Calahorra, which he wins. Rodrigo is sent upon a mission to collect tribute from Moorish vassals of the Castillian crown, but Ximena, in league with Count Ordóñez, plots to have him killed. Rodrigo and his men are ambushed but are saved by Al-Mu'tamin, one of the pair to whom he showed mercy at the beginning of the story. Returning home, his reward is the hand of Ximena in marriage. But the marriage is not consummated — she removes herself to a convent.On the death of King Ferdinand, his elder son, Prince Sancho (Gary Raymond), becomes king. The younger son, Prince Alfonso (John Fraser), also desires the throne; their sister, Princess Urraca (Geneviève Page) has Sancho assassinated. At Alfonso's coronation, El Cid has him swear upon the Bible that he had no part in the death of his brother. Since he had no part in it (as his sister was responsible), he swears, and has Rodrigo banished for his impudence. Finally seeing the light, Ximena's love for El Cid is rekindled. She chooses banishment with him.But Rodrigo is called into service by other exiled Spanish fighters — and eventually into the service of the king to protect Castille from Yusuf's North African army. Rodrigo does not join the king, but allies himself with the Emirs who fight at Valencia, where Rodrigo relieves the city from the wicked Emir Al-Kadir, who betrayed him.Count Ordóñez brings Ximena from where the king had imprisoned her and her children after his defeat by the Moors. After patching things up with Rodrigo, Ordóñez joins him in his cause. Valencia falls and Emir Al-Mu'tamin, Rodrigo's army and the Valencians offer the crown to Rodrigo, \"The Cid\", but he refuses and sends the crown to King Alfonso. Rodrigo then repels the invading army of Ben Yusuf, but is wounded in battle by an arrow before the final victory. If the arrow were removed, he would be unable to lead his fighters, but he would have a chance of recovery. El Cid obtains a promise from Ximena to leave the arrow, choosing to ride out, dying or dead. King Alfonso comes to his bedside and asks for his forgiveness.Rodrigo, El Cid, dies, and so his body is secured upon his horse and sent out at the head of his army with King Alfonso and Emir Al-Mu'tamin riding on either side. When Yusuf's army see him with his eyes still open, they believe that El Cid's ghost has come back from the dead. Babieca, his horse, tramples on and kills Ben Yusuf, who is too terrified to fight. The invading North African army is smashed. King Alfonso leads Christians and Moors in a prayer \"for the purest knight of all\".","language":"English","Reception":"The movie earned $12 million in North American rentals.[6]Upon the release of El Cid, Bosley Crowther wrote \"it is hard to remember a picture — not excluding Henry V, Ivanhoe, Helen of Troy and, naturally, Ben-Hur — in which scenery and regal rites and warfare have been so magnificently assembled and photographed as they are in this dazzler… The pure graphic structure of the pictures, the imposing arrangement of the scenes, the dynamic flow of the action against strong backgrounds, all photographed with the 70mm color camera and projected on the Super-Technirama screen, give a grandeur and eloquence to this production that are worth seeing for themselves\".[5] Crowther also pointed out that while \"the spectacle is terrific the human drama is stiff and dull\".Sophia Loren had a major issue with Bronston's promotion of the film, an issue important enough to her that Loren sued Bronston for breach of contract in New York Supreme Court. As Time described it:[3]On a 600-sq.-ft. billboard facing south over Manhattan's Times Square, Sophia Loren's name appears in illuminated letters that could be read from an incoming liner, but—Mamma mia!—that name is below Charlton Heston's. In the language of the complaint: \"If the defendants are permitted to place deponent's name below that of Charlton Heston, then it will appear that deponent's status is considered to be inferior to that of Charlton Heston… It is impossible to determine or even to estimate the extent of the damages which the plaintiff will suffer.\"The film is a favorite of Martin Scorsese, who called it \"one of the greatest epic films ever made.\"[7] Scorsese was one of the major forces behind a 1993 restoration and re-release of El Cid.[8]","box_office":"$30,000,000 (Domestic)","Pre-production":"Loren was paid $200,000 for ten weeks' work; producer Samuel Bronston also agreed to pay $200 a week for her hairdresser.[3]Ramón Menéndez Pidal, a Spanish authority on El Cid and Spain in the Middle Ages, was the historical adviser for the film and for the interpretation of the hero as presented by Charlton Heston.[4]","cinematography":"Robert Krasker","directed_by":"Anthony Mann","References":"Specific references:General references:","release_dates":"UK: December 6th, 1961 United States: December 14, 1961","Production":"Time magazine provided some production details: \"Inevitably, the picture is colossal — it runs three hours and 15 minutes (including intermission), cost $6,200,000, employs an extra-wide widescreen, a special color process, 7,000 extras, 10,000 costumes, 35 ships, 50 outsize engines of medieval war, and four of the noblest old castles in Spain: Ampudia, Belmonte, Peñíscola and Torrelobatón\".[1]Ampudia appears as the raided village at the beginning of the film, Torrelobatón as Cid's hometown Vivar, the Castle of Belmonte appears as Calahorra,[5] and Peniscola and Bamburgh Castle as Valencia.[5]El Cid was shot mostly on location in Spain but a few studio scenes were shot in Rome, to achieve co-production status. An Iberia airplane is allegedly seen in the background during the Valencia battle scenes.","produced_by":"Samuel Bronston","starring":"Charlton Heston|Sophia Loren|Raf Vallone|Geneviève Page|John Fraser|Gary Raymond|Herbert Lom|Douglas Wilmer|","running_time":"184 minutes","music_by":"Miklós Rózsa","el_cid":"Theatrical release poster","edited_by":"Robert Lawrence","written_by":"Story: Fredric M. Frank Screenplay: Philip Yordan","budget":"$6,200,000[1][2]"}