{"eight_men_out":"Theatrical release poster","based_on":"Eight Men Out  by Eliot Asinof","country":"United States","distributed_by":"Orion Pictures Corporation (1988, original) MGM (2003 and 2013, DVD)","screenplay_by":"John Sayles","Background":"In a 2013 interview, Sayles told MLB Network's Bob Costas, \"People said, 'Oh, you’ll never get this made. There’s a curse on it. People have been trying to make it for years.'\" Talking about his thoughts for the cast when he first wrote the script, Sayles said \"my original dream team had Martin Sheen at third base, and I ended up with Charlie in center field.\"[4]Several people involved in this film would go on to be involved with Ken Burns' 1994 film miniseries Baseball. Cusack, Lloyd, and Sweeney did several voice-overs, reading recorded reminiscences of various personalities connected with the game. Sayles and Terkel were interviewed on the subject of the 1919 World Series. Sayles also contributed to the section on Roberto Clemente, and Terkel, a historian and a former labor leader, spoke about the movement toward labor freedom in baseball. Terkel also \"reprised his role\" by reading Hugh Fullerton's columns during the section on the Black Sox.[5]","Plot":"The 1919 Chicago White Sox are considered the greatest team in baseball and, in fact, one of the greatest ever assembled to that point, behind their greatest star, Joe Jackson. However, the team's owner, Charles Comiskey, is a skinflint with little inclination to reward his players for a spectacular season.When gamblers \"Sleepy\" Bill Burns and Billy Maharg get wind of the players' discontent, they offer a select group of Sox — including star knuckleball pitcher Eddie Cicotte, who led the majors with a 29-7 win-loss record and has an earned run average of just 1.82 — more money to play badly than they would have earned by winning the World Series against the Cincinnati Reds. Cicotte's motivation for being involved was because Comiskey refused him a promised $10,000 should he win 30 games for the season. Cicotte was nearing the milestone until Comiskey ordered team manager Kid Gleason to bench him for 2 weeks (missing 5 starts) to rest the 35-year-old veteran's arm for the series.A number of players, including Chick Gandil, Swede Risberg, and Lefty Williams, go along with the scheme. Jackson is depicted as being not bright and not entirely sure what is going on. Buck Weaver, meanwhile, is included with the seven others but insists that he wants nothing to do with the fix.When the best-of-nine series begins, Cicotte (pitching in Game 1) deliberately hits Reds leadoff hitter Morrie Rath in the back with his second pitch in a prearranged signal to gangster Arnold Rothstein that the fix was on (Rothstein allegedly financed the fix). Cicotte then pitches poorly and gave up 5 runs in four innings—four of them in the 4th, including a triple given up to Reds pitcher Walter \"Dutch\" Ruether. He is then relieved by Gleason, though the Sox lose the first game 9–1. Williams also pitched poorly in Game 2, while Gandil, Risberg and Hap Felsch made glaring mistakes on the field. Several of the players become upset, however, when the various gamblers involved fail to pay their promised money up front.Chicago journalists Ring Lardner and Hugh Fullerton grow increasingly suspicious. Meanwhile Gleason continues to hear rumors of a fix, but he remains confident that his boys will come through in the end.A third pitcher not in on the scam, rookie Dickey Kerr, wins Game 3 for the Sox, making both gamblers and teammates uncomfortable. Other teammates such as catcher Ray Schalk continue to play hard, while Weaver and Jackson show no visible signs of taking a dive with Weaver continuing to deny being in on the fix. Cicotte loses again in Game 4. With the championship now in jeopardy, Gleason intends to bench Cicotte from his next start, but he begs for another chance. The manager reluctantly agrees and is given an easy Game 7 win. Unpaid by the gamblers, Williams also intends to win, but when his wife's life is threatened, he purposely pitches badly and was relieved after just a few batters with \"Big\" Bill James. Jackson hits a home run, but the Sox lose the final game. Cincinnati wins the Series (5 games to 3). The film ends in the Sox dugout, with Gleason at least great with Weaver's stats throughout the Series.","language":"English","Reception":"The review aggregator website Rotten Tomatoes gave the film a rating of 85%, based on 48 reviews, with an average rating of 7.2/10. The site's critical consensus reads, \"Perhaps less than absorbing for non-baseball fans, but nevertheless underpinned by strong performances from the cast and John Sayles' solid direction.\"[11]When the film was first released, the film industry staff at Variety magazine wrote:\"Perhaps the saddest chapter in the annals of professional American sports is recounted in absorbing fashion in Eight Men Out...The most compelling figures here are pitcher Eddie Cicotte (David Strathairn), a man nearing the end of his career who feels the twin needs to ensure a financial future for his family and take revenge on his boss, and Buck Weaver (John Cusack), an innocent enthusiast who took no cash for the fix but, like the others, was forever banned from baseball.\"[12]Film critic Roger Ebert was underwhelmed, writing,\"Eight Men Out is an oddly unfocused movie made of earth tones, sidelong glances and eliptic[sic] conversations. It tells the story of how the stars of the 1919 Chicago White Sox team took payoffs from gamblers to throw the World Series, but if you are not already familiar with that story you're unlikely to understand it after seeing this film.\"[13]Ebert's television colleague Gene Siskel said, \"Eight Men Out is fascinating if you are a baseball nut ... the portrayal of the recruiting of the ball players and the tight fisted rule of Comiskey is fascinating ... thumbs up.\"[14]Critic Janet Maslin spoke well of the actors, writing,\"Notable in the large and excellent cast of Eight Men Out are D. B. Sweeney, who gives Shoeless Joe Jackson the slow, voluptuous Southern naivete of the young Elvis; Michael Lerner, who plays the formidable gangster Arnold Rothstein with the quietest aplomb; Gordon Clapp as the team's firecracker of a catcher; John Mahoney as the worried manager who senses much more about his players' plans than he would like to, and Michael Rooker as the quintessential bad apple. Charlie Sheen is also good as the team's most suggestible player, the good-natured fellow who isn't sure whether it's worse to be corrupt or be a fool. The story's delightfully colorful villains are played by Christopher Lloyd and Richard Edson (as the halfway-comic duo who make the first assault on the players), Michael Mantell as the chief gangster's extremely undependable right-hand man, and Kevin Tighe as the Bostonian smoothie who coolly declares: 'You know what you feed a dray horse in the morning if you want a day's work out of him? Just enough so he knows he's hungry.' For Mr. Sayles, whose idealism has never been more affecting or apparent than it is in this story of boyish enthusiasm gone bad in an all too grown-up world, Eight Men Out represents a home run.\"[15]","box_office":"$5.7 million [2]","cinematography":"Robert Richardson","directed_by":"John Sayles","DVD":"Eight Men Out was released on DVD by MGM (successor-in-interest to Orion Pictures) in two editions; a standard one on April 1, 2003, and a special edition on May 7, 2013.","release_dates":"September 2, 1988 (1988-09-02) (United States)|||||","Production":"During the late summer and early fall of 1987, news media in Indianapolis reported sightings of the film's actors, including Sheen and Cusack. Sayles told the Chicago Tribune that he hired them not because they were rising stars, but because of their ball-playing talent.[6]Sweeney remarked on the chilly Indiana temperatures in an interview with Elle magazine. \"It got down to 30, 40 degrees, but John [Sayles] would stand there in running shorts, tank tops, sneakers—sometimes without socks—and never look cold.\" The young actor said Sayles appeared to be focused on an \"agenda, and that's all he cared about. Looking at him we thought, 'Well, if he's not cold, then we certainly shouldn't be.'\"[7]Reports from the set location at Bush Stadium indicated that cast members were letting off steam between scenes. \"Actors kidded around, rubbing dirt on each other\", the Tribune reported. \"... Actors trade jokes, smokes and candy\" in the dugout. \"'Some of them chewed tobacco at first, but,' noted Bill Irwin, 'Even the guys who were really into it started to chew apricots after a while.'\"[8] Sheen made his reasons for taking the role clear. \"I'm not in this for cash or my career or my performance\", Sheen told the Tribune. \"I wanted to take part in this film because I love baseball.\"When cloud cover would suddenly change the light during the shooting of a particular baseball scene, Sayles showed \"inspirational decisiveness\", according to Elle, by changing the scripted game they would be shooting—switching from Game Two of the series to Game Four, for example. \"The second assistant director knew nothing about baseball\", Sayles told Elle, \"and she had to keep track of who was on base. Suddenly we'd change from Game Two to Game Four, and she'd have to shuffle through her papers to learn who was on second, then track the right guys down all over the ballpark.\"[9]Right-handed Sweeney told Elle that producers considered using an old Hollywood trick to create the illusion that he was hitting lefty. \"We could have done it from the right side, then run to third and switched the negative, like they did in The Pride of the Yankees, but we didn't really have enough money for that\", Sweeney said.[9]Ring Lardner, Jr., Oscar-winning screenwriter of such films as Woman of the Year and M*A*S*H, came to Bush Stadium to visit the set. Lardner's article in American Film magazine reported that Sayles' script depicted much of the story accurately, based on what he knew from his father. But the audience, Lardner wrote, \"won't have the satisfaction of knowing exactly why everything worked out the way it did.\"Lardner also witnessed how the production crew had to make \"a few hundred extras look like a World Series crowd of thousands\", which were hampered by the production's inability to entice a substantial number of Indianapolis residents to come to the stadium to act as film extras. Lardner stated, \"The producers offer free entertainment, Bingo with cash prizes, and as much of a stipend ($20 a day) as the budget permits ...\"[10]","produced_by":"Sarah Pillsbury","starring":"John Cusack|Clifton James|Michael Lerner|Christopher Lloyd|Charlie Sheen|David Strathairn|D.B. Sweeney|","running_time":"86 minutes","music_by":"Mason Daring","edited_by":"John Tintori","budget":"$6.1 million[1]"}