{"country":"Japan","distributed_by":"TLA Releasing","language":"Japanese","Synopsis":"Although aspiring actresses Nozomi (Koike) and Lana (Nonami) share a Tokyo apartment that's owned by their talent management agency, they're a world apart. Nozomi is a soft-spoken country girl from Sado Island who prides herself on being demure. City girl Lana, who grew up in a rough area of Tokyo, is more worldly, experienced and jaded.Whilst in apartment, they learn they have auditioned for the same part in a highly anticipated film called Yakuza Wives and that there will be a phone call in the morning that will reveal who wins the role. They decide to stay in for the phone call.A conversation between two actresses turns sour, bringing their hidden resentment to the surface, which pushes them into committing a series of violent acts against each other while arguing over their backgrounds, lifestyles, choices, and love lives.As they lay dying from severe injuries they inflicted on each other, their apartment phone finally rings at dawn. When it goes unanswered, it's switched to their answering machine. A male voice on the machine announces they both won the part.","Remake":"Wright Girls, an upcoming Hollywood Film with Gemma Arterton, directed by Andy Fickman, and written by Bert Royal, is planned. While it has not been confirmed as a remake, it's claiming inspiration from 2LDK.[1]There is also another upcoming movie, similar in idea and title to the original film called 2BR1BA [2]","directed_by":"Yukihiko Tsutsumi","Releases":"2LDK was released in DVD form in Japan, U.S. and Korean versions. It was also included in the 3-disc box set \"Danger after Dark\" (which includes Suicide Club and Moon Child as well). 2LDK, part of the Duel Project, was broadcast together with Aragami in Australia through Foxtel Television in 2005.","release_dates":"April 11, 2003 (2003-04-11) (Philadelphia International Film Festival)|May 13, 2004 (2004-05-13) (Japan)||||","Production":"2LDK was paired with Ryuhei Kitamura's film Aragami as the Duel Project. Producer Shinya Kawai issued a challenge to directors Tsutsumi and Kitamura to create a feature-length movie each consisting a duel, two actors and one setting, along with a rule that the filming should take just one week.Tsutsumi's 2LDK was filmed in eight days, with the cast and crew often working throughout the night.[citation needed]The title is a Japanese real estate acronym for an 2-bedroom apartment with a Living-room, Dining-room, and Kitchen.","2ldk":"Japanese Movie Poster","produced_by":"Shinya Kawai","starring":"Maho Nonami Daisuke Kizaki Eiko Koike","running_time":"70 minutes","written_by":"Yukihiko Tsutsumi"}