{"Cast":"Appearing as Sea World Kids are the children of McKay and Ferrell: Pearl McKay, Axel Ferrell, Magnus Ferrell, and Mattias Ferrell.[6]","country":"United States","distributed_by":"Paramount Pictures","Possible sequel":"On November 13, 2013, Will Ferrell spoke about the possibility of a third Anchorman film stating: \"I'm sure they would, But I don't know. We just want to see what happens with this one and we'll sit down and assess all of that. Right now, we're just enjoying this journey.\"[93] On December 9, 2013, Steve Carell said \"We'll see how this one goes\", and \"If people like it, maybe 10 years from now we'll do a third.\"[94]Director Adam McKay spoke to Empire in February 2014 and ruled out any further Anchorman films, saying \"It's done. I think that's it. It was great to do it and it was so fun to work with those guys again, but I think that's it for Ron Burgundy.\", and when asked if he would do sequels with any character he said \"No, that's the last sequel we're gonna do. There's nothing more fun to me than new characters and a new world. And now we're releasing this alt version, we're totally satisfied. No Anchorman 3.\"[95]However, on April 2, 2014, McKay stated that Anchorman 3 could still be a possibility. In an interview with Time, he stated \"I said about a month ago that we'd never do a third one, and I realized that was a little too harsh because the truth is, I really don’t know. With these movies, you really don't know how they've played until about two years after they come out, when people see them on repeat viewing.\" He then also went on to state that \"If Anchorman 2 gets that sort of second life, if three, four years from now people start asking us that question a lot and there's an idea, we would be open to that.\"[96]","Plot":"In 1979, Ron Burgundy (Will Ferrell) and Veronica Corningstone (Christina Applegate) are married and are both co-anchors for a prestigious news network in New York City. One day, Mack Tannen (Harrison Ford), the most famous nightly news anchor in New York, reveals that he is retiring. He intends to promote Corningstone, making her the first female nightly news anchor in the history of television, and to fire Burgundy due to his continuously sloppy performance on air. Burgundy grows jealous of Corningstone's success and storms out of the house, leaving her and their six-year-old son Walter (Judah Nelson).Six months later, Burgundy is back in San Diego, but barely able to hold a job due to his depression. After being fired from SeaWorld and botching a suicide attempt, Burgundy accepts a job offered to him by Freddie Shapp (Dylan Baker) with GNN (Global News Network), the world's first 24-hour cable news network, for GNN's official launch. He reassembles his news team, finding Champ Kind (David Koechner), who owns a fried chicken store (that sells bats secretly to cut down on costs), Brian Fantana (Paul Rudd), now a famous cat photographer, and Brick Tamland (Steve Carell), who is presumed dead but appears at his own funeral. They are assigned the unpopular late-night timeslot while obnoxious rival anchorman Jack Lime (James Marsden) is put in a primetime slot. Meanwhile, Burgundy finds that Corningstone has started dating another man, a psychologist named Gary (Greg Kinnear).As GNN launches, Burgundy decides to broadcast what the people want to hear, rather than what they need to hear. He and his team devise a sensationalist and patriotic newscast. Their new approach proves to be a hit, beating Lime in ratings by a massive margin, and the other news networks scramble to emulate them. Burgundy and his team are promoted to primetime, where they enjoy fame and fortune. Burgundy's success excites GNN's manager, Linda Jackson (Meagan Good), and they begin a romantic relationship. Tamland meets a similarly eccentric GNN office worker named Chani (Kristen Wiig) and immediately falls in love. Burgundy lets his newfound fame get to his head and neglects his parental obligations to Walter, angering Corningstone. He also alienates Fantana, Kind, and Tamland, claiming he is tired of carrying them.During a party celebrating GNN's success, Lime causes Burgundy to slip and suffer a head injury, resulting in him becoming blind. Unable to read the news, Burgundy isolates himself in a lighthouse, unable to adjust to his loss of sight. Corningstone arrives with Walter for a visit, announcing that she has quit her own job, and Burgundy bonds with his family, gradually overcoming his disability. Burgundy and his son rehabilitate a small shark, naming him Doby before setting him free. Later, Burgundy finds out that Corningstone was hiding messages from his eye doctor about an experimental procedure, since she believed his blindness to have been significant in the family bonding. He leaves angrily, gets his sight restored, and returns to GNN.Back in New York, Burgundy is once again approached by Corningstone, who pleads with him to attend Walter's piano recital. At the same time, an exclusive news story comes in, requiring Burgundy to cover it. On live TV, Burgundy instead goes on a rant criticizing news networks, including GNN, for focusing on ratings rather than the news. He leaves for Walter's recital but is intercepted by an angered Lime and his team and several other news teams, all of whom want to kill him due to his fame. Burgundy's friends arrive to defend him and a massive battle ensues. Burgundy's old arch-rival Wes Mantooth (Vince Vaughn) arrives in time to save Ron from Lime's news crew, before Brick sets off an explosion. Burgundy manages to reach Walter's recital in time.Burgundy and his friends later attend Tamland's and Chani's wedding on the beach. During the wedding, Ron spots Doby in the water and tries to greet him, only to be attacked, forcing his dog Baxter to rescue him.","language":"English","Reception":"Rotten Tomatoes gave the film a rating of 75%, based on 185 reviews, with an average score of 6.4/10. The site's consensus reads: \"It's just as uneven and loosely structured as the first Anchorman—and while Anchorman 2: The Legend Continues may not be quite as quotable, it's nearly as funny as its predecessor.\"[56] On Metacritic, it holds a score of 61 out of 100, based on 40 critics, indicating \"generally favorable reviews\".[57]Colin Covert of the Star Tribune gave the film three out of four stars, writing, \"It may not leave the same imprint on American culture as its super-quotable predecessor. But it has moments of howling hilarity and the improvisatory spirit that gave Ron Burgundy's origin story its shaggy, ramshackle charm.\"[58] Todd McCarthy of The Hollywood Reporter gave the film a positive review, writing, \"It's bawdy, on-target in its take on what's become of TV news, and packed with wacky performers.\"[59] Alonso Duralde of The Wrap gave the film a negative review, writing, \"It's a constant barrage of joke-joke-joke, but they're all gags that take place in the moment and are immediately shoved aside for the next one. Nothing builds. There are no setups for later payoffs.\"[60] Tom Huddleston of Time Out gave the film three out of five stars, writing, \"Anchorman 2: The Legend Continues is not the disaster some feared it might be, but neither is it the endlessly quotable, deliciously idiotic follow-on so many of us were optimistically anticipating.\"[61] Joe Neumaier of the New York Daily News gave the film two out of five stars, writing, \"Anchorman 2 joins Caddyshack II, Airplane II, Breakin' 2: Electric Boogaloo and Arthur 2: On the Rocks on the list of unnecessary sequels.\"[62] Stephanie Zacharek of The Village Voice gave the film a positive review, writing, \"With those eyes that are a little too close together, and that confident swagger that looks as if it could disintegrate into a pratfall at any time, Ferrell makes a grand ringleader for all this nonsense.\"[63]Richard Roeper gave the film four out of five stars, calling it \"one of the funniest movies of the year, and in its own loony way, it's a sharp, dead-on satire.\"[64] Peter Howell of the Toronto Star gave the film two and a half stars out of four, writing, \"Anchorman 2 is frequently amusing, with your personal hilarity meter likely to rate it higher if you enjoy seeing beloved characters acting even goofier than before.\"[65] Joe Williams of the St. Louis Post-Dispatch gave the film two out of four stars, writing, \"The movie lacks an effective comedic structure. There's nothing to stop Ferrell and co-writer/director Adam McKay from wobbling across the fine line between stupid and clever like they've had too much scotch.\"[66] Rene Rodriguez of the Miami Herald gave the film one out of four stars, writing, \"Fans have been clamoring for a sequel to Anchorman: The Legend of Ron Burgundy for so long, Will Ferrell (and financier Paramount Pictures) finally decided to give the people what they wanted. The moral of the story? Be careful what you wish for.\"[67] Kyle Smith of the New York Post gave the film two out of four stars, writing, \"Anchorman 2 is like watching Anchorman being re-enacted by semi-professionals trying to cover up their lapses by being extra-emphatic, super-doofy: 2013 Steve Carell does a lousy impression of 2004 Steve Carell.\"[68] Peter Hartlaub of the San Francisco Chronicle gave the film three out of four stars, writing, \"It's clear that the people who created the first Anchorman wanted to hang out on a set again together. That's better than getting back together just to make money.\"[69] Stephen Whitty of the Newark Star-Ledger gave the film two and a half stars out of four, writing, \"Ferrell and director Adam McKay pushed things even further, raunchier and weirder.\"[70]Ian Buckwalter of NPR gave the film a positive review, saying, \"Time will tell if this film is as quotable as its predecessor, but for now, Anchorman 2 coasts along quite successfully on sheer manic eccentricity.\"[71] A.O. Scott of The New York Times gave the film a positive review, writing, \"The sheer density of the jokes guarantees a few laughs for every taste ... and the loose, improvisational energy of the performers keeps things lively.\"[72] Claudia Puig of USA Today gave the film three out of four stars, writing, \"The movie cleverly spoofs the 24-hour TV news cycle, as well as sexism and racism in the workplace. Not every scene is equally funny, of course, but most of the comic antics generate laughs.\"[73] Betsy Sharkey of the Los Angeles Times gave the film a negative review, writing, \"While I'm glad Anchorman is back – we need a little levity in this year of heavy films – I do wish it were better.\"[74] Steven Rea of The Philadelphia Inquirer gave the film three out of four stars, writing, \"Burgundy and his goofball buddies are faced with dramas and dilemmas that may seem arbitrary and contrived on paper but have an urgent puissance onscreen, as Ferrell and company act their little hearts out. OK, not really.\"[75] Chris Nashawaty of Entertainment Weekly gave the film a B, writing, \"Comedy sequels generally follow the law of diminishing returns. If it has a 2—or, classier yet, a II—in the title, the smart money says that it won't be as funny as the original. Anchorman 2: The Legend Continues doesn't defy that axiom, but it's still plenty hilarious in a reheated sort of way.\"[76] Michael Phillips of the Chicago Tribune gave the film two and a half stars out of four, writing, \"Maybe if I liked the first Anchorman a little less, I'd like Anchorman 2 a little more. Still, I laughed.\"[77]Bill Goodykoontz of The Arizona Republic gave the film three out of five stars, writing, \"For almost every aspect of the movie I want to criticize, there is a corresponding defense.\"[78] Soren Anderson of The Seattle Times gave the film three out of four stars, writing, \"It's a piñata at which Ferrell & Co. swing away wildly. They often miss their mark, but when they connect, out fall the laughs in great big bunches.\"[79] Ann Hornaday of The Washington Post gave the film two and a half stars out of four, writing, \"Considering the improvisatory talents – even genius – of Ferrell and his co-stars, it's no surprise that laughs abound in Anchorman 2.\"[80] Peter Travers of Rolling Stone gave the film three out of four stars, writing, \"When is a movie fall-down funny even when some scenes fall flat on their fat ones? When it's Anchorman 2: The Legend Continues.\"[81] James Berardinelli of ReelViews gave the film two and a half stars out of four, commenting, \"At two hours, Anchorman 2 overstays its welcome by at least 20 minutes, if not longer.\"[82] Ty Burr of The Boston Globe gave the film a positive review, writing, \"See it with a crowd, laugh yourself silly, and feel slightly ashamed in the morning.\"[83] Scott Foundas of Variety gave the film a positive review, writing, \"A modestly less quotable but generously funny new adventure for scotch-and-mahogany-loving 1970s newsman Ron Burgundy, here catapulted into 1980 and the dawn of the 24-hour news cycle.\"[84] Rafer Guzman of Newsday gave the film a positive review, writing, \"This sequel may not produce any quotable lines, but to borrow one from the original: Don't act like you're not impressed.\"[85]Anchorman 2: The Legend Continues grossed $127.4 million in North America, and $46.3 million in other countries, for a worldwide total of $173.6 million.[3] In North America, the film opened at number two in its first weekend, with $26.2 million, behind The Hobbit: The Desolation of Smaug.[86] In its second weekend, the film dropped to number three in the United States, grossing an additional $19.7 million.[87] In its third weekend, the film dropped to number six in the United States, grossing $10.6 million.[88] In its fourth weekend, the film dropped to number 10 in the United States, grossing $5.8 million.[89]Anchorman 2: The Legend Continues was released on DVD and Blu-ray on April 1, 2014.[90]","box_office":"$173.6 million[3]","cinematography":"Oliver Wood","production_company":"Apatow Productions Gary Sanchez Productions","directed_by":"Adam McKay","Soundtrack":"Anchorman 2: The Legend Continues: Music from the Motion Picture is the soundtrack of the film. It was released on December 17, 2013, by Republic Records.[91][92]","release_dates":"November 24, 2013 (2013-11-24) (Sydney premiere)|December 18, 2013 (2013-12-18) (United States)||||","Production":"This is the first film in the series to be released by Paramount Pictures, which acquired the DreamWorks back catalog in 2006 (and owned the studio itself until 2008), including ownership of the first movie and other films from DreamWorks that were made before the Paramount merger.[7]In May 2008, Adam McKay said that he and Will Ferrell had talked about wanting to do an Anchorman sequel, saying: \"I'm looking to do another movie, I might do this other movie called Channel 3 Billion which is kind of this science fiction/Brazil-type comedy. Then after that, Will and I are like, 'let's do Anchorman 2'... so you're talking like 2 years maybe we'll do it. But we're going to do it, for sure.\"[8] On July 23, 2008, McKay announced that he and Ferrell had begun work on the sequel.[9] Carell and Rudd, both of whom had become major stars since Anchorman was released, agreed to take pay cuts for the movie, as did Ferrell himself.[10] On April 29, 2010, McKay announced that Paramount Pictures had turned down a proposal for the sequel, despite the proposed pay cuts, saying: \"So bummed. Paramount basically passed on Anchorman 2. Even after we cut our budget down. We tried.\"[10]In a May 2010 interview, Ferrell spoke about Paramount passing on the film, saying: \"Well, you know, yeah, it's a little peculiar. On the one hand, [we were] being begged to do a sequel for such a long time, and then we finally came up with a concept that we liked, we talked to all the guys, and everyone was up for it. And then to get the reaction we got, yeah, it's slightly puzzling to us. But you know what? It's also their money. They get to do or not do whatever they want. So we’ll see. We’re still going back and forth. Maybe there is a solution. Or, I know in talking to Adam, if it never happens, then it never happens. And that's fine, too. So we’ll just see.\"[11] A year later, in April 2011, Ferrell publicly stated that Paramount, which owns the rights to Anchorman, had decided against the idea of a sequel, stating \"We've run the numbers and it's not a good fit.\"[12] In March 2012, Paramount changed their minds and agreed to make a sequel; on March 28, 2012, Ferrell officially announced the film on Conan, in character as Ron Burgundy.[13] In an interview in April 2012, McKay said that the script was a work in progress, and that the story might include a custody battle and bowling.[14] In a May 2012 interview, he was quoted as saying that nothing was set.[15]In May 2012, Will Ferrell confirmed that script writing had begun and that filming would begin around February 2013.[16] By June 2012, parts of the story had solidified, including a move of the location from San Diego to New York,[17] and a focus on the onset of the cable news era in the 1980s.[18] In August 2012, Vince Vaughn confirmed that his character, Wes Mantooth, would appear in the film, and hinted at the possible appearance of Wes Mantooth's mother, Dorothy, who was mentioned in the first film. He expressed interest in Angela Lansbury playing the role.[19] On December 19, 2012, it was announced that the film would be released on December 20, 2013.[20] McKay confirmed in February 2013 that actress Kristen Wiig had joined the cast.[21]Filming began in March 2013.[22] On March 4, 2013, actor Harrison Ford was spotted on set with Will Ferrell.[23] Some filming took place on St. Simons Island, Georgia starting on April 22, 2013, through May 8, 2013. Crews built a mock lighthouse and filmed a shark scene.[24] Filming took place in Atlanta, substituting for New York City.[25] Filming was scheduled for San Diego in the end of May 2013 (May 24 at Sea World San Diego).[26] There was a casting call in San Diego on May 11, 2013.[26] Some shots were made at Liberty State Park in Jersey City, New Jersey in May 2013.[27]","anchorman_2:_the_legend_continues":"Theatrical release poster","produced_by":"Judd Apatow|Will Ferrell|Adam McKay|","starring":"Will Ferrell|Steve Carell|Paul Rudd|David Koechner|Christina Applegate|","running_time":"119 minutes[1]","music_by":"Andrew Feltenstein|John Nau|","edited_by":"Brent White|Melissa Bretherton|","Release":"On November 27, 2013, Paramount Pictures moved the release date up two days from December 20, 2013, to Wednesday, December 18, 2013.[28] Paramount notified theater owners that Anchorman 2 would be their last film with a US release on 35mm film stock.[29] According to the Los Angeles Times, the decision made Paramount the \"first big studio\" to stop releasing its major movies on film in the United States.\"[29] On February 28, 2014, an R-rated version of the film titled, Anchorman 2: The Legend Continues: Super-Sized R-Rated Version (titled Anchorman 2: The Legend Continues Continued in the United Kingdom)[30] featuring \"763 new jokes\" was released in theaters for one week only.[31]On March 28, 2012, actor Will Ferrell officially announced the sequel dressed in character as Ron Burgundy on the late-night talk-show Conan.[32] A teaser trailer was filmed approximately one week after Ferrell's announcement.[33] The teaser trailer, featuring Ferrell, Rudd, Koechner and Carell, premiered on May 16, 2012 in front of the movie The Dictator.[34] An online version of the trailer premiered on May 21, 2012 on the website FunnyOrDie.com.[35] A third teaser trailer was released on YouTube on May 18, 2013, with the movie retitled as Anchorman 2: The Legend Continues, adding the number 2 to the title.[36] The first full theatrical trailer was released on June 19, 2013.[37] A second trailer was released on October 23, 2013 and was attached to Jackass Presents: Bad Grandpa.[38]On June 5, 2013, the Newseum in Washington, D.C., in collaboration with Paramount, opened an exhibition relating to the sequel, including props from the movies.[39] In October 2013, Chrysler Group LLC cross-promoted the film with a series of commercials featuring Ron Burgundy and the Dodge Durango.[40] On October 22, 2013, it was announced Ben & Jerry's would be releasing a limited edition ice cream flavor in promotion of the film called Ron Burgundy's Scotchy Scotch Scotch.[41] On November 19, 2013, an autobiographical book called Let Me Off at the Top!: My Classy Life and Other Musings was released under the Ron Burgundy moniker.[42] Paramount Pictures launched the Anchorman 2: Scotchy Scotch Toss game for Apple mobile devices on November 25, 2013,[43] and the Scotchy Scotch Toss game for Android devices on December 5, 2013.[44]As part of a product placement deal with the film, Miller Lite decided to reintroduce their original packaging on their 16-ounce cans for the duration of the film's theatrical release, as the original logo was contemporary with the setting of the film. The retro packaging on the Miller Lite cans proved to be so popular that by September 2014 Miller Brewing Company announced that it would switch back to the packaging full-time on all Miller Lite products.[45]On November 25, 2013, in Sydney, Australia, Ferrell (in character as Ron Burgundy) joined the panel for a segment on the live Network Ten program The Project, reading some of the day's news and squaring off against veteran Australian news anchor, Ray Martin; in a subsequent segment, Ferrell (dressed as himself) was joined by Carrell, Rudd and Koechner to promote the film.[46] On November 30, 2013, Ferrell co-anchored a newscast on Bismarck, North Dakota's CBS affiliate KXMB-TV in character as Ron Burgundy. The next day, he made a guest appearance on TSN's coverage of the Canadian Olympic Curling Trials from Winnipeg, Manitoba.[47] On December 4, 2013, Emerson College named its School of Communication the \"Ron Burgundy School of Communication\" for a day.[48] On December 4, 2013, it was announced that Ferrell was scheduled to appear on SportsCenter on December 5, 2013, in character as Ron Burgundy, but the appearance was cancelled in light of a news conference regarding sexual assault allegations against quarterback Jameis Winston.[49]On December 9, 2013, the European premiere was held in Ireland, at the Savoy Cinema, Dublin. The director and four main cast members were in attendance.[50][51] On December 11, 2013, entertainment website IGN announced that Ron Burgundy would be a featured presenter on the site, with the site posting Burgundy-material everyday until December 18, 2013.[52] On December 13, 2013, Ferrell, Carell, Rudd and Koechner were guests on The Late Late Show on Irish television to promote the movie.[53] On December 16, 2013, Ferrell appeared on the Late Show with David Letterman to promote the film.[54] On December 19, 2013, Ferrell appeared on Jimmy Kimmel Live! and performed \"Ride Like the Wind\" in character as Ron Burgundy with Christopher Cross.[55]","written_by":"Will Ferrell|Adam McKay|","budget":"$50 million[2]"}