{"Cast":"The documentary includes footage, commentary, and interviews from eleven of the original members of the Z-Boys team, along with the team's co-founders, skateboarding champions, and other relevant skateboarding figures, journalists, and musicians from the era.[7]","country":"United States","distributed_by":"Sony Pictures Classics","language":"English","Reception":"The documentary initially gained notability after its debut at the Sundance Film Festival where it won several awards. The film was well received by many critics, noted by Wall Street Journal reporter Steve McKee who stated that the documentary had opened with \"boffo reviews\" from around the country.[8] The film received a rating of 92 percent on Rotten Tomatoes and a generally favorable rating of 76 on Metacritic.[9][10] Stephen Holden of the New York Times said the film was a \"giddy, thrilling, rock 'n' roll-saturated history of skateboarding in Southern California.\"[1]On the opening weekend of April 2002, Dogtown and Z-Boys made $103,355. By August 2002, the film had grossed $1,293,295 in the United States.[7] According to Peralta in a 2004 interview, \"Dogtown has sold over a million DVDs and more than 700,000 VHS.\"[11]","Synopsis":"Dogtown and Z-Boys, narrated by Sean Penn, begins with the history of skateboarding in Southern California and how it had been strongly influenced by the surf culture in the surrounding areas of Santa Monica and Venice, nicknamed Dogtown.[1] Surf shop owners Jeff Ho, Skip Engblom, and Craig Stecyk established the Zephyr Skateboard Team with local teenagers from broken homes.[2] The sport of skateboarding continued to evolve as the Z-Boys continued to bring edgy moves influenced by surfing. During one of California's record-breaking droughts, local backyard pools were emptied and became hotspots for these young skateboarders looking for places to skateboard.[1] The members of the Zephyr team gained notability and national attention when they competed in skateboard championships and started to receive media attention for their skills as young athletes. Testimonials and commentary provided by the members and founders of the Zephyr team combined with the rock-and-roll soundtrack and vintage footage all come together in this documentary about the history and lives of the original Z-Boys and skateboarding subculture of California.[3]","cinematography":"Peter Pilafian","directed_by":"Stacy Peralta","narrated_by":"Sean Penn","release_dates":"January 19, 2001 (2001-01-19)|||||","Production":"The documentary features vintage video footage and photos of the Zephyr skateboard team from the 1970s, along with contemporary interviews from the original members of the Z-Boys group.[4] The film combines the 8-mm and 16-mm vintage footage with modern editing and a soundtrack crafted from music of the 1970s era.[4]Dogtown and Z-Boys was directed by Stacy Peralta, an original member of the Zephyr team, and written by Peralta and Craig Stecyk, a leading surf and skateboard film producer and photojournalist.[1]The film operated on a budget of $400,000 financed by Vans, Inc.[5] Stecyk and photojournalist Glen E. Friedman, were the film's co-writer and co-producer, respectively,[6] Daniel Ostroff and Stephen Nemeth were also co-producers, and Debra MacCulloch and Christine Triano were associate producers involved with the film.[7]","produced_by":"Agi Orsi Daniel Ostroff Stephen Nemeth","starring":"Jay Adams Tony Alva Bob Biniak Chris Cahill Paul Constantineau Skip Engblom Jeff Ho Shogo Kubo Jim Muir Michael Ramsey (voice) Peggy Oki Stacy Peralta Nathan Pratt Wentzle Ruml IV Allen Sarlo Craig Stecyk Glen E. Friedman","running_time":"91 minutes","Awards and recognition":"Dogtown and Z-Boys was entered in the 2001 Sundance Film Festival and won two awards: the Audience Award and Directing Award.[12] The film also won the Independent Spirit Award for Best Documentary in 2001.[13]","edited_by":"Paul Crowder","written_by":"Stacy Peralta Craig Stecyk","budget":"$400,000"}