{"country":"United States","distributed_by":"20th Century Fox","black_knight":"Theatrical release poster","Plot":"Jamal Walker (Martin Lawrence) is an everyday slacker with a job at a crummy theme park called Medieval World, which is about to receive big competition from another theme park, Castle World. While cleaning a moat surrounding the park, he finds a medallion in the moat and when he tries to retrieve it he gets sucked into the past. He awakes in England, 1328, where he is first met by a drunkard named Knolte. He then searches for Medieval World, but he finds a castle that he thinks is Castle World, so he decides to check it out. The tenants of the castle believe him to be a French Moor, from Normandy, because he tells them he is from Florence and Normandie, a famous intersection in South Central Los Angeles.Jamal is soon taken in by the reigning king, King Leo (Kevin Conway). He is assumed to be a messenger from Normandy who the king believes to be bringing news of an alliance between England and Normandy. Although at first Jamal thinks that all the people around him are just actors in a theme park he changes his mind when he witnesses a beheading. He gives his name as Jamal \"Sky\" Walker after his high school basketball nickname, and, after gaining trust from the king by accidentally preventing his assassination, Jamal is made a lord and head of security. While all of this is going on, Jamal finds out about the ruthless way the king came to power by overthrowing the former queen. He learns from Victoria (Marsha Thomason), a chambermaid, and Sir Knolte (Tom Wilkinson), a former knight of the queen who has become an alcoholic and whom he met when he first awoke there. Through their help and his own realization of the situation, Jamal soon understands he must help overthrow King Leo and help restore the queen to her throne.With some effort, Jamal manages to convince the decimated rebels and townsfolk to band together to overthrow the king. Using modern-day tactics used in American football and pro wrestling, he gives the peasants the means to fight the armed and armored king's guards. Out of gratitude for helping him find his honor again, Knolte teaches some basic sword-fighting maneuvers to Jamal, and also tells him that he has an idea that may give them an advantage in the upcoming battle.The next day, Knolte and the rebels storm the castle, only to find themselves quickly surrounded by guards and Leo's bodyguard, Percival (Vincent Regan). The tide turns briefly when the legendary Black Knight charges in, breathing fire and scattering the guards, but the plan goes awry when he falls from his horse and is revealed to be Jamal in disguise. Using their newfound skills, the peasants succeed in overpowering the guards, but Knolte is severely wounded by a longbow shot from Percival, who takes Victoria hostage. Charging to the rescue, Jamal surprises Percival with his fighting skills, rescuing Victoria. Percival is then shot dead by Knolte before he could administer a killing blow to Jamal.After the Queen's reign is restored, Jamal is knighted by her and during the dubbing, he awakes back at Medieval World surrounded by his co-workers and a medical team who saved him from drowning in the moat. After being saved Jamal's whole attitude changes and he helps his boss to make Medieval World better so that Castle World will not run them out of business. Later on, Jamal takes a walk around the new Medieval World and he meets a woman named Nicole (Thomason) who looks just like Victoria. They talk a little and he asks her out to lunch. Unfortunately, Jamal forgets to get Nicole's number and when he tries to catch up to her, he accidentally falls back into the moat, and wakes up in the Colosseum of Ancient Rome, where he is about to be devoured by lions.","language":"English","box_office":"$39,976,235[1]","cinematography":"Ueli Steiger","production_company":"Regency Enterprises Runteldat Entertainment The Firm, Inc.","directed_by":"Gil Junger","release_dates":"November 21, 2001 (2001-11-21)|||||","Box office":"The film opened at #4 at the U.S. box office in its opening weekend with $11,102,948.[3] Black Knight ultimately grossed $40 million worldwide, failing to recoup its $50 million budget, making it a box office bomb.","produced_by":"Arnon Milchan Darryl J. Quarles Michael Green Paul Schiff","starring":"Martin Lawrence Marsha Thomason Tom Wilkinson Kevin Conway","running_time":"95 minutes","music_by":"Randy Edelman","edited_by":"Michael R. Miller","Critical reaction":"The film garnered mostly negative reviews, receiving a 14% on Rotten Tomatoes, where the \"critical consensus\" was stated as \"Black Knight feels like a lazily constructed movie, filled with lame gags and constant mugging from Lawrence.\" [2]","written_by":"Darryl J. Quarles Peter Gaulke Gerry Swallow","budget":"$50 million[1]"}