{"country":"India","distributed_by":"UTV Motion Pictures[1]","story_by":"N. Linguswamy","Legacy":"After the failure of the film, Linguswamy was widely mocked in social media for his comments he mentioned in an interview prior to the release. The words \"Naan Appadiye Tune Aayiruken\" (he has ‘tuned’ himself to the script) and \"Kathukitta Motha Vithaiyum\" (he applied all that he has learnt in these years of cinema) became popular.[75]","Plot":"A handicapped Krishna (Suriya) arrives at Mumbai. He, along with a taxi driver (Soori) travel along Mumbai to look for his brother. He then meets a close friend of Raju and tells Krishna that Raju is Raju Bhai (Suriya). He then meets JK and he tells his experience with Raju Bhai and tells him that Raju could have killed him but spared JK. Krishna finally meets Karim Bhai (Joe Malloori) and he tells Krishna that Raju and Chandru (Vidyut Jamwal) were inseparable friends and were growing dons as they emerging in the underworld their enemies too grows. Then a new Commissioner plans to clean the city and kills a few people of Raju's gang. Raju then retaliates this by kidnapping the Commissioner's daughter Jeeva (Samantha Ruth Prabhu) and keeps her as a hostage for a day and when Raju goes to leave her back she tells that she actually doesn't want to go and doesn't want to marry because she didn't love anyone. Both of them then develop love. Things go well until Raju and Chandru invoke the wrath of Imran Bhai (Manoj Bajpai) who is a bigger and more powerful don than them and Chandru keeps chanting what Imran says to him that Imran would 'shoot them like pigs'. Raju then gives Chandru a surprise by capturing Imran. Chandru becomes thrilled about it and gives Raju a surprise by getting him a new car. Raju then meets Jeeva inside. Chandru tells him that he had given Raju a surprise and tells him to stay away for seven days with Jeeva. Raju and Jeeva have a blast. When Raju comes back he sees Chandru murdered in a ghastly manner. A frustrated Raju goes in search of the killers is also shot by his own man, Amar. Krishna then becomes worried. At that very time Amar gets to know that Krishna was looking for him and tries to kill Krishna. Then it is revealed that Krishna is Raju. Raju then fights them and kills Amar. He then goes to find Jackie in a horse race. Jackie tells him to ask Johny. Raju then finds Johny in a shopping mall and Johny tells him that they along with Imran had plotted to kill Chandru when Raju was away. A disappointed Raju kills Johny. Raju then kills one more betrayer, Manoj, in a fight and shoots him. Then Imran's men kidnap Karim Bhai's daughter. When Raju gets there Karim tells him it wasn't his daughter, it was Jeeva. Raju finally battles them and at last kills Imran Bhai. Raju, after rescuing Jeeva, reunites with her and happily leave Mumbai.","language":"Tamil","Reception":"Anjaan opened to negative reviews from critics, with praise directed towards Suriya's performance and the background score, and criticism towards the length of the film, the placement of songs, the screenplay and the plot.[68] Sify wrote, \"On the whole, Anjaan is for those who seek unabashed entertainment and relish masala films.\"[69] M. Suganth of The Times of India gave 1.5 out of 5 and wrote, \"When a film announces loud and clear, all that it wants to do is be in service of its hero, and make him as larger than life as possible, we accept it and all that we expect from it is to entertain us. But when it takes almost three hours to narrate its story with predictable twists and underwritten characters in a non-engaging fashion.\"[70] IANS wrote, \"It is high time Lingusamy, who is reluctant to change, accepts the fact that age-old formula doesn't work anymore.\", and rated the movie 3 out of 5.[71] Indiaglitz wrote, \"A commercial entertainer that might not go beyond Suriya's fan base!\", and gave the movie 1.5 out of 5 stars.[72] Behindwoods rated the movie 2 out of 5 and concluded, \"Suriya and Anjaan, [is] let down by the screenplay!\".[73] Ramchander of OneIndia gave 2.5 out of 5 and wrote, \"Surya's Anjaan is lengthy and it is just an average movie in the end.\"[74]","cinematography":"Santosh Sivan","production_company":"Thirrupathi Brothers","directed_by":"N. Lingusamy","Soundtrack":"The soundtrack and the score for the film were composed by Yuvan Shankar Raja, making Anjaan the fourth collaboration between the composer and director Lingusamy. The soundtrack album, released on 23 July 2014 to positive reviews, features five tracks, written by four lyricists. The male portion of one of the songs, \"Ek Do Theen\", was sung by Suriya and became his first attempt at playback singing.[43]","anjaan":"Film poster","release_dates":"14 August 2014 (2014-08-14) (Kuala Lumpur premiere)|15 August 2014 (2014-08-15) (Worldwide, including India)[2]||||","Production":"In July 2012, it was reported first that Suriya had signed on Lingusamy's film to be produced under the director's banner and that he would work on it after Maattrraan (2012) and Hari's Singam 2 (2013).[9] After the completion of both films, the actor was reported to work simultaneously with Lingusamy and director Gautham Menon for a film titled Dhruva Natchathiram.[10] In September 2013, many sources incorrectly stated that the film was titled Mumbai Rowdy, however the director denied these as rumors.[11] Suriya reportedly waited for six months after Singam 2, but failed to receive a complete script from Gautham Menon and no progress took place in this period of time. Owing to this reason, he opted out of Gautham's film in October 2013 and announced that he would soon start work on Lingusamy's film.[12] The director confirmed the news and also stated the film would officially start filming from mid-November 2013. It was said that the script had been modified a few times.[13] The film was started without a title. In January 2014, the title was officially announced to be Anjaan.[14] Vijay Milton was initially signed by Lingusamy as the cinematographer for the film,[15] but in October 2013 he was replaced with Santosh Sivan, collaborating with Lingusamy for the first time.[16] The film's editing was reported to be handled by Anthony while Rajeevan was recruited as the art director. Brinda Sarathy was confirmed to be the dialogue writer for the film.[17]In early November 2013, Manoj Bajpai was reported to be playing the film's antagonist while Vidyut Jamwal would also appear in a prominent role.[18] Dalip Tahil was signed on for the role of a small, but powerful don in the film.[19] In January 2014, actress Samantha Ruth Prabhu was added to the cast.[20] Comedian Vivek was approached to play a role in the film,[21] but could not take up the offer as a result of date clashes with Vai Raja Vai.[22] Instead in March 2014, another comedian Soori was signed.[23] Sana Khan was approached to do a special number in the film but she declined the offer as she wanted to promote her Bollywood film Jai Ho (2014).[24] Actress Maryam Zakaria was chosen to do an item number in the film.[25] Chitrangada Singh was chosen for another item number after discussions to have Sonakshi Sinha[26] and later, Kareena Kapoor, in the song were unsuccessful.[27]In mid-October 2013, a test shoot occurred with Suriya and Malavika Rampradeep, a Bharatanatyam dancer, with the Red Dragon 6K Digital camera along with a high zoom lens.[28] It was reported that it was the first film in the world to be shot with the camera.[29] The technology had not even been used in Hollywood films, according to the makers.[30] Suriya was said to possess two different appearances for filming, starting with a raw and jagged look,[17] whereas, his other look was not yet revealed and that it was kept as a surprise for his fans in the movie.[31] Filming started on 20 November 2013 in Mumbai.[32] A few days before it began, Suriya completed a photo-shoot of the film which was done by still photographer Venkatram.[33] The lead actors were shooting in Mumbai, but came back to Chennai before the one-month schedule.[34] In December 2013 the intro song was filmed with Suriya, Vidyut Jamwal and Maryam Zakaria.[25] The song was shot in a set, worth ₹80 lakh (US$120,000), that had been erected in Borivali in Mumbai.[35] The first schedule was wrapped in early January 2014.[36] In early February 2014, the crew was shooting for a song sequence in Panchgani.[37][38] The third schedule started on 5 March 2014 in Mumbai.[39] An item number featuring Manoj Bajpai and Chitrangada Singh was shot in March 2014.[26] The song written by Na. Muthukumar was shot in June 2014 at the Morjim and Miramar beaches of Goa during the final schedule of 10 days.[40]While shooting for the film in Goa, Suriya injured his knee during a stunt sequence. Lingusamy stated that the actor suffered a minor ligament tear when a fighter who weighed about 120 kg fell from a height on his leg. The entire unit panicked when the incident happened but the actor wasn't fluttered. The director clarified that Suriya would be fit and fine soon and that he took a short break from shooting.[41][42]","produced_by":"Siddharth Roy Kapur N. Subash Chandrabose","starring":"Suriya Samantha Ruth Prabhu Vidyut Jamwal","running_time":"166 minutes[3]","music_by":"Yuvan Shankar Raja","edited_by":"Anthony","Release":"The television rights were sold to Sun TV for ₹16 crore (US$2.4 million).[44] Anjaan reportedly set a record for pre-release business of Tamil films as it made around ₹87 crore (US$13 million) from its distribution, satellite and music rights.[45]The first look posters of the film were released on 1 May 2014.[46] The teaser of the film was launched along with the teaser of Kamal Hassan's Uttama Villain during the 8th Vijay Awards held on 6 July 2014 and was simultaneously uploaded to YouTube.[47] The teaser received positive response[48] and crossed 3 million views.[49] Indiaglitz in its review of the teaser said, \"One could see the monotony which features in all the gangster flicks, but that has been easily shadowed by the power packed cast and crew\".[50] The official trailer of the film was released on 8 August 2014 and aired on Sun Music.[51][52][53] The trailer too received positive response[54] and also crossed 1 million views.[55] Behindwoods wrote in its trailer review, \"Lingusamy is eyeing another blockbuster here.\"[56] Indiaglitz in its review, summarised, \"Overall, the trailer lives up to the expectation and it is up to the movie now.\"[57] The video clip of the track \"Ek Do Theen\", featuring Suriya and Samantha Ruth Prabhu was released on YouTube on 11 August 2014.[58]The official game titled Anjaan Race Wars was developed by Vroovy, a joint venture between Hungama Digital Media Entertainment and Gameshastra, who had previously developed and released the official movie games of Kochadaiiyaan (2014). It released on 28 July 2014.[59] The game play revolved around Suriya chasing the goons in a car. The features of the game included two types of AI – One of them shooting and the other ones try to run away, 5 different cars, including Hummer, featured in the game. Power ups included Nitro, Fuel, Ammo, Instant repair and Shield, while the weapons included Pistol and Shotgun. The game is available on Android and iOS operating systems.[60]To counter unauthorized copying, the owners decided that the film would release only through digital screens and no physical print was allowed for screening it anywhere. Since the film was shot with 6K resolution physical prints offered no additional quality anyway. The makers wanted only digital projection of Anjaan enabling its makers to easily find the sources of leaks through identifying codes.[61][62] As a result of this initiative, Anjaan became the first Indian film which had a 100% digital release.[63]Lingusamy and Suriya went to promote the film in Kochi.[64] Two days before the film's release, Samantha and Lingusamy promoted the film at The Forum Vijaya Mall in Chennai.[65] The entire crew of the film including Suriya, Vidyut Jamwal, Lingusamy, Brinda Sarathy and Yuvan Shankar Raja attended the premiere of the film at Kuala Lumpur.[66][67]","written_by":"Brinda Sarathy (dialogues)"}