{"Cast":"Actor Gene Wilder portrayed Eugene Grizzard, one of Bonnie and Clyde's hostages. His girlfriend Velma Davis was played by Evans Evans, who was the wife of film director John Frankenheimer.The family gathering scene was filmed in Red Oak, Texas. Several local residents gathered to watch the film being shot. When the filmmakers noticed Mabel Cavitt, a local school teacher, among the people gathered, she was cast as Bonnie Parker's mother.[6][7]","country":"United States","distributed_by":"Warner Bros.-Seven Arts","Plot":"In the middle of the Great Depression, Clyde Barrow (Warren Beatty) and Bonnie Parker (Faye Dunaway) meet when Clyde tries to steal Bonnie's mother's car. Bonnie, who is bored by her job as a waitress, is intrigued by Clyde, and decides to take up with him and become his partner in crime. They pull off some holdups, but their amateur efforts, while exciting, are not very lucrative.The duo's crime spree shifts into high gear once they hook up with a dim-witted gas station attendant, C.W. Moss (Michael J. Pollard), then with Clyde's older brother Buck (Gene Hackman) and his wife, Blanche (Estelle Parsons), a preacher's daughter. The women dislike each other on first sight, and their feud only escalates from there: shrill Blanche has nothing but disdain for Bonnie, Clyde and C.W., while gun-moll Bonnie sees Blanche's flighty presence as a constant danger to the gang's well-being.Bonnie and Clyde turn from pulling small-time heists to robbing banks. Their exploits also become more violent. When C.W. botches a bank robbery by parallel parking the getaway car, Clyde shoots the bank manager in the face after he jumps onto the slow-moving car's running board. The gang is pursued by law enforcement, including Texas Ranger Frank Hamer (Denver Pyle), who is captured and humiliated by the outlaws, then set free. A raid later catches the outlaws off guard, mortally wounding Buck with a gruesome shot to his head and injuring Blanche. Bonnie, Clyde and C.W. barely escape with their lives. With Blanche sightless and in police custody, Hamer tricks her into revealing C.W.'s name, who was up until now still only an \"unidentified suspect.\"Hamer locates Bonnie, Clyde and C.W. hiding at the house of C.W.'s father Ivan Moss (Dub Taylor), who thinks the couple—and an ornate tattoo—have corrupted his son. The elder Moss strikes a bargain with Hamer: In exchange for leniency for the boy, he helps set a trap for the outlaws. When Bonnie and Clyde stop on the side of the road to help Mr. Moss fix a flat tire, the police in the bushes open fire and riddle them with bullets. Hamer and his posse then come out of hiding, looking pensively at the couple's bodies.","In popular culture":"The \"Storage Jars\" skit of episode 33 of Monty Python's Flying Circus features a brief still shot of Warren Beatty as Clyde Barrow firing a Thompson submachine gun as he escapes from the Red Crown Tourist Court; the shot is accompanied by a jarring chord and an announcement by Eric Idle that \"On tonight's programme, Mikos Antoniarkis, the Greek rebel leader who seized power in Athens this morning, tells us what he keeps in storage jars.\" [47]","language":"English","Reception":"The film was controversial on its original release for its supposed glorification of murderers, and for its level of graphic violence, which was unprecedented at the time. Bosley Crowther of The New York Times was so appalled that he began to campaign against the increasing brutality of American films.[37] Dave Kaufman of Variety criticized the film for uneven direction and for portraying Bonnie and Clyde as bumbling fools.[38] Joe Morgenstern for Newsweek initially panned the film as a \"squalid shoot-'em-up for the moron trade.\" After seeing the film a second time and noticing the enthusiastic audience, he wrote a second article saying he had misjudged it and praised the film. Warner Bros. took advantage of this, marketing the film as having made a major critic change his mind about its virtues.[39]Roger Ebert gave Bonnie and Clyde a largely positive review, giving it four stars out of a possible four. He called the film \"a milestone in the history of American movies, a work of truth and brilliance.\" More than 30 years later, he added the film to his The Great Movies list. Film critics Dave Kehr and James Berardinelli have also praised the film in the years since.The fierce debate about the film is discussed at length in For the Love of Movies: The Story of American Film Criticism. This 2009 documentary film chronicles what occurred as a result: The New York Times fired Bosley Crowther because his negative review seemed so out of touch with the public, and Pauline Kael, who wrote a lengthy freelance essay in The New Yorker in praise of the film, became the magazine's new staff-critic.It performed well at the box office, and by year's end had grossed $23,000,000 in US theatrical rentals, becoming the studio's second highest grossing film of all time, right behind My Fair Lady.[40] Listal lists it as one of the top five grossing films of 1967 with $50,700,000 in US sales, and $70,000,000 worldwide.[41]Although many believe the film's groundbreaking portrayal of violence adds to the film's artistic merit, Bonnie and Clyde is still sometimes criticized for opening the floodgates for violence in cinema.[42] It currently holds a 90% \"Certified Fresh\" rating on Rotten Tomatoes,[43] with 45/50 reviews positive.","box_office":"$70 million[1]","Historical accuracy":"The film considerably simplifies the lives of Bonnie and Clyde, which included other gang members, repeated jailings, other murders and a horrific auto accident that left Parker burned and a near-invalid. One of the film's major characters, \"C. W. Moss\", is a composite of two members of the Barrow Gang: William Daniel \"W.D.\" Jones and Henry Methvin.[25]The Gene Wilder–Evans Evans sequence is based on the kidnappings of the undertaker H. D. Darby and his acquaintance Sophia Stone, near Ruston, Louisiana on April 27, 1933.[26] In the film, Eugene and Velma are romantically involved; Darby and Stone were not.The film strays furthest from fact in its portrayal of the Texas Ranger Frank Hamer (played by Denver Pyle) as a vengeful bungler who had been captured, humiliated, and released by Bonnie and Clyde. In real life, Hamer was already a legendary and decorated Texas Ranger when he was coaxed out of semi-retirement to hunt down the duo; he did not see them until the day he and his posse ambushed and killed them near Gibsland, Louisiana on May 23, 1934.[27] In 1968, Hamer's widow and son sued the movie producers for defamation of character over his portrayal and were awarded an out-of-court settlement in 1971.[28]The film portrays an unarmed and unsuspecting Clyde walking away from the car to investigate the broken down truck when he was ambushed. It suggests that Bonnie, still in their car, may also have been unarmed. The real couple remained in the vehicle and had weapons at the ready in the front seat; the back seat contained a dozen guns and thousands of rounds of ammunition.[29] Neither outlaw got out of the car alive.The couple's notoriety in 1933 came from photos found by police as undeveloped film in a hastily abandoned hideout in Joplin, Missouri. In one, Bonnie holds a gun in her hand and a cigar between her teeth. Its publication nationwide typed her as a dramatic gun moll. The film portrays the taking of this playful photo. It implies the gang sent photos—and poetry—to the press, but this is untrue. The police found most of the gang's items in the Joplin cache. Bonnie's final poem, read aloud by her in the movie, was publicized only posthumously by her mother.[30]Regarding the themes of Barrow's homosexuality/bisexuality and impotence, those notions seem to have been solely advanced in Pulitzer Prize winning author John Toland's 1963 novel, The Dillinger Days. However, when asked, contemporaries of Barrow, like W. D. Jones denied knowing anything about that being part of Barrow's life. Additionally, critiques of Toland's novel, particularly those by Nelson Algren in 1968, indicate that there might be no historical basis for those rumors. Algren refers to Dillinger Days as \"a volume of conjectures, surmises and easy assumptions\", and states, \"one can only marvel at this writer's presumption. Clyde Barrow might have been a latent heterosexual without even his mother knowing\"?[31]The only two members of the Barrow Gang who were alive at the time of the film's release were Blanche Barrow and W. D. Jones. While Blanche Barrow approved the depiction of her in the original version of the script, she objected to the later re-writes. At the film's release, she complained loudly about Estelle Parsons's portrayal of her, saying, \"That film made me look like a screaming horse's ass!\"[32]In 1968, W. D. Jones outlined his time with the Barrows in a Playboy article.[33] That same year, he filed a lawsuit against Warner Bros.-Seven Arts, claiming that the film Bonnie and Clyde \"maligned and brought shame and disrepute\" on him and damaged his character by implying that he was complicit in the betrayal of his old partners. He repeated what he had said at his arrest in 1933, that far from being a willing member of the gang, he had tried to escape several times.[34][35] There is no record that his petition was ever heard by a court.The movie was partly filmed in and around Dallas, Texas, in some cases using locations of banks that Bonnie and Clyde were reputed to have robbed at gunpoint.[36]","cinematography":"Burnett Guffey","Production and style":"The film was intended as a romantic and comic version of the violent gangster films of the 1930s, updated with modern filmmaking techniques.[8] Arthur Penn portrayed some of the violent scenes with a comic tone, sometimes reminiscent of Keystone Kops-style slapstick films, then shifted disconcertingly into horrific and graphic violence.[9] The film was strongly influenced by the French New Wave directors, both in its rapid shifts of tone, and in its choppy editing, which is particularly noticeable in the film's closing sequence.[9]The first handling of the script was in the early 1960s. Very influenced by the French New Wave writers and in a state not yet completed, it was first sent by its writers David Newman and Robert Benton to Arthur Penn. He was already engaged in the first decisions of production for the 1966 film The Chase and could not further involve himself at that point. The writers then sent to François Truffaut, renowned director of the New Wave movement, who made contributions to the script. He passed on the project and went on to make Fahrenheit 451.[10] At Truffaut's suggestion, the writers, much excited (the film's then-producers less so), approached Jean-Luc Godard. Some sources claim Godard didn't trust Hollywood and refused; Robert Benton claimed that Godard wanted to shoot the film in New Jersey in January during the winter and took offense when would-be producer Norah Wright objected that that was unreasonable considering the story took place in Texas with its year-round warm environment.[11] while her partner, Elinor Jones,[12] claimed they did not believe Godard was right for the project in the first place. Godard's retort: « Je vous parle de cinéma, vous me parlez de météo. Au revoir. » (\"I'm talking cinema and you're talking meteorology.\")[13] After the 1968 Academy Awards, Godard would send Benton and Newman a cable that read, \"Now, let's make it all over again!\"[14]Soon after the failed negotiations for production, Warren Beatty was visiting Paris and learned of the project and its perambulations through Truffaut. On returning to Hollywood, Beatty requested the script and bought the rights. A meeting with Godard was not productive. Beatty then changed compass and convinced the writers that while the script at first reading was very much of the French New Wave style, an American director was necessary for the subject.[15]Beatty offered the position to names like George Stevens, William Wyler, Karel Reisz, John Schlesinger, Brian G. Hutton, and Sydney Pollack, all of whom turned down the opportunity. Arthur Penn actually turned down the director's position again further times before Beatty finally convinced him to helm the film.[16]When Warren Beatty was on board as producer only, his sister Shirley MacLaine was a strong possibility to play Bonnie, but when Beatty decided to play Clyde, obviously a different actress was needed. Those considered for the role were Jane Fonda, Tuesday Weld, Ann-Margret, Leslie Caron, Carol Lynley and Sue Lyon. Cher auditioned for the part, while Warren Beatty begged Natalie Wood to play the role. Wood declined the role to concentrate more on her therapy at the time, and acknowledged that working with Beatty before was \"difficult.\" Faye Dunaway stated that she won the part \"by the skin of her teeth!\"[citation needed]The film is forthright in its handling of sexuality, but that theme was toned down from its conception. Originally, Benton and Newman wrote Clyde as bisexual and he and Bonnie were to have a three-way sexual relationship with their male getaway driver. However, Arthur Penn persuaded the writers that since the relationship's emotional complexity was underwritten, it dissipated the passion of the title characters and it would harm the audience's sympathy for the characters who would write them off as sexual deviants because they were criminals. Others claimed that Beatty was not willing to have his character display that kind of sexuality and that the Production Code would never have allowed such content in the first place.[17] Instead, Clyde is portrayed as unambiguously heterosexual, if impotent. When Clyde brandishes his gun to display his manhood, Bonnie suggestively strokes the phallic symbol. Like the 1950 film Gun Crazy, Bonnie and Clyde portrays crime as alluring and intertwined with sex. Because Clyde is impotent, his attempts to physically woo Bonnie are frustrating and anti-climactic.Bonnie and Clyde was one of the first films to feature extensive use of squibs – small explosive charges, often mounted with bags of stage blood, that are detonated inside an actor's clothes to simulate bullet hits. Released in an era where shootings were generally depicted as bloodless and painless, the Bonnie and Clyde death scene was one of the first in mainstream American cinema to be depicted with graphic realism.[citation needed]Beatty had originally wanted the film to be shot in black and white, but Warner Bros. rejected this idea. As it stood, much of the senior management of the studio was hostile to this film project, especially Jack L. Warner who considered the subject-matter an unwanted throwback to Warner Bros.' early period when gangster films were common product.[18] In addition, Warner was already annoyed at Beatty who refused to star in the film, PT 109 at his behest and was insolent enough to defy his favorite gesture of authority of showing the studio water tower with the WB logo on it by responding \"Well, it's got your name, but it's got my initials.\"[19] In addition, Warner complained about the film's extensive location shooting in Texas which exceeded its production schedule and budget, until he ordered the crew back to the studio backlot, where it was planned to be anyway for final process shots.[20]At first, Warner Bros. did not promote Bonnie and Clyde for general release, but instead mounted only limited regional releases that seemed to confirm its misgivings about the film's lack of commercial appeal, despite the fact the film was doing excellent sustained business in select urban theatres.[21] In fact, while Jack Warner was selling the studio to Seven Arts Productions, he would have had the film dumped but for the fact that Israel, of whom Warner was a major supporter, had scored a triumphant victory in the Six Day War, and he was in too defiant a mood to sell any of his studio's films.[22] Meanwhile, Warren Beatty, Bonnie and Clyde's producer and star, complained to Warner Bros. that if the company was willing to go to so much trouble for Reflections in a Golden Eye (they had changed the coloration scheme at considerable expense), their neglect of his film, which was getting excellent press, suggested a conflict of interest; he threatened to sue the company. Warner Bros. gave Beatty's film a general release. Much to Warner Bros.' management surprise, the film eventually became a major box office success.[23]The instrumental banjo piece \"Foggy Mountain Breakdown\" by Flatt and Scruggs was introduced to a worldwide audience as a result of its frequent use in the movie. Its use is strictly anachronistic as the bluegrass-style of music dates from the mid-1940s rather than the 1930s, but the functionally similar Old-time music genre was long established and widely recorded at the period in which the film is set.[citation needed] Long out of print in vinyl and cassette formats, the film soundtrack album was finally released on CD in 2009.[24]","directed_by":"Arthur Penn","Awards and honors":"Estelle Parsons won an Academy Award for Best Supporting Actress for her portrayal of Blanche Barrow, and Burnett Guffey won an Academy Award for Best Cinematography.The film was also nominated for:","release_dates":"August 13, 1967 (1967-08-13)|||||","produced_by":"Warren Beatty","starring":"Warren Beatty|Faye Dunaway|Michael J. Pollard|Gene Hackman|Estelle Parsons|","running_time":"111 minutes","Influence":"Some critics cite Joseph H. Lewis's Gun Crazy, a 1950 film noir about a bank-robbing couple (also based loosely on the real Bonnie and Clyde), as a major influence on this film.[citation needed] Forty years after its premiere, Bonnie and Clyde has been cited as a major influence for such disparate films as The Wild Bunch, The Godfather, The Departed,[45] and Natural Born Killers.[46] Some aspects of the Bollywood movie Bunty aur Babli are inspired by this movie.","music_by":"Charles Strouse","edited_by":"Dede Allen","bonnie_and_clyde":"Film poster by Bill Gold","written_by":"David Newman|Robert Benton|","budget":"$2.5 million"}