{"country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Cal Weaver (Steve Carell) is a middle-aged man who learns that his wife Emily (Julianne Moore) has cheated on him with a co-worker, David Lindhagen (Kevin Bacon), and that she wants a divorce. After moving into his own apartment, Cal goes to a bar night after night, talking loudly about his divorce, until he attracts the attention of a young man named Jacob Palmer (Ryan Gosling), a womanizer who beds women each night, although a young woman named Hannah (Emma Stone) recently had rejected his advances. Jacob takes pity on Cal, and offers to teach him how to pick up women. Using Jacob's teachings, Cal seduces Kate (Marisa Tomei) at the bar. After this encounter, Cal manages to successfully seduce other women in the bar. He sees Emily again at their son Robbie's (Jonah Bobo) parent-teacher conference. The interaction goes well until they discover that Robbie's teacher is Kate, who reveals to Emily that she and Cal have slept together. Cal then confesses to sleeping with many women. Emily leaves in disgust and begins actively dating David. Meanwhile, Hannah, a recent law school graduate, is expecting her boyfriend, Richard (Josh Groban) to propose marriage while they celebrate her passing the bar exam, but he does not, instead, offering her a position at his law firm. Offended and hurt, Hannah returns to the bar where she originally rejected Jacob's advances and kisses Jacob passionately. The two return to Jacob's home to have sex, but end up talking to each other all night and making a connection. Jacob starts a relationship with Hannah, and he becomes distant from Cal.At the same time, Robbie makes numerous grand gestures to try to win the heart of his 17-year-old babysitter, Jessica Riley (Analeigh Tipton), who actually has a crush on Cal. On the advice of her classmate Madison (Julianna Guill), she takes naked photos of herself to send to Cal and tucks them away in an envelope inside her dresser drawer. Later, when Emily calls Cal under the guise of needing help with the house's pilot light, Cal decides to try and win her back. Meanwhile, Jacob returns Cal's calls and asks for advice about starting a real relationship and meeting his girlfriend's parents. Jessica's mother, Claire (Beth Littleford), who dislikes Cal, discovers Jessica's naked photos in the dresser drawer and shows them to Jessica's father, Bernie (John Carroll Lynch). Bernie was Cal's best friend before Claire made him end their friendship in the aftermath of the breakup. Bernie rushes to the Weaver residence to confront him about the photos, with Jessica in pursuit. Cal and his kids create a makeshift mini golf set in their backyard to remind Emily of their first date. During the gathering, Jacob and Hannah show up at the house, and Hannah is revealed to be Cal and Emily's first daughter. Cal is appalled that Jacob is dating his daughter, and forbids her to see him. At that moment, Bernie shows up and attacks Cal. Jessica arrives and tells her father that Cal knew nothing of the pictures. Then David arrives on the scene to return Emily's sweater from a previous date. Jacob asks David if his name is Lindhagen and when David replies \"yes,\" Jacob punches him in the face for the pain he caused Cal. Cal, Jacob, David, and Bernie then get into a scuffle which is soon broken up by the police. Cal starts spending time at the bar again and receives a visit from Jacob, who confesses that he is in love with Hannah. Cal replies that he is happy that Jacob is a changed man but cannot approve of Jacob and Hannah's relationship, having seen Jacob's former lifestyle. Jacob harbors no ill feelings; rather, he respects Cal and praises him for being a great father.At Robbie's eighth grade graduation, Robbie is the Salutatorian and gives a pessimistic speech about how he no longer believes in true love and soul-mates. Cal stops him and instead begins to recount his courtship with Emily to the audience, saying that, while he doesn't know if things will work out, he will never give up on Emily. With renewed faith, Robbie reaffirms his love for Jessica, to the audience's applause. After the ceremony, Cal gives Jacob and Hannah his blessing. Jessica gives Robbie an envelope containing the nude photos of herself that were originally meant for Cal to \"get him through high school.\" Cal and Emily have a laugh talking about the events that have transpired the past year, hinting that they might get back together.","language":"English","crazy,_stupid,_love":"Theatrical release poster","box_office":"$142.9 million[1]","cinematography":"Andrew Dunn","production_company":"Carousel Productions","directed_by":"Glenn Ficarra John Requa","release_dates":"July 29, 2011 (2011-07-29)|||||","Production":"The film was originally called Untitled Marital Crisis Comedy, as the actress Emma Stone claimed in an interview for ANS.[2]Dan Fogelman started writing the screenplay in 2009 about love among a group of people.[3] It is based on his own experiences and was written with Steve Carell in mind.[4] After Fogelman sent it to his manager, within a week Carell read it and came aboard the project.[5][6] In December 2009, Warner Bros. secured the rights of the then-untitled project for $2.5 million.[3][7] In January 2010, the film was in pre-production.[8] On March 16, 2010, Emma Stone was in negotiations to star in the film.[9] On April 7, 2010, Analeigh Tipton was in final talks to appear in the film.[10] On April 12, Kevin Bacon also joined the cast.[11] It is the first project produced by Carell's Carousel Productions.[4]Principal photography took place in and around Los Angeles, California. Filming started on April 16, 2010 and lasted 53 days.[12] Locations included Westfield Century City mall, Ventura Boulevard, Hollywood Hills where Jacob's house is located, Taft High School in Woodland Hills, Portola Middle School in Tarzana and Grant High School in Van Nuys, which stood for Robbie and Jessica's campuses, El Torito Grill at the Sherman Oaks Galleria and Equinox Fitness in Woodland Hills, which became the sports club featured in the film.[4] Before editing, the original cut was three hours long.[8]","produced_by":"Steve Carell Denise Di Novi","starring":"Steve Carell Ryan Gosling Julianne Moore Emma Stone","running_time":"118 minutes","music_by":"Christophe Beck Nick Urata","edited_by":"Lee Haxall","Release":"The film's release was originally slated for April 22, 2011 but was later changed to July 29, 2011.[13]Crazy, Stupid, Love opened at #5 at the North American box office on its opening weekend with $19.1 million.[14] It has earned $84.2 million in the North America as well as $58.5 million in other territories for a worldwide total of $142.7 million.[1]Crazy, Stupid, Love received positive reviews from critics. On Rotten Tomatoes, the film holds a rating of 78%, based on 202 reviews, with a rating average of 6.9/10. The site's consensus reads, \"It never lives up to the first part of its title, but Crazy, Stupid, Love's unabashed sweetness — and its terrifically talented cast — more than make up for its flaws.\"[15] On Metacritic, the film has a score of 68 out of 100, based on 40 critics, indicating \"generally favorable\" reviews.[16]Roger Ebert gave Crazy, Stupid, Love 3 out of 4 stars and remarked that it \"is a sweet romantic comedy about good-hearted people\".[17] A. O. Scott of The New York Times was also positive and gave the film 4 out of 5 stars, stating \"Crazy, Stupid, Love is, on balance, remarkably sane and reasonably smart\".[18] Betsy Sharkey of the Los Angeles Times gave the film a 4 out of 5 review as well and said that it \"conjures up the bittersweet magic of first loves, lasting loves, lost loves and all the loves in between\".[19]Some reviewers were less favorable, such as Christy Lemire at the Associated Press, who wrote that \"it never gets crazy or stupid enough to make you truly fall in love with it\", giving the film a 2 out of 4 rating.[20] James Rocchi of MSN Movies was particularly critical, giving it 1 out of 5 and remarking that it is \"a star-studded lump of fantasy and falsehood\".[21] The film was included in TV Guide's \"Best Movies of 2011\" list.[22]Crazy, Stupid, Love was released on DVD and Blu-ray Disc on November 6, 2011. DVD sales grossed $19,771,171 and Blu-ray sales $5,643,417.[35]","written_by":"Dan Fogelman","budget":"$50 million[1]"}