{"country":"United States","distributed_by":"Fox Film","Plot":"After serving time in Sing Sing, Eddie Ellison marries his fiancée Kay and eventually the two have a daughter they name Shirley. Eddie helps his friend, and former convict, Larry Scott, who is engaged to Shirley's dance instructor Jane, get a job as a chauffeur for his employer, factory owner Stuart Carson.Trigger Stone, who also served time in Sing Sing, steals Mrs. Carson's pearl necklace and asks Eddie and Larry to sell it for him, but they refuse. Private investigator Welch, the man responsible for Eddie's conviction, tells the head of the National Insurance Company he suspects the chauffeurs are guilty of the robbery and informs Mr. Carson about their prison records, prompting him to fire them.Trying to escape from the police, Trigger gives the pearl necklace to Shirley, who believes it is a belated birthday present. As part of a game, she hides it in her father's pocket, and when he finds it while Welch is searching the apartment, he conceals it in the carpet sweeper, but unbeknownst to him, the neighbor's maid Anna borrows empties it before returning it. Kay returns home, and when she hears the story, they try to open the sweeper. Welch returns and opens it himself, only to find it empty.After Welch leaves, Eddie, Larry, Kay and Jane search the apartment building for the necklace. When Trigger threatens Eddie with a gun, Eddie subdues him and ties him up, then goes for the police. During his absence, Shirley discovers the necklace in the garbage can downstairs. She brings it to Eddie but instead finds Trigger, who convinces her to let him free. He takes her hostage and climbs to the roof, where he shoots Eddie. Although injured, Eddie manages to capture Trigger. Shirley takes the necklace from Trigger's pocket, and detective Flannigan tells her she will be eligible for the $5,000 reward.","language":"English","cinematography":"L. William O'Connell","directed_by":"Harry Lachman","baby_take_a_bow":"Title card","release_dates":"June 30, 1934 (1934-06-30)|||||","Production":"James P. Judge's play Square Crooks was filmed under that title in 1928 by Lewis Seiler. The working titles for the remake were Always Honest and Going Straight. Both The Hollywood Reporter and Variety reported the film was banned in Germany, although no reason was given by the German censors.[2]The song \"On Account-a I Love You\" was written by Sam H. Stept and Bud Green[citation needed] and sung by Temple and Dunn.[1] The dress that Temple wore on film while singing this song was part of a 2015 exhibition, Love, Shirley Temple. The exhibition, which toured among several US locations, also included other dresses Temple wore between 1928 and 1941 as well as other memorabilia from this time.[3][4] Items from the exhibition were auctioned off in July 2015 and this dress sold for $52,000.[5]Based on the success of Little Miss Marker and Stand Up and Cheer!, Temple's Fox salary was raised to $1250 per week and her mother's salary, as coach and hairdresser, was raised to $150 per week.[1] The film's title was taken from a song Temple had sung in Stand Up and Cheer!. Temple and Dunn would work together in other films, with Temple always taking top credit.[6]","produced_by":"John Stone","starring":"Shirley Temple James Dunn Claire Trevor Alan Dinehart","running_time":"76 minutes","music_by":"David Buttolph","Release":"The movie was very successful at the box office.[7]Temple biographer Anne Edwards thought the film \"pleasant, sentimental\" and that it \"had very little other than Shirley to recommend it at the box office.\"[6]Channel 4 called the film a \"slender but cute tale\" that is \"slow for the most part, but a scene on a rooftop where the real baddie uses the tot as a human shield should amuse.\" [8]TV Guide rated the film two out of four stars and commented, \"Forget the plot and enjoy the child star in one of her most entertaining roles.\" [9]In 2009, the film was available on videocassette and DVD in both the original black and white and in computer-colorized versions. Some editions had special features and theatrical trailers.","written_by":"Screenplay: Philip Klein Edward E. Paramore Jr. Play: James P. Judge"}