{"based_on":"A Christmas Carol 1843 novel  by Charles Dickens","original_language(s)":"English","Critical response":"Novelist and essayist Louis Bayard, writing for Salon.com, described this adaptation as \"the definitive version of a beloved literary classic\", praising its fidelity to Dickens' original story, the strength of the supporting cast, and especially Scott's performance as Scrooge.[2]","screenplay_by":"Roger O. Hirson","production_company(s)":"Entertainment Partners Ltd.","Plot":"The film opens with Jacob Marley's funeral procession as his death is mentioned by the narrator (Roger Rees). This scene then changes to seven years later, on Christmas Eve in 1843 within the business establishment of Scrooge and Marley. Bob Cratchit (David Warner), a clerk employed by Scrooge, comments that Marley has been dead for seven years, but is gruffly ordered to return to work by Marley's surviving partner, Ebenezer Scrooge (George C. Scott). Bob then attempts to add some coal to an almost nonexistent fire, but is stopped by Scrooge, who gives him a curt and cutting lecture on clothing as protection against the cold, and that \"coal burns; coal is momentary, and coal is costly\". Scrooge then declares that there will be no more coal burned in the office that day, and orders Cratchit to return to work lest he be fired.Bob returns to his desk as Fred Hollywell (Roger Rees), Scrooge's nephew, cheerfully enters the office; Scrooge mocks his nephew's cheerful demeanor, calling Christmas a \"humbug,\" a holiday that has never done anyone any good, summing up his view with a very well-known quote, in a mockingly cheerful manner, \"If I could work my will, every fool with 'Merry Christmas' on his lips would be boiled in his own pudding and buried with a stake of holly through his heart.\" Despite this declaration, Fred patiently states his own views of how Christmas has benefited him in many ways, even if not with monetary gain. \"Though it has not put a scrap of gold or silver in my pocket, it has done me good; and I say, 'God bless it!'\" Bob applauds from his desk in the office, only to be sternly warned by Scrooge that he will spend Christmas unemployed should he make more noise. Fred invites his uncle to dinner, who curtly declines, and dismisses his nephew with, \"You are wasting my time.\"Despite his uncle's rudeness, Fred maintains his good humor, wishing Bob and his family a Merry Christmas as he departs the office. Scrooge then prepares to leave for the Exchange; he grudgingly gives Bob Christmas Day off with pay, likening it to \"picking a man's pocket every twenty-fifth of December\", warning him to be at work all the earlier the next day. As he leaves for the Exchange, Scrooge sees Bob's youngest son Tiny Tim (Anthony Walters) waiting across from Scrooge's office. The lad is a naïve and very sick boy who walks with a crutch but is unfailingly cheerful and polite, courteously greeting Mr. Scrooge as the man walks by. Scrooge mistakes Tim for a beggar, but after the lad introduces himself, Scrooge mumbles to him he will have a long wait for his father in the cold. Tim cheerfully thanks Scrooge and continues his wait for his father.On the way to the Exchange, Scrooge passes a group of children singing Christmas carols, forcing his way straight through them; outside the Exchange building, he passes by some adult carolers, though he simply ignores them. Once inside the Exchange, Scrooge is greeted by three other businessmen who wish to purchase some corn; they had delayed in concluding the deal, apparently in hopes that Scrooge would lower his price. Much to their dismay, Scrooge informs them that the price has gone up 5% because of the delay, and unless they come to an agreement, the price would go up another 5% the next day. The businessmen protest, stating that it was not fair; Scrooge responds that business is not fair. Reluctantly, the men agree; Scrooge informs them that he will not ship without the cash in hand.Clearly satisfied with the outcome of his latest transaction, Scrooge is approached by two men soliciting donations for the poor, Mr. Poole (Michael Gough) and Mr. Hacking (John Quarmby). Despite their courtesy and their sincerity, Scrooge gruffly declines, stating that \"I don't make merry myself at Christmas, and I can't afford to make idle people merry.\" He goes on to say that the taxes he already pays support the prisons and poorhouses and that if the poor would rather die then go to those establishments, then \"perhaps they had better do so and decrease the surplus population.\" Poole and Harking are aghast at this attitude, not believing that anyone could be so cold-hearted; Scrooge again affirms the sincerity of his stinginess and departs.That night, Scrooge arrives home but is toyed with by the ghost of his dead partner Marley (Frank Finlay) with a spectral hearse passing by him, Marley's face appearing on the knocker, appearing on the fireplace tiles and making bells ring. Finally, Marley himself appears in the same appearance he had when alive but is now weighted down by heavy chains. Marley's ghost reveals that he wears the chain he forged in life link by link and yard by yard due to his cruel and selfish attitude towards others. Marley's ghost tells Scrooge that he will be haunted by three spirits as a final chance to avoid suffering the same fate as he did.As Marley warned, the first of the spirits the Ghost of Christmas Past (Angela Pleasence) visits him and shows him his long forgotten past. Scrooge witnesses the time he spent the holidays alone at school with only his books for company. Scrooge mentions it was due to his mother's death in childbirth—Scrooge's birth—that caused his father to send him away from the family, blaming Ebenezer for his wife's death. Fan (Joanne Whalley), Scrooge's beloved sister and Fred's mother, picks him up from school claiming their father Silas (Nigel Davenport) has changed but it turns out Silas still loathes his son and sends him to work as an apprentice for Fezziwig (Timothy Bateson) in only three days time, instead of keeping him for a longer visit that Fan would have wanted. Scrooge reveals that Fan died giving birth to Fred, and he treats Fred with the same contempt his father treated him. Scrooge is then shown when he worked as an apprentice for Fezziwig and fell in love with Belle (Lucy Gutteridge), to whom he became engaged. However, Scrooge's obsession with money continues to grow, and thus he begins to take Belle for granted. After realizing that Scrooge no longer cares for her as much as he used to, Belle ends their engagement. Scrooge is then shown that Belle is married and is now a mother to several children. When they reach the time of Jacob Marley's death, Belle's husband says he found Jacob Marley was dying and all Scrooge's response to that was to stay behind at his office and continue working instead of visiting his dying partner. Unable to see any more memories, Scrooge puts out the spirit with the Spirit's cap.The second spirit, the Ghost of Christmas Present (Edward Woodward), shows Scrooge how others celebrate Christmas. Scrooge sees just how poor Bob and his family really are after they can only afford a small goose and pudding for their Christmas dinner. Bob then raises a toast to Scrooge, much to the disagreement of his wife (Susannah York). The spirit also hints if the shadows of the future do not change, Tiny Tim will die of his illness and scolds Scrooge for his opinion about the surplus population. Scrooge and the spirit witness Fred having a party with his wife Janet (Caroline Langrishe) and friends before finally visiting a desolate street filled with the poor and destitute sitting in the cold and eating scraps. The Spirit then shows Scrooge two shockingly emaciated children called Ignorance and Want beneath his robe, and mocks Scrooge's concern for their welfare with his earlier quote regarding poorhouses and prisons before disappearing.Moments later the Ghost of Christmas Yet to Come, an apparition, (Michael Carter) shows Scrooge what will happen the following Christmas if he does not repent. They witness the same men that asked Scrooge for corn talking about a man who just died and will only attend the funeral for a free lunch. After Scrooge sees the same dead man on a bed, he asks the spirit to show him someone with an emotional connection to the man's death. The spirit shows him that the same man has been robbed by an old woman, Mrs. Dilber (Liz Smith) who sells the stolen things to a criminal named Old Joe (Peter Woodthorpe). Scrooge is disgusted by the greed shown by these people and asks to see tenderness and caring, the spirit then shows him the Cratchit family. Scrooge discovers Tim has lost his fight with his unknown illness with his family mourning him. Finally, the spirit then takes him to graveyard, where Scrooge then discovers the man that died and got robbed was indeed himself after seeing his name written on an abandoned tombstone. Horrified, Scrooge promises the Spirit that he is not the man he once was and promises he will live an altered life, and will honor Christmas in his heart. Scrooge then finds himself back in his bedroom.In the morning Scrooge, upon learning it is Christmas Day, orders a boy to bring the poulterer to his home with a prized turkey. The boy does and Scrooge orders the poulterer to deliver the turkey to Bob and his family. Scrooge then meets the charity workers, and promises an undisclosed (but apparently impressive) donation to their cause. Scrooge then unexpectedly arrives at Fred's home and apologizes for what he said about Christmas. He then accepts Fred's invitation to dinner much to Fred's joy.The following day Bob arrives late for work. Scrooge feigns anger and appears ready to fire him, but rather surprises Bob by raising his wages and promises to help his family in every way possible. The narrator claims that Scrooge did everything he promised and became like a second father figure to Tim, who had survived as Scrooge finally discovered the true meaning of Christmas. The film closes with Tiny Tim's phrase, \"God bless us, everyone.\"","country_of_origin":"United Kingdom United States","original_network":"CBS","distributor":"CBS","cinematography":"Tony Imi","directed_by":"Clive Donner","original_release":"17 December 1984 (1984-12-17)","theme_music_composer":"Nick Bicât","Differences between book and film":"Although the film was very close to the book, there were a few changes:","editor(s)":"Peter Tanner","Production":"This movie was filmed on location in Shrewsbury, England. It originally aired on CBS on December 17, 1984 in the United States, but released theatrically in Great Britain. The United States debut was sponsored by IBM, which purchased all the commercial spots for the two-hour premier. The film brought in a 20.7/30 rating/share, winning its timeslot and ranking #10 for the week.[1] The film was marketed with the tagline \"A new powerful presentation of the most loved ghost story of all time!\" Scott was nominated for an Emmy for Outstanding Lead Actor in a Limited Series or a Special for his portrayal in A Christmas Carol.The movie has run in syndication on local American channels since it debuted in 1984, earning a loyal fanbase, but was not released to VHS until 1995 and to DVD in 1999. This was because Scott himself (and later his estate through Baxter Healthcare, to whom the Scott family donated their copyright) owned the rights to this film. On November 25, 2007 it returned to national television on AMC for the first time since its debut, and the network continues to broadcast it each December. In 2009, the Hallmark Channel also ran the movie soon after Thanksgiving. It remains one of the most beloved adaptations of A Christmas Carol. During 2009 the film was re-released on DVD by 20th Century Fox, with updated box art, but the same menu and features as the previous DVD release. It was released on Blu-ray in December 2010 by 20th Century Fox.","starring":"George C. Scott Frank Finlay David Warner Susannah York Edward Woodward Roger Rees","running_time":"100 minutes","a_christmas_carol":"Home video cover","producer(s)":"George F. Storke"}