{"based_on":"Duel in the Sun 1944 novel  by Niven Busch","country":"United States","distributed_by":"Selznick Releasing Organization","Legacy":"The film was one of the first to be honored by a record album, featuring selections from Dimitri Tiomkin's musical score. Rather than use excerpts from the soundtrack, RCA Victor recorded some of the music with the Boston Pops Orchestra conducted by Arthur Fiedler. The music was split into approximately three-minute sections and released on 10-inch 78-rpm discs in 1946. A long musical prelude as well as an overture preceded the film with Tiomkin conducting the studio orchestra; this recording was later issued on LP and CD.Duel in the Sun was first shown on American television during a special ABC Sunday evening showing. It was released on Region 1 DVD in 2004.Martin Scorsese has stated to James Lipton on Inside the Actors Studio that this was the first film he saw and holds it in high regard. He mentioned it in his documentary of American movies. David Stratton has also stated at the ACMI's \"Desert Island Flicks\" on March 10, 2010,[6] that he holds it in high regard. He first saw the film at the age of six.[7]","Plot":"Pearl Chavez (Jennifer Jones) is orphaned after her father Scott Chavez (Herbert Marshall) kills her mother (Tilly Losch), having caught his wife with a lover (Sidney Blackmer). Before Scott Chavez is executed as a punishment for killing his wife, he arranges for his daughter Pearl to live with his second cousin and old sweetheart, Laura Belle (Lillian Gish).Arriving by stagecoach, Pearl is met by Jesse McCanles (Joseph Cotten), one of Laura Belle's two grown sons. He takes her to Spanish Bit, their enormous cattle ranch. The gentle and gracious Laura Belle is happy to welcome her to their home, but not so her husband, the wheelchair-bound Senator Jackson McCanles (Lionel Barrymore), who calls her \"a half-breed\" and jealously despises Pearl's father.The second son, Lewt (Gregory Peck), is a ladies man with a personality quite unlike that of his gentlemanly brother Jesse. He expresses his interest in Pearl in direct terms and she takes a strong dislike to him. Laura Belle calls in Mr. Jubal Crabbe, the \"Sinkiller\" (Walter Huston), a gun-toting preacher, to counsel Pearl on how to avoid the evils of temptation. Pearl is determined to remain \"a good girl.\"When she submits to Lewt's aggressive advances one night, Pearl is angry with him and ashamed of her own behavior. But she also cannot help but be flattered by his lust and attentions. Jesse, meanwhile, is ostracized by his father and no longer welcome at the ranch after siding with railroad men, headed by Mr. Langford (Otto Kruger), against the Senator's personal interests. Jesse is in love with Pearl but he leaves for Austin to pursue a political career and becomes engaged to Helen Langford (Joan Tetzel), Langford's daughter.Offended when Lewt reneges on a promise to marry her, Pearl takes up with Sam Pierce (Charles Bickford), a neighboring rancher who is smitten with her. She does not love him but says yes to his proposal. Before they can be married, however, Lewt picks a fight with Pierce in a saloon and guns him down. He insists that Pearl can belong only to him. Lewt becomes a wanted man.On the run from the law, Lewt finds time to derail a train and occasionally drop by the ranch late at night and foist his attentions on Pearl. She cannot resist her desire for him and lies for Lewt to the law, hiding him in her room. Afterward, however, he walks out on her, despite her pleas that she loves him.Laura Belle's health takes a turn for the worse and the Senator admits his love for her before she dies. Jesse returns to visit but is too late; his mother is dead. The Senator continues to shun him, as does Lewt, their family feud finally resulting in a showdown. Lewt tosses a gun to his unarmed brother but Jesse stands his ground without attempting to pick it up. Jesse warns that Lewt will eventually be hanged as a murderer, and Lewt responds by shooting Jesse.The Senator's old friend, Lem Smoot (Harry Carey) tells him that Jesse's wound is not mortal and the old man softens up towards his son. A livid Pearl is relieved that Jesse is going to survive. When Helen arrives, she invites Pearl to leave Spanish Bit forever and come live with them in Austin. Pearl agrees, but she is tipped off by one of the Spanish Bit hands, Sid (Scott McKay) that Lewt intends to come after Jesse again. She arms herself and engages in a shootout with Lewt in the desert, where they die in each other's arms.","language":"English","Reception":"Selznick had high hopes that Duel in the Sun would surpass his success with Gone with the Wind. The film received poor reviews, however, and was highly controversial due to its sexual content and to Selznick's real-life relationship with Jones, which broke up both of their marriages. Despite the bad press, it was a box-office success for Selznick, although not a second Gone with the Wind. It earned $11,300,000 in rentals in North America during its initial release [4][5] and much more overseas and in the 1954 re-release.Because of the film's huge production costs (rumored to be over $6,000,000), its $2,000,000 advertising campaign (unheard of at the time) and Selznick's costly distribution tactics, the film only broke even.[1]","box_office":"$20,408,163[2]","cinematography":"Lee Garmes Ray Rennahan Harold Rosson","production_company":"Vanguard Films","directed_by":"King Vidor","release_dates":"December 31, 1946 (1946-12-31)|||||","Production":"The film was adapted by Oliver H.P. Garrett and David O. Selznick from the novel by Niven Busch. It was directed by King Vidor.It was nominated for Academy Awards for Best Actress in a Leading Role (Jennifer Jones) and Best Actress in a Supporting Role (Lillian Gish).The film received the nickname \"Lust in the Dust\", which eventually became the name of another movie. A scene in which Pearl does a seductive dance for Lewton was cut from the film before it was released. The film as shot could not make it past the Hays Code censors or religious review boards and so was heavily edited.[3]","produced_by":"David O. Selznick","starring":"Jennifer Jones Joseph Cotten Gregory Peck","running_time":"145 minutes","music_by":"Dimitri Tiomkin","edited_by":"John D. Faure Charles L. Freeman Hal Kern William H. Ziegler","written_by":"Oliver H.P. Garrett David O. Selznick Ben Hecht","budget":"$6,480,000[1]"}