{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Jake Barnes (Dirk Benedict) flying a plane over the Alaskan wilderness. While he is flying, he is communicating with a man named Charlie (Ben Cardinal), who works for Quincy Air Service.Jessie Barnes (Thora Birch) and her friend Chip (Ryan Kent) observing wildlife in their kayaks before her dinner. Jessie's father Jake begins telling her where he is flying from, at what time he left that location, and his air speed. Jessie calculates that her father is passing Devils Thumb.Jake then lands his plane on a lake, where Charlie is waiting to tie the plane up to the dock. His son, Sean (Vincent Kartheiser) scolds his father for moving their family to Alaska.As Jake was making an emergency run, his plane's engines stalls, causing him to lose control and crash in the Alaska winderness. Frustrated by the lack of search effort by the police, Sean and Jessie went out to find their father on their own.As they kayak through the chilly waters of the Gulf of Alaska, they stop to rest on a beach. They soon realize that the shore is home to a poachers’ camp. They then discover a live polar bear that has been locked in a cage. They let the polar bear run free, hoping that it will save itself. After the bear leaves their camp Colin Perry appears, in hunt of the polar bear that he believes is rightfully his property. Koontz then arrives and notices teeth marks in the frying pan, alerting Perry that the bear was there. Colin’s beliefs that the children stole the bear from his camp are confirmed when he finds his missing lighter next to their camping gear. Perry orders the kids to tell the bear to “come home” (Perry is referring to the cage at his camp as the bear’s home). The next day, Jessie and Sean continue in their search to find their missing father. They leave their kayak and begin searching on foot. They soon discover that the polar bear has once again followed them in their journey. Perry and Koontz, too, have followed the youngsters and this time they destroy the oars in their kayak and hide the kayak in the woods just in case someone comes looking for them. Just then Charlie arrives in a helicopter in search of Jessie and Sean. Perry shows Charlie a piece of the oar and tells him that he found it 25 miles north of their current position. Charlie then departs in his helicopter in hopes of finding the children, who he believes to be in grave danger.Jessie safely reaches the bottom, but Sean slips and tumbles down the mountain, hitting his head on a rock. The two then continue their journey and find a log cabin in the woods. They take shelter and Sean lies down in the bed. While in the cabin, Sean notices a canoe hanging from the ceiling. Jessie and Sean take the canoe and continue on in their search for their father. While they are canoeing down a river, the two kids encounter vicious rapids that send them and their canoe down a waterfall. Jessie is able to escape the raging river but, once again, Sean’s lack of experience in the wilderness causes him to struggle. He is thrust down the river where he is helped out of the cold water by Jessie’s friend Chip and his grandfather (Byron Chief-Moon). With the kids barefoot by the riverside, Chip’s father wants to send Jessie and Sean home, but Chip and his grandfather wish to help the two on their journey. The two proceed on their quest with their befriended polar bear, whom they named Cubby, by their side.Cubby leads them until he is shot with a tranquilizer dart by Colin. He then takes Cubby away in his helicopter, but Koontz didn’t load the darts with enough tranquilizer fluids, allowing Cubby to awaken in the helicopter and trying to fight his way free. As Koontz lowers the helicopter, Cubby escapes and bites Perry's right knee, causing Perry to shoot Koontz with a tranquilizer dart and damage the helicopter as well. Meanwhile, the children continue on in their search for their missing father. They stumble upon some wreckage from his plane crash and begin yelling for him to respond. Not able to yell, their father shoots another flare into the air. This time the children see it and run to his rescue. They find the plane hanging on the edge of a cliff, and Jessie lowers Sean down the side of the mountain to reach their father. Just as it looks like Jessie is going to lose control of the rope, Cubby appears and helps Jessie pull the rope. With Cubby's help, Jessie and Sean are able to raise their father up the side of the mountain. Just as the family is reunited, Charlie shows up in his helicopter to take them home and complete the rescue.","language":"English","Critical reception":"As of January 5, 2015, based on 11 reviews collected by the review aggregator website Rotten Tomatoes, Alaska has received an overall rating average of 18%, with an average score of 4.4 out of 10.[1]","box_office":"$ 11,829,959","cinematography":"Tony Westman","production_company":"Castle Rock Entertainment","directed_by":"Fraser Clarke Heston","alaska":"Theatrical release poster","release_dates":"August 14, 1996 (1996-08-14)|||||","Box office":"Despite an approximate budget of $20 million, the film managed to bring in domestic revenues of only $11,829,959, making the film a considerable worldwide box office dropout.","produced_by":"Andy Burg","starring":"Thora Birch Vincent Kartheiser Dirk Benedict Charlton Heston Gordon Tootoosis","running_time":"109 min","music_by":"Reg Powell","edited_by":"Rob Kobrin","written_by":"Andy Burg Scott Myers","budget":"$ 24,000,000"}