{"country":"United States","distributed_by":"MGM/UA Entertainment Company","screenplay_by":"Charles Parker|Allen DeBevoise|","story_by":"Charles Parker|Allen DeBevoise|Gerald Scaife|","Plot":"Kelly is a struggling young jazz dancer and, through her gay friend Adam, she is introduced to two Street dancers, Ozone and Turbo, who have a bitter rivalry with another crew known as Electro Rock, consisting of poppers Popin' Pete, Bruno \"Pop N Taco\" Falcon, and Lollipop. They also struggle to overcome scorn from Kelly's dance instructor, Franco, who disapproves of her hybrid dance style and affiliation with street dancers. Kelly soon becomes the sensation of the street crowds. Through it all, the audience is treated to a variety of breakthrough performances, including Turbo's \"Broom Scene\" and Taco's unique popping solos during the dance battles at the Radio-Tron nightclub.","In popular culture":"Several months prior to the film's release, Shabba Doo, Boogaloo Shrimp, 'Pop N' Taco, Popin Pete, DJ Chris \"The Glove\" Taylor and Lollipop were all prominently featured in the music video for Chaka Khan's remake of the 1979 Prince song, \"I Feel for You\".Shabba Doo and Boogaloo Shrimp also featured in Lionel Richie's \"All Night Long\" video.","language":"English","box_office":"$38.7 million[2][3]","cinematography":"Hanania Baer","directed_by":"Joel Silberg","Soundtrack":"The soundtrack of the film was released by Polydor Records in 1984. The album contains the first performance on an album of rapper Ice-T produced by DJ Chris \"The Glove\" Taylor & David Storrs.[6] (He had released some 12\" singles previously.)Despite not being included on the official soundtrack, the film also features the songs \"Tour de France\" by Kraftwerk, \"Boogie Down\" by Al Jarreau, and \"Beatbox\" by Art of Noise.","production_companies":"Cannon Films Golan-Globus","release_dates":"June 4, 1984 (1984-06-04)|||||","Production":"According to the 2014 documentary Electric Boogaloo: The Wild, Untold Story of Cannon Films Menahem Golan of Cannon Films was inspired to create this film after his daughter saw a breakdancer in Venice Beach, California, one day. At the same time, he pressured the production crew to complete the film before Orion Pictures released their breakdancing film Beat Street.","produced_by":"Allen DeBevoise|David Zito|","starring":"Lucinda Dickey|Shabba Doo|Boogaloo Shrimp|Ben Lokey|Phineas Newborn III|Christopher McDonald|","running_time":"87 minutes[1]","Sequel":"Breakin' was followed by a sequel entitled, Electric Boogaloo, released in 1985.","music_by":"Michael Boyd|Gary Remal|","edited_by":"Larry Bock|Gib Jaffe|Vincent Sklena|","Release":"Breakin' opened in 1,069 venues on May 4, 1984 and outgrossed Sixteen Candles, which had more screens (1,240). The film ranked number one in the box office, earning $6,047,686.[7] By the end of its run, the film grossed $38,682,707 in the domestic box office.[3]Review aggregator website Rotten Tomatoes reports that 43% of seven critics gave the film a positive review.[8]On August 5, 2003, MGM Home Entertainment released Breakin' as a bare-bones DVD. On April 21, 2015, Shout! Factory released Breakin', along with the sequel Breakin' 2: Electric Boogaloo, as a double feature Blu-ray.","breakin'":"Theatrical release poster","budget":"$1.2 million[2]"}