{"based_on":"\"Your Arkansas Traveler\"  by Budd Schulberg","Real-life inspirations":"Aspects of the Lonesome Rhodes character were likely inspired by 1940s and '50s CBS radio-TV star Arthur Godfrey.[citation needed] The scene where Rhodes spoofs his sponsor on TV in Memphis echoes Godfrey's reputation for kidding his own advertisers. Godfrey claimed he would not advertise products he did not believe in, and routinely ridiculed both the sponsors' stodgy ad copy and occasionally, the companies' executives. The more Godfrey did this, the more sales increased. Godfrey's immense popularity began to deflate following his 1953 on-air firing of singer Julius LaRosa, which opened the gradual exposure of his less lovable, often controlling off-camera personality. Though he remained on radio, TV and even films for several years afterward, Godfrey's mass appeal and popularity had passed its apex, and were never the same. At one point in the film, Rhodes telegraphs Jeffries that he is going to miss a broadcast and requests that Godfrey fill in for him.Some[who?] have suggested that the character may have been inspired in part by John Henry Faulk, a country comedian who was long blacklisted as a result of the \"Red Scare\", although Faulk was never really a national figure.[citation needed]Screenwriter Schulberg himself claimed to have based a significant part of the character's facade on that of Will Rogers, adding a distinctively un-Rogers-like level of amorality and cruelty. In Richard Schickel's 2005 biography of director Elia Kazan, Schulberg explained that he had met Will Rogers, Jr. during the latter's run for Congress and discussed his famous father. The younger Rogers supposedly told Schulberg his father socialized with the very establishment types he mocked in his public pronouncements, adding that his father was actually a political reactionary in private life, not the populist he claimed to be.[2][page needed]The patent medicine pill \"Vitajex\" and its maker, \"General Hainesworth\", draw a close parallel to the patent medicine tonic Hadacol (which was similarly promoted as shown in the film) and its own maker, Louisiana State Senator Dudley J. LeBlanc. The film was released in 1957, and the Hadacol enterprise collapsed in a financial scandal in 1951.The film's scene in which Marcia turns up the volume on the studio, with Rhodes unaware that his voice can now be heard by his viewers, was inspired by the debunked urban legend of radio's Uncle Don show where he thought that he was off the air. His words: \"This is Uncle Don, saying good night. We're off. Good, that will hold those little bastards.\"To underscore the sway of television media in America, Kazan incorporated several cameos by well-known media personalities, including: Sam Levenson, John Cameron Swayze, Mike Wallace, Earl Wilson, and Walter Winchell.Two cast members had genuine ties to the country music field. Rod Brasfield was a popular Grand Ole Opry comedian in the 1950s, known for his own performances and onstage comic banter with legendary Opry comic Minnie Pearl. Big Jeff Bess, who portrayed the Sheriff, was a Nashville-based country music performer on radio station WLAC there, leading a group called \"Big Jeff and His Radio Playboys\", which recorded for Dot Records and included guitarist Grady Martin. Bess was, for a time, the husband of Tootsie Bess, longtime owner of Nashville's famous downtown bar Tootsie's Orchid Lounge, a hangout for country entertainers.","country":"United States","distributed_by":"Warner Bros.","Plot summary":"In late 1950s America, a drunken drifter, Larry Rhodes (Andy Griffith), is plucked out of a rural Arkansas jail by Marcia Jeffries (Patricia Neal) to sing on a radio show at station KGRK. His raw voice, folksy humor and personal charm bring about a strong local following, and he lands a television show in Memphis, Tennessee under the stage name \"Lonesome\" Rhodes, given to him on a whim by Jeffries.With the support of the show's staff writer Mel Miller (Walter Matthau) and Jeffries, the charismatic Rhodes ad libs his way to Memphis area popularity. When he pokes fun at his sponsor, a mattress company, they initially pull their ads—but when his adoring audience revolts, burning mattresses in the street, the sponsor discovers that Rhodes' irreverent pitches actually increased sales by 55%, and returns to the air with a new awareness of his power of persuasion. Rhodes also begins an affair with Jeffries and proposes to her.An ambitious office worker at the mattress company, Joey DePalma (Anthony Franciosa), puts together a deal for Rhodes to star in his own show in New York City. The sponsor is Vitajex, an energy supplement which he ingeniously pitches as a yellow pill which will make men energetic and sexually powerful. Rhodes' fame, influence and ego balloon. Behind the scenes, a woman (Kay Medford) turns up claiming to be his legitimate wife, he berates his staff, and betrays Jeffries by eloping with a 17-year-old drum majorette (Lee Remick) whose baton-twirling act he features on his next TV program. The onetime drifter and his new bride move into a luxury penthouse, while a furious Jeffries demands more money and credit for her role in Rhodes' success.The sponsor's CEO introduces Rhodes to a senator named Fuller whose presidential campaign is faltering. Under Rhodes' tutelage as media coach, the senator gains the lead in national polls. But Rhodes' life begins to unravel as his amoral dealings with the people closest to him have placed his career trajectory on a collision course with their festering wounds. At one point, he goes home early to find his agent DePalma and young wife Betty Lou ending a tryst. He returns to Jeffries and proclaims to her that with the election victory assured, he will soon serve on the President's cabinet as \"Secretary For National Morale,\" as a part of his organization called \"Fighters for Fuller.\" He also expects Jeffries to resume her romance with him; however, she runs away.Miller tells Jeffries he has written an exposé about Rhodes, entitled \"Demagogue in Denim\", and he has just found a publisher. Ultimately, Rhodes' ascent into fame and arrogance begins to turn on him. DePalma threatens to reveal Rhodes' own secrets if the affair with the young wife is made public, claiming that he and Rhodes are now part of the same corruption. Rhodes is stuck with his business partner, but cruelly dumps his cheating wife.The final blow is delivered by the one who has loved Rhodes the most and been most injured by his selfishness: Marcia Jeffries. At the end of one of Rhodes' shows, the engineer cuts the microphone and leaves Jeffries alone in the control booth while the show's credits roll. Millions of viewers watch (in what initially is silence) their hero Rhodes smiling and seeming to chat amiably with the rest of the cast. In truth, he is mocking Fuller, then going off on a vitriolic rant about the stupidity of his TV audience. In the broadcast booth, Jeffries reactivates his microphone, sending his words and laughter over the air live. A sequence of television viewers is shown to react to Rhodes' description of them all as \"idiots, morons, and guinea pigs\".Still unaware that his words have gone out over the air waves (with thousands of angry calls to local stations and the network headquarters), he departs the penthouse studio in a jovial mood and prophetically tells the elevator operator that he is going \"all the way down\". As the elevator numbers go down to 0, the show's popularity is plummeting as well. DePalma is already meeting with a young entertainer who could become Rhodes' replacement.Rhodes arrives at his penthouse, where he was to meet with the nation's business and political elite. Instead he finds an empty space, except for a group of black butlers and servants, by whom, in desperation, he demands to be loved. When they fail to respond, Rhodes dismisses all of them. Rhodes calls the studio and Jeffries listens to him rant as he threatens to jump to his death from the penthouse. Jeffries, who has been silent, suddenly screams at Rhodes, telling him to jump and to get out of her, and everybody's, life.Miller angrily dares her to face Rhodes and tell him the whole truth. They go to the penthouse and find Rhodes drunk and disconnected from reality. He shouts folksy platitudes and sings at the top of his lungs while his longtime flunky Beanie (Rod Brasfield) works an applause machine—Rhodes' own invention—to replace the cheers, applause, and laughter of the audience that has abandoned him. When he vows to get revenge on the TV studio's engineer, Jeffries admits it was she who betrayed him. She demands he never call her again, and Miller tells Rhodes that life as he knew it is over.Miller bemoans the fact that Rhodes is not really destroyed at all. Both the public's and the network's need for Rhodes, will, \"after a reasonable cooling off period\" of remorse and contrition, he predicts, return Rhodes to the public eye, but never to his previous height of power and success. Rhodes ends up screaming from the window of his penthouse for Marcia Jeffries to come back as she leaves in a taxi with Miller, while a Coca-Cola sign continuously flashes off and on.","screenplay_by":"Budd Schulberg","language":"English","Critical reception":"Upon its original release, A Face in the Crowd earned somewhat mixed reviews, one of them from Bosley Crowther of The New York Times. Though he applauded Griffith's performance (\"Mr. Griffith plays him with thunderous vigor ...\"[12]), at the same time, he felt that the character overpowered the rest of the cast and the story. \"As a consequence, the dominance of the hero and his monstrous momentum ... eventually become a bit monotonous when they are not truly opposed.\"[12] Crowther found Rhodes \"highly entertaining and well worth pondering when he is on the rise\", but considered the ending \"inane\".[12]One critic who had only praise for the movie was Francois Truffaut; in his review in Cahiers du Cinéma, he called the film \"a great and beautiful work whose importance transcends the dimensions of a cinema review\".[13]Over the decades critical opinion of the film has warmed considerably. A Face in the Crowd has a 92% \"fresh\" rating on Rotten Tomatoes, based on 24 reviews.[14]","cinematography":"Gayne Rescher|Harry Stradling Sr.|","directed_by":"Elia Kazan","release_dates":"May 28, 1957 (1957-05-28)|||||","Production":"Most of the film's interiors were shot in New York at the Biograph Studios in the Bronx.[3] This was preceded by location shooting in Memphis and in Piggott, Arkansas, where Rhodes meets Betty Lou.Contemporary newspapers reported an early 1956 trip by Kazan to Sarasota, Florida to confer with Schulberg.[4] Late in April, columnist Walter Winchell noted that Andy Griffith would depart the cast of his Broadway show No Time for Sergeants at the end of July, vacation for a month, and then begin shooting with Kazan. Kazan and Schulberg spent much of July and August 1956 in Memphis and in Arkansas,[5] and Patricia Neal's involvement would be announced by early August. Both Griffith and Lee Remick made their film debuts in Face.[1]The most involved location shoot was in Piggott, Arkansas (the fair and baton-twirling competition scenes). Five thousand extras were sought, to be fed and paid $1 hourly for a mid-August day's work. Sixty baton twirlers were rounded up from NE Arkansas and SE Missouri, and musicians from six different high school bands were assembled.[6] Remick reported spending two weeks in Piggott living with teen twirler Amanda Robinson and her family, working on her twirling and local accent. Some of her baton twirling scenes used a double. [7] At the Piggott location shoot some 380 dogs were assembled from Missouri and Arkansas[8] for the scene following Rhodes' first mass-action call on his audience: to take their dogs to the home of a local sheriff who was running for higher office – Rhodes opining that people should first find out if a candidate is worthy of the office of \"dog catcher\".Shooting in New York included 61 sets at Biograph Studios as well as some exteriors. Anthony Franciosa, eager to work with Kazan, had turned down a more lucrative offer to appear in MGM's The Vintage.[9] Writer Schulberg remained involved throughout: \"I went on a trip in 1955 to scout a location in Arkansas, and I've been on the set every day since shooting started in August [1956].\"[10]In stage performance, Griffith noted, he would work gradually up to his most intense moments, but needed to conjure that up spontaneously when shooting such scenes for Kazan. In some instances, he asked to have a few discarded chairs available to destroy, in order to work up his rage before filming.[11]","produced_by":"Elia Kazan","starring":"Andy Griffith|Patricia Neal|Anthony Franciosa|Walter Matthau|Lee Remick|","running_time":"125 minutes","music_by":"Tom Glazer","edited_by":"Gene Milford"}