{"country":"98 min.","distributed_by":"Kanoon","Plot":"Hossain Sabzian is a cinephile, and in particular a big fan of popular Iranian director Mohsen Makhmalbaf. One day, Sabzian is riding a bus with a copy of the novel The Cyclist; Mrs. Ahankhah sits next to him, revealing she is a fan of the novel's film adaptation. Sabzian tells her that he himself is Makhmalbaf, the maker. She is then surprised that a famous director would ride public transportation; Sabzian explains in response (posing as Makhmalbaf) that he finds his film subjects this way, telling her that art must spring from life. Posing as Makhmalbaf from this point on, Sabzian visits the Ahankhah family several times over the next two weeks. He flatters them by saying he wants to use not only their house in his next film, but also their sons as actors in it. He even obtains a substantial amount of money from them (ostensibly to prepare for the film). Mr. Ahankhah has his suspicions, however, especially when a magazine photo shows a younger Makhmalbaf with darker hair than that of Sabzian. He invites a journalist (Hossain Farazmand) over, who confirms Sabzian is indeed an impostor. The police come to arrest Sabzian, while Farazmand takes several pictures for his upcoming article: \"Bogus Makhmalbaf Arrested.\" Kiarostami intersperses these scenes throughout the film, in which the events described above do not progress chronologically; they are re-enactments.","language":"Iran","Critical reception":"When the film opened in Iran, reviews were almost uniformly negative, and the film only began to be appreciated after it was shown abroad. It ranked #43 in the British Film Institute's critics' poll of the 50 best films ever made. New York Times film critic Stephen Holden called the film \"brilliant,\" noting its \"radically drab cinema-verite style that helps blur any difference between what is real and what is reconstructed.\"[3] Los Angeles Times critic Dennis Lim called the film eloquent and direct and that it provided \"a window into the psyche of a complicated man and into the social and cultural reality of Iran.\"[4]","cinematography":"Hossain Sabzian Mohsen Makhmalbaf","production_company":"Abbas Kiarostami","directed_by":"کلوزآپ ، نمای نزدیک","close-up":"DVD cover","release_dates":"Celluloid Dreams","Production":"Close-Up is based on real events that occurred in Northern Tehran in the late 1980s. Kiarostami first heard about Sabzian in 1989 after reading about the incident in an article in the Iranian magazine Sorush by journalist Hassan Farazmand. Kiarostami immediately suspended work on the film project that he was in pre-production of and began making a documentary on Sabzian. Kiarostami was allowed to film Sabzian's trial and also got Sabzian, the Ahankhahs and Farazmand to agree to participate in the film and to re-enact incidents from the past. Kiarostami also arranged for Mohsen Makhmalbaf to meet Sabzian and help facilitate forgiveness between Sabzian and the Ahankhahs.[2]","produced_by":"Abbas Kiarostami","starring":"Abbas Kiarostami","running_time":"1990","Influence":"Five years after Close-Up, Moslem Mansouri and Mahmoud Chokrollahi wrote and directed the documentary Close-Up Long Shot (Persian: کلوزآپ نمای دور ‎‎, Klūzāp nemā-ye dūr) in which Sabzian talks about his infatuation with cinema, his impersonation of Makhmalbaf and how his life has changed after working with Kiarostami. The film premiered at Turin's 14° Festival internazionale cinema giovani in November 1996 where it won the FIPRESCI Prize – Special Mention.[5][6]Nanni Moretti's 1996 Italian short film Opening Day of Close-Up follows a theater owner as he prepares to show Kiarostami's film at his independent cinema.Marcus Söderlund's 2007 music video for Swedish duo The Tough Alliance's \"A New Chance\" pays homage to Kiarostami's film with an almost shot-for-shot reproduction of a scene following two characters on a motorcycle.[7][8]","edited_by":"Ali Reza Zarrindast","written_by":"Ali Reza Zarrin"}