{"based_on":"Bye Bye Birdie by Michael Stewart","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Irving Brecher","Differences from stage musical":"Several significant changes were made in the plot and character relationships in the film from the stage version. The film was rewritten to showcase the talents of rising star Ann-Margret, adding the title song for her and dropping songs by other characters.The name of the character Rosie Alvarez was changed to Rosie DeLeon. In both versions the character is a positive portrayal of a Latina; however, the song \"Spanish Rose\", originally performed in the stage musical by Chita Rivera in a comic, exaggerated Hispanic style to irritate Albert's mother, was dropped for this film.In the film, Albert is not Birdie's agent nor an aspiring English teacher but a talented research chemist. He contributed to Birdie's initial success, and therefore Birdie \"owes\" him a favor. Albert has not written \"One Last Kiss\" when Rosie pitches the idea to Sullivan.The film version of \"A Lot Of Livin' To Do\" features Pearson, Ann-Margret and Rydell in a colorful song-and-dance number that is staged to suggest that Kim and Hugo are trying to make each other jealous, but there is no suggestion during the number or after it that any under-age drinking or sexual activity is going on.The songs \"Baby, Talk to Me\", \"What Did I Ever See in Him\", and \"Normal American Boy\" were omitted from the film, as was the \"100 Ways to Kill a Man\" ballet.The plot structure is altered so that The Ed Sullivan Show broadcast is at the end of the movie; in the stage musical, it is at the closing of the first act. The film version also ends on a brighter note. Hugo prevents the \"last kiss\" by running out on stage, knocking Birdie out with a single punch on The Ed Sullivan Show. In doing so, he wins Kim's heart, and the young couple is reunited. There is no suggestion that Conrad got tired of show business, or that he suffered anything other than the embarrassment of being knocked out before an audience of millions of viewers. Albert's mother shows up with a man in tow, informs Albert and Rosie that she has married him, and gives Albert and Rosie her blessing for their long-postponed wedding. Albert and Mr. McAfee agree to become partners selling Albert's chemical formulas. The film then ends with Ann-Margret singing a slightly revised version of the title song: \"Bye Bye Birdie, the Army's got you now....\"","Plot":"Conrad Birdie (Jesse Pearson), a popular rock and roll star, receives an Army draft notice, devastating his teenage fans across the nation. Albert Peterson (Dick Van Dyke) is an unsuccessful songwriter, and music is the family business, although he has a doctorate in biochemistry. He schemes with his secretary and long-suffering girlfriend Rosie DeLeon (Janet Leigh) to have Birdie sing a song Albert will write, but Birdie's conscription puts a halt to the plan. Rosie, however, convinces Ed Sullivan to have Birdie sing a song Albert will write called \"One Last Kiss\" on The Ed Sullivan Show, and then kiss a randomly chosen high school girl goodbye before going off to the Army. Once that is a success, Albert will feel free to marry Rosie, despite his widowed, meddlesome mother Mae's (Maureen Stapleton) long history of ensuring nothing will come between her and her beloved son.Sweet Apple, Ohio, is chosen as the location for Birdie's farewell performance. The random lucky girl chosen is Kim MacAfee (Ann-Margret), who is thrilled. Kim already has a high school sweetheart, Hugo Peabody (Bobby Rydell), who is not so thrilled. The teenagers of Sweet Apple, blissfully unaware of their town's impending fame, are spending the \"Telephone Hour\" catching up on the latest gossip: Kim and Hugo have just gotten pinned. Kim feels grown up, and declares \"How Lovely to be a Woman\".On the day Birdie arrives in town, the teenage girls sing their anthem to him, \"We Love You Conrad\", but the boys despise him for their girls' love for him (\"We Hate You Conrad!\"). Sweet Apple becomes a very popular place, but some of the local adults are unhappy with the sudden celebrity, especially after Conrad shows off his hip-thrusting moves while his \"Honestly Sincere\" causes every female to faint. Under pressure from the town's notable citizens, Mr. McAfee is unwilling to allow his daughter to kiss Conrad on television, but Albert placates him by telling him that their \"whole family\" will be on Sullivan's TV show (\"Hymn for a Sunday Evening\"). Albert reveals to Mr. McAfee that he is actually a biochemist who has developed a miracle supplement for domestic animals that will make a hen lay 3 eggs a day; they test it on the family's pet tortoise, which speeds off out the door. McAfee, a fertilizer salesman, sees a great future for himself in partnership with Albert marketing this pill.Hugo feels threatened by Conrad; Kim reassures him that he is the \"One Boy\" for her. Rosie, meanwhile, feels like Albert does not appreciate her, so Albert persuades her to \"Put on a Happy Face\". Albert's mother shows up, distressed to find Albert and Rosie together. Harry (Paul Lynde), Kim's father, is also agitated, not liking the way Conrad is taking over his house. They lament what is wrong with these \"Kids\" today.During rehearsal for the broadcast, an impatient Conrad kisses Kim and she faints. Hugo is hurt and ends the relationship. Albert is told that, for unknown reasons, the Russian Ballet has switched to a different dance that needs extra time, therefore eliminating Conrad's song and farewell kiss to Kim. Their plans for the future could be ruined, so Albert goes to the Ballet manager to request to have their performance shortened so that Conrad Birdie could sing his song. The arrogant manager, probably unable to understand the importance of the song's inclusion, refuses to have it shortened, believing that cutting time would mean \"artistic sabotage\" to such a classic piece of work.A defeated and dejected Albert decides to drown his sorrows at Maude's Madcap Café and finds his mother there, playing canasta with Mr. Maude, the cafe's owner and a widower himself. Rosie, fed up with Albert and his mother, also goes to the café for \"a night to remember\". After ordering three drinks (but only gulping down one), Rosie goes into another room where a Shriners convention is taking place. She starts dancing and flirting with the men (\"Sultans' Ballet\"), but when the scene gets too wild, Albert rescues her from the crazed Shriners.Next day, Rosie comes up with the solution to get back Conrad's spot on The Ed Sullivan Show that evening. She slips one of Albert's pills into the milk of the orchestra's conductor which speeds up the ballet, amusing the audience, offending the Russians and placing Birdie back on the show to sing \"One Last Kiss\". However, just as Birdie is about to kiss Kim, Hugo runs onstage and knocks him out on the live telecast.Kim and Hugo reunite. Albert is free to marry now (\"Rosie\") and his mother agrees, revealing that she is now married to Mr. Maude. All three couples live happily ever after. Kim, now wiser, bids Conrad a fond goodbye in \"Bye Bye Birdie (Reprise)\".","bye_bye_birdie":"Original release poster","language":"English","Reception":"Bye Bye Birdie was the 13th highest grossing film of 1963, grossing $13,129,412 domestically,[1] earning $6 million in North American rentals.[7] The film was, rather surprisingly, given a Royal Charity Premiere when released in the UK on 7 November 1963, at the Odeon Marble Arch in the presence of H.R.H. The Duke of Edinburgh.The film was nominated for two Academy Awards.[8]It was also nominated for two Golden Globes.[9]","box_office":"$13.1 million[1]","cinematography":"Joseph Biroc","production_company":"The Kohlmar-Sidney Company Columbia Pictures","directed_by":"George Sidney","release_dates":"April 4, 1963 (1963-04-04)|||||","Production":"According to Ann-Margret, she was cast when director George Sidney saw her dancing while on a date at the Sands Casino on New Year's Eve 1961.[5] Sidney was so smitten with the rising new star, Janet Leigh was \"very upset that all the close-ups were going to Ann-Margret.\"[6]","produced_by":"Fred Kohlmar","starring":"Janet Leigh Dick Van Dyke Ann-Margret Maureen Stapleton Bobby Rydell Jesse Pearson Ed Sullivan","running_time":"112 minutes","music_by":"Johnny Green (Score) Charles Strouse (Music) Lee Adams (Lyrics)","edited_by":"Charles Nelson"}