{"country":"United States","distributed_by":"20th Century Fox","Plot summary":"The film begins with a clip from the previous film, showing its central characters Marcellus and Diana going to be martyred for their Christian beliefs on the order of Emperor Caligula. Before being executed, Diana hands the robe to Marcellus' servant Marcipor (David Leonard), telling him that it is \"for the Big Fisherman,\" meaning Peter, who was a fisherman before being called as an apostle.Peter (Michael Rennie) hands the robe to Demetrius while at the funeral of Marcellus and Diana before leaving on a journey to live in 'the north'. Caligula (Jay Robinson) becomes interested in the robe, thinking that it has magic powers and will bring him the 'eternal life' that Jesus had spoken of. He accosts his uncle Claudius (Barry Jones), wanting to know what had happened to it.Demetrius, looking out for his Lucia (Debra Paget) and the robe and refusing to reveal its location, is arrested for assaulting a Roman soldier, and sentenced to the arena. Meanwhile, Lucia disguises herself to gain entrance to the gladiator school to see Demetrius. However, the two are forcibly separated on orders of Messalina (Susan Hayward), Claudius' wife. Lucia is then assaulted by Dardanius (Richard Egan) and the other gladiators, forcibly kissing her and trying to carry her to private chambers. Demetrius in desperation prays for God to save her, and suddenly it appears that Dardanius has broken Lucia's neck. All present are shocked at Lucia's apparent death, especially Demetrius, and he loses all his faith in Jesus Christ as God. Previously, he had avoided killing anyone in the Emperor's games, because of his religion, but all that now changes. His next time in the arena, not only does he fight, but he ferociously kills all the gladiators that took part in the attack on Lucia. The Roman spectators, including the Emperor, are thrilled. Demetrius is freed, and allowed to join the Praetorian Guard. Caligula asks if Demetrius renounces Christ; he does, and once Demetrius does this, Caligula frees him and inducts him into the guard with the rank of Tribune.As a Tribune, Demetrius rejects the teachings of Christ (and of Isis when encountering Messalina praying to her statue), beginning an affair with Messalina. When Peter comes to visit them, he turns him away too. The affair continues for several months, and eventually Caligula finds out about it, and sends Demetrius to get the robe from the Christians.Demetrius is taken to a small house, where he is surprised to find Lucia's body, lying on a bed. He finds out that she never had died, after all, but that when he prayed for God to save her, her sudden coma had accomplished her rescue. Now, months later, she is still unconscious. Demetrius realizes he has made a mistake, prays to the Christian God and she wakes up.Demetrius takes the robe to the Emperor, who takes the robe down below to a prisoner. He has the prisoner killed, and tries to resurrect him. Furious that he cannot, Caligula accuses Demetrius of having brought him a fake, and that both the robe and Christ are frauds. Demetrius is horrified to learn that Caligula had a prisoner killed in order attempt to use the power of the robe to bring him back to life, and begins to make steps toward Caligula to attack him, but he is stopped by Caligula's guards and Demetrius is sent back to the arena. When the Emperor tries to have Demetrius executed, the Praetorian Guard (already angry at Caligula over worse pay and conditions) finally turns against Caligula and kills first Macro (Karl 'Killer' Davis), the prefect of the Praetorian Guard, then Caligula. Claudius is installed as Emperor by the Praetorian Guard almost immediately after Caligula is killed.Soon after his installation, Claudius says that he is neither a god, nor would he likely become one anytime soon. Claudius says that he maintained the appearance of being weak to survive Caligula's rule, and that he would now take on the role of Emperor to the best of his ability. He gives Demetrius his final orders as a Tribune, to go to Peter and the other Christians and tell them that, as long as they do not act against the Empire, they have nothing to fear from Claudius. Messalina re-vows her constancy to her husband. Demetrius and Glycon (William Marshall) (another virtuous gladiator) take the robe to Peter, and they leave the Imperial Palace together.","language":"English","Reception":"Demetrius and the Gladiators was a massive commercial success. In its initial release, the film earned $4.25 million in US theatrical rentals,[3][4] against a budget of less than $2 million. Overall, it grossed $26 million in North America,[2] making the 4th highest grossing film of 1954.","box_office":"$26,000,000[2]","cinematography":"Milton R. Krasner","directed_by":"Delmer Daves","demetrius_and_the_gladiators":"Original film poster","release_dates":"June 18, 1954 (1954-06-18)|||||","produced_by":"Frank Ross","starring":"Victor Mature Susan Hayward Michael Rennie William Marshall Debra Paget Anne Bancroft Jay Robinson Ernest Borgnine Barry Jones Richard Egan","running_time":"101 min","music_by":"Franz Waxman","edited_by":"Robert Fritch Dorothy Spencer","written_by":"Philip Dunne Lloyd C. Douglas","budget":"$1.99 million[1]"}