{"based_on":"Brødre  by Susanne Bier and Anders Thomas Jensen","country":"United States","distributed_by":"Lionsgate Relativity Media","screenplay_by":"David Benioff","brothers":"Promotional film poster","Plot":"Sam Cahill (Tobey Maguire) is a Marine captain about to embark on his fourth tour of duty. He is a steadfast family man married to his high school sweetheart, Grace (Natalie Portman), and he has two young daughters, Isabelle (Bailee Madison) and Maggie (Taylor Geare). Sam's brother Tommy (Jake Gyllenhaal) is being released from jail for an armed robbery, before Sam departs for Afghanistan in October 2007. News comes that Sam's helicopter has crashed over the water, killing all of the Marines aboard. In reality, he and a hometown friend, Private Joe Willis (Patrick Flueger), have been taken prisoner in a mountain village.With Sam gone, Tommy attempts to redeem himself in the eyes of his family by wrangling old friends to help with kitchen repairs for Grace and the girls. Grace slowly sheds her previous resentment towards her brother-in-law. As months pass, Grace and Tommy bond over their mutual mourning, culminating in a passionate fireside kiss. They immediately regret it afterwards and do not take their attraction any further, though Tommy continues to win the favor of his nieces. Meanwhile, Sam and Joe are tortured by their captors, forced to make videotaped dismissals of the military and their mission, though only Joe cracks. The captors eventually deem him useless and force Sam, at gunpoint, to beat Joe to death with a lead pipe.Sometime later, Sam is rescued. Once Sam returns home, he drifts through a cold, paranoid daze, showing signs of severe post-traumatic stress disorder. Refusing to explain to his family what happened while he was in Afghanistan, Sam also lies to Joe's widow that he does not know how Joe died. He also believes Tommy and Grace had a sexual relationship in his absence. During Maggie's birthday party at her grandparents' home, a resentful and jealous Isabelle claims that Sam's paranoid assumptions are true: that Tommy and Grace slept together. After the family returns home, Sam becomes enraged, destroying the newly remodeled kitchen with a crow bar and pulling a pistol on Tommy who arrives and tries to calm his brother's violent breakdown.The police arrive, and after a violent confrontation in which Sam holds the gun up against his head and nearly commits suicide, he reluctantly surrenders after a frantic plea from Tommy and Grace. After the police arrest Sam, he is admitted to a mental hospital. Grace visits him and tells him that if he does not tell her what is tormenting him, he will lose her forever. Faced with this decision, Sam finally opens up about the source of his pain, confiding in her that he killed Joe and they embrace. A letter between husband and wife is read aloud, with Sam wondering if he will be able to continue living a normal life.","language":"English","Reception":"On its opening weekend, the film opened #3 with $9,527,848 behind New Moon and The Blind Side.[3] Since its box office debut the film has grossed $43,318,349 worldwide.[1]The film received mixed to positive reviews from film critics. Review aggregator Rotten Tomatoes reports that 63% of 150 critics have given the film a positive review, with a rating average of 6.2 out of 10. The site's consensus is that \"It plays more like a traditional melodrama than the Susanne Bier film that inspired it, but Jim Sheridan's Brothers benefits from rock-solid performances by its three leads.\"[4] On Metacritic the film has a rating of 58 out of 100 based on 31 reviews.[5] Maguire in particular received critical acclaim for his dramatic performance. Roger Ebert said that Brothers is \"Tobey Maguire's film to dominate, and I've never seen these dark depths in him before.\"[6] Richard Roeper of the Chicago Sun Times named Brothers as the best film of 2009.Of the Golden Globe Award nomination, Tobey Maguire said \"I had no expectation about getting a nomination, but I was watching nonetheless. My wife and my son got really excited. I was sort of surprised — I was like, 'Oh, wow.' And I couldn't hear the latter part of my name.\" The Edge of U2 described how the band planned to celebrate the nomination. \"I think we might have a pint of Guinness and eat a potato in honor of (director) Jim (Sheridan) and his great piece of work.\"[7]","box_office":"$43.3 million[1]","cinematography":"Frederick Elmes","production_company":"Michael De Luca Productions Relativity Media Sighvatsson Films","directed_by":"Jim Sheridan","Home media":"Brothers was released on DVD and Blu-ray on March 23, 2010.[citation needed]","release_dates":"December 4, 2009 (2009-12-04)|||||","produced_by":"Michael De Luca Sigurjón Sighvatsson Ryan Kavanaugh","starring":"Tobey Maguire Jake Gyllenhaal Natalie Portman","running_time":"105 minutes","music_by":"Thomas Newman","edited_by":"Jay Cassidy","budget":"$26 million[1]"}