{"country":"Ireland|United Kingdom|United States|","distributed_by":"StudioCanal (UK)|IFC Films (US)|","Plot":"In 2010 an old man picks up a discarded note dropped by teenage vampire Eleanor Webb, who has taken to writing her life story but then throwing the individual pages to the wind. Realising what she is, the old man invites Eleanor to his house, and tells her that he is ready for death. Eleanor proceeds to kill him and consume his blood. Elsewhere, Eleanor's mother, Clara, is chased from the lap-dancing club where she has been working by Werner, a member of the vampiric Brethren, who demands to know where Eleanor is. Clara decapitates Werner, burns his body and leaves town with her daughter.Eleanor and Clara seek sanctuary in a dilapidated coastal resort. There, Clara sets her sights on a lonely soul named Noel, who has just inherited the Byzantium Hotel, a once-thriving business that has fallen into disrepair. Meanwhile, Eleanor plays the piano in a restaurant and is approached by a young waiter named Frank, who takes a shine to her. Having seduced Noel, Clara turns the Byzantium into a makeshift brothel and Eleanor joins the local college which Frank also attends. Interested in her past, Frank questions Eleanor, who writes her story for him to read. Not entirely believing it, he shows it to their teacher, Kevin.The story, revealed in a series of flashbacks over the course of the film, begins during the Napoleonic Wars, when a young Clara encounters two Royal Navy officers, Captain Ruthven and Midshipman Darvell. Much to the dismay of Darvell, Clara leaves with Ruthven, who forces her into prostitution. When Eleanor is born in 1804, Clara leaves her at the local private orphanage, and secretly visits her at night. Years later, Clara is dying of what appears to be tuberculosis when the brothel is visited by Darvell, who has become a vampire. He gives Ruthven a map to an island where people can become vampires if they are willing to die. Clara shoots Ruthven in the leg, steals the map, and makes her way to the island to become a vampire. Darvell finds Clara and takes her to the Brethren, a secret society of vampires that protects the secret of vampirism. As their members have traditionally been male noblemen, they are appalled that a low-born prostitute has joined their ranks, but decide to spare her life, warning her that she must abide by their code, but that she may play no part in their Brotherhood. Shortly after, Clara's decision to spare Ruthven comes back to haunt her when the vengeful, syphilis-ridden Captain turns up at Eleanor's orphanage and drags her down to the basement to rape her. Clara brutally murders him, but she is too late; Eleanor is now condemned to a slow, painful death. Desperate to save her daughter's life, Clara takes Eleanor to the island and has her transformed into a vampire, violating the Brethren's code. The Brethren begin hunting Clara and Eleanor.Back in the present day, Eleanor has fallen in love with Frank and decides to help him turn into a vampire so they can be together, since he is dying from leukaemia. Before killing him, Clara finds out from Kevin that Eleanor has told Frank of their past. Noel is accidentally killed, falling down the lift shaft, as Clara tries to prevent Eleanor from leaving the hotel and succeeds in trapping her in the lift. While Clara is out dealing with Frank, Darvell and Savella, the Brethren's leader, posing as policemen, find out from Kevin's colleague Morag where Clara is and go to kill her. Clara leaves without killing Frank when she realises that Eleanor is in mortal danger. The Brethren kidnap Eleanor and drive her to an abandoned location with the intention of destroying her, only to be stopped by Clara. After killing Morag, Savella battles Clara and ultimately subdues her. Savella hands Darvell his sword (which he took from Byzantium during the Crusades) so he can kill Clara. Darvell has always harboured feelings for Clara, and kills Savella instead. On the run again, Clara leaves with Darvell, and Eleanor takes Frank to the island so he can become a vampire.","language":"English","Reception":"Byzantium received generally positive reviews from film critics. Review aggregation website Rotten Tomatoes gives a score of 63% based on reviews from collected 104 reviews, with an average rating of 6.4/10. The site's consensus reads: \"Director Neil Jordan remains as expert as ever when it comes to setting a chilling mood, but Byzantium struggles to match its creepily alluring atmosphere with a suitably compelling story.\"[8] Metacritic gave the film a \"generally favorable\" score of 66 based on reviews from 22 sampled reviewers.[9]","box_office":"$828,284[5]","cinematography":"Sean Bobbitt","directed_by":"Neil Jordan","production_companies":"Demarest Films Lipsync Productions Number 9 Films Parallel Film Productions WestEnd Films","release_dates":"9 September 2012 (2012-09-09) (TIFF)|31 May 2013 (2013-05-31) (United Kingdom)[1]|28 June 2013 (2013-06-28) (United States)[2]|||","produced_by":"Sam Englebardt|William D. Johnson|Elizabeth Karlsen|Alan Moloney|Stephen Woolley|","starring":"Saoirse Ronan|Gemma Arterton|Sam Riley|Jonny Lee Miller|","running_time":"118 minutes[3]","music_by":"Javier Navarrete","byzantium":"Promotional poster","edited_by":"Tony Lawson","Release":"The film premiered at the Irish Film Institute on 28 April 2013 with director Neil Jordan in attendance.[6] It also received a red carpet screening in Hastings on 5 June 2013.[7]The film was shown at the Glasgow Film Festival in February 2013 with Neil Jordan, Saoirse Ronan, and Gemma Arterton in attendance.[citation needed]The film was released in the United Kingdom on 31 May 2013, and received a limited release in North America on 28 June 2013.[5]","written_by":"Moira Buffini","budget":"£8 million[4]"}