{"based_on":"The Life and Times of Cleopatra  by C.M. Franzero Histories  by Plutarch, Suetonius, and Appian","country":"United States[2]","Awards and nominations":"The film won four Academy Awards and was nominated for five more:[14][15]","50th Anniversary restored version":"Schawn Belston serving as senior vice president of library and technical services for 20th Century Fox was put in charge of creating a restored version of the film for the company. After a two-year process in 2013 he was able to restore a four-hour, eight minute version. One of Belston's finds for this version was the original camera negative which was shot on 65mm. (Any longer version would have only existed to show 1963's studio boss Darryl Zanuck which has yet to be found.) Fading and damage to the negative was corrected digitally with an eye on preserving detail and authenticity while avoiding digital manipulation.[16]Belston's team also had the original magnetic print masters which they used to restore the sound. They removed the clicks and hisses, then with the aid of the trained ears of musicians reconfigured the track for 5.1 surround sound.[16]On May 21, 2013, the restored film was shown at a special screening at Cannes. The film was later released as a 50th anniversary version available on DVD and Blu-ray. Unfortunately Fox had long ago destroyed all of the trims and outs from negatives to save costs years before, preventing the release of traditional outtakes. The home media packages did include commentary tracks and two short films \"The Cleopatra Papers\" and a 1963 film about the elaborate sets \"The Fourth Star of Cleopatra\".[16]","distributed_by":"20th Century-Fox","screenplay_by":"Joseph L. Mankiewicz Ranald MacDougall Sidney Buchman","Plot":"After the Battle of Pharsalus in 48 BC, where Julius Caesar (Rex Harrison) has defeated Pompey in a brutal civil war for control of the Rome Republic, Pompey flees to Egypt, hoping to enlist the support of the young Pharaoh Ptolemy XIII (Richard O'Sullivan) and his sister Cleopatra (Elizabeth Taylor). The Romans hold, and the armies of Mithridates arrive on Egyptian soil. The following day, Caesar passes judgment. He sentences Ptolemy's lord chamberlain to death for arranging an assassination attempt on Cleopatra. Cleopatra is crowned Queen of Egypt. She dreams of ruling the world with Caesar. When their son Caesarion is born, Caesar accepts him publicly, which becomes the talk of Rome and the Senate.After he is made dictator for life, Caesar sends for Cleopatra. She arrives in Rome in a lavish procession and wins the adulation of the Roman people. The Senate grows increasingly discontented amid rumors that Caesar wishes to be made king, which is anathema to the Romans. On the Ides of March in 44 BC, the Senate is preparing to vote on whether to award Caesar additional powers. They kill Caesar and split up the empire: Lepidus receives Africa, Octavian Spain and Gaul, while Antony will take control of the eastern provinces. However, the rivalry between Octavian and Antony is becoming apparent.While planning a campaign against Parthia in the east, Antony realizes he needs money and supplies, and cannot get enough from anywhere but Egypt. After refusing several times to leave Egypt, Cleopatra gives in and meets him in Tarsus. Antony becomes drunk during a lavish feast. Cleopatra sneaks away, leaving a slave dressed as her, but Antony discovers the trick and confronts the queen. The war is decided at the naval Battle of Actium on September 2, 31 BC where Octavian's fleet, under the command of Agrippa, defeats the Antony-Egyptian fleet. Cleopatra assumes he is dead and orders the Egyptian forces home. Antony follows, leaving his fleet leaderless and soon defeated. Several months later, Cleopatra manages to convince Antony to retake command of his troops and fight Octavian's advancing army. However, Antony's soldiers have lost faith in him and abandon him during the night; Rufio (Martin Landau), the last man loyal to Antony, kills himself. Antony tries to goad Octavian into single combat, but is finally forced to flee into the city.Octavian and his army march into Alexandria with Caesarion's dead body in a wagon. Octavian has taken Caesarion's ring, which his mother gave him earlier as a parting gift when she sent him to safety.When Antony returns to the palace, Apollodorus, not believing that Antony is worthy of his queen, convinces him that she is dead, whereupon Antony falls on his own sword. Apollodorus then confesses that he misled Antony and assists him to the tomb where Cleopatra and two servants have taken refuge. Antony dies of his wounds soon after.Octavian seizes the palace and discovers the dead body of Apollodorus, who had poisoned himself. Octavian receives word that Antony is dead and Cleopatra is holed up in a tomb. Octavian sees her and after some verbal sparring offers her his word that he will spare her, return her possessions, and allow her to rule Egypt as a Roman province in return for her agreeing to accompany him to Rome. She observes Caesarion's ring on Octavian's hand and inquires after her son. When Octavian denies any knowledge of his whereabouts and pledges to allow him to rule Egypt in his mother's absence, Cleopatra knows her son is dead and that Octavian's word is without value. She agrees to Octavian's terms, including a pledge not to harm herself, sworn on the life of her dead son. After Octavian departs, she orders her servants in coded language to assist with her suicide.She sends her servant Charmion to give Octavian a letter. In the letter she asks to be buried with Antony. Octavian realizes that she is going to kill herself and he and his guards burst into Cleopatra's chamber and find her dressed in gold, and dead, along with her servant Eiras, while an asp crawls along the floor.Charmion is found kneeling next to the altar on which Cleopatra is lying, and Agrippa asks of her: \"Was this well done of your lady?\" She replies: \"Extremely well. As befitting the last of so many noble rulers.\" She then falls dead as Agrippa watches.","Reception and impact":"The film earned Elizabeth Taylor a Guinness World Record title, \"Most costume changes in a film\"; Taylor made 65 costume changes. This record was beaten in 1996 in the film Evita by Madonna with 85 costume changes.Critics remain divided about the film; Rotten Tomatoes reports 55% of 33 critics reviewed it positively.[9] A New York Times review called it \"one of the great epic films of our day,\"[10] while Judith Crist dubbed it \"a monumental mouse.\"[11] Newsweek stated: \"At six hours, Cleopatra might have been a movie. But for now, it's a series of coming attractions for something that will never come.\"[10] A reviewer for Time said, \"As drama and as cinema, Cleopatra is riddled with flaws. It lacks style both in image and in action.\"[9] American film critic Emanuel Levy said, \"Much maligned for various reasons, [...] Cleopatra may be the most expensive movie ever made, but certainly not the worst, just a verbose, muddled affair that is not even entertaining as a star vehicle for Taylor and Burton.\"[9]Even Elizabeth Taylor found it wanting. She had said, \"They had cut out the heart, the essence, the motivations, the very core, and tacked on all those battle scenes. It should have been about three large people, but it lacked reality and passion. I found it vulgar.\"[12]Positive reactions came from such publications as American entertainment-trade magazine Variety, who wrote, \"Cleopatra is not only a supercolossal eye-filler (the unprecedented budget shows in the physical opulence throughout), but it is also a remarkably literate cinematic recreation of an historic epoch.\"[9] Billy Mowbray for the website of British digital channel Film4 remarked that the film is \"A giant of a movie that is sometimes lumbering, but ever watchable thanks to its uninhibited ambition, size and glamour.\"[9]The film was shown as part of the Cannes Classics section of the 2013 Cannes Film Festival, to commemorate its 50th Anniversary.[13]","language":"English","box_office":"$57.8 million (US)[4]","cinematography":"Leon Shamroy","directed_by":"Joseph L. Mankiewicz","cleopatra":"Original theatrical release poster","Soundtrack":"The music of Cleopatra was scored by Alex North. It was released several times, first as an original album, and later versions were extended. The most popular of these was the Deluxe Edition or 2001 Varèse Sarabande album.","References in other works":"The French comic book Asterix and Cleopatra, published first in serial form the same year the film was released, parodies the film. In particular, the cover of the comic book mocks the film's massive casts and sets by claiming it is the \"Greatest story ever drawn\" and that \"14 litres of India ink, 30 brushes, 62 soft pencils, 1 hard pencil, 27 rubbers, 1984 sheets of paper, 16 typewriter ribbons, 2 typewriters, 366 pints of beer went into its creation!\" Cleopatra herself is drawn to look somewhat like Elizabeth Taylor.The Italian comedy film Totò e Cleopatra (\"Totò and Cleopatra\", 1963), directed by Fernando Cerchio, is a parody of the original classic, featuring Italian comedy star Totò as Mark Antony and French actress Magali Noël as Cleopatra. Although a farce from beginning to end and completely deviating from both the plot of the original and historical events, the film does effectively satirize some of Cleopatra's elements, such as the lavish and costly production and the tormented nature of Antony and Cleopatra's relationship.","release_dates":"June 12, 1963 (1963-06-12) (New York, premiere)|July 31, 1963 (1963-07-31) (United Kingdom)||||","Production":"The eventual production costs of Cleopatra almost bankrupted 20th Century Fox. Originally budgeted at $2 million,[6] the film ended up costing $31 million, making it the most expensive film ever made at the time.[3] This was partly because the film's elaborate, complicated sets, costumes and props had to be constructed twice, first during an abandoned shoot in London and once more when the production relocated to Rome.Veteran Hollywood producer Walter Wanger was hired by 20th Century Fox executives to shepherd a remake of the silent 1917-hit Cleopatra into production. Though the studio originally sought a relatively cheap production of $2 million, Wanger envisioned a much more opulent epic. After he was able to negotiate a higher budget of $7 million, screenwriter Nigel Balchin was hired to pen the script. Dale Wasserman would later rewrite Balchin's material, though neither of them ended up receiving screen credit. Filming began in London in 1960 under Rouben Mamoulian. Mankiewicz was brought into the production after Mamoulian's departure. Leon Shamroy replaced Jack Hildyard as cinematographer. Mankiewicz inherited a film which was already $5 million over budget and had no usable footage to show for it. This was in part because the actors originally chosen to play Julius Caesar (Peter Finch) and Mark Antony (Stephen Boyd) left owing to other commitments. Mankiewicz was later fired during the editing phase, only to be rehired when no one else could piece the film together (since Mankiewicz was hired so late in the production, he was rewriting the screenplay during principal photography; there was never a finished shooting script as such).Elizabeth Taylor was awarded a record-setting contract of $1 million. This amount eventually swelled to $7 million because of the delays of the production (equivalent to $54,100,000 in 2015).[7] Taylor became very ill during the early filming and was rushed to hospital, where a tracheotomy had to be performed to save her life. The resulting scar can be seen in some shots. All of this resulted in the film being shut down. The production was moved to Rome after six months as the English weather proved detrimental to her recovery, as well as being responsible for the constant deterioration of the costly sets and exotic plants required for the production. (The English sets were used for the British comedy Carry On Cleo.) During filming, Taylor met Richard Burton and the two began a very public affair, which made headlines worldwide since both were married to others. Moral outrage over the scandal brought bad publicity to an already troubled production.The cut of the film which Mankiewicz screened for the studio was six hours long. This was cut to four hours for its initial premiere, but the studio demanded (over the objections of Mankiewicz) that the film be cut once more, this time to just barely over three hours to allow theaters to increase the number of showings per day. As a result, certain details are left out of the film, such as Rufio's death and the recurring theme of Cleopatra's interaction with the gods of Egypt.[8] Mankiewicz unsuccessfully attempted to convince the studio to split the film in two in order to preserve the original cut. These were to be released separately as Caesar and Cleopatra followed by Antony and Cleopatra. The studio wanted to capitalize on the publicity of the intense press coverage the Taylor-Burton romance was generating, and felt that pushing Antony and Cleopatra to a later release date was too risky. The film has been released to home video formats in its 248-minute premiere version, and efforts are under way to locate the missing footage (some of which has been recovered).","produced_by":"Walter Wanger","starring":"Elizabeth Taylor Richard Burton Rex Harrison Roddy McDowall Martin Landau Hume Cronyn George Cole","running_time":"248 minutes[1]","music_by":"Alex North","edited_by":"Dorothy Spencer Elmo Williams","budget":"$31.1 million[3]"}