{"country":"United States","Awards and nominations":"The film was nominated for two Academy Awards:[6]","distributed_by":"Warner Bros.","Plot":"Edward Jessup is a university professor of abnormal psychology who, while studying schizophrenia, begins to think that \"our other states of consciousness are as real as our waking states.\"[2] Jessup begins experimenting with sensory deprivation using a flotation tank, aided by two like-minded researchers, Parrish and Rosenberg. At a faculty party he meets fellow \"wonder kid\" Emily and the two eventually marry.The film skips ahead seven years. Eddie and Emily have two daughters, are on the brink of divorce, and reunite with the couple who first introduced them. When Edward hears of a Mexican tribe that experiences shared illusion states, he travels to Mexico to participate in what is apparently an Ayahuasca Ceremony. During the walk into the bush his guide states that the indigenous tribe they are meeting works with Amanita muscaria which they are collecting for next year's ceremonies. The tribe refer to one of the ingredients of the mixture they use as \"First Flower\". An indigenous elder is seen with Banisteriopsis caapi root in his hand prior to cutting Jessup's hand, adding blood to the mixture he is preparing. Immediately after consumption Edward experiences bizarre, intense imagery. He returns to the U.S. with a tincture and continues taking it to trigger his ability to experience altered states of consciousness.When toxic concentrations of the substance make increased dosage dangerous, Jessup returns to sensory deprivation, believing it will enhance the effects of the substance at his current dose. Repairing a disused tank in a medical school, Jessup uses it to experience a series of increasingly drastic visions, including one of early hominids. Monitored by his colleagues, Jessup insists that his visions have \"externalized\". Emerging from the tank, his mouth bloody, frantically writing notes because he is unable to speak, Jessup insists on his being x-rayed before he \"reconstitutes\". A radiologist inspecting Jessup's X-rays says that they belong to a gorilla.In later experiments, Jessup experiences actual, physical biological devolution. At one stage he emerges from the isolation tank as a feral and curiously small-statured, light-skinned Primitive Man, going on a rampage before returning to his natural form. Despite the concern of colleagues, Jessup stubbornly continues.In the ultimate experiment, Edward experiences a more profound regression, transforming into an amorphous mass of conscious, primordial matter. An energy wave released from the experiment stuns Jessup's colleagues, and destroys Jessup's tank. Emily arrives to find a swirling maelstrom where the tank had been. Emily searches the vortex for Jessup, finding him as he is on the brink of becoming a non-physical form of proto-consciousness and possibly disappearing from our version of reality altogether.His friends bring Edward home, hoping that the transformations will end. Watched over by Emily, Jessup again begins to regress again, the transformations no longer require intake of \"first flower\" or sensory deprivation. Urging Jessup to fight the change, Emily grabs his hand, immediately being enveloped by the primordial energy emanating from Jessup. The sight of Jessup's wife, apparently being consumed by the energy, stirs the human consciousness in Jessup's devolving form. He fights the transformation and returns to his human form. In the final scene, Jessup embraces Emily, and his love for her returns her to normal.","language":"English Spanish","Critical reception":"Rotten Tomatoes gave the film a rating of 86% \"Fresh\" and a consensus that states \"Extraordinarily daring for a Hollywood film, Altered States attacks the viewer with its inventive, aggressive mix of muddled sound effects and visual pyrotechnics.\" Janet Maslin of The New York Times termed the film a \"methodically paced fireworks display, exploding into delirious special-effects sequences at regular intervals, and maintaining an eerie calm the rest of the time. If it is not wholly visionary at every juncture, it is at least dependably — even exhilaratingly — bizarre. Its strangeness, which borders cheerfully on the ridiculous, is its most enjoyable feature.\"[3] She also called it \"in fine shape as long as it revels in its own craziness, making no claims on the viewer's reason. But when it asks you to believe that what you're watching may really be happening, and to wonder what it means, it is asking far too much. By the time it begins straining for an ending both happy and hysterical, it has lost all of its mystery, and most of its magic.\"[3]Richard Corliss began his review of the film thus:[2]Corliss calls the film a \"dazzling piece of science fiction\"; he recognizes the film's dialogue as clearly Chayefsky's, with characters that are \"endlessly reflective and articulate, spitting out litanies of adjectives, geysers of abstract nouns, chemical chains of relative clauses\", dialogue that's a \"welcome antidote to all those recent...movies in which brutal characters speak only words of one syllable and four letters.\"[2] But the film is ultimately Russell's, who inherited a \"cast of unknowns\" chosen by its original director and \"gets an erotic, neurotic charge from the talking-heads scenes that recall Penn at his best.\"[2]Pauline Kael, on the other hand, wrote that the \"grotesquely inspired\" combination of \"Russell, with his show-biz-Catholic glitz mysticism, and Chayefsky, with his show-biz-Jewish ponderousness\" results in an \"aggressively silly picture\" that \"isn't really enjoyable.\"[5]John C. Lilly liked the film, and noted the following in an Omni magazine interview published in January 1983:","box_office":"$19.8 million","cinematography":"Jordan S. Cronenweth","directed_by":"Ken Russell","release_dates":"December 25, 1980 (1980-12-25)|||||","Production":"The film's original director was Arthur Penn, who resigned[1] after a dispute with Chayefsky[citation needed] according to Mad As Hell, a 2014 book by Dave Itzkoff. Special effects expert John Dykstra was replaced by Bran Ferren, who is credited for Special Visual Effects in the front titles, and created the VFX actually used in the film. The film was produced originally at Columbia Pictures, which would later end its participation with it, before Warner Bros. bought the rights. Chayefsky later withdrew his name from the project; film critic Janet Maslin, in her review of the film, thought it \"easy to guess why\":[3]Film critic Richard Corliss attributed Chayefsky's disavowal of the film to distress over \"the intensity of the performances and the headlong pace at which the actors read his dialogue.\"[2]Russell maintained that he changed almost nothing in Chayefsky's script, and called the writer \"impossible to please.\"[4]Itzkoff's book chronicles the making of Altered States and claims that Russell, objecting to Chayevsky's interference, had the writer banned from the set. Chayevsky reportedly tried to have Russell removed as director, but by then the film was already well under way, and the studio already had replaced one director (Penn). Chayevsky elected to remove his name from the credits, even though he was paid $1 million for it and it was his first screenplay after winning an Academy Award for Network.","produced_by":"Howard Gottfried Daniel Melnick","starring":"William Hurt Blair Brown Bob Balaban","running_time":"103 minutes","altered_states":"Theatrical release poster","music_by":"John Corigliano","edited_by":"Stuart Baird","Release":"Selected premiere engagements of Altered States were presented in Megasound, a surround sound system similar to Sensurround.[citation needed]","written_by":"Sidney Aaron","budget":"$15 million[1]"}