{"based_on":"Characters  by Wes Craven","country":"United States","distributed_by":"New Line Cinema","screenplay_by":"Wes Craven|Bruce Wagner|Frank Darabont|Chuck Russell|","story_by":"Wes Craven|Bruce Wagner|","Plot":"Kristen Parker is a young girl who dreams herself into an abandoned house in Elm Street where she is chased by serial killer Freddy Krueger. She wakes up and goes to the bathroom, where she is attacked by Freddy again and slices her wrist with a straight razor. Believing her to be suicidal, her mother has her sent to Westin Hospital, run by Dr. Neil Gordon, where she fights against the orderlies who try to sedate her, for fear of falling asleep. She is eventually calmed by intern therapist Nancy Thompson who recites part of Freddy's nursery rhyme and earns her trust.Nancy is introduced to the rest of the patients: Phillip, a habitual sleepwalker; Kincaid, a tough kid from the streets who is prone to violence; Jennifer, a hopeful television actress; Will, who is confined to a wheelchair after a suicide attempt; Taryn, a former drug addict; and Joey, who is too traumatized to speak. Later, Kristen is attacked by Freddy again (this time as a giant snake), and unwittingly pulls Nancy into her dream with her, allowing them both to escape. Kristen reveals she has had the ability to pull people into her dreams since she was a little girl. Over the next two nights, Freddy throws Phillip off a roof in what looks like a suicide attempt and kills Jennifer by smashing her head into a television that she was watching.In their next group session, Nancy reveals to the remaining patients that they are the last surviving children of the people who banded together and burned Krueger to death many years ago. Nancy and Neil encourage them to try group hypnosis so that they can experience a shared dream and discover their dream powers. In the dream, Joey wanders off and is captured by Freddy, leaving him comatose in the real world; Nancy and Neil are fired. Neil is told by a nun, Sister Mary Helena, that Freddy is the son a young nun who was accidentally locked in a room with hundreds of mental patients who raped her continually, and that the only way to stop him is to lay his bones to rest. He and Nancy go to her father, Don Thompson, to discover where the bones are hidden, but he is uncooperative. Nancy rushes back to the hospital after she hears Kristen is going to be sedated, while Neil convinces Thompson to help them.Nancy and the others again go through group hypnosis so they can reunite with Kristen, but are all separated after Freddy interrupts them. Taryn and Will are subsequently killed by Freddy while Kirsten, Nancy, and Kincaid find one another. The trio rescue Joey but are unable to defeat Freddy, who has become too powerful because of all the souls he has consumed. However, Freddy senses that his remains have been found in an auto salvage yard and possesses his own skeleton to kill Thompson and incapacitate Neil. He returns to attack the others, but Joey uses his dream power voice to send him away. Thompson appears to Nancy to tell her that he is \"crossing over\", but he is revealed to be Freddy in disguise, who stabs and kills Nancy. As he is about to kill Kristen too, Neil awakens and consecrates the bones, finally destroying him. At Nancy's funeral, Neil sees Mary Helena again and when he tries to follow her, finds her tombstone, revealing herself as Amanda Krueger, Freddy's mother.","Banned in Queensland, Australia":"In the Australian state of Queensland, Dream Warriors was banned by the then Bjelke-Petersen government due to its drug references, particularly the scene where Freddy's glove becomes a number of syringes as he injects Taryn with an amphetamine overdose.[2] In 1990, the newly elected Goss government abolished the Queensland Film Board of Review. Consequently, Dream Warriors became available to Queenslanders through normal market channels rather than just through sympathetic video rental stores. The Australian public at the time thought the ban was absurd, as the film was not very graphic.","language":"English","Reception":"The film was released theatrically in the United States by New Line Cinema in February 1987. It opened in 1,343 theaters, grossing $8.9 million and debuting at No. 1 during its opening weekend. It eventually made $44,793,222 at the domestic box office,[3] making it both the highest grossing film for the studio that year and the 24th highest grossing film of 1987.[4] It is the third highest grossing of the original Nightmare films after Freddy vs. Jason and A Nightmare on Elm Street 4: The Dream Master.[5]The film's distribution rights were transferred to Warner Bros. in 2008.Dream Warriors has an approval rating of 74% on Rotten Tomatoes based on 34 professional reviews; the average rating is 6/10.[6] Variety wrote that the Russell's poor direction makes the film's intended and unintended humor difficult to differentiate.[7] Roger Ebert of the Chicago Sun-Times rated it 1.5/4 stars and called it a slick horror film that never generates enough sympathy for its characters.[8] Janet Maslin of The New York Times wrote, \"The film's dream sequences are ingenious, and they feature some remarkable nightmare images and special effects.\"[9] Although criticizing Langenkamp's acting, Kim Newman wrote in Empire that \"the film delivers amazing scenes in spades, bringing to life the sort of bizarre images which used to be found only on comic book covers\".[10]","a_nightmare_on_elm_street_3:_dream_warriors":"Theatrical release poster","box_office":"$44.7 million (US)","cinematography":"Roy H. Wagner","production_company":"Heron Communications Smart Egg Pictures","directed_by":"Chuck Russell","release_dates":"February 27, 1987 (1987-02-27)|||||","Production":"Elm Street creator Wes Craven, who did not participate in the first sequel and did not want the first film to evolve into a franchise, had intended for this film to end the series, but its success prompted a continuation.Craven's very first concept for this film was to have Freddy Krueger invade the \"real\" world, emerging to haunt the actors filming a new Elm Street sequel. New Line Cinema rejected this metacinematic idea at the time, but years later, Craven's concept was finally brought to the screen with Wes Craven's New Nightmare.The \"dream suppressant\" drug Hypnocil which Neil researches is also featured and written into this film, yet more prominently figures in Freddy vs. Jason and is mentioned in Freddy vs. Jason vs. Ash. The psychiatric hospital Westin Hills reappears in both A Nightmare on Elm Street 5: The Dream Child and Freddy vs. Jason.In interviews with cast and crew in the DVD extras, it is revealed that the original idea for the film centered around the phenomenon of children traveling to a specific location to commit suicide, with dreams of Freddy Krueger eventually discovered to be a common link between the youths. Suicide, at the time, was a taboo social issue and this led to the abandonment of that storyline, though some aspects remained within the filmed version which still depicts suicide and self-mutilation, though they were deemed less controversial because these acts are committed with Freddy's distinct influence, inserting enough fantasy into the acts to remove it from the supposed controversial exploitation of disturbed youths in America.In the original script by Wes Craven and Bruce Wagner the characters were somewhat different from what was eventually filmed. Nancy was not a dream expert nor any kind of mental health professional, Kristen stayed in the institution for only a while and had a father, Neil's last name was Guinness and he was much younger, Dr. Simm's last name was Maddalena, Taryn was African-American, Joey was the one who built the model of a house and had trouble getting around (although he did not use a wheelchair), and Philip was a thirteen-year-old. Will's name was originally Laredo, he had long hair, did not use a wheelchair, and was the one who made the clay puppets. This script also showed the ranch house where Krueger was born, and is the house that shows up in their dreams rather than the Elm Street house. Contrary to the film, Lt. Donald Thompson knows from the start that Krueger is real and still alive. He had been missing and Nancy was intent on finding him, she finds him and learns that he was obsessed with finding the Krueger house and burning it down. In the original script, there is a romance between Nancy and Neil and they eventually have sex. There are scenes and lines that are very reminiscent of the first film. There is no talk of Krueger's mother having been a nun or Freddy being \"the bastard son of a hundred maniacs\", and both Joey and Kincaid are killed. The deaths in this script were much more grotesque, with Krueger not as talkative and more vulgar. Freddy is killed by Nancy by using his own glove, not by holy water. In Jeffrey Cooper's novelization The Nightmares on Elm Street Parts 1, 2, 3: The Continuing Story (1987), the original Craven/Wagner version of the Nightmare 3 script is adapted, rather than the Russell/Darabont rewrite. Thus the book version of the story is fairly different from the finished film.The theme song, \"Dream Warriors\", was written and performed by the American heavy metal band Dokken. The success of the single led to the following sequels to include a heavy metal song in its soundtrack.In the original VHS release of the film, during the opening sequence, a hard rock instrumental version of the song \"Quiet Cool\" is playing. The original version of that song, performed by Joe Lamont, was written for the movie with the same name in 1986. When Dream Warriors was released on DVD, the song that was on the original theatrical release, \"Into the Fire\" by Dokken, was reinserted.","produced_by":"Robert Shaye","starring":"Heather Langenkamp|Patricia Arquette|Larry Fishburne|Priscilla Pointer|Craig Wasson|Robert Englund|","running_time":"96 minutes","music_by":"Angelo Badalamenti|Dokken|","edited_by":"Terry Stokes|Chuck Weiss|","budget":"$4.5 million"}