{"based_on":"Characters  by Bob Kane Bill Finger","Cast":"All primary cast members are deceased.","country":"United States","distributed_by":"Columbia Pictures","batman_and_robin":"DVD cover art with title stylized: BATMAN and ROBIN","Chapter titles":"Turner Classic Movies began airing episodes of Batman & Robin in June 2015, following one week after the conclusion of airing the previous 1943 serial. Broadcast paused in August in favor of alternate programming, but resumed in September.Source:[5]","Plot":"The Dynamic Duo face off against the Wizard, a hooded villain with an electrical device which controls cars and a desire to set challenges for the Dynamic Duo, whose identity remains a mystery throughout until the end.","language":"English","cinematography":"Ira H. Morgan","directed_by":"Spencer Gordon Bennet","release_dates":"May 26, 1949 (1949-05-26) (United States)|||||","Production":"\"As usual on a Katzman production,\" note Harmon and Glut, \"the low budget showed everywhere in money-saving shortcuts, and inadequacies.\" The Batman costume had a poorly fitting cowl and the Robin costume added pink tights to cover the \"hairy legs\" of both the actor and the stuntman. The Batmobile is again excluded, but instead of a limousine as in the first serial, the duo drive around in a 1949 Mercury.[3]Several mistakes and failures of logic occur in the serial. One example is that the film shows the Bat-Signal working in broad daylight. Another occurs when, despite the fact that the heroes' utility belts had been replaced by normal belts with no pockets or pouches for this serial, in order to escape from a vault, Batman pulls the nozzle and hose of an oxy-acetylene torch from his belt to cut through a steel door (the tanks for the torch are not shown); to compound this mistake, it is a full-sized oxy-acetylene torch that would have been impossible to carry unseen on his person. Harmon and Glut suggest that this was probably scripted to be a miniaturised 3-inch torch, as used in the comics, but the film-makers improvised in following the directions for a \"blowtorch.\"[3]","produced_by":"Sam Katzman","starring":"Robert Lowery|Johnny Duncan|Jane Adams|Lyle Talbot|Ralph Graves|Don C. Harvey|William Fawcett|Leonard Penn|","running_time":"15 chapters (264 minutes)","music_by":"Mischa Bakaleinikoff","edited_by":"Dwight Caldwell Earl Turner","written_by":"George H. Plympton|Joseph F. Poland|Royal K. Cole|"}