{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Convicted thief Albert Ganz is working as part of a road gang in California, when a big Native American man named Billy Bear drives up in a pickup truck and asks for water to cool off his truck’s overheating radiator. Ganz and Billy exchange insults and proceed to stage a fight with each other, wrestling in a river, and when the guards try to break up the fight, Billy slips a gun to Ganz, and Billy and Ganz kill two of the three guards and flee the scene. Two days later, Ganz and Billy kill Henry Wong (John Hauk), who was one of their partners.Later that same day, Inspector Jack Cates of the San Francisco Police Department's criminal investigation bureau joins two of his friends and co-workers Detective Algren and Detective Van Zant at the Walden Hotel to check out a man named G.P. Polson, who is in room 27. Jack waits downstairs while Algren and Van Zant head to room 27, where it turns out that G.P. Polson is Ganz. Ganz immediately kills Van Zant, and shoots Algren. Jack hears the shots and rushes upstairs, where Algren tells him to go downstairs and find Ganz and Billy. Jack confronts Ganz and Billy downstairs. When Algren makes it downstairs, Ganz takes Jack's revolver and uses it to kill Algren, and Ganz and Billy escape with Jack's revolver.The police station issues Jack a new pistol and fellow cop Ben Kehoe tells Jack about Ganz's former partner Reggie Hammond, who is in prison with 6 months to go on a three-year sentence for armed robbery. Jack tells his boss, Haden, that he wants to work alone in the search for Ganz, and then Jack visits Reggie at the prison. Jack gets Reggie a 48-hour leave from the prison so Reggie can help Jack find Ganz and Billy. Reggie leads Jack to an apartment where Ganz's last remaining partner, Luther, lives. Jack and Reggie do not know that a few days prior, Ganz and Billy kidnapped Luther's girlfriend Rosalie. When Jack steps inside Luther's apartment and starts looking around, Luther runs upstairs to the apartment and fires a shot at Jack. Jack chases Luther to Jack's car, where Reggie is handcuffed to the steering wheel. After getting nothing out of Luther, Jack puts Luther in jail. That night, Reggie leads Jack to Torchy's, a redneck hangout where Billy used to be a bartender.Reggie, on a challenge from Jack, shakes the bar down, single-handedly bringing the crowd under his control. They get a lead on Billy's old girlfriend, but this also leads nowhere, as the girlfriend says she threw Billy out. Jack, frustrated to the boiling point, lets loose on Reggie and they get into a relentless fistfight. Reggie finally tells Jack about the $500,000, stashed in the trunk of his car, the spoils of a drug deal gone bad when Ganz apparently sold Reggie out. The car has been parked in a garage for the past three years. It was also the prime reason why Ganz and Billy took Luther's girlfriend: they wanted Luther to get Reggie's money in exchange for her return to him.Luther goes and gets the car, and Jack and Reggie tail him to a Muni station where Ganz comes to get the money. Luther, however, recognizes Jack, and Ganz and Billy escape, while Reggie chases after Luther. Left with nothing, Jack ends up sitting at the station waiting for Reggie to call. Kehoe, about to leave, reminds Jack about a message from \"your pal from the vice squad.\"Jack goes to Vroman's, in the Fillmore district, to find Reggie, who has tracked Luther to a hotel across the street. Jack, humbled, apologizes for continuously berating and insulting Reggie. He lends Reggie some money to pay for a hotel room to fool around with a girl he's met, but as he leaves the club with her, he sees Luther leave the hotel. Luther gets onto a stolen bus driven by Billy and hands over the money to Ganz. Ganz shoots Luther (and presumably Rosalie offscreen). Ganz spots Jack and Reggie following them, and a car chase/gunfight ensues, which ends when Billy forces Jack's Cadillac through the window of a Cadillac showroom. At this point following a heated verbal thrashing from Jack's boss Haden, Jack and Reggie are ready to resign themselves to the fact that they failed to catch Ganz.At a local bar before Reggie goes back to prison, Jack wonders if Billy might go back to see his girl and use her place as a hideout. Jack and Reggie force their way inside and after a brief confrontation Reggie shoots Billy. Ganz escapes into a maze of alleyways, capturing Reggie. Jack approaches and shoots Ganz.Finally, Jack takes Reggie to go fool around with the girl he had been chasing. They agree to meet again when Reggie gets out of San Quentin in six months. Jack leaves the money in Reggie's car, but asks for a loan on another Cadillac when he gets out. Reggie insists to Jack that he will be an honest man going forward. Jack doesn't buy it and takes Reggie back to prison. Reggie steals Jack's lighter.","language":"English","Reception":"48 Hrs. was the seventh highest-grossing film of 1982.[6] It grossed $4,369,868 in its opening weekend[7] and $78,868,508 overall at the domestic box office.[8]48 Hrs. received critical acclaim, and is considered by many as one of the best films of 1982.[9][10][11][12] On Rotten Tomatoes, the film has a 92% \"fresh\" rating, based on 38 reviews, with an average rating of 7.3/10. The site's critical consensus reads, \"Marking an auspicious feature film debut for Eddie Murphy, 48 Hrs. is a briskly paced action comedy that succeeds largely due to the outstanding chemistry between its two leads\".[13] On Metacritic, the film has a score of 71 out of 100, based on 8 critics, indicating \"generally favorable reviews\".[14] In 2007, the staff at IGN named the movie the third greatest buddy cop film.[15]48 Hrs. was nominated and won several critical awards.[16] Walter Hill won the Grand Prix award at the Cognac Festival du Film Policier. Eddie Murphy was nominated for a Golden Globe Award for Best Acting Debut - Male. The film's screenplay was nominated by the Edgar Allan Poe Awards for Best Motion Picture. James Horner also won an award for his score at the Los Angeles Film Critics Association Awards.The film was on the ballot for several of the American Film Institute's 100 series lists, including the AFI's 100 Years... 100 Laughs,[17] a list of America's funniest films, AFI's 100 Years... 100 Thrills,[18] a list of America's most heart-pounding films, and Eddie Murphy's line \"I'm your worst fucking nightmare, man! A nigger with a badge\" was a candidate for AFI's 100 Years... 100 Movie Quotes.[19]","box_office":"$78.9 million[2] 1.2 million admissions (France)[3]","cinematography":"Ric Waite","directed_by":"Walter Hill","Soundtrack":"In January 2011, Intrada Records released the world premiere recording of James Horner's score and songs from the movie in a limited edition run of 5000 units.[20] This was the first official release of the score; previous pressings from Europe were unofficial bootlegs with music from other James Horner film scores.[21]","release_dates":"December 8, 1982 (1982-12-08)|||||","Production":"Lawrence Gordon came up with the original idea for the film.[4] The premise had the Governor of Louisiana's daughter kidnapped by a criminal, who strapped dynamite to her head and threatened to blow her up in 48 hours if the ransom was not met. The meanest cop goes to the worst prison in the state and gets out the most vicious criminal for his knowledge of the kidnapper who was his cellmate. Roger Spottiswoode was hired and he wrote the early drafts as did Bill Kerby. The project started at Columbia Pictures and moved to Paramount Pictures. At one point, even Walter Hill wrote a draft.[4]Clint Eastwood was originally approached to play Detective Sergeant Jack Cates and Richard Pryor was set for the role of Reggie Hammond.[4] Eastwood wanted to play a criminal role and ended up playing one in Escape from Alcatraz instead. As a result, 48 Hrs. went into limbo for two years. Then, Gordon called Hill and asked him if he would make the film with Nick Nolte as Cates.[4] The character of Reggie Hammond was originally named Willie Biggs, but Eddie Murphy felt that was too stereotypical of a black man's name and changed it to Reggie Hammond.Murphy started a few weeks after principal photography began because he was finishing up a season of Saturday Night Live.[4] The shoot went well but Hill ran into problems with studio executives. Michael Eisner, then head of Paramount, was worried that the film was not funny enough. Hill and his co-screenwriter, Larry Gross wrote more material tailored to Nolte's and Murphy's personalities. By Hill's account, they rewrote Murphy's character right to the very last day of shooting. Executives also found the footage of the gunfight in the hotel to be too violent and were worried that it would kill the film's humor. They told Hill that he would never work for Paramount again as a result.[4]In 2008, co-writer Larry Gross's contemporaneous diary of his days on set is published on the MovieCityNews website[5].","produced_by":"Lawrence Gordon Joel Silver D. Constantine Conte (executive producer)","starring":"Nick Nolte|Eddie Murphy|Annette O'Toole|","running_time":"96 minutes","music_by":"James Horner","edited_by":"Freeman A. Davies Mark Warner Billy Weber","48_hrs.":"Theatrical release poster","written_by":"Roger Spottiswoode Walter Hill Larry Gross Steven E. de Souza","budget":"$12 million[1]"}