{"country":"United States Canada New Zealand","distributed_by":"Warrior Poets Virgil Films Abramorama","a_brony_tale":"Official theatrical poster","language":"English","Reception":"The film has received positive reviews. It currently holds a 100% score with an average rating of 7/10 based on reviews from 8 critics on aggregator site Rotten Tomatoes.[13] Christopher Campbell of Movies.com praised Brent Hodge's directing, noting how Hodge \"situates the phenomenon inside an identifiable world rather than setting it aside like it's some kind of otherness.\" Campbell went on to say in his review, \"They're compared to the jazz crowd of the 1920s and to the Beatniks and, most assuredly, to the hippies . . . Hodge comes closer to making those of us who can't possibly get it at least start to comprehend what is really going on here and why. If we all joined them in not necessarily watching and playing with and dressing up as My Little Pony but at least in following its message and influence, then the planet would be a much better place.\"[14]John Lucas of Straight.com said, \"Brent Hodge's documentary about fans of My Little Pony: Friendship Is Magic suggests that there is no such thing as a typical \"brony\"; the subjects here include a sensitive Iraq War veteran and a burly motorcycle mechanic...A connecting thread is provided by Vancouver-based voice actor Ashleigh Ball... by the end Ball is touched by the realization that she's an integral part of something much larger than a kiddie show.\"[15]Marina Antunes of Row Three called the film \"the best documentary I've seen on the subject\", and went on to applaud the film, saying that the film \"has the advantage of a filmmaker who understands storytelling and Hodge does an excellent job not only of capturing the energy and passion of the fans but packaging that up in a documentary that is both entertaining and informative.\"[16]IGN gave the film a score of 9.1, praising the portrayal of the fandom, interviews, the scientific study of bronies, and subject of gender roles. However, criticism was voiced regarding the lack of staff from the show, and the story about a military brony having no conclusion.[17]","Synopsis":"Ashleigh Ball, one of the lead voice actresses in Hasbro's My Little Pony: Friendship Is Magic, begins to notice that she is receiving fan mail for her work on the show, but is perplexed over the fact that most of it is coming from teenagers and adults. These fans, who call themselves \"bronies\" and are mostly male, take the show's themes and messages of personal responsibility and friendship to heart. Ball accepts an invitation to attend the Winter 2012 BronyCon, a then-semiannual fan convention held in New York City, as a guest of honor and takes the opportunity to meet the fans.Footage of Ball's interviews and travels is intercut with segments focusing on different fans of the show, including: a burly motorcycle mechanic and former college football player, a United States Army veteran who suffers from post-traumatic stress disorder, the producer of an Internet radio network, and a husband-and-wife team of psychologists who became interested in the show after learning about it from their son. Andrea Libman and Nicole Oliver, two other members of the voice cast, make brief appearances. The film also includes footage and interviews from the Canterlot Gardens fan convention held during mid-2012 near Cleveland, as well as footage from live performances of Ball's band, Hey Ocean![3]","cinematography":"Brent Hodge","production_company":"Hodgee Films","directed_by":"Brent Hodge","Awards":"The film was screened as an \"Official Selection\" at the 2014 Tribeca Film Festival, the 2014 New Zealand Documentary Edge Festival, the 2014 Seattle International Film Festival, the 2014 DOXA Documentary Festival, the 2014 SouthSide Film Festival and the 2014 Las Vegas Film Festival.The film won \"Best Documentary\" at the Las Vegas Film Festival and has been nominated for 4 Leo Awards, at the 2015 Leo Awards, in \"Best Documentary Feature\", \"Best Direction in a Documentary Feature\", \"Best Sound in a Documentary Feature\" and \"Best Music in a Documentary Feature\". The film won the 2015 Leo Award for \"Best Sound in a Documentary Feature\".","release_dates":"April 26, 2014 (2014-04-26) (Tribeca)|July 8, 2014 (2014-07-08)||||","Production":"While focusing on Ball's trip to BronyCon, the film also briefly features fellow My Little Pony voice cast members Nicole Oliver and Andrea Libman.[4]Director Brent Hodge said that he funded the film himself, and felt it was easy to film as he personally knew Ashleigh Ball. He decided to film as a \"fly on the wall\" at the meetups so as to not interfere with the goings on and to see the brony world as it really is.[5] During a panel at BronyCon 2013, Hodge went into detail on the film, and showed a trailer to the audience, and revealed that the idea had come about when Ball was asked to do the convention.[6]In an interview with Everfree News, Hodge went into detail on the film, explaining that it was an outsider view on the brony community that had evolved from simply a documentary on Ball and her voice career.[7]","produced_by":"Brent Hodge Carolyn Wells Lauren Bercovitch Morgan Spurlock","starring":"Ashleigh Ball Bryan Mischke Andrea Libman Nicole Oliver Donald Rhoades Andy Stein Jordan Downs Kelvin Williams","running_time":"78 minutes","music_by":"Chris Kelly Cayne McKenzie","edited_by":"Nicholas T. Shepard","written_by":"Brent Hodge","budget":"$100,000[1]","Promotion and release":"The film was originally planned to be part of the local Vancouver DOXA Documentary Film Festival on May 11, 2014, where it was selected to close out the show.[8] To Hodge's surprise, the film was selected as one of five special documentary screenings for the 2014 Tribeca Film Festival[9] and was named one of the top 10 movies to see at Tribeca by Indiewire.[10] The film premiere screening at Tribeca was sold out within hours, and its screening there has brought more attention to the film, according to Hodge.[11]The film was picked up in April 2014 by an independent film distribution company, Morgan Spurlock Presents, a collaboration between Spurlock's Warrior Poets, Virgil Films, and Abramorama. A Brony Tale is the first film distributed under this label.Along with the Tribeca premiere and prior to the selected theatrical release, the film had film festival screenings in Vancouver, British Columbia, Seattle, Washington, Wellington, New Zealand, Auckland, New Zealand, and has screenings scheduled in Mexico City, Mexico, Monterrey, Mexico and Guadalajara, Mexico via the brony convention FluttyCon 2014 and The Brony Chef.The film was released on July 8, 2014 in at least twenty different theater markets within North America and was released for home media via Video-On-Demand and DVD/Blu-ray and cable.[12]"}