{"country":"United States","distributed_by":"Relativity Media","Plot":"Noni Jean is a hot new artist who has just won a Billboard Music Award without releasing an album and is primed for super-stardom, but the pressures of success compel her to nearly end her life. She is saved by a young police officer, Kaz Nicol, who has political ambitions. Drawn to each other, Noni and Kaz fall fast and hard, despite the protests of those around them who urge them to put their career ambitions ahead of their romance. But it is ultimately Kaz's love that gives Noni the courage to find her own voice and break free to become the artist she was meant to be.","language":"English","Reception":"Beyond the Lights received positive reviews from critics. Based on 75 reviews on Rotten Tomatoes, the film holds a \"Certified Fresh\" rating of 81%, with an average rating of 6.8/10. The site's consensus reads \"Thanks to smart direction and a powerhouse performance from Gugu Mbatha-Raw, Beyond the Lights transcends its formulaic storyline to deliver thoroughly entertaining drama.\"[8] On Metacritic, the film has a score of 73 out of 100, based on 25 critics, indicating \"generally favorable reviews\" from critics.[9]The film received positive notices with The Hollywood Reporter praising Mbatha-Raw's performance as \"incandescent\" and Prince-Bythewood's script for its \"surprising integrity.\"[10] Hitfix used the film to argue that writer/director \"Gina Prince-Bythewood isn't working enough\"[11] while Variety called it \"messy but undeniably entertaining.\"[12]","box_office":"$14.6 million[2]","cinematography":"Tami Reiker","production_company":"Homegrown Pictures Undisputed Cinema","directed_by":"Gina Prince-Bythewood","Soundtrack":"Relativity Music Group released a soundtrack album for the film on November 10, 2014, which features the original song \"Grateful\", written by Diane Warren and performed by Rita Ora.[7] Three songs featured in the film but absent from the soundtrack are Beyoncé's \"Drunk in Love,\" India.Arie's \"I Am Light\" and Amel Larrieux's \"Don't Let Me Down\" as they already appear on each artist's respective albums.","release_dates":"September 6, 2014 (2014-09-06) (TIFF)|November 14, 2014 (2014-11-14)||||","Production":"On August 15, 2013, Relativity Media bought the worldwide rights to the film; Relativity Media financed and distributed the film. Ryan Kavanaugh produced along with Stephanie Allain.[4] On December 6, 2013, Relativity set the film for a November 14, 2014 release date.[3]Three stars—Gugu Mbatha-Raw, Nate Parker, and Danny Glover—were already in the ensemble cast on August 15; Raw played Noni Jean, a new singer. Parker played Kaz Nicol and Glover played Captain David Nicol.[4] On September 25, 2013, Minnie Driver and Machine Gun Kelly also joined the cast; Driver played Noni's mother Macy Jean while Machine Gun Kelly played Kid Culprit, a rapper.[5]Principal photography commenced on August 21, 2013 in Los Angeles.[6]","produced_by":"Stephanie Allain|Reggie Rock Bythewood|Ryan Kavanaugh|","starring":"Gugu Mbatha-Raw|Minnie Driver|Nate Parker|Danny Glover|Colson \"MGK\" Baker|","running_time":"116 minutes[1]","beyond_the_lights":"Theatrical release poster","music_by":"Mark Isham","edited_by":"Terilyn A. Shropshire","written_by":"Gina Prince-Bythewood","budget":"$7 million[2]"}