{"country":"United States","distributed_by":"Miramax Films","Plot":"In 1928, David Shayne (John Cusack) is an idealistic young playwright newly arrived on Broadway. In order to gain financing for his play, God of Our Fathers, he agrees to hire Olive Neal (Jennifer Tilly), the actress/girlfriend of a gangster. She is demanding and talentless, but her gangster escort Cheech (Chazz Palminteri) turns out to be a genius, who constantly comes up with excellent ideas for revising the play.As the players prepare for opening night, Shayne is soon in over his head claiming Cheech's rewrites as his own, cheating on his partner Ellen (Mary-Louise Parker) with the show's seductive, alcoholic leading lady Helen Sinclair (Dianne Wiest), and facing his leading man, a compulsive eater (Jim Broadbent), beginning an affair with Olive.","Stage musical":"Allen adapted the film as a stage musical, titled Bullets Over Broadway the Musical. The musical is directed and choreographed by Susan Stroman, produced by Julian Schlossberg and Allen's younger sister Letty Aronson, with a score from the American songbook using songs from the 1920s and 1930s.[2] The new musical premiered on Broadway at the St. James Theatre on April 10, 2014.[3] A staged reading was held in June 2013.[4] The cast features Zach Braff as David Shayne, Brooks Ashmanskas, Betsy Wolfe, Lenny Wolpe, and Vincent Pastore.[5] Marin Mazzie stars as Helen Sinclair,[6] and Karen Ziemba appears as \"Eden Brent.\"[7] Musical supervisor Glen Kelly has adapted and written additional lyrics for songs including \"Tain't Nobody's Bus'ness,\" \"Running Wild,\" \"Let's Misbehave\" and \"I Found A New Baby\".[3] The musical closed on August 24, 2014, after 156 performances and 33 previews.[8]","language":"English","Reception":"Bullets over Broadway received a positive response from critics. The review-aggregate website Rotten Tomatoes reports 96% positive reviews, with the consensus \"A gleefully entertaining backstage comedy, Bullets Over Broadway features some of Woody Allen's sharpest, most inspired late-period writing and direction.\"[9]Janet Maslin of The New York Times described the film as \"a bright, energetic, sometimes side-splitting comedy with vital matters on its mind, precisely the kind of sharp-edged farce [Allen] has always done best.\"[10] Todd McCarthy of Variety similarly called it \"a backstage comedy bolstered by healthy shots of prohibition gangster melodrama and romantic entanglements\" and wrote, \"In its mixing of showbiz and gangsters, this is a nice companion piece to Allen's Broadway Danny Rose, and about as amusing.\"[11] Roger Ebert of the Chicago Sun-Times praised, \"Bullets Over Broadway shares a kinship with a more serious film by Allen, Crimes and Misdemeanors, in which a man committed murder and was able, somehow, to almost justify it. Now here is the comic side of the same coin. The movie is very funny and, in the way it follows its logic wherever it leads, surprisingly tough.\"[12]","box_office":"$13,383,747","cinematography":"Carlo DiPalma","directed_by":"Woody Allen","bullets_over_broadway":"Theatrical release poster","release_dates":"October 14, 1994 (1994-10-14)|||||","Production":"The film's locales include the duplex co-op on the 22nd floor of 5 Tudor City Place in Manhattan.[1]The film's title may have been an homage to a lengthy sketch of the same title from the 1950s television show Caesar's Hour; one of Allen's first jobs in television was writing for Sid Caesar specials after the initial run of the show. The film featured the last screen appearance of Benay Venuta. Allen cast her in a cameo role as a well-wishing wealthy theatre patron. She died of lung cancer months after the film opened.","produced_by":"Robert Greenhut Letty Aronson J. E. Beaucaire Jean Doumanian Charles H. Joffe Jack Rollins","starring":"Jim Broadbent John Cusack Harvey Fierstein Chazz Palminteri Mary-Louise Parker Rob Reiner Jennifer Tilly Tracey Ullman Joe Viterelli Jack Warden Dianne Wiest","running_time":"98 minutes","edited_by":"Susan E. Morse","written_by":"Woody Allen Douglas McGrath","budget":"$20 million"}