{"country":"Australia","Commercial and critical reception":"Early responses to Bliss were mixed, as the Cannes walkouts attest. After this Lawrence reduced the film's running time from 135 mins to 110 mins.[1]Its initial Australian release was killed after the Office of Film and Literature Classification classified it as Restricted 18+ because of the incest scene between Harry’s children, and as a result, no Australian distributor would handle it. Buckley decided to distribute himself.The classification was eventually overturned on appeal and the film opened at the State Theatrette in Sydney, a tiny former newsreel theatrette with 130 seats. Positive reviews and word of mouth helped it to find an audience and become a cult hit. It won three AFI Awards for Best Picture, Best Direction and Best Adapted Screenplay for 1985 and played for six months.[8]Bliss has since acquired a significantly higher critical reputation. Former Sydney Morning Herald film critic and Sydney Film Festival director Paul Byrnes describes it as:Despite the film's eventual success, director Ray Lawrence did not direct a second film until Lantana (2001), and in the intervening period he chiefly earned his living as a director of television commercials, several of which won industry awards. His third film, Jindabyne, was released in 2006.","distributed_by":"Anthony Buckley Umbrella Entertainment","Plot":"Harry Joy, an advertising executive in an unnamed Australian city who is known for his ability to tell stories, has a terrifying near-death experience after suffering a massive heart attack, brought on by his dissolute lifestyle. Upon recovering, he believes himself to be either in a hellish version of the world he knew, or with his eyes opened to an altogether different view of that world. He eventually discovers that his wife is unfaithful, his dissolute daughter trades sex for hard drugs with his deviant son, and his latest client is a carcinogenic polluter.Harry tries to reform and steer a morally correct path, abandoning most of the trappings of his previous affluent life, to the dismay and disruption of everyone around him. He is also seemingly 'tested' by a series of bizarre and frightening events including being 'sectioned' to a psychiatric hospital. In one memorable sequence, Harry is dragged through a bizarre and blackly humorous chain of events, in which he smokes marijuana for the first time with a terminally ill waiter friend, then has his car crushed by an elephant and is finally arrested. The extended version of this sequence was cut from the original theatrical release after its premiere at Cannes, but the full length scene featuring a tour-de-force monologue by Barry Otto (captured in a single unedited take) was restored for the film's re-issue in the 1990s.Fighting for his sanity, Harry flees his home and takes up residence in a hotel, where meets a young hippie country girl, Honey Barbara, who prostitutes herself and helps a friend sell marijuana on trips to the city to bring money back to their forest commune. Harry decides that Barbara is his true love but he is soon drawn back into his old ways, and she with him. She eventually rejects Harry's lapse back to materialism and flees to the commune, refusing to see him. Harry pursues her patiently over many years, living alone near her commune, and eventually winning her heart with a 'gift' of plantings of the type of tree that provides Barbara's favourite honey (the Yellow Box Eucalyptus, Eucalyptus melliodora).","bliss":"DVD cover","language":"English","box_office":"A$1,144,863 (Australia)[2] $660,537 (USA only)","cinematography":"Paul Murphy","directed_by":"Ray Lawrence","Home Media":"The theatrical release and director's cut of Bliss was released on DVD by Umbrella Entertainment in May 2010. The DVD's are compatible with all region codes and include special features such as the unauthorised American trailer and audio commentary with Ray Lawrence and Anthony Buckley.[10][11]","Awards":"The film won the Best Film, Best Director and Best Adapted Screenplay Awards and was nominated for 10 more awards of the Australian Film Institute in 1985. It was also nominated for the Palme d'Or (Golden Palm) at the Cannes Film Festival in the same year.[12]","Selected cast":"In cameos are Australian historian Manning Clark as a preacher[5] and, comedian John Doyle as Bettina's doctor.[6]","release_dates":"1985","Production":"Ray Lawrence and Peter Carey were both working in advertising when they met at a party and became friends. They wrote two screenplays together, Dancing on Water (based on Carey's short story Life and Death in the South Side Pavilion) and Spanish Pink.[7]They approached Phillip Adams to see if he wanted to produce and he passed, then tried Anthony Buckley. Buckley was enthusiastic and tried to find money to produce both scripts but was unsuccessful. In the meantime, Carey's novel Bliss had been published and won the Miles Franklin Award, so Buckley suggested they adapt that instead. He optioned the rights in January 1983 and raised the money through 10BA.[1]In October 1983 Lawrence shot a 35mm screen test with Barry Otto and Lynette Curran to help convince investors about the movie. Shooting took place in October 1984 following two weeks rehearsal and went for eleven weeks. Although the film was set in Queensland it was shot in New South Wales.[1]","produced_by":"Anthony Buckley","starring":"Barry Otto, Gia Carides","running_time":"112 minutes 130 minutes (Director's cut)","music_by":"Peter Best","edited_by":"Wayne LeClos","written_by":"Peter Carey Ray Lawrence","budget":"A$3.4 million[1]"}