{"country":"United Kingdom","distributed_by":"BBC EM Media Emmi Film Council Portman Film Starfield Productions Icon Film Distribution(VHS/DVD distribution)","Plot":"Meena Kumar, a 12-year-old Sikh girl, lives with her family in the predominantly white, working-class, fictional mining village of Tollington in the Black Country in 1972. Meena meets Anita, a white, 14-year-old girl whom Meena comes to idolise. However, Meena finds it harder and harder to fit in as her Indian heritage keeps on resurfacing, and Anita's new boyfriend proves to hold strong racist attitudes toward those he regards as \"darkies\".","language":"English","anita_and_me":"Theatrical Release Poster","cinematography":"Cinders Forshaw","directed_by":"Metin Hüseyin","release_dates":"22 November 2002","Production":"The film is semi-autobiographical, based on Syal's upbringing in Essington, Staffordshire. Despite being set in the West Midlands, sizeable parts of the film were shot in the East Midlands, notably the Derbyshire town of Draycott.","produced_by":"Paul Raphael","starring":"Chandeep Uppal Kabir Bedi Anna Brewster","running_time":"92 minutes","music_by":"Barry Blue Lynsey De Paul","edited_by":"Annie Kocur","Release":"Anita and Me opened to theatres on 22 November 2002 and earned £1,753,880 to 226 theatres in the UK by 29 December. At the end of its opening weekend on 24 November, the film earned £453,613 and by 29 December, it had only earned £42,446.[3] Rotten Tomatoes reports the film as holding an overall 67% approval rating based on 6 reviews, with a rating average of 6/10.[4] The film holds a rating of 6.3/10 at the Internet Movie Database.[5]Anita and Me has received mixed critical reviews. Peter Bradshaw from The Guardian commented that \"There are zany vignets and comedy Indian relations galore, but the whole thing is very cardboard and stereotypical.\"[6] Louise Keller from Urban CineFile Australia describes the film as \"a sweet chapter in the life of a young girl battling to identify with her roots and environment\". David Edwards calls Anita and Me \"a well-meaning but uneven film\".[7] Vince Leo from Quipster has described the film as \"a perfect example of a coming-of-age film\".[8] Rich Cline of Shadow on the Wall describes the film as being \"enjoyable and funny, but there's not that much to it\".[9]The film has been released in VHS and DVD format. The DVD was released in the UK on 26 May 2003 by Icon Home Entertainment.[10] It was also released on DVD on 8 August 2006 by Image Entertainment.[11]","written_by":"Meera Syal"}