{"country":"United States|France|Germany|Italy|","distributed_by":"Metro-Goldwyn-Mayer (United States)|StudioCanal (International)|","screenplay_by":"Robert King|Marc Norman|","story_by":"Michael Frost Beckner|James Gorman|Bruce A. Evans|Raynold Gideon|","Plot":"In 1668 Jamaica, Morgan Adams (Geena Davis) hunts down her uncle and fellow pirate Dawg Brown (Frank Langella), who has captured her father, Black Harry (Harris Yulin). Black Harry has one of three pieces of a map to a huge stash of gold on the remote Cutthroat Island. Dawg has another piece, having stolen it from the corpse of a third brother, Richard, while a fourth brother, Mordechai (George Murcell), has the last piece. Harry refuses to give Dawg his piece and escapes with Morgan's help, but not before being mortally wounded. A dying Harry reveals to his daughter the location of the map piece: on his scalp.After scalping her dead father for the piece, Morgan, now the captain of her father's ship, the Morning Star, sets out for the treasure. Unfortunately, the instructions appear to be in Latin, which no one on board reads. So, they go to nearby Port Royal to find a translator. There, they learn that one of the slaves up for auction, a con man and thief named William Shaw (Matthew Modine), is fluent in Latin. After threatening a man determined to outbid her, Morgan wins the auction. Unfortunately, she is recognized from her wanted poster and is chased out of town (which is demolished), along with her crew and Shaw. Humiliated, corrupt Governor Ainslee (Patrick Malahide) vows to find her, either to arrest her or form a partnership for half her profits. He enlists the help of chronicler John Reed (Maury Chaykin), who often follows pirates to write his books.The crew then goes to Mordechai in Spittlefield Harbor. Before they can learn where the second piece is, Dawg appears. A fight ensues, during which Mordechai is killed and Morgan is shot, while Shaw secretly finds the piece and keeps it to himself. After they escape on the Morning Star, Morgan collapses from her wound, but is saved by Shaw, who is a self-proclaimed doctor. The two start a romance. Morgan figures out that the words on the map, when read backwards, spell out half the coordinates to the island.Dawg's ship, the Reaper, bears down on them. Morgan directs hers toward a coral reef... and a gale. Shaw manages to piece together the location of Cutthroat Island with his and Morgan's piece, but is caught and thrown in the brig. During the storm, Reed sends a carrier pigeon revealing their location to Ainslee. Meanwhile, the majority of the crew led by the treacherous Scully (Jimmie F. Skaggs) mutinies against Morgan and maroon her and those loyal to her in a boat. Fortuitously, though the boat is wrecked the tide takes them straight to Cutthroat Island, which is uncharted land northeast of Cuba.As Morgan goes after the treasure, Shaw, who escaped during the storm, steals the last piece from Dawg, who's on the island. Shaw falls into quicksand and Morgan, realizing he has the piece, frees him. Together, they find the gold, only for it to be stolen by Dawg, forcing them to jump off a cliff into the tide.After regaining consciousness, Shaw finds Reed, who leads him into a trap set by Dawg, Ainslee, and the mutineers, who have joined forces and intend to split the gold between them. As Shaw is captured and they make their way out to sea with the gold, Morgan sneaks aboard the Morning Star and retakes it from Scully and the mutineers.The crew then tries to sneak attack the Reaper, but Dawg counterattacks. A sea fight ensues, during which Shaw escapes and Ainslee, his men and Reed are killed by cannon fire. Morgan boards the Reaper and blows out the ship's bottom to get to the gold. She then duels Dawg while Shaw gets trapped below in rapidly rising water with the treasure. Morgan kills Dawg with a cannon and saves Shaw, forced to abandon the treasure to escape the sinking ship. Luckily, Morgan attached a marker barrel to the treasure beforehand, allowing them to retrieve it and the newly rich crew sets sail for their next adventure in Madagascar.","language":"English","cutthroat_island":"Theatrical release poster by Drew Struzan","box_office":"$10 million[3]","cinematography":"Peter Levy","directed_by":"Renny Harlin","Video game":"A side-scrolling beat-em up was made by Acclaim, and released for the major platforms of the time (such as the Super NES, Sega Genesis, and Game Boy) to tie-in with the film. It loosely follows the events of the film.","production_companies":"Carolco Pictures[1] The Forge Laurence Mark Productions Beckner/Gorman Productions","release_dates":"December 22, 1995 (1995-12-22) (US)|February 14, 1996 (1996-02-14) (France)|April 25, 1996 (1996-04-25) (Germany)|||","Production":"At the time the film was produced, Geena Davis and director Renny Harlin were married. Harlin convinced producer Mario Kassar to cast Davis, who was known for light comedies, in hopes that it would turn her into an action-adventure star.Michael Douglas originally agreed to play Shaw under two conditions: filming had to start immediately because he was available only for a limited time, and his character had to have the same amount of screen time as Davis. Douglas eventually pulled out, claiming that Davis's role was expanded at his character's expense. Davis wanted to quit when Douglas did, but she was contractually obligated to finish the film. After Douglas quit, Harlin was so preoccupied with trying to find a male lead that set construction and script work were done without his input. Harlin didn't like what he saw when shooting was set to begin, leading to massive expensive rebuilding and rewriting. Tom Cruise, Keanu Reeves, Liam Neeson, Jeff Bridges, Ralph Fiennes, Charlie Sheen, Michael Keaton, Tim Robbins, Daniel Day-Lewis, and Gabriel Byrne all turned down the role of Shaw, before Modine agreed to do the role, partly because he is an experienced fencer. Oliver Reed was originally cast for a cameo as Mordechai Fingers, but was fired after getting in a bar fight and threatening to expose himself to Davis. George Murcell eventually took his place. \"I'd heard these stories about Oliver Reed,\" said Modine, \"I think it is all bunk. Oliver was a gentleman. Sure, he had a reputation as a man who enjoyed a drink. But only off set. His reputation as an actor is stellar. Professional. I stand by that. God rest his soul.\".[6]Shooting was delayed for various reasons, allowing the budget to spiral out of control. When Harlin fired the chief camera operator following a dispute, more than two dozen crew members quit. In addition, broken pipes caused raw sewage to pour into the water tank where the actors were supposed to swim. Harlin spent $1 million of his own money to rewrite the script, as Carolco was in so much debt that they couldn't afford to pay further.The film was shot on location in Malta and Thailand. Indoor scenes were shot in Kalkara, Mediterranean Film Studios in Malta as well as in Pinewood Studios in England, UK. Harlin is famous for pushing actors to do their own stunts whenever possible. While promoting the film, Davis appeared on talk shows with clips of her doing stunts over and over (including one take where she fell out of the window too soon, rolled down the roof and under the carriage) and explained the bruises and injuries she sustained while filming.The film's orchestral score was composed by John Debney. It is one of the film's aspects that has been critically acclaimed, compared with the classic works of Erich Wolfgang Korngold.[7][8][9] [10]","produced_by":"Renny Harlin|Laurence Mark|Joel B. Michaels|James Gorman|","starring":"Geena Davis|Matthew Modine|Frank Langella|Maury Chaykin|Patrick Malahide|Stan Shaw|Harris Yulin|","running_time":"124 minutes[2]","music_by":"John Debney","edited_by":"Derek Brechin|Florent Retz|Frank J. Urioste|Ralph E. Winters|","Release":"Cutthroat Island had a total production budget of $98 million (though some put the figure as high as $115 million)[11] and the total U.S. gross was $10,017,322.[3] In 2014, the LA Times listed the film as one of the most expensive box office flops of all time.[12] It may have been a contributing factor to the demise of the film's production company, Carolco Pictures, and of Davis as a bankable star. It debuted at No. 13 at the US box office.[13] According to The Guinness Book of World Records, this film is the biggest financial loss to this date (Total cost: $115 million. Total box office earnings: $10 million. Total loss: $105 million), and the film still holds the record when adjusted for inflation ($138 million).The film received mixed to negative reviews from critics. On review aggregator website Rotten Tomatoes, the film has a 38% rating based on 39 reviews, with an average rating of 4.5/10.[14] Critics were unimpressed with the lack of chemistry between the protagonist duo, the one-dimensional villain, the unrealistic stunts (particularly a scene where Adams and Shaw jump through a scaffolding several feet high and come out unharmed) and the incoherent script.In particular, Todd McCarthy from Variety said \"What seemed like a dubious proposition on paper plays even more dubiously onscreen, as Cutthroat Island strenuously but vainly attempts to revive the thrills of old-fashioned pirate pictures. Giving most of the swashbuckling opportunities to star Geena Davis, pic does little with its reversal of gender expectations and features a seriously mismatched romantic duo in Davis and Matthew Modine.\"[15] whereas Time Out London commented that \"we get Geena Davis doing the all-action honours, and a hotchpotch script that seems to think pirate movies are so funny in themselves the need for more humour is superfluous. The plot's well worn\".[16] Additionally, the New York Times said that \"It's not possible to believe that Ms. Davis is the highly respected captain of a pirate ship, and it's not even fun to try.\".[17]Not all the reviews were negative though. Roger Ebert gave the film a three-out-of-four-star rating, commenting that \"This is, in short, a satisfactory movie - but it doesn't transcend its genre, and it's not surprising or astonishing. I saw it because that was my job and, having seen it, I grant its skill, and award it three stars on that basis. But unless you're really into pirate movies, it's not a necessary film\".[18] Susan Wloszczyna from USA Today stated that \"If the sight of half-naked, tattooed sailors firing cannons at each other shivers your timbers, climb aboard. Even passable pirate movies don't sail by every day\" awarding the film a 2.5 star rating out of 4.[14]Harlin was nominated for a Golden Raspberry Award for Worst Director for his work on the film, but lost to Paul Verhoeven for Showgirls (another film produced by Carolco).In a radio interview in 2011, Harlin discussed the film's box office failure. He pointed out that Carolco was already in ruin before shooting even began, but had to make the film since financing from foreign investors was already in place. MGM, the film's distributor, was in the process of being sold and thus could not devote itself into financing a marketing campaign for the film.[19] Carolco filed for Chapter 11 bankruptcy a month before Cutthroat Island's release.[20]The abject disaster of Cutthroat Island is also credited with significantly reducing the bankability and Hollywood production of pirate-themed films, which recovered only with the production of Disney's Pirates of the Caribbean: The Curse of the Black Pearl in 2003.[21]","budget":"$98 million[3]"}