{"distributed_by":"Allied Artists","Plot":"Chicago, 1919: A young Al Capone arrives to work for mob boss Johnny Torrio. He meets Torrio's top man, \"Big Jim\" Colosimo, who runs business and politics in the First Ward while secretly on Torrio's payroll.Prohibition is enacted a year later, causing Torrio and other gangsters like Dean O'Banion, George \"Bugs\" Moran and Earl \"Hymie\" Weiss to compete for profits in bootleg liquor and beer. Torrio's rivals conspire to have Colosimo and his henchmen killed.A reform mayor is elected, so Torrio and Capone change their base of operations to Cicero, a few miles away. Capone also has O'Banion killed and makes a play for Maureen Flannery, the widow of one of Colosimo's men.Weiss and Moran return the favor by ordering Torrio to be shot. Capone retaliates by killing Weiss and forcing merchants throughout the city to pay for \"protection.\" A sergeant in the Chicago police, Schaefer, is promoted to captain and vows to end the bloodshed and extortion and put Capone behind bars.With the heat on from the cops, a crooked newspaperman named Keely tries to bribe Schaefer but fails. He persuades Capone to move to Florida until things cool down. From a safe distance, Capone masterminds the St. Valentine's Day Massacre, with several of Moran's men gunned down in a Chicago garage.Capone and Moran call a truce, but when he learns Keely has been helping a Moran plot to kill him, Capone ends the reporter's life instead. Maureen finally has her fill of Capone's corruption and violence, while Schaefer and the feds find a way to finally put Capone away—on charges of tax evasion, earning him 11 years at Alcatraz.","Reception":"Bosley Crowther in The New York Times commented that with so many old movies about Capone, it was uncertain whether a new one was needed, but that this film had the \"modest justification\" that \"it has a strong documentary flavor and Rod Steiger is an odious skunk in the title role.\"[4] Variety called it \"a tough, ruthless and generally unsentimental account\" and \"also a very well-made picture.\"[5] The film won a Laurel Award as 1959's \"Sleeper of the Year\".[6]","box_office":"$2.5 million (rentals)[1]","cinematography":"Lucien Ballard","al_capone":"Film poster by Reynold Brown","directed_by":"Richard Wilson","narrated_by":"James Gregory","release_dates":"March 25, 1959 (1959-03-25) (USA)|||||","produced_by":"Leonard Ackerman John Burrows","starring":"Rod Steiger","running_time":"104 minutes","music_by":"David Raksin","edited_by":"Walter Hannemann","written_by":"Malvin Wald Henry F. Greenberg"}