{"country":"United Kingdom","distributed_by":"Anglo-EMI Film Distributors MGM-EMI (UK) American International (USA)","Plot":"Dr. Henry Jekyll dedicates his life to the curing of all known illnesses, however his lecherous friend, Professor Robertson, remarks that Jekyll's experiments take so long to actually be discovered, he will no doubt be dead by the time he is able to achieve anything. Haunted by this remark, Jekyll abandons his studies and obsessively begins searching for an elixir of life, using female hormones taken from fresh cadavers supplied by murderers Burke and Hare, reasoning that these hormones will help him to extend his life since women traditionally live longer than men and have stronger systems. In the apartment above Jekyll's lives a family: an elderly mother, her daughter Susan Spencer, and Susan's brother Howard. Susan is attracted to Jekyll, and he too returns her affections, but is too obsessed with his work to make advances. Once mixing the female hormones into a serum and drinking it, it not only has the effect of changing Jekyll's character (for the worse) but also of changing his gender, transforming him into a beautiful but evil woman. Susan becomes jealous when she discovers this mysterious woman, but when she confronts Jekyll, to explain the sudden appearance of his female alter ego, he calls her Mrs. Hyde, saying she is his widowed sister who has come to live with him. Howard, on the other hand, develops a lust for Mrs. Hyde.Dr. Jekyll soon finds that his serum requires a regular supply of female hormones to maintain its effect, necessitating the killing of young girls. Burke and Hare supply his needs but their criminal activities are uncovered. Burke is lynched by a mob and Hare blinded. The doctor decides to take the matters into his own hands and commits the murders attributed to Jack the Ripper. Dr. Jekyll abhors this, but Mrs. Hyde relishes the killings as she begins to take control, even seducing and then killing Professor Robertson when he attempts to question her about the murders.As Mrs. Hyde grows more powerful the two personalities begin to struggle for dominance. Dr. Jekyll asks Susan to the opera, however when he is getting dressed to go out, he unconsciously takes Mrs. Hyde's gown from the wardrobe instead of his own clothes, realizing that he no longer needs to drink the serum in order to transform. Susan is heartbroken when Jekyll fails to take her out to the opera, and she decides to go alone. However, the evil Mrs. Hyde decides that innocent, pure Susan's blood is just what she needs to finally overtake Jekyll's body. She stalks Susan through the dark streets, but Jekyll's will only just manages to thwart Mrs. Hyde's attempt to kill Susan. He then commits one last murder to find a way to stabilize his condition, but he is interrupted by the police after a comment by Hare leads them to realize the similarity between Jekyll's earlier experiments on cadavers and the Ripper murders. As Dr. Jekyll tries to escape by climbing along the outside of a building, he transforms into Mrs. Hyde, who, lacking his strength, falls to the ground, dying as a twisted amalgamation of male and female.","dr._jekyll_and_sister_hyde":"United States film poster","language":"English","Critical reception":"Time Out called the film \"enormous fun\" and an \"admirably successful attempt to ring new changes on an old theme\".[3]","cinematography":"Norman Warwick","production_company":"Hammer Film Productions","directed_by":"Roy Ward Baker","release_dates":"17 October 1971","Production":"Hammer Horror actress, Caroline Munro was the first choice to play Sister Hyde, but she declined because the role required nudity.[2]","produced_by":"Brian Clemens Albert Fennell","starring":"Ralph Bates Martine Beswick","running_time":"97 minutes","music_by":"David Whitaker","edited_by":"James Needs","written_by":"Brian Clemens"}