{"directed_by":"Tony Wharmby","original_release":"September 28, 1990 (1990-09-28)","Reviews and reception":"The film was given 2 and a half stars by Hal Ericson of Allmovie.","theme_music_composer":"Nan Schwartz","editor(s)":"J. Benjamin Chulay","starring":"Loni Anderson Stepfanie Kramer Shanna Reed Carl Weintraub Stuart Wilson Anthony Newley","running_time":"97 minutes","Summary":"The film opens during the summer of 1990 in Los Angeles where Leah (Loni Anderson) has just been named as the West Coast editor for a magazine owned by Nelson Publishing. Her new job will begin as soon as she returns from her annual vacation with her two best friends, Nikki (Stepfanie Kramer), a divorced woman who refuses to trust any man due to her ex-husband's cheating, and Bonnie (Shanna Reed), a married mother who loves her husband but hates the routine her life has settled into. As Leah is recently separated from Mac Chambers (John Sanderford), and it is her turn to plan the vacation, she chooses Rome. Leah had previously spent two months there during the summer of 1970 and been romantically involved with a young Italian artist named Marcello (Stuart Wilson). After learning of the trip, Mac, hoping for a reconciliation with Leah, encourages her to go see Marcello but wants time with her when she returns.Upon arriving in Rome, the three women find that their hotel room shares a bathroom with another American. Joe (Carl Weintraub) is a recently retired New York City police detective who was recently left at the altar and is taking his supposed honeymoon alone, as the trip had been prepaid. The women, Nikki in particular, struggle with the sharing of the bathroom. The women then go sightseeing, ending up at Bernini's Fountain of the Four Rivers in the Piazza Navona. Nikki comments that \"it doesn't look the same as in the movie\" (A nod to the 1954 film). The ladies agree to throw their coins and make their wishes at this fountain since they do not want to walk all the way to the Trevi Fountain, which was used in the previous film.Leah locates Marcello, now a curator at an art museum and finds the courage to meet him. Marcello is excited to again see Leah, and the two spend the afternoon together strolling around the city. Meanwhile, Nikki and Bonnie lose each other in the crowds of tourists. Nikki makes it back to the hotel, and she and Joe share their stories and eventually decide to go to dinner together. Bonnie ends up with a tour group and meets Alfred (Anthony Newley), a widower who becomes interested in her. They also go to dinner that night.As their two-week vacation is coming to an end, the women try to sort out their feelings. Leah is convinced that Marcello is going to ask her to stay, as he did in 1970, and this time she decides she will say yes. Nikki decides to break it off with Joe, as she does not ever want to be in a position of being hurt again, and Bonnie truly does not know what she wants. Alfred, who has become a good friend, has offered her to come with him to Switzerland for another two weeks. She feels that if she does not go, she may never have another chance, and she is not anxious to return to her mundane life.As Nikki gets to Joe's hotel room, she finds that he has already left, and she begins to cry. Meanwhile, Leah tells Marcello she will stay and is then surprised to find out that he had not even thought about asking her to stay. Marcello tells her that he thought she was living her life exactly how she wanted it, based upon her statements from 1970. He tells her that her career focus is what influenced him to give up being an artist and move into his career.The next day, their last day in Rome, the ladies go to breakfast and then return to the hotel. To their surprise, Joe has come back and Bonnie's husband, Phil (David Wilson) has flown in as well. Joe tells Nikki that he does not want to lose her. Phil tells Bonnie that he missed her too much and that he needs her.Marcello appears and tells Leah that he would like her to stay if she wants to, but Leah responds that she realized that it can't be 1970 again and that she has always had a fantasy that it could be. She ends by saying that she needed to get back to Los Angeles, her dream job and to Mac, who she had not been fair to. She has always held it against him that he was not a young, Italian artist.The film ends with Leah, Phil, Bonnie, Joe and Nikki on an airplane flying home, with Leah asking, \"So how does Paris in April sound?\"","Opening scenes":"During the opening credits, the scene is a recreation of the opening of the 1954 film. It is a montage of the Trevi Fountain and other fountains of Rome, as well as many shots of Villa d'Este in Tivoli, Italy.","Theme song":"The song Three Coins in the Fountain was recorded by Jack Jones (the singer of The Love Boat theme) and used in this film.[1]","producer(s)":"Joseph B. Wallenstein","written_by":"Lindsay Harrison"}