{"death_race":"Theatrical release poster","Cars":"The cars in the film are vehicles that have been heavily modified with armor plating, machine guns and defensive weapons:","country":"United States","distributed_by":"Universal Pictures","Plot":"In 2012, the collapse of the US economy and the subsequent increase in crime rates leads to the rise of privatized prisons. One such prison is Terminal Island Penitentiary, whose warden, Claire Hennessey, earns her profits by broadcasting a modern gladiator game participated by the prisoners. In the game \"Death Race,\" The racers, along with their navigators, compete in a 3-part race over 3 days on a closed track. The track is littered with pressure plates that activate either the cars' offensive weapons, defensive equipment or deadly traps. Any racer winning 5 races will be granted freedom.Towards the end of one race, a masked driver nicknamed Frankenstein is nearing the finish line, pursued by his rival Machine Gun Joe. His navigator, Case, reports that all his defensive equipment have malfunctioned. Against her protest, Frankenstein refuses to let Joe finish first. Case ejects herself out of the car just before Joe destroys it.Industrial worker and former NASCAR driver Jensen Ames struggles to support his family. When the factory he works at is closed, he returns home to his wife and their new-born daughter, Piper. A masked assailant knocks him unconscious. Jensen wakes up with a bloodied knife in hand, and his wife lies dead nearby, just before policemen stormed into his home. He is arrested and sentenced to life imprisonment, while Piper is placed in foster care.Six months later, Jensen is transferred to Terminal Island Prison. He immediately gets into a fight with Pachenko and his Aryan Brotherhood gang. Hennessey's right-hand man Ulrich calls Jensen to her office. She tells him that Frankenstein died from his injuries after the previous race, and offers to let Jensen go free if he impersonates Frankenstein to win one more race (as Frank already won 4). Jensen accepts the offer and meets Frankenstein's maintenance crew consisting of Coach, Gunner, and Lists.On Day 1, Jensen meets his navigator Case. Jensen's defensive equipment again mysteriously malfunction. Under attack by Travis Colt, one of the other competitors, Jensen improvises and spills napalm over Colt's car, and Case ignites it with the cigarette lighter. Colt's car is then run over by Machine Gun Joe's. When Jensen sees Pachenko doing the same hand gesture as the masked assailant, he is distracted and is hit by Joe, coming in last place. Day 1 ends with 3 racers dead and 6 remaining. After a conversation with Hennessey and another fight with Pachenko, Jensen deduces that Hennessey ordered Pachenko to frame Jensen, so she can have a replacement for Frankenstein.On Day 2, Jensen confronts Case about the malfunctions. Case admits she sabotaged Frankenstein's car to keep him from winning and leaving Death Race, in exchange for her release papers. Jensen tricks Pachenko into crashing, then leaves his car and kills Pachenko by snapping his neck. Hennessey then unleashes the Dreadnought, a newly-built heavily armed 18-wheel tanker, to thin out the racers and boost ratings. The Dreadnought kills three racers, leaving only Frankenstein and Joe alive. Jensen contacts Joe and the two work together to trigger a trap which destroys the Dreadnought, much to Hennessey's shock and anger.Hennessey asks Jensen to consider staying and racing as Frankenstein, in exchange for a life of comfort, but he refuses. She orders Ulrich to plant a bomb under his car, in case he wins. Knowing Hennessey has no intention of letting him go, Jensen plans an escape and talks to Joe.On the final race, Hennessey deliberately keeps Jensen from activating his weapons and allows Joe to activate his. Jensen, Case and Joe destroy and drive through a weakened wall, which they discovered by examining footage of the previous race, and head for the bridge to the mainland. Hennessey activates the bomb, not knowing that it was removed and neutralized by Coach. The cars wreck the pursuing police cruisers, and a furious Hennessey dispatches attack helicopters. After the cars make it to the mainland and split up, the helicopters follow and corner Jensen's car. Case reveals that she had already received her release paper. She wears Frankenstein's costume, and Jensen jumps out of the car. Case is captured while Joe and Jensen escape on a freight train.Hennessey, although furious about the losses, is happy about re-capturing \"Frankenstein\" and the race' success. She opens a congratulatory present from Coach, only to find the bomb planted on Jensen's car. Coach detonates the bomb, killing Hennessey and Ulrich.Six months later, Joe and Jensen are shown working in Mexico as mechanics, and are reunited with Case and Piper.","Prequels":"The film is followed by two direct to video prequel films Death Race 2 (2010) and Death Race 3: Inferno (2013), both take place before this film and was filmed shot in South Africa. The films was directed by Roel Reiné, stars Luke Goss, Tanit Phoenix, Danny Trejo and Ving Rhames. Lists and 14K are the only returning characters and are portrayed by Frederick Koehler and Robin Shou, respectively.","language":"English","Reception":"The film has received mixed reviews. Review aggregator Rotten Tomatoes gives it a 43% rating based on reviews from 150 critics.[10] Metacritic gave it rating of 43 out of 100 based on reviews from 23 critics.[11]Robert Koehler of Variety called Death Race \"as hard as metal and just as dumb\" and criticized it for removing the humor of Death Race 2000.[12] Roger Ebert of the Chicago Sun-Times gave the film half a star (out of four), calling it \"an assault on all the senses, including common.\"[13] Keith Phipps of the A.V. Club said the film is \"ideal for those who want to watch a bunch of cars blow each other up, without having to think about it all that much.\"[14] Marc Savlov of the Austin Chronicle called Death Race \"one of the most boring drags of all time.\"[15]Peter Hartlaub of the San Francisco Chronicle called the film \"an ill-advised and severely wussified remake.\"[16] Elizabeth Weitzman of the New York Daily News gave the film one and a half stars (out of four), calling it \"junk\" and saying that \"the chases are pretty cool, but there's absolutely nothing else to see.\"[17] A positive review came from Nathan Lee of The New York Times, who said that \"the movie is legitimately greasy, authentically nasty, with a good old-fashioned sense of laying waste to everything in sight.\"[18] James Berardinelli of ReelViews awarded Death Race a score of two and a half stars (out of four), saying that it's \"weak when it comes to things like plot, character, and acting, but it's very good at provoking visceral reactions.\"[19]The film grossed $75,677,515, of which $36,316,032 was from North America.[20]","box_office":"$75.7 million","cinematography":"Scott Kevan","production_company":"Relativity Media Cruise/Wagner Productions Impact Pictures","directed_by":"Paul W. S. Anderson","Music":"The score to Death Race was composed by Paul Haslinger who recorded the string portion of his score with the Hollywood Studio Symphony at the Sony Scoring Stage.[23]The soundtrack was released on August 19, 2008.[24]","release_dates":"August 22, 2008 (2008-08-22)|||||","Production":"In March 2005, following the success of Alien vs. Predator, director Paul W.S. Anderson revealed that he was directing a remake of Death Race 2000 (1975) entitled Death Race 3000 at Paramount Pictures based on a script by J. F. Lawton. The remake would be produced by the producer pair Tom Cruise and Paula Wagner. Anderson described the remake as a riff on the first film. \"It's not a straight remake at all. The first movie was an across-America race. This will be an around-the-world race. And it's set further in the future, so the cars are even more futuristic. So you've got cars with rockets, machine guns, force fields; cars that can split apart and re-form, a bit like Transformers. Cars that become invisible,\" the director explained.[4] Comingsoon.net reported that \"Paul saw his film almost as a prequel if anything; almost the genesis of the Death Race,\"[5] though the film is referred to primarily as a remake in reviews and marketing materials.Two years later, Roger Corman, the producer of Death Race 2000, elaborated that he had an option agreement with producer Tom Cruise, and that Cruise would portray the lead role. The director said that Cruise had not been happy with the first two screenplays and that a third one was underway.[6] In June 2006, producer Jeremy Bolt reported that Anderson would direct the remake of Death Race 2000 after completing Resident Evil: Extinction (2007). The producer described the remake's new tone: \"We've basically taken the idea of reality television and extended it twenty years. So it's definitely a comment on society, and particularly reality television, but it is not as much a parody or a satire as the original. It's more straight.\"[7] The following August, Paramount ended its relationship with Cruise/Wagner Productions, and Death Race was placed in turnaround. According to reports, when the project was discovered available, Universal Studios acquired it. Cruise and Wagner resumed their roles as producers, and Anderson returned to write and direct the film.[8]In April 2007, actor Jason Statham entered negotiations to star in Death Race, with production slated to begin in late summer or early fall.[8] Anderson described that Death Race would take place in a prison, and that the film would be \"super-violent\" like its predecessor. \"It has little echoes of the original – a lot of people get run down, but rather than having the points system, which had no pay off anyway, it's a pure race. It's more like Gladiator, with the last person standing – or driving, winning,\" explained the director.[9] Filming on Death Race began in Montreal in August 2007.[2]","produced_by":"Paul W.S. Anderson|Jeremy Bolt|Roger Corman|Paula Wagner|","starring":"Jason Statham|Joan Allen|Tyrese Gibson|Ian McShane|Natalie Martinez|","running_time":"110 minutes","music_by":"Paul Haslinger","edited_by":"Niven Howie","Release":"The film was originally scheduled for release on September 26, 2008, but was moved to August 22, 2008.[21]The DVD and Blu-ray were released in the United States on December 21, 2008.[22] There was also an unrated edition released. The Blu-ray version of the movie features a Digital Copy of the film. In the DVD commentary, Anderson further elaborates on his thought of the movie as a prequel more than a remake.","written_by":"Paul W. S. Anderson","budget":"$45 million"}