{"based_on":"The Dalek Invasion of Earth  by Terry Nation","Cast":"The original trailer for the film describes actor Ray Brooks as \"the boy with the knack\". Brooks had recently starred in the 1965 Richard Lester comedy The Knack …and How to Get It.Cribbins appeared as a recurring character in the 2007 Christmas Special and the 2008 series of the Doctor Who television series as Wilfred Mott, a patriotic newspaper salesman who is the grandfather of the companion Donna Noble. The penultimate episode of the 2008 series, The Stolen Earth, sees Wilfred meeting the Daleks as they once again invade Earth. Cribbins has thus appeared in two Dalek-related stories separated by a 42-year gap. Cribbins again appears in the 2009 Christmas/New Years specials The End of Time where Wilfred Mott plays an important role in the Doctor's regeneration.Philip Madoc later appeared in four Doctor Who television serials, including The Brain of Morbius.","Products and later coverage":"From 1965 to 1967, TV Century 21, a largely Gerry Anderson oriented colour comic magazine, featured a one-page Dalek comic strip where the artist Ron Turner based the Dalek design on that used in the films. The covers had frequent photographic appearances of the colour film version Daleks, plus articles, bits of news, and stray references, especially to the film Dr. Who and the Daleks. A few of the TV 21 Dalek strips were reprinted in the Dalek Annuals for 1977 and 1978, and in the 1980s a number of the early serials drawn by artist Richard Jennings, were reprinted in black and white in Doctor Who Weekly as The Dalek Tapes. Later, the Ron Turner strips were reprinted in colour on the back page of Doctor Who Monthly and in 1996 all sixteen serials were reprinted in a full colour omnibus edition — The Dalek Chronicles — published by Marvel Comics UK.Many fans[who?] of the BBC Doctor Who programme hold the films in poor regard, one result being that they have not been the subject of fan research to the same extent as Dalek appearances on television. They were the first colour and wide screen appearances of the Daleks, however, featuring impressive sets and the use of a large number of Dalek props in many scenes. Consequently, colour stills from the films were often used when photographs were required for Dalek merchandise related to the TV series, so the films might be considered as a small milestone for the wider Who and Dalek phenomenon.The BBC-TV serials featuring Daleks were rarely repeated after initial transmission. The films are significant, therefore, in that soon after their theatrical release was completed they became available to rent, for public and domestic screening, from film hire companies. Consequently, they were virtually the only Dalek-related stories in a live-action visual media, which could be watched and studied on a repeated basis in the decade or so before the advent of home video tapes, and later DVDs.The Dalek design seen in the revived TV series from 2005 onwards have taken several cues from the Daleks seen in the two feature films, including a large fender and dome lights.[citation needed]A lengthy article appeared in Doctor Who Monthly in 1984, with production information, photographs and interviews,[13] making this almost the only substantial source of material on the two films until the documentary Dalekmania in 1995 and the Doctor Who Magazine Spring Special — The Sixties Dalek Movies, also from 1995, articles credited to Marcus Hearn.Music from this film has been released on Dr. Who & the Daleks by Silva Screen Records.Both films, plus the Dalekmania documentary, were released on 20 November 2001 as a three-disc DVD boxset (Region 1). As the set was released by Continental Distributing and not the BBC, movie poster-like covers were used for all three boxes instead of the Classic Series style and logo used by the Corporation. In response, several fans have created alternative covers for download that mirror the official BBC covers used in various regions.A two-disc DVD box set was released in the United Kingdom in 2006 containing both films, plus the Dalekmania documentary. The Italian and French language versions of the film shown in the Dalekmania documentary were not included.The remastered Blu-ray edition was released on 27 May 2013.[14]","country":"United Kingdom","distributed_by":"Amicus Productions (UK) Continental Distributing/Walter Reade Organization (US)","Plot":"Tom Campbell, a London Special Constable, is on patrol near a jewellery shop. Men are burgling the shop and Tom is struck down by their getaway driver before he can stop them. Running to what appears to be a police box to call for backup, Tom enters TARDIS, a time machine operated by its pilot, Dr. Who, with his niece Louise and his granddaughter Susan.The Doctor pilots TARDIS forward in time to 2150, where they find that London is now an empty landscape of demolished buildings. The Daleks, one-time adversaries of the Doctor, have invaded Earth and ravaged entire continents, while humanity's remnants have formed underground resistance movements. Some captured humans have been turned into brainwashed slaves called Robomen, but the majority have been taken to the Dalek mining complex in Bedfordshire, where the aliens' excavations extend to the core of the Earth.Louise and Susan are taken in by a group of rebels based in the London Underground, led by Wyler, David, and the wheelchair-bound Dortmun. Meanwhile, Tom and the Doctor are captured by a squad of Robomen and taken on board a Dalek spaceship, where they are placed in a cell with a man called Craddock. The Doctor realises that the door is sealed by magnetism and breaks the connection with a plastic comb, but he is unaware that the escape is merely an \"intelligence test\" devised by the Daleks to determine who should be robotised. However, while the Doctor, Tom and Craddock are undergoing the conversion procedure, the rebels launch an attack with hand-held bombs. During the battle, the Doctor flees with David while Tom and Louise, who is knocked unconscious by one of the bombs, stow away in a deserted part of the ship. The Daleks escape and take off for the Bedford mine with few prisoner losses.Wyler, having lost most of his team, returns to the rebel hideout, where Dortmun and Susan are waiting. The group commandeer a van to rendezvous with any remaining survivors in Watford, but Dortmun is killed by a Dalek patrol and Wyler and Susan are forced to abandon the vehicle before it is destroyed. Deciding that the Doctor would avoid the Daleks in Watford, Wyler and Susan set off for the Bedford mine. David and the Doctor are also heading for the same destination, but are confronted by Brockley, an unscrupulous smuggler, who seizes their rifle in exchange for a promise to get them safely into the complex.The spaceship touches down at the mine. Tom and Louise exit the craft through a disposal chute and take refuge in a tool shed. Meanwhile, Wyler and Susan shelter at a hut owned by a pair of spinsters who repair slave workers' clothes in return for freedom and food. However, the women betray them to the Daleks out of desperation.In the morning, David and the Doctor are brought into the mine by Brockley, where they are reunited with Tom and Louise. One of the miners, Conway, reveals that the Daleks are planning to drop a bomb into their mineshaft to punch out the Earth's core, which will be replaced with a giant motor enabling the aliens to pilot Earth to their home world of Skaro. However, the Doctor learns that the old shaft leads to a convergence point between the North and South Magnetic Poles and deduces that, if the bomb were deflected down this path, the explosion's magnetic energy would be powerful enough to suck the metal Daleks into the core of the Earth.As Tom and Conway work to alter the bomb's trajectory, the Doctor orders David and Louise to create a diversion while he chooses to remain in the tool shed. Brockley offers to help the Doctor and escorts him outside – where the scientist is not surprised to discover a detachment of Daleks waiting to take him away. The treacherous Brockley then tries to escape himself, but the Daleks destroy the tool shed with him inside.In the mineshaft, Tom and Conway run into Craddock who is now a Roboman. While fighting, Conway and Craddock fall to their deaths down the shaft. Tom removes the timbers boarding up the entrance to the old shaft and then rushes back up to ground level.Sent to the Dalek command centre for extermination, the Doctor discovers Wyler and Susan. In the control room the inventor seizes an opportunity to distract the Daleks and commandeers the Robomen's command circuit, ordering them to turn against their masters. As the Robomen fight the Daleks the Doctor escapes with Wyler and Susan, while the slave workers flee from the mine. The Daleks defeat the Robomen's revolt and release their bomb into the shaft, unaware that Tom has successfully altered the route; the device is deflected into the disused shaft and detonates at the pole convergence. The Daleks, overwhelmed by the magnetism, are pulled into the Earth's core and destroyed. Meanwhile, the spaceship, having just taken off, is brought crashing down onto the complex in a massive explosion.Later the Doctor, Tom, Louise, and Susan return to the past. The Doctor materialises TARDIS a couple of minutes before the jewellery store raid, giving Tom time to take over the getaway car after knocking out the driver, then to knock out the other two thieves as they get into the back seat. As he drives off to the police station to deliver the criminals, he gleefully utters his name with the new title he hopes to be promoted to and laughs, \"Detective Inspector Tom Campbell, OBE. Ha ha ha ha! Thank you, lads!\" The Doctor, Louise, and Susan wave goodbye as he passes.","daleks_–_invasion_earth:_2150_a.d.":"UK quad poster","language":"English","Radio adaptation":"The film's soundtrack was adapted and presented by Gordon Gow for radio broadcast on the BBC Light Programme on 18 November 1966 as Show 305 of the Movietime series. It was produced by Tony Luke.[4][11][12]","Daleks":"Three Daleks lead the campaign to defeat and control Earth. A gold Dalek appears to be in overall command of the operation. It is destroyed when the Dalek spacecraft crashes into the mining facility. A black Dalek controls the Bedfordshire mining operation and bomb detonation, and a red Dalek is shown commanding the Dalek spaceship and operations to capture human slaves, robotise prisoners and wipe-out any resistance. Both are killed by being sucked into the bomb shaft by the magnetic force created when the device explodes.","cinematography":"John Wilcox","production_company":"AARU Productions in association with: British Lion Films Limited","directed_by":"Gordon Flemyng","release_dates":"5 August 1966 (UK)[1]","Production":"Filming commenced at Shepperton Studios in England on 31 January 1966, and was completed on 22 March, eleven days behind schedule.[4] The shoot was complicated by the illness of Cushing, which required some rewriting to reduce his on-screen appearances, and there were a number of accidents on set. For example, a Dalek prop caught fire during shooting of the rebel attack on the spaceship, while stuntman Eddie Powell, playing a human prisoner called Thompson, broke his ankle during a scene in which his character is killed by the Daleks after trying to escape from them.[5] Furthermore, Andrew Keir hurt his wrist when punching through the windscreen of the van during the sequence in which Wyler and Susan escape from London.[4]The film had a budget of £286,000 which was higher than the previous film.[6] Over £50,000 was spent on the film's promotion. It premiered in London on 22 July 1966.[5]In 1995, a documentary, Dalekmania, about the two Dalek films was released; it looks at the production of the film as well as its publicity.[7]","produced_by":"Max J. Rosenberg Milton Subotsky","starring":"Peter Cushing Bernard Cribbins Ray Brooks Andrew Keir Jill Curzon Roberta Tovey","running_time":"84 minutes[2]","music_by":"Barry Gray Bill McGuffie","edited_by":"Ann Chegwidden","Release":"The breakfast cereal Sugar Puffs sponsored the film. In exchange for its funding, the company was allowed to run a special competition on its cereal packets (with a Dalek prop as the prize) and feature the Daleks in its television advertisements. In an example of product placement, Sugar Puffs signs and products can also be seen at certain points in the film.[5]The film was given a negative review in The Times newspaper on 21 July 1966: \"The second cinematic excursion of the Daleks shows little advance on the first... The filming of all this is technically elementary... and the cast, headed by the long-suffering, much ill-used Peter Cushing, seem able, unsurprisingly, to drum up no conviction whatever in anything they are called to do. Grown-ups may enjoy it, but most children have more sense.\"[8] In Sydney, Australia, it was only screened for a week or two in one of the less mainstream cinemas during the school holidays.[citation needed] Radio Times gave the film three stars out of five in a retrospective review, stating \"Independence Day it's not, but director Gordon Flemyng keeps the colourful action moving swiftly along to cheap and cheerful effect. Youngsters will love it, while adults will want to E-X-T-E-R-M-I-N-A-T-E Bernard Cribbins, who provides comic relief as the bumbling bobby. Yet, through all the mindless mayhem roll the ever-impressive Daleks, truly one of science fiction's greatest alien creations.\"[9] In a review of the Blu-ray release Starburst's Paul Mount said the feature was \"a leaner, slicker film than its predecessor, its bigger scale and lavish location filming giving the story room to breathe and allowing for some effective action sequences, such as the rebel attack on the impressive Dalek flying saucer.\"[10]A third Dalek film, to be based on the serial The Chase, was planned but never produced because of this film's under-performance at the box office.[6]","written_by":"Milton Subotsky","budget":"£286,000[3]"}