{"country":"United States|Czech Republic|","distributed_by":"New Line Cinema1","Plot":"The Empire of Izmir has long been a divided land, ruled by the Mages, an elite group of magic users. An evil mage named Profion (Jeremy Irons) attempts to create a sceptre that allows him to control Gold Dragons. His attempt to control a captive golden dragon fails, and he is forced to kill it. The dragon bleeds into the river, causing it to catch fire, which many inhabitants notice, including a pair of thieves, Ridley (Justin Whalin) and Snails (Marlon Wayans).Later, Profion and the Council talk about the controversial views of Empress Savina (Thora Birch), who wants give rights to non-mages in Izmir. Meanwhile, Ridley and Snails break into the magic school to steal valuables, but are caught by Marina (Zoe McLellan). She is distracted when the Library wizard is held hostage and interrogated by Profion's henchmen, Damodar (Bruce Payne) for information on where the map to the magic sceptre that controls Red Dragons is. After refusing to talk, Damodar kills him. Marina gets the map and travels through a portal to escape, accidentally taking the thieves with her. After crashing into a pile of garbage, they meet a dwarf named Elwood (Lee Arenberg), who ends up joining Ridley, Snails and Marina escaping through the sewer.Damodar puts a price on Marina, Ridley, Snails and Elwood's heads and, after letting Profion know that the protagonists got away, Profion creates a tentacled monster inside Damodar's head. The protagonists hide in a tavern and read the map that Ridley and Marina get sucked into. Damodar and his henchmen attack Elwood and Snails, but they manage to get away with the map. Ridley and Marina exit the map and all decide to work together to find the sceptre. They apparently have to find a red ruby called the \"Eye of the Dragon\" that can open the door to a tomb where the red sceptre rests. The ruby is located in a den of thieves that is led by Xilus (Richard O'Brien) who'll give the protagonists the \"Eye of the Dragon\" if Ridley solves a maze of booby traps. Ridley manages to get the \"Eye of the Dragon\" when Damodar arrives to capture him and his friends. Marina is captured while Ridley, Snails and Elwood escape, meeting an elf named Norda (Kristen Wilson) who works for Empress Savina and informs the Empress about Profion's plans to get the Red Dragon sceptre. Meanwhile, Damodar interrogates Marina, using the tentacles in his head to gain her knowledge.Ridley and Snails break into the castle to rescue Marina, while Norda and Elwood stay behind. Ridley and Snails split up and Ridley finds Marina, but Snails is confronted and killed by Damodar when he throws the map to his comrades. Ridley becomes enraged at Damodar and attacks him, but Damodar disarms him and stabs him in the left shoulder with his own sword. In the confusion Marina grabs some magic dust and uses a magic portal to escape with Ridley, leaving the corpse of Snails behind. During the council meeting, Profion and Empress Savina battle over the domination of Izmir.Meanwhile, an elf (Tom Baker) heals Norda's soldiers and Ridley, and Marina tries to help Ridley get over the death of Snails, but Ridley angrily rebukes her. After an argument in which Marina convinces Ridley that Snails didn't die in vain, they become love interests. Ridley uses the \"Eye of the Dragon\" to finally get the Red Dragon sceptre, which is held by a skeleton that comes to life and warns Ridley that \"anyone who wields the power of the rod shall suffer a horrible fate\", but Damodar arrives to steal the sceptre and brings it to Profion, where Ridley, Marina and Elwood follow.They travel back to the Empress' castle where Gold dragons controlled by the Empress are battling the Mages below. Profion uses the Red Dragon sceptre to summon Red dragons, which battle the Gold dragons and slowly begin to win the fight. Ridley comes across Damodar, duels him with his new magic sword and then kills him, sending his body off the castle wall, and then, after a confrontation with Profion, Ridley destroys the sceptre and a Gold dragon eats Profion.Ridley later visits Snails grave, where Snail's engraved name disappears, and Norda teleports Ridley to a place where \"your friend awaits you\", along with herself, Marina and Elwood.","language":"English","Reception":"Critical reaction to the film was largely negative. The film has a score of 10% on Rotten Tomatoes based on 91 reviews, the consensus stating: \"Critics say this movie has a cheap look and is badly directed. Despite the presence of talented actors, the performances are really bad, and additionally, some people are offended at Marlon Wayans' character, calling it a racist throwback to black stereotypes.\"[3] Geoff Pevere of the Toronto Star called the film \"A wheezy quest story steeped in hobbity gibberish and second-hand Star Wars costumery, featuring a cast so uniformly uncharismatic you may pine for the methody depths of Kerwin Mathews (apart, of course, from the reversely charismatic Irons), the movie has the cheap software look of something found on the Space channel at 4 a.m.\".[4] Steve Biodrowski of mania.com comments: \"Let's just say that if it weren't for Lost Souls (also a New Line release, coincidentally), this would be a strong contender for the Worst Film of the Year.\"[5] In February 2010, the readers of Empire voted Dungeons & Dragons the 39th worst film of all time.[6]Solomon blamed the quality of the film on its investors and license-holders' interference, as well as his own inexperience in filmmaking. He states that he had only intended to produce the film, but was forced to direct by his investors after nearly a decade of complications dealing with TSR and Wizards of the Coast. He also claims that he was forced to use an older script despite having written an updated version that fit the Dungeons and Dragons license better.[7]The film opened at #5 at the North American box office making USD$7,237,422 in its opening weekend.[8] The film would go on to gross $15,220,685 in the domestic box office, short of the film's $45 million budget, and with an international gross of $18,586,724, coming up with a worldwide total of $33,807,409.[9]Wizards of the Coast released a Fast-Play Game based on the movie called \"The Sewers of Sumdall\". It is a DVD-ROM feature on the DVD as a printable PDF file.[11][12]","dungeons_&_dragons":"Theatrical release poster","box_office":"$33,807,409","cinematography":"Douglas Milsome","production_company":"Sweetpea Entertainment Silver Pictures Behavior Worldwide","directed_by":"Courtney Solomon","release_dates":"December 8, 2000 (2000-12-08)|||||","produced_by":"Courtney Solomon|Thomas M. Hammel|Kia Jam|Steve Richards|","starring":"Justin Whalin|Marlon Wayans|Thora Birch|Zoe McLellan|Kristen Wilson|Lee Arenberg|Bruce Payne|Jeremy Irons|","running_time":"107 minutes","music_by":"Justin Caine Burnett","edited_by":"Caroline Ross","written_by":"Carroll Cartwright|Topper Lilien|","budget":"$45 million"}