{"based_on":"Breakfast of Champions by Kurt Vonnegut, Jr.","country":"United States","breakfast_of_champions":"Theatrical release poster","distributed_by":"Buena Vista Pictures","screenplay_by":"Alan Rudolph","Plot":"Dwayne Hoover, a car salesman who is the most respected businessman in Midland City, is on the verge of a nervous breakdown, even attempting suicide daily. His wife, Celia, is addicted to pills, and his sales manager and best friend, Harry Le Sabre, has a lingerie fetish. Meanwhile, Dwayne's favorite author, the rarely read and often unpublished Kilgore Trout (Albert Finney), is hitchhiking across the United States to speak at Midland City's arts festival. In search of answers for his identity quest, Hoover attends the festival.","Vonnegut's reaction":"At the close of the Harper Audiobook edition of Breakfast of Champions, there is brief conversation between Vonnegut and his long-time friend and attorney, Donald C. Farber, in which the two, among making jokes, disparage this loose film adaptation of the book as \"painful to watch.\"[4]","language":"English","Reception":"Breakfast of Champions received negative reviews, scoring a 25% on Rotten Tomatoes. In his review for The New York Times, Stephen Holden wrote, \"In many ways, Breakfast of Champions is an incoherent mess. But it never compromises its zany vision of the country as a demented junkyard wonderland in which we are all strangers groping for a hand to guide us through the looking glass into an unsullied tropical paradise of eternal bliss.\"[5] Entertainment Weekly gave the film an \"F\" rating and Owen Gleiberman wrote, \"Rudolph, in an act of insane folly, seems to think that what matters is the story. The result could almost be his version of a Robert Altman disaster — a movie so unhinged it practically dares you not to hate it.\"[6] In his review for the San Francisco Chronicle, Peter Stack wrote, \"Rudolph botches the material big time. Relying on lame visual gimmicks that fall flat, and insisting on pushing almost every scene as frantic comedy weighted by social commentary, he forces his actors to become hams rather than believable characters.\"[7] Sight and Sound magazine's Edward Lawrenson wrote, \"Willis' performance, all madness, no method, soon feels embarrassingly indulgent.\"[8] In his review for the Los Angeles Times, Kevin Thomas wrote, \"As it is, Breakfast of Champions is too in-your-face, too heavily satirical in its look, and its ideas not as fresh as they should be. For the film to have grabbed us from the start, Rudolph needed to make a sharper differentiation between the everyday world his people live in and the vivid world of their tormented imaginations.\"[9] In her review for the Village Voice, Amy Taubin wrote, \"Another middle-aged male-crisis opus, it begins on a note of total migraine-inducing hysteria, which continues unabated throughout.\"[10] The French filmmaker and critic Luc Moullet, on the other hand, regarded it as one of the greatest films of the 1990s.[11]","box_office":"$178,278","cinematography":"Elliot Davis","production_company":"Hollywood Pictures Summit Entertainment","directed_by":"Alan Rudolph","release_dates":"September 17, 1999 (1999-09-17)|||||","Production":"Lukas Haas makes a cameo as Bunny, Dwayne's son, who, in the novel, plays piano in the lounge at the Holiday Inn. For legal reasons, in the film Bunny instead plays at the AmeriTel Inn.[citation needed]Much of the film was shot in and around Twin Falls, Idaho.[2] Kurt Vonnegut, Jr. makes a one-line cameo as a TV commercial director.[3]","produced_by":"David Blocker David Willis","starring":"Bruce Willis|Albert Finney|Nick Nolte|Barbara Hershey|Glenne Headly|Lukas Haas|Omar Epps|Vicki Lewis|Buck Henry|Ken Campbell|Jake Johanssen|","running_time":"110 minutes","music_by":"Mark Isham","edited_by":"Suzy Elmiger","budget":"$12 million"}