{"country":"United States","distributed_by":"Lionsgate","Plot":"Jason Kelly attends his grandmother's funeral, where he reunites with his grandfather, Army veteran Dick, who is now widowed after 40 years of marriage. Jason and Dick were once very close, but have since drifted apart, mainly due to Jason's new job as a corporate attorney, where he works with his father David. After the funeral, Dick personally requests that Jason drive him from his home in Georgia to Boca Raton, Florida. Jason is uncomfortable with the situation, as well as his uptight and controlling fiancee Meredith Goldstein, but reluctantly agrees to do so.The next day, Jason walks in on Dick playing music records and masturbating to pornography. Officially beginning their journey, Dick chides Jason for giving up his dream of becoming a photographer and traveling the world, but Jason insists he is happy in his current position. While stopping at a diner, the duo encounter Shadia, a former classmate of Jason's from his photography class when he attended The University of Georgia, as well as her friends Lenore who needs to finish her trifecta (sleep with a freshman, alumni & a professor) and Bradley. Dick introduces himself as a college professor and Jason as a photographer for Time Magazine, leaving out his family connections. Lenore, who wants to sleep with Dick, invites the duo to join them in their quest to Daytona Beach, where they are headed for spring break, but Jason insists they should carry on to Boca.Afterwards, Jason and Dick hit the golf course, where Dick flirts with women while denying his relationship with Jason. Jason is shocked that his grandfather would flirt with women immediately after his wife's funeral, but Dick proclaims it's okay because he was never unfaithful to his wife during forty years of marriage, claiming he hasn't had sex for fifteen years because of his wife's cancer and that she insisted he \"get back out there\". Hearing Dick's plea, Jason reluctantly agrees to go to Daytona.Upon their arrival in Daytona, Jason and Dick meet up with Shadia and Lenore on the beach, where they also meet the girls' boyfriends Cody and Brah, both of whom Dick takes an immediate disliking to. Dick laces his own drink with Xanax, but Jason accidentally drinks it while competing in a drinking game. While partying with the girls, Dick witnesses, and records, Jason, wearing nothing but a hornet fanny pack, partying while highly intoxicated, and smoking crack from a local shop owner/drug dealer Pam (Jason Mantzoukas). Jason later steals a motorcycle and drives off.Jason awakens the next day on the beach, where he endures an awkward FaceTime conversation with Meredith and his family. He's later approached by a young boy who wants to touch the hornet fanny pack, but is caught by the boy's furious father, who believes Jason is a pedophile. Jason winds up in jail over the incident, but Dick posts his bail. Furious with Dick over the previous night's events, Jason tries to drop him off with his old war buddy Stinky, but Dick is heartbroken to see his friend stuck in a wheelchair in a retirement home. Stinky's dire situation helps Dick convince Jason that they need to go back to Daytona.Returning to Daytona, the duo reunite with Shadia and Lenore at a beach party hosted by Pam. They soon enter a \"flex-off\" against Cody and Brah, winning over the crowd with a wild stunt that they used to do when Jason was a kid. However, Jason forces them to flee, as the crowd is recording the event on their phones, and Jason doesn't want to be caught on film. With Cody and Brah winning the flex-off by default, Dick alters an T-shirt cannon to fire beer cans at the winning duo, hospitalizing them. Dick reveals to Jason that he was part of a Special Forces group in the Army, rather than just a mechanic. With Cody and Brah in the hospital, Jason and Dick take their hotel room. The next night, the duo go to a popular nightclub with Shadia, Lenore, and Bradley. Seeing a gang pick on Bradley for his homosexuality, Dick single-handedly takes down the gang, who vows revenge. Despite the chaos, Dick admits he is proud of Jason, who agrees to give Dick some private time so Dick can sleep with Lenore.The next day, Jason spends some private time with Shadia, who reveals her own intentions to travel the world, and is leaving shortly after the trip. They nearly share a kiss, but are interrupted by a call from Bradley, who reveals that Dick and Lenore have been kidnapped by the gang from the club. They track them down to a motel, where Dick's charming demeanor has won over the gang, and they all go to a karaoke bar to celebrate. As Jason and Shadia serenade the crowd with a love song, Cody, released from the hospital, sneaks into Dick's jacket and finds a valid driver's license. After they return to the hotel, Jason and Dick share a heartfelt conversation, where Jason reveals he will call off his wedding, and plans to reveal the truth to Shadia, much to Dick's horror as he hasn't slept with Lenore yet. However, Cody and Brah, using Dick's driver's license to look them up, have already revealed the ruse to the girls (though Lenore seems unfazed by the news) and also reveal to Shadia that Jason is engaged, thanks to a wedding announcement seen online. A heartbroken Shadia tells Jason to never talk to her again, and Jason is soon arrested again, for carrying drugs. Dick bails Jason out again, but a furious Jason demands that Dick stay away from him, driving back to Georgia alone. Dick soon mails Jason a new camera and an inappropriate crochet Stinky made.At Jason and Meredith's wedding rehearsal dinner, a slide show featuring romantic photos of the couple is hacked by Dick, who inserts inappropriate photos from their Daytona trip. Viewing the photos, Jason realizes he can't go through with the wedding and calls off his engagement, to which Meredith reacts indifferently, as she slept with Jason's cousin Nick (Adam Pally) while he was gone and she herself wasn't really happy in the relationship either. Jason then reunites with Dick, who has enlisted Pam's help in stopping Shadia's bus to admit his true feelings for her. During a wild car chase, in which they are joined by David and chased by cops, eventually Jason is able to reunite with Shadia, and offers to join her in her photography trip around the world. She agrees and they reconcile. With Jason cleared of his legal offense with the help of both his father and Pam, Jason shares a heartfelt farewell with Dick.Afterwards, Dick is driven to a retirement community in Boca, where he reconciles with his son. Upon his arrival to his room, Dick finds Lenore waiting for him.In a mid-credits scene, Jason and Shadia, now in a relationship, become new godparents to Dick and Lenore's son, Jason's uncle.","language":"English","Reception":"Dirty Grandpa grossed $35.6 million in North America and $64.1 million in other territories for a total gross of $99.7 million.[3]The film was released in North America on January 22, 2016, alongside The 5th Wave and The Boy. The film was projected to gross $10–13 million from 2,912 theaters in its opening weekend.[35] The film made $600,000 from its early Thursday screenings and $4.2 million on its first day.[36] It went on to gross $11.1 million in its opening weekend, finishing 4th at the box office.[37]On Rotten Tomatoes, the film has an approval rating of 11%, based on 121 reviews and an average rating of 2.8/10. The site's critical consensus reads, \"Like a Werther's Original dropped down a sewer drain, Dirty Grandpa represents the careless fumbling of a classic talent that once brought pleasure to millions.\"[38] Metacritic gives the film a score of 18 out of 100 based on 21 critics, indicating \"overwhelming dislike\".[39] On CinemaScore, audiences gave the film an average grade of \"B\" on an A+ to F scale.[37]Richard Roeper gave the film zero stars, writing, \"If Dirty Grandpa isn’t the worst movie of 2016, I have some serious cinematic torture in my near future.\"[40] Mike Ryan of Uproxx stated that the film was \"the worst movie [he's] ever seen in a movie theater.\"[41] Glenn Kenny wrote: \"The movie is so incredibly consistent in failing to land an honest laugh that about an hour into it, its not being funny becomes laughable.\"[42]Mark Kermode also gave the film a scathing review on his BBC Radio 5 Live show (Kermode and Mayo's Film Review) saying, \"after Dirty Grandpa I did feel genuinely unclean, I wanted to go and have a shower, because it's just so revolting. Somewhere in hell there is a multiplex playing this on a double bill, with Movie 43 and Entourage.\"[43]","box_office":"$99.7 million[3]","cinematography":"Eric Alan Edwards","directed_by":"Dan Mazer","Home media":"Dirty Grandpa received a DVD and Blu-ray release on May 17, 2016. The Blu-ray edition featured an unrated version of the film, including an audio commentary, a making-of, a gag reel, and three featurettes.[44]","production_companies":"BillBlock Media Josephson Entertainment QED International","dirty_grandpa":"Theatrical release poster","release_dates":"January 22, 2016 (2016-01-22) (United States)|||||","Production":"The film's script was featured in the 2011 edition of the Black List, an annual listings of well received but unproduced scripts in circulation.[10] Prior to DeNiro's casting, Jeff Bridges and Michael Douglas were both considered for the starring role. [11]De Niro's casting was confirmed September 4, 2014, along with Zac Efron as his grandson.[12] On December 9, Zoey Deutch was cast as the female lead.[4] Casting calls began in November.[13] In January 2015, Adam Pally and Aubrey Plaza joined the film's cast.[9][14] Plaza has said that she was inspired by the role because it was different from the characters she normally played,[15] and was also inspired by the fact that the role let her engage in physical comedy.Principal photography began on January 5, 2015 in Atlanta, Georgia.[16][17] The cast was spotted filming in Atlanta on January 12, including Julianne Hough.[8] On January 14 and 16, Efron, De Niro, Plaza, and Deutch were spotted filming in Marietta, Georgia.[5] On January 20, De Niro, Efron, Mantzoukas, and Mulroney were filming in an ice cream truck.[18][19] On February 4, filming took place in McDonough.[20] On February 4, De Niro and Efron were spotted filming.[21] On February 9-10, filming took place at The Grand Atrium at 200 Peachtree in Atlanta.[22] Preliminary shooting of the film ended on February 13, 2015 in Hampton, Georgia.[20][23]After filming officially ended, it was again scheduled to resume from April 27 until May 5, with cast and crew filming 'Spring Break' scenes on Tybee Island, Georgia.[24] On April 27, filming resumed, with Efron preparing for his scenes.[25] On April 28, Efron was spotted filming, stepping out of a police station.[26] Later, Efron was spotted filming in Tybee Island, running in the sand at a beach.[27]On April 30, De Niro and Efron filmed stunts on a stage, whilst Plaza and Mantzoukas filmed scenes and Deutch was spotted on set.[28] On May 2, Plaza and Deutch were spotted filming.[29] On May 4, De Niro, Efron, Deutch, Plaza, and Jake Picking were all on set filming on a beach.[30] Production officially ended on May 9, 2015.[31]","produced_by":"Bill Block|Michael Simkin|Jason Barrett|Barry Josephson|","starring":"Robert De Niro|Zac Efron|Aubrey Plaza|Zoey Deutch|Julianne Hough|Dermot Mulroney|","running_time":"102 minutes[1] 109 minutes (unrated)","music_by":"Michael Andrews","edited_by":"Anne McCabe","Release":"The film was initially set for a Christmas 2015 release, but was pushed to an August 16, 2016 date.[32][33] It was then brought up to February 26, 2016, before finally being moved to January 22, 2016.[6][34]On October 29, 2015, Lionsgate released the film's first poster and trailer.[7] The first poster is a parody of the poster for Mike Nichols' 1967 film The Graduate.","written_by":"John M. Phillips","budget":"$11.5 million[2]"}