{"based_on":"Cabaret|Book  by Joe Masteroff|Music  by John Kander|Lyrics  by Fred Ebb|I Am a Camera  by John Van Druten|The Berlin Stories  by Christopher Isherwood|","country":"United States","distributed_by":"Allied Artists","screenplay_by":"Jay Allen","cabaret":"Theatrical release poster","Plot":"In 1931 Berlin, young American Sally Bowles performs at the Kit Kat Klub. A new British arrival in the city, Brian Roberts, moves into the boarding house where Sally lives. A reserved academic and writer, Brian gives English lessons to earn a living while completing his doctorate. Sally tries seducing Brian and suspects he may be gay. Brian tells Sally that on three previous occasions he has tried to have physical relationships with women, all of which failed. They become friends, and Brian witnesses Sally's anarchic, bohemian life in the last days of the German Weimar Republic. Sally and Brian become lovers despite their earlier reservations; they conclude that his previous failures with women were because they were \"the wrong three girls\".Sally befriends Maximilian von Heune, a rich playboy baron who takes her and Brian to his country estate; it becomes ambiguous which of the duo Max is seducing. After a sexual experience with Brian, Max loses interest in the two and departs for Argentina. During an argument, when Sally tells Brian that she has been having sex with Max, Brian reveals that he has as well. Brian and Sally later reconcile, and Sally reveals that Max left them money and mockingly compares the sum with what a professional prostitute gets.Sally learns that she is pregnant, but is unsure of the father. Brian offers to marry her and take her back to his university life in Cambridge. At first they celebrate their resolution to start this new life together, but after a picnic between Sally and Brian in which Brian acts distant and uninterested, Sally starts to doubt continuing with the pregnancy, and is disheartened by the vision of herself as a bored faculty wife washing dirty diapers. Ultimately she has an abortion, without informing Brian in advance. When he confronts her, she shares her fears and the two reach an understanding. Brian departs for England and Sally continues her life in Berlin, embedding herself in the Kit Kat Club, but the final shot shows men in Nazi uniforms in the front row of the club, intimating that its days are numbered.A subplot concerns Fritz Wendel (Fritz Wepper), a German Jew passing as a Christian, who is in love with Natalia Landauer (Marisa Berenson), a wealthy German Jewish heiress who holds him in contempt and suspects his motives. The worldly Sally gives advice which eventually enables Fritz to win her love. However, in order to get her parents' consent for their marriage, Fritz must reveal his true religious and ethnic background – a highly dangerous act considering what is in store for Jews under the coming Nazi regime. Even while the Nazis are not yet in power, one night some of them kill Natalia's beloved dog – a small intimation of very much worse to come.The Nazis' violent rise is a powerful, ever-present undercurrent in the film. Their progress can be tracked through the characters' changing actions and attitudes. While in the beginning of the film National Socialist members are sometimes harassed and even kicked out of the Kit Kat Klub, the final shot of the film shows the cabaret's audience is dominated by Nazi party members. The rise of the Nazis is also dramatically demonstrated in the rural beer garden scene. In a sunlit outdoor setting a boy — only his face seen — sings to a relaxed audience of all ages what at first seem innocent lyrics (\"Tomorrow Belongs To Me\") about the beauties of nature and youth. The camera shifts to show that the singer is wearing a brown Hitler Youth uniform. He lifts his hand in the Nazi salute as the accompanying music becomes strident. One by one, nearly all the adults and young people watching are caught up in the hysteria and rise to join in the singing and saluting. Max and Brian return to their car after witnessing this show of growing support for the Nazis, Brian asking Max \"Do you still think you can control them?\". Later, Brian's one-man confrontation with Nazis in the street is a brave but futile gesture, leading to nothing but his being beaten up.While he does not play a role in the main plot, the “Master of Ceremonies” (Joel Grey) serves in the role of storyteller throughout the film. His surface demeanor is one of benevolence and hospitality (\"Willkommen\"), his intermittent songs in the Kit Kat Klub are increasingly risque and pointedly mock the Nazis – especially the one where he pretends to be in love with a female ape and sings \"If you could see her through my eyes, she wouldn't look Jewish at all\".... In a scene when Sally experiences delirium, the Master of Ceremonies is seen holding her breasts – the significance of this is never explained, and it is not clear if it is memory or fantasy.Although the songs throughout the film allude to and advance the narrative, every song except \"Tomorrow Belongs to Me\" is executed in the context of a Kit Kat Klub performance. The voice heard on the radio reading the news throughout the film in German was that of Associate Producer Harold Nebenzal, whose father Seymour Nebenzahl made such notable Weimar films such as M (1931), Testament of Dr. Mabuse (1933), and Threepenny Opera (1931).","language":"English German","box_office":"$42,765,000[2]","Differences between film and stage version":"The film is significantly different from the Broadway musical. In the stage version, Sally Bowles is English (as she was in Christopher Isherwood's \"Sally Bowles\"). In the film version, she is American. The character of Cliff Bradshaw was renamed Brian Roberts and made British (as was Isherwood, upon whom the character was based) rather than American as in the stage version. The characters and plot lines involving Fritz, Natalia and Max were pulled from I Am a Camera and did not appear in the stage version of Cabaret (or in \"Sally Bowles\"), and a minor character named Max in the stage version, the owner of the Kit Kat Club, bears no relation to the character in the film. In the film, Sally is a very good singer whereas the stage version often portrays her as being untalented.Fosse cut several of the songs, leaving only those that are sung within the confines of the Kit Kat Klub, and \"Tomorrow Belongs to Me\" – sung in a beer garden. (In the stage musical, it is sung first by the cabaret boys and then at a private party.) Kander and Ebb wrote several new songs for the movie and removed others; \"Don't Tell Mama\" was replaced by \"Mein Herr\", and \"The Money Song\" (retained in an instrumental version as \"Sitting Pretty\") was replaced by \"Money, Money\". \"Mein Herr\" and \"Money, Money\", which were composed for the film version were added to performances of the stage musical alongside the original numbers. The song \"Maybe This Time\", which Sally performs at the cabaret, was not written for the film. Kander and Ebb had written it years earlier for Kaye Ballard, thus it was ineligible for an Academy Award nomination. Although \"Don't Tell Mama\" and \"Married\" were removed as performed musical numbers, both were used in the film. The former's bridge section appears as instrumental music played on Sally's gramophone; the latter is initially played on the piano in Fraulein Schneider's parlor and later heard on Sally's gramophone in a German translation (\"Heiraten\") sung by cabaret singer Greta Keller.","cinematography":"Geoffrey Unsworth","production_company":"ABC Pictures Allied Artists","directed_by":"Bob Fosse","Soundtrack":"All songs written and composed by John Kander and Fred Ebb. The following songs from the original Broadway production were omitted from the film version: \"So What?\", \"Don't Tell Mama\", \"Telephone Song\", \"Perfectly Marvelous\", \"Why Should I Wake Up?\", \"The Money Song\" (disparate from \"Money, Money\"), \"It Couldn't Please Me More\", \"Meeskite\" and \"What Would You Do?\"","release_dates":"February 13, 1972 (1972-02-13)|||||","Production":"Playwrights Jay Presson Allen and Hugh Wheeler went back to the original stories to restore the subplot about the gigolo and the Jewish heiress. They also drew on original author Christopher Isherwood's openness about his homosexuality to make the leading male character, a writer modeled on him, a bisexual who shares his bed and a male lover with Sally. Fosse decided to increase the focus on the Kit Kat Club, where Sally performs, as a metaphor for the decadence of Germany in the 1930s by eliminating all but one of the musical numbers performed outside the club. The only remaining outside number is \"Tomorrow Belongs to Me,\" a folk song rendered spontaneously by patrons at an open-air cafe in one of the film's most chilling scenes. In addition, the show's original songwriters, John Kander and Fred Ebb, wrote three new songs, \"Mein Herr,\" \"Money,\" and \"Maybe This Time.\"The new songs were all performed by the film's leading lady, Liza Minnelli (\"Money\" also featured Grey). Ironically, she had auditioned to play Sally in the original Broadway production. Some involved with the show say she was too inexperienced at the time (though she had already won Broadway's Tony Award for Best Actress in a Musical). Others have suggested she was too big a presence for the role as written on Broadway. By the time Cabaret reached the screen, however, Minnelli was a major film star, having won an Oscar nomination as the emotionally damaged college student in The Sterile Cuckoo (1969).In 1971, Bob Fosse learned through Harold Prince, director of the original Broadway production, that Cy Feuer was producing a film adaptation of Cabaret through ABC Pictures and Allied Artists. This was the first film produced in the revival of Allied Artists. Determined to direct the film, Fosse urged Feuer to hire him. Chief executives Manny Wolf and Marty Baum preferred a bigger name director such as Joseph Mankiewicz or Gene Kelly. That Fosse had directed the unsuccessful film adaptation of Sweet Charity gave Wolf and Baum pause. Feuer appealed to the studio heads, citing Fosse’s talent for staging and shooting musical numbers, adding that if inordinate attention was given to filming the book scenes at the expense of the musical numbers, the whole film could fail. Fosse was ultimately hired. Over the next months, Fosse met with previously hired writer Jay Presson Allen to discuss the screenplay. Dissatisfied with Allen's script, he hired Hugh Wheeler to rewrite and revise her work. Wheeler is referred to as a \"research consultant\" while Allen retains screenwriting credit. The final script was based less on Joe Masteroff's original book of the stage version, and more on The Berlin Stories and I Am a Camera.Fosse and Feuer traveled to Germany, where producers chose to shoot the film, in order to finish assembling the film crew. During this time, Fosse highly recommended Robert Surtees for cinematographer, but Feuer and the top executives saw Surtees’ work on Sweet Charity as one of the film’s many artistic problems. Producers eventually chose British cinematographer Geoffrey Unsworth. Designers Rolf Zehetbauer, Hans Jürgen Kiebach and Herbert Strabel served as production designers. Charlotte Flemming designed costumes. Fosse dancer Kathy Doby and John Sharpe were brought on as Fosse’s dance aides.Feuer had cast Liza Minnelli as Sally Bowles and Joel Grey (reprising his stage role) long before Fosse was attached to the project. Fosse was given the option of using Grey as Master of Ceremonies or walking away from the production. Fosse hired Michael York as Sally Bowles’ openly bisexual love interest. Several smaller roles, as well as the dancers in the film, were eventually cast in Germany.Rehearsals and filming took place entirely in Germany. For reasons of economy, indoor scenes were shot at Bavaria Film Studios in Grünwald, outside Munich. Location shooting took place in and around Munich and Berlin, and in Schleswig-Holstein and Saxony. Editing was done in Los Angeles before the eventual theatrical release in February 1972.Although the songs throughout the film allude to and advance the narrative, every song except \"Tomorrow Belongs to Me\" is executed in the context of a Kit Kat Klub performance. The voice heard on the radio reading the news throughout the film in German was that of associate producer Harold Nebenzal, whose father Seymour Nebenzahl made such notable Weimar films as M (1931), Testament of Dr. Mabuse (1933), and Threepenny Opera (1931).","produced_by":"Cy Feuer","starring":"Liza Minnelli|Michael York|Helmut Griem|Joel Grey|Fritz Wepper|Marisa Berenson|","running_time":"124 minutes","music_by":"Songs: John Kander Fred Ebb (Lyrics) Adaptation score: Ralph Burns","edited_by":"David Bretherton","Release":"The film was immediately successful at the box office. By May 1973 it had earned rentals of $4.5 million in North America and $3.5 million in other countries and reported a profit of $2,452,000.[1]The film currently holds a 97% \"Fresh\" rating on Rotten Tomatoes, with the consensus \"Great performances and evocative musical numbers help Cabaret secure its status as a stylish, socially conscious classic.\"[8]In 2013, film critic Peter Bradshaw listed Cabaret at number one on his list of \"Top 10 musicals,\" describing it as \"satanically catchy, terrifyingly seductive ... directed and choreographed with electric style by Bob Fosse ... Cabaret is drenched in the sexiest kind of cynicism and decadent despair.\"[9]Roger Ebert gave a positive review, saying: \"This is no ordinary musical. Part of its success comes because it doesn't fall for the old cliché that musicals have to make you happy. Instead of cheapening the movie version by lightening its load of despair, director Bob Fosse has gone right to the bleak heart of the material and stayed there well enough to win an Academy Award for Best Director.\" Variety says: \"The film version of the 1966 John Kander-Fred Ebb Broadway musical] Cabaret is most unusual: it is literate, bawdy, sophisticated, sensual, cynical, heart-warming, and disturbingly thought-provoking. Liza Minnelli heads a strong cast. Bob Fosse’s generally excellent direction recreates the milieu of Germany some 40 years ago.\"[10] Jamie Russel from BBC.com reviewed: \" The first musical ever to be given an X certificate, Bob Fosse's \"Cabaret\" launched Liza Minnelli into Hollywood superstardom and reinvented the musical for the Age of Aquarius.\"[11]Respected film critic Pauline Kael wrote a review applauding the film: \"A great movie musical. Taking its form from political cabaret, it's a satire of temptations. In a prodigious balancing act, Bob Fosse, the choreographer-director, keeps the period-Berlin, 1931-at a cool distance. We see the decadence as garish and sleazy; yet we also see the animal energy in it-everything seems to become sexualized. The movie does not exploit decadence; rather, it gives it its due. With Joel Grey as our devil-doll host-the master of ceremonies-and Liza Minnelli (in her first singing role on the screen) as exuberant, corruptible Sally Bowles, chasing after the life of a headliner no matter what; Minnelli has such gaiety and electricity that she becomes a star before our eyes.\"[12]Although less explicit compared to other films made in the 70s, Cabaret shocked the audience with topics that included corruption, sexual ambiguity, false dreams and Nazism. The sexually-charged, semi-controversial, kinky musical was the first one ever to be given an X rating (although later re-rated) with its numerous sexual flings and hedonistic club life. There was considerable sexual innuendo, profanity, casual sex talk (homosexual and heterosexual), some evidence of anti-Semitism, and even an abortion in the film.[13] It was also rated X in UK and later re-rated as 15+.[14]The \"Tomorrow Belongs to Me\" scene was highly controversial and potentially confused with a real Nazi anthem. John Kander and Fred Ebb were accused of anti-Semitism until the world found that both were Jews.[15] According to a November 1976 Variety article, the film was censored in West Berlin when it was first released there theatrically, with the sequence featuring the Hitler Youth singing \"Tomorrow Belongs to Me\" having been deleted. The article stated that the elimination had been made \"because of the feeling that it might stir up resentments in the audience by showing the sympathizers for the Nazi movement during the `30s.\" The sequence was restored, however, when the film was shown on West German television on 7 November 1976.[16]Another topic of discussion was the song \"If You Could See Her\", which closed with the line: \"If you could see her through my eyes, she wouldn't look Jewish at all\". The point of the song was showing anti-Semitism as it begins to run rampant in Berlin but there were a number of Jewish groups who missed the point of the lyrics.[17]The film earned a total of eight Academy Awards:It was also nominated for the Academy Award for Best Picture and the Academy Award for Best Adapted Screenplay, losing both to The Godfather. Cabaret holds the record for most Academy Awards won by a film which did not win the Academy Award for Best Picture.[18]The film also won seven British Academy Film Awards, including Best Film, Best Direction and Best Actress, as well as the Golden Globe Award for Best Motion Picture – Musical or Comedy. It won the Grand Prix of the Belgian Film Critics Association.[citation needed] The making of Cabaret is recounted in Cabaret (Music on Film) by Stephen Tropiano (Limelight Books, 2011).In 1995, Cabaret was the ninth live-action musical film selected by the Library of Congress for preservation in the United States National Film Registry as being deemed \"culturally, historically, or aesthetically significant\".Cabaret is cited on TV Guide's greatest films on TV and Video,[19] in Movieline magazine as one of the 100 Best Movies Ever.[20] It was included in FilmFour's 100 Greatest Films of All Time in number #78[21] and in San Francisco Chronicle'film critics \"Hot 100 Films of the Past\" being hailed as \"The last great musical. Liza Minnelli plays Sally Bowles, an American adrift in pre-Nazi Berlin, in Bob Fosse's stylish, near-perfect film.\"[22]David Benedict from The Observer has written about Cabaret's influence in musical films: \"Back then, musicals were already low on filmgoers' lists, so how come it was such a success? Simple: Cabaret is the musical for people who hate them. Given the vibrancy of its now iconic numbers – Liza Minnelli in bowler and black suspenders astride a bentwood chair belting out 'Mein Herr' or shimmying and shivering with pleasure over 'Money' with Joel Grey – it sounds strange to say it but one of the chief reasons why Cabaret is so popular is that it's not shot like a musical.\"[23]The film has been listed as one of the most important for Queer cinema for its depictions of homosexuality, revolutionary at the time of it release. It turned Liza Minnelli into a Gay icon. Film blogs have elected it as \"the gayest winner in the history of the Academy\".[24][25][26]The film was first released to DVD in 1998. There have been subsequent releases in 2003, 2008, and 2012. The film's international ancillary distribution rights are owned by ABC (currently part of The Walt Disney Company), while Warner Bros. (which inherited the film from Lorimar, Allied Artists' successor-in-interest) has domestic distribution rights. Today, Warner shares the film's copyright with production partner ABC. Fremantle Media (owners of UK DVD rights under license from ABC / Disney) planned a Blu-ray release of the film in 2008 or 2009, but have since announced they no longer plan to do so.In April 2012, Warner unveiled a 40th Anniversary screening of the new restoration of the film. Cabaret had been sold on a standard-definition DVD from Warner Bros. But it was unavailable in high-def or for digital presentation. The original camera negative is lost, and a surviving interpositive had a vertical scratch that ran through 1,000 feet, or 10 minutes, of one of its reels, as confirmed by Ned Price, vice president of mastering and restoration for Warner Bros. The damage apparently was caused by a piece of dirt that had rolled through the length of the reel, starting with a scene in which York's character has a confrontation with a pro-Nazi boarding house resident, and cut into the emulsion. The damaged images were digitally \"painted out\" using bits from surrounding areas but \"the difficult part was matching the grain structure so the fix was invisible\". After automated digital repair attempts failed, the 1,000 feet of damaged film was hand painted using a computer stylus.[27]","Bibliography":"Francesco Mismirigo, Cabaret, un film allemand, Université de Genève, 1984","budget":"$2,285,000[1]"}