{"country":"United States","distributed_by":"Warner Bros. Pictures","DVD release":"The DVD of the film was released on June 24, 2008 in single disc editions of DVD and Blu-ray Disc in the United States. Best Buy released a 2-disc limited edition along with the DVD and Blu-ray Disc releases. It was released on July 21, 2008 in the United Kingdom.[25] The film grossed $31,341,721 in DVD sales, bringing its total film gross to $300,414,491.[26]","Plot":"In about 10,000 BC, a tribe of hunter-gatherers called the Yagahl live in a remote mountain range in the Urals and survive by killing woolly mammoths. The camp is led by a hunter who has proven his bravery by killing a mammoth, and taking the White Spear. The people also strongly venerate an elderly woman, called Old Mother.D'Leh, a young hunter, while hunting mammoths, manages to kill one and wins the White Spear. He also wins his companion Evolet in marriage. Horse-raiders attack the camp, enslaving Evolet and several others. D'Leh and three companions rescue Evolet, but she is recaptured with two of the companions. D'Leh and Tic'Tic, the remaining companion, continue on and learn of a prophecy from a tribe they meet: whoever talks to a Smilodon that they call the \"Spear-Tooth\" will help free their people. D'Leh realizes the prophecy was about him.Several tribes agree to form a coalition to pursue the raiders. They find the ship with holding Evolet. With no means to follow the ships, they journey through a vast desert, discovering an advanced civilization similar to ancient Egypt, ruled by an enigmatic figure known as \"The Almighty\". Tic'Tic dies from injuries sustained in a fight with the guards before they can raise the alarm. The Almighty's priests believe that Evolet is destined to kill The Almighty. D'Leh starts a rebellion among the slaves.The Almighty offers Evolet and the other hunters to D'Leh in exchange for abandoning his rebellion. D'Leh feigns acceptance of the deal but throws a spear at The Almighty and kills him. During the ensuing battle, Evolet is seriously wounded, and she dies but is restored by the Old Mother sacrificing her own life. They depart for home and bid farewell to the other tribes.","language":"English","Reception":"The film received largely negative reviews from critics, stating that the movie is mainly visual and lacks a firm screenplay. Critics noted that the film is archaeologically inaccurate and contains many factual errors and anachronisms. As of December 16, 2014, the review aggregator at Rotten Tomatoes has reported that 8% of critics gave the film positive reviews, based on 145 reviews with the consensus: \"With attention strictly paid to style instead of substance, or historical accuracy, 10,000 BC is a visually impressive but narratively flimsy epic.\"[15] Metacritic reported the film had an average score of 34 out of 100, based on 29 reviews.[16]Composer Thomas Wanker won a BMI Film Music Award for his work on the film.Glenn Whipp of the Los Angeles Daily News draws numerous comparisons between 10,000 BC and other films in the prehistoric and historic film genre, especially One Million Years B.C. (1966)[17] and Apocalypto (2006).[18][19] A. O. Scott of The New York Times compared it to John Ford's film The Searchers (1956) and the animated film Ice Age (2002).[20]The film was parodied in the opening scene of Disaster Movie.[citation needed]","box_office":"$269.8 million","cinematography":"Ueli Steiger","production_company":"Legendary Pictures Centropolis Entertainment","directed_by":"Roland Emmerich","Box office performance":"Despite the critical failure, the film was a box office success. In its opening weekend, the film grossed $35.8 million in 3,410 theaters in the United States and Canada, ranking No. 1 at the box office, and grossing over $22 million more than the film in second place, College Road Trip.[21][22] As of April 29, 2008, it has grossed approximately $268.6 million worldwide – $94.6 million in the United States and Canada and $174 million in other territories[23] – including $17.2 million in Mexico, $13.1 million in Spain, $11.3 million in the United Kingdom, and $10.8 million in China. This also makes it the first film of 2008 to surpass the $200 million mark.[24]","10,000_bc":"Theatrical release poster","narrated_by":"Omar Sharif","release_dates":"March 7, 2008 (2008-03-07)|||||","Development":"The mammoths in the movie were based on elephants and fossils of mammoths, while the sabertooth cat was based on tigers and ligers (a lion/tiger hybrid).[4]The sounds made by the sabertooth cat in the movie are based on the vocalization of tigers and lions.[5]Emmerich opened casting sessions in late October 2005.[6] In February 2006, Camilla Belle and Steven Strait were announced to star in the film, with Strait as the mammoth hunter and Belle as his love.[7] Emmerich decided that casting well known actors would distract from the realistic feel of the prehistoric setting. \"If like, Jake Gyllenhaal turned up in a movie like this, everybody would be, 'What's that?' \" he explained. The casting of unknown actors also helped keep the film's budget down.[8]At the 2008 Wondercon, Emmerich mentioned the fiction of Robert E. Howard as a primary influence for the film's setting, as well as his love for Quest for Fire and the book Fingerprints of the Gods.[9]Director Roland Emmerich and composer Harald Kloser originally penned a script for 10,000 BC. When the project received the greenlight from Columbia Pictures, screenwriter John Orloff began work on a new draft of the original script. Columbia Pictures, under Sony Pictures Entertainment, dropped the project due to a busy release calendar, and Warner Bros. picked up the project in Sony's vacancy.[10] The script went through a second revision with Matthew Sand and a final revision with Robert Rodat.[7]Production began in early 2006 in South Africa and Namibia.[7] Location filming also took place in southern New Zealand[11] and Thailand. Before shooting began, the production had spent eighteen months on research and development for the computer generated imagery. Two companies recreated prehistoric animals. To cut time (it was taking sixteen hours to render a single frame) 50% of the CGI models' fur was removed, as \"it turned out half the fur looked the same\" to the director.[8]Emmerich rejected making the film in an ancient language (similar to The Passion of the Christ or Apocalypto), deciding that it would not be as emotionally engaging.[12]Dialect coach Brendan Gunn was hired by Emmerich and Kloser to create \"a half dozen\" languages for the film.[13] Gunn has stated that he collaborated informally with film lead Steven Strait to improvise what the languages would sound like.[14]In an alternate ending, the scene shifts forward many years into the future, showing Baku's retelling of the story by the camp fire. It ends with a child asking what had happened to the \"Mountains of the Gods\", and Baku responds, \"They were taken back by the sands. Lost to time, lost to man\".","produced_by":"Roland Emmerich Mark Gordon Michael Wimer","starring":"Steven Strait Camilla Belle Cliff Curtis Joel Virgel Nathanael Baring Affif Ben Badra Marco Khan Tim Barlow","running_time":"109 minutes","music_by":"Harald Kloser Thomas Wander","edited_by":"Alexander Berner","written_by":"Roland Emmerich Harald Kloser","budget":"$105 million"}