{"based_on":"Characters by Don Mancini David Kirschner (Chucky & Peachey dolls)","country":"United States","Box office and reception":"Bride of Chucky was released in North America on October 16, 1998 on 2,467 movie screens. It managed to pull in $11,830,855 on its opening weekend, with a total North American gross of $32,383,850 and another $18,288,000 internationally. Its worldwide gross was $50,671,850, making it the most financially successful Child's Play film to date, beating the original Child's Play by 6 million dollars.Critical reception was mixed. The film received overall better reviews than its 1991 predecessor, with praise directed towards the roles of the antagonists by Jennifer Tilly and Brad Dourif, as well as its dark humor and self-referential parody. However, the film disappointed some fans of the series, due to the sudden change in tone from full-fledged horror to horror-comedy and no appearance or mentioning of the character Andy Barclay from the previous three films with only a reference in a newspaper article at the beginning of the movie. The film currently holds a 44% approval rating on Rotten Tomatoes based on 34 reviews.","distributed_by":"Universal Pictures","Plot":"One month after Chucky's demise in the last film, Tiffany, a former girlfriend and accomplice of serial killer Charles Lee Ray, acquires Chucky's remains from a police compound. Believing that Ray's soul still inhabits the doll, Tiffany crudely stitches it back together and reenacts the voodoo ritual which instilled Ray inside the doll ten years ago.The incantations seemingly fail to produce results, but Chucky suddenly springs to life and kills Tiffany's Goth admirer Damien while Tiffany looks on with excitement. Later, Tiffany and Chucky have an argument because Tiffany believed that Chucky wanted to marry her. Upon learning he had no intention of doing so, Tiffany locks Chucky in a playpen, and gives him another doll in a wedding dress to make fun of him. Chucky escapes the play pen and kills Tiffany by electrocuting her. He then uses the same voodoo ritual to transfer her soul into the bride doll so she could feel what he went through as a living doll. Still intent on becoming human again, Chucky plans to retrieve the magical amulet that was buried with Ray's body, and use the bodies of Tiffany's neighbor Jesse and his girlfriend Jade as hosts for their souls.Tiffany sends Jesse a message asking him to transport the two dolls to New Jersey in exchange for money. Jesse convinces Jade to go with him. As they pack up, Jade's strict and overprotective uncle Warren plants a bag of marijuana in Jesse's van to frame him. Chucky and Tiffany set up a car airbag to launch nails into his face, then hide the body. The oblivious Jesse and Jade return and begin their trip.Outside a convenience store, they are pulled over by Officer Norton, who searches Jesse's car and finds the marijuana. As he goes back to his patrol car to report it, Chucky causes the car to explode, and Jesse and Jade flee the scene. They stop at a wedding chapel/hotel and get married. Meanwhile, Warren, still alive, tries to escape but is stabbed and killed by Chucky. While Jesse and Jade are at the hotel, a con artist couple steal Jesse's money. As the criminals have sex in their room, Tiffany throws a bottle at the mirrored ceiling. The falling shards of glass kill the two con-artists. Amazed, Chucky proposes to Tiffany.The next morning, a maid finds the corpses of the couple, and Jesse and Jade drive away with their best friend David, who knew about their plan to elope. David reveals that Jesse and Jade are the main suspects for all of the deaths. He finds Warren's body in the car and confront them. The dolls come alive and hold them hostage with guns, ordering them to keep driving. David alerts a police officer and gets hit by a passing truck. Horrified, Jesse and Jade drive away with the dolls.Chucky and Tiffany reveal their plan, and direct Jesse to steal a mobile home to use as a new vehicle to evade the police. While Tiffany prepares Jade for the body-switch, Jade convinces her to turn on Chucky. A fight between Tiffany and Chucky ensues. Jade locks Tiffany into an oven, while Jesse pushes Chucky out the window. Chucky shoots at Jesse, causing the mobile home to run off the road and into a ditch. Chucky forces Jade at gunpoint to take him to his grave site, while Jesse takes Tiffany and follows them. Chucky orders Jade to open the casket and take the amulet, which she does. Jesse then appears with Tiffany and they trade hostages, but Chucky throws a knife into Jesse's back, and ties up the couple for the ritual.Before Chucky begins the incantation, Tiffany distracts Chucky, then unsuccessfully attempts to kill him. After a fight, Tiffany is stabbed in the heart and collapses. Jesse knocks Chucky into his grave, and Jade grabs Chucky's gun and shoots him to death. A private investigator arrives and witnesses the scene. The investigator contacts the police, telling them that Chucky is responsible for the murders and sends the couple on their way.As the investigator inspects Tiffany, she gives birth to a baby doll before finally dying. The baby doll then attacks the investigator and the scene cuts to black.","language":"English","box_office":"$50.7 million","cinematography":"Peter Pau","bride_of_chucky":"Theatrical release poster","directed_by":"Ronny Yu","release_dates":"October 16, 1998","produced_by":"David Kirschner Grace Gilroy Don Mancini","starring":"Jennifer Tilly Brad Dourif Katherine Heigl Nick Stabile John Ritter","running_time":"89 minutes","Sequels":"The film was followed by a sequel in 2004, Seed of Chucky and another sequel in 2013, Curse of Chucky.","music_by":"Graeme Revell","edited_by":"Randy Bricker David Wu","written_by":"Don Mancini","budget":"$25 million"}