{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Jack McGowan Sid Silvers","story_by":"Jack McGowan Sid Silvers Buddy G. DeSylva","born_to_dance":"theatrical release poster","language":"English","cinematography":"Ray June","production_company":"Metro-Goldwyn-Mayer","directed_by":"Roy Del Ruth","release_dates":"November 27, 1936 (US)","Production":"The film stars dancer Eleanor Powell and was a follow-up to her successful debut in Broadway Melody of 1936. The film co-stars James Stewart as Powell's love interest and Virginia Bruce as the film's resident femme fatale and Powell's rival. Powell's Broadway Melody co-stars Buddy Ebsen and Frances Langford return to provide comedy and musical support. Highlights of the film include a rare musical number by Stewart (which the actor later poked fun at in the That's Entertainment! retrospective), and a bombastic finale called \"Swingin' the Jinx Away\". Set amidst a pre-Second World War naval backdrop, the Depression-era \"feel good\" number (which runs nearly 10 minutes) makes topical references to the economy and political leaders (with a \"shout out\" to Cab Calloway thrown in for good measure) sung by Powell, adds in an eccentric dance routine by Ebsen, and ends in a flurry of tap dancing by Powell culminating in a patriotic salute, and finally a blast of cannon fire. This finale was also lifted in its entirety and re-used in another Powell film, I Dood It, co-starring Red Skelton. Although considered one of Powell's (and MGM's) most memorable musical numbers, and often featured in retrospectives such as That's Entertainment!, musical director Roger Edens was often quoted as being embarrassed by the segment.The film introduced the Porter standards \"You'd Be So Easy to Love\" (performed by Stewart and Marjorie Lane, dubbed for Powell) and \"I've Got You Under My Skin\" (performed by Bruce), which was nominated for the Academy Award for Best Song. It was the first film in which Stewart sang.Some of the musical numbers were recorded in stereophonic sound, making this one of the first films to utilize multi-channel technology. Rhino Records included the stereo tracks in its soundtrack album, released on CD, including Jimmy Stewart's and Marjorie Lane's performance of \"You'd Be So Easy to Love.\"[2]","produced_by":"Jack Cummings","starring":"Eleanor Powell James Stewart Virginia Bruce","running_time":"106 minutes","music_by":"Cole Porter","edited_by":"Blanche Sewell"}