{"country":"United States","distributed_by":"20th Century Fox","Plot":"After returning home from South Korea, three members of the U.S. National Karate Team set up a martial arts studio in Las Vegas. Travis has been competing at \"The Coliseum\", a brutal underground fighting arena run by Weldon, whose protégé Brakus is the owner and undefeated champion. A challenger must defeat three of its \"Gladiators\" in order to face Brakus, but Travis challenges Brakus and amused by Travis's arrogance, Weldon grants his wish.Alex's eleven-year-old son Walter begins testing for his black belt, but falls short. When his father makes an impassioned speech praising his son for his maturity, Walter cancels his babysitter. Alex insists that Walter accompany Travis to his bowling league. Travis reveals his secret to Walter, who blackmails Travis into letting him watch the fight with Brakus. Brakus pummels Travis and breaks his neck, killing him.Walter runs home and alerts his father and Tommy, and together they proceed to the dance club which serves as a front for the Coliseum. They are intercepted by Weldon, who claims that Travis left the Coliseum on his own. Tommy searches the until the police find Travis's body floating in the river along with his damaged car, the apparent result of an auto accident.Alex and Tommy return to the club and confront Brakus, who admits to killing Travis.Tommy connects with a punch that sends Brakus into a mirror, scarring his cheek. Brakus condemns Alex and his son to death, but orders Weldon's henchmen to bring Tommy back alive.At Travis's funeral, Alex and Tommy are startled by the appearance of Dae Han, Tommy's old rival from South Korea. Still owing a debt to Tommy for sparing his life, Dae Han pledges to help his friends bring Travis's killer to justice.While riding his bike home from school, Walter is tailed by a black vehicle. He returns home to warn his father and Tommy, but they come under attack by a group of armed men. After fending them off, they pack up and head out of town, seeking refuge with Tommy's Native American grandmother. They encounter Tommy's uncle James, a once-promising fighter whose career was ruined due to a clash with Brakus. Claiming to know how to defeat him, James begins to train Alex and Tommy.Their training does not last long as Weldon's henchmen track them down. James tries to intervene but is shot to death. While Tommy is forced into the waiting helicopter, Alex and the others are herded back into the house. As Weldon's men prepare to execute them and blow up the house, Walter provides a distraction which enables Alex to overpower the gunman. Tommy's grandmother prompts Alex to fire four shots to signal their deaths, at which point the thugs set fire to the gasoline trail, causing a massive explosion. After emerging from the cellar unharmed, Alex leaves Walter with his girlfriend Sue, then recruits Dae Han and his Korean teammates to storm the Coliseum and rescue Tommy.At the Coliseum, Tommy fights his way through the Gladiators, but is overmatched by Brakus. As Brakus prepares to finish him, Alex breaks into the arena, his presence giving Tommy a second wind. A barrage of kicks send Brakus to the canvas, and Tommy warns him to stay down. But Brakus does not comply, and Tommy has no choice but to break his neck.With his champion defeated, Weldon announces Tommy as the new owner of the Coliseum and invites him to say a few words to the audience. Tommy takes the microphone and declares the Coliseum closed. When Weldon protests, Alex silences him with an elbow to the face. Alex and Tommy leave the arena and turn off the lights.","In popular culture":"In 1996, the World Wrestling Federation introduced a character called \"Brakus\". The character was portrayed by German bodybuilder-turned-wrestler Achim Albrecht.","language":"English","Reception":"Best of the Best 2 was a box office flop, earning only $6,607,218.[1] It received mostly negative reviews from critics,[2] but few positive ones.[3] As a result, further sequels were not given a theatrical release. The film currently holds an 11% rating on Rotten Tomatoes.Nevertheless the movie was a great success on the VHS-to-rentals market following its theatre release, and it was this success that spawned two sequels that similarly found their niche in the direct-to-video market.Film historian Leonard Maltin gave the film a negative review, but also said, \"[it] actually improves on its lame predecessor, which appallingly wasted its top-drawer cast.\"Returning star Eric Roberts claims to have made this film to compensate for the original. In Maltin's words, \"What a considerate guy!\"","box_office":"$6,044,652","cinematography":"Fred Tammes","production_company":"The Movie Group Picture Securities Ltd.","directed_by":"Robert Radler","release_dates":"March 10, 1993 (1993-03-10)|||||","produced_by":"Phillip Rhee Peter Strauss","starring":"Eric Roberts Phillip Rhee","running_time":"101 minutes","best_of_the_best_2":"Theatrical release poster","music_by":"David Michael Frank","edited_by":"Bert Lovitt Florent Retz","written_by":"Max Strom John Allen Nelson","budget":"$7 million"}