{"based_on":"Bloodline by Sidney Sheldon","country":"United States West Germany","distributed_by":"Paramount Pictures","screenplay_by":"Laird Koenig","Plot":"Sam Roffe, President of Roffe & Sons Pharmaceuticals, dies in what appears to be a climbing accident, leaving his daughter Elizabeth (Audrey Hepburn) a billion-dollar empire. Roffe's board members see an opportunity to settle old scores, jockey for higher position, and reap lucrative profits. However, an investigation into Sam's death discloses that it was a murder and that a power struggle is going on within the company.Lead investigator Max Hornung (Gert Fröbe) informs Elizabeth of his list of suspects, which includes her closest advisers and financially strapped family members. During this time, she marries CEO Rhys Williams (Ben Gazzara), but he, too, is identified by Hornung as a suspect. As president, Elizabeth follows her father's wishes and refuses to let shares of Roffe & Sons sell on the world market. Her choice prevents the board members from selling their shares as the company's by-laws prohibit it until all board members agree; on the other hand, her death would allow for a unanimous decision.After several attempts on her life, an international chase across Europe ensues. Hornung is able to connect these murder attempts to a series of homicides of prostitutes, which have been recorded on snuff films using Roffe film stock with a witness in a black Gucci leather coat (several suspects are linked to this coat).Elizabeth returns to her father's villa in Sardinia during a scirocco for protection from the unseen murderer, who sets her house on fire after she begins destroying objects and shouting, \"Now try to make it look like an accident!\" Williams and one of the shareholders, Sir Alec Nichols (James Mason), both show up to save her, but Hornung figures out that Nichols is the killer and shoots him before he can murder Elizabeth in a symbolic snuff film.","language":"English","bloodline":"Theatrical release poster","box_office":"$8,218,695","cinematography":"Freddie Young","directed_by":"Terence Young","release_dates":"June 29, 1979","produced_by":"Sidney Beckerman|Richard McWhorter|David V. Picker|","starring":"Audrey Hepburn|Ben Gazzara|James Mason|Romy Schneider|Omar Sharif|Irene Papas|","running_time":"116 min.","music_by":"Ennio Morricone","edited_by":"Bud Molin","budget":"$12,000,000"}