{"based_on":"A Walk in the Woods  by Bill Bryson","country":"United States","distributed_by":"Broad Green Pictures","screenplay_by":"Michael Arndt (credited as Rick Kerb) Bill Holderman","Plot":"Author Bill Bryson (Robert Redford), after living for ten years in Britain, returned to New Hampshire. Now in his 60s, he has been living there peacefully for the past twenty years. A television interview reports that he has published several popular books and there is speculation he will be writing more. Bryson, however, has no such plans.Bryson and his wife Catherine (Emma Thompson) attend a funeral. Not being an outgoing person, he afterwards takes a stroll on the nearby Appalachian Trail. He suddenly decides he will hike its entire length. Catherine objects, presenting all kinds of accounts about accidents and murders on the trail. She relents on condition that he not travel alone. He agrees and searches for a friend willing to join him. Everyone declines his invitation; some declare him insane. Finally, he is contacted by Stephen Katz (Nick Nolte), an old friend who offers to be a hiking companion. Despite appearances, Stephen claims to be fit enough for the challenge. Bill's wife is unhappy with his choice, but relents.Within less than a mile of their departure point, as groups of hikers overtake and pass them, they begin to grasp the difficulty of their ambition. Shortly after, a group of young children effortlessly runs by them up the trail, laughing and calling out to each other. Seeing others pass by so easily motivates them to carry on. And so they move on, day by day, making more or less pleasant acquaintances, having more or less pleasant experiences. Some time later they reach a hut, having hiked miserably through pouring rain. Carved into the log wall is an Appalachian Trail map showing the trail and their present location. They realize they have finished less than half of the trail after spending three months on it. Eventually they trek into a restricted section posted \"for experienced hikers only\". While maneuvering their heavy and awkward backpacks alongside a precipitous drop, Bill trips and pulls Stephen with him down a steep, rocky cliff. They fall about fifteen feet onto a ledge spacious enough to be comfortable, but far enough below the trail to be unable to get back up to resume the hike. They spend the night there with no clear hope of rescue. Luckily, the next day they are awakened by early morning hikers who are able to get them off the ledge.Eventually, they decide they have had enough and end their journey. When comfortably back at home, Bill, going through his mail, finds a series of post cards from Stephen that were mailed from their various stops along the trail. The last one reads: \"What's next?' Bill sits down and begins typing on his computer, \"A WALK IN THE WOODS.\"","language":"English","Reception":"A Walk in the Woods has received mixed reviews from critics. On Rotten Tomatoes, the film holds a rating of 46%, based on 146 reviews, with an average rating of 5.4/10. The site's critical consensus reads, \"Amiable yet less compelling than any road trip movie starring Robert Redford and Nick Nolte should be, A Walk in the Woods is ultimately a bit too pedestrian.\"[16] On Metacritic, the film has a score of 51 out of 100, based on 30 critics, indicating \"mixed or average reviews\".[17] On CinemaScore, audiences gave the film an average grade of \"B\" on an A+ to F scale.[18]","box_office":"$36 million[3]","cinematography":"John Bailey","production_company":"Route One Films Wildwood Enterprises","directed_by":"Ken Kwapis","a_walk_in_the_woods":"Theatrical release poster","release_dates":"January 23, 2015 (2015-01-23) (Sundance Film Festival)|September 2, 2015 (2015-09-02) (United States)||||","Production":"In 2005, Robert Redford announced,[5] and later confirmed,[6] that he would star in and produce a film adaptation of Bryson's book, and that he would play Bryson. He had also hoped that his erstwhile co-star and friend, Paul Newman, would team up with him to play the role of Katz, although he jokingly expressed doubt as to whether the health-conscious Newman would consider putting on enough weight to accurately portray the rotund Katz (Newman, however, retired from acting in May 2007 and died in 2008).In February 2007, Chris Columbus, director of Home Alone and the first two Harry Potter films, was reported to have agreed to direct the adaptation.[7] However, in January 2008, The Hollywood Reporter, while noting that the script was delayed due to the Hollywood writers' strike, reported that Barry Levinson, the Academy Award–winning director of Rain Man, was in talks to direct.[6]Redford said of the project:It'll be fun. I don't know when I've read a book that I laughed so loud. Also, it's a chance to take a look at the country ... The backdrop is pretty terrific, if you stop to think of all the visuals that are possible as they go along that trail.[8]In February 2012, it was reported that novelist Richard Russo, during a speech at Union College, confirmed that he was working on the screenplay.[9]By November 2013, Nick Nolte had been cast to costar as Katz. Larry Charles (of Borat and Brüno) was briefly attached as director,[10][11] but eventually the job went to Ken Kwapis, whose most recent film was Big Miracle and who was a key figure on the U.S. television series The Office. The screenplay was by Michael Arndt, credited as Rick Kerb, and Bill Holderman, who is a producer at Redford's Wildwood Enterprises. Shooting began in spring 2014. The movie was largely filmed at Amicalola Falls State Park, in Dawsonville, Georgia, including scenes at The Lodge at Amicalola Falls.Principal photography of the film began on May 5, 2014, in Los Angeles.[12][13]","produced_by":"Robert Redford Bill Holderman Chip Diggins","starring":"Robert Redford Nick Nolte Emma Thompson","running_time":"102 minutes[1]","music_by":"Nathan Larson","edited_by":"Carol Littleton Julie Garces","Release":"The film premiered at the Sundance Film Festival on January 23, 2015.[14] Shortly after, Broad Green Pictures acquired distribution rights to the film,[15] and gave it a wide theatrical release starting September 2, 2015.[4]","budget":"$8 million[2]"}