{"country":"United States","distributed_by":"Entendre Films Radical Media Red Envelope Entertainment Third Eye Motion Picture First Run Features","language":"English","Reception":"Crude has been reviewed in the New York Times,[8] in LA Weekly,[9] AlterNet,[10] and by Howard Zinn.[11]As of 23 March 2010, the movie review aggregator Rotten Tomatoes gave Crude a 95% \"fresh\" rating.","Synopsis":"The film follows the progress during 2006 and 2007 of a $27 billion legal case brought against the Chevron Corporation following the drilling of the Lago Agrio oil field, a case described by activists as an “Amazon Chernobyl”.[2]The plaintiffs of the class action lawsuit are 30,000 Ecuadorians living in the Amazonian rainforest who claim their ancestral homeland has been polluted by the oil industry. In addition to the legal struggle, Crude shows interviews from representatives of the plaintiffs and defendants of the class action lawsuit, and explores the influence of media support such as Vanity Fair, celebrity activism including support from musical artist Sting and his wife Trudie Styler, the power of multinational corporations, the shifting power in Ecuadorian politics, and rapidly disappearing indigenous cultures explored in the movie.The film ends with a prediction the lawsuit will not be resolved for another decade or so unless an out of court settlement is arranged.","crude":"Film still","cinematography":"Pocho Alvarez Joe Berlinger Michael Bonfiglio Juan Diego Pérez","directed_by":"Joe Berlinger","release_dates":"January 18, 2009 (2009-01-18) (Sundance)|||||","produced_by":"Joe Berlinger Michael Bonfiglio J.R. DeLeon Richard Stratton","running_time":"100 minutes","music_by":"Wendy Blackstone","Subpoena of footage":"Chevron noted that a scene in the film Crude presented at the Sundance Film Festival, showed an environmental scientist present at a legal strategy meeting of plaintiffs’ lawyers; that same scientist was later appointed by the Ecuadorian court as an ostensibly impartial expert to write a report on technical issues. However, the scene was cut from the theatrical release; Chevron lawyers wanted to know what other potentially compromising scenes were left out by Berlinger. On May 6, 2010 federal judge Lewis Kaplan sided with a petition submitted by Chevron and ruled that Berlinger turn over more than 600 hours of original footage created during the film's production. Chevron had sought to subpoena the footage as part of the ongoing lawsuit discussed in the film. Berlinger's legal team has maintained that the footage is protected by reporters' privilege and appealed the court's decision.[3]In his appeal, Berlinger noted that he was a highly awarded and respected independent filmmaker, that he was independent of Donziger, and argued that he had in fact gone to great lengths to make Crude a balanced portrayal.[4] Beringer acknowledged that he had “tweaked” some scenes at Donziger’s request.[5] The scene showing the environmental scientist at the legal strategy session had been cut from the theatrical release (but not the online version for Netflix) after one of the plaintiff lawyers objected to Berlinger that showing the scene was “so serious we could lose everything.” The US 2nd Circuit Court of Appeals narrowed the scope slightly (Berlinger had to turn over 500 hours of outtakes, rather than 600), but in 2011 upheld the lower court ruling against Berlinger, Judge Pierre Leval writing for the court: “Those who do not retain independence as to what they will publish but are subservient to the objectives of others who have a stake in what will be published have either a weaker privilege or none at all,” [6]The evidence provided by the film outtakes played an important role in Chevron obtaining a 2014 US court ruling that the American lawyers for the plaintiffs had used fraud and corruption in obtaining the $19 billion Ecuadorian court judgment against Chevron.[7]","edited_by":"Alyse Ardell Spiegel","Release":"Crude premiered on January 18, 2009 at the Sundance Film Festival and had its theatrical premiere on September 9, 2009, at the IFC Center in New York City.[12]"}