{"country":"United Kingdom United States","distributed_by":"Savoy Pictures (USA) Rank Organisation (International)","Plot":"Richard Jacks (Tim Daly) is a perfumer fed up working at a major fragrance company, where he is the butt of jokes with many employees. His projects are failures and the chief executive (Polly Bergen) is thinking of replacing him with a woman. After his great-grandfather dies, Jacks attends the will reading. Whilst everyone else receives houses, money and boats, Jacks receives nothing but notes from scientific experiments. He discovers that his ancestor was Dr. Henry Jekyll. Jacks becomes fascinated about the duality of man. He attempts to refine Jekyll's formula that separates good and evil. Realizing that his ancestor's formula increased male aggression, Jacks decides to add more estrogen to the mixture in the hope that it will prove less dangerous.Monitoring his vital stats after ingesting the formula, he gives up and attends a job interview. Although everything appears normal at first, Jacks' voice begins to crack, his nails grow longer, and the hairs on his arms recede into his skin. Jacks then feels a strange sensation in his groin area and watches in horror as his manhood disappears. Still in denial, Jacks tries to continue the interview until he is informed that his hair has grown. Jacks tries to leave, but starts to develop breasts. Embarrassed, Jacks flees back to the lab, leaving his interviewer speechless. Back in his office, the final stages of the transformation into a woman take place.The new female alter-ego names herself Helen Hyde (Sean Young) and introduces herself as Jacks's new assistant. Helen quickly develops a personality independent of her creator (embracing womanhood to its fullest) and is actually quite likeable: she rewrites Jacks's reports, is kind to his secretary, and lovingly flirts with his superiors. Over the next few days she rewards herself with a shopping spree and befriends Jacks' fiancee, Sarah (Lysette Anthony), but has Sarah move out of Jacks' apartment so she can have it for herself. Hyde is happy with her new identity but soon transforms back into Jacks.The next day, after several comments from colleagues, Jacks realizes that Helen was real but is unable to access any of her memories. Nonetheless, he feels invigorated and invites Sarah to his place for a romantic meal in order to make up for past transgressions. Everything appears to be going well until he realizes he is again transforming into Helen, causing Sarah to flee. His great-grandfather's formula has caused his genes to become unstable. Hyde becomes resentful at having to share a body. She starts taking advantage of her creator's absence by sleeping around the office in order to gain the upper hand—even going as far as to have sex with a man. Just when Hyde is about to have sex with Jacks' boss, she starts changing back into Jacks and hides in the bathroom. A horrified Jacks escapes via a nearby window.Hyde is named his superior at work, disfiguring a colleague (Jeremy Piven), and stealing his ideas. As Hyde grows in influence and power, she sets her sights on displacing the CEO of the company, becoming the first woman there ever to rise through the ranks. Jacks tries to retaliate by subverting Hyde's authority, which causes her to declare war on her creator.To stop her, Jacks handcuffs himself to the bed, only to be horrified as Sarah walks in and finds his closet to be full of lingerie. This leads Sarah to believe that he and Hyde are having an affair. It is only after Sarah leaves that Jacks transforms into Hyde once again.Angered at Jacks' attempt to expose the truth, Hyde proceeds to burn all of his grandfather's documents. She warns Jacks via a video of her intentions to take over completely. He then realizes that he is actually starting to spend more time as Hyde than himself and that he has to come up with a plan before he disappears completely.Jacks tries to humiliate Hyde in front of her superiors by stripping naked and writing obscenities all over his body, hoping that they will walk in on her after she takes over. Hyde manages to outsmart him by delaying the change, causing his plan to backfire and Jacks to be fired. He turns to Sarah for help, but is rejected because of his supposed affair with Hyde.Sarah is convinced by seeing CCTV footage from the initial transformation. Jacks comes up with a formula that would effectively destroy the Hyde part of himself, but he must consume it as Hyde within a certain time frame before Hyde's DNA can fuse forever. After he transforms, Sarah attempts to inject her with the formula but fails—injecting only about 20% of it, causing random body parts to spontaneously transform between male and female. A fire breaks out in the apartment and Hyde escapes.At the launch of a perfume she \"invented\" (it was exactly the same as a scent Jacks had come up with but was initially rejected by the sexist executive), Hyde realizes that she's still in Jack's clothing. Hyde takes a guest's dress. As she mingles, the effects of the formula cause her to temporarily grow stubble; her breasts also disappear and reappear. Sarah, who sneaked into the party, hides in a podium and waits until the promotion video starts before injecting the rest of the formula into Hyde, who begins transforming back into Jacks for good.A relieved Jacks realizes it's over but sees that he's now standing in a room full of colleagues wearing a dress. He makes a speech about the only way he could understand a woman was to become one. One of those Helen slept with subtly asks him to keep it quiet as he removes the undergarments Helen also stole from the guest, commenting \"Helen and her damn thongs\".","language":"English","Reception":"Reviews of the film were generally negative. The storyline was heavily criticized as being unrealistic, predictable, and relying too much on crude and sexual humour to get its point across. The transformation sequences were also viewed as unconvincing and laughable. However, the film did garner a small cult following upon being released on home video. At the time of writing, the film has a 14% \"rotten\" rating on Rotten Tomatoes.Despite some favorable feedback, the film was nominated for three Razzie Awards including Worst Actress for Sean Young, Worst Remake or Sequel and Worst Screen Couple for Daly and Young, despite the obvious fact that they don't appear on screen at the same time. \"At an age when she should be hitting her stride,\" wrote film critic Mick LaSalle, \"she is already parodying herself -- parodying her public image, of all things, not her screen image...It's just possible that schlock is Young's natural element and roles like this her true calling\".[1] Hugo Davenport in the Daily Telegraph dismissed the film: \"Apart from being a travesty of Stevenson, it is so crass, witless and misogynistic that it makes Confessions of a Window Cleaner look like Dostoevsky\".[2]A review from The Austin Chronicle summarized the film by saying, \"Overall, this PG-13 bore is neither crass enough nor intelligent enough to hold anyone's attention.\" [3]","box_office":"$3,039,634 (USA and UK)","dr._jekyll_and_ms._hyde":"Dr. Jekyll and Ms. Hyde DVD Cover Art","cinematography":"Tom Priestley Jr.","directed_by":"David Price","Home Media":"After its theatrical run, HBO released the film onto VHS and Laserdisc, then in 2004 onto DVD.","release_dates":"August 25, 1995 (1995-08-25)|||||","produced_by":"Frank K. Isaac Robert Shapiro","starring":"Sean Young Timothy Daly Lysette Anthony Harvey Fierstein Stephen Tobolowsky and Jeremy Piven","running_time":"90 minutes","music_by":"Mark McKenzie","edited_by":"Tony Lombardo","written_by":"David Price (story and screenplay) Tim John Oliver Butcher (screenplay)","budget":"$8 million"}