{"based_on":"Blackboard Jungle  by Evan Hunter","Cast":"Cast notes","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Richard Dadier (Glenn Ford) is a new teacher at North Manual High School, an inner-city school of diverse ethnic backgrounds where many of the pupils, led by student Gregory Miller (Sidney Poitier), frequently engage in anti-social behavior. Dadier makes various attempts to engage the students' interest in education, challenging both the school staff and the pupils. He is subjected to violence as well as duplicitous schemes; he first suspects Miller, but later realizes that Artie West (Vic Morrow) is the perpetrator, and challenges him in a tense classroom showdown involving a switchblade knife.","language":"English","box_office":"$8,144,000[1]","Home video":"The film was released on DVD in North America on May 10, 2005 by Warner Home Video.","cinematography":"Russell Harlan, ASC","directed_by":"Richard Brooks","blackboard_jungle":"theatrical release poster","Awards and honors":"1955 Academy Award Nominations:In 2010, Turner Classic Movies (TCM) listed the soundtrack of the movie on its list of the Top 15 Most Influential Movie Soundtracks of all time. TCM described the impact and the influence of the movie:MGM brought Hollywood into the rock'n'roll era with BLACKBOARD JUNGLE. In search of the kind of music teens like the film's potential delinquents were listening to, director Richard Brooks borrowed a few records from star Glenn Ford's son Peter. When he heard Bill Haley and his Comets perform 'Rock Around the Clock,' he found the perfect theme song -- the first rock song ever used in a Hollywood feature. Teens flocked to the film, dancing in theatre aisles as the song played over the opening credits. Parents may have been shocked by such uninhibited behavior, but things got worse when screenings also inspired violence and vandalism around the world. Thanks to BLACKBOARD JUNGLE, the song hit number one on the Billboard charts, eventually selling 25 million copies and becoming what Dick Clark called 'The National Anthem of Rock’n’ Roll.'[3]","References":"NotesSources","release_dates":"March 19, 1955 (1955-03-19)|||||","Box office":"According to MGM records the film earned $5,292,000 in the US and Canada and $2,852,000 elsewhere resulting in a profit of $4,392,000.[1]","produced_by":"Pandro S. Berman","starring":"Glenn Ford Anne Francis Louis Calhern Sidney Poitier","running_time":"101 minutes","Cultural impact":"The film marked the rock and roll revolution by featuring Bill Haley & His Comets' \"Rock Around the Clock\",[4] initially a B-side, over the film's opening credits (with a lengthy drum solo introduction, unlike the originally released single), as well as in the first scene, in an instrumental version in the middle of the film, and at the close of the movie, establishing that song as an instant hit. The record had been released the previous year, gaining only limited sales. But, popularized by its use in the film, \"Rock Around the Clock\" reached number one on the Billboard charts, and remained there for eight weeks.In some theaters, when the film was in first release, the song was not heard at all at the beginning of the film because rock and roll was considered a bad influence. Despite this, other instances of the song were not cut.The music led to a large teenage audience for the film, and their exuberant response to it sometimes overflowed into violence and vandalism at screenings.[5] In this sense, the film has been seen as marking the start of a period of visible teenage rebellion in the latter half of the 20th century.The film marked[citation needed] a watershed in the United Kingdom and was originally refused a cinema certificate before being passed with heavy cuts. When shown at a South London Cinema in Elephant and Castle in 1956 the teenage Teddy Boy audience began to riot, tearing up seats and dancing in the aisles.[6] After that, riots took place around the country wherever the film was shown.[7] In 2007, the Journal of Criminal Justice and Popular Culture published an article that analyzed the film's connection to crime theories and juvenile delinquency.[8]In March 2005, the 50th anniversary of the release of the film and the subsequent upsurge in popularity of rock and roll, was marked by a series of \"Rock Is Fifty\" celebrations in Los Angeles and New York City, involving the surviving members of the original Bill Haley & His Comets.[clarification needed]","music_by":"Max C. Freedman, Jimmy DeKnight (song \"Rock Around the Clock\") (uncredited), Willis Holman (song “Blackboard Jungle”), Jenny Lou Carson (song \"Let Me Go, Lover!\" (uncredited)","edited_by":"Ferris Webster","written_by":"Richard Brooks","budget":"$1,168,000[1]"}