{"Cast":"Co-writer Charles McKeown plays Harvey Lime, Sam's co-worker. Director Terry Gilliam makes a cameo appearance as the smoking man at Shang-ri La Towers, while his daughter Holly Gilliam portrays Jack Lint's daughter, Holly Lint.[19] Other cast members include Jim Broadbent as Dr. Louis Jaffe, Mrs. Lowry's plastic surgeon, Barbara Hicks as Mrs. Alma Terrain, Kathryn Pogson as her daughter Shirley, Bryan Pringle as the waiter Spiro, Brian Miller as Mr. Archibald Buttle, Sheila Reid as Mrs. Veronica Buttle, Derrick O'Connor as Spoor's partner Dowser, Derek Deadman and Nigel Planer as Bill and Charlie (workers seen repairing Buttle's ceiling), Gorden Kaye as the MOI Lobby Porter, Jack Purvis as Dr. Chapman, Elizabeth Spender as Alison \"Barbara\" Lint, Myrtle Devenish as the typist in Jack's office and Roger Ashton-Griffiths as the priest.","country":"United Kingdom|United States[discuss]|","distributed_by":"20th Century Fox (Int.)[2] Universal Pictures (US)","Critical response":"The film has a 98% on the Rotten Tomatoes Tomatometer, with 44 out of 45 reviewers giving positive reviews. It has received a score of 88 on Metacritic, based on 12 reviews.[41]Chicago Sun Times film critic Roger Ebert gave the film 2 out of 4 stars, claiming the film was \"hard to follow\", but displayed an affinity to being \"reminded of a Chaplin film, Modern Times, and reminded, too, that in Chaplin economy and simplicity were virtues, not the enemy.\"[42]Los Angeles Times critic Kenneth Turan described the film as \"the most potent piece of satiric political cinema since Dr. Strangelove\".[13] Janet Maslin of The New York Times was very positive towards the film upon its release, stating \"Terry Gilliam's Brazil, a jaunty, wittily observed vision of an extremely bleak future, is a superb example of the power of comedy to underscore serious ideas, even solemn ones.\"[43]In 2004, Total Film named Brazil the 20th greatest British movie of all time. In 2005, Time film reviewers Richard Corliss and Richard Schickel named Brazil in an unordered list of the 100 best films of all time. In 2006, Channel 4 voted Brazil one of the \"50 Films to See Before You Die\", shortly before its broadcast on FilmFour. The film also ranks at number 83 in Empire magazine's list of the 500 Greatest Films of All Time.[44]Wired ranked Brazil number 5 in its list of the top 20 sci-fi movies.[45] Entertainment Weekly listed Brazil as the sixth best science-fiction piece of media released since 1982.[46] The magazine also ranked the film No. 13 on their list of \"The Top 50 Cult Films\".[47]The film was nominated for two Academy Awards; for Original Screenplay and Best Art Direction (Norman Garwood, Maggie Gray)[48] According to Gilliam in an interview with Clive James in his online programme Talking in the Library, to his surprise Brazil is apparently a favourite film of the far right in America.[49]","brazil":"Theatrical release poster","Plot":"Sam Lowry (Jonathan Pryce) is a low-level government employee who frequently daydreams of saving a damsel in distress. When a fly gets jammed in a printer and results in the incarceration and accidental death during interrogation of cobbler Archibald Buttle – instead of renegade air conditioning specialist and suspected terrorist Archibald Tuttle – Sam is assigned the task of rectifying the error. Visiting Buttle's widow, Sam encounters their neighbour Jill Layton (Kim Greist), and is astonished to see that she resembles the woman from his recurring dreams. Jill is trying to help Mrs. Buttle determine what happened to her husband, but her efforts are obstructed by bureaucracy. Unknown to her, she is now considered a terrorist accomplice of Tuttle for attempting to report the mistake of Buttle's arrest to a government which would rather dispose of all evidence and witnesses than admit its error. Sam approaches Jill, but she avoids giving him full details, worried the government will track her down.During this time, Sam comes in contact with Tuttle (Robert De Niro), who once worked for Central Services but left due to his dislike of the tedious and repetitive paperwork. Tuttle helps Sam deal with two Central Services workers, Spoor (Bob Hoskins) and Dowser (Derrick O'Connor), who later return to demolish Sam's ducts and seize his apartment under the guise of fixing the air conditioning. Sam discovers that the only way to learn about Jill is to get transferred to Information Retrieval, where he can access her classified records. He had previously turned down a promotion arranged by his mother, Ida (Katherine Helmond), who is obsessed with the rejuvenating plastic surgery of cosmetic surgeon Dr. Jaffe (Jim Broadbent). Sam retracts his refusal by speaking with Deputy Minister Mr. Helpmann (Peter Vaughan) at a party hosted by Ida. Obtaining Jill's records, Sam tracks her down before she can be arrested, then falsifies the records to fake her death, allowing her to escape pursuit. The two share a romantic night together, but are soon apprehended by the government at gunpoint. Charged with treason for abusing his new position, Sam is restrained to a chair in a large, empty cylindrical room (the interior of a power station cooling tower), to be tortured by his old friend, Jack Lint (Michael Palin). Sam learns that Jill was killed while resisting arrest.When Jack is about to begin the torture, Tuttle and other members of the resistance break into the Ministry, shooting Jack, rescuing Sam, and blowing up the Ministry building. Sam and Tuttle flee together, but Tuttle disappears amid a mass of scraps of paperwork from the destroyed building. Sam stumbles into the funeral for Ida's friend, who died following excessive cosmetic surgery; finding Ida resembling Jill and being fawned over by young men, Sam falls into the open casket and through a black void. He lands in a street from his daydreams, and attempts to escape police and monsters by climbing a pile of flex-ducts. Opening a door, he passes through it and is surprised to find himself in a trailer driven by Jill. The two leave the city together. However, this \"happy ending\" is a product of Sam's delusions: he is still strapped to the chair. Realising that Sam has descended into blissful insanity, Jack and Mr. Helpmann declare him a lost cause and leave the room. Sam remains in the chair, smiling and singing \"Brazil\".","language":"English","box_office":"$9.9 million (North America)[8]","cinematography":"Roger Pratt","directed_by":"Terry Gilliam","Releases":"The film was produced by Arnon Milchan's company Embassy International Pictures (not to be confused with Joseph E. Levine's Embassy Pictures). Gilliam's original cut of the film is 142 minutes long and ends on a dark note. This version was released internationally outside the US by 20th Century Fox.US distribution was handled by Universal. Universal executives thought the ending tested poorly, and Universal chairman Sid Sheinberg insisted on dramatically re-editing the film to give it a happy ending, cutting out the reveal that it was all in Sam's mind, a decision that Gilliam resisted vigorously.[37] As with the cult science fiction film Blade Runner (1982), which had been released three years earlier, a version of Brazil was created by the movie studio with a more consumer-friendly ending. After a lengthy delay with no sign of the film being released, Gilliam took out a full-page ad in the trade magazine Variety urging Sheinberg to release Brazil in its intended version. Gilliam soon conducted private screenings of Brazil (without the studio's approval) for film schools and local critics. On the same night Universal's award contender Out of Africa premiered in New York, Brazil was awarded the Los Angeles Film Critics Association award for \"Best Picture\".[38] This prompted Universal to finally agree to release a modified 132-minute version supervised by Gilliam, in 1985.[13][39]Brazil has been released four times by the Criterion Collection, first as a five-disc LaserDisc box set in 1996, a 3-disc DVD box set in 1999 and 2006, a single-disc DVD in 2006, and a 2-disc Blu-ray set in 2012. The 3-disc box set released in 2006 looks identical in packaging to its 1999 release, albeit compatible with Widescreen TV screens.Except the single-disc version, all versions have the same special features: a 142-minute cut of the film (referred to by Gilliam as the \"fifth and final cut\"), Sheinberg's \"Love Conquers All\" cut for syndicated television, and various galleries and featurettes.A Blu-ray of the 132-minute US version of the movie was released in the US on 12 July 2011 by Universal. It contains only that version of the film and no extra features.[40]","production_companies":"Embassy International Pictures[1]:1 Brazil Productions[2][3][4]","release_dates":"20 February 1985 (1985-02-20) (France)|22 February 1985 (1985-02-22) (United Kingdom)||||","Production":"Gilliam developed the story and wrote the first draft of the screenplay with Charles Alverson, who was paid for his work but was ultimately uncredited in the final film. For nearly 20 years, Gilliam denied that Alverson had made any material contribution to the script. But then when the first draft was published and original in-progress documents emerged from Alverson's files, Gilliam begrudgingly changed his story. This was too late for either credit on the film or a listing on the failed Oscar nomination for Alverson. He has said that he would not have minded the Oscar nomination, even though he didn’t think much of the script or the finished film.[22] Gilliam, McKeown, and Stoppard collaborated on further drafts. Brazil was developed under the titles The Ministry and 1984 ½, the latter a nod not only to Orwell's original 1984 but also to 8½ by Federico Fellini, a director whom Gilliam often cites as one of the defining influences on his visual style when directing.[23] During the film's production, other working titles floated about, including The Ministry of Torture, How I Learned to Live with the System – So Far,[24] and So That's Why the Bourgeoisie Sucks,[25] before settling with Brazil relating to the name of its escapist signature tune.Gilliam sometimes refers to this film as the second in his \"Trilogy of Imagination\" films, starting with Time Bandits (1981) and ending with The Adventures of Baron Munchausen (1989).[13] All are about the \"craziness of our awkwardly ordered society and the desire to escape it through whatever means possible.\"[13] All three movies focus on these struggles and attempts to escape them through imagination—Time Bandits, through the eyes of a child, Brazil, through the eyes of a man in his thirties, and Munchausen, through the eyes of an elderly man. In 2013, Gilliam also called Brazil the first instalment of a dystopian satire trilogy it forms with 1995's 12 Monkeys and 2013's The Zero Theorem.[26]Gilliam has stated that Brazil was inspired by George Orwell's Nineteen Eighty-Four—which he has admitted never having read[19]—but is written from a contemporary perspective rather than looking to the future as Orwell did. In Gilliam's words, his film was \"the Nineteen Eighty-Four for 1984.\" Critics and analysts have pointed out many similarities and differences between the two, an example being that contrary to Winston Smith, Sam Lowry's spirit did not capitulate as he sank into complete catatonia.[11][27]Michael Atkinson of The Village Voice wrote, \"Gilliam understood that all futuristic films end up quaintly evoking the naïve past in which they were made, and turned the principle into a coherent comic aesthetic.\"[28] In the second version of the script, Gilliam and Alverson described the film's setting like this: \"It is neither future nor past, and yet a bit of each. It is neither East nor West, but could be Belgrade or Scunthorpe on a drizzly day in February. Or Cicero, Illinois, seen through the bottom of a beer bottle.\"[29]The result has been dubbed \"retro-futurism\" by fellow filmmakers Jean-Pierre Jeunet and Marc Caro.[28] Generally called \"sci-fi noir,\" it is \"a view of what the 1980s might have looked like as viewed from the perspective of a 1940s filmmaker.\"[30] It is an eclectic yet coherent mixture of styles and production designs derived from Fritz Lang's films (particularly Metropolis and M) or film noir pictures starring Humphrey Bogart: \"On the other hand, Sam's reality has a '40s noir feel. Some sequences are shot to recall images of Humphrey Bogart on the hunt and one character (Harvey Lime) may be named as an homage to The Third Man's Harry Lime.\"[30] A number of reviewers also saw a distinct influence of German Expressionism, as the 1920s seminal, more nightmarish, predecessor to 1940s film noir, in general in how Gilliam made cunning use of lighting and set designs.[31][32] A brief sequence towards the end, in which resistance fighters flee from government soldiers on the steps of the Ministry, pays homage to the Odessa Steps sequence in Eisenstein's Battleship Potemkin (1925).[19]This eclectic virtuosity and attention to detail in lighting and set design was coupled with Gilliam's trademark obsession for very wide lenses and tilted camera angles; going unusually wide for an audience used to mainstream Hollywood productions, Gilliam made the film's wide-angle shots with 14mm (Zeiss), 11mm, and 9.8mm (Kinoptik) lenses, the latter being a recent technological innovation at the time as one of the first lenses of that short a focal length that did not fish-eye.[33] In fact, over the years, the 14mm lens has become informally known as \"The Gilliam\" among film-makers due to the director's frequent use of it since Brazil.[34]The reference to form 27B/6, without which no work can be done by repairmen of the Department of Public Works, is a reference to George Orwell, who lived at Canonbury Square Apartment 27B, Floor 6, while writing parts of Nineteen Eighty-Four.[35][36]Ary Barroso's 1939 song \"Aquarela do Brasil\" (\"Watercolor of Brazil\", often simply \"Brazil\") in a version specifically performed by Geoff Muldaur is the leitmotif of the movie, although other background music is also used. Michael Kamen, who scored the film, originally recorded \"Brazil\" with vocals by Kate Bush. This recording was not included in the actual film or the original soundtrack release; however, it has been subsequently released on re-pressings of the soundtrack.","produced_by":"Arnon Milchan","starring":"Jonathan Pryce|Robert De Niro|Katherine Helmond|Ian Holm|Bob Hoskins|Michael Palin|Ian Richardson|Peter Vaughan|Kim Greist|","running_time":"142 minutes[5]","Influence":"British National Cinema by Sarah Street describes the film as a \"fantasy/satire on bureaucratic society\" while John Scalzi's Rough Guide to Sci-Fi Movies describes it as a \"dystopian satire\".Other films that drew inspiration from Brazil's cinematography, art design, and/or overall atmosphere include Jean-Pierre Jeunet's and Marc Caro's films Delicatessen (1991) and The City of Lost Children (1995),[53] the Coen brothers' The Hudsucker Proxy (1994),[54][55] and Alex Proyas' Dark City (1998).[56][57]Cinematographer Roger Pratt worked on Tim Burton's Batman, the production design and lighting style of which have been compared to Brazil.[58] Burton and production designer Anton Furst studied Brazil as a reference for the look of their film.[59]The technology of Brazil inspired the design of Max Cohen's apartment in the film Pi.[60] Brazil also served as an inspiration for the film Sucker Punch (2011).[61]Brazil has also been recognised as an inspiration for writers and artists of the steampunk sub-culture.[62][63][64]The dystopian premise of 2016's We Happy Few video game is largely inspired by Brazil.[65][66]","music_by":"Michael Kamen","External links":"","edited_by":"Julian Doyle","written_by":"Terry Gilliam|Tom Stoppard|Charles McKeown|","budget":"$15 million[7]"}