{"country":"United States","distributed_by":"Palisades Entertainment Ventura Distribution","brain_damage":"Limited edition DVD cover","Plot":"Brian begins an unwilling symbiotic relationship with a malevolent leech-like brain-eating parasite called \"Aylmer\". Aylmer secretes a highly addictive, hallucinogenic blue fluid into Brian's brain. In return for a steady supply of the fluid, Brian must seek out human victims for Aylmer, so that he can devour their brains. All the while, though, as Brian adopts a heavily secluded life in his indulgence of Aylmer's fluids, it begins to draw a rift in his relationship with his girlfriend Barbara and his brother.","language":"English","Reception":"In an interview with Fangoria, Henenlotter said that the film was initially ignored and disliked. When it was released on home video, it acquired a cult following, and his later films were compared to it.[3]Rotten Tomatoes, a review aggregator, reports that 70% of ten surveyed critics gave the film a positive review; the average rating is 6/10.[4] Walter Goodman of The New York Times called it a \"brainless movie\" with poor special effects and bad acting.[5] Leonard Klady of the Los Angeles Times wrote, \"It's a veritable crazy quilt of ideas that manages to engage our attention while our heads continue to dart away from the shocking images on screen.\"[6]","cinematography":"Bruce Torbet","directed_by":"Frank Henenlotter","release_dates":"April 15, 1988 (1988-04-15)|||||","produced_by":"Al Eicher Andre Blay Edgar Ievins","starring":"Rick Hearst Jennifer Lowry Gordon MacDonald","running_time":"Theatrical Cut: 84 min. Unrated Cut: 86 min.","music_by":"Matthias Donnelly Clutch Reiser Gus Russo","edited_by":"Frank Henenlotter James Y. Kwei","Release":"The film was given a limited release theatrically in the United States by Palisades Entertainment Group in 1988. It was subsequently released on VHS by Paramount Home Entertainment. Synapse Films released it on DVD in 2007.[2] This special edition release features commentary by Henenlotter and reinstates all of the excised gore footage.","written_by":"Frank Henenlotter"}