{"based_on":"The Singular Life of Albert Nobbs   by George Moore","country":"United Kingdom Ireland","distributed_by":"Lionsgate Roadside Attractions (USA) Entertainment One (UK)","screenplay_by":"Glenn Close John Banville Gabriella Prekop","story_by":"István Szabó","Plot":"Albert Nobbs (Glenn Close) is a woman living as a man in order to find work in the harsh environment of 19th-century Ireland. After living as a male for 30 years, Albert, working as a hotel waiter, is known for his extreme dedication to his job. Albert has been secretly saving all his earnings to buy a tobacco shop to gain some measure of freedom and independence.Meanwhile, recently unemployed Joe Mackins (Aaron Taylor-Johnson) arrives at the hotel to repair the boiler. Flirtatious maid Helen Dawes (Mia Wasikowska) is attracted to him, and they become lovers; however, Joe soon shows himself to be an alcoholic bully.At the time, a Mr. Hubert Page (Janet McTeer), who was tasked with painting the hotel, discovers Albert's secret, only to reveal that he is keeping the very same secret about himself.Albert visits Hubert at his home and meets Cathleen (Bronagh Gallagher), who lives with him as his wife. Albert tells Hubert the story of his life: born a bastard and abandoned by his parents, he was raised and educated in a convent before being kicked out after his mother, who had apparently been paying for Albert's care, died. One night, when he was fourteen, he was brutally gang raped and beaten by a group of men. Immediately afterwards, after hearing there is a need for waiters, he bought a suit, masquerading as a boy, and was hired. She chose to continue to work and eventually live as a man. He never reveals his birth name to Hubert—he thinks of himself solely as \"Albert\".Believing Helen may be the ideal wife to run a shop with, Albert asks her to go out with him. Helen refuses, but Joe, believing that Albert will give Helen money that could help the pair emigrate to America, encourages Helen to lead him on. Helen agrees to be with Albert, who buys Helen expensive gifts to please her. Helen is uncomfortable with Albert and the arrangement that Joe forced her to make. Albert tells Helen he wants to buy a shop, though Helen only wants to leave Ireland for America.A typhoid epidemic breaks out in Dublin, and when some staff fall ill, customers avoid the hotel, causing financial problems. Albert becomes infected but recovers, while Helen discovers she is pregnant with Joe's child. Joe is terrified, fearing he will become like his abusive father. Albert goes to Hubert's home and learns that Cathleen died, leaving Hubert devastated. As a tribute to her, Albert and Hubert don dresses Cathleen made and take a stroll on the beach. Though both at first are extremely uncomfortable, they eventually enjoy spending the day together dressed as women. They take a walk along the beach where Albert, feeling free, runs in the sand. But a stumble and fall bring him back to reality and he and Hubert return to Hubert's, change back into their men's clothing, and go back to their lives as before.Back at the hotel, Albert learns Helen is pregnant and offers to marry her. Helen refuses, saying Albert does not love her, though Albert voices his fear that Joe will abandon her and the child and go to America alone. Later that evening, when Joe and Helen get into a loud fight, Albert intervenes. Albert physically attacks Joe when he attempts to hurt Helen in a fit of rage; Joe throws Albert against a wall, hitting Albert's head. Albert returns to his room, bleeding from one ear. He dies later that night, presumably as a result of his head injury.Mrs. Baker discovers Albert's hidden money and uses it to revitalize the hotel. In the following months, Joe has gone to America and Helen has given birth to a son, Albert Joseph. Mrs. Baker makes further use of Albert's money by hiring Hubert to paint the entire hotel. Hubert sees Helen again, who breaks down and reveals that she will be separated from her son and thrown out into the street. Hubert tells her, \"We can't let that happen, can we?\", implying that he will look after her.","language":"English","Reception":"The film received mixed reviews from critics. Rotten Tomatoes gave it a rating of 56%, based on 149 reviews, with an average rating of 6/10.[11] Metacritic gave the film a 57 out of 100, with mixed or average reviews based on reviews from 42 critics.[12]","box_office":"$5.6 million[3]","cinematography":"Michael McDonough","directed_by":"Rodrigo García","release_dates":"2 September 2011 (2011-09-02) (Telluride)|||||","Production":"Close first played the titular character in a 1982 stage production and spent 15 years trying to turn it into a film.[4][6] The film almost went into production in the early 2000s, with director István Szabó, but the financing fell apart.[7] In addition to her starring role, Close is also a producer and co-writer with John Banville.[7]Production was scheduled to begin in July 2010 but was delayed until December, when Mia Wasikowska and Aaron Johnson replaced Amanda Seyfried and Orlando Bloom.[8] Filming commenced on 13 December on location in Dublin and Wicklow.[6] In July 2011, it was announced that Albert Nobbs would screen at the 2011 Toronto International Film Festival in September and the first official photos from the film were released.[9][10]","produced_by":"Glenn Close Bonnie Curtis John Goff[1]","starring":"Glenn Close|Mia Wasikowska|Aaron Johnson|Janet McTeer|Pauline Collins|Jonathan Rhys Meyers|Brendan Gleeson|Maria Doyle Kennedy|","running_time":"113 minutes","albert_nobbs":"Film poster","music_by":"Brian Byrne","edited_by":"Steven Weisberg","Release":"In the United States, the film had a limited release in December 2011, and opened at 245 locations in January 2012.[13] The film grossed a worldwide total of $5,634,828.[3]","budget":"€6,000,000[2] ($7.5m approx.)"}