{"based_on":"The Return of Superfly  by Mark Jacobson","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Steven Zaillian","american_gangster":"Theatrical release poster","Plot":"In 1968, Frank Lucas is the right-hand man of Harlem gangster Ellsworth \"Bumpy\" Johnson. When Johnson dies of a heart attack, Lucas takes control of the Harlem crime scene.After handing in almost $1 million that he found in a mobster's car, Newark detective Richie Roberts is ostracized in his precinct. After his exiled and addicted partner overdoses on a potent brand of heroin called \"Blue Magic\", Captain Lou Toback puts Roberts in charge of a task force that targets local suppliers. Lucas buys Blue Magic directly from producers in Thailand and smuggles it into the U.S. through returning Vietnam War servicemen. His low overhead allows him to eventually wholesale Blue Magic to most the dealers in the New York area. With this monopoly, Lucas expands his control to nightclubs, casinos, and prostitution. He buys a mansion for his mother and recruits his five brothers, including Huey and Turner, as lieutenants to spread his empire. During his rise to becoming Harlem's crime boss, Lucas falls in love with Eva, a Puerto Rican beauty queen.As Lucas' business prospers, he makes a point of operating quietly and dressing with a modest conservatism both as a sign of strength and to avoid attracting police attention. Also, he stays away from the drugs to avoid making hard decisions under the influence. However, Lucas violates these principles when he attends the Fight of the Century with Eva, sporting gaudy clothes that were a present by Eva; Roberts attends the fight, notices the previously unknown Lucas with even better seats than the Italian mobsters, and investigates him. Meanwhile, Lucas needs to deal with Lucchese mafia boss Dominic Cattano, who threatens to destroy Lucas' family unless he gets in on a deal, and corrupt NYPD detectives led by Nick Trupo, who attempts to extort and blackmail him to give them a cut. Lucas must also compete with local crime figure Nicky Barnes, a young gun trying to take over Harlem who has been diluting Lucas' Blue Magic and selling it under the same brand name. After the Fall of Saigon cuts off Lucas' supply, he is forced to rely on the other crime rings.Roberts' detectives witness Frank Lucas' cousin and driver shoot a woman and then use the threat of a long sentence to get him to wear a wire. The gathered information allows Roberts and his task force to identify and search one of the last planes carrying Lucas' stock, discovering Blue Magic in the coffins of dead returning servicemen. With this evidence they obtain a warrant to follow the drugs into Newark's projects and Lucas' heroin processing facility. In the ensuing shootout, Steve Lucas, Frank Lucas' young nephew who gave up a promising career for the New York Yankees to join Lucas' crime family, is killed. Meanwhile, Trupo, whose prized Shelby Mustang Lucas had destroyed, and his men break into Lucas' mansion to steal his emergency cash supply hidden under the doghouse, killing the dog. As Lucas gets ready to go after Trupo, his mother dissuades him from killing a cop, warning him that she and Eva will leave him if he does. Lucas is arrested after Roberts' team conducts a raid on the shops run by his brothers.In the police station, Lucas offers to bribe Roberts, but is rebuffed. Instead, Roberts offers Lucas a chance at a shorter jail sentence if he aids his investigation of dirty cops in the NYPD and Lucas duly provides Roberts with the names. In the end, three quarters of the New York DEA are arrested and convicted, and a distraught Trupo commits suicide. Roberts, having just passed the bar exam, defends Lucas as his first client. Lucas is sentenced to 70 years in prison, of which he serves 15 years and is released in 1991.","language":"English","Reception":"Review aggregate Rotten Tomatoes reports that 80% of critics have given the film a positive review based on 206 reviews, with a rating average of 7 out of 10, with the consensus being: \"American Gangster is a gritty and entertaining throwback to classic gangster films, with its lead performers firing on all cylinders.\"[50] Metacritic, which assigns a weighted mean score out of 100 to reviews from film critics, has a score of 76 based on 38 reviews.[51]\"Like many moviemakers [...], Mr. Scott loves his bad guy too much. And by turning Lucas into a figure who seduces instead of repels, an object of directorial fetishism and a token of black resistance, however hollow, he encourages us to submit as well. Part of this is structural and economic: blood and nihilism are always better sells than misery and hopelessness. Yet there's also a historical dimension, because when Lucas strolls down a fast-emptying Harlem street after putting a bullet into another man’s head and the camera pulls back for the long view, you are transported into the realm of myth. Once, another gunman, or the director, might have taken direct aim at Lucas. But the world belongs to gangsters now, not cowboys.\"Roger Ebert of the Chicago Sun-Times gave the film a perfect four star rating and opined, \"This is an engrossing story, told smoothly and well.\" Ebert also praised Crowe's performance, saying that his contribution to the storytelling was \"enormous\".[53] Paul Byrnes of The Sydney Morning Herald felt that American Gangster was \"one of the most intelligent gangster films in years\" and expressed that the film offers \"the spectacle of grand themes and two bigger-than-life characters played by two of the best actors in cinema.\" Concluding his review, Byrnes gave the film four out of four stars.[54] IGN's Jim \"Stax\" Vejvoda rated the film four out of five stars, praising the acting—particularly of the two protagonists, \"both dynamic presences on-screen, with neither actor outweighing the other's importance to the story\"—and declaring that despite being preceded by other gangster stories such as Scarface and The Sopranos, American Gangster managed to justify its existence with \"emphasis on the human and class elements of the story\".[55] Manohla Dargis of The New York Times strongly commended the film, opining that \"greatness hovers just outside American Gangster.\" She continued: \"It's a seductive package, crammed with all the on-screen and off-screen talent that big-studio money can buy, and filled with old soul and remixed funk that evoke the city back in the day, when heroin turned poor streets white and sometimes red.\"[52] These sentiments were echoed by Sukhdev Sandhu of The Telegraph, who asserted that the storyline was \"amazing\".[56]In comparison, some reviewers were more critical of American Gangster. Jonathan Crocker of Time Out London was polarized with the film, criticizing its aesthetics. In his review, he wrote, \"Scott's meticulous aesthetics can’t touch the urban texture and deep focus of The French Connection, The Godfather, Serpico and Prince of the City – all looming heavily in intertextual nods.\" In contrast, Crocker praised Washington's acting, writing, \"He's immense: centering every scene with tractor-beam charisma, that dangerous, easy charm hovering between a luxury smile or blazing violence.\" In conclusion, Crocker gave the film three out of five stars.[57] Similarly, Owen Gleiberman of Entertainment Weekly gave the film a 'C-' grade, expressing that American Gangster is \"never dull, but it could have used more good old-fashioned melodramatic intrigue.\" Gleiberman found Washington's performance to have \"a ghastly ingenuity\".[58] Empire's Ian Freer rated the film three stars out of five; he stated that it was \"undeniably enjoyable\" and praised the cast, but also noted that he felt that \"very little in the movie feels fresh, re-treading scenes, riffs and imagery from the whole history of crime flicks\" and that the film did not explore enough of Lucas' story and Scott's visual imagination.[59] Slant Magazine journalist Nick Schager harshly criticized the film, giving the film a one out of four stars. Schager remarked that the film was \"dumb as a rock\", and that it was \"far too convinced of its import to be any fun.\"[60] Giving American Gangster a two out of five stars, Peter Bradshaw of The Guardian was disappointed with Washington's acting, asserting, \"He doesn't seem to relax and enjoy himself in the role, or even inhabit it very satisfyingly.\" He resumed: \"He never has the menace of his dirty cop in Training Day, and we don't see anything like the transformation from street-hustler to leader in Malcolm X. That shoulder-shimmying swagger is rarely seen, and the brand-classic robes of American Gangster sit on him heavily.\"[61]In an interview with MSNBC, Lucas expressed his excitement about the film and amazement at Denzel Washington's portrayal.[62] However, Lucas admitted to several news outlets that only a small portion of the film was true,[63] and that much of it was fabricated for dramatic effect.[64] In addition, Richie Roberts criticized the film for portraying him in a custody battle while in real life he never had a child. Roberts criticized the portrayal of Lucas, describing it as \"almost noble\".[63]Sterling Johnson, Jr., a federal judge who served as a special narcotics prosecutor for the United States District Court for the Eastern District of New York and assisted the arrest and trial of Lucas, described the film as \"one percent reality and ninety-nine percent Hollywood.\" In addition, Johnson described the real life Lucas as \"illiterate, vicious, violent, and everything Denzel Washington was not.\"[65] Former DEA agents Jack Toal, Gregory Korniloff, and Louis Diaz filed a lawsuit against Universal saying that the events in the film were fictionalized and that the film defamed them and hundreds of other agents.[66] The lawsuit was eventually dismissed by US District Judge Colleen McMahon. While McMahon noted that the intertitle that appears at the end of the film, stating that Lucas' collaboration led to the arrest of many corrupt DEA agents, was \"wholly inaccurate\", in that Lucas' cooperation did not lead to the convictions, and admonished that \"It would behoove a major corporation like Universal (which is owned by a major news organization, NBC) not to put inaccurate statements at the end of popular films\", she stated that the film failed to meet legal standards of defamation because it failed to \"show a single person who is identifiable as a DEA agent\".[67]Many of Lucas' other claims, as presented in the film, have also been called into question, such as being the right-hand man of Bumpy Johnson, rising above the power of the mafia and Nicky Barnes, and that he was the mastermind behind the Golden Triangle heroin connection of the 1970s. Ron Chepesiuk, a biographer of Frank Lucas, deemed the story as a myth. Associated Press entertainment writer Frank Coyle noted that \"this mess happened partly because journalists have been relying on secondary sources removed from the actual events.\"[68]American Gangster earned various awards and nominations, in categories ranging from recognition of the film itself to its screenplay and music, to the performances of Ruby Dee and Denzel Washington. Prior to the film's release, it was observed as a candidate for the Academy Awards based on its style and the performances of its actors, including the possibility of an Academy Award for Best Director for Ridley Scott.[69] It received two Academy Award nominations—Ruby Dee was nominated for Best Supporting Actress, and Arthur Max and Beth A. Rubino (set decoration) were up for Best Art Direction.[70] At the 14th Screen Actors Guild Awards, the film received two nominations, of which Dee won the award for Outstanding Performance by a Female Actor in a Supporting Role, and the cast's overall performances earned the nomination for Outstanding Performance by a Cast.[71][72] At the 12th Satellite Awards, Pietro Scalia attained an award for Best Editing.[73]American Gangster was nominated for three Golden Globe Awards, including a nomination for Best Motion Picture – Drama.[74] At the 61st British Academy Film Awards, the film was nominated for five awards, but ultimately lost out.[75] The film was up for four Satellite Awards, winning Best Editing.[76] American Gangster was awarded Best Thriller at the 13th Empire Awards,[77] and recognized as a candidate for best film by the National Association for the Advancement of Colored People and the Broadcast Film Critics Association.[78] In addition, the film was included on 54 reviewer lists of the ten best films of 2007, three of them at the top spot.[79] Among the lists ranking American Gangster as one of the best of the year were those of The Miami Herald,[80] Rolling Stone and the Associated Press.[81][82]","box_office":"$266.5 million[1]","cinematography":"Harris Savides","production_company":"Imagine Entertainment Scott Free Productions Relativity Media","directed_by":"Ridley Scott","release_dates":"October 19, 2007 (2007-10-19) (Apollo Theater)|November 2, 2007 (2007-11-02) (United States)||||","Production":"In 2000, Universal Pictures and Imagine Entertainment purchased the rights to \"The Return of Superfly\", a New York magazine story by Mark Jacobson about the rise and fall of the 1970s heroin kingpin Frank Lucas.[3] In 2002, screenwriter Steven Zaillian brought a 170-page script to director Ridley Scott, who expressed interest in making two films from it. However, Scott did not immediately pursue the project, choosing to make Kingdom of Heaven instead. In November 2003, Universal and Imagine entered negotiations with Brian De Palma to direct Tru Blu, with a script by Zaillian based on Frank Lucas.[4][5] Zaillian interpreted the story as one of \"American business and race\", focusing the script thematically on corporate business.[6] Production was initially slated for a spring 2004 start.[4] In March 2004, the studio entered new negotiations with Antoine Fuqua to direct, as well as Denzel Washington to star in the film as Frank Lucas.[7] The following May, Benicio del Toro entered negotiations to star as Detective Richie Roberts, who brought down Lucas. Production of Tru Blu was reset to begin in early fall 2004, with the film slated for a release date of June 3, 2005.[8] In September 2004, Dania Ramirez entered negotiations to join the cast of the film, now titled American Gangster.[9]Universal Pictures reported that it greenlit American Gangster with a budget of $80 million, which escalated to $93 million, with $10 million for development costs and $3 million for the delay of the production start date. Sources close to the director insist that the budget was $93 million from the beginning. The studio also sought for American Gangster to be produced in Toronto rather than New York City to save money, but Fuqua resisted the re-location. The studio's parent company General Electric received tax credits in New York City, so production was moved to the city. The move, however, inflated the budget to $98 million. Fuqua's camp insisted that it was seeking ways to reduce the budget, but the studio contended several aspects of the project under him. The director had wanted to film a Vietnam sequence in Thailand and to cast notable names such as Ray Liotta and John C. Reilly in minor roles. To add to the studio's budgetary concerns, Fuqua was rewriting the script during the preproduction process. The director also did not have a shot-list, final locations, and supporting actors signed to initiate production.[10]Fuqua was fired on October 1, 2004, four weeks before principal photography would begin.[10] The studio cited creative differences for the director's departure.[11] After Fuqua's departure, the studio met with Peter Berg to take over directing the film, and Denzel Washington had approved of the choice.[10] Due to the search potentially escalating a budget already in the US$80 million range and the difficulty in recouping the amount based on the film's subject matter, Universal canceled production of American Gangster, citing time constraints and creative elements for its reason.[12] The cancellation cost the studio $30 million, of which $20 million went to Washington and $5 million went to del Toro due to their pay or play contracts.[10]\"When I met Frank, I really understood what I saw as the arc of the character. He wears nice clothes and drives fancy cars and all that, so if that means glorifying it I guess that's the case. But for me I was looking at the arc of the character, and he don’t look that glorious right now.\"In March 2005, American Gangster was revived as Universal and Imagine entered negotiations with Terry George to revise Zaillian's script and direct the film, which was to be financed with a target budget of US $50 million.[14] Will Smith was approached to replace Washington as Frank Lucas, though an offer would be held off until George completed his revision of the script.[15] George cut many key scenes, characters and Asian locations to reduce costs, but the project failed to progress given financial problems and Grazer feeling they \"couldn't make it right\" without the removed material.[16][17]After a meeting between Scott and Zaillian on another project, Zaillian brought the project up again with Scott, who decided he was ready to do it. Producer Brian Grazer and Imagine executive Jim Whitaker decided against pursuing George's attempt and to return to Zaillian's vision.[18] In February 2006, Ridley Scott entered talks with the studio to take over American Gangster from George, returning to Zaillian's draft as the film's basis. Washington returned to his role as Lucas, and Russell Crowe was attached to star as Roberts.[19] Crowe was drawn to the project based on his previous work with the director on Gladiator and A Good Year,[20] while Washington wanted to work with Crowe again, after 1995's Virtuosity.[5] Production was slated in summer 2006.[19]Scott had discussed the script with Crowe as they worked on A Good Year in France, and they sought to take on the project. The director reviewed Zaillian's script, Terry George's rewrite, and a revision by Richard Price during the project's incarnation with director Antoine Fuqua. Scott preferred Zaillian's approach and chose to follow it. In realizing the project, the director encountered a challenge in the script since the characters Frank Lucas and Richie Roberts do not encounter each other until twenty minutes before the end of the film. The director sought to flesh out the private universes of the characters that would evolve and have scenes cut between the two characters to provide a balance. Elements like Frank Lucas's interaction with his family and Richie Roberts' dysfunctional marriage were written to add to the characters' backgrounds.[21] The rappers T.I., RZA and Common were added to the cast to appeal to younger audiences.[22]Scott chose to direct American Gangster based on the paradoxical values of Frank Lucas and Richie Roberts. The film somewhat focuses on the comparatively ethical business practices of the \"wicked gangster\" and the womanizing and failed marriage of the \"do-gooder\" police detective. Washington, who was not normally a fan of gangster films, chose to portray Lucas when he saw \"the arc of the character\" had ended with prices that Lucas paid for his actions.[3] To prepare for their roles, the actors met their real-life counterparts. Washington acquired Lucas's Southern accent, and Crowe practiced to match Roberts's manner of speaking and body language, requesting tape recordings of Roberts to assist in his preparation.[3] The following March, the studio rehired Zaillian to rewrite the script for American Gangster.[18] It was rumored that Washington got paid another $20 million for when the project was greenlit again; that rumor proved to be false, as he signed on for his gross.[23] The budget had escalated to $100 million, which Grazer stated was unexpected given \"It's not a high-concept comedy, it's not a fantasy movie, it's not a four-quadrant movie\".[5] Grazer and Scott still had to pay back the studio $3 million for a budget overrun.[16]Principal photography began in July 2006 in New York City.[17] American Gangster was filmed over a period of approximately four months in over 180 different locations, most of them across New York; it set the record for containing the highest number of filming locations of a movie.[21] Two months were spent in New York, with all the city's five boroughs being used. Approximately fifty to sixty locations were set in Harlem alone. While in the neighbourhood, Scott stated that he found several interiors that had been untouched since the 1940s.[21] According to production designer Arthur Max, exhaustive location scouting was done to find parts of New York that could still resemble the city of the early 1970s, filming Lucas' headquarters at 116th Street 20 blocks north, on 136th Street.[24] In his interview with ComingSoon.net, Scott stated that \"[he] just walked in [...] and [...] just sho[o]t in the house.\" Several gas masks were brought by producers due to health hazards and sanitary concerns existing in the buildings. Scott found filming in Harlem to be difficult, commenting that the rapid gentrification in Harlem provided poor opportunities for shooting angles.[21] Hand-held cameras were extensively used to depict a \"guerrilla filmmaking\" style.[24]Other locations for principal photography include the Brooklyn Navy Yard, the Nassau Veterans Memorial Coliseum, Old Westbury Gardens, a segment of the George Washington Bridge, and the Brooklyn Supreme Courthouse. Briarcliff Manor in upstate New York had the locations for both the Lucas farm and the estate Lucas buys for his family.[24] Filming locations began setting up in Thailand in November 2006, after Branko Lustig consulted with Suvit Yodmanee, the country's tourism minister.[25] Filming for American Gangster concluded in Chiang Mai the following month.[25]Using his experience from visiting New York in the same time period in which the film's story took place, Scott sought to downplay a \"Beatles\" atmosphere to the film and to instead create a shabbier atmosphere, saying that \"Harlem was really, really shabby, beautiful brownstones falling apart.\"[21] Production and costume design was emphasized, transforming the location into the rundown streets of upper Manhattan from the late 1960s and early 1970s. Denzel Washington, as Frank Lucas, went through 64 different costume changes.[26]In 2006, Greg Calloway was approached by producers to produce a soundtrack for the film. He presented the idea to Atlantic Records chairman Craig Kallman, and one of the company's artists, T.I., got an acting role in the film. However, the deal did not go further because Universal Pictures owned the rights to the film; \"It was a Universal film and they were not going to give the soundtrack to WMG\" (Atlantic's parent company).[27] Thus Scott brought back Marc Streitenfeld, who had worked with him in A Good Year. The composer stated that \"the overall tone needed to be something bigger and darker\" given the characters' strong personalities, and while not being the original intention, he added shades of blues and soul music to fit the 1970s setting.[28] The musical score for American Gangster was recorded between April and May 2007 by Streitenfeld, with the help of orchestrator Bruce Fowler and conductor Mike Nowak, using an 80-piece orchestra recorded in sections as well as acoustic pre-records, performed by Streitenfeld himself. Additional score material was composed and recorded by Hank Shocklee.[29]The official soundtrack album for American Gangster was released by Def Jam Recordings within a week of the film's release. In addition to Streitenfeld and Shocklee's score material, the soundtrack album also features songs influenced by music in the 1960s and 1970s, including from blues and soul musicians such as Bobby Womack, The Staple Singers, Sam & Dave, and John Lee Hooker.[22] Grazer stated that \"I wanted to introduce a visual and sonic world that is a contained entity of the '70s\", and Scott felt it was vital to have \"the brand of music that was Harlem at the time.\"[24]Denzel Washington pressed Grazer into inviting rapper Jay-Z to write the film's score, but the producer \"just didn't think there'd be enough for Jay-Z to do\" given the intentions to do a soundtrack filled with 1970s music.[22] The film's trailer had already used Jay-Z's \"Heart of the City (Ain't No Love)\", and the rapper was invited to an advanced screening. The film had a profound resonance on the musician, who decided to create a concept album, also entitled American Gangster.[24] The rapper recorded tracks that were prompted by specific scenes in the film. It was speculated that the album's release in conjunction with the film would attract a young audience and help Universal Pictures generate profits to recover from the film's troubled development history.[22] According to Jay-Z:\"It was like I was watching the film, and putting it on pause, and giving a back story to the story. It immediately clicked with me. Like Scarface or any one of those films, you take the good out of it, and you can see it as an inspiring film.\"[22]","produced_by":"Ridley Scott|Brian Grazer|","starring":"Russell Crowe|Denzel Washington|Chiwetel Ejiofor|Cuba Gooding, Jr.|Josh Brolin|Ted Levine|Armand Assante|John Ortiz|John Hawkes|RZA|Ruby Dee|","running_time":"158 minutes","music_by":"Marc Streitenfeld","edited_by":"Pietro Scalia","Release":"American Gangster premiered in Harlem at the Apollo Theater on October 20, 2007.[30] Over two weeks before the release of American Gangster, a screener for the film leaked online.[31] The film debuted in the United States and Canada on November 2, 2007 in 3,054 theaters.[32]In its opening weekend in the United States and Canada, it grossed an estimated $43.6 million, averaging $14,264 per theater, placing the film first in the weekend box office.[33] It marked the biggest opening weekend out of any film in both Washington and Crowe's careers.[34] In its second week, grosses declined by 44.8 percent to $24 million, being beaten out by Bee Movie.[35] In contrast by its third week, screenings for American Gangster increased to 3,110 theaters as the film surpassed the $100 million mark.[36] American Gangster finished its box office run in North America with $130,164,645.[1]The film experienced similar success overseas. American Gangster was released in the United Kingdom on November 16, and became the highest-grossing film of the week, garnering £2.6 million ($5.3 million) in the box office.[37] It repeated the feat in its second week, grossing an estimated £1.82 million ($3.7 million) at the box office and beating out Beowulf two consecutive times.[38] The weekend of November 16–18 saw American Gangster take $14.7 million from fourteen territories internationally. At the same time, American Gangster expanded in the European market; it received $2.8 million from 366 theaters in Germany and $3.6 million from 366 screens in France during its opening weekend.[39] Releases followed in Norway and Sweden the succeeding week, where it earned $392,608 and $465,238 from thirty-seven and fifty-nine theaters, respectively.[40] The film was released in the United Arab Emirates during the film's sixth week, and grossed a modest $281,922 at the box office during its first week in the emirate. Similarly, it earned $6.9 million in international markets during its sixth week, adding the total at the time to $40.9 million.[41]By January 25, 2008, American Gangster opened in thirty-seven markets, bringing international grosses to $93 million.[42] In February, screenings for the film debuted in Mexico—with a modest $820,482 opening weekend—and Japan, where it opened at the box office with $2.3 million, landing in second place.[43] American Gangster grossed over $266.5 million worldwide at the box office, with international grosses making up 51 percent ($136.3 million). It ranked as the 19th highest-grossing film of 2007 both domestically and worldwide.[1]American Gangster was released in DVD and HD DVD format on February 19, 2008. The home release included an unrated extended version of the film, featuring 18 additional minutes and an alternate ending.[44] The film topped both the DVD sales charts with 4 million units during its first week in stores, more than three times as many copies as second place Michael Clayton, and the rental charts.[45] American Gangster ended up as the 14th best-selling DVD of 2008.[46] It also topped the high-definition charts despite being released in the same week Toshiba announced it would discontinue the HD DVD format.[47] On October 14, the film saw its release on Blu-ray.[48]A mobile game based on the film was released by Gameloft on November 1.[49]","budget":"$100 million[1]"}