{"Cast":"Warner Bros. acquired the film rights to the first three Hornblower novels – Beat to Quarters, A Ship of the Line, and Flying Colours – as a star vehicle for Errol Flynn when they were initially published. However, influenced by the financial failure of the 1948 adventure romance film, Adventures of Don Juan, growing difficulties with the actor, or his advancing age,[2] Flynn was not cast. Warner's was already building up Burt Lancaster as their new swashbuckling screen star, but the role of a British sea captain seemed to be outside his range, so Peck was ultimately cast on a loan-out from David O. Selznick, who received screen credit in the opening titles. Virginia Mayo was only cast after a number of high-profile British actresses were not free or not interested. Peck's personal choice was Margaret Leighton.[3]","country":"United Kingdom United States","distributed_by":"Warner Bros.","Plot":"In 1807, during the Napoleonic Wars, British Royal Navy Captain Horatio Hornblower (Gregory Peck) commands the 38-gun frigate HMS Lydia on a lengthy secret mission to Central America. He is to provide arms and support to a megalomaniac named Don Julian Alvarado, who is calling himself \"El Supremo\" or \"The Almighty\" (Alec Mango), in his rebellion against Spain, an ally of Britain's enemy France. As Hornblower observes to First Lieutenant Bush (Robert Beatty), \"War breeds strange allies.\"Upon his arrival, Hornblower is told that a larger, much more powerful Spanish warship, the 60-gun Natividad, has been sighted. When it anchors nearby, Hornblower and his crew board and capture it in a surprise nighttime attack. He then reluctantly hands the ship over to Alvarado to appease the madman, and they go their separate ways.Later, he encounters a small Spanish vessel and learns that Spain has switched sides, so the Lydia will have to attack the Natividad again. Two passengers transfer to the Lydia (over Hornblower's objections): Lady Barbara Wellesley (Virginia Mayo) and her maid, fleeing a yellow fever epidemic. As Lady Barbara is the (fictitious) sister of the Duke of Wellington (an anachronism, as the title was created in 1814 and he would have been Sir Arthur Wellesley at this time), Hornblower is in no position to refuse her request for passage to England.Using superior seamanship and masterful tactics, Hornblower sinks the Natividad, and when the ship's surgeon is killed in the battle, Lady Barbara insists on helping by nursing the wounded. When she later falls gravely ill, Hornblower nurses her back to health. On the voyage back to England, they fall in love. However, when she makes advances (although she is engaged), Hornblower informs her he is married.After arriving home, Hornblower learns that his wife has died in childbirth, leaving him an infant son. He is given command of the Sutherland, a 74-gun ship of the line captured from the French, and is assigned to a squadron commanded by Rear Admiral Leighton (Denis O'Dea), Lady Barbara's new husband. The squadron's mission is to help enforce the British blockade against Napoleonic France.At a conference on Leighton's flagship, Hornblower learns that four French ships of the line have broken the blockade. Leighton assumes they will make for the Mediterranean, but Hornblower suggests that they mean to support Napoleon's campaign on the Iberian Peninsula.Leighton decides to cover both possibilities by detaching one ship to patrol the French coast. When he learns that Hornblower's Sutherland is best suited for this task, having the shallowest draught, he becomes suspicious that Hornblower is after glory and prize money. Leighton therefore expressly forbids Hornblower from taking any independent action if he sights the French.Hornblower's French-built ship is subsequently mistaken for a friendly vessel by a small French brig, which flies the enemy's recognition signal for the day. After capturing the vessel, Hornblower learns from interrogating its captain that he was transporting army supplies to the four warships for use in Spain. Rather than return to the squadron, Hornblower sends the brig back with a prize crew and the news.He enters the enemy harbour where the French ships are anchored and guarded by a well-armed fort. By flying a French flag and the recognition signal and taking advantage of the appearance of his ship's French design, Hornblower fools the garrison into believing that the Sutherland is friendly. His gun crews dismast all four enemy ships before French cannon fire forces the British to abandon the Sutherland. Hornblower scuttles his ship in the channel, bottling up the French ships.As the rest of the British squadron arrives to complete the job, Hornblower and Bush, accompanied by seaman Quist (James Robertson Justice), are taken by carriage to Paris to be tried for piracy. However, they manage to escape en route and make their way to the port of Nantes. Disguised as Dutch officers, they board The Witch of Endor, a captured British ship. They overpower the skeleton crew, free a working party of British prisoners of war to man her, and sail away to freedom.Hornblower is hailed as a national hero, and learns that Leighton was killed in the battle. Hornblower returns home to visit his young son, and finds Lady Barbara there. The two embrace.","Premiere and reception":"The film made its worldwide premiere in the presence of Princess Margaret at the Warner Theatre, Leicester Square, London on 12 April 1951. The premiere was in aid of King George's Fund for Sailors and the \"Foudroyant\" appeal (the presently restored frigate renamed HMS Trincomalee¿ afloat in the Historic Quay, Hartlepool, UK.)[9] It was the 9th most popular film at the British box office that year.[10]The film has been well received by modern critics, with film aggregate site Rotten Tomatoes giving it 7.3 out of 10 and a 100% 'fresh' rating [11]","language":"English","box_office":"$2.75 million (US rentals)[1]","Other versions":"Gregory Peck and Virginia Mayo recreated their roles on a one-hour Lux Radio Theater program broadcast on January 21, 1952, which is included as an audio-only feature in the film's DVD release.[12]","cinematography":"Guy Green","production_company":"Warner Bros.","directed_by":"Raoul Walsh","release_dates":"September 13, 1951 (1951-09-13)|||||","Production":"The film was shot at studios inside the United Kingdom, on Mermaid Street in Rye, East Sussex, at HMS Victory and also on location in France.[4][5] To save costs, the Hispaniola set from the 1950 Disney film adaptation of Treasure Island was reused as the frigate HMS Lydia. However, the ship was rocked instead of moving the horizon background, which caused many problems because of the combined weight of ship, crew and equipment. The Italian brigantine Marcel B. Surdo represented the The Witch of Endor for all at-sea exterior footage.[6] The Marcel B. Surdo would also appear in such seafaring films as The Crimson Pirate, The Master of Ballantrae, and John Paul Jones.[7] The explosive and fire effects were supervised by Cliff Richardson.[8]","produced_by":"Gerry Mitchell","starring":"Gregory Peck Virginia Mayo Robert Beatty Terence Morgan James Robertson Justice","running_time":"117 minutes","music_by":"Robert Farnon","edited_by":"Jack Harris","written_by":"C.S. Forester (novel and adaptation) Ivan Goff Ben Roberts Aeneas MacKenzie"}