{"based_on":"Beowulf  by Anonymous","Cast":"The cast members of Beowulf were filmed on a motion capture stage. They were altered on screen using computer-generated imagery, but their animated counterparts bear much resemblance to themselves.The cast also includes:","country":"United States","distributed_by":"Paramount Pictures (United States) Warner Bros. Pictures (International)","screenplay_by":"Neil Gaiman Roger Avary","Plot":"Beowulf is a legendary Geatish warrior who travels to Denmark with his band of soldiers, including his best friend, Wiglaf. They meet King Hrothgar, who needs a hero to slay Grendel (Crispin Glover), a hideously disfigured troll-like creature with superhuman strength. Grendel attacked Heorot, Hrothgar's mead hall, whenever the Danes held a celebration, and Hrothgar was forced to close the hall. Upon arriving, Beowulf becomes attracted to Hrothgar's wife, Queen Wealtheow, who reciprocates his interest.Beowulf and his men celebrate in Heorot to lure Grendel out. When the beast attacks, Beowulf engages him unarmed and naked. During the fight, Beowulf discovers that Grendel has hypersensitive hearing, which is why he interrupts Hrothgar's celebrations – the noise they make is physically painful to him. After his eardrum is ruptured by Beowulf, Grendel attempts to escape. Beowulf restrains Grendel and severs his arm with the door. In thanks for freeing his kingdom from the monster, Hrothgar gives Beowulf his golden drinking horn, which commemorates Hrothgar's victory over the mighty dragon Fafnir.In his cave, the dying Grendel tells his mother what was done to him, and she swears revenge. She travels to Heorot and slaughters Beowulf's men while they are sleeping. Hrothgar tells both Beowulf and Wiglaf, who had been sleeping outside the hall during the attack, that it was the work of Grendel's mother. She is the last of the Water Demons, who was thought to have left the land. Beowulf and Wiglaf travel to the demon's cave to slay her. Beowulf enters the cave alone and encounters the demon, who takes the form of a beautiful woman. She offers to make him the greatest king who ever lived, in exchange for a son to replace Grendel and Hrothgar's drinking horn.Beowulf agrees to the deal and returns, claiming to have killed her. Hrothgar, however, realizes the truth. He indirectly tells Beowulf that, much like him, Hrothgar was seduced by her, and Grendel was the result of their tryst. Hrothgar crowns Beowulf king, much to the dismay of his royal advisor, Unferth, who was hoping to take the throne. Hrothgar then commits suicide by jumping from the castle parapet onto the beach below. A wave momentarily engulfs Hrothgar's body, there is a golden flash underwater, and the body is gone.Years later, the elderly Beowulf is married to Wealtheow. Over the years they had grown apart, husband and wife in name alone. Beowulf takes a mistress, Ursula, but his tryst with Grendel's mother has left him sterile. One day, Unferth's slave Cain finds the golden drinking horn in a swamp near Grendel's cave and brings it back to the kingdom. That night, a nearby village is destroyed by a dragon, which leaves Unferth alive to deliver a message to King Beowulf: the dragon is Beowulf's son born to Grendel's mother. Removing the horn has voided the agreement between Beowulf and Grendel's mother, who has now sent their son, the dragon, to destroy his kingdom.Beowulf and Wiglaf go to the cave once again and Beowulf enters the cave alone. When Grendel's mother appears, Beowulf gives her the golden horn, but she refuses to stop the attack. The dragon attacks the kingdom again. Despite his age, Beowulf goes to great lengths to stop the monster, even severing his own arm. Eventually, he kills the dragon by ripping its heart out. A mortally wounded Beowulf watches the dragon transforming into a humanoid body and being washed out to sea. As Wiglaf approaches him, Beowulf tries to tell the truth about his affair with Grendel's mother, but Wiglaf insists on keeping his legacy intact. Beowulf then dies.As the new king, Wiglaf gives Beowulf a Norse funeral. Grendel's mother appears and gives Beowulf a final kiss before his burning ship sinks into the sea. Wiglaf sees the golden horn in the sand while Grendel's mother floats in the sea, looking at him seductively. The movie ends ambiguously with Wiglaf holding the horn and staring back at her.","Differences from the poem":"One objective of Neil Gaiman and Roger Avary was to offer their own interpretation for motivations behind Grendel's behavior and for what happened when Beowulf was in the cave of Grendel's mother. They justified these choices by arguing that Beowulf acts as an unreliable narrator in the portion of the poem in which he describes his battle with Grendel's mother.[15] These choices also helped them to better connect the third act to the second of their screenplay, which is divided in the poem by a 50-year gap.[16]Some of the changes made by the film as noted by scholars include:Scholars and authors have also commented on these changes. Southern Methodist University's Director of Medieval Studies Bonnie Wheeler is \"convinced that the new Robert Zemeckis movie treatment sacrifices the power of the original for a plot line that propels Beowulf into seduction by Angelina Jolie—the mother of the monster he has just slain. What man doesn’t get involved with Angelina Jolie?' Wheeler asks. 'It’s a great cop-out on a great poem.' ... 'For me, the sad thing is the movie returns to…a view of the horror of woman, the monstrous female who will kill off the male,' Wheeler says. 'It seems to me you could do so much better now. And the story of Beowulf is so much more powerful.'\"[20] Other commentators pointed to the theories elucidated in John Grigsby's work Beowulf and Grendel, where Grendel's mother was linked with the ancient Germanic fertility goddess Nerthus.[21]This is not the first time that the theme of a relationship between Beowulf and Grendel's mother was explored. In Gaiman's 1998 collection of short stories, Smoke and Mirrors, the poem Bay Wolf is a retelling of Beowulf in a modern-day setting. In this story, Beowulf as the narrator is ambiguous about what happened between Grendel's mother and himself.In addition, philosophy professor Stephen T. Asma argues that \"Zemeckis's more tender-minded film version suggests that the people who cast out Grendel are the real monsters. The monster, according to this charity paradigm, is just misunderstood rather than evil (similar to the version presented in John Gardner's novel Grendel). The blame for Grendel's violence is shifted to the humans, who sinned against him earlier and brought the vengeance upon themselves. The only real monsters, in this tradition, are pride and prejudice. In the film, Grendel is even visually altered after his injury to look like an innocent, albeit scaly, little child. In the original Beowulf, the monsters are outcasts because they're bad (just as Cain, their progenitor, was outcast because he killed his brother), but in the film Beowulf the monsters are bad because they're outcasts [...] Contrary to the original Beowulf, the new film wants us to understand and humanize our monsters.\"[22]","language":"English","Reception":"Beowulf ranked #1 in the United States and Canada box office during its opening weekend date of November 18,[36] grossing $27.5 million in 3,153 theaters.[37]As of April 27, 2008, the film has grossed an estimated domestic total of $82,195,215 and a foreign box office total of $113,954,447 for a worldwide gross of $196,149,662.[38]The film was met with mainly positive reviews. As of November 1, 2014, on the review aggregator Rotten Tomatoes, Beowulf received a rating of 71% certifying it as \"Certified Fresh\", based upon 194 reviews.[39] On Metacritic, the film had an average score of 59 out of 100, based on 35 reviews, indicating \"mixed or average\" reviews.[40]Giving Beowulf three out of four stars, Roger Ebert argues that the film is a satire of the original poem.[41] Time magazine critic Richard Corliss describes the film as one with \"power and depth\" and suggests that the \"effects scenes look realer, more integrated into the visual fabric, because they meet the traced-over live-action elements halfway. It all suggests that this kind of a moviemaking is more than a stunt. By imagining the distant past so vividly, Zemeckis and his team prove that character capture has a future.\"[42] Corliss later named it the 10th best film of 2007.[43] Rolling Stone critic Peter Travers argues that “The eighth-century Beowulf, goosed into twenty-first century life by a screenplay from sci-fi guru Neil Gaiman and Pulp Fiction's Roger Avary, will have you jumping out of your skin and begging for more... I've never seen a 3-D movie pop with this kind of clarity and oomph. It's outrageously entertaining.\"[44]Tom Ambrose of Empire gave the film four out of five stars. He argues that Beowulf is \"the finest example to date of the capabilities of this new technique [...] Previously, 3D movies were blurry, migraine-inducing affairs. Beowulf is a huge step forward [...] Although his Cockney accent initially seems incongruous [...] Winstone’s turn ultimately reveals a burgeoning humanity and poignant humility.\" Ambrose also argues that “the creepy dead eyes thing has been fixed.\"[45] Justin Chang of Variety argues that the screenwriters \"have taken some intriguing liberties with the heroic narrative [... the] result is, at least, a much livelier piece of storytelling than the charmless Polar Express.\" He also argues that \"Zemeckis prioritizes spectacle over human engagement, in his reliance on a medium that allows for enormous range and fluidity in its visual effects yet reduces his characters to 3-D automatons. While the technology has improved since 2004's Polar Express (particularly in the characters' more lifelike eyes), the actors still don't seem entirely there.\"[46]Kenneth Turan of NPR criticized the film, arguing: \"It's been 50 years since Hollywood first started flirting with 3-D movies, and the special glasses required for viewing have gotten a whole lot more substantial. The stories being filmed are just as flimsy. Of course Beowulf does have a more impressive literary pedigree than, say, Bwana Devil. But you'd never know that by looking at the movie. Beowulf's story of a hero who slays monsters has become a fanboy fantasy that panders with demonic energy to the young male demographic.\"[47] Manohla Dargis of the New York Times compared the poem with the film stating that, \"If you don't remember this evil babe from the poem, it's because she's almost entirely the invention of the screenwriters Roger Avary and Neil Gaiman and the director Robert Zemeckis, who together have plumped her up in words, deeds and curves. These creative interventions aren't especially surprising given the source material and the nature of big-studio adaptations. There's plenty of action in Beowulf, but even its more vigorous bloodletting pales next to its rich language, exotic setting and mythic grandeur.\"[48]","box_office":"$196.4 million","cinematography":"Robert Presley","production_company":"Shangri-La Entertainment ImageMovers","directed_by":"Robert Zemeckis","beowulf":"Theatrical release poster","release_dates":"November 16, 2007 (2007-11-16)|||||","Production":"Author Neil Gaiman and screenwriter Roger Avary wrote a screen adaptation of Beowulf in May 1997 (they had met while working on a film adaptation of Gaiman's The Sandman in 1996, before Warner Bros. canceled it).[1] The script had been optioned by ImageMovers in the same year and set up at DreamWorks with Avary slated to direct and Robert Zemeckis producing. Avary stated he wanted to make a small-scale, gritty film, with a budget of $15–20 million, similar to Jabberwocky or Excalibur.[1] The project eventually went into turnaround after the option expired, the rights returned to Avary, who went on to direct an adaptation of The Rules of Attraction. In January 2005, producer Steve Bing, at the behest of Zemeckis who was wanting to direct the film himself, revived the production by convincing Avary that Zemeckis' vision, supported by the strength of digitally enhanced live action, was worth relinquishing the directorial reins.[7][8] Zemeckis did not like the poem, but enjoyed reading the screenplay. Because of the expanded budget, Zemeckis told the screenwriters to rewrite their script, because \"there is nothing that you could write that would cost me more than a million dollars per minute to film. Go wild!\" In particular, the entire fight with the dragon was rewritten from a talky confrontation to a battle spanning the cliffs and the sea.[1]Sony Pictures Imageworks created the animation for the film, with visual effects supervisor Jerome Chen overseeing creative and technical development for the project. Animation supervisor Kenn MacDonald explained that Zemeckis used motion capture because “Even though it feels like live action, there were a lot of shots where Bob cut loose. Amazing shots. Impossible with live action actors. This method of filmmaking gives him freedom and complete control. He doesn’t have to worry about lighting. The actors don’t have to hit marks. They don’t have to know where the camera is. It’s pure performance.\" A 25 × 35-foot stage was built, and it used 244 Vicon MX40 cameras. Actors on set wore seventy-eight body markers. The cameras recorded real time footage of the performances, shots which Zemeckis reviewed. The director then used a virtual camera to choose camera angles from the footage which was edited together. Two teams of animators worked on the film, with one group working on replicating the facial performances, the other working on body movement. The animators said they worked very closely on replicating the human characters, but the character of Grendel had to be almost reworked, because he is a monster, not human.[9]In designing the dragon, production designer Doug Chiang wanted to create something unique in film. The designers looked at bats and flying squirrels for inspiration, and also designed its tail to allow underwater propulsion. As the beast is Beowulf's son with Grendel's mother, elements such as Winstone's eyes and cheekbone structure were incorporated into its look.[10] The three primary monsters in the film share a golden color scheme, because they are all related. Grendel has patches of gold skin, but because of his torment, he has shed much of his scales and exposed his internal workings. He still had to resemble Crispin Glover though: the animators decided to adapt Glover's own parted hairstyle to Grendel, albeit with bald patches.[9]Robert Zemeckis insisted that the character Beowulf resemble depictions of Jesus, believing that a correlation could be made between Christ's face and a universally accepted appeal.[11] Zemeckis used Alan Ritchson for the physical model, facial image and movement for the title character of Beowulf.[12]Director Robert Zemeckis drew inspiration for the visual effects of Beowulf from experience with The Polar Express, which used motion capture technology to create three-dimensional images of characters.[13] Appointing Jerome Chen, whom Zemeckis worked with on The Polar Express, the two decided to chart realism as their foremost goal. Over 450 graphic designers were chosen for the project, the largest team ever assembled for an Imageworks-produced movie as of 2007.[13] Designers at Imageworks generated new animation tools for facial, body, and cloth design especially for the movie, and elements of keyframe animation were incorporated into the movie to capture the facial expressions of the actors and actresses.[13] The mead hall battle scene near the beginning of the film, among others, required numerous props that served as additional markers; these markers allowed for a more accurate manifestation of a battlefield setting as the battle progressed.[13] However, the data being collected by the markers slowed down the studios' computer equipment, and five months were spent developing a new save/load system that would increase the efficiency of the studios' resources.[13] To aid in the process of rendering the massive quantities of information, the development team used cached data. In the cases that using cached data was not possible, the scenes were rendered using foreground occlusion, which involves the blurring of different overlays of a single scene in an attempt to generate a single scene film.[13]Other elements of the movie were borrowed from that of others created by Imageworks; Spider-Man 3 lent the lighting techniques it used and the fluid engine present in the Sandman, while the waves of the ocean and the cave of Grendel's mother were modeled after the wave fluid engine used in Surf's Up. The 2007 film Ghost Rider lent Beowulf the fluid engine that was used to model the movements of protagonist Johnny Blaze.[13]Jerome Chen worked to process large crowd scenes as early as possible, as additional time would be needed to process these scenes in particular.[13] As a result, the film's development team designed a priority scale and incorporated it into their processors so graphic artists would be able to work with the scenes when they arrived.[13]So much data was produced in the course of the creation of the movie, the studio was forced to upgrade all of its processors to multicore versions, which run quicker and more efficiently. The creation of additional rendering nodes throughout Culver City, California was necessitated by the movie's production.[13]Mark Vulcano, who had previously worked on VeggieTales and Monster House, was Senior Character Animator for the film.The music for Beowulf was composed by Alan Silvestri. A soundtrack was released November 20, 2007.[14] Silvestri was largely responsible for the production of the soundtrack album, although actresses Robin Wright Penn and Idina Menzel performed several songs in the soundtrack's score.","produced_by":"Robert Zemeckis Steve Bing Jack Rapke Steve Starkey","starring":"Ray Winstone Anthony Hopkins John Malkovich Robin Wright Penn Brendan Gleeson Crispin Glover Alison Lohman Angelina Jolie","running_time":"115 minutes","music_by":"Alan Silvestri","edited_by":"Jeremiah O'Driscoll","Release":"At Comic-Con International in July 2006, Gaiman said Beowulf would be released on November 22, 2007.[23] The following October, Beowulf was announced to be projected in 3-D in over 1,000 theaters for its release date in November 2007. The studios planned to use 3-D projection technology that had been used by Monster House (another film that Zemeckis was involved on, but credited as executive producer), Chicken Little, and 3-D re-release of The Nightmare Before Christmas, but on a larger scale than previous films. Beowulf would additionally be released in 35mm alongside the 3-D projections.[24]Originally, Columbia Pictures was set to distribute the film. However, Steven Bing did not finalize a deal and instead arranged with Paramount Pictures for U.S. distribution and Warner Bros. for international distribution.[25] Beowulf was set to premiere at the 2007 Venice Film Festival, but was not ready in time.[26] The film's world premiere was held in Westwood, Los Angeles, California on November 5, 2007.[27]Critics and even some of the actors expressed shock at the British Board of Film Classification rating of the film — 12A — which allowed children under twelve in Britain to see the film if accompanied by their parents. Angelina Jolie called it \"remarkable it has the rating it has\", and said she would not be taking her own children to see it.[28] In the United States, the Motion Picture Association of America rated the film as PG-13 (\"Parents Strongly Cautioned: Some material may be inappropriate for children under 13\").To promote the film, a novelization of the film, written by Caitlín R. Kiernan, was published in September 2007.[29] This was followed by a four-issue comic book adaptation by IDW Publishing released every week in October 2007.[30]A video game based on the film entitled Beowulf: The Game was released on Xbox 360, PlayStation 3, PC and PSP formats.[31] The game was announced by Ubisoft on May 22, 2007 during its Ubidays event in Paris.[32] It was released on November 13, 2007 in the United States. The characters are voiced by the original actors who starred in the film.[33] On November 1, 2007, Beowulf: The Game was released for mobile phones. The side-scrolling action video game was developed by Gameloft.[34]Several cast members, including director Robert Zemeckis gave interviews for the film podcast Scene Unseen in August 2007. This is noteworthy especially because it marks the only interview given by Zemeckis for the film.Beowulf was released for Region 1 on DVD February 26, 2008. A director's cut was also released as both a single-disc DVD and two-disc HD DVD alongside the theatrical cut. The theatrical cut includes A Hero's Journey: The Making of Beowulf while the single disc director's cut features four more short features. The HD DVD contains eleven short features and six deleted scenes.[35]The director's cut was released on Blu-ray Disc in the United Kingdom on March 17, 2008 and in the United States on July 29, 2008.[citation needed] The Blu-ray edition includes a \"picture-in-picture\" option that allows one to view the film's actors performing their scenes on the soundstage, before animation was applied (a notable exception to this is Angelina Jolie, whose scenes are depicted using storyboards and rough animation rather than the unaltered footage from the set).","budget":"$150 million"}