{"country":"United States","distributed_by":"Cinerama Releasing Corporation","Plot":"A lonely boy named Danny Garrison befriends Ben, the rat leader of the swarm of rats trained by Willard Stiles. Ben becomes the boy's best friend, protecting him from bullying and keeping his spirits up in the face of a heart condition.However, things gradually take a downward turn as Ben's swarm becomes violent, resulting in several deaths. Eventually, the police destroy the rat colony with flame throwers, but Ben survives and makes his way back to Danny. The film closes with Danny, tending to the injured Ben, determined not to lose his friend.","language":"English","Reception":"Ben received mixed reviews from critics. It currently holds a rating of 57% \"Rotten\" on Rotten Tomatoes.[2] Roger Ebert of the Chicago Sun-Times gave the film 1.5 stars out of 4 and wrote \"This isn't a thriller but a geek movie. In a thriller, we're supposed to be scared by some awesome menace to mankind -- the Green Blob maybe, or Big Foot, or the Invincible Squid and his implacable enemy, red wine sauce. But in a geek movie, the whole idea is to be disgusted because the actors have rats all over them.\"[3] Leonard Maltin gave the film a negative review, awarding it 1 1/2 out of 4 stars, panning the film's gory visuals.[4]","cinematography":"Russell Metty","production_company":"Bing Crosby Productions (Rysher Entertainment)","directed_by":"Phil Karlson","release_dates":"June 23, 1972 (1972-06-23)|||||","produced_by":"Mort Briskin","starring":"Lee Montgomery Joseph Campanella Arthur O'Connell Meredith Baxter","running_time":"94 minutes","Theme song":"The film's theme song \"Ben\" is performed by Lee Montgomery in the film and by Michael Jackson over the end credits. Michael's recording of the song became a #1 pop hit single. Later included on Michael's album of the same name, \"Ben\" won a Golden Globe Award for Best Original Song and was nominated for an Academy Award for Best Original Song (it lost to \"The Morning After\" from The Poseidon Adventure).The song is calm and mellow, which contrasts with the horror content of the film. A live recorded version was released on the 1981 album The Jacksons Live! and eventually appeared on Michael's Number Ones album in 2003.Crispin Glover re-recorded a version of the song for the soundtrack of the 2003 remake of Willard.Chris Colfer, Cory Monteith, & Lea Michele perform a cover of the song for the Glee season 3 episode Michael which was a tribute to Michael Jackson.Pearl Jam's song \"Rats\" talks about the film, the last line of the song is an obvious reference to Ben. The line is, \"Ben, the two of us need look no more.\"","music_by":"Walter Scharf","written_by":"Gilbert Ralston"}