{"distributed_by":"Buena Vista Pictures","Plot":"The story begins when convicted bank robber Carl Quigley (Miguel Ferrer) escapes from prison. Soon after his prison break, Quigley enters a warehouse and recovers $1,000,000 he had hidden there sometime before his arrest (although it is unclear exactly how he illegally obtained the money). The film then cuts to 12-year-old Preston Waters (Brian Bonsall), whose father (James Rebhorn) works as an investor for a living and is very frugal with money—so much so that when he is given a blank check from his grandmother for his birthday, his dad fills it out for only $11.00. When invited to Butch's birthday party at an amusement park, Preston doesn't want to go because Butch treats him more like a bully than a friend, of which his parents are unaware, and because he only has enough tokens to go on the kiddie rides.After Quigley visits bank president Edward Biderman (Michael Lerner) in his bank office to discuss his plan (along with threatening Biderman's family if he does not comply with it). Quigley left Biderman the stolen money as the bills were consecutive and traceable so he told Biderman his plan to swap the stolen bills for non consecutive ones without suspicion. Quigley explains that his assistant, Juice (Tone Loc) will be stopping by Biderman's office with a check to be cashed for $1,000,000 the next day at 1:00 P.M. After the meeting, Quigley runs over Preston's bicycle in a Jaguar XJ while Preston was riding out of the bank's parking lot trying to go after his nemesis Butch who stole his birthday. Pressed for time as he sees a police car patrolling the area, Quigley gives Preston a signed blank check and tells him to give it to his dad so they can buy him a new bike. Instead, Preston fills out the check for $1,000,000 by printing it on his computer. He goes to the bank the next day and is directed to Biderman's office by a teller (as the teller could not cash a check that size herself). Thinking that Preston is Quigley's assistant, Juice, Biderman cashes his check with $1,000,000 from a safe behind a painting.As Preston is leaving the bank, the real Juice enters Biderman's office with another check for $1,000,000. Realizing that Biderman mistook Preston for Juice, the trio begins a frantic search for Preston. Meanwhile, he embarks on an extreme shopping spree over the course of 6 days, buying a castle-style house (by outbidding Quigley using the voice box on his computer over the phone) along with many other expensive items (limousine service, go-kart track, water slide, etc.). He spends $999,667.83 of the original $1,000,000. Preston covers himself by saying he is making these purchases for a millionaire known as \"Macintosh\" (named after the brand of Preston's computer) who lives in the castle house. He also makes friends with Henry who is Preston's limo driver and best friend.The entire time, Preston was being investigated by FBI agent Shay Stanley (Karen Duffy) (working undercover as a teller at Biderman's bank and Preston's crush) for money laundering, as the bills he was using to make his purchases were Biderman's watermarked ones. At a birthday party Preston throws for Mr. Macintosh that forced him into debt (it was actually his birthday) leaving only $332.17 in his account, he is forced into a showdown with Quigley, Juice, and Biderman. After the trio manage to capture him and demand to know what happened with the money, he admits Macintosh is a false name, to which Biderman suggests that Quigley can use Preston's purchases and the Macintosh name to give himself a new identity.When the trio is confronted by the FBI at Preston's castle house, Quigley claims to be Macintosh. However, with the FBI knowing that Mr. Macintosh had been using the watermarked bills, they arrest Quigley, Juice, and Biderman. Shay kissed Preston on the lips before parting ways. Preston and Henry part ways too. After Preston gets home his family throws him a birthday party. His father apologizes for being so harsh to him when it came to money. Preston's family surprised with a cake and ask him to make a wish. Preston, already has everything he wished for, until he sees Shay's flier at the bank and decide to make a wish about her.","language":"English","Reception":"Reviews from critics were negative, with The Los Angeles Times stating that what was \"missing from this film is any trace of the joy in simple pleasures. Preston isn't a very imaginative child; he's a goodies gatherer.\"[5] Janet Maslin of The New York Times said that it \"looks like the best bet for family audiences in a season short on kiddie-oriented entertainment. And it's a movie that no parents in their right minds should let children see.\"[6] The Chicago Tribune stated that \"[w]ith its contrived plot, its MTV-inspired montages and its blatant shilling for products, it is film as hard sell, and it comes with a decidedly suspect warranty. Its mercantile instincts are so primary it looks like an infomercial.\"[7] It currently holds a 13% approval rating on Rotten Tomatoes based on 8 reviews.Blank Check debuted at No. 3 at the box office behind Ace Ventura: Pet Detective and The Getaway with $5.4 million in its opening weekend.[8] In total, the film went on to gross $30.5 million domestically in North America.","box_office":"$30.5 million (North America) [1]","blank_check":"Theatrical release poster","cinematography":"Bill Pope","production_company":"Walt Disney Pictures","directed_by":"Rupert Wainwright","release_dates":"February 11, 1994","Production":"The movie was filmed in Austin, San Antonio, and Dallas. The castle house that Preston buys was filmed at 1415 Wooldridge Drive in Austin, which is now owned by filmmaker Robert Rodriguez. The theme park in the beginning of the movie was Six Flags Fiesta Texas; several of the park's attractions, including The Rattler and Power Surge, were filmed in this movie.","produced_by":"Gary Adelson Craig Baumgarten Tony Shimkin","starring":"Brian Bonsall Karen Duffy Miguel Ferrer James Rebhorn Tone Lōc Jayne Atkinson Michael Lerner","running_time":"94 minutes","music_by":"Nicholas Pike","edited_by":"Hubert de la Bouillerie Jill Savitt","written_by":"Blake Snyder Colby Carr","budget":"$13 million"}