{"country":"United States","distributed_by":"Warner Bros.","Plot":"Workaholic advertising executive of Bauer & Cole, Daniel Miller has an important business meeting, but finds himself having to drive the neighborhood carpool for his sons, Bucky and Andrew, and their friends, Chelsea, Kayla, and Travis, when his wife gets sick. Stopping to get Danish for the kids at Hammerman's Gourmet To Go grocery store, things go even more awry when he finds himself a victim of a robbery. The situation worsens as Franklin Laszlo, the desperate owner of Laszlo Bros. Carnival who had been contemplating a bank robbery of Puget Savings and Loan, robs the robbers and takes Daniel and the kids hostage in their Toyota Previa van as his truck is blocked by an armored car. A comedic car chase ensues through Seattle. Daniel discovers the kids do not really respect him and they react better to Franklin.","language":"English","box_office":"$3.3 million[3]","cinematography":"David M. Walsh","production_company":"Regency Enterprises","directed_by":"Arthur Hiller","release_dates":"August 23, 1996 (1996-08-23)|||||","produced_by":"Arnon Milchan|Michael G. Nathanson|","starring":"David Paymer|Tom Arnold|Rhea Perlman|Rachael Leigh Cook|Rod Steiger|","running_time":"89 minutes[1]","carpool":"Theatrical release poster","music_by":"John Debney","edited_by":"M. James Langlois|William H. Reynolds|","Release":"Carpool opened theatrically on August 23, 1996 in 1,487 venues nationwide and earned $1,628,482 in its first weekend, ranking thirteenth in the domestic box office.[4] At the end of its run, the film had grossed $3,325,651.[3] Based on an estimated $17 million budget,[2] the film was a box office bomb.The film was panned by critics. On review aggregator website Rotten Tomatoes, the film has a 13% score based on 23 reviews, with an average rating of 2.6/10.[5] Metacritic reports a 15 out of 100 rating based on 10 critics, indicating \"overwhelming dislike\".[6]Arnold tied with Pauly Shore for a 1996 Razzie Award in part for his role in it as well as for Big Bully and The Stupids.","written_by":"Mark Christopher|Don Rhymer|","budget":"$17 million[2]"}