{"country":"United States","distributed_by":"Cannon Film Distributors","Plot":"Ayre \"Mac\" MacGillvary (Bo Derek), a virginal young woman, on graduating from an exclusive British boarding school, is determined to find the right man for her first sexual encounter wherever he might be in the world. Rich enough not to venture forth alone, she brings along her friend Catalina (Ana Obregon) and the family chauffeur Cotton (George Kennedy).Ayre first travels to an Arab country where she meets an ideal lover, a sheik who offers to deflower her but falls asleep almost immediately. Giving up on the sheik, Ayre goes on to Spain, where she meets the toreador Angel (Andrea Occhipinti) who manages to stay awake. Unfortunately, after she has succeeded in her quest, Angel is gored while bullfighting.The injury leaves Angel unable to perform in the bedroom, and so Ayre makes it her mission in life to see to his recovery. Along the way, she learns to fight a bull herself as a way of getting her despondent lover motivated to stop moping. Eventually, she is successful in aiding Angel to full recovery, and they celebrate their wedding.","bolero":"Theatrical release poster","language":"English","Reception":"Review aggregation website Rotten Tomatoes gives the film a rating of 6% based on reviews from 16 critics.[7]It was nominated for nine Golden Raspberry Awards and won six, including \"Worst Picture,\" \"Worst Actress,\" \"Worst Director,\" and \"Worst Screenplay.\"[8] In 1990, the film was nominated for, but lost the Razzie Award for \"Worst Picture of the Decade.\"[9] The movie was nominated for a Stinkers Bad Movie Awards for Worst Picture.[10]The film earned about $8.9 million in American ticket sales[3] against a $7 million production budget.[2]","box_office":"$8.9 million[3]","Production and release":"Executive producer and Cannon Films co-head Menahem Golan urged the Dereks to make the sex scenes more explicit, despite the latter party's objections on the basis that the scenes were strong enough. The film was initially to be distributed by MGM as part of an ongoing deal with Cannon, and Bo Derek screened the film to the studio's then-CEO Frank Yablans hoping that he would intervene with Golan on the matter of the erotic content. Yablans disliked the film as much as all the other films Cannon was delivering to MGM.[5]When the producers refused to cut the film to avoid an X rating by the MPAA, MGM dropped the film due to standards policies and Cannon released Bolero themselves.[6] The quality of Bolero and the other Cannon/MGM films led to Yablans using a breach of contract clause to terminate the distribution deal with the two studios in November 1984.[5] Bolero was ultimately released with no MPAA rating, with a disclaimer on ads that no children under 17 would be admitted to the film. Despite this, many theater chains that normally refused to screen X-rated films did the same for Bolero.[6]The film is officially on DVD with an \"R\" rating with no cuts.","cinematography":"John Derek","production_company":"City Films","directed_by":"John Derek","release_dates":"August 31, 1984 (1984-08-31)|||||","produced_by":"Bo Derek","starring":"Bo Derek|George Kennedy|Andrea Occhipinti|Ana Obregón|","running_time":"104 minutes[1]","Video releases":"In 1985, U.S.A. Home Video released Bolero in both Unrated and R-Rated versions to the video rental marketplace. In 2005, MGM Home Entertainment released Bolero on DVD, after the rights to the majority of Cannon Film productions reverted to MGM, an ironic move, considering the events that transpired between MGM and Cannon over the original theatrical release of the film. The MGM release, although rated R, is the full, uncut version of the film.","music_by":"Peter Bernstein|Love sequences:|Elmer Bernstein|","edited_by":"Sophie Bhaud|Hughes Damois|","written_by":"John Derek","budget":"$7 million[2]"}