{"based_on":"Captains Courageous by Rudyard Kipling","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Harvey Cheyne (Freddie Bartholomew) is the spoiled son of business tycoon Frank Burton Cheyne (Melvyn Douglas). He is shunned by his classmates at a private boarding school, and eventually suspended for bad behavior. His father therefore takes his son with him on a business trip to Europe via a trans-Atlantic steamship. En route, Harvey falls overboard in the Grand Banks of Newfoundland. He is rescued by a Portuguese-American fisherman, Manuel Fidello (Spencer Tracy), and taken aboard the fishing schooner We're Here. Harvey fails to persuade captain Disko Troop (Lionel Barrymore) to take him ashore, nor can he convince him of his wealth; but the captain offers him a temporary membership in the crew until they return to port, and Harvey eventually accepts. Befriended by Captain Troop's son, Dan (Mickey Rooney), he becomes acclimated to the fishing lifestyle. In the climactic race back to the Gloucester, Massachusetts port against a rival schooner, the Jennie Cushman, Manuel climbs to the top of the mast to furl the sail, but the mast cracks and he is plunged into the water. He realizes that he is hopelessly injured, and tells the captain to cut him free. As Manuel says goodbye to Harvey, the captain cuts him free, and Manuel sinks below the water. Eventually, the schooner returns to port and Harvey is reunited with his father, whom he surprises by his own greater maturity.","In popular culture":"Holden Caulfield, protagonist of the 1951 novel The Catcher in the Rye, is thought to look like Harvey Cheyne, as in the book a prostitute tells Caulfield that he looks like the boy who falls off a boat in a film starring Spencer Tracy, though the film is not mentioned by name.The film is considered a classic semi documentary record of Grand Banks Schooners fishing under sail. The back projection shots of the period fishing schooners under sail are frequently watched by members of the American Sail Training Community for the sailing shots - rather than for the human plot.","language":"English","Reception":"Frank S. Nugent of The New York Times called the film \"another of those grand jobs of moviemaking we have come to expect of Hollywood's most prodigal studio. With its rich production, magnificent marine photography, admirable direction and performances, the film brings vividly to life every page of Kipling's novel and even adds an exciting chapter or two of its own.\"[2] Variety reported that the Kipling story had \"been given splendid production, performance, photography and dramatic composition.\"[3] Harrison's Reports wrote, \"Excellent! It is the type of entertainment that audiences will not forget soon, for its spiritual beauty makes a deep impression on one.\"[4] John Mosher of The New Yorker called it \"as rich a film as you will see this spring ... The picture is magnificent as a sketch of storm and struggle on the ocean.\"[5]","captains_courageous":"Film poster","box_office":"$3,133,000[1]","cinematography":"Harold Rosson","production_company":"Metro-Goldwyn-Mayer","directed_by":"Victor Fleming","Awards":"Spencer Tracy won the Academy Award for Best Actor for his work in this film. The movie was also nominated for three other Academy Awards:A VHS version of the 1937 film was released by MGM Home Video in 1990 followed by Warner Home Video's DVD of the film on January 31, 2006.","release_dates":"May 11, 1937 (1937-05-11)|||||","produced_by":"Louis D. Lighton","starring":"Freddie Bartholomew Spencer Tracy Lionel Barrymore Melvyn Douglas Mickey Rooney","running_time":"115 minutes","Box Office":"According to MGM records the film earned $1,688,000 in the US and Canada and $1,445,000 elsewhere resulting in a profit of $355,000.[1]","music_by":"Franz Waxman","edited_by":"Elmo Veron","written_by":"John Lee Mahin Marc Connelly Dale Van Every","budget":"$1,645,000[1]"}