{"country":"United States","distributed_by":"Columbia Pictures","Plot":"Broadway, New Year's Eve, 1928. A muckraking reporter, Waldo Winchester, frames four major stories during the wild New Year's Eve of 1928.We meet the players in a diner. The Brain, a gangster with multiple girlfriends, is accompanied by a gambler named Regret (after the only horse he ever won a bet on) and an outsider who (with his bloodhounds) is being treated to a meal. Feet Samuels (so named because of his big feet) is in love with a showgirl named Hortense Hathaway, who is tossed out of the diner because of an unsavory reputation. Feet plans to have one wild night before committing suicide, having sold his body in advance to a medical doctor.Harriet MacKyle, a sheltered but friendly socialite, makes arrangements with a smooth-talking fixer for a big party that night at her estate, where many of the players will later attend. She has an interest in the exciting but dangerous criminal element. A girl selling flowers comes in after Feet makes a full payment of a debt to the Brain, so the Brain offers $5 for a 5-cent flower, telling her to keep the change. But before he can leave, a hitman for the Brooklyn Mob stabs him. The wounded Brain tells his men to take him \"home.\" Unfortunately, his many girlfriends refuse to allow him in for various reasons.Feet gets involved in a high-stakes craps game. With considerable luck, he wins a massive payoff of money and jewelry. Regret suggests they find another game, but Feet reveals his plan to kill himself. Regret tries to talk him out of it, but Feet, sworn to see his last promise fulfilled, is adamant. Regret dials up the reporter, who is now at MacKyle's party, and asks him to talk to Hortense (his niece) and get her to realize Feet is smitten with her.Hortense must try to persuade Feet that she wants to quit her life as a lounge singer, move to New Jersey and raise a family. Regret, meanwhile, continues to be the world's unluckiest gambler, but showgirl Lovey Lou is in love with him anyway.","language":"English","Reception":"Bloodhounds of Broadway received negative reviews from critics. Produced on a budget of $4 million, the film grossed less than $44,000 in its limited release.","box_office":"$43,671","cinematography":"Elliot Davis","production_company":"American Playhouse Theatrical Films","directed_by":"Howard Brookner","release_dates":"November 3, 1989 (1989-11-03)|||||","Production":"Filming of the movie began on December 24, 1987. It filmed in four cities in New Jersey: Union City, Newark, Jersey City and Montclair.[1]","produced_by":"Samuel Benedict Chris Brigham Howard Brookner Colman deKay Kevin Dowd Lindsay Law","starring":"Matt Dillon|Jennifer Grey|Julie Hagerty|Rutger Hauer|Madonna|Esai Morales|Anita Morris|Randy Quaid|","running_time":"90 minutes","music_by":"Jonathan Sheffer","edited_by":"Camilla Toniolo","written_by":"Howard Brookner Colman deKay Damon Runyon (stories)","budget":"$4 million"}