{"country":"United States","distributed_by":"Warner Bros. Pictures (United States)|Universal Pictures (International)|","screenplay_by":"Ike Barinholtz|David Stassen|Rawson Marshall Thurber|","story_by":"Ike Barinholtz|David Stassen|","central_intelligence":"Theatrical release poster","Plot":"In 1996, Calvin Joyner is being recognized for an award at the last high school pep rally. Meanwhile, Robbie Weirdicht, an overweight kid with no friends, gets carried out of the boys' locker room while showering by school bullies and is then thrown into the gym during the pep rally just as Calvin is receiving his award and is laughed upon his nude entrance. Calvin immediately takes off his jacket and gives it to Robbie who thanks Calvin and leaves the school.Twenty years later, Calvin has married his high school sweetheart, Maggie, and works as an accountant. He is highly unsatisfied with his life as he is passed over for a promotion that was given to his former assistant. Maggie, however, is a partner at her law firm and is quite happy. She suggests they see a therapist to work on their marriage issues. Calvin does not want to go to their 20 year high school reunion taking place the next day. At the same time, Calvin receives a Facebook friend request from Bob Stone (actually Robbie, who has changed his name). They meet for drinks at a local pub. While at the pub, the pair gets into an argument with bullies who try to take Bob's chair. Bob takes out the bullies and then leaves with Calvin. Bob suggests the pair go back to their old high school and have Calvin reminisce about his glory days. Instead, Calvin is disappointed that he peaked in high school, and that his life has been declining since.As Bob drops Calvin off at his house, he asks Calvin to look at some accounting records, saying he is having payroll issues. Bob's \"accounting records\" are actually satellite codes. Bob ends up spending the night on Calvin's couch. The next morning, the CIA, led by Pam, comes to Calvin's house in search of Bob. Calvin leads them to the living room where there is no evidence of Bob's presence. Pam informs Calvin that Bob is a dangerous rogue agent that killed his former partner, Phil, to obtain all U.S. satellite codes with the intention of selling them to the highest bidder.As the CIA agents follow Calvin to his office, Bob successfully abducts Calvin, while explaining that he is trying to stop the \"Black Badger\" from selling the satellite codes, but needs Calvin's skills as a forensic accountant to figure out the exact location where the deal will happen. The pair is then attacked by Larry (a former CIA agent turned bounty hunter). During the attack, Calvin runs away but is intercepted by Pam. Pam informs Calvin that Bob is delusional and the \"Black Badger\" doesn't exist. She gives Calvin a device that will alert the CIA to his whereabouts when he is reunited with Bob. Calvin then goes to marriage counseling where Bob is posing as the marriage counselor (the real counselor he has tied up, gagged and stashed in the office closet). Bob convinces Calvin to help him and Calvin sets up a meeting with Trevor (one of Bob's bullies) so they can obtain the account number that reveals the location of the deal. Trevor helps them, but not before bullying Bob again by pretending to apologize for the past and then calling him fat. Calvin encourages Bob to punch out Trevor just like he did to the bullies at the bar, but Bob freezes up. As they are leaving Trevor's office, Pam calls Calvin and threatens to arrest Maggie if he doesn't turn Bob in. Calvin betrays Bob and Bob is arrested.As Bob is being tortured by Pam, as she believes that he has the satellite codes, Calvin decides to help Bob. He successfully breaks him out and the two get away. Calvin figures out the location of the deal is in Boston and Bob steals a gold-painted plane. As the pair arrive in a park at Boston, Calvin deduces that the deal must be going down in an underground parking garage, as it wouldn't be out in the open. Bob tells Calvin to stay in the park and enters the garage alone. However, Pam shows up, and Calvin mistakenly believes her to be the Black Badger and runs into the garage where Bob is posing as the Black Badger while meeting the buyer. Bob shoots Calvin, grazing his neck and knocking him backwards out of the room (which puts him out of the action, therefore saving his life). Bob's former partner Phil reveals himself to still be alive and claims to be the real Black Badger. While both Bob and Phil try to convince the buyer that they are the real Black Badger, each with a USB containing the satellite codes, the CIA arrives and a shootout commences. Calvin grabs both sets of satellite codes and runs upstairs back into the park where he is intercepted by both Bob and Phil. As Bob and Phil engage in hand-to-hand combat, Calvin, not knowing whom to trust, closes his eyes and fires a shot that hits Bob in the butt. After Phil knocks Bob out, Phil reveals that he is the Black Badger and is about to shoot Calvin. Bob tackles Phil and kills him by ripping his throat out. Bob believes that Calvin shot him as part of a plan to trick Phil into confessing. Calvin goes along with it.The pair arrive at the high school reunion in a CIA helicopter where Maggie spots them. She questions Calvin about his weird behavior and why he is with the marriage counselor. Bob properly introduces himself and explains the truth. As the three enter the gym where the reunion is held, Bob is having second thoughts since he didn't have any other friends in high school. Calvin convinces him to stay where he is, as he is about to be announced as the Homecoming King. Calvin reveals to Maggie that he hacked the voting systems and made Bob the king. As Bob is walking to the stage to accept his position, Trevor steps in his way and attempts to start bullying him again. Bob knocks Trevor unconscious with one punch and goes on stage where he re-lives his most embarrassing moment by taking off all his clothes. This time, however, he is full of confidence. As he walks off stage, he spots his high school crush, Darla, and the two share a kiss.In the closing scene, it is shown that Calvin has joined the CIA and as a gift for his first day on the job, Bob gives him back the Golden Jet jacket that Calvin gave him back in high school.","language":"English","Reception":"As of June 30, 2016[update], Central Intelligence has grossed $79.4 million in North America and $14.3 million in other territories for a worldwide total of $93.7 million, against a budget of $50 million.[3]In the United States, Central Intelligence opened on June 17, 2016, alongside Finding Dory, and was projected to gross around $30 million from 3,508 theaters in its opening weekend.[2] The film grossed $1.8 million from its Thursday previews and $13 million on its first day.[9] The film went on to gross $35.5 million, finishing second at the box office behind Finding Dory ($135.1 million).[10]Central Intelligence has received positive reviews from critics.[4] On Rotten Tomatoes the film has a rating of 68%, based on 128 reviews, with an average rating of 5.7/10. The site's critical consensus reads, \"Kevin Hart and Dwayne Johnson make for well-matched comic foils, helping Central Intelligence overcome a script that coasts on their considerable chemistry.\"[11] On Metacritic, the film has a score of 52 out of 100, based on 35 critics, indicating \"mixed or average reviews\".[12] Audiences polled by CinemaScore gave the film an average grade of \"A–\" on an A+ to F scale.[13]Peter Travers of Rolling Stone gave the film two out of four stars, writing, \"If you're expecting the story threads to cohere, you're in the wrong multiplex. Central Intelligence always takes the lazy way out. You go along for the ride because Hart and Johnson promise something they can't deliver: a movie as funny as they are.\"[14] Ignatiy Vishnevetsky of The A.V. Club criticized the film as a \"shambolic high-concept farce that doubles as a cautionary tale of where studio comedies go wrong,\" writing: \"In spots as indifferent and self-indulgent as any latter-day Adam Sandler production [...], [Intelligence] switches back and forth from snail-paced to incoherently over-stuffed on a moment’s notice, with no in-between mode.\"[15] Keith Phipps of Uproxx gave the film a positive review, saying: \"It all adds up to the sort of breezy, undemanding comedy that fits nicely into the summer months, and plays beautifully in endless cable repeats.\"[16]","box_office":"$93.7 million[3]","cinematography":"Barry Peterson","directed_by":"Rawson Marshall Thurber","production_companies":"New Line Cinema Bluegrass Films Principato-Young Entertainment RatPac-Dune Entertainment Perfect World Pictures","release_dates":"June 10, 2016 (2016-06-10) (Regency Village Theater)|June 17, 2016 (2016-06-17) (United States)||||","Production":"The film was announced in 2015. Thurber was selected to direct and started to write the script together with Ike Barinholtz and David Stassen. That year, Dwayne Johnson was cast alongside Kevin Hart.Principal photography began on May 6th, 2015 and took place throughout various Massachusetts locations, including Boston,[5][6] Burlington,[7] Lynn, Middleton,[7] and Quincy. Principal photography ended in July 2015. To promote the film, Johnson and Hart had an Instagram war against each other on the set.[8]","produced_by":"Michael Fottrell|Peter Principato|Scott Stuber|Paul Young|","starring":"Dwayne Johnson|Kevin Hart|","running_time":"107 minutes[1]","music_by":"Theodore Shapiro|Ludwig Göransson|","edited_by":"Michael L. Sale","Release":"The film premiered at the Regency Village Theater on June 10, 2016. Warner Bros. will handle distribution in the United States, where the film opened on June 17, 2016, while Universal Pictures will cover global distribution, as the film is released between June and July 2016.","budget":"$50 million[2]"}