{"Cast":"The band The Afghan Whigs has a cameo appearance in the film. Greg Dulli, the band's lead singer, was close friends with Ted Demme.","country":"United States","distributed_by":"Miramax Films","Plot":"Willie Conway goes home for his high school class reunion in Knights Ridge, Massachusetts. He is at a crossroads in his life and cannot decide if he should marry his girlfriend. He cannot decide if he should quit his music and take a job as a salesman. Over the course of the film, he spends time with his old friends who are all at similar crossroads. By the end they all discover what it is that they want. (see character details, under \"Cast\" section below, for other plot developments)","language":"English","Reception":"The film was released on February 9, 1996 in 752 theaters, grossing $2.7 million on its opening weekend. It went on to make $10.5 million in North America.[1]The film received fairly positive reviews and currently has a 78% rating on Rotten Tomatoes. Roger Ebert of the Chicago Sun-Times wrote: \"What's nicest about the film is the way it treasures the good feelings people can have for one another.\"[6] In the Washington Post, Desson Howe praised Natalie Portman's performance: \"As a self-described 'old soul' who connects spiritually with Hutton (they're both existential searchers), she's the movie's most poignant and witty presence.\"[7]However, Jack Mathews, in the Los Angeles Times, wrote that the film was \"about as much fun as a neighborhood bar on a Tuesday night. Its crisis: not much happening.\"[8] In her New York Times review Janet Maslin wrote that Natalie Portman got the film's \"archest dialogue\", and called her \"a budding knockout, and scene-stealingly good even in an overly showy role.\"[9]","box_office":"$10.6 million[1]","cinematography":"Adam Kimmel","directed_by":"Ted Demme","October Road":"Scott Rosenberg co-produced and co-wrote for the 2007-2008 TV series October Road. The show is loosely based on what happened after Beautiful Girls came out and how his friends reacted to a movie about their lives. Both Beautiful Girls and October Road take place in the fictional Massachusetts town of Knights Ridge, and have similar characters, jobs, plot lines.","beautiful_girls":"Theatrical release poster","release_dates":"February 9, 1996 (1996-02-09)|||||","Production":"Screenwriter Scott Rosenberg was living in Needham, MA, waiting to see if Disney would use his script for Con Air. He said in an interview, \"It was the worst winter ever in this small hometown. Snow plows were coming by, and I was just tired of writing these movies with people getting shot and killed. So I said, 'There is more action going on in my hometown with my friends dealing with the fact that they cannot deal with turning 30 or with commitment'—all that became Beautiful Girls.\"[2]Originally, James L. Brooks was interested in directing the film, according to actress Leslie Mann, who auditioned for a role but was not cast.[3]Ted Demme had the entire cast come to Minneapolis and live together for two to three weeks so that they could bond. Filming took place in the Twin Cities Metro Area communities of Edina, Marine-on-St. Croix and Stillwater, with Demme wanting to make sure that the setting was a character unto itself. He \"wanted to make it look like it's Anytown USA, primarily East Coast. And I also wanted it to feel like a real working class town\".[4] To this end, Demme drew inspiration from Michael Cimino's The Deer Hunter (1978). \"The first third of the film is really an amazing buddy movie with those five actors. You could tell they were best friends, but they all had stuff amongst them that was personal to each one of them\".[4]","produced_by":"Cary Woods","starring":"Matt Dillon Lauren Holly Timothy Hutton Rosie O'Donnell Martha Plimpton Natalie Portman Michael Rapaport Mira Sorvino Uma Thurman","running_time":"112 minutes","music_by":"David A. Stewart","edited_by":"Jeffrey Wolf","written_by":"Scott Rosenberg"}