{"country":"United States","distributed_by":"20th Century Fox","Home releases":"The film was released on VHS and Laserdisc in the U.S. in 1992 by Fox Video and re-released in 1995 under the \"Twentieth Century Fox Selections\" banner. It was released on DVD in the US in 2001 and on Blu-ray in 2011.","Plot":"High school senior Buffy Summers (Kristy Swanson) is introduced as a stereotypical, shallow cheerleader at Hemery High School in Los Angeles. She is a carefree popular mean girl whose main concerns are shopping and spending time with her rich, snooty friends and her boyfriend, Jeffrey. While at school one day, she is approached by a man who calls himself Merrick (Donald Sutherland). He informs her that she is The Slayer, or Chosen One, destined to kill vampires, and he is a Watcher whose duty it is to guide and train her. She initially rebukes his claims, but is convinced that he is right when he is able to describe a recurring dream of hers in detail. In addition, Buffy is exhibiting uncanny abilities not known to her, including heightened agility, senses, and endurance, yet she repeatedly tries Merrick's patience with her frivolous nature and sharp-tongued remarks.Meanwhile, Oliver Pike (Luke Perry), and best friend Benny (David Arquette), who resented Buffy and her friends due to differing social circles, are out drinking when they are attacked by vampires. Benny is turned but Oliver is saved by Merrick. As a vampire, Benny visits Oliver and tries to get him to join him. Later, when Oliver and his boss are discussing Benny, Oliver tells him to run if he sees him. Not only this, but a studious girl from Buffy's class, Cassandra, is abducted one night by Amilyn (Paul Reubens), acolyte of a local vampire king Lothos (Rutger Hauer), to whom she is sacrificed. When her body is found, the news spreads through LA and Hemery High, but her murder is met with indifference from Buffy's clique.When Oliver encounters Amilyn and his tribe of vampires, he attempts to run them over with his vehicle, which causes Amilyn to lose his arm, but he is still unable to escape from them, and Buffy and Merrick arrive to rescue him. Amilyn flees the fight to talk to Lothos who now realizes Buffy is the slayer. After this encounter, Buffy and Oliver start a friendship, which eventually becomes romantic and Oliver becomes Buffy's partner in fighting the undead.During a basketball game, Buffy finds out that one of the players is a vampire. After a quick chase to a parade float storage yard, Buffy finally confronts Lothos, shortly after she and Oliver take down his gang. Lothos puts Buffy in a hypnotic trance, which is broken due to Merrick's intervention. Lothos turns on Merrick and impales him with the stake he attempted to use on him. Lothos leaves, saying that Buffy is not ready. As Merrick dies, he tells Buffy to do things her own way rather than live by the rules of others. Because of her new life, responsibilities, and heartbreak, Buffy becomes emotionally shocked and starts dropping her Slayer duties. When she arrives at school, she attempts to explain everything to her friends, but they refuse to understand her as they are more concerned with their upcoming school dance, and Buffy falls out with them as she realizes she is outgrowing their immature, selfish behavior.At the senior dance, Buffy tries to patch things up with her friends but they turn against her, and she is dismayed to find Jeffrey has dumped her for one of her friends. However, she meets up with Oliver and as they start to dance and eventually kiss, Lothos leads the remainder of his minions to the school and attacks the students and the attending faculty. Buffy confronts the vampires outside while Oliver fights the vampiric Benny. After overpowering the vampires, she confronts Lothos inside the school and stabs Amilyn. Lothos hypnotises Buffy again but she uses a cross and hairspray to create a makeshift flame-thrower and burns Lothos before escaping back into the gym. Buffy sees everybody recover from the attack, but Lothos emerges again getting into a fight with Buffy, who then stakes him.As all of the survivors leave, Buffy and Oliver decide to finish their dance. The film then ends with the two of them leaving the dance on a motorcycle, and a news crew interviewing the students and the principal about the attack during the credits.","Possible remake":"On May 25, 2009, The Hollywood Reporter reported that Roy Lee and Doug Davison of Vertigo Entertainment were working with Fran Rubel Kuzui and Kaz Kuzui on a re-envisioning or relaunch of the Buffy film for the big screen. The film would not be a sequel or prequel to the existing film or television franchise and Joss Whedon would have no involvement in the project. None of the characters, cast, or crew from the television series would be featured.[11] Television series executive producer Marti Noxon later reflected that this story might have been produced by the studio in order to frighten Whedon into taking the reins of the project.[12] On November 22, 2010, The Hollywood Reporter confirmed that Warner Bros. had picked up the movie rights to the remake.[13] The film was set for release sometime in 2012.[14] 20th Century Fox, which usually holds rights to the more successful Buffy/Angel television franchise, will retain merchandising and some distribution rights.[citation needed]The idea of the remake caused wrath among fans of the TV series, since Whedon is not involved and the project does not have any connection with the show and will not conform to the continuity maintained with the Buffy the Vampire Slayer Season Eight and Season Nine comic book titles. Not only the fandom, but the main cast members of both Buffy and Angel series, expressed disagreement with the report on Twitter and in recent interviews. Sarah Michelle Gellar said, \"I think it's a horrible idea. To try to do a Buffy without Joss Whedon... to be incredibly non-eloquent: that's the dumbest idea I've ever heard.\"[15] Proposed shooting locations included Black Wood and other areas in rural England, due to budgetary constraints and the potential setting as being outside of the city, an unusual change for the franchise.In December 2011, more than a year after the official reboot announcement, the Los Angeles Times site reported that Whit Anderson, the writer picked for the new Buffy movie, had her script rejected by the producers behind the project, and that a new writer was being sought. Sources also stated that \"If you're going to bring it back, you have to do it right. [Anderson] came in with some great ideas and she had reinvented some of the lore and it was pretty cool but in the end there just wasn't enough on the page.\"[16]As of May 2015, there have been no further developments of the reboot.","language":"English","Reception":"The film received generally mixed reviews. It holds a rating of 48% of review aggregator website Metacritic indicating mixed or average reviews.[10]","buffy_the_vampire_slayer":"Theatrical release poster","box_office":"$16,624,456[1]","cinematography":"James Hayman","production_company":"Sandollar Kuzui Enterprises","directed_by":"Fran Rubel Kuzui","Soundtrack":"The soundtrack does not include every song played in the film, which also included \"In the Wind\" by War Babies and \"Inner Mind\" by Eon.","Continuity with the television show":"Many of the details given in the film differ from the continuity of the later television series. For example, Buffy's age and history is dissimilar; she is a senior in high school in the film, but the series starts with her as a sophomore. In the film, her parents are wealthy but negligent socialites who care little for her and spend their time at parties and golf tournaments; in the TV show, Buffy has a caring, single mother named Joyce. Both the vampires' and Slayer's abilities are depicted differently. The vampires in the film die like humans, while in the TV show they turn to dust, and unlike the TV show their faces remain human, albeit pale and fanged, whereas in the series they are able to take on a demonic aspect. Joss Whedon has expressed his disapproval with the movie's interpretation of the script,[5] stating \"I finally sat down and had written it and somebody had made it into a movie, and I felt like — well, that's not quite her. It's a start, but it's not quite the girl. On the movie, Merrick never mentioned he was a watcher, here he was just a mysterious guy who was more of a guide or never helped her and was very strict with her. The TV series, they mentioned a watcher when Rupert Giles mentions it to Buffy in Welcome to Hellmouth and what they do.\"[6]According to the Official Buffy Watcher's Guide, Whedon wrote the pilot to the TV series as a sequel to his original script, which is why the show makes references to events that did not occur in the film. In 1999, Dark Horse Comics released a graphic novel adaptation of Whedon's original script under the title The Origin. Whedon stated: \"The Origin comic, though I have issues with it, CAN pretty much be accepted as canonical. They did a cool job of combining the movie script with the series, that was nice, and using the series Merrick and not a certain OTHER thespian who shall remain hated.\"[7]","release_dates":"July 31, 1992 (1992-07-31)|||||","Production":"Writer Whedon sold the movie to Dolly Parton’s production company Sandollar, in the fall of 1991.[8]","Box office":"The film debuted at #5 at the North American box office[9] and eventually grossed a modest $16,624,456 against a $7 million production budget.[1]","produced_by":"Howard Rosenman Kaz Kuzui","starring":"Kristy Swanson|Donald Sutherland|Paul Reubens|Rutger Hauer|Luke Perry|","running_time":"86 minutes","music_by":"Carter Burwell","edited_by":"Jill Savitt","written_by":"Joss Whedon","budget":"$7 million"}