{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Hal Kanter","story_by":"Allan Weiss","Plot":"Chadwick Gates (Elvis Presley) has just gotten out of the Army, and is happy to be back in Hawaii with his surfboard, his beach buddies, and his girlfriend Maile Duval (Joan Blackman). His mother, Sarah Lee (Angela Lansbury), wants him to follow in his father's footsteps and take over management at the Great Southern Hawaiian Fruit Company, the family business, but Chad is reluctant, so he goes to work as a tour guide at his girlfriend's agency.","language":"English","box_office":"$4.2 million (US/ Canada rentals)[1][2]","cinematography":"Charles Lang, Jr.","production_company":"Hal Wallis Productions","directed_by":"Norman Taurog","Soundtrack":"Presley's remake of the title song introduced it to an audience too young to remember Bing Crosby's original hit version.The Blue Hawaii soundtrack album was on the Billboard Pop Albums chart for 79 weeks, where it spent 20 weeks at #1. It has been certified by the RIAA for sales of three million copies in the U.S.[10]The Blue Hawaii soundtrack album was nominated for a Grammy Award in 1961 in the category of Best Sound Track Album or Recording of Original Cast from a Motion Picture or Television.","blue_hawaii":"Theatrical release poster","release_dates":"November 22, 1961 (1961-11-22) (USA)|||||","Production":"Blue Hawaii was the first of three Elvis films to be shot in Hawaii, followed by Girls! Girls! Girls! in 1962 and Paradise, Hawaiian Style in 1965. Producer Hal B. Wallis was keen to put Presley into a film that showed how the army affected a man.[6] Actress Juliet Prowse, who had starred with Presley in GI Blues, was approached to be his love interest again. However, after her demands were put forward, Paramount decided to drop her as a possible candidate for the role, choosing Joan Blackman instead.[6] Presley was apparently so pale before shooting that Wallis personally recommended a brand of tanning lamp to darken his skin.[6] The film was announced in the fall of 1960 as Hawaii Beach Boy.[7] At the time, film producer Walter Mirisch had a similar titled film in production, \"Hawaii\", and he was upset that Wallis had chosen such a similar name.[7]Presley arrived in Hawaii on March 18, 1961, to prepare for a charity concert that he was performing on March 25 to raise funds for the Arizona Memorial at Pearl Harbor.[8] He arrived at the recording studio on March 21 to start the recording of the film's soundtrack.[8] Three weeks later, location filming had finished, including scenes at Waikiki Beach, Diamond Head, Mount Tantalus, and Hanauma Bay, a volcanic crater that is open to the sea, near the bedroom community of Hawaii Kai, a few miles away from Waikiki.[6][9] Following location filming, the crew returned to the Paramount lot to finish other scenes for the film. Presley would relax during filming by giving karate demonstrations with his friend and employee, Red West, which resulted in Presley's fingers becoming bruised and swollen. Wallis warned the female stars of the film to avoid parties hosted by Presley because they were turning up for shooting looking tired.[6]Producer Hal Wallis would use the box office returns from Blue Hawaii to finance an upcoming Wallis film, 1964's Becket, starring Richard Burton and Peter O'Toole.Presley was 26 at the time this film was released, and a not yet 36-year-old Angela Lansbury played his character's mother. Lansbury would later comment that her appearance here was one of the worst in her career.[citation needed] Nancy Walters, who was cast as the older school teacher was, in reality, only 18 months older than Presley.Much of the film was shot on location at the Coco Palms Resort on the east coast of Kauai. The resort has been abandoned since Hurricane Iniki in 1992.Although it is mentioned in the film that Chad's parents live in Kahala, one of the most expensive and exclusive areas of Honolulu in 1961, the view from their \"lanai\" (porch or terrace) shows Diamond Head as it appears from Waikiki and downtown Honolulu. In actuality, Kahala is located on the other side of Diamond Head from Waikiki.There were several scenes filmed in and around the famous Waikiki Beach, including the opening driving scenes, as well as the office scene across the street from the \"International Market\". The scenes where Chad's clients stayed in a hotel and where he picked up his tour group – as well as the beach he spent time with his girlfriend – were all filmed on the property that is now known as the Hilton Hawaiian Village on Waikiki Beach.","produced_by":"Hal B. Wallis","starring":"Elvis Presley|Joan Blackman|Angela Lansbury|","running_time":"102 minutes","music_by":"Joseph J. Lilley","edited_by":"Terry O. Morse"}