{"country":"India","distributed_by":"Yash Raj Films","Plot":"Kiran (Juhi Chawla), a college student, on her way home for Holi celebrations, hears a man serenading her across the campus in Shimla. Her heart seems to swell and she assumes that her boyfriend, Sunil (Sunny Deol), has come to meet her and escort her home. However, it isn't Sunil, but Rahul (Shah Rukh Khan), a classmate who has a crush on her. The opening number, Jaado Teri Nazar, sets the tone for the film, in which Rahul pursues Kiran with increasingly desperate vigor, much to the chagrin of Kiran, Sunil, her brother Vijay (Anupam Kher) and her sister-in-law Poonam (Tanvi Azmi).Kiran boards the train back home, disappointed that Sunil did not show up to escort her. Sunil is a Navy Marine Commando officer, and is sent on a mission to free a child hostage from some terrorists on the high seas. Courageously with just a couple of guns, and a knife, Sunil manages to take out at least a dozen machine-gun toting and heavily armed terrorists without breaking a sweat. Rahul is the son of captain Mehra (Dilip Tahil) who also happens to be the captain of Sunil. Rahul tries to be friendly with Sunil in order to be closer to Kiran.When Kiran reaches her brother's home, she is immediately accosted by a flashlight wielding Rahul, who stops her from entering with what will become his signature line, \"I love you, k-k-k-kiran\". That terrifying stutter becomes Rahul's calling card, literally, as he continues to stalk her over the phone, causing much stress to the family. In order to calm her nerves, Sunil takes Kiran to visit the small home which he bought for them to live in once they are married. For Sunil and Kiran, marriage is the solution, as they think no stalker could possibly be crazy enough to continue to make threatening phone calls after his dream girl is married.Rahul longs to be close to Kiran by any means necessary, and constantly schemes to make that happen. When he learns that her family will be celebrating Holi at their home with some friends, he decides to crash the party incognito as a member of the band joining them in Holi celebrations and taking part in song after the song. Sunil asks Kiran to offer the band some money for their performance, where Rahul, veiled in Holi colors and with an unshaven face, creeps Kiran out with one of his \"I love You, k-k-k-kiran\" outbursts. Kiran shrieks and sends Sunil off to take care of the hooligan who has invaded their home, which leads to a foot chase.When Rahul hears that Sunil and Kiran are engaged, he doesn't take the news well. He tries to shoot Sunil, when the couple are out shopping for a wedding ring, from what he believes is a safe distance. Unfortunately for Rahul, he misses and Sunil begins to chase the attacker. Rahul narrowly escapes with Sunil meeting with an accident. Soon Kiran and Sunil get married but the lovelorn Rahul does not get over Kiran yet. In fact, Rahul keeps talking to large photographs of Kiran projected on every wall of his bedroom, promises her that she will be his no matter what. He defaces the newly married couple's home with graffiti declaring his love, causing more distress to them. To get away from the stalker, Sunil takes Kiran on a surprise honeymoon to Switzerland. Learning their location through devious means, Rahul turns up at their hotel in the Alps. Kiran recognizes him from the school much to his surprise and the couple welcome him to be part of their festivities. But Sunil gets suspicious after her gets call from Vijay the same evening telling him about Rahul is the one who has been Kiran's culprit being obsessed with her and after her crazily for those days. He sends Kiran away on a boat and confronts Rahul. Rahul takes off but Sunil catches up with him in the forest where they have a fight. Surprisingly, Rahul overpowers Sunil, leaves him for dead, abducts Kiran, forcing her to marry him. Luckily for Kiran, Sunil comes back, beats Rahul badly and kills him by shooting him three bullets. The couple then head back to India, reunite with their family and live happily ever after.","language":"Hindi","box_office":"₹20 crore (equivalent to ₹101 crore or US$15 million in 2016)[1]","Remake":"Darr was remade in Kannada as Preethse, starring Upendra as Chandu (Rahul) Shiva Rajkumar as Surya (Sunil) and Bollywood actress Sonali Bendre playing Kiran.[7]","cinematography":"Manmohan Singh","directed_by":"Yash Chopra","Soundtrack":"The soundtrack for this film was written by Shiv-Hari. It became the second best selling Bollywood soundtrack of the year.[5]The film also features the song, \"Ooops Up\" by Snap! and various versions of \"Right Here Waiting\", originally recorded by Richard Marx.","Awards":"","release_dates":"24 December 1993 (1993-12-24)|||||","Production":"Yash Chopra had originally offered the role of Rahul to Ajay Devgan. However, Devgan declined because he was busy with other projects. Aamir Khan was then approached. The final star cast for the film was Sunny Deol, Divya Bharti and Aamir Khan. But Aamir was not happy with Divya in the film as he wanted Juhi Chawla but Sunny Deol wanted Divya. Yash finally gave in to Aamir Khan's demand and signed Juhi Chawla. This is when Yash Chopra and Aamir Khan had a problem. Aamir Khan also shot for the movie's climax part. But he was not happy with the way Sunny was punching Rahul as he was an established hero at that time. This was when Aamir decided pullout of Darr because he was also not happy with how Chopra directed Parampara. So he opted out of the movie.[4] Thus, Darr marked Khan's first collaboration with Chopra and Yash Raj Films.Chopra offered Sunny Deol the choice between playing the role of Rahul and Sunil. Deol chose the latter, believing it would be an asset to his career. However, this did not happen. Sanjay Dutt was the original choice of Rahul but Chopra choose another actor because of Dutt's jail sentence. Sudesh Berry was considered for the role of Rahul but after a screen test the director decided he didn't fit the role. Rishi Kapoor and Ajit's son Arbaaz Ali Khan were offered Sunil's role.","Box office":"Darr was the third highest grossing Indian film of 1993 after Aankhen and Khalnayak, being declared a \"Super Hit\" at the box office.[6]","darr:_a_violent_love_story_डर_ڈر":"Realese Poster","produced_by":"Yash Chopra","starring":"Sunny Deol Shahrukh Khan Juhi Chawla Anupam Kher Dilip Tahil","running_time":"177 minutes","music_by":"Shiv-Hari","edited_by":"Keshav Naidu","written_by":"Honey Irani Javed Siddiqui"}