{"based_on":"Beastly  by Alex Flinn","country":"United States","distributed_by":"CBS Films","screenplay_by":"Daniel Barnz","beastly":"Theatrical release poster","Plot":"Kyle Kingson (Alex Pettyfer), the arrogant and vain son of wealthy and equally arrogant and vain news anchor Rob Kingson (Peter Krause), bullies the witch Kendra Hilferty (Mary-Kate Olsen) who magically transforms handsome Kyle into a bald, tattooed, and scarred shell. If Kyle does not find someone who loves him by the next spring he will remain in this ugly state forever. Kyle is taken to live in a private house with their maid Zola Davies (Lisa Gay Hamilton) and the blind tutor Will (Neil Patrick Harris). Both are a comfort to Kyle when his father begins to neglect him.As spring draws closer, Kyle finds himself infatuated with Lindy Taylor (Vanessa Hudgens), a girl from whom he had kept his distance at his former school. He sees her father, a drug addict, engaged in an altercation with two drug dealers and shoots one dead while the other vows to kill Lindy. \"Hunter\" (Kyle) persuades Lindy’s father to allow her to move in with Kyle. At first, Kyle refuses to see Lindy. She is furious about hiding Kyle and doesn't speak to Kyle. But, eventually, Kyle reveals his state, and they begin to warm up to each other (she doesn't know Hunter is actually Kyle). Kyle writes a letter professing his love for Lindy but does not give it to her for fear of rejection. He visits Kendra to plead for more time; she refuses, but agrees to restore Will's vision and grant green cards to Zola's three children in Jamaica if he gets Lindy to fall in love with him.The criminal who threatened Lindy’s life lands in jail. Lindy’s father overdoses and is in the hospital. Kyle permits Lindy to leave and see her father and drives her to the station. He gives her the letter but regrets doing so as she tells him he’s a good friend. Lindy calls him after reading the letter, but being heartbroken Kyle does not answer the phone. Persuaded by Will and Zola, Kyle goes to meet Lindy one last time before she leaves on a school trip to Machu Picchu. Kyle tells her to go, and as she leaves, Lindy professes her love for \"Hunter\" (Kyle), saying the words \"I Love You\" to break Kyle's \"Hunter\" curse. Kyle’s normal self is restored, and Lindy runs out looking for \"Hunter\". But Lindy does not recognize him until she calls Hunter's phone, and Kyle's phone starts ringing. When Lindy realizes that Hunter is in fact Kyle the two share a passionate kiss in the side of the street.Will wakes up one morning and can see again and Zola finds three green cards for her children in the mail from the government. Kendra approaches Rob Kingson's office as a new intern, implying that Kendra will likely do the same thing to Rob as she did to Kyle. Then, in the credits, we see Lindy and Kyle on holiday together in different countries.","language":"English","Merchandising":"CBS Films announced that clothing and accessories, social expressions and games would be produced to market the film.[56] Among the products were proprietary and co-branded games and puzzles by Fundex; figures and bobbleheads worldwide by Bif Bang Pow!; costumes, masks and accessories for the US and Canada from Rubie’s; and video games worldwide from Storm City.[57]","box_office":"$43,165,571[3]","cinematography":"Mandy Walker","Marketing":"The first teaser trailer was released on November 20, 2009 during the previews of The Twilight Saga: New Moon.[49] The 23-second teaser received comments from commercial websites.[50] Annie Barrett of Entertainment Weekly wrote, \"Alex Pettyfer is giving off more of a (Disney pretty-boy) Gaston vibe than the Beast here.\"[51] A holographic poster was displayed in selected theaters. The first official poster was then released in early April 2010.[52] A featurette video which includes clips from the film, was released in early February 2010.[53] The full-length trailer premiered on April 19, 2010.[54] A new trailer, featuring a new logo, the new release date and the song \"Broken Arrow\" by Pixie Lott, was released in late 2010.[55]","directed_by":"Daniel Barnz","release_dates":"March 4, 2011 (2011-03-04)|||||","Production":"- Daniel Barnz, director of Beastly on writing the screenplay[22]The film is based on Alex Flinn's 2007 supernatural romance novel Beastly, and has been in production since CBS Films bought the rights in December 2007. In February 2009, it was announced by Amy Baer, President and CEO of CBS Films, that Daniel Barnz would direct the film and write the screenplay.[23][24] Susan Cartsonis produced the film through Storefront Films and Roz Weisberg co-produced it.[25] Initially, the executives wanted a late 2008 theatrical release; however, the WGA strike prevented that possibility.[26]Baer expressed excitement about the director, saying, \"Daniel’s fresh vision makes him one of the most exciting directors of his generation. We are thrilled to partner with him as he brings his unique voice to arguably the most universally resonant myth in storytelling.\"[24] Barnz anticipated bringing an indie sensibility to Flinn's story. \"It's a very commercial idea that I get to tell in a highly artistic fashion,\" he said. Barnz also said; \"There was this sort of hyper-modern version of this story and that it was told from his perspective, which we'd never seen before and thematically, because it's all about beauty and how you look and inner beauty that this was such a great story set in the teenage world and for teenagers, because it has such a great message to it\".[22]Barnz's script was inspired by the film Say Anything.[27] He \"immediately fell for it, because [he] saw that there was an amazing opportunity to tell a modern version of this fairytale and [he] loved the idea of it.\"[22] Barnz was happy that the story would be told from the beast's perspective and that it focused more on the romance elements than the supernatural.[28]In his role as Hunter, Pettyfer's appearance was altered with heavy makeup and prosthetics.[29] Hunter's appearance differs from the description in the novel; he has no fur or fangs.[30] Pettyfer was pleased with the revision; he said, \"I was very happy to know I wasn't going to be furry. Question is, were you happy I wasn't furry? Well, I think the audience will be happy. This beast make-up is phenomenal. You're talking to someone who is a fanatic about it [prosthetics and movie make-up] and I've never seen anything that looks remotely similar to this.\"[31]The makeup consisted of 67 pieces; seven pieces went on his head and 60 tattoos and individual scars were applied after the full-body makeup. The facial prosthetics and tattoos took almost three hours to apply and the full body makeup took the artists six hours to finish.[10] About his transformation, Pettyfer said, \"It really affected me because as soon as I shaved my head it kind of put me in this weird place, the same place [Kyle is in after his transformation] which really helped me with the role a lot. But at the same time, it kind of is a challenge because you are fighting personally with your own problems off set, but then onset you have a great resource to go to.\"[10]Tony Gardner and Alterian, Inc. designed and created the prosthetics and tattoos. Jamie Kelman handled Pettyfer's daily makeup application. Hudgens described the beast's look as \"crazy\" and that it moved her in \"a really weird and peculiar way.\"[32] Several days before the announced production date, several members of the cast were photographed en route to a wardrobe studio for fittings.[33] The costumes and clothing used in the film were designed by Suttirat Anne Larlarb.Beastly was one of the first feature films to be produced and distributed by CBS Films; it had a budget of $17 million for filming and marketing. Production began on June 13, 2009 in Montreal, Canada[34] and ended in August that year.[1] The first clip of the official Beastly trailer was filmed in Chicago, and used Walter Payton College Prep High School as Buckston Academy High School. Old Montreal and Laval were used as filming locations, and Mount Royal Park in Montreal served as Central Park in New York and other outdoor locations.[27] Local Montreal diner Place Milton was also used as a location, and was renamed Cafe Santiago for the film. Filming was completed in 45 days.[35]The Quebec government announced on June 12, 2009 that it would increase its tax credit for foreign TV and film producers filming there from 25 per cent of labor expenses to 25 per cent of the entire budget of productions shot there. The producers of Beastly chose to film in Montreal before the announcement of tax-paying increase.[17][36][37]Hudgens left for Montreal to film following the MTV Movie Awards. \"I'm laid-back about it,\" she said.[38][39] On June 4, 2009, Hudgens and Pettyfer arrived in Montreal.[40][41] Neil Patrick Harris also went to Montreal to shoot his scenes, and concurrently for his lead role in an independent film.[42] Hudgens was the first to finish shooting in order to promote the film Bandslam.[43] Re-shoots were conducted in 2010 due to the delays to the film's release and in order to \"emphasize the romantic relationship between the two main characters\".[44][45]The film score was composed by Marcelo Zarvos.[46] Songs by Swedish indie band Marching Band were featured in the film.[47] Also featured was Natalia Kills' second single, \"Wonderland\". The film's soundtrack was released on March 1, 2011,[48] and the score album was released on March 15, 2011; both albums were released by Lakeshore Records.Original Motion Picture Soundtrack:Original Motion Picture Score Soundtrack:","produced_by":"Susan Cartsonis Roz Weisberg Michael Flynn","starring":"Vanessa Hudgens Alex Pettyfer Mary-Kate Olsen Peter Krause Lisa Gay Hamilton Neil Patrick Harris","running_time":"86 minutes","music_by":"Marcelo Zarvos","edited_by":"Thomas J. Nordberg","Release":"Alliance Films, based in Montreal, released the film in Canada under a deal with CBS Films.[58] Sony Pictures handled international distribution.[59] The first planned release date was July 30, 2010, but a few weeks after Charlie St. Cloud moved to a July 30 release, CBS films released a statement through Beastly's official Facebook page. CBS films would delay the release of Beastly because it would cause a \"real dilemma\" to fans of Zac Efron and Vanessa Hudgens' relationship, .[60][61] The film's new release date was March 18, 2011 to avoid clashing with films opening during summer 2010.[7] However, the new date was four weeks after Pettyfer debuted in American cinema in I Am Number Four, and three weeks before the release of Hudgens' other film Sucker Punch. CBS Films distribution head Steven Friedlandere said, “There wasn’t much left in the summer that we could move it to. We didn’t want to go in fall, and the holidays are for four-quadrant movies. So we figured if we went to March, we’d have some school breaks happening around that time.”[62] After a successful test screening, CBS Films decided on an earlier release date, March 4, 2011. The movie was released on Blu-ray Disc on June 28, 2011.Beastly received mostly negative reviews, earning a 21% approval rating from Rotten Tomatoes from 92 reviews, with an average rating of 3.7/10. It was ranked #45 in The Times' predicted \"50 Biggest Movies of 2010\".[63] The film was screened at ShoWest and it drew enthusiastic reactions from the luncheon crowd of exhibition officials.[64][65]Beastly had the third largest weekend gross earnings behind Rango and The Adjustment Bureau. As of May 25, Beastly's total US gross is $27,865,571. It garnered $15,300,000 more in other regions, making the film's worldwide gross earnings $43,165,571.2011 Teen Choice AwardsHudgens and Pettyfer were honored as ShoWest Stars of Tomorrow for their roles in Beastly.[66]","budget":"$17 million[1][2]"}