{"country":"United States","distributed_by":"United Artists MGM Distribution Co.","deuces_wild":"Theatrical release poster","Plot":"Leon (Stephen Dorff) and Bobby (Brad Renfro) are brothers and members of the Deuces, a Brooklyn street gang. Ever since the death of their other brother Alphonse \"Allie Boy\" from a drug overdose at the hands of Marco (Norman Reedus), they keep drugs off their block. This puts them in opposition to the Vipers, another local gang headed by Marco, who want to sell drugs in the neighborhood. On the eve of Marco's return from a three-year stint in prison, a gang war seems imminent. Marco plans revenge against Leon, whom he believes ratted him out to the police.Bobby falls for a new girl who moves in across the street, Annie (Fairuza Balk), the younger sister of Jimmy \"Pockets\", a Vipers member and heroin dealer. Their attraction for each other complicates the gang rivalry. Marco attacks the block and Bobby before beating and raping Betsy (Leon's girlfriend) in order to push him over the edge. After a series of skirmishes between the Vipers and Deuces, neighborhood Mafioso Fritzy (Matt Dillon) orders Leon and Marco to make amends hours before the climactic rumble (he previously declined Marco's request to kill Leon). Leon disobeys this order in a fight at the docks where Marco is killed along with Jimmy Pockets, leaving Bobby and Annie free to take her mother to Los Angeles. Leon is shot and killed by one of Fritzy's men in retaliation for ignoring his orders. Before leaving, Bobby drops a wheelbarrow full of cinder blocks on Fritzy's car, presumably killing him.","language":"English","Reception":"The film received negative reviews and currently holds a 3% rating on Rotten Tomatoes.[1]","box_office":"$6,282,446","cinematography":"John A. Alonzo","production_company":"CineWild Eternity Pictures The Antonia Company","directed_by":"Scott Kalvert","release_dates":"May 3, 2002 (2002-05-03)|||||","produced_by":"Michael Cerenzie Willi Baer Fred Caruso Paul Kimatian","starring":"Stephen Dorff Brad Renfro Fairuza Balk Vincent Pastore Frankie Muniz Balthazar Getty Matt Dillon Norman Reedus","running_time":"98 minutes","music_by":"Stewart Copeland","edited_by":"Michael R. Miller","written_by":"Paul Kimatian Christopher Gambale","budget":"$10 million"}