{"based_on":"Dial M for Murder  by Frederick Knott","country":"United States","a_perfect_murder":"Theatrical release poster","distributed_by":"Warner Bros.","Plot":"Steven Taylor (Michael Douglas) is a Wall Street hedge fund manager whose investments and speculations allow him to live an extravagant, upper class lifestyle with his much younger wife Emily (Gwyneth Paltrow). Unfortunately, his risky investments are unraveling; to alleviate the financial pressure and to maintain his status, Steven will need his wife's personal fortune, roughly $100 million. However, Emily is having an affair with a painter, David Shaw (Viggo Mortensen), and is considering leaving her husband.Steven knows about the affair; he has also uncovered David’s dirty past as an ex-convict having a long history of conning rich women out of their money. Steven meets with David to reveal his knowledge of David's true identity and then makes him an offer of $500,000 in cash to murder his wife. At first David wants nothing to do with the plan, claiming instead that Emily and he are in love. Steven then reminds David that he already has two strikes against him and that the third arrest would be enough to send him to prison for 15 years without parole.Steven has already laid out a detailed plan to supply him with a firm alibi. He will hide Emily's latch key outside the service entrance to his apartment. Steven will then go out for his regular card game, during which time his wife usually stays in and takes a bath. David has to sneak in and kill her, making it look like a robbery.The following evening, when Emily arrives home, Steven removes the key from her keychain, hides it as planned, and then leaves. That night Steven takes a break from his card game and uses his cellphone to make a call to an automated bank number, while using a second phone to call his house. Emily leaves her bath to answer the phone but is attacked in the kitchen by a masked assailant; during their struggle she manages to kill the attacker by stabbing him in the neck with a meat thermometer.Later Steven returns—to find his wife alive and the hired killer dead. He quickly takes the key from the killer's pocket and puts it back on Emily's keychain. Police arrive, led by Detective Karaman (David Suchet). They remove the assailant's mask and Steven sees that it is not David but a stranger, someone he later learns that David hired to do the job. Steven takes Emily to her mother's house, from where she attempts to call David to let him know that she is all right. David, under the impression that she is dead, does not answer in time. Later, Steven and David meet on a ferry boat and decide to wait until Steven has another plan. Meanwhile, Emily learns of Steven's serious financial troubles and tells the detective about this, acknowledging that Steven might have a motive to kill her.David has already made a tape of Steven detailing the whole plan and demands the money promised earlier for her murder. Emily meanwhile has noticed that the key on her keychain does not belong to their home; suspecting something she goes to the apartment of the dead assailant to discover that her key, in fact, unlocks his door. Emily confronts her husband with this and the knowledge of his financial problems. To her amazement, he exposes David's sordid past and accuses him of being a blackmailer conning her and threatening him. When he saw the attacker's dead body in their kitchen, he assumed it was David and took the key from his pocket so as not to implicate Emily in any way.Steven goes to David's loft to pay him but finds a note directing him to meet in a public place. The phone rings, and Steven picks up thinking it's David, but it's a ticketing agent confirming David's train out of the city. Steven meets David in a park and hands over the money; David gives him a copy of the tape and then leaves to board a train to Montreal. Once on the train and assuming he is safe, he opens the bathroom door in his cabin; Steven lunges out and stabs him. A dying David claims to have the last laugh because he sent another copy of the tape to Emily. Steven rushes home to try to get the tape before she can. At the apartment, he finds the mail still unopened while Emily is on the terrace. He hides the money and tape in his safe before Emily enters the room.Thinking his problems are over, Steven takes a shower, but Emily sees the empty bag that contained the money. She manages to open the safe, finds the tape, and listens to it. Steven returns, and she reminds him that she still has not found her key. Emily pretends to leave to pick up food for dinner. Steven goes to the service entrance where he originally left the key for David. He finds it, and realizes that the killer had put the key back after using it to unlock the door. Emily confronts him, revealing that she knows everything now. Steven attacks her, but she has a gun and kills him, while the police qualifies her actions as self-defence and close the case.","language":"English Arabic","Reception":"The film opened in second place at the box office behind The Truman Show, grossing $16,615,704 during its first weekend. It ended up with a total worldwide gross of $128,038,368.[4]The film received mixed reviews from critics: Stephen Holden of The New York Times called it a \"skillfully plotted update of Frederick Knott's play\".[5] Roger Ebert wrote \"[It] works like a nasty little machine to keep us involved and disturbed; my attention never strayed\".[6] Meanwhile, James Berardinelli wrote that the film \"has inexplicably managed to eliminate almost everything that was worthwhile about Dial M for Murder, leaving behind the nearly-unwatchable wreckage of a would-be '90s thriller.\" A Perfect Murder holds a 55% \"Rotten\" rating on Rotten Tomatoes[7] and a score of 50/100 (\"mixed or average reviews\") from Metacritic.[8]","box_office":"$128,038,368","cinematography":"Dariusz Wolski","production_company":"Kopelson Entertainment","directed_by":"Andrew Davis","Comparisons to the original film":"In Hitchcock's Dial M For Murder, the characters played by Ray Milland and Grace Kelly are depicted as living in a modest London flat, although it is implied that they are quite wealthy, as Milland's character, Tony Wendice, is a retired tennis champion. Michael Douglas and Gwyneth Paltrow's characters are also shown as an extremely wealthy couple. Both Kelly and Paltrow's characters are shown as striking blondes. Both films make use of the mystery of the fact that no key was found on the dead man when he was killed by both Kelly and Paltrow's characters, as both their husbands had removed them in an attempt to pin the crime on their wives. Toward the beginning of Dial M For Murder, when Kelly and Robert Cummings are shown together in the Wendice flat, and Milland comes home, Kelly greets him with \"There you are!\" and kisses him. Presumably in homage to the original film, Douglas's character greets Paltrow exactly the same way when she arrives home to their apartment at the beginning of A Perfect Murder.The title A Perfect Murder matches the translation that was made in some countries of Hitchcock's film, known in Italian as Il delitto perfetto and in Spanish as Crimen perfecto; in French it was Le crime était presque parfait.","release_dates":"June 5, 1998 (1998-06-05)|||||","produced_by":"Arnold Kopelson Anne Kopelson Peter Macgregor-Scott Christopher Mankiewicz","starring":"Michael Douglas Gwyneth Paltrow Viggo Mortensen David Suchet Sarita Choudhury","running_time":"108 minutes","Alternate ending":"An alternate ending exists and is presented, with optional commentary, on the original Blu-ray disc release.[2][3] In this version, Steven comes back from finding the key replaced where he had hidden it and Emily confronts him in the kitchen rather than in their foyer. The scene plays out with the same dialogue, but Steven never physically attacks her. He still tells her that the only way she'll leave him is dead, and she shoots him. Steven then says \"You won't get away with this\" before dying and Emily purposely injures herself, making it look like self-defense.","music_by":"James Newton Howard","edited_by":"Dov Hoenig Dennis Virkler","written_by":"Patrick Smith Kelly","budget":"$60 million"}