{"based_on":"Characters  by Wes Craven Bruce Wagner William Kotzwinkle Brian Helgeland","country":"United States","distributed_by":"New Line Cinema","screenplay_by":"Leslie Bohem","story_by":"John Skipp|Craig Spector|Leslie Bohem|","Deleted scenes":"The graduation sequence was considerably cut down, which included Alice's father giving her the camera. As a result, there are a number of minor continuity errors such as Alice holding airplane tickets moments before Dan gives them to her as a surprise gift.Upon its release, the movie had to be subjected to some cuts in the sequences of Dan's, Mark's and Greta's deaths, in order to avoid being classified X by MPAA due to the extremely violent and graphic nature of those sequences. An unrated version of the film was originally released on VHS and Laserdisc. This version contained longer, more graphic versions of Dan's, Greta's and Mark's death scenes.[citation needed] In Dan's scene, cables can be seen sliding under the skin of Dan's arm, a large piece of the bike pierces his leg, and the skin on Dan's head is much more graphically torn off while he screams in pain. In Greta's scene, Freddy slices open a doll that begins to bleed, and Greta is shown to have a gaping wound in her stomach -- from which Freddy starts to feed to her. In Australia, the scenes were cut in cinemas, but restored to the VHS release.[8] In Mark's death sequence, Freddy turns him into paper and shreds him to pieces, before beheading him; decapitation scene was deleted in the original version of the film. Despite this, the Australian Classification board did not rate it \"R18+\", giving it the lower \"M15+\". As of 2010, New Line Cinema has yet to officially release the uncut version of the film on DVD; however, snippets of these scenes are found in the Nightmare 5 section of the documentary Never Sleep Again: The Elm Street Legacy.","Plot":"Taking place almost a year after The Dream Master, Alice and Dan have now started dating and there is no sign of Freddy Krueger. One day, while in the shower, she sees herself at a strange asylum. As she walks she finds that she is dressed in a nun's habit with a nametag saying Amanda Krueger. She is then attacked by patients at the hospital but wakes up before anything happens. The next day Alice is graduating from high school alongside her new friends consisting of Greta, an aspiring supermodel, Mark, a comic book geek and Yvonne, a candy striper who is also a swimmer. She only confides her nightmare to Dan, after he tells her about a trip to Europe. He tells her she is in control of her dreams, and she goes to work.While on her way to work, Alice finds herself back at the asylum, where she witnesses Amanda giving birth to a gruesomely deformed Freddy-looking baby. Amanda tries to collect the baby before it escapes, but it sneaks out of the operating room and Alice follows it into the same church where she had defeated Freddy in the previous film. The baby finds Freddy's remains and quickly grows into an adult, hinting to Alice that he's found the \"key\" to coming back before waking her up. Alarmed, she contacts Dan, who leaves the pool party. He falls asleep en route and is attacked by Freddy who sends him back to the pool. Leaving again, he finds a motorcycle which he uses to try to get to Alice. Freddy possesses the bike and injects Dan with wires, fills him with fuel and electrocutes him, turning him into a frightful creature before veering him into oncoming traffic. Hearing the explosion of Dan's vehicle impacting with a semi-truck, Alice runs out and sees his body come to life and taunt her before she passes out. Waking in a hospital, she has to take the news of Dan's death and that she is pregnant with his child. In the night, she is visited by a young boy named Jacob, but the next day Yvonne tells her there are no children on her floor, nor is there a children's ward he could have wandered in from, either.Alice tells her friends about Freddy and his lineage, but Yvonne refuses to hear it while Mark and Greta are more supportive, telling her that Freddy would need to go through them to get to her, which is what Alice claims she is afraid of most. That afternoon, at a dinner party her mother is throwing, Greta falls asleep at the table. She snaps at her mother, going on a rant over her controlling nature before Freddy arrives and literally forces Greta to eat herself alive before choking her before a laughing audience. In the real world, she falls down dead at the dinner table to the surprise of her mother and guests. Yvonne and Alice visit Mark who is grieving Greta's death and a rift forms between her and them. Mark falls asleep next and is nearly killed by Freddy's house, but Alice comes in and saves him at the last minute before seeing Jacob again. Jacob hints that she is his mother, but he flees before she wakes up. She requests an early ultrasound and discovers Freddy is feeding Jacob his victims to make him like himself. Realizing that Amanda was trying to stop Freddy, they investigate her last known whereabouts and Alice goes to sleep, hoping to find Amanda at the asylum. While there, Freddy lures her away from the asylum by threatening Yvonne, who had fallen asleep in a Jacuzzi. Alice rescues her and Yvonne finally believes the stories. Meanwhile, Mark falls asleep and is pulled into a comic book world. He unlocks his power of his comic book superhero, the Phantom Prowler, and appears to kill Freddy, who then rebounds and slashes Mark apart like a paper doll.Imploring Yvonne go to the asylum to find Amanda's remains, Alice is forced to return home and she goes to bed in order to find Freddy and save her son. She is led into an M.C. Escher-type maze before she finally draws Freddy out from within herself. Meanwhile, Yvonne finds Amanda's remains and she joins the fight in the dream world, encouraging Jacob to use the power that Freddy had been giving him. Jacob manages to destroy Freddy and his infant form is caught by his mother while Alice picks up a baby Jacob. Warning Alice away, Amanda narrowly manages to seal Freddy away in time.Several months later, Jacob Daniel Johnson is enjoying a picnic with his mom, grandfather and Yvonne. As the camera pulls away, the familiar song of Freddy's theme can be heard being hummed by children jumping rope.","language":"English","Reception":"A Nightmare on Elm Street 5: The Dream Child was released on August 11, 1989 on 1,902 theatres in North America. On the first weekend, the film grossed $8,115,176, falling behind Parenthood ($9,672,350) and James Cameron’s The Abyss ($9,319,797).[1] The film ranked No.8 at the second weekend box office with a box office performance of $3,584,320, and it dropped out from the Top 10 list ranked as No. 11 and No. 14 on the third and the fourth weekend. Overall, the film grossed $22,168,359 at US box office. It is the second-lowest grossing Nightmare on Elm Street film. The film ranked No.43 of the Top 50 highest-grossing films released in the US in 1989 and is No.37 of all slasher films cataloged by Box Office Mojo.[2]The film's distribution rights were transferred to Warner Bros. in 2008.The review aggregator website Rotten Tomatoes reported a 33% approval rating and an average rating of 4.2/10 based on 30 reviews.[3] Variety called it \"a poorly constructed special effects showcase\" with \"highly variable\" acting.[4] Caryn James of The New York Times wrote that the film \"doesn't pretend to be anything more than it is - a genre film that won't totally insult your intelligence or your eyes\".[5] Kevin Thomas of the Los Angeles Times described it as \"a dynamic, fully visually realized experience\", complimenting the acting, set design, and directing. Thomas identifies Krueger as representing the irrational adult world to teenagers.[6] Richard Harrington of The Washington Post ranked it below the first and third films, saying that the plot is too confusing.[7]Robert Englund has said that it is his least favorite film in the series next to Freddy's Revenge and Freddy's Dead.[this quote needs a citation]In an interview posted on Nightmare on Elm Street Companion, Lisa Wilcox praised Nightmare 5's Gothic tone, but also pointed out that several scenes and parts of the film's plot perhaps are too sensitive for the audiences: “...NOES 5 was much darker, literally and figuratively. The lighting was darker, and the subject matters were heavier, too...like abortion, teen motherhood, drinking and driving, bulimia, anorexia... Perhaps it was too much for a NOES film to handle. Thus, the film hit nerves too close to society home and therefore not as entertaining…” and she also gave the film a positive review in the interview, “…5 brought up interesting issues regarding teen pregnancy and rights of a mother.\"[this quote needs a citation]","a_nightmare_on_elm_street_5:_the_dream_child":"Theatrical release poster","box_office":"$22.1 million (domestic)","cinematography":"Peter Levy","production_company":"Heron Communications Smart Egg Pictures","directed_by":"Stephen Hopkins","Music":"The soundtrack album featured ten tracks. The first side consisted of heavy metal and hard rock songs, while the second consisted primarily of hip hop songs.Bruce Dickinson, lead singer of heavy metal band Iron Maiden, wrote and performed the song \"Bring Your Daughter... to the Slaughter\" for the film. A second version of the song, recorded with Iron Maiden, became the band's only Number 1 single in their native UK when released in December 1990.","release_dates":"August 15, 1989 (1989-08-15)|||||","produced_by":"Robert Shaye|Rupert Harvey|","starring":"Robert Englund|Lisa Wilcox|","running_time":"90 minutes","music_by":"Jay Ferguson","edited_by":"Brent A. Schoenfeld|Chuck Weiss|","budget":"$6 million (estimated)"}