{"country":"United States","distributed_by":"MGM/UA","Plot":"Two hitmen, Lee Woods (James Spader) and Dosmo Pizzo (Danny Aiello), walk into a bedroom where a sleeping couple, aspiring Olympic athlete Becky Foxx and her loser ex-husband Roy Foxx, are in bed. Lee injects Becky (Teri Hatcher) with a tranquilizer then shoots Roy in the head. Lee and Dosmo then drive to an abandoned area of Mulholland Drive, where Lee shoots Dosmo and blows up the car in order to set Dosmo up as the fall guy for the murder. Lee flees the scene with his glamorous Norwegian girlfriend Helga (Charlize Theron).Dosmo was wearing a bulletproof vest and survived the shooting and car explosion. He seeks shelter at the mansion of wealthy art dealer Allan Hopper (Cruttwell), where he takes Hopper and his assistant, Susan Parish (Headly), hostage. Dosmo is unaware that Hopper has called his sister, Audrey Hopper (Mason), a nurse, to come to the house. On her way, Audrey picks up Teddy Peppers (Mazursky), a down-and-out TV producer contemplating suicide.Meanwhile, Becky awakens and discovers Roy's body in bed beside her. She runs from her house and flags down two detectives, young, ambitious Wes Taylor (Eric Stoltz) and cynical veteran Alvin Strayer (Jeff Daniels), who are driving by. Although he is sympathetic, Wes begins to suspect that Becky knows more than she is saying. Becky, who had hired Lee and Dosmo to kill Roy for $30,000, was unaware that they would kill Roy in her own house. Lee goes back to the house to get the money, but encounters homicide detectives Creigton (Keith Carradine) and Valenzuela (Ada Maris) working the crime scene. Lee kills both of them. Wes decides to return to the crime scene to see if he can offer any insight on the case. Masquerading as one of the detectives, Lee lures Wes outside, intending to kill him.Becky and Helga get into an argument which escalates into a fight. Becky shoots Helga in a confused scuffle and escapes. Helga finds her way to Becky's house, where Lee has knocked Wes unconscious. Lee reluctantly decides to kill Helga instead of taking her to the hospital, concluding that her wound is too severe to be treated, but his gun jams. He turns to retrieve Wes's gun but finds that Helga has escaped and has flagged down a passing car containing Dosmo and his hostages. Susan jumps out of the car and tries to help the dying Helga, but Helga dies on the roadside.Wes is caught in the middle of a shoot out between Dosmo and Lee, and is shot in the legs. Just before Lee can kill Dosmo, Teddy, who had planned to commit suicide, shoots Lee, killing him.A grateful Wes allows Dosmo to take the $30,000 and escape with Susan. The following day, Teddy shows up to an anniversary party that Audrey is attending. As Susan and Dosmo drive down a highway, Dosmo contemplates using the money to start a pizzeria in Brooklyn; Susan smiles and he kisses her.","language":"English","Reception":"The film was given mixed reviews from critics, with a 60% \"fresh\" rating on Rotten Tomatoes, based on 53 reviews. Writing in The New York Times, Stephen Holden wrote the film \"lacks the humanity of Short Cuts or the edgy hipness of Pulp Fiction, but it is still a sleek, amusingly nasty screen debut by a filmmaker whose television credits include an Amy Fisher melodrama.\"[2] Roger Ebert gave the film three stars out of four on his rating scale, saying that it \"looks like a crime movie, but crime is the medium, not the message\".[3] Teri Hatcher's performance earned her a Golden Raspberry Award nomination for Worst Supporting Actress.[citation needed]","box_office":"$11,132,900","cinematography":"Oliver Wood","production_company":"Rysher Entertainment","directed_by":"John Herzfeld","release_dates":"September 27, 1996 (1996-09-27)|||||","produced_by":"Herb Nanas Jeff Wald","starring":"Danny Aiello Jeff Daniels Teri Hatcher Glenne Headly Marsha Mason Paul Mazursky James Spader Eric Stoltz Charlize Theron","running_time":"104 minutes","2_days_in_the_valley":"Theatrical release poster","music_by":"Anthony Marinelli[1]","edited_by":"Jim Miller Wayne Wahrman","written_by":"John Herzfeld"}