{"country":"Pakistan","distributed_by":"Geo Films Eros International Ltd.","screenplay_by":"Shoaib Mansoor","Plot":"The film starts by showing the protagonist, Zainab (Humaima Malick), about to be hanged. She tells her story to media right before this happens. She grew up with six sisters, a mother and a father. The father always wanted a son so that the son could help with the financial issues of the family; the father doesn't believe in women being gainfully employed. They have a transgender child (khawajah sara in Urdu) named Syed Saifullah Khan or Saifi (Amr Kashmiri). The father (Hakim) doesn't like Saifi since he is transgender. Saifi is deeply loved by the rest of her family. Zainab is married to a guy who keeps harassing her for not giving birth. Hence, she comes back to her father's house. Zainab's mom keeps having babies that are born dead. Zainab arranges a tubal ligation for her. When Hakim (Manzar Sehbai) finds out, he becomes very angry.[8]One day, Zainab sees Saifi dressed in women's clothes and gets very disturbed. Hakim owns a small traditional pharmacy and is approached by a man who asks him to teach The Quran to children, since Hakim is a very religious man who has bonds with the mosque. Hakim initially refuses because the man, Saqa (Is-haq), is running a brothel. Meanwhile, the mosque gives him some money to keep, since they believe him to be trustworthy. Mustafa (Atif Aslam), a neighbour, gets Saifi a job at a place where they paint trucks. There, Saifi is harassed because others discriminate against her identification.One day Saifi is raped. Another transgender person, played by Almas Bobby (who in real life is a transgender person), finds her and takes her home. Hakim overhears Saifi telling her mother and Zainab what happened. Later on, when everybody is asleep, Hakim suffocates Saifi to death with a plastic bag. He must bribe the police officer to keep it a secret with two lakhs. Hakim is forced to take money out of the masjid funds. The masjid asks for the funds, and Hakim doesn't have enough money. He is forced to go to the Saqa's house to get it.Teaching children The Quran isn't giving him enough money, so Saqa gives him another option: Hakim must marry and have a baby with Meena (Iman Ali) who is one of the prostitutes and is Saqa's (Shafqat Cheema) oldest daughter. Hakim keeps having girls, and Saqa tells him that it is the men who creates the gender. Meanwhile, Zainab gets Ayesha (Mahira Khan) and Mustafa married since Hakim found another man at the masjid and wanted to get Ayesha married to that man. Simultaneously, Hakim marries Meena. When Hakim finds out about Ayesha's marriage, he is furious but can't do anything about it. Meena has her baby, and it is a girl meaning Saqa gets to keep it. Hakim begs Meena to give him the baby so that the child doesn't have to face a horrible future. Saqa overhears and kicks Hakim out.Later on, Meena comes to give Hakim's family the baby. When Hakim's wife asks who that women was, he takes the baby and tells her that he married her. She screams at him, and he beats her up. The mother tells the kids what happened, and Zainab insists they all leave the house and move somewhere else to start a new life.At night, Saqa comes to take Meena's daughter, since Meena was not supposed to give it to Hakim. Hakim tries to kill the daughter to keep her from a horrible future. He is killed by Zainab with a fatal knock on the head. They hide the baby. Zainab tells Saqa that Hakim killed the baby and threw her out somewhere; she tells him that she killed Hakim, which is why she is being given the death penalty.Back in the present, a reporter keeps trying to prove that she is innocent but is unable to. Zainab ends by asking that why is only killing a sin? Why isn't giving birth, without any family planning, a sin? Then she is hanged. The President (Rashid Khawaja) sees the reporter's newscast that ends with that question and schedules a meeting with the topic as the same as the question. In the end, the rest of the daughters open up a restaurant called Zainab's Cafe, which becomes very successful. They also raise their new half-sister, Meena's daughter.","language":"Urdu","Critical reception":"Bol received highly positive reviews from critics. Taran Adarsh of Bollywood Hungama gave 4/5 describing it as \"A brilliant film embellished with bravura performances.\" Likewise, Komal Nahta of The Times of India gave the film 4/5 by going on to describe it as \"topical and thought-provoking.\" Saibal Chatterjee of NDTV gave 3 on 5 stating that the \"message that the film delivers is urgent, heartfelt and of considerable import.\"[14]Galaxy Lollywood, in its review gave 4.4/5 stars to the film and stated it to be \"meeting public expectations\" after Khuda Kay Liye.It was awarded the best Hindi film award in IRDS Film awards 2011 by the Institute for Research and Documentation in Social Sciences (IRDS), a Lucknow-based civil society organization for raising many social issues including the regressive attitude of a male-dominated society.[15]","box_office":"Rs19.8 crore($1.98 million[2]) (worldwide)","directed_by":"Shoaib Mansoor","Soundtrack":"Bol is the soundtrack album of the 2011 Urdu-language Pakistani film Bol by Shoaib Mansoor. Before the movie's release, Atif Aslam (who plays one of the main roles) in an interview stated, \"I have done two songs for the soundtrack. It's been a great experience working with Shoaib Mansoor, he is an amazing person and very dedicated. My role isn't controversial and we discussed it beforehand. It’s a film that is being made for a good cause.\"[21]All songs are mixed and mastered by Kashif Ejaz.[22] The singers include Atif Aslam, Sajjad Ali, Hadiqa Kiani, Ahmed Jahanzeb, Shabnam Majeed, Sahir Ali Bagga, Bina Jawad, Faiza Mujahid and Shuja Haider.[22] \"Hona Tha Pyaar\" was composed and written by Ali Javed, a 16-year-old boy from small city of Punjab, Toba Tek Singh in June 2010. The copyrights of song were sold to the team of Bol. The soundtrack was successful and generally received positive reviews from critics. However, one critical review published in The Express Tribune called the movie's soundtrack \"A surprising disappointment.\"[23]","release_dates":"24 June 2011 (2011-06-24) (Pakistan)|31 August 2011 (2011-08-31) (India & United Kingdom)||||","Box office":"It established a new box office record in Pakistani cinema. It became the highest earning film in Pakistan in its first week of release, breaking all records.[16] The previous record was held by Bollywood movie My Name Is Khan, which grossed PKR 13.417 million in its first week, whereas Bol did a business of PKR 62.792 million in six days.[17] In two weeks, the total gross revenue of the film from 24 screens amounted to PKR 94,287,090, thus finishing its run with 120 million in its bank.[18] Bol collected ₹ 2,80,00000 from 75 screens in India.[19]It got huge fame and appreciation in India, United States, Canada, United Kingdom, U.A.E and Australia .In September 2011, the Times of India reported that Sahara One network has bought seven-year satellite rights of 100 films, including Shoaib Mansoor's Bol for a total of Rs 12.2 crore for all.[20]","produced_by":"Shoman Productions","starring":"Manzar Sehbai Atif Aslam Iman Ali Mahira Khan Humaima Malik Shafqat Cheema Amr Kashmiri Zaib Rehman Rashid Khawaja","music_by":"Atif Aslam Shoaib Mansoor Sajjad Ali Ahmed Jahanzeb Hadiqa Kiyani","bol":"Theatrical release poster","Release":"Bol was released on 24 June 2011 under the banner of Geo Films. Bol also released in India on 31 August 2011, making it third Pakistani film, after Ramchand Pakistani and Khuda Kay Liye, to release in India.[10] Apart from India, Bol was released, United States, Canada, United Kingdom, U.A.E and Australia on 31 August 2011.","written_by":"Shoaib Mansoor","budget":"₨2 crore (US$200,000)"}