{"based_on":"Three-Ten to Yuma  by Elmore Leonard","country":"United States","distributed_by":"Lionsgate","screenplay_by":"Halsted Welles Michael Brandt Derek Haas","Plot":"Dan Evans (Bale) is an impoverished rancher and Civil War veteran. He owes money to Glen Hollander (Loftin) and when he fails to pay, two of Hollander's men set his barn on fire. The next morning, as Evans and his two sons drive their herd, they stumble upon outlaw Ben Wade (Crowe) and his gang who are using Evans' cattle to block the road and ambush an armored stagecoach staffed by Pinkerton agents. As Wade loots the stage, Wade discovers Evans and his two sons watching from the hills. Acknowledging that they pose no threat to him and his gang, Wade takes their horses telling Evans that he will leave them tied up on the road to Bisbee.Wade travels with his gang to the town of Bisbee to enjoy a celebratory drink at the local saloon and divide up the loot. Evans eventually arrives with lawmen from Bisbee and tries in vain to negotiate with Hollander. Enraged at the loss of his livelihood and land, Evans tries confronting Hollander in the nearby saloon. Evans instead encounters Wade, whom he distracts long enough for the railroad guards to ambush and arrest him.The coach's owner, Grayson Butterfield, enlists McElroy, Potter, Tucker (one of Hollander's men), and Evans, who agrees for a $200 fee to deliver Wade for arrest. From Evans' ranch, McElroy arranges a decoy wagon to distract Wade's gang, now led by Charlie Prince. The real prisoner transport charts a course for Contention, where Wade will be put on the 3:10 afternoon train to Yuma Territorial Prison.During the journey, Wade kills Tucker with a fork he stole from the ranch and later McElroy by throwing him off a cliff. William, Evans' oldest son, who had been following the group all the way from the ranch, intercepts Wade. While taking a shortcut through a canyon, the group is attacked by Apaches. Wade kills the attackers and escapes to a Chinese laborer construction camp, where the foreman captures him. Evans, William, Potter and Butterfield appear and regain custody of their prisoner, but Potter is killed in the process. The group arrives in Contention hours before the train's arrival time and check into a hotel, where several local marshals join them.Wade's gang members ambush the decoy wagon and interrogate the lone survivor. They learn that Wade is being delivered to Contention. Upon their arrival, they offer a reward to any citizen who helps them free Wade, and numerous men volunteer. This triggers a mass resignation of everyone escorting Wade to the train with the exception of Evans.Evans escorts Wade out of the hotel, and the two make their way across town as they evade continuous gunfire from the townsmen. Wade surprises Evans and nearly strangles him, but relents when Evans reveals that delivering Wade to the train was not just about the money, but to restore his own sense of honor. The only Civil War battle Evans had been involved in was a retreat, and his injury was sustained through friendly fire, a fact that had humiliated him ever since. Delivering Wade would restore his family's finances, guarantee their futures and serve as an accomplishment that his sons could remember well. But Evans is contracted only to successfully deliver his prisoner to the train. In light of this knowledge, Wade agrees to board the train, allowing Evans' contract to be fulfilled.However, Wade's gang members know nothing of this arrangement. As Wade finally boards, he congratulates Evans. At that moment, Prince walks up from behind and shoots Evans despite Wade's order to stop. Wade steps off the train and catches the gun belt Prince tosses him. Wade abruptly executes Prince along with the rest of his gang. William appears and draws his gun on Wade but finds that he cannot kill him, instead turning to his dying father. However, Wade boards the train and politely surrenders his weapon. Evans dies as William tells him he accomplished his mission. Wade's fate is left open as Wade rides the train around a bend. Wade lets out a whistle, and his faithful horse pricks up his ears and gallops after the train, suggesting that Wade will escape once again since he had already escaped twice from Yuma.","language":"English","Reception":"3:10 to Yuma debuted in the United States and Canada on September 7, 2007 in 2,652 theaters. In its opening weekend, the film grossed $14,035,033 and ranked #1 at the U.S. and Canadian box office. 3:10 to Yuma grossed an estimated $53,606,916 in the United States and $16,409,304 in other territories for a worldwide total of $70,016,220.[1]3:10 to Yuma received positive reviews from critics. Film review aggregator Rotten Tomatoes gave the film a rating of 89%, based on 215 reviews, with an average rating of 7.5/10. The site's critical consensus reads, \"The remake of this classic Western improves on the original, thanks to fiery performances from Russell Crowe and Christian Bale as well as sharp direction from James Mangold.\"[2] On Metacritic, the film has a score of 76 out of 100, based on 37 critics, indicating \"generally favorable reviews\".[3]Andrew Sarris of The New York Observer said \"There is more greed-driven corruption in the remake than there was in the original\" and that the film is less a remake \"than a resurrection of both the film and its now unfashionable genre.\" Sarris said Fonda and Foster \"are especially memorable\" and said \"the performances of Mr. Crowe and Mr. Bale alone are worth the price of admission.\"[17] The New Yorker film critic David Denby wrote that the film \"is faster, more cynical, and more brutal\" than the 1957 film. Denby wrote that Fonda \"gives an amazingly fierce performance\" and that Crowe \"gives a fascinating, self-amused performance\", saying \"Crowe is an acting genius.\" Denby said \"this is by far [director James Mangold's] most sustained and evocative work.\" Denby wrote that \"much of this Western is tense and intricately wrought.\"[18] Ty Burr of The Boston Globe called the film \"lean, almost absurdly satisfying.\" Burr wrote that Crowe and Bale \"are among the best, most intuitively creative we have, and whatever transpires offscreen in Crowe’s case, onscreen they only serve their characters. Neither man showboats here, and it’s a thrill to watch them work.\" Burr said that the character of Ben Wade is \"a snake and a snake charmer in one irresistible package\" and said Foster as Charlie Prince is \"mesmerizing.\" Burr said \"Bale and Crowe never once misstep\" and that Mangold \"steers clear of Deadwood revisionism.\" Burr, however, wrote that the ending \"makes little to no sense in a post-Clint Eastwood universe.\"[19]Bruce Westbrook of the Houston Chronicle gave the film 3½ stars and called it \"the best Western since Unforgiven\", calling it \"both cathartic and intelligent.\" He wrote that the film \"draws clear inspiration from the lonely heroics of High Noon\" and said \"While a wildly eventful action-adventure and outlaw shoot-'em-up, it's also a vibrant story of heroism, villainy and hard-earned redemption.\" Westbrook said that Crowe and Bale are \"at the top of their game\" and \"Crowe is reliably charismatic as a man who's less craven and bloodthirsty than wise, resourceful and expedient.\"[20] Shawn Levy of The Oregonian gave the film a \"B+\" and said the film is \"grounded in something like the credible realism of a John Ford Western but which also can appease the thirsts for blood, wit and tension harbored by fans of Quentin Tarantino.\" Levy wrote \"The original film spends much time on conversation between Wade and Evans and focuses more on Evans' wife, whereas the new film has more action sequences and is infused subtly with themes that echo vexing contemporary political and moral issues.\" Levy said \"Christian Bale gives us another of his wounded, desperate, stubborn men\" and \"Russell Crowe fills a role originated by Glenn Ford with a big dose of the mocking charisma, cool discernment and casual cruelty of Robert Mitchum.\" Levy said the climax \"sews up the narrative too quickly\", but called the film \"a fine and sturdy picture.\"[21]Christian Science Monitor critic Peter Rainer gave the film a \"B+\" and wrote \"what Alfred Hitchcock once said about thrillers also applies to Westerns: The stronger the bad guy, the better the film. By that measure, 3:10 to Yuma is excellent.\" Comparing the film to the 1957 film, Rainer wrote that the film \"is larger in scope than its predecessor, and significantly altered in its ending, but essentially it's the same old morality play.\" Rainer said the \"drippy father-son stuff is the least successful aspect of the movie.\" Rainer also wrote \"Bale acts as if he's still playing the POW survivalist from Werner Herzog's Rescue Dawn\" and said \"his hyperrealistic performance is a drag next to Crowe's dapper prince of darkness.\" Rainer said Crowe's \"underplaying here is in many ways as hammy as if he were overplaying, and that's just fine.\"[22] Richard Schickel of TIME magazine said \"when a movie is as entertaining as this one, you begin to think this formerly beloved genre is due for a revival.\" Schickel said the 1957 film \"was, in my opinion, not as good as a lot of people thought\" and said Crowe \"never settles for predictability when he's on screen and never lets us settle into complacency as we watch him.\" Schickel wrote that director Mangold \"never loses his crispness or his narrative efficiency.\" Schickel said the comparisons to Unforgiven \"are not entirely apt\", saying that \"Mangold's offering lacks the blackness and absurdity\" of that film. He wrote, \"It is more in the vein of Anthony Mann's westerns of the 1950s — trim, efficiently paced, full of briskly stated conflicts that edge up to the dark side, but never fully embrace it.\"[23]The film received two Academy Award nominations for the 80th Academy Awards. Marco Beltrami was nominated for Best Original Score, and Paul Massey, David Giammarco, and Jim Stuebe were nominated for Best Sound Mixing.[24] The film also received a nomination for Best Cast at the 14th Screen Actors Guild Awards.","3:10_to_yuma":"Theatrical release poster","box_office":"$70 million[1]","cinematography":"Phedon Papamichael","production_company":"Tree Line Film Relativity Media","directed_by":"James Mangold","release_dates":"August 22, 2007 (2007-08-22) (Los Angeles premiere)|September 7, 2007 (2007-09-07) (United States)||||","Production":"In June 2003, Columbia Pictures announced a negotiation with Mangold to helm a remake of the 1957 Western film 3:10 to Yuma, based on a script written by Michael Brandt and Derek Haas.[4] After being apart from the project for several years, Mangold resumed his role as director in February 2006. Production was slated to begin in summer 2006.[5] In the same month, Tom Cruise expressed an interest in starring as the villain in the film.[6] Eric Bana also briefly sought a role in the film.[7]In summer 2006, Columbia placed the film in turnaround, and the project was acquired by Relativity Media. Crowe and Bale were cast as the main characters, and Relativity began seeking a distributor for the film.[7] By September, Lions Gate Entertainment signed on to distribute the film.[8] Later in the month, Peter Fonda, Gretchen Mol, Dallas Roberts, Ben Foster, and Vinessa Shaw were cast. Filming was slated to begin on October 23, 2006 in New Mexico.[9] On the first day of filming, a rider and his horse were seriously injured in a scene when the horse ran directly into a camera-carrying vehicle instead of veering off as planned. The rider was hospitalized, and the horse had to be euthanized on the set. The animal's death prompted an investigation from the American Humane Association.[10] By November, the AHA concluded its investigation, finding that the horse did not respond accordingly due to having received a dual training approach and the rider not being familiar with the mount. The organization recommended no charges against the producers.[11] Principal photography took place in and around Santa Fe, Abiquiú, and Galisteo.[12] The Bonanza Creek Ranch represented the film's town of Bisbee as a \"kinder, gentler frontier town\" while Galisteo was set up to be Contention (now a ghost town), a \"much rougher, bawdier, kind of sin city\".[13] Another location was the scenic Diablo Canyon, and another was the Gilman Tunnels (35°44′03″N 106°45′53″W﻿ / ﻿35.734081°N 106.76475°W﻿ / 35.734081; -106.76475) along New Mexico State Road 485. Filming concluded on January 20, 2007.[12]After filming concluded, the owners of the Cerro Pelon Ranch petitioned to keep a $2 million expansion to the movie set on their property, which was supposed to be dismantled within 90 days. The set of 3:10 to Yuma made up 75% of the overall sets on the ranch.[14] In April 2007, the request was met by the county's development review committee to keep the expansion, which would potentially generate revenue in the future.[15]","produced_by":"Cathy Konrad","starring":"Russell Crowe Christian Bale Peter Fonda Gretchen Mol Ben Foster Dallas Roberts Alan Tudyk Vinessa Shaw Logan Lerman","running_time":"122 minutes","music_by":"Marco Beltrami","edited_by":"Michael McCusker","Release":"3:10 to Yuma was originally slated for an October 5, 2007 release, but Lionsgate moved the film's release a month earlier to September 7, 2007 to beat competing Western films The Assassination of Jesse James by the Coward Robert Ford and No Country for Old Men. As a result of the move, the studio was not able to use the Toronto Film Festival as a platform for the film's release, but it was released before a cluster of films similarly vying for awards. According to Lionsgate president Tom Ortenberg, \"In what is shaping up to be a very impressive and crowded field of upscale commercial motion pictures this fall, we wanted to be one of the first ones out, so that everything else will be measured against us.\" The earlier theatrical run positioned it for a prominent high-definition Blu-ray Disc and DVD release in the first week of January, during awards seasons. Lionsgate similarly planned this strategy for Crash (2004), which won the Academy Award for Best Picture that year.[16]In Germany, the film was released by Columbia Pictures, which had produced the 1957 original.","budget":"$55 million"}