{"Cast":"Representative of the film's plot and location, most of the cast were young, relative unknowns, and local to the area. According to the DVD's making-of featurette, the teenagers were selected from drama classes of London council estate schools, and then had to go through eight auditions before being offered a part.[9] John Boyega found out about this film from an ad placed on the internet.[10] The cast includes:","country":"United Kingdom[2]","distributed_by":"Optimum Releasing","Plot":"Walking home on Bonfire Night through a housing estate in South London, Samantha Adams (Jodie Whittaker), a 25-year-old trainee nurse, is mugged by a small gang of teenage hoodlums: Pest (Alex Esmail), Dennis (Franz Drameh), Jerome (Leeon Jones), Biggz (Simon Howard), and leader Moses (John Boyega). The attack is interrupted when a meteorite falls from the sky into a nearby car, giving Samantha the chance to escape. As Moses searches the wreck of the car for valuables, his face is scratched by a pale, hairless, eyeless dog-sized creature; the object which fell from the sky was its cocoon. The creature runs away, but the gang chase and kill it. Hoping to gain fame and fortune, they take the corpse to their acquaintance, cannabis dealer Ron (Nick Frost), to get advice on what to do. He lives at the top of their tower block, Wyndham Tower.Moses asks Ron and his boss, Hi-Hatz (Jumayn Hunter), to keep the creature in their fortified \"weed room\" while he decides how to proceed. More objects fall from the sky. Eager to fight the creatures, the gang arm themselves and go to the nearest crash site. However, they find these aliens are much larger, gorilla-sized, with spiky fur which is so black it reflects no light, huge claws and rows of glowing fangs. Fleeing the aliens, the gang are intercepted by two policemen and Moses is arrested, identified as a mugger by Samantha. The aliens, following Moses, maul the police to death and attack their van, leaving Samantha and Moses trapped inside. Dennis reaches the vehicle and drives the van away, only to crash into Hi-Hatz's car. Samantha runs away while the rest of Moses's gang catch up and confront Hi-Hatz.Enraged by the damage to his car, Hi-Hatz threatens them with a gun, refusing to believe their story of aliens, until his henchman is attacked by one, allowing the gang to escape. The gang try to flee to Wyndham Tower but are again followed and attacked en route by the aliens, where Biggz is forced to hide in a dumpster and Pest is severely bitten in the leg. They find that Samantha lives in their building, force their way into her flat, and persuade her to treat Pest's leg. An alien bursts in and Moses kills it with a samurai sword through the head. Understanding that the group was not lying about the creatures being extraterrestrial, Samantha reasons that it is safer to stay with the gang than on her own and joins them. The gang moves upstairs to the flat owned by Tia (Danielle Vitalis), Dimples (Paige Meade), Dionna (Gina Antwi) and Gloria (Natasha Jonas) believing that their security gate will keep them safe. The aliens instead attack from outside, climbing up the side of the tower block and smashing through the windows, one of whom decapitates Dennis.After Samantha saves Moses' life from one of the aliens, the girls believe them to be the focus of the creatures and kick the gang out of the flat. In the hall, the gang is attacked by Hi-Hatz and more henchmen. The gang escapes while an alien chases Hi-Hatz and his henchmen into a lift. Hi-Hatz kills the alien, though his henchmen perish, and continues his search for Moses. Making their way upstairs to Ron's weed room, the gang runs into more aliens, but using fireworks as a distraction, they manage to get through. Jerome, however, becomes disoriented in the smoke and is killed by an alien. Entering Ron's flat they find that Hi-Hatz is already there. Hi-Hatz prepares to shoot Moses but hordes of aliens smash through the window and tear off his face. Now joined by Brewis (Luke Treadaway), one of Ron's customers, Moses, Pest and Samantha retreat into the weed room, while Ron hides in the flat.Biggz, still trapped in the bin by a lurking alien, is saved by two unruly children, Probs (Sammy Williams) and Mayhem (Michael Ajao), using a water-gun filled with petrol and a flame to torch the creature, since their only apparent weakness is fire. In the weed room, Brewis notices a luminescent stain on Moses' jacket under the ultraviolet light. As a university student, Brewis theorizes that the aliens are like spores, drifting through space on solar winds until they chance on a suitable planet. After landing in an area with enough food, the female lets off a strong pheromone which will attract the male creatures to it so that they can mate and propagate their species in their new world. Brewis suggests that the smaller, hairless alien which Moses killed in the beginning was such a female and it had left a mating scent on Moses that the larger male aliens have been tracking throughout the evening. The gang form a plan for Samantha, who has not been stained with the pheromone, to go to Moses's flat and turn on the gas oven.Moses forces Pest to return the ring they stole from her, feeling guilty for having mugged her. Samantha successfully avoids the aliens, turns on the gas and leaves the Block. Moses, with the dead female alien strapped to his back, rushes out of the weed room and into his flat, while the males converge on the scent and chase Moses through the block. Inside his flat he throws the female into the kitchen and the males follow. Using fireworks, Moses ignites the gas-filled room and leaps out of the window. The explosion engulfs the flat and the aliens, but Moses survives, clinging to a Union Flag hanging from the side of the building. In the aftermath, Moses, Pest, Brewis and Ron are arrested, considered responsible for the deaths around the Block including the two policemen who had earlier arrested Moses. Samantha, however, comes to their defence. In the back of the police van, Moses and Pest hear the residents of the Block cheering for Moses.","language":"English","Reception":"On its opening theatrical weekend in the United Kingdom in May 2011, Attack the Block garnered £1,133,859, putting it in third place only slightly behind American blockbusters Thor and Fast Five; also in the opening weekend Attack the Block had the highest cinema site average by almost twice of the other films.[22] On a screen-by-screen basis, Attack the Block was the week's strongest performer.[23] The North American theatrical run began in July 2011 and was only a limited release, yet despite being shown for less than two months and in only 66 cinemas at its peak, the film grossed $1,024,175 (£659,040) on its American theatrical run.[3]Attack the Block received positive reviews from critics. Review aggregation Rotten Tomatoes gives the film a score of 90% based on 158 reviews, with an average rating of 7.4/10. The site's critical consensus reads, \"Effortlessly mixing scares, laughs, and social commentary, Attack the Block is a thrilling, brisky-paced sci-fi yarn with a distinctly British flavor.\"[24] On Metacritic, the film has a score of 75 out of 100, based on 27 critics, indicating \"generally favorable reviews\".[25]The website Slash film lists Attack the Block as a \"true cult classic\" deserving of its own action figures.[4] In his review, Chicago Sun-Times critic Roger Ebert praised the film's use of character development and the performance given by John Boyega.[26] Scott Wampler of The Examiner rated it A+ and said it was officially the best film of the 2011 film festival season and likened it to other debuts such as Neill Blomkamp's District 9 and Quentin Tarantino's Reservoir Dogs.[27] Matt Patches writing for Cinemablend said \"Attack the Block, even on its small scale, may wind up as one of the best action movies of the year\".[28] Christ Tilly at IGN gave it four stars saying \"Cornish directs with the confidence of a seasoned pro\" and calling the film \"a blast from start-to-finish.\"[29] Ben Rawson-Jones of Digital Spy awarded the movie four stars, saying that it is \"exactly the kind of distinctly homegrown product that the British film industry should be making\".[30] Mark Kermode gave a mixed review saying he did not dislike the film, but \"wanted it to be funnier\" and \"needed it to be scarier\".[31]","box_office":"£4.1 million ($5.8 million)[3]","attack_the_block":"Theatrical release poster","cinematography":"Tom Townend","directed_by":"Joe Cornish","production_companies":"Studio Canal Features Film4 UK Film Council Big Talk Pictures","release_dates":"12 March 2011 (2011-03-12) (SXSW)|11 May 2011 (2011-05-11) (United Kingdom)||||","Production":"Big Talk Pictures, known for films including Shaun of the Dead, Hot Fuzz, and Scott Pilgrim vs. The World, produced the film alongside Film4, The UK Film Council, and StudioCanal.[2]The plot was inspired by an event where the director was mugged himself, and after adding the science fiction angle into the plot, Joe Cornish interviewed various kids in youth groups in order to find out what kind of weapons they would use if a real alien invasion occurred. Cornish also based the character of the stoner Brewis on himself in his twenties.[10]Attack the Block is set in a fictional neighbourhood said in-film to be located in the London district of Brixton. It is actually a composite of various council estates across London. Director Cornish explains:\"We wanted to stamp a clear layout on the audience's minds early, and since we couldn't afford to show an aerial shot of the estate as it doesn't exist, the way to show it was by showing this top shot of the map at the very beginning of the film.\"[11]The name Wyndham Estates appears on the left of the entrance to the fictional block, referencing the English science-fiction writer John Wyndham. The science fiction writer J. G. Ballard is also referenced by one of the street names; Ballard wrote a number of novels set in large urban blocks. The film was shot across London from March to May 2010, with 6 weeks of night shoots[12] on the Heygate Estate in Elephant and Castle; Myatts Field, Brixton; Oval tube station in Kennington and the Bemerton Estate in Islington. Interior scenes were filmed at Three Mills Studios in Newham, part of the East End of London.[13]The creatures began with two men in gorilla-like suits with animatronic jaws; post-production added the unearthly qualities such as the spiky fur which doesn't reflect any light, the claws, the rows of bioluminescent jaws, and even some of their movement. In total the film features over 100 effects shots, which were completed over the course of 4 months by Swedish effects house, Fido.[14] The creatures have no eyes, and hunt and find mates using an extremely evolved sense of smell; their movement is enabled mainly through echolocation. According to the DVD commentary, the echolocation noises made by the creatures were a combination of dolphin sonar mixed digitally with the grunts and snarls of dozens of other animals, and even a woman screaming.[15] Some puppets were used, such as the smaller, hairless female alien. It terrified the young cast.[10]","produced_by":"Nira Park|James Wilson|","starring":"Jodie Whittaker|John Boyega|Alex Esmail|Franz Drameh|Leeon Jones|Simon Howard|Luke Treadaway|Jumayn Hunter|Nick Frost|","running_time":"88 minutes[1]","music_by":"Basement Jaxx|Steven Price|","edited_by":"Jonathan Amos","Release":"StudioCanal's British distribution company Optimum Releasing released the film in the United Kingdom on 11 May 2011. Sony Pictures Worldwide Acquisitions acquired this film's United States distribution rights,[16] and the group opened this film in limited theatrical release in the United States on 29 July 2011 through Screen Gems.[17] US distributors were concerned that American audiences might not understand the strong South London accents, and may have even used subtitles if it were to be released in the United States.[18] Cornish acknowledged this during the SXSW Q and A. When he asked the audience, \"Can I ask you guys something? American distributors are nervous about language, the slang\" the audience said they could understand it.[19]The film was released on DVD and Blu-ray Disc in the United Kingdom on 19 September 2011 and in the United States on 25 October 2011. Play.com have an exclusive Blu-ray and DVD double play edition, with a glow-in-the-dark sleeve, featuring the bio-luminescent jaws of one of the creatures.[20]The soundtrack for the film was an original score composed by Simon Ratcliffe and Felix Buxton of the popular British electronic music group Basement Jaxx, and Steven Price except for a few songs featured in the film but not on the soundtrack (such as the 1993 rap track \"Sound of da Police\" by KRS-One, and the 2006 reggae track \"Youths Dem Cold\" by Richie Spice, played during the end credits).The original Attack the Block soundtrack by Basement Jaxx and Steven Price features the following tracks:A rap song called \"Get That Snitch\", original to the film and rapped by the film's secondary antagonist, Hi-Hatz, is featured at various times in the film. The full song was featured on the DVD special features.The score and soundtrack album was mixed by Gareth Cousins.","written_by":"Joe Cornish","budget":"£8 million ($13 million)[3]"}