{"country":"United States","distributed_by":"New World Pictures","DVD release":"In 2003, Anchor Bay Entertainment released the Region 1 DVD box set of the first three Angel films entitled The Angel Collection.[8]","Plot":"Fifteen-year-old honor student Molly Stewart (Donna Wilkes) attends private prep school in the Los Angeles area in the daytime, but transforms herself to \"Angel\" at night: a leather mini-skirted, high-heeled street prostitute who works Hollywood Boulevard. Angel has a \"street family\" made up of aging movie cowboy Kit Carson (Rory Calhoun), street performer Yoyo Charlie (Steven M. Porter), transvestite Mae (Dick Shawn), fellow hookers Crystal (Donna McDaniel) and Lana (Graem McGavin), and her landlord, eccentric painter Solly Mosler (Susan Tyrrell).The street's dangers increase as a psycho-necrophiliac serial killer (John Diehl) begins to stalk and murder the prostitutes. Los Angeles Police Lt. Andrews (Cliff Gorman) is assigned to the case, but finds no leads. Tragedy strikes Angel's group of friends when Crystal becomes a victim.The next day at school, Molly is confronted by teacher Patricia Allen (Elaine Giftos), who is concerned about Molly's lack of extra-curricular activities. Molly explains that her mother was paralyzed by a stroke and she has to head home immediately after school each day to care for her.Lt. Andrews advises the hookers to work in pairs. Angel teams up with her partner, Lana. Lana takes a potential client to a motel room she and Angel share. When Angel shows up at the room with a client of her own a couple of hours later she finds Lana's body in the shower. Angel gives the police a description of the suspect and a composite sketch is made. The killer is brought in for a lineup and Angel recognizes him, but he shoots his way out of the police station and escapes.Andrews takes Molly/Angel home to speak with her parents, but discovers that Molly's father left nine years ago and her mother abandoned her three years ago. Molly maintains the pretense of a mother at home so she won't be sent to a foster home. She believes her father will return someday. She's paid her rent, school tuition and living expenses through prostitution since she was twelve.Despite Andrews's warnings to stay off the street, Angel/Molly purchases a pistol and returns to work. Her masquerade falls apart that night when some classmates recognize her on the street. Word flashes through the students at her school and soon everyone knows that Molly spends her evenings as a Hollywood hooker.The next day, Ms. Allen visits Molly's apartment and insists on meeting her mother. Mae pretends to be Molly's mother, but Allen isn't fooled. Mae is still at the apartment when the killer shows up later and stabs her to death. Solly discovers Mae's body.Andrews and Molly return to her apartment and find Mae's body. Molly heads out on the streets with Solly's huge, long-barreled magnum to avenge Mae, and Andrews goes after her. After a fight and chase, Carson, whom Andrews enlisted to help, shoots the killer. Molly, Andrews, and a wounded Carson walk off together and the film fades to black.","language":"English","box_office":"$17,488,564","cinematography":"Andrew Davis","directed_by":"Robert Vincent O'Neill","Soundtrack":"Craig Safan's score was released on compact disc by Intrada Records in 1993; in 2013 BSX Records released a compilation album called The Angel Trilogy, featuring Safan's album programme (plus a cover version of The Allies' \"Something Sweet\" as performed by Melody Michalski), Christopher Young's score for Avenging Angel (also previously released by Intrada) and Eric Allaman and Reinhard Scheuregger's music for Angel III: The Final Chapter.","release_dates":"January 13, 1984 (1984-01-13)|||||","Production":"Lead actress Donna Wilkes was actually twenty-four years old when she played fifteen-year-old Molly Stuart in this film. She prepared for the role by talking to real-life street prostitutes on Hollywood Boulevard, spent time with the Los Angeles Police Department, and in various halfway houses for underage children living on the streets of Los Angeles.Composer Craig Safan wrote the score to this film in less than a week. The film premiered at the Hollywood Pacific Theatre on Hollywood Boulevard. A fact sheet inside the theatre, prior to its closure in 1994, confirmed this. The theatre is also featured in the climax of the film, when a gun-toting Angel opens fire on the killer and terrifies the patrons outside.The motel in the film is the El Royale Motel at 11117 Ventura Boulevard, Studio City.[7] Most of the film was shot at real locations on and around Hollywood Boulevard.","produced_by":"Donald P. Borchers","starring":"Cliff Gorman|Susan Tyrrell|Dick Shawn|Rory Calhoun|Donna Wilkes|","running_time":"94 minutes","Sequels":"The film's cult following and box office profits were enough to spawn three sequels, although each with a different actress. The sequels were Avenging Angel (1985),[4] starring Betsy Russell, Angel III: The Final Chapter (1988),[5] starring Mitzi Kapture, and Angel 4: Undercover (1993),[6] starring Darlene Vogel. All were commercial failures at the box office.","music_by":"Craig Safan","edited_by":"Charles Bornstein","Release":"Angel was released in theaters in the United States by New World Pictures on January 13, 1984. The film failed to open in the top 5 at the box office yet grossed $2.2 million its opening weekend. The film managed to stay in the box office top ten for several months, becoming a sleeper hit and eventually earning $17,488,564. It was New World's highest grossing picture that year.[3]","written_by":"Joseph Michael Cala Robert Vincent O'Neill","budget":"$3 million"}