{"country":"United States West Germany","distributed_by":"Jensen Farley Pictures","Plot":"Linda Blair of The Exorcist stars as Carol Henderson, an immature and naive teenager who is sentenced to 18 months in a women's prison after killing a man by accident after driving drunk. Once she arrives, she meets the vicious and perverted Warden Backman (John Vernon). She also encounters the two kingpin prisoners, Ericka (Sybil Danning) and Duchess (Tamara Dobson), who are the leaders of factions in the facility's seething racial tensions. There are also the drug-dealing lesbian rapists and the prostitutes, who answer to the warden's assistant, Captain Taylor (Stella Stevens). In the meantime, Taylor's lover is clandestinely having an affair with Ericka. It's a whirlwind of dread and fury, but when the facility's corrupt administration goes too far, racial considerations are put aside as convicts of all colors and nationalities band together to fight them.[3]","chained_heat":"Chained Heat poster","language":"English","Reception":"Chained Heat opened on May 27, 1983 in 404 theaters nationwide and made $2,252,682 in its opening weekend. The film was in theaters for two and a half weeks in total. As of 2009, the film's domestic gross is $6,149,983.[4] During its release the film came under fire heavily from critics for its sexism and from gay rights activists for negative and stereotypical portrayals of lesbians as being violent and predatory. Chained Heat 's current rating on Rotten Tomatoes is 20% positive reviews.[5] Chained Heat was produced for $950,000. The film was nominated for two Razzie Awards including Worst Actress for Blair and won Worst Supporting Actress for Danning.[6]Chained Heat (as a slightly shorter edited version) has been available in a DVD box set with Red Heat and Jungle Warriors released in December, 2008.","box_office":"over $20 million[1]","cinematography":"Mac Ahlberg","production_company":"Heat GBR Intercontinental Jensen Farley Pictures TAT Filmproduktion","directed_by":"Paul Nicholas","release_dates":"May 27, 1983 (1983-05-27)|||||","produced_by":"Billy Fine Monica Teuber","starring":"Linda Blair|John Vernon|Sybil Danning|Tamara Dobson|Stella Stevens|Sharon Hughes|Susan Meschner|Greta Blackburn|Robert Miano|Edy Williams|Jennifer Ashley|Kendall Kaldwell|Dee Biederbeck|Leila Chrystie|Louisa Moritz|Nita Talbot|Michael Callan|Henry Silva|","running_time":"95 min.","Sequels":"In 1993 the film, Chained Heat II, starring Brigitte Nielsen, Paul Koslo, Kimberley Kates and Kari Whitman. The film was directed by Lloyd Simandl and released in Canada.[7] This was followed by the 1998 release of Chained Heat 3: Hell Mountain. The film starred Nicole Nieth, Kate Rodgers, and Bentley Mitchum and was directed by Mike Rhol from a screenplay by Chris Hyde.[8]Both sequels bear little to no relation to the first film.","music_by":"Joseph Conlan","edited_by":"Nino di Marco","written_by":"Aaron Butler, as Vincent Mongol Paul Nicholas","budget":"$1.3 million[1]"}