{"country":"United States","distributed_by":"Lionsgate|Roadside Attractions|","dear_white_people":"Theatrical release poster","language":"English","Reception":"Dear White People was met with critical acclaim. Review aggregator Rotten Tomatoes gave the film a 91% rating based on reviews from 114 critics, with an average score of 7.5/10. The site's consensus reads \"Dear White People adds a welcome new voice to cinema's oft-neglected discussion of race, tackling its timely themes with intelligence, honesty, and gratifyingly sharp wit.\"[14] On Metacritic, the film has a score of 79 out of 100, based on 32 critics, indicating \"generally favorable reviews\".[15]Justin Chang, in his review for Variety, said that the film \"provokes admiration for having bothered to ask some of the hard questions without pretending to know any of the answers\" and praising the cast said that \"Williams, Thompson, Parris and Bell all make strong, distinctive impressions, with Thompson perhaps the standout as the film’s sharpest and most enigmatic figure.\"[16] Justin Lowe of The Hollywood Reporter praised the performances of cast, saying, \"Thompson’s conflicted student activist, which she pulls off with practiced composure. Williams manages to consistently dial up Lionel's nervousness and bewilderment throughout the film to a point of heightened tension that necessitates decisive resolution. As lovers, then rivals who must eventually seek mutual accommodation, Parris and Bell understand that for Coco and Troy, discovering humility is just the beginning of these characters' realigned journeys.\" He further added, \"An edgy premise and memorable cast make for a potent first impression.\"[17] Zeba Blay of Indiewire gave a positive review and said, \"With its vividly drawn world and characters, the movie doesn’t presume to encompass the entirety of what it means to be black, but it does give one of the most entertaining and honest depictions of black life in a so-called “white” world in years.\"[18] Terence Johnson of ScottFeinberg.com gave a positive review to the film and said that \"Dear White People is a perfect film for today’s generation\".[19]","box_office":"$4.6 million[2]","Synopsis":"Sam White is a bi-racial film production major at the fictional Winchester University, a prestigious and predominantly white school. With her sharp tongued and witty radio show Dear White People and her self-published book, Ebony and Ivy, Sam causes a stir among the administration and student body alike, criticizing white people and the racist transgressions at Winchester.When Sam wins the election for head of house of Armstrong/Parker, the all-black house on campus, tensions rise. In winning the election, she beats her ex-boyfriend Troy Fairbanks, the son of the school's dean. Troy harbors dreams of being a comedic writer rather than a lawyer, but his father prefers that he not give white people a chance to profile him, and will accept nothing less than his best. Coco has an issue with Sam because the reality TV producer she is trying to win over would rather do a show on the witty light-skinned black girl than her. Lionel Higgins, a black gay student, gets a chance at finally finding his place at Winchester by being recruited by the school's most prestigious student paper to write a piece on Sam and the black experience at Winchester. When Kurt, a white student and son of the school's president, and his club come up with a blackface theme for their annual party in response to Sam's outspoken show, black students appear at the party, and a confrontation ensues, leading to a brawl.","cinematography":"Topher Osborn","production_company":"Code Red Films Duly Noted Homegrown Pictures","directed_by":"Justin Simien","release_dates":"January 18, 2014 (2014-01-18) (Sundance Film Festival)|October 17, 2014 (2014-10-17) (United States)||||","Production":"\"My film isn't about 'white racism' or racism at all. My film is about identity. It's about the difference between how the mass culture responds to a person because of their race and who that person understands themselves to truly be. All explored through the microcosm of a success-oriented Ivy League college.\"Simien spent five years writing the script beginning in 2007. The next year, he made a trailer to promote and gain attention and funds for his project, which went viral.[9] He also launched a campaign at Indiegogo to raise $25,000 but he got an overwhelming response and managed to raise $40,000 instead.[10]The project won Indiewire's Project of the Year title and Simien was later invited to 2013 Tribeca Film Festival to participate in Filmmaker/Industry meetings hosted by the festival.[11] Talking about Tribeca Film Festival, Simien said that \"we had a lot of meetings with a lot of studios. We had a lot of conversations with studios and distributors and basically, we decided that the best offer on the table was from an independent financier, Julie Lebedev of Code Red Films. To make it independently, that was really the dream -- because then we could make the movie we wanted to make.\"[9]Principal photography took place in late September 2013 in Minnesota, including at the University of Minnesota and other locations in Minneapolis and Saint Paul, and in Los Angeles. The filming was completed in 19 days.[12] Simien shot the film with Red Epic digital camera and said that \"I would love to shoot on film. I don't believe it's completely dead, but this format made a lot of sense for our production.\"[9][13]","TV series":"On May 5, 2016, Lionsgate announced a deal to produce a series based on the film, distributed through Netflix. This is the second Netflix original program for Lionsgate Television, following Orange Is the New Black. The show's first 10 episodes will be written by Simien.[25]","produced_by":"Effie Brown|Ann Le|Julia Lebedev|Angel Lopez|Justin Simien|Lena Waithe|","starring":"Tyler James Williams|Tessa Thompson|Kyle Gallner|Teyonah Parris|Brandon Bell|Malcolm Barrett|Dennis Haysbert|","running_time":"108 minutes[1]","music_by":"Kathryn Bostic","edited_by":"Phillip J. Bartell","written_by":"Justin Simien"}