{"Cast":"Graham described Daisy in an interview with CNN's Entertainment News. \"It's about these losers in Hollywood who want to make a movie, and I'm this naive, innocent girl who wants to be an actress. I'm willing to stop at nothing.\"[3] Graham stated that she has a \"special attachment\" to the roles she chooses, and explained \"I think it's kind of like you fall in love with the person, like you fall in love with the script.\"[3]","country":"United States","distributed_by":"Universal Pictures","Plot":"Z-grade film producer Bobby Bowfinger is extremely eager to direct a B-movie of his own and has saved up for it his entire life — he now has $2,184 to pay for production costs. He has a script (\"Chubby Rain\") penned by an accountant, Afrim, and a camera operator, Dave, with access to studio-owned equipment. Bowfinger then lines up several actors who are hungry for work; the only other thing he needs is access to a studio in order to distribute his masterwork.He manages to extract a promise from a film studio executive, Jerry Renfro, that the executive will distribute the film if it includes currently-hot action star Kit Ramsey. Ramsey — a rather pompous, neurotic, and paranoid actor — refuses, so Bowfinger constructs a plan to covertly film (on an extremely low budget) all of Ramsey's scenes without his knowledge. The actors, told that Ramsey is method acting and will not be interacting with them outside of their scenes, walk up to Ramsey in public and recite their lines while hidden cameras catch Ramsey's confused reactions.The plan goes well at first: Ramsey ends up starring (unknowingly) in the film. However, Ramsey (who is a member of a Scientology-like organization called MindHead) misinterprets the movie's sci-fi dialogue and believes he is being stalked by aliens, damaging his already-precarious mental state. He finally goes into hiding in order to maintain his sanity. This puts a hold on the film production, and leaves Bowfinger wondering what to do next.A desperate Bowfinger resorts to hiring a Ramsey lookalike named Jiff. Jiff is kind, amiable and rather clueless. He even runs through a gauntlet of \"stunt drivers\" racing along a major freeway when asked. Eventually, he becomes depressed about his lack of acting talent, but another cast member assures him that his real talent is being an exact double for Kit Ramsey. Jiff is not sure \"how much of a talent that is...I mean, I am his brother.\" Using this new knowledge, Bowfinger has Jiff find out Kit Ramsey's movements and the final, pivotal conclusion to the film is readied for shooting.All Bowfinger needs to shoot is the final scene at an observatory, with Ramsey shouting the final line \"Gotcha suckers!\" During the filming, Ramsey becomes terrified and thinks that they are real aliens. At this point, Ramsey's mentor at MindHead, Terry Stricter, has discovered evidence that Kit's 'aliens' may not be just in his head. MindHead officials track Bowfinger to the observatory, and shut down production. It seems Bowfinger will never get his film. That is until his camera crew reveals that they were filming B-roll footage of Ramsey off-set, just in case they saw anything they could use.What they got was footage of Ramsey donning a paper bag over his head and exposing himself to an amused Laker Girl Cheerleading Squad. Bowfinger shows the footage to MindHead, and blackmails them, threatening to take the footage public. Knowing that this material could ruin Ramsey's career (he is a major contributor to their operation), MindHead advises the star to finish the project. Bowfinger finally gets to sit at the premiere of a film he himself directed, and is awed. Following the arguable success of the film, Bowfinger receives a rare Fed-Ex envelope—an offer to film a martial arts film called \"Fake Purse Ninjas\" starring Bowfinger and Jiff Ramsey.","language":"English","Themes":"The fictional organization \"MindHead\" has been compared by film critics to the Church of Scientology.[12][13][14] Paul Clinton wrote in CNN online: \"'Bowfinger' could just be viewed as an out-there, over-the-top spoof about Hollywood, films, celebrities and even the Church of Scientology. But Martin has written a sweet story about a group of outsiders with impossible dreams.\"[13] Andrew O'Hehir wrote in Salon that \"Too much of 'Bowfinger' involves the filmmakers' generically wacky pursuit of the increasingly paranoid Kit, who flees into the clutches of a pseudo-Scientology outfit called MindHead (their slogan: 'Truth Through Strength').\"[14] The Denver Post, the Daily Record and the San Francisco Chronicle made similar comparisons,[15][16][17] and the Albuquerque Journal and the Fort Worth Star-Telegram called MindHead a \"thinly veiled\" parody of Scientology.[18][19] A review in The New York Times described actor Terence Stamp's role in the film as \"a cult leader for a Scientology-like organization called Mind Head\", and The Dallas Morning News and the Houston Chronicle made similar statements about Stamp's character.[20][21][22] Writer Steve Martin told the New York Daily News \"I view it as a pastiche of things I've seen come and go through the years\", and stated \"Scientology gets a lot of credit or blame right now, because they're the hottest one.\"[23] The Cincinnati Enquirer noted in its review \"For the record, Mr. Martin denies MindHead is based on Scientology.\"[24]The film spoofs the cult of celebrity and experiences film producers can undergo when attempting to get a movie made in Hollywood. Time Out Film Guide called the film a \"satire on Hollywood's lunatic fringe.\"[25] The Seattle Post-Intelligencer noted that \"it takes swipes at stupid action films\" and \"the ageism of the industry.\"[26] The Seattle Post-Intelligencer also noted Eddie Murphy's ability to spoof himself in the film, including \"kidding his own legendary paranoia, evoking his real-life sex scandal and allowing himself to be the butt of Martin's extended gag.\"[26] Leonard Schwarz of Palo Alto Online described the film as \"arch and knowing about the ways of Hollywood\", including \"producers who want to keep their cars more than their kids when they get divorced.\"[27] Russell Smith of The Austin Chronicle noted the film's satire of \"L.A. movie culture, and brain-dead blockbuster films.\"[28] An article in the San Francisco Chronicle by Bob Graham wrote that \"Martin the writer plants some wicked barbs in Hollywood's rear end about creative financing of movies and hoarding of profits, the art of the deal, hipper-than-thou attitudes and exploitation.\"[29] Laurie Scheer writes in Creative Careers in Hollywood \"Steve Martin's performance as Bobby Bowfinger is one that is not to be missed, especially if you are choosing a career as a producer.\"[30]Themes within the film have been compared to Mel Brooks' The Producers; a critique in the Denver Rocky Mountain News wrote that the film has \"..the madcap velocity of Mel Brooks' The Producers.\"[31] Roger Ebert wrote that \"Like Mel Brooks' \"The Producers\", it's about fringe players who strike out boldly for the big time.\"[32] The New York Times wrote that \"The title character in the hilarious, good-hearted Bowfinger is a tireless schemer who, like Zero Mostel in The Producers, is part of a great show-biz tradition: being ruthless, delusional and hellbent on turning lemons into lemonade.\"[33] Jeff Millar of the Houston Chronicle compared Steve Martin's character in the film to Edward Wood, Jr., and Kenneth Turan of the Los Angeles Times described Bowfinger International Pictures as \"a company so threadbare even schlockmeister Ed Wood would've looked down on it.\"[34][35] Comparisons were also made to Tim Burton's eponymous film about the director, Ed Wood.[36]","Reception":"On Rotten Tomatoes, the film received a rating of 80%, based on 108 reviews, with an average rating of 7/10. The site's consensus read: \"A witty commentary on modern film-making, with enough jokes to keep it entertaining throughout.\"[37] At Metacritic, the film holds a score of 71 out of 100, based on 33 critics, indicating \"generally favorable reviews\".[38]Roger Ebert gave the film three and a half out of four stars, and wrote \"Bowfinger is one of those comedies where everything works.\"[32] The film received three out of four stars from the TLA Video & DVD Guide, where it was described as a \"goodspirited, funny look at a hack Hollywood producer who will go to any lengths to get his film made.\"[39] The Seattle Post-Intelligencer gave the film a rating of \"A-\" in its review, writing \"This is one terrific comedy that doesn't let up for an instant.\"[26] The Rocky Mountain News highlighted the film as a \"Critics' Choice\", and wrote that \"Steve Martin takes gentle but funny aim at Hollywood\" in the film.[40] In The Washington Post, Jane Horwitz described the film as a \"riotous farce\".[41] The Kansas City Star called it a \"frequently hilarious comedy\".[42] The New York Times highly recommended the film, and reviewer Janet Maslin wrote \"This hilarious, good-hearted spiritual descendant of The Producers is a comic coup for Mr. Martin.\"[43] The Daily Mail wrote \"Martin's back to his zany best ... possibly his best ever.\"[44]A review in the Deseret Morning News was critical, giving the film two and a half out of four stars, and called it a \"funny but frantic and somewhat mean-spirited comedy.\"[45] A review in The Austin Chronicle was also critical, and film critic Russell Smith gave the film two and a half stars, and wrote \"As a diehard Martin fan, I'm still hoping for a comeback, but it'll take better efforts than this to get me back in his cheering section.\"[28] Leonard Maltin also gave the film two and a half stars, and wrote in his Leonard Maltin's Movie Guide \"Likeable costars carry this comedy a long way; there are some good laughs throughout, but it's never as satisfying as you'd like it to be.\"[46]The film debuted at the #2 spot behind The Sixth Sense, with an initial box office weekend return of US$18.2 million at 2,700 theaters in the United States.[8][47] It held onto the number two spot in its second week, earning an additional $10.7 million and grossing $35.7 million in its first ten days.[48][49][50] As of September 7, 1999, Bowfinger was at the fourth spot, with a weekend return of $7 million and a total gross of $55.5 million.[51] By September 13, 1999, the film had slipped to 5th place, with a weekend return of $3.7 million, for a total take of $60.5 million.[52] By October 11, 1999, the film had earned $65 million in the United States.[53] The film did not fare as well overseas as it did in the United States.[54]","box_office":"$98,625,775[2]","cinematography":"Ueli Steiger","production_company":"Imagine Entertainment","directed_by":"Frank Oz","bowfinger":"Theatrical release poster","release_dates":"August 13, 1999 (1999-08-13)|||||","Production":"The film was produced by Brian Grazer's company Imagine Entertainment, in conjunction with Universal Studios.[4] The working title for the film was Bowfinger's Big Thing.[5][6] The film was initially scheduled for a July 30, 1999 release, but in May 1999 Universal Studios pushed its release back to August 27, 1999.[7] Its final release date was August 13, 1999.[8][9] The film's costs amounted to USD$44 million.[10] The executives at Universal wanted to cut the freeway scene because they felt it would be too expensive; Martin replied he would not cut the funniest scene in the film.[11]","produced_by":"Brian Grazer","starring":"Steve Martin Eddie Murphy Heather Graham Christine Baranski Terence Stamp Robert Downey, Jr.","running_time":"97 minutes[1]","music_by":"David Newman","edited_by":"Rick Pearson","written_by":"Steve Martin","budget":"$55 million[2]"}