{"based_on":"Cluedo  by Anthony E. Pratt","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Jonathan Lynn John Landis","Plot":"In 1954 New England, six strangers are invited to a party at a secluded New England mansion known as Hill House. After being met at the door by the butler Wadsworth, the guests are reminded that they have been given a pseudonym to protect their true identity and asks that they only use that name with the other guests. During dinner, Wadsworth admits a seventh attendee, Mr. Boddy, and announces that each of the guests is being blackmailed:Finally, Wadsworth reveals Mr. Boddy's secret to the guests: he is the one who has been blackmailing them. As the guests begin to shout at Mr. Boddy, Wadsworth explains that he has gathered all the guests together to confront Mr. Boddy and turn him over to the police. Confronted by Wadsworth's revelation, Mr. Boddy reminds the guests that, if turned over to the police, he can reveal their secrets while in police custody. Mr. Boddy then distributes to each guest a wrapped gift box which, when opened, reveal one of six weapons: a wrench, a candlestick, a lead pipe, a knife, a revolver, and a rope with a hangman's knot. Mr. Boddy suggests that they use the weapons provided to kill Wadsworth and destroy the evidence, keeping their secrets safe. Mr. Boddy turns out the lights in the room, creating a moment of chaos in which someone shoots the revolver. When the lights come back on, Mr. Boddy is lying on the ground and is pronounced dead by Professor Plum.Everyone denies killing Mr. Boddy, and Wadsworth reveals that he arranged the event in revenge for his wife who had committed suicide after being blackmailed by Mr. Boddy for having Socialist friends. While trying to decide how to proceed, Wadsworth and the guests check on Ho, the Cook, who is found dead in the meat locker with the knife. Upon returning to The Study, Mr. Boddy is gone and is later found dead by Mrs. Peacock in the bathroom from the candlestick. Wadsworth and the guests assume there must be another person in the house that killed The Cook and Mr. Boddy, so they split up in pairs and search the house with the weapons locked in the cupboard. Over the course of search, three others visit the house and are subsequently found dead: a stranded motorist, found dead in the Lounge with the wrench; a police officer investigating the motorist's abandoned car, found dead with the lead pipe in the Library; and a singing telegram girl, found dead in the Hall with the revolver. Yvette, the maid, is found dead in the Billiard Room with the rope.Wadsworth announces to the other guests that he deduced the identity of the murderer and runs through a frantic re-enactment of the entire evening, scene by scene, with the guests in tow. Wadsworth points out that each of the victims had a connection to one of the guests and were actually accomplices that enabled Mr. Boddy to find out the secrets he later used to blackmail the guests.The accounting is interrupted by an evangelist at the front door warning \"the 'Kingdom of Heaven' is at hand\", who is encouraged to leave. Wadsworth then flips the electricity to the house.At this point, the story proceeds to one of three endings: A, B, or C.Having used her former call girl Yvette to murder Mr. Boddy and the cook, Miss Scarlet killed her and the others to keep her true business of \"secrets\" safe, planning on using the information learned tonight for her own benefit. While Miss Scarlet holds Wadsworth at gunpoint with the revolver, Wadsworth tells her that there are no more bullets in the gun, but Miss Scarlet insists she still has one left and threatens to kill him. Wadsworth reveals himself to be an undercover FBI agent and arrests Miss Scarlet as police arrive and secure the house. The evangelist is revealed to be the chief. Although still insisting to Miss Scarlet the revolver is empty, Wadsworth realizes she was right when he accidentally fires the last bullet into the air, hitting a chandelier and causing it to crash closely behind Colonel Mustard.Mrs. Peacock is revealed as the murderer of all the victims and escapes after holding the others at gunpoint. However, Wadsworth reveals himself as an FBI agent with the night's activities set up to spy on Mrs. Peacock's activities, believing her to be taking bribes by foreign powers. As Mrs. Peacock makes her way to her car, she is captured by the police, and the evangelist is revealed to be the chief.Each murder was committed by a different person: Professor Plum killed Mr. Boddy in the hall with the candlestick (knowing he was still alive all along), Mrs. Peacock killed the cook in the kitchen with the knife, Colonel Mustard killed the motorist in the lounge with the wrench (he took the key to the cupboard where the remaining weapons were locked up, opened it, took the wrench and got into the lounge via the secret passageway in the conservatory), Mrs. White killed Yvette in the billiard room with the rope (out of a strong hatred towards her and also admits that she killed her husband), and Miss Scarlet killed the cop in the library with the lead pipe. Mr. Green is then accused of killing the singing telegram girl in the hall with the revolver, but insists he did not shoot her. Wadsworth then reveals not only did he shoot her himself, but that he is in fact the real Mr. Boddy (the man Professor Plum killed was simply his butler). He had brought the other victims (his accomplices in the blackmail scheme) to the house to be killed by the guests and thus plans to continue blackmailing them now that there's no evidence against him. But Mr. Green then draws another revolver and kills the blackmailer. Mr. Green reveals to the others that he is actually an undercover FBI agent and the whole evening was a set-up to catch the criminals. The police and FBI arrive and arrest all the guests for murder as the evangelist is revealed to be the chief. When asked who \"done it,\" Green acknowledges that all of the guests are guilty of murder now, but that he killed Mr. Boddy \"in the hall...with the revolver\" in reference to the original game. Also, Mr. Green's previously stated homosexuality was presumably just part of his cover, because his final line of the movie is, \"I'm gonna go home and sleep with my wife.\"[5]","language":"English French","Reception":"The film was initially received with mixed reviews. Janet Maslin of The New York Times wrote negatively of the film and stated that the beginning \"is the only part of the film that is remotely engaging. After that, it begins to drag.\"[20] Similarly, Roger Ebert gave the film a 2 out of 4 stars review, writing that despite a \"promising\" cast, the film's \"screenplay is so very, very thin that [the actors] spend most of their time looking frustrated, as if they'd just been cut off right before they were about to say something interesting.\"[21]The film holds a 62% positive rating on the film-critics aggregator website Rotten Tomatoes, with an average score of 5.8 out of 10.[22]Clue has grossed $14,643,997 domestically, just short of its $15,000,000 budget.[2]","box_office":"$14,643,997","Remake":"Universal Studios announced in 2011 that a new film based on the game was being developed. The film was initially dropped,[23] then resumed as Hasbro teamed up with Gore Verbinski to produce and direct.[24] As of 2016, the planned remake remains in development hell.","cinematography":"Victor J. Kemper","production_company":"PolyGram Filmed Entertainment","directed_by":"Jonathan Lynn","clue":"Theatrical release poster","release_dates":"December 13, 1985 (1985-12-13)|||||","Production":"The multiple-ending concept was developed by John Landis, who claimed in an interview to have invited playwright Tom Stoppard, writer and composer Stephen Sondheim and actor Anthony Perkins to write the screenplay. The script was ultimately finished by director Jonathan Lynn.[3] A fourth ending was filmed, but Lynn removed it because, as he later stated, \"it really wasn't very good. I looked at it, and I thought, 'No, no, no, we’ve got to get rid of that.'\"[6]In an unused fourth ending, Wadsworth committed all of the murders. He was motivated by his desire for perfection. Having failed to be either the perfect husband or the perfect butler, he decided to be the perfect murderer instead. Wadsworth reports that he poisoned the champagne the guests had drunk earlier so they would soon die, leaving no witnesses. The police and the FBI arrive, and Wadsworth is arrested. He breaks free and steals a police car, but his escape is thwarted when three police dogs lunge from the back seat. This ending is documented in Clue: The Storybook, a tie-in book released in conjunction with the film.[7]Carrie Fisher was originally contracted to portray Miss Scarlet, but withdrew to enter treatment for drug and alcohol addiction.[8]Clue was filmed on sound stages at the Paramount Pictures film studios in Hollywood. The set design is credited to Les Gobruegge, Gene Nollmanwas, and William B. Majorand, with set decoration by Thomas L. Roysden.[9] To decorate the interior sets, authentic 18th and 19th century furnishings were rented from private collectors, including the estate of Theodore Roosevelt.[10] After completion, the set was bought by the producers of Dynasty, who used it as the fictional hotel The Carlton.All interior scenes were filmed at the Paramount lot, with the exception of the ballroom scene. The ballroom, as well as the driveway gate exteriors, were filmed on location at a mansion located in South Pasadena, California. This site was destroyed in a fire on October 5, 2005.[11] Exterior shots of the Pasadena mansion were enhanced with matte paintings to make the house appear much larger, and these were executed by matte artist Syd Dutton, in consultation with Albert Whitlock.The color of each character's car is the same color as his or her playing piece from the original board game.","produced_by":"Debra Hill","starring":"Eileen Brennan|Tim Curry|Madeline Kahn|Christopher Lloyd|Michael McKean|Martin Mull|Lesley Ann Warren|","running_time":"97 minutes[1]","music_by":"John Morris","edited_by":"David Bretherton Richard Haines","Release":"The film was released theatrically on December 13, 1985. Theaters received one of the three endings, and some theaters announced which ending the viewer would see.[12]The novelization was written by Michael McDowell based on the screenplay by Jonathan Lynn. There was also a children's adaptation entitled, Paramount Pictures Presents Clue: The Storybook written by Landis, Lynn, and Ann Matthews. Both adaptations were published in 1985, and differ from the movie in that they feature a fourth ending cut from the final film.[13] In this ending, Wadsworth, after pretending to be dead,[clarification needed] says that he killed Boddy as well as the other victims, and then reveals to the guests that he has poisoned them all so that there will be no witnesses and he will have committed the perfect crime. As he runs through the house to disable the phones and lock the doors, the chief detective – who had earlier been posing as an evangelist (Howard Hesseman) – returns, followed by the police, who disarm Wadsworth. Wadsworth then repeats the confession that he had given earlier to the guests, physically acting out each scene himself. When he arrives at the part about meeting Colonel Mustard at the door, he steps through the door, closes it, and locks it, leaving all the guests trapped inside. The police and guests escape through a window, while Wadsworth attempts to make a getaway in a police squad car, only to hear the growling of a Doberman Pinscher from the backseat.[14][15]The movie was released to home video in VHS format in Canada and the United States in 1986 and, on February 11, 1991, to other countries.[16] The film was released on DVD in June 2000.[17] and Blu-ray on August 7, 2012.[18]The home video, television broadcasts, and on-demand streaming by services such as Netflix include all three endings shown sequentially, with the first two characterized as possible endings but the third (Ending C) being the true one.In February 2011, La-La Land Records released John Morris' score for the film as a limited-edition soundtrack CD.[19]","budget":"$15 million"}