{"country":"United States","distributed_by":"United Artists","Plot":"Fielding Mellish (Woody Allen) is the protagonist, but he does not appear until after the opening credits. The cold open, which featured the assassination of the president of the fictional \"banana republic\" of San Marcos that completed a coup d'état bringing Gen. Emilio Molina Vargas (Carlos Montalban) to power, sets up the situation that Mellish would enter later in the movie. The scene was in the form of a championship boxing telecast on Wide World of Sports, with Don Dunphy as the host and Howard Cosell as the commentator.[4]Mellish is a neurotic blue collar man who tries to impress social activist Nancy (Louise Lasser) by trying to get in touch with the revolution in San Marcos. He visits the republic and attempts to show his concern for the native people. However, nearly killed by the local caudillo, only to be saved by the revolutionaries, he is then indebted to help them. Mellish clumsily learns how to be a revolutionary. When the revolution is successful, the Castro-style leader goes mad, forcing the rebels to place Mellish as their President.When traveling back to the U.S. to obtain financial aid, he reunites with his activist ex-girlfriend and is exposed. In a classic courtroom scene, Mellish tries to defend himself from a series of incriminating witnesses, including a reigning Miss America and a middle-aged African-American woman who facetiously claims to be J. Edgar Hoover and is taken seriously by the whole court. One of the witnesses does provide testimony favorable to Mellish, but the court clerk twists it to make him appear thoroughly dishonest. Mellish is eventually sentenced to prison, but his sentence is suspended on the condition that he does not move into the judge's neighborhood. Nancy then agrees to marry him. The film ends with the between-the-covers consummation of their marriage, an event that was over much more quickly than Nancy had anticipated. Like the opening scene, it was accompanied by Cosell providing commentary.","bananas":"Theatrical release poster by Jack Davis","language":"English","Reception":"Bananas was well received by critics and holds an 88% positive \"Fresh\" rating on Rotten Tomatoes.[6]Vincent Canby of The New York Times praised the film, saying \"Allen's view of the world is fraught with everything except pathos, and it's a view I happen to find very funny. Here is no little man surviving with a wan smile and a shrug, but a runty, wise-mouthed guy whose initial impulses toward cowardice seem really heroic in the crazy order of the way things are.\" He concluded, \"Any movie that attempts to mix together love, Cuban revolution, the C.I.A., Jewish mothers, J. Edgar Hoover and a few other odds and ends (including a sequence in which someone orders 1,000 grilled cheese sandwiches) is bound to be a little weird—and most welcome.\"[7]American Film Institute recognition","box_office":"$11,833,696","cinematography":"Andrew M. Costikyan","directed_by":"Woody Allen","release_dates":"April 28, 1971 (1971-04-28)|||||","Production":"According to an interview in the notes of the film's DVD release, Allen said that there is absolutely no blood in the film (even during executions) because he wanted to keep the light comedic tone of the film intact.Allen and Lasser were married from 1966 to 1970 and were divorced when the film was made.The title is a pun, \"bananas\" being slang for \"crazy\", as well as being a reference to the phrase \"banana republic\" describing the film's setting. The title also may be a respectful nod to The Cocoanuts, the first film by the Marx Brothers, by whom Allen was heavily influenced at the time.[citation needed] However, when Allen was asked why the film was called Bananas, his reply was, \"Because there are no bananas in it.\" In Don Quixote, U.S.A., the novel by Richard P. Powell that served as a source for Bananas, the protagonist was an agronomist specializing in bananas.","produced_by":"Jack Grossberg","starring":"Woody Allen Louise Lasser Carlos Montalban","running_time":"82 minutes","music_by":"Marvin Hamlisch","edited_by":"Ron Kalish Ralph Rosenblum","written_by":"Woody Allen Mickey Rose","budget":"$2 million"}