{"country":"United States","distributed_by":"Universal Pictures","Plot":"The movie focuses on Daphne (Diane Keaton), the loving but over-bearing mother of three girls, in particular Milly (Mandy Moore). Her other daughters Maggie (Lauren Graham) and Mae (Piper Perabo) are happily married but Milly has recently broken up with her boyfriend, and Daphne is concerned.Daphne fears that her daughter cannot find a good man on her own so she secretly places a personal ad for her daughter. She finds a potential candidate, Jason (Tom Everett Scott), and tries to orchestrate a chance meeting of the two. The plan seems flawless until Milly finds her own date, guitarist Johnny (Gabriel Macht), who happens to be a candidate Daphne rejected before. Milly is unaware of her mother's scheming and begins relationships with both Jason and Johnny at the same time, with neither aware of the other.Inevitably, this double-dating takes its toll and Milly becomes estranged from both Jason and Johnny. In Jason's case, it is because she discovers Daphne's scheming. Meanwhile, Daphne stumbles upon her own perfect match after being alone for many years and begins to challenge her search for the perfect match for Milly. Milly also realizes she has a choice to be the daughter her mother wants her to be, or to be the woman she wants herself to be. Choosing the latter, which comes with a row with her mother, leads her to reconcile with Johnny, a relationship Daphne has realized she should have tried to orchestrate in the first place.","language":"English","Reception":"In its first weekend of release, the film placed second in total box office receipts. For the weekend of February 2, 2007, the film earned $13,022,000. As of April 5, 2007, its domestic gross was $42,674,040.[1] According to Box Office Guru, \"men showed practically zero interest in the Universal release. Studio research showed that 82% of the audience was female. 55% of the turnout was 35 or older. 83% was Caucasian.\"[3]The film received negative reviews, scoring 5% on Rotten Tomatoes, where it eventually earned the \"Moldy Tomato Award\" - awarded to the worst-reviewed film of the year.[4][5] William Booth of the Washington Post rated it the worst movie of 2007.[6] Diane Keaton's performance in the film earned her a Golden Raspberry Award nomination for Worst Actress, where she lost to Lindsay Lohan for I Know Who Killed Me.","box_office":"$69,485,490[1]","because_i_said_so":"Theatrical release poster","cinematography":"Julio Macat","production_company":"Gold Circle Films","Marketing":"The film has a marketing tie-in allowing customers to buy panties with different sayings from the movie.[2]","directed_by":"Michael Lehmann","release_dates":"February 2, 2007 (2007-02-02)|||||","produced_by":"Paul Brooks Jessie Nelson","starring":"Diane Keaton Mandy Moore Gabriel Macht Tom Everett Scott Lauren Graham Colin Ferguson Piper Perabo Stephen Collins","running_time":"102 minutes","music_by":"David Kitay","edited_by":"Paul Seydor Troy Takaki","written_by":"Karen Leigh Hopkins Jessie Nelson","budget":"$39 million"}