{"country":"United States","distributed_by":"Columbia Pictures","Plot":"After a weekend of emotional honesty at an Esalen-style retreat, Los Angeles sophisticates Bob and Carol Sanders (played by Robert Culp and Natalie Wood) return to their life determined to embrace complete openness. They share their enthusiasm and excitement over their new-found philosophy with their more conservative friends Ted and Alice Henderson (Elliott Gould and Dyan Cannon), though their friends remain doubtful. Soon after, Bob, a filmmaker, has an affair with a young, blonde production assistant on a film shoot in San Francisco. He admits this to Carol after arriving home, describing the event as a purely physical act, not an emotional one. To Bob's surprise, Carol is completely accepting of this. Later, Carol gleefully reveals the affair to Ted and Alice as they are leaving a dinner party. Alice is particularly disturbed both by Bob's infidelity, as well as Carol's candor, becoming physically ill on the drive home. She and Ted have a hard time coping with the news in bed later that evening. However, as time passes, they grow to accept that Bob and Carol really are fine with the affair. Later, Ted admits to Bob that he was tempted to have an affair once, but never went through with it; Bob tells Ted he should, rationalizing: \"You've got the guilt anyway. Don't waste it.\"During another visit to San Francisco, Bob decides to skip a second encounter with the blonde woman, and instead returns home a day earlier than expected. When he arrives, he finds that Carol is having an affair of her own, with her tennis instructor. Although initially outraged, Bob quickly realizes that, like his own affair, the encounter was purely physical. Bob settles down, and even shares a drink and conversation with the tennis instructor.When the two couples travel together to Las Vegas, Bob and Carol reveal Carol's affair to Ted and Alice. Ted then admits to an affair on a recent business trip to Miami. An outraged Alice demands that this new ethos be taken to its obvious conclusion: a mate-sharing foursome. Ted is reluctant, explaining that he loves Carol \"like a sister\", but eventually acknowledges that he finds her attractive. After discussing it, all four remove their clothes and climb into bed together. Swapping partners, Bob and Alice kiss fervently, as do Ted and Carol; however, after a few moments, all four simply stop. The scene cuts to the couples walking to the elevator, riding it down, and walking out of the casino hand-in-hand with their original partners. The movie closes with a large crowd forming in the casino parking lot, where the four main characters exchange long stares with each other and with strangers, reminiscent of the non-verbal communication shown in the early scene at the retreat.","language":"English","TV version":"A sitcom based on the film appeared on ABC during the 1973–74 season, starring Anita Gillette, Robert Urich, David Spielberg, and Anne Archer. A 10-year-old Jodie Foster also appeared as Ted and Alice's daughter.Because of the overt sexual nature of the film – when it was released it was rated R – much of the humor could not be translated into a network TV project. Thus the characters needed to be substantially \"toned down\", losing much of the film's edge. The series did poorly and was canceled after only one season.[5]","Reaction":"Bob & Carol & Ted & Alice became the signature film for Paul Mazursky and was a critical and commercial success. It was the fifth highest grossing film of 1969. After this film's release, it led to other movies dealing with wife swapping, infidelity, and other types of experimentation with interpersonal relationships inside American society. Mazursky himself would do a few more stories set in California, including Alex in Wonderland and Down and Out in Beverly Hills.Writing in The New Yorker the film critic Pauline Kael praised both the film and director Mazursky, calling it \"a slick, whorey movie, and the liveliest American comedy so far this year. Mazursky, directing his first picture, has developed a style from satiric improvisational revue theatre—he and Tucker [co-writer] were part of the Second City troupe—and from TV situation comedy, and, with skill and wit, has made this mixture work—though it looks conventional, it isn't \".[2]Natalie Wood decided to gamble her $750,000 salary on a percentage of the gross, earning $5 million over the course of three years. She had deeply regretted declining a similar offer with the box office smash West Side Story.[3]","box_office":"$31,897,253[1]","cinematography":"Charles Lang","directed_by":"Paul Mazursky","Awards and honors":"Bob & Carol & Ted & Alice was nominated for four 1969 Academy Awards, for Best Cinematography; Best Screenplay, and Best Supporting Actor and Actress for Gould and Cannon.It received the 1969 New York Film Critics Awards for Best Supporting Actress (Cannon) and Best Screenplay and the 1969 Writers Guild of America Award for Best-Written American Comedy Written Directly for the Screen.[4]","References":"Notes","release_dates":"September 17, 1969 (1969-09-17)|||||","produced_by":"Larry Tucker","starring":"Natalie Wood Robert Culp Elliott Gould Dyan Cannon","running_time":"101 minutes","music_by":"Score: Quincy Jones Songs: Burt Bacharach (music) Hal David (lyrics)","bob_&_carol_&_ted_&_alice":"original film poster","edited_by":"Stuart H. Pappe","written_by":"Paul Mazursky Larry Tucker","budget":"$2 million"}