{"based_on":"Blindness  by José Saramago","Cast":"Secondary characters include:Meirelles chose an international cast. Producer Niv Fichman explained Meirelles' intent: \"He was inspired by [Saramago's] great masterwork to create a microcosm of the world. He wanted it cast in a way to represent all of humanity.\"[10]","country":"Canada Brazil Japan","distributed_by":"Focus Features Miramax Films","screenplay_by":"Don McKellar","blindness":"Theatrical release poster","Plot":"A young Japanese professional is struck blind in his car at a crossing and is then approached by a few people, one offers to drive him home and steals his car. The blinded man describes his sudden affliction: an expanse of dazzling white.Upon arriving home and noticing her husband's blindness, the man's wife takes him to a local ophthalmologist who, after testing the man's eyes, can identify nothing wrong and recommends further evaluation at a hospital. Among the doctor's patients are an old man with a black eye-patch, a woman with dark glasses and a young boy.During a dinner with his wife, the doctor discusses the strange case. The woman with dark glasses, revealed to be a call-girl, becomes the third victim of the strange blindness after an appointment with a john in a hotel.The next day, the doctor realizes that he has gone blind. Around the city, more citizens are struck blind, causing widespread panic, and the government organizes a quarantine for the blind in a derelict asylum. When a hazmat crew arrives to pick up the doctor, his wife climbs into the van, lying that she has gone blind in order to accompany him.In the asylum, the doctor and his wife are first to arrive and both agree they will keep her sight a secret. Several others arrive: the woman with dark glasses, the Japanese man, the car thief, and the young boy. The wife comes across the old man with the eye-patch, who describes the condition of the world outside. The sudden blindness, known as the \"white sickness\", is now international, with hundreds of cases reported every day. The increasingly totalitarian government resorts to increasingly ruthless measures to try to staunch the epidemic, refusing the sick aid or medicines.As more blind people are crammed into the prison, overcrowding and lack of outside support causes hygiene and living conditions to degrade. Soon, the walls and floors are caked in filth and human feces. Anxiety over the availability of food undermines the morale and the lack of organization prevents the fair distribution of food. The soldiers who guard the asylum become hostile.Living conditions degenerate further when an armed clique of men, led by an ex-barman who declares himself the king of ward 3 gains control over the food deliveries. The MRE rations are distributed only in exchange for valuables, and then for the women of the other wards. Faced with starvation, the doctor's wife snaps and murders the king. His death initiates a chaotic war between the wards, which culminates with the asylum being burned down and most of the inmates dying in the fire. The survivors discover that the military have abandoned their posts and they are free to venture into the city.Society has fallen as the entire population is blind amid a city devastated and overrun with filth and dead bodies. The doctor's wife leads her husband and others in search of food and shelter. The doctor and his wife arrive in a supermarket filled with stumbling blind people and they find food in a basement storeroom. As she prepares to leave and meet her husband outside, she is attacked by the starving people who smell the food she is carrying. Her husband, now used to his blindness, saves her and they manage to return to their friends.The doctor and his wife with their new \"family\" make their way back to the doctor's house, where they establish a permanent home. Just as suddenly as his sight had been lost, the Japanese man recovers his sight. As the friends all celebrate, the doctor's wife stands out on the porch, staring up into a white overcast sky and appears to be going blind until the camera shifts downwards, revealing that she sees the cityscape.","language":"English","box_office":"$19.8 million[1]","cinematography":"César Charlone","directed_by":"Fernando Meirelles","narrated_by":"Danny Glover","José Saramago's reaction to the movie":"In a closed section, José Saramago watched the movie together with Fernando Meirelles. When the movie ended, Saramago was in tears. He turned to Fernando Meirelles and said: \"Fernando, I am so happy to have seen this movie as I was the day I finished the book.\" [45]","release_dates":"3 October 2008 (2008-10-03)|||||","Production":"The rights to the 1995 novel Blindness were closely guarded by author José Saramago.[6] Saramago explained, \"I always resisted because it's a violent book about social degradation, rape, and I didn't want it to fall into the wrong hands.\" Director Fernando Meirelles had wanted to direct a film adaptation in 1997, perceiving it as \"an allegory about the fragility of civilization\". Saramago originally refused to sell the rights to Meirelles, Whoopi Goldberg, or Gael García Bernal.[11] In 1999, producer Niv Fichman and Canadian screenwriter Don McKellar visited Saramago in the Canary Islands; Saramago allowed their visit on condition that they not discuss buying the rights. McKellar explained the changes he intended to make from the novel and what the focus would be, and two days later he and Fichman left Saramago's home with the rights. McKellar believed they had succeeded where others had failed because they properly researched Saramago; he was suspicious of the film industry and had therefore resisted other studios' efforts to obtain the rights through large sums of money alone.[12] Conditions set by Saramago were for the film to be set in a country that would not be recognizable to audiences,[13] and that the canine in the novel, the Dog of Tears, should be a big dog.[14]Meirelles originally envisioned doing the film in Portuguese similar to the novel's original language, but instead directed the film in English, saying, \"If you do it in English you can sell it to the whole world and have a bigger audience.\"[9] Meirelles set the film in a contemporary large city, seemingly under a totalitarian government, as opposed to the novel that he believed took place in the 1940s (actually, the book is more likely to take place in the 80s or later, as evident by the fact that the characters stumble upon a store with modern appliances like microwave ovens and dishwashers, and referral to AIDS as a feared disease). Meirelles chose to make a contemporary film so audiences could relate to the characters.[14] The director also sought a different allegorical approach. He described the novel as \"very allegorical, like a fantasy outside of space, outside the world\", and he instead took a naturalistic direction in engaging audiences to make the film less \"cold.\"[15]Don McKellar said about adapting the story, \"None of the characters even have names or a history, which is very untraditional for a Hollywood story. The film, like the novel, directly addresses sight and point of view and asks you to see things from a different perspective.\" McKellar wrote the script so audiences would see the world through the eyes of the protagonist, the doctor's wife. He sought to have them question the humanity of how she observes but does not act in various situations, including a rape scene. He consulted Saramago about why the wife took so long to act. McKellar noted, \"He said she became aware of the responsibility that comes with seeing gradually, first to herself, then to her husband, then to her small family, then her ward, and finally to the world where she has to create a new civilization.\" The screenwriter wrote out the \"actions and circumstances\" that would allow the wife to find her responsibility.[5] While the completed script was mostly faithful to the novel, McKellar went through several drafts that were not. One such saw him veer away from the novel by creating names and backstories for all the characters. Another significantly changed the chronology. Only after these abortive attempts did McKellar decide to cut the backstories and focus primarily on the doctor and his wife. He attempted to reconnect with what originally drew him to the novel: what he called its \"existential simplicity\". The novel defines its characters by little more than their present actions; doing the same for the adaptation became \"an interesting exercise\" for McKellar.[12]McKellar attended a summer camp for the blind as part of his research. He wanted to observe how blind people interacted in groups. He discovered that excessive expositional dialogue, usually frowned upon by writers, was essential for the groups. McKellar cut one of the last lines in the novel from his screenplay: \"I don't think we did go blind, I think we are blind. Blind but seeing. Blind people who can see, but do not see.\" McKellar believed viewers would by that point have already grasped the symbolism and didn't want the script to seem heavy-handed. He also toned down the visual cues in his screenplay, such as the \"brilliant milky whiteness\" of blindness described in the novel. McKellar knew he wanted a stylistically adept director and didn't want to be too prescriptive, preferring only to hint at an approach.[12]Meirelles chose São Paulo as the primary backdrop for Blindness, though scenes were also filmed in Osasco, Brazil; Guelph, Ontario, Canada; and Montevideo, Uruguay. With all the characters aside from Julianne Moore's character being blind, the cast was trained to simulate blindness. The director also stylized the film to reflect the lack of point of view that the characters would experience. Meirelles said several actors he talked to were intimidated by the concept of playing characters without names: \"I offered the film to some actors who said, 'I can't play a character with no name, with no history, with no past. With Gael (García Bernal), he said, 'I never think about the past. I just think what my character wants.'\"[16]By September 2006, Fernando Meirelles was attached to Blindness, with the script being adapted by Don McKellar. Blindness, budgeted at $25 million as part of a Brazilian and Canadian co-production, was slated to begin filming in summer 2007 in the towns of São Paulo and Guelph.[17] Filming began in early July in São Paulo and Guelph.[18] Filming also took place in Montevideo, Uruguay.[19] São Paulo served as the primary backdrop for Blindness, being a city mostly unfamiliar to U.S. and European audiences. With its relative obscurity, the director sought São Paulo as the film's generic location. Filming continued through autumn of 2007.[6]The cast and crew included 700 extras who had to be trained to simulate blindness. Actor Christian Duurvoort from Meirelles' City of God led a series of workshops to coach the cast members. Duurvoort had researched the mannerisms of blind people to understand how they perceive the world and how they make their way through space. Duurvoort not only taught the extras mannerisms, but also to convey the emotional and psychological states of blind people.[6] One technique was reacting to others as a blind person, whose reactions are usually different from those of a sighted person. Meirelles described, \"When you're talking to someone, you see a reaction. When you're blind, the response is much flatter. What's the point [in reacting]?\"[20]Meirelles acknowledged the challenge of making a film that would simulate the experience of blindness to the audience. He explained, \"When you do a film, everything is related to point of view, to vision. When you have two characters in a dialogue, emotion is expressed by the way people look at each other, through the eyes. Especially in the cut, the edit. You usually cut when someone looks over. Film is all about point of view, and in this film there is none.\"[20] Similar to the book, blindness in the film serves as a metaphor for human nature's dark side: \"prejudice, selfishness, violence and willful indifference.\"[6]With only one character's point of view available, Meirelles sought to switch the points-of-view throughout the film, seeing three distinct stylistic sections. The director began with an omniscient vantage point, transited to the intact viewpoint of the doctor's wife, and changed again to the Man with the Black Eye Patch, who connects the quarantined to the outside world with stories. The director concluded the switching with the combination of the perspective of the Doctor's Wife and the narrative of the Man with the Black Eye Patch.[5]The film also contains visual cues, such as the 1568 painting The Parable of the Blind by Pieter Bruegel the Elder. Allusions to other famous artworks are also made. Meirelles described the intent: \"It's about image, the film, and vision, so I thought it makes sense to create, not a history of painting, because it's not, but having different ways of seeing things, from Rembrandt to these very contemporary artists. But it's a very subtle thing.\"[6]","produced_by":"Niv Fichman Andrea Barata Ribeiro Sonoko Sakai","starring":"Julianne Moore Mark Ruffalo Gael García Bernal Danny Glover Yoshino Kimura Alice Braga","running_time":"121 minutes","music_by":"Marco Antonio Guimarães","edited_by":"Daniel Rezende","Release":"Prior to public release, Meirelles screened Blindness to test audiences. He described the impact of test screenings: \"If you know how to use it, how to ask the right questions, it can be really useful.\" A test screening of Meirelles' first cut in Toronto resulted in ten percent of the audience, nearly 50 people, walking out of the film early. Meirelles ascribed the problem to a rape scene that takes place partway through the film, and edited the scene to be much shorter in the final cut.[21] Meirelles explained his goal, \"When I shot and edited these scenes, I did it in a very technical way, I worried about how to light it and so on, and I lost the sense of their brutality. Some women were really angry with the film, and I thought, 'Wow, maybe I crossed the line.' I went back not to please the audience but so they would stay involved until the end of the story.\"[9] He also found that a New York test screening expressed concern about a victim in the film failing to take revenge. Meirelles believed this concern to reflect what Americans have learned to expect in their cinema.[21]Focus Features acquired the right to handle international sales for Blindness.[22] Pathé acquired UK and French rights to distribute the film,[23] and Miramax Films won U.S. distribution rights with its $5 million bid.[24] Blindness premiered as the opening film at the 61st Cannes Film Festival on May 14, 2008,[25] where it received a \"tepid reception.\"[26] Straw polls of critics were \"unkind\" to the film.[27]Blindness was screened at the Toronto International Film Festival in September 2008 as a Special Presentation.[28] The film also opened at the Atlantic Film Festival on September 11, 2008,[29] and had its North American theatrical release on October 3, 2008.The film was on some critics' top ten lists of 2008 films but has received very mixed, predominantly negative reviews. With only 66 of 153 (43%) reviews on the film review site Rotten Tomatoes being positive Blindness is considered \"rotten\". The film has an average rating of 5.2 out of 10.[30]Screen International's Cannes screen jury which annually polls a panel of international film critics gave the film a 1.3 average out of 4, placing the film on the lower-tier of all the films screened at competition in 2008.[31] Of the film critics from the Screen International Cannes critics jury, Alberto Crespi of the Italian publication L'Unità, Michel Ciment of French film magazine Positif and Dohoon Kim of South Korean film publication Cine21, all gave the film zero points (out of four).[31]Kirk Honeycutt of The Hollywood Reporter described Blindness as \"provocative but predictable cinema\", startling but failing to surprise. Honeycutt criticized the film's two viewpoints: Julianne Moore's character, the only one who can see, is slow to act against atrocities, and the behavior of Danny Glover's character comes off as \"slightly pompous\". Honeycutt explained, \"This philosophical coolness is what most undermines the emotional response to Meirelles' film. His fictional calculations are all so precise and a tone of deadly seriousness swamps the grim action.\"[32] Justin Chang of Variety described the film: \"Blindness emerges onscreen both overdressed and undermotivated, scrupulously hitting the novel's beats yet barely approximating, so to speak, its vision.\" Chang thought that Julianne Moore gave a strong performance but did not feel that the film captured the impact of Saramago's novel.[33] Roger Ebert called Blindness \"one of the most unpleasant, not to say unendurable, films I've ever seen.\"[34] A. O. Scott of The New York Times stated that, although it \"is not a great film, ... it is, nonetheless, full of examples of what good filmmaking looks like.\"[35]Stephen Garrett of Esquire complimented Meirelles' unconventional style: \"Meirelles [honors] the material by using elegant, artful camera compositions, beguiling sound design and deft touches of digital effects to accentuate the authenticity of his cataclysmic landscape.\" Despite the praise, Garrett wrote that Meirelles' talent at portraying real-life injustice in City of God and The Constant Gardener did not suit him for directing the \"heightened reality\" of Saramago's social commentary.[36]Peter Bradshaw of The Guardian called it \"an intelligent, tightly constructed, supremely confident adaptation\": \"Meirelles, along with screenwriter Don McKellar and cinematographer Cesar Charlone, have created an elegant, gripping and visually outstanding film. It responds to the novel's notes of apocalypse and dystopia, and its disclosure of a spiritual desert within the modern city, but also to its persistent qualities of fable, paradox and even whimsy.\" [37] \"Blindness is a drum-tight drama, with superb, hallucinatory, images of urban collapse. It has a real coil of horror at its centre, yet is lightened with gentleness and humour. It reminded me of George A Romero's Night of the Living Dead, and Peter Shaffer's absurdist stage-play Black Comedy. This is bold, masterly, film-making.\"[38]The Boston Globe's Wesley Morris raved about the leading actress: \"Julianne Moore is a star for these terrible times. She tends to be at her best when the world is at its worst. And things are pretty bad in \"Blindness,\" a perversely enjoyable, occasionally harrowing adaptation of José Saramago's 1995 disaster allegory. [...] \"Blindness\" is a movie whose sense of crisis feels right on time, even if the happy ending feels like a gratuitous emotional bailout. Meirelles ensures that the obviousness of the symbolism (in the global village the blind need guidance!) doesn't negate the story's power, nor the power of Moore's performance. The more dehumanizing things get, the fiercer she becomes.\"[39]The film appeared on some critics' top ten lists of the best films of 2008. Bill White of the Seattle Post-Intelligencer named it the 5th best film of 2008,[40] and Marc Savlov of The Austin Chronicle named it the 8th best film of 2008.[40]The film has been strongly criticized by several organizations representing the blind community. Dr. Marc Maurer, President of the National Federation of the Blind, said: \"The National Federation of the Blind condemns and deplores this film, which will do substantial harm to the blind of America and the world.\"[41] A press release from the American Council of the Blind said \"...it is quite obvious why blind people would be outraged over this movie. Blind people do not behave like uncivilized, animalized creatures.\"[42] The National Federation of the Blind announced plans to picket theaters in at least 21 states, in the largest protest in the organization's 68-year history.[43] José Saramago has described his novel as allegorically depicting \"a blindness of rationality\". He dismissed the protests, stating that \"stupidity doesn't choose between the blind and the non-blind.\"[44]","budget":"$25 million"}