{"based_on":"Babylon Babies 1999 novel  by Maurice G. Dantec","country":"France","distributed_by":"20th Century Fox","screenplay_by":"Mathieu Kassovitz Éric Besnard","Plot":"In the near future, a mercenary named Toorop (Vin Diesel) accepts a contract from a Russian mobster, Gorsky (Gérard Depardieu), who instructs him to bring a young woman known only as Aurora (Mélanie Thierry) to New York City. In order to reach this goal, Gorsky gives Toorop a variety of weapons as well as a UN passport that has to be injected under the skin of the neck. Toorop, along with the girl and her guardian nun Sister Rebeka (Michelle Yeoh), travels from the Noelite Convent in Mongolia to reach New York via Russia.The towns and cities of Russia have been turned into dangerous, overpopulated slums by war and terrorist activity, forcing Toorop, Aurora, and Rebeka to face dangers of the human element, while fleeing from an unknown group of mercenaries claiming to have been sent by Aurora's supposedly dead father. The stress of humanity's situation causes Aurora to act out in strange ways that neither Toorop nor Rebeka can explain. On one such occasion, Aurora seems for no reason to panic and run from a crowded train station, just before it explodes.Later, they board a submarine that carries refugees to Canada. However, to avoid satellite detection, the submarine is forced to leave some behind, even resorting to shooting them. Aurora, infuriated by the loss of life, starts to operate the 30-year-old submarine, without having ever learned about it.Sister Rebeka explains to Toorop that Aurora could speak nineteen different languages by the age of two, and always seems to know things she has never learned. Three months before leaving with Toorop, she has begun acting in ways she never had before. This occurred after a visit by a Noelite doctor who had administered a pill to Aurora. The doctor tells her to go to New York City and arranges for Toorop to take them.Once in Harlem, a news broadcast about the bombing of the convent causes the group to realize that there is more going on than they know. The Noelites have become a major new salvationist religion, which vast numbers of people cling to as the world spirals out of control. However, in private meetings, it is seen that their High Priestess is really just after power, and tries to use various invented miracles to get more people to believe in the truth of her religion. Gorsky, working for the Noelites, had planted a tracking device in Toorop's passport, and then bombed the convent when he knew they were in the United States. The doctor who earlier saw Aurora in the convent then appears to examine her again. When he leaves, Aurora reveals (without being told) that she is pregnant with twins, even though she is a virgin.Looking outside, Toorop sees Gorsky's men as well as the Noelite group, heavily armed and waiting for them. The High Priestess then calls Toorop and asks him to bring Aurora outside. Just before they take her away, Toorop changes his mind and starts a firefight with the two groups with the ultimate goal of getting the two women to safety. However, because of the tracking devices, Gorsky's men can lock onto Toorop with tracking rockets. Rebeka is shot and killed defending Aurora, who in turn shoots Toorop saying the words, \"I need you to live\". By dying, the rocket goes off target and explodes near Aurora instead. In fact, Aurora survives the rocket explosion by uncertain means.Toorop's body is revived by Dr. Arthur Darquandier (Lambert Wilson), using advanced medical techniques, but Toorop's right arm, left leg and other body parts are replaced with cybernetics to undo the damage of being dead for over two hours. Darquandier explains that when Aurora was a fetus, he enhanced her by using a supercomputer to 'implant' intelligence into her brain. It is also implied that the Noelite group had him create Aurora to become pregnant at a certain time in order to use her as a 'virgin birth' for their religion, and for his sake.After she was born, the Noelites hired Gorsky to kill Darquandier, but Gorsky failed to kill Darquandier in an explosion. Darquandier remained 'dead' until he found his daughter in Russia with Toorop.Doctor Darquandier uses a machine to go through Toorop's memory to find what Aurora said to him before Toorop 'died.' In Toorop's memory, Aurora tells Toorop to \"go home.\" Toorop, as well as several of Darquandier's men, leave the facility. En route to Darquandier's lab, the High Priestess calls Gorsky, at which point he is killed by a nuclear missile sent to him by the High Priestess. Darquandier is later killed by the High Priestess, but it is too late, since Toorop has already escaped. Toorop goes to his old house in the forest and finds Aurora, and takes her to a hospital where she dies after giving birth. Aurora was \"designed to breed\", not to live, so her death at childbirth was preprogrammed. Toorop is left to take care of her two children.It should also be said that Sister Rebekah also told Toorop that \"you are the one.\" And Aurora told Toorop that he is now the twins' father. When they are seen, one looks like Aurora and the other one looks like Toorop.","language":"English","Reception":"The film was generally panned by critics. Metacritic compiled a 26% rating based on 15 reviews.[23] Rotten Tomatoes gives the film a 6% approval rating based on 100 reviews (94 negative, 6 positive) with the consensus calling it \"A poorly constructed, derivative sci-fi stinker with a weak script and poor action sequences.\"[24]","box_office":"$72,108,608[4]","babylon_a.d.":"Theatrical release poster","cinematography":"Thierry Arbogast","production_company":"Studiocanal MNP Entreprise M6 Films One Race Films Dune Entertainment","directed_by":"Mathieu Kassovitz","release_dates":"29 August 2008 (2008-08-29)|||||","Production":"Mathieu Kassovitz developed an English-language film adaptation of Maurice Georges Dantec's French novel Babylon Babies for five years;[6] in June 2005, this project got financed from StudioCanal and Twentieth Century Fox.[7] The adapted screenplay was written by Kassovitz and screenwriter Éric Besnard. Production was initially slated to begin in February 2006 in Canada and Eastern Europe.[8] French actor Vincent Cassel was initially sought to be cast in the lead role.[9] In February 2006, actor Vin Diesel entered negotiations to star in the film, titled Babylon A.D.,[10] dropping out of the lead role of Hitman in the process.[11] Production of the futuristic thriller about genetic manipulation was slated to begin in June 2006.[12] By February 2007, filming was slated to wrap in April to release Babylon A.D. in time for the coming Thanksgiving.[13] In February, filming took place at Barrandov Studios.[14] In March 2007, the filming crew, having shot in the Czech Republic, took a two-week hiatus to deal with uncooperative weather, such as the lack of snow, and problems with set construction. Crew members scouted Iceland for locations with snow to shoot six to eight days of footage, which was supposed to be done in February. Filming was also done with the leads Diesel, Michelle Yeoh, and Mélanie Thierry in Ostrava in March.[3] The French visual effects company BUF Compagnie was contracted to develop the film's effects under the supervision of Stephane Ceretti.[15]In April 2007, Babylon A.D. was reported to be over-budget and three weeks behind schedule. A lack of snow meant a skiing sequence to be shot in Eastern Europe had to be moved to Sweden.[16] Later in the month, actor Lambert Wilson was cast into the film.[17] Filming was completed in May 2007.[18]American artist Khem Caigan designed the sigil that appears as a tattoo on the right side of Toorop's neck – an emblem which originally appeared in the Schlangekraft Necronomicon in 1977.[citation needed]Mathieu Kassovitz said that 20th Century Fox interfered throughout production, and he never had a chance to shoot a scene the way it was scripted, or the way he wanted it to be.[19]The music of Babylon A.D. was written by Icelandic composer Atli Örvarsson. The music supervisor of the movie was Jérôme Hadey. The musical alliance Achozen, represented by Shavo Odadjian and RZA performed the score for the film. Music producer Hans Zimmer described the intended style: \"Musically, our objective was to merge the sounds and energies of hip hop with classical music, seamlessly melting them into an unusual soundscape.\"[20]","produced_by":"Ilan Goldman","starring":"Vin Diesel Mélanie Thierry Michelle Yeoh Lambert Wilson Mark Strong Jérôme Le Banner Charlotte Rampling Gérard Depardieu","running_time":"101 minutes (France)[1] 90 minutes (UK)[2]","Blu-ray and DVD":"Babylon A.D. was released on Blu-ray and DVD in Europe (Region 2) on 29 December 2008,[25] and in the United States (Region 1) on 6 January 2009.[26] At the same time, the French 101 minute version was released on Blu-ray in the US as Babylon A.D. – Raw and Uncut.[27]","music_by":"Atli Örvarsson","edited_by":"Benjamin Weill","Release":"Babylon A.D. was originally stated to be released in the United States on 29 February 2008, but its release was postponed to 29 August 2008.[21] As of 31 January 2009, the film grossed US$72,105,690.[4] In the US the film was placed #2 behind Tropic Thunder with $9,484,267 in 3,390 cinemas with a $2,798 average.[22]","budget":"$70 million[3]"}