{"based_on":"Characters  by Craig Titley Cheaper by the Dozen  by Frank B. Gilbreth, Jr. and Emestine Gilbreth Carey","country":"United States","distributed_by":"20th Century Fox","Plot":"Two years after the events in the previous film, the Baker family begins to undergo many changes, beginning with Lorraine's (Hilary Duff) high school graduation and her desire to study in New York. Their oldest daughter, Nora (Piper Perabo), is now married to Bud McNulty (Jonathan Bennett) and heavily pregnant with his child. They intend to move to Houston because of Bud's new job promotion.Feeling the family is breaking apart as the children grow up and move away, Tom (Steve Martin) persuades the entire family to take one last family vacation together at Lake Winnetka. Tom's old rival, Jimmy Murtaugh (Eugene Levy), his trophy third wife, Sarina (Carmen Electra), and his eight kids are also there for the summer. Jimmy constantly flaunts his wealth and success to Tom, as well as the accomplishments of his children, often suggesting to Tom that his children are less successful because of Tom's parenting style. The Baker kids get into many incidents, several of which are accidental: at a fancy party, Mark (Forrest Landis) sets off a backpack of fireworks that is thrown into a boat, igniting its engine and causing it to explode; Sarah (Alyson Stoner) is caught stealing makeup from a gift shop, and Mark, along with Kenny Murtaugh, crashes into a tennis court with a golf cart.Jimmy again mentions that Tom needs to use a firmer hand on his kids. Tom is angered by this, and they decide to settle the matter at the Annual Labor Day Family Cup. Tom trains the kids for days, not realizing they are miserable. Sarah and Elliot Murtaugh (Taylor Lautner) go on a movie date to watch Ice Age, but are spied on by their fathers. The two men argue and end up humiliating their children. Upon returning home, Sarah is furious and refuses to compete for her father in the \"stupid cup\". Everyone, including Kate, is angry with Tom, not only for spying on Sarah, but also for ruining the entire trip through his competitiveness.The next morning, Tom goes to the Cup to compete, taking Nigel and Kyle, the only two still willing to go. However, after discovering an old \"Team Baker\" flag thanks to a well-known old \"rival\" rat of the family known as \"The Chiseler\"'s theft, Kate and the rest of the family show up, showing they have forgiven Tom and are willing to compete. Unfortunately, after all the events, the Bakers and the Murtaughs are tied for first; a tiebreaking canoe race is announced, in which every family member must compete. At first, Tom kindly decides to forfeit for Nora's pregnancy, but Nora bravely decides to join in after Jimmy rebuffs Tom. During the race, Nora's water breaks; the Murtaughs want to help, but Jimmy, sensing the opportunity to defeat Tom once and for all, initially and carelessly refuses to help. Eventually, the Murtaugh kids convince their father that they should help the Bakers as they jump out of their canoe one by one to join the Bakers so, the Bakers and the Murtaughs work together to get Nora quickly to the hospital as she goes into labor. Bud, Lorraine (soon to be christened as their baby's future godmother), and Kate go with Nora in the delivery room, while Tom, Jimmy, Sarina, and the rest of the kids stay in the waiting room.While talking to Jimmy, Tom realizes that he has to let his kids grow, but wherever they go, they will always be with him, and he will always be with them. Nora then gives birth to a baby boy. She and Bud name him Tom in honor of her father, who has shown them \"there is no way to be a perfect parent, but a million ways to be a really good one.\" Bud also announces that they have bought \"The Big House\", the vacation home that the Bakers have been renting. Nora, Bud, and baby Tom leave for Houston three days later, Charlie (Tom Welling) and Anne Murtaugh (Jaime King) start a relationship as Charlie prepares to become a garage owner near Lake Winnetka and Anne decides to go to Madison Arts School to become an artist, and Sarah and Elliot start a relationship as well.","language":"English","Reception":"Reviews for the film were overwhelmingly negative. Rotten Tomatoes ranked Cheaper by the Dozen 2 98th in the 100 worst reviewed films of the 2000s, with a rating of 6% based on 93 reviews of the film.[3] Critic Roger Ebert, however, gave the film a positive 3/4 stars, stating \"As I watched this sequel, a certain good feeling began to make itself known. Yes, the movie is unnecessary. However, it is unnecessary at a higher level of warmth and humor than the recent remake Yours, Mine, and Ours.\"The film received two Razzie Award nominations including Worst Actress (Hilary Duff) and Worst Supporting Actor (Eugene Levy).The film grossed $9,309,387 million opening weekend, finishing in 4th place at the box office. By the end of its run, Cheaper by the Dozen 2 grossed $82,571,173 domestically and $46,610,657 internationally, totaling $129,181,830 worldwide. It is one of only twelve feature films to be released in over 3,000 theaters and still improve on its box office performance in its second weekend, increasing 55.6% from $9,309,387 to $14,486,519.[4]","box_office":"$129.1 million[1]","cinematography":"Peter James","production_company":"21 Laps Entertainment","directed_by":"Adam Shankman","Home media":"The DVD was released on May 23, 2006. The Blu-ray was released on January 5, 2010. The DVD is two-sided and side B has an inside look that has previews of Flicka and Aquamarine.","release_dates":"December 21, 2005 (2005-12-21)","Production":"The film was shot in Toronto and Eugene Levy's hometown of Hamilton, Ontario, Canada.[2] The scenes at Lakeside High School were filmed at St. Andrew's College. The lake and cottage scenes were located at Rockwood, Ontario, and Burleigh Falls, Ontario on Stoney Lake.","produced_by":"Shawn Levy Ben Myron","starring":"Steve Martin Eugene Levy Bonnie Hunt Tom Welling Piper Perabo Hilary Duff Carmen Electra Jaime King","running_time":"93 minutes","cheaper_by_the_dozen_2":"Theatrical release poster","music_by":"John Debney","edited_by":"Matthew Cassel Christopher Greenbury","written_by":"Sam Harper","budget":"$60 million[1]"}