{"country":"India","distributed_by":"Avni Cinemax Suara Networks (Malaysia)","screenplay_by":"Sundar C. S.B.Ramadoss","story_by":"Sundar C.","Plot":"Saravanan (Vishal) is a person in Ooty who runs a business of gathering people for politicians and events. One day he met Maya (Hansika) and fell for her. However, Rajasekhar (Santhanam) also falls in love with her. Saravanan convinced Rajasekhar to not fall for Maya by talking about the expenses high class people require. Rajasekhar is a police inspector. Due to several mishaps caused, he was fired and started working as a hotel doorman. He was shocked to find Saravanan and Maya going out together. He asked Saravanan how he made Maya to fall in love with him. As Saravanan finished his story it was revealed that it was Saravanan who indirectly caused those mishaps to Rajasekhar. Rajasekhar enraged hired Kumaran (Vaibhav), who is a specialist in breaking other's love. Kumaran then sends Andrea Jeremiah who shows an edited photo of her and Saravanan together and how a child mistook Saravanan for her father. This causes a conflict in the relationship of Saravanan and Maya. Due to love failure Saravanan consumed alcohol and was unconscious. Kumaran who was also at the bar helped Saravanan and dropped him at his house. Saravanan's mother, Thulasi (Tulasi) who was ashamed of Saravanan's behaviour send him to meet his father Aalavanthan (Prabhu) and his younger brother Shakthi (Sathish) at Madurai.There they meet Aalavanthan and rejoins him. They also come to know that Kumaran is also the son of Aalavanthan's ex- lover. Aalavanthan reveals to his sons that they have 3 aunts (Ramya Krishnan), (Aishwarya), (Kiran Rathod). Aalavanthan wants his sons to marry the daughters of their aunts so that their family could reunite once and for all. At first Saravanan hesitates but when he finds Maya is also a daughter of his aunt he agrees to the plan. Aalavanthan has asked them to kidnap and he asked them to marry their cousins. Aalavanthan told that tomorrow is a temple function and their aunts is respected first. The next day Kumaran, Saravanan, and Shakthi has disguised themselves because no body should no identify them and instead of kidnapping their cousins they have kidnap their aunts. The village people mistook them as police posted to their village, which helps the trio to sneak into their aunts house. There their uncles help them to create affection to their daughters. Their aunts daughters also starts to reciprocate love to the trio. Their elder aunt (Ramya Krishnan) decides to participate in the MLA election in their provinces, but villain Pasupathy (Pradeep Rawat), current MLA of the provinces and ex-servant of Aalavanthan's family provokes her by saying that if he lose to her he will work at her home as servant but if she loses her daughter Maya will be married to his son. Saravanan then helps his aunt to win the elections. However a few days before the elections Saravanan's aunts find out that Saravanan's father is their brother Aalavanthan who was seen as the murderer of their father. their hatred towards Aalavanthan results in them getting Saravanan and his brothers caught in police and Aalavanthan is hurt by his sisters' harsh words at him. He suddenly got a heart attack and is admitted in the hospital. As Saravanan and his brothers are stuck in jail, his aunt had lost many of the peoples hope for voting her due to Pasupathy's evil plans in causing misunderstandings. Then Sarvanan uses Rajasekhar, to stop Pasupathy's evil plans. Then when Pasaupathy tries to bribe people with money, Saravanan and Kumaran cause some mishap and the tables turn giving Periya Ponnu the edge. There Pasupathy comes with a mob and tries to kill the whole family and take Maya, but Saravanan and Maya unite in a different location, and then fights Pasupathy and his son giving the victory. It was also revealed that Pasupathy killed Aalavanthan's father and not Aalavanthan. There Aalavanthan and the whole family unite, and Maya weds Saravanan.","language":"Tamil","cinematography":"Gopi Amarnath","production_company":"Vishal Film Factory","directed_by":"Sundar C.","aambala":"Film poster","Soundtrack":"The soundtrack was composed by Hiphop Tamizha (a duo consisting of Adhi and Jeeva),[15] making their debut as film music directors.[16] The album consists of six tracks with one of them being a remix of the song \"Inbam Pongum\" from Veerapandiya Kattabomman (1959).[17] All lyrics were written by Hiphop Tamizha's Adhi, who had also sung three numbers.The album received generally positive reviews from critics. IBTimes rated the album 3.5 out of 5 and stated that the songs are \"highly energetic, which are mixed with some heavy beats\".[18] Indiaglitz gave it 3.5 out of 5.[19]All lyrics written by Hiphop Tamizha. ","release_dates":"14 January 2015 (2015-01-14)|||||","Production":"Vishal and Sundar C. announced that they would collaborate for a second venture in late May 2014, despite their first film, Madha Gaja Raja, remaining unreleased.[2] Hansika Motwani was selected for the project, collaborating with director Sundar C for his third consecutive film [3] and Yuvan Shankar Raja was selected to compose the music for the film.[4] He later opted out of the project and Sundar C announced that five different composers would work on the project including Adhi of Hiphop Tamizha.[5] Nevertheless, it has been confirmed that Hiphop Tamizha Adhi alone would be the only music director to compose all tracks for this film instead of 5 music directors. In the song \"Aye Aye Aye\" Kushboo made a cameo appearance.[6] Three former lead actresses were reported to play Vishal's aunts in the film. Simran was rumored to have been signed for one of the three roles,[7] before \"a source close to the unit\" informed that Ramya Krishnan, Aishwarya and Kiran Rathod had been finalized for the roles.[8] Besides Motwani, the film was said to feature two more heroines, who play the daughters of the three aunts, with Telugu actresses Madhuurima and Maadhavi Latha being recruited for the roles in September 2014.[9][10]The team began production work on the film from 10 July 2014.[11] The team shot some scenes in Kumbakonam with Vishal and Sathish.[12] After a single schedule, the team announced that a non-stop schedule would take place from September 2014.[13] Filming was then moved to Senthil studios, which was located at Vadapalani, Chennai.[14] The audio was released on 27 December 2014 in Sathyam Cinemas.","produced_by":"Kushboo Sundar Vishal Sundar C.","starring":"Vishal Prabhu Hansika Motwani Ramya Krishnan","running_time":"146 minutes","music_by":"Hiphop Tamizha","edited_by":"N. B. Srikanth","Release":"The film released on 15 January 2015 coinciding with Pongal festival.[20] The satellite rights of the film were sold to Sun TV.[21]The film received mixed to positive reviews from critics. Behindwoods rated the film 2.25 out of 5 and stated \"Sundar C's box office winning formula of comedy, glamour, drama and action continues this time too\".[22] Indiaglitz gave 3 out of 5 and stated \"Aambala sums up action, masala and romance in the totality of rib tickling humor. There is clean romance, a thick story line, packed with agreeable fights, crafted beautifully and delivered on a platter of humour, that hardly a moment skips without laughing. Vishal, Sundar C and team have launched themselves unshakable, devoid of being overshadowed, on a high entertainment genre, this festive season\".[23] Rediff gave 2 stars out 5 and called it a \"masala entertainer with plenty of romance, over-the-top action, humour and great music\".[24] Sify stated, \"There isn’t one quiet moment in Aambala, a masala comic entertainer which is purely targeted at audiences seeking mindless actioners laced with family sentiments, comedy and plenty of glamour\" and added, \"If you leave your logic minds at home; there are chances that you might enjoy this ride.\". [25]IBN Live rated 1.5 out of 5 stated \"Sundar C shines in moments...Yet the film turns out to be, at the end, a reckless stitching up of humorous GIFs. This is because the film has no scope for entertaining the audience anew\".[26] The Times of India rated the film 2.5 out of 5 and called Aambala a \"masala movie that is a trip through time, and not in a good way. The film is filled with tropes that would have been acceptable in the 90s. We have families that are separated because of an incident in the past, lost-and-found moments, henpecked husbands, botched up kidnapping plans, outdated athai ponnu romance, and so on. It is only the comedy scenes that keep reminding us that we are watching a Sundar C film, but even these become tiresome and even crass at times\".[27] IANS gave 1 star out of 5 and called it \"unarguably the worst product to have come out of Sundar's factory...the film turns out to be a cliched rehash of several family stories with adequate dose of action and nauseating comedy\".[28]The film opened \"decent\" on first day collected ₹0.65 crore (US$97,000) at the box office. The film grossed ultimately ₹2.3 crore (US$340,000) in first week end. The film maintained steady business over first week even though tough competition from I. The film grossed ₹1.5 crore (US$220,000) in domestic final collection. The film collected ₹15 crore (US$2.2 million) at the worldwide box office.","written_by":"Radhakrishnan (Dialogues)"}