{"based_on":"Alien  by Dan O'Bannon Ron Shusett Predator  by Jim Thomas John Thomas","aliens_vs._predator:_requiem":"Theatrical release poster","country":"United States","distributed_by":"20th Century Fox","Plot":"Following the events of Alien vs. Predator, a Predator ship is leaving Earth carrying Alien facehuggers, and the body of Scar, the Predator that defeated the Alien Queen. A chestburster erupts from Scar's body; it is a new creature that is a hybrid of both species. It quickly matures into an adult Predalien, makes its way onto a scout ship that is then detached from the Mothership, and starts killing all the Predators on the ship. A Predator's weapon fire punctures the hull and the scout ship crashes in the forest outside of Gunnison, Colorado.With the Predators dead, the Predalien and several facehuggers escape, implanting embryos into a nearby father (Kurt Max Runte) and son (Liam James) and several homeless people living in the sewers. An injured Predator sends a distress signal before being killed by the Predalien. The distress signal reaches the Predator home world and a lone Predator, Wolf (Ian Whyte), responds, travels to Earth to track and kill the Aliens. He begins to erase the evidence of the Aliens' presence by destroying the crashed ship and using a blue liquid to dissolve the bodies of the facehuggers and their victims.Meanwhile, ex-convict Dallas Howard (Steven Pasquale) has just returned to Gunnison after serving time in prison. He is greeted by Sheriff Eddie Morales (John Ortiz) and reunites with his younger brother Ricky (Johnny Lewis). Ricky has a romantic interest in his classmate Jesse (Kristen Hager) and is constantly harassed by her boyfriend Dale (David Paetkau) and two of his friends. Kelly O'Brien (Reiko Aylesworth) has also just returned to Gunnison after serving in the military, and reunites with her husband Tim (Sam Trammell) and daughter Molly (Ariel Gade).Wolf fights a number of Aliens in the sewers, and as the battle reaches the surface several of them disperse into the town. Wolf pursues some to the power plant, where collateral damage from its weapons causes a city-wide power outage. Ricky and Jesse meet at the high school swimming pool but are interrupted by Dale and his cohorts just as the power fails and an Alien enters the building, killing Dale's friends. Another Alien invades the O'Brien home, killing Tim while Kelly escapes with Molly.Kelly, Molly, Ricky, Jesse, Dale, Dallas, and Sheriff Morales meet at a sporting goods store to gather weapons. Troops from the Colorado Army National Guard arrive but are quickly killed by the Aliens. When the battle between Wolf and the Aliens enters the store, Dale is killed and Wolf's shoulder cannons are damaged; he is able to modify one into a hand-held blaster.As the survivors attempt to escape Gunnison, they make radio contact with Colonel Stevens (Robert Joy) and learn that an air evacuation is being staged at the center of town. Kelly is suspicious of the military's intentions, and convinces a small group to go to the hospital where they hope to escape by helicopter, while Sheriff Morales heads to the evacuation area with the rest of the surviving citizens. The hospital, however, has been invaded and overrun by the Aliens and the Predalien, who has impregnated some pregnant women to breed more Aliens. Wolf soon arrives and in the ensuing battle, Jesse is killed, Ricky is injured by the Predalien, and Dallas takes possession of Wolf's blaster cannon after the Predator is attacked by an Alien and both tumble down an elevator shaft.As the battle reaches the rooftop, Dallas, Ricky, Kelly, and Molly escape in the helicopter while Wolf, having survived the fall, battles the Predalien in hand-to-hand combat. Wolf and the Predalien mortally wound each other just as a military jet arrives. Rather than a rescue airlift, it is an F-22 Raptor, executing a tactical nuclear strike with a B83 nuclear bomb that destroys the entire city, killing all the extraterrestrials (including Wolf and the Predalien) along with the remaining citizens. The shock wave causes the fleeing helicopter to crash in a clearing, where the survivors are rescued by the military. Wolf's blaster cannon is confiscated, and Colonel Stevens presents it to Ms. Yutani (Francoise Yip). Ms. Yutani tells Colonel Stevens that the world is not yet ready for this kind of advanced technology. Colonel Stevens replies, \"But this isn't for our world, is it, Ms. Yutani?\"","language":"English","box_office":"$128.9 million[2]","cinematography":"Daniel C. Pearl","production_company":"Davis Entertainment Brandywine Productions Dune Entertainment III LLC","directed_by":"The Brothers Strause","Video game":"A tie-in video game for the film was released on November 13, 2007 in North America, November 30 in Europe and December 6 in Australia.[21] The game, developed by Rebellion Developments and published by Sierra Entertainment,[22] was a third-person action-adventure game, allowing players to take the role of the Predator from the film.[23] The game received generally negative reviews from the gaming press.[24]","release_dates":"December 25, 2007 (2007-12-25)|||||","Production":"Inspired by Terminator 2: Judgment Day, brothers Colin and Greg Strause moved to Los Angeles to break into the film business. After an unsuccessful attempt to find employment at ILM, the brothers worked on the X-Files film and founded their own special effects company, Hydraulx. The company produced special effects for films such as Volcano, Titanic, The Day After Tomorrow, Poseidon and 300 and the brothers began a career directing commercials and music videos. Colin believes Hydraulx secured a strong relationship with 20th Century Fox, which owns the Alien and Predator franchises.[6]The brothers unsuccessfully pitched an idea for the first Alien vs. Predator film and Fox almost bought a film titled Wolfenstein suggested by the brothers, \"When the script came up for this movie, they thought we'd be perfect for it because it's an ambitious movie for the budget that they had and they knew that having our visual effects background was going to be a huge thing.\"[6] The brothers were hired to direct the sequel to Alien vs. Predator in late spring 2006 and had limited time to start filming in the fall.[6]Filming on Aliens vs. Predator: Requiem began September 25, 2006 in Vancouver[7] on a 52-day schedule.[8] During filming breaks, the brothers supervised visual effects work on 300, Shooter and Fantastic Four: Rise of the Silver Surfer by using in-house supervisors and a system called Mavis and Lucy, which let the brothers track, view and approve dailies. Colin estimates Hydraulx produced 460 of the 500 visual effects shots including the nuclear explosion which was created using Maya fluids and BA Volume Shader. The interior of the Predator ship was created using CGI, as the brothers felt it would be more cost effective than building a set.[8] The visual effects team peaked at 110 people for several months and averaged 70, almost all of the entire Hydraulx staff.[9]Using their knowledge in visual effects and making use of principal photography, the brothers tried to film as much as they could on camera without resorting to CGI, Colin said \"Other than the exterior spaceship shots, there are no pure CG shots\". CGI was used for the Alien tails and inner jaws, whereas they required puppeteers and wire removal on previous films. The main visual effects of the film included set design, a nuclear explosion, the Predator's ship crashing and the Predator cloak, about which Colin stated \"We wanted to make sure it didn't look too digital\".[8]As a side-note, the DVD commentary reveals that the brothers had hoped to get Adam Baldwin to reprise his role as Garber from Predator 2, but were unable to do so, instead using Robert Joy as a new character. Additionally, while the previous installment attracted casual moviegoers as well as fans of the franchises, Requiem catered exclusively to Alien and Predator fans with many references to the previous films appearing in the film.Brian Tyler was hired to compose the score for the film. The end credits track entitled \"Requiem\" is a clash of two main themes, one consisting of the Predator type theme (bongos and basses) and the second of the Aliens (high pitched violins, violas and flutes). The directors Colin and Greg Strause wanted to take a new direction from Harald Kloser's Alien vs. Predator score and wanted Tyler to use some reference to the two films' original score pieces, such as the horrific violas and percussion from James Horner's Aliens and the primitive tribal percussion from Alan Silvestri's Predator and its sequel.[10] Tyler also referenced composer John Frizzel's Alien: Resurrection into the score, in the tracks of National Guard and Taking Sides.","produced_by":"John Davis David Giler Walter Hill","starring":"Steven Pasquale Reiko Aylesworth John Ortiz Johnny Lewis Ariel Gade","running_time":"94 minutes 101 minutes (2008 Unrated Cut)","music_by":"Brian Tyler","edited_by":"Dan Zimmerman","Release":"Aliens vs. Predator: Requiem was released in North America on December 25, 2007, in 2,563 theaters. It was rated R for violence, gore and language, unlike its predecessor, which was given a PG-13 rating.[11] The BBFC's classification decision for the film is the same as the original (Rated 15), whilst the Australian ACB rated the film MA15+,[12] up from the original's M rating.The film grossed $9,515,615 on its opening day for an average of $3,707 per theater and was number ten at the box office.[13] It grossed $5 million in Australia, $9 million in Japan and the United Kingdom and $7 million in Russia, and had an international total of $86,288,761. As of February 24, 2009, the film had taken in a domestic gross of $41,797,066 and an international gross of $87,087,428, bringing it to a total of $128,884,494.[4] It is the lowest grossing Alien film in the domestic box office and is the second lowest grossing Alien film worldwide, next to the original Alien, and the lowest overall in either series when inflation is considered.[14][15]Aliens vs Predator Requiem received very negative reviews from critics and audiences alike with many considering it the worst film in the \"Alien\" and \"Predator\" franchise. Based on 68 reviews, the film scored a 12% approval rating at Rotten Tomatoes and 29 out of 100 at Metacritic, with the consensus stating; \"The increased gore and violence over the first Alien vs. Predator can't excuse Requiem's disorienting editing, excessively murky lighting, and lack of new ideas\".[16] however, a few critics called the film \"a fun B movie\".[17] . Josh Rosenblatt of The Austin Chronicle dismissed the film stating it was \"An orgy of mindless violence, a random collection of bloody bodies, alien misanthropy and slobbering carnage designed to bore straight into the pleasure centers of 13-year-old boys and leave the rest of us wondering when the movies got so damn loud.Chris Nashawaty of Entertainment Weekly felt it was a \"B movie that truly earns its B\", and gave it a grading of \"B\" on an A to F scale. Variety contributor Joe Leydon said it \"Provides enough cheap thrills and modest suspense to shake a few shekels from genre fans before really blasting off as homevid product,\" and Ryan Stewart of Cinematical said he \"can't recommend it as a good movie on its own merits, stocked as it is with cardboard cutout characters and a barely coherent plot, but it's miles more interesting than the last Alien vs. Predator film.\"There was the occasional positive review; Neil Genzlinger of the New York Times stated \"It may not be classic sci-fi like the original Alien, which it has in its DNA, but it’s a perfectly respectable next step in the series.\" Daily Variety called it \"Slam-Bang-Horror Action!\" and MovieWeb.com said \"A cool new monster...over-the-top violence...AVP-R is a lot of fun!\"[16]However, the \"Alien\" and \"Predator\" fanbase reaction toward the film was mixed. With many fans praising the action sequences, the special effects, and Brian Tyler's music score, while others criticized the monsters' lacking personalities, the top gore & violence, the short run time, and the acting and dialogue of the human characters.An \"Unrated Cut\" of AVP:R was released on DVD that features seven minutes of footage that was cut from the theatrical cut. Many of the film's changes are simply briefly extended dialogue scenes and there are a few instances where an extra Alien or human is killed on-screen, however there are some whole scenes added to the Unrated version.Aliens vs. Predator: Requiem was nominated for two Golden Raspberry awards in the fields of Worst Excuse for a Horror Movie and Worst Prequel or Sequel. The awards however, went to I Know Who Killed Me and Daddy Day Camp.On May 8, 2008, AVP:R was nominated for an MTV Movie Award for Best Fight Sequence.[18]Aliens vs. Predator: Requiem was released on DVD and Blu-ray Disc on April 15, 2008 in North America and May 12, 2008 in the United Kingdom by Fox Home Entertainment. It was released in three versions: a single-disc, R-rated version of the 93-minute theatrical presentation, a single-disc unrated version extended to 101 minutes and a two-disc unrated version with the 101 minute film and a second disc of special features. Extra features on the single-disc editions include two audio commentary tracks: one by the directors and producer John Davis and a second by creature effects designers and creators Tom Woodruff Jr. and Alec Gillis.Disc one of the two-disc unrated edition includes both commentary tracks as well as both cuts of the film seamlessly branched and an exclusive \"Weyland-Yutani archives\" picture-in-picture reference guide to the warring alien races;[19] five behind-the-scenes featurettes: \"Prepare for War: The Making of AVP-R\", \"Fight to the Finish: The Making of AVP-R\", \"AVP-R: The Nightmare Returns - Creating the Aliens\", \"Crossbreed: The Predalien\", and \"Building the Predator Homeworld\"; multiple galleries of still photos showing the creature designs and sets; and the film's theatrical trailer. The second disc includes a \"digital copy\" download feature.In its first week of release, Aliens vs. Predator: Requiem debuted at #2 on the DVD charts, earning $7.7 million and #1 on the Blu-ray charts. The film has made $27,403,705 in DVD sales in the United States.[4][20]","written_by":"Shane Salerno","budget":"$40 million[1]"}