{"country":"United States","distributed_by":"Orion Pictures","Plot":"Montgomery \"Monty\" Capuletti is a hard-living, heavy-drinking, pot-smoking, gambling family man who makes his living as a baby photographer in New Dorp, Staten Island. He loves his wife Rose but has a very tense relationship with his wealthy, snobbish mother-in-law, Mrs. Monahan, who runs a successful department store chain and hates the way Monty acts and lives. There is an added ethnic rivalry between Monty and his wife's family, as he is Italian and they are Irish.The irresponsible Monty cannot even pick up a wedding cake for his engaged daughter Allison without fouling up. He and his best friend Nicholas 'Nicky' Cerone are smoking marijuana while driving, and an accident destroys the cake.After Mrs. Monahan dies unexpectedly, his family is in for an inheritance. Attorney Scrappleton reveals that Mrs. Monahan left a stipulation in her will that if Monty is able to curb his vices for a year by going on a diet and giving up drugs and gambling, he will receive $10 million. If not, the family gets nothing. Allison's wedding to the peculiar Julio goes off without a hitch, at least until the wedding night. The guys Monty would drink and gamble with are also interested in whether or not Monty can really give up everything and bet whether or not he will make it.Monty and Nicky go to the mother-in-law's department store and find awkward fashions and catering to a clientele which clearly do not include the likes of Nicky and Monty. Nicky argues that it may not be worth it to Monty if this is the kind of atmosphere he will be exposed to, but Monty points out he must tough it out to provide for his wife and daughters, not just him. Meanwhile, Mrs. Monahan's scheming right-hand man Clive Barlow does his best to undermine Monty's resolve so the money and department store can instead be left to him.Monty ultimately reforms. When the entire year is up, he and the family celebrate aboard a boat. To his chagrin though, Mrs. Monahan turns up. She had faked her own death simply to persuade her slovenly son-in-law to straighten up. Ultimately though, she gives the money to Monty on the basis he upheld her stipulation. Now rich, Monty and his family live in a mansion. However, Monty hints the \"clean living\" clause has just expired as he kisses his mother-in-law good night and fakes heading to bed. Monty proceeds to a hideaway to join Nicky and his friends for pizza, poker, and beer.","language":"English","box_office":"$29.3 million[2]","cinematography":"Fred Schuler","directed_by":"James Signorelli","easy_money":"Theatrical release poster","release_dates":"August 19, 1983 (1983-08-19)|||||","produced_by":"Estelle Endler|John Nicolella|","starring":"Rodney Dangerfield|Joe Pesci|Geraldine Fitzgerald|Candy Azzara|Jennifer Jason Leigh|","running_time":"95 minutes[1]","music_by":"Laurence Rosenthal","edited_by":"Ronald Roose","Release":"Easy Money opened theatrically on August 19, 1983 and earned $5,844,974 in its opening weekend, ranking number one at the domestic box office, toppling the prior three-week #1 run of National Lampoon's Vacation.[3] By the end of its run, the film grossed $29,309,766.[2]On Rotten Tomatoes, the film holds a 50% approval rating based on eight reviews.[4]","written_by":"Dennis Blair|Rodney Dangerfield|Michael Endler|P. J. O'Rourke|"}