{"Cast":"Bill Murray was considered for the role of Noah Levenstein.[4]","country":"United States","distributed_by":"Universal Pictures","american_pie":"Theatrical release poster","Plot":"Five high school seniors from West Michigan are good friends: Jim Levenstein (Jason Biggs), an awkward, nerdy and sexually naïve character whose dad Noah (Eugene Levy) attempts to offer sexual advice including purchasing and giving him pornography; Chris \"Oz\" Ostreicher (Chris Klein), a member of the high school lacrosse team; Kevin Myers (Thomas Ian Nicholas), a popular, confident ladies' man and the leader of the group who wants to lose his virginity to Vicky (Tara Reid); Paul Finch (Eddie Kaye Thomas), a mochaccino-drinking sophisticate and nerd; and Steve Stifler (Seann William Scott), a raucous jock who often throws wild parties when his mother is away, and is also the only one of the five who has lost his virginity. At Kevin's prompting, Oz, Finch, Jim, and Kevin make a pact to lose their virginities before their high school graduation after a dorky classmate, Chuck Sherman (Chris Owen), claims to have done so at a party hosted by Stifler.Vicky later accuses Kevin of being with her only for sex, so he must try to repair his relationship with her before the upcoming prom night, when the four plan to lose their virginity. He eventually succeeds. Oz, meanwhile, joins the school jazz choir in an attempt to find a girlfriend. From a college girl he tried to seduce, Oz learns about sensitivity and that it is about asking girls questions and listening to what they say. He soon wins the attention of Heather (Mena Suvari), a girl in the choir. However, he runs into problems when Heather learns about Oz's reputation and breaks up with him, although he manages to regain her trust when he leaves the lacrosse championship to perform a duet with her in a choir competition.Jim, meanwhile, attempts to pursue Nadia (Shannon Elizabeth), an exchange student from Slovakia who asks Jim for help to study for an upcoming history test. After being told by Oz that third base feels like \"warm apple pie\", he practices having sex with a pie, only to be caught by Noah (who lets him keep it a secret from his mother). Stifler persuades him to set up a webcam in his room so that they can all watch his encounter with Nadia. The plan suffers a hiccup, though, when Nadia discovers Jim's pornography collection and sits half-naked on his bed to read and masturbates to it. Jim is persuaded to return to his room, where he joins Nadia, unaware that he accidentally sent the webcam link to everyone on the school list. Nadia is interested in him, but he suffers premature ejaculation twice and is unable to have sex with her. Nadia's exchange family sees the video and sends her back home, now leaving Jim dateless for the upcoming prom and without hope of losing his virginity before high school is over.In sheer desperation, Jim asks band camp geek Michelle Flaherty (Alyson Hannigan) to the senior prom as she is apparently the only girl at his school who did not see what happened. Finch, meanwhile, pays Vicky's friend, Jessica (Natasha Lyonne), $200 to spread rumors around the school of his sexual prowess, hoping that it will increase his chances of success. Unfortunately, he runs into trouble when Stifler, angry that a girl turned him down for the prom because she was waiting for Finch to ask her, puts a laxative into Finch's mochaccino. Finch, being paranoid about the lack of cleanliness in the school restrooms, and unable to go home to use the toilet as he usually does, is tricked by Stifler into using the girls' restroom. Afterward, he emerges humiliated before a crowd of fellow students and is also left dateless.At the prom, things seem bleak for the four boys until Vicky asks the girl that Chuck Sherman claimed to have bedded about her \"first time.\" She proclaims to everyone at the prom that she and Sherman did not have sex at Stifler's party, leaving Sherman embarrassed and making him wet himself. The revelation takes the pressure off of Jim, Kevin, Oz and Finch, and they head to the post-prom party at Stifler's house with new hope.At the after-party, all four boys fulfill their pledges. Kevin and Vicky have sex in an upstairs bedroom. Vicky breaks up with Kevin afterwards on the grounds that they will drift apart when they go to college. Oz confesses the pact to Heather, and renounces it, saying that just by them being together makes him a winner. They reconcile and wind up having sex. Oz, honoring his newfound sensitivity, never confesses to what they did.Jim and Michelle have sex after he finds out that she is actually not as naïve as she let on and that she saw the \"Nadia Incident\" after all. She accepted his offer to be his date because of it, knowing he was a \"sure thing\" but makes him wear two condoms to combat his earlier \"problem\" with Nadia. Jim is surprised at Michelle's aggressiveness in bed. In the morning he wakes up to find her gone and realizes that she had used him for a one-night stand, which Jim thinks is \"cool\".Dateless, Finch strays downstairs to the basement recreation room where he meets Stifler's mother (Jennifer Coolidge). She is aroused by his precociousness, and they have sex on the pool table. The next morning, while Stifler searches for his mom, he finds her on the pool table with Finch, and is so shocked that he faints. The morning after the prom, Jim, Kevin, Oz, and Finch eat breakfast at their favorite restaurant where they toast to the \"next step\".From Slovakia, Nadia watches Jim stripping on his webcam: Noah walks in (to which Jim is completely oblivious) but happily walks out and also starts dancing.","language":"English","box_office":"$235,483,004[1]","cinematography":"Richard Crudo","production_company":"Zide/Perry Productions Summit Entertainment","directed_by":"Paul Weitz Chris Weitz","Soundtrack":"The film's soundtrack peaked at number 50 on the Billboard 200 chart.[21]The following songs were included in the film but were not featured on the soundtrack:","release_dates":"July 9, 1999 (1999-07-09)|||||","produced_by":"Chris Weitz Paul Weitz Chris Moore Warren Zide Craig Perry","starring":"Jason Biggs Shannon Elizabeth Alyson Hannigan Chris Klein Natasha Lyonne Thomas Ian Nicholas Tara Reid Seann William Scott Mena Suvari Eddie Kaye Thomas Eugene Levy","running_time":"95 minutes","music_by":"David Lawrence","edited_by":"Priscilla Nedd-Friendly","Release":"Despite insiders claiming it to be a potential sleeper hit, Universal Pictures sold off the foreign rights in an attempt to recoup its budget. American Pie was sold successfully to foreign distributors at the Cannes International Film Festival.[10] The film took in a gross worldwide revenue of $235,483,004,[11][12] $132,922,000 of which was from international tickets. In North America, it was the twentieth highest-grossing film of 1999. In Germany, it was the most successful theatrical release of 2000 before Mission: Impossible II and American Beauty.[13]In home video rentals, the film has grossed $109,577,352 worldwide, with $56,408,552 of that coming from sales in the US.[14]The film received mixed to positive reviews from critics. Based on 123 reviews Rotten Tomatoes gives American Pie a score of 61% considered \"Fresh\".[15] and a score of 58 (\"mixed or average reviews\") from Metacritic based on reviews from 30 critics.[16] The more negative reviews include Stephen Holden of The New York Times who felt American Pie was \"one of the shallowest and the most prurient teen films.\"[17] Robert Horton of Film.com wrote that American Pie \"had a few amusing bits, however the audience should strongly note that the movie is really awful, and that it was not worthy of guilty pleasure status.\"[16] Jim Sullivan of The Boston Globe wrote that American Pie is a \"gross and tasteless high school romp with sentimental mush.\"[16] Roger Ebert was more supportive, awarding it three out of four stars. He noted that \"[i]t is not inspired, but it's cheerful and hard-working and sometimes funny, and—here's the important thing—it's not mean. Its characters are sort of sweet and lovable.\"[18]","written_by":"Adam Herz","budget":"$11 million","Location":"Much of the film is based on the writer's days at East Grand Rapids High School in Michigan.[5][6] In the film, the town is called \"East Great Falls\", and the high school sports the same school colors — blue and yellow — along with a similar mascot — the Trailblazers instead of the Pioneers. The restaurant hangout, \"Dog Years\", is based on Yesterdog, a popular hot dog restaurant in the nearby Eastown neighborhood of Grand Rapids.[7] The \"Central Chicks\" and \"Central\" Lacrosse team that East Great Falls plays against is an amalgam of nearby Forest Hills Central High School and Grand Rapids Catholic Central High School.[8]The film was actually shot in Southern California, most notably in Long Beach using Long Beach Unified School District area high schools. Millikan High School, whose school colors are blue and gold, was used for exterior shots, and Long Beach Polytechnic High School was used for interior shots. Located in Los Cerritos, Long Beach, California, both schools are within five miles of the Virginia Country Club and Los Cerritos Neighborhood (where Ferris Bueller's Day Off and Donnie Darko were filmed).[9]"}