{"Cast":"In the Piccadilly Circus sequence, the man hit by a car and thrown through a store window is Landis himself.As in most of the director's films, Frank Oz makes an appearance: first as Mr. Collins from the American embassy in the hospital scene, and later as Miss Piggy in a dream sequence, when David's younger siblings watch a scene from The Muppet Show.Actors in bit parts who were already—or would become—more well-known include the two chess players David and Jack meet in the pub, played by the character actor Brian Glover and then-rising comedian and actor Rik Mayall, star and co-writer of The Young Ones and Bottom. One of the policemen helping to chase and kill the werewolf is John Altman, who would later achieve fame as \"Nasty\" Nick Cotton in EastEnders. Alan Ford—later to appear in Lock, Stock and Two Smoking Barrels and Snatch—plays a taxi driver. The policeman in the cinema is played by John Salthouse and the policeman in Trafalgar Square is played by Peter Ellis. Both Salthouse and Ellis appeared in police drama The Bill. David Schofield, known as Mercer from the Pirates of the Caribbean film series, plays the dart player at The Slaughtered Lamb and assists Dr. Hirsch in his investigation of David's attack.The player throwing darts in the match on TV in Alex's apartment is Rab Smith. Smith's opponent is Cliff Lazarenko.","country":"United Kingdom|United States|","distributed_by":"Universal Pictures (United States)|Producers Sales Organization (Other territories)|","Legacy":"The film was followed by a sequel 16 years later, An American Werewolf in Paris (1997), which featured a completely different cast and crew, and was distributed by Disney's Hollywood Pictures. According to Paris, David impregnated Alex during their sex scene and soon after the events of London, Alex gave birth to Serafine, a main character in the sequel. This is directly stated in a deleted scene of Paris and also suggests that the werewolf who bit David was a survivor of the same society of which the antagonists are a part.A radio adaptation of the film was broadcast on BBC Radio 1 in 1997, written and directed by Dirk Maggs and with Jenny Agutter, Brian Glover, and John Woodvine reprising the roles of Alex Price, the chess player (now named George Hackett, and with a more significant role as East Proctor's special constable) and Dr. Hirsch. The roles of David and Jack were played by Eric Meyers and William Dufris. Maggs's script added a back-story that some people in East Proctor are settlers from Eastern Europe and brought lycanthropy with them. The werewolf who bites David is revealed to be related to Hackett, and has escaped from an asylum where he is held under the name \"Larry Talbot\", the name of the title character in The Wolf Man.On August 15, 2013, the Universal Orlando Resort announced it would use the film as the basis for its seventh maze during that year's annual Halloween Horror Nights event. The maze was so popular, it became part of the 2014 Halloween Horror Nights event at Universal Studios Hollywood. On August 26, 2015, Universal Orlando announced the return of the maze for their 25th annual Halloween Horror Nights event after its popularity at both parks in previous years.In June 2009, it was announced that Dimension Films was working with producers Sean and Bryan Furst on a remake of the film. This has since been delayed due to other commitments.[18]","Plot":"Two American college students, David Kessler and Jack Goodman, backpack across the North York Moors. As darkness falls, they stop for the night at a pub called \"The Slaughtered Lamb\". Jack notices a five-pointed star on the wall. When Goodman asks about it, the pubgoers stop talking and become hostile. The pair decides to leave, although the waitress/pub owner insists they \"can't let them go\". Instead of changing their minds, the local clients only warn them to keep to the road, stay clear of the moors and beware of the full moon. While talking, David and Jack end up wandering off the road onto the moors. Jack and David hear sinister howls, which seem to be getting closer. They start back to the Slaughtered Lamb but realize that they are now lost. The boys are attacked by a supernaturally large wolf-like animal and Jack is killed. The attacker is shot by some of the pubgoers but instead of a dead animal, David sees the corpse of a naked man lying next to him. David survives the mauling and is taken to a hospital in London.[3]When David wakes up three weeks later, he does not remember what happened. He is interviewed by police Inspector Villiers who tells him that he and Jack were attacked by an escaped lunatic. David insists that they were actually attacked by a large dog or wolf. Jack appears to David as a reanimated corpse to explain that they were attacked by a werewolf, and that David is now a werewolf. Jack urges David to kill himself before the next full moon, not only because Jack is cursed to exist in a state of living death for as long as the bloodline of the werewolf that attacked them survives, but also to prevent David from inflicting the same fate on anyone else. Meanwhile, Dr. Hirsch takes a trip to the Slaughtered Lamb to see if what David has told him is true. When asked about the incident, the pubgoers deny any knowledge of David, Jack, or their attacker. But one distraught pubgoer speaks to Dr. Hirsch outside the pub and says that David should not have been taken away, and that he and everyone else will be in danger when he changes, only to be quickly silenced by a fellow pubgoer.Upon his release from the hospital, David moves in with Alex Price, a pretty young nurse who grew infatuated with him in the hospital. He stays in Alex's London apartment, where they later make love for the first time. Jack, in an advanced stage of decay, appears to David to warn him that he will turn into a werewolf the next day. Jack again advises David to take his own life to avoid killing innocent people. When the full moon rises, David painfully transforms into a werewolf and starts to prowl the streets and the London Underground, slaughtering six Londoners in the process. When he wakes in the morning, he is naked on the floor of the wolf cage at London Zoo, has no memory of his activities, and is unharmed by the resident wolves.David realizes that Jack was right about everything and that he is responsible for the murders of the night before. After failing to get himself arrested, David tries to slit his wrists with a pocket knife. David sees Jack, in a yet more advanced stage of decay, outside an adult cinema in Piccadilly Circus. Inside, Jack is accompanied by David's victims from the previous night, all of whom are furious at David for killing them. They all then insist that he must commit suicide before turning into a werewolf again. While talking with them as they try to offer him the least painful way to kill himself, David transforms and goes on another killing spree. After bursting out of the cinema, biting off Inspector Villiers' head in the process, David wreaks havoc in the streets and is ultimately cornered in an alley by police. Alex tries to calm him down by telling him that she loves him. Though he is apparently placated for a moment, he is shot and killed when he lunges forward, returning to human form in front of a grieving Alex as he lies dead.","language":"English","box_office":"$62 million[2]","cinematography":"Robert Paynter","production_company":"PolyGram Pictures The Guber-Peters Company","directed_by":"John Landis","Home media":"The film was first released on DVD in January 1998 by LIVE Entertainment according to a LIVE DVD Advertisement. Universal released a 20th anniversary \"Collector's Edition\" DVD on September 18, 2001. The high-definition version of the film was first released on HD DVD by Universal on November 28, 2006. A high-definition Blu-ray Disc and 2-disc standard-definition Region 1 DVD release of the film titled \"An American Werewolf in London - Full Moon Edition\" was released by Universal on September 15, 2009.[19] The Region 2 DVDs and Blu-ray were released on September 28 and are known as \"An American Werewolf in London - Special Edition\"[20] No DVD or Blu-ray version at present contains the film's original mono audio track.The region 2 DVD release does not include a scene that is fully intact on the Region 1 release and all previous region 1 and 2 releases. The scene takes place near the end of the film where the character of David phones his parents from a public telephone box. All but the end of this scene had been cut from the Region 2 release because the distributors felt that use of a public phone box, as opposed to a mobile phone, would date the film.[citation needed]As of October 2009, Universal said that they were scrapping all existing faulty stock and issuing replacement DVDs. All Blu-ray releases, however, are intact.","Music":"The film's ironically upbeat soundtrack consists of songs which refer to the moon. Bobby Vinton's slow and soothing version of \"Blue Moon\" plays during the opening credits, Van Morrison's \"Moondance\" as David and Alex make love for the first time, Creedence Clearwater Revival's \"Bad Moon Rising\" as David nears the moment of changing to the werewolf, a soft, bittersweet ballad version of \"Blue Moon\" by Sam Cooke during the agonizing wolf transformation and The Marcels' doo-wop version of \"Blue Moon\" over the end credits.[10] On the DVD commentary, David Naughton and Griffin Dunne said they were unsure why Landis did not obtain rights to Warren Zevon's Werewolves of London as they felt the song would have been more appropriate for the film.","release_dates":"August 21, 1981 (1981-08-21)|||||","Production":"John Landis came up with the story while he worked in Yugoslavia as a production assistant on the film Kelly's Heroes (1970). He and a Yugoslavian member of the crew were driving in the back of a car on location when they came across a group of gypsies. The gypsies appeared to be performing rituals on a man being buried so that he would not \"rise from the grave.\" This made Landis realize that he would never be able to confront the undead and gave him the idea for a film in which a man would go through the same thing.[5]Landis wrote the first draft of An American Werewolf in London in 1969 and shelved it for over a decade. Two years later, Landis wrote, directed, and starred in his debut film, Schlock, which developed a cult following. Landis developed box-office status in Hollywood through the successful comedy films The Kentucky Fried Movie, National Lampoon's Animal House and The Blues Brothers before securing $10 million financing for his werewolf film. Financiers believed that Landis' script was too frightening to be a comedy and too funny to be a horror film.[6]According to Entertainment Weekly, the real star of this film is the Oscar-winning transformation effects by Rick Baker, which changed the face of horror makeup in the 1980s.[7] The various prosthetics and robotic body parts used during the film's extended werewolf transformation scenes and on Griffin Dunne when his character returns as a bloody, mangled ghost impressed the Academy of Motion Picture Arts and Sciences so much that the film won the Outstanding Achievement in Makeup in the category's inaugural year. During the body casting sessions, the crew danced around David Naughton singing, \"I'm a werewolf, you're a werewolf ... wouldn't you like to be a werewolf, too?\" in reference to his days as a pitchman for Dr Pepper.[citation needed]The moors were filmed around the Black Mountains in Wales, and 'East Proctor' is in reality the tiny village of Crickadarn, about six miles southeast of Builth Wells off the A479. The ‘Angel of Death’ statue was a prop added for the film, but the red phone box is real enough – though the Welsh road signs were covered by a fake tree.[8]Some scenes from the film were shot on Hampstead Heath, Well Walk and Haverstock Hill, London. St. Stephen's Church, Rosslyn Hill is featured. Harry and Judith are killed in Hampstead Heath, behind The Pryors on East Heath Road. Before David kills them, Harry and Judith get out of the taxi on East Heath Road at Well Walk.The inn shown in the film known as \"The Slaughtered Lamb\" was actually a cottage located in Crickadarn, and the interior scenes were filmed in the Black Swan, Old Lane, Martyr's Green in Surrey.[9]A reference to Landis' National Lampoon's Animal House is shown at the end credits, which congratulate Prince Charles and Diana Spencer on their marriage, end with a promo card for Universal Studios urging viewers to \"Ask for Babs\".","produced_by":"George Folsey, Jr.|Peter Guber|Jon Peters|","starring":"David Naughton|Jenny Agutter|Griffin Dunne|John Woodvine|","running_time":"97 minutes[1]","music_by":"Elmer Bernstein","an_american_werewolf_in_london":"Theatrical release poster","edited_by":"Malcolm Campbell","Release":"The budget of An American Werewolf in London was reportedly $10 million. The US box office totaled $30,565,292.[11]The film received positive reviews from critics. On Rotten Tomatoes has an approval score of 89% on and an average rating of 7.8/10 based on reviews from 46 critics, compiled retrospectively. The critical consensus states: \"Terrifying and funny in almost equal measure, John Landis' horror-comedy crosses genres while introducing Rick Baker's astounding make-up effects.\"[12] Kim Newman of Empire magazine praised the film, saying \"Carnivorous lunar activities rarely come any more entertaining than this\".[13] Tom Huddleston from Time Out also gave the film a positive review, saying the film was \"Not just gory but actually frightening, not just funny but clever\".[14]Halliwell's Film Guide described the film as a \"curious but oddly endearing mixture of horror film and spoof, of comedy and shock, with everything grist to its mill including tourist Britain and the wedding of Prince Charles. The special effects are notable, and signalled new developments in this field.\"[15]Roger Ebert's review was less favourable; he stated that \"An American Werewolf in London seems curiously unfinished, as if director John Landis spent all his energy on spectacular set pieces and then didn't want to bother with things like transitions, character development, or an ending.\"[16]At the 54th Academy Awards, An American Werewolf in London won the first-ever awarded Academy Award for Outstanding Achievement in Makeup. During the 1982 Saturn Awards, the film won for Best Horror Film and Best Make-up and nominated for Best Actress and Best Writing.The American Film Institute nominated it for ranking on its 100 Laughs list.[17] An Empire magazine poll of critics and readers named An American Werewolf in London as the 107th greatest film of all time in September 2008.","written_by":"John Landis","budget":"$10 million"}