{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Kip Koenig Scott Marcano","story_by":"Adam Leff Mitchell Peck Jason Blumenthal","Plot":"Bud \"Squirrel\" Macintosh and Doyle \"Stubs\" Johnson are best friends who live together. Bud wins a round of Rock, Paper, Scissors and gets to hit Doyle in the head with a book. Their girlfriends Monique and Jen arrive to take them to an Environmental Party when they discover the injured Doyle. The girls learn that the book was used to injure Doyle as an excuse to not go. The girls call the boys from a payphone to announce they'll be joining some hot swim team guys at a party down by a lake. Bud and Doyle drive out to the lake, only to find they have been had.Driving back home, they pass by the Bio-Dome, where scientist Dr. Noah Faulkner is about to seal his team in for a year without outside contact. Mistaking the Bio-Dome for a mall, Bud and Doyle go inside to use the bathroom, to be sealed in along with the scientists. Dr. Leaky, the project's investor, discovers them and demands that they be kicked out. Dr. Faulkner refuses, claiming it would destroy the purpose of the experiment, and so Bud and Doyle remain. This proves to be a mistake, as Bud and Doyle continue their antics, harming themselves and destroying many of the scientists' projects. The scientists plead to Dr. Faulkner, but he only relents after the two find a secret stash of junk food and experiment with laughing gas. Bud and Doyle are then banished to the desert environment section and after three days of being stuck, they discover a key in the lock of one of the windows, which opens a back door, and they escape the Bio-Dome.As Bud and Doyle are receiving a pizza delivery at the dome, they learn Jen and Monique are attending an environmental party with other men. Bud and Doyle decide to outdo the party and hold one inside the Bio-Dome to win them back. The party backfires as it throws the experiment into chaos and Jen and Monique disavow the boys. The scientists prepare to exit out the desert through the door. Doyle intervenes and demands they all stay and restore the dome to full health, swallowing the key as a last resort. As the group gets a grip on the situation and begins to fix the dome, Dr. Faulkner, who had disappeared the night of the party, has gone insane and is starting plans to blow up the Dome with homemade coconut bombs. As Earth Day approaches, the team is successful in restoring the dome and on the night before the doors open again, Bud and Doyle discover Dr. Faulkner. He tells the two that he is rigging pyrotechnics for the door opening ceremony and gets them to help plant the bombs. Once Bud and Doyle are on their own with the bombs, they goof off with one of the coconuts and after a failed long pass, discover their explosive nature. They alert the others and try to exit the dome early, but the door cannot be opened until the clock hits zero, when the bombs will go off. Bud and Doyle run back into the dome to find Dr. Faulkner and get him to deactivate the bombs. They wind up finding him and through a chase and struggle, knock him out and use the remote to disable the coconuts.The team gets ready to exit the now open door, but as they begin to walk out, Dr. Faulkner returns with one last coconut bomb, trips, and the bomb detonates at the entrance. It turns out everyone is ok with Bud and Doyle reuniting with Jen and Monique who are proud of what they have been able to achieve. As Bud, Doyle, Jen and Monique drive off, Doyle yet again has to use the bathroom and the car is seen driving toward a mysterious nuclear power plant. Dr. Faulkner, however, has escaped the dome through the desert window door, having retrieved the key Doyle swallowed.","language":"English","Reception":"Produced on an estimated budget of $15 million,[4] Bio-Dome grossed $13.4 million in North America.[5]Bio-Dome has a rating of 5% on review aggregation website Rotten Tomatoes, based on 21 reviews.[6]Metacritic, a website which aggregates film reviews: As of May 2013, its score of 1/100 (indicating \"Overwhelming dislike\"). However, non-critics gave the film a much higher score of 6.7 indicating a majority \"liked\" the film.[7]At the 1996 Golden Raspberry Awards, Shore co-won a Razzie Award for Worst Actor for his work in the film, tied with Tom Arnold for that actor's performances in Big Bully, Carpool and The Stupids.[8]","box_office":"$13.4 million[1]","cinematography":"Phedon Papamichael, Jr.","production_company":"Motion Picture Corporation of America","directed_by":"Jason Bloom","narrated_by":"Rodger Bumpass","release_dates":"January 12, 1996 (1996-01-12)|||||","produced_by":"Bradley Jenkel Brad Krevoy Steven Stabler","starring":"Pauly Shore Stephen Baldwin William Atherton Joey Lauren Adams Teresa Hill Rose McGowan Kylie Minogue Dara Tomanovich","running_time":"95 minutes","Sequel":"On December 18, 2013, Stephen Baldwin appeared on Mancow Muller's radio/TV show, confirming that he is in talks with Pauly Shore about making a sequel to the film revolving around the children of their characters Bud and Doyle. Baldwin had also stated that he gets recognized more for his role in Bio-Dome than any other film he has done thus far.","bio-dome":"Home media release poster","music_by":"Andrew Gross","edited_by":"Christopher Greenbury","budget":"$15 million"}