{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"In 1948, wealthy businessman Hunt Shelton and his heavily pregnant wife get lost in rural West Virginia when Mrs. Shelton goes into labor near the town of Jupiter Hollow. At the local hospital, they are turned away because it is exclusively for employees of Hollowmade, the local furniture maker. Mr. Shelton buys the company on the spot, and Mrs. Shelton is then admitted. The Ratliffs, an impoverished couple, arrive moments later with Mrs. Ratliff also in labor. Both women give birth to twin girls, and the elderly nurse attending the doctor confuses and mixes up the sets of twins. Mr. Ratliff overhears the Sheltons deciding to name their daughters Rose and Sadie, and suggests the same names to his wife.Forty years later, the Shelton sisters are now co-chairwomen of Moramax in New York City, a conglomerate that is the successor to their father's business interests. Sadie Shelton (Midler) is focused on her career to the detriment of her family, while Rose Shelton (Tomlin) wishes for a simpler life in the country. As part of her business plan, Sadie plans to sell Hollowmade, but must get stockholders' approval to proceed. In Jupiter Hollow, Rose Ratliff (Tomlin) has risen to the position of forewoman at the Hollowmade Factory, and is also very career-driven. Meanwhile, Sadie Ratliff (Midler) has always felt misplaced in rural life and wishes for a more sophisticated life in a big city. Rose discovers Moramax's plans to sell Hollowmade and makes plans to travel to New York City to stop the sale. Wanting to see (and stay in) the city, Sadie agrees to join her sister.While Sadie Shelton makes plans for the shareholders' meeting, she learns from her employee Graham Sherbourne that \"R. Ratliff\" plans to come to New York with his sister to stop the sale. Sadie orders Sherbourne to locate \"R. Ratliff\" to prevent them from appearing at the meeting. A series of mixups at JFK Airport leaves the Shelton sisters stranded while the prospective buyer of Hollowmade, Mr. Fabio Alberici, takes their limousine back to the Plaza Hotel with the Ratliff sisters. The Ratliffs are checked into the Sheltons' suite, and the Sheltons are forced to take the suite next door, leading to a series of near-misses between the four sisters and the men who are pursuing them romantically. In the meantime, Graham and his assistant/boyfriend assume that a visitor from Jupiter Hollow, Rose Ratliff's beau Roone Dimmick, is \"R. Ratliff.\"All sisters discover their mixup in the lobby bathroom. After Sadie Shelton reveals that she is still planning to sell Hollowmade, the Ratliffs trap Sadie Shelton in the broom closet while Rose Shelton and Sadie Ratliff attend the shareholders' meeting and successfully stop the sale of Hollowmade. Both sets of twins later leave the Plaza hotel with their newfound loves.","language":"English","Reception":"Critical reaction to the film as a whole was generally lukewarm. The review aggregator website Rotten Tomatoes reported that 34% of critics gave the film a positive rating, based on 14 reviews, with an average score of 4.9/10.[2] Sheila Benson from The Los Angeles Times called Big Business a \"bright whirligig of a movie\" and added: \"As you watch its buoyant hilarity, the intricacies flow smoothly as honey off a spoon [...] Like a sensational party the night before, \"Big Business\" may not bear the closest scrutiny in the cold light of day, but it gives an irresistible glow at the time. And when it gets on a roll, it's a movie with more wit to its lines and a more pungent array of them than much of the mishmash that has passed as Bette Midler's Greatest Movie Hits.\"[3] Philadelphia Daily News writer Ben Yagoda felt that the film was \"big fun. Lily Tomlin and Bette Midler are a double dose of hilarity. Call out the National Guard — Big Business is a laugh riot\".[4]In his review for The New York Times, Vincent Canby remarked that Big Business, \"though it never quite delivers the boffo payoff, is a most cheerful, very breezy summer farce, played to the hilt by two splendidly comic performers [...] Sometimes [the film's writers] do have trouble in characterizing the two sets of twins, allowing them to blend in such a way that the comic edge finally becomes blurred. Yet the film moves at such a clip, and with such uncommon zest, that it's good fun even when the invention wears thin.\"[5] Roger Ebert, writing for the Chicago Sun-Times gave the film two out of four stars. He declared the film \"an endless and dreary series of scenes in which the various twins just barely miss running into each other in the Plaza Hotel,\" and found that it felt \"unfinished\" and missed a payoff.[6] Variety called the film \"a shrill, unattractive comedy.\" The staff felt that Midler's \"loud brashness generally dominated [Tomlin's] sly skittishness\".[7]In the United States, Big Business debuted within the top three on the box-office chart and became a modest success, eventually grossing $40,150,487 during its domestic run.[8][9][10]","box_office":"$40,150,487","cinematography":"Dean Cundey","production_company":"Touchstone Pictures Silver Screen Partners III","directed_by":"Jim Abrahams","Home Media":"The film was released to VHS and laserdisc in 1990 by Touchstone Home Video, with a DVD release in 2002. In 2011, Big Business was among a selection of titles from Touchstone and Hollywood Pictures to be licensed to Mill Creek Entertainment and a DVD and Blu-ray disc were released of the film. The DVD is available on its own, as a double-feature with Straight Talk, and as a triple-feature with Straight Talk and V.I. Warshawski.","Soundtrack":"Track Listing","release_dates":"June 10, 1988 (1988-06-10)|||||","Production":"The movie was originally written for Barbra Streisand (Midler's role) and Goldie Hawn (Tomlin's role). The plot is a coincidental and playful combination of three previously recognizable stories: Aesop's The Town Mouse and the Country Mouse, Mark Twain's The Prince and the Pauper, and Shakespeare's Comedy of Errors.The production company couldn't get the rights to film at the actual Plaza Hotel in New York City, so it had the hotel recreated on sound stages. To recoup construction costs, Disney built a sitcom called The Nutt House around it. It was an expensive flop. Jim Abrahams said he staged one of the boardroom scenes based on an experience he had when a large agency used many employees to get him to sign with them.","produced_by":"Michael Peyser Steve Tisch","starring":"Bette Midler|Lily Tomlin|","running_time":"97 minutes","big_business":"Theatrical release poster","music_by":"Lee Holdridge","edited_by":"Harry Keramidas","written_by":"Dori Pierson Marc Reid Rubel","budget":"$20 million"}