{"based_on":"Annie's Box  by Randal Keynes","country":"United Kingdom","distributed_by":"Icon Film Distribution (UK)","screenplay_by":"John Collee","Plot":"British naturalist Charles Darwin is a young father who lives a quiet life in an idyllic village. He is a brilliant and deeply emotional man, devoted to his wife and children. Darwin is especially fond of his eldest daughter Annie, a precocious and inquisitive ten-year-old. He teaches her much about nature and science, including his theory of evolution, and tells her stories of his travels. Her favourite story, despite the sad ending, is about the young orangutan Jenny, who is brought from Borneo to the London Zoo, where she finally died of pneumonia in the arms of her keeper. Darwin is furious when he learns that the family clergyman has made Annie kneel on rock salt as punishment for contradicting him about dinosaurs, as their existence and extinction contradicts the church's position that life is unchanging and that the Earth is very young.Having returned from his expedition in the Galapagos Islands 15 years earlier, Darwin is still trying to finish a manuscript about his findings, which will substantiate his theory of evolution. The delay is caused by anxiety about his relationship with his devoutly religious wife, Emma, who fundamentally opposes his ideas and understands the threat to their religion that his work poses. Emma worries that she may go to heaven and he may not, separating them for eternity.The film shows Annie in flashbacks and hallucinations, a vibrant apparition who goads her father to address his fears and finish his big work. It is apparent that Annie has died, and that her death is a taboo subject between Darwin and Emma, as both feel intense blame for her death. As a result of the strained relations between Charles and Emma, they stop making love entirely. Anguished, Darwin begins to suffer from a mysterious, fatiguing illness.It is revealed that after Annie becomes ill in 1851, Darwin takes her to the Worcestershire town of Malvern for James Manby Gully's water cure therapy, against Emma's will. Annie's condition worsens, and she ultimately dies after her father, at her request, tells her Jenny's story once more. Darwin is devastated, and her death sharpens his conviction that natural laws have nothing to do with divine intervention. To his contemporaries, this is an idea so dangerous it seems to threaten the existence of God. In a box in Darwin's study, we discover the notes and observations that will become On the Origin of Species.Having read his 230-page synopsis, Darwin's friends in the scientific community, Joseph Dalton Hooker and Thomas Henry Huxley, also encourage him. Huxley admiringly tells Darwin that with his theory he has \"killed God\", which fills Darwin with dread. In his hallucinations, he also feels that Annie disapproves of his procrastination.Darwin receives a letter from Alfred Russel Wallace in 1858, which details the same findings as Darwin in 20 pages. He has mixed feelings about this; all his work may have been in vain, but on the other hand, as he will not have to write his book, the discord with Emma will heal. However, Darwin's friends urge him to continue, as his book is much more comprehensive.After receiving treatment at Malvern himself, Darwin makes a pilgrimage to the hotel where Annie died. The journey marks a change in him; upon his return home, he is able to reconnect with his wife, and they speak to each other for the first time of their fears and grief over Annie's death. They specifically speak about the possibility that Annie died because she was genetically weak, as Darwin and Emma are closely related cousins. Their renewed devotion restores Darwin's health, and he is able to resume his work, as it also restores Emma's faith in their marriage, and she regains her strength to support his controversial work. Darwin decides that Emma must make the decision about publishing his work. After reading the manuscript, she quietly returns it to him, having addressed the package to John Murray publishers in London. Emma accepts that she is an \"accomplice\" now, but hopes that God will forgive them both.Darwin walks down the lane, holding the package. When the postman arrives, Darwin falters, almost letting him go empty-handed. The postman rides away, unaware of the powerful idea about to be released onto the world. As Darwin walks home, the little figure of Annie walks alongside him.","language":"English","Reception":"The film has received generally negative reviews. Review aggregate Rotten Tomatoes reports that 46% of critics have given the film a positive review based on 92 reviews, with an average score of 5.5/10.[11]Film critic Philip French, writing in The Observer, called the film \"A complex, truthful work that does justice to Darwin's theories and their implications\",[12] while his colleague, film critic Peter Bradshaw in The Guardian, wrote \"This gentle, heartfelt and well-acted film about Charles Darwin and his personal agony preceding the 1859 publication of \"On the Origin of Species\" does not shy away from the issues. But it personalises them, and places them in a new context.\"[13]In The Daily Telegraph, film critic Tim Robey opined: \"Bettany has a genius for distraction and reverie, guiding the film intelligently in and out of its soul-searching flashbacks. Only the closing shot of father and daughter walking hand in hand feels like a sentimental misstep – the one touch too much, in a sad, searching piece of work about the reluctant labour of a great idea.\"[14] In Screen International, senior film critic Fionnuala Halligan wrote: \"Bettany is undoubtedly the film’s main asset: physically and emotionally convincing as Darwin in a very tricky role. Amiel’s core challenge here is to make audiences believe their story: parents to 10 children, eminent Victorians with an unusual devotion to their brood; the author of a book which changed the world.\"[15]Writing in The Hollywood Reporter, film critic Ray Bennett said \"Amiel's greatest achievement is that Creation is a deeply human film with moments of genuine lightness and high spirits to go with all the deep thinking.\"[16]","box_office":"USD 896,298 (worldwide)[3]","cinematography":"Jess Hall","production_company":"Recorded Picture Company BBC Films","directed_by":"Jon Amiel","Releases":"The film had its world premiere on 10 September 2009 at the 2009 Toronto International Film Festival as the opening night Gala Presentation,[6] the first non-Canadian film since 1996 to be so honoured.[7] The film was released in the UK on 25 September 2009, in Greece on 15 October 2009, in Japan on 20 October 2009 (Tokyo International Film Festival), in New Zealand on 24 December 2009, in the Netherlands on 7 January 2010, in Belgium on 20 January 2010, and in the USA and Canada on 22 January 2010.According to producer Jeremy Thomas, the United States was one of the last countries to find a distributor, due to the prominence of controversy about evolution and creation. Thomas said, in the beginning of September 2009: \"It is unbelievable to us that this is still a really hot potato in America. There's still a great belief that He [God] made the world in six days. It's quite difficult for us in the UK to imagine religion in America. We live in a country which is no longer so religious. But in the US, outside of New York and Los Angeles, religion rules.\"[5] His comments in the mainstream press, and the publicity surrounding the Toronto premiere, provoked flame wars across religious, atheist, science, and film communities on the Internet.[8] Posts on related blogs such as film critic Roger Ebert's, a noted admirer of Darwin, stretched into the hundreds.[9]On 24 September 2009, Variety reported that Newmarket Films had acquired the rights to the film, which was then released on 22 January in the US.[10]","release_dates":"25 September 2009 (2009-09-25) (UK)|||||","Production":"Creation is an adaptation by screenwriter John Collee of Annie's Box: Charles Darwin, His Daughter and Human Evolution, a bestselling biography of Charles Darwin by Darwin's great-great grandson Randal Keynes.[4]The film was produced by Jeremy Thomas's Recorded Picture Company as a co-development with BBC Films, and with financial assistance from the UK Film Council's development fund. Much of the filming, which was completed in December 2008,[5] took place in the Wiltshire town of Bradford on Avon, which was standing in for Malvern, and at Darwin's home, Down House in Kent.[4]","produced_by":"Jeremy Thomas","starring":"Paul Bettany Jennifer Connelly","running_time":"108 minutes[1]","music_by":"Christopher Young","creation":"Theatrical release poster","edited_by":"Melanie Oliver","budget":"GBP 10,000,000 (est.)[2]"}