{"based_on":"The Traveling Lady 1954 play  by Horton Foote","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Horton Foote","Plot":"Georgette Thomas (Lee Remick) and her six-year-old daughter Margaret Rose (Kimberly Block) travel to a small southern Texas town to meet her irresponsible rockabilly singer/guitarist husband, Henry Thomas (Steve McQueen), when he is released from prison after serving time for stabbing a man during a drunken brawl.He tries to make a home for his family, but Kate Dawson (Georgia Simmons), the aging spinster who raised him after his parents died, remains a formidable presence in his life and tries to sabotage his efforts, threatening to have him returned to prison if he fails to acquiesce to her demands. When the woman finally dies, Henry drunkenly destroys her possessions and desecrates her gravesite. He is returned to prison, and Georgette and Margaret Rose leave town with local sheriff, Slim (Don Murray).","language":"English","Critical reception":"Bosley Crowther, film critic for the New York Times, observed, \"As honest and humble as is the effort to make the viewer sense a woman's baffled love for a shifty and mixed-up fellow in Baby, the Rain Must Fall, there is a major and totally neglected weakness in this film from a Horton Foote play that troubles one's mind throughout the picture and leaves one sadly let-down at the end. It is the failure of the screenwriter--Mr. Foote himself--to clarify why the object of the woman's deep affection is as badly mixed-up as he is and why the woman, who seems a sensible person, doesn't make a single move to straighten him out...Granting that the wife is astonished and distressingly mystified at the neurotic behavior of her husband, this doesn't mean that the viewer is satisfied to be kept in the dark as to the reasons for the stark and macabre goings-on...As it is, we only see that these two people are frustrated and heart-broken by something that's bigger than the both of them. But we don't know what it is.\" [5]The staff at Variety said the film's chief assets were \"outstanding performances by its stars and an emotional punch that lingers...Other cast members are adequate, but roles suffer from editorial cuts (confirmed by director) that leave sub-plots dangling.\" [6]","box_office":"$1,500,000[1]","cinematography":"Ernest Laszlo","directed_by":"Robert Mulligan","release_dates":"January 15, 1965 (1965-01-15) (United States)|||||","Production":"The film was shot on location in the Texas cities of Bay City, Columbus, Lockhart, and Wharton, and a scene where Lee Remick works at a hamburger joint was filmed at the 31 Flavors ice cream store in Tarzana, California.The title song, with music composed by Elmer Bernstein and lyrics written by Ernie Sheldon, was performed by Glenn Yarbrough during the opening credits. Yarborough's recording reached #12 on the Billboard Hot 100 and #2 on the Easy Listening [4] chart.As a side note, in one scene where McQueen sings at a bar with his rockabilly band, one of his bandmates is singer-songwriter Glen Campbell, who is uncredited in the film.","produced_by":"Robert Mulligan Alan J. Pakula","starring":"Lee Remick Steve McQueen","running_time":"100 minutes","baby_the_rain_must_fall":"Theatrical release poster","music_by":"Elmer Bernstein","edited_by":"Aaron Stell"}