{"country":"France","distributed_by":"EuropaCorp (France) TriStar Pictures (USA) Entertainment Film (UK)","Plot":"In 1992, in Bogota, Colombia, a drug lord's assassin named Fabio Restrepo (Jesse Borrego) tells his boss, Don Luis Sandoval (Beto Benites), that he wants to leave crime behind. Even though Restrepo gives Don Luis a group of computer disks that he claims contains information about Don Luis' business, Don Luis is incensed that Restrepo thinks he can leave. Don Luis sends his henchman Marco (Jordi Mollà) and a group of killers to kill Restrepo and his family. Fabio gives his nine-year-old daughter Cataleya (Amandla Stenberg) a SmartMedia[i] computer memory card with the information Don Luis wants and tells her it's her \"passport\"; he also gives her the address of her uncle Emilio (Cliff Curtis), a criminal in Chicago, who will take care of her. The last thing he gives her is something that he says will keep her safe: his mother's cattleya orchid necklace. After saying their goodbyes, Fabio and his wife Alicia (Cynthia Addai-Robinson) leave to battle Marco and his men but both are gunned down as Cataleya watches. Marco tries to manipulate her into giving the information, but when he asks what she wants, she stabs him in the hand with a knife and replies \"To kill Don Luis\", and escapes. She makes it to the U.S. Embassy and gives the information in exchange for a passport and passage to the United States. She escapes from the airport through a bathroom window and takes a bus to Chicago. Once she finds Emilio, Cataleya asks him to train her as a killer.Fifteen years later, a 24-year-old Cataleya (Zoe Saldana) has become an accomplished assassin. Her uncle serves as her broker, providing her with contracts. She is assigned to kill the notorious gangster Genarro Rizzo (Affif Ben Badra), who is currently in police custody. Implementing an elaborate plan, she gets herself arrested while dressed in a disguise. She manages to escape from her cell with tools she hid in her disguise, travel through the ventilation system, kill Rizzo, and return to her cell. The next morning she is released. As with her previous murders, she leaves her signature, the Cattleya flower, which is a message to her ultimate target, Don Luis. After learning about this Colombian orchid, FBI Special Agent James Ross (Lennie James) can now link this case to more than twenty other cases. As a last resort, the FBI decides to inform the public about Cataleya's calling card. Don Luis, who is currently in a witness protection program overseen by CIA Agent Steve Richard (Callum Blue), realizes that Fabio's daughter is in the U.S. and orders Marco (whose hand still hurts) and his operatives to find her.[5][6]Emilio is furious when he learns Cataleya has been killing with a \"signature\" since she has thereby put her relatives in grave danger. Cataleya's newest target is William \"Willy\" Woogard (Sam Douglas), a millionaire who fled to the Caribbean with $50 million from his Ponzi scheme. She sneaks into his house and shoots him, and he falls inside his shark tank, where the sharks maul him to death. Under the name \"Jennifer\", Cataleya later visits her lover, Danny Delaney (Michael Vartan), and spends the night with him. Danny snaps a picture of her while she sleeps. That morning she meets with her uncle, Emilio, who furiously tells her that eight people were slaughtered in Miami, one of them being his friend. Emilio then retires his niece from her work.[5][6]Danny shows her picture to his friend Ryan, but when Danny leaves to stop his car from being ticketed, Ryan forwards the photo to his sister-in-law, a police clerk, to find out who she is. Now in the police computers, the photo is recognized by the body/morph recognition software as that of the woman who was in the same prison as Genarro Rizzo the night he was killed. Detective Ross is notified, and the FBI quickly trace her location and they are supported by a SWAT team as they leave for her apartment. After Cataleya says goodbye, she goes home, but gets a call from Danny, who confesses that he took a picture of her. Upon seeing the SWAT team enter the apartment, she manages to escape through the garage and goes to Emilio's home, only to discover that Mama, Pepe (Angel Garnica), and Emilio have been tortured and killed by Don Luis's men, leaving her devastated.[5][7]Cataleya ambushes FBI detective Ross in his home in order to find out where Don Luis is. She threatens to kill Ross's family members one by one if he doesn't try harder to help her. Fearing for the safety of his family, Ross meets with CIA agent Steve Richard, who is unhelpful at first, but after Cataleya fires a warning shot through his \"bulletproof\" office window with a large-calibre sniper rifle, Richard gives up Don Luis's current location. Cataleya then goes to a Louisiana land surveyor and threatens him for the floor plans of Don Luis' mansion. Cataleya assaults Don Luis's premises with heavy weaponry and wipes out all the guards, then confronts Marco and, after a violent hand-to-hand battle, stabs him in the neck. Don Luis escapes in a van, but is stopped by a garbage truck. Cataleya calls him on Marco's cell phone, but Don Luis laughs and says that he will kill her and she will never find him because he is never where Cataleya wants him to be. Cataleya responds that he is exactly where she wants him to be. Pepe's two attack dogs are right behind Luis' seat and on her command they violently maul Luis to death. Danny is interrogated by the FBI, but when Ross leaves, Danny gets a cellphone call from Cataleya, who gives him her real name, and he tells her he loves her. Ross' technical team alerts him that Danny is on the phone, but Ross realizes that Danny cannot be charged with any crime, so he is released. Cataleya boards an interstate bus headed for an unknown destination.[5][6]","language":"French English Spanish","Reception":"Review aggregation website Rotten Tomatoes gave Colombiana a 27% rating based on 94 reviews, with the site's consensus that \"Zoe Saldana has the chops but she's taken out by erratic and sloppy filmmaking.\"[11]Christy Lemire of The Associated Press reviewed Colombiana, writing that \"The director of La Femme Nikita and The Fifth Element serves as co-writer and producer here, but this is very much a spin-off of his brand, a continuation of the kind of stereotype- and gravity-defying characters he’s made his name on. Colombiana feels more hammy and muscular, though – but knowingly so, and that’s what makes it solid, late-summer escapist fun.\"[12] Betsy Sharkey of the Los Angeles Times wrote: “This B-movie blast of bloody blam blam is the latest chapter in the Luc Besson book of badly bruised lovelies who are better not crossed. What he began in 1990 with Nikita followed with Léon in ’94 and ’97's The Fifth Element, (the last written with Robert Mark Kamen, who co-wrote Colombiana with Besson), he refines in Colombiana.”[13] Claudia Puig of USA Today wrote: “This is a showy flower of an action film. Saldana doesn’t get much of a chance to emote, but her action skills blossom.”[14] Jordan Mintzer of the Hollywood Reporter, said that \"There are guilty pleasures to be had in this frenzied B starring Zoe Saldana, who gives an acrobatic performance that makes the overcooked material watchable.\"[15]A nonprofit group called PorColombia criticized the film, saying that it stereotyped Colombia in a negative way.[16] Carlos Macias, president of PorColombia, claimed that the film is proof of a \"total lack of creativity\" of \"Hollywood\".[17] When asked about the situation in an interview, Saldana said \"Shame on them? I don't know, I wish I knew how to address stupid unintelligent comments but I don't, I'm not a stupid person.\"[16] In his review in Senses of Cinema, David Martin-Jones named and analyzed a number of shortcomings. Even so, he stated finally that in spite of all its resemblances to Hollywood blockbusters this film provided in comparison at least \"a different perspective\" concerning immigration and international wealth inequality.[18] Martin-Jones states that in the film, a \"...character from the global south wreaks havoc on the wealthy and corrupt in the global north.\" [18] He states that the film \"...juxtaposes the spaces of wealth inequality that coexist and proliferate under globalization.\" [18] In the film, Saldana's travels \"...mirro[r] the trajectory of many immigrants forced to travel to the global north due to conflict or poverty.\"[18] The \"...film offers the possibility of considering the world from a different perspective than is usually seen in a Hollywood blockbuster.\"[18]Colombiana debuted in second place in its first week at the U.S. box office with $10,408,176 behind The Help. It stayed No. 2 until 31 August 2011, when it went down to No. 3 behind The Help and The Debt.[19] The film has made $36,665,854 in United States and Canada, and $24,300,000 internationally countries, bringing its total to $60,965,854 worldwide.","Remake & Sequel":"A Bengali film production company Jaaz Multimedia did a version of this movie named Agnee without permission. It stars Mahiya Mahi, Arefin Shuvo and Misha Sawdagor, and was released in February 2014. The film set a box office record in Bangladesh.At CineEurope 2015 in June, production house EuropaCorp announced upcoming films and also quietly mentioned that Lucy 2 & Colombiana 2 were in development.","box_office":"$61 million[3]","cinematography":"Romain Lacourbas","production_company":"EuropaCorp TF1 Films Production Grive Productions","directed_by":"Olivier Megaton","colombiana":"Theatrical release poster","release_dates":"27 July 2011 (2011-07-27) (France)|||||","Production":"Filming began around 20 August 2010 in locations including Chicago, New Orleans, Mexico, and France.[8] The film was produced by Luc Besson's EuropaCorp company and the script was written by Besson and Robert Mark Kamen.[9][10]","produced_by":"Luc Besson, Ariel Zeitoun","starring":"Zoe Saldana Michael Vartan Cliff Curtis Lennie James Callum Blue Jordi Mollà","running_time":"108 minutes[1]","music_by":"Nathaniel Méchaly","edited_by":"Camille Delamarre","written_by":"Robert Mark Kamen","budget":"$35 million[2][3]"}