{"based_on":"Conan the Barbarian stories  by Robert E. Howard","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Stanley Mann","story_by":"Roy Thomas Gerry Conway","Plot":"Conan (Arnold Schwarzenegger) and his companion, the thief Malak (Tracey Walter), are confronted by Queen Taramis (Sarah Douglas) of Shadizar. She tests their combat ability with several of her guards. Satisfied, she tells Conan that she has a quest for him. He refuses her, but when she promises to resurrect his lost love, Valeria, Conan agrees to the quest. He is to escort the Queen's niece, Jehnna (Olivia d'Abo), a virgin, who is destined to restore the jeweled horn of the dreaming god Dagoth; a magic gem must first be retrieved that will locate the horn. Conan and Malak are joined by Bombaata (Wilt Chamberlain), the captain of Taramis's guard. Bombaata has secret orders to kill Conan once the gem is obtained.Because the gem is secured in the fortress of a powerful wizard, Conan seeks the help of his friend, Akiro (Mako), the Wizard of the Mounds. Akiro has been captured by a tribe of cannibals, and must first be rescued. Afterward, the adventurers encounter Zula (Grace Jones), a powerful bandit warrior being tortured by vengeful villagers. Freeing Zula at Jehnna's request, Conan accepts the indebted warrior's offer to join their quest.The adventurers travel to the castle of Toth-Amon (Pat Roach) where the gem is located. As they camp for the night, the wizard takes the form of a giant bird and kidnaps Jehnna. The others wake in time to see the bird enter the castle. Sneaking in through a water gate, they search the castle, but Conan is separated from the group and the others are forced to watch him battle a fierce man-beast. Conan mortally wounds the creature, which is revealed as another form of Toth-Amon. With the wizard's death, the castle begins to disintegrate, forcing the group's hasty retreat. They are ambushed by Taramis's guards, but drive them off. Bombaata feigns ignorance about the attack. The gem reveals the location of the jeweled horn. Jehnna expresses romantic interest in Conan, but he rebuffs her and declares his devotion to Valeria.They reach an ancient temple where the horn is secured. Jehnna obtains it while Akiro deciphers engravings. He learns that Jehnna will be ritually sacrificed to awaken Dagoth. They are attacked by the priests who guard the horn. A secret exit is revealed, but Bombaata blocks the others' escape and seizes Jehnna. Despite this treachery, Conan and his allies escape the priests and trek to Shadizar to rescue Jehnna.Malak shows them a secret route to the throne room. Conan confronts Bombaata and kills him in combat. Zula impales the Grand Vizier (Jeff Corey) before he can sacrifice Jehnna. Because Bombaata and the Vizier were \"impure sacrifices\", the rising Dagoth (André the Giant) becomes distorted from a beautiful human form into a monstrous entity. Dagoth kills Taramis, then attacks Conan. Zula and Malak join the fight, but are effortlessly swept aside by the entity. Grappling with the monster, Conan tears out Dagoth's horn, weakening the creature enough to kill him.Afterward, the newly crowned Queen Jehnna offers each of her companions a place in her new court: Zula will be the new captain of the guard, Akiro the queen's advisor, and Malak the court jester. Jehnna offers Conan marriage and the opportunity to rule the kingdom with her, but he declines and departs to find further adventures and his own place in the world.","In popular culture":"Kim Wayans' spoof portrayals of Grace Jones on the show In Living Color are based on Grace's performance of Zula in this film. In 1985 Australian heavy metal music group Prowler changed its name to Taramis after the character from this film.[7]","language":"English","Reception":"Conan the Destroyer received mixed to negative reviews from critics. Despite some lukewarm critical response, the film succeeded at the box office upon its 1984 release, grossing a respectable $31,042,035 in the U.S. and an additional $69 million in international markets, with the film grossing a combined total of $100,042,035. This success led Schwarzenegger, Fleischer, and De Laurentiis to team up again to make Red Sonja a year later; however, Red Sonja was a critical and commercial disappointment and ended Schwarzenegger's involvement in sword-and-sorcery films. The film was nominated for two Razzie Awards, including Worst Supporting Actress and won Worst New Star for D'Abo.[3]Marvel Comics published a comic-book adaptation of the film by writer Michael Fleisher and artist John Buscema in Marvel Super Special #35 (Dec. 1984).[4] The adaptation was also available as a two-issue limited series.[5]Roy Thomas and Gerry Conway wrote the original story treatment, but were dissastified with the final screenplay by Stanley Mann and the finished film. They made their story into the graphic novel Conan the Barbarian: The Horn of Azoth, published in 1990, with art by Mike Docherty.[6] The names of the characters were changed to distance the graphic novel from the movie: Dagoth became Azoth, Jehnna became Natari, Zula became Shumballa, Bombaata became Strabo, Toth-Amon became Rammon, and the characters of Queen Taramis and The Leader were combined into sorcerer Karanthes, father of Natari.Robert Jordan wrote a novelization of the film in 1984 for Tor.","box_office":"$100.0 million [2]","Conan the Conqueror":"The third film in the Conan trilogy had been planned for a 1987 release with the title Conan the Conqueror. The director was to have been either Guy Hamilton or John Guillermin. Arnold Schwarzenegger, however, was committed to the film Predator, and De Laurentiis's contract with the star had expired after his obligation to Red Sonja and Raw Deal, and he was not keen to negotiate a new one. The third Conan film thus sank into development hell. The script was eventually turned into Kull the Conqueror.[citation needed]","cinematography":"Jack Cardiff","production_company":"Dino De Laurentiis Company","directed_by":"Richard Fleischer","Soundtrack":"Track Listing for the First Release on LPSide OneSide TwoTrack Listing for the First Release on CD","Music":"The musical score of Conan The Destroyer was composed, conducted and produced by Basil Poledouris, and it was performed by The Orchestra \"Unione Musicisti Di Roma\".","release_dates":"June 29, 1984 (1984-06-29)","Production":"When John Milius, director of Conan the Barbarian, proved to be unavailable to direct the sequel, Dino De Laurentiis suggested Richard Fleischer to his daughter Raffaella De Laurentiis, who was producing Conan the Destroyer. Fleischer had already made Barabbas (1961) and Mandingo (1975) for Dino De Laurentiis.Conan the Barbarian made approximately $40 million at the U.S. box office when it was released in 1982 with an R-rating, and an additional $50 million in foreign markets. Because Universal Pictures and producer Dino De Laurentiis thought it would have been even more successful if it had been less violent, they wanted to tone down the violence in the sequel. Conan the Destroyer originally received an R-rating like its predecessor, but the film was recut in order to secure a PG-rating. Fleischer delivered a movie that was less violent (and somewhat more humorous) than the first—although some scenes of violence have bloody results (the PG-13 rating didn't exist until August of that same year).Arnold Schwarzenegger, with the help of Will Hatty, put on an extra 5 kilograms (10 pounds), at director Richard Fleischer's request, to play Conan in this film. Mako Iwamatsu, who played the Wizard of the Mound and narrator in the first film, also returns with his character properly named. Sven-Ole Thorsen, who played Thorgrim in the first film, also returned, but this time he had to partially cover his face with a mask, as he was playing a different (yet more bearded) character. Singer Grace Jones gave a noteworthy performance as the female warrior Zula, the last of her tribe. This would be the first major role for seven-foot, one-inch-tall basketball player Wilt Chamberlain. It would be 15-year-old (at time of release) Olivia d'Abo's first screen appearance, playing the petulant teenage princess. David L. Lander was originally cast to play the foolish thief Malak, but due to Lander's deteriorating health from the onset of multiple sclerosis, Lander was forced to quit the project, and the part was recast with Tracey Walter. André the Giant played Dagoth but was not credited in the film, as he was in costume.Conan the Destroyer was the fourth film on which British director of photography Jack Cardiff worked with Fleischer. Cardiff had already photographed The Vikings (1958), Crossed Swords (1977), and Amityville 3-D (1983) for the director. They would work together twice more on Million Dollar Mystery (1987), and Fleischer’s last film, the short Call from Space (1989), which was shot in the 65mm Showscan process. Cardiff’s other notable films include John Huston's The African Queen (1951), King Vidor's War and Peace (1956), and Rambo: First Blood Part II (1985). However, he is best known for his extraordinary Technicolor photography on three films directed by Michael Powell and Emeric Pressburger in the forties — A Matter of Life and Death (1946), Black Narcissus (1947, for which Cardiff won an Oscar), and The Red Shoes (1948).Conan the Destroyer was filmed in a number of locations in Mexico — including Pachuca, the extinct volcano Nevado de Toluca, and the Samalayuca Dunes (near to Ciudad Juárez and El Paso) — as well as in the Churubusco Studios (also in Mexico). Carlo Rambaldi created the Dagoth monster.In the film, a camel is knocked to the ground, and after struggling to get back up, its hind legs are drawn forward with wires so that it is forced to sit down before falling to the ground. This sequence is cut from the U.K. version, as is a double horse-fall in the opening battle. There are a number of deleted scenes from the movie, confirmed by actress Sarah Douglas, including Conan and Queen Taramis love scene, Taramis slapping Bombatta, extended battle scene between Conan and the Man-ape, and more graphic action scenes.","produced_by":"Raffaella De Laurentiis","starring":"Arnold Schwarzenegger|Grace Jones|Wilt Chamberlain|Mako|Tracey Walter|Olivia d'Abo|Sarah Douglas|","running_time":"101 minutes","music_by":"Basil Poledouris","edited_by":"Frank J. Urioste","budget":"$18 million (Estimated)[1]"}