{"country":"United States","distributed_by":"Universal Pictures","Plot":"On a film set, The Crypt Keeper directs an installment of the television show despite his disapproval of the lead actor's talent. Upon becoming aware of the viewer, he proffers his latest project, which he hopes will get him into Hollywood: Demon Knight.On a New Mexico desert road, The Collector pursues drifter Frank Brayker. The vehicles crash, and Brayker flees. Local drunk Uncle Willy takes him to a decommissioned church converted into a boarding house, where he rents a room and observes the residents: owner Irene, prostitute Cordelia, postal clerk Wally, and an itinerant convict on work release named Jeryline. A misogynistic cook named Roach arrives and informs the group about a theft attempt on his employer's car, unaware it was Brayker, and a suspicious Irene calls the sheriff. Sheriff Tupper and his deputy Bob encounter the Collector, who convinces them that Brayker is a dangerous thief. At the boarding house, Tupper and Bob learn that both cars were stolen and arrest Brayker and the Collector, but the Collector kills Tupper by punching through his skull. Driven outside by a key-like artifact Brayker possesses, the Collector draws his own blood on the sand and produces an army of demonic creatures.Brayker uses blood from the artifact to protect the building and tells the group they must wait out the night. Unable to get in, the Collector uses psychic powers to seduce and possess Cordelia. Cordelia kills Wally and cripples Irene before Brayker kills her. The group attempts to escape through old mine tunnels under the building, where Jeryline finds young comic lover Danny hiding. The other townsfolk, under demonic possession, drive them back into the church. The residents demand an explanation, and Brayker reluctantly tells them the history of the key. Following the creation of Earth by God, demons used seven keys to focus the power of the cosmos into their hands. When discovered, God created light, which scattered the demons and the keys across the universe. The artifact that Brayker holds is the last key they need to reclaim power, and to protect it God had a thief named Sirach fill it with the blood of Jesus Christ. The guardians of the key, immortal while holding it, have since been passing it on, refilling it with their own blood when they die; Brayker received the key from his superior officer during World War I. Danny disappears and Jeryline rallies everyone to look for him, during which Roach sneaks the key out of Brayker's satchel.In the attic, Irene and Bob discover that Wally was planning to attack the post office with a trunk full of weapons. The Collector possesses Uncle Willy, who attacks the others. While battling Willy, Roach makes a deal with the Collector to trade his life for the key, but the Collector betrays and kills him after Roach removes the seal. Brayker retrieves the key in the battle, and Irene and Bob sacrifice themselves to stop the remaining minions. In the attic, the Collector brainwashes Danny, who mortally wounds Brayker before Jeryline kills him. As he dies, Brayker initiates Jeryline as a guardian of the key, deactivating all blood seals. Jerryline confronts The Collector and spits blood from the key in his face, causing the Collector to transform into a large demon before being destroyed.At dawn, Jeryline refills the key with Brayker's blood and boards a bus with her cat, sealing the door behind them. Down the road the bus stops to pick up a stranger, who declines to get on. Dressed identically to his predecessor and carrying the same suitcase, Jeryline realizes that he is the next Collector. After exchanging a glance in passing, the new Collector begins following on foot, whistling the theme song to the Tales from the Crypt television series.The Crypt Keeper prepares for the premiere of his film. He informs the viewer that Jeryline lives happily ever after and is enjoying traveling the world. Once he arrives at the lavish premiere, the producers reveal their powers of \"final cut\", snare him in a guillotine, and decapitate him, much to his delight.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 37% of 27 surveyed critics gave the film a positive review; the average rating is 4.1/10.[6] Variety wrote that it is \"neither funny enough nor scary enough to be fully satisfying as either a shocker or a spoof\".[7] Stephen Holden of the New York Times wrote that it half-succeeds at being chilling and funny.[8] David Kronke of the Los Angeles Times called the film \"a direct-to-video affair\" that was given a theatrical release based on the strength of the franchise.[9] Owen Gleiberman of Entertainment Weekly rated it D+ and wrote, \"Is there anything more dispiriting than trash that flaunts its lack of conviction?\"[10] Walter V. Addiego of the San Francisco Examiner called it \"a slime-and-gore fest that offers little but a few outrageous sick jokes and the chance to make a mental list of all the horror movies from which it borrows\".[11] Edward Guthmann of the San Francisco Chronicle wrote that, though the film is dull and slow-paced, \"If I were 12, I might've loved it.\"[12] In a retrospective, Chris Eggertsen of Bloody Disgusting called it \"one of the most underrated genre entries of the '90s\".[13]","box_office":"$21.1 million[2]","cinematography":"Rick Bota","directed_by":"Ernest Dickerson","Home Media":"The film was released on VHS and DVD in 1996 and 2003 respectively. It was also released as part of a double pack with Bordello of Blood, the following Tales from the Crypt film.[citation needed] On October 20, 2015, it was released on Blu-ray from Scream Factory.","Soundtrack":"A soundtrack containing heavy metal, Hip-hop and alternative rock was released on January 10, 1995 by Atlantic Records. It peaked at 157 on the Billboard 200.","release_dates":"January 13, 1995 (1995-01-13)|||||","Production":"Unlike episodes of the HBO series, the story was not ripped from the pages of EC Comics. The first draft of the script was written in 1987,[4] two years prior to the HBO series' debut, and it was first intended to be made into a film by director Tom Holland, who planned to shoot it as a followup to Child's Play. Holland hired an FX team to do preliminary sketches,[5] but he ultimately went on to direct the box-office bomb Fatal Beauty.Next, the script wound up in the hands of Pumpkinhead screenwriter Mark Carducci, who sat on it for several years before it was given to Pet Sematary director Mary Lambert. Lambert had some radical ideas for the script, including casting an African American as Brayker to create a theme that the oppressed people of Earth were also its saviors.[5] Once Lambert went on to direct Pet Sematary Two, which was a theatrical bomb, she could not get people to invest in the film.The script later went to Charles Band's Full Moon Features, but budgetary constraints held up the production in limbo.[5] When it finally made its way onto desks at Joel Silver's Silver Pictures, it was optioned to be the second in a trilogy of Tales from the Crypt theatrical spin-offs.[5] Universal Pictures executives thought the script had more potential than the other two films (Dead Easy and Body Count, neither of which was ultimately produced) and the movie was quickly sent into production with a tentative release date of Halloween 1994[5] (though the release was pushed back to January 1995).At this point, two versions of the script were created to solve budgetary problems: one with demons and one without. In the latter, the Collector was a Bible salesman who was using a legion of fellow salesman clad in black suits and sunglasses (later revealed to be demons) as his minions.[5] A film called Demon Knight with demons that looked like killer yuppies made everyone nervous, so Universal pitched in some additional money to get some demons on the screen.[5]","tales_from_the_crypt:_demon_knight":"Theatrical release poster","produced_by":"Gilbert Adler","starring":"Billy Zane|William Sadler|Jada Pinkett Smith|Thomas Haden Church|CCH Pounder|John Kassir|","running_time":"92 minutes[1]","Sequels":"Demon Knight was supposed to be the second film in the trilogy, but Universal thought it should go first because it was the most Tales-like feature out of the three proposed. Demon Knight was only one of the original titles planned that was actually made; Dead Easy (aka Fat Tuesday), a New Orleans zombie romp which was to possibly open the following Halloween, and the third film, Body Count, were never materialized as planned. The Key in Demon Knight was supposed to appear in every part of the trilogy. It appeared in Bordello of Blood, but not in Ritual.","music_by":"Edward Shearmur","edited_by":"Stephen Lovejoy","written_by":"Mark Bishop|Ethan Reiff|Cyrus Voris|","budget":"$12 million"}