{"based_on":"Catch Me If You Can 1980 book  by Frank Abagnale and Stan Redding","Cast":"Brian Howe, Frank John Hughes and Chris Ellis portray FBI agents. Jennifer Garner cameos as a call girl. Ellen Pompeo, Elizabeth Banks, and Kaitlin Doubleday have small roles. The real Frank Abagnale appears in a cameo as a French police officer arresting his character.[2]","country":"United States","distributed_by":"DreamWorks Pictures","language":"English","box_office":"$352.1 million","cinematography":"Janusz Kamiński","production_company":"Amblin Entertainment Parkes/MacDonald Productions","directed_by":"Steven Spielberg","catch_me_if_you_can":"Theatrical release poster","Musical adaptation":"A musical adaptation of the same name premiered at the 5th Avenue Theatre in Seattle, Washington in July 2009, starring Aaron Tveit and Norbert Leo Butz.[44] It began previews on Broadway at the Neil Simon Theatre on March 11, 2011 and officially opened April 10, 2011.[45][46] The musical was nominated for four Tony Awards, including Best Musical.[47]","release_dates":"December 25, 2002 (2002-12-25)|||||","Production":"Frank Abagnale sold the film rights to his autobiography in 1980.[3] Executive Producer Michel Shane purchased the film rights in 1990,[4] for Paramount Pictures.[5] By December 1997, Barry Kemp purchased the film rights from Shane, bringing the project to DreamWorks, with Jeff Nathanson writing the script.[6] By April 2000, David Fincher was attached to direct over the course of a few months, but dropped out in favor of Panic Room. In July 2000, Leonardo DiCaprio had entered discussions to star, with Gore Verbinski to direct.[7][8] Steven Spielberg signed on as producer, and filming was set to begin in March 2001.[9][10]Verbinski cast James Gandolfini as Carl Hanratty, Ed Harris as Frank Abagnale, Sr., and Chloë Sevigny as Brenda Strong.[11][12] Verbinski dropped out because of DiCaprio's commitment on Gangs of New York.[13] Lasse Hallström was in negotiations to direct by May 2001, but dropped out in July 2001. At this stage Harris and Sevigny left the film, but Gandolfini was still attached.[12][14] Spielberg, co-founder of DreamWorks, offered the job of director to Miloš Forman, and considered hiring Cameron Crowe. During this negotiation period, Spielberg began to consider directing the film himself, eventually dropping projects such as Big Fish and Memoirs of a Geisha.[10][15] Spielberg officially committed to directing in August 2001.[4]The search for Strong's portrayer lasted months but Amy Adams was eventually cast. Spielberg \"loved\" her tape and producer Walter F. Parkes commented that she was \"as fresh and honest as anyone we’d seen,\" which was an important element in the role. Christopher Walken was cast as Frank Abagnale, Sr. following Parkes’ suggestion. Martin Sheen played Roger Strong as he had \"intimidating presence\". Spielberg wanted a French actress to portray Paula Abagnale to stay true to the facts. He asked for Brian De Palma's help who was living in Paris and he did tests with several actresses such as Nathalie Baye. Spielberg had seen Jennifer Garner on Alias and wanted her to play a small role in the film due to her busy schedule.[16]The original start date was January 2002,[4] but was pushed to February 7 in Los Angeles, California.[17] Other locations included Burbank, Downey, New York, LA/Ontario International Airport (which doubled for Miami International Airport), Quebec City and Montreal.[18] The film was shot in 147 different locations in only 52 days. DiCaprio reflected, \"Scenes that we thought would take three days took an afternoon\".[19] Filming ran from April 25–30 in Park Avenue, just outside the Waldorf-Astoria Hotel. Production moved to Orange, New Jersey and returned to Brooklyn for bank and courthouse scenes. Shooting also took place at the TWA Flight Center at John F. Kennedy International Airport.[20] Quebec City was chosen for its European character and French feel. Place Royale, within Old Quebec, stands for Montrichard—the church in the background of the arrest scene is Notre-Dame-des-Victoires.[21] Filming ended on May 12 in Montreal.[22]","running_time":"141 minutes[1]","Release":"\"I know that Hollywood has made a number of changes to the story, but I am honored that Steven Spielberg, Leonardo DiCaprio and Tom Hanks participated in the making of the movie inspired by my life. It is important to understand that it is just a movie, not a biographical documentary.\"Game Show Network aired the 1977 episode of the television game show To Tell the Truth that featured Frank Abagnale. Segments were shown on December 29, 2002 and January 1, 2003 as promotion.[27] The marketing department was careful to market the film as \"inspired by a true story\" in order to avoid controversy similar to that surrounding A Beautiful Mind (2001) and The Hurricane (1999), both of which deviated from history.[24] The premiere took place at Westwood, Los Angeles, California on December 18, 2002.[28]Catch Me If You Can was released on December 25, 2002, earning slightly above $30 million in 3,225 theaters during its opening weekend. The film went on to gross $164.6 million in North America and $187.5 million in foreign countries, coming at a worldwide total of $352.1 million. The film was a financial success, recouping the $52 million budget six times over.[29] Catch Me If You Can was the eleventh highest grossing film of 2002. Minority Report (also directed by Spielberg) was tenth highest.[30]On Rotten Tomatoes, the film has a rating of 96%, based on 195 reviews, with the site's critical consensus reading, \"With help from a strong performance by Leonardo DiCaprio as real-life wunderkind con artist Frank Abagnale, Steven Spielberg crafts a film that's stylish, breezily entertaining, and surprisingly sweet.\"[31] On Metacritic the film has a score of 76 out of 100, based on 38 critics, indicating \"generally favorable reviews\".Roger Ebert heavily praised DiCaprio's performance, and concluded \"This is not a major Spielberg film, although it is an effortlessly watchable one\".[32] Mick LaSalle said it was \"not Spielberg's best movie, but one of his smoothest and maybe his friendliest. The colorful cinematography, smart performances and brisk tempo suggest a filmmaker subordinating every other impulse to the task of manufacturing pleasure.\"[33] Stephen Hunter believed DiCaprio shows \"the range and ease and cleverness that Martin Scorsese so underutilized in Gangs of New York\".[34]James Berardinelli observed, \"Catch Me if You Can never takes itself or its subjects too seriously, and contains more genuinely funny material than about 90% of the so-called 'comedies' found in multiplexes these days\". In addition Berardinelli praised John Williams' film score, which he felt was \"more intimate and jazzy than his usual material, evoking (intentionally) Henry Mancini\".[35] Peter Travers was one of few who gave the film a negative review. Travers considered Catch Me if You Can to be \"bogged down over 140 minutes. A film that took off like a hare on speed ends like a winded tortoise.\"[36]At the 75th Academy Awards, Christopher Walken and John Williams were nominated for Best Supporting Actor and Best Original Score.[37] Walken won the same category at the 56th British Academy Film Awards, while Williams, costume designer Mary Zophres and screenwriter Jeff Nathanson received nominations.[38] DiCaprio was nominated for the Golden Globe Award for Best Actor in a Motion Picture – Drama.[39] Williams also earned a Grammy Award nomination.[40] Elements of the film were later parodied in The Simpsons episode \"Catch 'Em If You Can\".[41]Catch Me If You Can was released on DVD on May 6, 2003[42] and on Blu-ray on December 4, 2012.[43]","budget":"$52 million","screenplay_by":"Jeff Nathanson","Plot":"In 1963, teen-aged Frank Abagnale (Leonardo DiCaprio) lives in New Rochelle, New York with his father Frank Abagnale, Sr. (Christopher Walken), and French mother Paula (Nathalie Baye). When Frank Sr. is denied a business loan at Chase Manhattan Bank due to unknown difficulties with the IRS, the family is forced to move from their large home to a small apartment. Paula carries on an affair with Jack (James Brolin), a friend of her husband. Meanwhile, Frank poses as a substitute teacher in his French class. Frank's parents file for divorce, and Frank runs away. When he runs out of money, he begins relying on confidence scams to get by. Soon, Frank's cons increase and he even impersonates an airline pilot. He forges Pan Am payroll checks and succeeds in stealing over $2.8 million.Meanwhile, Carl Hanratty (Tom Hanks), an FBI bank fraud agent, begins tracking Frank. Carl and Frank meet at a hotel, where Frank convinces Carl his name is Barry Allen of the Secret Service, and that he was also after the fraud. Frank leaves, Carl angrily realizing a minute too late that he has been fooled. Later, at Christmas, Carl is still at work when Frank calls him, attempting to apologize for duping Carl. Carl rejects his apology and tells him he will soon be caught, but laughs when he realizes Frank actually called him because he has no one else to talk to. Frank hangs up, and Carl continues to investigate, suddenly realizing (thanks to a waiter) that the name \"Barry Allen\" is from the Flash comic books and that Frank is actually a teenager.Frank, meanwhile, has expanded his con to include the identities of a doctor and lawyer. While playing Dr. Frank Conners, he falls in love with Brenda (Amy Adams). While asking her father's permission to marry her, he admits the truth about himself and asks for help with the Louisiana State Bar exam. Carl tracks him to his engagement party and Frank is able to sneak out a bedroom window minutes before Carl bursts in. Before leaving, Frank makes Brenda promise to meet him in Miami two days later so they can elope. Frank sees her waiting for him two days later, but also notices plainclothes agents waiting to arrest him, realizing he has been set up and escapes on a flight to Europe.Seven months later, Carl shows his boss that Frank has been forging checks all over western Europe and asks permission to go to Europe to look for him. When his boss refuses, Carl brings Frank's checks to printing professionals who claim that the checks were printed in France. From an interview with Frank's mother, Carl remembers that she was actually born in Montrichard, France. He goes there and locates Frank, and tells him that the French police will kill him if he does not go with Carl quietly. Frank assumes he is lying at first, but Carl promises Frank he would never lie to him, and Carl takes him outside, where the French police escort him to prison.The scene then flashes forward to a plane returning Frank home from prison, where Carl informs him that his father has died. Grief-stricken, Frank escapes from the plane and goes back to his old house, where he finds his mother with the man she left his father for, as well as a girl who Frank realizes is his half-sister. Frank gives himself up and is sentenced to 12 years in prison, getting visits from time to time from Carl. When Frank points out how one of the checks Carl is carrying as evidence is fake, Carl convinces the FBI to offer Frank a deal by which he can live out the remainder of his sentence working for the bank fraud department of the FBI, which Frank accepts. While working at the FBI, Frank misses the thrill of the chase and even attempts to fly as an airline pilot again. He is cornered by Carl, who insists that Frank will return to the FBI job since no one is chasing him. On the following Monday, Carl is nervous that Frank has not yet arrived at work. However, Frank eventually arrives and they discuss their next case.The ending credits reveal that Frank has been happily married for 26 years, has three sons, lives in the Midwest, is still good friends with Carl, has caught some of the world's most elusive money forgers, and earns millions of dollars each year because of his work creating unforgeable checks.","Themes":"Catch Me if You Can deals with themes of broken homes and troubled childhoods. Spielberg's parents divorced when he was a teenager, similar to Frank Abagnale's situation. In the film, Carl Hanratty is also divorced from his wife, who lives with their daughter in Chicago. \"Some of my films have had to do with broken homes and people on the run from their sad pasts\", Spielberg stated. \"But there are those strands that got me to say: you know, there's something also about me that I can say through the telling of this kind of lighthearted story\".[24]Spielberg also wanted to create a film that sympathized with a crook. He explained, \"Frank was a 21st century genius working within the innocence of the mid '60s, when people were more trusting than they are now. I don't think this is the kind of movie where somebody could say, 'I have a career plan.'\"[24]","Music":"The film's soundtrack was released on December 10, 2002 by DreamWorks Records. The original score was composed by John Williams.","produced_by":"Steven Spielberg|Walter F. Parkes|","starring":"Leonardo DiCaprio|Tom Hanks|Christopher Walken|Martin Sheen|Nathalie Baye|","Fictions":"Despite the various changes from real-life events, Abagnale believed Spielberg was the only filmmaker who \"could do this film justice\".[23] However, Abagnale had little involvement with the film. In November 2001, he had \"never met nor spoken to Steven Spielberg and I have not read the script. I prefer not to. I understand that they now portray my father in a better light, as he really was. Steven Spielberg has told the screenplay writer (Jeff Nathanson) that he wants complete accuracy in the relationships and actual scams that I perpetrated\", Abagnale reported. \"I hope in the end the movie will be entertaining, exciting, funny and bring home an important message about family, childhood and divorce\".[23]The real Abagnale never saw his father again after he ran away from home. Spielberg \"wanted to continue to have that connection where Frank kept trying to please his father; by making him proud of him; by seeing him in the uniform, the Pan-American uniform\". However, Abagnale praised the idea. \"Even though I didn't see my dad again, every night after living a brilliant day and meeting many women, and making much money, I'd come back alone to a hotel room and I would just think of my mom and dad and fantasize about getting them back together again, and cry. It's the justification of a fantasy.\"[24] Carl Hanratty (portrayed by Tom Hanks) is based on FBI agent Joseph Shea.[25] In the shooting script the character was referred to as Joseph Shea, but was changed to Carl Hanratty for unknown reasons.[26]","music_by":"John Williams","edited_by":"Michael Kahn"}