{"based_on":"About Schmidt  by Louis Begley","country":"United States","distributed_by":"New Line Cinema","screenplay_by":"Alexander Payne Jim Taylor","Plot":"Warren Schmidt is retiring from his position as an actuary with Woodmen of the World, an insurance company in Omaha, Nebraska. After a retirement dinner, Schmidt finds it hard to adjust to his new life, feeling useless. He sees a television advertisement about a foster program for African children, Plan USA, and decides to sponsor a child. He soon receives an information package with a photo of his foster child, a small Tanzanian boy named Ndugu Umbo, to whom he relates his life in a series of candid, rambling letters.Schmidt visits his young successor to offer his help, but the offer is politely declined. As he leaves the building, Schmidt sees the contents and files of his office, the sum of his entire career, set out for garbage collectors.He describes to Ndugu his longtime alienation from Helen, his wife, who suddenly dies from a blood clot in her brain just after their purchase of a Winnebago Adventurer motor home. Jeannie, his only daughter, and her fiancé Randall Hertzel arrive from Denver. They console him at the funeral, but Jeannie later berates him for taking his wife for granted, such as by refusing to fully pay for the Winnebago (he wanted the cheaper Minnie Winnie) and burying her in a cheap casket. He asks her to move back to take care of him, but she refuses. Meanwhile, Randall tries to entice him into a pyramid scheme.Schmidt feels his daughter could do better than Randall, a waterbed salesman. After the couple leaves, Schmidt is overcome by loneliness. He stops showering, sleeps in front of the television, and goes shopping with a coat over pajamas to load up on frozen foods. In his wife's closet he discovers some hidden love letters disclosing her long-ago affair with Ray, a mutual friend, whom Schmidt angrily confronts.He decides to take a journey alone in his new Winnebago to visit his daughter and convince her not to marry Randall. He tells Jeannie he's leaving early for the wedding, but she makes it clear she doesn't want him there until right before the ceremony. Schmidt decides to visit places from his past, including his college campus and fraternity at University of Kansas and his hometown in Nebraska. His childhood home has been replaced by a tire shop. While at a trailer campground, he is invited to dinner by a friendly and sympathetic couple. When the man leaves to buy some beer, Schmidt makes a pass at the wife, and flees in terror when she adamantly rejects his advance.Sitting on the roof of his RV on a starry night, Schmidt forgives his departed wife for her affair and apologizes to her for his own failings as a husband. At that moment, he is amazed to see a bright meteor streak across the sky as a possible sign from Helen that she forgives him.Feeling full of purpose and energetic renewal, Schmidt arrives in Denver, where he stays at the home of Roberta, Randall's mother. He is appalled by Randall's eccentric, socially odd family and tries unsuccessfully to dissuade Jeannie from the marriage. Schmidt throws out his back after sleeping on Randall's waterbed, infuriating Jeannie. Roberta assures Schmidt that a soak in her hot tub will help his back, but he flees after a nude Roberta makes a pass at him in the tub. The next day, Schmidt, under the influence of Percodan to soothe his back pain, attends the wedding and delivers a kind speech at the reception, hiding his disapproval.On his way home from Denver, Schmidt composes a letter to Ndugu. Schmidt questions what he has accomplished in life, lamenting that he will soon be dead, that his life has made no difference to anyone, and that eventually it will be as if he has never existed at all.A pile of mail is waiting for him at home. Schmidt opens a letter from Tanzania. It is from a nun, who writes that Ndugu is illiterate and doesn't know English but appreciates Schmidt's letters and financial support very much. A crayon drawing by Ndugu is enclosed, showing two smiling stick figures, one large and one small, holding hands on a sunny day. Schmidt is moved to tears as the film ends.","language":"English","Reception":"In the United States, the movie grossed $8,533,162 on its opening weekend. Its total U.S. box office gross stands at $65,010,106, while total worldwide gross totals $105,834,556.[2]About Schmidt drew praise from a number of critics, who singled out the performances of Jack Nicholson and Kathy Bates. Film website Rotten Tomatoes reported that 85% of critics gave the film a positive review based on 201 reviews with a \"Certified Fresh\" rating and an average score of 7.7/10. The site's consensus states: \"In this funny, touching character study, Nicholson gives one of the best performances of his career.\"[3] On Metacritic, which assigns a rating out of 100 based on reviews from critics, the film has a score of 85 (citing \"universal acclaim\") based on 40 reviews.[4] Roger Ebert wrote for the Chicago Sun-Times that About Schmidt \"is essentially a portrait of a man without qualities, baffled by the emotions and needs of others. That Jack Nicholson makes this man so watchable is a tribute not only to his craft, but to his legend: Jack is so unlike Schmidt that his performance generates a certain awe. Another actor might have made the character too tragic or passive or empty, but Nicholson somehow finds within Schmidt a slowing developing hunger, a desire to start living now that the time is almost gone.\"[5] Michael Rechtshaffen of the The Hollywood Reporter wrote: \"It's a commanding Jack Nicholson lead performance that puts it into a sublime league of its own.\" Paul Clinton of CNN.com wrote: \"About Schmidt is undoubtedly one of the finest films of the year. If you're not deeply touched by this movie, check your pulse.\"[6]At the 75th Academy Awards, both Nicholson and Bates were nominated for their performances as Best Actor in a Leading Role and Best Actress in a Supporting Role. The film found more success at the 60th Golden Globe Awards, winning the awards for Best Screenplay – Motion Picture and Best Performance by an Actor in a Motion Picture – Drama. Upon accepting his award, Nicholson stated, \"I'm a little surprised. I thought we made a comedy.\"It was also part of the Official Competition Selection at the 2002 Cannes Film Festival.[7]","box_office":"$105,834,556","about_schmidt":"Theatrical release poster","cinematography":"James Glennon","production_company":"New Line Cinema","directed_by":"Alexander Payne","Home media":"About Schmidt was released on DVD and VHS formats. It was released on Blu-ray for the first time on February 3, 2015.","release_dates":"May 22, 2002 (2002-05-22) (Cannes Film Festival)|December 13, 2002 (2002-12-13) (United States)||||","Production":"Bill Murray was considered for the role of Warren R. Schmidt.[1]","produced_by":"Michael Besman Harry Gittes Rachael Horovitz","starring":"Jack Nicholson Hope Davis Dermot Mulroney Kathy Bates","running_time":"124 minutes","music_by":"Rolfe Kent","edited_by":"Kevin Tent","budget":"$30 million"}