{"based_on":"Clash of the Titans  by Beverley Cross","country":"United States United Kingdom","distributed_by":"Warner Bros. Pictures","screenplay_by":"Travis Beacham Phil Hay Matt Manfredi","Plot":"In ancient times after defeating their predecessors, the Titans, the gods divided the Universe among themselves. Zeus took the skies, Poseidon took the seas, and Hades was left with the Underworld upon being tricked by Zeus. The gods created the mortals, whose faith and prayers fueled the gods' immortality. As time passed, however, mortals began to question and soon resist their creators, angering the Olympians.A fisherman named Spyros finds a coffin adrift in the sea, discovering a baby, Perseus and his mother Danaë. Spyros and his wife, Marmara, raise Perseus as their own son, alongside their daughter, Tekla.As Perseus and his family fish from a boat, they watch soldiers from the city of Argos destroy a statue of Zeus. Infuriated at this desecration, the Gods unleash the Furies who attack the soldiers and destroy the fishing vessel. Only Perseus survives and is found by a group of the soldiers.Perseus is brought before King Cepheus and Queen Cassiopeia, who are celebrating their campaign against the gods. Queen Cassiopeia brashly compares her daughter Andromeda to the gods and boasts that she is more beautiful than Aphrodite. The revelry is cut short by the arrival of Hades, who has been given leave by Zeus to punish the mortals for their defiance. Hades threatens to unleash his monster the Kraken against Argos, unless Andromeda is offered as a sacrifice. Before leaving, he reveals that Perseus is a demigod and the son of Zeus.Perseus meets Io, who confirms his origin. Io also reveals that she has watched over Perseus his entire life. She has always protected him for he is the only one who can defeat the gods.Perseus leads the King's Guard to the Stygian Witches, looking for a way to kill the Kraken. After being betrayed by the power-hungry Hades, Zeus gives Perseus a sword forged on Mount Olympus and a winged horse named Pegasus. Perseus refuses both, but the captain of the King's guard named Draco keeps the sword for when Perseus needs it. Soon after, they are attacked by Calibos, an agent of Hades. Draco severs the beast's hand and Calibos flees. The band give chase but are attacked by giant scorpions called Scorpioxs that spring from spilled drops of Calibos's blood. They are saved by a band of Djinn, non-human desert sorcerers led by Sheik Suleiman where the remaining Scorpioxs are tamed by the Djinn. The Djinn also wish for the gods' defeat and lend their aid to Perseus and his band.The group arrives at the lair of the Stygian Witches and learn that to kill the Kraken, they must obtain and use the head of Medusa, a gorgon who resides in a temple in the Underworld. Any living creature that looks on Medusa's eyes turns into stone.Perseus, Io, Suleiman, Draco, and his remaining men, Solon, Eusebios, and Ixas, cross into the Underworld. The men enter Medusa's temple lair while Io, being a woman and forbidden from entering, remains outside. Medusa kills all three of Draco's men. Suleiman and Draco both wound the gorgon, sacrificing themselves in the process. Perseus finally beheads her by using his reflective shield to see her with his back turned. As he leaves the temple with Medusa's head, Calibos appears behind Io and fatally stabs her. Perseus and Calibos fight where upon finally accepting that he is a son of Zeus, Perseus picks up the Olympian sword and stabs Calibos through the chest, who with his last breath urges Perseus not to become a God.Before dying, Io urges a reluctant Perseus to leave her and save Andromeda and Argos. Then she dissolves into a golden ethereal vapor. Pegasus appears and Perseus mounts the flying horse and hastens back to Argos as the Kraken is released. The people of Argos seize and bind Andromeda to offer her to the Kraken. Meanwhile, as people die in the Kraken's wake, the balance of power on Olympus shifts. Hades reveals he does not require the faith or worship of mortals (as Zeus does), as he has learned to survive on their fear. Hades then effortlessly subdues the weakened Zeus.Riding the black Pegasus, Perseus arrives at Argos and exposes Medusa's head to the Kraken, which makes eye contact just before it is able to reach Andromeda. The Kraken, petrified, slowly turns to stone and shatters. Prokopion, the insane leader of the Cult of Hades, tries to kill Perseus, but Cepheus stops him and is stabbed, before both are killed when the kraken's petrified hand falls on them. Hades appears, intending to finally kill Perseus. Perseus, calling upon Zeus, throws his sword at Hades. A lightning bolt engulfs the sword and the blast sends Hades back to the Underworld.Perseus rescues Andromeda, who is now the rightful Queen of Argos. Andromeda asks Perseus to stay by her side as King, but he declines. Perseus also refuses another offer of godhood from Zeus, who then proclaims that if Perseus is to live as a human he should not be alone and revives Io.","language":"English","box_office":"$493.2 million[1]","clash_of_the_titans":"Theatrical release poster","cinematography":"Peter Menzies, Jr.","production_company":"Legendary Pictures The Zanuck Company Thunder Road Pictures","directed_by":"Louis Leterrier","Video game":"Namco Bandai Games.inc & Warner Bros. Interactive Entertainment released a video game adaptation of the movie on July 27, 2010 on PlayStation 3 and Xbox 360 with the film's home video release. It was originally planned to come out in March 2010, though the game was delayed due to difficulties. The game follows Perseus on his quest to fight Hades and his minions.","References":"","release_dates":"April 2, 2010 (2010-04-02)|||||","Production":"The Clash of the Titans remake project started in 2002 under producer Adam Schroeder and writers John Glenn and Travis Wright. They wanted to drop the \"cheesy chessboard manipulation of characters\" by the gods. In The Wright/Glenn version of Clash, various pantheons were mixed together. The Main villain was the Sumerian Sea Goddess of Death and Destruction, Tiamat. Perseus was originally kidnapped by an avatar of an unidentified Chthonian Earth Goddess, who planned to have him married to Andromeda so as to develop better relations with humanity. The Earth Goddess and Perseus proceed to fall in love. Zeus prepared to engage in war with Tiamat; taking the aids of other gods (such as Thoth, Marduk, Yahweh and Osiris). A High Priest named Fantasos starts a Cult of Tiamat that quickly conquers the city. Andromeda was originally a promiscuous spoiled Princess who possessed various male sex slaves. Though the mixing of Mythologies and the Perseus-Earth Goddess romance was abandoned, the concept of a Goddess enraged at arrogant humans and demanding a sacrifice and the Cult of the Evil God (Changed from Tiamat to Hades) was retained into the final production.[8] Producer Basil Iwanyk revived the project in 2006 with a rewrite by Travis Beacham, a fan of the original, who intended the script to be \"darker and more realistic\".[9] Lawrence Kasdan and director Stephen Norrington signed on in 2007. Kasdan gave the script another rewrite from the Beacham version.[10] But Norrington was unsure about his direction for the project because he did not grow up with the original. Leterrier, who did, contacted Norrington through their shared agent about replacing him.[11] By June 2008 Leterrier joined the project and Warner Bros. greenlit the film.[12] Leterrier noted the original Clash of the Titans inspired the climax of his previous film The Incredible Hulk – a battle in a burnt-down courtroom with temple-like columns – and has compared modern superheroes to Greek mythology.[13][14]Writers Phil Hay and Matt Manfredi took over the script during July 2008 and used Beacham's draft as a starting point. They focused on the mythology and telling the story through Leterrier's eyes. Hay and Manfredi had to rewrite the script in less than a year using a very active process.[15] Leterrier sought Ray Harryhausen's involvement,[11] and reunited with Hulk concept artist Aaron Sims, who had already been working on Clash of the Titans with Norrington.[16]Louis Leterrier, during an interview, revealed that he is a big fan of Masami Kurumada's Saint Seiya manga (also known as Knights of the Zodiac) and its anime adaptation. He specifically cited the armor that the Gods wear in his film remake as a sign of homage and respect to Saint Seiya. Masami Kurumada, the author of Saint Seiya, was even asked to collaborate with the production team on poster designs.[17]Sam Worthington took the role of Perseus because he wanted to make a Clash of the Titans for his nine-year-old nephew's generation. During filming the cast had a few laughs about the costumes but he took it very seriously \"so the audience doesn't have to.\"[18] Worthington also did not wear sandals while filming, he instead painted toes on his sports shoes so he could perform the stunts better.[19]For the 2D to 3D conversion, Leterrier approached the studio early on about a 3D conversion but it was expensive and very new technology.[20] After Avatar, the studio put pressure on Leterrier to convert the film. He was worried because of his previous concerns but was convinced after seeing the View-D conversion process.[21] Leterrier considered the 3D conversion to improve the viewing experience, and states that it should not be seen as a gimmick.[20]In 2013 Leterrier said of the 3D conversion;It was famously rushed and famously horrible. It was absolutely horrible, the 3D. Nothing was working, it was just a gimmick to steal money from the audience. I’m a good boy and I rolled with the punches and everything, but it’s not my movie.[22]Filming began April 27, 2009, near London, at Shepperton Studios, and also at Pinewood Studios and at Longcross Studios, near Chertsey, in Surrey.[23] Filming also took place in Wales, the Canary Islands (Spain) (primarily at the World Heritage Site, Teide National Park in Tenerife), Maspalomas Dunes, Gran Canaria, and Timanfaya National Park in Lanzarote. Aerial photography was conducted in Iceland and Ethiopia.[2]Filming of volcano scenes at the Harriet hole in Dinorwic Slate Quarry in Wales wrapped at the end of July.[24] This slate quarry has also been used for locations for Willow and Street Fighter.[25]Bubo, Athena's mechanical owl in the original 1981 film, makes a cameo appearance in this remake and its sequel.","produced_by":"Basil Iwanyk Kevin De La Noy Richard D. Zanuck","starring":"Sam Worthington Gemma Arterton Mads Mikkelsen Alexa Davalos Ralph Fiennes Liam Neeson","running_time":"106 minutes","Sequels":"Production of a sequel titled, Wrath of the Titans, directed by Jonathan Liebesman began on March 23, 2011 with Sam Worthington, Ralph Fiennes and Liam Neeson returning to star and released on March 30, 2012.[43]In November 2011, Warner Bros. hired Dan Mazeau and David Leslie Johnson' who wrote Wrath of the Titans, to write and develop a sequel with Johnson announced a title called Revenge of the Titans but it was later cancelled.[44]","music_by":"Ramin Djawadi","edited_by":"Vincent Tabaillon Martin Walsh","Release":"Clash of the Titans was originally set for standard release on March 26, 2010.[3][4] The Heat Vision Blog reported on January 27, 2010 that after a 3D conversion test of the film which Warner Bros. found to be a \"roaring success\", the film would be converted to 3D and would premiere on April 2, 2010. The national premiere in Spain took place on March 30 in Santa Cruz de Tenerife, the capital city of the Canary Islands.[5][6][26]Clash of the Titans has received generally negative reviews from critics, who criticized the film for its use of 3D, flat characters and divergences from the original film and the myth. Review aggregator website Rotten Tomatoes reports that 28% of critics have given the film a positive review, based on 239 reviews with an average rating of 4.3/10. The site's consensus stated \"An obviously affectionate remake of the 1981 original, Louis Leterrier's Clash of the Titans doesn't offer enough visual thrills to offset the deficiencies of its script.\"[27] On Metacritic, the film was assigned a weighted average score of 39 out of 100, based on 37 reviews from mainstream critics.[28] Even before release the film attracted some negative attention for its original tagline, \"Titans Will Clash\".[29]In his review for the Chicago Sun-Times, Roger Ebert gave the film 3 stars out of 4, stating \"I don't say it's good cinema, although I recognize the craftsmanship that went into it. I don't say it's good acting, when the men have so much facial hair they all look like Liam Neeson. I like the energy, the imagination, the silliness\".[30] Richard Corliss of Time could understand why the film received negative reviews, but found it \"a full-throttle action-adventure, played unapologetically straight.\" He dismissed other critics' complaints, writing that the film is \"very watchable in 2-D\", that other critics were biased by nostalgia for the original, and that 15 seconds of Bubo is enough for his tastes.[31] Colin Covert gave the film a mildly positive review, stating the film was \"all flash, trash, and crash; a tasty hunk of baloney; mindless yet shamelessly thrilling.\" He considered Worthington to have a \"Shatneresque heaviness about him\", and found that all the laughs came from the fact that the heavyweight actors were \"slumming through their roles.\"[32] Owen Gleiberman of Entertainment Weekly gave the film a B-, writing \"The new Clash isn't a cynical rehash. It has the flavor of a certain pre-CGI innocence.\"[33] James Berardinelli gave it a mixed review, concluding that Clash of the Titans is a flawed but mildly entertaining regurgitation of Greek mythological elements, but it's also an example of how poorly executed 3D can hamstring a would-be spectacle.[34]Peter Travers of Rolling Stone awarded the film 1 star out of four, stating \"The film is a sham, with good actors going for the paycheck and using beards and heavy makeup to hide their shame.\"[35] In a review for the Chicago Tribune, Turan complained that the film is worse in 3D; he went on further to explain that the action scenes are \"more of a distraction than an enhancement\", with the battle scenes being cluttered and \"harder to follow rather than exciting.\"[36] Claudia Puig for USA Today wrote that the film's \"most outstanding achievement is the ability to be both chaotic and dull.\" Justification for her opinion came from the frantic action sequences and muddled special effects.[37] Dan Kois blamed the director for making a \"muddled disappointment\" instead of a \"camp classic that could have endured for generations.\" Kois also accused Leterrier of not knowing how to direct an action scene, and that the film is lacking in \"wit and flair\".[38] David Stratton also criticized the film's action scenes, suggesting to Leterrier: \"check out your local video store for something by Kurosawa, or almost any movie with sword fight scenes, to see how it's done.\"[39] AskMen.com felt actor Sam Worthington's heavy Australian drawl was so distracting it \"manages not only to single-handedly unhinge any suspension of disbelief we might have had, but his fellow actors often seem to be visibly struggling as they impart fantastical ancient truths to a true-blue brickie in a studded leather dress.\"The film was nominated for \"Worst Prequel, Remake, Rip-off or Sequel\" and \"Worst Eye-Gouging Misuse of 3D\" at the 31st Golden Raspberry Awards, but lost to Sex and the City 2 and The Last Airbender, respectively.Clash of the Titans earned $61,235,105 in its opening weekend in 3,777 theaters in the United States and Canada (not including Thursday previews).[1] The movie was #1 for two weeks in a row, edging out Date Night and the previous winner How to Train Your Dragon.[40] Clash of the Titans made $163,214,888 domestically, as of July 22, 2010, and $330,000,000 overseas, as of September 19, 2010, for a worldwide total of $493,214,888. On the all-time worldwide chart it ranks 80th and in North America it is below #100.[41]Clash of the Titans was released on DVD and Blu-ray combo pack on July 16 (Mexico), July 26 (UK), July 27 (USA) and (Canada), October 6 (Japan) 2010. A Blu-ray 3D version of the film was also released and also comes packed with the 2D version, the DVD version and a Digital Copy.[42]","budget":"$125 million"}