{"country":"United States","distributed_by":"Summit Entertainment Lionsgate","draft_day":"Theatrical release poster","Plot":"On the morning of the 2014 NFL Draft in New York City, Chris Berman, Jon Gruden, Mel Kiper Jr., and other analysts discuss the consensus first overall pick: Wisconsin quarterback Bo Callahan, the reigning Heisman Trophy winner. Cleveland Browns general manager Sonny Weaver Jr., must decide how to use the seventh overall pick to improve his consistently losing team, but has other issues. He recently learned that his secret girlfriend Ali Parker, the team's salary cap analyst, is pregnant. His father, Sonny Weaver Sr., coached the Browns before Weaver Jr. fired him, and died a week before the draft. His mother is upset at him for missing the reading of Weaver Sr.'s will.The Seattle Seahawks hold the first overall pick, which general manager Tom Michaels offers to trade to the Browns. Weaver declines, but before leaving for the draft, team owner Anthony Molina—dissatisfied with current quarterback Brian Drew—orders him to accept. The Browns give their three first-round draft picks over the next three years for the top pick. Many Seahawks fans want Callahan, however, and express their displeasure with picket signs at CenturyLink Field and on social media, demanding Michaels' firing.The unexpected chance to obtain Callahan excites Browns fans. Most in the Browns' front office agree despite the high price; Drew and head coach Vince Penn are the exceptions. Penn agrees that Callahan is excellent but does not want to teach a rookie quarterback his system offense, and prefers running back Ray Jennings of Florida State. Drew, who led the team to a 5–1 start the previous year before injury, fears losing his job. The trade leaks after a tweet by linebacker Vontae Mack of Ohio State, another possible choice for Weaver with the seventh pick. Mack wants to play for the Browns, and fears not being chosen in the first round. He advises Weaver to rewatch the Ohio State vs. Wisconsin game in which Ohio State was defeated, but Mack sacked Callahan four times. Teams contact Weaver for possible transactions based on the trade; one from the Houston Texans implies that Mack may not remain available to the Browns in the second round.After rewatching some plays from Callahan's game against Mack, Weaver becomes concerned about Callahan's ability under pressure. Weaver also doubts Callahan's character when he learns from his security chief about a report that none of Callahan's teammates attended his 21st birthday party, and that Callahan allegedly had lied to the Washington Redskins about reading the whole of that team's playbook. Callahan hadn't noticed the Redskins had taped a $100 bill to the last page of the playbook, and Weaver is told that, by way of contrast, Brian Drew's response to the $100 bill trick had been exemplary.When the draft begins that evening at Radio City Music Hall, the Browns have ten minutes to make the first overall pick. Weaver abruptly chooses Mack; Roger Goodell's announcement of the selection amazes the league and the front office. While a relieved Drew believes that his job is safe, Molina becomes resentful and flies back to Cleveland. Callahan has an anxiety attack, and storms out of the theater until his agent persuades him to return.Weaver's unexpected choice disrupts the draft. Rumors spread about Callahan as other teams avoid him, fearing that the Browns know something they do not, and it appears the Seahawks still will be able to select Callahan with what had been the Browns' seventh pick.The Jacksonville Jaguars hold the sixth pick; the Jaguars' first two choices are no longer available so their draft plans are in disarray, but their rookie general manager is wary about Callahan because of the rumors. Weaver persuades the Jaguars to trade him their sixth pick for the next three years of the Browns' second-round draft picks.Molina arrives and angrily confronts Weaver over choosing Mack, but Weaver and Parker convince Molina to let Weaver do his job. Weaver calls Michaels, who, under increasing pressure from Seahawk fans, now wants Callahan, and Weaver gets all three first-round draft picks back plus the Seahawks' punt returner David Putney. The Seahawks choose Callahan with the sixth pick for $7 million less than if the team had made him the first overall selection, and Weaver selects Jennings for Penn with his restored seventh pick.Weaver and a visibly pregnant Parker attend the opening day of the 2014 season at FirstEnergy Stadium. Weaver laughs as he overhears retired Browns stars Jim Brown and Bernie Kosar congratulate Molina for doing \"a hell of a job\" with the draft.The team -- including Mack, Jennings, and Drew -- runs onto the field on opening day.","language":"English","Reception":"The film grossed $28.8 million domestically with an additional $604,801 overseas for a worldwide total of $29.5 million, against a budget of $25 million.[2]The film grossed $9,783,603 in its opening weekend, finishing in fourth place at the box office behind Captain America: The Winter Soldier, Rio 2, and Oculus (the latter two also being new releases).[9]Draft Day has received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 60%, based on 146 reviews, with an average rating of 6/10. The site's consensus reads, \"It's perfectly pleasant for sports buffs and Costner fans, but overall, Draft Day lives down to its title by relying too heavily on the sort of by-the-numbers storytelling that only a statistician could love\".[10] On the aggregated review site Metacritic, the film has a score of 54 out of 100, based on 33 critics, indicating \"mixed or average reviews\".[11]Chicago Sun-Times critic Richard Roeper gave the film a \"B\", stating the film is \"a sentimental, predictable, sometimes implausible but thoroughly entertaining, old-fashioned piece.\"On the contrary, Jack Hamilton of Slate was harshly critical. \"The 'filmmaking' here consists of making sure the camera is pointed at people who are explaining the film's plot to one another, preferably while they are wearing logos and standing in front of more logos,\" he wrote. He suggested the NFL's involvement had made the film too upbeat. \"[It] isn't so much a movie as a movielike infomercial for the kinder, gentler NFL ... In the wake of labor strife, off-field scandals, and the ongoing CTE (chronic traumatic encephalopathy) crisis, the NFL is doubling down on its fantasy of paternalism, and Draft Day is that fantasy's porn film.\"[12]Former Green Bay Packers vice president Andrew Brandt criticized Draft Day as \"lacking any true depiction of how an NFL team operates leading up to and during the draft\", and less realistic about the business of sports than Jerry Maguire and Moneyball.[13]","box_office":"$29.5 million[3]","cinematography":"Eric Steelberg","production_company":"OddLot Entertainment Montecito Picture Company","directed_by":"Ivan Reitman","release_dates":"April 7, 2014 (2014-04-07) (Los Angeles premiere)|April 11, 2014 (2014-04-11) (United States)||||","Production":"When the idea was first made public, the film was to be centered around the Buffalo Bills, but the studio subsequently changed it to the Cleveland Browns because of cheaper production costs in Ohio.Crowd reactions of fans at the actual 2013 NFL Draft, as well as Cleveland Browns fans at local bars, were filmed. Cameos with real-life NFL figures such as league commissioner Roger Goodell and ESPN sportscaster Chris Berman were filmed before and after the draft took place. The rest of the film began filming on May 8, 2013.As in the film, the Cleveland Browns made splashes at the draft, trading up to select quarterback Johnny Manziel with the 22nd pick. The team also made several deals, trading away their fourth pick to the Buffalo Bills but for their ninth pick, as well as their 2015 first round pick. They later traded up to the eighth pick to draft Justin Gilbert. Finally, after watching Manziel drop farther than projected, they again traded up for the 22nd pick. Chris Berman, who played himself in the fictionalized draft, commented at the 2014 NFL Draft that the events surrounding the Cleveland Browns were more exciting than the film. Unlike the film, the Browns selected the much-hyped Heisman Trophy winning quarterback, as opposed to passing on Bo Callahan, the fictionalized first pick favorite.The first poster and trailer for the film were released on December 23, 2013.[8]","produced_by":"Ivan Reitman Ali Bell Joe Medjuck Gigi Pritzker","starring":"Kevin Costner Jennifer Garner Denis Leary Frank Langella Tom Welling Sam Elliott Ellen Burstyn Chadwick Boseman","running_time":"110 minutes[1]","music_by":"John Debney","edited_by":"Sheldon Kahn Dana E. Glauberman","written_by":"Rajiv Joseph Scott Rothman","budget":"$25 million[2]"}