{"country":"United States","distributed_by":"New Line Cinema1","15_minutes":"Theatrical release poster","Plot":"The film begins with Emil Slovak (Karel Roden) and Oleg Razgul (Oleg Taktarov) arriving in America. They were former criminals and, after getting out of prison, have come to the U.S. to claim their part of a bank heist in Russia (or somewhere in Czech Republic). Within minutes of arriving, Oleg steals a video camera from a Make-Your-Own-Movie establishment. They go to the run-down apartment of their old partner and demand their share. He doesn't have it so Emil stabs him and his wife to death as Oleg tapes it with the camera. The couple's friend, Czech immigrant Daphne Handlova (Vera Farmiga), witnesses the murders from the bathroom; but she escapes before they can kill her, too. To hide the crime, Emil burns down the apartment.Jordy Warsaw (Edward Burns) is an arson investigator and is called to the case. Eddie Flemming (Robert De Niro) is a much celebrated detective who is also called to the scene. Flemming is such a high-profile celebrity detective that he is even followed around by the local tabloid TV show Top Story. Everywhere he goes, the townspeople cheer him on. Flemming and Warsaw decide to help each other out and work the case together. While checking out the crowd outside, Warsaw spots Daphne trying to get his attention. When he finally gets to where she was, she's gone.Emil calls an escort service from a business card he found in the girl's wallet and asks for a \"Czech girl\". When Honey (Noelle Evans), a regular call girl arrives, he kills her but not before getting the address of the escort service. Oleg tapes the murder. In fact, he tapes everything he can, trying to be the next Frank Capra.Flemming and Warsaw investigate her murder and also visit the escort service. Rose Hearn (Charlize Theron) runs the service and tells them that the girl they're looking for doesn't work for her but rather a local hairdresser. She also mentions a couple of other guys who just asked her the same questions. Flemming and Warsaw rush to the hairdresser, but they arrive just after Emil and Oleg warn Daphne to keep quiet. As Flemming puts the girl into his squad car, he notices Oleg taping them from across the street. A foot chase begins, culminating in Flemming's regular partner Leon Jackson (Avery Brooks) being hit with a glass bottle and his wallet stolen. Emil finds a card with Flemming's name and address in it. He is jealous of Flemming's celebrity status and is convinced that anyone in America can do whatever they want and get away with it.On the night that Flemming is to propose to his girlfriend Nicolette Karas (Melina Kanakaredes), Oleg and Emil sneak into his house and tape him to a chair. While Oleg is recording, Emil explains his plan to Flemming: He will kill him and sell the tape to Top Story. After being committed to an insane asylum, he will declare that he is actually sane. Since he can't be tried again, he will get off, collecting the royalties from his books and movies. Flemming starts attacking them with his chair (while still taped to it) and almost gets them, but Emil gets the upper-hand and stabs him in the chest, mortally wounding him. Emil then suffocates him with the pillow and kills him. The entire city is in mourning, and Emil calls Robert Hawkins (Kelsey Grammer), the host of Top Story, to tell him he has a tape of the killing and is willing to sell it. Robert pays him $1 million for the tape. Warsaw and the entire police force are furious at Robert, as they can't believe that he would air it, especially since his main reporter is Nicolette.On the night it is aired, Emil and Oleg sit in a Planet Hollywood to watch it with the rest of the public. Halfway through the airing, the other spectators realize that Emil and Oleg are right there with them and panic. The police come and arrest Emil, while Oleg escapes. They put Emil in Warsaw's squad car but instead of taking him to the police station, Warsaw takes him to an abandoned warehouse where he is going to kill him. The police arrive just in time and take Emil away. Everything goes as planned as Emil is now a celebrity and is pleading insanity. His lawyer agrees to work for 30% of the royalties Emil will receive for his story. Meanwhile, Oleg is jealous of the notoriety that Emil is receiving.While being led away with his lawyer and all the media, Warsaw gets into an argument with the lawyer, with the Top Story crew taping the whole thing. Oleg gives Robert the tape of Emil explaining his plan to Flemming, proving he was sane the whole time. Robert shouts out to Emil and explains to him the evidence he now has. Emil pushes a policeman down, takes his gun and shoots Oleg. Emil grabs Nicolette, who is covering the story, and threatens to shoot her. He is finally cornered by the police and Warsaw. Against orders, Warsaw shoots Emil a dozen times in the chest. An officer shouts that Oleg is still alive. Robert rushes to him to get footage, just as Oleg says the final few words to the movie he's taping just before he dies. Warsaw punches out Robert and leaves the scene as the police all smile with approval.","language":"English","Reception":"The film grossed $24,403,552 domestically in the United States and Canada. It made a further $31,956,428 internationally, for a worldwide total of $56,359,980 against a production budget of $42 million.[3]Review aggregator website Rotten Tomatoes gave the film an approval rating of 33% based on reviews from 123 critics, with an average rating of 4.4/10. The site's consensus reads, \"As critical as it is about sensationalism in the media, 15 Minutes itself indulges in lurid violence, and its satire is too heavy-handed to be effective.\"[4] It currently holds a 34 out of 100 rating on Metacritic, based on 32 critical reviews, indicating \"generally unfavorable reviews\".[5]","box_office":"$56.3 million[3]","cinematography":"Jean-Yves Escoffier","production_company":"TriBeCa Productions New Redemption Pictures","directed_by":"John Herzfeld","release_dates":"March 9, 2001 (2001-03-09)|||||","Production":"The film was shot on location in New York City and Los Angeles from May to July 1999. It was originally slated to be released by New Line Cinema in the spring of 2000, with theatrical trailers appearing in late 1999. For reasons unknown, the film was pulled from the spring 2000 schedule and then delayed until the following year, on March 9, 2001.","produced_by":"Keith Addis|David Blocker|John Herzfeld|Nick Wechsler|","starring":"Robert De Niro|Edward Burns|Kelsey Grammer|Avery Brooks|Melina Kanakaredes|","running_time":"120 minutes","music_by":"Anthony Marinelli|J. Peter Robinson[1]|","edited_by":"Steven Cohen","written_by":"John Herzfeld","budget":"$42 million[2]"}