{"country":"India","distributed_by":"Dream Factory","Plot":"Kathir,Nisha and Kumaran plan to commit suicide together because they feel like failures. However, they want to fulfill their last wishes before doing so. Nisha wants to steal a new car, and Kathir wants to slap the local MLA in his own house.After Nisha and Kathir fulfill their last wishes, the trio escapes from the police and flees to a nearby resort. There, they find Athisaya Raj, who also wishes to commit suicide, and he joins them as they travel to a farmhouse. Once they arrive, Kumaran and Nisha plan to postpone their suicides for three days in order to prevent Kathir's suicide, as Nisha has fallen in love with him.Their plan succeeds, and in those three days, the four get close to each other. Kathir develops feelings for Nisha, but hesitates to tell her in fear of humiliation. At the end of the third day, Kumaran asks Nisha to kiss Kathir to divert him from suicide. He meanwhile requests that Kathir kisses Nisha, telling him that Nisha wants to experience her first kiss before dying. Kathir accepts, with shame and shyness.As Kathir tries to kiss Nisha, a ghost enters her body, forcing Kathir away. Flabbergasted, Kathir runs out of the room. Whenever Nisha reveals her feelings to Kathir and he responds by hugging or touching her, the ghost enters her body and scares Kathir away. Unaware of the ghost, Nisha grows depressed.When Kumaran hears Kathir describing Nisha as a ghost, he rushes to Nisha's room to scold her and tell her to apologize to Kathir, only for the ghost to enter her body and thrash him. That night, Raj too experiences the ghost's fury at its villainous worst. The trio decides to distance themselves from Nisha and to always stay together.The next morning, they try to get the ghost to leave Nisha's body, and call upon Ghost Gopal Varma, an exorcist. However, the ghost thrashes him as well. Afterwards, Kathir brings up the courage to ask the ghost why she is taking vengeance on them, and the ghost narrates her story to the trio. She is Shruthi, and she came to the same farmhouse with her newlywed husband, Shiva. Five men entered the farmhouse and raped her before killing the two of them.Kathir is emotionally touched, but before he could help the ghost, Nisha, deducing the presence of the ghost from the avoidance of the other three, slit her wrist to make Kathir get rid of Shruthi. Kathir, seeing this, brought her out of the house to get her to the hospital, but he is interrupted by the five men who raped Shruthi. Kathir put up a fight, but in vain. Shruthi, unable to use her powers due to the slit wrist, calls for her husband, who possesses Kathir and fights the five men.The film ends with Kathir and Nisha hugging in front of a refrigerator. The refrigerator shows Shruti and Shiva in the reflection, showing that their ghosts are still inside Kathir and Nisha.","language":"Tamil","box_office":"₹32 crore (US$4.8 million)[1]","cinematography":"Krishnan Vasant","production_company":"Geetha Arts Studio Green","directed_by":"Sam Anton","Soundtrack":"Soundtrack was also composed by the lead actor G.V. Prakash Kumar while lyrics were written by Na. Muthukumar and Arun Kamaraj. The album was released at Suryan FM Studios on 26 November 2014.[5] Behindwoods rated the album 2.7 out of 5 and called it \"Melancholic GV\".[6] Ibtimes reviewed the album as one of the finest of his career and opined that the album consists of different genres of music sung by versatile singers.[7] Indiaglitz rated 2.5 out of 5 and called it \"middling album with two gorgeous melodies\".[8]","release_dates":"15 January 2015 (2015-01-15)|||||","Production":"The film marks the return of Telugu film producer Allu Aravind to the Tamil film industry after 25 years,[2] and he collaborates with K. E. Gnanavel Raja of Studio Green, who works outside the production house for the first time. The film was distributed by Dream Factory.[3] The team features a predominantly new technical crew with director Sam Anton making his debut, by choosing to remake the Telugu horror film Prema Katha Chitram (2013). G. V. Prakash Kumar was signed on to play the lead role and compose the music, and the film was completed and will release earlier than his two other ongoing projects which had started earlier, Pencil and Trisha Illana Nayantara. Nikki Galrani and Srushti were also signed on to play pivotal roles, with the shoot of the film being completed in just over a month's time.[4]","produced_by":"Allu Aravind K. E. Gnanavel Raja","starring":"G. V. Prakash Kumar Nikki Galrani Karunas Bala Saravanan","running_time":"126 minutes","Sequel":"A sequel named Darling 2 with an entirely different cast is at progress.[16]","music_by":"G. V. Prakash Kumar","edited_by":"Ruben","Release":"The satellite rights of the film were sold to Sun TV. The film released on 15 January 2015 coinciding with Pongal in over 400 screens worldwide alongside S. Shankar's I andSundar C.'s Aambala.[9]The response from the audience made the theatre owners to increase the number of screens from amidst the heavy competition from Shankar's I and Sundar.C's Aambala.The Times of India gave the film 3 stars out of 5 and wrote, \"Darling is actually a remake of the Telugu film, Prema Katha Chitram, but debutant director Sam Anton ensures that it works very well in this setting as well\".[10] Sify called Darling \"an entertaining comic-horror flick with some good writing and performances\".[11] IANS wrote, that it was \"better than its original for the simple reason that it manages to entertain with a new set of actors\", going on to add, \"Despite its flaws, Darling turns out to be a crowd-pleasing tale of horror. While there aren't many thrills to send chills down your spine, the comedy gives you company throughout\".[12] Behindwoods gave 2.75 out of 5 and wrote, \"Darling is an entertainer and can make an enjoyable Pongal outing for people who enjoy scary teasers\".[13] The Hindu wrote, \"The problem with Darling is that despite the jokes coming thick and fast, the story seems tedious...while the scenes, for the major part, are admittedly funny, you can’t wait to move on. On some level, you also know that a back story of the ghost is waiting. And even as you break into occasional laughter, you are twiddling your thumbs in impatience, waiting for it\".[14] The two awesome melodies reached audista tamiltop10 from the day of release of soundtracks[15]","written_by":"Maruthi Dasari Sam Anton","budget":"₹10 crore (US$1.5 million)[1]"}