{"country":"Norway","distributed_by":"Euforia Film","Plot":"A woman, Sara, is being chased through the snows of Norway. She is ultimately cornered and eaten by zombies in World War II Nazi SS uniforms.Seven students on Easter vacation arrive at a small cabin near Øksfjord. The cabin is owned by Sara, Vegard's girlfriend. The group begins to drink and party until a mysterious hiker arrives. He tells them the dark history of the region; during World War II, a force of Einsatzgruppe, led by Standartenführer Herzog, occupied the area. For three years, the Nazis abused and tortured the local people. Near the end of the war, with Germany's defeat looming, the soldiers looted all the town's valuables. However, the citizens staged an uprising and ambushed them, killing many. The survivors, including Herzog and Michael Schwab, were chased into the mountains, and it was assumed that they all froze to death. The hiker then continues on his way. That night, Vegard wakes to a figure placing something beneath the floorboards of the cabin. He calls out, believing it to be Sara, but she ignores him and leaves. Vegard follows, and finds her outside covered in blood. Vegard suddenly jolts awake in his bed, revealing it was a dream. Meanwhile, the hiker has set up camp in the mountains and is eating dinner when he is disturbed by a noise outside. He investigates, and is attacked and killed by a zombie.The next morning, Vegard, out looking for Sara, discovers the hiker's body. He searches the area, falls through the snow into a cave, and is knocked unconscious. After sunset, Erlend finds an old wooden box filled with valuables and golden trinkets. They celebrate, and one of them pockets a gold coin. They eventually return the rest of the treasure to the box. Erlend goes to the outhouse where he and Chris have sex. Afterwards, Erlend return to the cabin, and drops a gold coin. Chris is attacked by a zombie, and killed. The others leave the cabin to look for her, and find Sara's rucksack buried in the snow.Upon returning to the cabin, they are attacked. Erlend is killed in an attempt to defend the cabin, and the others secure the building. Vegard comes around in the cave, discovering German firearms and helmets, as well as Sara's severed head. He is attacked, but escapes to the surface, where he is confronted by a zombie. Vegard stabs the zombie in the eye, but is knocked from the cliff side by a second assailant. Vegard is bitten in the neck by the zombie, whilst the two hang from the cliff using an intestine as rope. He climbs back to the snowmobile, stitches his wounds, and mounts a machine gun to his snowmobile.Meanwhile, the remaining four students decide to split up. The two men, Martin and Roy, attempt to distract the zombies, while the two women, Hanna and Liv, run for the cars and go for help. En route to the cars, the girls are ambushed. Liv is knocked out by the zombies and awakens to them pulling out her intestines. Using a hand grenade, she commits suicide and kills her assailants. Hanna leads a zombie to a cliff edge, breaks the ice, and they fall. The pair survive, and Hanna kills the zombie.Martin and Roy accidentally set fire to the cabin with Molotov cocktails. They escape, and arm themselves with power tools. More zombies attack, but they are aided by Vegard. During the attack Vegard is killed and Martin accidentally kills Hanna, who has returned to the cabin. Herzog arrives, leading a group of zombies. They attack, and Martin is bitten on the arm. To avoid becoming infected, he cuts off his arm with a chainsaw. After killing the remaining undead, Martin and Roy attack Herzog, who calls upon hundreds of zombies, that rise from under the snow. Whilst running from their attackers, Roy is hit in the head by a hammer, disemboweled by a tree branch, and killed by Herzog, who retrieves a watch from his pocket.Martin realises the zombies' intent, and retrieves the box from the ruined cabin. He returns the box to Herzog, and escapes to the car. There, he finds a gold coin in his pocket, just as Herzog smashes the window of the car.","language":"Norwegian","Reception":"Dead Snow received mixed reviews from Norwegian critics, and was rated 3/6 by both Verdens Gang[11] and Dagbladet.[12] According to Manohla Dargis of The New York Times, director Tommy Wirkola, \"who wrote the irrelevant screenplay with Stig Frode Henriksen, doesn’t just hit every horror beat; he pounds it to an indistinguishable pulp.\"[13] She highlighted the special effects team for acclaim for their \"admirably disgusting\" work.[13] Stephen Witty of The Star-Ledger also commented positively on the film's visuals, and lauded Wirkola for his \"steady hand with the action scenes\",[14] but identified the plot as the film's weakness. He accused the characters of lacking motivation, and for being \"pretty much indistinguishable from one another.\" He also had a problem with the ending.[14]On Rotten Tomatoes, the film holds a 67% positive review; the consensus states: \"Though it doesn't cover new ground, Dead Snow is an entertaining mix of camp, scares, and blood and guts.\"[15] Based on 16 critics, Metacritic gives the film a 61/100 rating, indicating \"generally positive reviews\".[16]The film was nominated for four 2009 Scream Awards: Fight-to-the-Death Scene, Most Memorable Mutilation, Best Foreign Movie and Best Horror Movie.","box_office":"$1,984,662","cinematography":"Matthew Bradley Weston","production_company":"Miho Film Yellow Bastard Production News on Request Zwart Arbeid Barentsfilm AS FilmCamp Storm Studios","directed_by":"Tommy Wirkola","release_dates":"9 January 2009 (2009-01-09)|||||","Production":"In creating the film's Nazi zombies, writer and director Tommy Wirkola concluded that the best way to enhance the horror and disgust of standard zombies was to give them the Nazi element; he also used the historical backdrop of the Nazi occupation of Norway in developing the film's plot. In an interview, Wirkola said, \"When we were about to sit down and write the actual script, we started thinking ‘What is more evil than a zombie’? A Nazi-zombie! We have a really strong war-history up in the north of Norway from World War Two, so it was fun to combine actual events with our own story. And you know Nazis have always been the ultimate villains in movies. Combine that with zombies and you really get something that no one would sympathise with.\"[1] Wirkola, who also appeared in a cameo as one of the zombie soldiers, said of his monsters, \"I like to think of them as Nazi zombies. Nazis first, then zombies.\"[2]Even though a curse is alluded to in the beginning of the film, through the Nazi occupation and the subsequent burial grounds in the Norwegian mountains, it is not shown how the Nazis became zombies. However, Wirkola used the curse angle in the creation of the film's zombies. \"We went for the old-fashioned ones where they're cursed. For me there are two types of zombie films: the curse and the plague or virus. So we wanted ours to be like a ghost story mixed with Indiana Jones.\"[3]The special effects make-up team responsible were Per Steinar Hoftun and Shino Kotani, both of Freax FX, and Steinar Kaarstein, of Effektmakeren.[4] The development crew also included Janne Røhmen (key make-up artist), Elisabeth Haugan, Gudmund Saksvik, Lene Bruksås, and Ragnhild Prestholt.[4] Despite being set in Øksfjord, the film was shot in Alta and Målselv.","produced_by":"Tomas Evjen Harald Zwart","starring":"Vegar Hoel Stig Frode Henriksen Charlotte Frogner Lasse Valdal Evy Kasseth Røsten Jeppe Laursen Jenny Skavlan Ane Dahl Torp Bjørn Sundquist Ørjan Gamst","running_time":"91 minutes","Sequel":"In 2012, following the release of his first big-studio film, Hansel and Gretel: Witch Hunters, Wirkola announced the sequel to Dead Snow, entitled Dead Snow: Red vs. Dead.[17] It had its Norwegian première in February 2014.","dead_snow":"US DVD cover","music_by":"Christian Wibe","edited_by":"Martin Stoltz","Release":"The film was distributed by Euforia Film[5] and released on 9 January 2009 in Norway.[6] The U.S. premiere was held at the Sundance Film Festival,[7] after which IFC Films purchased the U.S. distribution rights.[8] The film received a limited release in the U.S. starting 19 June 2009,[9] before its DVD release on 23 February 2010.[10] The film currently holds a 66% \"fresh\" rating on Rotten Tomatoes.","written_by":"Tommy Wirkola Stig Frode Henriksen","budget":"$800,000"}