{"based_on":"\"Don't Look Now\"  by Daphne du Maurier","country":"United Kingdom Italy[1]","distributed_by":"British Lion Films","screenplay_by":"Allan Scott Chris Bryant","Plot":"Some time after the drowning of their young daughter, Christine (Sharon Williams), in a tragic accident at their English country home, John Baxter (Donald Sutherland) and his grief-stricken wife, Laura (Julie Christie), take a trip to Venice after John accepts a commission from a bishop (Massimo Serato) to restore an ancient church. Laura encounters two elderly sisters, Heather (Hilary Mason) and Wendy (Clelia Matania), at a restaurant where she and John are dining; Heather claims to be psychic and—despite being blind—informs Laura she is able to \"see\" the Baxters' deceased daughter. Shaken, Laura returns to her table, where she faints.Laura is taken to the hospital, where she later tells John what Heather told her. John is sceptical but pleasantly surprised by the positive change in Laura's demeanour. Later in the evening after returning from the hospital, John and Laura engage in passionate sexual intercourse. Afterwards, they go out to dinner where they get lost and briefly become separated. John catches a glimpse of what appears to be a small child (Adelina Poerio) wearing a red coat similar to the one Christine was wearing when she died.The next day, Laura meets with Heather and Wendy, who hold a séance to try to contact Christine. When she returns to the hotel Laura informs John that Christine has said he is in danger and must leave Venice. John loses his temper with Laura, but that night they receive a telephone call informing them that their son (Nicholas Salter) has been injured in an accident at his boarding school. Laura departs for England, while John stays on to complete the restoration. Under the assumption that Laura is in England, John is shocked when later that day he spots her on a vaporetto that is part of a funeral cortege, accompanied by the two sisters. Concerned about his wife's mental state and with reports of a serial killer at large in Venice, he reports Laura's disappearance to the police. The inspector (Renato Scarpa) investigating the killings is suspicious of John and has him followed.After conducting a futile search for Laura and the sisters—in which he again sees the childlike figure in the red coat—John contacts his son's school to enquire about his condition, only to discover Laura is already there. After speaking to her to confirm she really is in England, a bewildered John returns to the police station to inform the police he has found his wife. In the meantime the police have brought Heather in for questioning, so an apologetic John offers to escort her back to the hotel.Shortly after returning, Heather slips into a trance so John makes his excuses and quickly leaves. Upon coming out of it she beseeches her sister to go after John, sensing that something terrible is about to happen, but Wendy is unable to catch up with him. Meanwhile, John catches another glimpse of the mysterious figure in red and this time pursues it. He corners the elusive figure in a deserted palazzo and approaches it, believing it to be a child. Instead, it is revealed to be a hideous female dwarf, and while John is frozen in terror the dwarf pulls out a meat cleaver and cuts his throat. As the life drains from him, John realises too late that the strange sightings he has been experiencing were premonitions of his own murder and funeral.","language":"English Italian","Reception":"At the time of its initial release, Don't Look Now was generally well received by critics,[36] although some criticised it for being \"arty and mechanical\".[35] Jay Cocks for Time, wrote that \"Don't Look Now is such a rich, complex and subtle experience that it demands more than one viewing\",[49] while Variety commented that the film's visual flourishes made it \"much more than merely a well-made psycho-horror thriller\".[50] Pauline Kael writing for The New Yorker was more reserved in her praise, considering the film to be \"the fanciest, most carefully assembled enigma yet put on the screen\" but that there was a \"distasteful clamminess about the picture\",[24] while Gordon Gow of Films and Filming felt that it fell short of the aspirations of Nicolas Roeg's previous two films, Performance and Walkabout, but it was nevertheless a thriller of some depth.[3] Vincent Canby, reviewer for The New York Times, on the other hand, criticised the film for a lack of suspense which he put down to a twist that comes halfway through rather than at the end, and at which point it \"stops being suspenseful and becomes an elegant travelogue that treats us to second-sightseeing in Venice\". Canby also suggested that second sight was not convincing on screen, since it appeared simply like flash-forward which is a standard story-telling device in films, and concluded that \"Not only do you probably have better things to do, but so, I'm sure, do most of the people connected with the film.\"[51]British critics were especially enthusiastic about Nicolas Roeg's direction. In the view of Tom Milne of Monthly Film Bulletin, Roeg's combined work on Performance, Walkabout and Don't Look Now put him \"right up at the top as film-maker\".[3] George Melly similarly wrote in The Observer that Roeg had joined \"that handful of names whose appearance at the end of the credit titles automatically creates a sense of anticipation\".[2] Penelope Houston for Sight & Sound also found much to appreciate in Roeg's direction: \"Roeg deploys subtle powers of direction and Hitchcockian misdirection.\"[3] American critics were similarly impressed with Roeg's work on the film. Jay Cocks regarded Don't Look Now to be Roeg's best work by far and that Roeg was one of \"those rare talents that can effect a new way of seeing\". Cocks also felt that the film was a marked improvement on the novella, noting that a reading \"makes one appreciate Roeg and Screenwriters [Allan] Scott and [Chris] Bryant all the more. Film and story share certain basic elements of plot and an ending of cruel surprise. The story is detached, almost cursory. Roeg and his collaborators have constructed an intricate, intense speculation about levels of perception and reality.\"[49] Roger Ebert in his review for the Chicago Sun-Times commented that Roeg is \"a genius at filling his frame with threatening forms and compositions\",[41] while Pauline Kael labelled him \"chillingly chic\" in hers.[24] Even Vincent Canby, whose opinion of the film was negative overall, praised Roeg for being able to \"maintain a sense of menace long after the screenplay has any right to expect it\".[51]Julie Christie and Donald Sutherland also received praise for their performances. Variety considered Sutherland to be at his most subdued but also at his most effective, while Christie does her \"best work in ages\".[50] Cocks felt that thanks to their superb performances the film had a \"rigorous psychological truth and an emotional timbre\" that most other films in the supernatural genre lacked.[49] Canby considered the \"sincerity of the actors\" to be one of the better aspects of the film,[51] while Kael found Christie especially suited to the part, observing she has the \"anxious face of a modern tragic muse\".[52]Roeg's use of Venice was praised too, with Roger Ebert finding that he \"uses Venice as well as she's ever been used in a movie\",[41] and Canby also noted Venice is used to great effect: \"He gets a great performance from Venice, which is all wintery grays, blues and blacks, the color of the pigeons that are always underfoot.\"[51] Variety also found much to admire about the editing, writing that it is \"careful and painstaking (the classically brilliant and erotic love-making scene is merely one of several examples) and plays a vital role in setting the film's mood\".[50]Daphne du Maurier was pleased with the adaptation of her story, and wrote to Nicolas Roeg to congratulate him for capturing the essence of John and Laura's relationship.[20] The film was not received well by Venetians, particularly the councillors who were afraid it would scare away tourists.[32]At the 27th British Academy Film Awards, Anthony B. Richmond won for Best Cinematography, and Don't Look Now received further nominations in the Best Film, Direction, Actor, Actress, Sound Track and Film Editing categories.[53] It was also nominated in the Best Motion Picture category at the 1974 Edgar Allan Poe Awards.[54]The reputation of Don't Look Now has grown since its release and it is now regarded as a key work in horror cinema.[10] It has led to some critics re-evaluating their original opinions of it: Roger Ebert, nearly thirty years after his original review, states that he has come to an \"accommodation\" with his reservations about what he terms the \"admitted weakness of the denouement\". Having gone through the film shot by shot, he now considers it a \"masterpiece of physical filmmaking, in the way the photography evokes mood and the editing underlines it with uncertainty\".[55] It was ranked 127th by Sight & Sound in the 2012 edition of their prestigious decennial critics poll.[56]Don't Look Now is also very well regarded by other industry professionals, placing in the top 100 on Sight & Sound's directors poll, run in tandem with their critics poll.[56] A survey of 1000 people who work across the film and television industry, undertaken by the British Film Institute in 1999, saw the film ranked eighth on their list of top 100 British films of the 20th century.[57] It also topped a similar list organised by Time Out London in 2011, in which 150 film industry professionals were polled.[58] In 2012 Time Out also undertook a poll of the horror industry, in which more than 100 professionals who work within or have connections to the genre selected their favourite horror films, which saw Don't Look Now finish in twelfth position.[59]I just thought that it was a beautifully shot, really adult look at real-life horror stories, and there was a great degree of sexuality in it that, as a young kid, when I saw it, I remember I was very startled by. It felt very brave to me, and I think it still holds up. Nick Roeg is a brilliant director.Don't Look Now has been much admired by and an influence on subsequent filmmakers. Danny Boyle cites Nicolas Roeg as a key influence on his work and counts it amongst his favourite films.[61][62] Mark Gatiss, Steve Pemberton, Reece Shearsmith, and Jeremy Dyson drew upon Don't Look Now considerably for their television series The League of Gentlemen; Pemberton ranks it among the top three British horror films of the 1960s and 1970s, and says that he wants things he has written to make audiences feel the way he felt when he watched the The Wicker Man and Don't Look Now.[63][64][65] Similarly, Ryan Murphy considers his TV series American Horror Story to be a throwback to '60s and '70s psychological horror, citing Don't Look Now, Rosemary's Baby and The Shining as particular examples.[66] Thematic and narrative similarities with Lars von Trier's Antichrist have also been observed,[67] with Antichrist's cinematographer, Anthony Dod Mantle, commenting that he has watched Don't Look Now more times than any other film.[68] Fabrice Du Welz, whose film Vinyan has often been compared to Don't Look Now, has stated that it is a film he is \"obsessed with\", and one of his favourites,[69] while Lynne Ramsay cited it as an influence on We Need to Talk about Kevin, which incidentally is also produced by Roeg's son, Luc.[70] Ami Canaan Mann has also acknowledged she was influenced by atmospheric thrillers such as Picnic at Hanging Rock and Don't Look Now while directing her debut feature, Texas Killing Fields.[71]Its imagery has been directly referenced in several works. The 2006 James Bond film, Casino Royale contains a small homage where James Bond pursues a female character through Venice, catching glimpses of her through the crowds wearing a red dress.[72] The Bruges set thriller, In Bruges, starring Colin Farrell, includes a number of explicit references;[73] director Martin McDonagh said that the \"Venice of Don't Look Now\" was the template for the depiction of Bruges in his film,[74] and the film includes numerous thematic similarities, including one character stating that the film she is working on is a \"pastiche of Don't Look Now\". Flatliners, a 1990 supernatural thriller directed by Joel Schumacher, also draws explicitly on the red-coated childlike figure by having a character terrorised by a child wearing a red coat;[75] coincidentally, the character who is being tormented is played by Kiefer Sutherland, Donald Sutherland's son. In the 2007 stage play of Don't Look Now, written by Nell Leyshon and directed by Lucy Bailey, the play made a conscious effort to bypass the film and be a faithful adaptation of du Maurier's short story, but it did however retain the iconic red mac from the film as worn by the elusive childlike figure.[76][77]Its influence is less obvious but still apparent in Out of Sight, a 1998 film directed by Steven Soderbergh. The famous intercutting technique used in the sex scene was used to similar effect in a sex scene featuring George Clooney and Jennifer Lopez.[9][78] The film's imagery and stylistic techniques have served as an inspiration to films such as Schindler's List directed by Steven Spielberg,[79] Memento by Christopher Nolan,[80][81][82] The Dark by John Fawcett,[83] Frozen by Juliet McKoen,[84] Submarine by Richard Ayoade,[85] and Snow White and the Huntsman by Rupert Sanders.[86] David Cronenberg regards it as the most frightening film he has seen,[87] and its influence has been detected on Cronenberg's The Brood.[88]Nicolas Roeg has never been slow to draw upon the world of pop music for his work, casting Mick Jagger in Performance, David Bowie in The Man Who Fell to Earth and Art Garfunkel in Bad Timing, and in turn his films have served as inspiration for musicians. Big Audio Dynamite wrote a tribute song to Roeg, called \"E=MC2\", which included lyrical references to Don't Look Now—among Roeg's other films—along with clips from it in the video, directed by Luc Roeg,[89] while Sophie Ellis-Bextor performed a \"pop synth homage\" to Don't Look Now with her song, \"Catch You\".[90]","cinematography":"Anthony B. Richmond","production_company":"Casey Productions Eldorado Films","directed_by":"Nicolas Roeg","Analysis":"Don't Look Now ostensibly is an occult thriller,[2] but the genre conventions of the Gothic ghost story primarily serve to explore the minds of a grief-stricken couple.[3] The film's director, Nicolas Roeg, was intrigued by the idea of making \"grief into the sole thrust of the film\", noting that \"Grief can separate people ... Even the closest, healthiest relationship can come undone through grief.\"[4] The presence of Christine, the Baxters' deceased daughter, weighs heavily on the mood of the film, as she and the nature of her death are constantly recalled through the film's imagery: there are regular flashbacks to Christine playing in her red coat as well as the sightings of the mysterious childlike figure also wearing a red coat which bears a likeness to her; the constant association of water with death is maintained via a serial-killer sub-plot, which sees victims periodically dragged from the canals; there is also a poignant moment when John fishes a child's doll out of a canal just as he did with his daughter's body at the beginning of the film.[5]The associative use of recurring motifs combined with unorthodox editing techniques foreshadows key events in the film.[6] In Daphne du Maurier's novella it is Laura that wears a red coat, but in the film the colour is used to establish an association between Christine and the elusive figure that John keeps catching glimpses of.[7][8][9] Du Maurier's story actually opens in Venice following Christine's death from meningitis, but the decision was taken to change the cause of death to drowning and to include a prologue to exploit the water motif.[10] The threat of death from falling is also ever present throughout the film: besides Christine falling into the lake, Laura is taken to hospital after her fall in the restaurant, their son Johnny is injured in a fall at boarding school, the bishop overseeing the church restoration informs John that his father was killed in a fall, and John himself is nearly killed in a fall during the renovations.[11] Glass is frequently used as an omen that something bad is about to occur: just before Christine drowns, John knocks a glass of water over, and Johnny breaks a pane of glass; as Laura faints in the restaurant she knocks glassware off the table, and when John almost falls to his death in the church, a plank of wood shatters a pane of glass; finally, shortly before confronting the mysterious red clad figure, John asks the sisters for a glass of water, a piece of symbolism that prefigured Christine's death.[6]The plot of the film is preoccupied with misinterpretation and mistaken identity: when John sees Laura on the barge with the sisters, he fails to realise it is a premonition and believes Laura is in Venice with them.[12] John himself is mistaken for a Peeping Tom when he follows Laura to the séance,[13] and ultimately he mistakes the mysterious red-coated figure for a child. The concept of Doppelgänger and duplicates feature prominently in the film: reproductions are a constantly recurring motif ranging from reflections in the water, to photographs, to police sketches and the photographic slides of the church John is restoring. Laura comments in a letter to their son that she can't tell the difference between the restored church windows and the \"real thing\", and later in the film John attempts to make a seamless match between recently manufactured tiles and the old ones in repairing an ancient mosaic.[6] Roeg describes the basic premise of the story as principally being that in life \"nothing is what it seems\",[4] and even decided to have Donald Sutherland's character utter the line—a scene which required fifteen takes.[14]Communication is a theme that runs through much of Nicolas Roeg's work, and figures heavily in Don't Look Now.[15] This is best exemplified by the blind psychic woman, Heather, who communicates with the dead, but it is presented in other ways: the language barriers are purposefully enhanced by the decision to not include subtitles translating the Italian dialogue into English, so the viewer experiences the same confusion as John.[16] Women are presented as better at communicating than men: besides the clairvoyant being female, it is Laura who stays in regular contact with their son, Johnny;[17] when the Baxters receive a phone call informing them of Johnny's accident at the boarding school, the headmaster's inarticulateness in explaining the situation causes his wife to intercept and explain instead.[11]Much has been made of the fragmented editing of Don't Look Now, and Nicolas Roeg's work in general. Time is presented as 'fluid', where the past, present and future can all exist in the same timeframe.[10] John's premonitions merge with the present, such as at the start of the film where the mysterious red-coated figure is seemingly depicted in one of his photographic slides, and when he 'sees' Laura on the funeral barge with the sisters and mistakenly believes he is seeing the present, but in fact it is a vision of the future.[12] The most famous use of this fragmented approach to time is during the love scene, in which the scenes of John and Laura having sex are intercut with scenes of them dressing afterwards to go out to dinner.[3][7] After John is attacked by his assailant in the climactic moments, the preceding events depicted during the course of the film are recalled through flashback, which may be perceived as his life flashing before his eyes.[18] At a narrative level the plot of Don't Look Now can be regarded as a self-fulfilling prophecy: it is John's premonitions of his death that set in motion the events leading up to his death.[12] According to the editor of the film, Graeme Clifford, Nicolas Roeg regarded the film as his \"exercise in film grammar\".[19]Don't Look Now is particularly indebted to Alfred Hitchcock, exhibiting several characteristics of the director's work.[9] The aural match cut following Christine's death from Laura's scream to the screech of a drill references a cut in The 39 Steps, when a woman's scream cuts to the whistle of a steam train.[20] When John reports Laura's disappearance to the Italian police he inadvertently becomes a suspect in the murder case they are investigating—an innocent man being wrongly accused and pursued by the authorities is a common Hitchcock trait.[21] The film also takes a Hitchcockian approach to its mise en scène, by manifesting its protagonist's psychology in plot developments: in taking their trip to Venice the Baxters have run away from personal tragedy, and are often physically depicted as running to and from things during their stay in Venice; the labyrinthine geography of Venice causes John to lose his bearings, and he often becomes separated from Laura and is repeatedly shown to be looking for her—both physical realisations of what is going on in his head.[16]Nicolas Roeg had employed the fractured editing style of Don't Look Now on his previous films, Performance and Walkabout, but it was originated by editor Antony Gibbs on Petulia. Roeg served as the cinematographer on Petulia, which incidentally also starred Julie Christie, and Gibbs went on to edit Performance and Walkabout for Roeg.[22] Roeg's use of colour—especially red—can be traced back to earlier work: both Performance and Walkabout feature scenes where the whole screen turns red, similar in nature to the scene during Christine's drowning when the spilt water on the church slide causes a reaction that makes it—along with the whole screen—turn completely red.[23] The mysterious red-coated figure and its association with death has a direct parallel with an earlier film Roeg worked on as cinematographer, The Masque of the Red Death, which depicted a red clad Grim Reaper character.[22] The fleeting glimpses of the mysterious red-coated figure possibly draw on Proust: in Remembrance of Things Past, while in Venice, the narrator catches sight of a red gown in the distance which brings pack painful memories of his lost love.[7]Besides Proust, other possible literary influences include Borges and Nietzsche; Pauline Kael in her review comments that \"Roeg comes closer to getting Borges on the screen than those who have tried it directly\",[24] while Mark Sanderson in his BFI Modern Classics essay on the film, finds parallels with Nietzsche's Beyond Good and Evil.[12]","release_dates":"16 October 1973 (1973-10-16)","Production":"Don't Look Now was produced by Peter Katz through London based Casey Productions and Rome based Eldorado Films.[25] The script based on the short story by Daphne du Maurier was offered to Nicolas Roeg by scriptwriter Allan Scott, who had co-written the screenplay with Chris Bryant,[26] while Julie Christie and Donald Sutherland were cast in the principal roles. Filming began in England in December 1972, breaking off for Christmas, and resuming in January 1973 for seven more weeks in Italy.[27]Don't Look Now was to be Nicolas Roeg's third directorial feature following Performance and Walkabout. Although real-life couple Natalie Wood and Robert Wagner were suggested for the parts of Laura and John Baxter, Roeg was eager to cast Julie Christie and Donald Sutherland from the very start. Initially engaged by other projects both actors unexpectedly became available. Christie liked the script and was keen to work with Roeg who had served as cinematographer on Fahrenheit 451, Far from the Madding Crowd and Petulia in which she had starred. Sutherland also wanted to make the film but had some reservations about the depiction of clairvoyance in the script. He felt it was handled too negatively and believed that Don't Look Now should be a more \"educative film\", and that the \"characters should in some way benefit from ESP and not be destroyed by it\". Roeg was resistant to any changes and issued Sutherland with an ultimatum.[27]Roeg wanted Julie Christie to attend a séance prior to filming. Leslie Flint, a direct voice medium based in Notting Hill, invited them to attend a session which he was holding for some American parapsychologists, who were coming over to observe him. Roeg and Christie went along and sat in a circle in the pitch dark and joined hands. Flint instructed his guests to \"uncross\" their legs, which Roeg subsequently incorporated into the film.[14]Adelina Poerio was cast as the fleeting red-coated figure after Roeg saw her photo at a casting session in Rome. Standing at only 4'2\" tall, she had a career as a singer.[26] Renato Scarpa was cast as Inspector Longhi, despite not being able to speak English and so he had no idea what he was saying in the film.[28]The drowning scene and house exteriors were filmed in Hertfordshire at the home of actor David Tree, who also plays the headmaster at the son's boarding school.[27] Shooting the sequence was particularly problematic: Sharon Williams, who played Christine, became hysterical when submersed in the pond, despite the rehearsals at the swimming pool going well. A farmer on the neighbouring land volunteered his daughter who was an accomplished swimmer, but who refused to be submersed when it came to filming. In the end, the scene was filmed in a water tank using three girls.[26] Nicolas Roeg and editor Graeme Clifford showed the opening sequence to some friends before filming resumed on the Venice segment, and Clifford recalls it making a considerable impression.[19]The Venice locations included the Hotel Gabrielli Sandwirth—the lobby and exteriors standing in for the film's fictional Europa Hotel, although the Baxters' suite was located at the Bauer Grunwald (which better accommodated the cameras)—and the San Nicolò dei Mendicoli (the Church of St. Nicholas \"of the beggars\"), located on the outskirts of Venice. Finding an appropriate church proved difficult: after visiting most of the churches in Venice, the Italian location manager suggested constructing one in a warehouse. The discovery of San Nicolò was particularly fortuitous since it was currently being renovated and the scaffolding was already in place, the circumstances lending themselves well to the plot of the film. Roeg decided not to use traditional tourist locations to purposefully avoid a \"travel documentary\" look. Venice turned out to be a difficult place to film in, mainly due to the tides which caused problems with the continuity and transporting equipment.[29][30]Filming the scene in which John almost falls to his death while restoring the mosaic in San Nicolò church was also beset by problems, and resulted in Donald Sutherland's life being put in danger. The scene entailed some of the scaffolding collapsing leaving John dangling by a rope, but the stuntman refused to perform the stunt because the insurance was not in order. Sutherland ended up doing it instead, and was attached to a kirby wire as a precaution in case he should fall. Some time after the film had come out, renowned stunt co-ordinator Vic Armstrong commented to Sutherland that the wire was not designed for that purpose, and the twirling around caused by holding on to the rope would have damaged the wire to the extent it would have snapped if Sutherland had let go.[31]While many of the changes were down to the logistics of filming in Venice, some were for creative reasons, the most prominent being the inclusion of the famous love scene. The scene was in fact an unscripted last minute improvisation by Roeg, who felt that without it there would be too many scenes of the couple arguing.[4] The scene set in the church where Laura lights a candle for Christine was mostly improvised too. Originally intended to show the gulf between John's and Laura's mental states—John's denial and Laura's inability to let go—the script included two pages of dialogue to illustrate John's unease at Laura's marked display of grief. After a break in filming to allow the crew to set up the equipment, Donald Sutherland returned to the set and commented that he did not like the church, to which Julie Christie retorted that he was being \"silly\", and the church was \"beautiful\". Roeg felt that the exchange was more true to life in terms of what the characters would actually say to each other, and that the scripted version was \"overwritten\", so opted to ditch the scripted dialogue and included the real-life exchange instead.[14]The funeral scene at the end of the film was also played differently from what was originally intended. Julie Christie was supposed to wear a veil to hide away her face, but prior to filming Roeg suggested to Christie that she should play it without the veil and smile throughout the scene. Christie was initially sceptical, but Roeg felt it would not make sense for the character to be heartbroken if she believed her husband and daughter were together in the afterlife.[19]The score was composed by Pino Donaggio, a native Venetian who was a popular singer at the time (he had a hit with \"lo Che Non Vivo\" which was covered by Dusty Springfield in 1966 as \"You Don't Have to Say You Love Me\"); prior to Don't Look Now, Donaggio had never scored a film. Ugo Mariotti, a producer on the film, spotted Donaggio on a Vaporetto on the Grand Canal in Venice, and believing it to be a \"sign\" contacted him to see if he would be interested in working on the film. Donaggio was reluctant at first because he did not understand why they would be interested in someone who had no experience of scoring films.Donaggio had no interest in making soundtracks for films at the time, but was introduced to Nicolas Roeg who decided to try him out and asked him to write something for the beginning of the film. Roeg was enthusiastic about the result but the London-based producers were resistant to hiring someone who had no background in films. The film's financiers were pleased with Donaggio's work and overruled the producers. As well as composing the score, Donaggio performed a substantial portion of it himself. The piano pieces were performed by Donaggio, despite the fact that he was not very accomplished at playing the piano. The piano pieces are usually associated with Christine in the film, and Roeg wanted them to have an innocent sound reminiscent of a little girl learning to play the piano. Donaggio claims that since he was not very good at playing the piano, the pieces had an unsure style to them, perfect for the effect they were trying to capture.The only disagreement over the musical direction of the film was for the score accompanying the love scene. Donaggio composed a grand orchestral piece, but Roeg thought the effect was overkill, and wanted it toned down. In the end the scene just used a combination of the piano, the flute, an acoustic guitar and an acoustic bass guitar. The piano was played by Donaggio again, who also played the flute; in contrast to his skill as a pianist, Donaggio was a renowned flautist, famous for it at the conservatory. Donaggio conceded that the more low-key theme worked better in the sequence and ditched the high strings orchestral piece, reworking it for the funeral scene at the end of the film.Donaggio won a 'best soundtrack of the year' award for his work on the film, which gave him the confidence to quit his successful singing career and embark on a career scoring films. Donaggio became a regular composer for Brian De Palma films and credits Nicolas Roeg with giving him his first lesson in writing film scores, and expressed a desire to work with him again.[32]","produced_by":"Peter Katz","starring":"Julie Christie Donald Sutherland","running_time":"110 minutes","don't_look_now":"Original film poster","music_by":"Pino Donaggio","edited_by":"Graeme Clifford","Release":"Don't Look Now has become famous for a sex scene involving Julie Christie and Donald Sutherland, which caused considerable controversy prior to its release in 1973. British tabloid newspaper, the Daily Mail, observed at the time \"one of the frankest love scenes ever to be filmed is likely to plunge lovely Julie Christie into the biggest censorship row since Last Tango in Paris\". The scene was unusually graphic for the period, including a rare depiction of cunnilingus in a mainstream film.[3]Christie commented that \"people didn't do scenes like that in those days\", and that she found the scenes difficult to film: \"There were no available examples, no role models ... I just went blank and Nic [Roeg] shouted instructions.\" The scene caused problems with censors on both sides of the Atlantic. The American censor advised Nicolas Roeg explicitly, saying, \"We cannot see humping. We cannot see the rise and fall between thighs.\" The scene's much celebrated fragmented style, in which scenes of the couple having sexual intercourse are intercut with scenes of the couple post-coitally getting dressed to go out to dinner, partly came about through Roeg's attempt to accommodate the concerns of the censors: \"They scrutinised it and found absolutely nothing they could object to. If someone goes up, you cut and the next time you see them they're in a different position, you obviously fill in the gaps for yourself. But, technically speaking, there was no 'humping' in that scene.\" In the end, Roeg only cut nine frames from the sequence, and the film was awarded an R rating in the United States. In Britain, the British Board of Film Classification judged the uncut version to be \"tasteful and integral to the plot\", and a scene in which Donald Sutherland's character can be clearly seen performing oral sex on Christie's character was permitted, but it was still given an X rating—an adults only certificate.[3][33]The sex scene remained controversial for some years after the film's release. The BBC cut it altogether when Don't Look Now premiered on UK television, causing a flood of complaints from viewers.[14][34] The intimacy of the scene led to rumours that Christie and Sutherland had unsimulated sex which have persisted for years, and that outtakes from the scene were doing the rounds in screening rooms.[9][35][36] Michael Deeley, who oversaw the film's UK distribution, claimed on BBC Radio 4's Desert Island Discs that Warren Beatty had flown to London and demanded that the sex scene—featuring then girlfriend Julie Christie—be cut from the film.[37] The rumours were seemingly confirmed in 2011 by former Variety editor Peter Bart, who was a Paramount executive at the time. In his book, Infamous Players: A Tale of Movies, the Mob, (and Sex), Bart says he was on set on the day the scene was filmed and could clearly see Sutherland's penis \"moving in and out of\" Christie. Bart also reiterated Warren Beatty's discontent, noting that Beatty had contacted him to complain about what he perceived to be Roeg's exploitation of Christie, and insisting that he be allowed to help edit the film.[38][39] Sutherland subsequently issued a statement through his publicist stating that the claims were not true, and that Bart did not witness the scene being filmed. Peter Katz, the film's producer, corroborated Sutherland's account that the sex was entirely simulated.[40]Don't Look Now—marketed as a \"psychic thriller\"[41]—was released in Britain on 16 October 1973, as the main feature of a double bill.[25] The Wicker Man was its accompanying 'B' feature and—like Don't Look Now—went on to achieve great acclaim.[10] The two films have thematic similarities, and both end with their protagonists being led to preordained fates by a 'child' they believe to be helping.[2] Michael Deeley, who was managing director of British Lion Films at the time of the film's release, claimed that the film's US reception was hurt by Paramount Pictures rushing the film into cinemas too early, due to the unexpected failure of Jonathan Livingston Seagull;[42] despite its mismanaged distribution, Peter Bart—from his time at Paramount—recalls it performing \"fairly well\" at the box office.[38] The film had recouped most of its expenses before it was even released, with its $1.1 million budget offset by the fee Paramount paid for the US distribution rights.[42]Don't Look Now was chosen by the British Film Institute in 2000 as one of eight classic films from those that had begun to deteriorate to undergo restoration.[43] On completion of the restoration in 2001, the film was given another theatrical release.[44]Don't Look Now has been released on VHS, DVD and Blu-ray. Extras include an introduction by film journalist Alan Jones, an audio commentary by director Nicolas Roeg, a retrospective documentary featurette (\"Looking Back\"), an extract from a 1980s documentary about Roeg (\"Nothing is as it Seems\"), and interviews with Donald Sutherland, composer Pino Donaggio (\"Death in Venice\"), scriptwriter Allan Scott, cinematographer Anthony Richmond and film director Danny Boyle, as well as a \"compressed\" version of the film made by Boyle for a BAFTA tribute.[45][46][47]A new DVD and Blu-ray release with a 4K digital restoration was released in 2015 by The Criterion Collection. In addition to the \"Death in Venice\" and \"Looking Back\" featurettes which accompanied earlier editions, there is a conversation between editor Graeme Clifford and film writer Bobbie O’Steen, an essay by film critic David Thomson and a Q&A with Roeg at London’s Ciné Lumière from 2003. Two new documentaries are also included: the first documentary, \"Something Interesting\", features interviews with Anthony Richmond, Donald Sutherland, Julie Christie and Allan Scott about the making of the film; the second, \"Nicolas Roeg: The Enigma of Film\", features interviews with Danny Boyle and fellow film-maker Steven Soderbergh discussing Roeg's cinematic style.[48]","budget":"$1.1 million"}