{"country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Jack Bernstein Tom Shadyac Jim Carrey","story_by":"Jack Bernstein","Plot":"Ace Ventura is a Miami private investigator who specializes in the retrieval of tamed or captive animals. Despite the occasional successes, he struggles to pay rent and repair his battered 1970s Chevrolet Monte Carlo. He keeps dozens of different animal in his apartment, and his eccentricities make him the laughing stock of the Miami-Dade Police Department.Two weeks before the Miami Dolphins football team is due to play in the Super Bowl, the team mascot, a bottlenose dolphin named Snowflake, is stolen. Besides notifying the police, Melissa Robinson, the team's Chief Publicist, also hires Ace to find Snowflake. Ace discovers a rare triangular-cut orange amber stone, which he speculates to be part of a 1984 AFC Championship Ring. Ace tracks down the players in the team photo and sees their ring, but is dismayed to find every ring intact.Roger Podacter, Miami Dolphins' Head of Operations, mysteriously falls to his death from his apartment. At the crime scene, Miami Police Lieutenant Lois Einhorn concludes the death to be a suicide. However, Ace proves it was a murder, embarrassing and infuriating Einhorn. Ace learns of a former Dolphins player named Ray Finkle, who also owned a ring but did not appear in the team photo, as he was added later in the season. Finkle missed the field goal kick at the end of Super Bowl XVII, which cost the Dolphins the championship and ruined his career. Ace visits Einhorn and explains his theory: Finkle kidnapped Snowflake out of revenge due to his career having failed. Also, he takes offense to the Dolphins giving Snowflake his number and teaching it to kick a field goal. Einhorn compliments him on his finding, and tells him to let the police finish the job. Ace declines, saying it is his job to find Snowflake.Ace visits Finkle's parents and discovers that he blames Dan Marino for taking the snap incorrectly, causing him to miss the kick. Finkle became so obsessed with the loss and Marino that he became insane and was committed to a mental hospital. Ace and Robinson go to the mental hospital where Finkle was committed. Ace searches Finkle's belongings and discovers a newspaper article about a missing woman named Lois Einhorn. Studying this, Ace realizes that after escaping the mental hospital, Finkle assumed the identity of the missing Lois Einhorn.Ace follows Finkle to an abandoned yacht storage facility, where he finds Snowflake and a kidnapped Marino. Ace subdues Finkle's henchmen, but before he can rescue Marino, Finkle holds him at gunpoint. When the police arrive, Finkle claims that Ace is the kidnapper and orders them to shoot him. Ace strips Finkle and exposes his true identity, as it turns out he didn't perform penectomy and vaginoplasty to perfect the disguise. Podacter discovered this during an earlier rendezvous with Finkle, so Finkle murdered him. Finkle attempts to kill Ace, but Ace subdues him and takes off his ring, a 1984 AFC Championship ring missing a stone.Marino and Snowflake return in time for the Super Bowl between the Miami Dolphins and Philadelphia Eagles. At halftime, Ventura sees an albino pigeon (worth a $25,000 reward), but Swoop, the Eagles' mascot, shoos it away before he can catch it. Enraged, Ventura beats the mascot while he is thanked on the JumboTron for saving Marino and Snowflake. Ventura briefly stops fighting Swoop and smiles as the audience cheers for him.","language":"English","Reception":"Ace Ventura: Pet Detective received mixed reviews. It holds a 45% rating on Rotten Tomatoes, based on 51 reviews, with an average rating of 4.5/10,[2] while it gained a 37 out of 100 on Metacritic based on 14 reviews.[3] However, it was much more popular with the general public, making back over six times its budget at the U.S. box office and embedding itself, the Ventura character, and his catch-phrases in pop culture. Along with The Mask and Dumb and Dumber, the film is widely credited with launching the career of actor Jim Carrey. Carrey was nominated for the 1994 MTV Movie Award for Best Comedic Performance but lost to Robin Williams in Mrs. Doubtfire.[4] Carrey was also nominated for a Razzie Award for \"Worst New Star\". The film's popularity spawned a 1995 sequel, Ace Ventura: When Nature Calls, with Carrey returning in the lead role.American Film Institute recognition:Ace Ventura grossed $12,115,105 in 1,750 theaters in its first week. When it stopped showing in theaters in the US and Canada, the total gross was $72,217,396. It went on to gross $35,000,000 internationally.[1]","box_office":"$107.2 million","ace_ventura:_pet_detective":"Theatrical poster","cinematography":"Julio Macat","production_company":"Morgan Creek Productions","directed_by":"Tom Shadyac","release_dates":"February 4, 1994 (1994-02-04)|||||","produced_by":"James G. Robinson","starring":"Jim Carrey Courteney Cox Sean Young Tone Lōc Dan Marino","running_time":"86 minutes","music_by":"Ira Newborn","edited_by":"Don Zimmerman","budget":"$15 million[1]"}