{"country":"India","distributed_by":"Digital Entertainment Shemaroo Video Pvt. Ltd.","DVD release":"Numerous DVD editions entered the market by companies like \"Digital Entertainment inc.\", Shemaroo Entertainment and \"Eagle Home Video\". These were released as non-restored, non re-mastered editions and bare bones, void of supplementary features.","Blu-ray release":"Eagle Home Video came out with a restored edition of this movie, preserving the original aspect ratio in 4:3 pillar box and a DTS Master Audio (HD) in 2.0. The restoration took place in Shemaroo studios.","Plot":"The film begins with a felicitation ceremony arranged for Dr. Bhaskar (Amitabh Bachchan) who has just written a successful book titled Anand. Bhaskar was a cancer specialist and after the congratulatory speeches, he reveals that the book is not a work of fiction but taken from his own diary and pertains to his experiences with a real person named Anand.Flashback starts with Bhaskar, little fresh from his training as an oncologist, trying to treat the poor for no charge but often gets disheartened by the fact that he can't cure all the ailments in the world. He becomes pessimistic after seeing the suffering, illness and poverty all around him. He acts straightforward and wouldn't treat the imaginary ailments of the rich. But his friend, Dr. Kulkarni follows a little different path. He treats the imaginary illnesses of the rich and uses that money to treat the poor.One day Dr. Kulkarni introduces Bhaskar to Anand (Rajesh Khanna) who has lymphoma of the intestine, a rare type of cancer. Anand has a cheerful nature and despite knowing the truth that he is not going to survive for more than six months, he maintains his a nonchalant demeanour and always tries to make everyone happy around him. His cheerful and vibrant nature soothes Bhaskar, who has a contrasting nature and they become good friends.Anand's condition constantly deteriorates but he does not want to spend his remaining time in the hospital bed; he instead roams freely and helps everyone. He discovers that Bhaskar has strong feelings for Renu (Sumita Sanyal), whom he treated previously for pneumonia. He helps Bhaskar to express his love and convinces Renu's mother for their marriage. He tells Bhaskar that everyone should remember him as a lively person and not as a cancer patient. His end comes and he dies amongst his friends and everyone remembers him as a vibrant and lively person. Bhaskar becomes more philosophical and continues to help the helpless with more empathy and maturity.","language":"Hindi","cinematography":"Jaywant Pathare","directed_by":"Hrishikesh Mukherjee","Music":"The musical score for the film was composed by Salil Chaudhary. The lyrics were written by Gulzar and Yogesh. Gulzar wrote the poem \"Maut Tu Ek Kavita Hai\" which is narrated by Amitabh Bachchan.Before confirming Chaudhary as the film's music director, Mukherjee approached Lata Mangeshkar for the job as she had already worked as a music director in Marathi films under the pseudonym of \"Anandghan\". She, however, politely refused the offer and decided to sing the songs in the film rather than composing them.[7] [6]Although Kishore Kumar had become the voice of Rajesh Khanna since the success of Aradhana, in this film, music director Salil Choudhury insisted that Mukesh's voice would give the required pathos to Anand's character. Rajesh Khanna readily agreed to the suggestion. Once when asked which song was his favorite, Rajesh Khanna said it was Mukesh's song `Kahin Door Jab Din Dhal Jaye' from Anand.","release_dates":"12 March 1971","Production":"Anand was originally supposed to star actors Kishore Kumar and Mehmood in lead roles.[2] One of the producers, N.C. Sippy, had earlier served as Mehmood's production manager. The character Babu Moshai was to be played by Mehmood. Mukherjee was asked to meet Kishore Kumar to discuss the project. However, when he went to Kishore Kumar's residence, he was driven away by the gatekeeper due to a misunderstanding. Kishore Kumar (himself a Bengali) had done a stage show organized by another Bengali man, and was involved in a dispute with this man over financial matters. He had instructed his gatekeeper to drive away this \"Bengali\", if he ever visited the house. The gatekeeper misunderstood Mukherjee to be this \"Bengali\", and refused him entry. The incident hurt Mukherjee and he decided not to work with Kumar.[2] Consequently, Mehmood had to leave the film as well. Both Raj Kapoor and Shashi Kapoor were offered the lead before Rajesh Khanna.[3]Film expert and musicologist Rajesh Subramanian says that Mukherjee shot the film in 28 days.[4] The screenplay of Anand was written by Gulzar (who also wrote dialogues and lyrics of a few songs), Bimal Dutt, D.N. Mukherjee and Hrishikesh Mukherjee.[5] The character of Anand was inspired by Raj Kapoor, who used to call Mukherjee \"Babu Moshay\".[6] It is believed that Mukherjee wrote the film when once Kapoor was seriously ill and Mukherjee thought that he may die. The film was dedicated to Kapoor and the people of Bombay.[4] Later, Anand was remade in Malayalam, with the name Chitrashalabham, starring Jayaram and Biju Menon.[7]","produced_by":"Hrishikesh Mukherjee N.C. Sippy","starring":"Rajesh Khanna Amitabh Bachchan Sumita Sanyal","running_time":"123 minutes","music_by":"Salil Choudhury","edited_by":"Hrishikesh Mukherjee","written_by":"Bimal Dutta Gulzar D.N. Mukherjee Hrishikesh Mukherjee Biren Tripathy"}