{"country":"United States","distributed_by":"Mulberry Square Releasing","Plot":"Benji is a lovable stray dog living in a small Texas town where he befriended many of the locals, each of who calls him by a different name; but the people he likes best is a local family, the Chapmans: local physician Dr. Chapman (Peter Breck), a widowed father of two school-age children, Paul and Cindy (Allen Fiuzat and Cynthia Smith, respectively); and their housekeeper Mary (Patsy Garrett). Benji visits the Chapman residence daily and Mary and the kids keep him well fed; although they must keep this activity concealed from Dr. Chapman, who is wary of feeding stray animals due to the possibility of germ issues and doesn't want a stray dog hanging around. One day Benji befriends another stray dog--a Maltese that Mary names Tiffany. Eventually, Dr. Chapman finds out that Mary and the kids had been feeding stray dogs; and despite the kids' (especially Cindy's) tearful pleas, Dr. Chapman refuses to let them keep the dogs. Meanwhile, Benji escorts Tiffany to his hideout--an old, abandoned house believed to be haunted. Three criminals and an accomplice named Linda (Deborah Walley) later break in and bring a kidnapped Paul and Cindy into the house. Benji rushes home to \"tell\" Dr. Chapman and Mary of the kids' whereabouts but is shooed out by Mary, naturally not understanding the message Benji is trying to get across. Determined, Benji then grabs the ransom note that Dr. Chapman had been showing to the police; but it gets taken from him, leaving Benji is a loss at what to do next. Benji then follows two policemen into the station but gets locked in and seems doomed until he accidentally turns on a drive-through intercom with his paw, getting the attention of the janitor who works there who comes back in to let him out. Benji then returns to the old house and spots a failed attempt at writing the ransom note and an idea strikes him. He grabs the crumpled note and tries to flee, but is grabbed by one of the kidnappers. Tiffany then rushes out and bites the kidnapper on the shin, but gets a vicious kick in return that severely injures her. Benji then races back to the Chapmans; but Linda, whom Benji knows has another copy of the ransom note in her purse, beats him there. As Dr. Chapman makes small talk with Linda (who seems to be friends with the Chapmans); Benji notices the purse which Linda dangles close to the floor and attempts to grab it from her, but Mary starts to take him outside; but Benji bites her, freeing himself, and snatches the purse from Linda, spilling its contents and they find the ransom note. Dr. Chapman then confronts Linda about it and she bursts into tears, knowing she's about to be defeated. The police then follow Benji on foot to the kidnappers, who are arrested just as they leave the house with Paul and Cindy in tow. Because of the dogs' heroics, Dr. Chapman decides to let both Benji and Tiffany stay at their house for as long as they want, which Paul and Cindy are of course happy about.","language":"English","Reception":"Produced on a budget of $500,000,[3] it grossed $39.6 million in the United States,[4] making it the ninth highest grossing film of 1974. The film grossed a total of $45 million in worldwide receipts.[1] The film received mostly positive reviews from critics, earning an 86% approval rating on the review aggregate website Rotten Tomatoes.[5]","box_office":"$45 million[1]","cinematography":"Don Reddy","directed_by":"Joe Camp","release_dates":"October 17, 1974 (1974-10-17)|||||","Production":"Benji was filmed near Dallas, Texas. The park scenes were in Dallas. The municipal building was filmed in Denton, Texas.The outdoor scenes were filmed primarily in McKinney, Texas; and the house located at 1104 South Tennessee served as the \"haunted house\" where the Chapman kids were held hostage, as well as serving as production headquarters during the filming. The house has since been renovated into a bed and breakfast.[citation needed]The film and the ensuing franchise was created after Joe Camp expressed concern over the overabundance of family films released through the four wall distribution concept. He told Variety magazine in 1977: \"It has become an industry-caused thing, but the G rated classification has to some degree become 'if it's G, it can't be for me'.\" Camp observed that four-wall companies had saturated the market for G-rated product; in response to the lowered-down quality of their films, he created Benji.[2]","produced_by":"Joe Camp","starring":"Higgins|Patsy Garrett|Cynthia Smith|Allen Fiuzat|Peter Breck|","running_time":"85 minutes","Theme song":"The movie's theme song, \"I Feel Love (Benji theme)\", recorded by the country music star Charlie Rich, won a Golden Globe award for Best Original Song in 1975.[1]","music_by":"Euel Box","benji":"Theatrical release poster","edited_by":"Leon Seith","written_by":"Joe Camp","budget":"$500,000"}