{"country":"United States","distributed_by":"Screen Gems","armored":"Theatrical release poster","Plot":"Ty Hackett (Columbus Short), a former armed service veteran is a member of Eagle Shield security in one of their many armored transportation teams. He's the legal guardian of younger brother Jimmy (Andre Kinney) after the death of their parents. After receiving constant letters about impending foreclosure on his home and the state considering placing Jimmy in a foster home due to his truancy and lack of proper care from Ty. Ty is approached by Mike Cochrane (Matt Dillon), his godfather and co-worker about his plan to steal money being transferred from the Federal Reserve to the local banks, but Ty turns down the offer.The following morning, after receiving assurances from Mike that no one will be hurt, Ty reluctantly agrees to participate. The six-person crew offloads the first truck at an abandoned steel mill but their plan is compromised when a homeless man living in the mill is spotted observing them leading to Baines (Laurence Fishburne) shooting him. Upset over this Ty barricades himself inside the truck with the remaining $21 million inside. After an attempt to flee in the truck fails Ty sets off the truck's alarm which catches the attention of a local sheriff's deputy Jake Eckehart (Milo Ventimiglia).The remaining thieves plan to break into the truck by knocking the pins out of the door hinges. Jake arrives when Ty successfully restores power to the truck's alarm leading to Baines shooting Jake. While the thieves are distracted Ty sneaks Jake into the truck. Dobbs (Skeet Ulrich) begins to have second thoughts about the operation and agrees with Ty to get the fuse Mike removed from the engine but is caught trying to put it back and Palmer stabs him to death.As the thieves continue to remove the door hinges Ty covers the interior windows with the remainder of the $21 million and takes Jake's radio to the roof contacting authorities but is caught by Palmer who kills himself after Ty convinces Palmer that what they are doing is not right. The remaining thieves reveal a kidnapped Jimmy. Ty complies before Quinn (Jean Reno) and Baines head for the money to be killed by a booby trap rigged in the money case.Mike chases after Ty in the working armored truck and crashes into a pit killing him. Later as Jake is recovering in the hospital, Ashcroft tells Ty that Jake spoke of his efforts to stop the thieves and there's talk of a reward. With Jimmy's also being released from the hospital, Ty and Jimmy go home.","language":"English","Reception":"The film was not screened in advance to critics.[4] The film received mixed reviews, getting a 40% rating on Rotten Tomatoes.A.O. Scott, in a New York Times review, wrote that the Hungarian director, Nimród Antal, \"has an old-fashioned, functional style. [...] He has made an unabashed B movie: basic, brutal and sometimes clumsy, but far from dumb, and not bad at all\".[4] The film doesn't minimize the seriousness of killing and conveys a bleak outlook on economic blight \"with quiet passion and conviction\", Scott wrote. The cinematography of Andrzej Sekuła (whose work also appears in Reservoir Dogs and Pulp Fiction) helps capture that mood, according to Scott.[4]The film was \"accidentally\" released by Sony on PlayStation Network free of charge, though it was pulled after an unspecified amount of time. The movie was issued while it was still showing in theaters, and although the mistake was eventually spotted, it is thought to have been downloaded thousands of times before the error was fixed.[5]","box_office":"$22,942,221","cinematography":"Andrzej Sekuła","directed_by":"Nimród Antal","Home media":"This movie was released as Armored on DVD Region 1 Anamorphic widescreen and Blu-ray Disc Region A formats on March 16 of 2010.","release_dates":"December 4, 2009 (2009-12-04)|||||","Production":"Filming took place in Los Angeles.[3]","produced_by":"Sam Raimi Josh Donen Dan Farah","starring":"Matt Dillon Jean Reno Laurence Fishburne Amaury Nolasco Milo Ventimiglia with Skeet Ulrich and Columbus Short","running_time":"88 minutes","music_by":"John Murphy","edited_by":"Armen Minasian","written_by":"James V. Simpson","budget":"$20 million[1]"}