{"country":"United States","distributed_by":"Buena Vista Pictures","story_by":"John Harrison|Robert Nelson Jacobs|Thom Enriquez|Ralph Zondag|","language":"English","Voice cast":"Chris Farley was originally set to voice a young male Brachiosaurus named Sorbus, who was afraid of heights due to gigantic nature. However, after his death in 1997, the character was changed into a female one named Baylene, who is voiced by Joan Plowright.[5]","box_office":"$349.8 million[1]","cinematography":"David Hardberger|S. Douglas Smith|","production_company":"Walt Disney Pictures Walt Disney Feature Animation The Secret Lab","Marketing":"Following in the footsteps of The Lion King, Disney advertised the film by \"releasing the opening scene as a trailer\". The EmpireOnline project Your Guide To Disney's 50 Animated Features described this as a \"smart move\" because \"taken by itself, the prelude to Dinosaur is an extraordinary achievement (still impressive now), showing a verdant and vibrant world teeming with darn convincing dinosaurs\".[8]","directed_by":"Ralph Zondag|Eric Leighton|","Home media":"Dinosaur was released on VHS & DVD on January 30, 2001. It was also released on 2-Disc Collector's Edition DVD that same day, with lots of special features. It was re-released on VHS in 2002. It released on high definition Blu-ray for an original widescreen presentation on September 19, 2006, becoming the first animated film to be released on the format. It was re-released on Blu-ray on February 8, 2011.","release_dates":"May 19, 2000 (2000-05-19) (United States)|October 13, 2000 (2000-10-13) (United Kingdom)||||","Production":"While a dinosaur-related computer-animated film had been contemplated for over a decade, the film finally went into production when it did, as \"the technology to produce the stunning visual effects\" had come about - a few years before Dinosaur's eventual release in 2000. The CGI effects are coupled with \"real-world backdrops to create a 'photo-realistic' look\".The crew went all around the world, in order to \"record dramatic nature backgrounds\" for the film, which were then \"blended with the computer-animated dinosaurs\". Disney said that the over-$100 million visual effects \"make the film an 'instant classic'\".[6] The concept for the film was originally conceived by Paul Verhoeven and Phil Tippett in 1988 and was pitched as a stop-motion animated film with the title Dinosaurs. The film's original main protagonist was a Styracosaurus and the main antagonist was originally a Tyrannosaurus rex.The film was originally going to be much darker and violent in tone, and would end with the Cretaceous-Paleogene extinction event, which would ultimately result in the deaths of the film's characters. Paul Verhoeven and Phil Tippett pitched the idea to Disney, only to have the idea for the film shelved away with the onset of the Disney Renaissance until the mid-1990s. The film was originally supposed to have no dialogue at all, in part to differentiate the film from The Land Before Time (1988) with which Dinosaur shares plot similarities. Michael Eisner insisted that the film have dialogue in order to make it more \"commercially viable\". A similar change was also made early in the production of The Land Before Time, which was originally intended to feature only the voice of a narrator.[citation needed]The film's score was composed by James Newton Howard. Pop singer/songwriter Kate Bush reportedly wrote and recorded a song for the film, but due to complications, the track was ultimately not included on the soundtrack.[citation needed] According to HomeGround, a Kate Bush fanzine, it was scrapped when Disney asked Bush to rewrite the song and Bush refused; however, according to Disney, the song was cut from the film when preview audiences did not respond well to the track.In Asia, pop singer Jacky Cheung's song Something Only Love Can Do, with versions sung in English, Mandarin Chinese and Cantonese, was adopted as the theme song for the film. The Countdown to Extinction attraction at the Disney's Animal Kingdom theme park was renamed and re-themed to the film. It is now known as DINOSAUR. The storyline was always intended to tie in with the film, considering the usage of a Carnotaurus as the ride's antagonist and Aladar as the Iguanodon that guests rescue from the meteor and take back into the present, seen wandering the Dino Institute in Security Camera footage seen on monitors in the attraction's unloading area.George Scribner was the original director of the film, he spent two years on it and left to join Walt Disney Imagineering. But fundamentally, the story was pretty much the same after he left. Though Eric Leighton, one of the directors, spoke about his team \"want[ing] to learn as much about dinosaurs as possible\", he also admitted that they would \"cheat like hell\" because they were not creating a documentary. A Disney press kit revealed that the film \"intentionally veers from scientific fact in certain aspects\".In reality, the film cheated in multiple ways in regard to: how the \"dinosaurs are depicted\" and how they \"are presented in an evolutionary context\".[6] The film combines the use of live-action backgrounds with computer animation of prehistoric creatures, notably the titular dinosaurs, produced by Walt Disney Feature Animation's Computer Graphics Unit that was later merged with Dream Quest Images to create Disney's The Secret Lab department.[7] The Secret Lab department closed in 2002. Vision Crew Unlimited provided the live-action special visual effects.","running_time":"82 minutes[1]","dinosaur":"Theatrical release poster","budget":"$127.5 million[1]","screenplay_by":"John Harrison|Robert Nelson Jacobs|","Plot":"After a Carnotaurus ambushes an infant Parasaurolophus, the stampede of the dinosaurs causes an Iguanodon mother to abandon her nest. The one surviving egg journeys through several predicaments via the flight of a Pteranodon, before ending up on a far away island populated by lemurs. A lemur named Plio names the hatched baby Aladar and raises him. Years later, Aladar and the lemurs take part in the mating ritual, where Plio's brother Zini goes without a mate. Moments after the ritual ends, a meteor strikes and destroys the island. Aladar, Plio, Yar, Zini and Suri flee and jump across the sea to the mainland. They mourn for the loss of all lemurs before moving on.While wandering across deserted lands, they are ambushed by a pack of Velociraptor. After escaping from them, the family come across a remaining multi-species herd of dinosaurs led by Kron and Bruton, who are on a journey to reach the \"Nesting Grounds\", a valley said to be untouched by the devastation of the meteor. Aladar and the lemurs befriend a trio of elderly dinosaurs, Baylene, Eema and Url along the way. Together with the herd they migrate, eventually reaching a lake they have relied on for past trips. Though it has seemingly dried up by the meteor, Aladar and Baylene discover the water being buried under the dried surface of the lake and saves the herd from dehydration. Impressed by Aladar's compassionate ways, Neera begins to fall in love with him. Meanwhile, a pair of Carnotaurus picks up the herd's trail and begins stalking them for food. During a scouting mission, Bruton is attacked and wounded by the predators. He escapes and returns to inform Kron that they are being followed, sending the entire herd in grave danger. Kron picks up the pace and evacuates the herd, leaving Aladar's family and Bruton behind, while the Carnotaurus are in pursuit some distance away.During a rainstorm, the stragglers spend the night in a nearby cave before being found and attacked by the beasts. Bruton sacrifices himself to cause a cave-in that kills him and one of the Carnotaurus. As the rest of the group move through the cave, one Carnotaurus survives and resumes its search for the herd. Aladar loses hope when they reach a dead end, but the others convince him to keep going, relating how he inspired them to do the same. After they knock down the dead end together and successfully find the Nesting Grounds on the other side, Eema sees a large wall of rocks from a landslide that blocked the original entryway to the valley. Knowing that the herd will die climbing over it, Aladar rushes off alone to find them, before being pursued by the Carnotaurus.Aladar catches up with the herd and suggests a safer way into the valley, but Kron angrily fights him. Neera stops Kron and the herd decides to abandon him, taking Aladar as their new leader. As they prepare to leave, they are cornered by the Carnotaurus. Aladar rallies the herd to stand together and scare off the predator, but it senses and follows Kron on the cliff. Aladar and Neera fight back against the Carnotaurus, as it kills Kron. After Aladar knocks the Carnotaurus off the cliff to its death, he and Neera mourns for his demise.The herd are then led back to the Nesting Grounds as their new home. Sometime later, a new generation of dinosaurs hatches, among them are Aladar and Neera's children. The lemurs finds more of their kind, and soon they begin embarking on a new life together.","Reception":"Dinosaur received mixed to positive reviews.The review aggregator Rotten Tomatoes reported that 65% of critics gave the film positive reviews, based on 122 reviews with an average score of 6.2/10. The consensus on the site reads: \"While Dinosaur's plot is generic and dull, its stunning computer animation and detailed backgrounds are enough to make it worth a look.\"[9]Roger Ebert gave the film three stars out of four praising the film's \"amazing visuals\" but criticizing the decision to make the animals talk, which he felt cancelled out the effort to make the film so realistic. \"An enormous effort had been spent on making these dinosaurs seem real, and then an even greater effort was spent on undermining the illusion\" was his final consensus. The overall rating of Dinosaur on Metacritic from critics is 56%, with 15 critics giving positive reviews, 12 giving mixed reviews, and 5 giving negative reviews.[10]The lemurs depicted in the movie strongly resemble the sub-species Verreaux's sifaka. Biologists[who?] have raised concerns that the movie is misleading and could potentially confuse people, as it suggests lemurs (in their present evolved state) co-existed with dinosaurs over 66 million years ago. All modern strepsirrhines including lemurs are thought to have evolved from 'primitive' primates known as adapiforms during the Eocene (56 to 34 mya) or Paleocene (66 to 56 mya).[11][12][13]In an analysis of the film, done as part of EmpireOnline's Your Guide To Disney's 50 Animated Features, on the opening sequence it said \"much of the scenery is skilfully-composited live-action, including shots of the tepui mountains that would captivate Up's Carl Fredricksen\". However, it spoke negatively about the unrealistic talking dinosaurs after the opening, describing it as a \"nose-dive\". It said they \"sound[ed] more like mallrats than terrible lizards\" and that \"although no-one knows what dinosaurs sound like, they definitely don't sound like that.\" It also disliked how the meteor hit Earth in Act 1, making the majority of the film set \"in gray gravel-pits rather than the lush landscapes we were sold\". It said \"the animals [are] cute enough, but the script, characters and dino-action are all plodding kiddie fare\", but added these faults are made up through \"James Newton Howard's majestic score\". It cited similarities to the 1988 dinosaur-themed Don Bluth film The Land Before Time, and the more successful prehistoric Blue Sky Studios film Ice Age (which it described as \"sassier\"), and added that the \"images of desperately migrating dinosaurs hark back to the far greater Fantasia\". The film was also deemed \"inferior\" to the work of Pixar.[8]Dinosaur opened at #1 making $38,854,851 in its first weekend from 3,257 theaters, for an average of $11,929 per theater beating Battlefield Earth. It had a final gross of $137,748,063 in North America which covered its production costs. The film was eventually accepted overseas earning $212,074,702 for a worldwide take of $349,822,765.[1] The official teaser trailer to this movie accompanied 102 Dalmatians and the trailer of The Emperor's New Groove.","Soundtrack":"The soundtrack album was composed by James Newton Howard and was released by Walt Disney Records.The German release has as track 2 the song \"Can Somebody Tell Me Who I Am\" (4:14), performed by Orange Blue while the UK/Ireland release has as track 1 the song \"High Hopes (8:32), performed by Pink Floyd; all the score tracks included above are on both German and UK/Ireland releases.","produced_by":"Pam Marsden","starring":"D. B. Sweeney|Ossie Davis|Alfre Woodard|Max Casella|Hayden Panettiere|Samuel E. Wright|Peter Siragusa|Julianna Margulies|Joan Plowright|Della Reese|","Other media":"Disney Interactive released a tie-in video game on the Dreamcast, PlayStation, PC and Game Boy Color in 2000. To promote the release of Dinosaur, the Disney theme park ride \"Countdown to Extinction\" was renamed \"DINOSAUR\", and its plot, which had always prominently featured a Carnotaurus and an Iguanodon, was mildly altered so that the Iguanodon is specifically meant to be Aladar, the film's protagonist, and the plot of the ride is now about the riders traveling through time to a point just before the impact of the meteor which caused the extinction of the dinosaurs, to bring Aladar back to the present and save his life.","music_by":"James Newton Howard","edited_by":"H. Lee Peterson"}