{"country":"Italy|France|","distributed_by":"Gaumont Italia","screenplay_by":"Federico Fellini|Bernardino Zapponi|Brunello Rondi|","story_by":"Federico Fellini|Bernardino Zapponi|Brunello Rondi|","Plot":"Snàporaz wakes up during a train ride and has a brief fling with a woman in the bathroom, but it's cut short when the train suddenly stops and the woman gets off. Snàporaz follows her into the woods, through the wilderness and into a Grand Hotel overrun with women in attendance for a surrealistic feminist convention. He winds up in a conference about polyandry, where his presence is rejected. A frightened Snàporaz retreats to the hotel lobby, but the exit is blocked; instead he seeks refuge with a girl who offers her assistance, Donatella, inside an elevator.Donatella leads Snàporaz into a gymnasium and forces him to don roller skates. He is yet again cornered and berated by a group of angry women who circle around him in roller skates and practice testicle-kicking with a dummy. Dazed, Snàporaz makes his exit down a flight of stairs, falling down and badly hurting himself, and into the domain of a burly woman tending to the hotel's furnace. The woman showers and offers him a ride to the train station on her motorcycle, but stops by a farm and lures Snàporaz into a nursery, where she tries to rape him. The rape is cut short by the woman's mother, who steps in to chastise her daughter, and Snàporaz decides to follow instead a lonely woman through the country side. He joins her and her girlfriends on a car ride on the promise of being delivered to the station, but the ride goes on well into the night and all they do is hang out high on drugs and listen to techno. A frustrated Snàporaz ditches them and is harassed by two more cars until he finds shelter in the off-limits private property of Dr. Xavier Katzone, who hails gunfire on his persecutors.Dr. Katzone promises to deliver Snàporaz to the train station the following morning and invites him to stay on for a party. Snàporaz walks around Katzone's extravagant household, which is filled with sexual imagery and suggestive, phallic sculptures. He is also fascinated by his collection of sexual conquests hanging as photographs from the manor walls that light up and whisper arousing dialogue at the flick of a switch.Taking pride in his many inventions, Katzone celebrates his 10,000th conquest with an eccentric party that involves the blowing out of 10,000 candles and a performance by his wife, in which she sucks coins and pearls into her vagina by means of telekinesis. During the party, Snàporaz comes across his ex-wife, Elena, who has a drunken argument with him, and meets Donatella again.The police (composed solely of women dressed in Nazi attire) arrive, interrupting Katzone mid-song, and announce the imminent demolition of his house. They also inform him that they've shot one of his dogs, Italo, his most beloved. A grieved Katzone buries him. Meanwhile, Snàporaz dances to Fred Astaire with Donatella and a friend of hers (who are both dressed in scanty clothing), but fails to sleep with either of them, instead getting stuck with his ex in bed. Hearing strange noises, he crawls under the bed, entering another dream-like world in which he slides down a toboggan, revisiting his childhood crushes (a sitter, a nurse, a prostitute) along the way. Caged at the end of the slide, he is transported before a strange court and judged for his masculinity. Although dismissed to go free, he decides to confront his tentative punishment, and escalates a towering boxing ring before a feminine crowd. At the top of the ring he climbs into a hot air balloon in the form of Donatella. Donatella herself fires at him from below with a machine-gun, bursting the balloon and sending Snàporaz plummeting to apparent death.Snàporaz then wakes up on the very same train from the beginning of the film, showing the story to have been a mere nightmare. Just as he comes to this conclusion, he realizes his glasses are broken (as in his dream) and that the wagon is filled by the women that crowded his dream. The train races into a tunnel and the film ends.","city_of_women":"Italian release poster","language":"Italian","Critical reception":"City of Women opened in eighty Italian theaters in March 1980[3] and received generally favorable reviews bordering \"on respect rather than praise\".[3] Corriere della Sera critic Giovanni Grazzini interpreted the film as \"a catalogue of emotions, sometimes grotesque, sometimes farcical, which provides a few caustic jibes against the destruction of femininity by aggressive feminism... From a stylistic point of view, it's less homogeneous than usual but other parts of the film are delightful. For instance, when fantasy is used to create types of people rather than caricatures. In this sense Fellini, having abandoned his gallery of monsters, becomes more prosaic. Or when the ambiguity of certain characters - an excellent example is the soubrette played by the charming Donatella Damiani - provides a touch of grace and bitchiness; or when the film becomes almost a musical; or when paradox becomes surrealist, such as the party and the hurricane at the villa of Katzone who's in despair because his favourite dog has died\".[4]\"Fellini appears as the Madame Bovary of his adolescence\", wrote Claudia Fava for Corriere Mercantile. \"He revels in the enjoyment he feels at working with an experienced crew, side by side with faithful technicians who simulate trains on the move or the sea washing the shores of the inevitable Romagnol beaches as though they were working of the set of George Méliès. But then, again and again, Fellini has shown us that he is the greatest and most ingenious of Méliès' heirs. Only the magic does not always work, especially in the attempt to create a kind of astonished confession of amused impotence when faced with the new woman of today, together with a feeling of nostalgia for the old woman of the past... Despite Fellini's extraordinary virtuosity, the film rarely achieves harmony of inspiration, of order, of strip-cartoon fantasy, or of irony.\"[5] Francesco Bolzoni of L'Avvenire insisted that Fellini was \"only playing games. But then we would hardly expect from Fellini a deep analysis of the nature of women... It is a game with occasional gaps and, more often, inventions that rejuvenate an all too familiar, all too hackneyed subject. A surprising serenity predominates... It is a film with a tragic vein that in the end proves to be light-hearted and occasionally amusing\".[6] La Notte magazine's Giorgio Carbone felt the maestro had \"finally reached a splendid maturity that permits him to lavish his treasures upon us for the simple pleasure of doing so. Behind the festival of images and colours we can feel his delight in making this film, a delight which, from the very first scene, becomes ours too, and it's something we haven't felt in a long time... If the film lacks suspense in its story (we care little what happens to Snàporaz or Katzone because we know that sooner or later Rimini and those bosomy extras will appear on the scene), there's suspense in the images and in the scenic inventions\".[7]Screened out of competition on 19 May 1980 at the 33rd Cannes Film Festival,[8] the film was badly received by the majority of French critics, some of whom offered review titles such as \"Zero for Fellini\", \"A Tiring Deception\", \"A Disaster\", as well as \"A Mountain of Tedious Pretension\".[3] Russian film director Andrei Tarkovsky, in Rome that year for the pre-production of Nostalghia, noted in his diary that City of Women was a fiasco: \"At the Cannes Festival the papers said that Fellini's last film was a total disaster, and that he himself had ceased to exist. It's terrible, but it's true, his film is worthless.\"[9]Released by New Yorker Films in the United States on 8 April 1981, the film garnered generally favorable reviews but little box-office success.[10] Daniel Talbot of New Yorker Films offered an explanation for the public's lack of interest: \"Here, it played in less than fifty theatres, and of those, six provided 75 percent of the earnings. I don't know what Gaumont or Fellini could have expected with that kind of personal film. He had lost most of his audience here by then. Which isn't to say that I don't think him one of the great filmmakers of the world.\"[10] For Vincent Canby of The New York Times, however, the film was a success: \"Though the film is overlong, even for a Fellini aficionado, it is spell-binding, a dazzling visual display that is part burlesque, part satire, part Folies-Bergère, and all cinema. As Snàporaz is haunted by the phantoms of all the women he has known, or wanted to know, from childhood on, Mr Fellini in City of Women is obsessed by his own feelings toward women, by his need for them, his treatment (mostly poor) of them, his continued fascination by them and his awareness that (thank heavens) they'll always be different... Though City of Women is about a libertine, it's anything but licentious. Mr Fellini's licentiousness suggests a profound longing for some kind of protective discipline, if not complete chastity. As such discipline would destroy Snàporaz, it would make impossible the conception and production of a film as wonderfully uninhibited as City of Women.\"[11]John Gould Boyum of the Wall Street Journal observed that \"the film's entire thrust has little or nothing to do with the striking of attitudes, the analyzing of ideas. What Fellini seems after here is the recording and communicating of a set of feelings: those complex, contradictory ones experienced by a middle-aged Italian male suddenly faced with a cataclysmic upheaval in social and sexual mores... We do not go to Fellini to immerse ourselves in story and character or to encounter ideas. What we want from the maestro and what he gives us are fabulous adventures in feeling - a decidedly original mixture of nostalgia, poignancy, and joy that is unmistakably Fellini's own.\"[12]","cinematography":"Giuseppe Rotunno","production_company":"Opera Film Produzione","directed_by":"Federico Fellini","release_dates":"28 March 1980 (1980-03-28) (Italy)|5 November 1980 (1980-11-05) (France)||||","produced_by":"Franco Rossellini|Renzo Rossellini|Daniel Toscan du Plantier|","starring":"Marcello Mastroianni","running_time":"139 minutes[1]","music_by":"Luis Enríquez Bacalov","edited_by":"Ruggero Mastroianni"}