{"based_on":"The Downhill Racers  by Oakley Hall","country":"United States","distributed_by":"Paramount Pictures","downhill_racer":"Theatrical release poster","Plot":"American downhill skier David Chappellet (Robert Redford) arrives in Wengen, Switzerland to join the United States ski team, along with fellow newcomer D. K. Bryan (Kenneth Kirk). Both men were sent for by team coach Eugene Claire (Gene Hackman) to replace one of his top skiers who was recently injured during an FIS competition. Raised in the small town of Idaho Springs, Colorado, Chappellet is a loner with a single-minded focus on becoming a skiing champion, and shows little interest in being a team player. After refusing to race at the Lauberhorn because of a late starting position, he makes his European skiing debut at the Arlberg-Kandahar in Austria, where he finishes in an impressive fourth position. In the final race of the season at the Hahnenkamm-Rennen in Kitzbühel, Austria, he crashes.That summer, Chappellet joins the team in Oregon for off-season training. He visits his father at his home in Idaho Springs, but they have little to say to each other. Chappellet drives into town and picks up an old girlfriend and they make love in the back seat of his father's old Chevrolet. Afterwards, he shows little interest in the girl's feelings. Later, when his father asks him why he is wasting his life on skiing, Chappellet reveals that he is racing as an amateur to become an Olympic champion. His father observes, \"The world's full of 'em.\"Back in France that winter, Chappellet wins the Grand Prix de Megève in France and soon attracts the attention of Machet (Karl Michael Vogler), a ski manufacturer who wants Chappellet to use his skis for the advertising value. Chappellet is more interested in Machet's attractive assistant Carole Stahl (Camilla Sparv). After a chance encounter at a bakery, he and Carole spend some time with each other. They meet up again in Wengen, ski the slopes together, and eventually make love.At Kitzbühel, Chappellet wins the Hahnenkamm, but afterwards his cockiness alienates his teammates and his coach who feel he is only out for himself. The team's top racer, Johnny Creech (Jim McMullan), tells assistant coach Mayo (Dabney Coleman), \"He's never been for the team, and he never will be.\" Mayo responds, \"Well it's not exactly a team sport, is it?\" Chappellet finishes the season with several impressive victories ensuring his place on next season's Olympic team.During the off-season, Chappellet and Carole continue to see each other. At the start of the third season, he calls her from Megève asking to spend Christmas with her. After waiting several days alone, Chappellet realizes that she is not coming. He travels to Zurich to Machet's office to find her, but learns she is spending Christmas with her family. The next week, Chappellet runs into Carole in Wengen and is annoyed that she never called and that she is with another man. After a brief confrontation, he realizes their relationship is over.Two weeks before the Olympics, after a day of training at Wengen, Chappellet challenges Creech to a one-on-one race, and the two take off to the bottom as the coaches looks on in horror. On the way down, Chappellet forces Creech into an overpass wall, and Creech barely escapes injury. The next day, during the Lauberhorn race, Creech is seriously injured during his run, leaving Chappellet as the team's best hope for an Olympic gold medal.At the Winter Olympics, with Austrian champion Max Meier in first place, Chappellet produces one of his best races, beating Meier's time and ending up in first place with only the German skier left to race. Surrounded by elated fans and teammates, Chappellet takes notice of the German's split time and watches nervously for the outcome. As the German approaches the final hill he crashes, and Chappellet becomes an Olympic gold medal champion. As the German makes his way to the finish area, Chappellet looks into his eyes briefly before being carried off in victory.","language":"English","Reception":"In his review for the Chicago Sun-Times, Roger Ebert gave the film four out of four stars, calling it \"the best movie ever made about sports—without really being about sports at all.\"[6] In addition to praising the performances of Redford and Hackman, Ebert noted how well the film balanced the exciting action sequences and the less glamorous aspects of an athlete's life.[6] Ebert wrote:Without bothering to explain much of the technical aspect of skiing, Downhill Racer tells us more about the sport than we imagined a movie could. The joy of these action sequences is counterpointed by the daily life of the ski amateur. There are the anonymous hotel rooms, one after another, and the deadening continual contact with the team members, and the efforts of the coach ... to hold the team together and placate its financial backers in New York. And there is Chappellet's casual affair with a girl ..., who seems to be a sort of ski groupie. She wants to make love to him, and does, but he is so limited, so incapable of understanding her or anything beyond his own image, that she drops him. He never does quite understand why. The movie balances nicely between this level, and the exuberance of its outdoor location photography. And it does a skillful job of involving us in the competition without really being a movie about competition. In the end, Downhill Racer succeeds so well that instead of wondering whether the hero will win the Olympic race, we want to see what will happen to him if he does.[6]In his review for The New York Times, Roger Greenspun called Downhill Racer \"a very good movie\".[10] Writing about the lead character David Chappellet, Greenspun observed, \"His world is that international society of the well-exercised inarticulate where the good is known as 'really great,' and the bad is signified by silence. In appreciating that world, its pathos, its narcissism, its tensions, and its sufficient moments of glory, Downhill Racer succeeds with sometimes chilling efficiency.\"[10]In his review for Life magazine, Richard Schickel praised the film for both its esthetic beauty and its depiction of the brutal realities of competition.[11] Schickel wrote:Downhill Racer is precisely what we have waited so long to see—a small, tense, expertly made (and, on occasion, surprisingly funny) film about a newly chic form of athletic competition—Alpine skiing. ... That insistence on the heart of the matter, winning or losing, is not the least of Downhill's virtues, but there are others. Quite obviously, they include capturing on color film the sheer beauty of the white world in which racers live. Here the director, Michael Ritchie, splendidly exploits a couple of paradoxes. From a distance, the skiers seem to have the effortless natural grace of birds in flight. Close up, though, he makes us see they are engaged in a brutal, breath-stealing ordeal, and the contrast gripped me as strongly as anything I have recently seen on the screen. Then there's the other paradox—that this agonizing effort takes place, unlike that of any other sport, with the competitor alone in a sea of silence.[11]","box_office":"$1,925,000 (US/ Canada rentals)[2]","cinematography":"Brian Probyn","production_company":"Wildwood","directed_by":"Michael Ritchie","release_dates":"November 6, 1969 (1969-11-06) (USA)|||||","Production":"The screenplay for Downhill Racer is loosely based on the 1963 novel The Downhill Racers by Oakley Hall. In 1966, the film rights to the book passed from director Mark Robson to Paramount Pictures for producer Steve Alexander and screenwriter Graham Ferguson. After attempts to develop the project stalled, the new head of Paramount production, Robert Evans, used the project to entice Roman Polanski, a skiing enthusiast, to direct the film Rosemary's Baby for the studio. Although Robert Redford passed on Polanski's offer to star in both films, the young actor soon attached himself to the skiing film, taking it on as a pet project. Redford soon persuaded novelist James Salter to write a screenplay for the film, introducing him to Polanski and his partner, Gene Gutowski, who agreed to work on the film.[1]James Salter prepared notes for the story, which did not resemble Hall's novel—Salter had not even read the book. Salter's starting point for the story was provided by Polanski, who told the writer that the film should be a modern-day High Noon, where the sheriff is killed and someone is called in to replace him. For the film, the \"sheriff\" is the lead racer on the team who breaks his leg, and Chappellet is called in to replace him. Focused on directing Rosemary's Baby, Polanski soon left the project, and the studio sued Redford for walking away from the starring role. Redford later revived the project by pitching the story to Gulf+Western owner Charles Bluhdorn. Soon after, Redford found his director and decided to make the film cheaply in Europe. Charles Bluhdorn, who was Austrian, may have influenced the decision on film locations; he created the production company Wildwood.[1]In January 1968, Redford and Salter traveled to Grenoble and accompanied the United States ski team—traveling on buses, sleeping in hallways, taking in the atmosphere, and observing the athletes. One night in Grenoble, they discussed the central character of David Chappellet. Salter's inspiration for the character was the 1964 Olympic silver medal winner Billy Kidd, who conveyed an \"arrogant and aloof\" quality.[1] Redford, however, saw the Chappellet character as being more like Spider Sabich, the dynamic skier who finished fifth that year in the slalom. While the character ultimately took on aspects of both role models, Salter's original scenes of tense dynamics between Chappellet and the coach survived the writing process.[1] The original inspiration for the character is said to be Buddy Werner of Steamboat Springs, Colorado (Chappellet was said to be from Idaho Springs, Colorado). Werner burst upon the downhill racing scene in Europe in the late 1950s and was the first American to win an F. I. S. downhill race. He was known for a reckless style and injured himself before the 1960 Winter Olympics at Squaw Valley in which he would have been a favorite for a medal in the downhill. Subsequently, he died in an avalanche in Europe while performing for a film crew.As director Michael Ritchie admired the work of British director Ken Loach, Ritchie hired Brian Probyn and Kevin Sutton, the cameraman and sound man from Loach's film Poor Cow.[3]Downhill Racer was filmed on location in Wengen, Switzerland, Kitzbühel and Sankt Anton am Arlberg in Austria, Megève and Grenoble in France, and Boulder and Idaho Springs in Colorado, United States.[3] Most of the skiing footage was shot from January 11 to February 1, 1969, during four World Cup races: Internationales Lauberhorn in Wengen, Internationales Hahnenkamm-Rennen in Kitzbühel, Grand Prix de Megève, and Arlberg-Kandahar in Sankt Anton am Arlberg.[3] The off-season scenes were filmed in Colorado: the track scene was filmed in at Potts Field on the east campus of the University of Colorado,[7] and the hometown street scenes were filmed in Idaho Springs.[3] The interior scenes of Chappellet's Idaho Springs house were filmed at Paramount Studios in southern California.[3]","produced_by":"Richard Gregson","starring":"Robert Redford|Gene Hackman|Camilla Sparv|","running_time":"101 minutes","music_by":"Kenyon Hopkins","edited_by":"Richard A. Harris","Release":"Downhill Racer was released to theaters in the United States in late 1969, premiering in New York City on November 6.[5] It was re-released in the U.S. in July 1984 at the FILMEX: Los Angeles International Film Exposition for a 50-hour Sports Movie Marathon on July 5–20.[8]Downhill Racer was released on DVD in Region 2 format on August 13, 2007 by Paramount Home Entertainment. The Criterion Collection DVD was released November 17, 2009.[9]","written_by":"James Salter","budget":"$1.8 million[1]"}