{"based_on":"Cimarron 1929 novel  by Edna Ferber","Cast":"(Principal cast list as per AFI database, and The RKO Story)[1][4]","country":"United States","distributed_by":"RKO Radio Pictures","screenplay_by":"Howard Estabrook Louis Sarecky","Plot":"The Oklahoma land rush of 1889 prompts thousands to travel to the Oklahoma Territory to grab free government land; Yancey Cravat (Richard Dix), his young bride, Sabra (Irene Dunne) and their son, Cim, join the throngs. In the ensuing race, Yancey is outwitted by a young prostitute, Dixie Lee (Estelle Taylor), who takes the prime piece of real estate, the Bear Creek claim, which Yancey had targeted for himself.His plans for establishing a ranch thwarted, Yancey moves into the town of Osage, a boomer town, where he confronts and kills Lon Yountis (Stanley Fields), an outlaw who has killed the prior publisher of the local newspaper. Having a background in publishing himself, Yancey establishes the Osage Wigwam, a weekly newspaper, to help turn the frontier camp into a respectable town. After the birth of their daughter, Donna, a gang of outlaws threatens Osage, led by \"The Kid\" (William Collier Jr.), who happens to be an old acquaintance of Yancey's. To save the town, Yancey faces and kills The Kid.Beset by guilt over his killing of The Kid, when another land rush appears, Yancey leaves Sabra and his children to participate in settling the Cherokee Strip. After his departure, Sabra takes over the publication of the Osage Wigwam, and raises her children until Yancey returns five years later, just in time to represent Dixie Lee and win her acquittal.Osage continues to grow, as does the Territory of Oklahoma, which gains statehood in 1907, which benefits from the early oil boom of the 1900s, including the Native American tribes, which Yancey supports, through editorials in his newspaper, after which Yancey once again disappears from Osage for several years. At the time, Sabra is vehemently against Yancey's viewpoint, despite her son's involvement with an Indian woman. Years later, when Sabra becomes the first female congresswoman from the state of Oklahoma, she lauds the virtues of her then Indian daughter-in-law.Sabra and Yancey are reunited one final time when she rushes to his side after he has rescued numerous oil drillers from a devastating explosion. He dies in her arms.","language":"English","Reception":"RKO Radio Pictures premiered Cimarron at the RKO Palace Theatre (Broadway) in New York City on January 26, 1931, to much praise, and then on February 6 a Los Angeles Orpheum Theatre premiere followed, which also included personal appearances of Richard Dix and Irene Dunne, a stage show and an augmented orchestra. Three days later, the movie was released to theaters throughout the nation. Despite being a critical success, the extremely high budget and ongoing Depression combined against the film. While it was a commercial success in line with other films of the day, RKO Pictures could not at first recoup their heavy investment in the film, which ended up losing $565,000.[4] However, it earned more money on a 1935 re-release which enjoyed another premiere in Oklahoma City at the (John Eberson designed) Midwest Theatre. The movie remained RKO's most expensive film until 1939's Gunga Din (which filmed exteriors around the Sierra Nevada Alabama Hills range, but had one scene shot on RKO's movie ranch in Encino).[2]Reviews by film critics were overwhelmingly positive at the time. Variety led off their review with, \"An elegant example of super film making and a big money picture. This is a spectacular western away from all others. It holds action, sentiment, sympathy, thrills and comedy – and 100% clean. Radio Pictures has a corker in 'Cimarron'.\" The review went on to praise the actors, particularly Dix and Oliver, as well as the direction, stating, \"Wesley Ruggles apparently gets the full credit for this splendid and heavy production. His direction misses nothing in the elaborate scenes, as well as in the usual film making procedure.\" The magazine specifically pointed out the quality of the make-up in the aging of the principle players, who have to go through forty years on-screen.[6]Mordaunt Hall of the New York Times also gave the film a stellar review, calling it, \"A graphic and engrossing screen conception of Edna Ferber's widely read novel ...\", and also praised the handling of the passage of time in this epic. Hall also singled out the performance of Dunne.[7] Motion Picture Magazine raved, \"A great and worthy effort, this transcription of early Oklahoma life will be hailed as one of the high-spots of the year. It has everything. RKO seems to have placed no restrictions upon making it a lavish, bona-fide epic.\"[8]John Mosher of The New Yorker praised the \"great care\" that had been taken with the historical accuracy of the film's visual details, which he thought \"as good as anything that has come out of Hollywood, and because of this expertness the film gains especial value.\" He also write that Richard Dix was \"certainly at his best in this role.\" His only criticisms concerned the second half of the film, which he thought had \"sagging moments\" and an ending that was too abrupt.[9] The Evening Independent called it \"a notable addition to the small list of pictures that the years have given to the American theater. For in \"Cimarron\" is vested stirring drama, stark beauty, daring and adventure on a plane that is seldom seen on the screen.\"[10] The West Seattle Herald declared that it was \"even more powerful than the great story read by millions in America. \"Cimarron\" the picture is all that is gripping in \"Cimarron\" the story. Spectacular scenes abound in this production.\"[11]More recent appraisals of the film have not been as positive. Cimarron currently holds a 50% favorable rating on Rotten Tomatoes, based on 14 reviews.[12] Assessing the film in 2009, James Berardinelli called it \"an excellent study of how tastes have changed over the years. Critically lauded at the time of its release, Cimarron was beloved by most who saw it. Eight decades later, it is frequently cited on lists of the most undeserving Academy Award winners and is rightfully impugned for racist overtones and scattershot storytelling.\"[13] Steve Evans of DVD Verdict wrote, \"Seen with contemporary eyes, the film is badly dated, slow moving, and pocked with racist caricatures....The recreation of the great 1889 Oklahoma Land Rush remains an exciting spectacle....Unfortunately, the film never manages to top this opening shot.\"[14]","box_office":"$1,383,000[2]","cinematography":"Edward Cronjager","production_company":"RKO Radio Pictures","directed_by":"Wesley Ruggles","Awards and honors":"At the 1931 Academy Awards ceremony at the Biltmore Hotel in Los Angeles, Cimarron was the first film to receive more than six Academy Awards nominations and nominated for the Big Five awards (Best Picture, Best Director, Best Actor, Best Actress, and Best Writing).[15] Additionally, it is one of only two films (the other being Who's Afraid of Virginia Woolf?) to receive nominations in every eligible category. It won for three of them, including best picture.[citation needed] It would win the first of only two Best Picture Oscars for the studio, the other being awarded to 1946's The Best Years of Our Lives.[4] It was the first Western to win the Best Picture award, and it would not be until 1990 when Dances With Wolves won, that another Western would garner that honor.[16]","cimarron":"theatrical release poster","References":"Notes","release_dates":"January 26, 1931 (1931-01-26) (Premiere-New York City)[1]|February 9, 1931 (1931-02-09) (US)[1]||||","Production":"Despite being in the depths of the Great Depression, RKO Radio Pictures invested more than $1.5 million into their production of Ferber's novel. Filming began in the summer of 1930 at Jasmin Quinn Ranch outside of Los Angeles, California, where the land rush scenes were shot. More than twenty-eight cameramen, and numerous camera assistants and photographers, were used to capture scenes of more than 5,000 costumed extras, covered wagons, buckboards, surreys, and bicyclist as they raced across grassy hills and prairie to stake their claim. Cinematographer Edward Cronjager planned out every take (which recalled the scenes of Intolerance some fifteen years earlier) in accordance with Ferber's descriptions. In order to film key scenes for this production, RKO purchased 89 acres in Encino where construction of Art Director Max Ree's Oscar-winning design of a complete western town and a three block modern main street were built to represent the fictional Oklahoma boomtown of Osage. These award-winning sets eventually formed the nucleus for RKO's expansive movie ranch, in Encino, where other RKO (and non-RKO) films were later lensed.[5]","produced_by":"William LeBaron Louis Sarecky (assoc.)[1]","starring":"Richard Dix Irene Dunne","running_time":"124 minutes[1]","music_by":"Max Steiner","External links":"","edited_by":"William Hamilton","budget":"$1,433,000[2]"}