{"based_on":"Brideshead Revisited  by Evelyn Waugh","country":"United Kingdom|Italy|Morocco|","distributed_by":"2 Entertain (UK)|Miramax Films (US)|","screenplay_by":"Jeremy Brock|Andrew Davies|","brideshead_revisited":"Original release poster","Plot":"Although he aspires to become an artist, middle-class Charles Ryder (Matthew Goode) reads history at the University of Oxford, where he befriends the flamboyant and wealthy Lord Sebastian Flyte (Ben Whishaw). Sebastian's mother, Lady Marchmain, strongly disapproves of his life-style, especially his heavy drinking. When Sebastian takes him home to visit his nanny, Charles is enthralled by the grandeur of the Marchmain family estate, known as Brideshead, and he is entranced by its residents, including the devout Roman Catholic Lady Marchmain (Emma Thompson) and her other children, Sebastian's elder brother Bridey (Ed Stoppard) and his sisters Julia (Hayley Atwell) and Cordelia (Felicity Jones).When Lord Marchmain invites Sebastian and Julia to visit him and his mistress Cara (Greta Scacchi) in Venice, Lady Marchmain encourages Charles to go with them in the hope that he can act as a positive influence on her son. Increasingly interested in Julia, Charles surreptitiously kisses her in a dark alley, unaware that Sebastian can see them from the other side of a canal. Jealous of his attention to his sister, Sebastian sets out to end their friendship, and on their return to England Lady Marchmain makes it clear that Charles cannot marry Julia since he professes to be an atheist.Sebastian's mother, concerned about his increasing alcoholism, cancels his allowance. During a visit to Brideshead, Ryder gives Sebastian money, which he uses to buy alcohol. When he arrives drunk and improperly dressed at a ball celebrating Julia's engagement to Canadian business man Rex Mottram (Jonathan Cake), Lady Marchmain blames Charles and tells him he no longer is welcome at Brideshead. Sebastian flees to Morocco. Some time later, at the request of the now terminally-ill Lady Marchmain, Charles goes there and finds Sebastian in hospital. His plan to bring Sebastian home is disrupted when the doctor warns him Sebastian is too ill to travel.Years later, Charles – now married and a successful painter – is reunited with Julia on an ocean liner travelling to England from New York. They realise they are still in love and decide to leave their respective spouses and live together. Charles returns to Brideshead, where he persuades Rex to step aside so he and Julia can be together. Rex agrees to the proposal in exchange for two of Charles's paintings, an arrangement that shocks and angers Julia, who feels like bartered goods. Without warning, a dying Lord Marchmain and Cara arrive at Brideshead so he can spend his final days in his former home. On his deathbed Lord Marchmain, hitherto an atheist, regains his faith and dies reconciled to the Roman Catholic Church. Deeply affected by her father's transformation, Julia decides she cannot relinquish her own faith to marry Charles, and the two part.Several years later, during the Second World War, Charles – now a disillusioned army captain – finds himself once again at Brideshead, which the army has requisitioned as a military base. A corporal tells him Julia is serving in the reserves and that her elder brother died during the Blitz. In the movie's final scene, Charles visits the family chapel, where he finds a single lit candle. He dips his hand into holy water and moves to snuff out the candle between his fingers, but leaves the flame still burning.","language":"English|Arabic|French|Italian|Latin|","box_office":"$13.5 million[2]","cinematography":"Jess Hall","production_company":"BBC Films Ecosse Films HanWay Films Screen Yorkshire UK Film Council","directed_by":"Julian Jarrold","release_dates":"25 July 2008 (2008-07-25)|||||","Production":"Actors Paul Bettany, Jude Law, and Jennifer Connelly were signed for the lead roles by original director David Yates for Warner Independent Pictures in 2004. However, constant budget issues stalled the film's production and Yates left the project to direct the fifth film in the Harry Potter series. This led to the roles being recast by directorial replacement Julian Jarrold.[3]Just as it did for the earlier television adaptation of Waugh's novel, Castle Howard in North Yorkshire serves as the setting for Brideshead. In The World of Brideshead, a bonus feature on the DVD release of the film, Simon Howard reveals his family was eager to welcome film crews to the estate once again. Given it became a major tourist attraction after the television serial aired, they hoped the feature film would renew interest in the property.Principal photography took place at Castle Howard during the summer of 2007, and many extras were employed from the local population in and around York.The ending of the film was also altered from that of the novel. In the film, Charles leaves the family chapel at Brideshead seemingly unchanged in his atheist/agnostic leanings, although he decides not to snuff out the candle that is burning. The novel ends with Charles entering the chapel and kneeling down to pray using \"ancient and newly learned words,\" thus implying he has recently converted to Catholicism.","produced_by":"Robert Bernstein|Kevin Loader|Douglas Rae|","starring":"Emma Thompson|Matthew Goode|Ben Whishaw|Hayley Atwell|Michael Gambon|","running_time":"133 minutes[1]","music_by":"Adrian Johnston","edited_by":"Chris Gill","Release":"The film opened on thirty-three screens in the United States on 25 July 2008 and grossed $332,000 on its opening weekend, ranking twenty-first at the box office. It eventually earned $6,432,256 in the US and $7,018,930 elsewhere for a total worldwide box office of $13,451,186.[2]Comparing the film to the earlier television adaptation, A.O. Scott of The New York Times called it \"necessarily shorter and less faithful to Waugh's book, and also, for what it's worth, more cinematic. It is also tedious, confused and banal.\" He blamed director Jarrold and screenwriters Davies and Brock \"for finding so little new or interesting to say . . . and for systematically stripping Waugh's novel of its telling nuances and provocative ideas.\" He concluded, \"The long experience of English Catholics as a religious minority, the subtle gradations of class in the British university system, the crazy quilt of sexual norms and taboos governing the lives of young adults: all of this is what makes Brideshead Revisited live and breathe as a novel. None of it registers with any force in this lazy, complacent film, which takes the novel's name in vain.\"[4]Roger Ebert of the Chicago Sun-Times observed, \"While elegantly mounted and well acted, the movie is not the equal of the TV production, in part because so much material had to be compressed into such a shorter time. It is also not the equal of the recent film Atonement, which in an oblique way touches on similar issues. But it is a good, sound example of the British period drama; mid-range Merchant-Ivory, you could say.\"[5]Mark Olsen of the Los Angeles Times said, \"The film's strengths are in Waugh's story and not so much in the particular spin of these filmmakers. Their decision to turn up the volume on the homosexual undertones between Sebastian and Charles feels like an unimaginative nod to our modern times . . . In Brideshead, Jarrold seems too often to consciously be making an in-quotation-marks classy picture, much like last year's Atonement, in which the costumes and setting are just so, but the human drama gets lost amid the pictorial pleasantries. That the film is neither a true triumph nor a total disaster makes it somewhat difficult to justify revisiting Brideshead, apart from the hope it will inspire someone somewhere to pick up the book.\"[6]David Wiegand of the San Francisco Chronicle called it \"a very noble movie, which makes it interesting at times, but not often enough . . . What Jarrold has done right is to hire Andrew Davies to work with Jeremy Brock on the adaptation. There's no one better at dusting off English classics for the wide and small screens than Davies. He and Brock have done a competent job of culling just the right plot elements from Waugh's book and assembling them into a serviceable story. Whether you want to stick it out, however, is another matter entirely . . . Jarrold and his writers are more than respectful of the original source material, but compressing it all into two hours and change doesn't make for a terribly enjoyable film . . . Davies and Brock perform miracles in making this somewhat workable, but the ultimate impossibility of their task shows at the end.\"[7]David Ansen of Newsweek suggested, \"Think of Jarrold's briskly paced, stylish abridgment as a fine introduction to Waugh's marvelously melancholy elegy. It brings these unforgettable characters to life again, and if it sends people back to the novel, and back to the classic TV series . . . all the better. There's room for more than one Brideshead in this far less glamorous day and age.\"[8]Owen Gleiberman of Entertainment Weekly graded the film B and commented, \"Brideshead Revisited is opulent and watchable, yet except for Thompson's acting, it's missing something – a grander, more ambivalent vision of the England it depicts dying out. In the series, we looked at that palatial fortress of Brideshead manor and thought: Here, in one house, is a fading empire. In the movie, it's just sublime real estate.\"[9]Dennis Harvey of Variety called the film \"finely wrought\" and added, \"Purists may blanch at the screenplay's changes to the source material's narrative fine points, but its spirit survives intact . . . Goode provides a fine center of gravity as the middle-class tourist in heady but toxic upper-class realms. Thompson superbly etches a complex, eventually tragic portrait in her relatively few scenes.\"[3]Geoffrey Macnab of The Independent rated the film three out of five stars and called it \"flawed and uneven.\" He added, \"In trying to shoehorn Waugh's novel into a two-hour movie, the film-makers have left characters underdeveloped while skipping over plot points and condensing material that surely requires greater exposition. Boldly – and perhaps rashly – they have almost entirely dispensed with voiceover narration. Anyone expecting an equivalent to Jeremy Irons' evocative reading of Waugh's prose will be disappointed . . . On the credit side, this Brideshead boasts a handful of very strong performances . . . Emma Thompson makes a formidable Lady Marchmain and Michael Gambon is dependable as ever as Lord Marchmain but this Brideshead is slow to build momentum. At first, it is hard to engage emotionally in a story that leaps around in time and skirts over what should be key events, but the film grows progressively stronger and more moving.\"[10]Swedish journalist Johan Hakelius called the film something that \"turns the message of the book upside-down\" and felt that it seemed \"to be directed by Polly Toynbee or some other reader of the Guardian.\"[citation needed]The film was released on DVD in anamorphic widescreen format, with subtitles in English for the hearing impaired and Spanish, on 13 January 2009. Bonus features include commentary by director Julian Jarrold, producer Kevin Loader, and screenwriter Jeremy Brock, deleted scenes, and The World of Brideshead, featuring interviews with cast and crew members.","budget":"$20 million"}