{"country":"United States","distributed_by":"Columbia Pictures","desperado":"Theatrical release poster","Plot":"At the Tarasco bar in Mexico, an American man tells the story of how he witnessed a massacre in another bar committed by a Mexican with a guitar case full of guns. The bar's patrons are uninterested until the American mentions the name \"Bucho\". Meanwhile, El Mariachi has a dream of his encounter with Moco, Bucho's underling, who killed his lover dead and shot his left hand. He is awakened by the American, who tells him to continue his search for Bucho at the bar.El Mariachi meets a child, who allegedly plays guitar for a living. He gives the boy some pointers. At the Tarasco bar, El Mariachi engages in a tense standoff with Bucho's goons before a massive gunfight erupts. He kills everyone in the bar, but Tavo, who was in a back room earlier, survives and follows him outside. On the street, Tavo wounds El Mariachi before being killed himself. Carolina, the woman who El Mariachi shields from Tavo's bullets, takes him to her bookstore. Bucho arrives at the bar to survey the carnage. Paranoid, Bucho orders his men to hunt down the man \"dressed in black\".In the bookstore, Carolina tends to El Mariachi's wounds. While he rests, she discovers the guns in his guitar case and realizes who he is. El Mariachi asks her to help him find Bucho. He goes to the town church and talk to the American. Upset by the massacre at the bar, The American convinces El Mariachi to give up his quest for blood. Outside the church, a man armed with throwing knives ambushes them, kills The American and severely wounds El Mariachi. Bucho's men arrive at the scene, mistake the man (who dresses in black) for El Mariachi and kill him. They take the body back to Bucho, who realizes they have killed the wrong person, a hit-man named Navajas sent by the Colombians to kill El Mariachi.As El Mariachi wanders through the streets, he meets the kid with the guitar. He learns that the kid is being used by his father to mule drugs hidden in his guitar. He angrily confronts the boy, who tells him most people in the town works for Bucho. El Mariachi returns to Carolina and learns that Bucho paid to build her bookstore as another front for his drug-dealing. Unexpectedly, Bucho pays her a visit, and she hastily hides El Mariachi. She feigns ignorance of the commotion in town, and Bucho leaves. Carolina finishes stitching up El Mariachi's wounds. That evening, Carolina gives El Mariachi a new guitar, he plays for her before they make passionate love. Meanwhile, Bucho realizes that Carolina lied to him.In the morning, Bucho's men arrive and attack them while setting the bookstore ablaze. The two fight their way out of the burning building and onto a local rooftop, where El Mariachi gets a clear shot at Bucho but suddenly refuses to kill him. The two take refuge in a hotel room.Bucho gathers his men and tells them to kill anyone they see in town that they don't know. Realizing that Bucho will never stop hunting them, El Mariachi calls his friends Campa and Quino in to help. The trio meet up on the edge of town and encounter Bucho's goons. A massive gun battle ensues, and most of Bucho's goons along with Campa and Quino are killed. El Mariachi sees the kid wounded in the crossfire and rushes him to a hospital.El Mariachi and Carolina head over to Bucho's compound to confront him directly. It is then revealed that Bucho and El Mariachi are brothers. Bucho offers to let El Mariachi go if he lets Bucho kill Carolina. El Mariachi kills his brother, then shoots his way out of the compound. The two visit the boy in the hospital, and El Mariachi leaves on his own. Carolina catches up to him on the road and picks him up, with El Mariachi initially leaving his weapons on the side of the road. The two drive away together, but shortly return and pick up the guitar case full of guns.","language":"English|Spanish|","Reception":"Rotten Tomatoes, a review aggregator, reports that 62% of 39 surveyed critics gave the film a positive review; the average rating is 6.4/10.[10] Todd McCarthy of Variety wrote that the film \"could scarcely be more dazzling on a purely visual level, but it's mortally anemic in the story, character and thematic departments.\"[6] Owen Gleiberman of Entertainment Weekly rated the film \"B\" and praised the action sequences despite the lack of characterization.[11] Janet Maslin of The New York Times wrote, \"Overdependence on violence also marginalizes Desperado as a gun-slinging novelty item, instead of the broader effort toward which this talented young director might have aspired.\"[12] Roger Ebert of The Chicago Sun-Times rated it 2/4 stars and wrote, \"What happens looks terrific. Now if he can harness that technical facility to a screenplay that's more story than setup, he might really have something.\"[13] Desson Howe of The Washington Post wrote, \"[T]he commercial transition has been remarkably successful. This is primarily thanks to Rodriguez, who not only retains the original movie's kinetic flair, but takes it further.\"[14] Bob McCabe of Empire rated it 4/5 stars and wrote, \"It's big, it's daft, but Desperado is confident and hugely entertaining filmmaking.\"[15] Heidi Strom of the Daily Press wrote, \"A pure adrenaline rush from start to finish, \"Desperado\" will shock, amuse, thrill and disgust – but never disappoint.\"[5]","box_office":"$25.4 million[3]","cinematography":"Guillermo Navarro","production_company":"Los Hooligans Productions","directed_by":"Robert Rodriguez","release_dates":"August 25, 1995 (1995-08-25)|||||","Production":"Rodriguez's friend Quentin Tarantino has a cameo as \"Pick-up Guy\". Carlos Gallardo, who played the title role of El Mariachi, appears in Desperado as Campa, a friend to Banderas' Mariachi.[5] Since Banderas replaced Gallardo as the actor for the main character, the filmmakers re-shot the final showdown from El Mariachi as a flashback sequence for Banderas' character in Desperado.[6]Raúl Juliá was originally cast as Bucho but died before production began on October 24, 1994.[7]Principal photography took place entirely in Ciudad Acuña, Mexico, across from Del Rio, Texas.[7]After it was submitted to the Motion Picture Association of America, the film was granted an NC-17 due to graphic violence and it had to be severely cut for an R rating. Among the scenes that were trimmed are the deaths of Tarantino's character and his friend at the bar, as well as Trejo's character.[8] By far the most major excision came at the end of the film, which originally contained a large-scale shootout between El Mariachi, Carolina, Bucho, and his thugs at Bucho's mansion. However, owing to the amount of footage the MPAA demanded be removed from the scene, Rodriguez elected to remove the sequence in its entirety, giving the film its current fade-out ending.[8] Two additional scenes were also deleted featuring the codpiece gun (seen in the guitar case). Originally, the gun was used by El Mariachi during the second bar shootout when he uses it to shoot the first thug before whipping out his pistols from his sleeves and finishing him off. In a second deleted scene, the crotch gun was to go off accidentally while Banderas is in bed with Hayek, blowing a hole through the guitar while they were playing it.[8] The gun was eventually used in unrelated Rodriguez's films From Dusk till Dawn and Machete Kills.The film's score is written and performed by the Los Angeles rock band, Los Lobos, performing Chicano rock and traditional Ranchera music. Their performance of \"Mariachi Suite\" won the Grammy Award for Best Pop Instrumental Performance at the 1995 Grammy Awards.[9] Other artists on the soundtrack album include Dire Straits, Link Wray, Latin Playboys, and Carlos Santana. Musician Tito Larriva has a small role in the film, and his band, Tito & Tarantula, contributed to the soundtrack as well.","produced_by":"Robert Rodriguez|Bill Borden|","starring":"Antonio Banderas|Joaquim de Almeida|Salma Hayek|Steve Buscemi|Cheech Marin|Quentin Tarantino|","running_time":"105 minutes[1]","music_by":"Los Lobos","edited_by":"Robert Rodriguez","written_by":"Robert Rodriguez","budget":"$7 million[2]"}