{"country":"United States","another_cinderella_story":"DVD cover","distributed_by":"Warner Premiere","Plot":"This film is a retelling of the Cinderella fairy tale in a modern setting, with Mary Santiago (Selena Gomez), a high school student with ambitions of becoming a dancer, taking the role of Cinderella; Tami (Jessica Parker Kennedy) Mary's only friend as the fairy godmother; Dominique Blatt (Jane Lynch) taking the role of the stepmother, even though she is just her legal guardian and Mary's mother was one of Dominique's dancers when she died and took Mary in as her legal guardian and make her Dominique's slave; Britt (Emily Perkins) and Bree (Katharine Isabelle) as the two stepsisters; and Joey Parker, (Drew Seeley), now a famous celebrity that has returned to school for his senior year and to remember why he started dancing, as Prince Charming. A school dance substitutes for the ball, with the role of the glass slipper filled by a Zune.[2]","language":"English","Reception":"Amber Wilkinson of Eye for Film gave the film, four out of five stars and praised the musical aspects, saying that \"the song and dance numbers are so well-handled and catchy, it's a shame there aren't more of them.\" However, she also said that the \"characters are so wafer thin they barely cast a shadow.\"[3] While Wilkinson says that the film is completely different from A Cinderella Story, Lacey Walker, reviewing for Christian Answers, notes several aspects of the two films that were directly parallel to each other. Walker also gave it three out of five stars, praising the script, saying the writers \"peppered this story with a surprising dose of humor and some pleasing plot twists.\" However, Walker specifically criticized the \"glaringly obvious\" age difference between the 15-year-old Gomez and the 25-year-old Seeley.[4]ABC Family presented the television premiere of the film on January 18, 2009.[5] The premiere was watched by 5.3 million viewers[citation needed].","cinematography":"Jon Joffin","directed_by":"Damon Santostefano","release_dates":"September 16, 2008 (2008-09-16)","Production":"The film was shot in Vancouver, British Columbia, Canada from November to December 2007.[citation needed] The school scenes took place at Sullivan Heights Secondary in Surrey, British Columbia.[citation needed]","produced_by":"Dylan Sellers","starring":"Selena Gomez Drew Seeley Jane Lynch Emily Perkins Katharine Isabelle Jessica Parker Kennedy Marcus T. Paulk Nicole LaPlaca","running_time":"92 minutes","music_by":"John Paesano","edited_by":"Tony Lombardo","written_by":"Erik Patterson Jessica Scott"}