{"country":"UK","Plot":"Harry Jones (Secombe) is a clerk in Mr. Crab's general mercantile store and an amateur actor in community theatre, where he is currently playing a Scotland Yard inspector, \"Batts of the Yard\". When the absentminded Prof. Osrick Purehart (Bentine) leaves a secret military formula in the store, mayhem ensues as two suspicious secret agents, who have been shadowing the professor, question Harry regarding the formula.In an attempt to return the formula to the professor, Harry goes to an Army post, Camp Warwell, where he is mistakenly enlisted in the Z Men, ostensibly an elite unit guarding atomic secrets but in reality a ragtag group of reservists, retreads, and others of marginal (at best) competence. A pair of enemy spies kidnap an adjutant newly assigned to the camp. One of the spies then impersonates him at Camp Warwell.The post’s commander, Colonel Bloodnok (Sellers), has been assigned for security purposes a supposed \"daughter\" (Carole Carr) who is actually a female MI5 operative. Harry soon becomes smitten with the \"daughter,\" and they work together to foil an attempt by the secret agents to purloin Prof. Pureheart’s formula.[1]","language":"English","cinematography":"Geoffrey Faithfull","directed_by":"Maclean Rogers","release_dates":"1952 (1952)|||||","Production":"Down Among the Z Men is the only film starring all four Goons; Bentine was absent from the 1951 Penny Points to Paradise. In the film, Bentine, Milligan and Sellers repeated their radio characters, whereas Secombe’s Neddy Seagoon was replaced with a less-raucous Harry Jones.[2]The production was shot over a two-week shooting schedule. Milligan, who wrote most of the radio scripts for the Goons, had no role creating in the film’s screenplay. Bentine would later tell an interviewer that film’s lack of financing required director Maclean Rogers to only permit one take per scene. Rogers, however, incorporated two dance numbers into the film featuring showgirls as female soldiers practicing for a talent show.[3]","produced_by":"E. J. Fancey","starring":"Peter Sellers Harry Secombe Spike Milligan Michael Bentine Carole Carr Graham Stark","running_time":"75 min.","music_by":"Jack Jordan","edited_by":"Peter Mayhew","Release":"Down Among the Z Men was not a commercial success in Great Britain. Since The Goons were unknown in the United States at the time, there was no theatrical release to the American market. Years later, after Sellers became a major film star, bootleg 16mm prints of the film began to turn up in the U.S., sometimes under the new title The Goon Show Movie.[3]","written_by":"Francis Charles Jimmy Grafton"}