{"Cast":"On the DVD commentary, Boyle explains that, with the aim of preserving the suspension of disbelief, relatively unknown actors were cast in the film. Cillian Murphy had starred primarily in small independent films, while Naomie Harris had acted on British television as a child, and Megan Burns had only one previous film credit. However, Christopher Eccleston and Brendan Gleeson were well-known character actors.","country":"United Kingdom","distributed_by":"Fox Searchlight Pictures","Legacy":"A sequel, 28 Weeks Later, was released on 11 May 2007.[19] Danny Boyle and Alex Garland took producing roles alongside Andrew Macdonald. The plot revolves around the arrival of American troops about seven months after the incidents in the original film, attempting to revitalise a nearly desolate Britain. The cast for this sequel includes Robert Carlyle, Rose Byrne, Jeremy Renner, Imogen Poots, Harold Perrineau, Catherine McCormack, Mackintosh Muggleton, and Idris Elba.In March 2007, Danny Boyle claimed to be interested in making a third film in the series, 28 Months Later.[20]Fox Atomic Comics, in association with HarperCollins, released a graphic novel bridging the time gap between 28 Days Later and 28 Weeks Later, titled 28 Days Later: The Aftermath, written by Steve Niles.28 Days Later, a comic sequel also linking Days and Weeks and produced by Fox Atomic (until its demise) and Boom! Studios, began production in 2009. The series focuses on Selena and answers questions about her in the film and her sequel whereabouts.[21]","Plot":"In Cambridge, three animal liberation activists break into a medical research laboratory. A scientist in the lab desperately warns them against releasing the captive chimpanzees, which are infected with a highly contagious rage-inducing virus. Ignoring his pleas, the activists release a chimp, which infects a female activist. She then attacks and infects everyone else present.28 days later, in London, Jim (Cillian Murphy), a bicycle courier, awakens from a coma in St Thomas' Hospital. He finds the entire hospital deserted. He wanders the streets of London, finding it deserted as well, with signs of catastrophe everywhere. Jim enters a church and finds a priest, who turns out to be infected. Jim flees, attracting attention of more infected, but Selena (Naomie Harris) and Mark (Noah Huntley) rescue him. At one of their safehouses, they explain to Jim that while he was in a coma, a virus spread among the populace, resulting in societal collapse. They claim the virus has been reported in Paris and New York City as well, suggesting the infection has spread worldwide.The next day, Selena and Mark accompany Jim to his parents' house in Deptford, where he discovers they committed suicide in bed together. That night, the three are attacked by more infected. Mark is bitten, and Selena viciously kills him. She curtly explains that the virus spreads through blood and saliva and overwhelms its victims in 10 to 20 seconds. She warns that should Jim become infected, she will kill him \"in a heartbeat\". The two see some blinking Christmas lights from Balfron Tower and head there. They discover two more survivors – cab driver Frank (Brendan Gleeson) and his daughter Hannah (Megan Burns) – who allow them to take shelter. The next day, Frank informs them that their supplies – particularly water – are dwindling. He plays them a pre-recorded radio broadcast from a military blockade near Manchester, claiming they have \"the answer to infection\" and promises to protect any survivors who reach them.The group board Frank's cab and head to Manchester, bonding with one another throughout the trip. At the deserted blockade, Frank is infected when a drop of blood falls into his eye. He is killed by the arriving soldiers, who take the remaining survivors to a fortified mansion under the command of Major Henry West (Christopher Eccleston). West reveals to Jim that his \"answer to infection\" entails waiting for the infected to starve to death and luring female survivors into sexual slavery, to repopulate the world. The group attempts to flee, but Jim is captured and chained next to Sergeant Farrell (Stuart McQuarrie), a dissenting soldier. Farrell shares with Jim his speculation that the virus has not spread beyond Great Britain and that the country is simply being quarantined.The next day, the girls are prepared for gang-rape, while two soldiers lead Jim and Farrell to execution. When his executors argue after killing Farrell, Jim escapes and spots a NATO aircraft flying overhead, proving Farrell's theory correct. Jim lures West and another soldier to the blockade, where Jim kills the latter and leaves West stranded for arriving infected. He runs back to the mansion and releases Mailer, an infected soldier West kept for observation. Mailer quickly spreads the infection among the soldiers in the mansion. In the confusion, a soldier drags Selena to the top floor to rape her, but Jim interrupts and brutally kills him. The two reunite with Hannah and run to Frank's cab. Jim is shot by West, who has been waiting inside the cab. Hannah reverses the cab towards Mailer, who grabs West through the rear window and kills him. The trio finally leave the mansion.Another 28 days later, Jim is recovering at a remote cottage. Downstairs, he finds Selena sewing large swaths of fabric when Hannah appears. The three rush outside and unfurl a huge cloth banner, adding the final letter to the word \"HELLO\" laid out on the meadow. A lone Finnish jet flies over the landscape, and the infected are shown dying of starvation. The film ends with the jet flying over the three survivors and the pilot calling in a rescue helicopter.","language":"English","Reception":"28 Days Later was a considerable success at the box office and became highly profitable on a budget of about £5 million. In the UK, it took in £6.1 million, while in the US it became a surprise hit, taking over $45 million despite a limited release at fewer than 1,500 screens across the country. The film garnered around $84.7 million worldwide.Critical views of the film were very positive. Based on 215 reviews collected by the film review aggregator Rotten Tomatoes, 87% of critics gave 28 Days Later a positive review.[9] On Metacritic, the film received a rating of 73 (out of 100) based on 39 reviews.[10]Bravo awarded it the 100th spot on their list of The 100 Scariest Movie Moments with the commentators explaining that making the zombies move fast for the first time was a bright and effective idea.[11][when?] In 2007, Stylus Magazine named it the second best zombie movie of all time.[12] The film also ranked at number 456 in Empire's 2008 list of the 500 greatest movies of all time.[13] Bloody Disgusting ranked the film seventh in their list of the Top 20 Horror Films of the Decade, with the article saying \"Zombie movie? Political allegory? Humanist drama? 28 Days Later is all of those things and more – a genuine work of art by a director at the top of his game. What's so amazing about the film is the way it so expertly balances scenes of white-knuckled, hell-for-leather horror with moments of intimate beauty.\"[3]","box_office":"$84.7 million[1][2]","cinematography":"Anthony Dod Mantle","production_company":"DNA Films UK Film Council","directed_by":"Danny Boyle","Music":"The film's score was composed by John Murphy and was released in a score/song compilation in 2003. It also features notable tracks from Brian Eno, Grandaddy, and Blue States.A heavily edited version of the song \"East Hastings\" by the post-rock band Godspeed You! Black Emperor appears in the film, but the track is excluded from the soundtrack, because Boyle could only obtain the rights to use it in the film.[17]28 Days Later: The Soundtrack Album was released on 17 June 2003. A modified version of the soundtrack \"In The House – In A Heartbeat\" was used as the character Big Daddy's theme in the 2010 film Kick-Ass. The same song was played in the latest advertisement campaign of Louis Vuitton, L'Invitation au Voyage.[18]","release_dates":"1 November 2002 (2002-11-01) (United Kingdom)|||||","Production":"After director Danny Boyle and producer Andrew Macdonald filmed an adaptation of Alex Garland's novel The Beach, Garland approached Macdonald about his concept for 28 Days Later. In an interview with Creative Screenwriting, Garland explained, \"I said to him that I had an idea for a movie about running zombies. I wrote it and sent it to him and the two of us went backwards and forwards with it for a few drafts... At the point I was working on 28 Days Later I had a lot of zombie movies as well as video games like Resident Evil turning round in my head.\"[5]28 Days Later features scenes set in normally bustling parts of London such as Westminster Bridge, Piccadilly Circus, Horse Guards Parade and Oxford Street. To depict these locations as desolate, the film crew closed off sections of street for minutes at a time, usually in early morning before sunrise on Sundays and would have typically around 45 minutes after dawn, to shoot the locations devoid of traffic and members of the public – to minimise disruption. Portions of the film were shot on a Canon XL1 digital video camera.[6] DV cameras are much smaller and more manoeuvrable than traditional film cameras, which would have been impractical on such brief shoots. The scenes of the M1 motorway devoid of traffic were also filmed within very limited time periods. A mobile police roadblock slowed traffic sufficiently, to leave a long section of carriageway empty while the scene was filmed. The section depicted in the film was filmed at Milton Keynes, nowhere near Manchester.[citation needed] For the London scene where Jim walks by the overturned double-decker bus, the film crew placed the bus on its side and removed it when the shot was finished, all within 20 minutes.[citation needed] Much of the filming took place prior to the 11 September attacks and in the audio commentary, Boyle notes the parallel between the \"missing persons\" flyers seen at the beginning of the film and similar flyers posted in New York City in the wake of the attacks. Boyle adds that his crew probably would not have been granted permission to close off Whitehall for filming after the terrorist attacks in New York. A clapperboard seen in one of the DVD extra features shows filming was still taking place on 8 October 2001.The mansion used in the film was Trafalgar Park near Salisbury. Many rooms in the house, including the Cipriani-painted music room and the main hall, were filmed with minimal set decoration. The scenes occurring upstairs were filmed downstairs, as the mansion's owner resided upstairs.[citation needed] The old ruins used as the setting for an idyllic interlude in their journey to Manchester, were those of Waverley Abbey, Surrey. The end scenes of the film where Jim, Selena and Hannah are living in a rural cottage were filmed around Ennerdale in Cumbria.[7] This reflects the motorway road signage in the film which indicates the trio heading north towards the Lake District National Park.On the DVD commentary, Boyle and Garland frequently call it a post apocalypse and horror film, commenting on scenes that were quotation of George A. Romero's Dead trilogy. During the initial marketing of the film Boyle did try to distance the film from such labels. Boyle identified John Wyndham's The Day of the Triffids as Garland's original inspiration for the story.[8]","produced_by":"Andrew Macdonald","starring":"Cillian Murphy|Naomie Harris|Christopher Eccleston|Megan Burns|Brendan Gleeson|","running_time":"113 minutes[1]","28_days_later":"UK release poster","Alternative endings":"The DVD extras include three alternative endings, all of which conclude with Jim dying except for the radical ending. Two were filmed, while the third, a more radical departure, was presented only in storyboards. On 25 July 2003, cinemas started showing the alternative ending after the film's credits.[4]In this ending, after Jim is shot, Selena and Hannah still rush him to the deserted hospital, but the scene is extended. Selena, with Hannah's assistance, attempts to perform life-saving procedures but cannot revive Jim. Selena is heartbroken and Hannah, distraught, looks to her for guidance. Selena tells Hannah they will go on; they pick up their guns and walk away from Jim's lifeless body. Selena and Hannah, still dressed in ballgowns and fully armed, leave the hospital.On the DVD commentary, Boyle and Garland explain that this was the original ending of the film's first cut, which was tested with preview audiences. It was rejected for seeming too bleak; the final exit from the hospital was intended to imply Selena and Hannah's survival, whereas test audiences felt the women were marching off to certain death. Boyle and Garland express a preference for this alternative ending, calling it the \"true ending\". They comment that this ending brought Jim full circle, as he starts and finishes the story in bed in a deserted hospital. This ending was added in the theatrical release of the film beginning on 25 July 2003, placed after the credits and prefaced with the words, \"what if...\"[4]The \"Hospital Dream\" ending is an extended version of the theatrical alternative ending, wherein Jim dies at the hospital. It is revealed by the director during the optional commentary that this was the full version of the original ending. Jim dreams while unconscious and remembers the final moments on his bicycle before the crash. The footage cuts back and forth between the scene with Selena and Hannah trying to save his life, and the dream sequence. As he gets hit by a car in his flashback, he simultaneously dies on the operating table.This ending, for which only a rough edit was completed, is an alternative version of the potential rescue sequence shown at the very end of the released film. Here, the scenes are identical, except that this ending was intended to be placed after the first alternative ending wherein Jim dies, so he is absent. When Selena is sewing one of the banner letters in the cottage, she is seen facetiously talking to a chicken instead of Jim. Only Selena and Hannah are seen waving to the jet flying overhead in the final shots.The \"Radical Alternative Ending\", rather than a bare ending, is a radically different development of the movie from the midpoint; it was not filmed and is presented on the DVD as a series of illustrated storyboards with voiceovers by Boyle and Garland. When Frank is infected at the military blockade near Manchester, the soldiers do not enter the story. Instead, Jim, Selena, and Hannah are somehow able to restrain Frank, hoping they will find a cure for the virus nearby as suggested in the radio broadcast. They soon discover that the blockade had protected a large medical research complex, the same one featured in the first scene of the film where the virus was developed. Inside, the party is relieved to find a scientist barricaded inside a room with food and water. He will not open the door because he fears they will take his food, although he does admit that the \"answer to infection is here\". Unfortunately, he refuses to talk further because he does not want to create an emotional attachment to people who will soon be dead. After hours of failed attempts to break through the door or coax the man out, Jim eventually brings Hannah to the door and explains Frank's situation.The scientist reluctantly tells them Frank can only be cured with a complete blood transfusion and supplies them with the equipment. After learning that he is the only match with Frank's blood type, Jim sacrifices himself so Frank can survive with his daughter. Just as his journey began, Jim is left alone in the abandoned medical facility, and Selena, Hannah and Frank move into the room with the scientist, as a horde of the infected breaches the complex. The computer monitors show death and destruction come to life around a thrashing, infected Jim, who is strapped to the same table as the chimp had been, in the opening scene. Garland and Boyle explain that they conceived this ending to see what the film would be like if they did not expand the focus beyond the four survivors. They decided against it because the idea of a total blood replacement as a cure was not credible. Boyle said in the DVD commentary that it \"didn't make much sense\", since the film had already established that one drop of blood can infect a person. \"What would we do? Drain him of blood and scrub his veins with bleach?\"","music_by":"John Murphy","edited_by":"Chris Gill","written_by":"Alex Garland","budget":"$8 million[1]"}