{"Plot":"Michele Apicella (Nanni Moretti) is a young mathematics teacher who is called to a supposedly élite, in fact grotesque, high school with the overblown name of Marilyn Monroe. Michele is characterized by a great number of obsessions and manias (in a famous scene, he wakes up at night and starts eating Nutella from a giant jar); he also has a habit of spying on the neighbours of his new house, keeping a file for each of them, in which he reports their actions and words. When one of his neighbours is killed, the police inspector (Roberto Vezzosi) becomes curious about Apicella's behaviour. Later he meets his colleague Bianca (Laura Morante), whom he falls in love with. In the beginning, she is a relation, which she ends shortly after in order to get to know him. However, his exceedingly orderly mind and manias for perfection of love prevent him from showing her his true feelings; therefore, their affair starts to suffer.Another sub-plot is devoted to Michele's attempts to reconcile his friends Ignazio and Maria. But he fails, and the two are also found killed. Although the police now clearly suspect him, he is rescued by Bianca, who gives Michele a false alibi.However, Michele's equilibrium at this point is completely crumbling. In the final scenes, he himself confess to the inspector that he is the murderer. In a semi-delirious and humorous self-confession (somewhat reminiscent of the last pages of Dostoevsky's Crime and Punishment), Michele reveals that he felt compelled to kill his neighbours and friends because they had disappointed him, and this disturbs his need for order and steadiness in life.","language":"Italian","cinematography":"Luciano Tovoli","production_company":"FasoFilm/ReteItalia","directed_by":"Nanni Moretti","Themes in Moretti's other works":"\"Michele Apicella\" is the nom-de-plume used by Nanni Moretti for his roles in all his films (except The Mass Is Ended (1985)) until Palombella rossa of 1989. Another recurrent theme of Moretti's film, the Sacher torte, which is also present in Bianca.","release_dates":"1984","Production":"Songs in the film include \"Insieme a te non ci sto più\" (sung by Caterina Caselli), \"Il cielo in una stanza\" by Gino Paoli and \"Scalo a Grado\" by Franco Battiato.The school psychologist is played by Luigi Moretti, Nanni's father.In the Marilyn Monroe school, the traditional portraits of the President of the Italian Republic in the rooms are replaced by that of football goalkeeper Dino Zoff.","starring":"Nanni Moretti Laura Morante Roberto Vezzosi Remo Remotti Vincenzo Salemme","running_time":"96 minutes","music_by":"Franco Piersanti","External links":"","written_by":"Nanni Moretti Sandro Petraglia"}