{"country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Bob Williams Christopher Knopf","20_million_miles_to_earth.":"50th Anniversary DVD cover","Plot":"Off the coast of a small Sicilian fishing village, two fishermen watch in amazement as a spaceship pierces the skies and crashes into the sea. The men, Mondello (Don Orlando) and Verrico (George Khoury), row out to the site and pull two space travelers from the capsized craft before it shudders and sinks into the sea. Meanwhile, in Washington, D.C., Major General A. D. McIntosh (Thomas Browne Henry) discovers that the government's missing spacecraft, piloted by Colonel Bob Calder (William Hopper), has been located off the coast of Italy. As McIntosh flies to Italy, Pepe (Bart Braverman), a little boy who lives in the fishing village of Gerra, finds a metal capsule that has washed up on the beach. Upon opening the capsule, he finds a jelly-like glob inside and sells it to Dr. Leonardo (Frank Puglia), a visiting zoologist who is studying sea creatures. Meanwhile, Leonardo's medical-student granddaughter Marisa (Joan Taylor) is summoned to town to take care of the injured Calder and his companion, Dr. Sharman. When Calder regains consciousness, he finds Sharman in the last throes of the fatal disease that decimated his crew.That night, after Marisa returns home to the trailer that she shares with her grandfather, a small creature hatches from the glob and Leonardo locks it in a cage. By morning, the creature has tripled in size, and McIntosh arrives in Gerra, accompanied by government scientist Dr. Justin Uhl, and meets with Calder and Signore Contino, a representative of the Italian government. As Leonardo and Marisa hitch up the trailer containing the creature to their truck and head for Rome with their discovery, McIntosh informs the astonished Contini that Calder has just returned from Venus. Calder's spacecraft, crippled by a meteor, carried a sealed metal container bearing an unborn species of animal life from the planet. As police divers begin to search for the capsule, McIntosh offers a reward for its recovery, prompting Pepe to come forward and lead them to the empty container. When Pepe tells them that he sold its contents to Leonardo, who is currently on his way to Rome, McIntosh and Calder pursue him.That night, when Leonardo stops the trailer, he discovers that the creature has grown to the size of an adult human. Soon after the creature breaks out of his cage and flees, Calder and the others arrive. Confused, the beast blunders onto a nearby farm, terrorizing the animals. It is revealed that the creature, known as the Ymir, eats sulfur as it rips open several bags. While it is feeding, the Ymir encounters the farmer's dog and kills it, alerting the farmer. The farmer is about to attack it when Calder and the others reach the barn. After trapping the Ymir in the barn, Calder explains that the Ymir is not dangerous unless provoked. However, the Ymir proves virtually impossible to prod into a cage, and kills the farmer when he stabs it with a pitchfork as it tries to escape. When the creature breaks out of the barn and disappears into the countryside, the commissario of police insists that it be destroyed, but Calder pleads with him to reconsider.After the Italian government grants Calder permission to track and capture the creature, he devises a plan to subdue it by ensnaring it in a giant electric net dropped from a helicopter. The Italian police, meanwhile, conduct their own pursuit, shooting at the creature with flamethrower guns. Aware that sulfur is the creature's food of choice, Calder uses the mineral as bait, luring it to a secluded site and then subduing it with an electric jolt from the net. Later, at the American Embassy in Rome, McIntosh briefs the press corps on the situation and allows three reporters to view the creature, which is incarcerated at the Rome zoo. There, Calder explains to the reporters that the Ymir has been incapacitated by a strong anesthetic, thus allowing the scientists to study it. Marisa, who is there aiding her uncle, begins to flirt with Calder. Suddenly, the electrical equipment shorts out, releasing the creature from its stupor.Now in gargantuan size, the Ymir breaks free and enters into combat with an elephant, sending the panicked zoo visitors scurrying for their lives. As the rampaging beasts go into the streets of Rome, they destroy cars and inflict massive damage to the city. The Ymir eventually defeats the elephant and continues to rampage through the city. Calder tracks the creature to the River Tiber, where it submerges. When the military lobs bombs at the submerged creature, the Ymir surfaces, bursts through a bridge and heads for the Colosseum. It destroys an ancient temple, in which pieces rain down and kill many soldiers. As the Ymir disappears into the vast cavern of the Colosseum, Calder charges it with a group of bazooka-firing soldiers, driving it to the top of the ruins. It tears down a few pieces of brickwork at the soldiers but Calder scores a direct hit with his own bazooka. After Calder fires a second time and scores another critical hit, the creature tumbles to its death on the ground below, after which a relieved Marisa runs into Calder's arms.","language":"English","cinematography":"Irving Lippman Carlo Ventimiglia","production_company":"Morningside Productions","directed_by":"Nathan H. Juran","narrated_by":"William Woodson","release_dates":"June 1957 (1957-06)|||||","Production":"20 Million Miles to Earth was in production in Rome, Italy in September 1956, using only William Hopper of the main cast, and in the U.S. from October 30 to November 9 of that year.[2] Rome was chosen as the location for filming because Harryhausen wanted to vacation there.[3] The working title of the film was The Giant Ymir,[4] and it has also been released as The Beast from Space. In the released version of the film, the creature is never referred to by name, as Harryhausen was concerned that audiences might confuse \"Ymir\" with the Arabic title \"Emir\".Ray Harryhausen wanted the film to be shot in color, but the filmmakers were not given a budget large enough to accommodate color film. In 2007, five years after the death of the film's director, Harryhausen worked with restoration and colorization company Legend Films to create a colorized version of the film. That version, along with the original theatrical black-and-white version, was released as part of a 50th Anniversary Edition of the film on July 31, 2007.[5][6]","produced_by":"Charles H. Schneer","starring":"William Hopper Joan Taylor Frank Puglia","running_time":"82 minutes","music_by":"Mischa Bakaleinikoff","edited_by":"Edwin Bryant","written_by":"Charlotte Knight Ray Harryhausen[1]"}