{"distributed_by":"Paramount Pictures","kids_in_the_hall:_brain_candy":"Theatrical release poster","language":"English","Reaction":"The film opened to a lukewarm critical reception. Siskel and Ebert were split, and had a heated disagreement over Brain Candy on their weekly review show: Gene Siskel found the movie \"audacious, clever, very funny\" and predicted it would become a midnight cult film; Roger Ebert claimed that he did not laugh once during the screening and found it \"awful, terrible, dreadful, stupid, idiotic, unfunny, labored, forced, painful, bad.\"[6][7] Janet Maslin of The New York Times called it \"[nothing] more than a sloppy showcase for the group's costume-changing tricks.\" Edward Guthmann at The San Francisco Chronicle, however, called Brain Candy \"a splendid showcase for their diverse, frisky talents.\" It maintains a 38% rating on Rotten Tomatoes.[8]The film suffered poor box office returns. The Kids themselves have expressed mixed feelings over the finished product, most notably on the behind-the-scenes DVD of their 2000 tour, Same Guys, New Dresses. The troupe took a four year hiatus after Brain Candy's release, though the break-up was already in motion even before filming was underway.[9]","box_office":"$2,654,308","cinematography":"David A. Makin","production_company":"Lakeshore Entertainment","directed_by":"Kelly Makin","Soundtrack":"A soundtrack album was released the Tuesday prior to the film's release. It consists of music from the film, interspersed with dialog.","Premise and characters":"The five-man team plays all of the major characters, and many of the bit parts. The film was written by four of the five members of the troupe, along with Norm Hiscock; the troupe's fifth member, Dave Foley, was busy filming NewsRadio during the writing sessions. Brendan Fraser and Janeane Garofalo have cameos in the film, Garofalo's being almost entirely absent from the final cut.The film is about the introduction of a powerful antidepressant, GLeeMONEX. The drug is rushed into production to help the ailing Roritor Pharmaceuticals and becomes an overnight media sensation. Those involved in the early stages of GLeeMONEX – the scientists, marketing arm and several early users – are followed, right up through the troubling coma-like side effect of being stuck in their happiest memory.Some characters from the television series appear briefly in Brain Candy. Among those who do are the \"white trash couple,\" the cops, Cancer Boy (see below), talk show host Nina Bedford (introduced in the show as \"Nina Spudkneeyak\"), Raj & Lacey, Melanie, Bellini, and the bigoted cab driver (who narrates the film).","release_dates":"April 12, 1996 (US) November 8, 1996 (UK) March 12, 1997 (France)","produced_by":"Lorne Michaels","starring":"Dave Foley Bruce McCulloch Kevin McDonald Mark McKinney Scott Thompson","running_time":"89 minutes","Alternate title and ending":"An original working title for the movie was The Drug, which is what GLeeMONEX is extensively referred to during the course of the film (in fact, \"Brain Candy\" is never actually heard in the film). Bruce McCulloch came up with Brain Candy at the studio's request for something more marketable.Two endings were filmed, with the relatively more upbeat conclusion making the final cut. In the alternate version, Dave Foley plays a crazed activist who leads a militant movement against GLeeMONEX. Chris Cooper, unable to cope with the mayhem his drug has created, decides to take it himself, and ends up lapsing into a coma. The unused ending has not been officially released, but a leaked work print was widely traded among fans on the internet during the late 1990s.","Controversy":"Two of the film's characters created minor waves in the media before its release. The first was Don Roritor, which many took to be a jab at producer Lorne Michaels.[1][2] Michaels is famous for creating Saturday Night Live, and was responsible for bringing the Kids in the Hall to television. He is also known for a demeanor that some interpret as detached, and Mark McKinney mirrors his speech patterns almost exactly as the cold-hearted Roritor. However, Michaels produced the film, so he was fully aware of how he was depicted.The second contentious character was Cancer Boy. Reprised from the final episode of the TV show, in a sketch that satirized the idea of being as offensive as possible, Cancer Boy is Bruce McCulloch dressed in a bald cap, with pale white makeup, using a wheelchair. He relays depressing information with a cheerful smile and releases a hit pop single entitled \"Whistle When You're Low\". Many found the character to be in exceedingly poor taste.[3][4] Paramount Pictures fought extensively with the troupe to cut the offending scenes, to no avail. The group has expressed some regret over their hardline position years later, feeling the battle left Paramount bitter and reluctant to fully market the film.[5]","music_by":"Craig Northey","edited_by":"Christopher Cooper","written_by":"Norm Hiscock Bruce McCulloch Kevin McDonald Mark McKinney Scott Thompson"}