{"country":"Romania","distributed_by":"BAC Films","Awards, nominations and accolades":"WinsNominations","Plot":"The film follows the story of Otilia Mihartescu (Anamaria Marinca) and Gabriela \"Găbița\" Dragut (Laura Vasiliu), two university friends in an unnamed Romanian town. The film is set in 1987,[3] one of the last years of the Ceaușescu government. When Găbița becomes pregnant, the two girls arrange a meeting with Mr. Bebe (Vlad Ivanov) in a hotel, where he is to perform an illegal abortion (Communist Romania had a natalist policy against abortion).At the college dorm Găbița and Otilia review the items they need for the day, and as Găbița nervously sits and waits in the room, Otilia barters and buys soap, cigarettes, etc. from school friends. Afterwards, Otilia takes a bus to visit her boyfriend Adi, from whom she borrows money. Adi asks Otilia to visit his family that night, as it is his mother's birthday, and to buy flowers on the way, to which Otilia initially declines, but she relents after Adi becomes upset.Otilia heads to a hotel where Găbița has booked a room, only to be informed by an unfriendly receptionist that there is no reservation under Găbița's last name. Otilia goes to another hotel, and after much begging and haggling is able to book a room at an expensive rate. Afterwards Otilia goes to a rendezvous point to meet with Mr. Bebe, although he had asked Găbița that she meets him and no one else. Mr. Bebe grows angry upon hearing that Găbița is not at the planned hotel.Mr. Bebe discovers that Găbița's claim that her pregnancy was in its third month is a lie; in fact, it has been at least four months. The two women were certain that they would pay no more than 3000 lei for the abortion. However, it slowly becomes clear to the women that he expects both women to have sex with him. Otilia reluctantly has sex with Mr. Bebe so that he will not walk out on them, and eventually Găbița does as well. Mr. Bebe then performs the abortion by injecting a probe and an unnamed fluid into Găbița's uterus, and leaves Otilia instructions on how to dispose of the fetus when it comes out. Otilia is exasperated by Găbița's lies, yet continues to help her and care for her.Otilia leaves Găbița at the hotel to go to Adi's mother's birthday. She is still disturbed but stays and has dinner with Adi's mother's friends, who are mostly doctors. They all talk about trivial things while Otilia and Adi remain silent. The phone rings in the background, but no one answers it. One of the guests then starts talking about lost values and respect to elders when Otilia accepts a cigarette offered to her in front of Adi's parents, which prompts Adi to bring the champagne in order to get the party over with. Adi and Otilia then go to his room where Otilia tells him about Găbița's abortion, and they start talking about what would happen if it was Otilia who was pregnant since Adi seems to be against abortion. After fighting with Adi, Otilia calls Găbița from Adi's house. Găbița does not answer, so Otilia decides to go back to Găbița.When Otilia enters the room Găbița is lying on the bed, and she tells Otilia that the fetus has come out and is in the bathroom. Otilia then wraps the fetus with some towels and puts everything in a bag, while Găbița asks her to bury the fetus. Otilia then goes outside and walks around for a while, finally climbing to the top of a random building, as Mr. Bebe had suggested, and dropping the bag in a trash chute.Otilia then goes back to the hotel and finds Găbița sitting at the restaurant. She sits and tells Găbița that they are never going to talk about the episode ever again. Otilia stares blankly at Găbița before looking directly at the camera, letting the audience decide what will happen between the two friends, just before the film cuts to black.","4_months,_3_weeks_and_2_days":"Theatrical poster","language":"Romanian","box_office":"$9,840,338","cinematography":"Oleg Mutu","directed_by":"Cristian Mungiu","Reviews":"The film received an enthusiastic response from critics, earning a 96% rating on Rotten Tomatoes (based on 127 reviews),[6] while also earning a 97% rating on Metacritic (based on 37 reviews).[7] Time magazine's Richard and Mary Corliss described it as a \"gripping, satisfying film\" and particularly noted the use of minimalism and \"formal rigor\" as defining aesthetic characteristics.[3] Jay Weissberg from Variety magazine said that the film was \"pitch perfect and brilliantly acted... a stunning achievement\". He added that the film shares a number of characteristics with other productions of the New Romanian Cinema, namely: \"long takes, controlled camera and an astonishing ear for natural dialogue.\"[8]Several sources view the film as indicative of a broader renaissance in Romanian cinema in the 2000s, particularly in light of other successful Romanian films, including Cristi Puiu's The Death of Mr. Lazarescu, which won the Prix un certain regard at the 2005 Cannes Film Festival, Corneliu Porumboiu's 12:08 East of Bucharest, which won the Camera d'Or at the 2006 Cannes Film Festival, and Cristian Nemescu's California Dreamin', which won the Prix un certain regard at the 2007 Cannes Film Festival.[9][10]Besides naming the film his number one favorite of 2007, A.O. Scott also put the film on his best of the decade list coming in at the number 7 spot.[11]The film appeared on many critics' top ten lists of the best films of 2007.[12]Due to various release dates, the film also appeared on many critics' top ten lists of the best films of 2008.[13]","release_dates":"17 May 2007 (2007-05-17) (Cannes)|14 September 2007 (2007-09-14)||||","Production":"The initial idea[4] was inspired by Mungiu's project to do a film, Memories from the Golden Age, which would collect several stories taking place during Communist Romania. Mungiu felt the need for a serious movie, focusing on a tragic true story, which still affected the director more than 15 years after the story happened.[4]After thinking about the story for a month, Mungiu jotted down the synopsis in 10 minutes, then wrote the screenplay in another month. He revised the screenplay numerous times during productions, rewriting and taking out parts that did not seem necessary (some changes were also suggested by discussions with Răzvan Rădulescu, who co-wrote Cristi Puiu's previous two features).Most of the filming was done in Bucharest, with some scenes filmed in a hotel in Ploiești.[4] The film was produced on budget of less than €600,000 (about US$794,280 dollars).[5]","produced_by":"Cristian Mungiu Oleg Mutu","starring":"Adi Carauleanu Luminița Gheorghiu Mădălina Ghițescu Vlad Ivanov Anamaria Marinca Alexandru Potocean Laura Vasiliu","running_time":"113 minutes","edited_by":"Dana Bunescu","written_by":"Cristian Mungiu","budget":"€600,000"}