{"country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Greg DePaul June Diane Raphael Casey Wilson","story_by":"Greg DePaul","Plot":"Emma Allen and Olivia 'Liv' Lerner are best friends who have planned every detail of their weddings, since first witnessing a wedding 20 years ago at the Plaza Hotel. They both have made it a priority to be married in the same location in June.The two both become engaged at 26, and are expected to be each other's maid of honor. They schedule their weddings with New York's most famous wedding planner, Marion St. Claire, but due to a clerical error they are scheduled to have a wedding on the same day, June 6 (three and a half months later). A week of passive aggressive hostility passes before the two women make it clear that neither will compromise, especially after the headstrong Liv hopes that Emma's passive nature would end their wait of who will surrender their date. Emma's fiancé, Fletcher, begins to show signs of being controlling. The two women declare war after a slight misunderstanding that Liv already set her wedding date, outraging Emma who sets her date as well, which Liv becomes aware of at their shared shower party. The two exchange threats and insults in front of their friends who decide not to take sides.Both women attempt to sabotage each other's wedding, including Liv changing Emma's dance instructor, Emma secretly sending Liv candy to make her too fat to fit into her dress, Liv making Emma's tan turn bright orange, Emma tampering with Liv's hair dye to turn Liv's hair a shocking blue-white color, Liv registering Emma on Babies-R-Us as pregnant, and Emma showing up to Liv's bachelorette party to out-dance her. Emma and Fletcher get into an argument regarding Emma's maniac behavior of sabotaging Liv's wedding and their friendship. Emma and Fletcher are shown to undergo strains in their relationship because of Emma's new found opinionated and confident trait, a depart from her usual people-pleasing characteristics. Liv has learned to be more sensitive and expressive, which gives her a sense of relief to finally have the luxury of being able to let go and be less controlling.Both brides-to-be are shown to be in the Plaza very shortly before they are due to be wed, separately. Right before Liv leaves to begin her march to the altar, she encounters Emma's father and receives his blessing; immediately she regrets setting up a wild spring break DVD to play at Emma's wedding. She sends her assistant Kevin to replace the DVD with the right one, filled with childhood memories. Thinking that the DVD is for a prank, he does not do so. Before the brides enter their respective venues, they share a moment of reconciliation as they both smile at each other.Emma begins her walk down the aisle but stops when the footage of her spring break is shown. She loses her temper and tackles Liv after sprinting to the other section of the Plaza. The two brides wrestle in their dresses on the floor while the people closest to the brides having decided to let the brides resolve the problem. After tussling, Emma and Liv lie on the ground panting, and then make up. Emma stands up and walks over to Fletcher who is upset at Emma's behavior. Emma tells him that she is not the same person he fell in love with ten years ago and that she has now changed, as it has been apparent that she learned to be more assertive. With that, the two tearfully call off their wedding. Liv's wedding resumes with Emma participating and dancing with Nate, Liv's brother and a well known magazine journalist.The movie picks up a year later when Liv and Emma meet up for drinks, where it's revealed that Emma married Nate. Emma and Liv also reveal to each other that they are pregnant and that their due dates are the same, March 3, and both friends get excited.","language":"English","Reception":"Bride Wars has been almost universally panned by critics. The film has received a 10% approval rating on Rotten Tomatoes based on 141 collected reviews.[9] Time named it one of the top 10 worst chick flicks.[10]Manohla Dargis of The New York Times called the film \"dopey if largely painless\". She said that Hathaway's presence meant \"that there’s a little acting in it, along with a few human emotions\" and wondered what the film might have been if the writers had explored a potential lesbian subtext suggested by the opening scenes.[11] Carrie Rickey of the Philadelphia Inquirer wrote, \"How bad can a movie be, with Goldilocks Hudson and Cinderella Hathaway? So excruciating that Hudson's sunshine can't warm it and Hathaway's rose redolence can't mask its stink.\"[12] Ty Burr of the Boston Globe was disturbed by the film, claiming that it was \"...a chick flick that makes its chick characters — and by extension its chick audience — look like hateful, backward toddlers, and there is something wrong with that.\"[13]Longtime BBC Radio 5 Live critic Mark Kermode was notably harsh toward the film on his Kermode and Mayo's Film Review show, going so far as to say that he would quit film criticism if Bride Wars did not end up in his list of 10 worst films of 2009.[14] By the end of the year, even when Kermode included Terminator Salvation and Couples Retreat on his list by popular demand, Bride Wars still finished eighth, allowing him to keep his job.[15]In one of the few positive reviews of the film, Time critic Mary Pols wrote, \"At least, and this is something to be grateful for, Bride Wars deviates from the usual wedding-flick routine of maids of honor who should be the bride (or groom). And even though the catfighting goes over the top, the notion that a passionate female friendship can turn ugly in a heartbeat is, sadly, realistic.\"[16]Apart from negative reviews, the film was nominated for 2 awards at the 2009 MTV Movie Awards: Best Fight (Anne Hathaway vs. Kate Hudson)[17] and Anne Hathaway for Best Female Performance.[18] It also had several Teen Choice Award nominations.[citation needed] Candice Bergen was nominated for a Razzie Award as Worst Supporting Actress for her performance in the film.In its opening weekend, the film grossed $21,058,173 ranking #2 at the box office.[1] As of May 26, 2009, it has made $58,715,510 in the United States and Canada, $55,982,521 in foreign countries and a total of $115,049,554 worldwide — a financial success despite its largely negative reviews.[1]","box_office":"$114,663,461[1]","cinematography":"Frederick Elmes","production_company":"Fox 2000 Pictures Regency Enterprises New Regency Firm Films Dune Entertainment","directed_by":"Gary Winick","release_dates":"January 9, 2009 (2009-01-09)|||||","Production":"Raphael and Wilson completed the shooting script of Bride Wars, from an original script by Greg DePaul,[4] before the 2007–2008 Writers Guild of America strike began.[5] Karen McCullah Lutz and Kirsten Smith also contributed to the screenplay.[2][5]Some principal photography took place at the Peabody Essex Museum in Salem, Massachusetts.[6] Most filming occurred in Boston, Massachusetts, New York City, New York, and in Salem, Massachusetts.The score to Bride Wars was composed by Edward Shearmur, who recorded his score with a 77-piece ensemble of the Hollywood Studio Symphony at the Newman Scoring Stage at 20th Century Fox.[7]In the beginning of the film, the song \"Somethin' Special\" by Colbie Caillat was played, however this version had different lyrics than the Beijing Olympic Mix, suggesting that it was the original mix. As the film did not have a soundtrack, the original version remained unreleased until Caillat's album Breakthrough was released, where the song appears as a bonus track on the Rhapsody edition.[8] There is also the song \"Dream\" by Priscilla Ahn. And \"Scared\" by Duffy.","produced_by":"Kate Hudson Matt Luber Alan Riche Peter Riche Julie Yorn","starring":"Kate Hudson Anne Hathaway Candice Bergen Chris Pratt Bryan Greenberg Steve Howey Kristen Johnston","running_time":"89 minutes","bride_wars":"Promotional film poster","music_by":"Edward Shearmur","edited_by":"Susan Littenberg","budget":"$30 million"}