{"based_on":"A Connecticut Yankee in King Arthur's Court 1899 novel  by Mark Twain","country":"United States","distributed_by":"Paramount Pictures","a_connecticut_yankee_in_king_arthur's_court":"Theatrical release poster","Plot":"Hank Martin (Bing Crosby), an American mechanic, is knocked out and wakes up in the land of King Arthur. Here he finds romance with Alisande la Carteloise (Rhonda Fleming) and friendship with Sir Sagramore (William Bendix).Unfortunately, the heroic Hank also incurs the hatred of both Merlin (Murvyn Vye) and Morgan le Fay (Virginia Field). While Hank persuades King Arthur (Cedric Hardwicke), an aged, semi-perpetual, cold-in-the-nose invalid, to tour his kingdom in disguise to see the true, wretched condition of his subjects, Merlin and Morgan plot to usurp his throne. When Hank tries to stop them, he is returned to his own time.Heartsick over losing the woman he loves, he goes on a tour of a British castle. Its owner, Lord Pendragon (Hardwicke again), sends him to see his niece, who looks just like Alisande.","language":"English","Reception":"A Connecticut Yankee in King Arthur's Court was one of the highlight films of 1949.[4] The film was nominated for AFI's Top 10 Fantasy Films list.[9]The critics were generally complimentary with Bosley Crowther of The New York Times saying on April 8, 1949: \"The solid, reliable humors of Mark Twain’s “A Connecticut Yankee in King Arthur’s Court,” which have already done yeoman service in two films and a Broadway musical show, have been given another going over—with eminently satisfactory results—in Paramount’s new film of the same title, which came to the Music Hall yesterday. And for this we can thank Bing Crosby, primarily and above all, because it is Bing in the role of the Yankee who gives this film its particular charm...But it is still Bing’s delightful personality, his mild surprises and sweet serenities, and his casual way of handling dialogue that makes this burlesque a success. No one in current operation could qualify, we are sure, to play the Connecticut Yankee the way the old Groaner does.[10]Variety was not quite so enthusiastic. \"Picture wears the easy casualness that’s a Crosby trademark, goes about its entertaining at a leisurely pace, and generally comes off satisfactorily. It’s not high comedy and there’s little swashbuckling.\"[11]","cinematography":"Ray Rennahan","production_company":"Paramount Pictures","directed_by":"Tay Garnett","Production notes":"The film soundtrack was composed by Jimmy Van Heusen with lyrics by Johnny Burke. The orchestral score was written by longtime Paramount staff composer Victor Young, who also conducted the orchestra for many of Crosby's Decca Records recordings.[5]A highlight of the film is the scene in which Hank Martin teaches the court musicians how to \"jazz up\" the medieval music they are playing. Perhaps the best-known song from the score is \"Busy Doing Nothing,\" which Hank, Sir Sagramore and the King sing when they are strolling through the woods pretending to be peasants.The cast made separate recordings of the songs used in the film for Decca Records in December 1947[7] and these were issued as a 78rpm album set. Crosby's songs were also included in the Bing's Hollywood series.","release_dates":"April 22, 1949 (1949-04-22) (USA)|||||","produced_by":"Robert Fellows","starring":"Bing Crosby|Rhonda Fleming|Sir Cedric Hardwicke|William Bendix|","running_time":"106 minutes","music_by":"Victor Young","edited_by":"Archie Marshek","written_by":"Edmund Beloin","budget":"$3.4 million[1]"}