{"based_on":"Captain America  by Joe Simon Jack Kirby","Cast":"Additionally, Toby Jones,[41] Maximiliano Hernández,[42] and Garry Shandling[43] reprise their roles from previous Marvel Studios films as Arnim Zola, Jasper Sitwell, and Senator Stern, respectively. Georges St-Pierre plays Georges Batroc, a mercenary and a master of the French form of kickboxing known as savate.[44][45] Callan Mulvey plays Jack Rollins, a member of S.H.I.E.L.D.'s S.T.R.I.K.E. unit.[46][47] Chin Han, Jenny Agutter (who previously appeared in The Avengers), Alan Dale, and Bernard White appear as members of the World Security Council.[48][49] Comedic actors Danny Pudi[49] and DC Pierson[50] have small roles as a S.H.I.E.L.D. technician and an Apple Store employee, respectively. Gary Sinise narrates a Captain America-themed Smithsonian Institution exhibit, and Stan Lee cameos as a security guard there.[49] Winter Soldier creator Ed Brubaker makes a cameo as a scientist working on the Winter Soldier.[51][52] Co-director Joe Russo cameos as a doctor,[50] and Christopher Markus and Stephen McFeely cameo as two S.H.I.E.L.D. interrogators. Thomas Kretschmann, Henry Goodman, Elizabeth Olsen and Aaron Taylor-Johnson appear, uncredited, as Baron Wolfgang von Strucker, Dr. List, the Scarlet Witch, and Quicksilver, respectively, in the mid-credits scene.[53][54][55]","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Christopher Markus|Stephen McFeely|","captain_america:_the_winter_soldier":"Theatrical release poster","Plot":"Two years after the Battle of New York,[N 1] Steve Rogers works in Washington D.C. for the espionage agency S.H.I.E.L.D. under Director Nick Fury, while adjusting to contemporary society. Rogers and Agent Natasha Romanoff are sent with S.H.I.E.L.D.'s counter-terrorism S.T.R.I.K.E. team, led by Agent Rumlow, to free hostages aboard a S.H.I.E.L.D. vessel from Georges Batroc and his mercenaries. Mid-mission, Rogers discovers Romanoff has another agenda: to extract data from the ship's computers for Fury. Rogers returns to the Triskelion, S.H.I.E.L.D.'s headquarters, to confront Fury and is briefed about Project Insight: three Helicarriers linked to spy satellites, designed to preemptively eliminate threats. Unable to decrypt the data recovered by Romanoff, Fury becomes suspicious about Insight and asks senior S.H.I.E.L.D. official Alexander Pierce to delay the project.On his way to rendezvous with Maria Hill, Fury is ambushed by assailants led by a mysterious assassin called the Winter Soldier. Fury escapes to Rogers' apartment, and warns Rogers that S.H.I.E.L.D. is compromised. After handing Rogers a flash drive containing data from the ship, Fury is gunned down by the Winter Soldier. Fury dies in surgery, and Hill recovers the body. The next day, Pierce summons Rogers to the Triskelion. When Rogers withholds Fury's information, Pierce brands him a fugitive. Hunted by S.T.R.I.K.E., Rogers meets with Romanoff. Using data in the flash drive they discover a secret S.H.I.E.L.D. bunker in New Jersey, where they activate a supercomputer containing the preserved consciousness of Arnim Zola. Zola reveals that ever since S.H.I.E.L.D. was founded after World War II, Hydra has secretly operated within its ranks, sowing global chaos with the objective of making humanity willing to surrender its freedom in exchange for security. The pair narrowly escape death when a S.H.I.E.L.D. missile destroys the bunker, and realize that Pierce is Hydra's leader within S.H.I.E.L.D.Rogers and Romanoff enlist the help of former USAF pararescueman Sam Wilson, whom Rogers befriended, and acquire his powered \"Falcon\" wingpack. Deducing that S.H.I.E.L.D. agent Jasper Sitwell is a Hydra mole, they force him to divulge that Zola developed a data-mining algorithm that can identify individuals who might become future threats to Hydra's plans. The Insight Helicarriers will sweep the globe, using satellite-guided guns to eliminate these individuals. Rogers, Romanoff, and Wilson are ambushed by the Winter Soldier, who kills Sitwell. During the fight, Rogers recognizes the Winter Soldier as Bucky Barnes, his friend who was captured and experimented upon during WWII. Hill manages to extract the trio to a safehouse where Fury, who had faked his death, is waiting with plans to sabotage the Helicarriers by replacing their controller chips.After the World Security Council members arrive for the Helicarriers' launch, Rogers broadcasts Hydra's plot to everyone at the Triskelion. Romanoff, disguised as one of the Council members, disarms Pierce. Fury arrives and forces Pierce to unlock S.H.I.E.L.D's database so that Romanoff can leak classified information, exposing Hydra to the public. Following a struggle, Fury kills Pierce. Meanwhile, Rogers and Wilson storm two Helicarriers and replace the controller chips, but the Winter Soldier destroys Wilson's suit and fights Rogers on the third. Rogers fends him off and replaces the final chip, allowing Hill to take control and have the vessels destroy each other. Rogers refuses to fight the Winter Soldier in an attempt to reach his friend, but as the ship collides with the Triskelion, Rogers is thrown out into the Potomac River. The Winter Soldier rescues the unconscious Rogers before disappearing into the woods. With S.H.I.E.L.D. in disarray, Romanoff appears before a Senate subcommittee and Fury, under the cover of his apparent death, heads to Eastern Europe in pursuit of Hydra's remaining cells. Rogers and Wilson decide to find the Winter Soldier, while Rumlow, who was a double agent for Hydra, is hospitalized following the Triskelion's destruction.In a mid-credits scene, Baron Wolfgang von Strucker, at a Hydra lab, proclaims that the \"age of miracles\" has begun as scientists examine an energy-filled scepter[N 2] and two prisoners: one with superhuman speed, the other with telekinetic powers. In a post-credits scene, the Winter Soldier visits a Bucky memorial at the Smithsonian Institution.","language":"English","Reception":"Captain America: The Winter Soldier earned $259.8 million in North America and $454.7 million in other territories for a worldwide total of $714.4 million.[3] It became the seventh-highest grossing film of 2014 worldwide.[161] Deadline.com calculated the net profit for the film to be $166.2 million, when factoring together \"production budgets, P&A, talent participations and other costs, with box office grosses, and ancillary revenues from VOD to DVD and TV,\" placing it ninth on their list of 2014's \"Most Valuable Blockbusters\".[162]Captain America: The Winter Soldier made $10.2 million in Thursday night showings, more than double the midnight gross of its predecessor.[163] It set an April single-day[164] ($36.9 million)[165] and April opening-weekend record ($95.0 million), while its opening weekend was a 46% increase over its predecessor.[166] The film held the number one spot at the box office for three consecutive weekends,[167][168] before being overtaken by The Other Woman in its fourth weekend.[169] It achieved the largest total gross among films released in the month of April.[170] At the end of its theatrical run, the film became the fourth highest-grossing film of 2014 behind American Sniper, The Hunger Games: Mockingjay - Part 1, and Guardians of the Galaxy.[171]Captain America: The Winter Soldier topped the box office on its opening weekend with $75.2 million from 32 overseas markets.[123] The film debuted at number one in many territories, including Australia, China, and Russia[172] and set a 3-day opening-weekend record in China among Disney films,[166] with $38.81 million.[172] It topped the box office outside North America on two consecutive weekends,[166] followed by two weeks in second, behind Rio 2.[173][174]The review aggregator website Rotten Tomatoes reported an 89% approval rating with an average rating of 7.5/10 based on 256 reviews. The website's consensus reads, \"Suspenseful and politically astute, Captain America: The Winter Soldier is a superior entry in the Avengers canon and is sure to thrill Marvel diehards.\"[175] Metacritic, which uses a weighted average, assigned a score of 70 out of 100 based on 47 critics, indicating \"generally favorable reviews\".[176] CinemaScore audiences gave Captain America: The Winter Soldier an \"A\" grade rating on an A+ to F scale.[177]Todd McCarthy of The Hollywood Reporter said the film \"takes the bold (for Marvel) step of reducing CGI spectacle to a relative minimum in favor of reviving the pleasures of hard-driving old-school action, surprising character development and intriguing suspense.\"[178] Scott Foundas of Variety said it is \"chockfull of the breathless cliffhangers dictated by the genre, but equally rich in the quiet, tender character moments that made the first film unique among recent Marvel fare.\"[179] Richard Roeper of the Chicago Sun-Times said, \"While not on a par with The Avengers or the first and third Iron Man movies, this is another rock-solid chapter in the big-screen story of Marvel.\"[180] Owen Gleiberman of Entertainment Weekly noted the topicality of the film, stating, \"Captain America: The Winter Soldier is the first superhero film since the terrorist-inflected The Dark Knight that plugs you right into what's happening now.\"[181] Ty Burr of The Boston Globe said the film \"delivers all the 3D CGI mayhem audiences have come to expect from the Marvel entertainment juggernaut, but there’s darkness and confusion just under its comic-book surface.\"[182] Joe Morgenstern of The Wall Street Journal said, \"What makes The Winter Soldier so enjoyable, and what will make it so profitable, is its emotional bandwidth—all the vivid, nuanced life lived by its characters in between their frenzied escapades,\" and felt it fixed all the shortcomings of The First Avenger \"and then some\".[183]Conversely, Kenneth Turan of the Los Angeles Times said, \"[Captain America: The Winter Soldier] is everything a big budget superhero film should be – except inspired.\"[184] Manohla Dargis of The New York Times said, \"Like many others of its type, [Captain America: The Winter Soldier] gets off to a kinetic start only to lose steam before blowing everything up.\"[185] Robbie Collin of The Daily Telegraph said, \"You can't help but feel disappointment that a film with a relatively spicy premise becomes, in the end, so risk-averse.\"[186] Mick LaSalle of the San Francisco Chronicle said the film \"has the usual overlong running time [for the comic book superhero genre], the halfhearted feints in the direction of human feeling and the obligatory action sequences that are big without being either exciting or particularly legible.\"[187] Joe Williams of the St. Louis Post Dispatch felt \"On paper this sequel has some promising elements, but on screen it retreats from the very issues that it raises, and on a shelf next to Captain America: The First Avenger, The Winter Soldier is pale.\"[188] Jake Coyle of the Associated Press said the film's biggest misstep was the handling of Stan's Winter Soldier, and that it was \"getting difficult to tell the Marvel movies apart\".[189]","box_office":"$714.4 million[3]","cinematography":"Trent Opaloch","production_company":"Marvel Studios","directed_by":"Anthony Russo|Joe Russo|","Music":"In June 2013, Henry Jackman announced that he would compose the film's score.[119] About the score Jackman said, \"...it's 50% production and all the tricks I've learnt from spending years in the record industry but then it's also got the kind of injection of symphonic, thematic, heroic music that all kind of merges into one musical, and hopefully coherent piece\".[120] A soundtrack album was released by Hollywood Records on April 1, 2014.[121]","release_dates":"March 13, 2014 (2014-03-13) (El Capitan Theatre)|April 4, 2014 (2014-04-04) (United States)||||","Production":"We hired our directors on Cap because they loved our explanation that we really want to make a '70s political thriller masquerading as a big superhero movie. Just like with the first film – we got Joe Johnston because we said, \"We want to do a '40s World War II movie masquerading as a big superhero movie.\" I love that we're doing a sequel to a film that's a completely different genre than the first film. I think that's fun. And the comics do it all the time.In April 2011, before Captain America: The First Avenger was released in theaters, screenwriters Christopher Markus & Stephen McFeely announced Marvel had already hired the duo to work on the film's sequel.[57] In September 2011, Chris Evans said that a sequel may not be released until 2014.[6] In January 2012, Neal McDonough, who played Dum Dum Dugan in Captain America: The First Avenger, mentioned that a sequel would likely be filmed after the completion of Thor: The Dark World, which would likely have been before the end of 2012.[58] By March 2012, Marvel whittled down the possible directors for the sequel to three candidates: George Nolfi, F. Gary Gray, and brothers Anthony and Joseph Russo.[59] Walt Disney Studios announced the planned release of the sequel to Captain America: The First Avenger on April 4, 2014. Disney stated, \"The second installment will pick-up where … The Avengers leaves off, as Steve Rogers continues his affiliation with Nick Fury and S.H.I.E.L.D. and struggles to embrace his role in the modern world.\"[60] Markus later elaborated, \"I think S.H.I.E.L.D. is the water [Rogers is] swimming in. It's definitely a Captain America movie. You know, if the first movie was a movie about the US Army, then this is a movie about S.H.I.E.L.D... You will learn about S.H.I.E.L.D. You will learn about where it came from and where it's going and some of the cool things they have.\"[11] In April, F. Gary Gray withdrew his name from consideration, choosing instead to direct the N.W.A biographical film Straight Outta Compton.[61]McFeely said the writing process began in the middle of 2011, around the release of The First Avenger, with him and Markus \"noodling on in hopes that there would be a second one and we did a lot of just throwing stuff at the wall and seeing what stuck\".[62] The first few months of writing were a back and forth process with Marvel, but that after an outline was finished, the story did not change much.[63] They opted to set the story in the present day, and, after \"experimenting with flashback elements for more period World War II stuff\",[64] decided to abandon the flashbacks as \"it became unwieldy.\"[62] The film would be \"Cap versus the world we all live in today\",[65] while averting excessive comedy regarding the hero's time displacement, as Markus considered the Captain \"the most adaptive man on the planet.\"[62] The tone would be more grounded in reality despite the advanced technology to contrast the fantasy elements from both the first Captain America and The Avengers.[65] Despite that, the comic book origins guaranteed that the film would not have verisimilitude.[37] This still proved a challenge in the reveal of Arnim Zola, that had to be extensively rewritten to convey how \"this grounded espionage paranoid thriller suddenly screeches to a halt and you switch gears really quickly with this ghost in the machine\" that introduces more science fiction elements.[66]Markus and McFeely wanted to adapt Ed Brubaker's Winter Soldier storyline from the comics, which they described as \"the tone of Cap’s modern franchise\",[67] but it took the duo six months to convince themselves that they could do it.[16] In the meantime, while thinking how to progress from the war film tone of The First Avenger, the writers settled on the conspiracy genre for the screenplay, and cited Three Days of the Condor, The Parallax View, and Marathon Man as influences, feeling it better conveyed Captain America's trust issues and contrasting values in the new world he was living in,[16] with Markus saying, \"If you put that 1940s man into present day geo-politics everything is going to seem like a conspiracy. It’s just going to seem dirty and underhanded and shifty, and people won’t be telling the truth.\"[67] Three Days of the Condor in particular was used as the main source of the script structure, following the idea that the protagonist is being chased by a threat they, along with the audience, only discover halfway through the film.[37]The writers felt this approach was similar to how Stan Lee reinvented Captain America in the 1960s and 1970s, with \"the Captain dealing with all sorts of the same things that the country [was] dealing with–Vietnam, Watergate and all that stuff–so he gets to have opinions on that\", thus making the \"guy who is ostensibly from the more black and white 1940s react to this ultimately grey world that we live in.\"[68] Marvel Studios president Kevin Feige described the film as a political thriller,[69] and as the duo struggled to figure out a third act, Feige suggested that S.H.I.E.L.D. be brought down and have Captain America fight the agency. The writers thought this was a great story point, for implementing \"the physical manifestation of Cap changing the world.\"[70] Markus even noted how the 1970s comics had similar conspiracies.[67] The Hydra reveal made sure to include returning characters among the undercover villains, as well as references to the comics such as Arnim Zola being kept alive as a machine.[65] Feige later elaborated on the political thriller nature of the film saying,In our attempt to make all of our films feel unique and feel different we found ourselves going back to things like [Three Days of the Condor]. Also the other political thrillers of the '70s: The Parallax View, All the President's Men. This was a time that Cap existed in the comics. He found himself in the swinging '60s followed by the Watergate Era followed by the Reagan Era followed by where we are today. In the comics it was a hell of a journey for Steve. And we couldn't take him through those years because in our cinematic universe he was asleep. But we wanted to force him to confront that kind of moral conundrum, something with that '70s flavor. And in our film that takes the form of S.H.I.E.L.D.[71]Feige stated that Steve Rogers would be paired with other characters from The Avengers like Black Widow and Nick Fury, because unlike Tony Stark and Thor, who could return to their own supporting casts, Rogers had nowhere else to go, \"and it just made sense that he was the one that stayed with what remains of the Avengers at the end of the film.”[72] The writers considered including Hawkeye, but \"he didn’t have enough to do and suddenly it seemed like we were giving him short shrift\", leading all of his parts to be fulfilled by Black Widow,[67] and Joe Russo adding that Jeremy Renner's schedule could not be worked out for him to appear.[73] As to why the Red Skull from The First Avenger did not appear in The Winter Soldier, Joe Russo explained, \"I know we have a guy in a computer, but the tone we were chasing was sort of that conspiracy thriller. And we wanted to try and ground the movie as much as we could. And Red Skull, he’s a fantastical character and didn’t necessarily fit for Cap 2 and especially because it was about the fall of S.H.I.E.L.D. Certainly Hydra exists and that’s his legacy, but there’s something interesting about the fact that his legacy outlived the skull. And they’re still dealing with the demons of it, but not necessarily him.”[74]Chris McKenna, who worked with the Russo brothers on the sitcom Community, contributed to the script by writing jokes for the film.[75]It's hard to make a political film that's not topical. That's what makes a political thriller different from just a thriller. And that's what adds to the characters' paranoia and the audience's experience of that paranoia. But we're also very pop-culture-obsessed and we love topicality, so we kept pushing to [have] scenes that, fortunately or unfortunately, played out [during the time that Edward] Snowden outed the NSA. That stuff was already in the zeitgeist. We were all reading the articles that were coming out questioning drone strikes, pre-emptive strikes, civil liberties — [Barack] Obama talking about who they would kill... We wanted to put all of that into the film because it would be a contrast to [Captain America]'s greatest-generation [way of thinking].By June 2012, the Russo brothers entered negotiations to direct the sequel,[77] and Samuel L. Jackson was confirmed to return as S.H.I.E.L.D. leader Nick Fury.[40] Feige sought out the Russos after watching the genre-parodying season 2 finale of Community which they directed,[78][79] and for the additional ideas they brought to the initial story pitch.[80] Joe Russo detailed that since the intent was for a political thriller, \"all the great political thrillers have very current issues in them that reflect the anxiety of the audience.\" Thus the brothers opted to include references to drone warfare, targeted killing and global surveillance. Joe even noted how during principal photography, the issues became more topical due to the disclosure of several National Security Agency surveillance-related documents.[81] At the 2012 San Diego Comic-Con International, it was announced that the official title for the sequel is Captain America: The Winter Soldier, and that the Russo brothers would direct the film.[82] After signing on to direct, the Russo brothers met with Ed Brubaker to learn more about where the Winter Soldier character came from, his thinking and the themes behind the character.[83] In July 2012, Anthony Mackie entered negotiations to star as Falcon alongside Chris Evans in the sequel.[13] Sebastian Stan was also confirmed to be reprising his role as James Barnes.[13] By August 2012, Anna Kendrick, Felicity Jones, and Imogen Poots were being considered front-runners for a leading role in the film.[84]In September 2012, Chris Evans stated that filming would begin in March 2013.[85] Evans also stated that Rogers' adjustment to the modern world, which was originally set to be included in The Avengers, would be better suited for Captain America: The Winter Soldier.[86] At the end of the month, The Greater Cleveland Film Commission announced that Captain America: The Winter Soldier would film in Cleveland, Ohio after the production was approved for a $9.5 million tax credit.[87] Producer Nate Moore said that after also serving as a location in The Avengers, Cleveland's government was helpful in providing large locations for filming, which \"provided production value which we probably could not have built in a backlot.\" McFeely joked that while writing ambitious action scenes \"I did not realize a great American metropolis would say 'Sure, shut down three miles of freeway and go to town'.\"[18] Portions of the film were also scheduled to be shot in California and Washington, D.C.[87][88]By October, Emilia Clarke, Jessica Brown Findlay, Teresa Palmer, Imogen Poots, and Alison Brie were being considered for Rogers' love interest in the film,[9] and Scarlett Johansson was brought back to reprise her role as Black Widow.[9] Later in the month, Frank Grillo was testing for the role of the villain Crossbones in the film,[89] and by the end of the month, Grillo closed a deal to portray the character and Cobie Smulders signed on to reprise her role as Maria Hill from The Avengers.[25]In January 2013, Hayley Atwell, who played Peggy Carter in Captain America: The First Avenger, said that she would not appear in the sequel.[90] However Stanley Tucci, who played Dr. Abraham Erskine in the previous film, later said that Atwell would reappear in a flashback scene.[91] Also in January, Marvel Studios announced that the film would be released in 3D, and Anthony Mackie said filming would begin on April 1, 2013.[92][93] Later that month, Toby Jones, who portrayed Arnim Zola in the first film, said that he would reprise the role in the sequel.[41] By the end of the month, stages were being built for a shoot at Raleigh Manhattan Beach Studios in Los Angeles.[94]In February 2013, Emily VanCamp entered negotiations to play a female lead in the film.[95] By March 2013, Maximiliano Hernández was signed to reprise his role as S.H.I.E.L.D. agent Jasper Sitwell from Thor and The Avengers and Robert Redford entered in talks to join the cast, as a high-ranking member of S.H.I.E.L.D,[42][96] which he later confirmed.[38] Toward the end of March, UFC fighter Georges St-Pierre was cast as a character based on the comics' Batroc the Leaper in the film.[44]Captain America's uniform was altered from the ones seen in previous films, with a Kevlar-based ballistic component that would protect Captain America but at the same time function like a military uniform.[8] Joe Russo said, \"We wanted to use his Super Soldier outfit from the [Steve Rogers: Super Soldier series] as a way to represent, thematically, his place in the world of S.H.I.E.L.D. and the difference between working for S.H.I.E.L.D. and being Captain America.\"[97] For the Falcon costume, the filmmakers were interested in adding more of a tactical design than was represented in the comic books, by including real-world webbing, straps and gear and stripping away the more comic book elements.[8]Principal photography began on April 1, 2013, at the Raleigh Manhattan Beach Studios in Los Angeles, under the working title Freezer Burn.[98] Scenes taking place on the \"Lemurian Star\" were filmed on the Sea Launch Commander, docked in Long Beach, California.[18] In early May, Dominic Cooper confirmed he would return as Howard Stark.[99] On May 14, 2013, production moved to Washington, D.C. with filming taking place at the National Mall and the Theodore Roosevelt Bridge.[100] The following day, Garry Shandling was spotted on set reprising his Iron Man 2 role of Senator Stern.[43] Other filming locations in Washington, D.C. included the Willard Hotel and Dupont Circle.[101]Filming in Cleveland began on May 17 and was scheduled to last until mid-June with locations scheduled on the West Shoreway, the Southerly Wastewater Treatment Plant in Cuyahoga Heights and the Lakeview Cemetery Dam.[102] Cleveland was chosen as a stand-in for Washington, D.C, with the city's East 6th Street doubling as 7th and D Streets in Southwest D.C.[103] Other locations in Cleveland included the Federal Reserve Bank of Cleveland, the Cleveland Public Library, Cleveland State University, the Cleveland Arcade, Tower City Center, the Cleveland Museum of Art, and the Western Reserve Historical Society.[103][104][105][106][107] Interior shots were also filmed inside private homes and the Pilgrim Congregational Church in Tremont.[108] Filming in Cleveland concluded on June 27, 2013.[109]Trent Opaloch, best known for his work on District 9 and Elysium, was brought in as the director of photography. Opaloch stated that while attempting to emulate the 1970s thrillers that served as inspiration for the writers and directors, the staging and lighting tried to bring realism through \"classic framing and naturalistic lighting\", and the filming was done with hand-held cameras. To achieve this, Opaloch used Arri Alexa Plus 4:3 cameras with Panavision anamorphic lenses and Codex Digital recorders.[110] Stunt work aimed for realistic action, prioritizing practical effects. The fight scenes were staged for months, with a choreography that aimed to highlight Captain America's superhuman qualities, and \"move away from impressionistic action into specificity\": the raid on the S.H.I.E.L.D. vessel had stealthiness as the Captain knocked out enemies to avert detection, and the freeway fight with Winter Soldier was more \"last minute\" to highlight the characters' struggle to survive.[18]In contrast to the quick editing and moving cameras of modern action films, The Winter Soldier aimed to feature longer action scenes that felt more visceral and dangerous.[37] The Russos mentioned the bank robbing scene of Heat as a major influence, which they described as \"the most intense eight minutes of filmmaking I've seen in a movie theater\",[18] and action scenes directed by Brian De Palma, such as the vault heist in Mission: Impossible, where \"very likable characters are put in impossible situations that the audience is put on the edge on how they'd escape\". Examples of these types of scenes include the ambushes on Nick Fury in the street and Captain America in the elevator.[37]Additional photography was filmed in December 2013 and January 2014,[111] in order for the Russos to accurately show the state of each character after the defeat of S.H.I.E.L.D., having read the script of Avengers: Age of Ultron to guide their choices.[37] Joss Whedon, director of The Avengers and Avengers: Age of Ultron, wrote and directed the mid-credits scene,[112] which featured Quicksilver, the Scarlet Witch,[54] and Baron Wolfgang von Strucker.[53] The title sequences were created by design firm Sarofsky, who had worked with the Russos since Community. Sarofsky collaborated with comic book artist David W. Mack on the sequences.[113]Anthony Mackie said the Russo brothers relied on minimal use of computer-generated imagery, stating, \"The Russos, what they did that was so great was, they wanted to stay with live action, which is a dying art form. If they can build it, they built it. If we could do it, we did it. They wanted to do as little CGI as possible. That's why the movie looks so great.\"[114] Nevertheless, six special effects companies are involved in creating the visual effects of the film, including Industrial Light & Magic (ILM), Scanline VFX, Lola VFX, Luma Pictures, Whiskytree and The Embassy, with previsualization completed by Proof.[34] The film contained 2,500 visual effects shots, with 900 worked on by ILM.[115] The film featured extensive use of digital doubles. Russell Earl, ILM visual effects supervisor, said, \"The character that we did the most work on was Falcon. We knew we were going to do CG wings. We also did some shots with wires and some with stunt doubles and head replacement. And we needed a very good digital double.\"[115]Lola VFX, who worked on the pre-serum Steve Rogers scenes in this film and Captain America: The First Avenger, also worked on shots featuring an elderly Peggy Carter. This involved digitally transposing the facial features of an elderly actress onto the face of actress Hayley Atwell who had performed her lines with no make-up and only a few tracking markers.[34]The Helicarriers in the film were completely digital. Earl said, \"In [The Avengers] it was more like an aircraft carrier, now it’s an aircraft carrier with the addition of battle ship-sized guns. We were all over the carriers [with the virtual camera]. We were on the decks; we were flying next to them. We had a lot of close ups and different angles. And we didn’t just have one; we had three. On top of that, we had to destroy them all.\" This CGI environment was also used in close ups. Earl said, \"The challenge was to get in all of the detail to make it feel like it is a real, working ship. We created details down to the railings and all the human-scale stuff. ... For the shots in which we were destroying them, we had to have the internals as well – the hallways, the storage areas.\"[115] Many of the shots of Washington, D.C. were digitally created due to numerous flight restrictions in the city which necessitated that locations be recreated by computer.[115] However, aerial footage of the city was filmed and used for live action plate photography for shots involving the Triskelion, which is located on Theodore Roosevelt Island on the Potomac River.[34]350 different versions of the film were made, to accommodate for the different formats it would be released in domestically, while also accounting for international localization and formats. The versions had to be completed in 17 days, versus a normal turnaround time of three to four weeks for contemporary films, to make its theatrical release date.[116] One of the various changes for localization was the contents of Captain America's notebook list seen at the beginning of the film. The first five items were different depending on where the film was released, while the final five items were the same across all prints.[117] Marvel held online polls allowing fans to select the items featured in each country's release.[118]","produced_by":"Kevin Feige","starring":"Chris Evans|Scarlett Johansson|Sebastian Stan|Anthony Mackie|Cobie Smulders|Frank Grillo|Emily VanCamp|Hayley Atwell|Robert Redford|Samuel L. Jackson|","running_time":"136 minutes[1]","Sequel":"Captain America: Civil War was released on May 6, 2016, and again is directed by the Russo brothers.[199][200] Evans, Johansson, Stan, Mackie, VanCamp and Grillo reprise their roles from The Winter Soldier[201][202] and they are joined by Robert Downey, Jr. as Tony Stark / Iron Man, Paul Bettany as Vision, Jeremy Renner as Clint Barton / Hawkeye, Don Cheadle as James \"Rhodey\" Rhodes / War Machine, Elizabeth Olsen as Wanda Maximoff / Scarlet Witch, Paul Rudd as Scott Lang / Ant-Man, and William Hurt as Thaddeus \"Thunderbolt\" Ross,[203] all reprising roles from previous MCU films.","music_by":"Henry Jackman","edited_by":"Jeffrey Ford|Matthew Schmidt|","Release":"Captain America: The Winter Soldier was released in 32 markets on March 26, 2014[122][123] and in North America on April 4, 2014, in 2D, 3D and IMAX 3D.[60][92] The film debuted on 668 IMAX screens worldwide, a record for films releasing in April.[124] The world premiere took place on March 13, 2014 at the El Capitan Theatre in Hollywood, California.[125] The Paris premiere occurred on March 17 at Le Grand Rex,[126] the London premiere took place on March 20 at Westfield London,[127] the Beijing premiere took place on March 24[128] and the Cleveland premiere took place on April 1.[129] Chris Evans and Scarlett Johansson auctioned off passes to one of the premieres for charity.[130]In July 2013, Marvel Studios released a teaser poster depicting a damaged and discolored Captain America shield.[131] The Los Angeles Times said, \"the image suggests that [Captain America] might see some serious battle in the sequel\" while Rolling Stone said, \"the image hints at darker themes in the sequel\".[132][133] Later that month, Marvel Studios head and producer Kevin Feige, directors Joe and Anthony Russo, and cast members Chris Evans, Scarlett Johansson, Samuel L. Jackson, Sebastian Stan, Anthony Mackie, Cobie Smulders, Emily VanCamp, and Frank Grillo held a panel at 2013 San Diego Comic-Con International and presented footage from the film.[134] In addition, Marvel had booths depicting a Smithsonian-type exhibit showing Captain America and the Howling Commandos from Captain America: The First Avenger.[135] At the end of the month, audiences were shown a glimpse of the film along with some of Marvel's other Phase Two slate of films at Disney XD's Disney Fandom event.[136]In August 2013, Feige, Evans, Stan, and Mackie presented a clip of the film at Disney's D23 Expo.[137] In September 2013, Marvel announced that it is again partnering with Harley-Davidson, continuing their relationship from Captain America: The First Avenger, with Captain America riding the company's Softail Breakout motorcycle in the film.[138]In October 2013, Marvel released the first trailer for Captain America: The Winter Soldier. The Hollywood Reporter said, \"it looks like it'll live up to the 'political thriller' that's been promised for months now.\"[139] The Los Angeles Times said, \"[the] trailer runs 2½ minutes and teases plenty of action, conspiracy and clever banter between Captain America and his S.H.I.E.L.D. colleagues, with a smattering of the previously released Comic-Con International and D23 footage.\"[140] The Los Angeles Times also noted that the day before the release of the trailer, the studio released \"a teaser for a trailer.\"[141] The trailer received 23.5 million views in the 24 hours after its release.[142] In November 2013, Jed Whedon, the co-creator of the television series Agents of S.H.I.E.L.D., said that there are plans to reference events from the film into the show, stating, \"Nick Fury is in [Captain America: The Winter Soldier], and S.H.I.E.L.D. makes an appearance, so we will definitely try to tee-up some stuff and probably play a little bit of the fallout from that film.\"[143]In January 2014, Disney announced that in honor of the film, Captain America would be making appearances at Disneyland.[144] The meet and greet experience opened March 7, 2014 and is called Captain America: The Living Legend and Symbol of Courage, located at Innoventions in Tomorrowland.[145] Also in January, Marvel Comics released a prelude digital comic titled, Marvel's Captain America: The Winter Soldier Infinite Comic, written by Peter David, with art by Rock-He Kim.[146] The comic sees the return of the \"Zodiac\", the mysterious weapon first seen in the One-Shot Agent Carter, which has fallen into the wrong hands. Captain America, Black Widow, and Rumlow must track the weapon down and put it back in S.H.I.E.L.D. protection.[147]The first televised advertisement for Captain America: The Winter Soldier aired during Super Bowl XLVIII on February 2, 2014. According to The Hollywood Reporter, Disney paid over $4 million per 30-second spot.[148] The Los Angeles Times said, \"The clip promoting the April 4 release had a recognizably melancholy tone as Chris Evans' patriotic hero grapples with the moral ambiguities of the modern age.\"[149] Also in February, Gameloft announced that a mobile video game, titled Captain America: The Winter Soldier – The Official Game, would be released in conjunction with the release of the film in late March 2014 for iOS and Android platforms.[150] A few days later General Motors announced that Chevrolet partnered with Marvel Entertainment and provided a specially designed Corvette Stingray C7 for use by the Black Widow in the film. The vehicle debuted at the 2014 Chicago Auto Show, where fans received limited-edition Captain America comic books.[151] Evans was named the grand marshal of the 2014 Daytona 500 to promote the film's release.[152] Later in the month, a 30-second television spot received \"a lot of attention on social media\" for a line featured in the clip. The line, which was said by Captain America, suggests that Nick Fury would die in the film. The Hollywood Reporter noted that it all seemed \"a bit too obvious\", noting the fact that Jackson, who plays Fury, is reprising the role in Avengers: Age of Ultron, although pointing out that it could be in a postmortem flashback appearance.[153]In March 2014, Marvel released the Captain America Experience app, that allowed fans to capture a pictures of themselves with Captain America, and let them share it on Instagram and Twitter using specific hashtags to unlock 10 early screenings of the film across the United States,[154] which took place on March 20.[155] On March 18, ABC aired a one-hour television special titled, Marvel Studios: Assembling a Universe, which included a sneak peek of Captain America: The Winter Soldier.[156] On April 1, 2014, Evans and Stan rang the opening bell of the New York Stock Exchange in honor of the film's theatrical release.[157] Jackson appeared in advertisements for Sky Broadband.[158]Captain America: The Winter Soldier was released by Walt Disney Studios Home Entertainment for digital download on August 19, 2014 and on Blu-ray, Blu-ray 3D, and DVD on September 9, 2014. The physical media releases include behind-the-scenes featurettes, audio commentary, deleted scenes, and a blooper reel.[159]The film was also collected in a 13-disc box set, titled \"Marvel Cinematic Universe: Phase Two Collection\", which includes all of the Phase Two films in the Marvel Cinematic Universe. It was released on December 8, 2015.[160]","budget":"$170 million[2]"}