{"Context":"The film is set ten years after the year-long strike in 1984–85 by the National Union of Mineworkers in Britain. Before the privatisation of British Coal, a wave of pit closures took place. In contrast to the militancy of 1984–85, the miners put up little resistance. Many had been in debt ever since the long strike, and were prepared to take redundancy money whilst it was on offer. The National Coal Board arranged private ballots between closing a pit immediately with compulsory redundancies (which were relatively generous) or taking a pit to a review procedure to determine whether a profit could be made in the private sector (where any redundancy money would have probably been much lower). Although miners had a tradition of fighting for their jobs, the risk of losing the redundancy money on offer by going forwards to privatisation swung the votes in most ballots to be in favour of pit closure and redundancy. The loss of hope, pride and fighting spirit in what were previously proud mining communities was the basis for the idea of being \"brassed off\".The British miners were bitterly divided in the aftermath of the 84–85 strike. Although the majority of Yorkshire miners observed the year-long strike, a minority broke the strike and were ostracised in their communities as \"scabs\" thereafter. The word \"scab\" has a slightly broader meaning in Britain than in North America, and this is sometimes used in the film. Rather than referring solely to strikebreakers, the word \"scab\" can also refer to a traitor and particularly a traitor to the working class, which is used in the film for cases such as having a relationship with a management employee or going against the recommended line from the trade union. In a Yorkshire mining community, being called a \"scab\" is an extremely serious insult.Beginning in early 1993, groups of miners' wives camped outside some pits' gates and outside the Department of Trade and Industry in London.[3] This is referenced in the film. It contrasts with the muted response from the mineworkers, some of whom ironically sang Shut the pit! to the tune of the song Here we go! from the 1984-5 strike.[3]","country":"United Kingdom United States","distributed_by":"Channel Four Films (UK)|Miramax Films (US)|","Plot":"Gloria Mullins has been sent to her home town of Grimley to determine the profitability of the pit for the management of British Coal. She also plays the flugelhorn, and is allowed to play with the local brass band after playing Concierto de Aranjuez with them. The band is made up of miners from whom she must conceal her purpose. She renews a childhood romance with Andy Barrow, which soon leads to complications. Andy is bitter about the programme of pit closures and determined to fight on, but he is also realistic about the circumstances and predicts a 4-to-1 majority for closure and redundancy. When Andy realises that Gloria is working for management, he accuses her of naïvety for thinking that the Coal Board is considering whether the pit has any viable future and argues that the decision to close Grimley would have been taken years ago. It is later revealed during a confrontation between Gloria and the management of the colliery that the decision to close the colliery had been made two years previously, and that this was to have gone ahead regardless of the findings of her report; the report was simply a public relations exercise to placate the miners and members of the public sympathetic to their plight.The passionate band conductor, Danny Ormondroyd, finds he is fighting a losing battle to keep the rest of the band members committed. His son Phil is badly in debt and becomes a clown for children's parties, but fails to prevent his wife and children walking out on him. In debt, Phil votes for the redundancy money, which he becomes ashamed of. As Danny collapses in the street and is hospitalised, Phil suffers a mental breakdown while entertaining a group of children as part of a harvest festival in a church. He refers to himself as \"Coco the scab\"—a name that he had been called by a debt collector who he had asked to wait until the redundancy money had come through. Eventually he attempts suicide by trying to hang himself, but is taken to the hospital. Phil reveals to Danny that in light of the colliery's closure, the band has decided not to continue playing.When Jim realises that Gloria is working for management, he is unimpressed with Andy's relationship with her. In a pub conversation, the other miners are not particularly concerned and feel that Jim is being too harsh on Andy. When Andy says that he should be old enough to make his own decisions, Jim responds with, \"Old enough to be a scab then?\" This attracts the whole pub's attention, as it signals a serious argument. Jim then withdraws the insult and says that Andy is just \"stupid\". Later on in the film, Jim asks Gloria to leave the band and mocks her attempts to fund the band's trip to the National Finals.With the intention that it will be their last performance, the band, in full uniform, and wearing their miners' helmets and lamps, plays \"Danny Boy\" late at night outside the hospital. Andy, having lost his tenor horn in a bet, whistles along with his hands in his pockets. After they finish, they all switch off their lamps.Whilst the band is playing in the National Semi-Finals, the outcome of the ballot is announced as 4-to-1 in favour of redundancy, as Andy had predicted. (It is later implied that, of the five miners who make up the main characters, four of them had voted for redundancy and only Andy had voted for the review procedure.)After Gloria sets up a bank account to fund travel to the National Finals, the band is brought back together to compete. Andy wins his tenor horn back in a game of pool, and having forgiven Gloria, after she gives them the money she was paid to compile the report (saying she does not want it because it's \"dirty money\"), the band travels to the final at the Royal Albert Hall in London (Birmingham Town Hall was used to film these scenes),[4] where they are amused by the inability of the woman on the dressing room's PA system to pronounce \"colliery\". Before departing, Phil leaves a note for Danny saying that they are going to the finals. Danny arrives just in time to see the band win the competition with a stirring rendition of \"The William Tell Overture\", during which Phil notices his wife and children are in the audience. Danny refuses to accept the trophy stating that it is only human beings that matter and not music or the trophy and that \"this bloody government has systematically destroyed an entire industry. Our industry. And not just our industry—our communities, our homes, our lives. All in the name of 'progress'. And for a few lousy bob.\" However, following this gesture, another band member takes the trophy anyway. The band celebrates their victory as Andy and Gloria kiss on the upper deck of an open-topped bus travelling through London, while the rest of the band play Land of Hope and Glory conducted by Danny.","In popular culture":"A sample of a monologue performed by the main character Danny (Pete Postlethwaite) is used in the opening of the song Tubthumping, on the 1997 Chumbawamba album Tubthumper: \"Truth is, I thought it mattered; I thought that music mattered. But does it bollocks! Not compared to how people matter\".[6] The album also ends with the final lines of the same monologue: \"Oh, aye, they can knock out a bloody good tune, but what the fuck does that matter? Now I'm going to take my boys out onto the town. Thank you.\"[citation needed]","brassed_off":"Theatrical release poster","language":"English","box_office":"£3 million[1]","cinematography":"Andy Collins","production_company":"Prominent Features Channel Four Films Miramax Films","directed_by":"Mark Herman","Soundtrack":"The film score for Brassed Off is composed by Trevor Jones[5] although some titles existed before Jones' commission as original compositions for brass band or arrangements, for example \"Death or Glory\" and \"Floral Dance\" respectively.","release_dates":"1 November 1996 (1996-11-01) (United Kingdom)|23 May 1997 (1997-05-23) (United States)||||","Production":"The film is set in \"Grimley\" in the mid-1990s, which is a thin veil for Grimethorpe, which had been named as the poorest village in Britain two years earlier by the European Union. The nearby areas of the Dearne Valley and the Hemsworth area were also identified as in need of serious aid. The soundtrack for the film was recorded by the Grimethorpe Colliery Band, the story roughly reflects Grimethorpe Colliery Band's history, and the film was largely shot in Grimethorpe.[4]","produced_by":"Steve Abbott","starring":"Pete Postlethwaite|Tara Fitzgerald|Ewan McGregor|Stephen Tompkinson|","running_time":"107 minutes","music_by":"Trevor Jones","edited_by":"Michael Ellis","written_by":"Mark Herman","budget":"£2.8 million[1]"}