{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","Plot":"The film is about Melanie Porter (Raven-Symoné), a 17-year-old college-bound girl who is getting ready to graduate from high school and really wants to go to Georgetown University. However, her father James Porter (Martin Lawrence), the chief of police in the quiet Chicago suburb where they live, is overprotective of Melanie, and isn't ready for her to leave and study so far away from home. Chief Porter has other plans for Melanie; he wants her to go to Northwestern University which is only 28 minutes away from home. Porter also receives problems from disagreements with his real estate agent wife, Michelle (Kym E. Whitley), the family pig Albert, who continuously annoys him, and his young son Trey (Eshaya Draper), who spends much time with the pig. Melanie gets invited to an interview at Georgetown after a college recruiter saw her performance at a mock trial. Her two best friends, Nancy (Brenda Song) and Katie (Margo Harshman), offer to take her on their college road trip to Pittsburgh. Melanie is all set to go with her friends until her father surprises her with his own college road trip to Washington, D.C..On their way, Melanie reluctantly visits Northwestern to take a tour. They meet an almost-too-happy father and daughter duo, Doug (Donny Osmond) and Wendy (Molly Ephraim), who are on their own college road trip. Porter has planted actors at Northwestern, one screaming at Melanie they lost an eye at Georgetown. Melanie almost falls for it until one of the actors says to her \"Yeah, the chief's a pretty smart guy\", since he never met Porter.Their car soon breaks down and they find Trey in the trunk with Albert and a supply of oxygen. They stop at a hotel (thanks to Albert's navigating) but end up causing trouble when Albert eats coffee beans and becomes hyperactive. They run into Doug and Wendy again, who offer Melanie and Porter a ride since Porter's car broke down. Later, Melanie and her father ride on a tour bus where they try to work out their differences. At one destination, Nancy and Katie show up and take Melanie to a sorority house. Porter, due to a misunderstanding, and the owner not letting him in to check on her, sneaks into the house. After hearing that his daughter has faith in him, he decides to leave the next morning. Unfortunately, after Melanie leaves, he gets caught by the owner, brutally tazed, and arrested. Porter's mother comes to bail him out, and opens up about her own past fears when her son went to the Army, but still believed in her son to go his own path.Porter and Melanie end up forgiving each other at the airport. After dropping off Trey, they skydive to make the interview at Georgetown. Melanie is nervous, but Porter tells her she can do it and that they didn't come all this way for nothing. She then is accepted into Georgetown, which Wendy is accepted into too.In the end, James copes with letting go and the final scene shows the Porter and Greenhut families at Thanksgiving dinner. Melanie introduces her boyfriend Tracy (Benjamin Patterson),who turns out to be a male. James accepts this, and Wendy announces her engagement to Scooter (Lucas Grabeel), a chipper young man who behaves exactly like Doug. This causes Doug to finally snap and attacks Scooter.Deleted scenes include an alternate opening where James foils a bank robbery and a phone conversation where Michelle Porter, a real estate agent, is listening to Melanie's and James's complaints while Michelle is in the middle of showing a house to a couple. The couple think Michelle is talking to another buyer and decide to buy the house themselves.","language":"English","Promotion":"To promote the movie in the United States, Raven-Symoné appeared on WWE WrestleMania XXIV, Chelsea Lately, MTV's TRL, Live with Regis and Kelly, The View, BET's 106 & Park,The Cheetah girls and The Oprah Winfrey Show. The theme song of the movie was \"Double Dutch Bus\", sung by Raven-Symoné. The music video for the song appeared on Disney Channel and was included in her self-titled album. The music video included scenes from the movie. Disney Channel TV spots were aired promoting the film in the United States.The first trailer appeared alongside Mr. Magorium's Wonder Emporium and Enchanted.Advertising for the film used the tagline \"They just can't get there fast enough.\"The film did not receive a cinema release in Australia. Although promotions for the film aired on Disney Channel Australia, a confirmed date for the movie to begin screening in theatres was never given. The film was released direct-to-DVD instead.","box_office":"$51.5 million","cinematography":"Theo van de Sande","production_company":"Walt Disney Pictures Gunn Films","directed_by":"Roger Kumble","Home media":"The film was released on DVD and Blu-ray on July 15, 2008. Both the DVD and BD releases contain the following bonus features.College Road Trip sold 439,809 copies in the first week of release pulling in $8,030,648 of additional revenue for the franchise. It has sold a total of 1,004,834 copies since its release and made a total of $18,461,049 in DVD sales.","Book":"In May 2008, Disney Press released a book based on the movie[12] written by Alice Alfonsi. The novel has the printed original movie poster as the cover.","release_dates":"March 7, 2008 (2008-03-07)|||||","Production":"Cinco Paul and partner Ken Daurio wrote the most recent draft. The movie was born out of the Disney Writers Program by Carrie Evans and Emi Mochizuki. The movie was produced by Andrew Gunn/Gunn Films and directed by Roger Kumble.[1]Filming began July 8, 2007. Raven-Symone's character's original first name was Rachael.","produced_by":"Andrew Gunn","starring":"Martin Lawrence Raven-Symoné Donny Osmond","running_time":"83 minutes","college_road_trip":"Theatrical release poster","music_by":"Edward Shearmur","edited_by":"Roger Bondelli","Release":"The film received mainly negative reviews from critics. The review aggregator at Rotten Tomatoes reported that 13% of critics gave the film positive reviews.[2] Metacritic gave the film a score of 34 out of 100, based on 46 reviews.[3]The New York Times gathered positive reviews toward the leading cast's performance. Despite the fact that Martin Lawrence received positive reviews from several magazines, Rotten Tomatoes criticized his appearance yet again. 411 Mania gave it a final score of 7.5 out of 10 based on several reviews and managed to give it a positive DVD and film review.[4] The film also received positive reviews from Blu-ray.com,[5] Kansas City Star and several other publications[6] including the Pittsburgh Post Gazette. The film also received negative reviews from USA Today and San Francisco Chronicle.In its opening weekend, the film grossed approximately $13.6 million in 2,706 theaters in the United States and Canada, ranking #2 at the box office.[7] The movie continued on to gross $31,117,834 to finish off the month and closed with earnings above $45 million in domestic territories.[citation needed]","written_by":"Emi Mochizuki Carrie Evans Cinco Paul Ken Daurio"}