{"be_cool":"Theatrical release poster","based_on":"Be Cool  by Elmore Leonard","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Peter Steinfeld","Plot":"Chili Palmer (John Travolta), after years of filmmaking, enters the music industry after witnessing the execution, by the head of the Russian mob, of his friend Tommy Athens (James Woods), owner of a record company. Chili uses the opportunity to help his friend's widow, Edie Athens (Uma Thurman), manage the failing business, which owes $300,000 to the hip hop producer Sin LaSalle (Cedric the Entertainer). Chili enters the music industry on the talents of a female entertainer, Linda Moon (Christina Milian). Moon convinces Chili to take on her cause, getting out of contractual obligations to Nick Carr (Harvey Keitel) and Raji (Vince Vaughn), who has a gay Samoan bodyguard named Elliott (The Rock), an aspiring actor and the butt of Carr and Raji's homophobic jokes. Carr and Raji take exception to Chili's intervention, and hire a hitman, Joe \"Loop\" Lupino (Robert Pastorelli) to kill Chili. In the meantime, Chili convinces Edie to produce Moon, hoping to resurrect Athens' failing record company through a live performance with Steven Tyler and Aerosmith.LaSalle threatens Chili and Edie for payment of the $300,000, but they convince him to give them a few days to get the money plus the vig. When the Russians attempt to kill Chili, Joe Loop mistakenly kills Ivan Argianiyev (George Fisher), the Russian Mob hitman. Carr is furious about the mistake and demands Raji to confront Loop at once. Raji then kills Loop with a bat after Loop \"disrespects\" him. After Chili talks Linda into leaving Carr and his girl group, Carr tries to trick Chili by handing him a pawn ticket, claiming that Linda's contract was at the pawn shop owned by the Russians. This is actually a set-up by Carr to get Chili killed.Knowing about this trick, Chili hands the ticket to Edie, who turns it over to the police. Now the cops, instead of Chili, pay the Russians a visit. Meanwhile, Raji and Elliot set up LaSalle by making him believe that Carr tricked Chili in giving him the $300,000 grand to get Linda's contract. Furious, LaSalle and the DubMD pay Carr a visit to confront him in his office. Believing that Carr tricked him, Bulkin and his men pay a visit to Carr's office while Sin LaSalle and the DubMD's are there. Insulted by Bulkin's racist remarks, LaSalle kills him. In the meantime, Raji sends Elliot to kill Chili. However, Chili befriends Elliot and tells him that he can help him out with his acting career. When Carr threatens Chili, Chili sends him to the hands of the police with a pawn ticket. Finally when Raji and Elliot threaten Chili, he again befriends Elliot when Edie helps him figure out how to answer his cell phone message on it. After learning that Chili had gotten him an audition for a film, Elliot turns on Raji because he erased the evidence of it on his answering machine. For all his smooth talking and flamboyant wardrobe, Raji finds himself in a firework conflagration which roasts him live on camera. Carr is arrested on murder charges when they find him with the bat used to kill Joe Loop.During all of this confusion, Chili squeezes in a dance scene with Edie (a nod to his \"Twist Contest\" scene, also with Thurman, in Pulp Fiction) and Moon gets her debut with Aerosmith. Finally, LaSalle becomes the producer for Moon and Elliot embarks on a successful acting career (his first film is with Nicole Kidman).","language":"English|Russian|","box_office":"$95.2 million","Synopsis":"Chili Palmer helps the widow of an executed friend to resurrect a record company using the talents of young and talented female vocalist and songwriter. The plot is complicated by several facts:","cinematography":"Jeffrey L. Kimball","production_company":"Jersey Films","directed_by":"F. Gary Gray","Soundtrack":"The film's soundtrack was released on March 1, 2005.Songs featured in the film but not included in the soundtrack are:","release_dates":"March 7, 2005 (2005-03-07)|||||","produced_by":"F. Gary Gray|Danny DeVito|Michael Shamberg|Michael Siegel|","starring":"John Travolta|Uma Thurman|Vince Vaughn|Cedric the Entertainer|Andre Benjamin|Steven Tyler|Christina Milian|Harvey Keitel|The Rock|Danny DeVito|","running_time":"120 minutes[1]","music_by":"John Powell","edited_by":"Sheldon Kahn","Release":"On a production budget of $53 million, Be Cool grossed $56,046,979 in North American and $39,169,077 internationally, totaling up to $95,216,056 worldwide.Be Cool received a 30% rating, based on 169 reviews, with an average rating of 4.6/10. The site's critical consensus reads: \"Be Cool is tepid, square, and lukewarm; as a parody of the music business, it has two left feet.\"[2] On Metacritic, the film has a score of 37 out of 100, based on 38 critics, indicating \"generally unfavorable reviews.\"[3] Halliwell called it \"a palpable miss, a movie so lazy and laid back that it falls over; there are none of those insights ... that made Get Shorty so enjoyable\".[4]In an August 2015 interview with Deadline, director F. Gary Gray discussed the failure of the film, stating: \"With Be Cool, I made some assumptions in thinking that movie was going to work. I’d just made a successful PG-13 movie [The Italian Job], and when I walked into Be Cool, it was rated R and then at the last minute in preproduction I was told, “Well, you have to make this PG-13.” I should have walked off the film. This was a movie about shylocks and gangsta rappers and if you can’t make that world edgy, you probably shouldn’t do it. I walked in thinking I was going to make one movie and then it changed. Maybe it was arrogant of me to think because I had success in this realm of PG-13 I could make that work\".[5]","budget":"$53 million"}