{"country":"Australia","distributed_by":"Beyond Distribution","Plot":"In the isolated and fictional South Australian fishing town of Prospect Bay, the only thing that connects the black and white communities is football. Gary \"Blacky\" Black (Nathan Phillips) and Dumby Red (Luke Carroll) are an exception; teenage best friends from different sides of the tracks. Dumby is the star of the football team and likely to become the next big Aboriginal star in the big leagues. Gary is the bookish son of hard-drinking and brutal white fisherman Bob Black (Simon Westaway). He is attracted to Dumby's beautiful sister, Clarence (Lisa Flanagan). Blacky's supportive mother helps him become a better player as he is chosen to be the ruckman in the teams upcoming grand final. Blacky has to overcome thumper, the star player for the opposition. When gameday arrives Blacky at first struggles to make an impact on the game but Dumby inspires the team kicking several goals. When Dumby gets a mark near goals with the scores tied he hands it off to a team mate instead of taking the shot. The player kicks a point and blacky has to run into thumper to stop him from kicking the winning goal. Their team wins the premiership, but Dumby and Blackys elation is short-lived. Dumby is passed over for the best-on-ground medal for the coach's son Simon Robertson. Dumby is disgusted and angered by the obvious racially motivated decision.Disgruntled, Dumby and his cousin Pretty (Tony Briggs) attempt to rob the bar where the celebrations were held, hoping to find the best-on-ground medal. After breaking into the bar, they meet the drunk owner, beat him into unconsciousness and proceed to the safe with the key found in his pocket. Bob, waking to find the owner unconscious with a head wound, heads to the office and loads a double-barrelled shotgun. Bob sneaks up behind Dumby and fires a shot into the figure in the darkness. Bob discovers he has killed Dumby. Pretty, who's been hiding behind the door, jumps him and points the gun at his neck. Pretty reveals himself by removing his makeshift balaclava. He doesn't shoot Bob but fires the remaining round into the ceiling and runs away into the darkness. Bob is questioned by police over the shooting but is let off on the grounds of self-defense. Blacky is devastated over Dumby's death and angrily tosses his premiership medal into the lake. Clarence and Blacky console each other and fall in love. Bob and the family are greeted with hostility and harassed by the local Aboriginals which only further fuels Bobs violent temper and bigotry.Clarence sneaks into Blacky's room one night and they make love. The next morning Bob discovers them in bed and beats Blacky. He racially insults Clarence and throws her out. Fed up with his father, Blacky leaves. Blacky meets with Dumby's family and attends his funeral. He aqquires the best on ground medal and places it in Dumby's casket. After returning home he is confronted by Bob and is told he is no longer welcome in his house due to his relationship with Clarence. Blacky defiantly stands still even after Bob punches him repeatedly. Defeated and exhausted, Bob leaves the family never to come back. The football team is disbanded as no Aboriginal players show up to training or games. The film ends with Blacky and Clarence jumping into the lake and swimming in the water.","language":"English","box_office":"$2.5 million[2]","cinematography":"Mandy Walker","production_company":"Beyond Productions","australian_rules":"Australian Rules film poster","directed_by":"Paul Goldman","release_dates":"5 March 2002 (2002-03-05) (Adelaide Festival of Arts)|||||","produced_by":"Mark Lazarus","starring":"Nathan Phillips Luke Carroll Lisa Flanagan Kevin Harrington","running_time":"95 minutes[1]","music_by":"Mick Harvey","edited_by":"Stephen Evans","written_by":"Screenplay: Phillip Gwynne Paul Goldman Novel: Phillip Gwynne"}