{"country":"United States","distributed_by":"Lionsgate Films","Plot":"Mike Howell (Jesse Eisenberg) is a stoner who lives in the sleepy town of Liman, West Virginia, where he works as a convenience store clerk, and is planning to propose to his longtime girlfriend, Phoebe Larson (Kristen Stewart). Meanwhile, in Langley, Virginia, CIA agent Victoria Lasseter (Connie Britton) learns that Mike, the sole survivor of her unsuccessful Ultra program is to be eliminated by her rival, Adrian Yates (Topher Grace), whose Tough Guy project succeeded where hers failed. Feeling that she has a duty to protect Mike, Lasseter travels to Liman and \"activates\" Mike through a series of code words. Because of his excessive drug use, Mike fails to understand their significance, and she leaves in resigned frustration.Mike finds two of Yates' men planting a bomb in his car and is attacked, but his training allows him to quickly overpower and kill them. Horrified, he calls Phoebe and follows through, who reunites with him just as they're arrested for the apparent murders. Yates sends two Tough Guy operatives, Laugher (Walton Goggins) and Crane (Monique Ganderton), to kill Mike and Phoebe at the police station, but they evade Laugher and kill Crane before escaping to the apartment of Mike's drug dealing friend Rose (John Leguizamo), who begrudgingly hides them. Yates places the city under quarantine, and puts Lasseter and Mike's pictures on the local news. Lasseter contacts her former assistant, Petey Douglas (Tony Hale), to send her a weapon that she can use to defend herself and Mike. Yates finds out and threatens Petey with charges of treason, causing Lasseter to be denied further help. Yates then attacks Rose's apartment with three agents using a lethal gas. The agents kill Rose and his two guards, while Phoebe rescues Mike from the gas, which she is familiar with. When pressed for answers on her knowledge of the gas, Phoebe reluctantly reveals she was a CIA agent assigned to be Mike's handler, leaving him heartbroken.Laugher ambushes the duo and captures Phoebe. Mike is rescued by Lasseter and insists on returning back to his house. He then learns that he volunteered for the Ultra Program due to his criminal record and subsequently had his memories erased. He also learns that Phoebe's original mission was to get him settled in Liman and then leave, but chose to stay because she legitimately fell in love with him. Yates' men locate him, but Mike and Lasseter fight them off, prompting Yates to order a drone strike on the area. Petey refuses to follow his orders and secretly reports the situation to Yates' superior, Raymond Krueger (Bill Pullman). Mike contacts Yates and arranges to exchange himself for Phoebe. He sets off a series of fireworks and dispatches all of Yates' men before fighting and defeating Laugher, who is spared when Mike learns he is a mentally unbalanced man forcibly conscripted to Yates' Tough Guy program. Yates attempts to flee with Phoebe, but she escapes, while Yates is caught by Lasseter and nearly killed before Krueger intervenes and stops her.Mike finds Phoebe and proposes to her at gunpoint before State Troopers/Sheriffs. While in a forest in the rain Krueger talks to Yates and Lasseter, both kneeling and placed in bonds. Yates argues that what he was doing would have been okay with Krueger if the results had been successful . Krueger admits that he would have approved of what Yates had done if the results were successful. Yates, believing his life is being spared, stands and is executed by Krueger. Lasseter convinces Krueger to spare her life and Mike's by pointing out that, by taking out all of Yates' agents, he demonstrated he was both a valuable asset and that the Ultra program was already successful. Six months later, Mike and Phoebe are in the Philippines, agents on assignment, quite happy and confident now that they know who they are.","language":"English","Reception":"American Ultra grossed $14.4 million in North America and $12.7 million in other territories for a worldwide total of $27.1 million, against a budget of $28 million.[2]In its opening weekend, the film grossed $5.5 million, finishing sixth at the box office and third among the week's new releases, behind Sinister 2 ($10.5 million) and Hitman: Agent 47 ($8.3 million).[13]American Ultra received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 43%, based on 148 reviews, with an average rating of 5.4/10. The site's critical consensus reads, \"American Ultra has some interesting ideas, but like its stoned protagonist, it's too easily distracted to live up to its true potential.\"[14] On Metacritic, the film has a score of 50 out of 100, based on 31 critics, indicating \"mixed or average reviews\".[15] CinemaScore announced that audiences gave the film an average grade of \"B–\" on an A+ to F scale.[16]Mark Kermode of The Guardian gave the film two out of five stars, stating \"Jesse Eisenberg and Kristen Stewart brave an anarchic mish-mash with lots of violence but few laughs.\"[17] David Dishman of the McAlester News-Capital writes \"American Ultra promoted itself under the slogan, \"There is nothing more dangerous than a stoned cold killer,\" and while they may be right, there's also nothing spectacular about that stoned cold killer's movie.\"[18]Peter Travers of Rolling Stone awarded the film two of four stars: \"Soon the movie's twisty charm gives way to gory splatter. Eisenberg and Stewart stay appealing to the last. The movie, not so much.\"[19] Neil Genzlinger from The New York Times gave the film a mixed review, ending with \"A lot of it seems familiar, and Mr. Eisenberg and Ms. Stewart aren’t stretched much. But Mike finds amusing ways to defend himself using ordinary household items, Walton Goggins and John Leguizamo enliven things in goofy small roles, the plot has a nice twist or two, and your theater is probably air-conditioned.\"[20]Landis discussed the negative critical and box office performance of the movie in an interview with Red Letter Media.[21]","box_office":"$27.1 million[2]","cinematography":"Michael Bonvillain","directed_by":"Nima Nourizadeh","production_companies":"The Bridge Finance Company Circle of Confusion Likely Story Merced Media Partners PalmStar Media Capital PalmStar Entertainment Tadmor Entertainment","release_dates":"August 21, 2015 (2015-08-21)|||||","Production":"Principal photography began on April 14, 2014 in New Orleans and wrapped in mid-June.[5][6]","produced_by":"Anthony Bregman|Kevin Frakes|Raj Brinder Singh|David Alpert|Britton Rizzio|","starring":"Jesse Eisenberg|Kristen Stewart|Topher Grace|Connie Britton|Walton Goggins|John Leguizamo|Bill Pullman|Tony Hale|","running_time":"96 minutes[1]","american_ultra":"Theatrical release poster","music_by":"Marcelo Zarvos","edited_by":"Bill Pankow|Andrew Marcus|","Release":"On November 21, 2013, Apsara Distribution announced that they had acquired the rights to distribute the film outside the United States.[7] On March 1, 2014, Lionsgate announced their acquisition of the North American rights to the film.[8] On April 30, 2015, Lionsgate set an August 21, 2015, release date for the film.[9]The film was released on August 21, 2015, by Lionsgate.[10]The first still and two teaser posters were released on May 14, 2015 by MTV.[11] The red band trailer was released by Yahoo! Movies on May 28, 2015.[12]","written_by":"Max Landis","budget":"$28 million[2]"}