{"country":"United States","distributed_by":"Screen Gems (USA) PolyGram Pictures (Global)","DVD release":"The film was initially released on October 26, 1999 by Columbia TriStar Home Video. The DVD was reissued in Superbit on February 12, 2002 by Columbia TriStar Home Entertainment.","Plot":"Michael Faraday (Jeff Bridges) is a college history professor at George Washington University who has been raising his nine-year-old son, Grant (Spencer Treat Clark), alone since the death of his FBI agent wife, Leah. She was killed in the line of duty in a scene loosely based on the real-life Ruby Ridge incident. Somewhat of a specialist regarding American terrorism and due to teaching a class on terrorism at the university, Michael starts to become suspicious of his new neighbors Oliver (Tim Robbins) and Cheryl Lang (Joan Cusack), after taking their son, Brady (Mason Gamble), to the emergency room following a reported fireworks accident.At first Michael's suspicions are based on little things including Oliver's architectural blueprints that seem to be for something other than the shopping mall that he claims to be building, as well as pieces of mail that contradict where Oliver said he attended college. Neither Michael's girlfriend and former student, Brooke Wolfe (Hope Davis), nor his wife's former FBI partner, Whit Carver (Robert Gossett), believe any of his wild theories. After doing some digging, Michael discovers that Oliver's real name is William Fenimore and that when he was 16 he built a pipe bomb and used it to try to blow up a postal office in Kansas. William/Oliver confronts Michael about his looking into William's past, revealing that 'Oliver Lang' was the name of his friend who died in a hunting accident. William says his family farm went broke because the government 'appropriated' the river that ran through it 'for other uses'. According to William, his father then killed himself and made it look like a tractor accident so the family could claim the life insurance. He left a note for William explaining everything. William built the pipe bomb to get back at the government. When William's friend Oliver died he took his name the next day to hide his past.However, Michael continues to uncover potential evidence and starts to suspect that Oliver is a terrorist. One day, Brooke follows Oliver's car after witnessing a suspicious package delivery in a garage. Her trail ends at the headquarters of a mail delivery company from where she decides to call Michael and leave a message, finally accepting that his fears are founded. After hanging up the phone, she turns around, only to see Cheryl standing right behind her, who has obviously heard the whole message.Brooke's murder (which happens off-screen), is covered up by making it look like Brooke died in a car crash. Michael realizes this after discovering that at least two voice messages were left on his answering machine and then erased by someone who gained access to Michael's house while he was not home. He tells Carver that Lang may have been involved in Brooke's death and that he is going to get proof by traveling to St. Louis to talk to the father of a terrorist, named Arthur Scobee, who allegedly blew up an IRS building five years ago (a thinly veiled allusion to the Oklahoma City bombing,[1][2]) killing himself and 63 other people (including eight children) in the process.It becomes obvious to Michael that Scobee was set up after he talks with Scobee's father. Michael then suspects that his son may be in danger when he sees that the late Scobee was involved in the same Scouts-style group as the Langs. It is later revealed that Lang/Fenimore killed his friend Oliver to make it look like a hunting accident. Upon arrival back home, Michael confronts Oliver who immediately admits that he knows all about Michael's trip to St. Louis. Oliver Lang really is a terrorist, and he further threatens to have Grant killed if Michael is ever caught seen talking to \"a certain FBI agent\" about his past.Michael theorizes that Oliver intends to blow up the FBI headquarters and decides to try to stop him. However, Oliver and his co-conspirators use a Scout field trip to keep Grant as an unknowing hostage and prevent Michael from informing the authorities on them. Michael realizes his phone has been tapped and he becomes more paranoid and fearful over who else is involved with the Langs and who isn't. A few days later, Michael rents a car under an alias and follows a delivery van with the man involved with the Langs' plan. He then sees Grant in the back of the van with the Scout Taskmaster and gives chase, but Oliver intervenes and causes a crash, leading to a fistfight in an old building, where Michael tries to convince Oliver that killing a hundred people will not make a difference. After overpowering Oliver, Michael resumes following what he believes is the same van with Grant and the bomb in it, eventually leading him to force his way into the secure parking garage of the FBI federal building.Once there, Michael discovers that he has followed the wrong van and it is empty. Attempting to calm Michael, Whit informs him that he is the only person not cleared to be in the garage. Realizing his mistake too late, Michael rushes back to his car and opens the trunk—revealing the bomb that he was unknowingly transporting the whole time right into Oliver's target. The bomb then detonates by remote control of the driver of the other van just outside the building, killing Michael, Whit, and many others. Oliver watches the explosion from a distance at Arlington Heights with relief and satisfaction.Posthumously, Michael is portrayed by all news outlets as a lone terrorist who destroyed the FBI headquarters with the motive of seeking revenge for his wife's death. The Langs and their conspirators – who are shown to include the Scout taskmaster, a telephone maintenance man, a postman, and at least one of Faraday's students – are not under any suspicion. Michael's frightened and paranoid behavior and actions in the days prior to the bombing in fact played right into the Langs' plans to frame him for bombing that they planned for months in advance. Grant, now orphaned, ends up living with relatives, apparently unaware of his father's innocence. In the final scene, after seeing Grant away, the Langs decide to move out of the neighborhood to another state where they and their group will sooner or later plan their next terrorist strike as well as look for another fall guy to take the blame for their actions as they did with Michael Faraday and several others before him. Cheryl suggests to Oliver that they should go \"someplace nice, someplace safe...\"","arlington_road":"Arlington Road film poster","language":"English","Reception":"On a US$21.5 million budget,[3] the film made a worldwide gross of $41,067,311.[4] It opened at #6 in its opening weekend with $7,515,145 behind American Pie, Wild Wild West's second, Big Daddy's third, and Tarzan and The General's Daughter's fourth weekends.[5]The film holds a 62% rating on Rotten Tomatoes[6] and a 2/4 rating by Roger Ebert.","box_office":"$41.1 million","cinematography":"Bobby Bukowski","production_company":"Lakeshore Entertainment","directed_by":"Mark Pellington","release_dates":"July 9, 1999","produced_by":"Tom Rosenberg Sigurjón Sighvatsson","starring":"Jeff Bridges Tim Robbins Joan Cusack Hope Davis Robert Gossett","running_time":"117 minutes","music_by":"Angelo Badalamenti","edited_by":"Conrad Buff","written_by":"Ehren Kruger","budget":"$21.5 million"}