{"based_on":"L'emmerdeur (1973) and the play Le contrat by Francis Veber","country":"United States","screenplay_by":"Billy Wilder I.A.L. Diamond","Plot":"Hitman Trabucco has been hired to eliminate Rudy \"Disco\" Gambola before he testifies against fellow members of the Mob, but completing the contract becomes problematic once he encounters suicidal Victor Clooney, an emotionally disturbed television censor staying in the room adjacent to his in the Ramona Hotel in Riverside, California.When Victor climbs onto the ledge outside his window, Trabucco convinces him not to jump by agreeing to drive him to the Institute for Sexual Fulfillment, the nearby clinic where Victor's wife Celia, a researcher for 60 Minutes, is gathering information for a segment on the program.At the clinic, Victor discovers Celia has fallen in love with Dr. Zuckerbrot, who is concerned her husband's suicide will reflect badly on his practice. Trabucco accidentally is injected with a tranquilizer intended for Victor, who volunteers to fulfill the killer's contract when Trabucco's vision is impaired. After overcoming assorted complications, Victor completes his task. However, despite Victor's high hopes, Trabucco has no intention of sticking together and parts ways with him following their escape.Trabucco retires to a tropical island, where he unexpectedly is joined by his nemesis after Celia runs off with Dr. Zuckerbrot's female receptionist to become a lesbian couple. Desperate to see Victor gone, Trabucco suggests to his native attendant to reinstate the old custom of human sacrifices for the local volcano...","language":"English","Critical reception":"Of the mainstream critics, only Vincent Canby of the New York Times liked the film. Calling it \"slight but irresistible,\" he observed it \"doesn't compare with the greatest Wilder-Diamond films, including The Fortune Cookie, which launched Mr. Lemmon and Mr. Matthau as a team, but it is the lightest, breeziest comedy any one of them has been associated with in years.\" He added, \"There's something most appealing about the simplicity of the physical production and the small cast. I suspect that one of the reasons Buddy Buddy is so congenial, even when a gag doesn't build to the anticipated boff, is because you never feel intimidated by it. It doesn't attempt to overwhelm you with the kind of gigantic sets, props and crowd scenes that made farces on the order of 1941 and The Blues Brothers so oppressive. Buddy Buddy travels light, unencumbered by expensive special effects, fueled only by the talents of its actors and its director's irrepressible sense of the ridiculous.\" He said of Lemmon, \"Not in a long time has [he] been more appealing,\" and he described Matthau as \"extremely comic – perhaps our best farceur.\"[4]Far less enthusiastic was Roger Ebert of the Chicago Sun-Times, who stated, \"This movie is appalling. It made me want to rub my eyes. Was it possible that the great Billy Wilder . . . could possibly have made a film this bad? Buddy Buddy is very bad. It is a comedy without any laughs. (And, yes, I mean literally that it contains no laughs.) But it is worse than that. It succeeds in reducing two of the most charming actors in American motion picture history to unlikable ciphers. Can you imagine a film that co-stars Walter Matthau and Jack Lemmon and yet contains no charm, ebullience, wit, charisma – even friendliness? This whole movie is like one of those pathetic Hollywood monsters drained of its life fluids . . . Basically, we are invited to watch two drudges meander through a witless, pointless exercise in farce . . . Buddy Buddy is incompetent. And that is the saddest word I can think of to describe it.\"[5]Channel 4 said, \"Wilder helming the classic comic pairing of Matthau and Lemmon is always going to be difficult to dismiss, but it has to be said that all involved had seen better days at the time this got made . . . There's the recognizable chemistry between the two leads, but little else here to recommend. It would be foolish to come to this movie expecting The Odd Couple or The Apartment, but you do expect something a little better than this.\"[6]","box_office":"$7,258,543 (US)[2]","cinematography":"Harry Stradling Jr.","production_company":"Metro-Goldwyn-Mayer","directed_by":"Billy Wilder","buddy_buddy":"Theatrical release poster","release_dates":"December 11, 1981 (1981-12-11)|||||","Production":"L'emmerdeur, a huge hit in Europe, had been released as A Pain in the A-- in art houses in the United States, where it had enjoyed moderate box office success. MGM executives had then invited Billy Wilder to rewrite and direct an American adaptation. Wilder later recalled, \"I hadn't been working enough, and I was anxious to get back on the horse and do what I do – write, direct. This wasn't a picture I would have chosen.\"[3] Even before Wilder and his screenwriting partner I.A.L. Diamond began working on the script, the director offered the lead roles to Jack Lemmon and Walter Matthau, whom he previously had paired in The Fortune Cookie and The Front Page, and both men readily accepted. \"I couldn't say no to Billy,\" Matthau said, \"and I didn't want to say no to being in a Billy Wilder picture. But this wasn't a Billy Wilder picture.\"[3]Principal photography began on February 4, 1981, and from the start Wilder had problems with both the screenplay and casting. \"Wilder the writer let Wilder the director down,\" he stated. \"We had to write too fast. The script was done in three months. We always took much longer, but the wheels were rolling, and we had to go forward.\" Two weeks into filming, the director realized, \"It didn't work to have two comics together. I needed someone serious like Clint Eastwood as the hit man instead of a comedian like Matthau.\"[3]Lemmon already had made six films with Wilder, and he sensed a change in the director's approach to filmmaking. \"Billy seemed more tense. He seemed to be pushing harder, forcing it . . . It was something I couldn't put my finger on exactly. He had always been open to suggestions I had for my part . . . but this time, I didn't feel as welcome with my ideas, so I didn't say anything. Who am I to tell Billy Wilder what he should do?\"[3]The film was a critical and commercial failure, and in later years Klaus Kinski denied being in it. \"The best thing for me about Buddy Buddy was that not very many people saw it,\" Wilder said. \"It hurts to strike out on your last picture.\" Anxious to bounce back from the unhappy experience, he and Diamond immediately went to work on what they hoped would be their next project. \"Iz and I had so many ideas, we'd work on one for four weeks, and then we'd start another. We'd been burned; we chose wrong with Buddy Buddy, and we didn't want to make another mistake. We'd had some failures, so our confidence wasn't as good.\" Although the writing team continued to collaborate until Diamond's death in April 1988, none of their work reached the screen.[3]","produced_by":"Jay Weston","starring":"Jack Lemmon Walter Matthau Paula Prentiss Klaus Kinski Dana Elcar Miles Chapin Ed Begley, Jr. Michael Ensign","running_time":"96 minutes","music_by":"Lalo Schifrin","edited_by":"Argyle Nelson","budget":"$10 million[1]"}