{"country":"Spain","distributed_by":"Focus Features Newmarket Films Telecinco Cinema","Plot":"In 391 AD, Alexandria is part of the Roman Empire, and Greek philosopher Hypatia is a teacher at the Platonic school, where future leaders are educated. Hypatia is the daughter of Theon, the director of the Musaeum of Alexandria. Hypatia, her father's slave, Davus, and two of her pupils, Orestes and Synesius, are immersed in the changing political and social landscape. She rejects Orestes's love (she offers him her bloody menstrual towel, to show him that love has its drawbacks, while studying has none): she prefers to devote herself to science. Davus assists Hypatia in her classes and is interested in science, and is also secretly in love with her.Meanwhile, social unrest begins challenging the Roman rule of the city as Pagans and Christians come into conflict. When the Christians start defiling the statues of the pagan gods, the pagans, including Orestes and Hypatia's father, ambush the Christians to squash their rising influence. However, in the ensuing battle, the pagans unexpectedly find themselves outnumbered by a large Christian mob. Hypatia's father is gravely injured and Hypatia and the pagans take refuge in the Library of the Serapeum. The Christian siege of the library ends when an envoy of the Roman Emperor Theodosius I declares that the pagans are pardoned, however the Christians shall be allowed to enter the library and do with it what they please. Hypatia and the pagans flee, trying to save the most important scrolls, before the Christians overtake the library and destroy its contents. Davus chooses to join the Christian forces. He later returns with a gladius and starts sexually assaulting her, but quickly begins to sob and offers his sword to her. However, she removes his slave collar and tells him he is free.Several years later, Orestes, now converted to Christianity, is prefect of Alexandria. Hypatia continues to investigate the motions of the Sun, the Moon, the five known \"wanderers\" (planets) and the stars. Some Christians ridicule the thinking that the Earth is a sphere, by arguing that people far from the top would fall off the Earth. When they ask Davus his opinion he avoids conflict by saying that only God knows these things.Hypatia also investigates the heliocentric model of the solar system proposed by Aristarchus of Samos; by having an object dropped from the mast of a moving ship she demonstrates to Orestes that a possible motion of the Earth would not affect the motion, relative to Earth, of a falling object on Earth. However, due to religious objections against heliocentrism, the Christians have now forbidden Hypatia to teach at the school. The Christians and the Jews come into conflict, committing violent acts against each other.The leader of the Christians, Cyril, views Hypatia as having too much influence over Orestes and stages a public ceremony intended to force Orestes to subjugate her. Hypatia's former pupil, Synesius, now the Bishop of Cyrene, comes to her rescue as a religious authority counterweight, but says he cannot help her unless she accepts Christianity; she refuses. Hypatia makes a personal discovery, theorizing that the Earth orbits around the Sun in an elliptic, not circular, orbit with the Sun at one of the foci. Cyril convinces a mob of Christians that Hypatia is a witch and they vow to kill her. Davus tries to run ahead to warn Hypatia, but she is captured by the mob. They strip Hypatia naked and are about to skin her alive until Davus persuades the mob otherwise, and they decide to stone her instead. When everyone goes outside to collect stones, Davus secretly suffocates her to spare her the pain of being stoned to death and tells the mob that she fainted. Davus leaves as they begin to stone her.","language":"English","Reception":"British writer and film critic Peter Bradshaw of The Guardian praised Alejandro Amenábar and his film, describing Agora as \"an ambitious, cerebral and complex movie.... Unlike most toga movies, it doesn't rely on CGI spectacle, but real drama and ideas.\" Bradshaw also applauded Rachel Weisz's role as Hypatia, calling it \"an outstanding performance\".[26] American screenwriter and critic Roger Ebert liked the film and gave it three stars out of four. He said: \"I went to see Agora expecting an epic with swords, sandals and sex. I found swords and sandals, some unexpected opinions about sex, and a great deal more.\"[27]The film holds a 52% 'Rotten' rating on Rotten Tomatoes based on 87 reviews.[28]The Religious Anti-Defamation Observatory (Observatorio Antidifamación Religiosa), a Spanish Catholic group, claimed that the film was responsible for \"promoting hatred of Christians and reinforcing false clichés about the Catholic Church.\"[18] Michael Ordoña of the Los Angeles Times acknowledges that the film has been criticized for \"perceived slights against Christians\" but that \"its lack of condemnation of specific dogma makes the film's target seem to be fundamentalism in general\".[29]In contrast, the New York-based Rev. Philip Grey wrote a positive review of the film and strongly recommended it: \"Christians who see themselves in the fanatic, murderous monks of the film and feel offended need to do some serious soul-searching.(...) Hypatia as depicted in the film is firmly opposed to what, in her time and at her city, is offered—or rather, imposed by brute force—under the name of 'Christianity'. Nevertheless, she seems to me far more a follower of the precepts of Christianity than are her persecutors and tormentors.(...) In particular, in watching the deeply moving final scene, her going calmly to her death amidst the jeering mob, I could not help but strongly recall Jesus Christ on His own way to Golgotha\".[30]Agora was Spain's highest grossing film of 2009, earning over $10.3 million within four days of its release on October 9.[28]Based on North American theatre tracking data from Rentrak Theatrical, indieWIRE reported that Agora \"scored the highest per-theater-average of any film in the marketplace\" during the Memorial Day holiday weekend from May 28 through May 31, just after its U.S. limited release.[31] Despite this very high per-theater average, Agora was never widely released in the USA. According to Box Office Mojo, its widest release in the USA was just 17 theaters.[32]The film grossed over $32.3 million (€21.4 million) by 1 December 2009, and about $35 million by 1 February 2010. As of 10 January 2011, Agora's worldwide box office earnings were approximately $39 million.[33] DVD and Blu-ray sales numbers are not publicly available.Agora was nominated for 13 Goya Awards, winning 7.[14] The film won the Alfred P. Sloan Foundation Feature Film Prize ($25,000 USD) in 2009 at the Hamptons International Film Festival.[34]","box_office":"$39,041,505","Historical accuracy":"Before its release, the distribution company insisted on screening the film at the Vatican. No objections were reported and Vatican officials assisted in some of the religious depictions. According to Amenábar, \"There’s one scene in which Cyril reads from St. Paul and [the Vatican] tried to look for the softest version. In the English version, [it is] taken from the King James version of the Bible.\"[8] The line is excerpted from 1 Timothy 2:8 - 2:12.[35]Antonio Mampaso, a Spanish astrophysicist and one of Agora's scientific advisors, stated in an interview that \"We know that Hypatia lived in Alexandria in the IV and V centuries CE, until her death in 415. Only three primary sources mention Hypatia of Alexandria, apart from other secondary ones\". He added that none of Hypatia's work has survived but it is thought, from secondary sources, that her main fields of study and work were geometry and astronomy. Mampaso claimed that Hypatia invented the hydrometer, an instrument still in use today, and that probably her father Theon of Alexandria, together with Hypatia, invented the astrolabe.[36] However, it is generally accepted that the astrolabe had already been invented a couple of centuries earlier, and that the instrument was known to the Greeks before the Christian era.[37][38] Similarly, the hydrometer was invented before Hypatia, and already known in her time. In this regard, Pappas of Alexandria was recorded as using the hydrometer before Hypatia was even born. Synesius sent Hypatia a letter describing a hydrometer, and requesting her to have one constructed for him.[39][40][41]Robert Barron, an American Catholic priest, writes in an article: \"Hypatia was indeed a philosopher and she was indeed killed by a mob in 415, but practically everything else about the story that Gibbon and Sagan and Amenábar tell is false\".[42] Irene A. Artemi, a doctor of theology at Athens University, states that \"The movie—albeit seemingly not turning against the Christian religion—is in fact portraying the Christians as fundamentalist, obscurantist, ignorant and fanatic\".[43] Similarly, the atheist Armarium Magnus blog said: \"Over and over again, elements are added to the story that are not in the source material: the destruction of the library, the stoning of the Jews in the theatre, Cyril condemning Hypatia's teaching because she is a woman, the heliocentric \"breakthrough\" and Hypatia's supposed irreligiosity.\"[44]","cinematography":"Xavi Giménez","directed_by":"Alejandro Amenábar","release_dates":"October 9, 2009 (2009-10-09)|||||","Production":"After Amenábar completed The Sea Inside (2004), he took a break and traveled to the island of Malta, where he used his free time to explore the night sky. Seeing the Milky Way galaxy, Amenábar began to discuss astronomy with his friends, speculating about extraterrestrial life on other planets. He started to research astronomy and came across Cosmos: A Personal Voyage, by American astronomer Carl Sagan.[9] Amenábar also studied historical figures such as Ptolemy, Copernicus, Johannes Kepler and Galileo,[10] but found himself most interested in the story of Hypatia, a 4th-century Greek astronomer whose history, he felt, was still relevant in the 21st century: \"We realized that this particular time in the world had a lot of connections with our contemporary reality. Then the project became really, really intriguing, because we realized that we could make a movie about the past while actually making a movie about the present.\"[11]To prepare for the task of recreating the ancient city of Alexandria without relying on computer generated imagery, Amenábar reviewed older sword-and-sandal films such as The Ten Commandments (1956), Ben-Hur (1959), and Pharaoh (1966).[9] A year before the start of pre-production, designer Guy Hendrix Dyas spent three weeks with Amenábar in Madrid to do some preliminary work on the set designs and the recreation of the ancient city of Alexandria so that previs animations could be generated.The film was produced by Fernando Bovaira, with Telecinco Cinema as the primary producer along with Mod Producciones, Himenoptero, and Sogecable as co-producers.[12]Principal photography began on March 17, 2008, on the island of Malta, and was scheduled to last 15 weeks.[13] Production designer Guy Hendrix Dyas used large sets on location instead of computer generated imagery at Amenábar's direction.[14] The construction of the set employed almost 400 people, and was the largest ever designed on the island. Actor Charles Thake (Hesiquius) suffered minor facial injuries on the set when he collided with extras running during a scene.[15] Filming ended in June.[8]","produced_by":"Fernando Bovaira Álvaro Augustin","starring":"Rachel Weisz Max Minghella Oscar Isaac","running_time":"126 minutes","music_by":"Dario Marianelli","edited_by":"Nacho Ruiz Capillas","Release":"Agora premiered at the 2009 Cannes Film Festival,[16] but the film was initially unable to find a domestic distributor due to its large budget and length.[17] The film also had trouble finding a distributor in both the USA and Italy, although it eventually found distributors in both countries.[18][19] The North America premiere was held at the Toronto International Film Festival in September, 2009.[20] Agora opened in Spain on October 9, 2009, breaking box office records for that country.[21] A limited release in the U.S. began on May 28, 2010, opening on two screens at the Paris Theatre and the Sunshine Cinema in New York. The film opened on the West Coast of the U.S. on June 4, playing only two screens: at The Landmark theatre in Los Angeles and at Regal's Westpark 8 in Irvine.[22]In March 2010, Agora was released in Region 2-locked DVD and Blu-ray formats.[23] A Region 1-locked DVD was released October 2010.[24]","agora":"Teaser poster","written_by":"Alejandro Amenábar Mateo Gil","budget":"$70 million"}