{"country":"United States","distributed_by":"Paramount Pictures","Plot":"In 1999, Ken Carter takes over the head coaching job for the basketball team at his former high school Richmond, having played on the team himself and earning records. Carter quickly sees that the athletes are rude and disrespectful, and are in need of discipline. He hands the players individual contracts, instructing them to attend all of their classes, sit in the front row of those classes, wear dress shirts and ties on game days, refer to everyone (players and coach alike) as \"sir\", and maintain a 2.3 (C+) grade point average, among other requirements. Carter also asks the school staff for progress reports on the players' grades and attendance. He teaches them to play a disciplined brand of basketball.In the gym, Carter is faced by hostility from the players and one of them, Timo Cruz attempts to punch him but he stops him by putting his arm on his back and pushing him against the wall. Cruz quits the team in anger along with two other players, the previous season top scorers. Carter warns them that, if they are late for practice, then they will run suicides (a type of sprint touching the court's lines), and, if they act disrespectful to him, then they will do push-ups. He then orders them to do a series of suicides for one hour to improve their conditioning. Later, Carter's son, Damien, decides to join the team, after quitting the private school St. Francis. Shocked, Carter asks why he did this, and Damien tells him that he wants to play for his father. Carter reluctantly agrees but holds his son to a higher set of standards than the rest of the team.Kenyon Stone struggles to come to terms with his girlfriend, Kyra who is pregnant, unsure if he can juggle basketball and prepare for college as well. Later at a game, Cruz watches the team win and then asks Carter what he has to do to get back on to the team. Carter agrees but on one condition: he needs to do 2,500 push-ups and 1,000 suicides before Friday. At a school dance, Stone talks to his girlfriend about the baby and says he does not want to live that way. He asks her what she's going to do after the baby is born and believes that she would not know what to do. She angrily tells him that she is having the baby.During a practice, Carter tells Cruz to give up because it is impossible to complete all of the push ups and suicides by Friday. When the day arrives, Cruz has not been able to finish but the team help him by doing some of his push-ups and suicides, getting him back on the team. On a game day, Carter asks Cruz what his biggest fear is, and Cruz is confused by the question. Later, the team won the game. Carter learns that one particular student does not attend classes: Junior Battle. Later in practice, Carter talks to Battle, who does not seem to be worried about it, so Carter suspends him for games. After a confrontation, Battle leaves the team in anger. Afterwards, Battle's mother asks Carter to let him back on the team. Carter says that he needs to hear that from Battle himself. Battle apologizes for what he did and is allowed back on the team, but is told that he had to do 1,000 push-ups and 1,000 suicides to make up for it.The team goes on to have an undefeated record, eventually winning the Bay Hill tournament. The team go off to a party hosted in a girl's house, without the knowledge of her parents. After looking for the players to celebrate, Carter goes to the house and orders his team to leave. In the bus going home, Carter criticizes his team for their reckless behavior, while Cruz points out that they won the tournament and already gave Carter what he wanted: winners. Back at school, Carter discovers that the progress reports show that some of the students have been skipping classes and failing academically. Enraged, Carter locks the gym and sends his players to the library to study with their teachers. This upsets the players, especially Cruz, who quits the team again, stating that he had tried so hard to do all those push-ups and suicides for Carter, to get back on the team in the first place.Later, Carter is criticized by parents and academic personnel alike for his decision to lock down the gym. The school board eventually confronts Carter, who explains how he wants to give his team the opportunity and option for further education so that they won't resort to crime, asserting that achieving a sound education is more important for the students than winning basketball games. One night, someone throws a brick through Carter's store window for not letting the team play. The next day, a man pulls up next to Carter's car at a stoplight then proceeds to spit on his window, taunting him about his decision to lock down the gym. Carter became enraged and tries to hit him, but Damien breaks up the fight. Later that evening, while Cruz is hanging out with his drug dealer cousin Renny, he saves three of his teammates from being harassed by some gangsters, but when the drug deal goes wrong, his cousin is shot dead, leaving Cruz distraught. Cruz goes to the Carters' house and begs to be allowed back on the team. Carter comforts him and allows it.The board holds an assembly about the lockout. Carter states that he wants to prevent his players from resorting to crime. A man suggests that Carter should be removed from the basketball coach position, which the school refuses, which then leads him to suggest that they should end the lockout. Carter promises that he will quit if the lockout is ended. Principal Garrison and the chairman vote to not end the lockout, but the other board members (four) vote in favor of ending it. Carter is shocked to find his players in the gym with desks and teachers, studying and working to bring their grades back up. The athletes decide to fulfill Carter's original intention of them pursuing academic achievement before continuing to play their next game. Cruz answers Carter's question about fear and thanks him for saving his life. They work hard and eventually raise their grade point average to a point that fulfills their contracts. Later, Stone talks to Kyra about the baby. She reveals that she had an abortion and tells Kenyon that he should go play basketball in college.The Oilers eventually end up competing in the state CIF high school playoffs, but come up short to St. Francis by just 2 points after a game winning three-point shot by rivals Ty Crane. Nevertheless, Carter is proud of his players accomplishing their goals of having a proper education. The film's epilogue displays a series of graphics stating that a number of players went on to attend college and play basketball, such as Kenyon, Lyle, Junior, \"Worm\", Cruz, and Damian.","language":"English","box_office":"$76.7 million[1]","cinematography":"Sharone Meir","production_company":"MTV Films Tollin/Robbins Productions","directed_by":"Thomas Carter","Response":"Coach Carter received generally positive reviews from critics. On Rotten Tomatoes, the film has a rating of 65%, based on 145 reviews, with an average score of 6.1 out of 10. The site's consensus reads: \"Even though it's based on a true story, Coach Carter is pretty formulaic stuff, but it's effective and energetic, thanks to a strong central performance from Samuel L. Jackson.\"[10] On Metacritic, which assigns a weighted average, the film has a score of 57 out of 100, based on 36 critics, indicating \"mixed or average reviews\".[11]Coach Carter premiered in cinemas on January 14, 2005 in wide release throughout the United States.[1] During that weekend, the film opened in 1st place grossing $24.2 million from 2,524 locations, beating out Meet the Fockers ($19.3 million).[12] The film's revenue dropped by 24% in its second week of release, earning $8,015,331. For that particular weekend, the film slipped to 5th place with a slightly higher theater count at 2,574. The thriller film Hide and Seek opened in 1st place with $21,959,233 in box office business.[13] During its final week in release, Coach Carter opened in 61st place grossing a marginal $26,554 in revenue. For that weekend period, The Hitchhiker's Guide to the Galaxy starring Martin Freeman opened in 1st place with $21,103,203 in box office receipts.[14] Coach Carter went on to top out domestically at $67,264,877 in total ticket sales through an initial 16-week theatrical run.[1] For 2005 as a whole, the film would cumulatively rank at a box office performance position of 36.[15]The film was nominated and won several awards in 2005–06.","Soundtrack":"The original motion picture soundtrack for Coach Carter was released by the Capitol Records label on January 11, 2005. The score for the film was orchestrated by Trevor Rabin. An extensive list of songs is featured on the soundtrack, which differs from the soundtrack recording. The recording includes five songs which were not featured in the film: \"About da Game\" by Trey Songz; \"Balla\" by Mack 10 featuring Da Hood; \"Beauty Queen\" by CzarNok; \"What Love Can Do\" by Letoya; and \"Wouldn't You Like to Ride\", by Kanye West, Malik Yusef, and Common.","release_dates":"January 14, 2005 (2005-01-14)","Production":"Filming locations for the motion picture included, Long Beach, California and Los Angeles.[6]","produced_by":"David Gale Brian Robbins Michael Tollin","starring":"Samuel L. Jackson Rob Brown Channing Tatum Rick Gonzalez Ashanti","running_time":"134 minutes","music_by":"Trevor Rabin","edited_by":"Peter Berger","Release":"Following its cinematic release in theaters, the Region 1 Code widescreen edition of the film was released on DVD in the United States on June 21, 2005. Special features for the DVD include; two commentaries: Coach Carter: The Man Behind the Movie, Fast Break at Richmond High, Deleted Scenes, Music Video: \"Hope\" by Twista Featuring Faith Evans, Previews and Scene Selection.[7]A restored widescreen hi-definition Blu-ray Disc version of the film was released on December 16, 2008. Special features include; two commentaries - The Man Behind the Movie; Fast Break at Richmond High; 6 Deleted scenes; \"Hope\" music video by Twista featuring Faith Evans; Writing Coach Carter: The Two Man Game; Coach Carter: Making the Cut; and the theatrical trailer in HD.[8] An additional viewing option for the film in the media format of Video on demand has been made available as well.[9]","coach_carter":"Theatrical release poster","written_by":"Mark Schwahn John Gatins","budget":"$30 million[1]"}