{"country":"United States","distributed_by":"New World Pictures","Plot":"Scarlett (Tatum O'Neal) is a hardened street kid who supports herself with prostitution and drug dealing. Facing charges for killing a client, Scarlett is brought to court. At court, she briefly encounters Tracy Freeman (Irene Cara). Tracy, a doctor's daughter, has been arrested for drug possession and resisting arrest. Tracy admits to using racial slurs against the white officer who arrested her, implying that he also used racial slurs toward her.The two are seated in front of a judge along with other criminal defendants. One of the other defendants begins acting out in front of the judge. When the judge orders the bailiff to restrain her, the defendant slashes the bailiff's throat with a concealed weapon. Another defendant disarms another bailiff and a shoot-out begins.Scarlett and Tracy, along with all the others in the courtroom, escape. The police, not knowing that Scarlett and Tracy were not involved in the shooting, pursue them. The two girls eventually take refuge in the sewer. Tracy wants to turn back; Scarlett on the other hand refuses, convinced that they will be blamed and wanting to avoid prosecution for her crimes. She bullies Tracy into continuing.Meanwhile, Tracy's father, Dr. Freeman (Moses Gunn) unsuccessfully tries to convince Lt. Speier (George Murdock) that his daughter wasn't involved in the shooting. The police officer then tells Dr. Freeman that seven people were killed in the shoot out.A lone police officer manages to capture Scarlett and Tracy in the sewer. While waiting for back-up, the police officer lights a cigarette and inadvertently sparks an explosion of sewer gas. Tracy attempts to save the officer but he drowns. Once again, Tracy urges that they give themselves up; Scarlett again refuses, telling Tracy that police officers are inclined to kill people suspected of killing police officers. She also inadvertently admits to being illiterate. The girls emerge from the sewer.The two hail a cab to the derelict section of town. Scarlett attempts to ditch Tracy. Tracy refuses to be left as she does not know where she is and is unwilling to call her father for help. Scarlett threatens Tracy with a broken bottle and insults Tracy with a racial slur. Tracy slams Scarlett into a wall and insists that Scarlett help her find a place to clean herself up.Scarlett takes her to the apartment of Sniffer (Nicholas Campbell), a casual boyfriend of hers who produces pornography and sells drugs. Scarlett convinces Sniffer to allow Tracy to shower. While Tracy bathes, Scarlett and Sniffer argue, with Sniffer admitting to have set her up with the man that she was accused of killing. Scarlett then tries to convince Sniffer to run off with her. Sniffer becomes angry, pulls a knife on Scarlett, and throws her out of his apartment. Sniffer then attempts to rape Tracy in the shower. She fights him off, rendering him unconscious.Scarlett then goes to yet another boyfriend, Rodney (Peter Fonda), seeking help. Not only does he refuse, he ends up slicing her face with a knife.Meanwhile, Lt. Speier makes an arrangement with Rodney; if he assists in Scarlett and Tracy's apprehension, four of his criminal associates will be released from jail. At this point, Rodney sends a few of his henchmen to Sniffer's apartment.Scarlett then returns to Sniffer's apartment where she is confronted by an angry Tracy who has found a gun in the apartment. Scarlett falsely accuses Sniffer of cutting her face and steals Sniffer's drugs. Scarlett then urges Tracy to flee with her.At this point, Rodney's henchmen show up. They shoot into the door while Scarlett and Tracy flee with Sniffer, Rodney's henchmen, and the police on their trail.The two girls end up in a drug den, an abandoned warehouse, where Scarlett attempts to sell the drugs she stole from Sniffer. While Scarlett negotiates a drug deal, an exhausted Tracy lies down and attempts to sleep. Sniffer, who has trailed the girls to the drug den, comes upon Tracy and injects her with drugs. Outside, Rodney's henchman set fire to the drug den as they are unwilling to enter.Scarlett successfully negotiates the deal and encounters a gun-wielding Sniffer. The two fight as fire begins to burn. Sniffer eventually burns to death in the fire. Scarlett rescues a drug addled Tracy from the warehouse before it is consumed by the fire.The girls take refuge in a junk yard. Scarlett goes out to get food for the two of them while Tracy recovers from her high. Having stolen a newspaper, Scarlett has Tracy read the headline proclaiming their deaths to her.The girls rejoice in their new found freedom. Tracy then suggests that she and Scarlett run to the mountains, seek employment as waitresses and set up house together. Scarlett reluctantly refuses and the girls argue. The two part ways.At that moment, the police, who had the newspaper headline published as a ruse, and Tracy's father arrive on the scene. Scarlett is shot as she attempts to flee but is not seriously injured. The girls then pledge to stick together \"even if it kills us.\"","language":"English","Reception":"Richard Christiansen, Entertainment Editor of the Chicago Tribune, noted the similarity of the film's plot to The Defiant Ones and gave it only 1/2 star, calling it \"basically, fundamentally, absolutely garbage.\"[1]","cinematography":"Kees Van Oostrum","directed_by":"Stephen Gyllenhaal","release_dates":"March 1, 1985 (1985-03-01)|||||","produced_by":"Gilbert Adler","starring":"Tatum O'Neal Irene Cara","running_time":"87 minutes","music_by":"Russ Kunkel George Massenburg Bill Payne","External links":"","edited_by":"Todd C. Ramsay","written_by":"Michael Jacobs"}