{"country":"United Kingdom","distributed_by":"Hemdale Film Corporation","Plot":"Buster Edwards is a petty criminal from the East End of 1960s London. His long-suffering pregnant wife June (Julie Walters) thinks of him as a lovable rogue.The film opens with Buster (Phil Collins) walking through his local high street; he breaks into a shop to steal a suit which he then proceeds to change into, and wears to a funeral.Buster brings Harry (Michael Attwell), who has been used on other 'jobs' and has recently served 18 months in prison for his part in previous robberies, to discuss the next 'job' with the 'ring-leader' Bruce Reynolds (Larry Lamb). Harry wants 'in' and becomes part of the firm who are planning to rob a Royal Mail train allegedly carrying up to £1,000,000 in cash.After a complex and successful heist, the gang complete the robbery and return to their farmhouse hideout to lie 'low' and split the spoils, where they find they have stolen over £3,000,000 much more than they have anticipated or is reported by the media. Members of the gang are shown drinking from beer bottles and glasses without wearing their gloves, leaving their fingerprints which might be evidence of their involvement in the robbery.While 'lying-low' at the farmhouse they hear on the radio that the police are searching farmhouses and outhouses within a thirty (30)-mile radius of the train robbery. The gang become nervous and some members want to immediately return to London for fear of discovery, others think they should stay put keeping to the original plan.The gang decide to return to London and meet with a 'contact' who is a solicitor's clerk and (in the original plans) arranged for the farmhouse to be 'cleared and cleaned', thereby, destroying any physical evidence linking the gang to the robbery. The contact states he will bring the plans forward from a few weeks to the next 2–3 days.Bruce, Buster and Harry are not happy with any delay at all as they feared imminent discovery, so set off back to the farmhouse in their own car, to 'do the job' themselves. During the journey they hear on the car radio that the farmhouse hideout has been discovered, so they abandon the plans and return to London hoping they have time to make an escape with their families.Buster returns home. Buster is devastated to find that June has had a miscarriage while he was committing the robbery. She cannot believe it when she learns of his involvement in the Great Train Robbery.For several months after the robbery, Buster and June are in hiding with their young daughter Nicky (Ellie Beaven) until they are turned in to the police by a suspicious neighbour. Buster flees to Acapulco where he is met by fellow Great Train Robber Bruce Reynolds and his girlfriend Franny Reynolds (Stephanie Lawrence) who are also on the run and living it up in the sun with the profits of their crime.June and Nicky arrive despite the disapproval of her mother (Sheila Hancock) and although Nicky seems to love her new life in the sun, June is immediately not keen on their new way of life, resolving to return to England, despite knowing that if Buster is to return with them, then this will mean imprisonment for him.Buster remains in Acapulco for some time after June leaves, until realising (while celebrating England's 1966 World Cup triumph) that despite having money and the sun, it means nothing if he doesn't have his family, and he returns to England to accept his punishment.The film closes, twelve years after Buster's release from jail, seemingly content and running a flower stall near Waterloo Bridge on the Thames.","language":"English","Critical reception":"Reviews for the film tended to be mixed, with praise for the lead performances but criticism of the film's tone. Film critic Barry Norman, host of BBC Television's Film 88, praised the performances of Collins and Walters, but criticised the film's script for its tone of romanticising criminality, as well as the failure to address the brutal assault on the train driver, describing the film as \"amoral and even deplorable in its neglect of the act of violence\".[this quote needs a citation] Radio Times gives the film three stars out of five, stating: \"Too squeaky clean to be believable, this is an entertaining but fairy-tale view of law-breaking.\"[5] Halliwell's Film Guide also described the film as an \"uneasy combination of romantic comedy and chase thriller\".[6] Leonard Maltin gave the film two-and-a-half stars, writing: \"Singer Collins' starring film debut is a diverting (if forgettable) yarn, with Walters a good match as his loving, long-suffering spouse.\" Maltin also claimed the film had a \"great soundtrack\".[7]","box_office":"$540,000 (domestic)[1]","cinematography":"Tony Imi","production_company":"The Movie Group Vestron Pictures","directed_by":"David Green","Soundtrack":"Several Phil Collins singles were released from the soundtrack, including \"A Groovy Kind of Love\" and \"Two Hearts\", which reached #1 and #6 on the UK Singles Chart, respectively. Both songs were number one singles in the US.[2] Phil Collins also co-wrote \"Loco in Acapulco\", performed by The Four Tops for the soundtrack. \"Two Hearts\" received an Academy Award nomination for Best Original Song, a Grammy Award for Best Song Written Specifically for a Motion Picture or Television and a Golden Globe Award for Best Original Song, tying with \"Let the River Run\" from Working Girl by Carly Simon.","Filming locations":"The opening sequence was filmed in Broadway Market, Hackney. The robbery scenes were filmed on the Great Central Railway, using British Rail Class 40, D306, as a stand-in for D326 which was actually involved. Some scenes were filmed in Page Street, Westminster, London.[citation needed]","release_dates":"23 November 1988 (1988-11-23)|||||","produced_by":"Norma Heyman","starring":"Phil Collins|Julie Walters|Larry Lamb|Martin Jarvis|Sheila Hancock|Stephanie Lawrence|Michael Attwell|Ralph Brown|Anthony Quayle|","running_time":"102 minutes","Royal controversy":"Prince Charles and Princess Diana cancelled their attendance of the film's premiere on 15 September 1988, on the advice of Phil Collins, after the film was accused of glorifying crime. Collins said he wanted to avoid causing them \"embarrassment\".[3] One of the film's critics was Conservative MP Ivor Stanbrook, who said the royal couple should not be associated with a film that \"commemorates a particularly sordid and vicious crime.\"[4]","music_by":"Anne Dudley","edited_by":"Lesley Walker","Stage version":"A stage production of Buster was produced between 2000–2004 at various locations across the UK starring (amongst others) Ray Quinn in the main cast. The production was an adaptation by Kieran Woodbury of the original screenplay penned by Colin Shindler.","written_by":"Colin Shindler"}