{"country":"Spain","distributed_by":"Filmax International (Spain) Lions Gate Entertainment (U.S.)","Plot":"For the past 13 years, Dr. Herbert West (Jeffrey Combs) has been serving a prison sentence due to a murder at the hands of one of his zombies. With what scant supplies he has on hand in the prison medical center, Dr. West has been capable of performing only extremely basic experiments on rats. However, his lack of supplies does not prevent him from uncovering a key element in his re-animation process. Dr. West has discovered \"NPE\" (Nano-Plasmic Energy), an energy that can be extracted from the brain of a living organism through an electrocution-like process, to be stored in a capsule resembling a small light bulb. The capsule can then be connected to a corpse and used in conjunction with West's previously developed reagent to restore the former dead to a lifelike state. The NPE prevents the degeneration seen in previous instances, where the reanimated are nothing more than mindless zombies. Used together with the re-agent, reanimated corpses regain their skills, memories, and motor functions and nearly fully resemble normal humans.When a young doctor named Howard Phillips (Jason Barry) comes to work at the prison, West is assigned to assist the new doctor. Due to Phillips' interest with Dr. West's research, West is able to attain the supplies and tools needed to bring his experiments to the next level. It is revealed that Phillips is the younger brother of the teenage girl who was killed by West's zombie (he's shown watching West being taken away by the cops) and came to the prison for the explicit purpose of working with him. Despite his interest, Phillips still maintains an ethical reluctance to allow West's research to full completion. In the meantime, journalist Laura Olney (Elsa Pataky), covering a story for her newspaper at the prison, meets and begins an affair with Dr. Phillips, and they fall in love. This new romance only temporarily postpones West's experiment, however. After the warden of the prison, also infatuated with Laura, attempts to seduce Laura himself, she resists and he angrily kills her.Crushed by Laura's death, Dr. Phillips succumbs to Dr. West's wishes and his experiments are allowed to literally take on new life. West & Phillips revive Laura with the NPE, although it is quickly seen that the dangerous side effects of West's past work are still present with the NPE. Eventually the warden of the prison uncovers West's experiments and moves to put an end to them, but he is killed by West, and subsequently re-animated. West uses the NPE from a prisoner's pet rat, causing some unexpected side effects in the warden's behavior. It quickly manifests itself as the prison descends into utter chaos as a riot breaks out, with vials of the reagent circulating through the population. Soon, it is unclear who is dead, who is alive, and who has been exposed to the agent.When the chaos finally settles from the (very) bloody prison riot, West escapes captivity before the guards appear by stealing Phillips' I.D. (when he comes across Phillips weeping over Laura's decapitated body). As police and authorities take control of the prison, Herbert West is shown putting on his glasses outside the prison, and disappears into the night to continue his research.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that the film received mixed reviews from 45% of 11 surveyed critics; the average rating was 5.2/10.[2] Allmovie gave the film a mixed review, calling it \"almost a remake of the original\".[3] Jonathan Holland of Variety writes that the film is \"sometimes shocking but rarely scary\" and \"calculated to appeal only to hardcore gore hounds.\"[4] In a mixed review, Patrick Naugle of DVD Verdict called it \"somewhat of a letdown\" but \"worth at least one viewing\".[5] Writing for Bloody Disgusting, Brad Miska rates the film 2.5/5 stars and called it \"a fun movie, but nothing special\".[6]In their book Lurker in the Lobby: A Guide to the Cinema of H. P. Lovecraft, Andrew Migliore and John Strysik write: \"If your idea of Lovecraftian fun is Combs' acidic one-liners, and digitally enhanced gore effects that weren't available for the other two films, then by all means have a look. But if you're comparing this film to the still classic Re-Animator, well... This third try is only a shadow of the gonzo wit of the original and not nearly as entertaining.\"[7]Zombiemania: 80 Movies to Die For author Arnold T. Blumberg wrote that \"Beyond Re-Animator is better than its immediate predecessor\" and that \"Combs slips back into the white shirt and black tie, wielding the hypo of green goo like he never put it down, but his performance is nicely tempered by the passage of time, giving us a West that lacks some of his youthful confidence but none of his single-minded desire to pursue 'The Work.'\"[8]","cinematography":"Andreu Rebés","production_company":"Castelao Producciones Fantastic Factory","directed_by":"Brian Yuzna","release_dates":"April 4, 2003 (2003-04-04)|||||","produced_by":"Brian Yuzna Julio Fernández Carlos Fernández","starring":"Jeffrey Combs Tommy Dean Musset Jason Barry Bárbara Elorrieta Elsa Pataky Santiago Segura Simón Andreu","running_time":"95 min.","beyond_re-animator":"Theatrical poster","music_by":"Xavier Capellas","edited_by":"Bernat Vilaplana","Release":"In 2011 Arrow Video released a new Special Edition DVD, with the following Special Features:","written_by":"Characters: H. P. Lovecraft Story: Miguel Tejada-Flores Screenplay: José Manuel Gómez Brian Yuzna (uncredited)","budget":"$3,000,000 (Estimated)"}