{"distributed_by":"Rank Organisation","Plot":"Violette Bushell is a young woman whose father is English and mother is French, living in London during the Second World War. She meets French Army officer Etienne Szabo, stationed in the city, and within three days they become engaged to be married. They have a daughter, Tania, but Etienne never sees the child as he is killed fighting in North Africa; Violette Szabo and her daughter move into her parents' home.Because of her linguistic skills, the widowed Szabo is recruited as a spy by the British government. On her first mission, she is teamed with Captain Tony Fraser (Paul Scofield), a man she had met earlier socially and liked. She parachutes into France, and shares a train compartment to Rouen with curious Nazi soldiers. The French Resistance group Fraser had set up in Rouen has been betrayed. The job of the new arrivals is to contact any survivors and to blow up a major railway viaduct. One Resistance member who Szabo contacts tells her that another survivor, a garage mechanic (André Maranne), is suspect, but Szabo takes the risk of meeting him anyway. He informs her that only three of 98 group members remain. Nonetheless, she persuades him to try to blow up the viaduct. Szabo is picked up and questioned by the Gestapo. She is released (in the hope that she will lead the Germans to her comrades). She, however, manages to elude them and rendezvous in Paris with Fraser, who congratulates her: the viaduct was destroyed.After their return to Britain, Fraser assures Szabo that she will not have to go behind enemy lines again, but due to the shortage of experienced agents, she is asked to do just that. She agrees, parachuting into France. Once again, she is under Fraser's command, this time in the Limoges region. She sets out with a guide to contact the various Resistance units to coordinate their actions. However, as they drive through a village, they see another Frenchman shooting two German soldiers passing by on motorcycles, and she and her guide become engaged in a running firefight with a German patrol. When she twists her ankle while fleeing, she remains behind to cover the guide's escape as he swims a river. She runs out of ammunition and is captured.Though tortured, she defiantly refuses to provide any information. Eventually she is reunited with two fellow women agents she had befriended during their initial training, Lilian Rolfe and Denise Bloch, in a Nazi Paris prison. As Allied forces advance on Paris, the women are placed on a train for Germany. When the train is bombed by Allied aircraft, the women have a chance to attempt to escape, but Szabo instead fetches water for male prisoners. One of them is Fraser. (An uncredited Michael Caine plays the prisoner who leans forward and calls to Szabo for water; in real life, that was the war hero F. F. E. Yeo-Thomas, as recorded by Leo Marks in Chapter 76 of his book Between Silk and Cyanide). That night, Szabo and Fraser acknowledge their love for each other.The men and women are separated. The three women are taken to a concentration camp, where, one day, they are executed.After the war, Tania and her grandparents go to Buckingham Palace, where the King gives the child her mother's posthumous George Cross. Afterwards, they meet Fraser.","language":"English French German","cinematography":"John Wilcox","directed_by":"Lewis Gilbert","'The Life That I Have'":"The poem, 'The Life That I Have', also known as 'Yours', recited to Violette by her husband Etienne, was once believed to have been written especially for the film, but was in fact the actual code poem given to her in March 1944 by the SOE cryptographer Leo Marks, and written by him on Christmas Eve 1943 in memory of his girlfriend, Ruth, who had recently died in a plane crash. Marks, who became a scriptwriter after the war, would only let the poem be used on condition that his authorship was not revealed.[6]","release_dates":"18 February 1958","produced_by":"Daniel M. Angel","starring":"Virginia McKenna Paul Scofield","running_time":"119 min.","The real Violette Szabo":"Virginia McKenna was a popular star of postwar British cinema, and she gives a stirring performance as one of the most noted heroines of the Second World War, but physically she bore little resemblance to her subject. Rather than the blonde McKenna, the real Violette Szabo was a brunette with dark eyes who stood less than 5 ft 5in tall.[2] McKenna gives Szabo a marked south London accent in the English scenes (and a Received Pronunciation accent when 'speaking French'), and her performance is in the tradition of the 'stiff upper lipped' heroine expected by audiences in the 1950s.[3] The film itself, released in 1958, does not show the full horror of Szabo's treatment in captivity, especially in Ravensbrück concentration camp, or the true manner of her execution, but it gives a broad impression of her bravery and fortitude.[4]The film and McKenna's distinguished performance provide an apt tribute to Violette Szabo, described in the citation to her posthumous George Cross as having shown a 'magnificent example of courage and steadfastness', by her daughter, Tania, in the title of her 2007 book about her mother's missions, as 'young, brave and beautiful', and by fellow SOE agent, Odette Sansom, GC, who survived Ravensbrück, as 'the bravest of us all'.Denise Bloch and Lilian Rolfe were fellow SOE agents, and were executed with Violette Szabo on 5 February 1945 in Ravensbrück. Colonel Maurice Buckmaster was head of SOE F Section and Vera Atkins was his assistant and the section's intelligence officer, with special responsibility for female agents.Vera Atkins, Odette Sansom and Leslie Fernandez, one of Szabo's SOE instructors and a field agent himself, were advisors on the film.The character 'Tony Fraser' was created for dramatic purposes, but is based upon Szabo's actual male colleague on her missions to France, and organiser of the Salesman circuit, Philippe Liewer ('Major Charles Staunton').[5]","music_by":"William Alwyn","carve_her_name_with_pride":"Original film poster","edited_by":"John Shirley","written_by":"R.J. Minney (book) Vernon Harris Lewis Gilbert"}