{"country":"United States|Mexico|France|","distributed_by":"Paramount Vantage (US)|Mars Distribution (France)||","Plot":"Babel focuses on four interrelated sets of situations and characters, and many events are revealed out of sequence. The following plot summary has been simplified and thus does not reflect the exact sequence of the events on screen.In a desert in Morocco, Abdullah, a goatherder, buys a .270 Winchester M70 rifle and a box of ammunition from his neighbor Hassan Ibrahim to shoot the jackals that have been preying on his goats. Abdullah gives the rifle to his two young sons, Yussef and Ahmed, and sends them out to tend the herd. Ahmed, the older of the two, criticises Yussef for spying on his sister while she changes her clothes. Doubtful of the rifle's purported three-kilometer range, they decide to test it out, aiming first at rocks, a moving car on a highway below, and then at a bus carrying Western tourists. Yussef's bullet hits the bus, critically wounding Susan Jones (Cate Blanchett), an American woman from San Diego who is traveling with her husband Richard (Brad Pitt) on vacation.[3] The two boys realize what has happened and flee the scene, hiding the rifle in the hills.Glimpses of television news programs reveal that the US government considers the shooting a terrorist act and is pressuring the Moroccan government to apprehend the culprits. Having traced the rifle back to Hassan, the Moroccan police descend on his house and roughly question him and his wife until they reveal that the rifle was given to him by a Japanese man, and then sold to Abdullah. The two boys see the police on the road and confess to their father what they have done, believing at the time that the American woman has died of her wounds. The three flee from their house, retrieving the rifle as they go. The police corner them on the rocky slope of a hill and open fire. After Ahmed is hit in the leg, Yussef returns fire, striking one police officer in the shoulder. The police continue shooting, hitting Ahmed in the back, possibly fatally injuring him. As his father rages with grief, Yussef surrenders and confesses to the crimes, begging clemency for his family and medical assistance for his brother. The police take him into custody.This first plotline is interspersed with scenes of Richard and Susan, who came on vacation to Morocco to get away from and mend their own woes. The death of their infant third child, to SIDS, has strained their marriage significantly and they struggle to communicate their frustration, guilt, and blame. When Susan is shot on the tour bus, Richard orders the bus driver to the nearest village, Tazarine. There, a local veterinarian sews up Susan's wound to stem the loss of blood. Richard contacts the US embassy to request an ambulance. The other tourists wait for some time, but they eventually demand to leave, fearing the heat and that they may be the target of further attacks. Richard tells the tour group to wait for the ambulance, which never arrives, and eventually the bus leaves without them. The couple stays behind with the bus's tour guide, Anwar, still waiting for transport to a hospital. Political issues between the US and Morocco prevent quick help, but eventually a helicopter arrives and carries Richard and Susan to a hospital in Casablanca, where she is expected to recover. Richard calls his children's nanny, Amelia, from the hospital, and they agree not to tell the children that Susan has been shot yet. Richard cries as his son tells him about his day at school.Chieko Wataya (綿谷 千恵子 Wataya Chieko, Rinko Kikuchi) is a rebellious, deaf Japanese teenage girl, traumatized by the recent suicide of her mother. She is bitter towards her father, Yasujiro Wataya (綿谷 安二郎 Wataya Yasujirō, Kōji Yakusho) and boys her age, and is sexually frustrated. She starts exhibiting sexually provocative behavior, partly in response to dismissive comments from a member of her volleyball team. While out with friends, Chieko finds a teenage boy attractive, and following an unsuccessful attempt at socialising, exposes herself to him under a table. Chieko encounters two police detectives who question her about her father. She and her friends take ecstacy pills in public and attend a rave. Chieko sees one of her friends kissing another boy she finds attractive and leaves the party alone.She invites one of the detectives, Kenji Mamiya (真宮 賢治 Mamiya Kenji, Satoshi Nikaido), back to the high-rise apartment she shares with her father. Wrongly supposing that the detectives are investigating her father's involvement in her mother's suicide, she explains to Mamiya that her father was asleep when her mother jumped off the balcony and that she witnessed this herself. It turns out the detectives are investigating a hunting trip Yasujiro took in Morocco. Soon after learning this, Chieko approaches Mamiya nude and attempts to seduce him. He resists her approaches but comforts her as she bursts into tears. Before he leaves, Chieko writes him a note, indicating that she does not want him to read it until he is gone.Leaving the apartment, Mamiya crosses paths with Yasujiro and questions him about the rifle. Yasujiro explains that there was no black market involvement; he gave his rifle as a gift to Hassan Ibrahim, his hunting guide on a trip in Morocco. About to depart, Mamiya offers condolences for the wife's suicide. Yasujiro, however, is confused by the mention of a balcony and angrily replies: \"My wife shot herself in the head. Chieko was the first to find the body. I've explained this to the police many times.\" After leaving, Mamiya stops at a bar to read Chieko's note. The note's contents are not revealed. Chieko is leaning on the balcony when her father enters the apartment, and the two embrace as she breaks down in tears.Richard and Susan's Mexican nanny, Amelia (Adriana Barraza), tends to their children, Debbie (Elle Fanning) and Mike (Nathan Gamble), in their San Diego, California home while they are in Morocco. When Amelia learns of Susan's injury, she is forced to take care of the children longer than planned and becomes worried that she will miss her son's wedding. Unable to secure any other help to care for them, she calls Richard for advice, who tells her that she has to stay with the children. Without his permission, Amelia decides to take the children with her to the wedding in a rural community near Tijuana, Mexico. Her nephew Santiago (Gael García Bernal) offers to take her and the kids to the wedding. They cross the border uneventfully and the children are soon confronted by the Mexican culture and street scene. The revelry of the wedding extends well into the evening, and the kids enjoy themselves in the festivities. Rather than staying the night in Mexico with the children, Amelia decides to drive back to the States with Santiago. He has been drinking heavily and the border guards become suspicious of him and the American children in the car. Amelia has passports for all four travelers, but no letter of consent from the children's parents allowing her to take them out of the United States. Intoxicated and worried, Santiago trespasses the border. He soon abandons Amelia and the children in the desert, attempting to lead off the police.Stranded without food and water, Amelia and the children are forced to spend the night in the desert. Realizing that they will all die if she cannot get help, Amelia leaves the children behind to find someone, ordering them not to move. She eventually finds a U.S. Border Patrol officer. After he places Amelia under arrest, she and the officer travel back to where she had left the children, but they are not there. Amelia is taken back to a Border Patrol station, where she is eventually informed that the children have been found and that Richard, while outraged, has agreed not to press charges. However, she is told she will be deported from the US where she has been working illegally. Her plea that she has been in the US for 16 years and has looked after the children (whom she considers \"her children\") for their entire lives does not secure lenient treatment. Amelia meets her son on the Mexican side of the Tijuana crossing, still in the red dress she wore for the wedding, now torn and dirty from her time in the desert.","language":"English|Spanish|Arabic|Japanese|Japanese Sign Language|Berber|","box_office":"$135.3 million[1]","cinematography":"Rodrigo Prieto","directed_by":"Alejandro González Iñárritu","Home media":"On 20 February and 21 May 2007, Babel was released on DVD by Paramount Home Entertainment in the United States and the United Kingdom respectively.[17][18] On September 25, 2007, Paramount re-released the film as a two-disc special edition DVD. The second disc contains a 90-minute 'making of' documentary titled Common Ground: Under Construction Notes.[19] Babel has also been released on the high-definition formats, HD DVD, and Blu-ray Disc.[20][21]On its first week of release on DVD in North America (19–25 February 2007), Babel debuted #1 in DVD/Home Video Rentals.[22] Total gross rentals for the week, were estimated at $8.73 million.[23] In the first week of DVD sales, Babel sold 721,000 units, gathering revenue of $12.3 million. By April 2007, 1,650,000 units had been sold, translating to $28.6 million in revenue.[24] In July 2008, its US DVD sales had totaled $31.4 million.[25]","production_companies":"Anonymous Content Zeta Film Central Films Media Rights Capital","Music":"The film's original score and songs were composed and produced by Gustavo Santaolalla. The closing scene of the film features \"Bibo no Aozora\" by award-winning composer Ryuichi Sakamoto.[8] The musical score won the Academy Award for Best Original Score and the BAFTA Award for Best Film Music. It was also nominated for the Golden Globe Award for Best Original Score.[9]","release_dates":"23 May 2006 (2006-05-23) (Cannes)|27 October 2006 (2006-10-27) (United States & Mexico)||||","Production":"Babel's $25 million budget came from an array of different sources and investors anchored with Paramount Vantage.[4]Actress Adriana Barraza, who plays the role of Amelia, is a two-time survivor of minor heart attacks. She nonetheless carried actress Elle Fanning around in the hot desert of Southern California during the summer for five days during filming of those particular desert scenes.[5]Filming locations included Ibaraki, Japan, Tokyo, Mexico (El Carrizo,[6] Sonora, and Tijuana), Morocco (Ouarzazate and Taguenzalt – a Berber village in the foothills of the Atlas Mountains, built into the rocky gorges of the Draa Valley[6]), California, USA (San Diego and San Ysidro), and Drumheller, Alberta, Canada.[citation needed]Following completion of principal photography on Babel, director Alejandro González Iñárritu and screenwriter Guillermo Arriaga had a falling out. The dispute centered on the authorship of their previous film, 21 Grams. Arriaga argued that cinema is a collaborative medium, and that both he and González Iñárritu are thus the authors of the films they have worked on together. González Iñárritu claimed sole credit as the auteur of those same films, minimizing Arriaga's contribution to the pictures. Following this dispute, González Iñárritu banned Arriaga from attending the 2006 Cannes Film Festival screening of Babel, an act for which the director was criticized.[7]","babel":"Theatrical release poster","produced_by":"Alejandro González Iñárritu|Jon Kilik|Steve Golin|","starring":"Brad Pitt|Cate Blanchett|Gael García Bernal|Kōji Yakusho|Adriana Barraza|Rinko Kikuchi|","running_time":"143 minutes","music_by":"Gustavo Santaolalla","edited_by":"Stephen Mirrione|Douglas Crise|","Release":"Babel was selected to compete for the Palme d'Or at the 2006 Cannes Film Festival.[10] It was later screened at the Toronto International Film Festival.[11] It opened in selected cities in the United States on 27 October 2006, and went into wide release on 10 November 2006.[1]Released in seven theaters on 27 October 2006, and then released nationwide in 1,251 theaters on 10 November 2006, Babel grossed $34.3 million in North America, and $101 million in the rest of the world, for a worldwide box office total of $135.3 million, against a budget of $25 million.[1][4] Babel is the highest grossing film of González Iñárritu's Death Trilogy (including Amores Perros and 21 Grams[5]), both in North America and worldwide.[12][13]Babel received generally positive reviews. Review aggregation website Rotten Tomatoes gives the film an approval rating of 69% based on 195 reviews, with an average rating of 6.7/10, making the film a \"Fresh\" on the website's rating system. The critical consensus states that \"In Babel, there are no villains, only victims of fate and circumstance. Director Alejandro González Iñarritu weaves four of their woeful stories into this mature and multidimensional film.\"[14] At Metacritic, the film received an weighted average score of 69/100, based on 38 reviews, which indicates \"Generally favorable reviews\".[15]Film critic Roger Ebert included Babel in his The Great Movies list, stating that the film \"finds Inarritu in full command of his technique: The writing and editing moves between the stories with full logical and emotional clarity, and the film builds to a stunning impact because it does not hammer us with heroes and villains but asks us to empathize with all of its characters.\"[16]","written_by":"Guillermo Arriaga","budget":"$25 million"}