{"based_on":"Characters from DC Comics","Cast":"Actors Jeffrey Dean Morgan and Lauren Cohan portray Thomas and Martha Wayne, Bruce Wayne's deceased parents,[27][28] Robin Atkin Downes portrays Doomsday, the creature created by Lex with the help of Kryptonian technology, through motion-capture technology.[12] Patrick Wilson portrays the President of the United States in a voice role, and Michael Cassidy portrays Jimmy Olsen, a CIA agent.[29] Reprising their roles from Man of Steel are Harry Lennix as Secretary Calvin Swanwick,[30] Christina Wren as Major Carrie Farris,[31] Kevin Costner as the now-deceased Jonathan Kent,[32] Rebecca Buller as Jenny Jurwich and Carla Gugino returns as the Kryptonian A.I. Kelor.[33] The corpse of the now-deceased General Zod also appears in the film in a crucial role, however, Michael Shannon did not film any scenes for the film and the corpse was created using the physique of fitness model Greg Plitt and a head-shot of Shannon.[34]Ray Fisher, Jason Momoa and Ezra Miller appear as Victor Stone / Cyborg, Arthur Curry / Aquaman and Barry Allen / The Flash respectively in brief appearances, which will lead to their inclusion in the Justice League film.[35][36][37][38][39][40][41][42] Joe Morton appears as a role as Silas Stone, Victor's father.[43] U.S. Senator Patrick Leahy makes a cameo appearance as Senator Purrington, whilst U.S. Senator Debbie Stabenow also makes a cameo.[44][45] Neil deGrasse Tyson, Soledad O'Brien, Anderson Cooper, Nancy Grace and Charlie Rose appear as themselves. Jena Malone was cast as Jenet Klyburn, but her scenes were cut from the theatrical release and appears in the Ultimate Cut Edition home media release, along with Coburn Goss reprising his role as Father Leone from Man of Steel in the extended cut as well.[46] To further establish the interconnection between the films of the shared universe, Chris Pine appears on Diana Prince's photo as Steve Trevor, as well as Saïd Taghmaoui and Ewen Bremner in undisclosed roles, which they will reprise in the upcoming Wonder Woman.[47][48][49]","country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"Eighteen months after Superman's destructive battle with General Zod in Metropolis, Superman has become a controversial figure. Daily Planet journalist Clark Kent, Superman's alter ego, has moved in with Lois Lane. Bruce Wayne, who has operated in Gotham City as the vigilante \"Batman\" for nearly two decades, sees Superman as a potential threat to humanity. After learning of Batman's activities, Clark views Batman as a threat, and seeks to stop him via Daily Planet articles. Wayne learns that Russian weapon-trafficker Anatoli Knyazev has been contacting LexCorp's mogul Lex Luthor. Meanwhile, Luthor tries to persuade Senator June Finch to allow him to import kryptonite retrieved from the Indian Ocean following the results of Zod's terraforming attempt, claiming to use it as a \"deterrent\" against Kryptonians, but she denies the request. He also makes side dealings with Finch's subordinate and demands access to Zod's body and the Kryptonian scout ship.Wayne attends Luthor's party at LexCorp, where he meets a mysterious antiques dealer named Diana Prince, and retrieves encrypted data from the company's mainframe. While decrypting the drive at the Batcave, Wayne has a dream of a post-apocalyptic world, where he leads a group of rebels against Superman. He is snapped out of the dream by an unidentified time traveler, who warns him of Lane's crucial role in the distant future, and urges him to find \"the others\". Wayne later discovers that Luthor is not only experimenting with kryptonite, but also investigating metahumans. One of them is Prince herself, who is an immortal warrior. Wayne admits to Alfred Pennyworth that he plans to steal the kryptonite to weaponize it, should it become necessary to fight Superman.Luthor orchestrates a bombing at a congressional hearing where Finch is questioning Superman on the validity of his actions, killing everyone present besides Superman. Believing that he should have detected the bomb and frustrated by his failure to save the people, Superman goes into self-imposed exile. Batman breaks into LexCorp and steals the kryptonite, planning to use it to battle Superman by building a powered exoskeleton, and creating a kryptonite grenade launcher and a kryptonite-tipped spear. Meanwhile, Luthor enters the Kryptonian ship and learns of its functions, as well as recorded alien worlds.Luthor kidnaps Martha Kent, Clark's adoptive mother. He reveals that he has manipulated Superman and Batman by fueling their animosity for each other. Luthor demands Superman fight and kill Batman in exchange for Martha's life. Superman tries to reason with Batman, but Batman instigates a brutal fight and ultimately wins. Before Batman can kill Superman with the spear, Superman urges Batman to \"save Martha\", whose name is also shared with Wayne's late mother. Lane arrives and explains the situation, convincing Batman that Superman is not a threat. Unwilling to let someone else's mother die, Batman leaves to rescue Martha upon learning of Luthor's plan, while Superman confronts Luthor on the scout ship.Luthor executes his backup plan, unleashing a genetically-engineered monster with DNA from both Zod's body and his own.[N 1] However, Diana Prince arrives unexpectedly. Revealing her metahuman nature, she joins forces with Batman and Superman to fight the creature. They are soon outmatched by its power, as it can absorb and redirect energy. Realizing that it is also vulnerable to kryptonite, Superman retrieves the kryptonite spear. With Batman and Prince's help distracting it, Superman impales the monster. As it dies, the creature stabs and kills a weakened Superman with one of its bone protrusions.Luthor is arrested, and Batman confronts him in prison, warning Luthor that he will always be watching him. Luthor gloats that Superman's death has made the world vulnerable to powerful alien threats, and that something bigger is coming to Earth. A memorial is held for Superman in Metropolis. Clark is also declared dead and Wayne, Lane, Martha, and Prince attend a private funeral for him in Smallville. Martha gives an envelope to Lane which contains an engagement ring from Clark. After the funeral, Wayne reveals to Prince that he plans to form a team of metahumans, starting with the ones from Luthor's files, to help protect the world in Superman's absence. After they leave, a faint heartbeat echoes from Clark's coffin and the dirt around it begins to levitate.","language":"English","Reception":"Batman v Superman: Dawn of Justice grossed $330.4 million in North America and $542.3 million in other territories for a worldwide total of $872.7 million, making it the fourth highest-grossing film of 2016 behind Captain America: Civil War, Zootopia and The Jungle Book.[4]The film grossed $166 million in North America in its opening weekend,[154][155] the eighth biggest opening of all-time, ahead of The Dark Knight Rises' $160.9 million.[154] The film had a worldwide opening of $422.5 million, which stands as the second biggest for Warner Bros. and the fourth biggest of all-time.[156] It became the fourth film to have a global opening above $400 million.[157] It also had an IMAX worldwide opening weekend total of $36 million from 945 IMAX screens, the third biggest ever, behind Star Wars: The Force Awakens ($48 million) and Jurassic World ($44 million).[157] However, both inside and outside of the United States, Batman v Superman: Dawn of Justice experienced a notable poor Friday-to-Sunday hold and set a new record for the worst Friday-to-Sunday drop for a superhero movie release in modern box office history with a 58% decline, which was previously held by Fantastic Four.[158]In its second weekend, Batman v Superman: Dawn of Justice experienced a \"historic\" box-office drop,[5][159] with a 81.2% decline on Friday that was \"one of the biggest Friday-to-Friday drops any blockbuster has ever seen\", and an overall \"68.4%\" drop for the weekend despite not \"facing any big competition at the box office\",[160][161][161][162] making it the second largest decline for a marquee superhero title, behind only 2003's Hulk.[5] Brad Brevet, writing for Box Office Mojo, reported, \"it appeared Batman v Superman was looking at a drop anywhere from 58–68% and it ended up settling in on the wrong side of those expectations.\"[162] Scott Mendelson, writing for Forbes, said of the film's box office decline, \"Whether or not the movie is any good, and whether or not audiences respond to the picture, is best measured by the second and third weekends...Yes, we’re still talking about a $15.35 million second Friday and a $50m+ second weekend, but in terms of legs, this film sadly doesn’t seem to have any.\"[163] Continuing this trend, in its third weekend the film dropped by 54.3% in which Brad Brevet, in a follow-up for Box Office Mojo, concluded that \"the legs on this one are proving quite short.\"[164]In the weeks leading up to the film's release, advance ticket sales outpaced The Dark Knight Rises, The Avengers and Furious 7.[165] Worldwide, it was estimated to gross between $300–340 million in over 35,000 screens in its opening weekend.[151][166] It passed the $50 million mark in IMAX ticket sales on its second weekend, grossing a total of $53.4 million from 571 IMAX screens.[167][168] Warner Bros. domestic distribution chief Jeff Goldstein described the film's box office performance as a \"fantastic result, by any measure.\"[169] Box office analyst Jeff Bock said,\"Still, outside of Christopher Nolan's two Dark Knight movies, and Tim Burton's Batman films when you adjust for inflation, this is the highest-grossing property in DC's bullpen thus far. It tops Man of Steel by more than $200 million,\" and that overall, \"BvS successfully relaunched DC's cinematic universe, but they are nowhere near Disney/Marvel in terms of critical reception and box office prowess. One can only hope that bigger and better is still on the way.\"[169] The film needed to reach $800 million in revenue at the box office to \"recoup its investment\" according to financial analysts.[7][9][111] Despite surpassing this amount, it was considered \"a disappointment\" for failing to reach $1 billion,[7][8][170] the fallout of which resulted in a change at Warner Bros. regarding \"the way it handles its DC Entertainment-centered films.\"[171]Following reports of pre-tickets sales in both the United States and Canada on February 29, many insiders and analysts predicted an opening weekend haul between $120–140 million for Batman v Superman: Dawn of Justice, with some projecting as high as $185 million.[151][153][166][172][173][174] However, Warner Bros. insiders were more conservative in their estimates projecting in the lower range of $110 million.[2] According to Deadline.com, an undisclosed rival studio box office analyst indicated that if the film is truly pacing in tandem with The Dark Knight Rises, then Dawn of Justice could possibly be looking at a $180 million+ debut.[166] The film also became Fandango's top pre-selling superhero film ever, beating The Dark Knight Rises and Avengers: Age of Ultron, representing 90% of the site's weekend's ticket sales. A survey carried out showed that the introduction of Wonder Woman is a primary draw for moviegoers.[173][175] It pre-sold around $20–25 million worth of advance tickets.[173] Dawn of Justice made $27.7 million in Thursday previews from around 3,800 theaters which is the biggest of 2016, the biggest Easter weekend preview, the second-biggest for a superhero film (behind The Dark Knight Rises), and the seventh-biggest of all time of which $3.6 million came from IMAX showings, also a new record for Easter weekend.[176][177]On its opening day, it earned $81.59 million from 4,242 theaters, including previews, marking the biggest pre-summer opening day of all time, the second-biggest superhero Friday opening and the fourth-biggest opening day and fourth-biggest single-day gross, with $9 million coming from IMAX showings.[178] Excluding the Thursday previews, it earned $53.89 million on Friday which is the fifth-biggest ever.[178] It fell 37.8% on Saturday, which is the second worst superhero opening Friday-to-Saturday drop, only behind the 40% drop of The Dark Knight Rises.[158][158] In total, it earned $166 million for its debut weekend, setting records for the biggest March and pre-summer opening,[179] the biggest Easter opening,[180] the second biggest opening for Warner Bros.,[181] the biggest for a DC Comics property,[182] and the eighth-biggest opening of all time.[155][183][184] Conversely, the film holds the record for the worst superhero Friday-to-Sunday drop with a 58% decline, eclipsing the previous 48% decline record held by Fantastic Four in 2015.[158] IMAX comprised 11% or $18 million of the weekend's gross from 388 theaters which is the fifth biggest of all time (a record it shares with Age of Ultron) and 3D represented 40% ($68 million) of the total ticket sales.[185] RealD 3D comprised $47 million of the opening gross.[183] Premium large formats generated $17.6 million (10%), with $3.6 million of that coming from Cinemark XD auditoriums from 475 theaters.[183]Following its record breaking opening weekend, it posted the biggest March Monday with $15.05 million, a drop of 55% from its Sunday gross. This broke The Hunger Games' previous record of $10.8 million,[186][187] and also the biggest March Tuesday with $12.2 million.[188] It made $209 million in its first week full which stands at the eleventh biggest opening week of all time[189] and surpassed the lifetime total Batman Begins.[190] Despite earning $15.35 million in its second Friday, the film dropped 81.2% and broke the record for the biggest Friday-to-Friday drop for a comic book adaptation film, not including $27.7 million worth of previews which represented an even larger decline.[191] It fell precipitously by 69.1% in its second weekend, grossing $51.3 million from 4,256 theaters (an addition of 14 cinemas) due to poor reviews and mixed word of mouth, establishing itself an infamous record for the seventh steepest drop for a superhero/comic book adapted film and the steepest decline since the -69% posted by X-Men Origins: Wolverine in 2009, despite facing little to no competition or new wide-releases and having the added benefit of 30% K–12 schools off, and 9% of colleges on break, per ComScore.[192][193] The steep drop also marks the fourth-biggest for a film that opened above $100 million (tied with The Twilight Saga: Breaking Dawn – Part 2).[168] In its third weekend it was overtaken by the comedy The Boss after falling 54% with $23.3 million.[194][195]Internationally, it was projected to open between $180–200 million; however, Deadline.com pointed out that these figures were only early predictions pegged to the performance of similar films in their respective territories.[166] It opened in ten countries on Wednesday, March 23, 2016, earning $7 million and debuting at No. 1 in all markets on approximately 5,900 screens.[196][197] The following day, the film was released in 38 additional countries, earning $33.1 million on 19,700 screens for a two-day total of $44 million.[196] On March 25, it opened in the remaining 17 countries delivering $67.2 million in revenue, for a three-day total of $115.3 million in 62 countries on more than 30,000 screens.[196] Through Sunday, March 27, it earned an opening-weekend total of $256.5 million from 66 countries on over 40,000 screens, making it the biggest superhero opening weekend of all time, the biggest overall March opening, the second-biggest opening ever for Warner Bros., and the fifth-biggest international opening on record.[157][198] The film's accomplishements also included the second-biggest IMAX opening record of $18 million, behind only Jurassic World which tallied $23.5 million.[157] 3D accounted 59% or $149.86 million of the weekend gross led by China (98%), Germany (88%), Brazil (81%), Russia (55%), and France (51%).[157] As with North America, the film witnessed a steep decline in its second Friday internationally, falling 72% to $19.2 million, with the biggest decline in the U.K. (77%) and China (87%).[199][200] Its second weekend earnings fell 66% overall to $85.25 million.[167] Despite the decline, the film topped the box office for three consecutive weekends.[201]In Mexico, it had the biggest opening day for Warner Bros. and the second biggest of all time with $5.8 million, including record-breaking midnight showings.[196] It also scored the biggest opening day of all time in Brazil ($3.5 million) and the biggest opening day for a superhero film in Germany ($2.8 million).[202] Elsewhere, it opened in the United Kingdom and Ireland ($9 million), Australia ($2.5 million), India ($2.54 million), Russia ($1.9 million), South Korea ($1.7 million), Japan ($1.2 million), the United Arab Emirates and Hong Kong ($1.1 million respectively).[196][202] In China, it earned $21.22 million on its opening day, including around $1.34 million worth of previews, which is the biggest for Warner Bros. and the sixth biggest Hollywood opening day of all time.[196][203] However, other Chinese sources have the film open to around $20 million.[204][205] In terms of opening weekends, the biggest openings were recorded in China ($57.2 million), the United Kingdom and Ireland ($20.7 million), Mexico ($18.2 million), Brazil ($12 million), South Korea ($10.2 million), Australia ($9.9 million), France ($8.6 million), Germany ($8.1 million), Russia ($7.7 million), India ($6.6 million), Spain ($6.1 million) and Japan ($4.5 million).[157][206] It broke all-time opening record in Brazil and Warner Bros. opening records in Mexico, Hong Kong, India, Malaysia, Singapore, Vietnam, Argentina, Bolivia, Chile, Colombia, Peru, Puerto Rico and Venezuela.[157] In the United Kingdom and Ireland, it benefited from the long Easter weekend holiday and despite a distinctly mixed bag of reviews in the U.K. press, it posted an opening £14.62 million or $20.7 million from 612 theaters, a record for 2016 so far and for a superhero title on straight Friday to Sunday, but fell short of The Avengers and Avengers: Age of Ultron, when accounting for previews.[207][208] In Japan, it opened in third place, behind two local films, Assassination Classroom: Graduation and Doraemon: Nobita and the Birth of Japan 2016.[209] In South Korea, it scored the biggest March opening after opening on a Tuesday and dominating 68.3% of the market share with $10.2 million.[210] In China, after scoring the biggest Hollywood opening Friday (behind Transformers: Age of Extinction),[211] it earned an estimated $57.2 million from approximately 16,000 screens in its opening weekend, besting all other DC Comics adaption film just by its weekend haul except for Man of Steel and gave Warner Bros. its biggest three day opening there with $7 million coming from 557 IMAX screens.[157][212] However, the opening figure fell below analysts projections of $70–80 million.[213] It held the top spot for its first seven days only, after which it faced stiff competitions from local productions,[200] and fell dramatically from then onwards in accruing revenue.[214] As a result, it fell to third place in its second weekend after falling enormously by 78% to $12.7 million, a record for a superhero film.[167][215]It became the Warner Bros.' highest-grossing film of all time in India, Indonesia, Malaysia, the Philippines and Vietnam.[216] It also crossed $100 million Latin American markets, making it Warner Bros.' second highest-grossing film there.[216] In total earnings, its biggest markets outside of North America are China ($95 million), which analysts believe it will not cross $100 million there, followed by the UK ($52.1 million), Mexico ($36 million) and Brazil ($35.5 million).[217]Batman v Superman: Dawn of Justice received generally negative reviews.[10][218][219][220] Review aggregator website Rotten Tomatoes reported a 27% approval rating based on 338 reviews, with a rating average of 4.9/10. The site's critical consensus reads, \"Batman v Superman: Dawn of Justice smothers a potentially powerful story – and some of America's most iconic superheroes – in a grim whirlwind of effects-driven action.\"[221] Metacritic, which assigns a weighted average to critic reviews, gave the film an average score of 44 out of 100, based on 51 critics.[222] Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.[223] It earned \"B–\" from men, \"B\" from women, a \"B\" from those under 25 and a \"B–\" from those over 25.[185]BBC News reported that, \"the film had been widely praised by fans after its first screening in New York last week. But critics have not been so positive about the long-awaited movie.\"[224] Lindy West in The Guardian described it as \"153 minutes of a grown man whacking two dolls together\", asking \"(h)as the definition of 'movie' changed from 'motion picture story that a human wrote on purpose' to '700 only tangentially related 12-second grey and red vignettes'?\"[225] A. O. Scott of The New York Times wrote: \"The point of Batman v Superman isn't fun, and it isn't thinking, either. It's obedience. The theology is invoked ... to buttress a spectacle of power. And in that way the film serves as a metaphor for its own aspirations. The corporations that produce movies like this one, and the ambitious hacks who sign up to make them, have no evident motive beyond their own aggrandizement.\"[226] Writing in The Telegraph, Robbie Collin called the film \"humorless\" and \"the most incoherent blockbuster in years\".[227] Cynthia Fuchs of PopMatters said, \"As you’re watching this movie, you might also contemplate your own part, in being swayed into consuming so much of what you’ve consumed before.\" Adding, \"Wonder Woman’s remains Batman v Superman‘s most compelling story, precisely because it’s untold.\"[228] Matt Patches of Thrillist wrote \"what Batman v Superman can do, it does, at the cost of coherency and thrills. The movie is bat-shit crazy. A dour, disdainful demeanor, plus a gluttony of complex plot twists, dissipates most of the contact high.\"[229] Michael Philips of Chicago Tribune wrote, \"A near-total drag, Batman v Superman: Dawn of Justice plays like a loose, unofficial quarter-billion-dollar remake of The Odd Couple, in which Oscar and Felix are literally trying to kill each other.\"[230] On his podcast Hollywood Babble-On, film director Kevin Smith, a long-time friend and collaborator of Affleck, praised Affleck's performance but panned the film, commenting that it \"didn't really have a heart\" and was \"humorless\", arguing that \"there seems to be a fundamental lack of understanding of what those characters are about. It's almost like Zack Snyder didn’t read a bunch of comics, he read one comic once, and it was Dark Knight Returns, and his favourite part was the last part where Batman and Superman fight.\"[231] On a second viewing, however, Smith via his Instagram lightened his stance.[232] Actor Jeremy Irons expressed displeasure with the film, feeling it was \"deservedly so\" savaged by critics and calling the feature \"very muddled\" while expressing hope that Justice League would be better due to its story being \"...a lot smaller, it's more linear\".[233]Conversely, David Betancourt of The Washington Post and Scott Mendelson of Forbes praised the film's visual spectacle and the performances of Affleck, Gadot, Irons and Hunter, though Mendelson also called the film \"an utter mess of thinly sketched characters, haphazard plotting, surprisingly jumbled action\".[234][235] Peter Travers of Rolling Stone called the film \"better than Man of Steel but below the high bar set by Nolan's Dark Knight, adding that \"Dawn of Justice is still a colossus, the stuff that DC Comics dreams are made of for that kid in all of us who yearns to see Batman and Superman suit up and go in for the kill.\"[236] Jake Coyle of Associated Press wrote, \"it hurtles not with the kinetic momentum of Mad Max: Fury Road nor the comparatively spry skip of a Marvel movie, but with an operatic grandeur it sometimes earns and often doesn't.\"[237] Mark Hughes of Forbes called it \"the follow-up to The Dark Knight that many viewers and fans wanted or hoped for\", adding that it's \"visually stunning, with powerful emotional storytelling and awe-inspiring action spectacle.\"[238] Andrew Barker of Variety said \"as a pure visual spectacle... Batman V Superman ably blows the hinges off the multiplex doors.\"[239] Charles Koplinski of the Illinois Times called it \"a brooding, but most importantly intelligent take on the seminal figures of our 20th century pop culture mythology, a movie that at once pays tribute to these characters' roots while offering up modern incarnations of them that ring true for our times.\"[240] Nicolas Barber of the BBC called the film \"a four-star epic\" praising Affleck's performance as Batman and the visual grandeur of Fong's cinematography.[241] Jordan Hoffman of The Guardian gave an ambivalent review; he especially criticized the \"very bad writing\", but conceded \"there are a lot of moments... that work\" and praised Affleck and Gadot's performances, calling Gadot as Wonder Woman the best thing in the film.[242]Cavil, Affleck, and Adams were all nominated for 2016 Teen Choice Awards for \"Choice Movie Actor: Sci-Fi/Fantasy\" and \"Choice Movie Actress: Sci-Fi/Fantasy\".[243]","box_office":"$872.7 million[4]","cinematography":"Larry Fong","Marketing":"An estimated $165 million marketing effort helped promote Batman v Superman: Dawn of Justice.[111] At the 2014 San Diego Comic-Con International, Snyder introduced the film's first footage intended to be exclusive to the event.[112] A teaser trailer was scheduled to be screened in selected cinemas on April 20, 2015.[113] However, on April 16, the trailer leaked online,[114] and within a few hours Snyder officially released the trailer to Twitter.[115] At the 2015 San Diego Comic-Con International, Snyder and the cast attended to present an initial trailer of the film. The trailer was, unlike the teaser, which received mixed response, positively received by attendees, who gave the trailer a standing ovation.[116] Mark Hughes of Forbes said the trailers \"both set the stage for a story about the world’s distrust and fear of Superman, Batman’s rage at Superman and intention to duke it out with the Man of Steel, and Wonder Woman’s participation in a big fight featuring the 'Trinity.'\"[117]Warner Bros. Consumer Products partnered-up with \"a powerhouse slate of global licensees for a broad, multi-category licensing and merchandising program\", including Mattel, Lego, Rubies, Funko, Thinkway Toys, Hot Toys, Junkfood, Bioworld, Pez, Seiko, Converse and among many other licensees to sell merchandise related to the film.[118][119] Fiat Chrysler Automobiles was also a licensee for the film, offering a special edition Jeep Renegade[disambiguation needed] in exchange for a near-exclusive product placement deal; aside from Bruce Wayne's Aston Martin, all vehicles in the film were either from Chrysler, Dodge, Jeep, Ram, or Iveco.[120] Batman v Superman: Dawn of Justice – Cross Fire, an original companion novel tied to the film, telling a tie-in story set before the events of the movie, was published by Scholastic Corporation.[121]A five-issue comic-book prelude exploring what happened in the weeks and months leading up to the events of the film was released as a tie-in with Dr Pepper's character-branded bottles.[122] Also, there are a series of four minicomics found in Batman v Superman-branded General Mills cereals. Additionally, those who purchased Batman v Superman-themed Doritos Family Fun Mix at Walmart received the comic book prequel Batman v Superman: Dawn of Justice – Upstairs/Downstairs.[123] Rocksteady Studios released a downloadable content for the video game Batman: Arkham Knight that featured the Batmobile and Batsuit from the film.[124]The third trailer debuted on Jimmy Kimmel Live! on December 3, 2015. It received positive responses,[125][126][127] with Scott Mendelson of Forbes calling the trailer a \"Saturday morning cartoon nerd’s wildest dreams.\"[128] Molly Driscoll of CS Monitor stated that it looks like the film \"will continue the trend of adapting comic book stories as timely tales.\"[129] Graeme McMillan of The Hollywood Reporter noted that based on the trailer's content, the film might be the anti-Civil War, referring to Marvel's Captain America: Civil War as \"Superman and Batman complete the comic book trope by overcoming their differences to fight a common foe, alongside a third hero, who saves them both — that feels the most fresh, especially in light of the Civil War trailer. While that ended with a showdown between three heroes, this trailer moves beyond that to show three heroes standing united.\"[130] However, some criticised it exactly for revealing that,[131] with Rob Tornoe of NewsWorks pointing out that this trailer was targeting the \"broadest audience\" rather than just fans, as studios try to \"maximize a film's opening day box office.\"[132]Warner Bros. did not buy a Super Bowl 50 commercial;[133] instead, they worked with Turkish Airlines to put together a pair of Batman v Superman-themed airline commercials.[134] McMillan of The Hollywood Reporter stated that the spots \"inform interested parties about the culture, geography and history of Batman and Superman's individual stomping grounds, each one filled with Easter eggs for the comic book faithful and newcomer alike.\"[135] Jesse Eisenberg's part as Lex Luthor in these commercials was praised, as Dirk Libbey of CinemaBlend noted that \"he matches up well with Bruce Wayne by playing the welcoming billionaire business man. It's a far cry from the somewhat cartoonish villain we’ve seen in the clips from the film.\"[134]The final trailer was released to the public on February 11, 2016, which was described as \"intense\" by Kwame Opam of The Verge.[136] Mendelson of Forbes felt that Warner Bros. \"probably wouldn’t have even dropped this one had the prior trailer back in December been received better. So now we have this fourth and final sell, and at least they are going out on a high note.\"[137] Jonathon Dornbush of Entertainment Weekly said that the footage \"works to establish Batman as his own independent crime fighting force, while also providing a deeper look at his existential struggle against Superman.\"[138]In February 2016, Warner Bros. and Doritos formed a partnership, creating a website offering fans the opportunity to enter codes found on Doritos purchases branded with the film's logo, and enter to win movie tickets, tech toys, and a trip the premiere in New York City.[139][140] Warner Bros also partnered with Omaze to give fans who donated a chance to win \"The Ultimate Batman v Superman: Dawn of Justice Experience\", while benefiting three nonprofit organizations nominated by Ben Affleck, Henry Cavill and Jesse Eisenberg. \"The Ultimate Batman v Superman: Dawn of Justice Experience\" offered a fan and their friend the chance to win tickets to the premiere of the film, as well as fly on a helicopter with Cavill or ride in the Batmobile with Affleck.[141] Hendrick Motorsports drivers Jimmie Johnson and Dale Earnhardt, Jr. drove cars based on Superman and Batman respectively, at Auto Club Speedway on March 20, 2016.[142] A tie-in endless runner video game to the film, entitled Batman vs Superman – Who Will Win?, debuted March 16, 2016, released by Warner Bros. International Enterprises.","directed_by":"Zack Snyder","Home media":"An extended cut of the film dubbed the Ultimate Edition will be released on home media platforms. This version received an R rating from the Motion Picture Association of America, for more violence than the PG-13 rated theatrical cut,[48][244] and will be 30 minutes longer than the theatrical version.[245] With the release of the \"Ultimate Cut\", critics have voiced their opinion that the extended cut, which was the director's original version of the film before scenes were shortened and even cut from the film in their entirety, may actually change the audience's reaction and reception to the movie in hindsight, saying that the film has great story-telling and the problems with the original release in large part are due to the editing.[246] In contrast to the theatrical version, the Ultimate Cut has received favorable reviews. The extended version has been well-received for its scene-flow and additional scenes that create a more cohesive transition throughout the film. Additional scenes with the various characters have been praised for the character development aspect. Overall the consensus is however, that the Ultimate Cut helps with some of the issues that the audience may have had with the theatrical release and may win back some fans, though it will not change an individual's opinion about the film overall.[247]","production_companies":"RatPac-Dune Entertainment DC Entertainment Atlas Entertainment Cruel and Unusual Films","release_dates":"March 19, 2016 (2016-03-19) (Auditorio Nacional)|March 25, 2016 (2016-03-25) (United States)||||","Production":"\"... after Man of Steel finished and we started talking about what would be in the next movie, I started subtly mentioning that it would be cool if he faced Batman... You're in a story meeting talking about, like, who should [Superman] fight if he fought this giant alien threat Zod who was basically his equal physically, from his planet, fighting on our turf... You know, who to fight next?... But I'm not gonna say at all that when I took the job to do Man of Steel that I did it in a subversive way to get to Batman. I really believe that only after contemplating who could face [Superman] did Batman come into the picture.\"In June 2013, Warner Bros. announced that director Zack Snyder and screenwriter David S. Goyer would return for a Man of Steel sequel,[51] with the studio considering the release for the film in 2015.[52] The following month, Snyder confirmed at San Diego Comic-Con International that the sequel to Man of Steel would feature Superman and Batman meeting for the first time on film. Goyer and Snyder would co-write the story, with Goyer authoring the script,[15][53] and Christopher Nolan involved in an advisory role as executive producer.[54] According to Snyder, the film would take inspiration from the comic The Dark Knight Returns.[55]In November 2013, Snyder clarified his film would not be based upon the aforementioned graphic novel. \"If you were going to do that, you would need a different Superman. We’re bringing Batman into the universe that now this Superman lives in.\"[56] Batman v Superman marks the first appearance of Wonder Woman in a live-action, theatrical film,[22] which Warner Bros. had been developing as far back as 1996.[57] In December 2013, Chris Terrio was hired to rewrite the script, due to Goyer's commitments to other projects. Terrio had previously collaborated with Affleck on Argo.[58]The film's official title, Batman v Superman: Dawn of Justice, was revealed in May 2014.[59] Snyder stated that having the \"v\" in the title instead of \"vs.\" was a way \"to keep it from being a straight 'versus' movie, even in the most subtle way\".[60] Henry Cavill later stated, \"I wouldn't call this a Superman sequel [...] This is Batman versus Superman. It's a separate entity altogether. It's introducing the Batman character and expanding upon the universe, which was kicked off by Man of Steel.\"[61] Forbes noted that although the film originated as a sequel to Man of Steel, it was \"revamped into a backdoor pilot for Justice League and/or an eventual stand-alone Batman movie.\"[62]Henry Cavill, Amy Adams, Kevin Costner, Diane Lane, Laurence Fishburne, Harry Lennix and Christina Wren reprise their roles from Man of Steel.[30][31][63] Joining the cast are Ben Affleck as Batman, Gal Gadot as Wonder Woman, Jesse Eisenberg as Lex Luthor, Jeremy Irons as Alfred Pennyworth,[63] Ray Fisher as Cyborg,[36] Jason Momoa as Aquaman,[37][38] and Tao Okamoto as Luthor's assistant Mercy Graves.[26] Scoot McNairy, Callan Mulvey, and Jena Malone were cast in unspecified roles.[20][25][47][64]Dawn of Justice is Affleck's second film as a comic book superhero; he played Daredevil in the 2003 film of the same name,[65] and was initially reluctant to accept playing Batman, citing that he \"felt [he] didn't fit the traditional mold. But once Zack [Snyder] showed [him] the concept, and that it would be both different from the great movies that Chris[topher Nolan] and Christian [Bale] made, but still in keeping with tradition, [he] was excited.\"[66] Affleck previously stated in 2006 that Daredevil had \"inoculated [him] from ever playing another superhero\".[67]Snyder cast an older Batman to be a layered juxtaposition against a younger Superman; while \"bear[ing] the scars of a seasoned crime fighter, but retain[ing] the charm that the world sees in billionaire Bruce Wayne.\"[13] Nolan was involved with the casting of Affleck and he was the first actor Snyder approached for the part.[54] The director had also discussed the part with Josh Brolin.[68] Bale admitted he wanted to play Batman again after The Dark Knight Rises,[69] though he stated that his Batman does not belong in any other film and he was never approached by Warner Bros. to play the role again.[70][71]On casting Eisenberg as Lex Luthor, Snyder offered, \"Having Jesse in the role allows us to explore that interesting dynamic, and also take the character in some new and unexpected directions\".[17] Bryan Cranston was considered for the role of Lex Luthor before Eisenberg was cast.[72] Producer Charles Roven revealed that this incarnation of Wonder Woman would use the character's origins in The New 52, wherein the character would be a demigoddess, and the daughter of Zeus. This deviates from the character's original origins, where she was \"a clay figure brought to life by the gods\".[24] Olga Kurylenko was considered for the role of Wonder Woman before Gadot was cast.[73] Dawn of Justice is Ray Fisher's feature film debut,[74] and the first live-action film to feature Cyborg,[75] whose role will become more significant in future DC Comics films.[76] It is also the live-action theatrical debut of Aquaman.[77]The casting of Affleck, Gadot, and Eisenberg was criticized. Affleck's casting caused significant backlash from comic book fans, with multiple online petitions demanding his removal from the role; unlike previous Batman actors, he was not considered intimidating enough for the role by the protesters.[78] Via social media, fans criticized Gadot's small frame in contrast to Wonder Woman's warrior-like build in the comics.[79] Responding to this, Gadot stated that she had been participating in various training regimens to achieve a body that stays closer to the source material.[80] Fans also criticized Eisenberg's casting, feeling that the then-30-year-old was too young for the role, and not physically imposing enough.[81] Upon the film's release, both Affleck and Gadot received considerable praise for their performances, despite the overall negative reception of the film itself.[82][83]Michael Wilkinson reprised his duties as costume designer. He updated the Superman suit from Man of Steel so that it \"feels fresh and right for this installment of Zack Snyder's comic-book universe\".[84] The first Batsuit featured in the film is influenced by The Dark Knight Returns;[85] unlike the suits seen in previous live-action Batman films, it is made of cloth instead of armor and is a cast of the physique of fitness model Rossano Rea.[86][87] An image of the Wonder Woman costume was revealed at the 2014 San Diego Comic-Con, in which the costume desaturates the red, blue, and gold colors that make up the costume of most versions of the character.[88]A second Batsuit was also unveiled at Comic-Con, and unlike the first, it is armored.[89] Aquaman's look in this film shows him \"tattooed in Maori-like patterns\", and wearing a suit \"decked out in shades of gold, black and silver armor\".[90] According to the Warner Bros. Studios lot, the next generation Batmobile combined inspiration from both the sleek, streamlined design of classic Batmobiles and the high-suspension, military build from the more recent Tumbler from the The Dark Knight Trilogy. Designed by production designer Patrick Tatopoulos, the Batmobile is about 20 feet long and 12 feet wide.[91]The glasses Henry Cavill wears as Clark Kent are made by British spectacle designer Tom Davies.[92]In September 2013, Larry Fong joined the crew as cinematographer, having previously worked with Zack Snyder on 300, Watchmen, and Sucker Punch.[93] Initial filming commenced on October 19, 2013, at East Los Angeles College, to shoot an American football game between Gotham City University and rival Metropolis State University.[94] At the end of the month, construction began on the Kent farm seen in Man of Steel for the film.[95] Principal photography involving the main cast of the film began on May 19, 2014, in Detroit, Michigan,[96] with scenes featuring Gal Gadot as Diana Prince being filmed early on May 16.[97]Additional filming began in Chicago, Illinois in November 2014.[98] Other locations included the Michigan Motion Picture Studios, the Eli and Edythe Broad Art Museum at Michigan State University, Yorkville, Illinois, and New Mexico.[99][100][101] Sequences of the film, including a scene depicting the murder of Bruce Wayne's parents, were filmed using IMAX cameras.[102] The planned shoot in Morocco was shifted to New Mexico due to incidents related to the 2014 Ebola outbreak.[103] Principal photography wrapped on December 5, 2014.[104]Hans Zimmer composed the film score,[105] emphasizing a challenge to not reuse the themes he established with the Batman character from Christopher Nolan's trilogy.[106] Junkie XL, who provided additional music in Man of Steel, also returned for this film, helping to compose the theme for Batman.[107] Originally, Zimmer enlisted Junkie XL to compose the Batman material, with Zimmer planning to focus solely on the Superman side of the score, but the final Batman theme was written by both composers as a collaboration.[108] Zimmer noted that he had significant trouble in finding a new angle from which to tell the story and after the release of the film, Zimmer announced that he was retired from superhero films.[109] The soundtrack album of the film was released on March 18, 2016 on WaterTower Music.[110]","produced_by":"Charles Roven|Deborah Snyder|","starring":"Ben Affleck|Henry Cavill|Amy Adams|Jesse Eisenberg|Diane Lane|Laurence Fishburne|Jeremy Irons|Holly Hunter|Gal Gadot|","running_time":"151 minutes[1]","music_by":"Hans Zimmer|Junkie XL|","edited_by":"David Brenner","Release":"In January 2014, Warner Bros. announced that Batman v Superman: Dawn of Justice was delayed from its original release date of July 17, 2015, and moved to May 6, 2016, in order to give the filmmakers \"time to realize fully their vision, given the complex visual nature of the story.\"[143] The release date was moved once again in August 2014 from May 6, 2016, to March 25, 2016, with a Warner Bros. insider saying the studio was \"not flinching\" in regards to the previous opening date being on the same day as Marvel Studios' Captain America: Civil War, but instead stating that March 2016 was a \"fantastic corridor\" for them.[144] According to sources obtained by The Hollywood Reporter, Warner Bros. considered the possibility of having a 70mm release for the film, which was partially shot in the 65mm IMAX format.[145]Batman v Superman: Dawn of Justice premiered at Auditorio Nacional in Mexico City on March 19, 2016,[146] followed by a New York City premiere on March 20 at Radio City Music Hall.[147] Following the Brussels attacks, Warner Bros. originally cancelled the red carpet of the London premiere, but decided to carry on with the premiere for the fans.[148] The film was released in the United States and the United Kingdom on March 25 in 3D.[144][149] It opened simultaneously in North America, China and Japan, the world's three largest film markets, as well as additional international territories,[150] with the exception of Poland, where theaters do not open on Good Friday.[2] The film debuted simultaneously across 30,000 screens in nearly every major foreign territory across 61 markets, including China, with domestic open across roughly 4,242 locations of which 3,500 theaters (85%) were in 3D, 390 IMAX screens, 470 PLF locations, 150 D-Box theaters and ten 70 mm prints.[151][152][153]","batman_v_superman:_dawn_of_justice":"Theatrical release poster","written_by":"Chris Terrio|David S. Goyer|","budget":"$250 million[2][3]"}