{"Cast":"Cast notes","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Andrew Bergman|Mel Brooks|Richard Pryor|Norman Steinberg|Al Uger|","story_by":"Andrew Bergman","Legacy":"A television pilot titled Black Bart was produced for CBS based on Bergman's original story. It featured Louis Gossett, Jr. as Bart and Steve Landesberg as his drunkard sidekick, a former Confederate officer named \"Reb Jordan\". Bergman is listed as the sole creator. The pilot did not sell, but CBS aired it once on April 4, 1975. It was later included as a bonus feature on the Blazing Saddles 30th Anniversary DVD and the Blu-ray disc.[32]With the production of musical adaptations of The Producers and Young Frankenstein, rumors spread about a possible adaptation of Blazing Saddles. Brooks joked about the concept in the final number in Young Frankenstein, in which the full company sings, \"next year, Blazing Saddles!\" In 2010, Mel Brooks confirmed this, saying that the musical could be finished within a year. No creative team or plan has been announced.[33]The first studio-licensed release of the full music soundtrack to Blazing Saddles was on La-La Land Records on August 26, 2008. Remastered from original studio vault elements, the limited edition CD (a run of 3000) features the songs from the film as well as composer John Morris's score. Instrumental versions of all the songs are bonus tracks on the disc. The disc features exclusive liner notes featuring comments from Mel Brooks and John Morris.[34]","Plot":"In the American Old West of 1874, construction on a new railroad led by Lyle (Burton Gilliam) runs into quicksand. The route has to be changed, which will require it to go through Rock Ridge, a frontier town where everyone's last name is Johnson (including \"Howard Johnson\", \"Dr. Samuel Johnson\", \"Van Johnson\" and \"Olson N. Johnson\"). The conniving State Attorney General Hedley Lamarr (Harvey Korman) – who constantly has to correct people who call him \"Hedy\"– wants to buy the land along the new railroad route cheaply by driving out the townspeople. He sends a gang of thugs, led by his flunky assistant Taggart (Slim Pickens), to scare them away, prompting the townsfolk to demand that Governor William J. Le Petomane (Mel Brooks) appoint a new sheriff. Lamarr persuades the dim-witted Le Petomane to select Bart (Cleavon Little), a black railroad worker who was about to be hanged, as he believes a black lawman will so offend the townspeople that they will either abandon Rock Ridge or lynch the new sheriff, with either result paving the way for him to take over the town.With his quick wits and the assistance of drunken gunslinger Jim (Gene Wilder), also known as \"The Waco Kid\" (\"I must have killed more men than Cecil B. DeMille\"),[4] Bart works to overcome the townsfolk's hostile reception. He subdues and befriends Mongo (Alex Karras), an immensely strong, slow-thinking (but surprisingly philosophical) henchman sent by Taggart and Lyle to kill him, and then beats German seductress-for-hire Lili von Shtupp (Madeline Kahn) at her own game. Lamarr, furious that his schemes have backfired, hatches a larger plan involving a recruited army of thugs, including common criminals, Ku Klux Klansmen, and Nazi soldiers.Bart gathers the townspeople and the railroad workers three miles east of Rock Ridge to build a fake town as a diversion. They labor all night to build a perfect replica of their town; but with no people in it, Bart realizes it won't fool Lamarr's villains. While the townspeople construct replicas of themselves, Bart, Jim, and Mongo buy time by constructing the \"William J. Le Petomane Memorial Tollbooth\", forcing the raiding party to turn back for \"a shitload of dimes\" to pay the toll. Once through the tollbooth, Lamarr's villains attack the fake town populated with dummies, which is boobytrapped with dynamite bombs. After Jim detonates the bombs with his sharpshooting, launching bad guys and horses skyward, the Rock Ridgers storm the villains.The resulting brawl between the townsfolk and Lamarr's thugs breaks the fourth wall—literally—spilling into a neighboring set where director Buddy Bizarre (Dom DeLuise) is directing a Busby Berkeley-style top-hat-and-tails musical number with an effeminately gay cast; then into the studio commissary for a food fight; and then out of the Warner Bros. film lot into the streets of Burbank. Lamarr, realizing he has been beaten again, hails a taxi and orders the driver to \"get me out of this picture\". He ducks into Grauman's Chinese Theatre, which is playing the premiere of Blazing Saddles. As he settles into his seat, he sees Bart arriving on horseback outside the theatre. Bart blocks Lamarr's escape, then kills him in a spoof of a classic cinematic gunfight, shooting him in the groin. Bart and Jim then go into Grauman's to watch the end of the film, in which Bart announces to the townspeople that he is moving on, for his work is done (and he is bored). Riding out of town, he finds Jim (finishing his popcorn), and invites him along to \"nowhere special\". The two friends ride off into the sunset—in a chauffeured stretch limousine.","language":"English","Reception":"While the film is widely considered a classic comedy today, critical reaction was mixed when the film was first released. Vincent Canby wrote:[20]Blazing Saddles has no dominant personality, and it looks as if it includes every gag thought up in every story conference. Whether good, bad or mild, nothing was thrown out. Woody Allen's comedy, though very much a product of our Age of Analysis, recalls the wonder and discipline of people like Keaton and Laurel and Hardy. Mr. Brooks's sights are lower. His brashness is rare, but his use of anachronism and anarchy recalls not the great film comedies of the past, but the middling ones like the Hope-Crosby \"Road\" pictures. With his talent he should do much better than that.Roger Ebert gave the film four stars and called it a \"crazed grabbag of a movie that does everything to keep us laughing except hit us over the head with a rubber chicken. Mostly, it succeeds. It's an audience picture; it doesn't have a lot of classy polish and its structure is a total mess. But of course! What does that matter while Alex Karras is knocking a horse cold with a right cross to the jaw?\"[21]The film grossed $119.5 million in the box office, becoming only the tenth film in history up to that time to pass the $100 million mark.[22]On the film-critics aggregator Rotten Tomatoes, the film has 90% positive reviews based on 49 reviews.[23]","box_office":"$119.5 million[2]","cinematography":"Joseph F. Biroc","directed_by":"Mel Brooks","Home media":"The film was released on DVD for the first time on June 25, 1997.[35] On September 5, 2006, the film was released on blu-ray.[36]","Awards and honors":"In the scene where Lamarr addresses his band of bad guys, he says, \"You men are only risking your lives, while I am risking an almost-certain Academy Award nomination for Best Supporting Actor!\" Harvey Korman did not, in fact, get an Oscar nomination, but the film did receive three other Academy Awards nominations in 1974: Best Actress in a Supporting Role for Madeline Kahn, Best Film Editing, and Best Music, Original Song. The film also earned two BAFTA awards nominations, for Best Newcomer (Cleavon Little) and Best Screenplay.[24][25]The film won the Writers Guild of America Award for \"Best Comedy Written Directly for the Screen\" for writers Mel Brooks, Norman Steinberg, Andrew Bergman, Richard Pryor, and Alan Uger.[26]In 2006, Blazing Saddles was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and was selected for preservation in the National Film Registry.[27]American Film Institute Lists","release_dates":"February 7, 1974 (1974-02-07)|||||","Production":"The idea for the film came from a story outline written by Andrew Bergman that Brooks described as \"hip talk—1974 talk and expressions—happening in 1874 in the Old West\". Originally, Bergman attempted to make the film on his own. He recalled, \"I wrote a first draft called Tex-X. Alan Arkin was hired to direct and James Earl Jones was going to play the sheriff. That fell apart as things often do.\"[6] Brooks was immediately taken by the story. Though he had not worked with a writing team since Your Show of Shows, he hired a group of writers (including Bergman) to expand the outline, and posted a large sign: \"Please do not write a polite script\".[7] Brooks described the writing process as chaotic: \"Blazing Saddles was more or less written in the middle of a drunken fistfight. There were five of us all yelling loudly for our ideas to be put into the movie. Not only was I the loudest, but luckily I also had the right as director to decide what was in or out.\"[8] Bergman remembers the room being just as chaotic, telling Creative Screenwriting, \"In the beginning, we had five people. One guy left after a couple of weeks. Then, it was basically me, Mel, Richie Pryor and Norman Steinberg. Richie left after the first draft and then Norman, Mel and I wrote the next three or four drafts. It was a riot. It was a rioter’s room!\"[6]The original title, Tex X (a play on Black Muslim leader Malcolm X), was rejected, along with Black Bart and Purple Sage. Brooks finally conceived Blazing Saddles one morning while taking a shower.[9] For the movie's title song, Brooks advertised in the trade papers for a \"Frankie Laine-type\" singer; to his surprise, Laine himself offered his services. \"Frankie sang his heart out ... and we didn't have the heart to tell him it was a spoof. He never heard the whip cracks; we put those in later. We got so lucky with his serious interpretation of the song.\"[10]Casting was problematic: Richard Pryor was Brooks' original choice to play the sheriff, but the studio, claiming his history of drug arrests made him uninsurable, refused to approve financing with Pryor as the star.[9] Cleavon Little was cast in the role, and Pryor remained as a writer. Brooks offered the other leading role, the Waco Kid, to John Wayne; he declined, deeming the film \"too blue\" for his family-oriented image, but assured Brooks that \"he would be the first one in line to see it\".[11] Gig Young was cast, but he collapsed during his first scene from what was later determined to be alcohol withdrawal syndrome, and Gene Wilder was flown in to replace him.[12][13] Johnny Carson and Wilder both turned down the Hedley Lamarr role before Harvey Korman was cast.[14] Madeline Kahn objected when Brooks asked to see her legs during her audition. \"She said, 'So it’s THAT kind of an audition?'\" Brooks recalled. \"I explained that I was a happily married man and that I needed someone who could straddle a chair with her legs like Marlene Dietrich in Destry Rides Again. So she lifted her skirt and said, 'No touching.'\"[15]Brooks had repeated conflicts over content with Warner Bros. executives; they objected to the constant use of the word \"nigger\", the scene of Lili Von Shtupp seducing Bart in the dark, the flatulent campfire scene, and Mongo punching out a horse, among other issues. Brooks, whose contract gave him final content control, declined to make any substantial changes. He did remove the final line in Bart and Lili's seduction scene: \"I hate to disappoint you, ma'am, but you're sucking my arm.\"[16] When asked later about his frequent use of \"nigger\" in the script, Brooks said he received consistent support for its use from Pryor and Little. He added that if the film were to be remade today, the controversial word would have to be omitted, \"... and then, you've got no movie\".[17] After the film's release, he said, he received many letters of complaint about the frequent \"nigger\" references; \"... but of course, most of them were from white people.\"[18]Ultimately, the film was almost not released at all. “When we screened it for executives, there were few laughs,\" said Brooks. \"The head of distribution said, 'Let’s dump it and take a loss.’ But [studio president John] Calley insisted they open it in New York, Los Angeles and Chicago as a test. It became the studio’s top moneymaker that summer.”[15] The movie premiered on February 7, 1974, at the Pickwick Drive-In Theater in Burbank; 250 invited guests—including Little and Wilder—rode horses to the event, and watched the film on horseback.[19]Hedy Lamarr sued Warner Bros., claiming that the film's running parody of her name infringed on her right to privacy. Brooks said he was flattered; the studio settled out of court for a small sum and an apology for “almost using her name\". Brooks said that Lamarr \"never got the joke\".[18]","blazing_saddles":"theatrical release poster by John Alvin[1]","produced_by":"Michael Hertzberg","starring":"Cleavon Little|Gene Wilder|Harvey Korman|Slim Pickens|Madeline Kahn|Mel Brooks|Dom DeLuise|","running_time":"95 minutes","music_by":"Songs: Mel Brooks Score: John Morris","External links":"","edited_by":"Danford Greene John C. Howard","budget":"$2.6 million"}