{"based_on":"\"The Bandits of Marseilles\" by Eugene Saccomano","country":"France Italy","distributed_by":"Paramount","Plot":"In year 1930, in Marseilles, the gangster Siffredi is released from prison and searches for his former girl friend, Lola.He finds her with Capella, another gangster. The two men fight over her but become friendly and form a partnership.Capella and Siffredi fix horseraces and prizefights, then are contacted by Rinaldi, a lawyer who works for Marello and Poli, the gangsters who control crime in Marseilles.Rinaldi suggests that Siffredi and Capella seize control of Marello's hold on the fish market business. They succeed in doing this but become ambitious and try to control Poli's meat market operations. Poli tries to have them killed but they succeed in killing him.Another gangster, The Dancer, kills Rinaldi. Capella and Siffredi dispose of his body and establish themselves as the rulers of the Marseilles crime world.Capella decides to leave Marseilles but is killed by an assassin. Siffredi then decides to leave Marseilles himself.","language":"French Italian","Reception":"The film was a large success at the French box office, breaking records throughout the country. It was also very popular elsewhere in Europe but did not break through in the US the way the filmmakers hoped.[4] While it was released the Markovic Affair was still being heavily publicised, adding to the film's notoriety.[5]The movie saw a revival in the popularity of Borsalino hats.[1]","box_office":"$3.5 million (Italy)[1] 4,710,381 admissions (France)[2]","cinematography":"Jean-Jacques Tarbès","production_company":"Adel Productions Marianne Productions Mars Film Produzione","directed_by":"Jacques Deray","borsalino":"French film poster for Borsalino","Feud Between Belmondo and Delon":"Jean Paul Belmondo later sued Delon over the matter of billing - the words \"an Alain Delon Production\" appeared before Belmondo's name in the credits, resulting in Belmondo taking Delon to court. Delon said when promoting the film in the US:We are still what you in America call pals or buddies. But we are not friends. There is a difference. He was my guest in the film but still he complained. I like him as an actor but as a person, he's a bit different. I think his reaction was a stupid reaction... almost like a female reaction. But I don't want to talk about him anymore.[4]Delon's associate producer, Pierre Caro, later claimed at the same time:If you ask me, I think Belmondo was afraid from the first to make a picture with Alain. He demanded the same number of close ups. Alain had to cancel a lot of his best scenes because they made him look better than Belmondo. My own feeling is that they will never work together again. Alain says they will but he lies.[4]Director Jacques Deray reflected, \"All through production Delon was impeccable, never interfered. But when the film was completed Delon the producer stepped in and took it over.\"[6]BBC One in the United Kingdom were airing the film in the early hours of Sunday 31st August 1997. BBC One continuity interrupted the film at around 1.15am, 45 minutes into the film, to bring the first news report of the car crash in Paris involving Diana, Princess of Wales. BBC Newsreader Martyn Lewis gave a short update about the crash, and then BBC One went back to airing the rest of the film. They would interrupt the film one more time in the following hour to bring more news on the car crash.[8][9][10][11]","release_dates":"20 May 1970","Production":"The film was based on real life gangsters Paul Carbone and François Spirito. In real life these men joined the Carlingue that collaborated with the Germans during World War Two (but this is not mentioned in the film).[4]It was produced by Alain Delon, who had been looking for a vehicle for him to co-star with Belmondo. He found the story in a book he was reading about French gangsters from 1900 to 1970.[5]Under the terms of their contracts, each actor had to have the same amount of close ups. Delon dyed his hair black for his role.[5]It was one of the most expensive French movies ever made. Finance mostly came from Paramount Picture.[6]The movie was originally going to be called Carbone and Spirito but there were objections and it was decided to fictionalise the characters.[7]The title Borsalino comes from the name of the hat company that made the men's hats that appear in the film. The Borsalino Company made fedora style hats from the late 19th century to the 20th century: the golden age was in the 1920s, 1930s and 1940s, when sales went through the roof. (Although the company still sells fedora hats today, the company is most involved with the manufacturing of clothes and helmets for men.)Alain Delon said he wanted a title like Vera Cruz which did not have to be translated all around the world.[5]The Borsalino hat company helped finance the movie.[1]","produced_by":"Alain Delon Henri Michaud","starring":"Jean-Paul Belmondo Alain Delon","running_time":"125 minutes","music_by":"Claude Bolling","edited_by":"Paul Cayatte","written_by":"Jean-Claude Carrière Jean Cau Jacques Deray Claude Sautete"}