{"based_on":"Five Point Someone – What not to do at IIT!  by Chetan Bhagat","country":"India","distributed_by":"Reliance Entertainment Miramax","Possible sequel":"When asked about plans of a 3 Idiots sequel in an interview with Hindustan Times, screenwriter Abhijat Joshi replied, saying, \"Honestly, I don’t know. We have an idea for the 3 Idiots sequel, a Munna Bhai part three, and also for a PK sequel; but the PK and Munna Bhai sequels interest me the most. So, I think the 3 Idiots sequel may happen in the future, but these two I really want to work on.\" [59]In January 2016, director Rajkumar Hirani and actor Aamir Khan confirmed that they were considering a 3 Idiots sequel. Khan told reporters, \"“Raju Hirani has given me a hint about ‘3 Idiots’ sequel and I am giving you all a hint. The film will happen if and whenever he will write the script.” Hirani agreed, saying \" this is one film that I really want to do.\" [60]","language":"Hindi[1]","box_office":"est. ₹392 crore (equivalent to ₹690 crore or US$100 million in 2016)[3]","cinematography":"C. K. Muraleedharan","production_company":"Vinod Chopra Films Dimension Films","directed_by":"Rajkumar Hirani","Remakes":"This film was remade into Tamil entitled Nanban, in January 2012.[6][7][75]Following the success of 3 Idiots in East Asian markets such as China and Hong Kong, the producer Vidhu Vinod Chopra has announced that Hong Kong film star Stephen Chow (known for comedy films such as Shaolin Soccer and Kung Fu Hustle) will be producing a Chinese remake of the film. Chopra also announced that there are plans for a Hollywood remake, and is in talks with three different American studios interested in remaking the film. Chopra also stated that there is an Italian film studio also interested in remaking the film.[8]","narrated_by":"R. Madhavan","release_dates":"25 December 2009 (2009-12-25)|||||","Production":"Principal photography began on 28 July 2008. Hirani and his team left in late August for the shoot with the principal cast. The film was shot in Delhi, Bangalore, Mumbai, Ladakh, Chail and Shimla.[10] Aamir and rest of the cast began shooting in early September. Hirani planned to wrap up the film by December.[11] The first scene was shot in an aircraft with Madhavan. From Mumbai, the crew and cast comprising Aamir and Kareena went to Ladakh for a 20-day schedule.[12] Filming of the ICE college scenes took place at the Indian Institute of Management – Bangalore campus for 33 days as a part of the second schedule of production.[13]","running_time":"171 minutes[1]","Controversy":"Prior to the release of the film director Rajkumar Hirani commented on the relationship between Five Point Someone by Chetan Bhagat and 3 Idiots stating:The day after the film opened, Chetan also noted:A controversy developed a few days after the release, however, over the fact that Chetan's credit, \"Based on the novel Five Point Someone by Chetan Bhagat\" appeared in the closing credits rather than in the opening ones.[67] At that time, Bhagat stated that he \"was expecting an opening credit and I was quite surprised on not seeing it. They had bought the rights, made the payment and committed to a credit in the contract. It’s there, but it’s not about it being there, it’s about the placement and the prominence.\"[68] In a 31 December 2009 blog post on his personal website, Bhagat stated that he was told the movie was only 2–5% based on the book, but when he saw it, he felt that it was 70% of the book. He also argued that he was misled by the makers of the film, though he noted, that \"this has nothing to do with Mr Aamir Khan […] I am a big fan of Aamir and he has made my story reach people. However, he was told by the makers not to read the book, and he hasn’t. Thus, he cannot comment on the issue in a meaningful manner.\"[69]A few people responded to Chetan's statements. According to the Indo-Asian News Service (IANS), during a press conference with reporters producer Vidhu Vinod Chopra \"clarified that in the agreement between the producer and Bhagat, it was clearly mentioned that the author’s name would be put in the closing credits.\" IANS also reported that Chopra \"lost his cool\" and \"asked a reporter to shut up after being questioned whether his hit 3 Idiots was lifted from author Chetan Bhagat’s book Five Point Someone.\"[70] Chopra later apologised, stating: \"I really think I’m silly. I was provoked, but I shouldn’t have done this. I saw myself on TV and saw how I was shouting 'shut up, shut up' like an animal. I told myself — 'what nonsensical behaviour'.\"[71] Aamir Khan also responded to these claims.[67][72] Rajkumar Hirani stated that \"We have officially bought the rights for the film. We drew a contract with him and it clearly mentions about the position of his credit. With open eyes he had seen the contract, consulted his lawyer and signed the agreement […] In the contract, we have said that the title would be given in the rolling credits. We haven't changed the font size. We haven't increased the speed of the title. It's exactly there where it was agreed to be.\"[73] Chetan Bhagat later apologised stating, \"I definitely do not have anything against team 3 Idiots. I may have some issues on the mistake they may have made but nothing about their personality or the kind of people they are. I apologise to their families if there was any distress caused to them. I also want to thank all my fans, who stood by me but I don't want them to turn against anyone especially Aamir.\"[74]","Release":"The film initially opened up on 2000 prints worldwide.[14] 3 Idiots was released in 1800 theaters in India, which was at that time a big domestic release.[15] 3 Idiots was released in 415 screens overseas.[16] 3 idiots was released in 2,215 theaters worldwide.","budget":"₹55 crore (equivalent to ₹97 crore or US$14 million in 2016)[2]","screenplay_by":"Abhijat Joshi Rajkumar Hirani Vidhu Vinod Chopra","3_idiots":"Theatrical release poster","Plot":"Farhan Qureshi (R.Madhavan) and Raju Rastogi (Sharman Joshi) are students at the prestigious Imperial College of Engineering (ICE). Farhan's passion is wildlife photography, but he pursues an engineering degree to appease his father. Raju chooses engineering with hopes of improving his family's financial situation, but his lack of self-confidence results in poor grades. Their third roommate and friend, Ranchodas 'Rancho' Shamaldas Chanchad (Aamir Khan), has immense interest in robotics, and invents in his spare time. After giving unorthodox answers in class, Rancho faces scrutiny from the college's director, Dr. Viru Sahastrabuddhi (Boman Irani), known as \"Virus\", whose traditional philosophies on education and learning contrast sharply with Rancho's atypical ideas of teaching. Virus is shown to be extremely strict — a trait that indirectly caused his own son's suicide by putting him under excessive pressure.Rancho eventually falls in love with Pia (Kareena Kapoor), Virus' younger daughter, who is a medical student in residency at the city's hospital. He also regularly scores the highest on exams out of his class, much to the dismay of both Virus and Chatur, an arrogant Tamil student who also despises Rancho. One night, Rancho, Farhan, and Raju drunkenly break into the Sahastrabuddhi household to allow Rancho to profess his love to Pia. After discovering their antics, Virus threatens to expel Raju unless he writes a letter blaming Rancho for the break-in. Unwilling to betray Rancho or disappoint his family, Raju unsuccessfully attempts suicide, and ends up in a coma. After intensive care and support from his friends, Raju recovers just before he successfully interviews for a corporate job.Farhan has adopted Rancho's outlook and decides to pursue his love of photography. Frustrated at Rancho's influence on Raju and Farhan, Virus conspires to deliberately modify the final exams so that none of them can graduate. The trio, however, earn a reprieve when Virus' pregnant elder daughter Mona (Mona Singh) goes into labour at the same time that a heavy storm cuts off all power and traffic. Despite this, Rancho uses his engineering knowledge to deliver the baby in the college common room. A grateful Virus finally acknowledges Rancho as an extraordinary student, and allows the three to graduate. Rancho then unexpectedly disappears shortly after the ceremony.Ten years later, Chatur is the vice president of a corporation in the United States, Farhan is a successful photographer, and Raju is married while living a comfortable lifestyle. None of them have heard from Rancho since graduation, and the three reunite at the college campus water tower to find him. They discover that the Rancho they knew was actually \"Chhote\", an orphaned servant to the Chanchad family household in Shimla. When the real Ranchodas (Javed Jaffrey) went to London for four years, his father allowed the servant to fill his son's place - including using his son's full name - and take credits for the degree. With the help of the real Ranchodas, the trio travel to a village school in Ladakh, where Rancho supposedly works as a teacher. On the way there, the three rescue Pia from her arranged wedding at Manali.Upon arrival in Ladakh, the four find the village school where they see young students' inventions resembling Rancho's own college projects. Raju, Farhan, and Pia then happily reunite with Rancho on a sandbar, where Rancho and Pia kiss. Assuming Rancho to just be a school teacher, Chatur forces him to concede that he is less successful than Chatur. Shortly after, Rancho reveals that he became a scientist (while also teaching young children when he's not researching), and that his real name is Phunsukh Wangdu. Much to Chatur's horror, this also happens to be the name of a wealthy client that Chatur had spent a year trying to find and sign a business deal with.","Critical reception":"3 Idiots received universal critical acclaim. Subhash K. Jha stated: \"It's not that 3 Idiots is a flawless work of art. But it is a vital, inspiring and life-revising work of contemporary art with some heart imbued into every part. In a country where students are driven to suicide by their impossible curriculum, 3 Idiots provides hope. Maybe cinema can't save lives. But cinema, sure as hell, can make you feel life is worth living. 3 Idiots does just that, and much more. The director takes the definition of entertainment into directions of social comment without assuming that he knows best.\"[43] Nikhat Kazmi of the Times of India gave it four and a half stars and suggests that, \"The film is a laugh riot, despite being high on fundas […] Hirani carries forward his simplistic 'humanism alone works' philosophy of the Lage Raho Munna Bhai series in 3 Idiots too, making it a warm and vivacious signature tune to 2009. The second half of the film does falter in parts, specially the child birth sequence, but it doesn't take long for the film to jump back on track.\"[44] Mayank Shekhar of the Hindustan Times gave the film three and a half out of five stars and comments that \"this is the sort of movie you’ll take home with a smile and a song on your lips.\"[45] Taran Adarsh of Bollywood Hungama gave 3 Idiots four and a half out of five stars and states: \"On the whole, 3 Idiots easily ranks amongst Aamir, Rajkumar Hirani and Vidhu Vinod Chopra's finest films. Do yourself and your family a favour: Watch 3 Idiots. It's emotional, it's entertaining, it's enlightening. The film has tremendous youth appeal and feel-good factor to work in a big way.\"[46] Kaveree Bamzai of India Today gave 3 Idiots five stars and argues that \"it's a lovely story, of a man from nowhere who wanted to learn, told like a fairy tale, with the secret heart carrying its coded message of setting all of us free.\"[47]Other critics gave the film a mixed review. Sonia Chopra of Sify gave the film 3 stars and said \"Though a bit too calculated and designed, 3 Idiots is still an ok option for the significant message, interesting cast and scattered breezy moments.\"[48] Rajeev Masand of CNN-IBN gave the film three out of five stars and states: \"Going home after watching 3 Idiots I felt like I'd just been to my favorite restaurant only to be a tad under-whelmed by their signature dish. It was a satisfying meal, don't get me wrong, but not the best meal I'd been expecting.\"[49] Shubhra Gupta from The Indian Express also gave it 3 stars, stating \"‘3 Idiots' does not do as much for me. The emotional truth that shone through both the 'Munnabhai' movies doesn’t come through strongly enough.\"[50] Raja Sen of Rediff gave the film two out of five stars and states: \"Rajkumar Hirani's one of the directors of the decade, a man with immense talent and a knack for storytelling. On his debut, he hit a hundred. With his second, he hit a triple century. This time, he fishes outside the offstump, tries to play shots borrowed from other batters, and hits and misses to provide a patchy, 32*-type innings. It's okay, boss, *chalta hai*. Even Sachin has an off day, and we still have great hope.\"[51]The film has also been highly acclaimed overseas. On Rotten Tomatoes, the film holds a 100% \"fresh\" critics' rating based on six reviews. Derek Elley of Variety wrote that \"3 Idiots takes a while to lay out its game plan but pays off emotionally in its second half.\" Robert Abele of Los Angeles Times wrote that there's an \"unavoidable joie de vivre (symbolized by Rancho's meditative mantra 'All is well') and a performance charm that make this one of the more naturally gregarious Bollywood imports.\" Louis Proyect described it as a \"fabulous achievement across the board. A typical Bollywood confection but also social commentary on a dysfunctional engineering school system that pressures huge numbers of students into suicide.\"[52] The Korean site Naver gave the film a review rating of 9.4 out of 10.[53]It was expected to be the first Indian film to be officially released on YouTube on 25 March 2010, only 12 weeks after its initial theatrical release. Officially, it was released on YouTube in May 2012, but its access has since been restricted.[54] The film also went on to win many awards, winning six Filmfare Awards including best film and best director, ten Star Screen Awards and sixteen IIFA awards.","Awards":"The film won 39 accolades; among these are five Filmfare Awards including best film and best director, ten Star Screen Awards, sixteen IIFA awards and three National Film Awards. In January 2014, it was nominated in the Best Outstanding Foreign Language Film category for 37th Japanese Academy Awards.[55][56][57][58]","Soundtrack":"The film's soundtrack is composed by Shantanu Moitra with lyrics penned by Swanand Kirkire.","Box office":"After its initial run, the film's adjusted worldwide lifetime gross was ₹339 crore (equivalent to ₹597 crore or US$89 million in 2016).[18]According to Box Office, 3 Idiots grossed ₹11.92 billion (equivalent to ₹21 billion or US$310 million in 2016) worldwide at the end of its theatrical run.[19][20] The film was listed in Guinness World Records for the record of highest box office film gross for a Bollywood film.[21][22]The film broke all box office records upon release. It created the highest collection record for paid previews with Rs 27.5 million that time, which was broken by Chennai Express (2013).[23][24] In its four-day first weekend, the film netted ₹38 crore (equivalent to ₹67 crore or US$9.9 million in 2016), and broke the record held by Ghajini for the first weekend collections.[25] By the first week, the film netted ₹79 crore (equivalent to ₹139 crore or US$21 million in 2016), again breaking the box office record held by Ghajini.[26] 3 Idiots had nett grossed ₹56 crore (equivalent to ₹99 crore or US$15 million in 2016) in its 2nd week, ₹302.5 million (US$4.5 million) during the third week, ₹16 crore (equivalent to ₹28 crore or US$4.2 million in 2016) in its fourth week and ₹9.75 crore (equivalent to ₹17 crore or US$2.6 million in 2016) in fifth to make a total of ₹202 crore (equivalent to ₹356 crore or US$53 million in 2016) in five weeks,[27] first Indian film ever to collect this huge amount, hence established the ₹200 crore (US$30 million) Club.[28]3 Idiots became the then highest-grossing Bollywood film in overseas markets and now[when?] it ranks 4th with overseas gross of US$25 million.[4][29][30] 3 Idiots first weekend opening collection in overseas was $4 million.[31][32] It set record collections for Indian-produced films in territories such as United States,[33] Australia,[34] Fiji, and some African territories.[citation needed] In the United States, the film earned $6.5 million since its opening,[33][34] in addition to over $2.5 million in the United Kingdom, over $2 million in Canada, nearly $1 million in Australia, and over $3 million in South Korea.[34] 3 Idiots has the biggest first week total in US with around $3 million over its first four days.[35]Unusual for an Indian film, 3 Idiots has become a major success in East Asian markets.[36] The film had the longest showing period at cinemas in Taiwan, for more than two months from December 2010, breaking the record of Avatar, with over TWD $10 million grossed. The film was the first aired Indian film in Hong Kong, where it grossed HKD $22 million since its showing from 1 September 2011, as of January 2012,[37] and the equivalent of over US$3 million as of 4 March 2012.[34] In China, where it is known as San Geshagua (\"Three Idiots\"),[36] the film grossed $1.15 million in four days in December 2011,[38] eventually crossing the $2 million mark within 18 days,[4] and nearly $3 million within a month, as of 5 January 2012.[39] Alongside the original Hindi version, a Chinese-dubbed version was also released, with the popular actress Tang Wei (best known for Lust, Caution) voicing Kareena Kapoor's role.[40] One reason for its success in East Asian markets such as China and Hong Kong is because of their similar education systems, thus many students were able to identify with the characters,[36] with some Chinese universities \"even prescribing the film in their coursework as a kind of stress-relief in their classrooms.\"[40] 3 Idiots added US$7 million from a wide release in far eastern markets like South Korea, China, Hong Kong etc.[41] Following its success in other Asian markets, Japanese distributor Nikkatsu has announced plans to release the film in Japan.[42] Upon its release in Japanese markets in June 2013, it went on to collect around ¥100 million (61 million) in its first two weeks of run – That makes the film the highest grossing Hindi film ever in Japan.","produced_by":"Vidhu Vinod Chopra","starring":"Aamir Khan Madhavan Sharman Joshi Kareena Kapoor Khan Boman Irani Omi Vaidya","music_by":"Shantanu Moitra","edited_by":"Rajkumar Hirani","written_by":"Abhijat Joshi Rajkumar Hirani"}