{"alligator":"theatrical release poster","country":"United States","distributed_by":"Group 1 Films[1]","screenplay_by":"John Sayles","story_by":"John Sayles Frank Ray Perilli","Plot":"A teenage girl purchases a baby American alligator while on vacation with her family at a tourist trap in Florida. After the family returns home to Chicago, the alligator, named Ramón by the girl, is promptly flushed down the family's toilet by her surly, animal-phobic father and ends up in the city's sewers.Twelve years later, the alligator survives by feeding on covertly discarded pet carcasses. These animals had been used as test subjects for an experimental growth formula intended to increase agricultural livestock meat production. However the project was abandoned due to the formula's side effect of massively increasing the animal's metabolism, which caused it to have an insatiable appetite. During the years, the baby alligator accumulated concentrated amounts of this formula from feeding on these carcasses, causing it to mutate, growing into a 36 foot (11 m) alligator, as well as having an almost impenetrable hide.The alligator begins ambushing and devouring sewer workers it encounters in the sewer, and the resulting flow of body parts draws in world-weary police officer David Madison (Robert Forster) who, after a horribly botched case in St. Louis, has gained a reputation for being lethally unlucky for his assigned partners. As David works on this new case, his boss Chief Clark (Michael Gazzo) brings him into contact with reptile expert Marisa Kendall (Robin Riker), the girl who bought the alligator years earlier. The two of them edge into a prickly romantic relationship, and during a visit to Marisa's house, David bonds with her motormouthed mother.David's reputation as a partner-killer is confirmed when the gator snags a young cop, Kelly (Perry Lang), who accompanies David into the sewer searching for clues. No one believes David's story, due to a lack of a body, and partly because of Slade (Dean Jagger), the influential local tycoon who sponsored the illegal growth experiments and therefore doesn't want the truth to come out. This changes when obnoxious tabloid reporter Thomas Kemp (Bart Braverman) (ironically, one of the banes of David's existence) goes snooping in the sewers and supplies graphic and indisputable photographic evidence of the beast at the cost of his own life. The story quickly garners public attention, and a city-wide hunt for the monster is called for. An attempt by the police to flush out Ramón comes up empty and David is put on suspension, suddenly having the alligator escaping from the sewers and comes to the surface, by first killing another police officer and later a young boy, who is tossed in the boy's swimming pool as the alligator is residing in it during a party.The ensuing hunt continues, including the hiring of pompous big-game hunter Colonel Brock (Henry Silva) to track the animal. Once again, the effort fails: Brock is killed, the police trip over each other in confusion and Ramón goes on a rampage through a high-society wedding party; among his victims are Slade and the mayor. With only Marisa to help him, David finally lures the alligator into the sewers, before setting off explosives on the alligator, killing Ramón. As the film ends with David and Marisa walking away after the explosion, a drain in the sewer spits out another baby alligator, having a repeating cycle all over again.","language":"English","Reception":"The film has received mixed to positive reviews both during and since its release. Vincent Canby of The New York Times reviewed the film in a positive light, writing that its \"suspense is frequently as genuine as its wit and its fond awareness of the clichés [it uses]\".[6] Jim Knipfel of the website Den of Geek awarded the film 4.5 out of 5 stars, calling it \"intelligent and stylish\".[7] Kim Newman of Empire praised its \"witty\" script, \"solid performances, effective effects\", and \"spirited B-level direction\".[8] Roger Ebert, however, gave the film one out of four stars, suggesting that it would be best to \"flush this movie down the toilet to see if it also grows into something big and fearsome.\"[9]Alligator, along with films such as Grizzly (1976), Orca (1977), and Piranha (1978), is considered by some to be a \"rip-off\" film made to capitalise on the success of the 1975 film Jaws, whose main antagonist is a man-eating great white shark. John Sayles, who wrote the script for Alligator, also created the screenplay for Piranha two years earlier.[7]","box_office":"$6,459,000","cinematography":"Joseph Mangine","production_company":"Group 1 Films[1]","directed_by":"Lewis Teague","release_dates":"November 14, 1980 (1980-11-14) (LA)|June 5, 1981 (1981-06-05) (NYC)|[1] ([1])|||","Production":"Location shooting took place in and around Los Angeles. Although commentary on the Lions Gate Entertainment DVD gives the location as Chicago, the police vehicles in the film appear to have Missouri license plates. When the young Marisa returns home with her family from their vacation in Florida, they pass a sign that reads \"Welcome to Missouri.\" Later, the voice of a newscaster identifies Marisa as \"a native of our city,\" implying the location is a city in Missouri other than St. Louis.[5]","Home media releases":"On September 18, 2007, Lions Gate Entertainment released the film on DVD for the first time in the United States. The disc features a new 16x9 anamorphic widescreen transfer in the original 1.78:1 ratio and a new Dolby Digital 5.1-channel sound mix in addition to the original mono mix. The included extras are a commentary track with director Lewis Teague and star Robert Forster, a featurette titled Alligator Author in which screenwriter John Sayles discusses the differences between his original story and the final screenplay, and the original theatrical trailer.The film had previously been available on DVD in other territories, including a version released in the UK in February 2003 by Anchor Bay Entertainment. This release features an optional DTS sound mix, includes the 1991 sequel Alligator II: The Mutation on a second disc, and includes the same Teague-Forster commentary found on the recent Lions Gate US release.","produced_by":"Brandon Chase","starring":"Robert Forster Robin Riker Michael Gazzo[1]","running_time":"94 minutes[1]","music_by":"Craig Hundley","edited_by":"Larry Brock Ron Medico","budget":"$1,750,000 (estimated)"}