{"country":"United States","distributed_by":"DreamWorks Pictures|Paramount Pictures|","screenplay_by":"John Glenn|Travis Adam Wright|Hillary Seitz|Dan McDermott|","story_by":"Dan McDermott","Plot":"Jerry Shaw (Shia LaBeouf) is a Stanford University dropout who learns his identical twin brother Ethan, a first lieutenant in the US Air Force, has been killed. Following the funeral, Jerry is surprised to find $751,000 in his bank account. Later he finds his Chicago apartment filled with weapons, ammonium nitrate, classified DOD documents, and forged passports. He receives a phone call from a woman (Julianne Moore) who warns that the FBI is about to arrest him and he needs to run.Disbelieving, Jerry is caught by the FBI and interrogated by Supervising Agent Tom Morgan (Billy Bob Thornton). While Morgan confers with Air Force OSI Special Agent Zoe Pérez (Rosario Dawson), the woman on the phone arranges for Jerry's escape and directs him to Rachel Holloman (Michelle Monaghan), a single mother. The woman on the phone is coercing Rachel by threatening her son Sam (Cameron Boyce), who is en route on the Capitol Limited to the Kennedy Center in Washington, D.C. with his school band. The woman on the phone helps the two avoid the Chicago police and FBI, using an ability to control networked devices, including traffic lights, mobile phones, automated cranes, and even power lines.Meanwhile, the woman on the phone redirects a crystal of powerful DOD explosive—hexamethylene—to a gemcutter, who cuts it and fixes it into a necklace. Another man (Anthony Azizi) steals Sam's trumpet in Chicago and fits the crystal's sonic trigger into the tubing, before forwarding it to Sam in Washington, D.C.Agent Perez is summoned by Secretary of Defense George Callister (Michael Chiklis) to be read into Ethan's job at the Pentagon. Ethan monitored the DOD's top secret intelligence-gathering supercomputer, the Autonomous Reconnaissance Intelligence Integration Analyst (ARIIA). Callister leaves Perez with Major William Bowman (Anthony Mackie) and ARIIA to investigate Ethan Shaw's death. Simultaneously, Rachel and Jerry learn that the woman on the phone is actually ARIIA, and that she has \"activated\" them according to the Constitution's authorization to recruit civilians for the national defense.Perez and Bowman find evidence which Ethan Shaw had hidden in ARIIA's chamber the night he died, and leave to brief Callister. Afterwards, ARIIA smuggles Jerry and Rachel into her observation theater under the Pentagon. Both groups learn that after ARIIA's recommendation was ignored and a botched operation in Balochistan resulted in the deaths of American citizens, ARIIA concluded that \"to prevent more bloodshed, the executive branch must be removed.\" Acting on behalf of \"We the People\", and citing the Declaration of Independence (\"whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it\"), ARIIA is acting in compliance with Section 216 of the Patriot Act which \"allows us to circumvent probable cause in the face of a national security threat, in this case, the chain of command itself.\"Belatedly, Jerry learns he has been brought to circumvent biometric locks placed by his twin that prevent ARIIA from bringing into effect Operation Guillotine, a military simulation of maintaining government after the loss of all presidential successors. Because Secretary Callister agreed with ARIIA's abort recommendation regarding Balochistan, he is to be the designated survivor and new president after the hexamethylene detonates at the State of the Union (SOTU).One of ARIIA's agents (Nick Searcy) extracts Rachel from the Pentagon and gives her a dress and the explosive necklace to wear to the SOTU. Sam's school band has also been redirected to the United States Capitol to play for the president, bringing the trigger in Sam's trumpet and the explosive together. Jerry is recaptured by Agent Morgan, who has become convinced of Jerry's innocence. Elsewhere, Morgan sacrifices himself to stop an armed MQ-9 Reaper sent by ARIIA, but first gives Jerry his weapon and ID with which to gain entrance to the Capitol. Arriving in the House Chamber, Jerry fires the handgun in the air to disrupt the concert before being shot and wounded by the Secret Service.Sometime later, Callister reports that ARIIA has been decommissioned and recommends against building another; the Shaw twins and Agents Perez and Morgan receive awards for their actions. Jerry attends Sam's birthday party, earning Rachel's gratitude and a kiss.","Science":"When there is conversation near a filled coffee cup, the vibration of the voices will change the reflection in the liquid surface ever so slightly. ARIIA picks up the sound from a room with this method using a surveillance camera. Scientists have in 2014 done something similar using a normal digital camera.[26]","language":"English","Reception":"Eagle Eye received negative reviews from critics, primarily for its implausible storyline. Review aggregation website Rotten Tomatoes gave the film a rating of 26% based on reviews from 179 critics, with the site's consensus stating that the film is \"a preposterously-plotted thriller that borrows heavily from other superior films.\"[10] Metacritic gave the film an average score of 43 out of 100, based on 28 reviews—indicating mixed or average reviews.[11]Roger Ebert of the Chicago Sun-Times gave Eagle Eye a score of two stars out of four, saying: \"The word 'preposterous' is too moderate to describe Eagle Eye. This film contains not a single plausible moment after the opening sequence, and that's borderline. It's not an assault on intelligence. It's an assault on consciousness.\"[12] James Berardinelli of ReelViews gave the film one and a half stars out of four, saying: \"This movie tests the viewing public's tolerance for enduring crass stupidity when the payoff is a series of repetitive, ADD-infected chase scenes. Director D.J. Caruso does a moderately good job of hiding how incredibly dumb this screenplay is by keeping things moving at such a whirlwind pace that a lot more seems to be happening than actually is. In reality, the chase scenes don't mean anything because they don't advance the plot—it's mice on a treadmill, running and running and not getting anywhere.\"[13] The Hollywood Reporter called it a \"slick, silly techno-thriller\" and \"Even those who surrender all disbelief at the door will be hard pressed not to smirk at some of wildly improbable plotting.\"[14]Josh Rosenblatt of The Austin Chronicle enjoyed the film, calling it \"good, manic fun plus a heavy dose of political intrigue adding up to two hours of clamorous, mind-numbing nonsense.\" Calling it \"The Transporter 2 on crack.\"[15] William Arnold of the Seattle Post-Intelligencer also gave Eagle Eye a positive review, remarking that it's \"engrossing as an intellectual puzzle\" and \"a solid thriller.\"[16] Mark Bell of Film Threat said: \"the film isn't a complete waste of your time [...] but don't expect anything brilliant.\"[17] Neely Tucker of The Washington Post said that Eagle Eye is \"sometimes entertaining\" but \"doesn't have much to say.\"[18] Robert Koehler of Variety felt that the film's \"first 35 minutes sizzle\" but \"the story [becomes] near-parody in the final act.\"[19]Eagle Eye was a nominee for a 2009 Saturn Award for \"Best Science Fiction Film\".[20]In its opening weekend, Eagle Eye grossed $29.1 million in 3,510 theaters in the United States and Canada, reaching the first-place position at the box office.[21] As of February 15, 2009, it has grossed $178 million worldwide—$101.4 million in the United States and Canada and $76.6 million in other territories. The budget of the film was $80 million.[1]Eagle Eye was released on DVD and Blu-ray only in select stores on December 26, 2008, exactly three months after its theatrical release, September 26, 2008. In the first week on the DVD sales chart, Eagle Eye sold 182,592 units which translated to $3.3m in revenue.[22] In the second week, however, sales rose tremendously to 1,044,682 for that week, opening at #1 and acquiring revenue of $18,862,151 for that week. As per the latest figures[when?], 2,181,959 units have been sold, bringing in $38,008,436 in revenue. This does not include Blu-ray sales/DVD rentals.[22]The next day, it was released nationwide. iTunes released it a month later as a rental and buy.[23]","Promotion":"The official website features an ARG type of gameplay system to promote the film. The voice previewed behind the phone in multiple trailers contacts the player, placing them in unique experiences. This has been called the \"Eagle Eye Freefall Experience\". While official cast listings do not list the name of the actress behind the mysterious voice featured in the film and trailers, Rosario Dawson confirmed at the Hollywood premiere that it belongs to Julianne Moore.[9]","eagle_eye":"Theatrical release poster","box_office":"$178.9 million[1]","Mobile game":"A mobile game based on the film was developed and published by Magmic Games. It was released for BlackBerry, Windows Mobile, BREW, and Java ME devices prior to the film's launch in early September. There are also two games on the film's web site.[24][25]","cinematography":"Dariusz Wolski","production_company":"K/O Paper Products Goldrest Pictures","directed_by":"D. J. Caruso","Music":"The music to Eagle Eye was written by composer Brian Tyler, who recorded the score with an 88-piece ensemble of the Hollywood Studio Symphony at the Sony Scoring Stage. The session was interrupted by the Chino Hills earthquake on July 29, 2008—and a recording of the quake hitting the scoring stage is online.[8]","release_dates":"September 26, 2008 (2008-09-26)|||||","Production":"Screenwriter Dan McDermott wrote the original script for Eagle Eye based on an idea by Steven Spielberg who had been inspired by Isaac Asimov's short story \"All the Troubles of the World.\"[2] The studio DreamWorks then bought McDermott's script and set up the project to potentially be directed by Spielberg. When the director became busy with Indiana Jones and the Kingdom of the Crystal Skull, he dropped out of the project. Director D. J. Caruso, who directed the 1996 TV series High Incident under Spielberg's executive production, replaced the director in helming Eagle Eye, with Spielberg remaining as executive producer. In June 2007, actor LaBeouf who was involved in Spielberg's and Caruso's 2007 film Disturbia and Indiana Jones and the Kingdom of the Crystal Skull, re-joined the director and executive producer to star as the lead in Eagle Eye. McDermott's script was rewritten by screenwriters John Glenn, Travis Wright, and Hillary Seitz in preparation for production.[3] Filming began on November 6, 2007[4] and wrapped in February 2008.[5] The film's visual effects were created by Sony Pictures Imageworks.[6]Caruso said by the time the film came to fruition twelve years later, \"the technology had finally caught up to the storytelling... Everybody has a BlackBerry on their belt, and we think we're constantly being tracked. It's less science fiction than when Steven Spielberg conceived it.\"[7] Caruso wanted to bring a gritty, 1970s-era sensibility to the film. Accordingly, a key chase scene in a high-tech package-processing hub on conveyor belts was shot without the use of computer-generated imagery. \"It was like Chutes and Ladders for adults. It was pretty dangerous, and a lot of fun.\"[7] While filming the scene, Monaghan suffered a welt after a cable brushed her neck and Caruso hit his head on a protruding bolt, requiring stitches.[7]","produced_by":"Steven Spielberg (executive)|Alex Kurtzman|Roberto Orci|Pat Crowley|","starring":"Shia LaBeouf|Michelle Monaghan|Rosario Dawson|Michael Chiklis|Anthony Mackie|Billy Bob Thornton|","running_time":"118 minutes","music_by":"Brian Tyler","edited_by":"Jim Page","budget":"$80 million[1]"}