{"distributed_by":"Universal Pictures","dante's_peak":"Film poster for Dante's Peak","Plot":"Dr. Harry Dalton (Pierce Brosnan), a volcanologist of the United States Geological Survey, and his partner Marianne (Walker Brandt), are studying volcanic activity in Colombia when the volcano erupts. Marianne is killed by a volcanic bomb, leaving Harry remorseful about her death, believing it could have been prevented by evacuating sooner.Four years later, Harry is assigned by his boss Dr. Paul Dreyfus (Charles Hallahan) to investigate seismic activity at Dante's Peak, Washington, a small town situated near a dormant stratovolcano in the Cascades. Harry arrives as the town is celebrating its founding, and meets the town's mayor, Rachel Wando (Linda Hamilton), and her two children Graham (Jeremy Foley) and Lauren (Jamie Renée Smith). Rachel offers to take Harry up the mountain to take readings while also visiting her former mother in-law Ruth (Elizabeth Hoffman). While near a hot springs, Harry stops the children when he sees dead wildlife near it, and they discover two dead bathers in the springs, boiled alive. Believing the excessive heat is a result of volcanic activity, Harry asks Paul to bring a team to study the mountain further. The team arrives with additional equipment, but they do not corroborate Harry's fears and suggest there is little concern. Regardless, Harry tries to convince Rachel to prepare the town for something drastic, while falling into a budding relationship with her.A week passes without any signs of volcanic activity and Paul orders the team to pack up. While having a final dinner with Rachel, Harry discovers her water to be contaminated with volcanic residue, and shortly discovers the town's water supply similarly contaminated. Paul and Harry agree this is a sign of a pending eruption, and they begin to evacuate the town. The volcano erupts during their preparation, sending the townspeople into a panic. As Paul and the rest of the team contact the National Guard for help and try to maintain an orderly evacuation, Harry goes to help Rachel get her children, finding they have left to get Ruth.Harry and Rachel reach Ruth's cabin just as the lava flow reaches it, and they are forced to abandon their vehicles and cross a nearby lake via a motorboat. Too late, they realize the lake's waters have become acidic and is eating away at the boat. Ruth willingly gets out of the boat to push it to the dock, leaving her with severe chemical burns from which she later dies.Meanwhile Paul and the National Guard manage to evacuate the town and start leaving but the glaciers on the volcano have melted and flows into the river picking up trees and boulders now becoming a Lahar. The lahar soon hits the nearby dam where the weight of the mud and water is too much and the dam collapses. Soon the lahar reaches the town. The team manages to get across the bridge but Paul is washed away in the flood.Harry and the family find a nearby ranger station and take a pickup truck to drive down the mountain. They come across a lava field and attempt to drive across it but they get stuck halfway. Harry tries to back up but the tires are melting and, to their horror, fresh lava is starting to flow down the hill. They finally get free and rescue Ruth's dog Ruffy as fresh lava flows across the road.Harry, Rachel, and the children make it safely back to the abandoned town, but all the routes out of the town are gone. Harry goes to the motel and checks the team's abandoned equipment and discovers that the volcano is due for a final, catastrophic eruption that will destroy the town and that they will not be able to outrun it. Graham knows of a mine tunnel in the town, which Harry believes will protect them from the eruption, and grabs a NASA satellite beacon before driving to the mine. A few seconds later the volcano violently and laterally explodes. The giant ash cloud bursts from the mountain like a nuclear blast. The mass of the cloud is so great it condenses into a pyroclastic flow. The cloud speeds down the mountain destroying everything in its path, blowing down trees, houses, and the town itself. The cloud bears down on the town obliterating everything in its path. The family manages to drive into the mine. At a safe distance Harry's team watches in horror as the giant ash cloud rises high into the atmosphere and fear Harry was killed. Meanwhile in the mine Harry ensures the others are safe and goes to recover the beacon but while he does so, the mine collapses breaking his arm after he manages to get to the truck. He becomes trapped in the cab of the truck when the tunnel collapses even more. He manages to activate the beacon before passing out.Days later, after the eruption, Harry's team notices the activated distress beacon indicating he may have survived. Rescue crews free Harry, Rachel, and the children. They are flown out by helicopter and, looking back at the remains of the town and Dante's Peak, the mountain now has a menacing horseshoe-like caldera and bares an eerie resemblance to Mount St. Helens. Still, the mountain has finally resumed its slumber. But the music builds up hinting it may erupt again in the near future.","language":"English","Reception":"The film debuted at #2 behind the special edition re-release of Star Wars with $18 million in its opening weekend.[5] It went on to earn $178 million worldwide.[1]Despite having wider financial success and being slightly more scientifically accurate than Volcano, Dante's Peak opened to more unfavorable reviews than its rival: Rotten Tomatoes gave the film a 27% rating based on 26 reviews,[6] compared to a 44% rating from 39 reviews, for Volcano.[7]","box_office":"$178.1 million[1]","cinematography":"Andrzej Bartkowiak","production_company":"Pacific Western Productions","directed_by":"Roger Donaldson","Music":"The original score was co-composed by John Frizzell and James Newton Howard. Howard wrote the main theme (heard during the opening titles) and a number of cues, while Frizzell wrote the bulk of the score.30 minutes of the score was released by Varese Sarabande; the short album length being due to high orchestra fees at the time of release. An expanded bootleg exists which contains almost the entire score.The contents of the CD release can also be found on the region 1 DVD, and Blu-ray on an alternate audio track during the 'Creating a Volcano' documentary.The \"Main Titles\" cue is also featured on Varese's \"The Towering Inferno and Other Disaster Classics\" compilation album.","release_dates":"February 7, 1997 (1997-02-07)|||||","Production":"The film was shot on location in Wallace, Idaho, with a large hill just southeast of the town digitally altered to look like a volcano. Many scenes involving townspeople, including the initial award ceremony, the pioneer days festival, and the gymnasium scene were shot using the actual citizens of Wallace as extras. Many of the disaster evacuation scenes that did not involve stunts and other dangerous moments also featured citizens of Wallace; dangerous stunts were filmed using Hollywood extras. Mount St. Helens also makes an appearance at the very end of the movie; during the start of the closing credit crawl, the scene shows an image of a destroyed Dante's Peak community with the camera shot moving out to show a wider scene of disaster, and then showing what remains of the volcano itself. The volcano that remains is actually an image of Mount St. Helens taken from news footage just after the May 18, 1980, eruption.[citation needed]Exteriors shots of the Point Dume Post Office, 29160 Heathercliff Rd, Malibu, CA were used as the USGS's David A. Johnston Cascades Volcano Observatory headquarters in Vancouver, Washington. The facility was named in honor of David A. Johnston, a young scientist who had precisely predicted the volatility of the May 18, 1980, Mount St. Helens eruption and perished during the event.[2]A brief scene was actually shot inside the crater of Washington State's Mount St. Helens. It is the scene where a scientist gets caught in a rock slide and breaks his leg while climbing down inside the crater to repair a malfunctioning piece of scientific equipment. The giveaway of this shot is a brief appearance by Mount Adams, a dormant 12,776-foot (3,894 m)-high peak 35 miles (56 km) east of Mount St. Helens, above the crater rim as the view focuses on the scientists. The scene was actually filmed on the tarmac of Van Nuys Airport while the Mount Adams image was green screened.Extensive special effects surrounding certain aspects of the film such as the lava and pyroclastic flows, were created by Digital Domain, Banned from the Ranch Entertainment and CIS Hollywood.[3] The computer-generated imagery was mostly coordinated and supervised by Patrick McClung, Roy Arbogast, Lori J. Nelson, Richard Stutsman and Dean Miller.[3] Although the film uses considerable amounts of CGI, the volcanic ash in the film was created using cellulose insulation manufactured by Regal Industries in Crothersville, Indiana. Between visuals, miniatures, and animation, over 300 technicians were directly involved in the production aspects of the special effects.[3] Despite the complexity of its visual effects, Dante's Peak was not nominated for an Academy Award for Best Visual Effects that year, as it faced stiff competition from Titanic, The Lost World: Jurassic Park and Starship Troopers.","produced_by":"Gale Anne Hurd Joseph Singer","starring":"Pierce Brosnan|Linda Hamilton|Charles Hallahan|Elizabeth Hoffman|Jamie Renée Smith|Jeremy Foley|Grant Heslov|Kirk Trutner|Jack Mehoff|","running_time":"109 minutes","music_by":"James Newton Howard John Frizzell","edited_by":"Conrad Buff IV|Tina Hirsch|Howard E. Smith|","written_by":"Leslie Bohem","budget":"$116 million[1]"}