{"beautiful_creatures":"Theatrical release poster","based_on":"Beautiful Creatures  by Kami Garcia Margaret Stohl","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Richard LaGravenese","Plot":"In Gatlin, South Carolina, Ethan Wate awakens from a recurring dream of a girl he does not know. In voice-over narration, he describes his enjoyment of reading banned books, his despair of his small-town existence, and his dreams of leaving for college. Arriving for his first day of junior year, Ethan notices newcomer Lena Duchannes, who resembles the girl he has been dreaming about. The other students do not take kindly to her and spread gossip regarding Lena's reclusive uncle, Macon Ravenwood, and suggest that her family includes devil worshippers. Overhearing these whispers, Lena tenses, and the classroom windows shatter, amplifying the fears and suspicions of the class and the townspeople at large that she is a witch.On a drive home, Ethan nearly runs over Lena, whose car has broken down. He gives her a ride home, and the two bond over their shared love of poetry and having both lost their mothers. Ethan drops Lena off but later finds a locket and returns to the mansion to give it to her as a present. Touching the locket triggers a shared flashback to the American Civil War, after which Ethan awakens at his home. Macon disapproves of their love and fondness of each other, and conspires with Ethan's family friend, Amma, to keep the two separated. However, Ethan continues to pursue Lena until she confesses that she and her family are \"casters\" capable of performing magical spells that change the weather or create illusions. On her sixteenth birthday, Lena's true nature will steer her towards either the light or the dark; Lena fears the latter, as it entails being consumed by evil and hurting those she loves. Ethan and her family insists she is responsible for her own choices and reassures her that she is a good person.Matters are complicated by the arrival of two immensely powerful dark casters who aim to push Lena to the dark: Ridley, Lena's provocative cousin/childhood friend, and Sarafine, Lena's mother, who has possessed Mrs. Lincoln, the mother of Ethan's friend Link. Sarafine foresees that Lena will become an even more powerful caster and intends for Lena to use her newfound power to purge the Earth of humans, leaving casters to rule in their wake. Lena and Ethan use the locket to re-experience the whole flashback, which reveals their ancestors, caster Genevieve Duchannes and mortal Confederate soldier Ethan Carter Wate were in love. Ethan Carter was shot in battle, and Genevieve revived him using a forbidden spell that caused her to go dark and curse all the Duchannes family's women. They consult with Amma, who is in a seer/keeper of a caster library beneath the town library. The most ancient of these books, the Book of Moons, reveals the secret to undoing the curse: someone Lena loves has to die. Unwilling to take Ethan's life, Lena has a final moment together with Ethan in which Lena makes it snow and then erases all his memories of their time together.Ridley seduces Link and gives him a bullet to use in an upcoming Civil War reenactment of the Battle of Honey Hill which will take place on Lena's birthday. During the reenactment, Link and Ethan agree to \"kill\" each other so they can ditch the reenactment. While at the ceremony for her 16th birthday, Lena feels the shock of the curse being broken and runs off to Ethan, clutching his dying body as Ridley and Sarafine encourage her to surrender to grief and accept the dark. Lena lashes out in anger, sending lightning strikes through the crowd of reenactors until Ethan transforms into Macon, who had previously disguised himself as Ethan to become the needed sacrifice. His dying words encourage Lena to \"claim yourself\"; she then causes the moon to disappear, so it cannot claim her for the dark. Lena allows Ridley to flee and pulls Sarafine from Mrs. Lincoln's body, using her power to seal Sarafine's spirit away.Six months later, a still-amnesiac Ethan stops by the library to visit Amma before leaving for an NYU college tour with Link. He apologizes to Lena for not having gotten to know her during their time in Gatlin. When he inquires if a \"banned book\" by Charles Bukowski (which she had shared with him when they first met) is any good and Lena asks him to define good (the same reply she gave the first time he asked), Lena then presents it to him as a \"getting out of Gatlin present\". As Link drives away, Ethan reads a passage in the book that he had earlier associated with Lena, while Lena is revealed in the caster library to be a half light/dark caster, as one of her eyes turns a different color, just like those of her cousin. As they drive past the town line, Ethan glimpses the town's burned welcome sign and remembers everything. The car skids to a halt, Ethan gets out of the car and yells Lena's name. She hears him call, and is freed of her dark side before the screen fades to black.","language":"English","Reception":"The film grossed $10,124,912 during its opening weekend (including its Thursday release date), under-performing based on media expectations.[24][25][26]While the film was considered to be a flop domestically, only grossing $19,452,138 by the end of its North American domestic theatrical run (against a $60 million production budget[2][5]) it did better internationally, where it has grossed $40,600,000. As of April 21, 2013, the film has grossed a worldwide total of $60,052,138,[2] barely recouping its production budget, making it a loss.[5] Variety magazine listed Beautiful Creatures as one of \"Hollywood's biggest box office bombs of 2013\".[6]The film has received mixed reviews from critics; it has a 46% rating on review aggregation website Rotten Tomatoes, based on 169 reviews, with the site's consensus stating: \"Charming romantic leads and esteemed supporting cast aside, Beautiful Creatures is a plodding YA novel adaptation that feels watered down for the Twilight set\".[27] On Metacritic, the film received a score of 52% based on 40 reviews, indicating mixed or average reviews.[4]Owen Gleiberman, in Entertainment Weekly, gave the film a \"B-\", writing, \"Beautiful Creatures is arriving in a market-place full of Twilight junkies still eager for their supernatural teen-romantic fix, and the film's concept couldn't be clearer: It's Twilight with the sexes reversed. This time it's the boy who's the mortal: moody, bookish Ethan, the outsider in his sleepy small town.\" Gleiberman added that though the film \"is lushly pictorial and not-too-badly acted...[but] the audience, like Ethan, spends way too much time waiting around for Lena to learn whether she's a good girl or a bad girl.\"[28]The film review website ScreenRant called the film \"a choppy and melodramatic experience with very little payoff beyond the central love story. Worse yet, overlooking the usual on-the-nose dialogue about eternal love and sacrifice, this tale of star-crossed sweethearts is especially cheesy and unconvincing – even when compared to similarly heavy-handed young adult novel-turned-movies. Fans of the supernatural romance subgenre will get about what they expect...\"[29]David Denby of The New Yorker wrote that the movie \"is a classic example of the confusions and the outright blunders that can overtake talented people who commit themselves to a concept driven purely by the movie marketplace... Alas, the satirical energy and Ethan's bright talk dissipate after a while.\" He praises a scene from the Civil War flashback which \"appears as Ethan and Lena are watching a movie in a local theatre, but only they can see it\" as \"an interesting idea that I wish LaGravenese had pursued as a parallel narrative. This kind of movie, however, demands not interesting ideas but whooshing spectacle and madly redundant climaxes and a soundtrack filled with thuds and a shouting female chorus.\"[30]Scott Mendelson of Forbes magazine called the film \"shockingly good\" and encouraged viewers who missed it to check it out on video.[31]Cinemascore audience polls gave the film a B grade.[32]","box_office":"$60,052,138[2]","cinematography":"Philippe Rousselot","production_company":"Alcon Entertainment","directed_by":"Richard LaGravenese","release_dates":"February 14, 2013 (2013-02-14)|||||","Production":"Alcon Entertainment purchased the rights to Beautiful Creatures in 2009, with director Richard LaGravenese signing on soon after to write and direct the movie.[8] Casting for the film began in late 2011,[9] and in February 2012, Viola Davis was cast as Amma.[10] Soon after, Jack O'Connell and Alice Englert were announced to be playing the lead characters of Ethan Wate and Lena Duchannes.[11] O'Connell later dropped out of the film due to a scheduling conflict, with Alden Ehrenreich assuming the role of Ethan.[12] Further casting included Emma Thompson as Sarafine and Mrs. Lincoln and Jeremy Irons as Lena's uncle Macon Ravenwood.[13] Of the character of Lena, Englert stated that \"Lena is like most girls when you feel massively insecure\".[3]Principal photography was originally scheduled to begin April 23, 2012, in New Orleans,[14] and took place, said LaGravenese, beginning \"I think, April 16th, and then we shot until June 26th, and then post[-production] was for me from July 5th to December 17th.\"[15] LaGravenese chose to incorporate practical special effects along with computer-based ones for certain scenes, as Emmy Rossum described: \"[W]hen we walked on to the stage and realized the chandelier does actually move, the chairs did actually spin, the table did actually spin... it was all very exciting.\"[16] On September 19, 2012, the first trailer for Beautiful Creatures was released.[17]Camille Balsamo played Genevieve Katherine Duchannes[18] in a sequence cut from the film; LaGravenese said:There was one part that I shot on green screen where I had all these actresses playing all the different Duchannes women from different periods [from the Civil War on]. And my costume designer, Jeffrey Kurland, had gowns and things, one was from the turn of the century, one was from the ’20s, one was from the ’40s, one was from the '60s, and they were going to appear in the first flashback and at the end of the movie, and then I cut them. ... It was just an idea that didn't work.[15]","Distribution":"Beautiful Creatures' release date was originally scheduled to be on February 13, 2013,[3][16] but distributor Warner Bros. later pushed the date to Thursday, February 14, 2013. The film was still released in Sweden on the 13th, a day before the film's North American release date.[19] The film held its official US premiere on February 11, 2013, in New York City.[20]Beautiful Creatures was released on DVD and Blu-ray Disc on May 21, 2013.[21][22] In its first month in release, the film sold around 428,792 copies in both DVD and Blu-ray formats combined, bringing in a consumer revenue of $7,377,859. As of June 16, 2013, the film has grossed an estimated $10,337,826 in DVD and Blu-ray sales.[23]","produced_by":"Andrew A. Kosove|Broderick Johnson|Erwin Stoff|David Valdes|","starring":"Alden Ehrenreich|Alice Englert|Jeremy Irons|Viola Davis|Emmy Rossum|Thomas Mann|Emma Thompson|Eileen Atkins|Margo Martindale|Zoey Deutch|Tiffany Boone|","running_time":"124 minutes[1]","music_by":"Thenewno2","edited_by":"David Moritz","budget":"$60 million[2]"}