{"based_on":"A Cat That Cannot Return by Inoue Areno","country":"South Korea","Plot":"The film opens with a 9-minute long take of a married couple riding in a car together. After several minutes of small talk, the woman (Im Soo-jung) tells the man (Hyun Bin) that she's leaving him for another man. The rest of the film takes place in the couple's home during a rainstorm on their last day together, as the husband helps his wife pack. Various quiet, introspective scenes show them doing things such as making coffee, smoking a cigarette, and reminiscing over nostalgic items. While eating together, the woman asks the man why he isn't angry with her, saying that he has a right to be. The man says that he knows she doesn't change her mind when she decides on something and feels that he is partially to blame for their rift. She then accuses the man of being selfish for acting as \"the perfect man\" during their breakup. Their conversation is interrupted by the meowing of a lost kitten outside. They bring it inside, but it escapes and hides elsewhere in the house. Soon, their neighbors come looking for the kitten and are invited inside. Strained conversation ensues, and the neighbors inform the couple that the rain has flooded the roads, preventing travel to Seoul. The husband answers a phone call from his wife's new lover and passes it to her. She tells him she'll have to put off leaving until the next day due to the flooding. He asks her, \"Is there anything holding you back?\" To which she doesn't answer. The neighbors leave without the kitten, telling the couple to call them when it comes out. Now unable to go to their planned dinner reservation, the couple prepares dinner together. The man begins sniffling while cutting onions, and goes to the bathroom to wash his eyes, silently standing while letting the faucet run. The film ends with the kitten coming out of hiding and the woman telling it that everything is going to be okay.","revised_romanization":"Saranghanda, saranghaji ahnneunda","language":"Korean","Reception":"The Hollywood Reporter gave a negative review of the film, summarizing it as \"a film so subdued and delicately wrought it will go unnoticed by most audiences.\"[6]","hangul":"사랑한다, 사랑하지 않는다","mccune–reischauer":"Saranghanda, saranghaji annŭnda","directed_by":"Lee Yoon-ki","come_rain,_come_shine":"Promotional poster for Come Rain, Come Shine","release_dates":"17 February 2011 (2011-02-17) (Berlinale)|||||","Production":"Director Lee Yoon-ki is known for his delicate portrayal of emotions. The three-hour confrontation between the couple on screen is told almost in real-time. He recommended the audience become immersed in the emotional exchange between wife and husband. \"I wanted to reveal a sense of loneliness between the two characters and the actors successfully portrayed the subtle sentiment,\" Lee said. \"The house itself is the third character in this movie, as memories are compiled within.\"[3] Lee said he is drawn to simple and plain narratives (\"the more I have things to say\") and is more interested in character-driven pieces. He based the film on the Japanese short story A Cat That Cannot Return by Inoue Areno.[4]The two actors joined Lee’s project without pay. Lim said, \"There are many producers and directors dedicated to the diversity of Korean movies, but many productions are in financial trouble. I was happy to support a movement to make better movies. It was a great opportunity to work on an experimental film with such a talented actor and wonderful director.\"[3][5]Hyun Bin said, \"Anyone can easily empathize with the experience of breaking up, which is heartbreaking but at the same time opens up the possibility for new beginnings and new kinds of joy.\"[5] Im added, \"There is no right answer in love.\"[3]","starring":"Hyun Bin Im Soo-jung","running_time":"105 minutes","written_by":"Lee Yoon-ki"}