{"country":"United States","distributed_by":"Universal Pictures","Plot":"A mysterious vehicle using a huge magnet steals a highly potent mutagen known as PX-41 from a secret laboratory in the Arctic Circle. The Anti-Villain League (AVL), headed by Silas Ramsbottom, tries to recruit former supervillain, Felonious Gru, to track down those responsible and recover the mutagen, but Gru refuses, claiming that he is now a legitimate businessman as well as the devoted father of Margo, Edith, and Agnes. Dr. Nefario, Gru's friend and assistant, tells Gru that he \"misses being evil\", and opts to leave him for new employment. Gru reluctantly agrees to investigate the theft of the mutagen, and is partnered with undercover AVL agent Lucy Wilde. The pair begin their search in the Paradise Shopping Mall, disguised as bakery employees. Gru immediately comes to suspect Mexican restaurant owner, Eduardo Pérez, of being the infamous \"El Macho\", a legendary supervillain who supposedly died after skysurfing a shark into the center of an active volcano. Gru and Lucy break into Eduardo's restaurant at night, but find nothing to prove that he is the culprit. Meanwhile, Agnes confides her dream to one day have a mother, and believes that Gru will fall in love with Lucy, but, despite her excitement, Gru tells her that his relationship with Lucy is strictly professional.Although still suspicious of Eduardo, Gru agrees to pursue other suspects, including wig merchant Floyd Eagle-san. However, after witnessing Eduardo's two-timing son, Antonio, sweep Margo off her feet, and invite everyone, including Margo, to his Cinco de Mayo party, Gru renews his focus on Eduardo. Afterwards, Gru is set up on what transpires to be a horrible dinner date with a vacuous woman named Shannon. During the meal, Shannon notices Gru's wig and is about to humiliate him when Lucy, visiting the restaurant herself, renders Shannon unconscious with a tranquilizer dart. They take Shannon home and, after spending personal time with Lucy, Gru comes to realize that Agnes was right; he has fallen in love with Lucy.The next day, the AVL arrest Floyd Eagle-san after an almost-empty jar of the PX-41 mutagen is found in his shop, and Ramsbottom declares the investigation closed. Lucy is reassigned to Australia, but before leaving she gives Gru her lipstick Taser as a reminder of her. Realizing that he genuinely loves Lucy, Gru is heartbroken, yet still cannot find the courage to ask her out on a date. Instead, he brings the girls to the Cinco de Mayo party and, whilst there, finds undeniable proof that Eduardo is indeed \"El Macho\". Gru discovers that El Macho and his partner, none other than Dr. Nefario, have been abducting Gru's Minions and using the stolen PX-41 serum to mutate them into insanely savage, purple, hairy 'Evil Minions'. El Macho announces his plan to launch rockets full of the mutated Minions into major cities in order to achieve world domination. He makes Gru an offer, proposing that they team-up, but Gru leaves without giving an answer.On her flight to Australia, Lucy realizes that she has also fallen in love with Gru. Using a backpack hang-glider, she jumps out of the plane and hang glides down to the party, only to be captured by El Macho after his pet chicken, Pollito, retrieves her AVL ID badge from her purse. Fortunately, Dr. Nefario informs Gru, and to rescue Lucy, Gru visits Macho along with two Minions covered in purple paint, pretending he was captured by them. Fighting alongside his daughters and Nefario, Gru and his team spray all of the mutated Minions with jelly containing a powerful antidote that Dr. Nefario made, whereupon they revert to their friendly yellow state. Macho then takes the mutagen himself, but Gru and Dr. Nefario overcome him using Lucy's lipstick Taser and a fart gun.Gru sees Lucy strapped to a TNT-loaded shark rocket and starts to untie her, but Pollito launches the rocket, sending the rocket flying towards the same volcano where Macho previously faked his death. Lucy accepts Gru's invitation for a date, and the pair dive into the ocean seconds before the rocket enters the volcano.After 147 dates, Gru and Lucy are married and Margo, Edith, and Agnes finally have a mother. The Minions close with a rendition of \"I Swear\" and \"Y.M.C.A\" as the whole family celebrates.","language":"English","Reception":"Despicable Me 2 received generally positive reviews from critics. The review aggregator website Rotten Tomatoes reported a 73% approval rating with an average rating of 6.6/10 based on 172 reviews. The website's consensus reads, \"Despicable Me 2 offers plenty of eye-popping visual inventiveness and a number of big laughs.\"[82] Another review aggregator, Metacritic, which assigns a normalized rating from mainstream critics, gave the film a score of 62 out of 100, based on 39 critics, indicating \"generally favorable reviews\".[83] The film earned an \"A\" from audiences polled by CinemaScore, on an A+ to F scale.[84]Michael Phillips of the Chicago Tribune gave the film two and a half stars out of four, saying \"Steve Carell's Slavic inflections as Gru do the trick, as before. Wiig's clever hesitations and comic timing help save the day.\"[85] Michael Rechtshaffen of The Hollywood Reporter gave the film a negative review, saying \"The new edition doesn't quite catch that inspired spark.\"[7] Stephen Whitty of The Star-Ledger gave the film three out four stars, saying \"Not only a fun cartoon but – that rare thing – a sequel which actually improves on the original.\"[86] Elizabeth Weitzman of the New York Daily News gave the film two out of five stars, saying \"Armed with masses of minions and an excess of adorability, Despicable Me 2 is guaranteed to charm anyone who's out of school and already bored.\"[87] Soren Anderson of The Seattle Times gave the film two and a half stars out of four, saying \"It's fun. It's cheerful. It's lollipop colorful. Best of all, it features lots of minion mischief, which guarantees plenty of laughs. But what it doesn't have is an edge.\"[88] Peter Howell of the Toronto Star gave the film two and a half stars out of four, saying \"It feels at times as if Despicable Me 2 actually is The Minions Movie. Coffin and Renaud and returning screenwriters Cinco Paul and Ken Daurio haven't managed to come up with a dastardly plot to rival the shrinking and stealing of the moon from the previous film.\"[89]Stephen Holden of The New York Times gave the film two and a half stars out of five, saying \"It is consistently diverting and so cute you'll want to pet it. Yet it is also weightless and lacks a center.\"[90] Rafer Guzman of Newsday gave the film two and a half stars out of four, saying \"Better, or at least sweeter, than the first, with Wiig adding some much-needed romantic charm to the toddler-level humor.\"[91] Tirdad Derakhshani of The Philadelphia Inquirer gave the film two and a half stars out of five, saying \"If you're looking for quality prepackaged, predigested Hollywood family fun this summer, you could do a lot worse than Despicable Me 2.\"[92] Keith Uhlich of Time Out gave the film three out of five stars, saying \"A fleeter film than its predecessor, Despicable Me 2 delights more often than it disappoints.\"[93] Alonso Duralde of The Wrap gave the film a negative review, saying \"The minions are still wacky scene-stealers – and once again, we don't get nearly enough of them – but Gru and his daughters have been blanded down to bad-sitcom level.\"[94] Claudia Puig of USA Today gave the film two out of four stars, saying \"With its predecessor having made a whopping $540 million globally, it's no wonder that Universal saw fit to order a sequel. But it's not enough just to trot out legions of minions and cobble together a plot. Audiences deserve more imagination and inventiveness than this wan recycling.\"[95] Owen Gleiberman of Entertainment Weekly gave the film a 'C' grade, saying \"By the end, every child in the audience will want his or her own monster-minion toy. Adults will just regret the way that Despicable Me 2 betrays the original film's devotion to bad-guy gaiety.\"[96]Sara Stewart of the New York Post gave the film three out of four stars, saying \"Sure, it's not as novel as the first time we were here, but directors Pierre Coffin and Chris Renaud stay true to the clever, slapstick vibe.\"[97] James Berardinelli of ReelViews gave the film three out of four stars, saying \"Despicable Me 2 feels like an opportunity to get together with some old friends, hang out, and discover what they've been up to.\"[98] Tom Russo of The Boston Globe gave the film a positive review, saying \"The scope of the 'toon espionage-adventure goings-on is surprisingly limited. But the filmmakers so clearly love working on these characters, their creative joy is infectious.\"[99] Stephanie Merry of The Washington Post gave the film three out of four stars, saying \"The animation is beguiling, particularly when Lucy drives her car into the ocean, transforming it into a submarine that scoots around sharks and fish.\"[100] Peter Debruge of Variety gave the film a positive review, saying \"While not quite as charming or unique as the original, Despicable Me 2 comes awfully close, extending co-directors Chris Renaud and Pierre Coffin's delightfully silly sensibility to a bit larger universe.\"[16] Peter Hartlaub of the San Francisco Chronicle gave the film three out of four stars, saying \"It's a credit that the writing can be so funny in the moment, that it takes time to realize there's no cohesive story, zero dramatic tension and nary a practical lesson for either the characters in the film or the people watching in the theater.\"[101]James Rocchi of MSN Movies gave the film four out of five stars, saying \"Heartfelt and hilarious, smart and silly, action-packed but never violent, Despicable Me 2 is that rare sequel that outshines its beginnings.\"[102] Colin Covert of the Star Tribune gave the film three out of four stars, saying \"For an adult, the predictability could turn you blasé. For kids, revisiting these jokes is a howl. Pinkie promise.\"[103] Mary F. Pols of Time gave the film a positive review, saying \"As a sequel it stands level with the first film, and may have the edge on it.\"[104] Peter Travers of Rolling Stone gave the film three out of four stars, saying \"Co-directors Chris Renaud and Pierre Coffin, who do Minion voices expertly, never let up on the laughs. A fart joke in 3-D may not be three times as wacky, but the high spirits of Despicable Me 2 are irresistible fun.\"[105] A.A. Dowd of The A.V. Club gave the film a 'C' grade, saying \"What's missing—and this was the crucial component of part one—is a little sour to undercut the sweet. Like its protagonist, a bad guy gone boringly good, Despicable Me 2 has no edge. It's fatally nice and insufficiently naughty.\"[106] Laremy Legel of Film.com gave the film a 6.3 out of 10, saying \"Despicable Me 2 is fun, especially near the culmination. Structural issues aside, it's impossible not to like these characters, all of them, rendered with love, always entertaining even when the story around them doesn't make much sense.\"[107]Despicable Me 2 grossed $368 million in North America, and $602.7 million in other countries, for a worldwide total of $970.8 million.[3] Calculating in all expenses, Deadline.com estimated that the film made a profit of $394.5 million.[108] It is currently the twenty-eighth highest-grossing film, the fifth highest-grossing animated film, the third highest-grossing 2013 film (behind Frozen and Iron Man 3), the second highest-grossing 2013 animated film, the highest-grossing Illumination Entertainment film,[109] and the second highest-grossing Universal Studios film (behind Jurassic Park).[110] With a budget of $76 million,[2] the film is the most profitable film in the 101-year history of Universal Studios.[110][111][112]North AmericaDespicable Me 2 is the twenty-sixth highest-grossing film, the fourth highest-grossing 2013 film,[113] the sixth highest-grossing animated film,[114] the seventh highest-grossing 3-D film,[115] and the highest-grossing Illumination Entertainment film.[109] It is the sixth animated film to pass the $300 million mark.[116] The film opened on Wednesday, July 3, 2013 at first place with $35.0 million (including $4.7 million from Tuesday night showings). Its opening-day gross stands as third highest for an animated feature,[117] and the seventh highest among films opening on a Wednesday.[118] The film then dropped 30% to $24.5 million on Thursday,[119] marking the second-largest non-opening Thursday gross.[120] Over the five-day Independence Day weekend (Wednesday-to-Sunday, including Tuesday night showings), the film earned $143.1 million, the highest five-day start for an animated film (ahead of Toy Story 3's $141.0 million five-day debut). During the traditional three-day opening weekend (Friday-to-Sunday), the film earned $83.5 million.[121] The film's three-day opening-weekend gross was the largest among Illumination Entertainment films,[109] the third largest for an Independence Day holiday,[122] the fourth largest among animated films,[123] the seventh largest among films released in July,[124] and the tenth largest among films not released on a Friday.[125] The film remained in the first position at the box office for two consecutive weekends.[126]Other countriesDespicable Me 2 is the twenty-seventh highest-grossing film, the third highest-grossing animated film, the fourth highest-grossing Universal film,[127] and the third highest-grossing 2013 film.[128] It is also only the fourth animated film to have grossed over $600 million. On its first weekend, Despicable Me 2 opened only in Australia with $6.66 million,[129] ahead of Monsters University which opened on the same weekend.[130] The film set an opening-day record in Latvia.[131] In total, it opened at number one in 67 territories,[132] and set opening-weekend records among animated films in Latin America, Indonesia, Malaysia, Philippines, Vietnam,[133] and Lebanon,[134] as well as opening-weekend records among all films in South Africa and Venezuela.[133] The film remained in the first position at the box office for two consecutive weekends during July 2013.[135][136] The film's largest openings occurred in the United Kingdom, Ireland and Malta ($22.5 million), China ($15.4 million) and Mexico ($14.9 million). In total earnings, its largest markets were the United Kingdom, Ireland and Malta ($72.2 million), China ($53.0 million) and Mexico ($47.7 million).[137]","Prequel and sequel":"A prequel feature film titled Minions, featuring the Minions as the main characters, was released on July 10, 2015.[156] Written by Brian Lynch, it was directed by Pierre Coffin and Kyle Balda, and produced by Chris Meledandri and Janet Healey.[156] The film, set in the 1960s, focuses on the Minions before they met Gru, where they compete for the right to become henchmen of an ambitious villain, Scarlet Overkill, voiced by Sandra Bullock.[157]On January 15, 2014, it was announced that a sequel, titled Despicable Me 3 will be released on June 30, 2017.[158]","box_office":"$970.8 million[3]","production_company":"Illumination Entertainment","directed_by":"Pierre Coffin Chris Renaud","Soundtrack":"Despicable Me 2: Original Motion Picture Soundtrack is the soundtrack album for the film, released on June 18, 2013 through Back Lot Music. The original music was composed by Heitor Pereira and Pharrell Williams.[76][77] The album was promoted by the highly successful single \"Happy\" performed by Williams.All music composed by Heitor Pereira, except where noted.","release_dates":"June 5, 2013 (2013-06-05) (Australia)|July 3, 2013 (2013-07-03) (United States)||||","Production":"Chris Meledandri, CEO of Illumination Entertainment, said in July 2010 that a sequel was in the works.[20] Release was tentatively scheduled for July 3, 2013.[21] Miranda Cosgrove stated on her official Facebook and Twitter page on October 14, 2011 that she had recorded her first lines,[22] while Meledandri confirmed in February 2012 that they had started working on the film.[23]In February 2012, it was reported that Al Pacino had joined the cast to voice the villain, Eduardo.[24] In April 2012, producers confirmed that Steve Carell, Russell Brand, Miranda Cosgrove, Dana Gaier and Elsie Fisher were returning to reprise their roles. Kristen Wiig, who voiced Miss Hattie in the original film, voices Lucy Wilde, an agent of the Anti-Villain League (AVL) who recruits Gru to track and take down a tough, Mexican villain named El Macho. Steve Coogan joined the cast as Silas Ramsbottom, the head of the Anti-Villain League.[4]On May 3, 2013, just a month before the film's premiere, producers announced that Al Pacino had left the film over creative differences about how his character should come to life.[10][25] At the time of his departure, Pacino's character had already been fully voiced and animated.[26] Chris Renaud, co-director of the film, commented on Pacino's departure: \"So we don't want an unhappy actor, and we want something that is well-realized on all sides. If you don't see eye to eye, sometimes it's easier to (part company) and move on from there.\"[25] Benjamin Bratt, who had already been considered before Pacino,[25] stepped in to voice Eduardo.[8] Chris Meledandri, producer of the film, admitted that he was not \"aware of any of the major animated films of the last 15 years that has brought an actor in at such a late stage\".[26] Due to the finished animation, Bratt had to match his timing exactly to the character's mouth movement.[27] Initially, during his five-day recording,[26] he tried to imitate Pacino's voice, but found it impossible, saying \"no one can out-Al Pacino Al Pacino\". He ended up only using Pacino as an inspiration, and resolved to go with his own interpretation of the character.[28] His work was commended by Variety, saying: \"You'd never guess he wasn't the filmmakers' first choice.\"[16]","produced_by":"Chris Meledandri Janet Healy","starring":"Steve Carell Kristen Wiig Benjamin Bratt Miranda Cosgrove Russell Brand Steve Coogan Ken Jeong","running_time":"98 minutes[1]","music_by":"Heitor Pereira Pharrell Williams","edited_by":"Gregory Perler","Release":"Despicable Me 2 premiered on June 5, 2013, at Event Cinemas in Bondi Junction, New South Wales, Australia. Steve Carell and Miranda Cosgrove were present at the red carpet premiere.[29][30] In France, it premiered on June 12, 2013, as part of the Annecy International Animated Film Festival.[31] The American premiere was held at Universal CityWalk in Los Angeles on June 22, 2013;[17] Steve Carell, Miranda Cosgrove, Kristen Wiig, Benjamin Bratt, Ken Jeong, Elsie Fisher, Dana Gaier, Nasim Pedrad and composer Pharrell Williams were present at the \"yellow carpet\" premiere.[32][33] The film was theatrically released in the United States on July 3, 2013.[4] It was digitally re-mastered into IMAX 3D format and released in select international IMAX theatres.[34] This film was also shown in the 4DX format, featuring tilting seats, water sprays, strobe lightning, aroma, wind, pops, and ticklers, in selected countries.[35][36][37][38] Cinépolis opened its first 4DX room at the Centro Comercial Limonar Premier mall in Cali, Colombia, with the release of the film.[39][40][41]As with the first film, which did not have a theatrical release in China, the film's distributor Universal Pictures had troubles releasing the sequel.[42] When it was reported in July 2013 that the film had been denied a theatrical release in China, then the second largest film market in the world, some analysts attributed this to the protection of locally produced animation.[43][44] There were also rumors that the film's release was banned in China because the film's minions too much resembled former Chinese president Jiang Zemin.[45] China's Film Bureau was \"furious\" about the negative comments, stating that the film was not submitted for censorship approval.[46] In fact, there was reportedly a \"commercial conflict\" between Universal and Edko Films, the film's local distributor, over which titles are to be imported.[47] Edko had decided that the film \"would not do well in China and decided against using one of the precious quota slots for the film.\"[46] In December 2013, a few weeks after the Universal Pictures' announcement that it would open a Beijing office, it was reported that Despicable Me 2 would be theatrically released in China on January 10, 2014.[45]A blimp dressed to appear as a Minion, named \"Despicablimp,\" toured the United States from March 2013 in a six-month tour to promote the film's release.[48] As one of the largest airships in the world, measuring 165 feet (50 m) in length, 55 feet (17 m) in height,[48] and weighing 8,000 pounds (3.6 t),[49] it crossed the country three times during its 20,000 miles (32,000 km)-long tour, visiting hundreds of events, including the film's premiere in Hollywood.[48] The blimp, an American Blimp Corporation A-150 model,[50] could be tracked in real-time via GPS at the Despicablimp Command Center website, which allowed fans to post photos of sightings, and compete for various prizes, including for a ride in the blimp.[48]A free mobile action video game inspired by the Despicable Me franchise, titled Despicable Me: Minion Rush, was released on June 13, 2013. The game, developed by Gameloft, was adapted for iPhone, iPad and Android devices.[51] Played as one of the Minions, it allows customization of the character, who must perform various tasks, including defeating Vector and a new villain created for the game, to earn the title of Minion of the Year.[51][52] The game was downloaded more than 100 million times in the first three months after its release,[53] and won a BAFTA's British Academy Children's Award in the category BAFTA's Kids Vote.[54] For the film's release, Roblox, a massively multiplayer online game, released two virtual items, a Minion and goggles.[55][56] Six books were released for the film: The Junior Novel,[57] The Anti-Villain League Handbook,[58] Undercover Super Spies,[59] Attack of the Evil Minions!,[60] Make a Minion,[61] and Meet the Minions.[62]Universal Pictures and Illumination Entertainment partnered with more than 100 licensing and promotional partners in a deal valued at an unprecedented $250 million.[63] One of the partners was McDonald's, which included in its Happy Meals various Minion toys, some of them unique to a specific country.[64] To take advantage of banana-loving Minions, Chiquita Brands International ran various sweepstakes,[65] and a Minion, voiced by Pierre Coffin, performed the song \"Chiquita Banana\" in the film.[18] Thinkway Toys released various toys and figures,[66] and Hasbro made special Monopoly and Operation games.[67] Custom 3D glasses, modelled after the Minions' goggles, were released exclusively at Best Buy and Look3D, the producer of the glasses,[68] for use in RealD 3D theatres and with passive 3D home theatre systems.[69]Despicable Me 2 was released in Digital HD on November 26, 2013, and on DVD and Blu-ray on December 10, 2013.[70] The DVD and Blu-ray combo pack features three \"mini movies\" titled Puppy, Panic in the Mailroom, and Training Wheels.[70] A Walmart exclusive Blu-ray/DVD combo pack included two limited edition Minion toys.[71] In its first week of home entertainment release, 4.5 million physical and digital units had been sold, earning $80 million and breaking several records.[72] The film had the highest first-week sales for a digital title ever and became the best selling animated Blu-ray title in its first week, surpassing its predecessor, which previously held the record.[72] Despicable Me 2 was the best selling Blu-ray of 2013 with 4,689,747 sold for a total of $93,734,824 in sales.[73] It was also the second best selling DVD for the year 2013 with 4,566,911 sold for sales totaling $77,250,269.[74] As of January 2015, Despicable Me 2 has sold 6,998,018 DVDs and 5,560,038 Blu-ray discs totalling $112,572,748 and $114,061,866 respectively totalling $226,634,614 in North America.[75]","despicable_me_2":"Theatrical release poster","written_by":"Cinco Paul Ken Daurio","budget":"$76 million[2]"}