{"based_on":"Dear John  by Nicholas Sparks","country":"United States","distributed_by":"Screen Gems","screenplay_by":"Jamie Linden","Plot":"While serving in the United States Army Special Forces in 2007, John Tyree, a Staff Sergeant, is lying on the ground after being shot multiple times with his comrades around him. In a voice over, he recalls a childhood trip to the U.S. Mint and compares himself to a coin in the United States Military before stating that the last thing he thought of before he blacked out was \"you.\"In 2001, John is on vacation in Charleston, South Carolina while on leave. He meets Savannah Curtis, a college student on spring break, when he fetches her purse from the ocean. She invites him to a bonfire party where he meets her neighbor, Tim Wheddon and his son Alan. Over the course of two weeks, they go on several dates and fall in love. Savannah also meets John's father, who is obsessed with his coin collection.Savannah mentions to John that his father, like Alan, may have high-functioning autism. This upsets John who storms off. Savannah's friend Randy, who also has a crush on her, makes a comment that provokes John to fight and he accidentally punches Tim. Savannah sees the commotion and stops speaking to him. John apologizes to Tim, who offers to give Savannah a message. She drives to John's house to spend one last day together.John and Savannah continue their relationship through letters. Savannah spends more time with Tim and decides she wants to work with children with autism, and plans to build a farm and horse stables where they can enjoy the outdoors and animals. They expect to build a life together when John leaves the army, but after the September 11 attacks, he re-enlists. Over the next two years, the romance goes on through their letters and one turns out to be a Dear John letter that she is engaged to someone else. John burns all of Savannah's letters.Despite being wounded and encouraged to return home, John re-enlists. After four more years, while waiting to receive orders on his unit's next deployment, John is informed that his father had a stroke. When John arrives at the hospital he learns that his father is alive but in grave condition. John writes a letter to his father, which he reads to him at the hospital; John's voice over at the beginning of the film was from this letter, in which he told his father that the first thing to cross his mind after he was shot was coins, and the last thing to cross his mind before he lost consciousness was his dad. Soon afterwards, his father dies.John visits Savannah and learns that she has married Tim and abandoned her dream of a riding camp for kids with autism because of Tim's fight against lymphoma. John goes with her to visit Tim in the hospital. Tim tells John that Savannah still loves John. John sells all of his father's coin collection except the mule that John found, to raise money, which could help Tim in his treatment. Back in the army, John uses the mule as a charm. He receives a letter from Savannah telling him that Tim died after two months. John, now a civilian, sees Savannah at a coffee shop and they hug.","language":"English","Reception":"Dear John has grossed $80,014,842 in North America and $34,962,262 in other territories for a worldwide total of $114,977,104.[1]In its opening weekend, the film grossed $30,468,614, finishing first at the box office, knocking off Avatar after seven weekends in first place and making it the best debut for a film based on a Nicholas Sparks novel.[1][3]The film was the second highest debut for a film opening Super Bowl weekend, just shy of Hannah Montana & Miley Cyrus: Best of Both Worlds Concert in 2008.[1][4]The film received mixed to negative reviews from critics, with some praising the casting, but many dismissing its characters and writing as generic.Metacritic, which assigns a weighted average score from film critics' reviews, reports a rating of 43% based on 34 reviews. On Rotten Tomatoes, it holds a \"rotten\" 29% with an average score of 4.4/10.[5]","box_office":"$114,977,104[1]","cinematography":"Terry Stacey","production_company":"Relativity Media Temple Hill Entertainment","directed_by":"Lasse Hallström","Home media":"Dear John was released on DVD and Blu-ray on May 25, 2010.","Music":"The score to Dear John was composed by Deborah Lurie, who recorded her score with the Hollywood Studio Symphony at the Warner Brothers Eastwood Scoring Stage.[2] A soundtrack album containing songs was released on February 2, 2010 from Relativity Media Group, and a score album was released digitally the same day.[citation needed]","release_dates":"February 5, 2010 (2010-02-05)|||||","produced_by":"Marty Bowen Wyck Godfrey Ryan Kavanaugh","starring":"Channing Tatum Amanda Seyfried Henry Thomas Richard Jenkins","running_time":"107 minutes","dear_john":"Theatrical release poster","music_by":"Deborah Lurie","edited_by":"Kristina Boden","budget":"$25 million[1]"}