{"country":"United States","distributed_by":"Universal Pictures","Plot":"Stacy (Lea Thompson) has a promiscuous past, and after learning of the AIDS epidemic she wants to find a guy whom she knows is clean, so she convinces her childhood friend Melissa (Victoria Jackson) to go to a health spa (or resort) for singles so that they can hopefully each find the man of their dreams. It shows them having received or possibly having bought a basket filled with condoms. At the spa, Stacy meets Nick (Stephen Shellen), a struggling musician whom she is taken with, and also encounters Vinny, aka the Vin Man (Andrew Dice Clay), an annoying Italian-American man from New Jersey whom she tries to avoid.At an event at the health resort called International Night, the men and women all take miniature flags and put them in plunger-shaped hats and then meet the person with the identical flag. After becoming upset over a bad experience at the flag party, Melissa writes a letter that she leaves for Stacy and says in it that she is leaving the spa resort to return to LA by herself (being frustrated and demoralized by her experiences there). However, Melissa soon finds herself connecting with a spa staff member, Jamie (Jerry Levine), who has taken an apparent liking to her and yet who is very sweet, respectful and supportive of her and who some days later, when they are intimate, winds up giving her her very first orgasm. Meanwhile, Stacy finds Melissa's letter to her and, thinking that Melissa has, in fact, left the resort alone in frustration to return to LA, immediately returns to LA herself via the 2PM bus (and having taken Nick along with her to move into her home with her), not knowing that Melissa has, in fact, wound up remaining at the resort (because she was, in fact, on the verge of going back to LA and even waiting for the bus in the bus station to take her back to LA but surprisingly found Jamie waiting there for her inside the bus terminal to console and support her and, in the end, she wound up going back to the resort with Jamie).Stacy, back in LA at her home there, falls back into old behavior patterns and gives in to being a crutch for men by bringing Nick back to her apartment with her, and she lets him move in with her to try to get his fledgling music career off the ground. However, Stacy soon realizes that Nick is someone whose quirky habits (e.g., he doesn't even have a checking account nor a credit card and carries all his personal belongings in plastic trash bags) and idiosyncratic ways of thinking (showing that he doesn't really have his life together at this age and stage of life) are something that she cannot adapt to and realizes that she actually doesn't really like him and see him being her man in the way she initially thought she did back at the resort. And then upon learning that Melissa is, in fact, back at the resort and never even left it, she hurriedly winds up renting a pink Cadillac and drives all the way back to the spa resort, where she winds up accidentally and surprisingly walking in on Melissa in bed with Jamie and, outside the room, Melissa tells Stacy about Jamie and how they have bonded with one another. Stacey is relieved that Melissa is, in fact, in good spirits now and is thrilled for her that she and Jamie have bonded with one another (and Melissa shares with Stacy that she even experienced her very first orgasm ever in her life with Jamie, for which Stacy is very thrilled for her and they hug one another).Then Stacy tells Melissa that she realizes she made a big mistake with Nick and, in fact, she has Nick living with her in her home now and she has realized she has to end it with him. Stacy finds the fortitude within herself to take the drive back to LA to tell Nick that their relationship will not work and to have him leave her apartment and leave her life. Driving her car on the way out of the health resort to return to LA, she comes across Vinny waiting near the exiting road out of the resort with his luggage in tow and he flags her down and begs her to let him in the car so she can drop him off at the nearest bus station so that he can leave the health resort as well (and, without prompting, Vinny promises not to come on to her or do anything else of the sort). Reluctantly, Stacy lets him get into the car with her but, this time, he is not trying to come on to her or be pushy and desperate. Instead, on the drive to the bus station to drop Vinny off there, they both wind up being frank and plain-talking and commiserate together about their disappointment with their experience with the health resort and Vinny lets his guard down and speaks plainly about how he really just doesn't understand the world of male and female relationships and how it all works. He asks Stacy \"How do you do it, this male, female, relationship thing? How do you do it?\". Stacy shares that she is, in fact, in \"relationship hell\" at that time, which surprises Vinny (as he is and has been so impressed by and enamored of Stacy thus far, viewing her as a very desirable woman and an all-around winner). When she asks him what he himself looks for in a woman, she is touched by what he shares with her and gets a new, enlightened view of him (i.e., that there is more to Vinny than the desperate, pathetic, trying-too-hard act she saw in him since first meeting him). And Vinny, upon returning to New Jersey and thereafter, experiences changes in his attitude toward life-at-large and women and how he sees his life moving forward. And he winds up over time keeping in touch with Stacy via handwritten letters, sharing with her the epiphanies he is experiencing and the myriad changes he is going through over time and how he is becoming a different kind of person and how his life is advancing and improving for the better.Meanwhile, the movie shows Stacy back in her home and how she confronted Nick in her home and found it in herself to convey to him that it wasn't going to work out and that he must leave and move on. Nick is taken aback, acts hurt, and defiantly says that he sees himself, in fact, as on the way to making it big in the music business (as a songwriter and performer) and way beyond even what she can ever envision and that she will regret this decision of hers. She wishes him the best and he storms out with his belongings. At this point, Stacy is relieved that it has ended and she is determined to take a break from men-at-large for an unspecified span of time to sort things out in her head.The movie then moves forward to some expanse of time later, showing Stacy (unpartnered and all by herself) together at Christmas time with Melissa and Jamie in their home (and Melissa and Jamie appear to now be involved as significant others with each other, though it doesn't specify if they are now a married couple or just unmarried lovers). At the end of the evening in the middle of the night (implying it is in the few hours before dawn), Stacy says goodbye to Melissa and Jamie at the doorway and leaves their home by herself to go home. She is walking home by herself and, as it turns out, Vinny is waiting along the streets near her home in his own fancy limousine (as it turns out, he has gone into business for himself running a limousine service and owns a whole fleet of limousines). Vinny surprises Stacy in the street and Stacy is startled and asks Vinny \"What are you doing here?\". Vinny shares with her that he found himself starting to take a drive from his home in New Jersey just to take a drive and, the next thing he knew, he found himself in Chicago, Illinois and then asked himself \"Vinny, where are you going?\" and says he realized that he was driving all that way to see Stacy. He wound up driving all the way from New Jersey to southern California on a whim just to see Stacy. Stacy was taken with this and yet, when he asked her if she'd like to talk or go someplace together, she initially is hesitant and says to him that it was very late. Yet Vinny, being a gentleman this time (in contrast with their past times together) acts with reserve and as a gentleman and politely takes her cue and says, in effect, \"Well, I felt like taking a drive anyway\" and turns around to go back to his limousine and drive away. In other words, in contrast to how he used to be, this time he isn't acting desperate nor pushy in any way but rather classy and respectful of her choice and her personhood and Stacy apparently is moved by this and, seeing how he drove all the way from New Jersey to California just for the chance to see her and maybe spark something between them, she calls out to him and says that, if he likes, he can come home with her and she can make him breakfast. He pauses a bit, turns around, and says that he is, in fact, rather hungry and accepts her invitation and then even offers to be the one who makes breakfast for both of them (sharing with her that he has, among other things, learned to be a rather good cook since last seeing her). And then he says he has a gift for her and she asks what he is talking about. He walks over to the limousine, opens the door, reaches into the limousine and fetches an adorable puppy dog that he hands to her, which she falls in love with on the spot. And it shows them walking off together with Stacy holding the dog in her arms (who is unendingly showering her with affectionate licks to her face and she loves it).The scene now moves six years ahead and shows Melissa and Jamie (now an apparent couple, though not conveying if they are married or just involved as unmarried lovers) ringing the doorbell of Stacy's home for a social gathering and, as they are greeting one another inside the front hallway in the home, we see Vinny coming down the stairs in the home with that same dog (now grown bigger) on a leash pulling him down the stairs and with two young boys in tow. It is apparent that Vinny and Stacy are now either husband-and-wife or else unwedded parents and have two young sons. As Vinny is greeting Jamie with his two boys and dog and having a great time with all, Stacy and Melissa are at a distance standing together and looking toward their two significant others and they reminisce back to a humorous line they've used over time with one another over their many years as friends, with Stacy saying to Melissa \"There's your boyfriend\" and with Melissa replying, \"So what, there's yours.\" Finally Stacy says to the camera, \"Yeah, that's my boyfriend\". They each come across as two content and fulfilled women who have both finally found the man of their dreams and they both smile and hug one another and the film ends.","casual_sex?":"Theatrical release poster","language":"English","box_office":"$12,277,096[1]","cinematography":"Rolf Kestermann","directed_by":"Geneviève Robert","release_dates":"April 22, 1988","produced_by":"Ilona Herzberg","starring":"Lea Thompson|Victoria Jackson|Stephen Shellen|Jerry Levine|Mary Gross|Andrew Dice Clay|","running_time":"88 minutes","music_by":"Van Dyke Parks","edited_by":"Donn Cambern Sheldon Kahn","written_by":"Wendy Goldman Judy Toll"}