{"futurama:_bender's_big_score":"DVD cover","country":"United States","distributed_by":"20th Century Fox Home Entertainment","Plot":"Two years after Box Network executives canceled Planet Express' contract, the executives are fired and Planet Express is back \"on the air.\" As the crew celebrates, Hermes is decapitated, causing his wife LaBarbara to leave him. His head is placed in a jar while his body is repaired. Lars, the man who performs the procedure, flirts with Leela, much to Fry's chagrin.During a delivery to a nude beach planet, Bender discovers a tattoo of himself on Fry's butt. A trio of scammer aliens (Nudar, Fleb and Schlump) dupe the crew into providing their personal information, allowing them to seize control of Planet Express and infect Bender with an obedience virus. The scammers then discover that Fry's tattoo has a code that allows time travel, but only into the past. Nibbler tries to warn the scammers against using the code, but is ignored.The scammers have Bender use the code to steal valuable objects from Earth's past, storing them in a cave beneath the ship. Hermes also has Bender retrieve an earlier version of his body so he can win back his wife. Meanwhile, Leela and Lars date, further depressing Fry.Once the scammers have history's treasures, they decide to get rid of the time code by killing Fry. Fry uses the code to escape to January 1, 2000, just after he was frozen. The scammers send Bender after him. Bender arrives before Fry, creating a duplicate of himself when he has to use the bathroom. Another Bender from \"way at the end\" then appears, opens Fry's cryogenic tube and puts the tattoo on his butt. When Fry arrives, the first duplicate inadvertently initiates a self-destruct sequence as a result of not going to the bathroom. Fry shoves that Bender into another tube, then escapes. The original Bender spends the next twelve years hunting Fry, destroying Fry's apartment when he walks inside.Bender reports his success to the scammers, who then erase the time code and the virus. The crew holds a memorial for Fry, but he suddenly shows up. Fry says he created a duplicate of himself, which remained in the past while he accidentally fell into his own cryo-tube. When Fry (plus the Fry that was originally frozen) awoke 1,000 years later, the present Fry froze himself until the current year. Meanwhile, the Fry in 2000 spent the years before Bender's attack working at Panucci's Pizzeria, then at an aquarium caring for Leelu, an orphaned narwhal. He also hung out with his family and tended to his beloved dog Seymour Asses.Nibbler removes the tattoo from Fry to keep the scammers from further abusing it. Leela and Lars decide to marry, but during the wedding Hermes is again decapitated. Professor Farnsworth says that Hermes' body would have died anyway since time paradox duplicates are doomed to die prematurely. Hearing this, Lars panics and cancels the wedding.The scammers then trick Earth President Richard Nixon into giving Earth to them. Exiled to Neptune, the population assembles a fleet with the aid of Robot Santa, Kwanzaabot, and the Hanukah Zombie. Hermes has his bureaucratic brain wired into the ship's battle computer, allowing him to destroy the scammers' fleet and win back his wife. Meanwhile, Leela uses a doomsday device that Bender had originally stolen for the scammers (then stolen back for himself) to destroy the scammers' ship.Unable to console a heartbroken Leela, Fry arranges for her to meet with Lars at the cryogenic lab. Having survived the doomsday blast, Nudar ambushes them. Lars tricks Nudar into approaching the Bender duplicate on auto-destruct and holds him against the duplicate, who explodes, killing the three of them. The explosion singes off some of Lars' clothing, revealing the Bender tattoo.During Lars' funeral, the Planet Express crew learns that Lars was actually the time-paradox duplicate of Fry, who had survived Bender's attack in 2012; the fire and smoke changed his appearance and voice. The duplicate Fry froze himself to return to the future and be with Leela. However, when he learned that time travel paradoxes were doomed, he canceled the wedding to spare Leela the pain of his inevitable death. Leela forgives “Lars” and reconciles with Fry.Bender removes Lars's tattoo and travels to 2000 to place it on Fry in the cryogenic tube so that the events that transpired \"make any sense at all.\" Upon returning, Bender emerges with all the duplicates from his stealing sprees. Terrified of the paradoxical consequences, Nibbler urges everyone to evacuate the universe before swallowing himself. The Bender duplicates explode and cause a tear in the fabric of space.","language":"English","Reception":"In its first week, the DVD sold 222,036 units, for a total of $3,994,428.[9] As of July 24, 2008, The Numbers reports DVD sales stand at 920,023, for a total of $16,662,212.[9]The film holds a 100% \"Certified Fresh\" rating on Rotten Tomatoes.[10] It won the 2007 Annie Award for Best Home Entertainment Production.[11] The movie received an \"A\" rating in a review at UGO, calling its two musical numbers \"hilarious\", and the overall quality on par with that of the show's original run.[12] Dan Iverson of IGN gave the movie an 8 out of 10, stating that \"it is easy to recommend Bender's Big Score to fans of the series and those new to the show alike.\" They also gave the DVD a 7 out of 10, praising the extras but lamenting the quality of the video transfer.[13] It has been given a 'B' by The Washington Post.[citation needed]","production_company":"The Curiosity Company Rough Draft Studios","Torgo's Executive Powder":"Torgo's Executive Powder is an elaborate running gag throughout the film in retaliation against the Fox Network for its alleged mishandling and eventual cancellation of Futurama.[14] The product is said to have \"a million and one uses\" and consists of ground-up executives, including those of the film's thinly veiled Fox Network parody (the Box Network), and makes repeated appearances due to its miraculous utility in such diverse tasks as seasoning, surgery, delousing, feeding heads in jars, cosmetics, bomb disposal, artillery, and the care of head transplant patients. In the \"Everybody Loves Hypnotoad\" episode released with the film, Torgo's Powder is advertised as a parody of HeadOn, stating \"Torgo's Powder: apply directly to the buttocks\" three times in the same fashion. When the film was aired on Comedy Central, a fake commercial was shown preceding the first break in which a woman dumps some of the powder in a toilet. It appears once in Bender's Game on Fry and Bender's kitchen counter, when Bender is washing a pot and is about to jump out of the window.[15]","directed_by":"Dwayne Carey-Hill","release_dates":"United States: November 27, 2007 United Kingdom: April 7, 2008 Australia: March 5, 2008","Production":"In February 2007, Futurama co-creator Matt Groening addressed speculation as to whether Futurama had been revived in episodic or feature film form, explaining that the crew is \"writing them as movies and then we're going to chop them up, reconfigure them, write new material and try to make them work as separate episodes\".[2] A preview of the film was shown at Comic-Con 2007.[3] It was also reported at Comic-Con that once the movie is \"chopped up\" it will be reconfigured into four episodes that will be broadcast on Comedy Central on March 23, 2008. The same will be done with the succeeding three movies, creating a sixteen-episode fifth season.[4] The voice recording finished on July 3, 2007.[5] An official trailer was released on October 10, 2007.In addition to background musical scoring for the movie, Christopher Tyng provided two original \"movie musical\" style songs for the characters to sing in context in Bender's Big Score. The song \"I May As Well Jump\" (also referred to as \"Street Song\") exposited the dissatisfaction of most of the characters with the ways their lives were progressing at that point in the plotline, except for Lars and Leela, who were contrastingly delighted to announce their happiness and their upcoming marriage. The song \"This Trinity's Goin' To War\" (also referred to as \"This Toyshop's Goin' To War\") exposited the plans of Robot Santa, Chanukah Zombie, and Kwanzaa-bot to provide military support to assist in the liberation of Earth. The movie also contains a cover of Scott Walker's \"30 Century Man\" performed by The Jigsaw Seen.","produced_by":"Lee Supercinski Claudia Katz","starring":"Billy West Katey Sagal John DiMaggio Tress MacNeille Maurice LaMarche Phil LaMarr Lauren Tom David Herman Dawnn Lewis Kath Soucie Frank Welker","running_time":"89 min.","music_by":"Christopher Tyng","edited_by":"Paul D. Calder","Release":"Bender's Big Score made its broadcast premiere on Comedy Central on March 23, 2008.[1] The film was broken into four separate episodes which served as the first part of Futurama's fifth season, followed by The Beast with a Billion Backs, Bender's Game and Into the Wild Green Yonder. The TV movie was screened in the United Kingdom on Sky1, which started airing Bender's Big Score on October 26, 2008. After being aired in four separate episodes, the next three movies were aired, with each of them being broken up into four episodes; creating a fifth season comprising 16 episodes overall. Bender's Big Score aired in Canada on October 12, 2008 on the Global Television Network.In the broadcast premiere, the extended opening from the film is placed before the scene where Hermes is decapitated as opposed to after it. The first two scenes in the montage of Leela and Lars' dates were cut. The original opening subtitle \"IT JUST WON'T STAY DEAD!\" is kept as the opening subtitle of the first part. The three additional opening captions are: \"Watch, Rinse, Repeat\", \"Apply directly to the foreclaw\" (a reference to HeadOn), and \"Last Known Transmission of the Hubble Telescope.\" The billboard scene in all four is identical to the single scene in the film, a snippet from \"Space Pilot 3000\" where Fry gets frozen.Futurama: Bender's Big Score is the first carbon-neutral DVD to be released by 20th Century Fox.[6][7] The studio worked to reduce the carbon impact of DVD manufacture and distribution. It also features \"A Terrifying Message From Al Gore\", an animated short produced to promote guest star Al Gore's film An Inconvenient Truth, a discussion on the use of mathematics in Futurama, full length audio commentary by cast and crew members. There is also a 22-minute full length episode of \"Everybody Loves Hypnotoad\".[8] It was released in 16:9 widescreen format; the first 16:9 presentation of any Futurama media.","written_by":"Teleplay: Ken Keeler Story: Ken Keeler David X. Cohen"}