{"a_fantastic_fear_of_everything":"Theatrical release poster","country":"United Kingdom","distributed_by":"Universal Pictures","Plot":"Jack is a children's author whose happy marriage has been destroyed by his obsession with his unpublished first book, Harold the Hedgehog. He is working on a series of scripts titled Decades of Death, about Victorian era serial killers. He has become obsessed with serial killers and paranoid that people are watching him and trying to kill him, which isn't helped by the fact that a serial killer called the Hanoi Handshake Killer, who cuts off the fingers of his victims, has been active in his neighbourhood.While trying to give money in a sock to carolers, Jack is startled by a phone call from his agent, Claire. She tells him that Harvey Humphries, the head of scripts at the BBC, is interested in Jack's scripts and arranges a meeting between the two in just a few hours. Jack convinces himself that Humphries is a serial killer but plans to attend the meeting anyway.Jack tries to clean his clothes in the oven to be presentable for his meeting with Humphries, only to find that he has super-glued a carving knife to his hand. After trying to remove the knife, he discovers that his clothes are ruined. Jack realises that he has to go to the laundrette. Since he is terrified of the prospect, he calls Professor Friedkin, an old friend, and asks for help. After listening to Jack's traumatic memories of the launderette, Friedkin convinces Jack that he must confront his fears and go there.While at the laundrette, he doesn't understand how the machines work. Frustrating the fellow patrons, he decides to just dry the clothes because he doesn't have time to wash them again. A beautiful young woman then enters, causing Jack further distress, so he rushes to remove his damp clothes from the dryer so he can leave. Forgetting that the carving knife is still glued to his hand, he removes his hand from his pocket and causes the other customers to panic and lock him in the laundrette.The police arrive, breaking into the laundrette and subduing Jack. The police remove the knife from his hand and treat his wounds. They are about to return him to the police station when a helicopter flies over and announces that there is an emergency and they are needed elsewhere. They hastily throw Jack into the back of the police van and drive off, but he falls out of the vehicle as it begins driving.Perkins, a community support police officer, follows the young woman while Jack returns to the laundrette to get his clean shirt for his meeting. While Jack is changing into his shirt, he notices that a back door that had been locked is now open. He goes through the door and finds a hatch in the floor. As he looks through the hatch, someone hits him from behind.Jack wakes up in the basement of the laundrette tied up next to the young woman. As they begin to panic, Perkins comes down the stairs. They urge him to get help but he reveals that he is the Hanoi Handshake Killer; he cuts the fingers off of his victims and blames the killings on the Vietnamese mafia. Perkins says the laundrette used to belong to his grandmother until the Vietnamese immigrants pushed her out, and he now murders for revenge. He then goes upstairs to sharpen his knife.Jack tells the woman about the traumatic events in his childhood regarding the launderette, and she comforts him and urges him not to give up hope. She says her name is Sangeet and Jack asks her if she will have dinner with him if they survive. Perkins returns carrying a boombox playing the song \"The Final Countdown\" by Europe. Perkins and Jack argue about the song's genre, causing Perkins to tell them about his childhood. His mother died when he was very young and his grandmother took him in and gave him a room in the cellar. During this story we see that this was the same launderette the Jack was abandoned in and he was being watched by Perkins from the back room.Jack and Sangeet try to get Perkins to admit that his grandmother did not take proper care of him. Jack argues that Tony is not a good serial killer because he is not original (he supposedly has his grandmother's body in a rocking chair, which references the film Psycho.)Sangeet frees herself and injures Perkins as he is about to murder Jack. Sangeet tries to escape but Perkins recovers and drags her back into the cellar. As Perkins is struggling with Sangeet, she frantically suggest that Jack tell a story. Jack convinces Perkins to listen to a story as his final request. Jack tells a story called Brian the Hedgehog; Perkins relates to the story and cries, admitting that he didn't kill the first victim and he had only found the body. The owner of the launderette opens the hatch, prompting Jack and Sangeet scream for help.Several months later, we see a well-groomed Jack reading his book about Harold and Brian to a group of children. Sangeet and Professor Friedkin are there. Clair finally introduces Jack to Humphries, causing Jack to become briefly fearful. Sangeet reminds Jack that they are going to dinner, and so they leave the event and catch a taxi as the credits roll over the frame.","language":"English","Critical reception":"The film received mixed to negative reviews. Film review aggregation site Rotten Tomatoes giving a 33% \"rotten\" rating based on 26 reviews, with an average rating of 4.2/10. The site's consensus reads: \"Aside from a few chuckles and Simon Pegg's reliably affable screen presence, A Fantastic Fear of Everything has embarrassingly little to offer.\"[4]","box_office":"$96,948[1]","cinematography":"Simon Chaudoir","production_company":"Sensitive Artist Productions Limited","directed_by":"Chris Hopewell Crispian Mills","release_dates":"8 June 2012 (2012-06-08)|||||","produced_by":"Geraldine Patten","starring":"Simon Pegg Clare Higgins Amara Karan Paul Freeman Alan Drake","running_time":"100 minutes","music_by":"Michael Price","edited_by":"Dan Roberts","written_by":"Crispian Mills"}