{"based_on":"Congo  by Michael Crichton","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"John Patrick Shanley","Plot":"While testing a communications laser in a remote part of the Congo jungle, TraviCom employees Charles Travis (Bruce Campbell) and Jeffrey Weems (Taylor Nichols) discover the ruins of a lost city near a volcanic site. Karen Ross (Laura Linney), assisting at TraviCom's headquarters, does not hear back from their team and activates a remote camera at the camp, discovering the camp destroyed and numerous corpses; something large suddenly knocks over and destroys the camera. Karen alerts TraviCom's CEO and Charles' father, R.B. Travis (Joe Don Baker), who informs her that the group was really there looking for a rare blue diamond only found there which would greatly enhance their capabilities, but does not offer any hope to rescue them. Travis implores Karen to lead an expedition and she makes Travis swear that he is sending her to look for Charles, not the diamond.Meanwhile, Dr. Peter Elliott (Dylan Walsh), a primatologist at the University of California, Berkeley, and his assistant Richard (Grant Heslov) teach human communication to primates using a gorilla named Amy (voiced by Shayna Fox). With a special backpack and glove, her sign language is translated to a digitized voice. Despite the success, Peter is concerned that Amy is having nightmares and psychological problems, due to several drawings Amy has made of jungles and the Eye of Providence. Peter attempts to gain funding to take Amy to Africa, but the university is reluctant, and Peter begins inquiring elsewhere. Romanian philanthropist Herkermer Homolka (Tim Curry) offers to fund the expedition; Karen, having learned of the trip, offers to fund it as well and to come along, hoping to discover the fate of her team.In Africa, the group meets their expert guide Captain Munro Kelly (Ernie Hudson) but they are captured by the local authorities and militia leader named Captain Wanta (Delroy Lindo) who grants them passage for a sizable bribe. As the group boards another plane, Munro reveals that Homolka has led previous safaris in search of the \"Lost City of Zinj\", with disastrous results. The group must parachute into the jungle after their plane is shot down by Zairean soldiers.On the ground, they encounter a native Ghost Tribe. The tribe leads them to Bob Driscoll (John Hawkes), a member of Charles' expedition, who they have been attempting to revive from his catatonic state. On seeing Amy, Bob begins screaming and soon dies. They continue by boat, and learn that Homolka is interested in finding Zinj and its fabled diamond mine; Homolka believes that Amy's drawings suggests she has seen the mine and hopes she will lead them there. They find the ruined camp and Zinj nearby. While searching the city, Richard is attacked by a killer grey gorilla, which the rest of the team take down. They take shelter at the ruined camp, other grey gorillas kept at bay by automated sentry guns set up by Karen.When day breaks, they return to the city, discovering hieroglyphs that say that the people had taught the grey gorillas, a unique species due to the volcanic environment, to guard the mine and kill anyone that approached it. The group suspects that the gorillas turned on their masters but still protect the mine now. They find the diamond mine and Homolka starts to collect large diamonds, but a pack of gorillas appear and kill him. Munro, Karen, and Peter fight off the gorillas and flee deeper into the mine, where they discover Charles' body, holding a giant blue diamond. As Amy helps to fend off the gorillas, Karen is able to fit the diamond into a portable laser, using it to fire and ward off the gorillas. The volcano begins to erupt, and Munro, Karen, Peter, and Amy escape as the city is flooded with lava, killing the gorillas.Karen contacts Travis to report on finding the diamond and confirming Charles' death. When she sees Travis is only worried about the diamond, she uses her laser to destroy the TraviCom satellite. In the nearby wreckage of a cargo plane, they find a usable hot-air balloon, and prepare to leave. Peter sees Amy watch a pack of mountain gorillas nearby, and lets her go, telling her goodbye. The three take off in the balloon, and Karen has Peter throw away the diamond as they leave.","language":"English","Reception":"Congo opened with a weekend total of $24,642,539, eventually going on to gross $152,022,101 worldwide ($81,022,101 domestic) theatrically versus a $50,000,000 budget.[3]Though the film was a box-office hit, the critical reaction was negative: Rotten Tomatoes retrospectively collected 44 reviews to give the film a rating of 22%.[4] A significant cause of disappointment among the novel's fans was that the \"gorillas\" were obviously costumed humans and puppets with noticeable fur mask gaps on the necks, whereas the 1993 film Jurassic Park had familiarized audiences with CGI dinosaurs. CGI was originally planned for the gray gorillas, but the technology hadn't yet been developed to the point where realistic hair could be created. While smooth-skinned dinosaurs were possible, hairy apes would have looked inappropriately cartoonish. Animatronics, masks, and puppetry had therefore to be used, created by Stan Winston.The film had some positive reviews: Roger Ebert of Chicago Sun-Times gave it 3 out of 4 stars, and called the film a splendid example of a genre no longer much in fashion, the jungle adventure story,[5] while Joel Siegel said it had \"breathtaking action\" and \"amazing special effects\".","congo":"Theatrical release poster","box_office":"$152 million","cinematography":"Allen Daviau","production_company":"The Kennedy/Marshall Company","directed_by":"Frank Marshall","release_dates":"June 9, 1995 (1995-06-09)|||||","Differences from the novel":"A major plot point in the novel is the American expedition competing with a German-Japanese consortium to reach Zinj. This rivalry is omitted from the film, as is the consortium altogether.In the novel, Munro Kelly is a mixed-race Scotsman named \"Captain\" Charles Munro, described as the son of a Scottish noble adventurer and his \"handsome Indian housemaid.\" In the film, he is a British man of African descent.","produced_by":"Kathleen Kennedy Sam Mercer","starring":"Dylan Walsh|Laura Linney|Ernie Hudson|Grant Heslov|Joe Don Baker|Tim Curry|","running_time":"109 minutes","In other media":"A video game based on the film, Congo The Movie: The Lost City of Zinj, was released in 1996. A different game for the Super Nintendo Entertainment System and Sega Genesis was in development, but was cancelled when the movie flopped. [6]","music_by":"Jerry Goldsmith","edited_by":"Anne V. Coates","budget":"$50 million"}