{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"A witness against the Mafia is being secretly held until the trial when a violent attempt against her that kills several of her guards, as well as her husband, is made. She disappears and Chris Lecce (Dreyfuss) and Bill Reimers (Estevez) are called upon due to their excellent surveillance record, to stake out a lakeside home where she is believed to be. Unlike their earlier stakeout, this time they are accompanied by Gina Garrett (O'Donnell) from the DA's office and her pet rottweiler 'Archie', covered as husband, wife and son.Chris realizes his girlfriend Maria is leaving him, due to his responsibility as a policeman, and not as someone she fell in love with. The main reason is, Maria dated Chris for seven years and she wants to get married. But Chris doesn't since his family has the worse track record in marriage, including his divorce. However, he, Bill, and Gina must continue with their investigation for Brain and Pam O'Hara to make sure they are safe. Bill sneaks over one night during a dinner party to their house to put several tape recorders around their house.Things take a turn for the worse when Bill is knocked unconscious after being mistaken for a hit man to kill the O'Hara's, whom they were ordered to protect. After coming to their senses, they realize that Bill is a cop, trying to protect them from the real hit man. Chris, Bill, and Gina decide to leave the matter for the FBI, until they get shot by an assassin named Tony, hired by his boss, and a corrupt District Attorney, whom he kills for his interference. Tony takes Gina hostage, with Chris and Bill ordering him to surrender.The film ends when Tony the hitman gets shot and killed by Chris and Bill, after he falls in the pool with Gina. Both of them are congratulated as heroes by the F.B.I. The witness and Gina also thank them, as well. Chris returns to his apartment to say goodbye to Maria, but decides she wants to marry him. Bill, meanwhile, sees both of them making love from a patrol car.","language":"English","Reception":"The film received negative reviews from critics.[1] It currently holds a 14% rating on Rotten Tomatoes based on 22 reviews.The sequel debuted at No. 9 with $5.4 million in its opening weekend.[2] It eventually grossed just $20.2 million domestically, making it a flop at the box office.","box_office":"$20,208,496","cinematography":"Roy H. Wagner","production_company":"Touchstone Pictures","directed_by":"John Badham","release_dates":"July 23, 1993 (1993-07-23)|||||","another_stakeout":"Theatrical release poster","produced_by":"Lynn Bigelow Jim Kouf Cathleen Summers","starring":"Richard Dreyfuss Emilio Estevez Rosie O'Donnell Dennis Farina Marcia Strassman","running_time":"105 minutes","music_by":"Arthur B. Rubinstein","edited_by":"Frank Morriss","written_by":"Jim Kouf","budget":"$30 million"}