{"country":"United Kingdom","distributed_by":"Anglo-Amalgamated","Plot":"Captain Crowther (Sid James) has five of his crew replaced at short notice before a new cruise voyage begins. Not only does he get the five most incompetent crew men ever to sail the seven seas, but the passengers turn out to be a rather strange bunch too.The SS Happy Wanderer is the cruise ship and after this voyage, Crowther hopes to get a job as captain on a transatlantic ship, promising the crew members their jobs will be safe under the new captain. Starting off from England, the Happy Wanderer calls at unnamed ports in Spain, Italy and North Africa before going home again.Single ladies Gladys (Liz Fraser) and Flo (Dilys Laye) take the cruise, with Flo hoping to find a husband. Bridget (Esma Cannon) is her usual dotty and entertaining self, and one unnamed passenger (Ronnie Stevens) never disembarks but always goes straight to the bar to drink, to forget an unidentified woman. The crew and passengers settle in as the ship leaves port and head chef Wilfred Haines (Lance Percival) finds out he is seasick. Mario Fabrizi makes a quick appearance as one of the cooks under Haines. Ed Devereaux, best known for the part of Matt Hammond in the Australian TV series 'Skippy', appears as a Young Officer.Gladys and Flo fall for the PT instructor Mr Jenkins but nothing comes of it, especially when Flo turns out to be hopeless in the gym. Meanwhile, the new men try to impress Crowther but disaster follows disaster with him getting knocked out and covered in food at a party.Meanwhile, ship's doctor Dr. Binn (Kenneth Connor) has fallen for Flo, but she wants nothing to do with him so he serenades her with a song after leaving Italy (Bella Marie, sung by Roberto Carinali), which she does not hear as she is asleep. Gladys, who has heard the song, realises that Flo is in love with Binn and with the help of First Officer Marjoribanks (Kenneth Williams) arranges a plot for Binn and Flo to get together. It works and the confident Binn finally confesses his feelings to a gobsmacked Flo, who returns his affections.Crowther lets the five newcomers know that they have improved since the cruise began, simply by doing their jobs and not by trying to impress him. They learn that the Captain has been in charge of the Happy Wanderer for ten years and decide to hold a surprise party for him, with the passengers. Haines bakes him a many-flavoured cake and the barman cables the former barman for the recipe of the Captain's favourite drink, the Aberdeen Angus.The party goes well and Crowther gets his telegram telling him he has the captaincy of the new ship. He turns it down as he recognises it does not have the personal touch of a cruise ship, and prefers the company of his own crew.","carry_on_cruising":"Original UK quad poster","language":"English","Reception":"The film was the 12th most popular movie at the British box office in 1962.[3]","cinematography":"Alan Hume","directed_by":"Gerald Thomas Ralph Thomas (uncredited)","Cultural Influence":"During the film, Haines, the cook gave the task of breaking a large number of eggs to bake a large cake. After the underling complained it would take a long time to complete the task, Haines asked him to place all the eggs in a large container, drop it on the ground, then strain out the egg shells. This technique, called the Haines Technique plays an important part in modern-day data processing and systems design. It describes any simple low-tech solution or method which would normally be overlooked because it is counter-intuitive.[1]Character dialog from the film was remixed in the Pogo song \"Go Out and Love Someone\".[2]","release_dates":"13 April 1962","produced_by":"Peter Rogers","starring":"Sid James Kenneth Williams Kenneth Connor Liz Fraser Dilys Laye Esma Cannon Lance Percival","running_time":"89 min.","Filming and locations":"Interiors:","music_by":"Bruce Montgomery Douglas Gamley","edited_by":"John Shirley","written_by":"Norman Hudis","budget":"£140,000"}