{"country":"United States","distributed_by":"A24","Plot":"In 1981 New York, Abel Morales (Oscar Isaac) is the owner of Standard Heating Oil Co, an up-and-coming company. The company has been plagued by the hijacking of several trucks, each carrying thousands of dollars in heating oil. One young driver, Julian (Elyes Gabel), is severely beaten when his oil truck is hijacked by two unknown assailants. Abel's wife, Anna Morales (Jessica Chastain), beseeches Abel to fight violence with violence, but Abel refuses. Morales and his company are under investigation by Assistant District Attorney Lawrence (David Oyelowo), who seems determined to expose price fixing, tax evasion, and various other illegalities committed by Morales and his competitors in the heating oil business.As a way to secure financial independence for himself and trump his competitors, Abel, with the help of his attorney, Andrew Walsh (Albert Brooks), brokers a deal with a group of Jewish Chassidim, led by Josef Mendellsohn (Jerry Adler), to purchase a fuel oil terminal on the East River. This will allow Morales' company to directly import fuel oil from barges and to store far more oil in the summertime when fuel oil prices are lower. He places a large down payment of 40% on the property with the agreement that he will close in 30 days—if he fails to do so, the Chassidim will sell the terminal to one of Morales' competitors and keep the down payment.After moving into a new home, Morales prevents what appears to be an attempted burglary, but the next day one of his daughters finds a loaded handgun dropped in the bushes by the perpetrator. Suspecting this intimidation is coming from his competitors, he begins to confront them one by one; each one denies any intimidation and theft to drive him out of business. The head of the Teamsters encourages Morales to arm his drivers with handguns and fake permits that he can secure for him. Morales refuses, believing that such a move could bring down even more heat on his operation from the authorities and potentially ruin his legitimate business connections with a bank financing his business.Returning to work after weeks of rehabilitation, Julian is again accosted by criminals, this time on the Queensboro Bridge in broad daylight. Carrying a firearm without Abel's knowledge or permission, he engages in a shootout with the hijackers, which results in the police arriving and chasing Julian and the other assailants, who all escape. This incident once again shifts Morales and his company into the spotlight of not only ADA Lawrence, but also the bank, which informs him that due to the impending criminal indictments and this unfortunate public incident, it can no longer finance his purchase of the terminal.Desperate, and needing $1.5 million to close on the property, he approaches his competition, Saul Leftkowitz and his granddaughter, who agree to give him a $500,000 loan for 20% interest and equity in the company for the term of the agreement. He manages to scrounge up another $200,000 by taking out a mortgage loan against an apartment building that he and his younger brother own together. With time winding down quickly, he intercepts a radio call for help from one of his drivers, who states his truck is being hijacked. Being nearby, he pursues the stolen truck. Eventually catching up to and attacking one of the hijackers, Morales demands to know who the mastermind is. The hijacker denies he was hired by anyone but reveals that he sold his last stolen shipment in Far Rockaway. Morales confronts one of his competitors, who has facilities in Far Rockaway, threatening to alert the federal authorities as the stolen fuel is marked. The competitor agrees to pay Morales more than $200,000 for stolen fuel oil.As Morales is getting closer to his goal of $1.5 million, he reluctantly goes to the home of Mafia-affiliated Peter Forente (Alessandro Nivola) to ask for another $600,000. Forente eventually agrees to give Morales the loan, but on very unfavorable terms. Dismayed by having to leverage his company to such a high degree in order to secure the loan, Morales approaches his wife to inform her of the situation, only to learn she has been \"skimming\" from the company for years and has placed the money into a secret account, which is enough to replace the money that Forente has agreed to loan him.Having the money he now needs, Morales and Walsh pay off his creditors and secure the terminal. As Abel, Anna, and Walsh are looking over the property, they are approached by an angry Julian carrying a gun, who blames Morales for his problems, believing that he should also be entitled to some of Morales' good fortune. Despondent by his being a wanted man, Julian commits suicide in front of Abel, Anna, and Walsh. As the police show up with ADA Lawrence to investigate the suicide, Morales expresses that the broader investigations into his firm are hurting his business, and that they should find a conclusion at some point. Lawrence agrees in general terms and suggests that this new fuel oil terminal will propel Morales' business and give him \"political influence.\" Lawrence then suggests that Morales might be able to help him with his higher aspirations. Morales claims that he has always done \"the most right thing\".","language":"English","box_office":"$12 million[3]","cinematography":"Bradford Young","production_company":"FilmNation Entertainment Participant Media","directed_by":"J. C. Chandor","release_dates":"November 6, 2014 (2014-11-06) (AFI Fest)|December 31, 2014 (2014-12-31) (United States)||||","Production":"On May 23, 2013, Deadline reported that filmmaker J. C. Chandor would write and direct A Most Violent Year, which was to begin shooting in the fall.[11] Neal Dodson and Anna Gerb co-produced the film along with FilmNation Entertainment's Glen Basner as executive producer.[11] On January 22, 2014, A24 Films acquired the US distribution rights to the film, which A24 then scheduled for release in the fourth quarter of 2014.[12] The film was co-financed by Image Nation and Participant Media, and produced by Before the Door Pictures and Washington Square Films.[8]On June 5, 2013 Javier Bardem joined the film to play the lead.[13] On July 16, 2013 Jessica Chastain joined the cast to play the lead role along with Bardem.[5] On December 3, 2013, Oscar Isaac officially replaced Bardem.[4] On January 27, 2014 Albert Brooks joined the film, playing Isaac's character's attorney,[8] and actress Catalina Sandino Moreno also joined the film in a supporting role.[9] On January 29, 2014, while the film's shooting was underway, David Oyelowo joined the cast.[7] Other cast members include Ashley Williams, Elyes Gabel, Harris Yulin, Giselle Eisenberg, and Elizabeth Marvel.[10] On February 21, 2014 Alessandro Nivola was cast to play Peter Forente, a heating oil distributor who is a competitor to Isaac’s character.[6]Principal photography began on January 29, 2014 in New York City.[7][14]The musical score for A Most Violent Year was composed by Alex Ebert, who previously collaborated with director Chandor on All Is Lost (2014).[15] Influenced musically by the culture and life of the 1980s, specifically thinking of Miami Vice and Scarface, Ebert predominantly utilized synthesizers.[16] \"It's a synthesis of sort-of calling-card themes and extended atmospheres. There’s horns and flutes and strings, but there’s also sort of these meditative synthetic beds underlying.\"[17]A soundtrack album was released by Community Music on December 16, 2014.[18]","produced_by":"J. C. Chandor Neal Dodson Anna Gerb","starring":"Oscar Isaac Jessica Chastain David Oyelowo Alessandro Nivola Albert Brooks Elyes Gabel","running_time":"125 minutes[1]","a_most_violent_year":"Theatrical release poster","music_by":"Alex Ebert","edited_by":"Ron Patane","Release":"The film had its world premiere at the AFI Fest on November 6, 2014 at the Dolby Theatre in Hollywood. The film was released in four United States theaters on December 31, 2014 by A24 Films.[19]A Most Violent Year received positive reviews, with many critics comparing Chandor's style in this film favorably to the works of Sidney Lumet, and praise given to the performances of Oscar Isaac and Jessica Chastain. On Rotten Tomatoes the film has a rating of 89%, based on 196 reviews, with an average rating of 7.7/10. The site's critical consensus reads, \"Gritty, gripping, and weighted with thought-provoking heft, A Most Violent Year represents another strong entry in writer-director J.C. Chandor's impressive filmography.\"[20] Metacritic gave the film a score of 79 out of 100, based on 44 critics, indicating \"generally favorable reviews\".[21]Business Insider's Brett Arnold wrote that the movie \"may be slow, but it's never dull.\"[22] Variety's Scott Foundas compared it to Chandor's previous film saying the movie is \"a tough, gritty, richly atmospheric thriller that lacks some of the formal razzle-dazzle of his solo seafaring epic, 'All Is Lost,' but makes up for it with an impressively sustained low-boil tension and the skillful navigating of a complex plot.\"[23] TheWrap's Alonso Duralde praised the director, proclaiming that Chandor \"firmly plants himself among this generation's great filmmakers.\"[24] Chastain was nominated for a Golden Globe.A Most Violent Year was listed on many critics' top ten lists.[25]","written_by":"J. C. Chandor","budget":"$20 million[2]"}