{"country":"United States","distributed_by":"American International","Plot":"A singer, Sugar Kane (Linda Evans), is unwittingly being used for publicity stunts for her latest album by her agent (Paul Lynde), for example, faking a skydiving stunt, actually performed by Bonnie (Deborah Walley). Meanwhile, Frankie (Frankie Avalon), (duped into thinking he rescued Sugar Kane), takes up skydiving at Bonnie's prompting; she secretly wants to make her boyfriend Steve (John Ashley) jealous. This, of course, prompts Dee Dee (Annette Funicello) to also try free-falling. Eric Von Zipper (Harvey Lembeck) and his Malibu Rat Pack bikers also show up, with Von Zipper falling madly in love with Sugar Kane. To top all this, Bonehead (Jody McCrea) falls in love with a mermaid (Marta Kristen). Eventually, Von Zipper \"puts the snatch\" on Sugar Kane. The film takes a The Perils of Pauline-like twist, with the evil South Dakota Slim (Timothy Carey) kidnapping Sugar and tying her to a buzz-saw.","language":"English","cinematography":"Floyd Crosby, ASC","directed_by":"William Asher","beach_blanket_bingo":"theatrical poster","Music":"The score for this fifth film, like the four preceding it, was composed by Les Baxter.Guy Hemric and Jerry Styner wrote seven songs for the film: “Beach Blanket Bingo” sung by Frankie Avalon and Annette Funicello with the cast; the duet “I Think You Think” performed by Avalon and Funicello; “These Are the Good Times” sung by Avalon; “It Only Hurts When I Cry” sung by Donna Loren; “Follow Your Leader” sung by Harvey Lembeck with the “Rat Pack;” and the two songs “New Love” and “Fly Boy” – both of which were sung by studio call vocalist Jackie Ward off-screen – and lip-synched by Linda Evans onscreen.Gary Usher and Roger Christian wrote three songs, “Cycle Set” and the instrumental “Freeway” - both performed by the Hondells; and “I'll Never Change Him” performed by Annette Funicello. (“I'll Never Change Him” was included in initial prints, but later excised for wide release when the decision was made to feature the song as \"We'll Never Change Them\" in Ski Party.)","release_dates":"April 14, 1965","Production":"Elsa Lanchester was originally announced for a small role off the back of her performance in Pajama Party[4] but does not appear in the final film.(This sequence can still be seen in 16mm prints and television broadcasts of Beach Blanket Bingo,[5] but the Region 1 MGM DVD omits it. See Music section below)Dell Comics published a 12 cent comic book version of Beach Blanket Bingo in conjunction with the movie's release.[7]","produced_by":"Samuel Z. Arkoff James H. Nicholson","starring":"Frankie Avalon Annette Funicello","running_time":"98 minutes","music_by":"Les Baxter","edited_by":"Eve Newman Fred R. Feitshans Jr.","written_by":"Leo Townsend Sher Townsend William Asher"}