{"country":"United States","distributed_by":"Universal Pictures","duplicity":"Theatrical release poster","Plot":"Five years ago. Ray Koval (Clive Owen), an MI6 agent, meets Claire Stenwick (Julia Roberts), a CIA agent, at a party in Dubai. He is unaware of her identity and seduces her. Claire drugs him and steals classified documents from him.Three years later in Rome. Ray and Claire meet for the first time since Dubai and spend several days together at a posh hotel. They imagine leaving their government jobs for work in an intensely competitive area in the private sector. They contemplate using their skills in intelligence to enrich themselves. After exploring possibilities over several months, including companies vying for the market in double-crust pizza, they settle on cosmetics and personal hygiene. How they will turn their positions to their advantage is unclear even to them, but they will be ready when the opportunity presents itself.Claire accepts a job in counter-intelligence at Burkett & Randle. After more than a year, Ray takes a position in intelligence at Equikrom, where he will act as the handler and Claire as one of his agents.Aware that Ray's new employer will be spying on him to assess his loyalty, he and Claire first practice how they will pretend to be meeting in New York for the first time since Dubai, reprising much of the dialog of their actual encounter in Rome. They are unaware that Claire's employers at Burkett & Randle are spying on her and hear this rehearsal, which blows her cover. Burkett & Randle CEO Howard Tully (Tom Wilkinson) decides to keep Claire in her job, even though she is a mole, and to manipulate her in his rivalry with Equikrom.Claire and Ray, working as mole and handler, reprise the dialog yet again and, as they anticipated, Ray's employer is listening in and is persuaded that Ray is loyal.Throughout the weeks that follow, Claire and Ray remain wary of one another. Both are experienced in double-dealing and despite their romantic connection and plans to escape with new identities once this operation is complete, neither is entirely free of the other's suspicion.Tully makes a speech to his intelligence team, including Claire, that paints his company as the innovator defending itself from duplicity and theft. He underscores how the unannounced new product makes vigilance even more urgent. He and others in his organization plant information that they know she and the intelligence team at Equikrom will steal as they try to understand what that \"major development\" might be.Claire provides a copy of this speech to Equikrom CEO Dick Garsik (Paul Giamatti), who plots to steal whatever Burkett & Randle has developed. His team, including Ray, devote themselves to stealing information from Burkett & Randle's offices, in the course of which Ray seduces one of their travel office employees and he and several others visit a casino in the Bahamas.Thanks to information from Ray, Claire is able to appear a hero to her employers, catching Equikrom's spying activities after the fact or preventing them in some measure in the Bahamas. Tully at Burkett & Randle pretends to be impressed, thanks Claire for successfully defending the company's new product, and he reveals to her that it is a cure for baldness. She informs Garsik at Equikrom, who leaves for a shareholders meeting in Las Vegas expecting she will obtain the chemical formula and he will announce the new development to his shareholders before Burkett & Randle goes public with the information.Excitement builds as the Equikrom team, using Claire as their principal source inside their rival's offices, succeed in acquiring a copy of the formula. Claire and Ray rendezvous at the Zürich Airport, each with a copy of the formula that they plan to sell to a Swiss company for $35 million. At the same time, Garsik tells his shareholders that they are in the final stages of testing for a product that cures baldness. The formula, the Swiss announce to Ray and Claire, is not what they think, just a harmless lotion. They in turn are disappointed, but impressed by how completely they were manipulated. They have only each other now, and a thank you bottle of champagne from Tully.","language":"English","Reception":"The film received mixed to positive reviews from film critics. Based on 178 reviews, it garnered a 64% approval rating on Rotten Tomatoes, the consensus being \"Duplicity is well-crafted, smart, and often funny, but it's mostly more cerebral than visceral and features far too many plot twists.\"[6]Film critic Roger Ebert gave the film three out of four stars and wrote, \"Duplicity is entertaining, but the complexities of its plot keep it from being really involving: When nothing is as it seems, why care?\", but admitted that \"the fun is in watching Roberts and Owen fencing with dialogue, keeping straight faces, trying to read each other's minds\".[7]In his review for The New York Observer, Andrew Sarris wrote, \"So what has gone wrong with Duplicity? I can only go with my gut feeling: that Mr. Gilroy has outsmarted himself by pulling too many switches in his narrative. He then fails to recover by coming up with a smash ending that pulls all the scattered pieces together\".[8] Scott Foundas, in his review for the Village Voice, wrote, \"Comedy seems to have liberated Gilroy, who directs Duplicity with the high gloss and fleet-footed hustle of a golden-age Hollywood craftsman. There's nary a dull stretch in its two-hour breadth\".[9]Entertainment Weekly gave the film a \"B\" rating and Lisa Schwarzbaum wrote, \"Gilroy counts on a Thin Man-style undercurrent of sexual sparring to sustain our interest in two scheming corporate operatives despite the fact that nothing much else is going on\".[10]In his review for The New York Times, A. O. Scott praised Julia Roberts' performance: \"Ms. Roberts has almost entirely left behind the coltish, America's-sweetheart mannerisms, except when she uses them strategically, to disarm or confuse. Curvier than she used to be and with a touch of weariness around her eyes and impatience in her voice, she is, at 41, unmistakably in her prime\".[11]Sukhdev Sandhu, in his review for The Daily Telegraph, wrote, \"Duplicity is really all about Roberts and Owen. They're con artists, but they don't fool us. Their pairing here feels duplicitous. Gilroy, it seems, is better at thrilling audiences than he is at seducing them\".[12] However, not all reviews were positive; Peter Travers of Rolling Stone gave the film two and a half stars out of four and said \"Gilroy and his stars make it elegant fun to be fooled, but they sure as hell make you work for it.\"[13]","box_office":"$78,146,652[1]","cinematography":"Robert Elswit","production_company":"Relativity Media","directed_by":"Tony Gilroy","Home media":"The film was released on DVD and Blu-ray Disc on August 25, 2009.","release_dates":"March 10, 2009 (2009-03-10) (London)|March 20, 2009 (2009-03-20) (United States)||||","Production":"Production on Duplicity began in New York City on March 9, 2008, and wrapped shooting on May 27 of that year. Filming locations included Paradise Island in the Bahamas for the casino shots, New York City including the West Village (Manhattan), Trafalgar Square in London and outside the Pantheon in Rome.","produced_by":"Jennifer Fox Laura Bickford","starring":"Clive Owen Julia Roberts Tom Wilkinson Paul Giamatti","running_time":"125 minutes","music_by":"James Newton Howard","edited_by":"John Gilroy","Release":"The film was released on March 19, 2009 in Australia and on March 20 in the US and the UK.[4] It had its world premiere on March 11, 2009 at London's Leicester Square.[5]","written_by":"Tony Gilroy","budget":"$60 million","Narrative Style":"The film does not present events chronologically, but moves back and forth in time to peal away layers and reveal unsuspected motivations. In one instance, the same dialog is recapitulated, but the words that are spoken in chronological sequence in Rome, a hotel room, and a bar, are presented in a different sequence: the bar, Rome, the hotel room. The audience only understands progressively when these lines represent an actual conversation and when they are being repeated, and also when they are overheard by an unsuspected audience and overheard by a suspected audience. In chronological sequence the events are still complex."}