{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"T.J.Burke tires of his auto assembly worker job in Detroit, quits, and convinces his friend Dexter Rutecki to move with him to Aspen. After succeeding in the new instructor tryouts for the Aspen Ski School, they both become ski instructors, although T.J. secretly intercedes on Dexter's behalf. While T.J. advances to become the most popular instructor of the school during the season, he has to constantly watch out for Dexter, whose social skills are less honed and whose future is less bright. Along the way, they meet the young local radio DJ (Robin) as well as a rich cougar-ish woman (Bryce) who selects the most desirable new instructor each year for her latest plaything.After watching the famous Aspen Powder 8 competition, T.J. and Dexter agree to team up to try to win the next season's award. While skiing out of bounds, T.J. falls into a large sinkhole in the snow, plunging many feet into a stream. Dexter rescues him, and because skiing out of bounds would get them fired, takes him to Robin's house so she can patch him up without notifying the ski school director.Somewhat later, after losing control of a school client (a poor skier who ends up sliding out of control into downtown Aspen), Dexter is suspended from the school and eventually links up with the wrong crowd, including Tina, a beautiful girl with a mysterious background. Hard up for cash, Dexter reluctantly accepts an offer to act as a drug courier. When he gets spooked and dumps the drugs, he is assaulted in retribution and left to freeze outdoors in the Aspen winter. Again, T.J. rescues him by paying off the drug guys, with money borrowed from Bryce. T.J. then moves out from the house he shared with Dexter, and in with Bryce, who purchased his companionship with the loan.After spending some interminable and unsatisfying time with Bryce, T.J. and Dexter awkwardly rekindle their friendship and reset their goal to win the Powder 8 competition. T.J. and Dexter decide to ski out of bounds in order to train for the upcoming event. While skiing outside the boundaries of Aspen, T.J. and Dexter set off an avalanche. Dexter suffers a tragic demise, while T.J. escapes with minor injuries. Later, in deep depression, T.J. comes to realize how his relationship with Bryce had no particular meaning, and writes of his and Dexter's friendship. The article is published in a major ski magazine, finally providing T.J. with some satisfaction for his writing efforts after many prior rejections. His friendship with Robin also reawakens, as they both mourn Dexter's loss.T.J. is sought out by a newly hired young ski instructor to be his partner in the Powder-8. They win the competition, beating T.J.'s nemesis throughout the movie. The victory is bittersweet, as he remembers the dream that he and Dexter had of winning the Powder-8, and in the end, he and Robin reconcile as he finally reveals that he loves her.","Skiing footage":"The backcountry and bowl skiing sequences were filmed at Aspen Highlands with the permission of owner Whip Jones and Alta Ski Area. Big mountain extreme skiers Scot Schmidt and Doug Coombs (and several others) are credited as (stand-in) skiers.","language":"English","Reception":"Aspen Extreme received negative reviews from critics, as it holds a 22% rating on Rotten Tomatoes.","box_office":"$8,041,049","cinematography":"Steven Fierberg Robert Primes","production_company":"Hollywood Pictures","aspen_extreme":"Theatrical release poster","directed_by":"Patrick Hasburgh","release_dates":"January 22, 1993 (1993-01-22)|||||","produced_by":"Fred T. Gallo Leonard Goldberg","starring":"Paul Gross Peter Berg Finola Hughes Teri Polo","running_time":"113 minutes","music_by":"Michael Convertino","External links":"","edited_by":"Steven Kemper","written_by":"Patrick Hasburgh","budget":"$14 million"}