{"based_on":"The Knight's Tale  by Geoffrey Chaucer","country":"United States","distributed_by":"Columbia Pictures","Plot":"At a jousting tournament in 14th-century Europe, young squires William Thatcher, Roland, and Wat discover that their master, Sir Ector, has died. If he had completed one final pass he would have won the tournament. Destitute, William wears Ector's armour to impersonate him, winning the tournament and taking the prize.Although only nobles are allowed in tournaments, William is now inspired to compete and win more prizes. Roland and Wat would rather take their share of coins and leave, but William convinces them to stay and train him to joust. Along the way to his first tournament in Rouen, the trio encounters a young Geoffrey Chaucer, who is also destitute and agrees to forge the patent of nobility that will allow William to enter under the assumed name of \"Sir Ulrich von Liechtenstein\" from Gelderland. At the tournament, William is brought before Simon the Summoner and Peter the Pardoner: Chaucer has a gambling problem and is in their debt. William demands Chaucer be released and promises payment.In the course of competition, William's armour is damaged. He goads Kate, a female blacksmith, to repair it without payment and goes on to win the sword event at the tournament. In the joust, he faces a Sir Thomas Colville, who withdraws from the tournament after being injured by William, though they exchange a ceremonial pass so that Colville can retain the honour of never having failed to complete a match. The proceedings are observed by Jocelyn, a noblewoman with whom William has become infatuated, and Count Adhemar, a rival both in the joust and for Jocelyn's heart. In the final joust of the tournament, Adhemar defeats William.Kate joins William's party and forges new lightweight armour allowing him greater mobility. In the following tournament, Adhemar and William are both assigned to tilt against Sir Thomas Colville, but they learn that he is actually Edward, the Black Prince. Adhemar withdraws, but William continues the match and then addresses the prince by name, further earning Edward's respect.Adhemar is called away to the battlefield, and William achieves several victories in his absence. William proves his love for Jocelyn by complying when she first asks him to deliberately lose (in contrast to the countless knights who promise to win in her name), and then, just before he would be eliminated, to win the tournament in her name after all.The group travels to London for the World Championship. William recalls leaving his father to squire for Sir Ector and learn to become a knight hoping to \"change his stars\". Adhemar has also arrived in London and announces that he is in negotiations with Jocelyn's father for her hand in marriage. William dominates at the tournament and he returns to visit his father, now blind and living alone in Cheapside, but is discovered by Adhemar, who alerts the authorities to William's false identity.William is placed in the pillory, but is defended from the hostile crowd by his friends. Just as the mob reaches its frenzy, Prince Edward emerges from the crowd, noting that his friends' dedication to him reflects an ability to inspire others that is in the best traditions of knighthood. In acknowledgement of William's honour, Edward announces that, William is in fact, \"beyond contestation\", descended from a noble lineage, and knights him \"Sir William\".William returns to the tournament to face Adhemar in the final match, but Adhemar cheats with an illegal sharpened lance, piercing William's shoulder and seriously injuring him. Entering the final pass, William is losing by two lances and must unhorse Adhemar to win. He demands to be stripped of his armour while Chaucer buys time by performing the introduction of William that he omitted earlier. Finally he tilts against Adhemar, with his father and Jocelyn in attendance. Bellowing his true name as he tilts, he knocks Adhemar to the ground with a crushing blow. In the ensuing celebration, as Jocelyn and William embrace, Chaucer remarks that he should write this whole story down.","language":"English","Reception":"Initially, critical reception was mixed, with complaints about the anachronisms (the classic rock in a film that takes place during the Middle Ages), the many jousting scenes, and the thin plot. Roger Ebert gave the film 3 stars out of 4 and commented that \"Some will say the movie breaks tradition by telling a medieval story with a soundtrack of classic rock. They might as well argue it breaks the rules by setting a 1970s rock opera in the Middle Ages. To them I advise: Who cares?\" and that in this film the director \"pointed out that an orchestral score would be equally anachronistic, since orchestras hadn't been invented in the 1400s.\"[7][8]Review aggregation website Rotten Tomatoes gives the film a score of 58% based on reviews from 146 critics. The site's consensus is \"Once you get past the anachronism, A Knight's Tale becomes a predictable, if spirited, Rocky on horseback.\"[9] On Metacritic, the film holds a score of 54 out of 100, sampled from 32 reviews, indicating \"mixed or average reviews\".[10]Newsweek revealed in June 2001 that print ads for at least four films released by Columbia Pictures, including A Knight's Tale and The Animal (2001), contained glowing comments from a film reviewer who did not exist.[11] The fake critic, David Manning, was created by a Columbia employee who worked in the advertising department.[11] \"Manning\" was misrepresented as a reviewer for The Ridgefield Press, a small Connecticut weekly.[11]","box_office":"$117.5 million[3]","cinematography":"Richard Greatrex","production_company":"Escape Artists","directed_by":"Brian Helgeland","a_knight's_tale":"Theatrical release poster","Music":"The film, which notionally took place during the Middle Ages, is notable for its deliberate use of classic rock songs in its soundtrack. The ten that were credited in the film are listed in order of appearance:[6]","release_dates":"May 11, 2001 (2001-05-11)|||||","Production":"The entire film was shot at the Barrandov Studios in Prague, Czech Republic.[4]The film includes a great deal of jousting footage. The initial scene of the two knights jousting is actually footage of Heath Ledger's stunt double in an accident. During filming of a later scene in the film, the lance of the stunt double's opponent moved off target and hit him in the head. The double fell to the ground unconscious. In another incident, Ledger knocked out one of director Helgeland's front teeth with a broomstick when the two were demonstrating a jousting move. It took several months for Helgeland's mouth to heal enough to repair the damage.Plenty of effort was expended creating lances that would convincingly explode upon impact without injuring the stunt riders. The body of each lance was scored so it would break easily, and the tips were made of balsa wood. Each was also hollowed out, with the holes filled with balsa splinters and uncooked linguine.[5] Jousting armour was made by Rod Vass and his company Armordillo Ltd. using a unique sprayed polyurethane system that they invented for the film Gladiator. Onscreen, it is almost impossible to distinguish between the polyurethane stunt armour and steel armour, much of which was also made by Armordillo. Heath Ledger's armour was originally made in steel along with three polyurethane stunt replicas.In the DVD commentary, director Helgeland, co-commentating with Bettany, states that the film was intended to have occurred sometime in the 1370s during a six-month period in which Chaucer had apparently gone missing and show what he might have done during this time, which Helgeland says later on in the commentary inspired Chaucer to write his Canterbury Tales. (The first Canterbury tale is The Knight's Tale. Chaucer also threatens two men he meets in the film with undying humiliation through fiction; these characters seem to have inspired the vitriolic descriptions of the Tales' Pardoner and Summoner.)The scene in which the lady Jocelyn asks William to lose a joust to prove his love and then reverses her proposal for him to suddenly win, is also a direct reference to the classic tale of Lancelot, the Knight of the Cart, in which Queen Guinevere asks Lancelot to do the same during a tournament.The script is notable for its use of epigrams.","Box office":"The film earned $56,569,702 at the North American domestic box office, and an additional $60,917,771 internationally for a worldwide total of $117,487,473.[3]","produced_by":"Todd Black|Brian Helgeland|Tim Van Rellim|","starring":"Heath Ledger|Mark Addy|Rufus Sewell|Paul Bettany|Alan Tudyk|","running_time":"132 minutes[1] 138 minutes[2] (Extended cut)","music_by":"Carter Burwell","written_by":"Brian Helgeland","budget":"$65 million[3]"}