{"directed_by":"Fred C. Brannon Yakima Canutt","Chapter titles":"Source:[1][3]","release_dates":"April 24, 1948 (1948-04-24) (U.S. serial)[1]|December 31, 1956 (1956-12-31) (U.S. re-release)[1]||||","Production":"Dangers of the Canadian Mounted was budgeted at $150,038 although the final negative cost was $150,130 (a $92, or 0.1%, overspend).[1]It was filmed between 7 October and 28 October 1947.[1] The serial's production number was 1699.[1]The special Effects were created by the Lydecker brothers.","produced_by":"M.J. Frankovich","starring":"Jim Bannon Virginia Belmont Anthony Warde Dorothy Granger Bill Van Sickel Tom Steele Dale Van Sickel","running_time":"12 chapters / 167 minutes (serial)[1] 100 minutes (TV)[1]","Synopsis":"A criminal gang discovers a Genghis Khan treasure ship on the Canada-Alaska border. However, the treasure itself is hidden on land. In their efforts to find the hidden riches, they resort to murder and sabotage to stop the construction of the Alcan highway which will bring homesteaders to the area.Sergeant Christopher 'Chris' Royal of the Royal Canadian Mounted Police and his allies battle their way to find the crooks, and to learn the identity of their mysterious leader known only as 'The Boss'.","Release":"Dangers of the Canadian Mounted's official release date is 24 April 1948, although this is actually the date the sixth chapter was made available to film exchanges.[1]This was followed by a re-release of Dick Tracy Returns instead of a new serial. The next new serial, Adventures of Frank and Jesse James, followed in the autumn.[1]The serial was re-released on 31 December 1956 between the similar re-releases of Federal Operator 99 and The Purple Monster Strikes. The last original Republic serial release was King of the Carnival in 1955.[1]Dangers of the Canadian Mounted was one of twenty-six Republic serials re-released as a film on television in 1966. The title of the film was changed to R.C.M.P. & the Treasure of Genghis Khan. This version was cut down to 100-minutes in length.[1]","written_by":"Franklin Adreon Basil Dickey Sol Shor Robert G Walker","cinematography":"John MacBurnie","budget":"$150,038 (negative cost: $150,130)[1]"}