{"country":"India","distributed_by":"Target Films Tips Industries Limited","Plot":"Dil Ka Rishta is about a young man named Jai (Arjun Rampal). He is very wealthy and supports many charities. One day, he accompanies his friend Anita (Ishaa Koppikar) to a school for the deaf. There, he meets Tia (Aishwarya Rai), a teacher, and falls in love with her. He helps her wherever he can and tries to be near her—and he believes that Tia feels something for him, too. When he finally admits his feelings, Tia reveals the existence of her fiancé Raj (Priyanshu Chatterjee) and leaves Jai. Despite being betrothed, Jai continues to pursue Tia. Tia marries Raj and they have a son named Anshu. The trio live a poor but happy life together. Jai is devastated, since several attempts to win over Tia's heart, fail. One night, being completely drunk, he drives home and causes an accident: Anita, who was with Jai in the car, dies immediately and so does Raj, who happened to be the driver of the other car. Tia herself survives but loses her memory.The doctors believe that Tia will not be able to handle the return of her memories and advise Tia's mother (Raakhee) to move her daughter to a place where nothing reminds her of her past. Jai wants to look after Tia, since he is responsible for her condition and offers to take Tia and her mother to South Africa to live with him so that she can recuperate. Tia's mother accepts for Tia's sake, though she loathes Jai for taking away her son-in-law and her daughter's memories. Tia is told that Anita was her best friend, who died in a car accident, and Anshu is Jai and Anita's son. Tia is told that Anshu loves his \"aunt\" very much and that she should look after the boy so he won't miss his mother too much.In Africa, Tia's mother realizes Tia's emerging feelings for Jai and warns him not to do anything inappropriate. Jai looks after Tia, but whenever she is trying to get close to him, he keeps his distance. Even as Jai's father (Paresh Rawal) tries to set them up, Jai refuses her—even though he loves her more than anything else. Finally Tia's mother accepts the fact that her daughter is in love with Jai and agrees so that Tia can be a mother to Anshu: they can get married. However Jai is still feeling guilty for the whole situation, Tia tried to get him to snap out of it, which leads to an altercation. Tia flees and Jai follows her. When she threatens to commit suicide Jai is forced to admit that Anshu is Tia's son, Anita was only his friend, and that her husband died in the accident as well.Jai's father, who has finally arrived with Tia's mother, explains that Jai is very much in love with Tia, but he hopes that she regains her memory and punishes him for what he did: killing her husband in the car accident. However Tia forgives Jai, telling him that the accident was her destiny, and if he had not crashed into her, someone else would have. She decides to leave Jai and takes Anshu with her. Jai stops her: He wants to be a father for Anshu, tells her that he loves her and asks her to marry him, which she accepts.","language":"Hindi","cinematography":"Ashok Mehta","production_company":"Tips Films","directed_by":"Naresh Malhotra","Soundtrack":"The music is composed by Nadeem-Shravan with lyrics by Sameer. Manish Dhamija of Planet Bollywood in his review gave the album 7 stars out of 10.[2]","release_dates":"17 January 2003 (2003-01-17)|||||","produced_by":"Aditya Rai","starring":"Arjun Rampal Aishwarya Rai Isha Koppikar Rakhee Paresh Rawal Priyanshu Chatterjee","running_time":"151 mins","music_by":"Nadeem-Shravan","edited_by":"Naresh Malhotra","written_by":"Shabbir Boxwala Vrinda Rai","budget":"1 crore"}