{"country":"Italy France","distributed_by":"Universal (Italy) International Coproductions (US)","screenplay_by":"Sauro Scavolini Gianfranco Galligaric Lina Wertmüller Sergio Sollima","story_by":"Dino Maiuri Massimo De Rita","città_violenta":"Cover of the DVD release","Plot":"The film opens with professional assassin Jeff Heston (Charles Bronson) and mistress Vanessa (Jill Ireland) pursued mercilessly while holidaying in the Virgin Islands. Jeff is shot and left for dead, while Vanessa runs off with his shooter and former business associate Coogan. After his release from prison on a framed murder charge, Jeff tracks the pair to New Orleans. However, after taking revenge on his betrayer and reuniting with Vanessa, Jeff is blackmailed by the very crime boss (Telly Savalas) who framed him, took Vanessa as his mob wife, and who is now intent on having him join his organisation.[3] When Jeff refuses, he is hunted through an unforgiving city only to discover that his real enemy is closer than he realised.","language":"English Italian","Release and reception":"The film was a commercial hit,[4] and one of Sergio Sollima's more political films, and less successful than the director's earlier Spaghetti Westerns.[5] It was released just as Bronson was emerging from his career as a character actor into a period of stardom as a leading man.[6] That transition was ultimately effected by the success of his later films for United Artists beginning in 1972, and greater fame with Paramount's Death Wish (1974), and during this era Città violenta received distribution in the United States first by International Co-Productions, and later in even wider release by UA, and retitled The Family.[4] By the time of its domestic release, UA edited some eight minutes from the Italian version. Only in recent years has this footage been restored by Anchor Bay Entertainment for DVD issue. In a review of the 2008 DVD release, Slant Magazine singled out the opening car chase sequence for praise, claiming that it almost outdoes those of Bullitt and The French Connection \"by staging its engine-revving, pedestrian-dodging antics not on the wide streets of American cities but, rather, the narrow, winding pathways (and, in one case, staircases) of a Caribbean island.\"[3]","cinematography":"Aldo Tonti","production_company":"Unidis Fono Roma Universal France","directed_by":"Sergio Sollima","release_dates":"17 September 1970 (1970-09-17)|||||","produced_by":"Arrigo Colombo Giorgio Papi","starring":"Charles Bronson Jill Ireland Telly Savalas Umberto Orsini Michel Constantin","running_time":"100 minutes","Influence":"Danish film director, Nicholas Winding Refn has cited Violent City as one his favorite Italian genre films.[7]American film director Quentin Tarantino used samples from the film's Ennio Morricone score in his 2012 film Django Unchained. [8]","music_by":"Ennio Morricone","edited_by":"Nino Baragli"}