{"based_on":"A Summer Place  by Sloan Wilson","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Delmer Daves","Plot":"Alcoholic Bart Hunter (Arthur Kennedy), his long-suffering wife Sylvia (Dorothy McGuire), and their teenage son Johnny (Troy Donahue) operate a crumbling inn on Pine Island off the Maine coast. The inn was previously Bart's elegant family mansion in an exclusive resort, but as his family fortunes have dwindled, the Hunters are forced to rent rooms to paying guests, even going so far as to move themselves into the small guest house so their own master bedroom suite can be rented out. Bart receives a reservation request from an old acquaintance, Ken Jorgenson, who was a lowly lifeguard on the island twenty years ago, but is now a successful research chemist and millionaire. Ken wants to bring his wife and daughter to the island for the summer. Bart dislikes Ken and feels that Ken is just coming to lord his new wealthy status over Bart, who is no longer rich. Bart nearly refuses the request, but Sylvia insists that he accept because they badly need the money.Ken (Richard Egan) arrives with his wife Helen (Constance Ford) and teenage daughter Molly (Sandra Dee). Helen and Ken have an unhappy marriage, sleep in separate bedrooms, and frequently argue, including over the proper behavior standards for their daughter. Helen is a prude who disapproves of Molly's developing figure and healthy interest in boys, particularly Johnny Hunter, who is also attracted to Molly. Ken is much more relaxed and permissive, and tries to teach his daughter that her natural desires are not shameful. Helen also tries unsuccessfully to put on airs and impress the upper class residents of the island, while Ken is not interested in pretense and is even happy to talk with older people who remember him from when he worked as a lifeguard.As it turns out, Ken and Sylvia were lovers twenty years ago, when they were teenagers. It soon becomes apparent that they still love each other and have missed each other for many years, and that Ken returned to Pine Island in hopes of seeing Sylvia again. They had broken up because Ken was a poor college student, while Bart was the son of a rich established family, so Sylvia married Bart, and Ken, after seeing Sylvia's wedding announcement in the newspaper, married Helen. Both marriages were unhappy but Ken and Sylvia stayed in them because of their love for their respective children, Molly and Johnny. Ken and Sylvia find themselves drawn to each other again and begin secretly meeting every night. They are soon spotted by the island's night watchman, who informs Helen. Helen initially keeps quiet, planning to catch them in the act in order to ensure a large divorce settlement.Ken goes on a business trip for a weekend, during which time Molly and Johnny, with Ken's permission, go sailing around the island. Their boat capsizes in rough water, stranding them on the beach overnight. The Coast Guard rescues them the next day, but Helen is suspicious that the teenagers were intimate on the beach although they deny it. Helen sends for a doctor to examine Molly to make sure she is still a virgin (which she is) and Molly becomes hysterical and runs away, causing Johnny to threaten to kill Helen if she hurts Molly ever again. Helen contacts law enforcement and then in a fit of anger reveals Sylvia and Ken's affair in front of Bart, Ken, Sylvia and Johnny. The Hunters and Jorgensons each go through an acrimonious public divorce, and Molly and Johnny are sent to boarding schools several states apart. Molly and Johnny are angry at Ken and Sylvia and stop speaking to them, becoming increasingly dependent on each other for emotional support despite Helen's constant interference and criticism of Molly's morals.Ken and Sylvia eventually marry and move into a beach house. They talk Molly and Johnny into visiting them there, to which the teenagers agree largely because it will give them a chance to be together away from Helen, who is unable to prevent the visit due to a court order. During their visit, Molly and Johnny secretly consummate their love. Ken and Sylvia suspect that the teenagers are sleeping together and are concerned about the possible ill effects, but in view of their own past teenage history, feel they cannot order Molly and Johnny to stop loving each other. Soon after, Molly discovers she is pregnant, and she and John run away together planning to get married. They seek Bart's blessing, but he is about to be admitted to the veterans' hospital due to ulcers from his drinking, and drunkenly tries to talk them out of marriage, later calling Helen to let her know what happened. The local justice of the peace sees they are under legal age to marry, and turns them down. In desperation, Molly and Johnny go to the house of Ken and Sylvia, who are supportive. In the end, a happy John and Molly, just married, return to Pine Island for their honeymoon.","In popular culture":"The film is part of a plot point in the Barry Levinson 1982 film Diner. Set in 1959, the character \"Boogie\" and several of his friends attend a movie theater showing of A Summer Place, where Boogie plays a sexual prank on his date as Molly and Johnny kiss onscreen.","language":"English","Release and reception":"The movie became popular after its release but had a mixed critical reception.[citation needed] Rotten Tomatoes sampled 6 reviewers and judged 83% of the reviews to be positive.[4]","a_summer_place":"Film poster","cinematography":"Harry Stradling","directed_by":"Delmer Daves","release_dates":"November 18, 1959 (1959-11-18) (United States)|||||","Production":"The movie was shot in Pacific Grove and around the Monterey Peninsula.[3] Sloan Wilson wrote the first screenplay, which covered the 22-year span of the novel. Delmer Daves focused the new draft on one year. Daves said:I have two kids who are just about the same age of these two in A Summer Place and I know how difficult communication between generations can be. And while this may sound corny, it can be assisted by love and understanding. Amid some rather tempestuous social activities, this is what we are trying to demonstrate. That there are two affairs may sound sensational but that's not the point. We have received the approval of the Johnstone office because the intent of the picture is a moral one. Frankness and impatience will help pull the cork on a situation blocked by intolerance. What we are trying to do is dramatise that pulling of the cork.[3]Some exterior and interior scenes involving Ken and Sylvia's beach house were filmed at Frank Lloyd Wright's Clinton Walker House, built in 1948. In the film, Sylvia tells Molly that Wright designed the house, ostensibly located on the East Coast near the movie's \"Pine Island\" location (since Molly and Johnny drive from Pine Island to the house after being sent away by the justice of the peace). In reality, Walker House is located on the beach side of Scenic Road on Monterey Bay in Carmel, California. The real house has only one level, although in the movie, the house is depicted as if it has a lower level at the same level as the beach.","starring":"Richard Egan|Dorothy McGuire|Troy Donahue|Sandra Dee|","running_time":"130 minutes[1]","\"Theme from A Summer Place\"":"The 1960 instrumental hit \"Theme from A Summer Place\", composed by Max Steiner, was used in the film as a secondary musical theme (not the main title theme) for scenes featuring Molly and Johnny. The version used in the film was recorded by Hugo Winterhalter. It was later arranged and recorded by Percy Faith and performed by his orchestra, enriching and improving on the original. In 1960, the Percy Faith version reached Number One on the Billboard Hot 100 chart for nine consecutive weeks, a record at that time.[2] The theme has been covered in instrumental or vocal versions by numerous other artists, including The Lettermen, Andy Williams, Cliff Richard, Julie London, Billy Vaughn, Joanie Sommers and The Ventures, and has been featured in many other films and television programs.","music_by":"Max Steiner","edited_by":"Owen Marks"}