{"country":"India Switzerland","distributed_by":"Trimurti Films","Plot":"Captain Adit Arya (Arjun Rampal) is a special agent of the Indian army. The Indian president Veer Pratap Singh (Mohan Agashe) is kidnapped by Rafiq Mabroz (Shawar Ali) in exchange for cash rewarded by renowned terrorist Youssan Baksh (Mukesh Rishi) and General Ansari (Milind Gunaji). Adit is sent undercover to rescue the president and his daughter, Kinjal (Dipannita Sharma).The mission is coded \"Asambhav\". Adit poses as a journalist for Indiatimes and makes his way to Switzerland with the help of a RAW agent called Atul Bhatnagar (Jameel Khan). On the flight, Adit meets Alisha (Priyanka Chopra). Alisha is a singer and has come to Switzerland to do a show with Sam Hans (Naseeruddin Shah). Her friend Shilpa (Chitrita Sharma) accompanies her. However, the people whom Alisha and Shilpa have come to Switzerland with are drug smugglers. Shilpa is murdered when she finds this out, and Alisha pretends she knows nothing but meets Adit for help. Adit and Alisha fall in love.Adit links events from Shilpa's murder to the president's kidnapping and sees that Sam Hans, General Ansari, Youssan Baksh and Rafiq Mabroz are involved together. Hans' friend Ranjit Parmar (Yashpal Sharma), of the Indian embassy, checks files of Switzerland and learns Rafiq Mabroz is a terrorist. He informs Hans, and Hans decides to fight ISI. However, he signs a deal with ISI by kidnapping the president from Youssan Baksh and returning the president to Baksh in exchange offor 50 million pounds.Parmar suspects someone at the Indian embassy is a traitor helping terrorists. He finds out that Ms. Brar (Tora Khasgir) is a traitor. He informs ambassador G.L. Sarin (Sharat Saxena) and is knocked out by Mabroz. Parmar awakes to discover that Ms. Brar and Sarin are both traitors and are associates of Mabroz. Mabroz kills Parmar, and Sarin leaves a suicide note beside Parmar. Capt. Arya and Bhatnagar find Parmar dead by the note, but Arya reveals that the ambassador is the traitor because of his head-stamp on the suicide note. Arya tries to finish Sarin, but Brar calls the police to get Arya and the ambassadors arrested. Arya shows the police his army card while Sarin and Brar flee. Arya chases them, and Gazi (Chetan Hansraj) tries to attack Arya. Arya runs after Gazi and is attacked by ISI agents and Youssan's men in a fort. They try to kill Arya, but Arya fires back and kills all of them, including Gazi.Adit reaches Youssan's headquarters, to free the president. He kills General Ansari and all of Youssan's men. Youssan takes the president and flees. Adit chases him. Sam has captured Alisha and Kinjal but is stopped by Ambassador Sarin, who has Hans' friend Brian as captive. Hans gives money to free Brian, but Sarin kills Brian. Hans kills Mabroz's men. Ms. Brar and Volga (Anupama Verma) chase Alisha and Kinjal near a helicopter but kill each other in crossfire. Sarin tries to finish Hans, but Hans kills him to avenge the death of Brian.Youssan tries to kill the president, but Adit kills Youssan and saves him. Mabroz tries to shoot Adit, but Adit kills him. In the end, Adit meets Sam, who confesses sins he committed but promises to improve; so they become friends after being arch rivals throughout the Mission Asambhav. Adit goes back to India with his girlfriend Alisha, Kinjal, the president and Atul Bhatnagar.","language":"Hindi","asambhav":"Movie poster for Asambhav","box_office":"₹50 million (US$740,000)[1]","cinematography":"Sukumar Jatania","directed_by":"Rajiv Rai","Soundtrack":"The soundtrack of Asambhav was recorded in 2003. It was composed by Viju Shah. It was released by the Tips Music Films label on 26 May 2004. The lyrics were written by Sameer and Remo D'Souza was the choreographer of the music sequences. The soundtrack was released on 26 May 2004.The soundtrack consisted of eleven tracks including five songs, five instrumental versions and a special 'Asambhav Theme'. The director Rajiv Rai and the supporting actor Naseeruddin Shah also sang in the movie. They performed the song 'Raatein Badi Hain'.[25]The soundtrack received mixed to negative reviews. Shahid Khan of Planet Bollywood rated it 7 out of 10 stars. He wrote \"Viju Shah´s \"Asambhav\" might not exactly win the award for the best soundtrack of the year but there are some pretty darn good tunes here.\"[25] Runaq Kotecha of Glamsham wrote \"The music of Asambhav once again confirms that Viju Shah is certainly one of the best composers that we have when it comes to delivering expeditious racy tracks with ultra modern electronic beats. However, in the midst of all the upbeat technology and heavy duty musical instruments, the tunes seem to be taking a back seat.\"[26] Aira of SmasHits wrote \"Music of 'Asambhav' is only mediocre. If heard in isolation the music lovers will probably be interested in the techno bit of the entire album.\"[27]","release_dates":"23 July 2004","Production":"Rajiv Rai is well known for directing hit films in the action thriller genre including Yudh (1985), Tridev (1989), Vishwatma (1992), Mohra (1994) and Gupt (1997) under the banner of his father Gulshan Rai's production company Trimurti Films. All did well at the box office and were huge successes, establishing Rai as a well acclaimed director.[6] After his five successes in action movies, Rai directed a romance film for the first time titled Pyaar Ishq Aur Mohabbat and the newcomer Arjun Rampal was cast in the movie, who had filmed Ashok Mehta's Moksha. However, Pyaar Ishq Aur Mohabbat was released before Moksha and was billed as Rampal's debut movie. Rampal received critical acclaim for his performance.[citation needed]In 2002, Rai planned to shift to action thriller genre after Pyaar Ishq Aur Mohabbat. In an interview with Filmfare Online, Rai said \"I listened to several people's opinions. I made the film ('PIAM') not on intuition and belief but on marketing strategies and counsels from trade persons insisting that love stories were the trend of the day.\"[7] In that same year, Rai started his new project with a comeback to action genre and titled it Asambhav.[8]After planning Asambhav, Rai signed Arjun Rampal as the hero of the movie as Rampal had worked as the hero of Rai's previous directorial venture Pyaar Ishq Aur Mohabbat. Aishwarya Rai was signed as the heroine.[9] Rampal and Rai were in Dil Ka Rishta that released on 17 January 2003 and Asambhav marked their second pairing. However, Rai backed out in 2003 and Priyanka Chopra was cast in as the female lead.[10]Naseeruddin Shah was roped in to essay the role of the villain as he had worked with Rai as a hero in Tridev and as a villain in Mohra. Shah had earned critical acclaim for his villainous performance in Rai's Mohra and had earned a nomination for the prestigious Filmfare Award for Best Performance in a Negative Role at the 40th Filmfare Awards.[11][12] Noticing on Shah's previous success in a negative role, Rai cast him as the villain in his latest action thriller.[13][14] The total cast was of 55 artists including model turned actress Dipannita Sharma, Tom Alter and Sharat Saxena among others.[5]During the music launch, Rajiv Rai was interviewed on casting models in important roles. He said, \"I wanted a very western look to the film; I wanted it to look stylish. I have roped in many models because I wanted my film to look fresh and stylish. Models have a lot of exposure, they are very confident in front of the camera. There are a lot of fresh faces coming into acting. I wanted fresh faces for my film. The modeling industry can act. It's not fair to pinpoint. Arjun (Rampal) himself was a model.\"[15]After the casting was finalised, Rajiv Rai flew to Switzerland and the film was shot in Ticino. He began filming in June 2003 with a schedule of 57 days. It was filmed in multi-camera setup. While most scenes were shot with four cameras, the action sequences consisted of seven camera units. It was the first Indian action film to feature no stunts. The action sequences were digitally shot. Asambhav was the first Indian film to be graded digitally on Luster.[5] Filming was completed in September 2003.[4] It was the first Indian movie to be shot in that location, in the longest filming schedule of any Indian film unit in Switzerland. Asambhav was digitised and no duplicates were used in its development.[15]Asambhav was launched in March 2004. The soundtrack was composed by Viju Shah and it was launched in Mumbai on 26 May 2004.[15][16]","Box office":"Created on a very high budget, Asambhav became an average grosser at the box office. It collected ₹80,632,076 rupees in the opening weekend from all over the country. The earning in the following week was it ₹100,507,694 in the second week and ₹220,731,569 in the third week. It grossed a total of ₹500,113,339.[23] As a result, it was declared an average grosser.[24] Asambhav grossed ₹43.0 million (US$640,000) from India in 2004 with a nett of ₹34 million (US$510,000). The estimated net rate was ₹69.8 million (US$1.0 million) and the estimated gross was ₹98.8 million (US$1.5 million)[1]Asambhav was an average in overseas as well. The film collected US$19,504 in the United States. In the United Kingdom, the film hit fifteen screens in the first weekend of 23 July and collected £16,894. In the second weekend of 30 July, the screens were reduced to fourteen. Asambhav collected £2,142 and grossed a total of £30,311 in the first two weekends. It was declared an average grosser.[23]","produced_by":"Gulshan Rai","starring":"Arjun Rampal Priyanka Chopra","running_time":"149 minutes","music_by":"Viju Shah","Release":"Asambhav was released on 23 July 2004 to limited cinema houses but became a average grosser.[1]Asambhav received mixed reviews from critics upon release. Ronjita Kulkarni of Rediff wrote \"Asambhav, starring Arjun Rampal and Priyanka Chopra, is a good film. It packs in the done-to-death Pak-bashing content, and reduces Pakistanis and Afghans to caricatures.\"[20] Prema K. of Bollyvista wrote \"The film grip the audience even in a single reel. The songs flow freely. Viju Shah too seems to have lost his touch! The cinematography is good, in fact, the only real good thing about the film. Arjun Rampal is good but the role does not offer him much scope. Priyanka Chopra is reduced to a glamour piece. The model brigade serves as mere sidekicks. Talented actors like Naseeruddin Shah, and Arif Zakaria have been positive.\" Taran Adarsh of Bollywood Hungama gave a rating of 3.5 out of 5 stars and gave positive reviews. He wrote \"On the whole, ASAMBHAV is a medium film in all respects. At the box-office, its chances of hit movie asambhav [impossible].\"[17] Shahid Khan of Planet Bollywood gave a rating of 8 out of 10 stars. He wrote \"Rajiv Rai's direction is uninspired. Therefore, his \"Asambhav\" ends up looking tired and dragged out.\"[18]Nitika Desai of Apun Ka Choice gave a rating of 3 out of 5 stars. She wrote \"'Asambhav' is a film that sticks to the beaten and worn-out Bollywood stereotypes. Over-dramatic dialogues, deliberately forced songs and inflated action sequences make it quite a predictable and stodgy fare.\"[19] Subhash K. Jha of IANS wrote \"Asambhav is arguably the only mainstream film ever with no mother-figure on the hectic horizon. But absence of melodrama cannot in itself be a virtue unless it is compounded by a moist quality in the overall design of storytelling.\"[21]Pankaj Shukla of SmasHits praised the movie but criticised the casting. He wrote \"The film in totality is not boring. It not only entertains but also makes value for the money, as the labor done by the director is quite visible on the screen. It is only the casting of the film that has gone haywire.\"[22]","written_by":"Rajiv Rai"}