{"directed_by":"Peter Buslov","boomer":"Boomer film poster","release_dates":"2 August 2003 (Russia)","Plot":"The film takes place in Moscow and surrounding small-town areas in 1998 and 1999. Four friends – Kostya (Konstantin) 'Kot' ('Tomcat'), Dimon (Dmitry) 'Oshparenny' ('Scalded'), Lyokha (Alexey) 'Killa' ('Killer'), and Petya (Peter) 'Rama' ('Frame') – find themselves pursued by both the mob and the police after a carjacking incident involving Dimon leads to an altercation that results in Lyokha accidentally killing an undercover law enforcement officer. The four men drive out of a Moscow in a black BMW 750IL that was earlier stolen by Dimon and Petya, intending to hide out at a country house (dacha) belonging to a mutual friend. On the way, they receive a coded communication via a radio station call that an ambush is awaiting them at the dacha.The friends change their plans and decide to drive farther into the countryside, toward the house of Kostya's old friend Slon. On the way to find Slon, the men find themselves in a succession of situations, including an altercation with a gang at a gas station, a fight with a group of truck drivers, a run-in with corrupt cops, and an interaction with a village psychic, among others.The film ends tragically when the four friends get into an argument with one another and decide, as one final act, to rob a local computer store. Their goal is to split the money and then go their separate ways. The robbery does not go as planned. In the ensuing shoot-out with local police, Lyokha and Petya are killed. Dimon, who was supposed to be the getaway driver, takes off without the others, deciding that trying to help would be too risky. He left the car in a wooded area and starts to walk away, as the final music starts to play it is Kostya's phone which dropped underneath the seat. Kostya is wounded as he tries to flee and is detained.","Development":"At the beginning of the film, it can be seen that the BMW which is being stolen belongs to a Latvian or that the scene is actually meant to happen in Latvia, since the car has improvised 'LV' car license-plates on it. An alternative explanation is that the car was not legally imported into Russia and was being driven with Latvian plates to avoid customs duties.Some scenes of the film were filmed in the town of Zvenigorod.The musical theme of the film is the ringtone of Kostya's cell phone.","produced_by":"Sergei Chliyants","starring":"Vladimir Vdovichenkov Andrei Merzlikin","running_time":"110 min.","language":"Russian","Sequel":"In 2006 was released a sequel, Bummer: Film Vtoroy, Directed by Peter Buslov and written by Kim Belov, Peter Buslov, Denis Rodimin and Ivan Vyrypaev The film proved to be commercially successful, taking in nearly US$14,000,000 at the box office, even though it didn't have the same positive reviews as the first one. In the same year was released a computer game, titled Bummer: Torn Towers.","written_by":"Peter Buslov Denis Rodimin","budget":"US$700,000"}