{"country":"South Korea United States","distributed_by":"Showbox (Korea) Freestyle Releasing (U.S)","Plot":"The story follows the adventures of Ethan Kendrick, charged in his childhood by Jack to protect the Yuh Yi Joo, an individual born able to change an Imoogi into a Celestial Dragon. To this end, Jack gives Ethan a medallion formerly belonging to Haram and reveals that the Yuh Yi Joo is Sarah, whom Ethan will find in Los Angeles.15 years after this revelation, a corrupt Imugi identified as \"Buraki\" invades the city, bent on capturing Sarah; whereupon Ethan, now a televised-news anchor, rescues her, conveys the knowledge of her purpose, and attempts to save her from Buraki. During the resulting chase, Buraki's \"Artox Army\" enters the city and engages the United States Army, the United States Air Force, and the Los Angeles Police Department in battle. Here, the Atrox Army is shown to consist of black-armored, humanoid warriors; theropod-like cavalry called \"Shaconnes\"; small, winged Western dragons called \"Bulcos\"; and immense, slow-moving reptiles carrying rocket-launchers on their backs, identified in the dialogue as \"Dawdlers\". Despite losses, this army overwhelms the human forces, while Ethan and Sarah escape. They are subsequently captured by the Bulcos and taken to a menacing fortress in the midst of a darkened desert landscape. There, Ethan's medallion destroys the Artox Army; but Buraki attempts to consume Sarah, whereupon he is attacked by the Good Imugi. The two Imoogi, good and evil, engage each other in a duel that Buraki appears to win after seemingly snapping the Good Imoogi's neck. Having won the fight, Buraki again approaches Sarah; but having offered herself to him, she instead gives her power to the Good Imoogi who had just revived, who thereupon becomes the Celestial Dragon, continuing the duel until it finally destroys Buraki.After Buraki is destroyed, Sarah dissolves into a spirit form, and the Celestial Dragon permits Sarah to speak to Ethan, whom she promises to \"love...for all eternity\"; then withdraws Sarah into his body and ascends to the heavens. Immediately, Jack appears behind Ethan reminding him that the two of them \"have been given a great honor\" to take part in this transformation, and vanishes; presumably never to be seen again. After whispering \"Goodbye old man\", Ethan walks away into the desert.","d-war":"Theatrical release poster","language":"English Korean","Reception":"The film received mostly negative reviews upon release in the U.S. and was not screened in advance for many critics. Up to 22 September 2014, 29% of the review aggregator Rotten Tomatoes critics gave the film positive reviews, based on 35 reviews,[4] while the film scored a 33 out of 100 at Metacritic.[5] Derek Elley of Variety, reviewing it at the Berlin Film Festival's market section, called it \"visually entertaining, and superior to helmer Shim Hyung-rae's last monster movie (Yonggary in 1999)\", while also saying the film had a \"Z-grade, irony-free script,\" and \"likely to end up the most expensive cult movie on DVD.\"[6] The Hollywood Reporter's Frank Scheck said, \"the CGI effects are undeniably impressive\" but that \"the laughable story line, risible dialogue and cheap humor ... seriously detract from the fun.\"[7] Luke Y. Thompson in L.A. Weekly derided the film as one \"for connaisseurs of the 'totally preposterous crap' school of fantasy cinema... You know who you are: You have all the Warlock sequels on Laserdisc [and] the complete Leprechaun series on DVD\" and says it's \"funnier when it tries to be serious than when it goes for the gag.\"[8]Within nine days of its South Korean release, D-War attracted five million viewers, setting a national box office record for an opening week.[citation needed] The seemingly positive reaction from the Korean population, as indicated by the movie's box office success in Korea, was widely attributed to the film's appeal to Korean nationalism;[9] a logical impression drawn from Shim's message at the end of the Korean version of this film, \"D-War and I will succeed in the world market without fail,\" accompanied by the Korean folk anthem, \"Arirang.\" However, despite box office success, D-Wars was far from critically acclaimed by either Korean critics or Korea's general public. Korean film critic Kim Bong-sok said, \"They want it to be successful in the U.S. because it's Korean, not because it's good\" and called the film \"immature and poorly made\" and \"below criticism\". Other reactions from Korean critics have been similar.[9][10]D-War set a record of grossing US$20.3 million in South Korea in its first five days of release. As of 1 September, the film has grossed US$44 million in Korea and another US$10 million in other countries, totaling a worldwide gross of US$54 million as of 16 September. In North America, the film grossed US$5 million on 2,275 screens in its opening weekend. As of 25 November 2007, the film has grossed US$10,977,721 in North America,[11] making it the highest-grossing Korean-made film released theatrically in North America.Since then, D-War has been released theatrically in Malaysia and China, both with moderate critical reaction. China was the only one to live up to the South Korean release record, spawning 3,000,000 admissions and a premiere including pop idol Libing Chen. The movie was a box office failure in Japan.","box_office":"$99,108,998","cinematography":"Hubert Taczanowski","directed_by":"Shim Hyung-rae","narrated_by":"Roberta Farkas (uncredited)","release_dates":"20 May 2007 (2007-05-20) (Cannes)|14 September 2007 (2007-09-014) (South Korea)|7 December 2007 (2007-012-07) (United States)|||","Production":"Originally titled Dragon Wars (and still referred to by this title in publicity material), D-War has a long production history in South Korea. The film was announced in 2002 by director Shim Hyung-rae as his follow-up project to 1999's Yonggary. A show reel appeared in early 2003[citation needed], displaying the extensive amount of CGI used to create the various creatures. Despite heavy promotion via posters, press releases, and videos, principal photography did not begin until October 2004, continuing through December.[citation needed] The budget was set at 30 million won (approximately US$33 million),[2] but ultimately went over budget in order to create the various creatures in the film, with some outside estimation as high as $US75 million dollars. The DVD release confirmed that it did indeed cost US$75 million.[1]As with Yonggary, Shim opted for a mostly American cast. Veteran actor Robert Forster landed a pivotal role and Jason Behr and Amanda Brooks were cast as the two young leads.The next three years were spent creating the creature effects, all of which were done in house by Shim's Younggu-Art Movies company. The completed film premiered at the American Film Market in early 2007. The film was released in South Korea on 1 August 2007. In the U.S., the film was released on 14 September 2007.On 7 August 2007, South Korea's Munhwa Broadcasting Corporation (MBC) Morning Live TV Show broadcast the film's final scene on TV without the permission of the studio, causing a controversy. A few days later the Ministry of Culture and Tourism released a statement in which they said that the incident did not violate South Korean copyright laws.[3]","produced_by":"James B. Kang","starring":"Jason Behr Amanda Brooks Robert Forster Chris Mulkey Elizabeth Pena","running_time":"90 minutes","Sequel":"Shim Hyung-rae will return to direct the sequel D-War: Mysteries of the Dragon,[12] which begins filming in May 2015.[13]","music_by":"Steve Jablonsky","edited_by":"Timothy Alverson","written_by":"Shim Hyung-rae Nick Alvers (uncredited)","budget":"$32 million[1]"}