{"based_on":"Born Yesterday 1946 play  by Garson Kanin","country":"United States","distributed_by":"Columbia Pictures","born_yesterday":"original film poster","Plot":"Uncouth tycoon Harry Brock (Broderick Crawford) goes to Washington, D.C. with his brassy girlfriend, Emma \"Billie\" Dawn (Judy Holliday), and his crooked lawyer, Jim Devery (Howard St. John), to \"influence\" a politician or two. The lawyer also presses Harry to marry Billie on the grounds that a wife cannot be forced to testify against her husband.Harry becomes disgusted with Billie's ignorance and lack of manners (though he himself is much worse). He hires a tutor for her -- journalist Paul Verrall (William Holden). Blossoming under Paul's encouragement and her own hard work, Billie learns about literature, history, politics and the law, and turns out to be much smarter than anybody knew. She begins to think for herself and apply her reading and learning to her life situation. The two begin to fall in love.Meanwhile, Devery has persuaded Harry to sign over many of his assets to Billie to hide them from the government. When Harry needs to get them back, he comes into conflict with Billie's new-found independence. She and Paul use her leverage to escape from Harry's domination. She promises to give him back his property little by little as long as he leaves them alone. Billie and Paul marry.","language":"English","box_office":"$4.15 million (US rentals)[1]","Remake":"A new version of Born Yesterday was released in 1993, starring Melanie Griffith, Don Johnson and John Goodman.","cinematography":"Joseph Walker","directed_by":"George Cukor","Awards and honors":"The film was nominated for five Academy Awards, with Judy Holliday winning the Academy Award for Best Actress. The other nominations were for Best Costume Design - Black-and-White, Best Director, Best Picture and Best Writing - Screenplay.Holliday also won the Golden Globe Award for Best Motion Picture Actress - Musical or Comedy, and was nominated for Best Motion Picture Actress - Drama. The film received Golden Globe nominations for Best Motion Picture - Drama, and Best Motion Picture Director (Cukor).The film was nominated for the Venice Film Festival Golden Lion Award, and the Writers Guild of America Best Written American Comedy Award (Mannheimer). In addition, Holliday received a Jussi Award, the primary film award in Finland for Best Foreign Actress.The British film magazine Picturegoer awarded the film its Seal of Merit, but warned its readers that Holliday's character is \"from New York's East Side, and speaks in a baby Bronx voice that is like the tinkling of many tiny, tuneless cymbals.\" The magazine admired Holliday's performance and spoke of her in the same breath as Carole Lombard.American Film Institute recognition","release_dates":"December 26, 1950 (1950-12-26)|||||","produced_by":"S. Sylvan Simon","starring":"Judy Holliday Broderick Crawford William Holden","running_time":"103 minutes","music_by":"Frederick Hollander","edited_by":"Charles Nelson","written_by":"Albert Mannheimer Garson Kanin (uncredited)"}