{"based_on":"Characters created  by John Requa Glenn Ficarra","country":"United States Australia","distributed_by":"Warner Bros. Pictures","screenplay_by":"Ron J. Friedman Steve Bencich","Plot":"At a satellite base in Northern Germany, a worker named Freidrich, who is delivering secret codes finds a Cocker Spaniel puppy outside his office. He takes the puppy inside and shows it to his Bloodhound Rex. Rex senses that something is wrong with the dog and barks at it, making the worker take him outside. Both get locked out of the office. Rex looks through the window and sees the puppy taking pictures of the secret codes and revealing itself to be an evil female hairless Sphynx cat named Kitty Galore in disguise. Rex turns out to be a dog agent and reports to HQ.Meanwhile, at a car dealership in San Francisco, the mascot Crazy Carlito goes a bit too crazy and plans to blow up the dealership building with people inside it. The cops arrive, and a police officer named Shane Larson and his police dog Diggs go to stop Carlito. Diggs sneaks up behind Carlito and bites him, causing him to drop the remote control he was using to blow up the building. Diggs catches the remote control in his mouth but accidentally presses the button with his teeth, causing the explosives on the building to detonate. The people in the building escape and Carlito is arrested. Butch and Lou, now a fully grown Beagle and the head of D.O.G. HQ, watch Diggs blowing up the car dealership. Lou wants to recruit Diggs as an agent, but Butch disagrees. Lou tells Butch that because Diggs is trained and he hates cats he is exactly the thing they need to defeat Kitty Galore.Diggs, meanwhile, is locked up in the kennels by Shane because of the risk of Diggs causing any more incidents. When Shane goes away, Butch comes in through the floor and explains to Diggs Lou's idea to recruit him as an agent and takes him to D.O.G. HQ. After tracking down a pigeon named Seamus with valuable information, Diggs and Butch meet a M.E.O.W.S. (Mousers Enforcing Our World's Safety) agent named Catherine who was after Seamus for the same reason the dogs were. Catherine reveals to Diggs that Kitty Galore was a former M.E.O.W.S. agent named Ivana Clawyu who, while on a mission at a cosmetics factory, was chased by a guard dog and fell into a vat of hair removal gel, causing her to lose all her fur. Unrecognized and humiliated by her fellow agents, Kitty left M.E.O.W.S. and returned to her human home only to be kicked out. Afterward, she vows revenge on humans and dogs.After bringing Catherine to HQ, Lou and Tab Lazenby, the head of M.E.O.W.S, form an alliance to take down Kitty Galore much to Diggs's dismay. Diggs was jealous of Catherine for having better gadgets while he got nothing. At a cat lady's home, they discover the middle-cat who was Mr. Tinkles former aid, Calico, has been sending parts of stolen technology to Kitty using other pigeons that work for her. The team's attempt to eavesdrop fails when Diggs gives away their position and tries to attack Calico, who then attempts to drown them in cat litter; due to some quick thinking they eventually manage to escape. Afterwards, they interrogate Calico as to Kitty's whereabouts, but he claims that he doesn't know where she is because the pigeon couriers are flying the stolen technology to a secret location.The group travels to Alcatraz where Mr. Tinkles is currently a mental patient. They try to get him to tell him Kitty Galore's whereabouts, but he only gives them one clue: A cat's eye reveals everything. When Kitty Galore learns about the cats and dogs working together, she hires two mercenaries named Angus and Duncan MacDougall to respectively attempt to assassinate Seamus on the boat returning from the prison. Diggs subdues Angus and accidentally throws him overboard. Fed up with Diggs ruining the mission, Butch votes him off the team and leaves with Seamus to find clues.Catherine takes Diggs to her home. She learns that the reason why Diggs never follows orders is because his past experiences have caused him to believe that he cannot trust anyone except himself, which led to him spending the majority of his life in kennels. She tells Diggs if he continues to think in this way, no one will able to help him. With that said, Diggs realizes how stupid he has been. Catherine takes Diggs to M.E.O.W.S. HQ, where they learn that Kitty is hiding at a fairground with her new master, an amateur magician named Chuck the Magnificent.Not long after arriving, Diggs and Catherine are captured by Kitty Galore and her henchcat, Paws. Butch and Seamus are alerted of Diggs and Catherine's capture. Back at the fairground, Kitty reveals to Diggs and Catherine that she plots to transmit \"The Call of the Wild\" via an orbiting satellite which only dogs can hear through televisions, radios and cellphones to cause them to act hostile towards their humans. They will then be left alone and unwanted in kennels. Diggs and Catherine however escape and meet up with Butch and Seamus. Kitty uses the roof of the fairground's flying swings ride for a satellite dish. Diggs, Butch, Catherine and Seamus arrive. Seamus presses a red button, thinking it is a shutdown button, but it instead loads the \"Call of the Wild\" signal. Dogs around the world start acting insane in their homes. Paws battles them, revealing he is a robot in the process. Diggs tricks Paws into biting the wires, destroying the satellite. Kitty's pet mouse, Scrumptious, fed up with Kitty's abuse towards him, fires her away. Kitty lands in the magician's hat with the humans thinking it was a stunt and gets tied in cotton candy, while Diggs and the others escape.After the mission, Diggs goes to live with Shane before returning to H.Q. to learn that Mr. Tinkles has escaped from prison with Calico and hacked their systems, so Diggs, Butch, Catherine, Seamus and Lou go to stop him.In a post credits-scene, Mr. Tinkles is sitting on a chair in the beach saying to the audience that why they look to him.","language":"English","Reception":"Cats & Dogs: The Revenge of Kitty Galore earned $4,225,000 on opening day, and $12,279,363 on its opening weekend reaching #5 at the box office and having a $3,314 average from a very wide 3,705 theaters. In its second weekend, its drop was very similar to the first movie, retreating 44% to $6,902,116 to 7th place and lifting its total to $26,428,266 in 2 weeks. It held better in its third weekend, dropping 39% to $4,190,426 and remaining in the Top 10. The film closed on October 21, 2010 after 84 days of release, earning $43,585,753 domestically. Produced on an $85 million budget, the movie is considered a huge box office bomb, as it grossed less than half of the first Cats & Dogs, but it did manage to do better business than fellow summer talking animal competition Marmaduke. It earned an additional $69 million overseas for a worldwide total of $112.5 million. During its initial American theatre release, the film was preceded by the new 3D animated short film titled Coyote Falls with Wile E. Coyote and Road Runner.[3]Cats & Dogs: The Revenge of Kitty Galore received almost universally negative reviews. Review aggregate Rotten Tomatoes reports that 14% of 94 critics have given the film positive reviews, with an average score of 3.6/10.[4] The critical consensus is: \"Dull and unfunny, this inexplicable sequel offers little more than the spectacle of digitally rendered talking animals with celebrity voices.\"[4] Another review aggregate, Metacritic, calculated a score of 30/100 based on 22 reviews, indicating \"generally unfavorable reviews\".[5] Joe Leydon of Variety wrote a positive-leaning review towards the film which reads \"Nine years after Cats & Dogs fetched more than $200 million worldwide with its comic take on interspecies animosity, Warners is unleashing Cats & Dogs: The Revenge of Kitty Galore, a faster, funnier follow-up in which CGI-enhanced canines and felines effect a temporary truce to combat a common enemy.\"[6] Critics cited the plot as recycled. Scott Tobias of The A.V. Club negatively reviewed the film's plot saying \"it’s still about a feline plot for world domination, and the slobbering secret agents who stand in the way.\"[7] The film was nominated for a Golden Raspberry Award for \"Worst Eye-Gouging Misuse of 3D\", but it lost to The Last Airbender.","box_office":"$112.5 million","cinematography":"Steven Poster","production_company":"Village Roadshow Pictures Mad Chance Polymorphic Pictures","directed_by":"Brad Peyton","Home media":"The DVD, Blu-ray, and 3D Blu-ray copies of Cats & Dogs: The Revenge of Kitty Galore were released on November 16, 2010.[10]","cats_&_dogs:_the_revenge_of_kitty_galore":"Theatrical release poster","Video game":"A video game was developed by 505 Games and it was released on July 20, 2010 for the Nintendo DS. It is called Cats and Dogs: The Revenge of Kitty Galore after the movie with the same name.[9]","Soundtrack":"TBA","release_dates":"July 30, 2010 (2010-07-30)|||||","produced_by":"Andrew Lazar Polly Johnsen Greg Michael Brent O'Connor","starring":"James Marsden Nick Nolte Christina Applegate Katt Williams Bette Midler Roger Moore Neil Patrick Harris Chris O'Donnell Jack McBrayer Sean Hayes Michael Clarke Duncan Wallace Shawn","running_time":"82 minutes","music_by":"Christopher Lennertz Theme song: Shirley Bassey","edited_by":"Julie Rogers","budget":"$85 million[1]"}