{"based_on":"What? Dead...Again?  by Neil B. Shulman","country":"United States","Box office and reception":"Doc Hollywood debuted at number three in the U.S. box office.[3][4][5]The film was met with positive reviews,[6][7][8] with a 74% approval rating on Rotten Tomatoes, based on 31 reviews.[9]","distributed_by":"Warner Bros. Pictures","Plot":"Dr. Benjamin Stone is a promising young surgeon working in Washington, D.C. with plans of making more money working for a Beverly Hills plastic surgeon. On his last day, he realizes that none of his colleagues care enough about him to say good-bye to him, instead leaving him a cake with an insult made out of icing.Driving out west in a 1956 Porsche 356 Speedster, Stone swerves to miss a cow on the highway and crashes uncontrollably into the fence of a local resident in the rural hamlet of Grady, South Carolina. The resident is local Judge Evans, who sentences him to community service at the nearby hospital as punishment rather than allow Stone pay for the fence with cash. Defeated and stranded due to the damage to his car, Ben reports to the local clinic, where Nurse Packer further humbles him by recording his community service hours by clocking him in and out, like a factory worker.Though upset, Ben makes friends with Mayor Nick Nicholson, who is also the owner of the town's cafe, and Melvin, the local mechanic tasked with repairing his car. Ben soon finds the clinic work is more laid-back than the emergency room to which he is used with simple cases, such as spots before the eyes of an elderly patient not cleaning her glasses, fishing hook impaling and even reading mail for a young illiterate couple, Kyle and Mary Owens, whose baby he later delivers.The small-town experience soon humbles Ben when he misdiagnoses a young boy as having mitral valve regurgitation leading to late cyanosis, a case the town's curmudgeonly doctor, Aurelius Hogue, treats with a Coca-Cola. Hogue explains that the boy had chewed his father's tobacco and was given too much bismuth subnitrate as an antacid, causing a blue tinge; the carbonic acid component of the soda would relieve his stomach ache. The two finally bond when Ben saves Hogue after he suffers a near-fatal heart attack. Since Hogue is eager to retire, Ben is urged by the locals to stay and replace him, although he is tempted by his budding romance with a tomboyish ambulance driver, Vialula, better known as \"Lou,\" a single mother to a four-year-old named Emma. Ben soon confides to her that he grew up in a small town in rural Indiana, where his parents lived and died, and how he can't see himself confined to a small town.Lou is also pursued by Hank Gordon, a local insurance salesman. He waits for Ben at the mayor's lakeside lodge, where Ben has been staying. Ben expects a fight, but Hank explains that though he can't give Lou what Ben can, he's still a better man for her. After the two men talk, Ben comes to realize he's not selfless enough for a life with Lou and plans to not see her anymore. Ben is soon pardoned from community service for saving Hogue, allowing him to head to California for his job interview. With his car fixed, he tries to sneak out of town, but his departure is delayed when he finds Kyle and Mary Owens stranded by the side of the road with Mary in deep labor. While he's delivering their baby, a tractor trailer smashes into his Porsche and he must leave town without it: the entire town comes to see him off in a taxi.On the West Coast, Ben's new boss, Dr. Halberstrom, hires him at the interview, based on an unexpected recommendation from Hogue. However, Ben soon tires of the superficiality of Beverly Hills, even going so far as calling to check the weather in Grady on his phone. The next day, he's surprised to receive a message at work from a woman with a \"heavy Southern accent\" and rushes to a restaurant, where he noticed his restored Porsche in the parking lot. Nancy Lee, the mayor's daughter, and Hank have come to California, and Hank tells Ben he took his own advice to \"do what a man's gotta do.\" Ben returns to Grady, hoping to patch things up with Lou, who takes him back.","language":"English","Cars plagiarism":"The makers of the Disney/Pixar film Cars have been accused of plagiarizing its plot from this film. \"Many reviewers also felt that Cars' plot was too indebted to the 1991 Michael J Fox comedy Doc Hollywood, in which a hotshot Los Angeles doctor learns a new set of values when he is stranded in an average American town. 'It just rips off Doc Hollywood, almost note for note,' said Christy Lemire of the San Francisco Chronicle.\"[10] Critic Simon Kinnear of Total Film concurred, stating \"Actually, this one pretty much is just 'Doc Hollywood with cars.'\"[11]","box_office":"$54,830,779","cinematography":"Michael Chapman","directed_by":"Michael Caton-Jones","Soundtrack":"The film's soundtrack features the Chesney Hawkes song \"The One and Only\", which reached number 10 on the Billboard Hot 100 singles chart.[2]","release_dates":"August 2, 1991","produced_by":"Deborah D. Johnson Susan Solt","starring":"Michael J. Fox|Julie Warner|Barnard Hughes|Woody Harrelson|David Ogden Stiers|Frances Sternhagen|Bridget Fonda|","running_time":"104 minutes","doc_hollywood":"Theatrical release poster","music_by":"Carter Burwell","edited_by":"Priscilla Nedd-Friendly","written_by":"Jeffrey Price and Peter S. Seaman Daniel Pyne","budget":"$17 million"}