{"based_on":"Nathalie...  by Anne Fontaine","country":"United States Canada France","distributed_by":"Sony Pictures Classics (USA theatrical) E1 Entertainment (Canada) StudioCanal (France)","screenplay_by":"Erin Cressida Wilson","Plot":"In a voice-over, Chloe discusses her business as a call girl. Catherine is a gynecologist and her husband David is a college professor. Catherine suspects David of having an affair after she sees a cell-phone picture of him with a female student.Catherine stops by the hotel bar where Chloe waits for clients, telling Chloe that she wants to hire her to test David's loyalty. Chloe later tells Catherine that David asked her if he could kiss her, which he did. Catherine is angered but insists that Chloe meet with David again.Over the next few days, Catherine and Chloe meet multiple times, and Chloe describes in explicit detail her encounters with David, which arouses Catherine during one meeting; Chloe kisses Catherine, and Catherine, surprised by this, abruptly leaves. Later, when meeting with David at a get-together, she is taken aback by his awareness of the scent of her lotion; it is the same lotion that Chloe wears. Upset by this, Catherine leaves and meets with Chloe at a hotel; she asks Chloe to show her how David touches her, then has sex with her.When Catherine arrives home later than usual, David asks her if she has been unfaithful. Catherine tells him she thinks he has been unfaithful as well, and the two argue, stopping after being interrupted by their son, Michael.Catherine meets with Chloe and calls off their relationship but later asks her to meet her at a coffee house frequented by David. While there, she demands that David admit that he is having an affair. Chloe walks in, and David does not recognize her. Chloe leaves quickly, and Catherine realizes that Chloe made up her encounters with David.David admits that he has fantasized about other women, and expects Catherine to make a similar admission. When she does not, David becomes agitated. Catherine then confesses her sexual encounter with Chloe. She apologizes, saying that she felt she became invisible to David as she aged, while David became more attractive to her, and that this got in the way of their sex life. The couple reconciles.Chloe goes to Catherine and David's house and has sex with Michael in their bed. Catherine interrupts them. Chloe tells Catherine that she is in love with her. She threatens to hurt Catherine with her hair pin.Catherine asks Chloe what she wants. Chloe requests a kiss, and Catherine complies. Michael sees, startling Catherine and causing her to push Chloe into the bedroom window. Chloe manages to grab hold of the frame, but she intentionally lets go and falls to her death. Sometime later, Catherine attends Michael's graduation party, and wears Chloe's hairpin in her hair.","language":"English","Critical reception":"The film opened in 350 theaters to mixed reviews; on review aggregator website Rotten Tomatoes, Chloe holds a 51% approval rating based on 151 reviews, with a rating average of 5.8/10. The site's consensus is that \"Despite its promising pedigree and a titillating premise, Chloe ultimately fails to deliver the heat — or the thrills — expected of a sexual thriller.\"[22] Metacritic, which assigns a normalized score from major reviewers, gave the film a 48 out of 100, based on 33 reviews, indicating \"Mixed or average reviews.\"[4]Roger Ebert of the Chicago Sun-Times gave the film 3.5 out of 4 stars,[23] while Elizabeth Weitzman of New York Daily News gave the film 1 out of 5 stars.","box_office":"$11,702,642 (worldwide)[3]","cinematography":"Paul Sarossy","production_company":"The Montecito Picture Company StudioCanal[1]","directed_by":"Atom Egoyan","release_dates":"September 13, 2009 (2009-09-13) (TIFF)|March 26, 2010 (2010-03-26) (United States)||||","chloe":"US release poster","produced_by":"Jason Reitman Ivan Reitman Tom Pollock Jennifer Weiss Simone Urdl","starring":"Julianne Moore Liam Neeson Amanda Seyfried","running_time":"96 minutes","Financing and distribution":"StudioCanal fully financed Chloe, which had already made its $20 million budget back via international pre-sales.[13][14] In 2009, the film received award nominations from London Film Festival, San Sebastián International Film Festival, and Toronto International Film Festival under the category of Film Presented.[15]Sony Pictures Worldwide Acquisitions Group paid a low seven-figure sum to acquire the United States distribution rights of Chloe,[13][16] and the group opened this film in limited theatrical release in the United States on March 26, 2010 through Sony Pictures Classics.[17] In the United States, this film grossed $3 million theatrically and became one of the higher-grossing specialty films in 2010[18] (according to Variety, \"$3 million is the new $10 million\" for specialty films' box office in 2010[19]).In the wake of Chloe, Egoyan had since received many scripts of erotic thrillers.[20] Amanda Seyfried's performance in this film also helped her to gain industry acclaim and become considered for more roles.[21]Chloe was released in the United States on July 13, 2010 in both DVD and Blu-ray Disc. The disc includes an audio commentary, making-of featurette, and deleted scenes.Several months following the DVD/Blu-ray release of Chloe, Atom Egoyan said that Chloe had made more money than any of his previous films.[5]","music_by":"Mychael Danna","edited_by":"Susan Shipton","budget":"$12-14 million[2]"}