{"country":"United States","deck_the_halls":"Theatrical release poster","distributed_by":"20th Century Fox","Plot":"Local optometrist and Christmas expert Steve Finch (Matthew Broderick) wants his kids to have a great Christmas, packed with Steve's tried and true traditions, such as using an advent calendar, taking Christmas card pictures in matching sweaters, and getting a large tree. At night, he hears noises. He looks out his window and sees a moving truck. He and his wife, Kelly (Kristin Davis), immediately know that \"the new neighbors are moving in.\" In the morning, when Steve goes to get his paper, he is startled to see someone on his doorstep, stealing the paper, which causes him to spill coffee on himself. It is his new neighbor, Buddy Hall (Danny DeVito), a car salesman. Steve and Kelly also meet Buddy's wife, Tia (Kristin Chenoweth).Later that day, Kelly, her daughter, Madison (Alia Shawkat), and son, Carter (Dylan Blue), go to the Hall house, where they meet their teenage twin daughters, Ashley (Sabrina Aldridge) and Emily (Kelly Aldridge). Tia and Kelly immediately become friends, as do Ashley, Emily, and Madison. That night, the twins discover a website called MyEarth, which shows satellite images of any place from space (seemingly a parody of Google Earth). Their house is not visible, so Buddy decides to make it so using Christmas lights. Due to that, he becomes known around town. Steve is not happy about this as he is considered \"the Christmas guy\" and is chairman of the town's WinterFest. Buddy also purchases a large horse drawn sleigh, and finds horses to pull it.The Finches come to see the sleigh, and are invited to take their Christmas card pictures in the sleigh. Steve declines, but Carter enters it anyway. In an attempt to get him \"out of that death trap\" Steve frightens the horses, who pull him around town, finally plunging into a frozen river. He wakes up to find himself naked, zipped into a sleeping bag with Buddy, who is also naked. Buddy explains that he is giving Steve body heat in order to keep him from dying. He then starts screaming. Buddy's house is eventually completely lit, and synchronized to music. Steve has had enough with being kept awake each night, and finally fills Buddy's fuse box with snow. His plan is foiled, due to a backup generator.Buddy and Steve make a bet: if Steve beats Buddy in the WinterFest speedskating race, then Buddy removes the lights, and if Buddy beats Steve, he buys a car from Buddy. Buddy wins, and Steve yells at him for being a nobody, since his is still not visible from space. Steve finally buys a large amount of fireworks and a large illegal military grade rocket from a gangster and tries to blow up the Hall house. The rocket misfires, and sets the Finch house on fire. Kelly, Madison, Carter, Tia, Ashley, and Emily all decide to stay at a motel to salvage tChristmas. Steve and Buddy forget their rivalry, and build a winter wonderland with all of Buddy's lights and lure Tia, Kelly, and the kids home. They all sit down to a nice meal.Soon, the whole town helps put Buddy's lights back up in time for a story about them on MTV. They don't work, and everyone sings carols and uses their cell phones as flashlights. As they sing, Carter notices that one of the plugs is not plugged in properly, which explains why the lights do not work. He tightly plugs it in, causing the lights to shine brightly through the night. SuChin Pak (played by herself), who is doing the MTV report, gets confirmation that the house is indeed visible from space. The crowd celebrates as the film ends.","language":"English","Reception":"The film received negative reviews from critics. On Rotten Tomatoes it has a rating of 6%, based on 82 reviews, with an average rating of 3.5/10. The site's critical consensus reads, \"Relying on flat humor and a preposterous plot, Deck the Halls is an unnecessarily mean-spirited holiday movie that does little to put viewers in a holiday mood.\" On Metacritic it has a rating of 28 out of 100, based on 22 critics, indicating \"generally unfavorable reviews\".Roger Moore of the Orlando Sentinel named it \"A leaden slice of fruitcake, with about as much nutritional value,\" and concluding that \"it's not worth working up a good hate over\". Stephen Hunter remarked \"I literally didn't count a single laugh in the whole aimless schlep,\" and suggested that the film should've been named Dreck the Halls instead. Michael Medved named it the \"Worst Movie of 2006.\" Finally, Richard Roeper, co-host of the television show Ebert & Roeper, wrote:\"You cannot believe how excruciatingly awful this movie is. It is bad in a way that will cause unfortunate viewers to huddle in the lobby afterward, hugging in small groups, consoling one another with the knowledge that it's over, it's over -- thank God, it's over. [...] Compared to the honest hard labor performed by tens of millions of Americans every day, a film critic's job is like a winning lottery ticket. But there IS work involved, and it can be painful -- and the next time someone tells me I have the best job in the world, I'm going to grab them by the ear, fourth-grade-teacher-in-1966-style, and drag them to see Deck the Halls.\"The film was nominated for three Golden Raspberry Awards:The film grossed $35.1 million in North America and $12.1 million in other territories for a total of $47.2 million, against a budget of $51 million.[1]The film grossed $12 million in its opening weekend, finishing 4th at the box office.","box_office":"$47.2 million","cinematography":"Mark Irwin","production_company":"Regency Enterprises","directed_by":"John Whitesell","Production notes":"The film was originally entitled All Lit Up, and while it was set in the United States, it was shot in Ocean Park, Surrey and other locations throughout Metro Vancouver.In the scene in which Steve and Buddy are in a speedskating race, Matthew Broderick had to train with a real speedskater for a few months before he could film that scene. He trained at Chelsea Piers in New York (they rented out an entire rink).[verification needed]","release_dates":"November 22, 2006 (2006-11-22)","produced_by":"Arnon Milchan Michael Costigan John Whitesell","starring":"Danny DeVito Matthew Broderick Kristin Davis Kristin Chenoweth","running_time":"93 minutes","music_by":"George S. Clinton","edited_by":"Paul Hirsch","written_by":"Matt Corman Chris Ord Don Rhymer","budget":"$51 million"}