{"country":"China France Taiwan","distributed_by":"Sony Pictures Classics (United States)","beijing_bicycle_十七岁的单车":"Cover art for Beijing Bicycle","Plot":"Guei (played by Cui Lin) is a seventeen-year-old country boy who came to Beijing to make a living.[3] Along with a number of other boys from the country, Guei finds employment with a courier company, which assigns them brand-new bicycles for use in their deliveries. The company manager (Xie Jian) announces to them that since the bicycles do not yet belong to them, they will only earn twenty percent of the commission. But once they have made enough deliveries to earn the bicycles, their share will be raised to fifty percent. Within two months Guei has made enough to earn his bicycle. However, on the day that Guei is due to take over the ownership, the bicycle is stolen while he is picking up a document. The manager fires Guei for neglecting to deliver the package, but, upon the latter's pleas, agrees to take him back if he succeeds in recovering his bicycle.At the other end of the city, Jian (Li Bin) is a seventeen-year-old schoolboy who longs for a bicycle of his own so he can ride with Xiao (Gao Yuanyuan), the girl he fancies.[4] His hopes are dashed when his father (Zhao Yiwei) delays buying a bicycle for him yet again so that his younger stepsister Rong Rong (Zhou Fanfei) can go to a prestigious school. This frustrates Jian, who steals some money from his family and pays 500 yuan to a second-hand dealer for a bicycle—the one that used to belong to Guei.Meanwhile, the stubborn Guei embarks on a search for his bicycle. By chance, his friend Mantis (Liu Lei) spots Jian with the bicycle. Guei tries to make off with the bicycle but is stopped by Jian and his gang of schoolboys. The determined Guei follows Jian home and steals back the bicycle from where Jian hides it. The manager keeps his promise and takes Guei back. However, when Guei shows up at the courier company on another day, he finds Jian and his gang waiting for him. He tries to escape but the gang chases him down and, after giving him a beating, forcibly re-takes the bicycle.When Jian returns home, he finds his father waiting for him at the door, along with Guei. Thinking that his son was the bicycle thief, the enraged father gives Jian a rapping and lets Guei take his bicycle. However, Jian and his gang track down Guei again the next day and after long hours of negotiation, the two sides reach a pact: Guei and Jian are to share the bicycle, each entitled to the use of it on alternate days. This arrangement persists for some days until Jian finds out that Xiao has fallen for Da Huan (Li Shuang), a bicycle freestylist. Jian hits his rival with a brick and rides off.At their usual meeting place, Jian hands the bicycle to Guei and tells the latter that he does not need it any more. Meanwhile, Da Huan, along with his gang, comes after Jian on their bikes. Jian and Guei make off together but are cornered by Da Huan and his gang, who give both of them a serious beating. As the gang leaves, one member stays behind to wreck Guei's bicycle. In a rare burst of rage, Guei picks up a brick and smashes the head of his attacker, who collapses. Carrying his battered bicycle on his shoulder, Guei walks back alone.","language":"Mandarin","Themes":"According to Elizabeth Wright of Senses of Cinema, the juxtaposition of Guei and Jian, in particular their contrasting relation to the bicycle, highlights their differences in social standing and status. Guei is a new migrant who has come to the city with hopes for better income. On the other hand, Jian comes from an upwardly motivated city family concerned with providing the children with good education. The bicycle grants Jian status among his peers and impresses Xiao, the girl he fancies. To Guei, the bicycle, besides being a tool of the trade, is also a symbol of status and pride. It symbolises his participation and success in the city and makes him less of an outsider. Director Wang Xiaoshuai depicts both the new face of Beijing's youth through Jian and alludes to the disillusion of migrants from the country through Guei.In a secondary plot, Guei and Mantis spend their free time observing Qin, a young attractive girl living in a large house and owning a large number of clothes. They believe Qin is a rich city girl but notice that she does not seem happy or content with her material possession. Later, they find out that Qin is in fact a housemaid, also from the country, who likes to dress herself in her employer's clothes when she is home alone. According to Wright, Guei and Mantis's misconception of the Qin's social status is \"an obvious indictment on the beguiling nature of surface images and material possessions\".","Reception":"Beijing Bicycle premiered on 17 February 2001, during the Berlin International Film Festival. The film clinched the Jury Grand Prix Silver Bear Award and its two young lead actors, Cui Lin and Li Bin, were bestowed the \"New Talent Award\". The film was released in cinemas in the United States on 11 January 2002 and over its 24 days on screen, earned a meager US$66,131 in box office.[6] Many reviewers see Beijing Bicycle as having similar themes as Vittorio De Sica's 1948 classic Bicycle Thieves.[7][8][9][10]The film board of the Chinese State Administration of Radio, Film, and Television decided to ban the screening of Beijing Bicycle in China after the film was sent to the Berlin International Film Festival without first acquiring the board's approval. According to director Wang Xiaoshuai, he did submit the film for examination and the film board gave some suggestions for revision. However, he abandoned the efforts for a license, fearing that the revision process would not finish in time for the festival. The ban was eventually lifted in 2004, with eight modifications to the film and a truncated title of Bicycle.[2]","cinematography":"Liu Jie","directed_by":"Wang Xiaoshuai","release_dates":"17 February 2001 (Berlin International Film Festival)","produced_by":"Peggy Chiao Hsu Hsiao-Ming Han Sanping Arc Light Films","starring":"Cui Lin Li Bin Zhou Xun Gao Yuanyuan Li Shuang","running_time":"113 min.","music_by":"Wang Feng","edited_by":"Liao Ching-Song","Release":"Beijing Bicycle was released on DVD on 9 July 2002 and distributed by Sony Pictures Classics in the United States. The DVD features subtitles in English.","written_by":"Wang Xiaoshuai Tang Danian Peggy Chiao Hsu Hsiao-Ming"}