{"based_on":"Characters  by Mark Brown","country":"United States","distributed_by":"Metro-Goldwyn-Mayer Warner Bros. Pictures","Plot":"Calvin, Eddie and the rest of the gang must work together to save their shop and their neighborhood from trigger-happy gang members that roam the streets.","barbershop:_the_next_cut":"Theatrical release poster","language":"English","Reception":"In the United States and Canada, pre-release tracking suggested the film would gross $26–30 million from 2,661 theaters in its opening weekend, trailing fellow newcomer The Jungle Book ($67–75 million projection) but besting Criminal ($9–12 million projection).[12] It made $735,000 from Thursday night previews and $7 million on its first day. It went on to gross $20.2 million in its opening weekend, finishing below expectations and second at the box office behind The Jungle Book ($103.6 million).[13]Barbershop: The Next Cut has received positive reviews from critics. On Rotten Tomatoes, the film has a rating of 90%, based on 82 reviews, with an average rating of 6.8/10. The site's critical consensus reads, \"Heartfelt, thought-provoking, and above all funny, Barbershop: The Next Cut is the rare belated sequel that more than lives up to the standard set by its predecessors.\"[14] On Metacritic, the film has a score of 67 out of 100, based on 30 critics, indicating \"generally favorable reviews\".[15] Audiences polled by CinemaScore gave the film an average grade of \"A–\" on an A+ to F scale.[16]","box_office":"$54.9 million[3]","cinematography":"Greg Gardiner","directed_by":"Malcolm D. Lee","production_companies":"New Line Cinema Cube Vision","release_dates":"April 6, 2016 (2016-04-06) (Los Angeles)|April 15, 2016 (2016-04-15) (United States)||||","Production":"On March 26, 2014, Deadline.com reported that MGM was in negotiations with Ice Cube to produce a third Barbershop film.[6] On February 19, 2015, Malcolm D. Lee was set to direct the third film, while Ice Cube and Cedric the Entertainer were in talks to join the film.[7] On March 25, 2015, New Line Cinema signed on with MGM to release the film, while MGM would handle the production.[8] Principal photography began in Atlanta, Georgia on May 11, 2015.[9][10] On November 14, 2015, director Malcolm D. Lee said in an interview at the 7th Annual Governors Award ceremony that the title of the film had been changed from Barbershop 3 to Barbershop: The Next Cut.[11]","produced_by":"Ice Cube|Robert Teitel|George Tillman, Jr.|","starring":"Ice Cube|Cedric the Entertainer|Regina Hall|Anthony Anderson|Eve|J. B. Smoove|Lamorne Morris|Sean Patrick Thomas|Tyga|Deon Cole|Common|Nicki Minaj|","running_time":"111 minutes[1]","music_by":"Stanley Clarke","edited_by":"Paul Millspaugh","Release":"The film was originally scheduled for release on February 19, 2016, but was pushed back to April 15, 2016.","written_by":"Kenya Barris|Tracy Oliver|","budget":"$20 million[2]"}