{"original_language(s)":"English","Plot summary":"The opening titles of each episode are prefaced by a television interview in which Professor Ernst Reinhart (Esmond Knight) looks back on the events of the serial.Britain, 1970 – a new radio telescope, designed by the young scientists John Fleming (Peter Halliday) and Dennis Bridger (Frank Windsor) under the supervision of Professor Reinhart (Esmond Knight), has been built at Bouldershaw Fell. Shortly before its official opening, the telescope picks up a signal from the distant Andromeda Nebula. Examining the signal, Fleming realises that the signal is a computer program.Fleming is permitted to use the computer facilities at the London Institute of Electronics, where he is aided by Christine (Julie Christie). Using the computer to decode the message, Fleming realises that the message contains a set of instructions for the construction of another more advanced computer. The message also contains another programme for the computer to run, and data to process. Bridger meanwhile, has sold out to an international conglomerate called Intel, represented by the sinister Kaufmann (John Hollis). The British government decides to build the computer at a military establishment at Thorness in Scotland. The computer is switched on and begins to output its first set of instructions.The team at Thorness is joined by the biologist Madeline Dawnay (Mary Morris). The computer is outputting instructions for the creation of living cells. Fleming becomes nervous, worried that whatever life-form they are creating may not have humanity's best interests at heart. Dawney proceeds with the experiment, however, synthesising a primitive protoplasmic life-form. In the meantime, Bridger's leaking of Thorness' secrets has been discovered. Bridger is confronted by Ministry of Defence agent Judy Adamson (Patricia Kneale); fleeing he tumbles over a cliff to his death.It is now 1971 and the protoplasmic lifeform, now nicknamed \"Cyclops\" on account of its giant eye, continues to grow. Fleming has become ever more sceptical about the project, certain that the computer has its own agenda. He comes to realise that two terminals positioned either side of the computer's main display have the ability to affect the brainwaves of those who stand near it. His warnings are not heeded, however, and Christine, mesmerised by Cyclops and by the machine, is compelled to grasp the two terminals – she falls to the floor, killed by a massive electric shock.Following Christine's death, the computer outputs a new set of instructions – this time for the creation of a complete human embryo. Fleming is horrified and demands that it be killed. He is ignored. The embryo rapidly grows to maturity; everyone is stunned when it is revealed to be a clone of the deceased Christine. The creature – which they name \"Andromeda\" – quickly learns to communicate and is brought before the computer. The computer, realising its instructions have been carried out, destroys Cyclops as it has been superseded by Andromeda.Andromeda is put to work developing a program to enable Britain to intercept orbital missiles which a foreign power is firing over British airspace as a demonstration of power. Using the missiles designed by Andromeda, they are successful in destroying one of the missiles. The Government is now determined to make full use of Andromeda, not just for defence but also to aid industry. Fleming continues to make trouble and has his access to the computer revoked. He is horrified to discover that the Government has made a trade deal with Kaufmann and Intel for the rights to a new enzyme that Andromeda has developed that heals injured cells. By this stage, Dawnay is also beginning to have doubts about Andromeda – she agrees to aid Fleming by entering a program into the computer to convince it Andromeda is dead. The program is quickly discovered and reversed by Andromeda. However, the computer soon exacts its revenge – it corrupts the formula for the enzyme, making Dawnay and her assistants sick.It is 1972 and the message from the Andromeda Nebula has stopped transmitting. Fleming has been able to determine the correct formula to counteract the effects of the enzyme and save Dawnay. Fleming, Dawnay, Reinhart, and Judy now agree that Andromeda must be stopped – however, the military now have control over the project. Andromeda tries to kill Fleming but fails; she confesses to Fleming that she is a slave of the computer, which is working to take over humanity. Fleming gains entry to the computer room where he takes an axe to the machine, destroying it. Now free of the machine Andromeda is able to access the safe that contains the copies of the original message with the instructions for building the computer which she burns so that the machine cannot be rebuilt. She flees with Fleming to one of the islands near the base. Pursued by soldiers, they hide in a series of caves on the island. However, Andromeda is apparently killed when she falls into a deep pool. The dejected Fleming is brought back to Thorness by the soldiers.","Background":"Fred Hoyle was a noted astronomer, best known for his work on the understanding of the creation of the elements through stellar nucleosynthesis, for developing the steady state theory of the universe and for coining the term \"Big Bang\" for the steady state theory's rival dynamic evolving model of the universe.[1] Hoyle also had a taste for science fiction, having written a novel, The Black Cloud (1957), about a cloud of interstellar gas that threatens the Earth; this was adapted for radio and broadcast on 14 December 1957 by the BBC Home Service.[2] The BBC were also interested in adapting The Black Cloud for television but Hoyle had already signed away the movie rights.[2] Hoyle followed The Black Cloud with another science fiction novel, Ossian's Ride (1958); this attracted the interest of Norman James, a BBC designer keen to move into television production, who contacted Hoyle with a view to obtaining the rights to the novel.[2] In discussion with the writer, James learned that Hoyle was interested in writing an original story for television.[2] James contacted John Elliot, the assistant head of the BBC Script Department, who was interested in making a science fiction serial.[2] Elliot, along with James and BBC script editor Donald Bull, met with Hoyle who outlined a potential story for an eight-part serial; this was what would eventually become A for Andromeda. Hoyle drew his inspiration for the serial from the work of astronomer Frank Drake who at that time had begun \"Project Ozma\", one of the first experiments in the Search for Extra-Terrestrial Intelligence (SETI).[3] In late June 1960, the BBC made an offer of 250 guineas to Hoyle for the idea, which would be dramatised for television, as a serial in seven 30-minute parts, by John Elliot.[4] Hoyle replied, \"It has seemed to me that the overall sum of 250 gns is unsatisfactorily low. My own computations would suggest 1000 gns. I estimate that such a sum would still be only 2–3 percent of the receipts by the BBC from licences. Such a percentage still seems low – it is considerably less than rates available in the US\".[5] Eventually, a fee of 700 guineas was agreed.[5] Elliot delivered his draft scripts between March and April 1961; at this point it was decided that each episode should run for 45 minutes and so Elliot had to work to expand each script.[6]The title role of Andromeda was played by Julie Christie. Hoyle originally saw Andromeda as an androgynous character but Elliot changed this to a young woman.[5] The production team were keen to cast a young, unknown actress. While searching for a suitable candidate, co-producer and director Michael Hayes met an agent who suggested Julie Christie, then a student at the Central School of Speech and Drama, recommending her as \"the new Bardot\".[7] In playing the part, Christie wanted to give the character of Andromeda more emotion but Hayes directed her to act more impassively, using his camera to define the character.[7] Mindful that a sequel was under consideration, Hayes advised the BBC to sign her up before she became a big star; he was ignored and the role had to be recast for the sequel, The Andromeda Breakthrough.[7] Christie went on to have a highly successful film career, her breakthrough role occurring in Doctor Zhivago (1965).[8]Peter Halliday played John Fleming. He had trained at the Royal Academy of Dramatic Art before joining the Royal Shakespeare Company where he met and befriended Michael Hayes.[7] Halliday had a reputation for playing angry young men.[9]Because the serial was set in the near future, both Hoyle[10] and Michael Hayes[7] felt that women would occupy more progressive roles in the years to come. This was reflected in the writing and casting; appearing as the security services agent, Judy Adamson, was Patricia Kneale. Kneale found the character \"a rather prissy sort of person, not really the sort of person I usually played at all.\"[7] A late change to the script was changing the sex of the biologist character, George Dawnay, to Madeline Dawnay; writing to Mary Morris offering her the part, Hayes said, \"don't be put off by the fact that the lady appears to smoke a pipe half way through and give vent to some rather strange utterances.\"[9]Norman James had hoped to produce the serial himself but the BBC felt it was too complex an undertaking for a novice producer.[6] However, James was given the role of co-producer and designer; he also received an additional payment in acknowledgement of his role in developing the serial.[6] Assigned as co-producer and director was Michael Hayes who had directed the Shakespearean serial An Age of Kings (1960).[11] Location filming took place in July 1961 around London, including at IBM's offices on Wigmore Street, and in the vicinity of Tenby in Pembrokeshire, Wales where the Manorbier Army Base stood in for the Thorness research centre.[12] The army assisted the production by providing a helicopter for scenes of personnel arriving at Thorness and for aerial shots of the base and environs.[12] They also supplied a pursuit launch for the chase scene in the final episode.[12] A number of pre-filmed inserts were also shot at Ealing Studios.[13] The production then went into studio at BBC Television Centre with each episode recorded every Wednesday between 1 August 1961 and 13 September 1961.[14] For editing purposes, the output of the electronic studio cameras was recorded onto 35mm film rather than videotape.[14] A last minute addition to the serial were the pre-credits sequences at the start of each episode depicting Reinhart recalling the events of the serial in a television interview.[15] These were made in the style of the well-known interview programme Face to Face hosted by John Freeman and were shot at Television Centre on 22 September 1961.[15]The debut episode of A for Andromeda was promoted on the cover of listings magazine Radio Times. The accompanying article said, \"A new science fiction series is an exciting prospect at any time. When it is backed by the authority of a scientist with the international reputation of Fred Hoyle, it ranks as a major television event\".[16] A for Andromeda was broadcast on Tuesday nights at 8:30pm from 3 October 1961.[17] The opening episode was watched by 7.5 million viewers; however, by the end of the serial this had risen to 12.9 million viewers and the serial averaged 9.6 million viewers over its seven-week run.[17]A for Andromeda met with a varied critical reception. \"Science fiction serial starts well\", said The Times after the broadcast of the first episode, adding, \"Although it is encouraging to have the authority of Professor Fred Hoyle for the scientific credibility of [A for Andromeda]... it is the skill of Mr Hoyle the novelist that will mainly be called upon to hold our attention\".[18] The Evening News, meanwhile declared the serial to be \"a jolly good successor to Quatermass\".[19] Not so impressed was L. Marsland Gander in the Daily Telegraph who wrote, \"As a devotee of Prof. Hoyle and a keen student of disembodied intelligence I felt impatient... I am too well acquainted with [his] work to be disappointed, but the temptation is great\".[18] A harsher verdict came from Philip Phillips of the Daily Herald who said, \"The next six episodes might be brilliant. But I won't be watching them\"[19] while The Sunday Times said, \"I cannot with the best will find anything in the least exciting about A for Andromeda\".[20]The BBC produced an Audience Research report for episodes one, five and seven. Many respondents criticised the serial for being slow and full of scientific terminology.[21] However, as the serial progressed, viewers became more enthusiastic; after episode five, one viewer said, \"The serial, like Andromeda herself, suddenly came alive. This episode was spine-chilling\".[22] Another commented \"I didn't like the way Andromeda was created – it is absolutely against Christian belief\".[23] J.A.K. Fraser of Dornock, Scotland, wrote to the BBC's correspondence programme Points of View, saying, \"Enough surely has been seen of Prof. Fleming's overacted hysterical outbursts\".[24] Writing to the Radio Times, B.W. Wolfe of Basingstoke said, \"Congratulations on the recent BBC-tv science-fiction serial A for Andromeda. Bug-eyed monsters we have seen before, but never a creature so radiantly beautiful as Andromeda herself. I was completely captivated\".[25] Other letter writers to the Radio Times discussed the scientific accuracy of the serial including one correspondent, C.W. Bartlett of Watford, who wrote to inform readers that the reference to DNA (then newly discovered) was not a fictional substance but really existed.[26] This was expounded upon by the Daily Mail which drew comparisons with the creation of Andromeda and an announcement from Italy and Russia that scientists had fertilised a human egg outside of the womb; \"These are tough times for the science fiction writer\", the paper wrote, \"Jules Verne and H. G. Wells have long been left in the wake of the rocket, the H-bomb and the atom submarine. Now our own Fred Hoyle is desperately trying to keep a jump ahead of his fellow scientists in the laboratory\".[18]As was common practice at the time, the BBC's copies of the serial were junked after broadcast and the bulk of the serial remains missing to this day. In 2005, a copy of the sixth episode, \"The Face of the Tiger\", was returned to the BBC archives by a private collector; this is missing the pre-credits sequence of Reinhart's interview.[27] A number of film clips from episodes one, two, three, and seven also exist,[28] as does a full audio-only copy of episode seven, taken from an off-air recording. A complete set of off-air photographs, known as tele-snaps, were taken of all seven episodes and are held in the collection of Michael Hayes.[7]","country_of_origin":"United Kingdom","original_network":"BBC One","no._of_episodes":"7","directed_by":"Michael Hayes (uncredited)","original_release":"3 October (1961-10-03) – 14 November 1961 (1961-11-14)","followed_by":"The Andromeda Breakthrough","Remakes":"A version of the serial entitled A come Andromeda, still set in Britain (\"in the following year\") but filmed at Italian locations, was made for Italian television (RAI) in 1971. It was adapted by Inisero Cremaschi and directed by Vittorio Cottafavi. This version still exists and has been repeated on Italian TV. It has been released on VHS, and latterly on DVD but without English subtitles. The cast includes Nicoletta Rizzi as Andromeda, Paola Pitagora as Judy Adamson, Luigi Vannucchi as Fleming, and Tino Carraro as Reinhart.A second remake of A for Andromeda was made by BBC Fictionlab for BBC Four in early 2006. It was produced by Richard Fell, who the previous year had overseen a remake, performed live, of The Quatermass Experiment, another classic BBC science fiction production largely absent from the BBC archives.[29]","Novelisation":"The prospect of novelising A for Andromeda arose early in the serial's production when Souvenir Press contacted the BBC in May 1961 indicating their interest in publishing a tie-in novel.[9] John Elliot responded stating that while the concept had been Hoyle's, the characterisation, dialogue and plot structure was his.[9] Elliot sent copies of the shooting scripts to Souvenir and was formally commissioned to write the novelisation in July 1961.[13] The terms of the contract concerned Hoyle as they gave Souvenir first call on the sequel; he insisted that this could only be permitted if the sequel's novelisation was largely written by Elliot.[13] Elliot delivered his manuscript on 28 September 1961. The novelisation was closer to the original 30-minute scripts and had much of the material required to pad each episode to 45 minutes removed.[19] Promoting it as the story that would \"out-Quatermass Quatermass\",[19] the book was published by Souvenir in February 1962.The Mail on Sunday praised the book as \"science fiction at its best\"[18] while Weekly Science Diary said, \"It is a brightly written, really exciting tale with the added inducement of scientific accuracy\".[18] It has since been translated into several languages. There have also been two alternative versions; the first – issued by Macmillan in 1964 – rewritten by Elliot in simpler English as a study aid for English language students and the second a children's version published in 1969.[30]","genre":"Science fiction","starring":"Esmond Knight|Patricia Kneale|Peter Halliday|Julie Christie|Noel Johnson|Donald Stewart|Geoffrey Lewis|John Hollis|Mary Morris|Peter Henchie|","running_time":"45 minutes","producer(s)":"Michael Hayes|Norman James|","In other media":"A number of film studios, including MGM, the Associated British Picture Corporation and Hammer Films, made enquiries regarding the film rights to A for Andromeda.[20] However, no film version was ever made.In 2006, BBC Worldwide released a DVD box set, The Andromeda Anthology, comprising the original A for Andromeda and its sequel The Andromeda Breakthrough. A for Andromeda was reconstructed using tele-snaps with on-screen captions to describe the plot set to a soundtrack of music from the serial. The surviving film sequences were placed in the narrative where appropriate and the surviving episode \"The Face of the Tiger\" was presented in its entirety. Extra features included a commentary on the surviving material by Michael Hayes, Peter Halliday and Frank Windsor; a specially made making-of documentary, Andromeda Memories; an excerpt from Points of View as well as a photo gallery, PDFs of the shooting scripts and the Radio Times articles and detailed production notes by television historian Andrew Pixley. Both the Italian and BBC remakes of A for Andromeda have also been released on DVD.In 2007, footage of Julie Christie and Peter Halliday in the series is seen in Torchwood episode, \"Random Shoes\".","written_by":"Fred Hoyle|John Elliot|"}