{"based_on":"Drive  by James Sallis","country":"United States","distributed_by":"FilmDistrict","screenplay_by":"Hossein Amini","Plot":"The unnamed driver (Ryan Gosling), who lives in an Echo Park, Los Angeles apartment, works repairing cars and as a part-time movie double. Managed in both jobs by auto shop owner Shannon (Bryan Cranston), the duo also provides a getaway driver service. With Shannon organizing the schemes, the driver gives criminals only five minutes to perpetrate robberies and reach his car. After meeting his new neighbor, Irene (Carey Mulligan), the driver soon becomes close to her and befriends her young son, Benicio (Kaden Leos), while Irene's husband, Standard Gabriel (Oscar Isaac), is in prison. After her husband is freed, Irene still asks the driver to visit them.Shannon persuades Jewish mobsters Bernie Rose (Albert Brooks) and Nino (Ron Perlman) to purchase a stock car chassis and build it for the driver to race. Irene's husband, owing protection money from his time in prison, is beaten up by Albanian gangster Cook (James Biberi), who demands that Standard rob a pawnshop for $40,000 to pay the debt. The gangster gives the young boy Benicio a bullet as a symbol that he and his mother are in danger. The driver, concerned for the safety of Irene and Benicio, steals a Ford Mustang and offers to act as the getaway driver for the pawnshop job.While waiting for Standard and Cook's accomplice Blanche (Christina Hendricks) to complete the heist, the driver sees a custom Chrysler 300 pull into the parking lot. Blanche returns with a large bag, but Standard is shot in the back several times and killed by the pawnshop owner. The driver flees with Blanche and the money. They are pursued by the Chrysler, which bumps them but skids in the fast turns and eventually spins out. Eluding the other vehicle, the driver hides with Blanche in a motel. Learning that the bag contains a million dollars, yet the TV news reports the robbery as no money stolen, the driver threatens to beat Blanche, forcing her to admit she and Cook planned to re-steal the mysterious money with the Chrysler. Minutes later, two of Cook's men ambush them in the motel room, killing Blanche and injuring the driver before he manages to kill them both.At the auto shop, the driver's arm is bandaged from the shotgun pellets; Shannon offers to hide the money, but the driver refuses. He hunts down Cook in a strip club, smashes his fingers with a hammer, and threatens to kill him, forcefeeding him the bullet that was given to Benicio; Cook reveals that Nino was behind the robbery. The driver decides to return the million but Nino dismisses the offer and instead sends a hitman (Jeff Wolfe) to the driver's apartment building. Entering the elevator with Irene, the driver encounters the hitman and spots his pistol. The driver kisses Irene and then brutally beats the hitman to death. Irene exits horrified and stunned.In his pizzeria, Nino reveals to Bernie that the money was stashed at the pawn shop by a low level Philadelphia wise guy from the \"East Coast mob\" and since anyone tied to the robbery could lead the East Coast Mafia to them, they need to kill everyone involved. Bernie warns Nino that nobody steals from the Italian Mob. Nino becomes angered and explains how the Italian Mob has, in part due to his Jewish heritage, continually marginalized and insulted him. At the end, he convinces Bernie to follow his plan. Bernie then proceeds to murder Cook with knives from the restaurant, as he is the sole witness to their agreement. After Shannon refuses to divulge the whereabouts of the driver, Bernie kills him at the auto shop with a straight razor from his collection of blades.The driver, disguising himself with a rubber mask from his stuntman job, follows Nino from the pizzeria to the Pacific Coast Highway and T-bones Nino's car onto a beach, then chases him from the wreck to the ocean and drowns him. The driver goes to meet Bernie at a Chinese restaurant. He makes a phone call to Irene to tell her he is leaving, saying that meeting her and Benicio was the best thing that ever happened to him. At the restaurant, Bernie promises that Irene will be safe in exchange for the money, but warns the driver must always be on the run. At his car, the driver gives Bernie the money but Bernie attempts to kill him, stabbing him in the stomach. The driver survives and fatally stabs Bernie in the neck, then drives away, abandoning the money bag alongside Bernie's body. Irene knocks at the driver's apartment, but gets no response. The driver is shown driving away into the night.","language":"English","Reception":"The film has an approval score of 92% on Rotten Tomatoes based on 238 reviews and an average rating of 8.3 out of 10. The critical consensus states: \"With its hyper-stylized blend of violence, music, and striking imagery, Drive represents a fully realized vision of arthouse action.\"[73] The film also has a score of 78 out of 100 on Metacritic, based on 43 reviews indicating \"generally favorable reviews\".[74]It was one of the highest-ranked and most-featured films on critics’ year-end top 10 lists. It ranked as fourth best film of the year, behind The Tree of Life, The Artist, and Melancholia on Metacritic's tally of top 10 lists. On Movie City News’ tally it ranked third, behind The Tree of Life and The Descendants.[75][76]The writers for the film magazine Empire listed Drive as their number one film of 2011.[77] Peter Travers of Rolling Stone gave the film 4 out of 4 stars, declaring that Drive was “a brilliant piece of nasty business,” and that “Refn is a virtuoso, blending tough and tender with such uncanny skill that he deservedly won the Best Director prize at Cannes.\" It was his top film of 2011.[78][79] Richard Roeper said that \"Drive is an adrenalin shot to the senses. I love this movie and as soon as it was over, I wanted to see it again.” James Rocchi, writing for The Playlist, gave the film an A letter grade and said, \"Drive works as a great demonstration of how, when there’s true talent behind the camera, entertainment and art are not enemies but allies.”[80] Both Roeper and Rocchi also placed Drive as their number one film of 2011.[81][82]Stephanie Zacharek of Movieline complimented the film's action and wrote that it “defies all the current trends in mainstream action filmmaking. The driving sequences are shot and edited with a surgeon’s clarity and precision. Refn doesn’t chop up the action to fool us into thinking it’s more exciting than it is.” She also admired Refn’s skill in handling the film’s violence and the understated romance between Gosling and Mulligan. Her score for the film was 9.5/10[83] Drive was Roger Ebert's seventh best film of 2011. In praising the film, he wrote, “Here is a movie with respect for writing, acting, and craft. It has respect for knowledgeable moviegoers.”[84] Like Zacharek, Ebert admired Drive’s action sequences, which were practically made and didn’t rely on CGI.[85][86]The Wall Street Journal’s Joe Morgenstern called Albert Brooks' villainous performance \"sensational\".[87] \"Prepare to be blown away by Albert Brooks,\" said Peter Travers, \"Brooks' performance, veined with dark humor and chilling menace (watch him with a blade), deserves to have Oscar calling.\"[78] Albert Brooks won the New York Film Critics Circle Award for Best Supporting Actor.[88] He was also nominated for the Golden Globe Award for Supporting Actor – Motion Picture.[89]Joshua Rothkopf, writing for Time Out (New York), stated, \"Danish director Nicolas Winding Refn (Bronson) has taken the opportunity to work in America and pushed it to delirious limits; his effort, a foreigner's impassioned take on ’80s-synth-scored romance and highway mayhem, plays like the work of a student graduating with highest honors.” Drive was Rothkopf’s choice for film of the year.[90][91] Salon.com's Andrew O'Hehir lauded Albert Brooks against-type performance as the film's villain and called it \"unforgettable\". On the elevator sequence in the film, which juxtaposes romance with violence, O'Herir commended it and proclaimed that it is a sequence that \"film students will be deconstructing, shot by shot, for years to come.\"[92]The violence of the film was off-putting for some reviewers. In a negative review by Anthony Lane in The New Yorker, he wrote that Drive's violence was far too graphic, and it ultimately was a detriment to the film. Referring to the violence, he said, \"In grabbing our attention, he diverts it from what matters. The horror lingers and seeps; the feelings are sponged away.\"[93] The Chicago Tribune's Michael Philips felt similarly, and while he enjoyed the film early on, Drive became \"one garishly sadistic set piece after another.\" Additionally, Phillips thought the film relied too much on \"stylistic preening\" and did not have enough substance.[94] In 2014, The Huffington Post included Drive on its \"8 Movies From The Last 15 Years That Are Super Overrated\" list.[95]Audiences polled by CinemaScore gave the film a score of C−; this was attributed to audiences feeling tricked, having expected more driving and more action based on the marketing.[96]Drive was listed on many critics’ top ten lists of 2011.[97]Drive grossed $76,175,166 worldwide, making more than five times its 15 million dollar budget.[2] In North America, Drive grossed a total of $35,060,689. Drive opened in North America to $11,340,461 on the weekend of 16 September 2011 and played at 2,866 theatres. It was one of four wide releases that opened that weekend, and came in second.[98] Drive closed its North American theatrical run on 9 February 2012.[99]In the international marketplace, Drive grossed $41,114,477. Drive had its highest-grossing box office in France, where it earned a total of €10,346,427.87 ($13,264,311).[100] It opened in France on the weekend of 5 October 2011 at 246 theatres, eventually expanding to 360. The film opened in second place and had the highest per-screen theatre gross for the weekend €10,722 ($13,746) .[101] Its second-highest overseas gross came in the United Kingdom, where it earned a total of £3,089,790 ($4,693,696).[102] Drive opened in the U.K. on 27 September 2011 at 176 theatres, eventually expanding to 190.[103] The film opened in Australia on October 27, 2011 and grossed a total of $2,286,388 in the country.[104]Drive was nominated for four British Academy Film Awards, which included Best Film, Best Direction, Best Actress in a Supporting Role (Carey Mulligan), and Best Editing. It was one of the most-nominated films by critics’ groups in 2011.[105][106] Albert Brooks had the most critics’ groups nominations.[107][108] Nicholas Winding Refn won the Best Director Award (Prix de la mise en scène) at the 64th Cannes Film Festival.[109]","box_office":"$78.1 million[3]","cinematography":"Newton Thomas Sigel","directed_by":"Nicolas Winding Refn","Soundtrack":"Drive (Original Motion Picture Soundtrack) was released in CD format to stores on September 27, 2011 by Lakeshore Records,[110] and owned by Cutting Edge Film Scores.[111] Prior to that, thanks to viral reviews, such as those found on social networking website Twitter, the soundtrack sold well on iTunes, climbing as high as number four on the sales charts.[112] The album was released on vinyl in June 2012, by Mondo.[113] The nineteen-track album has amassed positive reviews. James Verniere of the Boston Herald graded it an A, stating, \"The cool crowd isn't just watching Drive; they're listening to it, too... The Drive soundtrack is such an integral part of the experience of the film, once you see it, you can't imagine the film without it.\"[114] AllMusic reviewer James Christopher Monger selected opening track \"Nightcall\", \"I Drive\", \"Hammer\" and \"Bride of Deluxe\" as highlights on it.[115] Digital Spy's Mayer Nissim gave it a four out of five star rating, finding it to be as important as the film itself. She stated the album beginning with non-Martinez songs instead of mixing it up for a more enjoyable listening experience cost it a star.[52]","production_companies":"Bold Films Odd Lot Entertainment Marc Platt Productions Motel Movies","release_dates":"May 20, 2011 (2011-05-20) (Cannes)|September 16, 2011 (2011-09-16) (United States)||||","Production":"\"I was very taken with this little crime story that James Sallis wrote. I felt that the way the world was presented in the book demanded that its true grit be retained in the script. The grit comes from seeing the world from the point of view of the driver in the car. It's those elements that I felt were critical to retain to make this film a very unique cinematic experience.\"The novel Drive by James Sallis was published in 2005.[6] Producers Marc Platt and Adam Siegel of Marc Platt Productions optioned the novel after Siegel read a review in Publishers Weekly.[7] The driver intrigued Siegel because he was \"the kind of character you rarely see anymore – he was a man with a purpose; he was very good at one thing and made no apologies for it.\" The character interested Platt, because he reminded him of movie heroes he looked up to as a child, characters typically portrayed by Steve McQueen or Clint Eastwood.[7]Academy Award-nominated screenwriter Hossein Amini adapted the novel for the screen. He felt it was a rare book to receive from a studio because it was short, gloomy, and like a poem. Because the novel does not present a linear story but has many flashbacks and jumps around in time, Amini found the adaptation challenging. He felt the non-linear structure made it \"a very tricky structure\" for a feature film.[5]A film adaptation of Drive was first announced in early 2008, with Neil Marshall set to direct what was then being described as \"an L.A.-set action mystery\" that would be a starring vehicle for Hugh Jackman. Universal Studios, who had been trying to make a film version for some time, was also on board.[8][9] By February 2010, Marshall and Jackman were no longer attached to the project. When Ryan Gosling signed on as the leading role, he was allowed to choose the director. A fan of his work, the actor chose the Danish filmmaker Nicolas Winding Refn.[10] When Refn read the first screenplay for Drive, he was more intrigued by the concept of a man having a split personality, being a stuntman by day and a getaway driver at night, than the story itself.[11]Producer Marc E. Platt contacted actor Ryan Gosling regarding Drive early on. Platt explained: “I have this list that I’ve created of very talented individuals whose work inspire me – writers, directors, actors whom I have to work with before I go onto another career or do something else with my life.\" Near the top of Platt's list was Gosling, who, despite having starred in several films of diverse genres, had never starred in anything like Drive. He had always been interested in doing an action-oriented project; Gosling claimed that he was simply put off from the genre, believing that the action films of today put more focus on stunts instead of characters. Despite this, Platt heard back from the actor around 48 hours later. Gosling has stated that his strong attraction to the plot led him to take on the leading role of the unnamed driver, saying that he was drawn to the \"very strong character\" at its core, as well as the \"powerful\" romance.[12][12]In an interview with Rotten Tomatoes, Gosling was asked, \"What was it about the film? Had you read the script when Hugh Jackman and director Neil Marshall were attached to make it?\" He replied:\"I think that might be the original one I read. I read a few drafts. I read one as well where he wasn't a stunt driver at all, which was a newer draft – maybe that's the one Hugh Jackman had; I'm not sure exactly. Basically when I read it, in trying to figure out who would do something like this, the only way to make sense of this is that this is a guy that's seen too many movies, and he's started to confuse his life for a film. He's lost in the mythology of Hollywood and he's become an amalgamation of all the characters that he admires.\"[13]Gosling was given the opportunity to choose the film's director, a first in his career: \"And I thought, 'It had to be Nicolas [Winding Refn].' There was no other choice.\"[14] Believing that the director might be intimidated by the script as it was unlike anything he had done before, Gosling had concerns about Refn's desire to participate. Refn took on the project without hesitation.[11]When casting roles in his movies, Refn doesn't watch casting tapes or have his actors audition for him. He meets with them and casts them on the spot if he feels they're right.[15] Drive was the first film Carey Mulligan signed on to after being nominated for an Academy Award for her role in An Education, which was directed by another Danish filmmaker, Lone Scherfig. Scherfig is a good friend of Refn and she used to babysit him when he was a child.[16] At the time of Mulligan’s casting, Refn hadn’t seen An Education, but his wife was big fan of the film and Mulligan’s performance, and she urged him to cast her.[17][18] In the original script, the character was a Hispanic woman name Irina. The character was changed to Irene after Mulligan was cast. While working on the film, Mulligan moved in with Refn, his wife and two daughters in their home in Los Angeles.[19] Hossein Amini, the film’s screenwriter, also lived with Refn’s family during the duration of the film’s shoot. Refn and Amini made significant changes to the original script during this time.[20]Bryan Cranston plays the role of Shannon.[21] Cranston was one of the first actors Winding Refn looked to cast, as he was a fan of the TV series Breaking Bad. Knowing Cranston had other opportunities, Winding Refn tried to interest him by asking how he would like to develop the role. After not hearing back, Winding Refn called him, at the very same time that Cranston was writing on a piece of paper the pros and cons of doing Drive. Moved by Winding Refn's interest, he accepted the part.[15] Christina Hendricks plays the small role of Blanche.[21] \"Trying to work in a more reality arena for a character like that,\" Winding Refn originally auditioned porn stars for Blanche. He was unable to find anyone with the necessary acting talent. After meeting with Hendricks, he decided to cast her, feeling her \"powerhouse\" persona would click with the character.[15]Albert Brooks plays the foul-mouthed, morose Bernie Rose. When Winding Refn suggested him, Gosling agreed but thought the actor would not be up for playing a character who is violent and sullen, or for appearing in a film that he did not work on himself.[21] Brooks accepted the role to go against type and because he loved that Bernie was not a cliché. \"There are six people you could always get to play this kind of part, and I like that the director was thinking outside of the box. For me, it was an opportunity to act outside the box. I liked that this mobster had real style. Also, he doesn’t get up in the morning thinking about killing people. He’s sad about it. Upset about it. It’s a case of, 'Look what you made me do.'\"[22]Nino, a key villain, is portrayed by Ron Perlman, one of the last actors to join the cast. Regarding the casting of Perlman, Winding Refn said, \"The character of Nino was originally not particularly interesting, so I asked Ron why he wanted to be in my movie when he's done so many great films. When Ron said, 'I always wanted to play a Jewish man who wants to be an Italian gangster', and I asked why, and he said, 'because that's what I am – a Jewish boy from New York', well, that automatically cemented it for me.\"[21] Oscar Isaac portrays a Latino convict named Standard who is married to Irene and is just released from prison a week after Irene meets The driver. He found the role to be a bit unappealing and chose to turn the archetypal character into something more. He said of the role,\"As soon as I sat down with Nicolas, he explained this universe and world of the story, so we made the character into someone interested in owning a restaurant, someone who made some wrong decisions in his life, ending up in a bad place. By making ‘Standard’ more specific and more interesting, we found that it made the story that more compelling.\"[21]The film was made on a production budget of about $15 million and shot in various parts of Los Angeles, California, beginning on September 25, 2010.[8][23] Locations were picked by Winding Refn while Gosling drove him around the city at night. Under the director's request, Los Angeles was picked as the shooting site due to budget concerns.[24] Winding Refn moved into a plush Los Angeles home and insisted that the cast members and screenwriter Amini move in with him. They would work on the script and film all day, then watch films, edit or drive at night.[25] Refn requested that the editing suite be placed in his home as well.[8] With a shooting script of 81 pages, Winding Refn and Gosling continued to trim down dialog during filming.[15]Its opening chase scene involving Gosling's character was primarily filmed by Winding Refn within the car's interior. In an interview, Winding Refn revealed the idea for this scene was to emulate the feeling of a \"diver in an ocean of sharks\", never leaving the vehicle during a car chase so that the audience can see what's happening from the character's point of view.[26] Tight on money and time, he shot the scene in two days. With two different set-ups prepared in the car, the director found it difficult to have mobility with the camera, so he would then switch the camera to two additional set-ups nearby. As downtown Los Angeles had changed for the better, Refn avoided certain areas to preserve the gloomy atmosphere. Additionally, the scene was shot at low-angles with minimal light.[26]One scene in the film that has no dialog is the elevator sequence, \"a series of stunning visuals and graphic imagery that’s a prime example of how the film conveys so many ideas and emotions through images rather than words.\"[27] For this, he spoke to Gaspar Noé and asked him how he did the head-smashing scene in Noé's Irréversible (2002).[8] Crossing the line from romance to violence, the scene starts off with the driver and Irene tenderly kissing. What they share is really a goodbye kiss,[28] as he then becomes a \"werewolf,\"[29] violently stomping the hit-man's head in. Subsequently, Irene sees the driver in a new light.[27] \"Every movie has to have a heart—a place where it defines itself—and in every movie I've made there's always a scene that does that. On Drive, it was hard for me to wrap my head around it. I realized I needed to show in one situation that driver is the hopelessly romantic knight, but he's also completely psychotic and is willing to use any kind of violence to protect innocence. But that scene was never written. As I was going along, it just kind of popped up,\" Refn said.[30] In March 2012, Interiors, an online journal that is concerned with the relationship between architecture and film, released an issue that discussed how space is used in this scene. The issue highlights Nicolas Winding Refn's use of constricted space and his way of creating a balance between romance and violence.[31]Car scenes were filmed with a \"biscuit rig\", a camera car rig developed for the film Seabiscuit (2003), which allowed stunt driver Robert Nagle to steer the car, freeing Gosling to concentrate on acting.[32][33] Consistent with Winding Refn's usual visual style, wide-angle lenses were heavily used by cinematographer Newton Thomas Sigel. Handheld camerawork was avoided.[34] Preferring to keep the film more \"grounded\" and authentic, he also avoided use of computer-generated imagery (CGI). Inability to afford CGI due to budgeting restrictions also played a factor in this decision.[35] Although many stunt drivers are credited, Gosling did a number of stunts himself,[36] after completing a stunt driving car crash course.[37] During production, Gosling re-built the 1973 Chevrolet Malibu used in the film, taking it apart and putting it back together.[38] Filming concluded on November 12, 2010.[23][39]Beth Mickle was hired as Drive's production designer on Gosling's recommendation; they had worked together on 2006's Half Nelson. Prior to filming, Mickle supervised a crew of 40, routinely working 16- to 18-hour days. This was her most expensive film to date, and Mickle felt freer since, compared to Half Nelson, \"there was another zero added to the budget.\"[40] The crew built the driver's apartment building, which included a hallway and elevator that linked his unit to Irene's. Mickle also built a strip club set and Bernie Rose's apartment in an abandoned building. Turning a \"run-of-the-mill\" Los Angeles auto body shop into a grandiose dealership was one of the most challenging. Painting the walls an electric blue color, she brought in a showroom full of vintage cars.[40]Using an Arri Alexa camera, the film was shot digitally.[41] According to executive producer David Lancaster, the film contains abundant, evocative, intense images of Los Angeles that are not often seen. \"From the little seen back streets of downtown LA to the dry arid outposts on the peaks of the desert landscape surrounding it, Siegel has re-imagined an LA all the way down to the rocky cliffs by the sea.\"[34]While Drive is set in the present day, it carries a heavy 1980s atmosphere that is cautiously set from beginning to end and is underlined not only by the vehicles or music and clothes, but also by its architecture. The parts of the city seen in the Valley and by downtown Los Angeles are cheap stucco and mirrored glass, often leaving out more contemporary buildings.[42] Drab background settings include the Southern California commercial strip. As the Los Angeles Times pointed out, whenever gleaming buildings are shown, it is because they are being seen from a distance. Refn shot those scenes from a helicopter at night in Bunker Hill, Los Angeles.[42]\"Thinking back, there isn't really all that much driving in Drive – a couple of chase scenes here and there, staged efficiently, thrillingly. It's more about the questionable choices that drive people – and, ultimately, the ones that drive them away.\"Journalists and reviewers have called Drive a \"classic Los Angeles heist-gone-wrong story\", a \"tribute to the genre of car films\" in the vein of movies like Bullitt (1968). As a character study, Drive examines themes of \"loyalty, loneliness and the dark impulses that rise up even when we try our hardest to suppress them.\"[27][44] It combines comic gore, film noir and B-movie style and Hollywood spectacle, resulting in \"a bizarre concoction...reminiscent of David Lynch's Mulholland Drive...Quentin Tarantino's Pulp Fiction, and [with] angst-laden love scenes that would not be out of place in a Scandinavian drama\".[25][45][46][47] Other comparisons have been to the works of Walter Hill, John Carpenter, Michael Mann, Nathanael West, J.G. Ballard, and Mike Davis.[42] According to Refn, Drive is dedicated to filmmaker Alejandro Jodorowsky and includes some of Jodorowsky's existentialism.[8]Drive has been called a tough, hard-edged neo-noir art house feature,[8] extremely violent and very stylish, with European art and grindhouse influences.[25][45] According to Refn, Drive turns into a superhero film during the elevator scene when The Driver kills the villain.[38] Drive also references 1970s and 1980s cult hits such as The Day of the Locust (1975)[42] and To Live and Die in L.A. (1985). Other influences can be seen in the neon-bright opening credits and the retro song picks – \"a mix of tension-ratcheting synthesizer tones and catchy club anthems that collectively give the film its consistent tone.\"[36] Drive's title sequence is hot-pink,[8] which was inspired by 1983's Risky Business' editing table.[15] Refn has also indicated that the film's romance was partially inspired by the films of John Hughes.[48]Winding Refn's inspiration for Drive came partly from reading Grimm's Fairy Tales, and his goal was to make \"a fairy tale that takes Los Angeles as the background,\"[8] with The Driver as the hero. To play with the common theme of fairy tales, The Driver protects what is good while at the same time killing degenerate people in violent ways.[27] Refn was also inspired by films such as Point Blank (1967), Two-Lane Blacktop (1971), The Driver (1978) and Thief (1981). Jean-Pierre Melville’s crime productions influenced the cinematography.[38] Amini's script propensity imposes \"a kind of sideways moral code,\" where even those who comply with it are almost never rewarded for their efforts, as seen when The Driver helps Standard with Irene and her son's best interests in mind.[27] Within their vehicles, the characters not only make escapes or commit murder, but try to obtain peace and search for romance.[27]The film's main character, The Driver, has been compared to the Man With No Name, a character Clint Eastwood portrayed in the Sergio Leone Westerns, because he almost never speaks, communicating mostly non-verbally.[46] The Driver's meagre dialogue is not designed to present him as tough, but to soften him. Winding Refn chose to give the Driver very little dialogue and instead have him drive around listening to synthpop music, taking control when it counts.[45] One reviewer noted that what The Driver lacks in psychology, he makes up through action and stylish costuming.[36] The Driver's wardrobe, in particular the satin jacket with the logo of a golden scorpion on the back, was inspired by the band KISS and Kenneth Anger's 1964 experimental film Scorpio Rising.[38] Refn sees the former as the character's armor and the logo a sign of protection.[49] According to reviewer Peter Canavese, the jacket is a reference to the fable of the scorpion and the frog, mentioned in the movie, which in turn evokes the use of the fable in the Orson Welles film Mr. Arkadin.[50]Most of its ethereal electronic-pop score was composed by Cliff Martinez.[51] Refn was a particular fan of his ambient work on the Sex, Lies, and Videotape soundtrack.[27] The score contains tracks with vintage keyboards and bluntly descriptive titles.[52] Refn wanted electronic music for the film and to have the music occasionally be abstract so viewers can see things from the driver's perspective.[53] He gave composer Martinez a sampling of songs he liked and asked Martinez to emulate the sound, resulting in \"a kind of retro, 80ish, synthesizer europop\". Editor Matt Newman suggested Drive's opening credits song – \"Nightcall\" by French electronic musician Kavinsky.[8][38]Winding Refn wanted a score by Johnny Jewel of Desire and Chromatics, whose music was used in the film, but the studio had other plans. They instead hired Martinez at the last minute to imitate the style and feel of Jewel's bands Chromatics and Glass Candy.[54]As Winding Refn was going through mixer Johnny Jewel's catalog, he picked out \"Under Your Spell\" and \"Tick of the Clock\" because he thought of Drive being a fairytale. During Drive's climax, \"A Real Hero\"'s keynote melody, about becoming \"a real human being, and a real hero\", refrains because that is when the driver changes into both those statuses'.[55] At first, Jewel worried that \"Under Your Spell\" might be too literal but soon realized it is used in Drive \"in the exact same way that I was feeling it when I wrote it. He definitely got the nuance of the song, and understood what it was supposed to mean, and he wanted to give that emotion to the viewer, that same feeling.\"[53]Thinking of music in terms of basic elements, Jewel would tell the director that for certain scenes, it should not have bass since, as an earth tone, it usually is used for a more emotional or ominous part. Jewel thought the music should be upper register and relaxing for the \"dreamlike\" scene. To help himself with the writing process and conjure up melodies, the producer would perform a procedure where he highlighted many phrases from the novel, then printed those words in large font and hung them on his walls or drew pictures during viewings of Drive.[53]The soundtrack from Drive was listed on Spin magazine's list of \"40 Movie Soundtracks That Changed Alternative Music\".[56]A re-scored soundtrack for the film was produced for the BBC by Zane Lowe for its television broadcast in October 2014. The soundtrack included original music from Chvrches, Banks, Bastille, Eric Prydz, SBTRKT, Bring Me the Horizon, The 1975 and Laura Mvula.[57]","produced_by":"Marc Platt|Adam Siegel|Gigi Pritzker|Michel Litvak|John Palermo|","starring":"Ryan Gosling|Carey Mulligan|Bryan Cranston|Christina Hendricks|Ron Perlman|Oscar Isaac|Albert Brooks|","running_time":"100 minutes[1]","drive":"Theatrical release poster","music_by":"Cliff Martinez","edited_by":"Matthew Newman","Release":"Prior to principal photography, Refn went to the 2010 Cannes Film Festival in an effort to sell the rights to Drive and released promotional posters for the film.[14][58][59] In November 2010, FilmDistrict acquired North American distribution rights.[23] The owners were so eager to get their hands on Drive, they started negotiating to buy it before seeing any footage, believing it could appeal to people who enjoy a genre movie, as well as the arthouse crowd.[60] The film had a release date of September 16, 2011, in the United States.[23][61]The film premiered on May 20, in competition at the 2011 Cannes Film Festival.[62] At its first showing to the media, it received abundant praise[63] and received \"some of the best responses of the festival\",[64] but one positive review said it \"can't win, won't win\" Cannes's top prize.[45] It was greeted with hoots and howls of joy from the media, with viewers cheering on some of the scenes featuring extreme violence.[25][46] Drive also received a 15-minute standing ovation from the crowd.[65] Xan Brooks of The Guardian called the film his guilty pleasure of the 2011 competition, labeling it an enjoyable affair. \"Over the past 10 days we've witnessed great art and potent social commentary; the birth of the cosmos and the end of the world. Turns out what we really wanted all along was a scene in which a man gets his head stomped in a lift. They welcome it in like a long-lost relation,\" he wrote.[47] The festival named Refn best director for Drive.[66]Drive was also screened at the Los Angeles Time's Los Angeles Film Festival (LAFF) on June 20 at its gala screenings program. It was among more than 200 feature films, short projects, and music videos, from more than 30 countries, to be shown at the festival.[67] After Red Dog's release date was pushed up by several days, Drive replaced it as the Melbourne International Film Festival's closing night film.[68] Additionally, the movie was screened during FilmDistrict's studio panel presentation at the San Diego Comic-Con function.[69] A secret screening for Drive was held at London's Empire Big Screen during the middle of August.[38] In September, Drive screened as a special presentation during the 2011 Toronto International Film Festival, alongside another movie starring Gosling, The Ides of March.[70]Drive was released on DVD and Blu-ray on January 30, 2012;[71] and it was released early on iTunes, the PlayStation Store, and Xbox Live on January 17, 2012.Drive was re-released on a Blu-ray/DVD and Digital Copy combo Mondo x SteelBook on December 2, 2014, as a proof of concept title for an upcoming series of collaborative releases between Justin Ishmael (Mondo) and Nick Coughlan (SteelBook) utilizing artwork by Tyler Stout.[72]","budget":"$15 million[2]"}