{"based_on":"Cheaper by the Dozen  by Frank B. Gilbreth, Jr. Ernestine Gilbreth Carey","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Sam Harper Joel Cohen Alec Sokolow","story_by":"Craig Titley","Plot":"Tom Baker (Steve Martin) is a football coach at a small rural college in Midland, Indiana, where he raised twelve children, and his wife, Kate (Bonnie Hunt), has written about her life story in a book and hopes to send it to her friend to publish it. At the film's beginning, Tom unexpectedly receives an offer from his old friend and football teammate, Shake McGuire (Richard Jenkins), to coach at his alma mater in Evanston, Illinois. Tom accepts the offer, and he and Kate begin making their plans on moving to Evanston. All twelve Baker children find out and demand the move be put to a vote, although Tom says it would not have any power. Tom loses the vote, even after he and Kate join, but goes ahead with the move anyway, claiming there will be more money and that they will be a \"happier and stronger family\". However, the atmosphere at the Bakers' new house is tense, and the situation at school for the children is even worse, although their new neighbors: the Shenks seem alright, especially the father, Bill (Alan Ruck) and their first and only son, Dylan (Steven Anthony Lawrence).When her book is ready for publication, Kate is told that she must do a national book tour to promote it in New York for three days. Tom thinks that he will handle everything around the Bakers' house while Kate is away, so he decides to hire his older child, Nora (Piper Perabo), and her boyfriend, Hank (Ashton Kutcher), to manage the children. When Nora arrives at her family's house to manage them, the children plan to make Hank the target of their prank by soaking his underwear in meat and assisting their pet dog, Gunner, to attack him by chewing on his butt, prompting him to refuse to assist in baby-sitting since they know that he hates kids. As a result, Nora is angry at the children and later drives off with Hank, while Tom berates the children for their prank and cuts off their allowance within a month.Shortly after Kate departs for her national book tour, Tom realizes that he cannot handle the children on his own after a chaotic night since Kate is told to stay for two more weeks. In reply to this revelation, Tom tries to hire a housekeeper, but nobody is willing to work with a family as large as his, so Tom decides to bring the football players from work into his house for game practicing in the living room to prepare for the Saturday night football game as the children perform chores and their household games. However, the children start causing trouble at school, in which Kyle and Nigel (Brent and Shane Kinsman) hurt their kindergarten teacher, Charlie (Tom Welling) and Lorraine (Hilary Duff) continue suffering insults from teenage bullies without any violence involved, and the others stand-up against a group of bullies by fighting them for picking one of their own brothers, Mark (Forrest Landis) and are both suspended from school for the fight after Mark and the others along with the bullies were sent to the principal's office. Because of these incidents, Tom grounds the Baker children from any fun and games and forbids them all from going to Dylan's birthday party, although they already have presents for him. Without Tom noticing them, the children sneak out of the house to give Dylan his presents and cause havoc at the party. While discussing the plays, Tom overhears party-goers screaming from Dylan's house as one of the gifts turns out to be a Brazilian mud viper snake from Mark. Tom sends his players to retrieve his kids while he tries to retrieve his daughter, Sarah (Alyson Stoner), but during a mess, he fails and the bounce house explodes. In all of the commotion, Dylan gets injured by Tom and is later sent to the hospital with a broken arm as his mother, Tina (Paula Marshall), coldly forbids the Baker kids from ever playing with Dylan ever again. Tom is forced to cancel the game after Shake advises him not to bring the players in his house or the children in the department again.Kate overhears from the children about the chaos and cancels the book tour to take charge of the situation. Kate's publisher decides to create an additional promotion for her book by inviting Oprah Winfrey to tape a segment about the Bakers in their home instead. However, Tom finds a letter in his mailbox revealing that Charlie got kicked off the football team as he berates Tom and storms out of the house to rejoin his girlfriend, Beth (Tiffany Dupont), back at Midland. Tom is even more shocked to discover Hank having returned and slept over with Nora at home. Despite much coaching from Kate, the Bakers are not able to demonstrate the loving, strongly bonded family that Kate described in her book. When Mark becomes upset that his pet frog, Beans, has died, which Sarah tells him that nobody cares and calls him Fedex once again, a heated fight erupts moments before the segment starts, leading the cameramen to tell Winfrey to cancel it. Afterwards, Mark runs away from home, prompting the Bakers to find him. Tom suspects that Mark is trying to run back to the Bakers' old home, and eventually finds Mark on a train en route from Chicago to Midland. Reuniting with the rest of their family, the Bakers begin to address their issues with each other. After burying Beans in the garden and performing a kind of eulogy with the whole family there, Tom ultimately resigns from his position at his alma mater and settles for a less-time consuming job. The film ends at a Christmas dinner with the Bakers when the chandelier lamp breaks off and smashes.","language":"English","Reception":"On review aggregation website Rotten Tomatoes, the film gained a score of 24% based on reviews from 118 critics, with an average score of 4.5 out of 10, and the site's consensus reading: \"In this family of twelve children, much chaos ensues, but little hilarity.\"[2] On Metacritic, which determines a normalized rating from mainstream critics, the film received a score of 46 out of 100 based on 30 reviews, indicating \"mixed or average reviews.\"[3] Despite initial reactions, the film was given \"Two Thumbs Up\" from Roger Ebert and Richard Roeper on their television show, and became a box office hit. The film opened at #2 ranking in US$27,557,647 in its first opening weekend and, despite being kept from the top spot by The Lord of the Rings: The Return of the King, went on to gross $190,212,113 worldwide.[1] Ashton Kutcher was nominated for a Golden Raspberry Award for Worst Actor for his performance in this, and two other films.[4]","box_office":"$190.2 million[1]","cinematography":"Jonathan Brown","production_company":"Robert Simonds Productions","directed_by":"Shawn Levy","Home media":"The film was released on VHS and DVD on April 6, 2004.","Soundtrack":"Other compositions used in the movie are \"Classical Gas\" by Mason Williams and Carl Orff's \"O Fortuna\", among others.","narrated_by":"Bonnie Hunt","release_dates":"December 25, 2003 (2003-12-25)|||||","cheaper_by_the_dozen":"Theatrical release poster","produced_by":"Robert Simonds Michael Barnathan Ben Myron","starring":"Steve Martin Bonnie Hunt Hilary Duff Tom Welling Piper Perabo","running_time":"98 minutes","Sequel":"A sequel, Cheaper by the Dozen 2, was released in the United States on December 21, 2005.","music_by":"Christophe Beck","edited_by":"George Folsey, Jr.","budget":"$40 million"}