{"country":"United States","distributed_by":"TriStar Pictures (USA) Cannon Films (non-USA)","Legacy":"In the 30th episode of the 2nd season of the Yu-Gi-Oh! GX English dub, entitled \"Magnetic Personality,\" Chazz Princeton summons Beetron-1 and then quickly follows up by special summoning another monster he refers to as \"Beetron-2: Electric Boogaloo\".The first episode of the 11th season of It's Always Sunny in Philadelphia pays homage to the movie with the title 'Chardee MacDennis 2: Electric Boogaloo'. [11]","Plot":"Breakin' 2 features three characters from Breakin' – Kelly (Lucinda Dickey), Ozone (Adolfo Quinones), and Turbo (Michael Chambers) – who struggle to stop the demolition of a community recreation center by a developer who wants to build a shopping mall. Viktor Manoel, Ice-T, and Martika (who was little known then) also appear as dancers.","breakin'_2:_electric_boogaloo":"Breakin' 2: Electric Boogaloo movie poster","Home video releases":"On April 15, 2003, MGM Home Entertainment released Breakin' 2: Electric Boogaloo as a bare bones DVD. On April 21, 2015, Shout Factory released the film, along with Breakin', as a double feature Blu-ray.","language":"English","Critical reception":"Though most critics rated the film poorly,[6][7] New York Press film critic Armond White considered it to be \"superb\"[8] and Roger Ebert gave the film a three-star rating.[9]","box_office":"$15,101,131[1]","\"Electric Boogaloo\"":"Since the release of the film, the subtitle \"Electric Boogaloo\", originally a reference to a funk-oriented dance style of the same name, has entered the pop-culture lexicon as a snowclone pejorative nickname for unnecessary and/or unwanted sequels.[3] The usual connotation is of either a ridiculous sequel title, or of the follow-up to an obscure, formulaic, or simply unsuccessful movie (or other work).[4][5]","cinematography":"Hanania Baer","directed_by":"Sam Firstenberg","Soundtrack":"Like its predecessor, much of the film's soundtrack was provided by Ollie & Jerry, comprising the duo Ollie E. Brown and Jerry Knight. The title track, \"Electric Boogaloo\", reached number 45 on the R&B charts.[10]","release_dates":"December 21, 1984[1]","produced_by":"Yoram Globus Menahem Golan Pieter Jan Brugge (executive producer) Shirts Stanley","starring":"Lucinda Dickey|Adolfo \"Shabba Doo\" Quiñones|Michael \"Boogaloo Shrimp\" Chambers|","running_time":"94 minutes","music_by":"Michael Linn","edited_by":"Sally Allen Bert Glatstein Bob Jenkis Marcus Manton Barry Zetlin","written_by":"Charles Parker Allen DeBevoise Jan Ventura Julie Reichert"}