{"country":"United States","distributed_by":"Summit Entertainment","Plot":"When industrialist-turned-anarchist Xavier Heimdahl arranges for his associate Jan Stroop- a hacker known as 'the Dutchman'- to create a wormhole program that would allow the owner to bypass all computer codes protecting the world's nuclear defence codes, the Dutchman panics and attempts to hand his secret over to the CIA. He makes contact with London-based agent Bill Pope, but although Pope is able to get the Dutchman to a safehouse and recover the money to pay him for his services, he is caught by Heimdahl's men and tortured to death before he can tell anyone where he hid the Dutchman.Desperate to find the Dutchman, Pope's CIA supervisor Quaker Wells contacts Dr. Mahal Franks, who has developed a treatment that could theoretically plant the memory patterns of a dead man onto a living one. Keeping Pope's brain stimulated to preserve its knowledge, Franks requests that convict Jericho Stewart be the subject of the procedure, as Stewart's criminal behaviour is the result of childhood brain trauma leaving him with an underdeveloped frontal lobe, hindering his emotional development and impulse control, that they can use to 'graft' Pope's knowledge into Stewart's mind.While the process initially appears unsuccessful, Jericho is able to escape custody while being transferred after the operation, faking his death and heading to Pope's house, where he ties Pope's wife Jillian to her bed and gags her mouth with duct tape, is able to disable the house alarms and delay an investigation of the silent alarm which Jillian manages to activate. As time goes on, he experiences memory flashes of Pope's past, but all he can determine is that the bag of money was hidden behind a shelf of books relating to George Orwell, without identifying where it or the Dutchman are kept.The CIA becoming increasingly anxious to find the Dutchman when they learn that he is now planning to sell the program to the Russians, believing that the CIA have betrayed him. Fortunately, they are able to find Jericho after he contacts Dr. Franks for medication using Pope's CIA codes, Franks' questioning confirming that Jericho is developing emotions as well as drawing on Pope's experience. As Jericho attempts to retrace the route Pope took to hide the Dutchman, Heimdahl creates a distraction at the airport that draws Quaker's attention, allowing Heimdahl's henchwoman Elsa to try and capture Jericho, killing his CIA guards before Jericho escapes by driving off a bridge.His leg injured in his escape, Jericho retreats to the Pope house, where he encounters Jillian and explains the situation to her. Although initially concerned, Jillian comes to accept Jericho's story as she sees him interacting with her daughter Emma, allowing Jericho to stay the night. The next morning, Jericho realises through a conversation with Jillian that the bag is hidden in the rare books collection at the University of London where Jill works. He attempts to retrieve the bag but he is captured by Heimdahl and Elsa once he has found it. Heimdahl forces him to take them to the Dutchman or he will kill Jillian and Emma.With the CIA and a Russian strike team now seeking the Dutchman, Jericho- who has recalled that Pope hid the Dutchman in Jill's office at the university- is able to escape Elsa using an improvised nitro-glycerine bomb, returning to the office to provide a hurried explanation to the Dutchman. The two are caught by Elsa before they can escape, but Jericho kills Elsa with a table lamp after she kills the Dutchman and shoots Jericho in the shoulder.Taking the flashdrive containing the wormhole program to the airfield where Heimdahl is attempting an escape, Jericho is able to save Jill and Emma despite Quaker's protests about the danger Heimdahl could pose with the program. As Heimdahl's plane takes off, Jericho reveals to Quaker that he had the Dutchman reprogram the wormhole so that it would target the source of the next transmission, resulting in Heimdahl unwillingly destroying his own plane when he tries to fire a missile at the airfield.A few months later, Jericho is shown on the beach where Pope and Jill had their honeymoon, initially unresponsive to anything but automatic reflexes and responses. With all other options exhausted, Quaker and Franks take Jill and Emma to see him, the sight of Pope's family confirming that some part of Pope exists in Jericho when he responds with a nose-tap that was Pope and Jill's way of saying 'I love you' in private. Witnessing this, Quaker reflects that he may offer Jericho a job.","language":"English","Reception":"As of May 24, 2016[update], Criminal has grossed $14.7 million in North America and $17.9 million in other territories for a worldwide total of $32.6 million.[3]In the United States and Canada, pre-release tracking suggested the film would gross $9–12 million from 2,683 theaters in its opening weekend, trailing fellow newcomers The Jungle Book ($67–75 million projection) and Barbershop: The Next Cut ($27–30 million projection).[28] The film ended up grossing just $5.8 million in its opening weekend, below expecations, and the 8th worst wide release opening of Costner's career, finishing 6th at the box office.[29]Criminal has received generally negative reviews from critics. On Rotten Tomatoes, the film has a rating of 33%, based on 103 reviews, with an average rating of 4.4/10. The site's consensus reads, \"Despite the valiant efforts of a game and talented cast, Criminal has little to offer beyond the bare minimum expected by the most undemanding of genre enthusiasts.\"[30] On Metacritic, the film has a score of 37 out of 100, based on 26 critics, indicating \"generally unfavorable reviews\".[31] Audiences polled by CinemaScore gave the film an average grade of \"B–\" on an A+ to F scale.[32]","box_office":"$34.1 million[3]","cinematography":"Dana Gonzales","production_company":"BenderSpink Campbell-Grobman Films Millennium Films","directed_by":"Ariel Vromen","release_dates":"April 7, 2016 (2016-04-07) (London)|April 15, 2016 (2016-04-15) (United States)||||","Production":"On June 20, 2013, it was announced that Millennium Films had acquired the script for Criminal, written by Douglas Cook and David Weisberg, an action film in which a dead CIA operative's memories, secrets, and skills are implanted into a dangerous prison criminal, who is sent on a government mission.[5] J.C. Spink, Chris Bender, Matthew O'Toole and Mark Gill produced the film.[5][6] On September 13, Millennium set Ariel Vromen to direct the film.[7]On June 17, 2014, Kevin Costner was cast to play the dangerous criminal with a dead CIA operative's skills, secrets, and memories implanted into him to finish a job.[8] On July 10, Gary Oldman was in talks to join the film to play the CIA chief.[9] On July 23, Tommy Lee Jones joined the film to play a neuroscientist who transplants the memories to the criminal, while Oldman's role was also confirmed.[10] On August 4, Ryan Reynolds was added to the cast.[11] On August 7, Alice Eve joined the cast of the film.[6] On August 11, Jordi Mollà joined the film in the villain role of Hagbardaka Heimbahl, who wants the dead CIA agent's secrets now implanted in the criminal's brain.[12] On August 12, Gal Gadot signed on to star in the film as Reynolds' character's wife.[13] On September 26, Antje Traue joined the film to play a terrorist's henchwoman.[14]Principal photography on the film began on September 4, 2014, in London.[15] On September 8, actor Reynolds was spotted on a bike during the filming of some scenes in the streets of London.[16] On September 16, Costner and Gadot were spotted at the Camber Sands during filming in East Sussex.[17] Some actors and crews were also spotted filming scenes for the film on King's Road in Kingston.[18] From September 22-25, filming was taking place in Yateley, Hampshire, where actors were spotted filming car crashes and helicopter chase scenes at the Blackbushe Airport.[19][20] Filming was also done in Croydon College in Croydon, with the college building used as medical research labs and the CIA operations centre.[21] In October 2014, Connect 2 Cleanrooms installed a cleanroom in Surrey Quays Road, London, for the scene where Tommy Lee Jones' character operates on Kevin Costner's.[22] On October 23, aerial drone filming was undertaken featuring Costner in a car chase scene on White's Row in East London.[23] Some filming also took place at the SOAS University of London library.[citation needed]On December 9, 2014, it was announced that Haim Mazar had signed on to compose the music of the film.[24] However, on June 10, 2015, according to Film Music Reporter, it was announced that Brian Tyler and Keith Power had taken over scoring duties on the film, replacing Mazar.[25]","produced_by":"Chris Bender|Christa Campbell|Boaz Davidson|Mark Gill|Lati Grobman|Matthew O'Toole|Trevor Short|J. C. Spink|John Thompson|","starring":"Kevin Costner|Gary Oldman|Tommy Lee Jones|Alice Eve|Gal Gadot|Michael Pitt|Jordi Mollà|Antje Traue|Scott Adkins|Amaury Nolasco|","running_time":"113 minutes[1]","criminal":"Theatrical release poster","music_by":"Brian Tyler|Keith Power|","edited_by":"Danny Rafic","Release":"The film was to be released on January 22, 2016 in the United States,[26] but in August 2015 the release was pushed back to April 15, 2016.[27]","written_by":"Douglas Cook|David Weisberg|","budget":"$31.5 million[2]"}