{"based_on":"Der Tod ritt dienstags by Rolf O. Becker (as Ron Baker, credit only)[1]","country":"Italy West Germany[2]","distributed_by":"Consorzio Italiano Distributori Indipendenti Film (CIDIF)","screenplay_by":"Ernesto Gastaldi Tonino Valerii Renzo Genta","language":"Italian English","Reception":"In his investigation of narrative structures in Spaghetti Western films, Fridlund ranges Day of Anger, together with Death Rides a Horse as prime examples of a \"tutorship variation\" that further develops the play on age/experience between the protagonists in For a Few Dollars More, with Lee Van Cleef playing the older partner in all three films. In the \"Tutorship\" films a younger protagonist seeks the more or less reluctant partnership of an older one, but differences of motivation eventually bring them into conflict.[5]","day_of_anger":"Italian film poster","cinematography":"Enzo Serafin","production_company":"Sancrosiap Corona Filmproduktion Divina-Film","directed_by":"Tonino Valerii","Releases":"Day of Anger was released in Italy on December 19, 1967 and in Germany on January 12, 1968.[2]","release_dates":"19 December 1967","produced_by":"Henryk Chrosicki Alfonso Sansone","starring":"Lee Van Cleef Giuliano Gemma Walter Rilla Christa Linder Yvonne Sanson","running_time":"114 minutes (Italy) 88 minutes (US)","music_by":"Riz Ortolani","Story":"Scott (Gemma) is a young man working as a street sweeper in a small town called Clifton. Scott is looked down upon by the town people, and he has never known his father and only knows his mother's first name was Mary. When Frank Talby (Van Cleef) rides into town and kills one of Scott's bullies, Scott realizes the opportunity to change his life, and decides to prove his worth as a gunfighter to him. Talby soon leaves town to go after Wild Jack (Al Mulock), his former associate who owes him 50,000 dollars. Scott follows him and Talby reluctantly lets him tag along and agrees to teach him a few rules about gunfighting.Talby and Scott find Wild Jack, but the man tells the pair that he does not have the money anymore, as he was double-crossed by the seemingly respectable citizens of Clifton. A gunfight ensues and Scott manages to convince Talby of his skills with a revolver. After taking care of Wild Jack's gang, the pair return to Clifton. With the help of Scott \"Mary\", as he was named by Talby, Talby quickly takes over the town, but Scott's fast draw has now become a threat to him. After he kills Scott's former mentor, the two decide to settle things in a shoot-out. Scott kills Talby in a duel and all of his gang by taking advantage of the rules Talby once taught him.","edited_by":"Franco Fraticelli"}