{"based_on":"Angela's Ashes  by Frank McCourt","country":"United States Ireland","distributed_by":"United States Paramount Pictures International Universal Studios","screenplay_by":"Laura Jones Alan Parker","angela's_ashes":"Theatrical release poster","language":"English","Overview":"Angela's Ashes tells the story of Frank McCourt and his childhood after his family are forced to move from the United States back to Ireland because of financial difficulties and family problems caused by his father's alcoholism. The film chronicles young McCourt's life in Limerick, Ireland, during his childhood in the 1930s and 1940s, the difficulties that arose, and Frank's way of earning enough money to return to the land of his dreams: America.","Reception":"With an estimated $25 million budget,[2] the film grossed $13,042,112 in the U.S.,[3] making it a box office bomb.Angela's Ashes currently holds a 52% 'rotten' rating on review aggregate website Rotten Tomatoes, and the consensus \"In spite of its attempts to accurately record Frank McCourt's memoirs, the onscreen adaptation fails to capture any of the drama or humor of his life\" (though the audience rating is considerably higher, at 82%.)[4] However, Michael Legge was praised for his portrayal of the adolescent Frank. In particular, he was said to excel in his role as an innocent teenager growing up with typical coming of age rites involving sexuality, maturity and peer pressure in a Catholic Irish setting.","box_office":"$13,042,112","cinematography":"Michael Seresin","production_company":"Scott Rudin Productions David Brown Productions Dirty Hands Productions","directed_by":"Alan Parker","Soundtrack":"The film soundtrack was composed and conducted by John Williams, and features songs by Billie Holiday and Sinéad O'Connor. Williams was nominated for the Academy Award for Best Original Score in 2000 for his score.","narrated_by":"Andrew Bennett","release_dates":"25 December 1999 (1999-12-25)|||||","Production":"Although set in Limerick, many street scenes were filmed in Cork. For example, the 'fleas in the mattress' scene was filmed at Farren Street, Blackpool and other scenes were shot at Roche's Buildings, Lower John Street and Barrack Street.[1]","produced_by":"David Brown Scott Rudin","starring":"Emily Watson Robert Carlyle Michael Legge Ciaran Owens Joe Breen","running_time":"145 minutes","music_by":"John Williams","edited_by":"Gerry Hambling","budget":"$25 million"}