{"based_on":"Characters  by Harris Goldberg Rob Schneider","Cast":"The film also includes cameos by comedic actor Adam Sandler and actress Elisabetta Canalis. Wes Takahashi, former animator and visual effects supervisor for Industrial Light & Magic, makes a cameo appearance as a news reporter.[2]","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Rob Schneider David Garrett Jason Ward","story_by":"Rob Schneider","Plot":"Gigolos in Europe are being terrorized by a serial killer. In Malibu, Deuce Bigalow's wife Kate has died from a shark attack, and Deuce is invited by his former pimp T.J. Hicks to Amsterdam. Deuce goes to take his mind off of Kate.After T.J. shows Deuce his boat, or \"float crib,\" the pair go to a coffee shop where they get high and bump into Heinz Hummer, a German gigolo. After leaving the coffee shop, Deuce finds Hummer dead in an alley, but thinks he is merely stoned and takes the dead gigolo to T.J.'s float crib; when T.J. gets back, he immediately realizes that Hummer is dead. T.J. plans to dump the body, but skeptical of Hummer's reputation of being well-endowed, unzips his pants and examines his genitalia and is caught by a tour boat.Upon his release from the police station, Deuce finds T.J. at a restaurant and recalls that he saw the killer walking away from Hummer's body. Deuce says it was a woman, so they both figure it was a she-john, a former client of the murdered gigolo. T.J. convinces Deuce to find the killer by becoming a gigolo again, visiting the former clients and \"rooting\" out the killer. They attend a meeting of the Royal Order of European Man Whores, but fail to procure a list of the clients.Deuce and T.J. visit the first client on the list. While Deuce distracts the woman, T.J. breaks into her residence and finds a brand of lipstick which might be the kind found on all the victims. After leaving, Deuce finds Gaspar on the street and shows him the lipstick. Gaspar throws the lipstick in the trash, mentioning that the lipstick found on the victims \"is a very rare one: Lavender Love #66\". As Gaspar enters the police station, his niece, Eva, approaches him and gives him his lunch. Eva slaps herself three times when Gaspar sneezes. Deuce helps her pick up the things she dropped, and Eva explains to Deuce that she has obsessive-compulsive disorder. Deuce sees that she has a painting of a fish, so they go to the Amsterdam aquarium together. Deuce continues to investigate different women from Antoine's book.Deuce rides with Gaspar to the Man-Whore Awards Ceremony under the guise of protecting the man-whores. Gaspar pulls a gun on Deuce and tells him that he was once a man-whore hopeful. While Gaspar was observing a demonstration on how to perform a certain sex act, one of his classmates offered to let him use his penis-enlargement pump. When the demonstration ended, Gaspar was horrified the demonstration was his fiancée. Gaspar was so angry and shocked that he continued to pump until his penis exploded, causing the other men to laugh at him. He blames man-whores for the loss of his fiancée and his penis, and plans to kill them all at their awards ceremony.At the ceremony, Deuce evacuates the building and gets into a swordfight with Gaspar, during which he mentions the other romantic ways of pleasing a woman; his words move the ladies in the crowd and the male gigolos. Gaspar beats Deuce, but before he can detonate the bomb, the woman with a penis for a nose and the woman with the tracheotomy distract Gaspar. Deuce knocks out Gaspar with a trophy taking the bomb detonator. For his bravery, Deuce is given the Golden Boner award. He shares a passionate kiss with Eva, and accidentally sets off the bomb when the statue's penis bumps the detonator button. Deuce and Eva leave the scene. The following day, Deuce and Eva come to pick up T.J., who has been released from jail, and tells them that he is entering a brand new prostitution market: gay man-whoring.In an epilogue: T.J. stops gay man-whoring and becomes a rapper, Deuce and Eva got married with Eva being pregnant, Gaspar becomes a man-whore in prison, Kate's prosthetic leg is turned into a bong by a lady without a leg and Norm Macdonald is mentioned again.","language":"English","Reception":"\"Speaking in my official capacity as a Pulitzer Prize winner, Mr. Schneider, your movie sucks.\"Movie review website Rotten Tomatoes lists 9% of 97 reviews as positive.[5]Roger Ebert gave the film a rare \"zero star\" rating, calling it \"aggressively bad, as if it wants to cause suffering to the audience\", and describing it as \"completely beneath contempt\" on his show Ebert & Roeper.[4] He ranked it as the worst film of 2005, and ultimately included the movie in his most hated films list.[6] Also on Ebert & Roeper, Richard Roeper called the film \"the cinematic equivalent of a bunch of 13-year-old boys in a locker room repeating dirty phrases they've just learned\" and \"dead on arrival.\"Ebert also chastized Rob Schneider for his overly-zealous defense of the series, referring to an incident in which Los Angeles Times critic Patrick Goldstein called Schneider a \"third-rate comic.\" Schneider responded by calling Goldstein a \"third-rate, unfunny pompous reporter\" in a full-page open letter published in Daily Variety and the Hollywood Reporter. Schneider further claimed that Goldstein was unqualified to review the film since he was not a Pulitzer Prize-winning journalist. Ebert, himself having won the Pulitzer Prize, took it upon himself to criticize Schneider in his own review.[4] He ended the review with the quote \"Your movie sucks\" which would later become the title of a book published by Ebert compiling reviews of films he had awarded below 2/4 stars.Ebert and Schneider ultimately settled their differences, and Schneider sent his well wishes to Ebert during his recovery from thyroid cancer. Ebert responded, \"Rob Schneider might (in my opinion) have made a bad movie. He is not a bad man.\"[7]The movie was nominated for five Razzie Awards, including Worst Picture, Worst Screenplay, Worst Remake or Sequel and Worst Screen Couple (Rob Schneider and his diapers) with Schneider winning Worst Actor.","box_office":"$45.1 million[1]","cinematography":"Marc Felperlaan","production_company":"Happy Madison Out of the Blue... Entertainment","directed_by":"Mike Bigelow","release_dates":"August 12, 2005 (2005-08-12)|||||","Production":"Eddie Griffin verified in an interview that \"a really old stuffed cat\" was used during the cat scene.[3]","Box office":"The film grossed $9,626,287 on its opening weekend, ranking at #5 behind Four Brothers, The Skeleton Key, The Dukes of Hazzard, and Wedding Crashers.The film's opening weekend was much lower than the first film's $12 million on its opening weekend.The movie closed it's run with a gross of $22,400,154 in North America and $22,709,407 internationally for a total of $45,109,561. This was lower than the first film's final gross of $65,538,755 in North America and a worldwide total of $92,938,755. Based on this, the film was a disappointment despite recovering its budget.","produced_by":"John Schneider Adam Sandler Jack Giarraputo","starring":"Rob Schneider Eddie Griffin Jeroen Krabbé Til Schweiger Kostas Sommer","running_time":"83 minutes","music_by":"James L. Venable","edited_by":"Peck Prior Sandy S. Solowitz","budget":"$22 million"}