{"based_on":"1408  by Stephen King","country":"United States","distributed_by":"Dimension Films Metro-Goldwyn-Mayer","screenplay_by":"Matt Greenberg Scott Alexander Larry Karaszewski","Plot":"Mike Enslin (John Cusack) is a cynical, skeptical author who, after the death of his daughter Katie (Jasmine Jessica Anthony), writes books appraising supernatural events in which he has no belief. After his latest book, he receives an anonymous postcard depicting The Dolphin, a hotel on Lexington Avenue in New York City bearing the message, \"Don't enter 1408.\" Viewing this as a challenge, Mike forces the hotel to allow him to book the room, referencing a law that any hotel room in New York can be requested as long as it meets safety standards. The hotel manager, Gerald Olin (Samuel L. Jackson) tries to dissuade Mike from checking into the room, explaining that 56 people have died in the room over the past 95 years, and that no one has lasted more than an hour inside it. Mike, who does not believe in the paranormal, insists on staying in the room, and asks Olin if he thinks it is haunted; Olin replies that it is \"evil\" rather than haunted.Once inside the room, Mike describes on his mini-cassette recorder the room's dull appearance and its unimpressive lack of supernatural phenomena. During his examination, the clock radio starts playing \"We've Only Just Begun\". Mike assumes that Olin is playing a trick to scare him. At 8:07, the song plays again and the clock's digital display changes to a countdown starting from \"60:00\". Mike experiences a series of supernatural events. A window sash slams down on his hand, the hotel operator calls about food he didn't order, and ghosts of the room's past victims and members of his family, particularly his daughter, appear on the TV set. Mike's attempts to leave the room are in vain; the doorknob breaks off, climbing through the air ducts prompts an attack from the corpse of a former room victim, and climbing onto the window ledge reveals the windows of the other rooms have disappeared.Mike uses his laptop to contact his estranged wife, Lily (Mary McCormack), but the sprinkler system short circuits his laptop. The room temperature drops to subzero when the laptop suddenly begins to work again, and Lily tells him the police have entered 1408, but the room is empty. A doppelgänger of Mike appears in a video chat window and urges Lily to come to the hotel herself; it gives Mike a wink. The room shakes violently and Mike breaks a picture of a ship in a storm. Water pours from the broken picture, flooding the room. He surfaces on a beach and relives a surfing accident seen earlier in the film. His life continues from this point, and he reconciles with Lily. Eventually he assumes his experience in 1408 was just a dream. Lily persuades him to write a book about it. When visiting the post office to send the manuscript to his publisher, he recognizes members of a construction crew as the Dolphin Hotel staff. They destroy the post office walls, revealing Mike is still trapped in 1408. A vision of his deceased daughter Katie appears to Mike, and after some reluctance he embraces her; she crumbles to dust. The clock radio begins playing \"We've Only Just Begun\" again, and Mike looks for it in the rubble. It counts down the final seconds. When the countdown ends, the room is suddenly restored to normal, and the clock radio resets itself to 60:00.The \"hotel operator\" calls Mike again. When Mike begs to be released, she informs him that he can relive the hour over and over again, or use their \"express checkout system\"; A hangman's noose appears and Mike has a vision of himself hanged, but he refuses to kill himself. Mike improvises a Molotov cocktail from a bottle of cognac given to him by Olin, and sets the room on fire. The fire alarm sounds, the hotel is evacuated, and Lily is prevented from entering. Mike breaks a window, causing a backdraft. Mike lies down upon the floor and covers his ears. A group of firefighters enter the room and drag Mike out before the room collapses on them. Mike tells the firefighters, \"Don't go in that room... It's evil.\"Mike and Lily move to Los Angeles, California. They are unpacking as Lily moves about the house. Mike begins to think again that his experiences were just a bad dream. He finds his tape recorder in a box and plays it. The sound of Mike's encounter with Katie is on the tape. Lily and Mike realize that the ordeal was real.","language":"English","Reception":"On the review aggregator Rotten Tomatoes, the film has a rating of 79% based on 170 reviews. The site's critical consensus reads \"Relying on psychological tension rather than overt violence and gore, 1408 is a genuinely creepy thriller with a strong lead performance by John Cusack.\"[12] On Metacritic, the film had an average score of 64 out of 100, based on 27 reviews.[13]James Berardinelli awarded the film three stars out of four, praising it as \"the best horror film of the year\". He offered significant praise for Cusack's performance as Mike Enslin, writing that \"this is John Cusack's movie to carry, and he has no problem taking it where it needs to go\". He found the film to be a refreshing experience, believing it \"reminds us what it's like to be scared in a theater rather than overwhelmed by buckets of blood and gore\".[14] Many critics believed the film to be far superior to other adaptations of Stephen King novels and stories. Mick LaSalle of the San Francisco Chronicle wrote a very positive review, describing the film as \"one of the good Stephen King adaptations, one that maintains its author's sly sense of humor and satiric view of human nature\". He ultimately believed the film to be a \"more genuinely scary movie than most horror films\".[15]Several critics, however, found the film to be underwhelming. Wesley Morris of The Boston Globe wrote a mixed review, describing the film as \"a lot of consonants and no vowels\". He went on to compare the film unfavorably to The Shining, a similar King adaptation, believing 1408 lacked that film's \"lunging horror and dramatic architecture\". Although he believed the film \"conjures a wonderful anticipatory mood of dread in the first 30 minutes\", he ultimately believed the film \"then blows it to stylish smithereens\".[16] Rob Salem of the Toronto Star awarded the film two stars out of four, believing it to be a predictable, \"hit and miss\" production. Like Morris, Salem wrote that \"Even as haunted hotel King movies go, 1408 is certainly no Shining. Not even the TV-movie version.\"[17]In its opening weekend, the film opened in second place at the box office, grossing US$20.6 million in 2,678 theaters.[18] 1408 had a production budget of US$25 million.[19] The film went on to gross US$132 million, of which US$71.9 million was from Canada and the United States.[19]","box_office":"$132 million[2]","cinematography":"Benoît Delhomme","directed_by":"Mikael Håfström","Home media":"The DVD was released on October 2, 2007 with a standard 1-Disc Edition (widescreen or fullscreen), and a 2-Disc Collector's Edition that contains both versions of the ending and an unrated edition of the film which restored 6 more minutes of the film.[20]","Alternate endings":"In addition to the ending that appears in the theatrical release version, three other endings were shot. None of the four endings match the ending of King's original short story.Director Mikael Håfström said that the ending for 1408 was reshot because test audiences felt that the original ending was too much of a \"downer\".[3] This first alternate ending was used in the theatrical release. The original discarded ending had Mike dying in the fire, but happy to see the room destroyed. During Mike's funeral, Olin approaches Lily and Sam. He unsuccessfully attempts to give her a box of Mike's possessions, including the tape recorder. Olin claims that the room was successfully destroyed and that it will no longer hurt anyone else. He later listens to the recording in his car, and becomes visibly upset when he hears Katie's voice on the tape. He looks in the car mirror and sees a vision of Enslin's burnt corpse in the back seat. Olin places the tape recorder back in the box and drives off. The final scene is of the gutted room, where an apparition of Mike looks out the window while smoking a cigarette. He hears his daughter calling his name, and disappears as he walks toward her. A door is heard closing and the scene fades to black.This ending is the default ending on the Blu-ray release and two-disc collector's edition. Canadian networks Space and The Movie Network, and U.S. network FX broadcast this version of the film, but Space broadcast the theatrical ending on July 23, 2012. This ending is also used on the U.K. and Australian DVDs, and the U.S. iTunes, Netflix and Amazon Prime versions of the film. The incentive for filming three alternate endings was based on the director's belief that King's intention, in his original short story, was to leave the conclusion ambiguous.Another ending uses elements from both the theatrical ending and the discarded original ending. Mike dies in the fire; afterwards Olin remarks, \"Well done, Enslin. Well done.\" Instead of the funeral scene, the sounds of a funeral are dubbed over establishing shots of Los Angeles. Lily and Sam sort through Mike's effects in Lily's new home. Sam says, \"Well, at least he went out in a blaze.\" Lily gives him a look of disapproval. Sam returns to his New York office, sorts through his mail, and discovers the manuscript that Mike wrote about Room 1408, written after Mike thought he had awakened from a dream. As Sam reads the story, audio from Mike's experiences in the room is heard. In a final scene, Sam's office doors slam shut and Mike's father's voice says, \"As I was, you are. As I am, you will be.\"In a third alternate ending, Mike survives and moves to Los Angeles with Lily. When he plays the tape of Katie's voice from 1408, Lily hears it and looks shocked. Mike stares at Lily intently.","release_dates":"June 22, 2007 (2007-06-22)|||||","Production":"In November 2003 and 2004, Dimension Films optioned the rights to the 1999 short story \"1408\" by Stephen King. The studio hired screenwriter Matt Greenberg to adapt the story into a screenplay.[4] In October 2005, Mikael Håfström was hired to direct 1408, with the screenplay being rewritten by screenwriters Scott Alexander and Larry Karaszewski.[5] In March 2006, actor John Cusack was cast to star in the film,[6] joined by actor Samuel L. Jackson the following April.[7] In July, actress Kate Walsh was cast to star opposite Cusack as the protagonist's ex-wife,[8] but she was forced to exit in August due to scheduling conflicts with her role on Grey's Anatomy. She was replaced by actress Mary McCormack.[9] According to Cusack, the Roosevelt Hotel in New York was used for some of the exterior shots of the Dolphin.[10] The lobby scenes were filmed at the Reform Club in London.[11]","produced_by":"Lorenzo di Bonaventura","starring":"John Cusack Samuel L. Jackson Mary McCormack Tony Shalhoub Len Cariou Isiah Whitlock, Jr. Jasmine Jessica Anthony","running_time":"106 minutes 112 minutes (unrated cut)","1408":"Theatrical release poster","music_by":"Gabriel Yared","edited_by":"Peter Boyle","budget":"$25 million[1]"}