{"based_on":"The Executioners  by John D. MacDonald","country":"United States","distributed_by":"Universal International","screenplay_by":"James R. Webb","Plot":"After spending eight years in prison for rape, Max Cady (Robert Mitchum) is released. He promptly tracks down Sam Bowden (Gregory Peck), a lawyer whom he holds personally responsible for his conviction because Sam interrupted his attack and testified against him. Cady begins to stalk and subtly threaten Bowden's family. He kills the Bowden family dog, though Sam cannot prove Cady did it. A friend of Bowden's, police chief Mark Dutton (Martin Balsam), attempts to intervene on Bowden's behalf, but he cannot prove Cady guilty of any crime.Bowden hires private detective Charlie Sievers (Telly Savalas). Cady brutally attacks a promiscuous young woman named Diane Taylor (Barrie Chase) when she brings him home, but neither the private eye nor Bowden can persuade her to testify. Bowden hires three thugs to beat up Cady and persuade him to leave town, but the plan backfires when Cady gets the better of all three. Cady's lawyer vows to have Bowden disbarred.Afraid for his wife Peggy (Polly Bergen) and 14-year-old daughter Nancy (Lori Martin), Bowden takes them to their houseboat in Cape Fear. In an attempt to trick Cady, Bowden makes it seem as though he has gone to a completely different location. He fully expects Cady to follow his wife and daughter, and he plans on killing Cady to end the battle. A local deputy and he hide nearby, but Cady realizes the deputy is there and kills him. Eluding Bowden, Cady first attacks Mrs. Bowden on the boat, causing Bowden to go to her rescue. Meanwhile, Cady swims back to shore to attack the daughter. Bowden realizes what has happened and also swims ashore.The two men engage in a final violent fight on the riverbank. Bowden overpowers Cady, but decides not to kill him, preferring to let him spend the rest of his life in jail. The film ends with the Bowden family sitting together on a boat the next morning.","language":"English","Reaction":"Upon its release, the film received positive but cautious feedback from critics due to the film's content. Review aggregator Rotten Tomatoes reports that 95% of 20 critics have given the film a positive review, with a rating average of 7.6 out of 10.[7]Bosley Crowther of the New York Times praised the \"tough, tight script\", as well as the film's \"steady and starkly sinister style.\" He went on to conclude his review by saying, \"this is really one of those shockers that provokes disgust and regret.\"[8] The entertainment-trade magazine Variety reviewed the film as \"competent and visually polished\", while commenting on Mitchum's performance as a \"menacing omnipresence.\"[9]Although it makes no acknowledgement of Cape Fear, the episode \"The Force of Evil\" from the 1977 NBC television series Quinn Martin's Tales of the Unexpected uses virtually the same plot, merely introducing an additional supernatural element to the released prisoner.[10][11]The film serves as the basis for the 1993 episode of The Simpsons \"Cape Feare\" in which Sideshow Bob, recently released from prison, stalks the Simpson family in an attempt to kill Bart.In 2001, the film was ranked number 61 on the American Film Institute's list of the top 100 suspense/thriller movies in American cinema.[12] Max Cady (Robert Mitchum) ranks number 28 on the American Film Institute's 2003 list of the top 50 movie villains of all time.[13] In April 2007, Newsweek selected Cady as one of the 10 best villains in cinema history. Specifically, the scene where Cady attacks Sam's family was ranked number 36 on Bravo's 100 Scariest Movie Moments in 2004.[14]A consumer poll on the Internet Movie Database rates Cape Fear as the 65th-best trial film, although the trial scenes are merely incidental to the plot.[15]","cinematography":"Sam Leavitt","production_company":"Melville Productions Talbot Productions","directed_by":"J. Lee Thompson","release_dates":"April 12, 1962 (1962-04-12) (United States)|April 18, 1962 (1962-04-18) (New York City, New York)||||","Production":"Rod Steiger wanted to play Max Cady, but he backed off when he heard Mitchum was considering the role.[citation needed] Telly Savalas was screentested for the role, but later played private eye Charlie Sievers.[1]Charles Bronson, James Coburn, Charlton Heston, Jack Palance, and John Wayne, were all considered for the role of the attorney, Sam Bowden.[citation needed] Peck was a last-minute replacement for Heston, who was originally cast.[citation needed]Jim Backus was set to play attorney Dave Grafton.[citation needed]Thompson had always envisioned the film in black and white prior to production. As an Alfred Hitchcock fan, he wanted to have Hitchcockian elements in the film, such as unusual lighting angles, an eerie musical score, closeups, and subtle hints rather than graphic depictions of the violence Cady has in mind for the family.The outdoor scenes were filmed on location in Savannah, Georgia, Stockton, California, and the Universal Studios backlot at Universal City, California. The indoor scenes were done at Universal Studios Soundstage. Mitchum had a real-life aversion to Savannah, where as a teenager, he had been charged with vagrancy and put on a chain gang. This resulted in a number of the outdoor scenes' being shot at Ladd's Marina in Stockton, including the culminating conflict on the houseboat at the end of the movie.This scene where Mitchum attacks Polly Bergen's character on the houseboat was almost completely improvised.[citation needed] Before the scene was filmed, Thompson suddenly told a crew member: \"Bring me a dish of eggs!\" Mitchum's rubbing the eggs on Bergen was not scripted and Bergen's reactions were real. She also suffered back injuries from being knocked around so much. She felt the impact of the \"attack\" for days.[2] While filming the scene, Mitchum cut open his hand, leading Bergen to recall: \"his hand was covered in blood, my back was covered in blood. We just kept going, caught up in the scene. They came over and physically stopped us.\"[3]In the source novel The Executioners, by John D. MacDonald, Cady was a soldier court-martialed and convicted on then Lieutenant Bowden's testimony for the brutal rape of a 14-year-old girl. The censors stepped in, banned the use of the word \"rape\", and stated that depicting Cady as a soldier reflected adversely on U.S. military personnel.[citation needed]Bernard Herrmann, as often in his scores, uses a reduced version of the symphony orchestra. Here, other than a 46-piece string section (slightly larger than usual for film scores), he adds four flutes (doubling on two piccolos, two alto flutes in G, and two bass flutes in C) and eight French horns. No use is made of further wind instruments or percussion.[4]In his 2002 book A Heart at Fire's Center: The Life and Music of Bernard Herrmann, Stephen C. Smith writes:\"Yet Herrmann was perfect for Cape Fear ... Herrmann's score reinforces Cape Fear's savagery. Mainly a synthesis of past devices, its power comes from their imaginative application and another ingenious orchestration ... a rehearsal for his similar orchestration on Hitchcock's Torn Curtain in 1966. Like similar \"psychological\" Herrmann scores, dissonant string combinations suggest the workings of a killer's mind (most startlingly in a queasy device for cello and bass viols as Cadey prepares to attack the prostitute). Hermann's prelude searingly establishes the dramatic conflict: descending and ascending chromatic voices move slowly towards each other from their opposite registers, finally crossing–just as Bodens and Cadey's game of cat-and-mouse will end in deadly confrontation.\"[5]","Distribution":"Although the word \"rape\" was entirely removed from the script before shooting, the film still enraged the censors, who worried that \"there was a continuous threat of sexual assault on a child.\" To accept the film, British censors required extensive editing and deleting of specific scenes. After making around 6 minutes of cuts, the film still nearly garnered a British X rating (meaning at the time, \"Suitable for those aged 18 and older\", not necessarily meaning there was sexually explicit or violent content).[citation needed]Cape Fear was first made available on VHS on March 1, 1992. It was later re-released on VHS, as well as DVD, on September 18, 2001. The film was released onto Blu-ray on January 8, 2013. It contains production photos and a \"making-of\" featurette.[6]","produced_by":"Sy Bartlett","starring":"Robert Mitchum Gregory Peck Martin Balsam Polly Bergen Lori Martin","running_time":"105 minutes","cape_fear":"Cape Fear movie poster","music_by":"Bernard Herrmann","edited_by":"George Tomasini"}