{"country":"United Kingdom","Awards and nominations":"Fenella Woolgar was nominated for the London Film Critics Circle Award for British Supporting Actress of the Year, the Empire Award for Best Newcomer and the British Independent Film Award for Most Promising Newcomer.Stephen Fry was nominated for the Emden Film Award at International Filmfest Emden, and the production was nominated for the Empire Award for Best British Film.","distributed_by":"Film Four","Plot":"The primary characters are earnest aspiring novelist Adam Fenwick-Symes and his fiancée Nina Blount. When Adam's novel Bright Young Things, commissioned by tabloid newspaper magnate Lord Monomark, is confiscated by HM customs officers at the port of Dover for being too racy, he finds himself in a precarious financial situation that may force him to postpone his marriage. In the lounge of the hotel where he lives, he wins £1000 by successfully performing a trick involving sleight of hand, and the Major offers to place the money on the decidedly ill-favored Indian Runner in a forthcoming horserace. Anxious to wed Nina, Adam agrees, and the horse wins at odds of 33–1, but it takes him more than a decade to collect his winnings.Meanwhile, Adam and Nina are part of a young and decadent crowd, whose lives are dedicated to wild parties, alcohol, cocaine, and the latest gossip reported by columnist Simon Balcairn, known to his readers as Mr. Chatterbox. Among them are eccentric Agatha Runcible, whose wild ways eventually lead her to being committed in a mental institution; Miles, who is forced to flee the country to avoid prosecution for his homosexuality; Sneath, a paparazzo who chronicles the wicked ways of the young and reckless; and Ginger Littlejohn, Nina's former beau, who ingratiates himself back into her life, much to Adam's dismay. The pastimes of the young, idle rich are disrupted with the onset of World War II, which eventually overtakes their lives in often devastating ways.","language":"English","Critical reception":"A.O. Scott of the New York Times said, \"Mr. Fry revels in the chaos of the plot, and the profusion of arch one-liners and zany set pieces gives the picture a hectic, slightly out-of-control feel. Sometimes you lose track of who is who, and where the various characters are going—but then, so do they. Subplots and tangents wander into view and then fade away, and in the end it all comes together and makes sense, more or less…Period dramas set on the eve of World War II are a dime—or maybe a shilling—a dozen, but what distinguishes this one is its dash and vigor. It does not seem to have been made just for the sake of the costumes and the vintage cars. The camera, rather than composing the action into a presentable pageant, plunges in, capturing the madness of the era in a swirl of colors and jolting close-ups. And Mr. Fry's headlong style helps rescue the movie from the deadly trap of antiquarianism\".[4]Roger Ebert of the Chicago Sun-Times said the film has \"a sweetness and tenderness\" and observed that Stephen Fry was \"the obvious choice to direct this material.\" He added, \"He has a feel for it; to spend a little time talking with him is to hear inherited echoes from characters just like those in the story. He supplies a roll-call of supporting actors who turn up just long enough to convince us entire movies could be made about their characters\".[5]Carla Meyer of the San Francisco Chronicle called the film a \"witty, energetic adaptation\" but thought \"Fry, so deft with lighthearted moments, seems uncomfortable with Waugh's moralizing, and more serious scenes fall flat\". She added, \"Bright Young Things is like a party girl on her fourth martini. What had been fun and frothy turns irretrievably maudlin\".[6]Peter Travers of Rolling Stone felt Fry was \"clever\" for adapting Waugh's novel \"into a movie that would make Paris Hilton feel at home,\" although \"By the time [he] lets darkness encroach on these bright young things…the fizz is gone, and so is any reason to make us give a damn\".[7]Derek Elley of Variety called the film \"a slick, no-nonsense adaptation…an easy-to-digest slice of literate entertainment for upscale and older auds that lacks a significant emotional undertow to make it a truly involving—rather than simply voyeuristic—experience…Fry's script fillets out even the few traces of a darker underside that creep through in the second half of Waugh's original. Modern auds, accustomed to more emotional payback for the characters' earlier excesses, will come away empty-handed. There's basically very little dramatic arc to the whole picture. Still, Fry and his tech team have put together a good-looking, smooth-running movie\".[8]Michael Wilmington of the Chicago Tribune described it as \"a brilliant, giddy satiric romp with a discreetly moralistic viewpoint beneath its high-style wit,\" \"a ball to watch,\" and \"an incredibly entertaining film with a magnificent cast,\" and called Fry \"a splendid director capable of visual dazzle and superb ensemble work\".[9]","box_office":"$2,682,600[1]","cinematography":"Henry Braham","directed_by":"Stephen Fry","release_dates":"3 October 2003","Production":"The film marked the feature film screenwriting and directorial debut of actor Stephen Fry. Fry also makes a very brief cameo appearance in the film as a chauffeur. The assistant director was Jo Crocker, Stephen Fry's sister who made her debut in television.The film proved to be the last for John Mills, who appears briefly in the non-speaking role of an elderly party guest enthralled by the effects of cocaine.The character of Lord Monomark is based on Lord Beaverbrook, who once employed Evelyn Waugh as a writer for his newspaper, the Sunday Express. Waugh's original name for his character was \"Lord Ottercreek\", before his lawyers intervened.[2] Monomark, like Beaverbrook, a Canadian, is played by Dan Aykroyd, a Canadian.Exteriors were shot at various locations in and around London, including the Old Royal Naval College in Greenwich and Eltham Palace. Interiors were filmed in Pinewood Studios.The soundtrack features several standards of the era, including \"Nina,\" \"Twentieth Century Blues,\" \"Dance, Little Lady,\" and \"The Party's Over Now,\" all performed by Noël Coward, \"Mairzy Doats\" by The Merry Macs, and \"Hear My Song, Violetta\" by Victor Silvester and His Orchestra.The film premiered at the Cannes Film Festival in May 2003, and was shown at the Toronto Film Festival before its Royal European Charity Premiere in London on 28 September 2003. It went into theatrical release in the UK on 3 October 2003, the same day it was shown at the Dinard Festival of British Cinema in France.In the US, the film was shown at the 2004 Sundance Film Festival, the Portland International Film Festival, the US Comedy Arts Festival in Aspen, the Cleveland International Film Festival, the Philadelphia International Film Festival, the Newport International Film Festival and the Provincetown International Film Festival before going into limited release on 20 August. It eventually grossed $931,755 in the US and £869,053 in the UK.[3]","produced_by":"Gina Carter Miranda Davis","starring":"Emily Mortimer Stephen Campbell Moore Fenella Woolgar Michael Sheen James McAvoy Dan Aykroyd Jim Broadbent Peter O'Toole","running_time":"106 minutes","bright_young_things":"Original poster","music_by":"Anne Dudley","edited_by":"Alex Mackie","written_by":"Stephen Fry Based on the novel Vile Bodies by Evelyn Waugh"}