{"country":"United States Canada","distributed_by":"Universal Pictures (North America) Warner Bros. Pictures (International)","Plot":"The film begins in 2007 with Will Atenton (Daniel Craig) leaving his job as a successful editor in New York in order to spend more time with his wife Libby (Rachel Weisz) and their two daughters, and to write his own book. At first, the family appears to be living the American dream in their new home, until they discover that its previous occupants were murdered there.Will discovers that five years earlier, a mother and her two small daughters were shot to death in the Atenton home. Public opinion has condemned the father of this family, Peter Ward, as the one responsible for this crime. However, there was not enough evidence to convict Peter in court, and he was also deemed mentally unfit to stand trial. We then learn that Peter has recently been released from police custody.Will is convinced that Peter has returned to the scene of his crimes and is now plotting to murder the Atenton family. Libby and the girls are frightened because they’ve seen a man peering in the windows. When Will finds that the police won’t take him seriously, he decides that it's up to him to protect his family from the killer by tracking Peter down.Will visits Greenhaven Psychiatric facility, where Peter was held for five years. Here he learns that on the night of the murders, Peter himself was shot in the head by his wife Elizabeth, who had somehow gotten hold of the murder weapon in the moments just before her death. In recovery, Peter couldn’t believe he’d committed the murders, and so he no longer believed he was Peter Ward. He chewed his own name off all of his identification bracelets/cards/tags, leaving only his Greenhaven I.D. sequence: W1 - 1L 8 -10 -10: Will Atenton. Peter Ward and Will Atenton are the same person.Unable to believe this, Will/Peter rushes home and we see his home as it actually stands: overgrown, in disrepair, boarded up, and spray painted with “Child Killer!” Peter visits his neighbor, Ann Patterson (Naomi Watts). Ann had been a good friend to the Wards, and never believed Peter was the killer. She visited him at Greenhaven but didn’t have the heart to break his alternate reality. Peter returns to his house, where Ann later joins him to tell him that he needs to get out of there and away from its horrible memories. Peter finally remembers that horrible night.We discover that Peter was on the phone with Libby as he walked towards his door. She said, “I heard you come in. Is that you downstairs?” to which he replied that he was still outside, but she insisted that she knew he was inside. Hearing someone coming up the stairs, the little girls ran to greet their daddy, but found a stranger. Still on the phone, Libby stepped into the hallway, and Peter heard her say, \"Put the gun down, please.\" Alarmed, Peter ran into the house. The gunman fatally shot the little girls and wounded Libby. Peter tackled the gunman and the men scuffled on the stairs, with the gunman dropping his weapon. As she lay dying, Libby took the gun and shot from the top of the stairs, hitting Peter.Suddenly, in the present day, Ann's ex-husband Jack and the gunman burst into the now-decrepit Ward home. It is revealed that the hitman had been hired to kill Ann, but broke into the wrong house and chose to kill the witnesses. Peter and Ann are knocked unconscious and dragged to the cellar. Jack shoots the hitman, the only other witness to the whole mess, in the abdomen before staging the scene so it will appear that Peter has murdered again. Jack douses the basement in kerosene. Peter regains consciousness in time to fight off Jack and rescue Ann. As Peter and Ann make it out of the house, Jack starts up the cellar steps but is doused with kerosene by the dying hitman, and Jack goes up in flames. The house burns to the ground.Having found out the truth about what happened to his family and why, Peter is able to say goodbye to the apparitions of his family and make peace with himself.The film ends with a shot of Peter back in New York City. As he walks past a major bookseller’s window, we see that “Dream House” by Peter Ward has become a number one national bestseller.","dream_house":"Theatrical release poster","language":"English","Reception":"The film was not screened in advance for critics, and was critically panned. Review aggregation Rotten Tomatoes gives the film a score of 6% based on reviews from 82 critics, with a rating average of 3.7 out of 10 and an audience rating of 35%. The consensus states: \"Dream House is punishingly slow, stuffy and way too obvious to be scary.\"[9] Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, gives the film a score of 35/100 based on 16 reviews.[10]","Premise":"Publisher Will Atenton (Daniel Craig) quits a lucrative job in New York to relocate his wife, Libby (Rachel Weisz), and their daughters to a quaint town in New England. As they settle into their home, however, the Atentons discover that a woman and her children were murdered there, and the surviving husband is the town's prime suspect. With help from a neighbor (Naomi Watts) who was close to the murdered family, Will pieces together a horrifying chain of events.","box_office":"$38.5 million","cinematography":"Caleb Deschanel","production_company":"Morgan Creek Productions","directed_by":"Jim Sheridan","Soundtrack":"The score to Dream House was composed by John Debney and conducted by Robert Ziegler. Christian Clemmensen, reviewer of Filmtracks.com, gave it four out of five stars, declaring it \"among the biggest surprises of 2011\" and stating, \"It's not clear how badly Debney's work for Dream House was butchered by the studio's frantic last minute attempts to make the film presentable, but Debney's contribution does feature a cohesive flow of development that is, at least on album, a worthy souvenir from this otherwise messy situation.\"[8] The soundtrack was released 11 October 2011 and features fifteen tracks of score at a running time of fifty-six minutes.","release_dates":"September 30, 2011 (2011-09-30)|||||","Production":"Director Jim Sheridan clashed with Morgan Creek’s James G. Robinson constantly on the set over the shape of the script and production of the film.[4] Sheridan then tried to take his name off the film after being unhappy with the film and his relationship with Morgan Creek Productions.[5]Reportedly, Sheridan, Daniel Craig and Rachel Weisz disliked the final cut of the film so much that they refused to do press promotion or interviews for it.[6] The trailer, cut by Morgan Creek Productions, came under fire for revealing the main plot twist of the film.[6][7]","produced_by":"Jim Sheridan|James G. Robinson|David C. Robinson|Daniel Bobker|Ehren Kruger|","starring":"Daniel Craig|Rachel Weisz|Naomi Watts|Marton Csokas|","running_time":"92 minutes[1]","music_by":"John Debney","edited_by":"Barbara Tulliver","written_by":"David Loucka","budget":"$50 million[2]"}