{"country":"Taiwan","distributed_by":"Cine Qua Non Films","Plot":"The film takes place over the course of a few years in Taiwan, and is about a student in junior high, Xiao Si'r. Xiao Si'r is the fourth child of a large family living in Taipei. The family lives modestly off of the father's government job, and it is clear that both Si'r's mother and father are uncomfortable in Taiwan. The film opens in 1959, as Si'r's father fruitlessly pleads with a school administrator to keep Si'r in day school, as opposed to the night school, which is inhabited by delinquents. The morning after, Si'r and his father listen to the radio, which is broadcasting a list of students accepted into various schools in Taipei.The film then advances to 1960, where Si'r, along with his best friend, Cat, are furtively watching the filming of a period drama in a movie studio. Caught by a guard in the rafters, they steal his flashlight and flee the studio, returning to their school. Si'r, noticing movement in a darkened classroom, turns on the flashlight and startles a pair of lovers, whose identities remain unclear. The film then proceeds to introduce Si'r's classmates and peers, most notably two gangs of students, the Little Park Boys, the children of civil servants, and the 217s, the children of military officers. These two gangs continuously fight one another, and although Si'r is friendlier with the members of the Little Park Boys, he is not a member of either gang.Also introduced is Ming, the girlfriend of Honey, leader of the Little Park Boys, who is in hiding at the time. Si'r and Ming meet and become friends, and Si'r develops a crush on Ming, who claims to be eagerly awaiting Honey. Si'r's father is aware that Si'r's friends are mostly delinquents and, after Si'r is pressured into letting a gang member cheat off of his test, warns Si'r to stay out of trouble, especially gang-related trouble. At the same time, Sly, the acting leader of the Little Park Boys, proposes a truce between them and the 217s, and arranges for a concert of Western pop music to be held with members from both gangs. Cat, the soprano of the group, phonetically transcribes the lyrics of Elvis Presley's Are You Lonesome Tonight?, with the help of Si'r's eldest sister, who speaks English.Preparations for the concert appear to be going well until Honey, wearing the stolen uniform of a sailor as a disguise, unexpectedly resurfaces and berates Sly for setting up the concert. Honey realizes that neither the Little Park Boys nor the 217s respect him any longer, and at the same time takes a liking to the indifferent Si'r. The night before the concert, Honey meets with Xiao Si'r and introduces him to the older gang of criminals he is associated with, and explains the reasons for his disappearance. He had killed one of the 217s - supposedly over Ming- and fled to avoid arrest. Honey also \"bequeaths\" Ming to Si'r, believing Si'r to be more stable.The following night, the concert is performed and becomes a wild success. Honey appears outside of the concert hall, demanding to be let in for free and insulting the leaders of the gangs. He briefly attacks several gang members before being subdued by the leader of the 217s, who agrees to talk to Honey. While walking along a road and discussing the concert, Honey is suddenly pushed into the street by the leader of the 217s and is hit by a car. While the next morning's news reports call Honey's death an accident, it is clear to all of the gangs that Honey was murdered. Ming is initially devastated by Honey's death, but soon recovers, and begins to show interest in Si'r. Soon, a typhoon hits Taipei, and Honey's associates, in the midst of the storm, massacre the 217s, whom Si'r finds butchered. On that same night, Si'r's father is arrested by the secret police. He is forced to leave his home without understanding why he has been arrested.The focus of the film briefly shifts to Si'r's father. He has been arrested because of his former (non-political) associations with Communists in mainland China. He is initially subject to sleep deprivation and then other forms of exhaustion, though he cannot remember critical details about these figures or his friendships with them. After several days, the officials in charge of Si'r's father realize that he poses no threat to security and order his release. He is relieved to be home, although he is fired from his civil service job as a result of the arrest.Si'r, meanwhile, has begun a relationship with Ming, and seems to be improving his schoolwork. After a nurse (ironically, the same person that introduced Ming and Si'r) berates Si'r for talking to Ming, Si'r swears at her, and is sent to the administrator's office again. As Sir's father and the administrator argue over Si'r's qualities as a student, Si'r grabs a baseball bat (the school had earlier decreed that it would confiscate all baseball bats on school grounds) and shatters a lightbulb. This act gets him expelled from school, and, along with his father's arrest, earns him the distrust of his fellow students.Si'r studies to re-take the entrance exams for his school, and aims to become reinstated in the day school, something that brings pride to his father. Ming begins to pay Si'r less and less attention; however, and Si'r soon discovers that Ming has been cheating on Si'r with Ma, the son of a rich general with whom Ming and her sickly mother are living. Si'r confronts both Ma and other classmates about Ming and discovers that Ming has a history of cheating. The identities of the lovers in the classroom are revealed as Ming and Sly, and Si'r begins to suspect that Ming has never really liked him.Si'r returns to Ma's house, this time armed with a knife, but he does nothing beyond speak to Ma and soon leaves. He walks to the market and meets Ming there. Ming indirectly confirms Si'r's suspicions, and and becomes both annoyed and scared of Si'r when she realizes that he is armed. She shouts at him and eventually attempts to run away, but Si'r draws her into an embrace and fatally stabs her. Ming slumps into the street, dead, as Si'r regretfully calls to Ming, asking her to stop playing dead.Si'r is arrested and treated with contempt at the police station, as the police believe his crime to be particularly heinous. In the ensuing media frenzy, Si'r and Ming's life are closely examined by the press, but no one is able to understand why he murdered Ming. Si'r is convicted of the murder and sentenced to death, which is later commuted to a lengthy time in prison. A couple of years into the sentence, Cat, the only one of Si'r's friends to support him, tries to visit Si'r. Failing that, he leaves a tape for Si'r, the tape of Are You Lonesome Tonight? that Cat had listened to and sang over. As soon as Cat leaves, the officer in charge of packages for prisoners tosses the tape into the garbage, confident it contains nothing of value.The final scene is set in Si'r's house, now almost devoid of furniture. Si'r's mother is hanging up clothes to dry when she unexpectedly finds Si'r's school uniform. As she starts to sob into it, the radio starts to broadcast its list of distinguished students.","language":"Mandarin Shanghainese Taiwanese Hokkien","Themes":"According to film critic Godfrey Cheshire, the film has \"two faces, just as it has two titles\" due to the sudden change of plots the film experiences halfway its running time. A Brighter Summer Day notoriously shifts from a fraught, violent story about teenage gangs to a more introspective and family-oriented movie where the main character passively witness how his father is accused of espionage, his brother is in huge debt and his mother suffers in silence. Cheshire explains this transition of \"faces\" as it follows:The “outward” face is a highly critical view of a society in which all proper authority—a very Confucian concern—has been eroded or undermined, so that a young man like Xiao Si’r can be hurled into the spiral of violence indicated by the film’s Chinese title, which translates as “The Youth Killing Incident on Guling Street,” referring to a notorious crime that inspired the film. The “inward” face, meanwhile, indicated by the lyrics of the 1960 Elvis Presley hit “Are You Lonesome Tonight?” which gives the film its English title, has little to do with Taiwan and much to do with a condition unbound by time or place: the loneliness, melancholy, and longing of adolescence. [8]","Critical reception":"The film received much critical acclaim and was awarded several wins in Golden Horse Film Festival, Asia Pacific Film Festival, Kinema Junpo Awards and Tokyo International Film Festival. Three different versions of the film were edited: the original 237 minute version, a three-hour version and a shorter 127 minute version.[2]A Brighter Summer Day is ranked number 98 in the prestigious list They Shoot Pictures, Don't They?, making it one of the most recent entries in the top 100; its position is presumed to rise after the release of the new digital restoration.[6] Additionally, according to They Shoot Pictures, Don't They?, A Brighter Summer Day is the most acclaimed film of 1991.[7]","cinematography":"Hui-kung Chang Long-yu Zhang","production_company":"Yang & His Gang Filmmakers Jane Balfour Films","a_brighter_summer_day":"Film poster","directed_by":"Edward Yang","release_dates":"July 27, 1991 (1991-07-27)|||||","Production":"Set in early 1960s, in Taipei, the film is based on a real incident that the director remembers from his school days when he was 13.[2] The original Chinese title, 牯嶺街少年殺人事件, translates literally as \"The Murder Incident of the Boy on Guling Street\", referring to the 14-year-old son of a civil servant who murders his girlfriend, who was also involved with a teenaged gang leader, for unclear reasons. The gang leader and girlfriend are involved in the conflict between gangs of children of formerly-mainland families and those of Taiwanese families. The film places the murder incident in the context of the political environment in Taiwan at that time. The film's political background is introduced in intertitles thus:Millions of Mainland Chinese fled to Taiwan with the National Government after its civil war defeat by the Chinese Communists in 1949. Their children were brought up in an uneasy atmosphere created by the parents' own uncertainty about the future. Many formed street gangs to search for identity and to strengthen their sense of security.[3]Chang Kuo-Chu, and his son Chang Chen (in his debut) are both cast in this film playing father and son.","produced_by":"Wei-yen Yu","starring":"Chang Chen Lisa Yang Chang Kuo-Chu Elaine Jin","running_time":"237 minutes","edited_by":"Bowen Chen","Release":"In 2009, the World Cinema Foundation issued a restoration of A Brighter Summer Day, using the original 35mm camera and sound negatives provided by the Edward Yang Estate.[4]On December 17, 2015, The Criterion Collection announced the official North American DVD and Blu-ray release of a new 4K digital restoration of the film in its original running time. This release would mark the first time A Brighter Summer Day is released on home video in the United States, after more than two decades of obscurity due to difficulty in finding an official copy of the film. The release will include a new English subtitle translation, an audio commentary featuring critic Tony Rayns, an interview with actor Chang Chen; Our Time, Our Story, a 117-minute documentary from 2002 about the New Taiwan Cinema movement, featuring interviews with Yang and film-makers Hou Hsiao-hsien and Tsai Ming-liang, among others; a videotaped performance of director Edward Yang’s 1992 play Likely Consequence; an essay by critic Godfrey Cheshire, and a 1991 director’s statement by Yang.[5]","written_by":"Hong-ya Yan Ming-tang Lai Shun-ching Yang Edward Yang"}