{"based_on":"Anywhere but Here  by Mona Simpson","country":"United States","Awards and nominations":"Golden Globe AwardsYoung Artist AwardsHollywood Makeup Artist and Hair Stylist Guild Awards","distributed_by":"20th Century Fox","screenplay_by":"Alvin Sargent","Plot":"Adele August (Susan Sarandon) is an eccentric woman who, with her reluctant daughter Ann (Natalie Portman), leaves a small Wisconsin town and moves to Beverly Hills to realize her dreams. However, it becomes apparent that Adele is uncertain of what those dreams are - expressing ideas such as marrying a rich man - and often makes irresponsible and impulsive decisions, such as purchasing a used Mercedes she cannot afford in order to drive to Beverly Hills. While upset with Adele's decisions, the more practical Ann finds she cannot leave her mother and resents her for leaving Ann's stepfather for a better life. Furthermore, Ann still loves her father, who left her family when Ann was still young.When living in Beverly Hills, Adele improvises from day to day, often unable to pay the bills. She winds up dating a successful dentist, but learns that he doesn't love her and has dumped her for a younger woman. Things get complicated when Adele has a fight with Jimmy and Ann starts dating her crush, Peter. Forcing her daughter to enroll in Beverly Hills High School, where a lot of rich kids and movie star kids go to, Adele hopes that Ann will become an actress and attend UCLA, despite Ann's interest in going away to Brown University. Though Adele fails in many respects, she eventually accepts her daughter's plans and decides to help her.","language":"English","Reception":"The film received positive reviews from critics. It currently holds a 64% on Rotten Tomatoes. The consensus reads: \"The clever reversal of roles between Portman and Sarandons' characters (Portman is constantly worried and looking out for her mother, not vice versa) makes the movie interesting and worth watching. Transcends the tired cliche well.\"[1]Roger Ebert of the Chicago Sun-Times gave the film three stars and noted \"The movie's interest is not in the plot, which is episodic and 'colorful,' but in the performances. Sarandon bravely makes Adele into a person who is borderline insufferable. Sarandon's role is trickier and more difficult, but Portman's will get the attention. In 'Anywhere But Here,' she gets yanked along by her out of control mother, and her best scenes are when she fights back, not emotionally, but with incisive observations.\"[2]","box_office":"$23,631,929","cinematography":"Roger Deakins","directed_by":"Wayne Wang","Soundtrack":"A soundtrack to the film was released on November 2, 1999,[5] ten days before the theatrical release. The soundtrack was distributed by Atlantic Records and Wea.The soundtrack features original music by Lisa Loeb, Danny Elfman and k.d. lang. It also featured tracks by artists such as LeAnn Rimes, Sarah McLachlan, and Pocket Size, as well as other various artists. Rimes' song, \"Leaving's Not Leaving\", was released as a B-side track with her single, \"Big Deal\", on September 28, 1999.[3]","narrated_by":"Natalie Portman","release_dates":"November 12, 1999 (1999-11-12)|||||","Box office":"The film opened at #5 at the North American box office and made $5.6 million USD in its opening weekend.","produced_by":"Laurence Mark","starring":"Susan Sarandon Natalie Portman Shawn Hatosy","running_time":"109 minutes","anywhere_but_here":"Movie poster","music_by":"Danny Elfman","budget":"$23 million"}