{"country":"United States","distributed_by":"Universal Pictures","blackhat":"Theatrical release poster","Plot":"At a nuclear plant in Chai Wan, Hong Kong, a hacker causes the coolant pumps to overheat and explode. Not long after in Chicago, the Mercantile Trade Exchange gets hacked, causing soy futures to rise. The Chinese government and the FBI determine that the hack was caused by a Remote Access Tool (RAT). A military officer in China's cyber warfare unit, Captain Chen Dawai (Leehom Wang), is tasked to find the people responsible for the attacks, and enlists the aid of his sister Chen Lien (Tang Wei), a networking engineer. He meets with FBI Agent Carol Barrett (Viola Davis) in Los Angeles and reveals the code in the RAT was written by himself and Nicholas Hathaway (Chris Hemsworth), his college roommate, in their school days, years before Hathaway was sent to prison for an unrelated hack. Dawai asks that the FBI arrange for Hathaway to be released from prison, where he is serving a sentence for computer crimes. Hathaway is offered temporary release in exchange for his services.A dead colleague's computer yields a clue to a connection, so Hathaway and Lien go to the rendezvous but it is a trap set by the hacker to alert him to pursuit. Hathaway fights three men.In Hong Kong, the team traces the stock trade money to a known paramilitary named Kassar. A stakeout team is murdered while Hathaway, Jessup, Chen, Trang along with a Special Duties Unit team raid Kassar's hideout but once again it is a trap. A shootout ensues and Trang as well as a number of SDU officers are killed. Kassar and his men escape.The nuclear plant has stabilized enough to retrieve a data drive from the control room but it is corrupted. Agent Barrett turns a blind eye while Hathaway hacks into the NSA to use a classified data tool called Black Widow to reconstruct the corrupted data. He learns that the hacker's server is based in Jakarta. Lien finds out the hacker has been buying satellite photos of a site near Seri Manjung, Malaysia.Hathaway's hack into the NSA does not go unnoticed and the US government demands his return to prison. Dawai's superiors agree as they do not want to antagonize the US, while Barrett and her partner Agent Jessup receive orders to detain Hathaway. Dawai, Lien and Hathaway manage to elude their pursuers and make plans to leave Hong Kong and continue their investigation when they are attacked by Kassar and his men, who have been following them. Dawai is killed; shortly after, Barrett and Jessup, who have been tracking Hathaway using an ankle bracelet, arrive at the scene. While both Barrett and Jessup are killed in a firefight, they buy enough time for Lien and Hathaway to escape into the subway.Hathaway and Lien travel to the location of the satellite photos in Malaysia to try and figure out the hacker's goal. Hathaway realizes that the hacker's attack at the nuclear plant was merely a test for a later plan to destroy several major tin mines in Malaysia, allowing the hacker to make a fortune trading tin futures, financed using the funds from the Mercantile Exchange hack. The two then travel to Jakarta and using a distraction manage to physically gain access to the hacker's server. They manage to transfer the hacker's money from his Hong Kong bank and force the hacker to contact them. The hacker and Hathaway agree to meet to negotiate the return of the money, supposedly in exchange for Hathaway's involvement in the larger scheme.Hathaway insists the hacker and Kassar come alone but they bring their gang along. The meeting place is a crowded parade and Hathaway trails the hacker and Kassar from behind. Kassar pulls a gun on Hathaway but Hathaway is prepared and manages to stab him with a hidden screwdriver. Two of the hacker's men catch up and wound Hathaway, who manages to kill them. Hathaway finally faces off with the hacker and manages to kill him despite getting stabbed. He escapes the chaos of the parade with Lien's help, and then gets patched up. The film ends with Lien and Hathaway leaving Indonesia, with the hacker's money still in their bank account.","language":"English","Reception":"On Rotten Tomatoes the film holds a rating of 34%, based on 161 reviews, and an average rating of 4.9/10. The site's critical consensus reads, \"Thematically timely but dramatically inert, Blackhat strands Chris Hemsworth in a muddled misfire from director Michael Mann.\"[42] On Metacritic, the film has a score of 51 out of 100, based on 37 critics, with 16 positive reviews, 12 mixed reviews, and 9 negative reviews, indicating \"mixed or average reviews\".[43] According to CinemaScore, audiences gave the film a grade of \"C−\" on an A+ to F scale.[44]For many critics, a significant issue of the film is the casting of Chris Hemsworth as a hacker.[45][46][47] Christy Lemire of the Chicago Sun-Times stated in her review, \"Anyone who makes his or her way in the world sitting in front of a computer screen all day is not going to look as hunky as Hemsworth.\"[48] However, Manohla Dargis from The New York Times gave the film a largely positive review stating, “Michael Mann’s thriller ‘Blackhat,’ a story about the intersection of bodies and machines, is a spectacular work of unhinged moviemaking.”[49] Kenneth Turan from The Los Angeles Times also gave it a positive review, writing, “It lures us in with the promise of up-to-the-minute villainy, but the satisfactions of ‘Blackhat’ are surprisingly old school.”[50] The Hollywood Reporter’s Sheri Linden noted, “The essential problem of cyber-thrillers is one that even so gifted a director hasn’t quite solved, particularly in the film’s first half: Characters looking at computer screens and explaining the significance of what they see doesn’t make for the most riveting viewing.”[51] Matt Zoller Seitz, the Editor-in-Chief of RogerEbert.com, gave Blackhat three and a half out of four stars, stating in his review, \"‘Blackhat’ is mainly about what happens when the real world is annexed by the virtual: what it does to geography and relationships; how it signal-jams our species' sense of time as a series of self-contained moments, and substitutes an existence that can feel like an endless, intrusive buzz.\"[52]Although Blackhat received generally mixed-to-negative reviews, many critics found merit in its filmmaking to include it in their \"best-of\" lists for 2015.[53] In Sight & Sound magazine's poll for the best films of 2015, 6 critics voted for the film as one of the five best films of the year.[54]","box_office":"$19.7 million[3]","cinematography":"Stuart Dryburgh","production_company":"Legendary Pictures Forward Pass","directed_by":"Michael Mann","Soundtrack":"The film score was composed by Harry Gregson-Williams[1] and Atticus Ross.[1] Upon viewing the film, however, Gregson-Williams posted a message on Facebook stating that his score went almost unused in the final edit, which included synthesized music not prepared by him or by Ross.[13] He went on to say that, \"I therefore reluctantly join the long list of composers who have had their scores either sliced and diced mercilessly or ignored completely by Michael Mann.\"[14] He stated that although he is credited for the score, the final film \"contains almost none of my compositions\".[15] He would later delete the status update containing this information.[15]Mann later explained that he often prefers to use more than one composer \"to rotate among different emotional perspectives\", stating, \"If a composer wants to have his music stand alone, he should be a recording artist and let his work contest itself in that arena.\"[16]","release_dates":"January 8, 2015 (2015-01-08) (Los Angeles premiere)|January 16, 2015 (2015-01-16)||||","Production":"In an interview done at the LMU Film school, Michael Mann said he was inspired to make Blackhat after reading about the events surrounding Stuxnet, which was a computer worm that targeted and reportedly ruined almost one fifth of Iran's nuclear centrifuges.[5] In keeping with his high standard for authenticity, Mann brought in several technical advisors and consultants like former hackers Christopher McKinley and Kevin Poulsen (senior editor for Wired News), to make the film as authentic as possible.[6] McKinley was famous for hacking the online dating site, OkCupid, in order to make his profile the most attractive to women.[7] Director Mann also met with Mike Rogers, who was Chairman of the Permanent Select Committee on Intelligence until 2015. Parisa Tabriz, who manages Google's information security engineering team, said that \"It's the most accurate information security film I've seen.\"[8]The film was tentatively titled Cyber, however the final title was revealed on July 26, 2014 during a panel at San Diego Comic-Con International, and it was being estimated that it might qualify for the Oscars.[9] The first official trailer for the film was released on September 25, 2014.[10]Filming began on May 17, 2013, in Los Angeles, California; Hong Kong; Kuala Lumpur, Malaysia; and at Lapangan Banteng in Jakarta, Indonesia.The film would be Mann's first feature to be shot entirely using digital cameras. Although Collateral, Miami Vice and Public Enemies were predominantly digital features, Mann employed 35mm sparingly.Director Mann donated HK$300,000 (US$38,500) to The Community Chest of Hong Kong in the name of Hang Seng Bank, to thank the bank for allowing him to film Blackhat for five evenings in the bank's lobby area.[11]In November 2013, Universal set the North American release date for January 16, 2015.[12]","produced_by":"Thomas Tull|Michael Mann|Jon Jashni|","starring":"Chris Hemsworth|Tang Wei|Viola Davis|Ritchie Coster|Holt McCallany|Yorick van Wageningen|Wang Leehom|","running_time":"133 minutes[2]","music_by":"Harry Gregson-Williams[1]|Atticus Ross[1]|","edited_by":"Joe Walker|Stephen E. Rivkin|Jeremiah O'Driscoll|Mako Kamitsuna|","Release":"Blackhat opened on January 16, 2015, against the wide release of American Sniper, an \"unexpected juggernaut\"[17] which set records for the largest January opening weekend in history.[18] Blackhat was a box office bomb, opening at #11 and earning only $1.7 million on its opening day. It made just $4.4 million for the weekend against its $70 million budget.[19] This made the movie one of the worst debuts ever for a movie playing in over 2,500 locations.[20]An in-depth analysis by industry trade publication Deadline of why Blackhat did not perform primarily examined the marketing strategy as “the major challenge they were unable to overcome” [21] with independent tracking services supporting this conclusion: “total awareness for Blackhat was in the 40-50% range on January 4 and grew to 50-60% on January 15 (versus American Sniper’s 80-90%).” [21] Additionally, “the film wasn’t helped by a marketing campaign that failed to convey a sophisticated plot and a romance… Blackhat instead chased a young audience with action footage that did not seem fresh.” [21]After only two weeks, Universal decided to yank the film from all but 236 theaters. It had been in 2,568 theaters, making it the sixth-biggest drop in history for a third-week film.[22]Internationally, the film grossed $2.33 million in 19 territories in its opening weekend.[23] It played below expectations in markets including Denmark, Greece, Poland, Taiwan, Turkey and Vietnam.[24] Deadline credited Lee Hom Wang and Tang Wei’s inclusion with increased success in other nations including Indonesia, Malaysia, Singapore, and Thailand.[23] In its third weekend, the film grossed $1.8 million with openings of $595,000 and $446,000 in Russia and Spain, respectively.[25] In its fourth weekend, the film grossed $1.2 million for a total of $8.4 million, with its top opener in Germany at $526,000.[26]Due to the less-than-stellar numbers at the American and Asian box-office, Universal Pictures International opted not to release Blackhat theatrically in Australia.[27] The film was also scrapped for a theatrical release in Belgium.[28]In the aftermath, Legendary took a $90 million write-down on the film.[29]On February 20, 2015, Blackhat debuted in the UK.Blackhat was released on Blu-ray and DVD on May 12, 2015 in North America. The Blu-ray edition includes both a DVD copy of the film and a voucher for an UltraViolet/iTunes digital copy, as well as three featurettes: \"The Cyber Threat\", \"On Location Around the World\", and \"Creating Reality\".[30][31] The DVD edition contains only one featurette: \"Creating Reality\".[32]In Australia, the film was originally slated to be released theatrically on February 25, 2015, but due to its poor performance at the US box office, it was instead released straight to home video on May 14, 2015.[33][34][35] In the UK, the film was also released on Blu-ray and DVD on June 22, 2015.[36][37]Michael Mann premiered a re-edited Director's Cut of the film at the Brooklyn Academy of Music on February 20, 2016.[38] The re-edited version played once, as part of a retrospective series of Mann's films.[39] The primary change in this cut was the movement of the film's nuclear reactor attack sequence from the opening to the middle of the film.[40] Mann originally intended to place the reactor sequence in the middle, but moved it to the beginning of the theatrical cut just before its release.[41]","written_by":"Morgan Davis Foehl|Michael Mann|","budget":"$70 million[3]"}