{"country":"United Kingdom","distributed_by":"Indie Rights","Plot":"A meeting of friends descends into a sinister game when one of them accuses the wife of his best friend of infidelity.[2]","language":"English","Reception":"Following the film's Irish première, NextProjection called the film a \"juicy jaunt of a tale,\" and said that \"like a Raymond Chandler 'cannibalisation', Candlestick may feed off the familiar, but it's the sport with which it spits it back out that makes it feel so fresh\".[10]The film won three awards at the 30 Dies Fantastic Film Festival, Andorra: best screenplay (Forgács W. András and Christopher Presswell); best original score (Jonathan Armandary); and best actor, shared by Andrew Fitch, Isla Ure, Nigel Thomas and Tom Knight.[11]The film received a mention for its screenplay at the Overlook: CinemAvvenire Film Festival 2014 in Rome.[12]","cinematography":"Haider Zafar","production_company":"Workbus","directed_by":"Christopher Presswell","Publicity":"On 19 November 2015 a post on titled \"This is how movies are delivered to your local theater\"[13] containing pictures of the film's DCP hard drive went viral, reaching the fabled #1 spot on Reddit, and gathering widespread social media attention. The images were viewed over 1 million times before being reposted by 9GAG,[14] and becoming the subject of an article in The Independent.[15]","release_dates":"14 October 2014 (2014-10-14) (IndieCork Film Festival)|11 April 2015 (2015-04-11) (United States)||||","Production":"The film was shot in London during November 2012. Presswell has cited the work of Alfred Hitchcock, particularly Rope and Dial M for Murder, as an influence on the film.[3][4]","starring":"Andrew Fitch Isla Ure Nigel Thomas Tom Knight","running_time":"83 minutes","music_by":"Jonathan Armandary","Release":"Candlestick made its UK debut on 8 October 2014 at the Aberdeen Film Festival,[5] with further festival screenings at IndieCork,[6] Horrorfest (South Africa)[7] and the Bratislava International Film Festival.[8]In November 2014, Candlestick opened the 30 Dies Fantastic Film Festival in Andorra,[2] and was among the first non-Chinese-language films shown at the Europe China Image Film Festival.[9]In January 2015 the company announced that the film would open in the United States on 11 April of that year, and be released on VOD, DVD and Blu-ray.[1]","written_by":"Forgács W. András Christopher Presswell"}