{"based_on":"Cosmopolis  by Don DeLillo","country":"Canada France Italy Portugal","distributed_by":"eOne Films","screenplay_by":"David Cronenberg","cosmopolis":"Theatrical release poster","Plot":"Twenty-eight-year-old billionaire currency speculator/asset manager Eric Packer rides slowly across Manhattan amid traffic jams, in his state-of-the-art luxury stretch limousine office, to his preferred barber. Various visitors discuss the meaning of life and inconsequential trivia. The traffic jams are caused by a visit of the President of the United States and the funeral of Eric's favorite musician, a rap artist whose music he plays in one of his two private elevators. Despite devastating currency speculation losses over the course of the day, Packer fantasizes about buying the Rothko Chapel.He meets his wife, Elise, in her taxi, for coffee, in a bookstore, as well as outside a theater. She declines sex with him. Packer has sex with two other women. When after a day of poor trading he destroys a large part of his wealth, his wife takes this as a reason to dissolve their union.Anti-capitalist activists demonstrate on the street. They wave rats and declare \"A spectre is haunting the world: the spectre of capitalism\". They spray-paint Packer's limo and later one subjects him to a pieing. Packer learns that an assassin is out to kill him, but seems curiously uninterested in who the person might be.In his car, his doctor performs his daily medical checkup. Eric worries about the doctor's finding that he has an asymmetrical prostate. As the currency speculation wipes out most of his fortune, Eric's world begins to disintegrate. Eventually he kills his bodyguard. At the destination, the barber, who knew his father, cuts Eric's hair on one side. The barber and limo driver discuss their respective careers driving cabs. The barber gives Eric his gun because he had thrown away the bodyguard's gun.Eric follows a path of further self-destruction, visiting his potential murderer, former employee Richard Sheets a.k.a. Benno Levin. Eric seems ready to commit suicide, but instead deliberately shoots himself in the hand. Sheets/Levin, who feels adrift in the capitalist system, explains that Eric's mistake in speculating was looking for perfect symmetry and patterns in the currency market: he should have looked for the lopsided—his body with its asymmetrical prostate was telling him this. The film ends with the potential murderer holding a gun to Eric's head threatening to kill him, but does not show a final shot.","Accolades":"","language":"English","Reception":"Cosmopolis received generally positive reviews. Rotten Tomatoes gave the film a \"fresh\" 64%, based on 165 reviews. The consensus says, \"Though some may find it cold and didactic, Cosmopolis benefits from David Cronenberg's precise direction, resulting in a psychologically complex adaptation of Don DeLillo's novel.\"[26]Justin Chang of Variety wrote: \"An eerily precise match of filmmaker and material, Cosmopolis probes the soullessness of the 1% with the cinematic equivalent of latex gloves. ... Pattinson's excellent performance reps an indispensable asset.\"[27] Robbie Collin of The Telegraph gave the film four stars out of five, stating, \"It's a smart inversion of Cronenberg’s 1999 film eXistenZ: rather than being umbilically connected to a virtual world, Packer is hermetically sealed off from the real one. At its heart is a sensational central performance from Robert Pattinson as Packer. Pattinson plays him like a human caldera; stony on the surface, with volcanic chambers of nervous energy and self-loathing churning deep below.\"[28] Ross Miller of Thoughts On Film also gave the film four out of five stars stating that, \"If, like me, you’re in-tune with the tone, style and direction of the film then it provides for a fascinating and intellectually nourishing experience.\"[29] Owen Gleiberman of Entertainment Weekly stated, \"Cosmopolis includes its own version of the Occupy hordes: scruffy, vengeful protesters who run around the streets, and into restaurants, brandishing the bodies of dead rats. ... Pattinson, pale and predatory even without his pasty-white vampire makeup, delivers his frigid pensées with rhythmic confidence.\"[30] A very positive review came from The London Film Review, which said \"The fact is, Cronenberg made a movie for YOU. The 99%. A movie that reflects, comments on[,] satirizes and parodies our time.\"[31]However, Todd McCarthy of The Hollywood Reporter criticized the film, writing, \"Lifeless, stagey and lacking a palpable subversive pulse despite the ready opportunities offered by the material, this stillborn adaptation of Don DeLillo’s novel initially will attract some Robert Pattinson fans but will be widely met with audience indifference.\"[32] Film magazine Sight & Sound listed Cosmopolis at #8 on its list of best films of 2012,[33] and Cahiers du Cinema placed it at #2.[34]","box_office":"$6.1 million[5]","cinematography":"Peter Suschitzky","production_company":"Canal+ France 2 Cinéma Téléfilm Canada Alfama Films Toronto Antenna Prospero Pictures","directed_by":"David Cronenberg","Music":"The soundtrack reunited composer Howard Shore and the Canadian indie rock band Metric who had previously collaborated on a song for Twilight Saga: Eclipse soundtrack (which had also starred Robert Pattinson). While writing the score for Cosmopolis, Shore desired a particular live sound and invited Metric to perform the score and co-write three songs. The music was recorded in November 2011 at the band's own Giant Studios in Toronto, produced by Shore and Metric guitarist Jimmy Shaw and mixed by John O'Mahony at Liberty Studios in Toronto and Electric Lady Studios in New York City. The Cosmopolis soundtrack also features \"Mecca\" by Somali-Canadian singer/rapper K'naan with lyrics by K'naan and Don DeLillo.[20] Film Music Magazine's Daniel Schweiger praised the soundtrack as \"an environment of hallucinatory beauty. There’s a real intelligence to the rock-alt. material here that goes beyond many indie star-composer collaborations.\"[21]The soundtrack album features four songs.[22] James Christopher Monger of Allmusic.com lauded Emily Haines for her \"strong vocal performances on the ghostly \"Long to Live\" and \"Call Me Home,\" switching to a full-on banshee wail for the pulsating \"I Don't Want to Wake Up\"\" and wrote that the score was \"one of the most engaging soundtracks of the year.\"[23] \"Long to Live\" won Achievement in Music: Original Song at the 1st Canadian Screen Awards.[24][25]","release_dates":"25 May 2012 (2012-05-25) (Cannes)|8 June 2012 (2012-06-08) (Canada)|17 August 2012 (2012-08-17) (US)|||","Production":"News about a film adaptation of Cosmopolis first emerged on 10 February 2009 when Geoffrey Macnab, writing for Screendaily.com, reported that \"In his most ambitious project to date, international producer Paulo Branco is plotting a $10m–12m film based on the novel Cosmopolis by legendary US writer Don DeLillo. Branco's Alfama Films is producing the film about a day in the life of a young billionaire financier who, over the course of a traumatic day, loses all his wealth. A director will be named shortly and DeLillo is on board to collaborate.\"[10] On 26 July 2009, it was announced that Canadian director David Cronenberg had become involved in the project and would now bring the novel to the screen. The film was scheduled to begin filming in 2010, with Paulo Branco's Paris-based production house Alfama Films co-producing with Cronenberg's Toronto Antenna Ltd.[11] On 3 September 2009, Paulo Branco officially confirmed to Screendaily.com that \"Cronenberg has now finished his screenplay and is now looking to cast the film.\"[12] On 13 January 2010, it was reported that Cronenberg was still committed to the film, although a cast and a starting date for production were yet to be announced. Cronenberg said that everyone was \"happy with the script\" and he was \"very fond\" of the project.[13] Principal photography took place in Toronto and was completed in July 2011. Colin Farrell was initially cast in the main role but left due to scheduling difficulties with Total Recall.[14] He was later replaced by Pattinson. Marion Cotillard was involved in the project but also left because of scheduling conflicts.[15]","produced_by":"David Cronenberg Paulo Branco Renee Tab Martin Katz","starring":"Robert Pattinson Paul Giamatti Samantha Morton Sarah Gadon Mathieu Amalric Juliette Binoche Jay Baruchel Kevin Durand","running_time":"109 minutes[3]","music_by":"Howard Shore Metric[1][2]","edited_by":"Ronald Sanders","budget":"$20.5 million[4]"}