{"based_on":"Dark Victory 1934 play  by George Emerson Brewer, Jr. Bertram Bloch","Cast":"Cast notes:","country":"United States","distributed_by":"Warner Bros.","Plot":"Judith Traherne (Bette Davis) is a young, carefree, hedonistic Long Island socialite and heiress with a passion for horses, fast cars, and too much smoking and drinking. She initially ignores severe headaches and brief episodes of dizziness and double vision, but when she uncharacteristically takes a spill while riding, and then tumbles down a flight of stairs, her secretary and best friend Ann King (Geraldine Fitzgerald) insists she see the family doctor, who refers her to a specialist.Dr. Frederick Steele (George Brent) is in the midst of closing his New York City office in preparation of a move to Brattleboro, Vermont, where he plans to devote his time to brain cell research and scientific study on their growth. He reluctantly agrees to see Judith, who is cold and openly antagonistic toward him. She shows signs of short-term memory loss, but dismisses her symptoms. Steele convinces her the ailments she is experiencing are serious and potentially life-threatening, and puts his career plans on hold to tend to her.When diagnostic tests confirm his suspicions, Judith agrees to surgery to remove a malignant brain tumor. Steele discovers the tumor cannot be completely removed, and realizes she has less than a year to live. The end will be painless but swift—shortly after experiencing total blindness, Judith will die.In order to allow her a few more months of happiness, Steele opts to lie to Judith and Ann and assures them the surgery was a success. As a poor liar, Ann is suspicious and confronts Steele, who admits the truth. Steele tells Ann, \"she must never know\" she is going to die soon. She agrees to remain silent and continue the lie.Judith and Steele become involved romantically and eventually engaged. While helping his assistant pack the office prior to their departure for Vermont, Judith discovers her case history file containing letters from several doctors, all of them confirming Steele's prognosis. Assuming Steele was marrying her out of pity, Judith breaks off the engagement and reverts to her former lifestyle. One day, her stablemaster Michael O'Leary (Humphrey Bogart), who for years has loved her from afar, confronts her about her unruly behavior and she confesses she is dying. Their conversation convinces her she should spend her final months happy, dignified, and with the man she loves. She apologizes to Steele, she and Steele marry, and move to Vermont. (Throughout the film Judith and O'Leary engage in arguments about the prospects of a colt, Challenger. O'Leary insists Challenger will never make a racehorse while Judith sees him as a future champion, and just before her death O'Leary admits she was correct.)Three months later, Ann comes to visit. She and Judith are in the garden planting bulbs when Judith comments on how odd it is she still feels the heat of the sun under the rapidly darkening skies. She realizes she actually is losing her vision and approaching the end. Steele is scheduled to present his most recent medical findings – which hold out the long-term prospect of a cure for this type of cancer – in New York, and Judith, making an excuse to remain home, helps him pack and sends him off. Then, after bidding Ann, her housekeeper Martha (Virginia Brissac), and her dogs farewell, she climbs the stairs and enters her bedroom. She kneels briefly at the side of her bed, apparently praying, then lies down on the bed. Martha, who has followed her, drapes a blanket over her. Judith asks to be left alone, and Martha withdraws. The camera focuses on the motionless Judith as the screen becomes blurry, fades to black, and the film ends.","dark_victory":"theatrical release poster","language":"English","Reception":"Frank S. Nugent, in his review in The New York Times, observed: \"A completely cynical appraisal would dismiss it all as emotional flim-flam, a heartless play upon tender hearts by a playwright and company well versed in the dramatic uses of going blind and improvising on Camille. But it is impossible to be that cynical about it. The mood is too poignant, the performances too honest, the craftsmanship too expert. Miss Davis, naturally, has dominated—and quite properly—her film, but Miss Fitzgerald has added a sentient and touching portrayal of the friend, and George Brent, as the surgeon, is—dare we say?—surprisingly self-contained and mature. This once we must run the risk of being called a softy: we won't dismiss Dark Victory with a self-defensive sneer.\"[7]Variety called the film \"intense drama\" and \"a nicely produced offering [with] Bette Davis in a powerful and impressive role.\"[8]Time Out London critic Tom Milne writes: \"[Davis] and [director Edmund] Goulding almost transform the soap into style; a Rolls-Royce of the weepie world.\"[9]On TCM.com, Margarita Landazuri said the \"Dark Victory was a three-hanky hit. Filmgoers and critics alike knew their emotions were being manipulated, but so expertly and touchingly that they couldn't help but cheer.\"[3]The film was included at #32 in AFI's 100 Years... 100 Passions.","Adaptations and remakes":"Barbara Stanwyck and Melvyn Douglas starred in a 1938 adaptation of the play presented on Lux Radio Theatre, and the following year Davis and Spencer Tracy appeared in another radio version.[1] On March 6, 1952, CBS Radio's Hollywood Sound Stage aired a condensed 30-minute version starring Stanwyck and David Brian,[11][12]In 1963, the film was remade as Stolen Hours with Susan Hayward and Michael Craig, directed by Daniel Petrie. The time frame was updated and the locale changed to England. In 1976, it was remade under its original title as an NBC television movie starring Elizabeth Montgomery as television producer Katherine Merrill under the care of Dr. Michael Grant, portrayed by Anthony Hopkins; this version was directed by Robert Butler.[1] In 1953, the film was remade under its original title for a TV adaptation for the Broadway Television Theatre, starring Sylvia Sidney, Christopher Plummer, and Ian Keith.","cinematography":"Ernest Haller","production_company":"Warner Bros.","directed_by":"Edmund Goulding","Awards and honors":"Bette Davis was nominated for the Academy Award for Best Actress but lost to Vivien Leigh in Gone with the Wind. Max Steiner, who was nominated for the Academy Award for Best Original Score for both this and Gone with the Wind, lost to Herbert Stothart for The Wizard of Oz. The film itself lost the Academy Award for Best Picture to Gone with the Wind.The New York Times named Dark Victory as one of the \"10 Best Films of 1939\", as did Film Daily, and the National Board of Review picked both Bette Davis and Geraldine Fitzgerald for Best Acting that year.[10]","References":"NotesBibliography","release_dates":"April 22, 1939 (1939-04-22) (US)|||||","Production":"Tallulah Bankhead originated the role of Judith Traherne in the Broadway production, which ran for 51 performances at the Plymouth Theatre,[4] before being cut short when Bankhead fell ill with a bacterial infection. Davis openly admitted in later years that she had emulated Bankhead in the role. In 1935, David O. Selznick wanted to cast Greta Garbo and Fredric March in the leads, but Garbo chose to play the lead in Anna Karenina instead.[1] In 1936, he offered the role to Merle Oberon, but contractual problems prevented her from doing the film.[1] When Bette Davis discovered the play in 1938, she shopped it to every producer on the Warners lot, and Hal Wallis bought the rights from Selznick for her, for $50,000, when director Edmound Goulding and producer David Lewis showed interest in the project.[1]Davis had recently ended affairs with William Wyler and Howard Hughes and her husband Ham Nelson had filed for divorce, and after the first few days of filming she begged to be released from her contract, claiming she was too sick to continue.[5] Producer Hal Wallis responded, \"I've seen the rushes – stay sick!\" She found comfort with Brent, who had just divorced Ruth Chatterton, and the two embarked on an affair that continued throughout filming and for a year – and three films – after.[3] Goulding shot the film in sequence, and the arc of Judith's relationship with Dr. Steele mirrored Davis' relationship with Brent.[3] Davis was later to say that she wanted to marry Brent, but thought that it wouldn't work out. Still, \"Of the men I didn't marry, the dearest was George Brent.\"[3]The tune, \"Oh, Give Me Time for Tenderness\" sung by Judith was written by Edmund Goulding and Elsie Janis. The voice of Vera Van was dubbed for Davis.Another scene for the film's ending was shot, but ultimately was deemed anticlimactic: after Judith's death, her horse was seen winning a race, and her stablehand Michael (Bogart) was shown crying. The scene met with negative response with sneak preview audiences and was cut.[6]The film premiered at Radio City Music Hall.","produced_by":"David Lewis","starring":"Bette Davis","running_time":"104 minutes","music_by":"Max Steiner","External links":"Streaming audio","edited_by":"William Holmes","written_by":"Casey Robinson"}